{
  "id": "17145",
  "title": "Font with horizontal accents",
  "forum": "Design",
  "tags": [

  ],
  "content": "I was just wondering if anyone knew offhand of some sans-serif faces with horizontal accute and grave accents as opposed to the more vertical polish-compatible ones. Thanks for your help.\n\n",
  "author": "<a href=\"/web/20110928140736/http://typophile.com/user/10658\" title=\"View user profile.\">Giordano</a>",
  "time": "<br>",
  "uid": "10658",
  "comments": [
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20110928140736im_/http:/typophile.com/files/deja.jpg)\n  \nI'm sure John Hudson would not approve, but it seemed like a good idea at the time.  \n(Panoptica Doesburg.)\n"
    },
    {
      "time": "",
      "content": "Do all the accents look the same, Nick?\n\nGiordano, I'm not sure I understand your question, by 'horizontal' do you mean more horizontal that e.g. the preferred Polish form (which is also a style of accent that one sees more and more in non-specifically Polish designs), or actually horizontal lines like Nick shows here?\n\nI think some of the discussion about accent angle has mistakenly focused on the Poles liking steep accents, because this is a style, as I note, that is not uncommon in e.g. contemporary French design, and is the model I follow for the default accents in all my designs. Rather, the focus should be on the Czech preference, which is the more distinct cultural preference, for quite flat accents. This is one of the reasons why, after my trip to Prague, I became convinced that the only way to set the Czech language is to use a Czech typeface. Veronika Burian's [Maiola](http://web.archive.org/web/20110928140736/http:/www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufacturer&displayfontid=FF.11497.0.0) is a good recent design in the Czech tradition that exhibits this form of accent.\n\n"
    },
    {
      "time": "",
      "content": "On the subject of accent angle in contemporary, non-culturally specific type design, the story of Matthew Carter's Fenway is quite interesting. The original Fenway has grave and acute accents with angles close to 45 degrees. When Maxim Zhukov asked if Matthew would donate copies of the fonts to use in the ATypI Country Delegates report a few years ago, Matthew supplied a modified version to set the Polish report, so that Polish names would be displayed with steeper accents. The publication used both sets of fonts, tailored to different nationalities, much to Adam Twardoch's delight. When we came to typeset the ATypI/Graphis publication _Language Culture Type,_ Maxim wanted to use Fenway again, and I went about making an OpenType version to facilitate the typesetting and added a number of diacritics for other languages not supported by the Matthew's fonts (e.g. Chinese and Arabic transliteration characters). Matthew at this point decided that he preferred the steeper accents he had made for the Polish fonts to the original forms, and so these became the default forms in the OpenType font used to set _Language Culture Type._\n\n"
    },
    {
      "time": "",
      "content": "_Do all the accents look the same, Nick?_\n\nAcute, grave, and circumflex are identical. But it's not fully \"monotonic\": dieresis and ring are distinct.  \nI figured that as the reductive design system of this font made no distinction between 5 and S, or O and 0, relying on context, then the same would be appropriate for the angled accents.\n\n_...the only way to set the Czech language is to use a Czech typeface._\n\nUnless you don't mind \"speaking\" with an accent.  \nI'm reminded of Stephen Banham's comment about being an Australian confronted with a lot of Gill Sans and always hearing an English voice.\n\n\\*\\*\\*\n\nWhy do the Czech's prefer a flatter accent? Is it because they have a preference for faces with a large x-height?\n\n\\*\\*\\*\n\nI came across a 1950s French setting of Bodoni the other day, and noticed that the acute was at a steeper angle than the grave. An interesting visual rendering of the difference between a sharp and a flat sound.\n\n"
    },
    {
      "time": "",
      "content": "The flatter accent allows for less leading and more economy. (You can cram more on a page.)  \nI tend to like the flatter look because it seems more clear as a diacritic and is less likely to be confused with a vertical ascender. The very straight vertical marks seem to hinder readability to me personally although I have no data to support it.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Well, to answer your questions, firstly I meant horizontal as in \"more horizontal...\". There are a few resons for this. Firstly, because of the space economy and the fact that nearly horizontal (or flatter, if you will) accents are easier to work with, especially for accented caps. You see, in French (from France), it is preferred to just leave the accents off caps. In Italian, the accent is replaced by an apostrophe after the letter (since the accents occur almost exclusively at the ends of words).\n\nHowever, in Quebec usage, caps are supposed to be accented as well. Besides that, I just like the freedom of having as many options as possible.\n\nThe second reason for the horizontal accents is that it's much closer to the way accents are handwritten. I don't think I've ever seen handwriting or printing with accents like those of most typefaces, but rather they are usually quite horizontal and take up the full width of the letter. So, I personally find that this style of accent is more natural.\n\nAs far as your 1950s French Bodoni, Nick, I can understand the disctiction between the two (since they can be seen as two distinct symbols rather than mirror images of each other).\n\nAnother weird thing about accents is Italian. It makes frequent use of the grave accent (to signify stress), but the accent is often replaced by an apostrophe (a carryover from the days of typewriters I guess), or, the accent is sometimes written toward the right side of the letter:\n\nSi può dire \"un bambino\", quindi la forma maschile sarà tronca  \nSi puo' [...] sara' tronca  \nSi puo` [...] sara` tronca\n\nIn printed and handwritten texts the first two are both common (the second one because some people are just too lazy to bother finding accents on their keyboards). The last one is just a variation on the placement of the accent (probably because people in the old days were too lazy to go backwards on their typewriter to type the accent <cite>over</cite> the letter) and is only seen in handwriting. For the record, only the actual accented letter is \"correct\", not that anyone takes heed.\n\nIn an all-caps setting, both of these would be common:\n\nSI PUO' [...] SARA' TRONCA\n\nSI PUÒ […] SARÀ TRONCA\n\nWhy? Probably just because Italians have to do everything in the most complicated way possible. Variety is the spice of life, after all...\n\nAnyway, in my limited experience with accents (I only speak French, Italian, and Spanish, so I can only speak from those viewpoints), I have come to the conclusion that while, on the surface, it seems like all these languages use the exact same accents (because we give the same name to the same direction of accent), in fact the preference of shape varies from language to language and country to country. I guess in a perfect world we would have several choices of accents to use, so that Poles, Czechs, Quebecers, and Italians, and the many other users of diactrical marks could all be contented.\n\nIn the meantime I need to create some tighly lead all-caps French for consuption in Quebec so... any suggestions?\n\n"
    },
    {
      "time": "",
      "content": "_You see, in French (from France), it is preferred to just leave the accents off caps._\n\nThis is a fairly recent and bad habit adopted as a result of the limitations of typewriters. If you look at older French books, you will see the accents on caps. If you look at quality French typesetting such as practiced by the Imprimerie nationale, you will see the accents on caps.\n\nThe accents on caps are almost always flatter than on the lowercase letters (unless the font is specifically Polish), so I guess you are looking for _very_ flat cap accents.\n\n"
    },
    {
      "time": "",
      "content": "_...fairly recent_\n\nIn typographic terms, recent indeed, i.e. any time since typewriters were introduced in the 1870s.\n\n"
    },
    {
      "time": "",
      "content": "I think the accents in Panoptica Doesburg are fine,  \nappropriate even. But -alluding to that other thread-  \nthere's a difference between display and text faces.\n\n\\> Unless you don’t mind “speaking” with an accent.\n\nI love accents (at least the spoken kind) but only in their place.  \nWhy would a Czech author writing for Czech readers want have  \nan accent? That just makes him seem like he thinks he's too good  \nfor them.\n\n\\> Is it because they have a preference for faces with a large x-height?\n\nThey actually prefer small x-heights I think.\n\n\\> I came across a 1950s French setting of Bodoni the other day,  \n\\> and noticed that the acute was at a steeper angle than the grave.\n\nPossibly a chirographic artefact.  \nIt wasn't simply an italic though, was it?\n\n\\> because of the space economy and the fact that nearly  \n\\> horizontal (or flatter, if you will) accents are easier  \n\\> to work with, especially for accented caps.\n\nBut:  \n1) According to Mandel at least, \"authentic\" French requires  \na small x-height; and this gives more room to the accents.  \n2) That's why good fonts have less steep accents on the caps.  \nAnd good fonts have short caps too, which helps even more.\n\n\\> in French (from France), it is preferred to just leave the accents off caps.\n\nNot by people who know that that's a mistake.\n\n\\> The second reason for the horizontal accents is that  \n\\> it’s much closer to the way accents are handwritten.\n\nWhich is however essentially moot.\n\n\\> the preference of shape varies from language  \n\\> to language and country to country.\n\nIndeed. And we should relish that!\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant, I agree with everything you said except this:\n\n\"<cite> &gt; in French (from France), it is preferred to just leave the accents off caps.</cite>\n\nNot by people who know that that’s a mistake.\n\nWell, the French do sheepishly follow the 40 sellout authors and poets of the Academie Francaise (<cite>les Immortels</cite>), but I tend to rebel against linguistic fascism such as 40 people telling me how to speak or write. See how I just used a split infinitive? Tisk tisk...\n\nWhat I'm saying is, it's still common and it's more interesting to me.\n\nFlat accents are more elegant (see Estee Lauder's logo) and more readable, in my opinion.\n\nAnyway, here are a few examples of what I mean. See how the accent isn't completely flat, but is fairly horizontal:\n\n[http://i23.photobucket.com/albums/b396/LaurierSpain05/Accents.jpg](http://web.archive.org/web/20110928140736/http:/i23.photobucket.com/albums/b396/LaurierSpain05/Accents.jpg \"http://i23.photobucket.com/albums/b396/LaurierSpain05/Accents.jpg\")\n\n"
    },
    {
      "time": "",
      "content": "\\> it’s still common and it’s more interesting to me.\n\nI'm all for reform, but laziness or abandonment to  \ncultural impoverishment to me is not interesting.\n\n\\> Flat accents are more elegant (see Estee Lauder’s logo)  \n\\> and more readable, in my opinion.\n\nDepending on what you mean by flat,  \nI agree and disagree in varying ways...\n\nI think <cite>totally</cite> flat accents <cite>can</cite> be more elegant, like in a light monoline face; but steep accents are more elegant to me in a contrasty serif face for example. As for almost-totally flat accents, I don't see any elegance at all - to me they seem... confused more than anything else. And when it comes to readability (a totally different animal than the display stuff above) even only moderately-flat accents can leave the reader guessing (and guessing in a non-productive direction). On the other hand when accents are too prominent they can be disruptive of readability,  \nI agree (assuming that's what you're thinking).\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "It's not much of a difference after all.\n\n ![](http://web.archive.org/web/20110928140736im_/http:/typophile.com/files/deja2.jpg)\n\n"
    }
  ]
}
