{
  "id": "17149",
  "title": "Neo Tech",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am looking for something like [Neo Tech](http://web.archive.org/web/20110601212247/http:/www.fonts.com/FindFonts/RecentReleases/2004/09-01-2004.htm) but with french accents. (é, è, à, î, â, etc)\n\n",
  "author": "<a href=\"/web/20110601212247/http://www.typophile.com/user/8785\" title=\"View user profile.\">sebsan</a>",
  "time": "<br>",
  "uid": "8785",
  "comments": [
    {
      "time": "",
      "content": "But aren't they there? Here are the Neo Tech Regular gylphs as they show in my InDesign. I don't know French very well, so I don't know what's missing.\n\n ![](http://web.archive.org/web/20110601212247im_/http:/typophile.com/files/neotech_reg.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Oh, but I downloaded a pdf and it only had the basic non-accented characters. I don't get it?!\n\n"
    },
    {
      "time": "",
      "content": "I don't know if this is ethical, but could you generate a pdf for me that says —Habitat & Énergie—in Neo Tech?  \nNo worries if you can't I understand.  \nCheers  \nSeb\n\n"
    },
    {
      "time": "",
      "content": "Have you seen this?  \n [http://www.fonts.com/FindFonts/detail.htm?query=neo+tech&pid=415100&page...](http://web.archive.org/web/20110601212247/http:/www.fonts.com/FindFonts/detail.htm?query=neo+tech&pid=415100&page_id=603&grab_id=0 \"http://www.fonts.com/FindFonts/detail.htm?query=neo+tech&pid=415100&page\\_id=603&grab\\_id=0\")\n\nThen click the \"see full size graphic\"\n\n"
    },
    {
      "time": "",
      "content": "The thing is that I have to make the indentity for a trade fair. The theme is green energy and sustainable development in architecture.\n\nAny idea for a typeface would be welcome.\n\nthanks  \nSeb\n\n"
    },
    {
      "time": "",
      "content": "_\\> I don’t know if this is ethical, but could you generate a pdf for me that says --Habitat & Énergie--in Neo Tech?_\n\nActually it isn't, Sébastien, just as it wouldn't be ethical for someone to copy the identity you're designing for that trade fair and selling it to the client behind your back.\n\nFurthermore you can use the preview function on websites like [FontShop.com](http://web.archive.org/web/20110601212247/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontpackage&startrow=1&records=&currpage=1&totalrecords=24&displayfontid=C.117387.0.0&fontRendererText=Habitat+%26+%C3%89nergie) to generate a proposal, but if you end up using the typeface you still have to purchase a license.\n\nDon't do anything you might regret afterwards, and try no to forget that type designers need an income to live as well. Thank you for understanding.\n\n"
    },
    {
      "time": "",
      "content": "Obviously I intend to purchase the license if I use the font. I only wanted to set these two words in Neo so my client could have an idea of what it's going to look like. There isn't much I can do with that pdf but use it to convince my client to buy a license.  \nI can see why my request could be a problem on the other hand I am only trying to get the finance to buy the font\n\n"
    },
    {
      "time": "",
      "content": "A single weight of Neo Sans costs $42. That's not a huge investment...\n\n"
    },
    {
      "time": "",
      "content": "Yves, what is unethical about someone who has a legitimate license for Neo tech providing Sebastien with a PDF of those two words or, for that matter, any other text? If I own a license to a font, I can use it in any way that the license permits, and that generally includes setting text either for myself or a client, for a fee or gratis. Unless the license specifically prohibits embedding in PDF files, I don't see anything wrong with what Sebastien is asking for. He is not asking for a copy of the font. He is asking for someone to do a spot of typesetting for him.\n\n"
    },
    {
      "time": "",
      "content": "I don't think it's unethical.  \nIn fact this type of thing naturally leads to good business: if the person makes too many requests from somebody who has the font, it will more likely lead to a purchase of the font. If you prevent this sort of thing, the person will either buy nothing or another font.\n\nhhp\n\n"
    }
  ]
}
