{
  "id": "17159",
  "title": "Miso",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": " ![](http://web.archive.org/web/20150414031629im_/http:/typophile.com/files/Miso.png)\n\nDear Forum.  \n\"Miso\" is a lettering font intended for architects drawings. It is inspired by the standardized typeface \"ISO\", but with a blurred and yet geometric look. All three weights are derived from the same strokes - only line thickness vary.  \nI would very much appreciate comments on the glyph designs. (Haven't worked on spacing yet.)\n\nThanks!\n\n| Attachment | Size |\n| --- | --- |\n| [miso-v01.pdf](http://web.archive.org/web/20150414031629/http:/typophile.com/files/miso-v01.pdf) | 175.83 KB |\n\n",
  "author": "mårten",
  "time": "9 Jan 2006 — 12:40pm",
  "uid": "10907",
  "comments": [
    {
      "time": "9 Jan 2006 — 3:51pm",
      "content": "It is most interesting in the lightest weight as that is where the \"blown-out\" look appears the most. Could be fun for display purposes. The boldest weight seems the least interesting as it is the most normal.\n\n"
    },
    {
      "time": "9 Jan 2006 — 7:29pm",
      "content": "The light weight looks like the regular run thru a bold filter with negative paramaters, eg: vertical -20, horizontal -20, or similar. I like the regular and bold because they're true to the stroke you get from an ISO stencil traced with a technical pen. That's just my personal preference; they're more satisfying to my mind than the light.\n\nMiss Tiffany is right tho---the light weight is the most interesting, more visually stimulating and intriguing because the structures are alluded to with the loose-fitting \"blown-out\" finish, my term for that is usually \"eroded\".\n\nFor the light weight I recommend reducing the goop in the crevices and nooks of the diagonals, and the **t** and **f** junctions. Make it just a bit cleaner without losing the eroded charm. It looks too much like the product of a bold filter in reverse; rework it to make it look like the work of human hands.\n\nThe top bar of the Euro is longer in keeping with the defacto structure of Euro symbols. Extend it forward a bit more to exaggerate and make that structure clearer.\n\nOne question to consider if this is going to be a commercial release: Are there many other ISO-style fonts around? I only had enuff time to find one --- [http://www.myfonts.com/fonts/urw/isonorm/](http://web.archive.org/web/20150414031629/http:/www.myfonts.com/fonts/urw/isonorm/ \"http://www.myfonts.com/fonts/urw/isonorm/\")\n\nj a m e s\n\n"
    },
    {
      "time": "10 Jan 2006 — 8:09am",
      "content": "Thanks Tiffany and James for your comments!  \nI thought I should show you this as well:\n\n ![](http://web.archive.org/web/20150414031629im_/http:/typophile.com/files/miso-earlier.gif)\n  \n\n ![](http://web.archive.org/web/20150414031629im_/http:/typophile.com/files/miso-earlier2.gif)\n  \nThis is an earlier version of the typeface with an even more blurred look. Maybe it would make the Bold and Regular more interesting? I threw it out because I wanted more consistency between the characters - perhaps a mistake?\n\nThanks!  \n/Mårten\n\n"
    },
    {
      "time": "10 Jan 2006 — 8:53am",
      "content": "The filling in of the characters is the thing which makes this typeface interesting. No reason to throw it out. Without it, you are competing with any other rounded Din-like typeface.\n\n"
    },
    {
      "time": "10 Jan 2006 — 11:31am",
      "content": "Prexactly, Miss Tiff. The other good thing about the grunginess is the impression of realism. Clean strokes aren't what you'd get from a real technical pen tracing a stencil. The blurry outlines are not true to ink & pen effects, but they suggest those artefacts.\n\nThe work required to make a clean version would be equivalent to rebuilding the font from scratch, producing a font that already has many rivals.\n\nOne option you could try is reworking the irregularities to differentiate them. That will give you a more convincing pen-drawn look and increase the font's appeal and marketability.\n\nj a m e s\n\n"
    },
    {
      "time": "10 Jan 2006 — 12:18pm",
      "content": "Bleah. It was 6:45 AM when I wrote the above and my brain just wasn't awake. My point was, the \"pen & ink detail\" may not be accurate but it is suggestive, so the next step is to introduce variety to make it look more convincing :^)\n\nj a m e s\n\n"
    },
    {
      "time": "10 Jan 2006 — 1:19pm",
      "content": "Yes, I should stick to the earlier design. Thanks miss Tiffany for making me realize this!  \nJames, thanks for your comments. I think you're right about the Light weight needing special adjustments to look more in ballance. I guess I was carried away by the idea of using identical strokes for all weights. I'm not convinced though about the idea of creating irregularities -- do you think I would still be able to keep the geometric look?  \nSomething I would like to do is adding more colour to the characters without joints or corners e.g. 'O' and 'S' as they now all look too skinny. Any suggestions on how?\n\nDo the weights work? Regular has the thickness approximately 1/10 of the Cap height = 60 units. Light=36 and Bold=96.\n\n(To give you the full story: I was originally inspired by the rather more elaborate typeface [Atom](http://web.archive.org/web/20150414031629/http:/www.mindcandy.com/fonts/radiateur/fonts/atom1.html) by Jean-Jacques Tachdjian).\n\nThanks again for your comments! /Mårten\n\n"
    },
    {
      "time": "10 Jan 2006 — 10:25pm",
      "content": "_I’m not convinced though about the idea of creating irregularities — do you think I would still be able to keep the geometric look?_\n\nDefinitely. It shouldn't be a problem as long as you keep the letter structures as they are. The finish (surface detail) can be modulated without flipping the design as a whole out of its basic genre. It will still be geometric as long as you keep the surface detail subtle.\n\n_Something I would like to do is adding more colour to the characters without joints or corners e.g. ‘O’ and ‘S’ as they now all look too skinny. Any suggestions on how?_\n\nVary the stroke width on those letters a bit. You could make the variations abstract, or shape the strokes to look like natural variations in line thickness you'd get from a technical pen. Also try adding blobs: \"O\" can take a blob inline that would look like an accumulation of ink at the point where the pen started tracing, or where the pen stopped; the blob could be elongated (long). For \"S\", maybe thicken up the stroke in one part, along the diagonal spine or in one of the curves; or put a blob at either end of the stroke, one smaller than the other; or a combination of thickened stroke and blob(s).\n\n_Do the weights work? Regular has the thickness approximately 1/10 of the Cap height = 60 units. Light=36 and Bold=96._\n\nThe weights are good because they're different enough to make a clear difference in use. In a text setting the reader's eye would see a positive difference in weight.\n\n**Atom** is much more \"jarred\", stylized and individual, but the stylization is a bit too forced or superficial for my taste. How much you jarr a font depends on how specialized you want it to be, and limits its uses. Your Miso is fairly normal (standard forms), and you might want to think about stylizing it more to make it stand out and give it its own unique appeal. But that will take time and experiment. One quick mod is to make some of the bowls on p, q, g different sizes; pull one or two of them up from the baseline; bowl letters don't have align exactly with the baseline and x-line; make the size variation small and people don't notice, but it helps make the font interesting. Also consider adding curls to some letters, like l, i, k, h, m, n, u.\n\nAll the best with this face Mårten\n\nj a m e s\n\n"
    },
    {
      "time": "12 Jan 2006 — 1:46pm",
      "content": "Thank you very much James for your comments and useful tips!\n\nI think using varying stroke width would do the job. Perhaps ink blobs would be to stretch it too far; I like the 'blown out' or 'eroded' look but I don't want it to look like it was actually hand drawn and scanned (perhaps this is not what you meant).\n\nThe way I'll try to do it -- technically -- is to actually draw two strokes next to each other where I want i thicker line. These two lines may also differ slightly in angle.\n\nJust for reference I'm posting two ISO examples:\n\n ![](http://web.archive.org/web/20150414031629im_/http:/typophile.com/files/Nestler-ISO-stencil.png)\n  \nThe first example is (obviously) hand drawn with a stencil, deliberately clumsy.\n\n ![](http://web.archive.org/web/20150414031629im_/http:/typophile.com/files/Autodesk-ISO-CP.png)\n  \nThe second example is made in a CAD application in three different weigths, corresponding to the Miso weights.\n\n ![](http://web.archive.org/web/20150414031629im_/http:/typophile.com/files/Parasta%20ennen.png)\n  \nI'm also posting an example of some 'stamped on' numbers that I like.\n\nI'll do some more work on Miso...\n\nThanks again! /Mårten\n\n"
    },
    {
      "time": "12 Jan 2006 — 1:56pm",
      "content": "The stencilled letters -- and the stamped -- are much more interesting than those from the CAD. Monostroke typefaces are generally boring because they are too perfect, the geometry leaves no room for imperfection. And we all know -- or should know -- that beauty is in the imperfections.\n\n"
    },
    {
      "time": "2 Apr 2006 — 11:46am",
      "content": "(11 weeks later...)\n\nDear Forum,\n\nLately I have worked on a \"stripped down\" version of Miso using only the basic strokes of each character. I also put the characters into TypeTool to do widths and kerning.\n\n ![](http://web.archive.org/web/20150414031629im_/http:/typophile.com/files/miso-v02.png)\n\n[http://www.omkrets.se/typografi/miso-v02.pdf](http://web.archive.org/web/20150414031629/http:/www.omkrets.se/typografi/miso-v02.pdf \"http://www.omkrets.se/typografi/miso-v02.pdf\")\n\nThe way I've done the different weights is to use the same strokes and only vary the thickness (this is the way type works in many CAD-programs) which means the baseline is higher in \"light\" and lower in \"Bold\". Is it ok to do this in type design?  \nComments are most welcome! (Also on the design in general)  \nThank you very much!\n\nMårten\n\n"
    },
    {
      "time": "2 Apr 2006 — 11:50am",
      "content": "_…which means the baseline is higher in “light” and lower in “Bold”. Is it ok to do this in type design?_\n\nInteresting. One does this normally with the x-height, rather than with the baseline (bold lowercase letters are then a little taller than the light's… but the caps remain the same size).\n\n"
    },
    {
      "time": "2 Apr 2006 — 12:01pm",
      "content": "\\> One does this normally with the x-height, rather than with the baseline\n\nYes, because:  \n1) The baseline is more of a fixed thing in typography,  \nboth visually and in terms of \"protocol\" so to speak.  \n2) There are more serifs (horizontal elements) on the baseline.\n\nBTW, when it <cite>is</cite> done at the x-line: it's to compensate for the optical illusion of darker forms looking shorter, not to somehow center things; and doing so causes the darker parts to be higher by a lot less than what centering would do (so most of the shift is towards the inside of the x-height).\n\nHere's a somewhat related discussion:  \n [http://typophile.com/node/15204](http://web.archive.org/web/20150414031629/http:/typophile.com/node/15204 \"http://typophile.com/node/15204\")\n\nI think Mårten's idea could work -in fact well- if the font as  \na whole is <cite>centered</cite> on a line, let's say at half the x-height.\n\nhhp\n\n"
    },
    {
      "time": "12 Nov 2006 — 1:30pm",
      "content": "Dear all. **MISO** is now available as TrueType in three weights. Enjoy!  \n [http://omkrets.se/typografi/MISO-typeface.zip](http://web.archive.org/web/20150414031629/http:/omkrets.se/typografi/MISO-typeface.zip \"http://omkrets.se/typografi/MISO-typeface.zip\")\n\n ![](http://web.archive.org/web/20150414031629im_/http:/typophile.com/files/miso-regular-608_4059.png)\n\n"
    },
    {
      "time": "10 May 2007 — 9:30am",
      "content": "Hi mårten.\n\nI like your font very much. It's one of the most interesting monospaced fonts I've seen.  \nI find it ideal for legends.\n\nCould you make it available again?\n\nThank's in advance,\n\njr. silva\n\n"
    },
    {
      "time": "26 Jun 2007 — 11:43am",
      "content": "MISO is available for [download](http://web.archive.org/web/20150414031629/http:/omkrets.se/typografi/) again. I'm sorry it was down for a while. /Mårten\n\n ![](http://web.archive.org/web/20150414031629im_/http:/typophile.com/files/miso_promotion1_5200.jpg)\n\n"
    },
    {
      "time": "29 Jun 2007 — 1:58am",
      "content": "Seems I'm not the only one with a sans font named after Japanese food. Nice stuff you've got there.\n\n"
    },
    {
      "time": "4 Jul 2007 — 7:00am",
      "content": "Thank's for upploading it again mårten.  \nI really like your font ;)\n\n"
    },
    {
      "time": "5 Jul 2007 — 11:35am",
      "content": "Yes, very nice! And thank you for sharing!\n\n"
    },
    {
      "time": "27 Apr 2009 — 6:08am",
      "content": "Miso in use in the [Panasonic booth at Milan Design Week](http://web.archive.org/web/20150414031629/http:/www.designboom.com/weblog/cat/8/view/6188/naoto-fukasawa-patricia-urquiola-panasonic-at-milan-design-week-09.html).\n\n![](http://web.archive.org/web/20150414031629im_/http:/www.designboom.com/cms/images/-a01massimo/asd.jpg)\n\n![](http://web.archive.org/web/20150414031629im_/http:/www.designboom.com/cms/images/-a01massimo/p28.jpg)\n\n"
    },
    {
      "time": "8 Jan 2012 — 12:50pm",
      "content": "Dear all,  \n the download page for Miso has changed to this one:  \n [http://martennettelbladt.se/miso/](http://web.archive.org/web/20150414031629/http:/martennettelbladt.se/miso/)\n\nLight, Regular and Bold are free.  \n [\n ![](http://web.archive.org/web/20150414031629im_/http:/typophile.com/files/Miso-Light-Regular-Bold_6702.png)\n ](http://web.archive.org/web/20150414031629/http:/martennettelbladt.se/miso/)\n\nSkinny and Chunky cost money.  \n [\n ![](http://web.archive.org/web/20150414031629im_/http:/typophile.com/files/Miso-Skinny-Chunky_6590.png)\n ](http://web.archive.org/web/20150414031629/http:/martennettelbladt.se/miso/)\n\nBest\n\n"
    },
    {
      "time": "28 Jan 2012 — 8:42am",
      "content": "<cite>&gt; Skinny and Chunky cost money.</cite>\n\n€9? Not a lot of money, you might add. :)\n\n"
    },
    {
      "time": "28 Jan 2012 — 10:23am",
      "content": "This gives me an idea: maybe font weights should  \nbe priced according to their distance from Regular?\n\nhhp\n\n"
    },
    {
      "time": "1 Feb 2012 — 6:05pm",
      "content": "\\> This gives me an idea: maybe font weights should  \nbe priced according to their distance from Regular?\n\nThe first second or so after I read this I thought it was rather absurd, but there is some logic in there. I just wonder why Black or Thin should cost more than Regular. I think maybe the 3 master weights should be the same price and the further you get away from those, the lower the price gets.\n\nFor example:  \nThin — $25 (master weight)  \nExtra Light — $22  \nLight — $20  \nRegular — $25 (master weight)  \nMedium — $22  \nSemibold — $20  \nBold — $22  \nBlack — $25 (master weight)  \nUltra Black — $22\n\nI don't know if it's normal to consider 'Black' the master weight when there is another weight thicker than that but that's besides the point. It only kind of works in very large font families though. I actually think if there will be variation in the price for fonts within a font family then they should be priced according to demand, shouldn't they?\n\nFor example:  \nThin — $20  \nExtra Light — $15  \nLight — $20  \nRegular — $25  \nMedium — $20  \nSemibold — $20  \nBold — $25  \nBlack — $20  \nUltra Black — $15\n\nIt actually kind of follows the system I just explained but it takes Regular and Bold as the primary and most essential weights and pretty much the further you go away from those master weights the lower the price because people just don't use them often; the exception would be 'Thin' because it's useful for display purposes. What do you think?\n\n"
    },
    {
      "time": "1 Feb 2012 — 6:18pm",
      "content": "mårten, I like the typeface very much. I'm not a big fan of \"modern\" typefaces without spurs, but the condensed and balanced appearance makes this somewhat of a treasure among these \"abstract\" typefaces. I'm a bit disappointed to see that the end result appears to be monolinear. What happened with the initial concept? I thought that first Light weight was very cool. The old version of the Bold weight you showed looked consistent with that Light weight. I would perhaps make those available as a font family brother of Miso.\n\n"
    },
    {
      "time": "1 Feb 2012 — 9:54pm",
      "content": "\\> the further you go away from those master weights the  \n\\> lower the price because people just don't use them often\n\nActually I was thinking the other way around! This is because  \ncasual users are satisfied with the main styles, but power users  \nneed the flexibility afforded by the complete system and/or  \nfinely targeted weights.\n\nAnd this would be an extension of current practice: among fonts  \nthat are not totally free, the \"rule\" is to give away the Regular,  \nand charge the normal prices for the rest.\n\nhhp\n\n"
    },
    {
      "time": "2 Feb 2012 — 2:00am",
      "content": "Or you could charge proportionally more along the weight axis as a sort of eco-tax for toner/ink used ;-)\n\n"
    },
    {
      "time": "2 Feb 2012 — 8:55am",
      "content": "I guess there are so many logical systems to come up with that in the end it might be better to just stick with one price for all fonts.\n\nThe last one mentioned by hrant is one I actually have seen to some extent, of which the Miso typeface as the main fonts are free and the display fonts are for purchase. I do find that logical, but if the thin and thick weights are going to cost more than Regular and Bold then I honestly feel a bit hesitant to buy those weights at all. I'm glad that fonts within a family are priced the same so I won't have to deal with all this confusion.\n\n"
    },
    {
      "time": "2 Feb 2012 — 9:18am",
      "content": "Indeed, simplicity does have monetary value itself!\n\nhhp\n\n"
    },
    {
      "time": "28 Mar 2012 — 9:51am",
      "content": "Thank you for sharing this nice information, I will visit your website again in future regardfing my development research and analysis.  \n [Web Development Services Texas](http://web.archive.org/web/20150414031629/http:/www.iespro.com/)\n\n"
    },
    {
      "time": "11 Apr 2012 — 7:24am",
      "content": "Whenever this is not encouragement enough to try the GoToMeeting free trial, then absolutely nothing could be. Virtually every skillful business venture currently needs an efficient web conferencing tool to connect with consumers as well as enable intra-organizational communication and [GoToMeeting free trial](http://web.archive.org/web/20150414031629/http:/onlinemeeting.forumfree.it/?t=60657873), with its simple to implement and use features and its established marketplace merit, is the typical choice for all those hoping to progress the scale of wealth and reputation. The greatest way to realize this for your own benefit is to try the free of cost, minimal period version and discover for yourself the most current realm of online interaction. Could be fun for display purposes. The boldest weight seems the least interesting as it is the most normal. Make it just a bit cleaner without losing the eroded charm. Extend it forward a bit more to exaggerate and make that structure clearer. The other good thing about the grunginess is the impression of realism. I guess I was carried away by the idea of using identical strokes for all weights. It will still be geometric as long as you keep the surface detail subtle. But that will take time and experiment. These two lines may also differ slightly in angle. I also put the characters into TypeTool to do widths and kerning. MISO is now available as TrueType in three weights. I just wonder why Black or Thin should cost more than Regular. It only kind of works in very large font families though. The old version of the Bold weight you showed looked consistent with that Light weight. I would perhaps make those available as a font family brother of Miso. Contact Us for sponsorship opportunities.\n\n"
    },
    {
      "time": "11 Apr 2012 — 7:24am",
      "content": "Whenever this is not encouragement enough to test the GoToMeeting free trial, then very little might be. Every competent business venture currently requires an efficient web conferencing tool to touch base with buyers as well as enable intra-organizational interaction and [GoToMeeting free trial](http://web.archive.org/web/20150414031629/http:/onlinemeeting.forumfree.it/?t=60657873), with its simple to comprehend and use features and its established marketplace worthiness, is the natural choice for all those hoping to progress up the ladder of success and celebrity. The ideal strategy to know this for your self is to try the cost free, restricted period version and discover for yourself the most current arena of online transmission. Could be fun for display purposes. The boldest weight seems the least interesting as it is the most normal. Make it just a bit cleaner without losing the eroded charm. Extend it forward a bit more to exaggerate and make that structure clearer. The other good thing about the grunginess is the impression of realism. I guess I was carried away by the idea of using identical strokes for all weights. It will still be geometric as long as you keep the surface detail subtle. But that will take time and experiment. These two lines may also differ slightly in angle. I also put the characters into TypeTool to do widths and kerning. MISO is now available as TrueType in three weights. I just wonder why Black or Thin should cost more than Regular. It only kind of works in very large font families though. The old version of the Bold weight you showed looked consistent with that Light weight. I would perhaps make those available as a font family brother of Miso. Contact Us for sponsorship opportunities.\n\n"
    }
  ]
}
