{
  "id": "17151",
  "title": "Pre-computer era data graphics",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello,\n\nI’m curious as to what charts and graphs looked like before computers were around to create them. I’m less interested in the how than in the style, or even if data was presented graphically at all. Could it be that we only have pie-charts because, all of a sudden, Xcel appeared and allowed us to do it?\n\nWhile there seems to be plenty of examples of pre-digital era typography, photography, cartography or any other kind of ‘-ography’, data design is almost non-existant (in my knowledge at least, I realise this could be my failing, not the graphic world’s)\n\nDoes anyone have any examples of data graphics, or any kind of history of this aspect of graphic design?\n\nTa,  \nAnthony\n\n(Sorry, I realise this isn’t typography as such, but is rather a related discipline.)\n\n",
  "author": "state505",
  "time": "9 January, 2006 - 5:52am",
  "uid": "4971",
  "comments": [
    {
      "time": " 9 January, 2006 - 6:39am",
      "content": "[http://www.edwardtufte.com/tufte/](http://web.archive.org/web/20060222142924/http:/www.edwardtufte.com/tufte/)\n\n"
    },
    {
      "time": " 9 January, 2006 - 6:39am",
      "content": "I can’t really recommend any direct sources, but the work of Edward Tufte may take you in the right direction\n\n[http://www.edwardtufte.com/tufte/](http://web.archive.org/web/20060222142924/http:/www.edwardtufte.com/tufte/)\n\nHis area of expertise is the visual display of information and he works from historical as well as contemporary examples. His writing is a must for anyone who needs to display information visually.\n\n"
    },
    {
      "time": " 9 January, 2006 - 6:56am",
      "content": "You could probably do well to pick up a bunch of old National Geographic magazines. Some beautiful infographics in their early (pre-computer) issues.\n\nSeeing the Edward Tufte work that’s already been suggested certainly reminded me of NG… and you can usually find a stack of them for cheap at a local thrift store.\n\n"
    },
    {
      "time": " 9 January, 2006 - 7:22am",
      "content": "If you are going to look at Tufte, you must view the other side and look at [Nigel Holmes](http://web.archive.org/web/20060222142924/http:/www.nigelholmes.com/home.htm).  \nHis website features his more up-to-date computer based work, but his work for Time magazine in the late 70s and 80s set the standard for modern illustrative info-graphics. Tufte has called him a chartoonist, and dismisses his approach, and you will have to speak with Nigel to get his opinion on Tufte. Still there is alot more of Holmes work out there in the work-a-day world than there is Tufte’s.\n\n"
    },
    {
      "time": " 9 January, 2006 - 7:34am",
      "content": "We did thousands of charts and graphs before computers. It took longer drawing the line work by hand (ruling pen and compass). We used Amberilth or Rubylith film to cut layers of color and tone separations for camera.  \nIn those days, if someone came back with data changes, you charged them an arm and a leg so there was less of the hourly changes of data than there is today. Look mat any annual reports done pre 1986 and you will see.  \nThe big difference was that because it was laborious, it was not overdone as it tends to be today.\n\nChrisL\n\n"
    }
  ]
}
