{
  "id": "17198",
  "title": "1st post::custom logo\\>font?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi All,\n\nIn the past year, I've developed a passion for typography and graphic design, and am looking forward to exploring this site more often. I'm still new to all this, but what I'm learning will compliment my work in the film industry. I'm in the process of starting up my own company and customized a seven letter logo from an existing font in Illustrator CS to create my own version, reshaping the letters the way I wanted them. In order to utilize the pre-built text effects in my motion graphic software, I need to somehow convert the custom logo text into a \"font\".\n\nTed at Fontlab was kind enough to route me here. He explained that this is not a simple operation, and as it's a one time thing, it makes the most sense to try and hire a typographer. Would anyone be kind enough to shed light on what's involved, and what the costs might be?\n\nThanks in advance,  \n~Chris\n\n",
  "author": "entelechy",
  "time": "10 Jan 2006 — 10:52pm",
  "uid": "10937",
  "comments": [
    {
      "time": "10 Jan 2006 — 11:53pm",
      "content": "Well, first, let's make sure nobody's talking at cross purposes.\n\nIf I understand you correctly, you want to take the seven letter shapes that make your logo and drop them into an otherwise empty font, so that the text effects can work with it. I think anybody with font software can do that without much trouble.\n\nI think Ted might have been thinking that you wanted to expand your custom logo into a complete typeface of the same style with a full character set.\n\n"
    },
    {
      "time": "11 Jan 2006 — 2:53pm",
      "content": "Thanks Cerulean - yes that exactly right. I've been in contact with a referral through Fontlab, Joseph Treacy ( [www.treacyfaces.com](http://web.archive.org/web/20131021045757/http:/www.treacyfaces.com/ \"www.treacyfaces.com\")), and think we may have worked something out. He seems great, and Fontlab has referred a lot of business to him, so hopefully I'm all set. If, for whatever reason, it doesn't work out, I'll check back to see if I can find someone here.\n\nRegards,  \n~Chris\n\n"
    },
    {
      "time": "11 Jan 2006 — 9:33pm",
      "content": "Just adding a follow-up...Joseph was terrific and everything worked perfectly. I'd highly recommend him.\n\nCheers,  \n~C\n\n"
    },
    {
      "time": "17 Jan 2006 — 3:21pm",
      "content": "Since you're in Agoura Hills...  \n [http://typophile.com/node/15756](http://web.archive.org/web/20131021045757/http:/typophile.com/node/15756 \"http://typophile.com/node/15756\")\n\nhhp\n\n"
    }
  ]
}
