{
  "id": "17215",
  "title": "Flukst",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "Hello, it's my first day here. I wonder if I could get some piece of advice on a font I've been playing with for some time. I'm not sure about the widths of 'A', 'Z' and 'z'. 'K' and 'k' might be a bit too wide, but I sort of like them. Shouldn't 'K' be more consistent with 'R'?  \nThe numerals.. are they legible enough?  \nAny feedback appreciated.\n\n[http://komercja.com/flukst/f1.htm](http://web.archive.org/web/20150414102514/http:/komercja.com/flukst/f1.htm \"http://komercja.com/flukst/f1.htm\")\n\n",
  "author": "Magneto",
  "time": "11 Jan 2006 — 4:42pm",
  "uid": "10945",
  "comments": [
    {
      "time": "12 Jan 2006 — 2:02pm",
      "content": "Last post in Critique » Bitmap Text forum: 4 weeks 12 hours ago  \nDoes my post need to be answered at least once for the clock to start noticing it? Just checking...\n\n"
    },
    {
      "time": "12 Jan 2006 — 2:55pm",
      "content": "First thing: if this is for setting paragraphs (as opposed to buttons and such) make your interletter spacing 2 pixels, not 1. This might seem counter-intuitive, but it's the key to readability (at any PPEM above 9, especially for a widish font like this, especially at 1-pixel stems). If you're worried about economy (which applies a lot less to [onscreen] text than buttons) then it's actually better to make your letters narrower.\n\nI might give the lc ascenders one more pixel (and then raise the bar of the \"f\").  \nBut leave the cap height where it is.\n\nMake the \"t\" and the \"f\" wider.  \nThe \"f\" doesn't need more right sidbearing though.\n\nCaps: the \"R\", \"X\" and \"Z\" are unhappy. The \"N\" is too wide.  \nIf you're worried about the \"A\" looking too narrow, lower its bar.\n\nThe numerals are actually very very good.  \nYou might just try lowering the waist of the \"4\".\n\nNo time to look at the non-alphanumerics, sorry.\n\nhhp\n\n"
    },
    {
      "time": "13 Jan 2006 — 4:19pm",
      "content": "Interletter spacing will be 2px in the extended set.  \n\"t\" and \"f\" wider - good idea. That's probably one of the tiny details that decide about legibility.  \nNot so sure about extended ascenders, will have to try. \"X\" - I didn't think about it this way before, but every font I look at now has the bars cross in the middle, I guess I must be doing something against the rules there.  \nI'm considering lowering \"R\" and \"P\"'s waist.  \nAs for \"A\", the bar was lower before and I thought that raising the bar actually \"stretched it's legs\". I'd better leave it as it's now.  \nThank you for your hints, they refreshed my view at the font.\n\n"
    },
    {
      "time": "13 Jan 2006 — 6:14pm",
      "content": "[http://komercja.com/flukst/f2.htm](http://web.archive.org/web/20150414102514/http:/komercja.com/flukst/f2.htm \"http://komercja.com/flukst/f2.htm\")\n\nA few corrections made. I'm still not sure about the \"R\".\n\n"
    },
    {
      "time": "12 Mar 2006 — 12:52pm",
      "content": "Most recent Flukst update, can be tested online now:  \n [http://komercja.com/flukst/](http://web.archive.org/web/20150414102514/http:/komercja.com/flukst/ \"http://komercja.com/flukst/\")\n\nComments welcome.\n\n"
    },
    {
      "time": "12 Mar 2006 — 1:21pm",
      "content": "Sorry, only time for two quick observations:  \n1) In the Extended the blank space needs one more pixel.  \n2) Since the Extended (more like Loose) is better, call  \nit the Regular, and the other one Tight or something.\n\nhhp\n\n"
    },
    {
      "time": "12 Mar 2006 — 4:00pm",
      "content": "Thank you, Hrant!  \nI added one pixel.. seems to have helped a little.  \nTo tell the truth, I don't like the \"extended\" version - it's a sort of a byproduct to me that doesn't take much effort to build.\n\nI gave the font naming some thought and decided to keep the \"Extended\" name even if the font isn't actually wider. I think I'm following bitmap font naming standard here, even if it seems non-standard for a vector type font.\n\n"
    },
    {
      "time": "12 Mar 2006 — 6:03pm",
      "content": "\\> I don’t like the “extended” version\n\nOK, but type design being a largely servile craft, it's  \nuseful to tame -although never ignore- one's preferences.  \nIt really is true that in this case (and really most such  \ncases) two-pixel spacing will improve readability.\n\nThe use of \"Extended\" is indeed a sort of pseudo-standard,  \nbut it's quite an unfortunate one, and not <cite>too</cite> widely spread.  \nExcept for perhaps a minor font-menu advantage, there's every  \nreason to do the right thing and call them what they are: Tight/Loose.\n\nBut if you must keep the confusing terminology,  \nat least make the 2-pixel-space one the Regular,  \nand call the other one Narrow or Condensed...\n\nhhp\n\n"
    },
    {
      "time": "13 Mar 2006 — 7:26am",
      "content": "Here's my reasoning for 1px spacing being Regular:\n\n ![](http://web.archive.org/web/20150414102514im_/http:/typophile.com/files/fl_tah.gif)\n  \n..and here a little more of that plus some backing for calling 2px spaced one Extended:\n\n[http://www.distype.be](http://web.archive.org/web/20150414102514/http:/www.distype.be/)  \n [http://pixelfonts.style-force.net](http://web.archive.org/web/20150414102514/http:/pixelfonts.style-force.net/)  \n [http://www.fontsforflash.com](http://web.archive.org/web/20150414102514/http:/www.fontsforflash.com/ \"http://www.fontsforflash.com\")\n\nBTW, what do you think about Craig Kroeger naming scheme?  \n [http://www.miniml.com](http://web.archive.org/web/20150414102514/http:/www.miniml.com/ \"http://www.miniml.com\")\n\n"
    },
    {
      "time": "13 Mar 2006 — 8:06am",
      "content": "But guess why Verdana was created, and why it's used more: Tahoma's tightness gives it very low readability! Which is sort of OK since it was intended for buttons and such, not long text. So it depends what intent you have for your font.\n\nhhp\n\n"
    },
    {
      "time": "13 Mar 2006 — 8:26am",
      "content": "On the other hand Verdana sets very wide. So here's a comparison  \nwith Mana, a design that combines narrow setting with spacing  \nconducive to good readability:\n\n ![](http://web.archive.org/web/20150414102514im_/http:/typophile.com/files/vsFlukst.gif)\n\nhhp\n\n"
    },
    {
      "time": "13 Mar 2006 — 9:17am",
      "content": "Good point on the Verdana setting, and it's the most commonly used font on the web. I must add, I always liked Tahoma. Flukst is meant for short paragraph text and it has a little decorative character. I wouldn't recommend it for longer text chunks.  \nMana looks good with 2px spacing, but as you said, it's a narrower font.  \nI will definitely release the wider version of Flukst alongside the \"regular\", I'm just still reluctant to consider it base version.  \nBTW, did you OCR the sample gif or google/retype the text? Thank you for the effort!\n\n"
    },
    {
      "time": "13 Mar 2006 — 9:24am",
      "content": "I typed it. Warms up the fingers in the AM.  \n(Check out Photoshop's Not-So-Smart Quotes though.)\n\nBTW, here's a good pangram for you:  \n\"Abacist's deaf dog hijacked luminous parquetry studio, avows ex-yakuza.\"  \nIt's alphabetic, meaning that the letters occur in order. Took me three  \ngoddam days.\n\nhhp\n\n"
    },
    {
      "time": "13 Mar 2006 — 3:59pm",
      "content": "Thank you, I'll add it to the Flukst demo, hope it's ok :)\n\n"
    },
    {
      "time": "12 Apr 2006 — 4:30am",
      "content": "<cite>Thank you, Hrant!<br>\nI added one pixel.. seems to have helped a little.<br>\nTo tell the truth, I don’t like the “extended” version - it’s a sort of a byproduct to me that doesn’t take much effort to build.</cite>  \n=====================\n\nWell i think that developing an \"extended\" (adding one pixel space) version of a pixel font, is not needed at all.\n\nSince web designers / developers will use them within Photoshop and Flash, if your font is developed at 1000 UPM size and the grid step is at 125 (125x125 = 1 pixel) then it will be used at size 8.\n\nSo in Photoshop if you set the tracking of the normal pixel font at 125, you will have an extended version, thus having one more pixel space in each glyph. If you set it at 250 you will have 2 pixels space and so on...\n\nIn Flash you do this by entering 1 in the tracking field for adding one pixel space to each glyph, 2 for adding two pixels space and so on...\n\n;o)\n\nWhen i will have my pixel fonts ready i intend to have as much guide info for using pixel fonts as i can...\n\n"
    },
    {
      "time": "12 Apr 2006 — 7:35am",
      "content": "\\> if you set the tracking of the normal pixel  \n\\> font at 125, you will have an extended version\n\nThis is 90% OK, but not totally, because there are often \"boundary conditions\" that need to be exceptions (like the right side of the \"r\"). Brute tracking adjustments tend to throw off kerning as well (and Mana for example has 1400+ kern pairs).\n\nAlso, for fonts that -properly- have 2 pixels of interletter space, using negative tracking to get a Tight version can lead to collisions.\n\nhhp\n\n"
    },
    {
      "time": "12 Apr 2006 — 8:38am",
      "content": "Well hrant, in my pixel fonts... when i have the the tracking at 125 and the kerning ALWAYS at \"metrics\" in PS CS2, it works perfect. Some of my fonts has also around 200 kerning pairs, and they work perfect too at multiples of 125 tracking.\n\nAnd i'm only talking about 1 pixel space fonts and how to make them 2 pixels space and more while using them in PS and Flash.\n\nYou can try my demo font just to check it out...\n\n[http://www.grixel.gr](http://web.archive.org/web/20150414102514/http:/www.grixel.gr/ \"http://www.grixel.gr\")\n\n;o)\n\n"
    },
    {
      "time": "12 Apr 2006 — 8:47am",
      "content": "A good \"r\" (including at least some of yours) needs only  \none pixel of space on its right in either Tight or Loose.\n\nhhp\n\n"
    },
    {
      "time": "12 Apr 2006 — 10:52am",
      "content": "I might be wrong... but if the right side of the letter \"r\" will always have for eg. 1 pixel space in tight and in Loose version... then in the loose version i think that it would seem like it sticks with its next glyph, while all other pairs would have 2 pixels space...\n\nIt seems like an interesting comment of yours... but maybe a visual example would convince me for sure.\n\n:)\n\nNick\n\n"
    },
    {
      "time": "13 Apr 2006 — 8:09pm",
      "content": "_In Flash you do this by entering 1 in the tracking field for adding one pixel space to each glyph, 2 for adding two pixels space and so on…_\n\nOnly in static text fields. Dynamic ones, and those are the most used, don't have \"tracking control\".\n\n"
    },
    {
      "time": "14 Apr 2006 — 1:51am",
      "content": "Well yes you are right... but in Macromedia Flash 8 there is tracking control in all three types of text. All other previous versions ( \\<= MX 2004) don't have this function.\n\n"
    }
  ]
}
