{
  "id": "17214",
  "title": "Need information about Chicken Plain Font !!!!",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello! I’m doing a work about Chicken Plain font designed by David Carson and Betsy Kopshina, but i can’t find anything on the net.. i wanted to know how the font was born, and stuff like that! Tkx\n\n [‹ forward thinking with restraint, straightforward that perks curiosity](http://web.archive.org/web/20080208042910/http:/typophile.com/node/17400 \"Go to previous forum topic\") [Need recommendations... ›](http://web.archive.org/web/20080208042910/http:/typophile.com/node/15764 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080208042910/http://typophile.com/user/10943\" title=\"View user profile.\">xokolat</a>",
  "time": "<br>",
  "uid": "10943",
  "comments": [
    {
      "time": " 11.Jan.2006 4.12pm",
      "content": "There are a few links on MyFonts under [David Carson](http://web.archive.org/web/20080208042910/http:/www.myfonts.com/person/carson/david/) that might be a good start.\n\n"
    },
    {
      "time": " 11.Jan.2006 5.26pm",
      "content": "Hi,! Tks for the answer.. i already seen that sites upside down, but there was nothing about chicken font.. :| tkx anyway\n\n"
    },
    {
      "time": " 11.Jan.2006 9.07pm",
      "content": "Is it Chicken Plain or Chicken Parts?\n\nThere is a font at garagefonts.com called Chicken Parts but I’ve also seen references before to Chicken Plain. Never seen it tho.\n\n"
    },
    {
      "time": " 12.Jan.2006 2.27am",
      "content": "You’re not going to easily find info about Chicken. That rare beast was part of David Carson’s Ray Gun-era body of work. Chicken was only briefly available through GarageFonts, and is now ancient history. David and his colleague Betsy Kopshina Schulz have been out of GF for years. Betsy is super busy these days with her design business and family. David is, as you would expect, busy with myriad projects and his own family.\n\nBetsy’s website is at [http://ww.adesigngarden.com](http://web.archive.org/web/20080208042910/http:/ww.adesigngarden.com/ \"http://ww.adesigngarden.com\"). DC’s website is at [http://www.davidcarsondesign.com](http://web.archive.org/web/20080208042910/http:/www.davidcarsondesign.com/ \"http://www.davidcarsondesign.com\"). Contact info for both is available on their sites. You could try asking them a few very specific, well-thought-out questions after you do all possible research about Ray Gun and Carson’s design aesthetic. There are a couple of good books on the subject, and tons of info on the web.\n\nI’m curious - do you actually have a copy of Chicken, or are you working from a printed specimen?\n\nGood luck!\n\n"
    },
    {
      "time": " 13.Jan.2006 6.10am",
      "content": "Hi! Tkx for the information! It’s really helpful! I see the only way to get more info is to email them.. i already searched a lot and it’s very odd that there isn’t information about any font by david carson! I’ll continue my research.. and hope that someone answer my emails! :)  \n(I’m working from a printed specimen)\n\n"
    },
    {
      "time": " 13.Jan.2006 8.58am",
      "content": "Betsy just answered my email.. but.. no luck:\n\n“I can’t help you with that font. It was too long ago. I only did the  \nfontographer creation of it.\n\nI am so sorry. Thanks Betsy Schulz”\n\n"
    },
    {
      "time": " 19.Jan.2006 1.54pm",
      "content": "Betsy married Lee?\n\nAn even better name would be the first ingredient these days in any packaged meat product that doesn’t say “beef” on it: mechanically separated chicken. And it would even be funny, if it weren’t true.\n\nhhp\n\n"
    }
  ]
}
