{
  "id": "17238",
  "title": "Which figures should be default in OpenType fonts?",
  "forum": "Home",
  "tags": [

  ],
  "content": "Proportional Lininig\n\n13% (10 votes)\n\nTabular Lining\n\n18% (14 votes)\n\nProportional Oldstyle\n\n55% (42 votes)\n\nTabular Oldstyle\n\n5% (4 votes)\n\nNo Preference\n\n8% (6 votes)\n\nTotal votes: 76\n\n",
  "author": "paul d hunt",
  "time": "12 January, 2006 - 9:45am",
  "uid": "7006",
  "comments": [
    {
      "time": " 12 January, 2006 - 9:54am",
      "content": "Continued from: [http://typophile.com/node/17217](http://web.archive.org/web/20060222081525/http:/typophile.com/node/17217)\n\nfor those who need clarification see\n\n[lining figures](http://web.archive.org/wiki/lining%20figures)\n\n[oldstyle figures](http://web.archive.org/wiki/text%20figures)\n\n[proportional figures](http://web.archive.org/wiki/proportional%20figures)\n\n[tabular figures](http://web.archive.org/wiki/tabular%20figures)\n\n"
    },
    {
      "time": " 12 January, 2006 - 10:13am",
      "content": "FYI:  \nIn voting I assumed [hybrid numerals](http://web.archive.org/wiki/hybrid%20figures)  \nfall under the oldstyle category.\n\nBTW, I like this terminology.\n\nhhp\n\n"
    },
    {
      "time": " 12 January, 2006 - 10:28am",
      "content": "i altered the categories. if anyone who has already voted wants to change their vote, contact me via the IM feature.\n\n"
    },
    {
      "time": " 12 January, 2006 - 10:31am",
      "content": "I’m not sure you should have… Some ambiguity  \ncan actually make survey results easier to grasp.  \nAlso, now you’ll have to add 3/4 lining\\*, tabular  \nand proportional! :-/\n\n\\* Or maybe “short lining” to avoid quantification.\n\nBut if you will keep hybrid, yes,  \nI would like to change my vote.\n\nBTW, one thing I think the “proportional oldstyle”  \nvoters might be ignoring: oldstyle fonts actually  \nlook a lot less bad than linings when tabular.  \nThis is something difficult to realize without  \nactually making them.\n\nAnd now you may proceed to censure  \nme for messing with the vote! :-)\n\nhhp\n\n"
    },
    {
      "time": " 12 January, 2006 - 10:36am",
      "content": "\\*sigh\\* i guess i should consult you on these things first. switched back. sorry for any confusion. \\>^P I hope i don’t get fired as a moderator for my shenanegins!\n\n"
    },
    {
      "time": " 12 January, 2006 - 10:43am",
      "content": "If I haven’t been fired for all of my shenanigans, I highly doubt something like this will get you fired. :^P\n\n"
    },
    {
      "time": " 12 January, 2006 - 10:48am",
      "content": "whew!\n\n"
    },
    {
      "time": " 12 January, 2006 - 11:26am",
      "content": "Yes Paul, think of all the money you would lose by getting fired as moderator :-)\n\nThanks again for taking my “hint” and posting your voting form!\n\nChrisL\n\n"
    },
    {
      "time": " 12 January, 2006 - 12:30pm",
      "content": "Shouldn’t that depend on the intended use & context of the type design itself? I am guessing that you mean the poll to be about serif/text faces. Or do you mean the poll to include things like NOW( the sans) ? That’s my bit done to muddy the results!\n\n"
    },
    {
      "time": " 12 January, 2006 - 3:55pm",
      "content": "Hey! I can’t vote for them all. I want them all. And there’s numerators, denominators, superscript and subscript numbers. Eight sets of numbers should be the minimum.\n\nGeorge\n\nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": " 12 January, 2006 - 4:59pm",
      "content": "“I am guessing that you mean the poll to be about serif/text faces. Or do you mean the poll to include things like NOW( the sans) ?”\n\nI mean the poll to be about ALL text faces, not just serif (and not just my own). My personal belief is that the face and intended use would determine which would be best default figures. I hope apps can become smart enough to self select the instances where tabular figures are needed (any figure following a tab for starters or within a table). I avoid using Word and don’t need it except when I get files from clients. I do use Excel and assume it would default all figures to tabular. The apps have not caught up to the OTF types yet.  \nMy hope is that people will get to know about selecting figures in the OpenType menu and that they would be able to set their own defaults.\n\nChrisL\n\n"
    },
    {
      "time": " 12 January, 2006 - 5:04pm",
      "content": "In fact, the default style of numerals also depends  \non what alternate styles are available! For example,  \nif you provide a proportional set as an alternate,  \nit makes more sense to make the default tabular.\n\nhhp\n\n"
    },
    {
      "time": " 12 January, 2006 - 5:15pm",
      "content": "_Hey! I can’t vote for them all. I want them all. And there’s numerators, denominators, superscript and subscript numbers. Eight sets of numbers should be the minimum._\n\ninstead of _standard_, i should have said _default_ hope that doesn’t throw you all off. otherwise this poll may be a scratch.\n\n"
    },
    {
      "time": " 12 January, 2006 - 6:00pm",
      "content": "Paul,  \nI think you made it quite clear in your second post. Don’t sweat it.\n\nChrisL\n\n"
    },
    {
      "time": " 12 January, 2006 - 7:40pm",
      "content": "_instead of standard, i should have said default hope that doesn’t throw you all off. otherwise this poll may be a scratch._\n\nOccurred to me after I hit send. Propotional oldstyle for default, always.\n\nGeorge\n\nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": " 13 January, 2006 - 6:26am",
      "content": "Proportional oldstyle. We need to get the masses up to speed on the “funny looking numbers that are small”.\n\n"
    },
    {
      "time": " 13 January, 2006 - 8:49am",
      "content": "depends on the face. I’m doing an ‘old style’ typeface right now that has ‘old style’ numerals in the main font and tabular lining in the expert set. So the default should be ‘old style’. But in a modern (not contemporary) design it should be tabular lining.\n\n"
    },
    {
      "time": " 13 January, 2006 - 9:33am",
      "content": "good point, vince. thanks for piping up.\n\n"
    },
    {
      "time": " 13 January, 2006 - 10:36am",
      "content": "I agree with Vince. It is hard to choose just one as a default for all type styles, for me, it very much depends on which style is being used. Though if I had to choose one, it would be proportional old style.\n\n"
    },
    {
      "time": " 13 January, 2006 - 4:34pm",
      "content": "I’m going to repost from a previous post here, since we’re all at cross-purposes…  \nI think that historical precedent should dictate the default: Garaldes should have Proportional Oldstyle, and modernist sanses should have Tabular Lining. These just look right, half of which is probably due to their looking “unsurprising”.\n\n"
    },
    {
      "time": " 13 January, 2006 - 4:51pm",
      "content": "But Chris, if you make the os nums tabular\\* (which, to again point out, is easier to do than with linings) then the biggest barrier to the unwashed masses using them is removed. Also: if you make them hybrid, they’ll also not look “too small”.\n\n\\* I mean as the default; an alt of proportionals is still great.\n\nChester: you really can’t mean “dictate”, can you?\n\nhhp\n\n"
    },
    {
      "time": " 13 January, 2006 - 4:56pm",
      "content": "There are a lot people in the world who crunch numbers and are interested in the bottom line. So, for me, the default would always be tabular, which is largely the case in the fonts I have used. As Chester suggests, old style vs lining is surely a matter of which style suits the font better.\n\nAn issue that really used to bug me when I worked for a corporate was that Verdana’s roman and bold numerals, while being tabular within weights, were not tabular across the whole family. If you wanted to pick out a line of a financial table in bold it threw the columns out completely. Neither Arial, nor Times suffer like this. Not sure about Comic Sans!\n\n"
    },
    {
      "time": " 13 January, 2006 - 5:11pm",
      "content": "Hrant, you can’t really mean “unwashed masses”, can you?\n\n"
    },
    {
      "time": " 13 January, 2006 - 5:53pm",
      "content": "Tongue-in-cheek. Although every joke is part truth.\n\nhhp\n\n"
    },
    {
      "time": " 13 January, 2006 - 8:14pm",
      "content": "\\>you really can’t mean “dictate”, can you?  \nIndeed, Hrant, I should have chosen a less dictatorial word. May I change it to either “suggest” or “recommend”?\n\nAnd I quite agree with NickJob that tabular figures within a family should all be the same body width.\n\nOne of my dearest hopes is that “rich” OpenType fonts will be so prevalent in the future that everyone will know that they can select oldstyle, lining, proportional, and tabular combinations, and the numerals will be there. Ditto small caps.\n\n"
    },
    {
      "time": " 13 January, 2006 - 9:17pm",
      "content": "“One of my dearest hopes is that “rich” OpenType fonts will be so prevalent in the future that everyone will know that they can select oldstyle, lining, proportional, and tabular combinations, and the numerals will be there.”\n\nGreat minds think alike Chester :-)\n\nChrisL\n\n"
    },
    {
      "time": " 14 January, 2006 - 9:50am",
      "content": "_Proportional oldstyle. We need to get the masses up to speed on the “funny looking numbers that are small”._\n\nWhich is why I think it should be default. I doubt that most people will need proportional lining and they won’t bother trying to change from the default. Result will be more oldstyle numbers showing up where they should. Once people get used to it they can be told it’s the right thing to do.\n\ngeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": " 14 January, 2006 - 10:41am",
      "content": "“…until I met a man who had no Bodoni”\n\nCan you imagine Bodoni without OSF? That would be criminal :-)\n\nChrisL\n\n"
    },
    {
      "time": " 14 January, 2006 - 11:25am",
      "content": "[Bodoni with French OSF](http://web.archive.org/web/20060222081525/http:/www.p22.com/lanston/products/bodoni_bold.html)\n\n"
    },
    {
      "time": " 14 January, 2006 - 6:47pm",
      "content": "Of course it depends on the typeface. But for most typefaces that will have all four kinds, proportional oldstyle figs are the best choice for most usage. OTOH, when you require tabular figs you often absolutely require them…. I dunno.\n\nIf they’re OpenType fonts, and you’re using OT-savvy applications, the user can just set their defaults to whatever they want, regardless of the defaults in the font. For example, I have proportional oldstyle figures on by default in InDesign. I can always change it if needed.\n\nT\n\n"
    },
    {
      "time": " 14 January, 2006 - 7:48pm",
      "content": "_Can you imagine Bodoni without OSF? That would be criminal :-)_\n\n_Bodoni with French OSF_\n\nLet’s just say there’s bodoni and there’s Bodoni, and a lot more of the former than the latter.\n\nGeorge\n\nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": " 14 January, 2006 - 7:56pm",
      "content": "I think anyone who has to have tabular figures would / should know how to get them or have the good sense to ask someone who does know. In all the years I’ve been designing I only needed them for annual reports and packaging information. I’ve spent more time complaining about the lack of OSF fonts, the limited choice of OSF fonts, etc.\n\nAnd as for InDesign defaults I’d be very surprised if even half the users set typographic defaults.\n\nGeorge\n\nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": " 14 January, 2006 - 10:37pm",
      "content": "\\> for most typefaces that will have all four kinds,  \n\\> proportional oldstyle figs are the best choice  \n\\> for most usage.\n\nMy angle is that people who need columns of numbers to line up are more likely to be people who don’t know to choose between different number styles; and people who mind badly spaced (read: tabular) numerals are more likely to be people who do know about alternates. So tabular is more fool-proof as a default; but there’s no reason to make them lining; plus making them lining makes the spacing even worse; ergo: tabular oldstyle is the best default (for a typical text face at least), assuming other styles are available. Oh, and hybrid. If other styles are not available, I would probably go for the stinky old standard, tabular lining. But: 3/4 height (except if the caps happen to be unusually short).\n\n—\n\nPaul, I’m pretty definite now that the survey results are largely meaningless because we don’t know to assume alternate availability or not. So I think we need twin surveys, one asking what an only-available num style should be, and another asking what the default would be in a full-regalia alternate scenario.\n\nhhp\n\n"
    },
    {
      "time": " 15 January, 2006 - 5:29am",
      "content": "Hrant,  \nRead the title, it says “in OpenType Fonts” ?\n\nChrisL\n\n"
    },
    {
      "time": " 15 January, 2006 - 8:40am",
      "content": "Hmmm, what does that automatically imply, really?\n\nhhp\n\n"
    },
    {
      "time": " 15 January, 2006 - 11:06pm",
      "content": "Paul, where’s my original post to this thread?\n\n"
    },
    {
      "time": " 16 January, 2006 - 8:19am",
      "content": "nick, is it here?:\n\n_Continued from: [http://typophile.com/node/17217](http://web.archive.org/web/20060222081525/http:/typophile.com/node/17217)_\n\n"
    },
    {
      "time": " 16 January, 2006 - 12:58pm",
      "content": "Thanks Paul, and at the risk of boring people. I’ll repeat it here:\n\nThe default should be tabular lining.\n\nTabular, because proportional figures really screw up a tab setting, while tabular are OK (though not ideal) in a text setting — and both situations are likely to occur for users who are not aware of the options.\n\nLining, for the same reason: old style figures are just too quaint for most tabular settings, especially when leading is tight, and ascenders and descenders create too much vertical flow.\n\nTabular settings are not confined to financial or mathematical pages, but occur in many commercial uses, such as price lists and phone numbers in business stationery and contact information.  \nA very common setting where tabular figures are much better is for the numbering of a list of items: once you get to the “teens”, it looks awful with proportional “1”s that don’t line up.\n\n\\*\\*\\*\n\nAlthough I agree with chester over what looks “right”, and recognize that sophisticated typographers (at a design studio, say) may prefer OSF in a pre-1800 type genre, the problem is that the typographer is often not the end user, as when a type is specified for a corporate identity and third parties such as sales promotion companies, or the client’s in-house art department, assume that responsibility. They are less likely to be typographically astute enough to change proportional to lining when required, and may well be using software that doesn’t even give them the option to change the default.\n\n"
    },
    {
      "time": " 16 January, 2006 - 1:14pm",
      "content": "Agreed on the tabular, but not on the lining. Besides the fact  \nthat we don’t really know if OS figs are “too quaint” (nevermind  \nthat some situations and people benefit from quaintness) if you go  \nwith hybrid numerals\\* you avoid the… daintiness. Plus, to repeat  \non my end as well: OS figs look less bad than linings when tabular.\n\n\\* Like in Fenway. Noting that the Sports Illustrated  \nmacho-men don’t seem to mind any possible quaintness. :-)\n\nhhp\n\n"
    },
    {
      "time": " 16 January, 2006 - 5:03pm",
      "content": "With regards to old style figures, when I’ve included them in my PostScript typefaces, I’ve made them tabular (Fontesque, Merlin, Oneleigh, Preface, Bodoni Egyptian. (Exception: Worldwide). Starting from scratch, it seemed to make sense to do that.\n\nYou’re right Hrant, OSF aren’t necessarily quaint.\n\n"
    },
    {
      "time": " 17 January, 2006 - 3:28pm",
      "content": "Not surprisingly, my choice got even less than “no preference”. :-/  \nShould’ve followed my own preachings and not voted…\n\nBut I am wondering: why have less than 15% of people who have read this thread voted? I mean, almost everybody hasn’t even bothered to click “no preference”… This is exacly the sort of thing that makes almost all surveys pointless I fear.\n\nhhp\n\n"
    },
    {
      "time": " 17 January, 2006 - 8:28pm",
      "content": "Hrant,  \nPerhaps the lurkers don’t know what we are talking about.\n\nChrisL\n\n"
    },
    {
      "time": " 17 January, 2006 - 9:46pm",
      "content": "_But I am wondering: why have less than 15% of people who have read this thread voted?_\n\ni hope you’re not counting # of reads as unique readers. because i know i’ve visited this thread maybe 20+ times, and i believe the ticker counts each of those as a “read”. Still I agree, this type of survey is more of just a fun “straw poll” and not very scientific at all. summing thing’s up, i’d say that the results show that a majority of type designers wish that porportional oldstyle figures were the default in OpenType fonts. i think that with all the points made, i have to agree with nick shinn and say that figures should factor in the lowest common denominator (pun intended): meaning that tabular lining figures best “blanket” most situations. however, discerning typographers should be wise enough to set the defaults in their own applications to what is most appropriate for what the context dictates. blah, blah, woof, woof.\n\n"
    },
    {
      "time": " 18 January, 2006 - 10:59am",
      "content": "\\> the ticker counts each of those as a “read”.\n\nIt seems you’re right. So forget what I said.  \nAt least that counters the prospect of droves  \nof eager groupies who don’t even know what  \nkind of music we’re playing… Awww, shucks. ;-)\n\n\\> a majority of type designers wish that porportional  \n\\> oldstyle figures were the default in OpenType fonts.\n\nNow let’s ask the users… :-)  \nNot that we should submit to their every weakness/delusion.\n\nPaul, do you really think that users  \nhave an insatiable need for numbers  \nto be lining, in a text face?\n\nhhp\n\n"
    },
    {
      "time": " 18 January, 2006 - 11:30am",
      "content": "“summing thing’s up, i’d say that the results show that a majority of type designers wish that porportional oldstyle figures were the default in OpenType fonts.”\n\nPaul, Thanks for your data dabling, straw poll or otherwise.\n\nChrisL\n\n"
    },
    {
      "time": " 18 January, 2006 - 11:41am",
      "content": "_Paul, do you really think that users  \nhave an insatiable need for numbers  \nto be lining, in a text face?_\n\nno, i don’t. personally i voted for tabular osf. maybe i would have chosen tabular hybrid nums if there had been a choice.\n\n…so what should next week’s poll be about? hit me up with suggestions.\n\n"
    },
    {
      "time": " 18 January, 2006 - 11:45am",
      "content": "Then what does “tabular lining figures best ‘blanket’ most situations” mean?  \nHuh?! HUH?!?! ;-)\n\n\\> what should next week’s poll be about?\n\nThe same poll, but on Speak Up.\n\nBut for a local poll, it would be nice to find out what proportion  \nof designers make smallcaps for what proportion of their fonts.\n\nhhp\n\n"
    },
    {
      "time": " 18 January, 2006 - 12:12pm",
      "content": "_Then what does “tabular lining figures best ‘blanket’ most situations” mean? Huh?! HUH?!?! ;-)_\n\nbasically, it means the same thing as “blah, blah, woof, woof.” Isn’t that how everything i write on here sounds? \\>^P\n\n"
    },
    {
      "time": " 18 January, 2006 - 1:08pm",
      "content": "Hrant’s suggestion for a poll is good for next week.  \nPerhaps after that you might consider a poll on:  \n“What would you consider to be a long enough text to be called immersive reading and require a font in the highest readability class? A second part of the question is, “What percentage of interuption by illustration, graphics, or photography would pull a reader out of immersion?”\n\nChrisL\n\n"
    },
    {
      "time": " 18 January, 2006 - 1:13pm",
      "content": "But Chris, how many people would really feel capable of answering that question? In any case, even if they do feel capable, I think first you’d need to ask something like: “Do you think there’s a qualitative difference between reading a poster and reading a book?”, or “Do you think there’s a qualitative difference between Display and Text fonts?”, or anything that tries to see how many people even see a distinction in the first place, before asking them to state what details of immersion they believe in.\n\nhhp\n\n"
    }
  ]
}
