{
  "id": "17277",
  "title": "Transparent screens",
  "forum": "Joe Pemberton's blog",
  "tags": [

  ],
  "content": "Clearly these people have too much time on their hands...\n\n ![](http://web.archive.org/web/20120107033415im_/http:/typophile.com/files/83524092_6c47988273.jpg)\n\nNo, it's not a Photoshop gimmick, it's much cooler than that...  \na) photograph your work area, minus your computer  \nb) carefully crop the image of your work area  \nc) set the cropped image as your desktop background (or \"wallpaper\")  \nd) amaze your friends\n\n[http://www.flickr.com/groups/transparentscreens/pool/](http://web.archive.org/web/20120107033415/http:/www.flickr.com/groups/transparentscreens/pool/ \"http://www.flickr.com/groups/transparentscreens/pool/\")\n\n",
  "author": "<a href=\"/web/20120107033415/http://typophile.com/user/1160\" title=\"View user profile.\">Joe Pemberton</a>",
  "time": "<br>",
  "uid": "1160",
  "comments": [
    {
      "time": "",
      "content": "ha! i'm a huge fan of those hp ads. clever use of cropping and compositing.\n\n"
    },
    {
      "time": "",
      "content": "Haha, those are great. Someone's got a dirty little iPod there...lifting her skirt up in public like that ;) tsk tsk\n\n"
    },
    {
      "time": "",
      "content": "interesting to see the discrepancy in color between the on screen world and the \"real\" world. oh, and i wish i could keep the desktop on my computer that clean!\n\n"
    },
    {
      "time": "",
      "content": "Joe,\n\nThat looks really awesome. I did something similar years ago in college. I had a textured yellow wall behind my CRT, so I propped up my flatbed scanner against the wall and scanned it, and used that as my desktop wallpaper. I didn't have to match up any cables, though.\n\n"
    },
    {
      "time": "",
      "content": "The HP \"Picture Book\" ads by François Vogel that Tiffany mentioned are classic \"snaps\" of overlapping photos with live environments.\n\n ![](http://web.archive.org/web/20120107033415im_/http:/typophile.com/files/HP_printer-ad1.png)\n  \n_Picshas, picshas, picshas of ya mama, takin by ya poppa a long time ago..._\n"
    },
    {
      "time": "",
      "content": "do you think they really used photos at all though? i thought they just used empty frames and \"snapped\" an instance and morphed it.\n\n"
    },
    {
      "time": "",
      "content": "On the HP ads, they may have used a few \"real\" photos on group shots, but they probably did a lot of \"empty white frames\" and did most in post filming production.\n\nHere's a link to the studio that did it [\"Paranoid Projects\" :Tools of North America](http://web.archive.org/web/20120107033415/http:/www.toolofna.com/index_flash.html) out of Santa Monica.\n\nHere's a link to their latest [HP \"Cafe Society\"](http://web.archive.org/web/20120107033415/http:/www.boardsmag.com/screeningroom/commercials/2255/) commercial, viewable in Quicktime, with a complete list of credits... I think they pride themselves on their \"picture-in-picture\" trickery and not about to give away all their trade secrets.\n\n"
    },
    {
      "time": "",
      "content": "Agreed. HP is doing some really great advertising and branding these days.\n\n"
    }
  ]
}
