{
  "id": "17289",
  "title": "Lickable graphic design",
  "forum": "paul d hunt's blog",
  "tags": [

  ],
  "content": "Do you ever come across graphic deisgn that is so sexy and sumptuous you just want to lick it? I came across the website for [the heads of state](http://web.archive.org/web/20131105000114/http:/theheadsofstate.com/) about a year ago when i was trying to teach myself some css. their wesite is so simple and beautiful, i just fell in love with its design. and then they have some beautifuly typographic rock posters for some of my favorite bands! i wish i could buy them all. i did buy one of those beauties and when it arrived i didn't want to lick it anymore. i wanted to enshrine it and hang it on the wall. it looks absolutely gorgeous in my small little apt above the p22 offices. now if you'll excuse me, i hafta go buy some candldles...\n\n",
  "author": "paul d hunt",
  "time": "14 Jan 2006 — 1:02pm",
  "uid": "7006",
  "comments": [
    {
      "time": "14 Jan 2006 — 3:54pm",
      "content": "Great stuff. Not sure I'd lick it or not. My niece was smelling things today. She thinks pink shirts smell prettier than turquoise. I have seen design that makes my heart palpitate, but not that I've wanted to lick.\n\n"
    },
    {
      "time": "14 Jan 2006 — 8:32pm",
      "content": "Paul,\n\nWhich one did you end up getting?\n\n"
    },
    {
      "time": "15 Jan 2006 — 9:01am",
      "content": "i got [this one](http://web.archive.org/web/20131105000114/http:/www.theheadsofstate.com/posters/wilco_new_york_city/). although i didn't go to this show, i'd hafta say wilco is one of the best bands i've ever seen live and living in ny now... and besides, the design is just breathtaking. love it.\n\n"
    },
    {
      "time": "15 Jan 2006 — 9:12am",
      "content": "Paul,\n\nGreat choice, that one is awesome, as are all the other posters they've produced. I love their (retro) style. I wouldn't really mind having some of those posters on my wall even if I didn't like the band.\n\n"
    },
    {
      "time": "21 Jan 2006 — 8:28am",
      "content": "The things I tend to like generally look too spiky to want to lick.  \nBut the sound of a pickle jar opening does make me spontaneously salivate.\n\nhhp\n\n"
    },
    {
      "time": "21 Jan 2006 — 8:59am",
      "content": "_But the sound of a pickle jar opening does make me spontaneously salivate._\n\nI think that's going to be one of the sounds for the new Fontographer 2006! \\>^P\n\n"
    }
  ]
}
