{
  "id": "17300",
  "title": "Koster rough job",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "A really rough job of redrawing the Koster font, from poor images. It was just a quick job but this shows some of the variations that there was. The Kerning was not enacted here, but had to hand do all of them one by one.\n\n| Attachment | Size |\n| --- | --- |\n| [koster.gif](http://web.archive.org/web/20150417171850/http:/typophile.com/files/koster.gif) | 22.78 KB |\n\n",
  "author": "typotheticals",
  "time": "14 Jan 2006 — 8:44pm",
  "uid": "10671",
  "comments": [
    {
      "time": "15 Jan 2006 — 12:32pm",
      "content": "FYI -- From a collection of old metal fonts that a friend pulled samples during the mid-seventies, I have this poor repro showing that the cap \"Q\" uses the same ornamental treatment as the cap \"C\" on the top. He called design _Antique Initials 2_ because I don't think he was able to identify it... neither could I.\n\nIt may be due to the point size sample or the poor repro, but it looks like the \"crown\" ornament on the cap \"C\" and \"Q\" are a slight bit more delicate than in your redrawing.\n\n ![](http://web.archive.org/web/20150417171850im_/http:/typophile.com/files/ant_init3.png)\n  \nIn the specimen above, the \"X\" was originally upside down which I corrected in Photoshop, but I believe the cap \"S\" is still upside down.\n\nThe sample below was originally posted by Mark Simonson, which shows the same treatment of the cap \"Q\" that you rendered. Between the two samples you will spot minor variants in drawing like the additional swash on cap \"S\". Hope this helps to round out your source material.\n\n ![](http://web.archive.org/web/20150417171850im_/http:/typophile.com/files/Koster_Simonson.gif)\n\n"
    },
    {
      "time": "21 Jan 2006 — 8:59am",
      "content": "Some stuff here:  \n [http://typophile.com/node/850](http://web.archive.org/web/20150417171850/http:/typophile.com/node/850 \"http://typophile.com/node/850\")\n\nhhp\n\n"
    },
    {
      "time": "21 Jan 2006 — 9:08am",
      "content": "Graham, did you post this for critique? If so, it really should be in the Critique \\> Display section.\n\n"
    },
    {
      "time": "22 Jan 2006 — 1:57pm",
      "content": "Not sure where to post it as it really wasnt for critique, nor exactly to show what state up to, but more a sort of fishing trip. Could we have a fishing trip forum :)?\n\nChange it over to where you would have expected it to be if you wish.\n\n"
    },
    {
      "time": "22 Jan 2006 — 4:50pm",
      "content": "While here, I could supply the font to a couple of people for them to have a look/check for me, if anyone wanted to. That way I get a proper opinion instead of from an image.\n\n"
    },
    {
      "time": "22 Jan 2006 — 5:40pm",
      "content": "Actually a PDF goes a long way.\n\nhhp\n\n"
    }
  ]
}
