{
  "id": "17309",
  "title": "Recommendations for Exchange Student",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm studying graphic design at the Bezalel Academy in Jerusalem, 2nd year, and we're supposed to give a list of priorities on places we'd like to go be exchange students next year, for a single semester (fall or spring).\n\nThere's quite a wide list of options, but I'm thinking either New York or Netherlands as my top priorities... I was wondering if anyone has any recommendations for any specific schools that are known for their typography/type design/calligraphy courses, not necessarily in the countries I've mentioned, since the choice is very wide... Thanks.\n\n",
  "author": "meir",
  "time": "15 Jan 2006 — 1:12pm",
  "uid": "2595",
  "comments": [
    {
      "time": "15 Jan 2006 — 3:37pm",
      "content": "Try Reading - England; New York, or try to find out where's Matthew Carter...\n\n"
    },
    {
      "time": "15 Jan 2006 — 3:48pm",
      "content": "I read that Matthew Carter teaches a course with Tobias Frere-Jones at Yale...\n\n"
    },
    {
      "time": "15 Jan 2006 — 5:41pm",
      "content": "....go to Yale!\n\n"
    },
    {
      "time": "15 Jan 2006 — 10:31pm",
      "content": "Meir, this is an incomplete and English-centric list, but here goes:\n\n[Department of Typography & Graphic Communication at the University of Reading](http://web.archive.org/web/20131011012724/http:/www.rdg.ac.uk/AcaDepts/lt/)\n\n[RISD (Rhode Island School of Design)](http://web.archive.org/web/20131011012724/http:/www.risd.edu/)\n\n[SVA (School of Visual Arts)](http://web.archive.org/web/20131011012724/http:/www.schoolofvisualarts.edu/index.jsp)\n\n[The Cooper Union](http://web.archive.org/web/20131011012724/http:/www.cooper.edu/)\n\nBest of luck!\n\n"
    },
    {
      "time": "16 Jan 2006 — 10:00am",
      "content": "From the Yale course list at [http://www.yale.edu/bulletin/html/art/program.html](http://web.archive.org/web/20131011012724/http:/www.yale.edu/bulletin/html/art/program.html)\n\nGraphic Design 743a, Type Design. Type design is distinct from “lettering” in that it necessarily calls for a systematic approach, not just a concern for individual forms. The course focuses on a clear, systematic procedure to building the design of a typeface, as well as the aesthetic issues presented by single letters. The class is taught with Fontographer, a type-design program for the Macintosh® that allows designers to digitize letterforms on screen and turn them into usable PostScript Type One fonts. Fontographer’s ability to output digitized characters at actual size on a laser printer brings a level of reality to the project that was not practicable by pre-computer methods. Students learn the software, together with the principles of designing and spacing type. Fully fledged type designers are not made in one term; the object is to “demystify” the subject and teach users of type an increased appreciation of it. Students work on individual projects, chosen in consultation with the instructors. Individual projects should be carefully chosen, so that the availability of the student’s new font makes a real contribution and serves a clear purpose. With the problems of type design so deeply interconnected, a clearly defined project is necessary to establish solid criteria for subsequent work. The nature of the project determines the route each student takes in researching his or her design. If appropriate to the project, students spend time rendering letterforms by hand, investigating historical sources, or starting immediately in Fontographer. Tobias Frere-Jones and Matthew Carter.\n\nSounds like a dream course to me.\n\n"
    },
    {
      "time": "22 Jan 2006 — 1:21pm",
      "content": "[http://www.artcenter.edu/](http://web.archive.org/web/20131011012724/http:/www.artcenter.edu/ \"http://www.artcenter.edu/\")\n\nAnd you can't beat the weather! :-)\n\nhhp\n\n"
    },
    {
      "time": "22 Jan 2006 — 1:59pm",
      "content": "\\> And you can’t beat the weather!\n\n...and the four seasons: fire, fire, fire, fire.\n\n"
    }
  ]
}
