{
  "id": "17311",
  "title": "Typorexia: where's the meat?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I have noticed that there is a quiet war being waged by designers, typographers and enthusiasts alike, against the thin, wispy text faces that characterize most of today’s digital type.\n\nThe weapons in our arsenal? Robust, dark faces such as Dolly, Quadraat, Bembo Book, Absara. Dark, meaty faces all.\n\nSo what are your favourites for text? What of all these light, anemic faces that litter the typescape? Opinions? Comments?\n\n [‹ Sans Serif vs. Serif](http://web.archive.org/web/20081119135656/http:/typophile.com/node/6137 \"Go to previous forum topic\") [illustration databases similar to iStockPhoto ›](http://web.archive.org/web/20081119135656/http:/typophile.com/node/17282 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081119135656/http://typophile.com/user/9249\" title=\"View user profile.\">Palatine</a>",
  "time": "<br>",
  "uid": "9249",
  "comments": [
    {
      "time": " 15.Jan.2006 3.13pm",
      "content": "The one that made me see the (dark) light: [Renard](http://web.archive.org/web/20081119135656/http:/www.teff.nl/fonts/renard/renard.html) in Smeijers’ book, [Counterpunch](http://web.archive.org/web/20081119135656/http:/www.amazon.com/exec/obidos/redirect?tag=typographica-20%26link_code=xm2%26camp=2025%26creative=165953%26path=http://www.amazon.com/gp/redirect.html%253fASIN=0907259065%2526tag=typographica-20%2526lcode=xm2%2526cID=2025%2526ccmID=165953%2526location=/o/ASIN/0907259065%25253FSubscriptionId=02ZH6J1W0649DTNS6002 \"at Amazon\").\n\n"
    },
    {
      "time": " 15.Jan.2006 5.55pm",
      "content": "The problem isn’t new, but a condition of hi-res, digital typography, which uses single master fonts optimized for mid-size text (hence weak for smaller text), and production processes that have little or no “gain”.  \nSome of the first faces to address it were Adobe Garamond, Charter, Scala, and yes, Quadraat.  \nI think you will find that’s it’s an issue addressed by a large percentage of digital text face designs, it’s certainly something I consider for all my serifed designs.\n\nOne solution is to provide different “weights” for different circumstances, variables such as size, stock, printing technique, etc.  \nThe most sophisticated has been developed by Tobias Frere-Jones. Originally named “tuning”, now it’s [“Grades”.](http://web.archive.org/web/20081119135656/http:/www.typography.com/catalog/mercurytext/grades_duplexing.html)\n\n"
    },
    {
      "time": " 16.Jan.2006 11.30pm",
      "content": "I made a similar thing with Delicato. Regular, Medium and Bold are using almost the same width and amount of space and can be chosen for desired “thickness” in print without any changes in the text flow. This feature will probably (hopefully) be more common for text faces in the future?!\n\n"
    },
    {
      "time": " 17.Jan.2006 2.06pm",
      "content": "My own technical term is “grunt”. We are designing a book of poems by an Ethopian refugee at the moment, whose writing is as subtle as a charging rhino. Maple Medium is proving to be sufficiently “grunty”, thank you very much!\n\nWe like meat on our bones.\n\n"
    },
    {
      "time": " 17.Jan.2006 2.18pm",
      "content": "Darkness rules.  \nAnd although it’s true that the anemia of the 70s has now been overcome, to me we still have a way to go. Smeijers has probably been the most explicit and persistent advocate of darkishness.\n\n\\> The most sophisticated has been developed by Tobias Frere-Jones.\n\nFontBureau, and probably specifically David Berlow, deserve that credit. On the other hand they in turn publicly credit the old Linotype news faces, some of which were in fact repeatedly re-made for slightly different gain amounts (as well as widths) but to me not in a sufficiently unified way to deny FB due credit.\n\nSee also this:  \n [http://typophile.com/node/15204](http://web.archive.org/web/20081119135656/http:/typophile.com/node/15204 \"http://typophile.com/node/15204\")\n\nBut it needs to be pointed out here that grades are not intended to make text appear darker of its own - more like just compensate for technical issues, in fact to <cite>maintain</cite> the weight, and generally the conventional/mainstream weight.\n\nStefan, I love uniwidth fonts (one of the appeals of Compatil to me) but beyond a certain weight (including the bold) it causes the black forms to become uncharacteristically narrow in order to maintain uniwidth (and in the light end uncharacteristically wide).\n\nhhp\n\n"
    }
  ]
}
