{
  "id": "17310",
  "title": "Identity Critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Here is what I have settled on for my personal identity. Designing for yourself is always the hardest, so I wanted to get an outside opinion. I’m not to attached to the magenta, but I wanted something that popped against the black. I also though the magenta helped to give it a “classic but modern” feel. Is the logotype readable enough? What do you interpret it as?\n\nI’m planning on using Neenah’s Environment paper in a smooth white finish, just so you get the whole picture.\n\nLet me know what you think.\n\n| Attachment | Size |\n| --- | --- |\n| [Business Card.pdf](http://web.archive.org/web/20080118114736/http:/typophile.com/files/Business%20Card.pdf) | 45.41 KB |\n| [Letterhead.pdf](http://web.archive.org/web/20080118114736/http:/typophile.com/files/Letterhead.pdf) | 47.43 KB |\n| [Envelope.pdf](http://web.archive.org/web/20080118114736/http:/typophile.com/files/Envelope.pdf) | 34.33 KB |\n\n [‹ Need Help for Corporate identity Guide](http://web.archive.org/web/20080118114736/http:/www.typophile.com/node/16975 \"Go to previous forum topic\") [logo design / online movie box office ›](http://web.archive.org/web/20080118114736/http:/www.typophile.com/node/17040 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080118114736/http://www.typophile.com/user/10616\" title=\"View user profile.\">tcdent</a>",
  "time": "<br>",
  "uid": "10616",
  "comments": [
    {
      "time": " 15.Jan.2006 1.43pm",
      "content": "The magenta works fine. It’s also appropriate because it’s a “process” color. I read the identity as “design process”; if, as I suspect from the url, you want people to see “is a,” maybe you should make the “1s” black also. Or maybe that’s complicating things too much.\n\nThe post office won’t be happy with that envelope. The return address should never be below the recipient address. It screws with their automatic readers.\n\nThe word is spelled “facsimile.”\n\n"
    },
    {
      "time": " 15.Jan.2006 1.51pm",
      "content": "hi travis,\n\njust came across your designs: very classic indeed, but i quite like it. yes, to me it’s perfectly readable. the notion of design as being something of a process comes to your mind first thing. and the overall impression is very professional.\n\ni’m wondering about a couple of minor things: don’t know about the periods between “telephone” and the actual number etc. - they’re not really needed since there’s a colour change. so they add some unnecessary disturbance.\n\nalso the black seems a bit harsh: have you tried other colours like very dark greyish blues and so on, that just might make it a little more modern. and then there might be something else beside colour missing to make it really up-to-date / cutting edge - can’t tell yu what. (may individual letter turned upside down, something you notice at a second glance) but that might be the european look at serifs ;-)\n\ncheers,  \nthomas\n\n"
    },
    {
      "time": " 15.Jan.2006 4.25pm",
      "content": "Thanks a bunch for your comments.\n\nThe name is supposed to read as “Process Design”, but I am getting mixed interpretations. Any ideas on how I can imporove the readability, or should I just leave it alone, and explain it to those who miss it?\n\nI studied the USPS guide to designing mailed pieces, i’m not sure what the official name was, quite thouroughly to see if I could make it work. I found that the bottom 5/8” of a mailed piece are reserved for a postal barcode, unless you print one on yourself. I am planning on using an applicaion called Addressix [http://www.a-sharp.com/addressix/](http://web.archive.org/), which has the capability to generate them to work around this. Are the return addresses read by machine as well?\n\nWow, facsimile, thanks a million, I would be kicking myself if I went to press with that.\n\nI agree with you on the periods Thomas, they really aren’t necessary.\n\nThanks for the help with the color, I am so used to projects being printed in 4C process that I tend to keep my text as close to 100% values as possible. I’m doing a 2C spot on this so I should take advantage of the opportunity.\n\nThanks,\n\nTravis\n\n"
    },
    {
      "time": " 15.Jan.2006 7.53pm",
      "content": "I think it would read unambiguously as “process design” if you just turned it over.\n\nTo the best of my recollection, the type nearest to the bottom edge of an envelope is interpreted as the destination address. The barcode will probably override all of this, but you may still have to put the barcode in the designated place.\n\n"
    },
    {
      "time": " 15.Jan.2006 8.31pm",
      "content": "<cite>I think it would read unambiguously as “process design” if you just turned it over.</cite>\n\nYou would think that. That’s how I had it initially, but everybody said “Design Process.” Gancing at it quickly, even I would see “design” first.\n\nI’m going to send a test envelope, just to be sure it works.\n\n"
    }
  ]
}
