{
  "id": "17312",
  "title": "Easy FontLab Workflow for Wimps ? ? ?",
  "forum": "Build",
  "tags": [

  ],
  "content": "BEST REGARDS TO ALL HERE IN THESE TYPOPHILE FORUMS  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nI’ve returned for a bit of beginners advice on the world of\n\nfont creation, or in this case modification.\n\nTHE QUESTION  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nI’ve done some reading and research in trying to find the\n\neasiest method to creating or modifying a usable font.\n\nThis is for a school project and I would simply be seeking\n\nto build on top of some pre-existing work; not at all for\n\nprofessional use or consumption.\n\nWhat I wanted to ask was,\n\nIS THERE A WAY TO OPEN STANDARD FONT FORMAT FILES i.e OTF TTF LWFN FFIL\n\nDIRECTLY INTO FONTLAB, so that the file opens with all the metrics and kerning in tact ? ? ?\n\nI AM IDEALLY looking to simply modify a work by\n\nfilling in BOWLS, changing the TERMINALS; I by no means expect to create a classic work.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nI found this file linked on a previous post .\n\n[http://groups.msn.com/FontLab/tipsandtricks.msnw?action=get\\_message&mvie...](http://web.archive.org/web/20080111030806/http:/groups.msn.com/FontLab/tipsandtricks.msnw?action=get_message&mview=0&ID_Message=2675 \"http://groups.msn.com/FontLab/tipsandtricks.msnw?action=get\\_message&mview=0&ID\\_Message=2675\")\n\n.\n\nIf the above mentioned DIRECT technique is not possible\n\nwould i then have to create a FULL CHARACTER GLYPH SET in ILLUSTRATOR\n\nand then manually port over each characters modified PATH ? ? ? ?\n\n——————————\n\nPLEASE PLEASE\n\nlend any and all advice on how i could\n\ncomplete a fairly simple yet fleshed out + usable\n\nmodified typeface\n\n.\n\nas always my thanks and praise to all\n\nthe supportive and knowledgeable members\n\nhere at TYPOPHILE .\n\n.\n\nPEAC BE WITH YOU\n\n.\n\nAerosyn-Lex\n\n [‹ FontLab Glitch: Percentage symbol doesn't appear](http://web.archive.org/web/20080111030806/http:/www.typophile.com/node/17394 \"Go to previous forum topic\") [Visual OpenType Layout Tool (VOLT) version 1.2 posted ›](http://web.archive.org/web/20080111030806/http:/www.typophile.com/node/17333 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080111030806/http://www.typophile.com/user/8574\" title=\"View user profile.\">Aerosyn-Lex Mes...</a>",
  "time": "<br>",
  "uid": "8574",
  "comments": [
    {
      "time": " 16.Jan.2006 6.35am",
      "content": "A-L, you should be able to simply open fonts in FontLab, either by drag-and-dropping the font onto the applicatio, or through the file menu. (There are settings in the Preferences window concerning th conversion of OpenType fonts; you should make sure that all features are imported when the font is opened.)\n\n"
    },
    {
      "time": " 16.Jan.2006 3.42pm",
      "content": "Thanks for the Reply Chester,\n\nMight I ask which file tends to work best?\n\nWould I need to have an OTF file or can I use the mac formats of LWFN+FFIL ?\n\n.\n\nthanks in advance\n\n.\n\nAerosyn-Lex\n\n. : : : S A N G R E . P A G A . P A R A . S A N G R E : : : .\n\n"
    },
    {
      "time": " 16.Jan.2006 8.43pm",
      "content": "A-L, I have never knowingly encountered either a LWFN or FFIL file. Wht are they? OTF, on the other hand, will open a charm with FontLab or FontLab Studio. If you have the software, why don’t you just open one of the font files? Only one way to verify if FontLab will open a font file: try it.\n\n"
    },
    {
      "time": " 16.Jan.2006 8.43pm",
      "content": "[/// Hit the Post button twice. Sorry. Go Habs! \\\\]\n\n"
    },
    {
      "time": " 16.Jan.2006 9.43pm",
      "content": "Thanks for the continued help Chester .\n\nI’m getting my hands on the software fairly soon\n\nand will give it a try as soon as possible .\n\nhere’s to hoping it works . . .\n\n. . .\n\nOh, and LWFN + FFIL are older mac format types, one being a Printer font\n\nthe other being a Screen font.\n\nPostScript Type 1 outline font with Macintosh bitmapped font suitcase (LWFN)\n\n.\n\nBest Regards .\n\n.\n\nALMs\n\n. : : : S A N G R E . P A G A . P A R A . S A N G R E : : : .\n\n"
    },
    {
      "time": " 16.Jan.2006 10.00pm",
      "content": "You did it too!  \nI always thought the old files for PST1 fonts with NFNT and FOND... We just called them “screen fonts” and “printer fonts”.\n\n"
    },
    {
      "time": " 17.Jan.2006 6.26pm",
      "content": "Aerosyn-Lex,\n\nany Mac font editor from Fontlab Ltd. (TypeTool, Fontographer, FontLab, FontLab Studio) can open LWFN and FFIL files (it’s better to open the FFIL files since they contain metrics and kerning, and will automatically locate the matching LWFN file).\n\nThe Windows versions of our software cannot open these files, except TransType SE and TransType Pro for Windows, that can convert them into PC formats. Also, FontLab Studio 5 for Windows can open LWFN and FFIL files if they have been encoded as MacBinary (.bin) or BinHex (.hqx).\n\nRegards,  \nAdam Twardoch  \nFontlab Ltd.\n\n"
    }
  ]
}
