{
  "id": "17319",
  "title": "Company logo as font",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi, I am trying to create a font for a client with the logo in it, so they can use the logo in applications that dont support eps/pdf. I have pasted the logo into a letter in fontlab, and everything looks great. But when I try to use the font (insert the logo into an application by typing the letter) the outlines look all jagged. I have attached a screenshot from fontlab and a screenshot from an application after the logo has been inserted.\n\nAny suggestions to make the logo appear as it should would be appreciated.\n\nOystein\n\n| Attachment | Size |\n| --- | --- |\n| [fontlab.jpg](http://web.archive.org/web/20070808065301/http:/typophile.com/files/fontlab.jpg) | 53.69 KB |\n| [fontinuse.jpg](http://web.archive.org/web/20070808065301/http:/typophile.com/files/fontinuse.jpg) | 34.29 KB |\n\n [‹ TTHmachine beta2 release (TTF hinting)](http://web.archive.org/web/20070808065301/http:/typophile.com/node/17415 \"Go to previous forum topic\") [Feature hacks and stylistic sets ›](http://web.archive.org/web/20070808065301/http:/typophile.com/node/17262 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070808065301/http://typophile.com/user/2590\" title=\"View user profile.\">oystein</a>",
  "time": "<br>",
  "uid": "2590",
  "comments": [
    {
      "time": " 17.Jan.2006 12.11pm",
      "content": "Offhand, I’d say your hinting is WAY off, but I’m quite confident that someone else will correct me if I’m wrong...\n\n"
    },
    {
      "time": " 18.Jan.2006 3.37am",
      "content": "Ok, thanks Nick, so I’ll try to get into the hinting.…  \nIt might also have something to do with the font generation, because it looks just as bad on the print as it does on the screen. But what do I know?\n\n"
    },
    {
      "time": " 18.Jan.2006 4.29am",
      "content": "This is not because of hinting. The contours look like being processed with errors in Postscript interpreter. I feel I saw the same results in some old version of Corel Draw very long ago.\n\nRegards,  \nJohnych\n\n"
    },
    {
      "time": " 18.Jan.2006 4.49am",
      "content": "Could this be happening because your points are not at the extremes of the curves?\n\n"
    },
    {
      "time": " 18.Jan.2006 7.27am",
      "content": "No, there’s no problem with the placement of the points.\n\nI made it work now by opening a system font I had, and putting my vektor graphics into one of the glyphs in the font, and then generating a postscript font.\n\nIn my first attempt I made a new font from scratch, which gave me the results you have seen on the attached files.\n\nSo in my view it has to be something with my settings.\n\n"
    },
    {
      "time": " 18.Jan.2006 7.55am",
      "content": "_No, there’s no problem with the placement of the points._\n\nYes there is! You need to have your points on the extremes. And you have supuerflous points in the middle of curves—where you don’t need them. These are probably what is causing the distortion of your forms.\n\n"
    },
    {
      "time": " 18.Jan.2006 8.56am",
      "content": "Dan’s right about the extrema problem, primarily on the s (correct positions are marked in red). Also, the connection on the left side of the counter of the e does not appear to be smooth; others might not be, as well.\n\n ![](http://web.archive.org/web/20070808065301im_/http:/typophile.com/files/bad_s.gif)\n\n"
    },
    {
      "time": " 19.Jan.2006 7.31am",
      "content": "Thanks for the feedback and suggestions. I don’t know much about FontLab as you can tell, however, I have some problems with your solution.\n\nFor comparison I have included two screenshots:  \nOne from the S glyph after opening the original font (Klavika) in fontlab,  \nand the other from the same glyph after being outlined in illustrator and then imported into FontLab.\n\nAs you can see; they both have superflous points, and none of them have points on the extremes marked by Nick (thanks for the shown example, no disrespect).  \nHowever, the points are not placed on the exact same spot. I agree that this is part of the problem, but it’s not all.\n\nAs mentioned above:  \nI made it work by opening a system font I had, and putting my vektor graphics (the logo) into one of the glyphs in the font, and then generating a postscript font. There’s only some problems on the far left side of the glyph e and d, where there are two points close to eachother.\n\nAnd if you look at the two pictures on my first post in this topic, there has to be something more than the placement of the points for it to be that messed up.\n\n[Logo](http://web.archive.org/web/20070808065301/http:/www.viktig.no/temp/Logo.jpg)  \n [Original Font](http://web.archive.org/web/20070808065301/http:/www.viktig.no/temp/OriginalFont.jpg)\n\nPS Nick, how do you attach images for instant view on a reply?\n\n"
    },
    {
      "time": " 19.Jan.2006 4.01pm",
      "content": "The differences between the two examples you show are utterly immaterial, because neither of them is correct Postscript, and _that’s_ your problem. The laws of Postscript are not as immutable as, say, the laws of physics, but, if you break them, they carry a penalty. In this case, lack of points at the extremes causes lousy output; non-smooth connections which should be smooth cause lousy output; unnecessary points can cause lousy output.\n\nIf you came to this forum for advice, it would be in your best interests to TAKE THE FREAKING ADVICE, instead of arguing with it ... unless, of course, you would rather **be right** (at least in your own mind) than **get it right**. And, right below the box in which you type your comments, there’s a single line of blue type which says “Insert image”...much easier than inserting a link to an image residing on a remote website.\n\n"
    },
    {
      "time": " 20.Jan.2006 2.21am",
      "content": "Hey Nick, thanks for taking your time to explain, but there’s no need to be rude. I came here to learn, not only to be told what’s right. As I have pointed out, I don’t know much about FontLab, just started using it. And I also pointed out that I wasn’t dissatisfied with your help, I just didn’t understand. But I guess I’ll settle for now….\n\nOystein\n\n"
    }
  ]
}
