{
  "id": "17336",
  "title": "Surfs Up Menu",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I am doing a menu board for a client named Surfs Up Tanning. The menu will advertise their pricing for the different tanning packages they offer. I haven't done the typography yet, but I was wanting to get opinions on the layout. I am concerned the anges are too much.\n\nThe menu will be split into 2 sections. The notces cutout from the top of the shapes will hold the title of the section.\n\n ![](http://web.archive.org/web/20130304225330im_/http:/typophile.com/files/menu.gif)\n\n",
  "author": "cannon46",
  "time": "16 Jan 2006 — 1:45pm",
  "uid": "1739",
  "comments": [
    {
      "time": "17 Jan 2006 — 3:23pm",
      "content": "Unless these shapes are for an index card its silly. Make the communication clear and simple.\n\n"
    },
    {
      "time": "18 Jan 2006 — 7:09am",
      "content": "A more conservative approach then...\n\n ![](http://web.archive.org/web/20130304225330im_/http:/typophile.com/files/menu2.gif)\n\n"
    },
    {
      "time": "18 Jan 2006 — 9:04am",
      "content": "Tom:\n\nLong time no hear from, eh? Maybe try creating some interest with a background texture, for example…\n\nSurfsUpBackground.jpg (Tom, how do you post images now? I haven't been on here for awhile and I don't see an image upload option.)\n\nI just used a generic texture, but perhaps more of a sandlike texture would be appropriate…or maybe a really close up view of some tanned skin.\n\nAloha.\n\n"
    },
    {
      "time": "18 Jan 2006 — 9:29am",
      "content": "Hey Scott!\n\nI haven't been on here in awhile either. You load images by hitting \"insert image\" directly above \"formatting guidelines\" below the box you use to reply. I will look into a texture. Good suggestion!\n\n"
    },
    {
      "time": "19 Jan 2006 — 7:18am",
      "content": "I agree on the texture suggestion.\n\nOne other thing: it bugs me that the title boxes don't left-align with the items below them. It's so close but still noticeably off that it bothers my eye.\n\n"
    },
    {
      "time": "19 Jan 2006 — 2:04pm",
      "content": "Call me crazy but I think the slight funkiness of your first menu works better than the boring second one. The logo doesn't have a single straight line in it, so why not reference the curves of the wave more? The key is not going overboard....\n\n"
    },
    {
      "time": "19 Jan 2006 — 2:09pm",
      "content": "Tom, the new version is cleaner and gives a direct message about their services and costs. It allows you to focus your design on the logo. I'm not in love with the gradient, I'm not sure it adds anything. You might also make a version that allows the prices to be blank so if the prices change the client could take the blanks and put them into a printer and print out the new prices.\n\n"
    },
    {
      "time": "20 Jan 2006 — 9:29am",
      "content": "Unfortunately, that \"insert image\" button doesn't show up in my browser (Safari 1.3.2). I guess I'll have to try getting online through another browser to see if that helps. Anybody else ever have this problem?\n\n"
    },
    {
      "time": "20 Jan 2006 — 9:30am",
      "content": "Still no \"insert image\" button. Has typophile decided to boycott my images?\n\n"
    },
    {
      "time": "20 Jan 2006 — 9:39am",
      "content": "you need to install Flash 8 player to use the insert image function.\n\n"
    },
    {
      "time": "20 Jan 2006 — 9:56am",
      "content": "Thanks, Paul.\n\nIt's a little late now, but this illustrates what I was suggesting earlier…\n\n ![](http://web.archive.org/web/20130304225330im_/http:/typophile.com/files/Background.jpg)\n\nAlso, House Industries just released a bunch of backgrounds that might inspire something interesting.\n\nAs suggested by someone else earlier, perhaps some organic, curvy shape could work well…as long as it is subtle (not too much contrast) so that it doens't distract from the logo and information.\n\nAloha,  \nScott\n\n"
    },
    {
      "time": "20 Jan 2006 — 12:59pm",
      "content": "I can't upload my new layouts to a web server right now, so I have to use the Insert button. There are six layouts but they aren't wide so they souldn't mess up anyones browser windows.\n\n ![](http://web.archive.org/web/20130304225330im_/http:/typophile.com/files/menu2.jpg)\n  \n\n ![](http://web.archive.org/web/20130304225330im_/http:/typophile.com/files/menu3.jpg)\n  \n\n ![](http://web.archive.org/web/20130304225330im_/http:/typophile.com/files/menu6.jpg)\n\n"
    },
    {
      "time": "20 Jan 2006 — 1:03pm",
      "content": "My favorite is the 3rd version. It doesn't look washed out. Number 2 has various thicknesses and all lines go horizontally. All were inspired by images I have seen on House's website and Scott's thumbnail.\n\n"
    },
    {
      "time": "20 Jan 2006 — 1:29pm",
      "content": "Tom the third version is very clear and easy to read. The only thing I would do if this is a process printing job is make the headlines in black. You are now fighting a texture.\n\n"
    },
    {
      "time": "20 Jan 2006 — 1:36pm",
      "content": "This is great, Tom. 3rd is the best because of the contrast. Does the logo have to be centered? Can you offset it and add an address or something? Is this local - Utah?\n\n"
    },
    {
      "time": "20 Jan 2006 — 2:50pm",
      "content": "#3 looks great, Tom.\n\n"
    },
    {
      "time": "20 Jan 2006 — 5:05pm",
      "content": "Tom,\n\nNumber 3 is great. Maybe you could try to have a background color on the \"header tabs\"? Maybe use your red and have the text in white (or tannish)?\n\n"
    },
    {
      "time": "21 Jan 2006 — 5:14am",
      "content": "Some of the suggestions by Dan (Madden) and Scott offer you opportunities that I think you need to exploit, to me the logo is relegated by its present location/background to an afterthought, removing the background or some form of curve to the box would serve it better. Those backgrounds have that fifties textile design feel to them that is a characteristic of House, but not entirely suitable for this use (the fifties style is increased by the offset borders to your boxes), I think that a closeup view of tanned skin or an abstract soft focus texture in that vein would serve better.  \nTim\n\n"
    },
    {
      "time": "22 Jan 2006 — 11:16am",
      "content": "This is definitely moving forward. Good stuff, Tom. Now that you've got some good character in the menu area, the red block with the logo's starting to feel too slick and empty. How about using a Hawaiian shirt pattern in the red area, with the pattern at a 85–90% of the red area? It would give texture and character to the red field but won't interfere unduly with the logo. This would take that surf feel an extra step. This might even work in the table areas, too. Take it all the way.\n\nI'm not so sure about using the skin as a background. Unless you have the budget for it, I think you'll have a hard time not having it come out weird from stock photos.\n\nOne last thing, I think the horizontal rules in the tables help and also make them feel less empty, so I recommend keeping them.\n\n"
    },
    {
      "time": "23 Jan 2006 — 2:25pm",
      "content": "Atatched is the updated menu. I really didn't want to use a photograph on this project because I did the logo by hand I wanted to draw everything on the poster. After this I will also be doing stationary using the same elements. It is also cheaper to draw then pay a photographer or use stock. All suggestions made have been great.\n\nTiffany, this is a local tanning salon in Louisville, KY. At first I didn't want to center the logo (layout #1), but it fits best with the current layout. I added handdrawn lei hawaii flowers as a halftone (thanks Chris) to help with the logo being centered.\n\nDan, I feel that the burgundy fits better than black. It looks more fresh since there would be no black anywhere else.\n\nAny more suggestions are welcome. I am up for anything.\n\n ![](http://web.archive.org/web/20130304225330im_/http:/typophile.com/files/menu6.gif)\n\n"
    },
    {
      "time": "24 Jan 2006 — 2:02am",
      "content": "That background on the burgundy surround really improves the look and pulls the elements together more. I think you are about done.  \nTim\n\n"
    },
    {
      "time": "24 Jan 2006 — 2:03am",
      "content": "whats the main font you're using? I need to satisfy an itch!\n\n"
    },
    {
      "time": "24 Jan 2006 — 6:22am",
      "content": "Cronos.\n\n"
    },
    {
      "time": "25 Jan 2006 — 11:40am",
      "content": "Very nice work on the flowers.\n\nPut a fork in it, it's done.\n\n"
    },
    {
      "time": "25 Jan 2006 — 12:58pm",
      "content": "Tom the Knock out works, good work\n\n"
    },
    {
      "time": "25 Jan 2006 — 5:58pm",
      "content": "Nice work. I dig the lettering in the logo. I like the final colors, though it does make me suspect that the salon owner is a USC grad.\n\n"
    },
    {
      "time": "31 Jan 2006 — 8:52am",
      "content": "That background pattern really supports the logo, Tom. Nice work. I retract my suggestion to justify the logo to the left or right as now it rests nicely in the middle of the pattern. Love it.\n\n"
    },
    {
      "time": "13 Feb 2006 — 6:41pm",
      "content": "This is the letterhead and biz card for the stationary. The card will be 2-sided. Any suggestions would be helpful.\n\n ![](http://web.archive.org/web/20130304225330im_/http:/typophile.com/files/letterhead2.gif)\n  \n\n ![](http://web.archive.org/web/20130304225330im_/http:/typophile.com/files/SurfsUp_card.gif)\n\n"
    },
    {
      "time": "14 Feb 2006 — 6:41am",
      "content": "It might be a bit too busy for a business letterhead, I'd try removing/or knocking back some elements, like the woven texture and the fine border, the address looks rather difficult to read easily, it would be easier to assess this with some mocked-up text in the letter. (It might be worth looking at having the logo and bar at the top of the letterhead and having the sandy background for a more obvious look.)  \nOn the business card I would like to see that floral pattern on the logo side as well as the name side.  \nTim\n\n"
    },
    {
      "time": "15 Feb 2006 — 8:37am",
      "content": "I think the floral pattern really needs to be utilised in the letterhead. The card is nice but the letterhead is far too busy i feel.\n\nthe logo side of the bc looks good with the white so why not use that, with a floral detail hanging of the letterhead, very subtly. And I think definately increase address size.\n\nTo be brutly honest I see no reason for the texture, it adds nothing in the case of the letterhead, you could build a really nice corporate look following the visual style of the bc.\n\n"
    },
    {
      "time": "16 Feb 2006 — 4:26pm",
      "content": "I definitely made the letterhead too busy. Here is a toned down version. I have decided to print the back of the letterhead with the woven texture. I really like what I have now. Also, The type is 9 point size. It doesn't render well as a gif but it should be a fine size.\n\n ![](http://web.archive.org/web/20130304225330im_/http:/typophile.com/files/surfsup_letter.gif)\n\n"
    },
    {
      "time": "16 Feb 2006 — 4:48pm",
      "content": " ![](http://web.archive.org/web/20130304225330im_/http:/typophile.com/files/su_card.gif)\n\n"
    },
    {
      "time": "16 Feb 2006 — 8:05pm",
      "content": "I realized I forgot about the address in my last version. To make the address work with the logo, I moved the logo to the left with the left justified address.\n\n ![](http://web.archive.org/web/20130304225330im_/http:/typophile.com/files/surfsup_letter2.gif)\n\n"
    },
    {
      "time": "17 Feb 2006 — 1:35am",
      "content": "Nice work cannon, your very nearly there.\n\nCan I make a slight picky suggestion?! the bc floral pattern could be switched around to the bottom just to match the letterhead, and make the red bit white and the copy red again to match up?\n\ni just think it will appear even more as a family unit that way.\n\n"
    },
    {
      "time": "17 Feb 2006 — 8:08am",
      "content": "I have moved the address again. It feels more loose than the other layouts.\n\nAs far as literally matching the address on the biz card, I tried it and it didn't look good. It was too much white and it wasn't as interesting as having one side all red. I think they match even when they aren't exact matches. I think they are consistent.\n\n ![](http://web.archive.org/web/20130304225330im_/http:/typophile.com/files/su4.gif)\n\n"
    },
    {
      "time": "17 Feb 2006 — 5:53pm",
      "content": "Is there a reason why the address info is placed where it is? I think that the average business owner, printing off of MS Word is gonna have a heck of a time trying to format their document around the logo and address block. Unless you are willing to design a template for them.\n\nCould the address be right above the flower bar? Perhaps spread across the width of the bar on one or two lines of text.\n\n"
    },
    {
      "time": "18 Feb 2006 — 8:38am",
      "content": "Is this better?\n\n ![](http://web.archive.org/web/20130304225330im_/http:/typophile.com/files/letter_b.gif)\n\n"
    },
    {
      "time": "18 Feb 2006 — 8:50am",
      "content": "Yeah, that's better. Although I preferred the logo off to the left, I think the way it is now will be easier for your client to use. They don't want to be wasting pages of letterhead adjusting their margins to fit your page design.\n\nThe colors and logo look great though. Just don't forget a black and white version for newspaper ads and such.\n\n"
    }
  ]
}
