{
  "id": "17333",
  "title": "Visual OpenType Layout Tool (VOLT) version 1.2 posted",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Download the update from...\n\n[http://groups.msn.com/MicrosoftVOLTuserscommunity/](http://web.archive.org/web/20131019063534/http:/groups.msn.com/MicrosoftVOLTuserscommunity/ \"http://groups.msn.com/MicrosoftVOLTuserscommunity/\")\n\nSergey's release notes...\n\n**Microsoft VOLT 1.2.236 release notes**\n\nNew VOLT release includes several important new features:\n\n**Context exclusion syntax for contextual lookups.**\n\nThis is the new way of using contexts in VOLT lookups, allowing font developer to do things that were not possible before and to implement lookups more efficiently. Inside the lookup user can use 'EXCEPT' contexts and substitution or positioning will happen only if input does not match excluded context. To do this, you simply type 'EXCEPT' word (case sensitive) in the beginning of context you want to exclude. You can use both normal and 'EXCEPT' context in one lookup. The only restriction is to put all 'EXCEPT' contexts before normal ones.\n\n**Here are few simple examples of how context exceptions can be used:**\n\nFirst, in this example we’ll substitute letters with special forms at the end of the words. Normally, you can't do this or can do with very unintuitive.\n\n\\<Letters\\> -\\> \\<EndOfWordForms\\>  \nIn context:  \nEXCEPT | \\<Letters\\>\n\nThe second example mixes normal and except contexts, making code more readable. Before, you would need at least two lookups to do this and this would cause unnecessary substitutions.\n\nA -\\> A.1  \nIn context:  \nEXCEPT | x y  \n | x\n\n**Export and import for multiple lookups and multiple groups**\n\nYou can now select multiple lookups and export them into single file. Same can be done with groups.\n\nThis change required slight changes in export file syntax. This is important if you have lookups or groups exported from older version and want to use them in the new VOLT.\n\nEven if you have one lookup in the file, it should be appended with the 'END' keyword at the very end. (You can use your favorite text editor for that). Please note: if you import lookup from new VOLT into older version, only the first lookup will be imported.\n\nIf you have a positioning lookup that uses anchors, 'END\\_POSITION' keyword should be moved before all anchors in the file. And, of course, do not forget the 'END'.\n\n**Main window improvements**\n\nYou can now select and drag multiple lookups from lookup list into feature tree. You can delete several lookups as well.\n\nFeature tree is not refreshing and expanding after every change anymore. Also, if you select a feature node in the tree, lookup list will automatically select all lookups associated with this feature – a convenient way to check if some lookup is missing from the feature.\n\nUsers may re-import cmap table from the font at any time. It is useful when font had been modified outside VOLT with some other tools. You just should not forget to do this first thing after you opened font in VOLT - otherwise cmap will be overwritten by data stored in the VOLT project.\n\n**Proofing tool improved experience**\n\nNow, when you close the proofing tool window and open it again it restores all parameters that you used to test your font – input glyphs, script and language system, features applied.\n\nAlso, debugging your lookups is made easier. Instead of using lookup navigation buttons, you can just use combobox above it and jump directly to the lookup you are interested in.\n\n**Glyph properties window improvements**\n\nCharacter codes for surrogates can be entered as scalar values instead of surrogate pairs. Surrogate pair format is still recognized but immediately converted into scalar value. Please note that because of that change older versions of VOLT will not understand fonts saved from this new version, but only if surrogate characters are used in the project.\n\nSearch box had been added to glyph editor – at the very top, above glyph properties text box with Find button. Button is the same as it used to be, but when you type into the box VOLT will dynamically search for and select first glyph that has specified prefix. Also, if you type U+xxxx it will search for the glyph which has this character mapped to it, e.g. U+61 or U+0061 will select Small Latin ‘a’.\n\n**Positioning lookup editing**\n\nNew, convenient model to restrict anchor movement added to positioning window. When dragging an anchor with the mouse you can press Shift key to allow anchor only move horizontally, and press Control key for vertical-only movement. If you press Control/Shift in the middle of the dragging it will have the same effect as if it was pressed from the very beginning - anchor will jump onto the original vertical or horizontal position.\n\n**Compilation options**\n\nYou may now control compilation by instructing VOLT to use extension lookups or choose to use format 2 for pair positioning lookups (by default, format 1 is used). These options are saved in the project and used every time project is compiled. Use this option only when it is needed – when size of the tables in the font becomes too big to fit your lookups.\n\n**Various bug fixes**\n\nMultiple minor and not so minor bugs fixed in VOLT.\n\n**Supplemental files updated**\n\nSupplemental files are updated. New Uniscribe is taken from a recent Windows Vista build, integrating the latest changes to script shaping engines. Mangal font is also latest Vista version. It is renamed to \"Mangal Sample\" and has hints stripped out.\n\n",
  "author": "Si_Daniels",
  "time": "16 Jan 2006 — 11:39am",
  "uid": "1049",
  "comments": [
    {
      "time": "16 Jan 2006 — 3:51pm",
      "content": "Hi Simon,  \nThnx for the announcement. I got the latest VOLT, but there seems to be a bug in the installation process (using XP here). When installing it points out at least 3 version conflicts, claims that my existing files r more recent, and recommends that I keep my existing files. When I got to the supplemental files I realized something was wrong and, sure enough, the supplemental files contained in the latest VOLT are newer, though the installation claims the opposite. If I followed the install advice I would not have got the new supplements.\n\nNow I do not know if I was supposed to update the dll's that the install claimed were \"older\". Any advice?\n\nBest  \nI\n\n"
    },
    {
      "time": "16 Jan 2006 — 6:12pm",
      "content": "It is known problem with VOLT setups. I planned to move VOLT installation to the better technology for this release but did not have time for that, so this will be left for the next update.\n\nFor this version you can do follwoing:\n\n1. Uninstall all previous versions of VOLT.  \n2. When installing this update, keep files with higher version number in Windows\\System32 folder.  \n3. (If you did not unistall VOLT as I recommended in item 1,) overwrite any file in VOLT installation folder.\n\nThanks,  \nSergey\n\n"
    },
    {
      "time": "16 Jan 2006 — 8:06pm",
      "content": "Thank you very much, Sergey, for your help!\n\nI\n\n"
    }
  ]
}
