{
  "id": "17371",
  "title": "for the love of blackletter",
  "forum": "vinceconnare's blog",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20101123093253im_/http:/typophile.com/files/capoteuglysaloon.gif)\n  \nI received an email from a friend who is a TV producer and she wrote an article in Broadcast and this blackletter was the picture... blackletter is font of the month. \n",
  "author": "<a href=\"/web/20101123093253/http://typophile.com/user/7029\" title=\"View user profile.\">vinceconnare</a>",
  "time": "<br>",
  "uid": "7029",
  "comments": [
    {
      "time": "",
      "content": "This is the article to go with the blackletter 'coyote ugly saloon' t-shirt from Broadcast: Freelancer News\n\n20 'real' tips for working in TV\n\nGetting on in TV is not just about having a great CV and good contacts. It is also about blagging, bluffing and bullsh\\*t, as producer Helen Kristic explains.\n\n1. In public (and particularly in meetings with your chiefs), always exaggerate your level of excitement at any new venture or idea suggested. In private moan and whinge to anyone who will listen about absolutely everything – especially how every talent less individual except you seems to be getting promoted to producer, production manager, AP…\n\n2. If you are a man you will probably be gay. If not try and appear sexually ambivalent at all times. This will help your career prospects enormously and fast track you to Series or executive producer status. Floral Liberty shirts and Jo Malone cologne are a good investment.\n\n3. Another point to consider if you are a man - sniffing incessantly and NOT blowing your nose is a dead giveaway…of being straight. Keep a hankie to hand and work on the above.\n\n4. If you’re lucky enough to have Schedule D status, ensure you start your working day with an outrageously expensive grande skinny latte from Café Nero, Starbucks or Costa Coffee, which should guarantee not being able to make your January 31st tax payment.\n\n5. If you’re PAYE, go to the nearest supermarket and purchase a microwave meal. Nuke between the hours of 12.30 and 2.30pm to ensure a sickly aroma permeates throughout the office causing much discomfort to fellow impoverished colleagues eating lunch at their desks. Any dishes containing cream or mince beef release exceptionally long lasting sickly odours.\n\n6. If you are a woman under the age of 40 wear rectangular glasses, combats (bare midriff natch) and say 'Fabbbb-uuuu-lous' at least 30 times a day. It doesn’t matter if your tum is a bit out of condition – it HAS to be on show and the more flesh, the better your prospects.\n\n7. If you are a woman over the age of 40, appear as eccentric as possible. Regularly weave the words 'awesome', ‘wicked’ and ‘fly’ into conversation. Make sure your clothing would be more suitable on a 25 year old and accessorize with a man who is at least ten years younger. Talk in explicit detail to anyone within earshot about the delights of sleeping with a younger man.\n\n8. When on the phone politely say 'goodbye' to the person on the other end then slam it down and shout 'What an absolute Wa\\*\\*er!' This of course means he’s perfect for the show and without wanting to appear too keen, tensely wait thirty minutes, call back and book him. Prepare to then spend the entire time of your eight week production having to be lovely to people you would classify as “wa\\*\\*ers”.\n\n9. Once booked for a show, contributors should thereafter be referred to as “punters”. Never ever EVER end up in a relationship with a punter. What was Ulrika thinking?\n\n10. Terminology as illustrated above, is incredibly important if you are to, like most of the industry, blag your way through the technical aspects of your television career. It is imperative to use words like deconstruction, textual, pacey and narrative. And most importantly, when discussing programmes, don’t talk about how they look or sound, talk about how they FEEL. If you like something, it's never good or nice - it's SEXY.\n\n11. Pretend to understand the difference between 'Digi' and 'Beta', Off line & On Line, 4:3 and 16:9, jazz and shared drives.\n\n12. Never miss an opportunity particularly among friends who work in the real world. Every time anyone tells a story or recounts anything mildly interesting, hold up your index finger and say \"There could be a programme in that!\".\n\n13. Adopt a hobby as you will be unemployed most of your life. Forget about a mortgage, pension fund or membership to Soho House. NB: Regular use of cocaine is NOT classified as a hobby.\n\n14. Get used to meeting new people and hating them on sight – particularly women who can afford to buy Mulberry bags and expose their midriff and men with perfect teeth who are often heard declaring “there could be a programme in that!”\n\n15. Have ridiculously loud arguments with your production manager on a daily basis about money. This is good therapy for you and it’s always fascinating to hear a production manager’s response to why you can’t get a car home after studio.\n\n16. Ensure that you book a car home after studio and don’t tell the production manager. You’ll be long gone and your contract finished by the time the invoice arrives.\n\n17. With exceptionally difficult production managers, you need to sustain your sanity and sense of wellbeing. This can be achieved whenever a request is received for something to be sent, by asking if they’d like it biked it over.\n\n18. Understand that 'junior researcher', 'production secretary’, and 'receptionist' are, unfortunately, all the same thing.\n\n19. Understand that the most important member of staff is the runner. He or she is key to every production as they are the only ones who know what the hell is going on. Treat them with the greatest respect because the way television works, you will no doubt be working for them in a years time!\n\n20. Lastly keep your sense of humour and try not to get cynical. There’s thousands out there that want your job you know…\n\nHelen Kristic is an entertainment and event producer who aspires to one day, work in reality television and to have a weekly column in a national newspaper. She quite fancies something along the lines of a satirical view of television production. She is an avid fan of to-do lists and currently needs to fill in her CV details on this website and put a lot of unwanted bits n bobs on ebay. She loves New York Cheesecake, recycles regularly and is currently 8lbs overweight.\n\n"
    }
  ]
}
