{
  "id": "17384",
  "title": "General Posting Guidelines",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm thinking of putting together a \"General Posting Guidelines\" thread (not this one) that would remain at the top of the posting area in the General Discussion Board mainly to inform newcomers to the boards on how to get the most out of the typophile experience. I'm wondering:\n\n1) Is this a good idea?\n\n2)What are some standards you think should be recommended. Here are a couple i think there should be:\n\nA) Search before you post: many topic have been discussed before. Please use the search function before posting a new thread to see if the subject you're interested in has already been covered.\n\nB) Image guidelines: Images MUST be in RGB format and should not exceed certain dimensions (what dimensions should those be? you tell me!)\n\nSo, post here with what you think our community guidelines should be. (Or if there are already some in place, please point me to them!) Thnx for looking.\n\n\\*\\*\\*Update: the guidelines can be found at [http://typophile.com/readme](http://web.archive.org/web/20140803181117/http:/typophile.com/readme \"http://typophile.com/readme\")\n\n",
  "author": "paul d hunt",
  "time": "18 Jan 2006 — 11:52am",
  "uid": "7006",
  "comments": [
    {
      "time": "18 Jan 2006 — 12:32pm",
      "content": "You might ask them to post type ID questions to the correct forum and not to hijack a thread by saying, \"great topic guys, now how about tell me the name of this font?\"\n\nChrisL\n\nPS: I think the size is about 600px wide?\n\n"
    },
    {
      "time": "18 Jan 2006 — 12:44pm",
      "content": "I have long advocated posting a request to refrain from personal attacks--at the place where people do their posts. Here is the one from Typographica:\n\n\"Please refrain from off-topic banter and personal attacks. Your comment may be edited or removed at the discretion of Typographica editors. Our goal is not to stifle debate but to keep it relevant.\"\n\nI would not want the stuff about refraining from off-topic banter, though. In good Talmudic style, some of the best stuff on Typophile happens when people go off on a tangent and people join in the discussion of it. A little irrelevant humor is welcome also.\n\nAnd the policing warning is not a necessity. Typophile is so active that it is probably unreasonable to ask volunteers to police it. But if the notice is there, then a firm warning from a moderator, and a very rare after-the-fact removal with an explanation might be healthy also.\n\n"
    },
    {
      "time": "18 Jan 2006 — 12:50pm",
      "content": "\"A little irrelevant humor is welcome also.\"\n\n:-)\n\nChrisL\n\n"
    },
    {
      "time": "18 Jan 2006 — 1:15pm",
      "content": "I would love to see a small navigational feature that can direct posters to appropriate categories for best response.\n\nThis is already posted as a guide in the Type ID section but new topic subjects such as \"Help!\" or \"What is this font?\" is less inviting to open than slightly more descriptive topics like: \"Please ID script face on store sign\" which might interest the right members.\n\n_B) Image guidelines: Images MUST be in RGB format and should not exceed certain dimensions (what dimensions should those be? you tell me!)_\n\nYou should probably repeat the requirements for Flash 8 player requirement.\n\n"
    },
    {
      "time": "18 Jan 2006 — 3:24pm",
      "content": "I think people should know that jpeg is the preferred format for attachments as well. I get annoyed when I find myself involuntarily downloading a pdf file that I then need to delete from my hard drive.\n\nAgree that descriptive titles should be encouraged for the posts, especially on the Type ID board. And also a suggestion that they read the FAQ before posting on that particular forum.\n\n"
    },
    {
      "time": "18 Jan 2006 — 3:47pm",
      "content": "I don't know that jpeg _is_ always the preferred format for attachments. In type critiques, I want a pdf, so I can zoom in.\n\n"
    },
    {
      "time": "18 Jan 2006 — 3:53pm",
      "content": "_I don’t know that jpeg is always the preferred format for attachments. In type critiques, I want a pdf, so I can zoom in._\n\nyes, i'm hoping to develop similar guidelines for other areas as well. for type crits i want to suggest that posters include\n\n1) a gif/jpg/png showing large detail of the font\n\n2) a pdf with text/display showings to show the font off in context.\n\n"
    },
    {
      "time": "18 Jan 2006 — 8:18pm",
      "content": "Just echoing **patty** and **speter** : it would be a good idea to have some guidelines for posting images/pdfs to the Critique section. Also, and I'm not sure how to correct this, but it seems like a lot of image uploads to that section fail to show up properly, although a helpful, more experienced person usually pops up and fixes the problem.\n\n"
    },
    {
      "time": "18 Jan 2006 — 8:57pm",
      "content": "GIF is preferable to JPG for type viewing pleasure. Isn't the quality better too? ;^) And doesn't PNG not them both off their pedastal?\n\n"
    },
    {
      "time": "19 Jan 2006 — 5:44am",
      "content": "PNG is better but maybe the folks hosting the show have reasons for a particular format?\n\nChrisL\n\n"
    },
    {
      "time": "19 Jan 2006 — 6:31am",
      "content": "I think PNG doesn't have universal compatability. IE still doesn't like PNGs with transparencies, I think.\n\nI agree that some simple guidelines, more on the technical side than anything, would be good. Can topics be 'pinned' to the top of the General Discussions area? Other bboards I've seen do this with FAQ and guideline threads. Also, perhaps you could include a very brief and courteous line or two about requesting free fonts on Typophile.\n\n"
    },
    {
      "time": "19 Jan 2006 — 6:41am",
      "content": "_Can topics be ‘pinned’ to the top of the General Discussions area?_\n\nyes. once i have my guidelines together there will be a closed thread that will remain at the top of the topics list with guidelines.\n\n_Also, perhaps you could include a very brief and courteous line or two about requesting free fonts on Typophile._\n\ndefinately. it will refer free font seekers to this wiki entry: [FAQ\\_Free](http://web.archive.org/web/20140803181117/http:/typophile.com/wiki/FAQ_Free).\n\n"
    },
    {
      "time": "19 Jan 2006 — 8:34am",
      "content": "PDF is a pain, but I concur that for type critique, it's useful.\n\nIdeally, everyone would post inline images. Having to navigate to another page or download a PDF just gets in the way, IMHO.\n\n"
    },
    {
      "time": "20 Jan 2006 — 3:38am",
      "content": "PDFs never launch with me. It may be a setting on IE6? When I click it and try to open it, it (Acrobat) tells me that the file does not exist so I always end up donloading it to my PC separately and then opening it from the location where I had to save it.\n\nI have a funny feeling I've just done what Chris can't abide which is to change the topic halfway through. BTW, any idea what this font is?\n\n ![](http://web.archive.org/web/20140803181117im_/http:/typophile.com/files/Trebuchet.jpg)\n Yes I know the quality is rubbish: it's a JPEG.\n\nOn size of images, I like 640 x 480px (the size of screens once) but it turns out that that's too big for the column width available without scrolling. 600 (the size for Type Battle) seems a reasonable suggestion - don't think depth matters as much (provided it's not crazy).\n\n"
    },
    {
      "time": "20 Jan 2006 — 5:42am",
      "content": "LOL!!!  \nLovin it Nick! :-)\n\nChrisL\n\n"
    },
    {
      "time": "20 Jan 2006 — 6:10am",
      "content": "Seriously though, how do I make PDFs just launch?\n\n"
    },
    {
      "time": "20 Jan 2006 — 6:18am",
      "content": "can you get them to launch normally from other sites besides typophile?\n\n"
    },
    {
      "time": "20 Jan 2006 — 11:02am",
      "content": "alright, the guidelines are now live at: [http://typophile.com/readme](http://web.archive.org/web/20140803181117/http:/typophile.com/readme \"http://typophile.com/readme\")\n\nplease post any critiques, additions, corrections here.\n\nnow on to guidelines for the Critiques section. Anything besides attach a gif + pdf suggestion?\n\n"
    },
    {
      "time": "20 Jan 2006 — 11:07am",
      "content": "Thanks, Paul--very nice.\n\nps. I noticed a typo: 'Assistsance:'\n\n"
    },
    {
      "time": "20 Jan 2006 — 11:10am",
      "content": "Way to go Paul!\n\nChrisL\n\n"
    },
    {
      "time": "20 Jan 2006 — 4:14pm",
      "content": "I'm having the same problem with PDF's as Nick Job. They launch from every other site but Typophile, so I end up downloading them as well.\n\n"
    },
    {
      "time": "20 Jan 2006 — 7:15pm",
      "content": "Nice going, Paul! The FAQ reads really well.\n\nThing 1: Under **\"Post threads in the appropriate forum\"** , the word _one_ is missing from the next-to-last sentence:\n\n_Please contact of our moderators..._\n\nAnd Thing 2: this may be a dumb question, but... shouldn't the FAQ be posted at the top of the **Forums** page? Or is it at the top of **General Discussions** because everyone comes here first?\n\n"
    },
    {
      "time": "20 Jan 2006 — 7:44pm",
      "content": "thanx for the compliments and for pointing out my errors. i hope i've fixed em all now...\n\n"
    },
    {
      "time": "20 Jan 2006 — 7:47pm",
      "content": "Paul, good idea!\n\nI certainly agree with William that we should recommend refraining from personal attacks. Integral to this however is a parallel recommendation: Typophile -although inescapably leaning towards certain cultures- is more like a zoo than a cocktail party, and the animals are from all over the planet. Ergo, don't assume, and certainly don't insist, that others take offense from the same things. That's just provincial. William's Talmudism or my Agnoticism should not impede candor. We pay politicians for that.\n\nWithout adding that to your \"Be Courteous\" section, you: risk people getting overly shocked once in a while; and really, you're hiding the truth.\n\nhhp\n\n"
    },
    {
      "time": "21 Jan 2006 — 6:53am",
      "content": "\\>Typophile ...is more like a zoo than a cocktail party\n\nHmmm, Let's see. I am the billygoat. Nick S. is the ram. John H. the giraffe. David B. the old lion. And Hrant is ...?\n\n"
    },
    {
      "time": "21 Jan 2006 — 7:24am",
      "content": "okay, i edited the Be Courteous heading. Does that tidbit convey your intentions, Hrant?\n\n"
    },
    {
      "time": "21 Jan 2006 — 8:19am",
      "content": "Paul, thanks - should do fine.\n\nWilliam: According to Yves, an Armenian mountain lion.\\*  \nBut giraffes, they're silent. :-) I'm very glad John isn't.  \nBTW, I forgot to point out the main thing in the zoo  \nanalogy: Typophile is our watering hole.\n\n\\* Google shows it, but it's yet to be unbroken:  \n [http://www.typophile.com/forums/messages/30/38661.html](http://web.archive.org/web/20140803181117/http:/www.typophile.com/forums/messages/30/38661.html \"http://www.typophile.com/forums/messages/30/38661.html\")\n\nhhp\n\n"
    },
    {
      "time": "22 Jan 2006 — 1:00pm",
      "content": "Sorry Paul, I've been away for the weekend.\n\nYes, same problem as Lauri with PDFs - every other site is fine - this one is the only one that doesn't work. PDF attachments on other sites do _not_ prompt me with a grey dialogue box as to whether I want to open or save etc. They simply launch Acrobat automatically (unless already open) and open pdfs in the same/another browser window (ie in IE6 but with Acrobat functionality). I'm sure you know what I'm talking about.\n\n"
    },
    {
      "time": "22 Jan 2006 — 7:29pm",
      "content": "\"...I am the billygoat. Nick S. is the ram. John H. the giraffe. David B. the old lion. And Hrant is …?\"\n\nGuess I can't be the old goat since William is Billy-- then how about the bald eagle? :-)\n\nChrisL\n\n"
    },
    {
      "time": "26 Jan 2006 — 11:55am",
      "content": "Paul, reading today's page-9 action\\* I thought of another thing you might add to the FAQ: When you ask for font suggestions, please tell us at least a little bit about the friggin' thing you're setting, sheesh!! Not in those words.\n\n\\* :-/ I'd actually moved up to page 8 the last few days! :-(\n\nhhp\n\n"
    },
    {
      "time": "26 Jan 2006 — 2:54pm",
      "content": "[Here](http://web.archive.org/web/20140803181117/http:/www.typophile.com/node/9089)'s the very first mention of the Armenian mountain lion in the legendary Typophile Classic Thread with Typophile's very first one minute identification, courtesy of Hrant.\n\nBTW Paul -- feel free to check the [FAQ](http://web.archive.org/web/20140803181117/http:/typophile.com/forums/typeid/faq) in the Type Identification Board and reuse whatever info you need. It's not like it's copyrighted to me personally or anything, I consider it property of Typophile.\n\n"
    },
    {
      "time": "26 Jan 2006 — 3:21pm",
      "content": "Paul, the writer in me says:\n\nTypophile Forums Answers to FAQs aka General Posting Guidelines\n\nshould be\n\nPosting to the Forums\n\nps Yves, 'Posting to the Type ID Forum' might get more reads than \"FAQ.\"\n\n"
    },
    {
      "time": "26 Jan 2006 — 4:00pm",
      "content": "okay, that does it! :^D i'm just going to name it what i wanted to in the first place instead of trying to keep everyone happy (like the diplomant i usually am). see you on the other side...\n\nyves, i'll go over what you've got posted again. thnx.\n\n"
    },
    {
      "time": "26 Jan 2006 — 5:12pm",
      "content": "\\>trying to keep everyone happy\n\nThe #1 cause of excess words!\n\n"
    },
    {
      "time": "31 Jan 2006 — 8:34am",
      "content": "I think we should make an amendment to the amendment and amend the fact that moderator's have the right to ignore suggested amended ammendments. ;^D\n\n"
    },
    {
      "time": "31 Jan 2006 — 10:28am",
      "content": "I second the motion to ammend the ammendment Tiff is trying to ammend but I would like to make a recommendation on another thing to mend :-)\n\nChrisL\n\nPaul,  \nDo your thing man.\n\n"
    },
    {
      "time": "31 Jan 2006 — 10:32am",
      "content": "\\>Paul,Do your thing man.\n\nAmen to that ammendment!\n\n"
    },
    {
      "time": "18 Feb 2006 — 12:18pm",
      "content": "Paul,  \n I think you need to add this - PLEASE READ: Typophile Forum Posting Guidelines ; next /below to \"Post new comment\", or \"Comment:\\*\" ; and RED ( the same thing with the ID Board)\n\n"
    },
    {
      "time": "19 May 2006 — 2:15pm",
      "content": "_When you ask for font suggestions, please tell us at least a little bit about the friggin’ thing you’re setting, sheesh!! Not in those words._\n\nokay, i think it's time to put together a specific _Read Me_ for the Design forum and for the Critique forum. what are some things people posting to these forums should know? Anyone care to rephrase Hrant's advice above?\n\n"
    },
    {
      "time": "19 May 2006 — 2:23pm",
      "content": "Type suggestions --\\> Design Forum  \nFree type notices --\\> Design Forum\n\nAgree that know a little about the project should be given. Otherwise we are aiming without a target.\n\n"
    },
    {
      "time": "19 May 2006 — 2:25pm",
      "content": "what kind of info should a person looking for advice give about their project, in order for us to be able to give relevant help?\n\nthings like: nature of project, text size, printing process, budget?\n\n"
    },
    {
      "time": "19 May 2006 — 2:28pm",
      "content": "Yes to all. Even when someone has two typefaces that might work but neither are quite right at least that gives direction to those who want to help.\n\n"
    },
    {
      "time": "19 May 2006 — 2:33pm",
      "content": "any other considerations that should usually be taken into account?\n\nmedia? what else? help me brainstorm here...\n\n"
    },
    {
      "time": "19 May 2006 — 2:35pm",
      "content": "audience\n\n"
    },
    {
      "time": "19 May 2006 — 2:58pm",
      "content": "market (which is the same. sorta)\n\n"
    },
    {
      "time": "25 May 2006 — 12:42pm",
      "content": "I guess we are looking for a Cliff Notes of the problem brief.  \nAudience, Purpose, message, Clent description, delivery chanel, Desired action of target audience. Other restraints like printing specs (colors, stock, press-run, etc.)\n\nChrisL\n\n"
    },
    {
      "time": "25 May 2006 — 3:30pm",
      "content": "And ethics: The client knows about the post/thread?\n\nAnd... student work or the real world work?\n\n"
    },
    {
      "time": "8 Jun 2006 — 10:38am",
      "content": "This is just a pet peeve and maybe off topic but I wish the original posters would show us what they ended up doing either based on our suggestions - or not. Sometimes they touch base at the end but more often we never see the results of the brainstorming.\n\n"
    },
    {
      "time": "8 Jun 2006 — 4:39pm",
      "content": "_I think we should make an amendment to the amendment and amend the fact that moderator’s have the right to ignore suggested amended ammendments._\n\nSomehow I am reminded of the Isley Bros...\n\n\"It's your thing, do what you wanna do. I can't tell you, who to sock it to.\"  \n; )\n\n"
    },
    {
      "time": "8 Jun 2006 — 9:24pm",
      "content": "Don't forget to mention that all comments posted on this web site must be completely pointless and uterly without merit, reason, or be based on facts or expereince.\n\n"
    }
  ]
}
