{
  "id": "17388",
  "title": "Designing for a Living in Latin America",
  "forum": "Comunidad Hispana",
  "tags": [
    "Comunidad Hispana"
  ],
  "content": "Hola socios, este es apenas mi segundo post en un año por aqui, cabe mencionar que encuentro este sitio extremadamente interesante... Mi post es porque me encuentro en un dilema personal: He estado pensando que los diseñadores en primer mundo de los que abundan aqui (Europa, EU, Canada, etc...) a diferencia de la mayoria de nosotros en Latino America pueden vivir bien con uno o dos proyectos freelance al mes, trabajar cuando mucho 40 horas a la semana y despues dedicarse a pintar, esculpir, viajar, y diseñar por gusto en vez de hacerlo por necesidad, ¡algo que yo quisiera lograr! ¿Alguno de ustedes sabe si esto es realidad?  \n¿Alguno de ustedes conoce la realidad en estos paises? muchas gracias por su apoyo.\n\n",
  "author": "pablocheco",
  "time": "18 Jan 2006 — 7:37pm",
  "uid": "5022",
  "comments": [
    {
      "time": "24 Jan 2006 — 12:18pm",
      "content": "¿Vivir bien? :-) Acerca de cuantitad de trabajo, la verdad es que  \nno tengo ningun idea... Pero te asuro que ustedes viven mejor que  \nnosotros, sino en cosas materiales, ¡pero de seguro en la vida social! :-)\n\nhhp\n\n"
    },
    {
      "time": "28 Jan 2006 — 5:19pm",
      "content": "Congratulations Hrant! i just saw about your baby!\n\nLiving well? yeah, i mean the basic stuff for only 40 hours per week... rent, house expenses, food and clothing for a family, and some not so basic like a pair of nikes from once in a while, maybe a used car, membership for a gym, booooooooks!!! sometimes I find myself (working as freelance graphic designer) about 60 or more hours per week just to cover the basics... and i really could use some time to paint, spend more time with my wife... you know... the social part you mention...\n\n"
    },
    {
      "time": "22 Mar 2006 — 6:24pm",
      "content": "mmm permitanme presentarme, al igual que el señor pablocheco, diseñador grafico freelance por profesión. Pues en las europas quizas no sea unicamente el trabajo del designer el que te permita vivir y viajar y comprarte un par de nikes e ir al gym. tengo un primo en finladia que es jardinero y se la pasa viajando, que vive modeston para los fineses pero que hace lo que mas le gusta, viajar y la musica.\n\nahora depende que quiera usted pablocheco, habria que probar no cree usted? a mi tambien me dan ganas de probar trabajar alla de designer un raton.\n\nahora la calidad social, bueno quizas en nuestro caso ni siquiera sepamos que signifique no sonreir por la calle o decir buenas tardes a cualquier traunseunte que se yo, pero respecto a los comentarios de mi primo dice ser la situacion fraternal un poquitin diferente por esos lares jajajaja\n\nsaludos al foro!!!  \nbuen foro\n\n"
    },
    {
      "time": "30 Nov 2007 — 2:26pm",
      "content": "Pablo Checo, aqui la cosa es dura.  \nA mi me vendieron un suenio hermoso, y me doy cuenta de que nada es cierto. Soy artista visual, estudie artes visuales y disenio grafico en Ecuador. He obtenido varios premios nacionales y exposiciones. Ilustre un libro.  \nLlegue aqui y no soy nadie. A nadie le interesas. Nadie tiene tiempo para ocuparse de tus asuntos. No hay calidez, ni la idea de amistad o de fraternidad que hay en latinoamerica.  \nLa renta y la comida son excesivamente caros asi que lo que ganas en un trabajo de mierda que es bastante, se te va hasta el ultimo centavo.\n\nAsi que, quedate tranquilo, disfruta de tu vida, aqui no existe el amor por el darse tiempo a uno mismo. Yo no veo la hora de irme.  \nUn abrazo.\n\n"
    },
    {
      "time": "30 Nov 2007 — 8:09pm",
      "content": "Hola, Raquel. La pregunta original de pablocheco es de hace casi 2 años, pero de todos modos es bueno que hayas dejado una respuesta.\n\n_Soy artista visual, estudie artes visuales y disenio grafico en Ecuador. He obtenido varios premios nacionales y exposiciones. Ilustre un libro. [...] Llegue aqui y no soy nadie._\n\nNew York es así para cualquiera que se mude aquí, sea ciudadano americano o no. No sé cuánto tiempo llevas viviendo aquí, pero hay muchos artistas visuales extranjeros que se mudaron aquí por diversos motivos (políticos, económicos), y tan mal no les fue. De los contemporáneos, se me ocurren Luba Lukova, Deanne Cheuk, Stefan Sagmeister y Mirko Ilic. Y en el pasado hubo otros. Seguramente no se volvieron conocidos de un día para otro. :-)\n\nAl mismo tiempo, TODO EL MUNDO viene aquí para hacerse camino, y eso hace que las cosas sean difíciles, pero a la vez es un estímulo -- saber que hay tanta gente haciendo buenas cosas te obliga a intentar ser mejor.\n\n_A nadie le interesas._\n\nVamos, ¿no tienes ni un amigo o amiga?\n\n_Nadie tiene tiempo para ocuparse de tus asuntos._\n\nEs verdad. No quiero sonar duro, pero creo que uno mismo tiene que ocuparse de sus propios asuntos. Esto es verdad en cualquier parte del mundo.\n\n¿Conoces a las sociedades profesionales, como [AIGA](http://web.archive.org/web/20150317212616/http:/www.aigany.org/), [ADC](http://web.archive.org/web/20150317212616/http:/www.adcglobal.org/), [SI](http://web.archive.org/web/20150317212616/http:/www.societyillustrators.org/index.cms) o [Type Directors Club](http://web.archive.org/web/20150317212616/http:/www.tdc.org/)? Es una forma de conocer a otros artistas gráficos, y de participar y hacerse conocer. Y si te gusta la tipografía -- pues por algo estás aquí en este foro, ¿no? ;-) -- te recomiendo la conferencia [TypeCon](http://web.archive.org/web/20150317212616/http:/www.typecon.com/), que es muy económica y va a ser en Rochester el año que viene.\n\n"
    },
    {
      "time": "2 Mar 2008 — 8:37am",
      "content": "Es un asunto de moverse. Yo vivo en Múnich desde hace un tiempo y al principio es difícil. Lo importante es mantenerse siempre activo en el diseño/arte o lo que haces normalmente, hacer contactos y mandar currículums a las empresas que te interesen. No creo que haya de otra. Ya que estás trabajando, puede que te des cuenta que el panorama gráfico en Europa sí está mejor a nivel económico.\n\n"
    },
    {
      "time": "22 Mar 2008 — 3:37pm",
      "content": "Raquel, Ricardo, Mosh, que bien que decidieron participar de este tema a 2 años de creado, mil gracias a todos.  \nNo me fui a Europa, sigo en Mexico trabajando como freelance aunque he decidido aprovechar mis habilidades de marketing para auto-promoverme no como un solo diseñador sino como \"firma\". He logrado establecer una red de clientes, contactos y proveedores que han permitido que mi sutuacion profesional sea muy favorecida y economicamente satisfactoria, es decir para ser freelance, seguro que como despacho falta mucho camino pero como individuo todo esta de maravilla, aunque si debo seguir trabajando 40 a 60 horas por semana, pero ¿quien no debe trabajar duro para salir adelante? Talves en otro pais seria mas la recompensa por el tiempo pero creo que aca es \"mas facil tejer la red\" por conocer el contexto.\n\nSaludos a todos.\n\n"
    },
    {
      "time": "29 May 2009 — 11:51am",
      "content": "Hola Pablo,\n\nYo si me fuí de México a España y no me puedo quejar, los proyectos son mas interesante pero no hay mas dinero, en muchos hay menos. Sobre todo ahora.\n\na competencia es dura, todos somos diseñadores ahora, incluso los clientes.\n\nEn todos lados se pueden hacer cosas, lo que si cambia es que aquí la vitrina es mas grande.\n\nSaludos\n\np\n\n"
    }
  ]
}
