{
  "id": "17397",
  "title": "Como Esta?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I noticed that [this purdy little number](http://web.archive.org/web/20081010131944/http:/www.myfonts.com/fonts/dstype/esta/) by [dstype](http://web.archive.org/web/20081010131944/http:/www.typophile.com/wiki/dstype) is 50% off till the end of february. i wanted to know: has anyone had a chance to use it? what’s the quality of this one? reviews please!\n\n [‹ bolbody](http://web.archive.org/web/20081010131944/http:/www.typophile.com/node/17610 \"Go to previous forum topic\") [Looking for crit on a logo ›](http://web.archive.org/web/20081010131944/http:/www.typophile.com/node/17264 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081010131944/http://www.typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": "<br>",
  "uid": "7006",
  "comments": [
    {
      "time": " 20.Jan.2006 8.49am",
      "content": "anybody???\n\n"
    },
    {
      "time": " 20.Jan.2006 1.23pm",
      "content": "I licensed it this afternoon for a possible corporate identity, but I haven’t really had a chance to use it yet. If anything leaps out I’ll let you know.  \nTim\n\n"
    },
    {
      "time": " 24.Jan.2006 11.35am",
      "content": "looking closer at it, i see quite a few things i would want to change. does anyone know where i can find a [EULA](http://web.archive.org/web/20081010131944/http:/www.typophile.com/wiki/EULA) for [dstype](http://web.archive.org/web/20081010131944/http:/www.typophile.com/wiki/dstype)? I didn’t find one on myfonts. do they show that kind of thing before downloading?\n\n"
    },
    {
      "time": " 24.Jan.2006 11.39am",
      "content": "Paul,  \nI bought the face after seeing your post but have not had time to play with it. When I get home, I will look for the EULA (which I assume came as part of the download).\n\nChrisL\n\n"
    },
    {
      "time": " 26.Jan.2006 10.29am",
      "content": "In my untutored view, the faces from dstype are uniformly well thought out and professionally executed. I own several, including Esta and Quaestor.\n\nWith regard to ’Esta’, I also find a few things I’d like to tweak, but overall impression is a more decorative text face with many options for setting. Somebody must like it, it’s one of the bestselling faces on myfonts.\n\nSurely could use an OT version. The text weights, to my eye, set a little light on a desktop postscript printer, haven’t had time for production runs. IMHO, the regular text weight ampersand could be less linear to conform to the overall flavor.\n\nNo EULA came with pkg., nor is one immediately apparent at the web site.\n\nHope this helps.\n\nJohn\n\n"
    },
    {
      "time": " 27.Jan.2006 6.11pm",
      "content": "Poly,  \nThe EULA link only shows while you purchase. That is kind of wierd since some people may revise their purchase decision based on the EULA.\n\nChrisL\n\n"
    },
    {
      "time": " 29.Jan.2006 2.14am",
      "content": "Paul,  \nOut of interest, what are the things you would change? I haven’t done a great deal with it yet, I missed small caps ligatures but then you can’t have everything.  \nTim\n\n"
    },
    {
      "time": " 29.Jan.2006 7.48am",
      "content": "well to start with, i’d give it the OT treatment. i don’t care abt small cap ligs, but i didn’t notice any italic ligs. lastly, there are a few characters that i would redraw. but all this is if the EULA would allow it.\n\n"
    },
    {
      "time": " 29.Jan.2006 8.52am",
      "content": "Hi, Paul:  \nMyfonts usually gives a link to the EULA from the “purchase options” page. Have a look at dstype’s [here.](http://web.archive.org/web/20081010131944/http:/www.myfonts.com/viewlicense?id=347) It stipulates no mods without permission. Of, course, there’s nothing to say you couldn’t get permission.\n\n"
    },
    {
      "time": " 29.Jan.2006 10.42am",
      "content": "i knew it had to be there somewhere... myfonts is so confusing to me sometimes. thanks, john!\n\n"
    }
  ]
}
