{
  "id": "17404",
  "title": "St. Bride Library announces: Baskerville in the City and the Fast Type, Slow Type conference",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20070805150950/http:/typophile.com/user/108 \"View user profile.\") : 19.Jan.2006 9.03am \n\n- - - - - - - - - - - - - - - - - - - - -  \nPress Release  \n19 January 2006\n\n- - - - - - - - - - - - - - - - - - - - -  \n**BASKERVILLE IN THE CITY**\n\nThis year John Baskerville—writing master, letter cutter, printer, typeface designer, and one time resident of Birmingham, UK—will be 300 years old. To celebrate this landmark in the life of Birmingham’s typographic genius, graphic designers, typographers and artists of all kind will be staging a series of creative events across the city in recognition of Baskerville’s spirit of non-conformity and celebration of his pursuit of the experimental.\n\nAt the centre of these activities will be the annual Friends of St Bride Library conference, which will take place at the Custard Factory, Birmingham, 16-18 October 2006.\n\n**‘FAST TYPE, SLOW TYPE’**  \n‘Fast type, slow type’ is the 5th in the series of annual Friends of St Bride Library conference and is the first time the event has been held outside London. The original conference was born out of a desire for a UK-based typographic forum that was diverse in content, eclectic in spirit, marginal in its sympathies yet international in appeal. Each year the event has built on these aspirations, attracting a diverse range of speakers and exhibitors prepared to experiment and push the boundaries of design and letterforms. The conference attracts around 200 international delegates including design practitioners, artists, publishers, and advertisers, teachers, researchers and historians and those just starting their careers.\n\nApplications to participate in the event are now being sought from interested individuals, organisations, institutions and businesses from across the international design, print and creative communities.\n\n‘Fast type, slow type’ is open to individual interpretation but it may include letter forms made by professionals or amateurs using any method—print, pen, brush, aerosol—in any medium—paper, wood, stone or metal, on screen, in water, in the air, or on the street, and which may include the spoken word. The ‘Fast type, slow type’ conference aims to push the boundaries of typography to the limit and encourages the participation of those who might not consider themselves as typographers but who utilise letterforms in their work. The experimental is actively encouraged.\n\nIf you have a topic that fits the theme, and would like to talk, exhibit or demonstrate, please send an outline proposal and brief biographical note in not more than 500 words to [info@typevents.com](mailto:info@typevents.com) by 1 March 2006.\n\n- - - - - - - - - - - - - - - - - - - - -  \nTypevents partners: Beacon Press, UK; FontWorks, London, UK; Iconstorm, Germany; Print Week, UK; VIP Paper, UK\n\nTypevents LLP is a UK-based multi-national partnership that provides comprehensive events, marketing and PR consultancy services to the printing, paper, type and graphic design communities.\n\n- - - - - - - - - - - - - - - - - - - - -  \nInfo | Typevents LLP\n\nMaxstoke House, 104 Parkside Drive, Watford, Hertfordshire, WD17 3BB  \nTelephone +44 (0) 19 23 80 04 25  \nFacsimile +44 (0) 19 23 80 04 23  \nMobile +44 (0) 77 69 72 09 01  \n [www.typevents.com](http://web.archive.org/web/20070805150950/http:/www.typevents.com/ \"www.typevents.com\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20070805150950/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 19.Jan.2006 9.03am",
  "uid": "108",
  "comments": [

  ]
}
