{
  "id": "17414",
  "title": "Signage critique",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi guys, newbie around... i am working on this rest room signage for an eco-touristic hotel at Mexico. A lot of foreigners come and stay here, so i dont know how to approach the work in order to function for a multicultural public. I started with these characters i made for the kids summer camp instead of using the neutral look, i think this can be good but i want to listen good critique... thanks for helping.\n\n| Attachment | Size |\n| --- | --- |\n| [restroom-signage.png](http://web.archive.org/web/20150419094215/http:/typophile.com/files/restroom-signage.png) | 24.37 KB |\n\n",
  "author": "pablocheco",
  "time": "19 Jan 2006 — 8:12pm",
  "uid": "5022",
  "comments": [
    {
      "time": "19 Jan 2006 — 9:03pm",
      "content": "Many eco-tourists would find the sexual stereotyping offensive.\n\nThey may be confused, because male frogs are generally smaller and more angular than female frogs (eco tourists know stuff like that). Some might even think the cute frog with the lashes and flower denoted the john for drag queens.\n\n"
    },
    {
      "time": "20 Jan 2006 — 8:24am",
      "content": "Thank you very much Nick. In fact there is a broad public here not only ecotourists, also locals, lots of kids and regular non eco tourists which may find the flower cute, like hawaii welcome style. Although, what´s wrong with sterotypes anyway in this case?, i think stereotyping may be efective sometimes to put generic things in its very own place, in this case its not generic but gender. Anyway, does anybody knows something like a restroom signage collection?\n\n"
    },
    {
      "time": "21 Jan 2006 — 4:51am",
      "content": "[This book](http://web.archive.org/web/20150419094215/http:/www.amazon.co.uk/exec/obidos/ASIN/8489994897/qid=1137846656/sr=1-22/ref=sr_1_0_22/026-4836135-4073226) has, amongst many other pictograms, quite a few toilet signs.  \nI think that any multi-language signage should, if practicable, avoid type or clearly define the languages, possibly by different fonts or members of a type family. I think that many would find your illustrations confusing or at least hindering, it might be an obvious/cliche solution but the silhouette style of man and woman is internationally known, when somebody is looking for a toilet the silhouette symbol(s) are what they would expect/hope to see, there is still room for applying a style. Does the other signage in the hotel include the frog motif or do these work on their own, in which case how does it relate to that signage?  \nTim\n\n"
    },
    {
      "time": "8 Mar 2006 — 4:55pm",
      "content": "Wow. Eco-tourists are THAT sensitive?\n\nI like your designs.\n\n"
    }
  ]
}
