{
  "id": "17422",
  "title": "New Web Design Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hey everyone. I currently redid my logo to simplify it - my old one was a bit too complex. The one on top is the old logo and the one on the bottom us the new one. What do you think? I think I’m going to change the color on the tagline…\n\n ![](http://web.archive.org/files/greenfieldlogo.jpg)\n\n",
  "author": "<a href=\"user/11070\" title=\"View user profile.\">douga</a>",
  "time": "<br>",
  "uid": "11070",
  "comments": [
    {
      "time": " 20 January, 2006 - 5:37am",
      "content": "Hi,\n\nI actually prefer the old one (sorry) - but the new one is cool too (more corporate also). I would probably change the tagline colour as you said… might also want to try right-aligning it.\n\nNot sure if it is just the low res jpg but the circle doesn’t seem complete on the right-hand side… think it might look better if it was.\n\nJust my opinion.  \nCheers,  \nKarl\n\n"
    },
    {
      "time": " 20 January, 2006 - 5:46am",
      "content": "Some things for now. The way to join the two word it’s a good idea. However, I’d not choose a condensed face for the word field. Also, why the red color for the “punch line” under the name. To me, I find it would be more acurate if you work with less color. The g and f in the black circle seems to be out of the new logo. Finally, the cut on the right of the circle should be clearer, because now it seems like it’s a bad print job.\n\n"
    },
    {
      "time": " 20 January, 2006 - 5:49am",
      "content": "Your new look needs a lot of work. For instance why are the lowercase g’s different from the gf symbol and the g in green. I don’t see the reason for making field another typeface. It could easily read Greenfield not Green Field and have the same impact. The fi combination is terrible (spacing) and needs to be solved. Most of the letter spacing is bad and needs work. The tag line is lost in that face and making it fit in that space. What is your business? What does “Cultivating the web” mean? Don’t assume anyone else will know, make it very clear.\n\n"
    },
    {
      "time": " 20 January, 2006 - 6:10am",
      "content": "I’m at work now so I can’t make any touch-ups, but here are some comments:  \nThe “field” isn’t another typeface - it’s just not bold, but it’s the same typeface. I didn’t mess with the letter spacing at all - so that still needs work.\n\nThe old logo is kind of nice, but I also wanted something I can shrink and place in the footers of the websites I create. The top logo doesn’t shrink too well.  \nGreenField is supposed to be one word. The name of my company is “GreenField Designs” - it’s a web design company.  \nI think I just may replace the tag line (it was just a thought I threw together) with bar to help fill the space.\n\nThanks for the input. If you have anymore comments before I can get back to the drawing board, let ‘em rip.\n\n"
    },
    {
      "time": " 20 January, 2006 - 12:56pm",
      "content": "I’m going to make an assumption about your concept. It reminds me of old farm signage, agricultural equipment, with an industrial feel. Is this the direction? If so, I think it makes sense, but the logo definitely needs to be finessed - letterspacing, etc. I would even think about keeping “greenfield” in the same typeface, and separating the words by color. There’s something about that combination of typefaces that isn’t working for me. I think you’re heading in a much better direction - that first logo looks like a logo for cookies, or health food.\n\n"
    },
    {
      "time": " 20 January, 2006 - 4:56pm",
      "content": "“GreenField is supposed to be one word”\n\nThen make it one word. Don’t use the different weights like that.\n\nI also don’t see much a point to the GF in a circle. Just stick with the type logo, IMHO.\n\n"
    },
    {
      "time": " 22 January, 2006 - 12:05pm",
      "content": "I prefer the original as well, mainly because if feels more distinct and has a more solid design. But, I understand the desire to move away from it. However, I think your changes are a bit scattered. They are leaning towards one direction, but not working together and just confusing things.\n\nIf your concept is the idea of the web as a ‘green field’ and your design group ‘cultivates’ it, then this should sit more squarely at the center. I like the idea that Chris Keegan mentioned: the agricultural look. It’s unique and has a lot of visual possibilities that make your concept a bit clearer.\n\nWhat you’ve design so far has the feeling of a concept sketch that’s been executed on the computer. Research something like [painted barn signs](http://web.archive.org/web/20060522220323/http:/flickr.com/photos/darrylsphotoblog/89769945/) or something with a bit more life to it. Your current design feels too sterile to have real character, but too mixed to be modern and sleek. Your old design was complex, but it seems to get at the concept more directly. Also, if your company name is GreenField, I’d stick with that same treatment. It’s confusing otherwise and the whole ‘bold/regular but one word’ thing is very played out.\n\nYour project definitely has possibilities. I’m eager to see where it goes.\n\n"
    }
  ]
}
