{
  "id": "17439",
  "title": "Clarendon manipulation // Other type recommendation.",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm currently trying to design a logo for a magazine called \"quiet light\" and I'm leaning towards the use of Clarendon Condensed (Bitstream), or something similar in style. Where I'm running into problems is with the ear on the g, as I'd like to remove it, but it really throws the character off. I'm not even sure that this is definitely the direction I want to go with the letter, however, I have yet to give it a running chance.\n\nAnyways, I was wondering if anyone might have any recommendations on how to properly remove the ear and rebalance the letter accordingly (if this is possible), or if there might be some other font that might be a better fit for my design (possibly something with a center balanced upper loop?).\n\nYou can find a character map of Clarendon Condensed here:  \n [http://www.myfonts.com/fonts/bitstream/clarendon/condensed/charmap.html](http://web.archive.org/web/20131010230538/http:/www.myfonts.com/fonts/bitstream/clarendon/condensed/charmap.html \"http://www.myfonts.com/fonts/bitstream/clarendon/condensed/charmap.html\")\n\nThanks for your help!\n\n",
  "author": "down",
  "time": "20 Jan 2006 — 9:21pm",
  "uid": "2744",
  "comments": [
    {
      "time": "20 Jan 2006 — 9:48pm",
      "content": "Myke\n\nYou might concider my typface OXTAIL for this project? It has an \"italic\" g in upright weights. so you won't have any \"ear\" problems haunting you. Have a look for your self;\n\n[http://www.macrhino.com](http://web.archive.org/web/20131010230538/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\nor at; [http://www.psyops.com/html/spec\\_oxtail.html](http://web.archive.org/web/20131010230538/http:/www.psyops.com/html/spec_oxtail.html \"http://www.psyops.com/html/spec\\_oxtail.html\")\n\n"
    },
    {
      "time": "21 Jan 2006 — 1:08am",
      "content": "Oxtail has a rather different quality altogether... but I quite like it. Nice work; I'll keep it in mind, Stefan.\n\nTo the original poster... perhaps with a heavier face, the g's ear becomes less of a visual sticking point. Consider (esp. if used as a masthead) HTF Ziggurat?\n\n[http://www.typography.com/catalog/ziggurat/index.html](http://web.archive.org/web/20131010230538/http:/www.typography.com/catalog/ziggurat/index.html \"http://www.typography.com/catalog/ziggurat/index.html\")\n\n"
    },
    {
      "time": "21 Jan 2006 — 7:12pm",
      "content": "Thanks for the replies.\n\nI'm going to try a design with Oxtail to see if this gets me over the hump. I think Ziggurat might be too heavy, as the name \"quiet light\" is leading me in an airier direction.\n\nJust out of plain curiousity, has there ever been a serif typeface designed without the ear on the g, or is this an impossibility due to an imbalance in the letterform because of the link between the loops?\n\n"
    },
    {
      "time": "21 Jan 2006 — 8:09pm",
      "content": "I tried a design with Oxtail and found the results having too wide of counters beside the thin i's and l.\n\nI really like the look of the traditionally sans serif style g in a serif style font. Does any else have any other recommendations in this vein? Possibly something condensed?\n\n"
    }
  ]
}
