{
  "id": "17438",
  "title": "The Guild :: Logotype Technical Critique requested",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "First of all, hello everyone. I’ll come clean that this is my first post, but I have community aspirations… honest. I’ve had a long look around and I love what I see here on the boards.\n\nPlease have at me on this one. I’m quite close to the project, which has worked both for and against its success. So far as the type design has gone, I’d love the eyes of a master or two _before_ it hits signage and letterpress plates.\n\nI’d very much appreciate a technical focus, which is why I’ve kept the background/design brief ambiguous (for now). I think there’s plenty to discuss in the type itself. A few relevant details:\n\n- I drew the type from scratch in response to other identity elements. The proportions of the H and the 45-degree cuts were my starting points in common.\n- The application will include letterpress cards, glass etching, and metalwork.\n- Screen readability is very important in the final product. I’d very much like advice towards that goal.\n\nI’m looking forward to your thoughts. Please, tease apart the nuances, chew on it, spit it back at me. Below the image is an attached version at a larger scale in b+w.\n\n-Nicholas\n\n ![](http://web.archive.org/files/theguild_typophile_v1.png)\n\n| Attachment | Size |\n| --- | --- |\n| [theguild\\_large\\_v1.png](http://web.archive.org/web/20060522220342/http:/typophile.com/files/theguild_large_v1.png) | 7.65 KB |\n\n",
  "author": "<a href=\"user/11079\" title=\"View user profile.\">nmacias</a>",
  "time": "<br>",
  "uid": "11079",
  "comments": [
    {
      "time": " 21 January, 2006 - 5:53am",
      "content": "Question, why didn’t you modify your E by either adding a spur or slanting some of the end terminals. It doesn’t fit with the other characters.\n\n"
    },
    {
      "time": " 21 January, 2006 - 8:17am",
      "content": "I agree with Dan’s comment.  \nAnd I like the logotype overall, but I wonder why some details are applied once or twice, but not globally:  \nThe “crash notch” in the U.  \nThe serifettes in the H, G, L, and D.  \nYou are having just a little trouble with the curves in the G.  \nAre the horizontal strokes the same width as the verticals? The horizontals should be a bit thinner to look the same as the verticals.  \nTo reiterate and expand on Dan’s comment: why are some terminals angled, but not all? What’s the reasoning?  \nAgain, I like this, but I’m left with questions.\n\n"
    },
    {
      "time": " 21 January, 2006 - 11:32am",
      "content": "Some good, provacative questioning here. Thank you for your time, first of all.\n\nPlease don’t let my rationale lead your reaction to the design, but here’s a little more meat. The full system incorporates a heraldic design that has been smartly modernized (and I solemnly swear I did this without gradients and 3D effects). Beginning with our name, the identity is hinged on executing the traditional model of a “guild” in a modern, relevant, even forward-looking manner.\n\nOther design impulses: a little mystique, gravitas, craft/quality/integrity, initiative/passion.\n\nSo details like the angled terminals are designed to create a particular movement through the word that relates to an angle used in the shield design. I wanted this to be deliberate, and lose the visual impact in applying it globally.\n\nI placed the serifs through a reductive process, and stopped when I felt like the survivors each needed to be there.\n\nIn the end, I might have been to precious about the E. You’re both right that it falls right out of line. I’ll post a revision soon.\n\n\\> Are the horizontal strokes the same width as the verticals?\n\nNo, the horizontal strokes are about 92% of the verticals (77:71 units exactly). Essentially, I want to achieve optical harmony without tipping over into an overly calligraphic stroke, for very good reasons. As the identity system incorporates a heraldic design, the goal is to avoid going too medieval with the type. All said, what do you think of the relationship in the larger sample? Am I tiptoeing too gently with the contrast?\n\nI did have a hard time developing the G, but was _just_ starting to be happy with it. Can you please elaborate on “just a little trouble”? Here’s a larger drawing of it:\n\n ![](http://web.archive.org/files/theguild_g.png)\n\nI was working with two versions at the time of this image, opting for the second one in the end. The question here was to thin it out for appearance, or bulk it up to create a little more emphasis on the character’s main feature. Another design aspect, such as the height of the top-left stroke’s arc, is to make the counter as roomy and “open” as possible.\n\nI have to run my dog to the vet now but will return with more versions. Please continue with this excellent feedback (I can see all you lurkers out there).\n\n"
    },
    {
      "time": " 22 January, 2006 - 6:04am",
      "content": "I think that your choice of G was probably correct, however the strokes seem to flatten out slightly on the right, especially before the spur, it is difficult with screen representations to really be certain, but I think that a slight increase in roundness might be required. The transistion from vertical to curve on the left of the U seems abrupt inside the counter. I would be concerned about reproduction at small sizes in the areas around the TH where the angle (of the T) almost seems like a serif. The horizontals on the E and L also represent as slightly too heavy.  \nTim\n\n"
    },
    {
      "time": " 22 January, 2006 - 7:19am",
      "content": "timd has said what I was going to: the curve transitions in the G need a little work. And the horizontal strokes seem a little heavy, even with the compensation made so far.\n\nOne other thing: spacing. The G needs to move towards the U a little bit. This will also open up the word space. I know that you’re separting the words with colour, but a little bit of air in there will probably help.\n\n"
    },
    {
      "time": " 22 January, 2006 - 12:31pm",
      "content": "I like what you’ve done, but agree with the comments of the others.\n\n"
    },
    {
      "time": " 23 January, 2006 - 1:51am",
      "content": "Thank you all for your guidance. I’m feeling much more confident in the result, having pulled my outlines into FontLab (previously in Illustrator, from inkings) and addressing the finer curves. The spur of the G especially made a difference, I think.\n\nThe E has been brought into line with the overall design, balancing nicely against the U.\n\nA few of the rasterizations could use a touch of hinting (the worst ist probably the right-middle) but for the most part it reduces smartly. Quite pleased aspect, as we’ll have our share of screen applications.\n\nAgain, thank you for your insights. Please e-mail me if you’re interested in the resulting identity system, or a PDF of this revision.\n\n-Nicholas\n\n////////////////////////////////////////\n\n ![](http://web.archive.org/files/theguild_typophile_v2.png)\n\n"
    },
    {
      "time": " 23 January, 2006 - 4:21am",
      "content": "hi,\n\ni am interested in the final results.  \nyou don’t accept any emails… so  \nmy email is:\n\n[hallo@derya-landet.de](mailto:hallo@derya-landet.de)\n\nthanks a lot.  \nderya\n\n"
    },
    {
      "time": " 23 January, 2006 - 6:02am",
      "content": "I’m sorry but if the idea is to communicate to people “other than in the know” then the inconsistancies in the use of spurs and angles will be lost. It will come across as a mistake.\n\n"
    },
    {
      "time": " 23 January, 2006 - 9:22am",
      "content": "I fixed my e-mail settings, it should allow private messaging now.\n\nDan, no need to apologize. I just popped into fontlab and created alternate H, I glyphs to see what happens when I try utter consistancy. I feel pretty strongly that it’s a mistake:\n\n ![](http://web.archive.org/files/theguild_typophile_dw.png)\n  \n_(not happening for me)_\n\nIn my earlier design, I find the spurs and angles very complimentary, both in form and through their balanced placement throughout the mark. That’s to say I don’t find it all too inconsistent, but rather integral. Especially so now that I’ve worked on the E (in part because of your initial remarks, Dan).\n\nI truly believe that people “other than in the know” will respond more to _qualities_ such as “considered” and “elegant” than if it was overly ornamented (“busy” and “a font”); that audience isn’t attentive enough to those details to _quantify_ them as a mistakes.\n\nThank you again for your feedback.\n\n"
    },
    {
      "time": " 23 January, 2006 - 9:28am",
      "content": "The ‘TH’ spacing bugs me. It feels too large. The rest of the letters may need to be spaced to compensate.\n\nI prefer the ‘H’ with the angled leg terminal. I think it binds the whole mark together more effectively.\n\n"
    },
    {
      "time": " 23 January, 2006 - 11:11am",
      "content": "The inktrap feature on the U works well but seems superfluous/misplaced\\* on the E, the angled terminal is enough although I wonder if it would be better the other way up (nibbling more into the bottom of the bar).  \n\\* superfluous/misplaced, as in, why shouldn’t every junction of the E have one.\n\nI disagree with Chris on the terminal of the H, it kind of looks like it is dipping its toe in the water (to anthropomorphise a letter:). Although seeing them all in black I think you have a kerning issue on the TH and HE.  \nOverall I think you are right to resist the temptation to unify all the the letters by applying terminals and serifs in each case, because as you say it would make it look busy.  \nTim\n\n"
    },
    {
      "time": " 23 January, 2006 - 12:17pm",
      "content": "Is THE going to be screened back? Or is this going to be a 2-color print job with THE in one spot and GUILD in another? If the former, I’m worried that those serifs may start to break up.\n\nI almost think the E has too much weight on it - its stem feels heavier than the legs of the H. I preferred the first version of the E posted to the revised one, as it draws a bit too much attention with the two diagonal cuts; did you try slicing the end of its lowest arm instead of the middle one?\n\n"
    },
    {
      "time": " 23 January, 2006 - 3:11pm",
      "content": "Since Chris mentioned the spacing, the spacing of the HE is way too much. The E almost looks like it could belong to Guild. Also you need to make it read The Guild instead of TheGuild\n\n"
    }
  ]
}
