{
  "id": "17431",
  "title": "What makes an italic easier to read?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "John Berry [notes](http://web.archive.org/web/20150317234053/http:/www.creativepro.com/story/feature/21312.html) that Mark van Bronkhorst's [old style](http://web.archive.org/web/20150317234053/http:/typophile.com/wiki/old%20style) [italic](http://web.archive.org/web/20150317234053/http:/typophile.com/wiki/italic) for his typeface Verdigris is exceptionally [readable](http://web.archive.org/web/20150317234053/http:/typophile.com/wiki/readability). [Minion's italic](http://web.archive.org/web/20150317234053/http:/store.adobe.com/type/browser/F/MINP/F_MINP-10005310.html) is also quite successful in this respect, I think.\n\nI would be interested in people's views on what makes for a readable italic. For example, old style italics tend to have a great variety of different slants to the letters. Does making them more uniform help readability, or not? Do wider letters help? Handling of [contrast](http://web.archive.org/web/20150317234053/http:/typophile.com/wiki/contrast)? Smaller or bigger 'serifs'?\n\nI understand that often there is a desire to have the italic 'dance' more than the roman, and accept some lesser readibility for the sake of emphasis or decorative force. Still, within these constraints, how do people view the problem?\n\nAlso discussions of italics seem to be very rare, compared to discussions of romans. Any good references?\n\n",
  "author": "William Berkson",
  "time": "20 Jan 2006 — 11:50am",
  "uid": "1551",
  "comments": [
    {
      "time": "20 Jan 2006 — 12:34pm",
      "content": "not that i've studied this at all, but my gut reaction is that simpler is more readable. I would think that ornamentation and high-contrast make an italic less readable, so shoot for simpler, lower-contrast forms???\n\n"
    },
    {
      "time": "20 Jan 2006 — 12:52pm",
      "content": "I actually always liked the Linotype-technology Sabon italic. Some say that the fact that the italics had to be drawn on the roman proportions was a huge limitation, and of course it was. The Sabon italic was a bit too wide and unnatural, but on the other hand, it actually was quite widely spaced which I fould worked nicely. I see the same charasteristics in Verdigris italic, and I think it works very well!\n\nAdam\n\n"
    },
    {
      "time": "20 Jan 2006 — 12:55pm",
      "content": "I have no idea but it is a very very good question.\n\n"
    },
    {
      "time": "20 Jan 2006 — 1:49pm",
      "content": "I am by no means an historian and have no developed theories nor have authoritative reference material to back it up, but it seems that even in the earliest of comparisons between Roman (inscription based) and italics (cursives) that indeed italics seem not only more fluid but facilitate reading.\n\n ![](http://web.archive.org/web/20150317234053im_/http:/typophile.com/files/arrighi_italics.png)\n_Arrighi's letterfoms_\n\nIt may (and I emphasize 'may') be that informal penned forms were originally the most common expression of individual written communication (handwriting). Since most literate individuals can quickly write and decipher the majority of other peoples' handwriting, we may have developed a mental facility for decripting diverse and variable script forms.\n\n ![](http://web.archive.org/web/20150317234053im_/http:/typophile.com/files/coornhert_incunab2.png)\n [_Officia Ciceronis_(1561)](http://web.archive.org/web/20150317234053/http:/www.psymon.com/koster/coornhert.html)\n\nEven in the poor reproduction above, to me it seems easier to read the italics.\n\nSince most italic typefaces remain faithful to the earliest of typeface designs, and since the earliest of italics approximated Chancery scripts, the visual link back to human written forms remain.\n\n"
    },
    {
      "time": "20 Jan 2006 — 1:53pm",
      "content": "I would tend to agree with Paul and Adam, and taking it slightly further I would say that in most cases, what makes a legible roman makes a legible italic, for example: simple terminals, wide apertures, a reasonably large x-height, etc.\n\nSomething you probably wouldn't expect (and which some may disagree with me about) is that swashier caps (within reason) tend to _improve_ legibility! I think this is mainly because it's an indication that the caps were designed to fit with the italic, as opposed to being ripped from the roman and skewed.\n\n"
    },
    {
      "time": "20 Jan 2006 — 2:18pm",
      "content": "\"Even in the poor reproduction above, to me it seems easier to read the italics.\"\n\nActually, I think the opposite is true. To me the Roman reads much better than the italic.  \nI interpreted Williams question to be about the readability of italics among themselves, not so much compared to their upright counterparts.\n\nTo me, the main issue with Italics is that they have sufficient separability from the upright to be noticeable without being alarmingly different in color. Since it is rare to see long passages of italic text, readability issues (tiring of the readers eyes) are not very relevant. What is sometimes done to create separation from roman is to slightly condense the italic yet lighten the weight a bit to counterbalance the color change. As Adam mentioned the Sabon went the other direction but was still handled quite well. It isn't so much how you do it as how well you do it.\n\nChrisL\n\n"
    },
    {
      "time": "20 Jan 2006 — 2:45pm",
      "content": "Readability and contrast-with-Roman are necessarily strongly opposed, for the simple reason that -hopefully- the Roman is the one made highly readable! That said, the dimension of difference that might least impede readability in an italic is color. So I think the \"best\" general italic is one with slight slant, a little bit of compression, maybe slightly smaller on the body, and visibly lighter in color. Also, to prevent it from skewing the \"voice\" of the Roman in an arbitrarily fluid/casual direction, the \"ideal\" italic is structurally quite close to the Roman. Hmmm, Harrier anyone? :-)\n\n[http://www.themicrofoundry.com/other/nour&patria/dev/nour-latin.gif](http://web.archive.org/web/20150317234053/http:/www.themicrofoundry.com/other/nour&patria/dev/nour-latin.gif \"http://www.themicrofoundry.com/other/nour&patria/dev/nour-latin.gif\")\n\nBUT: Since an italic <cite>is</cite> generally for subordinate snippets, its readability requirements are on the order of display types (ie not very great). Just as long as errant fixations are not triggered though.\n\nhhp\n\n"
    },
    {
      "time": "20 Jan 2006 — 3:17pm",
      "content": "William, I apologize ahead of time if this doesn't follow the original intent of your topic, but I've thought more about the cognitive relationship between italics and handwriting.\n\nUp until recently, handwriting was an individual's most common means of informal communications and also the most practiced. Thoughts and feelings translated by one's mind through manual activity into visual notations that are then fed back through the eye for mental confirmation must have some benefit in one's ability to read script(my personal musing with no facts).\n\nNow all daily written communication (business and personal) is done by keyboard or phone keypad, with less time writing with pen or pencil. Eventually our facility for written communication will be heavily screen and typing based. In time reading and writing handwritten scripts will become less common and more difficult.\n\nWhether or not that might have any bearing on our ability to read italics is yet to be seen, that is of course, if there's any correlation at all between the ability to handwrite and the recognition of script forms.\n\nOn a personal note, for decades, I hand print my notes and letters much faster and more legibly using roman letters. My own handwriting has deteriorated and is slower for me to do than writing block letters within the past ten years. I would also say that at least 70% of my daily reading is done on screen, and maybe less than 2% of what I read is someone else's personal handwriting.\n\nI bring these thoughts up as just an awareness that may or may not have an affect on how the majority of us read and write. If it does, then that will affect how, why and what new typefaces are designed for... roman, italics, scripts, et al.\n\nSigning off... no more off-topic intrusions.\n\n"
    },
    {
      "time": "20 Jan 2006 — 3:56pm",
      "content": "I think Norbert is right that for e.g. Aldus' contemporaries, italic text was closer to what they were reading on a daily basis than the more formal roman types, and that readers were equally comfortable with both and may even have been more comfortable reading the italic types. It is important to remember that our contrastive use of italics in predominantly roman text is a later convention, and that the primary distinction is between formal and cursive writing models, between the book hand and the chancery hand. This is a distinction that is not limited to the Latin script: you find exactly the same thing in other mature manuscript traditions, e.g. Hebrew (with the added, third class of the semi-formal rashi style). The convention of use is not usually contrastive of different kinds of text within the same book, but contrastive of different kinds of books.\n\n"
    },
    {
      "time": "20 Jan 2006 — 4:49pm",
      "content": "\\> <cite>I would be interested in people’s views on what makes for a readable italic.</cite>\n\n[National Geographic Caption](http://web.archive.org/web/20150317234053/http:/www.theconnection.org/photogallery/fonts/default.asp?counter=8) (Matthew Carter, 1979) is a fine, and well-known, example of a stand-alone italic (no companion upright style) _designed_ to be as readable [to the present-day reader], as a roman typeface.\n\n"
    },
    {
      "time": "20 Jan 2006 — 7:03pm",
      "content": "Norbert, I don't really buy that italic was ever as readable as Aldus's Roman. What Jenson and Griffo and Garamond figured out was, I think, how to make type \\*more\\* readable than written letters.\n\nI forget where I read that the most readable is lower case serif type, and whenever you depart from it it slows the reader down. I believe it.\n\nMy question was, given that italic is slower, what can you do to reduce the difficulties. Thanks, Maxim, for the example of Carter's National Geographic italic. It solves the problem, it seems, by making an italic the same weight and width as the roman. That works admirably for his purpose, but wouldn't be so good as a companion italic. So of the different ways you can move toward the roman, which is most helpful? Or are there othere ways to achieve greater readability, other than increasing width, reducing slant, increasing weight?\n\n"
    },
    {
      "time": "20 Jan 2006 — 7:48pm",
      "content": "\\> <cite>It solves the problem, it seems, by making an italic the same weight and width as the roman.</cite>\n\nIt's not just the weight and the width...\n\n\"A drawing comparing Carter's National Geographic Caption (1979) to the magazine's previously used Roman and Italic typefaces. The overall weight and proportions are about the same, but the new design slants less than Italic and is as wide as Roman.\" [_Source_: Washington University in St. Louis News & Information \\> University News \\> _Typographically Speaking_ at Des Lee Oct. 10–Nov. 29 [2003]. Exhibition examines work of Matthew Carter, among the 20th century's preeminent type designers. By Liam Otten]\n\n ![](http://web.archive.org/web/20150317234053im_/http:/typophile.com/files/Natl_Geo_Capt.jpg)\n\n"
    },
    {
      "time": "20 Jan 2006 — 7:54pm",
      "content": "\\> wouldn’t be so good as a companion italic.\n\nTrue, but I think simply making it lighter would allow it to  \nclick as a companion (without impeding readability much).\n\nhhp\n\n"
    },
    {
      "time": "20 Jan 2006 — 8:34pm",
      "content": "But the National Geographic Caption typeface was never intended to be a companion to a roman in the sense that the regular italic type was. It is an example of an italic designed to be used alone, and also at a smaller size than the regular types.\n\nMy Constantia italic is another example of a wide italic, proportionally similar to the roman and, generally, setting only slightly shorter than the same text in the roman. In this case, of course, the aim was not general readability but specific readability in the context of ClearType screen rendering. In that case is it slightly lighter than the roman, and intended to be a companion to it and not a stand alone italic type.\n\n"
    },
    {
      "time": "20 Jan 2006 — 8:57pm",
      "content": "_What Jenson and Griffo and Garamond figured out was, I think, how to make type \\*more\\* readable than written letters._\n\nBut they were building on top of a distinction that had already been made, between formal book hands and running chancery hands, and which already exhibited different levels of readability. The key distinction, in the manuscript tradition, is of speed: the formal book hand is written slowly, without returning strokes, and tends to be more regular and less compressed. The running hand is faster, and with this comes slant and compression. What is interesting is that development of the less readable italic type followed that of the more readable roman, and was very popular both with printers -- since it allowed them to get more words on a page -- and with the reading public.\n\nRobert Bringhurst made the observation, during his keynote address at the ATypI conference in Vancouver, that at the time we are talking about everyone who was a reader was also a writer (usually in both sense of the word), and so recognised letterforms not only as a consumer but as a maker. This is similar to the point Norbert is making, I think. To know forms manually, through the regular making of them, may contribute to facility in cognitive recognition. So while italics may never have been more readable than romans, I have no trouble with the notion that italics may have been more readable for renaissance readers than they are for us.\n\n"
    },
    {
      "time": "20 Jan 2006 — 9:15pm",
      "content": "\\> it allowed them to get more words on a page\n\nBut -as I once tried to explain in my Daidala interview- narrow type isn't necessarily more economical; for the simple reason that you're losing apparent size in the process. Basically, it depends on the proportion of line breaks. Which is why Luce and Fournier called their narrow type \"poetique\": poetry -generally- breaks after every line, and that makes narrow type directly more economical.\n\nAlso, I have actually heard an expert or two claim that the view that Aldus used italic type because it was narrow because he was making smaller books is ballony.\n\nhhp\n\n"
    },
    {
      "time": "21 Jan 2006 — 12:29am",
      "content": "Well, Aldus did use italic types for text in his smaller format books, and used roman in the larger and grander productions like the _Hypnerotomachia,_ but it would indeed be reductionist balloney to claim that the motivation was economical. Unfortunately, most of the other motivations ascribed to Aldus by print historians are also dubious, because the people making them are print historians and they've largely ignored the manuscript culture within which Aldus is producing his books.\n\nWe shouldn't imagine that because Aldus is doing something that has not been done before _in type_ that he is doing something that has not been done before. He is applying the conventions of formal book hand and cursive chancery hand usage that were well established in Italian humanist manuscript production. The formal book hand is used in larger format volumes, usually prestigious productions intended to be experienced as objects of beauty as well as texts to be read. The chancery hand is used in more quickly produced, smaller books or booklets whose function is to transmit the text in a plain and convenient format. I've seen dozens of both kinds of manuscript books. Aldus was simply applying the distinction that already existed in the new medium of type. Unfortunately, most commentators on printing history know very little about manuscript production, so credit Aldus with the invention of the small format pocketbook, rather than the adaptation of an existing model to the new technology and market.\n\n"
    },
    {
      "time": "21 Jan 2006 — 2:15am",
      "content": "Verdigris Italic has quite open counters, especially in the h m n u -- their shoulders are not the typical sharp angles but round. This can already be found in the italics of Goudy's Truesdell and Village. It looks like Goudy adopted a form of shoulders which he first employed in his Mediaeval. Personally I like this trick because it allows to keep letterforms narrow.\n\n\"I don’t really buy that italic was ever as readable as Aldus’s Roman. ... I forget where I read that the most readable is lower case serif type, and whenever you depart from it it slows the reader down. I believe it.\"\n\nNo talk about textur/fraktur goes without the obligatory Bismarck quote, that no type is more readable than fraktur (as opposed to roman type), which is to amuse the audience: Nobody would subscribe to this TODAY. But this nicely indicates that whether roman, italic, blackletter are regarded as being more readable is a matter of habitualisation rather than any form per se being more readable. Maybe we are already moving away from (serif) roman, towards sanserif, and in some decades nobody would question that sanserifs are \"most readable,\" and who needs these disturbing serifs which are a mere reminiscence of another technique of producing letterforms.\n\n"
    },
    {
      "time": "21 Jan 2006 — 7:39am",
      "content": "\\>their shoulders are not the typical sharp angles but round\n\nThanks Karsten, nice insight. That is the kind of thing I was looking for in my question--how to make the italic more readable without pushing it too far toward the roman.\n\nAnother example that had been puzzling me is Spectrum's italic, which seems quite readable, at least in short passages, in spite of being quite narrow. Now looking again, the round letters are quite open. And maybe the disparity of the narrow mn is not so good for even color...\n\nI can believe that fraktur is quite readable to anyone accustomed to it. Though I wonder if it can be printed at as small sizes without the hairlines becoming too thin or the letters clotted. Was fraktur generally printed at somewhat larger sizes than roman? I seem to remember old German books having bigger type...\n\nFor reasons that don't apply to fraktur and that I gave in [this thread](http://web.archive.org/web/20150317234053/http:/typophile.com/node/17236), I don't believe that sans will ever become dominant for printing extended text.\n\n"
    },
    {
      "time": "21 Jan 2006 — 7:58am",
      "content": "\\> Nobody would subscribe to this TODAY.\n\n[http://www.themicrofoundry.com/ss\\_fraktur1.html](http://web.archive.org/web/20150317234053/http:/www.themicrofoundry.com/ss_fraktur1.html \"http://www.themicrofoundry.com/ss\\_fraktur1.html\")\n\nKarsten, the total relativism of readability is a fallacy, and a damaging one.\n\nhhp\n\n"
    },
    {
      "time": "21 Jan 2006 — 8:24am",
      "content": "\"But this nicely indicates that whether roman, italic, blackletter are regarded as being more readable is a matter of habitualization rather than any form per se being more readable.\"\n\nSounds more than plausible to me. The serif's expected triumph in readability beyond our current time could also well be a self-fulfilling prophesy. If the serif is continually touted as superior, it will continue to be used more often whether it indeed has traits above and beyond other forms or not.\n\nChrisL\n\n"
    },
    {
      "time": "21 Jan 2006 — 8:50am",
      "content": "Yes Chris, the next time your optometrist wants to up your prescription, tell him that you'd rather just read legal disclaimers and simply get used to the small type. What better than getting one's physical realities to promptly evaporate into the relativist ether, eh?\n\nhhp\n\n"
    },
    {
      "time": "21 Jan 2006 — 9:15am",
      "content": "_Was fraktur generally printed at somewhat larger sizes than roman? I seem to remember old German books having bigger type…_\n\nNo. Frakturs can be small, and not break apart. I recently had a chance to photograph a bunch of old specimens, mostly from Frankfurt c. 1680. There are quite a few fraktur types there that are six to eight point, and very clear. Unfortunately, I can't show any of these images before March.\n\nSmall Frakturs just have less stroke contrast, probably like all small type, I guess.\n\nSchwabachers were also made in quite small sizes, incidentally. But I wonder if Texturas ever really were. Gutenberg and his successors in Mainz printed with type that I find to be quite large.\n\nNone of this is scientific. I've never done any real studies on this, but this is all a gut feeling.\n\n"
    },
    {
      "time": "21 Jan 2006 — 12:26pm",
      "content": "One thing about italics, at least in the pre-digital era, was that they fitted a lot better than romans, without kerning.\n\nThis was an idea I discovered and explored in Oneleigh Italic, where I was able to design the face no kerning between lower-case letters, and only one or two Cap-lowercase kerns.\n\nI'm not convinced this smooth fit is necessarily an advantage, as it can tend towards an indiscriminate greyness; but on the other hand, roman text is prone to occasionally exhibiting really awkward glyph combinations which can't be good for fluent reading.\n\n"
    },
    {
      "time": "21 Jan 2006 — 1:32pm",
      "content": "_But this nicely indicates that whether roman, italic, blackletter are **regarded** as being more readable is a matter of habitualization rather than any form per se being more readable._ [My emphasis]\n\nKarsten is right that what people _regard_ as more readable isn't necessarily related to whether that form is actually more readable. I'm not sure that this is the point that Karsten was intending to make, and other respondents seem to have assumed that he meant something else, but that word 'regarded' is key. In determining whether one form of lettering is actually more readable than another, one needs to compare speed and accuracy test results for competent and habitual readers of either form. Obviously if someone had spent his whole life reading fraktur and is suddenly presented with roman type, he is likely to find the latter more difficult to read. But it is an error to presume from this experience that fraktur is per se more readable than roman.\n\nAs I wrote above, I have little doubt that renaissance readers found italic text to be easier to read than we find it, but that is an entirely different question from whether they actually found it to be as easy to read as roman. And that in turn is a different question from which they _regarded_ as easier to read. I might regard typeface X as more readable than typeface Y, but until I do a comparative test of reading speed and accuracy for both types, I have to accept that my perception may be incorrect.\n\n"
    },
    {
      "time": "21 Jan 2006 — 1:48pm",
      "content": "For me the question is not whether italic is less readable, but rather the factors that make it so. Karsten notes the 'pointy' arches. Here what is interesting about Verdigris is that it rounds the arches while keeping the letters on the narrow side. (Or so it seems, I don't have the font.) John, I notice your Constantia Italic has small serifs for an italic--perhaps because of the demands of cleartype. Do you think that this contributes to readiblity?\n\nOverall, I wonder which of the factors--wider letters, heavier weight, less steep angle, rounded letters, small serifs--have what impact. Anyway, thanks to all for your contributions. Any more ideas are most welcome.\n\n"
    },
    {
      "time": "21 Jan 2006 — 2:43pm",
      "content": "[I must apologize in advance for a very long post!]\n\nI am not an advocate of sanserifs either. Spectrum italic is really interesting. But I think it tends to being monotonous. This may relate to\n\nNick Shinn:  \n\"One thing about italics ... was that they fitted a lot better than romans, without kerning. ... This was an idea I discovered and explored in Oneleigh Italic, where I was able to design the face no kerning between lower-case letters, and only one or two Cap-lowercase kerns.\"\n\nYes! This is the game, not only for italics: keep letterforms as compact as possible and avoid elements extending too far, yet at the same time make it LOOK vivid and irregular. By the way of irregularity and readability. In \"The Case for Legibility\", p.77, John Ryder shows a nice illustration of the different slants in minuscules of Jenson italic, and mentions that this unfortunately has been evened out in certain re-cuts.\n\nJohn Hudson:  \nMy use of \"regarded as readable\" is a bit ambivalent indeed.  \nOn the one hand, I doubt the value of readability tests. As you also seem to imply, you can never be sure WHAT the results actually proove -- that people are used to certain forms? or that certain forms are \"objectively more readable\" by whatever criteria? These tests can only show THAT, at a particular time and place, people read certain typefaces faster than they read other ones.  \nBut I didn't intend to make a difference between \"scientifically provable\" readability and merely \"felt\" readability. My emphasis was on \"FORM PER SE being more readable\" which notion doesn't make any sense to me. See the following off-topic part.\n\nThis may be a bit off-topic, but ...\n\nhhp:  \n\"Karsten, the total relativism of readability is a fallacy, and a damaging one.\"\n\nSorry, I am \"relativist\" by default. Yet I am not fond of this term -- whenever I encounter it in philosophical writings, it is the last weapon used by naive-realist dogmatists. Ernst von Glasersfeld has some nice reply to that in his \"Radical Constructivism\" (the book's biggest fault is its silly title). ;-)\n\nThat aside ... you don't need to convince me of the advantages of fraktur. Yes, it is more condensed and its baroque-by-default forms may allow for more variation than roman. BUT: Give someone a text set in fraktur to read, and he will be in trouble. What IS readability? Of course you can conceive of some criteria and \"measure\" fraktur and roman against them, \"objectively.\" (Now you have to tell me what \"objective\" means. HAVING some criteria at all? How do you decide which criteria are the relevant ones?) But then you also have to tell the rest of the world (Germans included) that fraktur is \"objectively\" better and they should learn to read it -- so obviously there is more to readability than criteria like letters per page, &c.  \nRoman typefaces of the last decades have proven that much is possible in this domain too, in terms of readability as well as expression. It is a fact: We are USED to reading roman letterforms.  \n(I don't regret that. Except maybe for the long-s / end-s distinction which nicely indicated where you could divide a word, and where you couldn't.)\n\nThe link to your website, part 2: I haven't been at ATypI Leipzig, and only heard about the panel discussion. (Volker Küster was my type design teacher.)  \nI cannot help thinking that \"modernizing fraktur for contemporary use\" is cheating. The result will either be too much of fraktur and of no use, or not fraktur any more ... There already were such attempts, around 1930, to \"modernize\" textur type and bring them \"up to date.\" Element, National and Tannenberg. If you study these typefaces carefully you will realize that they are the exact equivalent to Futura and its contemporaries -- reduction. If you look at National you'll notice the normalized S and s and k forms, or the one-storey a (this is Futura translated into blackletter!), but also the additional vertical part to the r's ear and the additional vertical connecting part at the e's slope -- both of which have a visual function, but can also be interpreted to utter a deep misunderstanding of textur laws of form. These are very extreme examples (in many respects) but, to me are proof that something is wrong about this approach.\n\nWhich finally leads me back to the topic ...\n\nI consider it more fruitful to study good fraktur and textur type, or early roman types like that of Sweynheym & Pannartz, to find out if they have features which would enhance type today. For me this is not particular letterforms but very \"abstract\" things like a dark color (remember the complaints about Dolly on a thread next door? someone got it but didn't understand), compact letterforms which make spacing and kerning easier (see Nick's remark above), or a certain irregularity (like varying slants in italics). Unfortunately, Grotext is not finished yet which is such an experiment.\n\nHope I did not waste your time. ;-)\n\nKarsten\n\n"
    },
    {
      "time": "21 Jan 2006 — 3:18pm",
      "content": "\"It is impossible to say anything about the autonomous typographic letter without calling to mind this historiographic falsification. Falsification is a familiar phenomenon in science. Scholars revert to it when the theory on which they have spent a lifetime threatens to be swept away.\"\n\npp. 18, Gerrit Nooordzij, \"The Stroke\"\n\nChrisL\n\n"
    },
    {
      "time": "21 Jan 2006 — 3:47pm",
      "content": "John,  \nI don't know if you count me as one of the \"other respondents [who] seem to have assumed that he meant something else\" or not. I assure you that the word \"regarded\" is the prime factor I addressed. \"Regarded\" is more often what we act on than what may be indicated in any data collected. Too often people look at the conclusion drawn or postulated reasoning for the effect being measured instead of scrutinizing the way the testing was done and what we may draw from that limited spectrum. Testing that measures complexity and redundancy of saccades in types in use today can easily be \"regarded\" as a measure for types to come in use in the future. I don't pretend to know what they will be any more than the blackletter reading people of years past knew would come after their time. The concept of \"habitualization\" has never been fully addressed perhaps because it is too difficult to measure. Those who make type selection decisions make their decisions mostly on what they \"regard\" as the best selection whether it in fact is or not. They may listen more to those who TO THEM are \"regarded\" to be the experts whether they in fact are or not.  \nMy intent with all of this is that we not close the doors to what might prove to be a better tool or methodology because \"the theory on which they have spent a lifetime threatens to be swept away.”\n\nChrisL\n\n"
    },
    {
      "time": "21 Jan 2006 — 4:23pm",
      "content": "I always try to avoid the psychological aspect. Comparing readability of fraktur vs roman may be easy though -- I would not consider a type readable if readers have to guess first whether a form represents an A or U, or an S or G, or a long-s or f. Comparing readability of two serif typefaces may be a bit more difficile; the measure today is reading speed, which includes questions like, we filmed his eye movement and made sure he viewed all text, but did he understand it? So it even touches the meaning of \"reading.\" (I know, this is also covered by text related questions to be answered.) But my point is, if by tests we find out about reading speed, do we get to know MORE than this fact, more than information about reading speed related to texts set in a certain typeface (in a certain size, with certain leading, spacing, printed in a certain color -- black is not the same as black --, by a certain printing method, on a certain paper, of a certain texture, and color &c)? Similarly, what does it mean if the outcome of such a reading test is that \"black on white is more readable than blue on yellow\"? Which blue, which yellow, what were the lightning conditions, or the atmosphere in the room? You can make everything look scientific by systematizing factors and eliminating others. But which factors are important and which aren't? My point is, by the sole fact that a typefaces is \"read\" a higher speed, which inferences may we draw, and what would be over-interpretation?\n\nBut, after Bill's last clarifications, this turns out to be off-topic musing.\n\n"
    },
    {
      "time": "21 Jan 2006 — 4:58pm",
      "content": "The question was easier to read, not faster to read.  \nWhaddaya want, the Mickey D of typefaces?  \nThese are banal parameters with which to measure the worth of a typeface.  \nWhy not ask whether it's more enjoyable to read?  \nWhether it enriches the text more?  \nWhether it makes your head spin and transports you to a magical place?  \nBut of course, that can't be measured.\n\n"
    },
    {
      "time": "21 Jan 2006 — 5:27pm",
      "content": "\\> One thing about italics, at least in the pre-digital era, was  \n\\> that they fitted a lot better than romans, without kerning.\n\n?!  \n(But I'll wait a little bit more for some other people to counter this...)\n\n\\> keep letterforms as compact as possible and avoid elements extending too far\n\nThis is anti-readability.\n\n\\> make it LOOK vivid and irregular.\n\nThis is artificial and not inherently supportive of readability.\n\n\\> These tests can only show THAT, at a particular time and place,  \n\\> people read certain typefaces faster than they read other ones.\n\nYou are basing that merely on a preconceived ideology. Tests can  \nshow a lot more than that. The fact they haven't yet means little.\n\n\\> Sorry, I am “relativist” by default.\n\nI'm sorry too.\n\n\\> Give someone a text set in fraktur to read, and he will be in trouble.\n\n1) For how long?  \n2) Then what happens?  \n3) What kind of fraktur? What IS fraktur?\n\n\\> The result will either be too much of fraktur  \n\\> and of no use, or not fraktur any more\n\nHey, I thought you were a relativist?  \nThat's really way too puritanical, no?  \nTo me Design is about serving, not sermons.\n\n\\> There already were such attempts\n\nThose were junk. Not what I'm talking about.\n\n\\> I consider it more fruitful to study good fraktur and textur type,  \n\\> or early roman types like that of Sweynheym & Pannartz, to find out  \n\\> if they have features which would enhance type today.\n\nAssuming you would then actually do something about what you find, how is it different than what I'm proposing? What you will find are things that are anti-Roman. Then what will you do?\n\nBut anyway, why bother, since you're a relativist?\n\n\\> \"Falsification is a familiar phenomenon in science.\"\n\nAnd thick blinders are a familiar accessory of relativists.  \nGerrit \"printing was a fall\" Noordzij indeed...\n\n\\> The concept of “habitualization” has never been fully  \n\\> addressed perhaps because it is too difficult to measure.\n\nI think it's because almost everybody who puts it on a pedestal and  \nworships it worries -rightly- that it will turn out to be a diversion.\n\nThe centrality of Familiarity is used as an escape by all kinds of people, from Luddite chirographers to PoMo hooligans. What's telling and hilarious -if in a sad way- is that none of these people ever bother to actually research it!\n\nFamiliarity is difficult to measure?! Try readability!  \nBut the real fallacy here is this classical Modernism:  \n\"What can't be counted doesn't count.\"\n\n\\> The question was easier to read, not faster to read.\n\nSame thing (when measured long enough).\n\nWhat's truly banal is Style, expression for the sake of erecting a designer's nipples.\n\nhhp\n\n"
    },
    {
      "time": "21 Jan 2006 — 5:50pm",
      "content": "\\> I think it’s because almost everybody who puts it on a pedestal and  \n\\> worships it worries -rightly- that it will turn out to be a diversion.\n\nOR:  \nThe type of person who latches onto Familiarity is the type of  \nperson likely to shun analysis; he will avoid true, objective  \nresearch into it, so never really discover it's a diversion;  \nand maybe he knows that - and that's an impenetrable  \nfortress right there.\n\nhhp\n\n"
    },
    {
      "time": "21 Jan 2006 — 6:07pm",
      "content": "I confess to getting a little tired of musing about readability in the abstract--which I have done my share of. Because we don't have good tests the talk doesn't lead much of anywhere.\n\nI am looking not at what is tested or proven or in general true, but what people find for themselves. Eg. Karsten's observation about Goudy and how van Bronkhorst applied the idea in another way. And at least one astute observer--John Berry--saw the difference in readability--and so do I. Others may disagree, but I am interested in what people's eyes and experimentation tells them, even though it may not be generally true.\n\nSomeone mention Jenson's variation in slope. I just checked Adobe Jenson, and indeed it has a lot of variation, but still manages to be pretty readable even though it has a lot of character. What did Slimbach do to pull it off?\n\n"
    },
    {
      "time": "21 Jan 2006 — 6:34pm",
      "content": "_John, I notice your Constantia Italic has small serifs for an italic—perhaps because of the demands of cleartype. Do you think that this contributes to readiblity?_\n\nThe length of the serifs is related to their horizontality. If the serifs were steeper they could be longer, but my aim in Constantia was to avoid cluttering the limited pixel space in the x-height range, so the serifs are quite flat and short.\n\n"
    },
    {
      "time": "22 Jan 2006 — 6:01am",
      "content": "hhp:  \nI don't get your point. You are argueing as if you want to counter me, but what you say actually supports me.\n\nKL -- \"keep letterforms as compact as possible and avoid elements extending too far\"  \nhhp -- \"This is anti-readability.\"  \nKL -- \"make it LOOK vivid and irregular.\"  \nhhp -- \"This is artificial and not inherently supportive of readability.\"\n\nToo quick. Let me illustrate what I mean. Nick's Oneleigh Italic, at [www.shinntype.com](http://web.archive.org/web/20150317234053/http:/www.shinntype.com/) (left column, 4th from bottom), is a really good example. It combines both aspects:  \n(1) Letterforms are very compact. By \"compact\" I mean things like: Hooks at n m i are rather small, so the n or m fits into a square. p descender slant is very steep. f is anything but swashy which avoids collision. (If you [hhp] like it more swashy, it's no problem to do this by calt where the surrounding letter allow it.) The t horizontal bar is short towards the right side, so keeping it withing the square, but it doesn't hurt. The k bottom finial extends below the baseline, this again keeps the entire form within a square and avoids possible white space (and thus kerning) rightside. The g's lower bowl does not extend much either. &c.  \n(2) Nevertheless -- maybe because of this -- the type looks very quirky. Which I find \\*enhances readability\\* (let me define: eases recognition of word images). Like, it is easy to make out p's alone by the different descender slant, the s by its movement to the left (again to fit the square, obviously), the k by descending below the baseline. &c. There is nothing \"artificial\" about it and can be fully accounted for by reason. ;-)\n\nNick Shinn:  \n\"Whaddaya want, the Mickey D of typefaces?\"\n\n:) Readable, legible ... there's a distinction, but in English terminology I don't know which is which.\n\nKarsten\n\n"
    },
    {
      "time": "22 Jan 2006 — 7:40am",
      "content": "Legibility: \"the ease with which one letter can be told from the other\".  \nReadability: \"the ease with which the eye can absorb the message and move along the line.\"\n\np. 85, Types of Typefaces, by J. Ben Lieberman, 1967. This page also has pictures of Beatrice Warde of Monotype and Paul A. Bennet of Linotype, to whom the book is dedicated. I suspect the distinction of legibility and readablity at least goes back to them.\n\nSo I think Karsten, you mean 'legibility'.\n\nOneleigh has its charm, but I do think readability is compromised. In the accompanying note on the face, Nick says that the italic is influenced by Goudy's 'Companion' typeface. Looking at Companion in Mac McGrew's book, the stress is more regular, but the strokes less 'within the box'. For example the k descends more below the basline, and to the right, requiring kerning. Oneleigh follows other Goudy italics in the rounded shoulders that Karsten points out. I would put Companion higher on 'readability,' though neither face is really aiming for that as a priority.\n\nThe challenge I am interested in here is how to achieve both expressiveness, which I think is to an extent desirable even in a text italic, and readability.\n\nAdobe Jenson has a great variety of slopes in the italic, but to me is more balanced and even in color than Oneleigh. The quirky look of Oneleigh is no doubt a deliberate goal of Nick, but here I am interested in how Slimbach pulls off the even color inspite of the variety of slants. It does have a \\*lot\\* of kerning, which you could say is \"cheating\" with a revival of a metal face, but the resulting look is great, which for me justifies it.\n\nIncidentally, by contrast, the italic of 'Goodchild,' Nick's Jenson-inspired font, is much more regular. Nick says he wanted to get away from the usually more calligraphic look of Jenson revivals. Also he gives it a large x height, so it is a different animal--more modern, as he says.\n\n"
    },
    {
      "time": "22 Jan 2006 — 9:03am",
      "content": "Thank you for the legibility and readability definitions!\n\n\"I would put Companion higher on ‘readability,’ though neither face is really aiming for that as a priority.\"  \n\"Incidentally, by contrast [with Jenson], the italic of ‘Goodchild,’ Nick’s Jenson-inspired font, is much more regular.\"\n\nSo you tend toward the rather calm or modest typefaces. ;-) It cannot be denied that Oneleigh is expressive, yet the exaggeration makes it easy to see the principles at work. These don't differ from the ones in Adobe Jenson Italic, though in Jenson they are much more subtle. Even in Jenson Italic, the t bar is very short, the f endings are far from being swashy. Especially note the y which tries to be compact; this becomes more obvious if compared to the swash alternate y. Part of the evenness in turn seems to result from similarly wide counters.  \nAnother interesting thing which I see in Jenson Italic is that e.g. m n r stems are leftside curves while i or t stems are rightside curves. This may also add to (I think) legibility & thus readability.  \nA lot of kerning doesn't mean cheating at all, and digital type need not imitate letterpress type. Not even in a revival. What I am interested in is to keep efforts in type design reasonable. One aspect is to avoid too much kerning, and \"compact\" letterforms help a lot. I see that this sounds worse than it is meant -- I don't make squarish letterforms myself and do kern terribly much.\n\nKarsten\n\n"
    },
    {
      "time": "22 Jan 2006 — 9:28am",
      "content": "Thanks for pointing out Oneleigh Italic Karsten, now you made me want to buy the darn thing :-)\n\nChrisL\n\n"
    },
    {
      "time": "22 Jan 2006 — 10:45am",
      "content": "Karsten has explained my point about italics fitting better, by mentioning how the characters \"fill the square\". The character forms that differ most between roman and italic are v and w. In combination with round characters, it always seems like there is too much space around these in the roman. Some digital romans address this by giving v and w negative sidebearings, not something that was done in metal. Many others, like Adobe Garamond, have negative sidebearings and also negative kerning.\n\nThe round forms of v and w in the italic \"fill the square\" better.\n\n"
    },
    {
      "time": "22 Jan 2006 — 11:04am",
      "content": "I think Oneleigh and Adobe Jenson are much different in principle. Compare the a and c in the two faces. The stress in the a and c in Adobe Jenson--based on the calligraphic italic of Arrighi--is the same, with just some variation due to the width of the a. In Oneleigh the stress on the a and c seem to me to be quite different. The more uneven stress in Oneleigh is one contributor to the quirky feeling.\n\n\\>m n r stems are leftside curves while i or t stems are rightside curves.\n\nI don't understand what you mean here. What do you have in mind? --The lead in or serif of the mnr, including the more vertical part is thinner than the bottom of the stem; this seems to be general with italics. The slant of the i , though, seems more like the stem than the branch of the n.\n\n"
    },
    {
      "time": "22 Jan 2006 — 11:38am",
      "content": "\\> You are argueing as if you want to counter  \n\\> me, but what you say actually supports me.\n\nIs it strange that we agree in some ways and disagree in others?  \nBut if you're saying that we're agreeing completely, needless to  \nsay I don't see that at all.\n\n\\> fits into a square\n\nAnd you think this helps readability? I don't.  \nAnd really, based on other things you wrote,  \nyou shouldn't either! :-/\n\n\\> The t horizontal bar is short towards the right side,  \n\\> so keeping it withing the square, but it doesn’t hurt.\n\nNo? I think it hurts plenty. Horizontality and a strong  \nhead are how the \"t\" supports readability. Neither are there.\n\n\\> quirky ... eases recognition of word images\n\nWhen applied without an understanding of  \nreadability, it can only do so by dumb luck.\n\nI'm the biggest fan of divergence in order to improve  \nreadability! But the good foundation has to be there,  \notherwise it's just random noise.\n\n\\> Readability: “the ease with which the eye can  \n\\> absorb the message and move along the line.”\n\nThis I don't agree with. An essential dimension of  \nreadability is duration/length. Without including this  \nany definition just won't cut it in my book, so to speak.\n\n\\> kerning ... is “cheating” with a revival of a metal face\n\nFor some reason I don't have a problem with that sort  \nof thing. And few people -like Dan Carr- seem to, really.\n\nFor one thing, a discerning typographer could always file  \ndown sorts to make them fit better (although of course it  \ntakes too much effort to do it to pages and pages of text).\n\n\\> Karsten has explained my point about italics fitting better,  \n\\> by mentioning how the characters “fill the square”.\n\n(We're sort of migrating across threads now, but OK.)\n\nThe big problem with this direction of thought is that  \nit's the lack/weakness of serifs promoting the boxiness,  \nnot the slant. This is even before we get into the issue  \nof the detriment of boxiness to readability...\n\nThe fact is that italics, due to the need to limit breakage  \nand hence kerns, are necessarily fitted more poorly <cite>in the<br>\npre-digital era!</cite>\n\n\\> it always seems like there is too much space around these in the roman.\n\nThe fatal flaw of this logic is the assumption that only black space  \nconveys information\\*. Not to mention the direct opposition to the  \nother thing in Oneleigh that Karsten points out: irregularity.  \nThe two combine to imbalance the leveraging of notan.\n\n\\* A natural symptom of creation-centric (as opposed to  \nuser-centric) design and/or the perception that a font  \nis a bunch of shapes (as opposed to a notan machine).\n\nhhp\n\n"
    },
    {
      "time": "22 Jan 2006 — 1:11pm",
      "content": "When I wrote that \"m n r stems are leftside curves while i or t stems are rightside curves,\" reference is neither to serifs nor to overall slant, but to the form/shape of the stems themselves:  \n-- with n m r, vertical stems are like this: )  \n-- with i t u, vertical stems are like this: (\n\n\"I think Oneleigh and Adobe Jenson are much different in principle. Compare the a and c in the two faces. The stress in the a and c [...]\"\n\nWhen using the word \"principle\" I didn't appeal to stress but to the square-trick in which respect they share a lot. When talking about stress however, you are definitely right. Btw, Oneleigh is very \"Goudy\" as regards stress! This kind of stress is Goudy type design humor at its best.\n\nhhp:  \n\"fits into a square\" -- \"And you think this helps readability? I don’t.\"\n\nThere is no direct link between fitting-into-a-square and readability. In my post I made two sections, (1) describes what I mean by \"compactness\", and (2) mentions that \\*some\\* effects of trying to keep letters compact (like different slants) enhance readability (for which I gave my then-definition).  \nThe square-trick just makes type designer's job easier. We may not cut letters into lead blocks any more, but even with the latest and most advanced technology, the basics have not changed: Each letter is placed in a box with leftside and rightside flesh, and if you find that a particular pair would need special adjustment, you kern it. But: Kerning = hard work. So: If you have a chance to avoid it, do it. ;-)\n\nAbout irregularity and readability. In his text about Today Sans Serif, Albert-Jan Pool made an interesting remark: \"It [Today] looked so irregular, with each character featuring its own peculiarities. To my eyes it was sparkling with detail in all of its elements. It was one big idiosyncrasy. I showed him [Volker Kuester] my design and told him that I was striving for evenness and harmony by repeating as many forms as possible. Volker explained to me that he was doing exactly the opposite in order to achieve the same goal. This was how I started to get a visual grip on the interaction of readability and legibility [...]\" In Robert Norton: \"Types Best Remembered,\" Parsimony Press 1993.\n\n\"But if you’re saying that we’re agreeing completely, needless to say I don’t see that at all.\"\n\nNever mind.\n\n"
    },
    {
      "time": "22 Jan 2006 — 1:28pm",
      "content": "\\> \\*some\\* effects of trying to keep letters compact  \n\\> (like different slants) enhance readability\n\n1) It seems your thoughts on \"compactness\" are black-centric.  \n2) How do you think compactness helps, exactly?\n\n\\> The square-trick just makes type designer’s job easier.\n\nYeah, and not designing fonts is even easier.\n\n\\> In his text about Today Sans Serif, Albert-Jan Pool ...\n\nI read that in the 90s.\n\n\\> Never mind.\n\nSure, whatever - it's your mind.\n\nhhp\n\n"
    },
    {
      "time": "22 Jan 2006 — 3:02pm",
      "content": "_\\> fits into a square  \nAnd you think this helps readability?_\n\nYou're projecting again.  \nI don't mention the \"R\" word or the \"L\" word anymore.\n\nI said that italics fitted better than romans, and qualified that by saying \"I don't know whether that's a good idea\"\n\n"
    },
    {
      "time": "22 Jan 2006 — 3:02pm",
      "content": "_\\> fits into a square  \nAnd you think this helps readability?_\n\nYou're projecting again.  \nI don't mention the \"R\" word or the \"L\" word anymore.\n\nI said that italics fitted better than romans, and qualified that by saying \"I don't know whether that's a good idea\"\n\n"
    },
    {
      "time": "22 Jan 2006 — 3:18pm",
      "content": "_The fact is that italics, due to the need to limit breakage  \nand hence kerns, are necessarily fitted more poorly in the  \npre-digital era!_\n\nI don't understand. Could you explain that a bit more?\n\n_\\> it always seems like there is too much space around these in the roman.  \nThe fatal flaw of this logic is the assumption that only black space  \nconveys information\\*._\n\nIn saying \"it always seems\", I was recognizing that most people today, type designers and typographers, prefer to see the space around the v, w, and y tightened up. I don't think this is a logic, it's just what people like to see. It could even be considered a preference for a certain flavour of notan.\n\nYou're creating a straw man here, in order to launch your \"you don't know from notan\" missile.\n\n"
    },
    {
      "time": "22 Jan 2006 — 3:33pm",
      "content": "— with n m r, vertical stems are like this: )  \n— with i t u, vertical stems are like this: (\n\nThanks, Karsten, I now see what you mean--and I do think this might contribute to the success of the Adobe Jenson italic. Nicely observed.\n\nThese features are a part of the very clever way Slimbach handles the extremes of the strokes as they reverse themselves. This way he is able to introduce a lot of 'flare' to the strokes, which is part of the overall look of the italics, and which gives them a lot of energy but keeps them readable. The roman of Adobe Jenson has a lot of flare in the stems also, so it also unites the look, even though the models from the roman and italic are from different people.\n\nI see that Centaur's italic doesn't have the flare, so perhaps this is Slimbach's innovation. Impressive!\n\n"
    },
    {
      "time": "22 Jan 2006 — 3:39pm",
      "content": "This is also a feature of the earlier Poetica as I see now.\n\n"
    },
    {
      "time": "22 Jan 2006 — 5:00pm",
      "content": "Interesting. I see what you mean about Poetica. I think Poetica looks great large, but in small sizes--and not very small at that--it crashes in readibilty, whereas Adobe Jenson keeps on reading well at small sizes. Part of this is Poetica's narrowness, which in large size gives it tension and drama, whereas at small becomes very difficult to read. Jenson is wider--the m is 25% wider than Poetica, which is a lot--so that is an important factor, but I also wonder whether the darker weight and flairing stems of Jenson, and their affect on color is also helpful.\n\nBy the way comparing Poetica and Adobe Jenson at small sizes will show anybody who is doubtful that this readability stuff is for real. In large size both are perfectly legible, in the sense of telling readily one letter from another. But at small size the difference in readability is dramatic.\n\nAs you can tell, I am a big fan of Slimbach, especially his italics, which I think are really strong.\n\n"
    }
  ]
}
