{
  "id": "1744",
  "title": "Serif bold",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "I was wondering if you'd like to critique this, a bold serif face I've been working on... for use in flash. all comments are greatly appreciated.   \n   \nI've been working on several fonts, but this one I'm having the most trouble with... anyway, here it is:   \n   \n ![font](http://web.archive.org/web/20150414144207im_/http:/www.typophile.com/forums/messages/29/1899.gif)\n\n",
  "author": "afo",
  "time": "30 Jul 2002 — 11:40pm",
  "uid": "830",
  "comments": [
    {
      "time": "31 Jul 2002 — 8:46am",
      "content": "The punctuation ( . ,\n\n"
    },
    {
      "time": "31 Jul 2002 — 8:50am",
      "content": "Very classy, well crafted, and very readable. Your lc \"g\" is a surprising success.   \n   \nYou're calling it a Bold (standard practice for a bitmap font with 2-pixel stems), but I think this is what works for on-screen reading.   \n   \nConsider:   \n1. Calling it a Regular, and making Light and Bold (3-pixel) weights.   \n2. Extending the ascenders by a pixel: it will improve readability, and lighten the color a bit.   \n   \nhhp\n\n"
    },
    {
      "time": "31 Jul 2002 — 10:47am",
      "content": "Really nice and well balanced!   \nWho needs anti-alias now?   \n   \nI think that you can try \"old fashioned\" numerics to go with this letters, and 'cause it's a serif font, make precise kerning settings for all characters.   \n   \nGreg\n\n"
    },
    {
      "time": "31 Jul 2002 — 11:04pm",
      "content": "thanks very much for the responses. the weight of punctuation is definitely off, as is the kerning - something I have yet to fully grasp technically, especially with serifs...   \n   \nHrant, thanks, I agree with you regarding \"bold\" screen fonts seeming in reality more like regular width - Gregory's excellent kind family as an example.   \n   \nI'll post the light version shortly... I was working on a three-pixel width but it looked too rediculous!\n\n"
    },
    {
      "time": "11 Aug 2002 — 12:38am",
      "content": "does this kerning look right or wrong?   \n   \n ![kerning](http://web.archive.org/web/20150414144207im_/http:/www.typophile.com/forums/messages/29/2021.gif)\n\n"
    },
    {
      "time": "11 Aug 2002 — 2:38pm",
      "content": "The first inconsistencies I notice...   \n   \n- lower 'ca'   \n- cap/lower 'Co'   \n- cap/lower 'Ex'   \n   \n...are all a bit loose.   \n   \nIf you've got a few hours, use the handy [Typophile   \nkern pair list](http://web.archive.org/web/20150414144207/http:/typophile.com/downloads/) to really fine-tune your kerning.\n\n"
    }
  ]
}
