{
  "id": "17444",
  "title": "Ethics and font licensing",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Link spotted this morning in the mainstream press...\n\n[http://www.sltrib.com/faith/ci\\_3423112](http://web.archive.org/web/20131013211047/http:/www.sltrib.com/faith/ci_3423112 \"http://www.sltrib.com/faith/ci\\_3423112\")\n\nScroll down to the second ethical dilemma\n\n",
  "author": "Si_Daniels",
  "time": "21 Jan 2006 — 7:37am",
  "uid": "1049",
  "comments": [
    {
      "time": "21 Jan 2006 — 8:38am",
      "content": "_Hey, that is here in Utah._\n\nInteresting that someone was willing to publicly, albeit anonymously, discuss this. I'm 100% sure that this teacher and university is not the only school with this problem. I feel for this person's situation and am glad for their decision.\n\n"
    },
    {
      "time": "21 Jan 2006 — 10:05am",
      "content": "\\>Hey, that is here in Utah.\n\nLooks like it's syndicated from NYT - maybe it will be in all the Sundays - Which would be sweet.\n\n"
    },
    {
      "time": "21 Jan 2006 — 3:11pm",
      "content": "Here's the full text, for when the link stops working. (They always do.)\n\n----------\n\nI am a design professor at a state university that is unable to adequately fund our graphics program and thus to provide the fonts we need to teach typography. My colleagues and I have stocked the lab computers with fonts we purchased as professional designers, fonts licensed only for our use on a single computer, not multiple machines in a classroom. Are our actions justifiable in the name of education?  \n - Anonymous, Connecticut\n\nYour motives are good; your methods are not. It is regrettable that this important resource is so expensive, but that does not justify the conduct you describe.  \n There are alternatives that might help you get the fonts you need. As I'm sure you know, much software is available at a more modest educational rate or even as shareware. Some schools impose a small materials charge on students in lab classes. What's more, there is much debate about what is permissible as fair use. It is doubtful that this doctrine allows installing multiple copies of an entire font, but that is something for an intellectual property lawyer to sort out. Unfortunately, if these options prove useless, you are still ethically barred from semi-swiping these fonts.  \n Update: The design professor tried each of these strategies, with no success. He plans to delete all but legitimately licensed fonts and hopes that students seize the opportunity to be creative.\n\n----------\n\nI take umbrage at this part of Mr Cohen's reply: \"...but that is something for an intellectual property lawyer to sort out.\"\n\nActually, it's something for the professor, the students, and the foundries to sort out. But Mr Cohen was correct when he said that \"much software is available at a more modest educational rate or even as shareware.\"\n\nProfessor X in CT, and any other prof in the same situation should contact the foundries whose work c/he finds interesting and potentially useful to her/his students; some will donate fonts, or offer discounts on multiple-use for educational purposes. We need to instill in students a respect for type, and teach then that possession is NOT 9/10ths of the law when it comes to software.\n\n"
    },
    {
      "time": "18 Feb 2006 — 1:22pm",
      "content": "Chester, where do you stand on this? Would Village, for instance offer typefaces for students?\n\n_On a similar note._ Can fonts be generated to only work on the machine's on which they were installed? Is something like that possible?\n\n"
    },
    {
      "time": "18 Feb 2006 — 2:09pm",
      "content": "_Can fonts be generated to only work on the machine’s on which they were installed? Is something like that possible?_\n\nThat would be super. Really, really great! I don't think it is possible yet, though.\n\nSeveral foundries do have students discounts available, including at least Adobe (they have at least one package available at a student price), T-26, and Linotype. I think that student pricing is a good idea, and all the other software I used as a student was available at discounted rates.\n\n"
    },
    {
      "time": "18 Feb 2006 — 7:24pm",
      "content": "\\> Can fonts be generated to only work on the machine’s on which they were installed? Is something like that possible?\n\nSorry to state the obvious. This wouldn't be very useful to most users - fonts are not music files. You need to embed them in PDF's and send them to output devices for them to be useful.\n\n"
    },
    {
      "time": "19 Feb 2006 — 9:25am",
      "content": "Fair enough. I suppose I'm thinking of a specific setup where the students can print from the design lab directly to the printers in the building or the print room on campus. They can also log on to the font server from their student housing. With this type of controlled environment, couldn't there be some way to control the font usage?\n\nBut, my question is really about finding a way to guarantee the fonts won't go with the students. However, I know there are no guarantees.\n\n"
    },
    {
      "time": "20 Feb 2006 — 5:40am",
      "content": "_my question is really about finding a way to guarantee the fonts won’t go with the students_\n\nStrip searches (including cavities), along with disabling email on the classroom computers, are probably the only methods that would work...\n\n"
    },
    {
      "time": "20 Feb 2006 — 9:03am",
      "content": "Tiffany, since you ask...\n\nI don't like to publicise the exact terms of Thirstype's & Village's student licensing, but it is quite favourable to the student. We mostly ask that students respect the type, don't share it with their colleagues, and a few other stipulations, all pretty easy to meet. (The other foundries distributed by Village have their own feelings about this; I only speak for the two foundries I can speak for.)\n\nAs for strip-searching students... oldnick, you are a dirty old man ;-) Don't forget to look on their iPods and Flashdrives too... There really is no way to guarantee that students won't steal typefaces and other software. In my mind, the most important thing is that they legally license the typefaces once they use them out in the real world.\n\nThere have been efforts made in the past to protect font files from piracy, none of which has really been successful. The one which comes to mind is the hidden Mac OS 9 extensions which \"enabled\" a generation of Hoefler Type Foundry (before Mr Frere-Jones' arrival) types. It was impossible to send files to service bureaux, as they also needed the hidden extension. And this was in the says before PDF print workflows, when 99% of design layout was RIPped from QuarkXPress. HTF released updated and unprotected files to their clients to replace the protected files.\n\nI would be very curious to hear the story from Mr Hoefler directly; I think that it was an important and useful experiment, and many of of were watching with great interest.\n\n"
    },
    {
      "time": "20 Feb 2006 — 9:07am",
      "content": "Here’s my idea…\n\nRealizing that design students are the future customers of their work a consortium of leading, respected font makers has put together the “Educational Font Program” font rental service for college design departments worldwide. For a low annual fee subscribers get access to hundreds of high quality fonts for student and faculty use. A tiered program to fit any budget, fonts are provided in managed sets, including “classic text faces”, “Best of the Bauhaus”, and the ever popular “Typophile Picks of 2003”.\n\nEach font set includes best sellers from foundries like X, Y and Z. These are the full complete retail OpenType versions of the fonts in question, the only difference being that they include a unique serial number encoded within each font file and font name linking the font to an educational establishment. For example “Gill Sans” would become “Gill Sans Ed4567”, where 4567 is a unique identifier associated with the school.\n\nThe fonts are managed by a custom version of “N”, the leading font management utility. The utility includes advanced font auditing technology to help ensure that all fonts installed on the school’s workstations are legally licensed. Using the tool administrators set parameters to allow or restrict additional font installation or purge unlicensed fonts.\n\nIn addition subscribers also receive access to printed and online material describing the art and science of font design and development, and for a small additional fee a real living breathing type designer will visit the school and give a lively presentation on type design to the staff and students.\n\n"
    },
    {
      "time": "20 Feb 2006 — 9:16am",
      "content": "Si, I like it. But depending upon a font management app is not that convincing to me. (I use Font Book.) That being said, just as there are educational versions of software which clearly state this in the splash screen, I think that \"Edu\" versions of fonts - with or without the serial number - are a very good idea. As are the ideas for resources, type designer visits, etc.\n\n"
    },
    {
      "time": "20 Feb 2006 — 11:05am",
      "content": "I really like this idea as well.\n\nMost school's do use a licensed font management app, so the key would be to have the management app as part of the deal. Less hassle for them. The instructions for use are included. More and more school's require laptops, why not also include fonts?\n\nMost school's -- and I'm basing this off of my past experience -- by now have an IT team in place. Any computer on campus has the same software. The labs are specific for their use. Obviously the average engineering program is different than the industrial design, for instance. I would guess that the IT department at most school's is site wide. Random thinking, but anything organized, packaged and designed to assist people would be an added bonus. I'd guess if the numbers were right and the correct people approached this could be a wonderful thing.\n\n"
    },
    {
      "time": "20 Feb 2006 — 1:00pm",
      "content": "There has to be a way to get students involved in the process.\n\nChrisL\n\n"
    },
    {
      "time": "20 Feb 2006 — 1:48pm",
      "content": "Only problem is that it takes a few years to really get something serious set up, by which time any students who might have been involved in a project aren't students any more.\n\n"
    }
  ]
}
