{
  "id": "1750",
  "title": "Serif to go with New Gotham typeface for new magazine..",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Here is the info i can provide:\n\nThe Typeface chosen for the headlines is [Gotham](http://web.archive.org/web/20150321232613/http:/typophile.com/wiki/Gotham) from Hoefler, you can see it here, i might variate the weight from article to article, but usually go with medium.  \n(see here: [http://www.typography.com/catalog/gotham/more5.html](http://web.archive.org/web/20150321232613/http:/www.typography.com/catalog/gotham/more5.html)}\n\nIt will be for a magazine about culture and life on a danish island called \"funen\" - it's qualities (the ones we try and get across atleast) are that of hardworking, sturdy, stabile, well crafted, down to earth exelence.\n\nI hope to print on white uncoated paper, around 100-120 gsm\n\nThe body copy i hope to set in three collumns\n\nformat - close to a regular a4\n\ni'll look forward to any well qualified bids on a serif body copy face (also used bigger for pull quotes)\n\n",
  "author": "zander",
  "time": "31 Jul 2002 — 2:45am",
  "uid": "1183",
  "comments": [
    {
      "time": "31 Jul 2002 — 8:55am",
      "content": "A slab serif (\"down to earth\"), preferably with some stroke contrast (to help readability, assuming it's more than a couple of paragraphs).   \n   \nhhp\n\n"
    },
    {
      "time": "31 Jul 2002 — 11:51am",
      "content": "A good idea, Hrant. Like [PMN Caecilia](http://web.archive.org/web/20150321232613/http:/www.myfonts.com/FontFamily3688.html) or   \n [Hunter](http://web.archive.org/web/20150321232613/http:/www.myfonts.com/FontFamily28416.html), LeFevre's redesign of Beton with italics.   \n   \nStephen\n\n"
    },
    {
      "time": "31 Jul 2002 — 5:41pm",
      "content": "I, too, think Hrant's idea might be a good one. But I was thinking something more like [Linoletter](http://web.archive.org/web/20150321232613/http:/www.myfonts.com/FontFamily4008.html) or [Egyptienne F](http://web.archive.org/web/20150321232613/http:/www.myfonts.com/FontFamily69.html) for magazine text. Worth a shot, I think.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "31 Jul 2002 — 7:25pm",
      "content": "Ah, a use for the infamous Linoletter!   \n   \nBTW, one of the few Egyptians that I like:   \n [http://www.myfonts.com/FontFamily18886.html](http://web.archive.org/web/20150321232613/http:/www.myfonts.com/FontFamily18886.html)   \n   \nBTBTW, I think another requirement for \"friendliness\" is a large x-height.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Aug 2002 — 4:23am",
      "content": "Yes, the 505 is nice too. Both the 505 and Linoletter are by André Gürtler (the latter with Reinhard Haus). The earlier Egyptienne F is Frutiger's.   \n   \nBTW, didn't _Eye_ recently pick up one of these Egyptians for its Reviews section? I don't have a copy here so I can't check which one.   \n   \nHrant, what's so \\*infamous\\* about Linoletter? Did I miss that episode of _60 Minutes_?   \n   \n-- K.\n\n"
    },
    {
      "time": "1 Aug 2002 — 7:54am",
      "content": "\\> what's so \\*infamous\\* about Linoletter?   \n   \nWell, actually I guess it's not famous enough to be \\*infamous\\*... But it's the type of design (hyper-rational eurocratic\\*) that gets a bad rap among today's oh-so-intuitively-talented \"artiste\"s; and the -admittedly rare- comments I've read about it were negative.   \n   \n\\* A Gurtler specialty. I don't like bureaucracy, but I actually don't think he was guilty of that - I personally love the guy. Unica rules. And the Egyptian505 numerals are what they need to be.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Aug 2002 — 12:38pm",
      "content": "hi kent funny you should mention it, it's the egyptienne f - by frutiger, that you mentioned, also they use it on uncoated, i noticed after you mentioned it as a possibility - and i actually think it will be my choice, maybe slightly larger than the tight 4 collumn grid they use for the review section\n\n"
    }
  ]
}
