{
  "id": "17512",
  "title": "Logo Critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi guys, i´m designig this logotype for some city related mechandising project, i´m trying to capture the mexican-colonial architectural style in this letterforms but keeping it bold... can you give some feedback... thank yo very much\n\n| Attachment | Size |\n| --- | --- |\n| [xalapa.png](http://web.archive.org/web/20150425030542/http:/typophile.com/files/xalapa.png) | 5.05 KB |\n\n",
  "author": "pablocheco",
  "time": "24 Jan 2006 — 4:53pm",
  "uid": "5022",
  "comments": [
    {
      "time": "24 Jan 2006 — 6:31pm",
      "content": "I rather like it! Is it modded from Rockwell or similar?\n\nPerhaps consider treating the X and L closer to the As and P, or only give one A that treatment and set it off - the A is where the relationship to architecture is most clear.\n\nAny good shots of Mexican colonial architecture to elaborate on this?\n\n"
    },
    {
      "time": "24 Jan 2006 — 7:05pm",
      "content": "thank you Pica... yes is modded from Rockwell since it´s bold enogh to communicate with... humm... boldness.. and adecuates to straight, heavy columns from colonial style. Sorry i dont have in my Pc those pictures from mexican architecture, i´ll post em tommorrow...\n\n"
    },
    {
      "time": "28 Jan 2006 — 4:02am",
      "content": "You could try a more rounded form of X (like the two Cs back to back script form) with the central 'serif' style applied. I find the angles and lightness of stroke jarring next to the other characters.  \nThe México line is a bit light/small for some uses and the Brodyesque É is out of character, you could try it without the vertical serifs.  \nTim\n\n"
    },
    {
      "time": "28 Jan 2006 — 6:17pm",
      "content": "Okey, sounds good.. im gonna try it and post some new versions, also the pictures... it´s been very rainy and cold these days... the vertical serifs are part of the character since i´d like to rescue to find the \"prehispanic feel\" as you can see in my avatar´s prehispanic head. Do you think they don´t function well??\n\n"
    },
    {
      "time": "29 Jan 2006 — 1:51am",
      "content": "To be clear, it was only on the É in México that I felt was out of character. The serifs on the top line that resemble the keystones of arches work well.  \nTim\n\n"
    }
  ]
}
