{
  "id": "1752",
  "title": "Royalties Based on Usage",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I decided to post this under the General Discussion forums rather the Release forums because I'm interested in hearing a wide range of opinions on this . . .   \n   \nLately it seems I've been getting a good amount of e-mail from customers asking if there is an additional royalty for using our fonts for: books, websites, posters, use on products.   \n   \nAre there that many foundries out there that have a license for every instance of font usage that they charge for? I'm familiar with embedding licenses, broadcast licenses, embedded devices, but I've never heard of restrictions on usage I would expect the font would be used for in general anyhow.   \n   \nIt's just an odd trend I've noticed and wondered if perhaps this is commom practice among other foundries or perhaps if this speaks to an upswing in customers awareness of aquiring appropriate licensing.   \n   \nI'd love to hear everyone's opinions on this . .   \n   \nStuart :D\n\n",
  "author": "Diner",
  "time": "Tue, 2003-10-21 14:34",
  "uid": "1226",
  "comments": [
    {
      "time": " Tue, 2003-10-21 14:39",
      "content": "For this to work, foundries would have to have an organization like ASCAP, which monitors broadcast performances for composers and publishers. They they could charge royalties like for song performances.   \n   \nThis would mean the 'ASCAP' like organization would check published works for fonts. Given the weak protection for type designs, at least in the US, this seems unlikely to ever happen.\n\n"
    },
    {
      "time": " Tue, 2003-10-21 14:43",
      "content": "Perhaps my post wasn't clear. . . I'm not proposing anything whatsoever. I'm making a query to determine if other foundries require these levels of additional licensing because I notice more of my customers coming to me to find out if additional licensing is required.   \n   \nStuart :D\n\n"
    },
    {
      "time": " Tue, 2003-10-21 23:10",
      "content": "Speaking of \"Art Buyers\", I had an interesting conversation yesterday with one from a Large Ad Agency. We were talking about the advantages of creating a custom font from scratch, rather than manipulating an existing design.   \n   \nThis person was very upfront about not knowing about font licensing. They were receptive to my suggestions, but that ol' budget problem came up. A bit of \"sticker shock\" but when I explained that if I manipulated the font, they would have to pay for that work, as well as the licensing for the font it was based on, and oh what a management nightmare that would be.   \n   \nWe will see.\n\n"
    },
    {
      "time": " Wed, 2003-10-22 08:11",
      "content": "There are a variety of different licensing agreements used in (stock) photography, and the fee will vary based on the kind of usage.   \n   \nThere is one kind of fee stipulation used by some stockco's, relating to using an image, unmodified, as the single image and \"reason to buy\", in instances such as a book cover, or on a mug. This is what may have given your customers the idea that if they use a typographic image, for instance a single character, as a primary graphic, this requires extra licensing.   \n   \nWith fonts, different foundries have slightly different licence arrangements, but it's all about restrictions, and not about graduated fees.   \n   \nI did have one customer ask me if it was OK to use a single, unmodified character from one of my typefaces (Morphica \"D\"), as a logo -- and then trademark it. Without consulting my lawyer, I said it was OK. In retrospect, probably not the right thing to say. I hope his client doesn't sue me for continuing to sell the font.\n\n"
    },
    {
      "time": " Wed, 2003-10-22 13:49",
      "content": "Stuart - offhand, I think Chank and House both require additional   \nlicensing for commercial usage. I'm guessing some others have seen this fine print   \nand have followed suit.   \n   \nbj\n\n"
    }
  ]
}
