{
  "id": "17525",
  "title": "Frutiger and similar typefaces in Bringhurst's classification system",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "In the type classif. system published by [Bringhurst](http://web.archive.org/web/20080103050531/http:/typophile.com/wiki/Robert%252BBringhurst) in _[Elements](http://web.archive.org/web/20080103050531/http:/typophile.com/wiki/elements_of_typographic_style)_ and his article in Serif #1, “ [Grotesque](http://web.archive.org/web/20080103050531/http:/typophile.com/wiki/Grotesque)” faces like [Helvetica](http://web.archive.org/web/20080103050531/http:/typophile.com/wiki/Helvetica), [Univers](http://web.archive.org/web/20080103050531/http:/typophile.com/wiki/Univers) and [Akzidenz](http://web.archive.org/web/20080103050531/http:/typophile.com/wiki/Akzidenz%252BGrotesque) fall under “Realist Roman”. It seems one of the characteristics of Realists is small aperture (don’t know if that’s the correct english term, sorry), but faces such [Frutiger](http://web.archive.org/web/20080103050531/http:/typophile.com/wiki/Frutiger) have a very large aperture, and while they are [monoline](http://web.archive.org/web/20080103050531/http:/typophile.com/wiki/monoline) [sans](http://web.archive.org/web/20080103050531/http:/typophile.com/wiki/sans%252Bserif) I feel they are different design concept than “grotesques”.\n\nI’d like to know how other people feel about this. Are Helvetica and Frutiger to be in the same “package” (as has been in other type classification systems) or does the latter need another “compartment”, along with other similarly open/legible/signage-oriented sans?\n\n [‹ Books about type](http://web.archive.org/web/20080103050531/http:/typophile.com/node/17530 \"Go to previous forum topic\") [Questions about the history of typographyquestions about the history of typographyquestions about the history of typographyquest ›](http://web.archive.org/web/20080103050531/http:/typophile.com/node/1989 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080103050531/http://typophile.com/user/5081\" title=\"View user profile.\">gabrielhl</a>",
  "time": "<br>",
  "uid": "5081",
  "comments": [
    {
      "time": " 25.Jan.2006 1.15pm",
      "content": "Stanley Hess, in his form-based classification system (The Modification of Letterforms, 1971), describes faces such as Frutiger as having “unfolded” curves — this is the opposite of having a small aperture, and is defined in relation to stroke shape, not the counter or negative space.\n\nBy his terminology, Futura and Gill Sans are in the same “unfolded” category as Frutiger.\n\nAnd yet, the unfoldedness in Frutiger seems more to do with having a compact letter form, and this design rationale continues in the Meta genre of semi-condensed, 4-letter name, sans serifs.\n\nSo I think that we/Robert Bringhurst need a new “crossover” term to describe this contemporary type genre.\n\nAs Bringhurst’s method is to ally type genres with dominant art-historical movements of the type’s era, “Post-modernist” would seem to be the obvious choice. The main problem with that is we tend to think of grunge and deconstructed typefaces as being the quintessentially Post-modern forms.\n\nWill the true PoMo please step forward?!\n\n"
    },
    {
      "time": " 25.Jan.2006 2.13pm",
      "content": "In Germany, Frutiger is referred to as a “humanist” sans serif. Gill Sans probably falls into that category, too, but Futura would be a geometric sans. And Helvetica, Akzidenz and co. are “Grotesks” (i.e., “realist” the sans serifs that Bringhurt writes about).\n\n"
    },
    {
      "time": " 25.Jan.2006 2.13pm",
      "content": "In Germany, Frutiger is referred to as a “humanist” sans serif. Gill Sans probably falls into that category, too, but Futura would be a geometric sans. And Helvetica, Akzidenz and co. are “Grotesks” (i.e., “realist” the sans serifs that Bringhurt writes about).\n\n"
    },
    {
      "time": " 25.Jan.2006 2.14pm",
      "content": "\\>we tend to think of grunge and deconstructed typefaces as being the quintessentially Post-modern forms.\n\nare you likening the grunge/deconstructed forms with postmodernism because of the “found” aesthetic?\n\nis that the concensus regarding these types of (grunge)faces? because in the  \nE. of T.S., Bringhurst’s example of a postmodern face looks more like the type of letter that exists in the AIGA mark, or in HTF’s Mercury. how do you suppose Bringhurst would categorize “grunge” ?\n\ni agree that “postmodern” is becoming a little too nebulous at this point…\n\n——————-  \nnc\n\n"
    },
    {
      "time": " 25.Jan.2006 2.26pm",
      "content": "wouldn’t the “humanist” classification still fall under postmodern?\n\n—————————  \nnc\n\n"
    },
    {
      "time": " 25.Jan.2006 2.35pm",
      "content": "Neo-Humanism is, perfectly sensibly, classified in Bringhurst as a variety of Modernism. Frutiger reduces humanist models to a constructionism which is appealing and clear but not chirographic: it is humane rather than humanist.\n\n"
    },
    {
      "time": " 25.Jan.2006 4.18pm",
      "content": "Nick, I hadn’t checked EofTS for Bringhurst’s idea of PostModern recently.  \nSo yes, he’s matching a contemporary type genre to the obvious main art-theory movement.  \nNot a good fit for the faces he chooses, which just seem to be synthetically traditional.\n\nA more thorough theoretical understanding of Post-modernism is well established in typography, in relation to fonts like Dead History, Caustic Biomorph, and Carter’s Walker typeface. So it would be hard to categorize types as prosaic as Frutiger as Postmodern.\n\n"
    },
    {
      "time": " 25.Jan.2006 5.45pm",
      "content": "interesting… thanks for the insight, Nick.\n\n————-  \nnc\n\n"
    }
  ]
}
