{
  "id": "17538",
  "title": "All you clever people, a little help please",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello gang...Looking forward to getting my feet wet here.\n\nIt’s a sunny morning in East London and finding this site is almost magiK, the font manipulated threads are great.\n\nI’m dabling in the world of ’type’n’logos’, slowly moving from hand drawn predominantley graff letterforms into the world graphic type. I NEED TO KNOW what software you kind peoples use to edit and mess with the alphabet. I’ve essentially been scanning in my hand-styles and tweeking them in Photoshop, but it’s a long and messy process.\n\nWould you kindly illuminate my foggy brainstem please, I’ve had a look at some of the design threads and confused myself immediately?\n\nI’m not interested in creating entire font sets, merely creating letters shapes accurately.\n\nI’m guessing Illustrator may do the trick partially?\n\nMany thanks\n\nP\n\n[www.55designs.co.uk](http://web.archive.org/web/20071118040616/http:/www.55designs.co.uk/ \"www.55designs.co.uk\")\n\n [‹ [link]: I thought you typophiles would be interested](http://web.archive.org/web/20071118040616/http:/typophile.com/node/17594 \"Go to previous forum topic\") [Variation of stress between characters in Caslon ›](http://web.archive.org/web/20071118040616/http:/typophile.com/node/16884 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071118040616/http://typophile.com/user/11176\" title=\"View user profile.\">MekOne</a>",
  "time": "<br>",
  "uid": "11176",
  "comments": [
    {
      "time": " 26.Jan.2006 2.43am",
      "content": "Any vector-based program (Illustrator, Freehand, CorelDraw) should do the trick. Probably even Flash...\n\n"
    },
    {
      "time": " 26.Jan.2006 2.50am",
      "content": "Thanks Gabriel,\n\nReading about OpenType? scared me, and talk of glyphs flung me to the ground. I’m used to creating letters in a sketchpad and when I started flicking through some of the threads on here I realised I know nothing of the technical aspects of creating letters.\n\nI have Flash and Illustrator so that’s a start - Could you give me a route to follow in terms of altering an existing letter. Would I use the type text tool in illustrator, break the letter into a path and then tweak the path, for instance?\n\nThanks again\n\nP\n\n"
    },
    {
      "time": " 26.Jan.2006 3.11am",
      "content": "...Scrap this, I just read:\n\n[http://typophile.com/node/8051](http://web.archive.org/web/20071118040616/http:/typophile.com/node/8051 \"http://typophile.com/node/8051\")\n\nIt seems to explain everything I need for the moment.\n\nThanks again, sorry for the needless thread.\n\nP\n\n"
    },
    {
      "time": " 26.Jan.2006 3.34am",
      "content": "Actually that thread might mislead you, depending on what you want to do.\n\nIf you’re not looking to produce working a working [font](http://web.archive.org/web/20071118040616/http:/typophile.com/wiki/font), but rather just creating “digital lettering”, there’s no real need to spend $500 on Fontlab. Although its tools might be more adapted to typeface design, it seems to me your work stands between text and illustration, so Illustrator should do fine, in fact it gives more possibilities with color, etc.\n\nAs to how to do it in Illustrator, you should type the text, convert it to outlines and then mess with it. If you don’t already, learn how to draw using bezier curves.\n\nThat’s how I do it, and I figure most people use the same technique for the type battle stuff.\n\n"
    },
    {
      "time": " 26.Jan.2006 3.58am",
      "content": "[http://www.fontlab.com/Font-tools/TypeTool/](http://web.archive.org/web/20071118040616/http:/www.fontlab.com/Font-tools/TypeTool/ \"http://www.fontlab.com/Font-tools/TypeTool/\")\n\nIllustrator will do the trick, but if you want to move on from there to create a font TypeTool is the cheapest of that type of product from Fontlab. There are free resources, for example\n\n[http://fontforge.sourceforge.net/](http://web.archive.org/web/20071118040616/http:/fontforge.sourceforge.net/ \"http://fontforge.sourceforge.net/\")\n\nIt’s sunny in South London too.  \nTim\n\n"
    },
    {
      "time": " 26.Jan.2006 4.59am",
      "content": "Gabriel, sounds like Illustrator will be perfect, your synopsis is pretty accurate. Just reading up on Bezier curve tutorials as we speak - all sounds graspable...I’ve used illustrator to trace hand drawn stuff in the past, but have always gone about it in a really thuggish manner so this looks perfect...\n\nThanks for the responses both of you, enjoy the sun Tim, it’s suddenly got really overcast up here.\n\nMany thanks,\n\nP\n\n"
    },
    {
      "time": " 26.Jan.2006 8.56am",
      "content": "Peter,\n\nGiven that you are doing hand work, and may or may not end up making type, consider this: Illustrator and the like have autotracing features. Try scanning your finished artwork at huge resolution and autotracing it. From that you can see how much accuracy the autotrace will give (adjust the preferences), and then from there make small adjustments to the outlines by tweaking. That way you will have real projects to learn the bezier tools with. If you want to move away from autotracing in the future, you can do that organically. There might be pieces you scan and then draw bezier outlines over by hand, like if the art is very regular or simple and sleek. Meanwhile you can get more of your lettering in digital format so you can color it, move it around, etc. etc.\n\nOne way beziers might be useful to you is if you draw them with the pencil tool in illustrator. It makes the outline for you, which you can then touch up. Using the stroke feature with such outlines, then “outline storke” could take you places.\n\nYour work blends lettering, painting, decoration, and is very lively and energetic. if you learn to draw with beziers, I hope you will keep the energy and freshness your hand-lettering and sketches have. Nice work!\n\n"
    },
    {
      "time": " 27.Jan.2006 2.42am",
      "content": "Thanks alot CG...kind and useful words there. I’ll definately play with the autotrace feature, although I traced a graff letter logo yesterday, learning beziers as I went and was really pleased with the result. The letters maintained and even gained a certain energy. I really had to concentrate on placement of anchors to keep the curves natural, and stylised but overall, being able to tweek the widths of stems and slashed within the design just made everything look better!\n\nThanks for the advice in this thread peoples...I wasn’t sure I was flailing around using inefficient tools to acomplish something that could’ve been done a lot more easily with some other technique.\n\nMany thanks...today, in East London, it’s cloudy btw....\n\n"
    },
    {
      "time": " 27.Jan.2006 9.41am",
      "content": "The nice thing is that beziers are useful for any kind of art, and they’re also ideal for drawing letters.... Add the functions of a type drawing program and you’ve started to design type. If you’ve spent a lot of time drawing or writing letters then you have a head start. Lots of type designers work on shapes in Illustrator and then move them to FOG or FL. I tend to leave Illustrator for times when I just want a single piece of art.\n\nI just remembered a useful technique you might like: draw a little circle with the circle tool in illustrator, the exact width of your typical outline, stem width, or other repeated feature. Use it as a caliper or gauge for lines you want the same width. It works no matter what angle the lines are, since it’s a circle.\n\nIt’s cloudy in San Francisco as well.\n\n"
    },
    {
      "time": " 27.Jan.2006 4.42pm",
      "content": "...excellent tip. I’ve always approached letters from a hand drawn point of view, but sometimes I forget that there are geometric rules that govern the flow of a piece. Looking at my favourite outlines again with this in mind I find obvious relationships between the size of stem widths, flicks and flares and so on, and although I’ve unconsciously rendered these as I’ve drawn, they definately define the fluidity of the piece in the end.\n\nI guess drawing with a constant reference such as a fixed number of circular guides, or at least tweeking my hand drawn stuff with these tools will hopefully improve the overall flow drastically.\n\nThanks again. It’s now dark, and cold.\n\n"
    }
  ]
}
