{
  "id": "17548",
  "title": "Celerus Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi All-Of-U!\n\nFirst let me introduce myself. I'm a designer from hungary (Central-eastern Europe).  \nI am working on a logotype (more type less logo :) for a consulting company. They are selling a portal engine named \"Celerus\". The Corporate font for all the printed stuff is Rotis Semi-serif, so I must use it also in this case.\n\nI designed a few special characters for this project instead of using the originals.  \nThis is an early stage of design (the \"n\" is still without serif)  \nPlease if U grlz&guys got time, take a look at my work!  \nMudan\n\n ![](http://web.archive.org/web/20131020195314im_/http:/typophile.com/files/Celerus.jpg)\n\n",
  "author": "Mudan",
  "time": "26 Jan 2006 — 6:45am",
  "uid": "11177",
  "comments": [
    {
      "time": "26 Jan 2006 — 6:46am",
      "content": "Sorry for the mess because of the large image and also because of my bad english :) !!!\n\n"
    },
    {
      "time": "26 Jan 2006 — 7:49am",
      "content": "While I'm not clear why you have to use the corporate font to create the logo your present special characters do relieve some of the predictability of Rotis, however the L and R look a little light, especially with the Es, an answer to that might be to work on the serifs of the E, especially on the crossbar. You have kerning issues throughout, but must finish the character development before you can adjust them.  \nTim\n\n"
    },
    {
      "time": "26 Jan 2006 — 8:22am",
      "content": "Dear Tim!\n\nThanx for the comment.  \nI have to use Rotis because the company sells different softwares, and in all of the different products they use Rotis. I also think it fits to the product so I'm not gonna change it.\n\n"
    },
    {
      "time": "26 Jan 2006 — 8:36am",
      "content": "What Tim is saying makes sense. If all of the packaging using Rotis it might be more interesting to use a different typeface which contrastst with the it. If anything, Rotis is a display font. For me anyway. I think the fact that you did draw some unique letters helps. If you would have used the type out of the can it wouldn't be enough to differentiate it.\n\nThe N seems a little naked compared to the other characters that all have at least one semi-serif.\n\n"
    },
    {
      "time": "26 Jan 2006 — 8:56am",
      "content": "Miss Tiffany!\n\nI agree, \"n\" is naked. That is a mistake. I'm working on it right now. I have to modify a bit. In this phase there is no place for a serif. I have to check the lower case for an example.\n\nWhat about an \"E\" like this? It is a bit lighter... It differentiate the logo more, but still Rotis. (I'm not allowed to change the basic type)\n\n ![](http://web.archive.org/web/20131020195314im_/http:/typophile.com/files/Celerus02.png)\n\n"
    },
    {
      "time": "26 Jan 2006 — 8:57am",
      "content": "Yes. Those serifs weren't really needed.\n\n"
    },
    {
      "time": "26 Jan 2006 — 8:58am",
      "content": "I know it has kerning problems, but in this phase nevermind...:)\n\n"
    },
    {
      "time": "28 Jan 2006 — 9:54am",
      "content": "Nice, good work.\n\n"
    },
    {
      "time": "22 Feb 2006 — 12:15pm",
      "content": "About 3 weeks ago when this first posted I thought I would try to help out with a few letter tweaks, I wish I had posted earlier but I had wanted to finesse them a bit. Well I have just been too busy to pursue this so it was parked. If this is still of interest and perhaps any help here was the work (in progress).\n\n ![](http://web.archive.org/web/20131020195314im_/http:/typophile.com/files/Cerelus-Typework.jpg)\n\n"
    }
  ]
}
