{
  "id": "17571",
  "title": "Verdigris",
  "forum": "Design",
  "tags": [

  ],
  "content": "What is the \"word on the street\" about Verdigris? I am specifically interested in feedback on the font, but also interested in people's thoughts on the best font for poetry?\n\n",
  "author": "<a href=\"/web/20101226034627/http://typophile.com/user/11147\" title=\"View user profile.\">baronius</a>",
  "time": "<br>",
  "uid": "11147",
  "comments": [
    {
      "time": "",
      "content": "I've used Verdigris for various projects and never been disappointed. It's a wonderful workhorse serif. Neither too old or too modern, nor too eccentric or too boring, the right fit for almost any project. The only (small) drawback is its lack of bold and italic small caps.\n\n[Verdigris at MVB Fonts](http://web.archive.org/web/20101226034627/http:/mvbfonts.com/html/fonts/verdigris/pk_verdigris.htm)  \n [Verdigris at FontShop](http://web.archive.org/web/20101226034627/http:/www.fontshop.com/showfont.cfm?fid=MVB.118650.0.0)\n\n"
    },
    {
      "time": "",
      "content": "Thanks for your feedback! It is a very attractive font, I especially like the feel of the bold italic.\n\n"
    },
    {
      "time": "",
      "content": "I'm not sure about Verdigris for poetry - it's designed for small sizes, and all the best poetry should be set fairly large to slow down reading. Small x-height, small counters and substantial interest and delicacy in the details are the things to look for. It's a pity Lutetia with the Porter-Garnett e isn't available, but you could try lengthening the extenders on Spectrum (a very quick job).\n\n"
    },
    {
      "time": "",
      "content": "I'm not sure why poetry needs to be set in large type. Help me understand.\n\n"
    },
    {
      "time": "",
      "content": "I don't get the large type and poetry thing either. The only thing I notice about poetry is designers tend to allow a lot of white space around the poem to create focus on the stanzas.\n\n"
    },
    {
      "time": "",
      "content": "The easiest way to help a reader slow down from the pace suited to most reading is to enlarge the type, because more fixations are needed to cover the greater area.\n\n"
    }
  ]
}
