{
  "id": "17572",
  "title": "New Princeton Theological Seminary Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "So, recently my school, Princeton Theological Seminary, changed its logo. I’m curious to see what you all think about the change. I’m not the designer, and I don’t know him or her personally.\n\nI’m curious about a few things:\n\n1. What do you think the change is trying to communicate/emphasize?  \n2. What do you think the new logo says? What impression does it give you of our institution?\n\nSadly, I’ve not yet discovered how to imbed images into typophile threads, so bear with me as you click on the images, cleverly named “oldlogo” and “newlogo.”\n\nI love reading your critiques and opinions. Have at it…\n\nTraci\n\nPS For information on Princeton Seminary and how it is or is not consistent with the logo, check out [http://www.ptsem.edu/About/](http://web.archive.org/web/20060522220537/http:/www.ptsem.edu/About/)\n\n| Attachment | Size |\n| --- | --- |\n| [oldlogo.gif](http://web.archive.org/web/20060522220537/http:/typophile.com/files/oldlogo.gif) | 3.78 KB |\n| [newlogo.JPG](http://web.archive.org/web/20060522220537/http:/typophile.com/files/newlogo.JPG) | 14.39 KB |\n\n",
  "author": "<a href=\"user/9629\" title=\"View user profile.\">sohappy2</a>",
  "time": "<br>",
  "uid": "9629",
  "comments": [
    {
      "time": " 27 January, 2006 - 6:10am",
      "content": "I like the new logo better. It makes the focus on the Mark first, then the word Princeton, and then third the words Theological Seminar. The only thing I’m not in love with is the Letterspacing in Princeton. Its an over used trend.\n\n"
    },
    {
      "time": " 28 January, 2006 - 4:37am",
      "content": "I looked at your website link and the use of the logo seems very small. It also appears to have a drop shadow, which I would definitely lose, it doesn’t contribute anything, in fact given the size of the logo means that the deep red colour is darker than that of the text. The vertical line, dividing the mark and the text, is too tight to the mark, especially given the tracking you have applied to the text.  \nIt is an improvement over the old logo, the mark is much better and the type seems more appropriate.  \nTim\n\n"
    },
    {
      "time": " 4 February, 2006 - 12:56pm",
      "content": "the new mark is a big step in a positive direction. I agree that the excessive letter spacing will date this wordmark. But the type selection is far more appropriate than the earlier version. It feels more human.\n\n"
    }
  ]
}
