{
  "id": "17588",
  "title": "Printing issues with DTL fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I just purchased DTL Unico. It was a significant investment.\n\nHowever, I am getting discouraged because I can’t seem to print the font, or make a PDF for that matter.\n\nI buy fonts frequently, and have never had a problem before. Is there something I am not doing? Has anyone else had this happen to them?\n\n [‹ 17th century English print culture](http://web.archive.org/web/20071009130902/http:/typophile.com/node/17597 \"Go to previous forum topic\") [New Type Classification -- Crunchy! ›](http://web.archive.org/web/20071009130902/http:/typophile.com/node/17587 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071009130902/http://typophile.com/user/2941\" title=\"View user profile.\">mantz</a>",
  "time": "<br>",
  "uid": "2941",
  "comments": [
    {
      "time": " 28.Jan.2006 12.01am",
      "content": "E-mail Frank Blokland (he owns DTL) about the problem.  \n [info@dtl.nl](mailto:info@dtl.nl)\n\n"
    },
    {
      "time": " 28.Jan.2006 6.50am",
      "content": "I have, and am waiting on a response.\n\n"
    },
    {
      "time": " 28.Jan.2006 9.01am",
      "content": "For 1,215 Euro, their support should be fabulous. Is this the open type version?\n\n"
    },
    {
      "time": " 28.Jan.2006 9.19am",
      "content": "It’s the PS1 version. And I have only bought the roman at this time (125 Euro) as I was intending to try it, and then buy the other weights I need after testing. However, even 125 euro for a single weight is a large investment considering the excellent full families I can get at that price.\n\nI already had to email them after my purchase when I didn’t receive a link for a download page 6 hours after buying the font. Now I can’t use the font, so I am a feeling a little aggravated with my purchase. However, to DTL’s credit, it looks beautiful on screen and sets easily.\n\n"
    },
    {
      "time": " 28.Jan.2006 1.30pm",
      "content": "I have been troubleshooting the issue and have discovered the following:\n\n- The font prints from Illustartor CS and QuarkXPress\n- The font does not print from Suitcase, Font Book, Word or OmniGraffle\n\nI have no idea what that means, however...\n\n"
    }
  ]
}
