{
  "id": "17629",
  "title": "Hidden swastica en logo",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "This is my first post in Typophile, so please be gentle :)  \nI recently developed a logo for a non-profit organization. The symbol involves 4 houses placed in a symetrical fashion and tilted at 45 degrees. It has been brought to my attention that the negative space in the middle resembles a swastica (now its all I see). Obviously this wasn't intentional but the question remains. Is it acceptable or should I tell the client to choose one of the other alternatives?\n\n ![](http://web.archive.org/web/20120507030926im_/http:/typophile.com/files/cit_logo.jpg)\n\n",
  "author": "Patricio",
  "time": "30 Jan 2006 — 11:41am",
  "uid": "11026",
  "comments": [
    {
      "time": "30 Jan 2006 — 12:17pm",
      "content": "At least it reminded me RNE [symbolic](http://web.archive.org/web/20120507030926/http:/www.rne.org/emb.shtml) very much.\n\nTake a look what [Google](http://web.archive.org/web/20120507030926/http:/www.google.com/search?q=RNE+russian&hl=en&hs=yXe&lr=&safe=off&client=opera&rls=en&start=10&sa=N) says about them.\n\n"
    },
    {
      "time": "30 Jan 2006 — 1:16pm",
      "content": "I would do a quick survey of disinterested people...\n\nAs a designer working at an organization where the logo (made up of a cross and a dove) repeatedly reminds people of the state of Texas, you want to be very careful with implied meaning.\n\nI could immediately see the negative, literally as well as figurative, symbol.\n\n"
    },
    {
      "time": "30 Jan 2006 — 2:20pm",
      "content": "I definitely see a swastika in the negative space of your mark. I think the most professional way to deal with this would be to recommend to your client that they choose a different mark. And if I were you, I would actually develop one more option for your client to choose from. That way, you're not forcing your client to choose from a smaller batch of choices. You don't want your logo to even remotely resemble a swastika.\n\n"
    },
    {
      "time": "30 Jan 2006 — 3:02pm",
      "content": "Do you know what the swastika was based on? Its a sun symbol. You will see it in middle American symbols. Its been used for centuries before the Natzis\n\n"
    },
    {
      "time": "30 Jan 2006 — 3:21pm",
      "content": "Thanks for the feedback people, all greatly appreciated. Looks like I'll have to sort out more options for the client.\n\nDan,  \nYes, I have read about the swastica. Actually there's an interesting book (if you haven't already read it) regarding its symbolic meaning in western culture after WW2. The book is by Steven Heller, \"The Swastika: Symbol Beyond Redemption?\"\n\n"
    },
    {
      "time": "30 Jan 2006 — 6:12pm",
      "content": "Move the doors on the houses off centre to the left side of each house or use two windows instead of a door.\n\nChrisL\n\n"
    },
    {
      "time": "30 Jan 2006 — 7:46pm",
      "content": "Even if you eliminate the doors, there's still the big thin swastika in the remaining space. Best to start over from scratch.\n\nFact is, anything with fourfold rotational symmetry is going to remind people of a swastika; that's how sensitive people are to it. For a non-profit organization, it's especially hazardous. Legends will spring up about how the organization is secretly run by white supremacists. Don't think that maybe they won't, because they will.\n\n"
    },
    {
      "time": "31 Jan 2006 — 1:37am",
      "content": "I've even had problems with threefold triskelion-like symmetry in that respect. Of course, the audience was 9th-graders, but still.\n\n--Jim K\n\n"
    },
    {
      "time": "31 Jan 2006 — 5:34am",
      "content": "You should note that the 45% rotation gives instability as well as dynamism to the design, especially as they are houses, which one expects to sit stablely on the ground. Hitler rotated the traditionally horizontal-vertical swastika's orientation by 45% to give it an agressive dynamism. Including the dimension of gravity in your re-design might help you in divising a new version.\n\n"
    },
    {
      "time": "31 Jan 2006 — 9:23am",
      "content": "I think you need to redesign the logo. Yes the swastika is an ancient and meaningful symbol in a huge variety of cultures but the fact is it is way too loaded in the here and now to want your business associated with it.\n\nA friend of mine showed me a logo for a muslim company where the negative space made a cross - they changed it.\n\nFedEx most memorably has the negative space arrow in its logo.\n\nYou really need to be careful with this kind of thing, and especially for a nonprofit (not knowing what kind of business) to risk offense, bad idea.\n\n"
    },
    {
      "time": "31 Jan 2006 — 9:27am",
      "content": "Anybody checked out the Sun Microsystems logo? I think it manages to avoid the swastika implications unless you're looking for it. That said, I did think of it in terms of this conversation...\n\n[http://www.sun.com/](http://web.archive.org/web/20120507030926/http:/www.sun.com/ \"http://www.sun.com/\")\n\n"
    },
    {
      "time": "31 Jan 2006 — 1:52pm",
      "content": "it's too big of a deal; you should change it.\n\n--------  \nnc\n\n"
    },
    {
      "time": "31 Jan 2006 — 4:42pm",
      "content": "I can read a cycle. Thought avoinding the suggestion you have made, and that people whould find in it, the logo also suggests a real estate company, for instance, therefore profitable...  \nBesides the swastika, the other suggestions are also as dangerous, so yes, I believe you should sketch again ;)\n\n"
    },
    {
      "time": "1 Feb 2006 — 7:24am",
      "content": "There are some things that you may dearly want people to open their minds to. For me, the inescapable cause is blackletter. That's pretty innocuous... the worst accusations I have to deal with are illegibility and the occasional Nazi reference (easily deflated when you show them the Bormann letter.)\n\nOthers will get you labeled as a crackpot for the rest of your Internet-archived life. Redeeming and \"decontextualizing\" (heh) the swastika in the West is certainly one of them. I suppose there are probably [worse ones](http://web.archive.org/web/20120507030926/http:/skepdic.com/urine.html) than that. Please, please, pick your battles carefully.\n\n"
    },
    {
      "time": "1 Feb 2006 — 5:19pm",
      "content": "I didn't see a swastika until you pointed it out... It might help to modulate the lines between the houses. Because they're an even negative stroke it accentuates it.\n\nThe bottom line though, is that if you salvage this mark, it's only merely okay. And you don't want them to go with a mark that is merely okay anyway. Best of luck with it.\n\nPost the rest of your solutions, then we'll help you pick the right one. =)\n\n"
    },
    {
      "time": "3 Feb 2006 — 2:42pm",
      "content": "People can find swastikas in ANYTHING:\n\n[http://citypages.com/databank/26/1276/article13291.asp](http://web.archive.org/web/20120507030926/http:/citypages.com/databank/26/1276/article13291.asp \"http://citypages.com/databank/26/1276/article13291.asp\")\n\n"
    },
    {
      "time": "4 Feb 2006 — 11:02am",
      "content": "I work as an graphic designer at a company that designs/builds museum exhibits. I recently had a client bring a project to a screeching halt when it was suggested to them that the floor plan of their space approximated the shape of a swastika. To be clear, the \"swastika\" would be totally imperceptable to anyone not looking at the engineering drawings. Everything was revamped to avoid even an imperceptable, unresonable and unitended association with an \"evil\" symbol.  \nSymbolism is strong. I think it would be in your best interest to rework the mark and avoid the whole scenario.\n\n"
    },
    {
      "time": "10 Feb 2006 — 3:18pm",
      "content": "sun microsystems' logo isn't even a hidden swastika. it's totally a swastika. avg's is more hidden. a very negative symbol to continue using. i agree with the 'avoid' programme.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \noh yes.\n\n"
    },
    {
      "time": "10 Feb 2006 — 3:27pm",
      "content": "I think it's borderline. I would keep it if the company  \nit represents doesn't have some other unfortunate issue,  \nlike a board member who's father was KKK or something.\n\n\\> FedEx most memorably has the negative space arrow in its logo.\n\nOnly to [some] graphic designers.  \nTo the people who matter (users) it's simply not there.\n\nHeller: always take with a truck-load of salt.\n\nhhp\n\n"
    },
    {
      "time": "10 Feb 2006 — 3:51pm",
      "content": "i see two swasticas: one thick, one thin.\n\nif this mark had already been approved and in use, perhaps you'd have to weigh the pluses and minuses of continuing to use the form. but it's not, and you are not limited to one thing that can be potentially detrimental to the success of the organization. in your clients best interest, you should go in a different direction.\n\nbesides, it might end up being better than 4 houses arranged in a circle!  \n; )\n\n----------  \nnc\n\n"
    },
    {
      "time": "19 Jan 2008 — 6:57pm",
      "content": "I think you should consider revising the design.  \nYou don't want any mixed messages with a logo.  \nLet the client make the ultimate decision... But point out the issue if they don't see it right away.  \nThe symbol has changed meanings over time, but you don't know how people will feel when seeing it.  \n- Don't risk a negative response.  \nS.Bey\n\n"
    },
    {
      "time": "31 Jan 2008 — 3:16am",
      "content": "This is old topic but that logo reminds me about this one:\n\n[http://en.wikipedia.org/wiki/Tursaansyd%C3%A4n](http://web.archive.org/web/20120507030926/http:/en.wikipedia.org/wiki/Tursaansyd%C3%A4n \"http://en.wikipedia.org/wiki/Tursaansyd%C3%A4n\")\n\n"
    },
    {
      "time": "31 Jan 2008 — 6:44am",
      "content": "[http://www.columbia.com/](http://web.archive.org/web/20120507030926/http:/www.columbia.com/ \"http://www.columbia.com/\")\n\njust noticed this one.\n\n"
    },
    {
      "time": "1 Feb 2008 — 12:13pm",
      "content": "they're all over the place. if in doubt, change it.\n\n ![](http://web.archive.org/web/20120507030926im_/http:/typophile.com/files/ChaseLogo_4071.png)\n\n"
    },
    {
      "time": "21 Aug 2008 — 10:09pm",
      "content": "everyone else does it, you wanna fit in right?\n\n ![](http://web.archive.org/web/20120507030926im_/http:/typophile.com/files/windows-logo-readerszone_3964.jpg)\n\n"
    }
  ]
}
