{
  "id": "17637",
  "title": "Preparing business cards for print",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi everyone,\n\nI am hoping to get some business cards printed for my first job (non-profit). And when I went to a printers web site I saw their requirments for printing, and I’m a little lost.\n\nThey ask that the file be PDF, and have bleed and trim marks. I know how to do all that, but I am lost as to how you set it up for a printer. For example, how big do I make the page inorder for them to see the bleed? So if my bleed is 3mm, and my card is 90mm x 55mm, then does that mean I make the page 93mm x 58mm? IS that how it works? And I assume the trim line is just be a box marking the trim with a .25pt line thickness.\n\nSorry if these questions are really stupid and sound very noobie, but I want to get it right.\n\nThank You\n\n",
  "author": "<a href=\"/web/20090914152543/http://www.typophile.com/user/9184\" title=\"View user profile.\">3dsnail</a>",
  "time": "<br>",
  "uid": "9184",
  "comments": [
    {
      "time": " 30.Jan.2006 8.40pm",
      "content": "Your assumptions are correct about the bleeds and the trim. Pretty simple stuff. If the shop is halfway decent they’ll let you know if they have any problems with the file.\n\n"
    },
    {
      "time": " 30.Jan.2006 10.37pm",
      "content": "It is probably best to use InDesign, where you can set the document size (trim), margins (live area) and bleed in the “Document Setup.” CS 2 will also allow you to export a press-ready PDF/X-1A with the appropriate color profile embedded.\n\nBut whichever app you set-up your file in, do not put a box around your trim. It will be extremely difficult for your printer to cut directly on a .25pt line&nbsp;– that’s what a bleed is for – an area for the printer to safely cut within.\n\nThere is a great deal to know about making files press-ready. [The Standard](http://web.archive.org/web/20090914152543/http:/www.sappi.com/NR/rdonlyres/58071E52-0EB0-4F34-886F-6CB1CC85FE0F/0/TheStandard1_Prepress.pdf), which is published by Sappi, is a great place to start. Sappi also has more advanced informational brochures available [here](http://web.archive.org/web/20090914152543/http:/www.sappi.com/SappiWeb/Knowledge%20bank/Technical%20brochures/).\n\n"
    },
    {
      "time": " 31.Jan.2006 3.19am",
      "content": "In InDesign CS2, clicking “More Options” in the Document Setup screen will show you a specific option for Bleed size. This is useful because if you export a PDF and check “Crop Marks” and other printer’s marks, ID will automatically add proper marks for that document size and leave the bleeded color/images.\n\n"
    },
    {
      "time": " 31.Jan.2006 8.24am",
      "content": "You can setup a bleed area in Illustrator as well. I have a default PDF export setting which works in Indy and Illy which I use to include crop, trim and bleed marks. I’d also suggest once you create your PDF to test print the separations to a laser printer to make sure your colors separate correctly and that extra plates don’t output.\n\n"
    },
    {
      "time": " 31.Jan.2006 8.47am",
      "content": "Just to note that ’page size’ in the context you use it doesn’t matter; the printers will arrange many copies of your artwork on whatever size sheet their press uses (“imposition”) and then cut down to the finished size using the cropmarks.\n\nFor a regular, rectangular piece, make the page size the same as your finished item.\n\n"
    },
    {
      "time": " 31.Jan.2006 8.52am",
      "content": "This is my process:\n\nI’ve found that different print shops do different things. Some will print 2-up, some 4-up and some more depending on the situation. If I don’t know the exact setup, I almost always set my Illustrator artboard to 11” x 8 1/2” and let the printer set up the artwork for the press (assuming the printer is well established and knows its stuff).\n\nThen I create a rectangle 3 1/2” x 2” (for a standard card) with no fill and a 0.25pt stroke in black. I’ll be deleting this outline before I send it to the printer, but for now I use it as a guide of the card edges.\n\nThen I copy this rectangle and expand its dimensions by 1/4” (or 1/8” on each side). I remove the stroke on this rectangle and give it a light grey fill. I’ll be deleting this rectangle as well, but for now I use it as a guide of the bleed. Keep in mind, if you aren’t printing a bleed, you can skip this step.\n\nTo create the trim marks, I select the original 3 1/2” x 2” rectangle and go Filter \\> Create \\> Crop Marks. This will produce you trim marks in a registration colour (so that it will print on all plates). I usually add registration marks (targets) as well, but most printers can add this for you.\n\nNow, using the guides described above, I layout the front of my card. Then, I repeat the steps for the back of the card and set the 2 side-bide side (with some breathing room) on my 11” x 8 1/2” artboard.\n\nAs a final step, I remove the 2 guide rectangles so that all I’m left with is my artwork and the trim marks. Also, I always use the Document Info window in Illustrator to do a final check on the artwork before producing a PDF and test print.\n\nHope that helps.\n\n"
    }
  ]
}
