{
  "id": "17631",
  "title": "Great British Design Quest",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20110316083214im_/http:/typophile.com/files/conc_si.jpg)\n\nvs\n\n ![](http://web.archive.org/web/20110316083214im_/http:/typophile.com/files/mc_si1.jpg)\n\nVerdana has been nominated in this competition organized by London's Design Museum.\n\n[http://www.designmuseum.org/digital/index.php?id=11&pt=1](http://web.archive.org/web/20110316083214/http:/www.designmuseum.org/digital/index.php?id=11&pt=1 \"http://www.designmuseum.org/digital/index.php?id=11&pt=1\")\n\nOn Sunday I visited two of the other nominees at Seattle's excellent Museum of Flight - I think Verdana has the edge over both Concorde and the Spitfire - but we shall see.\n\nHere's the voting page - [http://www.bbc.co.uk/arts/cultureshow/designquest/vote/](http://web.archive.org/web/20110316083214/http:/www.bbc.co.uk/arts/cultureshow/designquest/vote/ \"http://www.bbc.co.uk/arts/cultureshow/designquest/vote/\")\n\nAlthough I'm not sure if the typeface will win, it's great that type design has been recognized by the organizers. The British motorway signage system has also been nominated.\n\nCheers, Si\n\n",
  "author": "<a href=\"/web/20110316083214/http://typophile.com/user/1049\" title=\"View user profile.\">Sii Daniels</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": "",
      "content": "It's great to see type design getting such props, but Verdana isn't particularly British, it's international, designed for Microsoft by an expat.\n\nI'd vote for The Face, but not 1981; 1984 was the year Neville Brody developed [\"Industria\"](http://web.archive.org/web/20110316083214/http:/www.shinntype.com/Assets/Depts/Essays/Industri.pdf) in its pages.\n\n"
    },
    {
      "time": "",
      "content": "I've voted for the Tschichold Penguin paperback. Sixpence - the modern equivalent of 56p, or about $1 - for a Monotype-set, superbly designed book.\n\n"
    },
    {
      "time": "",
      "content": "Mr Shinn is right, of course. Verdana? What about Gill Sans, the most British of all the typefaces? Perhaps Gill's controversial lifestyle prevented the inclusion.\n\nIn my opinion it is an injustice Gill is not represented. A true British designer, complete with eccentricities.\n\n"
    },
    {
      "time": "",
      "content": "\\>What about Gill Sans?\n\nThe London Underground map is also a contender - although it's Johnston not Gill, the typographic link is so close.\n\nThis design gets my vote. It's so unmistakably British! It's been copied time and time again for pretty much every other underground/rail system in cities around the world. It just works. I particularly like the concept of separating the physical geography out of the map - spectacularly innovative. It's just a shame that Beck got screwed over and didn't make much (if any) money on it...\n\n"
    },
    {
      "time": "",
      "content": "Verdana is great craftsmanship, but I don't think it has the aesthetic greatness to merit being chosen eg over the Concorde. The Concorde is both extremely functional and extremely beautiful. This is not to criticise the face, as the limitations of the screen severely limited what Matthew Carter could do. He himself says his challenge was identify the least ugly shape that would work effectively within the constraints. It seems to me that what is chosen as representative of the best should have both qualities--functionality and aesthetics.\n\n"
    },
    {
      "time": "",
      "content": "What is a bit of a puzzler is that Concorde was a joint anglo-french production, so it's not 100% British design! The pic just shows Concorde wearing BA livery, rather than Air France livery.\n\nIt's a bit bizarre to lump all kinds of design together and ask people to pick their favourite design. I kind of like most of them. How do you favour a map over a car or vice-versa? I suppose it's good in that it promotes awareness of effective design (whilst waving the Union Jack about a bit).\n\n"
    },
    {
      "time": "",
      "content": "What is a bit of a puzzler is that Concorde was a joint anglo-french production, so it's not 100% British design! The pic just shows Concorde wearing BA livery, rather than Air France livery.\n\nIt's a bit bizarre to lump all kinds of design together and ask people to pick their favourite design. I kind of like most of them. How do you favour a map over a car or vice-versa? I suppose it's good in that it promotes awareness of effective design (whilst waving the Union Jack about a bit).\n\n"
    },
    {
      "time": "",
      "content": "\\>Gill Sans\n\nGill can't be nominated as it's the BBC's corporate face and that would be unfair. ;-)\n\n"
    },
    {
      "time": "",
      "content": "Listism is banal, but an easy form of promotion.  \nThey have a lot of this rubbish in the UK.  \nAs well as some very intelligent media, of course!\n\n"
    },
    {
      "time": "",
      "content": "Looks like the Great British Public has spoken, and the man in the street has swept out almost all the graphic design/typography related entries in the first round.\n\nFortuantely that means you have to vote for the tube map in round two...\n\n[http://www.bbc.co.uk/arts/cultureshow/designquest/vote/](http://web.archive.org/web/20110316083214/http:/www.bbc.co.uk/arts/cultureshow/designquest/vote/ \"http://www.bbc.co.uk/arts/cultureshow/designquest/vote/\")\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "[What he said.](http://web.archive.org/web/20110316083214/http:/www.guardian.co.uk/arts/news/story/0,11711,1314089,00.html)\n\n"
    },
    {
      "time": "",
      "content": "Dyson is myopic.\n\n'The Design Museum was founded to herald the manufactured object and the industrial design process'\n\nHmmm... you must mean product design, James. In which case it should have been called the Product Design Museum, not the Design Museum.\n\n"
    },
    {
      "time": "",
      "content": "A couple of more recent articles on the Museum\n\n[http://www.telegraph.co.uk/arts/main.jhtml?xml=/arts/2006/02/13/badesign...](http://web.archive.org/web/20110316083214/http:/www.telegraph.co.uk/arts/main.jhtml?xml=/arts/2006/02/13/badesign13.xml \"http://www.telegraph.co.uk/arts/main.jhtml?xml=/arts/2006/02/13/badesign13.xml\")\n\n[http://news.ft.com/cms/s/e400dfe6-9a24-11da-8b63-0000779e2340.html](http://web.archive.org/web/20110316083214/http:/news.ft.com/cms/s/e400dfe6-9a24-11da-8b63-0000779e2340.html \"http://news.ft.com/cms/s/e400dfe6-9a24-11da-8b63-0000779e2340.html\")\n\n[http://news.independent.co.uk/uk/this\\_britain/article343399.ece](http://web.archive.org/web/20110316083214/http:/news.independent.co.uk/uk/this_britain/article343399.ece \"http://news.independent.co.uk/uk/this\\_britain/article343399.ece\")\n\n[http://www.creativematch.co.uk/viewNews/?91998](http://web.archive.org/web/20110316083214/http:/www.creativematch.co.uk/viewNews/?91998 \"http://www.creativematch.co.uk/viewNews/?91998\")\n\nI don't know much about Alice Rawsthorn, but from what I have heard she's been a supporter of type design for some time - an area of design I think the Dyson crowd would like sweep under the carpet ;-)\n\n"
    },
    {
      "time": "",
      "content": "I don't think Dyson is myopic. As Terence Conran notes: 'what James has wanted, and I agree totally with him, is to create a balance between exhibitions of what is hip and fashionable and those that explain the process of design and why that process matters so much in Britain today', and identifying the need to give 'space and energy to less obviously fashionable, yet equally fascinating and, _socially and economically, more significant design.'_ [my italics]. I'm very sympathetic to this, because far too much of what gets publicly presented as design is mere stylistics and window dressing. And this isn't a crude division between industrial design and graphic design: there are whole areas of graphic design dealing with information design, wayfinding systems, etc. that generally gets passed over in favour of flashy brand-oriented design.\n\nA few years ago, Briem paid me a visit and in the course of our conversation he described type design as industrial design. This really struck me, especially since it was coming from such an accomplished expressive calligrapher. I don't think all type design is industrial design -- certainly a lot of display type is not --, but I think there is more commonality between the working processes and attitudes of type design and, e.g. vacuum cleaner design, than there is with a lot of graphic design.\n\n"
    },
    {
      "time": "",
      "content": "Have you been to the Design Museum? Admittedly, it was a couple of years the last time I visited. To be honest, I got more out of Tate Modern and I'm more into the graphical side of things to boot. Admittedly, the Design Museum is incomparable in terms of space; the scope that design covers is enormous... when I visited, it devoted most space to architecture (as yet not mentioned). It must be a difficult juggling act to keep everyone happy. I just don't think Dyson kicking out at it helps things... maybe a separate graphic design museum should be the way forward. It plays a very small part in the Design Museum, and if you've travelled all the way to London, I've got a feeling that many graphic designers would end up disppointed.\n\nSi\n\n"
    },
    {
      "time": "",
      "content": "FWIW. I went to the Design Museum yesterday. Only one floor open. The British Design award and the Robert BrownJohn exhibit are all that is currently open. There is a discount right now. The BJ exhibit closes this Sunday. I have to say the discount was a good thing as the BJ exhibit wasn't as large as I'd hoped for. Of course you get to see the titles he did for \"From Russia with Love\" and \"Goldfinger\". His titles for \"The Tortoise and th Hare\" -- clever for their time. But his television commercials didn't do anything for me. He has some print work that did make me grin. Mostly in the time with Chermayeff and Geismar so I have to wonder. I will get the book, but only after I find it for sale. I won't go into as I'm sure some worship all he has done.\n\n"
    },
    {
      "time": "",
      "content": "Slightly OT, but with regard to Dyson and the excellence of his designs, whenever I visit my local household waste site ('the tip'), there are always around 10-15 of his hideous vacuum cleaners leaning up against the 'recycled plastic' skip. The wife and I always drive away feeling particularly smug that we bought a Sebo - a fine piece of German engineering.\n\n"
    },
    {
      "time": "",
      "content": "On the subject of the London Tube map, some of these [variations](http://web.archive.org/web/20110316083214/http:/www.geofftech.co.uk/tube/sillymaps/) are fascinating.\n\n"
    },
    {
      "time": "",
      "content": "That is so cool!\n\n"
    },
    {
      "time": "",
      "content": "I think [this article](http://web.archive.org/web/20110316083214/http:/blogs.guardian.co.uk/culturevulture/archives/2006/02/03/going_underground.html) is related to what John just posted. Either way, interesting.\n\n"
    },
    {
      "time": "",
      "content": "Sii \\> I don’t know much about Alice Rawsthorn, but from what I have heard she’s been a supporter of type design for some time\n\nOkay, I take it back, having just read ...  \n [http://www.nytimes.com/2006/02/26/style/tmagazine/t\\_w\\_1051\\_talk\\_rawsthor...](http://web.archive.org/web/20110316083214/http:/www.nytimes.com/2006/02/26/style/tmagazine/t_w_1051_talk_rawsthorn_.html?_r=1&oref=login \"http://www.nytimes.com/2006/02/26/style/tmagazine/t\\_w\\_1051\\_talk\\_rawsthorn\\_.html?\\_r=1&oref=login\")\n\n\"And only an uncool idiot would ever use Arial.\"\n\n... such as, er The New York Times online edition, which uses it for naviagation and sidebars... #nagBar { font-family: Arial, Helvetica, Sans Serif; ...\n\n"
    },
    {
      "time": "",
      "content": "\\>It's bad design, not good design, that makes an impression  \n\\>How can a product that doesn't work and offends the eye possibly be described as a 'design classic', says Germaine Greer\n\n[http://arts.guardian.co.uk/comment/story/0,,1729662,00.html](http://web.archive.org/web/20110316083214/http:/arts.guardian.co.uk/comment/story/0,,1729662,00.html \"http://arts.guardian.co.uk/comment/story/0,,1729662,00.html\")\n\nAlso it's the final round and the Underground map is still in the running -\n\n[http://www.bbc.co.uk/arts/cultureshow/designquest/vote/](http://web.archive.org/web/20110316083214/http:/www.bbc.co.uk/arts/cultureshow/designquest/vote/ \"http://www.bbc.co.uk/arts/cultureshow/designquest/vote/\")\n\n"
    },
    {
      "time": "",
      "content": "For those that care, Concorde won...\n\n[http://www.bbc.co.uk/arts/cultureshow/designquest/vote/](http://web.archive.org/web/20110316083214/http:/www.bbc.co.uk/arts/cultureshow/designquest/vote/ \"http://www.bbc.co.uk/arts/cultureshow/designquest/vote/\")\n\nAnd Verdana came 22nd\n\n"
    },
    {
      "time": "",
      "content": "Hmmmm, jet plane, typeface--go figure.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Nick: I work for neville -- I'll be sure to tell him tomorrow -- bet he'll be chuffed. That or add it to the pile of complements he keeps in the 'archive room'.\n\nAs for verdana -- it's very much an international affair. As much as there is credit for the design museum for even considering the impact of type, I fear this is another half-baked attempt of theirs. The DM recently hosted a talk by Carter and introduced him as a 'world leader in typography'. Suffice to say the audience cringed.\n\n"
    },
    {
      "time": "",
      "content": "Tiffany, was there any explanation about why only one floor of the Design Museum was open when you visited?\n\nA post in another place led me to look up [Kinneir](http://web.archive.org/web/20110316083214/http:/typophile.com/wiki/Kinneir)and [Calvert](http://web.archive.org/web/20110316083214/http:/typophile.com/wiki/Calvert), one thing leads to another, and I ended up at the [Design Museum](http://web.archive.org/web/20110316083214/http:/www.designmuseum.org/).\n\nAccording to their (very clever, Flashy, rather awkward) site, there is a \"Designing Modern Britain\" exhibition that is supposed to be running from 3 Dec 2005 'til 26 Nov 2006.\n\n[Here](http://web.archive.org/web/20110316083214/http:/www.designmuseum.org/exhibimg/mediarelease_143.pdf) is a link to a PDF Press Release (the link on their site keeps getting hidden under the rollover navigation!)\n\nI think I shall have to go and have a look.\n\nI also found [this](http://web.archive.org/web/20110316083214/http:/www.benkellydesign.com/home.php?id=5:0:14:0:0)\n\nRichard\n\n"
    },
    {
      "time": "",
      "content": "Despite a bit of banality in this list nonsense (probably a necessity in the PR game), the Design Museum pays serious props to typography and \"information design\", in an often unusual and stimulating manner. Always worth a visit, and what a brilliant place to be in summer, walking to it across the Thames by footbridge, and along the Embankment.\n\n"
    },
    {
      "time": "",
      "content": "i went to the Saul Bass exhibit at the Design Museum in 2004, and i absolutely loved it. it's a shame Bass, despite being so prolific, doesn't get more props in general though. the fact that there are barely any books on him and/or his work is just so depressing.\n\nbut back to the topic at hand, i can't believe Concorde won. personally i think more of France than England when i think about Concorde.. the Underground maps/design, the Mini Cooper and Routemaster buses are far more distinctly British in my mind.\n\n"
    },
    {
      "time": "",
      "content": "\\> 1984 was the year Neville Brody developed “Industria” in its pages.\n\nBut Industria was inspired (using the term quite forgivingly)  \nby a German design from the first half of the 20th century.\n\n\\> The London Underground map\n\nTo me it's unnecessarily Modernist.  \nNot representative of the inherent organicity of any metro system.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> But Industria was inspired (using the term quite forgivingly)  \nby a German design from the first half of the 20th century.\n\n(and italian) I don't think there's any doubt about that and nor would neville deny it. I think the hoohaa about the FACE was more about the innovation in typography in its contemporary application (again see el lissitzky(sp?))\n\n\\> To me it’s unnecessarily Modernist.  \nNot representative of the inherent organicity of any metro system.\n\nI disagree. It's necessity as a piece of clear information design leads it this way, rather than modernism dictating its form. I don't believe information design to be the strict bastian of modernism, but it certainly has its pros, particularly against the huge numbers, and diversity of people that use the map everyday.\n\n"
    },
    {
      "time": "",
      "content": "Having seen Brody in person, I can tell he's a Good Guy. But the design I'm talking about is so close to Industria that really, the first thing anybody should say about it is that. Instead, I had to run into it myself, many years afterwards.\n\nThe problem with the London Underground Map is that it sacrifices  \nlayers of information, information that can useful to some people  \nsometimes, and for what reason? Das Grid.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "would love to see it if you have a scan at hand?\n\nwhat information are you talking about here?\n\n"
    },
    {
      "time": "",
      "content": "Scan? Doesn't Google show anything?\n\nBTW, there's a great article in a back issue of  \nTYPO magazine (or was it Baseline?) comparing the  \nsubway maps of various cities - very revealing.\n\n\\> what information are you talking about here?\n\nThe first that comes to mind: relative distances.  \nThere's a lot of potential between making things exactly  \nto scale versus throwing the baby out with the bathwater.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Scan: I'm sorry - I just realized you were talking about Industria! :-/  \nSoon.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "[http://www.oskarlin.com/2005/11/29/time-travel/](http://web.archive.org/web/20110316083214/http:/www.oskarlin.com/2005/11/29/time-travel/ \"http://www.oskarlin.com/2005/11/29/time-travel/\")\n\n[http://homepage.ntlworld.com/clivebillson/tube/tube.html](http://web.archive.org/web/20110316083214/http:/homepage.ntlworld.com/clivebillson/tube/tube.html \"http://homepage.ntlworld.com/clivebillson/tube/tube.html\")\n\nThrowing scale out, while it does make some situations more difficult, seems to me to be a price worth paying for easier and, more importantly, route-planning. That first link is an impressive piece of work.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "I agree with Tim on this matter, though oskarlin's example is admirable and seems to do a decent job. Using time as a unit of measurment is also an interesting idea, if not entirely practical or futureproof.\n\n"
    },
    {
      "time": "",
      "content": "When you two make up your minds let me know.\n\n--\n\nIt's that ol' Modernism, got your brains by the balls.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>sacrifices layers of information, information that can useful to some people sometimes, and for what reason? Das Grid.\n\n\\>It’s that ol’ Modernism, got your brains by the balls.\n\nAs Tim's useful links reveal, the designer of the map, Harry Beck, was an electrical draftsman, whose idea for his breakthrough 1933 map came from electrical circuit diagrams, not from modernist aesthetics. The horizontal, vertical and diagonal lines are just easier to follow with the eye and the finger, as with circuit diagrams.\n\nThe additional information you say is of use to 'some people, sometimes' is exactly the information that makes more informationally-loaded maps worse for most riders, most of the time. Circuit diagrams reduce the information to what electrical devices are conntected to what other electrical devices--the essentials of how the circuit works and how to connect it or trouble-shoot it.\n\nSimilarly, the advantage of Beck's approach is that it gives the rider immediately the most \"mission critical\" information: The stops, and where to change to another line. This information about connections is the essential information for the decisions the rider needs to make to plan his or her route from one station to another. The schematic insertion of the river gives an orientation, without detracting.\n\nThe 'time travel' link of Tim is a noble effort that shows how difficult it is to improve on Beck's design. The revised version is not as compact, and the lines are harder to follow with the eye. Both significant minuses. Furthermore, the current version of Beck's map is close enough to relating time travel and length that it I believe is always or almost always possible for a Tube rider to find the shortest path in time to his or her destination. (There may be an issue about the picadilly vs victoria line; I don't remember for sure.)\n\nOverall, the time travel map would be a useful addition to the 'London A-Z' map, which a significant number of tube riders probably have on their person, and which contains the geographic information.\n\nHaving lived in London and used Tube and the map daily for 5 years, I can testify that it is great information design. Tim I see is a Londoner, and so speaks from knowledge and experience of using the map. His brains are working just fine.\n\n"
    },
    {
      "time": "",
      "content": "\\> The horizontal, vertical and diagonal lines are  \n\\> just easier to follow with the eye and the finger\n\nPoppycock.  \nAnd the \"grid\" I was referring to goes beyond the Cartesian.  \nHumans are not computers.\n\nI've been on I don't know how many metro systems. And I've actually  \nbeen outside them too; the inhuman disjoin is the essence of my complaint.\n\n--\n\nIndustria:\n\n ![](http://web.archive.org/web/20110316083214im_/http:/typophile.com/files/ProtoIndustria.gif)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>poppycock\n\nHow about some analysis that answers my specific points? Epithets are not arguments.\n\n\\>humans are not computers\n\nWho said they were?\n\n\\>the inhuman disjoint\n\nHorizontal and vertical are basic visual orientations that are imbeded in the human visual system. That's why horizonal and vertical lines are easy to pick out and follow. The design is well suited to humans who need to do a specific task: quickly see how to get to their destination.\n\n"
    },
    {
      "time": "",
      "content": "Univers and Helvetica are closer.\n\n"
    },
    {
      "time": "",
      "content": "Nick, are you... jesting?  \n [http://www.myfonts.com/fonts/linotype/industria/solid/](http://web.archive.org/web/20110316083214/http:/www.myfonts.com/fonts/linotype/industria/solid/ \"http://www.myfonts.com/fonts/linotype/industria/solid/\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "the influences are transparent, but I don't think the two fonts are that similar. Modularity of this kind in typefaces tends to reveal, naturally similar results. There are quite a few similar designs, of the same era to the one you posted Hrant (and thanks for that), but it looks like he's done something of his own to it, in my eyes. The design you posted feels closer to conservative models than neville's, and more human (if I dare describe it that way). Still, all interesting, and a shame they're not closer -- I was semi-hoping they were so I could rib him.\n\nAnd I aint no zombie modernist, Mr Presumptuous ;)\n\n"
    },
    {
      "time": "",
      "content": "\\> similar results\n\nAdmittedly a common phenomenon.\n\nAlso: He couldn't have seen it where I saw it, since  \nthat book, \"130 Alphabets\", was published 2 years  \nafter Industria was released (as per MyFonts).\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_Beck’s map_\n\nBeck's map is not a map, it is a diagram (regardless of what it says on the printed pieces). Once you accept that, you'll also accept that you cannot map a city the size of London diagrammatically without sacrificing some information. If the distances would be equal across the diagramm, i.e. proportionate to their true measurements, either the centre would be ridiculously small or the stations beyond the circle line would need to be shown on separate sheets.\n\nThe trouble is that the tube diagram is so well-known by now that most people – especially those not familiar with the city – use it as their _only_ reference to London. More often than not, tourists will travel an extra 15 minutes on the tube when they could walk the distance between stops in 5.\n\nWe – Tim Fendley at AIG in London with a little help from myself – are currently working on a project which should provide better information, both in print and on the ground – for pedestrians. Walking is a very good way to get around London, but for most visitors, the topography can be intimidating&nbsp;- especially if they're from grid-based North America. Das Grid (or Der Raster, as we call it) actually makes those people feel more at ease than \"proper\" maps.\n\n"
    },
    {
      "time": "",
      "content": "I don't know what the design process behind Industria was, but here's what I assumed, as a Face subscriber. In May 1984, this was the cover:\n\n ![](http://web.archive.org/web/20110316083214im_/http:/typophile.com/files/Face84.png)\n\nTwo months later, the typeface later named Industria appeared in the magazine.  \nSeeing the way that visual ideas evolved in The Face from issue to issue, it seemed obvious at the time that the ELECTRO cover was the bridge between Neville Brody's earlier post-punk mixed-up-Mecanorma headline style, and using the type styles he designed himself. Simple modular faces look alike, and I don't see why Industria couldn't be developed without reference.\n\n"
    },
    {
      "time": "",
      "content": "_I’ve been on I don’t know how many metro systems. And I’ve actually  \nbeen outside them too; the inhuman disjoin is the essence of my complaint._\n\nWhat is your anti-modernist alternative?  \n(Remember that your alternative should fit on an A5 size and include all stops from Heathrow to Upminster, and High Barnet to Morden)  \nTim\n\n"
    },
    {
      "time": "",
      "content": "\"Verdana is great craftsmanship, but I don’t think it has the aesthetic greatness to merit being chosen eg over the Concorde.\"\n\nWell, you can read Verdana, but you can't board a Concorde. I'd say, that's a pretty good indicator of which one works better. I think is amazing how design competitions and museum spats bring out the fits to match the hissies .:)\n\n"
    },
    {
      "time": "",
      "content": "\"Well, you can read Verdana, but you can’t board a Concorde. I’d say, that’s a pretty good indicator of which one works better.\"\n\nlol\n\n"
    },
    {
      "time": "",
      "content": "when i went to London a few years ago i bought this pocket map from a vending machine that they had in most tube stations. it cost like a quid or two, and it had maps of the central areas of London with the street grid, bus routes and tube stations/routes all on the same map. very handy for the tourist who isn't too likely to venture too far out of the central areas (there was a traditional full tube map in it too though). no idea if they still make them, but i'd highly recommend it. fits in your pocket, inexpensive and covers most of your needs as a tourist.\n\n"
    },
    {
      "time": "",
      "content": "Nick, let's not get ahead of ourselves - before I address what's  \nwrong in your most-recent post, please concede the following:  \n- Industria is not a typically British font.  \n- My sample is much closer to Industria than it is to Helvetica or Univers.  \nTell you what, I'll make you a deal: just one of those is fine.\n\nTim, I'm not good enough to design anything better. But I am good enough to know there's something wrong, and to have ideas for improvement. Like addressing Erik's \"tourists will travel an extra 15 minutes on the tube when they could walk the distance between stops in 5.\" Of course a strict application of scale would backfire, but what about a square (or greater) root of distances (or time)? Think of how (good) diagrams of the solar system -a much more extreme case- do NOT show the planets equally spaced and all the same size. Or what about splitting the map/diagram into two: a central one, and a broad one. Think of how infrequently commuters would need to switch between them. It's not like suburbanites who use the same route to get to/from work every day ever look at the diagram anyway; and few tourists venture outside the center. The desire to put everything on one page isn't necessarily good design, it's more likely despotic.\n\nMy point is there's no reason -except worshipping Modernism- to dump all that \"real\" information. If you incoporate extra layers in a subtle way, no commuter is going to miss his train; and some commuters will have more questions answered - people are not morons, they observe and extract. And what's the real sacrifice? It would look less \"tidy\". But you can't make soup with tidy. Post-war insecurity is best addressed with open discussion, not a whitewash of oversimplification in the dirty practical details of life.\n\n\\> you can read Verdana, but you can’t board a Concorde.\n\nGood point, but do look at the age difference.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "747s are older and still flying :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "- Industria is not a typically British font.\n\nA great design would not necessarily follow what went before.  \nHowever, for a precedent in British design, of hard edged condensed sans faces, consider the mod '60s and Compacta, Impact, and Ken Garland's work eg the original First Things First manifesto.\n\n- My sample is much closer to Industria than it is to Helvetica or Univers.\n\nI said that Univers was closer to Helvetica than your sample was to industria.\n\n"
    },
    {
      "time": "",
      "content": "\\> A great design would not necessarily follow what went before.\n\nWho said anything about great?\n\nAnyway, British is not hard-edged.\n\n\\> Univers was closer to Helvetica than your sample was to industria.\n\nAlso false.\n\nFor one thing note how there are numerous fonts between Univers and  \nHelvetica, but none (that I know of) between Industria and my sample.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "You can board a Concorde, at least here in Seattle... (from Jan 04)\n\n ![](http://web.archive.org/web/20110316083214im_/http:/typophile.com/files/Jan4%20017%20(WinCE).jpg)\n  \n\n ![](http://web.archive.org/web/20110316083214im_/http:/typophile.com/files/Jan4%20001%20(WinCE).jpg)\n  \n\n ![](http://web.archive.org/web/20110316083214im_/http:/typophile.com/files/Jan4%20009%20(WinCE).jpg)\n\n"
    },
    {
      "time": "",
      "content": "When I first travelled to London I had a proper map and the Tube map (diagram). I will admit that I often thought it would be quicker to take the tube. Now, however, I find it quicker to walk and avoid the tube congestion ... well, most of the time anyway. South Ken to Covent Garden is a little bit of a walk, but nice on a holiday afternoon.\n\n"
    },
    {
      "time": "",
      "content": "\\> I find it quicker to walk and avoid the tube congestion\n\nAnd a good tube map/diagram would help you make such decisions.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Who is the cute little one in your last picture Si?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Your plan of splitting the two sections has been done, most tube carriages have a central area map without the extremes (together with a longish horizontal representation of the line including all stations on that line), a good reason for this is that there simply isn't space\\* in the carriage to post a full map/diagram. (\\*and still keep the valuable advertising space.)  \nThe trouble with a logarithmic scale is that the audience has to be aware of that scale and how it works, in your example, most people, myself included, have very little conception of how far a light year is, but to give them a map that appears to show double a five minute walk only for that to turn out to be twenty minutes and they might well complain. A cynic might say that it is not in the Underground's best interest for its consumers to know that by walking for five minutes would save fifteen minutes on the tube.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "That's my daughter Lily (she would have been 3 1/2 in that pic). To be honest she wasn't impressed with the Concorde, although she loves trips to the Museum of Flight - prefers the older planes and hands-on exhibits.\n\n"
    },
    {
      "time": "",
      "content": "Lily is a sweetheart. She reminds me of my daughter at that age (she also has a mind of her own :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Thanks Chris, she has a mind of her own all right, but she seems to like being around fonts and font people. This past weekend we visited the fake Bavarian town of Leavenworth ( [http://www.leavenworth.org/](http://web.archive.org/web/20110316083214/http:/www.leavenworth.org/ \"http://www.leavenworth.org/\")).\n\n ![](http://web.archive.org/web/20110316083214im_/http:/typophile.com/files/March2006%20432%20(WinCE).jpg)\n\nWhen she described it to a family friend last night she said \"It's a place with old fashioned lettering on the signs\" and recently told me, \"Daddy, I am a typo child.\" It's enough to make you blub ;-)\n\n"
    },
    {
      "time": "",
      "content": "That is priceless Si :-)\n\nBTW, my daughter makes puns--Surprise! ;-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "_“It’s a place with old fashioned lettering on the signs” and recently told me, “Daddy, I am a typo child.”_\n\nI work on my laptop while I commute to work. Once a few years ago, a class of school children boarded my tram car. They could see my laptop; I was working in FontLab on some blackletter project. One of children asked another one (in German)… \"what's that?\" Some brilliant little girl said quietly, \"das ist die Schrift von früher\" (\"that's the writing from the past\").\n\nThat was sooooooo cute.\n\n"
    },
    {
      "time": "",
      "content": "\\> the audience has to be aware of that scale\n\nBut the key thing is that those unaware lose nothing.\n\n\\> A cynic might say that it is not in the Underground’s  \n\\> best interest for its consumers to know\n\nBy which you have reminded me what I <cite>almost</cite> replied  \nto William's \"The design is well suited to humans ...\":  \nThe design is well suited to livestock.\n\n\\> prefers the older planes and hands-on exhibits.\n\nAh, a discriminating lady! :-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>Well, you can read Verdana, but you can’t board a Concorde. I’d say, that’s a pretty good indicator of which one works better.\n\nWell, there was a definite problem with the original Concorde spec, but I would argue that the design was so good that it stayed alive and flew for over twenty five years anyway. Also Verdana is now ten years old, and possibly may soon be replaced by the MS Clear Type fonts, including Carter's own Meiro.\n\nThe basic problem with the Concorde is that they assumed cheap fuel, and when it was clear that that was wrong, they still went ahead with it. The British and French had to write off billions in development costs. However, when it flew it actually made money year over year, basically because it was so fabulous both technologically and aesthetically that rich people were willing to pay absurd amounts to fly on the thing.\n\nI live not so far from Dulles airport and once in a while we saw it fly over, and it was a thrill every time. I saw it a few times on the ground at the airport and it took my breath away. It was that beautiful, and looked like it was travelling a hundred miles an hour when it was sitting still.\n\nMy neighbor was the chief mechanic on it at Dulles, and just loved that machine. He said it could easily take off straight up, like a rocket ship, except that the passengers would sh\\*t in their pants. It travelled faster than a bullet at its top speeds.\n\nThe romance of the thing was so powerful that it stayed alive when it really didn't make commercial sense. So it is rightly a design icon, I think, in spite of the story of stupid government decisions on the specs for it. It reminds me of another design icon here in Virginia, Monticello. It was impractical and didn't make economic sense, but it is an inspiration to visit it, and it would be a fabulous place to live, at least for a little while.\n\nI certainly think that bad finances are a very bad idea, but sometimes great design has emerged anyway.\n\n"
    },
    {
      "time": "",
      "content": "That Concorde was one dirty noisy rich man's toy.  \nClimate change ain't beautiful.\n\n"
    },
    {
      "time": "",
      "content": "\\> dirty noisy rich man’s toy.\n\nYeah, nothing at all like glossy glamour magazines.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>one dirty noisy rich man’s toy\n\nYes, and a technical and visual marvel. It could be all at the same time, and was.\n\n"
    },
    {
      "time": "",
      "content": "Thinking further on a logarithmic scale, it could only work on the distance between individual stations, so to make an extreme example – three stations X, Y and Z.\n\nX to Y is 25 minutes (or miles) and is therefore shown on the map as having 5 units between them.\n\nY to Z is 36 minutes (or miles) 6 units between them\n\nOne cannot represent X to Z as 11 units (which would scale to 121 minutes/miles) or as a square root of 61 minutes/miles (7.8 units).  \nSo it would have to be  \n(X to Y) + (Y to Z)  \n(5x5) + (6x6) = 61  \nwhich is a lot of mental arithmetic, especially for longer journeys that can't be divided into whole numbers.  \nBut perhaps I am overthinking this, especially as I am unlikely to ever be offered the chance of redesigning the Underground map.\n\n_The design is well suited to livestock_  \nSo you have been on the Underground :)\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "\\> So you have been on the Underground\n\nBa'a'a'a.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "The worst thing about the Tube map is when you go to exchange lines and end up walking miles underground -- there's no way of knowing how long the connection is. There's a similar phenomenon here in Toronto, which has the same kind of map for its two-line system.\n\nA topographically accurate Underground map would be very interesting, as it would show the winding routes the older lines took to avoid properties that wouldn't allow being burrowed beneath.\n\n"
    },
    {
      "time": "",
      "content": "\\>no way of knowing how long the connection is\n\nGood point. This could be in information at stations or in the trains for information on the exchange points it meets.\n\n"
    },
    {
      "time": "",
      "content": "No, it should be before you even decide to go under.  \nNot everybody is nostalgic for bunkers.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Now THIS is a nice metro map:  \n [http://www.flickr.com/photos/aticolunatico/4073439289/sizes/l/](http://web.archive.org/web/20110316083214/http:/www.flickr.com/photos/aticolunatico/4073439289/sizes/l/ \"http://www.flickr.com/photos/aticolunatico/4073439289/sizes/l/\")\n\nhhp\n\n"
    }
  ]
}
