{
  "id": "17643",
  "title": "Akzidenz-Grotesk (Re-)Release Dates",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "In [Anatomy of a Typeface](http://web.archive.org/web/20150408010007/http:/www.typophile.com/wiki/Anatomy%20of%20a%20Typeface), A. Lawson says that sometime around the 50s \"Berthold reissued the even older [Akzidenz Grotesk](http://web.archive.org/web/20150408010007/http:/www.typophile.com/wiki/Akzidenz%20Grotesk)\", but there's no date for the original release or the reissuing. I would be very very thankful if someone pointed me to these dates.  \nThank you! :)\n\n",
  "author": "gabrielhl",
  "time": "31 Jan 2006 — 8:49am",
  "uid": "5081",
  "comments": [
    {
      "time": "31 Jan 2006 — 11:41am",
      "content": "Identifont says Akzidenz Grotesk is originally from 1896. No idea on the reissue date.\n\n[http://www.identifont.com/show?FU](http://web.archive.org/web/20150408010007/http:/www.identifont.com/show?FU \"http://www.identifont.com/show?FU\")\n\n"
    },
    {
      "time": "31 Jan 2006 — 1:16pm",
      "content": "Thank you!\n\n"
    },
    {
      "time": "31 Jan 2006 — 2:33pm",
      "content": "Accidenz (sic) Grotesk was acquired by Berthold in Berlin when they bought another foundry, Pöpplbaum in Vienna. That was 1896 or 1898, depending whether one takes the date of the sale or the release of AG. The original weight was quite light, and Berthold kept adding weights, some of them from other faces, acquired from other foundries. Every foundry had a version of that type of face, more often than not available in a few sizes only. The original series remained quite divers, individual weights showing not much resemblance but name. It was mainly a marketing and naming success. That only changed when they cut (I’m talking foundry type, with some sizes and weights also available on Intertype slug casters) Series 57, and then Series 58, named for the years of release. These had some sizes (but not all) recut under the direction of Günter Gerhard Lange, who was their (freelance) artistic director at the time.\n\nI’m writing this from memory at home, 11pm, with no chance to get to my Berthold specimen books. If I remember, I can show some of the versions, e.g. Series 57’s 14pt, which looked totally different from the others, no spur on the a. for example. Lange also had the condensed and bold weights built out for the family, an exercise he had to re-do when Berthold went over to photosetting in the late 60s. Among others, that is when he added the coolest of the AGs: the **Super** weight. But that is another story.\n\n"
    },
    {
      "time": "31 Jan 2006 — 4:03pm",
      "content": "You just gotta love that man. :^)\n\nAnd I agree about [AG Super](http://web.archive.org/web/20150408010007/http:/www.philsfonts.com/detail.html?sku=AB80096012P1) -- that face kicks some major booty. One of the wikkidest black grotesques in the known universe.\n\n"
    },
    {
      "time": "31 Jan 2006 — 4:03pm",
      "content": "Erik you are The Man. That's all I can say. I can only hope one day I'll be able to know that much info just from memory! :)\n\nThe reason I asked was because I wanted to know how old this face was when \"Swiss-style\" designers started using it for, well, everything. I was wondering if it had been discontinued and then reissued because of the increased demand for _Grotesks_. From your post it seems the name was kind of erratically used troughout the all those years.\n\nOnce again, thanks.\n\n"
    },
    {
      "time": "31 Jan 2006 — 5:36pm",
      "content": "Erik - and what about the Royal-Grotesk by Ferdinand Theinhardt?\n\nG.G. Lange said in Typographische Monatsblaetter 2 2003 (on page 38)  \nthat the Akzidenz Grotesk was based on the Royal-Grotesk by Theinhardt.  \nAccording to Lange, in 1908 Theinhardt's foundry was bought by Berthold,  \nand so Berthold acquired also the Royal-Grotesk.\n\nSeemann: Handbuch der Schriftarten shows Royal-Grotesk on page 192  \n(it actually has much in common with Akzidenz Grotesk Light),  \nand attributes it to Berthold.\n\nIs the 1899 specimen (shown in Manfred Klein: Type & Typographers) the earliest specimen of the Accidenz Grotesk? Is this already a release by Berthold?  \n(And if so, how can Berthold sell the Royal-Grotesk already in 1899 under the name  \nAccidenz Grotesk, when they actually bought the Theinhardt foundry in 1908?)\n\nWas G.G. Lange wrong with his information about Theinhardt?  \nDid he get the date - 1908 - wrong, or is there actually no connection  \nbetween Theinhardt and Akzidenz Grotesk?  \n(Theinhardt didn't have anything to do with Poppelbaum, I suppose.)\n\nAre there any specimen of Poppelbaum which show the early Akzidenz Grotesk?\n\n"
    },
    {
      "time": "31 Jan 2006 — 9:54pm",
      "content": "<cite>Akzidenz Grotesk was based on the Royal-Grotesk by Theinhardt.</cite>\n\nAs I wrote, various versions of AG came from various sources. Sometimes they took just one size from one foundry and renamed it without changing anything. The first weight was a very light Regular. They picked up a Light and a Medium (Halbfett) along the way. And here, too, the difference between, say, a 9pt, a 12pt and a 14 or 16pt (the German system didn’t know 18pt, but it had 20pt, called Text after the size in Gutenberg’s Bible) was considerable.\n\nIn other words: sorting out which size, weight and version of Akzidenz Grotesk came from which source would be a great topic for a thesis. Berthold may have given some credits, but they weren’t all that interested in revealing all the real sources, as they wanted to present an integrated family under one name, which AG never was, except in marketing terms.\n\n"
    },
    {
      "time": "31 Jan 2006 — 10:18pm",
      "content": "<cite>I was wondering if it had been discontinued and then reissued because of the increased demand for Grotesks.</cite>\n\nThe demand from the proponents of the <cite>International</cite> or <cite>Swiss</cite> was the reason for them redesigning the series in the late 50s. For the first time, most of the text sizes were coordinated, missing sizes added, and – most importantly – the cooperation with _Intertype_ supplied matrices for machine setting. Don’t forget that Berthold only ever cast founder’s type for handsetting. That was ok for jobbing work (which is what **Akzidenz** meant in a German composing room), but would hardly suffice for timetables, books and other text-heavy jobs that the new style demanded to be set in a sans serif face. And Helvetica appeared the same year as Series 57 (as did Univers), answering the same market demand, itself going back to late 19th-century sources (which Univers did not), like Scheltersche Grotesk (see [FFBau](http://web.archive.org/web/20150408010007/http:/www.orangeitalic.com/bau.shtml)) et al.\n\n"
    },
    {
      "time": "31 Jan 2006 — 11:40pm",
      "content": "Not wanting to be intrusive, may I ask what modern revival of AG would you all agree is the best digital one?\n\nJust wondering.\n\nThanks Erik for the lecture.\n\n"
    },
    {
      "time": "1 Feb 2006 — 3:30am",
      "content": "Till 1926 (Register-Probe) and maybe later too, the Berthold A.G. Berlin soled Royal-Grotesk and Accidenz-Grotesk both under their names und suggest the combination of it.\n\nBTW, the guys from Chicago are following such discussions too and \"trademark\" every possible name we spot on. Old thread from May 2004 showing Royal-Grotesk as one root.  \n [http://typophile.com/node/4567](http://web.archive.org/web/20150408010007/http:/typophile.com/node/4567 \"http://typophile.com/node/4567\")\n\n[http://oami.eu.int/CTMOnline/RequestManager/en\\_SearchAdvanced](http://web.archive.org/web/20150408010007/http:/oami.eu.int/CTMOnline/RequestManager/en_SearchAdvanced \"http://oami.eu.int/CTMOnline/RequestManager/en\\_SearchAdvanced\")\n\nSince 10/03/2005 \"AG ROYAL\" and \"ROYAL GROTESK\" are registered trademarkts of Berthold Types Ltd..\n\n-- [astype.de](http://web.archive.org/web/20150408010007/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "1 Feb 2006 — 4:27am",
      "content": "Since we are on the subject of Grotesks, here's an excerpt from the wiki for [Helvetica](http://web.archive.org/web/20150408010007/http:/www.typophile.com/wiki/Helvetica):  \n<cite>During the mid-1950s, at the behest of the Haas Typefoundry’s Edouard Hoffmann, Max Miedinger designed a Grotesque sans serif face, which was soon thereafter distributed as Haas Grotesk.</cite>\n\nShouldn't it be [Neue Haas Grotesk](http://web.archive.org/web/20150408010007/http:/www.typophile.com/wiki/Neue%20Haas%20Grotesk)? That's how I knew it, but I guess it's better to ask \"the pros\" before changing the Wiki based solely on my (very little) knowledge.\n\nCheers.\n\n"
    },
    {
      "time": "1 Feb 2006 — 6:51am",
      "content": "Series 57 and Series 58 had been foundry type versions issued by Berthold in connection with the line-casting versions licensed to Linotype in 1958 and published by Linotype by the end of 1958 in two cuts: Regular and Semi-bold (i.e. not Italic). I have uploaded a scan from a very old AG booklet displaying these series:\n\n[http://www.sanskritweb.net/temporary/57-58.gif](http://web.archive.org/web/20150408010007/http:/www.sanskritweb.net/temporary/57-58.gif \"http://www.sanskritweb.net/temporary/57-58.gif\")\n\n"
    },
    {
      "time": "2 Feb 2006 — 1:20am",
      "content": "<cite>Neue Haas Grotesk</cite>\n\nIndeed. I enclose some scans from the first specimen binder, designed by ”Atelier Müller-Brockmann”, no less. It is not dated, but must have been published around 1958. In the next specimen book from Haas, the face is already called Helvetica, available on Linotype machines and has been expanded to Italic and Extended weights. The weights and sizes for Neue Haas Grotesk can be seen on the postcard (haas03.jpg).\n\nBTW: I wrote that AG Series 57 and 58 were available for Intertype. That is, of course, rubbish. The fonts were made available for Linotype matrices. The fact that my brain hurts now and again could also be the explanation for the fact that _I cannot find my Berthold specimen books!_ All the most precious books are missing. I may have lent them to somebody. You know who you are, so please come forward, I need to research the Akzidenz Grotesk story.\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/haas01.jpg)\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/haas02.jpg)\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/haas03.jpg)\n\n"
    },
    {
      "time": "2 Feb 2006 — 2:48am",
      "content": "Wow! Now there's something you don't see everyday. Amazing.\n\nThe weights are \"Thin\", \"Semibold\", and \"Bold\", right?  \nBut what are the numbers in that table? Point sizes? This would mean that the Light could be had in 4 point?\n\nAlso interesting to notice is that in that big big size from the title page, the characteristically-angled G spur is straight!\n\n"
    },
    {
      "time": "2 Feb 2006 — 3:15am",
      "content": "\"halbfett\" is the German word for bold  \n\"fett\" is black\n\nwhere the difference between the languages' term come from, I do not know.\n\n"
    },
    {
      "time": "2 Feb 2006 — 3:46am",
      "content": "Dan, that's interesting... and confusing. :)\n\n"
    },
    {
      "time": "2 Feb 2006 — 5:25am",
      "content": "erik wrote: \"was acquired by Berthold in Berlin when they bought another foundry, Pöpplbaum in Vienna\" ...\n\nPöppelbaum was in 1926. It was the Theinhardt foundry at Berlin, how brought the Royal and the Accidenz to B. in 1908.\n\nacquisitions and shared acquisitions of B.\n\n-1897 Bauer & Co, Stuttgart, 100%, Germany  \n-1898-1900 Branch St. Petersburg, 100%, Russia  \n-1901 Georg Ross & Co. St. Petersburg + new Branch at Moskau, 100% Russia  \n-1905 J. H. Rust & Co. Wien, 100%, Austria  \n-1907 A. Haase, Prag, 100%  \n-1908 Ferdinand Theinhardt GmbH Berlin, 100%, Germany  \n-1912 St. Petersbrug Branch of Flinsch (later Bauer), 100%, Russia  \n-1917 Emil Gursch Berlin, 100%, Germany  \n-1918 Gottfried Böttger, Leipzig, 100%, Germany  \n-1918 A. Kahle, Weimar, 100%, Germany  \n-1920 Julius Klinkhardt, Leipzig, 100%, Germany  \n-1922 C. Kloberg, Leipzig, 100%, Germany  \n-1926 Poppelmann, Wien, 50% - 50% to D. Stempel A.G., Austria  \n-1926 First Hungarien Type Foundry, Budapest, 50% - 50% D. Stempel A.G, Hungary  \n-1929 Genzsch & Heyse, Hamburg 33% - 33% Bauersische Gießerei(Bauer) - 33% D. Stempel A.G., Germany\n\nThese acquisitions means not, the companies disappeared with their names and products from the marked at once.\n\nSome typeface names from old specimen books:  \nps. I'm not the guy with eriks books, you should never borrow them. :-)\n\nMaybe someone has the first big specimen proof of B. from 1911?\n\n- Theinhardt Probe 191?  \nRoyal-Grotesk  \nAccidenz-Grotesk  \nAccidenz-Grotesk breit  \nAccidenz-Grotesk halbfett  \nAccidenz-Grotesk fett\n\n- B. Registerprobe 1926  \nRoyal-Grotesk  \nAkzidenz-Grotesk  \nAkzidenz-Grotesk halbfett  \nAkzidenz-Grotesk fett  \nAkzidenz-Grotesk Skelett  \nAkzidenz-Grotesk breit mager  \nAkzidenz-Grotesk breit  \nAkzidenz-Grotesk eng  \n(also mentioned among many other Grotesks...)  \nSteinschrift eng  \nLiliput-Grotesk\n\n- B. Hauptprobe Nr. 428 (different cover colors available) 1957?  \nAkzidenz-Grotesk mager (Royal-Grotesk) / Liliput Grotesk  \nAkzidenz-Grotesk  \nAkzidenz-Grotesk halbfett  \nAkzidenz-Grotesk fett  \nAkzidenz-Grotesk schmal mager  \nAkzidenz-Grotesk eng  \nAkzidenz-Grotesk schmal eng (Steinschrift eng)  \nAkzidenz-Grotesk schmal fett (Bücher-Grotesk halbfett)  \nAkzidenz-Grotesk Skelett  \nAkzidenz-Grotesk breit  \nAkzidenz-Grotesk breit fett\n\n- B. Hauptprobe Nr. 470 (the yellow book) 1964?  \nAkzidenz-Grotesk mager / Liliput-Grotesk  \nAkzidenz-Grotesk  \nAkzidenz-Grotesk halbfett  \nAkzidenz-Grotesk fett  \nAkzidenz-Grotesk schmalmager  \nAkzidenz-Grotesk eng  \nAkzidenz-Grotesk schmalhalbfett  \nAkzidenz-Grotesk schmalfett  \nAkzidenz-Grotesk extra  \nAkzidenz-Grotesk Skelett  \nAkzidenz-Grotesk breit  \nAkzidenz-Grotesk breithalbfett  \nAkzidenz-Grotesk breitfett  \nAkzidenz-Grotesk Serie 57  \nAkzidenz-Grotesk Serie 58\n\n-- [astype.de](http://web.archive.org/web/20150408010007/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "2 Feb 2006 — 10:25am",
      "content": "Wow.\n\nI like AG so much and just used it for a book design but it definitely has some quirks and inconsistencies between the various weights - at least my version. Most notable for example, in the condensed weights the leg of the R goes from straight to curved as it gets heavier.\n\n"
    },
    {
      "time": "2 Feb 2006 — 1:24pm",
      "content": "Since there is some interest in the old foundry type specimens of the Akzidenz-Grotesk, I have scanned the most comprehensive booklet published at that time. The scans are downloadable as one large zip file here at my website:\n\n[http://www.sanskritweb.net/fontdocs/#Akzidenz](http://web.archive.org/web/20150408010007/http:/www.sanskritweb.net/fontdocs/#Akzidenz \"http://www.sanskritweb.net/fontdocs/#Akzidenz\")\n\nThe 40-page typesetting booklet \"Specimen No. 473\" published in the early 1960s documents the entire Akzidenz-Grotesk foundry type. The files AG01.TIF through AG26.TIF reproduce the black-and-white samples. The colored samples were not scanned.\n\nNote: Harvey Hunt's shady outfit \"Berthold Types\" is NOT the \"legal successor\" to H. Berthold AG. For more details inquire at the criminal police. Harvey Hunt and his shysters are NOT permitted to download these TIF files.\n\n"
    },
    {
      "time": "2 Feb 2006 — 3:21pm",
      "content": "Anyone who still doesn't know the whole story behind Berthold and _He Who Shall Remain Unnamed But Hires Very Wealthy Lawyers_ may be scratching his/her head after this last post. You can find additional information on [Luc Devroye's website](http://web.archive.org/web/20150408010007/http:/cgm.cs.mcgill.ca/~luc/berthold.html).\n\n_I like AG so much and just used it for a book design but it definitely has some quirks and inconsistencies between the various weights -- at least my version._\n\nBut that's what's so great about this family!\n\n"
    },
    {
      "time": "2 Feb 2006 — 3:37pm",
      "content": "\"But that’s what’s so great about this family!\"\n\nHey, that so great about DIN? Maybe its the cold and clean look and feel. I dont like them much, but I have some sympathy for the older lighter cuts like Royal - with the strike through the UC Q.\n\nThe interesting part for me are the different sources, melted into this family. It's not the work of one genius, its more a distilled patch work.\n\n-- [astype.de](http://web.archive.org/web/20150408010007/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "2 Feb 2006 — 5:15pm",
      "content": "Andreas, thanks for the list of specimens.  \nDo you know in which library the Theinhardt Probe from 191? can bee seen?\n\nThe only Theinhardt specimen I found so far is from c. 1895, with a sans serif which looks like an (earlier and therefore a little bit clumsier) proto-version of Akzidenz-Grotesk, but this is not called Royal Grotesk but rather Breite Grotesque. The specimen is in St Bride, London. Probably this is the direct predecessor of Royal-Grotesk and of Akzidenz Grotesk.\n\nI wished I could upload this specimen on this list to show you, but I don't have Flash 8.  \nTiffany, I just sent these two pictures to your e-mail adress. Could you please upload these two scans on this thread. I hope this works...\n\nHas anyone of you an answer for theses questions:  \nIs the 1899 specimen (shown in Manfred Klein: Type & Typographers) the earliest specimen of the Accidenz Grotesk? (Strangely enough in this advertisment in Deutscher Buch- und Steindrucker' in 1899 Accidenz-Grotesk is presented as a product of both H. Berthold, Berlin and Bauer & Co, Stuttgart. Has anyone an explanation for this?)  \nHow can Berthold sell the Accidenz-Grotesk already in 1899, when they actually bought the Theinhardt foundry in 1908? Is probably the date 1908 not correct? Or is there another explanation?\n\nUli, thanks for the scans. The 'a' without spur in 14 pt described by Erik is interesting.\n\n"
    },
    {
      "time": "2 Feb 2006 — 6:28pm",
      "content": "Type designers worldwide are busy making modern designs and here is yet another discussion of a musty old sans. Did the must first form in 1898 or was that 1901? I've heard that it really became musty after it was left in the rain on September 15, 1904.\n\n"
    },
    {
      "time": "2 Feb 2006 — 8:13pm",
      "content": "How many new designs, rather than revivals, since 1904 have introduced new kinds of excellence in roman letters? I can't think of any except Johnson's Underground, Gill's Solus, Lutetia and Romulus, Kennerley, Electra, Scala, and Bloemsma's Legato. Others might add Palatino or Koch Antiqua. Accidenz-Grotesk belongs with them, being the first type with its own kind of excellent plainness, and these designs are always going to be more interesting because more intensely imagined (even if by anonymous workmen) than contemporary riffs on them.\n\n"
    },
    {
      "time": "2 Feb 2006 — 10:51pm",
      "content": "<cite>“halbfett” is the German word for bold<br>\n“fett” is black</cite>\n\nDan, that is actually not true. Halbfett (meaning \"half fat\") used to be Medium, as in Akzidenz Grotesk Halbfett. AG Fett is Bold and there is no Black, but a Super. Black is a fairly new title, in German the weights used to go from Mager to Normal to Buch to Halbfett to Fett to Extrafett. AG has the Buch (Book) missing, since the Normal (Regular) is heavy enough. Futura has a Buch between Mager (literally: Lean, we stay within the food categories, as suggested by a \"weight\" classification) and Halbfett, which really isn’t bold at all. They even added a DemiBold, which in German was called Dreiviertelfett (Threequarter Fat) See [neufville](http://web.archive.org/web/20150408010007/http:/www.neufville.com/uk/startfuk.htm).\n\nBut now we have at least 7 weights, so we need numbers, or – best still – our eyes.\n\n"
    },
    {
      "time": "3 Feb 2006 — 12:30am",
      "content": "ok, now I got the pictures ...\n\nHere's the Theinhardt specimen from c. 1895,  \nwith the Breite Grotesk, a sans serif which looks like an (earlier and therefore a little bit clumsier) proto-version of Akzidenz-Grotesk. The specimen is in St Bride, London. Probably (?????) this is the direct predecessor of Royal-Grotesk and of Akzidenz Grotesk.\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/Theinhardt1.jpg)\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/Theinhardt2.jpg)\n\n"
    },
    {
      "time": "3 Feb 2006 — 12:34am",
      "content": "... and this is the abvertisment in 'Deutscher Buch- und Steindrucker' in 1899 which shows Accidenz-Grotesk. Strangely enough Accidenz-Grotesk is presented by both H. Berthold, Berlin and Bauer & Co, Stuttgart. (From: Manfred Klein: Type & Typographers)\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG_.jpg)\n\n"
    },
    {
      "time": "3 Feb 2006 — 5:54am",
      "content": "This thread has wiki written all over it.\n\nChrisL\n\n"
    },
    {
      "time": "3 Feb 2006 — 6:26am",
      "content": "already done, dez. Check it: [Akzidenz Grotesk](http://web.archive.org/web/20150408010007/http:/www.typophile.com/wiki/Akzidenz%20Grotesk).\n\n"
    },
    {
      "time": "3 Feb 2006 — 7:57am",
      "content": "Paul,  \nYou ole' gunslinger--fast on the draw dude :-)\n\nChrisL\n\n"
    },
    {
      "time": "3 Feb 2006 — 9:23am",
      "content": "_Strangely enough Accidenz-Grotesk is presented by both H. Berthold, Berlin and Bauer & Co, Stuttgart._\n\nThat is _not_ strange. On 9 November 1897, H. Berthold bought Bauer & Co in Stuttgart.\n\nIn 1896 Berthold decided to release more typefaces for advertising, in the German tradition of narrow, black faces with hardly any descenders. The first one was Carola, a brush face with strong Art Noveau overtones, designed by Heinrich Hoffmann. This was the mother of later designs like Herkules and Herold.  \nThe anniversary book from 1921 shows Accidenz-Grotesk, simply stating that it was issued in 1898, and that \"these days one would perhaps make it look a little more modern\", but that all its imitators had never emulated it.  \nI have a picture of Berthold’s family tree and should manage to scan it by this weekend.\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/berthold_accidenz.jpg)\n\n"
    },
    {
      "time": "3 Feb 2006 — 11:11am",
      "content": "wolfgang: Such type specimens are hard to find. Due to the two world wars, mostly all German public libraries don't have such old books. So my [two cents](http://web.archive.org/web/20150408010007/http:/typophile.com/node/17689) try to watch ebay regularly and have some money you don't need.\n\nMy Theinhardt specimen have no date like most of the specimens of this time. It shows also:\n\nSchmale magere Grotesk  \nEnge fette Grotesk  \nFette Grotesk\n\nYour \"Breite-Grotesque\" looks very close to the \"Halbfette Accidenz-Grotesk\" of my specimen. The e and r are a bit different.\n\nA good place is the special department for type specimens of the [Deutsche Buecherei](http://web.archive.org/web/20150408010007/http:/www.typophile.com/wiki/Deutsche%20Buecherei) at Leipzig, Germany. But its not really public. You have to made an registration first and you should inform what you are looking for in advance. So if you hope to look around, you will get nothing.\n\n-- [astype.de](http://web.archive.org/web/20150408010007/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "3 Feb 2006 — 12:02pm",
      "content": "_here is yet another discussion of a musty old sans._\n\nWell James, start a thread on something fresh.\n\n"
    },
    {
      "time": "3 Feb 2006 — 6:36pm",
      "content": "\\> I have a picture of Bertholds family tree and should manage to scan it by this weekend.\n\nI am looking forward to see this.\n\nIn the meantime to keep the audience entertained, here's another specimen. This specimen doesn't say when it was published, but it must have been the Akzidenz Grotesk at Berthold before the 57 and 58 version, which Uli posted above, was released.  \nThe typeface of the 57 and 58 seems to be partly based on the version in this specimen.\n\nAkzidenz Grotesk von Berthold (Probe 429) Akzidenz-Grotesk  \n(this specimen is in the Type Museum, London)\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG1.jpg)\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG2.jpg)\n  \nThe following Typefaces are shown in this specimen:\n\nAkzidenz-Grotesk mager (Royal-Grotesk)\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG3.jpg)\n\nAkzidenz-Grotesk\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG4.jpg)\n\nAkzidenz-Grotesk halbfett\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG5.jpg)\n\nAkzidenz-Grotesk fett\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG6.jpg)\n\nAkzidenz-Grotesk eng\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG7.jpg)\n\nAkzidenz-Grotesk schmal mager\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG7a.jpg)\n\nAkzidenz-Grotesk schmal halbfett (Steinschrift eng)\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG8.jpg)\n\nAkzidenz-Grotesk schmal fett (Buecher-Grotesk halbfett)\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG9.jpg)\n\nAkzidenz-Grotesk Skelett\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG10.jpg)\n\nAkzidenz-Grotesk breit mager\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG11.jpg)\n\nAkzidenz-Grotesk breit\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG11a.jpg)\n\nAkzidenz-Grotesk breit fett\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG12.jpg)\n\nLiliput-Grotesk  \n(The picture of the Liliput-Grotesk is much more enlarged, compared to the other pictures.)\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/AG13a.jpg)\n\nAnd this is what G. G. Lange (the artistic director of Berthold from 1960 until Berthold closed down) said about the different versions (see Typographische Monatsblaetter 2 2003, pp 24-25) (my translation from German):\n\nAkzidenz-Grotesk mager (Royal-Grotesk):  \n'A delicate, light version, which stemmed from 'the punchcutter of the King', Ferdinand Theinhardt. His foundry came to Berthold in 1908. It was always said that this Grotesk was an anonymous design, but now it is clear that it is actually the Theinhardt Grotesk. The Royal-Grotesk was used for printed matter for the King and for scientific printing.  \nIn addition to this version, Theinhardt also had normal, halbfett [semibold] and fett [bold] ... The Royal-Grotesk was later called Akzidenz Grotesk mager'\n\n'Whereas the schmale [condensed] Buecher-Grotesk from 1896 is an independent typeface. Later this typeface became Akzidenz-Grotesk schmal fett.'\n\n'The former Steinschrift became the schmale Akzidenz-Grotesk. ... The Liliput Grotesk in 4 pt was also used for these purposes [security printing]\n\nBTW:  \nG. G. Lange said also in this article (in fact, it was an interview) that Herman Zapf worked on the redesign of the Akzidenz-Grotesk for the Linotype typesetting machine. (Can anyone see any Zapf in the Akzidenz Grotesk?) The version for the Linotype typesetting machine was for the smaller sizes from 6 to 12 pt. The name 57 and 58 is indicating the year of release of the revised Akzidenz-Grotesk.  \nI am not sure if this new version is already shown in this specimen. I tend to believe that the specimen uploaded by Uli rather shows this new version with some Zapf in it.\n\nAll in all, Uli's version is much more homogenised than this one. The theory of heterogenous origins for the Akzidenz-Grotesk looks much more plausible in this specimen.\n\n"
    },
    {
      "time": "4 Feb 2006 — 3:04am",
      "content": "In this interview, G. G. Lange (see Typographische Monatsblaetter 2 2003, pp 24-25) did not mention Poppelbaum foundry at all, but he also doesn't say from which foundry schmale [condensed] Buecher-Grotesk and Steinschrift came. Probably one of these two is from Poppelbaum (?). I am only assuming things. In Vienna, in the Oesterreichische Nationalbibliothek [Austrian National Library], there is a Poppelbaum type specimen from c. 1910, but I haven't seen it yet:\n\nProbenbuch. K. und k. Hof-Schriftgießerei Poppelbaum. Wien V. - (Wien, Poppelbaum um 1910.) (ca. 250 Bl.)&nbsp;\n\nIt would be interesting to have a look at this specimen...\n\n"
    },
    {
      "time": "4 Feb 2006 — 9:24am",
      "content": "\\> All in all, Uli’s version is much more homogenised than this one.\n\nAfter comparing \"Specimen Nr. 473\" more closely with \"Hauptprobe Nr. 470\", I think that \"Specimen Nr. 473\" was issued circa 1966. In \"Hauptprobe Nr. 470\", only \"Extrafett\" is missing. All other cuts were already available. \"Hauptprobe Nr. 470\" came out shortly before \"Specimen Nr. 473\", presumably in the same year.\n\nWho needs reproductions of the various AG alphabets in very large points sizes, i.e. up to 60 points, should use the German translation of Ben Rosen's \"Typos\", which was published in 1964 in Ravensburg as \"Das große Buch der Druckschriften\", edited by Kurt Weidemann.\n\nI have just uploaded at\n\n[http://www.sanskritweb.net/fontdocs/#Akzidenz](http://web.archive.org/web/20150408010007/http:/www.sanskritweb.net/fontdocs/#Akzidenz \"http://www.sanskritweb.net/fontdocs/#Akzidenz\")\n\na comprehensive document displaying the \\*final\\* versions of Akzidenz-Grotesk published shortly before the bankruptcy of the Berthold stock corporation. Note that these old fonts did not comprise the entire 1252 character set, e.g. Icelandic Eth and Thorn and the currency symbols Cent and Florin were missing in all Berthold fonts.\n\n"
    },
    {
      "time": "4 Feb 2006 — 1:03pm",
      "content": "Seeing those scans makes me long for the days when there actually were specimen books. Online search is nice and all but a well printed book speaks to me.\n\nChrisL\n\n"
    },
    {
      "time": "4 Feb 2006 — 1:05pm",
      "content": "chris, have you seen the [Indie Fonts](http://web.archive.org/web/20150408010007/http:/www.typophile.com/wiki/Indie%20Fonts) books?\n\n"
    },
    {
      "time": "4 Feb 2006 — 1:27pm",
      "content": "Paul,  \nI have Indie 2 and love it! Very well done, the kind of book that gets the printers ink flowing in my veins :-)\n\nChrisL\n\n"
    },
    {
      "time": "4 Feb 2006 — 8:53pm",
      "content": "Ok-  \nSo what about the Karl Gerstner version then?\n\nOpinions?\n\n"
    },
    {
      "time": "5 Feb 2006 — 3:43am",
      "content": "\\> Linotype typesetting machine was for the smaller sizes from 6 to 12 pt.\n\nI've now also uploaded old specimens of the line-casting font versions.\n\n[http://www.sanskritweb.net/fontdocs/#Akzidenz](http://web.archive.org/web/20150408010007/http:/www.sanskritweb.net/fontdocs/#Akzidenz \"http://www.sanskritweb.net/fontdocs/#Akzidenz\")\n\n"
    },
    {
      "time": "5 Feb 2006 — 5:50am",
      "content": "\\> So what about the Karl Gerstner version then?\n\nGerstner was not an accomplished type designer,  \nas one can see when looking at Gerstner Original  \n [http://www.bertholdtypes.com/bq\\_library/90012.html](http://web.archive.org/web/20150408010007/http:/www.bertholdtypes.com/bq_library/90012.html \"http://www.bertholdtypes.com/bq\\_library/90012.html\")  \nbut he was for sure one of the best graphic designers and typographic designers of his time.\n\nHe was obsessed with a systematic approach to design.  \nHis grid systems were much more flexible  \n(and therefore more complicated) than those of most of his fellow designers.  \nIf you want to see and read Gerstner at his best I recommend his book  \nKarl Gerstner: Programme entwerfen / Designing programmes  \n(Its out of print, but sometimes you can find it in antiquarian bookshops.)\n\nHe also worked as a fine artist. His hard-edge paintings were always based on geometric constructions, and permutation was also quite important for him.\n\nBeing a Swiss typographer he loved Akzidenz Grotesk, whereas Univers was a little bit too smooth and polished for his taste. But he did appreciate the systematic way in which the different weights and widths of Univers were organised: Univers light was 45, regular was 55, semibold was 65. Univers regular italic was 46, and so on - we know it.\n\nGerstner took the Akzidenz Grotesk and squeezed it into a similar system like Univers.\n\nG. G. Lange said in the interview (see Typographische Monatsblaetter 2 2003, pp 24-25) about Gerstners Akzidenz-Grotesk:\n\n'He let Christian Mengelt design it in his studio, and he started with something entirely wrong: He modified the typeface by stretching it. Therefore the shapes had the usual distorted curves. ... Eventually the typeface was called Gerstner Programm, because it was based on his concept. ... The typeface was not available commercially.'\n\nAn early case of multiple master and automatic slanting without any optical corrections, as it seems\n\nIn Programme entwerfen there is an entirely chapter about Gerstners Akzidenz Grotesk.  \nI suppose you can see his version of Akzidenz Grotesk also in this book about Gerstner  \n [http://www.amazon.com/gp/product/3775790594/sr=1-2/qid=1139145004/ref=sr...](http://web.archive.org/web/20150408010007/http:/www.amazon.com/gp/product/3775790594/sr=1-2/qid=1139145004/ref=sr_1_2/002-4582731-3599244?%5Fencoding=UTF8 \"http://www.amazon.com/gp/product/3775790594/sr=1-2/qid=1139145004/ref=sr\\_1\\_2/002-4582731-3599244?%5Fencoding=UTF8\")  \nUnfortunately the latter is set in Gertner Original.\n\nI do not know whether Gerstner ever intended to publish his version of Akzidenz Grotesk commercially or whether he saw it rather as some sort of experimental design exercise.\n\n"
    },
    {
      "time": "5 Feb 2006 — 6:42am",
      "content": "_whether Gerstner ever intended to publish his version of Akzidenz Grotesk_\n\nIt was used to set the book _Kompendium für Alphabeten_, on Diatype, with correction stripped in with pieces of film, showing up very obviously. This is another one of the books disappeared from my shelves. There was even an english version (Compendium for Literates), but too busy to look if it still exists. Apparently it’s been republished in 2000, but not set in Gerstner Programm anymore: [http://www.amazon.de/exec/obidos/search-handle-form/303-7549216-3650612](http://web.archive.org/web/20150408010007/http:/www.amazon.de/exec/obidos/search-handle-form/303-7549216-3650612 \"http://www.amazon.de/exec/obidos/search-handle-form/303-7549216-3650612\")\n\n"
    },
    {
      "time": "5 Feb 2006 — 8:14am",
      "content": "Thanks for that Wolfgang  \nI have Designing Programmes, and knew it was made for Diatype (I'm old, not as old as Erik, but old), but was unaware whether it had been available commercially.  \nThe Lange quote was insightful.\n\nThanks,  \nNorman\n\n"
    },
    {
      "time": "5 Feb 2006 — 9:57am",
      "content": "It's interesting to see Karl's mind at work in the programatic development of a logo--and to see the form locked up for letterpress.\n\nChrisL\n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/Gerstnaer%20programme.png)\n  \n\n ![](http://web.archive.org/web/20150408010007im_/http:/typophile.com/files/gerstner-cover.png)\n\n"
    },
    {
      "time": "4 Apr 2006 — 1:57pm",
      "content": "erik, any luck on the Berthold family tree image? I'd be very interested in seeing it. thanks for any insight.\n\n"
    },
    {
      "time": "11 Apr 2006 — 11:12pm",
      "content": "_erik, any luck on the Berthold family tree image?_\n\nSorry, but i'm still in San Francisco, a few thousand miles away from my library in Berlin. And  \nI'm not even sure where all my Berthold specimen books are. Must have lent them to someone or they could still be in a box in the cellar. I'll be moving house again later this year: a chance to go through the boxes again.\n\nI will look for the family tree.\n\n"
    },
    {
      "time": "24 Apr 2006 — 12:44pm",
      "content": "A related topic is active in [http://typophile.com/node/19482](http://web.archive.org/web/20150408010007/http:/typophile.com/node/19482 \"http://typophile.com/node/19482\")  \n(on the German Grotesk typology and its relevance in the early years of sanserif)\n\n"
    },
    {
      "time": "28 Sep 2006 — 11:34am",
      "content": "I just got back from some personal time with the copy of _Haus Berthold_ in the Library of Congress. I've just posted some images from the book at [http://www.jpad.biz/pdfs/selections-from-haus-berthold.pdf](http://web.archive.org/web/20150408010007/http:/www.jpad.biz/pdfs/selections-from-haus-berthold.pdf)\n\nIncluded are:  \n- The Berthold Family tree spread, in full color  \n- The short chronology that ends the book (From a photocopy)  \n- The AG and Theinhardt pages. (From a photocopy.)\n\nPlease don't ask me questions about the text. I don't know German, so any translation I provide would be extremely bad.\n\nI've also photographed the entire book, and will be putting together a digital facsimile soon. Unfortunately I had to shoot the book with an automatic camera under fluorescent light with no flash, so the shutter speed was too slow and some pages are blurry. After I've had time to clean it up in Photoshop and possibly reshoot the pages that didn't come out (I'm taking a mini-tripod next time!) I'll post the entire book.\n\n"
    },
    {
      "time": "28 Sep 2006 — 11:48am",
      "content": "Thanks James! We thank you for your efforts!\n\nChrisL\n\n"
    }
  ]
}
