{
  "id": "17651",
  "title": "Typographic Printing Wish List",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "You know when you get one of those sample kits from printers in the mail and they don’t really say much about printing? Well, that may all soon change if I get my way with this one. So far, the client has let me include whatever I want. So far they are grouped into cards by category. Color printing, measurements, paper sample, etc.\n\nAnd of course there is a typography card. I have quite a few ideas already, but if you could have any information about digial color printing (as is pertains to type) for reference at your fingerprints what would it be? Some I have, for example, are 1) pixelated vs. vector type 2) outlining type 3) type sizes, etc. These could be anything applicable. File setup, how things print, color, etc.\n\nWhat’s on your wishlist?\n\nShu\n\n [‹ Type Specimen Copy](http://web.archive.org/web/20080829111012/http:/www.typophile.com/node/17648 \"Go to previous forum topic\") [Flash type tester/viewer ›](http://web.archive.org/web/20080829111012/http:/www.typophile.com/node/17611 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080829111012/http://www.typophile.com/user/6235\" title=\"View user profile.\">Shu</a>",
  "time": "<br>",
  "uid": "6235",
  "comments": [
    {
      "time": " 31.Jan.2006 3.15pm",
      "content": "This would/will be great for students also: Include samples of trapping type. Butt, choking and spreading.\n\n"
    },
    {
      "time": " 31.Jan.2006 11.15pm",
      "content": "Butt, choking, and spreading... I will have to see if that sounds the same after some sleep.\n\nYou have a good start Shu. I was about to say I would like to see the differences from direct to plate vs conventional stripping, but you mentioned it is all digital. The paper quality and characteristics and how they affect the type at different sizes are probably the most important and interesting. Hopefully you will get a nice selection and variety to work with.\n\nRob\n\n"
    }
  ]
}
