{
  "id": "17653",
  "title": "New OpenType Handwriting Font Released by Ascender",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20070811070841/http:/typophile.com/user/108 \"View user profile.\") : 31.Jan.2006 3.50pm \n\n· · · · · · · · · · · · · · · · · · · ·  \nLindsey™ Pro is a new casual script font with advanced OpenType features\n\nELK GROVE VILLAGE, IL - Feb 1, 2006 - Ascender Corporation, a leading provider of advanced font products today announced the release of its second original OpenType Pro typeface. Lindsey™ Pro is a new font created by Steve Matteson, Ascender’s Type Director, based on a teenager’s handwriting. Lindsey Pro is available now for $30.00 with immediate software download from the Ascender Font Store ( [http://www.ascenderfonts.com](http://web.archive.org/web/20070811070841/http:/www.ascenderfonts.com/ \"http://www.ascenderfonts.com\")).\n\n· · · · · · · · · · · · · · · · · · · ·  \nLindsey Pro is a casual script typeface design with irregular alignments and occasional connections. It was designed with a variety of alternative letter shapes and ligatures that add randomness to text using advance typographic OpenType features making this a convincing hand-lettered design. This requires an application that supports advanced OpenType features, such as InDesign CS, QuarkXPress7 and Microsoft Expression.\n\n“Lindsey Pro is a fun font to use in greeting cards, invitations, memos, signs and correspondence” said Steve Kuhlman, Vice President of Ascender. “It’s also a perfect font to express yourself on Valentine’s Day” he added.\n\nLindsey Pro is available in both PostScript (OTF) and TrueType (TTF) flavors of OpenType for Macintosh OS X and Windows 2000, ME or XP. It retails for $30.00 and can be purchased and downloaded from the Ascender Font Store ( [http://www.ascenderfonts.com](http://web.archive.org/web/20070811070841/http:/www.ascenderfonts.com/ \"http://www.ascenderfonts.com\")).\n\nA PDF brochure of Lindsey Pro can be viewed here: [http://www.ascendercorp.com/pdf/lindsey.pdf](http://web.archive.org/web/20070811070841/http:/www.ascendercorp.com/pdf/lindsey.pdf \"http://www.ascendercorp.com/pdf/lindsey.pdf\")\n\n· · · · · · · · · · · · · · · · · · · ·  \nAbout Ascender Corporation  \nAscender Corporation is a leading provider of advanced font products specializing in font design, development and licensing. Ascender’s founders are font industry experts, and have been involved in developing some of the most important and influential fonts used in computers, phones and printers. Ascender provides multilingual, custom font development for enterprises and hardware & software developers. Ascender also provides high quality fonts for immediate download from the Ascender Font Store website.\n\n· · · · · · · · · · · · · · · · · · · ·  \nContact:  \nBill Davis  \nAscender Corporation  \n25 Northwest Point Blvd, Suite 975  \nElk Grove Village, IL 60007 USA  \nPhone: (847) 357 0730 ext. 10  \nFax: (847) 357 0731\n\n",
  "author": "<a href=\"http://web.archive.org/web/20070811070841/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 31.Jan.2006 3.50pm",
  "uid": "108",
  "comments": [

  ]
}
