{
  "id": "17675",
  "title": "Typophile Search plugin for Firefox/Mozilla",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "It’s been a while that I wanted to try and create a [search plugin](http://web.archive.org/web/20070811195537/http:/mycroft.mozdev.org/contribute.html) for Firefox/Mozilla. The linked site mentions it has to be a “GET” method page, but since Typophile’s search function doesn’t show anything in the URL, I’m not even sure it’s possible.\n\nSo, Punchcut people, is it possible? Or is Typophile’s super-search too much for poor Mozilla to handle? :)\n\nEDIT: I wrote the code for the search and tried [testing](http://web.archive.org/web/20070811195537/http:/www.mindzilla.com/auditform.php) it but as expected it didn’t work. If anyone thinks this is an interesting idea, I’ll gladly post the code here (it’s simple and short).\n\n [‹ After a type designer in the UK](http://web.archive.org/web/20070811195537/http:/typophile.com/node/17618 \"Go to previous forum topic\") [Book which compares the fonts of different factories ›](http://web.archive.org/web/20070811195537/http:/typophile.com/node/17609 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070811195537/http://typophile.com/user/5081\" title=\"View user profile.\">gabrielhl</a>",
  "time": "<br>",
  "uid": "5081",
  "comments": [
    {
      "time": " 1.Feb.2006 8.56pm",
      "content": "I know a while ago, before the official search was working, Grant wrote something for Safari. I wonder where that went. I have it at the office. I’ll post the link tomorrow.\n\n"
    },
    {
      "time": " 1.Feb.2006 10.43pm",
      "content": "Gabriel,\n\nI had run into a similar problem in enabling a search from the Typophile OS X Widget- it too needed a GET method instead of POST. I spoke with Christian about it and I got the impression there was a security reason for handling it so.\n\nGrant’s workaround used Google to search the site.\n\nI’ll follow up with CR again to see what the verdict is/was.\n\nJared\n\n"
    },
    {
      "time": " 2.Feb.2006 2.34am",
      "content": "Miss Tiff, do you mean the Bookmark with the “Search Typophile” popup? I have that too, and it works in FF as well, but I wanted to try and avoid Google since the Typophile search looks so much better :)\n\nJared, thank you. I’m on a PC so I’ve never tried the Widget. Maybe the workaround used for it would work for this too? The Mozilla search plugin is Sherlock-based.\n\n"
    }
  ]
}
