{
  "id": "1767",
  "title": "Adam Stevenson Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm doing a logo for myself. I like the idea of the A and S combining to form one solid logo.   \n   \nI basically do cartooning and illustrations, along with basic graphic design. I feel like there's something missing. I created this logo with custom strokes. Please any suggestions with fonts or anything. Thanks.   \n   \n ![](http://web.archive.org/web/20140805004017im_/http:/www.typophile.com/forums/messages/29/19061.gif)   \n   \n-Adam\n\n",
  "author": "signs79",
  "time": "22 Oct 2003 — 1:37pm",
  "uid": "2214",
  "comments": [
    {
      "time": "22 Oct 2003 — 2:08pm",
      "content": "The \"A\" is harder to see.   \n   \nIt's pretty. Just know that -to me at least- it seems most like a slaughtered star. Making it not red would move it away from that.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Oct 2003 — 1:38am",
      "content": "Hi Greg,   \n   \nI clearly see the \"A\", but narrowing the upper \"S\" curve - so that it no longer crosses the \"A\" - _could_ make the \"A\" even easier to recognize. (I don't know if that's a good idea.)   \n   \nI guess you made the upper \"S\" curve flat on top to get a straight \"A\" cross bar. A slightly more curved upper \"S\" I _might_ like more, though.   \n   \nhhp isn't so wrong when he's reminded of blood smeared on a wall.   \n   \nI'm not sure whether I like the grey shadow. The logo looks handwritten and the 3D shadow _maybe_ doesn't fit in this idea. It makes the stroke ends quite frayed, too.   \n   \njpg\n\n"
    },
    {
      "time": "26 Oct 2003 — 6:00pm",
      "content": "i only see a bleeding K..   \ni must be blind\n\n"
    },
    {
      "time": "26 Oct 2003 — 7:32pm",
      "content": "Hi Greg.   \n   \nYou have a fine idea working. However, this logo looks like it was done in illustrator version 8+ with one of the standard brush effects. I'd suggest doing it with an actual brush. Do 100 different versions. Not happy? Do a hundred more. Bing Bing Bing. Rip them out. Then pick the best one. Try different papers/surfaces. You might be so happy with the personality of the new mark, that it can live without a drop shadow.   \n   \nAs a general rule: computer effects meant to simulate the real thing are seldom as nice as the thing itself. If you want a photocopied look, use a photocopier. If you want a brushed look, use a brush. Don't let the computer limit you. Go for it!   \n   \nRandy\n\n"
    },
    {
      "time": "28 Oct 2003 — 5:59pm",
      "content": "reminds me of the lockheed logo a bit ![:-)](http://web.archive.org/web/20140805004017im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nhildebrant.\n\n"
    }
  ]
}
