{
  "id": "17673",
  "title": "Rebuilding Printer of Display Fonts",
  "forum": "Build",
  "tags": [

  ],
  "content": "So it seems that I for some reason have a large number of fonts that are either missing their postscript printer or display partner. What is the easiest, and most cost effective way of rebuilding the missing font data fork and and pairing them together again?\n\n",
  "author": "<a href=\"/web/20110902121052/http://typophile.com/user/11282\" title=\"View user profile.\">track and kern</a>",
  "time": "<br>",
  "uid": "11282",
  "comments": [
    {
      "time": "",
      "content": "\"missing font data fork\" is quite the misnomer, but appears to indicate that you're talking about Mac OS PostScript Type 1 fonts. If that's the case, and you still have the Type 1 font, you're in luck - many Mac OS X applications will use that without a \"screen\" or \"display\" font. Older QuickDraw-based applications will not, but some newer ones will.\n\nIf you have the Type 1 font, go look at the vendor's Web site - many of them make at least one bitmap suitcase available free of charge. Adobe's old \"Type on Call\" CDs included free bitmap fonts (up to 24 point) for all of their Type 1 fonts, because without the PostScript fonts, you couldn't get high-resolution output anyway. You might be able to download or request a vendor suitcase that solves your problem.\n\nIf you're missing the Type 1 part, good luck - that's the part they never give away. If you have a receipt, some vendors might let you have a new copy of the font, or send a replacement disc, but most probably won't. With luck, you're only missing bitmap fonts, and those are easier to replace.\n\n--Matt\n\n"
    },
    {
      "time": "",
      "content": "I may be stating the obvious, but you could always talk to the vendor from whom you licensed the type to begin with. Perhaps they'll give you new versions. :^/\n\n"
    },
    {
      "time": "",
      "content": "sorry for the confusion. I know type from the design end, not the software end, i'm still learning. apparently I have a mixed lot, some of my fonts are missing their postscript pairs, which I am understanding I will more than likely not be able to get, were as the ones that are only missing their bitmap or screen partners will likely be able to be attained. Thanks for your advice, and I will try to contact the vendor.\n\n"
    },
    {
      "time": "",
      "content": "_...you still have the Type 1 font, you’re in luck - many Mac OS X applications will use that without a “screen” or “display” font._\n\nThat may be true, but the style links and kerning will be missing.\n\n"
    }
  ]
}
