{
  "id": "17681",
  "title": "Adding language/hyphenation dictionaries to InDesign",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Does anybody know where I should look to find Central European dictionaries for Adobe InDesign (CS1). Can i find these somewhere on the software? do i need to purchase them from Adobe? I'm hoping someone here has an answer...\n\n",
  "author": "paul d hunt",
  "time": "2 Feb 2006 — 7:27am",
  "uid": "7006",
  "comments": [
    {
      "time": "2 Feb 2006 — 7:43am",
      "content": "InDesign (Mac)/Edit (Windows) \\> Preferences \\> Dictionary\n\n"
    },
    {
      "time": "2 Feb 2006 — 7:46am",
      "content": "thnx, david. i know how to change dictionaries, but i only get a list of Western European languages (English, French, Dutch, Swedish, Spanish, &c.) No CE languages, ie Czech, Polish, &c.\n\nP.S. on Win XP here\n\n"
    },
    {
      "time": "2 Feb 2006 — 8:00am",
      "content": "I think that you need to find the dictionary file - .udc or .not extension;\n\n"
    },
    {
      "time": "2 Feb 2006 — 8:11am",
      "content": "hmmm... well doing a bit of digging i found  \nC:\\Program Files\\Common Files\\Adobe\\Linguistics\\Providers\\Proximity\\pol.hyph, which i'm guessing is a hyphenation dictionary for Polish. But now how do i access it?\n\n"
    },
    {
      "time": "2 Feb 2006 — 8:13am",
      "content": "CE dictionaries are included in CS Central European version and in [CS2 version.](http://web.archive.org/web/20150323000431/http:/www.adobe.com/support/downloads/detail.jsp?ftpID=3168)  \nSome people used old Proximity dictonaries with Roman InDesign versions, but i don't know about their origin.\n\n[Here](http://web.archive.org/) some standalone hyphenation application Dashes Pro from CircleNoEtics.\n\n"
    },
    {
      "time": "2 Feb 2006 — 8:20am",
      "content": "If memory serves in order to get more than the standard dictionaries you'll have to go into the \"options\" of the InDesign installer and enable the languages you need.\n\n"
    },
    {
      "time": "2 Feb 2006 — 9:05am",
      "content": "okay, i did it! here's what i did:\n\ni went to the folder i previously mentioned (C:\\Program Files\\Common Files\\Adobe\\Linguistics\\Providers\\Proximity\\) and copied the following files: pol32.clx, pol103.lex, pol.hyp & polphon.env. I then opened the following folder: C:\\Program Files\\Adobe\\Adobe InDesign CS\\Plug-Ins\\Dictionaries\\Proximity and pasted in these files. Now I get Polish from my drop-down language menu. Thank you all for helping me to work my way through this.\n\n"
    },
    {
      "time": "2 Feb 2006 — 6:54pm",
      "content": "I wouldn't consider this a Build question, since it has to do with typesetting and text processing not with font making.\n\n"
    },
    {
      "time": "2 Feb 2006 — 7:14pm",
      "content": "\"it has to do with typesetting and text processing not with font making.\"\n\nBut if you are testing your type designs in foreign languages, it certainly would help. Besides, the real geeks hang out in this forum John and some of them are Central European :-)\n\nWay to go cowboy!\n\nChrisL\n\n"
    },
    {
      "time": "2 Feb 2006 — 7:14pm",
      "content": "well in the strict sense, this isn't a build question. however, my understanding is that all technical software questions are filed under the build section for lack of a better forum for these types of questions. for example: [Batch Printing Help](http://web.archive.org/web/20150323000431/http:/typophile.com/node/17115), [Pattern Fill in InDesign](http://web.archive.org/web/20150323000431/http:/typophile.com/node/17032) & [Drive Failing --\\> Can't copy files](http://web.archive.org/web/20150323000431/http:/typophile.com/node/16850) aren't _build_ threads either, but they can all be found in this forum section. If you have a suggestion and rationale for where these types of threads would be better archived, i'd be glad to hear it.\n\n"
    },
    {
      "time": "3 Feb 2006 — 6:06am",
      "content": "I vote we keep them here. There is no overload problem in this forum so we do not need a seperate category for \"other technical stuff that is not quite type design build material\".\n\nChrisL\n\n"
    }
  ]
}
