{
  "id": "17687",
  "title": "\"Settlers\" title font help",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey all, I have this great opportunity coming up where i have alot of creative freedom to make a title sequence for a show called \"Settlers\".  \nIm a little stuck for ideas as they want it to have a more contempory feel.The main ideas being \"firmly grounded\" and bringing the past into the present, as opposed to taking the viewer back in time.  \nI have attatched some crap i thought of but Any fonts or suggestions would be great.\n\n| Attachment | Size |\n| --- | --- |\n| [titleideas.jpg](http://web.archive.org/web/20150416054205/http:/typophile.com/files/titleideas.jpg) | 33.08 KB |\n\n",
  "author": "guncry",
  "time": "2 Feb 2006 — 1:22pm",
  "uid": "9952",
  "comments": [
    {
      "time": "2 Feb 2006 — 4:21pm",
      "content": "Maybe you should start by creating a logotype. And then let the motion of it all be inspired from that. As they stand, your two choices seem more historic than modern.\n\n"
    },
    {
      "time": "3 Feb 2006 — 1:22am",
      "content": "Why not try to figure out the animation sequence first and maybe a typeface will occur to you.\n\n"
    },
    {
      "time": "3 Feb 2006 — 4:04am",
      "content": "What's the show about?  \nTim\n\n"
    },
    {
      "time": "6 Feb 2006 — 1:01pm",
      "content": "The show consists of celebrities discussing there heritage,how certain personality traits they have, may have come from there ancestral background.  \n\"What did the Settler's contribute to the modern Kiwi personality?\"\n\nI have thought about the above comments and they have both helped,  \nanother idea i had was to show the letters grown out of the \"S\" so each letter represents a generation..which inturn has come back to the last \"S\"?...so maybe a font which has character that is strongly revolved around the curves of an \"S\".\n\n"
    },
    {
      "time": "8 Feb 2006 — 11:57am",
      "content": "[http://www.bbc.co.uk/history/familyhistory/index\\_gs.shtml](http://web.archive.org/web/20150416054205/http:/www.bbc.co.uk/history/familyhistory/index_gs.shtml \"http://www.bbc.co.uk/history/familyhistory/index\\_gs.shtml\")\n\nThis show has rather a nice graphic based on a similar idea.  \nTim\n\n"
    }
  ]
}
