{
  "id": "17682",
  "title": "Directions –&nbsp;ideas?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am working on a document that involves copy that is basically just directions written down how you would say them eg Go to the bottom of x road, turn left. Take a right along the enbankment etc.\n\nI dont want to just have it as an ordinary paragraph and as there is no higherarchy for headers/pull quotes etc im looking for other ideas to make it more interesing?\n\nI was thinking along the lines of using // instead of full stops or dingbat arrows?\n\nAnyone done anything similar or any ideas?\n\n [‹ Page layout programs used for Newspapers](http://web.archive.org/web/20080108175027/http:/www.typophile.com/node/17695 \"Go to previous forum topic\") [Survey Most Legible Serif and Sans Serif Web Font ›](http://web.archive.org/web/20080108175027/http:/www.typophile.com/node/17558 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080108175027/http://www.typophile.com/user/4510\" title=\"View user profile.\">stephen_k</a>",
  "time": "<br>",
  "uid": "4510",
  "comments": [
    {
      "time": " 2.Feb.2006 10.00am",
      "content": "Depending on the use to which the document is to be put you could do a [rally roadbook](http://web.archive.org/web/20080108175027/http:/rally-speed.tripod.com/Technic.htm), if it slightly less important to have the directions as useable as that, you could do a ’map’ with the directions following the roads from the top left corner to bottom right.  \nTim\n\n"
    },
    {
      "time": " 2.Feb.2006 10.20am",
      "content": "You could set it in roman U&lc, but have proper names, such as X ROAD in small caps, and geographical features, such as _the embankment_ in italic.\n\n(Sorry, X ROAD was supposed to be in small caps, but Typophile doesn’t support the “small” tag.)\n\n"
    },
    {
      "time": " 2.Feb.2006 3.06pm",
      "content": "Another tool, alternative to the slash, is the mid-dot to separate pieces of the direction in the paragraph.\n\n"
    },
    {
      "time": " 2.Feb.2006 3.16pm",
      "content": "How about just a bullet list? You could use dingbat arrows for bullets that went left or right depending on the turn.\n\nChrisL\n\n"
    }
  ]
}
