{
  "id": "17683",
  "title": "Rich Black - CMYK",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi All,\n\nApologies if this topic has been raised before (I've got a sneaking suspicion it might have been!), I googled and searched Typophile but couldn't find it mentioned. Anyway...\n\nQuestion: Can anyone recommend a really nice rich black out of CMYK? I know there are no hard and fast rules about this, so I thought that maybe someone out there has hit on a formula they could recommend.\n\nThanks very much!\n\nSi\n\n",
  "author": "Duckworth",
  "time": "2 Feb 2006 — 8:52am",
  "uid": "7561",
  "comments": [
    {
      "time": "2 Feb 2006 — 9:13am",
      "content": "Not only is this utterly subjective but it also depends on if you want/need a warm or cold black & what paper you are going to print to.\n\nPaper has color that affects the result & differing absorbancy too.\n\nAnd there are varnishes.\n\nDifferenet pressmen will give different results ( really! ) and different presses will too.\n\nThat said there may be formulas out there that certain people like...\n\nIt might be more useful to find a black \\*you\\* like & try to trace how it was made. If you do that 4 or 5 times you might begin to see some common traits - plus you will be relying on your own eyes rather than someone else's.\n\nAlso, keep in mind that there are different Pantone blacks out there than can be used apart from Standard 'K' plus the hexachrome model exists too.\n\nIt is a very complicated thing you are asking about!\n\n"
    },
    {
      "time": "2 Feb 2006 — 9:26am",
      "content": "[http://www.typophile.com/node/13795](http://web.archive.org/web/20150215223936/http:/www.typophile.com/node/13795 \"http://www.typophile.com/node/13795\")\n\n"
    },
    {
      "time": "2 Feb 2006 — 11:28am",
      "content": "Yes, the subject has been covered before: have you searched this site for \"rich black\"?\n\nAs to AN answer to your question (if you locate the other thread, you'll see that there wasn't much agreement) is that 40% Cyan + 100% Black works very nicely AND doesn't put too much ink on the paper. Other people have their own opinions; if any of them actually WORK IN A PRINT SHOP (which I do) and TALK TO PRESSMEN ON A DAILY BASIS (which I also do), then listen to what they have to say as well, and make up your own mind.\n\n"
    },
    {
      "time": "2 Feb 2006 — 11:58am",
      "content": "The one constant in almost all rich black formulas is 100% K with some sort of mixture behind it. If you look at the CMYK sliders in Photoshop you can see the undercoating to the left of the black slider. I recently did an ad with a black background and a really large blue logo. I normally like cold black but in this case it was eating up the logo so I mixed up a warm black. It helped a lot. The best advice here is talk to your printer. They will know what works for them…  \npeace\n\n"
    },
    {
      "time": "2 Feb 2006 — 2:55pm",
      "content": "I've usually done the 100%K 40%C method but some people also throw in 40% of Y and M.\n\nBig question is whether there will be any drop out type or line art within the black - in which case you might run into registration problems if you use too many tints to make it rich.\n\n"
    },
    {
      "time": "2 Feb 2006 — 7:11pm",
      "content": "Personally, I've had a lot of success with:\n\n70C  \n 50M  \n 30Y  \n100K\n\nIt might sound strange, but it makes a very dark (and only slightly cool) rich black.\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n [http://homepage.mac.com/mwebert](http://web.archive.org/web/20150215223936/http:/homepage.mac.com/mwebert \"http://homepage.mac.com/mwebert\")  \n [mwebert@mac.com](mailto:mwebert@mac.com)  \n--------------\n\n"
    },
    {
      "time": "3 Feb 2006 — 1:02am",
      "content": "From the \"gray balanced\" approach the best color is  \nCMYK=(60,40,40,100)\n\n"
    },
    {
      "time": "3 Feb 2006 — 1:13am",
      "content": "I was once working on a project where the initial designer wanted to use a rich black and knock out 6 point contest rules from it and the piece was being run on a high speed web press. I changed the background to a 10% cyan and printed the contest rules in black. Sometimes its not practical to use a rich black. Sure they could have run the job the way it was originally designed but with about 50% overages.\n\n"
    },
    {
      "time": "3 Feb 2006 — 1:27am",
      "content": "Wow! Great response!\n\nThanks all for the advice - I had an hunch this topic had come up before!\n\nI looked at the C40 M0 Y0 K100 split, (I think Printing.com recommended that), but I'm actually after a warm rich black. The job I'm intending to use the black on has got a logo reversed out in white and a URL strapline in 8pt white text on it... and nothing else, so there's a large amount of flat colour on it - I just didn't want to be disappointed with it printing out like a Quark black.\n\nThanks for all your suggestions!\n\nSi\n\n"
    },
    {
      "time": "3 Feb 2006 — 2:11am",
      "content": "With those specs I would go with a spot colour black like PMS 5c or even a double hit of black, if it has to be cmyk try M40%, K100%. The C40, K100 is the standard shiner split for offset litho.  \nTim\n\n"
    },
    {
      "time": "3 Feb 2006 — 6:01am",
      "content": "_70C  \n50M  \n30Y  \n100K_\n\nThe only problem with this formulation is that it equals 250%; long (forty-plus years) experience has taught me that coverage should not exceed 240%; otherwise, there is an increased tendency for press sheets to offset, and drying time is significantly extended.\n\n"
    },
    {
      "time": "3 Feb 2006 — 7:42am",
      "content": "That's some good info Nick, I've never heard that before! I shall keep it in mind for the future!\n\n"
    },
    {
      "time": "3 Feb 2006 — 8:00am",
      "content": "oldnick -  \nDon't a lot of these formulas seem a little hot? I try to stay 200 or under, but I could be wrong. With an ink density of 300, do you think that's reasonable? Part of the reason for this is that I send my stuff out all over the place and don't have time for a dialogue with all the vendors.  \nI just had a billboard job that asked for 100 100 100 100. I didn't believe it until I talked to their \"designer\" who confirmed that was what they wanted. They are using a color profile which you have to download. We shall see what the hard proof looks like…  \npeace\n\n"
    },
    {
      "time": "3 Feb 2006 — 8:39am",
      "content": "I have found that adding 30% of CMY is sufficient.\n\n"
    },
    {
      "time": "3 Feb 2006 — 8:54am",
      "content": "With a logo and some 8 pt text dropped out of the black I'd keep it simple.\n\n"
    },
    {
      "time": "3 Feb 2006 — 7:28pm",
      "content": "Give the text a 100% K 0.5 to 1 pt outline to prevent the other inks from swallowing your reversed text, however 8 pt white text on black is not likely to be safe.\n\nWho knows other printing tricks? I have heard that replacing magenta with orange ink can give a very nice effect but I have never seen it done.\n\nHéctor\n\n"
    },
    {
      "time": "3 Feb 2006 — 11:19pm",
      "content": "Off topic a little, but something always interesting, is adding a fluorescent booster to your CMYK, making it five instead of four color process. Typically this will take the form of a bright orange or violet, at about a 40% screen. Jobs that need to have very bright, vibrant blues, yellows, and greens can often gain a significant amount of color saturation by this addition. In contrast, brighter colors are not always easy to obtain with CMYK, but if your client absolutely has to have that green, or that red, and it is outside the normal CMYK gamut, suggest the addition of the fifth color (fluorescent booster).\n\n"
    },
    {
      "time": "4 Feb 2006 — 7:14am",
      "content": "Somewhere along the line, I heard to stay below 250 total coverage... Thus the C70M50Y30K100 formulation. If 240 makes a difference, I'd recommend C70M45Y25K100.\n\nThe Y doesn't really add darkness, it just helps to neutralize the hue.\n\nThe suggestion of adding a thin stroke of K around (and behind) the reversed text to allow for misregistration is very sound advice. My company publishes DVDs - the faces of which are silkscreened - and this technique has allowed us to print very small text sizes even with this notoriously temperamental printing method.\n\nI can recommend Dan Margulis' old-but-still-relevant book, [_Makeready: A Prepress Workbook_](http://web.archive.org/web/20150215223936/http:/www.amazon.com/gp/product/1558285083/sr=1-12/qid=1139065952). It's saved my keester a number of times.\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n [http://homepage.mac.com/mwebert](http://web.archive.org/web/20150215223936/http:/homepage.mac.com/mwebert \"http://homepage.mac.com/mwebert\")  \n [mwebert@mac.com](mailto:mwebert@mac.com)  \n--------------\n\n"
    },
    {
      "time": "4 Feb 2006 — 8:29pm",
      "content": "Is it only a 40% plain and uniform screen? Do you have a pic or scan? sounds exciting.\n\nHéctor\n\n"
    },
    {
      "time": "5 Feb 2006 — 10:48am",
      "content": "_I just had a billboard job that asked for 100 100 100 100. I didn’t believe it until I talked to their “designer” who confirmed that was what they wanted. They are using a color profile which you have to download. We shall see what the hard proof looks like…_\n\nI'd like to see how long it's going to take that puppy to dry...\n\n_fluorescent booster_\n\nHow do you separate that particular color and output a neg/plate for it?\n\n"
    },
    {
      "time": "5 Feb 2006 — 11:07am",
      "content": "Oldnick: basically its just an overall flood of the entire page, unless of course you wanted to specify certain parts of the page, however this would become difficult with photographs as they are continuos tone. Honestly, I have only seen this technique used on jobs that have large flat areas of color, however I will look for some samples that I will link on the web, I know I have seen some before.\n\n"
    },
    {
      "time": "5 Feb 2006 — 11:09am",
      "content": "Here is a link from Hemlock Printers on the use of booster colors. The specifically speak of a second hit of black, which would not be fluorescent, but they do detail how you would achieve a separation. [Link](http://web.archive.org/web/20150215223936/http:/72.14.207.104/search?q=cache:sJM7q7t2y3gJ:www.hemlock.com/popups/wtepaper/white_papers.pdf+fluorescent+booster+printing&hl=en&gl=us&ct=clnk&cd=4&client=safari)\n\n"
    },
    {
      "time": "6 Feb 2006 — 7:40am",
      "content": "quote - I’d like to see how long it’s going to take that puppy to dry…\n\nIt reminds one of Spinal Tap: \"How much more black can it be?\"  \npeace\n\n"
    },
    {
      "time": "6 Feb 2006 — 8:36am",
      "content": "“How much more black can it be?”\n\nMy thoughts exactly....\n\n\"...and the answer is none... none more black.\"\n\nMy friend's son named his band None More Black - lovely.\n\npd\n\n"
    },
    {
      "time": "6 Feb 2006 — 9:45am",
      "content": "Turn everything up to 110% :)  \nTim\n\n"
    },
    {
      "time": "6 Feb 2006 — 12:40pm",
      "content": "I've found using / C:50% M:40% Y:40% K:100% / makes a good combo for creating a nice rich black.\n\n"
    },
    {
      "time": "7 Feb 2006 — 8:08am",
      "content": "I mean realistically, 100 100 100 100 shouldn't take that long to dry, after all it's only 20' x 60'…  \nGot the hard proof back yesterday. It looked really good and the black was, well, black…  \npeace\n\n"
    },
    {
      "time": "10 Aug 2007 — 7:27am",
      "content": "If it's a billboard job then it's being printing on an inkjet, not an offset. And because it's an inkjet, it's going through its own cmyk conversion during the output, and only laying down as much ink as dictated by the machine and paper necessary to get a black-black. I'm sure they told you 100:100:100:100 to ensure the printer would put down the blackest black it could.\n\n"
    },
    {
      "time": "10 Aug 2007 — 7:38am",
      "content": "<cite>None More Black</cite>\n\nHmm.... If you find a formula that absorbs all light, let me know. ;)\n\n"
    },
    {
      "time": "10 Feb 2011 — 10:20am",
      "content": "We wanted to find out the best rich black to use too. As part of this we produced a handbook which shows six examples next to each other. We show examples which have a CMYK value of:\n\n- 0/0/0/100\n- 20/0/0/100\n- 100/100/100/100\n- 40/0/0/100\n- 50/20/20/100\n- 60/40/40/100\n\nSo you can see for yourself.\n\nYou can buy the handbook at [http://www.printhandbook.com](http://web.archive.org/web/20150215223936/http:/www.printhandbook.com/) if you want. We hope you find it useful.\n\n"
    }
  ]
}
