{
  "id": "17709",
  "title": "Font Design Books",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi all,  \nAfter getting a book on Paul Renner (thanks for the suggestions) I came across some font design books that I thought I would get for myself.\n\nDoes anyone have any recommendations on good books? The ones I'm thinking of getting are The Elements of Typographic Style - Robert Bringhurst and Thinking with Type : A Critical Guide for Designers, Writers, Editors, and Students (Design Briefs) - Ellen Lupton.\n\nThanks for your input.\n\n-Will\n\n",
  "author": "<a href=\"/web/20120203225054/http://typophile.com/user/3967\" title=\"View user profile.\">winglets747</a>",
  "time": "<br>",
  "uid": "3967",
  "comments": [
    {
      "time": "",
      "content": "I suppose it depends on what you're looking for, but take a look at Stop Stealing Sheep & Find Out How Type Works - Spiekermann/Ginger also the Logo, Font & Lettering Bible - L. Cabarga\n\n"
    },
    {
      "time": "",
      "content": "both books are very good. thinking with type isnt as in-depth as bringhurst (\"the typographers bible\"), which im still reading. i see it as a lexicon you can always go back to if you're unsure about anything.\n\nit also has a good list of different typefaces suited for text, with short descriptions on their history and which cuts are the best.\n\n"
    },
    {
      "time": "",
      "content": "i think _Thinking with Type_ would be a good preface to _The Elements of Typographic Style_. while Bringhurst's book is the \"typographer's Bible\", it can be a lot to chew on… but still a definite must-read.\n\nas for actually drawing and creating letters and fonts, the _Logo,Font & Lettering Bible_ will help you to learn more about some of the technical stuff.\n\n----------  \nnc\n\n"
    },
    {
      "time": "",
      "content": "Here are a couple of suggestions:\n\n[\\<www.typedu.org/read/main\\_en.html#theory\\>](http://web.archive.org/web/20120203225054/http:/www.typedu.org/read/main_en.html#theory)\n\nHannes\n\n"
    }
  ]
}
