{
  "id": "17702",
  "title": "indesign clipping path",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "If I have a tiff or psd file with a white background on a white page in InDesign, is it necessary to have a clipping path? It will be going to print so will the white background box faintly appear on the white paper?\n\n",
  "author": "nhoeing",
  "time": "3 Feb 2006 — 11:46am",
  "uid": "11322",
  "comments": [
    {
      "time": "3 Feb 2006 — 12:44pm",
      "content": "White is not a color and so will not print. The only time you really need a clipping path is is you have something which is directly behind the image -- overlapping -- and you want that.\n\n"
    },
    {
      "time": "3 Feb 2006 — 1:17pm",
      "content": "See If you ask about a Tiff you get a (Miss) Tiff\n\n"
    },
    {
      "time": "3 Feb 2006 — 1:18pm",
      "content": "<cite>White is not a color and so will not print. The only time you really need a clipping path is is you have something which is directly behind the image — overlapping — and you want that.</cite>\n\nAnd a PSD with a transparent background can solve that too, can't it?\n\n"
    },
    {
      "time": "3 Feb 2006 — 2:07pm",
      "content": "True. You can use a transparent background, but I'm a little old school and tend to not trust that.\n\n"
    },
    {
      "time": "3 Feb 2006 — 2:07pm",
      "content": "Pretty funny, Dan. :^D\n\n"
    },
    {
      "time": "3 Feb 2006 — 2:38pm",
      "content": "If you ask about a lamp, will you also get Miss Tiffany? :-)\n\nChrisL\n\n"
    },
    {
      "time": "3 Feb 2006 — 3:53pm",
      "content": "There's no good reason that I know of to use anything other than .psd and .ai in InDesign. It loves the native formats…  \npeace\n\n"
    },
    {
      "time": "3 Feb 2006 — 4:00pm",
      "content": "<cite>There’s no good reason that I know of to use anything other than .psd and .ai in InDesign. It loves the native formats…</cite>\n\nCorrect me if I'm wrong but sending layered native file formats to printers is risky and a bad habit.\n\n"
    },
    {
      "time": "3 Feb 2006 — 4:16pm",
      "content": "Re: white background -- double check that the background of your photo is truly \"white.\" A 1 or 2 percent dot in any of the process colors can be tough to see onscreen. Use the info palette to double check.\n\n"
    },
    {
      "time": "3 Feb 2006 — 4:55pm",
      "content": "i think it's fine if you link .psd and .ai files to an InDesign doc. there shouldn't be anything risky about it. setting up the file, now that's a different story…\n\n---------------  \nnc\n\n"
    },
    {
      "time": "3 Feb 2006 — 4:59pm",
      "content": "[double post]\n\n----------  \nnc\n\n"
    },
    {
      "time": "3 Feb 2006 — 5:01pm",
      "content": "David - I 'm primarily sending out PDFs. InDesign takes full advantage of PS and Illy features when you place native files. Place an Illustrator EPS - you will see a white background - .ai - gone. It's very rare someone asks me for a packaged ID file, basically only on really large signage like billboards. A lot of billboard printers and a few national magazines also ask for layered native files from PS and Illustrator. As long as I'm getting proofs I don't worry…  \npeace\n\n"
    },
    {
      "time": "3 Feb 2006 — 9:21pm",
      "content": "Fair enough, I was just taught to always use EPS files for vector and TIFFs for anything done in photoshop. Since you're mostly outputting PDFs though, like you said it doesn't really matter what files you use in your layout. :-)\n\n"
    },
    {
      "time": "4 Feb 2006 — 1:03am",
      "content": "…along those lines i think the eps/tiff thing comes from a time when Quark was the standard and since native files don't work in Quark, we have all been taught to default to eps and tiffs. …but now with InDesign becoming the standard, we're not bound to those combatability issues anymore.\n\n…not that i have any idea what the actual difference between a .tiff and .psd is anyway!  \n: ^ }\n\n------------  \nnc\n\n"
    },
    {
      "time": "4 Feb 2006 — 5:21am",
      "content": "At the last adobe roadshow the guy there said that the future lies in using pdfs instead of eps/tiffs. I found that a bit problematic because with pdfs you have to know from the beginning how the document is going to be printed. What do you think about that issue?\n\n"
    },
    {
      "time": "4 Feb 2006 — 8:09am",
      "content": "Adobe is making PDF more and more editable and cross-application, so I could easily see a day when PDFs will be the best way to bring graphics into just about any layout program.\n\nAs for transparent backgrounds, tiffs can do layers the same way PSDs can, and illustrator opens an EPS just as easily as an AI, so what's the attraction of leaving a file in adobe native format?\n\n"
    },
    {
      "time": "4 Feb 2006 — 9:30am",
      "content": "it's just better dangit!  \n: )\n\n-----  \nnc\n\n"
    },
    {
      "time": "4 Feb 2006 — 11:49am",
      "content": "Good explanation istitch.  \nquote - As for transparent backgrounds, tiffs can do layers the same way PSDs can, and illustrator opens an EPS just as easily as an AI, so what’s the attraction of leaving a file in adobe native format?\n\nInDesign is built to use the native formats of Illustrator and Photoshop. So why struggle? It also handles transparency better from these formats.  \nA lot of these ideas come from working with Quark. I am not talking about Quark.  \nAs for pdf, the future is now. Almost all my work is sent out this way. Magazines, newspapers, most print media not only accept pdf, they request it. Properly prepared pdfs are full res, support vector art and embedded fonts, and are really small.  \npeace\n\n"
    },
    {
      "time": "4 Feb 2006 — 1:43pm",
      "content": "X1-A all the way!\n\n-------  \nnc\n\n"
    },
    {
      "time": "6 Feb 2006 — 5:59am",
      "content": "I guess the argument for bringing graphics in as EPS and TIFF would be that if, later on, your layout needs to be converted to Quark or Frame or some such, it will be easier on the people doing the conversion.\n\nAlso if sometime in the future Adobe goes out of business (gasp), EPS and TIFF will presumably still be viable formats, while AI and PSD won't.\n\n"
    },
    {
      "time": "6 Feb 2006 — 7:48am",
      "content": "Re \"At the last adobe roadshow the guy there said that the future lies in using pdfs instead of eps/tiffs....\"\n\nIt can become a bit baffling when you find an orphaned PDF on your desktop and aren't sure whether you should open it in Photoshop, Illustrator, or just Acrobat; I think there's some value in using the least complex file format suitable for a given image.\n\nAnd if you're going through iterations of your Photoshop/Illustrator artwork, saving with different version numbers, it's handy to just save off a 'flat' EPS/TIFF with the same name each time, so that links in my Quark/InDesign doc can just be updated.\n\n"
    }
  ]
}
