{
  "id": "17715",
  "title": "ITC New Winchester",
  "forum": "Design",
  "tags": [

  ],
  "content": "Has anybody used [Jim Spiece](http://web.archive.org/wiki/Jim%20Spiece)’s revival of [Dwiggins](http://web.archive.org/wiki/William%20Addison%20Dwiggins)’ [Winchester](http://web.archive.org/wiki/Winchester)? Is it as good, as a design and as a revival, as one would hope? I’m surprised I haven’t come across more excitement about it, since it ought to be the most characterful digital Dwiggins on the market, and it’s obviously a real book weight.\n\n",
  "author": "<a href=\"user/9356\" title=\"View user profile.\">George Horton</a>",
  "time": "<br>",
  "uid": "9356",
  "comments": [
    {
      "time": " 4 February, 2006 - 8:58pm",
      "content": "There was a great feature on it in the print version of U&lc before it went kaput. I will look for it and scan.\n\n"
    },
    {
      "time": " 4 February, 2006 - 9:10pm",
      "content": "Wonderful, thanks so much.\n\n"
    },
    {
      "time": " 4 February, 2006 - 9:36pm",
      "content": "It has been regularized and none of the lovely quirks which rightly belong in it are there. Most glaringly it is missing the uncial forms. (Please, if I’m wrong post a link. Myfonts does not show these glyphs.) Granted it probably wouldn’t be as commercial, but it isn’t a proper revival without those forms. It isn’t as warm or friendly either.\n\nDwiggins theorized that the “Roman” alphabet was developed for Latin and then the Romance languages, and so, when reading those language the “Roman” alphabet suited it very well. However, when it came to English, the alphabet didn’t quite work. This is where the uncial forms help. Or so Dwiggins thought. I don’t agree. I find the uncial G in his setting disturbing. But, by jiggity, he put the uncial forms in there so why aren’t they there?\n\nIf you are lucky enough to get your hands on the “Postscripts on Dwiggins” Chapbook set, it has it in there in all of its glory.\n\n"
    },
    {
      "time": " 4 February, 2006 - 10:54pm",
      "content": "Stephen might beat me to it, but I will post a sample of Dwiggin’s Winchester on Monday. If you look at the typeface on Myfonts, really look at the letters, especially the italic. Some of the “corrections” are very obvious. I would love to know why the name was kept but not the character.\n\n"
    },
    {
      "time": " 5 February, 2006 - 4:59am",
      "content": "For reference: ITC New Winchester at [FontShop,](http://web.archive.org/web/20070302153848/http:/www.fontshop.com/showfont.cfm?fid=C.105534.0.0) [MyFonts](http://web.archive.org/web/20070302153848/http:/www.myfonts.com/fonts/itc/winchester-new-itc/), and [ITC](http://web.archive.org/web/20070302153848/http:/www.itcfonts.com/fonts/detail.htm?pid=276836).\n\n"
    },
    {
      "time": " 5 February, 2006 - 7:53am",
      "content": "Thanks Tiffany; from the preview, the fonts do look a bit coarser than I’d expect (though g is beautifully modelled)), and the d which Tracy complains about seems to have been so neutered as actually to look out of place because too dully Transitional.\n\n"
    },
    {
      "time": " 7 February, 2006 - 2:06pm",
      "content": "FWIW\n\nHere are samples of what it should look like.\n\n ![](http://web.archive.org/files/winchester.jpg)\n\n ![](http://web.archive.org/files/winchestersetting.jpg)\n\n"
    },
    {
      "time": " 7 February, 2006 - 2:35pm",
      "content": "Wonderful, Tiff! Can you up a zoomed detail image?\n\nFound the U&lc. Will scan tonight.\n\n"
    },
    {
      "time": " 7 February, 2006 - 3:46pm",
      "content": "Sort of zoomed:\n\n ![](http://web.archive.org/files/teezed.jpg)\n\n ![](http://web.archive.org/files/eyell.jpg)\n\n"
    },
    {
      "time": " 7 February, 2006 - 4:40pm",
      "content": "Ok, there is no reason Spiece shouldn’t have done a set of alternates with those forms. Gorgeous.\n\n"
    },
    {
      "time": " 7 February, 2006 - 5:00pm",
      "content": "Thanks again Tiffany\n\n"
    },
    {
      "time": " 7 February, 2006 - 5:03pm",
      "content": "And why he replace some of the characters at all …\n\n"
    }
  ]
}
