{
  "id": "17726",
  "title": "should i purchase an HP 1020 LaserJet?",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello,\n\ni’m thinking about purchasing an [HP 1020 LaserJet](http://web.archive.org/web/20090731165813/http:/h10010.www1.hp.com/wwpc/us/en/sm/WF05a/18972-236251-236263-14638-f51-439423.html). it is the most inexpensive laser printer i’ve been able to find and i like the fact that i can purchase it directly from HP (as opposed to some of the other not-so-legitimate sources that are out there)\n\nat this point i don’t have the funds to buy a super high quality laser printer but i just want to make sure it will work for the purpose of proofing type. if anyone would have any input or suggestions, it would be greatly appreciated.\n\nthank you,\n\nnick cottrell\n\n",
  "author": "<a href=\"/web/20090731165813/http://typophile.com/user/9718\" title=\"View user profile.\">istitch</a>",
  "time": "<br>",
  "uid": "9718",
  "comments": [
    {
      "time": " 6.Feb.2006 4.55am",
      "content": "The low-end HP printers are perfectly adequate as office printers. As long as you don’t expect to do anything more than check spacing, overall color and alignment of your typefaces, it will work fine. Just don’t expect the printer to accurately reflect the subtleties of your outlines: you’ll need a Postscript printer for that, and you’re going to have to pay eight to ten times as much to get a true Postscript printer.\n\n"
    },
    {
      "time": " 6.Feb.2006 6.47am",
      "content": "I have a HP LaserJet 1022 which is fine for office work but the print area is never parallel to the edge of the page.\n\n"
    },
    {
      "time": " 6.Feb.2006 7.31am",
      "content": "thank you for the comments.\n\nso is it any better than the inkjet that i already have? i was under the impression that inkjets were not adequate but perhaps that is so only when compared to Postscript printers?\n\n———————-  \nnc\n\n"
    },
    {
      "time": " 6.Feb.2006 10.13am",
      "content": "_is it any better than the inkjet that i already have?_\n\nWell, it’s definitely _faster_ than the inkjet your have, regardless of make or model.\n\n"
    },
    {
      "time": " 6.Feb.2006 10.31am",
      "content": "thank you, Nick. i think i’m gonna go ahead and purchase the printer. if it works out, i’ll eventually have to upgrade. i appreciate the input.\n\n————  \nnc\n\n"
    },
    {
      "time": " 6.Feb.2006 10.39am",
      "content": "Actually, I have an HP 1200, and I think it does better than you’d expect for such a low price. For one, It seems to have true 1200 dpi resolution, which is pretty important for type. For two, it has a lot less gain than other lasers I’ve tried. I _think_ the 1020 has the same engine, but it’s hard to be sure.\n\nLaser vs inkjet is harder to quantify. Both distort type considerably, but inkjets have gotten a lot better in recent years. One real advantage of lasers is that they work on plain papers. To proof type on an inkjet, you have to use glossy. It also helps to set a very high resolution and unidirectional printing in the driver (both of which slow down the printing quite a bit).\n\nI am very pleased with my Epson 2200. In the letter-size category, the R800 ($400 MSRP) has similar specs. I wouldn’t be surprised if the R220 ($99 MSRP) produces adequate results as well. It has a bigger drop size (3 pl vs 1.5 for the R800) and dye based inks (so they’ll fade), but the low end Epsons are pretty amazing for their price.\n\nProbably the single biggest thing you have to worry about is gain. If you have a high-gain printer and design your type to look good there, then it will be really weak and anemic when printed offset.\n\nSee also this thread:\n\n[http://www.typophile.com/node/16926](http://web.archive.org/web/20090731165813/http:/www.typophile.com/node/16926 \"http://www.typophile.com/node/16926\")\n\n"
    },
    {
      "time": " 6.Feb.2006 12.05pm",
      "content": "LJ 1020 for proofing type: a clear no!\n\nThe datasheet PDF — just google the for the printer model and select the hp site — says: “Resolution: 1200 dpi effective output quality” which has a footnote: “600 x 600 dpi with HP REt and FastRes 1200 technology”. Which is not **real** 1200 dpi.\n\nAlways be cautious with notions like “1200 dpi **quality** ”, regardless of brand. Same with Xerox or IBM.\n\nI bought a LJ 1320 recently which gives good results at little costs. True 1200 dpi and double side printing which I haven’t tried yet. (But my impression is that the printing of the 1200 was a bit finer. And the quality of the 2100 is still unmatched.)\n\nKarsten\n\n"
    },
    {
      "time": " 6.Feb.2006 8.13pm",
      "content": "Gracias.\n\ni’m looking into the LJ1320... gotta move some money around to make it work....\n\nthank you all for the comments; i really appreciate it.\n\n—————  \nnc\n\n"
    },
    {
      "time": " 12.Feb.2006 2.14am",
      "content": "so i purchased the LJ 1320. it prints very nice, but for some reason it won’t print fonts out of illustrator. when i send the illustrator file to print, it just prints a bunch of symbols at the top of the page(!?!!?)\n\nhas anyone experienced this problem? could it be a Postscript related problem? or perhaps it’s an operator error??\n\n————-  \nnc\n\n"
    },
    {
      "time": " 12.Feb.2006 4.59am",
      "content": "istich:  \nIt sounds as if the printer is getting binary data rather than ascii from Illustrator. Check the “options” in the graphics panel of the print dialogue, and check to see which PPD Illustrator is picking up.\n\nSwitching to a different print driver and back to the LJ 1320 might be enough to sort out Illy.\n\n"
    },
    {
      "time": " 12.Feb.2006 9.24am",
      "content": "We have a standing rule in our print shop: NEVER print anything directly from Illustrator, because its print engine is really lame. Either export/save your file as an EPS and place it in Quark, InDesign or Pagemaker, or save it as a PDF and print from Acrobat or Acrobat Reader.\n\n"
    }
  ]
}
