{
  "id": "1772",
  "title": "S. H. Steinberg",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Can anyone tell me anything about S.H. Steinberg, author of _Five Hundred Years of Printing_ (1955) ?   \n   \nIt's full of loveliness like this :   \n   \n**It is rather one of the most wholesome consequences of the worldwide expansion of the printing press that the one Latin alphabet should have become the one medium in which every human thought can find adequate expression.**   \n   \nBut he also makes some extremely astute comments about Gaelic typography and I was wondering who exactly he was and if he was taken seriously nowadays.   \n   \nAny info would be appreciated.   \n   \nMatha.\n\n",
  "author": "matha_standun",
  "time": "22 Oct 2003 — 3:11pm",
  "uid": "1352",
  "comments": [
    {
      "time": "22 Oct 2003 — 3:24pm",
      "content": "_Are you curious about the table of contents?_   \n  \nI have it in front of me, Tiffany, thanks. I'm curious about Steinberg himself.The blurb about him doesn't say much (Leipzig University, Courtauld Institute, inteligence work during the war, editor of lots of encyclopedias and dictionaries, fellow of the Royal Historical Society.)   \n   \nBeatrice Warde did his introduction and it seems to be pretty well-researched. Does he have a good reputation?   \n   \nMathew\n\n"
    },
    {
      "time": "22 Oct 2003 — 4:17pm",
      "content": "_Apparently Steinberg is to be thought of in good light._   \n   \nHe got his PhD at the age of 23 and wrote Stanley Morison's obituary.   \nCan't go wrong there. I was planning on shining some good light on him anyway. I have to get an abstract off this week for a conference on Irish book history and I just wanted to check he wasn't a nutcase or anything.   \n   \nThe PhD thing reminds me of a bit of blurb I read on the back of a David Hume book.   \n\"He entered Edinburgh University at the age of 12, but left before completing his degree\".   \n   \nThose were the days.   \n   \nGoodnight and thanks a million.   \n   \nMatha\n\n"
    },
    {
      "time": "22 Oct 2003 — 5:54pm",
      "content": "Steinberg's book was one of the first systematic surveys of European printing history conceived as a whole rather than focusing on an individual country, and has remained a well respected text. It belongs to the same typographic movement that resulted in the famous \\<I\\>Printing and the Mind of Man\\</I\\> exhibition. I don't know anything about the man, other than that my father might have known him (he studied at the Courtauld Institute).\n\n"
    },
    {
      "time": "23 Oct 2003 — 7:58am",
      "content": "_...European printing history conceived as a whole rather than focusing on an individual country_   \n   \nWhat attracted my attention in the first place was that he places Ireland very firmly in its European context. On top of that he refers to Gaelic typography as 'artificial', something that Irish writers could never and British writers would never dare do.   \n   \nA breath of fresh air, to say the least.   \n   \nMatha\n\n"
    },
    {
      "time": "22 Oct 2003 — 3:14pm",
      "content": "Matha, I can tell you that it was on my required reading list at Reading. I've not \"dipped\" into in quite a while, but I have it at home. Are you curious about the table of contents?\n\n"
    },
    {
      "time": "22 Oct 2003 — 3:44pm",
      "content": "![:-)](http://web.archive.org/web/20130205075110im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nYes. Well, the second I posted, I realized that.   \n   \nI think it might be easy to say that a book that is only 272 pages in length can't possibly be worth reading. However, this book has a couple things going for it. The British Library is one of the publisher's and Beatrice Warde wrote the intro. Apparently Steinberg is to be thought of in good light.   \n   \nI googled (as you probably did already) and came across this teensy bit of information:   \n   \n [http://www.dotprint.com/fgen/history.htm](http://web.archive.org/web/20130205075110/http:/www.dotprint.com/fgen/history.htm)   \n   \n_FIVE HUNDRED YEARS OF PRINTING BY S H STEINBERG, revised by John Trevitt (The British Library and Oak Knoll Press_  \n  \n_Hitler unwittingly did this country a favour when he forced so many German and Central European scholars into exile in the 1930s. Whether Jewish or Gentile, they brought with them a very Germanic dedication to scholarship which is in some ways superior to the home-grown variety and, like most refugees, they worked amazingly hard to re-establish themselves in a new environment.   \n  \n Famous examples include the architectural scholar Nikolaus Pevsner, the art historian E H Gombrich, typographers and book designers Hans Schmoller and Jan Tschichold, and Sigfrid Henry Steinberg, the unrivalled historian of printing. First published in 1955 as a Pelican Book, with the encouragement of Schmoller, Five Hundred Years of Printing proved to be a bestseller, with 70,000 copies of the Pelican editions sold over a period of 24 years and parallel hardback editions issued by Faber & Faber.   \n  \n The present publication is the fourth revision of a work whose author died in 1979, too early to take much account of offset-litho printing and well before the general use of digital typesetting and the introduction of the Internet, which both feature in John Trevitt's revision of Steinberg's third and final chapter.   \n  \n This has now been divided into three, so that instead of The Nineteenth Century and After we have The Nineteenth Century, 1900-1955 and The Postwar World. In his Preface, Trevitt comments: 'On re-reading Five Hundred Years , I was struck by its lightly-worn learning, both deep and wide &shyp; and by a feeling that on any and every subject the author knew far more than he had space to tell us.'   \n  \n Lightly-worn learning was acquired by persistent effort. Steinberg's Ph.D thesis at Leipzig University had the heavily Germanic title of Documentation methods of the Goslar City Council up to the mid-14th Century. He was then 23 years old and 12 years later he fled from Nazi rule to England. Teaching German in evening classes, which led to the publication of A One-Year German Course (Macmillan), then writing and editing history books and encyclopedias, established Steinberg in the English publishing world.   \n  \n Readers who remember Ipex 1963 and its fascinating sideshow, Printing & the Mind of Man,, will not be surprised to learn that Steinberg played a major part in its organisation under the direction of Stanley Morison. So close was his friendship with the great typographer that they agreed to write each other's obituaries for The Times &shyp; surely the greatest example of back-scratching in any coterie.   \n  \n To conclude the personal observations drawn from the Preface, Steinberg's wife is quoted as saying: 'S H never realised that other people were not able or willing to work a 16-hour day, as he often did himself.' And on the same page, there is his portrait photo, looking for all the world like Henry Kissinger's older brother. What of the book itself? Well and clearly written, it also has the best qualities of a reference book.   \n  \n If you want to know about the development of printing techniques, typefaces and book production in any European or other English-speaking country, Steinberg is your man. Should you wish to shine on Mastermind, you could choose printing history as your subject on the basis of this book.   \n  \n Here are some sample questions:   \n Q: What is the world's oldest established printing company?   \n A: Orell Füssli of Zürich, established as Froschauer in 1521.   \n Q: Who invented the title page?   \n A: Gutenberg's successor, Peter Schöffer, for a papal bull of 1463.   \n Q: Who introduced printing to Russia?   \n A: The German, Hans Missenheim, at the invitation of Ivan the Terrible in 1552.   \n Q: Who introduced accents in French printing?   \n A: Robert Estienne in the 1530s.   \n Q: Why is the Judas Bible of 1611 so-called?   \n A: Because in Matt. xxvi 36 it names Judas as presiding at the Last Supper.   \n Q: And the Wicked Bible?   \n A: Because it gives the seventh commandment as Thou shalt commit adultery. And so on.   \n  \n A fresh selection of illustrations has been made for the new edition, but it is a pity that they are not indexed. The reviser mentions the fact that his publisher insisted on a maximum of 272 pages and the resulting longer lines and smaller typeface make the book less readable than the Faber edition of 1959. Nevertheless, even if regarded simply as a reference book, Five Hundred Years deserves a place on the printer's bookshelf beside the English dictionary.   \n  \n And as tens of thousands of readers can testify, it is really much more than a reference book. As Trevitt comments, it established the invention of printing at the centre of modern history, thereby appealing not only to printers, but also to a wide circle of general readers interested in history._\n\n"
    },
    {
      "time": "26 Jul 2008 — 12:37pm",
      "content": "The content seems good,I appreciate your work,There will be more appreciations from other people.  \n===============  \nSANATH\n\n"
    },
    {
      "time": "28 Jul 2008 — 8:16am",
      "content": "\\>I think it might be easy to say that a book that is only 272 pages in length can't possibly be worth reading.\n\nO what pearls are cast down before us!\n\n"
    }
  ]
}
