{
  "id": "17728",
  "title": "My 1st Font - Any Comments?",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "[my first attempt](http://web.archive.org/web/20150123134553/http:/www.dieweberei.de/ia/) of creating a font (ignore the logo above). it basically is a manipulation of ff thesis. so far, i only worked on the small cases, and not on all of them. would anyone like to comment on it? any inconsistencies? how would you characterise the \"feeling\"?\n\n",
  "author": "filoug",
  "time": "6 Feb 2006 — 1:25am",
  "uid": "11291",
  "comments": [
    {
      "time": "16 Feb 2006 — 3:12am",
      "content": "maybe some of you didn't want to follow the external link, so here it is again. any comments are welcome.\n\n ![](http://web.archive.org/web/20150123134553im_/http:/typophile.com/files/ia_logo02.gif)\n\n"
    },
    {
      "time": "16 Feb 2006 — 7:51am",
      "content": "I hate to rain on your parade, but \"a manipulation of ff thesis\" is not \"My 1st font\", it's one of Luc[as] de Groot's fonts which you have given wonky corners.\n\nAddition to original post: I don't mean to sound like a mean aßhole, but authorship of typeface designs is a pretty touchy subject, especially with those of us who are trying to earn our living as type designers. There are many ways to learn about type, and one of them is to study, and even muck about with, great typefaces in order to see how they're made, and perhaps uncover some of the secrets of their success. But don't claim ownership of someone else's design, having done minor tweaking or even major overhaul. It's simply not cricket to build typefaces from other people's typefaces. (You can borrow from yourself; that's okay.)\n\nMost \"My 1st font\" efforts are absolutely awful. I don't think you'll find a designer who didn't start by making ugly geometric/constructed/grunge - depending upon their age - fonts, and thinking at the time that they were pretty good. Like any skill or craft, type designing develops over time and involves loads of trial-and-error. Speaking for myself, I have been designing fonts for around 15 years, and have only recently started to understand what I'm doing and am finally making some type which is not completely awful. (A contention which is open to debate.)\n\nI applaud your interest in getting into type design, but urge you to take your time, learn about the craft, and keep posting experiments here for comments. Publish when you're ready and when you have original designs.\n\nSo... About your logotype... I'm not sure that squaring off the corners of Thesis are doing the type any favours. There is a difference between modifying a letterform to better suit your needs, and simply changing it for the sake of change.\n\n"
    },
    {
      "time": "17 Feb 2006 — 2:22am",
      "content": "chester, thanks for your comments. i understand what you are saying about the copying issue, and i'm very aware of it. actually now i know, that the title of my posting was misleading - as it's not a font but rather <cite>'minor tweaking or even major overhaul'</cite>. more specifically, it's not a font at all, as it is all done in illustrator. i'm far away from trying to <cite>'claim ownership of someone else’s design'</cite> and never thought about <cite>'publishing'</cite> anything. it's a mere learning exercise.\n\nso are you condemning such efforts, morally? is there any better way of learning about type design than experimenting with very skillfully made fonts by experienced designers?\n\nto me, this seems a little bit strict.\n\n"
    },
    {
      "time": "17 Feb 2006 — 2:32am",
      "content": "In my experience, moving someone else's points and outlines around will never teach you as much as actually drawing by hand and onscreen yourself. By experimenting with existing fonts, one may be able to discover new forms (although this rarely happens), but one will not come to the understanding of WHY the designer drew the original forms the way he did. That sourt of understanding takes a long time to develop, and only comes through direct experience.\n\nYes, drawing your own letters from scratch is hard. It takes years sometimes before the letters will be any good. But it will be worth it when you reach that point.\n\nI don't think that chester is being strict at all, by the way. Luc[as] de Groot is a living designer, who just designed Thesis a few years ago. One should respect his time and his work, especially if one is working in the creative industry, too.\n\n"
    },
    {
      "time": "17 Feb 2006 — 2:57am",
      "content": "i am interested in the 'personality' of a given font. where does it come from? what determines it? what are those characteristics that make it unique? and so on. i love thesis, but i wonder why. my idea was, that by manipulating some of the forms, i might get closer to it.\n\nultimately, i agree, i should start designing from the scratch. which has always been a big dream of mine and i hope i will find the guts to do it. it just seems a bit like preparing a risotto if you have never cooked rice.\n\nplease don't be too harsh with me - i didn't want to steel anything from anyone. i have never and will never use it for anything else than my personal experiments.\n\n"
    },
    {
      "time": "17 Feb 2006 — 6:10am",
      "content": "Filoug, I'm sorry if I sounded harsh or strict. I'm not advocating a \"hands-off\" approach; it can be illuminating to get inside a typeface and see how it's constructed, where the nodes and BCPs are, how a designer describes curves, etc. As Dan points out, one learns more by drawing and making letters, and I would encourage you to start your \"international aquaculture\" exploration on paper.\n\n"
    }
  ]
}
