{
  "id": "17732",
  "title": "(x) slab serif face on flyer in Amsterdam - Stanley {Fabienne}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Found this typeface on a flyer in Amsterdam. I’m sure I’ve seen it before, but I can’t remember where. Any help ?\n\n ![](http://web.archive.org/web/20080420064723im_/http:/www.typophile.com/files/Unknown.jpg)\n\n [‹ (x) Design Is Kinky splash page - ITC Avant Garde Gothic {Dav, Forrest}](http://web.archive.org/web/20080420064723/http:/www.typophile.com/node/17950 \"Go to previous forum topic\") [(x) U2 Vertigo dvd stencil font - House Broken Clean {Tiff} ›](http://web.archive.org/web/20080420064723/http:/www.typophile.com/node/17947 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080420064723/http://www.typophile.com/user/11083\" title=\"View user profile.\">Celeste</a>",
  "time": "<br>",
  "uid": "11083",
  "comments": [
    {
      "time": " 6.Feb.2006 9.19am",
      "content": "don’t know what exactly this is – if it is “something” at all – the upper part of lc “a” and “f” look very martin-majoor-ish though…?\n\n"
    },
    {
      "time": " 6.Feb.2006 12.51pm",
      "content": "Mmh… Not contemporary enough — the stem/serif transition makes a very awkward 45° angle which reminds me of Charter or Matrix, fonts dating from the era of memory-saving designs with as little curves as possible.\n\n"
    },
    {
      "time": " 7.Feb.2006 2.22am",
      "content": "I didn’t mean to imply this was an actual Majoor typeface, this looks very much like somebody tweaked/decomposed and put whatever together again, a “deconstructivist” thingy. The lc\\_s completely falls out of the overall seriffed appearance, the whole thing has a very hybrid feel to it, as if it was put together from different fonts, etc. I don’t think this is a released typeface, but I might be proven wrong in a minute :-)  \nBut again, some parts, as mentioned above, remind me of Majoors approach to the respective shapes/chracterforms or parts of…\n\n"
    },
    {
      "time": " 15.Feb.2006 12.45pm",
      "content": "The typeface was designed about two years ago by Ludovic Balland (studio: the Remingtons, Basel, Switzerland). He named it »Stanley« in honor of Stanley Morison.  \nHe also used it in a series of bookjackets for »Das Magazin Schweizer Bibliothek« which can be seen [here.](http://web.archive.org/web/20080420064723/http:/www.schweizer-bibliothek.ch/reihe.html)\n\n"
    }
  ]
}
