{
  "id": "17759",
  "title": "Logo for a software company",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello friends\n\nThis is my first post and I am a bit nervous about it.  \nI come from a place where typography is almost completely ignored and chances of getting exposed to it is very scarce. I dont know how it happened but these days I find that I am really in love with type. I never knew that so much things existed with simple letters.\n\nActually, I am really excited to find a place like this at the very beginning of my studies about type.\n\nComing to the logo, I made this for a software company focussing on software related to communication. They have made softwares for TV Channels, Governmental agencies etc.\n\nThis is not a redesigning. They did not have an identity till now.  \nGuidelines given were to make it 'modern, simple and clear'  \nTheir target include local clients and overseas clients.\n\nI have used Trajan and later found that it is so much used with movie titles. Is it ok to use Trajan?  \nI could not play much with type regarding this logo.\n\nCIS stands for Codedvision Integrated Solutions.\n\nIn case I am missing something please tell me.\n\nThank you guys, in advance.\n\n ![](http://web.archive.org/web/20131019012831im_/http:/typophile.com/files/CIS_fro_Typophile.jpg)\n\n",
  "author": "deepak",
  "time": "7 Feb 2006 — 7:08am",
  "uid": "11355",
  "comments": [
    {
      "time": "7 Feb 2006 — 7:43am",
      "content": "I think Trajan would be a nice typeface choice initially, but I get caught up on the drama that it brings. Trajan (as you stated) is overused and overhyped on many movie posters in Hollywood today, and many for good reason. Trajan simply works. In this case, to me, it feels a little off?  \nMaybe if you tried something more neutral, in the sans family. Maybe some kind of mark implying vision? If you are dead set on a serif with drama for a mark, dare I say Rotis? I may be burned at the stake for saying that. :)  \nThe orange triangular accent isn't happening for me yet. Too detached visually...doesn't explain or add anything?  \nOne mark (not the typeface) for inspiration could be Fuji Television's? A nice abstract interpretation of the eye, and its always nice to go overseas to get inspiration! Keep working and post progress!\n\n[http://brandsoftheworld.com/brands/0002/4841/brand.gif](http://web.archive.org/web/20131019012831/http:/brandsoftheworld.com/brands/0002/4841/brand.gif \"http://brandsoftheworld.com/brands/0002/4841/brand.gif\")\n\n"
    },
    {
      "time": "8 Feb 2006 — 10:48am",
      "content": "My first concern about this is that it is very difficult to read, and easy to mis-read as in Code Division, you should investigate separating the two with colour, a large cap for V or moving your icon to the V. It strikes me that it doesn't really represent a software company (this might not be a drawback actually). As a word of warning orange is not always the best colour to reproduce from four colour process.  \nTrajan, although not modern, is well proportioned; and although it is over-used it is mostly in the roman weight rather than the bold. You have kerning issues, especially in the vision bit where it looks a bit crushed, and the CI combination could be closed up a touch.  \nTim\n\n"
    },
    {
      "time": "9 Feb 2006 — 4:25am",
      "content": "The way its set its a very wide logo. Try making it Coded line one and Vision line two and add Intergrated Solutions as line three. As Tim suggested you have kerning issues as well.\n\nMay I suggest you go away from the computer and take a note pad and a pencil and just write different solutions. That way your not caught up in typefaces and kerning. This allows you to work on the bigger issues like communications and layout.\n\n"
    },
    {
      "time": "18 Feb 2006 — 2:40pm",
      "content": "i'm not sure if I’m seeing twenty first century design. Perhaps you should try keep in mind what it should tell, without anyone having to literally read it.\n\ngood luck\n\ncheers\n\n"
    }
  ]
}
