{
  "id": "17754",
  "title": "AFM modification legality",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Are AFM files protected by EULAs? Are they copyrighted?  \nI think I remember people saying they're fair game for  \nmodification, but...\n\nSpecifically I'm wondering if there's grounds for legal action if  \na contractor provides a client with a \"replacement\" AFM file for  \na font for which the client has a license. The new AFM file would  \nbasically be the original one with kerning pairs added (and maybe  \nsome bounding boxes tweaked), and the client would sub it in.\n\nhhp\n\n",
  "author": "hrant",
  "time": "6 Feb 2006 — 6:07pm",
  "uid": "1250",
  "comments": [
    {
      "time": "7 Feb 2006 — 2:29am",
      "content": "AFM files are not copyrightable by the \"Copyright Law of the United States\".\n\nIn § 101 \"Definitions\" of the \"Copyright Law of the United States\" it is defined:\n\n\"Literary works\" are works ... expressed in words, numbers, or other verbal or numerical symbols ...\"\n\nAFM files are series of words (\"space, exclam, quotedbl...\") and series of numbers (\"32, 33, 34...\").\n\nExample:\n\nC 32 ; WX 250 ; N space ; B 0 0 0 0 ;  \nC 33 ; WX 333 ; N exclam ; B 93 -12 239 696 ;  \nC 34 ; WX 333 ; N quotedbl ; B 40 380 293 696 ;  \nC 35 ; WX 500 ; N numbersign ; B 10 0 488 680 ;  \nC 36 ; WX 500 ; N dollar ; B 36 -102 464 736 ;  \nC 37 ; WX 833 ; N percent ; B 53 -12 779 696 ;  \nC 38 ; WX 833 ; N ampersand ; B 36 -16 788 696 ;  \nC 39 ; WX 278 ; N quoteright ; B 59 406 219 696 ;  \nC 40 ; WX 333 ; N parenleft ; B 22 -194 312 696 ;\n\nAt first glance, AFM files consisting of series of words and numbers seem to be \"literary works\". But series of words and numbers are not copyrightable and therefore AFM files are not copyrightable literary works.\n\nArgumentum e contrario (Proof by the opposite)\n\n1) If the series of words \"space, exclam, quotedbl, numbersign...\" as contained in the first AFM file published in the 1980s were copyrighted, then any of the thousands of AFM files published in later years would constitute a copyright infringement of the first AFM file published in the 1980s.\n\n2) If the series of numbers \"32, 33, 34, 35...\" as contained in the first AFM file published in the 1980s were copyrighted, then any of the thousands of AFM files published in later years would constitute a copyright infringement of the first AFM file published in the 1980s.\n\nQuod erat demonstrandum\n\n"
    },
    {
      "time": "7 Feb 2006 — 5:58am",
      "content": "I'd go with Uli's first argument: while the precise placement of points in a printer binary file is coyrightable, a simple ASCII text listing of bounding box limits and kerning information isn't. Neither kinds of information is necessarily unique to a particular typeface.\n\n"
    },
    {
      "time": "7 Feb 2006 — 6:39am",
      "content": "Is it not possible for kerning pairs from similar fonts to be similar in name and numbers without someone trying to copy a prior work? Example: Pick Caslon by any number of foundries or even broaden it to any roman text face of that era. The typical pairs (say cap T or V with most lowercase glyphs) would be made and the numbers might even be close if not the same. Kind of hard to copyright that sort of thing.\n\nChrisL\n\n"
    },
    {
      "time": "7 Feb 2006 — 7:32am",
      "content": "Hold on.\n\nWhether or not AFMs themselves are copyrightable/copyright (I have no idea) will not answer the question, because AFMs are not usually supplied \"alone\", but as part of a font including other files, notably outlines, which certainly ARE.\n\nWhen you \"buy\" a font, what you actually do is make a contract: you AGREE to do and not to do certain things, and your compliance with that AGREEMENT is a condition of being allowed to use the font. Whether or not the AFM is copyright, if you AGREE not to modify it, then you are contractually obliged not to do so. And if you break that agreement, consequences will follow, including potentially the loss of the licence for those parts of the font that are copyright.\n\nSuppose, for instance, that the licence said \"You agree not to pick your nose. If you do pick your nose your licence to use our outlines terminates.\" The font-supplier has not inherent right to prevent you picking your nose: hell, it's your nose not his, and normally you are allowed to pick your nose as you please. But if you AGREE not to, and AGREE that if you do your licence to use some outlines will terminate, then if you pick your nose you will no longer be entitled to use the font, and if you do you will be in breach of copyright.\n\nSo you can't answer the question by asking \"are AFMs copyright\". You have to ask, instead, \"Have I agreed in my EULA not to modify AFMs\". That will vary from EULA to EULA, but I'd \\*guess\\* the answer is often, Yes.\n\n"
    },
    {
      "time": "8 Feb 2006 — 6:54am",
      "content": "Whoa, Paul...you've been spending too much time around barristers and solicitors. There is a big difference between the spirit and the letter of the law. I believe that foundries include no-modification clauses to prevent their work from being pirated, but we are not dealing with piracy here.\n\nHrant said nothing about modifying the font: he had issues with spacing and a lack of kerning pairs. Specific, non-destructive improvements for a single user does not, IMHO, constitute a violation of the spirit of a licensing agreement.\n\n"
    },
    {
      "time": "8 Feb 2006 — 8:40am",
      "content": "Although it is a nice idea to be able to separate the spirit and the letter of the law, it isn't very realistic. I would say for most to guess which foundries allow for differentiation between the spirit and the letter of the law is akin to playing with fire. Modification is modification. No matter how you look at it. Although, you obviously are one foundry who must allow modification and so are more open for this sort of thing.\n\n"
    },
    {
      "time": "8 Feb 2006 — 9:19am",
      "content": "\\> Whether or not AFMs themselves are copyrightable/copyright (I have no idea)  \n...  \n\\> then if you pick your nose you will no longer be entitled to use the font, and if you do you will be in breach of copyright.\n\nThis is a hysteron-proteron:\n\nA breach of copyright (hysteron) presupposes proof of copyrightability of AFMs (proteron). To say \"I have no idea\" does not seem to be a proof, does it?\n\n"
    },
    {
      "time": "10 Feb 2006 — 5:38am",
      "content": "I can't speak for anyone else, but the **intent** of the no-mod clause in my EULA is to prevent people from making minor modifications to my fonts (like, just changing the name and the copyright information) and re-selling them; or, in other words, the intent is to prevent theft. However, I have no problem with anyone making modifications for personal use, especially when the modification corrects a situation that I had not anticipated. For example...\n\n ![](http://web.archive.org/web/20131014115624im_/http:/typophile.com/files/davinci.gif)\n\nWhen I kern my fonts, I look at ALL combinations of uppercase+uppercase, uppercase+lowercase and lowercase+lowercase letters (a total of over 5,400 combinations), but I do **not** look at combinations such as the one depicted above. If a company called daVinci wanted to purchase one of my fonts, is it reasonable for me (or any other foundry, for that matter) to demand that, in absolute deference to a no-mod agreement, the end user should be forced to manually kern every instance of their company name? Wouldn't it be more reasonable for them to make a simple addition to the .afm file (KPX a V -50)? I would certainly suffer no harm, and the end user's life would be a lot easier.\n\n"
    },
    {
      "time": "10 Feb 2006 — 5:55am",
      "content": "oldnick:  \nReasonable, yes, but many foundries seem to feel otherwise. See:  \n [http://typophile.com/node/14264](http://web.archive.org/web/20131014115624/http:/typophile.com/node/14264 \"http://typophile.com/node/14264\")\n\n"
    }
  ]
}
