{
  "id": "17769",
  "title": "Benedicta, the sans with a blackletter appeal",
  "forum": "Blackletter / Uncial",
  "tags": [
    "Blackletter / Uncial"
  ],
  "content": "Hi everybody,\n\nI’m working on a sans with a blackletter influence. The forms was inspired by the rotunda style of the blackletters and the sans serif's design of twenty century. The first version was called Benedicta, it keeps the heavy structure of the gothic types and the legibility of the sans what make it a good type for headings. Until now, these are the first versions of some lowercases. The diacritics, punctuation, symbols and characters x, y and z are under construction as the uppercase letters. I'll post it here as soon as possible.\n\ntks\n\n| Attachment | Size |\n| --- | --- |\n| [benedicta test.jpg](http://web.archive.org/web/20150317222430/http:/typophile.com/files/benedicta%20test.jpg) | 197.08 KB |\n| [Benedicta 02.jpg](http://web.archive.org/web/20150317222430/http:/typophile.com/files/Benedicta%2002.jpg) | 216.68 KB |\n| [benedicta 03.jpg](http://web.archive.org/web/20150317222430/http:/typophile.com/files/benedicta%2003.jpg) | 113.42 KB |\n\n",
  "author": "elias bitencourt",
  "time": "7 Feb 2006 — 1:40pm",
  "uid": "7641",
  "comments": [
    {
      "time": "7 Feb 2006 — 2:52pm",
      "content": "eliasbitencourt-  \nImpressive!!!  \nDK~\n\n"
    },
    {
      "time": "7 Feb 2006 — 6:42pm",
      "content": "thanks for the compliment DK!\n\n"
    },
    {
      "time": "7 Feb 2006 — 7:32pm",
      "content": "just a couple things that jumped out at me:\n\nthe weight distribution of the strokes is off in places: you might want to spend a bit more time working out your [ductal logic](http://web.archive.org/web/20150317222430/http:/typophile.com/wiki/ductal%20logic). for example the a feels funny because the upper stroke is noticeably heavier than the lower diagonal stroke of the bowl. i would think that these should be of a more similar weight.  \nsecondly, i don't know if you meant to make the 10 o'clock portion of your f curve flat, but i think that's just about right. however, i think this should be applied to other round characters at the same 10 o'clock position. for some inspiration, you might check out [Bradley](http://web.archive.org/web/20150317222430/http:/www.myfonts.com/fonts/urw/bradley-urw/). Of course, you want to tame this down a bit, but you might want to capture a bit more of its \"essence.\"\n\n"
    },
    {
      "time": "8 Feb 2006 — 6:37am",
      "content": "tks for the advices paul, I think that the strokes needs a fine-tuning too but I was trying to finish the lowercase set before do it. The upper curves on the glyphs \"e\" and \"o\" seems to be a little bit flat and not to continuous as do they should be. I think the glyph \"s\" looks like a little heavier than the other ones too, what do you think about?\n\nOpinions are always helpful. Thanks a lot!\n\n"
    },
    {
      "time": "10 Feb 2006 — 7:16am",
      "content": "I do agree with Paul about the weight being inconsistent, but I think you should go for a more increased contrast between thin and thick strokes; I like the contrast in letters 'h', 'm' and 'n'.\n\nAnd, I think this is still too raw, undeveloped. IMO, you should incorporate more blackletter elements to it (like what Paul said about the detail in your 'f'); make it a real mashup. As it is now, it looks likes you just applied some random elements to a generic sans-serif.\n\nWorking on your 'ductus logic' would be a great start. Fixing the stroke contrast will make it easier to evaluate and improve this typeface.\n\n-- [omine.net](http://web.archive.org/web/20150317222430/http:/www.omine.net/)\n\n"
    },
    {
      "time": "10 Feb 2006 — 9:29am",
      "content": "Eduardo,\n\nI do agree with you and Paul about the contrasts and my \"ductus logic\". I'll work hard on it. I admitted that I'm just a little hazy about take a lot of others blackletters elements, I was thinking about a sans with some kind off blackletter appeal an not a gothic typeface at all. But, I'll follow up the advices, test an post the news as son as posible.\n\nthanks for you attention an sugestions,\n\ne.\n\n"
    },
    {
      "time": "13 Feb 2006 — 4:36am",
      "content": "Way to go Elias. This is the kind of contemporary \"blackletter\" needed to help redeem the German tradition. Very cool.\n\n_the a feels funny because the upper stroke is noticeably heavier than the lower diagonal stroke of the bowl_\n\nSame with the \"a\" in Gill Sans. I guess lots of designers complain about that, but we established on the \"g's anyone?\" thread that the Gill Sans \"a\" is that font's signature letter and helps makes it iconic. I would keep the upper stroke in this sans as thin as it is, and thin down the bar of \"e\" to match.\n\nBesides, it matches the thin stroke on h, m, n, b, q, p, d, u, r.\n\nSuggestion: you could try making the right-hand strokes of v and w thinner to match. Try it on k. Nothing to lose by trying.\n\nElias, I like this font very much and look forward to seeing it in use :)\n\nj a m e s\n\n"
    },
    {
      "time": "15 Feb 2006 — 8:57pm",
      "content": "hi James, thanks for your coments!\n\nI've been trying to get a little bit of contrast to make it more clear... so I needed to change some things like \"a\" \"e\" \"c\" \"o\", the bows of \"b\" \"p\" \"q\" and \"d\". The changes are in the jpg at the attachment’s list above. Its not properly a ductus logic studies, just a few adjustments... I also did some signs; diacritics and ligatures check it out.\n\nbut I'm not sure yet... some times I see 3 different possibilities\n\n1. Work on a sans serif for headlines and preserve some strong structures,  \n2. Work on a modern gothic improving the contrast and the ductus logic,  \n3. Work on a sans with a just more contrast.\n\nPerhaps at the end of the process I'll have a big family.\n\nI’m working and some news is coming... I'll post it at soon. Tks for the advices, keep the coments!\n\ne.\n\n"
    },
    {
      "time": "16 Mar 2006 — 7:46pm",
      "content": "Hey everybody,\n\njust a few news about the process. I did some improvements in the axis direction, fine- tunings and readjusts in the bows of the \"b\",\"p\",\"d\",\"q\" e \"g\". New diacritics, ligatures and alternate characters had been developed too. Check it out at the **[specimen file](http://web.archive.org/web/20150317222430/http:/www.acasadotipo.com.br/benedicta/specimen_poster.jpg)** here.\n\nThe next steps: characters \"x\", \"y\",\"z\", numerals and the uppercase letters.\n\nWhat are you say guys?\n\n"
    },
    {
      "time": "18 Mar 2006 — 9:25pm",
      "content": "Looking good. I think maybe the \"e\" crossbar should be steeper to match that of the \"a\". When they are set together as \"ea\" or \"ae\" the slight difference in slope is distracting.\n\n"
    },
    {
      "time": "22 Mar 2006 — 7:47am",
      "content": "After a quick look, I think that the c, e, and o are too round. Have you tried \"breaking\" their curves? In your e-mail to me, you said that this was inspired in part by rotundas. If you break the curve in one or two places along the letter, you won't loose any rotunda-ness…\n\nAlso, I would play with the ligatures a bit more. The f in the f-k liagature curves over too low before it meets the stem of the k. This isn't so happy. I can't if your f-h does the same… the image that you posted above isn't big enough for me to see it clearly.\n\nAlso, the join of your c-ligatures should be lower so that the h and the k have more stem and read clearer.\n\nI think that your \"pen angle\" on top of the b, d, and l is too steep.\n\nAll in all, this seems like a great start! Keep going with it.\n\n"
    },
    {
      "time": "22 Mar 2006 — 10:13am",
      "content": "Guys,\n\nI'm having some troubles to post the images... every time that I try to attach one file a message says: “file copy failed: no directory configured, or it could not be accessed”... Does anybody have idea what is happening? I lost some images and get restricted to post new ones. What shoul I do?\n\n…………\n\nDan, Thanks for your attention, I'm trying to put a better image from character map to make the ligatures and alternate solutions more clear. I’ll try your suggestions and post the news at soon.\n\nI hope to solve this image inconvenient.\n\ntks and sorry ;-(\n\n"
    },
    {
      "time": "22 Mar 2006 — 10:27am",
      "content": "You should be able to go back to your original post at the top of the thread and edit it. There, you can attach files. PDFs would be best.\n\n"
    },
    {
      "time": "22 Mar 2006 — 10:32am",
      "content": "Yes, I do this procedure every time, but is not working for me today... :-( Any idea?\n\n"
    },
    {
      "time": "23 Mar 2006 — 5:20am",
      "content": "Well, wile I don’t post the news structures, the tryouts following Dan’s suggestions and don’t fix the bug, you could see the details of some characters, ligatures and alternates in the **[character map file](http://web.archive.org/web/20150317222430/http:/www.acasadotipo.com.br/benedicta/character_map.jpg)** above.\n\nCriticize them! :-)\n\ntks\n\ne.\n\n"
    },
    {
      "time": "29 Mar 2006 — 5:05am",
      "content": "_I think that your “pen angle” on top of the b, d, and l is too steep._\n\nYes. Even tho this design is synthetic its pen-derived nature should not be neglected. The angled stem ends do not feature realistic nib & ink details but are abstracted with their crisp geometric precision, and suggestive of calligraphic forms. Therefore at least make the angle realistic to make the motif authentic. It may sound contradictory, but abstracted design can have realistic qualities.\n\nIs all this philosophical design justification neccessary? Not absolutely, but it definitely gives insight into your design and aids in solving various kinds of problems :^)\n\n_If you break the curve in one or two places along the letter, you won’t loose any rotunda-ness..._\n\nTrue, but that kind of thing tends to be more successful in rotundas drawn with a flat nib and ink where the line contrast is high. I'm not disagreeing with you outright, but think fracturing may be problematic in a low contrast linear font like this one. The best answer is to try it and see how it goes.\n\n_After a quick look, I think that the c, e, and o are too round. Have you tried “breaking” their curves?_\n\nRight on Dan. Try it Elias, keep it subtle, flattening only a small amount, and the b-q, d-p pairs to match, to better integrate those letters with the straight-sided h, n, m. Another potential reason for flattening the rounds is to instill a stronger blackletter heritage---if blackletter is the direction you want to go in.\n\nThe alternative is to leave the rounded letters rounded---to contrast with the straight-sided guys. This approach is found in most sans serifs, eg: officina, frutiger, futura. Not many people question the design logic of those fonts or complain they lack integration. The shape contrast is taken for granted, as a defacto standard in roman type design. The advantage of contrasting forms---rounded versus rectangular---is maintaining differentiation and readability. One detractor of blackletters is their reduced readability because they're so modular.\n\nBut that kind of modularity is a defining characteristic of blackletters, and there is a very special, sublime art to making them hang together and read properly. Some letters are differentiated only by serif & swash lengths and positions.\n\nOne problem to tackle is deciding on structures for x, y and z. Dan doesn't like them and its easy to understand why\\*. In a strict blackletter font, roman x, y, z structures stand out next to all the straight-sided forms. Many blackletters solve this integration problem with cursive forms for v, w and y, with straight sides (or at least one straight side). Traditional blackletter \"x\" is very abstracted, and not compatible with your font (people simply would not accept it). That leaves s and z as oddballs---\"z\" can be made with straight sides, but is a risky solution. Rounded \"s\" form isn't a problem in schwabacher and fraktur; textur s's have square sides.\n\nThese are crucial factors that will help determine whether to keep c, e, o, b, d, p, q rounded, or flatten or even fracture their sides. Decision time...which direction should the whole thing go? Flatten c, e, o, b, d, p, q and it will very likely go the blackletter route. Keep those letters rounded and defacto roman s, v, w, x, y, z forms will integrate much more plausibly; but the whole will still have tangible blackletter characteristics. Which direction you go depends how gothic, or roman you want it to be.\n\nThe most interesting thing about this font so far is the curious blend of gothic and roman elements. Making it decidedly blackletter could make it routine and predictable, and not particularly interesting compared to traditional blackletters. The best advice I can give is---keep it interesting :^)\n\nA quick rework:\n\n ![](http://web.archive.org/web/20150317222430im_/http:/typophile.com/files/eliasrework3.png)\n\n\\* upper arm of \"k\" thinned to obey stroke/ductus logic  \n\\* angled ends on ends that were horizontal  \n\\* redesigned \"f\" hood (your current version was too thick)  \n\\* less angle on stem ends\n\nAngling every stem end is optional and I only drew them to find out what it looks like. Some people like it that way---very uniform. I prefer variety of detail and a sensible amount of non-conformity to keep things stimulating.\n\nRhodaelian modularity:\n\n ![](http://web.archive.org/web/20150317222430im_/http:/typophile.com/files/rhodiemodular.png)\n\nThere are intelligent modular fonts and simplistic modular fonts. One thing I strived hard for with Rhodie was intelligent modular design in a blackletter-like font with straight sides---not easy.\n\n\\* \"w\" isn't just two v's stuck together  \n\\* \"u\" (not shown here) and \"w\" have shared form, but distinguishing details  \n\\* stroke ends on \"s\" are not straight diagonal lines---a shallow curve was neccessary to contrast with the straight diagonals of the spine---straight stroke ends were palpably wrong in context  \n\\* how an \"x\" can have straight sides---it only integrates properly in this kind of a font where straight sides dominate.\n\nVertziert Schwabacher I am working on:\n\n ![](http://web.archive.org/web/20150317222430im_/http:/typophile.com/files/verziertschwabach02.png)\n\n\\* example of cursive \"v\" and \"w\"  \n\\* new \"x\" is roman form but I made it fit in with modular details  \n\\* original y is roman form too but fits in for same reasons  \n\\* \"z\" is cursive blackletter form, I recommend it for your font  \n\\* traditional schwabacher \"s\" is just plain beautiful---sublime beauty. Consider adopting/adapting it  \n\\* cursive loop \"k\" is replacement for traditional schwabacher form, also recommend cursive loop design for your font.\n\nYour current \"s\" is not well integrated, but don't take that criticism too seriously. Lots of fonts, some quite successful, have an unintegrated \"s\" problem. If you decide to change your \"s\" the schwabacher form would be a good starting point. Study a few well-regarded schwabachers. Make sure you're looking at genuine, authentic schwabacher \"s\", as some schwabacher fonts have corrupted/bogus \"s\" forms. Forget textur \"s\", not suitable. Fraktur \"s\" offers possibilities too.\n\nIt's been a pleasure working on your font Elias.\n\n\\* I empathize strongly with your attitude to those diagonals Dan :^)\n\nj a m e s\n\n"
    },
    {
      "time": "29 Mar 2006 — 6:19am",
      "content": "\\> One detractor of blackletters is their reduced readability because they’re so modular.\n\nOn the contrary, blackletter has a lot more structural variety -especially in the extenders, the important place- than Roman.\\* You might be thinking of the textura sub-style, which does indeed do away with too many curves; but think instead of fraktur, and its sublime archetypical Yin-Yang \"o\".\n\n\\* [http://www.themicrofoundry.com/ss\\_fraktur1.html](http://web.archive.org/web/20150317222430/http:/www.themicrofoundry.com/ss_fraktur1.html \"http://www.themicrofoundry.com/ss\\_fraktur1.html\")\n\nhhp\n\n"
    },
    {
      "time": "29 Mar 2006 — 8:35am",
      "content": "Yes, alright, textur is the one with modularity problems. I wrote an essay on textur versus fraktur & schwabacher, the conclusion goes some thing like:\n\n\"Textur, that pious black broken bastard, gives the other two a bad reputation they haven't earned.\"\n\nI'm well aware of the differences between the 3 main blackletter types, having looked very, very closely at them. Even so, the blackletter = modular = unreadable myth clouds my perception. LOL.\n\n_On the contrary, blackletter has a lot more structural variety -especially in the extenders, the important place- than Roman._\n\nAbsolutely, especially fraktur and its rich \"o\" design. The structural wealth of schwabacher and fraktur is what makes them so great and roman so predictable. The uniformity/modularity of roman is what you'd expect from design decended from an authoritive, militant, regimented, heavily ordered culture---romanis de antiquitus.\n\nDo you think Koch's Klingspor Gotisch is an intelligent textur design compared to historic texturs from the 12th --- 15th centuries?\n\n_...think [...] of fraktur, and its sublime archetypical Yin-Yang “o”._\n\nI think of that at least once every week. It just shows up in my mind, like a template---an archetype. :^)\n\nj a m e s\n\n"
    },
    {
      "time": "29 Mar 2006 — 9:23am",
      "content": "\\> bastard, gives the other two a bad reputation\n\nBut even the fourth sub-style... bastarda? :-)\n\n\\> Do you think Koch’s Klingspor Gotisch is an intelligent textur  \n\\> design compared to historic texturs from the 12th —- 15th centuries?\n\nI'm not sensitive enough concerning historic blackletter styles  \nto have a reliable opinion on that. But I do like Koch's design.\n\nhhp\n\n"
    },
    {
      "time": "29 Mar 2006 — 8:29pm",
      "content": "What a big contribution James! Thanks very much!\n\nLet me say something about:\n\n<cite>I think that your “pen angle” on top of the b, d, and l is too steep.</cite>\n\n<cite>Yes. Even tho this design is synthetic its pen-derived nature should not be neglected. The angled stem ends do not feature realistic nib &amp; ink details but are abstracted with their crisp geometric precision, and suggestive of calligraphic forms. Therefore at least make the angle realistic to make the motif authentic. It may sound contradictory, but abstracted design can have realistic qualities.<br>\nIs all this philosophical design justification neccessary? Not absolutely, but it definitely gives insight into your design and aids in solving various kinds of problems :^)</cite>\n\nYes Dan and James, I do agree with you. I need to improve my ductus logic. I’m doing, but this kind of modifications needs what we use to say here in Brazil “tempo de gaveta”. Its sounds like take time to the forms get mature. I’m thinking about it. ;-)\n\n<cite>If you break the curve in one or two places along the letter, you won’t loose any rotunda-ness… </cite>\n\n<cite>After a quick look, I think that the c, e, and o are too round. Have you tried “breaking” their curves?</cite>\n\n<cite>Try it Elias, keep it subtle, flattening only a small amount, and the b-q, d-p pairs to match, to better integrate those letters with the straight-sided h, n, m.</cite>\n\n<cite>Another potential reason for flattening the rounds is to instill a stronger blackletter heritage—-if blackletter is the direction you want to go in.</cite>\n\nPerfect Dan and James that is the point! Benedicta is a Sans, with some kind off Blackletter’s reference and not a Blackletter at all. It’s made me timid to do this kind off modification; I’m not going on old styles direction but try to give some classic appeal to the modern forms. But I'll try it once more :-)\n\n<cite>The alternative is to leave the rounded letters rounded—-to contrast with the straight-sided guys. This approach is found in most sans serifs, eg: officina, frutiger, futura. Not many people question the design logic of those fonts or complain they lack integration.</cite>\n\nYes James! You were very accurate on your speech! It is definitely the point again. I think the Benedicta is what Vox/AtypI classify like a Humanistic Sans, a kind of sans project that redefine classic forms or a classic review eg: Optima, ITC Officina, FF Meta… But instead of an italic renaissance references, I’m looking for a German ones. So, I’m not intending to make a Blackletter typeface but a Humanist Sans with Blackletter’s references. It’s change everything. It’s why my structures do not match in the least with the old German forms.\n\n<cite>The shape contrast is taken for granted, as a defacto standard in roman type design. The advantage of contrasting forms—-rounded versus rectangular—-is maintaining differentiation and readability.</cite>\n\nRight! This first version of Benedicta is for headings and not for long texts, so I prefer to keep the strong forms and contrasts of the Blackletters and balance it with the clarity and legibility of the sans. I thought that it could be interesting! ;-)\n\n<cite>One problem to tackle is deciding on structures for x, y and z. Dan doesn’t like them and its easy to understand why*. In a strict blackletter font, roman x, y, z structures stand out next to all the straight-sided forms. Many blackletters solve this integration problem with cursive forms for v, w and y, with straight sides (or at least one straight side). Traditional blackletter “x” is very abstracted, and not compatible with your font (people simply would not accept it). That leaves s and z as oddballs—-“z” can be made with straight sides, but is a risky solution. Rounded “s” form isn’t a problem in schwabacher and fraktur; textur s’s have square sides.<br>\nThese are crucial factors that will help determine whether to keep c, e, o, b, d, p, q rounded, or flatten or even fracture their sides. Decision time…which direction should the whole thing go? Flatten c, e, o, b, d, p, q and it will very likely go the blackletter route. Keep those letters rounded and defacto roman s, v, w, x, y, z forms will integrate much more plausibly; but the whole will still have tangible blackletter characteristics. Which direction you go depends how gothic, or roman you want it to be.</cite>\n\nRight again! This kind of question has exhausted me and takes a lot off my time… But I think that this project is more disposed to be a Sans, so the roman forms of s, v, w, x, y and z sounds more according with my proposes. In fact I’m planning to draw some alternate Caps and lc letters more closely with the old forms. It would be released in alternate version of the Benedicta that could be combined with this actual version for specific uses. As you say: <cite>“Your current “s” is not well integrated, but don’t take that criticism too seriously. Lots of fonts, some quite successful, have an unintegrated “s” problem.”</cite> Some characters will call for fine-tuning adjusts to match with the whole but this way looks more interesting than blackletters way for me now… ;-)\n\n<cite>The most interesting thing about this font so far is the curious blend of gothic and roman elements. Making it decidedly blackletter could make it routine and predictable, and not particularly interesting compared to traditional blackletters.</cite>\n\nAs I think James! As I think :^D\n\nAbout the **quick rework** , I agree with some points like reduce the angle on stem ends and redefine the end of the “f” arch, but I’m not sure about angling the stem ends. I do prefer variety of details but in this case I think it reduce a bit of strength and make the left sides of the characters looks lower than they really do. Perhaps improve overshoots below the base line… But I’m not sure… I’ll save this comments for later, let me do the adjusts first ;^) All in all, tks for your interest ;-)\n\n**Vertziert Schwabacher** , amazing! Have you already post it here in typophile?\n\nJames, I really appreciate your contribution thanks a lot!\n\nI'm working on it and will post some news at soon...\n\nThanks for all guys, keep the comments!\n\ne.\n\n"
    },
    {
      "time": "23 Jun 2006 — 5:07pm",
      "content": "I just saw this thread on Benedicta for the first time and was wondering if you've managed to finish the face. I would be very interested in seeing the final product and reading what others have to say about it.\n\nPersonally, I'm extremely impressed with your concept and competence. When I saw Benedicta, I said out loud to myself, \"Wow, this is nice!\".\n\nI completely disagree with our colleague who said it was \"too raw\" and that you should make it a \"real mashup\". I believe simplicity is a virtue, and this proposed \"mashup\", as I understand it, would turn your face into the equivalent of an American pizza with everything but the kitchen sink on top. This is probably the reason I'm not very fond of your c ligatures (ch, ck), and don't much care for the h with the little bit of flab hanging to the left. Also, I much prefer the fl ligature in which the top end of the l sticks past the terminal of the f; I find the other (in which the f merges into the l, or vice-versa) distracting and a bit confusing.\n\nOther than that, your face is personable, energetic, and highly readable (provided those distracting ch and ck ligatures are not used). Can't wait to see your book weight, italic, caption and display sizes, small caps... ;-)\n\nP.S. Só descobri agora, com agradável surpresa, que você tem sua base no Brasil. Neste país em que a boa tipografia é pouquíssimo conhecida e ainda menos praticada, e em que a grande maioria dos pseudo-tipógrafos e designers têm uma fixação com tipos neoclássicos estáticos ou realistas, é muito bom ver talento como o seu.\n\n"
    },
    {
      "time": "25 Jun 2006 — 8:12am",
      "content": "_fixação com tipos neoclássicos estáticos ou realistas_\n\nErik, poderia explicar esta parte? Eu vejo muita coisa retrô por aí: anos 70, AvantGarde, swashes... mas acho que isso é uma tendência internacional do design gráfico mesmo.\n\n-- [omine.net](http://web.archive.org/web/20150317222430/http:/www.omine.net/)\n\n"
    },
    {
      "time": "25 Jun 2006 — 1:13pm",
      "content": "Eduardo, since your question strays considerably from the original topic, why don't we start another thread on the subject, preferably in English so all our colleagues can participate? I'll wait for you to re-post the message above as a new thread so I can write my reply, ok?\n\nCheers,\n\nErik\n\n"
    },
    {
      "time": "25 Jun 2007 — 5:06pm",
      "content": "Hello everybody,\n\nSince a few months without post, I finally have some news about Benedicta. I've made a few modifications on type structure to follow the ductal logic advices from typophili friends. I'm not sure yet about the \"s\", \"a\" and \"z\"... see the specimen **[here](http://web.archive.org/web/20150317222430/http:/typophile.com/files/benedicta%2003.jpg)** or in the downloads list above.\n\nI'm still working on lowercases adjustments, sketching the Uppercases. I will post these results here a.s.a.p.\n\ncoments is always welcome!\n\ncheers,\n\ne.\n\n"
    },
    {
      "time": "3 May 2012 — 12:40pm",
      "content": "(Com grande atraso)  \nSua Benedicta é realmente impressionante! A esta altura ela já está disponível para uso - isto é, pode ser baixada da web? Interessar-me-ia muito.  \nUm abraço do Brasil -  \nRonald Kyrmse\n\n"
    }
  ]
}
