{
  "id": "17772",
  "title": "Why is a zero often very contrast-less?",
  "forum": "Design",
  "tags": [

  ],
  "content": "I have very few expertise in typography, close to none, so please forgive me my possible abusage and misusage of terms.\n\nWhen reading books that employ so called ‘old style figures’ I often find the 0 (zero) so contrast-less. Take for example the font Hoefler Text, of which [Wikipedia](http://web.archive.org/web/20100602123324/http:/en.wikipedia.org/wiki/Image:Mediaevalziffern.png) has an image. This 0 seems so round, I don't think it's perfectly round, but at smaller sizes it almost appears so.\n\nThe 6 and 9 have much stronger contrast, also the lowercase o has much more contrast generally (in a serif font). Why doesn't the 0 look more like the o? I often tend to perceive the 0 as ‘the odd one out’ when reading for example dates like ‘1609’ in a book.\n\nAre there historical reasons for this shape, or am I seeing things that aren't that common at all. :)\n\n",
  "author": "<a href=\"/web/20100602123324/http://www.typophile.com/user/8037\" title=\"View user profile.\">Berteun</a>",
  "time": "<br>",
  "uid": "8037",
  "comments": [
    {
      "time": "",
      "content": "I've asked this before\\*. In my mind, those drawing contemporary faces using the stressless zero are blindly following a tradition that has been irrelevant for hundreds of years. It's unnecessary and jarring. There are definitely more sensitive ways to design an oldstyle zero that contrasts with the letter 'o'.\n\n\\* [See this Typo-L thread.](http://web.archive.org/web/20100602123324/https:/listserv.heanet.ie/cgi-bin/wa?A2=ind0309&L=typo-l&T=0&F=&S=&P=21815)\n\n"
    },
    {
      "time": "",
      "content": "I'll second that!\n\n"
    },
    {
      "time": "",
      "content": "Using this form does make sense. You indicated why: <cite>I often tend to perceive the 0 as ‘the odd one out’.</cite> I won't use the terrible R-word. An alternative approach could be to maintain contrast as found in lowercase o, but make the zero a bit lighter and rounder.\n\nBut the question surprises me. With the same argument (the R-word), type designers add a finial to sanserif lowercase l and sometimes i, plus serifs to uppercase I. Even in sanserifs, uppercase I and lowercase l can be distinguished without the finial as versals tend to be smaller and a bit bolder, and sometimes the l's top end differs from the I's anyway. Not to forget context. The finial even makes it hard to space these letters well. Not to mention that in sanserifs, a serifed I is easily mistaken for a T ... Yet this has been widely adopted -- <cite>blindly following a tradition</cite>? ;-)\n\n"
    },
    {
      "time": "",
      "content": "The old style 0 has the advangage that it is clearly different from the lower case o, which is nearly the same size. 0o--see the difference here in Georgia? I think it works--2006--see? In text Georgia is actually stressed, but on screen in small sizes it looks to be a ring. Incidentally, the outlines for the ring looking 0 are usually not two circles, but ovals with some resultant stress.\n\n"
    },
    {
      "time": "",
      "content": "I third that!\n\n"
    },
    {
      "time": "",
      "content": "\\> irrelevant for hundreds of years.\n\nWell, maybe not hundreds. I've come to believe that the drastically-different zero was mostly to help not the reader, but the distributor of metal type (back into the drawers) to make fewer mistakes; this is because when <cite>setting</cite> type (into the stick) you do it -nearly- blindly (if you're good). So/but yes, it's been a dumb idea for a while now.\n\n\\> type designers add a finial to sanserif lowercase  \n\\> l and sometimes i, plus serifs to uppercase I.\n\nYeah, but the good designers make sure those  \nfeatures don't stick out like a sore thumb!\n\n\\> in sanserifs, a serifed I is easily mistaken for a T\n\nBut clearly far less than all those sticks for one-another.\n\n\\> the outlines for the ring looking 0 are usually not  \n\\> two circles, but ovals with some resultant stress.\n\nNo, I think they're usually as [apparently] circular as possible.\n\n--\n\nDon't get me wrong, I think that form can be useful sometimes (heck, even <cite>Helvetica</cite> can be useful sometimes! :-) and it's possible that a certain designer can sincerely justify its continued use today, but almost all the time it is indeed a result of psychological lethergy.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I was looking right yesterday at osf Sabon Next zero.\n\n"
    },
    {
      "time": "",
      "content": "I used to have a problem with the wrong stress on Stempel Garamond's 0 but I now think that it is a valid alternative.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "More here:  \n [http://typophile.com/node/19212](http://web.archive.org/web/20100602123324/http:/typophile.com/node/19212 \"http://typophile.com/node/19212\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Useful! Thank you. What are the numbers?  \nBTW, I don't know if you did it on purpose, but  \nthe very first one (125) is actually a rare but  \ngood solution to the problem of the OS zero.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> What are the numbers?\n\nThese are the solution keys.\n\n"
    }
  ]
}
