{
  "id": "17770",
  "title": "Who designed the 4AD record company logo?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "In addition to doing many other things, Vaughan Oliver designed most of the 4AD record covers (for bands like Cocteau Twins, Modern English, This Mortal Coil, etc). I assume that he is also the person who designed the 4AD logo \\*itself\\* (which I’m trying to attach here and which in any case can be easily seen at [www.4ad.com](http://web.archive.org/web/20081025041909/http:/www.4ad.com/ \"www.4ad.com\")). However, I do not know for absolute certain that this is true. Does anyone know for sure who designed the 4AD logo? Thanks!\n\n| Attachment | Size |\n| --- | --- |\n| [4ad\\_small.jpg](http://web.archive.org/web/20081025041909/http:/typophile.com/files/4ad_small.jpg) | 3.93 KB |\n\n [‹ Balliard by Matthew Carter](http://web.archive.org/web/20081025041909/http:/www.typophile.com/node/17829 \"Go to previous forum topic\") [Swiss typographer Marcel Nebel ›](http://web.archive.org/web/20081025041909/http:/www.typophile.com/node/17719 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081025041909/http://www.typophile.com/user/11392\" title=\"View user profile.\">markymark101</a>",
  "time": "<br>",
  "uid": "11392",
  "comments": [
    {
      "time": " 7.Feb.2006 2.32pm",
      "content": "I would say Vaughn Oliver did. Or Chris Baggs. Or the two together.\n\n"
    },
    {
      "time": " 7.Feb.2006 3.13pm",
      "content": "thanks for the reply, who is Chris Baggs? I googled him without much luck.\n\n"
    },
    {
      "time": " 7.Feb.2006 3.21pm",
      "content": "I think he works/ed with Vaughn Oliver at Beggar’s Banquet.\n\n"
    },
    {
      "time": " 7.Feb.2006 7.05pm",
      "content": "Chris Bigg is the man’s name, actually. And he is responsible for most of the calligraphic work at V23, aka Envelope 23.\n\n"
    },
    {
      "time": " 7.Feb.2006 9.02pm",
      "content": "Vaughn did the logo\n\nIt was before Chris’s time\n\nBack when Vaughn was a partner with Nigel Grierson, the photographer\n\n"
    },
    {
      "time": " 7.Feb.2006 9.42pm",
      "content": "Have you seen the [Wikipedia entry](http://web.archive.org/web/20081025041909/http:/en.wikipedia.org/wiki/4AD) for **4AD**? It says, in part: “It was originally formed as Axis Records, but this was quickly changed to 4AD when it became apparent that the name Axis was already being used by another music company. The 4AD logo is a spoof of the AAD Audio CD process designation.”\n\nDon’t know whether this is true or not. However, there is a lengthier, very detailed history of the label (cited in the Wikipedia entry) on a site called [Facing the Wrong Way](http://web.archive.org/web/20081025041909/http:/www.fedge.net/ftww/index.html). Go to their Features section and you will find the history of the label.\n\nYou might also try your luck searching in Rick Poynor’s book, [Vaughan Oliver: Visceral Pleasures](http://web.archive.org/web/20081025041909/http:/www.amazon.com/gp/product/1861540728/qid=1139374971/sr=1-23/ref=sr_1_23/002-3207693-3888066?s=books&v=glance&n=283155).\n\nAnother good bet is an older book, [This Rimy River](http://web.archive.org/web/20081025041909/http:/www.artbooks.de/v23/trr.html), which is the catalog for a v23 exhibition.\n\nLast but not least, and hard to find: [Issue 9 of Emigre magazine](http://web.archive.org/web/20081025041909/http:/www.emigre.com/EMag.php?issue=09) had interviews with Vaughan Oliver and Ivo Watts-Russell (4AD’s owner, at least back then)...\n\n"
    },
    {
      "time": " 7.Feb.2006 9.43pm",
      "content": "oops. Norman’s post appeared while I was busy typing mine.\n\n"
    },
    {
      "time": " 8.Feb.2006 8.48am",
      "content": "Nice! Glad there are others who have memories much stronger than mine. :^)\n\n"
    },
    {
      "time": " 8.Feb.2006 9.25am",
      "content": "I read somewhere — I can’t remember where — that they chose ’4AD’ because this was the true year of Christ’s birth. That, and it sounded cryptic and mysterious.\n\n"
    },
    {
      "time": " 8.Feb.2006 9.57am",
      "content": "fyi:\n\nI have a brand new copy of Vaughn’s monograph for sale on ebay **(Item number: 4610046473)**. I received it as a gift and already own a copy.\n\n"
    },
    {
      "time": " 8.Feb.2006 12.05pm",
      "content": "Thanks for the replies - Norman, you’re the only one who states definitively that Vaughan Oliver did the logo... I’m not being facetious, but how do you know? I mean, I know he was the house designer, but is that in itself hard evidence that he did the logo?\n\nI do know that 4AD’s first couple of records did not have the logo and only starting getting them a year or two later after Oliver joined them. This suggests that he’s the designer, but again is not evidence...\n\n"
    },
    {
      "time": " 8.Feb.2006 2.35pm",
      "content": "I would trust Norm. He wouldn’t post unless he really knew.\n\n"
    },
    {
      "time": " 8.Feb.2006 8.03pm",
      "content": "Yes, Vaughn designed the 4AD logo.\n\n"
    },
    {
      "time": " 9.Feb.2006 11.43am",
      "content": "Regarding the origin of the 4AD label name, as far as I know it was a play on the words “1980 FORWARD” which appeared on an early flyer. As mentioned by Ricardo, the original label was called AXIS, but they had to change it because some other company already had the name. However, during the first year of the record company they had already put out a couple of records under the AXIS name. An AXIS flyer they had produced in order to advertise these releases (which were put out in 1980) had the following play on words printed on it:\n\n1980 FORWARD  \n1980 FWD  \n1984 AD  \n4AD\n\nFrom what I know, Ivo and Peter (the founders of 4AD) were scrambling for a new name for the company and took “4AD” from this flyer.\n\nIn any case, I’m getting a tattoo of the label in a couple of weeks so this is why I brought it all up to begin with!\n\n"
    },
    {
      "time": " 9.Feb.2006 12.20pm",
      "content": "marky\n\ni worked in london and new some of those guys- so - i asked!\n\n"
    },
    {
      "time": " 9.Feb.2006 12.59pm",
      "content": "coo - thanks!\n\n"
    }
  ]
}
