{
  "id": "1778",
  "title": "Scanline display font",
  "forum": "Bitmap Display / Script",
  "tags": [
    "Bitmap Display / Script"
  ],
  "content": "thoughts or criticism welcome:   \n   \n ![printmaster](http://web.archive.org/web/20150424022423im_/http:/www.typophile.com/forums/messages/29/1911.gif)\n\n",
  "author": "afo",
  "time": "1 Aug 2002 — 9:31am",
  "uid": "830",
  "comments": [
    {
      "time": "2 Aug 2002 — 1:29am",
      "content": "Really nice & coherent specimen!   \nBut what happened to the 4?   \n   \nG.\n\n"
    },
    {
      "time": "2 Aug 2002 — 1:36am",
      "content": "This looks good. Fine work.   \n   \nWhat I like about the idea, even if it wasn't ment to be, is the way this type becomes a colour (gray) of its own.   \nInteresting would to combine this with a text type. In which you experiment with the width and the distance between the 'lines'.   \nYou could even try to make a family with for example 9 wheights (10% gray, 20% gray, etc....)   \n   \nJacques\n\n"
    },
    {
      "time": "2 Aug 2002 — 9:33am",
      "content": "And have a \"base\" font too, for coloring.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Aug 2002 — 1:36pm",
      "content": "it looks like an interlaced gif halfway downloaded. its great. was that the intention?\n\n"
    },
    {
      "time": "4 Aug 2002 — 9:40pm",
      "content": "It's genius, Andrew. Like the work on your site   \nit is both technocool and useful. Splendid.   \n   \nI don't see anything wrong with the '4', but I'd   \nlike to see a 'y' with a tail like the 'g's tail.   \n   \nDo not give this font away.   \n   \nStephen\n\n"
    },
    {
      "time": "5 Aug 2002 — 11:27am",
      "content": "Nice, Andrew. Interestingly, I've done something   \nvery similar some time ago:   \n   \n ![typost.gif](http://web.archive.org/web/20150424022423im_/http:/www.typophile.com/forums/messages/29/1946.gif)   \n   \nIn my case, it wasn't exactly a \"scanline\" font,   \nas I used both odd and even lines as I wished. It   \nwas made for a small project, and I didn't bother   \nthen to design all characters, only letters and   \nnumerals. Also, some of these characters weren't   \nreally worked up, as they wouldn't be used at all.   \n   \nI like the narrow fit of your characters, and the   \ncolor is quite even.   \n   \nregards,   \nR\n\n"
    },
    {
      "time": "5 Aug 2002 — 12:36pm",
      "content": "Andrew, nice stuff. BTW, it reminds me a little of those letters on clothing/towel tags and such.   \n   \n----   \n   \nRodolfo, what about that font you used for your typographi.ca banner? (V2000?) It looks interesting, like it has \\*vertical\\* scanlines, and it's made of two fonts that combine in different colors or something... Wazzat?   \n   \nhhp\n\n"
    },
    {
      "time": "5 Aug 2002 — 7:08pm",
      "content": "thanks so much for the replies   \n   \nJacques - I don't believe I fully understand what you're saying - but what I think are your ideas are interesting - I'd imagine transposing the 'texture' of this font under a different / more typical screen font could maybe lead to some surprises.   \n   \nthe font came from a few different ideas, most prevalent was the old DOS boot-up screen font; I'm pretty sure that has the same 'scanline' look to it. also old fonts that worked w/ dot matrix printers... anyway there's gotta be at least a few fonts like this already in existence... like rodolfo's ;)   \n   \nfound the limitations in making this font to be interesting though, which is pretty much why I made it.. I definitely agree with you stephen about the 'y'... sticks out like a sore thumb actually   \n   \nagain thanks very much for your comments and ideas. it means a lot, I don't know what I'm doing :D   \n   \n- andrew\n\n"
    },
    {
      "time": "5 Aug 2002 — 8:56pm",
      "content": "Andrew, make Paul Rand with his striped version   \nof City for IBM the first of us. ;)   \nYour face has merits, mine was an incomplete   \none-off affair.   \nAbout the 'y': what's interesting is that you've   \nachieved almost an italic construction in letters   \nlike b, g. Quite a feat, considering the   \nconstraints. You should try to obtain the same   \nsuppleness in other characters, like the y that's   \nbeen mentioned. Just as an experiment, I've tried   \ntwo alternatives to your y:   \n   \n ![temp_ac.gif](http://web.archive.org/web/20150424022423im_/http:/www.typophile.com/forums/messages/29/1948.gif)   \n   \nI've also fiddled with the v and the d (in the word   \n'traded'). You could try to 'italicize' more your   \ndesign (italicize, not slant ;)   \n   \n   \n\\>Rodolfo, what about that font you used for your typographi.ca banner? (V2000?) It looks interesting, like it has \\*vertical\\* scanlines, and it's made of two fonts that combine in different colors or something... Wazzat?   \n   \nHrant, that 'font' was done in fact for print. It   \nwas a set of pseudo-bitmaps I designed to use in   \na poster. The idea was that odd and even \"vertical   \nscanlines\" were differently colored - but with some   \n\"pixels\" out of place according to letter structure   \n(in the case of the typographica banner, \\*many\\*   \npixels). This construction principle allowed different   \nshapes to emerge. I think I have an image of the   \nthing as it was used somewhere. If I find it, I'll   \npost it. V2000 was a codename (the poster was   \ncalled \"Verão 2000\", which means \"Summer 2000\".)\n\n"
    },
    {
      "time": "6 Aug 2002 — 6:17am",
      "content": "Hi Andrew,   \nIve made a very quick Pix to show what i meant.   \n   \nJacques\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150424022423im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">GrayscaleType.swf<br><a href=\"http://web.archive.org/web/20150424022423/http:/www.typophile.com/forums/messages/29/grayscaletype.swf\"><b>grayscaletype.swf</b></a> (25 k)</td></tr></table></center>!-/attachment-!\\>!-attachment:\\> \n"
    },
    {
      "time": "6 Aug 2002 — 6:22am",
      "content": "it is maybe difficult to see, but i made 9 a's with 9 different stroke thickness. This leads to a kind of grayscale.   \nI used appr. 30° angled strokes. And the distance between the strokes i in all 9 a's equal.   \n   \nThis is the principle I meant.\n\n"
    },
    {
      "time": "6 Aug 2002 — 7:50pm",
      "content": "Rodolfo, the changes you've made work well for me, especially the 'd' which is a great improvement - same with the two 'y' characters... I think I'll do more fiddling :D   \n   \nJacques, I see what you mean. I doubt your idea would be possible for me - although it's worth trying, if only for the fact that it would be impossible ;)\n\n"
    },
    {
      "time": "7 Aug 2002 — 8:56am",
      "content": "It seems nothing hasn't been said, this \\*is\\* a very nice face. One thing I appreciate the most is that while it may qualify as a bitmap font by construction, because of it's color it is very readable as well as legible due to the fact that it does have a somewhat humanist bent. Very nice. -- As for usage, what about mobile phones or PDAs?\n\n"
    },
    {
      "time": "7 Aug 2002 — 2:37pm",
      "content": "Hmm...is that font actionscripted or just straight drawn Fonthausen? Very interesting idea if actionscripted...I have long thought of making a non-bitmap actionscripted font. This could be done using just lines and circles...   \n   \nMatthew\n\n"
    },
    {
      "time": "8 Aug 2002 — 12:43am",
      "content": "Matthew,   \nto be honest it is just drawn. But your Idea is good. Or for print, we could think about MM!   \n   \nJacques   \n   \nPS: waarom kan ik jouw website Nederlands instellen? Ben jij nederlands, of spreek je het misschien?\n\n"
    }
  ]
}
