{
  "id": "17796",
  "title": "Relabeling how a font's name shows up in Quark",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello all - Here’s what I am trying to do. For the past 7 years, we have been using Suitcase and have changed our font library of Postscript Type 1 Outlines and suitcases so that when a typesetter brings up the Quark Character box they can choose a font by typing very little. For example: a1helv = Helv regular, a2helv italic = Helv Italic, bb1Eras Regular = Eras Regular - This system has worked great for us in OS8 - OS9.2, but for OS 10.4 that we are changing to for Quark 6.5, all of my fonts are working the same way using Font Book and Suitcase Fusion v1 except for about 3-4 of them. In particular Helv italic and Times Italic appear everywhere but give a “May be corrupt and substituted by Courier” message when printing out of Quark. I’ve purchased Linotype Helveticas yesterday in an OpenType flavor and cannot seem to figure out how to change the name that appears in the Quark menus correctly. We do about 400 orders a day and have a back-catalogue of half a million orders so I would love anyones input in how to proceed. I am not against buying FontLab but I did try with the demo to open a good Helv Italic face and change it to an a2 named font but my resulting Type1 and Truetype fonts didn’t seem to work , but that could have been “operator error” as I am not the least bit familiar for all those options and setting :)  \nthanks  \nJim Robidoux  \n [jim@bcecards.com](mailto:jim@bcecards.com)  \nDerry, NH\n\n [‹ Does anyone still use merged/harmonized Postscript fonts?](http://web.archive.org/web/20071030193535/http:/typophile.com/node/17809 \"Go to previous forum topic\") [Univers Condensed Light ›](http://web.archive.org/web/20071030193535/http:/typophile.com/node/17764 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071030193535/http://typophile.com/user/11407\" title=\"View user profile.\">jimphot0</a>",
  "time": "<br>",
  "uid": "11407",
  "comments": [
    {
      "time": " 8.Feb.2006 12.24pm",
      "content": "This may shed some light:\n\n[http://www.quark.com/service/desktop/support/techinfo/view.jsp?faq\\_id=38...](http://web.archive.org/web/20071030193535/http:/www.quark.com/service/desktop/support/techinfo/view.jsp?faq_id=386 \"http://www.quark.com/service/desktop/support/techinfo/view.jsp?faq\\_id=386\")\n\n"
    },
    {
      "time": " 9.Feb.2006 12.21pm",
      "content": "Thanks Mark, but the FontSilencerXT will not allow valid corrupt fonts to be announced and we take many customer fonts for their jobs - The folks at FontLab suggested I buy TypeTool 2 for the Mac for renaming. What I thought I could do but hasn’t worked yet is to open a viable Helvetica Oblique and basically just change the correct names within the font to the a2HelveOblique that I need and re-export it to the a “noncorrupt” font. The ID names and numbers in Quark are very particular so I haven’t gotten this to work yet. Anyone have any ideas?? Thanks\n\n"
    }
  ]
}
