{
  "id": "17807",
  "title": "hello out there!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "sometimes, when i’m logged on to this forum, i wonder what all of you are doing out there as you are typophiling. right now, we’re all logged in and yet, we are in different parts of the world, at different times of the day, doing different things.\n\ni’ll go ahead and assume that most of us are near a computer, but where? you could be sitting at a coffee shop with a laptop, or in the comfort of your own home. some of you might be the principle of your studio in the corner suite, others may be huddled in a cubicle, sneaking a peak at your recent posts.\n\nis your spouse getting a little jelous or are you almost late for work?\n\nthe sun went down 30 minutes ago. my boss and co-workers are gone. it’s nice and quiet in the studio. i’m staying a little late, trying to get this project done, realizing that i’ve just spent way too much time crafting this post. what about you?\n\nnick cottrell\n\n [‹ Using kerning assistance - Fontographer](http://web.archive.org/web/20080502182959/http:/typophile.com/node/17855 \"Go to previous forum topic\") [You'll get a bang from this article ›](http://web.archive.org/web/20080502182959/http:/typophile.com/node/17733 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080502182959/http://typophile.com/user/9718\" title=\"View user profile.\">istitch</a>",
  "time": "<br>",
  "uid": "9718",
  "comments": [
    {
      "time": " 8.Feb.2006 10.35pm",
      "content": "I was sleeping when you posted this (yup, I do that once in a while).\n\nBefore that I was on the couch in our living room working on my laptop, listening to some [Lamb](http://web.archive.org/web/20080502182959/http:/www.lamb.tv/home.html) and tinkering away at a suite of 3 co-ordinated logos till 2 am while my wife and kids were sound asleep upstairs.\n\nEven before that I did a sweep of the Type ID Board and cleaned a whole bunch of threads. After I e-mailed the logos to the client I couldn’t resist checking in on [PVP](http://web.archive.org/web/20080502182959/http:/pvponline.com/).\n\nRight now I’d better get busy giving the kids their breakfast. :^) Laters.\n\n"
    },
    {
      "time": " 9.Feb.2006 4.58am",
      "content": "It’s afternoon, nearly 15.00 here, and I’m waiting for a large Photoshop document to open (my excuse for surfing). I work from home, so I don’t have office hours, and can work anytime. The older child is already back from school and I should soon go and get the younger one from the afternoon care. Then it’s back to the computer until it’s time to cook the dinner...\n\n"
    },
    {
      "time": " 9.Feb.2006 5.22am",
      "content": "It is 3pm afternoon here, I have just moved out from my old workplace but not in the new one yet :), sitting on a computer case in my living room as I type this. The beauty of my profession - my head and view is the main value of it, so I can actually work everywhere. I love that. I don’t have any children and my sig.other is freelancer too, so we share a lot of mutual understanding about unconventional work hours and stuff.\n\n"
    },
    {
      "time": " 9.Feb.2006 1.43pm",
      "content": "I’m sitting here (home) having just eaten breakkie, (Berry-Berry Nice & cup of coffee), just finished a poetry book cover (Maple…mmm!) and waiting for:  \n1) business parter to turn up,  \n2) Client to reply to my email telling them that we will not work for the shitty rates they propose beacause “this project presents an exciting opportunity to develop and expose your book work.” BEWARE of these statements.  \n3) Inspiration  \n4) Motivation to finish a billion typefaces  \nWhile I listen to My Bloody Valentine, following a good, loud play of Nirvana “Silver” out-takes and contemplating that last episode of Six Feet Under that aired here last night.\n\nEt vu?\n\n—K\n\n"
    },
    {
      "time": " 9.Feb.2006 2.55pm",
      "content": "I just got home from the office where I do more management than design these days. I am in my home office puttering on my type designs. My wife is teaching piano in her studio off of our living room. My son is watching ESPN. I am also downloading a new recording of Verdi’s Falstaff from the Apple iTunes Music store. Soon, I will call my daughter in Pittsburgh, she is a senior at Carnegie Mellon University.\n\nChrisL\n\n"
    },
    {
      "time": " 9.Feb.2006 3.38pm",
      "content": "It’s after 5 p.m. here. I got home from picking up my daughter from school a little while ago. She is watching one of the two half hour shows a day she is allowed to watch. I am at my desk in my home office where I spend most of the day. It’s been snowing all day and I’m wondering how soon I will need to shovel the sidewalk again. My partner just called to say she is coming home from her office and discuss dinner plans. I just set the oven to pre-heat.\n\n"
    },
    {
      "time": " 9.Feb.2006 3.47pm",
      "content": "Hey, this is just like a typical blog, except each entry is from a different writer. :-P\n\n"
    },
    {
      "time": " 9.Feb.2006 4.01pm",
      "content": "i usually have typophile in the background while i’m working: today it was kerning... all day. Now, i’m at home working on the table of contents for my family cookbook and “watching” Wheel-of-Fortune. I think i have typophile on every hr i’m awake!\n\n"
    },
    {
      "time": " 11.Feb.2006 8.07am",
      "content": "it’s great to hear from all of you. i’d say this thread is a small sample of the diversity that this forum has to offer...\n\n—————  \nnc\n\n"
    },
    {
      "time": " 11.Feb.2006 8.17am",
      "content": "It’s 5pm now, here in Central Europe. I’m at home drinking coffee. Saturdays give me time to work on what I want to work on… today I’m working on two display typefaces, one bigger one for Linotype, and a smaller one that isn’t.\n\nI usually have Typophile on at work, but try to keep my reading and posting time there to a minimum. I’ll post links to Linotype faces, or answer questions. Otherwise, I should stay away from it :-D\n\nAt work, I always have Vienna on in the background to keep tabs on every other type site (especially Jürgen Siebert’s [Fontblog](http://web.archive.org/web/20080502182959/http:/www.fontblog.de/)) via their RSS-feeds, but that only shows me new the new Typophile threads, not the new posts :(\n\nMy girlfriend began working on her graduate thesis on Monday, so my weekends are now all working weekends, too. Hopefully, this’ll be productive, and I’ll be able to bring some things to market by the summer.\n\n"
    },
    {
      "time": " 11.Feb.2006 2.17pm",
      "content": "My wife and daughter are taking a nap at the moment, so things are unusually quiet. It’s two pm here in Seattle. I’m sitting at the dining room table with my laptop, sitting in an Aeron chair, and occasionally glancing out one of the windows to admire the trees. We’re just outside Seattle proper, so there are tons of tall trees. The room has a lot of eight-foot windows, and some skylights. I’m sipping ice water from a huge acrylic tumbler that could hold one of those convenience store drinks. Next to me are: what’s left of the pile of mail I just sorted through, a biography of the Beatles, and some just-arrived items: the book “Real World InDesign CS2,” and CDs by Biff Rose and Ry Cooder. Maybe I’ll put one on to listen to.\n\nWe just got back into town late last night, and this morning I read an email that said a friend needed help moving. I called him up, but he now has plenty of help and suggested that I take it easy. So I am catching up on remaining email, and in a minute I will take a break from that and continue working - either on a typeface or on a DTP revival of an antique out-of-print board game.\n\nCheers,\n\nT\n\n"
    }
  ]
}
