{
  "id": "17811",
  "title": "WANTED: printed copies of \"corporate\" fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "One group of fonts I’ve always found fascinating is fonts used exclusively by a single corporation as part of their “corporate identity” programs. There are a number of such fonts for which I’m trying to find good quality printed copies.\n\nCurrently, I have a printed copy of the official logo font of IBM (without the stripes). The main ones I’m looking for are the following:\n\n\\*GTE (1971-2000 logo):  \n—Squarish font resembling lettering on a CRT screen. Used mostly during the 70’s in division names, such as:  \n——Sylvania (also used in newspaper ads for Sylvania TV sets, sometimes even on the sets themselves)  \n——Lenkurt  \n——Automatic Electric (Laboratories)  \n——General Telephone Directory Company  \n——General Telephone Company of (xxx)\n\n\\*3M (1961-78 “Mondrian” logo by Gerald Stahl)  \n—Font colloquially referred to as “Plumber’s Gothic”. Comes in upper and lower case with numerals. Bears a very strong resemblance to the Georg Trump font “City”.\n\n\\*Fisher Price (1971-)  \n—Serif font derived from the turn-of-the-century ATF newspaper font “Schoeffer”. UC/lc, numerals, most punctuation.\n\n\\*CBS Sports (1981-)  \n—Franklin Gothic Italic, with block serifs added. Currently can be seen in the NCAA logo.\n\nWould anyone happen to have any of these companies’ CI manuals? Or know of a way I could get my hands on them?\n\n [‹ Yet another baby name we'll pass on . . .](http://web.archive.org/web/20080410005353/http:/www.typophile.com/node/36204 \"Go to previous forum topic\") ['70s type roundup by Gene Gable at creativepro.com ›](http://web.archive.org/web/20080410005353/http:/www.typophile.com/node/36185 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080410005353/http://www.typophile.com/user/5524\" title=\"View user profile.\">rjschex</a>",
  "time": "<br>",
  "uid": "5524",
  "comments": [
    {
      "time": " 9.Feb.2006 7.54am",
      "content": "I’d say they’re probably derived from typefaces, but modified when drawn by hand for the specific logo in question.\n\nI know for a fact that’s how Doyald Young created the Prudential logo: he did the lettering based off a condensed version of Century Schoolbook (I think) and made customizations where he saw fit.\n\n"
    },
    {
      "time": " 9.Feb.2006 9.29am",
      "content": "Annual Reports might be your best bet - not sure if you can get them through your library, but requesting them through the company’s investor relations will likely work.\n\nAlso Ebay - [http://cgi.ebay.com/Lockheed-Annual-Report-1966-Aviation-RARE\\_W0QQitemZ6...](http://web.archive.org/web/20080410005353/http:/cgi.ebay.com/Lockheed-Annual-Report-1966-Aviation-RARE_W0QQitemZ6034101142QQcategoryZ2587QQrdZ1QQcmdZViewItem \"http://cgi.ebay.com/Lockheed-Annual-Report-1966-Aviation-RARE\\_W0QQitemZ6034101142QQcategoryZ2587QQrdZ1QQcmdZViewItem\")\n\n"
    },
    {
      "time": " 17.Aug.2007 2.27am",
      "content": "Well, I found an extremely good copy of one of the aforementioned fonts: “Plumber’s Gothic” from Harold’s Fonts. All the characters look exactly as I remember them.\n\n"
    }
  ]
}
