{
  "id": "17814",
  "title": "Generic 65",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "[Fleischman 65](http://web.archive.org/web/20150123190519/http:/www.themicrofoundry.com/other/Fman65.gif) has some functional features - bowls shortened, bracketting lightened on horizontal serifs, oblique serifs cupped, o's stress made vertical, the crotch of y deepened and v widened, different dots on i and j - which I've applied to a vanilla Baroque roman, Bitstream Aldine 721 (actually a slightly narrowed Plantin), for analysis by comparison. A few other tweaks were made: lachrymal serifs were nudged towards balls, bars on f and t were thickened, o and f were widened, extenders were lengthened to approximate Fleischman's proportions, serifs on s were emphasized, the axes of e and c were moved a little towards the vertical and caps were slightly lightened to match the colour of the lowercase. This is not meant to be a usable or original face! I hope you don't zoom in too hard: it's quick and dirty stuff, and it needs to be printed.\n\nThis is the eleventh version. It's architectural superiority to the original at 12 point is I hope now clear, though it's a bit rough.\n\n| Attachment | Size |\n| --- | --- |\n| [Generic 65.pdf](http://web.archive.org/web/20150123190519/http:/typophile.com/files/Generic%2065.pdf) | 28.64 KB |\n\n",
  "author": "George Horton",
  "time": "9 Feb 2006 — 5:02am",
  "uid": "9356",
  "comments": [
    {
      "time": "9 Feb 2006 — 7:27am",
      "content": "Hmm. Interesting exercise. Changing these few features didn't really change the original much. For example, you have changed the head serif, but not the foot that much. In the Fleishman scans, as well as the Farnham, Mercury and DTL Fleishman revivals, they all have the foot serifs much thinner. You have changed stress on the o but not the c and e accordingly. The joins of the m n on Fleishman are much thinner, the handling of contract on the o is different, etc., etc. And this doesn't even get into proportions. Any of the Fleishman revivals would look way different at text size, I would think, though I don't own any of them.\n\n"
    },
    {
      "time": "9 Feb 2006 — 7:47am",
      "content": "What an interesting exercise to show how overall texture can change!\n\n1) Is it set at 12 point?  \n2) Did you match the vertical proportions to the 65?  \n3) What about the spacing?  \n4) I would make the foot serifs totally unbracketed, or only  \nenough to simulate some typical gain (maybe 1/1000 inch).\n\n\\> You have changed stress on the o but not the c and e accordingly.\n\nWell, this is intentional.  \nIn fact it's arguably the single most distinctive mark of the 65.\n\nhhp\n\n"
    },
    {
      "time": "9 Feb 2006 — 7:59am",
      "content": "\\>Well, this is intentional.\n\nHrant, I didn't mean that the c and e have to have the same stress as the o. They are different in Fleishman 65, but the c and e don't have the heavy stress on the southwest squadrant that is characteristic of Plantin and Times New Roman, and which this face, even revised has. The c and e shouldn't be the same, but they should relate, which here they don't, just like the mismatch between head and foot serifs.\n\n"
    },
    {
      "time": "9 Feb 2006 — 9:28am",
      "content": "I don't get it. When you write \"c and e shouldn’t be the same,  \nbut they should relate\", I would ask of the first part: why not?  \nand for the second part I would say: I think they already do!\n\n\\> the mismatch between head and foot serifs.\n\nThat's intentional too.  \nUnless you're saying that that mismatch should be  \ncarried over to one between \"c\" and \"e\" (and \"o\")?  \nSorry, I guess I'm just confused.\n\nhhp\n\n"
    },
    {
      "time": "9 Feb 2006 — 9:45am",
      "content": "The aim was only to lightly apply some of the functional characteristics of F65 to a familiar set of unadventurous but well-made forms, and to me at least there's a noticable gain in readable clarity - casting one's eyes at the pages, words leap out of the 65 better than the 721. Taking the bracketting off horizontal serifs would rather dramatically alter what is after all a pseudo-Plantin - what is Plantin without it's massive brackets? - though I'll try it, and reset at 12 point. Spacing is unchanged, except on the widened f and v.\n\n"
    },
    {
      "time": "9 Feb 2006 — 10:23am",
      "content": "To clarity, hopefully: the weight of the c and e should relate to the o even though they have a different stress. In the original Fleishman 65 they balance. In the 'generic 65' they don't. My point was simply that if you wanted to make the generic look like Fleishman it would have a long way to go to get there. But I guess George's experiment was to see whether a few features would make a difference.\n\n"
    },
    {
      "time": "9 Feb 2006 — 11:34am",
      "content": "A new, 12 point version is up, with less bracketting and some more tweaks to, amongst others, c and e. Vertical proportions are more Fleischmanly, while maintaining the same line increment as 721.\n\n"
    },
    {
      "time": "9 Feb 2006 — 1:28pm",
      "content": "First: In case anybody's wondering about my #1  \nabove, it's because #65 was cut for ~12 point.\n\n\\> words leap out\n\nIf they do so not because of a color spike and not because  \nthey're capitalized, then that's a very good sign indeed.\n\n\\> the weight of the c and e should relate to the o\n\nOK, I get it - and I agree.\n\n--\n\nI'd like to suggest another mod:  \nLook at the dots on the \"i\" and \"j\" in the original #65: they're  \nunusually hefty\\* (especially in my high-fidelity 1908 scan) plus  \nthey're actually at different heights! To me those are very significant.\n\n\\* Something I've done in my Patria. When a type designer opines to me  \nthat \"the dots are slightly too heavy\", I know I'm right on the mark. :-\\>\n\nhhp\n\n"
    },
    {
      "time": "9 Feb 2006 — 2:07pm",
      "content": "My dots were already slightly differently aligned, but I've done as you rightly recommended.\n\n"
    },
    {
      "time": "9 Feb 2006 — 4:50pm",
      "content": "This has been gone over to make the two sources harmonise better: it's much less ugly now, and perhaps less ugly than the 721.\n\n"
    },
    {
      "time": "10 Feb 2006 — 10:24am",
      "content": "Although I think Platin is ugly in a very useful way.  \nIt's the unshaven mine worker among a crowd of pansy bureaucrats.\n\n\\> harmonise\n\nBut are the boumas jumping out as much as with the previous version?  \nI don't know, I'm just asking.\n\nhhp\n\n"
    },
    {
      "time": "10 Feb 2006 — 11:15am",
      "content": "<cite>But are the boumas jumping out as much as with the previous version?</cite>  \nFollowing a few tweaks, I hope they are. I'm not sure really - I made the changes that were screaming out to be made if the result was to look like something one could sit down and design from scratch.\n\nPlantin is one of the wonders of the world as a 9- or 10-pointer for pocket books\\*, but it's odd to think that Plantin's pleasant solidity in serifs and bracketting was meant not to be readable but to hide the impression of sharpness that inevitably came with printing on newly popular glossy paper. So Plantin was the first type designed to overcome the problem of that excess clarity which has, with digital printing, become universal.\n\n\\*The comparison between large-size Plantin and Romanee in Counter Punch is hilariously unkind to the former. There could hardly be two more different versions of the High Renaissance roman.\n\n"
    },
    {
      "time": "10 Feb 2006 — 2:21pm",
      "content": "\\>was meant not to be readable but to hide the impression of sharpness that inevitably came with printing on newly popular glossy paper\n\nWhere did you read this story of Plantin? I'd like to read it too. I don't think Plantin is ugly at all. It is a work horse, not a show horse, but a champion work horse. I am just reading in 'Print's Types of the Twentieth Century' that it was done to the same widths as Imprint, which was a regularized Caslon with a larger x-height--and also a work horse. And I don't know which story about Times New Roman is true, but it does look a lot like a sharpened Plantin (with Perpetua style serifs). So in a way you could say that one version of your exercise--clarifying Plantin--is Times New Roman!\n\nBy your lightening does give a cleaner impression, but it loses the comforting solidity of the original, without getting to the more clear and open look of Baskerville. So the interesting thing to me is that in lightening it up, something was lost as well as gained.\n\n"
    },
    {
      "time": "10 Feb 2006 — 3:18pm",
      "content": "\\> Plantin was the first type designed to overcome the problem of that excess clarity\n\n1) Are you sure? Where have you read that? From what I know it  \nwas designed to be \"sturdy\", but that's doesn't mean \"pudgy\".  \n2) If it's true, it would have been quite advanced, especially  \nfor its time. Not even to this day is there the general view that  \nwe suffer from \"excess clairity\" (although I agree we do).\n\n\\> The comparison between large-size Plantin and Romanee ...\n\nBut the key thing here is that Plantin was design to be set small.  \nLooking at it large can only be non-misleading if you know what to  \nlook for (and I'm not sure I do myself). You just can't have both.\n\nhhp\n\n"
    },
    {
      "time": "10 Feb 2006 — 3:38pm",
      "content": "\\>Plantin was design to be set small.\n\nYes, 'Printer's Types', that I referred to, has a fascinating graphic comparing Van Krimpen's drawings with the optically sized metal type cut by his punchcutter, A. Rosenberger. The small sizes dramatically increase the weight and make other subtle changes. Southworth's point is that Van Krimpen and other famous designers just trusted the production pros at the founderies to get it right.\n\n"
    },
    {
      "time": "10 Feb 2006 — 4:08pm",
      "content": "I can't remember where I read the Plantin story, but [this dissertation](http://web.archive.org/web/20150123190519/http:/www.typeculture.com/academic_resource/articles_essays/pdfs/tc_article_23.pdf) confirms that Plantin (1913) was \"a robust version of a Robert Granjon sixteenth century type for printing on art paper\", and it was made at a time when new designs were not produced except for new printing conditions: the only designs offered by Monotype in the pre-Morison period which were not maximally literal revivals (or rather just versions) were, I think, Imprint and Plantin. Imprint was for periodicals which needed a sturdy, efficient Caslon-a-like, and Plantin was for coated paper. And so Glaister's 1960 Encyclopedia of the Book still has it that \"For the printing of text on art paper (which is also known as coated paper) such heavy faces as Plantin or Times New Roman should be used\".\n\n<cite>So in a way you could say that one version of your exercise—clarifying Plantin—is Times New Roman!</cite>  \nI know - I caught a glimpse of TNR in Generic 65 after one of my revisions yesterday; it prompted a frenzied attempt to cover the evidence.\n\n<cite>the key thing here is that Plantin was design to be set small. Looking at it large can only be non-misleading if you know what to look for (and I’m not sure I do myself). </cite>  \nSure. The wonder of something like Plantin is that it could not possibly have been created by someone who drew the most beautiful letters he could and then tweaked them until they worked in text - at least in its final form (the design process would have involved an astonishing number of man-hours) it looks like it's been architected from scratch to fit a human sense quite unlike the ordinary large-scale vision for which Romanee was designed.\n\n"
    },
    {
      "time": "10 Feb 2006 — 5:08pm",
      "content": "\\> Van Krimpen and other famous designers just trusted the production pros\n\nActually, although most designers did trust their punchcutter,  \nVan Krimpen was not one of them: he looked down on them all the  \ntime as \"distorters\" (not [necessarily] his word), and never gave  \nhis own punchcutter (Rosenberger?) any [explicit] credit.\n\n\\> Plantin (1913) was “a robust version of ...\n\nBut/so then are you using \"clarity\" to mean \"lightness\"?  \nBecause I wouldn't.\n\n\\> it could not possibly have been created by someone who drew the  \n\\> most beautiful letters he could and then tweaked them until they  \n\\> worked in text\n\nIndeed, and that's what makes it a man (text font) among boys (display fonts).  \nAnd this \"you can't get there from here\" reality eludes many -otherwise  \nadmirable- Famous Designers:\n\n[http://typophile.com/node/13926](http://web.archive.org/web/20150123190519/http:/typophile.com/node/13926 \"http://typophile.com/node/13926\")\n\nhhp\n\n"
    },
    {
      "time": "10 Feb 2006 — 7:37pm",
      "content": "<cite>But/so then are you using “clarity” to mean “lightness”?</cite>  \nNo, not lightness - to have too much clarity is to give the impression that letters are not atoms, that they are assembled from a number of merely juxtaposed black elements. But that's not right either - it has something to do with too narrow a range of qualities of black and white, from shining to dull.\n\nYou're wrong about JvK, he worshipped the punchcutter in abstract and in particular (PH Rädisch, not Rosenberger). In his Letter to Philip Hofer he says that \"Without [Rädisch's] zeal and skill my designs could hardly have become the printing material they are\" - and this despite the fact the JvK's drawings were far more precise than, say, Gill's. Indeed van Krimpen's problem with Stanley Morison was that the Monotype design process obliterated the punchcutter's active and optical corrections; that's why he had every size of Monotype Lutetia made from Rädisch's punches as a separate typeface, with quite different relative widths from size to size.\n\n"
    },
    {
      "time": "11 Feb 2006 — 6:46am",
      "content": "That's strange, I was pretty sure I've read in more than one source  \nthat JvK wished punchcutters wouldn't \"interpret\" his designs so much.\n\n\\> the Monotype design process obliterated the  \n\\> punchcutter’s active and optical corrections\n\nI do know that he had major contentions with the Monotype  \nworks especially - but they <cite>did</cite> do <cite>some</cite> optical scaling, although  \nnot for each size.\n\nhhp\n\n"
    },
    {
      "time": "11 Feb 2006 — 9:21am",
      "content": "\\>PH Rädisch, not Rosenberger\n\nSorry, I mixed up the guy who cut punches for Zapf's early work and Van Krimpen's. The general point that Southworth makes about all the post-Benton pantographic cutters is that all relied extensively on the craftsmen (and women) at the founderies, and these made more of a contribution than is generally recognized. I suppose Goudy is an exception, for the faces he cut himself. --I wonder if they (Goudy's self-cut faces) were worse in craftsmanship?\n\n"
    },
    {
      "time": "11 Feb 2006 — 11:34am",
      "content": "<cite>I wonder if they (Goudy’s self-cut faces) were worse in craftsmanship?</cite>  \nGoudy went from drawings via patterns to his matrix-engraving machine, without any punches being cut or any optical sizing being possible.\n\n"
    },
    {
      "time": "11 Feb 2006 — 2:47pm",
      "content": "\\> without ... any optical sizing being possible.\n\nNot true. The Benton technology included provisions  \nfor optical scaling, and they actually tried to get  \nusers of the pantograph to maintain that attribute.  \nUnfortunately it was still easier <cite>not</cite> to bother with it,  \nto the point that even ATF gave up on it eventually.\n\nhhp\n\n"
    },
    {
      "time": "11 Feb 2006 — 3:28pm",
      "content": "Goudy's machine was simpler, and there's no sign that Goudy was aware of non-linear scaling. As he proudly wrote in Typologia, \"Since the tracing ball and the cutting cutting tool always bear the same ratio to each other which the work pattern bears to the point size of the type to be engraved, I contend that I can cut matrices for type from 8-point to 72-point from the same pattern and retain in each size the exact character of my original drawing, because each stem, hairline, serif or counter is enlarged or reduced proportionately. For instance, this book is set in [a number of sizes of UC Old Style], and all sizes have been produced from one set of raised work patterns\". This is one of the black marks against Goudy.\n\n"
    },
    {
      "time": "11 Feb 2006 — 3:53pm",
      "content": "1) Goudy had a pantograph that was customized to be <cite>simpler?</cite>  \n2) Being aware of something is different than thinking it's a good idea.\\* Isn't it hard to imagine that Goudy hadn't noticed, and nobody had ever told him, that different sizes have different (relative) widths, color, etc?\n\n\\* Like how Slimbach knows trapping exists (I presume) but doesn't put them in himself.\n\nCould we get a hi-res scan of the type in Typologia at two (very) different sizes?\n\nhhp\n\n"
    },
    {
      "time": "11 Feb 2006 — 5:24pm",
      "content": "1) Goudy didn't use an ATF-style pantograph: \"The matrix-engraving machine which I found entirely satisfactory was not primarily made for such work, but with a few alterations which the manufacturer kindly made for me at my request it performed my work accurately; and - what was quite important - the machine, including the alterations, did not cost more than I could afford.\" Goudy goes into great detail and there is no sign at any stage of adjustments for size - rather the opposite, he values complete consistency with his drawings, to a stated minimum precision of 0.0025 of an inch.\n\n2) It's just possible that Goudy could not have known. Optical sizing may not have been done consciously or consistently by most punch-cutters - Caslon, despite his italic Q, did not make his types darker or wider at small sizes, and Haultin likewise. And Goudy never had close relations with the works of any foundry, mistrusting them because he had no real idea what they did - his approach was the opposite of Dwiggins'. But it's true that Goudy may just not have seen optical sizing as a good thing, particularly in the context of letterpress, since - though spacing will suffer - it's possible to embolden small type in the printing of it.\n\nRidiculously I dont't have a scanner, though I should get one soon.\n\n"
    },
    {
      "time": "12 Feb 2006 — 12:41am",
      "content": "\\> Goudy didn’t use an ATF-style pantograph\n\nThis I didn't know!  \nMan, the things people\\* who know won't bother mentioning...\n\n\\* Like a certain crusty, seafaring typophile.\n\n\\> 0.0025 of an inch\n\nWell, considering his drawings were 9 inches high (right?)  \nthat translates to a lot of precision in a text-size matrix.\n\nBUT, the real question is:  \nHow fine was the diameter of the business end of the engraver?\n\nIf the matrix cutting bit wasn't too thin, that might  \njust explain why everything Goudy made was so... pudgy!\n\n\\> though spacing will suffer - it’s possible to  \n\\> embolden small type in the printing of it.\n\nIt's certainly true that -hefty- gain can get you halfway to optical scaling.  \nAnd it's possible that Goudy (like some other designers, including Gill)  \ndidn't consider spacing as a \"real\", worth-mentioning part of designing type.  \nSo maybe he did actually adjust the <cite>spacing</cite> of smaller sizes.\n\nScanner: get the one Raph has.\n\nhhp\n\n"
    },
    {
      "time": "12 Feb 2006 — 8:19am",
      "content": "The cutter could \"cut a line one and one-half thousands of an inch in width\"; the tracing-ball going round the pattern was in exact proportion with the cutter going round the matrix; and from this maximum accuracy Goudy \"attempted to limit any inaccuracy in the matrix to not more than two-ten thousands of an inch\". Relying on a tracing ball without hand-correction of the matrix will make perfect interior right angles impossible, and one and a half thousands of an inch plus one thousandth for inkpress does make for a certain pudginess - it's thicker than the average human hair.\n\n"
    },
    {
      "time": "12 Feb 2006 — 11:05am",
      "content": "\\> one and one-half thousands of an inch in width  \n\\> ...  \n\\> not more than two-ten thousands of an inch\n\nAha - there you go.  \nI don't know how much the hair anology can click, but suffice  \nit to say that at text font sizes, that's really pretty massive.\n\n\\> Relying on a tracing ball without hand-correction of the  \n\\> matrix will make perfect interior right angles impossible\n\nNot to mention trapping. Which is why foundries of quality (like Amsterdam)  \nwho resorted to pantographs still had the sense of craft to sharpen some key  \ncorners by hand (I actually have a photo of a whole bank of such workers).\n\nSo one could safely say that the \"friendliness\" attributed to  \nGoudy's designs were in some part due to the limitations of  \nhis hardware (coupled with his apparent acceptance of these  \nlimitations = his eschewing of more refined techniques).\n\nIt wouldn't be the first time that a tool has affected the  \nresults so much; some people think the same of beziers!\n\nhhp\n\n"
    },
    {
      "time": "12 Feb 2006 — 12:17pm",
      "content": "Here's that photo - the caption being the juicy part:\n\n ![](http://web.archive.org/web/20150123190519im_/http:/typophile.com/files/LAmsterdam.gif)\n\nThe great -numeric- disproportion between the first and  \nsecond rows of workers was probably an early ominous sign  \nthat <cite>quality</cite> simply couldn't survive in the marketplace. :-/\n\nhhp\n\n"
    },
    {
      "time": "12 Feb 2006 — 4:11pm",
      "content": "Hrant,\n\nAm I missing something? Where does it say anything about \"trapping\"?\n\nNice pic though?\n\nGerald Giampa\n\n????????????\n\n(Only joking.)\n\n"
    },
    {
      "time": "13 Feb 2006 — 10:06am",
      "content": "Yeah.  \n\"And where does it say you can't cut type with an oil drilling rig?\"\n\n--\n\nBTW, there's a really disingenuous passage in Vrest Orton's \"Goudy - Master of Letters\", where the author recounts a meeting between Goudy and an unnamed Monotype guy. Lightly edited:\n\nGoudy: Now when you're cutting your matrix from the tracing of the  \npattern, just how accurate do you make the line?  \nGuy: We find one-thousandth of an inch sufficient. What do you find?  \nGoudy (\"quietly, as if it were unnecessary to state it\"): I find that two ten-thousandths of an inch is not <cite>too</cite> accurate. That isn't perfect, but  \nI need <cite>some</cite> leeway.\n\nAs the f\\*\\*k if.  \nIn Lebanese-Armenian slang, that's called \"zood filim\": pure making movies.\n\nhhp\n\n"
    },
    {
      "time": "13 Feb 2006 — 11:59am",
      "content": "By and large Goudy would have been able to stay within two ten-thousandths of an inch of his drawings, because his drawn angles are generally slightly bracketted anyway (as one would expect from continuous freehand lines). The only exception I can think of is Deepdene, which the Berthold cutting (presumably from matrices or print) pudgifies, but which the LTC (from drawings) does not - but then Deepdene is a creative misinterpretation of Lutetia, like those jolly Medieval versions of the Greek myths which gave Daedalus a tonsure and a ready oath, and it was made in the belief that it would have to be redrawn by Monotype in any case.\n\n"
    },
    {
      "time": "13 Feb 2006 — 12:20pm",
      "content": "1) There's no way Monotype could only manage 1 mil on the actual type.  \nThe \"guy\" must have been talking about the pattern, and Goudy I'm sure  \nrealized that (assuming he had seen any Monotype samples), he just wanted  \nto deploy some filim.  \n2) The two ten-thousandths would hold up fine... as long as the line didn't  \nhit another line! :-/ But since every letter except the sans \"el\" is more than  \na mere stick, the heft of the cutting element makes that claim of precision  \nillusionary, if not outright deceptive.\n\nBasically, Monotype was more precise than Goudy.  \nPretty much anybody was. Until the 90s.\n\nhhp\n\n"
    },
    {
      "time": "13 Feb 2006 — 3:16pm",
      "content": "<cite>Basically, Monotype was more precise than Goudy.<br>\nPretty much anybody was. Until the 90s.</cite>  \nYup - though, of course, if the two lines join with a curve which is no sharper than the circumference of a circle of 0.75 mils radius, then Goudy's in the clear. His drawings don't as far as I know include any traps.\n\nBy the way, I'm not sure the blame has to be laid on Goudy in that bit of filim. Goudy really was, in large and central senses, pretty dim - an endearingly bad writer, with a special gift for the quotation which is not a quotation (\"'time marches on'\"), and a scholar of type who still thought Garamond designed the type he revived as Garamont in 1946, twenty years after the Beatrice Warde article on Jannon. Perhaps he just didn't realise that the tracer ball was necessarily softening his angles (he was no geometer), especially since he lost the sight in one eye the same day he succeeded in making a cutting tool that worked.\n\n"
    },
    {
      "time": "13 Feb 2006 — 3:32pm",
      "content": "\\> still thought Garamond designed the type he revived  \n\\> as Garamont in 1946, twenty years after the Beatrice  \n\\> Warde article\n\nAlthough outright ignorance of the Garamond debacle is nearly extinct these days (at least among typophiles) a certain apologism, or maybe even a sleight-of-hand, surprisingly lives on to this day! See for example the description of Simoncini Garamond on Myfonts. \"Opinion varies\"? And \"true to the original\"?! Come on guys, really - give it up already.\n\n\\> he lost the sight in one eye the same day he  \n\\> succeeded in making a cutting tool that worked.\n\nMore news to me! Interesting.\n\nhhp\n\n"
    },
    {
      "time": "13 Feb 2006 — 5:23pm",
      "content": "I like the sense of the numinous in \"Garamond, or Garamont, is related to the alphabet of Claude Garamond (1480-1561) as well as to the work of Jean Jannon (1580-1635 or 1658)\". What are these mysterious relations, and from what fabulous lotus did Garamond then arise?\n\n"
    }
  ]
}
