{
  "id": "17837",
  "title": "wedding fonts // suggestions?",
  "forum": "Design",
  "tags": [

  ],
  "content": "hello!\n\ni know this has been discussed before but I'd appreciate it if anyone could throw out good typefaces for wedding invitations (i'm designing my own right now). I'm drawn to Ministry and Marmalade right now. I'm also looking for a good typeface to accompany these...\n\nthank you!!\n\n",
  "author": "<a href=\"/web/20110809061339/http://typophile.com/user/11442\" title=\"View user profile.\">schmules</a>",
  "time": "<br>",
  "uid": "11442",
  "comments": [
    {
      "time": "",
      "content": "Some may disagree, I think Bickham Script Pro from Adobe is a very versatile typeface, with a slew of alternates, glyphs and ornaments. Sloop from the Font Bureau is another fav, although so many designers use it incorrectly, not utilizing all three faces for Caps, ascenders and descenders. The worst faux pax is spacing or kerning out script faces.\n\nAs for an accent font stick with a traditional serif, Incognito from Fountain Type is good example, something with oldstyle figures.\n\nMy last comment, nothing shows off a well-designed invitation better than Letterpress…\n\nCongratulations!\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the suggestions! I'll look those up.\n\nI'm also totally open to less traditional fonts, if anyone has any other suggestions\n\n"
    },
    {
      "time": "",
      "content": "Julia\n\nBickham Script is good for occasions like this. You might find some complementary typefaces here?\n\n[http://www.macrhino.com](http://web.archive.org/web/20110809061339/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\nAnd yes congratulations!\n\n"
    },
    {
      "time": "",
      "content": "Thanks Stefan -- I'll take a look!\n\nI'm thinking about using Plumero or Sudestada for our names -- I was wondering what would be a nice font to use with those for the rest of the body text?\n\nAny suggestions would be appreciated!!\n\n"
    },
    {
      "time": "",
      "content": "Julia, I got your IM. I'd be glad to answer any questions you have. You can either post them for me here and I'll check back, or you can email me directly at pauldhunt(a)yahoo,com (you know what to change...)\n\npaul\n\n"
    }
  ]
}
