{
  "id": "17840",
  "title": "Why so few fonts w/ Baltic characters?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This has been bugging me for a very long time.  \nI can't even tell you all how much I have learned about type while reading Typophile forums. I have gained a lot of appreciation and affection towards type, letterforms and designs along the way. I am a graphic designer myself, not a typographer/typesetter in particular, but my jobs often involve a lot of typographic issues to be solved. I pay a lot of attention to details, as I believe that they define the final quality of the job. And ideally I would wish to pick and purchase a special font for each job - whether a corporate id, magazine or press advertisement - to make it more unique and avoid overuse of things like Hellvetica.\n\nAnd here comes the complicated part.  \nThe problem is, my native language is not English, it is Latvian and has many diacritical marks not present in the standard Latin fonts.  \nAs far as I know there are very few fonts that have Baltic characters. The OpenType technology has made things a little better, as in Pro versions Baltic characters are present. I purchased Storm OpenType Library and it is a pure delight to have it :). But many font design classics still don't have what I need.\n\nThe design people here get around this in two ways: either they are typographically ignorant and use the few available things over and over again (the most popular here is a selection of Bitstream fonts, but most of them are old cuts, that, having gained the knowledge from you all, look quite bad to me, and few are fit to actually typeset long texts, for instance) or they do the necessary customizations themselves. (Speaking of using the same thing many times, currently Zapfino suffers terribly from it here - it is EVERYWHERE!) I have tried to do customizations myself, but I don't have all the necessary expertise and time to fiddle around, so the quality of my creations could be better. And I always mess up kerning and stuff. Besides, I believe it is illegal.\n\nI would want to purchase many fonts, especially now, when I am currently opening my own agency. I want to do unique, beautiful works and I need unique, beautiful fonts to go with them. But hey, most of the things I like, I can't use!\n\nSo I have two questions regarding the problem:  \nHow complicated it is to include Baltic characters in a font and why it is not done on a regular basis now when font designers are not limited to a small glyph count per font file.\n\nand  \nCan you please post here as many good and well designed OpenType Pro fonts as you know of or fonts that have Baltic characters included. Probably there are things I am not even aware of. I am particularly interested in fonts from Hoefler and Font Bureau currently, but everything else is welcome as well.\n\nSorry for the long post, so many thanks for help:).\n\nedit: [http://diacritics.typo.cz/index.php?id=42](http://web.archive.org/web/20141108102514/http:/diacritics.typo.cz/index.php?id=42 \"http://diacritics.typo.cz/index.php?id=42\") lists the specific characters for Latvian\n\n",
  "author": "mncz",
  "time": "10 Feb 2006 — 2:44am",
  "uid": "1909",
  "comments": [
    {
      "time": "10 Feb 2006 — 2:47am",
      "content": "Typotheque's Fedra OTF has Baltic characters included.  \n [http://www.typotheque.com](http://web.archive.org/web/20141108102514/http:/www.typotheque.com/ \"http://www.typotheque.com\")  \nPieter\n\n"
    },
    {
      "time": "10 Feb 2006 — 3:41am",
      "content": "Linotype has developed its own OpenType format, called \"Com\" (as opposed to Std and Pro, which are formats we also license).\n\nLinotype Com fonts support 48 Latin-based languages, including the Baltic ones. Right now, I suspect that about 2000 of our 6000 fonts are available in this format. All new fonts are released in this format, as far as I am aware.\n\n[http://www.linotype.com/2088-2088-2088-16427/languagesupport.html](http://web.archive.org/web/20141108102514/http:/www.linotype.com/2088-2088-2088-16427/languagesupport.html \"http://www.linotype.com/2088-2088-2088-16427/languagesupport.html\")\n\nHere is a list of the 48 languages Com fonst support:  \nAfrikaans, Albanian, Basque, Bosnian, Breton, Catalan, Cornish, Croatian, Czech, Dutch, English, Estonian, Faroese, Finnish, French, Frisian Eastern, Frisian Western, Friulian, Gaelic Irish, Gaelic Manx, Gaelic Scots, Gagauz (Latin), Galician, German, Hungarian, Icelandic, Italian, Karelian, Ladin, Latvian, Lithuanian, Maltese, Moldavian (Latin), Norwegian, Polish, Portuguese, Rheto-Romance, Romanian, Saami Inari, Saami Lule, Saami Southern, Slovak, Slovenian, Sorbian Lower, Sorbian Upper, Spanish, Swedish, Turkish\n\n"
    },
    {
      "time": "10 Feb 2006 — 5:44am",
      "content": "Maija,  \nHave you looked at the Critique area here on typophile? There are many Opentype designs there by people who frequent this board. Several include what has become known as the \"CE\" set for Central European. (I know all of the ones I have posted there do.) It would be helpful (certainly to me at least) if you would look at those works in progress and let us know if everything that is needed for Latvian is available. Also, if you have a good Latvian text file, I will test my fonts for you using it and send you a PDF to critique for proper Latvian diacritics.\n\nChrisL\n\n"
    },
    {
      "time": "10 Feb 2006 — 6:08am",
      "content": "Dan, I looked at the link you provided. The description was great, but when I started looking through the actual offers @ font products, I couldn't tell which fonts support those many languages and which do not. Where should I look to be sure?\n\nChris, CE standard set does not include Baltic characters, as far as I am aware. I am no critic of your work, for sure :) but Typo.cz has done a very good work of collection requirements and design solutions for various diacritics. Latvian is there as well and everything felt properly described to me regarding diacritic designs and character names. They have Unicode values of the characters included too. Follow this link: [http://diacritics.typo.cz/index.php?id=42](http://web.archive.org/web/20141108102514/http:/diacritics.typo.cz/index.php?id=42 \"http://diacritics.typo.cz/index.php?id=42\")\n\nI will look at the Critique section closely :).\n\n"
    },
    {
      "time": "10 Feb 2006 — 6:29am",
      "content": "many of the [Lanston \"Pro\" titles](http://web.archive.org/web/20141108102514/http:/www.p22.com/lanston/catalog2.html) include CE characters.\n\n"
    },
    {
      "time": "10 Feb 2006 — 6:55am",
      "content": "Maija,,  \nHere is a pdf file of the UN Human Rights Charter set in Latvian using my NOW sans. There do not seem to be any Latvian characters left out from what I can tell but you cantell better than I.\n\nChrisL\n\nIt seems I can't post the file into your thread so I will add it to the bottom of the list of my NOW sans files.\n\n"
    },
    {
      "time": "10 Feb 2006 — 7:06am",
      "content": "\"How complicated it is to include Baltic characters in a font and why it is not done on a regular basis now when font designers are not limited to a small glyph count per font file.\"\n\nOpentype fonts make it much easier than before because you can have one file that includes multiple languages. The newer text faces in the \"Pro\" or \"Nova\" category tend to be more language inclusive. Foundries with a large set of historic fonts have a lot of work to go back and include multilanguage glyphs and redo older faces in Opentype. They are all starting to do this but it may take some time for their entire libraries to be opentype and language ready. New text faces are more likely done with this in mind but less so in the display fonts so far.  \nI would email all the foundries you are looking at and let them know which faces you would like to see fitted to Latvian first.\n\nChrisL\n\n"
    },
    {
      "time": "10 Feb 2006 — 7:17am",
      "content": "Most of our fonts (and all OpenType fonts) have little grey character set feature icons under their names. When you see a two-line icon that reads:\n\nLT  \nCOM\n\nthen you can know that it supports Latvian.\n\nFor example:  \n [http://www.linotype.com/1266/neuehelvetica-family.html](http://web.archive.org/web/20141108102514/http:/www.linotype.com/1266/neuehelvetica-family.html \"http://www.linotype.com/1266/neuehelvetica-family.html\")\n\nWhen you select which font to purchase, make sure to buy the font with \"Com\" as a suffix, usually at the top of a list in a sub-page (see this page, for example: [http://www.linotype.com/12763/neuehelvetica25ultralight-font.html](http://web.archive.org/web/20141108102514/http:/www.linotype.com/12763/neuehelvetica25ultralight-font.html \"http://www.linotype.com/12763/neuehelvetica25ultralight-font.html\"))\n\nThis page lists all of our Central European Fonts. These include old PostScript/TrueType CE fonts and Pro fonts that don't necessarially support Latvian. But all of the \"Com\" fonts do, and all of the Com Fonts can be found in this category. Make sense?\n\n"
    },
    {
      "time": "10 Feb 2006 — 7:23am",
      "content": "_The newer text faces in the “Pro” or “Nova” category tend to be more language inclusive._\n\nWhile the Pro format supports most Eastern European languages, I don't think that it necessarially supports the Latin-based Baltic languages as well. In fact, you cannot tell a font's language support capabilities just from its name alone, i.e., some Pro fonts support the Baltic languages, as well as Greek and Cyrillic, but they don't necessarialy, nor do their necessarially have small caps, osf, etc.\n\nLinotype's Com format supports a larger \"bear minimum\" of languages than any other OpenType format. And this bear minimum supports Baltic, CE, Eastern and Western European, Turkish, etc.\n\n"
    },
    {
      "time": "10 Feb 2006 — 7:27am",
      "content": "Paul, thank you :). Didn't know Gerald was away sailing though.\n\nThe P22 foundry's character map as seen @ [http://www.p22.com/files/P22Keychart.pdf](http://web.archive.org/web/20141108102514/http:/www.p22.com/files/P22Keychart.pdf \"http://www.p22.com/files/P22Keychart.pdf\") doesn't have the characters in question.\n\n"
    },
    {
      "time": "10 Feb 2006 — 8:16am",
      "content": "Maija,  \nAll of our fonts marked with the \"CE\" icon on the page i linked to above contain a complete \"Latin Extended A\" block of [unicode](http://web.archive.org/web/20141108102514/http:/typophile.com/wiki/unicode) glyphs, which includes support for Latvian. Also, if there is a \"CE\" icon and a smallcaps icon, you get CE smallcaps too! Here's just a sample from LTC Artscript Pro:\n\n ![](http://web.archive.org/web/20141108102514im_/http:/typophile.com/files/ltccesampl.gif)\n  \n(sorry it's all nonsense, but you get the picture...) \n"
    },
    {
      "time": "10 Feb 2006 — 9:54am",
      "content": "I can't speak for the non-independent and legacy font publishers, but I suspect my experience as the proprietor of an independent foundry producing new typefaces may be \"typical\".\n\nI've been through a number of stages in the font formats I've produced.\n\n1. Mac Type 1 and PC TrueType, not harmonized. In 1994, I put extra glyphs (eg ffi) in the \"Adobe Math Characters\" positions of my Mac fonts. Oh, the horror, Mr Hudson! At that time, my market was considered to be Mac-using DTP designers.\n\n2. Harmonized Mac Type 1 and PC TrueType. In 1999, (a) with the arrival of e-commerce, first Makambo, then Myfonts, the realization of a PC market for fonts, (b) growing PC and cross-platform usage of fonts by corporations, and (c) developing my market in editorial publishing, which uses Mac front ends and PC back ends that must work together. Call this corporatization. And add the Euro symbol.\n\n3. Following corporatization, globalization. There are several strands to this. International type design competitions have encouraged type designers to work in non-native languages, as have initiatives by ATypI (Bukva:raz and \"Language Culture Type\"). Unicode, incorporated into OpenType, have provided the tools. So consider this as an opportunity for the indie foundry -- but as yet, not one that I took. The reason was that it was extra work, and with a technical/linguistic barrier to cross (particularly in doing quality-control tests on, say, PC fonts in Polish -- and me working on a Mac in English). Besides, \"foreign\" language markets are small, and notorious for piracy, so not exactly a good business investment for a foundry with sales mainly in English-speaking countries.  \nHowever, I have noticed that my fonts sales are becoming increasingly international.\n\n4. The Raised Bar. With the release of multi-language OpenType fonts from Adobe, Microsoft (ClearType) and Linotype, for free or at low prices, independent foundries now have to raise the feature-content and perceived value of their fonts. The release of FontLab 4.5 for Mac (in 2004) has given a lot of indie foundries, which had been working on Fontographer, the ability to create OpenType fonts. Seminars at AtypI, TypeCon, and Typotechnica, as well as Leslie Cabarga's \"Learn FontLab Fast\", have helped those of us from the Anglocentric, Macocentric, Fontographerocentric posse to spread our wings.\n\n5. Time lag. I have been working on new OpenType fonts with major multi-language support for over a year, but as yet have not released any. I am also updating my back catalog to OpenType, adding multi-language support. Again, it's a lot of work, and takes time.\n\nSo, if as originally suggested, ShinnType is in any way typical of independent foundries, then you can expect to see plenty of font releases soon, from indie foundries, that support multiple languages -- including the Baltic characters. This next from me:\n\n ![](http://web.archive.org/web/20141108102514im_/http:/typophile.com/files/softlat2.jpg)\n\n"
    },
    {
      "time": "10 Feb 2006 — 11:00am",
      "content": "While I hate to use this site to toot our horn, I hope that this information will help Maija.\n\nMany of our designers are working to support as many languages as possible in their types, myself included. As a result, most of the types available from Village since our launch in July feature extended linguistic support.\n\nHere are those which support Baltic languages in OpenType fonts:  \nKLTF's [Tiptoe](http://web.archive.org/web/20141108102514/http:/vllg.com/KLTF/Tiptoe/mudTyper+Weights/)  \nKLTF's [Litteratra](http://web.archive.org/web/20141108102514/http:/vllg.com/KLTF/Litteratra/mudTyper+Weights/)  \nOrange Italic's [Local Gothic](http://web.archive.org/web/20141108102514/http:/vllg.com/OrangeItalic/LocalGothic/mudTyper+Weights/)  \nThirstype's [Apex New](http://web.archive.org/web/20141108102514/http:/vllg.com/Thirstype/ApexNew/mudTyper+Weights/)  \nThirstype's [Kaas](http://web.archive.org/web/20141108102514/http:/vllg.com/Thirstype/Kaas/mudTyper+Weights/)  \nThirstype's [Apex Serif](http://web.archive.org/web/20141108102514/http:/vllg.com/Thirstype/ApexSerif/mudTyper+Weights/)  \nType Initiative's [Arrival](http://web.archive.org/web/20141108102514/http:/vllg.com/TypeInitiative/Arrival/mudTyper+Weights/)  \nUnderware's [Bello Pro](http://web.archive.org/web/20141108102514/http:/vllg.com/Underware/Bello/mudTyper+Weights/)  \nUnderware's [Auto](http://web.archive.org/web/20141108102514/http:/vllg.com/Underware/Auto/mudTyper+Weights/)  \nVillage's [Mavis](http://web.archive.org/web/20141108102514/http:/vllg.com/Village/Mavis/mudTyper+Weights/)  \nVillage's [Galaxie Polaris](http://web.archive.org/web/20141108102514/http:/vllg.com/Village/GalaxiePolaris/mudTyper+Weights/)\n\nJust click on the weight name to see the glyphset for that weight. Also, many of the \"Example+About\" pages list the languages (and ISO codepages) supported by the font.\n\nYou will find that many of the smaller foundries are run by people with great interest in developing type for wide use. Other designers who come to mind are Jeremy Tankard, Jean François Porchez, and Peter Bil'ak.\n\n"
    },
    {
      "time": "10 Feb 2006 — 11:27am",
      "content": "_While I hate to use this site to toot our horn_\n\nI share your pain, bro.\n\n"
    },
    {
      "time": "10 Feb 2006 — 5:24pm",
      "content": "_Chris, CE standard set does not include Baltic characters, as far as I am aware._\n\nIt depends whose CE standard set you are talking about. The Mac OS Central European codepage does contain the Latvian characters, but the Windows 1250 Central European codepage does not (they are instead included in the 1257 Baltic codepage). Because of the 256-character limit of an 8-bit codepage (minus control characters), it is impossible to support all non-Western European languages in the same codepage. Apple and Microsoft made different decisions about which to include in their CE codepages: Apple included the Baltic characters, but relegated Romanian to a separate codepage, while Microsoft did it the other way round, including Romanian but creating a separate Baltic codepage.\n\n"
    },
    {
      "time": "10 Feb 2006 — 5:50pm",
      "content": "Maija,  \nare you also looking for cedilla accents instead of commabelow accents on K, L, N, R, and T (majuscule and miniscule)? I recently found out that Latvian setting prefers the cedilla to the comma accent, even though Unicode has indexed them as the same. In my most recent type family - Apex New - I programmed the cedillas as a stylistic set for Latvian setting. (My previous two releases also have both variants, but they are not assigned to a stylistic set.)\n\nI would be VERY interested to hear your feelings - and the general Latvian concensus - on the cedilla versus commabelow issue.\n\nMany thanks. c\n\n"
    },
    {
      "time": "10 Feb 2006 — 5:52pm",
      "content": "This page - [http://czyborra.com/charsets/iso8859.html](http://web.archive.org/web/20141108102514/http:/czyborra.com/charsets/iso8859.html) - is one of my go-tos on glyph table creation, besides FontLab.\n\n"
    },
    {
      "time": "10 Feb 2006 — 7:00pm",
      "content": "\"The Mac OS Central European codepage does contain the Latvian characters,\"\n\nI am using the Mac codepage. Thanks John!\n\nChrisL\n\n"
    },
    {
      "time": "10 Feb 2006 — 7:17pm",
      "content": "Chester: _are you also looking for cedilla accents instead of commabelow accents on K, L, N, R, and T (majuscule and miniscule)? I recently found out that Latvian setting prefers the cedilla to the comma accent, even though Unicode has indexed them as the same._\n\nWho told you that? That is completely opposite to everything I have ever heard on the subject. When I was involved in the CEN European character repertoires project a few years ago, the documentation, based on testimony of national experts, stated: _The characters Ģ ģ Ķ ķ Ļ ļ Ņ ņ Ŗ and ŗ must always be drawn with a COMMA BELOW, although these characters are identified in ISO standards as LETTERs WITH CEDILLA._\n\n"
    },
    {
      "time": "10 Feb 2006 — 8:08pm",
      "content": "John, I forgot where I read that in all of my browsing, but I'm pretty sure that I read somewhere that the cedilla - a non-joining cedilla, that is - was appropriate for setting Latvian and Marshallese. Have I been automisled? Dammit! If Latvian requires the comma accent, what languages require the cedilla? Thanks for setting me straight, c\n\nPS; What we need is some kind of single repository for all of this information! ;-)\n\n"
    },
    {
      "time": "11 Feb 2006 — 7:36am",
      "content": "\"What we need is some kind of single repository for all of this information!\"\n\nIsn't that what Filip Blažek is trying to do on [his diacritcs site](http://web.archive.org/web/20141108102514/http:/diacritics.typo.cz/)?\n\nChrisL\n\n"
    },
    {
      "time": "11 Feb 2006 — 1:59pm",
      "content": "I'll just note that the \"Adobe CE\" character set includes support for the Baltic languages. Adobe fonts get the \"Pro\" label by including the Adobe CE character set as well as the basic Adobe Western 2 character set.\n\nDan, it is sort of a niggling point, but could you please refrain from calling Com and Pro \"formats\"? They are not formats, but rather they are character set standards within the OpenType format.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "11 Feb 2006 — 2:09pm",
      "content": "Sorry :(\n\n"
    },
    {
      "time": "11 Feb 2006 — 4:50pm",
      "content": "Note: Turkish requires an S with cedilla.\n\nT\n\n"
    },
    {
      "time": "11 Feb 2006 — 6:36pm",
      "content": "_If Latvian requires the comma accent, what languages require the cedilla?_\n\nAs Tom notes, Turkish requires S with and actual cedilla. As far as I've been able to determine, everyone else uses 'comma accents', including Latvian and Romanian. Now, the term comma accent can be misleading, because the form isn't necessarily identical to the comma in the typeface. In contrast to the cedilla, it is never attached, and is typically straighter.\n\nIn Unicode, there is now a partial disunification, with separate codepoints for S/s and T/t with comma accents, distinct from the S/s and T/t with cedilla. These are intended for Romanian, since there was a clear need to differentiate the Romanian S/s diacritics with the comma accent form from the Turkish S/s cedilla diacritics. [However, existing 8-bit codepages for Romanian used the S/s and T/t with cedilla codepoints, not the new comma accent codepoints. So one can't be sure how Romanian text will be encoded. For this reason, it is a good idea to include a Romanian language system tag in your OT fonts, and map the S/s and T/t with cedilla glyphs to the corresponding comma accent forms in the 'locl' layout feature.] In the case of the Latvian Ģ ģ Ķ ķ Ļ ļ Ņ ņ Ŗ and ŗ, there was no need to provide a disunification in Unicode, because no language actually uses a cedilla form with these letters, despite the official character names. The names are now recognised as an error and the reference glyphs in the Unicode codecharts display the correct, comma accent forms; unfortunately, the character names cannot be changed because they are a normative aspect of the standard, covered by stability commitments.\n\nThe odd-man-out in all this is the T/t with cedilla character, which since the Romanian disunification doesn't really have a reason to exist, so far as I can tell. I searched high and low for a language that actually used a T/t with cedilla glyph form, and couldn't find one. The closest contender I found was Gagauz Turkish, which is spoken by about 150-175,000 people in Moldova (part of the former USSR in which the majority of the population is Romanian). During the period of direct Russian control, the language was written using the Cyrillic script, but like many Turkic groups, the Gagauzi quickly adapted a Latin alphabet after the collapse of the Soviet Union. Unsurprisingly, considering their situation, the orthography adapted by the Gagauzi is influenced by both the Turkish and Romanian writing systems. As a result, it includes an S/s with cedilla and a T/t with comma accent! It struck me that a good argument could be made for the Gagauzi to further assert their distinct, Turkic identity as a minority in Moldova by using the cedilla form with both the S/s and T/t. But I'm not aware of any move in this direction.\n\n"
    },
    {
      "time": "11 Feb 2006 — 7:20pm",
      "content": "Thanks John. I'm happy that I assigned the \"corrrect\" Unicode indices to the comma accented letters. (I also made the (non-connecting) cedilla-accented letters accessible through a Stylistic Set.) And, of course, I have the Scedilla with the joining cedilla accent for use in Turkish.\n\nI have seen a version of Univers with Ccommas in place of Ccedillas. \"How Modern!\" I thought.\n\nThanks again for setting the record straight. That's the problem with creating diacritics for languages you don't know: you have to ask a native speaker what the rules are, and hope that their response is \"neutral\" and \"true\". And you can't follow the designs of earlier fonts, especially the glyph thumbnails in FontLab, which use an incorrect font as reference. (While many digital fonts had Thorns, Lslashes and Eths, they were usually not \"right\", and wouldn't really help the Icelandic designer. All of which to say: It's one thing to make the additional accents for additional languages, and it's quite another thing to make them right. (I have learned this the hard way.)\n\n"
    },
    {
      "time": "12 Feb 2006 — 6:41am",
      "content": "Let me invite you again to visit [Diacritics Project](http://web.archive.org/web/20141108102514/http:/diacritics.typo.cz/). It is a platform for sharing knowledge how to create typefaces with correct accents. There is now possibility to create galleries. Please upload samples of correct or bad accents to the database and help other designers to improve their fonts.\n\nI would like to thank to the people who had already shared their know-how and published their opinions on this web.\n\n"
    },
    {
      "time": "12 Feb 2006 — 4:16pm",
      "content": "The comma-below characters are difficult to design for faces with short descenders.  \nThe comma-accent takes up too much vertical space, especially when the letter overshoots the baseline (G).  \nAt least with the cedilla, it's possible to move the accent up and overlap the letter. (Take note, Gagauz Turks, and heed Mr Hudson!)\n\nSo it's tempting to cheat a little.  \nIs it really necessary to put a clear gap between the letter and the accent? The thing is, it might look wrong if the Gcommaaccent had overlapping, but not the gcommaaccent. So why not make all the comma-accents overlap?\n\nIn Polish, the L-slashes have overlapped accents.  \nIn older Polish (mid 19th century), I've seen the ogonek set as a separate inferior accent (a breve shape), so I surmise that the ogonek became attached to the letter for reasons of expediency -- one composite glyph that saves vertical space.\n\nIn several languages, cap accents are sometimes moved down -- Polish caron and German umlaut, for instance.\n\nWhat I'm getting at is that the form of accented characters is not carved in stone. Standardizing is the agenda of academics, governments, and multi-national corporations, but local cultures (and immigrants) are less likely to be in the thrall of national or ethnic ideological correctness.\n\nI'm not suggesting that \"anything goes\". Obviously designers working with foreign languages need to do their homework. But there should be room for innovation.\n\n"
    },
    {
      "time": "13 Feb 2006 — 8:39am",
      "content": "_In older Polish (mid 19th century), I’ve seen the ogonek set as a separate inferior accent (a breve shape), so I surmise that the ogonek became attached to the letter for reasons of expediency — one composite glyph that saves vertical space._\n\nNo, the ogonek began life attached to the letter. It originated in the e caudata, a scribal mark indicating that the Latin vowel _ae_ had been written in a manuscript as _e_, using a reformed spelling popular for a while, but then annotated to indicate the correct spelling by a later scripe. Since there wasn't room in the manuscript to write in the _a_ before the _e_, its presence was indicated by attaching a small mark: _ę._\n\n"
    },
    {
      "time": "13 Feb 2006 — 8:43am",
      "content": "PS. That's why I model the shape of the ogonek on the lower left bowl of the a or _a._\n\n"
    },
    {
      "time": "13 Feb 2006 — 9:02am",
      "content": "Then I guess what I saw was a \"work around\" by a printer who didn't have the composite accented characters.\n\nAnyway, I believe you've confirmed my \"mutability of accents\" theory, John -- as what was originally a separate letter became a vestigial appendage. Or did the e caudata spring to life fully formed?\n\n"
    },
    {
      "time": "13 Feb 2006 — 4:32pm",
      "content": "I am so glad to see this discussion so far evolved (was buried in work, sorry :E).\n\nSome points:  \nI work mainly on Windows, so I wasn't aware about the differences between mac and pc ce codepages. Thanks for setting that straight.\n\nJohn is absolutely right about the whole accent thing. The right accent for Latvian letters C, G, K, L, N is commaaccent, not ccedilla. The thing about Latvian accents in general is that because of the many hand-made localisations I mentioned before there is some mess about them, most notably caron used above G instead of commaaccent - I see it all the time. And I myself have put some cedillas instead of commaaccents under letters before I learned the difference. They just looked prettier :D.\n\nI haven't researched the origin of commaaccents in Latvian, but I suppose they come from languages with commonly pronounced consonants and appeared as substitute for certain character groups. I can do some quick research and post the results here if anyone is interested.\n\nAs for Nicks comment about small and piracy notorious local markets - yes, I can only sadly agree. It has many reasons I won't go into, but I think that with the rise of living standards and growing awareness of what copyrights actually are about and probably respect for other people's work it may change. Of course, respect doesn't take you far if you are short of cash and sadly that is a problem to many graphic design upstarts here, but the bosses who hold the money haven't learned that fonts are actually intellectual property too. But that is a common problem everywhere, I guess.\n\nAs for the single repository of all accents, yes, Diacritics Project has done a very good job, that makes me smile :))\n\nThank you so much about all the comments. As I said in the beginning, I suspected there were many Baltic fonts I wasn't aware of, so tooting your horn was highly welcome and I am glad you shared your and others' work. As for the time lag - yes, I should have thought about it, but I am also glad to know that there are things in works I wouldn't have guessed about.\n\nMany thanks to you all. I feel I have learned a lot.\n\n"
    }
  ]
}
