{
  "id": "1786",
  "title": "Software poll",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Illustrator or Freehand?   \n   \nFontlab or Fontographer?   \n   \nWhich do you use and why?\n\n",
  "author": "timfm",
  "time": "23 Oct 2003 — 11:16pm",
  "uid": "1235",
  "comments": [
    {
      "time": "24 Oct 2003 — 10:57am",
      "content": "Corel Draw, it\n\n"
    },
    {
      "time": "24 Oct 2003 — 1:59pm",
      "content": "I'm an Adobe user and with the CS series coming out its more intergrated than ever. They made the same type engine for all the products except GoLive. The ability to make a page layout in InDesign and use the same elements to create web pages in GoLive is cool. Dan\n\n"
    },
    {
      "time": "24 Oct 2003 — 9:13pm",
      "content": "I have always used Adobe software (notably Illustrator since version 1.1), probably much in the same way that I have always been a Mac user. You stick with what is comfortable, fits your workstyle, makes functional sense, and continually allows you to do your work in an efficient and creative manner. I'm not going to go into why Illustrator is better or why Freehand is not - suffice it to say that the tools and interface of Illustrator simply work for me better than Freehand ever has. I have never been comfortable using Macromedia products probably because my workflow has become attuned much more closely with the Adobe interface aesthetic (and quirkiness in its own right).   \n   \nAnd yes, I use Fontographer (since version 2.x, back in 1988 as a matter of fact). This is due to no other reasons than force of habit and lack of time to properly acquaint myself with FontLab. FontLab is clearly the superior (and supported) tool - but the adjustment in order to migrate is daunting.\n\n"
    },
    {
      "time": "24 Oct 2003 — 10:12pm",
      "content": "Adobe & Fontlab. Illustrator because freehand annoys   \nme, and it can integrate with photoshop + id. Fontlab   \nbecause that is what is installed at school. Even though   \nI haven't used fontographer extensively, Fontlab is   \nexceptionally intuitive and rather easy to use.\n\n"
    },
    {
      "time": "24 Oct 2003 — 10:23pm",
      "content": "FontLab all the way.   \n   \nFor drawing programs, of course I use Illustrator, but that's because I work at Adobe. However, I think I'd go for Illustrator CS regardless, since it's typographic functionality is vastly beyond the competition.   \n   \nT\n\n"
    },
    {
      "time": "25 Oct 2003 — 8:03am",
      "content": "Thomas I use a Mac and the dog Illustrator 10, Illustrator CS can't come out fast enough for me. Doubling the speed means Adobe has been listening to its critics. I'm also in love with what they did with the pallets in InDesign CS.\n\n"
    },
    {
      "time": "28 Oct 2003 — 1:48pm",
      "content": "I'd love Adobe to make an easy vector editing for Illustrator. Thomas, why direct selection selects the \\*whole\\* shape?.... :'( Just as the black arrow does, and like the white arrow+...   \nI find it extremely tiring to get the point within 2 pxls... and in case of mistake to deselect and try again... Should the app have an easy vector selection (like ALL the other vector editing programs), it would be perfect.\n\n"
    },
    {
      "time": "28 Oct 2003 — 7:39pm",
      "content": "Tim,   \n   \nIllustrator and Fontographer for me.   \n   \nI made the choice about 5-6 years ago to stop swapping between Illustrator and Freehand as it was getting confusing. I chose Illustrator because it was the predominant program in most the studios I was freelancing at and from my experience still is.   \n   \nI fell into using Fontographer because I had access to a copy whilst working at a studio in London and haven't had the chance to explore Fontlab although it sounds like it might be a better option.   \n   \nFor page layout our studio has made the decision to drop Quark (way too expensive now) and go for InDesign so Adobe is proving to be a winner for us.\n\n"
    },
    {
      "time": "28 Oct 2003 — 8:36pm",
      "content": "Massimo, Corel does have a better bezier edition tool with the one you can perform all the node operations. Certainly it\n\n"
    },
    {
      "time": "28 Oct 2003 — 8:57pm",
      "content": "FONTLAB, wishing i had robofab.\n\n"
    },
    {
      "time": "29 Oct 2003 — 3:23pm",
      "content": "Massimo,   \nWhile the Direct Selection tool (white arrow) works as does the Seletion tool (black arrow) when the fill of an object is clicked, it selects only that segment or that anchor point on which you click when the actual Bezier curve (outside edge) is clicked. As well, if a marquee (rectangle shape) is dragged with the Direct Selection tool, only those anchor points that are enclosed by the drawn marquee are selected.   \nI hope that this is of some small help.   \nDana\n\n"
    },
    {
      "time": "30 Oct 2003 — 8:40am",
      "content": "FontLab and all Adobe. I dumped Quark last year and haven't look back.   \n   \nKris: As a fellow FontLab user, I'm amazed that you found the program \"intuitive and rather easy to use.\" It took me a long time to get a handle on this program. As much as I love this program, I'm not sure \"intuitive\" is the first word that pops into my head.\n\n"
    },
    {
      "time": "4 Nov 2003 — 7:26pm",
      "content": "\"I dumped Quark last year and haven't look back\"   \n   \nA statement I proably could not agree more with.   \nAdobe is really on top of things.\n\n"
    },
    {
      "time": "5 Nov 2003 — 5:59am",
      "content": "I just got Photoshop CS, its amazing. It has a new tonal adjustment pallet that allows the adjustment of tones in the middle tones not just the shadows and highlights, and layer comps is very cool, too! Dan\n\n"
    },
    {
      "time": "5 Nov 2003 — 6:13am",
      "content": "The new CS package _is_ amazing. I'm pretty blown away by the new InDesign. Now I just have to wait for my printers to upgrade before I can use it. I wish you could down-save files. \\<sigh\\>\n\n"
    },
    {
      "time": "5 Nov 2003 — 6:59am",
      "content": "Now that my Adobe CS finally arrived, I'm using Illustrator a lot more. The speed increase on my machine is astounding. I'm impressed with the new palettes in InDesign CS. Hopefully they'll implement them in Photoshop 9 (CS2?) And if anyone hasn't upgraded to Photoshop CS yet, it's a gem. Oh, and as far as font creation goes: I'm using FontLab.\n\n"
    },
    {
      "time": "5 Nov 2003 — 9:53am",
      "content": "So what's so good about InDesign CS? What are the new features?\n\n"
    },
    {
      "time": "5 Nov 2003 — 10:10am",
      "content": "Those floating palettes have always been so annoying, Corel cramped them in the right margin since the 8th version.\n\n"
    },
    {
      "time": "5 Nov 2003 — 10:23am",
      "content": "Keith: For me, the best feature was the addition of spot ink mixing. This was the only feature that Quark had over ID. And the ability to create mixed ink groups makes the ID implementation that much better.   \n   \nActually, the palette re-design is welcome too!\n\n"
    },
    {
      "time": "5 Nov 2003 — 11:09am",
      "content": "Spot ink mixing? That's great! I could use some dockable palettes too... I can be a very messy worker on the computer...   \n   \nThanks for the links, Stephen. I guess I've been living in a cacoon for the past little while...   \n   \nNice loooonnnngggg lines in the Adobe PDF... (Meta did it, right? ;-)\n\n"
    },
    {
      "time": "5 Nov 2003 — 5:55pm",
      "content": "n't get used. I love the way   \nthat there is one select tool for grabbing points and   \ncurves. I find it now infinately frustrating to have to   \nswitch between the \"a\" and \"v\" (hotkeys) selection tools   \nin illustrator to manipulate beziers. And just selecting a   \npoint and snapping it to another instantly joins it,   \ninstead of selecting and apple-j ing then selectin. I find it now infinately frustrating to have to   \nswitch between the \"a\" and \"v\" (hotkeys) selection tools   \nin illustrator to manipulate beziers. And just selecting a   \npoint and snapping it to another instantly joins it,   \ninstead of selecting and apple-j ing then selectinsn't get used. I love the way   \nthat there is one select tool for grabbing points and   \ncurves. I find it now infinately frustrating to have to   \nswitch between the \"a\" and \"v\" (hotkeys) selection tools   \nin illustrator to manipulate beziers. And just selecting\n\n"
    },
    {
      "time": "5 Nov 2003 — 6:04pm",
      "content": "I think I understand.\n\n"
    },
    {
      "time": "5 Nov 2003 — 9:13pm",
      "content": "Back when I used to work for the [\"McDonalds® of graphic design\"](http://web.archive.org/web/20131019082707/http:/www.kinkos.com/) I used Freehand. Illustrator was available to us, but boy was it confusing to me with it's many different selection tools. I bought FH for home use as Macromedia had one of their early sweet suite deals that included Fontographer (and some other products that eventually dissapeared ~ Xres anyone?). Also, back then in my PC-centric days there had been no recent upgrade to Illustrator in many a moon.   \n   \nSince then I've figured out Illustrator and eventually switched. it's nice to check out FH once in a while though ~ it has some nice things like multiple pages. But I do recall it had it's own confusing palette problems back in the day that could be sort of \"unpalettable\" to the newbie.   \n   \nRemember when three upgrades of FH came out in the course of about a year as it switched \"owners\" from Aldus to Altsys to Macromedia?   \n   \nI'd love to switch to FontLab but $$$ seems to be an issue these days as I attempt to pay bills during my adventures in unemploymentland. I'm also looking forward to speedier Adobe products but I think I need a roof over my head more than I need new software.   \n   \nHmmm... maybe I could be the graphic designer who lives under the bridge. I can hear it now, \"He does great work with the latest software as long as you bring some gas to help power the generator.\"\n\n"
    },
    {
      "time": "5 Nov 2003 — 9:45am",
      "content": "Illustrator is faster, but there was no speed increase for InDesign. ![:-(](http://web.archive.org/web/20131019082707im_/http:/www.typophile.com/forums/clipart/sad.gif) Boohoo. Haven't used Photoshop enough to say, and I already owned Acrobat Pro (now I have two!), oh and GoLive seems a bit more perky.\n\n"
    },
    {
      "time": "5 Nov 2003 — 10:00am",
      "content": "Plenty, Keith...   \n   \n [http://www.adobe.com/products/indesign/newfeatures.html](http://web.archive.org/web/20131019082707/http:/www.adobe.com/products/indesign/newfeatures.html)   \n [http://typographi.ca/000705.php](http://web.archive.org/web/20131019082707/http:/typographi.ca/000705.php)\n\n"
    },
    {
      "time": "5 Nov 2003 — 10:00am",
      "content": "(Hi Keith.)   \n   \nFor one, the pallettes all tuck nicely into the side of your monitor. For two, they've adopted something which Quark uses (that I'll admit to missing), that floating palette (which can dock). For three, a cropped preview working mode. For four ... I'll go back to work and come up with some that are typography related.\n\n"
    }
  ]
}
