{
  "id": "17860",
  "title": "Typography Reference Guide",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Greetings,\n\nThis would be my first post here on Typophile. I’ve been searching the internet for a site that analyzes some of the more highly regarded typefaces in history (Baskerville, Bodoni, Gill Sans, Goudy {insert face here}, Cooper, etc.) and deconstructs them in a fashion that describes what is conveyed buy each face’s individual characteristics.\n\nI know that here you have the Typowiki reference, but this just gives a history of each typeface. I’m looking for a more critical analysis. Am I asking too much? Should I look at these faces with a broader eye? Should I look more towards the period from whence these faces emerged?\n\nAny links or book suggestions would be well appreciated.\n\nI love this website, and I find it refreshing that I wasn’t the only one scratching out early font ideas on my notepad instead of listening to my government lecture in high school!\n\n.lazyeye.\n\n [‹ What is infinity?](http://web.archive.org/web/20081013184819/http:/typophile.com/node/17891 \"Go to previous forum topic\") [Typography the Hard Way ›](http://web.archive.org/web/20081013184819/http:/typophile.com/node/17918 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081013184819/http://typophile.com/user/11443\" title=\"View user profile.\">lazyeye88</a>",
  "time": "<br>",
  "uid": "11443",
  "comments": [
    {
      "time": " 11.Feb.2006 3.20pm",
      "content": "[http://typophile.com/node/16536](http://web.archive.org/web/20081013184819/http:/typophile.com/node/16536 \"http://typophile.com/node/16536\")\n\n"
    },
    {
      "time": " 11.Feb.2006 10.26pm",
      "content": "Thank you for the leads. I went ahead and ordered a copy of the Precision Type Font Reference Guide. It sounds like just what I was looking for (according to the reviews on Amazon.com).\n\nIf you or anyone else can think of other reference points, do tell!\n\n.lazyeye.\n\n"
    },
    {
      "time": " 12.Feb.2006 8.12am",
      "content": "I’ve done my diploma thesis on this topic, analysing two fonts in detail: RialtoDF and Syntax. Each font got a small presentation book (~50-60 pages), analysing formal aspects, influences like zeitgeist, technique, font designer and purpose of use. I chose these two fonts because they are quite different (sans serif / serif) but have lots of things in common (humanist ductus, ...).  \nThe theoretical part describes these things in a more common way.\n\nIf you want pdfs of it, you can contact me at mitdemmofanachengland(at)gmx(dot)at\n\nsebilar\n\nedit: please consider that the documents are in german...\n\n"
    },
    {
      "time": " 12.Feb.2006 10.37am",
      "content": "Hrm.. how quickly could I pick up German, do you suppose? :) I think I can translate it at babelfish.com or something. :)\n\n.lazyeye.\n\n"
    },
    {
      "time": " 12.Feb.2006 5.13pm",
      "content": "\\> I went ahead and ordered a copy of the Precision Type Font Reference Guide  \nThis is just reference guide. No history.\n\n\\> I’m looking for a more critical analysis  \nWhat is “critical analysis”\n\nRead that:\n\nAnatomy of a Typeface by Alexander Lawson\n\nABC’s of Type: A Guide to Contemporary Typefaces  \nby Allan Haley\n\nAlphabet: The History, Evolution, and Design of the Letters We Use Today  \nby Allan Haley\n\nFonts & Logos by Doyald Young\n\n"
    },
    {
      "time": " 13.Feb.2006 11.19pm",
      "content": "\\> I went ahead and ordered a copy of the Precision Type Font Reference Guide\n\nIf you ordered this from Amazon, did it cost you $94? That’s what Amazon and other used bookstore sites (e.g., abebooks.com) seem to charge.\n\nI lucked out and ran across this book recently at the Strand Bookstore in NYC ( [www.strandbooks.com](http://web.archive.org/web/20081013184819/http:/www.strandbooks.com/ \"www.strandbooks.com\")) for $20. I thought I bought the only copy, but it looks available online....\n\ns’marks\n\n"
    },
    {
      "time": " 14.Feb.2006 2.33pm",
      "content": "Heh, that’s where I found mine too. I saw two, so I ordered them both. I plan on selling the more used version on eBay. If anyone is interested, and can’t find this book at strandbooks, I will post a link to the auction.\n\n.lazyeye.\n\n"
    },
    {
      "time": " 15.Feb.2006 12.36am",
      "content": "OK, great, glad you didn’t pay $80-$100 for it. It’s not a bad reference book at $20, but I don’t think it’s worth $80. And, as others have noted, there’s no analysis or criticism, just type samples.\n\nNow the FontBook might be worth $80. Didja see the guy on Amazon selling it for $1200?!\n\ns’marks\n\n"
    },
    {
      "time": " 15.Feb.2006 10.09am",
      "content": "Haha, I missed that one! I might have to scoop up that edition. Gold inlay, anyone?\n\n.lazyeye.\n\n"
    },
    {
      "time": " 15.Feb.2006 4.14pm",
      "content": "Looks like babelfish is more expensive than I was hoping for:\n\n_Language Pair: German into English  \nWord Count: 7,968  \nRate per word: $0.28 USD  \nTotal Cost: $0.28 \\* 7,968 = **$2,231.04 USD** _\n\nThanks again for the attempt!\n\n.lazyeye.\n\n"
    }
  ]
}
