{
  "id": "17878",
  "title": "Ever been fired?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I bet I've been fired more than you. In an effort to encourage those losing jobs or having a hard time finding them, I've shared some of the experiences I've had in the graphic arts over the last 25 years. Please share your experience if you think it will help our less fortunate peers in this soft economy. The title is \"Separations\" and as an added bonus, I've posted my Columbus College of Art and Design photo ID so there I am--at age 17 and at age 2 with my dad.\n\n[http://blogs.graphicdesignforum.com](http://web.archive.org/web/20131017141148/http:/blogs.graphicdesignforum.com/ \"http://blogs.graphicdesignforum.com\")\n\nThanks.  \nSDK\n\nTry it now--Ha! No s. Sorry.\n\n| Attachment | Size |\n| --- | --- |\n| [SDKsm.jpg](http://web.archive.org/web/20131017141148/http:/typophile.com/files/SDKsm.jpg) | 107.65 KB |\n\n",
  "author": "skirklan",
  "time": "12 Feb 2006 — 7:05pm",
  "uid": "7978",
  "comments": [
    {
      "time": "13 Feb 2006 — 6:21am",
      "content": "Your link isn't working for me.  \nI have been fired once (redundancy cheque:) and was back freelancing there at better rates one week later so I don't think my observations would help. All I can offer is sympathy and encouragement for anyone in that position.  \nTim\n\n"
    },
    {
      "time": "13 Feb 2006 — 6:47am",
      "content": "I've been fired once (but not from a design job), laid off once, and forgotten about once (that was sort of funny…). All three feel bad, but you will eventually get over it. Best of luck!\n\n"
    },
    {
      "time": "13 Feb 2006 — 10:12am",
      "content": "Ha. No s. Sorry.  \nIt should work now.  \n [http://blogs.graphicdesignforum.com](http://web.archive.org/web/20131017141148/http:/blogs.graphicdesignforum.com/ \"http://blogs.graphicdesignforum.com\")\n\nSusan Kirkland  \nAuthor of Start & Run a Creative Services Business  \nView my work and excerpts from the book (click the book icon) at  \nBlogging with friends: [http://blogs.graphicdesignforum.com](http://web.archive.org/web/20131017141148/http:/blogs.graphicdesignforum.com/ \"http://blogs.graphicdesignforum.com\")\n\n"
    },
    {
      "time": "13 Feb 2006 — 10:42am",
      "content": "I've been fired, and then told to get back to work. :^/\n\n"
    },
    {
      "time": "13 Feb 2006 — 10:51am",
      "content": "Ive been fired _only_ once but Ive 'gone' myself a few times :)\n\n_( Shameless Self Promotion: Actually, If any of you fellow Typophiles is interested in hiring me, let me know :) I am looking for a paid internship / 'temporary work relationship', preferable somewhere in Europe, and I would even be willing to relocate :)_\n\nDav\n\n"
    },
    {
      "time": "13 Feb 2006 — 4:51pm",
      "content": "Susan  \nI've been fired often enough for one lifetime for a variety of reasons. As these were graphic design positions I guess I might deduce that a. I'm a crummy designer. b. I don't know how to listen to and follow instructions. c. a combination of a and b. d. I'd rather not work for people and prefer working for myself.  \nd. is actually my preference, not a reason to be fired. Before you decide which of these might apply to you, take a good look at yourself and how well you work with others, follow instructions and listen to everyone. Oh, and ps, at my age finding a job is very difficult, no matter what, so working for myself is really the only option I have, aside from bagging groceries at the local big chain.  \nJordan\n\n"
    },
    {
      "time": "14 Feb 2006 — 9:56am",
      "content": "HA! Well, hello fellow alumni. 2004 graduate here. Was Aschenbrand still teaching there back then?\n\n"
    },
    {
      "time": "14 Feb 2006 — 9:06pm",
      "content": "I've never been fired. Have worked at 1 in-house design group, 2 ad agencies, and 2 small design firms, in various capacities. When I finally found a good creative home, the creative director was fired. He didn't see it coming. I realized then that working for myself is the best option, and have been doing it for about 5 years now. I would consider joining a firm again, but probably have priced myself out.\n\n"
    },
    {
      "time": "15 Feb 2006 — 5:00am",
      "content": "I was fired in the fall of 2004. I had been working at a small design firm for three and a half years. The place had struggled the entire time I worked there... partly due to the struggling economy after 9-11, but mainly due to poor management by the owners. A large project an art director and I worked together on finally pulled the company out of debt from bad business decisions two years prior. Things started to look up. There was a small bonus for everyone and the company spent over 20K on new equipment. Then two months later they layed off the art director I worked with on the project mentioned above. That was the final wake up call to me that I had to leave. So I looked for new work and within 6 weeks of the art director's layoff I found a new job at an ad agency.\n\nUnfortunately, as a result of seeing how poorly the owners managed the company I developed an inflated sense of self as I thought anyone could perform better then that could. I was blinded to my own inexperience and my stunted growth from working under managers who were poor mentors in my career development. Additionally, in my job search I thought I had developed \"bad business radar\" that would save me from selecting a job from another company doing poorly in business.\n\nThe job posting I replied to at the new ad agency was for a designer with a focus in web design and at least two years experience. I promoted my three and a half years experience, web experience, and added print experience as a bonus. I ended up being offered the job. Right after I signed the papers to make the job offer official, and had given notice to the design firm I was working at, I was informed that the design firm had just fired their two top designers and only kept their newest designer who had little to no formal education in design and lacked basic design skills like layout and typography. They refused to disclose why they fired the two people before me, but insisted it was good cause.\n\nMy first two months at the job they complained every single day about the two previous designers. From what I could see of the work done by the previous designers, they had been at least as talented (if not more talented) then me... but the quality of their work was often part of the complaints. Gradually the anger and complains became directed at me and my work in the same fashion as had been directed at the two designers they fired.\n\nThe monday of my last week there I knew that I was on my way out as I was being isolated by interations within the office and gradually projects were being \"postponed\". I had one big project I was finishing and upon completing it that friday, after staying late Thursday to work on it, they \"let me go.\"\n\nBeing fired was a hurtful and humbling experience. In the end it was the best as the work environment was hostile. In many ways I am still hurt from the experience... however I am thankful for it as I am a better person as a result. I don't feel the situation was fair. The ad agency was not forthcoming in what they needed on the job posting and in the interview. Had they been I would have been the first to confess that I was not ready to be a creative director. However, I did have an inflated self image and needed to be kicked down so that I could be humbled and pick myself up with a new focus, resolve, and attitude.\n\nMy unemployment was tough, but thankfully short. Through it I learned empathy for those who face hard times (prior I often felt judgement and disdain). I learned that I had much to learn both in design, management, and in how to be a better person. I learned that I had to be careful about judging others, as I was judged by my former employers and it didn't feel good or kind.\n\nEven when being fired for no good reason, there is almost always something you did, didn't do, or an attitude you kept within yourself that you can reflect on and improve upon. By learning from the situation you can grow for the next opportunity that finds you. I am a better designer, better employee, and a better person because of my 2004 firing and what I learned from it.\n\n"
    },
    {
      "time": "15 Feb 2006 — 5:34am",
      "content": "Michael, that sounds like a nightmare situation. It is also a good example of how ad agencies are usually run by \"non-creatives\". The account and sales people are often lauded and given the spotlight, while the people who actually create the work the agency sells are secluded and treated poorly. This was my experience at one of the agencies I worked for as well as one of the design firms. It's unfortunate, but a lot of times there is a great division between these two sides. This is probably a whole 'nother topic...\n\n"
    },
    {
      "time": "15 Feb 2006 — 9:10am",
      "content": "Like Dan, I was once forgotten (long story) on a job that seemed to be heading for a wall, but I have yet to be fired. However, much of my work is A) salaried in-house, or B) one-off freelance, so I think the probabilities are working in my favor. That, and I have a cup of gummy peaches on my desk that are free to all.\n\n"
    }
  ]
}
