{
  "id": "17891",
  "title": "What is infinity?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "The typographical question may prove to be as thorny as the philosophical...\n\nIts inventor John Wallis, well-versed in the Classics, is assumed to have derived the design from lower-case omega (the last letter of the Greek alphabet, metaphorically the end), possibly with a bit of Ouroboros (the serpent biting its tail) thrown in. So that makes it somewhat of a character, and the corresponding type design treatment would have it match the lower case.\n\nBut it has also been described as \"indefinitely more\" -- making it akin to a mathematical operator. So the corresponding treatment would be a thin monoline, even in a contrasting stress face.\n\nOr is it a transcendental value? -- like pi, in which case it would be more appropriately treated as a Greek script character.\n\nAnd how big/wide should it be?\n\nMathmaticians, typographers, which font has your favourite infinity symbol?\n\n",
  "author": "<a href=\"/web/20120229160001/http://typophile.com/user/2021\" title=\"View user profile.\">Nick Shinn</a>",
  "time": "<br>",
  "uid": "2021",
  "comments": [
    {
      "time": "",
      "content": "Nick:\n\nBeing neither mathematician nor typographer, I'm going to charge in anyway:\n\nOn the one hand, the concept \"infinity\" should probably be written out in text; using a symbol for it makes about as much typographical sense as using the alchemical symbols for Venus and Mars to indicate men and women in text. So, why craft it as a lower-case character? Typographers can't presume to make good style choices for authors, but maybe they can help discourage poor ones.\n\nThe symbol seems to me best thought of as a transcendental value--like the constants _c_ for the speed of light, or _g_ for the force of gravity--and not a mathematical operator. But that's where things get tricky, no? Because _c_ and _g_ usually show up--I think--as italic characters in the base font of the text. So you're back to where you--that is, I--started.\n\n"
    },
    {
      "time": "",
      "content": "I see the character more as a Möbius band; hence, a thick-and-thin treatment to suggest the multidimensional character of the object seems more appropriate.\n\n"
    },
    {
      "time": "",
      "content": "I prefer an infinity symbol which modulates its thickness a bit so as to harmonize with the text face In reviewing the infinity symbols in the standard LaTeX math fonts, I prefer the symbol from the Euler typeface. And I like the Mobius interpretation, as well.\n\nScott Thatcher\n\n"
    },
    {
      "time": "",
      "content": "Interesting question, and it's good too see you're putting thought into mathematical symbols.\n\nMathematically speaking, infinity is neither an operator nor a transcendental number (they are a subset of those real numbers that aren't rational). It's not a number at all, but it's usually used analogously to a literal number, and as such it should preferrably harmonize with the figures in your font. It's interesting to compare it to the zero, which often occurs in the same contexts as an infinity sign, also used to be hard to grasp for people, historically, and incidentially shows the same uncertainty between a stressed and monoline glyph in old typefaces.\n\nPractically speaking, mathematical typesetting prefers the stressed version, as far as I can tell. As infinity takes a sign, it should be centred with respect to the horizontal bar of the plus and minus signs; it should have equal sized loops and look neither like a bow tie nor (worse!) like two circles with fused curves. If you keep Ourboros in mind you can't go wrong.\n\nFavourites are difficult, there's not much choice in mathematical fonts. The following example from a custom math font to go with Times illustrates proper design and alignment:\n\n ![](http://web.archive.org/web/20120229160001im_/http:/typophile.com/files/infty.png)\n\nAre you designing a complete font for mathematics, or are you just trying to fill a required encoding point? In the latter case it's likely never going to be used anyway, I'm afraid. You might as well save some effort and fake an infinity sign by rotating your eight, as they did in the bad old days... You still see lots of infinity signs with larger right loops, doublessly originating from this practice.\n\nBy the way, there's no hard rule that operators (and relations) shouldn't be drawn stressed. That works better for such symbols as are derived from simple geometrical shapes, but for example \"proportional to\" and \"approximately equal to\" signs are regularly drawn with stress and arguably look less clumsy this way. Mathematicians also have no qualms about using text symbols (asterisks, ampersands) as operators in specialized context.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Thanks Scott.\n\nCould you provide some typical mathematical equations or formulae that contain the infinity symbol, so that type designers can test their infinity prototypes in a \"real world\" scenario?\n\n"
    },
    {
      "time": "",
      "content": "Nick, [here](http://web.archive.org/web/20120229160001/http:/mathworld.wolfram.com/Infinity.html) is a nice explanation, including an interesting note on the history of the symbol. In set theory, there are orders of infinity, as noted [here](http://web.archive.org/web/20120229160001/http:/mathworld.wolfram.com/TransfiniteNumber.html). Warning: Cantor, who discovered infinite arithmetic also ended up in a mental institution!\n\n"
    },
    {
      "time": "",
      "content": "Thanks Tim.\n\nI put the full set of characters for standard Latin encoding in all my fonts.  \nThings like printer's fists and arrows would be more useful to typographers than infinity, but the people who compiled the standard encodings made a dreadful hash of things, so instead we have lozenge, mu and product -- and no minus or multiply in the basic Mac font.\n\nI'm not designing a math font, this is more of a general enquiry.\n\nHowever, I am working on a typeface that would be good for maths, so I am getting my head into that space, and may later produce an accompanying math font, so it makes sense to tackle some of these problems now, rather than have an eventual discrepancy between the same character in regular and math versions of the face.\n\nYour point about infinity harmonizing with figures: that's possible with old-style figures, but I feel that the landscape format of the infinity symbol doesn't harmonize at all with the portrait orientation of lining figures: how can that be resolved?\n\n"
    },
    {
      "time": "",
      "content": "As Mathworld points out, infinity is an \"unbounded quantity\", so it's not too useful to think of it as a operator.\n\nI think it's more likely to be seen with variables or with an arrow, so I think it should harmonize with the lower case. As we see in the Mathworld entry, it's often seen printed small, under \"lim\" with a variable, denoting a limit as n approaches infinity.\n\nBTW, all [transcendentals](http://web.archive.org/web/20120229160001/http:/mathworld.wolfram.com/TranscendentalNumber.html) are [irrationals](http://web.archive.org/web/20120229160001/http:/mathworld.wolfram.com/IrrationalNumber.html), but not all irrationals are trancendentals.\n\n"
    },
    {
      "time": "",
      "content": "It's great that you think about a math companion font, that's something that's sorely missing from many typefaces. And of course designing a proper symbol for the text font is still the right way to go, as long as you're aware of its limited usefulness.\n\nYou should definitely look at old style numbers for reference. The infinity sign will appear in similar places as a number, but it will never be directly next to a digit, so it doesn't have to harmonize with lining figures in that sense. The main point is that it's not analogous to a lowercase letter, and modelling it after, say, the shape of your omega would probably not work out too well.\n\nHave a look at [this PDF](http://web.archive.org/web/20120229160001/http:/timstadelmann.de/infty.pdf) if you're in doubt about typical uses.\n\n"
    },
    {
      "time": "",
      "content": "To clarify, numbers that are not rational are irrational, not transcendental. Transcendental numbers are numbers that are not solutions to any polynomial equation having integer coefficients. I am sure this helps settle the original question. :^)\n\nBeing a mathematician, not a typographer, I tend to think of “infinity” as a number. It is sometimes appended to the real numbers to form what is known as the extended real numbers. Furthermore, Cantor's transfinite numbers and J.H. Conway's surreal numbers include infinite quantities, though they do not use the “lazy eight” to represent them.\n\n"
    },
    {
      "time": "",
      "content": "Tim,\n\nThese look like good typical uses of the infinity symbol to me, but I'm interested in your use of oldstyle figures in a mathematical setting. I've never seen that done in any text I've run across. Is that a difference between U.S. and British or German mathematical typesetting? To my eye, the zero looks too much like a lower-case \"o\", but I suppose it's easy enough to get used to if you know what you're looking for.\n\nScott Thatcher\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the pdf Tim, it's a keeper.  \nNow I'll sit back and follow the discussion over oldstyle vs. lining figures!\n\n"
    },
    {
      "time": "",
      "content": "Using old style figures for maths typesetting was the rule in old (roughly, pre-war) books and papers, but it's become increasingly unusual since. I wasn't aware of a cultural difference in this regard (although there are substantial differences between the anglo-american style of maths typesetting and the continental European one; just as the metric system, the latter forms the basis for the international standard but is mostly ignored in the US). However, a quick and totally unsystematic look through old papers that are available online shows that the American Physical Society switched to lining numbers as early as 1924, while British Journals still used old style numbers in the fifties.\n\nPersonally, I prefer to use old style numbers unless publication style requires something else. I'm currently setting my DPhil thesis in this style, and none of the proofreaders (Physicists) seemed to notice the numbers at all. They are easier to tell apart even when used at small sizes, and since most mathematical formulae use mixed case, they seem more natural. Moreover, operators are usually aligned to lowercase letters.\n\nUsing lining numbers also has the added disadvantage that you have to worry about what to do with the remaining numbers in your document, and there's not really a good answer to that; typically lining numbers are used throughout.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "On the lowercase o: I don't think it's much of an issue, variables called \"o\", apart from being rare, should be set in italics, and upright \"o\"s, for example in the \"little-o\" notation, are clearly distinguished by context.\n\n"
    },
    {
      "time": "",
      "content": "while it might be complete overkill, there is an excellent discussion of the history of infinity in Rudy Rucker's _infinity and the mind_; in this book he delineates the differences between cardinal and ordinal infinities and points out that the hebrew character 'aleph' is also commonly used to refer to cardinal infinities. in non-mathematical terms the mobius thing or 'lazy 8' seems to be the symbol of choice.\n\nrucker's book also includes mathematical excercises for the incurably nerdy.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \noh yes.\n\n"
    },
    {
      "time": "",
      "content": "Tim,\n\nThanks for the reply. I'll give it a try sometime soon when I'm typesetting something new.\n\nScott Thatcher\n\n"
    },
    {
      "time": "",
      "content": "The infinity symbol is such a distinctive shape, I think it can withstand a variety of typography treatments. Obviously if one is producing a typeface specifically for mathematical typesetting, one should be aware of the conventions used in that kind of publishing. But the symbol is also used in a variety of non-technical ways; there is, for instance, a condominium development in Vancouver called Infinity that has the symbol machine engraved in granite at the front of the building. So in display types there is a good excuse to have some fun with this character and focus on its evocative and aesthetic, even decorative, potential rather than on its functional characteristics.\n\nI like to give the infinity symbol a reverse ductus, rather than following the typical contrast pattern of letters and numerals:\n\n ![](http://web.archive.org/web/20120229160001im_/http:/typophile.com/files/infinityJH.gif)\n\n"
    },
    {
      "time": "",
      "content": "John, why the reverse stress, is it simply a matter of personal taste or something else? Doesn't reverse stress imply you've taken an eight, given it rotational symmetry (or not\\*) and rotated it through 90 degrees? Wouldn't you want to distance yourself from that approach?\n\n\\*Maybe that is why some infinties are right or even left heavy.\n\n"
    },
    {
      "time": "",
      "content": "I think it is simply a matter of personal taste. Since the symbol is thought to have Greek origins, I like to give it a characteristically Greek ductus.\n\nThe treatment of the middle section crossover makes it obvious that this isn't an 8 knocked on its side.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Mathmaticians, typographers, which font has your favourite infinity symbol?</cite>\n\nAfter looking through a few fonts, I realized that many, if not most appear to be placeholders. Really the infinity symbol should reflect the style and character of the face. But carefully crafted stroke variance, such as seen in John's example, is rare.\n\nHowever, it may also be that there is a consideration for the possibility that the symbol could be used at both large and small sizes. For example, the infinity might be used in superscripts as well as with a sigma when describing a sum. These are some of the smallest symbols that would be generally used in typesetting, especially if they were in footnotes or endnotes. So, type designers might have to hedge on designs that work for the smallest sizes.\n\nBelow is the infinity symbol from Optima. I would suspect that the newer the font is, the more likely it is that the symbol is the work of the original designer. This version increases in size from left to right slightly. The one I found in Gill Sans does this even more-- although, even with these distinct shapes, I feel unsure if they are the work of the original designer, or if they too were added in later to achive completeness.\n\n ![](http://web.archive.org/web/20120229160001im_/http:/typophile.com/files/optima.jpg)\n\n"
    },
    {
      "time": "",
      "content": "<cite>Are you designing a complete font for mathematics, or are you just trying to fill a required encoding point? In the latter case it’s likely never going to be used anyway, I’m afraid.</cite>\n\nThe first place I looked was Zapfino, hoping to see three or four calligraphic variations. I was dissapointed, but it was nice to see that it was there, and consistant with the script.\n\n"
    }
  ]
}
