{
  "id": "17898",
  "title": "First Line Left Indentation / Any rules?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nI am getting started on a medium size document in InDesign CS2.  \nThis is my first big job in formating a lengthy document and I wanted  \nto get everything right, as far as paragraph standards go.  \nIs there any rule to the way you set the first line left indentation or  \nanything else for that matter, which is a must to consider when doing  \na reasonably a document like this? (28 pages including cover).\n\nI am really fussy when it comes to typography, but I find that I don't  \nknow enough about paragraphs etc. Any help would be so greatly  \nappreciated also links to manuals etc would also be appreciated.\n\nKind regards,  \nJosh\n\n",
  "author": "Headjam",
  "time": "13 Feb 2006 — 4:03pm",
  "uid": "9804",
  "comments": [
    {
      "time": "13 Feb 2006 — 4:08pm",
      "content": "[Bringhurst](http://web.archive.org/web/20150205050719/http:/www.amazon.com/gp/product/0881792063/sr=8-1/qid=1139875614/ref=pd_bbs_1/103-9383282-4876649?%5Fencoding=UTF8)\n\n"
    },
    {
      "time": "13 Feb 2006 — 4:28pm",
      "content": "Thanks William. I will definately check this book out.  \nDo you have any on hand tips that I could use at the moment, I am working on this  \ndocument at the moment.\n\n"
    },
    {
      "time": "13 Feb 2006 — 5:49pm",
      "content": "Without referencing any source at this moment, typographers often depending on the project (novel, non-fiction, reference material, scientific journal, etc.) will establish there own \"style guide\".\n\nPersonally, on extended text I start the first line of the very first paragraph of a chapter opening flush left, followed by indents for subsequent paragraphs.\n\nHere is where some typographers differ: Whenerver a new section starts within the chapter that uses a bold or large point size sub-head, I follow the same style and make the very first line flush left, followed by indents for subsequent paragraphs.\n\nI've noted others using only a flush left line for the opening paragraph and indents throughout even after sub-heads.\n\nThe choice is yours. A good bet is to quickly pick up any quality printed books within your reach to see what others have done.\n\n"
    },
    {
      "time": "13 Feb 2006 — 6:39pm",
      "content": "I just reviewed what Walter Tracy did in his [_Letters of Credit_](http://web.archive.org/web/20150205050719/http:/www.amazon.com/gp/product/1567922406/qid=1139883948/sr=2-1/ref=pd_bbs_b_2_1/103-0764369-2392622?s=books&v=glance&n=283155), US first edition, 1985 --\n\nHis book is divided into two main sections, PART I and PART II.  \n_PARTs I & II_ are divided into key topics headed by regular sequential numbering and larger point size bold heads and a 1 pt. solid rule underneath ( **4. Legibility and readability** ).\n\nThe first paragraph below the topic head is NOT indented, and subsequent paragraphs ARE indented (approx. 1 em+).\n\nBUT even under a main topic, if there is a sub-section or change in subject EVEN without a subhead, he does NOT indent but instead does a double line space. Wow... talk about style.\n\n"
    },
    {
      "time": "13 Feb 2006 — 7:38pm",
      "content": "Many thanks Norbert for your help and references! The Walter Tracey reference sounds like the way to go! Thanks.\n\n"
    },
    {
      "time": "13 Feb 2006 — 8:45pm",
      "content": "The Bringhurstian indent is one em or one lead. So, if your text is 9/12 point, that would be either a 9 or 12 point indent. And don't indent the first paragraph of a chapter or section; that's classy!\n\n"
    },
    {
      "time": "14 Feb 2006 — 9:34am",
      "content": "I second (or third) what's above - don't indent the first paragraph (or the first after a head) but do indent all subsequent paragraphs. Also, don't indent a paragraph following a line or section break even if there is no head.\n\nAs to how much to indent, I think it depends on your line length. Sometimes a paragraph indent of 2 or 3 picas can look nice, but not on a short line width.\n\n"
    },
    {
      "time": "16 Feb 2006 — 5:28am",
      "content": "Beyond echoing the above comments on Bringhurst and Tracey, I would add that one of my bibles in this department must be a 1954 book by Geoffrey Dowding, reprinted 1966, entitled \"Finer points in the spacing and arrangement of type\". Apart from being one of the most beautifully printed English language volumes in my type-library, I think this book is worth its weight in gold. Another interesting volume is Ari Rafaeli's \"Book typography\" (British Library and Oak Knoll Press, 2005). There is also Derek Birdsall's \"Notes on book design\" which also has some very interesting things to say about grids.\n\n"
    },
    {
      "time": "16 Feb 2006 — 10:08am",
      "content": "I've literally just finished a 300 book where the subheads are in a heavy sans, and the para's begin next line WITH ident, and the same style continues for following ones. I dont think it looks at all bad assuming you dont have a really short line on the final subhead line. Also, I got my chops busted once for doing what seems to be the general consensus here, as it's 'inconsistent' -- not that I agree with that.\n\n"
    },
    {
      "time": "16 Feb 2006 — 11:44am",
      "content": "\\> _Also, I got my chops busted once for doing what seems to be the general consensus here, as it’s ‘inconsistent’ — not that I agree with that._\n\nHere is where a little bit of knowledge is a bad thing, and the conflict between conventional essay writing/business communications style rules conflict with higher-end publishing techniques.\n\nYou can't appreciate what you don't know, so many new editors or corporate communication \"boses\" constantly fall back on sytle rules that got them though college.\n\nFine printing and quality typography is best appreciated by the best of publishers.\n\nI am now working on a 250+ page book with 100+ historic photos and have set up a page spread with left and right page grids mirroring each other. Photo captions all are placed at outer margins as annotated text.\n\nAt first, the author liked it, but now, three chapters into the book he'd like to see all pages symmetrical, placed centered on the page with equal inner and outer margins... very vanilla! He's the writer AND publisher who is paying for the project. I'm putting together comparitive layout samples to convince him otherwise... we'll see what happens.\n\n"
    },
    {
      "time": "16 Feb 2006 — 12:11pm",
      "content": "\"… we’ll see what happens.\"\n\nI have so been that route. Hell hath no fury like an anal retentive editor who never forgot his first typewriter class in high school. Their answer is always, \"but that is the rule!\" You are well served to Xerox out the pages in Bringhurst and Traecy to show him \"the other set of rules\" :-)\n\nGod speed Norbert! I am routing for you.\n\nChrisL\n\n"
    },
    {
      "time": "16 Feb 2006 — 1:31pm",
      "content": "Yeah, nothing like a publisher who tells you that justified text is easier to read that non-justified. (I am beginning to hate justified…) Upon being told that I have never come across ayn evidence to support this during my extenisive reading, they counter with, \"well everyone elsee does it\". Christ. I will slowly bend them to my will.\n\n—K\n\n"
    },
    {
      "time": "6 Dec 2007 — 4:52am",
      "content": "I always thought that the first paragraph should have no indent, rather that is how I think it works and looks best. I see however that NewsPapers including the NewYorkTimes include an indent in the first paragraph. Do anyone know if this is a NewsPaper specific thing?\n\n"
    },
    {
      "time": "6 Dec 2007 — 6:09am",
      "content": "It is probably a knowledge thing, or a speed thing. The reason we indent is to give the eye an indicator where the next paragraph starts when reading. The first paragraph doesn't need one because the change of type styles from the head or subhead to the text provides that clue.\n\nNewspapers do not do this because they are built in a rush, and it simpler to have just one style for all body copy, quickly applied, or more likely, a default. English teachers don't allow the unindented first line through the lack of knowledge reason ... and generally won't bend even when you show them the correct method in various textbooks.\n\n"
    },
    {
      "time": "6 Dec 2007 — 8:04am",
      "content": "Newspaperreporters were (are?) supposed to write in paragraphs in such a way that omitting/deleting some para's in the long copy wouldn't impair the meaning of the piece, so that the editor responsible for the make up could do that if spacerestrictions required it. Hence the uniform composition. (Talking about lead and photoset type of course).\n\n. . .  \nBert Vanderveen BNO\n\n"
    }
  ]
}
