{
  "id": "17901",
  "title": "(x) Ambidji logo - (similar to) Goudy Old Style {David H}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Heya IDers,\n\nThis mob cant find their original artwork and their designer has gone out of business (i wonder why..!). I suggested total rebranding, but they’re happy with the general vibe they already have.\n\nSo instead, i’m going to reimplement their logo. Of course, the first thing i’ll be doing is loosing that gawd awful white glow.\n\nAnyway, first look at this and i swore it was Adobe’s open type caslon.\n\nBut on closer inspection, the cap of the uppercase ‘A’ isnt consistent, and the slab serifs are slightly wider on adobe caslon.\n\nFor all intents and purposes, i could probably get away with it, but now its just bugging me!\n\nAny help much appreciated.\n\nCheers - JonnySchneider\n\n| Attachment | Size |\n| --- | --- |\n| [home\\_graphic\\_mmi.jpg](http://web.archive.org/web/20060519021514/http:/typophile.com/files/home_graphic_mmi.jpg) | 69.14 KB |\n| [compare.gif](http://web.archive.org/web/20060519021514/http:/typophile.com/files/compare.gif) | 35.54 KB |\n\n",
  "author": "<a href=\"user/11331\" title=\"View user profile.\">JonnySchneider</a>",
  "time": "<br>",
  "uid": "11331",
  "comments": [
    {
      "time": " 13 February, 2006 - 8:49pm",
      "content": "Goudy (?)\n\n"
    },
    {
      "time": " 13 February, 2006 - 10:42pm",
      "content": "Cheers david,\n\nI reckon thats it.\n\nSerifs and stroke width still arent \\*exactly\\* the same (see ‘compare.gif’), but i think that is more to do with the image compression on the web graphic rather than the typeface.\n\nWho agrees?\n\n"
    },
    {
      "time": " 14 February, 2006 - 1:48am",
      "content": "This definitely looks like a Goudy face, at first sight I’d say Goudy Old Style. Dunno which version/digitisation tho.\n\n"
    },
    {
      "time": " 14 February, 2006 - 4:03pm",
      "content": "I guess it is also a posibility that the original designer picked one of those font that you recognise that is thinner and simply applied a thicker “stroke” outline to it.?\n\n"
    },
    {
      "time": " 14 February, 2006 - 4:46pm",
      "content": "Planet\\_ebroidery: yeah, thats exactly what i thought too, but when i tried that it didnt produce results. Even with fractional stroke width it looked all bloated and obese!\n\nBaldCondensed: uh huh, Goudy Old Style (adobe version) is what i’ve used for the comparison.\n\nIt’s close enough, i’ll just use that.\n\nCheers for you help guys.\n\n"
    }
  ]
}
