{
  "id": "17916",
  "title": "New from Hyphen Press: \"Typography papers · 6\"",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20070808124304/http:/typophile.com/user/108 \"View user profile.\") : 14.Feb.2006 9.09am \n\n\\*\\*\\*\n\nEdited and made at the Department of Typography & Graphic Communication, University of Reading\n\n\\*\\*\\*\n\nTypography papers 6: a landmark publication\n\n ![](http://web.archive.org/web/20070808124304im_/http:/typophile.com/files/TP6.jpg)\n\nThe sixth number of Typography papers is now published. This copiously illustrated book reconstructs the classical letter in the Italian renaissance and publishes some notable firsts.\n\nThese include the first full showing (and at same size) of the Newberry alphabet, a constructed manuscript alphabet of 29 capital letters made in Italy in the late fifteenth century and now in the Newberry Library, Chicago.\n\nAlso published for the first time is a posthumous essay by Nicolete Gray (d. 1997) introducing the Newberry alphabet and putting it in the context of a series of ‘antique’ alphabets constructed between 1464 and 1525.\n\nIn 1959 Giovanni Mardersteig, scholar-printer and founder of the Officina Bodoni in Verona, published a pioneering essay on Leon Batista Alberti’s role in reviving the ancient Roman capitals. This much-cited work at last appears in English here in Typography papers, with its original illustrations, in James Mosley’s translation.\n\nJames Mosley’s incisive summary of the work of Giovan Francesco Cresci resumes work begun in the early 1960s with the publication of his seminal essay ‘Trajan revived’. Here Cresci’s constitutional foundation of the baroque letter in Rome is illustrated, and – another first – is complemented by pictorial comparisons of the great inscriptional alphabets published in Rome in the late sixteenth and early seventeenth centuries.\n\nPaul Stiff’s survey of fifteenth-century Florentine inscriptional design starts with the epitaph to ‘the great and ingenious’ Brunelleschi, first architect of the renaissance, in the city’s cathedral. His survey is illustrated by 90 unpublished pictures from Reading’s Lettering Collection, built up over the last 40 years.\n\n160 pages, many b/w pictures, paperback (sewn sections)  \nISBN: 0–907259–29–4\n\n\\*\\*\\*\n\n\\* UK, via Central Books, London  \n [www.centralbooks.co.uk](http://web.archive.org/web/20070808124304/http:/www.centralbooks.co.uk/ \"www.centralbooks.co.uk\")\n\n\\* North America, via Princeton Architectural Press, New York  \n [www.papress.com](http://web.archive.org/web/20070808124304/http:/www.papress.com/ \"www.papress.com\")\n\n\\* Continental Europe, via Coen Sligting, Amsterdam  \nsligting[at]xs4all[dot]nl  \nor via Central Books, London\n\n\\* Australia, via Books at Manic  \nmanicex[at]manic[dot]com[dot]au\n\n\\*\\*\\*\n\nHyphen Press  \n115 Bartholomew Road  \nLondon NW5 2BJ\n\n[www.hyphenpress.co.uk/titles/typo\\_papers6/index.html](http://web.archive.org/web/20070808124304/http:/www.hyphenpress.co.uk/titles/typo_papers6/index.html \"www.hyphenpress.co.uk/titles/typo\\_papers6/index.html\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20070808124304/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 14.Feb.2006 9.09am",
  "uid": "108",
  "comments": [

  ]
}
