{
  "id": "17910",
  "title": "AAA, BBB, B-, C...Ratings, How to Handle Small Caps",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I frequently work with financial documents that use bond ratings, which are: AAA, AA, A, BBB, BB, CCC, CC, C, D, Aa, A, Baa, Ba, B, Caa, Ca, C. They are frequently used in running and lengthy text, along with headers and tables. Sometimes a few of them have minus signs. So, my natural inclination is to use small caps, but I’m worried about the single letters seeming odd or out of place. On the flip side, it seems confusing/inconsistent to SC on only some.\n\nDoes anyone know of a hard and fast rule for this? I referred to Bringhurst and it seems to boil down to my judgement or convention as long as I’m consistent. I’m on the fence about sacrificing the overall texture for consistency by using with the full capped versions. The trickiest part in making that judgement is that ratings aren’t acronyms, they are what they are, so I’m inclined to use the full capped versions. Thoughts? Opinons? Just go with whatever?\n\nThe font I’m using is Whitman, but this is a general typographic question.\n\n",
  "author": "<a href=\"user/2172\" title=\"View user profile.\">Chris Rugen</a>",
  "time": "<br>",
  "uid": "2172",
  "comments": [
    {
      "time": " 14 February, 2006 - 8:14am",
      "content": "‘Aa’ all caps ? And ‘AA’ ?\n\nA.\n\n"
    },
    {
      "time": " 14 February, 2006 - 9:01am",
      "content": "What is the audience accustomed to? I think you have to err on the side of clear communication. I have never used the bond rating set so I don’t know. What would seem strange to me would be to see a small cap “A” next to a lowere case “a”.\n\nChrisL\n\n"
    },
    {
      "time": " 14 February, 2006 - 9:37am",
      "content": "Yeah, I think that problem is going to be the determiner: full caps, and full caps and lowercase, which is the standard.\n\n"
    },
    {
      "time": " 14 February, 2006 - 11:23am",
      "content": "I would think to use the same treatment as for abbrvs such as PhD, MD, MBA, DDS, Sr., Jr. and so forth. I don’t see a problem with setting some as small caps and some as mixed-case full upper/lower—in fact I would think it would be preferable to using full caps for the AAA etc. Somebody set me straight if I’m being dumb!\n\n"
    }
  ]
}
