{
  "id": "17919",
  "title": "Round 2",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hey,\n\nMy brain hurts. So could someone look at this and give me any first impressions.\n\nThanks\n\ntxt2.17.06.pdf  \nUpdated spacing. Worked on making letters on little more conformed to a.\n\nFeb 23rd.  \nSpacing comments if you don't mind\n\n| Attachment | Size |\n| --- | --- |\n| [2column2.pdf](http://web.archive.org/web/20130819002333/http:/typophile.com/files/2column2.pdf) | 29.5 KB |\n| [GALL-1.pdf](http://web.archive.org/web/20130819002333/http:/typophile.com/files/GALL-1.pdf) | 977.73 KB |\n\n",
  "author": "Eric_West",
  "time": "14 Feb 2006 — 10:27am",
  "uid": "6194",
  "comments": [
    {
      "time": "14 Feb 2006 — 1:26pm",
      "content": "\"Counterpunches\" of 'm' are not equal, the 'c' has got a loop on the bottom (edge), 's' is not flowing my eye stops about eight times, got six stops on the 'g' as well.\n\n"
    },
    {
      "time": "14 Feb 2006 — 1:41pm",
      "content": "Thanks Alessandro. The g was getting redone anyway. It looks pretty bad.\n\n"
    },
    {
      "time": "14 Feb 2006 — 5:31pm",
      "content": "The 'li' combo is far too loose, if that's the kind of comments you're looking for.\n\n"
    },
    {
      "time": "14 Feb 2006 — 5:36pm",
      "content": "Spacing comments welcome too, thanks david. this is my first time around ( getting this far at least)\n\nWould you recommend solving that via metrics or kerning pair?.\n\n"
    },
    {
      "time": "14 Feb 2006 — 6:01pm",
      "content": "Haha, I knew you'd end up asking how to solve it...the only problem is that I've never actually worked with FontLab or any other typeface creation software. I was just pointing out what I saw. I'm sure others will be able to help you out with that!\n\n"
    },
    {
      "time": "15 Feb 2006 — 12:06pm",
      "content": "Eric;\n\nHave you added kerns to any character pairs yet? I'm guessijng you haven't. It looks like your spacing problems are due to side bearings being incorrect. Get the side bearings right first---for basic letter fit.\n\nKerning comes last to fix any spacing problems that can't be solved with side bearing settings. For example, the \"l-i\" combo is bad because the left side bearing on \"i\" is too wide. I can tell by looking at other combos with \"i\".\n\nThe fractured arm treatment on your \"a\" is interesting (I like it) but disturbing in context of all those other smooth glyphs. It would fit in in a gothicized roman. Smooth it into a curve, or fracture all the other glyphs with curved bowls to match. The fractured upper stroke of the \"a\" bowl can stay---it matches m, n, h, b. Consider fracturing the arm of \"r\" to match those.\n\nMy brain hurts too sometimes ;)\n\nbest regards,  \nj a m e s\n\n"
    },
    {
      "time": "15 Feb 2006 — 12:13pm",
      "content": "o -- too round, add some faceting  \nd -- too round, add some faceting\n\nhmm. i could go on, I just noticed, with the rest of the alphabet. I love the lowercase a. Is there a reason you didn't apply more of that flavor to the other characters?\n\n"
    },
    {
      "time": "15 Feb 2006 — 12:43pm",
      "content": "James and Tiff,\n\nThanks for the responses.\n\nJames, only auto metrics at this point.\n\nTiff, what do you mean too round? and What faceting do you speak? I've got less than 2 months to be done with this,I'll try fracturing some of the other rounded letters.\n\nI like the a as well, it was one of the more difficult letters for me, I may just round it out a bit.\n\nAnd what about the rest. Don't tease me. If I didn't apply it, it was simply a lack of know-how,experience,talent etc, because in terms of what I wanted to do, Architecturally inspired, I wanted a nice readable text face, but with a little sharper, more angular touch. I'm open to suggestions as to how to apply it.\n\nThanks amillion!\n\nEric\n\n"
    },
    {
      "time": "15 Feb 2006 — 1:08pm",
      "content": "[faceting](http://web.archive.org/web/20130819002333/http:/houseind.com/index.php?page=showfont&id=171&subpage=paperback_features)\n\nand\n\n[more faceting](http://web.archive.org/web/20130819002333/http:/emigre.com/EF.php?fid=130)\n\nby [John Downer](http://web.archive.org/web/20130819002333/http:/typophile.com/wiki/John%20Downer)\n\n"
    },
    {
      "time": "15 Feb 2006 — 1:20pm",
      "content": "Thanks Paul, but faceting on an o. I was keeping my bracketing (faceting ) fairly simple. You can do whatever you want to this png, post it back inline, just a little markup, I don't understand. HELP.\n\n ![](http://web.archive.org/web/20130819002333im_/http:/typophile.com/files/ewest.png)\n\n ![](http://web.archive.org/web/20130819002333im_/http:/typophile.com/files/ewestd.png)\n\n"
    },
    {
      "time": "15 Feb 2006 — 2:11pm",
      "content": "[FF Maiola](http://web.archive.org/web/20130819002333/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=FF.11497.3.13&attributes.sampleSize=48&sampleText=Handgloves&sampleSize=288) is more subtle than John's work, but I love his just as much.\n\n"
    },
    {
      "time": "16 Feb 2006 — 5:28pm",
      "content": "_HELP_\n\nDon't panic. This is an ambitious design that will take some tinkering  \nto perfect. I'm busy for the time being. May have some time to take a  \ncrack at it Sunday -- Monday.\n\nHang in there :)\n\nj a m e s\n\n"
    },
    {
      "time": "16 Feb 2006 — 5:32pm",
      "content": "thanks james... look forward to your assistance...\n\nEric\n\n"
    },
    {
      "time": "18 Feb 2006 — 7:32am",
      "content": "bump ^\n\n"
    },
    {
      "time": "18 Feb 2006 — 1:25pm",
      "content": "The o needs a chirographic angle, at least, to fit in. The c is kind of heavy on the bottom. The serif on the descender of the p and q seems rather long to me.\n\n"
    },
    {
      "time": "19 Feb 2006 — 1:19am",
      "content": " ![](http://web.archive.org/web/20130819002333im_/http:/typophile.com/files/verticeITAL.jpg)\n\n"
    },
    {
      "time": "19 Feb 2006 — 9:42am",
      "content": "_...faceting..._ _...fracturing..._\n\nThese are different things. Fracturing involves breaking a stroke, usually inside and outside. Faceting is more akin to chiselling a concave or straight bevel onto a convex profile---like the underside of your \"a\". I've drawn sample facets onto r, a, d, b, u, q. Watch for different examples of the same letter. Have also shifted areas of weight around (most noticable on \"r\") to go with the cursive flow as indicated by arrows.\n\nShortening the \"q\" bowl is optional.\n\nFaceting the \"o\" is too tuff to simulate with pixels :)\n\nNot all changes are marked-up (Eric, please keep inline pics to 620 pixels or less. Check the FAQ. Sorry admins):\n\n ![](http://web.archive.org/web/20130819002333im_/http:/typophile.com/files/ewest.gif)\n\nFaceting on the outside of bowls:\n\n\\* creates more contrast between inside and outside shape---shape contrast  \n\\* adds potent design and styling opportunities  \n\\* adds micro-detailing\n\nThis treatment looks rough or \"ugly\" up close---not unlike many other highly-regarded text fonts. The gouge in the second \"r\" is the kind of small detail that goes unnoticed at normal reading speed, but helps readablility by adding randomness to the picture (or so we think). I would make 3 or more different r's with differing details (vary not just the facet but also the terminal geometry and weight) and program them as random OT alternates.\n\nBMW's industrial designers used faceting on the rear of the new 1 series car. This is a strong styling motif in the rediscovery of sculpting in metal the company is applying to other models in their range, and which rival manufacturers will be mimicking right about now. The \"flame sculpting\" on the side of this car was also originated by BMW. Flame sculpting places a convex curve inside a concave curve---a bulge within a facet---for extra fun, or \"Vorsprung en technic\" as they say in Germany.\n\nLove!\n\n ![](http://web.archive.org/web/20130819002333im_/http:/typophile.com/files/BMW1.jpg)\n\nj a m e s\n\n"
    },
    {
      "time": "19 Feb 2006 — 10:01am",
      "content": "To fix your side bearings, open up a good commercial seriffed text font and study the side bearing settings. They generally conform to a consistent plan. Rounds all take similar values, relative to straights, which all fall into a consistent range. Diagonals are always very close or negative. Try to ignore distances from side bearings to serif tips---concentrate on the distance from the stroke. Distances from serif tips are more relevant with diagonal letters and bars like t, f, L, T, F, E etc.\n\nWhen you've figured this scheme out, copy it---the scheme, not actual values. Follow the scheme and adapt to suit your font.\n\nCertain letter combinations will always be problematic. Ignore. Set for good spacing overall.\n\nj a m e s\n\n"
    },
    {
      "time": "19 Feb 2006 — 10:07am",
      "content": "James,\n\nYou will get a special mention in my gallery exhibiton. Thankyou! Above and beyond! I'll post pics. Thanks again.\n\nOh, sorry bout the pic size.  \n620... Got it.\n\n"
    },
    {
      "time": "19 Feb 2006 — 10:36am",
      "content": "Eric, you're very welcome.\n\nWith a text font like this don't be afraid to take risks.\n\nYou can take the word of the internal consistency brigade (\"all huff and puff\" according to Hrant) and be totally consistent for the sake of stylistic unity---at exteme close-up.\n\nOr ignore some of that and accept that text fonts are, by neccessity, crude by design in parts for the sake of performance---at text sizes, especially in print.\n\nThe \"o\" could be faceted alright, or left unfaceted, then tested under realistic conditions. If no problems crop up, fine.\n\nIntegrate as needed.\n\nj a m e s\n\n"
    },
    {
      "time": "23 Feb 2006 — 7:39pm",
      "content": "Bump!\n\n"
    },
    {
      "time": "23 Feb 2006 — 9:30pm",
      "content": "Eric, you're doing very well. Be patient: Rome wasn't built in a day, and neither are Roman types.\n\nOne thing that sticks out to me is the top right curve of the counter in d and q: It's a bit off somehow. Play with the node and BCP placement; try pulling the node up with the option key depressed to move the node but leave the BCPs where they are. This will crisp-ify that corner a bit.\n\nThe initial work on the Italic is very good. Don't work yourself into a frenzy on this. I would hate for you to end up like your avatar.\n\n"
    },
    {
      "time": "23 Feb 2006 — 10:50pm",
      "content": "Thanks chester,\n\nI appreciate any and all input. q on left is old, right, new. Just the uncomfortable curve you were talking about right? Is that better ? On the italic. Thanks.  \nI've got about a month to get this in suitable condition to show at my Senior Exhibition. So I'm in a frenzy as we speak.\n\n ![](http://web.archive.org/web/20130819002333im_/http:/typophile.com/files/qnotfix.jpg)\n\n"
    },
    {
      "time": "24 Feb 2006 — 12:49am",
      "content": "Eric, I think you need to seriously re-evaluate the whole deadline/timetable thing.\n\nType design takes years to master. While several MA programs have now been able to create a rigid, one year program, this cannot simply be ported over to an undergraduate degree program, especially when one is working alone—which I suspect you are. Several European students do manage to do great first typefaces as degree projects, but most of these students are really getting combined undergrad/graduate degrees, and have both more time to work on the project, and more experience as well.\n\nTypefaces can perhaps be said to never be finished ;-)  \nWhatever the case, I'm sure that you'll keep working on this after graduatation, especially if you want to bring it into distribution, which I hope you do.\n\nBut perhaps your presentation and exhibition should deal with the _process_ behind designing your typeface, rather than the actual glyphs themselves. That would be easier to realize in a short timeframe, and would also be more of interest to the other students and attendees, I suspect. Lastly, even if you finish a knockout typeface in a month, will your professors be able to properly evaluate it? What I'm suggesting is not to set yourself up for heartbreak either way… rather, focus on explaining your great work.\n\n"
    },
    {
      "time": "24 Feb 2006 — 2:20am",
      "content": "That q is hawt! Can we get an updated PDF?\n\n"
    },
    {
      "time": "24 Feb 2006 — 6:11am",
      "content": "Dan:\n\nA process show is def. where it's at. I attached another pdf with an idea . Any suggestions welcome. I'm using ALL my process, including the stuff I ended up not using when I restarted, because it seems like an important part of the journey.  \nAnd, I have 1 prof. that will at least appreciate what I'm trying to do. From what I've gathered this is the most ambitious anything anyone there has tried.\n\nTiff:\n\nThanks! Updated PDF w/ d and q fix.\n\n"
    },
    {
      "time": "24 Feb 2006 — 7:14am",
      "content": "Eric, um... The new q seems a little out-of-sorts to me. I meant the top-right of the counter: the hole in the letter. I thought the rising spike on the outside was great.\n\nThe last thing I want to do is throw you off your path.  \nc\n\n"
    },
    {
      "time": "24 Feb 2006 — 8:08am",
      "content": "Chester, so you meant just to close up the curve?  \nTo close this up?\n\n ![](http://web.archive.org/web/20130819002333im_/http:/typophile.com/files/Eq.jpg)\n\nI apologize, I misunderstood you the first time.\n\n"
    }
  ]
}
