{
  "id": "17915",
  "title": "Reminder! Handmade Type: the Justin Howes lecture 2006",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "- - - - - - - - - - -\n\nJustin Howes lecture 2006  \n21 February in the Bridewell Hall, St Bride Institute\n\n- - - - - - - - - - -\n\nHandmade type: thoughts on the future of typographical materials\n\nA world in which printing would no longer be done from relief metal type  \nwas already foreseen half a century ago or more, and when the effective  \nend came during the 1970s it was rapid and almost complete, leaving  \ntraditional processes that had once been universal in the hands of craft  \nprinters and type-makers.\n\nBut the materials for making type, like the punches and matrices which  \nhardly changed for centuries, are durable. Huge quantities survive. Not  \nonly can they still be made to serve the purposes for which they were  \noriginally created but, taken together, they form an archive that can  \nstill yield new information about the types that were used to set and  \nprint the books of the past, and some of which form the model for  \ndigital types that are used today.\n\nThe task of preservation is a formidable and an expensive one, and those  \nwho are willing or able to undertake it are rare. The urgent question  \nthat now needs to be addressed is, how will the long-term preservation  \nof this archive be achieved, and who will set the agenda for future  \nresearch?\n\n- - - - - - - - - - -\n\nJustin Howes died in February 2005. This lecture, the first of a series,  \nis given in his memory. He was not only a distinguished scholar, whose  \nwide-ranging researches were making an important contribution to our  \nunderstanding of the types and lettering of the past, but he learned to  \ncast type by hand and to demonstrate to others the techniques of a  \nsecretive and mysterious trade.\n\nJames Mosley, Visiting Professor in the Department of Typography in the  \nUniversity of Reading and former Librarian of the St Bride Library,  \nwrites and lectures on the history of type.\n\n- - - - - - - - - - -\n\nThe lecture is on 21 February 2006 and starts at 7pm.  \nIt will take place in the Bridewell Hall, St Bride Institute.  \nEntry is free.\n\n- - - - - - - - - - -\n\nFor more details, or to contact the Library, please see [www.stbride.org](http://web.archive.org/web/20120727003516/http:/www.stbride.org/ \"www.stbride.org\")\n\n",
  "author": "Miss Tiffany",
  "time": "14 Feb 2006 — 9:05am",
  "uid": "108",
  "comments": [

  ]
}
