{
  "id": "17937",
  "title": "sugestion for book headers",
  "forum": "Design",
  "tags": [

  ],
  "content": "i am in the process of designing a preparedness/survival manual intended to be a post-9/11, post-katrina guide for urbanites and suburbanites. the publisher would like this book to appeal to hipsters and families alike.\n\neach chapter contains numerous topic headings, which i have set in solex bold, 16pt.\n\ni really like the way this font looks in all caps, but when it is used for the sub-heads, it doesn’t quite work.  \nall caps is too overbearing and title case seems to be lacking something. perhaps there are ease-of-legibility problems with each.\n\nadditionally, i am using solex in the body copy as my bold font (which happens numerous times) and for picture captions.\n\ni would like a similarly condensed looking font that i can use for headers and will also work nicely for the sub-headers set in a smaller point size.\n\ni have attached 3 spreads for reference. let me know if it would be helpful to see additional pages or pages containing illustrations.\n\nalso, i am going to reduce the size of the bracket dingbats 10 pts or so.\n\nthanks very much for any insight you can provide.\n\ngregg\n\n| Attachment | Size |\n| --- | --- |\n| [preparedness\\_now\\_2425.pdf](http://web.archive.org/web/20081007102616/http:/typophile.com/files/preparedness_now_2425.pdf) | 29.5 KB |\n| [preparedness\\_now\\_24.pdf](http://web.archive.org/web/20081007102616/http:/typophile.com/files/preparedness_now_24.pdf) | 31.09 KB |\n| [preparedness\\_now\\_42.pdf](http://web.archive.org/web/20081007102616/http:/typophile.com/files/preparedness_now_42.pdf) | 28.94 KB |\n\n [‹ PAUL RAND \\> IBM \\<](http://web.archive.org/web/20081007102616/http:/typophile.com/node/17955 \"Go to previous forum topic\") [ITC Avant Garde Gothic Alternates and Avant Garde ›](http://web.archive.org/web/20081007102616/http:/typophile.com/node/15807 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007102616/http://typophile.com/user/5823\" title=\"View user profile.\">hereandthere</a>",
  "time": "<br>",
  "uid": "5823",
  "comments": [
    {
      "time": " 15.Feb.2006 5.25am",
      "content": "I would suggest looking at a new font for your body copy, and using the bold weight of that font (instead of solex) within the body copy and for your subheads. I don’t know if you’re stuck with Helvetica, but it doesn’t do much for the page in my opinion.\n\n"
    },
    {
      "time": " 15.Feb.2006 1.04pm",
      "content": "You might like Stalemate for this project?\n\n[http://www.macrhino.com](http://web.archive.org/web/20081007102616/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\n"
    },
    {
      "time": " 15.Feb.2006 4.32pm",
      "content": "yeah, i know what you mean.\n\ni chose helvetica because i was looking at various kinds of manuals and guidebooks for reference and wanted something very no-nonsense that perhaps made reference to those “under-designed” books.\n\ndo you think something like meta is a better choice? i’m just not sure.\n\n"
    },
    {
      "time": " 15.Feb.2006 5.39pm",
      "content": "Legato would be better than Helvetica if you wanted a neutral sans for text.\n\n"
    }
  ]
}
