{
  "id": "17931",
  "title": "Converting to Lead",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am not sure where to put this so i chose here. A classmate of mine was talking tonight about someplace that would convert your typeface in fontlab to a lead typeface. Has anyone ever heard of this and if so where?\n\n",
  "author": "<a href=\"/web/20101123093424/http://typophile.com/user/9904\" title=\"View user profile.\">orso2932</a>",
  "time": "<br>",
  "uid": "9904",
  "comments": [
    {
      "time": "",
      "content": "This has come up before, can't find it with search. I think the advice was to pay Mr [Jim Rimmer](http://web.archive.org/web/20101123093424/http:/typophile.com/wiki/Jim%20Rimmer) to cut a set of punches for you. Seems a bit excessive when photopolymer plates can be used for letterpress q. inexpensively - maybe that's what your friend was thinking of?\n\n"
    },
    {
      "time": "",
      "content": "You might try contacting the folks at [**SPEEDSPOOLS**](http://web.archive.org/web/20101123093424/http:/www.the-old-school.demon.co.uk/speedspools.htm):\n\nHarry McIntosh  \nSPEEDSPOOLS  \n385 Queensferry Road  \nEdinburgh EH4 7AG  \nScotland\n\n[machot@supanet.com](mailto:machot@supanet.com)  \ntel +44(0)131 336 2849\n\nThough they mainly convert Mac, InDesign and Quark files into Monotype sorts and cast hot metal, they may know more about creating/casting fonts from scratch. Mind you, I can't imagine that punching and casting a metal sort from a new source is anything but EXPENSIVE!  \n&nbsp;\n\n"
    },
    {
      "time": "",
      "content": "Found the thread - [http://typophile.com/node/13887](http://web.archive.org/web/20101123093424/http:/typophile.com/node/13887 \"http://typophile.com/node/13887\")\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "I think a custom cut typeface is not all that expensive as compared to other things that are made for the individual. A custom built guitar isn't cheap. It's all a matter of priority. If a person is passionate about anything a higher price is not a hinderance.\n\nQuite honestly I have never been asked to design and/or cut a metal font, possibly because it's assumed that the price is outrageous. Most things I produce in the metal foundry bring me about five dollars an hour. That stinks even in Canada, but I do it becuse it feels good, and I've been barred from the saloon and the pool hall.\n\nJim\n\n"
    },
    {
      "time": "",
      "content": "\"I’ve been barred from the saloon and the pool hall.\"\n\nJim,  \nI understand they serve beer at hockey games :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Chris\n\nYes, a beer goes well with a dooby and fights off the cold.\n\nJim\n\n"
    }
  ]
}
