{
  "id": "1795",
  "title": "Identity For Fishing Tackle Store.. What do you think?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi, I am a student (art center) redesigning a local fishing tackle store for a graphc design class. I just did a quick logotype exploration and wanted to know what you all thought. Critique/Feedback is very much appreciated.   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19177.jpg)\n\n",
  "author": "vwcruisn",
  "time": "24 Oct 2003 — 3:45pm",
  "uid": "1938",
  "comments": [
    {
      "time": "24 Oct 2003 — 4:22pm",
      "content": "Jason, I think the approach is wrong. Forget the computer and get a pad of paper and a pencil with an eraser and work on it. Your example is stale and computer driven. Create and then figure out how to produce it. Sorry If I sound harsh, I'm not, but you can make mistakes on paper but the computer is too final an instrument to be loose and creative on. This is just my opinion. Dan\n\n"
    },
    {
      "time": "24 Oct 2003 — 4:30pm",
      "content": "While I don't think that a computer is not a creative tool, I feel that your logo -- and btw, this isn't really a logo at all -- looks like a wedding card. It has nothing to do with what the shop actually does, but also isn't ideographic enouugh to be abstract. It's just fancy, trying to be artful but ending kitschy.   \nTrash it and start anew. Think about an intelligent way of communcating the IDEA of fishing (please, no fishes or hooks or anything)... make it funny or serious or beautyful or ugly or whatever fits your need... but make it mean something.   \n   \nThis is just ... empty, soulless. Devoid of an idea. Sometimes what you do can even be ugly as hell, but at least it has a soul. This however is just visual FX, bells and whistles (and even at that, it's not much fun to look at), without a core, without a message, without a heart.   \n   \nShy away from a GRAPHICAL solution and find some communicational SOLUTION first. The rest will follow all by itself.\n\n"
    },
    {
      "time": "24 Oct 2003 — 4:42pm",
      "content": "thanks for the comments... i guess i should have clarified what my objective was here... the shop opened up in the 30's and i am attempting to reference a visual language of that era relating to fishing. I have gone through tons of books and fishing magazines from the 30s and basically wanted to give this place a more modern feel, while referencing the past. This is where I am pulling for the type treatment:   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19181.jpg)   \n   \n   \nThis is the \"logo\" i have been working on which would be on one side of the business card, while the logo type and info would go on the other. Again, I am attempting to reference the \"golden days\" of fishing by using the line art illustrations of that era as well as colors used in packaging.   \n   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19182.jpg)   \n   \n   \nDo you still think I should totally scrap everything and start over? My teacher actually really liked the direction it is headed in, but if the general consensus on here is that this is totally wrong, I have no problem trying something different. Any suggestions on how I should approach it differently? Thanks a lot.\n\n"
    },
    {
      "time": "24 Oct 2003 — 4:58pm",
      "content": "The fish on the old logo adds the...urp...flavor, so it works---kind of. Eliminating the fish reduces it to, as someone wrote, a wedding invitation feel, or a showcard feel (like in the silent movies), especially considering the ornaments you used.   \n   \nThis might be one of those instances where you start from scratch. Keep in mind that fonts often have a \"feel\" to them--I think, at least. Can't think of any fishy fonts that aren't kitschy, so you might want to go with artwork and a neutral font, or at least a font that is brave enough to go with the artwork. I think you can find something that still evokes the feel of \"old-fashioned\" without being too formal.   \n   \nPlus, this was for an old catalog, not a fish shop sign. I think the two are entirely separate entities. What I would choose for one, I probably wouldn't choose for the other, unless a font was \\*just right\\* for both.\n\n"
    },
    {
      "time": "24 Oct 2003 — 5:13pm",
      "content": "yea, to be honest i wasnt all to thrilled about the scroll work buy my teacher wanted it in.... just for the record.. this is the quick draft without the scroll   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19189.jpg)   \n   \n   \nPS.. the original name was Lincoln Pico Sporting Goods (Lincoln Pico refering to the street names), and I felt this was an awful name... especially for a place that only sells fishing tackle... what do you think of the name i created? I was thinking maybe it should be Hook Line and Sinkers instead. Any thoughts?\n\n"
    },
    {
      "time": "24 Oct 2003 — 5:28pm",
      "content": "I like it a lot more, and it has a New England feel to it, but I'm trying to envision this on a sign with the colors.   \n   \nAlso, keep in mind that whatever you put a sign will probably also go on letterhead/business cards (color/B&W), newspaper ads (B&W--considering it's a store), possibly a yellow pages ad (B&W), bags (color/B&W), invoices (B&W), billboards (?), packaging (?), and more. Unless you know for certain a logo will be for a specific use only, design for \\*all\\* the possibilities. You don't know what the client will do with it down the road.   \n   \nAnd the above logo use possibilities are why one generally \\*\\*doesn't\\*\\* charge a pittance for a logo design. Fifty dollars (a figure I pulled out of my hat, but which is typical low-budget pricing) may seem like a lot of money to some people, but think of all the name/brand recognition the client will be getting from YOUR design as their logo is disseminated to the community. That recognition is worth money you should be getting a piece of. It's how you pay the bills and not have watered-down ketchup and crackers for dinner.   \n   \nReally like the name!   \n   \nTheresa\n\n"
    },
    {
      "time": "24 Oct 2003 — 7:32pm",
      "content": "maybe Im being picky, but shouldnt it read.   \n   \n\"Hook(comma)Line & Sinker\"   \n   \nThey are three seperate objects, no? Unless you have some sort of hook-line. Going against what HD said, I don't think the use of a hook would be so bad.   \n   \nI think that there should definately be all three items, not just one. I do like the idea of a treble hook, as opposed to a single hook. Maybe a tear-drop sinker would work better than the double eyed sinker you have displayed here.   \nas far as the item you have in the middle of the picture above, well that looks like a life-float-tube-thingy (whatever those ar called). Make it look more like possible a bundle (and I mean more of a neat, round -- maybe even tied off on the right and left side like they used to do -- bundle)   \n   \nWith three abojects like this, you may experience a little visual instability, my suggestion around this is to reverse them out of boxes, similar to what you have here, but solid boxes. The boxes could be three different colors, that would work, but have the object reversed out (being white).   \n   \nThe small caps I dont care too much for. The H,L,S glyphs look much to heavy. I might suggest a loosely -- but not too loose -- letterspaced all caps line.   \n   \nThe ornaments on either side of your type, really don't do aything for me. It's too distracting.   \n   \nThe type face itself is really not bad. I am not totally crazy about the ampersand though, but then again, that may just be personal opinion.   \n   \nOh, and whats the deal with that middle arm on the E? It looks like it is about to reach out and molest that R. ;)   \n   \nHope some of this was usefull. I have had a few drinks, sooo. ![:-)](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n   \nhildebrant.\n\n"
    },
    {
      "time": "24 Oct 2003 — 11:29pm",
      "content": "wow thanks a lot everyone for all the comments/critisism. I have taken a lot of things said into consideration and decided to give it one more round to see if this design will hold any water... the line art is still not quite right, I will redraw it if i decide to stay with this concept, and change the line so it does not look so much like a life preserver ( i had a bad feeling it was going to read this way and was hoping someone would call me on it). Anyway, when i knock out the illustrations in white and keep the colors dark, it looks fairly decent in black and white (the boxes become dark gray with knocked out white), so I dont think that this will end up being a problem.   \n   \nIm still wondering about the type.. is it still too plain and boring? I used Poppl-Laudatio and modified it very slightly. I wasnt sure how far I should take the type.. any suggestions?   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19205.jpg)   \n   \n   \nif the general consensus is that this route is dead and not worth working on, I will try to come up with something new tomorrow. Thanks everyone.\n\n"
    },
    {
      "time": "25 Oct 2003 — 7:54am",
      "content": "Try an older style typeface if you're trying to keep the 30's feel. The line illustration doesn't work. You need the line to come off the spool to read as line. The Illustrations currently say hook, spool & sinker. Remove the comma after line its not correct. And if its sinkers make sure your illustration is sinkers not sinker. Consider how this would be done in one color. I agree with Kyle loose the ornaments on either side of the name. Its coming along, keep posting\n\n"
    },
    {
      "time": "25 Oct 2003 — 7:58am",
      "content": "One other thing that bothers me, its the mixing of the singular with the plural. Consider making it Hooks, Lines & Sinkers or Hook, Line & Sinker. Don't mix\n\n"
    },
    {
      "time": "25 Oct 2003 — 9:44am",
      "content": "I'd pull out the second comma and make the ampersand old-fashioned, not eurofrigid.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Oct 2003 — 12:09pm",
      "content": "\\>Try an older style typeface if you're trying to keep the 30's feel.   \n   \nGoudy, baby.   \n   \n ![Goudy, baby](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19225.gif)\n\n"
    },
    {
      "time": "26 Oct 2003 — 9:20pm",
      "content": "ok ive been trying to get the \"line\" illustration to read more as a line... not sure if its getting there yet. the problem is that i have to keep the line thick to read, but then it begins to look like rope. again these are really quick roughs just to get a feel for what the final outcome will look like. I definetely like the illustrations in boxes better, and this will also allow me to give them a faded look like that of an antique lure box. Any suggestions where I should go from here?   \n   \n   \nThanks again everyone for all the great feedback!   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19284.jpg)   \n   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19285.jpg)\n\n"
    },
    {
      "time": "26 Oct 2003 — 10:10pm",
      "content": "To me, this says nautical not fishing. Though it's getting much tighter. If you like this angle (groan), then refine if further by balancing the type and the boxes.   \n   \nBTW you don't have show a hook, line and sinker\n\n"
    },
    {
      "time": "26 Oct 2003 — 10:13pm",
      "content": "The Hook and the Sinker are nice.   \n   \nThe new type doesn't seem to capture the spirit as well as   \nthe original type. Maybe a different Goudy, if you're going   \nto keep that direction...Goudy Hundred digitized by Stephen Moye   \nmight work as a starting point.   \n   \nYou have some ligature opportunities: OO and NK are two.   \n   \nAgree with Tiffany. I prefer: Hook, Line & Sinker   \nall singular.   \n   \nThe middle image looks like a life preserver   \na bit too much, imo. If I'm not mistaken, fishing line doesn't   \nhave curls that stay so tight.\\*   \n   \nIncidentally, lots of trademarks have been filed on   \nHook, Line & Sinker. It's something to check out   \nif you are going to suggest that the client adopt the new name.   \n   \n [www.uspto.gov/](http://web.archive.org/web/20131014183610/http:/www.uspto.gov/)   \n   \ngood luck,   \n   \n\\>\\> eurofrigid   \n   \ngood term   \n   \n   \nbj   \n   \n\\*shiznitpicky\n\n"
    },
    {
      "time": "26 Oct 2003 — 10:19pm",
      "content": "Randy, great link. The flavor of that Brunswick type   \nseems very appropriate given Jason's original intentions.   \n   \nLetterhead Fonts might have something like that.   \n   \n [www.letterheadfonts.com/](http://web.archive.org/web/20131014183610/http:/www.letterheadfonts.com/)\n\n"
    },
    {
      "time": "26 Oct 2003 — 10:49pm",
      "content": "ahhh that letterheads font site is EXACTLY what ive been looking for.. and that brunswick logo type was very inspirational.. i think i am going to have to give that direction a shot... if only for myself.. looks like fun ;)   \n   \nappreciate everything guys!\n\n"
    },
    {
      "time": "26 Oct 2003 — 11:03pm",
      "content": "Jason,   \n   \nOne more thing to try is an outline treatment   \nlike this...maybe on a half-curve?   \n   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19288.gif)   \n   \n   \nwith a Copperplate-style face minus the serifs.   \n   \n   \n   \nbj\n\n"
    },
    {
      "time": "27 Oct 2003 — 1:35am",
      "content": "ok here are some EXTREMELY rough idea just to get an idea of how i invision the old trademark look to be applied to this venue. The borders are terrible as i just threw them together to get a rough idea (no batman jokes!). anyway i sort of liked the type treatment and applied it to the old concept as well just to see what it would look like. had a lot of fun doing this! =)   \n   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19299.jpg)   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19300.jpg)   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19301.jpg)\n\n"
    },
    {
      "time": "27 Oct 2003 — 6:36am",
      "content": "Jason, Love the new type for the title. It finally has some character. Nice evolution. Dan\n\n"
    },
    {
      "time": "27 Oct 2003 — 9:21am",
      "content": "There are so many choices at letterhead that might work.   \nIn fact, I overlooked Modern Classic which works ok here.   \n   \nYou might also consider:   \nAntique Half Block   \nArgentine   \nBrewers Bold   \nFairground   \nHensler \\*my pick of this litter\\*   \n   \n [Clichee](http://web.archive.org/web/20131014183610/http:/www.myfonts.com/fonts/storm/clichee/) from Storm. Yes!   \n [Gable Antique](http://web.archive.org/web/20131014183610/http:/www.myfonts.com/fonts/spiecegraphics/gable-antique-condensed-sg/)   \n   \nYou've stumbled into one of my all-time favorites in the old trademark style.\n\n"
    },
    {
      "time": "28 Oct 2003 — 7:22am",
      "content": "Jason -   \n   \nI like the last version you posted - but going through the entire thread, the way my mind seems to work, I wondered why the ampersand wasn't a fish hook all along. I do think your last version, with the three graphic elements in the squares, would work well - it just comes across a bit like those generic sweatshirt designs you see at every resort area across the country. All the manufacturer does is slap a new location name below the existing graphic.   \n   \n- Jeff   \n   \nJeff Fisher   \nEngineer of Creative Identity   \n   \nJeff Fisher LogoMotives   \n [http://www.jfisherlogomotives.com](http://web.archive.org/web/20131014183610/http:/www.jfisherlogomotives.com/)\n\n"
    },
    {
      "time": "28 Oct 2003 — 7:24am",
      "content": "Hmmm...double post. - J.\n\n"
    },
    {
      "time": "28 Oct 2003 — 8:35am",
      "content": "Jason, good work on this! I could see the first trademark one develop into something quite nice. My suggestion would be to check the kerning.. the spacing around the amersand and how the comma is spaced seems off.   \nI do agree with Jeff that the three icons with the type isnt very connected.\n\n"
    },
    {
      "time": "28 Oct 2003 — 6:19pm",
      "content": "something like this?   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19418.jpg)\n\n"
    },
    {
      "time": "28 Oct 2003 — 6:28pm",
      "content": "Jason -   \n   \nI think that looks great. The only thing I see that might be a concern is possibly losing your smaller text \"FISHING, TACKLE & EST. 1931\" when the logo is reduced down to smaller sizes - an inch wide or smaller. That might cause you some reproduction problems in various applications.   \n   \n- Jeff   \n   \nJeff Fisher   \nEngineer of Creative Identity   \n   \nJeff Fisher LogoMotives   \n [http://www.jfisherlogomotives.com](http://web.archive.org/web/20131014183610/http:/www.jfisherlogomotives.com/)\n\n"
    },
    {
      "time": "29 Oct 2003 — 5:28am",
      "content": "Hi Jason,   \n   \nI think this is stronger than where you were headed and looks like it's hitting your goal more squarely.   \n   \nTwo Thoughts:   \n1. Not sure you need the distressed effect to make it look old. BTW it was nicely done! Keep that version (you might use it for print at somepoint). This should work in black and white too with no distressing.   \n2. Yours has it's own personality, but I'm a little torn that the shape is a modified Brunswick Billiards :-) There are so many to choose from! Keep it if you want, but here are some more ideas:   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19442.jpg)   \n   \nActual vintage angling logos:   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19443.gif) ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19444.gif)   \n   \nThe South Bend one looks dated in a bad way. Shakespeare is looking dated in a good way. Yours looks dated in a good way. To dig these up I searched for collectibles online. You might try \\_\\_\\_\\_\\_\\_\\_\\_\\_ collectibles + Logo at google. I put in fishing collectibles + logo, but try hunting, try appliances, try cattle feed (i dunno :-). Or try your own shape. One that works with the long wording.   \n   \nGood Stuff!\n\n"
    },
    {
      "time": "29 Oct 2003 — 7:21am",
      "content": "Jason -   \n   \nI think the distressed look is great for any print application of the logo - and it works great in black and white as it is. However, you will need a solid background when dealing with possible embroidery on caps/shirts, some painted signage, vinyl signage needs, etc. as the distressed treatment will not translate successfully to all applications of the design.   \n   \n- Jeff   \n   \nJeff Fisher   \nEngineer of Creative Identity   \n   \nJeff Fisher LogoMotives   \n [http://www.jfisherlogomotives.com](http://web.archive.org/web/20131014183610/http:/www.jfisherlogomotives.com/)\n\n"
    },
    {
      "time": "29 Oct 2003 — 2:00pm",
      "content": "Thanks a lot for the feedback Randy and Jeff. I will definetely take what you both said into consideration. Randy, yea I actually wasnt planning on using this Brunswick \"wannabe\" trademark, I just did a quick rough to see if i could make the style work for this project. I have plans of testing out different shapes/layouts, however due to time constraints of class (teacher wants roughs for class in about 2 hours) I am just working with what I have for now. I have made some very rough versions of how I envision the identity system to look. Its all 2 color (exept for the business card which is 2/1). Here they are:   \n   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/19488.jpg)   \n   \n   \n(the paper I am using is NOT the paper I plan on using, but apparantly UPS is running late with my order, so i had to use the stock I had)\n\n"
    },
    {
      "time": "29 Oct 2003 — 2:15pm",
      "content": "no this project is going on for another 5 weeks =) the logo and identity was just stage one.. but i dont plan on this being the final... please make all the comments you want! My teacher seems to just go along with everyone and my class is quiet so Im not getting a lot of feedback there.\n\n"
    },
    {
      "time": "29 Oct 2003 — 2:16pm",
      "content": "The blue border on the letterhead and other elements is a disaster waiting to happen. I've been in and around printing for almost 30 years and I can tell you the cutting machines will never give you the same width border on your collateral. Also if a printer took on the job they charge you 100% to 200% overs to make the design work. It would cost a fortune. Also I know that some people who have standard holders for business cards will toss out a card that doesn't fit there filing system. Another potential problem is if you have to photocopy, lets say an invoice if the background is too dark it will be a problem. There are asthetic design problems and then there are real physical and monitary design problems. Dan\n\n"
    },
    {
      "time": "29 Oct 2003 — 2:32pm",
      "content": "dan-   \ni guess i knew deep down inside that the border would not work. i was hoping i could get away with it because the current stores outdoor signage uses a thick border.. as do many of the vintage lure boxes. i will probably remove them eventually =) thanks for keeping me honest!   \n   \nas far as the invoice goes, i will be designing that at a later date and will take the issue of dark background into consideration.   \n   \nthe business card is about 3.5inches wide by 1.25 or so, i was told that as long as i kept it at 3.5 wide it would fit in card holders? i could be wrong, if i am, it would be good to know at this point =)   \n   \nthanks again to everyone for all the valuable feedback, youve helped me turn this project around to a direction I am really enjoying. Makes me want to post all the projects im working on. heh. dont worry ill spare you that tho ;)\n\n"
    },
    {
      "time": "29 Oct 2003 — 2:39pm",
      "content": "Jason -   \n   \nThe pieces you have designed look great, but...   \n   \nDan is correct about the issues of cost with your letterhead . A printer would love to do such a job but in the \"real\" world it would cost a fortune to produce. The envelope would also cause some printing issues and require a custom conversion - which again would be costly. I'm not sure it would realistic to expect a small client pay for such luxuries, unless the \"high-end\" look was a desired result.   \n   \nI'm also assuming that in creating other pieces, like an invoice, the design would take into consideration photocopying or faxing - and still fit into your complete corporate identity.   \n   \nI don't buy into the the whole issue that a biz card MUST be 2 x 3.5. Some of the most eye-catching and effective biz cards are unusual shapes and sizes. Mine is almost square - and perhaps I do like to annoy some people with the unusual size/shape just a little bit. These days a biz card seems to much more of an introduction piece - and then the contact info is transferred to a PDA, a cell phone or a computer address book/data base. Sticking to a standard size/format is just not the major concern it once was when designing a biz card.   \n   \nI've really enjoyed watching your progress on this project.   \n   \n- Jeff   \n   \nJeff Fisher   \nEngineer of Creative Identity   \n   \nJeff Fisher LogoMotives   \n [http://www.jfisherlogomotives.com](http://web.archive.org/web/20131014183610/http:/www.jfisherlogomotives.com/)\n\n"
    },
    {
      "time": "30 Oct 2003 — 5:58am",
      "content": "Jeff good point about the business card. These days that info does go on a pda or equal. I was showing my age.\n\n"
    },
    {
      "time": "31 Oct 2003 — 8:20am",
      "content": "Jason:   \nYour logo design looks really nice, and so much better than what you started with.   \nWhat font did you use for your final design? (Or does anyone else know what that is?)   \n   \nThanks,   \nTroy\n\n"
    },
    {
      "time": "31 Oct 2003 — 3:09pm",
      "content": "Its Modern 1908 Classic from Letterhead\n\n"
    },
    {
      "time": "17 Jan 2004 — 12:57am",
      "content": "hey guys thanks for all the feedback.. i must say.. the final outcome was VERY much improved over the initial rough thanks to all the comments. Some of the work is actually on display at the gallery of my school for the term. Once i get everything back i will have it photographed and upload a photo on here for you all to see. thanks again... ive learned so much from this website. keep it up\n\n"
    },
    {
      "time": "30 Apr 2004 — 7:55pm",
      "content": "heres the final identity system with invoice. there is also packaging, shopping bags, and other various items that have not been photographed at this point.   \n   \n   \n ![](http://web.archive.org/web/20131014183610im_/http:/www.typophile.com/forums/messages/4100/34829.jpg)\n\n"
    },
    {
      "time": "24 Oct 2003 — 4:57pm",
      "content": "Jason, your scroll work and the beginnings of what your type is showing did remind me of this. It makes sense that something \"out west\" or \"in the west\" would still have hints of Art Nouveau or Arts & Crafts at this late of period as trends travelled rather slowly back then.   \n   \nYour scroll work is more nouveau than your type selection however.   \n   \nI would suggest working some roughs up first. Decide on the general shapes you could work with, keeping in mind the words you want to use.   \n   \nIt might be more interesting to break the text up like this:   \n   \nHook,   \nLine &   \nSinker   \n   \nMaybe you could work with squares or circles. (general shapes)   \n   \nPlease do work more roughs up. I'd be interested to watch the progression.\n\n"
    },
    {
      "time": "24 Oct 2003 — 5:09pm",
      "content": "Also. I think the reason everyone here (that has commented) has mentioned weddings are the intertwined circles. I would suggest not using that.\n\n"
    },
    {
      "time": "25 Oct 2003 — 8:13am",
      "content": "Dan I have to disagree, but only a bit. I think that the name works as it is, minus one 's'. It works as a cliche and is used that way as well. For example, \"I fell for that face, hook, line and sinker.\"   \n   \nJason, I think you need to distill this down even more. As it looks, you have vector art and raster art. What if, instead of using those three graphics as is, you redraw them yourself. Or, at least free them from those boxes. I'm sad you are working with the scroll work. That is one of the things that could authenticate it a bit more. And the scroll work could also wrangle it all into one shape instead of several floating shapes. (Maybe)   \n   \nCrazy thought. What if the scroll work were the \"line\" and these three objects were some how \"on\" the line\".... It is morning, I'll use that as an excuse if I decide later that this was a bad idea.\n\n"
    },
    {
      "time": "25 Oct 2003 — 8:25am",
      "content": "Of course, I meant to say \"not working with scroll work\".   \n   \nI think too many people are afraid of doing illustrative work today. The knee-jerk reaction is to simplify their work down to the most sterilized state.\n\n"
    },
    {
      "time": "29 Oct 2003 — 2:09pm",
      "content": "Jason. Is it too late to make more comments?\n\n"
    },
    {
      "time": "14 May 2004 — 5:51pm",
      "content": "I ran across this looking for, well, I don't remember what I was looking for. Most likely something to do with aircraft design (I'm studying to be an aerospace engineer), but I was so awed with the progress on this design that I had to leave a comment. I though that first picture that was posted was really bland, but I saw it improve as I scrolled down, and the final one has such spirit to it. Very nice...\n\n"
    }
  ]
}
