{
  "id": "17963",
  "title": "Average | Italic",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Complete lowercase set with corrections. - archive with date 200206 -\n\nNo spacing, and others.\n\nThanks in advance.  \net\n\n| Attachment | Size |\n| --- | --- |\n| [ave\\_italic\\_160206.pdf](http://web.archive.org/web/20150123074738/http:/typophile.com/files/ave_italic_160206.pdf) | 45.69 KB |\n| [Average\\_Italic\\_200206.pdf](http://web.archive.org/web/20150123074738/http:/typophile.com/files/Average_Italic_200206.pdf) | 35.61 KB |\n\n",
  "author": "fontime",
  "time": "16 Feb 2006 — 7:42am",
  "uid": "1501",
  "comments": [
    {
      "time": "16 Feb 2006 — 12:02pm",
      "content": "again, very nice! i like how the stems bow in and get thinner in the middle, however it think you may have overdone it on the tall ascending characters: d, h & l (d & l in particular).\n\n"
    },
    {
      "time": "16 Feb 2006 — 7:35pm",
      "content": "Feel like a good companion. Keep an eye on the right legs of the m,n,h etc. They need to be at a steeper angle. Now they are opening up to much and breaking your diagonal flow. Also, the r will give you spacing problems. Too wide. Try working on the terminal.\n\nI might also lighten the whole italic a little.\n\n"
    },
    {
      "time": "17 Feb 2006 — 12:18pm",
      "content": "Beautiful lettershapes. In the text setting, I notice  \n- Apart from the r, the c and o seem significantly too wide.  \n- n, m, h are indeed problematic. I do like the tension between the differently angled strokes, it would be great if you could make that work. I agree that increasing the the angle of the whole letter might be a good start  \n- The u appears too upright.\n\nHope that helps!\n\nTim\n\n"
    },
    {
      "time": "18 Feb 2006 — 12:25pm",
      "content": "The real problem with the ascenders might be that the serif is too strong. Combined with the thin-middle strokes (which I like), they give me the feeling that the weight of the serif is about to bend the whole stroke to the left like a Charlie Brown Christmas tree.\n\n"
    },
    {
      "time": "20 Feb 2006 — 10:37am",
      "content": "Complete lowercases with some changes.\n\nThanks  \nEduardo Tunni\n\n"
    }
  ]
}
