{
  "id": "17976",
  "title": "Localised dollar signs",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I've just had an inquiry about [dollar sign](http://web.archive.org/web/20150322223823/http:/typophile.com/wiki/dollar%20sign). The client wants a New Zealand Dollar Sign, meaning a single strike rather than a double. Is there such a thing? I have never heard of this, and always assumed that it was irrelevant either way.\n\n—K\n\n",
  "author": "kris",
  "time": "16 Feb 2006 — 1:25pm",
  "uid": "1519",
  "comments": [
    {
      "time": "16 Feb 2006 — 1:47pm",
      "content": "I wasn't aware that it made a difference. Typeface designs seems fairly random about two- and one-strikes.\n\n"
    },
    {
      "time": "16 Feb 2006 — 1:53pm",
      "content": "Kris,  \nI hope this is not the same guy who wanted you to cut your hourly rate! :-)\n\nChrisL\n\n"
    },
    {
      "time": "16 Feb 2006 — 1:57pm",
      "content": "You've never heard of a dollar sign with a single stroke? Almost all sans serifs that I can think if have dollar signs with just one stroke, and most serifs, too…\n\nI've never designed anything with a double stroked dollar sign.\n\nBy all means, design the glyph for your client… unless he only wants to pays you by the stroke ;-D\n\n"
    },
    {
      "time": "16 Feb 2006 — 2:03pm",
      "content": "\"You’ve never heard of a dollar sign with a single stroke? Almost all sans serifs that I can think if have dollar signs with just one stroke, and most serifs, too…\"\n\nI have heard of both, but never that a \"New Zealand\" Dollar sign is a single strike!\n\nChris—they all want me to cut my hourly rate. I can't wait till all my grey hair has come through then I can look far more serious…\n\n"
    },
    {
      "time": "16 Feb 2006 — 2:10pm",
      "content": "Kris,\n\nWhat is left of my hair is grey and it only changes the way they put it to you.\n\nIf I say my rate is $80 per hour, they say, \"What! I can get some young guy to do it for half that price!\" At which point, should I refer them to you? :-)\n\nChrisL\n\n"
    },
    {
      "time": "16 Feb 2006 — 2:16pm",
      "content": "Chris, send them to me! Like lambs to the slaughter…\n\n—K\n\n"
    },
    {
      "time": "16 Feb 2006 — 2:40pm",
      "content": "There are typical regional preferences in currency symbols, but not really standard distinctions. At the character encoding level, there is simply a dollar character, and whether the glyph in a font has one stroke or two is a design decision. So what your client is expressing is a New Zealand preference for fonts in which the dollar sign has a single stroke.\n\nThis is very similar to the supposed distinction between the British sterling symbol and the Italian lira symbol (although this did result in partial disunification at the character encoding level; I say partial, because the lira character U+20A4 ended up not being used very much, and most Italians continued to use the sterling character U+00A3). The argument there was that the British sterling symbol most often had a single bar (but could have two) but the Italian lira sign must always -- yes, always, absolutely everywhere -- have two bars. I had great fun in Italy wandering around the markets, pre-euro, photographing all the price signs in which the lira had only one bar :)\n\n"
    },
    {
      "time": "16 Feb 2006 — 2:46pm",
      "content": "Kris, kia ora. The single versus double is really an aesthetic thing. There is also the option of having the strokes only off the top and bottom of the \"s\", and not filling in the counters, which is useful in heavy weights.\n\nThe same issue occurs with the Euro and Sterling glyphs, which at heavier weights and in Oldstyle variants, tend to get pretty thick around the middle with two strokes. There are several currency signs which call for double strokes: Yen (U+00A5), Colon (U+20A1), French Franc (U+20A3), Lira (U+20A4, as noted in the Unicode document, this is like the Sterling symbol but with two horizontal strokes; most people chose to use the Sterling glyph instead.), Naira (U+20A6), Won (U+20A9), Tugrik (U+20AE; the double strokes are angled), and Peso (U+20B1). And probably some more.\n\nIn my life I have been called on to revise a double-stroke Sterling glyph to better differentiate it from the Euro.\n\n"
    },
    {
      "time": "16 Feb 2006 — 2:49pm",
      "content": "John, our posts crossed in the afternoon! Apparently the Italians planned to adopt the Lira symbol in their usual way, saying \"domani, domani...\" until the Euro was introduced. Yet another example of the massive cost benefits of procrastination.\n\n"
    },
    {
      "time": "16 Feb 2006 — 2:50pm",
      "content": "BTW, Kris is in New Zealand, so has just as much - if not more - insight on the design of the NZ$ symbol as his client. But, clients are always right, aren't they?\n\n"
    },
    {
      "time": "16 Feb 2006 — 2:53pm",
      "content": "…well, the Euro must have two bars, but sometimes you spot great examples with just one bar, too!\n\n"
    },
    {
      "time": "16 Feb 2006 — 3:21pm",
      "content": "Dan, The euro must always have a lower case 'e' - except in Germany and the Adobe PS name ;-)\n\nNothing in the wikipedia related to the design of the NZ$, wheras the US$ entry does talk about the design...\n\n[http://en.wikipedia.org/wiki/New\\_Zealand\\_dollar](http://web.archive.org/web/20150322223823/http:/en.wikipedia.org/wiki/New_Zealand_dollar \"http://en.wikipedia.org/wiki/New\\_Zealand\\_dollar\")\n\n[http://en.wikipedia.org/wiki/United\\_States\\_dollar](http://web.archive.org/web/20150322223823/http:/en.wikipedia.org/wiki/United_States_dollar \"http://en.wikipedia.org/wiki/United\\_States\\_dollar\")\n\n[http://en.wikipedia.org/wiki/Dollar](http://web.archive.org/web/20150322223823/http:/en.wikipedia.org/wiki/Dollar \"http://en.wikipedia.org/wiki/Dollar\")\n\n[http://en.wikipedia.org/wiki/Euro](http://web.archive.org/web/20150322223823/http:/en.wikipedia.org/wiki/Euro \"http://en.wikipedia.org/wiki/Euro\")\n\n"
    },
    {
      "time": "16 Feb 2006 — 10:31pm",
      "content": "Si, I thought that the Euro was cap-E'd, not just because the official Unicode name is (curiously) capitalised, but because of the etymological origins of the name. Or pehaps the currency is the euro, but the logotype which represents it is the Euro. It's all very Cartesian, or maybe I mean cartesian...\n\n"
    },
    {
      "time": "16 Feb 2006 — 10:31pm",
      "content": "Si, I thought that the Euro was cap-E'd, not just because the official Unicode name is (curiously) capitalised, but because of the etymological origins of the name. Or pehaps the currency is the euro, but the logotype which represents it is the Euro. It's all very Cartesian, or maybe I mean cartesian...\n\n"
    },
    {
      "time": "17 Feb 2006 — 12:21am",
      "content": "About the euro\n\n[http://www.cs.tut.fi/~jkorpela/html/euro.html](http://web.archive.org/web/20150322223823/http:/www.cs.tut.fi/~jkorpela/html/euro.html \"http://www.cs.tut.fi/~jkorpela/html/euro.html\")\n\n"
    },
    {
      "time": "17 Feb 2006 — 12:25am",
      "content": "Sorry chester, I've heard Si's point before. According to some EU rule, the word \"euro\" is always to be written with a lowercase e. The German-speaking countries got an exception, since German capitalizes the first letter in nouns (der Euro).\n\nI presume, however, that euro may also be written EURO, since eURO would just be silly ;-)\n\nOf course, type designers could just go around calling the euro the Euro… we don't seem to hold ourselves to the strict guidelines for the design of the Euro symbol, either.\n\nBut you should get this… what if everyone started calling you Chester (with a capital C)?\n\n"
    },
    {
      "time": "17 Feb 2006 — 12:46am",
      "content": "_I thought that the Euro was cap-E’d, not just because the official Unicode name is (curiously) capitalised_\n\nYou mean the official Adobe Glyph List name (all Unicode names are all caps: U+20AC = EURO SIGN). David Lemon explained a few years ago that he had seen 'Euro' written capitalised in a number of places, so capitalised it in the AGL, despite the fact that no other currency symbol glyph names are capitalised.\n\n"
    },
    {
      "time": "17 Feb 2006 — 5:25am",
      "content": "\"what if everyone started calling you Chester (with a capital C)?\"\n\nBut dan, then they would start looking for Mr. Dillon next to him :-)\n\n[http://www.nostalgiacentral.com/tv/drama/gunsmoke.htm](http://web.archive.org/web/20150322223823/http:/www.nostalgiacentral.com/tv/drama/gunsmoke.htm \"http://www.nostalgiacentral.com/tv/drama/gunsmoke.htm\")\n\nChrisL\n\n"
    },
    {
      "time": "17 Feb 2006 — 5:34am",
      "content": "e. e. cummings and I had this conversation all the time...\n\nSince I have taken to designing all of my currency symbols in both majuscule/lining and miniscule/oldstyle, I propose that Euro refer to the former, and euro to the latter. (Ditto Dollar and dollar, Yen and yen, etc.) This is consistent with the names for letters, like Dcaron and dcaron, Eth and eth, etc.\n\n"
    },
    {
      "time": "17 Feb 2006 — 5:46am",
      "content": "Good idea!\n\nIs a Dollar sign with just one bar a \"dolar\"?\n\n"
    },
    {
      "time": "17 Feb 2006 — 5:57am",
      "content": "Just like Spanish?\n\nChrisL\n\n"
    },
    {
      "time": "17 Feb 2006 — 6:13am",
      "content": "Dan, yes! the oldstyle one is the dolar, and the lining one is the Dolar!\n\n"
    },
    {
      "time": "31 Jul 2007 — 12:16am",
      "content": "To add more fuel to this fire...\n\nAs an Australian graphic designer and typographer I have been faced with the one slash versus two a couple of times in my career. The request to use the single stroke dollar sign usually comes from editors and seems to stem from an ingrained cultural bias against the double stoke, in that it is associated with the US dollar. There is some colloquial evidence to suggest that Australians adopted the single stroke dollar sign after WW2 to differentiate the Australian Dollar from the US dollar, essentially an attempt to distance us from the 'Seppos' (charming rhyming slang, Americans \\> Yanks \\> Septic tanks \\> Seppos). I imagine the Kiwis acted on equal sentiments...\n\n"
    },
    {
      "time": "31 Jul 2007 — 12:56am",
      "content": "The font used for official United States diplomatic documents (except for telegraphs and a few other exceptions), as well as its predecessor, has a single-stroked dollar sign. (14pt Times New Roman, 12pt Courier New before). Actually Courier New has the half-lines, only above and below the S.\n\nOn the Mac I'm posting from right now, there are 336 typefaces available, this is based on a standard Mac OS X Tiger install with MS Office, Matlab, MAPLE, and TeX installed as well. Of those 336, just over a dozen have the double stroke. More have the broken stroke than a double stroke, although the single unbroken stroke is by far the most common.\n\nOT: Niels, I've always thought it odd when I hear Aussies referring to us insulting as Seppos, since calling us, or at least those in my region, a Yank would be far more offensive/insulting (but then again, I'm from the Deep South).\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "1 Aug 2007 — 6:03am",
      "content": "Maybe the number of strokes should represent the value of the currency compared to the USD. If that is the case, Canada is very nearly back to a two stroke symbol, and with another few years of Bush economics, we might make it to a three stroke S.\n\n"
    },
    {
      "time": "27 Aug 2007 — 9:14pm",
      "content": "I've just had another look at this forum, and although a little off the topic, but still relevant, is this little tidbit:  \nThe dollar sign actually evolved from a mark that is a representation of p8, the contraction of 'pieces of 8' (Spanish currency used in the Americas). It evolved into the 'S' with the two bars. Mechanical reproduction of type caused the removal of the second bar as the two thin lines so close to each other would cause ink to run, or blend into one line anyway. Hence one bar. Type designers are now even doing away with the part of the bar inside the character.  \nN.\n\n"
    },
    {
      "time": "27 Aug 2007 — 10:28pm",
      "content": "<cite>There are several currency signs which call for double strokes: Yen (U+00A5), Colon (U+20A1), French Franc (U+20A3), Lira (U+20A4, as noted in the Unicode document, this is like the Sterling symbol but with two horizontal strokes; most people chose to use the Sterling glyph instead.), Naira (U+20A6), Won (U+20A9), Tugrik (U+20AE; the double strokes are angled), and Peso (U+20B1). And probably some more.</cite>\n\nFor what it's worth, the won symbol (₩) can have one or two horizontal strokes. I'm not even sure which version I'd use in my own handwriting though. Maybe a slight preference for two strokes... The thing is, Koreans don't use the symbol that often in ordinary writing, and instead write out 'won' in Hangul (the Korean alphabet; it's not that long). We see it on price tags, printed out. Many fonts use the one-stroke variant.\n\nIf I remember correctly, the symbol for yen or yuan (¥) can also have one or two strokes; the Japanese prefer two for the yen symbol, while the Chinese seem to use the one-stroke version a lot more for the yuan symbol.\n\nBy the way, I cannot for the life of me remember for certain if the written shorthand for Kenyan shillings (or colloquially, 'bobs') is '/-' or '/='. I remembered it as '/=', but [the Wikipedia article on 'shilling'](http://web.archive.org/web/20150322223823/http:/en.wikipedia.org/wiki/Shilling) has it as '/-', and now I'm dreadfully confused. It's as though the fact that one-stroke and two-stroke versions are interchangeable in many currency symbols is messing with my memory. Well, it _has_ been more than six years since I left Kenya...\n\nI suspect both '/-' and '/=' are used, with a preference for '/=' in Kenya, but does anyone know for sure?\n\n"
    },
    {
      "time": "28 Aug 2007 — 6:03am",
      "content": "Different strokes for different blokes :-)\n\nChrisL\n\n"
    },
    {
      "time": "9 Aug 2008 — 3:33pm",
      "content": "Kris-\n\nGuess what.\n\nIf a dollar symbol has only one strike, it means the backing behind the currency is void, like the symbols Ф, which only has one strike.\n\nIf a dollar symbol has two strikes, it means the currency is backed by substance, such as silver.\n\nStatutory government, which operates in pure fiction, only recognizes the single strike version of the currency.\n\nIf you provide a double-strike symbol in a statutory government document, they won't know how to recognize the symbol. In fact, if it is a court case, they might throw it out, because courtrooms only operate in fiction, unless they are in the common law.\n\n"
    },
    {
      "time": "9 Aug 2008 — 3:36pm",
      "content": "Kris, If you have access to a dollar symbol with two strikes in it, I sure would appreciate a reference to it.\n\nI can't tell you how hard it is to find that symbol, because fiction is all around us.\n\nThanks,  \nDaniel\n\n"
    },
    {
      "time": "9 Aug 2008 — 3:42pm",
      "content": "Niels-\n\nIn accordance with my previous two posts, the single strike dollar is used because the dollar is disconnected from the gold standard.\n\n"
    },
    {
      "time": "10 Aug 2008 — 6:52am",
      "content": "Daniel, do you have any reputable sources for this? If not maybe a wikipedia page?\n\n"
    },
    {
      "time": "10 Aug 2008 — 12:23pm",
      "content": "Indeed, the gold standard relation to the double stroked dollar sign does sound a bit like a tinfoil-hat level conspiracy theory. Even if it is technically correct, it comes off daffy.\n\n"
    },
    {
      "time": "11 Aug 2008 — 8:26am",
      "content": "[Hermann Zapf](http://web.archive.org/web/20150322223823/http:/typophile.com/wiki/Hermann%20Zapf)’s [Palatino](http://web.archive.org/web/20150322223823/http:/typophile.com/wiki/Palatino) Linotype (the version that ships with Windows) has both versions. The single stroke version is the default (U+0024). Its small-caps feature only the single stroke version.\n\n ![](http://web.archive.org/web/20150322223823im_/http:/typophile.com/files/palatino-currency_4653.png)\n\nPalatino also has two versions of the Yen sign (¥). Then, there’s an alternative Pound (£) glyph which descends below the baseline. The double stroke £ is actually the Lira sign (₤).  \nF\n\n"
    },
    {
      "time": "11 Aug 2008 — 10:37am",
      "content": "That double-stroke dollar sign sure would be a pain with very bold fonts. I have enough trouble with the single bar.\n\nChrisL\n\n"
    },
    {
      "time": "11 Aug 2008 — 10:51am",
      "content": " ![](http://web.archive.org/web/20150322223823im_/http:/typophile.com/files/dollar_4289.png)\n\n"
    },
    {
      "time": "11 Aug 2008 — 11:01am",
      "content": " ![](http://web.archive.org/web/20150322223823im_/http:/typophile.com/files/dollar2_5844.png)\n\n"
    },
    {
      "time": "11 Aug 2008 — 3:08pm",
      "content": " ![](http://web.archive.org/web/20150322223823im_/http:/typophile.com/files/Capshrek_5397.JPG)\n\n"
    },
    {
      "time": "24 Nov 2008 — 5:35am",
      "content": "Wow, a triple-bar dollar sign. Is that real? Looks more like a musical clef.\n\nPeace,  \nJT\n\n"
    },
    {
      "time": "23 Apr 2009 — 8:59pm",
      "content": "Hello! I was once addicted to typography. Was surfing and this popped up. Thought you would like to know the story about the US dollar sign. The $ symbol indicates fiat currency which we currently use. It's a worthless debt instrument. The double bars in the old symbol indicated US the U was cropped off. The double bars indicated that it was true currency redeemable upon demand. In 1965 all the typewriters changed over to the single bar. Old ones all have the double bar.\n\nSo, two bars is when we had a pot to piss in.\n\none bar is what we currently use, worthless pieces of paper backed by nothing more than guns.\n\nHave fun digging up that skeletion!\n\n\\311\n\n"
    },
    {
      "time": "24 Apr 2009 — 8:04pm",
      "content": "<cite>The double bars in the old symbol indicated US the U was cropped off.</cite>\n\nExcept for the inconvenient fact that the symbol is older than the US.\n\n"
    },
    {
      "time": "26 Apr 2009 — 9:14pm",
      "content": "\\> In 1965 all the typewriters changed over to the single bar.\n\nThat would be fascinating, if it were true.\n\nT\n\n"
    },
    {
      "time": "26 Apr 2009 — 10:52pm",
      "content": "\\> In 1965 all the typewriters changed over to the single bar.\n\nI don't remember that happening and I would have noticed.\n\nChrisL\n\n"
    },
    {
      "time": "27 Apr 2009 — 9:34am",
      "content": "I just realized my sarcasm on that point might have been read as mere mild doubt. I was saying \"that never happened,\" just a bit obliquely.\n\nT\n\n"
    },
    {
      "time": "27 Apr 2009 — 12:52pm",
      "content": "Conspiracy theories and urban legends and total speculation; are these the sources we turn to for the origin of the dollar sign, and whether it should have one or two (or three) bars?\n\nMyths and legends are great stories, and sometimes have useful advice buried within them, but shouldn't be counted on for technical specifications.\n\n"
    },
    {
      "time": "21 Jul 2009 — 7:01am",
      "content": "I use the double bar whenever I write the dollar sign by hand (in Canada). The reason may have to do with the fact that I played a lot of Monopoly when I was young and there was a double bar dollar sign on the game cover from the 1970's.\n\nI thought that the current, pervasive use of the single bar dollar sign had to do with the advent of the personal computer and the decision to use the single stroke $ symbol to denote a 'string' in the early computer programming languages. Since the first users of the personal computer were mostly programmers, I imagine that it would have made sense to put the string key $ on the keyboard rather than the dollar sign (with double bar). Or rather, if my history is wrong and a single bar dollar sign was in fact an acceptable or current form at that time (but I was too young to know it), then the single bar dollar sign was likely chosen since it would show up better on small, lower-res computer screens and with the low-res dot-matrix computer printers. As everybody uses computers now to write rather than by hand, with the printed word following the type found on the computer (e.g. newspapers, price stickers, etc.), we seem to be stuck with the single bar dollar sign.\n\n ![](http://web.archive.org/web/20150322223823im_/http:/typophile.com/files/monopoly%24_3521.jpg)\n\n"
    },
    {
      "time": "21 Jul 2009 — 7:18am",
      "content": "I thought it was all because of the greatly devalued dollar--it is no-longer worth two strikes :-)\n\nChrisL\n\n"
    },
    {
      "time": "22 Jul 2009 — 2:33am",
      "content": "@ Nick Shin: Well done the thick one! and the triple-stroked. Please offer a four-stroked variant (which I suggest to call the “Guantanamo-Dollar” … ;-)\n\n"
    },
    {
      "time": "22 Jul 2009 — 5:41am",
      "content": "\\> It’s a worthless debt instrument.\n\nI missed that post yesterday. If you have any of those worthless debt instruments lying around, I'll be glad to take them off your hands.\n\n"
    },
    {
      "time": "10 Jan 2013 — 2:42pm",
      "content": "> a single strike rather than a double\n\nToday, Bolivia is one of the poorest countries in South America.  \nIronically it was the largest producer of Silver ever known to mankind.\n\n41,000 metric tons of pure silver were mined from Cerro Rico from 1556 to 1783 by Spanish invaders, killing thousands of natives in the process. And, as the local indians where to few, they also imported African slaves to keep mining Potosí silver.\n\nAs a result of this exploitation, the spanish silver coins experienced an enormous global boom, and became the most widespread currency in the world in the 18th century. The spanish Potosí silver coins where accepted by traders all around the world. It became the first 'World Currency'.\n\n“Vale un Potosi” (It is worth a Potosi) became a commonly used expression to describe vast wealth, after Quixote blurted it out in Cervantes’s Don Quixote.\n\nThese coins where also know as the \"Spanish dollar\".  \nThe Spanish dollar was the coin upon which the original United States dollar was based, and the Potosí silver coins remained legal tender in the United States until the Coinage Act of 1857.\n\nThe coins looked like this:\n\n ![](http://web.archive.org/web/20150322223823im_/http:/typophile.com/files/potosi-coins_4878.png)\n\nSome theories suggests that the Dollar sign we know today, is the result of removing the spanish coat of arms from the middle of the coin, and merging the 2 remaining columns together under one unified ribbon.\n\n"
    }
  ]
}
