{
  "id": "1801",
  "title": "Mac OS X Panther and FontBook",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Panther is officially available now. Has anyone already installed it and tried it out? Any comments on the FontBook?\n\n [‹ Retro fonts](http://web.archive.org/web/20080423012425/http:/typophile.com/node/2345 \"Go to previous forum topic\") [Robb my countries treasures ›](http://web.archive.org/web/20080423012425/http:/typophile.com/node/2219 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080423012425/http://typophile.com/user/2045\" title=\"View user profile.\">zilmer</a>",
  "time": "<br>",
  "uid": "2045",
  "comments": [
    {
      "time": " 25.Oct.2003 6.53am",
      "content": "i am curious to hear the some comments... i havent upgraded yet and font book sounds cool\n\n"
    },
    {
      "time": " 25.Oct.2003 7.18am",
      "content": "I installed Panther yesterday and its really stable and its cool. Font book could be cool, but I'm sticking with Font Reserve for the time being. I read an article that was down on font book. I'll wait and see.\n\n"
    },
    {
      "time": " 25.Oct.2003 8.51am",
      "content": "Just installed Panther. First impressions:   \n   \n\\* DAMN fast compared to Jaguar   \n   \n\\* some bug with the Input Menu/Keyboard layouts - since the US is default but I need to use Estonian, I switch to Estonian, but every once in a while the system switches me back to US. REALLY annoying. Hope there's a fix/workaround/option somewhere, I'll keep looking.   \n   \n\\* FontBook is VERY fast (and very... umm... simple and reasonable) compared to Suitcase. After installing the software I'll see about how it will function with different apps.   \n   \n\\* Disappointed with what they've done with the default typeface on Finder/Safari/Other apps. Seems they've modified Helvetica and the kerning is totally screwed up. If you install it go to Typophile Forums topics front page and you see what I am talking about...   \n   \nMore later... ![:-)](http://web.archive.org/web/20080423012425im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 25.Oct.2003 9.13am",
      "content": "My mistake - there's nothing wrong with Helvetica - I just disabled it from the FB accidentally and therefore the webpages rendered all wrong. If you have the basic X fonts (Geneva, Helvetica, Lucida Grande etc) enabled, everything works just fine!\n\n"
    },
    {
      "time": " 25.Oct.2003 10.52am",
      "content": "the us keyboard thing can be the consequence of the desktop pic type. If it's not in .jpg, it turns unexpectedly to the US keyboard.\n\n"
    },
    {
      "time": " 25.Oct.2003 3.56pm",
      "content": "Very happy with Panther so far. The speed of the finder is   \nmuch improved. It's faster/smoother. (I'm on a G4/667). I'll   \nlet you know what I think of FontBook after I've used for a   \nwhile.   \n   \nWhat I didn't realize from the FontBook demo at TypeCon is   \nthat you can search for fonts (unlike Suitcase.) For example,   \nsearching for 'ding' reveals Webdings, Wingdings and Zapf   \nDingbats on my system. (I'm looking forward to searching   \nfor light or small caps or round or inline or smallcaps.) This   \nis a feature I've long wished for.   \n   \nFontBook also has a \"Keyboard Viewer\" very similar to the   \nold \"Key Caps\" applet where you can preview characters   \nwith various keystrokes. The improvement over Key Caps is   \nyou can select a font to preview it in. Very handy, especially   \nfor dingbat fonts.   \n   \nThe \"show font file\" command is sweet. It locates the font   \nin the finder.   \n   \n   \n\\_\\_\\_\\_\\_\\_\\_   \n   \nSo, halfway through writing this I just discovered that   \nSuitcase 10.1.3 \"unexpectedly quits\" whenever I launch it.   \nOuch. I've gotta sleuth that one out and get back to you.)\n\n"
    },
    {
      "time": " 25.Oct.2003 4.19pm",
      "content": "\\>_So, halfway through writing this I just discovered that_   \n\\>_Suitcase 10.1.3 \"unexpectedly quits\" whenever I launch it._   \n\\>_Ouch. I've gotta sleuth that one out and get back to you.)_   \n   \nMaybe an upgrade to [Suitcase X1](http://web.archive.org/web/20080423012425/http:/www.extensis.com/suitcase/) would alleviate those pains. My only recommendation if you update Suitcase is to let their installer do all the talking. I thought I would be helpful and manually delete a bunch of Suitcase support files in Classic, and X1 crashed continuously after updating. A clean install of X1 over a fresh install of 10.1.x worked.\n\n"
    },
    {
      "time": " 25.Oct.2003 5.08pm",
      "content": "Seems to me everything is much MUCH improved in Panther: besides Finder (on steroids) the software runs smoother, the whole system customization is a lot faster, logins/boots are lightning fast etc.   \n   \nFontBook is right now probably not the hardcore tool to immediately replace the likes of ATM (may it rest in peace) or Suitcase. But if you have enough time to browse/compare/activate your fonts manually and you are very well aware of what is going on in your Fonts folders, it is extremely reasonable replacement to these tools.   \n   \nIt is fast, very simple and what's the best part - Apple most likely created it to develop it into the next Suitcase or ATM. I mean this is just version one. So, let's give it some time and I bet it will become a really powerful tool.   \n   \nMeanwhile I still have the problem with the Input Menu swicthing. Tried to swap my background picture for .jpg, but Panther still keeps changing my keyboard layout from Estonian back to US.   \n   \nIt is probably a thing many users could not care less about, but do trust me - there are a lot of people using non-US keyboard... And it is a really annoying bug. Does anyone know if there's a workaround to tweak the system so, that Estonian could be the Input Menu language?\n\n"
    },
    {
      "time": " 25.Oct.2003 6.38pm",
      "content": "All the Font Book features Joe talks about are available in   \nFontAgent Pro (minus the keycaps thing which is already   \naccessible through the \"Character Palette\" in OS X's input   \nmenu). But FontAgent Pro (and the other third-party   \nmanagers) have one thing Font Book is missing: auto-   \nactivation. For those who haven't benefited from the goodness   \nof this feature, it automatically activates all the fonts in any   \nIllustrator/Photoshop/Quark/InDesign document when you   \nopen it. This saves a ton of time for those who have many   \nclients/jobs/fonts to work juggle.   \n   \nCould Apple implement this in Font Book? Probably, and they   \nmight do it better than Extensis or Insider. But will they? I   \nwould be surprised. It would be the single feature that would   \nmake those third party utilities obsolete, effectively pulling   \nthe plug on an entire (though admittedly smallish) sector of   \nOS X software.   \n   \nNo, I don't see anything new going into Font Book.   \nIt's an excellent manager for the majority of OS X users, the   \nsort of thing the Mac OS should have been built with from   \nthe beginning. But pro users will need something more,   \nand it would be dumb for Apple to flip off two longstanding   \ndevelopers and supply the goods themselves.   \n   \n_(pardon the poor writing. this was written too late at night.   \ngee, i wish i was still in the same time zone as all you kids.)_\n\n"
    },
    {
      "time": " 25.Oct.2003 8.09pm",
      "content": "Stephen, you may be right about Apple not wanting to obliterate the other font-management apps, but it didn't hesitate to push ATM Deluxe out the door, and surely Adobe had the greatest market share (or maybe they were neck-and-neck with Extensis) in that area before OS X.   \n   \nApple also hasn't had any qualms about challenging Microsoft in the browser and presentation-software arenas (arenae?). I love Apple software, use Safari almost exclusively and am glad for the appearance of Keynote, but I wonder whether it's a wise strategy in the end.\n\n"
    },
    {
      "time": " 25.Oct.2003 8.38pm",
      "content": "_[Apple] didn't hesitate to push ATM Deluxe out the door_   \n   \nI've never heard _that_ one before. As I understand   \nit, Adobe made the decision not to upgrade ATM Deluxe to   \nwork with OSX, to the consternation of its many users.   \nApple had nothing to do with it (other than releasing OSX).\n\n"
    },
    {
      "time": " 25.Oct.2003 8.59pm",
      "content": "Mark, that's what I thought, too -- until I heard directly from an Adobian that FontBook was the specific reason Adobe stopped developing ATMD. He said, \"We couldn't say it publicly before the release of Panther.\"\n\n"
    },
    {
      "time": " 25.Oct.2003 9.06pm",
      "content": "Perhaps Thomas P. can confirm or deny?\n\n"
    },
    {
      "time": " 25.Oct.2003 9.14pm",
      "content": "Well, I'd hate to contradict one of my colleagues in public. ![:-)](http://web.archive.org/web/20080423012425im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nHowever, a look at the relevant timelines makes it pretty clear the two are unrelated; or if anything the causation is the other way around. AFAIK, FontBook was never envisioned until after OS X had been out on the market for a while, and people were complaining about OS X's font handling.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 25.Oct.2003 9.24pm",
      "content": "\\<opinion\\>   \n   \nBeing one of the marketing insiders at the time that ATMD was launched, I believe it was a loss leader for Adobe. It never made them money, but it was a product expected of them. The time and resources required to port ATMD to OS X would never have been recouped given the number they would have to sell at the current market-driven price point. Now, let the murmuring begin...   \n   \n\\</opinion\\>\n\n"
    },
    {
      "time": " 26.Oct.2003 12.05am",
      "content": "ATM Deluxe was never _that_ great. From what I remember, you had to double click to view a font, which it then brought up in a new window. So to compare 3 fonts, you would have 4 windows open. It did, however, always auto-activate without problem. The current Suitcase is better than ATMD ever was.   \n   \nSomewhat related: If you Illustrator 10/OS X users uncheck all of the options when saving native files, Suitcase will not auto-activate the fonts in that file the next time you open it. I figured this out after almost a year. Extensis still may have no clue.\n\n"
    },
    {
      "time": " 26.Oct.2003 3.40am",
      "content": "Hi,   \nI am a little conservative when it comes to functions and programs which I really like the way they are.   \nOne reason for sticking with OS 9 as long as I have was the way I use ATM Deluxe: to me, its auto-activation function is THE way to save time when switching between jobs. As a freelance writer-designer of FontShop publications I use hundreds of fonts.   \n   \nSo let me get this straight. A font management program for me needs to have 3 features:   \n- auto-activation   \n- drag-and-drop creation of subsets (as in ATM-Deluxe)   \n- search feature based on parts of fontnames (\"name contains...\").   \nI understand FontBook won't give me that right now. What will, when switching to OS X?   \nJan\n\n"
    },
    {
      "time": " 26.Oct.2003 5.28am",
      "content": "Some software incompatibility already found - if I enable a font in a FontBook and then switch to Macromedia Fireworks MX 2004, the font does show up in the font menu but it won't change on the canvas. ![:-(](http://web.archive.org/web/20080423012425im_/http:/www.typophile.com/forums/clipart/sad.gif) The same thing does work with Adobe apps, though.\n\n"
    },
    {
      "time": " 26.Oct.2003 10.33am",
      "content": "More from [MacInTouch](http://web.archive.org/web/20080423012425/http:/www.macintouch.com/panreader04.html):   \n   \nFont Book limits   \n   \nWilliam Kyngesburye   \n Well, looks like Font Book is NOT font management for graphic artists. Not only is there a limit on the number of fonts that can be activated (understandable), but there is a limit on the number of fonts that Font Book can MANAGE.   \n   \nIt's not just font families, but individual font styles - when I was near the limit (I had 124 families, including Apple stuff and Classic fonts) and added another font family, it only added a few of the styles. Deleted a family, and I was able to add all of the incomplete family (so it's not corrupt fonts).   \n   \nAlso, some font names are strange - a small number, the family name, two asterisks, the style and a BIG number, ie \"8 BauerBodoni\\*\\* Black 09033\". These names show up in any application that uses the OS X font panel for font selection. Apps that use internal font handling (Illustrator) show expected font names, no matter what Font Book says.   \n   \nThere seems to be random problems adding fonts as well - sometimes it won't.   \n   \nYou can't install and manage duplicate fonts, such as different versions (some clients are picky about versions). Probably has something to do with the PS font file names - while you can keep different suitcase names, PS file names are fixed, so you can't have two copies of the PS files in the font folder. No sub folder organization to work around this, unless you manually copy fonts to the fonts folder.   \n   \nBack to SuitCase.   \n   \n   \n Adam Yellin   \n I tried using the Font Book instead of Suitcase and my fonts all came out jumbled, so went back to using Suitcase for now. There is nowhere I can find that even tells us how to use Font Book properly. Like how to remove fonts from it without deleting them from the drive entirely.   \n   \nAre these reports useful here? If it's just clutter, let me know & I'll stop.\n\n"
    },
    {
      "time": " 26.Oct.2003 10.49am",
      "content": "Here's a list of Apple's own [support documents relating to Font Book](http://web.archive.org/web/20080423012425/http:/search.info.apple.com/index.html?q=%22font%2Bbook%22&search=Go). Not a lot of detail, as these are meant to be short, sweet FAQ-like answers. When issues crop up with Font Book and [if] Apple officially acknowledges them, they will shown on this page.   \n   \nThere are several threads current running on Apple's discussion boards regarding Font Book as well:   \n   \nFCP 4.0.2 Fonts Problems worsen with Panther   \n [http://discussions.info.apple.com/WebX?50%40157.iXjvaV3IhFJ.13%40.599b532d](http://web.archive.org/web/20080423012425/http:/discussions.info.apple.com/WebX?50%40157.iXjvaV3IhFJ.13%40.599b532d)   \n   \nI think Font Book is a beta - shame shame!   \n [http://discussions.info.apple.com/WebX?50%40157.iXjvaV3IhFJ.13%40.599b50f8](http://web.archive.org/web/20080423012425/http:/discussions.info.apple.com/WebX?50%40157.iXjvaV3IhFJ.13%40.599b50f8)   \n   \nFont Book Issue   \n [http://discussions.info.apple.com/WebX?50%40157.iXjvaV3IhFJ.13%40.599b4df9](http://web.archive.org/web/20080423012425/http:/discussions.info.apple.com/WebX?50%40157.iXjvaV3IhFJ.13%40.599b4df9)   \n   \nAdobe Font Folio + Font Book = problems   \n [http://discussions.info.apple.com/WebX?50%40157.iXjvaV3IhFJ.21%40.599b5316](http://web.archive.org/web/20080423012425/http:/discussions.info.apple.com/WebX?50%40157.iXjvaV3IhFJ.21%40.599b5316)   \n   \nEtc.\n\n"
    },
    {
      "time": " 26.Oct.2003 11.19am",
      "content": "Well, I guess I'll try Panther and FontBook, but the way I work at the moment is to use Quark 4.1 on OS 9.1, with ATM Deluxe and Type Reunion -- which is what I really can't do without, because it means I don't have to scroll through a massive font list to find what I want, or go shift files around every time I start a new job.   \n   \nAm I missing something? -- When I'm in InD in OS X, and go to choose a font, I get a mammoth list of every font on my hardrive, and when I scroll down I can never click on the typeface I want, because I'm always whizzing by on either side. Has Panther solved this problem?\n\n"
    },
    {
      "time": " 26.Oct.2003 11.42am",
      "content": "Jan, Nick, Everyone Else: As I said before, give [FontAgent Pro](http://web.archive.org/web/20080423012425/http:/www.insidersoftware.com/)   \n a try. It works in Jaguar and Panther and it has auto-   \nactivation for InD, Illustrator, Quark, and Photoshop.   \n   \nI've used it for almost a year and the latest version is the   \nonly OS X font manager that keeps me from missing ATM   \nDeluxe.\n\n"
    },
    {
      "time": " 26.Oct.2003 11.43am",
      "content": "Let's hope so. That scrolling problem drives me nuts, and not just with fonts. With long lists on webpages, it's just as bad.   \n   \nThe drop-down lists in Windows (always more relaxed about a keyboard interface) are far better: excellent navigation with cursor up/down, page-up/down, and alpha-keys to go through items starting with that letter.\n\n"
    },
    {
      "time": " 26.Oct.2003 11.52am",
      "content": "Nick, as Stephen suggests, Font Agent Pro does group families together, exactly like Type Reunion.   \n   \nAm I the only one who has problems running Photoshop and Font Agent Pro at the same time? I'm baffled.\n\n"
    },
    {
      "time": " 26.Oct.2003 6.28pm",
      "content": "\\>Somewhat related: If you Illustrator 10/OS X users   \n\\>uncheck all of the options when saving native files,   \n\\>Suitcase will not auto-activate the fonts in that file the   \n\\>next time you open it.   \n   \nReally? When I uncheck all the options and save as native .ai extensis still auto activates the fonts.\n\n"
    },
    {
      "time": " 26.Oct.2003 6.28pm",
      "content": "\\>Somewhat related: If you Illustrator 10/OS X users   \n\\>uncheck all of the options when saving native files,   \n\\>Suitcase will not auto-activate the fonts in that file the   \n\\>next time you open it.   \n  \n\\>Really? When I uncheck all the options and save as native .ai extensis still auto activates the fonts.   \n   \nI guess it's not the case for us all.   \n   \nWhen I originally installed Suitcase, it worked fine. Then I went into my system, deleted some Apple-installed fonts and other random font files (.lst files) and all the sudden auto-activation stopped working.   \n   \nThen one day I opened some old AI 8 files and it DID auto-activate. After some digging, I learned that the only way it would work again is if I had all the options checked.   \n   \nIf that makes sense at all...\n\n"
    },
    {
      "time": " 27.Oct.2003 12.34pm",
      "content": "Ok. Here's a question for all of you --   \n   \nClean install or upgrade? Which did you do? And are you happy with the results?\n\n"
    },
    {
      "time": " 27.Oct.2003 1.23pm",
      "content": "Upgrade from Jaguar. All went well. I do so much   \ncustomization I'd rather take my chances with an upgrade   \nthan start all over.\n\n"
    },
    {
      "time": " 27.Oct.2003 1.38pm",
      "content": "I\n\n"
    },
    {
      "time": " 27.Oct.2003 5.33pm",
      "content": "After being on the 'other side of the screen' for a while concerning Mac OS X I'd recommend kicking of your data from the disc so you can initialize (format) it in Apple's new Journaling File system.   \nThis gives your systems an extra kick in the butt and chek on your filesizes, much better!\n\n"
    },
    {
      "time": " 27.Oct.2003 6.00pm",
      "content": "I agree that Frank's suggestion will allow you to take advantage of some of the recent file system changes in OS X ( [journaling](http://web.archive.org/web/20080423012425/http:/docs.info.apple.com/article.html?artnum=107249) is a mightly nice safety feature to have), but be prepared to spend quite a bit more of your day migrating. The nice thing about Archive & Install is that you'll be upgraded and running again in under fifteen minutes. (On average anyway, your mileage may vary.)\n\n"
    },
    {
      "time": " 27.Oct.2003 6.33pm",
      "content": "Font Book is a disappointment for sure, but even worse, I   \ncan't get any font management apps to open now. Suitcase   \n10, Suitcase X1 Demo, and the FontAgent demo all bomb   \nout, leaving me with the annoying bug report dialog.\n\n"
    },
    {
      "time": " 28.Oct.2003 10.10am",
      "content": "first post, just wanted to share some notes on the nasty little beast called FontBook   \n   \nBy default, FontBook MOVES fonts into your user/library/fonts folder - meaning, if you have a nice little organized folder of fonts divided up into categories or whatnot - it moves your fonts out of there.   \nGuess what happens if you remove one of these fonts from FontBook?   \nDoes it put them back where it got 'em?   \nOh no no!   \nIt TRASHES them.   \nGranted, you just gotta drag stuff back off your CD/archive or whatnot - but this is really annoying.   \nIt took me awhile to figure out why my fonts were disappearing.   \n   \nTo solve this - open FontBook prefs and check 'Always copy fonts when adding'   \n   \nanother thing - I can't get Univers to work. Period. It works fine in OS9, and in Jaguar - but in Fontbook it turns it to all caps garbled junk with nice little accents above all the letters. Doesn't explort in flash correctly.   \n   \nAlso, in flash, i have several perfectly fine fonts displaying with random distorted triangles instead of spaces and one letter in DIN had a corner blown out clear across the screen.   \nIt's just a display bug - they exported correctly - but it's just another example of some nasty display problems.   \n   \n   \nOh, and Suitcase is apparently broken in Panther.   \nThey're aware of the issue and are working to correct it.   \nWhy they didn't iron this out BEFORE Panther was released, I don't know.   \n   \n//Drew\n\n"
    },
    {
      "time": " 28.Oct.2003 10.31am",
      "content": "Apparently you have to disable font book for any of the other font management software to work. The FontAgent web site has a [how to](http://web.archive.org/web/20080423012425/http:/www.insidersoftware.com/support/profaq.html).\n\n"
    },
    {
      "time": " 28.Oct.2003 12.01pm",
      "content": "Again from [MacInTouch](http://web.archive.org/web/20080423012425/http:/www.macintouch.com/panreader06.html) (confirming what Drew writes, above):   \n   \nThe following is from Extensis Tech Support. There is currently no information about this on their web site.   \n   \n Entered By: Support Rep @ Oct 27 2003 7:37AM   \n Greetings:   \n   \n Suitcase 10 is not compatible with Panther.   \n   \n Currently Suitcase X1 is not compatible with Mac OS X   \n 10.3 either. Both Extensis and Apple are aware of this   \n issue, and are currently working to resolve the   \n problem. I have no information as to when a patch to   \n resolve this will be available, although it should be   \n relatively soon. Please check the Extensis website for   \n any updates regarding Suitcase X1 and Mac OS X 10.3.\n\n"
    },
    {
      "time": " 28.Oct.2003 1.20pm",
      "content": "I really wonder why this happened? Just curious, because the Panther Beta is out since almost half a year now, enough time for compatibility issues. Looks like Extensis had a bit of a nap ;)\n\n"
    },
    {
      "time": " 28.Oct.2003 2.59pm",
      "content": "I'd be curious about what is it, exactly, that isn't working with suitcase. (lots of knocking on wood) Mine is working.\n\n"
    },
    {
      "time": " 28.Oct.2003 11.11pm",
      "content": "\\> Font Book is a disappointment for sure   \n   \nI didn't set my expectations too high, so I'm neither blown   \naway nor disappointed. This seems true to Apple's pattern.   \niTunes, Mail, iChat, iPhoto and Safari all started as fairly   \nbare bones, but stable, apps (except for Final Cut which was   \nsolid from the start). I'm going to give Font Book until   \nversion 2.0 to prove itself.   \n   \nThat said, I'm having fun seeing if I can make my OS work   \nwithout Suitcase. (It would save me a $120 upgrade to X11.)   \n   \nHaving used Font Book for three days now, the thing that I   \nlike least is that when 'adding' fonts, it copies them into a   \nuser/library/fonts directory (as with iTunes 'consolidate   \nlibrary' feature). This negates my anal organization of all my   \nfonts by foundry (but doesn't offer the robust organization/   \ncategorization of iTunes).   \n   \nIn the meantime, all Stephen's drum beating for FontAgent   \nmakes me wish I'd selected more carefully. (Maybe there's a   \ncompetitive upgrade?)\n\n"
    },
    {
      "time": " 28.Oct.2003 11.31pm",
      "content": "Drew, I've had the same font display issues in Flash MX. It   \nexports fine. I'm inclined to blame this bug on Macromedia   \nas this bug doesn't happen in any other app and the Flash UI   \nis notoriously sloppy with fonts in general.\n\n"
    },
    {
      "time": " 29.Oct.2003 12.44am",
      "content": "Suitcase X1 has a problem with Panther? Hmm... seems to work very nicely to me, haven't seen any nasty bugs yet. Can anybody tell what are the bugs there?\n\n"
    },
    {
      "time": " 29.Oct.2003 12.59am",
      "content": "Just a heads up - be sure to install Internet Explorer so you get Microsoft's web fonts (verdana, georgia), otherwise the web will look all a'mess. You can delete IE after if you'd like.   \n   \nMore info here:   \n [http://www.exuberance.com/notes/2003/panther-fonts.html](http://web.archive.org/web/20080423012425/http:/www.exuberance.com/notes/2003/panther-fonts.html)\n\n"
    },
    {
      "time": " 30.Oct.2003 5.11am",
      "content": "[Makers of FontAgent Pro respond to Font Book](http://web.archive.org/web/20080423012425/http:/maccentral.macworld.com/news/2003/07/24/fontagent/index.php?redirect=1067490358000)\n\n"
    },
    {
      "time": " 30.Oct.2003 5.47am",
      "content": "\"Suitcase 10 is not compatible with Panther. \" works flawlessly here - dragged across my network from my OSX 1-.2.7 G4 to my Panther dual G5.   \n   \nFTR Suitcase 10.2.1\n\n"
    },
    {
      "time": " 30.Oct.2003 6.32am",
      "content": "Tiffany, I did a 'dirty' install on my pre-Quicksilver G4 (dual 450s). I was running a shoddy upgrade of 9.2 (from 9.1.2) and had non-critical problems all over. I was too eager to upgrade Friday night, so I just ran the Panther installer right over top of the old OS. It works flawlessly.   \n   \nI had a problem once when it woke up stupid (after being asleep all night) and I lost fast user switching until I restarted, but that's been it. Everything came over fine.   \n   \nHowever, I'd like to add that I don't have a font manager (besides Font Book) yet, so I can't comment on how that goes.   \n   \nI'm very happy with Panther thus far. I work primarily with classic apps and they all work well (of course QX 4.1 still has redraw issues, like Jaguar). I have Jaguar on a much faster machine at work (quicksilver G4, dual 867s), and it runs comparably.\n\n"
    },
    {
      "time": " 30.Oct.2003 12.16pm",
      "content": "Some additional chattering about Font Book, Suitcase, Panther, et al. over on the [Adobe User Forums](http://web.archive.org/web/20080423012425/http:/www.adobeforums.com/cgi-bin/webx?50@235.mVujbaECA6i.1@.2ccdedd9).\n\n"
    },
    {
      "time": " 30.Oct.2003 3.04pm",
      "content": "I've upgraded to panther and I have had some serious font issues. All was well. Was using suitcase in Panther and I had no problems. Then I remembered one of the reasons I had upgraded. Fontbook! Tried it out. Thought it was nice, but I still prefered Suitcase. Then later, I wanted to play some more in Fontbook but forgot to quit Suitcase. That is when all hell broke loose.   \n   \nI'm still not certain what happened, but it seems that any of the fonts that I had in Fontbook became corrupted and Suitcase (and even Font Agent Pro) would balk at even the idea of using or adding them again into those apps.   \n   \nLuckily, after wipping my system clean to figure this out, I just pulled the fonts that were damaged from some duplicates off a fireewire drive that I have and all seems to be working in the land of Panther.   \n   \nJust thought I'd warn everyone to be VERY carefull about having Fontbook open with other font management apps.\n\n"
    },
    {
      "time": " 31.Oct.2003 12.52pm",
      "content": "One of my favorite features in Suitcase X1 (which I'm currently using) is the ability to preview multiple fonts at once. As far as I can tell (as the case has to be as I found no documentation the thing) Font Book can't do that.   \n   \nI disabled FontBook and things seem to be chugging along nicely with Panther despite Extensis' remarks that suitcase was not compatible and needed updating. Perhaps they were speaking of Suitcase 10.x and not X1.   \n   \nI did an \"upgrade\" install on my 17\" Powerbook. Panther runs like a dream. I also haven't experienced the issues with my firewire 800 drives that others are reporting... odd.   \n   \nTim\n\n"
    },
    {
      "time": " 1.Nov.2003 2.13am",
      "content": "WHOA WHOA WHOA   \nDAVE   \n   \nUNPLUG YOUR FIREWIRE DRIVE IMMEDIATELY   \n   \nThere are SERIOUS problems with external firewire drives in panther   \n   \npeople are losing ALL of their data on those drives   \n   \nInfo here: [Macintouch](http://web.archive.org/web/20080423012425/http:/www.macintouch.com/)\n\n"
    },
    {
      "time": " 1.Nov.2003 10.01am",
      "content": "\\>_There are SERIOUS problems with external firewire drives in panther_   \n   \nFair warning Drew, but let's be clear about this issue. It's a serious problem with specific FireWire 800 drives using the **Oxford 922 bridge chip-set with firmware version 1.02** as per Apple's [notice](http://web.archive.org/web/20080423012425/http:/www.apple.com/macosx/firewire800specialmessage.html). Many drive manufacturers have already released updates for their drives, [as listed](http://web.archive.org/web/20080423012425/http:/www.macintouch.com/#notesandtips) on the Macintouch page.\n\n"
    },
    {
      "time": " 2.Nov.2003 12.17pm",
      "content": "sorry   \noverreacted a little.   \n=)\n\n"
    },
    {
      "time": " 2.Nov.2003 1.39pm",
      "content": "\\>_sorry... overreacted a little._   \n   \nNo need to apologize Drew. When I first read the news, it was a bit of a heart-stopper to be sure.\n\n"
    },
    {
      "time": " 2.Nov.2003 2.44pm",
      "content": "Thanks for the concern Drew, but my firewire drive is unaffected by the panther bug. Guess it was good in this case to have an older FireWire 400 drive ![:-)](http://web.archive.org/web/20080423012425im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 20.Nov.2003 1.59pm",
      "content": "I just got my new iBook G4 with Panther. I hate Font Book. I am going to buy Suitcase XI if I can ever get a hold of their darn company.\n\n"
    },
    {
      "time": " 20.Nov.2003 2.12pm",
      "content": "Consider Font Agent Pro. I liked it before on my dual G4, but on my loverly new AlBook it's wunderbar. No problems with Panther as far as I can tell.\n\n"
    },
    {
      "time": " 20.Nov.2003 2.35pm",
      "content": "Meredith, other than the fact I can't use the fax software and the training CDs for the CS series don't work everything is fine with Panther. I also love your picture\n\n"
    },
    {
      "time": " 20.Nov.2003 4.48pm",
      "content": "Ya, I meant no problems with FAP & Panther. I'm having a few glitches, too. Mostly Eudora (5.2.1) is just painfully slow, but I'm afraid to go to 6 because some people have reported having whole mailboxes corrupted. I'm considering moving to Mail.app instead. What do the rest of y'all use for email in OS X? (Maybe this should a new thread.)   \n   \n\\> I also love your picture   \n   \nThanks -- I've always wanted to be moir\n\n"
    },
    {
      "time": " 21.Nov.2003 6.51am",
      "content": "I've been using Apple's Mail app for 2 years. I love it. The Panther upgrade adds support for Entourage (Microsoft Exchange) calendar items (vCal).   \n   \nJared recently switched from Eudora to Mail. Not sure why, other than Mail is free...\n\n"
    },
    {
      "time": " 10.Dec.2003 7.46pm",
      "content": "I'm getting the funky garbled characters tonight (running 10.3.1 with Suitcase X1). Just finished a lenghty international job using more languages than the Tower of Babel -- maybe that had something to do with it. Trying to troubleshoot now...\n\n"
    },
    {
      "time": " 11.Dec.2003 9.41am",
      "content": "We recently got the sweet Dual 2 G5 and were pumped about Font Book. Nothing but problems.   \n   \nI tried to drag and drop fonts into FB and then it all got messed up. I tried to resolve the issue with Suitcase X1. Suitcase found over 200 corrupted fonts, cool problem fixed, right? No. There are still 168 fonts that Suitcase shows as installed, but don't actually exist. I can't get rid of them. It was taking our computer 5 minutes at least to load Flash.   \n   \nBasically we have to reinstall Panther. I'm never opening FB again, and I think it's a joke that Apple released such a buggy program. Especially for a platform intended for designers. I've complained on Typotect enough, so I'm done.   \n   \nThanks for all of the above links, I can't wait to jump into them and find out the real deal.\n\n"
    }
  ]
}
