{
  "id": "18017",
  "title": "Cross-Platform Development Font Issues",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi,\n\nI’m currently working with a Flash developer who is using a PC. I am supplying him with Flash templates which I create on a Mac.\n\nI have supplied him with PC versions of the exact font I am using (even though he owns the font himself, I have made a version for PC using Fontographer, to try and ensure equivalence), but whenever he resupplies me with the completed file, the fonts all look completely different and have shifted position.\n\nThis isn’t the end of the world, it just involves a lot more work for me than I was originally expecting. However, we are about to begin work on a new Flash movie that requires a ’handwritten’ style typeface.\n\nCan anyone recommend a handwritten font that will work and look exactly the same on both platforms, without me having to reposition it every time?\n\nMany thanks...\n\n",
  "author": "<a href=\"/web/20100107130428/http://typophile.com/user/8866\" title=\"View user profile.\">JonPhillips</a>",
  "time": "<br>",
  "uid": "8866",
  "comments": [
    {
      "time": " 19.Feb.2006 6.48am",
      "content": "Flash may be a problem. As far as I know, Flash does not support OpenType fonts. With an OpenType font, you could use the same font file on a Mac and a PC. That would normally eliminate your issues.\n\nI can’t guarantee you that any same PC and Mac versions of a font will render exactly alike. But maybe I’m wrong.\n\n"
    },
    {
      "time": " 19.Feb.2006 6.58am",
      "content": "That’s a good call Dan - I hadn’t thought about whether Flash supports Open Type. I’ll post in a few of the Flash Forums to see if anyone can tell me more. If I get any joy, I’ll post back here in case anyone else ever has a similar problem.\n\nThanks for the reply.\n\n"
    },
    {
      "time": " 19.Feb.2006 7.06am",
      "content": "Actually it is possible that Flash offers the same basic support for OT fonts as Freehand MX. That is super limited, but here is its level of support (from [this page](http://web.archive.org/web/20100107130428/http:/www.linotype.com/9-9-9-14510/opentypeandapplicationsupport.html) on the Linotype website).\n\n**Freehand MX (Windows XP/Mac OS X)**  \n1. Only TrueType-flavored OpenType fonts (“TTF”) are supported. These function like traditional TrueType fonts\n\n2. No support for “CFF”-flavored OpenType fonts\n\n3. Only the first 255 characters of Latin Character Sets are supported\n\n4. No Unicode support, and therefore no capabilities beyond Latin 1 languages\n\n5. No support for OpenType Layout features\n\n"
    },
    {
      "time": " 19.Feb.2006 7.11am",
      "content": "Excellent. In this case, that limited support will probably be good enough. All I need to do now is post in the design forum to see if anyone can recommend a handwritten-style TrueType OpenType font...\n\nThanks again for your help.\n\n"
    },
    {
      "time": " 19.Feb.2006 11.50am",
      "content": "Flash and Freehand do not handle text in the same way at all.\n\nFlash has [supported Unicode](http://web.archive.org/web/20100107130428/http:/www.macromedia.com/support/flash/languages/unicode_in_flmx/) since player 6.\n\nI’m pretty sure flash supports both flavours of opentype font, but does not support opentype features (flash throws away a lot of font info when it embeds the font).\n\n"
    },
    {
      "time": " 19.Feb.2006 11.59am",
      "content": "Can Flash support more than the first 255 glyphs in a character set?\n\n"
    },
    {
      "time": " 19.Feb.2006 3.01pm",
      "content": "Yes. You can choose to embed several sub sets up to 39477 glyphs.\n\n"
    }
  ]
}
