{
  "id": "18036",
  "title": "ES811 for critique",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "This is my first post so go easy.\n\nAttached is a PDF of ES811 Light which I've been developing on and off for about 2 years. I'd really like to hear any constructive comments you may have regarding it's design.\n\nCheers!\n\nTokyodrifter\n\n| Attachment | Size |\n| --- | --- |\n| [ES811 Light.pdf](http://web.archive.org/web/20150123112031/http:/typophile.com/files/ES811%20Light_1.pdf) | 482.34 KB |\n\n",
  "author": "David Lawless",
  "time": "20 Feb 2006 — 4:22am",
  "uid": "8282",
  "comments": [
    {
      "time": "20 Feb 2006 — 5:06am",
      "content": "You have a round . for :!?äëïöüÿ, and a weak . for i, j.\n\n"
    },
    {
      "time": "20 Feb 2006 — 6:36am",
      "content": "Many thanks for that Alessandro. Do you suggest that I make the . i , j stronger?\n\nBest wishes,\n\nTokyodrifter\n\n"
    },
    {
      "time": "20 Feb 2006 — 7:21am",
      "content": "I have to say that it's rather nice – however it does appear to look remarkably similar to [Etelka Light Pro](http://web.archive.org/web/20150123112031/http:/www.myfonts.com/fonts/storm/etelka/).\n\nPerhaps you could try making some of the characters a little more distinctive to gain better differentiation between the two faces?\n\n"
    },
    {
      "time": "20 Feb 2006 — 7:35am",
      "content": "Keep consistency, punctuation marks are not structurals but they give a swerve to the face, say they are more functional. Make them (i, j) stronger and consistent. Design your ligatures fi, fl when you have done with the metrics.\n\n"
    },
    {
      "time": "20 Feb 2006 — 7:40am",
      "content": "Thanks for your comments Jon. I'd have to disagree though, they're nothing like each other.\n\n"
    },
    {
      "time": "20 Feb 2006 — 7:42am",
      "content": "Many thanks Alessandro. Very useful comments!\n\n"
    },
    {
      "time": "20 Feb 2006 — 8:05am",
      "content": " ![](http://web.archive.org/web/20150123112031im_/http:/typophile.com/files/etelka.jpg)\n  \nNothing like each other? \n\nAs I said earlier, they do have a \\*similar\\* look and feel – although this is not intended to imply there is any plagiarism at work and I apologise if I have caused any offence.\n\nDon't forget, I did also say I rather like it ;-)\n\n"
    },
    {
      "time": "20 Feb 2006 — 8:19am",
      "content": "No problem Jon. I did ask for constructive comments though on how to make the design better, not what other typefaces it has a similar feel to. I've been working on this typeface a long time so maybe i'm a little too protective of it. Sorry if I snapped.\n\nAll the best,\n\nTokyodrifter\n\n"
    },
    {
      "time": "20 Feb 2006 — 8:31am",
      "content": "No problem, I know what it's like when you've spent 2 years working on something and some smarta$$ comes along with what might appear to be a cheap shot – apologies for any insensitivity. I'll have a closer look and see if there's any constructive recommendations I can make.\n\n"
    },
    {
      "time": "20 Feb 2006 — 8:48am",
      "content": "This is a good start, but some of your curves are letting you down, espcially the top bout of the a, the tail of the g, the c and e, and the s, which looks like it's falling over to the left. The uppercase has fewer such issues, and C and G are pretty good, but the J needs help, and the S also looks like it's falling over.\n\nAs has been pointed out, the dots should be consistent, and if you do go with squares, they should be @20% larger, otherwise they look too small.\n\nThe æ shouldn't have a the stick up its butt.\n\nThe top diagonal of the k is a little too far to the right.\n\nThe two components of the m should be a little bit narrower. It needn't be a lot.\n\nThe accents don't match terribly well; they are a little thin, and taper a little too much; they should match the design of the font. The cedilla looks like it's from a completely different font.\n\nYou might want to look at the way many people design w; in my opinion, the outside strokes should be brought in at the top. (It's a little hard to explain, but have a look at this:\n\n ![](http://web.archive.org/web/20150123112031im_/http:/typophile.com/files/GalPol_w.png)\n\nSee what I mean?\n\nYou have done a good job making sure that the places where your strokes intercept don't get too thick, which is a hard trick to learn. On the whole, I think this is pretty solid work. Not amazingly original, but it has potential and will serve you well.\n\n"
    },
    {
      "time": "20 Feb 2006 — 9:22am",
      "content": "Hi Chester,\n\nThat's great! I'll get to work.\n\nBest wishes,\n\nTokyo\n\n"
    }
  ]
}
