{
  "id": "18040",
  "title": "New Coke Logo",
  "forum": "Design",
  "tags": [

  ],
  "content": "Ha! Got you didn’t I?\n\nCoke now has a droplet logo for [The Coca Cola Company](http://web.archive.org/web/20090702064517/http:/www2.coca-cola.com/makeeverydropcount/index.html), along with the tagline, “Make every drop count.” This is apparently in a move to differentiate Coke, the soft-drink, from Coke the company which “now provides nearly 400 products in over 200 countries.”\n\nI first read it at [Be A Design Group](http://web.archive.org/web/20090702064517/http:/www.beadesigngroup.com/blog/archives/2006/02/the_new_coke_identity.html#more).\n\nWell, it’s almost as bad as the New Coke. Seems like most people (currently 3) don’t like it.\n\nI always say, [be careful what you ask for](http://web.archive.org/web/20090702064517/http:/typophile.com/node/252).\n\n",
  "author": "<a href=\"/web/20090702064517/http://typophile.com/user/7022\" title=\"View user profile.\">karenhuang</a>",
  "time": "<br>",
  "uid": "7022",
  "comments": [
    {
      "time": " 20.Feb.2006 8.30am",
      "content": "Marketing gone mad…  \nSuddenly I feel like a drip.  \npeace\n\n"
    },
    {
      "time": " 20.Feb.2006 8.52am",
      "content": "I wish they would “Just drop it”\n\nChrisL\n\n"
    },
    {
      "time": " 20.Feb.2006 9.14am",
      "content": "Reminds me of Folgers - good to the last drop. Sorry Coke, but I don’t think people really care about Coca-Cola - “The Company.” Make good stuff to drink and people will buy it.\n\n"
    },
    {
      "time": " 20.Feb.2006 9.16am",
      "content": "Haha.\n\nI would’ve dropped the droplets. Seeing how awkward they look next to the original script. That script has been around since (when?), and the droplets just look so cold next to the script.\n\n"
    },
    {
      "time": " 20.Feb.2006 10.02am",
      "content": "Reminds me of Dave Chappelle doing R. Kelley, “Drip, Drip, Drip”.\n\n"
    },
    {
      "time": " 20.Feb.2006 10.48am",
      "content": "SQUEEZE IT DRY BABY!!!!!! DON’T WASTE A DROP!!!!! A DROP IN TIME SAVES NINE!!!! A DROP IN THE GLASS IS WORTH TWO IN THE BOTTLE!!! DON’T DROP THE BALL!!!!!\n\n"
    },
    {
      "time": " 20.Feb.2006 10.51am",
      "content": "DRIP ’TIL YOU SLIP :-)\n\nChrisL\n\n"
    },
    {
      "time": " 20.Feb.2006 11.32am",
      "content": "As the commentator says in your link, the drops look a bit awkward with the script logo. But in themselves I think are a success, and very flexible for use in different graphic situations. Compared to the horrors like the AT&T redesign this is very good, even if it has some problems.\n\n"
    },
    {
      "time": " 20.Feb.2006 11.34am",
      "content": "Looks like The Coca Cola Gompany, and beats you over (and over) the head with the tagline’s (un)wittiness.\n\nThis is a lesson by example to every designer of what not to do: choose the first and most obvious path available. I concur with Paul—marketing is a truly scary thing.\n\n"
    },
    {
      "time": " 20.Feb.2006 12.45pm",
      "content": "”...But in themselves I think are a success, and very flexible for use in different graphic situations. “\n\nSo flexible that they can be used and confused by anyone with a liquid product. This is truly clip-art design of the worst kind.  \nIt was done much better by Calgon years ago in their water softener packaging.\n\nChrisL\n\n"
    },
    {
      "time": " 20.Feb.2006 1.25pm",
      "content": "\\>clip-art design of the worst kind\n\nOk the more I look at it the worse it looks with the script. But a lot of the problem is the script itself with both the logo with two baselines—which looks great on its own—but then the ’The’ and ’Company’ aligning with only ’Cola’ making the thing unbalanced. And then the sans at the bottom plus the logo. It is just over over-done and busy.\n\nBut it other contexts I don’t see the drops as bad. ’The obvious is better than the obvious avoidance of the obvious.’ Of course it is much better if it looks fresh but natural and logical and simple. But I don’t think the idea of multi-colored drops is so bad, just the execution with the logo.\n\n"
    },
    {
      "time": " 20.Feb.2006 1.49pm",
      "content": "It seems that the people at Coke had this conversation: Hey AT&T can go really ugly so why not top them with a forced look. Lets see how many unrelated elements we can tie together.\n\n"
    },
    {
      "time": " 20.Feb.2006 2.40pm",
      "content": "I figured this started with Target’s use of their logo-as-pattern: now everybody wants one. Of course Target’s wallpaper idea is only the most prominent example of a lower-profile design trend of having grids of little dots everywhere.\n\n"
    },
    {
      "time": " 20.Feb.2006 3.50pm",
      "content": "so is this just a campaign, or is this mark going to eventually replace the script? it doesn’t seem like a full fledged “at&t” style re-brand… i don’t get it!\n\nis this another Interbrand hackjob or what??\n\n——————  \nnc\n\n"
    },
    {
      "time": " 20.Feb.2006 3.52pm",
      "content": "I think the drip symbol would suite a ’water company’ better.\n\n[http://images.google.com/images?q=water+logo&btnG=Search&svnum=10&hl=en&...](http://web.archive.org/web/20090702064517/http:/images.google.com/images?q=water+logo&btnG=Search&svnum=10&hl=en&lr= \"http://images.google.com/images?q=water+logo&btnG=Search&svnum=10&hl=en&lr=\")\n\n"
    },
    {
      "time": " 20.Feb.2006 5.36pm",
      "content": "Oh gods. It looks like a Microsoft Windows logo. This will all end in teardrops.\n\n"
    },
    {
      "time": " 21.Feb.2006 12.33am",
      "content": "\\> ‘The obvious is better than the obvious avoidance of the obvious.’  \nMaybe true, but nothing should have to be so obvious.\n\nTo me this logo is particularly bad because of it’s lack of subtlety. To paraphrase pica\\_pusher, it hits you over the head with a number of things:  \n1. That the Coke company is not Coke the drink (look how different we are!)  \n2. That the Coke company is still strongly tied to Coke the drink (see! we’re keeping the script!)  \n3. That the Coke company makes many many different types of drinks (can we have about 400 droplets? No? How about five?)\n\n\\> But I don’t think the idea of multi-colored drops is so bad, just the execution with the logo.  \nI think it’s a lame idea made worse by insensitive execution.\n\nI don’t know why but I can hear the client asking for all sorts of things when I look at the logo.\n\n"
    },
    {
      "time": " 21.Feb.2006 3.37am",
      "content": "Coca-Cola _are_ [a water company](http://web.archive.org/web/20090702064517/http:/news.bbc.co.uk/1/hi/uk/3523303.stm)  \nTim\n\n"
    },
    {
      "time": " 21.Feb.2006 4.18am",
      "content": "“This is truly clip-art design of the worst kind”.\n\nI definitely agree. Even without understanding the strategic reasons for this rebrand/campaign/whatever it is, the message ’in everything we do, we give up drops of ourselves’ is trite at best, and downright unappetizing at worst. There’s something vaguely unappealing about linking a soft drink with the bodily fluids of wonderfully diverse ethnic groups enjoying themselves on a beach.\n\nThe solid drops - quite apart from being badly drawn and composed - do nothing to suggest refreshment and the thirst quenching properties that you come to expect from fizzy pop. I don’t think I’ll be able to buy a Coke now without wondering exactly how much blood, sweat and tears (and worse) has gone into it.\n\n"
    },
    {
      "time": " 21.Feb.2006 8.08pm",
      "content": "I agree, I immediately thought “blood drive”.  \nIf people can refer to a color as (brand name)-color then DON’T MESS WITH THE COLOR. I do like bright colors - Kinko’s/Fed-Ex is beautiful, BP is great, but you have to know what you’re doing. This just comes off patchy and the primary colors make it look childish.\n\n"
    },
    {
      "time": " 22.Feb.2006 11.50pm",
      "content": "... This is sort of a shame, in my eyes it really doesn’t work and I agree this is work of a marketeer.\n\nI read an articel about how the Coca Cola Company is introducing a new type of bottle and bottlesystem (atleast here in holland) and I was verry impressed by it and how they take the lead in that market.\n\nBut when I see this new absurd addition to the oh so cool typographic logo I wonder what went wrong here, okey there is a story behind it, but it comes off very very cheap.\n\nI give it a year or two and then it has died a lonely and silent death... I hope\n\n"
    },
    {
      "time": " 23.Feb.2006 11.17am",
      "content": "I agree that it won’t last that long, as this look is way too trendy and won’t last long enough to establish itself as strong mark. Check out the bahamas mess of rainbow colorful shapes [http://www.bahamas.com/bahamas/index.aspx](http://web.archive.org/web/20090702064517/http:/www.bahamas.com/bahamas/index.aspx \"http://www.bahamas.com/bahamas/index.aspx\"), it kinda works for them, but for coke?.\n\n"
    },
    {
      "time": " 23.Feb.2006 1.15pm",
      "content": "Way to beat the dumb DRIP consumers over the head, Coke!\n\n"
    },
    {
      "time": " 23.Feb.2006 1.34pm",
      "content": "I’ve always \\*loved\\* the Bahamas logo. I can only wonder how much it costs to run, though. I heard that those are all spot colors. But that could have been just a rumor.\n\nBut regarding the new Coke logo: I hope it stays in the temp webpage that it’s at right now, and then gets canned. They have developed untold-of amounts of equity because of their amazing branding. The last thing I could think they’d want to do is a re-creation of the “New Coke” fiasco they did.\n\nHowever, this could be a re-situating themselves at a corporate level which may never touch their branding strategy on a end-user level.\n\nWe’ll just have to wait and see.\n\n"
    },
    {
      "time": " 23.Feb.2006 2.12pm",
      "content": "Leah,  \nWhy the Girl Scout logo as your avatar?\n\nChrisL\n\n"
    },
    {
      "time": " 23.Feb.2006 2.23pm",
      "content": "<cite>Why the Girl Scout logo as your avatar?</cite>\n\nWhy not, Chris? They’re so freakin’ delcious...especially the Caramel DeLites! I could eat a whole box of those. :-D\n\n"
    },
    {
      "time": " 23.Feb.2006 2.56pm",
      "content": "That’s the way the cookie crumbles David :-)\n\nChrisL\n\n"
    },
    {
      "time": " 23.Feb.2006 4.34pm",
      "content": "That’s right David Bailey, it’s because I’m SO FREAKIN’ DELICIOIUS! How did you know?\n\n"
    },
    {
      "time": " 23.Feb.2006 4.41pm",
      "content": "Leah, I had a quick look at your work and realised I have one of the books, Weirdo Deluxe. ;)\n\nNice work by the way.\n\n"
    },
    {
      "time": " 23.Feb.2006 4.50pm",
      "content": "A company synonymous with it’s flagship product is a tough branding job. I don’t envy the people that had to do this work because it’s like messing with the cave paintings at Lascaux, you just don’t do it.\n\nCoca Cola the company vs. Coca Cola the drink... it’s the same problem Word Perfect had, and Saturn when they first got started.\n\nPS — Do we need a demerit system for people who make puns in these forums. There are more puns in here than there are ideas. =P\n\n"
    },
    {
      "time": " 23.Feb.2006 5.24pm",
      "content": "Finally.  \nThank you Joe.  \nI worked on the Make Every Drop Count campaign. Didn’t do the logo, but worked on the project.  \nThis is a first for The Coca-Cola Company. One for the history books.\n\n~  \nTheodore Rosendorf  \n [http://rosendorf.us](http://web.archive.org/web/20090702064517/http:/rosendorf.us/ \"http://rosendorf.us\")\n\n"
    },
    {
      "time": " 23.Feb.2006 5.56pm",
      "content": "“Do we need a demerit system for people who make puns in these forums.”\n\nThe thought has merit :-)\n\nChrisL\n\n"
    },
    {
      "time": " 23.Feb.2006 11.50pm",
      "content": "I went to a little brunch and low and behold look what i found on the paper cups!\n\n ![](http://web.archive.org/web/20090702064517im_/http:/typophile.com/files/Image060.jpg)\n  \nit is actually nice on a paper cup. I wonder if they had these cups at their marketing brainstrumming sessions?\n"
    },
    {
      "time": " 23.Feb.2006 11.58pm",
      "content": "I went to Ikea and look what I found!  \nThey use the coca cola logo for their sinks.  \nThey better watch out - they may have a law suit coming.\n\nQUESTION:  \ndo the coke drops look like beverage drops or more like tear drops?\n\n ![](http://web.archive.org/web/20090702064517im_/http:/typophile.com/files/Image059.jpg)\n\n"
    },
    {
      "time": " 24.Feb.2006 8.14am",
      "content": "More than anything what bugs me about this is the vapid new age copy:  \nDrops to Inspire You?  \nOuch. But I guess they had to make a decision on what one would find least offensive, the copy or the new logo…  \nThis has all the hallmarks of a new CEOs hubris. Is there a new headmaster in town?  \npeace\n\n"
    },
    {
      "time": " 24.Feb.2006 9.55am",
      "content": "“This has all the hallmarks of a new CEOs hubris.”\n\nOr an old advertising VP who has his butt on the line for doing nothing :-)\n\nChrisL\n\n"
    },
    {
      "time": " 24.Feb.2006 7.30pm",
      "content": "What do you get when you cross PT Barnum with Dr. Phil?  \nA person that thinks you’re so stupid you need help.  \nCynical Optimism  \nthe new marketing…  \nMaybe they discovered a stash of the original formula.  \npeace\n\n"
    },
    {
      "time": " 26.Feb.2006 10.28am",
      "content": "Theodore - you said you worked on the project; can you shed any light on the development of this thing or are you bound by NDAs from here to kingdome come?\n\nI’d be interested to hear your thoughts on the results too.\n\n"
    },
    {
      "time": " 26.Feb.2006 11.33am",
      "content": "I would like to apologize for my last post. This is a design board and I don’t have a big problem with the design (although it seems like too many ideas to create something cohesive). My problem is with the campaign tone, but that is another story…  \npeace\n\n"
    },
    {
      "time": " 5.Mar.2006 8.17pm",
      "content": "pica pusher - I apologize for the late reply. Can this site send out notifications?\n\nAnyway, I am bound by NDAs, though I’m not sure what is and what isn’t public knowledge at this point. I know that Coke isn’t commenting to the media and the agencies that did the work aren’t allowed to comment. The media’s asking - no one’s talking.\n\nI can say that the current verison of the logo is much better than what it initially was when work the on campaign begun. It was tightened up a bit. You may be interested to know who did and reworked the logo. I’ll find out if I can say.\n\nSorry to be so cryptic...\n\n"
    },
    {
      "time": " 6.Mar.2006 11.31am",
      "content": "my boss recently told me that “you can’t get chicken soup from chicken poop.”\n\nthis must have been an incredibly tough project, and I respect anyone who would be expected to make the new “drip” logo work.\n\nregardless, i don’t think it’s working yet.\n\n——————  \nnc\n\n"
    },
    {
      "time": " 14.Mar.2006 12.31pm",
      "content": "Yeah, how can we get notified when someone posts to a thread?\n\nRosendorf, can you say which agency did the logo yet?\n\n"
    },
    {
      "time": " 15.Mar.2006 1.44am",
      "content": "Karen,  \nI check the My Topics button in the forums window, that shows which thread has a new post that you have already contributed to (or started).  \nTim\n\n"
    },
    {
      "time": " 15.Mar.2006 9.03am",
      "content": "bought this with a Ruby a few weeks ago in Brixton South London. And it had a pull tab!!! Either very old or they still sell pull tab cans in the Arab speaking part of the world.\n\n ![](http://web.archive.org/web/20090702064517im_/http:/typophile.com/files/coke640.jpg)\n\n"
    },
    {
      "time": " 24.Mar.2006 4.47pm",
      "content": "Can someone who speaks Arabic confirm whether that Coke logo looks totally amateurish? The line quality reminds me uncomfortably of drawing with a mouse and Illustrator’s brush tool, not to mention the two arrowheads on the bottommost character...\n\nAnyway Theodore: Sorry to hear that it’s all hushed up. I’m still interested in the motivations behind this project.\n\n"
    },
    {
      "time": " 4.Apr.2006 10.44pm",
      "content": "Can you guys believe I’m still trying to get a definitive answer? I’m sure you guys will find out before I can see if I can talk. Ugh...\n\n~  \nTheodore Rosendorf  \n [http://rosendorf.us](http://web.archive.org/web/20090702064517/http:/rosendorf.us/ \"http://rosendorf.us\")\n\n"
    },
    {
      "time": " 10.Apr.2006 12.39am",
      "content": "\\> it’s like messing with the cave paintings at Lascaux\n\nEasy easy, generationext.\n\nWhen it comes to Coke and rock painting, here’s what might come to  \nmind instead: [http://news.bbc.co.uk/2/hi/south\\_asia/2263917.stm](http://web.archive.org/web/20090702064517/http:/news.bbc.co.uk/2/hi/south_asia/2263917.stm \"http://news.bbc.co.uk/2/hi/south\\_asia/2263917.stm\")\n\n\\> Can someone who speaks Arabic confirm  \n\\> whether that Coke logo looks totally amateurish?\n\nActually it looks fine (although the connections of the “waw”s, the looped  \nmiddle letters, to the following letters is “incorrect”). Not great, but fine.  \nAnd it’s nicely not Latinized. Although the Arabic 7-Up logo whips it bad.\n\nBTW, pull-tabs are a man’s tabs. They provide for a unique and... handy test of one’s manual dexterity and power that the pansy swivel/push-tab does not: try opening a pull-tab can with one hand without resting the can on anything. And what to do with the tab? A man’s man removes it completely and dumps it in through the hole, before starting to drink the beverage of course. And don’t forget, all with one motion, with the can in the air the whole time. Shoo abadaï.\n\nhhp\n\n"
    },
    {
      "time": " 10.Apr.2006 5.50pm",
      "content": "Whoa, Hrant spikes the ball, jeez... why do I even bother to post :(\n\n"
    },
    {
      "time": " 11.Apr.2006 9.11am",
      "content": "... and then the man’s man climbs into his Hummer and drives down all the poor little cars on the road.\n\n=^P\n\n"
    },
    {
      "time": " 11.Apr.2006 9.21am",
      "content": "Actually, the man’s man drives (using the term loosely) an early-80s BMW 733, metallic green, with velvet drapes in the rear window. And multiple bullet holes. From an AK-47. On the left side.\n\nhhp\n\n"
    },
    {
      "time": " 11.Apr.2006 9.25am",
      "content": "=^P ehehe. Ok. Well I don’t have the correct chromosome to take this any further.\n\n"
    },
    {
      "time": " 11.Apr.2006 9.50am",
      "content": "Hrant - Don’t forget the aftershave…\n\npeace\n\n"
    },
    {
      "time": " 11.Apr.2006 11.49am",
      "content": "Well some want to be a [man’s man or a ladies’ man](http://web.archive.org/web/20090702064517/http:/www.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve&db=PubMed&list_uids=6473574&dopt=Abstract). And some try to be a [mentsh](http://web.archive.org/web/20090702064517/http:/www.mentsh.com/).\n\n"
    },
    {
      "time": " 11.Apr.2006 12.31pm",
      "content": "At least no man is an island :-)\n\nChrisL\n\n"
    },
    {
      "time": " 12.Jul.2006 3.17pm",
      "content": "Probably a dead thread by now.  \nPentagram fixed it, and a good job too, but still not sure about the original designer(s)...\n\nAny one know who did the original?\n\n~  \nTheodore Rosendorf  \n [http://rosendorf.us](http://web.archive.org/web/20090702064517/http:/rosendorf.us/ \"http://rosendorf.us\")\n\n"
    }
  ]
}
