{
  "id": "1805",
  "title": "Need a type-related domain name?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have two type-related domain names that expire on November 2nd. I've decided not to renew them this time around and I'm wondering if anyone may be interested in taking them over. I'm not looking at selling them, just finding them new homes. There's currently next to no traffic hitting the domains, as they have been simply sitting as placeholders for a past several years.   \n   \n [typopolis.com](http://web.archive.org/web/20050518123125/http:/www.typopolis.com/)   \n [fontopolis.com](http://web.archive.org/web/20050518123125/http:/www.fontopolis.com/)   \n   \nThey are registered at [Dotster](http://web.archive.org/web/20050518123125/http:/www.dotster.com/) and I can easily transfer them directly into another Dotster account. The new account holder can then renew them as they see fit.   \n   \nSend me a message if you're interested.   \n   \nGrant\n\n",
  "author": "grant",
  "time": "Sat, 2003-10-25 09:32",
  "uid": "1011",
  "comments": [
    {
      "time": " Sat, 2003-10-25 11:03",
      "content": "Grant, I love the word \"bullshitless\" (from your blog, following the link from typopolis.com). That's what I was trying to say about Tim Cole in the AIGA thread. Now I'll have to steal that word. Thanks.\n\n"
    },
    {
      "time": " Sat, 2003-10-25 11:39",
      "content": "There is a german site named typopolis ( .de ),   \nmaybe they would be interested in the .com too.?\n\n"
    },
    {
      "time": " Sat, 2003-10-25 13:16",
      "content": "\\>_Now I'll have to steal that word._   \n   \nPlease do. Spread the love.   \n   \n\\>_There is a german site named typopolis ( .de )_  \n\\>_maybe they would be interested in the .com too.?_   \n   \nI'll drop them an email. You never know. Thanks for the pointer, David.\n\n"
    },
    {
      "time": " Mon, 2003-10-27 08:34",
      "content": "I had a type domain which I was considering using to set up online payment processing and order fulfillment specifically targetted at small foundries (before myfonts came along and took over the world). However, I never got round to it and the domain expired... its still available should someone want to use it:   \n   \nbuythefont.com\n\n"
    }
  ]
}
