{
  "id": "18054",
  "title": "Monitor Calibration",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hey does anyone have an effective way to calibrate an LCD monitor. I’ve noticed my colors are really off. Any suggestions would be helpful. Thanks\n\n",
  "author": "<a href=\"user/6496\" title=\"View user profile.\">Asvetic</a>",
  "time": "<br>",
  "uid": "6496",
  "comments": [
    {
      "time": " 20 February, 2006 - 4:27pm",
      "content": "Try a [Spyder](http://web.archive.org/web/20060525031724/http:/www.colorvision.com/) - you don’t have to check every week like with a CRT but once every full moon is still a good idea.\n\n"
    },
    {
      "time": " 20 February, 2006 - 4:40pm",
      "content": "_Anything_ you use to calibrate a monitor is only going to be about 66% effective, because greens and oranges simply don’t translate well from RGB to CMYK.\n\n"
    },
    {
      "time": " 20 February, 2006 - 5:11pm",
      "content": "Spyder works well for me. Don’t do correction in CMYK and use the proper transforms.\n\n"
    },
    {
      "time": " 20 February, 2006 - 5:15pm",
      "content": "I guess if you’re doing webdesign then this is pretty important but for print shouldn’t you judge colors by print proofs and use swatch books to pick your colors in the first place? I was going to post something like what oldnick said, but he beat me to it. What’s the point of paying all this money to make sure your colors are ‘right’ on screen when they’re not really correct at all?\n\n"
    },
    {
      "time": " 20 February, 2006 - 8:49pm",
      "content": "Well there hasn’t to be a “free” way to calibrate my monitor. I’m only concerned with screen colors for web design not print design. I might not have clarified that in my initial query, sorry.\n\nThanks for the feedback so far guys!\n\n"
    },
    {
      "time": " 20 February, 2006 - 8:51pm",
      "content": "For web design then! I was just asking in general if people bothered to spend money doing this if they’re only doing print design. :-)\n\n"
    },
    {
      "time": " 21 February, 2006 - 4:42am",
      "content": "I can’t make any claims for this product, not having used it, although I have read positive reviews.  \n [http://www.pantone.com/products/products.asp?idArea=2&idProduct=103](http://web.archive.org/web/20060525031724/http:/www.pantone.com/products/products.asp?idArea=2&idProduct=103)\n\nTim\n\n"
    },
    {
      "time": " 21 February, 2006 - 6:47am",
      "content": "Jupiterboy, can you clarify your recommendations? My biggest weakness right now is color and related issues and I’m always interested in tips.\n\n"
    },
    {
      "time": " 21 February, 2006 - 7:43am",
      "content": "Oh I think I found something : [  \nOptimising your monitor for Web design](http://web.archive.org/web/20060525031724/http:/www.wpdfd.com/wpdpal4.htm)\n\n"
    },
    {
      "time": " 21 February, 2006 - 8:19am",
      "content": "I could be wrong but I’m not sure if there’s such a thing as calibrating your monitor for WEB design other than ensuring your monitor is displaying the broadest range of colours by correctly setting brightness/contrast and gamma levels.\n\nThis can be done with the Display Calibrator Assistant (OS X) or the software enclosed with your monitor. As for the preset ICC profiles, I’ve never had much luck with them.\n\nAnother thing to consider is the fact PC and Macs display on-screen colours differently by default. Mac’s use a brightness gamma of 1.8 while PC’s are usually darker at 2.0 or 2.2. Keep this in mind as the colour that appears on your monitor will not appear the same on all monitors.\n\nFor web design, use sRGB colour space! You know that already. :)\n\nHowever I work predominantly in print so I use [Spyder](http://web.archive.org/web/20060525031724/http:/www.colorvision.com/profis/profis_view.jsp?id=101) to ensure my monitor colours represent Pantone colours as accurately as possible.\n\nHope this helps.\n\n"
    },
    {
      "time": " 21 February, 2006 - 11:20am",
      "content": "I am aware that not all monitors display colors the same. I’m just trying to get mine to display them as accurately as possible for the many out there that do have their monitors calibrated properly. Plus, when I select a yellow, I want to see yellow on my screen…\n\nI thought there was an easy way to do this calibration. A wizard application that you can use to set up your monitor based on an optimizing of the Brightness/Contrast and Gamma to set up a personal monitor profile. If I recall right MACs have this wizard built in, but PCs do not. That’s why this is such a challenge for me. I’m not looking to spend a fortune or even really anything if possible.\n\nI appreciate the recommendation of the Spyder, but that’s not going to solve my problem. The link I posted earlier only gave me a starting point but no real definition as to what I’d need to do to calibrate for web optimized colors or the like.\n\nI still feel lost.\n\n"
    },
    {
      "time": " 21 February, 2006 - 12:46pm",
      "content": "Ok. By using the Spyder to create a monitor specific profile, I can cause all my apps to display the images using the custom profile. Note, this isn’t converting the image. I have a third party RIP that also has good profiles so I’m able to A.) fix color casts in photography and B.) give a color correct proof from my own system.\n\nThis allows me to get good results with marginal quality digital photos that come from different sources, and screen correct them so they match. By giving accurate color proofs myself I can show a client what they should expect, and keep the approval process on press more streamlined.\n\nMore detail?\n\nClearly on high-end work I let the press do seps from transparency, but on the low-end I can still keep some degree of control and get good results.\n\nAnother non-Spyder option.  \n [http://www.gretagmacbeth.com/regionchooser?trgturl=http%3A//www.gretagmacbeth.com/index.htm](http://web.archive.org/web/20060525031724/http:/www.gretagmacbeth.com/regionchooser?trgturl=http%3A//www.gretagmacbeth.com/index.htm)?\n\n"
    },
    {
      "time": " 21 February, 2006 - 1:39pm",
      "content": "Andrew,\n\nAdobe Photoshop comes with a simple monitor calibration program, but it’s kind of hidden away.\n\nOn the PC you can find it under:  \n`Program Files\\Common Files\\Adobe\\Calibration`\n\n"
    },
    {
      "time": " 21 February, 2006 - 6:07pm",
      "content": "Or in the Control Panel, click on the Adobe Gamma icon, however if your monitor came bundled with some basic calibration software, give them a go.\n\n"
    },
    {
      "time": " 21 February, 2006 - 6:54pm",
      "content": "Color profiles and the ICC have really been a subject of much dispute ever since the notion of a “streamlined workflow” came about. I work at a large print shop as a pre-press operator, and I prepare files for our offset presses, both being Komori Lithrone 40 models, one six color, and the other eight. All of our equipment is no calibrated, lol. Do not ask me why, but it just is not. It seems that even when things are calibrated correctly, human factors take over, and it all has to do with what the customer wants. Regardless of wether the monitors are calibrated to the press, or the proofing systems, if at the time of press check, the customer is not happy, it will be adjusted on press, or worse yet, re-platted. Most all the files that we get, go through numerous phases of retouching, proofing, and re-proofing. Nothing is ever right, until the client says it is, no matter if the print matches whats on the screen.\n\n"
    }
  ]
}
