{
  "id": "18053",
  "title": "IT company logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Please comment to this logo designed for a very high-tech IT firm.\n\n| Attachment | Size |\n| --- | --- |\n| [netait\\_logo.jpg](http://web.archive.org/web/20070810002523/http:/typophile.com/files/netait_logo_0.jpg) | 10.52 KB |\n\n [‹ Celerus Logo](http://web.archive.org/web/20070810002523/http:/typophile.com/node/17548 \"Go to previous forum topic\") [Arty-farty logo ›](http://web.archive.org/web/20070810002523/http:/typophile.com/node/18013 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070810002523/http://typophile.com/user/4636\" title=\"View user profile.\">zileybee</a>",
  "time": "<br>",
  "uid": "4636",
  "comments": [
    {
      "time": " 20.Feb.2006 1.48pm",
      "content": "I see the face, and I see the figure with its pointy arm raised. But I have no idea what the significance of either might be.\n\nStill, it’s cool-looking.\n\n—Jim K.\n\n"
    },
    {
      "time": " 20.Feb.2006 2.02pm",
      "content": "Go away from the computer and start over again. Its just poor, it doesn’t say High Tech or IT. Its just being cleaver for cleaver’s sake. Make a logo clearly communicate what the business is all about as much as you can and have a positioning line to reinforce the new mark. Don’t be cute be blunt. Dan\n\n"
    },
    {
      "time": " 20.Feb.2006 2.23pm",
      "content": "You have 2 different ideas happening here. I like the profile, and I like the idea of personalizing an IT firm (since they all tend to have swooshes, globes, and digital looking things flying around in their logos), but as Dan said, try to communicate what the business is about, what sets them apart? Is it personal service? Experience? What is their specialty. Of course, a logo should IDENTIFY and not EXPLAIN, so you don’t need to depict an example of their service, but the SPIRIT of the company. If a figure/person is a core idea to who they are then choose either the profile, or a figure and work with it, but right now it isn’t working. Best of luck.\n\n"
    }
  ]
}
