{
  "id": "18055",
  "title": "Where to buy SerifedSans or 30 David Carson Fonts Collection",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hello\n\nI'm looking to purchase the SerifedSans font or the whole collection \"30 David Carson Fonts\". Unfortunately I can't find any place to buy them. Can anyone help?\n\nBest regards, Andreas\n\n",
  "author": "FishFeed",
  "time": "20 Feb 2006 — 2:27pm",
  "uid": "11639",
  "comments": [
    {
      "time": "20 Feb 2006 — 2:59pm",
      "content": "That's because they were probably never for sale. Also, many of these may be fonts that _look_ like Carson fonts but were actually not of his design but student projects.\n\nSome may be custom fonts for _Raygun_ magazine. A few of these are sold by [Garagefonts](http://web.archive.org/web/20150408010014/http:/www.garagefonts.com/foundryinfo.html).\n\nCan you toss us some font names?\n\n"
    },
    {
      "time": "20 Feb 2006 — 11:53pm",
      "content": "The font I need is calles SerifedSans. Other fonts of the collection are: Cuba, Evangelic, Freeway, Johndvl, Mexican, Thaitrade, Yoyoyo. But I only would need the Serifedsans.\n\n"
    },
    {
      "time": "21 Feb 2006 — 12:08am",
      "content": "Why don't you email David Carson himself and ask him?  \nThis is his email [dcarson@earthlink.net](mailto:dcarson@earthlink.net)  \nSucces!  \nPieter\n\n"
    },
    {
      "time": "21 Feb 2006 — 12:37am",
      "content": "Haha, the last time I saw that email address, someone had projected it onto the big conference screen at the Melbourne [AGIdeas](http://web.archive.org/web/20150408010014/http:/www.agideas.net/2006/) 2005 Conference to encourage us to sent him uncivilised email as he didn't turn up!\n\n:)\n\n"
    },
    {
      "time": "21 Feb 2006 — 2:14am",
      "content": "He used one of my typefaces for a poster. I asked him so send me a poster and he promissed (twice) to do it. I'm still waiting (for over three years)...\n\nPieter\n\n"
    },
    {
      "time": "21 Feb 2006 — 4:18am",
      "content": "Feh, superstar designers...\n\n"
    },
    {
      "time": "21 Feb 2006 — 6:56am",
      "content": "I'm gonna ask a question I've asked before - I have this font, and if it is truly not available for sale is there anything wrong with my offering it to Fishfeed (not for money of course). He was willing in good faith to purchase it....\n\n"
    },
    {
      "time": "21 Feb 2006 — 7:47am",
      "content": "To answer your question, yes, there could be something wrong.\n\nA font no longer being available does not invalidate the license agreement. If the license agreement allows you to distribute the font file further, then you can by all means do so! But if the license agreement does not allow that, then I see now difference in the font's availability status. Sorry.\n\n"
    },
    {
      "time": "24 Feb 2006 — 1:03pm",
      "content": "There is a way around this though -- Patricia could offer type-setting services to FishFeed.\n\n"
    }
  ]
}
