{
  "id": "18057",
  "title": "How to make FontGander work in OSX \"Classic\" mode",
  "forum": "Build",
  "tags": [

  ],
  "content": "Why would you want to do this? To print specimen books of large font collections, of course. And no OS X app seems to do this as well as FontGander did, at least not yet. (I’m praying someone will change this).\n\nThis is how I got FontGander Pro 1.6 to work on an OS X 10.4.3 / Classic 9.2.2 machine:  \n1. Start Classic  \n2. Install ATM 4.6.2, and restart Classic (as the installer tells you to do)  \n3. Open FontGander and drop fonts and folders on Gander just as you would in the good old days before OS X...  \n4. However, OpenType fonts need to be installed in the Fonts folder in the classic System Folder in order for Classic to recognize them as fonts. Keep in mind, too, that fonts need to be unenclosed in the system Fonts folder to work (no nested folders, that is). And that you need to restart FontGander (and probably the whole Classic system) after adding fonts to the system before they’ll be available to FontGander.\n\nNotes:  \nATM 4.6.2 is the “lite” flavor of ATM. ATM Deluxe stopped at 4.6.1a. 4.6.2 adds support for OpenType, so, yes, you’ll probably want the “lite” version. It’s still free from Adobe.\n\nWithout one flavor or another of ATM to provide rasterization, FontGander prints (and displays) fonts jaggy. Fine for pixel fonts, but nothing else. Oh, fonts in the system folder print fine too, without need of ATM.\n\nYou could try to put all the fonts you’re printing into the system folder, but when doing large groups of fonts, I inevitably ran into a font or two that would make LaserWriter 8 (or AdobePS 8.8, I tried both) drop a print job (no warning, no alert, the job would just disappear from the print queue).\n\nThat said, fonts installed in the system folder printed slightly better on my old Apple Laserwriter 4/600 PS than the fonts which got their smoothing by way of ATM. But not so much better that it was worth the hassles of dropped print jobs and the much slower printing of fonts from the system folder. Verdict: ATM lite is OK!\n\nBack in OS X 10.4 land... I found Automator super helpful for swapping copies of OpenType fonts in and out of Classic’s Font folder (and in the process, stripping the organizing folders FontExplorer X had buried the fonts in), restarting Classic and FontGander.\n\nBy the way, this really is the last gasp for FontGander, since Apple recently said that “Classic” will not be supported on the new Intel chip Macs.\n\n [‹ Random Letters in Fontlab](http://web.archive.org/web/20080404180219/http:/www.typophile.com/node/18074 \"Go to previous forum topic\") [Cross-Platform Development Font Issues ›](http://web.archive.org/web/20080404180219/http:/www.typophile.com/node/18017 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080404180219/http://www.typophile.com/user/4128\" title=\"View user profile.\">buegelfrei</a>",
  "time": "<br>",
  "uid": "4128",
  "comments": [

  ]
}
