{
  "id": "18069",
  "title": "Resume fonts choices",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello again, everyone. I'm designing my resume, and I'd appreciate some input about serif/sans serif font choices.\n\nThe impression I want to give: warm, yet distinguished. Nothing cold or sterile.\n\nMy ideas so far:\n\n1. Dolly paired with Auto (or Formata?)  \n2. Freight Text Medium paired with Freight Sans\n\nI'm leaning toward using Dolly, at least. I'd love to see just how much mileage I can get out of that beauty, but I'm open to all suggestions.\n\nThanks.\n\n",
  "author": "Palatine",
  "time": "21 Feb 2006 — 6:38am",
  "uid": "9249",
  "comments": [
    {
      "time": "21 Feb 2006 — 6:42am",
      "content": "Dolly paired with Auto is a good choise. Don't mix it with Formata.  \nFreight is a nice typeface but not soft and warm enough I think.  \nPieter\n\n"
    },
    {
      "time": "21 Feb 2006 — 9:13am",
      "content": "Thank you!\n\nYes, Dolly and Auto are a wonderful pair after all. My only problem was that the bold weight of Auto was rather overpowering (for subheads), so I simply increased the point size of the reqgular weight and made everything flush-left for more uniformity. Made a world of difference.\n\n"
    },
    {
      "time": "21 Feb 2006 — 10:02am",
      "content": "Reminds me of a recent experience with my resume.\n\nI was chastised by a recruiter for using Times New Roman for my resume in an application for a design position. I would have agreed with him except my only option for submitting for the position was in in a Word format. I guess I could have used Arial?\n\n"
    },
    {
      "time": "21 Feb 2006 — 10:51am",
      "content": "roballoo:\n\nI'm sure the humour of this isn't lost on you: you used TNR on a resume for a \\*design\\* position. In any case, Arial would probably have been an even worse choice. At least TNR is an original, though drawing from a tradition which includes Plantin, I believe. Arial, however, is a poorly-executed knockoff of Helvetica and is universally hated in the design world.\n\nI've never applied for a design position - it isn't my field, although I feel that nearly all written matter should be \"designed\" to some degree. Just good typography. I suspeect that you'd be better off investing in some quality fonts from houses such as, say, Underware, Porchez Typefonderie, etc. StormType is another producer of great fonts that can cover all your needs quite easily.\n\n"
    },
    {
      "time": "21 Feb 2006 — 5:49pm",
      "content": "My wife's just getting her resume together for a teaching gig, so I've been helping her out.\n\nDue to the fact that many places want to receive resumes in Microsoft Word format, I opted for Georgia for headers and Verdana for body copy. Looks pretty good on any computer.\n\nAny thoughts?  \n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n [http://homepage.mac.com/mwebert](http://web.archive.org/web/20141202112311/http:/homepage.mac.com/mwebert \"http://homepage.mac.com/mwebert\")  \n [mwebert@mac.com](mailto:mwebert@mac.com)  \n--------------\n\n"
    },
    {
      "time": "22 Feb 2006 — 8:04pm",
      "content": "\\>Reminds me of a recent experience with my resume.\n\nThat story is quite funny, but since everyone was applying through Word docs, the recruiters most likely knew this and were trying to catch a designer off beat. (file under: testing skills through curveballs)\n\n"
    },
    {
      "time": "23 Feb 2006 — 5:24pm",
      "content": "Lucida Sans is good for a Word resume too.\n\n"
    },
    {
      "time": "23 Feb 2006 — 6:14pm",
      "content": "Thanks Michael. A good reminder that there are other 'standard' fonts than Times New Roman.\n\n<cite>&gt;(file under: testing skills through curveballs)</cite>  \nSpeaking of curveballs, even though the job description said they were looking for a \"Sr. graphic Artist,\" they were really looking for someone who could hit the ground running as a C++ programmer. It was a very strange experience talking to the recuiter. Needless to say I was a bit underqualified for the position.\n\n"
    },
    {
      "time": "26 Feb 2006 — 1:43pm",
      "content": "Consider telling us what kind of position you're applying for. No typeface is suitable for every industry.\n\nIf you're looking for warm and distinguished, consider Galliard. It is familiar to the reader, yet in another league, and the italic is individual.\n\nArrus is also a good choice, graceful and warm.\n\n"
    },
    {
      "time": "1 Mar 2006 — 9:41am",
      "content": "I've been using Futura for my resumés since high school and I never get tired of it, although other people might.\n\n---\n\n"
    }
  ]
}
