{
  "id": "18086",
  "title": "TYPEFOUNDARY-Ready to purchase font designs .",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I am looking for type foundaries who can purchase my designs after their satisfactions.Is there any way to submit designs to **ADOBE**.On there site i found nothing.\n\n",
  "author": "aksharasarovara",
  "time": "21 Feb 2006 — 11:25am",
  "uid": "11495",
  "comments": [
    {
      "time": "22 Feb 2006 — 1:21am",
      "content": "Hi there,\n\nThere are some retailers out there. They will propably not purchase your designs but take it under contract. That means that they might wanna sell it exclusively for you for a limited periode of time. Depending on what you have to offer and if they like it, you might get a contract.\n\n[MyFonts](http://web.archive.org/web/20131015065307/http:/www.myfonts.com/) works non-exclusive and you can get your fonts out there as you please. They take only 35% fee, so you get to keep 65%! For as far as I know it this is the best deal out there.\n\nI have a lot of my fonts at differtent retailers, but found it very hard to get in contact with them. So prepare yourself for hard work and disappointment. ;-)\n\nBest regards,  \n®ené\n\n\\*\\*\\* [www.characters.nl](http://web.archive.org/web/20131015065307/http:/www.characters.nl/ \"www.characters.nl\") { Typography to express yourself } \\*\\*\\*  \nRSS feed: [http://www.characters.nl/rss/rss.xml](http://web.archive.org/web/20131015065307/http:/www.characters.nl/rss/rss.xml \"http://www.characters.nl/rss/rss.xml\")\n\n"
    },
    {
      "time": "23 Feb 2006 — 9:43am",
      "content": "Thankyou characters,  \nI knew about myfonts but i was thinking to give all rights to someone.I dont want to concentrate on marketing and don't want to wait for money.  \nDo you are anyother know what strategy they follow?Just display on site or direct approach to buyers,or both.  \nAnyway thankyou again.only one reply.\n\n"
    },
    {
      "time": "23 Feb 2006 — 10:44am",
      "content": "Hi. I held off replying, because it's tough to know what to say. Most publishers - myself included - like to work with designers to get their types ready for the world, and then do the marketing and whatnot, and hope that the marketplace wll respond. Type publishing is a huge gamble and the rewards range from zero to pretty good. Publishers share the risk and the reward with designers. Buyouts of type designs do happen, but usually it's designers/publishers selling to a client. You might find a publisher who will be interested in a buyout of your designs, but most will want to maintain a publisher/author relationship. That being said, you should definitely contact those foundries whose work you admire, and who you feel would admire your work. Then you can discuss the nitty-gritty business details.\n\n"
    },
    {
      "time": "23 Feb 2006 — 10:59am",
      "content": "I don't think there will be too many vendors out there who will pay upfront cash to someone that doesn't have a track-record of producing a string of top-sellers, even then I'd guess it would only be a small advance on royalties. Maybe having your own site or a myfonts store would be a good first step. If your plan is to maximize revenue then building a reputation (making good stuff, attending & speaking at the conferences, getting high-profile clients, entering a few compos, doing more techy work - such as clever OTL or hinting) and then doing custom work might be your best plan.\n\n"
    },
    {
      "time": "23 Feb 2006 — 11:36am",
      "content": "Si has put his fingers on it.\n\nU2 can get a huge cash advance from their record label, because their recordings are guaranteed to sell well, and their creative track record is very good. An unknown band whose songs have never been heard; they'll probably need to play a few bar gigs before they reach U2 status...\n\n"
    },
    {
      "time": "23 Feb 2006 — 12:33pm",
      "content": "I would suggest submitting your designs to FontFont and Linotype.  \nThey are both respected publishers who have a track record of regularly releasing original new designs.  \nThey will not purchase your designs outright. However, they will assist in production, and then they will release and market the fonts.\n\n"
    },
    {
      "time": "23 Feb 2006 — 12:33pm",
      "content": "You may want to contact the folks at Veer. I have no idea if they would buy your faces upfront, but they do work with a lot of up & coming type designers (from what I've seen).\n\nveer.com\n\n"
    },
    {
      "time": "23 Feb 2006 — 12:40pm",
      "content": "I know this isn't an answer, but can we see what you're trying to market to the foundries?\n\n"
    },
    {
      "time": "27 Feb 2006 — 12:57am",
      "content": "chester wrote:  \n`and hope that the marketplace wll respond. Type publishing is a huge gamble and the rewards range from zero to pretty good.`  \n**yes,i often think, after so many existing fonts,is there any scope for new fonts!**  \n`sii`:  \ni tried my best to make technically sound fonts,and ready to do best.i am from india and what is small at your side is satisfactory here.  \n`Nick Shinn,Chris Keegan`:  \ni will try there.  \n`david bailey`:  \ntrying to fulfill your request.\n\n"
    },
    {
      "time": "27 Feb 2006 — 4:15am",
      "content": "While it does take a small piece of time and thought to get the fonts ready for sale on Myfonts, there really is no ongoing promotion/marketing required from you. Myfonts already has the traffic flow in place to showcase your font to a greater capacity than you would ever be able to do yourself.  \nIn regard to waiting for payment, well, as others have said, you really can not expect up front payments without a track record, and I personally dont see any hardship in the 30+ days waiting period for royalties to be forwarded to you.\n\n"
    },
    {
      "time": "4 Mar 2006 — 4:46am",
      "content": "Thanks typotheticals.  \nIt seems there is no chance to direct sell.  \n**Designers what extra do,Who has a track record?.Something from out of tec. spec.!!!!!What the different they do.**  \nIf i am running a type foundary,i will look for technically ok,well hinted,well kerned,features working well,and above all design has something appealing,which can attract to buyers.They don't look who is designer.A wellknown or unknown both can create good designs.There maybe one difference due to lack of experience\"technical\".\n\n"
    },
    {
      "time": "4 Mar 2006 — 7:14pm",
      "content": "Dear Aksharasarovara,\n\nYou've asked a lot of questions, and I think you've been given a lot of good, sound advice. One question, where are your fonts? if you were to show examples of your stuff people may be able to give you more specific advice.\n\nCheers, Si\n\n"
    },
    {
      "time": "6 Mar 2006 — 2:02am",
      "content": "_As demanded my first created font.Not fully completed,i mean hinting and kerning.Ready to receive bombording._  \nHow to attach file to message?  \n [http://img104.imageshack.us/img104/8903/demofont9bm.jpg](http://web.archive.org/web/20131015065307/http:/img104.imageshack.us/img104/8903/demofont9bm.jpg \"http://img104.imageshack.us/img104/8903/demofont9bm.jpg\")\n\n"
    },
    {
      "time": "7 Mar 2006 — 1:34pm",
      "content": "_How to attach file to message?_\n\n[http://typophile.com/readme#images](http://web.archive.org/web/20131015065307/http:/typophile.com/readme#images \"http://typophile.com/readme#images\")\n\n"
    },
    {
      "time": "11 Mar 2006 — 10:06am",
      "content": "5 days.No comments!\n\n"
    },
    {
      "time": "11 Mar 2006 — 10:31am",
      "content": "I don't think a constructed font of this kind is an effective demonstration of what you may or may not be capable of as a type designer.\n\n"
    },
    {
      "time": "12 Mar 2006 — 10:13am",
      "content": "sii,You mean this is not worthful for critics? or doesn't show my capabilities?I didn't get what you want to say.\n\n"
    },
    {
      "time": "12 Mar 2006 — 2:17pm",
      "content": "I think that what Si means is that a constructed typeface as you have shown is the kind of exercise which all young type designers create as technical trials; one can build something on a grid quite quickly, and play out some technical ideas. But more typographic designs - such as \"Gotham\" or \"Farnham\", to pick two recent typefaces at random - really demonstrate the skills their designers have, as well as their æsthetic sense.\n\n"
    },
    {
      "time": "13 Mar 2006 — 9:40am",
      "content": "I agree with Chester, the choice was poor because...\n\na. A constructed font doesn't really demonstrate any of the typical type design skills. It does look like a typical beginner's effort. Nothing wrong with that, but if this is typical of what you're currently producing then you have a ways to go before you can expect any kind of commercial success.\n\nb. It shows a lack of understanding of what outfits like Adobe (the subject of your initial inquiry) are interested in - compare with Bickham Script Pro, or Garamond Premier Pro.\n\nCheers, Si\n\n"
    },
    {
      "time": "15 Mar 2006 — 11:07am",
      "content": "Thankyou chester and sii,now i got what i was looking for.As i am a newbie i need some good guides from seniors and for what forums are.  \nSo this is not good job?  \nI will see mentioned fonts.Where i can see gotham and farnham.  \nThankyou again.hope you guys will enlighten me time to time.\n\n"
    }
  ]
}
