{
  "id": "18082",
  "title": "Non-Static Logo Systems",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello\n\nI’m a grad student working on a research project involving non-static logo systems: ID systems comprised of some elements that are consistent and other elements that change from one implementation to another. The most well-known example is probably the MTV logo — the shape and configuration are consistent but the color, patterns and animation style are always changing. Other examples are the “Nick Jr.” pre-school Nickelodeon tv identity (illustrations of parent and child animals) and of course the Google logo.\n\nCan you think of other examples? Or even better, have you seen anything written about this that I could track down? In books, in magazines, on blogs, whatever. If you have ideas or resources to share I would really appreciate it.\n\nThanks,\n\nRob\n\n [‹ Monitor Calibration](http://web.archive.org/web/20080108031226/http:/typophile.com/node/18054 \"Go to previous forum topic\") [Quotes ›](http://web.archive.org/web/20080108031226/http:/typophile.com/node/18090 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080108031226/http://typophile.com/user/9177\" title=\"View user profile.\">BrooklynRob</a>",
  "time": "<br>",
  "uid": "9177",
  "comments": [
    {
      "time": " 21.Feb.2006 9.41am",
      "content": "How about [Typographica](http://web.archive.org/web/20080108031226/http:/www.typographi.com/)? Does that fit your bill? And then there’s always the venerable Typophile itself. Ever heard of it? :) It’s always changing.\n\n"
    },
    {
      "time": " 21.Feb.2006 9.49am",
      "content": "The new [Bahamas](http://web.archive.org/web/20080108031226/http:/www.bahamas.com/bahamas/index.aspx) promotional identity and advertising campaign are an excellent contemporary example of this. If you ride the right lines in the Metro, you’ll see their print ads.\n\n"
    },
    {
      "time": " 21.Feb.2006 10.40am",
      "content": "How about FedEx? All their different services and their Kinko’s division have linked but distinct logos.\n\n"
    },
    {
      "time": " 21.Feb.2006 10.53am",
      "content": "The Olympics would be a good example of multi-faceted branding. You can probably find stuff online, and there’s an article in the current issue of Communication Arts.\n\n"
    },
    {
      "time": " 21.Feb.2006 11.20am",
      "content": "Some book publishers also allow the designer to modify their logo to match the design of the jacket. Chip Kidd’s [Book One](http://web.archive.org/web/20080108031226/http:/www.amazon.com/gp/product/0847827488/) has examples of this. I think Knopf is the specific publisher.\n\n"
    },
    {
      "time": " 21.Feb.2006 12.25pm",
      "content": "FontShop: same grid/boxes/colours, but the fonts change.\n\nThe logo for the ATypI conference in Copenhagen 2001 was cery cool. I can’t find a sample online. I have the T-shirt, but it’s only non-static when I move. For the animation (as i recall), the 5 characters were split in half horizontally, and the top and bottom parts wandered/jiggled around, slowly and slighty.\n\nI change the typefaces of my logo every few years. Presently my website logo is animated. It’s done by cycling about 40 different applications of the “noise” filter to the same file.\n\n ![](http://web.archive.org/web/20080108031226im_/http:/typophile.com/files/shinntype.gif)\n\n"
    },
    {
      "time": " 21.Feb.2006 12.40pm",
      "content": "[Walker Art Center](http://web.archive.org/web/20080108031226/http:/www.processtypefoundry.com/about/press_walker.html) by Eric Olson  \n [The New School](http://web.archive.org/web/20080108031226/http:/identity.newschool.edu/) (sort of)  \n [Tate](http://web.archive.org/web/20080108031226/http:/www.wolff-olins.com/tate.htm) by [Miles Newlyn](http://web.archive.org/web/20080108031226/http:/www.newlyn.com/)\n\n"
    },
    {
      "time": " 21.Feb.2006 5.17pm",
      "content": "My favorite kinetic identity is the cable network Noggin.\n\n[http://www.noggin.com/](http://web.archive.org/web/20080108031226/http:/www.noggin.com/ \"http://www.noggin.com/\")\n\nThe top of the head switches to reflect the programming and content.\n\n"
    },
    {
      "time": " 21.Feb.2006 5.25pm",
      "content": "<cite>The new Bahamas promotional identity and advertising campaign are an excellent contemporary example of this. If you ride the right lines in the Metro, you’ll see their print ads.</cite>  \nI couldn’t help but stare at those ads on the subway the other night on my ride home from a concert. Definitely a top notch identity!\n\n"
    }
  ]
}
