{
  "id": "18099",
  "title": "Don't forget Johnston",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I just saw [Tankard’s Bliss](http://web.archive.org/web/20081012032444/http:/typography.net/type/bliss.htm) in a newspaper ad and it reminded me again how important [Edward Johnston](http://web.archive.org/web/20081012032444/http:/typophile.com/wiki/Edward%252BJohnston)’s Railway type (1916) has been to the sans world. It’s easy to forget that [Gill Sans](http://web.archive.org/web/20081012032444/http:/typophile.com/wiki/Gill%252BSans) got 95% of its genetic material from Johnston, and that Johnston preceded [Futura](http://web.archive.org/web/20081012032444/http:/typophile.com/wiki/Futura) by 12 years. I can’t think of any sans of note that predated it except [Akzidenz Grotesk](http://web.archive.org/web/20081012032444/http:/typophile.com/wiki/Akzidenz%252BGrotesk). Even though Johnston was not available as a commercial face for more than 80 years ( [ITC Johnston](http://web.archive.org/web/20081012032444/http:/www.myfonts.com/fonts/itc/johnston/), 1999) its influence was immediate and worldwide – since, then and now, many of the world’s educated people seem to pass through London. Johnston’s influence can even be seen in [Clearview](http://web.archive.org/web/20081012032444/http:/www.clearviewhwy.com/), coming soon to a road sign near you if you live in N. America. P22’s [London Underground](http://web.archive.org/web/20081012032444/http:/p22.com/products/london.html) is faithful to Johnston’s original and has some cool extras, but also has a very restrictive license.\n\n ![](http://web.archive.org/web/20081012032444im_/http:/typophile.com/files/itcjfortypo.gif)\n\n [‹ A nobel site worth watching](http://web.archive.org/web/20081012032444/http:/typophile.com/node/18105 \"Go to previous forum topic\") [Longtime lurker... ›](http://web.archive.org/web/20081012032444/http:/typophile.com/node/18109 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081012032444/http://typophile.com/user/11256\" title=\"View user profile.\">londontype</a>",
  "time": "<br>",
  "uid": "11256",
  "comments": [
    {
      "time": " 21.Feb.2006 9.20pm",
      "content": "what’s the restrictive part about the [p22 license](http://web.archive.org/web/20081012032444/http:/www.p22.com/support/license.html)?\n\n"
    },
    {
      "time": " 22.Feb.2006 3.58am",
      "content": "I wish I were a fly on the wall of the first three meetings that were held for the what became the Johnston typeface. Eric Gill was there for those three meetings. Was it Meynell that was also there? I really haven’t read my notes for 6 years.\n\nI’d also be curious which part of the EULA seems restrictive to you.\n\n"
    },
    {
      "time": " 22.Feb.2006 4.45am",
      "content": "[This thread](http://web.archive.org/web/20081012032444/http:/www.adobeforums.com/cgi-bin/webx?50@1019.gfmDf2U40L7.4@.1dea12f4) from Dove Isaacs has been a “sticky” over on the Adobe Typography board for some time.\n\nRichard\n\n"
    },
    {
      "time": " 22.Feb.2006 5.03am",
      "content": "P22’s EULA is far less restrictive than Tankard’s or ITC’s.\n\nITC’s actual EULA is difficult to discover: the only way I’ve found is to initiate a purchase, and scroll through the display in a ridiculously small frame.\n\nIt restricts “embedding” of the font to “a static graphic image (for example, a “gif”) or an embedded electronic document...You may not embed Font Software in a Commercial Product without a separate written license from MTI, and you may not embed Font Software in an electronic document or data file for any reason other than your own Personal or Internal Business Use.”\n\nModification isn’t allowed.\n\n"
    },
    {
      "time": " 22.Feb.2006 5.48am",
      "content": "“The basic P22 license is intended to accommodate personal use as in the course of everyday correspondence and document writing, or in the design of self-promotion pieces like business cards, newsletters and brochures. Other uses designated as “professional” or “commercial” may require additional licensing. Professional use is work performed by, not limited to, freelance designers, small design firms and corporate advertising firms that incorporate P22 fonts within a design for a client or self-promotion.”\n\nI take this to limit most commercial uses of the font. No such limits appear on the ITC agreement - at least that’s the way I took it. Would you take the above as restictive? Maybe I’ve taken it wrong. My primary use is for signage and packaging. I wasn’t so concerned about the embedding issue.\n\n"
    },
    {
      "time": " 22.Feb.2006 6.10am",
      "content": "“Other uses designated as “professional” or “commercial” may require additional licensing. Professional use is work performed by, not limited to, freelance designers, small design firms...”\n\nI also wonder what this means. Why would I license a font that I can’t use in work for clients? Perhaps this is legal-speak for something other than what it sounds like? I hope Paul can get a clarification for us.\n\nChrisL\n\n"
    },
    {
      "time": " 22.Feb.2006 6.24am",
      "content": "I always defer to Miss Tiff for licensing advice. ;^P  \nBut if I’m not mistaken, the commercial licensing clause is put in there and required for usages such as [this](http://web.archive.org/web/20081012032444/http:/www.p22.com/comlicensing.html).\n\n"
    },
    {
      "time": " 22.Feb.2006 6.39am",
      "content": "Does Johnston have its own license rules due to the fact that it is itself being licensed?\n\n"
    },
    {
      "time": " 22.Feb.2006 6.44am",
      "content": "Example:  \nIf a small design studio (say a 3-person shop) or a freelancer gets a job to design a brochure, business stationary, and kit cover for a client who is not a household name but a business just the same. They use one of the P22 fonts in the work. Do they need an additional license or not?\n\nChrisL\n\n"
    },
    {
      "time": " 22.Feb.2006 6.52am",
      "content": "if you keep reading further than the quote pulled above, you get to _... Most alphanumeric fonts are allowable without additional licensing provided that the Grant of License guidelines are met..._\n\nI’ve found that it’s useful to read a [EULA](http://web.archive.org/web/20081012032444/http:/typophile.com/wiki/EULA) all the way through and then any additional explanation pages and then to re-read parts that might be difficult to understand and then to discuss what it all means with Miss Tiff. That’s what i did with some house fonts that i bought recently.  \nI don’t believe the London Underground font has any special licensing or it would be documented somewhere on the webpage.\n\n"
    },
    {
      "time": " 22.Feb.2006 7.11am",
      "content": "I have licenses for both the P22 package and the complete ITC Johnston family. I bought the ITC after P22 because it seemed less restrictive. But I am a novice, may be totally naive here. I know there’s little chance of getting caught either way and there are lots of gray areas - but if we restrict a product we produce we want others to abide by those restrictions, so I try to do the same where possible. I’d love some help here.\n\n"
    },
    {
      "time": " 22.Feb.2006 7.33am",
      "content": "I did read the whole thing from your link and the intention you infer from it escaped me. It may be better to move that line up a bit and rephrase something like:\n\n“while Most alphanumeric fonts are allowable for professional use without additional licensing provided that the Grant of License guidelines are met, other uses designated as “professional” or “commercial” such as ???? may require additional licensing. “\n\nThe problem for me is the term “allowable” is left hanging without clarification and that it sounds like the “may require additional licensing” is the norm rather than the exception.  \nSomewhere, in ALL foundries’ EULAs, there needs to be a place where the legal-speak is translated into language that is clear to the end user. I will grant you that users need to “Read and reread” if you will grant me that EULA writers need to reread and rewrite as well. The danger to the foundry is that there is a potential for confusion which may cause potential customers to shy away from purchase. I know this is an old story Tiff has been through on numerous occasions here and abroad so I will just shut up now.\n\nChrisL\n\n"
    },
    {
      "time": " 22.Feb.2006 7.43am",
      "content": "Yes the word ’allowable’ can be sticky. However, in the EULA if the word allowable is used you can just read it as allowed. I think allowable is more of a legalese word and must be used.\n\n"
    },
    {
      "time": " 22.Feb.2006 8.01am",
      "content": "Unpleasantness about P22 [here](http://web.archive.org/web/20081012032444/http:/designforum.aiga.org/content.cfm?ContentAlias=_messageview&mid=%24.%3E%5B%2B%5E%20%20%20%0A). But see some helpful clarification from P22’s Kegler at the bottom of the posts. Quote from P22 owner Kegler: “A font is licensed as a tool to design with. We have no interest in hindering that...Packaging by itself does not require additional licensing beyond just the proper licenseing of the font to begin with.” - not to be taken as legally binding or authoritative I’m sure, since its just a forum post.\n\n"
    },
    {
      "time": " 22.Feb.2006 8.28am",
      "content": "I think the word ’unpleasantness’ is not correct. But yes, shows more and more how much education is needed in regards to font licensing and their EULAs.\n\nI’d say this confusion comes from people only surface reading the EULA. I had the same confusion about their EULA until I actually sat down read it and then asked Rich and Carima what they meant. These foundries are run by people not robots. They can answer questions and most of the time will take the time to do so right away just to make sure you don’t get stuck on a slippery slope. Most situations where you must additionally license a font are for extreme cases which most small companies rarely enter. However, if a small company does find themselves needed more licensing, chances are they are going to be doing a large enough project to cover most instances of the needing more licensing.\n\nIf it is an icon, dingbat or illustration typeface design you shouldn’t be surprised that you need additional licensing. Most if not all foundries that have typefaces like this will require it.\n\n"
    },
    {
      "time": " 22.Feb.2006 8.30am",
      "content": "i think the advice stewf gave in that posting is the best to give anyone who has questions about licensing: contact the foundry directly. i’ve never had anything but good experiences when contacting foundries/type suppliers with questions or concerns.\n\n"
    },
    {
      "time": " 22.Feb.2006 9.01am",
      "content": "Back to the typeface. Miss T - is the meeting between Gill and Johnston mentioned in Justin Howes’ book? My understanding is that there was a little bad blood between them but that Gill acknowledged his debt to Johnston. Italics and weight varieties not withstanding, I find that where Gill and Johnston differ (lowercase t, w’s that stand on stiletto heels) I prefer Johnston.\n\n"
    },
    {
      "time": " 22.Feb.2006 9.16am",
      "content": "I haven’t read his book, but I would guess that he had access to all of the same material as I did when I was researching Perpetua. I don’t recall why Gill stopped participating, but I’m sure he had his reasons. I’m very interested to read the book, I’ll have to go find a copy. Thanks for the reminder.\n\n"
    },
    {
      "time": " 22.Feb.2006 11.00am",
      "content": "_I can’t think of any sans of note that predated it except Akzidenz Grotesk._\n\n19th century sans serifs (like other 19th century type genres) don’t get much respect, although they have certainly been noted in design histories; Meggs gives appropriate space to the first flurry of releases in London in the 1830s. They were in frequent use in all kinds of typesetting, lettering, signage, and architectural inscriptions. Rian Hughes has just released a face based on British cast iron street name signs, which are all over the place and looking damn fine (although he has kept things grungy rather than cleaned them up).\n\nThe foremost (1989) digital sans based on a 19th century model is David Berlow’s Bureau Grotesque, after types of the Stephenson Blake foundry, and at the request of art director Roger Black. Another face in the same genre is Jonathan Hoefler’s Champion. These faces have been very well used, especially in magazines and newspapers.\n\nIn comparison to the Victorian Grotesques, Johnston’s work, like his calligraphy, is a little rough around the edges, naive, even. But that is part of its appeal, linking it to the arts and crafts movement, and it’s as part of that return-to-basics philosophy that Johnston’s work resonated across Europe.\n\nFor a typeface family, the Johnson idea worked well in many branches, including regular text, but the condenseds were not as good as those of the Grotesque.  \nNB: The bold sans serif condensed all-caps face was a massive pillar of 19th century Victorian jobbing typography — Caslon & Livermore showed 15 pages of it in their 1837 specimen.\n\n"
    },
    {
      "time": " 22.Feb.2006 11.10am",
      "content": "Caslon’s was actually not so bad, but even he didn’t like it. I guess the impressive thing about Johnston was that he had so little to go on. The originality of his face comes from the calligraphic influence I suppose. Keith Tam has an excellent paper on the sans/calligrahic influence.  \n [http://keithtam.net/documents/sanserif.pdf](http://web.archive.org/web/20081012032444/http:/keithtam.net/documents/sanserif.pdf \"http://keithtam.net/documents/sanserif.pdf\")\n\n_Naive_ is a wonderful way to describe Johnston. I think the lowercase can also be described as friendly.\n\n"
    },
    {
      "time": " 22.Feb.2006 12.33pm",
      "content": "Tiffany, if you don’t mind me asking and going a bit OT, what happened to the Perpetua article that was trailed on a previous incarnation of Typophile?\n\nI’m particularly interested because of Gill’s work on this stamp\n\n ![](http://web.archive.org/web/20081012032444im_/http:/typophile.com/files/stamp.jpg)\non a postcard to his brother Evan.\n\nRichard\n\n"
    }
  ]
}
