{
  "id": "18106",
  "title": "What we need are more material bibliographers.",
  "forum": "Miss Tiffany's blog",
  "tags": [

  ],
  "content": "Inspiration for me happens when I open my heart to it, but I rarely find the energy to see it through. At least for things which are mostly personal and aren't a part of my daily work schedule. Last night I was inspired ... again.\n\nJames Mosley gave the first [Justin Howes lecture](http://web.archive.org/web/20120727054829/http:/typophile.com/node/17915) and it was inspiring. His energy and determination for preserving and recording the history of type is amazing. The amount of knowledge this one man has about the world of type founding and type history is enough to make me wish we did have a fountain of youth so that we will never be without him.\n\nHe used the term \"material bibliographer\" to describe what he does. Or at least that is how I heard it. He might have been simply talking of what people who study books on a material level are called. People that study type and what was used are material bibliographers. He spoke of the importance of these people, especially today when libraries such as the Imprimerie Nationale are losing their homes.\n\nHe mentioned the idea of a world-wide database where anyone interested or in need of information concerning type founding or history could go. The technology is there. It would take a huge amount of work, but can you imagine? Can you stop and imagine a website with a database to type history around the world? Doesn't it give you chills? He spoke of the world being smaller and the type community no longer be localized but international and constantly growing. I thought of Typophile and how similar the idea was. What a wonderful thing to meet and discuss and learn from one another.\n\nAfterward I went up to thank him personally and to say hello. (I was lucky enough to have him as one of my lecturers while studying at Reading.) You'll be pleased to know that he mentioned Typophile and made a similar comparison. Did you know he reads our forum?\n\nIt was a wonderful first lecture in what, I hope, will be a long line of lectures honoring a man, Justin Howes, who truly was one of the great material bibliographers of our time.\n\n",
  "author": "Miss Tiffany",
  "time": "22 Feb 2006 — 4:03am",
  "uid": "108",
  "comments": [
    {
      "time": "22 Feb 2006 — 4:49am",
      "content": "Dear Miss Tiffany,  \nthanks for this post. Such a web resource would be great. Two points : one great resource actually available in terms of book history, is the Bibliothèque Nationale de France (BNF), whose on line site [http://gallica.bnf.fr](http://web.archive.org/web/20120727054829/http:/gallica.bnf.fr/ \"http://gallica.bnf.fr\") is a real treasure trove. I am using some pdfs of Aldus Manutius volumes in my editorial design course, and I regularly search the BNF database for relevant material which my students can gain access to. One great feature is that this collection is truly open access, something that cannot be said for many major libraries. It would be marvellous to sift through this collection, to highlight books of particular typographic interest.\n\nSadly many key works regarding the history of type design in France have not been digitized. I cannot believe this, but it is sadly true.\n\nSecond, I believe that Jan Middendorp wanted to develop an on-line database which would serve as the knowledge base for Dutch Type second edition, [http://www.dutchtype.org/dtintro.html](http://web.archive.org/web/20120727054829/http:/www.dutchtype.org/dtintro.html \"http://www.dutchtype.org/dtintro.html\")\n\nI might ask you directly whether there exists on typophile a list of links to libraries with on-line digital collections relating to the history of type and book design ???\n\nbest wishes,\n\npete\n\n"
    },
    {
      "time": "22 Feb 2006 — 5:05am",
      "content": "Pete, no there isn't. That is actually an excellent idea. A great addition to the wiki as well. I think it should go under education, but maybe it needs to be research. I'll chat with Paul and find a good place for it and get back to you.\n\n"
    },
    {
      "time": "22 Feb 2006 — 5:32am",
      "content": "Thanks for your note. I know that Jaques André, formerly of the Imprimerie Nationale (if I remember correctly) has a kind of web list of on-line resources, and I should get back in touch with him about that. I am permanently enraged by online collections which are reserved to university access, and permanently delighted by open access initiatives. However, if we could book-mark open access initiatives, it would save many people a great deal of time, and it might eventually enable some of us to \"curate\" so that we would know which books/resources are available. Now my students would love that, and it would also help to spread typographic knowledge, which would also be laudable !!\n\npete\n\n"
    },
    {
      "time": "22 Feb 2006 — 5:51am",
      "content": "Jacques André site with much type information\n\n[http://www.irisa.fr/faqtypo/](http://web.archive.org/web/20120727054829/http:/www.irisa.fr/faqtypo/ \"http://www.irisa.fr/faqtypo/\")\n\n"
    }
  ]
}
