{
  "id": "18112",
  "title": "Wants to report pirating of Adobe Fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Yeah I know of a site that, like, pirates 5 or 6 of Adobe’s most popular font volumes.\n\nHow do I get in touch with Adobe to report that??\n\nI need an email address or something ... I don’t like web forms ...\n\n [‹ SC vs. faux SC and Post-Script vs. TrueType](http://web.archive.org/web/20080415074923/http:/www.typophile.com/node/18807 \"Go to previous forum topic\") [Stormtype Catalog ›](http://web.archive.org/web/20080415074923/http:/www.typophile.com/node/18784 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080415074923/http://www.typophile.com/user/11659\" title=\"View user profile.\">loavesandfishes</a>",
  "time": "<br>",
  "uid": "11659",
  "comments": [
    {
      "time": " 22.Feb.2006 8.33am",
      "content": "HK, please email me directly. I’m in contact with a group of foundries who keep one another posted on things such as this. If you would rather not, watch for Thomas Phinney, he works as part of the type design group at Adobe.\n\n"
    },
    {
      "time": " 22.Feb.2006 8.49am",
      "content": "This is indeed a troubling issue, when you mentioned this I went and did a quick search on popular bit-torrent sites (I do not use them at all FYI) and found Adobe Font Folio 10 available for download to all. This is not a good sign, however I wonder who downloads from these bit-torrent sites. Are they professional graphic designers or just random bit-torrent leechers looking for something to play with? Either way it’s unacceptable.\n\nWhat can Adobe (and other Type foundries) do to eliminate this? or is there anything we as a type community help this issue?\n\n"
    },
    {
      "time": " 22.Feb.2006 9.16am",
      "content": "[http://www.adobe.com/aboutadobe/antipiracy/reporting.html#Anchor-Report-...](http://web.archive.org/web/20080415074923/http:/www.adobe.com/aboutadobe/antipiracy/reporting.html#Anchor-Report-27614 \"http://www.adobe.com/aboutadobe/antipiracy/reporting.html#Anchor-Report-27614\")\n\n"
    },
    {
      "time": " 22.Feb.2006 9.17am",
      "content": "David, good post. I was about to do that myself.\n\n"
    },
    {
      "time": " 22.Feb.2006 9.26am",
      "content": "Thanks! Hmm,that’s a comprehensive form.\n\nNevertheless, I don’t think it’s effective against BitTorrent or other popular forms of internet piracy. I was wondering if there was really anything they (or we) could do to curb this.\n\nIf you’re unsure what BitTorrent is, here is the [wiki](http://web.archive.org/web/20080415074923/http:/en.wikipedia.org/wiki/Bittorrent).\n\n"
    },
    {
      "time": " 22.Feb.2006 9.44am",
      "content": "L&F, thanks for reporting the piracy. You’re no longer in danger of a balsawood chair over the head...\n\n"
    },
    {
      "time": " 25.Mar.2006 11.32am",
      "content": "Good for you reporting Adobe.\n\n"
    }
  ]
}
