{
  "id": "18129",
  "title": "PANTONE Swatch Books..",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "How often do you buy these? I got some older ones for free from work when we were cleaning out the office, getting ready to move to a new building. They’ve basically been sitting in a closet and haven’t been opened really so I figure they haven’t really faded. What’s the real deal here? I know PANTONE says you should buy new ones every year but that seems a bit absurd and extremely expensive. Basically I just want to see what designers in the field do about this matter. I’ve now at least got a decent reference for a complete set: 2 process chip books, 1 uncoated chip book and 1 coated chip book. Circa mid 90’s though...if they’re really not worth having let me know.\n\n [‹ Univers Greek characters](http://web.archive.org/web/20070911194304/http:/typophile.com/node/18155 \"Go to previous forum topic\") [A nobel site worth watching ›](http://web.archive.org/web/20070911194304/http:/typophile.com/node/18105 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911194304/http://typophile.com/user/8451\" title=\"View user profile.\">dave bailey</a>",
  "time": "<br>",
  "uid": "8451",
  "comments": [
    {
      "time": " 23.Feb.2006 6.50am",
      "content": "I use Formula guides, one is about 5 years old and the other 2. I know I should probably change them, but they still work well enough. And I’ve seen older ones in everyday use at some agencies, some of which have really worn out edges and must be at least 10 years old. If your books have been kept out of sun they should be reasonable, but please note, that some numbers might have changed.\n\nA couple of years ago Pantone published the new solid to process guide, which has very different guidelines for CMYK colour mixing compared to the old guide.\n\n"
    },
    {
      "time": " 23.Feb.2006 7.08am",
      "content": "Pantone also releases new colors often. Some get into the main books, but often they’re “specialty” colors — metallic, pastel, fluorescent — that have their own books anyway.\n\nI’d say the books you have will be a decent reference point for now (and still MUCH better than choosing color from an on-screen palette). But if you’re planning on freelancing or having your own studio and truly need a personal set, save your pennies and buy new books eventually (in a year or two).\n\n"
    },
    {
      "time": " 23.Feb.2006 7.12am",
      "content": "Compare them to a new one, blues will fade least/slowest so check some of the yellows and pinks.Their newer cmyk conversion guides are worth having if you can find those as well.  \nTim\n\n"
    },
    {
      "time": " 23.Feb.2006 7.50am",
      "content": "Thanks for the heads up guys, this confirms my suspicions. I will compare them with the 2002 guides we use currently and see how much they’ve faded or not so much. I still have a year and a half left in college so they’d only really be serving as reference for the rest of my educational career. If I end up without a steady job after school and go the freelance route I’ll be sure to pick up updated guides. Until then it looks like these will be much better than guessing about onscreen colors.\n\nAgain thanks for your thoughts. Any others feel free to chime in.\n\nDave\n\n"
    },
    {
      "time": " 23.Feb.2006 8.50am",
      "content": "Another item worth looking out for is a printer’s four colour book, which have the full spectrum of cmyk colours with 10% (or even 5%) increments – like gold dust or hen’s teeth.  \nTim\n\n"
    },
    {
      "time": " 23.Feb.2006 8.56am",
      "content": "By printer you mean offset printer, correct? That sounds like it would be a valuable addition to my recently established design library.\n\n"
    },
    {
      "time": " 23.Feb.2006 9.29am",
      "content": "I’m still using 20-year old Pantone swatches, and they work fine. However, I’m comfortable with colour, have been to a lot of press checks, and have aged with my swatches.\n\nIf you’re starting out, I would say get a brand new set of your own.  \nThat way you will never have to second-guess yourself, and will have all the newest colors as well. It’s a large sum of money, but you won’t need to renew for a long time (or perhaps never...) And colour is something you use on just about every job, so the expense will be well amortized — unlike certain fonts!\n\nThe Process Colour Imaging Guide (comparing spot with CMYK equivalents) is the touchstone, and the most important tool a designer has for seeing, understanding and controlling how printed colour works.\n\nYou may also want to consider looking at TOYO or some other color system, if you’re a “power colour” designer — kind of the colour equivalent of using small caps from fonts of exotic independent foundries.\n\n"
    },
    {
      "time": " 23.Feb.2006 9.42am",
      "content": "If you’re trying to be really precise, the Pantone swatch book you want to use is the same one the press operator is using. Offset press ink will look different depending upon how much is being layed down. Unless you’re providing a sample chip with the job, and the pressman cares enough to try to match it, things are a lot less accurate than people generally think.\n\nIt’s important to have swatches that match your paper, coated or uncoated, as well as having spot and process samples. Nick probably gets better results from 20yr old swatches and a good relationship with his printer than people who have fresh books and blindly assume their printers are competent.\n\n"
    },
    {
      "time": " 23.Feb.2006 9.44am",
      "content": "_you mean offset printer, correct?_  \nYes, it used to be that printers would give them away as a come-on for potential clients, not sure they still do (or ever did in US), but if you can find one in reasonable condition they are very useful clearly showing the problems that some colours can give etc.  \nIf you are interested in metallics from 1 spot and cmyk I received a flyer from this company [http://www.metal-fx.com/](http://web.archive.org/web/20070911194304/http:/www.metal-fx.com/ \"http://www.metal-fx.com/\") I have to say the effect is pretty good.  \nTim\n\n"
    }
  ]
}
