{
  "id": "18153",
  "title": "Self designed logo for my law firm - critiques wanted!",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hey all\n\nHere is a logo I designed for my firm and I wanted to get some feed back from everyone here. Now before you all say it; Yes, I know that the scales of justice is one of the most overused legal images but my first name is Troy and I like that the scales evoke the image of an uppercase T.\n\nI wanted a logo that was fairly coservative but with a contemporary feel. I would be open to adding some color for a little punch, but nothing excessive. I also wanted a logo that even from a distance would let you know that it belonged to a law firm. I have seen a lot of really visually appealing law firm logos that didn’t give you any indication of whether the company was a law firm or a theme park.\n\nThanks for all of your help in advance.\n\n(I could not get the image to load on the page, if anyone knows how I can do this please let me know.)\n\n ![](http://web.archive.org/web/20080118114746im_/http:/www.typophile.com/files/Hough%20Logo.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [Hough Logo.jpg](http://web.archive.org/web/20080118114746/http:/typophile.com/files/Hough%20Logo_3.jpg) | 41.99 KB |\n\n [‹ NEW logo for Authenticore](http://web.archive.org/web/20080118114746/http:/www.typophile.com/node/19487 \"Go to previous forum topic\") [Critique of Logo ›](http://web.archive.org/web/20080118114746/http:/www.typophile.com/node/20043 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080118114746/http://www.typophile.com/user/11689\" title=\"View user profile.\">though</a>",
  "time": "<br>",
  "uid": "11689",
  "comments": [
    {
      "time": " 23.Feb.2006 12.28pm",
      "content": "Troy, please don’t take offense to this, but I would think that if you’re practicing law, you can afford to hire a graphic designer to design a proper logo for you. I will say that the logo is not “bad” per se. You’ve done a decent enough job, but it certainly does not look any different than hundreds of other law firm logos out there. Good luck.\n\n"
    },
    {
      "time": " 23.Feb.2006 12.43pm",
      "content": "I feel like you could benifit from somthing even more traditional, maybe with reference to the standard law office letterhead [http://www.uspto.gov/web/offices/tac/notices/299a.gif](http://web.archive.org/web/20080118114746/http:/www.uspto.gov/web/offices/tac/notices/299a.gif \"http://www.uspto.gov/web/offices/tac/notices/299a.gif\") . As a law office, I don’t think you would benefit from a logo that would would be “clever” in any sense. Maybe use the T and reference the scales rather that using the scales to reference the T, that way you remove “overused legel image” issue. Just some first thoughts\n\n"
    },
    {
      "time": " 24.Feb.2006 3.49am",
      "content": "Its not conserative enough for me. It doesn’t inspire confidence, it looks industrial. Loose the cliche scales and use your full name and title(s). Pick a high quality letterhead paper and think of a process you might print the frims name like hot stamping or blind embossing. Go upscale not ambulance chaser.\n\n"
    },
    {
      "time": " 8.Mar.2006 5.33pm",
      "content": "The scales are definitely overused although I do understand how the “t” plays in. Visually the HOUGH treatment doesn’t make sense. There’s no logic to what you’re doing with the logo to portray the difference you plan to offer your market.\n\nIt does look really industrial. It looks a bit amateurish which would make sense seeing as you’re not a professional designer. If you must cut costs, i would say at least go to a design college and recruit a student looking to build their portfolio and throw them some money.\n\nIt’s a good try, but there is a reason why our occupation exists.\n\nJoseph Szala  \nVigor Graphic Design, LLC.  \n [www.vigorgraphics.net](http://web.archive.org/web/20080118114746/http:/www.vigorgraphics.net/ \"www.vigorgraphics.net\")\n\n"
    },
    {
      "time": " 8.Mar.2006 6.34pm",
      "content": "I certainly do not plan to outright bag your design, though I do feel a need to support the above statements. Joseph is absolutely correct when he states _there is a reason why our occupation exists_; as there is a valuable reason why your occupation exists.\n\nAt this time I do not feel that your logo sets you out from your competition in a positive manner, nor do I get a feeling of confidence, security, professionalism or excellence in your field, which as an audience member I would hope to get. I also do not feel that currently your logo depicts a contemporary enough message, rather something dated or staid.\n\nI apologise that these criticisms are so negative; however I would like to offer a suggestion that perhaps another way to keep costs down would be to find a smaller design firm or freelance graphic designer who may benefit from a trade of services for something like contract writing advice or professional services; or indeed a young graphic design student who would benefit from an appropriate remuneration agreement.\n\nBest.  \n-nic\n\n"
    },
    {
      "time": " 17.Mar.2006 10.23am",
      "content": "Well, it looks like every other legal related logo on the planet. Now, that isn’t necessarily bad. The scales have become the universal symbol for ’lawyer’ so if you are looking for people that need a lawyer that are just walking down the street, then hanging that sign probably makes sense.\n\nHowever, for business correspondence, I don’t think you need the symbol to point out the fact that you are a lawyer. As such, i’d ditch the scales altogether as it does nothing to make you unique in this field.\n\n"
    },
    {
      "time": " 25.Apr.2006 5.30pm",
      "content": "I looks too clip art. It reminds me of a logo done in microsoft word sort of. There are ways evoking a strong, trustworthy image without being so literal. I agree with ditching the iconography. There are plenty of typefaces out there that portray what you are trying to say all by themselves. Try type only. I like the idea of going to a college and hiring a student if you are trying to cut costs.\n\n"
    },
    {
      "time": " 25.Apr.2006 5.47pm",
      "content": "Clients of law firms want solid,trustworthy, established. I like the attempt, but I think clever or cutting edge would not evoke the emotions you want from potential clientelle.\n\n"
    },
    {
      "time": " 23.May.2006 3.50pm",
      "content": "I like it much more without the scales.\n\nAlso, the open outside edges of the H’s make me uneasy. A thin black line on either side to contain the letters and to maintain sharp vertical lines might enhance its stability.\n\n"
    }
  ]
}
