{
  "id": "18179",
  "title": "Averaging and ATF optical scaling",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’ve put together a webpage with some images from my study of ATF optical scaling.\n\n[http://levien.com/type/atf\\_bodoni/avg.html](http://web.archive.org/web/20081013182754/http:/levien.com/type/atf_bodoni/avg.html \"http://levien.com/type/atf\\_bodoni/avg.html\")\n\nI’m in email contact with Patricia Cost, the author of the excellent Printing History article on the Bentons and ATF, and with luck and a little determination, something more fully fleshed out will come of this. In the meantime, I thought people might enjoy looking at the pretty pictures. Here’s one to whet your appetite:\n\n ![](http://web.archive.org/web/20081013182754im_/http:/typophile.com/files/a_scaling.png)\n\n [‹ Will a FontExplorer X user comment?](http://web.archive.org/web/20081013182754/http:/typophile.com/node/18363 \"Go to previous forum topic\") [\"I found a font\" - attestable? ›](http://web.archive.org/web/20081013182754/http:/typophile.com/node/18212 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081013182754/http://typophile.com/user/4406\" title=\"View user profile.\">raph</a>",
  "time": "<br>",
  "uid": "4406",
  "comments": [
    {
      "time": " 24.Feb.2006 10.59am",
      "content": "Raph, I’m very happy that you’re pushing hard with this!  \nA juicy secret world lies within...\n\nIn the image, do you think that might be a trap  \nin the top-right corner of the lower counter?\n\nhhp\n\n"
    },
    {
      "time": " 24.Feb.2006 12.22pm",
      "content": "In the interesting [article](http://web.archive.org/web/20081013182754/http:/www.printinghistory.org/htm/journal/articles/31-32-Cost-Benton.pdf) on the Bentons you refer to, on p. 42 it reads:\n\n“For example, News Gothic was cut exactly proportional to the pattern plate. Going down in size, the face was actually extended in width but not in height… In the 1940s …the normal practice at Stempel was to produce three sets of patterns for each typeface. Adjustments on the machine itself were only used to widen characters in the very smallest sizes.”\n\nIt seems from this there were different philosophies involved for using the machine. Also the article mentions that they drew a different pattern for each size of their Caslon.\n\nDid they linearly increase the thickness and width, or was this much more pronounced at 6 point? Did thickness and width increase together or somethat differently?\n\nOh, and did they do anything about x-height?\n\n"
    },
    {
      "time": " 24.Feb.2006 1.30pm",
      "content": "hrant asks: <cite>In the image, do you think that might be a trap in the top-right corner of the lower counter?</cite>\n\nNo, it doesn’t look like one to me. I assume that by “trap” you mean a wedge taken out of the inner join to create a larger negative space on the inside, as in your [trapping article](http://web.archive.org/web/20081013182754/http:/www.themicrofoundry.com/ss_trapping1.html). I see very little evidence for trapping in the ATF oeuvre.\n\nWilliam: I interpret that passage a bit differently (and am referring to my specimen book for further support).\n\nOf the News Gothic, only the 36pt was engraved with exactly the same outline as the pattern plate. Smaller sizes were extended and heavier compared with the pattern plate, and larger sizes were condensed and lighter.\n\nAmerican Caslon, by comparison, is a fairly extended font already - the “o” is pretty close to a perfect circle. From my experimentation, if you extend an already wide font to try to make optical scales for smaller sizes, it looks wrong. And, indeed, if you look at Monotype (metal) Centaur, there’s little or no anamorphic scaling across the size range. They did use different pattern plates (I’ve counted four size ranges, as discussed in more detail in [this thread](http://web.archive.org/web/20081013182754/http:/typophile.com/node/6592)), and the ’e’ is in fact narrower in the smaller sizes than the larger.\n\n<cite>It seems from this there were different philosophies involved for using the machine. Also the article mentions that they drew a different pattern for each size of their Caslon.</cite>\n\nYes, there are different philosophies, but there is also a lot of commonality. The smaller sizes of Centaur, drawn from different pattern plates, show evidence of stroke offset-based weight gain (radius of curvature is larger on external corners such as the outer bottom of the ’v’, smaller on internal corners, than in display sizes), just as do the ATF Bodonis, all scaled from a single pattern plate. I think it’s likely that they used the stroke offset adjustments across the size range so that there wouldn’t be a noticeable jump in appearance from the largest size in one range to the smallest size in the next (12pt to 14pt, in the case of Centaur).\n\nMost of the ATF fonts used a single pattern plate for all sizes, but there certainly are exceptions. The Garamonds used two, one for 6-12, another for 14 and up (more details [here](http://web.archive.org/web/20081013182754/http:/www.typophile.com/node/5901)). Some of their fonts seem to use many pattern plates. I count at least four in the Baskerville: 6-10, 12, 14-24, and 30-up. Of these, the 12 looks a _lot_ like Stempel (Linotype) Baskerville, the 30 and up is essentially Fry’s Baskerville. The other two are not as good.\n\nScotch Roman (pp. 394 and 395 of the [1912 book](http://web.archive.org/web/20081013182754/http:/levien.com/type/atf_1912/)) also has more than two, but I’m unsure of the exact number (the difference between 18 and 24 is especially noticeable, because the former’s ’e’ has vertical stress like you’d expect of a Modern, while the latter’s stress is about 15 degrees from vertical, more like Caslon).\n\nWilliam also asked: <cite>Did they linearly increase the thickness and width, or was this much more pronounced at 6 point? Did thickness and width increase together or somethat differently?</cite>\n\nMy observation is that the scaling ratio and stroke offset vary linearly with the _reciprocal_ of the point size. And yes, they do vary together. In the very smallest sizes of some fonts (I’ve observed this in Century Catalogue but not Bodoni), there is an additional factor at play: the extenders (especially descenders) are shortened and the x-height correspondingly raised. I believe the width scaling fits the rest of the curve closely, but the height scaling is higher because of this x-height tweak.\n\n"
    },
    {
      "time": " 24.Feb.2006 2.08pm",
      "content": "\\> I see very little evidence for trapping in the ATF oeuvre.\n\nI don’t think I ever have myself - that’s why I wanted to check.\n\nAnd considering the pantograph, this is not surprising at all.\n\nhhp\n\n"
    },
    {
      "time": " 24.Feb.2006 3.15pm",
      "content": "Raph, this seems very instructive about certain historical practices, but do you have a theory about what property of visual receptive field behaviour the need for optical scaling interacts with?\n\nIf the receptive field behaviour learned for reading works according to spatial frequency bandwidths (ie is spatial frequency selective), would varying the scaling ratio linearly with the reciprocal of the point size be the best practice?\n\n ![](http://web.archive.org/web/20081013182754im_/http:/typophile.com/files/%5D%5Bimg:)\n\n"
    },
    {
      "time": " 26.Feb.2006 7.28pm",
      "content": "It is not a trap!\n\nGiampa\n\n"
    },
    {
      "time": " 27.Feb.2006 4.13pm",
      "content": "Peter: You’ve asked a very good question indeed. I have a hunch about the answer, but quite a bit more work is needed to fill it in.\n\nKevin Parker’s research strongly supports the theory that contrast is the primary factor in readability. I suspect that a measurement of the relative contrast of optically scaled vs. mathematically scaled font sizes will show a contrast advantage for optical scaling.\n\nHow should contrast be measured? There are a number of possibilities suggested in the literature. One is to just weight by a contrast sensitivity function, as in my [Electronic Imaging ’04 paper](http://web.archive.org/web/20081013182754/http:/levien.com/artofcode/ei04/). There are, of course, several choices for the CSF, depending on whether you’re going for threshold sensitivity, and how wide a visual field you’re targeting. Another very intriguing possibility is to band-pass for the octave of spatial frequencies responsible for 90% of the readability. ( [this paper](http://web.archive.org/web/20081013182754/http:/www.opticsexpress.org/ViewMedia.cfm?id=63459&seq=0) is the same research as one you cited in your TYPO 13 paper, yes?)\n\nYou can measure empirically using actual fonts, or you can try to use an analytic model (the model I used in my EI ’04 paper, with variable grating width and duty cycle, is probably a good starting point). A 50% duty cycle always gives you the greatest contrast when your CSF is a lowpass filter, but in the case of bandpass I suspect you’ll see your contrast peak at lower duty cycles, more so as the grating width increases. That prediction would match the practice of optical scaling fairly well, although I’m not sure whether that you’d see a clean linear relationship with the grating width.\n\nTo some extent, I’m not sure that a deep analysis of this effect has that great a payoff. We _know_ that optical scaling is a Good Thing(tm), and we have decades of experience of how to do it well, at least for print. Perhaps the biggest payoff will be the understanding of optical scaling for screen rendering, a relatively unexplored area in the literature.\n\nGiampa: [are you sure?](http://web.archive.org/web/20081013182754/http:/elitemrp.net/cgi-bin/iat/page.pl?l1=IT%27S+NOT+A+TRAP%21&ackbar=sit&back=mousetrap&font=defaulthttp://elitemrp.net/cgi-bin/iat/page.pl?l1=IT%27S+NOT+A+TRAP%21&ackbar=sit&back=mousetrap&font=default)\n\n"
    },
    {
      "time": " 4.Mar.2006 1.50pm",
      "content": "Raph, the paper I referenced in my Typo#13 contribution is [this](http://web.archive.org/web/20081013182754/http:/www.psych.nyu.edu/pelli/pubs/majaj2002channel.pdf) one by Denis Pelli.\n\nPelli also has a report on “contrast energy” which might relate to your contrast sensitivity function. [Here.](http://web.archive.org/web/20081013182754/http:/www.psych.nyu.edu/pelli/pubs/pelli2003words.pdf) Commented on [here.](http://web.archive.org/web/20081013182754/http:/www.psych.nyu.edu/pelli/pubs/geisler2003comment.pdf)\n\nIf I’m not mistaken, Gerrit Noordzij relates the need for scaling to Fresnel zones. Noordzij claims the impact of these zones is never considered. Certainly they aren’t in Pelli’s “contrast energy” calculations.\n\nHard to sort through, all this stuff.\n\nYou say the payoff of deep analysis might not be great because we already know the benefits of optical spacing and how to do it well. But if we knew the perceptual mechanics underlying this bit of craft knowledge, we might put this practice on a firmer footing. If the phenomenon is spatial frequency band related, scaling might need to follow a quantum rather than a standard algorithmic model. It would be interesting to determine if prior to the pantograph the scaling might have been more quantal than standardly algorithmico-mechanical.\n\nOr am I showing my ATF ignorance here?\n\nHow does scaling pre and post pantograph manifest in the frequency domain?\n\n"
    },
    {
      "time": " 5.Mar.2006 8.47am",
      "content": "The last person hired at ATF about 25 years ago was Theo Rehak of the Dale Guild Type Foundry of Hale NJ. He became the sole matrix engraver in their final years since nobody else had the skill or inclination to fill the position. His latest book, The Fall of ATF, discloses many of the details and intrigues within this very secretive company. Theo still operates about a dozen of the foundry automatics (Barths) and also has one or more of the legendary Beton engravers, with which he produces matrices of rare and unavailable types.\n\nHe would be the one person in the world who would know anything of the standards and methods of the matrix cutting carried on at ATF, since it was his job to make accurate replacement matrices where matrices had been burnt out over decades of casting on the brute force Barths.\n\nGood luck in your quest for information.\n\nJim\n\n"
    },
    {
      "time": " 5.Mar.2006 9.17pm",
      "content": "Yup,\n\nGerald Giampa\n\n"
    },
    {
      "time": " 7.Mar.2006 5.10am",
      "content": "REally freat images.\n\n” I see very little evidence for trapping in the ATF oeuvre.”\n\nThe patterns and punches were cut with routers, so there should not be any sharp acute angles, right G? this helps against ink if you use it right. . .\n\n"
    },
    {
      "time": " 7.Mar.2006 7.55am",
      "content": "The cheap/lazy ones did in fact only rely on the pantograph’s  \ncoarse cutter, but the good ones (like Amsterdam) used punch-  \ncutters to cut traps and thorns on the output of the pantograph.  \nI have a pitchur.\n\nhhp\n\n"
    },
    {
      "time": " 7.Mar.2006 9.22am",
      "content": "BTW, the router’s inability to cut either traps or thorns  \ndepends on the “polarity” of the object: punch, or matrix.\n\nhhp\n\n"
    },
    {
      "time": " 7.Mar.2006 2.44pm",
      "content": "I’ve cut seven sets of matrices on the pantograph over the past 18 months; none of them coming out looking like Cooper Black. The smallest size was 12 point Duensing Titling, a slab-serifed inscriptional Roman. Even with the slight (One thousandth of an inch radius on the cutter), the serifs remained sharp and square at the terminals. So that we are on the same page, a cigarette paper is one thusandth of an inch. I use a newly sharpened cutter for the finishing cut on each and every matrix, so I maintain a level of sharpness. I’m a pretty tough critic of what is good and isn’t, and a god many hundreds of mad matrices hit the garbage can before I finally came upon a set of standards that worked.\n\nI think if I were lazy I would get indifferent results in cutting mats, but I put the effort into making the best type I can.\n\nI have no axe to grind with cutting types in punch form by hand, .I have one planned, but I’ll still use the pantograph, but will model the tight spots with the hand graver. One can use the pantograph to get the job done in the same way that a sculptor uses power tools to rough out a piece of work. There is no reason that a panotgraphed punch need be crude of softish appearing.\n\nThese are by no means the comments of any kind of expert. It’s just what I have come to know from practical hands-on experience, temporary frustration and utter aggravation.\n\nJim\n\n"
    },
    {
      "time": " 7.Mar.2006 3.29pm",
      "content": "Jim, you <cite>are</cite> an expert. And you’ve just confirmed my stance  \nwith your “will model the tight spots with the hand graver.”\n\n\\> a cigarette paper is one thusandth of an inch.\n\nSo quite often is gain, as reported by Dwiggins,  \nthe Flexographic Institute, Justin Howes, and  \ndfType (the Rialto people).\n\nWhen a given tool’s finest effort is coarser than the gain, that tool is clearly not capable of counteracting the effects of gain. Sometimes gain is negligible; when it’s not, you need a better tool.\n\nhhp\n\n"
    }
  ]
}
