{
  "id": "18174",
  "title": "old (50s) newspapers",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "i recently came across a number of 50s papers in my loft, many of which have some ’keepable’ adverts/headlines/photos. however, given their age, they’re a tad fragile. i’m thinking about mounting the better ones so that i can scan them, but don’t know where to begin. has anyone got any experience of conserving old paper? i’m looking for suggestions on paper stock and glue (to re-assemble some of the more broken-up ones) that isn’t going to completely destroy them.  \ncheers.\n\n [‹ Mark Simonson, in the News Again](http://web.archive.org/web/20070811125445/http:/typophile.com/node/17039 \"Go to previous forum topic\") [Village logo ›](http://web.archive.org/web/20070811125445/http:/typophile.com/node/18171 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070811125445/http://typophile.com/user/7180\" title=\"View user profile.\">mb</a>",
  "time": "<br>",
  "uid": "7180",
  "comments": [
    {
      "time": " 24.Feb.2006 10.30am",
      "content": "Hi mbusher,\n\nAt the moment, I don’t have the time to do a little research for you, but I strongly suggest NOT to GLUE or MOUNT any of the pages.\n\nKEEP EVERYTHING INTACT, an complete within their original order!  \nThe mistake that people make with artifacts is that they try to clean, repair or mount them, when in fact, many times the item AS IT IS, is far more valuable as a document.\n\nAn interesting advertising, photo, illustration or article may not be as valuable as the entire newpaper/magazine intact.\n\nSo, please, do not do anything more than neatly protect them until you learn more about the value of what you have.\n\nHere is a link to [RareNewspapers.com](http://web.archive.org/web/20070811125445/http:/www.rarenewspapers.com/) where you might learn more about the value of the issues you have. There is also a section of items for displaying and preserving old newspapers.\n\ngood luck,\n\n—————————————————————————————-  \nYes, I’m old, but please don’t mount me (without asking)!\n\n"
    },
    {
      "time": " 24.Feb.2006 11.23am",
      "content": "thanks for that link norbert.  \nunfortunately the ones i rescued are mostly scraps, i found them under the insulation - i brought down a few but there’s a lot more still up there.\n\n"
    }
  ]
}
