{
  "id": "1821",
  "title": "Ragged type",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "First of all sorry for my english.   \nI'm not very familar with the english typo-terms.   \n   \nWe have a discussion of \"ragged type\" (Flattersatz) in our firm.   \nA collegue of mine insist, that a good \"ragged type\" starts with a short line.   \n   \nI can't find a rule in my german typo-books. What to you think of it?\n\n",
  "author": "nike",
  "time": "27 Oct 2003 — 8:03am",
  "uid": "1172",
  "comments": [
    {
      "time": "27 Oct 2003 — 8:48am",
      "content": "If by a short line you mean Indented (sangrada) it depends on the spacing before the paragraph so it can be easily distinguished from the previous one. The custom here is to separate ragged paragraphs and to indent justified ones.   \n   \nIf by a short line you mean to break it soon, it sounds like a good strategy for marking the paragraph beginning.\n\n"
    },
    {
      "time": "28 Oct 2003 — 4:54am",
      "content": "A short or long first line is really dependent on the copy and the set width. Either one can work. But a quality rag setting, either left or right, should have the natural organic quality of a gentle coastline. Not too craggy and not too even. And should avoid any forced mechanical short-long-short-long solution.   \n   \nSetting a good rag is one of the most difficult things to do in typography.\n\n"
    },
    {
      "time": "1 Nov 2003 — 3:00am",
      "content": "What ever you do, forget to read anything Eric Gill wrote on the subject.   \n   \n   \nGerald Giampa   \nLanston Type Company\n\n"
    },
    {
      "time": "1 Nov 2003 — 6:28am",
      "content": "\"What ever you do, forget to read anything Eric Gill wrote on the subject.\" ...?   \n   \nwhy's that? or: what did he wrote about it then?   \nlars\n\n"
    },
    {
      "time": "1 Nov 2003 — 10:17am",
      "content": "Best to look at his book designs. Get over the illustrations which are often very nice.   \n   \nHis idea was to combine word spacing within the ragged right model. His resulting setting was a page that looked like the printer did not know how to justify type.   \n   \nWhich is exactly what it was.   \n   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "1 Nov 2003 — 10:51am",
      "content": "Both full ragged right and full justification are primitive solutions. The ancient Greeks knew how to make a \"soft rag\" paragraph, in that old pragmatic way of balancing everything, something that was lost with the provincial absolutism of the Romans which pervades the West to this day.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Nov 2003 — 11:37am",
      "content": "Golly, Hrant, you're never one to dwell on the subtleties, nuances and counter-evidential examples are you? Why look at books when you can just make broad general assertions! There are many examples of soft rag in the manuscript and print traditions of Western Europe, but the dominant model in the Western formal book manuscript was justification by letter expansion and contraction, which is itself a very fluid technique, not remotely 'absolutist'. Gutenberg emulated this technique in the 42-line Bible, but within a few years it was abandoned in favour of efficiency.\n\n"
    },
    {
      "time": "1 Nov 2003 — 12:15pm",
      "content": "Hrant,   \n   \nWe must be talking about a different Eric Gill. The one I am referring to was an English wood cut artist. He wore dresses and designed some remarkable type.   \n   \nHe wasn't Greek was he? Didn't think so. I never liked it when white men played parts as black men. Or white men acting as American Indians in movies for that matter. Ever watched the \"Lone Ranger\"? Did you like it?   \n   \nIntegration of cultures is not always a good thing! Everyone speaking the same language, not for me.   \n   \nWhere do you stand on \"Typographical Integration\"? For me, I like my type well set. I don't care if the French eat their steaks rare.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "1 Nov 2003 — 1:02pm",
      "content": "I have recently read the elements of typographic style. Bringhurst says that combining word spacing with ragged paragraphs puts the worst of both systems in a single text.\n\n"
    },
    {
      "time": "1 Nov 2003 — 1:17pm",
      "content": "Hector, Bringhurst is right.   \n   \nGerald, I think you misinterpreted Hrant's bluster. He was not condoning Gill's problematic typesetting, he was talking about taking time to make sure that the rag keeps to a tidy range.   \n   \nThis is   \nthe difference   \nbetween   \nthis   \n   \nand the   \nmore even   \nrag seen   \nin this   \nexample   \n   \nBoth are ragged right, but the second is less ragged and looks way better than the first. If you don't have the ability to control this by expanding and contracting letterforms as one can in manuscript and as Gutenberg took the time to do, then you have to be willing to break words (as Hrant's ancient Greeks certainly were).   \n   \nThis is   \nthe dif-   \nference   \nbetween   \nthis...   \n   \n(Of course, these examples are intended only to show different kinds of rag; anyone who sets type in columns that narrow needs a kind of help that we are not able to provide on Typophile.)   \n   \nI think we're probably all agreed that letterspacing lowercase letters to fill out a line, whether for justification or to tidy the rag, is a wicked act akin to doing unnatural things with sheep. Speaking of Eric Gill...\n\n"
    },
    {
      "time": "1 Nov 2003 — 1:36pm",
      "content": "\"...tidy the rag, is a wicked act akin to doing unnatural things with sheep. Speaking of Eric Gill...\"   \n   \nWell put John, glad you said it and not me.\n\n"
    },
    {
      "time": "1 Nov 2003 — 2:44pm",
      "content": "\"...He wore dresses and designed some remarkable type\"   \n   \nGerald --   \n   \nThis cracks me up, if you look back a couple weeks, Hrant and I had a big dicussion regrading   \nMr. (Mrs.?) Gill's \"lifestyle\". That man was truely a nut job. ;)   \n   \nBTW what was up with your site? Tried to email you and get on your site last week, but no luck.   \nI had my intern here, and I was trying to give her a basic lesson in Fleurons, and I didn't know where is to turn. :^)   \n   \nhildebrant.\n\n"
    },
    {
      "time": "1 Nov 2003 — 2:48pm",
      "content": "\"Bringhurst says that combining word spacing with ragged paragraphs puts the worst of both systems in a single text.\"   \n   \nH\n\n"
    },
    {
      "time": "1 Nov 2003 — 3:40pm",
      "content": "\\> There are many examples of soft rag in the ... print traditions of Western Europe   \n   \nLet's see some.   \nGutenberg's B42 was fully justified - a painting, not a book.   \n   \nAnyway, exceptions can be great, but I'm talking about the big picture:   \nFull justification is a primitive Enlightenment fetish that Modernism has now carved into our brains. Making nice, rigid rectangular blocks for their own sake (who cares about actual _reading_...) is the norm in the West now. And even though we have the technology to make wonderful soft rags (_without_ breaking words, but instead by using a pragmatic combination of word spacing, letterspacing, horizontal letterform scaling, ligatures and intelligent linebreaking) but instead we choose one or the other of the two extremes. Design fascism.   \n   \n\\> it was abandoned in favour of efficiency.   \n   \nYes, the same efficiency which desecrated the Arabic   \nscript when it came time to print Arabic newspapers...   \n   \n--   \n   \n\\> Bringhurst says that combining word spacing with ragged paragraphs puts the worst of both systems in a single text.   \n   \nWhich is why Bringhurst is a poet.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Nov 2003 — 6:21pm",
      "content": "_Full justification is a primitive Enlightenment fetish that Modernism has now carved into our brains._   \n   \nWell, which is it Hrant? Is it classical Roman absolutism? Is it mediaeval manuscript practice and incunabula printing? Is it enlightenment fetishism and modernist ideology?   \n   \nMost of the surviving Roman manuscripts I've seen are not justified; in fact, they are often models of the kind of soft rag you speak of so admiringly. So maybe you shouldn't blame the Romans.   \n   \nHow about the scriptorium monks of the Middle Ages? Yes, they're probably the guilty party, but they didn't abuse letter or word spacing to achieve their justification: they broke words with delightful lack of concern for 'hyphenation rules', and widened and compressed letterforms often with great sensitivity. So, yes, they justified text but they did it bloody well. And before you get hot under the collar about readability, please remember that reading in the Middle Ages meant reading _aloud_, not silent, immersive reading. Gutenberg also did justification with great sensitivity, and if you think the 42-line Bible is 'a painting, not a book' I suggest you find someone who will let you sit down and leaf through a copy: that, sir, is most definitely a book.   \n   \nThe so-called Enlightenment? Okay, now we're beginning to see some pretty bad justification, but we're also seeing looser letterspacing generally, and other problems. So perhaps this is indeed where your scorn should land.   \n   \nModernism? Oh, the irony: modernists, the ideological champions of ragged-right typography, the scourge of the justified text, blamed for making justified texts the norm.   \n   \n   \n_who cares about actual_ reading...   \n   \nIn case you havn't noticed, Hrant, people have been reading fully justified texts fully well for _hundreds of years_. You continue to treat reading as if it were some incredibly fragile, difficult to achieve thing. It's not: it's incredibly robust and ready for just about anything that bad typographers can throw at it. This is not to say that we should accept bad typography and not try to do better, but suggesting that justified text is somehow unreadable is irrational in the face of so many centuries of reading.\n\n"
    },
    {
      "time": "1 Nov 2003 — 6:39pm",
      "content": "I never understood why Adobe didn't combined Multiple-Master fonts with Zapf\n\n"
    },
    {
      "time": "1 Nov 2003 — 11:42pm",
      "content": "Kyle,   \n   \nI am having troubles with the server. I have exceeded my memory limit. Spire, my web hoster has no plan that can accomodate the size.   \n   \nThey have given me enough room until I can move on.   \n   \nI am hoping for no more interruptions. Dream on.\n\n"
    },
    {
      "time": "2 Nov 2003 — 2:13am",
      "content": "John,   \n   \n\"Bringhurst says that combining word spacing with ragged paragraphs puts the worst of both systems in a single text.\"   \n......   \n   \nYour examples.   \n   \nThis is   \nthe difference   \nbetween   \nthis   \n   \nand the   \nmore even   \nrag seen   \nin this   \nexample   \n   \nI worry that some viewing your illustration may be misled into thinking you are illustrating Gill's theory. It does not deal with the\n\n"
    },
    {
      "time": "2 Nov 2003 — 11:47am",
      "content": "Yes, I have read some of Bringhurst's poetry, and most of his published translations from the Haida. Of his own poems, I particularly like _The Stonecutter's Horses_.\n\n"
    },
    {
      "time": "2 Nov 2003 — 12:14pm",
      "content": "Bill,   \n   \nAdobe certainly considered using MM technology in this fashion. There are a couple of key problems with it, however. First, the width axis setting of an MM font is not predictably deterministic in its effect on the width of a line. The programming difficulty and performance penalty of having to deal with each glyph's continuously variable degrees of expansion/contraction would have both been huge. Performance in interaction with the paragraph composer would have been a real problem.   \n   \nTechnical difficulties aside, how many MM serifed text typefaces were made with a width axis? Kepler was one. Minion had a mild width axis, but only in one direction (more condensed than regular). There were probably others, but I can't think of them offhand.   \n   \nAll of this is sort of moot, of course, since Adobe made the decision to stop doing MMs around the same time that InDesign 1.0 was finishing development.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "2 Nov 2003 — 1:59pm",
      "content": "Yes, Eric Menninga explained some of this to me in Vancouver. To expand a little on what Thomas described, for those who didn't immediately catch the implications (as I didn't at first):   \n   \nAny given glyph will vary by a different amount when widened according to an intelligent, MM-based scheme (as opposed to wholesale percentage scaling) -- for instance, the change in an 'm' is going to be proportionately greater than that of an 'i' (which wouldn't really widen much, if at all).   \n   \nYou can't simply determine that a given line is 96% of the full line length and then just expand it 104.1667% (as you would with brute, horizontal scaling). (Which, by the way, I think was a foolish, misleading, and mistaken feature to include in InDesign.)   \n   \nA change in width axis will have a greater effect on a seven-letter word like \"mammals\" than, say, \"fillies.\" When attempting to justify a line with intelligent width expansion, the amount of adjustment will be highly dependent upon the specific individual characters in each line.   \n   \nCalculating the overall width setting on an MM axis for any given line, determined by all the interrelated variations of each of the characters in the line, would, as Thomas says, take too much of a toll on performance.   \n   \nI hope this explanation makes sense and is helpful.   \n   \n-- K.\n\n"
    },
    {
      "time": "2 Nov 2003 — 3:19pm",
      "content": "I notice that in the InDesign manual they say that the glyph scaling will help with say - or + 2% with the 'single line composer' but that this may not help with the 'Paragraph Composer.'   \n   \nIs the 'paragraph composer' a sufficient benefit that there is no point is using the 'glyph scaling'?   \n   \nHas anyone tested out these options and has an opinion on when, if at all the glyph scaling is useful? Are you saying that it is always pointless or harmful, Kent?\n\n"
    },
    {
      "time": "2 Nov 2003 — 11:21pm",
      "content": "Kyle, he talks about word space (but we can assume he does for letter spacing too) when setting ragged paragraphs.\n\n"
    },
    {
      "time": "2 Nov 2003 — 11:24pm",
      "content": "Ups !!\n\n"
    },
    {
      "time": "3 Nov 2003 — 7:04am",
      "content": "Thomas and Kent,   \n   \nI've posed similar questions a number of times in different forums, and never been given a satisfactory answer. Thank you both for clarifying the complexities. I had not taken into account the difference in proportional change between different families of glyphs, but now that you\n\n"
    },
    {
      "time": "3 Nov 2003 — 7:46am",
      "content": "\"Zapf\n\n"
    },
    {
      "time": "3 Nov 2003 — 7:59am",
      "content": "_Why would anyone wish to modify a letterform in order to rag right type?_    \n   \nTo improve the rag without resorting to hyphenation?   \n   \nMost people think of text as either justified or unjustified, but in a different conceptual and potential software model ragged right text could also be considered justified. What we typically think of as fully justified text is text that is justified to a fixed margin. If you care about what the rag of 'unjustified' text looks like, then I would argue that you are interested in justifying it, but justifying it _to a variable margin_. In effect, you are saying, 'I want a rag, but I don't want the rag to fall outside this range, i.e. no lines should be shorter than the distance X from the story margin'. This is justified text, because you are not simply lining up the letters one after another and letting the rag fall where it will: you are doing the work of deciding what the rag should look like. Justification by works ![:-)](http://web.archive.org/web/20150328232529im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "3 Nov 2003 — 8:20am",
      "content": "If you don't like ragged type\n\n"
    },
    {
      "time": "3 Nov 2003 — 9:10am",
      "content": "I'm not poking fun of anyone. I'm saying that there are different kinds of rags -- basically, tidy rags and messy rags -- and that there are several possible approaches to making a tidy rag. A messy rag is one in which you have some lines that are much shorter or longer than average. A tidy rag is one in which all the lines fall within a fairly narrow range.   \n   \nAs regards 'rubber type', you're saying that Gutenberg and Zapf belong in rubber rooms? You may be right, but I'm interested enough in their results to give them the benefit of the doubt.\n\n"
    },
    {
      "time": "3 Nov 2003 — 9:28am",
      "content": "We don't know why Gutenberg was doing what with, or what for. Only that he was inventing systems and running a deficit doing so.   \n   \nWhich is a question of great discussion. As you probably know he probably did not print from hand set type.   \n   \nBut last I heard his type was not made of rubber.   \n   \nAs far as messy rags vs tidy rags does this mean you like Eric Gills tidy rags? Perhaps that man could have used some time-out in a rubber room.\n\n"
    },
    {
      "time": "3 Nov 2003 — 9:41am",
      "content": "John,   \n   \nI can't seem to find any great book designs by Herman Zapf. Do you have a URL, or could you post an example. Particularly a fine book with the rubber type and tidy rag.\n\n"
    },
    {
      "time": "3 Nov 2003 — 10:11am",
      "content": "\\> Well, which is it Hrant?   \n   \nIt's convenient being so literal, isn't it?   \n   \nI'm talking about the undercurrent, not exactly how the Romans justified their paragraphs, not what Copernicus discovered, and not what Bayer [thought he] liked. There's a consistent stream running through history since the Romans:   \n   \nThe Romans \"borrowed\" the Greek culture to create the bulk of their own, but they didn't inherit any of their wonderful pragmatism\\*. The Romans -being imperialists- were driven by Order and Formality, a desire to _control_ (as opposed to the Greek desire to _understand_). This translated to the desire to control Nature during the Enlightenment, and in the microcosm of typography Modernism turned this into nice rectangular blocks.   \n   \n\\* That's why Rome is when Western Culture really started - Greece was a hybrid/transit between East and West. The Ancient Greeks would cry laughing at the way the cornerstone they laid was used to bludgeon instead of build.   \n   \nThe point isn't how little justified or ragged paragraphs affect readability (I agree it's not qualitatively very relevant), it's what's _under_ them: the desire for superficial control, versus the desire for true harmony, which is never absolute. This is paralleled for example in the thought that all single letters are critical in reading (because that makes it more controlled), versus the reality that reading is an extremely heurtistic, nebulous activity. It is also paralleled in the imposition of identical vertical proportions in Latin/Cyrillic type design: it _looks_ better on the surface, but in truth it is a violation of functionality. And it is also paralleled in religious fundamentalism; the Talibaan are much more Western than they think!   \n   \nThe Romans were much more superficial than the Greeks, and we're still paying for it, in typography, politics, and everything in between.   \n   \n--   \n   \n\\> If you don't like ragged type\n\n"
    },
    {
      "time": "3 Nov 2003 — 10:24am",
      "content": "Little-known fact: InDesign's paragraph composer softens the rag on ragged type, compared to a single-line composer. It will use hyphenation and line break choices to do this, much as it does for fully-justified text.   \n   \nT\n\n"
    },
    {
      "time": "3 Nov 2003 — 10:34am",
      "content": "Thomas and John,   \n   \nWhen the \"rubber meets the road\" where does it leave ligatures?   \n   \nStill don't know why no one has asked about my self tracking ligature invention.\n\n"
    },
    {
      "time": "3 Nov 2003 — 11:01am",
      "content": "Hrant,   \n   \n\"\\> If you don't like ragged type\n\n"
    },
    {
      "time": "3 Nov 2003 — 3:09pm",
      "content": "Gerald,   \n   \nYes, I saw that the topic was about setting ragged type. I stretched a bit beyond that, as many other threads seem to do here, to ask about how a specific bit of technology might have worked with a near defunct font format in setting type. Admittedly, my reference was pretty obscure, but some people here knew exactly what I was talking about.\n\n"
    },
    {
      "time": "3 Nov 2003 — 5:32pm",
      "content": "Thanks for the smile Tiffany, I e-mailed a few recipes to you. Due to the risk of being tarred and feathered for off topic posting, I'll not start a new thread here. :^)\n\n"
    },
    {
      "time": "4 Nov 2003 — 12:26am",
      "content": "Bill,   \n   \nNo doubt about it. Small measures need big solutions. What happens to the ligatures?\n\n"
    },
    {
      "time": "4 Nov 2003 — 1:08am",
      "content": "Yes, Adobe has a license to (or maybe owns, I'm not sure) the HZ technology.   \n   \nInDesign is using a variant of this, but since the glyph scaling in InDesign does not preserve stroke weight, it is of much more limited use. Some folks wouldn't use it at all, and those who do use it restrict it to just a couple of percentage points in either direction.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "4 Nov 2003 — 2:08am",
      "content": "Thomas,   \n   \nCan I presume I may not be ecstatic with this technology setting fine books?\n\n"
    },
    {
      "time": "4 Nov 2003 — 12:21pm",
      "content": "Ecstatic or elastic. Take your pick. ![:-)](http://web.archive.org/web/20150328232529im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "4 Nov 2003 — 12:51pm",
      "content": "Ok John,   \n   \nWhere do you get those smiley guys?   \n   \nI noticed you use italics when you quote. How do you do that?   \n   \nYou got all the tricks.\n\n"
    },
    {
      "time": "4 Nov 2003 — 1:30pm",
      "content": "You get a smily by typing : followed immediately by ) with a space on either side.   \n   \n: + ) = ![:-)](http://web.archive.org/web/20150328232529im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nFor italic you can put \\<i\\> at the beginning of italicise text and \\</i\\> at the end. This is oldfashioned HTML tagging.   \n   \nDoes anyone know if there is a Typophile formatting guide anywhere?\n\n"
    },
    {
      "time": "5 Nov 2003 — 12:40am",
      "content": "[http://www.typophile.com/cgibin/discus.pl?pg=formatting](http://web.archive.org/web/20150328232529/http:/www.typophile.com/cgibin/discus.pl?pg=formatting)\n\n"
    },
    {
      "time": "5 Nov 2003 — 1:34am",
      "content": "NOW YOU GUYS ARE IN TROUBLE   \n   \n_oops_   \n   \n**right on dude**\n\n"
    },
    {
      "time": "5 Nov 2003 — 1:40am",
      "content": "READING GLASS EXEMPT ZONE\n\n"
    },
    {
      "time": "5 Nov 2003 — 1:52am",
      "content": "Gerald Giampa   \n   \nBoy my name looks good in Greek. I wonder if there are any greekophones typophiles here?   \n   \nMan do I look educated or what? My mom is going to be so proud.\n\n"
    },
    {
      "time": "5 Nov 2003 — 9:24am",
      "content": "Aha! If typophile continues to specify type size in fixed pixels, at least I can make my own messages display at a readable size. Is there any way to control leading?\n\n"
    },
    {
      "time": "5 Nov 2003 — 1:15pm",
      "content": "What's John up to now? Little devil, I'm going to have to keep an eye on that boy.\n\n"
    },
    {
      "time": "5 Nov 2003 — 6:56pm",
      "content": "I've put together a few rough samples of how I envision using glyphs with a horizontal scaling factor would work. I\n\n"
    }
  ]
}
