{
  "id": "18216",
  "title": "Okkervil River CD Artwork - Century Expanded (?)",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Heya,\n\nCheck out this awesome typesetting on Okkervil River’s ‘Black Sheep Boy’\n\nI’m pretty sure the face is Century Expanded  \n [http://www.linotype.com/12811/centuryexpandedroman-font.html#more](http://web.archive.org/web/20060519021530/http:/www.linotype.com/12811/centuryexpandedroman-font.html#more)\n\nAnd it looks like it has a custom double keyline that i guess the designer drew by hand.  \nAnyone got any good ideas on how to do this?\n\nI had a crack at converting to outlines, expanding the path then adjusting beziers around the serifs and fine detail, but this was fairly time consuming, and not entirely accurate (really difficult to get uniform spacing between each keyline. (i was using Adobe Illustrator btw.)\n\nAnyone got any ideas on how to do this?  \nAnd who can confirm it is in fact Century Expanded?\n\nCheers - Jonny\n\n| Attachment | Size |\n| --- | --- |\n| [okkervil\\_doubleKeyline.jpg](http://web.archive.org/web/20060519021530/http:/typophile.com/files/okkervil_doubleKeyline.jpg) | 58.17 KB |\n\n",
  "author": "<a href=\"user/11331\" title=\"View user profile.\">JonnySchneider</a>",
  "time": "<br>",
  "uid": "11331",
  "comments": [
    {
      "time": " 26 February, 2006 - 5:45pm",
      "content": "The trick is to outline the type with different stroke widths. The original type is plain white with no stroke. Copy and Paste in Back, then apply a 1 point black stroke. Copy and Paste in Back, then apply a 2 point white stroke. Copy and Paste in Back, then apply a 3 point black stroke. Copy and Paste in Back, then apply a 4 point white stroke.\n\nTry different stroke widths for finetuning the effect.\n\n"
    },
    {
      "time": " 26 February, 2006 - 6:30pm",
      "content": "Comparing the Okkervil River at the top of the sample with Centry Expanded it doesn’t quite match. The serifs are more round in Century. Looks like Clarendon is a match to me.\n\nNice easy Illustrator tutorial Yves def the fastest way to do that technique is by applying stroke.\n\n"
    },
    {
      "time": " 26 February, 2006 - 8:48pm",
      "content": "metafourik - Right you are. I noticed that too, but couldnt find anything with slabbier serifs (didnt see clarendon). Cheers!\n\nBaldCondensed - Of course! How easy is that. See, i jibes me that Illustrator’s stroking can be messy - it strokes the centre of the path, there isnt control to stroke inside or outside like you can on a selection with PSD. But what an easy solution: whack an unstroked layer of text over the top, which goes over the top of the messy interior stroking that always screws the form of glyphs up. Problem solved. Cheers!\n\n"
    },
    {
      "time": " 26 February, 2006 - 9:04pm",
      "content": "There is [expanded stroke options](http://web.archive.org/web/20060519021530/http:/www.adobe.com/products/illustrator/newfeatures.html#nf7) in Illustrator CS2: You can stroke inside the path, stroke evenly on both sides of the path, or you can apply the stroke on the outside of the path. When I saw the new stroke options in CS2, I was like THANK YOU Adobe, and then I was like wait…YOUR WELCOME for the $$$ I had to spend for new stroke options.\n\n"
    },
    {
      "time": " 28 February, 2006 - 8:07pm",
      "content": "In CorelDraw there is a tool called “Contour” that can produce any number of outlines (or inlines) as separate vector shapes behind the original text. This feature has been around since at least version 8 (which I have).\n\n- Lex\n\n"
    },
    {
      "time": " 28 February, 2006 - 8:35pm",
      "content": "Using the **appearance** feature/panel in Illustrator you can very easily create this effect with a single setting. Putting the stroke(s) behind and in front of the fill layer.\n\n"
    },
    {
      "time": " 1 March, 2006 - 2:30am",
      "content": "You can tell I grew up with Adobe Illustrator 3. :^D\n\n"
    },
    {
      "time": " 1 March, 2006 - 3:11am",
      "content": "By the way, to use the **appearance** panel, you’ll have to outline the type before you can add another stroke, correct me of I’m mistaken. :)\n\n"
    },
    {
      "time": " 1 March, 2006 - 9:53am",
      "content": "Geoff you are mistaken. :^)\n\n"
    }
  ]
}
