{
  "id": "18212",
  "title": "\"I found a font\" - attestable?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "While it is easy to find attestable quotations for the use of the nouns \"type foundry, foundry type, type founder, type founding, etc.\", it seems to me that the verb \"to found\" is a ghost word in modern English dictionaries.\n\nDoes anyone know whether the English verb \"to found\" included in almost all modern British and American dictionaries WITHOUT the caveat \"dated, archaic, etc.\" and usually defined as \"to melt lead and pour into a mold; to cast foundry type, etc.\" has ever been used during the past two centuries?\n\nCan anyone supply attested quotations for the verb \"to found\" from any book on or by type-foundries published during the past 200 years?\n\n",
  "author": "Uli",
  "time": "26 Feb 2006 — 5:44am",
  "uid": "11274",
  "comments": [
    {
      "time": "26 Feb 2006 — 6:10am",
      "content": "I think the etymo is French, \"fonte\" (thaw).\n\n"
    },
    {
      "time": "26 Feb 2006 — 7:27am",
      "content": "From the online Oxford Dictionary which comes installed with OS X:\n\n----\n\n**found** 2 verb [trans.]\n\n1 establish or originate (an institution or organization), esp. by providing an endowment : _the monastery was founded in 1665_ | [as adj.] ( **founding** ) _the three founding partners._  \n• plan and begin the building of (a town or colony).\n\n2 (usu. **be founded on/upon** ) construct or base (a principle or other abstract thing) according to a particular principle or grounds : _a society founded on the highest principles of religion and education._   \n• (of a thing) serve as a basis for : _the company's fortunes are founded on its minerals business._\n\nORIGIN Middle English : from Old French **_fonder_** , from Latin **_fundare_** , from **_fundus ‘bottom, base.’_**\n\n**found** 3 verb [trans.]\n\nmelt and mold (metal).  \n• fuse (materials) to make glass.  \n• make (an article) by melting and molding metal.\n\nORIGIN early 16th cent. : from French **_fondre_** , from Latin **_fundere ‘melt, pour.’_**\n\n----\n\nNothing about it being an archaic word, although these are the 2nd and 3rd senses--the first being found as in \"I found a penny!\" (although you could mean sense 3 in this case).\n\n"
    },
    {
      "time": "26 Feb 2006 — 9:06am",
      "content": "\\> From the online Oxford Dictionary which comes installed with OS X:\n\nThe great 20-volume Oxford English Dictionary has this attested quotation:\n\n1672 Marvell Reh. Transp. i. 6:  \n\"Lead, when moulded into Bullets, is not so mortal as when \\*founded\\* into Letters!\"\n\nHere \\*founded\\* was definitely used in the sense of \"to cast, to melt\"\n\nBut the question is whether \"to found\" (meaning: to cast) was still used in the centuries after 1672. Any later quotations from any books on typefoundries, typesetting etc. would be appreciated.\n\n"
    },
    {
      "time": "26 Feb 2006 — 9:16pm",
      "content": "Um, I've no quotations... However: my trusty, dog-eared copy of _Webster's_ (copyright 1986), which could be called archaic, :-) does not use that qualifier when refering to **found** (just as Mark says about the online _Oxford Dictionary_).\n\nAlso, _Webster's_ uses the verb **found** in this entry:\n\n4 **founder** _n_ (ca. 1547): one that _ **founds** _ metal; _specif_: TYPEFOUNDER\n\n"
    },
    {
      "time": "27 Feb 2006 — 10:14pm",
      "content": "\\> \"Lead, when moulded into Bullets, is not so mortal as when founded into Letters!\"\n\nNice! But... does it mean that Bullets have shorter lives than Letters, or that Letters are deadlier than Bullets? Both seem true.\n\ns'marks\n\n"
    },
    {
      "time": "28 Feb 2006 — 1:23am",
      "content": "I am surprised that none of the members of this American Typophile website knows whether the verb \"to found\" has been used by type founders during the past two centuries.\n\nIf English were my mother tongue, I would not have asked.  \nIf English were my mother tongue, I would have known the answer.\n\nThe French think that many / most / all Americans are superficial:\n\n1st degree stereotype: « Les Américains sont trop superficiels »  \n2nd degree stereotype: « TOUS les Américains sont superficiels »  \n3rd degree stereotype: « Quelle bande de cons ces Ricains! »\n\nConsidering that the American members of this Typophile website constantly talk about type foundries and about type founders and about the American Type Founders (e.g. a few hours ago at this thread: [http://typophile.com/node/18179](http://web.archive.org/web/20131018014927/http:/typophile.com/node/18179 \"http://typophile.com/node/18179\")), I wonder how I am to describe the fact that none of these typophiles (really ?) knows whether the verb \"to found\" was ever used by the American Type Founders (ATF). Should I describe this as \"odd\" or as \"strange\", or should I say:\n\n« Quelle bande de cons ces Ricains! »\n\n"
    },
    {
      "time": "28 Feb 2006 — 3:49am",
      "content": "_If English were my mother tongue, I would have known the answer._ Bollocks  \nTim\n\n"
    },
    {
      "time": "28 Feb 2006 — 9:10am",
      "content": "Very few Typophile members (including type designers) have experience with actual type founding. Not all Americans who are knowledgeable about the history typefounding are Typophile members.\n\nI can tell you that the verb \"to found\" is not in common usage among contemporary type designers, even though it is common to speak of \"digital type foundries,\" a usage which is simply metaphorical. Nowadays, you \"design\" or \"develop\" or \"generate\" a font, you don't found it; there is no molten metal involved anymore. If \"to found\" is not archaic yet, it is on its way, at least in regards to type.\n\n"
    },
    {
      "time": "28 Feb 2006 — 10:18am",
      "content": "You know there's a stereotype that the Franch are arrogant, too? :-)\n\n"
    },
    {
      "time": "28 Feb 2006 — 10:35am",
      "content": "Elliott, I think Uli is German, but let's not descend to stereotypes.  \nTim\n\n"
    },
    {
      "time": "2 Mar 2006 — 1:53pm",
      "content": "Uli, you need a course in sociolinguistics. And manners.\n\nContemporary experts in any field may be excused, I think, for not being able to trot out an instant repertoire of specific \"attestable quotations\" that include a rare and archaic word which happens to have some etymological connection to other words in the field in which they practice their expertise.\n\nAnd posing a question, then expressing \"surprise\" about not getting an immmediate and satisfying answer, as well as rehearsing for us your stereotypes of \"Americans,\" is just bad manners.\n\nBefore your obnoxious second note, I'd have been happy at least to look around to help you out. Now, I'd just say: go research it yourself.\n\n"
    },
    {
      "time": "2 Mar 2006 — 3:45pm",
      "content": "\\> Uli, you need a course in sociolinguistics. And manners.\n\nI retort:\n\njlg4104, you need a course in linguistics. And in lexicography.\n\nThe current 11th edition of \"Webster's Collegiate Dictionary\" and also \"Webster's Third New International Dictionary\" use two temporal labels:\n\n- \"obsolete\" means that there is no evidence of use since 1755.  \n- \"archaic\" means that a word is found today only sporadically.\n\nThen Webster's defines:\n\n\"Words current in all regions of the U.S. have no label.\"\n\nThe verb \"to found (= to melt etc.)\" has no label.\n\nSo, \"to found\" is a verb \"current in all regions of the U.S.\".\n\nIt is neither obsolete nor archaic for Webster's lexicographers.\n\nBut there is not ONE American at Typophile who can give an attestable quotation for this verb which is \"current in all regions of the U.S.\"\n\n"
    },
    {
      "time": "2 Mar 2006 — 3:52pm",
      "content": "To second Mark's comments: there aren't a lot of practising type designers who have ever founded type. The technology is (practically) obsolete, and even printing techniques which can employ metal types can also employ plates created from digital files, which are far less time-consuming to create and whose results are more predictable.\n\nI don't have a copy of Updike to hand, so can't read through the section on 19th-century American foundries to find a citation for Uli. Perhaps there are members who can help Uli, but perhaps that number has dwindled to zero after s/he implied that all Americans are \"con\". As a Quebec-born U.S. resident, I'm completely uninclined to help Uli after s/he so berated and insulted my American friends.\n\n"
    },
    {
      "time": "2 Mar 2006 — 4:06pm",
      "content": "Even though I should be insulted.\n\n[edit. stooping isn't attractive.]\n\nIn regards to found as verb, and this is from memory, but I think they used the term \"cutting\" and not \"founding\" in regards to the creation of typefaces.\n\nWhat is your bibliography so far?\n\n"
    },
    {
      "time": "3 Mar 2006 — 1:55am",
      "content": "I have found a quote with found used with this meaning but in the bell founding business.  \nTim\n\n"
    },
    {
      "time": "3 Mar 2006 — 2:58am",
      "content": "1.  \nI only quoted what the French think about Americans. I am not a Frenchman.\n\n2.  \nHot-metall typesetting is not as old as some youngsters may think. For instance, Linotype discontinued the production of its hot-metall typesetting machines as of 1st January 1977. That is less than 30 years ago.\n\n3.  \nAn answer to the usage of the verb \"to found\" might be given by the type founders who established these new type foundries:\n\nP22 Type Foundry  \nProcess Type Foundry  \nPSY/OPS Type Foundry  \nShinn Type Foundry  \nSkyline Type Foundry  \nStone Type Foundry  \nStorm Type Foundry  \nT.26 Type Foundry  \nUnderware Type Foundry\n\nAt least theoretically, it could be within the realm of possibility that one of these type founders who established the above type foundries might have pondered about the usage of the expression \"to found type\".\n\n"
    },
    {
      "time": "3 Mar 2006 — 5:44am",
      "content": "Uli, the verb will not often be used in its simple transitive form because it applies ambiguously to the sequence of processes involved in making type. The normal word for the pouring of metal into matrices is casting. But Updike writes of \"type-founding\" (PT 2nd ed II.247), so does Goudy (at the very start of Typologia), and a search for \"type-founding\" gives lots more references.\n\n"
    },
    {
      "time": "3 Mar 2006 — 8:09am",
      "content": "_P22 Type Foundry  \nProcess Type Foundry  \nPSY/OPS Type Foundry  \nShinn Type Foundry_ -- Canada  \n_Skyline Type Foundry  \nStone Type Foundry  \nStorm Type Foundry_ -- Czech Republic  \n_T.26 Type Foundry  \nUnderware Type Foundry_ -- Netherlands\n\nFYI: Only six of those are American. Only one actually casts metal type.\n\nFWIW, I think you're right that \"to found\" has become archaic and is no longer used by English speakers with regard to type.\n\n"
    },
    {
      "time": "3 Mar 2006 — 9:42am",
      "content": "There are a lot of people named \"Smith\" who have never made horseshoes.\n\n\"Type Foundry\" is understood by members of the design community to mean a company which publishes typeface designs, usually in digital form because 99% of the customers for these typeface designs are working on computers. It's one of those instances of the original source of a word getting lost to most users of the word; they don't know where the term comes from but they continue to use it.\n\n"
    },
    {
      "time": "3 Mar 2006 — 11:46pm",
      "content": "And I counter-retort: Dictionaries are sprawling, decades-long projects and often include entries that are out of date. They attempt to describe (not PREscribe) the uses of various lexical items. You have a \"Webster's\" that says \"to found\" is \"current in all regions of the U.S.\" Guess what! Your Webster's is WRONG. IT IS INCORRECT. I've lived in several regions of the U.S.; it's never come up in any conversation I recall, nor, for that matter, in any book I've read (and please don't challenge my literacy on that count, thank you very much).\n\nMoreover, if you'd taken your courses in linguistics, you'd know that texts sometimes to use \"metadiscourse\" to explain what they are doing with their own words. That is PRECISELY WHY your Webster's provides a clarification of how they are using \"archaic\" and \"obsolete\"-- in common discourse, we don't use them quite the way Webster's does. And that is FINE. As any linguist would tell you.\n\nNow, back to the matter at hand: you posed a question. You got some responses from people TRYING TO ASSIST YOU. And you hurled an insult instead of gratitude, simply because their answers somehow confounded your preconceived notion of what you'd expect to learn. That, again, is BAD MANNERS. And, for your own sake, it's impractical, because it simply results in people responding as I am now: not with help, but with rants that amount to: bite me. This cockamamie politics of etymology would perhaps impress a third-rate 19th-century philologist but does absolutely nothing for me.\n\n"
    },
    {
      "time": "4 Mar 2006 — 10:37am",
      "content": "\\> Your Webster’s is WRONG. IT IS INCORRECT.\n\nYour? They were made by American linguists, not by me.\n\nBut I am pleased that you admit that American Webster's dictionaries are incorrect. If a non-American had stated this fact, you would have accused him of \"bad manners\".\n\nFor those who happen to be acquainted with Sanskrit, Greek or Latin, I uploaded a document explaining the etymology of the noun \"font\":\n\nSee [http://www.sanskritweb.net/fontdocs/font.pdf](http://web.archive.org/web/20131018014927/http:/www.sanskritweb.net/fontdocs/font.pdf \"http://www.sanskritweb.net/fontdocs/font.pdf\")\n\nThe linguistic layman, Mr. jlg4104, who is not familiar with Sanskrit etc., had better not download this file.\n\nIncidentally, the word \"typophile\", formerly spelt \"typophil\", is attested since at least 1889 (Pall Mall G.16 Feb.1/2: \"Two publications which will receive and deserve the attention of all typophils\").\n\n"
    },
    {
      "time": "4 Mar 2006 — 11:14am",
      "content": "Surely a typophil is a person involved in the typographic arts whose name also happens to be Phil, such as Phil Baines. Who might also be an œnophil, like Prince Philip, the royal consort.\n\n"
    },
    {
      "time": "4 Mar 2006 — 2:29pm",
      "content": "_\\> Your Webster’s is WRONG. IT IS INCORRECT._\n\nYour? They were made by American linguists, not by me.\n\nThis is getting silly. Uli, are you intentionally trying to drive people mad here? I'm sure he used \"your Webster's\" to mean \"the copy of Webster's in your possession.\" It's fairly common usage in English.\n\n"
    },
    {
      "time": "4 Mar 2006 — 8:01pm",
      "content": "Uli,\n\nMark is right. This is getting silly. Now, I will refrain from haranguing you, which is, no matter what the prompting, somewhat rude of me I suppose. I will ask, based on the quotes from your own notes below, WHY ARE YOU ASKING about this point of a specific term's historical usage? Based on the quotes below, it looks like you want to know if we (Americans?) know of the word \"to found\" being used in the specific way you've mentioned, in specific texts. Clearly, WE DON'T. And we've supplied that point with the caveat that we MAY NOT BE ABLE TO BECAUSE THE WORD ISN'T USED much in that sense, nor HAS IT EVER, as far as we know. In fact, you make this point yourself:\n\n\"While it is easy to find attestable quotations for the use of the nouns “type foundry, foundry type, type founder, type founding, etc.”, it seems to me that the verb “to found” is a ghost word in modern English dictionaries.\"\n\nBINGO. There is your answer! And, given the quoted material below, it sounds like you've done more research than any of us on this topic anyway.\n\nWhich leaves me wondering, again, WHY are you asking this? Are you trying to get somebody to dig up old archival materials that might contain the word you seek and then to supply you with chapter and page number? That's an awfully bold request, if so. Or, are you just trying to find out how the word has been used historically, for some research project you've not yet mentioned? If so, just TELL US WHY this project is important and interesting. Maybe it'll jog somebody's memory or inspire somebody to help out. In the meantime, I am simply baffled by your attitude, since you seem already to have ASKED AND ANSWERED YOUR OWN QUESTION.\n\n- jlg4104, \"layman linguist\" (haha)\n\nULI WROTE:\n\n\"Can anyone supply attested quotations for the verb “to found” from any book on or by type-foundries published during the past 200 years?\"\n\n\"P22 Type Foundry  \nProcess Type Foundry  \nPSY/OPS Type Foundry  \nShinn Type Foundry  \nSkyline Type Foundry  \nStone Type Foundry  \nStorm Type Foundry  \nT.26 Type Foundry  \nUnderware Type Foundry\n\nAt least theoretically, it could be within the realm of possibility that one of these type founders who established the above type foundries might have pondered about the usage of the expression 'to found type.'\"\n\n"
    },
    {
      "time": "5 Mar 2006 — 3:25am",
      "content": "[http://www.british-history.ac.uk/report.asp?compid=22176&strquery=type%2...](http://web.archive.org/web/20131018014927/http:/www.british-history.ac.uk/report.asp?compid=22176&strquery=type%20founding \"http://www.british-history.ac.uk/report.asp?compid=22176&strquery=type%20founding\")\n\n_A History of the County of Middlesex: Volume 2 - General; Ashford, East Bedfont with Hatton, Feltham, Hampton with Hampton Wick, Hanworth, Laleham, Littleton  \nWilliam Page (Editor) (1911)_    \nparagraph 4 and others  \nthe other appearances of _found_ in the precis probably explain why it is rarely used.\n\nBut as I have said it seems to be more prevalent in the bell industry  \n [http://www.russianbells.com/history/history2.html](http://web.archive.org/web/20131018014927/http:/www.russianbells.com/history/history2.html \"http://www.russianbells.com/history/history2.html\")\n\n[http://www.livinggloucester.co.uk/made/bell\\_founding/origins\\_of\\_bell\\_fou...](http://web.archive.org/web/20131018014927/http:/www.livinggloucester.co.uk/made/bell_founding/origins_of_bell_founding/ \"http://www.livinggloucester.co.uk/made/bell\\_founding/origins\\_of\\_bell\\_founding/\")\n\nand the glass industry  \n [http://www.emek-ua.com/en/production/specialpurity/specialpurity\\_318.html](http://web.archive.org/web/20131018014927/http:/www.emek-ua.com/en/production/specialpurity/specialpurity_318.html \"http://www.emek-ua.com/en/production/specialpurity/specialpurity\\_318.html\")\n\nyou could always google you know  \n [http://www.google.com/search?hl=en&lr=&client=safari&rls=en&q=type-found...](http://web.archive.org/web/20131018014927/http:/www.google.com/search?hl=en&lr=&client=safari&rls=en&q=type-founding&btnG=Search \"http://www.google.com/search?hl=en&lr=&client=safari&rls=en&q=type-founding&btnG=Search\")\n\nIn conclusion it would seem that Webster's is not wrong just not specific enough about your subject.\n\nBTW _1. I only quoted what the French think about Americans. I am not a Frenchman._  \nThat is not an excuse and you know it.\n\nTim\n\n"
    },
    {
      "time": "5 Mar 2006 — 7:59am",
      "content": "Great stuff, Tim. Those are some great references.\n\nThank you.\n\n"
    },
    {
      "time": "5 Mar 2006 — 8:45am",
      "content": "\\> A History of the County of Middlesex, Volume 2... 1911:\n\n\"He \\*founded\\* his own types, which were of beautiful design\"\n\nThanks, Tim. That settles it. Thanks again.\n\nFor the next few days, I will forget linguistics, since several files of American torture and concentration camps have just been published:\n\n[http://www.defenselink.mil/pubs/foi/detainees/csrt/index.html](http://web.archive.org/web/20131018014927/http:/www.defenselink.mil/pubs/foi/detainees/csrt/index.html \"http://www.defenselink.mil/pubs/foi/detainees/csrt/index.html\")\n\nI have just read a \"Detainee Statement\" of a boy who was about 10 years old when he was kidnapped by Americans and who is now 13 years old and who made this statement to a concentration camp officer whose name has been blackened:\n\n\"I made a mistake because I left home to see my brother. If you want to punish me; it's enough because I have been here three years. I lost my school. I am far from my family my sisters and my brothers. I lost three years here. Please look at my age and I want to go to my life. That's it all I have to say.\"\n\nConsidering that Americans run concentration camps, where school kids are detained and tortured for many years and are never allowed to see any lawyer or judge, makes it understandable why the French do not approve of \"Ricains\".\n\n"
    },
    {
      "time": "5 Mar 2006 — 10:49am",
      "content": "Dear typophile community, I'd like you to do some bibliographic research for me. You scum. Thanks, and make it snappy. (You scum.)\n\n"
    },
    {
      "time": "5 Mar 2006 — 11:00am",
      "content": "OK, Chester, I'd be happy to. We scum just jump at the chance to help those who call us names. Even if we are appauled by some of the actions of our current government, we happily drop everything in our lives to help the people that insult us most so you better start calling us names worse than scum or your request will be put on the bottom of the pile. ;-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Mar 2006 — 12:59pm",
      "content": "You know what the Papuans call Americans, right? \"Olu laak, ohu k'waanai.\" I'm not saying I agree with them, I'm just letting you know. You scum.\n\n"
    },
    {
      "time": "6 Mar 2006 — 2:51am",
      "content": "Uli,  \nI have to say that I am disappointed, I was prepared to give you a chance to apologise for insulting many of the habituées and the creators and maintainers of these forums. Your petulance and plain bad manners make me wish I had not posted those references and I will not help you again, I hope that they are of interest to any other visitors.  \nThe references I found were the work of about 20 minutes, a bit of imagination and a search engine, I would prefer it if you actually do your own work from now on and incubate your hatred in your own dark corner. Disguising your own prejudices behind your take on French opinion is disgusting cowardice.  \nTim\n\n"
    },
    {
      "time": "6 Mar 2006 — 10:14am",
      "content": "When I started my font publishing business (aka \"foundry\") in 1999, I tried hard to think up a clever name like \"Device\" \"Sysops\" or \"Virus\", but being the vain unimaginative fellow I am, settled on ShinnType. The full legal name is Shinn Type Foundry Inc., which is in my distributor contracts, so some of them end up billing (now there's an old printing term I'm perpetuating) me as \"Shinn Type Foundry\", although it's really only appropriate for legal documents, which tend to be somewhat archaic.\n\nI never found fonts. For the same reason that although I scroll when I surf, it's pages that I look at, and I never get my feet wet.\n\nThere is one frequent contemporary usage of \"found\" as a verb, as a past participle relating to the establishment of a business. This archaic usage has persisted because of the tag-line that indicates a comapany is no fly-by-night outfit, and \"founded in 1999\" is a permanent statement.\n\n"
    },
    {
      "time": "6 Mar 2006 — 10:24am",
      "content": "\"indicates a comapany is no fly-by-night outfit, and “founded in 1999”'\n\nSo then it is not a new found thing? :-)\n\nChrisL\n\n"
    },
    {
      "time": "6 Mar 2006 — 11:43am",
      "content": "Nothing I can do about blind, raging, paranoid, bizarre, unFOUNDED anti-American rants (pun intended). I'm an American, and I think I'm a pretty decent fellow. I've met some nice Europeans and Asians in my lifetime as well. Seems most people are pretty decent, in fact. But some find themselves succumbing to delusions of grandeur and/or persecution. Well, persecution does exist-- and everywhere people may say it does under American auspices, I'm perfectly willing to consider possible. Technically, I'm a Jew, which means that to some, me and my ancestors were little more than grubby little dark-skinned Semites bent on BOTH destroying and taking over the world (a rather poor strategy, no?), not completely out of league with Arabs and Muslims. So, in a strange twist of fate, I share the genes and culture of both the oppressed and the oppressors. But I DIGRESS.\n\nThe BEAUTY of this discussion is that I was inspired to do some reading, and I actually DID find an \"attestable\" quote, sort of: an article referenced in an MA thesis, article which is titled \"Optical scale in type founding,\" where by \"founding\" I assume is meant the whole process from design to melting and casting the type. It appeared first in Typography, No.4, 1937, p. 144. Sadly, I have no access to this article.\n\nBut there you have it.\n\n"
    },
    {
      "time": "6 Mar 2006 — 1:31pm",
      "content": "Tim,\n\nI repeat: I only quoted what the French think about Americans.\n\nIs is not allowed in America to quote what the French think?\n\nAnd is is not allowed in America to quote what a school boy says who is being detained and tortured for years in American concentration camps?\n\n"
    },
    {
      "time": "6 Mar 2006 — 3:46pm",
      "content": "Uli, everything is allowed in Ameri... Actually, that's not true. But free speech, or free typing, is certainly encouraged here at Typophile.\n\nYou can't possibly back out of responsibility for insulting the American contingent here. May I remind you that you posted:\n\n\"Should I describe this as “odd” or as “strange”, or should I say:  \n« Quelle bande de cons ces Ricains! »\"\n\nIf you're going to hurl insults, even in French, you have to be prepared to deal with the response you're going to get.\n\nOr as they say in Peru: \"That Uli sure is a wanker.\"\n\n"
    },
    {
      "time": "6 Mar 2006 — 11:46pm",
      "content": "\\> Or as they say in Peru: “That Uli sure is a wanker.”\n\nHere's a photo showing me while wanking:\n\n[http://www.sanskritweb.de/files/wanking.jpg](http://web.archive.org/web/20131018014927/http:/www.sanskritweb.de/files/wanking.jpg \"http://www.sanskritweb.de/files/wanking.jpg\")\n\n"
    },
    {
      "time": "7 Mar 2006 — 4:08am",
      "content": "Ulrich,  \nI am British, I don't know what is allowed in America although the fact that those documents are released under an American law at the direction of an American court is revealing. I am assuming that \"quoting\" what the French think is allowed, however, can you really claim that your \"quote\" is attributable to all of France _(or, indeed, attributable at all)_?  \nMy question is why do you need to \"quote\" anybody, if you have views you should be prepared to voice them as yourself and not hide behind your claims of what a nation \"thinks\".  \nBut the point is, without any research on your part you have decided that you can lump all Americans into one political group with uniform views (as you have with the French); further you have decided that all Americans on these forums share the same views wheras it is quite clearly not true, I suspect your neighbour does not have the same political views as you. Beyond that you have approached a group of people who you don't know and having asked, received and accepted their help – turned round and insulted them; that is not the behaviour of any civilised adult, more the actions and uninformed intellect of a child.  \nSo, come clean, tell us why you wanted the information and stop trying to be provocative it isn't big and isn't clever  \nTim\n\n"
    },
    {
      "time": "7 Mar 2006 — 4:21am",
      "content": "Uli,\n\nGlad you enjoy wanking; it's quite healthy. Maybe you could wank out a new typeface?\n\nSee, e.g., \"Splatz\" at [page.freett.com](http://web.archive.org/web/20131018014927/http:/page.freett.com/kentos/splatter02.html).\n\n- Jay\n\n"
    },
    {
      "time": "7 Mar 2006 — 8:18am",
      "content": "There was a time (perhaps some people still feel this way today as well) when all the atrocities of the Nazis were blamed on all Germans. To be German was to be Nazi was to be a villain. Your logic, lumping Americans into one cesspool, is quite similar. That is to say, you being German, (by your own logic) are as responsible for the acts of other Germans as Americans are responsible for the acts of other Americans. Hopefully, the world can get beyond the cheap and easy tactic of attributing negative traits to any entire group of people by just focusing on the acts of a few. This tactic is called racism or bigotry. Are you a bigot Uli?\n\nChrisL\n\n"
    },
    {
      "time": "7 Mar 2006 — 9:10am",
      "content": "The moderators have had to clean one thread already this week. If the question has been answered maybe this thread should be closed in order to discontinue all of this nonsense.\n\n"
    },
    {
      "time": "7 Mar 2006 — 9:33am",
      "content": "Miss Tiffany is right. Sorry I contributed to the nonsense. It's easy to get caught up in it. There's certainly no reason to continue, though. Nevertheless, it was kinda fun while it lasted.\n\n"
    },
    {
      "time": "7 Mar 2006 — 10:01am",
      "content": "Close this thang! I think we've answered Uli's initial questions AND responded to his follow-up insults.\n\n"
    },
    {
      "time": "7 Mar 2006 — 10:20am",
      "content": "Sorry folks, I did not mean to launch censure of a thread. Close it, by all means.\n\nChrisL\n\n"
    }
  ]
}
