{
  "id": "18227",
  "title": "The Mystery of Steile Futura (Topic)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[\n ![](http://web.archive.org/web/20150415081035im_/http:/typophile.com/files/urw-topic.png)\n](http://web.archive.org/web/20150415081035/http:/www.fontshop.com/showfont.cfm?fid=UR.110072.0.0)\n\nHello friends. I'm perpetually in love with Paul Renner's [Steile Futura](http://web.archive.org/web/20150415081035/http:/fontsinuse.com/typefaces/28702/steile-futura) (AKA Bauer Topic or URW Topic). I'm hoping those with type book collections can help me out with more information on its history and design. Digital versions are available from a few vendors, but none divulge any more than the number of weights and a price.\n\n**Digital Versions**  \n [URW Topic](http://web.archive.org/web/20150415081035/http:/www.myfonts.com/fonts/urw/topic/) at MyFonts  \n [URW Topic](http://web.archive.org/web/20150415081035/https:/www.fontshop.com/families/urw-topic) at FontShop  \n [URW Topic](http://web.archive.org/web/20150415081035/http:/urwpp.de/bri/show_font_details.php?sprache=english&fontnummer=t040volume) at URW++  \n [Steile Futura BQ](http://web.archive.org/web/20150415081035/http:/www.bertholdtypes.com/font/steile-futura/bq/) at Berthold\n\n**Articles**  \n [Renner article at creativepro.com](http://web.archive.org/web/20150415081035/http:/www.creativepro.com/story/feature/10560.html) mentions a design date of 1953–55  \n [Renner bio at Linotype](http://web.archive.org/web/20150415081035/http:/www.linotype.com/7-762-7/paulrenner.html) mentions design date of 1952.\n\n**Reinterpretations and Followers**  \n [Tasse](http://web.archive.org/web/20150415081035/http:/www.fontbureau.com/fonts/Tasse) (Guy J. Nelson) This is the closest to a revival but strangely omits the italics which are the most interesting aspect of the original.  \n [Solex](http://web.archive.org/web/20150415081035/http:/www.emigre.com/EF.php?fid=121) (Zuzanna Licko)  \n [Pakenham](http://web.archive.org/web/20150415081035/http:/www.myfonts.com/fonts/typodermic/pakenham-boss/?refby=typographica) (Ray Larabie)  \n [Hybrid](http://web.archive.org/web/20150415081035/http:/www.fountain.nu/catalogue/hybrid.asp) (Simon Schmidt)\n\n**In Use**  \n [L.A. Obscura: The Architectural Photography of Julius Shulman](http://web.archive.org/web/20150415081035/http:/www.usc.edu/dept/architecture/shulman/)  \n [\"The War Within\" movie poster](http://web.archive.org/web/20150415081035/http:/www.flickr.com/photos/stewf/53572902/in/photostream/)  \n [\"A Girl Named Zippy\" book cover](http://web.archive.org/web/20150415081035/http:/www.amazon.com/gp/reader/0767915054/)  \n [H.N. Werkman book cover](http://web.archive.org/web/20150415081035/http:/youworkforthem.com/product.php?sku=P0649)\n\nThanks for your help. I don't have [Burke's Renner biography](http://web.archive.org/web/20150415081035/http:/www.hyphenpress.co.uk/titles/paul_renner/synopsis.html). Anything in there?\n\n",
  "author": "Stephen Coles",
  "time": "27 Feb 2006 — 5:12pm",
  "uid": "103",
  "comments": [
    {
      "time": "27 Feb 2006 — 7:10pm",
      "content": "From Burke's book on Renner:\n\n\"A typeface actually called 'Renner-Grotesk' appeared in trial type castings by Stempel typefoundry in May 1936. The Stempel Renner-Grotesk was very condensed in its regular weight, with a consequent stress on the modular squareness of the letters (figure 115 [shown below--MS]). This design seems to have been taken over by the Bauer typefoundry in 1938, and in 1939 the grotesk changed shape to some extent, becoming less modular and incorporating references to pen-made forms. The italic accompaniment to this grotesk, simply called Renner-Kursiv, was actually a true cursive, marking a decided difference between this typeface and Futura. Work on the Grotesk and Kursiv continued through the late 1930s and early 1940s. However, progress on these typefaces seems to have been very slow, perhaps due to Renner's failing health: he had a serious heart attack in 1948 (at 70 years of age) which restricted his activity. By 1951, Renner had begun to work again, and his Grotesk began to appear in 1952 from the Bauer typefoundry under the name of Steile Futura (figure 116 [shown below--MS]). Perhaps the typeface was renamed merely in order to link it to the successful Futura family.\"\n\n ![](http://web.archive.org/web/20150415081035im_/http:/typophile.com/files/renner-grot.gif)\n\nFigure 115 (Renner-Grotesk)\n\n ![](http://web.archive.org/web/20150415081035im_/http:/typophile.com/files/stil-fut.gif)\n\nFigure 116 (Steile Futura)\n\n"
    },
    {
      "time": "27 Feb 2006 — 7:12pm",
      "content": "I think it's interesting how much the earlier version looks like Eurostile. Whether there is a connection I have no idea.\n\n"
    },
    {
      "time": "27 Feb 2006 — 7:41pm",
      "content": "Thank you Mark! Those samples are glorious. So kind of you to scan and type for me.\n\nStill pretty mysterious. I wonder where the name \"Topic\" came from. Another foundry's copy?\n\n"
    },
    {
      "time": "27 Feb 2006 — 7:55pm",
      "content": "I was wondering the same thing. For years, I only knew it as \"Bauer Topic,\" the name it shows up as in the VGC library and so on. Just guessing, but I wouldn't be surprised if the name was changed when it was marketed in the US, similar to the way Akzidenz Grotesk was marketed as \"Standard\" in the US.\n\nAs evidence for this, I have an art directors' type guide/manual published in 1959 which has short samples and text describing most of the metal display faces available in the US at that time (\"Practical Handbook on Display Typefaces\" by Kenneth B. Butler and George C. Likeness). It's listed as Bauer Topic and the text suggests that it had only recently become available.\n\n"
    },
    {
      "time": "27 Feb 2006 — 8:25pm",
      "content": "Renner designed [Futura Display](http://web.archive.org/web/20150415081035/http:/www.myfonts.com/fonts/urw/futura-display/) in 1932 for Bauer. It's nothing like Futura of course, but why waste a good brand name. It's a Black weight only face, and seems to be the precursor of Steile Futura (also nothing like Futura). No doubt Renner's sketch books have variations on the theme, over the years. Maybe I should call all my types Fontesque-something-or-other.\n\nThe [Canadian Tire logo](http://web.archive.org/web/20150415081035/http:/www.canadiantire.ca/index.jsp) is quite old, and uses Futura Display. (To even mention it is tempting fate for a re-brand, sorry.)  \nNote the minuscule forms of cap M and N, as in Steile.\n\nEurostile was nicely done, but a ten-years-after family extension of Microgramma, the TV screen face. Zapf called its \"squared circle\" shape the supercurve, and used it in Melior. Univers has some of the same feel, especially evident in Frutiger's roughs, which were \"squarer\" than the way it eventually turned out. The supercurve is a different, newer shape than that of Steile Futura, which was a type in the well-known lettering genre of \"block gothic\".\n\n"
    },
    {
      "time": "27 Feb 2006 — 8:31pm",
      "content": "\\> why waste a good brand name.\n\nTo not dilute it?\n\nhhp\n\n"
    },
    {
      "time": "27 Feb 2006 — 8:40pm",
      "content": "Hmmm. It's also classier to have types arranged in families, with no ostracized black sheep, making your type specimen like a book with chapters. The Bauer specimen I have from the '30s is like that. [Futura Black](http://web.archive.org/web/20150415081035/http:/www.myfonts.com/fonts/bitstream/futura-black/futura-black/) is another \"brand extension\"; did Renner design that also?\n\n"
    },
    {
      "time": "27 Feb 2006 — 9:06pm",
      "content": "Indeed he did:\n\n ![](http://web.archive.org/web/20150415081035im_/http:/typophile.com/files/futura-black.gif)\n\nIt doesn't say much about it in the book, but it's clear that it was intended as part of the original Futura family, not a brand extention.\n\n"
    },
    {
      "time": "27 Feb 2006 — 9:14pm",
      "content": "Futura Black is one of the first typefaces I recall noticing when I was a kid, not that I knew what it was called. It was on a package of sugar wafer cookies, I think.\n\n"
    },
    {
      "time": "27 Feb 2006 — 10:27pm",
      "content": "_one of the first typefaces I recall noticing_\n\nMe too.  \nThere was a \"big business\" TV series in the UK in the 1960s, called \"Mogul\" -- about an oil company, and its logo was the M from Futura Black. Also from that golden age of plastic, a credit card company called Access (Advantage, whatever!), its logo the A from Futura Black (that's how I remember it anyway).\n\n"
    },
    {
      "time": "27 Feb 2006 — 10:42pm",
      "content": "_\\> (...)a “big business” TV series in the UK in the 1960s, called “Mogul” — about an oil company, and its logo was the M from Futura Black._\n\nYou're sure it wasn't a music company, ;^)\n\n ![](http://web.archive.org/web/20150415081035im_/http:/typophile.com/files/Motown.gif)\n\n"
    },
    {
      "time": "28 Feb 2006 — 3:57am",
      "content": "great to meet somebody else in love with steile futura! The contrast between the upright and italic is just gorgeous.\n\nI have a specimen (mid 50s) of Steile Futura Fett from Bauer here, will post scans up later today or tomorrow, if time allows and somebody's interested. There's also quite a few faux examples of it in use included with the specimen, mainly for advertising use, all with common german brand names on them, but surely made up by the foundry, i wonder if it was an early attempt on getting that synergy-effect working with the foundry possibly getting paid by the respective companies?\n\ni also only have the information from the Renner book by C. Burke, but alweays wanted to know more about it's development, market success (i always thought 'you never see Steile Futura anywhere' and since got more familiar with it it seems to be everywhere! spotted it on a graphic card packaging, cleasning agent bottle, etc. just the other over here in germany)\n\non the naming issue, i always suspected that topic possibly was called that way not to get in trouble with that certain company from Illinois, which offers the only \"officially named\" Steile Futura… if anyone could shed any light on this?\n\nthis is gonna be interesting…\n\n"
    },
    {
      "time": "28 Feb 2006 — 3:59am",
      "content": "See, Steile Futura gets me so excited i can't type properly anymore… :-)\n\n"
    },
    {
      "time": "28 Feb 2006 — 7:05am",
      "content": "_on the naming issue, i always suspected that topic possibly was called that way not to get in trouble with that certain company from Illinois, which offers the only “officially named” Steile Futura… if anyone could shed any light on this?_\n\nThe company you're talking about didn't own the H. Berthold library until the nineties. Steile Futura was known as Bauer Topic in the US as far back as 1959, maybe earlier. Both names were used by Bauer, so it was some internal, possibly marketing, reason.\n\n"
    },
    {
      "time": "28 Feb 2006 — 7:28am",
      "content": "The lower case \"a\" in Futura Black is one of my all-time favorite glyphs.\n\nChrisL\n\n"
    },
    {
      "time": "28 Feb 2006 — 8:24am",
      "content": "_You’re sure it wasn’t a music company,_\n\nInternet search not successful.  \nScreenonline has a page on the Mogul series, but the visual material (including a full episode which may hold the answer), is not accessible outside of the UK.\n\n"
    },
    {
      "time": "28 Feb 2006 — 9:17am",
      "content": "franz - Yes, I'm interested. Gimme that specimen!\n\n"
    },
    {
      "time": "28 Feb 2006 — 9:58pm",
      "content": "me too!\n\n"
    },
    {
      "time": "1 Mar 2006 — 12:13am",
      "content": "Precision Type gave me the right to revise their cut of Topic a few years ago ... one of these days I'll release it. It's a great type.\n\n"
    },
    {
      "time": "1 Mar 2006 — 1:46am",
      "content": "Good man, Troop. On with it!\n\n"
    },
    {
      "time": "1 Mar 2006 — 2:19am",
      "content": "I see. That sounds somewhat logic, as especailly the word \"Steile\" might seem strange to american ears. But then again, if the typeface was named Steile Futura to capitalize on the market success of \"real\" Futura, why didn't they choose this option for the US market as well - or wasn't Futura (the \"real\" one :-) popular in the US at all until the 50s?\n\n"
    },
    {
      "time": "1 Mar 2006 — 2:25am",
      "content": "on the risk of making an idiot of myself -- how do i attach pics to messages on here? made pics of the specimen and would love to post them up…\n\ntia\n\n"
    },
    {
      "time": "1 Mar 2006 — 2:38am",
      "content": "Franz, you need to have the Flash Player, version 8.0 or higher installed on your computer in order to be able to post images. Once that is installed, you'll notice a blue-green \"Insert image\" command appear directly underneath the \"Comment:\" box. To insert images, click on the command, and follow the simple instructions.\n\n"
    },
    {
      "time": "1 Mar 2006 — 2:47am",
      "content": "many thanks dan.\n\nhere you go:\n\n ![](http://web.archive.org/web/20150415081035im_/http:/typophile.com/files/IMG_0021.jpg)\n\n ![](http://web.archive.org/web/20150415081035im_/http:/typophile.com/files/IMG_0022.jpg)\n\n ![](http://web.archive.org/web/20150415081035im_/http:/typophile.com/files/IMG_0023.jpg)\n\n ![](http://web.archive.org/web/20150415081035im_/http:/typophile.com/files/IMG_0024.jpg)\n  \nand now for the examples:  \n\n ![](http://web.archive.org/web/20150415081035im_/http:/typophile.com/files/IMG_0025.jpg)\n\nbrilliant, eh?\n\n"
    },
    {
      "time": "1 Mar 2006 — 2:57am",
      "content": "_There’s also quite a few faux examples of it in use included with the specimen, mainly for advertising use, all with common german brand names on them, but surely made up by the foundry, i wonder if it was an early attempt on getting that synergy-effect working with the foundry possibly getting paid by the respective companies?_\n\nI can't say if there was any cross-marketing going on with Bauer's specimens, but the mocked-up ads is a very common trait of German typeface brochures from the early 20th century. The Ruhard'sche/Klingspor specimen book for Eckmann, which was printed sometime between 1900 and 1910, and the second half is filled with dummy-ads. I aso have some images from their late specimen book for Wallau [here](http://web.archive.org/web/20150415081035/http:/www.typeoff.de/?p=29). Dummy ads are a good idea still, in my opinion. Sadly, when we design brochures today, some type designers don't want that stuff in their brochure!\n\n"
    },
    {
      "time": "1 Mar 2006 — 3:41am",
      "content": "I'm not so sure that I see the name decision behind Steile Futura in the 1930s and brand dilution… Steile Futura shares a number of \"Futura\" traits, like the single storey a, the straight j, the u without the foot, etc. Plus, Renner himself was not a recognized type designer yet. Futura was a hit, and it isn't bad to stand behind a hit, or build upon. Bringing a new \"name\" out, especially during a time of global depression (like the early 1930s), would have been a big business risk. What if no one paid any attention? Lots of good designs go neglected every day, sadly. Why not do what you can to avoid that? Just an idea…\n\n"
    },
    {
      "time": "1 Mar 2006 — 4:01am",
      "content": "The legal successor of the Bauer foundry is Wolfgang Hartmann's Fundición Tipográfica Bauer ( [http://www.ftbauer.com/](http://web.archive.org/web/20150415081035/http:/www.ftbauer.com/ \"http://www.ftbauer.com/\")). They own the \"Futura\" trademark. Their fonts are available at [http://www.myfonts.com/foundry/neufville/](http://web.archive.org/web/20150415081035/http:/www.myfonts.com/foundry/neufville/ \"http://www.myfonts.com/foundry/neufville/\") , but of course there are many independent digitizations of Steile Futura and I doubt any single one could be called the \"original\". If at all, it would have to come from FT Bauer.\n\nA.\n\n"
    },
    {
      "time": "1 Mar 2006 — 4:29am",
      "content": "True, true. The only current FT Bauer Steile Futura weight on Myfonts.com is [a single one called Futura ND dsiplay](http://web.archive.org/web/20150415081035/http:/www.myfonts.com/fonts/neufville/futura-nd-display/). Linotype sells a licensed [version](http://web.archive.org/web/20150415081035/http:/www.linotype.com/89130/futuradisplay-font.html) of this as well.\n\n[Font Bureau](http://web.archive.org/web/20150415081035/http:/typophile.com/wiki/Font%20Bureau)'s [Tasse](http://web.archive.org/web/20150415081035/http:/www.fontbureau.com/fonts/Tasse) looks very nice.\n\n"
    },
    {
      "time": "1 Mar 2006 — 7:11am",
      "content": "Franz,  \nFabulous stuff! Thanks for posting it. I had never seen that before. I hope they digitize the whole thing.\n\nChrisL\n\n"
    },
    {
      "time": "1 Mar 2006 — 11:48am",
      "content": "\"but of course there are many independent digitizations of Steile Futura and I doubt any single one could be called the “original”. If at all, it would have to come from FT Bauer.\"\n\nI don't quite understand what you are saying, Adam. There are two primary digitizations. The first was Font Company's from a VGC photo master, of which the URW is an exact copy with every defect preserved. My impression is that Font Company did the work, and URW acquired the rights under typical IK licensing. This digitizations includes the two weights, medium and bold, both in regular and italic. The second primary digitization is Berthold's, which unfortunately is only of the rather less interesting bold. It differs from the FC version in many details. The FC/URW version is almost unusable because it is so amateurishly, in fact irrationally spaced and because there are so many incorrect glyphs. Both versions take considerable although not fatal liberties with the metal cut. In the metal, there is substantial variation from size to size, making it quite difficult to decide on proportions. In addition, the spacing is rather loose by contempoary standards. But Adam, what do you mean when you say that the original 'could only come from FT Bauer'? Everyone has access to the same specimens, and FT Bauer has not shown the slightest originality in any of its digitizations or design choices. If anyone is going to produce an 'original' Steile, I think it is very unlikely to be FT Bauer. Its Futura digitizations largely recklessly imitate, often point for point, previous translations of the fonts into photo from metal. Nowhere have we yet seen what we most need, a Futura intended for setting at text sizes, which in metal features the substantially reduced ascenders which are necessary to make the type viable at text sizes. Because we have not seen anything from 'FT Bauer' which in the slightest degree resembles research into original drawings or any effort to come to understand what the foundry originally did, I would conclude that FT Bauer does not actually possess any original artwork or pattern drawings, and is simply relying on precisely the same sources that are available to everyone else. So Adam, what makes FT Bauer so special? Based on past performance, any Steile FTB does will be a copy of the URW version with, one hopes, improved spacing. I do not see the smallest evidence that FT Bauer has ever done anything the hard way! You know, research into originals, redrawing, throwing out the old photo masters, rethinking, reconceptualization, all that good stuff that makes good type what it is. Sure, their Futura is OK. But where is it substantially different from everyone else's? What evidence is there of historical research? As far as I can see, that foundry is all hype, hype, hype, and lawyers, lawyers, lawyers - rather like what Berthold has become under the combined weight of the two Hunts. To speak of these cloners as 'digitizing' anything reflects badly on what is, after all, a metier.\n\nIt is precisely because it is so difficult to digitize type from a 12 point specimen, without master drawings (and assuming that the drawings would actually be helpful in making the type, which does not follow), that I doubt 'FT Bauer' has any material that is different from anyone else's. They are making the same, sloppy, cost-effective decisions that everyone else does when confronted, in type, with the desirability of doing some really hard work. And this does not impress me. This is not what we need at this point in type history.\n\nStephen, I think you are very acute to be so obsessed with this type. It is still miles ahead of its time. I think in its original form that it is still a little too shocking to see much use. But the skill with which it was conceptualized is what most impresses me. The relationsip between the bold and medium is particularly notable. There is no artificial bolding such as we all, conceptually (and sometimes literally) do. The different weights are independently thought out, which is as it should be. In certain respects, which I cannot describe because I don't fully understand them, I think it is the best typeface design I have ever seen, on a technical and aesthetic level that I could never aspire even to understanding, much less to rivalling. Perhaps Berlow, if he felt like it, could persuasively analyze what is going on in this remarkable typeface.\n\nIn the meantime I have a question. Jeff Level, when we first thought of redigitizing this typeface in 1993, felt strongly that the cap height should be reduced by about 10%. I can't get away from the feeling that if Renner had thought this a viable option he would have pursued it, and that pursuing it would cause all kinds of other unintended consequences. Does anyone have an opinion?\n\n"
    },
    {
      "time": "1 Mar 2006 — 12:39pm",
      "content": "_the same, sloppy, cost-effective decisions that everyone else does when confronted, in type, with the desirability of doing some really hard work._\n\nI don't work that way all the time, honest! :-)\n\n"
    },
    {
      "time": "1 Mar 2006 — 12:45pm",
      "content": "Franz - _Thank you!_ Where did you snag that beauty?\n\nDan - I believe Futura Display is a completely separate typeface from Steile Futura, not part of the same family.\n\nBill - On the cap height: I guess we're used to seeing ascenders rise above caps these days so it could make Steile feel a little more relevant, but I think the original is perfectly usable in today's design. See my examples. I've also seen a lot of it recently as the main face in museum and gallery exhibitions.\n\n"
    },
    {
      "time": "1 Mar 2006 — 1:59pm",
      "content": "\\> I do not see the smallest evidence that  \n\\> FT Bauer has ever done anything the hard way!\n\nI do. I don't know about Futura, but their recent Pascal revival  \nwas certainly a result of research (including getting the original  \ndrawings from Mendoza y Almeida), thought and hard work.\n\n\\> if Renner had thought this a viable option he would have pursued it\n\nThis logic fails because Renner was not god. Everybody makes bad  \ndecisions sometimes; not to mention that people change their mind  \nquite often too!\n\nMost of all it depends how literal a revival intends to be.\n\nhhp\n\n"
    },
    {
      "time": "1 Mar 2006 — 6:03pm",
      "content": "\\>Where did you snag that beauty?\n\nThey're around. They also did English versions, again with faux ads, for instance for Emerson. I must say the faux ads are pretty badly thought out - - indeed the whole presentation is rather bad, nowhere near the level of some of the startlingly beautiful pages that Renner (I believe) created for the original release of Futura. I used one of Renner's original ads as the basis for a poster for a piano concert I gave a couple of years ago. What genius, so far ahead of nearly anything you see in contemporary design, _still_ so much more modern.\n\n"
    },
    {
      "time": "1 Mar 2006 — 6:29pm",
      "content": "Bill, any idea where to find the Emerson one?  \nIt's a design I've come to like a good deal:  \n [http://typophile.com/node/15269](http://web.archive.org/web/20150415081035/http:/typophile.com/node/15269 \"http://typophile.com/node/15269\")\n\nhhp\n\n"
    },
    {
      "time": "1 Mar 2006 — 10:57pm",
      "content": "I meant Steile ads for Emerson the company. I had some good Emerson the typeface material but it is either in storage or burnt in a fire. I thought it overrated the last time I looked at it but that was quite a while ago.\n\n"
    },
    {
      "time": "2 Mar 2006 — 2:03pm",
      "content": "Sorry to join the party so late. The Renner retrospective in:  \nPhillipp Luidl, Compiled and edited by Philipp Luidl with Gunter Gerhanr Lange, \"Paul Renner,\" _Eine Jahresgabe der Typographischen Gesellschaft München_ Munich: Typographische Gesellschaft, 1978.  \nDoes a good job of cataloging Renner's type design and provides reproductions of both drawings and proofs. I have a couple of images I have tried to attach (as png, gif, & jpeg), but they don't appear when I upload them. Advice please.\n\n"
    },
    {
      "time": "2 Mar 2006 — 2:20pm",
      "content": "\\>Advice please.\n\nSee the posting by Dan Reynolds above. And make sure they are RGB.\n\n"
    },
    {
      "time": "2 Mar 2006 — 2:27pm",
      "content": "\\> overrated\n\nFor that to be the case people would have to actually know it exists. :-/\n\nhhp\n\n"
    },
    {
      "time": "2 Mar 2006 — 2:27pm",
      "content": "_I can’t get away from the feeling that if Renner had thought this a viable option he would have pursued it, and that pursuing it would cause all kinds of other unintended consequences. Does anyone have an opinion?_\n\nOn pages 22 – 3 of _Die Kunst der Typographie,_ Paul Renner writes briefly about his disatisfaction with the German Unified Standard Baseline. He felt it was too low on the type body, effectively shortening the descenders in relationship to the mean and cap heights in the font. He suggested, in these pages, that a solution would be to produce fonts that were reduced in size in the upper part of the type body and by \"… these means, the image of the type would become somewhat smaller; something no one will be annoyed with, given today's current preference for smaller types. The descenders could once again become as long as with classic fonts, and it would leave sufficient space over the capital letter for the accents and umlauts. … So that once again type would look good in unleaded settings. \" Because he envisioned the descenders becoming proportionally longer, he was, in effect, proposing a reduction in cap height on the body, and I suspect that he would have considered the extra space a reasonable trade-off.\n\n"
    },
    {
      "time": "2 Mar 2006 — 2:41pm",
      "content": "William, thank you. The images were B&W. Here they are.\n\n ![](http://web.archive.org/web/20150415081035im_/http:/typophile.com/files/p93-300dpi.jpg)\n\n ![](http://web.archive.org/web/20150415081035im_/http:/typophile.com/files/p97-300dpi.jpg)\n\n ![](http://web.archive.org/web/20150415081035im_/http:/typophile.com/files/p99-300dpi.jpg)\n\n"
    },
    {
      "time": "2 Mar 2006 — 3:31pm",
      "content": "Normally I'd complain about such a huge image, but can you make it bigger? Oh that is lovely.\n\n"
    },
    {
      "time": "2 Mar 2006 — 4:25pm",
      "content": "Whoa. This almost gots some Goudy Sans in it. Bizarre.\n\n"
    },
    {
      "time": "2 Mar 2006 — 5:37pm",
      "content": "Heh heh, check out them traps.  \nWhat point sizes are those?\n\nhhp\n\n"
    },
    {
      "time": "2 Mar 2006 — 6:22pm",
      "content": "_What point sizes are those?_\n\nThe cap height in the image of the roman caps is 1 2/3\" and the distance baseline to baseline is 2 1/3\". In the italics, the cap height (as reproduced) is .9\" (23.5 mm).\n\n"
    },
    {
      "time": "3 Mar 2006 — 2:25am",
      "content": "thanks for posting these charles. made my day.\n\n"
    },
    {
      "time": "3 Mar 2006 — 7:22am",
      "content": "Those must be enlargements then, no?  \nAny idea what the original point sizes were?\n\nhhp\n\n"
    },
    {
      "time": "3 Mar 2006 — 2:38pm",
      "content": "_Those must be enlargements then, no?  \nAny idea what the original point sizes were?_\n\nI do not have the Luidl text on hand. I made same size (100%) B&W line art scans at 600-dpi. The posted images are at 300 dpi, RGB. If you download an image and open it in PhotoShop it will appear at the same size as the original scan and you can make your best estimate of size from that. I retrieved the article from the Cooper-Hewitt Library about 6 years ago and cannot recall if the captions to the images in the article provided a point size.\n\n"
    },
    {
      "time": "3 Mar 2006 — 9:30pm",
      "content": "For Nick\n\n ![](http://web.archive.org/web/20150415081035im_/http:/typophile.com/files/moglog2.jpg)\n\nFrom: [http://www.action-tv.org.uk/mogul/mogul/mog\\_series.htm](http://web.archive.org/web/20150415081035/http:/www.action-tv.org.uk/mogul/mogul/mog_series.htm \"http://www.action-tv.org.uk/mogul/mogul/mog\\_series.htm\")\n\n"
    },
    {
      "time": "4 Mar 2006 — 11:23am",
      "content": "Charles, let me add passionate thanks for these marvellous illustrations, which I don't remember seeing before. Exactly what do they represent? Are they some kind of drawing or trial cut? What is fascinating and instructive is to see how very different they are from the finished font. The ink traps are completely irrelevant, of course, as they chose not to use any in the final font. (As far as I can tell, there are no traps even in the smallest sizes which are what - 12 pt? 10 pt?) It is the radical changes in the letterforms that I find so impressive. How he started from here and got to there. Type being so collaborative, we must really wonder quite who is the auteur here? We naturally wish to think of Renner as sole auteur, sole arbiter. But what if this - what you have shown - was his final creative word? What if the rest, everything that makes the typeface the great totality we know today - came from the foundry staff?\n\nDo we have any information on this? Are there any survivors from the process? Did anyone keep diaries? Are there any corporate records? (There must be some kind of documentation - sie waren Deutsch!) I find the contrast between the design and the pre-design most fascinating to contemplate - very moving. There must have been a huge amount of effort and thought, and perhaps much heartbreak, as the letters were transformed from here to there. Where on earth do we find, today, anyone taking lettermaking so seriously? It is all very inspiring, what you have presented.\n\nIt is utterly shocking to me that Chris Burke did not address these issues at all in his book on Renner - as far as I can remember. That is the dullest book I have ever read, though one is grateful for it even so - - How it would have been _enlivened_ if he had thought to penetrate the questions these illustrations raise. He must have been aware of this material, no? To write 200 pages about Renner and not have a single interesting thing to say about him - - when you could be discussing _this_.\n\nI look at what you have sent and I say to myself 'and _you_ aspire to present a version of this typeface to the public? YOU? What makes you think you have a tenth of the requisite expertise?'\n\nI'm blown away, falling not perhaps quite upwards, as Hölderlin says, but sideways to and fro.\n\n"
    }
  ]
}
