{
  "id": "18234",
  "title": "Modular Typography",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Im realizing a coordinated project with M.S. for the Typography assignature,  \nthe briefing of this project consists on realizing a catalog of \"Typography  \nand Typographers on the XXth Century\" the motor to ingnite the project was  \nthe \"SupertipoVeloz\" by Trochut an outreageous example of modular typography;  \ni would be widely interested on recieving any type of information on these  \narea, because I had found only experimental typographyies of the beginings  \nof the century (vanguard). Thank you for your attention.\n\n",
  "author": "Chocotron",
  "time": "28 Feb 2006 — 5:32am",
  "uid": "11767",
  "comments": [
    {
      "time": "28 Feb 2006 — 8:39am",
      "content": "The 21st century question is: how do you refine your search?\n\nAnother answer: a large storehouse such as The British Library, which could be considered an example of modular typography, with book as module.\n\n"
    },
    {
      "time": "28 Feb 2006 — 9:23am",
      "content": "[Albers Stencil](http://web.archive.org/web/20150419104814/http:/www.myfonts.com/fonts/p22/albers/p22-albers-1/) comes to mind: it uses a limited number of standard shapes to produce an entire character set. It's certainly not as comprehensive as Trochut's designs, however.\n\n"
    },
    {
      "time": "28 Feb 2006 — 9:34am",
      "content": "Sorry, I don't think I understand the question.  \nWhat's it look like, SupertipoVeloz?\n\n"
    },
    {
      "time": "28 Feb 2006 — 6:15pm",
      "content": "Supertipo Veloz was a \"typographic system for the small printer\" developed by Catalán designer Joan Trochut Blanchard in 1942. The \"system\" consisted of several series (or modules) of building blocks (usually 14) from which one could construct any number of alphabetic variations. Additional complementary forms (swashes, tails, flourishes) were also available. A limited sample, illustrating the basic principle, appears below:\n\n ![](http://web.archive.org/web/20150419104814im_/http:/typophile.com/files/super_veloz.gif)\n\nThere's a nice article about the series in _Baseline_ Vol. II, No. 2. A typographic conference in Spain in the last year or so (sorry, details escape me at the moment) had an exhibition of Trochut's work, for which a catalog was published. I'd love to buy a copy, but everywhere I've located the book (all in Europe), the postage costs as much or more than the book itself. And, at one point in time, Typerware had a \"Trochut project\" in the works, but it seems to have disappeared. I think I have a complete set of the building blocks in at least one of Trochut's modules in my \"do something useful with my downtime\" file folder at work; if you'd like to see more, I'll see if I can locate and post it.\n\nIn any event, I love Trochut's work: my freeware font **Conga Line** , as well as my commercial works **Novadam Obese** and **Super Bob Triline** are all based on \"the system.\"\n\n"
    },
    {
      "time": "28 Feb 2006 — 8:10pm",
      "content": "Thanks Nick, well put.  \nNow I get it.\n\nEdmund Fry's \"Great Primer Script\" used modular components.  \nThe frontispiece of his 1824 Specimen is a fold-out: \"A Scale to Facilitate the Composition of Edmund Fry's Great Primer Script\".  \nSorry, I don't have an image. It must have been a virtuoso task for compositors to work with Fry's system.\n\n\"Fregio Mecano\" (Italian, 1920s, anon.) is shown in \"130 Alphabets and Other Signs\" (page 102-103). An iteration of its system is marketed by Monotype as \"Section Bold Condensed\".\n\nRian Hughes (Device) recent \"Klaxon\" shows an interesting way to construct a face from a limited number of components, along the lines of \"LCD\" (Alan Birch, 1981)\n\n"
    },
    {
      "time": "1 Mar 2006 — 7:57am",
      "content": "Here's a comparison of modular units for **Albers Stencil** , one of the **Supertipo Veloz** modules, and a typeface I recently released based on the work of Dutch designer **H. Th. Wijdeveld** , another De Stijl pioneer.\n\n ![](http://web.archive.org/web/20150419104814im_/http:/typophile.com/files/trochut.gif)\n\nAlthough both Albers Stencil and Architectuur have twelve basic building blocks, Wijdeveld's system is by far the simpler: he constructed his letters out of stock brass rules, with only straight-line segments.\n\n"
    },
    {
      "time": "1 Mar 2006 — 5:37pm",
      "content": "Thank you very much Nick & Nick. Now I have some tracks to be able to continue this work. Hope to be able to find this bibliography in Spain too. And speaking of Trochut, I indicate you a site, [http://www.andreubalius.com/andreubalius/expos02\\_superveloz.html;](http://web.archive.org/web/20150419104814/http:/www.andreubalius.com/andreubalius/expos02_superveloz.html; \"http://www.andreubalius.com/andreubalius/expos02\\_superveloz.html;\") Andreu Balius who was in charge next to the grandson of Trochut to digitize his work (selection of works). Sorry Im not used to write in english. I try.\n\nAlphabet created from the modules of Super Veloz type (digitized by Andreu Balius and Àlex Trochut in 2004)\n\n ![](http://web.archive.org/web/20150419104814im_/http:/typophile.com/files/SV_MARFIL-Sample.jpg)\n\n"
    },
    {
      "time": "1 Mar 2006 — 5:45pm",
      "content": "Encounter many modular typographies, all are practically experimental. And very little bibliography.\n\n ![](http://web.archive.org/web/20150419104814im_/http:/typophile.com/files/tortosa.jpg)\n\n ![](http://web.archive.org/web/20150419104814im_/http:/typophile.com/files/typo.jpg)\n\n"
    },
    {
      "time": "27 May 2006 — 11:09am",
      "content": "Hi,\n\nI'd recommend you to visit: [www.superveloz.net](http://web.archive.org/web/20150419104814/http:/www.superveloz.net/ \"www.superveloz.net\") for further information on Super tipo Veloz. One of my favourite works, indeed!. I've been working for long on modular type and experimental type in Spain.  \nBest,  \nAndreu Balius\n\n"
    },
    {
      "time": "27 May 2006 — 11:16am",
      "content": "Silvia, could I bother you for a high resolution  \nscan of the \"MA\" in \"MAJOR\" on that poster?\n\nhhp\n\n"
    }
  ]
}
