{
  "id": "18231",
  "title": "Sinhala lettering leeway?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Friends of mine, one of whom is of Sri Lankan ancestry, have asked me to help them design their wedding materials. They'd like to use the Sinhalese word for \"love\" as part of their imagery. This is an image of the word she sent me:\n\n ![](http://web.archive.org/web/20131010053645im_/http:/typophile.com/files/love.jpg)\n\nI'm basically wondering how much leeway I have in redoing this lettering, which I feel is kind of cold. I searched and found links to many different Sinhala fonts, so it appears I have as much freedom as I would with Western lettering, but not knowing anything about Sri Lankan culture, I just want to make sure I'm not being disrespectful by going too far one way or another.\n\nSo...anyone know any Sinhala lettering pitfalls I should avoid?\n\nBelow: a sampling of Sinhala fonts I found on one site, for reference:\n\n ![](http://web.archive.org/web/20131010053645im_/http:/typophile.com/files/sinhalafonts.jpg)\n\n",
  "author": "cheshiredave",
  "time": "27 Feb 2006 — 10:36pm",
  "uid": "1112",
  "comments": [
    {
      "time": "27 Feb 2006 — 11:32pm",
      "content": "The first trick will be to identify the appropriate style of lettering to use in the context of a wedding invitation, typically a classy but conservative genre. In the example you show, the style used in the Green text probably has most promise.\n\nThe second trick, if you plan to draw the lettering yourself, is knowing what form each letter takes within the particular style, and avoiding ignorantly mixing characteristics of different styles. Your best bet is to follow a model quite precisely, only making proportional adjustments to weight or height/width.\n\n"
    },
    {
      "time": "28 Feb 2006 — 11:07am",
      "content": "\\>avoiding ignorantly mixing characteristics of different styles\n\nExactly why I posted this thread. Anyone else have more specific knowledge?\n\n"
    }
  ]
}
