{
  "id": "18244",
  "title": "My personal mark/logo: pd",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I need some feedback from some experts on my personal identity, I definitely respect everybodys knowledge and opinions on these forums, so anything would be helpful. The logos are just for a personal mark right now, nothing serious...maybe down the line sometime soon. My name might accompany it pd are my initials, or another idea I have is anyword that starts with p and design example: pangea design.\n\n ![](http://web.archive.org/web/20070811070745im_/http:/typophile.com/files/pd.png)\n\nSpecifically I am wondering about what other contrasting colors might work with this logo, and the fact that when viewed smaller you lose the 3D Escher effect.\n\n ![](http://web.archive.org/web/20070811070745im_/http:/typophile.com/files/pd2.png)\n\nHere is option numer two. I love this logo myself, I really think it pays homage to the Bauhaus and maybe even El Lissitzky. But everybody I’ve ran it past for critique says they read the word pool. I see it, but like I said I have emotional attachment issues to this one. If you guys/gals tell me it reads pool I will catalog it and wait for some high end pool supply company to come along and pitch it to them.\n\n-Patrick Dakin\n\n [‹ help with consistency](http://web.archive.org/web/20070811070745/http:/typophile.com/node/18123 \"Go to previous forum topic\") [Dalit Freedom Network Logo ›](http://web.archive.org/web/20070811070745/http:/typophile.com/node/18191 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070811070745/http://typophile.com/user/11341\" title=\"View user profile.\">metafourik</a>",
  "time": "<br>",
  "uid": "11341",
  "comments": [
    {
      "time": " 28.Feb.2006 5.36pm",
      "content": "Actually, I think the first two shapes make a lower-case “r,” which you really don’t want. What about something like this\n\n ![](http://web.archive.org/web/20070811070745im_/http:/typophile.com/files/pd-idea.jpg)\n\n"
    },
    {
      "time": " 28.Feb.2006 6.54pm",
      "content": "Patrick,\n\nJust remember that the best identies can be reproduced using only 1 color. Some good logos are geometric, but I think you would get better results drawing out 100 thumbnails of the the 3 ideas above (including Jay’s suggestion). They all look like you began the project in illustrator.\n\n"
    },
    {
      "time": " 28.Feb.2006 7.38pm",
      "content": "Meta, if you thin the bars which represent strokes in your second option they will look more like a p and d as opposed to two lowercase r. I like this one a lot. I enjoy the abstraction of letterforms and don’t know that it needs to be exactly the letters. However, your first option seems to lack something which the second has potential for.\n\n"
    },
    {
      "time": " 1.Mar.2006 4.59am",
      "content": "Here’s just a couple variation on the prior suggestions. I also like the others’s suggestions. Something about your sample #2 is interesting, if you can fix that lower-case “r” issue. It’s like a little horizontal row of simple shapes that— hey there!— could look like P and D.\n\n ![](http://web.archive.org/web/20070811070745im_/http:/typophile.com/files/pd-alt1.jpg)\n\n ![](http://web.archive.org/web/20070811070745im_/http:/typophile.com/files/pd-alt2.jpg)\n\n"
    },
    {
      "time": " 1.Mar.2006 5.02am",
      "content": "Overall, the nice thing about having P and D to work with is that in the lower case, they are the same thing, just rotated 180. And each is just one line and one curve (or one box and one circle). So there’s lots of room to play on their shape similarities.\n\n"
    }
  ]
}
