{
  "id": "18257",
  "title": "The latest in Microsoft's Segoe Saga - from Le Times",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "LETIMES has the latest installment of the Segoe Saga!!!!\n\nWe're so excited about it that we're posting to Typophile before doing anything else.\n\nBreathtaking new heights have been scaled in design piracy, which will shortly be the subject of new content at letimes.com, which as you know is the site that _celebrates_ type piracy (though it sure doesn't update its website too often).\n\nWhen Adobe pirated Frutiger in 1993, the designer complained, and Adobe sent Frutiger a letter explaining in seven dense pages, all the _true differences_ there were between Myriad and Frutiger.\n\nBut Microsoft's new corporate typeface, Segoe, will cause less trouble. This masterpiece of fidelity is so hard to distinguish from Frutiger that, as we learnt in the EU ruling today, _Microsoft now takes the official position that there is no difference between the two designs._\n\nSee the EU trademark and design authority decision [here](http://web.archive.org/web/20150123102714/http:/oami.eu.int/PDF/design/invaldec/ICD%20000000743%20decision%20(EN).pdf):\n\nThe latest news in this saga is that the EU trademark and design registration office has declared Linotype the winner and invalidated Microsoft's registration of Segoe as an original typeface, which just proves our point.\n\nHowever, though Microsoft may have lost at the EU, we at Le Times congratulate Microsoft for doing an even better job than Adobe in getting to the _true essense_ of Frutiger. Can anything rival the fidelity and sensitivity with which this princely project of piracy has been realised? Can a Peignot award be beckoning for its gifted designers?\n\nSadly, Le Times must note that Frutiger won't be able to discuss his typeface with Microsoft this time around. Now seventy-five, and ill with lung disease, it seems he doesn't have the strength to concern himself with the matter.\n\nBut there is good news too!!!! We expect that Microsoft's shareholders will be grateful to Microsoft for hitting upon this delightful method of saving money. Before commissioning Segoe, Microsoft _did_, Le Times has heard from Linotype, try to license Frutiger, but baulked at Linotype's price: one penny per OS sold. Kudos to Microsoft for realizing that _pennies_ add up to an _unacceptable_ and _unfair_ shareholder _burden_.\n\nWe expect there will be some _carpers_ out there who fancy it unfair that Frutiger will be deprived of substantial royalties for his work. We can allay their anxiety by advising them to consider the practical, shareholder-driven view: Frutiger will soon no longer be with us.\n\nWe ask everyone in the design community to join us in endorsing Microsoft on this felicitous occasion. It takes an entity of Microsoft's _philanthropic_ resources to be able to deliver this final tribute to a great designer on his sickbed.\n\n(Personally, I would have sent flowers instead.)\n\n",
  "author": "billtroop",
  "time": "1 Mar 2006 — 12:08am",
  "uid": "4019",
  "comments": [
    {
      "time": "1 Mar 2006 — 3:00am",
      "content": "The [decision paper](http://web.archive.org/web/20150123102714/http:/oami.eu.int/PDF/design/invaldec/ICD%20000000743%20decision%20(EN).pdf) of the EU trademark office.\n\nSome additional words from Mr. Steinert on the German typeforum to Frutiger Next and its development.\n\n[http://www.typeforum.de/news\\_339.htm](http://web.archive.org/web/20150123102714/http:/www.typeforum.de/news_339.htm \"http://www.typeforum.de/news\\_339.htm\") -  \n [http://www.typeforum.de/news\\_254.htm](http://web.archive.org/web/20150123102714/http:/www.typeforum.de/news_254.htm \"http://www.typeforum.de/news\\_254.htm\")\n\n-- [astype.de](http://web.archive.org/web/20150123102714/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "2 Mar 2006 — 7:41am",
      "content": "After perusal of the legal decision, it seems to me that Heidelberger Druckmaschinen AG could not register \"Frutiger Next\" as a design.\n\nIs this correct?\n\n"
    },
    {
      "time": "2 Mar 2006 — 7:18pm",
      "content": "I don't know any details but I gather there was some problem because Frutiger was a pre-existing design. It seems to me that they could have registered the italic only, but I really don't know. I will inquire.\n\n"
    },
    {
      "time": "3 Mar 2006 — 12:02am",
      "content": "\\> they could have registered the italic only\n\nThere also exist invalidity decisions concerning the italic styles,\n\ne.g. this decision [http://www.sanskritweb.de/files/segoe3.pdf](http://web.archive.org/web/20150123102714/http:/www.sanskritweb.de/files/segoe3.pdf \"http://www.sanskritweb.de/files/segoe3.pdf\")\n\nFor both regular and italic fonts, exactly the same letters (\"a\", \"c\", \"e\", \"t\", \"g\", \"3\", \"5\", \"6\", \"9\" etc.) are \"rightfully observed\" by the invalidity division. See section 11 on page 4 of file segoe3.pdf\n\nNowadays not only typefaces are pirated, sorry \"copied\", but court decisions too ...\n\n"
    },
    {
      "time": "4 Mar 2006 — 2:12pm",
      "content": "Uli, thank you so much for this! My God, I had no idea Steve had so totally cloned the italic as well.\n\nAnd what is Microsoft saying in the pdf you link to? Essentially this: _We do not dispute that the designs are identical. We dispute that Linotype sold this data before 2004._\n\nWhat a crock of S-C-H-E-I-S-S-E. We all know that Frutiger Next has been sold by Linotype for several years now.\n\nSorry, Steve Matteson - I love you but you should have wiped your ---- before you consented to get involved in this really filthy project.\n\nI'm sorry to be so crude, but even Goethe was when the occasion demanded, and I think this occasion demands it.\n\nA lot of people need to wipe their ---- here and this is what I suggest to the Microsoft corporate people:\n\nLet MS pay off Frutiger and Linotype.\n\nLet MS in future describe the typeface as a specially designed tribute to the great Adrian Frutiger by his great admirer Steve Matteson.\n\nThat is it. End of story. Nobody will ever talk about it again.\n\nAnd as for you font people at MS, I have this to say. The next time you need a new typeface, whether it's for corporate ID or for something else, do not go to a slippery autodidact, a professional cloner, or a hinting technician. Go to one of the acknowledged masters now in productive late middle age. You have four good choices: Unger, Carter, Berlow, Stone. All four are at the height of their powers, and all four are hungry. These are the designers who can do the work you need done, _and do it without disgracing you_. And do it cheap. Guys --- have you thought about your futures? Do you really think Microsoft is going to keep on retaining you if you continue to get it into these endless PR, technical, and legal messes? Do you really think you are serving your company well by embarassing it as much as you have in the past two years? And this at the point when Microsoft most needs you to be making superb decisions? When there is so much at stake?\n\nGuys, do you think Microsoft likes being the loser in a legal dispute?\n\n"
    },
    {
      "time": "10 Mar 2006 — 12:24am",
      "content": "A note on website statistics:\n\nAt the top of this page is stated that this thread has a total of \"730 reads\" (at this very moment, while I write this), whereas my website statistics says today that file segoe3.pdf has a total of \"24 downloads\", i.e. 3.3 per cent (24 out of 730).\n\nAt another thread, the ratio was even worse: Only 1 % downloads of a linked file in comparison with nearly 1000 \"reads\" of the thread. Anyone who makes links to one's own files at one's own websites will confirm similar ratios.\n\nSo I wonder: What does the expression \"reads\" really mean?\n\n"
    },
    {
      "time": "11 Mar 2006 — 1:08am",
      "content": "It probably means that most of the people who read this thread already had the pdfs. Of course, they can't comment, now that their company has shot them in the foot by making it Microsoft's legal position that Frutiger and Segoe are identical. Since Segoe/Frutiger is said to be such a vital part of the Vista UI, it will be interesting to see how this plays out. I don't envy any of the participants their present position. But the moral is, if you don't steal a font, a lot of bad things don't happen to you. What's the old advice ... thou shalt not steal ... something like that?\n\n"
    },
    {
      "time": "12 Mar 2006 — 3:01am",
      "content": "\\> thou shalt not steal\n\nTheft is an inappropriate legal term in this case. For the legal background of the Segoe case concerning the European laws read the text file\n\n[http://www.sanskritweb.net/forgers/segoe.txt](http://web.archive.org/web/20150123102714/http:/www.sanskritweb.net/forgers/segoe.txt \"http://www.sanskritweb.net/forgers/segoe.txt\")\n\n"
    },
    {
      "time": "12 Mar 2006 — 5:01pm",
      "content": "I cannot entirely agree with this without further information, as I am not convinced that in common law argument forgery is anything more than a particular kind, or subset, of theft.\n\nOED defines theft as 'The action of a thief; the felonious taking away of the personal goods of another; larceny; also, with a and pl., an instance of this. Forgery, by contrast, is '3. The making of a thing in fraudulent imitation of something; also, esp. the forging, counterfeiting, or falsifying of a document. For the use in Law see quot. 1769.' That quote, from no less than Blackstone is:\n\n1769 Blackstone Comm. IV. 245 Forgery, or the crimen falsi..‘the fraudulent making or alteration of a writing to the prejudice of another man’s right.’\n\nI am certainly willing to accept your position that the proper term to be used here is forgery, but I would want German, British and American legal opinions on that before coming to a firm opinion of my own. Well, and I would also, since I was quoting from the Bible, want to hear a Biblical law opinion as well.\n\nI have a question. You write, in the referenced webpage,\n\n'By the same token, \"Frutiger\" and \"Myriad\" are regarded  \nas \"identical\". Therefore, Adobe Inc. is not allowed to  \nregister its forgery \"Myriad\" as \"new\" and \"individual\"  \ndesign in the European Community.'\n\nThis implies that Adobe has attempted to register Myriad and that the EU has determined that it is identical to Frutiger. I have not heard of this actually occurring. Has it? If so, could you document it? Or were you stating a hypothetical case? If so, I think it would have been helpful to have stated that.\n\nYou point out that Microsoft has a right of appeal, but I suspect that the position enunciated by its own lawyers - that the typefaces are identical - cuts off any possibility for Microsoft to prevail in future actions of any kind with regard to this typeface. Who, by the way, is Graf von so and so? Do you happen to know, Uli?\n\n"
    },
    {
      "time": "12 Mar 2006 — 9:26pm",
      "content": "_You point out that Microsoft has a right of appeal, but I suspect that the position enunciated by its own lawyers - that the typefaces are identical - cuts off any possibility for Microsoft to prevail in future actions of any kind with regard to this typeface._\n\nThe judgement states that Linotype's observation that the Segoe and Frutiger are identical is uncontested by Microsoft. That seems to me something less than a positive statement by Microsoft: it may simply mean that they did not elect to answer this observation at all. Could they choose to address it in an appeal? I don't know.\n\n"
    },
    {
      "time": "13 Mar 2006 — 1:27am",
      "content": "Hmm. You think I have overstated MS's position? Perhaps I have. I will have to reread the material. In any case, in common law, you can't appeal factual findings, roughly speaking, but only the application of law to those findings -- I think. How this works for the EU I have no idea. There is also only so much we can learn from the rather sparse material on display here. We have not seen any of the briefs, we have not heard any of the arguments. Whatever the case, I have the feeling that MS's statement, or acquiescence in Lino's position, whichever it is, has made the case irretrievable for MS. I can't wait for the next installment! Whatever happens, I get the feeling that this is an important event in the development of practical type law and type ethics. Why it should so have touched a nerve, why it should continue to interest, I have no idea. But it does. It is different from a lot of similar cases in the past, perhaps because of the stature of the typeface, the designer, and the corporations involved; perhaps it is just the world historical mood. Perhaps it is just that there has simply been too much of this. This seems to be the one moment when everyone rose up with one voice to say 'Enough!'\n\n"
    },
    {
      "time": "13 Mar 2006 — 2:33pm",
      "content": "1)\n\n\\> OED defines theft as ‘The action of a thief; the felonious taking away of the personal\n\nIt is okay to speak of \"theft\" in the Segoe case, provided this term is used metaphorically. But from the legal point of view, the word \"theft\" should be avoided here, because most states of Europa and also most states of America restrict \"theft\" to \"movable property\", for example:\n\n\"Whoever intentionally and without claim of right takes, uses, transfers, conceals or retains possession of movable property of another without the other's consent and with intent to deprive the owner permanently of possession of the property...\" (definition of theft in Minnesota penal code).\n\nAccording to the above Minnesota statute definition of \"theft\", one can e.g. steal a CD containing fonts (because CDs are \"movable\"), but one cannot e.g. steal the design of a font (because the design is \"intangible\").\n\n2)\n\n\\> This implies that Adobe has attempted to register Myriad and that the EU has\n\nThe forgery Myriad contains the legal declaration \"U.S. Patent Des. pending\", but it is unknown to me, whether Adobe Inc. registered Myriad in Europe. This would be illegal in Europe, since Myriad is a forgery of Frutiger. Registering a forgery of Frutiger in Europe constitutes the crime of fraud, if the sale of the forgery takes place. In the Segoe case, the crime of fraud did not yet take place, since the sale of this Frutiger forgery (or rather the sale of Windows Vista containing the forgery) does not yet take place in Europe.\n\nNote: The invalidity division stated that \"the prior design and the RCD are to be considered identical\". The prior design is the original, and the RCD is the forgery. In the Myriad case, the invalidity division would certainly arrive at the same conclusion as in the Segoe case.\n\n3)\n\n\\> Who, by the way, is Graf von so and so?\n\n\"Bosch, Graf von Stosch, Jehle\" (note the commas) are the names of lawyers of a law firm in the city of Munich in Germany representing the Microsoft Corporation in patent law matters.\n\nsee [http://www.bgsj.de](http://web.archive.org/web/20150123102714/http:/www.bgsj.de/ \"http://www.bgsj.de\")\n\n4)\n\n\\> The judgement states that Linotype’s observation that the Segoe and Frutiger are  \n\\> identical is uncontested by Microsoft. That seems to me something less than a  \n\\> positive statement by Microsoft: it may simply mean that they did not elect to  \n\\> answer this observation at all. Could they choose to address it in an appeal?\n\nIt should be emphasized that the invalidity decision is not a \"judgement\" by a law court, but a decision by a non-judiciary administative office. For those who want to know to what extent the design of fonts may be protected in Europe, I uploaded the full text of the \"Council Regulation No 6/2002 of 12 December 2001 on Community designs\" as document Segoe4.pdf to my website\n\nsee [http://www.sanskritweb.net/forgers/index.htm#Monotype](http://web.archive.org/web/20150123102714/http:/www.sanskritweb.net/forgers/index.htm#Monotype \"http://www.sanskritweb.net/forgers/index.htm#Monotype\")\n\nMicrosoft of course is permitted to appeal (see the invalidity decision shown in file Segoe1.pdf and see also page 23 of file Segoe4.pdf). But what is more important, should Microsoft not win this appeal, it can institute legal proceedings at a real law court (see page 24 of file Segoe4.pdf). This means that the invalidity decision of the administrative invalidity division is not yet final, although the invalidity decision would become final, if Microsoft did not lodge an appeal.\n\nNevertheless, despite all these various legal remedies available to Microsoft, in my view it is practically impossible that Microsoft will win for two reasons:\n\na) From the procedural point of view, the fact that Microsoft did not contest (\"As rightfully observed by the Applicant and uncontested by the Holder, the prior design and the RCD are to be considered identical.\") has the procedural consequence that any later contestation will not be accepted by a law court on account of the legal principle called \"venire contra factum proprium\". Therefore to assume \"it may simply mean that they did not elect to answer this observation at all\" would mean, at least by European procedural law, that the Microsoft lawyers Bosch, Graf von Stosch, Jehle made an unpardonable procedural mistake which is difficult or even impossible to remedy later by another law firm.\n\nb) However, even if Microsoft's belated contestation would be accepted by a law court, such a contestation is useless, because Microsoft cannot to prove that Segoe is \\*not\\* identical with Frutiger (\"identical\" in the sense used by the invalidity division). Therefore, in my view, the Microsoft lawyers Bosch, Graf von Stosch, Jehle did not make a procedural mistake, but instead came to the conclusion that would be futile to contest that Segoe is not a forgery of Frutiger.\n\n5)\n\nThe real trouble will start for Microsoft, as so as Microsoft starts selling Windows Vista including the forgery Segoe to customers in Europe. In strict legal parlance, Microsoft does not \"sell\" Windows in the same way a baker sells pancakes, but Microsoft \"grants licences\" via EULA contracts, i.e. it \"sells\" rights. But Microsoft does not own the rights to Segoe, since nobody can legally own the rights to any forgery of Frutiger. And since it constitutes the crime of fraud, if someone \"sells\" rights which do not exist, any European customer can request that the monopolist Microsoft sells Windows Vista without the forgery Segoe. And this means that Microsoft will have to offer two versions of Windows Vista: One version including the Frutiger forgery Segoe designed for Americans and one version without the Frutiger forgery Segoe designed for Europeans.\n\n"
    },
    {
      "time": "13 Mar 2006 — 3:45pm",
      "content": "Thank you, Uli, for clarifying these matters quite satisfactorily. I am interested in the detail you give as to the possible action against Microsoft for fraud that would appear to lie open to Linotype were Segoe to be sold or licensed in the EU. I had assumed that Linotype would have such an action open to them, since it is incontestable that Microsoft knew in enormous detail about the existence of Frutiger before they decided to forge it, to use the terminology you suggest: (a) MS had already licensed Frutiger for eBooks, not something Microsoft likes to do but in this case it evidently realised the induplicable benefits that would accrue from using Frutiger in eBooks and (b) Microsoft later attempted to license Frutiger Next for Vista, but refused to accept Linotype's terms of a penny (US) per OS unit sold/licensed.\n\nBut wouldn't that action technically lie open now, as a consequence of Segoe's exceptionally wide distribution to graphic designers and beta testers? We have to consider that Segoe is not only said by Microsoft to be an essential part of the UI in Vista. It has also been stated to be Microsoft's new corporate identity typeface and has been distributed as such.\n\nWhat I cannot quite understand is why Microsoft caused so many statements to be published online and elsewhere concerning the 'originality' of Segoe. This apparently was done in the full knowledge that these statements were not true.\n\nThis raises the question why such publication was made and when. Some of these publications appeared to be spontaneous 'comments' on blogs such as this one. It would now appear that such apparently spontaneous comments were in reality part of a carefully orchestrated propoganda campaign. I hate to use that politically charged word propoganda, but what else is there? From a practical standpoint, one would also be interested to learn how the parties to the forgery agreed to indemnify themselves.\n\nSadly, now that the issue has come to litigation, I expect it will be some time before we see any Microsoft employee publishing or posting any (dis)information about Segoe, for obvious legal reasons. Maybe I'm misreading the situation? In that case . . .\n\nHey guys! The floor is open to you! . . . . .\n\n"
    },
    {
      "time": "14 Mar 2006 — 2:47pm",
      "content": "Bill, I think you've said it all.  \nWith regards to the \"old\" guys not participating in the ClearType project, perhaps they were invited but share your politics and didn't want to sully themselves.  \nSo if push came to shove, and MS offered to pay you big bicks for a commission, would you accept?\n\n"
    },
    {
      "time": "14 Mar 2006 — 4:35pm",
      "content": "What exactly is sleazy about CT?!\n\nhhp\n\n"
    },
    {
      "time": "14 Mar 2006 — 8:20pm",
      "content": "It should be noted, for the sake of clarity, that Segoe UI was commissioned from Monotype by the Microsoft Typography group, while the ClearType Collection fonts were commissioned, from various designers, by the Advanced Reading Technologies group (who were also responsible for the eBook software and the earlier licensing of Frutiger). These two groups at Microsoft operate independently, with entirely separate budgets and mandates. If there are feathers to be tarred, watch where you are flinging the brush about.\n\nOf course, what corporate lawyers decide is the best strategy to pursue in a patent challenge doesn't necessarily reflect the personal views of people in either the MS Typography or ART groups.\n\nThe only thing to add is that I that I think Jeremy Tankard's Corbel, from the CT collection, would make a very nice UI and corporate identity font :)\n\n"
    },
    {
      "time": "14 Mar 2006 — 10:58pm",
      "content": "_What exactly is sleazy about CT?!_\n\nDo you think that Hermann Zapf or Adrian Frutiger would accept a commission to develop fonts for Microsoft?\n\n"
    },
    {
      "time": "14 Mar 2006 — 11:27pm",
      "content": "Thank you John for (I would judge) going out on a bit of a limb to make this point clear: the Segoe story has nothing (as far as I know or can imagine) to do with the ClearType story. It is important not to get the points confused. If Nick can get the two issues confused, anyone can get them confused, and they should not be confused. The fault may be mine, perhaps for having been unable to resist a cautious if slightly Menckenian dig (which I hope will have a brought a reluctant smile) at the CT project that I thought was so vague it would sail over everyone's head. My touch is clumsier than I thought and the remark should not have been made.\n\nNick, you raise some good points which I would like to address. You suggest that the old guys may have been invited to participate in the CT project but declined on political grounds. That is not the case, I happen to know. None of them was asked. Clearly, there was a desire to bring some new and younger faces on the scene. That is inherently laudable, extremely so. In this case, there were overriding practical reasons why it should not have been done, or not have been done to quite the extent it was done, but that has all been gone into on this forum and presumably forgotten. I wish it were quite off topic but it isn't. To continue with your train of speculation, since the 'Four Kings' weren't asked, we can't know how they would have responded. But I think I can safely guess that they would have accepted, and for two reasons. The first is that almost no type designer can afford to turn down a commission, and to go further, there is scarcely, I think, any artist or craftsman who is not eager to make the Faustian compact, if only he is given the chance.\n\nThe second reason is that the designer/artist/craftsman who is dealing with the devil always thinks he can do something to correct the devil's ill deeds. The latter of these factors operated for Zapf when he consented to design Linotype Palatino for Microsoft. I don't think he needs the money, but I do know that he ardently hoped, and was led to believe, that 'Book Antiqua' - as great an affront to him as Segoe is to Frutiger - would disappear from the Microsoft OS. And it did. But not from Microsoft apps. Apparently, Book Antiqua is too entrenched to enjoy the death that Zapf was led to expect would befall it when he consented to build Linotype Palatino for Microsoft. I believe that the deed could have been done with some sort of substitution tables and perhaps some explanatory information, but Microsoft, undoubtedly for what it saw as overwhelming practical reasons, chose not to go that way. At least as I understand what transpired. Furthermore, though Book Antiqua was designed to have metrics identical to Postscript 35 Palatino, what if the new Linotype Palatino metrics were not identical? And wouldn't that have been an unfair burden to place on the designer?\n\n'So if push came to shove, and MS offered to pay you big bicks for a commission, would you accept?'\n\nI would like to say 'indubitably yes', but I am so unaccountable, there's no telling what I would do. And I very much doubt I will ever have the opportunity to find out.\n\nWhat I would like to say is that your remarks connect with something that has been going on in my head over the last few days, and that is that I constantly find myself looking for an easy way to solve some type problem and get something out there that is good and doesn't take much effort. And I am constantly finding that every time I try to do this, it doesn't work. But I can't stop myself from looking for an easy way out. You would think, after all this time, I would have learnt my lesson. And I am just thinking in the realm of pretty ordinary text type. I can imagine that a charming, daffy, and quite original display typeface like your Fontesque might have sprung out pretty quickly and effortlessly. On the other hand, it would not surprise me if a lot of long and grueling work went into it. Which way was it for you, Nick?\n\nFinally, and getting further off topic, John, I would not be surprised if Corbel would make a great UI and corporate font, but you really ought to make an effort to show it better than you have done in the past! Speaking of which, we are very busy here defending the Frutiger typeface, as it is right for us to do. But I quite agree that almost anything else would have been a better choice for Microsoft. Especially given Apple's extensive use of Myriad. Isn't it amazing how exceptionally staid and rigid technology companies are in their corporate ID schemata? I sometimes find myself thinking that I would be happy never to see Frutiger again. It needs a rest. Yet on the other hand, it _has_ had a rest. Here we are seeing its second period of triumph. And maybe the reason both Apple and Microsoft are using Frutiger so extensively is that the matter is, somehow, not really in their control? That Frutiger is, somehow, the typographic language such a company _has_ to speak at this point in time? The more I learn about Frutiger, the more powerful it seems.\n\nBe that as it may, the ethical issue does not change. It doesn't matter if you like Frutiger or dislike Frutiger. It doesn't matter if you want to use it, or don't want to use it, or are compelled by inscrutable forces to use just this Weltbild/design against your will: if you do actually use Frutiger, you must pay Linotype, its owner, for it.\n\n"
    },
    {
      "time": "15 Mar 2006 — 1:42am",
      "content": "\\> Do you think that Hermann Zapf or Adrian Frutiger would  \n\\> accept a commission to develop fonts for Microsoft?\n\nOh, so you're saying MS as a whole is terminally sleazy.\n\nNevermind that for years they've been contributing more to quality  \ntypography among the masses than any other large corporation.\n\nSo Nick, is it about culture for you, or is it really about <cite>money</cite>?\n\n\\> a desire to bring some new and younger faces on the scene.\n\nWhich makes it very ironic that Nick's trademark forceful endorsement for the contemporary versus the established precedent conveniently doesn't apply when it comes to a party that he feels hurts his bottom line (essentially by releasing better fonts).\n\n\"So if push came to shove, and MS offered to pay you big bicks for a commission, would you accept?\"\n\nYou would, Nick.\n\n\\> The more I learn about Frutiger, the more powerful it seems.\n\nNot to me. The fact that Apple and MS use it  \nsimply means it has a \"staid\" corporate voice.\n\n\\> if you do actually use Frutiger, you must pay Linotype, its owner, for it.\n\nBut only because Linotype is a reasonable entity. Otherwise,  \nthe ethical and legal paths diverge, and I for one prefer  \nfollowing the former (as much as I can manage).\n\nhhp\n\n"
    },
    {
      "time": "15 Mar 2006 — 6:03am",
      "content": "\\> Thank you, Uli, for clarifying these matters quite satisfactorily.  \n\\> I am interested in the detail you give as to the possible action  \n\\> against Microsoft for fraud that would appear to lie open to  \n\\> Linotype were Segoe to be sold or licensed in the EU.\n\nAs already stated by me, the real trouble does not start now, but will start in the near future, e.g. by the end of 2006 or later, when Windows Vista is sold by Microsoft in Europe. There are three different legal scenarios, namely these:\n\n1) Segoe as ordinary fraud crime\n\nThis legal scenario cannot be specified presently, because it is not yet known, whether e.g. Ascender will sell the Frutiger forgery Segoe in the near or far future.\n\n2) Segoe as \"branding\" case\n\nThis legal situation already exists today, because Microsoft and its advertising and promotion agencies already today use Segoe as \"branding\" font for typesetting of Microsoft advertisements etc. See the publicity PDF files at the [www.Microsoft.com](http://web.archive.org/web/20150123102714/http:/www.microsoft.com/ \"www.Microsoft.com\") website.\n\nIn the Segoe \"branding\" case, the legal situation is completely identical to the legal situation in the United Parcel Service case (UPS Sans vs. FF Dax alias Barmen). This latter case has already been described by me in a 16-page German-language document:\n\n[http://www.sanskritweb.net/forgers/barmen.pdf](http://web.archive.org/web/20150123102714/http:/www.sanskritweb.net/forgers/barmen.pdf \"http://www.sanskritweb.net/forgers/barmen.pdf\")\n\nWhatever was said in this document concerning the UPS Sans \"branding\" case also applies to the Segoe \"branding\" case so that there is no need to repeat here what was said there.\n\n3) Segoe as EC anti-trust case\n\nThe legal scenario for this case cannot be specified presently, because everything depends on whether or not Microsoft will include Segoe into the Windows Vista version distributed in future in the European Community.\n\nMicrosoft as a monopolist has repeatedly ignored the European anti-trust laws, notably in the \"500 million Euro fine\" case two years ago:\n\n[http://www.dw-world.de/dw/article/0,2144,1149791,00.html](http://web.archive.org/web/20150123102714/http:/www.dw-world.de/dw/article/0,2144,1149791,00.html \"http://www.dw-world.de/dw/article/0,2144,1149791,00.html\")\n\nFor the current EU vs. Microsoft situation see the official website here\n\n[http://www.eurunion.org/News/press/2006/20060016.htm](http://web.archive.org/web/20150123102714/http:/www.eurunion.org/News/press/2006/20060016.htm \"http://www.eurunion.org/News/press/2006/20060016.htm\")\n\nFrom this official website, it becomes apparent that the European Anti-Trust Commission does not accept the illegal \"bundling\" behaviour of Microsoft concerning the Windows operating system components.\n\nLet us assume, Microsoft will sell Windows Vista \"bundling\" the Frutiger forgery Segoe in Europe, then it is likely that the monopolist Microsoft will be forced by the European Commission to \"unbundle\" Windows Vista, i.e. to sell it without this forgery, because nobody in Europe can be expected to accept forged fonts as part of an operating system, in the same way as nobody can be expected to accept forged bank notes as part of the monthly salary.\n\n"
    },
    {
      "time": "15 Mar 2006 — 6:27am",
      "content": "Is Segoe named after Tom Rickner's street?\n\nJohn, sight unseen, but market well know, no one in thier right corporate mind would choose a MS CT font for a Corp logo or ID, Should They?!\n\nBill, I'm not at all hungry for anymore monolithic 1-style-fits-all UI faces.\n\nThis whole issue seems to be a good example of the old saying that \"all corruption empowers.\"\n\n"
    },
    {
      "time": "15 Mar 2006 — 8:52am",
      "content": "_Oh, so you’re saying MS as a whole is terminally sleazy._\n\nYou're putting words in my mouth. Remember, you prefer to argue with a straw dog rather than the real thing.\n\n_a party that he feels hurts his bottom line (essentially by releasing better fonts)_\n\nLearn to distinguish principle from self-interest. I have an issue with font bundling and plagiarism, but that has nothing to do with my bottom line (which is just fine thanks), or the quality of the fonts invovled.\n\n_the established precedent conveniently doesn’t apply_\n\nSo what you're saying is it's OK for Microsoft to play hardball with other people's intellectual property, as long as some of their stuff is original?\n\nIn general, the font business' attitude towards intellectual property doesn't earn my respect, so I think it's kind of pointless to get on a high horse, when our own house isn't in order, as evidenced by the behaviour of our major players.\n\n_You would, Nick._\n\nIn your dreams, Hrant.\n\n_no one in thier right corporate mind would choose a MS CT font for a Corp logo or ID_\n\nWearing the same colour shirt as everyone else is a quick way to become part of the establishment. Or as the saying goes, the nail that stands out is hammered down.\n\n"
    },
    {
      "time": "15 Mar 2006 — 9:07am",
      "content": "Nick, you were implying that Zapf and Frutiger  \nwould refuse to work with MS. If that does not  \nmean there's something inherently wrong with  \nMS (I mean in terms of font development) then  \nfeel free to explain.\n\nAnd please don't deploy an \"I was jesting\" escape clause this time.\n\n\\> Learn to distinguish principle from self-interest.\n\nStop spinning.  \nAren't you supposed to be supporting the young'ns as opposed to Bill's 4?  \nMy point is in general you would be, except you feel MS hurts  \nyour business - but that connection is opportunistic of course.\n\n\\> So what you’re saying is it’s OK for Microsoft to play hardball  \n\\> with other people’s intellectual property, as long as some of  \n\\> their stuff is original?\n\n1) Pretty much, but it would have to be most (and it is) not just some.  \n2) Not original, but useful. Making originality central is too artsy.\n\n\\> I think it’s kind of pointless to get on a high horse\n\n?!\n\n\\> In your dreams, Hrant.\n\nActually, in yours! :-)  \nAn average of once a month I reckon.\n\nhhp\n\n"
    },
    {
      "time": "15 Mar 2006 — 9:59am",
      "content": "_Nick, you were implying that Zapf and Frutiger would refuse to work with MS_\n\nThe way I heard it, Hermann Zapf quit ATypI because of Book Antiqua, the MS face that looks like Palatino. Adrian Frutiger was miffed at Adobe for Myriad's resemblance to his eponymous face. There's two type designers that would likely decline an invitation to work for MS, don't you think? Maybe there are others who, out of sympathy, or on general principle, would also not make a good fit with MS -- perhaps the four Bill mentioned, certainly myself.\n\n_Aren’t you supposed to be supporting the young’ns as opposed to Bill’s 4_\n\nI support originality and contemporary type designs, regardless of the designer's age.\n\n_you feel MS hurts your business_\n\nMy business has never been better, and I'm looking forward to expanding into the CE, Greek and Cyrillic font market -- which is something that MS is opening up. So why would I think MS is hurting my business?\n\n"
    },
    {
      "time": "15 Mar 2006 — 10:09am",
      "content": "\\> There’s two type designers that would likely decline  \n\\> an invitation to work for MS, don’t you think?\n\nZapf: Did you not read what Bill wrote above?  \nFrutiger: Sadly, he has a \"better\" reason not to accept.\n\nAnd what does that have anything to do with CT?!  \n(See above. And you thought you could distract me...)\n\n\\> Maybe there are others who, out of sympathy, or on  \n\\> general principle, would also not make a good fit with  \n\\> MS — perhaps the four Bill mentioned, certainly myself.\n\nWrong on both counts.\n\nOn the other hand, at this rate you're well  \non the path of a self-fulfilling prophecy...\n\n\\> I support originality and contemporary type  \n\\> designs, regardless of the designer’s age.\n\nSuper.  \nNow compare the œuvre of the guys who worked on CT versus Bill's 4.\n\n\\> So why would I think MS is hurting my business?\n\nNo idea. You've only brought it up like a million times.  \n(I feel an \"I was jesting\" coagulating...)\n\nhhp\n\n"
    },
    {
      "time": "15 Mar 2006 — 10:19am",
      "content": "from David\n\n'Is Segoe named after Tom Rickner’s street?'\n\nNo, that is a myth.\n\n'John, sight unseen, but market well know, no one in thier right corporate mind would choose a MS CT font for a Corp logo or ID, Should They?!'\n\nIs what you're really saying here that a typeface is always tarred with its intention? I'm expressing it badly, but I get the feeling you're trying to make an important point about the depth of study that should (must) go into a successful corporate ID process.\n\n'Bill, I’m not at all hungry for anymore monolithic 1-style-fits-all UI faces.'\n\nOK. After - how many is it now? literally half a million glyphs? after so many, you're entitled to say, Enough! You earned the right. But would you also decline the opportunity to design a corporate ID for MS? Wouldn't that be an interesting enough challenge? On the other hand, it would be a very muddy issue if the brief were to devise both a corporate ID and a UI. That seems to me insane, something only either a clueless executive could dream up - - or is it in reality a brilliant requirement?\n\n'This whole issue seems to be a good example of the old saying that “all corruption empowers.”'\n\nI blush to say I never heard that one, but I really like it.\n\nBy the way, to set the record straight. Segoe is named after Bill Davis's great-great-grandmother, Amalie von und zu Segoe, who was the cousin of Gräfin Sophie zu [but not von] Segoe, familiar to type historians for her role in preserving the Auerbach matrices in the cellar of her manse during the Franco-Prussian war. This information is well known to _anyone_ who has perused the pages of the Almanach de Thypa of 1894. There is a copy at Yale.\n\nBack to the topic, I really like the way Nick is trying to express, through the static, the fundamental point that type is intellectual property to be respected. When put this way, it seems so utterly shocking that it's the American habit not to respect it. I like too Uli's expression of the old world attitude: 'nobody in Europe can be expected to accept forged fonts as part of an operating system, in the same way as nobody can be expected to accept forged bank notes as part of the monthly salary.'\n\nWhen you think about it, there is nothing more painful than for a type designer to be told, after years of work on something - - 'this is not yours, it is mine'. It is an issue that must be addressed. And I think we are, slowly, seeing it be addressed. The attention Matthew Carter got in the New Yorker is one example. The attention that Segoe is getting is another. Something is shifting in the wind.\n\n"
    },
    {
      "time": "15 Mar 2006 — 10:42am",
      "content": "\\> would you also decline the opportunity to design a corporate ID for MS?\n\nSort of pre-emptively, sorry:  \nWasn't it FB that worked with Brody on Macromedia's ID?  \nYou know, the guys whose software not only ignores embedding  \nrestrictions but actually [internally] converts the outlines?  \nWas that unethical of FB? Well of course friggin' not.\n\n\\> The attention Matthew Carter got in the New Yorker is one example.\n\nPlease elaborate.\n\nhhp\n\n"
    },
    {
      "time": "15 Mar 2006 — 11:15am",
      "content": "_Zapf: Did you not read what Bill wrote above?_\n\nNo, but I have now.  \nIt's sad what he says, about how people end up making the \"deal with the devil\".\n\n_You’ve only brought it up like a million times._\n\nAnd you still don't get it.\n\n_Wrong on both counts._\n\nOn the first, apparently, but somehow I don't see myself being approached by Microsoft with a design commission, or accepting the terms.\n\n_Which way was it for you, Nick?_\n\nThe original Fontesque sketches were done in a couple of minutes, but it was a lot of manual work scanning and tracing, then giving the fonts typographic colour. My first foray in Fontographer, learning the software at the same time. And it has a proper italic, -- I recall days spent trying to draw the italic \"g\" before ending up basing it on transformations of the roman g. That was 1993, a lot of type designers' first digital fonts were \"informal\". A few years later, techno, that was way less work.\n\n"
    },
    {
      "time": "15 Mar 2006 — 5:57pm",
      "content": "Bill:_Nick, you raise some good points which I would like to address. You suggest that the old guys may have been invited to participate in the CT project but declined on political grounds. That is not the case, I happen to know. None of them was asked ... To continue with your train of speculation, since the ‘Four Kings’ weren’t asked, we can’t know how they would have responded._\n\nBy 'Four Kings' I presume you mean the quadrumvirate you referred to above: Unger, Carter, Berlow, Stone. Don't forget that Matthew was very much involved in the CT project, designing the western companion forms to the Meiryo typeface. This is an impressive example of the importance of quite subtle changes to an existing design (Verdana) in harmonising with another script, and bears study, as I found when I prepared some comparison visuals for Margaret Re to use in her retrospective lecture on Matthew's work at the ATypI conference last year.\n\n"
    },
    {
      "time": "15 Mar 2006 — 6:14pm",
      "content": "David: _John, sight unseen, but market well know, no one in thier right corporate mind would choose a MS CT font for a Corp logo or ID, Should They?!_\n\nNot in its CT-optimised form, perhaps, but I was thinking in terms of adjustment of the design to appropriate weight and proportion. But this relates to the already odd situation of Segoe doing double-duty as a UI and corporate ID face.\n\nI've been using Corbel as a UI font for over a year, and despite not being designed specifically for that purpose it performs very well. It wouldn't take much to optimise the design for such a purpose, and I doubt if there would be much to recommend Segoe UI over it.\n\nWould Corbel do as well as Segoe as a corporate branding font (and bearing in mind that this is the whole of the question, not whether Segoe is a good choice itself)? It at least has the benefit of not being a Frutiger clone, and being well outside the similar genre employed by Apple.\n\n"
    },
    {
      "time": "15 Mar 2006 — 10:30pm",
      "content": "Hrant has drawn to my attention that the following paragraph may convey a message very different from what I meant:\n\n'When you think about it, there is nothing more painful than for a type designer to be told, after years of work on something - - ‘this is not yours, it is mine’. It is an issue that must be addressed. And I think we are, slowly, seeing it be addressed. The attention Matthew Carter got in the New Yorker is one example. The attention that Segoe is getting is another. Something is shifting in the wind.'\n\nWhat I meant is that one of the good things that is happening today is the positive attention that MC got in the New Yorker profile. Equally valuable, I think, is the negative attention that the Segoe forgery (to use Uli's uncomfortable but apparently absolutely accurate terminology) is getting. Both increase the public's awareness that type is valuable intellectual property which a few people really do try to make a living from. It is not something that magically appears from nothing, as a gift from history. Probably the type industry has been guilty of an enormous amount of negligence in failing to educate the public about the difficulties of making digital type today, about the enormous strides that have been made, and more importantly, about the enormous strides the _remain_ to be made. It's elementary marketing psychology: once you give people the feeling they ought to have something they don't have or that doesn't yet exist but may in the future, they want it. You're educating them into an expectation. From this point of view - basic customer education - the marketing of type in the US over the past twenty years has been unbearably inept.\n\nAnyway, Hrant feels that I was implying that there was something negative in MC's profile. Of course there isn't and I don't want anyone to think I was hinting at that. I think we are all unreservedly thrilled that Carter is getting this well-deserved attention.\n\nJohn, of course I knew quite well that the redesign of the Meiryo variant of Verdana was part of CT2 but I didn't count it as it was after all just a redesign of perhaps the most well-known constituent of CT1. However, you are right to remind people of this for the record. I think we would all be interested to hear more from you on the differences you speak of and would be grateful to have you post something about it, if you have the energy to start a new thread.\n\nI have one more off-topic question for Nick. OK. Fontesque was an easy birth and a slightly more difficult upbringing, but not too bad. But you were already a fairly experienced graphic artist at that point, weren't you? My last question then, would be, to what extent did years of previous training and work make it possible for it all to come out relatively fluently? Or was it just a kind of effortless gift?\n\nOh and finally, John, I don't think that it's very rigorous to argue that Corbel would suit MS as a corporate ID font on the grounds that at the very least, it isn't a Frutiger clone. I would have thought that a corporate ID font should be designed or chosen with a really thoughtful insight into what a company is and what it wants to convey. But then, in a perverse way, Segoe does penetrate to the historical soul of MS, doesn't it? Didn't Microsoft start out roughly as follows? IBM needed an OS for the 8088-based PC. So MS bought Seattle Computer's clone of Digital Research's CP/M (the standard for 8080-based pre-IBM PCs) for $25,000. Of course, as is well known, the only reason DR lost out to MS was that DR's founder kept IBM's executives waiting for so many hours they were literally forced into MS's arms . . . . Anyway, buying a clone is nothing new for MS. On the other hand, perhaps buying a forgery is? It will be interesting to see how this all pans out.\n\nMicrosoft seems to have some real difficulty dealing with the EU. Indeed, MS's difficulty in grasping the EU rather reminds me of IBM's difficulty in grasping Microsoft. IBM simply didn't have a clue, and one really must give MS credit for screwing those clueless suits again and again and again. Now, with the EU, you get the feeling that it's MS which has turned into the clueless suits. Uli keeps on harping on MS's status as a monopolist. And that of course is what IBM was so often accused of before Microsoft defanged it. Let us please remember that Microsoft deserves the credit for this historic deed!\n\nOf course it is unhealthy and ultimately deadly to progress for any company to enjoy a monopoly. But there is also a simple reality here: most of the world does not want to live with 30 different OSs, 3000 incompatible productivity apps with incompatible formats, and more incompatible documents than anyone could count this little world over.\n\nApologies for this overlong rant. I must really not want to work on my font this week.\n\n"
    },
    {
      "time": "16 Mar 2006 — 11:40am",
      "content": "_to what extent did years of previous training and work make it possible for it all to come out relatively fluently?_\n\nI was originally a fine artist, though more of a print-maker than a painter. I'm self-taught as a typographer (no training), although I did take a course in calligraphy. I worked as an art director from 1977, doing marker comps of headline type for hours every day until the Mac obviated that (for me) in 1988, so type drawing fluency was well practised. Also by the time I did Fontesque, I had been using Illustrator for 5 years, so I was familiar with BCPs. Having said that, I think a lot of type designers have a \"natural\" casual script typeface within themself -- I was fortunate that mine came out in 1994.\n\n"
    },
    {
      "time": "16 Mar 2006 — 12:34pm",
      "content": "_Oh and finally, John, I don’t think that it’s very rigorous to argue that Corbel would suit MS as a corporate ID font on the grounds that at the very least, it isn’t a Frutiger clone. I would have thought that a corporate ID font should be designed or chosen with a really thoughtful insight into what a company is and what it wants to convey._\n\nI was making the comment in the context of MS already using the same typeface for a UI font and a corporate marketing font. My point was that Corbel, with appropriate tweaking, could perform either role as well as or better than Segoe performs them. This is why I said that was the whole of the question in terms of comparing the two faces. Obviously there is another question about the appropriateness of either as a corporate branding type for Microsoft.\n\nPerhaps I should have limited my initial comment to the worthiness of Corbel as a UI font, which is actually the more interesting case. As I say, I've been using it as a UI font for many months, and think it works very well (mind you, my screen has a higher than average resolution).\n\n"
    },
    {
      "time": "16 Mar 2006 — 12:37pm",
      "content": "\\> my screen has a higher than average resolution\n\nWay.  \nAnd that dampens two of CT's three main faults.\n\nhhp\n\n"
    },
    {
      "time": "17 Mar 2006 — 10:24am",
      "content": "I compared some old and new font files of the Frutiger forgery Segoe, some with faked Monotype \"copyright\" notices and some with faked Microsoft \"copyright\" notices.\n\nThe \"creation dates\" in the font header are apparently faked too, and in some files intentionally erased (\"null\" entry, \"before\" 1970). The faked creation dates range from 1997 through 2005.\n\nIn case that creation year \"1997\" is not a fake, then Monotype at first made a forgery of the old Frutiger, and later, after publication of Frutiger Next, either Monotype or Microsoft made again a font forgery, but now of the new Frutiger.\n\n"
    },
    {
      "time": "17 Mar 2006 — 12:34pm",
      "content": "Uli, creation dates are notoriously unreliable indicators. They vary in accuracy depending on both the tool used and the attention of the manufacturer. And what is the creation date? The date on which the font source file was first created? The date on which the first shipping version was produced? People interpret it differently, and some people pretty much ignore it. The existence of fonts with older creation dates does not indicate much at all. I've seen fonts made last year that claim to have been made in 1969, because they were made with a tool that had a default setting for 1969 that needed to be changed by the font developer.\n\nHowever, in reference to the pre-Microsoft history of Segoe, [this comment](http://web.archive.org/) from Si Daniels at MST is worth rereading:\n\n_'The original Segoe fonts were not created for or by Microsoft. It was an existing Monotype design which we licensed and extensively extended and customized to meet the requirements of different processes, apps and devices.'_\n\nBy the wyay, forgery seems an inappropriate term to this English speaker, because it usually implies something fake passed off as something real, i.e. something not Frutiger passed off as Frutiger. In this case, we have something like Frutiger claimed as not Frutiger. If an intentional copy, it would be an example of plagiarism not forgery.\n\n"
    },
    {
      "time": "17 Mar 2006 — 1:00pm",
      "content": "_By the way, to set the record straight. Segoe is named after Bill Davis’s great-great-grandmother, Amalie von und zu Segoe, who was the cousin of Gräfin Sophie zu [but not von] Segoe, familiar to type historians for her role in preserving the Auerbach matrices in the cellar of her manse during the Franco-Prussian war. This information is well known to anyone who has perused the pages of the Almanach de Thypa of 1894. There is a copy at Yale._\n\nThat's hilarious, Bill. I think you should write a history of German typography in this manner.\n\nSegoe is actually named, indirectly, for Ladislas Segoe (1894-1983), an important figure in mid-century American urban planning who largely defined the role of urban planner as it is practised today (see. 'Ladislas Segoe and the Emergence of the Professional Planning Consultant' in the _Journal Of Planning History_, 2003, VOL 2; PART 1, pages 47-78). He is primarily associated with the city of Cincinatti, but also contributed to the planning of Madison Wisconsin, where there is indeed a road named after him on which Tom Rickner may or may not live.\n\n"
    },
    {
      "time": "17 Mar 2006 — 2:37pm",
      "content": "\\> By the wyay, forgery seems an inappropriate term to this English speaker,  \n\\> because it usually implies something fake passed off as something real,  \n\\> i.e. something not Frutiger passed off as Frutiger. In this case, we have  \n\\> something like Frutiger claimed as not Frutiger. If an intentional copy,  \n\\> it would be an example of plagiarism not forgery.\n\nThank you for your explanations.\n\nThe term \"forgery\" as it is use by me is a legal term in (German) law books defined as follows:\n\n\"forgery\" = \"a copy made in order to deceive\"\n\n- As a first step, a copy (or imitation or replica or clone) is made.  \n- As a second step, an act of deception (or of fraud) takes place.\n\nYour description \"we have something like Frutiger claimed as not Frutiger\" exactly fits my definition:\n\n- \"something like Frutiger\" is the \"copy\" of Frutiger.  \n- \"claimed as not Frutiger\" is the \"deception\".\n\nToday, I perused the German book \"Schriftstatistik\" (Typeface Statistics) by Peter Karow published in Hamburg in 1992. On page 25 of his book, Peter Karow publicly declared that he made a copy (or clone or reproduction) of the font \"Frutiger\" and labeled it \"Frutus\". Thereafter I looked up the 1000-page manual to Peter Karow's \"TypeWorks\" collection, wherein he publicly declared in the preface that his copy or his clone \"Frutus\" is the font \"Frutiger\". Therefore no deception took place, because here we do not have \"something like Frutiger claimed as not Frutiger\", but on the contrary Peter Karow claimed that \"Frutus\" is \"Frutiger\", i.e. a copy or clone of \"Frutiger\". Therefore, \"Frutus\" is not a forgery, because Karow did not deceive anybody concerning his copy or clone \"Frutus\". We may describe Peter Karow as a \"copyist\" or as a \"cloner\", but not as a \"forger\".\n\nNow let us compare Peter Karow to the forgers at Monotype and Microsoft. Did Steve Matteson at Monotype or Simon Daniels at Microsoft publicly and frankly declare that \"Segoe\" is a copy or a clone of \"Frutiger\"? No, they did not. On the contrary, they deceived Windows users concerning Segoe. For instance, the font forger Steve Matteson declares at his website\n\n[http://www.ascendercorp.com/portfolio\\_custom.html](http://web.archive.org/web/20150123102714/http:/www.ascendercorp.com/portfolio_custom.html \"http://www.ascendercorp.com/portfolio\\_custom.html\")\n\nthe following: \"Segoe is Microsoft's new branding typeface... Steve Matteson started this project...\". No mention of Frutiger, see? That is why \"Segoe\" is a forgery.\n\n"
    },
    {
      "time": "17 Mar 2006 — 2:40pm",
      "content": "\\> “a copy made in order to deceive”\n\nBut it wasn't. It was in order to save money.\n\nhhp\n\n"
    },
    {
      "time": "17 Mar 2006 — 3:44pm",
      "content": "If Quark can change its logo, maybe Microsoft could follow up on John's idea, ditch Segoe, and switch to its own Corbel.\n\n"
    },
    {
      "time": "17 Mar 2006 — 3:44pm",
      "content": "If Quark can change its logo, maybe Microsoft could follow up on John's idea, ditch Segoe, and switch to its own Corbel.\n\n"
    },
    {
      "time": "17 Mar 2006 — 5:23pm",
      "content": "_The term “forgery” as it is use by me is a legal term in (German) law books defined as follows: “forgery” = “a copy made in order to deceive”_\n\nBut you are translating this German legal definition into English and using the term in an English-language discussion in an English-language forum, and I think in this context the normal English usage of the term has to be acknowledged. Art or literary forgery provides the typical model: a copy (or work in a recognisable style) passed off as an original of the copied artist. Copying something and passing it off as your own invention is not usually called forgery: it is called plagiarism.\n\n"
    },
    {
      "time": "17 Mar 2006 — 7:40pm",
      "content": "Thank you John for your remarks on the Almanach. I wonder if Uli caught the rather cheesy reference to Faust? Albert de Frayne, a Monegasque chess player of great talent and undeserved obscurity who lurks here but sometimes corresponds with me privately, was completely deceived.\n\nNow to our vocabulary:\n\n'Copying something and passing it off as your own invention is not usually called forgery: it is called plagiarism.'\n\nWhich of course is not often considered an indictable offense, though it is frightfully bad manners. Good try, John! (In England, Uli, plagiarists are sometimes sent to Coventry, and if you know that expression, now verging on the archaic, your English is superb. I imagine most reasonably well-educated Americans are unfamiliar with it.)\n\nHowever, John, I think you are spinning the English definition too far away from OED: _The making of a thing in fraudulent imitation of something; also, esp. the forging, counterfeiting, or falsifying of a document._\n\nThe making of a thing in fraudulent imitation of something - that seems just about to fit the case of Segoe, and it is the primary sense of the word; the sense you and I use most comfortably is secondary though not secondary enough to be considered distinct. I admit that I too was uncomfortable with 'forgery' at first. But I now accept that was only because I didn't know what the word meant. It's very trying for a competent English writer to be corrected on a simple word usage by a German, but one sometimes has to submit to these indignities with as much grace as one can summon.\n\nYes, we all mostly know a popular, common sense of the word, which we often apply to paintings and documents. But that is not the exclusive sense. The larger sense in OED seems to fit this crime perfectly, and I can't think of a better term in English.\n\n'fraudulent imitation' is the key basic sense we have to grasp here.\n\nWhat does fraud mean? Again, in OED, the key sense is 'Criminal deception; the using of false representations to obtain an unjust advantage or to injure the rights or interests of another.'\n\nThat is absolutely on target here. Microsoft falsely represented to the EU that Segoe was an original typeface. It was indisputably their intention to injure the rights and interests of Linotype and Frutiger by doing so. I can't see any way round that.\n\n'Imitate' is too richly defined to quote here, but some key extracts are, 'to mimic, counterfeit', 'to copy, reproduce'.\n\nSo: I accept 'fraudulent imitation' as an exact description of Segoe.\n\nIn that case, why not accept 'forgery' since that is exactly what 'fraudulent imitation' means?\n\nThat fraud was intended, and achieved here, cannot I think be gainsaid, can it?\n\nOver the weekend I'm going to try and run the whole question by a couple of senior American federal judges I know; it will be interesting to see if they can provide any additional illumination. That's always supposing I can get them to understand what a digital typeface actually is. They are both getting on in years. But one is a real expert in derivative artworks, so his opinion should be worth having if he will give it.\n\n"
    },
    {
      "time": "17 Mar 2006 — 7:48pm",
      "content": "Nick, thanks for your further comments about Fontesque, which I think is one of the finest of all fantasy fonts, as one might call them. What you say confirms my feeling that it had to have come out of some substantial backlog of skill and experience. I apparently fibbed, by the way, when I said somewhere that I had written about it in the mid-90s. I looked through all my files and saw that though it was illustrated and captioned in a story I did on FontFonts for Publish or DTPJournal, or something like that, there wasn't enough room to actually say anything about it. Of course the story could have been changed at some point, and I don't have a print copy anymore. Oh let me stop blathering, nothing I wrote about fonts in the mid-90s is worth the bandwidth even at today's prices.\n\n"
    },
    {
      "time": "17 Mar 2006 — 9:30pm",
      "content": "_In that case, why not accept ‘forgery’ since that is exactly what ‘fraudulent imitation’ means?_\n\nAgain, the usual model of fraudulent imitation in a case of forgery is the passing off of the imitation as the original that it imitates, and that is what most people will think of when they hear the word forgery. In this case, the apparent imitation is being passed off as _not_ the original that it imitates, for which we have the very serviceable term plagiarism. Plagiarism is not in itself an indictable offence, as you note, but individual cases of plagiarism may certainly constitute fraud.\n\nBoth Linotype and Microsoft are my clients, so I'm not inspired to get into a discussion about intentions. Sorry. I have been frank all along, though, to anyone who cared to ask, that I believe Segoe to be too close to Frutiger. Even cutting Monotype the maximum slack and imagining that they could have produced this design without deliberately referencing Frutiger and Frutiger Next, the result is unacceptably close. Stupidly so, in fact, and I'm amazed anyone thought it was a good idea to license it. Even with the best of intentions to produce a new design in this style, I think that this subgenre of humanist sans serifs is too narrow a field to support much more than already exists without the whiff of plagiarism: between them, Frutiger, Myriad and Stone Sans have pretty much covered all the bases.\n\n"
    },
    {
      "time": "18 Mar 2006 — 1:03am",
      "content": "\\> Copying something and passing it off as your own invention  \n\\> is not usually called forgery: it is called plagiarism.\n\nSince my \"Font Forging Industry\" website ( [http://www.sanskritweb.net/forgers](http://web.archive.org/web/20150123102714/http:/www.sanskritweb.net/forgers \"http://www.sanskritweb.net/forgers\")) is visited daily by hundreds of visitors from all over the world, I selected the very broad generic legal term \"forgery\", because I could not find a better generic legal term which could be understood by visitors from Netherlands, Brazil, Italy, Canada, Romania etc. (just to quote a few countries from my today's website statistics), who live in different countries with different laws. Of course, in my German-language documents on the \"Font Forging Industry\", I use other very special German legal terms, but these much more specialized German legal terms cannot be generalized for all other countries.\n\nThe term \"plagiarism\" (in German and in French: \"Plagiat\") suggested by Mr. Hudson has the disadvantage that it is a term, which does not occur in the laws of the countries which I know. For instance, \"plagiarism\" does not occur in German laws, nor does \"plagiarism\" occur in the American nor in the British nor in the French copyright act. For instance, when you download the entire \"Copyright Law of the United States\" contained in the PDF file\n\n[http://www.copyright.gov/title17/circ92.pdf](http://web.archive.org/web/20150123102714/http:/www.copyright.gov/title17/circ92.pdf \"http://www.copyright.gov/title17/circ92.pdf\")\n\nand when you, after downloading, search via Adobe Acrobat for the term \"plagiarism\" in this PDF file, you will not find any occurrence of this term \"plagiarism\". I also checked the British \"Copyright, Designs and Patents Act\" and also checked the French copyright code, and as regards Germany, I can say with conviction that the term \"Plagiat\" is never used in any of the many German civil and penal laws.\n\nThe term \"plagiarism\" is a literary term, which may be used in the New York Times Literary Supplement, but it is not a legal term, because it does not occur in American laws and hence does not have a legal definition.\n\n"
    },
    {
      "time": "18 Mar 2006 — 2:19am",
      "content": "Well, aren't we glad Typophile isn't a court of law!\n\n\\> [http://www.sanskritweb.net/forgers](http://web.archive.org/web/20150123102714/http:/www.sanskritweb.net/forgers \"http://www.sanskritweb.net/forgers\")\n\nSo what's that word in \"Barmen - Sari - Dax - UPS Sans -Wer plagiierte was?\"\n\n\\> None of the notorious forgers ever dared to sue me, because I describe the facts.\n\nIt might actually have more to do with you not being in the US.\n\nhhp\n\n"
    },
    {
      "time": "18 Mar 2006 — 3:45am",
      "content": "1)\n\n\\> So what’s that word in “Barmen - Sari - Dax - UPS Sans -Wer plagiierte was?”\n\nI explained on page 8 of above file [www.sanskritweb.net/forgers/barmen.pdf](http://web.archive.org/web/20150123102714/http:/www.sanskritweb.net/forgers/barmen.pdf \"www.sanskritweb.net/forgers/barmen.pdf\")\n\n\"Abschließend sei bemerkt, daß ich auf eine rechtliche Beurteilung des Falls verzichtet habe, weil ich den Wortlaut des Vergleichs nicht kenne. Die Begriffe \"Plagiat\" und \"Selbstplagiat\" habe ich nur im metaphorischen Sinne verwendet, denn erstens ist dem deutschen Urheberrechtsgesetz der Begriff des Plagiats fremd, und zweitens sind Fonts ohnehin nicht urheberrechtlich geschützt...\"\n\n2)\n\n\\> It might actually have more to do with you not being in the US.\n\nMost companies at least have subsidiaries in Germany (Adobe, Microsoft, UPS etc.) or even have their headquarters in Germany (e.g. Linotype, FontShop etc.). An exception for example is Monotype which no longer exists in Germany due to bankruptcy.\n\n"
    },
    {
      "time": "18 Mar 2006 — 4:57am",
      "content": "John:  \n\"Not in its CT-optimised form, perhaps, but I was thinking in terms of adjustment of the design to appropriate weight and proportion.\"  \nCan that be done? Are there variations of these fonts? or are you talking about the original designers making variations and licensing them to other Corporations? Is that possible with the CT fonts or the Segoe font?\n\nThe other thing I'd like to say without intending to be obnoxious, judgemental or demeaning, and that is that at some point a type design becomes so bland, vanilla, average-looking, and otherwise completely undistinguished, that there are plenty of other fonts that it is going to look a lot like for the simple reason that so many people want this kind of disappearing type. There is no space to invent because invention is not important.\n\nWhat's any law gonna do about it?\n\n"
    },
    {
      "time": "18 Mar 2006 — 6:24am",
      "content": "\\> “Abschließend sei bemerkt ...\n\nEnglish? (Or French, Spanish, Arabic or Armenian?)\n\n\\> Most companies at least have subsidiaries\n\nYou missed my point.  \nOver here you don't need to break a law  \nto get sued, you just need to be poorer.\n\n\\> What’s any law gonna do about it?\n\nFor that you'd need a king.\n\nhhp\n\n"
    }
  ]
}
