{
  "id": "1825",
  "title": "How to make them pay?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I did a small website recently for a hairdressers.   \nAs they're local, and a small company with only 4 salons I charged them less than half my standard rate. (Even though my only connection with them previously has been them charging my wife\n\n",
  "author": "<a href=\"/web/20110817030309/http://typophile.com/user/1717\" title=\"View user profile.\">steve_p</a>",
  "time": "<br>",
  "uid": "1717",
  "comments": [
    {
      "time": "",
      "content": "\\> How do you deal with customers who don't want to cough up?   \n   \nTell them you'll dedicate big chunks of your free time making them miserable, by any means   \navailable, if they don't pay. I've only had to do that a couple of times, with adequate results.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "A few things to consider:   \n   \nFirst of all, was there a contract? Doesn't sound like it. Does the invoice state a late-fee policy? I hope so. Late fees are important for two reasons: 1) It motivates the client to pay on time, and 2) it helps you keep the matter professional and allays some of the resentment you naturally feel (since the later they are, the more money you ultimately get).   \n   \nI would _not_ post a snarky message on their website; that reflects poorly on you as a professional. As pissed off as you (understandably) are, you won't regret behaving professionally -- and you might well regret throwing the tantrum you'd like to throw.   \n   \nIf you don't have a contract or a late fee to enforce, you might start by sending them a letter (does the UK post have some option for confirming receipt of the letter?) stating how many days overdue the payment is, and perhaps telling them that if they don't pony up within _x_ more days, _y_ action will take place.   \n   \nAction could be: bringing in the lawyers, stopping their email, etc. Whatever it is, make sure it's practical and professionally appropriate. And then, as with an unruly child, whatever consequence you promise, you _must_ follow through with it.   \n   \nA final note: try, if you can, to separate their annoying-ness as a client with the nonpayment issue. The work is done, and it probably won't help get you your money if you actively hold that part against them. It does sound like a nightmare job -- but in the future, some firm customer education up front as to your role can go a long way.   \n   \nGood luck! This kind of thing happens to most designers at some point, and it is a royal pain in the . Be persistent and professional, and bring in the big dogs if you have to.\n\n"
    },
    {
      "time": "",
      "content": "Eight weeks is 60 days. Receivables have gone from 30 to 45 to 60 and onwards to 90 and 120 days. These days in NYC 60 days is not considered an unreasonable amount of time to wait for the bill to be paid.   \n   \nNot great but it is becoming the custom.   \n   \nIve heard a few stories that the traditional wait for receivables in the department store business is excess of 360 days.   \n   \nI remember not too long ago when most invoices were paid in 10 to 30 days.\n\n"
    },
    {
      "time": "",
      "content": "Receivables are supposed to be paid according to the terms set by the vendor -- not by some standard or average out there. F'rinstance, my invoice clearly states when a late fee will begin to be assessed and what the fee is. If I have to send a statement or follow up personally, I can refer to this. I don't always use a contract at the beginning of a job (I should, but I don't), but when I do, the terms are in the contract and signed by the client before work begins.   \n   \nBottom line: the vendor sets the terms, and the client agrees to them. (Negotation is always an option, of course, but it's still in the vendor's hands whether to take the job or walk away.)\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the replies.   \nWhile I'd like to take Hrant's route (with 'any means available' involving pointed sticks, a wire brush and Dettol), I think Meredith's caution is probably the way to go.   \n(Although the narky message I suggested earlier was what I considered to be the cautious route).   \nThere was a contract, including a late payment charge, but the amount involved isn't one that I really want to fight for in court - though I will if I have to. I don't think they will let it go that far, I'm sure they'll cough up before then. I'm just pissed off that doing someone a favour ends up like this. (I even avoided telling them exactly what I normally charge because I didn't want them to feel bad about getting such a discount!)   \n   \nHave you seen [www.introducingmonday.co.uk/](http://web.archive.org/web/20110817030309/http:/www.introducingmonday.co.uk/), apparently created by disgruntled ex-employees? (Its best with sound)\n\n"
    },
    {
      "time": "",
      "content": "If there was a contract, you're golden. You could always have your imaginary lawyer send them a threatening letter on their threatening letterhead (you know, the letterhead you're about to create on your computer). It's amazing what an attorney's presence can do -- even when the attorney doesn't actually exist.   \n   \nFWIW, I feel your pain -- it often seems that when you do clients a favor without telling them, that's when you most wish they knew.\n\n"
    },
    {
      "time": "",
      "content": "It's helpful to make it clear on the invoice that there's interest levied on overdue invoices (1.5% to 2% per month is typical). That way, the money owed you by late payers is growing at a rate of 15-20% annually. Not a bad investment, assuming you get the money eventually.   \n   \nVarious books on running your own design business suggest strategies for collecting late invoices. These include sending monthly invoices with updated figures (due to interest) and stages in which polite, hand-written reminders are followed by \"Urgent: overdue!\" envelopes and so forth.   \n   \nYou want to avoid court and pissing off your client, if possible. Many clients buy services they can't afford to pay for - at least not immediately, and often a payment plan (with interest) can be worked out if you contact them directly.   \n   \nLastly, make sure you have the documentation (a contract helps) available if you need to visit small claims court.   \n   \n[Disclaimer: This is mostly theoretical for me, since I have yet to have any significant clients be late on their bills.]   \n   \nPaul\n\n"
    },
    {
      "time": "",
      "content": "Steve,   \n   \nWithout a contract (I use a modified version of the [AIGA's Standard Form of Agreement for Graphic Design Services](http://web.archive.org/web/20110817030309/http:/aiga.org/content.cfm?CategoryID=111)) you have nothing in the way of legal recourse. I cannot overemphasize the importance of this. A contract protects you and your client and lets them know your a professional.   \n   \nAlso, I use a Project Planner/Client Survey/RFP type document upfront. After initial contact has been made and a potential client has expressed an interest in your services, have them fill out such a survey which forces them to really think about their goals, customers and competition. If they are unable to do this, that's a red flag. It indicates that they really don't know why they're doing what they're doing. Without a proof of concept, it's nearly impossible to create anything of value. At this point, you may want to meet with them in person to \"go through\" the survey. Some clients are better at talking about what they need than writing it down. Either way, the information (or lack thereof) provided in such a document/meeting goes a long way torward indicating weather the project is feasible.   \n   \nLastly, if there charging 70quid for haircuts, they can afford your full rate. Don't EVER undersell yourself.   \n   \nAt least you have control over the domain, so you can always just switch it off.   \n   \nIf all else fails, send 'round Tony and Fat Polly to collect and \"forgetta about it.\" ![:-)](http://web.archive.org/web/20110817030309im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n -t\n\n"
    },
    {
      "time": "",
      "content": "\\> the amount involved isn't one that I really want to fight for in court   \n   \nExactly.   \nAnd when getting a lawyer (I mean a real one) isn't an option, _seeming_ -but not being- what might be called \"unstable\" to people who realize they owe you something can often simply scare them into coming around. Who wants to lose sleep over somebody who seems intent on making you miserable when all you have to do is pay them what you were supposed to all along? It's sort of a last resort, when you're sure they're trying not to pay up. And eight weeks isn't that long - I had to wait over a year once!   \n   \nAppear professional/emotional as needed, to get \"the enemy\" to retreat.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Steve, does your jurisdiction have a small claims court? Filing a claim for small claims court is typically fairly simple and lawyer-free. You go and get the forms and you officially notify the client that they have X number of days in which to pay before you file the papers. This is usually enough to prompt someone into writing a cheque.\n\n"
    },
    {
      "time": "",
      "content": "Says Meredith   \n\\>Receivables are supposed to be paid according to the \\>terms set by the vendor --   \n   \nI'm glad for you that you feel strongly about this, but I wonder if anyone ever really collects on their late fees. I fear that it is something one includes to make one feel empowered, but when push comes to shove...   \n   \nAre you really going to jepordize your business relationship for a few fracational percentage points of short term interest, if your client decides to pay on 60 instead of 30 days? Or 90 instead of 45?   \n   \nOne may like to say that the vendor sets the terms, but it comes down to who has the larger financial and legal clout. And that rarely falls in the designers court (pardon the sports analogy).\n\n"
    },
    {
      "time": "",
      "content": "I collect on my late fees when the client is markedly late. It doesn't jeopardize my business relationship -- I keep it friendly, and I'll generally waive the fee the first time or if the client asks me to because of a special circumstance.   \n   \nI only have one client who regularly pays late; since I do ongoing work for them, I invoice them every month and just add the late fee to the next month's invoice. They always pay eventually, with no complaints. I don't see any problem with this practice. I'm not so rigid that I would let it interfere with the relationship -- but as I mentioned to Steve, the late fee lets me continue working for them without resentment.\n\n"
    },
    {
      "time": "",
      "content": "\\> Are you really going to jepordize your business relationship   \n   \nWell, in this case at least the relationship is a divorce: Steve wants his money, and whether he gets it or not he will never work with them again.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Meredith,   \n   \nWhat do you charge for late fees? Is it a percentage of the total due or a flat fee?   \n   \n -t\n\n"
    },
    {
      "time": "",
      "content": "In your next request for payment, indicate that their site will be shut off on a certain date if they don't pay you by then, and will only be made accessible again when they do.\n\n"
    },
    {
      "time": "",
      "content": "Right. You don't need to replace it with a snarky message. Just let them know the site will go down if they don't pay you by date X--said payment to include the contractually required late fees, thank you very much.   \n   \nYou can even add in a bit that says that if they're in some sort of serious financial trouble you're happy to work out a payment plan. Said payment plan would of course include interest....   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "",
      "content": "\\> What do you charge for late fees? Is it a percentage of the   \n\\> total due or a flat fee?   \n  \n3% (cumulative) per month.\n\n"
    },
    {
      "time": "",
      "content": "I disagree with the absolute of having a contract or else. Certainly having a contract with terms and conditions will be helpful if there are disputes over particulars. But in this case, it's fairly blatant.   \n   \nServices have been rendered for which payment was not received. In the US (I take it you live in the UK) we use a threshold of preponderance of the evidence in civil court. Meaning, your only requirement to prove that things happened as you claim they did is to show enough evidence to make a case (not prove it beyond a reasonable doubt).   \n   \nIn your situation that would be two things:   \n   \n1. The web site (with any additional evidence to show source code, proof of maintenance, etc.)   \n   \n2. Your typical hourly / project rate.   \n   \nBy simply bringing it to court shows (beyond the preponderance of the evidence) that you are in grievance -- so they can't use some concocted excuse that you agreed to do it for no charge.   \n   \nBeyond that, some clients are just not worth keeping around. Send them a letter outlining your intention, put it to a timeline, and see what happens.   \n   \nCheers.\n\n"
    },
    {
      "time": "",
      "content": "\\>\\>Steve, you could threaten to post a pic of your haircut on their site   \n   \nToo late! Its gone - but when you cut off a mohican, you don't get much choice as to your next haircut, so a photo of my current skinhead would probably do the trick.   \n   \nThis is all academic now, though, as a stern but non-insulting e-mail and the suspension of their website and e-mail did the trick.   \nThe cheque has just cleared into my account :-D\n\n"
    },
    {
      "time": "",
      "content": "Well,   \n   \nI had a client tell me you can't get \"blood from a stone\". I told him I would come over and show him how to get \"blood from a nose\".   \n   \nHe paid.   \n   \nThis method is un-recommended\n\n"
    },
    {
      "time": "",
      "content": "Steve, you could threaten to post a pic of your haircut on their site. Or I could send you a pic of me when I was a dyed blond. That should deter them. =)\n\n"
    }
  ]
}
