{
  "id": "18252",
  "title": "3 Most Important Items a EULA must allow",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Name three things you would consider before licensing a typeface in regards to a font [EULA](http://web.archive.org/web/20150419204644/http:/typophile.com/wiki/EULA)?\n\n",
  "author": "Miss Tiffany",
  "time": "28 Feb 2006 — 8:05pm",
  "uid": "108",
  "comments": [
    {
      "time": "28 Feb 2006 — 8:16pm",
      "content": "well, the big one: embedding\n\nand for me i like to have the option of: modifying\n\n"
    },
    {
      "time": "28 Feb 2006 — 8:26pm",
      "content": "Clarity, clarity, and clarity.  \n(Not really \"items\", I know.)\n\n"
    },
    {
      "time": "28 Feb 2006 — 9:09pm",
      "content": "Yes, it isn't something that a EULA can allow. However, that is maybe a pre-cursor for my list. If I can't understand a EULA, nothing else really matters.\n\n- Embedding: Service Bureau and/or printer, Limited Use (Client proofs), Commercial use (PDFs for purchase), internet use such as flash  \n- Modifying: Format changing, platform changing  \n- Users: How many users?  \n- Location: Can it travel on my laptop as well as my desktop?  \n- Product creation: Rubber Stamps\n\nHmmmm\n\n"
    },
    {
      "time": "1 Mar 2006 — 3:23am",
      "content": "Embedding: I won't buy a font that doesn't permit embedding, but I don't mind if it's not editable embedding.\n\nModifying is important to me.\n\nNumber of output devices: I find it irksome if I'm not allowed to print to my inkjet, b&w laser, and my colour laser.\n\n"
    },
    {
      "time": "1 Mar 2006 — 7:09am",
      "content": "John,\n\nIf modfying is important would you pay a premium for that option?\n\nWould a EULA model of selecting the desired items for the license, which would then change the price of the font license, work for you?\n\nFor instance, say a license is $35 per font, but you choose modifying as one of your choices in the licensing checklist, and that increases the font license to $50.\n\n"
    },
    {
      "time": "1 Mar 2006 — 9:49am",
      "content": "Personally, I've never understood the geographical restrictions some foundry place. What do I care where the fonts are, as long as it is within the limits of number of users purchased. AFA I'm concerned, people can use my fonts on the moon if they wish to do so.  \nI also think restricting the number of printers is outdated, as a typical office often consists of a number of printers for different purposes. What I care is that people who \\*use\\* the fonts pay for them.\n\nI've been pondering for a while about the modification stuff. I can see the demand for it and generally I don't have any objections. However, I think I would like to keep some sort of control over it in as far that I would like to be informed if someone makes modifications. This for a number of reasons: retain certain control on quality, retain control on usage re workstations, support queries may come my way for work I have not done.  \nI am thinking of changing our EULA to allow modifactions with the restriction that we are informed of all work done, and will have a copy of all work done to our fonts. We may also reserve the right to refuse the release of a modification if we feel that it is detrimental to our reputation.\n\nEmbedding? There are different opinions. Users demand embedding rights to make their life easier. Foundries are afraid it may slow revenue due to (enforced) sales lost. Other say, that in regards to embedding fonts should be treated like music broadcast via radio. Problem is that it is near impossible to police. And why have policies that you can't enforce, not only because it's logistically near impossible but because it may interfere with local legislation.\n\nWell, my two pennies.\n\nBruno Maag  \nDalton Maag Ltd\n\n"
    },
    {
      "time": "1 Mar 2006 — 3:20pm",
      "content": "any nice little wiki-links that explain what exactly embedding is and likewise EULA? would greatly appreciate.\n\n"
    },
    {
      "time": "1 Mar 2006 — 3:32pm",
      "content": "Embedding means many things to many people. I can mean:\n\n- embedding into a PDF file  \n- embedding into an application  \n- embedding into a web page  \n- embedding into a SWF file\n\nDid I forget anything?\n\nYou could start by reading my humble little article for Interrobang made available [here](http://web.archive.org/web/20150419204644/http:/fontlab.wikidev.net/The_Case_for_a_User-Friendly_EULA) as well as do a search for \"EULA\" here on Typophile.\n\n"
    },
    {
      "time": "1 Mar 2006 — 4:07pm",
      "content": "well when i said embedding, i meant PDF embedding.\n\n"
    },
    {
      "time": "2 Mar 2006 — 3:46am",
      "content": "thanks muchly.\n\n"
    },
    {
      "time": "2 Mar 2006 — 8:14am",
      "content": "\\>Embedding means many things to many people. I can mean:\n\nIn terms of the OpenType specification (and TrueType before it) \"embedding\" relates purely to including fonts (or parts of fonts or converted fonts) within a _document_ file.\n\nOf course we don't try to define what a document is, and over the past few years font makers have tacked on additional restrictions/clarifications to their EULAs. For example some say PDF embedding is okay but Web embedding is not. Others say commercial documents (ebooks or subscription eperiodicals) require an additional license.\n\n\\> - embedding into an application\n\nIn the OpenType or TrueType sense this isn't “embedding” and it's not covered by the embedding permissions in the fonts. We call this \"shipping\" a font, others may call it “bundling”. Fonts can be either permanenetly (fonts folder) or privately installed (for the application's private use) - but either way 99% of font EULAs don't allow this.\n\nI think this is basic common sense, but there are gray areas - one being doc-apps, things that are mostly documents but have some application-like features - we call these doc-apps. An example might be an electronic document advertising a mortgage broker that has an in-build mortgage calculator.\n\nCheers, Si\n\n"
    },
    {
      "time": "2 Mar 2006 — 8:22am",
      "content": "You've explained that to me before, Simon. I should've remembered that. And you are right, probably ALL EULAs don't allow for it.\n\nWhen you say converted, do you mean to outlines?\n\n"
    },
    {
      "time": "2 Mar 2006 — 8:52am",
      "content": "\\> When you say converted, do you mean to outlines?\n\nActually any case where the font is converted into another font format (either public or private, bitmap or outline based) and that is embedded, rather than converted to outlines or a static bitmap that doesn't fucntion like a font.\n\n"
    },
    {
      "time": "2 Mar 2006 — 10:15pm",
      "content": "\\>probably ALL EULAs don’t allow for it.\n\nThat will change shortly. We're putting some small fonts out under such a license. Hope to post some details shortly.\n\n"
    },
    {
      "time": "3 Mar 2006 — 8:21pm",
      "content": "James:  \nYou ask:  \n\"If modfying is important would you pay a premium for that option?\"\n\nI know it seems illogical, but I usually just move on to a different choice if the basic EULA doesn't suit me. I'm a very small outfit, buying fonts for the use of my home based business: restrictions and surcharges just put me of. I'd probably end up paying more at a foundry that had the rights I want in their basic EULA.\n\nIf the kerning pairs don't kern the small caps with the figures to accommodate Canadian postal codes, or if the f ligs haven't been added to the basic font in such a way as to allow them to function in InDesign, it's going to stick in my craw to pay extra for the privilege of making those adjustments myself. And let's face it, it's hard to tell about such thing from an online type tester, or even a PDF sample.\n\n"
    },
    {
      "time": "3 Mar 2006 — 10:40pm",
      "content": "I know I've posted something similar before, but imho there is no real difference between a typeface being used in print or on-screen. So long as the data is protected against code theft, it's pretty much the same thing if a font is embedded in a video game's code or if it's printed on a magazine page. Like so many other \"protectionist\" EULA clauses, the PDF embedding clause dates to a bad old time when it was easy as pie to pull the font code out of a PDF file. (This tendency to add another clause after getting burned by someone has been discussed before.)\n\nSi, what are \"small fonts\"? Ones built on a 500 em unit body? ;-)\n\n"
    },
    {
      "time": "4 Mar 2006 — 12:50am",
      "content": "Si:\n\nOne of the other things not defined in the OT spec is, what's a font? That is, the embedded font is often converted in various ways. When does it stop being a font? I'm sure that when it stops being a font, the embedding bits no longer apply (e.g. after you do a simple convert to outlines in your drawing program). But the question of what makes it a \"font\" as such is more tricky.\n\nT\n\n"
    },
    {
      "time": "4 Mar 2006 — 6:17am",
      "content": "John,\n\nSo what if, instead of being presented with a static EULA, you were offered the oportunity to select the terms that were important to you. As different terms are selected, the final price of the license would change.\n\n"
    },
    {
      "time": "4 Mar 2006 — 7:05am",
      "content": "James:  \nYes, that might be appealing. It would, of course, depend on how much the price changed!\n\n"
    },
    {
      "time": "4 Mar 2006 — 7:22pm",
      "content": "\\>One of the other things not defined in the OT spec is, what’s a font\n\nSpec seems to suggest \"the font\" is the actual OpenType font being embedded. [http://www.microsoft.com/typography/otspec/os2.htm#fst](http://web.archive.org/web/20150419204644/http:/www.microsoft.com/typography/otspec/os2.htm#fst \"http://www.microsoft.com/typography/otspec/os2.htm#fst\") - we know that some applications convert the font into another format, and respect the embedding permissions, some do not.\n\nSpec doesn't define what a document is either. To be honest giving this some thought I don't think the spec should. That's not to say a future version of the spec shouldn't introduce embedding permissions for 'app embedding' – although I feel that for app embedding there won’t be a one-size-fits all solution.\n\n"
    },
    {
      "time": "1 Apr 2006 — 6:36pm",
      "content": "I've been wondering if the whole working model between type designer, graphic designer (GD) and client is the problem, and has to be changed.\n\nThe question has to be asked, \"Who is the customer for the font?\"\n\nCurrently font foundries look at the designer as the customer, and hence the restrictive (or not so) EULA. But the real customer is the GD's client. No? They are the ones that derive the most benefit from the chosen typeface. It seems to me that the model for the small independent type designer may be one of providing their fonts to the GD at no charge, and have the GD pay for the fonts every time they are used in a client's job, passing those costs off to the client. That way the customer (the designer's client) pays for using the font, not the designer. Sort of what was the working model when type shops set the type. The client was the one who always paid for the typesetting, with a markup added by the designer as the cost of capital outlay for the typesetting.\n\nNow this would require type designers vetting their potential partnerships with GDs and not all GDs would pass the vetting process. Legal agreements would be required. Frightening penalties but in place for non-compliance, etc.\n\nI know these agreements are in place with several foundries. Terminal Design has several of them with our long time GD associates, but I think this could be an interesting approach on a broader scale.\n\nGD's would gain the added benefit of not having to do any of their desired modifications. If a group of fonts was chosen for a project, and certain mods were required the GD contacts the type designer, and a cost for the work is agreed upon, these costs would be passed on to the client.\n\nThis may not work for large resellers, but it could be one of the selling points of working with your independent type design professional.\n\nJust a thought.\n\nJames\n\n"
    },
    {
      "time": "3 Apr 2006 — 9:19am",
      "content": "James,\n\nInteresting idea. Designers would keep a loaded toolbox and charge the clients accordingly to use it. Right? I do a job for client A with your typefaces. They are then required to license the typeface along with the job including any mods?\n\n"
    },
    {
      "time": "3 Apr 2006 — 10:15am",
      "content": "Correct. And when you use the same typeface for client B you charge the client for its use. So the designer has no capital outlay for the fonts, but pays the foundry, and charges the client for each use. Sort of the way stock photography works now.\n\nJames\n\n"
    },
    {
      "time": "16 Sep 2006 — 3:58pm",
      "content": "After much discussion, my employer - the California State Legislature - has decided against buying any type that does not allow embedding, and ceasing all use of types that do not allow it. I believe we will be advising all state agencies as well as other public entities within the state to follow suit as well, at their leisure.\n\nUnfortunately, that means that we (meaning I) have to now spend many hours on the public dollar auditing all the EULAs of type that we own/use and discarding that which does not conform.\n\nJLT\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20150419204644/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": "16 Sep 2006 — 5:04pm",
      "content": "Sounds like it really is time to get a EULA database that people can use for reference.\n\n"
    },
    {
      "time": "16 Sep 2006 — 5:41pm",
      "content": "Make sure you charge somebody Tiff. Like maybe any font house who wants to be listed - with the amount maybe being proportional to the total dollar value of their entire library.\n\nhhp\n\n"
    },
    {
      "time": "16 Sep 2006 — 6:35pm",
      "content": "I am surprised that a government would even take notice of a font let alone a EULA, pleasantly surprised!\n\nChrisL\n\n"
    },
    {
      "time": "18 Sep 2006 — 3:20pm",
      "content": "Mostly because I have constantly raised issues of licensing in the 7 years I've been here - when we began to put PDFs online of all our brochures, I brought up - against much resistance - the fact that I'd have to redesign several, as they were based on images that were licensed from Getty and Corbis - licenses that did not allow electronic dissemination, and which would be ridiculously expensive to license for the tens of thousands of copies which will eventually be downloaded or otherwise distributed. I've been reasonably succesful in making people see type EULAs as just as important as stock photo EULAs and image and software-related copyright issues.\n\nOnce I've audited everything in my own office and the rest of the Senate - probably will take two years - we'll have the cleanest and most legal type of any government office anywhere. I can't be responsible for what people bring in to their offices and run on their own machines, but since almost everything system-level is refreshed regularly, I doubt there are many folks in the organization using pirated commercial type.\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20150419204644/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": "18 Sep 2006 — 4:08pm",
      "content": "I've said this before, and I'll say it again: U da man.\n\nhhp\n\n"
    },
    {
      "time": "18 Sep 2006 — 4:50pm",
      "content": "\"I doubt there are many folks in the organization using pirated commercial type.\"\n\nBravo! Joshua!!!\n\nHrant is right, you ARE!\n\nChrisL\n\n"
    }
  ]
}
