{
  "id": "18251",
  "title": "An Exhibition celebrating women in printing and the graphic arts at St Bride Library",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20100825012857/http:/typophile.com/user/108 \"View user profile.\") : 28.Feb.2006 7.41pm \n\n==================================================  \nCelebrating women in printing and the graphic arts:  \nan exhibition and a lecture at St Bride Library.  \n==================================================\n\nThe distaff side: women as printers from the fifteenth century  \nto the present day  \n. Exhibition, Wednesday 8 March to Thursday 27 April 2006  \n. Preview: Tuesday 7 March, 5.30-7.00pm\n\nWorking in a thin space: Harrington & Squires  \n. Lecture, Tuesday 7 March 2006, 7.00pm\n\nWorking in a thin space. Exhibition preview and lecture, Tuesday 7 March  \n==================================================\n\nWe begin in the Exhibition Room with a preview of 'The distaff side',  \nour concurrent exhibition (details below), from 5.30pm. We will move  \nupstairs to the Bridewell Hall for the lecture at 7.00pm.\n\nHarrington & Squires was founded in 2002 by graphic designers Chrissie  \nCharlton and Vicky Fullick to bring letterpress printing and hand-made  \ngraphics into contemporary use. With an emphasis on traditional  \nletterpress printing and beautiful paper, it is their intention to  \nproduce products which feel and look different from the mass-produced.\n\nIn this talk Chrissie and Vicky will further explain their rationale for  \nsetting up their workshop and describe how they approach the work they  \ndo.\n\nAdmission to the lecture is £5 (£3 concessions), on the door.\n\nThe distaff side. Exhibition, 8 March to 27 April  \n==================================================\n\nThe history of women in the printing industry, both as printmakers and  \noperators of private presses, is the history of a minority. The earliest  \nwomen to work with type, ink and presses were members of religious  \ncommunities or the heirs of men who had died without male issue. In  \nEngland the Stationers' Company and the printing unions made it very  \nhard for women to establish themselves as printers, and it was only in  \nthe twentieth century that it became generally acceptable for those on  \nthe 'distaff side' to enter the trade. Even then it was not easy, and  \nthe majority of those working in the industry today are male.  \nNevertheless, throughout the history of printing in the West women have  \nworked as printers. Some have attempted to storm the walls of the  \ntraditional industry, some have quietly joined the family business,  \nwhile others viewed their work quite differently: as therapy, as  \nrebellion, as a genteel hobby, as an educational tool, or as a means of  \ncreative expression.\n\nThe exhibition attempts to represent the different kinds of women  \nprinters, and the different work they did, between the fifteenth century  \nand the present day.\n\nExhibition curator Paul W. Nash works as a freelance bibliographer and  \nprinting historian. He was formerly a rare books librarian at the  \nBodleian Library and the Royal Institute of British Architects. He is  \neditor of The Private Library and Printing History News, and has written  \non private presses and architectural books. He is currently researching  \na book on the Samson Press, which was operated on a commercial basis by  \ntwo women between 1930 and 1967, and on which he spoke at the Hidden  \nTypography Conference at St Bride in 2003.\n\nExhibition Room, St Bride Printing Library, Bride Lane, Fleet St,  \nLondon EC4Y 8EQ  \nTelephone: 020 7353 4660\n\nHours of opening: Tuesday-Thursday, 12.30-5pm (9pm on Wednesday)\n\nWe would recommend that you do call beforehand to check access to the  \nexhibitions, especially if making a long trip.\n\nEntry to the exhibition is free.\n\nFor further information, see: [www.stbride.org](http://web.archive.org/web/20100825012857/http:/www.stbride.org/ \"www.stbride.org\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100825012857/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 28.Feb.2006 7.41pm",
  "uid": "108",
  "comments": [

  ]
}
