{
  "id": "18256",
  "title": "A survey of free font licenses",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Not read this yet (time for bed) but the title looks interesting ...\n\n[http://trends.newsforge.com/trends/06/02/22/1821200.shtml?tid=147&tid=150](http://web.archive.org/web/20131015044106/http:/trends.newsforge.com/trends/06/02/22/1821200.shtml?tid=147&tid=150 \"http://trends.newsforge.com/trends/06/02/22/1821200.shtml?tid=147&tid=150\")\n\n",
  "author": "Si_Daniels",
  "time": "28 Feb 2006 — 10:26pm",
  "uid": "1049",
  "comments": [
    {
      "time": "1 Mar 2006 — 12:24am",
      "content": "So many licenses to choose from. Clearly the only sensible solution will be to create my own license for distributing Inconsolata.\n\n"
    },
    {
      "time": "1 Mar 2006 — 6:39am",
      "content": "Or perhaps take every third word from each license and use it in yours (license permitting of course)\n\n"
    },
    {
      "time": "1 Mar 2006 — 9:30am",
      "content": "Very interesting. I think the word free is incredibly misleading and perhaps needs to not be used. There are free fonts, but most of them are highly questionable and of poor quality. But the fonts discussed in this article have had a lot of time spent on them and are of a high quality which understandably needs to be protected with a license. The SIL license, the only one I've read of those discussed, is basic and protective but not restrictive.\n\nIs it time that for a new word other than free for those fonts made available without a licensing fee but with a protective license?\n\n"
    },
    {
      "time": "1 Mar 2006 — 9:58am",
      "content": "\"On permanent loan\"\n\nChrisL\n\n"
    },
    {
      "time": "1 Mar 2006 — 9:59am",
      "content": "on consignment\n\nChrisL\n\n"
    },
    {
      "time": "1 Mar 2006 — 10:00am",
      "content": "Puppet fonts\n\n(strings attached)\n\nChrisL\n\n"
    },
    {
      "time": "1 Mar 2006 — 10:01am",
      "content": "Jepetto fonts\n\n(Pinoccio's creator)\n\nChrisL\n\n"
    },
    {
      "time": "1 Mar 2006 — 10:02am",
      "content": "EULAgized fonts\n\nChrisL\n\n"
    },
    {
      "time": "1 Mar 2006 — 10:10am",
      "content": "EULAware\n\nChrisL\n\nPS: I will shut up now\n\n"
    },
    {
      "time": "1 Mar 2006 — 11:28am",
      "content": "Chris, I'm glad to see that your punning skills are so finely honed. I like Puppet Fonts...\n\nIndeed, to quote the first sentence of my free fonts EULA: Free Means Free. Don't call it \"free\" when it's only free to download, but not to use. That's mean. You can't give something to people and then tell them that they're not allowed to use it.\n\n"
    },
    {
      "time": "1 Mar 2006 — 12:05pm",
      "content": "Just for you Chester:  \nChrisL\n\n ![](http://web.archive.org/web/20131015044106im_/http:/typophile.com/files/howdydoody.png)\n\n"
    },
    {
      "time": "1 Mar 2006 — 1:12pm",
      "content": "Even with \"free software\", it gets tiresome to continually explain \"free as in freedom.\" \"Freedom fonts\" sounds like a snub to the French. I've heard people refer to \"libre software\" or \"software libre.\" Too pretentious for common use in the United States?\n\nAs a personal note, I've been very grateful to those who have made fonts availabe under free licences. While there aren't a large number, there are getting to be enough to make some good choices available, and they have been invaluable to me as a way to start learning about type.\n\n"
    },
    {
      "time": "1 Mar 2006 — 8:25pm",
      "content": "<cite>Is it time that for a new word other than free for those fonts made available without a licensing fee but with a protective license?</cite>\n\nIn discussing free software, I often make a distinction between \"free software\" (what Scott calls libre) and \"beerware\". Beerware, as I use the term, can mean both a restrictive or ambiguous license.\n\nIn the US, I'm not sure why a license like SIL's is necessary. If SIL has the copyright on a font name, such as Gentium, no one else can distribute a modified version with \"Gentium\" in it without their permission anyway. This has worked well in the Linux community for a long time. I can make my own version of Linux based on RedHat, but I would have to call it Carlux or somthing. As a side note, the term Linux is copyright protected as well. Linus Torvalds lets people use it freely because he has always wanted to encourage the use of the name.  \nSo, from my non-lawyer perspective, the SIL license just seems to add unnecessary confusion. If they want to let people include the font with commercial software, then there are already FOSS licenses that allow this.\n\n"
    },
    {
      "time": "1 Mar 2006 — 9:16pm",
      "content": "The problem is that people with Not-Really-Free fonts actually consider themselves to be offering Free fonts, judging by their use of the term \"Free\". While it is accurate to say \"Free Download\", it makes the downloader believe that what has been downloaded may be freely used.\n\nAnd more language won't help. The descriptor \"Free Download, Limited Licensing\" is clearer, but ugly, and still not perfect. The word \"Free\" is simply not vague. There are no levels of freedom; either something is free: costs nothing, or it isn't: costs something. Even if that cost is dependent upon circumstances of use.\n\nMy two pfennings: Don't use the word \"Free\" unless the thing described is genuinely free.\n\n"
    },
    {
      "time": "1 Mar 2006 — 11:48pm",
      "content": "_In the US, I’m not sure why a license like SIL’s is necessary._\n\nOne of the basic ideas of the Free/Libre/Open Source movement is that a user of F/L/OSS software must extend the same uses of derived software to others. Only a license (or fundamental changes in copyright law) can enforce this; trademarks are not that useful. If SIL only depended on trademark protection, then anyone could take Gentium, rename it to \"MyFont,\" and then do anything they want with it. SIL's license, though, requires users to \"share alike.\" If someone adds Cyrillic to Gentium and distributes it as \"MyFontWithCyrillic,\" they can't stop someone else from adding Armenian to \"MyFontWithCyrillic\" and redistributing that font.\n\nThe problem with most F/L/OSS licenses is that they have certain features that only make sense with software. For instance, the GPL requires any software that is derived from or combined with the GPLed code to also be released under the GPL. This includes linking of libraries when compiling. A not-unreasonable interpretation of this requirement for a GPLed font would mean that an PDF file with the font embedded is a derived piece of software, in the same sense that a program that is linked to a GPLed library is. Thus, the entire PDF file would have to be released under the GPL. I don't think that this is what most F/L/OSS font designers want.\n\nMost F/L/OSS licenses don't address these issues specific to fonts. Similarly the Creative Commons licenses which are designed for works of art don't really fit well with fonts either because they don't address the functional aspects.\n\nSIL's Open Font License tries to fix these problems, and in my opinion is the license that currently does the best job.\n\nStephen\n\n"
    },
    {
      "time": "2 Mar 2006 — 6:52am",
      "content": "Stephen, the issue of renaming affects commercial fonts as well, and as I recall it was given as the reason why one large font vendor changed their EULA to disallow end-user mods. Their argument is that if they allow modification and the user changes the trademarked name then they lose most of their IP protection for that font.\n\n"
    },
    {
      "time": "2 Mar 2006 — 7:56am",
      "content": "Can a I moderator please turn off italics.\n\nNot everyone has ClearType turned on ;-)\n\n"
    },
    {
      "time": "2 Mar 2006 — 4:42pm",
      "content": "I don't understand their argument. Couldn't they allow modifications but require the name to be kept the same? That way a font vendor would still have control over the font because the name is trademarked. I think that Larabie's free fonts license has this feature: it allows some end-user mods but requires that the main name be kept in the font name.\n\nThis is an interesting question about licensing of fonts that I hadn't considered before. With software, the primary means of enforcing IP protection (whether for proprietary or free libre software) is copyright. However, since copyright protection for fonts is questionable (at least in the US), do trademarks then provide the strongest means of enforcing IP control for fonts? The copyright argument (fonts are software and hence copyrightable) seems much weaker.\n\nThe OFL's requirement of renaming derived works seems to significantly weaken their control through trademark means. In fact, is it possible that the OFL is unenforcable for bitmap fonts (which have no \"program\" in them)? In other words, that someone who takes an OFL-licensed bitmap font, changes the name, and redistributes the font is not bound by the OFL?\n\nStephen\n\n"
    },
    {
      "time": "2 Mar 2006 — 4:55pm",
      "content": "The NewsForge article doesn't really explain the benefit of a font released under a \"free\" libre license as opposed to a \"free\" gratis license. A great example is Bitstream Vera, which is mentioned in the article. The original fonts only had support for Latin and Western European languages. With most gratis fonts, the licenses prohibit modification, so if someone (say in Iceland or Russia) wanted to add thorn or eth or Cyrillic, they couldn't. The font is useless to them. However, with a libre license, these changes are possible. The [Dejavu](http://web.archive.org/web/20131015044106/http:/dejavu.sourceforge.net/) and [Arev](http://web.archive.org/web/20131015044106/http:/tavmjong.free.fr/FONTS/) fonts are derivatives of Vera that have added these features. They built on what was good in Vera and added a whole bunch more. If the goal of a font creator when releasing a \"free\" font is to contribute something that people can get a lot of use from, then a libre license makes a lot of sense.\n\n"
    },
    {
      "time": "2 Mar 2006 — 8:20pm",
      "content": "\\>I don’t understand their argument. Couldn’t they allow modifications but require the name to be kept the same?\n\nThis will likely cause support issues. You could of course allow something like \"Bembo Book for Acme Corp\" but I've yet to see a EULA tackle that one - maybe Tiffany has. Also I think any extension of the TM'd name may result in dilution of the TM and some vendors don't like that. Also there's the issue of composite trademarks. Probably need a TM attorney to weigh in on this.\n\n\\> do trademarks then provide the strongest means of enforcing IP control for fonts?\n\nAbsolutely, you can prevent other people using the TM'd font name if you police it. A TM can last forever in this case, the other protections run out.\n\nCheers, Si\n\n"
    },
    {
      "time": "2 Mar 2006 — 9:48pm",
      "content": "Si,but isn't there a difference between font name and trademark name? Bembo, I assume, is a trademark of Monotype Imaging. If they made a version for Acme corp, or if Acme made a version that was permissible by the trademark holder, then the new font name would be “Bembo Book for Acme Corp”. But the trademark wouldn't change or even change hands. The font's name would just be properly written “BemboTM Book for Acme Corp” because BemboTM is the only part of the name that is trademarked. (Unless Acme is a trademark of Acme Corp, in which the font name could include two trademarks, “BemboTM Book for AcmeTM Corp, etc.”).\n\n"
    },
    {
      "time": "2 Mar 2006 — 9:54pm",
      "content": "Si, I'm personally in favour of modified fonts keeping their name along with an indication of the modification. When I have been asked to modify or tweak one of my typefaces by a client, I rename it this way: \"Esquire Apex Sans\", meaning Esquire's customised version of Apex Sans. Similarly, a version of Radio which Magnus and I made for Procter & Gamble's Always brand is called \"Always Radio\".\n\nI think this is good because the original font name is retained, but it is pretty clear that changes have been made. And the copyright notice should also state that the font is a modified version of Fontname for Client.\n\nSGH, I'm not sure if I buy the argument that open source types can be improved by other designers making Cyrillic and Greek and whatnot. (Or maybe you weren't saying that these additions were improvements, but merely additions.) I have seen some really dodgy typographic hackery performed by those who felt they doing a typeface a service and making an improvement.\n\nI mean, look at Meg Ryan and Melanie Griffith. Two attractive women who underwent plastic surgery and came out looking far worse for it.\n\n"
    },
    {
      "time": "2 Mar 2006 — 10:06pm",
      "content": "Hi Chester and Dan,\n\nI think different vendors (or more accurately different lawyers advising different vendors) have different opinions on the rename issue. I've heard that order may also be important in the composite TM name so \"Esquire Apex Sans\" has a different meaning than \"Apex Sans Esquire\"\n\n"
    },
    {
      "time": "2 Mar 2006 — 10:31pm",
      "content": "<cite><br>\nSGH, I’m not sure if I buy the argument that open source types can be improved by other designers making Cyrillic and Greek and whatnot.<br>\n</cite>\n\nChester, I'm curious as to why you're not buying the argument. \"can\" is a pretty loose requirement. Certainly, some modifications to some free fonts are not of high quality. However, I have not seen many instances of this myself. From my personal experience, it seems that most changes to open source fonts are of a higher quality than most gratis free fonts. Of course, there are many, many more gratis free fonts, so maybe this is just the phenomenon of few data points.\n\nWhat do you think of the two examples of Dejavu and Arev that I gave? They both seem quite good to me, and, due to the nature of open source projects, are both being continually improved (both by additions, and improvements of existing glyphs, spacing, kerning, etc). The additions to both fonts are more than \"just\" additions--I think they improve the entire font.\n\nStephen\n\n"
    }
  ]
}
