{
  "id": "18267",
  "title": "TypeCon Auction: Yes or No?",
  "forum": "Home",
  "tags": [

  ],
  "content": "I will attend TypeCon and will participate in the auction, including donating an item.\n\n24% (14 votes)\n\nI will attend TypeCon and will participate in the auction, but will not donate any items.\n\n14% (8 votes)\n\nI won't be able to attend this year, but will donate something for the auction.\n\n3% (2 votes)\n\n I won't be able to attend TypeCon this year and do not have anything to donate for the auction.\n\n44% (26 votes)\n\nI will be attending TypeCon but could not give a crap about the auction.\n\n15% (9 votes)\n\nTotal votes: 59\n\n",
  "author": "Miss Tiffany",
  "time": "1 March, 2006 - 11:49am",
  "uid": "108",
  "comments": [
    {
      "time": " 1 March, 2006 - 12:22pm",
      "content": "I voted yes I will attend and donate an item but the bars on the graph are in the wrong place and cover the type so I don’t know if it worked.\n\nChrisL\n\n"
    },
    {
      "time": " 1 March, 2006 - 12:32pm",
      "content": "Strange. I’ll shout out to Christian.\n\n"
    },
    {
      "time": " 1 March, 2006 - 12:33pm",
      "content": "The people I’ve spoken to (including myself) missed\\* the auction last year. But being involved in TypeCon and attending ATypI I realize that it’s a very difficult balancing act to do it properly, and raise money for the organization. For every good auction I could name two that fell flat.\n\n\\*Edit, “missed” there being an auction, as there wasn’t one ;-)\n\n"
    },
    {
      "time": " 1 March, 2006 - 2:26pm",
      "content": "just out of curiosity, is it a silent auction or a regular deal with the auctioneer and all that?\n\n————-  \nnc\n\n"
    },
    {
      "time": " 1 March, 2006 - 2:29pm",
      "content": "Good question. The last auction we held had a silent auction running in tandem with the live auction. This may not be the case this year if we have another one.\n\n"
    },
    {
      "time": " 1 March, 2006 - 2:37pm",
      "content": "that’s interesting.…a silent auction along with a live auction.\n\nlive auctions are definitely impressive if you can pull them off. silent auctions are nice because they can go on for a longer period of time and require less energy to maintain.\n\n————-  \nnc\n\n"
    },
    {
      "time": " 1 March, 2006 - 3:04pm",
      "content": "Tiff, one thing, please: in 2004 it ran way waaay too long.\\*  \nMaybe you need to be more selective as to what you accept  \nto auction off, but making it much shorter would really  \nbump up the quality of the event tremendously.\n\n\\* And maybe that’s why Simon knows nobody who attended in 2005! :-/\n\nhhp\n\n"
    },
    {
      "time": " 1 March, 2006 - 6:40pm",
      "content": "There was no auction during TypeCon2005.\n\nHrant - Agree. Our excellent auctioneer Dave Farey is very entertaining, but I wouldn’t want to put him through more than 2 hours.\n\n"
    },
    {
      "time": " 1 March, 2006 - 10:39pm",
      "content": "\\> And maybe that’s why Simon knows nobody who attended in 2005! :-/\n\nMy post wasn’t clear ;-) on re-reading I do make it sound as if everyone skipped the auction and went to the karaoke bar instead ;-) which wasn’t the case.\n\n"
    },
    {
      "time": " 1 March, 2006 - 10:51pm",
      "content": "Oh.  \nThe people who missed the auction, did they stay until the very  \nend of the one in 2004? If so, then I guess I’m just not worthy!\n\nhhp\n\n"
    },
    {
      "time": " 2 March, 2006 - 4:30pm",
      "content": "As someone who enjoys a good auction, thinks Dave does a great job at actioneering, and who has spent some serious money at both ATypI and TypeCon auctions, I voted that I don’t give a crap about the auction. I guess I’ve lost interest.\n\n"
    },
    {
      "time": " 2 March, 2006 - 4:35pm",
      "content": "In San Francisco, I found a copy of Big Red in one of the antique stores. I told Dave about it and we went over and he bought it for $175. A great price for Big Red. Anyway, he put that up for auction asking an opening bid of $175. NO ONE bid on it! He took it off the table, and not wanting to bring it back to England (he already had a copy) offered to sell it to me. I accepted.\n\nIn order to have a good auction, you need people willing to spend some money. That is not been my experience with the TypeCon auctions.\n\n"
    },
    {
      "time": " 2 March, 2006 - 4:38pm",
      "content": "That is a lot for Big Red. I found my copy for $40. Yes. I wonder if we aren’t at the point where people have what they want and don’t want to part with what they have.\n\n"
    },
    {
      "time": " 2 March, 2006 - 7:52pm",
      "content": "I have to admit I rarely find stuff I really want at the TypeCon/ATypI auctions, so I don’t usually get into a bidding frenzy.\n\nT\n\n"
    },
    {
      "time": " 2 March, 2006 - 8:15pm",
      "content": "$40 for 1912 ATF Big Red is a unheard of bargain. Good for you! Most of what I have seen is in the $190 -$250 range.\n\nI have to agree with Thomas on the articles for auction at TypeCon.\n\n"
    },
    {
      "time": " 4 March, 2006 - 10:13am",
      "content": "I should add that I \\*used\\* to find more stuff I wanted, but then I acquired the stuff I really wanted, and now I’m mostly done. I guess I’m just not a good enough consumer. :/\n\nThough I’m still interested in ATF specimen books \\*prior\\* to the 1912 one, come to think of it. (Not counting the 1905 ornaments and borders book.)\n\nT\n\n"
    },
    {
      "time": " 4 March, 2006 - 4:11pm",
      "content": "I have never been one to collect antiques so I guess I am not the kind of person who is looking for things of historic value or collectables. I am more interested in very well done typography even if it is recent. I am also interested in information, technical, historical, or scientific, which relates to typography, type design, readability, linguistics and the history of letterforms and scripts. I would be interested in a copy of Miles Tinker’s “Legibility of Print” since I can’t seem to find it.  \nSince I have never witnessed an auction of any kind. I really don’t know what to expect. I might be just as happy with a yard sale style of thing.\n\nChrisL\n\n"
    },
    {
      "time": " 6 March, 2006 - 5:18pm",
      "content": "I am pretty sure I don’t have anything fab to offer. What kinds of things have gone under the hammer in the past?\n\n"
    },
    {
      "time": " 7 March, 2006 - 3:41pm",
      "content": "\\>What kinds of things have gone under the hammer in the past?\n\nTyping ‘typecon auction’ into the search engines results in quite a good overview of what’s up for grabs, basically old type specimens, ephemera, font packs, design magazines, posters, t-shirts, signed-books, old books, film strips, discs, wood type, John Downer hand painted banners, old signs, David Lemon’s Pokemon keyring, etc., you known the normal stuff that occupies the shoeboxes and bookcases of the typorati.\n\n"
    },
    {
      "time": " 7 March, 2006 - 3:46pm",
      "content": "Simon I think you need to officially add that word — [Typorati](http://web.archive.org/wiki/Typorati) — to the wiki. ;^)\n\n"
    },
    {
      "time": " 7 March, 2006 - 5:06pm",
      "content": "Good idea - I think that Veer were the first to use it. Time for some research.\n\n"
    },
    {
      "time": " 7 March, 2006 - 5:24pm",
      "content": "In SF I got a profusely autographed copy of John Berry’s “Contemporary Newspaper Design” for pretty much retail price. And I donated something: tragicomically pretentious letterpress “Don’t Mention It” cards\\* that I’d printed like two days before the conference. I’m not a big auction buyer by any means, but at ATypI I’ve bought: old issues of TypeLab; Fiona Ross’s book; and a tight little Soviet lettering booklet. Oh, and I donated a German-Tibetan dictionary at ATypI-Leipzig (and I’m still dying to find out who ended up with it). So clearly I think these auctions are worthwhile. Just not worth 5 hours.\n\n\\* You send them in the true bourgeois spirit of oneupmanship in response to a “Thank You” card. :-)\n\nBTW, I totally agree with David Berlow that TypeCon must  \nnot loose sight of its sort of “blue collar”, populist essence.  \nThe Nikko was a mistake.\n\nhhp\n\n"
    },
    {
      "time": " 12 March, 2006 - 7:39pm",
      "content": "Actually, does anybody want spill some beans about this years event ( T party ) ?\n\nOr speculate about what will happen there?\n\nThe web site [http://www.typecon.com/](http://web.archive.org/web/20060329180836/http:/www.typecon.com/) hasn’t got any new info on it yet and I an unaccountably itching for new info.\n\nKnow what this is? ( Here is hoping the emoticon makes it… )\n\n:-p @\\>\n\nIt’s me eating some Toscannini’s burnt caramel icecream.\n\n"
    },
    {
      "time": " 13 March, 2006 - 9:06am",
      "content": "\\> _Actually, does anybody want spill some beans about this years event ( T party ) ?_\n\n— Well…  \nI’ll be there with my Type ID Specs on. Hmm… maybe I’ll auction off a pair.\n\n ![](http://web.archive.org/system/files?file=TypeID_avatar.gif)\n\n"
    }
  ]
}
