{
  "id": "18262",
  "title": "Frutiger Rip Off",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Another Frutiger rip-off. This ugly thing is called NMBS Freeway Demi. It's used as a headline face for the Belgian Railways.\n\nsee the image attached or see this PDF for example:\n\n[http://www.b-rail.be/corp/N/assets/pdf/antwerpsenoord-zuidverb.pdf](http://web.archive.org/web/20120424032106/http:/www.b-rail.be/corp/N/assets/pdf/antwerpsenoord-zuidverb.pdf \"http://www.b-rail.be/corp/N/assets/pdf/antwerpsenoord-zuidverb.pdf\")\n\nother fine examples can be found here:  \n [http://www.b-rail.be/corp/N/group/pdffiles/index.php](http://web.archive.org/web/20120424032106/http:/www.b-rail.be/corp/N/group/pdffiles/index.php \"http://www.b-rail.be/corp/N/group/pdffiles/index.php\")\n\nIs this something you can do with a original typeface?  \n“Just cut some corners, make the dot on the i round and tadaa: Brussels we have a Corporate Typeface! No licenses to pay!”\n\n ![](http://web.archive.org/web/20120424032106im_/http:/typophile.com/files/Freeway.jpg)\n\n",
  "author": "lettertiep",
  "time": "1 Mar 2006 — 6:33am",
  "uid": "1361",
  "comments": [
    {
      "time": "1 Mar 2006 — 7:03am",
      "content": "And it's done very, very bad...\n\n"
    },
    {
      "time": "1 Mar 2006 — 7:16am",
      "content": "yep pieter,  \nthis is typeface-design in belgium  \n;-)\n\nAnybody has an idea who did it? Yves?  \nProbably a big adverti$ing $tudio\n\n"
    },
    {
      "time": "1 Mar 2006 — 7:58am",
      "content": "I’ve seen that also on book jackets of a German publisher. Totally merde.\n\n"
    },
    {
      "time": "1 Mar 2006 — 8:07am",
      "content": "The Freeway name seems to have been already taken and trademarked...\n\n[http://www.fonts.com/findfonts/detail.asp?pid=206701](http://web.archive.org/web/20120424032106/http:/www.fonts.com/findfonts/detail.asp?pid=206701 \"http://www.fonts.com/findfonts/detail.asp?pid=206701\")\n\nTMs are listed on the legal page.\n\nSi\n\n"
    },
    {
      "time": "1 Mar 2006 — 8:19am",
      "content": "Some of the glyphs have 100% the same outline and spacing like Frutiger Bold. Most of the round glyphs have additinal points but match exactly too.\n\nBut I think a company using such a \"Frutiger\" is worth it. :-)\n\n-- [astype.de](http://web.archive.org/web/20120424032106/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "1 Mar 2006 — 3:36pm",
      "content": "It's the European Arial!\n\n"
    },
    {
      "time": "2 Mar 2006 — 5:37am",
      "content": "I hate it when so-called designers think they're doing something really creative by just chopping ascenders and terminals at a really severe ugly angle.\n\nIt's quick-fix-crap that probably costs the client a fortune, as they're bamboozled by some marketing jerk's designer-wank gobbledygook.\n\nLook at this monstrosity for a major UK retail group, Eric will be turning in his grave:\n\nNick Cooke\n\n ![](http://web.archive.org/web/20120424032106im_/http:/typophile.com/files/John%20Lewis.jpg)\n\n"
    },
    {
      "time": "2 Mar 2006 — 6:48am",
      "content": "Nick, that John Lewis logo just made me re-enact Eric\\_West's avatar.\n\n"
    },
    {
      "time": "2 Mar 2006 — 7:02am",
      "content": "I wonder if the guy who did it had remorse and called it Guilt Sans?\n\nChrisL\n\n"
    },
    {
      "time": "2 Mar 2006 — 6:55pm",
      "content": "That John Lewis logo sure is irritating. You can just imagine the thought process:\n\n“Say, have you noticed some of these new fonts have a snipped-off look on the tall bits?”  \n\"Yeah, isn’t it cool?!”  \n“But theirs all go in the same diagonal direction.”  \n“Why would that be?”  \n“Dunno. Boringggg!”  \n“Hey, I'll flip that diagonal angle over!”  \n“Wicked!”\n\nThe resulting J is a 3D extrusion of a round-bottomed vertical stroke. The L is another extrusion, this time of a sans L in severe perspective. The h gets off without any butchery for some reason. The e suffers because someone on the team likes Trebuchet.\n\nIt’s particularly irritiating for me since I loved the old lettering on the shop in Reading (and hankered after obtaining it one day). John Lewis stores often retained the name of the shop they'd taken over: for decades Reading's John Lewis store was called “Heelas”. And it was those six letters, in huge white caps, that were proudly outside the big store until only 3 or 4 years ago. Central office must have got the jitters that the brand might not be getting through. Happily, I heard the sign was so well loved among staff that it now resides in the garden of one of the execs. At least it wasn't scrapped.\n\n"
    },
    {
      "time": "2 Mar 2006 — 7:15pm",
      "content": "I noticed the 'John Lewis' sign while visiting London last spring. There is bad, and there is embarassingly bad. Deserves some kind of doubious distinction award.\n\nHey typophilers, what if Typophile had an annual 'worst logo' award, with votes and all? Would that be too unkind? Would it be a public service?\n\nHow about best and worst recent logos?\n\n"
    },
    {
      "time": "3 Mar 2006 — 1:32am",
      "content": "to get back to the frutiger-ish thing:\n\nis this legal? Can you alter (i'm being nice here) an existing design this way?\n\nlttrtp\n\n"
    },
    {
      "time": "3 Mar 2006 — 2:47am",
      "content": "Lettertiep - you can, as long as you have the original font licenced for the correct number of users. And depending on the EULA.\n\nTo get back to the JL logo - look how thick the stem of the J is compared to the L.  \nThe amateur who did it couldn't even figure out how to make it the same thickness.\n\nLorp - I think you must have been in that meeting, that conversation seems uncannily accurate.\n\nNick Cooke\n\n"
    },
    {
      "time": "3 Mar 2006 — 4:50am",
      "content": "Gotta pick up on the UK gillty sans rip-off. UggLLyy! I know it is difficult to come up with an original font design, but these things, the Frutiger look-alike, and the Gill thing are touching the bottom. But the ironic bit is that big$$ firms get money for this. I am of the revival-is-good school, but the change-it-and-revive-it school doesn't interest me. This is not revival it is revolting. Eric Gill was weird enough in his way, but don't rip the guy.\n\n"
    },
    {
      "time": "3 Mar 2006 — 9:15am",
      "content": "If the font was licensed from Linotype, you cannot modify the fonts.\n\n"
    },
    {
      "time": "3 Mar 2006 — 9:41am",
      "content": "I don't mind the John Lewis logo.  \nThere was a John Lewis in Norwich when I was there, and I used to go by it often.  \nStreamlined art-deco brick building.  \nFirst time I saw the logo I thought, oh, post-modern Gill mod(ification).  \nThat's what a lot of the world looks like; the new imposed on the old, rather than something fresh which integrates old and new themes from the ground up.  \nThe logo connects past and present, conservative and modern, which is what everyone wants. Yeah it's ugly, but PoMo ain't about harmony.  \nIt makes sense in that they use straight Gill as their corporate face.  \nBear in mind that this is just a logo treatment, not a typeface.\n\nHowever, it would have been preferable for Lewis's to start fresh with a new logo and custom corporate font. Quite a few UK firms do that. last year was a banner year, with Smith's [Channel 4](http://web.archive.org/web/20120424032106/http:/www.channel4.com/) face and Barnes & Schwarz's [Guardian](http://web.archive.org/web/20120424032106/http:/www.guardian.co.uk/theguardian/story/0,,1566047,00.html) face unavoidable.\n\n"
    },
    {
      "time": "3 Mar 2006 — 9:50am",
      "content": "Do you really think the people that made the John Lewis logo were going for PoMo?\n\n"
    },
    {
      "time": "3 Mar 2006 — 10:09am",
      "content": "_...going for PoMo?_\n\nI can't speak for their intentions or the design process, but hacking bits off old type is a PoMo meme.\n\n"
    },
    {
      "time": "3 Mar 2006 — 10:44am",
      "content": "The problem with both the Frutiger-y Freeway Demi and the John Lewis Gill-otine is that they look bad.\n\nThe dot on the j of Freeway is too small, and those 45° angles look silly and are needlessly wasteful for space. (Sorry is that's a HiMo - High Modernist - comment.) Similarly, the John Lewis logo just looks bad. The three modified letters: \"J\", \"L\", and \"e\" all look much worse having gone under the knife than they do in their natural form. (I posted last night about how sad it is to see the results of Melanie Griffith and Meg Ryan going under the knife...)\n\n"
    },
    {
      "time": "3 Mar 2006 — 11:41am",
      "content": "\\>Yeah it’s ugly, but PoMo ain’t about harmony.\n\nSo, Nick, even if it's ugly--as you agree--we should bow down and accept it as OK if someone sticks a trendy label on it?\n\nYou just lost me there.\n\n"
    },
    {
      "time": "3 Mar 2006 — 12:20pm",
      "content": "William, I only used the term PoMo after I had described my initial impression of the logo as \"post-modern\". Post-modernism is not trendy, it's a major cultural trend.  \nI'm not saying you should accept it, only that traditional (or as chester mentions, high-modern) aesthetic criteria are not particularly relevant to it: Ideas are more important than appearance.\n\n"
    },
    {
      "time": "3 Mar 2006 — 12:46pm",
      "content": "\\> Ideas are more important than appearance.\n\nNot in typefaces and logos. They are not essays. Conventional visual ideas, well executed, are ok. Good ideas well executed are great. Bad ideas, well executed can be interesting and even fun. I don't see much to defend a bad idea, badly executed.\n\nDid the John Lewis designer have a good idea? What was it? Sure fooled me.\n\n"
    },
    {
      "time": "3 Mar 2006 — 2:28pm",
      "content": "_Not in typefaces and logos._\n\nTypography is not immune to Post-modernism.  \nCompare the present-day post-modern use of a generic sans, Arial, to the modernist use of a generic sans, Helvetica, 40 years ago. Then, Helvetica would be used for formalist reasons, as a reductive design that works well in a minimalist layout. Now, Arial would be used because it is the default that everybody uses. Non-aesthetic design logic.\n\nThe idea behind the John Lewis logo is that their corporate face, used for POP and media advertising (see their web site) is off-the-shelf Gill Sans, and the logo is a \"treated\" version of it.\n\n"
    },
    {
      "time": "3 Mar 2006 — 2:49pm",
      "content": "\\>Non-aesthetic design logic.\n\nWhat exactly do you mean by Post-Modern here? That design should ignore aesthetics? Do you actually think this is a defensible idea?\n\nJohn Lewis I sells clothing and furniture among other things. So what should be the message to shoppers: come here and you can find clothes and furniture that are really ugly, which is the latest fashion?\n\n"
    },
    {
      "time": "3 Mar 2006 — 3:18pm",
      "content": "_Do you actually think this is a defensible idea?_\n\nI'm explaining the way things are, not passing judgement.\n\n_...come here and you can find clothes and furniture that are really ugly..._\n\nIn practice, there is no hard-and-fast requirement for stylistic correlation between the type used marketing a product and that product.\n\n"
    },
    {
      "time": "5 Mar 2006 — 1:16pm",
      "content": "\\>That design should ignore aesthetics? Do you actually think this is a defensible idea?\n\nUgly Design - the secret of Web success?\n\n[http://scobleizer.wordpress.com/2006/03/04/the-role-of-anti-marketing-de...](http://web.archive.org/web/20120424032106/http:/scobleizer.wordpress.com/2006/03/04/the-role-of-anti-marketing-design/ \"http://scobleizer.wordpress.com/2006/03/04/the-role-of-anti-marketing-design/\")\n\n"
    },
    {
      "time": "5 Mar 2006 — 1:34pm",
      "content": "The site you link says that these \"ugly\" designs are \"easy to use, fast to load, and uncluttered\" and not slick.\n\nSi, that sounds like good design to me. Pretty isn't the only thing to good design. Actual ugliness I can't believe helps if you are selling clothes and furniture, like John Lewis.\n\nWhat the article I think is saying is that slickness and polish doesn't necessarily help help sell. I've heard of this for example for used cars and other cut rate stuff. If you look too slick and pretty people think it's too expensive for them. You can have good design that isn't slick or pretty, but I don't know where ugly helps.\n\n"
    },
    {
      "time": "24 Jun 2006 — 2:44pm",
      "content": "I've heard it was done by VVL BBDO, but I'm not sure.\n\n"
    },
    {
      "time": "24 Jun 2006 — 6:53pm",
      "content": "RE: What exactly do you mean by Post-Modern here? That design should ignore aesthetics?\n\nI don't think you are bothering to read what Nick is saying here. He explained his idea succinctly & very well. He wasn't defending po-mo just describing it. You are still reacting to the design alone.\n\nPersonally I think equating Po-mo aesthetic with ugliness is silly. Also, I want to highlight one the points Nick was making indrectly. It isn't neccesary for a type face to be conceived with 'Po-mo' in mind for the use or design using that type to be Po-mo.\n\nIt is probably true that it is harder to make a type face with long term value while satisfing a po-mo urge than it is to make one without. But those 90's po-mo stuff did sell stuff - not becvause they were ugly ( even if they were perhaps ) but because they said things in a 'voice' that was exciting at the time. They had a purpose & the purpose was served.\n\nAll that said; I do think the John Lewis Logo is incredibly dubious.\n\nHere is a po-typeface that works quite well for it's purpose:\n\n[http://www.mutek.ca/2006/index.php?lang=en](http://web.archive.org/web/20120424032106/http:/www.mutek.ca/2006/index.php?lang=en \"http://www.mutek.ca/2006/index.php?lang=en\")\n\nAnd I don't think it's ugly. Maybe it's not a face for the ages but... so what?\n\nOh yeah. That fruiger rip-off sucks in principle.\n\n"
    },
    {
      "time": "24 Jun 2006 — 6:55pm",
      "content": "here is the mutek face\n\n ![](http://web.archive.org/web/20120424032106im_/http:/typophile.com/files/logo_mutek_5806.gif)\n\n"
    },
    {
      "time": "25 Jun 2006 — 11:14am",
      "content": "I was told that the John Lewis logo was by Pentagram.\n\nPhil\n\n"
    },
    {
      "time": "25 Jun 2006 — 12:35pm",
      "content": "If so, then oh how the might have fallen!\n\n"
    },
    {
      "time": "12 Oct 2008 — 9:24am",
      "content": "Strangely enough, the Ayuntamiento de Granada uses NMBS Freeway for messages on recycle bins.\n\n"
    },
    {
      "time": "12 Oct 2008 — 11:26am",
      "content": "Tiffany, you wrote,\n\n\\>If the font was licensed from Linotype, you cannot modify the fonts.\n\nThat would not be true if you licensed the Linotype font Frutiger from Adobe some years ago. So you could just use an old version. I don't know what the rules are. Formerly, all Adobe's fonts had all the same rules -- you could modify the font and sell it on to others who owned the appropriate license for the underlying font. How different is it now?\n\nAlso, what is the situation if you modify someone's cloned data? At this point there must be several abandonware versions of Frutiger.\n\n"
    }
  ]
}
