{
  "id": "1827",
  "title": "What are peoples opinions on jonathan hoefler fonts",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "what are peoples opinions on jonathan hoefler fonts\n\n",
  "author": "anonymous",
  "time": "27 Oct 2003 — 2:13pm",
  "uid": "1203",
  "comments": [
    {
      "time": "27 Oct 2003 — 4:04pm",
      "content": "Come on, Jonathan, you can use your real name here -- you're among friends. We all think you make very nice little typefaces.   \n   \n ![:-)](http://web.archive.org/web/20131018050601im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "28 Oct 2003 — 2:51pm",
      "content": "\"why are you anonymous?\" - he/she isn't anonymous. but - [un]anonymous[ly] ![:-)](http://web.archive.org/web/20131018050601im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "29 Oct 2003 — 9:03am",
      "content": "Hrant, you are funny, every time this person posts something you have the same response. Keep up the good work. Dan who isn't anonymous\n\n"
    },
    {
      "time": "29 Oct 2003 — 9:48am",
      "content": "It's the context, baby.   \nAnd it's not a \"person\", more of a club of sorts.   \n   \nhhp\n\n"
    },
    {
      "time": "29 Oct 2003 — 10:42am",
      "content": "Anonymous, aka Lazy.   \n   \nThe least you could do, Anonymousperson, is make an anonymous avatar.   \n   \nAnd make the effort to come up with a more focused thread-starter.   \n   \nCoz this anonymous vague question leads nowhere.\n\n"
    },
    {
      "time": "29 Oct 2003 — 11:53am",
      "content": "Can you be more specific?   \n   \n(Sorry - could not resist.)\n\n"
    },
    {
      "time": "29 Oct 2003 — 11:53am",
      "content": "Can you be more specific?   \n   \n(Sorry - could not resist.)\n\n"
    },
    {
      "time": "29 Oct 2003 — 2:34pm",
      "content": "I think the administrators should make Anonyous read only status. If you can't stand the heat, get out of the kitchen.\n\n"
    },
    {
      "time": "29 Oct 2003 — 2:39pm",
      "content": "Daniel, great idea!!!\n\n"
    },
    {
      "time": "30 Oct 2003 — 3:47am",
      "content": "Hey, I've been censored!\n\n"
    },
    {
      "time": "30 Oct 2003 — 8:27am",
      "content": "You are now registered. There is only one \"Anonymous\", so   \nthe more you post the more we can pin down your essence,   \nand use that context to qualify your participation.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Oct 2003 — 8:33am",
      "content": "\\> There is only one \"Anonymous\"   \n   \nI'm not so sure about it. Anyone can still create   \nnew user accounts. We've seen \"anonymous-registered\"   \nposts before (Anon.E.Mouse, Clint Eastwood, etc ;).   \nAnd, this one here is probably just joking around,   \nnot being the original anonymous of the thread.   \n   \n ![:-)](http://web.archive.org/web/20131018050601im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "30 Oct 2003 — 8:38am",
      "content": "It doesn't matter, he's still one person. If for example if \"Anonymous\" (of which there can only be one) spends most of his posts attacking one of us, then any given instance containing an attack will be seen as insincere participation. Some people actually frequent lists mainly to defame.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Oct 2003 — 10:06am",
      "content": "Tobias, is good material.   \n   \nGerald Giampa\n\n"
    },
    {
      "time": "30 Oct 2003 — 10:18am",
      "content": "I think the Hoefler foundry is one of the best in the world - their fonts are consistently highly capable and historically intelligent. But with the duo's huge resources of insight and talent, don't shoot me if I enjoy thinking that the best is yet to come.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Oct 2003 — 12:11pm",
      "content": "The underlying question is this: how did a couple of young squirts get so damned good so quickly? And whatever it is, will they bottle and sell it?   \n   \n(Hey, 101st post -- I'm finally regular!)   \n   \n(Well, it _was_ my 101st post before I got a \"Form Referer Not Found.\" error.)\n\n"
    },
    {
      "time": "30 Oct 2003 — 12:25pm",
      "content": "Ok, I'll be a trouble maker. Hoeffler's faces are extremely well done, but there is something about his aesthetic that I personally don't warm to.   \n   \nI do like Gotham, but that is from Tobias Frere-Jones, who was at Fontbureau (whose taste I generally like.)   \n   \nNo, I have no connection to either house.\n\n"
    },
    {
      "time": "30 Oct 2003 — 12:33pm",
      "content": "Hoefler was at FontBureau too, no? That's probably the reason they matured so quickly: a lot of hard work under a \"top gun\" of typography - Berlow the Quiet.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Oct 2003 — 12:36pm",
      "content": "Maybe FontBureau should take to adopting infants and incubating them until they're old enough to hold a pencil -- just imagine the genius type designers they could hatch!   \n   \n ![:-)](http://web.archive.org/web/20131018050601im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "30 Oct 2003 — 12:57pm",
      "content": "I wish I could be more articulate on this, Tiffany, but I can't really explain it clearly. To me there is a kind of 19th century feel to his typefaces, which is not to my taste.   \n   \nIt isn't exactly a Classic vs Romantic thing. For example, I love Christian Schwartz's work (Orangeitalic.com), and his stuff is very expressive, like his recent Amplitude.   \n   \nI'm sure Hoefler's work deserves its success, but I must admit it doesn't grab me.\n\n"
    },
    {
      "time": "30 Oct 2003 — 1:05pm",
      "content": "\\> I can't really explain it clearly.   \n   \nOn the contrary, I think you did just fine! And I agree.   \n   \nHoefler's work is deeply informed by history, probably because that turns him on. But that always entails a _dependency_ too: it becomes harder to innovate. Mind you, he's done some notable innovations in the display realm, but in the darker realm of text it's much harder to escape the ghosts of the past. But if you manage, you'll really make your cultural mark.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Oct 2003 — 1:19pm",
      "content": "Hrant, I have a feeling our reactions are for a different reasons.   \n   \nI think text type is inherently more conservative than I suspect you think it is.   \n   \nAnd I don't mind revivals - I like most periods, just not Victorian.   \n   \nI have a feeling that I just don't resonate with the same historical stuff that Hoefler does. It's a way of handling detail and ornament...\n\n"
    },
    {
      "time": "30 Oct 2003 — 1:33pm",
      "content": "\\> I think text type is inherently more conservative than I suspect you think it is.   \n   \nIt's certainly more \"conservative\" (not sure if that's the right term) than display fonts. But it's a lot less conservative than most people who make text fonts think. In fact at some points in the past (like the first quarter of the 20th century) people had a lot more balls than us. And of course the reader couldn't even tell the difference (consciously). These days the fall in the level of craft versus pretentious artistry has annihilated the consideration of what the _reader_ needs, especially in the subconscious realm.   \n   \nThe other day I showed a setting of Eidetic to three laymen and asked some carefully tangenial questions about how they felt about it. None of them thought there was anything notable about it! Most \"serious\" type designers however think it's way out there.   \n   \nBreak loose from that cozy old fireplace - there's a rich world outside, it's called the future!   \n   \nhhp\n\n"
    },
    {
      "time": "30 Oct 2003 — 1:42pm",
      "content": "I guess one person's cozy is another's boring, and the latter's interesting is the former's uncomfortable. But who is more likely to mark cultural progress?   \n   \nhhp\n\n"
    },
    {
      "time": "30 Oct 2003 — 2:08pm",
      "content": "What I find is most people now have an attention span of a flea. I was just in a checkout line at the supermarket and the two people in front of me were on their cell phones, trying to make a purchase and chat on the phone at the same time. The same is true with print communications, while they are looking at printed material they have the TV on in the background and a pda in hand. Typeface? What typeface? This may not be true worldwide but in my little corner of the USA it is. Dan\n\n"
    },
    {
      "time": "30 Oct 2003 — 2:20pm",
      "content": "\\>who is more likely to mark cultural progress?   \n   \nActually, I think history says you can't tell. Bach was, I believe, pretty conservative and great. Beethoven was innovative and great. Who was it - Brunelesci? - invented perspective drawing, one of the greatest innovations in drawing, but I don't think he was the greatest artist in two dimensions, though a great architect...\n\n"
    },
    {
      "time": "30 Oct 2003 — 2:23pm",
      "content": "You won't be remembered if you rehash the past.   \nTime only moves forward, hence does not forgive lethargy.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Oct 2003 — 2:28pm",
      "content": "Hrant sometimes time moves sideways and a little up and down and even backwards. How can you explain George W. He's his father all over again. (Aside) I hope you're not anywhere near those horrible wildfires. The stat that made me cringe is the area burnt is the size of the state of Rhode Island.\n\n"
    },
    {
      "time": "30 Oct 2003 — 2:33pm",
      "content": "Nah that stuff is pretty far away, although there's a lot of fine ash in the air sometimes.   \nIf it makes it anywhere near me it would mean it's razed like half of LA county, which means it'll start feeling like back home. :-)   \n   \nhhp\n\n"
    },
    {
      "time": "30 Oct 2003 — 2:44pm",
      "content": "Hrant there is an amusing article on Creative Pro today not so subtly dissing Arnold your governor. How did he get in? Is this politics hell times, Jeb down in Fla, George in Washington (although I think the vp is really running things) and Arnold in CA and we have multibillionaire Bloomburg here, yuck! Dan\n\n"
    },
    {
      "time": "30 Oct 2003 — 2:46pm",
      "content": "\\>\\>Anonymous, glad you've made it official, and welcome   \n   \nWell thanks, but...   \n   \nNo, I'm not the anon who started the thread   \nYes, I was just joking   \nYes, I am registered under my real name too   \nNo, I'm not here to insult anyone   \n   \nI think Nick is right when he says unregistered anonymity is lazy.   \nAnd I think those that wanted no anonymous posts had good reasons for that, but I also think there is a place for anonymity. I've seen threads here where convincing arguments have been made by people who would not have been able to say those things under a real name.   \n   \nI think the way it is now, with only registered anonymity, is the way it should be.   \n   \n(I posted a much more thoughtful message about anonymity, but it got eaten by the web monsters and my brain can't do thoughtful twice in one day, so sorry if this is a bit rushed)\n\n"
    },
    {
      "time": "30 Oct 2003 — 2:51pm",
      "content": "Now Anonymous you need a better looking logo, too boring make something reflecting your talents that looks like a stock Illustration from a cheezy free site. Dan\n\n"
    },
    {
      "time": "31 Oct 2003 — 1:05am",
      "content": "Dan,   \nIf you read your post back, you'll see it makes no sense. If you can be bothered, please post again, so I can understand your point.   \n   \nI don't know why you have taken against this expression of registered anonymity. I, or anyone, could register under a 'John Doe' name, and you wouldn't know their identity. (Its also true that when I post under my real name, you wouldn't know who I am anyway, but that isn't the case for everyone here, so anonymity has a role in promoting open discussion)\n\n"
    },
    {
      "time": "31 Oct 2003 — 8:02am",
      "content": "Christian still does some work through FB, I think.   \n   \n\\> my wife .... found tiring to read   \n   \nIt's the subconscious kicking in.   \nAsk her if she had a problem with the font at the very beginning of the reading effort.   \n   \nhhp\n\n"
    },
    {
      "time": "31 Oct 2003 — 9:01am",
      "content": "William, market forces play a role in the conservatism of HTF.   \n   \nThe good commissions and sales for foundries are to large corporations and publications, with multi-user licensing. Those instiututions are very conservative.   \n   \nThis is not to deny the innovative quality of HTF typefaces in many areas, but it is subtle.   \n   \nThe designers at HTF have all done experimental, more uniquely contemporary work, but that's barely reflected in HTF's positioning. Compare the early Fetish and Gestalt with the bulk of the foundry's catalog.   \n   \nRarely do the clients that pay best want one's most creative work. In fact, there's probably an inverse relationship between remuneration and creativity.   \n   \nThe retail font market is different, you can do crazy work, but it's a crap-shoot.\n\n"
    },
    {
      "time": "31 Oct 2003 — 10:04am",
      "content": "All very true.   \nWhich means of course that Capitalism opposes cultural progress.   \n   \nhhp\n\n"
    },
    {
      "time": "31 Oct 2003 — 12:30pm",
      "content": "Nick said the big money isn't in creativity, and he's right.   \nCultural progress doesn't make money, massaging the status quo does.   \n   \nThe only way you can really innovate in type for example is by not expecting much money from it.   \n   \nhhp\n\n"
    },
    {
      "time": "31 Oct 2003 — 1:07pm",
      "content": "Nick: I would say market forces also play roles   \neverywhere else. All we have to do is take a   \nlook at Linotype's or MyFonts bestsellers.   \n   \nThere's no coincidence on Linotype's recent   \nefforts on redesigning Univers, Optima, Avenir,   \nSabon et al. Even knowing there are lots of   \nimprovements on those fonts, I can't stop   \nwondering what would happen if the same money   \ncould be invested on new typeface designs.   \n   \nI agree with Hrant: cultural progress doesn't   \nmake money, at least not while it's still   \nunderstood as 'innovation'. Maybe that happens   \nbecause conservative people need to separate   \ntrendy and volatile stuff from things that   \ncame to stay. In typeface design it could   \ntake a few decades.   \n   \nA common example of that conservative behaviour   \nfound here in Brazil is the use of Officina.   \nThe font is almost 15 years old, but just now   \nit became trendy, replacing most of Univers or   \nHelvetica uses everywhere. Nobody judges if   \nthe replacement works, just follow the tide.   \n   \n---   \n   \nTalking about the original subject, I have   \ngreat respect for the HTF fonts. I wish I could   \nknow more of their custom work, such as Retina.   \n   \nhC\n\n"
    },
    {
      "time": "31 Oct 2003 — 1:35pm",
      "content": "Pioneering is always a very tough road, but probably less so in capitalist countries than others, because of general wealth and the diversity of the market.   \n   \nI have no problem with contemporary use of good typefaces from the 17th or 20th centuries. I don't care if it's conservative or innovative, as long as it's good. Of course, in typography suitability to the project is almost everything. To me that means there are contexts where something new is better, and contexts where something historical is better.\n\n"
    },
    {
      "time": "31 Oct 2003 — 2:29pm",
      "content": "The observation that the big money in type is typically associated with fairly conservative design can be interpreted in a number of ways, some of them clearly dubious. Proceeding from this observation to the conclusion that capitalism inhibits innovation requires making a number of assumptions. One of these assumptions is that innovation is measurable by the amount of money paid for a single product rather than on the number of products in the market. Obviously, in a capitalist economy, the number of products in the market is very much larger than in pre-capitalist or non-capitalist societies, and this is the usual measure of relative innovation, not how much money X producer obtained for Y product. Indeed, the greater the number of competing products in a market, the lower the average price will be. Since no capitalist economy is ever a purely capitalist economy -- not least because some notions of value are inherited from pre-capitalist societies, especially in 'craft' businesses such as type design -- we should not automatically conflate conservatism in type design with a specifically capitalist status quo. Despite what the most ardent capitalists proclaim, there remain more ways of measuring value than the price the market will bear. The commissions that type designers like Jonathan and Tobias receive from magazines and newspapers reflect interesting and contradictory client desires: to have something new and fresh and distinctive, and to have something with an enduring value that is not merely fashionable. The fact that Jonathan and Tobias so regularly deliver and satisfy these contradictory desires is testament to their considerable skills.\n\n"
    },
    {
      "time": "31 Oct 2003 — 6:22pm",
      "content": "In that last post, I meant to write:   \n   \n'One of these assumptions is that **encouragement of** innovation is measurable by the amount of money paid for a single product rather than on the number of products in the market.'\n\n"
    },
    {
      "time": "31 Oct 2003 — 6:28pm",
      "content": "John said:   \n\\>The fact that Jonathan and Tobias so regularly deliver   \nand satisfy these contradictory desires is testament to   \ntheir considerable skills.   \n   \nTrue, and I have the same opinion about many fonts from   \nthe FB library (wich are related to Frere-Jones' excellent   \ntypedesign approach in some way).   \n   \nJohn:   \nYou've mentioned Hoefler designed many comissioned   \ntype projects for magazines and newspapers. Besides   \nRetina, which I've known through HTF's site, are there any   \nother interesting projects worth seeing?   \n   \nhC\n\n"
    },
    {
      "time": "31 Oct 2003 — 9:59pm",
      "content": "The Proteus set (Ziggurat, Leviathan, Saracen and Acropolis) was designed for _Rolling Stone_ magazine   \n   \nChampion Gothic was designed for _Sports Illustrated_. This design was later greatly extended in weights and widths to form the Knockout series.   \n   \nHTF Didot was designed for _Harper's Bazaar_.   \n   \nI believe Requiem was also designed for a magazine, but I can't recall which one.   \n   \nJonathan designed Mercury Display for _Esquire_ magazine in 1997, and in 1999 Tobias extended the design to create the newspaper type family Mercury. Mercury is not shown on the HTF wesbite yet, because it is still under exclusive license to New Times newscorp I believe, but you can see it in the ATypI/Graphis publication _Language Culture Type._\n\n"
    },
    {
      "time": "1 Nov 2003 — 2:50am",
      "content": "\\>\\> Which means of course that Capitalism opposes cultural progress.   \n   \nInteresting.   \n   \nI think capitalism is actually highly dependent on cultural progress, because it is partly based on the idea of selling people stuff they either already have in some form (a stylistic or functional upgrade, if you will), that they don't really need (pure luxury) or that satisfies the basic human desires (among them: greed).   \n   \nThis wouldn't be possible, if the good ol' wheel were not reinvented and remarketed as a 'brand-new must-have circular motion device' on a regular basis and if the stylistic definition of 'mainstream' didn't undergo a subtle but seismic shift every now and then.   \n   \nSo, capitalism needs to at least look as if it's moving forward all of the time, even if it doesn't. It achieves this by using cultural splinter groups as 'idea incubators' on the fringes of the mainstream, testing what might work on a mass scale. If they have something, the mainstream moves to gobble it up, the fringes move elsewhere.   \n   \nThe devious achievement of capitalism is in permitting and not repressing this process, a system which feeds off those that oppose it to reinvent itself and thereby stifle this opposition.   \n   \nIf it weren't just human nature, I'd call it a damn cunning plan ![:-)](http://web.archive.org/web/20131018050601im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "1 Nov 2003 — 11:27am",
      "content": "Good points, Refusenik. Of course, we're all assuming that cultural progress = making new and innovative things, which on reflection I don't accept. Hrant made a jump from his claim that capitalism stifles innovation to capitalism stifling cultural progress. Now, those of us pointing out the various ways in which capitalism encourages innovation (albeit without necessarily paying for it) are in danger of making the same jump: that encouraging innovation = encouraging cultural progress.   \n   \nThere are various ways of reckoning cultural progress, and innovation in the marketplace is not a universal criterion. How you measure cultural progress depends largely on your own cultural values.\n\n"
    },
    {
      "time": "1 Nov 2003 — 11:37am",
      "content": "Requiem started as a request from _Rolling Stone_, but I think it got dropped and then later finished for _Travel & Leisure_.   \n   \nAt their AIGA gig, the wonderboys talked about the development of the lovely Surveyor face for Martha Stewart. Yummy. (The typeface, not Martha.)\n\n"
    },
    {
      "time": "1 Nov 2003 — 3:20pm",
      "content": "The first step to betterment is admission.   \nCapitalism and culture are mostly opposite.   \nElaborate apologistics does not change this.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Nov 2003 — 3:24pm",
      "content": "John -- to your list I would add that Hoefler Titling (released last year) was originally completed on commission for _House & Garden,_ circa 1997.   \n   \nTiffany -- It was _GQ_ that originally used Gotham Condensed. I'm pretty sure T F-J completed that on commission prior to finishing the entire Gotham family for retail release late last year.   \n   \nMeredith -- I wish I could have attended the Hoefler/Frere-Jones presentation. Are you referring to the light slab-serif currently used for primary text in _MSL_? For some reason I thought that was called Archer, not Surveyor. Am I completely off-base, or did they change the name in the end? Or is Surveyor that revised Walbaum Italic?   \n   \nBTW, Tiff, I think _MSL_ still uses Benton Gothic, which was designed by Tobias, but under the auspices of FB not HTF -- so not every MSL face is a HTF font; but you're right, it wouldn't be a bad bet to start with.   \n   \n-- K.\n\n"
    },
    {
      "time": "1 Nov 2003 — 6:28pm",
      "content": "Unsupported one-line assertions do not an argument make.\n\n"
    },
    {
      "time": "2 Nov 2003 — 7:17pm",
      "content": "Kent, Archer is the slab-serif. Surveyor was based on the lettering on old maps (a bit precious, I guess, but this is Martha Stewart, after all). Really quite nice. Is it a revision of Waldbaum Italic? I dunno -- that didn't occur to me when they showed example slides of it, but it's possible. I haven't seen it in use yet.   \n   \nI thought Gotham was developed for the Lever House restoration -- or am I conflating two different projects?\n\n"
    }
  ]
}
