{
  "id": "18295",
  "title": "(x) condensed grotesque from CSA Archive - Venus Cd {Mark S}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello fellow typophiles. I am curious what font is being used in this sample taken from the pages of the CSA Archive catalogue. It looks so common, yet I can’t find a match, including the fonts that CSA has available on their site (although Tanek is close). Any help would be appreciated.\n\n| Attachment | Size |\n| --- | --- |\n| [Searchesandcust.jpg](http://web.archive.org/web/20081012213716/http:/typophile.com/files/Searchesandcust.jpg) | 40.58 KB |\n\n [‹ looking for a font for an non-existant language](http://web.archive.org/web/20081012213716/http:/typophile.com/node/18304 \"Go to previous forum topic\") [(x) MMC logo - Futura, Myriad {Mark S} ›](http://web.archive.org/web/20081012213716/http:/typophile.com/node/18309 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081012213716/http://typophile.com/user/10363\" title=\"View user profile.\">Maverick</a>",
  "time": "<br>",
  "uid": "10363",
  "comments": [
    {
      "time": " 2.Mar.2006 12.56pm",
      "content": "I’m surprised they didn’t use one of their own (and you’re right, Tanek is close).\n\n"
    },
    {
      "time": " 2.Mar.2006 2.48pm",
      "content": "Looks like Venus Medium Condensed to me. Don’t know of a digital version.\n\n"
    },
    {
      "time": " 2.Mar.2006 4.02pm",
      "content": "Mark - I took a look at some variations of the Venus font, and it appears to have a pretty high midline (ex: the center bar of the E) in comparison to the sample.\n\n"
    },
    {
      "time": " 2.Mar.2006 4.26pm",
      "content": "You could look at this\n\n[http://www.myfonts.com/fonts/urw/snv/d-extra-condensed/testdrive.html](http://web.archive.org/web/20081012213716/http:/www.myfonts.com/fonts/urw/snv/d-extra-condensed/testdrive.html \"http://www.myfonts.com/fonts/urw/snv/d-extra-condensed/testdrive.html\")\n\nit’s pretty close.\n\nVery possible that the font they originally used is not digital.\n\n"
    },
    {
      "time": " 2.Mar.2006 5.58pm",
      "content": "I think I figured it out: the font is Alpin Gothic.\n\nI managed to track down an old CSA-related PDF that used the font. Sometimes you can get lucky using Acrobat’s “Document Properties” to see what fonts were used in the document. So there’s my tip of the day!\n\nThanks for everybody’s help.\n\n"
    },
    {
      "time": " 2.Mar.2006 8.26pm",
      "content": "Heh, now it’s my turn to question _your_ i.d.: Alpin Gothic is a near knock-off of Alternate Gothic dating back to the Compugraphic days. It’s currently part of the Monotype library (Compugraphic —\\> Agfa —\\> Agfa/Monotype —\\> Monotype Imaging):\n\n[http://www.fonts.com/findfonts/detail.htm?pid=203180&grab\\_id=0&page\\_id=1...](http://web.archive.org/web/20081012213716/http:/www.fonts.com/findfonts/detail.htm?pid=203180&grab_id=0&page_id=11343&query=alpin \"http://www.fonts.com/findfonts/detail.htm?pid=203180&grab\\_id=0&page\\_id=11343&query=alpin\")\n\nCSA may have used Alpin Gothic in the PDF you found, but it doesn’t match the sample you posted. Notice particularly the S and G.\n\n"
    },
    {
      "time": " 2.Mar.2006 8.45pm",
      "content": "Mark surely nailed this with his Venus ID. An old VGC catalog shows Bold and Extrabold Condensed and, to my eye, your image matches the XBold. With the condensed variants of Venus, the crossbar of the E moves to pretty much mid-height - unlike the uncondensed fonts you likely looked at.\n\nI know of no digital version either. If you really need this exact font, you could always inquire at [Castcraft](http://web.archive.org/web/20081012213716/http:/www.castcraft-software.com/homepage.html) regarding an Opti equivalent (or maybe you already ruled that out, Mark?). It would likely have a different name, though.\n\n"
    },
    {
      "time": " 3.Mar.2006 6.06am",
      "content": "FYI:\n\n ![](http://web.archive.org/web/20081012213716im_/http:/typophile.com/files/venus-cond.gif)\n\nI did find another cut of Venus Condensed (in Jaspert’s Encyclopedia) which has a higher waist, but samples in other sources generally looked like this. The weight doesn’t quite match, but the earmarks are all there.\n\n"
    },
    {
      "time": " 3.Mar.2006 6.19am",
      "content": "Some idle speculation: The fonts that CSA sells are based on old metal and film faces, with some alterations. I believe these were developed originally for their own use and at some point they decided to sell them to the public. My guess is that they did not release everything and this is one of those that weren’t released. The faces they call Bigford and Manzo are from the Venus family.\n\n"
    },
    {
      "time": " 3.Mar.2006 9.56am",
      "content": "Thanks for posting a sample. You’re right, I kind of jumped the gun with the Alpin Gothic ID. Definitely a variation of Venus condensed. The C is kind of a unique character too. To me this typeface really captures that retro look.  \nSo just to confirm, the font “Venus Bold Condensed” is not currently avaiable in digital form? Would Alpin Gothic be the next best thing, or is there something closer that is available for purchase?\n\n"
    },
    {
      "time": " 3.Mar.2006 10.52am",
      "content": "As far as I know there is no digital version (although it appears that CSA may have made one for themselves).\n\nAlpin Gothic is a near copy of Alternate Gothic. Trade Gothic Bold Condensed is also similar. None of these would match this exactly, but they do have a similar overall look. I have heard that Font Bureau is releasing a font based somewhat on Venus called Vonnes (it’s the one Macromedia has used for a while), but I don’t know if there is a condensed like this or how similar it would be. Font Bureau’s Bureau Grotesk also has some similarities.\n\n"
    },
    {
      "time": " 3.Mar.2006 1.23pm",
      "content": "I beg to differ, my esteemed colleague, I think Bigford is based on Annonce Grotesque. The uppercase G sports a spur. ;^)\n\n"
    },
    {
      "time": " 3.Mar.2006 1.29pm",
      "content": "I did some more research. There does appear to be a Venus Bold Condensed by OptiFonts, although their web site doesn’t offer much information. I’ll try sending them an email.\n\nMark, I also noticed that you’ve commented on your fondness for the Venus family in a previous discussion. Ever thought of putting out your own version? I paid a visit to your site - very nice work.\n\n"
    },
    {
      "time": " 3.Mar.2006 5.31pm",
      "content": "It would be nice if a comprehensive digitization of Venus were done by somebody. (We have the technology!) Vonnes is nice, but it’s a bit different than Venus, made to order by Neville Brody, if I remember correctly. There are bits and pieces of the Venus family scattered through several digital libraries. FT Bauer owns the design, but they have only released one font so far.\n\nYves—I’m sure you’re right about Annonce. I didn’t spend much time examining it.\n\n"
    }
  ]
}
