{
  "id": "18296",
  "title": "Handwritten script from Bay Cafe Menu",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hey guys :)\n\nI have this menu that I don’t even remember where I came across now... I just love the handwriting/font that it uses!\n\n ![](http://web.archive.org/web/20080608074910im_/http:/typophile.com/files/baycafemenu.jpg)\n\nCan you tell if it’s a font or just someone’s handwriting? If anyone can identify it, I would be forever grateful! :)\n\nThanks so much for your help,  \nCerilene :)\n\n [‹ (x) Mojo magazine nameplate and headlines - Metro (Geometric 415), Lithos {Nick Curtis, Stephen, Yves}](http://web.archive.org/web/20080608074910/http:/typophile.com/node/18322 \"Go to previous forum topic\") [monospaced modern serif from rubber stamp company ›](http://web.archive.org/web/20080608074910/http:/typophile.com/node/18319 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080608074910/http://typophile.com/user/11795\" title=\"View user profile.\">Cerilene Hazel</a>",
  "time": "<br>",
  "uid": "11795",
  "comments": [
    {
      "time": " 2.Mar.2006 1.23pm",
      "content": "Certainly a font.\n\n"
    },
    {
      "time": " 2.Mar.2006 7.05pm",
      "content": "Have you tried looking at Mike Y’s site? I would suggest starting [here](http://web.archive.org/web/20080608074910/http:/bowfinprintworks.com/Script11Pg1.html).\n\n- Lex\n\n"
    },
    {
      "time": " 3.Mar.2006 11.53am",
      "content": "If this helps, it’s not one of the 300 ClickArt Handritten (HW) fonts (unfortunately), like one of the recent posts. Part 11 of the Script Guide is the right one, as Lex suggested, but I’m afraid I can’t save you any more time with a quick answer.\n\nAs I have said (too) many times before, fonts like this can be made for $9 or less with a sample of your own printing, so there are an almost unlimited number of them out there, including many that are probably not being distributed. Your best bet if you don’t see an exact match is to find something you think has the same ’feel’, and use that. It can be very frustrating trying to match a hand-made font that may be one-of-a-kind.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 3.Mar.2006 12.16pm",
      "content": "Thanks for all your help guys! :) Mike, I did look through all the fonts on your site, and (in addition to finding like 20 other fonts I must now have :)) I found an extremely similiar font that will do... Benito HW/Penny’s Hand.\n\nThanks again for all your help! :)  \nCerilene :)\n\n"
    }
  ]
}
