{
  "id": "1830",
  "title": "Typophile Forums Usability Suggestions",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Administrators/Moderators/Users,   \n   \nI think there are some things that could be done to make the forums a bit easier to use. Here are some issues I've found off the top of my head:   \n   \n\\<ul\\>   \n\\<li\\>Place a \"Start New Thread\" button/link at the top of the page.\\</li\\>   \n\\<li\\>Increase the width of the \"Post\" box\\</li\\>   \n\\<li\\>Make \"HTML code in message\" object more robust. For example, \\<em\\> and \\<strong\\> tags are not supported (they're actually more typographically/semantically correct) and one is unable to add a \"title\" attribute to anchor \\<a \\> elements.\\</li\\>   \n\\<li\\>_ibid_\\</li\\>   \n\\<li\\>Speed up the frickin Posting script. While previewing a post is relatively fast, posting takes FOREVER! My browser hangs for well over a minute and I'm on cable modem. This is surely a server/script issue.\\</li\\>   \n\\</ul\\>   \n   \nJust thought I'd mention this stuff and welcome others' suggestions so that we might further enhance the productivity of this already rich and thriving community.   \n   \n -t\n\n",
  "author": "timfm",
  "time": "Mon, 2003-10-27 17:24",
  "uid": "1235",
  "comments": [
    {
      "time": " Thu, 2003-10-30 02:38",
      "content": "Sorry if I posted this in the wrong place. Feel free to move it over to the \"Non-Typographic\" folder.   \n   \nI have another usability suggestion having to do with the navigation design of the forums. While it's nice to have a bread crumbs trail that shows where one is in context in the forums, it would be _really nice_ to have a persistant subnav that allows typophiles to jump from topic to topic witout having to click \"Topics\" in the global navbar.   \n   \nFor example, say I'm in a thread in \"General Discussions\" and I want to go to the \"Type Identification Board.\" Currently I have one of two options:   \n   \n1. Click the back button twice to get to the top level. Then click \"Type Identification Board.\" That's three clicks.   \n   \n2. Click \"Topics\" and then click \"Type Identification Board.\" That's two clicks.   \n   \nWhy not set up a persistant subnav that links to the most popular topics, i.e.,   \nGeneral Discussions | Design | Critique | Type Identification Board   \n   \nThis would allow users to get there in (you guessed it) ONE click. Even better, let users customize the subnav to display the topics they visit most often.   \n   \n -t\n\n"
    },
    {
      "time": " Thu, 2003-10-30 06:08",
      "content": "That would mean even fewer eyeballs of the sponsorship ads. And as a sponsor of this site I think that would be a bad idea.   \n   \nJames\n\n"
    },
    {
      "time": " Thu, 2003-10-30 10:28",
      "content": "James M. wrote: \"That would mean even fewer eyeballs of the sponsorship ads.\"   \n   \nTo what exactly (which suggestion) were you refering James?   \n   \nJared -- Good to here some improvements are coming. Getting feedback from users about how to iprove usability is smart design. Also, feel free to move this to the Respond forum.   \n   \n -t\n\n"
    }
  ]
}
