{
  "id": "18316",
  "title": "Font Legalites",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Windows XP User\n\nI work for a retail store online that personalizes products from many different vendors. Each vendor offers many different types of fonts. If we do not have a font that they offer or they don't give us the font(s), we will purchase the font(s). These fonts are strictly for viewing on the web, not for print. Are we obligated to purchase the fonts? or should the vendors (legally) supply us with them since we are not using them for printing purposes? Is there any documentation on this topic? Any help would be greatly appreciated.\n\n",
  "author": "gdzyn",
  "time": "3 Mar 2006 — 9:23am",
  "uid": "11822",
  "comments": [
    {
      "time": "3 Mar 2006 — 9:56am",
      "content": "A few things:\n\n1. The best thing you could do is ask your vendors for a sample image of the typeface. If you are using this on the web, just give the vendors a template. This keeps you from having to license the type as well as keeping you free from having illegally had copies of the fonts.\n\n2. If you are using the fonts you should license them.\n\n3. You should not have them give you copies of the fonts as most of -- 99.9% -- the EULAs out there do not allow this.\n\n"
    },
    {
      "time": "3 Mar 2006 — 10:14am",
      "content": "While I'm probably not really understanding your post, it seems to me that the people supplying you with artwork should convert their text to outlines before sending files for production.\n\nIf you are offering your customers the choice from a list of fonts, you should license those fonts. You are earning money using the fonts, so it is only fair that you should properly license those fonts. Depending upon what your country's tax laws are, you may find that you can deduct the purchase as a business expense.\n\n"
    },
    {
      "time": "4 Mar 2006 — 7:27pm",
      "content": "Enzo,\n\nIf I'm reading this correctly, to protect yourself legally you should have some kind of form that a partner would sign that says they have the rights to pass the fonts to you, and on that form they should list the name of the font vendor and some kind of reference to when the license was purchased - this should cover you legally and serve as a reminder to your clients that they need to obtain licenses for any fonts they pass on.\n\nCheers, Si\n\n"
    }
  ]
}
