{
  "id": "18313",
  "title": "Share your ebay secrets?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I always get outbid at the very last second. how do i keep this from happening. what do these people know that i don’t know. please enlighten me. \\>^P\n\n [‹ \"I found a font\" - attestable?](http://web.archive.org/web/20080907162413/http:/typophile.com/node/18212 \"Go to previous forum topic\") [NYC Type Club - first meeting Thursday March 9th ›](http://web.archive.org/web/20080907162413/http:/typophile.com/node/18368 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907162413/http://typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": "<br>",
  "uid": "7006",
  "comments": [
    {
      "time": " 3.Mar.2006 7.59am",
      "content": "It’s called sniping and it’s evil :-(\n\nhttp://en.wikipedia.org/wiki/Sniper\\_(auction\\_bid)\n\n"
    },
    {
      "time": " 3.Mar.2006 8.00am",
      "content": "Just figure out the most you are willing to pay for something and bid it at the end. You will either win it or not. If not, have no regrets…  \npeace\n\n"
    },
    {
      "time": " 3.Mar.2006 8.01am",
      "content": "I don’t use eBay myself, but I know that there’s some sort of automatic bidder that it has, so that you put in your maximum amount you’d pay for it, and eBay will bid for you automatically topping whatever the highest bid is until you’ve reached your max.\n\nGo to the very bottom of the screen and see if you find this text field:  \nYour maximum bid: US $\n\neBay automatically bids on your behalf up to your maximum bid.\n\nhope this helps!\n\n"
    },
    {
      "time": " 3.Mar.2006 8.02am",
      "content": "[http://www.auctionsniper.com/](http://web.archive.org/web/20080907162413/http:/www.auctionsniper.com/ \"http://www.auctionsniper.com/\")\n\nI don’t personally use a service like this, But I usually bid high and only bid in the last 30 to 60 seconds. The only thing bidding before then does is drive the price up.\n\n"
    },
    {
      "time": " 3.Mar.2006 8.27am",
      "content": "Yes, as Guerella said, bidding early only drives up the price. I would recommend the following, which I found to be working for me:\n\n1. Make up your mind and set yourself a maximum price\n\n2. In the last 40 seconds or so (depending how fast your connection is and how fast you are with a mouse), bid around 10% less than your maximum price (this way, any other bidders will think this is your maximum bid and will probably only want to outbid you by the minimum amount)\n\n3. Refresh the page after around 5 sec and see if you have been outbid\n\n4. If yes, bid your maximum price quickly, as there are around 10 sec left\n\n5. Now you either win or lose, but maximised your chances and did not use any evil snipers; and, just as Paul said: no regrets as you did not spend more money than you intended!\n\nGood luck!\n\n"
    },
    {
      "time": " 3.Mar.2006 8.58am",
      "content": "I have a kitchen timer and have 2 windows open, one of the item page, and one of the bid confirmation page ( after puttin in max bid ). Set the timer for like a minute before the end of auction. Put a cut it down to like 10 seconds and BAM. Usually get it that way. BTW, sniping is how you win, never bid before then, anyone who bids early is inflating the price. If your more interested in being nice, or getting your stuff?\n\n"
    },
    {
      "time": " 3.Mar.2006 9.57am",
      "content": "_http://en.wikipedia.org/wiki/Sniper\\_(auction\\_bid)_\n\ni KNEW there had to be something like this\n\n_If your more interested in being nice, or getting your stuff?_\n\ni’m interested in inflating the price for the snipers!\n\n"
    },
    {
      "time": " 3.Mar.2006 12.06pm",
      "content": "Don’t tell me that you didn’t won that magnificent Goudy book from the 20’s!! I saw that you were bidding, so I didn’t even tryed to get it. But it was a really nice piece of work.\n\n"
    },
    {
      "time": " 3.Mar.2006 12.07pm",
      "content": "Don’t pay much attention to other bidders. Just calmly assess what your top price is and bid it at the end. If you get outbid - you didn’t lose - someone else paid too much. EBay is perhaps the perfect exploitation of our competitive urges. Don’t get caught up in it…  \npeace\n\n"
    },
    {
      "time": " 3.Mar.2006 1.52pm",
      "content": "I got this snipe-style for like 20 bucks. #1 of 500. Huge Goudy portratin watermark in front and back, My 1 prized possesion of type.\n\n ![](http://web.archive.org/web/20080907162413im_/http:/typophile.com/files/g2e.jpg)\n  \n\n ![](http://web.archive.org/web/20080907162413im_/http:/typophile.com/files/g1e.jpg)\n  \n\n ![](http://web.archive.org/web/20080907162413im_/http:/typophile.com/files/g3e.jpg)\n\n"
    },
    {
      "time": " 3.Mar.2006 4.56pm",
      "content": "That is a beautiful thing…  \npeace\n\n"
    },
    {
      "time": " 3.Mar.2006 9.59pm",
      "content": "Nice item, Eric. I use the same method you do. I think manual sniping is fair; I don’t approve of these automated services though, and take satisfaction is believing that I manually outsnipe them. I also prefer the term gazumping, which originated in the UK housing market (when someone comes along and puts in a higher offer on a house after yours has been accepted but before the papers are signed).\n\nMy most desperate sniping moment was when I was walking along the street and suddently remembered that an auction I had planned to bid on was ending in five minutes. I ran around with my Palm Pilot, desperately trying to find a strong and open wireless signal. Found one. Got logged in to eBay. Got to the item. And then lost it (in more than one sense) when the bid page didn’t load quickly enough. Sort of sad and embarassing. I can’t even remember what the item was now.\n\n"
    },
    {
      "time": " 3.Mar.2006 11.16pm",
      "content": "John:  \nAhhh, ’bay-rage’ I have experienced as well. The first few times a used my current bid technique was quite a rush. It was like in the westerns ’...seconds from high noon.’ The rest of the world fades, and all you can do is focus. focus. focus. Anyway I managed one decent save. I was bidding on a really nice camera bag, and it ended at 9am, and I left for school early as to get there so I could bid, but when I got there, there web connection was down, so with like a minute spare, called my dad, got it with 10 seconds shy. Booya.\n\nPaul:\n\n_If your more interested in being nice, or getting your stuff?  \ni’m interested in inflating the price for the snipers!_    \nAnd yourself!\n\n"
    },
    {
      "time": " 4.Mar.2006 8.24am",
      "content": "_And yourself!_\n\nwell since i never win...\n\n"
    },
    {
      "time": " 4.Mar.2006 9.06am",
      "content": "I think Eric, John, Max, and Forrest are right—nothing ethically suspect about sniping. I share John’s distaste at the software-based sniping out there, but I’m not sure I could back that judgment up with anything but my gut. I speak as an experienced sniper (mostly good writing pens and leather goods). The rules are what they are: information about what buyers will pay is not distributed evenly and is revealed in a certain order, and people learn to take advantage of the structure to pay less for an item than they might have to otherwise. It’s like bluffing in poker—whether the people who write the rules wanted it or not, it’s become part of the whole point of the game.\n\nIt doesn’t hurt the losing bidders so much as the seller, by the way, if you think about it: it compresses the real bidding period into a few minutes, but unlike in a live real-time auction, that time isn’t continuous—there’s the connection and database update delay—so despite the pressure and the thrill of competition, the last bidders could never get the price as high as they would if they were face to face in the same room and could raise the bid with a flick of the hand or nod of the head.\n\nNever overlook the entertainment aspect of eBay—it’s what made the site so popular (besides the thrill of selling someone your ratty old bedsheets for $30). eBay does allow sellers to conduct blind auctions, where sniping is impossible or pointless (though the more neurotic of bidders might try it anyway).\n\nIf the competition leaves you cold, then Paul C’s advice is best: you figure out what you’ll pay for the piece, set your maximum bid, and wait until the auction is over. Me, I’m too much of an adrenalin junkie.\n\n"
    },
    {
      "time": " 4.Mar.2006 9.17am",
      "content": "I have hit refresh so many times I’m exhausted…  \npeace\n\n"
    },
    {
      "time": " 4.Mar.2006 10.40am",
      "content": "I agree with the “set your price and stick with it” approach: just set your price realistically (Paul: don’t expect to pick up a copy of the 1912 Western Type Foundry specimen book for less than $20), and bid as late in the game as possible.\n\nIf you find yourself bidding on type-related items against **goudyos, intypenut, pialley** or **st.gregory** , don’t bother...these guys have DEEP pockets, and have spent BIG bucks on rare specimen books. On the other hand, sometimes real goodies sneak under the radar: I picked up a less-than-stellar-but-still-quite adequate copy of the Barnhart Brothers & Spindler Specimen Book #25 for $14.99, which was the opening price. I was willing to pay quite a bit more, but nobody else bid on it, so I stole it. I feel so ashamed...\n\n"
    },
    {
      "time": " 4.Mar.2006 10.48am",
      "content": "I think those are Nick’s alternate account names. ;)\n\n"
    },
    {
      "time": " 4.Mar.2006 11.17am",
      "content": "I both sell and buy on eBay and there are a number of successful strategies for winning. Coming in at the last moment with a high bid is obviously the most common, and automated sniping is based on that. But that all depends on the item, bidding history, relative value, obscurity, etc.\n\nSometimes an early placement (bid a low amount initially) will scare off other potential bidders. A seller likes an initial bid as it has the potential of attracting other bidders, and is a guaranteed sale, but not necessarily a high sale (as it might well indeed have dissuaded other bidders).\n\nThe best way to play the eBay game is to do the research. Know what the market value of the item is. The value of antiquarian and collectible books, for instance, can easily be determined by a trip to abe.com. It’s often unusual that a known book will go over 40% of the dealers price. I usually bid the lowest dealer price and rarely lose, and most often, get the item for a much lower price. But it is a game played best only if you really want the item.\n\nIt is best to carefully study the item description. How much you will have to pay in shipping, condition of item, method of payment. It pays to take a good look at the seller, other items for sale, feedback history. There is nothing worse than being disappointed when the package arrives, and to some extent, you could have avoided that simply by paying a bit more attention to both description and seller’s feedback. Though this can work to your advantage. If a seller doesn’t offer PayPal, has high or undisclosed shipping rates, has a poor record in regard to shipping and packaging, etc., that seller’s items are not going to gather substantial bids.\n\nIt pays to study other listings for relative sale price as well. If there is a similar item up during the duration of bidding, that will could result in the items selling for less. Also, if the seller has described the item poorly in the subject heading or listed it in an inappropriate category, that can result in a lower auction price as well. But, sometimes sellers will do this on purpose because the potential buyers who do find the item are in game mode.\n\nMost importantly, look at the feedback of other bidders for the item. Their past bidding strategies are revealed here.\n\nTime of sale is important as well. A clue is to look at the numbers of folks using this list at any given time of the day and on specific days of the weeks. Web activity begins late Sunday night and tapers off by Thursday afternoon. Best time to buy and worse time to sell is during the off peak period. And during holidays. An acquaintance of mine picked up a photopolymer platemaking machine–which, because of its relative scarcity, has a common value of $3,500 and often goes for that–for $500 simply because the seller had the item ending on Christmas Eve.\n\nGerald\n\n"
    },
    {
      "time": " 4.Mar.2006 5.40pm",
      "content": "I’ll give you an example: I was bidding on a mid-century coffee table by John Keel. The bids had barely reached $600 at the last moment. It was worth $800 to me. I bid in the last moment and got it for $710. Suddenly it became a bargain. I used to be very competitive and obsessive when I first started using Ebay 8 years ago, but eventually figured out that worked against me and for the sellers and Ebay itself so I only bid once on an item and if that doesn’t “win”, I don’t “lose”…  \npeace\n\n"
    },
    {
      "time": " 5.Mar.2006 8.30pm",
      "content": "_It’s called sniping and it’s evil :-(_\n\n_I think manual sniping is fair; I don’t approve of these automated services though, and take satisfaction is believing that I manually outsnipe them._\n\n_I share John’s distaste at the software-based sniping out there, but I’m not sure I could back that judgment up with anything but my gut._\n\nJeez, are you guys still using buggy whips too? You talk like computers had never been invented. I buy and sell on eBay and have used a snipe service for years. I don’t have time to hang around waiting for an auction to go off, I have a life — and grandchildren to play with. I also don’t want to bother getting up at some ungodly hour for an auction in some distant time zone or worry about bidding from a foreign country while traveling. This is what computer technology is for, to make your lives easier. Set your bid on the snipe service and win or lose without crying or gloating.\n\nThe term sniping itself even implies there’s something neferious about the practice when there isn’t. I’ve sat through antique auctions in small midwestern towns on hot summer nights and big money auctions (art deco furniture) at Christies. The serious bidders come in at the end. It’s not sniping, it’s smart bidding. You wait for the amateurs to fade and the other serious bidders to come out. Bidding at auction really is a “use it or lose it” situation and if you won’t use all the tools and techniques available then you’re not that serious.\n\nPeople seem to think there’s some sort of honor pretending they’re standing in a dusty street blazing away like a gunfighter? Honor on eBay is doing right by your buyers and sellers not about how you bid your auctions. Well, go ahead and call me names for using a service, I’ll take the stuff.\n\nIf you want a recommendation for a good snipe service I use:  \n [http://www.snip.pl/en/my](http://web.archive.org/web/20080907162413/http:/www.snip.pl/en/my \"http://www.snip.pl/en/my\").  \nThey’re inexpensive and pretty reliable.\n\nGeorge\n\nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": " 5.Mar.2006 8.51pm",
      "content": "Hi George\n\nI don’t think I’d use a sniper service anymore than I would steal via bit-torrent “file sharing.”\n\nOn the other hand, are those modified sportsmen in your little pic there? I used to race when I was in college.\n\nGerald\n\n"
    },
    {
      "time": " 6.Mar.2006 5.42am",
      "content": "George:\n\nThe word “sniping” wasn’t coined by anyone on this list, so far as I know, and in any event, your disbelief is a bit misguided: of the three people you quote, two of them are self-confessed (and, speaking for myself, unapologetic) snipers who agree with your view that last-minute bidding is smart; no one here thinks computers are bad; and no one except Si called anyone names (and I would guess that Si doesn’t _really_ condemn the morality of those who snipe).\n\nLike I said (and as you quoted me saying), I _can’t_ think of any real reason why I would have any distaste for automatic sniping except my gut, and my gut is not an argument. If I _had_ to think of a reason, I guess it would be that introducing such mechanisms creates tiers or classes of buyers: those who can afford such products and gain an advantage, and those who can’t and don’t.\n\nBut again, on the other hand, there are already classes of buyers: for example, I have a job flexible enough to allow me to keep an eye on auctions during the day; I have internet connections both at home and at work; I have the resources to participate and bid high (though not nearly as high as some on eBay can), and so on. So I don’t think that argument goes very far.\n\nMaybe the only thing I would have to say against software bidding (beyond that contained in the eBay system itself) is this: that using the software to snipe takes the fun out of the process. Imagine the person who sits at the poker table and, every time the bet comes to her, uses a PDA or calculator to figure her odds and those of the others at the table and bets or folds accordingly. It may be instrumentally rational, but it sucks the suspense and psychological guesswork (not to mention the competitive camaraderie) out of the process.\\* But again, that’s a gut reaction, and not everyone thinks of eBay for its entertainment value.\n\nSo relax: we like you. Snipe away in peace.\n\n\\* No, this is not a perfect analogy. Anyone sitting at a poker table who saw one player doing this, and could assume she knew what she was doing and that she always bet or folded accordingly, would be a fool to bet against her. She’d never win as much as she would if she bluffed and could tell when her opponents were bluffing, or not.\n\n"
    },
    {
      "time": " 6.Mar.2006 10.47am",
      "content": "\\>no one except Si called anyone names (and I would guess that Si doesn’t really condemn the morality of those who snipe).\n\nAs I knew the answer to Paul’s initial question I wanted to get an answer posted quickly. Being only an occasional ebay’er I’ve learned a lot from this thread. As for the evil quip, I was thinking of the automated sniping services, and upon reflection, evil is too strong - how about I change it to “Sniping is evil, as in Google ;-)”\n\nThis thread is a bit like ebay. Leave it to the amateurs to chime in early, then the experts come in to give the real answers.\n\nCheers, Si\n\n"
    },
    {
      "time": " 6.Mar.2006 11.22am",
      "content": "Ahhhh, a Sii of relief :-)\n\nChrisL\n\nComic relief\n\n"
    },
    {
      "time": " 6.Mar.2006 12.03pm",
      "content": "_I don’t think I’d use a sniper service anymore than I would steal via bit-torrent “file sharing.”  \nOn the other hand, are those modified sportsmen in your little pic there? I used to race when I was in college._\n\nBut bit torrent is stealing, sniping isn’t. What I objected to is people casting aspersions on something because they don’t want to do it. It is what it is, there’s nothing illegal, immoral, or unethical about it and trying to make it seem so is poor sportsmanship. People use proxy bidders in auctions all the time. There are those who make their living as proxy bidders. I don’t see that using software instead of a person somehow makes it unfair. I’m not on eBay for recreation but to obtain things — right now a lot of type specimens — or sell things. I understand people get frustrated when they think they’re going to win something and get outbid in the last seconds. I missed an excellent Hamilton specimen that way which is one of the reasons I use sniping. I don’t use it all the time, but do for those auctions I’m not going to be able to bid on in person.\n\nThe winning bidder is the one who bids the most. Whether the bid is the first one or the last one. If you got outbid then you didn’t bid enough. It doesn’t matter if the one who outbid you did it at the end or not. Ebay has a mechanism to set a maximum bid amount that gives you the opportunity to beat sniping so if you don’t like snipers use it, just make the maximum high enough.\n\nI reacted to the “evil” comment because I felt it was overboard. A guy who committed mass genocide is being tried on the other side of the world. What he did was evil. What I do in sniping is, at most, annoying. And it wouldn’t be annoying if people were serious about using eBay.\n\nAs for the photo they’re sprint cars, 1960s I think. One of them is Mario Andretti, but I don’t know which one. I raced motorcycles, flat track, for awhile after college, but I was already too old to be competitive. Little kids were blowing by me laughing. There’s an indoor go-kart track near me and I plan on trying that as I still would like to do some racing before I really am too old. If I can beat the eight year olds I going to pursue it this summer.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": " 7.Mar.2006 8.42am",
      "content": "And back to the reason we started reading this topic: Gerald’s advice pretty much covers it. EBay does have a maximum bid system so you can set a high amount but it won’t show up. EBay just bids you up to that figure. For some reason people don’t see that as being naughty like sniping. Any snipers who come in at the last second and bid below you will lose out automatically. Don’t bid too early as some bidders will just chip away by bidding up the minimum until they figure out what your maximum bid price is. Or get frustated and go away.\n\nAnd sometimes you can beat the guys oldnick mentioned — they gotta eat sometime — but not often.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    }
  ]
}
