{
  "id": "18329",
  "title": "Problems with Quark file / PDF",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello every one!\n\nDoes anyone know what could be cause of this problem…\n\nA book designed in Quark… everything looks fine, but when saved as a PDF something strange happens: the space between some characters (specially all uppercase words) goes crazy, stretching its self…  \nThe typography that my friend is using is fairly new… so I don’t know if the problem might come from the font itself, or maybe is a PDF thing.\n\nAny one has an answer?\n\n(The typeface is Enrico)\n\nThanks\n\n [‹ Basic OT errors ...](http://web.archive.org/web/20070811072437/http:/typophile.com/node/18455 \"Go to previous forum topic\") [subs vs sinfs: what's the diff? ›](http://web.archive.org/web/20070811072437/http:/typophile.com/node/18449 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070811072437/http://typophile.com/user/7902\" title=\"View user profile.\">Cristina Paoli</a>",
  "time": "<br>",
  "uid": "7902",
  "comments": [
    {
      "time": " 3.Mar.2006 8.18pm",
      "content": "It’s been an age since I’ve used QuarkXPress, but... I don’t imagine things have changed very much with QXP, but the application never really seemed to be happy making PDFs. I dimly remember having to generate PostScript (PS) files of documents, then RIPping those through Acrobat Distiller, all because the PDFs XPress made directly were totally crazy.\n\nIf you are working in OS X, can you choose “Print” and then select the OS-level “PDF/Save as PDF...” command? Any improvement?\n\n"
    },
    {
      "time": " 6.Mar.2006 9.57am",
      "content": "Thanks Chester,\n\nActually I work with InDesign. But a friend of mine has this problem, I’m going to suggest him to do as you did. Thanks!\n\n"
    },
    {
      "time": " 6.Mar.2006 10.33am",
      "content": "My experience with Quark is similar to Chester’s. One question. Was your all caps wording done using the Caps style or is it typed as all caps? Quarks “Styles” can be, well, quirky. This can be magnified to awful if you adjust tracking. It can look fine in Quark but somehow in the transition to PDF, things don’t marry up well. This is one of my reasons for dumping Quark but that won’t help your friend.\n\nChrisL\n\n"
    },
    {
      "time": " 10.Mar.2006 9.23am",
      "content": "dezcom,\n\nYes, apparently Quark has been disappointing designers all over! Thank you, I will pass your comment to my friend!\n\n"
    },
    {
      "time": " 11.Mar.2006 5.16pm",
      "content": "Cristina,  \nAfter I got InD, I converted my old Quark files to InD just to make PDFs :-)\n\nChrisL\n\n"
    }
  ]
}
