{
  "id": "18324",
  "title": "(x) cute, Comic Sansish script in Everyday Rachael Ray magazine - Everyday (custom face) {James}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Can anyone help me identify this font? :)\n\n ![](http://web.archive.org/web/20150426204503im_/http:/typophile.com/files/rr2.jpg)\n\nThank you so much for your help! :)  \nCerilene :)\n\n",
  "author": "Cerilene Hazel",
  "time": "3 Mar 2006 — 12:47pm",
  "uid": "11795",
  "comments": [
    {
      "time": "3 Mar 2006 — 1:53pm",
      "content": "Wow, Cerilene, you're coming up with some good ones. If I had collected this I think it would be in [Part 6 of the Script Font ID Guide](http://web.archive.org/web/20150426204503/http:/bowfinprintworks.com/Script06Pg1.html) (Sign lettering scripts).\n\nIt reminds me of a few things, but they have the two-storey 'a' (Birdlegs, Havergal and Tweed, to mention three). The 'a' is more like 'Squire', but there are too many other differences. Sassoon is also a bit similar (sorry for not putting in links -- these are all available from large vendors).\n\n- Mike Yanega\n\n"
    },
    {
      "time": "3 Mar 2006 — 2:12pm",
      "content": "Mike, I know, I'm annoying, huh :D\n\nThese were all fonts I've had for awhile, and haven't been able to identify... When I found another font I had been looking for \\*forever\\* identified on here, I knew this was the board I had to join! ;)\n\nI'm just so glad you were able to identify that one... This one is probably another that is not being distributed.. The only place I've ever seen it is inside the Rachael Ray magazine, and it's used a lot, so it's probably just theirs! :-\\\n\nThanks again for all your help :)  \nCerilene :)\n\n"
    },
    {
      "time": "4 Mar 2006 — 8:39pm",
      "content": "The font is called Everyday and it comes in bold and regular varieties. As you guessed earlier, it's a custom font for the Everyday Rachael Ray magazine. In fact, the \"Everyday\" part of the masthead that you see on the cover is in fact EveryDay Bold.\n\nHope this helps.\n\n"
    },
    {
      "time": "4 Mar 2006 — 9:07pm",
      "content": "Oh, James, thank you for replying. :) So I guess this means the fonts cannot be purchased anywhere?? How sad for me! :-\\\n\nThank you again for your response :)  \nCerilene :)\n\n"
    }
  ]
}
