{
  "id": "18337",
  "title": "Intel Macs/Rosetta and FL5",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi All,\n\nMy old G4 tower just died. I’m considering getting one of the new intel macs, but wanted to hear if FL5 runs under Rosetta? Has this been tested? Are there any plans for a universal binary? I couldn’t find any info in the FL forums or FL site.\n\nThanks,  \nRandy\n\n [‹ programming fonts](http://web.archive.org/web/20071109102643/http:/typophile.com/node/19653 \"Go to previous forum topic\") [Checking Fontlab fonts that don't translate as expected to Mac Type 1 ›](http://web.archive.org/web/20071109102643/http:/typophile.com/node/19821 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071109102643/http://typophile.com/user/7783\" title=\"View user profile.\">Randy</a>",
  "time": "<br>",
  "uid": "7783",
  "comments": [
    {
      "time": " 5.Mar.2006 8.50pm",
      "content": "Adam? Yuri? Alex? Cyril?\n\n"
    },
    {
      "time": " 6.Mar.2006 3.01am",
      "content": "We have not had any reports of FontLab Studio 5 creating problems when running under Rosetta. The plans for universal binaries are further ahead since it’s a major development effort.\n\nRegards,  \nAdam\n\n"
    },
    {
      "time": " 6.Mar.2006 4.03am",
      "content": "Adam,\n\nhave you had reports of FLS 5 \\*running successfully\\* in Rosetta?\n\nBest,  \nKai\n\n"
    },
    {
      "time": " 7.Mar.2006 6.20am",
      "content": "\\>have you had reports of FLS 5 \\*running successfully\\* in Rosetta?\n\nNot yet. People do not like making reports if everything works for them. :)\n\nRegards,  \nAlex Petrov\n\n"
    },
    {
      "time": " 7.Mar.2006 8.31am",
      "content": "“Not yet. People do not like making reports if everything works for them. :)”\n\nLikely not enough time has gone by to tell. Perhaps there are not many type designers using the newest systems with Rosetta. I would guess that type designers, being less than deep of pocket as a rule, don’t jump on the latest hardware unless, like Randy, they have an unwelcomed breakdown in what they have been using.\n\nChrisL\n\n"
    },
    {
      "time": " 7.Mar.2006 9.16am",
      "content": "I’m agree with you Chris.  \nI think we all should keep monitoring the following page:  \n [http://www.creativepro.com/story/feature/23838.html](http://web.archive.org/web/20071109102643/http:/www.creativepro.com/story/feature/23838.html \"http://www.creativepro.com/story/feature/23838.html\")\n\nRegards,  \nAlex Petrov\n\n"
    },
    {
      "time": " 7.Mar.2006 2.25pm",
      "content": "News flash: After some prayer she booted up again and seems to be stable. This buys a little more time. Just made a fresh backup :-)\n\nRandy\n\n"
    },
    {
      "time": " 7.Mar.2006 3.08pm",
      "content": "Randy,  \nI nursed my 8500 along for 10 years. It still works fine but does not do OSX or the newer software so I had to bite the bullet last year and get a G5. Hang in there dude! :-)\n\nChrisL\n\n"
    },
    {
      "time": " 28.Apr.2006 11.30pm",
      "content": "I’ve been working with FontLab Studio 5.0.1 on a MacBook Pro for the past week, and only had \\*the\\* occasional crashes. So, I guess it’s all good ;^)\n\n"
    },
    {
      "time": " 4.May.2006 12.22pm",
      "content": "I wonder if an update to FontLab Studio 5.0.2 changes anything?  \n [http://www.fontlab.com/The-News/Announcements/FontLab-Studio-5.0.2/](http://web.archive.org/web/20071109102643/http:/www.fontlab.com/The-News/Announcements/FontLab-Studio-5.0.2/ \"http://www.fontlab.com/The-News/Announcements/FontLab-Studio-5.0.2/\")\n\nA.\n\n"
    },
    {
      "time": " 9.May.2006 5.39am",
      "content": "Miguel -  \nOutside of the occasional crash, how is the overall performance?  \nDoes it pause or lag?  \nDoes it choke when generating Python results?  \nAnything else?\n\nDue to travelling, I need a laptop I can run FLS5 on all day without snags.  \nIt seems crazy to buy one of the old G4s.\n\nThanks so much.\n\n"
    },
    {
      "time": " 10.May.2006 9.19pm",
      "content": "Eric, I’d say go ahead and get one.  \nThe performance is good. No pauses, lags or chokes for me. But don’t expect it to fly...\n\nI’ve upgraded to v5.0.2 and so far so good. I did noticed a couple fixes.  \nI’ve been doing a good amount of stuff with Python, most of which with Robofab, and no problems there either.\n\nI can’t even remember the last time FontLab hung or crashed. But I’m one of those people that uses its most useful shortcut (Cmd+S), so take it with a little bit of salt.\n\n"
    },
    {
      "time": " 11.May.2006 5.25am",
      "content": "Like Miguel, I have the command+S habit inherited from 4.6. FL-5.02 is definitely more solid than its predisesor. I am running on a G-5 desktop so I can’t comment on the new Intel versions.\n\nChrisL\n\n"
    },
    {
      "time": " 11.May.2006 5.48am",
      "content": "Miguel -\n\nThank you kindly for your insight - I’ll be getting one shortly.\n\n"
    },
    {
      "time": " 11.May.2006 6.00am",
      "content": "\\> I have the command+S habit inherited from 4.6\n\nWhile I have it (well, its equivalent) inherited from Basic programming on a Commodore-64 in the middle of a civil war where we’d lose electricity an average of twice a day. It’s funny how old habits die hard: I received my new laptop yesterday, and in testing to see how the keyboard feels I instinctively typed “RUN”-Return and “LIST”-Return. I haven’t actually needed to use those for like 20 years.\n\nhhp\n\n"
    }
  ]
}
