{
  "id": "18333",
  "title": "Japanese fonts on a Mac-Hiragino Micho Pro and Kazuka Mincho Std",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am doing a project on Japanese music and wanted to use Japanese text, but I do not know how the kanji characters are ordered in the glyphs in the unicode for the Hiragino Mincho Pro and Kazuka Mincho Std fonts. The characters are not ordered by stroke number, so does anyone know how to find the correct character that you need. Thank you for any help anyone can give me.\n\n [‹ Advice for a PC to Mac switcher](http://web.archive.org/web/20081104035432/http:/typophile.com/node/18294 \"Go to previous forum topic\") [A neat little article on Japanese showcard writing: ›](http://web.archive.org/web/20081104035432/http:/typophile.com/node/18332 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081104035432/http://typophile.com/user/11793\" title=\"View user profile.\">Rachel Stone</a>",
  "time": "<br>",
  "uid": "11793",
  "comments": [
    {
      "time": " 4.Mar.2006 9.53am",
      "content": "If you are using a Mac, open your international settings and allow all Japanese settings. If your Mac is set for American English, a little American flag will appear at the top of your screen. Drag down to Katakana, then phonetically type in the Romaji version of the kanji- teh corresponding kana will appear. Highlight it, change to the Kanji setting, and left- or right-arrown to get the correct character. (You may arrow for a bit to find the correct character.) :)\n\n"
    },
    {
      "time": " 4.Mar.2006 11.14am",
      "content": "I am using a computer in a computer lab at my school, so many people use the computers. I know that someone used Japanese before, but it was very difficult to switch back to English. I have no idea what they did to enable the Japanese settings, so I was wondering, with your way, how easy is it to switch back to English? And I probably should know this, but where are the international settings? Thanks for you help.\n\n"
    }
  ]
}
