{
  "id": "18353",
  "title": "TYPE BATTLE: Week 7 (6 March)",
  "forum": "Design",
  "tags": [

  ],
  "content": "**TYPE BATTLE: Week 7 (6 March)**\n\nHere’s your chance to stretch your type muscles on a weekly basis. Each game kicks off on Monday with a new challenge, and closes at midnight PST on Friday. Anyone may submit a design response to the challenge. You may enter as often as you wish. Post anytime. Critiques and comments are welcome throughout the game, from participants and spectators alike. Smack talk is encouraged.\n\nWinner take all, no holds barred. May be the best designer win.\n\nLink directly to this thread: [http://www.typophile.com/battle07](http://web.archive.org/web/20060329174922/http:/www.typophile.com/battle07)\n\n**Requirements:**\n\n- Size: 600 width x 400 height. 72 dpi  \n- Color: Black and white only  \n- Format: Please save your graphics as PNG  \n- Only respond with the characters posted in the challenge.\n\n**// THIS WEEK’S CHALLENGE:  \nMake a script based on Hobo. Set one word no longer than 8 characters.**\n\n",
  "author": "Christian Robertson",
  "time": "6 March, 2006 - 3:04pm",
  "uid": "1",
  "comments": [
    {
      "time": " 6 March, 2006 - 5:26pm",
      "content": "wheres that rss you spoke of?\n\n"
    },
    {
      "time": " 6 March, 2006 - 5:44pm",
      "content": "Don’t mind this, brain fart.\n\n"
    },
    {
      "time": " 7 March, 2006 - 1:39pm",
      "content": "Thread rss is back.\n\n"
    },
    {
      "time": " 7 March, 2006 - 9:27pm",
      "content": "[Hobo link](http://web.archive.org/web/20060329174922/http:/www.myfonts.com/fonts/urw/hobo/), if that is the Hobo we’re talkin about.\n\n"
    },
    {
      "time": " 8 March, 2006 - 9:05am",
      "content": "It’s getting kind of lonely in here, something I knocked together.\n\n ![](http://web.archive.org/system/files?file=shockinghobo.png)\n  \nTim\n"
    },
    {
      "time": " 8 March, 2006 - 2:36pm",
      "content": "I’m working on one, but I’ve been kind of swamped for the past few weeks. Hopefuly I’ll be able to get it up here by tomorrow.\n\nDuncan\n\n"
    },
    {
      "time": " 8 March, 2006 - 2:44pm",
      "content": "By the way, nice one Tim. I especially like your “g.”\n\nDuncan\n\n"
    },
    {
      "time": " 8 March, 2006 - 9:36pm",
      "content": "This one was a tough one.\n\n ![](http://web.archive.org/system/files?file=cr_socialization.png)\n\n"
    },
    {
      "time": " 8 March, 2006 - 10:09pm",
      "content": "I agree. I may have something to show yet, but it’s tricky. I never realized how unrelated Hobo is to handwriting, which of course is the basis for scripts. If anybody comes up with a decent solution, it’s going to be very interesting.\n\n"
    },
    {
      "time": " 8 March, 2006 - 10:21pm",
      "content": "You’re breaking your own rules Christian! ;-) Nice even work though.\n\nAnd yes I did some sketching today at work during some down time of this problem and also realized the same think Mr. Simonson. I’m still gathering my thoughts as well.\n\n"
    },
    {
      "time": " 8 March, 2006 - 10:32pm",
      "content": "I know, eight characters. I realized this after I posted. I’ve never been a good one for following directions. Hobo has a lot of brushish tendencies, which translate well to scripts. There are a lot of really cool things about Hobo that I never noticed before. The sharp terminals on the uc S and lc c for example are super cool.\n\n"
    },
    {
      "time": " 8 March, 2006 - 10:37pm",
      "content": "rules - shmools\n\nI have no idea what it is I am breaking, but this is it.\n\n ![](http://web.archive.org/system/files?file=hebe.png)\n\nNeeds work I know, but I had to get something in this week.\n\npd\n\n"
    },
    {
      "time": " 8 March, 2006 - 10:39pm",
      "content": "_There are a lot of really cool things about Hobo that I never noticed before. The sharp terminals on the uc S and lc c for example are super cool._\n\nI don’t know. The more I look at it, the more of a mess it seems to be. What was Benton smoking, anyway? And how long did it take him to dry out? Hmm…\n\n"
    },
    {
      "time": " 8 March, 2006 - 10:50pm",
      "content": "Nice Christian. I like the ‘a’ and the tail on the ‘n’. A more script style ‘z’ with the descender might look good as well.\n\n"
    },
    {
      "time": " 8 March, 2006 - 10:53pm",
      "content": "<cite>I don’t know. The more I look at it, the more of a mess it seems to be. What was Benton smoking, anyway?</cite>\n\n ![](http://web.archive.org/system/files?file=herb.png)\n\npd\n\n"
    },
    {
      "time": " 8 March, 2006 - 11:43pm",
      "content": "Difficult indeed!\n\n ![](http://web.archive.org/system/files?file=Type-Battle-7-Hobo-Script.png)\n\nI was especially having a hard time with the lc a. I can’t decide if I “preserved” it or wussed out on it.\n\nDuncan\n\n"
    },
    {
      "time": " 9 March, 2006 - 2:53am",
      "content": "I agree with the above comments: it’s a toughie, so many characters just don’t lend themselves to “scriptifying” - the two-storey ‘a’, the on-the-baseline ‘g’ whose tail points the ‘wrong way’. I had a go on a bit of paper rather than the computer, but threw it away as it was crap! (Blast my left-handed “dyscalligraphia”?!)\n\nAfter seeing these great tries, though, I might have another go if I get time!!\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 9 March, 2006 - 2:57am",
      "content": "Hello all.\n\nI’m still learning. Any helpful hints or tips?\n\n ![](http://web.archive.org/system/files?file=Stinking.png)\n\nGraham\n\n"
    },
    {
      "time": " 9 March, 2006 - 7:42am",
      "content": "Graham, that successfully keeps the look of Hobo, I think the directions of the connectors from n and k might work better following those of the other characters, concave rather than convex, but good work. It isn’t as easy as I first thought when I read the brief.  \nTim\n\n"
    },
    {
      "time": " 9 March, 2006 - 8:14am",
      "content": "I took some liberties (q), but Hobo lurks in there.  \nYou didn’t say it had to be a connecting script did you?\n\nI like how Christian’s example is hobotized, with out literally  \nreferencing the outlines and trying to add connections afterward.  \nIt’s a new creation. Hobos daughter by Ms. Snella Roundhand\n\nRandy\n\n ![](http://web.archive.org/system/files?file=hobotoad.jpg)\n\n"
    },
    {
      "time": " 9 March, 2006 - 8:33am",
      "content": "Randy, that’s awesome. It definitely keeps the spirit of Hobo, but the connections are naturally made. I think you’re the first one to post hand drawn work. Super cool.\n\n"
    },
    {
      "time": " 9 March, 2006 - 8:35am",
      "content": "Hallo all, my second attempt\n\n ![](http://web.archive.org/system/files?file=hobo-script.png)\n\n"
    },
    {
      "time": " 9 March, 2006 - 8:39am",
      "content": "Duncan, I like how you kept the connecting strokes pretty monoweight. And I agree, Mark. Hobo is a total mess. In some ways it reminds me of the meandering curves of Art nouveau, without any of the elegance.\n\n"
    },
    {
      "time": " 9 March, 2006 - 12:23pm",
      "content": "I had to try it with the undescenders.\n\n ![](http://web.archive.org/system/files?file=hoba_piquancy.png)\n\n"
    },
    {
      "time": " 9 March, 2006 - 4:09pm",
      "content": "Cheers for the advice Tim. Have reworked with concave connectors.\n\n ![](http://web.archive.org/system/files?file=Stinking_2.png)\n\nAn’ here’s an attempt without simply tracing the hobo characters and then joining them up.\n\n ![](http://web.archive.org/system/files?file=Vagabond.png)\n  \nsomething doesn’t quite seem right about it (the ‘o’ for starters i reckon)\n\nGraham\n\n"
    },
    {
      "time": " 10 March, 2006 - 2:14am",
      "content": "i just threw this together, i changed it alot just for fun. i know its lots of probs :|\n\n ![](http://web.archive.org/system/files?file=skaggs.gif)\n\n"
    },
    {
      "time": " 10 March, 2006 - 2:28am",
      "content": "it shows how forced and rigid my vagabond looks  \nback to drawing board i think\n\nGraham\n\n"
    },
    {
      "time": " 10 March, 2006 - 3:02am",
      "content": "OK here goes… I was wondering who actually uses Hobo these days anyway, when I wandered into the next room and saw a packet of Sainsbury’s Chocolate…\n\n ![](http://web.archive.org/system/files?file=eclairs.png)\n\nNot great, I know, but I wanted to have a go at a script-style ‘r’…  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster’s stopped working.\n\n"
    },
    {
      "time": " 10 March, 2006 - 6:28am",
      "content": "interesting approach cerulean\n\n ![](http://web.archive.org/system/files?file=hoboken.png)\n\n"
    },
    {
      "time": " 10 March, 2006 - 11:13am",
      "content": " ![](http://web.archive.org/system/files?file=bummer.gif)\n\nWell, haven’t participated in previous battles but this one interested me and I decided to do a proof of concept … My approach was far more minimal than most of what was presented so far in that I wanted to accomplish a script ‘feeling’ with the least amount of modification to the face so if they were presented in tandem folks would know one was the script and one was the base weight …\n\nThe other thing I noticed as with other script faces I’ve developed is that not EVERYTHING needs to connect in order for it to be a script style. This is certianly true of trying to make the Hobo CAPS connect where there isn’t a natural ‘tail’ …\n\nBeyond that, things like the ‘er’ combination I felt had nice flow so what would be gained with a formal connection between them? Functionally the idea of a script in my mind is to present a comfortable eye flow rather make everything touch …\n\nNot the most exciting submission but I feel it appropriately accomplishes the challenge …\n\nBest,  \nStuart :D\n\n"
    },
    {
      "time": " 10 March, 2006 - 9:09pm",
      "content": " ![](http://web.archive.org/system/files?file=aristocrat.png)\n  \nSo this is my first challenge, I havent tried to do this before but I felt like I wanted to give it a try.. Its almost 12, so a little last minute, and its longer than 8 characters, but i wanted to use the word. Enjoy…  \nKris\n"
    },
    {
      "time": " 11 March, 2006 - 6:37am",
      "content": "Truely frightening. Truely.\n\n"
    },
    {
      "time": " 12 March, 2006 - 5:13pm",
      "content": "Design is my word and need your opinion\n\n ![](http://web.archive.org/system/files?file=design.png)\n\n"
    },
    {
      "time": " 13 March, 2006 - 1:32am",
      "content": "I think I don’t get that last one…\n\n"
    },
    {
      "time": " 13 March, 2006 - 6:35pm",
      "content": "I think the person is from Hoboken…  \npeace\n\n"
    },
    {
      "time": " 13 March, 2006 - 11:01pm",
      "content": "I just noticed in the closing credits of ‘That 70’s Show’ the usage of Hobo.\n\n"
    }
  ]
}
