{
  "id": "18384",
  "title": "PDF open in full screen mode",
  "forum": "Build",
  "tags": [

  ],
  "content": "I am creating a PDF specimen which I would like to open in full screen mode when people download the file.  \nDespite specifying this in Acrobat, when the file icon is double-clicked, it still opens in the OS X \"Preview\" application, with menu palettes. That's because the OS X default for viewing PDFs is Preview, damnit (I also detest the default that \"opens\" PDFs accessed online in Safari).\n\nI have tried specifying Acrobat as the opening application, by using the \"get info\" dialog, but it only permits one Acrobat version to be specified, not Acrobat in general.\n\nIs there a way around this?\n\n",
  "author": "<a href=\"/web/20100921130850/http://typophile.com/user/2021\" title=\"View user profile.\">Nick Shinn</a>",
  "time": "<br>",
  "uid": "2021",
  "comments": [
    {
      "time": "",
      "content": "Nick,\n\nYou might try to delete the preference file for Preview. Under your home directory, visit the library folder/preferences and delete the com.apple.preview.plist file. Empty your trash and try and double click on that PDF. Sometimes the poor Mac OS is a little selfish when it comes to giving up ownership. Hope it works and if I can think of anything else, I'll gladly repost. Best,  \nDaphne\n\n"
    },
    {
      "time": "",
      "content": "Thanks Daphne, that would get it to work on my computer, but I'd like to get it working that way for anyone who downloads the file.\n\n"
    },
    {
      "time": "",
      "content": "Nick, found this bookmark - maybe it will help:  \n [http://www.adobeforums.com/cgi-bin/webx?50@50.3ojZfH4j6NU.5@.3bbde9ab](http://web.archive.org/web/20100921130850/http:/www.adobeforums.com/cgi-bin/webx?50@50.3ojZfH4j6NU.5@.3bbde9ab \"http://www.adobeforums.com/cgi-bin/webx?50@50.3ojZfH4j6NU.5@.3bbde9ab\")  \nKind of a pain, but once they make the \"converstion\" all will be well.  \nBest,  \nDaphne\n\n"
    },
    {
      "time": "",
      "content": "Thanks again.\n\n"
    },
    {
      "time": "",
      "content": "I suggest to use File Buddy [http://www.skytag.com/filebuddy/](http://web.archive.org/web/20100921130850/http:/www.skytag.com/filebuddy/ \"http://www.skytag.com/filebuddy/\")\n\n"
    },
    {
      "time": "",
      "content": "I wouldn't expect to be able to control how Mac (or any) users view a PDF file. I assume that any feature like this would be strictly opt-in, but I don't think there's any way to force a full-screen mode.  \nOn the Mac, there's just a lot of software diversity, both with whatever browser the person has, and the way they chose to view PDFs.\n\n"
    },
    {
      "time": "",
      "content": "If I recall correctly, the first 3 versions of OS X supported the \"open in full screen\" feature that could be built into an Acrobat file, because double-clicked Acrobat files were opened in Acrobat (makes sense, eh?!) But with \"Tiger\", Preview, which does not support that feature, has pre-empted Acrobat.\n\n"
    },
    {
      "time": "",
      "content": "Preview opens much faster than Acrobat, and has a small memory footprint, so I leave it open at all times. I also have it associated with most simple image types, jpg, tif, png, etc. This is handy for people who don't have P'shop running at all times, since it can perform minor image edits as well.\n\n"
    },
    {
      "time": "",
      "content": "The problem with Preview is directly related to what Nick wants: full-screen reading/viewing. I use Preview when I want quick look-sees, but I use Acrobat for full-screen portfolio viewing and (not necessarily full-screen) proof approval. Preview also does not respect the more advanced transparency features.\n\n"
    },
    {
      "time": "",
      "content": "To make it open in acrobat by default, decheck the 'hide file extension' in the document settings (acrobat). When it saves the file then it makes a true adobe pdf, rather than osx adding an extension (and assocaited program) :D\n\nThis works here with acrobat 7\n\nMatt\n\n"
    },
    {
      "time": "",
      "content": "Thanks Matt, but I can't find that (I'm running Acrobat 6 -- maybe time to upgrade...)\n\n"
    },
    {
      "time": "",
      "content": "Nick, I believe this is what Matthew means. Can you find that? (Version 6 has it)\n\n ![](http://web.archive.org/web/20100921130850im_/http:/typophile.com/files/ms_acrobat.png)\n\n"
    },
    {
      "time": "",
      "content": "Yeah, thats exactly what i mean. Sorry, i dont explain myself enough! (my mum is always saying this...)\n\nIts in most osx programs, and causes headaches like this all the time.\n\nMatt\n\n"
    },
    {
      "time": "",
      "content": "Problems im having are consistency issues between acrobat and preview! Things look better in preview, but are less interactive!!!\n\nMatt\n\n"
    },
    {
      "time": "",
      "content": "Hi Miguel,\n\nNo, I don't have that option.  \nI'm running Acrobat 6.0.4, but maybe that option doesn't work in OS X 10.4.5?\n\n"
    },
    {
      "time": "",
      "content": "Hi Nick,  \nYou won't have that option if the triangle next to the \"Save as:\" field is pointing down.  \nJust click on it to switch it up. The versions you have are good.\n\n ![](http://web.archive.org/web/20100921130850im_/http:/typophile.com/files/ms_acrobat2.png)\n\n"
    },
    {
      "time": "",
      "content": "Yeah, all the above is right! The pdf i created is at [www.gamepaused.net/presss/download/GamePaused\\_PublisherPack.zip](http://web.archive.org/web/20100921130850/http:/www.gamepaused.net/presss/download/GamePaused_PublisherPack.zip \"www.gamepaused.net/presss/download/GamePaused\\_PublisherPack.zip\") - created this way!\n\nMatt\n\n"
    }
  ]
}
