{
  "id": "18388",
  "title": "National Australia Bank's new logo",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "What do you all think of the National Australia Bank’s new logo?\n\n ![](http://web.archive.org/web/20140803073127im_/http:/typophile.com/files/National-nab.jpg)\n\nYet another rendered 3D icon with all lowercase text. All l/c seems to be the first stop for convincing people you’re ‘friendly and approachable’ these days. Or has it always been that way? What is it about lowercase that’s so friendly? Is it just the variations in character height creating a looser feel, in the same way that ragged text creates a less formal look than justified text?\n\nIf they are trying to be more friendly, the 'friendly' type seems at odds with the strong, bold colours, and I don’t think the rendered logo and flat text fit with each other. Can’t a logo be good anymore without being all 3D?\n\nI know the old type’s Futura, but what’s the new one?\n\nTypographical issues aside, I find it bewildering that a bank would choose to identify itself with a word that means, ‘to take or grab suddenly’ and ‘to catch and arrest a criminal’. I mean, their candour is refreshing, but none the less surprising.\n\n",
  "author": "Stephen Lording",
  "time": "7 Mar 2006 — 6:22pm",
  "uid": "4919",
  "comments": [
    {
      "time": "7 Mar 2006 — 7:03pm",
      "content": "It beats out UBS…  \npeace\n\n"
    },
    {
      "time": "7 Mar 2006 — 7:35pm",
      "content": "Ah, I discussed this with my friend the other day. It was one of these rare occasions where we both agreed completely with each other. She’s in marketing and we usually agree to disagree on everything! I think combining **nab** and red/white on black is a bad idea, it looks absolutely criminal.\n\nFrom [The Age;](http://web.archive.org/web/20140803073127/http:/www.theage.com.au/articles/2006/02/13/1139679535212.html)  \n<cite>\"The bank's rebranding has been characterised by marketing experts and banking analysts as an attempt to assert a new identity after it discovered rogue traders on its foreign exchange desk had lost $360 million through shonky accounting.\"</cite>\n\nMaybe we can expect more shonky accounting. :)\n\nIt was [Richard Henderson](http://web.archive.org/web/20140803073127/http:/www.rco.net.au/) who was behind this. He was behind the ANZ rebranding a few years back. Hit-and-Miss I guess.\n\n"
    },
    {
      "time": "7 Mar 2006 — 10:17pm",
      "content": "Yeah, I really like a lot of the ANZ advertising stuff, but he hasn't got me with this one. I don't mind the seriousness of the colours; I think too many banks are trying to portray themselves as your best mate from next door, and it can come off as too casual and unprofessional. I want my bank to be focussed on business, not heading out with me to the pub. I think it's just the lowercase and the fact that it now says 'nab'. I've never heard anyone say 'nab', only 'National' or 'N.A.B', so I find it strange that the bank's encouraging people to use a name with such an obvious alternate meaning.\n\n"
    },
    {
      "time": "7 Mar 2006 — 10:44pm",
      "content": "I think the ANZ advertising is done by M&C Saatchi Melbourne which has done great stuff recently.\n\nI know a few people who work for 'nab' and they refer it as 'nab' not 'N.A.B'. I'm not sure if the NAB scandal is completely forgotten, but I think changing to 'nab' doesn't play to their favour since their image isn't squeaky-clean.\n\nAs for the colour, perhaps they bought in more black to differentiate NAB from Westpac. I can get confused between the two from a long distance (i.e. signage/atm).\n\n ![](http://web.archive.org/web/20140803073127im_/http:/typophile.com/files/wbk-l.gif)\n\n ![](http://web.archive.org/web/20140803073127im_/http:/typophile.com/files/nab.png)\n\n"
    },
    {
      "time": "7 Mar 2006 — 11:44pm",
      "content": "It could be much, much worse.\n\n"
    },
    {
      "time": "8 Mar 2006 — 2:14am",
      "content": "I like this new National Australia Bank logo.\n\n_It could be much, much worse._\n\nExactly. It really isn't that bad.\n\nThe font is Lucas De Groot's [The Mix](http://web.archive.org/web/20140803073127/http:/www.fonts.com/FindFonts/detail.htm?pid=413733). I've been waiting about five years for this variety of progressive type design to graduate to mainstream use with major corporations. All power to Lucas.\n\n3D---what 3D?\n\nI think you're overeacting to something new, simply because it is new and not the same as its predecessor. Try not being so cynical. Accept things at face value and avoid projecting your personal values onto them.\n\nPeople who work inside the corporation and industry insiders refer to it as \"nab\", but that phraseology does not---has not---filtered into common parlance, so the perjorative meaning of \"nab\" isn't a big issue. Certainly the new ad campagne on television does not call it \"nab\".\n\n_I’ve never heard anyone say ‘nab’, only ‘National’ or ‘N.A.B’..._\n\nThis is what I mean.\n\n_...the ‘friendly’ type seems at odds with the strong, bold colours..._\n\nI don't see how. How is it that those forms are at odds with the bold color scheme? Give it a break.\n\n_I think combining nab and red/white on black is a bad idea, it looks absolutely criminal._\n\nHow does it evoke \"criminal\"? I think you guys just don't want to like it, without coming up with good reasons why its bad.\n\n_All l/c seems to be the first stop for convincing people you’re ‘friendly and approachable’ these days. Or has it always been that way? What is it about lowercase that’s so friendly? Is it just the variations in character height creating a looser feel, in the same way that ragged text creates a less formal look than justified text?_\n\nPartly, yes. But fundamentally, Latin capitals are synonymous with iron-fisted authority, officialdom and rigid social formality. They're an invention of the ancient Romans, who too often valued pompousness and grandeur above human concerns. The roman Latin capital forms draw on the formal, constructed, component-based nature of classical architecture---Roman & Greek temples and official public buildings. They're based on circles, squares, triangles, straight lines and right angles---perfect Euclidian geometry the ancients assumed was indelible and unalterable, imune to any fault or criticism.\n\nAll of that stuff was deeply concerned with authority, and an even more inflexible idea---the all-powerful will of the ancient gods who supposedly ruled people's lives. Latin capitals have been employed ever since by people in positions of power to assert their dominance and authority.\n\nIn the present political atmosphere where corporations and govenments are held accountable, scutinized for corruption and abuses of power, even the tiniest failure to account for their liabilities, a typographic depiction of authority is the last thing a powerful corporation like a bank wants as its public face. So yes, it is a determined effort at appearing human and freindly. For a large bank that's paradoxical, since large banks are extremely powerful and noted for their inflexibility towards customers. But that's marketing.\n\nStart with the assumption that all advertising is a big fat lie. Too bad the intention is phoney. Expect nothing and you can't be disappointed. Nevermind the insincere will of those who fabricate these lies. Separate politics from design. I know, I know, they're related---the first causes the second. But it is possible to ignore that aspect and appreciate art & design, however commercial, for its own sake, for what it is rather than the company it represents.\n\nThere is much more to typographic design and this logo design than may be first realized. It isn't just a matter of lower case versus caps. Significantly, the lower case forms in this logo are of a humanist design. Humanism started in the Renaissance period; the movement symbolized the rejection by scholars and artists of the oppressive empirical governance of the Holy Roman Empire and the Church, and the rise of the independent city states in Europe, the exemplary model being the very first---Florence.\n\nWith the rediscovery of ancient knowledge, in particular Aristotle's _Organon_ \"The tool\" (a philosophical device that allowed ordinary people to demystify all that baffled them), along with the architect Brunelleschi's discovery of central perspective (in painting), the seven liberal arts and with the study of nature became separated for the first time from state and church, prompting the humanists to place man at the center of the world, in place of God, man as determiner of his life as an individual and of his own destiny.\n\nThe creators of the new N.A.B logo may not have had all that in mind when they chose The Mix as the font. But humanist cultural values are ingrained in the letter forms regardless, and they do carry specific meaning thru their visual sense. This humanist aesthetic is not present in Latin capitals or geometric sans serifs. The Mix has serifs too---a reference to the humanist antiqua type model. That is the kind of rationale I would use to select The Mix instead of a traditional book roman or a geometric face. You want good public relations? Avoid industrial art & design as well.\n\nj a m e s\n\n"
    },
    {
      "time": "8 Mar 2006 — 2:33am",
      "content": "\\> _The font is Lucas De Groot’s The Mix. I’ve been waiting about five years for this variety of progressive type design to graduate to mainstream use with major corporations. All power to Lucas._\n\nNope [it's not](http://web.archive.org/web/20140803073127/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=FK.108404.0.1&attributes.sampleSize=48&sampleText=nab&sampleSize=48). TheMix looks way better, this is a quite poor attempt.\n\n"
    },
    {
      "time": "8 Mar 2006 — 2:52am",
      "content": "<cite>How does it evoke “criminal”? I think you guys just don’t want to like it, without coming up with good reasons why its bad.</cite>\n\nOkay, maybe using the word \"criminal\" was too bold. I was only trying to add some colour to my language. :)\n\nGood reasons? Well I think I've given my reasons why I think it's poor. I don't think it's necessarily bad as a rebrand was long overdue.\n\nThanks Yves, I was sure it wasn't TheMix.\n\n"
    },
    {
      "time": "8 Mar 2006 — 3:15am",
      "content": "Futura is a bit 90's isnt it?\n\nIts amazing how many times the 'nab' has changed its name in the last 10 years:\n\nNational Bank of Australia -\\> National Australia Bank -\\> National -\\> nab\n\n"
    },
    {
      "time": "8 Mar 2006 — 4:58am",
      "content": "James: full-on reply! Thanks for taking the time.\n\nYeah, I know it could be worse. They could have used the colour palette for the [Commonwealth Games](http://web.archive.org/web/20140803073127/http:/www.melbourne2006.com.au/). As I said before: I like the colours and I don’t really mind the star; I’m mostly concerned with the lowercase text.\n\n<cite>How is it that those forms are at odds with the bold color scheme? Give it a break.</cite>\n\nI think the strong colours and the gleaming star create a look and feel that is almost militant. Can I scoot around Godwin’s Law by saying a certain well-known political party selected those colours for a reason? ;-) Then you glance down and there’s this informal, hello!, da de da, bit of text that - for me - just doesn’t quite fit. It’s too casual in contrast to the other elements.\n\n<cite>3D—-what 3D?</cite>\n\nSure, it’s not all singing, all dancing 3D, but it still has a bevelled effect. Maybe I’m wrong, but I feel like it should be one style or the other. Render both or neither.\n\nI don’t think I’m being cynical or projecting too much, but if I’m the only person who double-takes at ‘nab’, well, good luck to them. Many happy banking returns, etc, etc. :-)\n\nSo it’s not The Mix. Is it a custom job then?\n\n"
    },
    {
      "time": "8 Mar 2006 — 9:39am",
      "content": "I think it looks okaaay. It is easier on the eye than the old one. The eye takes it in faster ( recognizes it ) too. Thats a major consideration. I think that it might have been smarter or cooler to use a warmer red to play up the australianess (sp?) - but then I am a yank & I don't know how aussies feel about colors. Also, having to color match all the time might be too expensive. As far as 'nab' goes - I think people are getting more & more used to acronym-homonyms of in media. For instance for me, 'CIA' brings 3 organizations to mind readlily. The US gov arm, Culinary Institute of America, and the Cleveland Institute of Art ( [http://www.cia.edu](http://web.archive.org/web/20140803073127/http:/www.cia.edu/ \"http://www.cia.edu\") ), if I was Canadian the list would no doubt be longer. Now, is the design wonderful? No. It isn't. But It will probably serve the company better than the old logo which was was a pig's breakfast. Also, if they decide to reverse black & white later it will be easy & no one will notice very much.\n\n"
    },
    {
      "time": "8 Mar 2006 — 10:08am",
      "content": "The design is by Richard Henderson:\n\n[http://www.smh.com.au/news/business/revised-logo-nab-tries-for-a-fresh-s...](http://web.archive.org/web/20140803073127/http:/www.smh.com.au/news/business/revised-logo-nab-tries-for-a-fresh-start/2006/02/06/1139074167908.html \"http://www.smh.com.au/news/business/revised-logo-nab-tries-for-a-fresh-start/2006/02/06/1139074167908.html\")\n\n\\* \\* \\* \\* \\*  \nDon't sit. Act!!!  \nGlobal Warming Melts The Poles. Cities from New York to London could also be swamped by rising seas.\n\n"
    },
    {
      "time": "8 Mar 2006 — 10:17am",
      "content": "Yves are you saying they just nabbed the Mix or that it was a licensed modification?\n\nChrisL\n\n"
    },
    {
      "time": "8 Mar 2006 — 11:30am",
      "content": "Nah, it's not based on TheMix. At first sight it resembles [that Siemens slab serif](http://web.archive.org/web/20140803073127/http:/www.urwpp.de/deutsch/home.html) a bit.\n\n_\"(...) this is a quite poor attempt\"_ was a quite poor literal translation from Dutch. ;^P\n\n"
    },
    {
      "time": "8 Mar 2006 — 12:33pm",
      "content": "Does the star make anyone else think \"that's your slice and this is the bank's slice\" or possibly hesitation cuts? Also looked rather Canadian at first glance.  \nTim\n\n"
    },
    {
      "time": "8 Mar 2006 — 3:00pm",
      "content": "My first blink at it said \"Star of David\" but the cuts said \"Sprint\" (old logo) or Gillette razor. I don't know the brand so I had no notion of prior history.\n\nChrisL\n\n"
    },
    {
      "time": "8 Mar 2006 — 4:02pm",
      "content": "I would like to know the rationale behind the cuts, and why they've shrunk in the new logo. Was it just an aesthetic decision? I think the old ones look like a couple of coin slots, maybe for a large piggy bank, but the new ones look like slices, or notches carved into a stick.\n\n"
    },
    {
      "time": "8 Mar 2006 — 4:11pm",
      "content": "\\> I would like to know the rationale behind the cuts\n\nContact Mr. Henderson and ask him....\n\ninfo[@]rco.net.au\n\n\\* \\* \\* \\* \\*  \nToday is International Women's Day. Hey, be nice to your wife/girlfriend. Everyday.\n\n"
    },
    {
      "time": "8 Mar 2006 — 6:07pm",
      "content": "I emailed that address, and was told that they get a lot of questions about this, but that they didn’t actually do the rebranding – it was the principles in Sydney who handled it. I asked if they knew anyone in Sydney I could ask, but they didn’t. They did however do some good ol' googling on my behalf, and directed me to The Age article Geoff linked to above. Which, now that I reread it, says:\n\n<cite> The seven-pointed red star remains, but its two lines, originally intended to mark the merger of Commercial Bank and National Bank of Australasia, have been tapered to look more \"dynamic\".</cite>\n\nAah, dynamism. Is there anything it can’t do? :-) So there I go.\n\n"
    },
    {
      "time": "8 Mar 2006 — 6:48pm",
      "content": "How about an arrow to prove they are \"forward looking\"\n\nChrisL\n\n"
    },
    {
      "time": "9 Mar 2006 — 10:33am",
      "content": "Yves, I'm curious what fault you find with the type? How is The Mix better?  \nIt seems well constructed to me. I might add a little contrast, but it seems like preference.\n\nIn gereral I think it's nice. The disadvantage I see is that they've lost their grid. Before, the star's parallel sides framed the N (never noticed that about a 7 point star). Now it's balanced, but not as tight. They still use it horizontal ( [http://www.national.com.au/About\\_Us/0,,175,00.html?ncID=ZBA](http://web.archive.org/web/20140803073127/http:/www.national.com.au/About_Us/0,,175,00.html?ncID=ZBA \"http://www.national.com.au/About\\_Us/0,,175,00.html?ncID=ZBA\")) but the proportions feel a little too equal between mark and type in this format. But overall ... workable. No reason for outcry IMO.\n\nR\n\n"
    },
    {
      "time": "9 Mar 2006 — 1:50pm",
      "content": "If the new logo is intended to be just a refinement of the old logo, then it is a success.\n\nIf the new logo is intended to be a signifier that the National Australia Bank is reinventing itself as a new and different bank from its old incarnation, then I think it falls short. The change is so subtle it just says to me \"we are re-doing our stationary\" not, we are the new NAB.\n\n"
    },
    {
      "time": "11 Aug 2007 — 4:40am",
      "content": ".\n\n"
    },
    {
      "time": "22 Jul 2006 — 5:09am",
      "content": "National Bank of Australia -\\> National Australia Bank -\\> National -\\> nab\n\nI live in Australia and I was not even aware \"nab\" was the National Australia Bank. It just goes to prove that the logo retouch seems to be an impatient upgrade.\n\nTake for example the Shell and Ontario Trillium upgrades. Slow, decade and generational changes. When you fidget too much with your identity too much, especially for a Bank (stable, secure, professional), it obviously signifies trepidation amongst its upper ranks.\n\nAs for the lower case phenomena. THANK GOD!\n\nLower case feels balanced in this case. Why should there need to be a hierarchy suggested in the logo?\n\nNot that I mind upper case in logos. But their absense does not painfully harm a good branding.\n\nAs for the use of the acronym NAB. Sounds like a very comical choice. Perhaps the designer knew he could get away with providing a diservice for the client.\n\nViva le Revolucion!\n\n"
    },
    {
      "time": "14 Aug 2006 — 11:43pm",
      "content": "For a more detailed 'rationale' for the rebranding, try\n\n[http://www.principals.com.au](http://web.archive.org/web/20140803073127/http:/www.principals.com.au/ \"http://www.principals.com.au\")\n\nIt's all there...\n\n\"Our task was to translate their strategy and positioning into a compelling brand identity and look and feel.  \nThe new logo is just that. Friendly lower case NAB. A bolder brighter star. And a striking black background provides the stand out that distinguishes NAB from the other red and white banks in Australia.\"\n\n"
    },
    {
      "time": "20 Jan 2013 — 9:58pm",
      "content": "What is it with company rebrandings leading to even more out-dated looking logos (i.e. this, Gap, etc.)? Talk about ironic.\n\n"
    },
    {
      "time": "26 Jan 2013 — 6:10am",
      "content": "This re-branding really worked for me; goes with the trend. Even Bank of America did a rebranding but that was more drastic change. Check this article [Famous Logo Redesigns](http://web.archive.org/web/20140803073127/http:/www.logorium.com/blog/35-famous-logo-redesigns).\n\n"
    },
    {
      "time": "26 Jan 2013 — 8:49am",
      "content": "_Talk about ironic._\n\nOK.  \nIf a business has been around long enough that its original logo is in danger of coming back into fashion, then it’s time to nip that retro cachet in the bud. A well-established corporation shouldn’t look hip, but bland and mainstream, because it is.\n\n"
    }
  ]
}
