{
  "id": "18393",
  "title": "trying to find a site to search font by mood.",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi all,\n\nI have just a quick question that I’m sure you will all be able to answer =)  \nI have seen this internetsite once where you could enter what you are looking for in a typeface and then it gave you a couple of matches. You could search by mood, serif, style, etc.\n\nWould anybody plz be able to tell me what that site was, I’ve been looking for a couple of days now, but apperently at all the wrong places, just can’t find it anymore.\n\ntnx people!  \ndav.\n\n [‹ (x) Montrose - ITC Berkeley Oldstyle {Alessandro}](http://web.archive.org/web/20080103050542/http:/typophile.com/node/18398 \"Go to previous forum topic\") [(x) \"Unleashed Jeans Genie\" high contrast modern serif - Pistilli Roman (Didoni) {Yves} ›](http://web.archive.org/web/20080103050542/http:/typophile.com/node/18378 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080103050542/http://typophile.com/user/11657\" title=\"View user profile.\">skeetone</a>",
  "time": "<br>",
  "uid": "11657",
  "comments": [
    {
      "time": " 8.Mar.2006 6.15am",
      "content": "The keyword system on [MyFonts](http://web.archive.org/web/20080103050542/http:/www.myfonts.com/) works pretty well.\n\n"
    },
    {
      "time": " 8.Mar.2006 6.18am",
      "content": "what i like best about MyFonts’ keyword system is that you can edit keywords if you have an account with them.\n\n"
    },
    {
      "time": " 8.Mar.2006 6.57am",
      "content": "thank you very much, works like a charm indeed!\n\nI have just one other little question which might sound a bit strange..but is there a famous type family that is made to look like another one, but slightly different? (I know it’s a strange question, but I need to typographically show the sentence: ’but he wants to be just like’, so I thought I use a type with a underlying thought that can be logically explained).\n\nNone are so hopelessly enslaved as those who falsely believe they are free.  \n-Goethe-\n\n"
    },
    {
      "time": " 8.Mar.2006 7.23am",
      "content": "\\> _(...) but is there a famous type family that is made to look like another one, but slightly different?_\n\nActually there’s loads of those, but Helvetica \\> Arial springs to mind. Did you have anything specific in mind?\n\n"
    },
    {
      "time": " 8.Mar.2006 8.01am",
      "content": "Not really. Maybe it will help if I explain what I am working on. I’m making a book about Vincent (the poem by tim burton). This poem is so dynamic, going from sad to happy, cheerful to insane, young boy to old man, etc. that I thought that it would be nice to try and translate the story typographically. So I split the poem up in sentences and took 1 letter from every sentence and made it a lot bigger then the rest. The letter will be used to communicate the feeling of that particular part of the poem. So on every page I’m using bodoni as the text with one letter in the typeface best communicating the mood and everything arranged according to a grid around that letter to even more express the mood.\n\nSo in this case anything will be good really as long as it’s a type that has a well known history since on the left side of the page next to the poem I will give a very brief history of the type used and a little bit about why I used that type to express that mood.\n\nI’m hoping that with this book I can playfully teach the reader a little bit about different typefaces and how they can be used for communication purposes.\n\nSo I’ll do a little reading into helvetica vs arial (I think these are quite good because everybody uses them so much they should have a place in the book as well, I think). =)\n\nThank you very much!!!\n\nNone are so hopelessly enslaved as those who falsely believe they are free.  \n-Goethe-\n\n"
    },
    {
      "time": " 8.Mar.2006 8.24am",
      "content": "Just wanted to thank you again for letting me know about the helvetica - arial since I just found quite an interesting text about the history of arial.  \nfor anyone (like me) who doesn’t really know too much about the history of arial and would like to know a little bit more, read this:\n\n[http://www.ms-studio.com/articles.html](http://web.archive.org/web/20080103050542/http:/www.ms-studio.com/articles.html \"http://www.ms-studio.com/articles.html\")\n\nNone are so hopelessly enslaved as those who falsely believe they are free.  \n-Goethe-\n\n"
    },
    {
      "time": " 8.Mar.2006 12.52pm",
      "content": "FYI — on the topic of searching typefaces by mood, emotion and warm-fuzzies:\n\n[Type-Expertise.com, Denis Ravizza, Inventor and chief architect of the Universal Font Classification system.](http://web.archive.org/web/20080103050542/http:/www.type-expertise.com/overview.htm)\n\nWe had a few topic threads regarding the re-classification and searchable terms for type styles, but I can’t seem to locate them at the moment.\n\n"
    }
  ]
}
