{
  "id": "18404",
  "title": "magazine masthead",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "i posted this in the scripts area, but no one has responded, so i'm reposting here in the logos area, which maybe the more appropriate place anyways--hope i'm not being obnoxious!\n\ni'm working on a masthead for a magazine about classic wooden motorboats. i've had a lot of trouble with it, specifically with the 'RAS' letter combo, and i could use some expert eyes. any advice is greatly appreciated...\n\n/aaron\n\n| Attachment | Size |\n| --- | --- |\n| [masthead.jpg](http://web.archive.org/web/20131022084537/http:/typophile.com/files/masthead.jpg) | 19.44 KB |\n\n",
  "author": "a2z",
  "time": "8 Mar 2006 — 4:40pm",
  "uid": "2805",
  "comments": [
    {
      "time": "8 Mar 2006 — 4:46pm",
      "content": "Lots of fun. Have you tried adding a little variation to the second S -- maybe it drops a little lower and wraps into the first -- or the second L? The way that the RA letter combo almost appears to be interacting is really nice. I might also consider varying the Bs a little.\n\n"
    },
    {
      "time": "9 Mar 2006 — 8:57am",
      "content": "thanks for the response.  \nwell, i'm not exactly sure what you mean, but initially i did try doing things with the 'SS' pair. it seemed to make the wordmark feel unbalanced--more complicated on one side than the other... i just wasn't pulling it off right somehow, so i simplified it...\n\n ![](http://web.archive.org/web/20131022084537im_/http:/typophile.com/files/masthead2.jpg)\n\n/aaron\n\n"
    },
    {
      "time": "9 Mar 2006 — 9:09am",
      "content": "i think the key is to find balance as you have seen. The right stroke on the A could fall down behind the normal stroke of the S (from the first jpg) and then the second S could interact with the first S. You could have a entrance swash on the first B and maybe an extra swash on the bottom loop of the second B, or maybe the E could interact a little with the first L or something like that. I guess it depends on how swashy you want it to become. Perhaps to see what is possible you could check out the [gallery](http://web.archive.org/web/20131022084537/http:/www.letterheadfonts.com/gallery/) at [Letterhead Fonts](http://web.archive.org/web/20131022084537/http:/www.letterheadfonts.com/), there are some really great examples there.\n\n"
    },
    {
      "time": "10 Mar 2006 — 6:05am",
      "content": "hey man, i think i like more the first version but the last \"ELL\" are not well aligned  \nthink thats it\n\nnice work man !!!\n\n"
    },
    {
      "time": "10 Mar 2006 — 6:51am",
      "content": "As mentioned above I think you should look at the bottom strokes and alignment of the ELL, you could also look at making the letters slightly wider to match better the R & A; you could also look at modulating the stroke on the bottom counter of B, like the top counter, a slightly more protruding serif on the Bs and R might look good; the terminals of the Ss is a bit too decorative compared with the simpler strokes used for the other letters you could look at reducing the spiral shape. Overall though it is a friendly image that goes well with the handbuilt quality of wooden boats.  \nTim\n\n"
    }
  ]
}
