{
  "id": "18403",
  "title": "InDesign CS2 Comprehensive Keyboard Shortcuts File?",
  "forum": "Build",
  "tags": [

  ],
  "content": "I’m looking to make the jump from Quark 6.5 to InDesign CS2 when I get back to school. I’ve seen a lot of thoughts about this and even just for the usage of OpenType fonts that I have it’ll be worth it. The only thing that is rather daunting to me is not knowing any of the vital keyboard shortcuts, besides the default Adobe ones that aren’t application specific. I’ve attached a PDF of what I’m looking for, although this is for Photoshop CS2 and not InDesign. Or even something that compares the Quark ones to the Adobe ones? I hope this is the right place to put this!\n\nI start back at school in 3 weeks so I’m going to be prepping myself since I’ll be involved in 3 lab classes that will require useage of layout programs: Environmental Design, Typography III and Annual Report Design. Thanks in advance for any pointers that you can give as far as this switch goes!\n\n| Attachment | Size |\n| --- | --- |\n| [PSCS2\\_Shortcuts\\_Mac.pdf](http://web.archive.org/web/20080531001416/http:/typophile.com/files/PSCS2_Shortcuts_Mac.pdf) | 50.39 KB |\n\n [‹ Stop FontLab from shifting accents?](http://web.archive.org/web/20080531001416/http:/www.typophile.com/node/18427 \"Go to previous forum topic\") [Unicode based fonts problems in Photoshop ›](http://web.archive.org/web/20080531001416/http:/www.typophile.com/node/18065 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080531001416/http://www.typophile.com/user/8451\" title=\"View user profile.\">dave bailey</a>",
  "time": "<br>",
  "uid": "8451",
  "comments": [
    {
      "time": " 8.Mar.2006 4.31pm",
      "content": "If you already have InDesign you will find some very good pages in the InDesign help file which clearly list an innumerable amount of valuable shortcuts for most tasks. I found these by keyword searching the help file.\n\nGood luck, I strongly recomend InDesign, having left Quark for InDesign 1.something I have not looked back.\n\n-nic\n\n"
    },
    {
      "time": " 8.Mar.2006 4.36pm",
      "content": "Found this by simply googling it for ya. It may be of use? Otherwise I am sure you will find plenty through a “google”.\n\n[www.yearbooks.biz/assets/Forms/IDCS\\_shortcuts.pdf](http://web.archive.org/www.yearbooks.biz/assets/Forms/IDCS_shortcuts.pdf)\n\nAgain, good luck.\n\n-nic\n\n"
    },
    {
      "time": " 8.Mar.2006 4.39pm",
      "content": "I tried googling, but thanks for that link!\n\n"
    },
    {
      "time": " 8.Mar.2006 4.41pm",
      "content": "No trouble, hope its of use.\n\n"
    }
  ]
}
