{
  "id": "18411",
  "title": "Looking for typographical term (\"a document overladen with running text, thus difficult to read\")",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi all,  \nis there a typographical term in English for “a document overladen with running text, which make it difficult to read due to low line spacing and a lack of paragraphs”. In German this is called “Bleiwüste” (literally: desert of hot type).\n\nThanks\n\n [‹ Clients Who Make Me Sweat](http://web.archive.org/web/20071201164927/http:/typophile.com/node/18465 \"Go to previous forum topic\") [Quark still No.1 for Canadian magazines ›](http://web.archive.org/web/20071201164927/http:/typophile.com/node/18351 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071201164927/http://typophile.com/user/11904\" title=\"View user profile.\">Chris W.</a>",
  "time": "<br>",
  "uid": "11904",
  "comments": [
    {
      "time": " 9.Mar.2006 4.53am",
      "content": "\\> _“Bleiwüste” (literally: desert of hot type)_\n\nBrilliant! :^D\n\nCan’t help you unfortunately, I’m Belgian.\n\n"
    },
    {
      "time": " 9.Mar.2006 5.01am",
      "content": "We might just say the page is too heavy. That is much less expressive than your wonderful German expression though.\n\nChrisL\n\n"
    },
    {
      "time": " 9.Mar.2006 5.50am",
      "content": "Why do you need this word ?\n\n"
    },
    {
      "time": " 9.Mar.2006 5.59am",
      "content": "I need this for the English translation of a book review, in which also the book’s design is covered. Besides, as a translator I am very much interested in the right terminology.\n\n"
    },
    {
      "time": " 9.Mar.2006 6.12am",
      "content": "Further to Chris’ comment copy-heavy is used for a document that has so much copy and so few pages that readability suffers, although it doesn’t specifically cover lack of paragraphs or low line spacing. Low line spacing could be described as poorly leaded.  \nTim\n\n"
    },
    {
      "time": " 9.Mar.2006 6.49am",
      "content": "I think you will need a phrase in English, such as: “off-puttingly dense, clotted layout of the text.”\n\n"
    },
    {
      "time": " 9.Mar.2006 7.44am",
      "content": "I believe that “bad design” covers it, although you might consider “ultrafaulkneresque” as an alternative...\n\n"
    },
    {
      "time": " 9.Mar.2006 7.54am",
      "content": "Dense, heavy, dark, cluttered, cramped, claustrophobic. These terms all work. I don’t think there’s one as good as the German, but then again English never quite had the flair of German for really specific word agglomerations.\n\n"
    },
    {
      "time": " 9.Mar.2006 8.32am",
      "content": "oppressively dense?\n\nChrisL\n\n"
    },
    {
      "time": " 9.Mar.2006 9.49am",
      "content": "Maybe “uniformly desolate monotonous pages”\n\n"
    },
    {
      "time": " 9.Mar.2006 9.53am",
      "content": "I’ve often heard (and used) the term “_agoraphobic_” applied to metaphorically imply the design lacks white space. (Agoraphobia being the part of social anxiety panic disorder that keeps people confined to their homes, characterized by the _fear of open spaces_).\n\nBut that’s probably just as obtuse as using the German term _Bleiwüste_!\n\n"
    },
    {
      "time": " 9.Mar.2006 10.51am",
      "content": "I’ve heard and used the term “too gray”. I’ve heard, especially in newspaper work, that a designer wants to “break up the gray” by adding a picture or a pull-quote. The idea is that columns of type are “the gray” and need to be handled somehow.\n\n"
    },
    {
      "time": " 10.Mar.2006 5.34am",
      "content": "Thanks everybody for your help.\n\n"
    },
    {
      "time": " 11.Mar.2006 8.25am",
      "content": "Chris, if you’re still around what did you pick?\n\nCheers, Si\n\n"
    }
  ]
}
