{
  "id": "18431",
  "title": "T FOR TYPOGRAPHIC VENDETTA",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "The new movie \"V for Vendetta\" set in a totalitarian London of the future would seem to hold some real promise for stylish typographics. A peek at the movie website though reveals more mish-mash than style. I count about four faces on the opening page.\n\nFittingly, they do use ITC Johnston or P22 Underground for some...\n\n ![](http://web.archive.org/web/20141202021201im_/http:/typophile.com/files/vfont.jpg)\n\nA sinister redrawing of Gill or Johnston would have been cool, maybe set in a corrupted Tube roundel. A little more consistency would be nice. The posters page inside the site shows quite a mix of styles.\n\n",
  "author": "londontype",
  "time": "9 Mar 2006 — 8:14pm",
  "uid": "11256",
  "comments": [
    {
      "time": "9 Mar 2006 — 9:37pm",
      "content": "Are you familiar with the Alan Moore graphic novel that the film is based on?\n\nI was about to check the typographic style within the original graphic novel myself, but I must have loaned it to somebody, as it's not on the shelf. Drats. I have no idea who/when I loaned it to - it must have been a long time ago.\n\nT\n\n"
    },
    {
      "time": "10 Mar 2006 — 4:04am",
      "content": "I'll check my copy tonight.\n\n"
    },
    {
      "time": "10 Mar 2006 — 4:07am",
      "content": "\\> _A sinister redrawing of Gill or Johnston would have been cool (...)_\n\nSomething like [this](http://web.archive.org/web/20141202021201/http:/www.emigre.com/dp/getfontpage.php?SFEMPSREGMC.html)? ;^)\n\n"
    },
    {
      "time": "10 Mar 2006 — 6:00am",
      "content": "Yes! I'd forgotten about [Priori](http://web.archive.org/web/20141202021201/http:/www.emigre.com/dp/getfontpage.php?SFEMPSREGMC.htmlm). Given all the cutlery in the movie I'm sure they want pointy V's. Johnston's are flat on the baseline. I'm unfamiliar with the comic or graphic novel. Maybe I should ask my kids...\n\n"
    },
    {
      "time": "10 Mar 2006 — 6:05am",
      "content": "I'll check my copy in a minute. I do remember it having predominantly Bank Gothic or something similar. :)\n\n"
    },
    {
      "time": "10 Mar 2006 — 6:24am",
      "content": "Ok, I have the graphic novel, not the original individual comics. The typography of the novel design is inconsistent, the cover jacket has something like Univers Condensed and Eurostile, inside there seems to be a mixed use of Eurostile/Bank Gothic(!!) and Univers Ultra Condensed (but not quite), the R is different. The combination of eurostile and bank gothic throughout is not pretty at all... almost if the designer(s) did not notice the difference between the two.\n\nThere is some ITC Kabel in there! ~ Page numbers and headers are set in ITC Kabel Medium. :)\n\nP.S. The chapters are set in an art deco typeface, drastic.\n\n"
    },
    {
      "time": "10 Mar 2006 — 7:26am",
      "content": "You'd think any self-respecting totalitarian regime could get their typographic indentity in order...\n\n"
    }
  ]
}
