{
  "id": "18450",
  "title": "searchin for THE font",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi!  \nI was wondering if anybody could help me. I’m helping publishing a book that follows a conference on architecure, called “On Growth and Form” (after D’Arcy Thompson’s book) and I’m looking for a font that would fit the idea. I was thinking of Mrs. Eaves because of the ligatures ... but, well I’m an architect, I don’t know that much about typography, so any help will be very appreciated. I’m looking for something a little bit organic but not very loud that would bear a resemblance to subject of the book ... hmmm ... I guess I don’t know the adequate graphic design language. Anyways thanks!\n\n [‹ Russian/Portugese](http://web.archive.org/web/20080924093401/http:/typophile.com/node/18599 \"Go to previous forum topic\") [Zurich info. ›](http://web.archive.org/web/20080924093401/http:/typophile.com/node/18585 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080924093401/http://typophile.com/user/11934\" title=\"View user profile.\">Ioana</a>",
  "time": "<br>",
  "uid": "11934",
  "comments": [
    {
      "time": " 10.Mar.2006 2.08pm",
      "content": "Can you give us a brief summary of the ideas in the book?\n\n"
    },
    {
      "time": " 10.Mar.2006 2.31pm",
      "content": "The ideas: architecture and form, architecture as form, relations with biological forms (cells, tissues, skeletons) and mathematics (mathematical distorsions, stretchings, shiftings), etc.  \nA few titles: Phenomeno-logical garden: A work in morpho-logical process, The skin of the “sky bubble” at Expo ‘67, Old and New Organicism in Architecture - the metamorphoses of an aesthetic idea, Naturalization in Circles: Architecture, Science, Architecture ... and so on.\n\n"
    },
    {
      "time": " 10.Mar.2006 3.10pm",
      "content": "Does it represent any particular nation or region?\n\n"
    },
    {
      "time": " 10.Mar.2006 3.13pm",
      "content": "no, it’s architecture in general\n\n"
    },
    {
      "time": " 10.Mar.2006 3.22pm",
      "content": "How about [Veljovic](http://web.archive.org/web/20080924093401/http:/store.adobe.com/type/browser/P/P_230.html)? It’s lively and sculptural...\n\n—Michael.\n\n———————————————————————————  \n// love what you do or do something else. //  \nMichael Ebert — graphic designer, jazz saxophonist, horror movie devotee  \n [http://homepage.mac.com/mwebert](http://web.archive.org/web/20080924093401/http:/homepage.mac.com/mwebert \"http://homepage.mac.com/mwebert\")  \n [mwebert@mac.com](mailto:mwebert@mac.com)  \n———————\n\n"
    },
    {
      "time": " 10.Mar.2006 3.40pm",
      "content": "\\> On Growth and Form” (after D’Arcy Thompson\n\nThe British biologist, no?\n\nA font by Jeremy Tankard or Jean Porchez\n\nTankard - [http://www.typography.net](http://web.archive.org/web/20080924093401/http:/www.typography.net/ \"http://www.typography.net\")\n\nPorchez - [http://www.typofonderie.com](http://web.archive.org/web/20080924093401/http:/www.typofonderie.com/ \"http://www.typofonderie.com\")\n\n"
    },
    {
      "time": " 10.Mar.2006 3.44pm",
      "content": "You are looking for an archetypal [Modern] type that is purely derived from mathematical ratios. One example you should look at is Bodoni (Didot and to a certain extent, Bulmer, closely follows). Albeit Bodoni isnt the greatest for textface in my experience. The hairline serif simply diminish when under 8 pt. It seemed like you wanted a serif-face but I would recommend some Humanistic sans that is also very geometrical such as Frutiger. Good Luck.\n\n"
    },
    {
      "time": " 10.Mar.2006 4.22pm",
      "content": "Go for Rotis [fonts.com], that’s fipkinsly, also read:  \n [http://www.spiekermann.com/iblog/C1109747452/E1829097339/index.html](http://web.archive.org/web/20080924093401/http:/www.spiekermann.com/iblog/C1109747452/E1829097339/index.html \"http://www.spiekermann.com/iblog/C1109747452/E1829097339/index.html\")\n\n"
    },
    {
      "time": " 10.Mar.2006 4.32pm",
      "content": "I think your idea would work differently for text and display.  \nOne of the Odile family has fashionable organic flourishes, and the rest is pretty solid.  \nBut is it ready yet, chester?\n\n"
    },
    {
      "time": " 10.Mar.2006 5.13pm",
      "content": "<cite>Phenomeno-logical garden: A work in morpho-logical process</cite>  \nSet it in dingbats.\n\n"
    },
    {
      "time": " 10.Mar.2006 5.37pm",
      "content": "When I think Buckminster Fuller, the first thing that comes to mind is “Gridnik” from The Foundry:  \n [http://www.foundrytypes.co.uk/foundry\\_gridnik/gridnik.html](http://web.archive.org/web/20080924093401/http:/www.foundrytypes.co.uk/foundry_gridnik/gridnik.html)\n\nAnd it works surprisingly well in text, although a book set completely in Gridnik might be pushing it.\n\nAs for Odile by Sibylle Hagmann...\n\nBeta versions of Odile are available, and the final (OpenType! and legacy) fonts will be ready in the next week or two. Ioana, you can contact me off-list if you’d like to see this superb type: chester[at]vllg.com\n\nHere’s a taste: [http://vllg.com/Kontour/Odile/Example+About/](http://web.archive.org/web/20080924093401/http:/vllg.com/Kontour/Odile/Example+About/)\n\n(There are 4 images.)\n\n"
    },
    {
      "time": " 11.Mar.2006 5.31am",
      "content": "[Lola](http://web.archive.org/web/20080924093401/http:/fontsmith.co.uk/font_details.php?page=1&details=1&font_num=570&font_name=lola)  \nHas a structured skeleton and an organic italic  \nTim\n\n"
    },
    {
      "time": " 11.Mar.2006 11.57am",
      "content": "Delicato might do the trick? See for yourself...\n\n[http://www.macrhino.com](http://web.archive.org/web/20080924093401/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\n"
    },
    {
      "time": " 13.Mar.2006 10.24am",
      "content": "Guys, thank you sooooo much, you’ve been very helpful. I like a lot the fonts that you’ve proposed. Some of them are extremely interesting. Enigma from Jeremy Tankard looks very good, Odile too. Well what can I say, I’m such a novice in what regards typography, but I do admire you for all this amazing work that you’re doing. The one that I like the most is Delicato from MAC RHINO. It is indeed what I had in mind. Now I just have to convince my boss about it.  \nThanks again,  \nIoana\n\n"
    },
    {
      "time": " 13.Mar.2006 2.39pm",
      "content": "yep, you’re right!!! (for david hamuel)\n\n"
    },
    {
      "time": " 14.Mar.2006 9.39am",
      "content": "If it’s not a done deal, consider a different direction. I’ve seen several books on architecture that go for unserifed typefaces.  \nI think your audience might enjoy Syntax.\n\nYet a different direction is Stormtype Medieval. Haven’t seen it in use, but it was commissioned for architecture.\n\n"
    },
    {
      "time": " 14.Mar.2006 11.51am",
      "content": "I’ve worked with Jeremy Tankard’s Enigma, and was very happy with it. But I also encourage you to take a look at Evert Bloemsma’s [Legato](http://web.archive.org/web/20080924093401/http:/www.evertbloemsma.nl/).\n\n"
    },
    {
      "time": " 16.Mar.2006 7.28am",
      "content": "Dear Ioana,  \nwhilst there are many excellent suggestions in the above thread, it would seem to me that a slightly different approach might be applied to this problem.\n\nAs you know, D’Arcy Thompson’s book, On growth and form, looks at the relationships between form and proportion. There are well known parallels between certain of Thompson’s drawings, and the plates which Durer published concerning the proportions of the human face. In each case, a grid is placed upon the (biological) form, the lines of the grid are displaced, and the resulting transformation applied to the underlying biological struture.\n\nThe closest approximation to this kind of transformational approach is expressed typographically in a rather beautiful book called “L’art et la science de la vraye proportion des lettres attiques” written by Geoffroy Tory (1480 - 1533) and which you may consult in pdf format at the French National Library at:\n\n[http://visualiseur.bnf.fr/Visualiseur?Destination=Gallica&O=NUMM-52553](http://web.archive.org/web/20080924093401/http:/visualiseur.bnf.fr/Visualiseur?Destination=Gallica&O=NUMM-52553 \"http://visualiseur.bnf.fr/Visualiseur?Destination=Gallica&O=NUMM-52553\")\n\nYou will see that there are strong typographic similarities here to the work of both Durer and Thompson.\n\nIf you wish to infuse your typography with these ideas, I would suggest searching for a typeface whose design is itself inspired by the relations and proportions of the human face and body. This would mean searching for a truly Renaissance letter, ie: one designed between 1480 and perhaps 1580. One revival which comes to mind is the face “Tribute” by Frank Heine, based on his studies of a type specimin of François Guyot’s, printed in the Netherlands, around 1565.\n\n[http://www.emigre.com/EF.php?fid=196](http://web.archive.org/web/20080924093401/http:/www.emigre.com/EF.php?fid=196 \"http://www.emigre.com/EF.php?fid=196\")\n\nOther faces of this period might also comme to mind, like those of Claude Garamond, or of Nicolas Jenson, but Heine always felt that certains of these recent versions are highly interpreted. His design remains in certain respects rather more archaic, and perhaps closer to a sense of this period.\n\nIf you use a truly Renaissance face, I think you will incarne a deep sense of proportion in your book, close to the spirit of both Durer, Tory and Thompson.\n\nI will be very interested to learn of your final choice,\n\nbest wishes,\n\npete\n\n"
    }
  ]
}
