{
  "id": "18457",
  "title": "Help with choosing a body font",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello all... first post here.\n\nAbout 9 months ago, when I was absent from work for a few months due to an illness, my organisation’s management decided to undertake a rebranding without involving the inhouse designers.\n\nSo upon my return, I discovered that we’ve ended up with a virtually unusable logo and a corporate family that is completely unsuitable for setting lengthy documents like reports and publications.\n\nI can’t ditch the family chosen for display type but I do have the option to choose a serif face to accompany it.\n\nSo I wondered if anyone would like to suggest directions to start in to help narrow down the choices? I guess the aim is to go for something with a contemporary feel — maybe with a generous x-height, extremely legible (for diversity purposes) and can tolerate tight fitting if necessary.\n\nThe typeface — which I’m not particularly fond of — that the serif face has to accompany is a humanist sans with a peculiar ampersand: Today SB\n\n[http://www.myfonts.com/fonts/efscangraphic/today-sans-sb/](http://web.archive.org/web/20071019125434/http:/www.myfonts.com/fonts/efscangraphic/today-sans-sb/ \"http://www.myfonts.com/fonts/efscangraphic/today-sans-sb/\")\n\nThe external design agency that foisted this upon us only recommended the Light and Medium variant, which is far too inflexible. First thing on Monday, I will also be purchasing the Regular set as well...\n\nThanks in advance to all advice.\n\n [‹ new portal with typographical resources](http://web.archive.org/web/20071019125434/http:/typophile.com/node/18533 \"Go to previous forum topic\") [TYPE BATTLE: Week 7 (6 March) ›](http://web.archive.org/web/20071019125434/http:/typophile.com/battle07 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071019125434/http://typophile.com/user/11941\" title=\"View user profile.\">x-height</a>",
  "time": "<br>",
  "uid": "11941",
  "comments": [
    {
      "time": " 11.Mar.2006 5.17am",
      "content": "[Cicero](http://web.archive.org/web/20071019125434/http:/www.myfonts.com/fonts/presencetypo/cicero/)  \n [Lucida](http://web.archive.org/web/20071019125434/http:/www.myfonts.com/fonts/urw/lucida/)  \n [Joanna](http://web.archive.org/web/20071019125434/http:/www.myfonts.com/fonts/linotype/joanna/)  \n [Dolly](http://web.archive.org/web/20071019125434/http:/vllg.com/Underware/Dolly/mudTyper+Weights/)  \nTim\n\n"
    },
    {
      "time": " 11.Mar.2006 9.27am",
      "content": "Thanks Tim.\n\nI especially like the look of Dolly after downloading a sample PDF from the foundry’s website and found an article about it here as well.\n\n[http://www.creativepro.com/story/feature/21831.html](http://web.archive.org/web/20071019125434/http:/www.creativepro.com/story/feature/21831.html \"http://www.creativepro.com/story/feature/21831.html\")\n\nI’ve put together some sample sheets of a couple of the others and will run them out in the office next week with some heads and subs in Today SB.\n\nIf anyone else has any suggestions, then they’d be most welcome.\n\n"
    },
    {
      "time": " 12.Mar.2006 3.06am",
      "content": "I have another question though for anyone who can offer advice or help.\n\nHow could I go about getting a sample sheet of Cicero?\n\nI can’t see any facility from Monotype to request a PDF, which is most irritating. I can’t consider purchasing a multi-licensed typeface on the basis of a screenshot alone... I can’t even seem to find a UK supplier that I can call. Our usual vendor (fontshop.co.uk) isn’t licensed to handle this face...\n\nI just need a 12 or more line setting of 10/12 over a 24-30 pica (approx 10-13cm) measure with some words picked out in the variants so I can get a feel for it.\n\nThanks in advance to anyone who can help with this.\n\n"
    },
    {
      "time": " 12.Mar.2006 11.41am",
      "content": "Alexandra,\n\nIf you’re looking for classic textface, you might concider Delicato or Anziano as an option.\n\nHave a look yourself at; [http://www.macrhino.com](http://web.archive.org/web/20071019125434/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\nI’ll be willing to help you out with pdf files if needed.\n\n"
    },
    {
      "time": " 12.Mar.2006 12.09pm",
      "content": "Thanks Stefan. I’ve downloaded some PDFs from your site and will take a look at them at the office sometime this week along with all the others...\n\n...except for Cicero which I just cannot find anywhere. Grrr.\n\n"
    },
    {
      "time": " 12.Mar.2006 3.03pm",
      "content": "Le Monde Sans\n\n[http://www.typofonderie.com/alphabets/use/LeMondeSans](http://web.archive.org/web/20071019125434/http:/www.typofonderie.com/alphabets/use/LeMondeSans \"http://www.typofonderie.com/alphabets/use/LeMondeSans\")\n\n"
    },
    {
      "time": " 14.Mar.2006 9.34am",
      "content": "You know what? The fact that you can’t obtain a sample easily should tell you something.\n\n"
    },
    {
      "time": " 14.Mar.2006 9.59am",
      "content": "^ You know what? Just say what you mean.\n\nIf you have nothing constructive to say, then why say it?\n\n"
    }
  ]
}
