{
  "id": "18463",
  "title": "Sofa italic: a more cosy typeface",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Dear Typophiles,\n\nAfter coming with [Sofa/Canapé/Divan](http://web.archive.org/web/20150416181203/http:/typophile.com/node/17136) rather far, I've started to work on an italic for it.\n\nThe plan was to create a normal italic, which is quite slanted with adaptions, and another one which is more like italics for Antiqua (i used the opentype swash-feature for it).\n\nSo I will have:\n\nUppercase normal + swash  \nlowerase normal + swash  \nmaybe smallcaps normal\n\nI've developed the first version from the roman one, first giving it a slant of 8°, and then finetuning it. I was not quite happy with that, so I made copies and created the swash-versions, which are much further away from the roman.\n\nI am quite happy with the swash-characters now: they need finetuning for sure, and I am happy about any comment which characters still appear to be \"roman\", or which one won't work.  \nMore problems exist with the \"normal\" version: I think this is too near to the roman yet. Which features of the swash-ones should I carry back to the normal one too?  \nYou can find an overview for this problem on page 3 in the pdf (red is indesign-slanted version of the roman, being there for comparison). On page one on the bottom, you can see both versions, on the left is the normal one, on the right the swashes.\n\nIs there a need for italic smallcaps?\n\nThanks again for your comments  \nSebilar\n\n**More members of this family**  \n [Sofa roman](http://web.archive.org/web/20150416181203/http:/typophile.com/node/17136)  \n [Sofa sans](http://web.archive.org/web/20150416181203/http:/typophile.com/node/18464)\n\n| Attachment | Size |\n| --- | --- |\n| [sofa italic7.pdf](http://web.archive.org/web/20150416181203/http:/typophile.com/files/sofa%20italic7.pdf) | 155.64 KB |\n\n",
  "author": "Sebastian Nagel",
  "time": "11 Mar 2006 — 11:47am",
  "uid": "5444",
  "comments": [

  ]
}
