{
  "id": "18478",
  "title": "I need Benton engraver cutting slips",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi Typophiles,\n\nIn my continuing quest for understanding of the optical scaling techniques implemented as “steam-powered computational geometry” by the Bentons in their engraving machine, I am now at the point where I would really benefit from having images of several more cutting slips.\n\nPlease see [the averaging thread](http://web.archive.org/web/20060526012942/http:/typophile.com/node/18179) for more details on how I’m doing my analyses. Thanks to Patricia Cost, I now have images of three cutting slips (one from her, one at the back of Practical Typecasting by Theo Rehak), and have been able to confirm and refine my inferences based solely on study of the printed samples. I’ve been able to decipher almost all of the notations on the cutting slip, as well. I’m very excited by these new developments and am now eager to write up a paper (possibly in collaboration with Patricia or others) describing the Benton optical scaling techniques in detail.\n\nBut my cutting slip evidence is still a bit fragmentary. The one at the back of Rehak’s book doesn’t seem to be for a mainstream ATF typeface, as the H height is way too big for its 36pt body size, so it’s hard to know for sure whether I can generalize from it. So, I am now sending out the call to the typophile community: can anyone help me get images of some more cutting slips? I am asking you to dig deep; to contact any typographic libraries or other collections of ATF artifacts, to ask your not so Internet-connected colleagues, etc.\n\nPatricia is already in contact with several people, including Theo and David Pankow. But apparently the ATF stuff got scattered to the winds around the time of the 1990 auction, so there are lots of places that might have them.\n\nI know I am asking for quite a lot of work here, but you will earn my undying gratitude, as well as the satisfaction of having contributed a major chunk to the scholarship of the remarkable technical and typographic legacy of the Bentons.\n\n",
  "author": "<a href=\"user/4406\" title=\"View user profile.\">raph</a>",
  "time": "<br>",
  "uid": "4406",
  "comments": [
    {
      "time": " 12 March, 2006 - 10:09pm",
      "content": "Raph, I recommend contacting Mike Parker and Tobias Frere-Jones. They did some digging around in the Smithsonian collection some years ago, and if I recall correctly they found some original Benton material that would be of interest to you. Alternatively, you could contact Stan Nelson at the Smithsonian directly.\n\n"
    },
    {
      "time": " 13 March, 2006 - 12:56am",
      "content": "John\n\nAs I recall Stan retired from the Smithsonian a while back.\n\nGerald\n\n"
    },
    {
      "time": " 13 March, 2006 - 6:44am",
      "content": "You might reach Stanley Nelson through the [Virginia Rare Book School](http://web.archive.org/web/20060526012942/http:/www.virginia.edu/oldbooks/faculty.shtml), where he teaches.\n\n"
    },
    {
      "time": " 13 March, 2006 - 1:15pm",
      "content": "Thanks all. I’ve sent an email to Barbara Heritage (excellent name!) of the Rare Book School, asking for contact info for Stan, and whether they might have anything in their collection. I’ll also try to get in touch with Mike and Tobias.\n\n"
    },
    {
      "time": " 27 March, 2006 - 7:06pm",
      "content": "Hi, Raph.\n\nI stumbled across your post and just wanted you to know that I haven’t gotten your email yet. Will you send it again? My email address at RBS is [barbara.heritage@virginia.edu](mailto:barbara.heritage@virginia.edu).\n\nBest,  \nBarbara\n\n"
    },
    {
      "time": " 27 March, 2006 - 9:59pm",
      "content": "Hi Barbara! I just sent it again, but meanwhile Patty Cost tells me she has gotten a complete set for one font from Theo Rehak. I’m really looking forward to receiving that so I can get into the detailed analysis.\n\n"
    },
    {
      "time": " 27 March, 2006 - 11:43pm",
      "content": "Ralf,\n\n“Cutting cards”—should have been called “punch re-cutting cards” or if you chose, “punch re-cutting slips”\n\nTheir primary purpose is positioning of line up—ex height, fit, stem, “ceriph” (not sick) etc. in the event that a “dupicate punch” was needed due to breakage.\n\n(Re-) Cutting Cards in every size with a complete set of patterns would be of some use. Remember that there would be more re—cutting cards than patterns. Remember artwork was the “artists intention” but patterns with punch cutting cards were the “masters”\n\nBut what were patterns and punch re-cutting cards, or /slips used for?\n\nCutting matrices”\n\nWhat were matrices for?\n\nCasting type!\n\nYou see the destination?\n\nThink “Times”, purchase a complete series of sizes, use high spaces or upside down type next to each character, ink very lightly, print lightly and there you have the information before you. Well, a generation away. In a perfect world you would have artwork, all re-cutting cards, all patterns, all punches and all sizes of type. Punches and type are duplications I suppose. Serious hands on metal type founding and punchcutting experience would be very good, or, to work with someone that understand the “Benton Pantograph”. I am a little busy or I would offer to help.\n\nI could probably send you a scan of a cutting card and you would see what I mean by positioning information. I am staring at one right now.\n\nThis note is not spell checked. I am writing without my reading glasses. Hopefully there is not to many typeos.\n\nI wish you all the best.\n\nGerald Giampa\n\n"
    },
    {
      "time": " 27 March, 2006 - 11:59pm",
      "content": "You like my pun?\n\nGerald Giampa\n\n"
    },
    {
      "time": " 28 March, 2006 - 9:55pm",
      "content": "Gerald,\n\nThanks for your input, and of course I would be most grateful for any scans or copies of cutting slips in your possession.\n\nI’m mostly doing book-larnin’ things now, because that comes most naturally to me. I hope to be able to take advantage of opportunities to get more hands-on experience with real metal type as they present, but for now I’m reasonably happy that my scholarship and analysis of digital scans is at least a useful contribution, if not a complete understanding.\n\nSo, you tell me, what hoops do I have to go through to get copies of your cutting slips, or is it pretty much a lost cause?\n\n"
    },
    {
      "time": " 28 March, 2006 - 10:53pm",
      "content": "Ralph,\n\nFrankly I am a stranger to this new, well, new to me, typophile forum format. How do you “post a scan” on this page?.\n\nI fear little can be learned from cutting cards alone. Side bearings husband the fit tables. Wedge choice dictate units rows, the two are married. I am not sure if you are conversant with the unit systems of Monotype, Linotype etc. Also, don’t be fooled, ATF had their own unit system that made casting more efficient. They claimed it made hand setting quicker which was true, but incidental. Monotype display casters used a unit system somewhat like the ATF system\n\nCutting cards and patterns froze the decision making. They do not contain previous human input, judgment and trial and error. Those would be recorded in the records themselves. The cutting cards encapsulate the final decision only. Also, although mathematics will be helpful in deciphering optical scaling you will find that human input is greater than you may have imagined. You will be looking at statistic population of coincidence to conclude any final theory.\n\nI am not trying to discourage you, I have proposed optical scaling for digital type for many years. I do have a suggestion for you however.\n\nThe English Monotype System is intact in London. Perhaps a trip is in order. They also have several people that are conversant with the Benton and optical scaling.\n\n“Think Times, Centaur”.\n\nGerald Giampa.\n\n"
    },
    {
      "time": " 29 March, 2006 - 6:25am",
      "content": "[http://www.typemuseum.org/contact.htm](http://web.archive.org/web/20060526012942/http:/www.typemuseum.org/contact.htm)\n\nI imagine Gerald is referring to here, they are only too keen to talk and had the patience to put up with me.  \nTim\n\n"
    },
    {
      "time": " 29 March, 2006 - 7:05am",
      "content": "Raph, you also have probably a very valuable resource in [The Museum of Printing](http://web.archive.org/web/20060526012942/http:/www.museumofprinting.org/), which is also a sponsor of TypeCon 2006. They received the Merganthaler Linotype materials, including tons, it seems, of drawings. I know people seem to be more interested in ATF and Monotype, but Linotype has very good stuff also, and a primary supplier to Newspapers would I suspect be particularly good on small sizes of type.\n\n"
    },
    {
      "time": " 29 March, 2006 - 9:07am",
      "content": "Hello, Gerald. Welcome back. Been out on your boat?\n\nYou must have the Flash Player 8 plug-in installed. Once installed you should see “Insert image” just below this box I’m currently entering my post. Seems some people have had to restart their system or browser to see it.\n\n"
    },
    {
      "time": " 31 March, 2006 - 9:56am",
      "content": "Tiffany,\n\nThank you for the advice. I will see if I have time this evening.\n\nRaph, sorry for spelling your name wrong.\n\nAlso I have worked with the Museum of Printing when they were still at the Rope Walk in Boston and later visited their museaum in Andover. It would be a good start. The drawing appeared to be in good order and well organized. For a complete job however I think I see a trip to London in your future.\n\nGerald Giampa  \nSorry for the quick note.\n\n"
    }
  ]
}
