{
  "id": "18476",
  "title": "Typography and Vision Problems",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does anyone have any good sources for Typography and Vision related problems? My THESIS is creating \"a designers guide\" to vision related problems. Specifically, Central/Peripheral blurriness. In the end I am creating a typeface for this. I am familiar with the AIGA article but I could use more help.\n\nThankyou,  \nPrakash Nair\n\n",
  "author": "Prakash Nair",
  "time": "12 Mar 2006 — 8:54am",
  "uid": "10437",
  "comments": [
    {
      "time": "12 Mar 2006 — 9:20am",
      "content": "What AIGA article - can you post a link?\n\nCheers, Si\n\n"
    },
    {
      "time": "12 Mar 2006 — 9:33am",
      "content": "Prakash,\n\nThere is mention of vision problems and package design in _Can packaging be honest?_ by Frank Philippin (with Indroductory text by Jeremy Myerson who was at the time of publication the co-director for socially inclusive design at the Royal College of Art, London, The Hamlyn Research centre) in _Baseline International Typographics Magazine Number 34, 2001_.\n\nIs this the AIGA article?  \n [http://clear.aiga.org/content.cfm?ContentAlias=%5Fgetfullarticle&aid=141...](http://web.archive.org/web/20131021224546/http:/clear.aiga.org/content.cfm?ContentAlias=%5Fgetfullarticle&aid=1415414 \"http://clear.aiga.org/content.cfm?ContentAlias=%5Fgetfullarticle&aid=1415414\")\n\nJon\n\n"
    },
    {
      "time": "12 Mar 2006 — 9:51am",
      "content": "Yep thats the article Ive read literally 8 times. But its not enough material to design a book about.\n\n"
    },
    {
      "time": "12 Mar 2006 — 10:10am",
      "content": "[In Sight: Guide to Design with Low Vision in Mind (Hardcover)](http://web.archive.org/web/20131021224546/http:/www.amazon.com/gp/product/2880466989/sr=8-2/qid=1142186890/ref=sr_1_2/103-0167061-0754222?%5Fencoding=UTF8) I always see this book at the borders down the street. It has florescent yellow pages.\n\n"
    },
    {
      "time": "12 Mar 2006 — 10:29am",
      "content": "Jackson  \nHeaded out now to check it out. Apparently Andrew Sliwinski did something similar with Dyslexia and I assume there are going to be some parralels in both of our research....although I must admit this is more than a semester long project.\n\n"
    },
    {
      "time": "12 Mar 2006 — 10:56am",
      "content": "Prakash Nair, as I commented on the AIGA article, my Italian colleague Luciano Perondi is working on the subject, he founded a research team - [http://progetto-exp.org](http://web.archive.org/web/20131021224546/http:/progetto-exp.org/ \"http://progetto-exp.org\") - you might find useful to contact him.\n\n"
    },
    {
      "time": "12 Mar 2006 — 12:08pm",
      "content": "Yes Ive tried contacting him before without any sucess. I believe it was a gmail account.\n\n"
    },
    {
      "time": "18 Mar 2007 — 8:24am",
      "content": "Hi Prakash,  \nI hope you found the info you needed. This project got quite complex to be honest, and I ended up conducting sample research at local elementary schools in the Detroit area in order to get sufficient data. If you would like, I can send you copies of any of the research I compiled.\n\nThe first round of the project lasted about 10 months, and I have recently picked it back up again. For round two, I am focusing on kinesthetic feedback rather than typography however.\n\n"
    },
    {
      "time": "18 Mar 2007 — 12:07pm",
      "content": "btw... this is Andrew Sliwinski.\n\n"
    },
    {
      "time": "18 Mar 2007 — 1:56pm",
      "content": "I just did some research on low vision. Check out the nation blind organisations like CNIB (canada) RNIB (uk). the canadian site offers a 'clear print guide' with some results from their research. Verdana, is the way to go acording to them.\n\n"
    },
    {
      "time": "18 Mar 2007 — 2:36pm",
      "content": "_Verdana, is the way to go acording to them._\n\nThey don't discount serifed type either.\n\n_I am creating a typeface for this._\n\nWhile on principle I wouldn't want to discourage novices from designing type for the reading-challenged (two words: Louis Braille), I don't believe that their efforts will be any better than any standard typeface by an experienced designer, in fact, much less effective.\n\nSure, it's great that some publishers are using such types, but it says more about committment and empowerment than pure functionality.\n\nFrom both a scientific and design process standpoint, it would make more sense to analyze exisiting typefaces for their suitability for the reading-challenged, and then base one's typeface design on that knowledge, rather than working from abstract principles such as \"disambiguation of shapes\".\n\n"
    }
  ]
}
