{
  "id": "18484",
  "title": "Wedding Invites crit",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hi Typophiles\n\nI posted a thread before about some letterpress inspiration for my wedding invites. Here I am with this thing again but this time I’m posting a sample of the invite. I’m struggling a lot with this one and changed my typefaces quite a lot.  \nI first started buying “Emily” from t26 because I liked the look of that font but when I put it together it didn’t really pair well with other typefaces. So I moved on to traditional scripts like Brickhamm and others but I’ve seen this face used in so many invites (not that it’s a bad thing) but I wanted something a bit different.  \nThe reason why I went with what I have is because I was looking for a meaning to all of this and find out that this day in which the wedding is taken (20th) in relation to the 20th day of every month in the Aztec calendar was “xochitl” which stands for flower and its supposed to be good for spiritual related things. So I did my research on Aztec flowers and find a book called “Ancient Mexican Designs” that has a lot of this “xochitl” flowers.  \nAnyway not to go any deeper I really didn’t wanted to be so nationalist with this project so I made my own designs based on the flowers I saw and created my own calligraphy to give it a more human touch.  \nInitially I wanted to have flowers cropping off the edges but was just too crowded. Our parent names have also been a pain since I can’t get away from setting them one next to the other. I also tried justifying text to the left and also different alignments but it’s just being crazy. So to fit all this text I went with small caps spaced out and justified text. The text face is FF Clifford, I’ve also played around with Filosofia and Mrs. Eaves.\n\nThis is of course going to be letterpressed\n\nAny crit would be gladly accepted and hope you all have fun doing it.\n\nThanks,\n\nkco\n\n| Attachment | Size |\n| --- | --- |\n| [type\\_expl.jpg](http://web.archive.org/web/20130516104343/http:/typophile.com/files/type_expl.jpg) | 262.09 KB |\n| [InviteA.jpg](http://web.archive.org/web/20130516104343/http:/typophile.com/files/InviteA.jpg) | 176.22 KB |\n| [InviteB.jpg](http://web.archive.org/web/20130516104343/http:/typophile.com/files/InviteB.jpg) | 182.41 KB |\n| [InviteC.jpg](http://web.archive.org/web/20130516104343/http:/typophile.com/files/InviteC.jpg) | 175.73 KB |\n\n",
  "author": "kco",
  "time": "13 Mar 2006 — 1:30am",
  "uid": "8116",
  "comments": [
    {
      "time": "13 Mar 2006 — 4:00am",
      "content": "Looks good.  \nWhy do you post a jpeg with no compression ?\n\n"
    },
    {
      "time": "13 Mar 2006 — 5:51am",
      "content": "Typographically, the face choice is nice. But to make it really awesome use a more humanistic means. Is one shy than the other? Taller? Use this kind of expression in your calligraphy. They both dont have to be the same.  \nNot a fan of the rest of the txt. Needs a lot of composition works. Your hierarchy is off. You need to work with scale more but keep it subtle because its still a formal subject. I would lose the ALL CAPS. To me thats very annoying for a body copy. Change your page format too from the standard 8.5x11-ish look. Experiment a bit more with the way a page opens and information is read. Do you have to repeat \"AA\" again at the top?  \nAnd I dont think the vectorized flower is doing anything for me, scale wise (very robotic looking flower). Scale that down and try hand-drawing it in as supposed to a digital medium. Colors are nice.\n\n"
    },
    {
      "time": "13 Mar 2006 — 6:06am",
      "content": "i can't see the attachment...\n\n"
    },
    {
      "time": "13 Mar 2006 — 6:35am",
      "content": "you have to right click and \"save link as.\" Then open it in desktop.\n\n"
    },
    {
      "time": "13 Mar 2006 — 10:32am",
      "content": "Sorry about the uncompressed jpeg, it was late last night. I posted a new jpg and I'll keep working on it. Thanks for all the comments I will post the changes asoon as I get them done.\n\n"
    },
    {
      "time": "13 Mar 2006 — 5:44pm",
      "content": "Ok i can see it now (sorry i am a bit of a novice) Wow Prakash, you are ANALITICAL, although i could see some of the things you said I didn't realize the other ones that were bothering me until you mentioned them. This is why stalking this forum is so good, you always learn something.\n\nCaco, about the invite, I like the colours, and i have to agree with most all of what Prakash said. Maybe you could lose the flower detail altogether or leave them with very little colour, as if they were a watermark... The double As on the right upper corner could go as well. I think that you need to de-clutter the invite a bit, to me is asking for more negative (white) space all around. If you look at the invite in terms of space is not equilibrated, too much weight on the bottom...  \nHope this helps,  \nand sorry for my crappy english :)\n\n"
    },
    {
      "time": "14 Mar 2006 — 4:17am",
      "content": "Ok Typophiles, I completely agree with your critique and thanks Prakash for being so honest, I like that. I think I ‘m frightened when beginning to design for myself and don’t even see what’s wrong on it, plus I was pushing the flower thing too far.  \nSo on my next attempt I realize it was too hard to match my own calligraphy with another typeface. On the type exploration I picked from top to bottom “FF Clifford” (same as previous comp, “Origami MT” and “Vendeta”. The last two have a bit more humanistic side but still don’t think quite did it for me. I really don’t want this to look too classic so I went back to the typefaces I had before; Mrs Eaves, Filosofia, Sloop and Brickham.  \nI gave it a lot more negative space and since I have to use both of our parents full names (yes two last names) and even the priest name, I decided to go horizontal. All this names and addresses made this so text heavy as opposed to some invites I’ve seen in the States but I think the horizontal helped.  \nAnother thing is a loosed the bold flower and just kept the more simple one, it seems to distract less but still maintains the little meaning I found on it.  \nHope you guys are having as much fun as I am, and I will surely post pictures of the final printed piece for all of those who helped.  \nLet’s keep this critique going!\n\nThanks all\n\n"
    },
    {
      "time": "14 Mar 2006 — 6:24am",
      "content": "The more formal script of version C seems to work better with the informal illustrations, the justified copy needs some work on it the first line is very loose, you could bring the date back up by reducing the point size or increase the measure, leaving the month on line 2\\*, this might bring the whole church name back on to line 2, This will leave line 3 really loose so you could make that left aligned and leave line 4 a separate line. There is no fullstop on line 4 and there is colon before the names which doesn't seem required. I might look at raising the y in the names a touch. Finally I would check the lightness of the blue in print, chocolate and blue make a good pallette though. I hope I have read the Spanish correctly.  \nTim  \n\\* alternatively you could look at pulling the whole date to the left of the lefthand margin.\n\n"
    },
    {
      "time": "14 Mar 2006 — 9:55pm",
      "content": "Hi again Typophiles!  \nThanks Tim for the very detailed critique, I’m working on those details now.  \nWell to all I guess I’m a little uncomfortable using Mrs. Eaves, I really like it but I’ve always thought this has been over used and so I tried to avoid it every time I could although for this one it seems to fit, It’s classic but there’s a twist to the characters with unusual shapes. It seems to make good contrast with the illustrations as well as making it look modern as opposed to the ancient humanist part in the Aztec side which was really not were I wanted to take this. Just to reiterate I based the idea on the meaning of the day and the interesting meanings I found in that mythology.  \nSo if anybody has another typeface recommendation I will take a deep look into it. Also notice the two ligatures I was able to sneak in this piece. That made me happy =).\n\nThanks again and I’ll keep working.\n\n"
    },
    {
      "time": "21 Mar 2006 — 11:08am",
      "content": "Resist the urge to add a lot of extra leading to your blocks of copy. Although this may seem \"designy\" it actually erodes legibility by introducing, what I call, \"rivers\" of white space between the lines of copy. This visually breaks your blocks of copy into stripes, a highly graphic approach that seems out of place in an invitation. Remember this is an invitation, and I assume you would want the type to be inviting. The effect becomes worse when you set body copy in ALL CAPS because due to its visual regularity.\n\nI might try tightening up the leading a bit overall and remove the All Caps from your body copy.\n\nOtherwise, I like your color choices. Should be very nice letterpressed.\n\nMB\n\n"
    }
  ]
}
