{
  "id": "18486",
  "title": "Cry of sorrow from your Polish fellow",
  "forum": "Design",
  "tags": [

  ],
  "content": "Welcome Typophiles,\n\nI am so devastated and it seems that no one understands me, perhaps you could provide me some sort of moral backup… Recently I designed a hardcover book for a major Polish publishing house; the design was rather ascetic. Its crucial feature was the size of white margins around a photo used on the cover: the margins are narrow (4 mm) and should be as equal as possible. You can see the idea in first attachment. Second attachment shows the result - I have just received the printed and binded book: margins are anything but equal, whole balance of the design is lost. Gosh, I haven’t been that disappointed in ages.\n\nDo you have similar problems in your countries? Can you design with confidence that your ideas that require extreme precision won’t be spoiled? Or maybe I expect too much?\n\nI would welcome any comments.\n\nPrzemek Debowski\n\n| Attachment | Size |\n| --- | --- |\n| [weiser\\_ok.jpg](http://web.archive.org/web/20060329185349/http:/typophile.com/files/weiser_ok.jpg) | 13.31 KB |\n| [weiser\\_wrong.jpg](http://web.archive.org/web/20060329185349/http:/typophile.com/files/weiser_wrong.jpg) | 13.25 KB |\n\n",
  "author": "Przemek Debowski",
  "time": "13 March, 2006 - 5:28am",
  "uid": "11968",
  "comments": [
    {
      "time": " 13 March, 2006 - 6:13am",
      "content": "It depends upon the printing firm you are using and your relationship with them. Be sure to describe crucial issues and inspect the job on press. Like most things, you get good results from good craftsman but you must be sure they know your intentions.\n\nChrisL\n\n"
    },
    {
      "time": " 13 March, 2006 - 7:28am",
      "content": "And the issue might be at the bindery, not the printer…\n\n"
    },
    {
      "time": " 13 March, 2006 - 10:27am",
      "content": "What they said, but also … I’ve learned to design around certain limitations (read: human error).\n\n"
    },
    {
      "time": " 13 March, 2006 - 12:13pm",
      "content": "I suspect this kind of thing happens all the time, everywhere.  \nThe following advice is based on my experience as a freelance, designing book covers for publishers in Canada.  \nTo guard against cock-ups, you have to embed yourself into the workflow at key points.  \nThese are:\n\n1. Signing off on proofs. The publisher’s in-house art department has the ability to mess around with your artwork, so you have to state up-front that you want to OK the final proofs, before they go to the printer. Put it in your contract that this is included in services rendered. Otherwise a publisher will not bother asking you to check small changes, because your time is valuable, and they think so highly of you.  \nIdeally, the final proof should be a mocked-up cover, on a dummy (provided to the publisher from the bindery, via the printer), so that if the finished piece is wrong, the publisher (who is paying the bills) will be able to wave it at the printer and say “but this is what I signed off on, please do it again and get it right.”\n\n2. Press Approval. This will of course be scheduled for 4 a.m. to discourage you from showing up and creating a nuisance. At the approval, don’t give a hasty approval. Think about it, make them wait.\n\n"
    },
    {
      "time": " 13 March, 2006 - 12:24pm",
      "content": "Almost certainly the finishers, but don’t worry they will find some way to blame the artwork.  \nI always send a full mock-up to the printers and have them approve the artwork before they run anything.  \nNot much consolation but you have gained an experience.  \nTim\n\n"
    },
    {
      "time": " 13 March, 2006 - 3:39pm",
      "content": "Who knows, maybe one day you will marry Maria, the daughter of the director : )\n\n"
    }
  ]
}
