{
  "id": "18494",
  "title": "Dalton Maag Infoletter March out",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "1) Tottenham Hotspur rule OK!\n\nThe new identity of the London football club Tottenham Hotspur was  \nrecently unveiled. As part of the identity update the cockerel was redrawn  \nand a display typeface designed by Dalton Maag.\n\nMore: [http://www.daltonmaag.com/news/35.html#s1](http://web.archive.org/web/20131014115719/http:/www.daltonmaag.com/news/35.html#s1 \"http://www.daltonmaag.com/news/35.html#s1\")\n\n1) Die Tottenham Hotspur kommen!\n\nDie neue Identität des Londoner Fussballclubs Tottenham Hotspur wurde  \nkürzlich vorgestellt. Als Teil des neuen Aufrittes wurde auch der Gockel  \nim Logo neu gestaltet; die Display-Schrift wurde dabei von Dalton Maag  \ngezeichnet.\n\nMehr: [http://www.daltonmaag.com/news/35.html#s1](http://web.archive.org/web/20131014115719/http:/www.daltonmaag.com/news/35.html#s1 \"http://www.daltonmaag.com/news/35.html#s1\")\n\n2) Möbel Pfister becomes Pfister\n\nYou may have been quite surprised by some full-page adverts in Swiss daily  \nnewspapers: the well established and traditional Möbelhaus Pfister has  \ncreated some impact with its new look. The new visual identity was  \ndeveloped by Külling & Partner, Zurich.\n\nMore: [http://www.daltonmaag.com/news/35.html#s2](http://web.archive.org/web/20131014115719/http:/www.daltonmaag.com/news/35.html#s2 \"http://www.daltonmaag.com/news/35.html#s2\")\n\n2) Möbel Pfister wird Pfister\n\nWer in den vergangenen Wochen die ganzseitigen Anzeigen in den Schweizer  \nTageszeitungen beachtete, kam aus dem Staunen nicht mehr heraus: Das  \naltehrwürdige Möbelhaus Pfister setzte sich wirkungsvoll mit seinem neuen  \nOutfit in Szene. Die neue Identity wurde von Külling & Partner, Zürich,  \nerarbeitet. Was aber alles dazu gehört, ein Unternehmen wie Pfister  \n(bleiben wir beim neuen Namen) zu einem neuen Gewand zu führen, das lässt  \nsich nur erahnen.\n\nMehr: [http://www.daltonmaag.com/news/35.html#s2](http://web.archive.org/web/20131014115719/http:/www.daltonmaag.com/news/35.html#s2 \"http://www.daltonmaag.com/news/35.html#s2\")\n\n3) Dalton Maag font updates\n\nDalton Maag is updating its font library with new standard character sets,  \nfonts and typefaces. Co, Plume, Royalty and Fargo are the first to be  \nupdated and are available as of now. Customers who have already purchased  \nCo will be eligible for a free update of the fonts.\n\nMore: [http://www.daltonmaag.com/news/35.html#s3](http://web.archive.org/web/20131014115719/http:/www.daltonmaag.com/news/35.html#s3 \"http://www.daltonmaag.com/news/35.html#s3\")\n\n3) Font Updates von Dalton Maag\n\nDalton Maag ist zur Zeit daran, die gesamte Bibliothek der Schriften mit  \nneuen Standards auszurüsten. Co, Plume, Royalty und Fargo sind die ersten  \nzur Verfügung stehenden Updates. Kunden, welche Co bereits besitzen,  \nwerden mit einem Gratis-Update ausgerüstet.\n\nMehr: [http://www.daltonmaag.com/news/35.html#s3](http://web.archive.org/web/20131014115719/http:/www.daltonmaag.com/news/35.html#s3 \"http://www.daltonmaag.com/news/35.html#s3\")\n\n",
  "author": "bruno_maag",
  "time": "13 Mar 2006 — 6:33am",
  "uid": "3194",
  "comments": [
    {
      "time": "13 Mar 2006 — 6:55am",
      "content": "They still suck! Come on West Ham! Down with Spurs!\n\nGraham\n\n"
    },
    {
      "time": "13 Mar 2006 — 8:21am",
      "content": "I don't care. I support the Palace!\n\nBruno\n\n"
    },
    {
      "time": "13 Mar 2006 — 8:55am",
      "content": "As I recall Vinnie is a Spurs fan - was this a factor in getting the job?\n\nCheers, Si\n\n"
    },
    {
      "time": "13 Mar 2006 — 11:43am",
      "content": "As ATypI Country delegate for the USA I've rewritten the announcement for the American audience...\n\n**Spurs scores with DM font**  \n_London, SW9 - 13 March 2006_  \nVincent Connare's favorite English pro-league soccer franchise Tottenham Hotspur have just unveiled a redrawn rooster and custom font designed by chirpy Londoners Dalton Maag. Lets hope this 'spurs' them on to gold in this year's world cup! More details...\n\n[http://www.microsoft.com/typography/links/news.aspx?NID=5476](http://web.archive.org/web/20131014115719/http:/www.microsoft.com/typography/links/news.aspx?NID=5476 \"http://www.microsoft.com/typography/links/news.aspx?NID=5476\")\n\n"
    },
    {
      "time": "14 Mar 2006 — 7:28am",
      "content": "Hi sii,\n\nthanks for that. Sounds good. Yes, Vinnie is a Spurs supporter.  \nNote that Dalton Maag also designed the fonts that are on the Puma kits of the Italian away kit, and will probably find more exposure during the world cup.\n\nSpeaking of which, I'll be going to see Italy vs USA on the 17. June. :)\n\nBruno Maag  \nDalton Maag Ltd\n\n"
    },
    {
      "time": "14 Mar 2006 — 8:08am",
      "content": "Cool, I'll add a note. Hopefully the Italy fonts will be better recieved than some of the Nike kit fonts.\n\n\\> I’ll be going to see Italy vs USA on the 17. June. :)\n\nWho will you be cheering for? ;-)\n\nSi\n\n"
    },
    {
      "time": "16 Mar 2006 — 12:35am",
      "content": "Not sure yet. Depends who the crowd are around me. :-)  \nI'll probably end up making crass remarks about both teams, antagonising everyone in the stadium.\n\nBruno Maag  \nDalton Maag Ltd\n\n"
    },
    {
      "time": "16 Mar 2006 — 12:42am",
      "content": "_Italy vs USA on the 17. June_\n\nThe Americans are going to whomp some major Italian aß.\n\n"
    },
    {
      "time": "24 Mar 2006 — 6:05am",
      "content": "you can change your country but you can't change your team! Gummmon you Spurs!!!\n\nItalia Italia Italia, Azzurri!!!!!  \n(is that the kind of team the USA is going to bring to Germany? the one that showed up in Dortmund?, best of luck).\n\n"
    }
  ]
}
