{
  "id": "1849",
  "title": "BASE GEOMETRIC SANS-SERIF",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "The principle of this type is the geometric forms and combinations. And the inpiration are from constructivism typography style. Injoy the little sample to take an idea.\n\n",
  "author": "ricardo",
  "time": "1 Jun 2001 — 7:49pm",
  "uid": "1180",
  "comments": [
    {
      "time": "2 Jun 2001 — 1:58pm",
      "content": "Ricardo, your sample isn't showing up... Care to try again?   \n   \nSee the instructions to the left, under \"GIF / JPG\"   \n   \n//joe\n\n"
    },
    {
      "time": "3 Jun 2001 — 5:43pm",
      "content": "I started to devolopment this font by three years ago, I continue to adjust and finnished   \nthis work, I m correcting the mistakes and lear about it. The principle of this type is the geometric forms and combinations. The inspiration are from the constructivism typography. This kind of source are very common and don't have creative interest but I designed to the challenge of the work and to used in some works.GIF / JPG:   \n ![Text Description](http://web.archive.org/web/20150416040140im_/http:/www.typophile.com/forums/messages/29/197.jpg)\n\n"
    },
    {
      "time": "3 Jun 2001 — 9:47pm",
      "content": "Ricardo,   \n   \nThe face has the essence of a digital clock, which makes it somewhat unique among similar faces. (I'm especially referring to the B, K and X.)   \n   \nSome of the symbols look awkward. The @ seems unnaturally forced and the greater-than and less-than don't really carry the essence of the face.   \n   \nNice work. I like that asterisk the best...   \n   \n//joe\n\n"
    },
    {
      "time": "3 Jun 2001 — 9:58pm",
      "content": "Ricardo,   \n   \nJoe is right about the @. Perhaps it doesn't work   \nbecause the tiny triangles are a shape that isn't   \nfound anywhere else in the font. Why not keep the   \nsymbol squarish to maintain consistency?   \n   \nWhile it's another LCD-digital-clock-calculator   \nface, I think it's one that hasn't been done   \nbefore. I thought the genre had been thoroughly   \nsaturated, but you've managed to come up with   \nsomething new and appealing. Congrats.\n\n"
    },
    {
      "time": "5 Jun 2001 — 11:03am",
      "content": "I really like the sheared corners. It adds a unique twist to all the blockish faces we've seen in the past little while.   \n   \nI have a few suggestions.   \n   \nI would revisit the BKR and X. I think that there are some other solutions to these that would push it closer to the constructivist influence and further from the lcd influence. Maybe you could try dropping in a few diagonals. I like the direction you've taken with the lc v, for example (the angle on the uc V is a little steep, I think). The S looks a little blocky. Maybe it could be a bit narrower. The shoulder on the f seems a little clunky, and could be shortened as well as the tail on the j. You could also do the same with the tails of the g and the y if you wanted to, but it isn't really necessary. The uc Q could also use a different quill.   \n   \nGood luck.   \n   \ncr   \n   \nps. the lc a is rad.\n\n"
    },
    {
      "time": "2 Jun 2001 — 6:45pm",
      "content": "Ricardo sent this image to me - I think he was having a problem posting the image.   \n   \n ![ricardo](http://web.archive.org/web/20150416040140im_/http:/www.typophile.com/forums/messages/29/196.jpg)\n\n"
    }
  ]
}
