{
  "id": "18502",
  "title": "Typeface design question",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everyone,  \nI'm a Graphic Design student, and i've always loved type. From time to time, I've tried creating my own typefaces on paper. Problem is, i'll create a few letterforms and then when I try to expand beyond that, the letters start to lose their resemblance to my original idea. So I guess my question would be...what's a good letter to start with? I usually start with a lowercase A, but is there a better starting point to help maintain consistancy among the letterforms? I browse free font sites a lot, and see a lot of HORRIBLY designed fonts, and I would rather produce something a professional designer might actually use. Also, any general tips or books I should pick up would be great as well.  \nThank you all,  \nEric\n\n",
  "author": "<a href=\"/web/20110226084843/http://typophile.com/user/11876\" title=\"View user profile.\">erictastic</a>",
  "time": "<br>",
  "uid": "11876",
  "comments": [
    {
      "time": "",
      "content": "wiki is your friend... [http://typophile.com/wiki/Drawing\\_How-To](http://web.archive.org/web/20110226084843/http:/typophile.com/wiki/Drawing_How-To \"http://typophile.com/wiki/Drawing\\_How-To\")\n\n"
    },
    {
      "time": "",
      "content": "I'm not a designer, but I can report what the big guns start with, according to the New Yorker profile on Matthew Carter from December.\n\nAccording to Tobias Frere-Jones, the \"classic approach\" is to begin with H and O, then R.\n\nCarter likes to start with h and o, then p and d, then maybe v.\n\nThe article goes into a bit more detail about why those strike the designers as good places to start. I recommend it.\n\n"
    },
    {
      "time": "",
      "content": "Books you might look into are: [Letters of Credit](http://web.archive.org/web/20110226084843/http:/www.amazon.com/gp/product/1567922406/sr=8-1/qid=1142274800/ref=pd_bbs_1/103-8312350-7795814?%5Fencoding=UTF8) and [Anatomy Of A Typeface](http://web.archive.org/web/20110226084843/http:/www.amazon.com/gp/product/0879233338/qid=1142274852/sr=2-1/ref=pd_bbs_b_2_1/103-8312350-7795814?s=books&v=glance&n=283155)\n\n"
    },
    {
      "time": "",
      "content": "Eric,  \nThere is no magic way. It just takes a great deal of time and effort. If it is a labor of love for you, then you will push through it all and end up with a type you approve of.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Don't forget purpose! I don't hear the end of that ! ( cough cough )\n\n"
    },
    {
      "time": "",
      "content": "_Books you might look into are: Letters of Credit and Anatomy Of A Typeface_\n\n...and [The Bible](http://web.archive.org/web/20110226084843/http:/typophile.com/wiki/Logo_font_and_lettering_bible)\n\n"
    },
    {
      "time": "",
      "content": "I like to start with the letters that inspire me the most, and that got me started thinking of the design in the first place. Often that is R or a for some reason. Font building-wise, i think o, i, p, v (in that order) is a good start and then the same for uppercase.\n\n"
    },
    {
      "time": "",
      "content": "Good call Paul...for some reason The Bible didn't catch that thought train.\n\n"
    },
    {
      "time": "",
      "content": "I'm going to sound like a total dick for saying so, but only a complete novice would draw the alphabet in order: abcdefgh etc.\n\nIt's one thing to draw a typeface on paper, and quite another to draw a typeface in software. Personally, when I'm drawing a typeface on paper, the letters come out in no order, and I don't direct them; one thing leasds to another. For giggles, here's what I have drawn in my sketchbook. (Each line is a different page):  \nknitsse / efagior / EDL / n  \nANSWER / WW  \nFJ / MMN / ZZ WVY / FFFZFJ / TZ  \n245011 / 786 ENC / E 3 q 6  \n2 21 / 5 4 478 / 8336  \nverygaaa / V V U A B / D R P Q S / X S T  \n01233445 / 222229 / 97778 / 88614  \nk kentis / ornacri / koikiva  \nvillage / ubibir / r rare  \naf affluent / f azimxu / yungli\n\nMakes no sense, of course\n\nWhen drawing letterforms in FontLab or FreeHand, the n and o are starting points. From there you're led to make h, l, r, u, and m, as well as p, d, b, q... Things lead to other things which suggest still other things.\n\nI'd be curious to know how many people drawn randomly versus those who have a plan of attack...\n\n"
    },
    {
      "time": "",
      "content": "_the letters start to lose their resemblance to my original idea_\n\nI hate to say it but, if that's the case, you probably didn't have a very clear idea to begin with. Well-designed typefaces generally follow well-defined rules. Try to determine what those rules are, and the rest comes pretty easily.\n\n"
    },
    {
      "time": "",
      "content": "Wow, thanks for your input everyone. I definitely will take all the advice given into consideration. My father was a sign painter in the days before vinyl, and he instilled in me a love for letters. As far as you guys \"sounding rude,\" I actually prefer a blunt, no-BS approach to answering my questions. Especially from people who know leaps and bounds more than I do. Thank you all!  \n-Eric\n\n"
    },
    {
      "time": "",
      "content": "\\> you probably didn’t have a very clear idea to begin with\n\nMaybe, but there's also the paradox that <cite>things change</cite> when you go from certain modes of drawing/painting/whatever to digital outlines. The severe exactitude of the latter (in constrast to the interpretation-inviting fuzziness of the former) typically imparts a particular -and often unexpected- flavor to the results. And lack of experience with this can lead to a sense of confusion concerning \"what happened?\" and \"how do I fix this?\"\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "[http://www.typophile.com/node/6319](http://web.archive.org/web/20110226084843/http:/www.typophile.com/node/6319 \"http://www.typophile.com/node/6319\")\n\n"
    },
    {
      "time": "",
      "content": "[http://www.typophile.com/node/4822](http://web.archive.org/web/20110226084843/http:/www.typophile.com/node/4822 \"http://www.typophile.com/node/4822\")\n\n[http://www.typophile.com/node/5833](http://web.archive.org/web/20110226084843/http:/www.typophile.com/node/5833 \"http://www.typophile.com/node/5833\")\n\n"
    },
    {
      "time": "",
      "content": "_only a complete novice would draw the alphabet in order_\n\nWell, that's how I've always worked!\n\n"
    },
    {
      "time": "",
      "content": "\\> Well, that’s how I’ve always worked!\n\nThat supports part of Chester's argument - even you were a novice at one time. ;-) What may be of interest is why you didn't change your practices over the years?\n\n"
    },
    {
      "time": "",
      "content": "_things change when you go from certain modes of drawing/painting/whatever to digital outlines. The severe exactitude of the latter (in constrast to the interpretation-inviting fuzziness of the former) typically imparts a particular -and often unexpected- flavor to the results_.\n\nThis is true; however, since our inquisitor in this forum is a design **student** , I presume that he (again, I presume) may never have had the opportunity, which was actually a _necessity_ for those of us who began our careers in the pre-digital days, of actually working with pens, pencils, drafting tools and the like.\n\n_only a complete novice would draw the alphabet in order_\n\nMaybe, maybe not; on the other hand, perhaps only a complete fool would believe that there's a certain magic formula which must be followed to ensure font success. Back in ye olden days when I was doing only freeware fonts, I took notice of the words of Ray Larabie, who--at the time--was the king (or at least the most prolific) of the freeware fontmakers. His particular formula was to start with the lowercase h; from there, saith The Ray, all other letters flowed. However, when I attempted to follow this sage advice, it seemed to me that the only things that flowed naturally were m, n and, occasionally, r. So maybe I'm a dope, but the Larabie method didn't work for me. More often than not, what **does** seem to work for me is to begin with the uppercase I, especially if it's a serif face: once I nail it, the same basic form can be used on 20 other letters--a slightly better payoff than two or three. But that's just me...\n\nIf Nick Shinn's A-to-Z method works for him, then his method is beyond reproach. So, yes, Chester: you **are** a total dick for assuming your way is the only way, as are the Mac users who assume that their OS is the only OS, as are the PC users who assume that their OS is the only OS, and so on. In terms of how one chooses to tackle a project, the best approach FOR YOU is the one that works FOR YOU. After all, we're talking typography here, not religion...\n\n"
    },
    {
      "time": "",
      "content": "Oldnick, there's \"works\", then there's \"improvement\".  \nEverybody can learn a better way to do something at  \nany point in their life.\n\nAs for the student angle, you'd be surprised how heavy the  \nLuddite population is among typical design school faculty.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I kinda thought Nick was joking about a to z order?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Typography is a religion! One of dedication to the stewardship of typographic language and its legacy.\n\n"
    },
    {
      "time": "",
      "content": "I usually get any visual input (be it an other font, graphics design, some scribbles, architecture, etc.), and this is my starting point.\n\nThis input also decides which letter i draw first (on paper yet). The scribbling is terrible, not to be comparable to other scribblings I see here on typophile sometimes. I try some other characters, rather randomly, but they usually are lowercase (about 10). I try to get every stylistic element in the draft, like stems, bowls, slants, etc., but I'm not too consequent. This phase is for developing the idea, so there can be different styles yet. I do not draw a \"final\" draft on paper, but start doing this on the computer.  \nThere, i start with the character i'm in the mood for, but this often ends in the dilemma that I need another character first, because it influences the character I'd like to start with. So this is a continuous change of \"i want to\" and \"i have to do first\". Usually it ends up in doing \"n\", \"o\", \"H\", \"A\" as leading characters, and there, it is pretty much where the \"final\" style is determined.  \nThen I do a-z and A-Z rather fast (2 days or so?), and then start the long long long balancing process. The problem then is, that I start to be keen on ligatures. I draw them too early and have to revise them about 100.000 times :)  \nIf I've had enough of the design part, I start creating diacritics or do some opentype-coding...\n\nThis are the observations of a typedesign beginner still learning (3 fonts so far, none finished completely), but I think this is much more effective than the method I started with (a-z, A-Z from scratch). The problem there is, that you have the atypical characters first (a, e, g), which are difficult to derive a common style from.\n\nsebilar\n\n"
    },
    {
      "time": "",
      "content": "_Everybody can learn a better way to do something at  \nany point in their life_\n\nAbsolutely agreed: evolve or die, especially in the field of graphic arts. My point, however, was that for anyone to tout his or her approach as the best--or only--way to do something smacks of naïveté and/or hubris.\n\n"
    },
    {
      "time": "",
      "content": "Wow, again, thanks guys. It's finals week at school, so hopefully i'll get the chance to pick up a pencil ( I don't think a computer should EVER be the first step in the design process, unlike some of my classmates) and rough out a design. I'll be sure and let you guys have a time-lapse peek at my work as I complete it, and you'll hopefully have some equally good advice for me then. I'm so glad you're all friendly, and not so egotistical (though you have every right to be) that you insult my questions or give sarcastic responses. Thank you.\n\n"
    },
    {
      "time": "",
      "content": "\\> I don’t think a computer should EVER be the first step in the design process\n\nSome of the world's best type designers work directly on the computer.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "On the pencil vs. computer: I do it both ways, sometimes more of one than the other. Each has its advantages, but it's the artist's eye not the tool that makes the letters.\n\n"
    },
    {
      "time": "",
      "content": "For some reason I find that when I do things straight on the computer the quality just isn't there. For me atleast, when it comes manipulating letterforms, the computer allows you to experiment to much without planning ahead. Because doing them by had takes time and effort, your more likely to think about it more thoroughly, and it also gives a better reference and allows you to develop a more robust style. Personally, the first letter I try is usually the lower-case \"a\" because it combines so many elements and quirks of the final face, I think it is a strong indicator of what the rest of the alphabet will be like.\n\nMaybe I'm overthinking it!\n\n"
    },
    {
      "time": "",
      "content": "For some reason I find that when I do things straight on the computer the quality just isn't there. For me atleast, when it comes manipulating letterforms, the computer allows you to experiment to much without planning ahead. Because doing them by had takes time and effort, your more likely to think about it more thoroughly, and it also gives a better reference and allows you to develop a more robust style. Personally, the first letter I try is usually the lower-case \"a\" because it combines so many elements and quirks of the final face, I think it is a strong indicator of what the rest of the alphabet will be like.\n\nMaybe I'm overthinking it!\n\n"
    },
    {
      "time": "",
      "content": "_I don’t think a computer should EVER be the first step in the design process  \nSome of the world’s best type designers work directly on the computer._\n\nThat may be true hrant, but how many of those started that way? I would venture to say that most would need a fairly solid grasp on forms before they skip steps, and as Mark so wisely remarks, \"... its the eye, not the tools.\"\n\n"
    },
    {
      "time": "",
      "content": "Eric, I think Mark's statement actually supports my stance.\n\n\\> skip steps\n\nInstead of skipping steps, think of it as skipping crutches.\n\nI also use paper&pencil before the screen (except for highly constructed  \nfonts, bitmaps being an extreme case). But I hope to grow out of it one day.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_why you didn’t change your practices over the years?_\n\nIt works fine. I know what the \"rules\" of the typeface are, so I can work through a to z applying the rules. Then, when I have the first draft of each letter, I can try out combinations and change/refine characters to make it work better. If I show any preference in developing glyphs initially, that prejudices the overall concept.\n\n"
    },
    {
      "time": "",
      "content": "Is alphabetic order not just another \"prejudice\"?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "“… its the eye, not the tools.”\n\nBut the tool can hamper what you can do.  \nI was just doing a 60ies-hippie-floral-design for a poster this week (cliché-like weavy, colored forms flowing in each other, with some bloated letters hidden in them). I tried starting with illustrator, but had to give up because it just wasn't possible to get really flowing forms with that tool from scratch.  \nA quick and dirty pencil draft, a quick scan, and redrawing it on the computer did the job...  \nI think an artpad would have done it too. But the mouse did not.\n\nsebilar\n\n"
    },
    {
      "time": "",
      "content": "Mmmm? The pencil/pen, has nothing whatsoever to do with the recording of typefaces and usually gets in the way. Though you may find mental...play space in scratching around with old tools, it is only that, mental and play. when you're done you still need to execute a \"pure\" line which a pencil cannot do, and fails to represent in even the best sketch. Until the digital line is cut, and thus the letter recorded, nothing else counts, or matters since none of it is left when the dust clears from the digital font.\n\nAs for order of design, the press likes pat answers, but anyone whose done more than 1,000 or so, should tell you that \"it depends.\" e.g. if it is the first letter of a new family, you \\*can\\* \"start\" anywhere. But it is not until you draw the \"controls\" (noted elsewhere I'm sure), that you \"know\" the appearance of the repeating things and so you can finish by designing the unique things, and not \"chase your tail.\"\n\nIf it is not the first letter of a new family, there is an algorithm where the selection of character to draw is based on intended use that leads you from the existing styles to the right choice, which always follows after the control characters. E.g., if an agate is to be drawn well, based on the text face, then you must draw the controls from the text first, and then head for the most \"congested\" characters, like e.g., e or g, and then, loop back to the controls if you need to, early in the process, to make sure the controls and special-est characters, whatever they may be, work.\n\n"
    },
    {
      "time": "",
      "content": "_“… its the eye, not the tools.”  \nBut the tool can hamper what you can do._\n\nOf course. I should add that you also have to know how to use your tools, whatever they are. The eye can't do it alone. (I'd be a lot more productive if it could. :-)\n\nI grew up making marks on paper, so that method is very natural to me for getting ideas out of my head, and that's its strength. The Bézier curve is very precise and endlessly malleable, and that's its strength. The one thing I don't do anymore is to make precise drawings on paper. It's too slow and inefficient.\n\n"
    },
    {
      "time": "",
      "content": "\\> The Bézier curve is ... endlessly malleable\n\nActually some people, like Raph, complain that  \nit gives a certain -arbitrary- flavor to forms.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I wouldn't say it was arbitrary, perhaps just not quite willing to make the transition from straight to curve or back in a subtle enough way in some cases. This subtle difference may only appear to us type design wackos of the world.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Is alphabetic order not just another “prejudice”?\n\nI find it helps avoid prejudice, because there is not much rhyme or reason to it, in terms of character shape. Some though -- i and j, m and n, and v and w, are beside each other, probably because of letters that were spun off others were placed next to their source letter.\n\nPerhaps that's the point of alphabetic order -- it's a special sequence of letters that doesn't contain any words longer than 3 letters (OK Scrabblers, prove me wrong!)\n\n"
    },
    {
      "time": "",
      "content": "I typically start with Hh Oo Nn Jj Pp to give me a look of every piece of the alphabet.\n\n"
    },
    {
      "time": "",
      "content": "Miine always change from pencil to screen. It's just the way it happens for me, I've become used to things not turning out the way I thought they would. Besides, it is far more interesting when they don't!\n\nI also find that a clear idea of purpose is extremely useful before I even start. Otherwise it's like trying to design a logo without a brief. [Some sketches](http://web.archive.org/web/20110226084843/http:/www.klim.co.nz/content/lettering/letter.html), erictastic, are here if you are interested. You may note that some have migrated to the typeface section, others were just fancy.\n\n"
    },
    {
      "time": "",
      "content": "Bezier curves do impart a natural flavor to curves. If you're not careful stuff can start to look all the same. That being said, most people that say that you must start with a pencil suck at bezier curves. Since I can get my ideas out more quickly and clearly with beziers, that's where I often start. So my advice is this: if you are going to do type design, figure out how to use bezier curves.\n\nAs for which letter order you should use: it doesn't matter. I think it's a type design myth that doing the o and n first gives you a better sense of what the other characters are going to look like. In some ways, those characters are the most vanilla, and give you less of an idea than some of the more challenging characters.\n\nIf you are simply manufacturing a font, then it makes sense to start with o and h or even O or H, where elements can be easily reused. If you are designing a font, you might start anywhere your idea is most relevant.\n\n"
    },
    {
      "time": "",
      "content": "_So my advice is this: if you are going to do type design, figure out how to use bezier curves._\n\nAmen! Digital type is a medium. Without mastering the tools and building blocks of a medium, one will never get anywhere with it.\n\nCalligraphy and Lettering are different mediums. Sometime two or three of the mediums come together, and knowledge in one are can help in another, but this isn't a de facto transfer.\n\n"
    },
    {
      "time": "",
      "content": "\\> I think it’s a type design myth that doing  \n\\> the o and n first gives you a better sense\n\nProbably not directly better, but certainly sooner.  \nSimply because the elements they contain have higher frequency.\n\nOn the other hand, I do think that display fonts benefit  \nfrom the opposite tactic, for the reason you give:  \n\"... vanilla ... give you less of an idea ...\"\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "[This](http://web.archive.org/web/20110226084843/http:/www.cs.ru.nl/~freek/books/wadtorr.sat) is how Dwiggins did it.\n\n"
    },
    {
      "time": "",
      "content": "Sometimes alphabetic order can lead you down a primrose path from which there is no escape. Several months back, I ran across an enchanting little typeface in a book of handlettering with very unusual serifs. They resembled a dancer's foot _en pointe_, and so I thought the name _Twinkletoes_ would suit the typeface well.\n\nSince I was presented with a complete upper and lowercase alphabet A-z, I dutifully recreated them, and then fleshed out a complete character set. It was only _after_ I imported all of my outlines into Fontographer, generated a PS font and opened it in FontLab (have I mentioned before that I think FogLamp is a rip?), and started the process of setting widths, sidebearings and kerning, did I discover a VERY serious problem. The alphabet fit together beautifully A-Z and a-z, but virtually EVERY other letter combination required kerning. Before I got too far into it, I estimated that, at my present clip, expanding the basic kerning to include accented characters would result in over 10,000 kerning pairs--not a practical solution. So, I shelved the project; maybe someday, when everything in my life is settled and I _need_ some aggravation, I'll go back to this project.\n\nThe moral of the story: sometimes it works, sometimes it don't...\n\n"
    },
    {
      "time": "",
      "content": "At [Reading](http://web.archive.org/web/20110226084843/http:/www.typedesign.rdg.ac.uk/), students are recommended to start with the letters **a d e h i n o s** , in no particular order. It (intentionally) misses letters with diagonal strokes, as for someone trying to design his/her (in most cases) first text typeface, those 8 above are a pretty good challenge to start with.\n\n"
    },
    {
      "time": "",
      "content": "Often I start with something like habrgefits (a stripped-down \" [hamburgefontstiv](http://web.archive.org/web/20110226084843/http:/typophile.com/wiki/hamburgefontstiv)\") and HAOP, and play around with those. But sometimes I'll just do a handful and then fill in the rest in alphabetical order.\n\nI tend not to do a lot on paper, but I do spend a while refining the concepts in my head. Sometimes I can noodle on letterforms for days before I try anything. Occasionally I'll jot stuff down, but often it's only a few key elements to remind me of the serif structure, or relative proportions, or the like - not necessarily very many whole letters.\n\nI've noticed that there is a correlation (not a rule, just a correlation) between the age of the type designer and whether they draw on paper first. Seems like the 50+ crowd tend to be overwhelmingly paper-firsters, and the under 40 crowd have a lot more folks who go straight to the computer.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Thomas,  \nThat makes me feel young at heart. I am 62 and don't start with paper and go straight to the computer. I started using Adobe Illustrator with version one and have never looked back to my hand drawing days.\n\nThanks for making me feel like a young wipper! :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Yeah, thanks Thomas!  \nI started out on paper, but have worked directly on the computer since 1999, when I was 47.\n\n"
    },
    {
      "time": "",
      "content": "<cite>This is how Dwiggins did it.</cite>\n\nI made a pdf version from a library copy of this if anyone is interested. It's big though, I'd have to upload it somewhere.\n\n"
    },
    {
      "time": "",
      "content": "I find that which letters I start with depends on the individual typeface, but in general terms I try to mix in both forms that establish proportion (h i n o) and what are usually 'characteristic' forms, i.e. letters that do more to establish the flavour or personality of the face, (a b e g). The lowercase a is often the first thing I sketch, since this letter more than any other establishes the personality of the face, but I don't finalise this letter until I have done things like h and o.\n\nIf I am working on a multiscript typeface, I'll work on the different writing systems concurrently. So alongside my initial Latin letters I'll be making initial Cyrillic or Greek etc.\n\n"
    },
    {
      "time": "",
      "content": "Jackson, I'm interested.\n\n\\> If I am working on a multiscript typeface ...\n\nI think that's where it can get pretty complicated,  \nand even more so important, to proceed carefully.\n\nIn addition to the effect of one's choices on the display/textiness of  \nthe end result, there's the additional and equally (sometimes more so)  \nimportant factor of skewing one script or the other (or the third, etc.!)  \nin a certain inauthentic direction. Pure, grade-A quicksand.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Update: I just ordered, off Amazon, Bringhurst's book, and also the Logo, Font & Lettering Bible.\n\nCan't wait to get crackin' :)\n\n"
    },
    {
      "time": "",
      "content": "Wow, both of my new books are amazing. I'm almost finished with The Bible, soon to start Elements of Typographic Style\n\n"
    },
    {
      "time": "",
      "content": "just to add another one, fred smeijers stated at a lecture in switzerland last november (or so) that he always starts with the combination anse, because after him, this combination includes most of the problems you'll face when designing a typeface.\n\n"
    },
    {
      "time": "",
      "content": "\\> includes most of the problems you’ll face\n\nYeah, who needs extenders?  \n(Like everybody knows why all-caps is just as readable as mixed-case, right?)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "at least for me, ascenders/descenders are not as important for the design of a typeface as are a, n, s and e - in most designs (im talking about sketch phase, not about the end product). but yeah, inormaly add a b or a d to the first letters, or a t.\n\ni dont have the time to read the whole thread right now, but nearly everybody agreed a page earlier that there is no right or wrong in this question. so why even bother discussing such stuff.\n\n"
    },
    {
      "time": "",
      "content": "Because the point, and the joy, is in the gray?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Gerald Unger, from Reading, recommended that I follow oehamburgvos (the OE is actually an ethel). He said that it would get me through with no problems.\n\n"
    },
    {
      "time": "",
      "content": "I think how the identity of a face is defined depends on how the initial idea came.  \nFor this reason, the starting point to me has been often a different letter (or numeral), or a small group of them. When I started to learn software I played with geometric faces directly in FontStudio.  \nLater on, all my few finished or released types have seen the first ideas generated in the form of pencil sketches.\n\nI think the best advice emerged from different perspectives. John Hudson with his huge experience is right, since you have to define or fix reference glyphs as the design proceeds, otherwise you'll lose focus (your problem). The key ones people underlined are the one to do, but it depends on the idea as well.\n\nWhat Nick Curtis said about not having a strong or clear idea at the beginning seems not to make much sense. As Hrant pointed out, a design evolves as you start considering its problems, and it may turn out to be good, or to be just a better basis for something else.  \nBut I think you'll start seeing this in perspective.\n\n"
    },
    {
      "time": "",
      "content": "maybe doing the letters in a pseudo-random order works for some type of fonts, but i doubt it's the most efficient, perfect way for each and every type of font you can make. i don't use any system, i let the font decide where it wants to go. not to be one of those \"rules are meant to be broken\" kind of people, but i don't think always following a specific order is always the way to go. the font should dictate it's own creation.\n\n"
    }
  ]
}
