{
  "id": "18507",
  "title": "Beginner in Arabic",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello,\n\nI am taking Beginning Arabic and would like to set up some charts and flash cards for myself. I have the truetype fonts that came with Mac OS 10 (Al Bayan, etc.). What do I have to do to use them in Quark and/or Illustrator? Alas, I don't have InDesign.\n\nI've been a typesetter since 1974, but this is making me feel like a complete moron. Anyone willing to walk me through how to set up my computer to use Arabic characters? I'd appreciate it.\n\nThanks,\n\nKristin\n\n",
  "author": "kristin",
  "time": "13 Mar 2006 — 1:36pm",
  "uid": "1553",
  "comments": [
    {
      "time": "13 Mar 2006 — 1:59pm",
      "content": "Arabic/Hebrew/Persian are poorly served by desktop publishing apps on OS X. InDesign won't get you anywhere, alas, unless you have the Middle Eastern edition, and I suspect Illustrator is the same. Not sure about Quark; maybe you need Quark Passport? do they still make that? I haven't used Quark in years, so I don't know.\n\nBut: there is a very useful word processor called [Mellel](http://web.archive.org/web/20131023073148/http:/www.redlers.com/) that lets you use right to left scripts. It's not free, but it's not tremendously expensive; if you're doing any amount of work in Arabic, it's a great investment. (There's a free version, but I forget what it does.) When mixing right-to-left scripts and left-to-right (I design a journal of poetry in facing page translation) I've used it to create PDFs which I then place in InDesign. Mellel gives you kashiida support, which is how text is justified in Arabic and Persian - the connecting ligatures between characters are extended as needed, as word-spacing and letter-spacing are extended in Roman justification.\n\nThere's also decent support in most basic OS X applications, like TextEdit. If you haven't already, go to Preferences \\> International, go to the Input Menu tab, and check Arabic or Arabic Qwerty, which will let you switch to them. Also check Keyboard Viewer & Character Palette. This adds a little flag to the upper-right-hand corner of the screen; by selecting Arabic, you can type in Arabic. Show Keyboard Viewer is the old OS 9 Keycaps, but it shows the characters in the selected language, useful when learning to type. And Character Palette will let you get to everything else you need to that you can't from the keyboard directly.\n\nIf you're really hardcore, there's also XeTeX, which is an implementation of TeX that lets you typeset text in any direction, using any font in OS X. Powerful, but there's a learning curve.\n\n"
    },
    {
      "time": "13 Mar 2006 — 2:34pm",
      "content": "Because TextEdit seems to handle Arabic, I was somewhat hopeful that Pages and Keynote might as well. However, I found this link which is a bit discouraging. It does corroborate dbvisel's comments though.\n\n[http://www.hf.uib.no/smi/ksv/arabicprogsx.html](http://web.archive.org/web/20131023073148/http:/www.hf.uib.no/smi/ksv/arabicprogsx.html \"http://www.hf.uib.no/smi/ksv/arabicprogsx.html\")\n\n"
    }
  ]
}
