{
  "id": "18519",
  "title": "Help with a study abroad course: politics and type",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Fellow Typophiles, only you can help!\n\nTeaching faculty at the University of Illinois at Urbana-Champaign can propose courses for study abroad. For a long time, I've wondered how to reconcile professionally my vocation as a political theorist with my avocation for type and typography, and I thought: this might finally be it.\n\nI want to send our study abroad office a proposal for a three-week course in Europe on the politics of type/type design/typography, and/or the typography (etc.) of politics--something that might combine politics, history, graphic arts, industrial design, and so on. These short courses are available to all UIUC students, so there would likely be a mix of liberal arts and fine arts students taking part, most of them in their first or second years of school. The earliest this course could happen would be over winter break, from just after Christmas through the first couple weeks of the New Year. The office would like proposals by the 17th for consideration for the 06-07 session, but I'd rather not rush things for this year if it means sending a bad proposal. On the other hand, the proposal itself doesn't require a full itinerary and accounting of all the logistics and arrangements; that would happen over the next few months, assuming the proposal was accepted.\n\nSo, why am I asking for your help?\n\n**1.** Obviously, in a three-week course, you can't tackle every possible aspect of this sprawling topic, so I have to narrow it down pretty severely. I am mining Stanley Morison's Politics and Script, Robin Kinross's Modern Typography, and the Triumvirate for ideas, but there's not a lot in print I've found so far that makes this topic its main focus. So, I wonder: have any Typophiles taken or taught courses on this topic? What did you read? What topics did you cover? What were some of the more successful units that might stand alone as a three-week experience for students? I have thought of things like the history of the Romain du Roi, the discussion on the list last year about totalitarian typography, the politics involved in creating and disseminating different typographic technologies, and so on--but I think hearing your experiences and ideas would help me to narrow something down.\n\n**2.** Where should we go? Most of these courses visit one city, but I bet as many as two or three cities within a an easy day's rail trip of one another would be acceptable, depending on the topic up for study. I would like to take students to Germany (since I speak the language and know something about the country), but obviously Belgium and the Netherlands would be excellent candidates, too, given the history of European type design. Museums (like the Plantijn-Moretus) would be a big draw, as would chances to visit schools of design or foundries. The students will more than likely only speak English.\n\n**3.** Would anyone like to help--by inviting students to your office or school or local museum, by giving a talk or lecture or tour, by acting as a liaison between us and people who could help, whatever? There is almost certainly no money involved, but on the other hand, this is your chance to warp impressionable minds in a good direction, and it might take no more than a day of your time.\n\nThis could either be the greatest idea of my teaching career (it's not a high hurdle), or far too much for me to handle. I'd love your help in finding out which. Any and all ideas, reactions, and offers would be a great help.\n\n",
  "author": "Maurice Meilleur",
  "time": "14 Mar 2006 — 5:04am",
  "uid": "5104",
  "comments": [
    {
      "time": "14 Mar 2006 — 7:39am",
      "content": "This is a topic I am also very interested in, so I hope this thread develops. Here's my bibliographic contribution:\n\nRobin Kinross, \"Unjustified Text and the Zero Hour,\" in _Unjustified Texts: Perspectives on Typography_ (London: Hyphen Press, 2002), 286-301.\n\nBy his own admission this essay is more of a sketch than a complete argument, but it may provide good food for thought about the relationship between the political climate and typographic elements (in this case the unjustified text emerging in the post WW2 world).\n\nThe other thing I thought of was the discussions provoked by Shaw and Bain's _Blackletter_ exhibition and catalogue, which it sounds like you already are planning to address.\n\nGood luck with your planning!\n\n"
    },
    {
      "time": "14 Mar 2006 — 8:13am",
      "content": "Lettering Tours of Europe have been done by [these folks](http://web.archive.org/web/20131108033023/http:/www.letterspace.com/LETTERING_TOURS/index.htm). It seems that they no longer do this, but they can probably give you great advice.\n\nI think it is accurate to say that the great political, religious and social events influenced type, but not the other way around. Other than the invention of printing itself, which was a major social force, I think type design is more of an indicator than a cause.\n\nChapter IV of Harry Carter's 'A View of Early Typography,' though pedantic in style, gives a facinating account of the spread of roman type vs blackletter. Catholicism, the King of France, Calvinism and Lutheranism all play roles in it.\n\nOther notable changes are the dropping of the long s after the French revolution (I don't know the full story) and the saga of the Nazi promotion and then abandonment of blackletter, which is well documented.\n\n"
    },
    {
      "time": "14 Mar 2006 — 8:57am",
      "content": "In the landscape of ideas concerning what facet of politics & type to  \nfocus on, there's one big spike: blackletter. Take them to Germany,  \nand be as pushy as possible. A pandora's box, but full of angels as  \nwell as daemons.\n\n\\> which is well documented.\n\nNot well enough, since most people continue to associate  \nblackletter with the Nazis, and more broadly with Germans,  \nand even more broadly with enemies of Israel. Come to think  \nof it, a detour to Israel during such a blackletter tour would  \nbe da bomb.\n\nhhp\n\n"
    },
    {
      "time": "14 Mar 2006 — 11:03am",
      "content": "The history of blackletter _type_ has always been political… from almost the very beginning. Gutenberg may have been involved with some Catholic reformists, who were interested in having definitive versions of scripture to help quell dissent and variety of interpretation. Gutenberg's texturas and Mainz texturas in general would become associated with Catholic printing in Germany during the Renaissance, while Fraktur would become associated with the Lutherans.\n\nBut before Fraktur became associated by the Lutherans, it was commissioned by the German Emperor in Nuremberg, who may have desired forms like those from his mother's Burgundian family in Belgium.\n\nDuring and after the French Revolution, which divided Germany and caused all sorts of political change there (as I'm sure you know), the Serif vs. Fraktur debate arose, probably for the first time. And the Fraktu- backers were German nationalists; German nationalists were later able to force a political and cultural break with Austria (1848–1870), and then seized power and created the Second Empire. Yet the Second Empire was not really so big on Fraktur as one might think… the Reichstag debated ditching it almost altogether on more than one occasion.\n\nThat takes me to the 20th Century… which has even more to write about! Too much for one post here.\n\nI'd bring them to the Frankfurt area (but I'm very biased). This was always a big center of German printing and type. First Gutenberg, then a myriad of foundries, almost all which disappeared or moved during by the late 20th century. Linotype is here now, too. There are several schools in the area, all of which are excellent for type, and two great museums, the Gutenberg Museum and the Klingspor Museum.\n\nIf I were you, I'd take them to London first. There is great type stuff there (and maybe you could visit the University of Reading, too… that might have the best collection in the world… certainly the most accessible). Then come here. I'd be happy to lend you any hand I could. There are lots of other type types in the area as well, Germans and internationals…\n\n"
    },
    {
      "time": "14 Mar 2006 — 11:42am",
      "content": "Craig, William, Hrant, Dan--\n\nThanks for all the info right out of the gate! I rather suspected that if I was partial to Germany as a destination, the topic of the course might sort itself down to the story of blackletter (script and type both), and I suspected that Frankfurt (especially) or Berlin would present themselves as obvious choices of cities.\n\nI don't think London or Israel would be options I could pair with any German city (or one not close to the North Sea coast, in London's case), because of the travel time; these are for-credit courses and it might be hard to sell a proposal that has interruptions of much length in the calendar. (Moreover, stupidly, Israel would be a hard sell for too many parents.)\n\nOne of the advantages to the exploration of type and nationalism would be that it would allow me to tap into issues of globalization--in a different way. In many of these courses, faculty take students to cities like Singapore or London to talk about how people from very different backgrounds and cultures, with diverging and conflicting interests, negotiate a common life (or don't, as the case many be). But here might be a chance to see the history of _resistance_ to cultural and national diversity, fought on the battleground of what constitutes a proper form of type/writing, in the name of asserting, even creating, a national identity.\n\nOkay, enough of my own musing for now. Keep the ideas coming, please, folks. This could be a good idea after all.\n\nThanks for the pointer, William. And thanks, Dan, for the offer--that's precisely the sort of friendly help I am shamelessly hoping to elicit.\n\n"
    },
    {
      "time": "14 Mar 2006 — 11:46am",
      "content": "What about Rome? The Romans certainly used letterforms for stately and propaganda purposes. Rome is beautiful, and has letters everywhere, and not just from one period, but from all of them.\n\n"
    },
    {
      "time": "14 Mar 2006 — 11:51am",
      "content": "_a detour to Israel during such a blackletter tour would  \nbe da bomb._\n\nWell, as Hrant knows, I think that the history of blackletetr in politics is much too big to only be viewed through the WWII prism, but he is certainly right in that people associate blackletter with enemies of Israel. In fact, in Germany, blackletter is associated right now with heavy metal (which is, sadly, almost an exclusively radical right-wing phenomenon here) more than anything else. I personally believe that the way to get past this was to point out how well blackletter was used **before** the N.S. period, and try to recapture its experimental nature that way.\n\nAlthough I run into trouble here, too… as I mentioned above, some of blackletter's biggest fans from 1792–1932 were stark Nationalists… even though there is a difference between German Nationalists and German National Socialists (Nazis), many see this difference as purely academic :(\n\nCome to think of it (although you are right to assume it would never happen) going to Isreal would be a great way to take about the politics of script… certainly from the \"Modern Hebrew\" angle, if not anything else.\n\n"
    },
    {
      "time": "14 Mar 2006 — 12:19pm",
      "content": "You might also visit Greece and Russia. The whole St. Cyrill thing seems like a good polital/religious letterform story.\n\nChrisL\n\n"
    },
    {
      "time": "14 Mar 2006 — 12:20pm",
      "content": "…not to mention Peter the Great and his Dutch connection!\n\n"
    },
    {
      "time": "14 Mar 2006 — 12:32pm",
      "content": "Peter the Great and the Dutch? Enlighten me--I missed that one entirely.\n\n"
    },
    {
      "time": "14 Mar 2006 — 12:35pm",
      "content": "Peter the Great reformed the Cyrillic alphabet, making it more or less what it is today, more or less 300 years ago. He brought Dutch punchcutters to Russia, and they made his Civil Type. That's what I meant.\n\nI believe that the Russian Orthodox Church uses the alphabet in its pre-1700 form today.\n\n"
    },
    {
      "time": "14 Mar 2006 — 12:42pm",
      "content": "You could also go to East Asia. In the 1950s, the People's Republic of China reformed written Chinese, creating what they call Simplified Chinese (the characters have less strokes). Taiwan still uses Traditional Chinese characters.\n\nJapan reformed Japanese somewhat, after WWII. I think that now when Japanese is written horizontally, the text runs from left to right, like Latin (allowing for Romaji—the Roman alphabet—to mix in better?). Vertically, Japanese columns are still ordered from right to left.\n\nA Korean emperor developed the Korean writing system independently, I think around 1400. I don't think that this was officially adopted throughout Korea until after 1945 though. The Koreans were also printing with movable metal type before Gutenberg. There is a lot about type to be learned there, I bet.\n\n"
    },
    {
      "time": "14 Mar 2006 — 12:57pm",
      "content": "Thanks, Dan. I remembered the Cyrillic reform part, but never knew (though I guess it doesn't surprise me) that PTG recruited the Dutch to help.\n\n"
    },
    {
      "time": "14 Mar 2006 — 2:21pm",
      "content": "This is starting to sound like more than a study abroad program. Where can I sign up?? ;^D\n\n"
    },
    {
      "time": "14 Mar 2006 — 2:26pm",
      "content": "You might focus on type that was designed in a self-consciously \"political\" way. Sure, every human artifact can be seen in a political light. But I'm thinking that, if you need to focus and find a practical destination for a study-abroad program, Germany and the Netherlands are probably the places to go. Call it \"From Blackletter to Bauhaus: Political Typography in Europe.\" Or something like that. Bauhaus design was the first example I really \"got\" as an explicitly political move in type-- strip it back to zero, strip out all the remnants of bourgeois life, the huge cultural disaster that led us to WW I, etc. Typography is only a part of that, I know, but it really stuck.\n\n"
    },
    {
      "time": "14 Mar 2006 — 2:34pm",
      "content": "Oh, another highly interesting case of politicized type is Gaelic, which has been the object of tugs-of-war in various ways among numerous Irish and English political movements for a century or three. I have a good friend (Matha Standun) who's a specialist in that, and I'm sure he would help you out. One advantage over Germany (unless your students are the adventurous type) is that there would be no language barrier.\n\nhhp\n\n"
    },
    {
      "time": "14 Mar 2006 — 2:38pm",
      "content": "Typography was actually a _very_ small part of the Bauhaus movement. Most typefaces associated with the Bauhaus actually had nothing to do with it, i.e., Futura (Paul Renner taught at a _competitor_ design school to the Bauhaus, in Munich). Even Jan Tschichold who respected the Bauhaus' work and may have even applied for a position there cannot be lumped in the same boat (he taught at Renner's school in Munich for a while, for instance… just a reminder that Germany did not have a single typographic center, then or now ;-) )\n\nThe Schools in Stuttgart and Offenbach had much more vibrant and exciting typographic experiments and type/calligraphy instructors than the Bauhaus did, but they were a bit more \"conservative.\" In any event, they didn't call for a complete break with the past, although I'm sure they saw themselves just as superior to it.\n\n(They were also politically much better off in the 1930s, but that is no reason to condemn them outright. It is so easy to get black&white with 1930s Germany. Not everything fits so easily into either the good or bad camp, though… that's exactly what makes it so disconcerting. One must ask oneself, \"where would I have fit in. what risks, exactly, would I have taken?\" History is always 20/20, but those who really go about a relationship with the past should not put themselves above it, and should consider the gravity of what people went through. Certainly, those who collaborated deserve our disrespect, but like all walks of life, there were shades of grey in the German design community. Where does one draw the line?)\n\nMaybe instead of \"From X to Y\" you could call it something like \"There and back again.\" I don't believe that the history of type design is linear, sorry :(\n\n"
    },
    {
      "time": "14 Mar 2006 — 2:40pm",
      "content": "Hmm . . . the idea of E Asia is enticing, but I have no languages from that area of the world, no contacts, and little of my own understanding of the history and political culture of places like China, Korea, Japan. The story of Korean script, or the politics (and history, etc.) behind the several systems the Japanese use to write, to mention two, are fascinating, but I don't know what I'd bring to that mix: I'd be relying on experts there both for the typo(etc.)graphy and the politics and history.\n\nGreece and Russia are more reasonable ideas, though the language barrier there would be an issue, too, so I wonder whether Germany and the story of blackletter might not be the best idea after all. Maybe London/the University of Reading, or another city in Europe (like Rome, say), would be a possible addition. In that case, though, I'd probably have to present a second location as a way to tell a contrasting or complementary story about type/writing and politics. (Not that visiting good museums and meeting interesting people shouldn't be reason enough in themselves to visit someplace, but remember what I'm dealing with here.)\n\nFolks, this process is very helpful to me. Other reactions or ideas?\n\n"
    },
    {
      "time": "14 Mar 2006 — 2:44pm",
      "content": "Germany gave birth to printing and blackletter type. Shortly thereafter, Venice and other Italian cities gave birth to the Humanist typefaces that we are still familiar with. And many of those first printers even came from Mainz—some directly from Gutenberg's workshop! (Mainz had a sort of civil war in the early 1460s, and artisans who could left the city for better conditions).\n\nSo, going to Germany and Italy would make great historic sense. Between Berlin, Frankfurt, Venice, and Rome, you can't go wrong!\n\n"
    },
    {
      "time": "14 Mar 2006 — 2:48pm",
      "content": "Man . . . I take 10 minutes to catch up, and I miss 5 posts.\n\nTiffany, I'm with you. _I_ want to sign up for this class. I like the ring of \"From Blackletter to Bauhaus,\" though it wouldn't have to mean a progression or evolution. It could also be, \"Blackletter _and_ Bauhaus.\"\n\nOkay, I've probably missed something else, now.\n\n"
    },
    {
      "time": "14 Mar 2006 — 2:49pm",
      "content": "Actually, I could argue that Germany also gave birth to Humanist typefaces. :^D\n\n"
    },
    {
      "time": "15 Mar 2006 — 4:37am",
      "content": "I am impressed by your postings, I liked the title and I bookmarked the address and now I saw my democratic Wacom tablet clicking on the link and I got ascii shower !  \nI have just bought Turkish milk with Novarese bold for the logo.\n\n"
    },
    {
      "time": "15 Mar 2006 — 11:07am",
      "content": "Thanks for the clarification, Dan. For what it's worth, I was just suggesting something catchy-sounding. I wasn't making any claims about historiography, so much as just trying to identify a particular area of interest.\n\nThe official Bauhaus \"school\" may not have done as much typography as other things, but certainly the general anti-bourgeoius, strip-it-back-to-the-elements approach covered a large constellation of artistic activities, including those of that group. I don't think you can make such a broad claim against the link just because the link is subtle. Consider [this online archive](http://web.archive.org/web/20131108033023/http:/www.bauhaus.de/english/bauhaus1919/werkstaetten/werkstaetten_typographie.htm). Type is certainly not irrelevant there.\n\nEDIT: In fact, the more I revisit the issue, the more it looks like typography was VERY important in the Bauhaus. Indeed, the very idea of a \"rational system\" to define an alphabet, based on the \"bare essentials\" necessary, strikes me as very much a part of the whole early 20th-c modernist/anti-bourgeois/anti-victorian project, and was very much woven through the whole Bauhaus movement.\n\n"
    },
    {
      "time": "15 Mar 2006 — 11:31am",
      "content": "\\> “Blackletter and Bauhaus”\n\nHey, Dan should start a bed & breakfast by  \nthat name for typophiles visiting germany.\n\nhhp\n\n"
    },
    {
      "time": "15 Mar 2006 — 12:16pm",
      "content": "Well, typography may have been important there (although I just don't believe that…), but if it was important, it was still much less important than anything else. The Bauhaus was founded by an architect. It had three directors, all architects. How much typography do you find in its general curriculum? Very little. Most contemporary schools today place more time and value on it than the Bauhaus did.\n\nI don't mean to discount the awesomeness of the type and lettering work that was done there. It is inspirational and will probably remain so forever. But the focus of the Bauhaus was on total art, and architecture (which the guys in charge thought was total art anyway). And architecture was the supreme discipline to which one could aspire. You see, I disagree on that last point there ;-)\n\n"
    },
    {
      "time": "15 Mar 2006 — 12:25pm",
      "content": "Joost Schmidt's work at the Bauhaus was great, I'm not denying that. And Bayer's Universal Alphabet continues to inspire (just look at FontShop's newest free font for the Soccer World Cup this summer…). But these were rather isolated experiments. Of coursed the Bauhaus used type in its design and advertising… typography is an essential part of graphic design. But they were more concerned with other things. Look at any Bauhaus book (especially the hundreds of retrospectives available in German…) and you'll find more teapots than posters or alphabets. The Bauhaus Archiv's website has a typography section, and I've been to both its physical museum and the current museum and school in the historic buildings in Dessau. Great stuff. But typography was a minor league pastime there.\n\nIn foreign countries, the Bauhaus has a different vision from what it really might have been. Coming from the US to Germany, I expected it to be something else, sort of like the all-permeating religion it is for so many American designers. But, as I mentioned, the history of German design has so many interesting intertwining threads. And the 1920s have at least three that are all more typographically relevant—both to their time and today—than the Bauhaus' typography.\n\nThat's my point, and I'm sticking to it!\n\n"
    },
    {
      "time": "15 Mar 2006 — 12:27pm",
      "content": "_Hey, Dan should start a bed & breakfast by  \nthat name for typophiles visiting germany._\n\nDude, that would totally rock. I would eat that up. I do have a spare bed in my apartment…\n\n"
    },
    {
      "time": "15 Mar 2006 — 12:46pm",
      "content": "What about Alcuin, Charlemagne and the invention of lower case? Anyone know if that was political? Could you make it so in order to justify :) a trip to France?\n\nAnother avenue you might explore (stop me before I pun again!) would be \"social design\" ideas. John Emerson has a blog that explores this issue and has a categeory devoted to type:\n\n[http://www.backspace.com/notes/](http://web.archive.org/web/20131108033023/http:/www.backspace.com/notes/ \"http://www.backspace.com/notes/\")\n\n"
    },
    {
      "time": "15 Mar 2006 — 1:25pm",
      "content": "I hear you, Dan. And you're a lucky man to have been to those places. Closest I've been is an exhibit on Dutch architecture in Amsterdam.\n\nAnyway, I think the only real difference here probably is one of historiography, sorta. On the one hand, we can focus on the specifics of who did what, and when and where. Obviously that's the bedrock of any decent historical perspective. Although, I'm more inclined first to notice formal and conceptual parallels and similarities, which clearly can be reconstructed with varying degrees of caveats about who did what, and where and when. I'm not saying I like to fool around with lies and half-truths; rather, I'm just trying to make sense of what can be re-interpreted through our current lenses in ways that are useful without being totally groundless or fallacious.\n\nIt's like a question of whether a particular sans-serif face is \"Bauhaus\" or not. Well, from one perspective, if it wasn't designed by Walter Gropius or others who actually sat and walked and talked and smoked in hallways and parlors together, then I guess the answer is a flat and categorical, \"No.\" But if you edge over a little into the formalist/conceptual realm, and you're looking for evidence of a particular \"aesthetic\" (I know, some probably won't like that term), you certainly would be able to see it.\n\nIn any event, I don't want to belabor this Bauhaus stuff. It keeps making me think of that awful band that I once thought was the best EVER. Better even than the Doors!\n\n- Jay\n\n"
    },
    {
      "time": "15 Mar 2006 — 1:37pm",
      "content": "Yes of course, I can agree with that. I just wish that we had a better term than Bauhaus for all this \"Bauhaus\" stuff. That way, the Bauhaus stuff and the not Bauhaus stuff might live side by side happily in some sort of über-category.\n\n"
    },
    {
      "time": "16 Mar 2006 — 7:45am",
      "content": "Bauhaus/destijl/constructivist stuff?\n\nChrisL\n\n"
    },
    {
      "time": "16 Mar 2006 — 9:07am",
      "content": "Hey, everyone:\n\nThis has been so much more response than I had reason to hope for. Thanks to all of you, and please continue to chime in with ideas and use the thread for related debates--it's all great material.\n\nI have to digest this stuff and my own ruminations into a cogent proposal for the folks at our study abroad office. Fortunately, these proposals are considered works in progress, especially when they're for new courses, so I have lots of time to amend or revise. So, like I said: I'm still interested in anything you all have to offer.\n\nI will say it's looking like Dan's idea about Frankfurt and its typographic wiles and charms will be the center of the proposal. Its resources and its central location (in case there are other stops or trips involved) make it ideal. (Dan, can I contact you off-list?)\n\nI'll post the proposal when it's done for further comment, if anyone's interested. Thanks again, everyone.\n\nPlease . . . as you were.\n\n"
    },
    {
      "time": "16 Mar 2006 — 10:44am",
      "content": "Maurice, you can contact me anytime at either **type.nerd** (that-funny-monkey) **gmail.com** or **dreynolds** (that-funny-monkey) **linotype.com**.\n\nBTW, since everyone loves the Bauhaus, and it is great for students (I went there twice when I was one), its locations are conveniently accessible from Frankfurt, which is Germany's transit hub. By train, Weimar is about two or three hours away, and Dessau and Berlin are each about four. More or less, you can travel through them all in one shot (Frankfurt–Weimar–Dessau–Berlin), although not in a single day if one wanted to see anything at all!\n\nFor instance, one could travel to Weimer and spend a night there, then go to Dessau the next day for a few hours, then spend the second night in Berlin, see Berlin on the third day, then come back Frankfurt on a fast train, etc. Bed-n-Breakfast typophile guests take note ;-)\n\n"
    },
    {
      "time": "16 Mar 2006 — 10:47am",
      "content": "\\> since everyone loves the Bauhaus\n\nPardon?\n\nhhp\n\n"
    },
    {
      "time": "16 Mar 2006 — 10:55am",
      "content": "Well, Hrant, you are the one who posted this:\n\n_\\> “Blackletter and Bauhaus”_\n\nHey, Dan should start a bed & breakfast by  \nthat name for typophiles visiting germany.\n\nhhp\n\nIt seems clear from this discussion that almost everyone is recommending that the Bauhaus or Bauhaus-ness be a component of the course. Even though I think that there are so many other things in Germany and the world which illustrate Politics & Type better, I know how design students think. They'll see the word \"Bauhaus\" in the title and think \"cool! sign me up!\"\n\nBesides, unlike many other ideological centers—and the Bauhaus was an ideological center, just not the only one or one all too ideological about type ;-) —the Bauhaus exists as an actual building that you can still visit. Actually, it still exists as two actual buildings, plus an extra museum in Berlin. And the buildings in Dessau and Weimar are still used for their original purposes—design schools!\n\nI know that not everyone loves the Bauhaus. But I suspect that deep down in your skeptical heart, even though you are not a modernist, you love the Bauhaus, too. Weren't they modern before the modernists were modern ;-P\n\n"
    },
    {
      "time": "16 Mar 2006 — 10:58am",
      "content": "Plus, Hrant, the Bauhäusler were actually willing to take on alphabet and script reform.\n\n"
    },
    {
      "time": "16 Mar 2006 — 11:01am",
      "content": "Last point, I promise.\n\nRegarding typographic ideologies at the Bauhaus, they did have a few popular ones. Script reform, for instance. Many of them just wrote in lowercase, which is actually a _stand_ when you think about the German language and its rules.\n\nFor a while, the Bauhaus even used an official letterhead from Herbert Bayer that had a **footnote** on it! A footnote on a piece of stationary! It said something to the effect of, \"we're just using lowercase letters… why? because you can't differentiate between upper- and lowercase when you're speaking… so why do so in print?\"\n\n"
    },
    {
      "time": "16 Mar 2006 — 11:17am",
      "content": "\\> Weren’t they modern before the modernists were modern\n\nThe Ancient Romans were Modern first.\n\n\\> the Bauhäusler were actually willing to take on alphabet and script reform.\n\nEven though the actual ideas and motivations behind their reform  \nefforts were childlike in their ignorance, I admit you do have a point.\n\nhhp\n\n"
    },
    {
      "time": "16 Mar 2006 — 12:46pm",
      "content": "You could call your B&B \"Fraktur and Frutiger,\" too, I suppose. And offer a special \"Frutiger Fruit Plate.\" With Fraktured Fruit Forks.\n\nI think we need to make a distinction between pre-moveable type and post-moveable type, at least in the West. The \"Ancient Romans\" certainly were not modern in anything but relative terms. At that rate, you might say that any number of ancient cultures were \"modern\" in that their inscriptions were \"sans serif.\" Right?\n\nWhat strikes me about sans-serif type of any kind, and especially the most simple, minimalist kind such as the hyper-\"rationale\" systems of early Modernism (ca. 1910-1930), is that in the world of moveable type ca. 1500 c.e., all these goldsmiths and jewelers didn't go, \"Wait a SECOND. WHY are we imitating hand-drawn script and torturing ourselves so much here? I mean, if we stripped things down to the basics here, we could make most letters with a single punch and a couple minutes of cutting. Why are we making our lives so difficult?\"\n\nTo me, that's a clear example of how historical and cultural context affects the thinking of people down to the very basic elements of what is considered possible. I would say that any clean-lined, minimalist type looks \"modern\" precisely because it took over 400 years for people to figure out that they DIDN'T have to imitate monastery script, nor Roman monument carvings.\n\nPlus, there's a chicken-n-egg question here. Which came first, the minimalist \"inclination\" or the new artifacts that seemed to embody such an inclination? Hard to say-- and I'm not sure we need to answer it.\n\n- J\n\n"
    },
    {
      "time": "16 Mar 2006 — 12:57pm",
      "content": "But the ancient Romans were not striving for modernity, in fact, they were striving for the opposite, historical authenticity.\n\n"
    },
    {
      "time": "16 Mar 2006 — 1:07pm",
      "content": "\"But the ancient Romans were not striving for modernity, in fact, they were striving for the opposite, historical authenticity.\"\n\nThe Romans pretty much copied everything Greek. I'm no historian, but wasn't the common language Greek until about the time of the fall of the Roman Empire, around which time Latin became the common language?\n\n"
    },
    {
      "time": "16 Mar 2006 — 1:11pm",
      "content": "To me the Ancient Romans were the first to head towards Modernism, even if they didn't get nearly as far as us. Contrast the Roman absolutism with the Ancient Greek pragmatism. There was a break there, and it was the seed of Modernism. This seed was later to be nurtured by movements like the (so-called) Enlightenment, the Industrial Revolution, etc.\n\nJay, there are entire worlds besides constructivism and chirography. Just because (I agree) it's not necessary (in fact it's usually bad) to imitate handwriting in type doesn't mean building letters from kiddie blocks is better.\n\nhhp\n\n"
    },
    {
      "time": "16 Mar 2006 — 1:11pm",
      "content": "I think Hrant was referring to when the ancient Romans -- the Humanists -- decided to use the Latin alphabet to more accurately portray the text of the philosophers.\n\nI don't think the Romans did copy the Greeks, in regards to the written/printed word at least.\n\n"
    },
    {
      "time": "16 Mar 2006 — 1:12pm",
      "content": "Hmm. Absolutism. I hadn't thought of that. Interesting idea.\n\n"
    },
    {
      "time": "16 Mar 2006 — 1:24pm",
      "content": "The Greek/Roman thing went both ways. Faced with obviously superior cultural sophistication in the beginning, the Romans did copy much of what they saw on the other side of the Adriatic. But then gradually, naturally, sort of like reverse-osmosis, the greater build-up of culture on the Roman side (coupled with the empoverishment of it due to politcal subservience on the Greek side) caused the Greeks to become increasingly more Roman. Here's an example comparing a 2nd century BC to an early 2nd century AD Greek inscription (the third image):\n\n[http://www.themicrofoundry.com/ss\\_rome3.html](http://web.archive.org/web/20131108033023/http:/www.themicrofoundry.com/ss_rome3.html \"http://www.themicrofoundry.com/ss\\_rome3.html\")\n\nThe one on the left is from a book, the other is from a photo I took at Delphi (in a Summer downpoor, an event the locals assured us happens once in a decade, supposedly) in 1995, not knowing what it signified, what it would signify to me today! And it's not visible in that detail, but guess what name you can find on the inscription itself: TRAIAN!\n\nAnd look at us today, with the Greek-on-the-street oblivious  \nto the Latinized junk littering his cultural landscape.\n\nhhp\n\n"
    },
    {
      "time": "16 Mar 2006 — 1:49pm",
      "content": "Superior cultural sophistication-- you mean like when Julius Caesar and his cronies made important political distinctions based on the divine signs contained in animal entrails? Ahem...\n\nAs for \"Contrast the Roman absolutism with the Ancient Greek pragmatism.,\" that's an oversimplification if I ever saw one. Where'd that come from? Certainly not any cultural history I've ever seen, or perhaps not anything published after the mid-20th c, when such broad-brush categorization of our \"heritage\" cultures finally started to show their age.\n\nDepends what you read I guess. Within the realm of culture, I'd mix it up-- both had absolutist strains and both had pragmatic strains. Caesar was nothing if not pragmatic (Machiavellian, opportunistic, etc.) yet also sought to be dictator (absolutism?).\n\nOn the other hand... I do see your point, hrant, in terms of a contrast between maybe \"rougher\" type and \"sharper\" type. And I do like your photo essay.\n\n- Jay\n\nNOTE: I edited the above after hrant posted the note below. As for that, I have no rose-colored glasses. I don't think either the ancient Greeks or the ancient Romans are worth comparing except on specific, formalistic issues. Which had \"better\" type is just a silly question, to me, I guess.\n\n"
    },
    {
      "time": "16 Mar 2006 — 2:03pm",
      "content": "\\> Depends what you read I guess.\n\nOr how rosy you like to feel about your heritage.\n\nhhp\n\n"
    },
    {
      "time": "16 Mar 2006 — 2:05pm",
      "content": "The ancient history here is not top quality.\n\n<cite>The Romans pretty much copied everything Greek. I’m no historian, but wasn’t the common language Greek until about the time of the fall of the Roman Empire, around which time Latin became the common language?</cite>  \nExactly the opposite is true. Latin was the language of the empire until the creation of the Roman Empire in the East, which we call Byzantine. The movement of the political centre eastwards started with Diocletian, who after two centuries of Roman decline split the command structure, appointing a second Augustus and two Caesars; it continued with the building of Constantinople (called 'Nova Roma') by Constantine, who forced the Eastern cult of Christianity onto his empire, but who himself spoke hardly any Greek. Soon, though, Byzantines forgot their Latin, calling their emperor Basileus kai Isapostolos, king and equal of the apostles, in a thoroughly Persian variety of quasi-divine chiefdom, than which nothing could by less Modernist. In the West Latin became first a variety of barbarian peoples' creoles and then, in very much post-Classical form, a lingua franca for scholarship. Ciceronian Latin was only resurrected in the Renaissance, which development one might fairly call Modernist in the expansive Hrantian sense.\n\nThe Roman alphabet of capitals was based on the Etruscan, not directly on the Greek. The Roman cursive - quite different from the monumental capitals - gave rise to various forms of uncial, which gave rise eventually to Carolingian miniscule, which became the humanists' lowercase.\n\n<cite>I think Hrant was referring to when the ancient Romans — the Humanists — decided to use the Latin alphabet to more accurately portray the text of the philosophers.</cite>  \nThe humanists were Italians of the Renaissance, not ancient Romans. They did indeed accept the need to represent, as Erasmus said, Latin words by Latin elements, but they didn't realise that the MSS they were copying were Carolingian miniscule. [Of course you know that perfectly well Tiffany.]\n\nThe idea that Romans were Modernist and absolutist, the Greeks pragmatists, is just nonsense. Compare Plato's Republic with Horace, for instance, and you'll find that if anything the opposite was true - though really this sort of caricature gets nowhere, not least because both were culturally very various over time and space. If you want real absolutism, look at Sparta. Even in lettering, the Romans were perfectly pragmatic, having a number of forms of their alphabet for different purposes. Serifs made letters more durable and more beautiful on monumental caps, but they weren't used in handwriting. Admittedly they wrote upwards with their reed pens, a refusal of concession to their materials which I think demonstrates a virtuous desire to slow down and take pains over something important and, of course, costly.\n\n"
    },
    {
      "time": "16 Mar 2006 — 2:09pm",
      "content": "On the Etruscan connection, check out one of my favorite books:\n\nDavid Sacks' _Letter Perfect: The Marvelous History of Our Alphabet From A to Z_\n\n"
    },
    {
      "time": "16 Mar 2006 — 2:27pm",
      "content": "_The humanists were Italians of the Renaissance, not ancient Romans. They did indeed accept the need to represent, as Erasmus said, Latin words by Latin elements, but they didn’t realise that the MSS they were copying were Carolingian miniscule._\n\nGeorge, that's what I was saying. I think you misunderstood me.\n\n"
    }
  ]
}
