{
  "id": "1852",
  "title": "My first typeface ever!",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello girls and boys!   \n   \nI am new to this forum and very glad having found it! I´m a graphic design student and i´ve been a bit of a font freak lately. So I tried making one of my own (i know it´s not highly original, but anyhow). If the font turns out ok, it´ll probably be used as a font for a national media arts students´ festival here in Finland. Here is a sample of the outcome so far:   \n   \n [http://www.kyamk.fi/~vi9gvisa/testi.gif](http://web.archive.org/web/20150414212613/http:/www.kyamk.fi/~vi9gvisa/testi.gif)  \n   \nWhat do you think of it? Any feedback is highly appreciated!\n\n",
  "author": "helle",
  "time": "4 Aug 2002 — 3:22pm",
  "uid": "846",
  "comments": [
    {
      "time": "4 Aug 2002 — 11:06pm",
      "content": "Nice work!   \n   \nI like the curved diagonals on the upper case. I'd like to see it applied to the uc \"K\" as well.   \n   \nI also really like the numerals, especially \"2\" and \"5\".   \n   \nBoth uc \"Z\" and lc \"z\" look a bit top-right-heavy. Try extending the lower stroke just a bit to balance them.   \n   \nDavid\n\n"
    },
    {
      "time": "4 Aug 2002 — 11:59pm",
      "content": "Thanks! Good points, one and all, David. I will certainly take these suggestions into consideration.   \n   \nHere´s an list of Characters I also think I need to work with (let´s see if you guys agree with me):   \n   \nUC:   \n   \nJ needs to be condensed a bit   \nYes, K, (I hurried a bit on that one), needs a whole new form... something in style of the R.   \nQ´s tail needs to be extended a bit   \n   \nLC:   \n   \nDefinitely the ´f´. It Seems to create too much negative space. On the right.   \n   \nNUMERALS:   \n   \nAll numerals should maybe have a same kind of twist as that of number 5´s. Or should they?   \n8´s lower part should maybe be heavier than the upper part.   \n   \nSo what do you think?\n\n"
    },
    {
      "time": "5 Aug 2002 — 12:01am",
      "content": "Almost forgot... there´s something seriously wrong with the lower-case k, I think...\n\n"
    },
    {
      "time": "5 Aug 2002 — 12:19am",
      "content": "I like it... But the uppercase \"R\" looks top heavy and almost leaning to the right. And yeah, the \"K\" needs work.\n\n"
    }
  ]
}
