{
  "id": "18539",
  "title": "Font Explorer 1.0",
  "forum": "Build",
  "tags": [

  ],
  "content": "Has anyone else tried to install or upgrade to [FEX](http://web.archive.org/web/20080924105242/http:/typophile.com/wiki/FontExplorer%252BX) 1.0? I just did and it errored out after relaunching while updating the database. I can’t get it to run at all now. I’m trying to figure out if this is something others are experiencing or not. (I did submit a bug report.)\n\n [‹ Opentype features take a vacation with one font using FL5 Mac](http://web.archive.org/web/20080924105242/http:/typophile.com/node/29469 \"Go to previous forum topic\") [Fontographer 4.1 installation problem ›](http://web.archive.org/web/20080924105242/http:/typophile.com/node/29515 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080924105242/http://typophile.com/user/1043\" title=\"View user profile.\">Mark Simonson</a>",
  "time": "<br>",
  "uid": "1043",
  "comments": [
    {
      "time": " 14.Mar.2006 1.46pm",
      "content": "Mark, did you try to update from the Beta-Version (through the “Check for Update” command in the program menu) or did you download the file and run the installer?\n\nI updated via the program, so I can’t give any direct advice about the normal installation process yet. If you delete the files and the program preferences in the library, and then reinstall, you might be clean. I’m at home right now (its 10:30 pm here), but I can try to get a better answer for you tomorrow at work.\n\n"
    },
    {
      "time": " 14.Mar.2006 2.18pm",
      "content": "I updated this morning via the prompt and haven’t had any problems...yet.\n\n"
    },
    {
      "time": " 14.Mar.2006 2.27pm",
      "content": "Earlier this afternoon, I ran what I think was the most recent beta version (it’s gone now, so I don’t know exactly) and I got an announcement message saying that 1.0 was out and would I like to install it. Never had a problem with the live install before, so I clicked okay. After it downloaded and installed 1.0, it launched 1.0 and the rest is as I’ve described.\n\nIt is possible it’s something specific to my system. I was having some strange disk behavior which I fixed (or at least I think I fixed) this morning. It’s possible it is related to that. But the previous version (whatever it was) was running fine after the disk repairs as far as I can tell. In other words, I did the upgrade after after having done the disk repairs.\n\n"
    },
    {
      "time": " 14.Mar.2006 2.46pm",
      "content": "Have you tried deleting and re-installing?\n\n"
    },
    {
      "time": " 14.Mar.2006 2.50pm",
      "content": "No. Looks like that’s what I’ll have to do, though. Thanks.\n\n"
    },
    {
      "time": " 14.Mar.2006 3.06pm",
      "content": "Dan, can you say something about the windows version? Seems the things dont go well in this case.\n\n— [astype.de](http://web.archive.org/web/20080924105242/http:/www.astype.de/)—\n\n"
    },
    {
      "time": " 14.Mar.2006 3.26pm",
      "content": "Andreas, there is no FontExplorer X version for Windows yet. It will be available in a few more months.\n\nThe link of the right-hand side of the [page](http://web.archive.org/web/20080924105242/http:/www.linotype.com/fontexplorerX) for “FontExplorer 2.1” is to the old **FontExplorer** (notice the lack of the “X” in the name) stand-alone database application that sorted through Linotype’s fonts based on subjective criteria. That is still available for PC and OS 9, but it IS NOT **FontExplorer X**! **FontExplorer X** is the new free font manager from Linotype.\n\nTo repeat, FontExplorer X for Windows in coming soon. Just a few more months.\n\n"
    },
    {
      "time": " 14.Mar.2006 4.01pm",
      "content": "Dan,\n\nI think the press release may be contributing to the confusion - although it mostly refers to the tool as FontExplorer X the opening title and initial mentions don’t use the X\n\n[http://www.linotype.com/19422/pdf/pressreleases/FontEx\\_release1.0\\_e.pdf](http://web.archive.org/web/20080924105242/http:/www.linotype.com/19422/pdf/pressreleases/FontEx_release1.0_e.pdf \"http://www.linotype.com/19422/pdf/pressreleases/FontEx\\_release1.0\\_e.pdf\")\n\nCheers, Si\n\n"
    },
    {
      "time": " 14.Mar.2006 4.37pm",
      "content": "I have the FontExplorer X Version 1.0fc4 (Build 1A005), and when I check for updates, it says I am running the latest version. Is the new release newer than mine? I assume it is, but don’t want Mark’s problems.\n\n—K\n\n"
    },
    {
      "time": " 14.Mar.2006 6.26pm",
      "content": "Pff. No worries here mate. What a bloody neat program!  \n—K\n\n"
    },
    {
      "time": " 14.Mar.2006 9.47pm",
      "content": "Kris, the newest release is newer that 1.0fc4—that was the last public beta build. Try looking for updates again. Maybe it was a time zone thing? If you still don’t get upgrades, just go to this page and download the new version. It should replace the old one.\n\n[http://www.linotype.com/fontexplorerx](http://web.archive.org/web/20080924105242/http:/www.linotype.com/fontexplorerx \"http://www.linotype.com/fontexplorerx\")\n\n"
    },
    {
      "time": " 14.Mar.2006 10.24pm",
      "content": "What a lovely app. I upgraded with no problems as well.\n\n"
    },
    {
      "time": " 15.Mar.2006 6.13am",
      "content": "All is well again. I received a tiny database fixer application from Linotype in this morning’s email. Took about two seconds for it to do its thing and it worked like a charm. (Fortunately, I hadn’t gotten around to reinstalling FEX yet.)\n\n"
    },
    {
      "time": " 15.Mar.2006 9.48am",
      "content": "This app has gotten me to give up MasterJuggler. Still don’t like that deleting fonts from the app, deletes them from your hardrdrive. What sold me was the Clean Font Cache tools.\n\nI upgraded with no problem. Maybe Mark’s problem is Minnesota specific!\n\n"
    },
    {
      "time": " 15.Mar.2006 10.05am",
      "content": "Deleting fonts from FontExplorerX deletes them from your hard drive?\n\nI have been struggling along with Suitcase and am considering changing our computers at work over to FontX. I’ve done some experiments at home and am not totally satisfied (is there anything satisfying about OSX font management?) but am really tiring of Suitcase.\n\nIf the answer to the first question is yes, there’s an obvious workaround that won’t stop me, but I need to know in order to set it up correctly.\n\nthanks  \npeace\n\n"
    },
    {
      "time": " 15.Mar.2006 10.43am",
      "content": "FontExplorerX gives you the option of deleting them immediately or moving them to the trash. A very big problem for an otherwise excellent app.\n\n"
    },
    {
      "time": " 15.Mar.2006 10.57am",
      "content": "Thanks for the answer. That’s a shame. The workaround seemed obvious when I conceived it, but on further thinking it is a little more pain than I bargained for…  \npeace\n\n"
    },
    {
      "time": " 15.Mar.2006 11.01am",
      "content": "For designers — not type designers — I would suggest allowing Font Explorer to copy the fonts when you put them into the library. I do this. I have my organized fonts, and then I have my font explorer database. So, heaven forbid, on those days when I irrationally delete things I can always put them back.\n\nHowever, I can see how this could be a little more messy for type designers as they are working through various REVs in font designing.\n\n"
    },
    {
      "time": " 15.Mar.2006 11.26am",
      "content": "I was going to say more or less the same thing. I’ve had it set up this way for so long that I forgot that it worked any other way. I have my font library external to FEX. When I move fonts to FEX so they can be activated, the original is still in my library. So it’s no big deal to me if FEX deletes a font. I use that function when I no longer want to manage a font with FEX. It simply doesn’t have a copy in its own library anymore.\n\n"
    },
    {
      "time": " 15.Mar.2006 11.26am",
      "content": "Regading FontExplorerX for Windows,\n\n“coming soon on PC” info on the Linotype website was there for more than few months and now Dan is saying “a few more months”. I find it really misleading…I’d rather Linotype kept it secret that Windows version will be available or just say “expected to be released in 2007” or something like this….\n\nSorry I had to vent my frustration, I hate the elusive “soon” wording many companies use.\n\n"
    },
    {
      "time": " 15.Mar.2006 11.41am",
      "content": "Makes sense, Miss Tiffany and Mark S., although my anal retentive self is roiling…\n\nDoes it have any kind of font checking? Since I have Suitcase, of course I have Font Doctor. I don’t believe it finds everything since I seem to be having “difficulties”. If not, is there something more thorough?\n\npeace\n\n"
    },
    {
      "time": " 15.Mar.2006 12.10pm",
      "content": "Jennifer, as I’m sure you know, software development is time consuming, and testing always brings up new surprises. I’m not in tune with the exact schedules of the Windows development, but I suggest resting assured. Coming soon means soon; in a few months. Like Adam Twardoch says when asked about FontLab releases, it will be released when it is ready ;-)\n\n"
    },
    {
      "time": " 15.Mar.2006 1.32pm",
      "content": "FEX has conflict checking. I still have Font Doctor for when I want to split families or am really worried. But I haven’t opened it since installing FEX except to split families up.\n\n"
    },
    {
      "time": " 15.Mar.2006 2.21pm",
      "content": "I agree: I think it’s better to release applications when they’re ready rather than earlier.\n\nA.\n\n"
    },
    {
      "time": " 15.Mar.2006 3.23pm",
      "content": "I was running FontExplorer during the Beta versions and gave it up because it took forever to render my fonts. Is this still a problem with the new X version for Mac. It really bothered me that when I just wanted to scroll through all my fonts one by one using the arrow keys, that sometimes with the larger families there would be a huge lag of time in between switching while it was rendering the face on screen. Maybe I will switch back if someone has some good news about that issue on this thread, otherwise its a no go for me.\n\n"
    },
    {
      "time": " 15.Mar.2006 3.30pm",
      "content": "thanks Miss T…  \npeace\n\n"
    },
    {
      "time": " 16.Mar.2006 6.01am",
      "content": "SUPER SERVICE\n\nFellas I tried updating mine too and had the same error, but when the mac asked me if I wanted to report the error - I did - and wrote my e-mail - and only 4 hours later I got an e from linotype ind germany - with a fix-it file... Jesus what a superservice - and for a free program too...\n\nLOVE IT! SERVICE IS THE WAY TO SUCCES\n\nMark  \nDenmark\n\n"
    },
    {
      "time": " 16.Mar.2006 6.32am",
      "content": "I’m sure my fix would have come just as quickly, but for the time zone difference. Since it happened in the afternoon here in the U.S., the Linotype people over in Germany would have left work for home hours earlier. Still, I’m very happy with their response.\n\n"
    },
    {
      "time": " 16.Mar.2006 7.08am",
      "content": "I had the same database problem that Mark reported and was sent the same fix.\n\nSince there are a few people now reporting that issue, wouldn’t it make sense for Linotype incorporate the database fixer into the installer? Or even better, have the installer just automatically do whatever the database fix is on installation?\n\nStill, I love the program.\n\n"
    },
    {
      "time": " 16.Mar.2006 2.19pm",
      "content": "No problems here on the update.\n\nFEX...top pick for 05/06. love it\n\n"
    },
    {
      "time": " 13.Nov.2006 9.14pm",
      "content": "This is a bit of a ressurection, but I’m having issues with FEX and the InDesign CS2 plug-in. It’s causing random files to crash INDD upon launch. I believed that they were corrupt files somehow, but was informed by a friend that the auto activation plug-in prevented him from opening any files. This solved my problem. Who should I report this to? Is there anyone on the board that might lend an ear?\n\n"
    },
    {
      "time": " 14.Nov.2006 1.18am",
      "content": "A colleague of mine had the same problem but it was only with one file. I don’t know was it the font or the document that caused the plugin to crash Indy. You could report from the program. Help -\\> Send bug or feedback….\n\n"
    },
    {
      "time": " 14.Nov.2006 11.05pm",
      "content": "I have the same issue with fex and indcs2. I tried contacting linotype support about it and they just gave me a new version of the plug-in, it didn’t solve the problem. Turning off auto-activation didn’t help. I’ve been working around this by closing fex whenever i open an indesign file. It’s a huge pain. Lately, Indesign has been forcing fex to launch when I open one of the buggy files. I’m hoping to have our IT department do a clean install of indesign, fex, and my type library but I’d love to know if there’s a real solution to this.\n\n"
    },
    {
      "time": " 15.Nov.2006 8.28am",
      "content": "Perfect, just around the time that I really do need to upgrade to CS2 I see this thread come up again. That is a serious issue if you can’t have your fonts working with InD and FEX. How else do you activate them when you are working on a file jackson if you have FEX closed?\n\n"
    },
    {
      "time": " 15.Nov.2006 9.04am",
      "content": "Two thoughts that might not help at all:\n\n1) When was the last time you used the ’Tools’ pull-down menu? There are some maintenance tools that could help. (Read the instructions first.)\n\n2) When was the last time you deleted the font cache off of your machine? I recommend [Font Finagler](http://web.archive.org/web/20080924105242/http:/www.versiontracker.com/dyn/moreinfo/macosx/22795).\n\nMaintaining the font collection is really important. You’d be surprised how easily it can become full of gunk.\n\n"
    },
    {
      "time": " 15.Nov.2006 11.14am",
      "content": "I would activate all my neccessary fonts before closing fex and opening the file. The scan for fonts feature is really nice.\n\nI usually keep on top of my font caches once a week.\n\nIt turns out the problem was most likely indesign. We did a clean install this morning and everything runs fine now.\n\nThanks everyone.\n\n"
    }
  ]
}
