{
  "id": "18546",
  "title": "How to kgreenlandic / kra",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Is it usefull to use a common small cap letter K for the glyph \" [kgreenlandic](http://web.archive.org/web/20120424142818/http:/typophile.com/wiki/kra)\" (uni0138)? Due to the fact most small caps are a bit higher than the common x-high, should this K have the same x-high?\n\nHave anyone real world examples of the usage of this glyph? Is it used on the beginnigs of words only?\n\n[http://www.fileformat.info/info/unicode/char/0138/index.htm](http://web.archive.org/web/20120424142818/http:/www.fileformat.info/info/unicode/char/0138/index.htm \"http://www.fileformat.info/info/unicode/char/0138/index.htm\") -  \n [http://www.eki.ee/letter/chardata.cgi?ucode=0138](http://web.archive.org/web/20120424142818/http:/www.eki.ee/letter/chardata.cgi?ucode=0138 \"http://www.eki.ee/letter/chardata.cgi?ucode=0138\")\n\n",
  "author": "andreas",
  "time": "14 Mar 2006 — 3:03pm",
  "uid": "655",
  "comments": [
    {
      "time": "14 Mar 2006 — 4:26pm",
      "content": "if i'm not mistaken, modern orthography favors the use of \"q\" instead of the \"greenlandic k\".\n\n[http://en.wikipedia.org/wiki/Kra\\_%28letter%29](http://web.archive.org/web/20120424142818/http:/en.wikipedia.org/wiki/Kra_%28letter%29 \"http://en.wikipedia.org/wiki/Kra\\_%28letter%29\")\n\nwhen making the greenlandic k, i usually use the stem of the n and the arms of the k.\n\n"
    },
    {
      "time": "14 Mar 2006 — 7:08pm",
      "content": "The Greenlandic kra is a lowercase letter with no uppercase form. It should conform to the proportions of the lowercase letters and be x-height tall. The serif treatment of the top of the left stem is best harmonised with that of the corresponding serif on the lowercase u (note that this is often flatter than the serif on the n to which Paul refers). The right side may be identical to that of the k, but if the latter is particularly jaunty you may want something more stable for the kra, as in Minion Pro:\n\n ![](http://web.archive.org/web/20120424142818im_/http:/typophile.com/files/ikrak.png)\n  \nThe Kalaallisut orthography was reformed in the 1970s, and kra is now considered obsolete. However, it may occur in older documents whose spelling needs to be preserved when digitised, so the character remains useful. Also, it is quite easy and hence fun to make. \n"
    },
    {
      "time": "15 Mar 2006 — 2:19am",
      "content": "Thank you both for your corrections.\n\n-- [astype.de](http://web.archive.org/web/20120424142818/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "15 Mar 2006 — 3:07pm",
      "content": "Thanks John - this is the truly new and really interesting thing I learned today. Chris Mitch.\n\n"
    },
    {
      "time": "3 Apr 2006 — 11:55am",
      "content": "\\> if the latter is particularly jaunty you  \n\\> may want something more stable for the kra\n\nReally? I would have thought the opposite - that it's a  \ngreat opportunity to add some flava. Like what about  \nthat decidedly jaunty one on the Unicode site?\n\nhhp\n\n"
    }
  ]
}
