{
  "id": "1854",
  "title": "Pixietype suspiciousTechnique",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hola Amigos,   \n   \nI have a theory about this situation, discussed in the Build Forums, on a couple of weeks ago   \n   \nI receive an email from Hugo Perez from the pixietype foundry announcing new fonts with grey effects.   \n   \nI was trying to contact him about a month ago,   \nasking about if they have an authorization from FFF or truth in Design for using the FX technique who was created and owned by Truth in Design, who is the same as super pixel fonts, Whith no responses.   \n   \nI can`t understand why pixietype are selling, if they lauch before FFF first super pixel fonts, it seems they are making the same super pixel stuff without autorization, this behaviour is very suspicious.   \n   \nIt seems that they buy a font form FFF,open in fog, and make the same technique, just changing the name. This is not fair, there are a lot of job behind this new greyscale trick, and this guys seems to non stop, without giving any credits or licence fee to TiD.   \n   \nPlease tell me what do you think about this topic Typophiles, i dont want to be rude with pixietype or Hugo, but i believe in respect of the job behind this technology contribution in typography.   \n  \n   \nRegards,   \n   \nmh.\n\n",
  "author": "Miguel Hernandez",
  "time": "28 Oct 2003 — 9:30pm",
  "uid": "1109",
  "comments": [
    {
      "time": "28 Oct 2003 — 9:41pm",
      "content": "But weren't you previously saying that TiD's \"technology\" was no big deal, not a real invention?   \n   \nCertainly, if Pixietype _did_ swipe the technology (but how can you be sure?) without even giving credit, it's unethical. But without a patent on the part of TiD, it's not illegal. And if they just had the idea of making grayscale fonts by filling in \"partial\" pixels, and they developed their own techniques to do so, it's probably OK.   \n   \nBottom line for me: if we become certain that Pixietype has indeed behaved unethically, we should mount a petition campaign. Otherwise it's more productive to spend the time pushing the envelope further. Handmade ClearType bitmaps, anyone? :-)   \n   \nhhp\n\n"
    },
    {
      "time": "29 Oct 2003 — 3:15am",
      "content": "All I have to say about them is, they did a bunch of designs I was looking forwarding to doing. So too bad for me. If they have ACTUALLY copied FFF designs they should be publicly exposed and pilloried.   \n   \nAs far as the tech, we did it first, they figured we would not come after them. they are right.\\*   \nInstead:   \n   \nIn September TiD will launch a new library of original fonts guaranteed to work in Flash and Photoshop.   \n   \nMore official leaks soon.   \npeace please.   \n-chris   \n   \n\\*Unlike other protections, a patent can be enforced on demand.\n\n"
    },
    {
      "time": "29 Oct 2003 — 3:22am",
      "content": "forwarding haha looking forward.   \nSeriously, Dodge Text Bold FX is nice, like apple's Chicago on grey.   \n   \nstealers!   \n-chris\n\n"
    },
    {
      "time": "29 Oct 2003 — 6:21am",
      "content": "Even on a CRT monitor, some grey pixels are hard to notice...   \nAnd I think I still prefer the plain versions, specially in text-sizes.\n\n"
    },
    {
      "time": "29 Oct 2003 — 6:48am",
      "content": "This appears to be nothing more than hand-made anti-aliasing. I was doing that in 1988 with Dr. Halo (anyone remember Dr. Halo!? ;o)   \n   \nSo I'm suing all of you.\n\n"
    },
    {
      "time": "29 Oct 2003 — 7:30am",
      "content": "\\> In September TiD will launch a new library   \n   \nAlong with a time-reversal machine? ;-)   \n   \n\\> Does the gray have much impact on LCD displays?   \n   \nYou can design for LCDs or CRTs (the latter needing less \"splay\" in the grays), or try to average out both. Same with Windows/MacOS (the latter having a much flatter gamma). I lean towards the former for both.   \n   \n\\> I was doing that in 1988   \n   \nA number of people have done it in the past (like de Groot, and Tankard), but there was no good way of _delivering_ it to users. MacOS for one totally ignores bitmaps (except when it crashes trying to display them).   \n   \nhhp\n\n"
    },
    {
      "time": "29 Oct 2003 — 2:36pm",
      "content": "No way ... Dr. Halo the 8 bit DOS paint package ... darrel you are way ahead of the game. ;]   \n   \nA lot of people aren't going to like the look or idea of greyscale pixel fonts. Pixel crispness/crunchiness is a blessing/curse.   \n   \nWith the TiD system, the fine tuning is up to the typographer. You can tweak \"splay\" in ClearType, MacOS and FreeType, but tuning is basically cooked into Super and Ultra Pixel fonts and anything else using the subpixel technique. If it's well-cooked, fewer people will want to adjust the knobs.   \n   \n\\> \\> In September TiD will launch a new library   \n\\> Along with a time-reversal machine? ;-)   \n   \nmake that November. Somebody give me a brain!   \n   \nI wrote this cause my email reply to this forum never showed up. If it does, see \"brain\".\n\n"
    },
    {
      "time": "30 Oct 2003 — 8:53am",
      "content": "Hi,   \nFirst of all, english is not my original language so, sorry.   \nAll I do is add quarter and eighth pixels to a standard pixel font. You can call it 'pixel font with greys' or 'hand made anti aliasing'.   \nChris Lowery said in another post: \"\"Super Pixel fonts\" describes a patent pending technique which provides reliable rendering on all TrueType environments. Your grey dot fonts will probably be great but they won't be \"Super Pixel fonts\" unless you license with us and build them like we do. Hrant is right, it takes more than sub-pixels.   \n   \nAll I do is sub-pixels. I DO NOT use the technology that TiD have. So I don't do Super Pixel Fonts.   \nI DO NO WANT to break any law, do something illegal or steal any technology.   \nIf I'm doing this, sorry, I'll stop selling fonts with semi-pixels, sub-pixel or whatever you want to name it.   \n   \nThanks   \nHugo Perez   \nPixietype.com\n\n"
    },
    {
      "time": "30 Oct 2003 — 9:56am",
      "content": "Hugo, thanks for your comments. Please look for my response on your pixietype info address.   \n   \nAny developer who wants to create sub-pixel fonts can get support, licensing, and a good royalty through TiD's new site, which will launch in November. You do not need to know how to create sub-pixel fonts, only to paint all the characters in a GIF. TiD handles the rest. We will publish great fonts from anyone.   \n   \nTo become a licensed developer, contact me through typophile or truth @ truthindesign.com. I apologize for this use of Typophile for commercial information.   \n   \n-chris\n\n"
    },
    {
      "time": "29 Oct 2003 — 5:50am",
      "content": "On my Powerbook screen the FX fonts are nearly identical   \nto the standard versions. Does the gray have much impact   \non LCD displays? Anyone else with an LCD who can confirm?\n\n"
    }
  ]
}
