{
  "id": "18555",
  "title": "Sans to compliment Lubalin Graph Bold",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hello,\n\ni am after a modernish sans that would sit well as a body type in connection with Lubalin Graph. The bold weight was the basis for the company's logo and a medium weight is used for department names below.\n\nI appreciate any suggestions,\n\nseb\n\n",
  "author": "all about seb",
  "time": "15 Mar 2006 — 6:45am",
  "uid": "7285",
  "comments": [
    {
      "time": "15 Mar 2006 — 7:08am",
      "content": "Lubalin Graph is a serif version of Avant Garde--you could use that. Now that I think about it, I can't recall them being used together, though.\n\n"
    },
    {
      "time": "15 Mar 2006 — 8:47am",
      "content": "As Mark suggests, the natural compliment to Lubalin Graph would be a geometric font with a giant x-height, but that doesn't suit body copy so well. Consider Avenir, [Proxima Nova](http://web.archive.org/web/20141020182959/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=proxima%20nova), or [FF Super Grotesk](http://web.archive.org/web/20141020182959/https:/www.fontshop.com/showfont.cfm?fid=FF.11133.0.0).\n\n"
    },
    {
      "time": "15 Mar 2006 — 8:47am",
      "content": "I was about to say... Avant Garde and Lubalin Graph might complement each other.\n\nOr anything else with a very round, geometric design.\n\n"
    },
    {
      "time": "15 Mar 2006 — 8:48am",
      "content": "Here's something I did a while back using said typefaces, the combination of these two was quite common a couple of years ago in UK magazine design, e.g. Graphik magazine\n\n"
    },
    {
      "time": "15 Mar 2006 — 8:49am",
      "content": "Sorry guys, how do I attach a pdf or jpeg to my post?\n\n"
    },
    {
      "time": "15 Mar 2006 — 8:53am",
      "content": "Do you see the \"Insert image\" link below the comment field? If not, you probably don't have Flash 8 installed. [http://typophile.com/node/18067](http://web.archive.org/web/20141020182959/http:/typophile.com/node/18067 \"http://typophile.com/node/18067\")\n\n"
    },
    {
      "time": "15 Mar 2006 — 8:59am",
      "content": "got it, thanks\n\n ![](http://web.archive.org/web/20141020182959im_/http:/typophile.com/files/bright%20brown%20brochure.jpg)\n\n"
    },
    {
      "time": "15 Mar 2006 — 10:37am",
      "content": "Yeah, Lubalin Graph, while not _ideal_ for long copy, is better than Avant Garde at that size.\n\n"
    },
    {
      "time": "15 Mar 2006 — 11:35am",
      "content": "I hate the huge x height it makes the text unreadable.\n\n"
    },
    {
      "time": "15 Mar 2006 — 12:54pm",
      "content": "FWIW, I don't think it's the large x-height that makes AG and LG harder to read, it's the monotonous geometry. The other problem is the high contrast between the size of the counters to the size of the sidebearings. LG fares a bit better because the serifs push the characters apart some.\n\n"
    },
    {
      "time": "15 Mar 2006 — 3:20pm",
      "content": "Herb Lubalin - when I was a lad - but then \\_ [http://www.graphic-design.com/Type/Avant/Avant2.html](http://web.archive.org/web/20141020182959/http:/www.graphic-design.com/Type/Avant/Avant2.html \"http://www.graphic-design.com/Type/Avant/Avant2.html\") says it all. They are not used together because they would very rarely work together. Use a cursive/italic/anything else to make it happen.\n\n"
    },
    {
      "time": "16 Mar 2006 — 11:54pm",
      "content": "Thanks for all your info & suggestions. Wasn't aware of the relationship between AG & LG - very interesting. So, I toyed a little with AG as a body type and it is not exactly pleasing... hmm. Guess, i have to experiment some more. Btw, Chris thanks for your AG link - nice article.\n\nIf there are any more suggestions please keep them coming!\n\n/seb\n\n"
    },
    {
      "time": "17 Mar 2006 — 4:30am",
      "content": "I don't know if any of my faces are good for this one? Have a look at;\n\n[http://www.macrhino.com](http://web.archive.org/web/20141020182959/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\n"
    },
    {
      "time": "17 Mar 2006 — 8:30am",
      "content": "Pardon my pedantry, but it seems that every time people talk about a face working well with another they say \"compliment\", when it should be \"complement\".\n\n\\*\\*\\*\n\nIt's a tall order to ask any face, especially a sans serif, to work as text with medium and bold weights of LG, without being overpowered. Perhaps Antique Olive or Eras.\n\n"
    }
  ]
}
