{
  "id": "18566",
  "title": "type in photoshop argument",
  "forum": "Build",
  "tags": [

  ],
  "content": "Ok, here is the deal. I’m a production artist for a smaller agency. SInce I’ve always worked in smaller venues I’ve never had what I would call a highly experienced person to teach me. Maybe one, but mostly I’m self taught. I’ve long been under the impression that photoshop was for images, illustrator was for vector and indesign was for page layout. I have done my type in either illustrator or indesign (indesign if more than one page is needed) and while photoshop has the ability to do type I stay away from it.  \nNow the creative director and I get into arguements about where type should be done, all the creatives build their files in photoshop because that is what they are used to and in his mind so long as the files are 300ppi and cmyk they are good to go to print. I disagree. Am I wrong? The whole reason I was hired is because the files have been problematic at the printer. I’ve fixed that but now it seems I have to justify my process.\n\nIf you have time please give me a short explaination on how you guys build final files.\n\nThanks,  \nPete\n\n [‹ Bitmap underscore question](http://web.archive.org/web/20070808234839/http:/typophile.com/node/18480 \"Go to previous forum topic\") [OT - Multiple swash alternates ›](http://web.archive.org/web/20070808234839/http:/typophile.com/node/8938 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070808234839/http://typophile.com/user/12010\" title=\"View user profile.\">peteberta</a>",
  "time": "<br>",
  "uid": "12010",
  "comments": [
    {
      "time": " 15.Mar.2006 11.43am",
      "content": "If you have time check the “Prepress” link under “Theory” :  \n [http://www.bilkent.edu.tr/~segalini/bibliography-GD.html](http://web.archive.org/web/20070808234839/http:/www.bilkent.edu.tr/~segalini/bibliography-GD.html \"http://www.bilkent.edu.tr/~segalini/bibliography-GD.html\")\n\n"
    },
    {
      "time": " 15.Mar.2006 12.03pm",
      "content": "Alessandro, that is an excellent guide (the one by Sappi).\n\nI used to work at a book publisher, and I remember when my boss showed us printer proofs (or tear sheets, I can’t remember which it was now)where a serif typeface had been used on a book cover, and the type had been set in Photoshop. Of course, the edges were not very crisp, as they would have been in Quark or InDesign..Sans-serif, though, doesn’t suffer (as much).\n\nHopefully you can show your boss that even though images look fine at 300dpi, text doesn’t. If I remember correctly, text should be printed around 1200 dpi or more.\n\n"
    },
    {
      "time": " 15.Mar.2006 3.00pm",
      "content": "Hi Pete, if you are talking cover design do your type in Illustrator. Incorporate it with Photoshop files for images. That’s only for starters - there are effects you can apply to headlines in PhotoShop that you can’t emulate easily in Illustrator - but for most type, PhotoShop is clumsy. And then of course there’s Quark. For text you can’t beat it.\n\n"
    },
    {
      "time": " 15.Mar.2006 3.35pm",
      "content": "IMHO\n\n**For files with minimal type** : With PhotoShop CS it is now possible to have a vector layer and save the file as an EPS saving the vector information. However, if you flatten the file, your type becomes nothing more than pixels and you lose the crispness, even if you are working at 300 dpi you it is still aliased and so not as crisp as the type could be if left on a vector layer or done in Illustrator or InDesign. If you are applying filters and trickery to the type then, of course, you need to do it in PhotoShop and can’t get around the aliasing.\n\n**For files with more than a few words** : If you do more than a few words in Photoshop, you are wasting time.\n\n"
    },
    {
      "time": " 15.Mar.2006 3.57pm",
      "content": "I’m with Miss Tiffany, although I would expand that to a few lines if need be. Write an EPS and preserve vector. Do not reopen it in Photoshop, it will rasterize. I work in newspapers a lot so I have no problem Distilling the EPS although it makes the type a little bolder (Is that because the hinting is destroyed?). I keep that in mind when I’m designing.\n\nThe type on things I do is very minimal, just headlines and taglines and maybe a small bit of information. Anything more than this is in Photoshop is lunacy.\n\nI have also done match prints comparing rasterized type and logos (300ppi and up) with vector, same layout. Looking very closely I can see the difference but showing it to ordinary folks around the office they could not tell at all. Not that I am advocating this…\n\nBut - I do send flattened TIFFs to one national magazine due to their track record of managing to make embedded fonts in PDFs from ID look pixelated.  \npeace\n\n"
    },
    {
      "time": " 15.Mar.2006 6.04pm",
      "content": "It all depends on the project AND how well you really know your stuff. My day job is at a printing company, so I see a lot of projects come in in a lot of different ways: sometimes they work, sometimes they don’t...\n\nOn one particular job, a “designer” sent us files for a four-color brochure done entirely in Photoshop. Unfortunately, this “designer” did not allow for bleeds OR creep, the project needed both, and all of the pages had screened-back images as backgrounds. Needless to say, it took a considerable amount of effort to make this garbage printable.\n\nOn the other hand, if you DO know what you’re doing, and DO allow for bleeds and such, there is one incontrovertible fact in the boss’s argument: rasterized type does not rewrap, drop out or get substituted. On the third hand, rasterized type doesn’t overprint and can cause registration problems if it’s composed of more than one color. On the fourth hand, Photoshop can really add a lot of visual interest to headline type with no additional overhead.\n\nI hope that this clears things up...\n\n"
    },
    {
      "time": " 16.Mar.2006 7.03am",
      "content": "Thank you all for the response. Everyone in my department will now have a copy of the Sappi manual, I had seen that once before and sort of forgot about it so thanks for the link.  \nI am by no means the worlds greatest PA but I do know what I am doing and your replies confirm the fact that I do know what I am doing and have learned correctly.\n\nLuckily I have now been on both ends. I’ve been the guy who has to try and print the “garbage”. While it was mostly a digital press I still needed to create bleed where none was given and make sure I did not mess up any type. Now that I am the guy creating those files I do what I can to make it streamlined for the printer and less of a headache for me.\n\nI have a feeling I’ll learn a lot here. So again thanks.\n\n-Pete\n\n"
    }
  ]
}
