{
  "id": "18565",
  "title": "Personal Logo - Critique Welcome",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "This is my first posting here and I am quite anxious to get involved with the community! Our instructor directed us here and I’ve actually gathered a great deal of information just reading in the forums.\n\nI’ve definitely moved a to a more confident feeling of my own designs, and I wanted to get some critique on my own personal logo that I will be using for my own freelance work.\n\nThis is the first work I’ve actually posted beyond the critique outside my own peers and instructors, and I am definitely looking forward to getting some feedback on it.\n\nThanks!\n\nCharles\n\n ![](http://web.archive.org/web/20080118114751im_/http:/www.typophile.com/files/cadlogo.jpg)\n\n [‹ girl underwear factory](http://web.archive.org/web/20080118114751/http:/www.typophile.com/node/18732 \"Go to previous forum topic\") [Fever City Studio, LLC (logo&type) ›](http://web.archive.org/web/20080118114751/http:/www.typophile.com/node/18646 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080118114751/http://www.typophile.com/user/12006\" title=\"View user profile.\">Charles Askew</a>",
  "time": "<br>",
  "uid": "12006",
  "comments": [
    {
      "time": " 15.Mar.2006 11.26am",
      "content": "Odd colors. Hierarchy is not as it should be. That spacing between charles and askew is too big. Why do you start with a more formal approach? Then abstract it from there.\n\n"
    },
    {
      "time": " 15.Mar.2006 11.42am",
      "content": "I would look at stacking your title. It might be able to be justified. I would look at other type faces and look at all caps since you have only one character that has a decender the lower case g. I don’t mind the mark but you might explore how it works in one color. A good designer solves design problems such as one color printing.\n\n"
    },
    {
      "time": " 15.Mar.2006 12.29pm",
      "content": "i never like it when people use the word “designs”. pluralizing the word makes you seem smaller and in my opinion cheapens your services and waters down your potential. it’s like you’re making widgets or something.\n\nusing the term “design” implies a bigger thought process and a broader approach.\n\ni’d say this applies to “communications/communication” as well.\n\n"
    },
    {
      "time": " 15.Mar.2006 5.05pm",
      "content": "Or maybe not use these words at all. Question is how can YOU stand out?\n\n"
    },
    {
      "time": " 21.Mar.2006 10.43am",
      "content": " **Without the title, the mark falls apart a bit.** The order of the letterforms aren’t easily discernable, and the “D” can easily be interpreted as an “O” because the reversed “D” opens up into the counter of the “C.”\n\n**Give greater thought to the type that makes up your title.** It seems like you typed in your title without considering modifications. Remember you have complete control over letter placement and each one of the individual characters that make up your title. Futura could be a nice starting point, but now consider how to improve upon it, making it unique to your logo.\n\nPerhaps you don’t need a separate mark at all. Have you considered a wordmark?\n\nHope this helps.\n\n"
    }
  ]
}
