{
  "id": "18585",
  "title": "Zurich info.",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I've been looking for a little background on  \n bitstream's Zurich typeface and can't find all  \n that much about it. Anyone have any resources  \n that may be helpful?  \n I know it's a take on univers, almost identical.  \n Although the ampersand is drastically different  \n than that of Univers'. Im getting the feeling that  \n it is to Univers what Arial is to Helvetica;  \n just some company trying to get around copyrights.\n\nAnyway, any help would be appreciated, thank you.\n\nCheers  \n Travis L.\n\n",
  "author": "Travis",
  "time": "15 Mar 2006 — 9:03pm",
  "uid": "11521",
  "comments": [
    {
      "time": "15 Mar 2006 — 9:52pm",
      "content": "Travis,\n\nno, it's not really the same. Adrian Frutiger drew two different ampersands for his Univers typeface. Linotype used one, Bitstream used the other. Zurich is simply a renamed Univers, while Arial and Helvetica are similar but different typefaces. Bitstream digitized Univers but they were not able to obtain permission from Linotype to use the Univers trademark so they released it as Zurich. In 2003, Linotype and Bitstream signed an agreement according to which Zurich is an \"authorized version\" of Univers -- but the name Zurich is still used.\n\nA.\n\n"
    },
    {
      "time": "15 Mar 2006 — 9:58pm",
      "content": "I should also mention that for many years, Adrian Frutiger was deeply unhappy about Bitstream's decision to publish Zurich, Humanist 777 and other renamed versions of his typefaces. Unitl Bitstream signed the agreement with Linotype, the company was considered by many as a \"guerilla foundry\" of a sort. Bitstream's library includes some other renamed versions of other typefaces but not all were unauthorized. For example, Linotype once published Matthew Carter's Shelley Script and then Bitstream published it as English 111. Matthew Carter was one of Bitstream's co-founders so English 111 is obviously authorized -- but Linotype owns the trademark Shelley Script. Similarly, Zapf Humanist and Zapf Calligraphic 801 were versions of Optima and Palatino autorized by Hermann Zapf but were published by Bitstream under other names since Linotype owns the trademarks.\n\n"
    },
    {
      "time": "15 Mar 2006 — 10:15pm",
      "content": "Nice!  \n Thank you so much for the help.\n\n"
    },
    {
      "time": "16 Mar 2006 — 5:19am",
      "content": "travis, fyi, there is no need to post the same question to 2 different boards on typophile. 1 will suffice.\n\n"
    }
  ]
}
