{
  "id": "18595",
  "title": "Melbourne's Ugly Onion?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "It appears that the \"brand\" of Melbourne has been redesigned by [Cato Purnell Parnters](http://web.archive.org/web/20131017144251/http:/www.cato.com.au/). I have to admit I’m certainly surprised with the direction they’ve taken with this. Melbourne is a very modern, colourful and culturally vibrant city… and they’ve gone with cool tones of blue and smooshed Helvetica bold?\n\nFrom [The Age](http://web.archive.org/web/20131017144251/http:/www.theage.com.au/news/national/state-has-new-designs-on-the-world/2006/03/09/1141701635152.html):  \n<cite>“From market research, Mr Cato said visitors to Melbourne often discovered there were more dimensions to the city than they had anticipated.<br>\n\"So we're kind of saying it's a bit like an onion — each time you peel back a layer there's a better bit underneath.\"</cite>\n\nThe \"onion\" analogy rings true. Melbourne is indeed a multi-layered city, you discover something new and exciting everyday, but is the turning pages design effective at communicating this? I think blue is certainly a surprising choice. Is it vibrant enough for Melbourne?\n\nAt present, I am not sure what to make of this. Admittedly, my inital thoughts about this new logo weren't very positive (10-20 minutes of non-stop ranting) and I understand that \"rebranding\" a city is possibly one of the toughest briefs a design firm can take on, which is why I've invited you all to please share your thoughts about this. :)\n\n**What do you think?**\n\n ![](http://web.archive.org/web/20131017144251im_/http:/typophile.com/files/thatsmebourne2.gif)\n  \nOld logo / <cite>Typeface: FF Info</cite>\n\n ![](http://web.archive.org/web/20131017144251im_/http:/typophile.com/files/svLOGO_wideweb.jpg)\n  \nNew logo / <cite>Typeface: Helvetica?/Univers?</cite>  \n [Image source](http://web.archive.org/web/20131017144251/http:/www.theage.com.au/news/national/state-has-new-designs-on-the-world/2006/03/09/1141701635152.html)\n",
  "author": "Geoff Riding",
  "time": "16 Mar 2006 — 4:22am",
  "uid": "7479",
  "comments": [
    {
      "time": "16 Mar 2006 — 5:37am",
      "content": "I'm indifferent... The old one is one of those we-had-a-funny-idea-and-nobody-told-us-that-it-won't-be-funny-for-long logos.\n\nIn general I like the new one, but I don't like the typography. Is it only me who thinks the \"N\" is too big (and the the right stem is too bold)? If one do something like that, you have to re-balance these details, which did not happen I guess.\n\nsebilar\n\n"
    },
    {
      "time": "16 Mar 2006 — 5:45am",
      "content": "I don't really like old logo and I'm very glad to see change as I think it was due.\n\nI can't help but feel that this was a lost opportunity to do something terrific.\n\nI think the reason the \"N\" and the whole right side of the new logo appearing odd is down to the odd number of letters in Melbourne. You have four letters on the right side opposed to three.\n\n"
    },
    {
      "time": "16 Mar 2006 — 6:44am",
      "content": "\"I think the reason the “N” and the whole right side of the new logo appearing odd is down to the odd number of letters in Melbourne. You have four letters on the right side opposed to three.\"\n\nYeah, it might look more odd with the O right smack in the middle and very large.\n\n"
    },
    {
      "time": "16 Mar 2006 — 7:01am",
      "content": "Does draw attention to BO, not really the best advertisement for a city. Mind you it doesn't work with either [the Festival or the Commonwealth Games.](http://web.archive.org/web/20131017144251/http:/www.melbourne2006.com.au/Festival+Melbourne2006/)  \nTim\n\n"
    },
    {
      "time": "16 Mar 2006 — 8:34am",
      "content": "Here we go again. Another typophile thread grumbling about a logo redesign.\n\nThe previous Me!bourne logo wasn't much of a logo, expressing barely a scintilla of a design idea. The split color treatment and the exclamation substituting the \"l\" were old hat at the time---today they're cliched and embarrassing. The \"that's me!\" part is plain corny. (wretch, gag etc) And the purple + white verges on a gothic theme that does not fit Melbourne at all.\n\nThe new logo with its tangible idea beats the pants off the old one. The blue colors aren't neccessarily downbeat or subdued. Dark blue or the business suit navy would have been conservative and dull.\n\nThe blues start with a light powder blue (sky blue) and go up to cyan (ocean color). Well, oceans are warm on bright sunny days aren't they? Not always, but they certainly _look_ warm and inviting. The ocean in travel ads for an island paradise or luxury cabin cruise is always a happy inviting cyan/blue.\n\nAside from the fanned-out pages, the multiple hues are, I guess, meant to represent Melbourne's multi-faceted, multi-cultural, diverse nature. I have lived in Melbourne most of my life and its always been a blue kind of city to me. We're known for watery elements like our four-seasons-in-one-day weather and Port Philip Bay.\n\nHelvetica regular is a face of questionable aesthetic merit; feeble and spindly, graceless, sickly and awkward-looking. It looks like doggie eggs in text settings, according to Paul Rand. I'm trying to get the National Gallery of Victoria to stop using tightly-spaced Helvetica regular for its exhibition typography because its so hard to read, the leading so tight effort is required to avoid re-reading lines unintentionally.\n\nHelvetica bold however, is nowhere near as objectionable as the regular. Helv regular gives the bold a shoddy reputation it does not deserve. Helv bold is a common choice for designs where trendier and more stylized sans serifs draw too much attention to themselves. That is, Helv bold is very useful for certain kinds of work. In bold guise it loses much of its ugliness and becomes generic, making it useful. Its usefulness depends on the job; just because a designer uses Helvetica (bold or reg) doesn't neccessarily make it a bad choice, or make Helvetica bold an inherently bad font.\n\nHelv, in any weight, can be a bad choice when you have a D or B. Helv's D and B are ungainly by their excessive width, eg: the NBC TODAY show logo.\n\nHo boye, lucky MELBOURNE doesn't have a D in it. I wouldn't like this logo if it had a big fat Helvetica D :^) But it does have a B and R. The designers got around that by condensing the glyphs in the middle, or possibly they used Helv bold condensed, or modified the standard bold, or designed custom glyphs for the middle letters, or the whole thing.\n\nDoes the O look like a Helvetica O? Not really. More like Din. Hey it could be---look at those straight sides :^)\n\nGeoff, I did not find Helvetica mentioned anywhere in the source article. Not saying it isn't Helv, but I've got my doubts from looking at the O.\n\nOther than the B, there aren't enuff letters here to tie the glyphs unmistakably to Helvetica. It could easily be a nice URW++ grotesk. The R with the curled leg is a generic design dating back to Akzidenz Gotesk and the whole grotesk sans tradition. The other caps here could be generic or grotesk---there wouldn't be much difference from Helv bold.\n\n_smooshed_\n\nQue? The letters are perspectivized. Is there something wrong with that? It looks artfully done. At least they haven't been mercilessly squished or squooshed. It seems typophiles are against any kind of manipulation or distortion of letters---including treatments that serve extra-dimensional aspects of a logo design, even when artfully executed.\n\n_In general I like the new one, but I don’t like the typography. Is it only me who thinks the “N” is too big (and the the right stem is too bold)? If one do something like that, you have to re-balance these details, which did not happen I guess._\n\nTechnically the N _appears_ oversized (may be an optical illusion). The right stem only looks too heavy because the left stem is lightened by the perspective distortion and overlapping color patch. But in practical use the guy in the street does not notice these things. You can have technically perfect typography and design if you want it, but how relevant and neccessary is that degree of perfection?\n\nWhy does it have to be perfect? Why _can't_ it be a little bit imperfect? Is imperfection, in an otherwise near-as-dagnammit perfect creation, really a bad thing? Doesn't the quirk make it more interesting?\n\nArt it is. Design it is. \"information architecture\" or computer programming it is not.\n\nThe designers could have compensated for the optical illusions, but they didn't---it isn't important enuff, and even it were corrected most people would not know the difference.\n\nLike it matters.\n\nFrom the source page:\n\n\"Designer Vince Frost, of Frost Design in Sydney, disagreed. \"I just think this looks incredibly weak,\" he said. \"For me it's really lacking in an idea. It doesn't feel modern or fresh and that's the kind of city Melbourne is.\"\n\nI think he's missing the subtlety of this design. There is a soild idea there, even if it is not as articulately expressed as it could have been.\n\nj a m e s\n\n"
    },
    {
      "time": "16 Mar 2006 — 8:43am",
      "content": "That Melbourne 2006 Commonwealth Games logo is pretty unexciting isn't it. When the games are over, the new MELBOURNE logo won't have to work with it.\n\n_not really the best advertisement for a city_\n\nCome up with a better one. Rule #1, city skyline silhouettes are O.W.T.\n\nj a m e s\n\n"
    },
    {
      "time": "16 Mar 2006 — 9:55am",
      "content": "_There is a solid idea there, even if it is not as articulately expressed as it could have been_  \nYes, I think that is part of the problem I have with it, the execution isn't up to the concept. The colour choice or at least the tones of colours aren't working for me and the perspective (from the image above) seems to go awry on the righthand. Why go for rectangles, it does smack of cityscape. I think the designer relied too heavily on Illustrator or Freehand to do the job.  \nTim  \nwhat does O.W.T. mean?\n\n"
    },
    {
      "time": "16 Mar 2006 — 4:14pm",
      "content": "James, whoa you’ve put in a bit of time and thought into this. :)\n\n<cite>Here we go again. Another typophile thread grumbling about a logo redesign.</cite>\n\nIt wasn’t my intention to be cynical. I didn’t create this thread so people can write it off as trash. I wanted to get more eyes and opinions from both melburnians and otherwise. I think it’s our duty as designers to question, dissect and discuss visual communication. It's healthy. :^)\n\n<cite>Geoff, I did not find Helvetica mentioned anywhere in the source article. Not saying it isn’t Helv, but I’ve got my doubts from looking at the O.</cite>\n\nI think you're onto something there. That was an ID on my behalf\\*, from the top of my head I recall the Akzidenz Grotesk R having a straight leg?\n\n\\*Now I think it could be Univers 47, that would explain the O. It’s hard to tell pespectivised.\n\n"
    }
  ]
}
