{
  "id": "18605",
  "title": "Renard as a law firm typeface",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am establishing a legal practice and am thinking of using Renard exclusively for correspondence. Anyone have any thoughts on the suitability of this face? I want something strong, conservative, and elegant. If this isn’t the best choice, are there any suggestions?  \nThanks.\n\n [‹ Looking for Human Anatomy Illustrations](http://web.archive.org/web/20071021124748/http:/typophile.com/node/18577 \"Go to previous forum topic\") [Melbourne's Ugly Onion? ›](http://web.archive.org/web/20071021124748/http:/typophile.com/node/18595 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071021124748/http://typophile.com/user/11840\" title=\"View user profile.\">C Swann</a>",
  "time": "<br>",
  "uid": "11840",
  "comments": [
    {
      "time": " 16.Mar.2006 9.08am",
      "content": "There are few that meet your criteria as well as [Renard](http://web.archive.org/web/20071021124748/http:/www.teff.nl/fonts/renard/renard.html). I commend you on looking beyond the usual suspects for your identity. Are you a designer or a lawyer?\n\n"
    },
    {
      "time": " 16.Mar.2006 9.37am",
      "content": "Renard’s an excellent choice, yes, though a more elegant revival of the same punchcutter’s work is DTL VandenKeere; you might also want to look at Augereau, Storm Jannon Text Moderne, and Conrad, depending on whether you want sixteenth, seventeenth or eighteenth century associations.\n\n"
    },
    {
      "time": " 16.Mar.2006 10.02am",
      "content": "The euro sign is poorly served, if that is a concern.  \nTim\n\n"
    },
    {
      "time": " 16.Mar.2006 12.22pm",
      "content": "Renard is undoubtedly beautiful.\n\nAs a lawyer, I’m sure I don’t have to tell you to check TEFF’s EULA. Their fonts are expensive, and their EULA has some unusual restrictions:\n\n“The Licensee shall be entitled to install the fonts mentioned in Article 2 of this Agreement and to use these fonts to layout documents and/or for word processing purposes on no more than one computer and one output device belonging to the Licensee.”  \n—Many EULAs allow 5 devices.\n\n“Without prior written permission from TEFF licensee shall refrain from putting documents, files or data in which the fonts/data mentioned in Article 2 of this Agreement are embedded, such as .pdf files, at third-party’s disposal and refrain from making documents, files or data in which the fonts/data mentioned in Article 2 of this Agreement are embedded available to any third-party.”  \n—Many EULAs allow PDFs for print and preview.\n\nPersonally, these conditions would make me think twice.\n\n"
    },
    {
      "time": " 16.Mar.2006 12.59pm",
      "content": "John, you read my mind!\n\n"
    },
    {
      "time": " 16.Mar.2006 2.17pm",
      "content": "From the same designer, but with better EULA’s:  \n [FF Quadraat](http://web.archive.org/web/20071021124748/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories=1&font_categories_search=font_name_search&searchstr=quadraat)  \n [Arnhem](http://web.archive.org/web/20071021124748/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories_search=font_name_search&searchstr=Arnhem&image.x=25&image.y=14)  \nand  \n [Custodia](http://web.archive.org/web/20071021124748/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories=1&font_categories_search=font_name_search&searchstr=Custodia) (OurType)\n\n"
    },
    {
      "time": " 16.Mar.2006 5.22pm",
      "content": "Wow, so many things to consider when you open up a practice and you have time to choose a typeface? Good for you!\n\nHow about:  \nGalliard for “strong, conservative, and elegant”?  \nBaskerville (for a more rationalist look?)  \nCaslon pro (highly familiar to the US lawyers)?\n\nYou’ll be quite distinct in a world of TNR...\n\n"
    },
    {
      "time": " 16.Mar.2006 5.43pm",
      "content": "Thanks Guys!  \nYou’ve been helpful. I am a law student who is trying to develop a consistent personal style of document. Not only for practice, but for all correspondence.  \nI really like Renard, and I just wanted to run it by the forum members to see if there was some reason why it was a horrible choice.  \nThank you again.\n\n"
    },
    {
      "time": " 16.Mar.2006 6.34pm",
      "content": "For a law student, it’s a terrible choice, because you could find better ways to spend your money.\n\nFor opinions, see [http://typophile.com/node/922](http://web.archive.org/web/20071021124748/http:/typophile.com/node/922 \"http://typophile.com/node/922\")\n\n"
    },
    {
      "time": " 16.Mar.2006 9.32pm",
      "content": "I’m sorry I missed that conversation, typequake, because I would have weighed in. It was “Counterpunch” that made Renard win me over. I wish more print looked like it.\n\n"
    }
  ]
}
