{
  "id": "18607",
  "title": "My very first typeface, working title Dobong",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "As my first post here, I present my very first attempt at designing a typeface, tentatively named Dobong after a 'mountain' and a district in Seoul. Right now I have the Latin Alphabet, numerals, and basic punctuation. I wanted a body text typeface that would be suitable for multilingual setting, including the Cyrillic, Greek, and Korean alphabets.\n\nThis project was inspired by the insane difficulty I had with a recent paper I worked on, which was primarily in Korean but included Ukrainian Cyrillic, their Latin alphabet transcriptions, and the International Phonetic Alphabet. There is not a single font family that I know of that supports all of them, not even a badly-designed one. So I had to mix and match typefaces, and getting the different elements to harmonize was labour intensive. So why not eliminate the process by doing all the hard work in designing a single all-purpose text font family?\n\nThis is admittedly extremely ambitious for a first-time typeface designer with no design background, and I have no idea how I'll find the time to design the thousands of Korean alphabetic syllables (Hangul, the Korean alphabet, combines the individual letters into syllabic blocks, each of which has to be designed separately; I am not even thinking about Chinese characters). And perhaps predictably, I ran into problems right away with the Latin alphabet.\n\nI had determined that to harmonize correctly with Korean, I would need the Latin text to be low-contrast, quite light, and reasonably narrow while having a high x-height. This being intended as a body text typeface, it would have to be readable. Unfortunately, I can't seem to satisfy all these demands.\n\nDoes anyone see a way to salvage the situation by tweaking letterforms so that all those demands are met? Or should I choose a different approach, such as making the miniscules wider/rounder or adjusting the serifs? I really don't think lowering the x-height is an option as that would make the miniscules too small to harmonize with Korean syllabic blocks.\n\nI haven't done any spacing or even preliminary kerning yet, so excuse how the preview PDF looks at the moment. Also, I worked directly on a computer and have no printer access, so I haven't seen any proofs, and the weighting is probably all off.\n\nI would welcome any suggestions on how to proceed. Comments on individual lettershapes are welcome, but I am looking for more general suggetions, as I am prepared to make grand overhauls but unsure how to proceed.\n\nEdit: I have also included a sample of how mixed Korean and Latin alphabet text would look in this font.\n\n| Attachment | Size |\n| --- | --- |\n| [Dobong v1.pdf](http://web.archive.org/web/20150123045417/http:/typophile.com/files/Dobong%20v1.pdf) | 19.67 KB |\n| [Mixed text test.pdf](http://web.archive.org/web/20150123045417/http:/typophile.com/files/Mixed%20text%20test.pdf) | 31.51 KB |\n\n",
  "author": "Jongseong",
  "time": "16 Mar 2006 — 9:50am",
  "uid": "12009",
  "comments": [
    {
      "time": "16 Mar 2006 — 11:56am",
      "content": "I can't tell you much to solve your general problem, but your letters reminds me a bit of [ITC Weidemann](http://web.archive.org/web/20150123045417/http:/www.myfonts.com/search?search%5Btext%5D=weidemann). Maybe you can get some ideas there about a low contrast, light and narrow Antiqua with large x-height...\n\nsebilar\n\n"
    },
    {
      "time": "16 Mar 2006 — 12:06pm",
      "content": "I think you should draw some test Korean and Cyrillic fonts concurrently. You need to get all the scripts to work with each other from the get go. I could give you tips on how to improve the Latin, but you might have to throw all those changes out for another round once you get to the other scripts. So, do yourself a long-run favor, and make this more difficult now by showing us mixed script text!\n\nIn general, I think that your letters are a bit too light. Since this typeface is intended for use in text, I think that the forms need to be a little more robust.\n\n"
    },
    {
      "time": "16 Mar 2006 — 4:12pm",
      "content": "Thanks for your comments. I quickly drew a few test glyphs in Korean, so now you have a rough mixed script text sample to look at. I agree that the Latin letters are too light, so that's something I'll have to deal with. But if you look at the Korean text in the sample, I don't think that's too light by Korean typography standards, although I can't be too sure before I have a printed proof to look at.\n\nThe main problem with setting multilingual texts with Korean and Latin alphabets is that the Korean font is much, much lighter next to the Latin alphabet font (unless you use the Latin letters that come with the Korean font, but those are so poorly designed that they are practically unusable). So I tried to strike a balance between making the Korean font too dark and the Latin font too light, but I'll have to go through some trial and error on this one.\n\nSebilar, thanks for pointing me to ITC Weidemann. It's illuminating to see how it deals with the problems I've been facing.\n\n"
    },
    {
      "time": "16 Mar 2006 — 6:34pm",
      "content": "The name of your font is allegorical of the task ahead of you...\n\nUnless you're an undiscovered type design genius (not impossible,  \nbut improbable) your only hope is for this to be a leaning experience,  \nnot a highly usable result. Unless you take many years to finish it.\n\nI'll try to be more encouraging, and more specific, the next time I visit this  \nthread, but in the meantime please look at this sequence of pages on my site:  \n [http://www.themicrofoundry.com/ss\\_rome1.html](http://web.archive.org/web/20150123045417/http:/www.themicrofoundry.com/ss_rome1.html \"http://www.themicrofoundry.com/ss\\_rome1.html\") \\_  \nincluding the second image on that first page, which shows  \nwhat I consider to be a superb balance of Latin and Hangul.\n\nhhp\n\n"
    },
    {
      "time": "16 Mar 2006 — 7:19pm",
      "content": "I doubt I'm a type design genius. Heh. But more importantly, there's no way I'll find the time to finish the project. This is really a theoretical excercise to satisfy my own curiosity about what is feasible. I didn't make this clear, but I do not expect to finish the font, at least in the grand form I envision it. Designing Korean fonts is full-time work taking many months at least, not something for an amateur like me to tackle in his spare time.\n\nThe Non-Latin section of the MicroFoundry page is excellent, by the way. I always wondered how one goes about producing typefaces in a foreign writing system. Then again, I guess that's what I'm doing designing a Latin alphabet typeface, and I'm probably missing a lot of nuances and mixing styles.\n\nAnyway, the Hangul sample on the page is in a style known as 'sinmun batang', or 'newspaper batang' ('batang' describes the style analogous to serifs in Korean typography). Because of its wide and squarish letterforms, it lends itself well to multilingual setting, as the image sample shows. But as it's suited for small sizes, it's used exclusively in newspapers, or in other contexts (such as in advertising) to evoke newspaper texts. It is stylistically inappropriate for books and magazine articles.\n\nIn the Hangul style I am going for, as the quickly-drawn sample glyphs indicate, the letterforms are higher than wide and the baseline is irregular. I gues I was trying to force-fit the Latin into proportions that would agree with these.\n\n"
    },
    {
      "time": "17 Mar 2006 — 10:46am",
      "content": "Brian, thanks for the kind words.\n\n\\> This is really a theoretical excercise\n\nOh.  \nWhich is nonetheless something with its own sort of usefulness.\n\n\\> I always wondered how one goes about producing  \n\\> typefaces in a foreign writing system.\n\nA central issue to me is that of \"nativity\": an intuitive, subconscious grasp of something, preferably gained at a very early age (otherwise it can take many years of deep immersion). When making a font in a script in which you don't have nativity, it's possible to make funky display fonts\\*, or highly derivative text fonts, but not progressive text fonts.\n\n\\* Which is what I did with my Georgian design for example.\n\n\\> ‘newspaper batang’ ... wide and squarish letterforms\n\nWhich nicely parallels [good] Latin news face design.\n\n\\> It is stylistically inappropriate for books and magazine articles.\n\nVery useful to know - thank you.\n\nWhat struck me most about that example is how amazingly well the serifs  \nin the Latin echo the stroke terminals in the Hangul! Really Good Design.\n\n\\> I was trying to force-fit the Latin into proportions that would agree with these.\n\nWell, as you probably already realize, the \"force\" bit can't really work. And going back to your \"I can’t seem to satisfy all these demands\", I would say \"don't worry, nobody can\", and would suggest that good design of any kind, especially design of multiscript typefaces, is about a sensitive balancing of compromises, not absolutes. This is easier said than done though! And it can get very tricky depending on the particular combination of scripts covered.\n\nAnd a broader tricky thing is figuring out if <cite>any</cite> kind of compromising is going to work. In some cases it's possible that the decision will not become one of finding a balance, but instead will \"snap\" to a \"no way\", meaning that the two scripts agree to disagree so to speak. The Latin/Arabic combination is perhaps the most prominent one: as usual, it's tempting to try to equalize their apparent sizes, but even a small effort in this direction either makes the Arabic inauthentic or the Latin unreadable. In such a case the most one can hope for is even color between the scripts, and hopefully a compatible overall atmosphere.\n\nWhether Latin/Hangul is this sort of conundrum is unclear to me, but I actually think -based on things I've seen and other script combinations I've thought through\\*- that it's not. So I would definitely keep trying.\n\n\\* A good comparison being Latin/Hebrew, since the latter also has glyphs of uniform height.\n\n--\n\nBTW, it struck me that -in both style and proportions- your Latin design is not unlike Gentium, which happens to be a font that's: free; and has or will have a Greek, and probably a Cyrillic as well. So I'm thinking you should simply make a Hangul that's compatible with Gentium! And that might allow you to actually end up with something in addition to your \"theoretical excercise\".\n\nhhp\n\n"
    },
    {
      "time": "17 Mar 2006 — 2:29pm",
      "content": "Something I forgot:  \n\\> I was trying to force-fit the Latin into proportions that would agree with these.\n\nConsidering that in my example (which to repeat I think seems to work great) the Hangul is wide but the Latin is narrow, I would posit that for your <cite>narrow</cite> Hangul you will hit the lower bound of what's acceptable narrowness for Latin. This \"boundary condition\" you would of course factor into any attempt at balancing the various compromises.\n\nhhp\n\n"
    },
    {
      "time": "18 Mar 2006 — 1:13pm",
      "content": "Hrant, thanks for your detailed comments. I've been looking through information about Gentium on the Internet, and I'm intrigued by the open source nature of the font. It looks like it has some really exciting collaborative work potential. Developing a version of Gentrium that supports Hangul really might be a worthy project.\n\nAs a side note, I don't think the main releases of Gentium should include Korean support, because it would mean increasing the size of the font tenfold for a feature that probably the majority of Gentium users won't need. But a companion font that has Hangul support in addition to the main Gentium glyphs could be very useful to Korean users handling multilingual documents, and would fit in nicely with Gentium's stated goal of serving a variety of languages.\n\nI don't think my first-time efforts will produce a Hangul font worthy of being a companion to Gentium, which I'm really impressed with, but I'll give it a shot anyway, because I think someone should and I don't think there are too many amateur Hangul font designers out there. Because of the time and expense, I don't think the professional typographers would be willing to release fonts with a Gentium-type of open license.\n\nSo I am working on the Hangul glyphs now, setting aside the Latin alphabet for the moment, and I'm trying to get it to harmonize with Gentium. I have no doubt that Hangul/Latin combinations can work beautifully; the newspaper typefaces are a great example. The Latin components of Korean fonts generally work well enough together with the Hangul, ugly as most of them are. In most cases, the Latin components are subservient to the Hangul (to borrow the term from the MicroFoundry website), which is one reason they don't work well as stand-alone Latin fonts. If we had a Hangul font that worked well on its own in addition to harmonizing well with Gentium, it would be a great improvement. Even though Gentium could be a bit too wide to be a perfect match for a narrower Hangul font, it won't be a problem that cannot be solved by tighter tracking, the usual solution to getting Latin fonts to work in a Hangul setting.\n\nI didn't think that I would actually complete a Hangul font, but I'm not so sure anymore. Maybe it's foolish optimism, but if I figure out a way of speeding up my design process, perhaps I'll be able to complete a makeshift version of the font in about two weeks, which is the amount of time I have before I begin my military service next month. Here's hoping I'll be able to make good progress...\n\n"
    }
  ]
}
