{
  "id": "18623",
  "title": "What printer?",
  "forum": "Build",
  "tags": [

  ],
  "content": "I need a new printer - my current one doesn’t do it for me. I’m going to do some logo design work, and need a printer that shows me how my letters will look on print. What should I consider when buying a new printer? What resolution is required? And, what kind of paper should i use?\n\n [‹ InDesign Butterfly on Opening page](http://web.archive.org/web/20070629041356/http:/typophile.com/node/19384 \"Go to previous forum topic\") [A problem converting OpenType to AAT ›](http://web.archive.org/web/20070629041356/http:/typophile.com/node/19437 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070629041356/http://typophile.com/user/5430\" title=\"View user profile.\">alexfjelldal</a>",
  "time": "<br>",
  "uid": "5430",
  "comments": [
    {
      "time": " 17.Mar.2006 12.52am",
      "content": "I use a HP LaserJet 1320 and are very happy with it. It’s a 1200 dpi laserprinter. I use paper for color laserprinters to print on because the surface is very smooth.\n\nPieter\n\n"
    },
    {
      "time": " 17.Mar.2006 1.04am",
      "content": "We seem to have this discussion a lot lately. My opinion is that a true PostScript printer is necessary if you are going to test anything typographic at smaller sizes. Unfortunately, PostScript printers seem exponentially more expensive that laster printers with PostScript emulators. But the output really shows a difference in the details!\n\n"
    },
    {
      "time": " 17.Mar.2006 9.13am",
      "content": "I would rather have a printer without PostScript at all than one with PostScript emulation. If it doesn’t pretend to have PostScript, the computer (either Windows or Mac OS X) does all the rendering, so everything looks as it does on-screen, though it may print more slowly.\n\nIf it has fake PostScript, the printer gets a PostScript program, and whether it correctly executes and renders it is anyone’s guess.\n\n"
    },
    {
      "time": " 18.Mar.2006 9.12pm",
      "content": "Many office print devices don’t have true PCL rasterizers either. The printer I use for office documents is “PCL compatible”. I guess your choice might depend on the value of what you are printing.\n\n"
    },
    {
      "time": " 21.Mar.2006 8.30am",
      "content": "Using a PostScript emulation may have downsides, e.g. HP’s had and may still have problems with interpreting hinting. (So I proof fonts unhinted.) But I would not put too much emphasis on the Adobe vs emulation PS. Say, you use an Epson laserprinter: This does have Adobe PS, but its text image too dark — not very useful either. There are many factors involved. In the end it is important that you can check if the design is consistent. Digital type has the disadvantage that the “real” design is imaginery, and no realization of it is “really” trustworthy.\n\nKarsten\n\n"
    },
    {
      "time": " 18.Apr.2006 9.30am",
      "content": "I hope you don’t think I’m trying to hijack the thread, but I am in the same boat. My old Epson C84 has just stopped working and I’m trying to decide what to replace it with. I am a bit fed up with Epsons, this current one being at least the second in six years breaking down on me, but on the other hand, when everything works, they are excellent.\n\nThe local Apple Store suggested Xerox Phaser 8500N (solid-ink printer), Xerox Phaser 6120N in Post Sript or Epson Stylus Photo R320 (ink-jet A4), the price order being from the most expensive to the cheapest.  \nI just browsed around for reviews, and the overall feeling seemed to be to go for the Epson.  \nAs suggested in some earlier thread about printers, I have used pdfs as a replacement of a ps driver. Seems to work ok.\n\n"
    },
    {
      "time": " 22.Apr.2006 7.53pm",
      "content": "It really depends on what your priorites are. Inkjet printers will usually provide better and more consistent color reproduction (especially for contone images), while laser printers will usually provide sharper and truer type. But regardless of what your priorities are, you’ll need a true PostScript printer for professional work.\n\nThere are losts of great printers out there. Some cost less than $500. Others need to be leased for $6000/month.\n\nIf I were a one man shop, I would buy a cheap PostScript Black and White printer for examining type and an inkjet like the HP Designjet 30 with EFI RIP for color proofing.\n\n"
    }
  ]
}
