{
  "id": "1862",
  "title": "How to choose fonts?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Well, I hope this question is not too basic for this forum...   \n   \nLet me give you some background. I am a Computer Science student, but have been working with designers for years, thus acquiring a fair share of awareness for good typography and design (I love working with designers, by the way -- the company I work for has a nice working environment and it is nice to collaborate with people that are experts in a different trade). At least I'm more aware than the average CS nerd, I guess ![:-)](http://web.archive.org/web/20131017074635im_/http:/www.typophile.com/forums/clipart/happy.gif).   \n   \nWhat I am trying to do is to find a collection of typefaces that I can use for all my personal type-related needs. E.g.   \n   \n- Letters and invoices (for the occasional consulting gig)   \n- Articles (typeset with LaTeX. Did I mention I'm a nerd?) or even my upcoming diploma thesis   \n- Headings on my web sites   \n- Printed music (that is, lyrics and chords)   \n   \nYou could say that I am trying to establish a CI for myself. So how does one go about searching the myriad of haystacks of fonts out there? And how do I come up with a collection of typefaces that actually look good used together?   \n   \nI guess I also should mention I'm not necessarily looking for freebies here. While I'm on a student budget, I am a firm believer of \"a worker is worth his wages\". I enjoy being paid for my (non-GNU) programming work, and I have a distinct feeling typographers feel the same way ![:-)](http://web.archive.org/web/20131017074635im_/http:/www.typophile.com/forums/clipart/happy.gif). I am ready to pay a reasonable price for good fonts. So I hope you will not perceive this as a plea to get free fonts.   \n   \nThanks in advance for your help!\n\n",
  "author": "crenz",
  "time": "29 Oct 2003 — 8:54am",
  "uid": "2469",
  "comments": [
    {
      "time": "29 Oct 2003 — 10:03am",
      "content": "\\> I love working with designers   \n   \nMe too - they're prettier.   \nI'm a CalStateNorthrigde SECS (School of Engineering and Computer Science - cool, huh? :-) grad myself.   \n   \nGenerally you'd choose two typefaces, one for body and one for headings/titling. If you want a really austere look you would choose one typeface that's a large family with both text and display cuts.   \n   \nThe thing is, you seem to have a lot planned for your CI, in terms of subject matter. The only way to accomodate all the things you list is to go for neutrality, and to me that's a lousy basis for a CI. As much as we think programming is an art as high as music, the general perception does not agree, and a good CI needs to be obliging to its audience, not a primadonna.   \n   \nSo I think you should either have groups of fonts you use, or possibly find a font with multiple \"persona\" of which there aren't many (the recent Siemens face is one, but that's not commercially available). I'm talking the display component here: for the text component it might make sense to play it [relatively] safe and choose something like Adobe's Warnock (which does have different cuts, btw) for all the \"groups\".   \n   \nhhp\n\n"
    },
    {
      "time": "31 Oct 2003 — 10:39am",
      "content": "Hrant, thanks for the feedback and sorry for the late reply. I can't say much about designers being prettier, since most designers I work with are guys. Don't underestimate the gals in CS, though ![:-)](http://web.archive.org/web/20131017074635im_/http:/www.typophile.com/forums/clipart/happy.gif). However, you are right in saying that music and CS are not so easy to combine sometimes. I am still working on it myself ![:-)](http://web.archive.org/web/20131017074635im_/http:/www.typophile.com/forums/clipart/happy.gif).   \n   \nI am fine with combining different typefaces -- in fact, I believe I won't be able to meet all my needs with just one typeface, and I am definitely not going for austerity. Artistic or expressive would be more like it, I guess.   \n   \nIn the meantime, it occurred to me that I will probably need even different body typefaces: Lyrics are usually set sans serifs (am I right?), while I'd use a Serif typeface for a report. Currently, I am using the Sigler Jazzfont ( [http://www.jazzfont.com](http://web.archive.org/web/20131017074635/http:/www.jazzfont.com/)) to set music, which is nice for the music and the chords, but too \"over the top\" for lyrics and directions for anything but Big-Band charts (IMHO). On the other hand, a plain Sans Serif like Arial looks kinda weird combined with it. Is there something that might go well with it?   \n   \nBy the way, if anyone wants to recommend their own fonts, feel free to do so!\n\n"
    }
  ]
}
