{
  "id": "18621",
  "title": "1906 Earthquake Shack Project",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello everyone,\n\nI am working on a cool information design project that relates the 1906 earthquake refugees to the current Katrina diaspora, in commemoration of the 100 year anniversary in SF. I am looking at many different typographic options, but am also considering using a face that was actually in use in the west during that time. Any help with this endeavor would be most appreciated, most of my work is contemporary, so I would love to hear some suggestions from those who are familiar with this era.\n\nI should also mention that this exhibition will be mounted in an actual earthquake refugee shack, several of which still exist here in the city, orginally designed by SF Park Superintendent John McLaren with the Dept. of Lands and Buildings of the San Francisco Relief Foundation, and the US Army. I want to avoid the obvious pitfalls that designers like Michael Schwab fall into (using Eagle for every project) since this effort predates any WPA project by 30 years.\n\nAnd finally, I am mostly searching for a display face, not for text. This exhibition will be on a city sidewalk, so it needs to be not only arresting but legible.\n\nHere is some more information if you are interested. This is the ugliest site but these are the folks who are paying for the exhibition. [http://www.outsidelands.org/sw17.php](http://web.archive.org/web/20131014205001/http:/www.outsidelands.org/sw17.php \"http://www.outsidelands.org/sw17.php\")\n\nThanks.\n\n",
  "author": "boon",
  "time": "16 Mar 2006 — 8:25pm",
  "uid": "4879",
  "comments": [
    {
      "time": "17 Mar 2006 — 4:27am",
      "content": "Brian,\n\nI don't know wether this project is supported with money, donations etc? Anyway having just completed my 6 month stay in this beautiful city I would be happy to contribute with any of my typefaces, depending if you find any fit for this project? If so please contact me and I will try to assist you.\n\nP.S. I visited the exebition at SF MOMA earlier in January, and was deeply affected by the devestation made to the city in 1906.\n\nGood luck!\n\n"
    },
    {
      "time": "20 Mar 2006 — 6:28pm",
      "content": "Thanks Stefan, appreciate the offer and the enthusiasm. I will definitely check out that show at SFMOMA too.\n\n"
    }
  ]
}
