{
  "id": "18635",
  "title": "Photoshop recognises Cooper Std, Flash doesn't?",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello kind people,\n\nI'm back to ask a question with a possibly obvious answer.\n\nI'm using the beautiful face of 'Cooper Std Black' for a current project.  \nI've roughed everything out in Photoshop CS, using this lovely font - but upon starting work in Flash, the font appears not to exist on my PC.\n\nI'm a self taught fly-by-my-pants Flash user so I may well have missed something technical, but unfortunately important.\n\nAny ideas, I'm puzzled?\n\nMany thanks in advance of your help.\n\n:)\n\n| Attachment | Size |\n| --- | --- |\n| [Skribe Square.jpg](http://web.archive.org/web/20110610181316/http:/typophile.com/files/Skribe%20Square.jpg) | 21.52 KB |\n\n",
  "author": "<a href=\"/web/20110610181316/http://typophile.com/user/11176\" title=\"View user profile.\">MekOne</a>",
  "time": "<br>",
  "uid": "11176",
  "comments": [
    {
      "time": "",
      "content": "It could be where the font is installed. Is that possible on a PC? Can you install fonts specifically for Adobe Apps?\n\n"
    },
    {
      "time": "",
      "content": "Mmmm,\n\nI've been having a scurry around - I can't really see any additional Adobe fonts, at least not within an Adobe program folder.\n\nI'll keep looking, it seems the most obvious answer, but it's locating the folder that's the niggling problem.......\n\n:)\n\nMmmm - I wonder where Flash draws it's fonts from, presumably the windows / font folder.\n\nStill looking, any help would make me happier............\n\n"
    },
    {
      "time": "",
      "content": "On Mac OS, Adobe has some private font folders in various places. Fonts in those folders are only active in Adobe apps. Maybe this is true on Windows as well?\n\n"
    },
    {
      "time": "",
      "content": "on windows, you can find the adobe font folder under  \nC:\\>Program Files\\>Common Files\\>Adobe\\>Fonts\n\n"
    },
    {
      "time": "",
      "content": "Still no luck, even after checking C:\\>Program Files\\>Common Files\\>Adobe\\>Fonts - Cooper just isn't there. The adobe folder would show me Illustrator only fonts as well, I assume.\n\nWhere is the little blighter hiding then? I've tried a 'search' of the hardrive but I don't trust that little wagging dog one mite.\n\nMmmm. Plots and thickenings. I'm sure it's obvious and I'm being dumb.....\n\nCooper Std Black is an Open Type Font. If it was placed in the local fonts folder then it would only show up in Adobe programs, but it's not even in the local folder?!\n\nSorry, thinking out loud.\n\n"
    },
    {
      "time": "",
      "content": "Found it - It's sitting in the Common/Adobe Premier folder......\n\nSo finally, do I drop a copy of this into the Windows/font folder to make my day bright?\n\n"
    },
    {
      "time": "",
      "content": ":)\n\nSimple, but I feel as if I've climbed a mountain and fought a dragon....My font appears. Brilliant.\n\nThanks for the leads people!\n\n"
    }
  ]
}
