{
  "id": "18645",
  "title": "Untitled for now. First typeface attempt.",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hey,\n\nI'm trying to do a typeface, first one actually. I usually do graphic design so I'm not pretending to be good at designing typefaces, but for some reason I got stuck with the idea of a \"g\" and really had to draw it on some piece of paper, I kind of liked it so I digitized it and then it grew up to this in the last few days. I actually kind of like it, so I thought I'd show what I have for now. It's not even a complete first draft of the lowercase, and I'm unsure about a few parts but so far I like it. I tried a bunch of words and I also think it reads well, pretty much what I intended in the first place.\n\nSo, what do you think about it?\n\n| Attachment | Size |\n| --- | --- |\n| [Untitled\\_typeface\\_20060317.pdf](http://web.archive.org/web/20131012033940/http:/typophile.com/files/Untitled_typeface_20060317.pdf) | 18.14 KB |\n\n",
  "author": "Pierre-Luc Auclair",
  "time": "17 Mar 2006 — 7:06pm",
  "uid": "8675",
  "comments": [
    {
      "time": "17 Mar 2006 — 8:20pm",
      "content": "Whats the intention of this typeface? What is it categorized under? How many weights? Lots of questions to answer before starting a typeface. A lot of people design faces for the purpose of having it in their \"portfolio\" and thats no way to start a typedesign project.\n\n"
    },
    {
      "time": "17 Mar 2006 — 8:51pm",
      "content": "Well, since it's my first one I didn't really have a purpose for it in the first place other that I wanted to have something readable, mainly for setting medium lenght texts. I know I should have something clearer, a \"real\" purpose but I just don't think I have something that can be qualified as such.\n\nI think where I'd like to lead it is something fresh, lively, that could be effectively used in a real text at about 11 or 12 with space to breath. I'd like some nice \"funky\" lines while staying subtle, clean.\n\nWhat it is categorized under, I couldn't say.\n\nWheights, well, I'd like something clear, light-weight. What I have for now I would describe as the normal \"roman\" weight. I'll start with this weight for now, but eventually would like to develop a bold version and a true italic of the roman if it turns into something acceptable.\n\nThat's not for portfolio (well not for now), but exploration solely.\n\n"
    },
    {
      "time": "17 Mar 2006 — 9:02pm",
      "content": "Doesn't a typeface sort of communicate its own intent? People will use it for whatever they feel it is appropriate for. I see a quaint casual organic face. Do you expect him to say, \"I was aiming for a stark, sterile geometric font suitable for headlines in a business newspaper,\" so you can say \"Whoa, you got that _all_ wrong!\" and what would that accomplish?\n\nAnyway, my critique: I think the i/j dot should be much higher, and a different shape. Round, or a small vertical line, or possibly even a ring.\n\n"
    },
    {
      "time": "18 Mar 2006 — 5:57am",
      "content": "Cerulean,  \nim not saying that at all. A designer can take ANY face and do whatever he/she intends to do with it, even if it defeats the original intention of the type-designer, as long as it works. But if you have a clearly defined purpose for the face, then all these things affects the actual design of it...In other words the intention affects the type design.\n\nSort of like how a graphic designer starts an identity without considering the audience, environment, history etc. I hope I'm making sense here.\n\n"
    },
    {
      "time": "18 Mar 2006 — 12:44pm",
      "content": "I like the fi ligature very much !  \nI really think you should design your typeface starting from the fi ligature you have got !\n\n"
    }
  ]
}
