{
  "id": "18646",
  "title": "Fever City Studio, LLC (logo&type)",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I guess you get what you pay for. Live & learn. In a fix, I went to a ’logo farm’ for my production company. I specialize in long-form network / documentary work and needed something quick for a project.\n\nIt took ’final approval’ to get the electronic files and now, hopefully, I can take the tweaking to another level. Now - there’s time to play before a printing order and I can’t help feeling that this could be ’more’. The font’s Gothic No. 13 and the icon’s a cityscape they came up with. Pantone 1805U for the reddish tint.\n\nI do really like Trade Gothic (which is a bit skinnier than this Gothic) but might be too skinny when up against the looming city thingie. It definitely makes for odd text positioning. Any and all input appreciated. I can take it. Thanks in advance - Michael\n\n ![](http://web.archive.org/web/20070811131711im_/http:/typophile.com/files/FCSpost1.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [FCStest1.pdf](http://web.archive.org/web/20070811131711/http:/typophile.com/files/FCStest1.pdf) | 744.7 KB |\n| [JustCityScape.pdf](http://web.archive.org/web/20070811131711/http:/typophile.com/files/JustCityScape.pdf) | 136.77 KB |\n\n [‹ Personal Logo - Critique Welcome](http://web.archive.org/web/20070811131711/http:/typophile.com/node/18565 \"Go to previous forum topic\") [filmaker logo, need opinions!!! ›](http://web.archive.org/web/20070811131711/http:/typophile.com/node/18047 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070811131711/http://typophile.com/user/12063\" title=\"View user profile.\">Fever City</a>",
  "time": "<br>",
  "uid": "12063",
  "comments": [
    {
      "time": " 18.Mar.2006 10.45am",
      "content": "First thing that caught my eye was the strange perspective on the plane where the “buildings” rise from. It’s kind of weird.\n\nThe idea of the buildings rising forming an F is nice, but I’m a bit bothered by the strong perspective. I’d make a kind of isometric grid, and just have the buildings rise without the high perspective. I hope I’m making sense here... it’s hard to explain what I’m talking about. Tomorrow, I’ll post a jpeg explaining what I mean.\n\nAs for the type treatment, it’s okay now, but it seems a tad cliché. Maybe have the “Fever City” line in a condensed font, and the “studio” line in a normal, or even extended font. Trade Gothic’s font styles would indeed be excellent for that.\n\n"
    },
    {
      "time": " 18.Mar.2006 2.35pm",
      "content": "The strong perspective would work for me if it were executed correctly. It seems like they were going for a wacky cartoon approximation of perspective, but it ended up looking more like they just botched half the lines. Strong concept though. I would make an actual 3D model and try different viewpoints. If the left side of the F-building shows, you could try putting the type on it. A simple flythrough would also make a nice logo animation for the screen.\n\nThe type is kind of traditional in comparison to the logo. It seems to call for something a bit more constructed.\n\n"
    },
    {
      "time": " 18.Mar.2006 5.03pm",
      "content": "Try dropping everything but the solid black F and the solid red squares, on a white field. ( could work )\n\nThis is rough, to say the least, but you have an implied city, and the excessive gradation wasn’t helping. Typography is more subtle. ? Just an idea.\n\n ![](http://web.archive.org/web/20070811131711im_/http:/typophile.com/files/FCmockup.png)\n\n"
    },
    {
      "time": " 18.Mar.2006 11.11pm",
      "content": "Good points all around. Thanks for puttin’ eyes on it and helping. Keep ’em coming... To that end, I do like your ’clean’ take, Eric. There’s implied confidence versus “Hey! 3D cartoon-type stuff!”.\n\nThere might be a happy medium as well. Maybe the windows add to the clutter / gradient mess? Originally, I remember the ’Fever City’ text not being as big. Not to play armchair designer, but possibly they felt it wasn’t weighted proportionally against this BIG city icon.\n\nAs I mentioned, Trade Gothic is lighter than this Gothic but I do like Eric’s choice too. Clean. Might be worth digging up an earlier, less cluttered jpeg from the review process. Or not - I like these new directions.\n\n"
    },
    {
      "time": " 19.Mar.2006 12.53am",
      "content": "Blame this late hour. Blame ’South Park’. Watchin’ tele, thinking about logos. so here goes.\n\nThe ’F’ feature always made me think of Fine Line Features. I realize all work is derivative. This is only meant as an interesting look at some elements side-by-side. Just curious.......\n\n ![](http://web.archive.org/web/20070811131711im_/http:/typophile.com/files/FCStrio.jpg)\n\n"
    },
    {
      "time": " 19.Mar.2006 12.16pm",
      "content": "Windows gone and Trade Gothic all around.... Any more thoughts? Thanks.....\n\n ![](http://web.archive.org/web/20070811131711im_/http:/typophile.com/files/FCScomp2.jpg)\n\n"
    },
    {
      "time": " 19.Mar.2006 7.05pm",
      "content": "I’d say the one on the right is closest. I’m sure their is restraint from others not wanting to go into a free full scale consultation. Our of curiosity, why trade gothic?\n\n"
    },
    {
      "time": " 19.Mar.2006 9.14pm",
      "content": "I hear you. I can appreciate the ’something-for-nothing’ angle. This is the sort of dialogue I tried to establish with the outift that was getting paid. Granted - not paid ALL that much but still..... A logo company the likes of which you’ve seen online most likely.\n\nAs for Trade Gothic, that is a good question. I might have an unhealthy attachment to the good books I’ve seen it used for cover-wise. It might not play that well in this specific deisgn though.\n\nThe closest I can guesstimate on your treatment is ITC Avant Garde Gothc. Even in the ballpark? Thanks again.....\n\n"
    },
    {
      "time": " 20.Mar.2006 6.20am",
      "content": "The one on the right is the one I would go for (but I am sure I have seen something very similar and I can’t remember where – might be Linotype). The perspective is really wrong, especially noticeable on the top left square, I think it is because something with three point perspective now only has two points.  \nTim\n\n"
    },
    {
      "time": " 20.Mar.2006 6.35am",
      "content": "Eric was right about loosing the buildings and the perspective. What the heck does buildings have to do with your business. I suggest nothing.\n\n"
    },
    {
      "time": " 20.Mar.2006 7.29am",
      "content": "Michael,\n\nAs for the font I used...uh. I posted that after a good 7 hours of kerning 10 pt. type, so I can’t remember at the moment, I’ll have to dig a little...\n\nIf your comfortable in sending me the file, I might be able to fix perspective etc ...\n\nvia my profile contact info.\n\nEric\n\n"
    },
    {
      "time": " 20.Mar.2006 9.05am",
      "content": "If you notice with the comedy central logo, it doesn’t look like it was done in photoshop. There are no gradients, Only strong illustration. If your design is strong enough you won’t need gradients. It will have more staying power.\n\nAs for a font I suggest something like Trade Gothic Extended. Try the 2 color version of the icon and shrink it in relation to the type. Tighten the tracking because your icon is so spread out, you don’t want the text to be also.\n\n"
    },
    {
      "time": " 20.Mar.2006 9.14am",
      "content": " ![](http://web.archive.org/web/20070811131711im_/http:/typophile.com/files/fever.gif)\n\n"
    },
    {
      "time": " 20.Mar.2006 9.16am",
      "content": "For your perspective, use Illustrator and get your 2 points of perspective. Draw the lines and connect the dots.\n\nLesson for drawing perspective.\n\n[http://www.leslietryon.com/art0802/2ptdrawing.pdf](http://web.archive.org/web/20070811131711/http:/www.leslietryon.com/art0802/2ptdrawing.pdf \"http://www.leslietryon.com/art0802/2ptdrawing.pdf\")\n\n"
    },
    {
      "time": " 20.Mar.2006 9.30am",
      "content": " ![](http://web.archive.org/web/20070811131711im_/http:/typophile.com/files/fever2.gif)\n\n"
    },
    {
      "time": " 20.Mar.2006 9.43am",
      "content": "Many thanks as always, everyone. Onward and upward as it were.\n\nEric - tried the file route and typophile has left me with ’Insert image’ as an only option for your contact info. And that road was limited to jpeg’s and gif’s not much bigger than those here.\n\nWithou being too cryptic, my name’s Micahel and i have an address for the above-mentioned business with the usual suffix. I really do appreciate all the input and help.\n\n"
    },
    {
      "time": " 20.Mar.2006 9.47am",
      "content": "Michael,\n\nOh, I forgot about that. I’ll send you an email from my acct, attach your file and send em’ back.\n\nEric\n\n"
    },
    {
      "time": " 20.Mar.2006 1.12pm",
      "content": "Go back and edit your orignial post- you can insert pdf files.\n\n"
    },
    {
      "time": " 20.Mar.2006 8.44pm",
      "content": "2 pdf’s with original post. File size should be okay. Being from lowly video, I’m more used to 72 dpi 30 fps. Your patience is appreciated.... Michael\n\n"
    }
  ]
}
