{
  "id": "1866",
  "title": "Type distributor royalties and commission",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "I just thought id post something about how much commission type distributors take from sales of foundry typefaces. MyFonts is pretty good at 20%, as is a large US distributor again at about the same. A UK distributor is offering 50/50 which sounds pretty sucky. What do people think to this? What are your experiences?\n\n",
  "author": "selfbuildtype",
  "time": "5 Aug 2002 — 11:48am",
  "uid": "863",
  "comments": [
    {
      "time": "5 Aug 2002 — 12:11pm",
      "content": "Craig,   \n   \nIt all depends on what your professional goals are for your typefaces. If you want to do nothing more than make fonts and have other people sell 'em for you, you relinquish profitablity. If you choose to sell them yourself, you'll spend more time getting your foundry geared up and properly marketed but you'll make 100% of every sale.   \n   \nThere are many schools of thought with distribution but overall if you're going that route anyway, you can assume the more places you can distribute the face, the more the face will make for you.   \n   \nSome places want exclusivity, and for that, you'll always get a higher royalty 50% or better. If you want to push your face through anybody that will sell it, you can expect something more like 20% of the sale which is very low but it's the going rate.   \n   \nThe key to distribution is wrapping your mind around your long term goals of distribution. For example, say you spend 3 weeks making a font. You distribute it like crazy. In 1 year, you make make $1,000 with it, in 5 years $6,000, in 10 years, $13,000.   \n   \nNow, $13,000 sound like a great figure for 3 weeks of work, but it comes in $250\\* chunks over quarterly (every 3 month) cycles. So, obviously the more fonts you make and distribute, the greater the chances are that you could make fonts full-time.   \n   \n\\*(by the way, many checks will be much closer to $7 to $130 quarterly if the face sells well)   \n   \nUnderstand that in addition to being a font creator, you are also that font's talent agent and are responsible for how much the face makes for you over the course of its career.   \n   \nYou shouldn't feel that there is an us/them mentality with distributors. You are seeking these people out because you feel they can make you money. I wish it didn't sound so capitalistic, but that's what your post suggests. And with that, you've got lots of choices when it comes to how you'd like to sell your fonts. Explore them all and draw your own conclusions.   \n   \nStuart :D\n\n"
    },
    {
      "time": "5 Aug 2002 — 12:44pm",
      "content": "Stuart, great practical advice - thanks. Just one thing:   \n   \n\\> Some places want exclusivity, and for that, you'll always get a higher royalty 50% or better.   \n   \nMost of the more prominent font houses will give you a lot less than 50% even with exclusivity. Some of them keep up to 85% for themselves!   \n   \nI personally think MyFonts is a great choice for many because the \\*mechanics\\* of viewing and selling (24hr credit card charging, dynamic character string display) are there. But it seems to me that \\*promotion\\* is still something you have to do yourself if you're going with MyFonts - which actually makes good sense if your target is a niche market.   \n   \nBTW, Bitstream also seems to have some very flexible and fair plans for font licensing, and they actually do some promotion.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Aug 2002 — 3:02pm",
      "content": "Thanks for the feedback guys. The business side isnt often discussed on forums and its good to hear peoples points of view on it. Id really prefer to stick with just Myfonts but reckon Ill go with the others as well just for the exposure. Selling them directly myself will be an option in the future but not for the time being. Cheers again!\n\n"
    },
    {
      "time": "9 Aug 2002 — 1:26pm",
      "content": "Joe, all of what you say has validity, but:   \n   \n\\> some of the best royalties available   \n   \n15-20% is pretty sad, dude.   \n   \nAnd I think a problem with some font houses is that they're not flexible. Type designers come in so many flavors these days. Bitstream is a rare case of flexibility:   \n   \n [http://www.bitstream.com/categories/products/nfc/submit\\_index.html](http://web.archive.org/web/20150414064422/http:/www.bitstream.com/categories/products/nfc/submit_index.html)   \n   \nAnd their library seems to be a nice balance between the functional and the ephemeral. The only thing is that their promotion is not as heavy as some other houses.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Jun 2003 — 4:56pm",
      "content": "Hi   \n   \nAs someone who's just set up a foundry...   \n   \nEven with us setting up our credit card processing in the cheapest way possible we have to give the bank 5% of the sale. We have server charges, bandwidth... the site cost money to build, and we paid to be in Indie Fonts 2, more marketing will be paid for...   \n   \nThe font designers are not getting rich but small independent foundries are in the same boat.   \n   \nJim   \n-----------------------------------------------------   \n [http://www.unionfonts.com](http://web.archive.org/web/20150414064422/http:/www.unionfonts.com/)\n\n"
    },
    {
      "time": "2 Jun 2003 — 8:13pm",
      "content": "Ancient thread revival.   \n   \nJeremy Tankard very sensibly links percentages to marketing. When he enters into a distribution deal, he insists on receiving copies of all the distributor's promotional material. If he does not feel that his fonts are being adequately marketed, he will either cancel the deal or insist that the percentages be changed. If a company is willing to actively market his fonts, Jeremy is willing for them to take a higher percentage but, quite rightly, he isn't going to sit around waiting for pennies from someone who just wants to pad the size of their generic font library.\n\n"
    },
    {
      "time": "3 Jun 2003 — 6:50am",
      "content": "Myfonts.com is increasing the take on sales for all renewing licensees from 20% to 35% as they come up for renewal. It was enough of a difference to get me to set up cc processing on my own.   \n   \nJoe VanDerBos   \n [http://www.joevanderbos.com/type/](http://web.archive.org/web/20150414064422/http:/www.joevanderbos.com/type/)\n\n"
    },
    {
      "time": "12 Jun 2003 — 10:43am",
      "content": "well, in some places like Argentina is a hard deal, I and a few really good designers from Argentina are trying to launch the first foundry and maybe the southest one ![:-)](http://web.archive.org/web/20150414064422im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nA ecommerce is not a easy way here so we had to choose myfonts.   \nIf you add to hosting and server cost, the webshop cost and the bank credit card processing we have no option for now until test the way the fonts sell.   \n   \njust for curious guys take a look at [http://www.sudtipos.com.ar](http://web.archive.org/web/20150414064422/http:/www.sudtipos.com.ar/) (I ll announce the launch of the foundry soon)   \n   \nsorry for the bad english\n\n"
    },
    {
      "time": "29 Jun 2003 — 2:25pm",
      "content": "Alejandro   \n   \nMy new foundry launches tomorrow, check it out..   \n   \n [http://www.unionfonts.com](http://web.archive.org/web/20150414064422/http:/www.unionfonts.com/)   \n   \nWe are working with three South Americian designers, plus designers in the US, Canada, UK, Germany, France, Australia and the Netherlands.   \n   \nAnd we offer a very good deal for font designers. If your interested in us distributing for you, drop me a line.   \n   \nJim\n\n"
    },
    {
      "time": "1 Jul 2003 — 2:16pm",
      "content": "ops, well I read that lately, maybe we can have the fonts in both place, is that compatible with myfonts?\n\n"
    },
    {
      "time": "3 Jul 2003 — 6:32pm",
      "content": "As a regular I font buyer I would rather buy from smaller outfits provided goods are of high quality (well tested, superb outlines, interpolation, kerning, design, etc)   \nThe reason is that I will often get fonts that are less circulated which translates to greater value for branding. Who wants to use fonts in branding that are obtained by thousands of designers worldwide? I think the idea of branding is to establish a unique look and feel and less distributed type (or even better-original type) is what is needed. The problem is that it is hard to find these gems, and once you find them it seems only a short matter of time before these outfits start reselling through the big distributors. Take Typotheque as an example. Peter Bilak is in my opinion one of the best designers around. His fonts are superb technically as well as unique in design. He used to distribute via FontShop and then started Typotheque to distribute new designs.   \nOther than typophiles who would ever find the little Dutch foundry Typotheque? Well good design sells and next thing you know Peter is doing display ads in the great GB magazine Eye to promote his Fedra face, then distribution follows with Myfonts... his Fedra is too sweet to not mass distribute, but does this actually depreciate it's value in Branding? I does in my book but   \nwhat does the rest of you typophiles think? Is it the designers who use these fonts responsibility to know   \nhow many are in circulation when approaching a client with type choices for projects? Are most fonts tracked by distributors and if so do they willingly give this information to the designers that buy?   \n   \nPS. this did not stop me from ordering additional styles and weights.\n\n"
    },
    {
      "time": "3 Jul 2003 — 7:03pm",
      "content": "\\> does this actually depreciate it's value in Branding?   \n   \nTotally.   \nAnd right there that's another justification for pricing your fonts high.   \n   \nBTW, Bilak is Czech.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Jul 2003 — 10:35am",
      "content": "Peter does live in Holland though.\n\n"
    },
    {
      "time": "6 Jul 2003 — 4:07pm",
      "content": "mat, thanks for the correction!   \n   \nJim, so I'm almost 2% Catalan? Wonderful!   \n   \nhhp\n\n"
    },
    {
      "time": "6 Aug 2002 — 10:18pm",
      "content": "Marketing is very expensive.\n\n"
    },
    {
      "time": "9 Aug 2002 — 1:19pm",
      "content": "Why not go with a reputable foundry and get   \nthe best of both worlds.   \n   \nConsider FontFont or Emigre or Font Bureau   \n(or a handful of others I'm forgetting). They   \nhave a good reputation for treating designers   \nwell with some of the best royalties available   \n(these are designer-run foundries, unlike   \nsome of the other big behemoths).   \n   \nBut the equation doesn't end with royalties.   \nThe other benefit is having a distributor   \n(foundry) with some muscle (reputation and a   \nsolid distribution channel) promote your work   \nbecause they believe in it.   \n   \nAdding your face to Myfonts may be a good   \nway to set up an online commerce option, but   \nthe reason they can offer such high royalties   \nis because they're spending very little to   \npromote \\_individual\\_ fonts. Instead they   \npromote their site -- leaving designers to hope   \npeople can find their fonts.   \n   \nIn the end ask yourself if it make sense to   \nget 100% of royalties from your micro foundry   \n(or 80% with MyFonts) if all of 7 people ever   \nfind (let alone buy) your font?\n\n"
    },
    {
      "time": "11 Aug 2002 — 1:51pm",
      "content": "Hrant, please read Joe's post. Evaluating royalties in a vacuum is not a worthwhile exercise.\n\n"
    },
    {
      "time": "2 Sep 2002 — 11:13pm",
      "content": "In addition to Joe's comments, I'll just add that the other thing that happens with, say, Adobe, is that we do production and testing work on every font we add to our library. It is essentially remanufactured to Adobe's standards, which can include outline fixes, kerning, rebuilding with our tools, and extensive testing.   \n   \nThat's just for licensed, non-exclusive designs. \"Adobe Originals\" have a much more extensive co-development cycle.   \n   \nHowever, it's true that the royalty rates paid by Adobe tend to the low end of the ranges being discussed. It's just a tradeoff. Also, Adobe tends to be on the high end for volume sold (not that that's saying much, when you're talking fonts!).   \n   \nT\n\n"
    },
    {
      "time": "5 Jul 2003 — 4:20am",
      "content": "\\> BTW, Bilak is Czech.   \n   \nbtw, bilak is slovak.   \n   \nmat\n\n"
    },
    {
      "time": "1 May 2012 — 4:59pm",
      "content": "@John Hudson - doesn't Tankard sign a contract with his distributor? How can he get out of it?\n\n"
    }
  ]
}
