{
  "id": "18668",
  "title": "Typeface Crit (designed for vision problems)",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Ok designing a typeface is a small part of my thesis \"Designing for Vision Problems\". I just started, so I need initial crits (i figure I'll need like 20 before its done). I will post the complete set soon.\n\nOBJECTIVES:  \nOpen Counters and Apertures  \nLarge X-height  \nShort ascenders + descenders\n\nThe name is based on Marla Runyan: an olympic, blind runner whos nothing short of amazing.\n\nThanks guys.\n\n| Attachment | Size |\n| --- | --- |\n| [runyan.jpg](http://web.archive.org/web/20150124100547/http:/typophile.com/files/runyan.jpg) | 23.94 KB |\n\n",
  "author": "Prakash Nair",
  "time": "19 Mar 2006 — 8:41pm",
  "uid": "10437",
  "comments": [
    {
      "time": "19 Mar 2006 — 9:10pm",
      "content": "great project, a few questions:  \n1. Why sans ? wouldn't the serifs would help the reading?  \n2. Why short ascenders? wouldn't that make it less readable?\n\nComments  \n1. why not try to put slight changes in the stroke as the pen moves around the form.  \nI think that helps, check out gill sans next to another sans. Its stroke varies slightly, gives it life. You have it going in the bowl of the \"a\", and the leg of the \"R\".\n\nSuch a great idea for a font? are there others?\n\n"
    },
    {
      "time": "19 Mar 2006 — 9:37pm",
      "content": "Well see I had those same questions too but the past couple of weeks Ive been doing nothing but research and I fonud out that for people with vision impairement, SANS is a tremendously better than serifs. The idea is to make clean simple glyphs. NO fancy techinques or serifs here because when its blurred, none of it will matter.....only hurt the legibility.\n\nI see what you mean about the subtle strokes. Good point.\n\n"
    },
    {
      "time": "19 Mar 2006 — 10:59pm",
      "content": "wow, what do you mean by research? have you tested this on impared people?\n\nIf it is the blurring effect that makes the serif worst that would mean sans is more noticable at a distance, where I would assume the same blurring takes place.\n\nlets try it.\n\nI see what you mean\n\n ![](http://web.archive.org/web/20150124100547im_/http:/typophile.com/files/impared.jpg)\n  \namazingly I think I slight blur makes the sans even easier to read or at least bolder  \n\n ![](http://web.archive.org/web/20150124100547im_/http:/typophile.com/files/slight%20blurimpared.jpg)\n  \neven at this stage the sans is still holding up.  \nBut maybe thats just cause te large x-height?  \n\n ![](http://web.archive.org/web/20150124100547im_/http:/typophile.com/files/heavy%20blurimpared.jpg)\n\n"
    },
    {
      "time": "20 Mar 2006 — 1:56am",
      "content": "Typography for people with vision impairement was one of the possible topics I was doing recherche for my diploma thesis, and I think if I hadn't found anything slightly more interesting, it would have made the run. I did this blurring tests as well, trying to find out whether there is potential in it.\n\nWhat I also found out: clearly distinguishable letterforms: none should be too similar to an other.\n\nOpen counters and apertures, and large x-height will do the job well, I think they help in the same manner as they helped Adrian Frutiger when designing Frutiger for airport Charles de Gaulle.  \nI don't think though that short ascenders and descenders will help much, I rather have the impression that longer ones are more helpful, but this would have to be tested for single words as well as for larger amounts of texts (as this may change there).  \nWhat will also help you is to have a look on Typedesign for Screen. The solutions for low resolution displays may be useful for your task as well.\n\nOn the design: should it be easy to the eye for non-impaired people as well? This would be a much harder job, except you make compromises.\n\nLettershapes (if you need this already. based on the assumption that this should be for seeing people as well, I can't test the other one):  \nR: top is very geometric, descenter just a bit too weak  \ny: right upper side too bold. Do you want to have such tiny details like the hooked tail in it?  \na: appears to be meager compared to the rest  \ngeneral: The overshoot of round shapes is exaggerated --\\> n and a look larger than y and u. u seems to hang below baseline.\n\nsebilar\n\n"
    }
  ]
}
