{
  "id": "18662",
  "title": "Three book jackets",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "Hi all,\n\nThis is one of my very first posts here so, y’know.. be gentle!\n\nI’m a first year graphic design student and we’ve just completed a brief on visual processes. Once we’d found a suitably obscure/unique process we had to apply it to either a book jacket, cd cover, short film or existing poster - the attachments here are the three options I came up with for an alternate cover to the book ’Ella Minnow Pea’ by Mark Dunn. For the first I photographed some handmade pixelated type I created, the second was achieved with scratched letraset and the third was layered images backlit and photographed.\n\nWhen we came to the crit, people liked the processes but felt the type composition (mostly on the back covers) let them down. Does anyone have any suggestions? I’m already in the process of reducing the size of the barcode (currently a little unwieldy) and removing the logotype on the spine of the first jacket as it overcomplicates matters.. but any observations or suggestions would be greatly appreciated :)\n\nThanks in advance,  \nJez.\n\n| Attachment | Size |\n| --- | --- |\n| [help1.jpg](http://web.archive.org/web/20070806201441/http:/typophile.com/files/help1.jpg) | 62.77 KB |\n| [help2.jpg](http://web.archive.org/web/20070806201441/http:/typophile.com/files/help2.jpg) | 59.25 KB |\n| [help3.jpg](http://web.archive.org/web/20070806201441/http:/typophile.com/files/help3.jpg) | 80.42 KB |\n\n [‹ Wedding Invites crit](http://web.archive.org/web/20070806201441/http:/typophile.com/node/18484 \"Go to previous forum topic\") [Plural of initialism in running head (all caps) ›](http://web.archive.org/web/20070806201441/http:/typophile.com/node/18419 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070806201441/http://typophile.com/user/12076\" title=\"View user profile.\">baskervillain</a>",
  "time": "<br>",
  "uid": "12076",
  "comments": [
    {
      "time": " 19.Mar.2006 5.17pm",
      "content": "LMNOP, catching title. I dont do gentle because the real world isnt’. Thats for school.\n\nOut of all three, Im leaning towards the first one. But the line spacing is way too tight, completely affects the readability. Im not too crazy about the MARK DUNN-baseline effect you having going on. I would drop the black bar and experiment with the big open wall you have in the background. That is a dream pallete to work on. Use it. Why did you chose pixelation? To me, it doesnt reflect the books theme.\n\nCompositionally, you have split the page into four zones. Was this on purpose? Work on hierarchy. We read from Left to Right. So placing the tiltle in the far right is not a good idea. And drop one of the authors name. You have it listed twice.\n\nI like the non-geometric type selections (since the background is geometric.)\n\n"
    },
    {
      "time": " 20.Mar.2006 3.15am",
      "content": "\\> I dont do gentle because the real world isnt’. Thats for school.\n\nIs that helpful or harmful for the students ?\n\n"
    },
    {
      "time": " 20.Mar.2006 7.04am",
      "content": "Thanks Prakash - some great points which I hadn’t noticed.\n\nTo me, pixelation is a perfect concept to experiment with. The book is about - among other things - the degradation of language. Pixelation was one of the ideas that jumped out at me most having brainstormed degraded type and purposefully obscured type.\n\nI don’t mean to sound ungrateful here or anything, but you do realise this is not just the front cover, right? This is the entire jacket - this explains why the author’s name is replicated (once for the cover and once for the spine) and why the title of the book might appear so drastically placed on the right hand side. Apologies if I’m way out here!\n\n"
    },
    {
      "time": " 20.Mar.2006 7.05am",
      "content": "The barcode has to be a certain size, you should make sure you don’t go below the legal minimum and most publishers will insist that their logo remains on the spine. You might also have to set the spine in a more ’conventional’ typeface, probably all uppercase.  \nThese things might let down the design but since they are real-world important you should probably keep them.  \nI have no real problem with the composition of the type on the back, although it could have more leading and have a narrower measure; you could also look at turning over some of the words to make the right margin smoother and kerning out the space between the italic P and remain, version 2 doesn’t look centred on the width and I would outdent the last line by the width of the ellipsis, (btw two points “correspondence” and en-dash (option+hyphen) should replace the hyphen).  \nAs for the treatments the letraset versions seem to be masking the title of the book with the extra l’s and tilde n’s.  \nTim\n\n"
    },
    {
      "time": " 20.Mar.2006 11.12am",
      "content": "The trick about the barcode is the widths of the lines. I have found i can vertically crop them a bit and not get into trouble. But scaling is a no-no.\n\n"
    }
  ]
}
