{
  "id": "18679",
  "title": "Seattle type event - Karen Cheng - Designing Type - launch and talk Apr 13",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nThe talk will be held at the Univeristy of Washington's Henry Art Gallery on April 13th at 6pm. I'll post more details as I get them.\n\nKaren Cheng's book \" [Designing Type](http://web.archive.org/web/20131023140545/http:/typophile.com/wiki/Designing%20Type)\" is due out on April 3rd, in English...\n\n[http://yalepress.yale.edu/yupbooks/book.asp?isbn=0300111509](http://web.archive.org/web/20131023140545/http:/yalepress.yale.edu/yupbooks/book.asp?isbn=0300111509 \"http://yalepress.yale.edu/yupbooks/book.asp?isbn=0300111509\")\n\n...and for the true Typorati in hardback German too...\n\n[http://www.amazon.de/exec/obidos/ASIN/3874396894/qid=1142872098/sr=8-1/ref=sr\\_8\\_xs\\_ap\\_i1\\_xgl/303-2819883-9969008](http://web.archive.org/web/20131023140545/http:/www.amazon.de/exec/obidos/ASIN/3874396894/qid=1142872098/sr=8-1/ref=sr_8_xs_ap_i1_xgl/303-2819883-9969008)\n\nCheers, Si\n\n",
  "author": "Si_Daniels",
  "time": "20 Mar 2006 — 8:41am",
  "uid": "1049",
  "comments": [
    {
      "time": "22 Mar 2006 — 11:25am",
      "content": "Here's a link directly to info from the German publisher - [http://www.typografie.de/verlagsverzeichnis/typografie/689-4.html](http://web.archive.org/web/20131023140545/http:/www.typografie.de/verlagsverzeichnis/typografie/689-4.html \"http://www.typografie.de/verlagsverzeichnis/typografie/689-4.html\")\n\nIf any font people are planning to attend the talk and are interested in meeitng up somewhere on \"the Ave\" before hand for a pint or three please post a note here or contact me off-list.\n\nCheers, Si\n\n"
    },
    {
      "time": "22 Mar 2006 — 12:28pm",
      "content": "Have you met Karen Cheng Si! I just pre-ordered the book because I am too impatient to wait for reviews but I wondered if you knew anything about her background and why she would be a good author of a type design book. I Googled her and could not find any type designs to her credit.\n\nChrisL\n\n"
    },
    {
      "time": "22 Mar 2006 — 12:57pm",
      "content": "Hi Chris,\n\nKaren teaches the typography course at the University of Washington, and I heard about her and her book from one of her students, Microsoft's own Kevin Larson. When Kevin joined the Advanced Reading Technology group he decided to go do a type course so he could better understand what people like Mike and Geraldine were talking about. I think this was also part of Kevin's secret plan to become an A-list superstar speaker at typography conferences.\n\nI met Karen for the first time on Sunday and got to briefly see the books (English and German) for the first time as well. It struck me as a very methodical, practical, hands-on manual describing the process of designing a western font. My initial reaction was also that it will be a bit controversial, with seasoned pro's exclaiming \"you can't distil my fifty years of experience into a how-to guide!\" But I think even non-beginers will get something out of it, for example the part on diacritics (some Twardochian principles seem to be in use).\n\nI don't think people will feel cheated out of their $20, and I'm going to order copies for my team. I think John Berry is writing a review so if people want to wait, they might want to check out his thoughts before ordering, but I say go for it!\n\nAs for why she did the book? I'm sure all will be revealed at the talk, but I'll ask her and report back.\n\nSi\n\n"
    },
    {
      "time": "22 Mar 2006 — 1:02pm",
      "content": "Thanks Si. Good to hear!  \nI realize it is just a book and not the pretender to all that there is to know about type. I look forward to reading it.\n\nTake care,\n\nChrisL\n\n"
    },
    {
      "time": "3 Apr 2006 — 9:22pm",
      "content": "Just a note that Karen's book is out today. I'm interested in what people think of it.\n\n"
    },
    {
      "time": "4 Apr 2006 — 6:07am",
      "content": "I pre-ordered mine from Amazon. I will let you know when I have read it.\n\nChrisL\n\n"
    },
    {
      "time": "4 Apr 2006 — 6:30am",
      "content": "Hrant is supposed to write a review for me ;-)\n\n"
    },
    {
      "time": "4 Apr 2006 — 6:51am",
      "content": "\\> _Hrant is supposed to write a review for me ;-)_\n\nHrant show me the book during our lunch in LA and had the chance to literally flip through the pages and at first glance it looks like it could be useful to beginning type design in the context of class study.\n\nI'm sure there will be yays & nays and I look forward to Hrant's and John B's reviews. As Hrant explained to me, some of Karen's students assisted with the project.\n\n"
    },
    {
      "time": "4 Apr 2006 — 7:35am",
      "content": "It's definitely worth a lot more than what it costs,  \nand actually to more people than just beginners.\n\nBut yes, a full (bilingual) review is in the works.\n\nhhp\n\n"
    },
    {
      "time": "4 Apr 2006 — 12:47pm",
      "content": "Dearest Book buyers,\n\nPlease don't buy your books from Amazon. They are making it nearly impossible for the independent bookseller to survive. It is not acceptable to bring a discount book into a real bookstore for a signing. If you want a signed copy of a title, buy it from the store hosting the signing & keep an eye on the bigger picture.\n\n"
    },
    {
      "time": "4 Apr 2006 — 12:56pm",
      "content": "Dear Books,\n\nDidn't mean to offend anyone. I linked to the German Amazon site as I couldn't find a direct link to the German publisher. In this case the signing will happen at a gallery, not a book shop. But I suspect the copies the author sells at the talk would be considered harmful to indie book stores too.\n\n"
    },
    {
      "time": "4 Apr 2006 — 1:21pm",
      "content": "[http://www.typografie.de/verlagsverzeichnis/typografie/689-4.html](http://web.archive.org/web/20131023140545/http:/www.typografie.de/verlagsverzeichnis/typografie/689-4.html \"http://www.typografie.de/verlagsverzeichnis/typografie/689-4.html\")  \nBut strangely enough it's in German.\n\nhhp\n\n"
    },
    {
      "time": "4 Apr 2006 — 1:51pm",
      "content": "Well, actually it IS at a bookstore, in the Henry Art Gallery. No offense taken - I only hope that we can avoid complete homogenization.\n\nthanks for responding.\n\n"
    },
    {
      "time": "4 Apr 2006 — 2:01pm",
      "content": "\\> I only hope that we can avoid complete homogenization.\n\nNot at this rate/direction we can't.  \nThe core has to be rebuilt.\n\nhhp\n\n"
    },
    {
      "time": "4 Apr 2006 — 2:35pm",
      "content": "Dear Books,\n\nI live in Virginia and will not be attending the book signing in Seattle. (I don't think I need to be coached on the no-no of bringing a book from another vendor to a book signing.) Am I still allowed to buy the book or do I need your approval on all my book purchases? I buy many more books than I can afford as it is. If I pay retail prices, to make you happy, I will just buy fewer books and the only person who will be happy is you. If you want me to still pay retail, send me the difference in price and I will buy from the merchant of your choice. That way everyone will be happy, the author, the publisher, the bookstore, and you.\n\nChrisL\n\n"
    },
    {
      "time": "4 Apr 2006 — 2:42pm",
      "content": "Indeed, there's something to be said about  \nencouraging people just to buy books at all,  \ninstead of putting them off by telling them  \nwhere not to get them signed.\n\nhhp\n\n"
    },
    {
      "time": "4 Apr 2006 — 3:04pm",
      "content": "\\>Well, actually it IS at a bookstore\n\nOops again. Didn't realize that the signing would not be happening in the auditorium - if Karen will only be signing books in the store then I'd agree it would be very bad form to bring in your Amazon purchases for her to sign. I'm sure no one on typophile would do that. As for me I don't tend to line up for book signings, line up at the bar maybe, but not to have a book signed.\n\n"
    },
    {
      "time": "5 Apr 2006 — 6:43am",
      "content": "\"...line up at the bar maybe,...\"\n\nWell, I guess I'll know where to find you in Boston this summer :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Apr 2006 — 11:52am",
      "content": "\\> It is not acceptable to bring a discount book into a real bookstore for a signing.\n\n\\> I’d agree it would be very bad form to bring in your Amazon purchases for her to sign.\n\nOnly one 'problem':\n\nAmazon.com:  \nAvailability: This item has not yet been released. You may order it now and we will ship it to you when it arrives. Ships from and sold by Amazon.com....\n\nProduct Details  \n • Paperback: 224 pages  \n • Publisher: Yale University Press (May 11, 2006)  \n • Language: English\n\n"
    },
    {
      "time": "5 Apr 2006 — 3:09pm",
      "content": "The publisher still lists it as the 3rd - oh well\n\n[http://yalepress.yale.edu/yupbooks/book.asp?isbn=0300111509](http://web.archive.org/web/20131023140545/http:/yalepress.yale.edu/yupbooks/book.asp?isbn=0300111509 \"http://yalepress.yale.edu/yupbooks/book.asp?isbn=0300111509\")\n\n"
    },
    {
      "time": "5 Apr 2006 — 3:17pm",
      "content": "Fancy-pants Yale can't properly space its own name.\n\nhhp\n\n"
    },
    {
      "time": "5 Apr 2006 — 3:33pm",
      "content": "What's the right date?\n\n"
    },
    {
      "time": "5 Apr 2006 — 3:43pm",
      "content": "I'll fire off mail to Karen.\n\nCheers, Si\n\n"
    },
    {
      "time": "5 Apr 2006 — 6:18pm",
      "content": "Got a reply from Karen - Amazon has it wrong - the book can be ordered directly from Yale - [http://yalepress.yale.edu/yupbooks/book.asp?isbn=0300111509](http://web.archive.org/web/20131023140545/http:/yalepress.yale.edu/yupbooks/book.asp?isbn=0300111509 \"http://yalepress.yale.edu/yupbooks/book.asp?isbn=0300111509\")\n\n"
    },
    {
      "time": "11 Apr 2006 — 2:22pm",
      "content": "Kevin Larson and myself have picked a location for the pre-talk pints - [http://www.bigtimebrewery.com/](http://web.archive.org/web/20131023140545/http:/www.bigtimebrewery.com/ \"http://www.bigtimebrewery.com/\") (based on location and the sites use of Comic Sans) for those who wouldn't recognize us we'll likely be at the bar wearing our KERN zipups.\n\nAlso talk details...\n\nDesigning Type  \nA Lecture by Karen Cheng  \nThursday, April 13/ 6:00pm - 8:00pm  \nA reception and book signing will follow the lecture.  \nHenry Art Gallery  \n15th Ave NE and NE 41st Street  \nUniversity of Washington\n\nTypefaces are one of the graphic designer's most essential tools; they can determine the success or failure of visual communication. In her new book, Designing Type, Karen Cheng examines what makes a good typeface, describing in detail how to construct letters, numbers, and accents in serif and sans-serif systems.\n\nCheng analyzes a wide range of classic and modern typefaces, including many from today's premier contemporary type foundries. In the rapidly broadening market for original and custom fonts, Designing Type is an excellent reference for experienced professionals and novice designers.\n\nHosted by Peter Miller Books  \nCo-sponsored by the Simpson Center for the Humanities\n\nCheers, Si\n\n"
    },
    {
      "time": "11 Apr 2006 — 5:45pm",
      "content": "....reading the book right now.\n\n"
    },
    {
      "time": "11 Apr 2006 — 6:54pm",
      "content": "David, but are you reading it at the \"Big Time Brewery\" with Si and Kevin? :-)\n\nChrisL\n\n"
    },
    {
      "time": "11 Apr 2006 — 7:18pm",
      "content": "Where's Si? the grain room? :)\n\n"
    },
    {
      "time": "11 Apr 2006 — 7:40pm",
      "content": "Sorry, I was out back helping the owner load some kegs into the delivery van. The things I'll do for a free pint. Kevin's explaining the parallel processing model to the brewmaster.\n\nCheers, Si\n\n"
    },
    {
      "time": "12 Apr 2006 — 2:13pm",
      "content": "Aww, man. Wish I could be there, I look forward to your reviews of the lecture.\n\nTypographica will have a review of the book very soon.\n\n"
    },
    {
      "time": "12 Apr 2006 — 6:57pm",
      "content": "I might go... it all depends on whether I can get off work early.\n\n"
    },
    {
      "time": "13 Apr 2006 — 11:06am",
      "content": "I'm going. I'm also going to show up at the Big Time Brewery beforehand.\n\n"
    },
    {
      "time": "15 Apr 2006 — 11:10am",
      "content": "Review - book, lecture? Hrant? Si?\n\n"
    },
    {
      "time": "15 Apr 2006 — 11:13am",
      "content": "My book review is in the works, and thanks to Dan  \nit will be published (in English and German) here:  \n [http://www.typeoff.de/](http://web.archive.org/web/20131023140545/http:/www.typeoff.de/ \"http://www.typeoff.de/\")\n\nhhp\n\n"
    },
    {
      "time": "15 Apr 2006 — 11:16am",
      "content": "I'm still waiting for your text, Hrant ;-)\n\n"
    },
    {
      "time": "15 Apr 2006 — 11:19am",
      "content": "It needs to be translated. But first it needs to be finished.\n\nhhp\n\n"
    },
    {
      "time": "15 Apr 2006 — 11:24am",
      "content": "No worries. I'm looking forward to reading it! (the book, too… I still have to go check it out)\n\n"
    },
    {
      "time": "15 Apr 2006 — 3:08pm",
      "content": "\\>Review?\n\nFirst off I had a pint of the Amber, it was okay, but had a bit of that fizzy homebrew aftertaste. Then when some others arrived we got a pitcher of the Scarlett IPA, described as an “experiment” by the barkeep it was actually pretty nice, had good color, and didn’t have the kick of some other IPA’s. It was pretty smooth.\n\nAs for the talk, the auditorium was full, I’d guess about 180 people, with a number standing. Karen stood at the base of the stage and her style was pretty entertaining, a touch of self deprecating humor, and jokes which seemed to be a hit with the crowd. Using questions reproduced from four or five student evaluation forms, her short (no more than half an hour) talk was really an entry-level introduction to the appreciation and understanding of type – and was at the right level for the audience who seemed to be mostly students, ex students, friends and local celebrities (Kevin Larson & John D. Berry being two I recognized). One question, “What’s the absolute best font in the world and what is the absolute worst font in the world”, was typical of the questions, and provided a way for Karen to show bad type used badly, and student work, and spreads from her book. There was plenty of time left for audience questions and these again were the typical, legibility type questions “why do you use sans fonts on signage” and standard fare “how do designers name their fonts” – again reinforcing this as not a specialist font crowd. Still a worthwhile event.\n\n"
    },
    {
      "time": "15 Apr 2006 — 10:00pm",
      "content": "The book looks worthwhile, too. I just had my first look at it today...\n\n"
    },
    {
      "time": "16 Apr 2006 — 3:09am",
      "content": "Does anyone know the difference between the englisch and the german version? On the german publisher's website it says:\n\n\"Es ist toll, hierzulande auf hochkompetente Schriftentwerfer wie Henning Krause bauen zu können, der daraus mit Akribie die Anatomie der Buchstaben [weiter]entwickelt hat.\"\n\n\"It is good to be able to rely on highly competent type designers like Henning Krause in this country, who, with meticulousness, developed [further] the 'Anatomy of Typefaces'\" (which is the german (sub)title of the book).\n\nIt also says in the credits:  \n\"[mehr als nur] übersetzt von Henning Krause\"  \n\"[more than just] translated by Henning Krause\"\n\nSo, does anyone know the differences?  \nI know that Hermann Schmidt always produces premium-quality books at high price (german edition: 68€, english edition: 27€), and as native speaker and book-lover i will get the german edition anyway, but it would be interesting to know what has been changed...\n\nSebilar\n\n"
    },
    {
      "time": "16 Apr 2006 — 3:47pm",
      "content": "I've asked Karen, but I'd guess Henning would be the best person to answer the question.\n\n"
    },
    {
      "time": "18 Apr 2006 — 9:23pm",
      "content": "Hello Sebilar,  \nThere are very minor differencesbetween the German version and the English version. The largest difference is that the German version has a different type classification chapter, since their system goes by different terminology. Also, the German version uses Quadraat as the body text (rather than Univers) — and it is printed as a casebound book (hardback) with a different title.\n\nI think the \"more than just translated\" bit refers to Henning's self-appointed role as an editor, fact-checker and proofreader. Henning made many editorial suggestions throughout, especially in the section on accents/diacritics. He was particularly helpful (as a native speaker of German, and as an experienced type designer) with questions I had about the German eszett.\n\nKaren\n\n"
    },
    {
      "time": "19 Apr 2006 — 5:39am",
      "content": "Karen,  \nThanks for the insight. Amazon just informed me that my copy of your book has shipped. I look forward to reading it. Perhaps you will take part ion discussions about it here online when several of us have had a chance to read it?\n\nThankyou for making the effort not only to write the book but to give us your thoughts here on Typophile.\n\nChrisL\n\n"
    },
    {
      "time": "19 Apr 2006 — 5:39am",
      "content": "Oh, and Si, I kinda miss that Seahawks helmet:-)\n\nChrisL\n\n"
    },
    {
      "time": "19 Apr 2006 — 6:53am",
      "content": "\\> Oh, and Si, I kinda miss that Seahawks helmet:-)\n\nDon't worry, you'll be seeing a lot more of it later in the year. ;-)\n\n"
    },
    {
      "time": "19 Apr 2006 — 7:12am",
      "content": "Like maybe about September Si?\n\n:-)\n\nChrisL\n\n"
    },
    {
      "time": "19 Apr 2006 — 9:00am",
      "content": "Thank you for the feeback, Karen. I'm looking forward to the release, I think this will be a lot of new input, especially for type design-beginners like me.  \nMaybe I don't have to bug people on typophile that often, with more or less basic questions :)\n\nSebilar\n\n"
    },
    {
      "time": "19 Apr 2006 — 10:29am",
      "content": "I purchased Designing Type at the Seattle event. Although I haven't been through the whole book yet, here's my take:\n\nThe book is a mostly visual compendium of the options presented in the design of letterforms. Each page could potentially comprise a Typophile thread. For example, how would one design a 'Q'? The advantage here is that hours and hours of discussions are distilled into a single useful reference. I'm not aware of any other documentation, web or print, that is this focused on the shapes of letters.\n\nMany books on typography tend to cover too many topics and end up being fairly shallow. This book only makes historical references when it is necessary for classification purposes. This is a good thing. The book also avoids much technological discussion. The information would useful for someone cutting Monotype matrices or working in FontLab.\n\nAlso, I think I had a taste of the Scarlet IPA out of Sii's pitcher. It was quite good. I owe him, or someone he was with, a pint.\n\n"
    },
    {
      "time": "26 Apr 2006 — 5:39pm",
      "content": "This might be of interest to some of you:  \n [http://www.fontshop.de/pdf/Anatomie\\_der\\_BS.pdf](http://web.archive.org/web/20131023140545/http:/www.fontshop.de/pdf/Anatomie_der_BS.pdf \"http://www.fontshop.de/pdf/Anatomie\\_der\\_BS.pdf\")\n\nIt's from the german edition of the book. The PDF is authorised by the publisher, as [www.fontblog.de](http://web.archive.org/web/20131023140545/http:/www.fontblog.de/ \"www.fontblog.de\") (blog of fontshop.de) states.\n\n"
    },
    {
      "time": "26 Apr 2006 — 5:47pm",
      "content": "I was sorry to miss the event. Unfortunately, I was just flying back from the Uk that day, and my flight was delayed 3.5 hours, so I was just landing as the thing ended! Oh well.\n\nI really want to read the book and post a review on my blog. My first 5-minute appraisal was quite positive, but I think I need to spend a little more time than that before I do a full review.\n\nT\n\n"
    }
  ]
}
