{
  "id": "18683",
  "title": "Coffee Packaging",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,\n\nI don't know if this is the appropriate forum for this type of critique, but I am posting some packaging options for a Gourmet coffee. It is very high-end, from Puerto Rico (Map). The name Platino means Platinum.\n\n",
  "author": "vivirenet",
  "time": "20 Mar 2006 — 11:38am",
  "uid": "7501",
  "comments": [
    {
      "time": "20 Mar 2006 — 11:51am",
      "content": "Very nice. Are these 4 options? I think the least strong are number 1 and 3 (from left). I think the strongest is 4.\n\nGreat use of rich colors.\n\n"
    },
    {
      "time": "20 Mar 2006 — 11:53am",
      "content": "Yes, these are 4 options for the same product.\n\nThanks,\n\nEdgardo\n\n"
    },
    {
      "time": "20 Mar 2006 — 11:56am",
      "content": "One problem, for me, with 3 is that the logos almost look too similar and then they appear repeated. However, I do like that much of the silver showing. Maybe re-visit that option and figure in a little more assymetry.\n\n"
    },
    {
      "time": "20 Mar 2006 — 12:04pm",
      "content": "I think the first two are the best when you consider this should be ‘high end’ coffee. They are more elegant than the last two. You have a pretty reflective table there. ;)  \nGreat job!\n\n"
    },
    {
      "time": "20 Mar 2006 — 12:40pm",
      "content": "One Question: Do you like the yellow/cream color on the second one?\n\n"
    },
    {
      "time": "20 Mar 2006 — 12:50pm",
      "content": "I don't. Yellow isn't a color I associate with coffee (even though unfinished coffee beans at some stage of the productions are a light ochre, aren't they?).\n\nThe left-most example is my favorite. If you want color, I recommend something in the direction of number 3.\n\n"
    },
    {
      "time": "20 Mar 2006 — 1:08pm",
      "content": "These are very nice. My only question is where can I order some beans?\n\n"
    },
    {
      "time": "20 Mar 2006 — 1:54pm",
      "content": "My problem with these designs aren't with the look as much as how they will stack up against other Gourmet Coffees. Did you get competing brands and see what they were doing? Did you do shelf space testing? Will your brand jump out to consumers or will it fade into the background when its in a commercial enviroment? I will suggest the name is to subtitle and needs to be bumped up (size) and you might want to make some of the important information with more contrast. My suggestions have nothing to do with design but with sales.\n\n"
    },
    {
      "time": "20 Mar 2006 — 1:56pm",
      "content": "If you go with #4, then the 3-bean cluster needs to go. You already have a pic of beans. It is repetitive.\n\nThe burgundy box that has the 100 percent logo- put the map in it. Move 100% logo somewhere it doesn't compete so much with the main logo. Maybe below the coffee mug.\n\n"
    },
    {
      "time": "20 Mar 2006 — 2:30pm",
      "content": "ohh, i choose the first one, so simple, so nice\n\n"
    },
    {
      "time": "20 Mar 2006 — 2:54pm",
      "content": "The problem I have with the first one is the image just ends. No rhymne. No reason. Lack of ink does not equal high end, necessarily.\n\n"
    },
    {
      "time": "20 Mar 2006 — 3:03pm",
      "content": "I agree that if the ink could fade out properly it would be much stronger. The cluster above the logo needs to be rearranged. It may not be neccessary. #1 has the most potential in my opinion.\n\n"
    },
    {
      "time": "20 Mar 2006 — 3:33pm",
      "content": "With limited knowledge of your market and its competitors I can only speak to the packages presented and my knowledge of the NZ coffee market. #1 seems to work best of the four options due to its simplicity and restraint. The limited colour palate assists with the idea that the name portraits (platinum) by allowing so much use of this silver packaging base layer. Move the bean cluster up slightly so that it does not cramp the blend bar so much. The brand mark needs more dominance, the 100% logo needs less.\n\nThe burgundy bar and yellow screen of #2 seems to restrict the map too much and fails to let it breathe and use the space like it does in #1.\n\n#4 is far too cluttered and this complex grid offers little to the idea of sophistication or high end.\n\n#3 has potential but lacks some of the sophistication and clean lines of #1.\n\nBest.  \n-nic\n\n"
    },
    {
      "time": "21 Mar 2006 — 6:13am",
      "content": "Thanks to all. The feedback is greatly appreciated.\n\nDan, in the beginning the coffee will be sold locally and there is no packaging like this on the Island. No tests have been done at the international level, however due to the fact that Puerto Rico has to import coffee to supply the local demand, international retail sales are not the main objective.\n\nChris, I found two online retailers [http://www.demiislita.com/cafe\\_us.html](http://web.archive.org/web/20131020190817/http:/www.demiislita.com/cafe_us.html \"http://www.demiislita.com/cafe\\_us.html\") and [http://www.ebay.com](http://web.archive.org/web/20131020190817/http:/www.ebay.com/ \"http://www.ebay.com\")... look for Encantos.\n\nThanks again.\n\nEdgardo\n\n"
    },
    {
      "time": "21 Mar 2006 — 7:41am",
      "content": "Number 1 is really nice, the bean cluster really disrupts the background image though, I'd consider moving it or removing it all together. Also the logo seems too cramped vertically, let it breathe a bit and add increase the height of the black box. I'm not sure what the top insignia is; but one thing to consider is that once the package is open and the customer rolls it down that will most likely be lost in the fold; so if it's important even moving it down 1/2 an inch might be worth it.\n\nI can see where the color for the map in #2 came from and I like it as well. Again the logo should have a bit more room and the 100% is tight to the bottom, I'd move it up a tad.\n\nCheers!\n\n"
    },
    {
      "time": "21 Mar 2006 — 8:28am",
      "content": "Its all about Colombian. I picked up some in Cali. If made right, it is life-changing coffee.\n\n"
    },
    {
      "time": "22 Mar 2006 — 12:21pm",
      "content": "Edgardo thanks. I always like to try new coffee! Good luck.\n\n"
    }
  ]
}
