{
  "id": "18684",
  "title": "Font Explorer X OT Feature Preview",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Is there a way to preview ot features or even just see if any features exist?\n\n",
  "author": "Jackson",
  "time": "20 Mar 2006 — 11:59am",
  "uid": "4346",
  "comments": [
    {
      "time": "20 Mar 2006 — 12:12pm",
      "content": "Yes, sort of. When you are in the store, fonts viewed in the list have character set features displayed next to their names. Here an example of Adobe's Kepler to show you what I mean:\n\n ![](http://web.archive.org/web/20131016013440im_/http:/typophile.com/files/FEX-Kepler-Feature-Icons.png)\n\nKepler Std Light Italic Caption has the following OT Features  \n1. An Adobe ISO 2 character set  \n2. Ligatures  \n3. Euro sign  \n4. Small Caps  \n5. Oldstyle Figures  \n6. Fractions  \n7. Ordinals  \n8. Swashes  \n9. Alternates\n\nIf you double click on the font's name, you can click on \"characters\" and look at glyphs by Unicode range. In the Private Use Range, you'll see (if you scroll) that the font even includes ornaments inside it.\n\n ![](http://web.archive.org/web/20131016013440im_/http:/typophile.com/files/FEX-Private%20Use%20Area%20Glyph%20Table.png)\n\nYour fonts (i.e., when you are looking at fonts inside your Library and not inside the store) will not have have character set icons, of course, but you can still look through the fonts character sets and see if there are extra glyphs.\n\nYou will not if your font has Contextual Alternates that work almost automatically (like Zapfino Extra or Bickham Script Pro) unless the foundry has included such info inside the font's description field. If this is the case, however, then you can the font in question's description, or do a search or create a Smart Set, etc.\n\n"
    },
    {
      "time": "20 Mar 2006 — 12:16pm",
      "content": "There is however, unlike is a program like FontLab Studio 5, no \"OpenType Preview Window\" where you take type text, and click certain features on and off to see how they look.\n\n"
    },
    {
      "time": "20 Mar 2006 — 1:07pm",
      "content": "Thanks Dan.\n\n"
    }
  ]
}
