{
  "id": "18697",
  "title": "true type to open type",
  "forum": "Build",
  "tags": [

  ],
  "content": "I have a true type font and i want to trascode it to open type so it can be used in both windowsxp and OSx. To be more specific i want to use it in ILLU CS (windowsxp) and CS2 (OSX). How can i begin? Are there any helpfull tutorials on this matter? Does it matter if the font is Greek?\n\n",
  "author": "<a href=\"/web/20111222000129/http://typophile.com/user/12109\" title=\"View user profile.\">zoran</a>",
  "time": "<br>",
  "uid": "12109",
  "comments": [
    {
      "time": "",
      "content": "Although released by Apple, isn't Truetype universal as Opentype?\n\n"
    },
    {
      "time": "",
      "content": "The TrueType format has been integrated into OpenType. Each Windows TrueType (.ttf) font is already an OpenType font, more specifically, an OpenType TT font (OpenType font with TrueType outlines). All such fonts work in both Windows and Mac OS X.\n\nAdam\n\n"
    },
    {
      "time": "",
      "content": "Is this Your TT font, or a TT font?\n\n"
    },
    {
      "time": "",
      "content": "If the font is a Windows flavor TrueType font you can simply install it on Mac OS X (license permitting). If its a Mac flavor TrueType font then things may eb abit more tricky.\n\n"
    },
    {
      "time": "",
      "content": "Ok i have the Transtype app and i want to convert a type1 font, make it into something that can work in the following CS1 CS2 suites in both Windows and Mac. What conversion must i make?\n\n"
    },
    {
      "time": "",
      "content": "can anyone help?\n\n"
    },
    {
      "time": "",
      "content": "User guide:\n\n[http://www.fontlab.com/Font-tools/TransType/](http://web.archive.org/web/20111222000129/http:/www.fontlab.com/Font-tools/TransType/ \"http://www.fontlab.com/Font-tools/TransType/\")\n\n"
    },
    {
      "time": "",
      "content": "Zoran,\n\nif you have TransType SE, you should convert to Win TrueType / OpenType TT. If you have TransType Pro, you can conver to OpenType PS or to Win TrueType / OpenType TT.\n\nA.\n\n"
    },
    {
      "time": "",
      "content": "I hate to bump an old thread, but there's things in here relevant to what I'm looking for at the moment.\n\nIsn't there a command line tool that's scriptable to allow me to convert multiple truetype fonts into the opentype format? I'd rather use something I can get down and dirty with rather than a fancy GUI program to do an incredibly simple job (well, it's not incredibly simple by hand, but you should get my point).\n\nEdit:\n\nOh boy, I just found what I was looking for, right here on [this very forum](http://web.archive.org/web/20111222000129/http:/typophile.com/node/67406). Apparently there's a nice little set of tools called [TTX/FontTools](http://web.archive.org/web/20111222000129/http:/sourceforge.net/projects/fonttools/files/).\n\n"
    },
    {
      "time": "",
      "content": "TTX is great, but I'm pretty sure you can't use it to convert from TTF to OT.\n\n"
    },
    {
      "time": "",
      "content": "Well, it can convert a ttf to a ttx file, and a ttx file to a ttf file. Sure, it's not the most streamlined method, but it'd be lifesaver for a few one-off conversion jobs.\n\n"
    },
    {
      "time": "",
      "content": "Well, apparently not, oh well,\n\nEdit: Okay, apparently there is a service that will do this for you [by email](http://web.archive.org/web/20111222000129/http:/onlinefontconverter.com/). Problem solved as soon as it was broken again. Derp.\n\n"
    },
    {
      "time": "",
      "content": "You may want to take a look at [FontXChange for Macintosh](http://web.archive.org/web/20111222000129/http:/www.fontgear.net/fontxchange.html)\n\n"
    },
    {
      "time": "",
      "content": "TTX can be a help, when you want to avoid damages during a conversion from TrueType to OT. First convert it to PS OTF (with FontLab for example), then decompile the tables of the TTF and the generated OTF. In the decompiled TTF you have to make a few changes, namely in the name records, because there is a slight difference in the specification. And you have to remove a few tables, that are not in OTF, and you have to add the CFF-table. Then you can recompile it.\n\n"
    }
  ]
}
