{
  "id": "18707",
  "title": "ATypI Lisbon: TypeTech call for presentations",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20080906161446/http:/typophile.com/user/108 \"View user profile.\") : 21.Mar.2006 9.15am \n\n—  \n**Call for Presentations for the TypeTech Forum at ATypI Lisbon 2006**\n\n—  \nAssociation Typographique Internationale (ATypI) Annual Conference  \nLisbon, Portugal, 27 Sep - 1 Oct, 2006\n\nMarch 21, 2006 - Announcing the opening of the Call for Presentation Proposals for the TypeTech Forum of the ATypI Lisbon 2006 conference.\n\nThe Board of Directors of ATypI is proud to note that the ATypI Conference is sponsored by many of the leading companies in the graphic arts and computing. Early sponsorship for Lisbon comes from the Microsoft Corporation.\n\nThe ATypI 2006 TypeTech Forum committee invites submissions of abstracts for presentations on any theme related to technology in type design and typesetting. Based on previous feedback, there will be no separate introductory section this year; potential presenters should assume that their audience is versed in the basics of type technology, such as Unicode and OpenType.\n\nAppropriate topics include, but are not limited to: new methods in typeface design and production; approaches to testing fonts; issues and solutions for font development; and new technologies in typesetting. Proposals are welcome for practical demonstrations as well as lectures and panel sessions. Preference will be given to talks which have not been done before at TypeTech Forum or ATypI.\n\nAbstracts should include the title of the proposed presentation, the requested time length, the presenter’s name(s) and a short biographical note (50-100 words), and a short summary (100-200 words) suitable for publication in the conference programme. (Note: Biographies and presentation descriptions may be edited for length and/or clarity.) Presentation lengths in the TypeTech Forum are variable, but generally run between 15 and 60 minutes, including questions. Actual time allotted may sometimes be less than requested. Preference may be given to submissions received earlier, but the actual deadline is May 31, 2006.\n\nIt is expected that the speakers will provide the text of their presentations, and images if possible, for inclusion in a publication or on the web site after the conference.\n\nPresentation proposals should be sent to the programme planning committee by e-mail to **typetech [at] atypi.org**\n\n_Please note that all other correspondence should be addressed to the ATypI Secretariat and Conference Office (see below)._\n\nLisbon TypeTech Forum Committee\n\nThomas Phinney, Adobe Systems; Simon Daniels, Microsoft Corporation; Tiffany Wardle\n\nATypI Executive Director: Shelley Gruendler\n\n—  \nAbout ATypI: Association Typographique Internationale is the only worldwide organisation dedicated to type and typography. Founded in 1957, ATypI provides the structure for communication, information and action within the international type community. ATypI annual conferences are attended by delegates from more than 40 countries. Recent Conferences have been held in Helsinki (2005), Prague (2004), Vancouver (2003), Rome (2002) and Copenhagen (2001). The ATypI Board of Directors: Jean-François Porchez, President; John Hudson, Vice President; Mark Barratt, John D. Berry, Henrik Birkvig, Ted Harrison, Gerry Leonidas, Thomas Phinney, Fiona Ross, Erik Spiekermann, Sumner Stone, Adam Twardoch, Pavel Zelenka, and Maxim Zhukov.\n\n—  \nFor more information, visit [http://www.atypi.org](http://web.archive.org/web/20080906161446/http:/www.atypi.org/) or contact the ATypI Secretariat & Conference Office at secretariat [at] atypi.org\n\n",
  "author": "<a href=\"http://web.archive.org/web/20080906161446/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 21.Mar.2006 9.15am",
  "uid": "108",
  "comments": [

  ]
}
