{
  "id": "18700",
  "title": "Readability and verticality",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I know “readiblity” is a very common topic, but I was wondering about this specific issue: is ANY “slant” going to hurt readability in blocks of body text? Roman always seems based on a strict vertical orientation, with a strict horizontal, perpendicular base. I’m not talking about “italics” so much as subtler variations between roman and ital. Any thoughts?\n\n [‹ Displaying Type in a Gallery Setting.](http://web.archive.org/web/20071011184546/http:/typophile.com/node/18000 \"Go to previous forum topic\") [The Mystery of Steile Futura (Topic) ›](http://web.archive.org/web/20071011184546/http:/typophile.com/node/18227 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071011184546/http://typophile.com/user/11098\" title=\"View user profile.\">jlg4104</a>",
  "time": "<br>",
  "uid": "11098",
  "comments": [
    {
      "time": " 21.Mar.2006 6.13am",
      "content": "CLARIFICATION! I don’t mean to suggest that all roman fonts are strictly “vertical” in terms of their strokes, bowls, etc. I mean in terms of the overall perpendicularity to the baseline. Variations of thick-thin along a diagonal axis is, of course, a property of plenty of otherwise vertical, roman typefaces. I’m referring to those that are slightly off that perpendicular, without looking italic or wackily slanted. I suppose I need an example of what the hell I’m jibbering about.\n\n"
    },
    {
      "time": " 21.Mar.2006 8.38am",
      "content": "There was a thread last year about slightly slanted type. Maybe a search will bring it up.\n\nChrisL\n\n"
    },
    {
      "time": " 21.Mar.2006 8.55am",
      "content": "Paul Hunt worked on a slanted face with interlocking serifs that was to helps dislexics… it has yet to be realeased, but I think that its Typophile working name was “Interlock”…\n\n"
    },
    {
      "time": " 21.Mar.2006 9.10am",
      "content": "I fired off a mail to Kevin Larson but he’s away right now. There’s research comparing roman v italic, but roman v slightly slanted? If anyone knows Kevin will.\n\nThx, Si\n\n"
    },
    {
      "time": " 21.Mar.2006 9.26am",
      "content": "Kewl— thanks. Here’s the interloc one—\n\n[http://typophile.com/node/7019](http://web.archive.org/web/20071011184546/http:/typophile.com/node/7019 \"http://typophile.com/node/7019\")\n\nI’ll keep poking around the archives.\n\n"
    },
    {
      "time": " 21.Mar.2006 9.28am",
      "content": "here’s what i put together with [Interloc](http://web.archive.org/web/20071011184546/http:/typophile.com/node/7019), if you’re interested. It’s all based upon my own hare-brained ideas (although i must admit some influence by hhp as you will see if you read the thread). None of my conjecture is backed by any research, just my gut feeling.\n\n"
    },
    {
      "time": " 21.Mar.2006 9.33am",
      "content": "From the title of this thread I thought this was about  \nChinese, and I’d started working up a reply in my head! :-)\n\nThere are two reasons to think that slant harms readability:  \n1) People aren’t used to it (in long stretches).  \n2) It distorts the boumas readers expect, for example by confusingly offsetting the ascenders and descenders in bouma silhouettes. Our Peter E might be able to throw one of his image-processing algorithms at this and come up with interesting insights (although he’s actually not a silhouette fan for one thing).\n\nFonts with less slant presumably suffer less, although they can have another problem: especially at small sizes and/or bad output conditions, the difference between Roman and Italic can fade. BTW, this is why the so-called “upright Italic” style can’t work as an Italic (which is why I prefer calling it “cursive Roman”).\n\nSome notable slightly-slanted Romans:  \nSyntax (1/2 degree)  \nRialto (1 degree)  \nSeria (variable, ~1 degree)  \nFlora (~2 degrees?)\n\nIn Nour&Patria, the slant (in Nour’s Armenian and subordinate Latin, and its Latin italic) is 1/16\\*, which is about 3.6 degrees. This seems to be the least slant one can safely have (in a text face). I think it’s safe enough that Nour’s subordinate Latin (codenamed Harrier)\\*\\* can be used for setting a (short) book.\n\n\\* In digital fonts I think it makes more sense to use integer slopes  \ninstead of degrees. The latter is a pretty arbitrary measure, while  \nthe former allows easy control over slope segments.\n\n\\*\\* [http://www.themicrofoundry.com/other/nour&patria/dev/nour-latin.gif](http://web.archive.org/web/20071011184546/http:/www.themicrofoundry.com/other/nour&patria/dev/nour-latin.gif \"http://www.themicrofoundry.com/other/nour&patria/dev/nour-latin.gif\")\n\n—\n\n\\> If anyone knows Kevin will.\n\nAssuming his empirical methods (or to be fair, anybody’s) are good enough.  \nThey don’t seem to be (although still, “he’s our only hope”).\n\nBTW, I think Randy is working quite seriously on semi-serifs too.  \nThey rule.\n\nhhp\n\n"
    },
    {
      "time": " 21.Mar.2006 9.37am",
      "content": "THanks for the examples, hrant. Isn’t the very idea of the “bouma” debatable, though? My sense is that the debates is that either (a) we recognize word-outline shapes at first pass, then further refine cognitively, or that (b) we parallel-process individual letters in groups at first pass, then further refine cognitively. I guess the result is kind of the same, and might even perhaps be hypotheses that predict much the same reading behaviors, but strictly-speaking they are different cognitive-perceptual animals, right? Frankly, I don’t believe much in boumas; I prefer (b). But that’s just me.\n\n"
    },
    {
      "time": " 21.Mar.2006 9.40am",
      "content": "\\>“he’s our only hope”\n\nObi Wan Larson!\n\n\\>From the title of this thread\n\nI have the same problem on typophile. I often work out an elaborate, clever and witty response, while waiting for the thread to load. And then end up disappointed.\n\n"
    },
    {
      "time": " 21.Mar.2006 9.40am",
      "content": "Duplicate post - sorry\n\n"
    },
    {
      "time": " 21.Mar.2006 9.54am",
      "content": "The thread I mentioned earlier was:\n\n[http://www.typophile.com/forums/messages/29/50587.html?1097103444](http://web.archive.org/web/20071011184546/http:/www.typophile.com/forums/messages/29/50587.html?1097103444 \"http://www.typophile.com/forums/messages/29/50587.html?1097103444\")\n\nbut I get an error message when I try to load it. It might be because it is too old?\n\nChrisL\n\n"
    },
    {
      "time": " 21.Mar.2006 10.01am",
      "content": "“Fonts bending in the breeze but not quite knocked over.”\n\n"
    },
    {
      "time": " 21.Mar.2006 10.11am",
      "content": "\\> Isn’t the very idea of the “bouma” debatable, though?\n\nOf course.\n\nOne thing though: boumas aren’t necessarily whole words. Essentially they’re letter clusters, deciphered as wholes thanks to frequency, distinctiveness, the experience of the reader, the semantic context of the text, the clarity with which it’s seen (how close to the fixation point\\*) and yes, word boundaries as well.\n\n\\* In fact the decipherment of single letters -which is indeed the norm in the fovea- can be seen as a special case of bouma decipherment. But the more experienced the reader (to me the prime target of improving readability, because the rest is mostly just legibility, a different -and simpler, if only pragmatically- problem) the more important the -blurry- parafovea is.\n\n\\> I don’t believe much in boumas\n\nWell then you owe yourself another explanation as to why  \nserifs and good letterspacing (just to name 2 things) matter.\n\nBTW, if you haven’t already, you might get  \nyourself a copy of issue #13 of TYPO magazine,  \nwhere three rival viewpoints are presented.\n\nhhp\n\n"
    },
    {
      "time": " 21.Mar.2006 10.40am",
      "content": "I will check out the TYPO stuff, hrant. My initial response, though I know I need to investigate further:\n\n“serifs”— yes, they make each letter different from every other in more ways than the same letter in a sans-serif font. I.e., more transformations from letter to letter, even among similarly-shaped letters. But why can’t this be explained equally well by parallel-processing of individual letters vs. a bouma model?\n\nand as for “good letterspacing,” well, I just don’t see how this does any more than distinguish one unprocessed clump of stuff from another. It actually has nothing to do with the shape of each word, but just the division space between.\n\nand, bouma-tastically:\n\nhow do you process\n\nhrant\n\ndifferent from\n\nlmemk\n\nyes— there are indeed word outline differences, but arent the real KEY differences in h vs. l, r vs m, a vs. e, n vs. m, and t vs. k?\n\nAnyway, just playing with ideas here. I love this stuff. And I usually find that pushing the devil’s advocate is one way to learn. I was a philosophy major— hard for me to make ANY general claims about ANYTHING. Just meaningless neutrons in the void.\n\n"
    },
    {
      "time": " 21.Mar.2006 10.48am",
      "content": "\\> they make each letter different from every other\n\nDo they really? Or do they instead create “noise” (at the letter level)?  \nWhy do sans forms have higher <cite>legibility?</cite>\n\n\\> arent the real KEY differences ...\n\nYou’re talking about the deliberative (or at least foveal) aspect of  \nreading, not the high-speed, immersed, error-prone\\*, fuzzy aspect,  \nthe one at the heart of readability; the interesting one.\n\n\\* Explain why we miss typos so frequently.\n\n\\> pushing the devil’s advocate is one way to learn.\n\nWith that I couldn’t agree more! :-)\n\nhhp\n\n"
    },
    {
      "time": " 21.Mar.2006 11.31am",
      "content": "I find that when I’ve got something that’s struggling for legibility, like an ambigram, obliquing it a bit makes it more readable. The same goes for segmented LCD/LED displays; there is a slant to the digits that makes them read better. It’s possible, though, that it doesn’t help as much in whole paragraphs of text.\n\n"
    },
    {
      "time": " 21.Mar.2006 11.46am",
      "content": "Ok, I have my homework cut out for me. I’ll get back to you on this.\n\nAs for slightly-slanted stuff, I want to see those examples and take some notes. BTW, for what it’s worth, I love using the Duck Island Greeking machine for sample gibberish, for testing legibility vs. readability:\n\n[http://www.duckisland.com/GreekMachine.asp](http://web.archive.org/web/20071011184546/http:/www.duckisland.com/GreekMachine.asp \"http://www.duckisland.com/GreekMachine.asp\")\n\nChoose your “language.” I like “hillbilly,” b/c my wife is officially an Appalachian minority.\n\n"
    },
    {
      "time": " 21.Mar.2006 11.52am",
      "content": "After spending a long time reading an italic font, I find that roman always looks like it’s slanting backwards.\n\nFor a typeface, a slant should be decisive, not slight, otherwise it looks like a mistake. However, some individual characters may have “vertical” parts that deviate from true, for overall optical balance.\n\n"
    },
    {
      "time": " 21.Mar.2006 11.54am",
      "content": "You know what really frosts my pumpkins? When lines are set in italic so that book titles and other stuff that would be italicized end up in Roman. That just makes me so MAD.\n\n"
    },
    {
      "time": " 21.Mar.2006 1.01pm",
      "content": "Kevin, good observation!\n\nhhp\n\n"
    },
    {
      "time": " 21.Mar.2006 1.30pm",
      "content": "“After spending a long time reading an italic font, I find that roman always looks like it’s slanting backwards.”\n\nAgreed. I always get this when designing an italic then switching back to the roman, it looks really odd and throws me for a second!\n\nI guess the only way for you to test this is to do it. Download a novel from the Gutenburg Project, set it in a few different typefaces, some with slant, some without, and read them. See what happens!\n\n—K\n\n"
    },
    {
      "time": " 21.Mar.2006 1.39pm",
      "content": "\\> After spending a long time reading an italic font, I find  \n\\> that roman always looks like it’s slanting backwards.\n\nWell, guess what one possible solution is: a roman with a slight slant! :-)  \nAnd the only people who’ll think it’s a mistake (at text sizes) are type  \namateurs with loupes. Yelling isn’t the only way to communicate,  \nand subtlety is a cornerstone of <cite>text</cite> face design.\n\nhhp\n\n"
    },
    {
      "time": " 21.Mar.2006 1.57pm",
      "content": "_so that book titles and other stuff that would be italicized end up in Roman._\n\nI thought that Fairfield, with its caption and italic styles, might solve the problem, but it really needs a different angle as a extra differentiator between the two “italic” styles. So I put together this demonstration: the normal Worldwide Italic has about a 10 degree angle, whereas Albany Italic is 20 degrees, and has large “pot-hook” serifs. I inserted Times Italic “i” in to the Worldwide Italic — the horizontal intro serif further serves to differentiate the two italic styles. So far as I know, there are no typefaces that utilize this concept.\n\n ![](http://web.archive.org/web/20071011184546im_/http:/typophile.com/files/HyperI.png)\n\n"
    },
    {
      "time": " 21.Mar.2006 2.09pm",
      "content": "\\> it really needs a different angle as a extra differentiator\n\nAnother indicator that the cursive-Roman style cannot serve as an Italic.\n\n—\n\nI’ve been a fan of multiple italics for a while now,  \nbut in applying the idea I decided to go one step  \nfurther and vary “mood” instead of angle, resulting  \nin the Daam Entity fonts. But those are for display.\n\nIn terms of “proper” multiple italics, those have been done  \nnow and again during the 20th century, but always sort of  \nas an afterthought or a correction. It’s only recently, thanks  \nto Underware, that we’ve seen an unapologetic application of  \nthe idea. So it has indeed been done, but at least not by Goudy’s  \npesky “old folk”. :-)\n\nhhp\n\n"
    },
    {
      "time": " 21.Mar.2006 2.11pm",
      "content": " ![](http://web.archive.org/web/20071011184546im_/http:/typophile.com/files/images.jpeg)\n\nWhy not just use small caps? Or morse code?\n\n"
    },
    {
      "time": " 21.Mar.2006 3.52pm",
      "content": "Yes, I had forgotten Auto.  \nIn theory, and Underware does mention it, Auto’s two italics could be used in contrast to one another, but that’s not shown in the PDF specimen, and I don’t think there is enough contrast for it to work. It’s primarily the similar amount of slant that mitigates against it. So I really do think that the contrast between two italic styles would have to be maxed, including different angles as well as serif/whatever structure, to make it work. That’s why I gravitated to showing a pot-hook modern in my experiment, because of its extreme slant and features.\n\n_Why not just use small caps? Or morse code?_\n\nNah, it’s gotta be some form of italicization to convey the kind of meaning which that conveys, most obviously a title of a work (play, movie, book, periodical, boat etc).\n\n"
    },
    {
      "time": " 21.Mar.2006 4.06pm",
      "content": "Plus Auto is a sans, so not a real text face.  \nBTW, before Auto, Sauna had that feature too,  \nbut I guess even deeper in the display realm.\n\nMaybe a better example is Seria, which has an Italic (actually a cursive-Roman) and a Cursive; and although the latter was released after the former\\* it does benefit from being originally planned (AFAIK).\n\n\\* Unless it hasn’t actually been released yet and I’m getting ahead of myself!\n\nhhp\n\n"
    },
    {
      "time": " 21.Mar.2006 6.09pm",
      "content": "_Nah, it’s gotta be some form of italicization to convey the kind of meaning which that conveys, most obviously a title of a work (play, movie, book, periodical, boat etc)_\n\n“Meaning”... those sound like example of arbitrary typographic conventions. Italics does, though, convey something like “emphasis” (at least in an impressionistic sense), if you have any _idea_ what the _hell_ I’m trying to say. :-)\n\nThen again, those are arbitrary conventions, too. Except that the forward “thrust” at least mimics the forward thrust of breath when we HEM-phasize our words.\n\nAlso, just to run with this a bit: titles of books, in traditional, Western (American?) texts like books are _often_ but not _always_ italicized. In newspapers, magazines, etc., you see single or double quotes around those exact same kinds of titles.\n\nAnd there’s a historical dimension, too— note all the wacky uses of italics and caps in early American (i.e., British colonial) writing that persisted up through the early 20th c.\n\nNick Shinn, a _Typophile_ and master of many Trades, may _disagree_, but that is the Beauty of _Discussion_ and _Debate_.\n\n"
    },
    {
      "time": " 21.Mar.2006 7.32pm",
      "content": "Jay, you said having a few words of ROMAN in _italic_ text weirded you out — which is why I suggested further _slanting_ as a solution to YOUR PROBLEM, rather than toggling back to roman, and stuck with the idea that italicization as a form of emphasis is _most noticeably_ about _SKEW._\n\nFor the kind of setting where an all-italics sidebar produces a few words of emphasis in roman, that’s usually at the behest of by-the-book editors following style guides. I guess it boils down to who has the final cut, the editor or the typographer. If it’s the editor, they will likely go with “arbitrary” convention. However, typographers are free to come up with new forms of emphasis: one that’s gained status seems to be switching from serif to sans for URLs and code.\n\n"
    },
    {
      "time": " 21.Mar.2006 8.29pm",
      "content": "Aw, hang on. I was hoping that what I was saying what just pointing out a few things. I’m not critiquing your effort to solve “MY PROBLEM.” I mean, extra slanting doesn’t turn me on, but it’s one suggestion, and I appreciate that. Willickers. Sorry. My effort to _be silly_ obviously did not amuse. _I_ a_pol_ogize.\n\n"
    },
    {
      "time": " 21.Mar.2006 8.35pm",
      "content": "Also, I come here as someone who is not necessarily humble by nature, but I am humbled by the vast reserves of knowledge so many of you guys have, and by the fact that unlike me, Herr Doktor Professor of Visual This-and-That, many of you are actually practicing professionals who must deal daily with editors and other characters who may stifle your efforts to do what you need to do. Mea culpa if I annoyed. I mean that. And so does Ultraman (my avatar).\n\n"
    },
    {
      "time": " 21.Mar.2006 8.38pm",
      "content": "BTW, to me much better than all this slant, backslant, extra slant, double slant business is the judicious use of weight. For one thing, you avoid the arbitrary -and often undesirable- skew an Italic brings to the “voice” of the Roman. See TYPO magazine for a superb example of this strategy.\n\nhhp\n\n"
    },
    {
      "time": " 21.Mar.2006 9.20pm",
      "content": "“behest of by-the-book editors following style guides.”\n\nYeah, like the inane Chicago Manual of Style.\n\n“I guess it boils down to who has the final cut, the editor or the typographer.”\n\nAnd we all know who that is, and it ain’t the one who’s _getting_ paid for it.\n\n—K\n\n"
    },
    {
      "time": " 21.Mar.2006 9.34pm",
      "content": "And in the realm of writing in universities— MLA, APA, Chicago, etc., etc.— they all change every couple years, and that wreaks havoc on our efforts to teach students about documentation styles, from the freshman to the grad students who are trying to learn what they need to know to be editors (not defending editors— it’s all just part of the system!).\n\nMuch easier in the old days, from the writer’s perspective anyway: type it up on the ol’ typewriter, double-space it, underline stuff you want in itals. Then, I guess the typesetters and editors hash it out from there...\n\nAnd then there’s LaTex. It really “wows” at first, and it does help people get their equations formatted for small journal presses and the like. And Knuth certainly is a major genius. But it renders the whole art of typography kind of void of meaning, unless you’re an uber-geek who can tame it to do what you really want.\n\nI sympathize, even if I’m propped in an ivory tower (well, around here, it’s more like a crumbling concrete tower...). I’m an artist by nature (and by a very small amount of training). I friggin’ love this stuff, as I’ve said, because it makes my brain cells boogie in all kinds of interesting directions. Thanks again for the suggestions above.\n\n"
    },
    {
      "time": " 21.Mar.2006 9.35pm",
      "content": ""
    },
    {
      "time": " 22.Mar.2006 12.41am",
      "content": "\\> Knuth certainly is a major genius.\n\nExcept when it comes to type, where he has yet to graduate, to get  \nover the fallacy of strokes. (And this is coming from a CompSci major.)\n\nhhp\n\n"
    },
    {
      "time": " 22.Mar.2006 5.53am",
      "content": "Jay, try to think of bouma shape in whole-word pattern terms, not in envelope-structure or silhoutte terms. In other words, try to think of the whole word as a pattern of whites (counters, inter-letter spaces) and blacks (stems, bowls, diagonals) whose visual integrity as a unit is more overpowering than the identity of the component parts.\n\nThis makes visual wordform resolution a special case of direct pattern recognition (perceptual, white + black based), not a case of letter-recognition mediated word-identity computation. (In the later scenario the letter recognition part is perceptual, and black-specific, the computation part post-perceptual. This route is less direct.)\n\n ![](http://web.archive.org/web/20071011184546im_/http:/typophile.com/files/%5D%5Bimg:)\n\n"
    },
    {
      "time": " 22.Mar.2006 7.03am",
      "content": "_This makes visual wordform resolution a special case of direct pattern recognition_\n\nBah! Humbug! Ok, ok. Yes, I see the perceptual point. But sooner or later it just becomes a matter of semantics— are you seeing a “chicken” or “undifferentiated chicken parts”? If my eyeballs are taking in not a silhouette or outline but the entire pattern of whatever atomistic elements make up units of vision, and my brain is sorting those into a “word pattern,” then I just don’t see how this is different in any substantive way from saying that the eyeballs are taking in a collection of “letter patterns,” each letter of which is built from the same elemental units, and then my brain is processing these in parallel.\n\nObviously, I don’t think it’s completely either/or. But I just cannot buy this idea that we see words as NOTHING BUT unitary Gestalts not composed of smaller components. “Shapes” exist in perceptual hierarchies— they may be constituted of smaller component shapes, and they exist in fields of shapes within which they find themselves, via our perceptions, becoming components of larger shapes.\n\nI mean, if “the bouma” is so “real,” why both designing type-faces? why not “word fonts”? The closest we get are ligatures and logos.\n\n- Jay\n\n"
    },
    {
      "time": " 22.Mar.2006 7.38am",
      "content": "“I just don’t see how this is different in any substantive way...”\n\nThe different schemes predict different processing routines at the neuroanatomical and visual cortex level, and because of that make different predictions about what’s important at the level of type design and typography, and why. For instance, Kevin Larson predicts wider interletter spacing is better; I predict a rhythmic spacing which frustrates letter recognition is better; I am unclear where Hrant stands: tighter than rhythmic?\n\nIf you want to push beyond intuitive and ad hoc judgements about readability and verticality, no matter how craft-based your intuitions might be, you’re going to have to go there. Most type-involved people are sufficiently confident about their intuitions and the craft knowledge of the ages to not want to or need to. Going there is like entering a labyrinth.\n\nI happen to be interested in all this because I want to see if craft knowledge has a robust ’perceptual processing in reading’ foundation or if it’s foundation is cultural historical precedence or personal aesthetic preference.\n\n"
    },
    {
      "time": " 22.Mar.2006 7.48am",
      "content": "“I just cannot buy this idea that we see words as NOTHING BUT unitary Gestalts not composed of smaller components. “Shapes” exist in perceptual hierarchies— they may be constituted of smaller component shapes, and they exist in fields of shapes within which they find themselves, via our perceptions, becoming components of larger shapes.”\n\nGestalts _are_ composed of smaller components, but perceptual processing optimized for reading is not just climbing the perceptual hierarchies. Perceptual processing seeks shortcuts, so that sense or a meaning becomes directly embedded in the sensible whole, without having to chomp through the letter-route produced phonological computational and orthographic computational noise.\n\n"
    },
    {
      "time": " 22.Mar.2006 9.02am",
      "content": "Jay, Peter has nicely covered two of the three things in  \nyour post I was going to address, but there remains the  \nmatter of your impressively early epiphany:\n\n\\> why both designing type-faces? why not “word fonts”?\n\nBingo.\n\nBut there are two good reasons to make individual letters:  \n1) It’s easier, both in terms of manpower and technology.  \n2) You always still need the individual letters.\n\nOn the other hand, with OpenType, and with some sophisticated  \nlinguistic analysis, a font could very well ramp up readability  \nby intelligently varying glyphs depending on context.\n\n\\> I am unclear where Hrant stands: tighter than rhythmic?\n\nHow could I, when I don’t think rhythm exists (during immersion)?\n\nBut if you’re asking exactly how tight I think things should be,  \nI have to say I really can’t know until we have some truly good  \nempirical testing. All I know is that it matters that it’s tight.\n\n\\> Perceptual processing seeks shortcuts\n\nYes, this is key.  \nAnd what’s missing from Larson’s entirely too  \nalgorithmic (as opposed to heuristic) model.\n\nhhp\n\n"
    },
    {
      "time": " 22.Mar.2006 9.14am",
      "content": "Hrant, you said earlier “the decipherment of single letters—which is indeed the norm in the fovea—can be seen as a special case of bouma decipherment.”\n\nThe Dutch have a word for what happens in the fovea: ’scherpstelling’, literally ’sharp-rendering’. In the immersive reading of the experienced motivated reader, what is ’sharp-rendered’ in foveation? Just the fixated letter or the parafoveally pre-indexed whole now filling the attentional window? Why should breaking the whole up be the norm in the fovea when breaking it up is inhibited by cross-letter binding in tight spacing? Breaking it up—the decipherment of single letters—only happens in reading aquisition and ’adaptive learning’ (the adaption to unfamiliar words). Or do you mean to say that foveation is only important in reading acquisition and adaptive learning?\n\n ![](http://web.archive.org/web/20071011184546im_/http:/typophile.com/files/%5D%5Bimg:)\n\n"
    },
    {
      "time": " 22.Mar.2006 9.19am",
      "content": "\\> Why should breaking the whole up be the norm\n\nBecause the results are qualitatively more reliable. Why do you think we never regress back to text that’s been directly foveated? Since the information is there all crisply, and the brain is powerful enough, there’s no reason to rely on the fuzzier (more error-prone) lower frequencies, because no speed is gained. One great thing about this is that it fully assimilates Larson’s model - gobbles it up.\n\nA good test of this though would be to see if we miss typos that are foveated.  \nAnd if we do, can that not instead be attributed to <cite>letterwise legibility</cite> issues.\n\nhhp\n\n"
    },
    {
      "time": " 22.Mar.2006 9.34am",
      "content": "“Why do you think we never regress back to text that’s been directly foveated?”\n\nI would never make, and haven’t ever made that claim.\n\nAnd why do we need increased reliability if sufficient certainty for sense-following has already been acheived in parafoveation?\n\n"
    },
    {
      "time": " 22.Mar.2006 9.40am",
      "content": "So you’ve seen evidence that we regress back to foveated text?  \nIf you have, then that’s a big deal.\n\nhhp\n\n"
    },
    {
      "time": " 22.Mar.2006 9.54am",
      "content": "“In other words, try to think of the whole word as a pattern of whites (counters, inter-letter spaces) and blacks (stems, bowls, diagonals) whose visual integrity as a unit is more overpowering than the identity of the component parts.”\n\nYeah! But not quite.\n\nI’ve read Kevin’s first stuft now, in partiuclar the studeis he builbs on.  \nIt’s very interesting how so many simple studies can all point to one and only one thing, de Bouma. But when you add “as a pattern of whites (counters, inter-letter spaces) and blacks,” you miss, “and a pattern of thicks and thins in intersection along the x ht.”, which is what defines that subtle zone, along with the extrudings, so that we can get “that word(s)” and go on.\n\nThe question(z) I have for the Bouma Maker Masters are: if you demote the “letter-by-letter” and “words-by-words” approach to “nyet” how come you can not compress this text by 50% and still “have a good time”, much less improve speed with shorter boumi to zippo thruo?, How do Germans “Do It”?, How do our new words come easy? (both the new ones we Learn, and the new 1s we Make)? and what is a child in this theory, and when does it become Boumawara?\n\nNo myne companioneres, they cannot answer these reading questions unless there is a multiple function planetary mechanism at work. Reading is not just one method. . .even within a language, even across the languages of a script, and especially, not across the scripts of the world. And as such it is not likely to be “addressed” for the screen by “one thing” attractive as that may seem. Apple is small market, they can and did pufffft and patoey in the OS display. Even on the Mac though, I can, through de vizardry of digital outline and know-how, get what I want. But Windows, is a huge market, billion o users, and these people are demanding of options, and ain’t sew sofistigated.\n\nSo, de Emperor’s new question is — why? why do we have a long and costly set of experamints, and marketing, and videos, and specialty fonts, and all zee other choices are pufffft and patoey, 4 All users, globularly and globally?\n\n"
    },
    {
      "time": " 22.Mar.2006 10.02am",
      "content": "Oops, Hrant, I thought your were accussing me of making the claim that we never regress back to text that’s already been foveated, not asking why this is never done. Is it never done? Are regressive saccades always to a skipped word or bouma? Or is it just not the norm?\n\nBut my question about ’sharp-rendering’ still applies: what is sharp-rendered in the regressive saccade? Just the fixated letter or the previously skipped whole now filling the attentional window? Why should breaking the whole up be the norm in the foveation of skipped boumas when breaking it up is inhibited by cross-letter binding in tight spacing, especially if the word is familiar, like skipped words typically are?\n\n(Did you catch my edit to the post you just replied to?)\n\n ![](http://web.archive.org/web/20071011184546im_/http:/typophile.com/files/%5D%5Bimg:)\n\n"
    },
    {
      "time": " 22.Mar.2006 10.13am",
      "content": "_the judicious use of weight._\n\nYes, that would be “emphasis”, but I don’t think that emphasis is what is generally meant by switching to italic for a few words. Emphasis is metaphorically a change in volume (more ink, more decibels), whereas italic indicates a change in tonality — another voice, or a different category of name. For instance, “in a study published last year in the journal _Antiquity,_ Hunt, Lipo and Britton Shepardson of the University of Hawaii concluded...” Here, italicization disambiguates, or at the very least eases the traffic jam of a string of proper names.\n\nConventions become established because they work. An example is celebrity boldface — blatantly judicious(!) and therefore entirely appropriate for the “coding” it signifies.\n\n"
    },
    {
      "time": " 22.Mar.2006 10.36am",
      "content": "oops! duplicate post. my bad.\n\n"
    },
    {
      "time": " 22.Mar.2006 10.36am",
      "content": "Wow, this is interesting. Didn’t mean to start a foveal-fest. Interesting.\n\nI did mispeak in saying something like Gestalts are themselves atomistic; they form out of elements. Rudolf Arnheim 101. I get that.\n\nNevertheless, I think what it comes down to is what, if any, self-consciously scientific explanation of the neuroanatomy of visual perception one happens to buy into, whether because one is just muddling along and saying “Hmm, X makes more sense to me that Y explanation,” or because one is a neuroanatomist or cognitive pscyhologist or whatever and has a career staked on the establishment of one “view” (boo!) or another.\n\nThe thing I object to is this idea that somehow when people read— even when they read quickly— they somehow, it seems that some of you are saying, don’t really “see” individual letters! I still think, and maybe am a fool to, that Jay, Joy, and Jap, are three different things, and I doubt except when very fatigued or when MISTYPING (which is a whole other barrel of monkey), that I would ever sort of “blur” them perceptuo-cognitively. And they appear different because I am processing the individual parts ALONG WITH the whole, perhaps.\n\nNevertheless, there’s no end of intriguing questions at this intersection of skew, bouma, and fovea.\n\nAnd this is really interesting:\n\n_On the other hand, with OpenType, and with some sophisticated  \nlinguistic analysis, a font could very well ramp up readability  \nby intelligently varying glyphs depending on context._\n\nNow THAT would be cool indeed.\n\n"
    }
  ]
}
