{
  "id": "18710",
  "title": "\"Best\" digital version of Futura?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I’m working on a corporate branding system at a new company that uses Futura as their corporate face.\n\nThey use a version called FuturaEF that appears to be incomplete. Does anyone out there know which digital version of Futura is considered to be the “best”? By that I mean most complete and well-drawn.\n\nthanks for the help\n\neric\n\n| Attachment | Size |\n| --- | --- |\n| [typomancy—The best Futura money can buy..pdf](http://web.archive.org/web/20150416072254/http:/typophile.com/files/typomancy%E2%80%94The%20best%20Futura%20money%20can%20buy..pdf) | 108.93 KB |\n\n",
  "author": "ericgio",
  "time": "21 Mar 2006 — 9:31am",
  "uid": "3814",
  "comments": [
    {
      "time": "21 Mar 2006 — 12:14pm",
      "content": "I've heard that the URW version is the \"best\", but I personally prefer using Adobe's and Bitstreams together. The weights vary a little as do some of the details -- traps and no traps -- which I find important.\n\n"
    },
    {
      "time": "21 Mar 2006 — 12:16pm",
      "content": "[The best Futura money can buy](http://web.archive.org/web/20150416072254/http:/www.typomancy.org/2005/02/07/the-best-futura-money-can-buy/)\n\n[The most complete???](http://web.archive.org/web/20150416072254/http:/www.p22.com/lanston/products/twentiethcen.html)\n\n"
    },
    {
      "time": "21 Mar 2006 — 12:54pm",
      "content": "The URW package looks great. everything I want for a bundle price. Paul, I had seen the FuturaND version, but it's awfully expensive since they make you buy each one separately (I think).\n\nTiffany, why do you prefer Adobe/Bitstream over URW?\n\n"
    },
    {
      "time": "21 Mar 2006 — 12:57pm",
      "content": "[Neufville](http://web.archive.org/web/20150416072254/http:/www.myfonts.com/fonts/neufville/futura-nd/?refby=typographica) claims most authenticity.\n\n_> Futura ND was completely digitized anew from the original sources of the Bauersche Giesserei, now hold by FT Bauer in Barcelona._\n\n"
    },
    {
      "time": "21 Mar 2006 — 1:46pm",
      "content": "Adobe for me - Open Type. Cross platform, so they can apply it after you've gone - good range - good cut - Chris Mitch\n\n"
    },
    {
      "time": "21 Mar 2006 — 1:48pm",
      "content": "Because I already have licensed them. =^D\n\n"
    },
    {
      "time": "21 Mar 2006 — 5:36pm",
      "content": "Careful, [Adobe's Futura has some problems](http://web.archive.org/web/20150416072254/http:/www.spiekermann.com/iblog/C61720386/E1641366970/index.html) Most of the other foundries' versions do not have the egg-shaped rounds.\n\n"
    },
    {
      "time": "21 Mar 2006 — 7:04pm",
      "content": "I was going to mention that. It was one of the earliest fonts Adobe released and it is not real good, especially the Heavy weight. I just took a look at a PDF of the current version on Adobe's website. It's not quite as bad as the samples that Erik Spiekermann shows, so it appears they have made some alterations since it was first released, but it's still not great (in my opinion). The other weights aren't as bad, but notice also that the italics are all just slanted romans, not optically adjusted. I'm partial to Bitstream's cut, especially for text.\n\n"
    },
    {
      "time": "22 Mar 2006 — 1:16am",
      "content": "Yes, Adobe's Futura surely isn't that good at all, for example if you set it without linespacing (as was called \"Kompress\" in the days of metal type over here in germany) ascenders and descenders will overlap. That surely woudln't have happened with metal type, so that's a technical fault to Adobe Futura, at least to my understanding.  \nOn the best version, that's a bit down to personal taste i think, as the different digitizings have different approaches or emphasize different aspects and qualities of Futura:  \nThe URW version seems to stress the somewhat elegant quality Futura has and appears pretty thin to me, whereas the Berthold BQ version seems much more stable and robust to me (and if you look at old prints of Futura, it surely had that quality as well and didn't come across as the super-elegant thing we're used to from cosmetics packagings and the like today!)  \nSo my personal vote would be for the BQ-version if i had to buy it – the strange thing is Futura is one of the faces i love, admire and respect the most – but never use it! :-)\n\np.s. besoides the best digizings issue, it's such a shame that the different optical sizes that were made for Futura metal didn't survive into the digital age…\n\n"
    },
    {
      "time": "22 Mar 2006 — 7:51am",
      "content": "The Futura from EF and URW are identical in the basic design since they come from the same source. The URW version is in OpenType, has small caps, CE characters as well as Greek and Cyrillic (although these are very poor).\n\nA.\n\n"
    },
    {
      "time": "14 Aug 2007 — 7:05am",
      "content": "Our web site designer is recommending Futura MdCn BT for a couple of uses, notably titles. I want to revise templates in our publications to match the web site, but our analysts' needs are rather different from our web site designers....\n\nFutura MdCn BT has about the ugliest micron char I've ever seen, and lacks all other Greek chars. The URW char set is much more complete. However, the [Greek section](http://web.archive.org/web/20150416072254/http:/www.myfonts.com/fonts/urw/futura/t-medium-condensed/opentype-ps/261972/charmap.html?vid=261972&cpselect=UNI8) is inexplicably missing a only few chars (Omega, Delta and mu), which are naturally the ones we use in formulas the most frequently. The Greek version of the font has all those chars, but loses many mathematical operators. \\*sigh\\*\n\nEF's Md Condensed has the Greek chars we need, the mathematical operators, and comes in ital, so that looks like the winner for now. I wish we could have small caps, too, but sometimes we have to be practical!\n\n"
    },
    {
      "time": "15 Aug 2007 — 9:59pm",
      "content": "Don't believe everything you read. The outline issues in Herr Spiekermann's examples of Adobe's version of Futura were fixed something like 15 years ago (maybe more, I'd have to do some digging).\n\nToo bad he didn't feel it necessary to add that clarification.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "16 Aug 2007 — 4:19am",
      "content": "Have you fixed the dimension issues as well? As i remember, ascenders and descenders of Adobe's version of Futura used to clash/overlap when set without additional linespacing (which – obviously – didn't happen in lead/metal original Futura). At least to me that felt like an issue over the years…\n\n"
    },
    {
      "time": "16 Aug 2007 — 9:31pm",
      "content": "Neue Futura (Futura ND) is the most complete version. The small caps were from the original drawings from Paul Renner. I have not had any problems with it in Font Book.\n\n"
    },
    {
      "time": "2 Sep 2010 — 10:23am",
      "content": "Paul Hunt's Typomancy link, The Best Futura That Money Can Buy, has dropped off Typomancy website for some reason, but you can still find it [here](http://web.archive.org/web/20150416072254/http:/web.archive.org/web/20060210114255/http:/www.typomancy.org/2005/02/07/the-best-futura-money-can-buy/) at the Wayback Machine.\n\nAnd for what it's worth, I like the Neufville Digital's version the best, though The Foundry's Architype Renner makes a nice addition with its more extreme original designs for some of the letters.\n\n"
    },
    {
      "time": "3 Sep 2010 — 12:57pm",
      "content": "Just in case Wayback fails us someday I've attached the article as PDF in the original post.\n\n"
    },
    {
      "time": "11 Sep 2010 — 2:58am",
      "content": "@Tiffany: Great. ;-)\n\n"
    },
    {
      "time": "9 Jan 2011 — 5:20am",
      "content": "I'm coming into this dicussion severeal years late but what were Erik Spiekermann's examples of early Adobe Futura's problems? The original link isn't working, I did some digging and found [this](http://web.archive.org/web/20150416072254/http:/spiekermann.com/en/futura-the-perfect-geometric-typeface/) though – same post?\n\n ![](http://web.archive.org/web/20150416072254im_/http:/typophile.com/files/b87b414ca8a76612193d78fbcc4d19_4440.gif)\nThomas, I grabbed this preview of Adobe Futura Heavy on MyFonts and it still has the egg-shaped counters?\n\nAnd Tiffany, how and why do you use Bitstream Futura and Adobe together? Bitstream for italics, Adobe for roman?\n\n"
    },
    {
      "time": "9 Jan 2011 — 10:19pm",
      "content": "Adobe's Futura has always looked like this, as far as I know. More on that [here](http://web.archive.org/web/20150416072254/http:/fontsinuse.com/barbara-kruger-kim-kardashian-futura/).\n\n"
    },
    {
      "time": "14 Jan 2011 — 6:20am",
      "content": "Hmm so what were the problems that Adobe fixed \"something like 15 years ago\" ?\n\n"
    },
    {
      "time": "21 Jan 2011 — 11:56am",
      "content": "I realized I also have URW and Linotype. (I think I've licensed too many versions of Futura.)\n\nAdobe's Futura Heavy does look squooshed to me, but the others do not. What am I not seeing?\n\n ![](http://web.archive.org/web/20150416072254im_/http:/typophile.com/files/Adobe_6423.png)\n\nBitstream — _Copyright 1990-1999 as an unpublished work by Bitstream Inc. All rights reserved. Confidential._\n\n ![](http://web.archive.org/web/20150416072254im_/http:/typophile.com/files/Bitstream_4076.png)\n\nLinotype — Although the copyright says: _Copyright (c) 1987, 1991, 1993 Fundicion Tipografica Neufville S. A. This record material and the data recorded thereon is the property of Fundicion Tipografica Neufville S. A. and Adobe Systems Incorporated, or its licensors, and may not be reproduced, used, displayed, modified, disclosed or transferred in any manner without the express written approval of Fundicion Tipografica Neufville S. A. and Adobe Systems Incorporated._\n\n ![](http://web.archive.org/web/20150416072254im_/http:/typophile.com/files/Linotype_6037.png)\n\nURW — _Copyright URW Software, Copyright 1992 by URW_\n\n ![](http://web.archive.org/web/20150416072254im_/http:/typophile.com/files/URW_3895.png)\n\n"
    },
    {
      "time": "30 Jan 2011 — 6:38am",
      "content": "Thanks Tiffany.  \nI never became eccessively affectionate with Futura, but I think the problem is that I have become accustomed to the typeface in its early digital formats. very limited, and based on a single point size, while I cherished a great number lead types which were still in use in the 1970s here in Italy.  \nFor example, I think there is no comparision with the original Monotype lead version of Gill Sans in all its point sizes, and their digital version.\n\nIf someone will make the effort to design a few good master sizes, and with the quality which seems to have the Neufville Digital ND version (I think Robert Trogman is right about the accuracy), we will probably have an adequate Futura for every page format with all the needed sizes.\n\n"
    },
    {
      "time": "30 Jan 2011 — 9:37pm",
      "content": "Is there a difference between PL Futura Maxi and CG Futura Maxi? If so, what is it and who designed the CG version? I know that Victor Caruso designed the PL version.\n\n"
    },
    {
      "time": "4 Apr 2013 — 6:01pm",
      "content": "It's been a while since this discussion was active, but folks probably still end up here when searching so I'll toss in something I posted recently at Quora: [a roundup of Futura versions](http://web.archive.org/web/20150416072254/http:/www.quora.com/Typefaces/Which-foundrys-version-of-Futura-should-I-buy/answer/Stephen-Coles-1) that might be a useful companion to Tiffany's post above.\n\n"
    },
    {
      "time": "7 Jul 2014 — 11:32am",
      "content": "Stephen Coles’ Quora roundup mentions that some of the variants contain Paul Renner’s “whacky” designs for several letters, but fails to mention which ones contain which designs and whether they make them easily available (several stylistic sets `ss……`, single stylistic alternates `salt`, several character variants `cv……` or a combination thereof).\n\nAlso, I’ve seen at least 5 ‘a’, 4 ‘g’ and 3 ‘b’ variants. Does any Futura implementation contain several of them?\n\n"
    },
    {
      "time": "8 Jul 2014 — 12:00am",
      "content": "Christoph,\n\ncheck Architype Renner:\n\n[http://www.foundrytypes.co.uk/the-foundry-typefaces/new-release/params/a...](http://web.archive.org/web/20150416072254/http:/www.foundrytypes.co.uk/the-foundry-typefaces/new-release/params/architype-renner/opentype/level-1/regular \"http://www.foundrytypes.co.uk/the-foundry-typefaces/new-release/params/architype-renner/opentype/level-1/regular\")\n\n"
    },
    {
      "time": "8 Jul 2014 — 4:37am",
      "content": "I think Stefan Ellmer’s revival of the original Futura drawings are much more interesting than Architype Renner. You can see it in use here: [http://ultima.no/en/](http://web.archive.org/web/20150416072254/http:/ultima.no/en/ \"http://ultima.no/en/\")\n\n"
    },
    {
      "time": "8 Jul 2014 — 7:26am",
      "content": "It seems Stefan Ellmer’s [Ur 1927](http://web.archive.org/web/20150416072254/https:/www.behance.net/gallery/13585057/Typeface-Ur-1927) comes quite close to what I’m looking for. Examining your example site, I find that the dotted ‘r’, which I thought I particularly liked, doesn’t work well with ‘y’ following it – it’s a rare combination in German, but frequent in English, and a ‘u’-based upsilon might look better.\n\nThe Architype version I had seen already, but like with so many typefaces, it’s hard to find a good documentation of the actual glyph repertoire and OT features. (Font) designers tend to advertise their products with pretty examples _only_, forgetting about tech specs.\n\n"
    },
    {
      "time": "10 Jul 2014 — 8:44am",
      "content": "Crissov, It’s true that The Foundry (makers of Architype Renner) have never been great at showing off their fonts. They recently signed up with Fonts.com which improved things, but the [Character Map viewer](http://web.archive.org/web/20150416072254/http:/www.fonts.com/font/the-foundry/architype-renner/regular?SiteId=224#character-map) there is not very capable either, omitting stylistic alternates such as the experimental forms you want to see.\n\nLTC’s version of [Twentieth Century](http://web.archive.org/web/20150416072254/http:/www.myfonts.com/fonts/lanston/ltc-twentieth-century/?refby=typographica) (a metal copy of Futura) also includes these alts, however, and they are easily [seen](http://web.archive.org/web/20150416072254/http:/www.myfonts.com/fonts/lanston/ltc-twentieth-century/pro-medium/glyphs.html?refby=typographica) and tested at MyFonts.\n\n ![](http://web.archive.org/web/20150416072254im_/http:/typophile.com/files/Google%20ChromeSnap-010_5482.png)\n\n"
    },
    {
      "time": "10 Jul 2014 — 11:13am",
      "content": "Crissov: I’m sure Stefan would adjust the r for you, if you asked him.\n\n"
    }
  ]
}
