{
  "id": "18748",
  "title": "(x) Die Neue Typographie - Aurora Grotesk (Akzidenz-Grotesk) {Kris (self), Craig}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I think it's Akzidenz Grotesque, but very happy to be proven totally stoopid!\n\n—K\n\n ![](http://web.archive.org/web/20110812061148im_/http:/typophile.com/files/die-neue.jpg)\n\n",
  "author": "<a href=\"/web/20110812061148/http://typophile.com/user/1519\" title=\"View user profile.\">kris</a>",
  "time": "<br>",
  "uid": "1519",
  "comments": [
    {
      "time": "",
      "content": "Certainly looks like it. You just gotta love that Super weight.\n\n"
    },
    {
      "time": "",
      "content": "I am sure that I read somewhere that it was set in Akzidenz Grotesque? It doesn’t reference it in the English translation does it?\n\n"
    },
    {
      "time": "",
      "content": "Chur!\n\nI don't think that it is mentioned in the text, although I did just blast through it.\n\n—K\n\n"
    },
    {
      "time": "",
      "content": "I think it's much older than Akzidenz...certainly a Grotesk, but dating from the very late 1800s into the early 1900s.\n\n"
    },
    {
      "time": "",
      "content": "Wasn't AG released in 1896?\n\nThat \"s\" on the extra bold sure looks like AG to me.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Yes, it was released in [1986](http://web.archive.org/web/20110812061148/http:/www.identifont.com/show?FU) and I think this is definitely Akzidenz-Grotesk. I think the ink bleeding distorts some features to our imagination.\n\nI love Typophile! I just did a search and discovered [this](http://web.archive.org/web/20110812061148/http:/typophile.com/node/17643) great thread on AG which is one of my favourite faces. :^)\n\n"
    },
    {
      "time": "",
      "content": "Au contraire, mon frère…\n\nCompare your sample and Akzidenz Grotesk BQ…\n\n ![](http://web.archive.org/web/20110812061148im_/http:/typophile.com/files/akzidenz_NOT.gif)\n\nThe red highlights indicate NO WAY, JOSÉ mismatches...I repeat, it's much older than Akzidenz.\n\n"
    },
    {
      "time": "",
      "content": "You could be right... have you tried comparing the sample to AG Medium?\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20110812061148im_/http:/typophile.com/files/akzidenz_NOT2.gif)\n\nMiddle sample AG Book; bottom sample AG Medium. Still not match, if you look closely...\n\n"
    },
    {
      "time": "",
      "content": "Could it be that they are different optical sizes? You are comparing digital to metal. And we all know how many arguements that creates!\n\n—K\n\n"
    },
    {
      "time": "",
      "content": "[FF Bau](http://web.archive.org/web/20110812061148/http:/www.fontshop.com/showfont.cfm?fid=FF.11312.0.0) is obviously similar as it is [inspired](http://web.archive.org/web/20110812061148/http:/www.orangeitalic.com/bau.shtml) by the types of that era.\n\n ![](http://web.archive.org/web/20110812061148im_/http:/typophile.com/files/FontAgent%20ProScreenSnapz001.jpg)\n\n"
    },
    {
      "time": "",
      "content": "In Nick's crop of your sample, the <cite>a</cite> has a tail which is usually only evident in the light, book, regular weights but the <cite>s e g</cite> looks like it's from the bolder weights (the shorter descenders, angled terminals on <cite>s</cite> and <cite>e</cite>)\\*. That said, the digitalised AG has many inconsistencies throughout the weights and I have no idea if the digitalisation was true to metal.\n\n\\* [PDF](http://web.archive.org/web/20110812061148/http:/www.typos.ch/Berthold-Shop/Berthold_BE_A-Z/BE_AGB_-_Akz_Grotesk/Berthold_Akzidenz_Grotesk_BE.pdf) from typos.ch\n\n"
    },
    {
      "time": "",
      "content": "As you can read in the thread Geoff quotes, there is and was no such thing as _the_ Akzidenz Grotesk. And you certainly cannot (oldnick) compare a digital sample of AG Light with a printed one from the 20s. AG – and that's all I'll repeat from previous posts – has been through many iterations, from hot metal, where every size looked different, to photosetting, where one design had to fit all sizes, to digital where there is AG and AG Old Style.\n\nThe sample is definitely set in AG Regular and Bold (Fett). The Super weight was introduced in the 60s only, designed by GG Lange. It never existed in hot metal.\n\n"
    },
    {
      "time": "",
      "content": "From the \"Note on the book and its design\" at the back of the English translation (UC Press, 1995): \"Aurora Grotesk, shown in the Berthold Phototypes E1 catalog (1974), was identified as the typeface closest to that used in the original German edition.\" (It goes on to explain that this wasn't available digitally so others were chosen for the translation.)  \nThe sample in this thread is from a publicity leaflet for the book, which is also reproduced in the introduction (p.xxi) of the translation.\n\n"
    },
    {
      "time": "",
      "content": "…but on page xxx (yes, that really is three x's… i.e., the Roman numeral for \"30\") of that same English translation, the Robin Kinross essay at the beginning of the book states:\n\n\"The typeface used was an 'Akzidenz Grotesk': a 'jobbing sanserif,' designed anonymously, probably in the 1900s. For the reasons already outlines, he would have preferred this over any of the recently designed sanserifs, which (in the case of Futura) would hardly have been available for purchase at the time the book was being set…\"\n\n\"…But, for the purpose of characterizing Tschichold's preferences, 'Akzidenz Grotesk' in a light (as against medium or regular) weight is sufficient description.\"\n\n"
    },
    {
      "time": "",
      "content": "_you certainly cannot (oldnick) compare a digital sample of AG Light with a printed one from the 20s_\n\nTrue: but, unless the particular project for which this typeface is sought is going to be set in metal and printed on a letterpress, the digital sample of whatever typeface it turns out to be is what you're going to end up with...\n\n"
    },
    {
      "time": "",
      "content": "Well, interestingly enough I came across the answer to our inquiry here while doing some redaing during a lersiurely afternoon. I was looking back to some pages in \"Paul Renner: The Art of Typography\" by Christopher Blake, and came across some comments concening Tschicholds' reasoning for not setting Die Neue Typographie with Futura. Here is an excerpt:\n\n\"Jan Tschichold's book, Die Neue Typographie, could have feasibly been set in Futura, which was already on the market when the book was in preperation. Even if the typeface had not been quite ready, Renner could have secured its use for the book; instead Tschichold has it set in a grotesk (AG?). There may have been an element of personality clash in this decision; yet, when asked in 1960 why he had not used Futura for the book, Tschichold replied that he never really deemed it suitable for setting texts.\"\n\n"
    },
    {
      "time": "",
      "content": "In addition, it would be impossible to compare a printed sample of Furtura produced with metal foundry to any digitally created specimen. We all know that each point size was meticulously crafted by Renner and his team to accomplish the optical precision Furutura expresses.\n\n"
    },
    {
      "time": "",
      "content": "you know, now I feel completely silly. I guess i was just too wrapped up in the book to even realize that what I said has little to do with the original question posed. my apologies.\n\n"
    },
    {
      "time": "",
      "content": "Insight is always welcome here, t&k -- even when occasionally misplaced.\n\n"
    },
    {
      "time": "",
      "content": "Hello,  \nyou talked about Aurora Grotesk here.  \nI am currently drawing a font inspired by this\n\n ![](http://web.archive.org/web/20110812061148im_/http:/typophile.com/files/IMG_0023_4112.JPG)\n\nand it could be some variation of Aurora (however its absolute goofy typography).  \nPlease can someone paste Aurora catalog or something else that could help me?  \nThanks\n\nJan Novak\n\n"
    }
  ]
}
