{
  "id": "18759",
  "title": "Types for Digital Printing",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hello,\n\nregarding digital printing, i was wondering if anyone had any suggestions on typefaces and or type treatments, or any other type nuance that would lend themselves to this process. are there any type related problems that anyone has run into with a digital job? would you use a different approach if you were going to design a typeface that is intended for digital printing?\n\nthank you for reading this post. any thoughts would be greatly appreciated.\n\n------------------  \nnick cottrell\n\n",
  "author": "istitch",
  "time": "23 Mar 2006 — 10:27am",
  "uid": "9718",
  "comments": [
    {
      "time": "23 Mar 2006 — 1:25pm",
      "content": "This was far before the digital era, but is the only thing that comes to mind right off the bat. Bell Centennial which was designed by Matthew Carter. Specifically used at small point sizes, it avoided many problems that you get with sub-8 point type and dot gain.\n\nOther than that, having worked with two HP Indigo's, I do not really think that there is any difference between the type of quality that you can expect with fonts from a digital press then you would with a traditional press. The digital presses have their limitations, but they really do not restrict typography. There have been some jobs, high-end photography stuff, were the client thinks they can get good reproduction on the digital press, just like on the traditional press, and this is just not the case. Overall, IMO, the differences are more to do with color, sharpness, and tonal inconsistencies in photographs than with anything to do with type.\n\n"
    },
    {
      "time": "23 Mar 2006 — 1:44pm",
      "content": "thanks for the reply Matthew,\n\ninteresting…\n\ni just recently purchased [ITC Charter](http://web.archive.org/web/20131021075026/http:/www.myfonts.com/fonts/linotype/itc-charter/) by Matthew Carter and noticed that the letterforms have some unique features in regards to the contruction of the serifs and terminals (especially in the italic). then i learned that it was designed for laser printer use. i'm wondering if these features have some functional purpose, or if they are simply aesthetic.\n\nalso, in regards to ink traps and dot gain, are these features still beneficial when you are using a digital press?\n\n"
    },
    {
      "time": "23 Mar 2006 — 6:00pm",
      "content": "They are to an extent I imagine seeing as the paper will still absorb the ink. As stated above the real difference in using digital press is the color and quality and type isn't really affected by that. In my past experiences the only printing I've had type issues with is newspaper printing and that's generally more the case of the plates shifting.\n\n"
    },
    {
      "time": "23 Mar 2006 — 8:41pm",
      "content": "Digital printing is what every laserprinter does. Back in 1988, I designed ITC Officina just for that purpose. Sturdy with blunt corners. A lot of letters have the same width, which is one of the things Officina inherited from Letter Gothic, which was my monospaced model.\n\nI never presumed that people would use Officina for anything but office correspondence, printed on Laserwriters or other \"modest\" resolution out put device. At the time, 300dpi was the norm, and Officina was made for that.\n\nFF Meta was designed for small sizes on bad paper, with pseudo-serifs and pretend-inktraps. That also makes it suitable for digital printing, which is all about a lot of thick ink and oil onto plain paper at medium resolution. The faces that worked well for bad printing conditions obviously work well for digital printing.\n\n"
    },
    {
      "time": "24 Mar 2006 — 9:37am",
      "content": "much appreciated Erik. thank you.\n\n"
    },
    {
      "time": "24 Mar 2006 — 9:54am",
      "content": "I agree with the above comments. Most of the time, when you hear about \"digital printing\", one is talking about xerographic devices. Printers such as the HP Indigo, use liquid \"ink\", but the process is much the same. The plastic which holds the pigment is pressed onto the surface of the paper, but not into the paper they way letterpress does. Even litho inks interact more intimately with paper fibers. Devices like the Indigo can have their own, unique pathologies if they are out of adjustment. This is more true with color printing, where the printer may not understand features like overprinting.  \nOf course nowdays this mainly matters at small sizes.\n\nAlso, a lot of high speed photocopiers still produce documents at 300/600ppi. In those cases, Erik's types really look great. I also like Zapf's Melior.\n\n"
    }
  ]
}
