{
  "id": "18782",
  "title": "Recommend Me Three Typeface Families",
  "forum": "Design",
  "tags": [

  ],
  "content": "The teachers at my school have asked us students to recommend three typefaces (families), as they are looking to expand their (meager) library on the school’s computers.. and you all here seem to be very handy in recommending fonts when someone is looking for a good alternative to this and that font, so I’d just love for you all to inspire me to find three nice families to recommend.\n\nI was thinking I’d recommend a serif text font, a sans serif and a more fanciful display font (not necessarily House Industries fanciful, but more exotic and unique). Preferrably all available in Opentype formats.\n\nOh, and they have many of the standard classics (Garamond, Baskerville, Bodoni, Bookman, Franklin Gothic, Futura, Palatino, Gill Sans, Helvetica, etc.) so I was thinking I’d recommend some more new and not quite as common fonts. They should be fairly broad in usability though since they’d be used for students on all kinds of projects.\n\nThank you in advance!\n\n [‹ Elegant. bold and edgy capital M? Logo critique too..](http://web.archive.org/web/20071011063257/http:/typophile.com/node/18750 \"Go to previous forum topic\") [2 Questions for the Type Designers ›](http://web.archive.org/web/20071011063257/http:/typophile.com/node/18838 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071011063257/http://typophile.com/user/11945\" title=\"View user profile.\">claes</a>",
  "time": "<br>",
  "uid": "11945",
  "comments": [
    {
      "time": " 24.Mar.2006 7.49am",
      "content": "Do they have money?\n\n(serif text) HTF - Mercury  \n(sans serif) HTF - Gotham  \n(display) Storm - Farao\n\nPretty hard to do just three…  \npeace\n\n"
    },
    {
      "time": " 24.Mar.2006 7.54am",
      "content": "Claes,\n\nInstead of looking for only 3 families, you should look for foundries who have educational discounts. I would email the foundries who have the typefaces you/they would most like to license and ask if they have any discounts for education. You should also consider CD collections insead of just families. For instance, [Storm Type Foundry](http://web.archive.org/web/20071011063257/http:/www.stormtype.com/fonts.html) has the several different collections which has a bevy of differenty typefaces.\n\n"
    },
    {
      "time": " 24.Mar.2006 8.03am",
      "content": "<cite>Do they have money?</cite>\n\ngiven their currently slim library, i highly doubt it. hopefully they can at least get some new faces, though, even if it’ll end up being smaller families.\n\nanyway, all those three you recommended are definitely interesting. i really like the Gotham typeface, so thanks for the reply!\n\n"
    },
    {
      "time": " 24.Mar.2006 8.09am",
      "content": "Beware - HTF fonts are NOT cheap!\n\npeace\n\n"
    },
    {
      "time": " 24.Mar.2006 8.11am",
      "content": "<cite>Claes,</cite>\n\n<cite>Instead of looking for only 3 families, you should look for foundries who have educational discounts. I would email the foundries who have the typefaces you/they would most like to license and ask if they have any discounts for education. You should also consider CD collections insead of just families. For instance, Storm Type Foundry has the several different collections which has a bevy of differenty typefaces.</cite>\n\nthat’s funny, because i just earlier thought about whether foundries offer educational discounts or not. you’d think many do, but i have no idea since i’ve never been in the position of buying fonts that way. they should definitely see if they can find discounts, but maybe they already do that. i’ll certainly mention it to them, so thanks for the tip.\n\ni’ll do check for collections too, that might be more ideal for them.. more fonts for less money. even if those fonts might not have the most amount of styles, it’s not really like they need to buy a family that has 50 different styles.\n\n"
    },
    {
      "time": " 24.Mar.2006 8.20am",
      "content": "This would be a good wiki entry.\n\nI do know that P22 has something set up for education. I think Adobe does. I’d be willing to bet Nick Shinn take this into consideration.\n\nDo email the foundries and ask.\n\n"
    },
    {
      "time": " 24.Mar.2006 9.34am",
      "content": "and before anyone else points it out, i did notice [this thread](http://web.archive.org/web/20071011063257/http:/www.typophile.com/node/15732) just now, although i do still want everyone’s recommendations for those three fonts/families. it’s always great to find out about fonts you hadn’t encountered before.. so keep ’em coming, please!\n\n"
    },
    {
      "time": " 24.Mar.2006 9.47am",
      "content": "If money’s short, look at [IM Fell](http://web.archive.org/web/20071011063257/http:/www.iginomarini.com/fell.html): free Baroque text and display fonts, at least one of which (Van Dijck’s Fell English roman) shows off rather more intelligent text-type design than is to be found in many a new creation - look at the clever variation in vertical alignment, by which ascenders and descenders are emphasized.\n\n"
    },
    {
      "time": " 24.Mar.2006 9.53am",
      "content": "Serif Text = Delicato, Anziano, Tarocco  \nSans Serif = Sophisto, Stalemate  \nDisplay = Oxtail, Luminance\n\nSee for yourself at [http://www.macrhino.com](http://web.archive.org/web/20071011063257/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\nEducational discounts might be possible.\n\n"
    },
    {
      "time": " 25.Mar.2006 7.19am",
      "content": "more suggestions, please?\n\nhow about Neo Sans?\n\n"
    },
    {
      "time": " 25.Mar.2006 11.17am",
      "content": "[How about it?](http://web.archive.org/web/20071011063257/http:/www.myfonts.com/fonts/agfa/neo-sans/)\n\npeace\n\n"
    },
    {
      "time": " 25.Mar.2006 11.40am",
      "content": "i know what it looks like, i’m just curious what the general opinion of it is.\n\n"
    },
    {
      "time": " 25.Mar.2006 11.47am",
      "content": "I don’t like Neo Sans: it’s no use for text, and hardly very inspiring for display. What about Seria Sans, perhaps the best sans yet made?\n\n"
    },
    {
      "time": " 25.Mar.2006 11.53am",
      "content": "i will check it out, thanks for the tip.\n\n"
    },
    {
      "time": " 27.Mar.2006 1.07pm",
      "content": "Cooper Black  \nComic Sans  \nPapyrus\n\n"
    },
    {
      "time": " 27.Mar.2006 1.08pm",
      "content": "oh, btw, Miss Tiffany, Linotype offers 30% for Students.\n\n"
    }
  ]
}
