{
  "id": "1878",
  "title": "Before 1950 elegant serif",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I have seen this font in a variety of books, the oldest one being printed in 1950.   \nIt is used frequently as display/titling, but sometime for main text.   \n   \nI havent't found a digital correspondent. The closest one is Erasmus RR.   \n   \nCan you help me ? ![](http://web.archive.org/web/20120107045338im_/http:/www.typophile.com/forums/messages/83/19513.jpg)\n\n",
  "author": "<a href=\"/web/20120107045338/http://typophile.com/user/2554\" title=\"View user profile.\">cromy</a>",
  "time": "<br>",
  "uid": "2554",
  "comments": [
    {
      "time": "",
      "content": "maybe a design by de Roos (right now - i don't have a book....) - typefaces with the same style (designed by him) - Erasmus, Hollandse Mediaeval, Meidoorn.   \n   \n   \n   \n   \nDavid Hamuel\n\n"
    },
    {
      "time": "",
      "content": "[Yves, i don't see \"I have not found...RR\" only the sample posted by Mircea. ???]\n\n"
    },
    {
      "time": "",
      "content": "Wow, David. I checked a book; it is Meidoorn by De Roos.\n\n"
    },
    {
      "time": "",
      "content": "I must disagree with William's post about this typeface being Meidoorn. This scan of the font from the Jaspert 'Encyclopaedia of Type Faces' shows some clear differences, especially in the R. This request was posted on the comp.fonts newsgroup a couple of days ago, and I replied with the suggestion of [Erasmus](http://web.archive.org/web/20120107045338/http:/www.philsfonts.com/detail.html?sku=RR00005001P2) and [Hollandse Medieval](http://web.archive.org/web/20120107045338/http:/www.fonts.com/findfonts/detail.asp?pid=203122), as similar typefaces that I knew were available in digital form. It seems clear that if that Mircea's sample is not by DeRoos, then it was inspired by his work. ![MeidoornSample](http://web.archive.org/web/20120107045338im_/http:/www.typophile.com/forums/messages/83/19610.gif)\n\n"
    },
    {
      "time": "",
      "content": "Mike, you're right, the R is different. My mistake. I was also looking at (another edition of) Jaspert, but not carefully enough.   \n   \nThe sample also does not exactly match either Erasmus or Hollandse Medieval in Jaspert. Perhaps if there is a book of De Roos' types the mystery could be solved.\n\n"
    },
    {
      "time": "",
      "content": "Thank you all for your suggestions.   \nUntil now, the closest one is Meidoorn, which I looked over on the net to find samples but no succes. Thankfully to Mike Yanega post, now I saw it.   \n   \nI also have some bold samples of the mistery font, which I will scan and post middle of next week.   \n   \nInfo about de Roos fonts can be found at [http://www.klingspor-museum.de/KlingsporKuenstler/Schriftdesigner/RoosDe/SdeRoos.pdf](http://web.archive.org/web/20120107045338/http:/www.klingspor-museum.de/KlingsporKuenstler/Schriftdesigner/RoosDe/SdeRoos.pdf).   \n   \nProceeding by elimination, there are not much fonts left to try... if it's a de Roos font.\n\n"
    },
    {
      "time": "",
      "content": "Here are more samples of this font:   \n   \n ![Bold](http://web.archive.org/web/20120107045338im_/http:/www.typophile.com/forums/messages/83/20000.jpg)   \n   \n ![Bold uppercase](http://web.archive.org/web/20120107045338im_/http:/www.typophile.com/forums/messages/83/20001.jpg)   \n   \n ![Bold uppercase](http://web.archive.org/web/20120107045338im_/http:/www.typophile.com/forums/messages/83/20002.jpg)   \n   \n ![Bold uppercase](http://web.archive.org/web/20120107045338im_/http:/www.typophile.com/forums/messages/83/20003.jpg)   \n   \n ![Regular](http://web.archive.org/web/20120107045338im_/http:/www.typophile.com/forums/messages/83/20004.jpg)   \n   \n ![Paragraph](http://web.archive.org/web/20120107045338im_/http:/www.typophile.com/forums/messages/83/20005.jpg)   \n   \n ![Italic](http://web.archive.org/web/20120107045338im_/http:/www.typophile.com/forums/messages/83/20006.jpg)   \n   \n ![Figures](http://web.archive.org/web/20120107045338im_/http:/www.typophile.com/forums/messages/83/20007.jpg)   \n   \nThe italic it not seems a \"true\" one, but the shape of lc L it is different, so it's not a mechanically slanted.   \n   \nSo, what is it ?\n\n"
    },
    {
      "time": "",
      "content": "Mircea,   \n   \nIs the language Romanian? You said the oldest sample you saw was from the 1950's. What was the most recent use of it you have seen?   \n   \nThe typeface (I wont say font, because to most of us that means a digital typeface) has some interesting features, and particularly the 'g' (which again looks a lot like Hollandse Medieval). Either you have two different fonts here, or the heavier weight uses a different 'g', and now with the lower case we can see that it uses a Venetian, or Old Style 'e' , and has an 'i' with an unusual dot. I notice some inconsistencies with your first sample and some of these new ones (look at the E), which makes me think we may have several fonts here. It's things like this that make me wish I had old catalogs from other European foundries, instead of mostly American, German and English typefaces. Yves, how's your print resources & references?\n\n"
    },
    {
      "time": "",
      "content": "It seems very much like a design from the early 1890s to early 1920s, before the geometrics and art deco got big. Kind of like something Herman Ihlenburg might have done.\n\n"
    },
    {
      "time": "",
      "content": "Yes, the language is Romanian.   \n   \nThe oldest book in which this typeface appears is from 1950, a math book from which I extracted the last three samples. From these you can see that the bold face is used together with the regular. The inconsistencies are important, but some features like the shape of the dot on i are also consistent. Considering that the bold is very heavy, almost black, and not all features can be keeped at this weight, it is possible to be in the same family with the regular.   \n   \nThe most recent book which uses this face is from 1991, but it is clear that is printed with the old technology.\n\n"
    },
    {
      "time": "",
      "content": "_\\> I havent't found a digital correspondent. The closest   \none is Erasmus RR._      \n   \nI doubt you'll find an exact digital match, Mircea.\n\n"
    },
    {
      "time": "",
      "content": "Typophile has been buggy since yesterday. ![:-(](http://web.archive.org/web/20120107045338im_/http:/www.typophile.com/forums/clipart/sad.gif)   \nFor example, in my browser Verdana is gone, and   \neverything is set in Arial now. Blech!\n\n"
    },
    {
      "time": "",
      "content": "And when you edit a post, there's a bizarre tag which   \ngets added:\n\n"
    },
    {
      "time": "",
      "content": "Hey, that lc 'g' might have been an inspiration for   \nMatthew Carter's [Alisal](http://web.archive.org/web/20120107045338/http:/www.myfonts.com/Search?searchtext=alisal).\n\n"
    },
    {
      "time": "",
      "content": "_\\> Yves, how's your print resources & references?_   \n   \nNot very impressive I'm afraid. There's a couple of ID'ers on this   \nboard with mind-boggling collections of old type compendiums,   \nbut I mostly rely on Rookledge's, recent catalogues of digital type   \nand online research.\n\n"
    },
    {
      "time": "",
      "content": "Hollandse Medieval is available as a single-font display from Monotype (Red Rooster's Erasmus is very similar), but for text, the closest to what you want is Dutch Medieval, a four-font text family from Canada Type Fonts available at MyFonts in OpenType (with oldstyle figures and keystroke-linked fonts) for a good price. A well-kept secret, ness pah?\n\n ![](http://web.archive.org/web/20120107045338im_/http:/typophile.com/files/DutchMedieval_4569.png)\n\n"
    },
    {
      "time": "",
      "content": "John, that's a good font to know about. Canada Type keeps adding nice revivals of old typefaces, and they've broadened the range of the family to be a more complete rendition of the original design, which also had italics and condensed weights.\n\nHowever, this is still not the same as the posted sample, remember, so this mystery has not been solved.\n\n- Mike Yanega\n\n"
    }
  ]
}
