{
  "id": "18796",
  "title": "Crit \"Weimar Plakat 1923 Pro\" my bauhaus inspired typeface",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Miss Tiffany's post on Constructivist type got me interested in looking at more constructivist faces.\n\n[http://typophile.com/node/18503](http://web.archive.org/web/20150123031602/http:/typophile.com/node/18503 \"http://typophile.com/node/18503\")\n\nI ended up buying several. I was looking for one that would match a JPEG of a poster I saw online at the Bauhaus Museum. I wanted to make a reproduction of the poster. Nothing worked out so I spent half a day making my own Bauhaus type which I call \"Weimar\" in honor of the poster. Today I added Latin 1 extension glyphs. I am attaching a PDF of the typeface sample which includes the little JPEG of the 1923 poster that got me started and the reproduction I ended up making (using my new font).\n\nI just added Greek and Cyrillic.\n\nChrisL\n\n ![](http://web.archive.org/web/20150123031602im_/http:/typophile.com/files/dezcom-Weimar.png)\n\n",
  "author": "dezcom",
  "time": "24 Mar 2006 — 9:52pm",
  "uid": "3135",
  "comments": [
    {
      "time": "24 Mar 2006 — 10:01pm",
      "content": "I am trying to attach my PDF but it won't take it for some reason. Hope some kind person can help? I have done this many times but this is the first failure. I keep getting the err message:  \n\"File copy failed: no directory configured, or it could not be accessed.\"\n\nChrisL\n\n"
    },
    {
      "time": "24 Mar 2006 — 10:12pm",
      "content": "\\> I keep getting the err message:\n\n[http://typophile.com/node/18745](http://web.archive.org/web/20150123031602/http:/typophile.com/node/18745 \"http://typophile.com/node/18745\")\n\n"
    },
    {
      "time": "24 Mar 2006 — 10:24pm",
      "content": "Thanks David! I see I am not alone. I put in a bug report as well.\n\nChrisL\n\n"
    },
    {
      "time": "25 Mar 2006 — 3:08am",
      "content": "hi chris,  \nnice work IMO. What caught my eye on first sight is that esp. the punctuation marks and currency symbols (esp. the top left part of the UKP symbol)don't feel exactly bauhaus to me, they seem more like they've come from a screen font, meaning to say that, at least for my taste, you took the constructivist approach a little too literal/too far here. Just a thought tho. And the fact that the caps have no round parts at all, again in my humble opinion, does not necessarily mean that there shouldn't be any round parts at all, for example the copyright symbol, @ etc. just feel too technical/somewhat computer-related to me when strictly based on square and 90 degree angles.  \nOn a different note: great to see you took the effort to design a german dbls, but that character/lyph does ONLY exist in lower case (although you can see it crammed within caps over here in germany every day, but that's WRONG!). German dbls is to be replaced by two capital S when you're setting/writing caps only, and that goes for small caps too, of course. But that inevitably leads to the question if you're planning to add lower case? I for one would love to see that, and it might be an interesting task to design lower case glyphs within such a formally restricted system...\n\nbest,  \nfranz\n\n"
    },
    {
      "time": "25 Mar 2006 — 3:31am",
      "content": "Ich stimme Franz zu.\n\nChris, I recently made a similar typeface, based on 1902 Offenbach geometric forms rather than the later strict constructivist stuff. In the art nouveau era, designers seemed to be less rigid, and were willing to break their own rules. I think that some of you non-alphabetic symbols would benefit from diagonals. Then they would feel old and German instead of new and internet-techy. If you keep the glyphs with the diagonals fat and zero-contrasty, I'm sure that they'll fit right in.\n\nI also heartily applaud Franz's German dbls comment make that two s's instead. If you really want a ß in your face, you'll have to design a complete, real lowercase to go along with it. Which would be super, really, although the triad combination of Uc, SC, and lc is somehow so NOT Bauhaus…\n\n"
    },
    {
      "time": "25 Mar 2006 — 4:35am",
      "content": "Oh, Chris, two more things!\n\n1. Change the name. Remember that old DTP rule, \"never use a typeface named after a city\"? I wouldn't want your design to fall victim to such retrograde silliness. Also, Weimar as a city (and even as a government) has such a varied, rich history. It simply cannot be distilled into a specific style. And Weimar was not fond of the Bauhaus when it was there. The Bauhäusler stomped over the city's rich art historical teaching tradition (said the bureaucrats at the time). After four years, the city council (or was it the state of Thuringia?) cut all their funding. That's why Gropius moved the school to Dessau, where he got a sweetheart deal with the city's Mayor. How about a name like \"Weimar School\" or \"Weimar Poster\"? That last one would be a double whammy with internet searches. And keyword the font with \"Bauhaus\"… then money will pour in.\n\n2. Put this font on MyFonts.com ASAP. You'll probably want to do some minor tweaks to its design, but really, this isn't such a time consuming face. But I bet you that it will sell on a platform like MyFonts, as long as you keyword it right and give it a nice font flag (something with that Bauhaus head…).\n\nOK, I really shouldn't be giving you this much free advice.\n\n"
    },
    {
      "time": "25 Mar 2006 — 7:15am",
      "content": "What, no osfs? Oh that's right, _bauhaus_.\n\nI agree with the other Dan - some of the nonalphabetics look too much like pixels and not enough like type furniture; you're almost there though.\n\nThe \"upside-down\" B is a great idea and you've done a great job of balancing it, but does anyone else think it looks a little dark?\n\nAll in all it's looking pretty sweet. When I try to draw letters like these, I always run into trouble with the D and O, V and U, R, and X. I like your solutions for all those letters; I'll have to crib them next time!\n\n"
    },
    {
      "time": "25 Mar 2006 — 7:34am",
      "content": "Franz,\n\nThanks for your helpful comments! I really fought with the 90 degree limitations I placed on myself. I was trying to be \"true\" to the genré. the % sign drives me crazy. I did worry that was too bitmap looking. I am glad to have your encoragement to allow limited use of diagonals and (dare I say it) curves :-)\n\nChrisL\n\n"
    },
    {
      "time": "25 Mar 2006 — 7:41am",
      "content": "Dan,  \nI really like free advice :-)\n\nI guess you are right about a lower case. I was worried it would be anti premise but those who want the purist angle can just not use them.\n\nI will have to think of a name. It has been so long since the old mac system fonts came out that I forgot about the old adage.\n\nChrisL\n\n"
    },
    {
      "time": "25 Mar 2006 — 7:55am",
      "content": "I guess it will be a while before they fix the file posting problem here on Typophile so I am linking my pdf file from elsewhere. Here is the link:\n\n[http://www.dezcom.com/weimar/Chris\\_Weimar.pdf](http://web.archive.org/web/20150123031602/http:/www.dezcom.com/weimar/Chris_Weimar.pdf \"http://www.dezcom.com/weimar/Chris\\_Weimar.pdf\")\n\nWhat surprised me is how well this geometrc reads at 9 and even 8 point. It makes no sense.\n\nChrisL\n\n"
    },
    {
      "time": "25 Mar 2006 — 7:57am",
      "content": "The last page of the pdf above has the orginal jpeg I used as a source (albeit small but that is all I had to work with) and the recreation of the poster using my font.\n\nChrisL\n\n"
    },
    {
      "time": "25 Mar 2006 — 8:11am",
      "content": "\"I always run into trouble with the D and O, V and U, R, and X\"\n\nPica,\n\nThe poster I modeled the font after gave me a good start. I also have several Bauhaus books which give examples. Most of my solutions were just following historic references. The \"X\" only works in context though.\n\nChrisL\n\n"
    },
    {
      "time": "25 Mar 2006 — 8:14am",
      "content": "\"Ich stimme Franz zu.\"\n\nOK Dan, what does it mean? I can't get hold of my daughter right now (poor thing is sleeping :-)\n\nChrisL\n\n"
    },
    {
      "time": "25 Mar 2006 — 8:18am",
      "content": "Chris, for answers to such questions, [Babelfish](http://web.archive.org/web/20150123031602/http:/babelfish.altavista.com/tr) is your friend. Babelfish says that it means \"I agree Franz.\" I would have translated it \"I agree with Franz,\" but the computer is close enough this time.\n\n"
    },
    {
      "time": "25 Mar 2006 — 8:28am",
      "content": "Thanks Dan--Babelfish it is then :-)\n\nChrisL\n\n"
    },
    {
      "time": "25 Mar 2006 — 8:30am",
      "content": "Dan,  \nOne burning question; Why the letter \"C\" in your avatar as opposed to any other letter (D for example)?\n\nChrisL\n\n"
    },
    {
      "time": "25 Mar 2006 — 8:56am",
      "content": "I was in London for a long weekend at the end of January. I found that C in an antique store on Portobello Road… for just 12 pounds! Naturally I bought it and [took some new pictures](http://web.archive.org/web/20150123031602/http:/flickr.com/photos/typeoff/sets/72057594090250263/). The C is in my avatar as opposed to any other letter (D for example) because I do not have any other big letters.\n\n"
    },
    {
      "time": "25 Mar 2006 — 9:15am",
      "content": "I see, the decision made itself for you :-)  \nI like the shiny brass look in your Flikr images too. It looks like a brass instrument--probably one based on the key of C. It Reminds me of the old J. C. Murphy sign on the store in my childhood neighborhood--big cast brass letters mounted on a red background.\n\nChrisL\n\n"
    },
    {
      "time": "25 Mar 2006 — 3:57pm",
      "content": "I am working on the lower case now. I hope to have something to post this evening.\n\nChrisL\n\n"
    },
    {
      "time": "25 Mar 2006 — 7:21pm",
      "content": "Here is a PDF with the lower case. I also made the changes you all suggested adding some diagonals to make it less bitmap like. The lower case always takes longer! Also I changed the name to \"Plakat\" to avoid the city name issue.\n\n[http://www.dezcom.com/weimar/plakat\\_3-25.pdf](http://web.archive.org/web/20150123031602/http:/www.dezcom.com/weimar/plakat_3-25.pdf \"http://www.dezcom.com/weimar/plakat\\_3-25.pdf\")\n\nChrisL\n\n"
    },
    {
      "time": "26 Mar 2006 — 12:58am",
      "content": "MyFonts already has one [Plakat](http://web.archive.org/web/20150123031602/http:/www.myfonts.com/fonts/scriptorium/plakat/), although the name doesn't seem to be trademarked. You don't like \"Weimar Plakat\"?\n\n"
    },
    {
      "time": "26 Mar 2006 — 5:29am",
      "content": "I like weimar Plakat! Is the name too long or would the \"Plakat\" part fall away in type menus?\n\nWhat do you think of the lower case? I know I need to kern the cap B with the lc glyphs.\n\nChrisL\n\n"
    },
    {
      "time": "26 Mar 2006 — 5:33am",
      "content": "Another thought \"Weimar 1923\"\n\nChrisL\n\n"
    },
    {
      "time": "26 Mar 2006 — 5:54am",
      "content": "I don't have enough practical experience to tell you what will happen with names in font menus. I see this face as a sort of supreme marketing venture… why not through even more words at its name… \"Weimar Plakat 1923\"? When you expand it to a wicked cool OpenType version, it will naturally have to be called \"Weimar Plakat 1923 Pro\", at the _very_ least.\n\nThe lowercase is ok, but it is not as \"wow!\" as the UC and SC. The UC/SC forms have something \"new\" to them, even though they aren't really new, per se. They feel powerful somehow. The lc is like dozens of lc's out there in digital font land. There may be little to do about that, though. The Roman alphabet's lc forms are more complicated than its uppercase, and the strokes have to fit into a smaller space. Therefore, its no surprise that lots of people come to similar conclusions when faced with a brief as tight as the one you've set for yourself.\n\n"
    },
    {
      "time": "26 Mar 2006 — 7:47am",
      "content": "Dan,  \nI think you are right about the lower case. There are few options available.\n\nActually, it is already an Opentype face. The only characters remaining to be done is the CE. I would like to do a Cyrillic given the obvious Russian Constructivist connection. Greek would make no sense to me though. So maybe I would call it \"Weimar Plakat 1923 Semi-Pro\" :-)\n\nChrisL\n\n"
    },
    {
      "time": "26 Mar 2006 — 7:55am",
      "content": "Cyrillic and Greek are not necessary elements of a Pro character set. Doesn't \"Pro\" just require /ensure support for a minimum number of Latin-based languages (30?)?\n\nSC/OsF/ligautures/Cyrillic/Greek/etc. can be added into the Pro character set, but they aren't necessary elements of it, AFAIK. You can not tell if a font is tricked out with typographic OT features by its name alone.\n\nI agree here that Greek would be sort of silly. But maybe that could be your \"in\" to the typeface. The Greek would need more of those diagonal elements you've brought in.\n\n"
    },
    {
      "time": "26 Mar 2006 — 7:58am",
      "content": "If you call this \"Weimar Plakat 1923,\" it could be the first in a series of Bauhaus revivals. You could also do a \"Weimar Plakat 1919\" or a \"Weimar Broschüre 1919\" and then a \"Dessau Plakat 1925\" or \"Dessau Umschlag 1925\" or who-knows-what.\n\n"
    },
    {
      "time": "26 Mar 2006 — 8:07am",
      "content": "i think \"Pro\" means whatever you want it to mean. Next month's IHOF releases will include 2 \"Pro\" fonts. One is just a regular and alternate font combined, no additional language support. Another has swashes, ligatures, alternates, CE & Cyrillic support, &c. and uses the same designation. I think that with the term \"Pro\" all you can assume is that there are \"extra\" features, which the potential licencee must check from font to font.\n\n"
    },
    {
      "time": "26 Mar 2006 — 8:09am",
      "content": "I think that Adobe has a minimum character set designated for Pro fonts. Didn't they invent the term? One can of course build fonts however one wishes, but it must cause some confusion for users. It causes confusion for me! :-(\n\n"
    },
    {
      "time": "26 Mar 2006 — 9:35am",
      "content": "_Didn’t they invent the term?_\n\nprobably. but they also invented the term \"Premiere Pro\" too. \\>^P\n\n"
    },
    {
      "time": "26 Mar 2006 — 9:42am",
      "content": "But in \"Garamond Premiere Pro\" \"Premier\" refers to the word \"Garamond\", not to \"Pro\", right?\n\n**Garamond Premiere** Pro\n\nto differentiate it from Adobe's earlier other **Adobe Garamond** , which is also available with a Pro OT character set as \" **Adobe Garamond** Pro\"…\n\n"
    },
    {
      "time": "26 Mar 2006 — 3:18pm",
      "content": "I almost have the complete \"Pro\" set done now. I wish that FL5 had a better way to generate the CE small caps. It does it with lower case (dumping the components together) but with small caps you have to add all the components yourself. Seems like they could use most of the same code just look for \"small\" or \".smcp\" instead of the lower case.\n\nChrisL\n\n"
    },
    {
      "time": "26 Mar 2006 — 3:20pm",
      "content": "Dan,\n\nRegarding Greek--since most of this face was done on March 25th (Greek Independence Day) I should do a Greek set just to be patriotic :-)\n\nChrisL\n\n"
    },
    {
      "time": "26 Mar 2006 — 3:51pm",
      "content": "_I wish that FL5 had a better way to generate the CE small caps._\n\nall you have to do to fix this is to find the alias.dat file and edit it to contain your smallcap combinations.\n\n"
    },
    {
      "time": "26 Mar 2006 — 4:15pm",
      "content": "Paul,  \nHow do I do that?\n\nChrisL\n\n"
    },
    {
      "time": "26 Mar 2006 — 4:21pm",
      "content": "I mean I found the file butam not sure how to make the corect changes.\n\nHere is a sample line:\n\nAgrave.smcp A.smcp+~grave.smcp\n\nIf my small caps are named Asmall and Agravesmall, what would I append?\n\nChrisL\n\n"
    },
    {
      "time": "26 Mar 2006 — 5:28pm",
      "content": "well in your situation, i might just suggest renaming your glyphs since it appears the \"glyphname.feature\" format of glyphname is supported by the alias.dat file. but if you prefer your naming scheme, you can write `Agravesmall Asmall+~grave`.  \nfor a small key, hit Control(Command)+G and then when the dialog box pops up, hit the question mark button and read the following small list of guidelines.\n\n"
    },
    {
      "time": "26 Mar 2006 — 6:59pm",
      "content": "Now I have bigger troubles. I completed the whole 440 glyphs and all is well when I generate the font. As soon as I apply the font to existing text in InD-CS, it bombs repeatedly. I am too tired to dig into it now. It has been a 300 glyph day and I am too tired to think straight.\n\nChrisL\n\n"
    },
    {
      "time": "26 Mar 2006 — 10:57pm",
      "content": "Is this font close to what you are trying to develop?\n\n[http://www.myfonts.com/fonts/p22/destijl/](http://web.archive.org/web/20150123031602/http:/www.myfonts.com/fonts/p22/destijl/ \"http://www.myfonts.com/fonts/p22/destijl/\")\n\n"
    },
    {
      "time": "27 Mar 2006 — 5:04am",
      "content": "The P22 De Stijl font is an excellent one and I highly recommend it. I Purchased it among several others when I first started trying to reproduce the poster. It didn't match well enough so I started my own. De Stijl is similar (but caps only) and it also is another constructivist face which harkens to that era. It doesn't do what I wanted exactly so I am doing my own OTF face including lower case, small caps, and a full set of diacritics with CE (adding Cyrillic later). Most people probably would not find the same need for a difference admittedly. The Bauhaus school in Germany and the De Stijl movement in Holland had many parallels as well as the Russian Constructivists. The very limited palette of tools in the rectilinear only character system used by all of them makes for much overlap. Differences come in ratios m ore than style. I found the ratios in the original 1923 poster that I used as a model to be particularly appealing.\n\nChrisL\n\n"
    },
    {
      "time": "27 Mar 2006 — 8:13pm",
      "content": "Nice work, Chris! Cheers!\n\nI'm glad Jason brought up the De Stijl reference -- Theo van Doesburg would surely be looking on in approval at your work, if he could!\n\n"
    },
    {
      "time": "27 Mar 2006 — 8:23pm",
      "content": "Thanks Ricardo :-)\n\nChrisL\n\n"
    },
    {
      "time": "27 Mar 2006 — 8:30pm",
      "content": "I fixed my problem and am now posting another PDF with the larger character set. The text is in several European languages: French, German, Italian, Czech, Polish, and Slovak in both lowercase and small caps. Thanks to Franz for his correction, I made an \"SS\" glyph to map to small caps when the Germandblss (dbls) is used.\n\nHere is the link:\n\n[http://www.dezcom.com/weimar/WeimerPlakat\\_CE.pdf](http://web.archive.org/web/20150123031602/http:/www.dezcom.com/weimar/WeimerPlakat_CE.pdf \"http://www.dezcom.com/weimar/WeimerPlakat\\_CE.pdf\")\n\nChrisL\n\n"
    },
    {
      "time": "27 Mar 2006 — 9:09pm",
      "content": "Chris, this is really nice! :^)\n\nDoes the 0 look a little misplaced to you with its \"curvilinear\" form? I guess you're trying to differetiate 0 from O without slapping on a diagional slash. I'm just not sure if your solution works well enough.\n\n"
    },
    {
      "time": "28 Mar 2006 — 3:32am",
      "content": "yes, great piece of work chris. when do you eat and sleep by the way? :-)  \nfor the Zero/O-Difference, yes, the diagonals do look a bit odd, possibly it's enough to just have the O wider than the zero, and if there's a danger of confusion, context should make things clear. I think it's very unlikely a face like this to be used for complex information design application with complex tables and the like, where danger of confusion is certainly higher. Even more so, in applications like posters and the like, even identical zero and O forms might work. To cut it short, i'd drop the diagonals on your zero.  \nRe the german dbls becoming double-S when setting (small) caps, most professional applications like quark, indesign, illustrator, which allow you to convert text from upper to lowercase and vice versa, do this automatically, so i can't say for sure if a dedicated double-S glyph is actually necessary? don't know what happens if the converting of cases is done via opentype featuritis, so you might be right there to do one, i am sure somebody else has it down precisely...  \nmeant to give you another \"go for it\"-like remark, but things don't look as if you'd really need one – well done!\n\np.s. isn't it amazing how relatively well legible such typefaces, which, compared to 'proper' ones, are pretty \"crude\" formally, can be at smaller sizes? strikes me every time i see something like this...and the overall strong graphic appearance of a column of smaller text – great as well.\n\n"
    },
    {
      "time": "28 Mar 2006 — 5:25am",
      "content": "Hi Chris\n\nReally nice work. Have you thought about giving your I some serifs like you used in the V. Then the I would differ from the l.\n\n ![](http://web.archive.org/web/20150123031602im_/http:/typophile.com/files/Il-serif.png)\n\nSteven\n\n"
    },
    {
      "time": "1 Apr 2006 — 9:05pm",
      "content": "Here is the final character set. I have bumped it up to include the entire Latin Supplement A group. Dare I call it \"Weimar Plakat 1923 Pro\" now? :-)\n\n[http://www.dezcom.com/weimar/WeimerPlakat4-1-06.pdf](http://web.archive.org/web/20150123031602/http:/www.dezcom.com/weimar/WeimerPlakat4-1-06.pdf \"http://www.dezcom.com/weimar/WeimerPlakat4-1-06.pdf\")\n\nI also made most of the changes you all mentioned here or offline. I squared the zero  \nback the original way as Geoff and Franz suggested. It is an \"opentype thing with the dbls small cap so I left it in. BTW Franz, I agree with your notice of this kind of face being more legible than one would expect. It is almost baffling how it works.\n\nThank you all and with extra special thanks to Dan and Paul for their offline help!\n\nMy next step is to try to publish this puppy.\n\nChrisL\n\n"
    },
    {
      "time": "2 Apr 2006 — 8:46am",
      "content": "I had a quick look at the pdf, it's great stuff. I can't really see anything to crit except maybe \"Pro\" is a little too \"Adobe\". ;^)\n\nI especially like that amperstand.\n\nBest of luck publishing this.\n\n"
    },
    {
      "time": "2 Apr 2006 — 8:59am",
      "content": "Geoff, I think that he should keep the Pro. As I mentioned above, \"Pro\" refers to the font's character set coverage, and not its producer. Lots of foundries big and small use the \"Pro\" appendage on appropriate OpenType font names.\n\nBesides, on a platform like MyFonts.com, \"Pro\" can't hurt, can it?\n\n"
    },
    {
      "time": "2 Apr 2006 — 9:12am",
      "content": "Dan, on second thoughts you're probably right about that. Perhaps \"Weimer 1923 Pro\" could work better? I think it's a bit long at it is currently.\n\n"
    }
  ]
}
