{
  "id": "18795",
  "title": "Optical kerning and Letterspacing capitals",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi all,\n\nI have two questions that I could sure use help with:\n\nI use InDesign and was wondering whether I ought to set the kerning to optical or metric? What is optical? That is, if I have a high quality font with a painsakingly created kerning table, will there be further improvement ot the kerning if I highlight a body of text and choose optical?  \n Also,`In Robert Bringhurst's 'Elements of Typographic Style' he speaks of letterspacing capitals at, say 10%, how much is that in the InDesign scale of 10 point increments? Or if that is too opaque a way of asking the question, what letterspacing do those who use InDesign tend to use for successive capitals and small capitals. I anticipate that the answer is something like, \"whatever is most aesthetically pleasing' or something, but I'd also appreciate some general suggestions.\n\nThanks alot.\n\n",
  "author": "<a href=\"/web/20101103225958/http://typophile.com/user/11840\" title=\"View user profile.\">C Swann</a>",
  "time": "<br>",
  "uid": "11840",
  "comments": [
    {
      "time": "",
      "content": "<cite>I anticipate that the answer is something like, “whatever is most aesthetically pleasing’ or something, but I’d also appreciate some general suggestions.</cite>\n\nYes.\n\nAs to optical spacing, normally you should prefer the spacing and kerning of the font. Optical spacing can improve a bit for uppercase setting, say, if a font's capitals are spaced to work with lowercase but look too narrow and uneven in uppercase setting. But this really depends on the typefaces you use, some are very well spaced and kerned even for uppercase setting. There was an entire thread with samples about InDesign's optical spacing on Typophile, but I cannot find it.  \n10% of what? :) A suggestion by Jan Tschichold was, space the uppercase as much as is needed to make sure that the \"O\" doesn't create a hole in the text image. This is also implicit in the initial steps of David Kindersley's uppercase spacing method (though I was told that he cared for evenness of spacing rather than the amount of spacing). But I consider it anything but helpful to suggest % or InDesign units as these would vary from typeface to typeface.\n\nKarsten\n\n"
    }
  ]
}
