{
  "id": "188",
  "title": "Book about magazine design",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I\n\n",
  "author": "neuelex",
  "time": "20 May 2003 — 8:21am",
  "uid": "1852",
  "comments": [
    {
      "time": "20 May 2003 — 2:46pm",
      "content": "Great Question Neuelex. I've just added two more books to the library ( [http://typophile.com/books](http://web.archive.org/web/20131018031604/http:/typophile.com/books)) that might just help you out. Stay Tuned, I've plenty more.\n\n"
    },
    {
      "time": "20 May 2003 — 2:56pm",
      "content": "[Here's the book](http://web.archive.org/web/20131018031604/http:/www.amazon.com/exec/obidos/tg/detail/-/0658002295/qid=1053467724/sr=1-1/ref=sr_1_1/104-7768157-8262362?v=glance&s=books) we use at my school. I don't teach the magazine courses, but the guy who does seems to think that it's a great book. Maybe it's worth a shot...\n\n"
    },
    {
      "time": "25 May 2003 — 12:34pm",
      "content": "there is magazine about magazines called Masthead. [www.mastheadonline.com](http://web.archive.org/web/20131018031604/http:/www.mastheadonline.com/) There was also a publication that came outa few months ago about the best 25 in 25 years? something like that - has an orange and red cover with a big 25 on it - you could probably get it at any magazine store.\n\n"
    },
    {
      "time": "10 Jun 2003 — 6:26am",
      "content": "Thanks a lot   \n   \nMaybe i need to explain a bit more now, i'm not really interested in books like 'the more fun magazines in the world' or things like that. I mean i'm not searching infos about magazines that don't look like magazines. I need infos on how to organise and design a serious magazine, and about the grids used. As as i said many of the books are only about book design, and its pretty different. There are some materials on how to make a newspaper, its bit more close i think, but not enough. But maybe there is a real lack in this area.   \n   \nAnyway thanks for the all the info provided, i didn't bought any books for now on the subject because i was not really impressed of what i seen online, but maybe i'm gonna try it now and spend some books (\n\n"
    },
    {
      "time": "10 Jun 2003 — 10:48am",
      "content": "neuelex,   \n   \nAs a former art director of magazines I feel your pain. I have yet to find a good book on\n\n"
    },
    {
      "time": "10 Jun 2003 — 10:54am",
      "content": "Surprise Me and Praxishandbuch Gestaltungsraster, both from Hermann Schmidt Verlag, are pretty good. Alas, they're of course written in German.   \n   \nBrodovitch was a master -- and the Fleckhaus book is marvelous, I agree... Gotta check out that Lois book. It's a shame that there is nothing about the work of Khan, which precludes Brodovitch.\n\n"
    },
    {
      "time": "12 Jun 2003 — 7:12am",
      "content": "Masthead (the mag about mags) isin't about what mags are hot...(well there is a back section about the upcomings) But really its an excellent resource for following and understanding trends, content, organization - lots of crits. For instance there was a big uproar in the magazine world about a certain issue of Flare that had a pinch of product placement on the cover (a big no no!) and that was discussed at lenght in Masthead. the 25/25 isin't the 25 prettiest either, its about what was truely innovative abotu certain spreads, articles, illios, editting stuff like that.   \n   \nanywho - maybe its not as technical as you would like, but I don't think anyone should design by a how-to-book in any case.\n\n"
    },
    {
      "time": "12 Jun 2003 — 7:22am",
      "content": "Masthead (the mag about mags) isin't about what mags are hot...(well there is a back section about the upcomings) But really its an excellent resource for following and understanding trends, content, organization - lots of crits. For instance there was a big uproar in the magazine world about a certain issue of Flare that had a pinch of product placement on the cover (a big no no!) and that was discussed at lenght in Masthead. the 25/25 isin't the 25 prettiest either, its about what was truely innovative abotu certain spreads, articles, illios, editting stuff like that.   \n   \nanywho - maybe its not as technical as you would like, but I don't think anyone should design by a how-to-book in any case.\n\n"
    },
    {
      "time": "13 Jun 2003 — 1:01pm",
      "content": "Grid Systems in Graphic Design   \n   \n [http://www.amazon.com/exec/obidos/tg/detail/-/3721201450/ref=pd\\_sim\\_books\\_1/103-2492156-4183804?v=glance&s=books](http://web.archive.org/web/20131018031604/http:/www.amazon.com/exec/obidos/tg/detail/-/3721201450/ref=pd_sim_books_1/103-2492156-4183804?v=glance&s=books)   \n   \nthis book may be a resource... not specific to magazines, but still a resource\n\n"
    }
  ]
}
