{
  "id": "18804",
  "title": "(x) Cossé' Design logo - Monotype Corsiva {Paul}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Please be gentle with me as this is my first time posting. I am trying to identify the font of my logo Cossé Designs and thought it was Caligula but its not—but close. I can’t upload an image because my logo image is to complex and large. I have had this logo for quite some time and am unable to figure out how strip out the background to just leave the font. If someone would kindly go to my website [http://www.CosseDesigns.com](http://web.archive.org/web/20080829143926/http:/www.cossedesigns.com/ \"http://www.CosseDesigns.com\") and look at my Logo and identify the font I will be so ever grateful. I’ve spent hours looking through internet sites trying to identify but no luck. Thank you one and all at Typophile for your help.\n\nMona\n\n [‹ (x) Greig and Murphy logo script - Corinthia {Prakash}](http://web.archive.org/web/20080829143926/http:/typophile.com/node/18698 \"Go to previous forum topic\") [(x) Die Neue Typographie - Aurora Grotesk (Akzidenz-Grotesk) {Kris (self), Craig} ›](http://web.archive.org/web/20080829143926/http:/typophile.com/node/18748 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080829143926/http://typophile.com/user/12193\" title=\"View user profile.\">mcosse</a>",
  "time": "<br>",
  "uid": "12193",
  "comments": [
    {
      "time": " 25.Mar.2006 11.29am",
      "content": "Closest I can see is Zapf Chancery but the terminals are wrong and some of the characters don’t match.\n\n"
    },
    {
      "time": " 25.Mar.2006 11.56am",
      "content": "looks like [Monotype Corsiva](http://web.archive.org/web/20080829143926/http:/www.myfonts.com/fonts/agfa/monotype-corsiva/) to me, stretched a bit.\n\nPatty, how’d that happen? I thought you knew every font on the face of the planet! \\>^P\n\n"
    },
    {
      "time": " 25.Mar.2006 12.27pm",
      "content": "Thank you Patty and Paul for responding. But, Paul wins the prize—it is definitely Monotype Corsiva—and yes it is stretched. I forgot I had stretched it when I originally made the logo quite some time ago. I’m sure it threw a “wrench” in the works in trying to identify the font. The service that is provided at Typophile is top notch. Thanks again.\n\n"
    }
  ]
}
