{
  "id": "18808",
  "title": "Desktop Printer Advice",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m looking to buy a 1200dpi laser printer to use primarily for developing type designs. I’ve been searching around for the cheapest printer available which has true Adobe® PostScript® 3™, as opposed to an emulated version of Postscript 3. I’m just looking for some general advice from any of you out there who may have gone through a similar quest. Any reviews and/or recommendations would be greatly appreciated.\n\nFurthermore, opinions on the relative qualities of true postcript machines vs. emulated versions would be also useful. Is there any difference, and if so, how great/marginal is the difference?\n\nThanks in advance for your contribtuions.\n\nMike Ives\n\n [‹ linotype fontExplorer x](http://web.archive.org/web/20080519014624/http:/typophile.com/node/18819 \"Go to previous forum topic\") [SC vs. faux SC and Post-Script vs. TrueType ›](http://web.archive.org/web/20080519014624/http:/typophile.com/node/18807 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080519014624/http://typophile.com/user/5489\" title=\"View user profile.\">micthemod</a>",
  "time": "<br>",
  "uid": "5489",
  "comments": [
    {
      "time": " 25.Mar.2006 4.47pm",
      "content": "i just bought an HP laserjet 1320 and i think it’s working out OK. granted, i’m just getting started myself, but it seems like the 1320 is a good deal in the less than $500 category, when i was looking, it seemed like the only true Postscript printers run at least $1000 and well over, which was out of my price range.\n\ni guess there are some even cheaper HP laserjets, but i was told that the 1320 is the best for the price you pay…\n\n"
    },
    {
      "time": " 25.Mar.2006 5.42pm",
      "content": "you might try picking something up second-hand. laser printers are pretty reliable, much better than ink-jets, and by going the use route, you might find a better model at a cheaper price then with a new one.\n\n"
    },
    {
      "time": " 25.Mar.2006 7.48pm",
      "content": "here’s the thread i posted when i was looking for a printer. i think there’s a link to another good thread somwhere in there too.\n\n[http://typophile.com/node/17726](http://web.archive.org/web/20080519014624/http:/typophile.com/node/17726 \"http://typophile.com/node/17726\")\n\n"
    },
    {
      "time": " 26.Mar.2006 4.15pm",
      "content": "OK, I had a browse around ebay for second hand printers. Some of the prices were good. Eventually I found a huge discount on a Samsung ML-2550 - which is 1200dpi x1200dpi, and packs an emulated version of Postcript 3. This was probably the best I could find (after a days extensive research) in my price range £150/$220. I’ll let you know how it goes!\n\n"
    }
  ]
}
