{
  "id": "18807",
  "title": "SC vs. faux SC and Post-Script vs. TrueType",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have two fairly general questions, and feel kind of newbish for not understanding these in my third year of school but here goes anyways.\n\nI’m frequently using the lab workstations which are already preloaded with a set of ’Studio Fonts.’ There are times where I want to use Small Caps but I have no idea if the families they’ve bought include the SC style or not. I could obviously hit the SC buttons in Quark or InDesign but that doesn’t solve my problem. I want to know how to determine if they’re faux or real. Hopefully there’s an easy way.\n\nAnother question I have, which I didn’t think deserved another thread was I just bought the Indie Fonts Vol 1 and 2 and love them! I loaded up the CDs and made new sets in FontExplorer and imported all the gratis fonts provided, noticing that there are duplicates of some fonts and not of others. I’ve got a vague idea of why there are Post-Script and TrueType included but I want to know for sure. I’m pretty sure Post-Script are ’printer’ fonts and TrueType are the ’screen’ fonts. Is this correct? Which one do I enable when I want to use the font? or do I enable both?\n\nMaybe this is better directed towards Paul or someone at P22 but the ’Screwtop’ family I imported is empty. Info on the Family in FontExplorer says it contains 0 characters. :-(\n\n [‹ Desktop Printer Advice](http://web.archive.org/web/20080628180851/http:/typophile.com/node/18808 \"Go to previous forum topic\") [Wants to report pirating of Adobe Fonts ›](http://web.archive.org/web/20080628180851/http:/typophile.com/node/18112 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080628180851/http://typophile.com/user/8451\" title=\"View user profile.\">dave bailey</a>",
  "time": "<br>",
  "uid": "8451",
  "comments": [
    {
      "time": " 25.Mar.2006 2.58pm",
      "content": "_I want to know how to determine if they’re faux or real._\n\nIn general, this is pretty easy to spot. Given that they were well designed, true SC are better proportioned and have the same weight (e.g. aproximately the same stem width) as lowercase characters. If you’re not sure, print out a passage of text with some embedded words typeset in SC and you’ll see the difference. If you don’t want to print and are using InDesign, just open the Glyph Palette and visually check for the presence of SC.\n\n_I’m pretty sure Post-Script are ‘printer’ fonts and TrueType are the ‘screen’ fonts. Is this correct?_\n\nNo. (Not this theme again. When will this and other related myths be wiped from the planet? :^/ :^) Please read: [TrueType versus PostScript](http://web.archive.org/web/20080628180851/http:/www.typophile.com/node/16695)\n\n"
    },
    {
      "time": " 25.Mar.2006 3.27pm",
      "content": "\\> Maybe this is better directed towards Paul or someone at P22 but the ‘Screwtop’ family I imported is empty. Info on the Family in FontExplorer says it contains 0 characters. :-(\n\nYes, better to contact P22. No need to post that, IMO. Just my $0.04\n\n"
    },
    {
      "time": " 25.Mar.2006 3.52pm",
      "content": "In most fonts real small cap letters are narrower than uppercase letters and not so spacious to fill the gap between the letters.\n\n ![](http://web.archive.org/web/20080628180851im_/http:/typophile.com/files/SC-R-Bembo-real.png)\n  \nreal\n\n ![](http://web.archive.org/web/20080628180851im_/http:/typophile.com/files/SC-R-Bembo-fake.png)\n  \nnormal uppercase\n\nGreetings: Steven\n\n"
    },
    {
      "time": " 25.Mar.2006 3.52pm",
      "content": "Miguel: Thanks for that article and the SC advice. It seems like .TTF files are the way to go.\n\nDavid: Agreed...I just figured I would throw it out there while I was thinking out loud.\n\n"
    },
    {
      "time": " 25.Mar.2006 4.52pm",
      "content": "\\>In most fonts real small cap letters are narrower than uppercase letters\n\nI believe it is generally the other way around: making the stems bolder and trying to keep the counters similar makes the small caps wider. Eg. I just checked Adobe Garamond, which has it this way—wider not narrower.\n\n"
    },
    {
      "time": " 25.Mar.2006 5.16pm",
      "content": "Regarding InDesign...if they’re OpenType do the brackets around the styles mean they’re not included? I just checked Adobe Jenson Pro and it had brackets around Swashes and Contextual Alternates. When you are talking wider/narrower, are you talking about a cap and SC set in the same point size? I just checked SC in Adobe Jenson Pro and I’m pretty sure they were narrower.\n\n"
    },
    {
      "time": " 25.Mar.2006 5.32pm",
      "content": "AFAIK, brackets around an entry on InDesign’s OpenType subpanel means “OT feature not present in font”.\n\nWarnock Pro Regular\n\n ![](http://web.archive.org/web/20080628180851im_/http:/typophile.com/files/ms_warnock.png)\n  \nEnough to make a conclusion?  \nI would easily say that the area SC glyphs occupy is generally more “squarish”. (I guess I’m agreeing with them being wider tho)\n"
    },
    {
      "time": " 25.Mar.2006 5.36pm",
      "content": "Oh, right...when you scale the SC up to the same cap height as the reg cap letters it definitely is wider. I just wish they would get rid of faux buttons and disable/bracket options if it’s not available in the font in the regular styles menu, not just for OT examples.\n\n"
    },
    {
      "time": " 25.Mar.2006 5.43pm",
      "content": "\\> I’m pretty sure they were narrower.\n\nBlow up the small cap H in Adobe Jenson to the same height as the cap H and it is 5% wider than the cap H.\n\n"
    },
    {
      "time": " 25.Mar.2006 5.51pm",
      "content": "On the Glyph Palette, if you can see a little arrow/triangle on the bottom-right corner of a glyph, there’s a good chance of it having a SC variant.\n\n ![](http://web.archive.org/web/20080628180851im_/http:/typophile.com/files/ms_sc.png)\n\n"
    },
    {
      "time": " 25.Mar.2006 5.51pm",
      "content": "\\> Blow up the small cap H in Adobe Jenson to the same height as the cap H and it is 5% wider than the cap H.\n\nYeah, I was zoned out and didn’t figure they were were blowing them up to same cap height...see my post above yours. :-D\n\n\\> screwtop?\n\n ![](http://web.archive.org/web/20080628180851im_/http:/typophile.com/files/screwtop.png)\n\nIt’s from Indie Fonts Vol. 1: Copyright 1998 Test Pilot Collective. Designed by Joe Kral. All Rights Reserved. [http://www.testpilotcollective.com](http://web.archive.org/web/20080628180851/http:/www.testpilotcollective.com/ \"http://www.testpilotcollective.com\")\n\nEDIT: I also just looked closer in FontExplorer and if you doubleclick a font and go to Characters it lists all characters....that’s probably the easiest way to see if it has SC before loading it up. This is why I piled 3 questions into one because I knew it would be more obvious than it seems. Now I need to get them to use FontExplorer instead of FontBook on the workstations.\n\n"
    }
  ]
}
