{
  "id": "18827",
  "title": "Aroma Therapy Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is a concept for an Aroma Therapy company named Little Bird Therapies.  \nLittle Bird Therapies is a very small business providing homemade therapies.  \nI am open to critiques, especially on the type treatment which doesn't look finished to me.\n\nThe parchment is not a part of the logo at all, it is just a background that I was thinking about putting it on.\n\nI am a huge fan of this site and this is my first post, so please be kind.\n\n ![](http://web.archive.org/web/20131021030613im_/http:/typophile.com/files/LB.jpg)\n\n",
  "author": "agency1",
  "time": "27 Mar 2006 — 6:56am",
  "uid": "7048",
  "comments": [
    {
      "time": "27 Mar 2006 — 9:07am",
      "content": "please ignore this..\n\n"
    },
    {
      "time": "27 Mar 2006 — 9:07am",
      "content": "I really like the bird, although it has a kinda 'snooty' look about it's face. I think it's the way it's staring into the distance with it's nose turned up.\n\nThe type might look a lot better if it was actually printed on the parchment, and perhaps the bird as well? I think 'THERAPIES' doesn't look very therapeutic - are they u/c or small caps? i can't tell - but either way i think l/c could look better.\n\nGraham\n\n"
    },
    {
      "time": "27 Mar 2006 — 10:11am",
      "content": "The bird is really nice and well done.  \nBut I think you have done too much strokes at its tail. Its not balanced. The bird looks left weighted.  \nAlso it doesnt look like a little bird. I would shorten the body and tail a bit and make the stomach wider. Now it looks like a pigeon not like a sweet little tomtit.\n\nLook at these tiny sweet birds to check your proportions:  \n [http://www.naturfotografie-digital.de/GR10/GRBM130105-2024.jpg](http://web.archive.org/web/20131021030613/http:/www.naturfotografie-digital.de/GR10/GRBM130105-2024.jpg \"http://www.naturfotografie-digital.de/GR10/GRBM130105-2024.jpg\")\n\n[http://www.naturfotografie-digital.de/GR10/GRSM130105-1966.jpg](http://web.archive.org/web/20131021030613/http:/www.naturfotografie-digital.de/GR10/GRSM130105-1966.jpg \"http://www.naturfotografie-digital.de/GR10/GRSM130105-1966.jpg\")\n\nGreetings: Steven\n\n"
    },
    {
      "time": "27 Mar 2006 — 10:38am",
      "content": "Hi, I like the bird too, and I also agree with Steven that it looks little off balance and \"pigeony.\" The curves are so intricate that I was looking for a hidden scripty \"L\" and \"B\" which might look interesting (I'd try it, if it doesn't work, you can always go back). I'd suggest trying to simplify the type. Bold and different color is not necessary. You have three words and each has a different treatment which I think is too much. I like the green/brown combination, but I'd explore one color versions. The parchment compliments the colors very well, but it will be probably used on many different backgrounds so I wouldn't think of it as a part of a logo and worked with white background (at least for now). Nice start.\n\n"
    },
    {
      "time": "27 Mar 2006 — 1:39pm",
      "content": "And maybe the bird should look straight to the right, not upwards. I dont know why but it reminds me a bit of a thinking pose\n\n"
    },
    {
      "time": "27 Mar 2006 — 1:52pm",
      "content": "Shouldn't a little bird be little and maybe sit on the title. I'm not in love with the type, why make bird more important than little, I see no reason. It souldn't read little. Bird. It needs to read as little bird. The letter spacing needs work and you have to justify why little is with a lowercase l like the b in bird. Therapies is just to strong for this treatment and it too has letter spacing problems. Its a nice start but its a start, keep going\n\n"
    },
    {
      "time": "27 Mar 2006 — 8:51pm",
      "content": "Thank you for all of your comments.  \nYou have been very helpful and I hope to put your advise to use and post a new round of revisions soon.\n\n"
    },
    {
      "time": "30 Mar 2006 — 7:17pm",
      "content": "The bird is wonderful, but the break in the chest bothers me, and I also looked to see if there was hidden lettering in the illustration as well; which in my mind would be easy to incorporate but might be a bit too much. I feel as though the type needs to be a bit more inviting, ditch the all caps and try to find a way to avoid the use of extra weights and faces.\n\n"
    }
  ]
}
