{
  "id": "18829",
  "title": "good vs. evil",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "which one do you see first…?\n\n ![](http://web.archive.org/system/files?file=goodevil.gif)\n\n",
  "author": "lil dingbat",
  "time": "27 March, 2006 - 8:37am",
  "uid": "11653",
  "comments": [
    {
      "time": " 27 March, 2006 - 8:49am",
      "content": "good,\n\nnice optic-play\n\n"
    },
    {
      "time": " 27 March, 2006 - 8:50am",
      "content": "I saw good first but now that I see evil, I can’t escape it. The lettering style has more of an evil look as well.\n\nGood one though!\n\nChrisL\n\n"
    },
    {
      "time": " 27 March, 2006 - 9:06am",
      "content": "I see “good” first. Nicely done.\n\n"
    },
    {
      "time": " 27 March, 2006 - 9:10am",
      "content": "If the subject line had been ‘evil vs good’ I’m sure people would have seen evil first.\n\n"
    },
    {
      "time": " 27 March, 2006 - 9:26am",
      "content": "Saw good first but like dezcom I can’t escape the evil.\n\nI think good pops first because we’re used to reading black type on a white ground.\n\nThere’s a really famous picture of Joan Crawford where the shadow of her leg looks like a hand grabbing at her nether regions, same thing - once you see it you can’t not see it.\n\n[http://www.hollywoodcelebrityphotographs.com/slideshow/bw/1284B-ss.html](http://web.archive.org/web/20060329201236/http:/www.hollywoodcelebrityphotographs.com/slideshow/bw/1284B-ss.html)\n\n"
    },
    {
      "time": " 27 March, 2006 - 9:30am",
      "content": "Or if the subject line had been ‘what do you see’……\n\n"
    },
    {
      "time": " 27 March, 2006 - 9:46am",
      "content": "nice\n\n"
    },
    {
      "time": " 27 March, 2006 - 9:52am",
      "content": "I sent this to a few friends w/a neutral subject line and they all saw “good” first which hopefully says I’m hanging out with the right people ;-)\n\n"
    },
    {
      "time": " 27 March, 2006 - 10:04am",
      "content": "No, Patricia, I think it says that we’re used to reading black text surrounded by white space, not white text surrouned by black outlines.\n\n"
    },
    {
      "time": " 27 March, 2006 - 10:05am",
      "content": "Black against white is much easier to read. Its the opposite for people with vision problems. Also depends on what you’re eyes saw right before taking this in. The frontpage of typophile is white, so naturally your eyes expect another all white background. Try saving this page under favorites and come back after viewing an all black site.\n\n"
    },
    {
      "time": " 27 March, 2006 - 10:16am",
      "content": "John - read my earlier comment where I said the same thing…\n\n"
    },
    {
      "time": " 27 March, 2006 - 11:07am",
      "content": "What about now?\n\n ![](http://web.archive.org/system/files?file=ms_good2.gif)\n\n"
    },
    {
      "time": " 27 March, 2006 - 11:11am",
      "content": "good definitely in the first one (for reasons others have mentioned). the second one it’s evil that pops out first. it definitely has to do with what we’re used to.\n\n"
    },
    {
      "time": " 27 March, 2006 - 11:18am",
      "content": "Also your EVIL isnt designed as well as GOOD. Try making them both equally legible.\n\n-middle E crossbar  \n-V terminals\n\n"
    },
    {
      "time": " 27 March, 2006 - 11:37am",
      "content": "I don’t agree that it’s because we’re used to black on white. I see good first both ways.  \nI think it’s because:  \na) The outermost contour reads “GOOD”  \nb) As “GOOD,” I can explain away the unfitting shapes (the crossbar of E looks like a paintbrush going dry; the notches in V and L look like dripping paint). As “EVIL,” I can’t explain the top line of the D especially.  \nc) I am by nature a virtuous person. ;-)\n\n"
    },
    {
      "time": " 27 March, 2006 - 11:58am",
      "content": "This might be worth checking out if you already haven’t: [http://johnlangdon.net/figureground.html](http://web.archive.org/web/20060329201236/http:/johnlangdon.net/figureground.html)\n\n"
    },
    {
      "time": " 27 March, 2006 - 12:48pm",
      "content": "[Sorry, Patricia, I missed your earlier comment.]\n\nMiguel, simply inverting the black and white won’t make a big difference, because you are still maintaining the exterior space and interior space relationship. If you change the background colour or the colouring of the EVIL, then you make it stand out a lot more, because you break the white space relationship that defines the black letters.\n\n ![](http://web.archive.org/system/files?file=GEcol.gif)\n\n"
    },
    {
      "time": " 27 March, 2006 - 1:59pm",
      "content": "Yes, these are good examples.\n\nSo, lots of things come into play and need to be considered. Things like relation between shape and background (foremost element, symmetry); colour; contrast (between colours, patterns); and factors related with the user/viewer: mood, cultural background, intrinsic (e.g. colourblindness) or extrinsic (e.g. calibration of the screen).  \nAnything else?\n\n"
    },
    {
      "time": " 28 March, 2006 - 7:42am",
      "content": "I love all the playing around with colours and inverting experiments done with it, so interesting to see the differences between each version.\n\nGot this in an email from another typophile, no clue where it came from or who designed it.\n\nI saw “Good” first and then stepped back a few feet and immediately saw “Evil”\n\n"
    },
    {
      "time": " 28 March, 2006 - 7:57am",
      "content": "Talked to the guy that sent me the image, turns out it was a random email passed on to him from his mom, she sent it along wtih some of the other optical illustions that were already posted in a link earlier in the discussion.\n\nI think she’d be floored to see the discussion that came from this one image.\n\n"
    },
    {
      "time": " 28 March, 2006 - 12:15pm",
      "content": ":…turns out it was a random email “\n\nPerhaps sent by an evil twin? :-)\n\nChrisL\n\n"
    }
  ]
}
