{
  "id": "18821",
  "title": "Opentype PS vs Opentype TT",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "1. Is OpenType PS better than OpenType TT and why?  \n2. Which of the two must i choose and why?  \n3. What is their difference?\n\n",
  "author": "zoran",
  "time": "27 Mar 2006 — 12:29am",
  "uid": "12109",
  "comments": [
    {
      "time": "27 Mar 2006 — 1:09am",
      "content": "[http://www.typophile.com/node/16695](http://web.archive.org/web/20141106221413/http:/www.typophile.com/node/16695 \"http://www.typophile.com/node/16695\")\n\n"
    },
    {
      "time": "27 Mar 2006 — 10:03am",
      "content": "1. Are pies better than cakes?  \n2. Which of the two must i choose and why?  \n3. What is their difference?\n\n;-)\n\n"
    },
    {
      "time": "27 Mar 2006 — 10:06am",
      "content": "Si,  \nEveryone knows pies are way better than cakes :-)\n\nChrisL\n\n"
    },
    {
      "time": "28 Mar 2006 — 4:01am",
      "content": "who ate all the pies? what are you having for tea? veggie pies... or a bit of steak and kidney?\n\nThe OpenType TT will be backward compatable on Windows. So your cutomers still on older systems can still use them without all the fancy features though. While the OT CFF PS ones might not.\n\n"
    },
    {
      "time": "28 Mar 2006 — 6:52am",
      "content": "Actually had \"Aussie pies\" ™ for tea yesterday evening, so you know which side of the fence I'll come down on.\n\nSeriously though if Zoran can explain a bit more about their project we might be able to suggest some pros/cons for each flavor, otherwise we're just comparing cakes to pies ;-)\n\nSi\n\n"
    },
    {
      "time": "28 Mar 2006 — 7:15am",
      "content": "Below is a short analysis that I prepared for Leslie Cabarga's \"Learn FontLab Fast\" book\\*\n\nPC TrueType / OpenType TT  \n(Also known as: Data-fork TrueType, Windows TrueType, TrueType-flavored OpenType, TTF)\n\nPros: Works on Windows, Linux and Mac OS X. May contain up to 65,535 characters, supports Unicode and can contain OpenType layout features, making the format suitable for multilingual fonts, non-latin fonts and advanced typographic features (such as automatic ligatures, small caps). TrueType hinting allows precise control in small screen sizes, can also contain bitmaps. Can include embedding rights information defining whether or not the font may be attached to electronic documents.\n\nCons: Does not work on Mac OS 8/9; not completely cross-platform. May cause output problems on ten-year-old PostScript output and printing devices. The designer usually needs to convert the outlines from beziers which may introduce slight changes in the shape. When converted back to beziers (e.g. in Illustrator), the resulting curves have superfluous points. Manual TrueType hinting is laborious to create. The multilingual and advanced typography features only work with new OpenType-savvy applications, otherwise just the basic character set is available. For font families, requires two versions of the family name within each font: the first may contain any number of styles; the second “mini-family” may contain only four styles.\n\nOpenType PS  \n(Also known as: OpenType-CFF, PostScript-flavored OpenType, OTF)\n\nPros: Works on Windows, Linux, Mac OS 8.6, 9, and OS X. Uses the bezier curve system preferred by designers and used in drawing apps such as Illustrator and Freehand so letterforms can be drawn precisely and outlines need not be converted. May contain up to 65,535 characters, supports Unicode and can contain OpenType layout features, making the format suitable for multilingual fonts, non-Latin fonts and advanced typography (automatic ligatures, small caps). Type 1 hinting is comparatively easy to create. Can include embedding rights information.\n\nCons: Type 1 hinting does not allow precise control in small screen sizes. Can theoretically contain bitmaps, but they are not displayed. Since this is a relatively new format, there are problems with some applications (some styles are not displayed in menus, kerning for non-Western characters does not work.) The multilingual and advanced typography features only work with new OpenType-savvy applications, otherwise just the basic character set is available. Two alternative family namings within each font must be devised: one where a family contains an arbitrary number of styles, and second where one family does not contain more than four styles. Does not work on Mac OS 8.\n\n\\*) Get the book while you still can:  \n [http://www.logofontandlettering.com/](http://web.archive.org/web/20141106221413/http:/www.logofontandlettering.com/ \"http://www.logofontandlettering.com/\")\n\nAdam\n\n"
    },
    {
      "time": "31 Mar 2006 — 6:46am",
      "content": "Well, as a matter of fact, that tedious font naming issue is not the problem of any font platform or font creator program.  \nIt is in fact because when Microsoft engineers, back yonder, built their marvellous DOS and Windows Operating Systems, they, in their infinite wisdom, figured that a single font family seems to have Plain, Italic, Bold and Bold Italic variants. That is the maximum of four variants. And that is STILL the reason for two different family naming.  \nOr am I totally of the mark here?\n\n"
    },
    {
      "time": "31 Mar 2006 — 1:57pm",
      "content": "You are not totally off the mark, but to be fair to those MS engineers, their observation was pretty accurate: they didn't define a standard type family, they just looked at what was out there and what other people were already doing. And what people were doing was inherited from practices determined by earlier digital type and by phototype, e.g. the number of fonts that could be included on a disk for phototype.\n\n"
    },
    {
      "time": "31 Mar 2006 — 2:05pm",
      "content": "But by 2006 we know better. Can't it be fixed?\n\nChrisL\n\n"
    }
  ]
}
