{
  "id": "18826",
  "title": "font & technology",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi,  \nI’m looking for books, links or anything else about the relationship between font and the technology used to design type… How font technology influenced font…  \nCan you help me??\n\n",
  "author": "<a href=\"user/11676\" title=\"View user profile.\">notjoe</a>",
  "time": "<br>",
  "uid": "11676",
  "comments": [
    {
      "time": " 27 March, 2006 - 8:35am",
      "content": "[Counterpunch : Making Type in the 16th Century, Designing Typefaces Now, by Fred Smeijers](http://web.archive.org/web/20060526013013/http:/www.amazon.com/gp/product/0907259065/sr=8-1/qid=1143473401/ref=pd_bbs_1/103-7615361-6465407?%5Fencoding=UTF8)\n\n"
    },
    {
      "time": " 27 March, 2006 - 10:59am",
      "content": "\\>I’m looking for books, links or anything else about the relationship between font and the technology used to design type\n\nEvery serious book or website that deals with type design can’t help but talk about the relationship between type design and the technology used in both the design of the type and the rendering of the text set in it. So your question is very open-ended and therefore difficult (or easy) to answer. Posting it 4 times won’t help :-(\n\nCheers, Si\n\n"
    },
    {
      "time": " 27 March, 2006 - 12:57pm",
      "content": "“Posting it 4 times won’t help :-( “.  \nYes, but that weird error message might causing him to try several times. I had to open a new browser tab to make sure this posted. (I’m editing this post now.)\n\nHaving said that, take a look at the [Books](http://web.archive.org/web/20060526013013/http:/typophile.com/wiki/Books) in the Typowiki.\n\n"
    },
    {
      "time": " 27 March, 2006 - 1:27pm",
      "content": "\\> Yes, but that weird error message might causing him to try several times.\n\nTrue. Sorry Joe if that’s the case.\n\n"
    },
    {
      "time": " 30 March, 2006 - 9:35am",
      "content": "Yes, the weird error cause me to try again… I’m sorry..\n\n"
    },
    {
      "time": " 30 March, 2006 - 9:58am",
      "content": "Peter Burnhill’s “Type Spaces” (Hyphen Press) is as hardcore as it gets.\n\n"
    }
  ]
}
