{
  "id": "18838",
  "title": "2 Questions for the Type Designers",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "When designing a font:\n\n1) Do you work with preliminary sketches or directly on the computer?\n\n2) Do you follow a strict geometric approach on your designs or a more intuitive and empirical approach (where geometry plays a secondary role)?\n\n",
  "author": "gtrianta",
  "time": "27 Mar 2006 — 11:28am",
  "uid": "10933",
  "comments": [
    {
      "time": "27 Mar 2006 — 11:42am",
      "content": "Personally, I used to do more sketches but now I just go right to the blank computer screen and start.  \nRegarding geometry, it depends on the typeface. Sometimes the geometry is the concept but usually I just use my eyes and let my mind decide what it sees to be done. I have no hard \"method\", so I can't really pin it down.\n\nChrisL\n\n"
    },
    {
      "time": "27 Mar 2006 — 12:05pm",
      "content": "I always start with sketch. I agree geometry depends on the design.\n\n"
    },
    {
      "time": "27 Mar 2006 — 12:13pm",
      "content": "1) It depends on the design, but generally I'm not good enough (yet?) to avoid making semi-finished sketches (at least of the key glyphs).\n\n2) I avoid geometry explicitly (unless somebody pays me [enough] to rely on it). And although it's funny that you say \"intuitive <cite>and</cite> empirical\", that's actually exactly what I do! I trust myself, but not completely, and think it's very important -especially in text type- to pay central attention to empiricism and theory.\n\nhhp\n\n"
    },
    {
      "time": "27 Mar 2006 — 12:20pm",
      "content": "i usually do them right in the computer, but i suspect that eventually i'll do more sketching. it really depends on the design though, which leads into the second question about geometry. depending on what the design is, sometimes it's easier to do in a computer (and with a grid if you want perfect symmetry) but other designs are certainly easier to draw on paper first.\n\n"
    }
  ]
}
