{
  "id": "18836",
  "title": "(x) Dutch KPN logo typography",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi everyone,\n\nSince a few days the dutch telecom-company KPN has a new visual identity, designed by Studio Dumbar.\n\nThe typefaces used in this image are partly clear to me.  \nthe word k p n is written in the typeface Proxyon from the dtl.\n\nMy question is about the rest of the text: ‘sluit je aan’.\n\nIm lokking for this typeface. Is this custom made?... loosely based on a exsiting model, or just bought?...\n\nanyone a idea?... thanks!\n\n;-) Matthijs\n\n ![](http://web.archive.org/web/20141112115335im_/http:/typophile.com/files/kpn_logo.jpg)\n\n",
  "author": "matthijs van Leeuwen",
  "time": "27 Mar 2006 — 10:18am",
  "uid": "9637",
  "comments": [
    {
      "time": "27 Mar 2006 — 10:50am",
      "content": "Are you sure about DTL Prokyon? It also looks a lot like [FF Dax](http://web.archive.org/web/20141112115335/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontpackage&startrow=1&records=&currpage=1&totalrecords=6&displayfontid=FF.11549.0.0&fontRendererText=kpn) or Dax Wide Bold.\n\nI'm sorry, I know you didn't ask about the 'kpn' lettering.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "27 Mar 2006 — 10:56am",
      "content": "I am pretty sure that the typeface is not the Dax... look to the details...\n\nI assumed it is the Proxyon from the DTL (after a good inspection)...\n\nbut that was indeed not the question....  \nI'm looking for the the other typography in this trademark...\n\nthanks anyway, M\n\n"
    },
    {
      "time": "27 Mar 2006 — 11:16am",
      "content": "Yes, I can see there are small differences from Dax. Sorry again for going the wrong direction on your post.\n\nI have looked for the other sans. The curved 'i' and 'l' are not a common feature. It seems not to be among the 800+ sans families I have collected in the Sans Serif Font ID Guide. I also checked all the recent FontFont releases I had here in samples -- no luck. I am still looking.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "27 Mar 2006 — 11:48am",
      "content": "A small comment about the assumed DTLProkyon-ident: the lc p is a tad different. It looks like the upperpart has been redrawn to conform more to that of the lc n.\n\n"
    },
    {
      "time": "27 Mar 2006 — 4:55pm",
      "content": "What are those bubbly things? Yuck. Man their in-house is getting out of hand. Looks like someone needs to go back and consult Dumbar again.\n\n"
    },
    {
      "time": "27 Mar 2006 — 11:08pm",
      "content": "The letters kpn are drawn for this logo and the other one, KPN Display, is custom made for KPN. KPN Display is an OpenType with more versions of every glyph (three sets). The one used for the pay-off is a mixture between two sets.\n\nPieter\n\n"
    },
    {
      "time": "28 Mar 2006 — 2:58am",
      "content": "ok...\n\nso completely inhouse design?...\n\nthanks,\n\nM\n\n"
    },
    {
      "time": "28 Mar 2006 — 5:53am",
      "content": "And Pieter knows what he is talking about... He made it himself!\n\nCheck his website [http://www.caketype.com](http://web.archive.org/web/20141112115335/http:/www.caketype.com/ \"http://www.caketype.com\") for more fonts.\n\n"
    },
    {
      "time": "28 Mar 2006 — 5:57am",
      "content": "Hi Maik! Welcome at Typophile and thank you for the CakeType promotion!\n\nPieter\n\n"
    }
  ]
}
