{
  "id": "18859",
  "title": "Visible traces of fear and uncertainty",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hey, this is a background of a current 4th year research project I am studying\n\nI have been researching into the term Democratisation of Information (accessibility of information to the general public). I came across thisterm as a result of an early interest in how western culture has become bombarded with information and how as a result of this it has become harder and harder to access accurate information. After thinking about the possibilities surrounding this term I came up with a selection of possible angles that proved to be somewhat inter-related with design, technology and information excess. They are,\n\n• Punctuation / language changes  \n• From page to screen (reading on screen vs. paper)  \n• Aesthetics, the loss of tactile qualities on screen  \n• Accessibility and value of design\n\nI began experiencing a significant amount of trouble narrowing this topic down, due  \nof it’s broad nature. So to progress I began to think about this situation from a different angle. Instead of focusing on the technological ramifications I decided to think about the implications that uncertainty is having on people. I am thinking about how western society has become terrorized by fear, whether concerning national security, road safety, protection of public health, natural disasters, etc. and how “every form of risk is ever-present, contagious, and needs to be accounted for or immediately eradicated”. From here I have begun to think about how “safety and security obsessions are leaving behind ever-more-visible traces, especially in public spaces, in the form of smoke-free zones, surveillance cameras” etc. With the information I am gathering I intend to interpret fear and space through typographic exploration.\n\nIf anyone has any comments to make on possible angles for this, it would be much appreciated.\n\n [‹ Modern Sans Logo font for Oil-rig Repairment Company](http://web.archive.org/web/20080103050551/http:/typophile.com/node/19694 \"Go to previous forum topic\") [Wayfinding System For PA Academy of the Fine Arts ›](http://web.archive.org/web/20080103050551/http:/typophile.com/node/19685 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080103050551/http://typophile.com/user/11953\" title=\"View user profile.\">Ispybri</a>",
  "time": "<br>",
  "uid": "11953",
  "comments": [
    {
      "time": " 28.Mar.2006 7.27am",
      "content": "Fear and uncertainty in these United States tend to be handled in different ways by different groups. Those with “religious” inclinations tend to retreat deeper into dogma, because all Western religions claim to be in possession of absolute truth and describe a _temenos_ where the elect may collectively ward off the fear. This trend is evidenced by the growing influence of right-wing Christian groups in the political arena.\n\nA great many of those who walk no dogma simply ignore—or, at least, attempt to ignore—the fear and uncertainty, and retreat into their own little worlds, a task that has been made far easier by the increasing availability of portable electronic devices. Look in any public place and you will find cell-phone performance artists, Blackberry or Palm Pilot junkies, or iPod _isolatos_—all intensely wrapped up in their own personal little worlds, and increasingly oblivious to the presence (and rights and needs) of others.\n\nBoth responses contribute to the dissolution of the social fabric: the pious by drawing lines between the saved and the damned, and the clueless by being, well, clueless.\n\nHow do you interpret this typographically? I’m not sure, but it looks like we’re in deep Dada to me...\n\n"
    },
    {
      "time": " 28.Mar.2006 7.57am",
      "content": "If you’re talking about history, ie comparing how things are now to how things were, don’t be too short sighted. You can make a more meaningful analysis is you study a longer historical period: more time, more changes.\n\nInformation is not less accurate now than ... when? Consider how patent medicines (eg Cure for Cancer etc.) used to be advertised c.1900. First, some magazines stopped accepting ads for them, then they were legally prohibited. Was fear of death, particularly infant mortality, any more palpable in those days, when it was more likely than today? How could it be, given that people adapt to the norm?\n\nIt’s very easy to deal in generalizations, but all you’re doing is gossiping. A tightly focused typography study would give you the chance to get specific, and see whether this idea of “bombarded with information” holds any water.\n\nI think it’s a myth, and that corporate concentration, narrowcasting and tightly focued demographic marketing lessen the amount of information people receive. But if you are going to study the idea, surely you would have to do some kind of statistical comparison of (a) then and now? Or else you will just end up recycling the usual cliches, which is bombarding your professors with familiar information.\n\n"
    },
    {
      "time": " 28.Mar.2006 8.11am",
      "content": "I’m with Nick Shinn on this one: if you think western society has become terrorized by fear, how does it compare to the threat of nuclear annihilation during the Cold War? What about xenophobic reactions to Irish, German, Japanese, Russian, Central European, Mexican immigrants, among countless others? If it has become harder to access accurate information, what about pre-internet days? What about pre-telecommunication days? Certainly the Hearst publishing empire didn’t operate by accurate, dispassionate journalism.\n\nI think you have some strong assumptions at the heart of your project, and I’m not saying that they’re wrong, just that they need to be identified and examined as you find the direction your project will take.\n\nAlso, would it be possible for you to elaborate a bit more on your bullet points above? I’m not quite sure what they mean in this context.\n\n—Jim K.\n\n"
    },
    {
      "time": " 28.Mar.2006 10.08am",
      "content": "we as people are just as afraid as we’ve always been. _this_ is life. circumstances change over the years, and some people have (seemingly) better situations than others. however, the fundamental uncertainties remain: where do we come from? why are we here? and where are we going to go when we die?\n\ni believe in finding peace in that.\n\n"
    },
    {
      "time": " 28.Mar.2006 10.52am",
      "content": "\\> and how as a result of this it has become harder and harder  \n\\> to access accurate information.\n\nI vigorously disagree with this premise. In many cases, it is astounding what information is available. I can access the latest findings in the field of quantum physics at MIT. And in spite of what the major media wants me to think, I can find plenty of the missing info on any subject.\n\nIf you mean that there is more deceit now, I wholeheartedly agree.  \n(Hey! Where are we going, and why are we in this handbasket?)  \nIt part of the general breakdown that is sure to occur when morality is relative, and corrupt natures are allowed to rationalize to their hearts content.\n\nHow this relates to fonts? I’ll leave that to hrant, who is sure to have strong feelings about this.\n\n"
    },
    {
      "time": " 30.Mar.2006 3.23am",
      "content": "Accuracy of information was an early premise that I was investigating, I should have clarified that I was looking at this in terms of finding relevant information via google etc. this is not to say that I don’t feel that we are surrounded by inaccurate forms of information. With the accessibility and uploading capabilities of the Internet massive amounts of information can be accessed with no means to moderate the quality / accuracy etc.\n\nHowever the post says this was an initial area of interest that is somewhat inter-related with where my research is at now.\n\nIt would take me some time to elaborate on the four angles that came from researching the democratisation fo information, but they are related in certain respects.\n\nSince the main post my angle has taken a significant turn. I will post the information in the next couple of days.\n\n[B]\n\n"
    },
    {
      "time": " 4.Apr.2006 2.14pm",
      "content": "Dennis, you should know by now that bringing out the phrase “moral relativism” when it has no bearing on the conversation is a one-way ticket to a flame war.\n\nFear and uncertainty in typographic form? How about interstitial texts, subliminal messages... How about type that could be read to mean two different things, one innocuous and one malevolent?\n\nAbout information overload: you might be interested in Borges’s short story_Library of Babel_ or (a longer, much more confusing read) Jeff Noon’s _Falling out of Cars_. Both really interesting interpretations of the idea of a signal buried by noise.\n\n"
    },
    {
      "time": " 4.Apr.2006 2.24pm",
      "content": "\\> Dennis, you should know by now that bringing out the phrase “moral relativism”\n\nIs that the same as relative morality? I don’t know how that would bring about a flame war? The alternative being that \\*everyone\\* gets to make it up as they go along?\n\nAnd it ties in with this subject in my mind. He wrote:\n\n\\> it has become harder and harder to access accurate information.\n\nI can only assume he was talking about the purposeful deceit I see all over the place as people pursue agendas to the exclusion of truth. And if you are caught, deny it. Because “it’s all for the cause” which supposedly justifies their actions. And if we were as smart as they are, we’d know truth is relative anyway.\n\n"
    },
    {
      "time": " 4.Apr.2006 4.46pm",
      "content": "The reason the words “moral relativism” are such a troll is simple: they’re a catch phrase employed nowadays to lambaste anyone who doesn’t subscribe to a particular philosophy. People don’t like it when you challenge their beliefs, even when you do so implicitly and unintentionally.\n\n"
    },
    {
      "time": " 4.Apr.2006 5.00pm",
      "content": "\\> who doesn’t subscribe to a particular philosophy.\n\nI wasn’t aware it was a “catch phrase”. It was just a term I heard somewhere that explains a concept that has some scary implications.\n\nAs the baseline gets shifted, more behavior is acceptable, and if you follow that through, who’s to say chaos isn’t just as acceptable of a philosophy?\n\nNot to mention the trend I see that as more that traditionally unacceptable behavior shifts the baseline, the more room for polarization, and less chance for rapport. Not that I think there is any hope in the worldly sense. I’m just saying what seems logical to me.\n\n"
    },
    {
      "time": " 4.Apr.2006 5.13pm",
      "content": "I think you may be mistaking moral _pluralism_ for moral relativism. Relativism, the idea that there is no truth, is something I don’t think many people agree with; on the other hand pluralism, the idea that many different value systems can all be equally valid, seems to be fairly prevalent, at least on the intarweb. I think when you’re exposed to viewpoints of people across the world, you start to see how even though two philosophies are different - even contradictory - they can still express the same universal human truths.\n\n"
    },
    {
      "time": " 4.Apr.2006 5.46pm",
      "content": "Ah, well...we shall see.\n\nNote: I was not aware the terms I was using had additional meaning as phrases, but to mean relative in the sense that it depends on conditions or the way the wind is blowing. I prefer to have a few absolutes. If we let our imaginations determine what is acceptable...\n\nanyway, onward.  \n: 0\n\n"
    },
    {
      "time": " 26.Apr.2006 4.10pm",
      "content": "yo,  \ni found this article on Luc Devroye’s website…\n\n[by Julius Grey](http://web.archive.org/web/20080103050551/http:/cg.scs.carleton.ca/~luc/juliusgrey2.html)\n\ni find it interesting. however, the idea that we are slipping away from some kind of idealistic free society is hard for me to believe. the lower 80% have always been oppressed by the top 5% of the people…\n\ntechnology is at it’s peak, which compounds the problem, but everything is always relative. we would be foolish to think that this is the first time in history in which the poor have been oppressed by the rich, and for that matter, oppressed by illusions of freedom… and for that matter, oppressed by private interest groups!\n\nwould you want to have been born 500 years ago? 1000 years? 2000 years? i’m sure it was a hell of a lot worse, by our standards. and if you didn’t know any better. it probably felt pretty similar.\n\n"
    },
    {
      "time": " 5.May.2006 3.37am",
      "content": "The extra sad and scary things is though that increasingly, the poor don’t know it.\n\nDemocracy now acts as a veil that causes the oppressed to think they deserve what they’re getting, and since people naturally tend to think better-than-average of themselves they <cite>must</cite> feel that things are going well, overall. It’s very hard to blame one’s-self, especially for something abstract like the refusal to accept that one is not capable of participating in decisions of state.\n\nIf we accept that we are limited, we become less oppressed. We are told to daydream about our personal potential, that “anything is possible if you put your mind to it”, that “we deserve it”, that a single person can change everything, for the simple reason that such a mindframe makes us much better peons in the end.\n\nhhp\n\n"
    }
  ]
}
