{
  "id": "18867",
  "title": "Five Volume Set",
  "forum": "Design",
  "tags": [

  ],
  "content": "When I worked for design firms I had worked on a nice amount of type setting and layout but I have noticed most of my freelance work has not been text heavy. My love of type and its proper setting has lead me to start pursuing work that involves more type instead of advertising and promotion.  \nMy dilemma is that I don’t have any idea of the fair market value for that sort of work on a per project basis. Since I would like to start working more in this field, I want to quote an excellent price. But I don’t want to be left doing hours of work for free.  \nI have two projects, a five volume set with about two to three hundred pages a section, with accompanying illustrations. And a one volume book with challenging translated text with running commentary and foot notes.  \nIf anyone have resources for such numbers, or would be willing to share their own knowledge, I would be very thankful.\n\n",
  "author": "PL",
  "time": "28 March, 2006 - 10:02am",
  "uid": "11199",
  "comments": [
    {
      "time": " 28 March, 2006 - 10:17am",
      "content": "Will you be doing design, layout, or just typesetting?\n\n7¢/word seems to be the going rate for straight typesetting (here in NY, book publishing).\n\nIllustrated book publishers pay between $20 and $50/page for design/layout (including typesetting). It depends on the complexity of the project. Some break it down to, say, $25/page plus 7¢/word or some such. Scanning is extra.\n\nHope this is helpful.\n\n"
    },
    {
      "time": " 28 March, 2006 - 11:22am",
      "content": "Pattyfab,  \nIt sure is helpful. I would be doing the design, layout, and setting. I just wanted to add a shamless compliment. Besides the fact that I just happen to have read quite a few of the books which you designed - your book designs are truly stunning. I would be proud to have worked on such projects. Would you have any advice on how to start in that direction?\n\n"
    },
    {
      "time": " 28 March, 2006 - 12:00pm",
      "content": "Wow, thanks! I’ve been at it for 20 years now and on my own for almost 6. Advice… I’d try to target publishers that do the kind of books that interest you but must warn you it can be VERY hard to break through to the art directors. Having been one myself I know that they get kind of lazy - in that they tend to use designers they already know well rather than taking a chance on someone new despite the talent or qualifications. There are still publishers that should be hiring me and aren’t despite pleasant meetings and promises. I don’t take it personally (it’s their loss) and am grateful to the good clients I do have. I hate that part of the job - hustling for new clients - but it has to be done rigorously. Nothing more frustrating than seeing a bad design on a really cool book and KNOWING I could have done it better.\n\nAlso recommend you put up a web site if you haven’t already.\n\nAnd - if you’re just starting out - don’t turn any job down. It’s really fun most of the time even to design a boring book, you can still make it the best you can and be proud of it, even if it’s not the one you show all your friends in the bookstore. Plus you get the practice.\n\n"
    }
  ]
}
