{
  "id": "18879",
  "title": "(x) \"My Tools Application Checklist\" tech sans - FF DIN {Geoff}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I have been looking everywhere for this font to no avail.  \nI thought Neutraface came fairly close but there are obvious differences like ‘A’ and ‘P’. Also it looks fairly different in lower case.  \nUnfortunately what I have is a very limited sample.\n\nDoes anyone have any idea?\n\nThanks!\n\n ![](http://web.archive.org/files/font_sample.gif)\n\njayrom\n\n",
  "author": "<a href=\"user/12243\" title=\"View user profile.\">jayrom</a>",
  "time": "<br>",
  "uid": "12243",
  "comments": [
    {
      "time": " 28 March, 2006 - 5:03pm",
      "content": "Looks like [FF DIN](http://web.archive.org/web/20060503185434/http:/www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufacturer&displayfontid=FF.9467.0.0) [squooshed](http://web.archive.org/wiki/squooshed) to me.\n\n"
    },
    {
      "time": " 28 March, 2006 - 7:47pm",
      "content": "If that’s the actual size of it, it may just be a bitmap (screen) font, which are often used for navigation buttons. In other words, this may not be a ‘normal’ font that you could print, because bitmap fonts only look good at low screen resolutions.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 28 March, 2006 - 7:54pm",
      "content": "Mike, I highly doubt this is a bitmap font as there is evident anti-aliasing which would not normally occur in the use of bitmap fonts.\n\n"
    },
    {
      "time": " 29 March, 2006 - 7:26am",
      "content": "Thanks for the feedback.  \nI do not think it is a bitmap font. This is an actual image that was created by a designer who has since disappeared without bothering to let me know which font she used!  \nI looked at FF DIN but it seems to me the ‘H’ and ‘E’ are fairly different, with the middle stem(?) being a lot lower in the font I posted.  \nThis characteristic is what made me first believe that it was Neutraface.\n\njayrom\n\n"
    },
    {
      "time": " 29 March, 2006 - 8:05am",
      "content": "\\> _I looked at FF DIN but it seems to me the ‘H’ and ‘E’ are fairly different, with the middle stem(?) being a lot lower in the font I posted._\n\nThat’s because the type size is really small in relation to the pixel size. Quite often the horizontal stems “jump” up or down a pixel when anti-aliasing. I’m positive this is DIN.\n\n"
    },
    {
      "time": " 29 March, 2006 - 9:48am",
      "content": "Great! I will get FF DIN then and start working ;-)  \nThank you so much for all the help, you have no idea how much time I’d spent trying to figure this out.\n\njayrom\n\n"
    }
  ]
}
