{
  "id": "18877",
  "title": "Design ideas for Collected Letters book",
  "forum": "Design",
  "tags": [

  ],
  "content": "I would like suggestions for how to design pages for a book that includes a collection of letters with descriptive introductorty copy and footnotes.\n\nThis is a labor of love for my family based on letters from my ancestors beginning in the 1820s on up to the present. My mother collected, translated (from the archaic handwriting) and annotated the letters. She also provides maps (she’s a geographer/cartographer) and other vital data. We also have several photographs from glass plates. This is what happens when you grow up on a farm in which nobody has been known to throw anything away since the place was built in 1841!\n\nMy mother shopped her manuscripts around to several publishers and historical societies to no avail. So we’re going the self-publishing route. That way our family members will have a beautiful document, at least.\n\nA problem I ancitipate is that I will have several pages of explanatory material followed by several pages of contents from the letters. That means there needs to be a way for the reader to differentiate between letter content and explanatory copy without having the benefit of seeing both on one page.\n\nAre there page treatments you think might work well for this type of book? Examples would be greatly appreciated!\n\nMy research so far has consisted of entering “collected letters” in the Amazon search engine and searching through books that allow a “look inside.” I’ll be heading to the University library in a couple of days to browse through the stacks. Any book artist pages or blogs you’d recommend I check out? I’m planning on doing more research, so book recommendations would be great.\n\nThanks!\n\nKristin\n\n",
  "author": "kristin",
  "time": "28 March, 2006 - 2:38pm",
  "uid": "1553",
  "comments": [
    {
      "time": " 29 March, 2006 - 1:26am",
      "content": "If it your family history, do it the way you think will give it the justice it deserves. Sorry if that sounds vagu—K\n\n"
    },
    {
      "time": " 29 March, 2006 - 3:38am",
      "content": "The usual way to include large sections of quoted copy is to make a different measure (normally narrower) but there are many other routes, most obvious being different fonts or members of a family (for example Joanna or Quadraat roman and italic). What page size are you working to, could there be, for example, a narrow column on the outside with a descriptor of the author, date and recipient next to each letter?  \nTim\n\n"
    }
  ]
}
