{
  "id": "18906",
  "title": "More dropshadows...",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "I have never had the benefit of comments from professional graphic designers, so I was hoping if someone could comment.\n\nAlmost everything I do is only for web, so screen resolution factors in. And size.  \nUsually I try and keep the image’s longest side 500 pixels or less.\n\nThe following two samples are the same except for slight dropshadow. What I wonder is if the average persons screen with still have good legiblity without the shadow.\n\n ![](http://web.archive.org/files/nondrop.jpg)\n\n ![](http://web.archive.org/files/drop.jpg)\n\n",
  "author": "<a href=\"user/12014\" title=\"View user profile.\">fontplayer</a>",
  "time": "<br>",
  "uid": "12014",
  "comments": [
    {
      "time": " 29 March, 2006 - 4:22pm",
      "content": "i dunno.. to me there’s never any need for gradients or drop shadows:(\n\n"
    },
    {
      "time": " 29 March, 2006 - 4:24pm",
      "content": "I would probably use white for the letters.\n\n"
    },
    {
      "time": " 29 March, 2006 - 4:30pm",
      "content": "Well I am no professional, but I would like to say something. Gradients are useful but they can get out of control very fast. I like using very subtle gradients to break up a flat color. Dropshodows are useful only in motion-based work, no-where else.\n\nI understand that you DON’T want a great contrast between the background and text, but there are so many more “professional” ways to approach that than this.\n\nHope that helps.\n\n"
    },
    {
      "time": " 29 March, 2006 - 4:34pm",
      "content": "“Drop shadows are useful in motion work, nowhere else” Well, as much as I hate overly shadowed and “dimensionalized” (is that a word?) design, drop shadows are useful anytime you need to create seperation between elements. In motion, print, or anywhere else. Just don’t overdo it.\n\nTo me, your top sample is almost illegible.\n\n"
    },
    {
      "time": " 29 March, 2006 - 4:56pm",
      "content": "OK, I very much appreciate the comments. I went back and tried white and it was too harsh for the feeling I wanted, but I was able to eliminate the dropshadow and gradient by going to a light pink.  \nIt still has a soft feeling I like.\n\n ![](http://web.archive.org/files/dftemple.jpg)\n\n"
    },
    {
      "time": " 29 March, 2006 - 5:07pm",
      "content": "much better. more “silent” too.\n\n"
    },
    {
      "time": " 29 March, 2006 - 5:18pm",
      "content": "I settled on a [blend with a little more orange](http://web.archive.org/web/20060708110227/http:/www.fontplay.com/images2/dftemple.jpg)\n\n(trying different link method to see if new window will open)\n\n"
    },
    {
      "time": " 29 March, 2006 - 5:29pm",
      "content": "“drop shadows are useful anytime you need to create seperation between elements.”\n\nI am gonna disagree on you there Chris. And the word “elements” is very vague. There are so many other ways to create seperation other than drop shadows. The idea of drop shadows is to create depth anyway, which is sometimes useful in highly-dynamic motion graphics…. keyword being “motion.”\n\nPS: Great edit there fontplayer. Compositionally, the justified left creates a line which isn’t really lined up with anything so it feels like its floating. I would tone the gradients down even more. Your quotation should hang on the outside. Now about the typeface…\n\n"
    },
    {
      "time": " 29 March, 2006 - 5:32pm",
      "content": "I am with Prakash. In theory I am against drop shadows and outer glows, etc…  \nBut there are situations where they work.\n\npeace\n\n"
    },
    {
      "time": " 29 March, 2006 - 6:04pm",
      "content": "\\> Your quotation should hang on the outside.\n\nI don’t know what you mean by this. The left isn’t justified. The text is centered (not in relation to the image).\n\n\\> I would tone the gradients down even more.\n\nThere isn’t any gradient left in the [TEXT](http://web.archive.org/web/20060708110227/http:/www.fontplay.com/images2/dftemple.jpg). If you mean the lighting in the photo, I thought that is what made the image cool. It is from an alcove in my dentist’s office.\n\n\\> Now about the typeface…\n\nIt is a free one, and worth more than I paid for it.  \n: )\n\n"
    },
    {
      "time": " 29 March, 2006 - 9:02pm",
      "content": "Well Prakash, you said they’re useful in motion work and nowhere else. That’s a pretty narrow point of view. I can definitely agree that drop shadows are overused. Photoshop filters can be used for evil or good :) But if used subtely, they can create seperation between type and a background. I’ve done drop shadows where you couldn’t even tell they were there, but when they were removed it was obvious that they helped. If you don’t need ‘em don’t use ‘em. That’s my 2 cents…\n\n"
    },
    {
      "time": " 29 March, 2006 - 10:28pm",
      "content": "[HERE](http://web.archive.org/web/20060708110227/http:/www.fontplay.com/images2/charissilv2.jpg) is the larger image the background was taken from. (with another little FP thrown in)\n\n"
    },
    {
      "time": " 30 March, 2006 - 7:18am",
      "content": "Never say never.  \nAs a thought, have you tried making a compound path of the text and using that to mask a rotated version of the background. Also you might find that just the shadow without the letters can provide sublety. You mention screen use in your post is that what is intended for because there is no way that will print as you see it on screen and that k is diabolical even for a free font.  \nTim\n\n"
    },
    {
      "time": " 30 March, 2006 - 8:07am",
      "content": "\\> As a thought, have you tried making a compound path of the text  \n\\> and using that to mask a rotated version of the background.\n\nIf I understand what you mean, then the problem I see is that there would be a part in the middle where there was no contrast at all.\n\n\\> Also you might find that just the shadow without the letters can  \n\\> provide sublety.\n\nThis idea provioked me to try it and I love the effect. I added just a 33% soft light layer of the sherbert color to bring it out just a tad more. I like the effect, but can’t decide if I like it more than the plain.\n\n ![](http://web.archive.org/files/dftemplev2.jpg)\n\n"
    },
    {
      "time": " 30 March, 2006 - 8:22am",
      "content": "\\> I’ve done drop shadows where you couldn’t even tell they were there,\n\nI tried to make the text pop a little more with [YOUR IDEA](http://web.archive.org/web/20060708110227/http:/www.fontplay.com/images2/dftemple.jpg) (by using reduced opacity overlay layer with shadow blurred) I wonder would one of the purists notice the dropshadow? I think this is the one I will use.\n\nAgain I appreciate \\*all\\* the comments. I have never had a teacher for any of these things. Just learning by doing.\n\n"
    },
    {
      "time": " 30 March, 2006 - 10:44am",
      "content": "_If I understand what you mean, then the problem I see is that there would be a part in the middle where there was no contrast at all._  \nYes, but worth investigating (in my opinion) all the same, you can also look at slightly rotating or stretching the background to avoid that. Have fun experimenting, reject any that you feel don’t work keep the others (as a file or just at the back of your mind) to use in other circumstances that might suit. Part of the skill of designing is to know when to reject an idea.  \nFor example that shadows only effect on white can produce a blind embossed look where budgets or circumstances don’t permit.  \nTim\n\n"
    }
  ]
}
