{
  "id": "18907",
  "title": "ID: Rushall Mews + bonus typo-blunder!",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi there,\n\nCan someone ID this one for me, please? Novarese is the only one I can find with an 'A' with that backward serif, and it obviously isn't that.\n\n ![](http://web.archive.org/web/20131017044123im_/http:/typophile.com/files/RushallMews.jpg)\n  \nAnd bonus typo-blunder: Poor old MEWS! I wonder how often this sort of thing happens, and how many people would notice?\n\nThanks.\n\n",
  "author": "Stephen Lording",
  "time": "29 Mar 2006 — 3:39pm",
  "uid": "4919",
  "comments": [
    {
      "time": "29 Mar 2006 — 5:13pm",
      "content": "do you think, perhaps that it was\n\na.) accidentily put up backwards, or other wise flipped.\n\nor b.) was done on purpose for some sort of mish-mashed effect like with the MEWS.\n\n"
    },
    {
      "time": "29 Mar 2006 — 5:25pm",
      "content": "or c.) The signmaker was drunk. ;^)\n\n"
    },
    {
      "time": "29 Mar 2006 — 5:27pm",
      "content": "I think it's highly unlikely to be intentional. I think the guy on the ladder with the glue just grabbed what looked like an 'M' and bunged it on, which meant the 'W' was always going to be wrong too. At least he got the first 'S' right.\n\n"
    },
    {
      "time": "29 Mar 2006 — 7:18pm",
      "content": "that's hilarious!\n\n"
    },
    {
      "time": "29 Mar 2006 — 8:41pm",
      "content": "That is so funny! I'm glad I don't live there.\n\n"
    },
    {
      "time": "29 Mar 2006 — 11:51pm",
      "content": "We used to have a similar sign for a bank here in Gent which read \"GEMEENTEKREDIET\", and about every possible letter was flipped or rotated. Quite a sorry sight. I still regret never having taken a picture.\n\nYour sample is quite similar to [Plantin](http://web.archive.org/web/20131017044123/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=M.94.0.3&attributes.sampleSize=48&sampleText=RUSHALL+MEWS&sampleSize=32).\n\n"
    },
    {
      "time": "29 Mar 2006 — 11:57pm",
      "content": "Just checked Rookledge's, but no luck finding it by earmark -- none of them have the top serif on both uc A and W.\n\n"
    },
    {
      "time": "30 Mar 2006 — 5:11am",
      "content": "Hi Yves,\n\nThanks for your efforts trying to track the typeface down. I carry my camera with me everywhere I go now, because you never know when a sign like that's going to come up.\n\nThanks again.\n\n"
    },
    {
      "time": "30 Mar 2006 — 5:29am",
      "content": "smew  \n/smyoo/\n\n• noun a small northern diving duck, the male of which is white with black markings.\n\nIf only they had the E the other way up :)  \nTim\n\n"
    }
  ]
}
