{
  "id": "18911",
  "title": "Accent keystrokes",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Help!!!\n\nI'm setting a magazine and am involved in a very complicated index. There are many, many foreign accents. However, I am having trouble identifying all of the keystrokes. I am using Times as I believe it contains most of the accents. Does anyone know where I can access a chart or listing of complete accent keystrokes?\n\n",
  "author": "Rob Fujimoto",
  "time": "29 Mar 2006 — 5:20pm",
  "uid": "12259",
  "comments": [
    {
      "time": "29 Mar 2006 — 5:27pm",
      "content": "If your using a newer macintosh, check the keyboard Viewer and character palete it's under system preferences on Mac OS X. if you're on a PC, I believe there is an application that's called \"Glyph Viewer\", or something similair.\n\ngood luck\n\n-Alex\n\n"
    },
    {
      "time": "29 Mar 2006 — 5:39pm",
      "content": "Thanks Alex. I'll give it a try. I'm on OS X 10.4.5. I was trying to use the character palette through the menu bar but not having any success.\n\n"
    },
    {
      "time": "29 Mar 2006 — 5:47pm",
      "content": "It doesn't seem to be working... anyone else have any ideas? Please? Pretty please?\n\n"
    },
    {
      "time": "29 Mar 2006 — 6:26pm",
      "content": "You have to enable it via the International control panel in System Preferences. Select the \"Input Menu\" tab of the International control panel. Make sure both \"Show input menu in menu bar\" and \"Keyboard Viewer\" are checked. You should now have a menu with a little flag icon at the top. The Keyboard Viewer will be in that menu.\n\n"
    },
    {
      "time": "29 Mar 2006 — 6:28pm",
      "content": "This might be handy too:\n\n[http://ml.hss.cmu.edu/mlrc/links/keyboardhelp.html](http://web.archive.org/web/20131013111956/http:/ml.hss.cmu.edu/mlrc/links/keyboardhelp.html \"http://ml.hss.cmu.edu/mlrc/links/keyboardhelp.html\")\n\n"
    },
    {
      "time": "29 Mar 2006 — 6:42pm",
      "content": "Hi Mark,\n\nThanks! I did have the Keyboard Viewer open, however, it doesn't show me which keystrokes are to be used for particular accents. I need to type in this character \\>\\> Ş (Latin Upper Case \"S\" with cedille). I can select it in Character Palette but it doesn't get inserted into my Quark document.\n\n"
    },
    {
      "time": "29 Mar 2006 — 10:56pm",
      "content": "you do know popchar x, right?\n\n[http://www.ergonis.com/products/popcharx/](http://web.archive.org/web/20131013111956/http:/www.ergonis.com/products/popcharx/ \"http://www.ergonis.com/products/popcharx/\")\n\n"
    },
    {
      "time": "30 Mar 2006 — 2:38am",
      "content": "I am afraid you won’t be able to insert non Western characters in Quark unless you have special versions of your fonts: Central European, Romanian, Turkish, Maltese, Icelandic etc.\n\n"
    },
    {
      "time": "31 Mar 2006 — 8:44am",
      "content": "popchar is the best, I didn't know they had an OS X version and was lamenting its loss when I upgraded. Thanks, kesh.\n\n"
    }
  ]
}
