{
  "id": "18918",
  "title": "Disney fonts full circle",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Saw this on [www.boingboing.net](http://web.archive.org/web/20060526013127/http:/www.boingboing.net/). A hobbyist freeware font designer who copies Disney lettering has noticed that now [Disney is copying him!](http://web.archive.org/web/20060526013127/http:/flickr.com/photos/mrg/sets/49427/)\n\n",
  "author": "<a href=\"user/3254\" title=\"View user profile.\">eliason</a>",
  "time": "<br>",
  "uid": "3254",
  "comments": [
    {
      "time": " 30 March, 2006 - 9:17am",
      "content": "I think this shows that for many graphic designers working on projects for corporate clients (and maybe even some in-house designers) its far easier and quicker to use internet search engines to locate corporate font styles than it is to extract them from the client, or find them on the companies intranet or extranet.\n\nThis is especially true for what in England are known as “Mickey Mouse Fonts” ;-)\n\n"
    },
    {
      "time": " 30 March, 2006 - 9:24am",
      "content": "By the way, The ‘hobbyist freeware font designer’, aka Justin Callaghan, is a fellow Typophile. :)\n\nDav\n\n"
    },
    {
      "time": " 30 March, 2006 - 1:13pm",
      "content": "I have been a fan for some time. I like [SPACE AGE](http://web.archive.org/web/20060526013127/http:/www.fontplay.com/images/spaceage.jpg)\n\nHis [FLORIDA PROJECT](http://web.archive.org/web/20060526013127/http:/mickeyavenue.com/fonts/florp/) (Phase One) has the unicase x-height that allows stacking text with a different look (than using just caps, in case there is anyone who wants to make a ‘case’ out of technicalities around)\n\n"
    },
    {
      "time": " 30 March, 2006 - 2:44pm",
      "content": "I’ve done font work for Disney in the past (mostly cleaning up and compiling glyphs done by their artists) and from the sorts of things that I learned their lawyers tell them it’s not surprising they’re so cavalier about NOT SPENDING ANY MONEY on truly original type designs. Shame.\n\n\\> unicase x-height that allows stacking text\n\nYeah. Can’t do that with caps.\n\nhhp\n\n"
    },
    {
      "time": " 30 March, 2006 - 3:11pm",
      "content": "Disney called Microsoft one day and asked to license Comic Sans. So Disney licensed one of my fonts too. For payment I got a signed picture from Mickey Mouse in return. I showed it in a slide show at St. Bride’s a few years ago.\n\n"
    },
    {
      "time": " 30 March, 2006 - 8:00pm",
      "content": "\\> they’re so cavalier about NOT SPENDING ANY MONEY on truly original type designs. Shame.\n\nI agree. The lawyers probably advised against it when they found out it would possibly be budgeted using money from the legal fund.\n\n"
    }
  ]
}
