{
  "id": "18924",
  "title": "no parking in blackletter",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/files/Image057.jpg)\n\njust wanted to share this :)\n\ncheck the “e” in here!\n\n",
  "author": "<a href=\"user/11199\" title=\"View user profile.\">PL</a>",
  "time": "<br>",
  "uid": "11199",
  "comments": [
    {
      "time": " 30 March, 2006 - 2:48pm",
      "content": "Can you give some background on the image? Where is it from? Or maybe it would be more fun to guess?\n\n"
    },
    {
      "time": " 30 March, 2006 - 3:14pm",
      "content": "Alpine Village? It says “LAMC”, and sausage folk love their fraktur.\n\nhhp\n\n"
    },
    {
      "time": " 30 March, 2006 - 3:32pm",
      "content": "LA, CA ?  \nLos Angeles Municipal Code\n\n"
    },
    {
      "time": " 30 March, 2006 - 3:41pm",
      "content": "David!  \nyou got it but your from LA, so…  \nIt was posted on a private beach house right on venice beach.  \nAnd they must have got tired of people parking in their spot.  \nSo they went with blackletter, bible, etc.  \nIt seemed to be handlettered.\n\n"
    },
    {
      "time": " 30 March, 2006 - 3:42pm",
      "content": "Los Alamos Motorcycle Club\n\n"
    },
    {
      "time": " 30 March, 2006 - 4:58pm",
      "content": "heh.\n\n"
    },
    {
      "time": " 30 March, 2006 - 4:59pm",
      "content": "Alpine Village - a rotten Bavarian munchkin dream on the 110…  \nHave you been there lately? The last time I was there I walked into a sword shop and in the back was a counter selling Nazi memorabilia. I was with a friend who’s from San Diego but has lived in Berlin for the last 12 years and he was horrified. He told me he would be arrested if he showed up with any of that crap.\n\nI was also with my girlfriend who lived in Prenzlaurberg from 1995-2001. They both felt right at home.\n\nNow the Red Lion on Glendale is another story…  \nGreat Bier und Wurst…\n\npeace\n\n"
    },
    {
      "time": " 30 March, 2006 - 5:08pm",
      "content": "I’ve been to Alpine Village once, like 8 years ago, for Octoberfest.  \nYeah, it was pretty dumb. Dumb and dumber now I guess.\n\n\\> he would be arrested if he showed up with any of that crap.\n\nThe other extreme.\n\n\\> the Red Lion on Glendale is another story…\n\nI’ve only heard about it - should I go?  \nWith or without my kafiyyeh?\n\nhhp\n\n"
    },
    {
      "time": " 30 March, 2006 - 5:19pm",
      "content": "You’d even survive with your kafiyyeh - barely. Actually it’s mainly hipsters now so with your fashionable headgear you would fit right in. They have the best German food I know of anywhere near and they have a lot of German beer on tap. I like it there. It’s comfortable.\n\nThey also have really cheesy lounge musicians in the downstairs part at night if you’re into that sort of thing. I’m not.\n\nGlendale just south of where Silver Lake Blvd. intersects on the east side of the street…\n\npeace\n\n"
    }
  ]
}
