{
  "id": "18921",
  "title": "De kerning",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "I need a suggestion - and it may sound idiotic. What is the best kerning for a De pair? Because of the opposing curves it always feels too far apart when compared with the other letters (the entire word is Delta). I will be using a San-Serif which seems to compound the problem. Any suggestions fro a good sanserif typeface that will work? (Oddly enough I don’t like the overall feel of the font Delta). Again I know this is a slightly ignorant question, but I am having a little trouble trusting my instincts on this one.\n\n",
  "author": "<a href=\"user/2923\" title=\"View user profile.\">hughfire</a>",
  "time": "<br>",
  "uid": "2923",
  "comments": [
    {
      "time": " 30 March, 2006 - 10:02am",
      "content": "Got to be visual. Correct character combinations depend on the entire word, font and context.\n\nAs for suggesting fonts - further and better particulars required. Haven’t looked at Delta, but choosing a font by name is not really going to help you get anywhere. The audience doesn’t know or care what the font is called.\n\n"
    },
    {
      "time": " 30 March, 2006 - 10:39am",
      "content": "_De Kerning?_  \nWhat sort of slang is that?\n\n"
    },
    {
      "time": " 30 March, 2006 - 11:54am",
      "content": "He means the kerning between an uppercase \\_D\\_ and lower case \\_e\\_\n\n"
    },
    {
      "time": " 30 March, 2006 - 12:05pm",
      "content": "I thought the same exact thing. :^/\n\n"
    },
    {
      "time": " 30 March, 2006 - 3:47pm",
      "content": "De kerning - This will rest in the hall of type jokes.  \nSorry Hugh, its too funny.\n\n"
    },
    {
      "time": " 30 March, 2006 - 5:43pm",
      "content": "so i guess it depends on de stijl…\n\n"
    },
    {
      "time": " 1 April, 2006 - 11:19am",
      "content": "Huh? De Kooning had a twin brother who was a type designer?!\n\nOh, I know: de-kerning is what Emigre does to their fonts before shipping. ;-)\n\nhhp\n\n"
    },
    {
      "time": " 2 April, 2006 - 4:24am",
      "content": "If it has to be uppercase D lowercase e, something condensed (because the verticals are more likely to be straighter than rounder) with a large x-height (so e doesn’t tuck under the D) like  \n [http://www.myfonts.com/fonts/agfa/trade-gothic/](http://web.archive.org/web/20060525033715/http:/www.myfonts.com/fonts/agfa/trade-gothic/)\n\nTim\n\n"
    },
    {
      "time": " 8 April, 2006 - 10:10pm",
      "content": "Ha ha ha - very funny - good suggestion Tim. I may end up going with an all lowercase. I just wanted to know if there were any good suggestions for making those two competing arcs not fight so much visually. As far as choosing a font by its name - I realize that isn’t a methodology for choosing a typeface - just commenting on how the D-e pair looks ironically horrible - would think they would have given it a better name to show off the face.\n\n"
    }
  ]
}
