{
  "id": "18932",
  "title": "So much for the dominance of chirography....",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://www.eurekalert.org/pub\\_releases/2006-03/uocp-wal033006.php](http://web.archive.org/web/20080905060530/http:/www.eurekalert.org/pub_releases/2006-03/uocp-wal033006.php \"http://www.eurekalert.org/pub\\_releases/2006-03/uocp-wal033006.php\")\n\n [‹ Japanese pixel font recommendations](http://web.archive.org/web/20080905060530/http:/www.typophile.com/node/19243 \"Go to previous forum topic\") [Scottish broadside website ›](http://web.archive.org/web/20080905060530/http:/www.typophile.com/node/19231 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905060530/http://www.typophile.com/user/1262\" title=\"View user profile.\">John Hudson</a>",
  "time": "<br>",
  "uid": "1262",
  "comments": [
    {
      "time": " 30.Mar.2006 9.04pm",
      "content": "Fascinating... I’m looking forward to seeing that article. Of course, I imagine there’s probably a strong correlation between those shapes that are easiest to perceive and those that are easiest to form. I’m really curious how they went about collecting their data...\n\n—Jim K.\n\n"
    },
    {
      "time": " 31.Mar.2006 5.11pm",
      "content": "The paper is available on Prof. Changizi’s website.  \n [http://www.changizi.com/](http://web.archive.org/web/20080905060530/http:/www.changizi.com/ \"http://www.changizi.com/\")\n\nThey take an interesting tact and analyze letters as orientation invarient topologies. This means that there is no difference between L, v, and 7. They find that the letters in different orthographies tend to use the pattern of topologies. They go on to find that these same topologies correlate well with those seen in natural scenes, but do not correlate well with the number of hand movements needed to create the topology.\n\nFor this to be useful for type design, the work will need to be extended past topology to looking at geometric differences within each of their topologies. They do note this in the paper as a possible future direction.\n\nCheers, Kevin\n\n"
    },
    {
      "time": " 31.Mar.2006 11.27pm",
      "content": "_They take an interesting tact and analyze letters as orientation invarient topologies. This means that there is no difference between L, v, and 7._\n\nOr, say, between an A and an upsidedown A. I’m not sure whether that makes me or Hrant the orientation invarient topologist. :)\n\n"
    },
    {
      "time": " 1.Apr.2006 3.50pm",
      "content": "[_these same topologies correlate well with those seen in natural scenes_](http://web.archive.org/web/20080905060530/http:/www.artlebedev.com/posters/city/city-640x480.jpg)\n\n"
    },
    {
      "time": " 2.Apr.2006 2.39pm",
      "content": "Nick,  \nInstead of Russia, That photo looks like it could have been taken in Pittsburgh in the 60s.\n\nChrisL\n\n"
    },
    {
      "time": " 11.Apr.2006 1.01pm",
      "content": "“Learning to read must involve a pre-emption of part of the existing visual system and it’s conversion, by minimal modification, to process the shapes of letters and words.” [Stanislas Dehaene, Laurent Cohen, Mariano Sigman and Fabian Vinckier: “The neural code for written words: a proposal” (Trends in Cognitive Sciences, Vol 9 No 7, July 2005)\n\nSo the Changizi hypothesis is not far fetched.\n\nDehaene, et. al., add: “Indeed, in most expert readers, a localized region of the left occipito-temporal sulcus, just lateral to the fusiform gyrus, systematically takes on the function of identifying visual letter strings. The ’visual word form system’ is thought to play a pivotal role in informing other temporal, parietal and frontal areas of the identity of the letter string, for the purpose of both semantic access and phonological retrieval. Thus it must provide a compact ’neural code’ for visual words, a cell assembly unique to each word, yet invariant under changes in location, size, case\\* and font.”\n\nIn “Neuroimaging Studies of Reading Development and Reading Disability” Kenneth R. Pugh, et. al. (W. Einar Mencl, Annette R. Jenner, Jun Ren Lee, Leonard Katz, Stephen J. Frost, SSally E. Shaywita, Bennett A. Shaywitz), posit “a word-recognition system in which processing is fast because linguistic knowledge is encapsulated in highly efficient pattern-recognizing templates.” (Learning Disabilities Research & Practice, 16(4), 240-249.\n\nI’ve tried to argue for neural encoding of whole words at the ’pattern of features’ level. It seems to me that, in addition to direct encapsulation of ’linguistic knowledge’ in these ’templates’ or ’neural codes’, there are—yoked to these complexes—’chirographic scripts’, which form the basis of our knowledge of orthgraphic shape.\n\nIn other words: while letter topologies do not perhaps correlate well with the number of hand movements needed to create the topology, our sensory-motor familiarity with the concrete movements we make in writing senquences of letters underlies our abstract knowledge of orthgraphic codes (and how they are most effectively learned). When we get stuck in spelling we imagine writing the word.\n\n\\* debatable\n\n ![](http://web.archive.org/web/20080905060530im_/http:/www.typophile.com/files/%5D%5Bimg:)\n\n"
    },
    {
      "time": " 11.Apr.2006 1.11pm",
      "content": "\\>When we get stuck in spelling we imagine writing the word.\n\nIt is striking to a non-Chinese that when Chinese meet and give their names, and want to know the character—it gives a meaning, and there may be many for each sound—they draw it in the air with one finger against the palm of other hand. Then the person observing will instantly recognize the character, though it is invisible.\n\nI just tried it with roman characters and it works for me also.\n\n"
    },
    {
      "time": " 11.Apr.2006 1.37pm",
      "content": "Interesting! (I should have said ’whole-word chirographic scripts’)\n\n"
    },
    {
      "time": " 11.Apr.2006 3.42pm",
      "content": "\\> our sensory-motor familiarity with the concrete  \n\\> movements we make in writing senquences of letters ...\n\nJust one problem with that theory: we don’t write any more.\n\n\\> When we get stuck in spelling we imagine writing the word.\n\nYou don’t know that to be generally true. I can assure you that I for one don’t do that. I visualize the letterforms. Or type them out! This, even though I did write a lot as a child. And one can only hope that the kids of the future will avoid such pointless intermediate steps entirely:  \n [http://news.bbc.co.uk/2/hi/uk\\_news/education/3103421.stm](http://web.archive.org/web/20080905060530/http:/news.bbc.co.uk/2/hi/uk_news/education/3103421.stm \"http://news.bbc.co.uk/2/hi/uk\\_news/education/3103421.stm\")\n\nhhp\n\n"
    },
    {
      "time": " 11.Apr.2006 6.14pm",
      "content": "_we don’t write any more._\n\nIsn’t the idea that the initial process of learning the alphabet is hard-wired to the hand-movements of learning how to write it? So those early childhood hand-movements are an inextricable part of reading.\n\nIn fact, learning how to write provides a bridge between the organically-structured physical world and the symbolic logic of the mental world.\n\nIn that BBC web page you occasionally link to, the Norwegian experiment with children and keyboards, the educators posit an ideal educational writing sequence of:  \n1. “printing” letters by hand  \n2. keyboarding  \n3. writing cursive script.\n\nTwo quite different kinds of chirography there.\n\n"
    },
    {
      "time": " 11.Apr.2006 6.19pm",
      "content": "\\> the initial process of learning the alphabet is hard-wired  \n\\> to the hand-movements of learning how to write it?\n\nHard-wired?! If you have hands coming out of your eyeballs, sure.\n\nWe will be the laughingstock of the future with this chirography hogwash.\n\nhhp\n\n"
    },
    {
      "time": " 11.Apr.2006 7.49pm",
      "content": "\\>we don’t write any more.\\< I wouldn’t agree with this. I find I am writing more now than ever.  \nJust about everyone I mix with keep hand written journals and write & draw every day. I also use the key board every day, but I use a pen or pencil more. Handwriting is still very much alive in the digital age.\n\n"
    },
    {
      "time": " 11.Apr.2006 7.59pm",
      "content": "Hmmm...I did add a comment in the above reply, but it didn’t show and I could not edit it. A glitch in the software maybe? Please ignore this it is just a test.\n\n"
    },
    {
      "time": " 11.Apr.2006 8.17pm",
      "content": "Seems to be OK now(?). Sorry for the stuff up. If I could delete the above I would.\n\nI don’t agree that we don’t write any more. I think most of us are writing more now than ever before. Most of the people I mix with keep handwritten journals, writing & drawing every day.  \nI use the computer a lot, but I write and draw with pen & pencil more.\n\n"
    },
    {
      "time": " 12.Apr.2006 5.50am",
      "content": "If synaptic yoking to chirographic scripts means hands coming out of your eyeballs, than having the wiring in place for synaptic yoking to ’articulatory’ scripts means mouths coming out of your eyeballs too.\n\nArticulatory scripts are the basis of phonological knowledge. (Psychology has this wrong: psychology thinks of phonological knowledge as mediating the link from written text to articulatory practices. For me phonological coding is an important pedagogical contrivance, built on direct but learned links of meaningful whole-word patterns to full articulatory scripts.)\n\nJust because the wiring is in place, this doesn’t mean the scripts are explicitly brought to mind in each and every visual wordform resolutional event. For immersive reading it is important that they aren’t.\n\nI did not mean to say our perceptual encodings of words **are** chirographic scripts, just that the structures formed by the direct encapsulation of sense to our perceptual encodings **have ancilliary links** to other types of encodings (based in other areas of the brain). These ancilliaries sometimes come into play, even in immersive reading, however they aren’t constitutive of or the leading function of perceptual processing in immersive reading.\n\nI merely wanted to turn the tables on the title of this thread.\n\n ![](http://web.archive.org/web/20080905060530im_/http:/www.typophile.com/files/%5D%5Bimg:)\n\n"
    },
    {
      "time": " 12.Apr.2006 7.19am",
      "content": "\\> mouths coming out of your eyeballs too.\n\nWe [also] don’t vocalize during immersive reading.\n\nAlso: it’s important to distinguish between a natural and unavoidable part of linguistic communication, namely vocalization, versus a circumstantial and harmful crutch, namely making marks by hand. And when a person insists that these marks should be made with a specific instrument, namely the broadnib pen (held only in the right hand and written left-to-right mind you) then how somebody can think this is anything short of ludicrous is beyond me.\n\n\\> I merely wanted to turn the tables on the title of this thread.\n\nYes, I know.  \nAs long as Noordzij remains your svengali you will have such problems.\n\nhhp\n\n"
    },
    {
      "time": " 12.Apr.2006 8.11am",
      "content": "_Hard-wired?! If you have hands coming out of your eyeballs, sure._\n\nIt’s all connected. Muscle-memory is resident in the whole system, not just the muscles. Think of playing music from memory; you can’t just plunge in anywhere but must start at the begining.\n\nResearch has shown that there is some activity in the area of the brain responsible for certain physical acts, when someone is watching but not doing.\n\nYou don’t have to accept a simplistic version of “mouthing the words” or “air pen”, to be aware that formative acts from early childhood are deep roots.\n\nHaving said that, it is quite within the bounds of mental processing ability for the act of reading to involve some form of chirographic mapping and replay, activated upon word recognition, as a kind of “dictionary check”. The specific learning media (right hand broad-nibbed pen...) is immaterial, whatever was first used would get the replay. Even if spelling out every letter and mentally rewriting it isn’t called for, they are the foundation stones on which the whole structure is built, not crutches that can be thrown away.\n\n"
    },
    {
      "time": " 12.Apr.2006 8.17am",
      "content": "It’s all a self-validatin, cozy, romantic illusion.\n\nhhp\n\n"
    },
    {
      "time": " 12.Apr.2006 8.34am",
      "content": "A good description of literature.\n\n"
    },
    {
      "time": " 12.Apr.2006 9.25am",
      "content": "“We [also] don’t vocalize during immersive reading.”\n\nIsn’t that what this says:  \n_Just because the wiring is in place, this doesn’t mean the scripts are explicitly brought to mind in each and every visual wordform resolutional event. For immersive reading it is important that they aren’t._\n\n“And when a person insists...”\n\nI am not an advocate of chiro-slavery. I have often pointed out that I see value in the opportunities for feature manipulation opened up by post-chirographic technologies of letter-formation. The broad-pen is good not because it is wielded by the hand. It is good because the formal diversity it introduces into the grammer of forms in a word is greater than the fexible nibbed pen and the ballpoint pen or pencil and because of that introduces a readability advantage. The particularities of contrast and construction that the broad-nobbed pen introduces don’t have to be copied literally, but the level of formal diversity and distributional logic sets a standard or benchmark for future letterform manipulation.\n\nWhen it comes to the future of type, I am too old to still harbour oedipal instincts in relation to it’s ancestrial matrix.\n\n"
    },
    {
      "time": " 12.Apr.2006 9.31am",
      "content": "\\> The broad-pen ... is good because the formal diversity  \n\\> it introduces into the grammer of forms in a word is ...\n\nAh, but TWO broad-nib pens, joined together by a special armature  \nthat requires the left hand to manipulate is even more diverse!\n\n\\> the level of formal diversity and distributional logic sets a standard\n\nA standard of <cite>arbitrary</cite> limitation.\n\n\\> I am too old to ...\n\nBut I hope you are not too old to extract that nib tip from your heart.\n\nhhp\n\n"
    },
    {
      "time": " 13.Apr.2006 9.10am",
      "content": "“A standard of _arbitrary_ limitation.”\n\nA benchmark can be surpassed, new standards set. Intelligent exploration at the ’how (stem / bowl / crossbar / etc) roles are filled’ and how ’role-relationships are managed’ level yields insights into how. The history of type is a repository of such explorations. Some of the efforts of our/your heros are no doubt signposts. And there might be a lesson in others.\n\nI don’t study the para- & extra-chirographic explorations to the degree that I should and others like yourself do. But the difference between you and I is perhaps what the gradients of diversity at the optical-grammatical level in a font should be, or how far they can be stretched before cross-letter binding and the object-like integrity of the word necessary for effective visual wordform resolution are compromised.\n\nI see the formal diversity and distributional logic of broadpen generated forms as an inspiration, you see the dependance of the forms on manually managable routines and inescapable conterpuntality as a prison. Neither of us are idiots. The nib stays in my pen.\n\n ![](http://web.archive.org/web/20080905060530im_/http:/www.typophile.com/files/%5D%5Bimg:)\n\n ![](http://web.archive.org/web/20080905060530im_/http:/www.typophile.com/files/%5D%5Bimg:)\n\n ![](http://web.archive.org/web/20080905060530im_/http:/www.typophile.com/files/%5D%5Bimg:)\n\n ![](http://web.archive.org/web/20080905060530im_/http:/www.typophile.com/files/%5D%5Bimg:)\n\n"
    },
    {
      "time": " 13.Apr.2006 9.30am",
      "content": "\\> what the gradients of diversity at the optical-grammatical level  \n\\> in a font should be, or how far they can be stretched before  \n\\> cross-letter binding and the object-like integrity of the word  \n\\> for vision are compromised.\n\nIt is entirely too optimistic to believe that the confluence of arbitrary circumstances, such as right-handedness, the need to make a pen wide to get enough ink down, etc. have resulted in something optimal for reading. The metaphysicality required to put faith in such a thing borders on religion, and that’s anti-Design.\n\nhhp\n\n"
    },
    {
      "time": " 13.Apr.2006 9.44am",
      "content": "_entirely too optimistic_\n\nNot at all.  \nThe physical peculiarities of writing equipment, such as stroke contrast, opened up design space to be exploited — enabling a richer, more nuanced medium. European engineering.\n\n"
    },
    {
      "time": " 13.Apr.2006 9.55am",
      "content": "“anti Design” is also throwing out any value in a system or method out of hand. There is more to be gained by examining all variables and re- examing them in light of new contexts. To say anything devised with broadnibbed pen is straight out wrong is just as closed-minded as saying the only thing of value is derived from broad-nibbed pen structure. To phiisophically disallow a set of information and process of any kind just because it counters our own personal belief is the ultimate mono-religious approach and is more likely to foster a typographic holy war rather than a viable solution.\n\nChrisL\n\n"
    },
    {
      "time": " 13.Apr.2006 9.55am",
      "content": "Nick, just that little “richer” indicates you’re completely missing the point.\n\nhhp\n\n"
    },
    {
      "time": " 13.Apr.2006 10.00am",
      "content": "\\> out of hand\n\nWhich it is not. I have many times explained how chirography is anti-notan and  \nanti-optimal-readability. And Peter for one understands this logic I know. But still  \nnot enough to overcome his emotions. Maybe the next generation will manage.\n\n\\> To phiisophically disallow\n\nWhich I never do. In fact for the moment (and apparently for the forseeable  \n<cite>century</cite>, seeing how people stubbornly grasp onto a sinking ship because it’s  \npretty) I’m simply working on a general admission there’s even a problem.\n\nhhp\n\n"
    },
    {
      "time": " 13.Apr.2006 10.04am",
      "content": "_Just that little “richer” indicates you’re completely missing the point._\n\nWhat’s wrong with a rich, nuanced reading experience?  \nYou prefer a bog-standard, impoverished typography, that cannot be fine tuned?\n\n"
    },
    {
      "time": " 13.Apr.2006 10.07am",
      "content": "Hrant, I used the phrase ’sets a standard or benchmark,’ and I talked about a ’readability advantage’ over the ball point pen or pencil and the flexible nibbed pen. I deliberately didn’t use the word ’optimal,’ which implies ’best’. Then I said: “a benchmark can be surpassed,” and hinted at the importance of featural exploration, meaning featural exploration in the typographic domain. My ’extra-chirographic’ was meant in the sense of ’beyond,’ and was intended to include the efforts of Bloemsma.\n\nI see myself as putting forward a balanced and nuanced point of view, well aware of and accommodating many of the things you think we need to bear in mind. I am puzzled by your ’metaphysicality’ quip. Who is it directed at?\n\n ![](http://web.archive.org/web/20080905060530im_/http:/www.typophile.com/files/%5D%5Bimg:)\n\n"
    },
    {
      "time": " 13.Apr.2006 10.16am",
      "content": "\\> I talked about a ‘readability advantage’ over the  \n\\> ball point pen or pencil and the flexible nibbed pen.\n\nAh, but have you considered it against writing in the sand, with a coconut?\n\n\\> ‘optimal,’ which implies ‘best’.\n\nNo.\n\n—\n\nYou know what guys? Just keep encircling your continent in your  \nleaky dinghies. Me, my dhow and my astrolabe are outta here.\n\nhhp\n\n"
    },
    {
      "time": " 13.Apr.2006 10.17am",
      "content": "_It is entirely too optimistic to believe that the confluence of arbitrary circumstances, such as right-handedness, the need to make a pen wide to get enough ink down, etc. have resulted in something optimal for reading._\n\nBut if the broad nib (or broad brush) is the primary tool in the development of a writing system, i.e. is the tool used by the people who have developed the normative structures of our alphabet (Carolingian miniscule -\\> renaissance humanist script), then it isn’t unreasonable to believe that these people created the most readable writing system they could _using that tool._ Of course this isn’t to say that the Latin alphabet as written with a broadnib pen is _optimal_ for reading, but nor is the level of readability attained arbitrary: it is designed. So long as you cling to the structures of an organically developed writing system at all, then you have to consider the formative role of the primary tool. This is true of every organically developed writing system: if early European scribes had written with needles on palm leaves, our alphabet would look nothing like it does, but would still reflect the most readable forms people were able to produce with that tool.\n\nSometimes, I don’t think you are nearly radical enough, Hrant, only radical enough to be amusing in your moments of revolutionary fervour. Why are you clinging to this alphabet which was entirely a product of the broad nib and brush? Why do you cling to any writing system based on a writing tool. Why not banish the whole notion of writing systems, and insist only on _reading systems_. Surely there is an optimal set of abstract visual signs that we will read more quickly and more accurately than any system organically developed from handwritten forms. It is entirely too optimistic to believe that mere tinkering with type design for a writing system formed in the small crucible at the tip of the broad nib pen will result in something optimal for reading. Even structural alphabet reform is a dirty compromise with the nib. Only alphabet _replacement_, in which the old writing systems are replaced by a unique, scientifically engineered reading system based on increasing knowledge of human physiological and cognitive processes, will lead to something optimal for reading. And once it is optimal, there will only be a need for one such system, although perhaps with size-specific variations. We will be the laughingstock of the future with this type design hogwash.\n\n"
    },
    {
      "time": " 13.Apr.2006 10.23am",
      "content": "\\>I’m simply working on a general admission there’s even a problem.\n\nWho exactly says that type has to follow pen rules slavishly? Even Noordzij, whom you seem to regard as the Pope of the Church of Chirography in ’The Stroke’ creates a notion of a generalized pen, or moving front that allows for unlimited violations of the physical rules of an actual pen. And of course since Jenson and Griffo type designers have been knowingly violating the rules of the pen. I may be wrong, but it seems to me that you are attacking a straw man here. No church, no pope.\n\n"
    },
    {
      "time": " 13.Apr.2006 11.04am",
      "content": "_And Peter for one understands this logic I know. But still  \nnot enough to overcome his emotions._\n\nWhy is it whenever someone disagrees with you, it must be for emotional reasons? I didn’t detect any emotionalism in Peter’s, as usual, carefully thought out and considered comments. Maybe if you spent as much time reading them as he spends composing them, rather than rushing on to your next rhetorical rejoinder, you might actually engage with ideas other than your own. So far in this thread you have responded to reasoned argument with weak one-liners, prophecies about how we will be regarded by future generations, and metaphors about your astrolabe and your dhow. If you are busy and don’t have time to engage in the discussion, just say so.\n\nWhenever the discussion turns to the relationship of our writing system to the tools and manual activities that created its structural and formal properties, you start to engage with this fantasy opponent who is an intellectual retard and emotional basketcase, who feverishly clings to his pen out of romantic and delusional motivation. Who is this person? Is it me? Is it Peter? Is it Nick? Is it Noordzij? Is it everyone in the world who disagrees with you? I’ve never met this fantasy opponent of yours. He doesn’t exist except in your rhetoric. Which explains why you are reduced to one-liners and dismissive insults: the person you are attacking doesn’t exist, so there is nothing for you to engage with. Yet you persist in attacking this fantasy, rather than engaging with the actual people who are talking with you and their actual ideas.\n\nI happen to think that you are not a complete idiot, so stop acting like one.\n\n"
    },
    {
      "time": " 13.Apr.2006 11.09am",
      "content": "[Withdrawn]\n\n"
    },
    {
      "time": " 13.Apr.2006 11.22am",
      "content": "Hrant, I understand the logic of your argument from the concept of notan, but I have questions about it’s applicability as you present it.\n\nYour argument presumes notan in typographical contexts implies black / white balance or equivalence. Vision, however, operates according to a logic of saliency and cue-value, and some criterial components are white and others black. The cue values have to be well managed, and the saliencies proper, and doesn’t this imply local inequities in black / white management? So doesn’t this mitigate your claim of linked contours being anti-notan?\n\n"
    }
  ]
}
