{
  "id": "18931",
  "title": "Adobe CS3 is here",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Adobe CS3 is here + gift- Utopia Nova Pro.\n\nEnjoy it!\n\n",
  "author": "<a href=\"user/8867\" title=\"View user profile.\">david hamuel</a>",
  "time": "<br>",
  "uid": "8867",
  "comments": [
    {
      "time": " 30 March, 2006 - 8:02pm",
      "content": "April fools? (early)\n\n"
    },
    {
      "time": " 30 March, 2006 - 9:02pm",
      "content": "2 days is a tad too early.\n\n"
    },
    {
      "time": " 30 March, 2006 - 9:05pm",
      "content": "What was last years? Fontographer MX box cover if I remember correctly? Haha.\n\n"
    },
    {
      "time": " 30 March, 2006 - 10:03pm",
      "content": "Sorry this one is lame - where’s the fake box shot and press release?\n\nI’d give this 2 out of 10, sorry. :-(\n\nCS3 Q2 07…  \n [http://www.forbes.com/2006/03/23/adobe-chizen-earnings\\_cz\\_dal\\_0324adobe.html](http://web.archive.org/web/20060526013203/http:/www.forbes.com/2006/03/23/adobe-chizen-earnings_cz_dal_0324adobe.html)\n\n"
    },
    {
      "time": " 30 March, 2006 - 10:41pm",
      "content": "Good looking out Sii, I think most of us already knew this since they already stated that there would be no universal binary for Intel Macs until CS3. We’ve all been following this closely!\n\n"
    },
    {
      "time": " 31 March, 2006 - 2:31am",
      "content": "All the holes in this hoax have been mentioned above, but there is one more: Adobe wouldn’t name a revision “Nova”. That’s a Linotype term.\n\n"
    },
    {
      "time": " 31 March, 2006 - 7:40am",
      "content": "Tough crowd!\n\n"
    },
    {
      "time": " 31 March, 2006 - 7:45am",
      "content": "\\>Tough crowd!\n\nThere is a long, proud tradition of typographic hoaxes, many would point to the Island of Sans Serifa hoax, but perhaps the history can be traced back to Guttenberg himself hoaxing the look of hand written bibles.\n\n"
    },
    {
      "time": " 31 March, 2006 - 7:49am",
      "content": "_Guttenberg himself hoaxing the look of hand written bibles_\n\n?\n\nWasn’t Johnny-G-Good rather straightforward about the benefits and coolness of his new invention? If his letters didn’t look like handwritten ones, what would they have looked like instead?\n\n"
    },
    {
      "time": " 31 March, 2006 - 8:03am",
      "content": "Sorry, Dan I forgot to include the ‘;-)’\n\n\\>Wasn’t Johnny-G-Good rather straightforward about the benefits and coolness of his new invention?\n\nI don’t think so, it was in his economic interest to keep the technology secret thus prolonging the “how did he do it” nature of the hoax.\n\n"
    },
    {
      "time": " 31 March, 2006 - 8:09am",
      "content": "Well, I’ll bet he didn’t want people \\*exactly\\* to know how he did it, but he wanted them to know it was something new. The Church was very interesting in printing, because you could certify a master translation, and only print that. And Gutenberg must have been very interested in the Church. Whatta market!\n\nGutenberg’s acutal printing career only lasted about 10 or 15 years, I think (it depends on whether you think he invented printing earlier, while living in Strasbourg, or after he had already returned home to Mainz). Didn’t the colophon of one of his later books attribute its production to the magical art of printing, or something like that?\n\n"
    },
    {
      "time": " 31 March, 2006 - 9:11am",
      "content": "Makes sense. I’ll suggest to the folks at Reading that this should be on their next essay list…\n\n“JG was the first typographic hoaxer. Discuss.”\n\nThx, Si\n\n"
    },
    {
      "time": " 31 March, 2006 - 9:16am",
      "content": "…as long as I get to read the essays once they’re finished!\n\n"
    }
  ]
}
