{
  "id": "18935",
  "title": "zapf & hallmark",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Anyone have any information on the current status of Hallmark’s licenses to the work they commissioned from H. Zapf in the late 1960s? There are some very nice faces there that as far as I know have never been digitized.\n\n [‹ new Peter Bilak article](http://web.archive.org/web/20080821144400/http:/www.typophile.com/node/18947 \"Go to previous forum topic\") [Unknown ornament ›](http://web.archive.org/web/20080821144400/http:/www.typophile.com/node/18884 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821144400/http://www.typophile.com/user/1706\" title=\"View user profile.\">jlt</a>",
  "time": "<br>",
  "uid": "1706",
  "comments": [
    {
      "time": " 31.Mar.2006 8.31am",
      "content": "I’ve got a friend who knows somebody. ;^) I’ll ask. Will you share? I’d love to see.\n\n"
    },
    {
      "time": " 31.Mar.2006 8.36am",
      "content": "I’d be interested in knowing more and seeing the body of work as well.\n\n"
    },
    {
      "time": " 31.Mar.2006 10.41am",
      "content": "my understanding is that Hallmark still considers them to be what they were from the start: proprietary designs\n\n"
    },
    {
      "time": " 31.Mar.2006 11.28am",
      "content": "Zapf’s dozen or so fonts that he designed for Hallmark between 1967 and 1972 are still proprietary and are therefore not commercially available. Athough originally created for photocomp, a new and more flexible medium for type design than metal at the time, they have all been digitized by Hallmark’s in-house font development group.\n\nYou can see all of them though. Rick Cusick (now in charge of font development at Hallmark) has written a very nice article about Zapf’s Hallmark fonts that appears on pages 24-29 of the book/catalog for the Zapfest Exhibit, San Francisco, 2001. The article contains a two page spread with one line examples of all of the fonts that Zapf produced for Hallmark. I find one of the most intriguing ones to be Hallmark Textura as blackletter fonts are noticably absent from the reperotoire of this reknown German type designer. The book is entitled “Calligraphic Type Design in the Digital Age: An Exhibition in Honor of the Contributions of Hermann and Gudrun Zapf”, John Prestianni, editor, Gingko Press.\n\nHallmark did release Gudrun Zapf von Hesse’s font Renaissance upon the request of Linotype and the Zapfs to Linotype to sell a few years ago. They also released the film about Hermann Zapf that Hallmark produced in the late 60’s to Linotype and a quicktime version is included on some of the CD’s of Hermann’s fonts. However, there are no plans to make Hermann’s fonts available.\n\n(Thank you Miss Tiffany!)\n\n"
    }
  ]
}
