{
  "id": "18946",
  "title": "a gay typeface?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am currently working on the design of a photography book on gay parades.  \nAll photos are black and white and all photos are portraits of gay men (from the drag to the handsome boy and the big guy with piercing and moustache...).  \nThe cover should be mainly black and white and I am currently experimenting with different typefaces.  \nIt should not be to \"sombre\", too dramatic or to circensian, also not too grotesque...  \nI'm trying to find the perfect typeface, one that evokes celebration but it's sober at the same time...and one which reflects the context (gay, diversity, celebration...)but not in an obvious way...  \nAny suggestion? Please?  \nThanks!!\n\n",
  "author": "lore",
  "time": "31 Mar 2006 — 11:05am",
  "uid": "11958",
  "comments": [
    {
      "time": "31 Mar 2006 — 11:12am",
      "content": "Well, there are a number of typefaces designed by gay type designers. Would one of those work? You'll have to do your homework here, though. I don't want to go to deep into the personal lives of any typophiles.\n\n"
    },
    {
      "time": "31 Mar 2006 — 11:35am",
      "content": "I was working on some materials for a pride organization a while ago and ran into a similar dearth of options. While some faces might be historically appropriate (based on designer, philosophy, or geographics) they didn't communicate what was needed. The creative director eventually settled on something futuristic because it fit our mission statement of \"looking forward,\" though it wasn't to my personal liking, so I won't recommend it here.\n\nHave you considered the option of having something custom-lettered? It sounds like you have a clear enough idea of what you're looking for to give some good direction and, with a photography book, you're probably just using lettering for headings and titling, right?\n\n"
    },
    {
      "time": "31 Mar 2006 — 11:54am",
      "content": "First of all, don't try to be too literal - that's guaranteed to backfire.\n\nI don't know about gay, but there is a typeface that looks androgynous, and has been used to great effect in a book about a transvestite artist (\"John Kelly\", typeset by Pentagram-NY) - that font is FF Avance by Bloemsma, and it's not difficult to see why it works so well for that.\n\nhhp\n\n"
    },
    {
      "time": "31 Mar 2006 — 12:47pm",
      "content": "I rencently had a WeHo client tell me Storm's Tenebra was Gay. Maybe he wasn't being literal. My typographic gaydar could be on the blink.\n\n"
    },
    {
      "time": "31 Mar 2006 — 1:00pm",
      "content": "I don't think it is necessary or relevant. I would think that the photography will guide you and you shouldn't be too consumed with the sexual orientation of the people in the photos or the type designers.\n\n"
    },
    {
      "time": "31 Mar 2006 — 1:22pm",
      "content": "I agree with Tiffany, but you might be interested that Christian Schwartz says of his early typeface [Hairspray](http://web.archive.org/web/20150203064158/http:/www.orangeitalic.com/hairspray.shtml) that it's \"the gayest thing I've ever seen.\"\n\n"
    },
    {
      "time": "31 Mar 2006 — 2:17pm",
      "content": "It doesn't exist. All typefaces are straight.\n\n"
    },
    {
      "time": "31 Mar 2006 — 3:15pm",
      "content": "based on the portion of your \"brief\" that is actually descriptive, i think [Hercules](http://web.archive.org/web/20150203064158/http:/www.stormtype.com/hercules.html) would work well, but my inital reaction was actually [Farao](http://web.archive.org/web/20150203064158/http:/www.stormtype.com/farao.html).\n\n"
    },
    {
      "time": "31 Mar 2006 — 4:53pm",
      "content": "\\> my inital reaction was actually Farao.\n\nI own Fareo (one of several given to me by F.S. for pointing out some spacing problems in a font I bought) And I can see why you might think that. It certainly is cute.  \n: )\n\n"
    },
    {
      "time": "31 Mar 2006 — 7:12pm",
      "content": "I think Farao esp. Bold would be appropriate for its masculine with feminine twist, quite an option.\n\n--- pinky kinky winky ---\n\n"
    },
    {
      "time": "1 Apr 2006 — 12:00am",
      "content": "I couldn’t resist this topic, its so dear to my heart. What is a gay typeface? What would Judy Garland like? What is the Carneigie Hall, March 18 1958 of typefaces? Well I say I like Futura extra light really really big printed in a fifth colour or maybe I could use one of those lovely butch Grotesques by the Font Bureau or Hoefler & Frere-Jones. But then again I am rather taken by Mr Dardens new creations, just need a place to use them.\n\n"
    },
    {
      "time": "1 Apr 2006 — 9:52am",
      "content": "Now, now...that was quite an interesting little brainstorming. Thanx everyone. I am trying to avoid being literal here, I'm not looking for a typeface that looks \"gay\"...( whatever that means)but I thought it would be cool to \"honour the content\" as Bringhurst says (or was it someone else?)and use a typeface designed by a gay person or that has some kind of androgynous feel (or at least avoid a major gaffe by using some catholic, puritan typeface (I guess there are loads around). It's more what Mich431 wrote: something that is historically, philosophically appropriate.  \nI'll have a look at the suggestion you guys gave me and see if that works. Thanx a lot and keep posting.\n\n"
    },
    {
      "time": "1 Apr 2006 — 4:25pm",
      "content": "Has the Cristopher Lowell Decorating Show made it over there? You could see what font he uses. You don't get much gayer than that without an operation.\n\nBtw, this topic reminds me of a joke:\n\n\"Is that chair saved?\"\n\n\"No, but we're praying for it!\"\n\n"
    },
    {
      "time": "4 Apr 2006 — 11:03am",
      "content": "fontplayer: hmmmm...no I don't know the show but I know one thing: gay don't need operations, that would be a transexual, which is a different thing. They also don't need necessarily to be cute.\n\n"
    },
    {
      "time": "4 Apr 2006 — 11:25am",
      "content": "\\> fontplayer: hmmmm…no I don’t know the show but I know one thing: gay don’t need operations, that would be a transexual\n\nI thought that was just a progression, or acute case of the...uh...condition. This is great. You learn all kinds of things here.\n\n"
    },
    {
      "time": "4 Apr 2006 — 11:33am",
      "content": "You seriously thought that being gay is just a station stop on  \nthe way to being a transit passenger?! Sure, the two are related,  \nbut come on man. For one thing, the motivation to be a gay man  \nwould be a lot less if they were all sans.\n\nI have to wonder: how old are you, and when will  \nyour parents allow you to step foot outside The OC?\n\nhhp\n\n"
    },
    {
      "time": "4 Apr 2006 — 11:40am",
      "content": "\"All typefaces are straight.\"\n\nNo, some are Italic :-)\n\nChrisL\n\n"
    },
    {
      "time": "4 Apr 2006 — 11:47am",
      "content": "\\> I have to wonder: how old are you, and when will your parents allow you to step foot outside The OC?\n\nMuch older than you, I'm sure. But being from OC has limited my exposure to some things you young tykes from the big city take for granted.\n\n"
    },
    {
      "time": "4 Apr 2006 — 1:07pm",
      "content": "A gay typeface... hmm?\n\nITC American Typewriter could match, probably - vibrant, artificial but with a certain warmness. I'm waiting for the next suggestions.\n\nJust my 2cents, Thom\n\n"
    },
    {
      "time": "4 Apr 2006 — 1:18pm",
      "content": "Dennis, I think I was a bit too harsh, sorry.\n\nhhp\n\n"
    },
    {
      "time": "4 Apr 2006 — 1:21pm",
      "content": "\\> Dennis, I think I was a bit too harsh, sorry.\n\nHaving participated in an unmoderated Christian Usenet group once upon a time, Almost everything else seems tame by comparison.  \nNo apology needed.\n\n"
    },
    {
      "time": "4 Apr 2006 — 1:28pm",
      "content": "A gay typeface? I don`t know what it means at all.  \nMeet Mixa. it's a font on hybridation process between palatino and Symbol medium. If u are interested i'm working on.\n\n"
    },
    {
      "time": "4 Apr 2006 — 1:35pm",
      "content": "what about that m\n\n"
    },
    {
      "time": "4 Apr 2006 — 1:49pm",
      "content": "\\>what about that m\n\nIt's not straight enough :)\n\n"
    },
    {
      "time": "4 Apr 2006 — 9:06pm",
      "content": "How about this:  \n [http://www.dafont.com/will-grace.font](http://web.archive.org/web/20150203064158/http:/www.dafont.com/will-grace.font \"http://www.dafont.com/will-grace.font\")\n\n"
    },
    {
      "time": "4 Apr 2006 — 9:10pm",
      "content": "my two cents:\n\nI agree with dan\\_reynolds. I think that choosing a face that \"looks\" gay might be the worst thing you could do. I am a believer in connecting the text or content with the look of the type, but, I do believe that the gay community has far too many stereotypical labels as it is. You might accidentally irritate one that you were unaware of. In choosing a typeface that was designed by a gay designer, you could debut this somewhere cleverly, by citing the designer, and relating a little about his life as a \"gay\" typographer. I suppose that many people would not find this, or they would not care, but I think this subtler approach at connecting content with type is far better then choosing something that \"looks\" gay.\n\n"
    },
    {
      "time": "8 Apr 2006 — 11:15am",
      "content": "Maybe what is confusing some people is the title of the forum. No: I am NOT looking for a font that \"looks gay\" but for a typeface that can contribute to the spirit of the project, which is to emphasise DIVERSITY and \"OTHERNESS\" (That's for you fontplayer!). I appreciate the input, William Berkson, but fonts like \"hairspray\" for example, is not what I had in mind, I'm afraid. That would be a huge stereotype.  \nWhat I could do is to play with 2 different fonts, like using a classic one and then insert something completely different to subvert it a little, like insert something hand-made to give it a human touch...dunno...would that give the idea?\n\n"
    },
    {
      "time": "8 Apr 2006 — 11:17am",
      "content": "Mixa??? Sounds good, I like the M but can we see more? Cheers.\n\n"
    },
    {
      "time": "10 Apr 2006 — 3:16pm",
      "content": "Having done a bit of work with gay publications, I'll say that it matters not. What is more important is the relevence to the project. BUT...\n\nIf you were to force me to answer (c'mon, make me!)... I'd say for gender ambiguity/shifting/borrowing, I've always liked Bodoni (or anything closely related) because of the contrast in line, the Masculine/Feminine, the sort of posed-ness of it.\n\nIf you're addressing both lesbians and gays, I really like Rockwell because it is playful and hits both crowds well.  \n [Kings and Queens](http://web.archive.org/web/20150203064158/http:/www.amazon.com/gp/product/1932360247/sr=8-1/qid=1144707093/ref=sr_1_1/104-6563224-0867125?%5Fencoding=UTF8)\n\nIt may work really well for a parade book, too.\n\n"
    },
    {
      "time": "10 Apr 2006 — 3:20pm",
      "content": "_I’ve always liked Bodoni (or anything closely related) because of the contrast in line, the Masculine/Feminine, the sort of posed-ness of it._\n\nyes, exactly. that's why i suggested Farao--delicate yet strong.\n\n"
    },
    {
      "time": "15 Apr 2006 — 4:51pm",
      "content": "Rockwell? Really? I Thought it was one of these typefaces reminiscent of American Highschool/collegea bit like Princeton? Or am I totally out of my mind? Isn't it why they used it for the Kings and Queens' book in the first place...?\n\n ![](http://web.archive.org/web/20150203064158im_/http:/typophile.com/files/Rockwell.gif)\n\n(thanx for the link)...dunno...a bit too geometric, maybe. In fact, farao does have this american-highschool-feel too, there's a version of farao that really looks like princeton. Coincidence?\n\n ![](http://web.archive.org/web/20150203064158im_/http:/typophile.com/files/farao%20college.png)\n\n(I like it though...)But Bodoni, you can't go wrong with it, can you?\n\nI am getting quite attached to this Coolvetica by Ray Larabie...for some reason, it's kind of simple but it's got a little twist, which is probably why I liked it.\n\n ![](http://web.archive.org/web/20150203064158im_/http:/typophile.com/files/coolvetica.gif)\n\nAny opinion about that one? (forget about the pinky flowery thing...it's not because of this that I think it might fit...)  \nThanx!\n\n"
    },
    {
      "time": "15 Apr 2006 — 5:24pm",
      "content": "i think coolvetica is very cliche and personally would be turned off by it. i'd rather have something more subtly sexy than something campy... unless you're shooting for campy.\n\n"
    },
    {
      "time": "16 Apr 2006 — 12:34pm",
      "content": "Anyone know what a red asterisk means mext to a subject? I had one on this topic.\n\n"
    },
    {
      "time": "16 Apr 2006 — 2:22pm",
      "content": "Point taken Paul...  \nI have no idea why that asterisk on the topic, I just know that I am deliriously happy with the input received from all of you. This book is going to be big...(for my standards!)so it's important to get the opinion from people from different (cultural) backgrounds on this subject. Cheers!\n\n"
    },
    {
      "time": "16 Apr 2006 — 4:41pm",
      "content": "I thought the red asterisk means a thread that hasn't been visited at all yet.\n\nhhp\n\n"
    },
    {
      "time": "16 Apr 2006 — 5:28pm",
      "content": "This one was almost used up when I saw it.\n\n"
    },
    {
      "time": "16 Apr 2006 — 6:16pm",
      "content": "I mean visited by a given user.\n\nhhp\n\n"
    },
    {
      "time": "16 Apr 2006 — 6:57pm",
      "content": "Well, if we could figure out who the slacker is, the problem would be solved.  \n: )\n\n"
    },
    {
      "time": "16 Apr 2006 — 7:57pm",
      "content": "Perhaps this is rather obvious, but Porchez' Anisette might do the job.  \nYou can play around with its combination of butch and femme alternates, tuning to the text, to strike the right balance.\n\n"
    },
    {
      "time": "16 Apr 2006 — 9:09pm",
      "content": "I feel like I am selling secrets, but if the gays are trying to tell us it is a normal thing to be gay, then wouldn't a normal font be the perfect thing to inculcate the masses? This would simplify things, as most fonts haven't come out of the closet.  \n: )\n\n"
    },
    {
      "time": "16 Apr 2006 — 9:27pm",
      "content": "Except there are no normal fonts.  \nWhich is great because neither are there normal people.\n\nhhp\n\n"
    },
    {
      "time": "17 Apr 2006 — 4:56am",
      "content": "Personally, I think deciding on the selection of a typeface based on the sexual oriantation of the type designer, graphic designer or audience is, at best, foolish. :)\n\n"
    },
    {
      "time": "17 Apr 2006 — 5:54am",
      "content": "Pick a type that works with the photos in the book. The photos are the subject matter. I remember the James Bladwin Richard Avedon book of the 60s as a success full approach to the interplay of few wordswith very powerful images. The type should not attempt to compete with the images. Perhaps just something simple that is not too noisy.\n\nChrisL\n\n"
    },
    {
      "time": "17 Apr 2006 — 8:16am",
      "content": "For some reason I'm seeing something Hairline, like Helvetica Ultra Light, kind of large. I like the Stymie custom font in the NY Times Q magazine which is on fashion and design, which seems to be a revival of L&C Stymie Hairline (not unfortunately available to us mortals).\n\nIt's not only the font but how you use it, obviously.\n\n"
    },
    {
      "time": "18 Apr 2006 — 7:35am",
      "content": "No, I don't think it's a good idea looking for a font designed by a gay person either, although you'll never know...it could be a way to pay an hommage... But it's about CELEBRATION OF DIVERSITY really. I like the idea of simplicity and avoid competing with the images but since we are talking about a BOOK COVER I thought I might as well try something unusual just to keep up with the spirit.  \nHey Dennis, you are really having difficulties coming to terms with the concept of gay, uh? :)  \nand yes: gay means homosexual, which can be man AND woman...\n\n"
    },
    {
      "time": "18 Apr 2006 — 7:38am",
      "content": "Anisette is cool....\n\n ![](http://web.archive.org/web/20150203064158im_/http:/typophile.com/files/anisette.gif)\n\n"
    },
    {
      "time": "18 Apr 2006 — 7:39am",
      "content": "the ultra light ones...gorgeous.\n\n"
    },
    {
      "time": "18 Apr 2006 — 7:48am",
      "content": "I like the idea of thin, elegant and sophisticated.\n\nPerhaps \"new\", \"forward thinking\", or simply \"open\", as opposed to \"old\" and \"closed\" or \"traditional.\" Maybe that's the key. Don't ask what it should be... ask what it shouldn't be.\n\nI like the idea too, of ultra thin Helvetica, or something along those lines. A cover? Lately I've been a huge fan of Bernhard Fashion - in an all caps setting though. Take something from Avant Garde ligatures too maybe? Voila.\n\nOf course, this is all sooooo subjective... Especially here, with \"The Nerds.\" (I mean that in the best way.)\n\n-b\n\n"
    },
    {
      "time": "18 Apr 2006 — 8:00am",
      "content": "\\> Hey Dennis, you are really having difficulties coming to terms with the concept of gay, uh? :)\n\nTo me it's like someone saying the sky is (a fabulous) lime-green. Maybe if enough people insist it is lime-green, some people will be swayed, but I am pretty sure I wouldn't be one of them.\n\nIf that was the only strange thing they tried to foist upon me, then as long as we don't talk about the sky, I could have a nice conversation. (because I have found that the lime-green sky people can be very nice, otherwise)\n\n"
    },
    {
      "time": "18 Apr 2006 — 8:40am",
      "content": "I dunno Dennis, you do seem to have gay issues - I seem to recall a thread about Brokeback Mountain recently in which you compared it to font piracy... methinks thou doth protest too much.\n\n"
    }
  ]
}
