{
  "id": "18954",
  "title": "Understated Typographers?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Who are the typographers responsible for helping to evolve the art of typography?\n\nMaybe I'm wrong, but it's my impression that things havent changed alot in type design for a long time. Can anyone point me towards typographers who have really changed type (Post computer age)?\n\n",
  "author": "<a href=\"/web/20100328140107/http://typophile.com/user/9169\" title=\"View user profile.\">wysong</a>",
  "time": "<br>",
  "uid": "9169",
  "comments": [
    {
      "time": "",
      "content": "First off, I find your wording confusing, unless I'm grossly incorrect, typographers and type designers are not the same thing.\n\nI disagree, I think many exciting things are happening in type design [NOW](http://web.archive.org/web/20100328140107/http:/typographi.com/001045.php). :^)\n\n"
    },
    {
      "time": "",
      "content": "Did you mean to say a typographer can't be a type designer? Given the history of graphic design, I think you might be grossly incorrectly.\n\n"
    },
    {
      "time": "",
      "content": "No, I said I think you need to make the distinction between typography and type design as you’ve appeared to use them in the same context here. Are you asking us a question about [type design](http://web.archive.org/web/20100328140107/http:/typophile.com/wiki/type%2520design) or [typography](http://web.archive.org/web/20100328140107/http:/typophile.com/wiki/typography)? :^)\n\n\\> it’s my impression that things havent changed alot in **type design** for a long time. Can anyone point me towards **typographers** who have really changed type\n\nFrom typowiki, [typographer](http://web.archive.org/web/20100328140107/http:/typophile.com/wiki/typographer) and [type designer](http://web.archive.org/web/20100328140107/http:/typophile.com/wiki/type%2520designer).\n\n"
    },
    {
      "time": "",
      "content": "Geoff,\n\nWithout being too ridged and literal with the definitions you've referenced, maybe you can help me. If you had felt inspired to make a useful response to my first posting, you could have clarified the difference of type designer and typographer for me (granted, you did link me). Then, it would have been very simple for you to talk about both a typographer, and a type designer, all the while sharing some names and information. I could then use that information for some kind of direction other than arguing with strangers.\n\nI'm bothered by the fact that you're saying they're so different. Do you know for a fact that no type designers have been typographers? If so, please show me proof.\n\nI'm posting here to learn, not to impress people with attitude.\n\n"
    },
    {
      "time": "",
      "content": "Martin,\n\nyour question regarding influential contemporary typographers intrigues me. It is completely understandable that many people, laymen and even design professionals see little distinction between _typographers_ and _type designers_ nowadays.\n\nUp until and through the formative years of \"Desktop Publishing\" being a _typographer_ was more than just a loose term... it was an actual profession, a real job with specific responsibilities related to the selection, specification, proofing, editing, refinement of typographic matter and took place from the initial design phase of printed material through the final proofing of printing.\n\nPrior to the demise of typesetting suppliers (shops that would set type as a business), typographers would work in such professions helping to prepare, proof and QC (quality control) typesetting before it was delivered to the client. Many typographers and type directors would also work at design studios and ad agencies, book publishers, magazine and newspaper publishers, and for printers that owned their own typesetting equipment.\n\nIn many cases, typographers and type directors would critically examine and adjust ink flow and plate/blanket pressure during press proofing before signing-off on print runs.\n\nSo in essence, a typographer was responsible for the production and aesthetic control on the _USE_ of type and quality of printed reproduction.\n\nThat was one of several chief responsibilities while I worked for Agfa's Type Division during the eighties (I also headed the Type Design department for several years but had never actually designed my own typeface). I had to oversee all phases of preparation and reproduction of all printed material coming out of the division, and since we were a major developer of typefaces as well as a major distributor of licensed type designs, that meant that if it didn't reflect high quality, no one would buy the fonts.\n\nAs you can see, being a typographer has little association with the actual _designing_ of typefaces, though many typographers are type designers and vice versa. Oddly enough, a good typographer could make a lousy type designer as with the other way around. Think of it as a good composer would can play an instrument but only fairly compared to a great musician would can't write music for beans.\n\nNow, back to your question -- what is your chief interest?  \n\\> In those who impact and influence the look of type or those who influence the way we use it? Maybe a little of both?\n\n"
    },
    {
      "time": "",
      "content": "Martin, the first bezier tool for the Mac was Fontographer in 1985 (2 years prior to Illustrator).  \nBy 1995, the digital workflow had become the norm for the graphics industry.  \nThose ten years were the heyday of radical change in graphic design, and typography and type design were leading (vectors came first). One word: Raygun. (Carson: typographer)  \n\"Graphis Digital Fonts\" (1996) will give you an inkling of the crazy type design that was going on. Also check out the Emigre catalog with font design dates and note that Ms Licko's \"Mrs Eaves\" marks the end of the era, and type design started to get boring, technical, and marginal again. (Licko: type designer)\n\n"
    },
    {
      "time": "",
      "content": "\\> I could then use that information for some kind of direction other than arguing with strangers.\n\nMartin, it wasn't my intention to argue with you! I was unsure of the question you were asking, forgive me for failing to explain the distinction initially. Either way, I wouldn’t have explained in the lucid manner Norbert and Nick have above. :^)\n\n"
    },
    {
      "time": "",
      "content": "...and in recent boring type design, Evert Bloemsma found big new things to do (horizontal stress, one-way serifs, divergent axes) and Martin Majoor smaller things (arguably, fusing Griffo and Fournier in his serifs, and Gill and Meier in his sans). Even in type revival, Frantisek Storm's Jannon seems a new high point - rebuilt from scratch according to the subtle and unusual rule-set he discovered in the originals.\n\n"
    },
    {
      "time": "",
      "content": "No prob. Geoff :)\n\n"
    },
    {
      "time": "",
      "content": "Norbert, Chri, Nick...Excellent!\n\n"
    },
    {
      "time": "",
      "content": "Re: To your question...  \nNow, back to your question — what is your chief interest?  \n\\> In those who impact and influence the look of type or those who influence the way we use it? Maybe a little of both?\n\n-----------------\n\nOk, That's hard to answer. I thought i'd pose this question and see what responses I get. I'd like to consider this discussion to be a process. But I guess what I'm looking for are type designers who have influenced design through the aesthetics of the type.\n\nI.E. Futura or Akzidenz-Grotesk...They have certainly influenced the American visual language. A great example is The Royal Tennenbaums...The average viewer may not know (why) they respond to Futura being typeset with a 50's aesthetic, but they DO sense enough to find it humorous.\n\nBut maybe what i'm looking for is something obvious and at play around us currently. Maybe because of ease of use or cost or WHATEVER.\n\nDo you guys think the use of fonts that look digital are bogus, or do they have an appropriate place?\n\nWhat is the typographic visual language evolving into now? Will we see more digital age vernacular or a rebellion against it?\n\nI've never designed type, but I'm a graphic designer so type is absolutely important to me. I tend to value type for its form and beauty over the technical aspects....\n\n"
    },
    {
      "time": "",
      "content": "_But I guess what I’m looking for are type designers who have influenced design through the aesthetics of the type._  \nI suggest Neville Brody fits that bill with The Face and Arena magazines (among others).  \n [http://www.researchstudios.com/home/006-neville-brody/NEVILLE\\_home.php#](http://web.archive.org/web/20100328140107/http:/www.researchstudios.com/home/006-neville-brody/NEVILLE_home.php# \"http://www.researchstudios.com/home/006-neville-brody/NEVILLE\\_home.php#\")\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "\\> _What is the typographic visual language evolving into now? Will we see more digital age vernacular or a rebellion against it?_\n\nHmmmm... valid questions, but in a way do our answers or responses matter?\n\nSince we are now virtually connected with anyone and everyone globally at this time, and since anyone who can access the web can potentially \"publish\" literature or post images, and because trained graphic designers and typographers represents a small fraction of 1% of that population, IMHO the key influences and influencers of visual language may be \"home-grown\" grassroots non-professional uses of type.\n\nDuring the age of Pre-Desktop Publishing, printed visual matter, motion/film/animation/video, signage, architectural graphics and wayfinding systems were generally designed, produced and distributed/displayed by \"professionals\". Access to the equipment and cost of development kept most laypeople away from venturing into graphic design and publishing. In other words, the world of visual material was designed and produced by a small population.\n\nI am both deeply interested and concerned about our visual future, yet at the same time I find the time exciting and ripe for change be it for better or worse, evolving or regressing, but more than likely a time of new directions and expressions.\n\nThe affects of globally connectivity can often (and already has) lead to producing highly regional communities and micro-cultures.\n\nTake beer for instance (Mmmmm!). Though we are living with major beverage conglomerates who can produce and ship almost anywhere on earth, the rise of microbreweries and the diversity and quality of beverage is heartening. I think it is part of our human needs to NOT have everything immediately accessible and to enjoy what it takes some effort to get to, experience or attain.\n\nIn short, what I am sensing is that some incredibly exciting or innovative ventures using typography or designing letterform/glyph systems will happen (or are already) in the smallest of communities (geographic or culturally). The rest of the world will keep seeing re-hashed re-fried visuals. _Would you like to add a side of serifs to your order? Or Super-size your regular?_ :-)\n\n"
    },
    {
      "time": "",
      "content": "Where a type designer is also art director, or works closely with an art director, it's difficult to say which is the chicken or the egg -- the type design or the art direction.\n\nThat would rule out Brody and Lubalin (type designers/art directors whose types advanced their notions of what typography could be) and also Berlow and Black, or Licko and Vanderlans (type designer + art director, where the art director immediately presented a certain way of using the new types). But the Emigre fonts could still be seen as influencing Carson.\n\nFrutiger's \"Univers\" face, because of its systematized family, might the bill, in that it enabled a complex, single-face kind of typography to emerge in the 1960s (ironically, whether or not Univers was the face used). But perhaps this was a direction already presaged by the proliferation of Helvetica styles, and its use by the Swiss school.\n\nUnivers, as pictured in the famous style chart, defined an aspect of design theory, similar in function to an axiom or an equation. Similarly, Dead History defines post-structuralism, and Beowolf defines random computer generative art. It seems that type designs can be intellectual touchstones for the way one thinks about design, independent of their actual usage.\n\n"
    },
    {
      "time": "",
      "content": "\"Who are the typographers responsible for helping to evolve the art of typography?\"\n\n\"...my impression that things havent changed alot in type design for a long time....\"\n\nConfusion between typographer (one who composes type), typography (which is type when composed, e.g.), and type designer (who designs type), is common. Nearly all type designers are typographers, by requirement, at least in the testing of fonts, which require composition to be worth calling a font. Many type designers are also typographers, composing things with other people's fonts too. Typographers have become type designers, but most do not.\n\nThe technology of type design has changed several times in the last 75 years, and quite dramatically in the last 15. The art, has changed profoundly as type design tools and font formats associated with these technologies have opened a way to whomever has the will. The whole history of the craft that survives in physical form, is becoming available in digital form, and the waves of new designers, are creating new forms every day.\n\nThe only \"things haven't changed a lot\" in my opinion, are the letters, but even there, more need to made now than ever.\n\n"
    },
    {
      "time": "",
      "content": "Hi George!\n\nSounds interesting your comment on this „Jannon“. Where did you see it?  \nI like to see it, too.\n\nFor your discussion above when it comes to news in typedesign its in part true that its is not really much going on in my eyes. I`d like to see more of the work in the type catalogues like Raph, Hrant and other people here seem to do at that moment. The type catalogues by FontShop and so on for me are a bit depressing. It is all so liveless, rounded sharp at the edges, litte charming. Don’t if I explain me right. It is true that we are missing brakethroughs, no? Mrs Eaves was quite good for example but only the italic to my eyes. For me many type designs lack charm, some kind of personal treatment. That will hold on for more than 5 months. New classics if you want. But I am expressing only some kind of personal impression, un non so che? like the Italians say. ;-)  \nMaybe its digital age that ruins everything. Too fast too easy exchange everything.  \nDo we need some personality like Morris again (for Gods sake not his characters!;-)?\n\nStefan\n\n"
    },
    {
      "time": "",
      "content": "Through actual action, there has only been one: Bloemsma.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "The typographer of old is no more. Desktop publishing killed off that skilled profession. Typography still reigns because it deals with the use and arrangement of matters typographical and design. Hermann Zapf was skilled in both typography and type design.  \nThe German schools taught the importance of functional type design as part of the courses in typography. Many of the lessons were done in hand drawn layouts that gave a feel for a type design and in this process new type designs were evolved.  \nI think I'll have another beer!\n\n"
    }
  ]
}
