{
  "id": "18965",
  "title": "Can I see your Nonesuch Plantin please?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Tracy’s _Letters of credit_, last page, brings up Francis Meynell’s **Nonesuch Plantin** typeface; a short and superficial research shows it was a proprietary font for the Nonesuch press. The only book that seems to sport this exclusive little font seems to be _The History of Herodotus of Halicarnassus_ from 1935 that fetches three-digit prices with book feti — erm, collectors.\n\nDoes anyone happen to have this book or any other that might use Nonesuch Plantin or a reproduction of some sort? A photo of a specimen or a xerox of a page of that book? I am too curious in which way it differs from the good ole Monotype Plantin 110.\n\nAnyone?\n\nThanks  \nKai\n\n",
  "author": "<a href=\"user/11124\" title=\"View user profile.\">kaibernau</a>",
  "time": "<br>",
  "uid": "11124",
  "comments": [
    {
      "time": " 1 April, 2006 - 6:49pm",
      "content": "I think it just had lengthened extenders.\n\n"
    },
    {
      "time": " 1 April, 2006 - 9:24pm",
      "content": "Kai, the Clark Library over here has that book\\*. But: it’s closed until October; you can’t check anything out; and they don’t allow scans… But you could probably pull off some digital photography. Plannig a SoCal trip? :-)\n\n\\* BTW, UCLA has that title published in 1958 and 1962; and interestingly enough the translator was Harry Carter! Dunno if those are any use to you.\n\nBTW, didn’t Monotype end up making a long-extender Plantin (too)?  \nI know I’ve seen it somewhere. Unless it was in Tracy… :-/\n\nhhp\n\n"
    },
    {
      "time": " 2 April, 2006 - 12:13pm",
      "content": "Thanks George and Hrant.\n\nNo, unfortunately I can’t make a trip to SC anytime soon, but thanks for what I must interpret as an invitation ;-)\n\nI guess it is not so terribly important after all, especially if it was just a normal Plantin long-ex.\n\nT,  \nK.\n\n"
    },
    {
      "time": " 2 April, 2006 - 12:21pm",
      "content": "\\> what I must interpret as an invitation\n\nSure. Just bring a sleeping bag.  \nFor the Clark I mean - they have so  \nmany typographic goodies, it’s scary.\n\nActually I have a small stack of printouts of  \nthings I need to look at at the Clark, and I’ll  \nadd this to it; when I make another trip there  \nI’ll try to check out how “special” this Plantin is.\n\nhhp\n\n"
    },
    {
      "time": " 2 April, 2006 - 12:39pm",
      "content": "I just checked, and Monotype did indeed -eventually- have  \na long-extender version of Plantin. I found a sample (but  \nnot a very good one) in Harold Berliner’s compilation of  \nclassic Monotype text faces, but I’m sure it’s possible to  \nfind a much better sample without much difficulty.\n\nAnyway, if it matters/helps, the “long” Plantin  \nseems to have its extenders about 50% longer/deeper.\n\nhhp\n\n"
    }
  ]
}
