{
  "id": "18962",
  "title": "InDesign Text Box Annoyance...",
  "forum": "Build",
  "tags": [

  ],
  "content": "So I'm doing my first ever project with InDesign and there's one thing that is bugging me. When I'm active in a text box/frame, whatever you call it, and I input my copy I can't seem to find a way to exit 'Text entry' mode. ESC, Enter, Return...none of those work. I have to go over to the toolbar and manually click on a different tool. I'd much rather just hit a button and go about my business. Does this make sense? I'm sure there has to be a way to do this.\n\n",
  "author": "<a href=\"/web/20111214115451/http://typophile.com/user/8451\" title=\"View user profile.\">dave bailey</a>",
  "time": "<br>",
  "uid": "8451",
  "comments": [
    {
      "time": "",
      "content": "[InDesign CS shortcuts list](http://web.archive.org/web/20111214115451/http:/www.yearbooks.biz/nav1024.cfm?cat=5&subcat=26&subsub=3&method=display&id=437)  \nHope it helps.\n\n"
    },
    {
      "time": "",
      "content": "It bugged me too  \nDeselect All = Command+Shift+A\n\n"
    },
    {
      "time": "",
      "content": "I have a set of shortcuts, am I just overlooking the command to 'verify' my added copy? Basically what I'm saying is that the normal toolbar shortcuts like 'V' or 'A' for selection tools doesn't work when I have the text tool selected 'T' It's rather hard to explain such a simple concept.\n\n"
    },
    {
      "time": "",
      "content": "Click or Command+Click outside the text box first. Then you can press 'V', 'A' or whatever you want.\n\n"
    },
    {
      "time": "",
      "content": "Just an observation about this thread, and some others in this forum, david specifically noted:  \n\"I’d much rather just hit a button and go about my business\".\n\nSo telling him to click away first, and giving him a list of shortcuts which are plainly useless, is NOT going to help him. This is the exact thing he DOESN'T WANT TO DO.\n\ndavid, Manlio's idea works well: Command/CTRL + Shift + A.\n\n"
    },
    {
      "time": "",
      "content": "Well, aren't we all happy to have Nathan around? Dear fellow typophiles please give a big round of applause to this bright gentleman.\n\n"
    },
    {
      "time": "",
      "content": "Thanks Manilo and Miguel!\n\nNathan: I hesitated on saying something like that because I knew it'd eventually come around. Beggars often can't be choosers, right? Alas, it did. Problem solved. It's often hard to explain the simplest things on the internet.\n\n"
    },
    {
      "time": "",
      "content": "David, I've had that very annoyance. What I did was edit my keyboard shortcuts so that the \"esc\" key now takes me out of text mode. If you want to do that, go to EDIT \\> KEYBOARD SHORTCUTS.\n\n"
    },
    {
      "time": "",
      "content": "Hmm never thought about that. It's not assigned to do anything else like cancel accidental input, like in Quark? (If my memory serves me right as of this moment...rather tired) What command is it called to 'verify input'?\n\n"
    },
    {
      "time": "",
      "content": "I use custom quick keys in Ilustrator, InDesign, and Photoshop. I couldn't live without this feature.\n\n"
    },
    {
      "time": "",
      "content": "<cite>I use custom quick keys in Ilustrator, InDesign, and Photoshop. I couldn’t live without this feature.</cite>\n\nCare to share your setup? Or is that top secret? :-D\n\n"
    },
    {
      "time": "",
      "content": "I don't know if anyone would find my keys useful. I can share and then you can modify. :^) I think that is the beauty of being able to customize, it fits what you do most and what you use most.\n\n"
    },
    {
      "time": "",
      "content": "I figured as much...I'm working on my second project in InD so I'm still trying to wrap my head around the program. Any general tips you wish you knew when you started using it? Other than Keyboard Shortcuts..I found a PDF of those.\n\n"
    },
    {
      "time": "",
      "content": "The more time you spend in there, the easier it'll get.\n\nA few random tips/shortcuts which you may already know;\n\n\\* If you're fussy like me, set your ideal workspace (onscreen layout of tools and panels) and save it under the windows tab so when things get a bit messy, you can load your saved workspace. I wish I'd learned this earlier.  \n\\* Hit W to toggle between preview (hides grid/guides/bleeds etc.) and working spaces.  \n\\* Make sure your colour profiles are synchronised between all suite programs (Illustratior/InDesign/Photoshop) so you don't get any surprises when you throw something in. In CS2, there is a suite colour sync feature that is very useful.\n\nI hope this helps.\n\n:-)\n\n"
    },
    {
      "time": "",
      "content": "Ever needed to switch to the Selection tool while you’re working inside a text frame? Or what if you want to draw a new frame somewhere else on the page. You can’t tap the shortcut V for the Selection tool or F for the Rectangle Frame tool while you’re working inside a text frame or you will wind up adding the letters V and F to your text. Yes, you can deselect and then press those keys, but the savvy InDesign user can do the following:\n\nChoose Edit Keyboard Shortcuts and switch the Product Area to Tools. Then scroll down to find the tool you need a new shortcut for. Click inside the New Shortcut field and with the Context as Text, type the shortcut you want. Make sure you use a modifier key such as Cmd (Mac) or Ctrl (Windows) and then a letter. For instance, I use Cmd-Opt-Shift-V for the Selection tool. Then, you will have two different shortcuts. The single letter can be used when you’re outside a text frame, and the longer one when you’re inside the frame.\n\n_— This week's tip was provided by Jamie McKee._\n\nFrom [The Indesign Conference](http://web.archive.org/web/20111214115451/http:/www.theindesignconference.com/) Tip of the Week.\n\n"
    },
    {
      "time": "",
      "content": "Ooooh! Clever!\n\n"
    },
    {
      "time": "",
      "content": "i must say i find it easier to just remember the deselect-shortcut and then the shortcuts for the different tools instead of two different shortcuts for EVERY tool ;)\n\n"
    },
    {
      "time": "",
      "content": "If, for example, you were using the direct selection tool before using the type tool, holding down the command key will give you the direct selection tool back, click the mouse wherever your cursor is and hit the letter to activate the new tool. I don't know if this works on PCs but I imagine so. If you want to zoom or move the workarea you can use command+space or option (alt) respectively, releasing them will return you to the text tool.  \nNo more trips to the pesky menu, until you forget what the shortcut is:)  \nTim\n\n"
    },
    {
      "time": "",
      "content": "\"So I’m doing my first ever project with InDesign and there’s one thing that is bugging me.\"\n\nWell, just give it time, it's a great, big application.\n\nBecause my use tends towards type, I've become happier thAN EVER with a type tool that lets you out\\*, when you want to stay with the type tool, (forever on most of my documents).\n\n\\* (cmd = select, move, resize objects, cmd-opt = interactive copy, cmd-op-sh= type tool sans function, (but pan and zoom with care).\n\nI wish I'd started out knowing: to set my default document to a 13\" square, and then each time I create a new document , change the format from portrait to landscape to make sure nothing happens.\n\nAlso, the controls on the underscore are phenomenal. defining the underscore as a squiggly line, for example, can be done to avoid those nasty descenders, and it is now a breeze.  \n:)\n\n"
    }
  ]
}
