{
  "id": "18961",
  "title": "Need a font as model for Unicodes E000 - E7FF",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I need to find a font or a list of the characters to use as a model to build my own font in the unicodes range: E000 - E7FF. I have been at the Unicodes home page but they do not display the glyphs in this section. Any clues to where I can find this info? thanks\n\n",
  "author": "<a href=\"user/2995\" title=\"View user profile.\">Reg</a>",
  "time": "<br>",
  "uid": "2995",
  "comments": [
    {
      "time": " 1 April, 2006 - 10:34am",
      "content": "Either this is a very lame April Fools or I’m very sad for knowing that this is the Unicode PUA “Private Use Area” …\n\n[http://www.unicode.org/charts/PDF/UE000.pdf](http://web.archive.org/web/20060526013321/http:/www.unicode.org/charts/PDF/UE000.pdf)\n\n…says it all.\n\nSi\n\n"
    },
    {
      "time": " 1 April, 2006 - 11:08am",
      "content": "It would be lame if it <cite>weren’t</cite> a joke - otherwise it’s pretty clever!\n\nhhp\n\n"
    },
    {
      "time": " 1 April, 2006 - 11:11am",
      "content": "True - the sad thing is that companies and governments standardized use of the PUA could have the effect of creating a defacto standard on the PUA. Which kind of defeats the purpose.\n\n"
    },
    {
      "time": " 1 April, 2006 - 1:31pm",
      "content": "_The sad thing is that companies and governments standardized use of the PUA could have the effect of creating a defacto standard on the PUA_\n\nThat was a worry, but companies and governments have been trying to do that to the PUA for over a decade now, and as far as I can tell the wild west has yet to be tamed. The Chinese government has been the biggest player in this regard, even incorporating PUA characters into de jure national standards documents, but the fact that any other government, company or individual can define contrary encodings for the same PUA codes prevents any overall de facto standard from emerging. The Chinese can demand that any software conformant with their standard use the PUA in a particular way, but that hardly challenges the essential nature of the PUA: Practically Unusable Anarchy.\n\nThe really scary thing is when the Chinese start hijacking reserved characters in non-PUA ranges, as they want to do for a glyph encoding for (unnecessary) Uighur ligatures. They can’t use PUA for that because all PUA characters have a presumed left-to-right order (see above, Unusable).\n\n"
    }
  ]
}
