{
  "id": "18985",
  "title": "A Greek version for the Morpheus font",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Good morning everybody,\n\nthis is the first time i'm participating in the website, it was a great pleasure to even learn its existence some time ago, not to mention the precious info/feedback one can come across over here.\n\nTo the point; Morpheus is a font that was originally designed some ten years ago by Eric Oehler. It was published on the net as shareware and I've liked it from the beginning. I'm currently designing (with the agreement of the original creator) a Greek version. I've prepared a little preview image file to show for demonstration of the Greek character set. I haven't included the latin character set on the image file, this can be checked out by downloading the original font from [http://www.dafont.com/morpheus.font](http://web.archive.org/web/20150417120835/http:/www.dafont.com/morpheus.font \"http://www.dafont.com/morpheus.font\")\n\nI would be gratefully welcoming your critique/comments/ideas regarding either the aesthetics or the readability of the font.\n\n[http://utopia.duth.gr/~vkarageo/morpheus-new.jpg](http://web.archive.org/web/20150417120835/http:/utopia.duth.gr/~vkarageo/morpheus-new.jpg \"http://utopia.duth.gr/~vkarageo/morpheus-new.jpg\")\n\n",
  "author": "vank",
  "time": "2 Apr 2006 — 11:53pm",
  "uid": "11919",
  "comments": [
    {
      "time": "3 Apr 2006 — 9:05am",
      "content": "Sidenote: I do not wish to put a stop to what you are doing, however, this typeface, Morpheus is derivative of Emigre's [Mason](http://web.archive.org/web/20150417120835/http:/www.emigre.com/EFfeature.php?di=104) designed by Jonathan Barnbrook.\n\n"
    },
    {
      "time": "3 Apr 2006 — 3:29pm",
      "content": "Βαγγέλη, απο λιγο που μπορώ να δώ, νομίζω οτι τα δικά σου Eλληνικά δουλεύουν καλύτερα απο τα Greek Mason. Παρ'ολα αυτα η moroheus όντως μοιάζει απειλητικά με την mason του Branbrook που, απ'οτι βλέπω, ειναι προγενέστερη.  \nIt seems to me that your Greek work better than Mason Greek. However, I find it extremely difficult to make a font like this to work well in Greek. May be the lack of history that annoys the eye, or I miss the conceptual link. Like making a Greek Gothic font. But to be honest, I m not a big fan of mason Greek either. Call it personal taste.  \nI don't want to sound discouraging at all though. By all means, keep on going. All the experiments are very useful; we may go through hardship and development to find ways to express new typographic qualities. Especially with our difficult (but interesting) alphabet.\n\n"
    },
    {
      "time": "4 Apr 2006 — 2:28am",
      "content": "Dear Spyros (i'm gonna write english like you did, simply politeness :)) thank you for your nice words. The truth is that i can obviously see your and Tiffany's point: it does resemble the general aisthetics of the pre-existing Mason. However, this font exists for like 10 years? and in the last 8 years that i know it i haven't come across any legal issues regarding it. If anyone has any knowledge i might, unwillingly, ignore would be welcomed to inform me.\n\nI'm definitely not an experienced typeface designer (it's only my third attempt and the first to be \"accomplished\" to such an extent), and i've not checked the character set of the greek mason version, i'm gonna do so though, in the first chance.\n\nAs about the \"gothic greek\", yeah you're perfectly right about that, it doesn't look such a natural combination. However i can think of a couple of potential uses of such a font in the greek language: (RPG, dark/epic/historical logos/titles etc. I've actually already had a couple of emails with people that showed some interest in using it, i hope i'll soon have the chance to look at what they did).\n\nLast but not least, Spyros it's been a pleasure to come across you: i had the chance to check your page and your typefaces. I really liked starbeat ;)\n\n"
    },
    {
      "time": "4 Apr 2006 — 8:39am",
      "content": "The μ and η, don't read for me. I think you need to push it more to get the glyph recognition to work. Right now, it is more style than function for me.\n\nChrisL\n\n"
    },
    {
      "time": "4 Apr 2006 — 11:20pm",
      "content": "thanks a lot for noticing that Chris. Really appreciated :)\n\n"
    }
  ]
}
