{
  "id": "18995",
  "title": "(x) Finnish traffic signage - similiar to Alternate Gothic {Yves}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": " ![](http://web.archive.org/web/20131018180215im_/http:/typophile.com/files/liikennem.gif)\n\nThe horrible image is from finnish traffic signage.\n\nI have to do a spoof based on the signage, I don't  \nneed a 100% match but something that would look similiar  \nto most people.\n\nPerhaps I just should flip trough the junk at dafont to find  \nsomething equally as ugly. Any suggestions?\n\n",
  "author": "Jan Sandvik",
  "time": "3 Apr 2006 — 11:41am",
  "uid": "2482",
  "comments": [
    {
      "time": "3 Apr 2006 — 11:47am",
      "content": "What about Trade Gothic Bold or Alternate Gothic?\n\n"
    },
    {
      "time": "3 Apr 2006 — 11:55am",
      "content": "Jan, I don't know about the font, but [this](http://web.archive.org/web/20131018180215/http:/alk.tiehallinto.fi/www2/liikennemerkit/index.htm) site has plenty of information on Finnish traffic signs.\n\nYou may be able to drag what you need from the various PDFs here, good luck.\n\nRichard\n\n"
    },
    {
      "time": "3 Apr 2006 — 12:14pm",
      "content": "Yves, good suggestions indeed. Perhaps a bit too beautiful...\n\nRichard, I have been there searching, too bad I couldn't find  \nenough letters to work with.\n\nDwiggins' [CG Gothic no 1](http://web.archive.org/web/20131018180215/http:/www.identifont.com/show?41H) would perhaps work, but it's a bit too narrow.\n\n"
    },
    {
      "time": "3 Apr 2006 — 1:50pm",
      "content": "i could hook you up with the typefaces used on Swedish road signs, but it's not the same font (the lower case in particular looks rather different). perhaps it could do if you did something with just caps, but not if you wanted it to look just like your sample.\n\n"
    },
    {
      "time": "19 Sep 2007 — 3:17am",
      "content": "Hello all,  \nI know it is a pretty late reply (1,5 years!) :) but I got quite interested in the subject matter after reading your posts and made a small investigation. (and hopefully someone will read this anyway)\n\nAt the Finnish Road Administration office they told me it is some sort of custom design similar to Helvetica Bold (sic!) created in the sixties and they admitted that engineers, not typographers, designed the letter forms.\n\nI heard that probably at some point the Finnish Road Administration will have to consider updating to a new typeface since, apart from not being too handsome, the letters don't function well on the reflective material used nowadays in traffic signs.  \nA good article about a similar situation in the US was published in the [NY Times](http://web.archive.org/web/20131018180215/http:/www.nytimes.com/2007/08/12/magazine/12fonts-t.html?_r=2&adxnnl=1&oref=slogin&ref=magazine&adxnnlx=1190189763-Mmz37gsx1bmBxABDDfsI6w).\n\nI was told that the letters don't exist in a standard font format but the shapes are available in AutoCAD files (which I will receive soon by email).  \nIf I understood correctly every time a sign with altogether new content has to be created it has to be set manually letter by letter since no kerning values exist for the current font.\n\nJan, if you would like me to send you the files once I receive them leave me a comment on my [TypoTrip](http://web.archive.org/web/20131018180215/http:/typotrip.wordpress.com/) blog (I don't want to publish my email here because of spam).\n\nBest,  \nWojtek\n\nUPDATE 13:16  \nI have now received the shapes. If anyone's interested contact me as mentioned above.\n\n"
    }
  ]
}
