{
  "id": "19008",
  "title": "(x) Judy Garland World's Greatest Entertainer poster - (similar to) Titling Gothic {Judy G}",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "hey everybody, i saw the post about gay type earlier and one of the posters mentioned judy garland, who is also a favorite of mine as well. can anybody tell me what this font is that they used on her classic poster from the show at CARNEGIE HALL?\n\n ![](http://web.archive.org/web/20120610171354im_/http:/typophile.com/files/Judy%20at%20Carnegie.jpg)\n\ni hope i figured out how to post the image right.\n\ni found a few fonts that are pretty close, but nothing that has the right spirit! i think \"IN PERSON\" might be rounded, but sorry it's hard to tell from the image. thanks everybody, this is my first time wth a request like this and it's great to see how helpful you are to amateurs like me!!!\n\n",
  "author": "NigellaL",
  "time": "3 Apr 2006 — 11:54pm",
  "uid": "12319",
  "comments": [
    {
      "time": "4 Apr 2006 — 12:30am",
      "content": "IN PERSON: There were very few rounded fonts used then. That's probably the bleeding ink of something like [Futura Extra Bold](http://web.archive.org/web/20120610171354/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=C.45.0.3&attributes.sampleSize=48&sampleText=IN+PERSON&sampleSize=48). Futura or [Tempo](http://web.archive.org/web/20120610171354/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=LH.121017.0.1&attributes.sampleSize=48&sampleText=CARNEGIE+HALL&sampleSize=48) is used for the other small type.\n\nThe big wide stuff can be emulated with Font Bureau's newly released [Titling Gothic](http://web.archive.org/web/20120610171354/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontpackage&startrow=1&records=&currpage=1&totalrecords=7&displayfontid=FB.122839.0.0&fontRendererText=JUDY+GARLAND) or [Rhode Extended](http://web.archive.org/web/20120610171354/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontpackage&startrow=1&records=&currpage=1&totalrecords=4&displayfontid=FB.100197.0.0&fontRendererText=JUDY+GARLAND), or [ITC Blair](http://web.archive.org/web/20120610171354/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=ITC.103137.0.3&attributes.sampleSize=48&sampleText=JUDY+GARLAND&sampleSize=24).\n\n"
    },
    {
      "time": "4 Apr 2006 — 1:17am",
      "content": "\\> _(..) it’s great to see how helpful you are to amateurs like me!!!_\n\nHey, we're all amateurs here, but us regulars are just a little more adept at hiding it than others. :^P\n\n"
    },
    {
      "time": "4 Apr 2006 — 1:50am",
      "content": "In Person reminds me of Joshua Darden’s excellent Omnes. I know its Futura, but I want to believe its Omnes. I so love that face. Has anyone seen Corundum Text? Its great. Love to see someone mix the two of them\n\n"
    },
    {
      "time": "4 Apr 2006 — 7:54am",
      "content": "Man, that \"G\" in \"GARLAND\" reminds me of some sports team logo, but I can't think of which one...\n\n"
    },
    {
      "time": "4 Apr 2006 — 7:57am",
      "content": "\"...that “G” in “GARLAND” reminds me of some sports team logo,\"\n\nDuhhh! Greenbay Packers dude!!! :-)\n\nChrisL\n\n"
    },
    {
      "time": "4 Apr 2006 — 8:04am",
      "content": "I must admit I'm not much of a sports dude, but I hear they're the best right?\n\n"
    },
    {
      "time": "4 Apr 2006 — 8:26am",
      "content": "Not to some of the Steeler and Seahawk fans around here :-)\n\nChrisL\n\n"
    },
    {
      "time": "4 Apr 2006 — 8:55am",
      "content": "Speaking of gay: On June 14 at Carnegie Hall, Rufus Wainwright (along with a 40-person orchestra) will be recreating Judy Garland's famous 1961 performance.\n\n[http://www.rufuswainwright.com](http://web.archive.org/web/20120610171354/http:/www.rufuswainwright.com/ \"http://www.rufuswainwright.com\")\n\nI've seen (but can't find a link to) posters for the event in the style of the original Judy Garland poster. Wonder what type they used to recreate the look?\n\n"
    },
    {
      "time": "4 Apr 2006 — 9:23am",
      "content": "Um, thanks JudyG. Back from the dead to lend typographic advice I guess.\n\n"
    },
    {
      "time": "4 Apr 2006 — 11:41am",
      "content": "Anything to support the great mister Darden.\n\n"
    },
    {
      "time": "5 Apr 2006 — 10:17am",
      "content": "thanks so much guys! except for dezcom, what does football have to do with this? i had to google the \"packers\" to see what you were talking about? only americans would wear so much padding to play rugby and i have no idea why you think football is a good name for it.\n\nanyway i will get that titling gothic right away, it's not perfect but it's really really close and i think i may use omnes too just beacuse i like it. i'm copying this poster to make invitations for my best friend's 40th birthday party because he's a huge fan, but i don't think he'll notice if the type isn't a perfect match. thanks judy g! i see you're an even bigger fan than my best friend!\n\n"
    },
    {
      "time": "5 Apr 2006 — 10:57am",
      "content": "Sorry Nigella, I was just responding to Chris Keegan's question: \"Man, that “G” in “GARLAND” reminds me of some sports team logo\"\n\nSorry to send you into a Google frenzy :-)\n\nBy the way, do they play Rugby on a rug? Seems like the name would be better as Grassby :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Apr 2006 — 6:25pm",
      "content": "\"By the way, do they play Rugby on a rug? Seems like the name would be better as Grassby \"\n\ngive me a break.\n\n"
    }
  ]
}
