{
  "id": "19002",
  "title": "(x) \"Double J Lawn Service\" plastic model tree font - Tucson Two Step {Mike F}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Odd title, but I’ve come across a font that looks like a tree from those plastic models. Has anyone seen this before?\n\nTrying to attach, but keep getting this error.  \nFile copy failed: no directory configured, or it could not be accessed.\n\n",
  "author": "<a href=\"user/5948\" title=\"View user profile.\">evan</a>",
  "time": "<br>",
  "uid": "5948",
  "comments": [
    {
      "time": " 3 April, 2006 - 8:01pm",
      "content": " ![](http://web.archive.org/files/plastic.jpg)\n\n"
    },
    {
      "time": " 4 April, 2006 - 1:05am",
      "content": "That’d be Nick Curtis’ [Tucson Two Step](http://web.archive.org/web/20060523005408/http:/www.moorstation.org/typoasis/designers/curtis/pages/t.htm).\n\nThe inspiration was a luggage sticker from a Tucson Hotel per Nick’s ReadMe. Thanks to Sander de Voogt’s [archive of all things Nick](http://web.archive.org/web/20060523005408/http:/home.planet.nl/~voogt053/), we can read these references any time and, for some fonts, even see images of the [original material](http://web.archive.org/web/20060523005408/http:/home.planet.nl/~voogt053/Pics/TucsonTwoStep.jpg).\n\n"
    },
    {
      "time": " 4 April, 2006 - 1:11am",
      "content": "I give up, I just give up…\n\nMike, how can you be so incredibly good!?!\n\n"
    },
    {
      "time": " 4 April, 2006 - 1:23am",
      "content": "Nice of you to say that, Yves, but every time you incredible guys ID a text face I know exactly where I stand on the skill ladder. My little niche here concerns the stuff that’s fallen by the wayside - often for good reason (but I do like this little gem. I just wish it had been made with one case free of the rails and posts).\n\n"
    },
    {
      "time": " 4 April, 2006 - 3:17am",
      "content": "I guess that’s the strength of this Board — everybody has his/her area of expertise, and I suppose we all occasionaly get blown away whenever something gets identified that is _not_ in our own personal niche.\n\n"
    },
    {
      "time": " 4 April, 2006 - 6:46pm",
      "content": "Rarely do you guys miss. I am always impressed. Thanks again.\n\n"
    }
  ]
}
