{
  "id": "1900",
  "title": "Looking for 1910's Resources",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am interested in design / type styles of the first two decades of the twentieth century: 1900-1919. What I'm looking for, specifically, are designs that are not Arts & Crafts or Art Nouveau, but more of a general commercial vernacular from this era (advertisements, logos, signage, package designs, etc.)   \n   \nIt seems that the design history books I have are pretty thin on this period, especially regarding things that don't fit into a larger movement (such as Arts & Crafts, Deco--which I know came later, and so on).   \n   \nI've done a search on MyFonts.com, and found some good type examples, but I'd also like to see more full-blown designs of type in use.   \n   \nDoes anyone have any suggestions of books or other resources I could try?   \n   \nThanks for any help,   \n   \nTroy\n\n",
  "author": "dctroy",
  "time": "Fri, 2003-10-31 09:47",
  "uid": "1210",
  "comments": [
    {
      "time": " Fri, 2003-10-31 09:59",
      "content": "1923 ATF Specimen. If you can find one.\n\n"
    },
    {
      "time": " Fri, 2003-10-31 10:30",
      "content": "Ebay :D\n\n"
    },
    {
      "time": " Fri, 2003-10-31 10:59",
      "content": "For period reference and inspiration try:   \n   \nAD Access (over 7,000 advertisements printed in U.S. and Canadian newspapers and magazines between 1911 and 1955) at [http://scriptorium.lib.duke.edu/adaccess/](http://web.archive.org/web/20050516141206/http:/scriptorium.lib.duke.edu/adaccess/)  \n   \nor   \n   \nThe Emergence of Advertising in America: 1850 - 1920 (Presents over 9,000 images, with database information, relating to the early history of advertising in the United States) at [http://scriptorium.lib.duke.edu/eaa/](http://web.archive.org/web/20050516141206/http:/scriptorium.lib.duke.edu/eaa/)\n\n"
    },
    {
      "time": " Fri, 2003-10-31 12:00",
      "content": "There's a 1903 (?) edition for sale on e-bay, 7 hours left, currently ~$50.\n\n"
    },
    {
      "time": " Fri, 2003-10-31 14:06",
      "content": "I don't know where you are situated Troy, but here in Toronto (pop. 2 mil.) we have a number of stores that trade and sell old magazines, comic-books, paper ephemera. And a sub-culture of collectors and dealers, with bi-annual \"Old Paper Show and Sale\". Antique stores often have old magazines. The magazines are not expensive.   \n   \nI would imagine that things are the same in most big cities.   \n   \nSo I would recommend rummaging, with a copy of McGrew's \"American Metal typefaces of the Twentieth century\" (Oak Knoll) to identify the faces in the publications.\n\n"
    },
    {
      "time": " Fri, 2003-11-14 12:25",
      "content": "Troy   \n   \nProbably the best place to look would be the various trade journals (on printing) that were available at about this time: Inland Printer, British Printer, The Graphic Arts, The American Printer, etc. Most major University library collections would carry these.   \n   \nThese are very useful in seeing how things changed from decade to decade, especially in regard to typeface offerings. The late 20s and the early 30s are the heydays typographically,but some very interesting, and unsual, typeface entries can be found from the late 1890s up into the 20s.   \n   \nGerald\n\n"
    }
  ]
}
