{
  "id": "19015",
  "title": "New mac, Office 2004 and . . . kerning disappointment",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "A new imac core duo, a copy of MS Office for Mac 2004, and a freshly-bought mac (postscript-only) version of Underware’s Dolly.\n\nI fire up Word 2004 for Mac, get all the updates, and proceed to type a document with Dolly. Unfortunately, it seems that Word doesn’t want to kern Dolly Roman, kerning is basically non-existent, at least for this font. The italic flavour kerns a little better, but that’s of no real comfort. Is it the font or this version of Office for Mac that is the culprit? “To”, “WA”, “Wa” for example, are all left unkerned. Yet, Dolly’s .afm files have full kerning info in them.\n\nWhat gives? Anyone else experience this with MS Office(Word)2004?\n\n(by the way, my earlier complaint about HP printing quality problems has been remedied, more or less.)\n\n",
  "author": "<a href=\"user/9249\" title=\"View user profile.\">Palatine</a>",
  "time": "<br>",
  "uid": "9249",
  "comments": [
    {
      "time": " 4 April, 2006 - 8:33am",
      "content": "Word has traditionally had kerning turned off by default - I believe to allow the accurate reproduction of old documents such as military service memos. You might just need to turn it on.\n\n"
    },
    {
      "time": " 4 April, 2006 - 8:45am",
      "content": "I did turn kerning on. I highlighted the whole document (or even just parts of it), and then: Format —\\> Font —-\\> Character Spacing —\\> Kerning for fonts \\_\\_ points (in this case 12) and above, checkmarked. I turned it off an on repeatedly, and nothing.\n\n"
    },
    {
      "time": " 4 April, 2006 - 9:03am",
      "content": "If other fonts are kerning fine then the font is likely the culprit, and I’m sure underware will have heard of the problem and may be able to provide a fix.\n\n"
    },
    {
      "time": " 4 April, 2006 - 10:06am",
      "content": "\\> Word has traditionally had kerning turned  \n\\> off by default - I believe to allow the  \n\\> accurate reproduction of old documents  \n\\> such as military service memos.\n\nSo you say that Microsoft cares for military  \nmore than for typography? :(\n\n"
    },
    {
      "time": " 4 April, 2006 - 10:30am",
      "content": "To be honest I don’t know the history of the default, maybe performance related? I do realize that it’s incredibly hard to change defaults without users complaining. But Office, to their credit are trying to break some of the conventions - a good blog on their work is located here…\n\n[http://blogs.msdn.com/jensenh/default.aspx](http://web.archive.org/web/20060526005706/http:/blogs.msdn.com/jensenh/default.aspx)\n\nI found this post interesting with respect to defaults…\n\n[http://blogs.msdn.com/jensenh/archive/2006/02/09/528593.aspx](http://web.archive.org/web/20060526005706/http:/blogs.msdn.com/jensenh/archive/2006/02/09/528593.aspx)\n\n"
    },
    {
      "time": " 4 April, 2006 - 10:36am",
      "content": "Interesting, I’ve oft complained about kerning in Word. I hardly ever use it so I never knew about being able to turn it on.\n\n"
    },
    {
      "time": " 4 April, 2006 - 11:01am",
      "content": "I think it’s the font after all. I’ll either have them fix it or get permission from them to convert my PC version of Dolly to OpenType format, which should work just fine.\n\n"
    },
    {
      "time": " 4 April, 2006 - 11:07am",
      "content": "I don’t know why you mentioned the “.afm” file unless it was to note that the font designer created kerning pairs; neither Word nor Mac OS X uses “.afm” files. If you insist on using fonts only in the old LWFN/Suitcase paired format, the kerning information would have to be in the suitcase’s ‘FOND’ resource.\n\n"
    }
  ]
}
