{
  "id": "19012",
  "title": "Is the Term “Pro” Adobe property or a defacto standard?",
  "forum": "Build",
  "tags": [

  ],
  "content": "Thomas Phiney or another Adobe person may be the best resource for this question. (hopefully they are available).\n\nIs the designation “Pro” (as part of a font name) an Adobe proprietary name or is it useable by any foundry? Is this term considered to be a de-facto standard for large glyph set Opentype fonts?\n\nWe were discussing this in another thread where I was debating what to name one of my fonts but thought this forum a better place to get an answer.\n\n[http://typophile.com/node/18796](http://web.archive.org/web/20081013095557/http:/typophile.com/node/18796 \"http://typophile.com/node/18796\")\n\nAny thoughts?\n\nChrisL\n\n [‹ Calling all Hinting Programming Gurus](http://web.archive.org/web/20081013095557/http:/typophile.com/node/18814 \"Go to previous forum topic\") [Conversion from true type to T1 ›](http://web.archive.org/web/20081013095557/http:/typophile.com/node/19117 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081013095557/http://typophile.com/user/3135\" title=\"View user profile.\">dezcom</a>",
  "time": "<br>",
  "uid": "3135",
  "comments": [
    {
      "time": " 4.Apr.2006 6.47am",
      "content": "[Pro](http://web.archive.org/web/20081013095557/http:/www.myfonts.com/search?search%5Btext%5D=pro) isn’t proprietary\n\n"
    },
    {
      "time": " 4.Apr.2006 6.51am",
      "content": "This question came up when Adobe released their first OpenType Pro fonts. From...\n\n[http://www.microsoft.com/typography/links/news.aspx?NID=1474](http://web.archive.org/web/20081013095557/http:/www.microsoft.com/typography/links/news.aspx?NID=1474 \"http://www.microsoft.com/typography/links/news.aspx?NID=1474\")\n\n\\>_But what exactly makes an OpenType font a Pro font?_   \n\\>An Adobe OpenType font only gets the Pro designation if it has a minimum base character set and a reasonable number of OpenType features. The minimal Pro character set includes ISO-Adobe and Adobe CE character sets, plus the euro, litre, foursuperior and estimated symbols.\n\n\\> _Can I call the OpenType fonts I make Pro fonts?_  \n\\> According to the OpenType list postings Adobe is not claiming any trademark on the Pro designation with reference to OpenType fonts. Although anyone is free to use the word, it would reduce end-user confusion if the type community remains consistent in their use of the term.\n\nBut Adobe could always change their mind. So you might want to reconfirm with Tom.\n\nSi\n\n"
    },
    {
      "time": " 4.Apr.2006 7.45am",
      "content": "I would hope the type community could devise a standard for the sake of the type consumer. It may even be better to have a system like Adrian Frutiger came up with for Univers where two numbers told the tale quite easily. There could be 2 letters instead or 3 if need be but something is needed to let the consumer know what they are getting.\n\nChrisL\n\n"
    },
    {
      "time": " 4.Apr.2006 8.00am",
      "content": "I think it makes sense for vendors with large legacy libraries (eg Linotype, Adobe and Monotype) to standardize the naming of OpenType edition fonts. Here the “Pro” vs “Std” designation seems to work fine. Where things break down is the specialist fonts, that include just one or two carefully selected OpenType features. An example might be Ed Interlock.\n\n"
    },
    {
      "time": " 4.Apr.2006 8.24am",
      "content": "I am thinking more along the lines of language support. Something like XL for Latin Extended, XLC for Latin Extended plus Cyrillic, that sort of thing, as opposed to the multi lig replacement feature stuff in Ed Interlock.\n\nChrisL\n\n"
    },
    {
      "time": " 4.Apr.2006 8.38am",
      "content": "_XL for Latin Extended, XLC for Latin Extended plus Cyrillic_\n\nI don’t like this, because:\n\n1. In the 21st Century, every OT font should have full CE support. Yet you still need to communicate this users through some sort of extension. I like “Pro” because, if nothing else, at least you know that they remembered to put CE in. Maybe CE isn’t such a big deal in North America, but over here, you can’t sell fonts without it. It is the bear minium, and even it doesn’t cover all your working bases… right now, the EU has 25 member countries, and two writing systems. In a few years, it will certainly have three (Cyrillic), or even four (Arabic?).\n\n2. and because…\n\n\\>XLC…\n\nAnd then a CE + Greek font would be XLG? What happens when you put in Greek and Cyrillic? XLCG? Then Hebrew and Arabic? Helvetica World would need an XLCGHA extension. Or maybe XLCGHAV, since Vietnamese accents are in there, too.\n\n"
    },
    {
      "time": " 4.Apr.2006 8.46am",
      "content": "\\> or even four (Arabic?).\n\nCool, which country were you thinking of? How about Hebrew? Israel is already part of Europe.\\*\n\nCheers, Si\n\n\\*as it’s part of the Eurovision song contest (edit - and UEFA)\n\n"
    },
    {
      "time": " 4.Apr.2006 8.52am",
      "content": "Well, I don’t think either Israel or the EU wants a merger with the other party.\n\nI don’t know if an Arabic-speaking country will be considered eligible for EU membership anytime before 2020 or 2030, but if one would be, it would probably be one of the North African ones. But by that time Europe will have such a large Arabic-speaking minority that Arabic will have to be added into the pile of quasi-official languages. I bet that there are already more Arabic-speakers living in the EU than say, Czech-speakers.\n\nI don’t think that there are any Cyrillic-using countries in the EU yet, but Bulgaria or Serbia will probably join before 2015 or 2020. And there is always Ukraine… some of the western half of Ukraine was part of “Europe”\\* until 1917/18.\n\n\\*As a part of the Austro-Hungarian Empire\n\n"
    },
    {
      "time": " 4.Apr.2006 9.00am",
      "content": "\\>But by that time Europe will have such a large Arabic-speaking minority that Arabic will have to be added into the pile of quasi-official languages.\n\nI hadn’t thought of that. Another scenario (unlikely but possible) might be a future Turkish regime making Arabic an official script alongside Latin.\n\nSorry to have veered off-topic, but I suppose this helps explain Linotype’s investment in new Arabic types and the hiring of the super talented Nadine Chahine, and sponsorship of the Dubai conference? The future is Arabic!\n\n"
    },
    {
      "time": " 4.Apr.2006 9.20am",
      "content": "“Although anyone is free to use the word, it would reduce end-user confusion if the type community remains consistent in their use of the term.”\n\nAgreed. Unfortunately, this definition may not have been clear enough, as the Pro designation is being used by some foundries to indicate _advanced typographic features_ rather than _extended multilingual character sets_. Can’t think of any off hand. A little help?\n\n"
    },
    {
      "time": " 4.Apr.2006 9.27am",
      "content": "\\>A little help?\n\nSadly too many...\n\n[http://www.myfonts.com/search?search%5Btext%5D=PRO](http://web.archive.org/web/20081013095557/http:/www.myfonts.com/search?search%5Btext%5D=PRO \"http://www.myfonts.com/search?search%5Btext%5D=PRO\")\n\n...few of these have the little MyFonts ’ce’ icon. I hope these 20 are not representative. :-(\n\n"
    },
    {
      "time": " 4.Apr.2006 10.20am",
      "content": "Dan,  \nI am not saying that my little XL-XLC, etc., was the answer. I was just posing the question in hopes that something better would come out of this discussion than my first utterance. I also feel that CE should become a normal expectation as well as Greek and Cyrillic. The issue is letting the consumer know what they are getting. Thnere will be quite a number of legacy fonts out there for some time that will not be extended with a full character set right away. I am just looking for a way to distinguish those that do from those that don’t. If we settle on just “Pro”, then we need define it in a meaningful way. If we need some other expressions that fill the bill, then let’s come up with a system.  \nI certainly don’t want to tie a type naming system to the politics of the EU and who may or may not become part of it at some point. We are a world of numerous languages and several scripts. We all have a need to set type no matter what our political affiliations are to become. I think we can come up with a system that includes all glyph systems and scripts and use it before the political dust settles on the EU.\n\nChrisL\n\n"
    },
    {
      "time": " 4.Apr.2006 10.25am",
      "content": "Si,  \nFrom your link, if you compare Card Pro, and Priva Pro, you see quite a large difference in language support. Clearly, the term “pro” as it is used now on MyFonts, is not defining anything meaningfull.\n\nChrisL\n\n"
    },
    {
      "time": " 4.Apr.2006 10.33am",
      "content": "\\> Feature-rich Adobe OpenType fonts can be distinguished by the word “Pro,”  \n<cite><a href=\"http://web.archive.org/web/20081013095557/http:/www.adobe.co.uk/type/opentype/main.html\">From Adobe OT site</a></cite>\n\nI’m confused myself over what “Pro” is supposed to represent. Adobe seems to use the term “Pro” to differentiate OpenType fonts from their PS/TT counterparts but it seems that more and more fonts are being released exculsively in OpenType format nowadays, would this render the “Pro” term meaningless? I think I’ve confused myself...\n\n"
    },
    {
      "time": " 4.Apr.2006 10.42am",
      "content": "I just found [this.](http://web.archive.org/web/20081013095557/http:/www.typotheque.com/fonts/opentype_pro_vs_std/) Typotheque appears to use “Std” and “Pro” terms to differentiate between Extended Latin and Cyrillic, Greek support. “Pro” including the Cyrillic and Greek language support in addition to Extended Latin.\n\n"
    },
    {
      "time": " 4.Apr.2006 11.11am",
      "content": "\\>Feature-rich Adobe OpenType fonts can be distinguished by the word “Pro,”\n\nNote that my earlier defintions are based on postings made by Adobe people to the OpenType list five and a half years ago (September 2000). The meaning of ’Pro’ may have changed, but more likely as OT aware apps have been developed the features rather than the char set are of more interest.\n\n"
    },
    {
      "time": " 4.Apr.2006 11.13am",
      "content": "Someone call Phinney!\n\n"
    },
    {
      "time": " 4.Apr.2006 11.35am",
      "content": "If Adobe’s meaning for the word has changed in 5 years, heaven help us from devining a standard from it :-)\n\nStephen is right. Put on the bat light and shine it on the clouds—Batman Phinney must be alerted!\n\nChrisL\n\n"
    },
    {
      "time": " 4.Apr.2006 1.09pm",
      "content": " ![](http://web.archive.org/web/20081013095557im_/http:/typophile.com/files/ouronlyhope.jpg)\n\n"
    },
    {
      "time": " 4.Apr.2006 1.39pm",
      "content": "Geoff Riding:  \n<cite>... but it seems that more and more fonts are being released exculsively in OpenType format nowadays, would this render the “Pro” term meaningless?</cite>\n\nIf all fonts by a foundry have the CE additions, then it is not really necessary to attach “Pro” to each font name ...\n\n<cite>Typotheque appears to use “Std” and “Pro” terms to differentiate between Extended Latin and Cyrillic, Greek support.</cite>\n\nI wonder if it’s really important that “Pro” means the same with all foundries. The chaos is already there. Some even relate it to existence of OT feature, not to language support as was Adobe’s way to use it.  \nTypotheque documents make it very clear what they mean by “Std” and “Pro” — so I see no problem there. It is more problematic if foundries would add it for mere marketing reasons, without knowing what this “Pro” designates for them. (Related, what do I get when I license an “OpenType” font?)  \nWhen licensing fonts, I look very carefully what I will get and never trust mere words.\n\nKarsten\n\n"
    },
    {
      "time": " 4.Apr.2006 1.39pm",
      "content": "[sorry, double-clicked ...]\n\n"
    },
    {
      "time": " 4.Apr.2006 1.51pm",
      "content": "si: “…few of these have the little MyFonts ‘ce’ icon. I hope these 20 are not representative. :-(“\n\nThe icons on the myfont site are setted by hand. They work (for many years) to fix this and to use an automated process to add the right icons.\n\nSo far, the absents of some icons is confusing. Hope they fix it soon or give the foundries/designers the possebility to set it by ourself. :-)\n\n— [astype.de](http://web.archive.org/web/20081013095557/http:/www.astype.de/)—\n\n"
    },
    {
      "time": " 4.Apr.2006 2.53pm",
      "content": "Si,  \nGotta love it man!!! :-)\n\nYou made my day,\n\nChrisL\n\n"
    },
    {
      "time": " 4.Apr.2006 3.31pm",
      "content": "If only I knew how to use Photoshop I’d be dangerous - but perhaps the amateur nature of the image adds to the silliness. Thanks, Si\n\n"
    },
    {
      "time": " 5.Apr.2006 7.34pm",
      "content": "_advanced typographic features_\n\nHandsome Pro.  \nHandsome (2000) is Type 1/TrueType, and has “adobe standard encoding”.  \nHandsome Pro (2005) has lots of contextual alternates, but no CE support.  \nHey, it was my first OT face, and hard enough to figure out how to get the feature to work, let alone do a mass of extra language glyphs for the alternates.  \nMaybe one day Handsome Super Pro.\n\n"
    },
    {
      "time": " 5.Apr.2006 7.43pm",
      "content": "_Maybe one day Handsome Super Pro._\n\nWell you’ll see _something_ Super Pro at the end of the week. \\>^P\n\n"
    },
    {
      "time": " 6.Apr.2006 12.28am",
      "content": "Sorry, I was on vacation last week, so catching up a lot this week. Luckily, I saw the Phinn-signal! :)\n\nAdobe does not have a trademark on the “Pro” designation for fonts, and welcomes other foundries using it, if they like. In an ideal world, we think the usage should be consistent, but it’s up to each foundry what they do.\n\nAdobe’s practice is to use “Pro” to designate (A) Latin fonts which have Adobe CE coverage in addition to the Adobe Western 2 character set, and (B) fonts with the Adobe-Japan1-5 or greater character set as opposed to fonts with the Adobe-Japan1-4 or lesser character set.\n\nFor case (A), these fonts may also have Greek and/or Cyrillic coverage, but it is not required.\n\nFor OpenType fonts that do not have CE coverage, Adobe calls them “Standard” regardless of the number of features involved. For example, Poetica Standard is is the result of merging 17 Type 1 fonts and has quite a few OpenType features. Similarly, Utopia Standard has an awful lot of typographic extras, but no CE coverage.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 6.Apr.2006 5.46am",
      "content": "Thanks Thomas! Glad the Phinney light caught you :-)\n\n“Adobe-Japan1-5 or greater character set as opposed to fonts with the Adobe-Japan1-4 or lesser character set.”\n\nWould you please explain the “Japan set”? I know I am not failiar with it and perhaps others might like to know as well.\n\nChrisL\n\n"
    },
    {
      "time": " 6.Apr.2006 6.14am",
      "content": "This may help, Adobe’s [Character Sets.](http://web.archive.org/web/20081013095557/https:/istore.adobe.com/type/browser/info/charsets.html)\n\n"
    },
    {
      "time": " 6.Apr.2006 8.31pm",
      "content": "Or look through the CJK and CID resources at the bottom part of [this list](http://web.archive.org/web/20081013095557/http:/partners.adobe.com/public/developer/font/index.html) of Adobe technical notes.\n\nT\n\n"
    },
    {
      "time": " 7.Apr.2006 5.19am",
      "content": "Thanks Thomas!\n\nHow is our little Miranda doing? :-)\n\nChrisL\n\n"
    },
    {
      "time": " 7.Apr.2006 11.04am",
      "content": "\\> How is our little Miranda doing? :-)\n\nJust don’t show her the [Phinn-signal](http://web.archive.org/web/20081013095557/http:/typophile.com/wiki/Phinn-signal) prior to bedtime. ;-)\n\n"
    },
    {
      "time": " 7.Apr.2006 12.39pm",
      "content": "LOL!!!\n\nChrisL\n\n"
    },
    {
      "time": " 7.Apr.2006 8.02pm",
      "content": "Actually, she was sitting on my knee when I was re-checking the thread just now. I pointed at the Phinn-signal, and asked her who that was. “Daddy!” she happily exclaimed. So no problem.\n\nMiranda is otherwise just fine. Started toilet-training herself just over a month ago, which was a little odd for a kid at 21 months, but I’m not complaining.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 7.Apr.2006 8.50pm",
      "content": "My daughter Julia did it the same way at that age. One day she just decided it was time and that was the end of it. She has always been a self starter and never took kindly to coaxing :-)\n\nChrisL\n\n"
    },
    {
      "time": " 8.Apr.2006 7.58pm",
      "content": "Sorry to come to this party beyond fashionably late.\n\nChris: _I am thinking more along the lines of language support. Something like XL for Latin Extended..._\n\nWhat is Latin Extended? How far is it extended? Why not farther? How do you label fonts that are extended farther? XXL? XXXL? XXXXL?\n\n"
    },
    {
      "time": " 8.Apr.2006 8.03pm",
      "content": "When we first in introduced the 650+ char WGL4 fonts some people called them the “fat fonts” to distinguish them from the smaller CP1252 versions - so the XL thing might work. Although I think this is more a subtle superbowl reference from Chris.\n\n"
    },
    {
      "time": " 8.Apr.2006 8.18pm",
      "content": "“What is Latin Extended? How far is it extended? Why not farther?”\n\nJohn, that is exactly my question. There should be a brief 2 or 3 glyph term which means all latin based languages, and other brief terms for other scripts. I don’t pretend to have the answer, that is why I asked. If the term “Pro” is to fill that need, then it needs to be defined much better.\n\nSi, XL is my T-shirt size and NOTHING more :-)\n\nChrisL\n\n"
    },
    {
      "time": " 8.Apr.2006 8.59pm",
      "content": "The trouble with the Latin script, in particular, is that it is an open set. I’m not sure anyone has a really good idea of what would constitute a full list of languages written in the Latin script, and in Africa and the Americas it tends to be the script of choice for newly written languages. Even though no new decomposable diacritics are being added to Unicode, new Latin letters continue to be added. When Unicode 5.0 is rolled out later this year, it will contain 27 additional Latin letters for writing modern languages, plus others for phonetic transcription.\n\nA fully extended Latin font — i.e. one intended to support all the languages written in the script — would also, as a basic requirement, need to support dynamic mark-to-letter and mark-to-mark positioning for a very large number of combining mark characters. Any OpenType font without extensive GPOS feature support would not qualify.\n\nI don’t find the term ’Pro’ very helpful in the kinds of fonts I produce. The minimum requirements for a Pro font defined by Adobe are fine — basically a kind of pan-European Latin coverage, minus some minority languages — but of course the term doesn’t tell you what else is in a font beyond the minimum. Frankly, I don’t think this kind of information can be conveyed in a font name, because the information is too complex. What this suggests to me is that there needs to be better access to font name table entries, so that one can query a font from within, say, an application menu and find out information about character set coverage.\n\nIdeally, somewhere down the road, the actual cmap table of a font could be crossreferenced to a database of languages at the system or application level, so two-way queries could be made, e.g. ’Show me all the fonts that support language X’ or ’Show me what languages X font supports’. A lot of work needs to be done to catalogue this information, though, and it will require a large, collaborative effort. The WRIT project I worked on for MS in 1998 was aimed at this kind of cross-referencing of fonts to languages: we just got our toes wet with approx. 700 reasonably well documented languages.\n\n"
    },
    {
      "time": " 8.Apr.2006 9.45pm",
      "content": "Among other things, MacOSX’s Character Palette does something really nice, by listing all the installed fonts that contain a selected character. Can one do that in WinXP?\n\n ![](http://web.archive.org/web/20081013095557im_/http:/typophile.com/files/ms_macosx_cp.png)\n\n"
    },
    {
      "time": " 8.Apr.2006 9.57pm",
      "content": "That’s nice, Miguel. No, nothing similar in Windows XP, although it would be easy enough to implement, I think. From the look of it, everything is derived from the Unicode data files.\n\nTell me, in the GLyph Variants... field, does this work for OT (GSUB entries) or just for AAT (Zapf table entries)?\n\n"
    },
    {
      "time": " 9.Apr.2006 9.47am",
      "content": "Good question. It looks like it only works for AAT. I selected Warnock Pro and didn’t get any of the alternates.\n\n ![](http://web.archive.org/web/20081013095557im_/http:/typophile.com/files/ms_aat_zap.png)\n\n"
    },
    {
      "time": " 9.Apr.2006 10.44am",
      "content": "John,  \nI am also hoping for a method that would allow a potential buyer the option to see language support for a given font so he can evaluate it for purchase. This would of course have to be web based and take the operating system out of the picture. I am thinking there must be a way to read the encoding of a font and place a code in a given field. This field could be looked up as part of the standard search for a font at a resellers site. The code could be deciphered into a language list displayed on the sellers site. This would take out the hand work of putting often inaccurate language icons on the MyFonts site for example.  \nThe same sort of thing could be done to generate a list of opentype features.\n\nChrisL\n\n"
    },
    {
      "time": " 9.Apr.2006 1.47pm",
      "content": "_Ideally, somewhere down the road, the actual cmap table of a font could be crossreferenced to a database of languages at the system or application level, so two-way queries could be made, e.g. ‘Show me all the fonts that support language X’ or ‘Show me what languages X font supports’. A lot of work needs to be done to catalogue this information, though, and it will require a large, collaborative effort._\n\nSomething kind of like this?\n\n[http://www.fileformat.info/info/unicode/char/1625/fontsupport.htm](http://web.archive.org/web/20081013095557/http:/www.fileformat.info/info/unicode/char/1625/fontsupport.htm \"http://www.fileformat.info/info/unicode/char/1625/fontsupport.htm\")\n\n"
    },
    {
      "time": " 9.Apr.2006 3.24pm",
      "content": "_Something kind of like this?_\n\nBoth that and the Apple character map are simply dealing with Unicode blocks, which is pretty simple to do, and for some blocks you have a pretty good idea of correlation between the script and language because it is basically one-to-one. But most scripts are used to write more than one language: some are used to write dozens, and the Latin script is used to write hundreds. So being able to map fonts to languages is much more problematic.\n\n"
    },
    {
      "time": " 10.Apr.2006 4.29am",
      "content": "Currently (10.4.x), the variants in Mac OS X (visible in the system Character Palette and in the Typography palette) only appear when a font has the Zapf table.\n\nA.\n\n"
    }
  ]
}
