{
  "id": "19013",
  "title": "First massive x-height?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "In 1516, at the impressive age of 66, Griffo made his last type for his own press in Bologna. This tiny italic, in which four line increments vertically occupy almost exactly 1 cm, has an enormous x-height and fat counters, making these 32º books surprisingly readable. Is it the first such type made? Does anyone know about other early experiments with monster x-height?  \nGeorge\n\n ![](http://web.archive.org/web/20140709175238im_/http:/typophile.com/files/x-height2.jpg)\n\n",
  "author": "George Horton",
  "time": "4 Apr 2006 — 7:31am",
  "uid": "9356",
  "comments": [
    {
      "time": "4 Apr 2006 — 8:10am",
      "content": "This would make an interesting study. At the time, printing, let alone creating a typeface, was expensive. I don't recall how far abroad the Latin alphabet was at this time, it post-dates the period of the incunable, but not by much.\n\n"
    },
    {
      "time": "4 Apr 2006 — 8:46am",
      "content": "Do you think those caps were placeholders? They look more Roman than Italic to me.\n\n"
    },
    {
      "time": "4 Apr 2006 — 8:54am",
      "content": "_monster x-height_\n\n...other than JG, 60 years earlier?\n\n"
    },
    {
      "time": "4 Apr 2006 — 8:55am",
      "content": "Yup, other than the Goths (and Griffo used, as everyone did until rather later, roman caps with italic miniscules).\n\n"
    },
    {
      "time": "4 Apr 2006 — 8:55am",
      "content": "\\> _Do you think those caps were placeholders? They look more Roman than Italic to me._\n\nThat's because the caps were Roman, as it was the convention in early use of italics. From time to time you still see it.\n\n"
    },
    {
      "time": "4 Apr 2006 — 9:06am",
      "content": "For comparison, this is Griffo's previous italic, made for and printed by Gershom Soncino in 1503, at roughly the same magnification. I think this is the most beautiful of all Renaissance italics.\n\n ![](http://web.archive.org/web/20140709175238im_/http:/typophile.com/files/smallx.jpg)\n\n"
    },
    {
      "time": "4 Apr 2006 — 9:23am",
      "content": "Pardon me,  \nSome Questions:  \nwho is Gershom Soncino?  \nand what did he print?  \nand what is the subject of this book?\n\n"
    },
    {
      "time": "4 Apr 2006 — 9:32am",
      "content": "Gershom Soncino was the most technically capable printer of the early C16th, and he issued excellent editions of the classics and of Jewish material. He worked from the little town of Fano, and had his first types (Hebrew and italic) cut by Griffo, after the latter fell out with Aldus Manutius. This is Petrarch's 'Opere Volgari', the first book, I think, printed from the new italic.\n\n"
    },
    {
      "time": "4 Apr 2006 — 9:40am",
      "content": "Would you mind adding that to the wiki, or should I?  \nalso, is the historical soncino press named after him?  \nor is it tied to him in other ways?  \nwhere could I read more on this subject?\n\n"
    },
    {
      "time": "4 Apr 2006 — 9:43am",
      "content": "More on Soncino [here](http://web.archive.org/web/20140709175238/https:/www.jewishvirtuallibrary.org/jsource/loc/Soncino.html).\n\nThe modern [Soncino Press](http://web.archive.org/web/20140709175238/http:/www.soncino.com/) has published the massive English translation of the Talmud--printed in van Krimpen's Spectrum typeface.\n\n"
    },
    {
      "time": "4 Apr 2006 — 9:55am",
      "content": "Nice find. Your measurement indicates that the type was about 7 point. In looking for a previous font with a larger x-height, I'd recommend tracking down previous fonts of smaller point sizes! :-)\n\nBTW, I noticed on your fourth line an open-bottom bicameral \"g\"!  \nThat's the earliest I've seen that form occur in type. But I have to  \nwonder whether that particular impression was damaged; could you  \nlet me know if all the \"g\"s in that printing have that structure?\n\nhhp\n\n"
    },
    {
      "time": "4 Apr 2006 — 9:57am",
      "content": "It feels like an 80s ITC Griffo with that large x-height :-)\n\nChrisL\n\nPS: I know Norbert is going to get me for that :-)\n\n"
    },
    {
      "time": "4 Apr 2006 — 10:15am",
      "content": "Psachyah, I'm no Soncino scholar though I'd be happy to put a note in on him if you wanted. He doesn't come up very often though, not having had any substantial influence, even purely typographic influence, outside the Jewish community. In printing Greek, Latin and Italian, Aldus set the trends and Soncino copied him. He just did it better.\n\n"
    },
    {
      "time": "4 Apr 2006 — 10:22am",
      "content": "Chris, that was my exactly my reaction! It looks like a Tony Stan take on the 1503 italic. I think only half a dozen or so copies of books printed by Griffo survive (he didn't get much done, what with being executed for murder a year after starting up), and it took months and an absurd amount of money for me to secure scans of two pages, so it was almost embarrassing to find such a homely thing. But nice work for someone probably with failing sight and no magnifying lens.\n\n"
    },
    {
      "time": "4 Apr 2006 — 10:35am",
      "content": "Hrant, good question. I'm not sure: either the loop tapers to a point which just touches the, um, other bit, or it really is Baskervillian.\n\n ![](http://web.archive.org/web/20140709175238im_/http:/typophile.com/files/Griffo-gs.png)\n\n"
    },
    {
      "time": "4 Apr 2006 — 10:39am",
      "content": "<cite>Do you think those caps were placeholders? They look more Roman than Italic to me.</cite>\n\nThat’s because the caps were Roman, as it was the convention in early use of italics. From time to time you still see it.\n\n**I seem to remember reading somewhere (<cite>Printing Types</cite>...?) that the italic upper case didn't appear until a couple of decades later, and as bootlegs of sorts – someone copied Griffos italics and added upper case letters themselves. Previous to that, as in the ones in the example, they used small caps.**\n\nƒ\n\n"
    },
    {
      "time": "4 Apr 2006 — 10:42am",
      "content": "It looks open to me. But you're right, one can't be sure.  \nLike if the matrix wasn't struck hard enough all the  \n\"g\"s would have been contrary to Griffo's \"intent\".\n\nBTW, there is actually an unequivocal precedent to Bville's \"g\":\n\n ![](http://web.archive.org/web/20140709175238im_/http:/typophile.com/files/Voskens.gif)\n  \nAbout 72 point, from the ~1660 specimen sheet of B Voskens.\n\nhhp\n\n"
    },
    {
      "time": "4 Apr 2006 — 10:55am",
      "content": "I like the narrow vdKeere-style h, but have always disapproved of open gs in text faces - is there any reason to prefer them?\n\n"
    },
    {
      "time": "4 Apr 2006 — 11:39am",
      "content": "Looking at Harry Carter on Soncino, Aldus and Griffo, I was very amused by the following:\n\n\"After asserting that Francesco [da Bologna] had not only designed and cut the cursive, but had conceived the idea of it, [Gershom] Soncino claims that the punchcutter had been responsible for all the types that Aldus had printed, and that he had made Latin, Greek, and Hebrew. Francesco, whose family name was Griffo,...in 1516 repeats the claims that Soncino had made for him and accuses Aldus of taking the credit for his work.\"\n\nPlus ça change...\n\n"
    },
    {
      "time": "4 Apr 2006 — 11:43am",
      "content": "Hrant,\n\nDid you put that scroll bar in your post or did it just happen automatically by the site?\n\nChrisL\n\n"
    },
    {
      "time": "4 Apr 2006 — 11:45am",
      "content": "I did nothing special actually. It's cool though huh?\n\nhhp\n\n"
    },
    {
      "time": "4 Apr 2006 — 11:47am",
      "content": "Typophile was 'down' half an hour ago. I bet the powers have provided the scroll bars as a gift. Praise to the typogods!\n\n"
    },
    {
      "time": "4 Apr 2006 — 11:50am",
      "content": "Well at least it was the typogods and not the Dead Sea Scroll :-)\n\nChrisL\n\n"
    },
    {
      "time": "4 Apr 2006 — 12:29pm",
      "content": "\"Does anyone know about other early experiments with monster x-height?\"\n\nIt would be a good guess, that \"in the beginning\" some took larger sizes, and \"cut them down\" to work with smaller sizes of caps, something that the first image in this thread is not at all... out of sorts with, so to speak.\n\n"
    },
    {
      "time": "4 Apr 2006 — 12:37pm",
      "content": "<cite>I’d recommend tracking down previous fonts of smaller point sizes!</cite>  \nI've only just realised something: wasn't Haultin meant to be the first person to make sub-9/10 point type? If so, this would knock him right out of the niche-interest record book. And the modelling of the type actually looks very good, though Griffo seems not to have been a great pressman.\n\n"
    },
    {
      "time": "4 Apr 2006 — 12:50pm",
      "content": "<cite>It would be a good guess, that “in the beginning” some took larger sizes, and “cut them down” to work with smaller sizes of caps, something that the first image in this thread is not at all… out of sorts with, so to speak.</cite>  \nThe 1516 type would have been designed all of a piece, because it was made to start a new press. Short caps, made to blend nicely with the lowercase and especially useful before the advent of small caps, constitute a normal feature of Griffo's types.\n\n"
    },
    {
      "time": "4 Apr 2006 — 2:38pm",
      "content": "Although \"the 1516 type would have been designed all of a piece,\" is it possible that Griffo did not start from scratch but employed existing counter punches on a smaller body? The only problematic lower case character in that scenario would have been the 'g,' and the open loop—I admit I'm stretching here—might be a solution to maintaining an adequate counter in the diminished space available for the descender.\n\n"
    },
    {
      "time": "4 Apr 2006 — 3:03pm",
      "content": "No, Griffo didn't use counterpunches. No counter is repeated perfectly in a font - even the counters on ligatured versions of letters are different from the standard forms, and the two halves of an m likewise. Part of Griffo's interest is that, like the makers of Venetians, he believed in divergence, but his proportions and modelling are typographic rather than calligraphic - much more sophisticatedly so, indeed, than Garamond's.\n\n"
    },
    {
      "time": "4 Apr 2006 — 3:39pm",
      "content": "\\> have always disapproved of open gs in text  \n\\> faces - is there any reason to prefer them?\n\nI've come to believe that there is: it's much more harmonious with the \"spirit\" of the Latin lowercase as a whole; the conventional (closed) form is really too complex; especially when it's doubled it can cause a distracting spike in the texture. The way I see it, the only really valid reason to use the conventional form is: if you want the font to be as conservative as possible; or if you believe Familiarity takes a very very long time to settle down, and readers are almost inherently used to the closed form even if it has a \"belonging\" problem.\n\nIn any case, the open form couldn't be as bad as the narrowness of  \nthat \"h\" that you favor. :-\\> (That there is a display font though.)\n\nBTW, just to be clear: I'm not talking about the monocameral open form,  \nbut the bi. The mono form is way too homogenous (in terms of readability).\n\n\\> might be a solution to maintaining an adequate counter\n\nYes, that might be it.\n\nhhp\n\n"
    },
    {
      "time": "4 Apr 2006 — 3:53pm",
      "content": "\\> a distracting spike in the texture\n\nI think this depends on how the counters are shaped and strokes weighted. I think either way can work, or not work, depending on how it is drawn. That being said, I do tend to find most open binocular g's unpleasantly distracting. Baskerville's is just fine, but then it is not very open.\n\n"
    },
    {
      "time": "4 Apr 2006 — 4:02pm",
      "content": "<cite>The conventional (closed) form is really too complex</cite>  \nThe opposite seems true for me, at least in the pointed-pen Baskerville-style squiggle, which is a black form that's lost its purpose in defining a white one. But you're right, it is an odd place to put a counter, and g (thanks to Griffo's reduction of the top story's size) doesn't really need a second counter for differentiation's sake.\n\nThat h would be unforgivable in text, but it's very smart there. I hope the w is nice and wide to match, as in Deepdene.\n\n"
    },
    {
      "time": "4 Apr 2006 — 4:45pm",
      "content": "To me Baskerville's -at least the way it's  \ntypically revived- is not \"the real thing\".\n\nhhp\n\n"
    },
    {
      "time": "4 Apr 2006 — 5:00pm",
      "content": "Guys, get over it, this is the 21st century.\n\n"
    },
    {
      "time": "4 Apr 2006 — 5:10pm",
      "content": "Hrant, what do you think is the real thing, for a basically-Garalde small text type, roman and italic?\n\n"
    },
    {
      "time": "4 Apr 2006 — 5:13pm",
      "content": "Nick, the book I just put down to see your comment is 'The World We Have Lost'! I don't think we're going to agree on this. _I_ think you retain a minor-Modernist nostalgia for the present day :-)\n\nThat emoticon is a double concession: it's the first I've ever used, and I feel soiled.\n\n"
    },
    {
      "time": "4 Apr 2006 — 6:36pm",
      "content": "I don't mind Nick saying such things.  \nBut I do mind him not saying it to  \ncertain individuals, like Hoefler.\n\n\\> what do you think is the real thing\n\nAnything that's not apologetic (like most Baskervilles and Meta) but not cartoonish (like Cheltenham). I like the ones in Fountain's Baskerville, that Voskens, B&R#1/Oxford/Monticello, Zapf International's italic, Patria. Preferably with a strong terminal (at least in a serif face, but we're talking about text anyway) and definitely an obvious gap. I also prefer the top of the bottom bowl to not be uniformly thick, and certainly not totally horizontal. Like the one in Enigma is <cite>almost</cite> there.\n\n\\> it’s the first I’ve ever used, and I feel soiled.\n\nDon't feel too bad - like any tool, they can be useful.\n\nhhp\n\n"
    },
    {
      "time": "4 Apr 2006 — 7:33pm",
      "content": "_Nick saying such things._\n\nI guess I should start some threads on new type designs, but I have a feeling they wouldn't stir as much interest as Akzidenz Grotesk, The Mystery of Steile Futura, Caslon, Baskerville, Griffo etc.\n\nSo much of the mystery is in the space between technologies.\n\n_like Hoefler._\n\nI would like everyone, including you and I, to attempt greatness, quantum jumps like Futura, Palatino, Frutiger. But it's not easy, and so much is being in the right place at the right time, which is not immediately under one's control.\n\n"
    },
    {
      "time": "4 Apr 2006 — 9:41pm",
      "content": "\\> I have a feeling they wouldn’t stir as much interest\n\nIf they don't stir much interest here and now, with the  \ncommunicative power of the internet to boot, how can they  \nstir interest in the broader world, centuries or even just  \ndecades down the line? If they don't stir interest, maybe  \nit's because they're not interesting. And I posit that the  \ngreat bulk of typefaces are not interesting because they're  \nmostly expressions of the designer's personal preferences,  \nsomething nobody cares about, or really needs to. When a  \ntypeface is interesting, I feel it's because it transcends  \nthe designer and becomes evocative of something that's  \nactually important.\n\nThink for example of all the times Legato comes up and  \ngenerates such great discourse. I think it's because it  \ntries to answer a question that has been consistently  \nposed but just as consistently given mere lip service:  \nthe central role of notan in type.\n\n\\> so much is being in the right place at the right time\n\nVery true. But so much more is what different  \npeople believe, with the candid confrontation  \nbetween them being the fuel of cultural progress.\n\nhhp\n\n"
    },
    {
      "time": "5 Apr 2006 — 5:06am",
      "content": "For old-timers, impersonal greatness is the best goal, but I think the route to it lies through competence and the accurate knowledge of one's personality within the specific field. I am, at the moment, an incompetent type designer, but producing a revival at Reading should change that; it'll also help me pin down exactly what I think great and also personally resonant in Griffo's stuff - which has never been accurately revived and which deserves a numble servant to give it an honest representation to the world now. If greatness is Futura - lovely caps, pitiful lowercase - and Palatino - nicely modelled but really the opposite of civilised - then I'm not very interested.\n\n"
    },
    {
      "time": "5 Apr 2006 — 5:19am",
      "content": "\"The 1516 type would have been designed all of a piece, because it was made to start a new press.\"\n\n...several leaps of faith.\n\n\"producing a revival at Reading should change that\"\n\nThat imho, depends on whether you keep your eyes and ears open wide to let your mind out into a 490 yr old pasture. If not, and you let your assumptions run in 2006 mode, we might never hear of you again, I'm afraid ;)\n\n"
    },
    {
      "time": "5 Apr 2006 — 5:33am",
      "content": "Is Reading really such a magic bullett? Perhaps it is more what you bring to it rather than what you take from it?\n\nChrisL\n\n"
    },
    {
      "time": "5 Apr 2006 — 6:16am",
      "content": "Hi David, I've enjoyed gambolling around this pasture for several months, and have found that the effort to accept whatever Griffo made has consistently been rewarded by a new or strengthened perception of its excellence. And one's eventual feelings about what actually exists are always more reliable than those about what might exist - which is a reason for literal revivals.\n\nThe evidence that the 1516er was designed all of a piece is as good as you're going to find in this period. There was certainly a press, Griffo's first; and he would have had no opportunity to use type made beforehand, and so no motive to make it (rather than, say, imagine it in detail, or even draw it).\n\nChris, Reading's not a magic bullet, but criticism there should greatly accelerate the learning process. I'd have made this revival privately had Reading not existed, but I expect I'd have needed to take it through two or three generations and several years of trial and error before it became satisfactory.\n\n"
    },
    {
      "time": "5 Apr 2006 — 6:28am",
      "content": "George,  \nThe beauty of going to a grad school situation, and a fine one like Reading, is the community interaction of your peers there as much as the faculty. You bring your passion and love for the craft and that value will be available to your colleagues there as much as any other. Don't be afraid to question everything you hear--not to be argumentative but to get the speaker to clarify and bring support to what they say. Dialogue is the most precious commodity in school. Drink it in and pour some of your own for others. You are not going to Reading to be fixed, you are not broken. You are going there to participate in everyone's growth including your own.\n\nI am sorry to sound like a verbose old man. Go there as a partner in learning and be who you are.\n\nChrisL\n\n"
    },
    {
      "time": "5 Apr 2006 — 6:52am",
      "content": "Lovely advice; thanks Chris.\n\n"
    },
    {
      "time": "5 Apr 2006 — 7:37pm",
      "content": "Hrant, thanks for those pointers. I can see the point of something like the enigma g but with the curling loop hitting an angle and going rigid; but it'd have to be really good to be worth the loss of the familiar and satisfying counterpoint between top and bottom stories, as in the 1503 version.\n\n"
    },
    {
      "time": "5 Apr 2006 — 8:18pm",
      "content": "\\> the familiar and satisfying\n\nDo we really think laymen (as opposed to type designers who mostly naturally enjoy getting used to explicit features) are so -consciously no less- familiar with and satisfied by the closed form that they can't start reaping the benefits of the open form within an hour or whatever of first encountering it in a given text? It seems implausible to me. For example, when I show Patria to non--type-designers, nobody ever says anything about the \"g\". Most of them actually get embarassed because they have <cite>nothing</cite> to say about the face, good or bad - it's just another Times to them - but of course that \"transparency\" is the first hurdle for a text face.\n\nhhp\n\n"
    },
    {
      "time": "5 Apr 2006 — 8:28pm",
      "content": "Come come Hrant, you're usually the one who argues that those kind of details have a functional effect on immersive reading, whether or not they are deliberatively noticed.\n\n"
    },
    {
      "time": "5 Apr 2006 — 8:38pm",
      "content": "And I've been saying that the closed form is in fact worse  \nfor immersive reading, even if it has a slight \"head start\"  \nin terms of Familiarity. Also, I've been objecting to the  \nidea that the open form never gets a chance to become  \nfamiliar because the reader consciously rejects it.\n\nhhp\n\n"
    },
    {
      "time": "6 Apr 2006 — 8:25am",
      "content": "Hrant, isn't the area around the gap in the Voskens g one of too-high contrast, since thick black meets white meets thick black over such a short distance? It becomes the loudest bit of the letter, pulling it off-balance. I suppose that's arguable with vertical stress, but given the normal oblique stress of a Garalde, wouldn't one prefer the opening to be on the right rather than the left?\n\n"
    },
    {
      "time": "6 Apr 2006 — 12:38pm",
      "content": "I agree that the terminal/gap balancing in the Voskens is a bit off.  \nThere are other things I'd change too (especially if I were making  \na text face). But at least it knows what it wants, unlike the \"g\" in  \nmost Baskerville revivals (although I should note that revivals  \nof the Fry's Baskerville tend to have it much more gutsy).\n\n\\> Given the normal oblique stress of a Garalde, wouldn’t one  \n\\> prefer the opening to be on the right rather than the left?\n\nWell, first of all I'm no fan of slavish adherence to ductus,  \nquite the opposite. But let ask: do you actually mean that  \nthe gap should be on the right end of the lower bowl?\n\nhhp\n\n"
    }
  ]
}
