{
  "id": "19032",
  "title": "Atelier.jr",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is my first post to typophile. I hope it goes well!\n\nMy wife and I design houses. My last name starts with J, hers with R. Throw in a little E.F. Schumacher \"Small is Beautiful\" shizz-nizz and we have: Atelier.jr.\n\n1.\n\n ![](http://web.archive.org/web/20131021022606im_/http:/typophile.com/files/atelier_1.gif)\n\n2.\n\n ![](http://web.archive.org/web/20131021022606im_/http:/typophile.com/files/atelier_3.gif)\n\n3.\n\n ![](http://web.archive.org/web/20131021022606im_/http:/typophile.com/files/atelier_4.gif)\n\n4.\n\n ![](http://web.archive.org/web/20131021022606im_/http:/typophile.com/files/atelier_5.gif)\n\n5.\n\n ![](http://web.archive.org/web/20131021022606im_/http:/typophile.com/files/atelier_6.gif)\n\n6.\n\n ![](http://web.archive.org/web/20131021022606im_/http:/typophile.com/files/atelier_7.gif)\n\nI probably don't need to explain this in this forum, but the form of the insignia is derived from the letters a, j & r. It is vaguely reminiscent of a keyhole or archway, although I don't expect most people to notice that. Both are appropriate to the business. Which is weakest? Which is strongest? TIY.\n\n",
  "author": "cheapo",
  "time": "4 Apr 2006 — 5:43pm",
  "uid": "12331",
  "comments": [
    {
      "time": "5 Apr 2006 — 6:31am",
      "content": "5 and 6 are weakest in my opinion, the icon looks like blood drops that probably are not what a house buyer is looking for in a house design.  \nI like the icon shape in 2 and 3, but 3 (which I think the strongest) needs to have the relationship between icon and type sorted. I would also look at an alternative to the full stop, either have a space or possibly a rule dividing the words e.g. atelier|jr. On the uppercase A versions I think you need to tighten up the kerning on At.  \nTim\n\n"
    },
    {
      "time": "5 Apr 2006 — 10:36am",
      "content": "I think Tim brings up a good point - maybe experiment with a dividing device rather than a full stop. I had a look a few hours ago but didn't have time to post - I assumed on my first impression that this was web-based (.jr), having briefly skimmed the page. I'm afraid I can't really make head nor tail of the 'arch' graphic; I think you're trying too hard with it. Because of the form of the graphic, I half-read it as a letterform because at the moment it's competing with the letterforms, and the shape it has gives the impression of a letterform - therefore at the moment: 1) looks a bit like ratelier.jr, 2) looks like satelier.jr, 3) fatelier.jr and 4) patelier.jr\n\nSo, the big question is: how to resolve it so it 'works'?  \nI like the name, the divider could be a colon instead of a full stop, so it would give some meaning to the divider - it would suggest that atelier comprises jr, which seems to work (atelier:jr).\n\nIf you really don't want to lose the arch, I'd divorce it from the type so it doesn't get in the way; making it a strong symbol which sits away from the type would be one route (maybe put it in a box); another route would be to lose the arch and concentrate on a wordmark logo. I like the face you've picked, it looks rigid and strong (charcterisitcs desirable in a house!) and I don't think it would look too plain - you could play around with the divider to stop it looking too plain. The unusual suffix of 'jr' to the word already gives it a distinctive feel. Just don't make it too 'website URL' looking!\n\nHope this helps!\n\nSi\n\n"
    },
    {
      "time": "5 Apr 2006 — 1:08pm",
      "content": "I agree with the first statements, particularly that at present I instantly associate this with a URL due to the .jr. The semi-colon or vertical bar are two interesting alternatives to explore, unfortunately I don’t feel the icon works as a divider at present.\n\nI feel the icon's in #3, and #4 are the strongest. I personally like the hook on #4. I also feel that the icon needs to be moved away form the type and treated differently at this stage, because I also tried to read it as a letter at first glance.\n\nThere are kerning issues between AT and also JR. Overall, this is a robust feeling logo, with a bold colour palate which will no doubt insist on attention!\n\nBest.  \n-nic\n\n"
    },
    {
      "time": "6 Apr 2006 — 4:34am",
      "content": "I suggest one use your mark separtely for your business name and as suggested change the color so it doesn't look like dripping blood. I would also look at making some of the edges of the mark sharper, more archetectural. Your business name can stand alone.\n\n"
    },
    {
      "time": "6 Apr 2006 — 6:24am",
      "content": "Thanks for the comments. I will post a few new (and improved, I hope) versions in the next few days.\n\n"
    },
    {
      "time": "7 Apr 2006 — 12:40pm",
      "content": "Okay,  \nNobody here liked the versions where the mark divides the words. I can't help it. I still like it! Colour-wise, the red is just a placeholder. I envision changing it from time to time, but I will stay away from blood red. (At least until we achieve such a high level of recognition that such confusion is impossible. ...I kid, I kid.)\n\nI did futz with the kerning and changed to pure magenta for the time being.\n\n ![](http://web.archive.org/web/20131021022606im_/http:/typophile.com/files/atelier_9.gif)\n\nIf I could, I would definitely register atelier.jr, but alas, there's no such TLD  \nThanks all!\n\n"
    },
    {
      "time": "8 Apr 2006 — 3:02am",
      "content": "Position and colour of the mark aside, I'm afraid that your kerning is too tight, if you take the spaces around the e of ier (because it is a round character surrounded by verticals and cannot go much tighter) as the base, then the spaces between other letters should reflect the amount of white space around the e rather than have an equal space measured on the two closest points of the letters. I think you should loosen the space between At, li, and jr and tighten el, these should be only slight adjustments.  \nTim\n\n"
    }
  ]
}
