{
  "id": "19036",
  "title": "Korean font recommendations",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Can anyone recommend, or give me advice on, existing Korean OpenType or TrueType fonts?\n\nI am looking for typefaces that have Hangul, Hanja and Western characters... Also, I am looking for one family of three weights that could be used as the visual equivalent of a sans serif face, and another family, also of three weights, that could be used as the equivalent of a serif face, if that makes any sense.\n\nSo far I have only had some luck searching on the [Linotype](http://web.archive.org/web/20150218044739/http:/www.linotype.com/webshop/view.linotype?viewmode=search&searchFields%5B%5D=0&searchFields%5B%5D=2&PHPSESSID=cb342d00773ea7b59a5f6423d5f8c985&ACT=quicksearch&searchLogic=and&searchContent=true&wildcard=1&searchType=as_families&GROUP=&DISPLAYC=full&searchTerm=korean) site (but they only have two weights of each face) and the [Monotype](http://web.archive.org/web/20150218044739/http:/www.monotypeimaging.com/ProductsServices/wt_fontsample.aspx?type=korean) site (they don't sell their non-Latin fonts online, but they don't reply to the form they ask you to fill out, either!).\n\nAny tips on other foundries or distributors will be greatly appreciated.\n\nThanks in advance!\n\n",
  "author": "Ricardo Cordoba",
  "time": "4 Apr 2006 — 9:56pm",
  "uid": "7716",
  "comments": [
    {
      "time": "5 Apr 2006 — 12:14am",
      "content": "As far as I know, Korean font vendor websites are not easy to use for those who don't speak Korean. So I'll just list a couple of major foundries and a selection of recommended fonts. I'm only listing the more traditional text faces, although if you are looking for a specific style then I could help you with that. All of these include Hangul, Hanja, and Western coverage (although I haven't checked for every single weight), and all are available in TrueType. I'm guessing most are available in OpenType as well.\n\nSandoll - [http://www.sandoll.co.kr/](http://web.archive.org/web/20150218044739/http:/www.sandoll.co.kr/ \"http://www.sandoll.co.kr/\")  \nSandollmyeongjo(산돌명조) is the foundry's flagship serif-type face.  \nJebi(제비) is a more modern serif-type face that I admire.  \nSandollgodik(산돌고딕) is a sans-serif-type face.  \nEach of these comes in three weights.\n\nYoon Design - [http://yoonfont.co.kr/](http://web.archive.org/web/20150218044739/http:/yoonfont.co.kr/ \"http://yoonfont.co.kr/\")  \nThe Yoonmyeongjo (윤명조; serif) and Yoongodik (윤고딕; sans serif) series come in an impressive array of weights and proportions. Yoonmyeonjo is probably the most used text face family in Korean publishing today because of its versatility.\n\nAsia Font - [http://www.asiafont.com/](http://web.archive.org/web/20150218044739/http:/www.asiafont.com/ \"http://www.asiafont.com/\")  \nThe Asia bonmunmyeongjo (Asia본문명조; serif) and Asia bonmungodik (Asia본문고딕; sans serif) families each offer six weights.\n\nSM Font - [http://www.smfont.com/jikjisoft/html/font\\_sm.htm](http://web.archive.org/web/20150218044739/http:/www.smfont.com/jikjisoft/html/font_sm.htm \"http://www.smfont.com/jikjisoft/html/font\\_sm.htm\")  \nThe SM3 Font family includes 7 weights of serif faces and 6 weights of sans serif faces. I prefer the SM3 family over the SM2 family due to its better spacing and better Latin components. Both are included as part of the SM font package, and the website doesn't seem to sell each family separately.\n\n[This PDF document](http://web.archive.org/web/20150218044739/http:/www.bitinfor.co.kr/pdf/Adobe%20Bundle%20font.pdf) showcases the fonts that come bundled with the Korean edition of Adobe InDesign, which include most of the fonts I've mentioned.\n\nI can do more research if you need on the pricing and ordering.\n\n"
    },
    {
      "time": "5 Apr 2006 — 9:43am",
      "content": "Brian,\n\nThank you so much for listing all of this info! :-)\n\nI'll check everything out; this is very useful... And thanks for offering to do research on pricing and ordering -- I have a couple of co-workers who speak Korean, so they might be able to help out with that part. No need for you to spend more time on this! :-)\n\nThanks for the tip and the PDF about the Korean edition of InDesign, as well.\n\nBest regards,  \nR.\n\n"
    }
  ]
}
