{
  "id": "19035",
  "title": "Kerning Exercises",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "i would like to improve upon my typesetting skills. I have never really come across any specific \"drills\" per say that aid one in understanding letterspacing properly, but I was curious if anyone has any suggestions. Overall, I can do it rather well, but I do struggle with some aspects spacing.\n\n",
  "author": "track and kern",
  "time": "4 Apr 2006 — 9:00pm",
  "uid": "11282",
  "comments": [
    {
      "time": "4 Apr 2006 — 9:33pm",
      "content": "Ellen Lupton has a [companion website](http://web.archive.org/web/20140908123151/http:/www.thinkingwithtype.com/) to her book, _Thinking with Type_, that has plenty of good examples and comparisons of different settings to look at: the subjects covered under \"Text\" are kerning, tracking, line spacing, and alignment. They are not drills, but still a useful resource.\n\n"
    },
    {
      "time": "4 Apr 2006 — 9:52pm",
      "content": "Here's what I learned from the great John Langdon about kerning:  \n1. Visually center each letter between its surrounding two letters.  \n2. Make sure recurring negative spaces are spaced exactly the same.  \nFor example in the word \"miniature\", the mi should have the same kerning as the ni, since the negative space between those pairs are identical.\n\n"
    },
    {
      "time": "4 Apr 2006 — 11:13pm",
      "content": "For fun, interactive flash-based online kerning exercises [**here.**](http://web.archive.org/web/20140908123151/http:/typography.art.udel.edu/) A note of warning, take the \"correct\" answers with a grain of salt, some of them are WRONG. None the less it's a cool and interactive way to improve your kernin' :^)\n\n"
    },
    {
      "time": "5 Apr 2006 — 12:44am",
      "content": "There is a nifty online interactive kerning exercise and I'm sure it was mentioned on Typophile at some point. Stick around - someone has the link.\n\n"
    },
    {
      "time": "5 Apr 2006 — 2:09am",
      "content": "Stephen, is there another one apart from the one I linked above?\n\n"
    },
    {
      "time": "5 Apr 2006 — 2:49am",
      "content": "Searched through my bookmarks again and recalled another great interactive site where you can learn to spot bad kerning.\n\n[typehype.net](http://web.archive.org/web/20140908123151/http:/www.typehype.net/) by Jeanne Komp, related Typophile thread [here](http://web.archive.org/web/20140908123151/http:/www.typophile.com/node/16534) [.](http://web.archive.org/)\n\n"
    },
    {
      "time": "5 Apr 2006 — 3:23am",
      "content": "Whoops! Completely overlooked your post, Geoff. That's the one.\n\n"
    },
    {
      "time": "5 Apr 2006 — 12:12pm",
      "content": "_Exercises_ become more productive when you do them routinely in life. Refining your typographic skills and awareness is just like learning to play the piano (or other instrument)... if you don't practice, you simply will not get any better!\n\nLuckily, kerning is less difficult a skill to refine than learning to fine tune the color of text. Yes, learning to visually balance kern pairs in lines of copy goes hand-in-hand with text color, since imbalances in inter-letter spacing disrupts eveness of color.\n\nBut even when all the kerning is \"correct\" (visually balanced), the color of text blocks can still be off or can be improved. This is a skill more difficult to refine let alone be aware of.\n\nFor a while I have been reviewing graphic design and typography curriculum for assignments and exercises to improve type color awareness, and I haven't seen many at all. If anyone is aware of such useful programs, I would greatly appreciate hearing about them.\n\nSince I don't believe graphic design students take much time scrutinizing, proofing and adjusting typesetting output (high-res hardcopy), I don't feel they can develop a higher awareness of text color and the subtleties of texture, flow and weighting.\n\nI think I have come up with a short and simple series of exercises/assignments (three sequential activities that I hope to present at TypeCon) that would help bring text/type color sensitivities to students. I think they will definitely learn about color, but getting better at any skill is a matter of sustained practice.\n\n"
    }
  ]
}
