{
  "id": "1903",
  "title": "Pairing Typefaces & Designing for Screens/Web",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "This is a question that has plagued me ever since my earliest days in web design. Until now, I had not a forum where I could pose it.   \n   \n**Background**   \nMost of us are more than familiar with the concept of font/typeface pairing in graphic/communication design to provide contrast and visual interest. Weather that constitutes two faces from different type classifications (e.g., a serif and a sans-serif or a gothic and a handwritten, etc.) or two or more font variations from one typeface family (e.g., a condensed and a regular width or a heavy and a thin, etc.) is up to the designer.   \n   \nGenerally speaking, we've been taught, advised or simply learned through experience that two fonts/faces provide the best results. Not to say that one cannot use more than two or just one, but one too often we see the schizophrenic or mundane examples of both extremes. Which brings me to my question\n\n",
  "author": "timfm",
  "time": "31 Oct 2003 — 4:07pm",
  "uid": "1235",
  "comments": [
    {
      "time": "1 Nov 2003 — 6:14am",
      "content": "My feeling with the limitations of the web is to create a CI based on colors and/or graphics. Let the logo stand alone and don't force the content on the web into your CI. Most people go to a site for content not CI reinforcement, so if it feels like the printed collateral and provides the information the person is looking for I feel that is as much as you can expect. Dan\n\n"
    },
    {
      "time": "2 Nov 2003 — 1:46am",
      "content": "oops, ignore this post\n\n"
    },
    {
      "time": "2 Nov 2003 — 6:32am",
      "content": "Joseph, I'd advise keeping the flash graphics to a minium. Everyone that I know, if they have the option to bypass the flash screen they do. Flash sites are annoying in general. This is just my opinion, Dan\n\n"
    },
    {
      "time": "3 Nov 2003 — 4:14pm",
      "content": "I would have to concur with Daniel here. I'm a [web standards](http://web.archive.org/web/20131018121702/http:/www.webstandards.org/) advocate. Flash will never replace web standards. No matter what Macromedia does, Flash will never be as accessible, SE friendly, or scalable as some combination of W3 standards based technologies.   \n   \nThe fact remains that it is a plug-in, it's binary, and it's cpu intensive. For a targetted demographic, motion graphics, and rich media applications it's feasable, but for regular web publishing -- there's no comparison. I would go as far as to say that when wider SVG support is a reality, that Macromedia will have the forsight to leverage it in spite of SWF.   \n   \nDon't get me wrong, I'm not Flash bashing. You can do some amazing things with it and I've always enjoyed working with Flash. It's just that it's often used inappropriately and considered by many to be some sort of magic bullet.   \n   \nWhat's all this have to do with typography anyway? ![:-)](http://web.archive.org/web/20131018121702im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "4 Nov 2003 — 10:17am",
      "content": "Tim, have you ever seen the book \"Fresh Styles for web designers\" by curt cloninger from New Riders. It gives good examples of different styles of web sites. Dan\n\n"
    },
    {
      "time": "4 Nov 2003 — 1:52pm",
      "content": "Dan -- I've heared of it but never actually looked inside. I'll check it out next time I'm at the book store. I supposes it may it some ways address my original query.   \n   \n -t\n\n"
    },
    {
      "time": "2 Nov 2003 — 12:34am",
      "content": "Tim, thanks for articulating this. I was struggling to answer John Hudson's post in the [\"Line Lengths\"](http://web.archive.org/web/20131018121702/http:/www.typophile.com/forums/messages/30/19321.html) thread. I think I'll direct him here as it really relates to your #1 above (where all HTML-text sites are really the only instances where spec'ing points and ems makes absolute sense).   \n   \nI would add:   \n   \n4. Image + Flash + ASCII\n\n"
    }
  ]
}
