{
  "id": "19048",
  "title": "Keyboard Leyout problems for MAC",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi.  \nIt was easy to prepare keyboard layout for Windows using Microsoft Keyboard Layout Creator (theres no abkhazian language and keyboard layout in system). But now I want to prepare the same Unicode OT fonts for Mac, but cant find the tool to create layout. What to do? IS there any application like MKLC but for MAC.  \nThanks\n\n [‹ Can FontLab Scripts Manipulate Metrics/Kerning Classes?](http://web.archive.org/web/20081015001008/http:/www.typophile.com/node/39898 \"Go to previous forum topic\") [Greek terminological question ›](http://web.archive.org/web/20081015001008/http:/www.typophile.com/node/39832 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081015001008/http://www.typophile.com/user/11444\" title=\"View user profile.\">Akhra</a>",
  "time": "<br>",
  "uid": "11444",
  "comments": [
    {
      "time": " 5.Apr.2006 9.58am",
      "content": "There is a little flag icon on the top right of your menu bar. It is the flag of the language you are using. Click on it and select a new language. Your keyboard will now be mapped to that language.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Apr.2006 11.06am",
      "content": "I think Akhra is saying MacOS doesn’t support Abkhazian out  \nof the box for him to select it - so he needs to actually make a  \nkeyboard for it. I used to use ResEdit for that with great success,  \nbut it doesn’t work on OSX. :-(\n\nBTW, is Tibetan (script and keyboard) supported on OSX?  \nIf not, is there a good relatively inexpensive font that does?\n\nhhp\n\n"
    },
    {
      "time": " 5.Apr.2006 1.25pm",
      "content": "See this wonderful site [[link](http://web.archive.org/web/20081015001008/http:/www.alanwood.net/unicode/utilities_fonts_macosx.html)].  \nMostly all information you need to produce Unicode keyboard layout for your language is there.  \nBig thanks goes to Mr. Alan Wood... :-)  \nI suggest using Google to find information about your language usage on computers before. May be it’s already done for OS X ...\n\nFrom this page:  \n“Ukelele provides a graphical interface for creating or modifying Unicode keyboard layout files for Mac OS X 10.2 onwards. It allows you to start from scratch, or to modify an existing keyboard. Characters can be dragged from the Character Palette, or from other programs that can display the characters that you want to use.”\n\n"
    },
    {
      "time": " 5.Apr.2006 1.29pm",
      "content": "WOW!!!\n\nChrisL\n\n"
    },
    {
      "time": " 5.Apr.2006 1.32pm",
      "content": "Akhra:  \n [Ukelele – Mac OS X Keyboard Layout Editor](http://web.archive.org/web/20081015001008/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&id=ukelele)\n\nHrant:  \n [Lungta](http://web.archive.org/web/20081015001008/http:/www.typojo.com/) by Jo De Baerdemaeker  \n [Tibetan Language Kit](http://web.archive.org/web/20081015001008/http:/www.xenotypetech.com/osxTibetan.html)  \n [THDL: Tibetan & Himalayan Fonts and Input Tools](http://web.archive.org/web/20081015001008/http:/www.thdl.org/tools/allfonts.html)\n\n"
    },
    {
      "time": " 5.Apr.2006 2.07pm",
      "content": "Great stuff all around! Thanks guys.\n\nMiguel: The Armenian eternity symbol, eh? Cool.\n\nhhp\n\n"
    },
    {
      "time": " 5.Apr.2006 11.17pm",
      "content": "Yep. To infinity, and beyond! _(Buzz Lightyear)_ ;^)\n\n"
    },
    {
      "time": " 6.Apr.2006 7.19am",
      "content": "Thank, Miguel. Thanks all.  \nUkelele is realy what I need.  \nIts true, abkhazian language have no input in or . So if you make a font using proper unicode places for national characters you need to create special keyboard layout until Microsoft and Apple dont include it oficialy.  \nThanks again.  \nAkhra.\n\n"
    },
    {
      "time": " 8.Dec.2007 9.10am",
      "content": "I am a Mac novice, forgive my terminology ignorance. I have created a custom keyboard layout for Hungarian using Ukelele. It works great. The question is: How to create a custom flag to show up when this keyboard layout is activated? The reason being that I also need to make a custom Ukrainian layout and want to be able to distinguish them easily (Custom, because I just don’t like and am not used to the default layouts).\n\n"
    }
  ]
}
