{
  "id": "19040",
  "title": "Another Sans ?",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi all,\n\nI know this is another sans, and they don't seem to go down to well, but I've come this far and would really appreciate some feedback on Depot.\n\n[**Depot pdf.**](http://web.archive.org/web/20150123125119/http:/homepage.ntlworld.com/c.dickinson40/Depot.pdf)\n\nsc.\n\n",
  "author": "coop",
  "time": "5 Apr 2006 — 1:43am",
  "uid": "5642",
  "comments": [
    {
      "time": "5 Apr 2006 — 1:59am",
      "content": "I for one don't have a problem with another sans. just looked over yours briefly, two things caught my eye:\n\nlc d  \nthe lower left part feels a bit odd on close inspection, should be a tad smoother/the curve feels a tad too sharp IMO.\n\nlc k  \nthe rounding feels odd, too quirky/too fancy, i think a straight lc k without any roundings would serve you better.\n\njust my tuppence though.\n\n"
    },
    {
      "time": "5 Apr 2006 — 2:20am",
      "content": "franzheidl,\n\nThanks for the response.\n\nlc d\n\nDo you refer to the roman or italic version ?\n\n"
    },
    {
      "time": "5 Apr 2006 — 2:55am",
      "content": "coop, esp. the roman, that problem seems to be reduced in the italic due to it's slant.\n\n"
    },
    {
      "time": "5 Apr 2006 — 8:09am",
      "content": "I liked the curved leg of the lc k, but I didn't see that design applied to any of the other characters so I would go with franz's idea of a straight leg, either that or maybe look at applying that to some other characters? Overall this seems like a very solid typefamily here, but is missing that 'something\" that makes it unique, and it could just be a little touch to some of the characters. Keep in mind I am not a type designer, I'm a graphic designer. I think you have the basis of what could be an excellent type family, like I said it seems like it's missing something...\n\n"
    },
    {
      "time": "5 Apr 2006 — 8:57am",
      "content": "Chris,\n\nThanks for the input, I like the lc k as well but I do see what you mean about it being on it's own. I did think about using it on other characters but I didn't want to shoehorn it in so I could keep the lc k.\n\nI'll post further updates.\n\nsc.\n\n"
    }
  ]
}
