{
  "id": "19061",
  "title": "URGENT: Why buy Helvetica in Open Type over TT or Postscript?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Please excuse my ignorance and the urgency (need to make comps with helvetica and don't own the appropriate weights to please the client), but...\n\nwhat exactly are the benefits of having Helvetica in OpenType against TT, when (1) I design in English and (2) Mac OSX supports TT.\n\n**Is there some other reason to purchase specifically Helvetica in OpenType format?**\n\n",
  "author": "Kevin Wang",
  "time": "6 Apr 2006 — 12:04am",
  "uid": "12353",
  "comments": [
    {
      "time": "6 Apr 2006 — 12:19am",
      "content": "(3) Cross-platform, the font file will work on both PC and MAC.\n\n"
    },
    {
      "time": "6 Apr 2006 — 12:21am",
      "content": "Kevin, to answer your question, there is no short-term need for you to license the OT version of Helvetica instead of the TT version.\n\nOT's benefits are often long-term, esepecially for customers in the US who primarially only design in English (or occassionally Spanish). Some OT fonts are packed with features, including extra ligatures, small caps, old style figures, etc. But Helvetica is not one of those. Helvetica's OT strong suit is language support.\n\nFonts are with us for years. Who knows what clients a designer will have five years down the line. Can you rule out that you'll never have to set a block of text in Hungarian, Polish, or Czech?\n\n"
    },
    {
      "time": "6 Apr 2006 — 12:21am",
      "content": "No, I can't rule out the possibility, so I agree I need to deliberate some more-- but at least extra ligatures, &c., isn't a point of deliberation anymore: thanks to you, Dan.\n\n"
    },
    {
      "time": "6 Apr 2006 — 12:36am",
      "content": "Regarding languages: if you only need a few basic weights, the best language-supporting version of Helvetica is Helvetica World (on the Linotype website, you can find all three versions of Helvetica, in all available font formats).\n\nIt is a bit more expense, but Helvetica World is an OT font family whose fonts have enormous character sets. Inside are glyphs covering all Western, Central, and Eastern European languages that use the Roman alphabet (including Turkish and the Baltic languages). Vietnamese, with its stacked accents, is also supported, as are Greek, Cyrillic, Hebrew, and Arabic. There are also some border-building ornaments in the character set.\n\n"
    },
    {
      "time": "6 Apr 2006 — 11:34am",
      "content": "I'm able to purchase Helvetica Std in OpenType format, which is cheaper than Helvetica Pro, assuming I am not doing any foreign language work in the foreseeable future, should I plump for Std?\n\n"
    },
    {
      "time": "6 Apr 2006 — 12:06pm",
      "content": "The only advantage to Pro over Std as I see it is the CE language support.\n\n"
    },
    {
      "time": "6 Apr 2006 — 12:13pm",
      "content": "Last question, and then its off to spend money. Is it worth the extra $200 to purchase Helvetica Std in OT over TT for, say, printing reasons?\n\n(btw, Dan, if you ever are in Los Angeles on business, I owe you a few litres of beer)\n\n"
    },
    {
      "time": "6 Apr 2006 — 12:19pm",
      "content": "I don't think there is any visible difference between OT, PS, and TT outlines in print. Very old film makers might have problems, but that is unlikely. I think that the whole PS vs. TT thing has become more of an urban legend among designers. I seem to recall Adobe and Microsoft staff repeating in online forums again and again that the whole \"PS = Print and TT = Screen\" thing is a myth (although TT fonts can have better onscreen hinting).\n\nIf you buy the TT fonts, and you use a Mac, I'd recommend buying Mac TT and not PC TT. I know that you can install PC TT fonts on Mac OS X, but it isn't recommended, and I don't think that anyone offers you tech support on that; it is a work-around, not a solution. OT fonts, on the other hand, are really cross-platform.\n\n"
    },
    {
      "time": "7 Apr 2006 — 6:53pm",
      "content": "_I know that you can install PC TT fonts on Mac OS X, but it isn’t recommended_\n\nWhy isn't it recommended, Dan? For all I was under the impression that PC TrueType fonts are, in fact, simply TrueType flavored OpenType fonts. Using your line of logic, OT fonts are also a work around. (Somebody correct me if I'm wrong!)\n\n"
    },
    {
      "time": "7 Apr 2006 — 8:38pm",
      "content": "i can tell you right now that using postscript and truetype helveticas in incopy/indesign from PC--\\>MAC--\\>PC is a\n\n**NIGHTMARE**\n\nhaving opentype would have saved us HUNDREDS of hours of work\n\n"
    },
    {
      "time": "7 Apr 2006 — 10:30pm",
      "content": "_Why isn’t it recommended_\n\nThe on-screen rasterization is screwy.\n\n"
    },
    {
      "time": "9 Apr 2006 — 8:46am",
      "content": "_The on-screen rasterization is screwy._\n\nInteresting... I hope someday all these kinks with Apple and OpenType are ironed out! It seems to me that they're dragging their feet on really supporting the format well. Maybe they're planning to issue their own competing format in the future? :^/\n\n"
    }
  ]
}
