{
  "id": "19075",
  "title": "skywriting?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi, I'm looking for a simple dotted font that could work for skywriting. I've tried in Photoshop to make dots over a template but I'm wearing out. I've googled and searched this site. I'm attaching one attempt at using a stripey font (Labtop Tartan--not one of your more elegant fonts...) but I'm not impressed.\n\nThanks--I'm new to this site but I've loved fonts for 30 years--I knew typography was a profession but I didn't know it was such an official obsession.\n\n ![](http://web.archive.org/web/20141012212414im_/http:/typophile.com/files/bluesky.jpg)\n\n",
  "author": "jokebo",
  "time": "6 Apr 2006 — 11:21am",
  "uid": "11227",
  "comments": [
    {
      "time": "6 Apr 2006 — 11:57am",
      "content": "I'm afraid you're not going to find a font that will be convincing on its own. Applying the effect to soft font like [Bryant](http://web.archive.org/web/20141012212414/http:/www.fontshop.com/showfont.cfm?fid=PRC.123369.0.0) is the best way to go.\n\n"
    },
    {
      "time": "6 Apr 2006 — 12:03pm",
      "content": "Reminds me of an old typeface from Casady & Greene called Giotto. But, now that I've found it, the A and K are completely different. Looks to me like they used step & repeat on a blue line to create this effect.\n\n"
    },
    {
      "time": "6 Apr 2006 — 12:03pm",
      "content": "You could perhaps use [Handsome,](http://web.archive.org/web/20141012212414/http:/www.myfonts.com/fonts/shinn/handsome/) it's a fully-connected OpenType script that has a range of monoline weights.\n\nMaybe take the Thin, convert to outline and texture-paint the path in Illustrator with dots, then import into PS and blur.\n\n"
    },
    {
      "time": "6 Apr 2006 — 12:17pm",
      "content": "I recommend you to experiment with different \"cloudy\" photoshop-brushes and draw the text by hand. Some irregularity is a good thing here.\n\n"
    },
    {
      "time": "6 Apr 2006 — 1:44pm",
      "content": "You haven't a clue about sky writing its not a continious line like the old biplanes. What they do is make a series of dashes that form letters as they fly. An example would be an I being created from four verticle dashes with space in between each. A N would be the same four verticle dashes but with one dash after it at the number 2 level and another at the number 3 level then 4 more dashes. I will see If I can find an example I made a number of years ago in Photoshop.\n\n"
    },
    {
      "time": "6 Apr 2006 — 7:13pm",
      "content": "Use some cloud brushes - there's some great ones [here.](http://web.archive.org/web/20141012212414/http:/share.studio.adobe.com/axQuickSearchSubmit.asp?txt=clouds&allprods=2&submit1.x=32&submit1.y=8)  \nThen mask the layer with a font you like.  \nThen gaussian blur the mask to soften it a little and use soft brushes in the mask to make some irregularities…\n\npeace\n\n"
    },
    {
      "time": "7 Apr 2006 — 4:32am",
      "content": "Thanks to all--I will try out the cloud brushes.\n\n"
    }
  ]
}
