{
  "id": "19077",
  "title": "Mixing different sizes of same font within an editorial layout",
  "forum": "Design",
  "tags": [

  ],
  "content": "Can anyone justify the use of making specific word(s) within sentences bigger? I have a page of text, set in two columns. The writer and I want to call out specific phrases. The layout I’ve generated does this: Garamond 11pt throughout but 2-3 word phrases are 16pt. Leading is 14pt throughout. I see this used in many publications and in advertisements all the time. Most everyone here likes it. But there are a few conservative folks who find it distracting. Anyone know of articles from typographers or designers discussing mixing big and small sizes together? Thanks so much.\n\n [‹ skywriting?](http://web.archive.org/web/20081007112308/http:/typophile.com/node/19075 \"Go to previous forum topic\") [Typeface Suggestions for Funkstyle Dance Crew Ligature ›](http://web.archive.org/web/20081007112308/http:/typophile.com/node/19062 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007112308/http://typophile.com/user/12367\" title=\"View user profile.\">nonprofitGirl</a>",
  "time": "<br>",
  "uid": "12367",
  "comments": [
    {
      "time": " 6.Apr.2006 3.54pm",
      "content": "Typically, negative leading (16/14) is only used in the case of titling or headlines, when it is easier to control how ascenders and descenders are going to (not) collide. {I recommend Bringhurst’s The Elements of Typographic Style as a great reference.}\n\nI think you can make a case for just about anything, however, if you feel strongly that your typographic decisions are not impeding legibility. In two columns, however, I can’t imagine that your text is going to maintain its structure as far as typographic color is concerned.\n\n"
    },
    {
      "time": " 6.Apr.2006 4.04pm",
      "content": "\\_Critique\\_ magazine (and \\_Cream\\_ as well) had a clever way of doing callouts. Instead of repeating the callout from the text, copying and pasting and enlarging elsewhere, they would enlarge the text as it read. Visually it looked like a callout, but it read as part of the main text.\n\n"
    },
    {
      "time": " 6.Apr.2006 4.32pm",
      "content": "The new design for STEP magazine successfully uses different sizes of body text. Take a look at it and see if you can apply the same ideas and share it with other people, get their thoughts on it.\n\n"
    }
  ]
}
