{
  "id": "19084",
  "title": "Tippecanoe",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello, I am looking for an enlightenment on [W.A. Dwiggins](http://web.archive.org/web/20140830150329/http:/typophile.com/wiki/William%20Addison%20Dwiggins)' \"Tippecanoe\",  \nBest regards.\n\n",
  "author": "Alessandro Segalini",
  "time": "7 Apr 2006 — 6:46am",
  "uid": "9599",
  "comments": [
    {
      "time": "7 Apr 2006 — 9:47am",
      "content": "It was an unconventional Bodoni which Dwiggins worked on for a while but was never released publicly. It had the working numbers of #283 and #268.\n\nIt strikes me, perhaps, as a different sort of experiment with the marionette theory. I have images somewhere, I just can't find them at the moment.\n\nWhy are you interested?\n\n"
    },
    {
      "time": "7 Apr 2006 — 9:56am",
      "content": "This is from my notes taken at the Boston Public Library. Transcribed from a hand-written letter which I thought to be a rough draft. There was no date on the note, but there are some numbers and proofs mentioned which could give hints of a date if I weren't too lazy to back track in my notes. When I was transcribing I did my best to keep all punctuation and words that Dwiggins used. The brackets are mine.\n\n- - - -\n\n[Pg. 1]\n\nWhen you spoke of turning the Modern Face Dept over to Rudolph you were not (I trust) warning me to keep my hands off that end altogether? Because I can’t resist the temptation to twiddle with the idea behind the Bodoni-Didot experiment – I keep turning the picture this way and that to see how one might cure the trouble of the 268 efforts ‘f’ and, consequently, cure the trouble in the Bodoni, which the 268 stuff paralleled too closely. There is a better letter than Bodoni in that pigeon-hole if one could only get salt on its tail… Maybe Rud’s try fetches it, but I am not quite sure.\n\nThe word to describe all the Bodoni modifications – Lino, Mono, even the Bauer “original” – is stodgy. They make a book stiff and lifeless. I often want for a book the color and tone that a Bodoni-class type would provide, but can’t get it with our present outfit.\n\nMy lead on this Dec 6 Packet\n\nAll this modified into a formula – not copied precisely from pen letters, but worked out in terms of a metal punch all the time. Judging from what came through in the 7 pt [x x x] there is a chance that a lot of this would come through, unseen, in 12 pt. You don’t want to see it, as detail, but you want it to all build up into an influence that gives motion to the line.\n\n[Pg. 2]\n\nMy lead in this Dec packet is the action of a fine flexible steel pen. This steel pen action is quite close to the motion produced in a line of lettering by the buren on copper (to reproduce which “look” was, of course, the yen behind the Didot types.)\n\nOne trouble of the Bodoni class of types, when they get together into words, is the [something unreadable] rigidity, of course, ruled lines and compass curves – but the main “action” trouble is in the spring of the arches and loop-elements away from the stems. In all the Bodonis this motion is always ugly – all the fawn-like grace of a galloping cow. If one could only get a type-metal equivalent of the nervous, pen-formed action in these places (i.e. the free-hand motion properly modified to fit type conditions, so it can be repeated all over a page without giving you [gum, gem, gun ?] jams) I think the letters would swing together into words and march. Getting a curve-formula that is both free, and yet not so free that it is unsuitable for type, is the job.\n\nThe actual 12 pt is the only way to tell whether a curve-formula works or not, but after our success with 7 pt 2[big space, might have not finished writing] where such a formula certainly did work, I think there is a way to get life and nervous motion into the Didot kind of letter and still have it suitable for body-matter set.\n\nAnyway, here is another crack at it – and you can put it aside, or try it, just as you think best.\n\nYour eye will light on these details – swelled stem, such as a fine soft pen makes (Didot did it), stem not too rigid: motion in it – trick with serifs, something like our one-time “butterfly tie” idea; aiming to get a sharp click of serif, and yet not rigid. – the pen-snap – in the arched element --\n\n"
    },
    {
      "time": "7 Apr 2006 — 10:59am",
      "content": "[http://www.tahoecountry.com/macrae/8.gif](http://web.archive.org/web/20140830150329/http:/www.tahoecountry.com/macrae/8.gif \"http://www.tahoecountry.com/macrae/8.gif\") - look closely at this photo and you can clearly see Matthew Carter, WAD and Robert Norton in the canoe in the foreground on Lake Tahoe. Taken in 1912 I believe this gathering was where both the font names Tippecanoe and Tahoma came from.\n\nMore on the resort... [http://www.tahoecountry.com/oldtimetahoe/images/tahomaresort.jpg](http://web.archive.org/web/20140830150329/http:/www.tahoecountry.com/oldtimetahoe/images/tahomaresort.jpg \"http://www.tahoecountry.com/oldtimetahoe/images/tahomaresort.jpg\") ... where you can see that the design of Tahoma was influenced by the signage.\n\n"
    },
    {
      "time": "7 Apr 2006 — 11:03am",
      "content": "AHAHA!\n\n"
    },
    {
      "time": "8 Apr 2006 — 11:30am",
      "content": "So what's the official story on the name? I assume it's related to Tippecanoe county Indiana?\n\n"
    },
    {
      "time": "10 Apr 2006 — 7:50am",
      "content": "Thank you very much, I will read your line through later. I am co-writing an article title \"Bodoni's Typographical Heritage\" and we are sorting out different existing cuts.\n\n"
    },
    {
      "time": "10 Apr 2006 — 8:43am",
      "content": "Si -- I believe that I have that information at home with my other notes. I'll dig that out just for you. :^)\n\nAlessandro -- ...and you'll send a copy to me?\n\n"
    },
    {
      "time": "10 Apr 2006 — 9:44am",
      "content": "Tiffany, those transcriptions are spectacular. I especially like the stuff about the 'steel pen action' in relation to 'ruled lines and compass curves'. (Nick, remember our interchange about the 'scheme' for Bodoni?)\n\nWhy isn't there a 'collected writings' (or is there)?\n\nWhy did the project stall?  \nAre there drawings to accompany the argument?\n\n ![](http://web.archive.org/web/20140830150329im_/http:/typophile.com/files/%5D%5Bimg:)\n\n"
    },
    {
      "time": "10 Apr 2006 — 1:52pm",
      "content": "Okay Tiffany, it will be on this magazine, no. 8: [http://www.aiap.it/progettografico.php](http://web.archive.org/web/20140830150329/http:/www.aiap.it/progettografico.php \"http://www.aiap.it/progettografico.php\")\n\n"
    },
    {
      "time": "10 Apr 2006 — 3:50pm",
      "content": "Grazie, Alessandro.\n\n"
    },
    {
      "time": "17 Apr 2006 — 3:44am",
      "content": "Dear Tiffany, do you have a more precise bibliographic reference for your interesting yet somehow amazing notes ?\n\nIs the name truly related to Tippecanoe country in Indiana USA, as Simon Daniels assumed ?\n\nThanks very much.\n\n"
    },
    {
      "time": "17 Apr 2006 — 8:51am",
      "content": "I can't find anything on the name ... yet. The problem with finding too much info on this subject is that I didn't focus on this typeface in my dissertation. I do believe I have more information, it is just a matter of finding it.\n\nFrom the notes I have here, it began as #268 on/around March 18, 1942 and ended as #283 on July 18, 1945. The fact that there was any sort of type design happening during the war is amazing to me anyway. But, I think Linotype might have been looking toward the future.\n\nIn the notes I have C.H. Griffith seems positive about the type as it is being developed. The drawings were returned to Dwiggins with a letter dated October 11, 1945 by Helen Jagau, C.H. Griffith's assistant. Note these were the A-Z cap italic drawings. I need to find my proof notes. I don't recall if this was completed or not. She states with these drawings and #269 (Eldorado), \"Mr. Griffith suggests that you put these away pending such time as we are able to proceed with the cutting of the experimental characters.\"\n\nIn a letter written sometime in 1942, Dwiggins refers to it as \"268 Didot-Bodoni, 9 pt.\" So even at this time the name had yet to be given. Further on in the letter he states, \"A new statement on the theme, but no soap yet.\" They were still working on it and he had yet to see it take full form.\n\nI believe I have a folder with information from Dwiggins archives at Kentucky in my notebooks at home. Mi dispiace. I'm sorry that I haven't gotten to this yet for you.\n\n"
    },
    {
      "time": "17 Apr 2006 — 9:03am",
      "content": "Simon, it would surprise me if the name was derived from the Battle of Tippecanoe.\n\n"
    },
    {
      "time": "17 Apr 2006 — 2:51pm",
      "content": "Thanks very much.\n\n"
    },
    {
      "time": "17 Apr 2006 — 3:07pm",
      "content": "Thanks Tiffany, I can sleep easily at night now. ;-)\n\n"
    },
    {
      "time": "17 Apr 2006 — 3:08pm",
      "content": ":^/ I meant, it **wouldn't** surprise me. Sorry.\n\n"
    },
    {
      "time": "17 Apr 2006 — 3:16pm",
      "content": "even better!\n\n"
    }
  ]
}
