{
  "id": "19091",
  "title": "MAYA Magazine Cover",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "So it looks like this work I did quite a while ago: [http://typophile.com/node/16393](http://web.archive.org/web/20081023161646/http:/typophile.com/node/16393 \"http://typophile.com/node/16393\") is going to be put to use. The magazine is having a ’cover contest’ and I worked out a few options last night and attached them in a PDF. I’m looking for serious crits, I would like to win this competition. :-D I optimized the PDF so it’s not amazing quality but still should be sufficient.\n\n[http://users.adelphia.net/~dabailey/maya.covers.pdf](http://web.archive.org/web/20081023161646/http:/users.adelphia.net/~dabailey/maya.covers.pdf \"http://users.adelphia.net/~dabailey/maya.covers.pdf\")\n\nPS. Still don’t have internet at my new apartment so critiques during the day today while I’m on campus would be much appreciated otherwise I don’t think I’ll be able to see them till Monday.\n\n [‹ Military Intelligence? Poster](http://web.archive.org/web/20081023161646/http:/typophile.com/node/29313 \"Go to previous forum topic\") [feedback or suggestions on massive change poster ›](http://web.archive.org/web/20081023161646/http:/typophile.com/node/29274 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081023161646/http://typophile.com/user/8451\" title=\"View user profile.\">dave bailey</a>",
  "time": "<br>",
  "uid": "8451",
  "comments": [
    {
      "time": " 8.Apr.2006 3.47am",
      "content": "Is anyone else having trouble seeing this? Maybe you need to repost David.  \nTim\n\n"
    },
    {
      "time": " 9.Apr.2006 11.00am",
      "content": "There’s a link to the PDF since the Attach feature isn’t working. Are you saying that you can’t download the PDF from my link?\n\n"
    },
    {
      "time": " 9.Apr.2006 2.33pm",
      "content": "the link seems to work fine.\n\n"
    },
    {
      "time": " 10.Apr.2006 2.08am",
      "content": "I downloaded the link but it refused to show any content, I can see it at work, my software at home must need updating.  \nTim\n\n"
    },
    {
      "time": " 10.Apr.2006 5.52am",
      "content": "I might have saved it as Acrobat 6 instead of 5. Sorry.\n\n"
    },
    {
      "time": " 10.Apr.2006 9.52am",
      "content": "No need to apologise, my own fault for laziness in updating.\n\nI would like to see the title have a correlation to the folded paper background (I am imagining it as a manuscript wrapper), it seems with the multiply filter (or whichever it is) you are trying to make it appear as part of the wrapping but because it goes over the edges of the folds it is separate, you could look at making it look like it was painted/written.  \nI am not keen on the type (Bernhard) it just doesn’t have the right characteristics and the positioning isn’t working for me I would look at having two lines of copy under the 2nd A and two lines above the M (but rotated) they needn’t be the same so for example from one position Drexel University/Literary Magazine from the opposite First Edition/April 2006.  \nOverall I like the concept of the wrapper but I think it needs further work.  \nTim\n\n"
    },
    {
      "time": " 11.Apr.2006 9.34am",
      "content": "Awesome, thanks for the thoughts Tim. Those were some quick ideas and I felt like I should get some sort of first impressions.\n\nAs far as the secondary type, I wanted something that was sophisticated but nothing formal...more of a handwritten type/scripty feel that would match with the feel of the ambigram.\n\n"
    },
    {
      "time": " 11.Apr.2006 10.47am",
      "content": "Ok so I worked with the title\n\nWatermarked feeling:\n\n ![](http://web.archive.org/web/20081023161646im_/http:/typophile.com/files/maya.inky.png)\n\nInky feeling:\n\n ![](http://web.archive.org/web/20081023161646im_/http:/typophile.com/files/maya.watermark.png)\n\n"
    },
    {
      "time": " 11.Apr.2006 11.52am",
      "content": "That watermark version reminds me of using bleach on inked paper calligraphy (worth trying if you have the inclination, not for this project necessarily, just a comment in passing). It certainly looks more like a part of the paper rather than floating above it. One thing that is troubling is the kink in the lefthand vertical of the first A, I understand the purpose just feel it is a bit too much.  \nThe treatment might not be “commercial” but if the treatment of other text is sympathetic it could work for an in-house magazine (I am not sneering here, it is an opportunity you (and I) should relish), have you considered hand-drawing a script for the other text?  \nTim\n\n"
    },
    {
      "time": " 11.Apr.2006 12.24pm",
      "content": "I have not considered hand drawing the other script. This is a student run magazine so I have the opportunity to do pretty much whatever I please, provided it’s not any kind of fancy printing options ie. embossing, varnishing etc.\n\nRE: the ’kink’ are you talking about the one right above the crossbar? if so that’s easily remedied, this ’aging’ of the mark was done by crumpling the print out, copying, crumpling and copying and scanning it back in. If it’s that distracting I’ll definitely clean it up.\n\n"
    },
    {
      "time": " 12.Apr.2006 1.59am",
      "content": "_’kink’_, yes that’s the one, doesn’t need completely removing, just smoothing out a bit.  \nTim\n\n"
    },
    {
      "time": " 12.Apr.2006 5.57am",
      "content": "Ok. Thanks.\n\n"
    }
  ]
}
