{
  "id": "19107",
  "title": "An History of the Poster: A Timeline",
  "forum": "Design",
  "tags": [

  ],
  "content": "I'd love to add [timelines](http://web.archive.org/web/20120207204918/http:/www.typophile.com/wiki/timelines) to the [wiki](http://web.archive.org/web/20120207204918/http:/www.typophile.com/wiki/typowiki), but don't want them to be incomplete or incorrect. I also realize that something like an history about something like posteres can be subjective as you first must answer the question, \"What is a Poster?\" But, I thought this would make a fun exercise. A test if you will.\n\nThis timeline was created in 2000 for an essay I was writing about that very question mentioned previously. Let's see how this goes.\n\n- - - - - - -\n\nThe History of the Printed Poster up to 1900.\n\nBefore [Gutenberg](http://web.archive.org/web/20120207204918/http:/www.typophile.com/wiki/Gutenberg)\n\n10,000 B.C. -- The Birth of Visual Communication can be traced to the cave paintings done during the Paleolithic age in Lascaux, France  \n105 A.D. -- Paper was discovered in China by Ts’ai Lun  \n79 A.D. -- The “advertisements” over the baths at Pompeii.\n\n15th Century\n\n1439 -- Johannes Gutenberg’s creates the hand-operated press in Mainz, Germany.  \n1461 -- Mainz, Germany. Leaflets and Posters were printed for both sides during a feud between bishops. Supposedly the beginning of political posters and leaflets.  \n1470 -- First Publisher’s catalogue printed as a poster by Peter Schöffer in Mainz.  \n1477 -- First advertisement printed by William Caxton. It announces an edition of Pyes of Salisbury.  \n1482 -- In Paris for Notre Dame in Rheims a message is posted promising that the faithful would all be forgiven their sins if they were to make an offering of money in church on the day of Pope Pius’s visit. This poster was a Gothic woodcut with the Madonna as the patron of the church, the papal insignia and the coat of arms of the town of Rheims–possibly the first specimen of a text supported by illustration.\n\n16th Century\n\n1505 -- Etching was invented in Ausburg.  \n1517 -- Martin Luther posts his ninety-five theses for debate on the door of Castle Church in Wittenberg. Subsequently, his friends passed on copies to the printers to be reproduced, by December the whole of the continent knew of Luther’s beliefs.  \n1518 -- The first wood engraving poster was printed in Rostock  \n1518 -- The archibishop of Mainz set up the first board of censors to supervise printing.  \n1520 -- The first playbill from a wood engraving also printed in Rostock  \n1539 -- Frances I of France found it necessary to issue an order on putting up posters.\n\n17th Century\n\n1653 -- A decree is sent out by the goverment in Paris forbidding, on pain of death, the printing and exhibition, or bill-posting, of posters without an official permit\n\n18th Century\n\n1722 -- In Paris the goverment tries yet again to control the posters.  \n1742 -- A new edict is issued which requires two copies of every bill or poster to be delivered up to the Royal Library.  \n1760 -- The Industrial Revolution begins in England.  \n1780 -- James Watt introduces the ability of steam power.  \n1798 -- Lithography is discovered by Alois Senefelder.\n\n19th Century\n\n1810 -- Frederick Koenig invents the powered printing machine thus enabling the truest form of mass production for man yet.  \n1838 -- Charles Dickens uses the word ‘poster’ in his book _Nicholas Nickleby_. Shortly thereafter it is accepted in the the English dictionary.  \n1845 -- Paul Gavarni produces the black and white lithographic poster Les Français. Together with Honoré Daumier, they attempt to produce posters with artistic merit.  \n1850 -- The power-operated press has been advanced enough to produce up to 10,000 sheets per hour  \n1867 -- Jules Chéret produces the color lithographic poster for the play La Biche au Bois starring Sarah Bernhardt  \n1868 -- Edouard Manet’s black on white lithographic poster for the book Les Chats by Champfleury.  \n1871 -- Fred Walker prints the first British pictorial poster for Wilkie Collins’ play and novel Woman in White. This is what is considered to be the first British poster with any artistic merit.  \n1895 -- Alphons Mucha prints his first poster for Sardou’s play Gismonda.\n\n",
  "author": "<a href=\"/web/20120207204918/http://www.typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": "<br>",
  "uid": "108",
  "comments": [
    {
      "time": "",
      "content": "These are probably dumb questions, but was paper invented or discovered? Also for a poster you wouldn't need movable type, so is there any evidence for 'block-book' style 'printed' posters pre movable metal type?\n\n"
    },
    {
      "time": "",
      "content": "_first specimen of a text supported by illustration_  \nUnless you count the graffiti used for advertising in Rome BC, some of which were drawn on paper.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Si -- Good questions. Maybe from they discovered the final invention? Or they invented paper from the discoveries found? My research didn't include anything in Eastern Europe beyond Paper. So, there is a gap obviously.\n\nTim -- Where can we find more information about that? Sounds like an honest addition.\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20120207204918im_/http:/typophile.com/files/FlyPosting.jpg)\n  \nThis painting has always amazed me. It's a watercolour by John Orlando Parry, \"A London Street Scene\", 1835 -- presumably made with the aid of a camera obscura.\n"
    },
    {
      "time": "",
      "content": "Gorgeous!\n\nI have seen this before. I think it is in the book from the exhibit done in 1998 at the V&A on the History of the Poster.\n\n"
    },
    {
      "time": "",
      "content": "Perhaps in addition to, or instead of, we could create good bibliographies on topics. This is my bibliography from the aforementioned essay.\n\nBibliography\n\nAbdy, Jane. The French Poster.  \n-- London: Studio Vista, 1969.\n\nBarnicoat, John. A Concise History of Posters.  \n-- London: Thames and Hudson, 1972.\n\nCraig, James and Bruce Barton. Thirty Centuries of Graphic Design: an Illustrated Survey.  \n-- New York: Watson-Guptill Publications, 1987.\n\nEisenstein, Elizabeth L. The Printing Revolution in Early Modern Europe Canto Edition.  \n-- Cambridge: The Press Syndicate of the University of Cambridge, 1993.\n\nGallo, Max. Posters in History. 2nd Edition.  \n-- London: Bracken Books, 1989.\n\nGriffiths, Antony. Prints and Printmaking: An introduction to the history and techniques.  \n-- 3rd Edition. London: British Museum Press, 1996.\n\nHeller, Stephen. Introduction. Graphis Posters 87. Edited by B. Martin Pederson.  \n-- New York: Graphis U.S. Inc., 1987.\n\nHenderson, Sally and Robert Landau. Billboard Art.  \n-- London: Angus & Robertson, 1981.\n\nHillier, Bevis. Posters.  \n-- London: George Weidenfeld and Nicolson Limited, 1969.\n\nHolme, Brian. Advertising: Reflections of a Century.  \n-- London: William Heinemann Ltd., 1982\n\nHutchison, Harold F. The Poster: An Illustrated History from 1860.  \n-- London: Studio Vista Limited, 1968.\n\nKing, Julia. The Flowering of the Art Nouveau Graphics.  \n-- London: Trefoil, 1990.\n\nLaver, James. Intro. Henry Davray. Preface. XIXth Century French Posters  \n-- London: Nicholson and Watson in association with Ernest Brown and Phillips, Ltd., 1944.\n\nMargolin, Victor, et al. The Promise and the Product: 200 Years of American Advertising Posters.  \n-- New York: MacMillan Publishing Co., 1979.\n\nMason, Stanley. “A.M. Cassandre. A Poster Genius in Retrospect.” Graphis 218.  \n-- Zurich: Graphis Press Corp., 1982.\n\nMeggs, Philip. A History of Graphic Design. 3rd Edition.  \n-- New York: John Wiley & Sons, Inc., 1998.\n\nMüller-Brockmann, Josef and Shizuko Müller-Brockmann. History of the Poster.  \n-- Zurich: ABC Druckerei + Verlags AG Zurich, 1971.\n\n– – –. A History of Visual Communication.  \n-- New York: Hastings House, 1971.\n\nOosten-Wittamer, Yolande. Introduction. La Belle Epoque: Belgian Watercolors and Drawings.  \n-- Washington, U.S.A.: Trustees of the International Exhibitions Foundation, 1970.\n\nPreston, Gillian. Advertising. Past-into-Present Series.  \n-- London: B.T. Batsford Ltd., 1971.\n\nRaffe W.G. Poster Design.  \n-- London: Chapman and Hall Ltd., 1929.\n\nRickards, Maurice. The Public Notice: An Illustrated History.  \n-- Newton Abbot, Devon: David & Charles Ltd., 1973.\n\n– – –. Collecting Printed Ephemera.  \n-- Oxford: Phaidon and Christie’s Ltd., 1988.\n\n– – –. The Rise and Fall of the Poster.  \n-- London: Newton Abbott, 1971.\n\n– – –. Posters of Protest and Revolution.  \n-- London: Adam & Dart, 1970.\n\nRoger-Marx, Claude. Graphic Art of the 19th Century.  \n-- London: Thames and Hudson, 1962.\n\nSampson, Henry. A History of Advertising from the Earliest Times.  \n-- London: Chatto and Windus, 1875.\n\nSchuwer, Phillipe. History of Advertising. Discovery of Science.  \n-- London: Leisure Arts, 1966.\n\nSteinberg, S.H. Five Hundred Years of Printing. New Edition.  \n-- London: Oak Knoll Press and The British Library,1996.\n\nStermer, Dugald. The Art of Revolution.  \n-- _Lost information. Will go replace shortly._\n\nTimmer, Margaret, ed. The Power of the Poster.  \n-- London: V&A Publications, 1998.\n\nTurner, E.S. The Shocking History of Advertising.  \n-- Middlesex, England: Penguin Books Ltd., 1952.\n\nTwyman, Michael. Printing 1770-1970: an illustrated history of its development and uses in England.  \n-- London: Eyre & Spottiswoode Ltd., 1970.\n\n– – –. “The Letterpress Poster in the 19th Century.” Bulletin of the Printing Historical Society.  \n-- Summer 1998.\n\n– – –. The British Library Guide To Printing: History and Techniques.  \n-- London: British Library, 1998.\n\nWeill, Alain. Lithography: 200 Years of art, history, and technique.  \n-- ed. Domenico Porziio. New York: Harry N. Abrams, Incorporated, 1983.\n\nThe Compact Oxford Dictionary, 2nd ed.  \n-- Oxford: Oxford University Press, 1989.\n\n"
    },
    {
      "time": "",
      "content": "Tim -- One thing to consider in regards to the grafitti. How does one define 'poster'? If by poster it has to be posted, or on a substrate of some sort before it is posted, does the grafitti count?\n\n"
    },
    {
      "time": "",
      "content": "I think hand drawn posters qualify. Otherwise all of Toulouse-Lautrec's posters would not count.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Toulouse-Lautrec's qualify because of multiple production as well.\n\n"
    },
    {
      "time": "",
      "content": "True, those litho stones are a bear though :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I would be willing to bet that there was grafiti in ancient Greeceand Rome--knowing how argumentative we Greeks can be, I'll bet there were political posters too.  \n\"Vote for Nick Papas, for Uzo and Polytonic in each glass!\" :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "But by \"poster\" you mean a piece of paper that was posted, right? I think that is one thing that has to be in place before it can be counted as a \"poster\".\n\n"
    },
    {
      "time": "",
      "content": "i borrowed a book from my school's library earlier this year called \"The Modern American Poster\" (released by MoMA in 1983), but i think it only covered the 20th century (and obviously just American works), so maybe that's not what you're looking for. nice book though.\n\nThe Modern American Poster: From the Graphic Design Collection of The Museum of Modern Art  \nJ. Stewart Johnson  \nPaperback (1983)  \n0-87070-452-2\n\n"
    },
    {
      "time": "",
      "content": "Finding information on the web isn't easy (and should be taken with a pinch of salt), I can find two urls that I can be fairly confident are accurate [here](http://web.archive.org/web/20120207204918/http:/72.14.203.104/search?q=cache:qN7hfvOz3_MJ:www.findarticles.com/p/articles/mi_m1510/is_1987_Spring/ai_4806053+roman+advertising+BC&hl=en&ct=clnk&cd=6&client=safari) and [here](http://web.archive.org/web/20120207204918/http:/www.classicsunveiled.com/romel/html/amphiglad.html). Your point about at what time does a grafitto become a poster is a tricky one, much of the advertising in Rome was hand drawn in chalk directly onto walls, slaves might be sent out to write up a message on various prominent walls, rubbing out rival messages, to draw attention to the message they included borders and sometimes an image, the advertisements were for political campaigns (including games, circuses and bread), products (olives, olive oil, garum etc), more personal services (to use a euphemism) and so on _plus ça change_; also wooden boards would be used for more permanence, however, for quality control, some campaigns were copied onto paper (papyrus, I imagine vellum or parchment would be prohibitively expensive) by a scriptorium and then posted. I suppose all of these would in some way be posters, in that they serve the same purpose and have the longevity as a more modern poster, I suggest that the medium is less important than the message on the wall in the definition of poster, especially to the patron.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Good analysis TimD! I think you are right.\n\nOn a lighter note--Maybe those \"more personal services\" you spoke of is what started the movie rating system we now use. Three Roman Numeral Xs might have begun as the asking price for such a personal service :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\> _1505 — Etching was invented in Ausburg_\n\nTiffany -- is that _Ausburg_ or _Augsburg_?  \nI am less familiar with Ausburg but have visited Augsburg several times.\n\n"
    },
    {
      "time": "",
      "content": "A wonderful book that adds quite a bit to the history of 'posters' is Public Lettering: Script, Power, and Culture by Amando Petrucci, Univ. of Chicago Press, 1993. Petrucci uses the city of Rome as a case in point for the history of publically displayed script. The primary period discussed is late medievael through the mid-20th century, but with frequent reference to ancient practice. Chapter 7—Ephemeral Monumental and Paper Monumental—is particularly pertinent.\n\n"
    },
    {
      "time": "",
      "content": "I recently got that book Charles. I like the inscriptionary history aspect.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "[http://www.jan-toorop.com/browse/year/1894/?&limit=1&page=1](http://web.archive.org/web/20120207204918/http:/www.jan-toorop.com/browse/year/1894/?&limit=1&page=1 \"http://www.jan-toorop.com/browse/year/1894/?&limit=1&page=1\")\n\nAccording to Creative Type, this poster from 1894 made such an impact that Art Nouveau is sometimes referred to as Salad Oil Style in Holland.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "That is an interesting site Tim. I had to bookmark your link.\n\nThanks!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Just my random inconsequential question:  \nMeggs (Third Edition) shows Senefelder inventing lithography in 1796 instead of 1798. Anyone know which is the correct date? Perhaps the idea came to him in '96 and he made it happen two years later? Sorry, I won't claim to be a history buff, I should probably know this stuff!\n\n"
    },
    {
      "time": "",
      "content": "I quickly checked a few sources and both dates are given. What everyone agrees on is that Senefelder did not publish his results until 1818 after he had obtained protection for ownership of the process.\n\n"
    },
    {
      "time": "",
      "content": "Another thought about the history of posters. Both papermaking and printing were invented in China. Printing of decrees, laws, etc. permitted wide distribution across China’s vast administrative reaches, and with less possibility for scribal error.  \nRubbings were the first form of printing on paper. Since c. 175 CE, important decrees, texts, scriptures, poems, and pictures were inscribed on wood, bronze, and stone. Then copies, made by rubbings and ink transfer, were distributed on paper. Some of these transfers were certainly meant for posting in public.\n\n"
    },
    {
      "time": "",
      "content": "One of the principal subject matters of Ukiyo-e Japanese woodblock prints was actors and scenes from Kabuki theatre.\n\nWere those prints ever posted in public?\n\n"
    },
    {
      "time": "",
      "content": "I hope someone has a concrete answer for that—I'm curious myself. With the amount of work people like Hokusai were producing, I'd have to imagine some of it was posted in public. I'm going to add a tangent to your question—hopefully someone has an answer to both!\n\nMuch of the woodblock prints were used for book illustration. How many people would have actually had access to these books? It seems like a waste if all of this great work was unknown to the public.\n\n"
    },
    {
      "time": "",
      "content": "I just remembered another very good book.  \nSherraden, Jim, Elek, Horvath, and Paul Kingsbury. _Hatch Show Print, Nashville, Tenn. : the history of the great American poster shop._ San Francisco : Chronicle Books, c2001. Details the history of Nashville's Hatch Letterpress shop that has been producing posters since 1879. Not a lot of high style here but tons of hand cut wood and lino lettering and both wood and metal type.\n\n"
    },
    {
      "time": "",
      "content": "Chris, if you liked that check out these  \n [http://www.poster.com.pl/](http://web.archive.org/web/20120207204918/http:/www.poster.com.pl/ \"http://www.poster.com.pl/\")\n\n[http://www.nationaltheatre.org.uk/?lid=7119](http://web.archive.org/web/20120207204918/http:/www.nationaltheatre.org.uk/?lid=7119 \"http://www.nationaltheatre.org.uk/?lid=7119\")\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Great links Tim! THANKS!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "_Ukiyo-e Japanese woodblock prints_\n\nFive or six years ago I saw a Japanese film, a drama, about an artist who made such prints (Hokusai had a bit part). It was brilliant, one of the best films about art, but I can't remember the name. It was set towards the end of the Edo era, c. 1830s, I believe.\n\nAnyway, it recreated the theatre district, and showed the print shops as stores which had their wares hung outside to attract passers-by.\n\n"
    },
    {
      "time": "",
      "content": "@ Norbert: That is probably a typo. How embarassing.\n\n@ Charles: The \"Public Lettering\" book is an excellent addition. Same with the \"Hatch Show\".\n\n@ All: So you think that as long as it was on another substrate, not directly on the wall, it should be considered a poster? I think I agree with that.\n\n"
    },
    {
      "time": "",
      "content": "Well, there's also enamelled tin signs.  \nAnd advertising billboards, which may be either painted or printed.  \nAnd back-lit adverts.\n\nBTW, check out Michele Bogart's \"Artists, Advertising, and the Borders of Art\".\n\n"
    },
    {
      "time": "",
      "content": "I think your definition is, on the whole, good enough, (grafitti timeline will have to wait Pre-history to Banksy?). I am interested to know why you stopped at Mucha, although I would class his work as the acme of the 19th century. I would also be interested to know when the poster became a cheap artwork for the public, did it start with people stealing posters from the walls?  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Tim, fin-de-siecle printers did multiple editions of eg Mucha posters, at smaller sizes.\n\nBut that fit into the tradition of fine art prints (often engravings of paintings) that were kept in \"portfolios\", not books.\n\nIt would have been hard to steal posters if they were glued to walls.\n\nBogart's book is good on the poster-or-art issue c.1900.\n\nBTW,\n\nCalendars were a related art form.  \nMaxfield Parrish's paintings (1920s) were beautifully printed in special colors, distributed via calendars, but subsequently framed and mounted in homes. These same images had started life in adverts and posters (with product ID), but he kept the copyright.\n\n"
    },
    {
      "time": "",
      "content": "Nick,  \nGood information thanks,  \n_It would have been hard to steal posters if they were glued to walls._  \nBut not impossible, I treasured the Ramones one that I took off a wall very slowly in the rain one night (yes, it did rip in the last 6 inches) :)  \nTim\n\n"
    },
    {
      "time": "",
      "content": "I wanted to add a couple of books to the list  \n [http://www.vandashop.com/product.php?xProd=135&navlock=1](http://web.archive.org/web/20120207204918/http:/www.vandashop.com/product.php?xProd=135&navlock=1 \"http://www.vandashop.com/product.php?xProd=135&navlock=1\")\n\n[http://www.vandashop.com/product.php?xProd=377&xSec=30&navlock=1](http://web.archive.org/web/20120207204918/http:/www.vandashop.com/product.php?xProd=377&xSec=30&navlock=1 \"http://www.vandashop.com/product.php?xProd=377&xSec=30&navlock=1\")\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "@ Tim: Nice additions. The first is already in the list--which I can't edit for some reason--but that second isn't and I love his work!\n\n"
    },
    {
      "time": "",
      "content": "Bit of a bump  \nWith the added bonus of a gallery of Müller-Brockman  \n [http://www.imagenow.ie/gallery/flash.htm](http://web.archive.org/web/20120207204918/http:/www.imagenow.ie/gallery/flash.htm \"http://www.imagenow.ie/gallery/flash.htm\")\n\nTim\n\n"
    }
  ]
}
