{
  "id": "19101",
  "title": "Problem with Illustrator CS2 replacing glyphs",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "i apologize since this is probably not the place to ask (as it's not truly related to fonts), but i don't feel like finding and registering at some illustrator forum so here goes..\n\ni was testing to see all the glyphs in my current typeface project in Illustrator CS2 (on PC), but it was replacing the characters ƒ Š Œ š œ Ÿ with their Arial counterparts instead of the ones i had made. i figured it must've been something wrong with the font, but i can't find anything and then i tested other typefaces on my computer and all of them have those characters replaced by the Arial counterpart.. what the? in Photoshop, they display properly, so this is clearly an Illustrator thing.. has anyone heard of this before? is it some bug in the software or may it just be my Illustrator that needs to be reinstalled?\n\nupon further testing it appears it doesn't happen to every single font, so for some of them it uses the font's own glyphs and for others it does the same as it did with my font.. it doesn't seem to be any Truetype-only or Opentype-only thing either.\n\nany help on the matter would be greatly appreciated.\n\n",
  "author": "claes",
  "time": "7 Apr 2006 — 10:44am",
  "uid": "11945",
  "comments": [
    {
      "time": "7 Apr 2006 — 12:25pm",
      "content": "Does this help? (read Jonathan's entry as well)  \n [http://typophile.com/node/19034#comment-116575](http://web.archive.org/web/20131014224929/http:/typophile.com/node/19034#comment-116575 \"http://typophile.com/node/19034#comment-116575\")\n\n"
    },
    {
      "time": "7 Apr 2006 — 4:59pm",
      "content": "that doesn't seem to be it. i did uninstall a whole slew of fonts though, and i just uninstalled and reinstalled the program.. but the issue still remains, sadly. i can't find any help on it over on Adobe's own forums either.\n\nugh.\n\nthanks for the reply though.\n\n"
    },
    {
      "time": "7 Apr 2006 — 5:02pm",
      "content": "You need to shine the [Phinn-signal](http://web.archive.org/web/20131014224929/http:/typophile.com/wiki/Phinn-signal).\n\n"
    },
    {
      "time": "7 Apr 2006 — 5:10pm",
      "content": "[http://www.adobe.com/support/forums/](http://web.archive.org/web/20131014224929/http:/www.adobe.com/support/forums/ \"http://www.adobe.com/support/forums/\")\n\nTypography  \n [http://www.adobeforums.com/cgi-bin/webx?14@@.eea5b3a](http://web.archive.org/web/20131014224929/http:/www.adobeforums.com/cgi-bin/webx?14@@.eea5b3a \"http://www.adobeforums.com/cgi-bin/webx?14@@.eea5b3a\")\n\nMac  \n [http://www.adobeforums.com/cgi-bin/webx?14@@.ee6b324](http://web.archive.org/web/20131014224929/http:/www.adobeforums.com/cgi-bin/webx?14@@.ee6b324 \"http://www.adobeforums.com/cgi-bin/webx?14@@.ee6b324\")\n\nWin  \n [http://www.adobeforums.com/cgi-bin/webx?14@@.ee6b328](http://web.archive.org/web/20131014224929/http:/www.adobeforums.com/cgi-bin/webx?14@@.ee6b328 \"http://www.adobeforums.com/cgi-bin/webx?14@@.ee6b328\")\n\n"
    },
    {
      "time": "7 Apr 2006 — 5:17pm",
      "content": "<cite>You need to shine the Phinn-signal.</cite>\n\ni guess i do.\n\nanyway, i wrote a little message on one of the Adobe forums for Illustrator, so we'll see if anyone's got any idea what this is all about.. didn't find anything searching though, neither in the forums or the knowledge database so maybe i'm screwed.\n\n"
    },
    {
      "time": "8 Apr 2006 — 7:04am",
      "content": "Claes,  \n1. Are these (ƒ Š Œ š œ Ÿ) the only characters being replaced?  \n2. Are they correctly named?  \n3. Do they have the right Unicode value?  \n4. In which format are you generating the font?  \n5. Are the characters still replaced when you generate the font in a different format?  \n6. Which codepages and Unicode ranges does your font support?\n\n"
    },
    {
      "time": "8 Apr 2006 — 12:00pm",
      "content": "Miguel,\n\n1. out of the standard 255 characters, yes. these:\n\n!\"#$%&'()\\*+,-./0123456789:;\\<=\\>?  \n@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^\\_  \n`abcdefghijklmnopqrstuvwxyz{|}~  \n€‚ƒ„…†‡ˆ‰Š‹Œ‘’“”•–—˜™š›œŸ  \n¡¢£¤¥¦§¨©ª«¬­®¯°±²³´µ¶·¸¹º»¼½¾¿  \nÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞß  \nàáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿ\n\n2 & 3. they have the names/values that Fontlab assigned to them in the standard template, so i would have to assume they are correct.\n\n4. Opentype PS (on a PC).\n\n5. yes. i just tested it in Truetype (TTF).\n\n6. codepage(s): 1252 Latin 1, Unicode ranges: Basic Latin, Latin-1 Supplement, Latin Extended-A, Latin Extended-B.\n\nthe thing is that this same thing happens for most of my installed fonts, with commercial fonts, homemade ones and free ones.. in other programs, even Photoshop, they all work properly.. so this has to be an issue with Illustrator, not the fonts. reinstalling didn't work, cutting down on fonts didn't work either. how frustrating.. no answers at all on the Adobe Forums either.. so much for that.\n\nanyway, thanks for trying to help.\n\n"
    },
    {
      "time": "8 Apr 2006 — 3:36pm",
      "content": "No problem. I was trying to figure out if there was a reason why only those get replaced.\n\nBut yeah, I see. Seems like something got corrupted with Illustrator. Which version, BTW?\n\nWell, I wish you luck. Let us know what the problem was, as soon as you find out. I'm sure one day someone will benefit from that.\n\nPS: Have you tried to remove the Registry entries related to Illustrator before re-installing? (Anyway, I would wait for Adobe's feedback, before messing around the system even more.)\n\n[Edit: Forget the question about the version. I just noticed it's on the thread's title :o)]\n\n"
    },
    {
      "time": "8 Apr 2006 — 4:25pm",
      "content": "the curious thing is that all of these characters are close proximity in the standard/default encoding.. like in the FontLab template (and the Fontographer template). the 255 character set i posted in the earlier post, i think i mapped that after the way they appeared in Fontographer.. it's odd because the uppercase and lowercase Š and Œ are affected, but not the lowercase Ÿ which as you see doesn't come until much later in the order. it feels like that's of some significance, but i can't figure out why that would be so.\n\nand just for the record i have CS2 v. 12.0.1, which is the very latest as far as i know.\n\n"
    },
    {
      "time": "8 Aug 2008 — 8:13am",
      "content": "I just had a subset of this problem in Illustrator CS2. Working only with caps, the Y-diaresis and OE seem sticky, they refuse to change to a new font from the menu after switching over once or twice. I'm running through various foundries fonts and some homebrewed.\n\nWorkaround is to use a combination of the glyph palette and saving back to Illustrator CS format seems to help, then reopening.\n\n"
    },
    {
      "time": "5 Aug 2010 — 5:16pm",
      "content": "This may be too late, but I'm having this same problem. I'd like to hear if anyone has solved this issue. I myself am unable to change out the fonts from the œ on through to the ƒ. Very frustrating. I can show Arial (Bold), Times, and then otherwise non-selectable. Each time I try and scroll through the font list in Illustrator, it always jumps back to Arial.\n\nThanks\n\nCS2 - Illustrator - PC\n\n"
    }
  ]
}
