{
  "id": "19115",
  "title": "(x) \"IntelliCom Analytics\" Times-like serif with slanted e - ITC Tiffany {Geoff}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hey guys,  \nIm trying to figure out what kind of font this is... it seems like times new roman.. but the e is slanted and the l’s and more of an arc in them and the y hooks more... anyone have any idea? thanks!!\n\n [‹ Atlantic, Trajan, 2Tone - Classic record label typefaces](http://web.archive.org/web/20070813135826/http:/typophile.com/node/19824 \"Go to previous forum topic\") [Buero New York squarish sans ›](http://web.archive.org/web/20070813135826/http:/typophile.com/node/19501 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070813135826/http://typophile.com/user/12375\" title=\"View user profile.\">raventy</a>",
  "time": "<br>",
  "uid": "12375",
  "comments": [
    {
      "time": " 7.Apr.2006 6.09pm",
      "content": " ![](http://web.archive.org/web/20070813135826im_/http:/typophile.com/files/IntelliComRGB1.gif)\n\n"
    },
    {
      "time": " 7.Apr.2006 6.31pm",
      "content": "That’s [ITC Tiffany](http://web.archive.org/web/20070813135826/http:/www.myfonts.com/fonts/linotype/itc-tiffany/) squashed, the pointy nose on the e gives it away. :^)\n\n"
    },
    {
      "time": " 7.Apr.2006 6.53pm",
      "content": "Times New Roman with a slanted e? Mmmm, sounds authoritative yet artistic.\n\n"
    },
    {
      "time": " 9.May.2006 9.57am",
      "content": "Hello all.\n\nI am the creator of the logo in question, simple as it may be. The font I used is called Timpani; bold for IntelliCom, bold-italic for Analytics. Taking a quick look at ITC Tiffany, I’d say they are the same font.\n\nMy father-in-law works for IntelliCom, which is how I got to do to logo, and just pointed this thread out to me. I guess he was Googling at work again. q-:\n\n"
    },
    {
      "time": " 9.May.2006 10.01am",
      "content": "Hi Shawn, what are the chances of finding your logo on Typophile. ;^)\n\nBtw, I googled the “Timpani” font and sadly it appears to be a straight-forward knock off of ITC Tiffany that’s free.\n\n"
    },
    {
      "time": " 9.May.2006 10.11am",
      "content": "Heh. That seems to be the case quite often, unfortunately. I believe my copy came from one of those “more fonts than any human could possibly use in their lifetime” disks that I stole from my mom a while back. Every time I build a new machine I backup my fonts folder and copy it over to the new one, so I can’t for the life of me remember where some of them come from.\n\nWhat made finding people playing “name that font” with the IntelliCom logo was particularly funny for me because of all the times my online friends and I have done the same thing with logos and numbers when trying to create/re-create paint schemes for race cars to go into various racing games.\n\nNifty forum ya’ll got here. Think I may just stick around.\n\n"
    }
  ]
}
