{
  "id": "19116",
  "title": "Rough start for my personal logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is not a logo but rather an idea which I had.\n\nSoon my apprenticeship ends and I had to apply for a job. So I thought about not making a standard letter to write to the agencies but rather just a logo printed on a selfmade postcard. So I could write on the back and the guy from the agency could read immediately my application. Therefore I could not glue a picture of me on the postcard, so I decided to paint myself. So my name should look a little bit like a signature.\n\nIts a bit late now and I want to go to bed but before go to sleep I want to upload my current status to hear what you think of it.\n\nIts just a rough sketch which I traced in freehand. Its not cleaned yet.\n\nBecause the logo only appears on a postcard I thought about giving my picture an irregular, selfpainted border that let it look like a postage stamp.(only sketched yet)\n\nSo what do you think of it!?\n\n ![](http://web.archive.org/web/20131020083532im_/http:/typophile.com/files/Steven-Wulf-Logo.gif)\n  \n\n ![](http://web.archive.org/web/20131020083532im_/http:/typophile.com/files/Borderline-Logo.gif)\n  \n\n ![](http://web.archive.org/web/20131020083532im_/http:/typophile.com/files/Steven-Wulf-Letter.gif)\n  \n…  \nBye: Steven \n",
  "author": "stw",
  "time": "7 Apr 2006 — 9:52pm",
  "uid": "8393",
  "comments": [
    {
      "time": "8 Apr 2006 — 2:09am",
      "content": "I like the lettering, even if, _in this state_, it partially still seems slightly 'blurry' / 'stroppy' / 'sloppy' _( Deutsch: 'Patzig', als wenn an diesen Stellen die Farbe zusammenlaufen wuerde. )_ and too dark _( Especially the 'l' and 'f'. )_, but I am not too sure about the illustration or the combination of the two.\n\nDav\n\n"
    },
    {
      "time": "8 Apr 2006 — 3:44am",
      "content": "Yes, I think that you should add \"counters\" to the \"l\" and \"f\" (like the \"e\"… since they are written with the same kind of loop).\n\nI like your first image. The portrait and your \"signature\" match each other in line and style. I don't like the postage stamp border idea… that is too kitchy.\n\n"
    }
  ]
}
