{
  "id": "19114",
  "title": "Texty Font for [Argentine] Sommelier",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I've roughed out the following logo prototype for a sommelier by the  \nname of Maxim who's decided to call his venture \"Maximus Vinum\":\n\n ![](http://web.archive.org/web/20131228063024im_/http:/typophile.com/files/MV.gif)\n\n(FYI, I'll probably have a non-floriated, or perhaps  \n a more coarsely floriated, version for small sizes).\n\nNow I'm looking for a texty (some paragraphs of text, but not  \ntoo much) font to use. Something that matches the spirit of the  \nlogo (which I assume/hope is discernible in the first place) but is  \nnot too mannered. For example Hollandse Mediaeval\\* is probably  \na bit too much, although its somewhat anachronistic yet classy  \nfeel is close to what I think I want. The ideal candidate would  \nwork as a heading font as well.\n\n\\* Referred to in this thread: [http://typophile.com/node/19096](http://web.archive.org/web/20131228063024/http:/typophile.com/node/19096 \"http://typophile.com/node/19096\")\n\nSpecific suggestions (or wanton brain dumps) highly welcome.\n\nhhp\n\n",
  "author": "hrant",
  "time": "7 Apr 2006 — 5:51pm",
  "uid": "1250",
  "comments": [
    {
      "time": "7 Apr 2006 — 6:20pm",
      "content": "DTL Van Den Keere Italic would be lovely.\n\n"
    },
    {
      "time": "8 Apr 2006 — 1:22am",
      "content": "Could it be Rialto.df?  \n [http://www.typophile.com/forums/messages/83/Rialto-26922.pdf](http://web.archive.org/web/20131228063024/http:/www.typophile.com/forums/messages/83/Rialto-26922.pdf \"http://www.typophile.com/forums/messages/83/Rialto-26922.pdf\")\n\n"
    },
    {
      "time": "8 Apr 2006 — 3:32am",
      "content": "[Esta?](http://web.archive.org/web/20131228063024/http:/www.myfonts.com/fonts/dstype/esta/)  \nTim\n\n"
    },
    {
      "time": "8 Apr 2006 — 3:57pm",
      "content": "[Doves](http://web.archive.org/web/20131228063024/http:/home1.swipnet.se/~w-10011/Tobbe/large/dove.pdf)?? Perhaps with the i fixed.\n\n"
    },
    {
      "time": "8 Apr 2006 — 9:18pm",
      "content": "I think the Doves one comes closest so far to what I need.  \nSomething not as rough, but even a bit more archaic, or  \nmaybe a bit mannered like an old continental gentleman  \nmight be ideal, no? What about one of those recent fauve  \nLatinoamericano designs, considering?\n\nhhp\n\n"
    },
    {
      "time": "9 Apr 2006 — 5:09am",
      "content": "Erasmus? Schiller Antiqua RR? I think there needs to be a de Roos-style type that isn't horrible, I just don't know whether there is one. Maybe one of Goudy's more obscure text types.\n\n"
    },
    {
      "time": "9 Apr 2006 — 6:15am",
      "content": "By George :-) I think Erasmus is it! It's both more  \ntame and more elegant than Hollandse Mediaeval.  \nBut I'll wait for more suggestions. And -predictably-  \nI've started to also consider an old friend: Octavian.\n\nBTW, De Roos had a really superb (especially in  \nthe Italic) eponymous design, but I think it has  \nyet to be digitized.\n\nhhp\n\n"
    },
    {
      "time": "9 Apr 2006 — 7:03am",
      "content": "What about argentinian Fontana [Andralis](http://web.archive.org/web/20131228063024/http:/www.neufville.com/FontData/_AndSet.htm)?\n\n"
    },
    {
      "time": "9 Apr 2006 — 11:43am",
      "content": "For full resonance, you would have to use a version of Jenson that had the \"extra\" serifs on the M -- Adobe snipped them off in the default version of Adobe Jenson, but the proper version is in the alt characters.\n\nMy Jenson, Goodchild, has the full serifs.\n\nStone's Arepo has a similar quality to your logo, so Cycles could be good, and comes in optical scaling, handy for the back label on wine bottles -- I hate squinting at 6pt Snell to figure out what I'm supposed to be drinking the wine with.\n\nBTW, brilliant design!\n\n"
    },
    {
      "time": "10 Apr 2006 — 8:37am",
      "content": "btw. the logo looks like an initial from the MISSALE ROMANUM from the Bremer Presse 1928-32. The book was set in a typeface called LITURGICA - a very dark and wide roman typeface. The Erasmus type has not a very proper g, but could work.\n\n-- [astype.de](http://web.archive.org/web/20131228063024/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "10 Apr 2006 — 8:58am",
      "content": "Bingo. I was going to tell Nick \"thanks, and the idea was mine (including the floriation\\*) but this (preliminary) execution wasn't\". It's funny how things just fall in your lap sometimes: I had decided to try a \"V\" nestled inside an \"M\", and at the same time I was researching Wiegand\\*\\*, then I turned that page in that book and thought I was dreaming! I put together the plain \"M\" with the floariation of the \"V\" (and had to do some distortions to the floriation), but I'm going to redraw it when the client pays up.\n\n\\* Although I wanted grapevines, and might  \nstill splice in a bundle of grapes in there.\n\n\\*\\* Thanks to your reference in another thread. I have something  \ninteresting (relating to the Emerson face) to report on that btw...\n\nSo what do you think about the Bremer text face paired up with those initials? I like it, but it's too butch and too German to work here, no? He's a sommelier after all, not a beer connoisseur. :-)\n\nOK, catching up for real now...\n\nAlejandro, what about Borges?\n\nNick, good point about the full serifs up top.  \nBTW, this guy doesn't <cite>produce</cite> wine (although he did work at a vinery in Mendoza for some months), he tells people what wine to have, so any small type he sets will probably be limited to legal disclaimers concerning drunk driving and such. :-) Plus Cycles is wonderful, but maybe too clean? I'd like a font with just a little bit of grape residue at the bottom. :-)\n\nhhp\n\n"
    }
  ]
}
