{
  "id": "1912",
  "title": "Feedback on business card design",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey guys, that past few months have been tough (creatively), and this is not helping ![:-)](http://web.archive.org/web/20131013171038im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI'm gonna pass this by you all, and see what you think.   \n   \nI very happy with the mark, we did that a short while back. It's the layout of the card I'm having trouble with.   \n   \nThe card is two color, PMS 7542 (a muted blue)is used in the mark, in 100%, 80%, and 60%. The other color is a very dark gray. Faceplate sans (two points to whoever points this out from an earlier 'rejected' logo)   \n   \nI should ad, Sogno (pronounced sone-yo) is a textile import company, similar to IKEA but, more focused in the 'bedroom' side of the business.   \n   \nSo feedback would be helpfull.   \n   \nHildebrant.\n\n<!--attachment: sogno_biz_card_ideas-19691.pdf*mime_pdf.gif*application/pdf*23.9*Sogno+Business+Card+Layout*sogno_biz_card_ideas%2epdf --><!--attachment: sogno_biz_card_ideas-19691.pdf*mime_pdf.gif*application/pdf*23.9*Sogno+Business+Card+Layout*sogno_biz_card_ideas%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131013171038im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Sogno Business Card Layout<br><a href=\"http://web.archive.org/web/20131013171038/http:/www.typophile.com/forums/messages/4100/sogno_biz_card_ideas-19691.pdf\" target=\"_blank\"><b>sogno_biz_card_ideas.pdf</b></a> (23.9 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "Hildebrant",
  "time": "1 Nov 2003 — 10:21pm",
  "uid": "1286",
  "comments": [
    {
      "time": "2 Nov 2003 — 1:31pm",
      "content": "![:-(](http://web.archive.org/web/20131013171038im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": "2 Nov 2003 — 2:58pm",
      "content": "Kyle,   \n   \nI like the mark as well, although I must admit that I thought it was a paper company. Perhaps some sort of pattern integrated into the mark or background to allude to fabric/textiles? Also, I believe textiles are commonly distributed in round or flat rolls (imagine rolling up many many feet of fabric around something flat, like a yardstick). Just something to think about.   \n   \nIn regards to the typography/layout/colors. While I like Faceplate sans, I'm not sure its the best choice for a company that does textiles. To me this face is a little too modern/techie/impersonal for the purpose. I would say the same about the color scheme -- the muted blue is okay, but I feel that the gray is does not work. What about something a bit warmer -- more natural fiber looking? Something from the off-white to medium brown range?   \n   \nJust some top-of-mind feedback for what it's worth.   \n   \n -t\n\n"
    },
    {
      "time": "2 Nov 2003 — 8:33pm",
      "content": "Kyle, I like this.   \n   \nI kind of like Faceplate because it's kind of quirky and friendly but feels refined and modern enough.   \n   \nThe mark is good, and I think you should stick with it. Pillows, rugs, curtains, and tablecloths?   \n   \nTim's suggestion about the grey makes sense, but I haven't ever seen their range of product. A warmer grey almost brown could be pretty nice. Especially with the blue. Dark brown suit and a nice blue shirt. Maybe they're too cool for brown.   \n   \nYou may have tried all this stuff already so take it for what it's worth:   \n   \nWhat happens when you layout the card horizontally? Could you hang the mark in the left corner and stack info underneath the sogno logotype aligned with the s?   \n   \nIf you stay vertical what about aligning the information text with the imaginary centerline of the logo?   \n   \nHang in there. Let us know what goes on.   \n   \nJon\n\n"
    },
    {
      "time": "3 Nov 2003 — 3:12am",
      "content": "Hi Kyle, I like the font and the logo and the colours very much. But I'm not crazy about the while box right on top of the back of the card? Is it necessary? It seems to cut the card into two, and rather abruptly I feel. Would the design not be stronger without the white box? Just my two cents.   \n   \nBe sure to post the final.\n\n"
    },
    {
      "time": "3 Nov 2003 — 5:46am",
      "content": "Karen thats a really strong opion all ten times of it or so. Kyle, love the type but play with the layout some more, its so corporate. Maybe instead of printing the paper graphic you could stamp it or emboss it so it works on both sides of the card maybe even a diecut. Also think about using a textured paper. Its very stiff and needs to lighten up. Just my opion, Dan\n\n"
    },
    {
      "time": "3 Nov 2003 — 5:53am",
      "content": "Geez! Someone delete the repeats please. I never managed to post the message. There was some error while I was trying.\n\n"
    },
    {
      "time": "3 Nov 2003 — 6:01am",
      "content": "Karen, you have to post then leave the computer and go walk the dog or water the plants and then come back and it will b posted. Sometimes it times out, just go to another forum and come back and there it is, magic, Dan\n\n"
    },
    {
      "time": "3 Nov 2003 — 8:41am",
      "content": "\"you have to post then leave the computer and go walk the dog or water the plants and then come back and it will b posted\"   \n   \nHaha, how true that is! I just hit post, wait a few seconds, then hit the browser back button.   \nThat seems to be the best technique. They probably just need to kill the email notifications for now. That would probably take a great tasking off the server.   \n   \nAbout all your comments, planning on addressing those in a bit.   \n   \nI do have a full color scheme developed. With gresy, blues, tans, and earth type colors.   \nI will post another .PDF here soon. (trying to actually get some work done) ;)   \n   \nhildebrant.\n\n"
    },
    {
      "time": "3 Nov 2003 — 8:42am",
      "content": "!   \n   \nI cant post, this is just getting old.\n\n"
    },
    {
      "time": "3 Nov 2003 — 9:39am",
      "content": "\\> go walk the dog   \n   \nOr shine those platforms.   \n   \nKyle, the logo is totally a paper company. Try using a roll with a wavy sheet coming out.   \n   \nThe other criticism I have is that the colors are a bit too muted. And what about putting a subtle background pattern (as in fabric) on part of the card?   \n   \nhhp\n\n"
    },
    {
      "time": "3 Nov 2003 — 2:51pm",
      "content": "Hrant I've done work for paper companies If I see another paper roll graphic, I'm going to puke. They all use it. But texture is good. I also agree about the colors, most paper companies want to show off the brightness of their papers and how the ink jumps off the page, subtle colors and full coverage defeat that goal. Kyle you might want to be PC and use one of their recycled papers for the card and have the symbol and the percentage of recycling. The card, like an annual report can do more than post an url or phone number. Dan\n\n"
    },
    {
      "time": "4 Nov 2003 — 6:41pm",
      "content": "Dan: I think you got side tracked, this is NOT for a paper company, but a textile company, more like IKEA, or HERMAN MILLER. Something onlong thos lines, very modern. De La Espda also is a good comparison.   \n   \nand Hrant: I hate you. ;) But I am working with adding some 'texture' to the card. A monotone fabric in place of this grey.   \n   \nI will post my next version soon.   \n   \nhildebrant.\n\n"
    },
    {
      "time": "4 Nov 2003 — 6:43pm",
      "content": "\"I kind of like Faceplate because it's kind of quirky and friendly but feels refined and modern enough\"   \n   \nJon - thats really how I felt about the text too.   \nI didnt want this to turn out 'fashion' looking. with a wide letter spaced, ultra thin face. I wanted it to have a little more character, and still reflect a little of the modernism that they will try to be portraying.\n\n"
    },
    {
      "time": "4 Nov 2003 — 6:46pm",
      "content": "\"Would the design not be stronger without the white box?\"   \n   \nKaren -- I do agree.\n\n"
    },
    {
      "time": "4 Nov 2003 — 7:02pm",
      "content": "I think that Kyle's been tearin' it up...I wait with anticipation.   \n   \nJon\n\n"
    },
    {
      "time": "4 Nov 2003 — 7:04pm",
      "content": "I know at this point, you've probably tried everything, but sometimes it just takes someone else to say what you were thinking or to agree/disagree with you for you to come to a decision.\n\n"
    },
    {
      "time": "4 Nov 2003 — 7:11pm",
      "content": "You know whats funny, is all the frustration and talk on this project really gave me a few ideas -- for a DIFFERENT project ![:-)](http://web.archive.org/web/20131013171038im_/http:/www.typophile.com/forums/clipart/happy.gif), so I switched gears for a little bit, and I am jamming on this other project. Its funny sometimes how you try to make ideas work for a project, only to find at a later point, they are perfect for something completly different. ;)   \n   \nOff to work.. (not that I ever really stopped ![:-)](http://web.archive.org/web/20131013171038im_/http:/www.typophile.com/forums/clipart/happy.gif))   \n   \nHildebrant.\n\n"
    },
    {
      "time": "4 Nov 2003 — 7:13pm",
      "content": "Could there be a bug in the forum application?   \n   \nThats an UNDERSTATEMENT. ![:-)](http://web.archive.org/web/20131013171038im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "4 Nov 2003 — 7:13pm",
      "content": "Hmmm, I clicked on the post this message button ONCE, brought the dog out, did laundry, vacuumed the office. When I came back, I saw an error message \"accessing post this message something failed,\" but the next thing I know, the message was posted four times!   \n   \nCould there be a bug in the forum application? Perhaps it tries to post the message again and again even though it was already posted the first time?   \n   \nIt is making me look very repetitive.   \n   \n:-/\n\n"
    },
    {
      "time": "4 Nov 2003 — 7:14pm",
      "content": "Question,   \n   \nWhat do you think is the best way to produce a single spot color image for the BG texture. I'm working in Illustrator 10 right now. I now how to do this with a monotone image and import into Indesign, but I'm a little rusty with image work inside of Illustrator.   \n   \nhildebrant.\n\n"
    },
    {
      "time": "5 Nov 2003 — 6:08am",
      "content": "Kyle why not just specify a textured paper rather than create it with ink. I have a horror story about paper and printing if someone is interested I will post it. Dan\n\n"
    },
    {
      "time": "5 Nov 2003 — 10:02am",
      "content": "If they're still trying to fix it, great.   \nBut I'm worried they've \"arrived\"...   \nIt's really gotten worse for me over here.   \nI wonder how much Windows testing they're doing.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Nov 2003 — 10:13am",
      "content": "\\>\\> What do you think is the best way to produce a   \nsingle spot color image for the BG texture...   \n   \nIf you are going to output from Illustrator...   \n   \nYou can make a high-rez bitmap tiff and place it in Illustrator and simply click on your spot color.   \n   \nDoes anyone have a definitive answer if Venus is indeed gone?   \n   \nI was going to make her a RIP logo and maybe start a petition.   \n   \nbj\n\n"
    },
    {
      "time": "5 Nov 2003 — 8:50pm",
      "content": "\\> to complain over something that they are trying to fix is a bit mean. Innit?   \n   \nI don't think anyone is complaining here. We're _giving feedback_. The moderators need to know that the repeated posts are not a result of idiotic user behaviour. Or even impatient user behaviour.   \n   \nAnd certainly there's no meanness intended. We're making jokes, having a laugh, telling it like it is. Anything but being mean. I think everyone needs to stop reading malice behind every post.   \n   \nCalling us mean, now that's\n\n"
    },
    {
      "time": "5 Nov 2003 — 8:55pm",
      "content": "Karen \"Kalashnikov\" Huang. ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "5 Nov 2003 — 9:04pm",
      "content": "Hrant, funny you should be one to talk.   \n   \nI was gonna say \"I think everyone needs to stop reading malice behind every post. (Except posts by Hrant.)\"   \n   \nBut I thought I'd leave you out of it. Afraid you won't get the joke. ![:-)](http://web.archive.org/web/20131013171038im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nNow everything I post appears four times and I have to go to \"Edit Profile\" to delete three of them. And I even tried not leaving the page while posting. Just staying on the same page and waiting.\n\n"
    },
    {
      "time": "5 Nov 2003 — 9:12pm",
      "content": "1) I have a certain respect for the Kalashnikov. Even the Chinese-made imitation model.   \n2) You're right to think my sense of humor is whacked. I think it would have been the funniest thing in the world if Baby Jessica turned out to be the Anti-Christ.   \n3) I don't think you should bother deleting the duplicates.   \n4) Note the winkie in my previous post, and loosen up. I'd advise chewing gum but I understand that's become illegal there. ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "6 Nov 2003 — 7:46pm",
      "content": "No worries Tiff.   \n   \n:-)   \n   \n(I hope this post doesn't appear four times. Apologies to everyone annoyed by the quadruple posts.)   \n   \nBack to Kyle's discussion.\n\n"
    },
    {
      "time": "6 Nov 2003 — 7:46pm",
      "content": "No worries Tiff.   \n   \n:-)   \n   \n(I hope this post doesn't appear four times. Apologies to everyone annoyed by the quadruple posts.)   \n   \nBack to Kyle's discussion.\n\n"
    },
    {
      "time": "5 Nov 2003 — 9:54am",
      "content": "[Borrowing Joe's moderator hat]   \n   \nMaybe your keyboard is sticky, Karen, maybe? I know that my keyboard has a few keys that stick (too much chocolate and caramel, I admit it.)   \n   \n[Giving the moderator hat back to Joe, and now putting my user hat on.]   \n   \nAs for other having problems. Errors and accidental double posts, and \"horrendous\" typography. I have to say that a bit more patience might be nice. We have a wonderful forum here, and to complain over something that they are trying to fix is a bit mean. Innit?\n\n"
    },
    {
      "time": "6 Nov 2003 — 9:04am",
      "content": "Karen, true true, I shouldn't have used the word \"mean\".\n\n"
    }
  ]
}
