{
  "id": "19136",
  "title": "Ponderings from a Greenhorn...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello all.\n\nI am a young snot nosed student  \nin pursuit of a degree in this  \nwide world of design.\n\nI was assigned to give an oral report  \nto the rest of my cohorts and would  \nappreciate any feedback from seasoned veterans.\n\nRound One.\n\nWhat’s the most important skill  \nyou want in a junior designer?\n\nRound Two.\n\nWhat design skill did you learn  \nthat was the most useful?\n\nRound Three.\n\nWhat was a waste of time?\n\nThat’s all Folks!\n\n [‹ armenian text](http://web.archive.org/web/20080829115909/http:/www.typophile.com/node/19067 \"Go to previous forum topic\") [Is there a term to describe the dot in a lowercase \"i\" ? ›](http://web.archive.org/web/20080829115909/http:/www.typophile.com/node/19054 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080829115909/http://www.typophile.com/user/12385\" title=\"View user profile.\">dayxonex</a>",
  "time": "<br>",
  "uid": "12385",
  "comments": [
    {
      "time": " 9.Apr.2006 3.15am",
      "content": "Drawing, especially the ability to quickly represent an idea.  \nI think that covers rounds one and two. As for three I don’t think anything is a total waste of time, certainly there are subjects that seem that I will never use but one never knows.  \nGood luck with the degree, what area(s) of design are you interested in?  \nTim\n\n"
    },
    {
      "time": " 9.Apr.2006 7.44am",
      "content": "Conditional of the kind of design you’re interested in, but if you plan to do print work for the most part I’d give the following:\n\n1.  \nThe 3 P’s – Prepress, prepress, production. If you want to make it as a designer you have to start somewhere and one of the best ways to show that you deserve those creative projects and are worth hiring is file handling. It’s surprising how many recent grads do not know how to properly package a file for the printers or know the finer nuances of production work. Some may argue that there’s great people that only do this their entire career, and it’s true not every designer will be great and will find their niche doing one of these very important jobs. Knowing these skills well will at least get your foot in the door at a local print shop; up to a large studio or agency. It improves your speed on the computer, forces you into the habit of checking details and will help you immensely as you further your career.\n\n2.  \nPaper first. It’s the computer age and there is a strong urge to not to roughs/comps/ sketches on paper. It’s a skill I find that gets over looked. Learning to draw is a great skill that everyone should try to work on.\n\n3.  \nLearning isn’t really a waste of time, sure you’ll find things that are stupid or that you already knew, but overall there’s nothing that comes to mind that was a ’complete waste of time’.\n\n"
    },
    {
      "time": " 9.Apr.2006 9.25am",
      "content": "In addition to what has already been said:\n\nRound One:  \nI like to see conscious decisions in a junior designer. I.E. designing with a concrete plan and having control over the decisions you make. The contrary to this would be doing things because you think they look pretty. After all, instinct (in regards to design atleast) is something learned. As Jan Tschichold said, “Feelings have to mature into knowledge about the consequences of formal decisions.”\n\nRound Two.\n\nGrids Grids Grids.  \n(Well, that’s me atleast).\n\nRound Three.  \nThe only waste of time is procrastination.\n\nResponses/questions/concerns welcome  \n—Six\n\n"
    },
    {
      "time": " 9.Apr.2006 1.08pm",
      "content": "\\> _ **What’s the most important skill you want in a junior designer?** _\n\nThis is a little tricky to respond to, but favor truthful advice to students than politically correct suggestions (BTW — the replies above are sound and without compromise.)\n\nIn the business world, the job descriptions for “Junior” and “Senior” designer have little to do with the age or experience of a candidate and more to do about design skill sets/competency, organizational/supervisory abilities, production/schedule mindedness and “professionalism” of presentation (both in terms of how well you can present ideas to clients, and how you project yourself as an individual).\n\nI stronly suggest (for those seeking employment after graduation) that you personally drop descriptions of “junior” and “senior” and start describing yourselves as “designer”. Also, drop any specialized descriptions such as “graphic design” “corporate communications” “branding designer” “web designer” when presenting or even thinking about yourselves, because in the business world the description “pidgeon-holes” you, making it difficult to take on projects beyond your self proclaimed title.\n\nNow this may seem to have strayed from your question, but when a person comes in to meet me saying they are a “web designer”, I look for particular skill sets. If you come to me saying you are a “junior designer”, another set of signals start flashing in my mind — Do I want to take time to train you? How fast and how much can your learn related to specific tasks and responsibilities? How far can you go given the opportunity?\n\nMany, many people have remained “junior designers” for their entire profession. So what is the most important question I ask myself for a “designer” of any description?  \n_Can this person passionately contribute to collaborative problem solving?_\n\n\\> _ **What design skill did you learn that was the most useful?** _  \nThe willingness to scrap everything and approach the problem from scratch.\n\n\\> _ **What was a waste of time?** _  \nAttempts at enhancing or justifying a design through verbal or written description.\n\n"
    },
    {
      "time": " 10.Apr.2006 3.51am",
      "content": "Round One  \nDrawing\n\nRound Two  \nDrawing\n\nRound Three  \nNot drawing\n\nSorry, couldn’t resist the temptation.  \nI love these forums, wish I could contribute something useful.  \nBack to lurking.\n\n"
    },
    {
      "time": " 11.Apr.2006 12.40am",
      "content": "At this point I would have to say I am still learning  \nthe basic forms of design and I am trying to find my niche.  \nthank you all for your feedback.\n\nalley\n\n"
    },
    {
      "time": " 11.Apr.2006 12.45am",
      "content": "Six...\n\nThank you for taking the time to answer  \nmy questions. Your feedback has been  \nmost helpful. I am curious.\n\nIs it common for student of design  \nto feel somewhat unsure of where  \nhis place will be in this profession?  \nWas there any point in your education  \nyou felt you weren’t certain what part of design  \nyou would fit in?\n\nthanks again! alley.\n\n"
    },
    {
      "time": " 11.Apr.2006 3.31am",
      "content": "_Is it common for student of design  \nto feel somewhat unsure of where  \nhis place will be in this profession?  \nWas there any point in your education  \nyou felt you weren’t certain what part of design  \nyou would fit in?_    \nShort answer yes and yes. If you are unsure which direction you want to take try various disciplines, best of all try to find holiday jobs so you can appreciate some real work environments.  \nTim\n\n"
    },
    {
      "time": " 11.Apr.2006 7.52am",
      "content": "_Is it common for student of design  \nto feel somewhat unsure of where  \nhis place will be in this profession?  \nWas there any point in your education  \nyou felt you weren’t certain what part of design  \nyou would fit in?_\n\nGlad I could be of some help. Most of my correspondence here will probably be on the receiving end of the counsel. I wouldn’t say it’s uncommon at all for young designers to be unsure of their place in design. I’m only 23, and it’s taken me this long to really figure out what the direction that I’d like to follow. Many of my peers, especially the more casual designers, are just out there looking for work. I would say the serious students—the ambitious/motivated ones—have an idea of where they’d like to be, but that comes in time.\n\n"
    }
  ]
}
