{
  "id": "19131",
  "title": "Book Jacket for James Joyce's Finnegans Wake",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "Hello Typophilers, please help if you can or if you love books,\n\nI’m doing a book jacket for Finnegan’s Wake by James Joyce. Here’s what I’ve gathered from ’the wake’ Half of the language is completely made up. As if the book is supposed to be somewhere between drunken gibberish, poetry, and literature. Some have compared the reading experience to being in a flood, where you see poles start to move one way, so you think you know where you’re going, then you see poles move in the complete opposite direction. Quite hopeless in many ways. Also the title is believed to be a play off of words. Wake as in a funeral’s wake, and also ’waking up.’ There are strong irish mythologies in the book too. The book might also be the first in history to start the first sentence in mid sentence and on the last page, end on the sentence you were missing - so you could probably start anywhere in the book and it wouldn’t matter.\n\nThis is still fun right? :)\n\nI am trying for a type-only solution.\n\nDoes anyone have suggestions on this?\n\n ![](http://web.archive.org/web/20081007145215im_/http:/typophile.com/files/2.gif)\n\nthanks in advance everyone.\n\n [‹ ADVICE PLEASE: Display style for portfolio pics...](http://web.archive.org/web/20081007145215/http:/typophile.com/node/19491 \"Go to previous forum topic\") [PhD Thesis Typography in LaTeX ›](http://web.archive.org/web/20081007145215/http:/typophile.com/node/16830 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007145215/http://typophile.com/user/9639\" title=\"View user profile.\">thomasng</a>",
  "time": "<br>",
  "uid": "9639",
  "comments": [
    {
      "time": " 8.Apr.2006 3.59pm",
      "content": "[www.fanihi.com](http://web.archive.org/web/20081007145215/http:/www.fanihi.com/ \"www.fanihi.com\")\n\n"
    },
    {
      "time": " 8.Apr.2006 4.00pm",
      "content": "Ok, I don’t know what I just did, this is the actual image I meant to post.  \n [http://www.fanihi.com/joyce/2.gif](http://web.archive.org/web/20081007145215/http:/www.fanihi.com/joyce/2.gif \"http://www.fanihi.com/joyce/2.gif\")\n\n"
    },
    {
      "time": " 8.Apr.2006 5.52pm",
      "content": "Hi Thomas, sounds like an interesting assignment. I’m a fellow designer, I’m sure there will be a conflict in expressing the randomness of the content and the need for a legible title for buyers (ie: the publisher’s marketing department). Please keep us posted as you progress.\n\nAs far as feedback on the type, I didn’t immediately feel a connection between your description of the book and your solution. Did you have any other ideas?\n\n"
    },
    {
      "time": " 8.Apr.2006 6.07pm",
      "content": "Honestly, I’d take a step back from trying to find meaning in the body that will reflect itself in the type for a bit, and start over. Currently it’s far too hard to decipher the title and the weights of the letters do not look even. Also, for the “A NOVEL” text, there’s no reason to have the letters overlap. The line underneath serves no real purpose; it’s set to the width of “James Joyce” below, which is in its own box, visually separating it from the line and leaves the line feeling awkward; drawing the eye to it for no real reason.\n\nThe novel is a complex puzzle/game about human consciousness, and is the “night” version of ulysses, joyce’s “day” novel, and has a river as its centrepiece – or so says my English Lit. friend whom I asked about this.\n\nIf it uses Irish Mythology look there, find some type that represents the era or old Irish culture would be my suggestion.\n\nCheers!\n\n"
    },
    {
      "time": " 9.Apr.2006 2.09pm",
      "content": "Hi Chris and Jselig, THANK YOU both for your responses.\n\nI think you are completely right about my execution being far from the mark.\n\nHere are some previoius executions.  \n [http://www.fanihi.com/joyce/](http://web.archive.org/web/20081007145215/http:/www.fanihi.com/joyce/ \"http://www.fanihi.com/joyce/\")  \nThe first one is meant to suggest something ’off’ happening. Suggesting conscious-subconcious.\n\n#2 is an experiment with dingbats .... the idea is to compare reading ’the wake’ to being in a shakespeare play, where for me, it takes a while before anything makes sense, then it does - often this cycle repeats itself.\n\nI’d like #3 to eventually say, “this is art, down to the letters” - As to say that Joyce was consciously trying put his work in a whole new category.\n\njselig, I aggree with you, I probably do need to step back a bit more.  \nI do like how Joyce’s novels all seem to intersect with each other. I have been noodling with ’celtic knots’ (no easy task), uncial letterforms, and photos from the book of kells. Also wondering what irish-modernish or celtic-modernism looks like.\n\nHere’s a nice article for everyone.  \n [http://wwwa.britannica.com/eb/article-13016](http://web.archive.org/web/20081007145215/http:/wwwa.britannica.com/eb/article-13016 \"http://wwwa.britannica.com/eb/article-13016\")\n\nBTW, LOVE the day/night observation and the ’river’ metaphor.. it works so well with ’stream-of-consciousness’ and ’all-connectedness’ aspect of the book.. I will have to try this and get back to you both.\n\nThank you both - I’m inspired!\n\n"
    },
    {
      "time": " 24.Apr.2006 6.07pm",
      "content": "Joyce would have loathed anything obviously Celtic! Try Poliphilus caps, properly spaced, with any illustration or ornament to suit a quest narrative that attempts to map both the human psyche and the history of artistic perception.\n\n"
    }
  ]
}
