{
  "id": "19157",
  "title": "In Design question & solicitation for excuses",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I understand that in order to fully enjoy OT characters that are beyond the default 256 I am used to, I need a program like In Design. I am curious does it have the same “save as” functions as PS, or do you have to import your layout back to PS to view things like results of .jpg compression choices?\n\nWhat brought this on was after viewing Paul Hunt’s new **[ZANER SET](http://web.archive.org/web/20080929202905/http:/www.p22.com/ihof/zanerset.html)** and **[ALLYSON PRO](http://web.archive.org/web/20080929202905/http:/p22.com/ihof/allyson.html)** fonts, I am burdened with an urgent feeling that I will soon need to start thinking up a series of excuses to explain to my wife why I need In Design. Not to mention the sale price of both sets. This will be one of my hardest sales ever, so any additional excuses, gladly accepted.\n\n [‹ What does this symbol 'ß' stands for](http://web.archive.org/web/20080929202905/http:/typophile.com/node/19263 \"Go to previous forum topic\") [Human Clock ›](http://web.archive.org/web/20080929202905/http:/typophile.com/node/19194 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080929202905/http://typophile.com/user/12014\" title=\"View user profile.\">fontplayer</a>",
  "time": "<br>",
  "uid": "12014",
  "comments": [
    {
      "time": " 10.Apr.2006 11.56am",
      "content": "If you plan on doing anything beyond image editing, Photoshop isn’t the appropriate application to use. That should be the only excuse that you need, but I’m sure that people will be able to provide you with lots of good ones anyway. As for the first part of your question, I will leave that to someone that knows that they’re talking about.\n\n"
    },
    {
      "time": " 11.Apr.2006 5.51am",
      "content": "I’m not quite sure what you’re planning re:”results of jpeg compression”; using inDesign to create jpegs is kinda like banging on a screwdriver with a hammer to chisel out some wood; it works, but a chisel would do a much better job.\n\nInDesign does have an export to jpeg function, but it’s not very robust: I haven’t found any way to make the export anything other than 72 dpi. If I need a bitmapped version of something I’ve done in InDy, I usually export it as a pdf, then I open the pdf with Photoshop. That way I get much more flexibility.\n\nIllustrator does OT, and has stronger jpeg export functionality. (I think it’s cheaper than InDy, too.) Depending on what you are intending to create, it might be something to look into.\n\nJay\n\n"
    },
    {
      "time": " 11.Apr.2006 7.14am",
      "content": "I have Illustrator 9 (not installed because I haven’t had a use for it). Can that use the OT extended characters? Or does it have to be CS?\n\n"
    },
    {
      "time": " 11.Apr.2006 7.42am",
      "content": "No. It must be CS or CS2. Same with Photoshop.\n\nInDesign 2.0, however, will give you access to most OT features. And I have heard that some can even be reached in 1.5, but I’ve never tried that myself.\n\n"
    },
    {
      "time": " 11.Apr.2006 10.13am",
      "content": "\\>And I have heard that some can even be reached in 1.5, but I’ve never tried that myself.\n\nTom Phinney would know!\n\n ![](http://web.archive.org/web/20080929202905im_/http:/typophile.com/files/danphinnsignal1.jpg)\n\n"
    },
    {
      "time": " 11.Apr.2006 10.16am",
      "content": "Upgrade Illustrator from 9 (it seems) to CS2 for $169 US. It’s as OpenType savvy as InDesign.\n\nIllustrator might be of much interest to you. The fonts you play with all live in an outline format; Illustrator is all about outlines, the same kind as those used in FontLab and Fontographer. So you might end up gaining a lot of functionality for a small investment.\n\n"
    },
    {
      "time": " 11.Apr.2006 10.22am",
      "content": "as said, photoshop is an image altering / creation software, NOT a software to set more than a few words in! it rasters type, and that is something you dont want if you want to print anything.\n\nillustrator is to do create (i wrote “raster” here, which is totally wrong, as it is a vector-programm, didnt have much time when i posted) illustrations or documents with only one page.\n\nindesign is to create documents with one or more pages, with great options and many time-saving things (like nested formats, etc..).\n\n—-\n\nlets say it that way: setting text in photoshop is like reading disney-comics instead of a literature classic - it has a function, it works well, but its just not the same and shouldnt be used for the same things.\n\n"
    },
    {
      "time": " 11.Apr.2006 11.23am",
      "content": "Ditto what Kesh said, and others have suggested in other threads you’ve posted. If you’re serious about working w/fonts you need InDy. Nuff said.\n\n"
    },
    {
      "time": " 11.Apr.2006 11.32am",
      "content": "it all starts with a little casual font usage... and then you get a type addiction... and then you start feeling the need to access advanced typographic features... and all your $$$ starts going to designing software... and before you know it, you a full-fledged addict... it’s a downward spiral. \\>^P  \ni was gifted my copy of Adobe CS by my mother, and i think she’s got her money’s worth out of it with all the posters, logos, programs and other paraphanelia i’ve designed for her. It’s a great investment. You can always download trial versions of the software from Adobe.com and play with it for a month and see if it’s something that you really need.\n\n"
    },
    {
      "time": " 11.Apr.2006 11.38am",
      "content": "I appreciate all the comments. When I have recovered from tax season, I’ll probably get In Design. But knowing there is a trial version is comforting. Thanks.\n\n"
    },
    {
      "time": " 11.Apr.2006 11.41am",
      "content": "Btw,. Paul, you bear a remarkable resemblance to Richard Boone. Brings back the memory of smoking cap guns. (if that smoke was bad for you it would explain a lot)  \n: )\n\n"
    },
    {
      "time": " 11.Apr.2006 12.27pm",
      "content": "Dennis: _I have Illustrator 9 [...]. Can that use the OT extended characters?_  \nDan: _No. It must be CS or CS2. Same with Photoshop._\n\nNot entirely true. Photoshop 6/7 support a couple of OT features.\n\nIt is possible to know which features are supported on pre-CS versions by checking page 14 of Adobe’s [OT Guide](http://web.archive.org/web/20080929202905/http:/adobe.com/type/browser/pdfs/OTGuide.pdf) _(PDF file)_.\n\n"
    },
    {
      "time": " 11.Apr.2006 12.50pm",
      "content": "Also, if there is a glyph pallette in Illustrator 9, you should be able to access all glyphs that way.\n\n"
    },
    {
      "time": " 11.Apr.2006 1.03pm",
      "content": "Neither Il. 9 or 10 have glyph palettes. I am still using PS 7/IL 10/InD 2.0 at home. I wish I could do more. But soon I will upgrade, and all will be well.\n\nSi, if that image of Tom Phinney’s heady ever popped up full-screen on my desktop, I don’t think I would stay put long enough to try and channel it ;-)\n\n"
    },
    {
      "time": " 11.Apr.2006 8.01pm",
      "content": "\\> Si, if that image of Tom Phinney’s heady ever popped up full-screen on my desktop, I don’t think I would stay put long enough to try and channel it ;-)\n\nIn cases like this I’d either yank the power cable or hit the panic button, or both!\n\n"
    },
    {
      "time": " 12.Apr.2006 5.53am",
      "content": "Wow, I can see the Phinn-signal all the way from the UK!\n\nYes, InDesign 1.5 supported several OpenType layout features. Small caps, proportional oldstyle figures, and standard ligatures, IIRC. But ID 2 really added a lot of OT features.\n\nT\n\n"
    },
    {
      "time": " 12.Apr.2006 6.04am",
      "content": "“Paul, you bear a remarkable resemblance to Richard Boone.”\n\nChrisL\n\n ![](http://web.archive.org/web/20080929202905im_/http:/typophile.com/files/havegunCard.jpg)\n\n"
    },
    {
      "time": " 12.Apr.2006 6.07am",
      "content": "”...series of excuses to explain to my wife why I need In Design.”\n\nHow about if you just promise to do the dishes for a whole month? :-)\n\nChrisL\n\n"
    },
    {
      "time": " 12.Apr.2006 7.30am",
      "content": "I was in a thrift store (a hobby) and I overheard this little girl telling her mom, “PuLeeeease? If you’ll get me this, I’ll do the dishes, and \\*everything\\*!”\n\nWhat a deal.  \n: )\n\n"
    },
    {
      "time": " 13.Apr.2006 4.14pm",
      "content": "A new development is that I was told today that it is possible to network with Windows on a Mac, and that I might be able to use my $1,500 notebook allotment towards a Mac notebook.\n\nThen maybe I could get a good friend from going on and on about the glories of his Mac every time we talk. (he went from Windows 98 to the current Mac OS, so you’d think he was talking about the benefits of eternal salvation)\n\nOf course two weeks after I switch, there will be a news conference that Bill Gates has bought out Apple, or something like that.\n\n"
    },
    {
      "time": " 14.Apr.2006 12.08am",
      "content": "_Of course two weeks after I switch, there will be a news conference that Bill Gates has bought out Apple, or something like that._\n\nHaha. Or it could be the other way ’round if you believe Cringley.\n\n[http://www.pbs.org/cringely/pulpit/pulpit20060406.html](http://web.archive.org/web/20080929202905/http:/www.pbs.org/cringely/pulpit/pulpit20060406.html \"http://www.pbs.org/cringely/pulpit/pulpit20060406.html\")\n\n"
    },
    {
      "time": " 14.Apr.2006 6.31am",
      "content": "\\>A new development is that I was told today that it is possible to  \n\\>network with Windows on a Mac, and that I might be able to use my  \n\\>$1,500 notebook allotment towards a Mac notebook.\n\nThat is very true. My employer is totally PC based, I work at home on a Mac. I can download InDesign files from work, edit them on them on my mac, then when I’m at work the next day I work on them using the PC. No problems at all.\n\nJay\n\n"
    }
  ]
}
