{
  "id": "19179",
  "title": "Licence Transfer?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "What exactly constitutes a font licence transfer? For instance, my friend recently bought a used Apple Powerbook G4 with 1000 fonts <cite>already</cite> installed. Who owns the font licence now? Is it the previous owner’s or my friend’s responsibility to delete the fonts from the hard drive?\n\nHow do you <cite>usually</cite> transfer a licence? Is there a common ground here?\n\nI had a quick look through some of the EULAs on disk and I admit I was perplexed by the legal-lingo and general lack of standardisation regarding licence transfer.\n\n",
  "author": "Geoff Riding",
  "time": "11 Apr 2006 — 3:48am",
  "uid": "7479",
  "comments": [
    {
      "time": "11 Apr 2006 — 5:54am",
      "content": "I don't think licenses can be transferred whatsoever, as the user is **granted the permission to use** the fonts, but doesn't actually _own_ them. Common logic tells us you can't transfer what you don't own. If another end user wants to use those same fonts, he needs to purchase his own license.\n\nIt was the previous owner's responsiblity to delete the copies of the fonts from his hard drive before selling the computer to your friend. But it's your friend's responsibility _not_ to use said copies of fonts -- if he does, he is liable for prosecution.\n\nAnyone, correct me if I'm wrong.\n\n"
    },
    {
      "time": "11 Apr 2006 — 6:07am",
      "content": "Hi Yves, that was my inital assumption (that licences non-transferrable) however some of the EULAs had transfer clauses such as the example below.\n\nExample; [Monotype](http://web.archive.org/web/20131015045814/http:/www.fonts.com/Legal/MI-EULA.htm)  \n\"You may transfer all your rights to use the Font Software to another person or legal entity provided that (i) the transferee accepts and agrees to be bound by all the terms and conditions of the Agreement, and (ii) you destroy all copies of the Font Software, including all copies stored in the memory of a hardware device.\"\n\nI'm no lawyer, I could be misinterpreting all this. :^)\n\n"
    },
    {
      "time": "11 Apr 2006 — 6:19am",
      "content": "Also have a look at this nifty chart by Nathan Matteson and Tiffany in Interrobang magazine.\n\n[Who Allows What?](http://web.archive.org/web/20131015045814/http:/fontlab.wikidev.net/upload/c/c1/Interrobang2-EULA-chart.gif)\n\nLegally, how do you transfer a licence? A written agreement of licence transfer between the two parties?\n\nP.S. I advised my friend to do a fresh install of OS X thus losing all previous font data but it did raise the question on how licence transfers occur.\n\n"
    },
    {
      "time": "11 Apr 2006 — 7:09am",
      "content": "_“You may transfer all your rights to use the Font Software to another person or legal entity provided that (i) the transferee accepts and agrees to be bound by all the terms and conditions of the Agreement, and (ii) you destroy all copies of the Font Software, including all copies stored in the memory of a hardware device.”_\n\nSeems rather simnple, I think.\n\nYour friend can keep using the Monotype\\* fonts on the purchased computer as long as:\n\n1. The seller was the real licensee of the fonts on his computer before he sold the machine.  \n2. The seller deletes all other copies of the fonts he has, including copies he may have installed on other machines.  \n3. Your firend agrees to abide by all of the Monotype EULA's terms.\n\nOtherwise, your friend must delete all the Monotype fonts on his new computer himself. He did not purchase a license for them, and does not have one simply through acquisition of the computer.\n\n\\* Other foundries and other fonts might have differnt EULA restrictions regarding license transfers. You friend must check up after all 1000 of the fonts.\n\n"
    },
    {
      "time": "11 Apr 2006 — 7:17am",
      "content": "Hmmm, it is that simple?\n\nI think it'd be still quite risky to use them as we are not absolutely sure if the seller had really licenced them, for all we could know he/she could've downloaded them illegally online. This was basically the reason why I told my friend he should just reformat.\n\nThanks for the responses. :^)\n\n"
    },
    {
      "time": "11 Apr 2006 — 7:41am",
      "content": "Well, it depends on who the seller is!\n\nIf you bought the computer on ebay, clean it. Forget it. If you bought the computer from a colleague or close friend, just ask if the font licenses were included in the selling price.\n\n(Of course, it isn't simple at all in the buyer's sense… if the fonts are legit, he still has to look at the EULAs for each foundry to see whether or not he can even have possibly purchased the license from the orginal owner or not.)\n\n"
    },
    {
      "time": "11 Apr 2006 — 7:59am",
      "content": "My friend probably bought the laptop at a bargain price through a friend's friend's colleague's colleague with no direct contact, a little too risky. ;^)\n\nI'll pass on your advice and suggest that he should give the previous owner a call re. the fonts to play it safe.\n\n"
    },
    {
      "time": "11 Apr 2006 — 9:00am",
      "content": "Every foundry has their own stipulations about the transferability of their fonts within their EULA.\n\n- Did the person from which your friend bought the laptop also give him the license to the laptop? The fonts which are installed with the system are now licensed to your friend.\n\n- If the fonts are not part of the system, your friend most likely does not hold the license and should probably delete them.\n\n"
    },
    {
      "time": "11 Apr 2006 — 9:01am",
      "content": "FWIW: When I license type I always make sure I can transfer the license or at least discuss my personal situation with the foundry.\n\n"
    },
    {
      "time": "11 Apr 2006 — 9:11am",
      "content": "\\> Every foundry has their own stipulations about the transferability of their fonts within their EULA.\n\nYour chart makes this quite clear, thanks!\n\nAnd yes, the ownership has been transferred to my friend, it's still under warranty as such. I wonder if the seller had simply forgotten to take the fonts off the computer.\n\nBTW, would you mind sharing the mystery behind FWIW? :^)\n\n"
    },
    {
      "time": "11 Apr 2006 — 9:15am",
      "content": "FWIW = For what it's worth.\n\nGeoff, you could always list the fonts that are on the machine and we could help you figure out if they are system fonts or not. Unless, of course, your friend knows this already.\n\nBe warned, that chart is not perfect. As I was writing the article, foundries were writing to me to tell me they were changing things. It felt good to know I was stirring the pot.\n\n"
    },
    {
      "time": "11 Apr 2006 — 9:51am",
      "content": "Tiffany, we owe you for that. Many foundries had been increasingly  \ndigging deeper trenches, for some years. You flushed their trenches.\n\nhhp\n\n"
    },
    {
      "time": "11 Apr 2006 — 10:04am",
      "content": "Thanks for the offer to help us out with sorting the fonts but I think we'll manage. :^)\n\nTiffany, I got the chart from [here](http://web.archive.org/web/20131015045814/http:/fontlab.wikidev.net/The_Case_for_a_User-Friendly_EULA). This page is great and I'm glad to hear about the reaction, although I'm a little behind on things obviously.\n\n"
    },
    {
      "time": "11 Apr 2006 — 10:36am",
      "content": "Right. That is the chart. But, it is generally out-of-date and in need of a serious re-visit. This is something that is in the works but I can't/won't make any promises.\n\n"
    },
    {
      "time": "11 Apr 2006 — 10:56am",
      "content": "is this chart something we can recreate on the web somewhere, perhaps in the wiki with html, and it can be updated when foundries change their policies or add new foundry information to it?\n\n"
    },
    {
      "time": "11 Apr 2006 — 10:59am",
      "content": "It is going to be on the web when it happens.\n\n"
    },
    {
      "time": "22 Apr 2006 — 12:21pm",
      "content": "Let me just point out that even if the EULA is binding on the licensee (a big if), the new owner of the computer is not bound by its terms, because of what is known as \"privity of the contract\" (a contract cannot bind a third party).\n\nHowever, in that case the new owner in possession of the fonts might be restricted by law (not by the EULA) from using the fonts for commercial purposes, but that really depends on the jurisdiction.\n\n"
    },
    {
      "time": "22 Apr 2006 — 10:13pm",
      "content": "Well, I'd hope that people who sell their computers re-format the drive before doing so.\n\n"
    },
    {
      "time": "22 Apr 2006 — 11:44pm",
      "content": "My friend reformatted the drive, removing all previous font data as we have good reason to suspect that most if not all fonts were probably illegally downloaded, some of the font folders had suspicious \"name tags\" which are commonly used by piracy-groups. eg. FontName-TYPO\n\nBut it's not like he lost anything, as it is my opinion that he didn't gain anything in the first place.\n\n"
    }
  ]
}
