{
  "id": "19172",
  "title": "How many is too many?",
  "forum": "Design",
  "tags": [

  ],
  "content": "The company I work for needs to purchase a font for use in a trade show poster design.\n\nBy itself, the font (Interstate-Light), is $40 & the whole family, (40 fonts, 7 weights) is $1440. It’s a big company and they can afford it—so cost is not a big deal.\n\nCould ~280 fonts ever be necessary? We’re only using one for the posters & maybe a few more for collateral materials. How many is just enough?\n\n [‹ Why is a zero often very contrast-less?](http://web.archive.org/web/20080929085053/http:/typophile.com/node/17772 \"Go to previous forum topic\") [PixelFont fits with Frutiger ›](http://web.archive.org/web/20080929085053/http:/typophile.com/node/19218 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080929085053/http://typophile.com/user/11281\" title=\"View user profile.\">mcian</a>",
  "time": "<br>",
  "uid": "11281",
  "comments": [
    {
      "time": " 11.Apr.2006 12.46am",
      "content": "Hi Ian,\n\nI think you just answered your own question. 280 fonts is (not just propably) too much if you only make posters and little collateral materials. It would make sence if you are doing the complete corporate design on all levels.  \nI tend to use not more than 6 fonts per client/projects: regular, bold, black, + corresponding italics.  \nInterstate has very effective condensed and even compressed fonts that might be very practical for some print material. So my collection sometimes extends to 9 fonts (romans only).\n\nBest regards,  \n®\n\n[www.characters.nl](http://web.archive.org/web/20080929085053/http:/www.characters.nl/ \"www.characters.nl\") { Dutch typography to express yourself }\n\n"
    },
    {
      "time": " 11.Apr.2006 7.38am",
      "content": "I have found that working with very large families, such as Neutra or Knockout, is too much work. I hardly ever use those fonts because the range of styles is too large and complex for day-to-day design. So large, in fact, that it becomes necessary to make a printed chart to hang near my desk to refer back to.\n\nIt is tempting to get a huge number of fonts all at once — and perhaps you should, if you have the opportunity — but only install the ones you need, and keep a printed copy of the sample on hand. Otherwise you may find yourself bogged down with a huge font menu.\n\n"
    },
    {
      "time": " 11.Apr.2006 1.12pm",
      "content": "I had to doublecheck... Interstate is 40 weights “only”. But still in my eyes it’s a huge family. If you can’t see any immediate use for the full family, I don’t really see any point of buy more than the single weight alone. My own biggest family Sophisto, consists of 21 weights (or rather styles). A single weight is $40 and the whole family is “just” $179. Then you might think it is worth to by the whole thing. But in the Interstate case, the weights just add on without getting cheaper, more or less. I myself tend to get lost if the families are to big. To me it’s also a bigger challenge to use a moderate ammount of weights for a design and squeeze the most out of it all.\n\n"
    },
    {
      "time": " 11.Apr.2006 1.14pm",
      "content": "TO CLEARIFY:  \nRegarding Interstate I mean 40 fonts devided into 7 different weights.\n\n"
    },
    {
      "time": " 11.Apr.2006 2.12pm",
      "content": "I’ll say it. Greed is good. :^/ Seriously, if Interstate is going to be the typeface for all collateral and they can afford it you should save the money\\*—as you do save when you buy quantity—and buy as many as possible.\n\nOn the other hand. I have been known to skip weights when licensing type. For instance with Interstate, pick the absolutely necessary weights and styles and go every other one from there.\n\nweights:  \nHairline  \n**Thin**  \nExtra Light  \n**Light**  \nRegular  \n**Bold**  \nBlack  \n**Ultra Black**\n\nstyles:  \nCompressed  \n**Condensed**  \nRegular  \n**Italic**\n\n\\*It’s $40 for one or $25 ea for all. This is based on a license for 1 CPU.\n\n"
    },
    {
      "time": " 12.Apr.2006 1.21pm",
      "content": "See I would take it as a CPU issue if you are going to use the fonts on more than 5 CPUs then the costs go up, so you might, in your corporation, buy the licenses per weight noting the CPU issues\n\n"
    },
    {
      "time": " 12.Apr.2006 8.27pm",
      "content": "I agree with Tiffany on this, with one small exception... depending on the actual material, I would forgo the Hairline and thin unless your business is: Fashion, interior design, jewelry or general pompyness. Also, the Ultra black is fun, but really not that useful... Stay closer to the middle and mix it up a bit.\n\nOk, scratch that... use a different font. Try Champion Gothic from H&FJ\n\n[http://www.typography.com/catalog/champion/more.html](http://web.archive.org/web/20080929085053/http:/www.typography.com/catalog/champion/more.html \"http://www.typography.com/catalog/champion/more.html\")\n\n"
    }
  ]
}
