{
  "id": "19177",
  "title": "Viking influence",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi again all, I'm looking for advice on the selection of Viking style typefaces, can anyone recommend any in this nordic style?\n\nThanks in advance.\n\nR\n\n",
  "author": "R27",
  "time": "11 Apr 2006 — 2:46am",
  "uid": "10595",
  "comments": [
    {
      "time": "11 Apr 2006 — 2:53am",
      "content": "Hmmm… this is sort of tricky. The Vikings did not have \"typefaces.\" By the time that printing was invented, the Norsemen has long-since settled down, converted to Christianity, built European kingdoms, etc.\n\nDo you want something that mimics runic lettering? Do you want runes, or normal letters that look runic? (that would be anachronistic, I think…)\n\nI would stay away from Uncial typefaces. Lots of people use these for Viking-themed thing because they look old, mystical, medieval, etc. But these are usually based on Irish handwriting. There are several fonts that mimic Irish book hands from the time of the Viking invasions. But that would be inauthentic… sort of funny though, to use typefaces based on the style of handwritting of their victims.\n\nIf you want something Scandinavian, but old, you should look at fonts based on Germanic typefaces from 1450–1700 or maybe even 1800. The Scandinavians were printing with blackletter typefaces until then, just like the Germans, Austians, Dutch (sort of), Bohemians, etc. Heck, until as late as the 1860s, large parts of what is now northern Germany (and Poland?) belonged to Denmark and Sweden. Norway wasn't an independent country until the beginning of the 20th Century.\n\n"
    },
    {
      "time": "11 Apr 2006 — 4:00am",
      "content": "**Or You can do it the [faux](http://web.archive.org/web/20140307123659/http:/www.myfonts.com/fonts/pixymbols/faux-runic/) way**\n\nƒ\n\n"
    },
    {
      "time": "11 Apr 2006 — 4:16am",
      "content": "Is that 7th century or 12th, or somewhere in between? I didn't know there was so much in it, but this chap seems to have done the leg work. I suppose runic to celtic is the breadth of styles. [http://www.celtic-art.com/reference/viking\\_art.php3](http://web.archive.org/web/20140307123659/http:/www.celtic-art.com/reference/viking_art.php3 \"http://www.celtic-art.com/reference/viking\\_art.php3\")\n\n"
    }
  ]
}
