{
  "id": "19186",
  "title": "Variant infinity",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi all\n\nI’m currently cutting some characters for a translation of Frege’s  \n_Grundgesetze_ and one of them, a variant infinity, has me  \ncompletely baffled. Has anyone seen anything like it before?\n\n[http://miles.shef.ac.uk/~jjg/infinity.jpg](http://web.archive.org/web/20070808062040/http:/miles.shef.ac.uk/~jjg/infinity.jpg \"http://miles.shef.ac.uk/~jjg/infinity.jpg\")\n\n[I tried attaching the image but got “File copy failed: no directory configured,  \nor it could not be accessed”]\n\nI’m tempted to think that this was something designed by Frege himself  \nand cut by his printer (Hermann Pohl, Jenna, 1893); note the asymmetry  \nin the overbar, the uniform width of the bowl strokes. But Frege took  \ngreat care in the typography of the _Grundgesetze_ (and paid for  \nits publication himself) so surely this cannot be the case.\n\nAny pointers would be most gratefully received!\n\n [‹ need font for gravestone](http://web.archive.org/web/20070808062040/http:/typophile.com/node/19169 \"Go to previous forum topic\") [magazine layout design ›](http://web.archive.org/web/20070808062040/http:/typophile.com/node/19207 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070808062040/http://typophile.com/user/12428\" title=\"View user profile.\">jjg</a>",
  "time": "<br>",
  "uid": "12428",
  "comments": [
    {
      "time": " 11.Apr.2006 9.13am",
      "content": "[Bump]\n\nSomeone must have something to say about this.\n\n ![](http://web.archive.org/web/20070808062040im_/http:/typophile.com/files/bizarreinfinity.jpg)\n\n"
    },
    {
      "time": " 11.Apr.2006 9.26am",
      "content": "Nice scan.\n\n"
    },
    {
      "time": " 11.Apr.2006 9.50am",
      "content": "\\*\\*\\*\\* day.\n\n"
    },
    {
      "time": " 11.Apr.2006 11.40am",
      "content": "I’d describe this as two below breve’s (U+032E) with a combining double inverted breve (U+0361) above but with no base character I can’t get this to shape in Word using the updated core fonts I’m using.\n\n"
    },
    {
      "time": " 11.Apr.2006 12.24pm",
      "content": "After trying google, I had a thought could the translation be variable infinity? Because googling Frege variable infinity brings more hits  \n [http://members.cox.net/wehmeier/russell01.pdf](http://web.archive.org/web/20070808062040/http:/members.cox.net/wehmeier/russell01.pdf \"http://members.cox.net/wehmeier/russell01.pdf\")\n\n[http://www.st-andrews.ac.uk/~slr/teach2005/PY5321-9.pdf](http://web.archive.org/web/20070808062040/http:/www.st-andrews.ac.uk/~slr/teach2005/PY5321-9.pdf \"http://www.st-andrews.ac.uk/~slr/teach2005/PY5321-9.pdf\")\n\nAll way above my head.  \nOr is it an upsidedown picture of a seagull flying low over a still sea?  \nTim\n\n"
    },
    {
      "time": " 11.Apr.2006 12.54pm",
      "content": "I know enough logic to be dangerous, but I am not familiar with Frege’s notations, especially as originally published.\n\nMy undereducated guess is that this is a stylized lowercase \\omega with a wide inverted breve above. If I were drawing it, I’d use the same ductus (or lack thereof) as the \\union sign. The part below might indeed by a double\\union, but if it _does_ mean some kind of infinity, \\omega makes more sense as it is often used as an infinity sign. I wouldn’t worry about the asymmetry - if it had real meaning, I doubt it would be done that subtly.\n\nWhat methodology are you going to use to draw your fonts? If it’s not too many glyphs and you don’t have a strong attachment to doing it all yourself, I might be tempted to pitch in.\n\n"
    },
    {
      "time": " 12.Apr.2006 3.06am",
      "content": "Raph\n\nThanks for the comments.\n\n_If I were drawing it, I’d use the same ductus (or lack thereof) as the \\union sign,_\n\nThat’s what I’ve done for my first cut of it, but the lower  \nand upper parts being in different styles jars a bit to my eye.\n\n_What methodology are you going to use to draw your fonts?_\n\nThe book will be set with TeX (what else!) and I’m doing the  \nfont in metafont. Thanks for the offer of help. but it is  \npretty much done now, I would be interested in comments though,  \nsample at\n\n[http://miles.shef.ac.uk/~jjg/sample.pdf](http://web.archive.org/web/20070808062040/http:/miles.shef.ac.uk/~jjg/sample.pdf \"http://miles.shef.ac.uk/~jjg/sample.pdf\")\n\n(900KB). The infinity is on page 4.\n\nCheers\n\nJim\n\n"
    }
  ]
}
