{
  "id": "19192",
  "title": "Help, looking for Victorian Gothic Revival serif and appropriate sans",
  "forum": "Design",
  "tags": [

  ],
  "content": "I'm redeveloping a wayfinding system for this building: The Pennsylvania Academy of Fine Arts ( [http://www.pafa.org](http://web.archive.org/web/20111219111304/http:/www.pafa.org/ \"http://www.pafa.org\") ) as a school project. I need to research typefaces that would be appropriate for the building signage and figured this would be the best place to get that help!\n\n<cite>The building, designed by the Philadelphia firm of Frank Furness and George Hewitt, is generally considered to be primarily the work of Furness who finished the project after the partnership dissolved in 1875. Furness had been a pupil of Richard Morris Hunt who introduced him to the esthetics of the modern Gothic revival. This included John Ruskin's appreciation of the richly colored designs of 14th-century Venice, Owen Jones's and Christopher Dresser's Eastern influenced ornament, and Viollet le Duc's use of foliated decoration combined with cast-iron architecture.</cite>  \n<cite>Rising 70 feet above the sidewalk, the Academy must have seemed a towering fortress in 1876. Today, dwarfed by more recent buildings, it looks like a decorated jewelbox. On the facade, heavy courses of dark stone rise toward a roofline marked with such colorful elements as red and black brick patterning, fanciful floral motifs, and a bas-relief frieze depicting famous artists of the past. A gothic window dominates the central pavilion and creates a motif that recurs inside.</cite>  \n<cite>After entering through a low vaulted hall, the visitor steps into the spectacularly ornamented Grand Stairhall. Its staircase, bordered by richly tiled floor and walls, and bronze and mahogany banisters, sweeps upward to the gallery level. This grand space is ringed with gothic arches carrying gold rosette-studded walls. The vaulted ceiling above is painted a brilliant blue with silver stars. Beyond are the galleries where foliate columns support exposed steel beams, one of several radical design elements in the building.</cite>  \n<cite>The Academy is considered one of the finest surviving examples of Victorian Gothic architecture in America. It provides the museum with a magnificent setting for the presentation of its collections and special exhibitions. As the modernist architect Louis I. Kahn observed, the Academy is truly a life-giving and inspired building.</cite>\n\nThe brunt of the info is located in the archives page: [http://pafa.org/archive.jsp](http://web.archive.org/web/20111219111304/http:/pafa.org/archive.jsp \"http://pafa.org/archive.jsp\")\n\nI have access to a fairly large selection of Studio Fonts (420 families) plus my own little archive that I've started. I know it's going to be hard but I guess just suggest what you think would work and I'll try to find one that's hopefully similiar in quality with what I have. I don't suppose a foundry/designer might let me use a typeface for a specific educational project and then trash it.\n\nAny help, including just pointing me in the right direction would be great.  \nThanks fellow Typophiles.\n\n",
  "author": "<a href=\"/web/20111219111304/http://typophile.com/user/8451\" title=\"View user profile.\">dave bailey</a>",
  "time": "<br>",
  "uid": "8451",
  "comments": [
    {
      "time": "",
      "content": "[Victornian Gothic](http://web.archive.org/web/20111219111304/http:/p22.com/products/victorian.html)\n\n\\>^P\n\n"
    },
    {
      "time": "",
      "content": "[ITC Golden Cockerel.](http://web.archive.org/web/20111219111304/http:/www.itcfonts.com/fonts/font/pid/243061/ITC+Golden+Cockerel+Volume/detail&grab_id=0&page_id=53927&query=golden&SCOPE=ITCFonts) Has 2 titling variants that would rock for large and extra-large signage in this vein. Or even try ITC Golden Type (Morris).\n\n"
    },
    {
      "time": "",
      "content": "Carl is spot on. Perfect for the project. There was a nice article on this Dave Farey revival in one of the old _X-Height_ mags.\n\nHere are [MyFonts](http://web.archive.org/web/20111219111304/http:/www.myfonts.com/fonts/linotype/itc-golden-cockerel/)' and [FontShop](http://web.archive.org/web/20111219111304/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Golden)'s view of Golden Cockerel. The samples at ITC/fonts.com don't really do it justice.\n\n"
    },
    {
      "time": "",
      "content": "Do take note: the family has 4 styles: Regular, Italic, Titling, and Initials/Ornaments. This last one would be of most use in large sizes, and the MyFonts sample doesn't show it (they don't sell it?). It's much more decorative and evocative, the others more subdued and utilitarian. The family together offers a very nice range for just such a project as yours.\n\n"
    },
    {
      "time": "",
      "content": "Paul: The 'Gothic' is a beauty and the set is affordable for a one time project, not as much of a fan of the Swash...for this project at least.\n\nCarl & Stephen: This looks great. Do we know if there's any PDF specimens around? I want to present the options to my professor before I look into buying these. Does this kind of recognition just come with experience like type IDs? Or do you have some sort of reference that you look through?\n\n"
    },
    {
      "time": "",
      "content": "dave, my font suggestion was somewhat tongue-in-cheek due to your thread title. I'm not sure what i'd do for a victorian serif as my mind has victorian irrevocably tied to display faces. For a sans though I think that those great old [grotesques](http://web.archive.org/web/20111219111304/http:/typophile.com/wiki/grotesque) have a very victorian feel to me. For a current thread on grotesques, see: [http://typophile.com/node/19185](http://web.archive.org/web/20111219111304/http:/typophile.com/node/19185 \"http://typophile.com/node/19185\")\n\n"
    },
    {
      "time": "",
      "content": "Hey the more suggestions the better. How do I determine what's old? I'm down with the grotesque lingo, thanks for the wiki though :-D I agree on your relation of the two styles though. I'm not sure if I'll need both a serif and a sans but I figure it would be best to get some options going!\n\n"
    },
    {
      "time": "",
      "content": "well the old grotesques, in my mind, always have that little waft of... well, grotesqueness. I find the imperfections of some of these old faces to be what gives them charm as opposed to something that's been completely polished up like Aksidenz. Something from our library that fits into this category would be [St. G Schrift](http://web.archive.org/web/20111219111304/http:/www.p22.com/ihof/stgschrift.html), although i'm sure there are others that have the same kind of character. Perhaps this would be the perfect place for Maple?\n\n"
    },
    {
      "time": "",
      "content": "FontShop will supply a PDF sample of any font. Just shoot a mail to [info@fontshop.com](mailto:info@fontshop.com?subject=Stephen%20said%20I%20could%20have%20a%20PDF%20sample...).\n\n"
    },
    {
      "time": "",
      "content": "Golden Cockerel is inappropriate -- Renaissance, not Gothic.  \nSchrift is Jugendstil, much too late, as is Victorian Swash, although the Victorian Gothic might be OK in a secondary role (it's too thin for the lead)..\n\nYou really need a systematically fancy face to harmonize with the patterning in the building.\n\nIn this sample, you can see the highly formalized use of pattern that was a big part of Owen Jones' theory, so influential in the 3rd quarter of the 19th century. So I would imagine that any wayfinding system would, to be correct, have to have quite a substantial border, the design of which integrates with the typography. Why not take your cue from some feature of the decoration in the building?\n\n ![](http://web.archive.org/web/20111219111304im_/http:/typophile.com/files/NewDom.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I wonder if something like [Sentry](http://web.archive.org/web/20111219111304/http:/www.myfonts.com/fonts/solotype/sentry/) or [Excelsis](http://web.archive.org/web/20111219111304/http:/www.myfonts.com/fonts/solotype/excelsis/) might work?\n\nI agree with Nick. I'd first take a good long look at the architecture and see there aren't patterns or shapes that hint at other things first.\n\n"
    },
    {
      "time": "",
      "content": "Maybe an [Egyptian](http://web.archive.org/web/20111219111304/http:/typophile.com/wiki/Egyptian) for a serif face. But let's see what Nick has to say...\n\nOr for something a bit more decorative: [Koster](http://web.archive.org/web/20111219111304/http:/www.myfonts.com/fonts/typotheticals/koster/)\n\n"
    },
    {
      "time": "",
      "content": "I have to revisit the space because I got kicked out for taking a photo, evidently no photos are allowed at all and I can't even sketch while in there. My professor even called them and they didn't budge. Grr \\>:-/ It's going to be so hard to remember the important details.\n\nThanks for all this help everyone...it helps me make a better informed decision!\n\nNick: Where did that image come from?\n\n"
    },
    {
      "time": "",
      "content": "Actually a Scotch Roman would give a more real Victorian feel. The newly released [Escrow](http://web.archive.org/web/20111219111304/http:/fontbureau.com/fonts/Escrow) might work well for you. The italic has been modernized, but the roman has a definite juicy old-time feel, and it comes in a huge variety of weights and widths.\n\nOh and Jonathan Hoefler really has the Victorian feel. Look at his terrific new [numbers](http://web.archive.org/web/20111219111304/http:/www.typography.com/catalog/numbers/index.html), which might be very useful also.\n\n"
    },
    {
      "time": "",
      "content": "David, it's the cover of a magazine from my collection.\n\n"
    },
    {
      "time": "",
      "content": "I think Lawson would back me up on this one:\n\n<cite>The development of the group of types called square serif parallels that of the gothics. Both forms represented the typefounders' answer to the challenge of the nineteenth century: to find a new typographic expression for industrializede society.</cite>\n\nWhereas the Scotch Romans were also developed at this time as a twist on the Bodoni-Didot faces, the square serifs were one of the new developments in type during the victorian period.\n\n"
    },
    {
      "time": "",
      "content": "\\> square serifs\n\nSomehow I think of slab serifs as more of a commercial and advertising thing, and the Scotch as going more with the ornateness of Victorian archicture. But of course it depends on the building.\n\nSome of the more ornate lettering like Nick showed would be great also, but it would be harder to get right.\n\n"
    },
    {
      "time": "",
      "content": "Where would I find more of these 'Scotch Roman' typefaces? Something like this?\n\n[Monotype Scotch Roman](http://web.archive.org/web/20111219111304/http:/www.fontshop.com/?fuseaction=catalog.fontdetail&searchby=manufacturer&displayfontid=M.6081.0.3)?\n\nIs that different from this? [Linotype Scotch Roman](http://web.archive.org/web/20111219111304/http:/www.linotype.com/13498/scotchroman-font.html?PHPSESSID=c#)? A different cut or just different distributors?\n\nOr maybe [Scotch FB](http://web.archive.org/web/20111219111304/http:/fontbureau.com/fonts/ScotchFB)?\n\nMatthew Carter's [Monticello](http://web.archive.org/web/20111219111304/http:/www.linotype.com/55992/monticello-family.html) perhaps?\n\n[Georgia](http://web.archive.org/web/20111219111304/http:/typophile.com/wiki/Georgia) was mentioned elsewhere as based on Scotch Roman, is that just too common to use?\n\n"
    },
    {
      "time": "",
      "content": "I don't think Monticello is a Scotch roman. The others are. Miller (Font Bureau), also by Matthew Carter, is better than Georgia for these purposes, I suspect, because Georgia was designed for screen. You might also look at Goudy Modern, because of it being very American in feel it might go with the building.\n\nWhich one--Carter, Berlow, Highsmith, Goudy etc.--is best is just a matter of trying and seeing what pleases your eye in the context. I would think that taking photos and doing mock-ups with different styles would be one important step. Even better would be doing sample signs and taking them into the building...\n\n"
    },
    {
      "time": "",
      "content": "Like I said before they don't allow photography of any kind, even after my professor called them and informed them of my project. \\>:-o So taking photos and comping in mock-ups or putting up samples in the building is gonna be pretty much impossible.\n\n"
    },
    {
      "time": "",
      "content": "I doubt any Scotch or Modern roman, grot or advertising face would be suitable. The Revivalists would have preferred painted banners with textura in gold leaf. P22 Morris Troy?\n\n"
    },
    {
      "time": "",
      "content": "Keep in mind this is a wayfinding system so readability is a prime factor. Yes I just said one of the \\_r\\_ words.\n\nA double edged sword this place can be, so many opinions makes the process a bit harder. I appreciate the input though!\n\n"
    },
    {
      "time": "",
      "content": "Oh sorry, cancel my comment.\n\n"
    },
    {
      "time": "",
      "content": "What about ITC Tiffany? Maybe that combined with a purchase of a set of ornaments to work with?\n\nI think that I'm going to go with ITC Tiffany and buy the Victorian set from P22 to ornament the wayfinding system. This is only a 2 week long project so I need to just make a decision and go with it. Thanks for all your input.\n\n"
    },
    {
      "time": "",
      "content": "I think Tiffany is a great idea. I love the figures, especially the \"2\".\n\n"
    },
    {
      "time": "",
      "content": "For a support font to go with the as yet undecided headliner I would take a look the Sackers Gothic Volume from Fonts.com and Copperplate Gothic ( this one is loaded on you mac ), Trade Gothic too. Than pair it with something that looks close to Desdemona? Or perhaps a script... its warmth might match the mood your going for.\n\nLook at Scriptorium... they have period type you might like as well\n\nHope it helps you ....Mike\n\n"
    },
    {
      "time": "",
      "content": "Apart from the type, how are you going to present the wayfinding system? It seems to me that if you can't photograph and sketch, they are going to be precious about fixing plates to the walls\\*, the process might lead to/or dictate a solution. What kind of directions are you trying to show, to the stairs or specific rooms and to what audience, are they regular or occasional visitors?  \n\\*even in a hypothetical situation  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Update here guys: [http://typophile.com/node/19685](http://web.archive.org/web/20111219111304/http:/typophile.com/node/19685 \"http://typophile.com/node/19685\")\n\n"
    },
    {
      "time": "",
      "content": "Great work!\n\nIt's nice that you've taken the plunge into incorporating decoration.  \nTiffany is not authentic, in the sense that it's not a revival of any particular 19th century face.  \nHowever, as has been noted, type would not have been used at display size then, so the very idea of a printed Victorian display/signage typeface is spurious. (Except perhaps for the British cast-iron street name signs, recently revived by Device, but in a distressed version.)  \nSo to use a genuine display face, an original design drawn c.1970 by Ed Benguiat, a designer with amazing chops in decorative type design, in a very sympatico neo-vicky style, is a brilliant choice.\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Nick. Means a lot coming from you with all your type experience. I did a lot of thinking and looking before I started the project regarding typefaces and gave up on finding 'an exact match'. Instead I interpretted what I found research-wise and tried to put my own authentic spin on it. This was a school project as well and for that reason I couldn't go spend a great deal on a huge family. I'm quite pleased with the results though and your comments are appreciated! Many thanks to Paul Hunt though, and the P22 foundry for the Victorian family as it was a solid foundation in all my designs.\n\n"
    },
    {
      "time": "",
      "content": "_type would not have been used at display size then_\n\nI thought [wood type](http://web.archive.org/web/20111219111304/http:/typophile.com/wiki/wood%20type) was the original display typography, and correct me if i'm wrong, but didn't it originate during the victorian era? I think tiffany works because the 70s were kind of a throwback to victorian style anyway. good job on your project, dave.\n\n"
    },
    {
      "time": "",
      "content": "_type would not have been used at display size then_\n\n...in the context of this project, for signage.  \nThey lacked the technology to make printed typography sufficiently durable (lamination, light-fast inks); also, there were sign painters on hand.  \nThe closest they would have gotten is constructed frames where the printed signs would be protected by glass, and you can find such in old railway terminals still, for timetables, announcements, and advertisements.\n\n"
    },
    {
      "time": "",
      "content": "My project is defunct! \\*throws it in the trash\\* :-P\n\n"
    }
  ]
}
