{
  "id": "19204",
  "title": "i want to learn more about type",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "as i've progressed as a designer, i've become increasingly aware about how i use type. i've been paying much more attention to the subtleties of kerning and tracking and leading and gutters and all that good stuff. i've begun to notice the tiny differences between my favorite serifs and sans-serifs, and i've become very interested in reading up the history of this stuff.\n\nso... give me your favorite bookmarks, resources, whatever! i'd like to really understand how i use type as a designer. and these things only help more and more. the typowiki on this site is great, but sadly does not contain as much info as i was hoping :(\n\n\\<3!!\n\n",
  "author": "gerald",
  "time": "11 Apr 2006 — 5:03pm",
  "uid": "12369",
  "comments": [
    {
      "time": "11 Apr 2006 — 5:25pm",
      "content": "From what I gather, if you really want to get into it, you need to go to a convention centered around type & type geeks. I sense that this may affect your perception of reality, and from which there is no turning back. Whatever \\*other\\* advice you receive here will probably be from someone with a progressive case of the disease. In any case, it doesn't appear to be terminal in any sense other than the usual.\n\n"
    },
    {
      "time": "11 Apr 2006 — 10:12pm",
      "content": "Hi, Gerald,\n\nHave you checked out the book list in the typowiki? Plenty of resources right there:\n\n[http://typophile.com/wiki/Books](http://web.archive.org/web/20131024035557/http:/typophile.com/wiki/Books \"http://typophile.com/wiki/Books\")\n\nOne book I don't see there is John Lewis' _Typography: Basic Principles_, which is out of print (1966, Studio Vista) but available used... It was also expanded and reissued as _Typography: Design and Practice_ (1978, Taplinger), which you can also still find in used bookstores. It is like _The Thames and Hudson Manual of Typography_ (1980, reprinted 1992) in that it was written BC, Before Computers. :-) But don't let that stop you from checking it out.\n\nAs for online resources on how to use type as a designer, I can recommend:\n\n[http://www.thinkingwithtype.com](http://web.archive.org/web/20131024035557/http:/www.thinkingwithtype.com/ \"http://www.thinkingwithtype.com\")\n\nHope this proves useful.\n\n"
    },
    {
      "time": "11 Apr 2006 — 10:27pm",
      "content": "I recently bought the [Triumvirate](http://web.archive.org/web/20131024035557/http:/typophile.com/wiki/Triumvirate) and haven't finished reading it but from what I've read so far (the first two) these books are absolutely indispensable to the typographically conscious graphic designer. If you want to take your typography to the next level, read these.\n\nEven though you’re not interested in designing type(?), I think it is necessary for the graphic designer to learn the basics of type design and hand lettering. Underware has a nice page on type design basics [**here**](http://web.archive.org/web/20131024035557/http:/www.typeworkshop.com/index.php?id1=type-basics) and G Briem has a useful site on type and handwriting [**here**](http://web.archive.org/web/20131024035557/http:/briem.ismennt.is/).\n\n"
    },
    {
      "time": "12 Apr 2006 — 4:42am",
      "content": "The Logo Font and Lettering Bible by Leslie Cabarga:  \n [http://logofontandlettering.com/](http://web.archive.org/web/20131024035557/http:/logofontandlettering.com/ \"http://logofontandlettering.com/\")\n\nThe Stroke by Gerrit Noordzij:  \n [http://www.hyphenpress.co.uk/titles/stroke/index.html](http://web.archive.org/web/20131024035557/http:/www.hyphenpress.co.uk/titles/stroke/index.html \"http://www.hyphenpress.co.uk/titles/stroke/index.html\")\n\nAnd the Typography-Encyclopedia by Friedrich Friedl:  \n [http://www.amazon.com/gp/product/1579120237/sr=8-9/qid=1144841788/ref=pd...](http://web.archive.org/web/20131024035557/http:/www.amazon.com/gp/product/1579120237/sr=8-9/qid=1144841788/ref=pd_bbs_9/103-0960022-8471061?%5Fencoding=UTF8 \"http://www.amazon.com/gp/product/1579120237/sr=8-9/qid=1144841788/ref=pd\\_bbs\\_9/103-0960022-8471061?%5Fencoding=UTF8\")\n\n"
    },
    {
      "time": "12 Apr 2006 — 5:42am",
      "content": "I learned a lot from this site: [http://cgm.cs.mcgill.ca/%7Eluc/fonts.html](http://web.archive.org/web/20131024035557/http:/cgm.cs.mcgill.ca/%7Eluc/fonts.html \"http://cgm.cs.mcgill.ca/%7Eluc/fonts.html\")\n\n"
    },
    {
      "time": "12 Apr 2006 — 6:21pm",
      "content": "Good call, Geoff. I wanted to post links to Briem's and Underware's sites, but hesitated because Gerald expressed an interest in typesetting rather than typeface designing... But those sites offer very useful information it won't hurt a graphic designer to know... Briem's section on optical illusions is a good example of this.\n\nAnd Gerald, may I also recommend a couple of other books?\n\nOne is _Printing Types: An Introduction_, another book by Alexander Lawson (it is listed in the typowiki book page). The other is _A Short History of the Printed Word_, by Warren Chappell. There is a [second edition](http://web.archive.org/web/20131024035557/http:/www.amazon.com/gp/product/0881791547/qid=1144890960/sr=2-1/ref=pd_bbs_b_2_1/103-5164141-9033464?s=books&v=glance&n=283155) that was expanded by Robert Bringhurst, too, although I am only familiar with the earlier version.\n\n"
    },
    {
      "time": "12 Apr 2006 — 6:55pm",
      "content": "Hey Dusty, nice to see you here. I assume you know of \"The Elements of Typographic Style\" since every design forum out there mentions this book to any designer.\n\n"
    },
    {
      "time": "12 Apr 2006 — 7:53pm",
      "content": "I've found studying carefully the outlines of favourite digital fonts a good thing.\n\n"
    },
    {
      "time": "12 Apr 2006 — 8:36pm",
      "content": "thanks for all the recommendations guys! i have stop stealing sheep, and actually i just recently ordered the elements of typographic style (not sure why i haven't bought this years ago). i also ordered typographie by emil ruder. pretty excited for that one.\n\ni've also been reading a lot on the history and evolution of type, which has really helped me as well.\n\nkeep 'em comin!\n\n"
    }
  ]
}
