{
  "id": "1920",
  "title": "Which Garamond? Typophiles Recommend:",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Well, they don't really. The mention of Garamond is frequent (to put it mildly) but there isn't a lot of actual endorsement.   \n   \nThree threads contained actual endorsements of particular Garamonds:   \n [20 Typefaces to start a designer's career](http://web.archive.org/web/20150221091205/http:/www.typophile.com/forums/messages/30/11541.html)   \n [If you could only use 5 typefaces](http://web.archive.org/web/20150221091205/http:/www.typophile.com/forums/messages/30/6318.html)   \nand the even more stringent   \n [Only One Typeface](http://web.archive.org/web/20150221091205/http:/)   \n   \nThe results:   \n   \nStempel Garamond - 3 endorsements   \nAdobe Gramond - 3 endorsements, 1 mention   \nGaramond - 2   \nGaramond Pro OTF - 1   \n   \nAnd that includes a single person endorsing both Adobe and Stempel.   \n   \nNow this is an afternoon of combing threads (about 20 or so out of 148 of them), so it looks like I'm at the point of diminishing return.   \n   \nI'd like to ask some specific questions and see if we can't get a better measure.   \n   \nWhich Garamond   \na. Would you buy for your own type library?   \nb. Would you set a book or long text in?   \nc. Would you set at display size?   \n   \nBe specific. Let 'er rip. I'll tally the results in a few days.   \n   \nJon\n\n",
  "author": "Jon Whipple",
  "time": "2 Nov 2003 — 6:51pm",
  "uid": "2332",
  "comments": [
    {
      "time": "2 Nov 2003 — 7:12pm",
      "content": "a. Sabon Next.   \nb. Sabon Next.   \nc. Sabon Next.   \n   \nAn alternate choice for the display size would be 1530 Garamond, but it isn't for sale at the moment.   \n   \nApparently Adobe may yet release Robert Slimbach's magnum opus Garamond revival, which has been in the works for more than ten years.   \n   \nFor me, one of the principal criterion in selecting a Garamond would be the italic. I'd want an italic based on Garamond's not Granjon's. That said, I'm currently reading a book set in Linotype Granjon, and rather like it.\n\n"
    },
    {
      "time": "2 Nov 2003 — 7:34pm",
      "content": "I was surprised that nobody had mentioned Sabon, Monotype Garamond or Berthold Garamond.   \n   \nI'm not surprised that Stempel Garamond rated highly, but I have to say that I'm not overly fond of it. I think it is just too \"chiseled\" for my taste as to what I want as a book face. There are even more chiseled looking faces that I like plenty, but not for book text.   \n   \nI would also note that as a typeface design, Adobe Garamond Pro (OpenType) is essentially the same design as Adobe Garamond.   \n   \nNormally I can't comment on unannounced projects, but Rob's Garamond revival is one that we have actually previewed in public. I will say that it is his top priority major project. I can't comment on a timeline, but it's getting plenty of attention and I don't expect it to end up on the back burner again.   \n   \na) Since I always have all Adobe typefaces, the one I'd go out and buy would be Sabon Next.   \n   \nb & c) Can't answer at this time. Would have to do a more careful evaluation of Sabon Next, and will soon be competing with our new project.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "2 Nov 2003 — 7:37pm",
      "content": "I don't think Sabon Next is a better choice than AGaramond. It's very contrasty and hard on the eyes. The Display version is just a bit too light at 11 point, but the Regular is way too dark. AGaramond seems just right, at least on my particular laser printer, but you have to use it at one-half point larger size to match Sabon Next.\n\n"
    },
    {
      "time": "2 Nov 2003 — 8:14pm",
      "content": "Oh I should say that in my brief survey, I limited myself to mentions of types _named_ Garamond, not all Garamond/esque(?) types.   \n   \nI think that it's hugely useful to list Sabon Next, and I'm sure others might qualify as Garamonds. For the purposes of the survey, if you do include typfaces that aren't named Garamond, please be specific.   \n   \nAny endorsements of metal Garamonds?   \n   \nJon\n\n"
    },
    {
      "time": "2 Nov 2003 — 8:52pm",
      "content": "The US versions of the Harry Potter books (don't say anything) are set in Adobe Garamond. It is quite easy on the eyes.\n\n"
    },
    {
      "time": "2 Nov 2003 — 10:19pm",
      "content": "I think you have to do it based on the design at least as much as the name. Sabon qualifies more than many typefaces that are merely named Garamond. For example, ITC Garamond's relationship to the original seems barely more than nominal.   \n   \nT\n\n"
    },
    {
      "time": "2 Nov 2003 — 10:25pm",
      "content": "Thomas, I think you are right.   \n   \nJon\n\n"
    },
    {
      "time": "2 Nov 2003 — 11:34pm",
      "content": "_I don't think Sabon Next is a better choice than AGaramond. It's very contrasty and hard on the eyes. The Display version is just a bit too light at 11 point, but the Regular is way too dark._   \n   \nWell, you shouldn't be using the display version at 11pt anyway, but if the regular seems too dark this may simply be the way your printer handles it. In print, i.e. offset printed at 2400 or 3600 dpi, the regular is not too dark at all; in fact it can be a little light. I still think it is the best Garamond revival. Of course, I have a soft spot for [1530 Garamond](http://web.archive.org/web/20150221091205/http:/www.myfonts.com/fonts/tiro/1530-garamond/), but it is probably too authentic for daily use.\n\n"
    },
    {
      "time": "3 Nov 2003 — 1:57am",
      "content": "Goudy \"Garamont\" soon to be available at Lanston. Many reasons to look at it. The face is ready for release now.   \n   \nSome think it has too much Goudy in it. I can't quite imagine \"too much Goudy\". Never had enough of it. But still I have a purist heart. I would need to look at the face historically speaking to give an opinion.   \n   \nAnyone interested in \"Garamont\" could ask?\n\n"
    },
    {
      "time": "3 Nov 2003 — 5:25am",
      "content": "Chris, Harry Potter? hee hee hee, You are kidding us aren't you, hee hee hee\n\n"
    },
    {
      "time": "3 Nov 2003 — 7:20am",
      "content": "I found strange to decide that a particularly weight of a particularly typeface is too light or too dark after tests on a particular laser printer.   \n   \nFor example: to my experience, Apple laser printers give very bold type when HP laser printer give the reverse.   \n   \nAnd, specially, when the final output is offset litho, on a particular paper, what you've got on a laser printer is irrelevant at all.   \n   \nIf I comeback to Garamond question, I can say that Adobe Garamond was my prefered Garamond until I discovered that the general effect is too wide and too Italian compared to original French Garamonds (from the various original books I had in hands from Estienne and others at the Imprimerie Nationale). Then, Stempel one, despite its angular shapes and Berthold Garamond despite not very available today as before, seems booth better.   \n   \n(don't miss Augereau designed couple of years ago, another good one -- but a bit decorative on some forms).   \n   \nI can't comment on Sabon Next for obvious reasons.\n\n"
    },
    {
      "time": "3 Nov 2003 — 7:49am",
      "content": "_I suggest you get a copy of Frank [sic, should be Fred] Smeijers' \"Counterpunch\"..._   \n   \nOr Robin Kinross's _Unjustified Texts_ which is set in Fred's more recent Arnhem typeface. Of course, these are intended to be dark types, which may not be the case with things that look dark coming off Albert's laser printer.\n\n"
    },
    {
      "time": "3 Nov 2003 — 7:53am",
      "content": "I think I am going to leave the overinking problem to the experts.\n\n"
    },
    {
      "time": "3 Nov 2003 — 8:30am",
      "content": "\"Albert's laser printer.\"??? explain please!\n\n"
    },
    {
      "time": "3 Nov 2003 — 8:41am",
      "content": "I would recommed the only digital Garamond that has decent optical scaling: the ones by Valdonega. They have both a Jannon and a Garamond with 4 optical sizes just for text setting. But for better or worse they're not for sale.   \n   \nBut we really need to look at the metal ATF Garamond: every single size was optically scaled.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Nov 2003 — 4:55pm",
      "content": "_\"Albert's laser printer.\"??? explain please!_   \n   \nAlbert was complaining that Sabon Next was too dark, but we speculated that this was due to his laser printer. Stephen suggested that dark type can be a good thing, as demonstrated by Fred Smeijer's types, but I think there is a difference between type that is intended to be dark and type that just ends up that way because of a printer.\n\n"
    },
    {
      "time": "3 Nov 2003 — 9:22am",
      "content": "Albert Barwick! yes got it! thanks.   \n   \n\"complaining\"   \nI complain myself that Sabon Next Regular is printed too light on the Linotype specimen. But some friends have say to me that german printers like pale printing (?! the black ink is a bit grey) So, I wait for the second edition due in next couple of days-weeks to see.   \n   \nThe Prix Charles Peignot book (composed in Sabon Next too), is better inked to my eyes.   \n   \nWhat can be wonderful, is too see a book composed with various Garamonds available on the market, each used at their best size. From the \"1530\" to the Berthold, Stempel, A Garamond, Sabon Next, etc. The result will be appealing to the eyes as old books can be.   \n   \nWhat about a Founders Garamond? (in reference to Founders Caslon)\n\n"
    },
    {
      "time": "4 Nov 2003 — 1:25pm",
      "content": "Does anyone have an opinion on Jannon Text Moderne from Storm? I see that it's available as an OpenType version, but without the swash characters. Would you seriously consider using it instead of Adobe Garamond or Sabon Next, or is it too authentic (quirky) for an all-purpose general text font?\n\n"
    },
    {
      "time": "4 Nov 2003 — 4:55pm",
      "content": "_\"Albert's laser printer.\"??? explain please!_   \n   \nIt's a thought experiment, kind of like Schroedinger's Cat. It asks the question: \"if you print in black toner on black paper, are the fonts still pirated?\"\n\n"
    },
    {
      "time": "5 Nov 2003 — 3:43am",
      "content": "I don't have a solution, however, Royal Mail used Stempel Garamond, a very poor choice, since the 0 (zero) has the stresses on the horizontal and looks out of place.\n\n"
    },
    {
      "time": "5 Nov 2003 — 9:30am",
      "content": "\\> the 0 (zero) has the stresses on the horizontal and looks out of place.   \n   \nHuh, I think that's the best form of zero, since it avoids confusion, but does so elegantly.   \nHow could it look out of place when some of the other numerals have horizontal stress too?   \n   \nhhp\n\n"
    },
    {
      "time": "5 Nov 2003 — 12:35pm",
      "content": "Original Sabon Stempel by Tschichold, so Sabon Next too but in less contrast and just for OsF.   \n   \nAbout Sabon Next, now that Linotype launched a new website, the Sabon Next as any other from the Platinuim collection are available to purchase by weight also.\n\n"
    },
    {
      "time": "7 Nov 2003 — 4:17am",
      "content": ""
    },
    {
      "time": "7 Nov 2003 — 6:25am",
      "content": "Narrower 0 than O is not a \"convention\" to me its just because figures are designed at 90% tabular (all designed on same width).\n\n"
    },
    {
      "time": "7 Nov 2003 — 9:32am",
      "content": "\\> it leaps out from the page or back of a van   \n   \nYou mean just the zero? Do you think laymen have the same problem?   \n   \n\\> narrower width for 0 than O   \n   \nI don't think that's enough, like when you have caps and numbers intermixed (like in a FedEx tracking number). A slashed (or dotted) zero is the least confusible, but it's a bit brutal.   \n   \nBTW, when I said \"elegant\" I didn't mean aesthetically, I meant functionally.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Nov 2003 — 7:34am",
      "content": ""
    },
    {
      "time": "16 Nov 2003 — 9:33pm",
      "content": "And finally I got around to the tally.   \n   \nAdding up the conversation after the initial report the results are thus:   \n   \nStempel Garamond - 4 endorsements   \nAdobe Gramond - 3 endorsements, 1 mention   \nGaramond - 2   \nGaramond Pro OTF - 1   \n   \nand additionally:   \n   \nSabon Next - 2 endorsements (one specifically for text, display and addition to personal library)   \nBerthold Garamond - 1 endorsement   \n   \nSo the standings remain pretty much the same but the really great thing is the mention of many others that we may consider in selecting a Garamond:   \n   \n1530 (Tiro Typeworks)   \nATF Garamond (metal)   \nAugerneau   \nFounders Garamond   \nJannon Text Moderne (Storm)   \nMonotype Garamond   \nSabon   \nValdonega Jannon (Not for sale)   \nValdonega Garamond (Not for sale)   \n   \nThanks everybody!\n\n"
    },
    {
      "time": "17 Nov 2003 — 1:08am",
      "content": "John,   \n   \nDon't forget Garamont by Goudy, _Lanston._   \n   \nI had another look. It's damned good.   \n   \nDon't suffer from _same town syndrome._ I have not lived in BC for 10 years. If you want I can give you a showing pretty quickly. Did you notice we just released Jim Rimmer's _Fellowhsip?_   \n   \nI say this knowing you might have met him, so this is just small talk, not advertising. I hate people that advertise in forums. It's just plain crass.   \n   \n [http://www.lanstontype.com/Fellowship-Font.html](http://web.archive.org/web/20150221091205/http:/www.lanstontype.com/Fellowship-Font.html)   \n   \nGerald Giampa   \nLanston Type Company\n\n"
    },
    {
      "time": "17 Nov 2003 — 10:36am",
      "content": "So when's this great new Adobe Garamond revival due out, and how will it differ from the current version? Will it be more historically authentic, or geared more toward modern use?\n\n"
    },
    {
      "time": "17 Nov 2003 — 11:18am",
      "content": "Let's see:   \n   \n- I can't say when it will be out.   \n- It will be completely different from the existing Adobe Garamond, with the two exceptions of being designed by Robert Slimbach and being based on the work of Claude Garamond.   \n- It will be more historically-based than Adobe Garamond is.\n\n"
    },
    {
      "time": "17 Nov 2003 — 1:48pm",
      "content": "\"It will be more historically-based than Adobe Garamond is.\"   \nWho can assume something like that today? hein? I will only trust Augereau, Le B\n\n"
    },
    {
      "time": "17 Nov 2003 — 1:57pm",
      "content": "Just so. I think the new design will co-exist quite happily in our library with Adobe Garamond; each will serve its own purpose.   \n   \nT\n\n"
    },
    {
      "time": "17 Nov 2003 — 5:18pm",
      "content": "Gerald: Sorry for that oversight. I had it written down on my notes, but got diverted by speling misteaks. Thanks for reiterating it. _...and also Garamont by Goudy, Lanston_   \n   \nNo, I don't know Jim, but wouldn't mind an introduction or some time to meet. Get me both of those.   \n   \nOh, and Thomas get me some of the new stuff too! Looking forward to seeing it.\n\n"
    },
    {
      "time": "17 Nov 2003 — 7:59pm",
      "content": "Thomas: It sounds like you're saying this new Garamond revival is more of a display font if it'll \"co-exist\" with the current version. I was hoping for a more beefed up and expanded text family, along the lines of JFP's Sabon Next. Do you have any advanced pictures you could share with us?\n\n"
    },
    {
      "time": "17 Nov 2003 — 11:41pm",
      "content": "No, the new Garamond will have a full range of optical sizes, and in many other ways be more complete and extensive than the existing Adobe Garamond Pro.   \n   \nI would love to share more with you all, but I really can't get into more specifics at this time. Maybe at TypeCon or ATypI we can do some big unveiling....   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "18 Nov 2003 — 8:23am",
      "content": "What will you call it though? Maybe \"Eug\": Encore Un Garamond. :-)   \nJust teasing, I am curious how you'll solve the naming dilemma.   \n   \nhhp\n\n"
    },
    {
      "time": "3 Nov 2003 — 7:38am",
      "content": "\"I don't think Sabon Next is a better choice than AGaramond. It's very contrasty and hard on the eyes. The Display version is just a bit too light at 11 point, but the Regular is way too dark\"   \n   \nAlbert, if you think that's too dark I suggest you get a copy   \nof Frank Smeijers' \"Counterpunch\" set in Renard and discover   \nwhat a joy it is to read text with a darker color.\n\n"
    },
    {
      "time": "3 Nov 2003 — 8:42am",
      "content": "I'm ashamed of my Frank/Fred blunder. Thanks John.\n\n"
    },
    {
      "time": "17 Nov 2003 — 11:35am",
      "content": "Thomas!! You are such a typographic tease!! ;^)\n\n"
    }
  ]
}
