{
  "id": "19200",
  "title": "Chinese Fonts & Adobe Software",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Help!\n\nI have (at least) a couple of issues I need help with, regarding the use of Chinese fonts, and Adobe software.\n\n1. I am having a hell of a time simply getting Chinese fonts to display in both/either Traditional and simplified, and once I get them, keeping them displayed.\n\n2. While I am typesetting these fonts in Illustrator, My Mac eventually wants to stop letting me use keyboard shortcuts - in any Adobe software that Ii have running at the time. I can't get the use of them back until I quit and re-start the software, assuming I'm not re-opening a file with that particular Chinese font in it.\n\nAny help is greatly appreciated.\n\n-Breck\n\np.s. for the record, I don't speak or read the language.\n\n",
  "author": "breck",
  "time": "11 Apr 2006 — 1:43pm",
  "uid": "3173",
  "comments": [
    {
      "time": "11 Apr 2006 — 3:15pm",
      "content": "Breck, you forgot to say which versions of the applications and OS you're using.\n\nAre you sure the version you're using supports Chinese typesetting?  \nFor example, there's a special InDesign version for Japanese.\n\n"
    },
    {
      "time": "11 Apr 2006 — 7:10pm",
      "content": "It would be helpful to know also which fonts are you using – font files, not typeface design – because the problem could be the compatibility with the application.  \nThere's also a different encoding problem. Traditional Chinese is mainly using a BIG5 encoding while simplified characters use the GB2312, but there are some font sets available in GB2312 that include also traditional character. Using those might be simpler because you can switch between the two just selecting a different font.\n\nInDesign is more problematic because it works very well only with few fonts otherwise you need a plug-in (InChinese – [http://www.inchinese.com/eng/index.html](http://web.archive.org/web/20131014142220/http:/www.inchinese.com/eng/index.html \"http://www.inchinese.com/eng/index.html\")) and there still problems in pre-press. Keep in mind that most of mainland China still stuck on OS9 and Pagemaker 6.5 Chinese version.\n\n"
    },
    {
      "time": "12 Apr 2006 — 7:21am",
      "content": "Right. That would help I guess.\n\nI am using Adobe Illustrator CS2; OSX version 10.4.6\n\nI am using two versions of the same font, called \"AR GuyinGB Bold\" and \"AR GuYinB5 Bold\" - One of course is the simplified version, the other is the traditional. They are made by Arphic, I believe.\n\nI need to do two versions of the same text, one in each (traditional and Simplified...)\n\nIt seems like I have to switch my blocks of text to the other. It comes up with question marks (?), and then I need to convert it to simplified, or traditional - depending on what it was to begin with, using the \"Convert to\" option under my language input setting (flag at the top of your Mac screen), BUT... it seems like I can only switch, say, from traditional to simplified, if my input language is set to Pinyin, but can only switch TO Traditional FROM Simplified if my imput language setting is set to ITABC.\n\nI think this solves my problem, or at least has worked for the last day or so, but I still don't understand WHY this is. If any of you can clarify, I would be very grateful.\n\n-b\n\n"
    },
    {
      "time": "12 Apr 2006 — 7:23am",
      "content": "BTW...\n\nThe \"question marks\" appear to be replacing characters that are missing, or the ones that are different from traditional to simplified...\n\n"
    },
    {
      "time": "12 Apr 2006 — 6:24pm",
      "content": "It looks like the problem is the different encoding, being the traditional a BIG5 and the simplified a GB. I don't really know the technical process of Illustrator conversion, I'll try to find out but tech question in this country can lead to amusing answers.\n\nA possible solution could be to use Agfa Monotype fonts – when Agfa got the Hong Kong Monotype inherited the whole type design team, unfortunately they're more concentrated on custom lettering than complete set – their GB collection includes also traditional characters and the price for the whole thing was around $250 when I got it few years ago.\n\n"
    },
    {
      "time": "13 Apr 2006 — 7:51am",
      "content": "Interesting. Thanks.\n\nActually, part of the problem is also that I've found a specific, stylized font that best suits the job, and marries well stylistically and historically with the latin alphabet I have chosen. The job is setting film title credits, the key being that they have to be both in Chinese AND english.\n\nSo, basically, I'm trying to make a \"less-than-ideally-functional\" font function, for the sake of the style that we found, and sold the client on. It looks great. Hopefully I can make it work. It looks like we may have to create a few select characters from scratch. No big deal. I just have learn some Chinese.\n\nAttached are the Arphic samples and a sample of how I'm marrying the two languages. Let me know what you think.\n\n ![](http://web.archive.org/web/20131014142220im_/http:/typophile.com/files/credits_font.png)\n\n"
    },
    {
      "time": "13 Apr 2006 — 8:59am",
      "content": "If you want to waste some time reading about Chinese characters encoding standards this might interests you:  \n [http://www.foundertype.com/english/web/standard/index.htm](http://web.archive.org/web/20131014142220/http:/www.foundertype.com/english/web/standard/index.htm \"http://www.foundertype.com/english/web/standard/index.htm\")\n\nNice work you're doing. Matching roman characters with asian ideograms is always a challenge, especially when it comes to Chinese since compared to what we're used for western language, there's an absolute lack of type design (I know I often cry about this, but it can be really frustrating).  \nAnd if to be uselessly picky historically the two design are separated by at least a thousand years, for sure there's a interesting link since the Chinese design you're using seems to recall the old bone scripts, used to cast oracles and write prophecies...\n\n"
    },
    {
      "time": "13 Apr 2006 — 11:16am",
      "content": "Thanks for the crit. Historical accuracy is tough business for sure. The story takes place in Tenth century China, so the trick was to find a balance, keeping a general primitive, archaic feel. I designed a custom-lettered wordmark first, the selection of the english font followed, and then came the selection of the Chinese.\n\nThere is certainly an obvious lack of selection for Chinese design. Anyone care to rectify this? What's a few thousand characters compared to 26?\n\n-b\n\n"
    },
    {
      "time": "15 Apr 2006 — 3:29pm",
      "content": "It's tough. Even to chinese speaker, chinese character seems to have a lot of repeating elements. But when implementing into a font, they all display small differences. And it's hard to go over thousands of glyph and audit it one by one, leave alone hint them. It seems all chinese/kanji fonts are concentrated only on variations of a few existing styles. And those style to me, dont do justice to a language belongs to the inventor of the printing press. I guess they just lack the willingness to venture to new styles.  \nP.S. The font you have chosen is a typeface originated in Japan.\n\n"
    },
    {
      "time": "17 Apr 2006 — 8:47am",
      "content": "re: P.S. The font you have chosen is a typeface originated in Japan.\n\nReally? How so? And for what purpose? Let's hope my client doesn't find that out...He \"O.K.'d\" the style, so I take it there won't be any further issues. At lleast, I hope not...\n\nWhat more can you tell me about this font? It's origins? I would appreciate any further info.\n\nThanks.\n\n-b\n\n"
    },
    {
      "time": "18 Apr 2006 — 6:18am",
      "content": "It is a seal script used by Nara to Heian period Japan, that's about 8th Century AD to 11th Century AD. It's a script design to emulate the ancient Chinese seal script but using the new-\"kai\" or regular script.\n\n"
    },
    {
      "time": "18 Apr 2006 — 6:42am",
      "content": "Very interesting. How do you know all this? Do you know what it was specifically developed for? A project of some sort? And by whom?\n\nI'm happy to hear it was designed to emulate ancient Chinese seal script. AND more convinced it was a decent choice for the job.\n\nOn another note, can anyone point me towards any reference on the web for typesetting Chinese characters? (preferebly in english.) Any advice on suitable ways to marry english with Chinese, in different situations would also be helpful. For instance, ways to handle small grouped settings, as I have above, compared to large blocks of text. I may be faced with creating an end credit scroll for this movie, where both english and Chinese need to be seen simultaneously. (Potentially a big challenge, with hundreds of names...)\n\n"
    }
  ]
}
