{
  "id": "19209",
  "title": "Adobe Universal waiting / ditching?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Since Adobe needs 2 years where everybody else only needed one year to convert their apps to Universal I’m wondering how many of you are waiting that long and how many are ditching Adobe.\n\nFor my 2¢ I’m less and less dependent on Adobe with each job. So it’s rather unlikely that I’ll hold my breath. How about you?\n\ncan someone turn this into a poll somehow? I don’t see that option here.\n\n [‹ Can anyone help me out?](http://web.archive.org/web/20080929202914/http:/typophile.com/node/19278 \"Go to previous forum topic\") [Work Load ›](http://web.archive.org/web/20080929202914/http:/typophile.com/node/19241 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080929202914/http://typophile.com/user/2444\" title=\"View user profile.\">Frank Jonen</a>",
  "time": "<br>",
  "uid": "2444",
  "comments": [
    {
      "time": " 11.Apr.2006 10.53pm",
      "content": "I’m happy to wait. Besides at the moment there are no intel powermacs and its not like we are going to use imacs or powerbooks in a production environment.\n\n"
    },
    {
      "time": " 12.Apr.2006 12.11am",
      "content": "What would I ditch Adobe for? I need OT-deature support. I don’t think that I’d be willing to try and typeset brochures with Mellel.\n\n"
    },
    {
      "time": " 12.Apr.2006 12.58am",
      "content": "More to the point: Frank, what are YOU going to ditch Adobe for? Quark? GIMP? Publisher? InkScape?\n\nRobert\n\n"
    },
    {
      "time": " 12.Apr.2006 8.24am",
      "content": "More importantly what are the jobs?\n\n\\>For my 2¢ I’m less and less dependent on Adobe with each job.\n\nGardener, taxi driver, rocket scientist? Does this say more about your ability to hold down a job than it does about Adobe?\n\nChees, Si\n\n"
    },
    {
      "time": " 12.Apr.2006 9.28am",
      "content": "I’m with Aether. I’m more likely to wait with my trusty G4 than to switch to something other than Adobe’s offerings. I’m the kind of guy that actually tries out apps like Inkscape, GIMP, Scribus, FontForge, etc. so I know where there at. I applaud their work, but to simply say they lack feature parity with Adobe products would be an understatement.  \nAdobe knows their business, and aquiring Macromedia was probably one of the smartest things they could have done. They bought out their closest competition.\n\nFrank are you one of those people that does all their typsetting in TeX?\n\n"
    },
    {
      "time": " 12.Apr.2006 9.54am",
      "content": "CS3 second quarter 2007. Not a rumor:\n\n[http://www.forbes.com/2006/03/23/adobe-chizen-earnings\\_cz\\_dal\\_0324adobe....](http://web.archive.org/web/20080929202914/http:/www.forbes.com/2006/03/23/adobe-chizen-earnings_cz_dal_0324adobe.html \"http://www.forbes.com/2006/03/23/adobe-chizen-earnings\\_cz\\_dal\\_0324adobe.html\")\n\npeace\n\n"
    },
    {
      "time": " 12.Apr.2006 12.02pm",
      "content": "Did you had the same thought when you had to wait for native OSX versions?\n\n"
    },
    {
      "time": " 12.Apr.2006 3.59pm",
      "content": "The TeX, publisher and Mellel comments cracked me up :)\n\nI’m actually on again with the Quark beta for typesetting parts as they didn’t sleep-in. For Photoshop I’m using Cinepaint since some months now as Photshop’s wimpy 16-Bit support doesn’t quite cut it with real color correction, especially when you need to do the work on 32-Bit float images or higher, like bringing down HDRI files.\n\nI basically only use photoshop to add type to the final images, or to do title plates to integrate with Cinepaint or Final Cut.\n\nI tried Inkscape and quickly got bored. Xara seems to have topped Illustrator a while ago, but spending a day installing it? naah!\n\n@ Miguel: I got in late with X on production machines since virtually nothing was there, but with the Intel machines I only have very few apps that I need that aren’t ported yet. I’m actually looking forward to be running my X11 apps in virtualization mode.\n\nSo until Xara has something installable out I’ll stick with Illustrator. Photoshop might be still around for backwards compatibility with my archives. Pages is becoming more powerful with each update, I’m doing all of my letters and invoices with it now. Might be a real layout app soon.\n\nAlso I’m wondering if Adobe has a huge interest in Mac native versions anymore since virtualization and bootcamp. They were having a hard time with OS-X right from the start so that’ll be interesting to watch.\n\nProduction machines, Aether? Did you actually work on a new iMac yet? I was very surprised how well it handles HD content, didn’t try film res yet on one of those.\n\n"
    },
    {
      "time": " 12.Apr.2006 5.06pm",
      "content": "Well lucky for me i’m running a PC XP desktop environment side by side with OSX Intel CoreDuo Powerbook, so its the best of both worlds. The only drawback here is software licencing.\n\nThe Mac is still fresh, so i havent had a lot of time to test it through Rosetta. From all reports its sluggish at best, but so long as its not the primary environment, then i cant imagine major dramas.\n\nStill fairly fresh to the industry, applications like Quark are something i’ve never had to meddle with. Snicker if you will at my naiveity, but i cant imagine ever needing anything beyond the CS suite for print/web design. They really have got all bases covered, and integration is getting better and better.\n\n"
    },
    {
      "time": " 12.Apr.2006 8.58pm",
      "content": "Let’s see - am I going to ditch my Dual Gig G4 with a 72 gig 15,000RPM SCSI scratch disk, 3 internal drives, and 2 gigs of RAM to buy an Imac or a Powerbook with an Intel chip and then stop using Adobe products because they are holding to their typical 18-24 month development cycle?\n\nI’ll really have to think about that…\n\npeace\n\n"
    },
    {
      "time": " 12.Apr.2006 9.31pm",
      "content": "Life without Photoshop? Get real dude. Adobe Rocks!\n\n"
    },
    {
      "time": " 13.Apr.2006 9.40am",
      "content": "It’s a shame they haven’t released the UBS for MacPaint or I might be taking this seriously…\n\npeace\n\n"
    },
    {
      "time": " 13.Apr.2006 11.32pm",
      "content": "I’d be less concerned for when Adobe provides Universal apps than when Apple no longer supports Power PC apps. Universal is going to make your design better? I don’t have a problem with electronic “progress” but I also like my money spent to get it’s full usage.\n\n"
    },
    {
      "time": " 14.Apr.2006 10.55am",
      "content": "This is “hammer” syndrome stuff—give a kid a hammer there will suddenly be nails all over the house just begging to be banged back into the floor boards.  \nRemember that every machine and application that you buy is already obsolete because the successor is under development. To date no software development schedule has ever led to having any of my jobs cancelled or delayed. So I just don’t worry about what’s coming when. It is not the platform or application that determines the result. It is the interface of task and user. One just does the job with what one has. When the tool is no longer capable of the task, then I look for new stuff. Oh yes, I also make it a principle to never buy a new car.\n\n"
    }
  ]
}
