{
  "id": "19205",
  "title": "Clearview in action",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "blank\n\n",
  "author": "kilby74",
  "time": "11 Apr 2006 — 6:36pm",
  "uid": "12437",
  "comments": [
    {
      "time": "11 Apr 2006 — 8:47pm",
      "content": "I imagine James Montalbano at Terminal Design might be able to help you out in that department. When I saw James deliver a really interesting and informative talk in Toronto about Clearview he had a very detailed presentation with photos, samples, and some comparisons between the features and attributes of other typefaces also being used for highway signage applications. Although I think a fair bit of thatt info might be on the Clearview website. Afterwards James was kind enough to leave the PDF on my laptop which was used for the presentation. I'd post it but I think I'd have to get permission from James first, I think he posts on Typophile if I am not mistaken.\n\nUnfortunately I have none of my own photos of Clearview in use.\n\n"
    },
    {
      "time": "11 Apr 2006 — 9:16pm",
      "content": "Thank you for replying! I do hope James sees this post and can agree to share his photos.\n\n"
    },
    {
      "time": "16 Jun 2006 — 10:20pm",
      "content": "There is a number of \"roadgeek\" websites where ClearviewHwy can be seen in use along highways in places like Texas.\n\nEric Stuve maintains the OKRoads website at [http://www.okroads.com](http://web.archive.org/web/20131010190740/http:/www.okroads.com/ \"http://www.okroads.com\"). He also maintains some other roadgeek related websites. His road trips cover a really big portion of the Interstate Highway system, including many roads in Texas. He recently posted photos of a West Texas and New Mexico road trip made during April of 2006 at this link:  \n [http://www.okroads.com/roadtrips/wtexas.html](http://web.archive.org/web/20131010190740/http:/www.okroads.com/roadtrips/wtexas.html \"http://www.okroads.com/roadtrips/wtexas.html\")\n\nHe hasn't yet organized the trip photos into an easy to navigate page (he's working on it). If you click on the Lubbock to Oklahoma City link you'll find a parent directory featuring lots of photos, many of which feature roadway signs along the entire length of Interstate 27. Much of the northern half of that Interstate's signs have been entirely replaced with new ones featuring ClearviewHwy legends. Most of the big green signs in Amarillo are set in Clearview. He has other photos in the El Paso area where ClearviewHwy appears sporatically on new signs mixed in with old ones. The posted photos are not high resolution, but one can easily ID the ones set in Clearview.\n\nOther roadway signs in Texas are kind of a pot-luck thing regarding ClearviewHwy. Older signs and storm damaged signs are replaced bearing the new typeface. It seems like the Texas Panhandle is getting the most aggressive treatment on ClearviewHwy-based roadway sign installations. It's even appearing on little street name signs in small blink-and-you-miss-them sized towns.\n\nYou might also want to visit [www.houstonfreeways.com](http://web.archive.org/web/20131010190740/http:/www.houstonfreeways.com/ \"www.houstonfreeways.com\"). Erik Slotboom has lots of high resolution photos of super-highways across Texas, some of which feature ClearviewHwy-based signs. His new photo essay of the Marsha Sharp crosstown freeway in Lubbock has a couple decent shots of signs set in CV-5WR\n\n"
    },
    {
      "time": "17 Jun 2006 — 8:11am",
      "content": "Sorry for the late reply, I didn't see this thread before. Most of the images I have are already posted on our [clearviewhwy](http://web.archive.org/web/20131010190740/http:/clearviewhwy.com/) website. I have a few more of ClearviewHwy in use. Contact me directly if you still need them. (although I imagine your school project has long been handed in)\n\n"
    }
  ]
}
