{
  "id": "19212",
  "title": "Zero in Garamond Premier Pro",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have used Adobe Garamond Premier Pro in a couple of recent books, and like it a lot. One thing that upsets me though is the oldstyle zero, which looks kind of unfinished to me. It looks like a perfect circle, with no 'shape' or modulation. Does it look odd to anyone else? The first time I saw it in print I thought it was a mistake.\n\nI've tried to attach a scan, but I'm not convinced it's going to show up. You can also find one here:\n\n[http://store.adobe.com/type/browser/landing/garamond/garamond.html](http://web.archive.org/web/20100602123345/http:/store.adobe.com/type/browser/landing/garamond/garamond.html \"http://store.adobe.com/type/browser/landing/garamond/garamond.html\")\n\nToby\n\n",
  "author": "<a href=\"/web/20100602123345/http://typophile.com/user/12360\" title=\"View user profile.\">Toby Macklin</a>",
  "time": "<br>",
  "uid": "12360",
  "comments": [
    {
      "time": "",
      "content": "Toby: You might be interested in this thread from a little while ago. [http://typophile.com/node/17772](http://web.archive.org/web/20100602123345/http:/typophile.com/node/17772 \"http://typophile.com/node/17772\")\n\n"
    },
    {
      "time": "",
      "content": "You'll find this \"perfect circle\" style in a number of historical revivals. Check out Carter's Big Caslon. The design reflects earlier attitudes about the number zero itself. Western mathematics was not comfortable with the concept of zero for some time, and felt that it was not a number in the usual sense.\n\nYou can always substitute a lc \"o\".\n\n"
    },
    {
      "time": "",
      "content": "[http://www.typophile.com/node/17772](http://web.archive.org/web/20100602123345/http:/www.typophile.com/node/17772 \"http://www.typophile.com/node/17772\")\n\n"
    },
    {
      "time": "",
      "content": "It's a sophisticated form.  \nIt makes aesthetic sense in faces such as Garamond that have long thin stems in various characters, such as the upper case M and N, and the em dash, and especially the 4 and 7, where the long thin stem has no finial. Because of these other instances, it is not an isolated quirk, but shares an element of the face's graphic language.\n\n"
    },
    {
      "time": "",
      "content": "Sophisticated?  \nMaybe if you ignore the realities of immersive reading.  \nFudoni is not a text face.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_Fudoni is not a text face._\n\nFalse dilemma.\n\n"
    },
    {
      "time": "",
      "content": "\\>The design reflects earlier attitudes about the number zero itself. Western mathematics was not comfortable with the concept of zero for some time, and felt that it was not a number in the usual sense.\n\nAccording to [this article](http://web.archive.org/web/20100602123345/http:/en.wikipedia.org/wiki/0_(number)), the use of the zero came into Europe during the 13th century. Printing is 15th century, so the issue of the acceptance of zero is unlikely to be involved in the circular old style zero. I think it is for typographic reasons, to prevent confusion with the cap, small cap and lc 'o'. It is generally not, in fact, a perfect circle, though it is more circular than any of the o's.\n\n"
    },
    {
      "time": "",
      "content": "The prevalence of the zero could have taken more than 250 years, you have to consider that Indian numerals changed the whole concept of mathematics (especially for more complex mathematics than adding and subtracting). Taking into account resistance to Fibonacci's _upstart_ system and the generations that would need to pass before enough teachers were able to teach the system to enough pupils to make the system widely understood and accepted. Added to that would be the clergy wishing to retain reading as their skill.  \nTim  \nbtw William, your link doesn't seem to work\n\n"
    },
    {
      "time": "",
      "content": "Sorry, fixed the link.\n\n"
    },
    {
      "time": "",
      "content": "The ring zero is one of the ways in which type designers at different times have tried to resolve the problem of confusion of lowercase o and oldstyle zero. It is a problem that has never been really adequately resolved, and we rely heavily on context to distinguish these two characters. In historic revival projects such as Garamond Pro, the designer has to ask 'Should I follow the approach of the original to this problem, or should I try to come up with my own solution'. The answer in most revivals seems to be to follow the original; after all, the selling point of the design is that it is a revival of something e.g. cut by Claude Garamond in the 16th century.\n\n"
    },
    {
      "time": "",
      "content": "\\> a problem that has never been really adequately resolved\n\nWell, you don't have to \"resolve\" anything to simply make the situation less bad.\n\n\\> the selling point of the design is that it is a revival of something\n\nOn the other hand, it's an interesting question whether the user (generally  \na layman) bases his opinions on that micro level of detail. Certainly some  \nusers do, but I think they're rare. Much more common I think is the user who  \nwill say it's ugly/wrong when (more likely, if) it's brought to his attention.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I am one of those rare users, but I'd think now that we have OT we should be able to have more than that 0 for use. I'm all for historical accuracy, but this 0 is not attractive. Unless I'm shooting for some sort of pretention I don't find it to be a useful glyph. A single flaw in an otherwise gorgeous family. I do realize that there are lining figures to be used, but an alternate old style 0 would be wonderful.\n\n"
    },
    {
      "time": "",
      "content": "Hmmm. I think if I had been considering the question when the typeface was in development, I would have suggested to Robert that he use a stylistic set for an alternate zero. That's certainly what I'll do if I'm ever in that situation as a type designer.\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Here’s a collection of more than 2,000 zeros:\n\n[http://www.forgers.de/letters/num\\_0.pdf](http://web.archive.org/web/20100602123345/http:/www.forgers.de/letters/num_0.pdf \"http://www.forgers.de/letters/num\\_0.pdf\")\n\nGuess which zero is that of Garamond!\n\n"
    },
    {
      "time": "",
      "content": "Useful! Thank you. What are the numbers?  \nBTW, that first one (125) is actually a rare but  \nclever solution to the problem of the OS zero.\n\nhhp\n\n"
    }
  ]
}
