{
  "id": "19241",
  "title": "Work Load",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was wondering how much work should be expected of a graphic artist in a day.. Is it unreasonable to have approx 20 files to prepare for email... i.e. outline fonts and size images and to recreate (Match Font.. completely redraw logo/design) approximatly 3 logos and do 3 to 5 complete layouts in a day.. Layouts = Typesetting with logos revisions..\n\nThis week so far = 100 ai files... Created.. everything from logo sizing to logo recreation...  \n83 outgoing emails  \n72 incoming emails  \n39 photoshop files.. remove backgrounds .. change shirt colors add logos and generally cleanup..  \nTake pictures of items for webpages etc...\n\nCreated 72 pdf proof files...\n\nThis is so far this week...\n\nIs this too much for too little.. under $14 an hour? Is this unreasonable at any pay? or am I whining?????\n\n [‹ Adobe Universal waiting / ditching?](http://web.archive.org/web/20081007142930/http:/typophile.com/node/19209 \"Go to previous forum topic\") [What does this symbol 'ß' stands for ›](http://web.archive.org/web/20081007142930/http:/typophile.com/node/19263 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007142930/http://typophile.com/user/2451\" title=\"View user profile.\">amiart</a>",
  "time": "<br>",
  "uid": "2451",
  "comments": [
    {
      "time": " 13.Apr.2006 10.32am",
      "content": "You’re whining. I got into this business 8 years ago as an Assistant Art Director at a magazine. I worked 60+ hours/week for $50/day. After 7 years of not whining, I became a Creative Director who works 60+ hours/week. I also receive about 150-200 emails every day. Bust a\\*\\* until you’re good enough to get a better job where you will still work long hours on insane deadlines, but the work will be more exploratory and you’ll make a little more money. You’ll find that in time, you’ll develop a much greater stress threshold. Maybe I’m a sadist, but if you’re passionate about design, paying your dues should be a source of pleasure. Good luck.\n\n"
    },
    {
      "time": " 13.Apr.2006 3.05pm",
      "content": "Dennis,\n\nI would say that the quantity of work you describe is definitely not to be sniffed at. If you feel you are working to your maximum capacity and the workload is still growing then don’t keep flogging yourself until you burn out. Standing up for yourself is not “whining” and there are always better paid positions to be had elsewhere if you are unhappy.\n\nNaturally when designers look back on their lean years, the rose tinted spectacles come out – however, there is a difference between the romantic notion of paying one’s dues, and selling yourself short. In an industry where you are expected to be unquestioningly grateful for even having a paid position when design firms can exploit an endless number of people who will do work placements/internships for no money, it helps no-one to instill low expectations. The only result is a gradual devaluing of the designer.\n\nGood luck\n\n"
    },
    {
      "time": " 14.Apr.2006 8.21am",
      "content": "Are you working full-time or freelance? If fulltime, what are your hours? If the workload you described above can be completed in a 35-40 hour week you have nothing to complain about. If you are working long overtime hours for no extra pay, you have a right to complain.\n\nIf you’re a freelancer, it’s up to you to manage your time. I find working for myself I am much more efficient, I can do a full day’s work in 5-6 hours and I tend to overbook myself a bit to hedge against the leaner times.\n\nEverybody works at a different pace, as well. I learned, as art director, that there are people who can simultaneously juggle several different jobs and do all of them equally well and others who need to focus on one task at a time, more slowly and deliberately. So it became a matter of balancing what I assigned to my designers. I valued them all, but definitely appreciated the ones who I could throw an extra curve ball at and they’d manage it OK. Those are the types who are more likely to become art directors themselves.\n\nIn any event, there are a lot of designers struggling for work, I’d not complain about being too busy if I were you.\n\n"
    }
  ]
}
