{
  "id": "19248",
  "title": "help selecting text faces",
  "forum": "Design",
  "tags": [

  ],
  "content": "I need a bit of help selecting a text face for a publication I’m redesigning. We have no budget for purchasing new faces, but have several from the Adobe suite. I put a star next to the faces to which i’m leaning toward:\n\nMinion +  \nWarnock  \nGiovanni  \nBerling +  \nGaramond  \nUtopia  \nRotation  \nITC Stone Serif +  \nCaslon +\n\nThe publication will be printed on a higher-quality newsprint. Not bright white, but not the cheap junk you see everyday. The publication is an annual city guidebook. It will have several feature stories and have an overall warm and inviting feel.\n\nI like Caslon for its readability, but i feel like it less suitable for a magazine-style publication. I love Minion, but one of our other publications uses it as a text face. Berling is nice, but i wonder if it would hold up on the newsprint.\n\nAny thoughts would be greatly appreciated.\n\n-Roy\n\n [‹ Gill Sans - Moving Forward from](http://web.archive.org/web/20080906164154/http:/www.typophile.com/node/19150 \"Go to previous forum topic\") [Sonopa—Evolution of a Typeface ›](http://web.archive.org/web/20080906164154/http:/www.typophile.com/node/19190 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906164154/http://www.typophile.com/user/10355\" title=\"View user profile.\">seventy7</a>",
  "time": "<br>",
  "uid": "10355",
  "comments": [
    {
      "time": " 13.Apr.2006 1.44pm",
      "content": "What city is it?  \nAdobe Caslon might be too high-contrast for newsprint.\n\n"
    },
    {
      "time": " 13.Apr.2006 1.50pm",
      "content": "City: Richmond, Va.\n\nThe newsprint we’re using is smoother and about 15% brighter than your everyday newspaper newsprint. We’re currently using Minion in another product and it works well on the same paper.\n\n"
    },
    {
      "time": " 13.Apr.2006 1.59pm",
      "content": "Utopia is good on newsprint — quite a few papers use it.  \nIt’s “big on the body”, so designed for that kind of usage.\n\n"
    },
    {
      "time": " 13.Apr.2006 2.33pm",
      "content": "Avoid Stone Serif and Giovanni.\n\n"
    },
    {
      "time": " 13.Apr.2006 2.38pm",
      "content": "Any thoughts on Minion versus Berling?\n\n"
    },
    {
      "time": " 13.Apr.2006 2.43pm",
      "content": "Also, can you explain your thoughts about Stone and Giovanni? I tend to think Giovanni is a bit too round and friendly for what i’m looking for. I’m not sure how i feel about Stone, but i’m inclined to say that it falls into the category of over-used fad faces. It wears the mark of an 80’s text face, no?\n\n"
    },
    {
      "time": " 13.Apr.2006 2.47pm",
      "content": "I prefer Berling to Minion, and think Giovanni and Stone Serif naff.\n\n"
    },
    {
      "time": " 13.Apr.2006 2.53pm",
      "content": "Naff is the perfect word for them.\n\nThanks for your help so far. I know it’s a pretty boring forum topic to post on since i’m not looking to purchase any new types, but these discusions are helpful nonetheless.\n\nBeing confined to the Adobe Suite can be tough. It really makes me crave something fresh.\n\nWhich Adobe text faces have worked well for others?\n\n"
    },
    {
      "time": " 13.Apr.2006 2.57pm",
      "content": "Would the lack of text figures steer you away from Berling?\n\n"
    },
    {
      "time": " 13.Apr.2006 3.03pm",
      "content": "Yes, for text, esp. variable length, old style figures are best.\n\n"
    },
    {
      "time": " 13.Apr.2006 3.17pm",
      "content": "It’s strange that you’ve got a budget for an upgraded paper, but not even a couple hundred extra dollars for a text face.\n\nAnyway, [Lido](http://web.archive.org/web/20080906164154/http:/www.stormtype.com/free.html) is great for newsprint and free.\n\n"
    },
    {
      "time": " 13.Apr.2006 4.14pm",
      "content": "\\> Anyway, Lido is great for newsprint and free.\n\nwell it’s actually free for _non-commercial_ use…\n\n“Storm Type Foundry (STF) provides it free of charge for non-commercial use in households, in education, for private scholars, et al.”\n\ni agree (with Fisheye) about the paper though. i’d rather see nice type on cheaper paper.\n\n2 cents…\n\n"
    },
    {
      "time": " 13.Apr.2006 7.19pm",
      "content": "(This is seventy7 from above using an older profile i set up from home. the seventy7 profile was set up from work and i don’t have the password with me.)\n\n\\> <cite>It’s strange that you’ve got a budget for an upgraded paper, but not even a couple hundred extra dollars for a text face.</cite>\n\nyou’re absolutely right. The challenge is that I’m working at a **very** budget-conscious newspaper. The publication is about 160 pages with a cheap glossy cover stock, upgraded newsprint text pages and it’s saddle-stitched. horrible.\n\nI’ve considered trying to get them to allow me to purchase a text face, but I’d really have to be able to sell them on it. I’d have to explain why the typefaces they’ve already spent a ton of money on aren’t cutting it. It’s been explained to me that we’d have to pay for 5-6 liscenses—1 for my CPU, 2-3 for our paginators and 2 for our RIPs.\n\n"
    }
  ]
}
