{
  "id": "19246",
  "title": "Converting Fonts from Mac to Win",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hi everyone.\n\nI have a project for you all to test your font conversion skills!\n\nI have a ZIP file that has lots of Mac fonts. I use WIN and I have absolutely no way to convert them to WIN. Would a benevolent friend be willing to do the conversion??\n\nLoaves\n\n",
  "author": "<a href=\"/web/20110526211102/http://www.typophile.com/user/11659\" title=\"View user profile.\">loavesandfishes</a>",
  "time": "<br>",
  "uid": "11659",
  "comments": [
    {
      "time": "",
      "content": "not here…\n\nedit:  \npeople around here tend to take End User Licence Agreements seriously so, unless you own the rights to use the fonts in the first place, and have been granted permission by the various font's respective foundries to convert them yourself, i most certainly doubt that anyone on this forum will be able to help you.\n\nremember, if it costs money to buy different fonts in different formats, it's probably not really right to do it for free.\n\nyou probably didn't know, so sorry to break it to you…\n\n"
    },
    {
      "time": "",
      "content": "These fonts, as far as I know, are completely license-free. I own them. These are not rip-off fonts. I wouldn't make any insinuations about my motivations.\n\nNot every freelance typographer can afford $200 conversion software like you guys can...\n\n"
    },
    {
      "time": "",
      "content": "HK, can you go to the foundry from whom you licensed them and ask to transfer your license from MAC to PC?\n\n"
    },
    {
      "time": "",
      "content": "Unfortunately, the fonts only come in Mac format. Similar to MacRhino fonts. As far as I know there is no license for Mac or Win.\n\nThanks for your help!\n\n"
    },
    {
      "time": "",
      "content": "Who did you license them from? I'll bully them for you.\n\n"
    },
    {
      "time": "",
      "content": "In Mr. Fishes' defense: The typefaces he wanted converted were freeware/license free [here](http://web.archive.org/web/20110526211102/http:/www.josbuivenga.demon.nl/delicious.html). They weren't available for PC until recently and so Mr. Fishes no longer needs converting.\n\n"
    },
    {
      "time": "",
      "content": "i didn't mean to sound rude in that original post… i just wasn't sure what the motivations were and i was just trying to look out.\n\nhope you have what you need, HK.\n\n------\n\n"
    },
    {
      "time": "",
      "content": "Hi,  \nWhen I need to convert a font I use my old standby FontHopper. EULAs' aside, when a job is on my desk and Calfisch Script bold is needed I breakout Fonthopper and I convert. You may call me what you wish, but EULAs are an absurd reality. You can call me what you want, but really think about this, if Adobe can have a patent on a typeface (I'm thinking AGaramond here) that is not only from derivative work, but also quite like (think only a loupe could show us most any difference) another font (think Berthold Garamond) then an EULA is not quite the Magna Carta, is it?\n\nWhen big type plagerizes, they put on the happy face of \"Adobe Original\" for Coronos.\n\nBig Type plays to the hype that when fonts (wrongly called software) are stolen that somehow the designers are going to die penniless. Guess what, if all of us paid for every font, somehow type designers would still die penniless. Long before postscript democracy of fonts was around Max Miedinger died penniless. His font was tied to one Big Type company. They sold it and sold it and we curse it as helvetica. If ITC had the license he still would have died penniless. Did pirates make him die penniless? NO!\n\nBig type puts the squeeze on designers, smaller founderies and customers. Big Type stays big as long as they dominate the market. To the point now, where small type is really just a minor league for Big Type, they act much the same, but they don't quite have the libraries that do not have to follow fashion to keep food on the table.\n\nI do believe in order and am mostly a lawful type, but I hate it when issues regarding fonts have an unbalanced moral thermometer. You have a right to kick me for converting a font, but please scream to the mountain tops about big type too!\n\nThere is a good chance that if I'm booting \"Antique Olive Nord\" and I start making some bucks with it that at some point being a pirate will be too risky to my reputation or my clients reputation, that the font will be bought to cover this risk. I've yet to see Bitstream say something like \"our Swiss is really Helvetica and we should pay a royalty to Linotype.\" Believe you me they have made more money than you or I have in dealing with \"pirated\" material.\n\nSincerely,  \nRodrigue Planck\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "",
      "content": "{edited}\n\n"
    },
    {
      "time": "",
      "content": "Is there something wrong?\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "",
      "content": "{edit}\n\n"
    },
    {
      "time": "",
      "content": "No I did not say that!  \nBy conversion I mean PC to Mac or vice versa. I work in a printshop environment where deadlines are already passed. I'm not ever going to use a converted font at the onset of a job.  \nI'm interested in where you think I stated renaming a font. I think on the PC there was a program that did that called FontFiddler(I'm a mac guy).\n\nYou ever hear of superfonts? Funny story if you have not heard of them.\n\nRodi  \nThe Truth shall set you free\n\n"
    },
    {
      "time": "",
      "content": "oh i see. i'm gonna go ahead and edit my last two posts… sorry.\n\nhowever, you did mention:\n\n\\> EULAs are an absurd reality.\n\nand then there was some other stuff about Adobe Garamond and it being:\n\n\\> not only from derivative work, but also quite like (think only a loupe could show us most any difference) another font (think Berthold Garamond) then an EULA is not quite the Magna Carta, is it?\n\nimplying that Adobe stole the design from Berthold, which IMHO is absurd.\n\nsorry for the misunderstanding.\n\n"
    },
    {
      "time": "",
      "content": "i stitll think you should get permission before you mess around with people's font _software_…\n\n: P\n\n"
    },
    {
      "time": "",
      "content": "Don't be sorry!  \nI have a question for you, what does the (\\< mean?  \nPersonally I think its sad that Adobe has stooped so low so many times, uhm in so many areas! Unfortunately, they are following a rich tradtion of our craft!\n\nRodi\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "",
      "content": "Don't be sorry!  \nI have a question for you, what does the (\\< mean?  \nPersonally I think its sad that Adobe has stooped so low so many times, uhm in so many areas! Unfortunately, they are following a rich tradtion of our craft!\n\nRodi\n\n"
    },
    {
      "time": "",
      "content": "Hey,  \nshow me how a font is \"Software\", before you call it \"Software\". I'm not trying to be tough, but I gotta be.\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "",
      "content": "for some reason the double {less than symbol} (which i've now deleted) left out the part about the alleged Adobe/Berthold ripoff being absurd…\n\n; )\n\n"
    },
    {
      "time": "",
      "content": "Do you have a copy of Berthold Garamond? Check it out compared to Agaramond in a font editor, and it is so close enough that the idea of a patent for Adobe should be absurd.\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "",
      "content": "\\>show me how a font is “Software”, before you call it “Software”.\n\nwhat do you mean? a font is a program that you download and install on your computer. it's definitely not hardware!\n\n"
    },
    {
      "time": "",
      "content": "Hi,  \nAre pictures you create a software program? A font is not coded, its drawn, has points, metrics and other such stuff, but it is not  \n\"Simple Text\" in software.\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "",
      "content": "\\>Do you have a copy of Berthold Garamond? Check it out compared to Agaramond in a font editor, and it is so close enough that the idea of a patent for Adobe should be absurd.\n\ni don't have a copy of both fonts to compare so you got me there. but i've heard how aggro Berthold gets about their licences and if there was even a chance that Adobe straight up ripped them off, i am sure there would have been a lawsuit or a settlement of some sort…\n\nare you comparing all of the other critical info such as the spacing and kerning?\n\n"
    },
    {
      "time": "",
      "content": "Bro,  \nyour not going to tell me that a font is not a piece of software. yes. if i saved an illustrator file onto a disk, it is software.\n\n\\>A font is not coded, its drawn, has points, metrics and other such stuff,\n\nit is coded information. where do you think the vector information comes from…\n\nwtf\n\n"
    },
    {
      "time": "",
      "content": "My point was this, that Adobe made a font that was so close to an existing font and applying for a patent(as an original, non derivative work) when clearly there was existing work that Adobe should never have gotten a patent on it.  \nGlyph wise there are minor, minor differences between the two.  \nNo kerning and spacing the Berthold is superior to adobe, as usual!\n\n"
    },
    {
      "time": "",
      "content": "No it is not software. Your vector art is (much like a font) latent inside of the host application, but it was not coded. You draw characters and place them in, you don't code numbers to what you want. I cannot take USM out of Photoshop and use it or display it for you, but I can take a character out of font and display it for you.\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "",
      "content": "Think of it this way,  \ndo you keep your fonts with your applications or on a folder near your documents?\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "",
      "content": "\\>My point was this, that Adobe made a font that was so close to an existing font and \\>applying for a patent(as an original, non derivative work) when clearly there was existing \\>work that Adobe should never have gotten a patent on it.  \n\\>Glyph wise there are minor, minor differences between the two.  \n\\>No kerning and spacing the Berthold is superior to adobe, as usaual!\n\nBUT this is the case of a revival, and the fonts are probably based on the same original types (yes, it's ok for two foundries to make fonts from the same original typeface), so it doesn't suprise me that the glyphs are strikingly similar. however, a font is not just a set of glyphs. it is all the other stuff that goes with it like kerning, hinting, and other bits of info that make it different from the next.\n\nyou yourself would argue that Berthold's spacing is _superior to adobe_ so don't you agree, in that case, that the Berthold font would hold value next to the Adobe font?\n\n"
    },
    {
      "time": "",
      "content": "A revival should never ever get a patent.\n\n"
    },
    {
      "time": "",
      "content": "\\>do you keep your fonts with your applications or on a folder near your documents?\n\nregardless of where i keep my fonts, it makes perfect sense that it is referred to as _software_ in an EULA. what else are they supposed to call it? like i said before, it's definitely not _hardware_. in this day and age, it is ever so important for people to protect their proprietary information.\n\n"
    },
    {
      "time": "",
      "content": "Fonts, like software should be protected for its' intellectual property.  \nAre Royalty Free Photographs software?  \nIs your Word document software?  \nOn Adobe Garamond, ok I have many Garamonds (Berthold, URW, ITC, Bitstream, Linotype/Adobe and Adobe) and none are as strikingly simillar as Berthold/Adobe. Can I tell URW Garamond is a Garamond? YES. Do I think they used a similar source to make the font,yes, but there are always interpertations that must be used to solve technical/artistic issues and Adobe Garmond is just is too close to Berthold. To boot they applied for and recieved a patent on it.\n\nIf font companies really wanted to protect their fonts they could make hardware keys that could attach to computers to help regulate them. I know Hoefler did some kind of font protection a number of years ago, and it seemed pretty good to me, although a bit of a hassle.  \nBig Type is quite deceptive though. Have you ever heard of an upgrade that wasn't? In keeping up with EULAs, if I have Adobe Font Folio \"d\", it may not contain anything about embedding of fonts. I am free to use them in PDFs left and right even today. However, when I upgrapde to Font Folio \"f\" I get a few more fonts, but the EULA has changed hopefully I have read the EULA, because if I assume that I can still embed a pdf, I'm wrong. Now, who is sleazier, the guy who buys the font and does not read the EULA or the company that changes their EULA and do not have the internal fortititude to say \"IMPORTANT YOUR LIFE IS GONNA CHANGE RIGHT HERE ONCE YOU UPGRADE, YOU ARE SUNK!\" No they sell like its milk and honey, then they get their heavies against you once you break their law. That is not just.\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "",
      "content": "i think there is a confusion between hardware, software and data.\n\ni'll quote wikipedia for that one:\n\n«Computer software (or simply software) is that part of a computer system that consists of encoded information (or computer instructions), as opposed to the physical computer equipment (hardware) which is used to store and process this information. **The term is roughly synonymous with computer program but is more generic in scope.** »\n\nbut more important is this quote, which i think is correct:\n\n«Relationship to data  \nSoftware has historically been considered an intermediary between electronic hardware and data, which later the hardware processes according to the sequence of instructions defined by the software. As computational science becomes increasingly complex, the distinction between software and data becomes less precise. Data has generally been considered as either the output or input of executed software. However, data is not the only possible output or input. For example, (system) configuration information may also be considered input, although not necessarily considered data (and certainly not applications data). The output of a particular piece of executed software may be the input for another executed piece of software. Therefore, software may be considered an interface between hardware, data, and/or (other) software.»\n\n"
    },
    {
      "time": "",
      "content": "Rodrigue, please stop lying. There has never been ANY version of Font Folio for which the license said you could not embed fonts in PDFs.\n\nAlso, although you may feel that fonts are not software, it is important to note that US courts have determined otherwise, whether you like it or not.\n\nI'm not going to address your other ridiculous assertions, because they are matters of opinion (however bizarre I may think your opinion is). However, regarding Adobe's Font Folio licensing, you are simply wrong as a matter of fact.\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Rodrigue Planck courageously wrote:  \nIf font companies really wanted to protect their fonts they could make hardware keys that could attach to computers to help regulate  \nthem. I know Hoefler did some kind of font protection a number of years ago, and it seemed pretty good to me, although a bit of a hassle.\n\nKesh removed the confusion between hardware, software and data?!\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n.. but even then, there will always be someone who will unlock the keys by doing reverse engineering and removing the protection no matter it is hardware, software and/or data. It just can not be stopped.  \nUnlike books, what takes months to finish, a software/data can be copied and distributed within seconds.  \nWebwise, anyone can download and use All of the features of any program without paying even a single cent.  \nIt is not possible to enforce the Laws in a small town, let alone the entire world.\n\nThat's the truth: In this world,  \n1. The Smartest Locks Breakers are the Locks Makers!  \n2. The big fish eat the small fish and you can not sue any Power if you are nobody!  \nRegrettably, this seems to be the case throughout the entire world.\n\n"
    },
    {
      "time": "",
      "content": "Thomas,  \nThen why did Agfa fonts Stop being sold as part of Font Folio? How About Berthold? Embedding, Correct?  \nSpeaking of Lies CORONOS or Today Sans? CMON THOMAS! Adobe Garamond isn't too much like Berthold Garamond is it? A Patent on AGaramond? Who is lying Thomas?  \nI know I had a Diatronic from Berthold. Look at them in FontStudio and you will see they are amazingly similar, too close for comfort.\n\nRodi\n\nThe Truth shall set you free\n\n"
    }
  ]
}
