{
  "id": "19251",
  "title": "global notan / local saliency & cue-value",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hrant argues that [chirography](http://web.archive.org/web/20100313232932/http:/typophile.com/wiki/chirography) is anti-notan.\n\nThis came up again recently in the [so much for the dominance of chirography](http://web.archive.org/web/20100313232932/http:/typophile.com/node/18932%20forum), thread, in the context of my discussion of how the brain codes the orthographic shapes of words in terms of chirographic 'scripts'.\n\nWhile Hrant's argument has little or no direct bearing on whether the human mind in fact codes orthographic knowledge in terms of chirographic scripts, Hrant's argument has a monumental bearing on how we ought to see the task of typographers and type designers today. If [notan](http://web.archive.org/web/20100313232932/http:/typophile.com/wiki/notan) is a relevant concept in the type domain, and if chirography is anti-notan, we should avoid chirographic 'artifacts' in type-design.\n\nHrant argues 1) that notan is a relevant and 2) chirography _by it's very nature_ limits our ability to meet the demands of black / white equivalence that the concept of notan evokes. This is so because the tool of writing gives precedence to and arbitrarily constrains the figural logic of the black in a way that is unfriendly to visual wordform (or [bouma](http://web.archive.org/web/20100313232932/http:/typophile.com/wiki/bouma)) resolution, because effective visual wordform resolution needs the black and white in balance. (These statements are a mix of my words and his.)\n\nIn a post on the form in question I said:\n\n_I understand the logic of your argument from the concept of notan, but I have questions about it’s applicability as you present it._\n\nYour argument presumes notan in typographical contexts implies black / white balance or equivalence. Vision, however, operates according to a logic of saliency and cue-value, and some criterial components are white and others black. The cue values have to be well managed, and the saliencies proper, and doesn’t this imply local inequities in black / white management? So doesn’t this mitigate your claim of linked contours being anti-notan?\n\nHrant suggested I make the post an opening statement in a new topic, which I'm happy to do.\n\nSo the question is: notan evokes the notion of equivalence or equal valence, but doesn't the perceptual processing involved in visual wordform resolution rely on differential valences? Perhaps notan in the typographical domain is intended to mean a (global and dynamic) balancing of differential (local and weighted) valences across the bounded map, but doesn't this typographically pro-rated meaning, and the actual functionality of these differential valences at the stem / crossbar / bowl / counters level, soften the absoluteness of the claim that chirography is intrinsically anti-notan? The salience of local features benefits from well-formedness, which contrapuntal co-ordination of stroke outlines guarantees.\n\nSo the absoluteness of the 'chirography is anti-notan' claim depends on a reversion to a more generic and less typographical-domain adjusted sense of notan than is warrented.\n\nHowever, my impression is that local effects play less of a role in Hrant's parafoveal guessing-biased scheme than they play in my foveo-centric scheme. And this in turn seems out of stem with Hrants sharp sense of local detail.\n\n",
  "author": "<a href=\"/web/20100313232932/http://typophile.com/user/6083\" title=\"View user profile.\">enne_son</a>",
  "time": "<br>",
  "uid": "6083",
  "comments": [
    {
      "time": "",
      "content": "Peter, thanks for clarifying what Hrant has been bothered about. I now understand it somewhat, which I didn't before. Still, there is so much vagueness about all of the claims, it is hard to know what to make of them. 'Notan' or 'Ying-Yang', or 'balance of black-and-white' is an important concept, but it is only a vague, general concept: that balance is important. What exactly it should be or what should guide it isn't specified.\n\nSimilarly, if you want to claim that a 'chirographic' script is one in which the variation in the stroke follows a few simple consistent rules, I don't know how far that gets you. Because type since Jenson and Griffo are influenced by the pen, but are quite willing to violate it for what I prefer to call even color.\n\nI still think that the most felicitous way of saying things was Van Krimpen, who arguing with Morrison about this issue said that the pen has an enduring influence, without determining the shape of letters. (I'm sorry I don't have the quote.)\n\nEdit: I think I remember Van Krimpen's phrase now: that the pen is an  \n'underlying force' in type design.\n\n"
    },
    {
      "time": "",
      "content": "<cite>doesn’t the perceptual processing involved in visual wordform resolution rely on differential valences?</cite>  \nIt must do if one accepts contrast as useful; and one conveniently simple model for contrast manipulation is chirography. I think that the ideal for immersive reading can be achieved by an apparently chirographic type in which the designer feels no requirement to conform exterior outlines to a single axis, interior outlines to the axes of their exteriors, or stroke width to the geometry of a moving front, and, as Bill says, this is exactly what one finds with many long-appreciated types.\n\n"
    },
    {
      "time": "",
      "content": "\"I can’t think of anything necessarily bad about an apparently chirographic type in which the designer feels no requirement to conform exterior outlines to a single axis, interior outlines to the axes of their exteriors, or stroke width to the geometry of a moving front, and, as Bill says, this is exactly what one finds with many long-appreciated types.\"\n\nThere isn't anything bad about this. In fact, I've claimed norm violations can be beneficial. Rotation, clipping, reinflecting can be good.\n\nWilliam, your customary complaint, and I think it's apt, so I've tried to push it somewhat toward typographical specificity. I have the Van Krimpen quote, but it's in Dutch.\n\n"
    },
    {
      "time": "",
      "content": "\\>in Dutch\n\nThe one I am thinking of is in a letter in English to Stanley Morrison; I read it Rauri Mcleans's 'Typographers on Type'--library copy.\n\n"
    },
    {
      "time": "",
      "content": "Sorry Peter, what I meant was \"The ideal for immersive reading can be achieved by an apparently chirographic type...\". I've edited my comment above.\n\n"
    },
    {
      "time": "",
      "content": "\\>push it somewhat toward typographical specificity\n\nYes, I think you raise a very interesting question: What, if anything, is the 'underlying force' of the pen?\n\nWhat I suspect is that one needs relatively simple rules to have a coherent looking script. And then one needs to violate them for even color. These rules will generally be pen rules, but they don't have to be. For example, they can be brush rules, or woodcutting rules, as in Chinese characters. But the strange thing is that it doesn't seem that geometrical rules work. All the rules seem somehow to have the hand in them. Why is this?\n\nSince Noordzij has given the most insight into the influence of the pen, perhaps Peter, you have some ideas?\n\n"
    },
    {
      "time": "",
      "content": "_So the question is: notan evokes the notion of equivalence or equal valence, but doesn’t the perceptual processing involved in visual wordform resolution rely on differential valences?  \n..._\n\nSo the absoluteness of the ‘chirography is anti-notan’ claim depends on a reversion to a more generic and less typographical-domain adjusted sense of notan than is warrented.\n\nI belive the term notan only evokes notions of equivalence or balance in the quite restricted sense that Hrant uses the term, and the more generic sense of notan, as a concept in Japanese aesthetics and as applied in a variety of traditional artforms including, of course, calligraphy, is quite broad enough to encompass differential valences in type design. So when Hrant says 'chirography is anti-notan', he is actually saying 'chirography is incompatible with notan understood as balance or equivalence between black and white'. I think notan is a very useful concept in discussing type -- as it is, ironically considering Hrant's interpretation, in discussing calligraphy, one of the key mediums in which the concept of Notan has been explored by Japanese artists --, so I think it is important to at least be aware of the broader sense of notan, even if one chooses to apply it strictly in terms of balance or equivalance.\n\nNotan is about the relationship of light and dark shapes. That relationship is not always one of balance, although the balance of light and dark obviously has resonance in Asian philosophy, expressed in the balanced opposition of yin and yang in Taoism for instance. The relationship is often one of tension, in which there is a deliberate imbalance, or in which the formal dominance of the light or dark is countered with the spacial dominance of the other, e.g a strong black shape in a large white field. It is also important to observe that in Japanese aesthetics notan is not limited to black and white, but is expressed in terms of light and dark. In the [sumi-e](http://web.archive.org/web/20100313232932/http:/www.touchingstone.com/ShowMay03.html) style of painting, for instance, there may be no pure black or white at all, only shades of grey composed in areas of light and dark. In this context the notion of 'good notan' is obviously much more complex than mere balance.\n\nIn terms of type design and readability, I do think that the concept of notan is most usefully applied in terms of black and white, or of high contrast and consistent tonality. There is enough evidence from readability studies to demonstrate the low contrast and iconsistent tonality is detrimental to reading, and so may be considered 'bad notan' in the particular field of design of text typefaces. But I think it is begging the question to define good notan for reading simply in terms of balance or equivalence.\n\nI don't think we are ready to apply a prescriptive idea of notan to type design: what we need is a descriptive effort, to understand what is happening in terms of notan, in terms of the relationship of black and white, in type that is easy to read and type that is hard to read. If we talk about valences, whether equivalent or differential, then that might suggest something measurable, but this is misleading if we think of it simply in terms of spacial area. The relationships of black and white that we perceive in type are not merely spacial but also formal, and such relationships may involve both tension and balance. While the white spaces between and within black letterforms may constitute formal architecture in their own right, they are also linked, spacially, to a surrounding field between lines of text and between words. The white is note only part of the role architecture of the letter, bouma and word shapes, but is also the container of the text as a whole. How is the black balanced against this? Clearly not by spacial equivalance, since the white has an obvious spacial dominance. The black assumes formal dominance, as is clear from the fact that individual letters are differentiated by their black shapes, not by their white shapes, which may be similar or identical (as the counterpunch made explicit) without undermining the identity of the individual letter.\n\nThe interesting question that has been raised in recent years, most practicably by Evert Bloemsma, is whether readability is enhanced by giving more formal consideration or role-strength to the white shapes within letters. It is a great question, but it is a _question_ not an answer. A typeface like Legato is a question, and it is sad pity Evert did not live long enough for an answer. But we should try to give him one, by studying Legato, both in the sense of examining it and testing it (and, of course, using it), and making other designs that explore this question.\n\nBut we shouldn't assume that increasing the formal role-strength of the white spaces in and between letterforms automatically tends towards or 'restores' balance with the black in terms of notan. The spacial dominance of the white field remains. How does this interract with the role architecture of the internal and inter-letter white shapes? How does it affect the overall relationship of black and white.\n\nAs I've noted before: it has become a commonplace for type designers to wax lyrical about how the 'design the white' or how 'creating the internal white is as important as creating the black'. But with the exception of someone like Evert, very few type designers seem to be able to explain this as a process. At most, they demonstrate an awareness of the white space in the process of designing the black. There are very few processes of white space design elaborated. [I'm reminded a remark Robin Kinross made about the observed difference between the way in which designers say they work and the way in which they actually work.] I suspect one of the main reasons for this is that, outside of the enclosed counter, between the letters and escaping from open counters, the white space becomes a fluid field. The formal role of the white space is under(deter)mined\\* by its own spacial dominance.\n\n\\* How's that for an Ennesonism.\n\n"
    },
    {
      "time": "",
      "content": "The quote from Typographers on Type  \n\"When, in 1923, I started on my first type design Mr Stanley Morison, whose dissertations on typographical dogma I had avidly followed from their very beginning in _The Imprint_, had (though rigorously opposed to an all too direct influence of calligraphy on type and most of all to calligraphic characteristics in it) not yet come to deny that type has anything to do with calligraphy, as he has done from the final issue of _The Fleuron_ onwards, to maintain that type does and should derive from sculptured script. I had grown old enought to be aware, with or without Mr Morison's lessons, that type and calligraphy are two essentially different things and that calligraphic influence in type should, as I put it in that same final issue of _The Fleuron_, be no more than an underlying force. Shall I be able ever to convince him that sculptured script, inscriptions and the like, derive from some form of calligraphy and that, therefore, neither calligraphy nor sculpturing nor engraving should be disregarded when we think of type? I almost doubt it…\"  \nJan van Krimpen (1892-1958). On designing and devising type, New York; The Typophiles, 1957  \nAny mistakes are down to my typing.  \nThe 39 page calligraphic letter to Philip Hofer on certain problems connected with the mechanical cutting of punches, _Harvard College Library_ airs the argument with Stanley Morison.\n\nDoes anyone have that final issue of _The Fleuron_ or a reproduction?  \nThere is an extract in the same book of Stanley Morison's article.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "\\> equivalence or balance in the quite restricted sense that Hrant uses the term\n\nPerhaps Hrant can be more precise about what kind of balance or equivalence he is talking about.\n\nHowever, the concept of 'notan' itself is not very clear. It is, in John's terms, a question and not an answer.\n\nAs I noted earlier in a discussion of this, 'notan' is I believe simply a translation of 'yin yang'. Can someone confirm that it is written with the same characters in Japanese? Furthermore, application of the concept to calligraphy and painting is directly derived from Chinese characters and paintings, whom Japanese masters learned their craft from by copying.\n\nTreating this as a special, distinctive Japanese concept is not only historically wrong, but also misleading. While Japanese art developed its own aesthetic taste and its own masters and masterpieces, I don't believe there is anything distinctive in its concept of 'notan', especially in calligraphy. After all, most of the calligraphy is in Chinese characters, which already had a highly developed tradition in China.\n\nLooking at 'notan' as a special Japanese concept--a parochial American way of thinking, by the way Hrant--is misleading because the 'yin yang' metaphysics is applied everywhere in Chinese traditions, including food and medicine. The merit of the 'yin yang' concept--it gives language to describe almost any relationship--is also its weakness. It puts a label on phenomena, but it does not really describe them in the focussed, powerful, testable way that western science has done.\n\nSo if we are going to gain insight about the role of black and white shapes, and their relationship in type, we need to be more precise about what is claimed, and not throw around 'notan' as if it were a magic wand.\n\nThere is a phenomenon that a number of type designers have mentioned, and if I remember rightly it was Tobias Frere-Jones who said that he was fascinated with how when letters are well done they become 'part of the paper' rather than 'sitting on top of the paper'.\n\nThis kind of gestalt switch, where the letterforms create words that look natural and inevitable, is of course crucial in good typeface design. I doubt is well described only in terms of the relationship of the white and black. This is no doubt one extremely important variable, but so are the 'rules' by which the face is formed, and whether those rules are successfully made 'eye rules' and not just 'head rules'.\n\nPart of those rules is how the thick and thin parts of stokes are related to each other, and at which angles and orientation to vertical. These aspects of the rules are usefully described by Noordzij's 'moving front'. The question is whether rules on how the two ends of the moving front are related--as they are with the pen--is part of the effective forming of the 'gestalt'. Is it only black and white relationships, or is it black and black relationship also?\n\nPs. Tim, thanks for the quote. It seems that it refers to letters or discussions rather than--as I mistakenly thought--being a letter so the original may well be the Dutch. In which case Peter can enlighten us further on the translation.\n\n"
    },
    {
      "time": "",
      "content": "John's comment on the fluidity of white, and being indeterminate of shape outside counters is I both well observed and important to this discussion. In particular, I don't think sound the usual picture that you can space letters properly by simply how much sand will fill the interletter space. There is also very importantly, as Kindersley argued, the issue of the visual center of the letter. So here is another factor: not only rules for black, balance of white and black, but also visual centers.\n\nAlso I should note that in Chinese and Chinese-influenced art, the balances involved are not simple symetries, but very often assymetrical balances. There is both tension and balance, as John notes, and in fact having both tension as well as balance is part of the goal.\n\n"
    },
    {
      "time": "",
      "content": "John, your elaboration is welcome, and makes me think the way I re-formulated my question is somewhat muddled and that the original formulation was clearer. Perhaps it would have been better to say that the notan requirement and the proper salience requirement or _vectors_ are orthogonal. That is they impose different constraint, or pull in different directions. So design occurs in a force-field traversed by decisional vectors pulling in different directions, the one seeming to favour contrapuntal co-ordination of stroke outlines, and the other seeming to oppose it. Design occurs in a force-field traverse by countervailing pressures.\n\nPerhaps Hrant's concept of notan is properly differentiated and can accomodate tension or deliberate imbalance (so my second to last paragraph in the opening post is incorrect), but does his rejection of the relevance of assessing one's forms in swept-obect logistical terms (a moving front of points is a swept object) suggest Hrant hasn't given enough creedence to an important countervailing pressure?\n\nI love your 'under(deter)mined': underdetermined implies deterred and undermined.\n\nThe force of the pen. Try: the broadnibbed pen provides a formal or optical grammer rich (or dimensional) enough to promote well differentiate (or appropriately overdetermined) perceptual saliency maps and an effective distribution of cue value, but constrained enough not to contribute to the formal breakdown of the word image or, (to say thjis last bit differently) decay of the perceptual integrity and cohesiveness of the bounded map.\n\nThis is why it is not regressive to use the puppetry of the pen as a touchstone or reference point.\n\n"
    },
    {
      "time": "",
      "content": "\"The question is whether rules on how the two ends of the moving front are related—as they are with the pen—is part of the effective forming of the ‘gestalt’.\"\n\nYes, that is the 'notan' end of the question. The 'countervailing' end asks if they are part if the effective allocation of relative saliencies and proper cue value.\n\n"
    },
    {
      "time": "",
      "content": "\\> That is they impose different constraint, or pull in different directions. ...Design occurs in a force-field traverse by countervailing pressures.\n\nWell put, Peter. I think you also need to include another variable, though: the overall shape and weighting of the letter. How it centers visually and is able to fit with other letters is a crucial design variable. (As I noted above this is related to John's 'indeterminacy of the white'). As Tracy emphasized, type design is not a matter not only of drawing letters, and then fitting them, but of redrawing the letters so that they fit harmoniously into words. As Mario Feliciano put it to me: 'You want beautiful words, not beautiful letters.'\n\n"
    },
    {
      "time": "",
      "content": "\\>Yes, that is the ‘notan’ end of the question\n\nHuh? I would have thought that the Yin Yang question is of the relationship of the black to the counters and the inter-letter spaces. The rules for the variation in the stoke it seems to me are a different variable.\n\nSo four variables: 1. How the black stroke varies 2. Relation of the black to the white counters and inter-letter spaces. 3. How well the stokes define the salient features of the letters. 4. How well the letter combines with other letters. This last may include a number of things--overall shape, visual center, serifs.\n\nAnd all these are in tension with one another. Now I think we are getting to how complicated it really is!\n\n"
    },
    {
      "time": "",
      "content": "The _The Fleuron_ [1930] statement van Krimpen refers to (my translation): \"A typographical letter always remains an infinitely stylized handwritten letter; this doesn't alter the fact that the pen is merely an assistive device for the designer, who ought never to allow the pen to lord it over his design. Paper, parchement and the point of the pen differ greatly from the steel punch and the tools of the graver. The movement of the pen ought to remain visible in the eventual form of the leaden letter, but styled in such a way that it is only present as a hidden factor.\n\nBut note: I don't want to say the movement of the pen ought to remain visible. I want to say no more than that the optical-grammatical complexity--in terms of the distribution of saliencies and management of cue-value for role architectural particulars + role architecturally evoked form (such as counters--that the broadpen introduced (or allowed to be produced) sets a reasonable standard or benchmark, without defining a limit. We do not know that it defines a limit, on the far side of which resides decay. Perceptual processing in reading decides.\n\n"
    },
    {
      "time": "",
      "content": "Bill: yes, It is hard to disentangle. And I'm not sure I'm doing an adequate job.\n\nYou said 'huh.'  \nYes, the 'notan' vector imposes a ' light / dark balance constraint' on the relationship of the black to the counters and the inter-letter spaces. But the 'cue-value toward visual wordform resolution' vector imposes an equally valid and important 'relative salience' constraint on the shaping of the very same elements. So the 'are rules on how the two ends of the moving front are related good or bad' question must take both vectors into account. I am wondering if Hrant does.\n\nI think the answer is: to be not dogmatic about acting only on the claim that they contribute unequivocably, or conversely, on they claim that they stand in the way intrinsically. That is, to not choose one over the other, because neither pressure is the only or the most relevant pressure.\n\n"
    },
    {
      "time": "",
      "content": "William,  \n [  \nThe original Japanese word notan actually consists of two Chinese words: 'No' and 'Tan'. 'No' means degrees such as depth, darkness, thickness, concentration, strength, or density. 'Tan' has the meanings of light, faint, pale, fleeting, or transitory. Thus, notan means the degree or gradation of subtle tone, excluding pure white and pure black, by which subjective feelings are represented and fused together.](http://web.archive.org/web/20100313232932/http:/www.geijutsu.tsukuba.ac.jp/~artedu/ae_tsukuba/okazaki/001_08.html)\n\nThis suggests that the identification of notan with yin/yang and with black and white is actually a mistake, and that it instead refers to 'aesthetic awareness of tone sensibility', as seen in the sumi-e paintings.\n\n"
    },
    {
      "time": "",
      "content": "\\>notan with yin/yang and with black and white is actually a mistake\n\nNo, no, no. 'No' and 'tan' are Japanese pronounciations, not Chinese. Yin and Yang are very general concepts, including light/dark, warm/cold, male/female, etc. The Japanese concepts are almost completely derivative from the Chinese. I will run this down for you, but I would bet it is right.\n\n"
    },
    {
      "time": "",
      "content": "I'm glad to hear people talking about tension. So many people talk about 'evenness' as the ultimate goal of a type designer.\n\nThe arm of a lc 'r' is a good example of where evenness and tension need to balance. If the arm is too long, the space becomes distracting. If it becomes too short, there is no tension between itself and its neighbors. It looses its identity and can't be decoded. Finding that balance between uniformity and tension is the challenge.\n\nNote that balance does not mean the same thing as uniformity/evenness. This is where a lot of people get confused.\n\n"
    },
    {
      "time": "",
      "content": "Peter: _The force of the pen. Try: the broadnibbed pen provides a formal or optical grammer rich (or dimensional) enough to promote well differentiate (or appropriately overdetermined) perceptual saliency maps and an effective distribution of cue value, but constrained enough not to contribute to the formal breakdown of the word image or, (to say thjis last bit differently) decay of the perceptual integrity and cohesiveness of the bounded map._\n\nAdd to this my observation from the abandoned thread: the broad nib provides this rich formal and optical grammar in the context of an alphabet of shapes _originating in the use of the broad nib._ I think this is really an essential acknowledgement. It is not by chance that we have the set of abstract forms that we have for our letters, or by chance that these forms are given 'an effective distribution of cue value' when written with a broad nib -- or designed around the translation pattern of the moving front that models the broad nib --: these things are by design. We have the alphabet that we have because of the broad nib.\n\n"
    },
    {
      "time": "",
      "content": "Well, good thing I didn't bet. Yin Yang is the general concept, including in art, but light/dark does seem to be a special case of this with a separate word 'notan' in Japanese. The Book [The Yin/Yang of Painting: A Contemporary Master Reveals the Secrets of Painting Found in Ancient Chinese Philosophy](http://web.archive.org/web/20100313232932/http:/www.amazon.com/gp/product/0823059839/002-4123837-1995259?v=glance&n=283155c) is described thus: \"Through the harmonious balancing of opposites, the ancient Chinese philosophy of yin yang is beautifully applied to the art of painting. ...Part One examines the traditional elements of painting-from value (light/dark) and texture (thick/thin) to color (warm/cold) and brushwork (sharp/blurred)-as evolving from a true balance of opposites.\"\n\nSo here light/dark is one of four examples of yin yang applied to art. In the [Wikipedia article](http://web.archive.org/web/20100313232932/http:/en.wikipedia.org/wiki/Yin_yang) on yin yang, they give the Japanese pronounciation of the characters for yin yang and it is not 'notan'.\n\nSo it seems that the dark/light balance, or 'notan' is one of four traditional applications of the 'yin yang' concept traditionally applied to art and calligraphy in China. (Drawing and calligraphy were taught together, as both use the brush and calligraphy is valued as much or more than representational drawing.)\n\nJapanese evolved their own sense of light dark balance, but it is rooted in an older tradition. Furthermore, it is interesting that this is only one of four balances.\n\nAs Peter noted, the thick/thin balance, originally a result of the broad nibbed pen, is one feature in tension with dark/light, but also helps to express key features of the letters. Hence, the original philosophy was actually richer than the 'notan' concept by itself-- and actually more descriptive of letter design. The emphasis on 'notan', perhaps at the expense of the other balances was the result of the first person who introduced the concept to the West, Arthur Wesley Dow, in his book Composition (1899), which greatly emphasized it.\n\nJapanese article Peter links to is not totally clear, but the accurate point is that Dow got his concept from Japanese art. But Japanese art got it from Chinese art. The important point is that the full traditional theory of application of the 'yin yang' concept to art actually casts more light on type design than the 'notan' concept by itself.\n\n"
    },
    {
      "time": "",
      "content": "\" [...] the broad nib provides this rich formal and optical grammar in the context of an alphabet of shapes _originating in the use of the broad nib_.\"\n\nJohn: I think 'originating' might be too atrong a word here, because: doesn't the pre-history of the place-holders in our script system reached back before the broad nib? Nevertheless you are right in suggesting the broadnibbed pen played a pivotal role in consolidating the role architectures of the current canonical forms of these place holders.\n\nI'd suggest further that, in making it's contribution, 'perceptual distance,' 'categorical perception' and 'consolidation of wordform'constraints were tacitly catalytic (i.e., probably not explicitly thematized). \"Categorical perception\" has to do with 'seeing as': if the arm of the 'r' loops down too far, after a certain point it is seen as an 'n'; or if the abscence of closure in the c is not salient, after a certain point it is seen as, or becomes easily confusable in 'noisy' arrays with 'o'. So in this way readability optimization issues have always been a hidden player in the shaping of our alphabet.\n\nWhen new technologies of production take hold, these very same constraints motivate, and rightly so, new solutions, which might be better than the old. I think what Hrants dislikes is a laziness in prospecting for them. (Is it there?)\n\nBut I guess what I wanted to focus on in my comment was: what place in the galaxy of normative pressures on the design process should the 'notan' vector have, and is chirography properly assessed as intrinsically 'notantagonistic' [notan-antagonistic]. Perhaps it might be useful to distinguish different species of notan, one pertaining to cut or sculpted forms and the other to 'swept-object generated' forms and than giving to type design the task of making the transition to the first in forms generated by the products of the second. The reason to do it might be, the sculpted type of notan has a special pertinance in relation to perceptual processing in reading--a proposition which might well be defensible. This allows me to have my cake and eat Hrant's as well.\n\nBill, it was John that supplied the link.\n\n"
    },
    {
      "time": "",
      "content": "Peter: _I think ‘originating’ might be too atrong a word here, because: doesn’t the pre-history of the place-holders in our script system reached back before the broad nib?_\n\nOur uppercase letters have a monoline pre-history in Greek inscriptional letters. But by the time they assumed the classical forms and proportions of our serif'd capitals, they were being shaped with broad brushes, as demonstrated by Fr Cattich. Roman casual writing, with styli in wax, is pretty much indecipherable for non-specialists: scarcely formally related to the evolved letterforms that we think of as the Latin script:\n\n[\n ![](http://web.archive.org/web/20100313232932im_/http:/typophile.com/files/vindwaxtab.jpg)\n](http://web.archive.org/web/20100313232932/http:/vindolanda.csad.ox.ac.uk/tablets/)  \n.\n\nThe late classical quadrata formal bookhand which evolved in the early middle ages into the uncial and half-uncial styles was written with the broad nib, as were the latter.\n\nOur miniscule alphabet which is, after all, the letters that we predominantly use in text, is very much a creation of the broad nib reed and quill pen. Our modern lowercase letterforms are evolved directly from the Carolingian miniscule, formalised and standardised by Alcuin of York in the early 800s AD, representing a selection of contemporary forms, all made with the broad nib. So I think it is fair to say that our alphabet originates in the broad nib.\n\n"
    },
    {
      "time": "",
      "content": "John, I guess I was thinking of the the way dictionaries show prehistories of the majuscules that are recognizable descendant from semitic scripts with even older iconographic origins. So that is what comes to mind when I encounter the word _origins_ in relation to scripts.\n\nMany of the role-architectural particularities of the current canonical forms of especially the minuscules can be directly related to the influence of the broad-nib pen (as a result of the dialectic of speed versus articulation). So the forms have deeper origins than the peculiarities of their construction at any one time.\n\n"
    },
    {
      "time": "",
      "content": "_Many of the role-architectural particularities of the current canonical forms of especially the minuscules can be directly related to the influence of the broad-nib pen_\n\nThis is simply an inversion of my point. You are saying that the broad-nib influenced the canonical forms, and I am saying that the canonical forms were selected because they were perceived to be the best way to make letters using this tool. Since other forms are comparably easy to write, it is reasonable to presume a significant consideration of ease of _reading_ in that selection.\n\n"
    },
    {
      "time": "",
      "content": "The broad-nib was responsible for the consolidation of role-architectures for individual place-holders, which stuck (became canonical) because they had tractable ductae and contributed to the consolidation of the word as image, while having sufficient perceptual distances from eachother to support easy categorical perception.\n\n"
    },
    {
      "time": "",
      "content": "Peter, I think we're agreeing with each other, just using different language.\n\nBy the way, I find the term 'place-holders' very odd, and am not sure exactly what you mean by it, or why you selected it. Care to explain, or point me to some previous discussion?\n\n"
    },
    {
      "time": "",
      "content": "\"agreeing\"\n\nyes\n\n'place-holders'\n\nLetters occupy slots in our notational system, so they are the place holders. Our notational system is alphabetic. Other notational systems fill their slots with other kinds of symbols or marks. We call the place holders in a syllabic script syllabics, and in a hieroglypic notational system heiroglyphs. I like to use the term because it is appropriately generic and keeps in front of us the fact that the occuppiers of the slots are inherent in a system, defined as much by optical-grammatical distances from each other as by referential assignments.\n\n ![](http://web.archive.org/web/20100313232932im_/http:/typophile.com/files/%5D%5Bimg:)\n\n"
    },
    {
      "time": "",
      "content": "_I like to use the term because it keeps in front of us the fact that the occuppiers of the slots are inherent in a system, defined as much by optical-grammatical distances from each other as by referential assignments._\n\nIronically, I think that is the same reason why I don't like the term. 'Place-holder' suggests to me something generic and temporary holding a place for something specific, e.g. in the way that the generic currency symbol 'sputnik' was used as a place-holder for a specific currency symbol to be grabbed from another font. So it doesn't keep in front of me 'the fact that the occuppiers of the slots are inherent in a system', because it suggests that they are not inherent, but exchangeable. A place-holder holds a place _for something_. For what? To borrow a construction from Eric Gill, letters are things not place-holders for things.\n\nTo really keep before one the fact that the signs that are individual component of a writing system are 'defined as much by optical-grammatical distances from each other as by referential assignments', I think one needs to stress the holistic nature of writing systems, and for me at least the term place-holders undermines that. I think this is not your intent though.\n\n"
    },
    {
      "time": "",
      "content": "\"Place-holder [...] suggests [...] exchangeable\"\n\nStrictly speaking \"a\" and \"A\" are interchangeble place-holders for the \"eh\" slot in our notational system, but your 'holding a place for something (pe: which is pending)' is a common use, so I can understand your misgivings.\n\nMy 'place-holder' is a place-holder for 'slot-occupier' or your 'individual component'.\n\n"
    },
    {
      "time": "",
      "content": "What about calling them \"slottables\"? Not pretty, but I can't think of anything better.\n\n"
    },
    {
      "time": "",
      "content": "Discreet signifiers? Individuated signifiers?\n\nIs there a mathematical term meaning 'member of a set'?\n\nLet me think about this while I'm travelling for the next few days.\n\n"
    },
    {
      "time": "",
      "content": "A note on the meaning of 'notan'. I came across [this excellent site](http://web.archive.org/web/20100313232932/http:/www.touchingstone.com/Paintings.htm), which finally clarified to me the original meaning of 'notan'.\n\nThe original Chinese characters, 'nóng dàn' in Chinese or 'no-tan' in Japanese refer to how dense the ink is you use in an ink watercolor painting. The solid ink is mixed with water, and can mixed either more dense and dark (nóng) or more dilute and light (dàn). So how a painter handles 'notan' in an ink painting refers in the first place to how they handle the more and less dilute ink--the shades of grey--in the strokes themselves. But by extension the white is included in consideration of 'notan', and not just the strokes, as it is the most light or 'dilute' part of the painting. (A clear as opposed to dark sky is also described as 'dàn'. It also refers to thin or weak soup or tea.)\n\nThe site has a number of Japanese ink paintings which beautifully illustrate the sensitive handling of shades of grey and black, including sensitivity to the 'negative space' or white.\n\n"
    },
    {
      "time": "",
      "content": "\"The arm of a lc ‘r’ is a good example of where evenness and tension need to balance. If the arm is too long, the space becomes distracting. If it becomes too short, there is no tension between itself and its neighbors. It looses its identity and can’t be decoded. Finding that balance between uniformity and tension is the challenge.\"\n\nBRAVO! Well said Christian.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "William, nice research!\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "So if a dense / dilute vector is what defines notan does it have a 'range of convenience,' or applicability inside typography other than at a macrotypographical level, where contrasting densities of juxtaposed text-blocks in a layout is a factor?\n\n"
    },
    {
      "time": "",
      "content": "Peter, I think what is applicable at the 'micro' level is the 'black/white' balance or what is sometimes called the balance of 'positive' and 'negative' space.\n\nI don't know for sure whether traditionally included in 'notan' is white space when it doesn't represent an object, such as snow. It seems this is the interpretation of Dow, who first introduced notan in the west. There was certainly a very powerful tradition in Japanese painting of strongly asymmentrical paintings with dramatic use of relatively 'blank' space. This seems to be more dramatically done in Japanese painting than in Chinese, and perhaps they had their own notions about 'notan' also. Also I would be interested in whether 'positive' and 'negative' space pre-dates the introduction of 'notan' into Westsern art.\n\nAt any rate, I think one aspect of the 'notan' concept is important in type design. This is explained in [this interesting article](http://web.archive.org/web/20100313232932/http:/www.apogeephoto.com/mag1-3/mag1-3mf1.shtml) about composition in photography. Here it is pointed out that how you 'frame' a picture changes the balance of negative and positive space. And you can balance it better by good framing when you take the picture, and croping afterwards.\n\nIn type design this corresponds to the spacing, which in effect frames the letter and defines the negative space of the letter, along with the counters. This issue of framing relates to the Kindersley thread, as he was concerned about balance of the black, and its overall relationship to the white.\n\nSo yes, I think the balances of the black with itself and with the white are important factors, which relate also to rhythm and evenness of color. But I am unable at present to characterize the nature of these balances. I do want to understand it more, as I think this is in fact a key issue in type design.\n\n"
    },
    {
      "time": "",
      "content": "[http://www.kimbellart.org/database/index.cfm?detail=yes&ID=AP%201984.12](http://web.archive.org/web/20100313232932/http:/www.kimbellart.org/database/index.cfm?detail=yes&ID=AP%201984.12 \"http://www.kimbellart.org/database/index.cfm?detail=yes&ID=AP%201984.12\")\n\n"
    },
    {
      "time": "",
      "content": "[http://camdenhouse.ignisart.com/canon/fina.htm](http://web.archive.org/web/20100313232932/http:/camdenhouse.ignisart.com/canon/fina.htm \"http://camdenhouse.ignisart.com/canon/fina.htm\")\n\n"
    }
  ]
}
