{
  "id": "19252",
  "title": "A couple questions...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Thinking In Type: The Practical Philosophy Of Typography\n\nIs this book worth the purchase, I looked through it briefly at BN, seems nice, just like a recommendation.\n\nAlso:\n\nTypeface vs. Font\n\nI have a theory on this debate.\n\nI’ve come to, through my studies, speaking strictly in 21st century context, that what is referred to as a typeface is an aesthetic theory and a font is a carrier of information that references this aesthetic construct. Rationalized as: You can’t touch a typeface. And you don’t load ’typefaces’ into the ’typeface’ folder. Font is ’touchable’ via mouse, you load ’fonts’ into the ’fonts’ folder,\n\nDepending on context. I get razzed because I say ...”Load your fonts this way...” I refer in all other contexts as type, or typefaces. Is this reasonable?\n\nThx\n\n [‹ Safari vs Firefox](http://web.archive.org/web/20081007144600/http:/typophile.com/node/19451 \"Go to previous forum topic\") [Fonts in the science fair - my kid won! ›](http://web.archive.org/web/20081007144600/http:/typophile.com/node/19321 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007144600/http://typophile.com/user/6194\" title=\"View user profile.\">Eric_West</a>",
  "time": "<br>",
  "uid": "6194",
  "comments": [
    {
      "time": " 13.Apr.2006 8.36pm",
      "content": "I think you’re on the right track. I think of it like this: “Typeface” refers to the appearance of the letters—the way they look on a page when reproduced. “Font” refers to the physical carrier of the typeface—a digital file, a case of foundry type, a strip of film, etc.—which allows it to be reproduced.\n\n"
    },
    {
      "time": " 13.Apr.2006 8.45pm",
      "content": "Another way to put it: You can design a typeface, but in order to use it, you need to make a font.\n\n"
    },
    {
      "time": " 13.Apr.2006 9.34pm",
      "content": "Hi, Eric, regarding your first question, I have not read this book (although it is on my “to read” list) — but I recently read another book by that same author, Alex W. White, called _[The Elements of Graphic Design](http://web.archive.org/web/20081007144600/http:/www.amazon.com/gp/product/1581152507/qid=1144989080/sr=1-1/ref=sr_1_1/102-5315597-7931364?s=books&v=glance&n=283155)_, and discovered a well-written, well-designed work on the use of white space as it relates to page layout, type, and other elements of graphic design. So I can at least recommend the author.\n\n"
    },
    {
      "time": " 13.Apr.2006 9.49pm",
      "content": "[font](http://web.archive.org/web/20081007144600/http:/typophile.com/wiki/font) vs. [typeface](http://web.archive.org/web/20081007144600/http:/typophile.com/wiki/typeface)\n\n"
    },
    {
      "time": " 13.Apr.2006 10.24pm",
      "content": "That wiki needs some fleshing out yo.\n\n~Paul. I teased you about the Goudy book, I SWEAR it wasn’t me who won it. I would have tried though, if I couldve gotten out of class. That was a real jem.\n\n"
    },
    {
      "time": " 23.Apr.2006 8.15pm",
      "content": "One More THing,\n\nhas anybody heard of this...\n\nThe Alphabetic Labyrinth: The Letters in History and Imagination. Johanna Drucker\n\nAnd is it any good.\n\nTHx\n\n"
    },
    {
      "time": " 23.Apr.2006 8.55pm",
      "content": "Yes, that’s a really good book.  \nIf you’re into more than just Latin, it’s a must.\n\nhhp\n\n"
    }
  ]
}
