{
  "id": "19265",
  "title": "The ‘New Hellenic’ Greek zeta and xi",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Dear typophiles,\n\nMonotype issued a digital version of the ‘New Hellenic’ Greek type in the early 1990s.  \nUnfortunately Victor Scholderer’s authentic lowercase zeta and uppercase xi were  \nsubstituted with somewhat blander designs.  \nDoes anyone know what might have been the excuse for this kind of tampering?  \nIt seems to me that the original glyphs would be worth digitizing.\n\nSincerely,  \nP. L.\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/Xi_zeta.jpg)\n\n",
  "author": "<a href=\"/web/20111022025454/http://typophile.com/user/12482\" title=\"View user profile.\">Hyperboreus</a>",
  "time": "<br>",
  "uid": "12482",
  "comments": [
    {
      "time": "",
      "content": "_the excuse for this kind of tampering_\n\nBy the same token, one could lament the \"travesty\" of replacing the long \"s\" in the designs of Caslon, Garamond, Jenson, etc., with the orthodox, later alphabetic form.\n\nThe evolution of the character could also be compared to that of the Cyrillic De, going from triangular to trapezoid.\n\nAs an \"early learning\" face, there is an argument for orthodoxy/simplicity -- just compare to Gill Sans Schoolbook, with its single-storey \"a\" and \"g\".\n\nBut now, there is no reason not to provide \"Historical\" alternates -- and I understand that this is a feature of OpenType that will soon be supported by Microsoft Word.\n\nOn a related topic, I'm planning to add Greek to Fontesque, which is kind of a challenge, in that your typical Greek serif face already has plenty of irregularity -- so character forms such as Scholderer's that you show here are quite inspirational in pushing things even further.\n\n"
    },
    {
      "time": "",
      "content": "_Unfortunately Victor Scholderer’s authentic lowercase zeta and uppercase xi were substituted with somewhat blander designs._\n\nScholderer's forms are eccentric, so I can quite understand why Monotype chose to employ something more in keeping with the normative form of the Greek letters (although I think the lowercase zeta has a bit too much modulation and the top is very weak, out of keeping with the rest of the design). Scholderer's original design also had an eccentric uppercase Omega based on an enlarged version of the lowercase form. I have little doubt that the more normal/bland replacement forms make the digital version more successful in the Greek market. Note also that Monotype are not alone: the Greek Font Society also replaced the lowercase zeta and uppercase Omega forms in their Neohellenic type, although they kept the zigzag Ksi.\n\nI would like to see Scholderer's more eccentric forms made available, as stylistic alternates, in OpenType fonts. One wouldn't necessarily want them as default forms, but they would be good to have nonetheless.\n\n"
    },
    {
      "time": "",
      "content": "\\> excuse for this kind of tampering?\n\nThe \"tampering\" was actually done by Scholderer! It was exactly <cite>inauthentic</cite> in terms of what counts more than a designer's whim: the needs of the Greek script and its users. Those original forms -especially the UC- are heavily Latinized. Van Krimpen can be said to have been the \"best\" at this kind of travesty (although Gill's semitic fiascos are certainly notable). Please read my article entitled \"Latinization: Prevention and Cure\" in issue #4 of Spatium magazine (now sold out however) or the current issue of Hyphen. Also, here's a link for your perusal:  \n [http://www.themicrofoundry.com/ss\\_rome3.html](http://web.archive.org/web/20111022025454/http:/www.themicrofoundry.com/ss_rome3.html \"http://www.themicrofoundry.com/ss\\_rome3.html\")\n\n--\n\nBTW, that Heraclitus quote on your Profile page,  \nis it the \"war is the father of all things\" one?  \nBecause that one's my favorite (when you sub in  \nthe more accurate \"conflict\" instead of \"war\").\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant, while some of Scholderer's forms are eccentric, I certainly wouldn't classify them as Latinised, in the way that Van Krimpen's Greeks or Gill's Perpetua Greek are. Scholderer was a codicologist, historian of early printing, and curator of the incunabula collection of the British Library, with a solid historical knowledge of Greek letterforms. Van Krimpen and Gill were complete dilettantes by comparison. The New Hellenic type is the most serious and successful modern attempt to create a new design in the style of the pre-Aldine Greek types such as the Greek of the famous Complutensian Bible. Other, more direct attempts at revivals of the Complutensian type have been made (Procter's Otter Greek in the 19th century, and recently [GFS Complutensian](http://web.archive.org/web/20111022025454/http:/www.greekfontsociety.org/pages/en_publications2004_SP.html) by George Matthiopoulos), but these replicate the unusual characteristics of the original that are, in a modern context, even more eccentric than Scholderer's Ksi, Omega and zeta. None of it is Latinised.\n\n"
    },
    {
      "time": "",
      "content": "Especially with regard to the person that counts (the layman reader, who has no idea of what's historically valid and what's not) Latinization doesn't have to be literal: all it has to do is impose an alien (practically, if not historically, speaking) skew on a script, and one that comes from Latin (in letter or spirit). In this case the uppercase form is structurally identical to the JvK lowercase xi that we both deride; while the lowercase form is essentially a simplification, specifically in the spirit of Latin. So to me these <cite>results</cite> (if not their lineage) fall under Latinization.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_In this case the uppercase form is structurally identical to the JvK lowercase xi that we both deride_\n\nNot really, the JvK ksi is simply the normal lowercase letterform compressed down to the x-height, and hence proportionally squarer. The uppercase zigzag form is a different oddity. It is eccentric, but I believe it exists in the tradition that Scholderer was reviving. I'll need to dig out more of my books before I can confirm that with examples. [I'll mention this thread to Gerry Leonidas, in case he can contribute some thoughts on the zigzag Ksi.]\n\n_while the lowercase form is essentially a simplification, specifically in the spirit of Latin._\n\nYou can't just look at a thing, relate it to some other thing that you think you understand, and pronounce a judgement, especially not a judgement about it's spirit. That is a very dodgy analogic process.\n\nScholderer's New Hellenic is a close revival of letterforms that appear in an edition of Macrobius printed in 1492, probably by Giovanni Rosso in Venice. Now we might look at it as you seem to be, and _mistakenly_ view it in the context of very much later Latin types such as 19th and 20th century sans serifs with their simplification of form. But that is completely ahistorical. If you look at these Greek types of the pre-Aldine model in their original context, beside Italian incunabula Latin types, you see the radical difference and their distinctly _un_Latin character. Then you have to look for their origin, and you find it in the formal Greek bookhand of the Middle Ages. I have not unpacked all my Greek books yet, but below is the best example that I could find in the books I have on hand. [Unfortunately, I can't figure out which box contains my copy of Scholderer's own _Greek Printing Types,_ which I believe includes a collotype facsimile of the 1492 Macrobius type.]\n\nAt the advent of printing in Greek, the script had evolved, from the uncial writing of the late classical period, a formal and a cursive hand. In this it was no different from the Latin script or the Hebrew script. These were all mature writing systems with strong literary traditions, a professional scribal class, and extensive manuscript book publishing. The two script styles are understandable in terms of speed, as I have written elsewhere on Typophile in discussion of the origins of the roman/italic distinction. The formal book hand is written slowly, the letters are upright and have broad proportions. The cursive hand is written quickly, the letters are slanted and compressed; the slant and the compression are both aspects of the speed. As with Latin and Hebrew, the formal hand tended to be reserved for larger scale and prestige volumes; the cursive style was used in the manuscript equivalent of pocket books. [Again this is exactly the same distinction that exists in Latin books of the same period, and as Aldus adopted the cursive, italic style for his popular small format Latin and Italian books, so he adopted the Greek cursive style for comparable volumes in that language. Many commentators on Aldus' type and books completely overlook the manuscript publishing context, and make ludicrous claims about Aldus' invention of the small format book and the use of italic types for space-saving efficiency. This is all nonsense: he was producing books to an existing popular format and using types modelled on the cursive hands employed in those books.]\n\nAnyway, getting back to the Greek formal book hand...\n\nHere is an earlier (10th century) example showing the upright, broadly proportioned letters of this style, which pre-Aldine printers adopted and to which Robert Proctor returned not very succesfully in the 19th century, and which Scholderer revived with much more success in the 1920s.\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/FormGrekBkHnd.jpg)\n\n-  \nThe simplification that is found in the early printed versions of this hand, such as the Macrobius or Complutensian types, is in the abandonment of the connecting strokes. But the broadly proportioned, largely monoline letters can be directly traced back to such manuscripts and forward to Scholderer's New Hellenic. This is where it comes from: from the heart of Byzantine literary culture of the Middle Ages, transplanted to Italy after the fall of Constantinople, and cut into types and printed there (with the direct involvement of Greek immigrants, as superbly documented in Konstantinos Staikos' excellent _Charta of Greek Printing._)\n\nBy the way, the GFS commentary on their Neohellenic fonts confirms the origin of the 'bland' Ksi and Omega about which Petri began this discussion: 'The type, since to 1930’s, was also well received in Greece, albeit with a different design for Ξ and Ω.' As I suspected, Monotype changed the form of these letters to market the typeface more successfully in Greece.\n\n"
    },
    {
      "time": "",
      "content": "_Especially with regard to the person that counts (the layman reader, who has no idea of what’s historically valid and what’s not) Latinization doesn’t have to be literal_\n\nThe layman reader doesn't know whether a typeface is simplified (relative to what?), Latinised or within a distinct cultural tradition, novel or revival. His opinion about whether he finds something easy or difficult to read is important, but in what other regard does that person 'count'? Should valid and authentic cultural forms be discarded or avoided because an uninformed person might not recognise them as such? That can only lead to homogenisation and loss of diversity within a culture.\n\nReally, I think this is madness. What is the point of taking the time to educate ourselves, if we abdicate that knowledge when making judgements, preferring to adopt the imagined knowledge level of some ignorant everyman? To call Scholderer's New Hellenic type Latinised is simply to be ignorant of its origins. To suggest that you are using Latinised in some non-literal, presumably metaphorical sense, not only does nothing to counter that ignorance, it also weakens the whole notion of Latinisation. Latinisation is a very specific and observable phenomenon afflicting a wide range of writing systems, alongside a phenomenon of westernisation afflicting cultural diversity in general. It need to be accurately described so that it can be effectively countered. There are plenty of examples of literal Latinisation of the Greek script to criticise without charging the New Hellenic type with some kind of non-literal Latinisation. Take the time to understand the thing itself, and don't make hasty analogic judgements.\n\n"
    },
    {
      "time": "",
      "content": "The two original ones are very beautiful. They should have used them. Personally, I'm a bit of an instigator and would have liked to have them available just to be different.\n\nJohn Hudson: Firstly, thank you for your very comprehensive explanation of the origins of these glyphs, which I found [i]extremely[/i] interesting.\n\nSecondly, thank you for showing that not all originality in letter design is \"latinisation\". Sometimes even users of non-Latin alphabets do something different.\n\n"
    },
    {
      "time": "",
      "content": "Certainly, external beauty and novelty for its own sake are more important than respecting the people whose script you're working with... :-/ As if one Nick Shinn weren't enough. Hey, maybe it's a Canadian thing? You are, after all, exceptionally good at being assimilated by a larger culture while pretending the opposite (at least collectively - exceptions do exist, and are commendable). Really, your license plates should say: \"Canada - The Hockey State\". I'm sorry if that hurts your feelings, but as we say in Armenian, \"let's sit crooked but talk straight\".\n\nBTW, I haven't read John's posts yet. If they're like his usual contributions, they contain a ratio of about 2:1 of valid points versus contrivances - which is admittedly above average. Anyway, I'll catch up for real soon.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_let’s sit crooked but talk..._\n\n... in inflamatory nationalistic generalizations?\n\n\\*\\*\\*\n\nJohn, that's a brilliant piece of writing. I love the varied angles of the long joining strokes, especially those horizontals that zip right through theta.\n\n"
    },
    {
      "time": "",
      "content": "\\> … in inflamatory nationalistic generalizations?\n\nExactly. Just what you need to snap out  \nof your materalism-driven auctioning of  \nyour cultural heritage.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "First, a clarification on the Canadian thing: basically what I was saying is that you'd have to be quite an exceptional Canadian (like maybe a prominent Black Bloc member) to be able to instruct people how to successfully maintain one's cultural identity.\\* It's like a Dutchman lecturing a Portuguese or Côte d'Azurian about butifarra negra. He'd have trouble simply knowing what that is.\n\n\\* I mean, if it weren't for the Inuit...\n\n--\n\n\\> the JvK ksi is simply the normal lowercase  \n\\> letterform compressed down to the x-height\n\nNo. The lowercase xi in question (the one in Romulus, obviously - the one in Antigone is pretty conventional\\*) is a full ascending letter.\\*\\* It looks just like Scholderer's capital form, except it's narrower (and has a shorter middle bar). See figure 27 on page 18 of \"Greek Letters: From Tablets to Pixels\"; or see \"Letters of Credit\". Is there a historic precedent for that lowercase form? (Although I will shortly explain why that's largely moot anyway.)\n\n\\* And also not compressed to the x-height.\n\n\\*\\* In fact it's higher than the caps!\n\n\\> You can’t just look at a thing, relate it to some other thing that  \n\\> you think you understand, and pronounce a judgement, especially not  \n\\> a judgement about it’s spirit. That is a very dodgy analogic process.\n\nWhat in blazes are you talking about? I see things, I form opinions, and I present them. Of course I could be wrong, but that should go without saying. What's dodgy is your definition of latinization. As is your persistent valuation of history over reality. You always make that mistake - probably because you simply enjoy history too much. John, we're not historians, we're designers. It's great that you enjoy history, and that you know so much of it, but don't let it cloud your craft. To me, the important, the useful definition of something is always in the practical sphere. In the context of historical precedent Scholderer's design might be totally, or at least sufficiently, authentic; but in the context of the user, of what the user knows, of what the user has seen and will continue to see, it is clearly latinization.\n\nYou can't base good design decisions more on history than the reality on the ground. Would you set a history of the Holocaust in a blackletter? And if you did, what publisher would go for it? The historic fact is that the Nazis disowned blackletter (for whatever stupid reason). But that's largely moot. Sure, we can try to rectify things (as I do with blackletter) but it's at the fringes of craft - it's not going to please any paying client on the planet; and most of all there's no use putting a spin on terminology to hide the sad truth.\n\n\\> The layman reader doesn’t know whether a typeface is simplified  \n\\> (relative to what?), Latinised or within a distinct cultural  \n\\> tradition, novel or revival.\n\nBut he <cite>feels</cite> it, just fine.  \nThat's fully half of type design right there.\n\n\\> What is the point of taking the time to educate ourselves\n\nEducation is great, but choose what you educate yourself with  \nmore carefully I guess. :-/ Maybe you allocate too much time  \nto learning history? But you clearly enjoy it, and humans  \nhave to enjoy their lives. Just don't bet your career on it.\n\n\\> Should valid and authentic cultural forms be discarded or avoided  \n\\> because an uninformed person might not recognise them as such?\n\nDiscard, never. But use with caution. Call things what they are, in a useful realm (not insular history). Who was it that wrote: \"I would like to see Scholderer’s more eccentric forms made available, as stylistic alternates, in OpenType fonts. One wouldn’t necessarily want them as default forms, but they would be good to have nonetheless.\" With that I agree completely! Especially if there's a caution against latinization in the readme. :-)\n\nAlso, of course I'm not talking about catering to the ignorance of some isolated individuals. I'm talking about judiciously taking into account the perceptions of the crushing masses.\n\n\\> Latinisation is a very specific and observable phenomenon\n\nYou don't get to decide what it means. Your definition is empoverished; in its inability to address the really relevant aspects of latinization (like certain types of simplification) it is a crippled definition.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_To me, the important, the useful definition of something is always in the practical sphere. In the context of historical precedent Scholderer’s design might be totally, or at least sufficiently, authentic; but in the context of the user, of what the user knows, of what the user has seen and will continue to see, it is clearly latinization._\n\nIn the first place, I simply don't believe that anyone except you looks at Scholderer's New Hellenic type that way. Given the massive amount of actual Latinisation of the Greek script evident all over Greece on every street, Scholderer's New Hellenic looks anything but Latinised in comparison. I have heard people mistakenly identify it as being based on early Attic inscriptional lettering. If anything, it probably looks kind of old fashioned to a modern Greek reader. In the second place, you are the only person I have ever heard try to impose a metaphorical meaning on the term Latinisation, and I'm afraid you don't get to decide what it means either.\n\nWhat _is_ a 'non-literal' meaning of Latinisation? If you mean simplification, or 'certain kinds of simplification', then say simplification, because you can't equate Latinisation with simplification because Latinisation can, and often does, involve formal complication e.g. through the application of serifs or the imposition of a broad-nib translation ductus to historically monolinear forms. It seems to me, based on previous discussions, that you probably want to form an equivalance of modernism = westernisation = simplification = latinisation. Sorry, but I think _that_ is itself a gross simplification, and I simply refuse to use the term in that way.\n\nThis is what I mean by Latinisation: the application of characteristics of Latin typographic design to other scripts. It is a real problem, and I don't see any benefit to muddying and weakening the identification of that problem through invention of non-literal meanings.\n\nYes, I am interested in history, because I am interested in trying to discern what is true, rather than relying on perceptions born of ignorance and analogy. I have explained why Scholderer's New Hellenic is the way it is, and the role of the history of Greek manuscript and early printed forms in its development. I don't see any value in supposing a general perception of the design as Latinised, when actual Latinisation of the Greek script is so blatant and unmistakeable and clearly of a different class from anything in Scholderer's design.\n\n"
    },
    {
      "time": "",
      "content": "Re. van Krimpen's Greeks. We got confused in there about, talking about the lowercase ksi, when I meant the lowercase zeta (following from discussion of the the eccentric lowercase letter in New Hellenic). It is the lowercase zeta in [Antigone](http://web.archive.org/web/20111022025454/http:/home.planet.nl/~johnf/antigone.jpg) that is compressed to the x-height. The bowls of the ksi are also compressed vertically, albeit not as much, and are out of proportion to the beta and theta.\n\nI have not looked at the Romulus Greek for a long time, but I am quite willing to believe the ksi is as awful as you describe.\n\n"
    },
    {
      "time": "",
      "content": "There is a brief type review concerning the ‘New Hellenic’ in the sixth volume of ‘The Fleuron’ (p. 231). The fount receives high praise from the critic who in the end of the article maintains: “It remains to be said, however, that our general printing still has need of a greek which shall sort agreeably with the romans and italics we are bound to use. We require an upright Caslonised fount which, in use as citations or extract matter, shall be no more conspicuous in the page than is the italic.”  \nI suppose one could safely interpret ‘Caslonised’ as ‘Latinised’...\n\n\\* \\* \\*\n\nRobert Proctor’s ceremonial ‘Otter’ (1903) has the zigzag uppercase xi as well as the hanging lowercase zeta. Mr Scholderer was reportedly an admirer of ‘Otter’ and the fount must have been an important precursor of the ‘New Hellenic’.\n\n\\* \\* \\*\n\nHrant: The Heraclitus quote on my profile page can be translated as follows: “The hidden attunement is better than the obvious one.”\n\n"
    },
    {
      "time": "",
      "content": "\\> Scholderer’s New Hellenic looks anything but Latinised in comparison.\n\nFirst of all, I've been talking about a single letter (or two).  \nThe stuff Monotype had the sense to change. But anyway,  \nI never said the font as a whole was a flagship of latinization.\n\n\\> I have heard people mistakenly identify it as being  \n\\> based on early Attic inscriptional lettering.\n\nWhat kind of <cite>people</cite>, exactly?\n\n\\> you are the only person I have ever heard try to  \n\\> impose a metaphorical meaning on the term Latinisation\n\nMetaphorical? It's nothing that fancy. I'm simply talking about things just beyond the literal, such as making Hangul \"in-line\" (decomposing the syllables and putting the alphabetic component letters in sequential order on the baseline), which is not a glyph-level instance of latinization, but certainly a massively significant case of it (file it under \"alphabet envy\" :-). A more mainstream example is the increase in x-height in Armenian, Georgian, etc. While you can't put your finger on specific shapes that have become latinized (unlike something like the imposition of full double serifs to Greek, the sort of thing you seem to want to restrict the definition of latinization too) the vertical proportions certain have become latinized, in fact quite consciously (and this is a sledgehammer blow to readability, so quite significant).\n\n\\> I am interested in trying to discern what is true\n\nWell, to me the present is truer than the past.\n\nRomulus Greek: now THAT was a flagship, in the imperial navy! :-/\n\nBTW, a good example of how historicism for its own sake can be used to give false assurance (when it's not being used simply to confuse) is something about Win Crouwel in \"Dutch Type\". Concerning his famous alphabet, Middendorp quotes him as saying: \"So I began researching the past, looking for alternative signs with which I could replace the conventional forms. One could have made them up, but I wanted them to have some kind of footing in the history of type.\"\\* Why is it false assurance? Because the result is <cite>still</cite> illegible! :-/\n\n\\* Although in the next paragraph he's quoted as saying about his alphabet: \"I think I have always inclined not to bother too much about things that have been developed through tradition\". WhatEVER.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_able to instruct people how to successfully maintain one’s cultural identity._\n\nYour agenda, not mine. Get rid of that chip on your shoulder, stop carrying around that enormous cross on your back. Create a new identity, there's too much \"biology/culture as destiny\" in the old one. And aren't you moving in that direction with Nour/Patria anyway -- morphing the old into the new, blending cultures, giving typographers the tools they need to conserve or abuse \"authenticity\" as they see fit?\n\nThe real danger for non-Latin scripts is that they lose their alphabetic diversity in the Linotype (that was then) Microsoft (this is now) scheme of things, restricting the local typographer's means of expression. The issue of whether a particular alphabetic form is authentic is absurd, like arguing whose blood lines are purer. More to the point, does it read smoothly in text?\n\n"
    },
    {
      "time": "",
      "content": "Easy to say when you're a citizen of the dominant majority (and  \nthe one that's bombing things left and right). Covert chauvinism.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Petri, that \"Caslonize\" bit (especially the \"than an italic\" part,  \nconsidering Morison's thoughts on italics) is just too much! :-)  \nIt's going in my Latinization file forthwith!\n\nBTW, Morison was a grade-A script chauvinist. Usually  \nhe hid it OK, but for example in his intro to Schonfield's  \nbook he really let'errrip!\n\nThe Heraclitus quote is not only superb, but it's highly  \nfitting to this discussion (as well as my penchant for  \npointing out that -in a <cite>text</cite> face, NICK- true harmony  \nisn't skin deep. Question: can \"harmony\" be substituted  \nfor \"attunement\"? For one thing I do read something like  \n\"armonie\" in the Greek.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_Easy to say when you’re a citizen of the dominant majority (and the one that’s bombing things left and right)._\n\nIt's your country that's doing the bombing, not mine.  \nBut reasonable people hold that against every US citizen.\n\n_“The hidden attunement is better than the obvious one.”_\n\nPerhaps, but I get the impression from this thread that the obvious functionality of Scholderer's novel glyphs -- i.e. how they combine with the rest of the alphabet -- is of no relevance at all, compared with the opportunity to argue over cultural pedigree, and your need to impress with what a champion of the oppressed you are.\n\n"
    },
    {
      "time": "",
      "content": "_What kind of people, exactly?_\n\nPeople who know a little bit about the history of the Greek script, and who have seen the simplicity of the Attic inscriptional letters, but are unfamiliar with the formal Byzantine hand or its early typographic children. So the inscriptions are their only point of reference for monoline Greek letters. They see the Scholderer uppercase, and relate it to the nearest thing they are familiar with. See, for instance [here](http://web.archive.org/web/20111022025454/http:/groups.msn.com/FontLab/general.msnw?action=get_message&mview=0&ID_Message=1940&LastModified=4675417912948186861).\n\n"
    },
    {
      "time": "",
      "content": "_Perhaps, but I get the impression from this thread that the obvious functionality of Scholderer’s novel glyphs_\n\nThey are not novel, only eccentric in the context of typical Greek letterforms. As Petri notes, Proctor's Otter type has the zigzag Ksi, and my suspicion is that this form shows up in the early types by which both Proctor and Scholderer were inspired. But I won't be able to confirm that until I get the rest of my books unpacked.\n\n"
    },
    {
      "time": "",
      "content": "John: Novel, eccentric in context, whatever, I'm talking about the two glyphs that are the subject of this thread.\n\nI haven't seen a text setting with these problem characters (which would be useful), but I suspect that the zeta would work fine, while the Xi would be nasty, with its extreme angularity, monoline stems, and many sharp joints. That's just bad type design, especially in a face that has a light, open quality in general.\n\nI'd guess that Sholderer, despite his knowledge of Greek, was uncomfortable with Xi as three disconnected horizontal bars just levitating, which is why he sought a precedent for a more grounded form. Is that a Latinization instinct, to want to ground and regularize shapes? Or is it just moderization? Or is it just him? At any rate, as Gerry Leonidas said in the MSN thread, we should take the work at face value, not \"authenticity value\", if the designer is making a serious, considered attempt to create a new face.\n\n"
    },
    {
      "time": "",
      "content": "Nick, I don't vote. If I'm not mistaken, you do, and that  \nmakes you part of the problem (no matter who you vote for).\n\n\\> the obvious functionality of Scholderer’s novel glyphs\n\nAlways creating fake waves in your kiddie pool...\n\n\\> People who know a little bit about the history of the Greek script\n\nJust as I thought.  \nErgo: not the people we mostly need to worry about (as designers).\n\n\\> They are not novel\n\nYou see what I mean? If Nick, a typeface designer AND somebody  \ndirectly exposed to your arguments, doesn't grasp that these  \nforms are in fact historic, what hope is there really?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_Nick, I don’t vote._\n\nYou're a white American male nonetheless, living the good life in the golden state. Man, that must eat you up.\n\n_Nick, a typeface designer AND somebody directly exposed to your arguments, doesn’t grasp that these forms are in fact historic, what hope is there really?_\n\nPretending to misunderstand my use of the word 'novel' isn't going to fool anybody.\n\n"
    },
    {
      "time": "",
      "content": "I did some digging in the boxes, and although I have not located my copy of Scholderer's _Greek Printing Types_ I did find my copy of Robert Proctor's _The Printing of Greek in the 15th Century,_ the study that inspired both Proctor's own Otter type and Scholderer's New Hellenic. The zigzag uppercase Ξ is hard to trace because it is a relatively uncommon letter (which reminds me that I've been meaning to compile some letter frequency data for Greek). Also, many Greek texts of the period were printed largely without uppercase letters. But below are some images that display the early printed forms of Ξ ζ ξ and other letters that have taken variant forms.\n\nFirst, though, what is probably the first instance of obvious Latinisation in the history of Greek type. Note the p-like rho.\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/GR1.jpg)\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/GR2.jpg)\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/GR3.jpg)\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/GR4.jpg)\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/GR5.jpg)\n  \nAbove, note hilarious composition error in last work of first line: upsidedown mu as pi and upsidedown pi as mu. Classic!\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/GR6.jpg)\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/GR7.jpg)\n  \nAbove, deeply weird typeface. The earliest use of zigzag form of (lowercase) ksi I have been able to locate so far.\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/GR8.jpg)\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/GR9.jpg)\n\n.\n\nAnd finally Proctor's Otter type, in which these historical forms first find modern expression (1903, cut by Miller & Richard):\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/GR10.jpg)\n\nScholderer maintained a few of the oddities of the Otter type, but replaced most of them with more 'normal' Greek letters. Monotype carried this process further when manufacturing the New Hellenic design for the Greek market.\n\n"
    },
    {
      "time": "",
      "content": "For what it's worth, the zig-zag Xi and cursive Omega are, along with lunate Sigma, the standard shapes in later ancient inscriptions (from about the second or first century BC until the making of inscriptions pretty much died out around the end of the sixth century AD). These shapes might appear odd to a modern Greek, who would be accustomed to the earlier letter forms, but perhaps Scholderer thought they fit better with the Byzantine lower-case.\n\n"
    },
    {
      "time": "",
      "content": "Nick:  \nI'm about as American in ways that count as you are  \na text face designer. In ways that count. What eats  \nme is people selling their culture for consumables.\n\nAs for pretending, if you ever manage to stop pretending that  \nyou're civilized maybe you can have a meaningful discussion  \nwith John. As usual, it takes a private investigator to figure  \nout that you're disagreeing with him.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> I’ve been meaning to compile some letter frequency data for Greek\n\nThere's a university in Greece (I can track down full details) that's  \ndone that. Klimis once directed me to them, so you can always ask him.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Thank, I'll do that. I have a pretty large corpus of classical and koine changes.texts, but very little modern Greek. One of the things I would be interested to see is what kind of variation in frequency occurs as a result of the linguistic and orthographical distinctions.\n\n"
    },
    {
      "time": "",
      "content": "_“It remains to be said, however, that our general printing still has need of a greek which shall sort agreeably with the romans and italics we are bound to use. We require an upright Caslonised fount which, in use as citations or extract matter, shall be no more conspicuous in the page than is the italic.”_\n\nThanks for that quote, Petri. There's an idea for an upcoming Typophile Type Battle: design a Caslonised Greek.\n\n"
    },
    {
      "time": "",
      "content": "OK, I just did some digging in emails from about 3 years ago: although Klimis did provide good insights and info, it was actually Yannis Haralambous who pointed me to the following language institute: [http://www.ilsp.gr/](http://web.archive.org/web/20111022025454/http:/www.ilsp.gr/ \"http://www.ilsp.gr/\")\n\nFrom there I got an analysis of the Hellenic National Corpus, described here:  \n [http://hnc.ilsp.gr/en/](http://web.archive.org/web/20111022025454/http:/hnc.ilsp.gr/en/ \"http://hnc.ilsp.gr/en/\")\n\nHere's a screen grab of the spreadsheet they sent me:\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/Greek_frq.gif)\n\nIf you manage to acquire any digraph data from them, please let me know.\n\n\\> design a Caslonised Greek.\n\nEasy. Exhume Schonfield, revive his corpse, and  \nsend him on an extended holiday in the Sporades.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_I’m about as American in ways that count as you are a text face designer_\n\nAgreed.\n\n\\*\\*\\*\n\nYannis Haralambous shows an interesting form of beta in his example of New Hellenic (Keeping Greek Typography Alive, Thessaloniki, 2002). I haven't seen this \"separated-loops\" form in any Monotype specimens, metal or digital. What's the story -- was it an alternate sort, or perhaps a letterform that Haralambous uses to match the similar form in Monotype Didot (Series 90)?\n\nHow popular was this form of beta, and what accounts for its demise?\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/betaNS.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I've only seen this variant beta for New Hellenic in Yannis' version. I think the top loop is too small.\n\nFor most of the history of Greek typography, both forms of beta are used side-by-side. Here are Granjon's, as shown in the Egenolff-Berner brevier specimen:\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/granbeta.jpg)\n  \n.\n\nSome printers seem to have employed a rule that what we think of as the normal form should be used at the beginning of words, and the double-loop variant in mid-word, but for the most part I've seen them used interchangeably, presumably at the discretion of the compositor. The variant forms of theta and psi are also used interchangeably.\n\nMost of this typographic history is, of course, in the Byzantine cursive style popularised by Aldus. So in addition to these variant letter there was a lot of variation of form provided by ligatures.\n\nWhen the variant beta appears in more recent fonts, it may have a slightly different form, in which the two loops meet. These are the forms in the MS ClearType collection fonts.\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/msctbeta.gif)\n  \n.\n\nAlthough I followed this form in Constantia (second from right) because it worked with the Latinate ductus, I prefer the separate loop form, which certainly works better with the traditional Byzantine ductus.\n\n"
    },
    {
      "time": "",
      "content": "PS. Note that the double-loop beta has a separate codepoint in Unicode, because it is sometimes used as a maths symbol with a distinct meaning.\n\n"
    },
    {
      "time": "",
      "content": "\\> your need to impress with what a champion of the oppressed you are.\n\nNot a champion, but a victim: [http://www.armenian-genocide.org/](http://web.archive.org/web/20111022025454/http:/www.armenian-genocide.org/ \"http://www.armenian-genocide.org/\") \\_  \nI wouldn't be in a foreign land, fighting cultural assimilation, were  \nmy grandparents' families not slaughtered and driven from their  \nancestral land, a land we called home for almost three millennia.  \nI don't know whether to envy you, or pity you, for never being  \nable to really understand how it feels.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_for never being able to really understand how it feels_\n\nRight, your exile is so much more sincere than mine.  \nI'm just expat lite.\n\n\\*\\*\\*\n\n_Some printers seem to have employed a rule that what we think of as the normal form should be used at the beginning of words, and the double-loop variant in mid-word_\n\nThat makes sense for the colour and flow of text, because the normal beta has such a long vertical stem -- both ascender and descender -- that it really interrupts words. Traditionally, the baroque (to use Bringhurst's terminology) stress of Greek in faces like Didot (Apla) lessened the effect, but nowadays many Greek fonts have consistent vertical stress, especially sans, which can't be the best situation for characters like beta, phi, and psi (although they are fortunately infrequent).\n\nJohn, would it be appropriate to make a double-loop beta as the dafault?\n\n"
    },
    {
      "time": "",
      "content": "\\> I’m just expat lite.\n\nNick, you're honestly comparing your case to the fallout of genocide? How many among your mother's and father's families were raped, murdered and driven off their land? And let's see you compare yourself to the children of Holocaust survivors - I dare you.\n\nHave some decency.\n\n\\> the normal beta has such a long vertical stem — both ascender and descender — that it really interrupts words.\n\n?  \nA bunch of Greek letters have comparable vertical span.  \nNot that immersive reading works like that anyway.\n\n\\> nowadays many Greek fonts have consistent vertical stress\n\nI wonder why...  \nMust be the same reason weathermen have names like Dallas Raines.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_Nick, you’re honestly comparing your case to the fallout of genocide?_\n\nI'm suggesting your drama queen of victimhood act is getting tedious.\n\n"
    },
    {
      "time": "",
      "content": "Disgusting.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant, Nick, do you want to take that elsewhere? I'd really like to talk about Greek letters.\n\n_John, would it be appropriate to make a double-loop beta as the default?_\n\nNo, I don't think so. The typical β is very much the normative shape today, and even in renaissance type specimens and grammars I have looked at it is always listed before the double-loop variant.\n\n"
    },
    {
      "time": "",
      "content": "_The typical β is very much the normative shape today,_\n\nI agree with you that Haralambous' New Hellenic beta is not quite right, but in general I'm taken with his advocacy of the double-loop form. And as an alternate of bona fide status in a number of typefaces (unlike Scholderer's oddities), surely it would be acceptable as default in a new design -- as a signature glyph. Also, as CT is promoting the double-loop form to default status in its slanteds, where the vast majority of characters have the same form as the upright, wouldn't this also indicate that the double-loop form has something of a cachet?\n\n"
    },
    {
      "time": "",
      "content": "\\> surely it would be acceptable as default in a new design\n\nIn a trendy display font, possibly.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "In my mother's handwriting, her zeta looks very much like John's second beta a few post above. Since zeta is part of my last name, it could be that so much repetitive writing of it has evolved the zeta into something else.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "_trendy display font_\n\nAlongside your open-tailed \"g\", no doubt.\n\nBut seriously, what do you make of Haralambous' preference for the double-bowl beta? -- he is after all a traditionalist concerned with text face.\n\n"
    },
    {
      "time": "",
      "content": "\\> her zeta\n\nAnd if that form also happens to be that of enough others, then that's certainly a good reason to avoid using it for the beta. In fact it's an axiom of alphabet evolution\\* that handwriting tends to converge forms (and sometimes you need a drastic, conscious adjustment, like the case with the crossed 7 in some cultures).\n\n\\* See \"Canons of Alphabetic Change\" in \"The Alphabet and the Brain\".\n\n\\> Alongside your open-tailed “g”\n\nCertainly B&R#1/Oxford/Monticello, the face used to set Updike's \"Printing Types\", and one that he (a hard-core traditionalist) thought very highly of, is a social butterfly of a font, isn't it!\n\n\\> he is after all a traditionalist\n\n?  \nHave you seen his work in Arabic?!\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_a social butterfly of a font, isn’t it!_\n\nNot really. There are several kinds of open-tailed g, and that, which is little more than a missing hairline, barely ranks.\n\n_Have you seen his work in Arabic?!_\n\nCute. But we're talking about Greek type...?\n\n"
    },
    {
      "time": "",
      "content": "_surely it would be acceptable as default in a new design — as a signature glyph._\n\nSure, with the caveat that a 'signature glyph' may be the reason someone chooses not to use a particular typeface.\n\n_Also, as CT is promoting the double-loop form to default status in its slanteds, where the vast majority of characters have the same form as the upright, wouldn’t this also indicate that the double-loop form has something of a cachet?_\n\nGerry recommended this approach for the CT italics because the double-loop form is the more cursive variant, so it is a good way to increase the distinction between upright and italic in Greek type, which otherwise has far fewer style distincions in individual letterforms than Latin or Cyrillic.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Hey, maybe it’s a Canadian thing? You are, after all, exceptionally good at being assimilated by a larger culture while pretending the opposite (at least collectively - exceptions do exist, and are commendable). Really, your license plates should say: “Canada - The Hockey State”. I’m sorry if that hurts your feelings, but as we say in Armenian, “let’s sit crooked but talk straight”.</cite>\n\nYou have nothing intelligent to say so you insult my country? An \"American thing\", to be sure.\n\nWe don't pretend to be protecting our culture. There's no such thing. It may be difficult for an ethno-centric American such as yourself to understand, but in Canada, immigrants are encouraged to keep their culture and language alive. \"Canadian\" culture is just a bunch of English, French, Scottish, Italian, Jewish, Greek, and other nationalities and their kids and grandkids. I don't understand exactly what you mean by protecting \"Canadian culture\" (or \"American culture\", for that matter). Does it mean we should make Iroquois and Inuktitut the official languages? Anyone in North America who is not a Native American is nothing more than an immigrant, and as such has no real right to protect \"their\" culture.\n\nMy grandfather left the Soviet Union during the Holocaust, fleeing persecution. Since you **insist** on playing Genocide like a poker card, 10 million dead beats 1 million. My grandparents left Italy because they were so poor they lived in a hut and came here to make something of **themselves** ; not their \"culture\". And they did. The language of Dante, sculpture of Michelangelo, countless operas, poems, paintings, and scholarship never did them any good. Their working blue-collar for the city and sewing in a hot factory on St. Lawrence and St. Viater for 70 hours a week is what allows me the privilege of sitting in my nice house and of having this delightful conversation right now, and it affords them the same right. Dante had nothing to do with it.\n\nFurthermore, beavers, stars and stripes, Mount Ararat, roses, thistle, and leek.. lovely symbols, but what have they done for you? President Kennedy said \"Ask not what your country can do for you, but what you can do for your country\". Was he high? You don't exist to be subservient to your \"nation\", it exists to protect and serve <cite>you</cite>.\n\nPierre Trudeau, <cite>our</cite> greatest leader, held to an ideal of individual rights (which is why he left the Quebec separatist movement - he found its limitations on freedom of education and freedom of speech in the name of the \"nation\" unjust). So you see, our lack of any specific culture is in fact quintessentially \"Canadian\", and it is the amaranthine Canadian quality that is the reason why we will never be \"assimilated\", as you say.\n\nFinally, as we say in Larinese, the dialect of my town in Italy (population 7.000 and one of the last places in Italy to fall to Latin Rome):\n\n\"Larino, Larino, la bella citta’; si mangia, si beve, l’amore, si fa.\"  \n<cite>“Larino, Larino, the beautiful town; one eats, one drinks, one makes love”</cite>\n\nAnd if that isn’t culture, then I don’t know what is.\n\nIn summation, stick to fonts.\n\nP.S.: As far as your idea that \"I don't vote, so I'm not responsible\", I offer you another proverb: \"Chi tace acconsente\" - <cite>\"Silence is consent\"</cite>. Grow up.\n\n"
    },
    {
      "time": "",
      "content": "\\> little more than a missing hairline\n\n?  \nPlease look at it again:\n\n ![](http://web.archive.org/web/20111022025454im_/http:/typophile.com/files/oxford-g.gif)\n\nMaybe you've forgotten how thin hair is?  \nOr how large that ball is?\n\n\\> But we’re talking about Greek type…?\n\nBased on other things he's done, I have reason to believe that Haralambous is not remotely a \"traditionalist\". What reasons (besides fishing for any pretext to favor a form your personal taste prefers over one that users of Greek would prefer) do you have to think the opposite?\n\nhhp\n\n"
    }
  ]
}
