{
  "id": "19282",
  "title": "Hebrew font--what is this font?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi there.\n\nExcited to find this website and forum.\n\nCan anybody help me—I am trying to find a digital match for this Hebrew font. A close match would be good, but idealy I am looking for an actual digital version of this font.\n\nSample is here: [http://www.sacerdoti.com/Resources/sample.gif](http://web.archive.org/web/20080410001248/http:/www.sacerdoti.com/Resources/sample.gif \"http://www.sacerdoti.com/Resources/sample.gif\")\n\nThe sample is from a prayer book printed by Vivian Ridler, printer to the Oxford University Press many years ago. Obviously back then it was not a digital font, and I now need to match it.\n\nPlease do help if you can.\n\nThanks!\n\nJonathan\n\n [‹ \"ICEBERG\" sans..](http://web.archive.org/web/20080410001248/http:/typophile.com/node/19277 \"Go to previous forum topic\") [(x) \"Sunoco\" \"Mike Cifelli's\" Art Deco sans - Casablanca Cond {Mike F} ›](http://web.archive.org/web/20080410001248/http:/typophile.com/node/19260 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080410001248/http://typophile.com/user/12497\" title=\"View user profile.\">mrjons</a>",
  "time": "<br>",
  "uid": "12497",
  "comments": [
    {
      "time": " 15.Apr.2006 5.44pm",
      "content": "Vilna (if you have Windows - you have it)\n\n"
    },
    {
      "time": " 15.Apr.2006 5.48pm",
      "content": "Thanks.\n\nVilna is the closest I have ever found, but it’s not quite the one. Might be the closest there is, but I’d hoped to find a better match.\n\nVilna’s yud character is a bit squarer, as are a few others actually.\n\nAlso, I’m on a Mac (of course!). But that’s irrelevant for now.\n\n"
    },
    {
      "time": " 15.Apr.2006 5.58pm",
      "content": "Similar, [Koren MF](http://web.archive.org/web/20080410001248/http:/www.myfonts.com/fonts/masterfont/koren-mf/) and Monotype’s [Peninim](http://web.archive.org/web/20080410001248/http:/www.monotypeimaging.com/ProductsServices/wt_fontsample.aspx?type=hebrew)\n\n"
    },
    {
      "time": " 15.Apr.2006 6.13pm",
      "content": "\\> but it’s not quite the one\n\nDo you want to match metal to digital? Good luck.\n\nPeninim? This face based on Frank-Rühl (and not good for your project)\n\n"
    },
    {
      "time": " 15.Apr.2006 6.25pm",
      "content": "Just trying to help...  \nHelp yourself [http://www.myfonts.com/browse/foundry/masterfont/](http://web.archive.org/web/20080410001248/http:/www.myfonts.com/browse/foundry/masterfont/ \"http://www.myfonts.com/browse/foundry/masterfont/\")\n\n"
    },
    {
      "time": " 15.Apr.2006 6.40pm",
      "content": "I know I’ll never get a perfect match, David, between metal and digital. But I was just hoping there might be a closer match than Vilna, though I agree it’s pretty close in some respects. The yud, the bet, and a few others give it away, to me. But I think it might be the best there is out there. Vilna is by far the best so far.\n\nWhat I am trying to do, you see, is add a couple of paragraphs to a book I am resetting. I have used scans of the old book for most of the text in Hebrew, but there’s a few new sections I need to set, and I had hoped I could use a digital font. Do you think I will get away with Vilna for this?\n\nThanks Miguel. I’ve seen loads of Hebrew fonts looking for this match, including all the ones at that link. But somehow the perfect match has yet to be found.\n\nMaybe I am being too fussy, I know. I have sometimes hoped to commission a digital version of this font. Maybe one day.\n\n"
    },
    {
      "time": " 15.Apr.2006 6.54pm",
      "content": "\\> Do you think I will get away with Vilna for this?\n\nWhy? What is the subject of the book?\n\n"
    },
    {
      "time": " 16.Apr.2006 2.37am",
      "content": "it’s a prayer book, but only a short one, for a special service. Most of the prayers are already set in other books, but there is a newly composed prayer which I need to set, and I wonder if you think Vilna will be a close enough match for me to type the new prayer out and use it, but simply scan in in the old ones.\n\n"
    }
  ]
}
