{
  "id": "19299",
  "title": "Does anyone not much like reading letterpress Bembo?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm trying to get an idea of the variation in type taste among people who know about it. So, how many of you don't much enjoy reading, let us say, well-printed letterpress Bembo, finding it either unattractive or uncomfortable?\n\n",
  "author": "George Horton",
  "time": "16 Apr 2006 — 5:50pm",
  "uid": "9356",
  "comments": [
    {
      "time": "17 Apr 2006 — 1:15am",
      "content": "Hmmm. What's up with Bembo lately?\n\nI've printed several letterpress books with Bembo. I'd like to think they were well printed. Never had a problem with the face except for those related to its metal configuration. It was weak as a metal face in that thin crossbars such as those in the lowercase e would wear out quickly. But then again, Monotype was never meant to be edition printed so why complain.\n\nUnattractive or uncomfortable? What are you kidding? Ever see Mrs Eaves?\n\n"
    },
    {
      "time": "17 Apr 2006 — 10:10am",
      "content": "I only pick Bembo because it's an obvious touchstone. But can everyone really like any one type? I expect it could only be so with a type too old to be unfashionable, but if it can happen at all then there's a consistency, in that subset of typographic judgement that constitutes bibliophile taste, which I don't think exists in any other art or craft.\n\n"
    },
    {
      "time": "17 Apr 2006 — 10:47am",
      "content": "I am so bored with Bembo: letterpress, offset, pixels, whatever.  \nThere is plenty of room for differences in taste among bibliophiles and typophiles, along the usual fault lines.\n\n"
    },
    {
      "time": "17 Apr 2006 — 11:06am",
      "content": "That's one at least; thanks Nick.\n\n"
    },
    {
      "time": "17 Apr 2006 — 11:10am",
      "content": "George, we're a pretty opinionated bunch. :^D I'd guess the only reason you would get everyone to agree is to pick a typeface by some revered type designer. No one would dare not like it. ;^D\n\nBembo is a little wide for me. I like it in short blocks of text or for dressier situations.\n\n"
    },
    {
      "time": "17 Apr 2006 — 11:22am",
      "content": "I go in and out of phase with the classics, including Bembo. But I think it's easy to read which I think is more to the point. And it has a lovely italic.\n\nI try not to be doctrinaire about fonts because they can be so wrong or so right depending on their use. Not that there aren't fonts I will NEVER use (Bookman! anything ITC!). But I do try to keep an open mind.\n\nI for one am sick to death of all the new grotesks, DIN and it's ilk. And publishers like Phaidon who use unreadable fonts for running text thinking it's edgy and cool.\n\n"
    },
    {
      "time": "17 Apr 2006 — 11:26am",
      "content": "My memory says letterpress Bembo is great, but digital Bembo is blah. I am skeptical about Bembo Book also, but I haven't seen it in print.\n\n"
    },
    {
      "time": "17 Apr 2006 — 11:49am",
      "content": "\"I’d guess the only reason you would get everyone to agree is to pick a typeface by some revered type designer. No one would dare not like it.\"\n\nWell, maybe not complete agreement. I have never liked Palatino and I am sure Zapf qualifies as \"revered\" by most Typophilers. Yes, we are an opinionated bunch though:-)\n\nChrisL\n\n"
    },
    {
      "time": "17 Apr 2006 — 11:59am",
      "content": "Yes, I dislike Palatino, and don't get very excited about Galliard or Sabon either.\n\n"
    },
    {
      "time": "17 Apr 2006 — 12:10pm",
      "content": "People change. OK, some people change.  \nI've tried Bembo, and I've had my Palatino/Aldus phase. So put me in the \"so many flavours, so little time\" camp.\n\n"
    },
    {
      "time": "17 Apr 2006 — 12:16pm",
      "content": "“so many flavours, so little time”\n\nNow if you put a scoop of Vanilla Swiss Almond on that Bembo, I might be persuaded to give it another taste :-)\n\nChrisL\n\n"
    },
    {
      "time": "17 Apr 2006 — 1:13pm",
      "content": "I'm very partial to letterpress Bembo in the context of British commercial printing of the 1930s to 1960s, especially academic books. I've never been very impressed with Bembo in private press and limited edition printing (even when printed by Mardersteig), where the larger sizes are usually used. Bembo is a great commercial bookface, but is somehow too common for the special treatment of fancy papers and bindings. But give me a copy of any OUP scholarly work set in Bembo and its the typographic equivalent of comfort food: not spectacular, but very palatable and pleasing.\n\n"
    },
    {
      "time": "17 Apr 2006 — 1:34pm",
      "content": "Interesting, John - I think I agree. Do you have a favourite for the best papers? I was astonished to realise that the extraordinarily beautiful book I was looking at a few days ago was printed in 13 point letterpress Erhardt, a type I never thought capable of such results, but which is apparently transformed on ideal stock.\n\n"
    },
    {
      "time": "18 Apr 2006 — 3:15am",
      "content": "<cite>I for one am sick to death of all the new grotesks, DIN and it’s ilk. And publishers like Phaidon who use unreadable fonts for running text thinking it’s edgy and cool.</cite>\n\nWhat did you use on the Close catalogue? I thought it was really nice in the wall texts.\n\n"
    },
    {
      "time": "18 Apr 2006 — 9:33pm",
      "content": "<cite>Yes, I dislike Palatino, and don’t get very excited about Galliard or Sabon either.</cite>\n\nTo me, a good book face should not be exciting. The strength of Sabon is that it works so well without being obtrusive, don't you agree?\n\n"
    },
    {
      "time": "19 Apr 2006 — 5:17am",
      "content": "I like Sabon but find Palatino obtrusive.\n\nChrisL\n\n"
    },
    {
      "time": "19 Apr 2006 — 6:27am",
      "content": "because it's not a book face, is it?\n\n"
    },
    {
      "time": "19 Apr 2006 — 6:47am",
      "content": "<cite>The strength of Sabon is that it works so well without being obtrusive, don’t you agree?</cite>  \nIgnoring the problems fixed in Sabon Next, the serifs are too short.\n\n"
    },
    {
      "time": "19 Apr 2006 — 8:55am",
      "content": "Too short for your taste, perhaps, but not too short functionally.\n\n"
    },
    {
      "time": "19 Apr 2006 — 8:58am",
      "content": "James - I used Seria Sans for the Close catalog, I think that's a beautiful face altho the italics are a bit too vertical for me, not easily enough distinguished from the roman.\n\nI like Sabon and have been using it recently because it is elegant and unobtrusive and has the complete expert set. I tend to avoid Palatino because it still to me smacks of the era when there were so few fonts available on the Mac and it was massively overused, along with Copperplate Gothic.\n\n"
    },
    {
      "time": "19 Apr 2006 — 9:20am",
      "content": "Typequake, Sabon's serifs are too short functionally. They don't counteract lateral masking well enough.\n\n"
    },
    {
      "time": "19 Apr 2006 — 9:28am",
      "content": "Gee, I've read so many books in Sabon before I learned the first thing about type, and never even noticed that it doesn't function!\n\n"
    },
    {
      "time": "19 Apr 2006 — 9:35am",
      "content": "It's not bad, it's just not perfect. The design looks like it results from thinking about legibility rather than about readability: and legibility was Tschichold's reason for switching to classical typography.\n\n"
    },
    {
      "time": "19 Apr 2006 — 9:49am",
      "content": "One thing I like about Sabon is the equal-width italic. Same with Optima.  \nIt's a value that works in a certain kind of layout. Spacious.  \nI don't think it's a mistake in a classic serifed face: the scotch romans had the same feature of an italic that took up the same amount of space as the roman.\n\n"
    },
    {
      "time": "19 Apr 2006 — 10:38am",
      "content": "I actually agree on that, wide spacing works with Sabon italic's very restrained, pre-Granjon French Renaissance flavour.\n\n"
    }
  ]
}
