{
  "id": "19296",
  "title": "How are you doing that?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’ve made two attempts in the past to gain a degree in typo/graphic design at LCC but only managed two weeks first time round and then two of the three years the second time of trying. I have a hot/cold relationship with type in terms of personal endeavours but consistent admiration for the discipline.\n\nSo hats of to those of you who are seasoned veterans, and looking at the forums there are many. Mainly i am asking for a little insite into individual and personal working strategies, motivational aids or any little things that go on inside your head which help keep things consistent.\n\nThe creative mind I find works when it wants to, often flashes of inspiration keep me occupied into the small hours when there is little to act as a distraction. When this subsides, I reach the end of a specific idea or things don’t work out, finding the track again is a difficulty. There is no formula of course and i know to a large extent dedication is inherant but any elaboration would be interesting.\n\ntier.\n\n [‹ Missing thread: \"When is kerning limited.\"](http://web.archive.org/web/20070808064849/http:/typophile.com/node/19022 \"Go to previous forum topic\") [A very special Easter Sunday this year... ›](http://web.archive.org/web/20070808064849/http:/typophile.com/node/19290 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070808064849/http://typophile.com/user/12476\" title=\"View user profile.\">tier</a>",
  "time": "<br>",
  "uid": "12476",
  "comments": [
    {
      "time": " 17.Apr.2006 3.40am",
      "content": "” Just as there is nothing more boring than boredom, nothing more  \nexciting than excitement, nothing more loveable than love or hateful  \nthan hatred, so there is nothing that arouses interest so much as  \ninterest. Interesting people are interested people, and an enthusiasm  \n- be it as thankless as birdwatching or as bizarre as philately - marks  \nout the enthusiast as a source of curious learning and a person with  \na mind that glows. “\n\nRoger Scruton (1944-), “On Hunting”  \nLeading British academic philosopher, founder of Claridge Press.\n\n"
    },
    {
      "time": " 17.Apr.2006 5.03am",
      "content": "“There is no formula of course and i know to a large extent dedication is inherant but any elaboration would be interesting.”\n\n:) the biggest thing I’ve ever found to keep things on track, moving, and to completion is a client with a clear idea of what the font is for. Second best, if you don’t have a client, is that You have a clear idea of what the font is for. :)\n\n"
    },
    {
      "time": " 17.Apr.2006 5.43am",
      "content": "My biggest problem is thinking of a new design possibility for a face before the one I am working on is finished. This year alone, I am working on 8 different faces in various stages of completion. It isn’t that I am stuck and don’t know what to do. I just can’t stop myself from starting a new project when the new idea strikes. I find I just have to get at least some basic characters down in the new font or I just can’t sleep. I have one face that could be done in 2 days but have been putting it off to work on the italic for a face I did 4 months ago.\n\n“Somebody stop me now”\n\nChrisL\n\n"
    },
    {
      "time": " 17.Apr.2006 7.38am",
      "content": "“Second best, if you don’t have a client, is that You have a clear idea of what the font is for.”\n\n[www.minusspace.com/fried/images/studio\\_jpg.jpg](http://web.archive.org/web/20070808064849/http:/www.minusspace.com/fried/images/studio_jpg.jpg \"www.minusspace.com/fried/images/studio\\_jpg.jpg\")\n\nMaterializing into;\n\n[www.minusspace.com/fried/images/ccnoa\\_jpg.jpg](http://web.archive.org/web/20070808064849/http:/www.minusspace.com/fried/images/ccnoa_jpg.jpg \"www.minusspace.com/fried/images/ccnoa\\_jpg.jpg\")\n\nNot sure I’ll ever know why I do anything, aside from scratching itches as such but they all seem so big and itchy but only need the smallest of scratches. The example above I can relate to because the ’why?’ is the outcome and that purely beyond reasoning with words.\n\n"
    },
    {
      "time": " 17.Apr.2006 7.53am",
      "content": "Very nice, Adam Conolly, I saw a painting like that in Rome, last year, here:  \n [http://www.quadriennalediroma.org/english/Englishversion.html](http://web.archive.org/web/20070808064849/http:/www.quadriennalediroma.org/english/Englishversion.html \"http://www.quadriennalediroma.org/english/Englishversion.html\")  \nI forgot the artist’s name.\n\n"
    },
    {
      "time": " 17.Apr.2006 8.58am",
      "content": "I do appologise, I am new to forum posting and as such know little of it’s etiquete. Credit is owed in full to Zipora Fried who’s work I admire greatly. The link was included to illustrate something for which I have an affinity but as yet no abbility to execute.\n\n[www.minusspace.com/fried/fried.html](http://web.archive.org/web/20070808064849/http:/www.minusspace.com/fried/fried.html \"www.minusspace.com/fried/fried.html\")\n\nMuch of the work is very good, Hartmut Böhm specifically, whom karl gerstner showed fairly early support for; [www.minusspace.com/index.html#artists](http://web.archive.org/web/20070808064849/http:/www.minusspace.com/index.html#artists \"www.minusspace.com/index.html#artists\")\n\nSo yes, it is this stoic drive I search for. Before the summer is out I aim to have finished one of the many projects that currently lay dormant and will be sure on completion to post an image or two for which credit/ shame can rightfully fall to me.\n\n"
    }
  ]
}
