{
  "id": "19295",
  "title": "Typophile: Feature request / wish list",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was going to add a new entry to the [Typophile Beta Bug Report](http://web.archive.org/web/20080906131935/http:/typophile.com/node/12063), however, since this isn’t really a bug but rather a request for a new feature, I decided to start a new thread. Hopefully others will add some more ideas, and we’ll all make our beloved Typophile even better.\n\nHere’s mine:  \nIs it possible to add a [permalink](http://web.archive.org/web/20080906131935/http:/en.wikipedia.org/wiki/Permalink) to each post so that they can be referred directly within the thread? I know it’s already possible to do something like this [http://typophile.com/node/17011#comment-103291](http://web.archive.org/web/20080906131935/http:/typophile.com/node/17011#comment-103291 \"http://typophile.com/node/17011#comment-103291\") but not everyone knows about it. In addition, one needs to loggin (or dig through the source code) to get the comment number. Thank you :^)\n\n(BTW, I noticed that this ’technique’ doesn’t work for threads with more than one page.)\n\n[Edit: [A List Apart](http://web.archive.org/web/20080906131935/http:/www.alistapart.com/comments/gettingstartedwithajax?page=3#23) does this too. Notice how the page number is included. I see now that we could do [http://typophile.com/node/17011?from=50&comments\\_per\\_page=50#comment-105...](http://web.archive.org/web/20080906131935/http:/typophile.com/node/17011?from=50&comments_per_page=50#comment-105491 \"http://typophile.com/node/17011?from=50&comments\\_per\\_page=50#comment-105491\") but this is human-unreadable.]\n\n [‹ ITC Berkeley goes pro](http://web.archive.org/web/20080906131935/http:/typophile.com/node/20525 \"Go to previous forum topic\") [TYPO Magazine ›](http://web.archive.org/web/20080906131935/http:/typophile.com/node/748 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906131935/http://typophile.com/user/1844\" title=\"View user profile.\">Miguel Sousa</a>",
  "time": "<br>",
  "uid": "1844",
  "comments": [
    {
      "time": " 16.Apr.2006 5.55pm",
      "content": "Sorry, one more thing. Could the URL of the new page(s) be a little more user-friendly? Something like:  \n [http://typophile.com/node/17011?page=2](http://web.archive.org/web/20080906131935/http:/typophile.com/node/17011?page=2 \"http://typophile.com/node/17011?page=2\") instead of  \n [http://typophile.com/node/17011?from=50&comments\\_per\\_page=50](http://web.archive.org/web/20080906131935/http:/typophile.com/node/17011?from=50&comments_per_page=50 \"http://typophile.com/node/17011?from=50&comments\\_per\\_page=50\")\n\n( [A List Apart](http://web.archive.org/web/20080906131935/http:/www.alistapart.com/comments/gettingstartedwithajax/?page=2) does it)\n\nThanks again!\n\n"
    },
    {
      "time": " 16.Apr.2006 8.37pm",
      "content": "One thing that bugs me is how, when a topic extends to multiple pages, the “new” flags get wiped out before you can get to the last page of the topic. My workaround has been to add “?from=0&comments\\_per\\_page=500” to the link url so all the threads appear on the first (and only) page.\n\nRelated to this, I would like the topic page links (e.g., “1 2 3 ... next page last page”) to appear both at the top and bottom of topic pages. This would be especially helpful when there are lots of images to load on a page. For example, the only way to get to, say, page 3 of a topic is to got to page 1 first, then jump to the end of the page and click on “3”. But if page 1 has a lot of images, the bottom of the page keeps jumping down as the images load making it hard to hit that “3”. My workaround is to stop the page loading (leaving out any images that were loading). It’s tricky to time it right—if I do it too soon, I may stop it before the bottom of the page has loaded. If the page links were also at the top, it would be much simpler.\n\nJust my 2¢.\n\n"
    },
    {
      "time": " 16.Apr.2006 8.45pm",
      "content": "One more thing for me too: I use the “Recent Post” page a lot. It would be great if, for each topic listed, the forum name (General Discussions, Design, Critique, etc.) was also included.\n\n"
    },
    {
      "time": " 17.Apr.2006 8.05am",
      "content": "Unless I’m totally missing something, I’d love to have the forums linked in the gutter on the right hand side so I can access them from anywhere. I find I have to click several times to navigate to another forum from a thread within a different forum.\n\n"
    },
    {
      "time": " 17.Apr.2006 8.31am",
      "content": "In the old Typophile, there was something like that in the top area of the page. I miss it.\n\n"
    },
    {
      "time": " 17.Apr.2006 8.34am",
      "content": "\\>One more thing for me too: I use the “Recent Post” page a lot. It would be great if, for each topic listed, the forum name (General Discussions, Design, Critique, etc.) was also included.\n\nGreat idea.\n\n\\>I would like the topic page links (e.g., “1 2 3 … next page last page”) to appear both at the top and bottom of topic pages.\n\nI made same suggestion at the launching of the ’beta’, so I second that.\n\n\\>I’d love to have the forums linked in the gutter on the right hand side so I can access them from anywhere.\n\nI don’t know how practical that is because of the scrolling. But you could put them at the top easily enough I would think—as I suggested at the launch—and the bottom as well, I would think. I believe the old version of typophile had this. Right now I have worked around the problem by dragging all the forum links to my browser bar.\n\n"
    },
    {
      "time": " 23.Apr.2006 1.46pm",
      "content": "In case anyone else uses [Greasemonkey](http://web.archive.org/web/20080906131935/http:/greasemonkey.mozdev.org/) for the Firefox browser, I’ve uploaded a script that adds a forum menu to the right-hand side of every page.\n\nYou can get it here: [typophile-menu.user.js](http://web.archive.org/web/20080906131935/http:/times-new-roman.com/dreamless/typophile-menu.user.js).\n\nIt looks like this:\n\n ![](http://web.archive.org/web/20080906131935im_/http:/typophile.com/files/typophile-menu-example.jpg)\n\n"
    },
    {
      "time": " 23.Apr.2006 5.01pm",
      "content": "I took these out of the bug report:  \nI agree with Mark; Could the link for going to the last page of a hot topic also be at the top, so that to check new posts at the end of the second page you don’t have to scroll down. This would be especially useful for hot topics.\n\nIt is starting to seem to me that it would be good if the next release made the “Insert image” link about 5 times larger and have blinking arrows all around it. Maybe have them cycle through the spectrum with each blink. I think that would look pretty cool too.\n\nI wonder if there is anyway the comment posting box could have spellcheck?\n\n"
    },
    {
      "time": " 10.May.2006 12.06pm",
      "content": "Another suggestion: If someone screws up an /cite, currently it now makes all following posts in that topic italic in spite of any new html. Is there a way to disconnected the commands from post to post?  \nFor instance: [http://typophile.com/node/19850](http://web.archive.org/web/20080906131935/http:/typophile.com/node/19850 \"http://typophile.com/node/19850\") The /cite was not inserted by Fisheye...\n\n"
    },
    {
      "time": " 10.May.2006 12.20pm",
      "content": "I wish that when someone IM’s me it didn’t pop up 2, 3, sometimes 4 times.\n\nReally agree that all the forums should be listed in the nav, either at the top or the right - it doesn’t matter.\n\nAnd that the links to multiple pages of a long thread should be at the top as well as the bottom.\n\n"
    },
    {
      "time": " 10.May.2006 12.34pm",
      "content": "_And that the links to multiple pages of a long thread should be at the top as well as the bottom._\n\nOh yeah.\n\n"
    },
    {
      "time": " 10.May.2006 12.50pm",
      "content": "Yes, and after you make a post onthe last page of a thread, it should return you to the last page, not the first page as now.\n\nChrisL\n\n"
    },
    {
      "time": " 10.May.2006 12.52pm",
      "content": "How about being able to “reply” to an IM instead of starting a new one even if the person is nolonger online.\n\nChrisL\n\n"
    },
    {
      "time": " 10.May.2006 1.05pm",
      "content": "I think they sould keep the beta banner Its soo cute and I think they also should keep the broken number 5 because it has no revelance and it will continue to be confusing. Great stuff!\n\n"
    },
    {
      "time": " 10.May.2006 1.13pm",
      "content": "The 5 was referring to the number of years\n\n"
    },
    {
      "time": " 10.May.2006 2.58pm",
      "content": "How about “Back” and “Forward” returning you to the exact point to which you’d scrolled on a given page of the forums?\n\n—Michael.\n\n———————————————————————————  \n// love what you do or do something else. //  \nMichael Ebert — graphic designer, jazz saxophonist, horror movie devotee  \n [http://homepage.mac.com/mwebert](http://web.archive.org/web/20080906131935/http:/homepage.mac.com/mwebert \"http://homepage.mac.com/mwebert\")  \n [mwebert@mac.com](mailto:mwebert@mac.com)  \n———————\n\n"
    },
    {
      "time": " 10.May.2006 2.59pm",
      "content": "I will repost my suggestion from last year. I wish for the option of reading newest post first and ending the scrolling blues.\n\nChrisL\n\n"
    },
    {
      "time": " 10.May.2006 5.23pm",
      "content": "_I wonder if there is anyway the comment posting box could have spellcheck?_\n\nUse Safari. It has spellcheck in all text fields. Don’t know if any other browsers have this.\n\n"
    },
    {
      "time": " 10.May.2006 5.45pm",
      "content": "In Safari, control click and select spelling from the pop-up menu.\n\nChrisL\n\n"
    },
    {
      "time": " 11.Jun.2006 6.24pm",
      "content": "at the TOP of a thread\n\nJump to LAST/NEW post\n\nEmail subscription.\n\nmore logical thread URLs i.e .../threads/Feature-request\n\n"
    },
    {
      "time": " 12.Jun.2006 6.02am",
      "content": "I wouldn’t mind a way to mark threads ala a favourites sort of way. I suppose I can always just CMD+d them. :)\n\n"
    }
  ]
}
