{
  "id": "19306",
  "title": "(x) Hand-drawn book type - FreeDom {Mike Y (self)}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "This type is from a children’s book that is in development, but the page designer didn’t tell the author the typeface before leaving the country — now they have to change some pages. The image is a bit pixilated, because I tried enlarging it. It’s like the sort of font I’d have in Part 14 of the Script Guide, but I don’t think it’s there.\n\nAnyone recognize this? Thanks  \n- Mike\n\n [‹ PROENZA SCHOULER logo](http://web.archive.org/web/20080929202929/http:/typophile.com/node/19367 \"Go to previous forum topic\") [Spankrock logo ›](http://web.archive.org/web/20080929202929/http:/typophile.com/node/19291 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080929202929/http://typophile.com/user/2088\" title=\"View user profile.\">bowfinpw</a>",
  "time": "<br>",
  "uid": "2088",
  "comments": [
    {
      "time": " 17.Apr.2006 9.17am",
      "content": "What has happened to our ability to post images??? I will have to try setting up a web page to show this sample. It will be a while.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 17.Apr.2006 9.25am",
      "content": " ![](http://web.archive.org/web/20080929202929im_/http:/typophile.com/files/testinginsertimage.png)\n\n"
    },
    {
      "time": " 17.Apr.2006 9.26am",
      "content": "Hmm. Strange. Works here. Can you see that Mike?\n\n"
    },
    {
      "time": " 17.Apr.2006 9.45am",
      "content": "No. I see a blank with a red square and a white x in the middle for your post. When I try it, everything seems to work, but no image is attached.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 17.Apr.2006 9.51am",
      "content": "Hmm. I see the image I’ve uploaded. What’s yer setup?\n\n"
    },
    {
      "time": " 17.Apr.2006 10.06am",
      "content": "I’m on an old Mac G3 running OS 9.2, using IE5 as a browser.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 17.Apr.2006 10.17am",
      "content": "Got any kind of image blocker on?\n\n"
    },
    {
      "time": " 17.Apr.2006 10.19am",
      "content": "Mike - cross over to the dark side. I just got an iMac refurb for a song (2 gig RAM, 20” screen, small footprint, $1299) & finally made the switch to OS X. No regrets. It sings.\n\n"
    },
    {
      "time": " 17.Apr.2006 10.26am",
      "content": "Patty, I wish I could. I wanted to upgrade the OS, but the new one only comes on DVD, and I don’t have an input device for that. Aargh! I do have OS X, but I thought I should jump to the latest. So I’m stuck back where I started. I don’t want to go through conversion just for OS X 1.\n\nDavid,\n\nI see other images, just not the one Tiff posted earlier.\n\nAnyway, you can see two samples of this font at [http://bowfinprintworks.com/Hand\\_DrawnSample.html](http://web.archive.org/web/20080929202929/http:/bowfinprintworks.com/Hand_DrawnSample.html \"http://bowfinprintworks.com/Hand\\_DrawnSample.html\"). Look familiar?\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 17.Apr.2006 10.36am",
      "content": "I found it. I already had it in the Guide (Pt 14, pg 2) — the font is T-26 FreeDom by Carlos Segura & Stephen Farrell, but it’s no longer on their site (or at MyFonts). I think this might have been one they gave away as a freebie.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 17.Apr.2006 11.20am",
      "content": "not all browsers support .png files. Maybe you just need a new browser, mike?\n\n"
    },
    {
      "time": " 17.Apr.2006 7.31pm",
      "content": "It doe indeed look a lot like FreeDom; although the uppercase \\_S\\_ seems to be a tad different. Maybe that’s just on my screen.\n\n"
    },
    {
      "time": " 19.Apr.2006 3.30pm",
      "content": "\\> _I think this might have been one they gave away as a freebie._\n\nIt was included as a freebie with the International Type Founders catalogue and CD-ROM. I’ve got the font. Never used it. It stinks.\n\n"
    }
  ]
}
