{
  "id": "19311",
  "title": "(x) Media Xchange generic serif - Adobe Serif substitution font {Mark S}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I’ll attach the image below. I’m looking to ID the “media change” part. Any help would be much appreciated, and in the meantime, I’ll try to find a larger version. Thanks so much.\n\n ![](http://web.archive.org/web/20070811133128im_/http:/typophile.com/files/logofinal.gif)\n\n [‹ Boards of Canada band logo](http://web.archive.org/web/20070811133128/http:/typophile.com/node/20561 \"Go to previous forum topic\") [\"Utah\" monoline script ›](http://web.archive.org/web/20070811133128/http:/typophile.com/node/20560 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070811133128/http://typophile.com/user/8579\" title=\"View user profile.\">alldaveallen</a>",
  "time": "<br>",
  "uid": "8579",
  "comments": [
    {
      "time": " 17.Apr.2006 1.42pm",
      "content": "I have a sneaking suspicion it’s ITC Bookman demi, but I would love some confirmation by the finer minds herein assembled...\n\n"
    },
    {
      "time": " 17.Apr.2006 1.53pm",
      "content": "i don’t think it’s bookman, the details are all wrong.\n\n"
    },
    {
      "time": " 17.Apr.2006 2.27pm",
      "content": "I think this is the dreaded Adobe Serif substitution font. It’s anybody’s guess what missing font it’s standing in for.\n\n"
    },
    {
      "time": " 17.Apr.2006 2.44pm",
      "content": "Oh, man...don’t tell me that.. :(\n\nIs there a less convoluted method of verifying that possibility than creating the text in an Adove program in some font that I don’t have and then seeing if Adobe uses the serif sub font? Like, for example, does this “Serif” font exist somewhere I can call it up?\n\n"
    },
    {
      "time": " 17.Apr.2006 2.48pm",
      "content": "I can use it in Text Edit, but there is not a bold version available.\n\n"
    },
    {
      "time": " 17.Apr.2006 3.25pm",
      "content": "Aarrgh...I added it to “Font Book” and Suitcase, but i can’t get it to show up in an application I can use. If you are correct that this font is the Adobe SerifMM font, I may just go back to the client and say “Hey, great time for a logo redesign, wouldn’t you say?” (I basically volunteered to convert their logo which only exists in GIF form(!) into something they could actually use, like a vector file).\n\n"
    },
    {
      "time": " 17.Apr.2006 6.03pm",
      "content": "The problem with trying to use Adobe SerifMM is that it is a Multiple Master font. Adobe’s type engine, which is used in all Adobe software, sees that a font is missing, looks it up in its internal database and, if it know about it, will adjust the weight and width axes of Adobe SerifMM to mimic the weight and proportions of the missing font. (There is also Adobe SansMM for missing sans serif fonts.)\n\nSo, assuming you could get it to show up in your font menu (and don’t ask me how Tiffany did it—I don’t know), you would need a program that can manipulate MM font axes, and most of those are from the pre-OS X days (on the Mac anyway).\n\nIs there perhaps a printed version of their logo that uses the correct font? Maybe some stationery or a brochure?\n\n"
    },
    {
      "time": " 18.Apr.2006 9.52am",
      "content": "I may try to load up Illustrator 8 on my Mac and run it in classic mode, if I really need to create an outlined version. It’s my understanding that this logo was created in the early days of this company by a designer(?) that they no longer do business with. Essentially, the only version of this logo that exists at all is the one that has been kicking around their website for a while. I have done some web work for them and I offered to create a vector version of the logo so they wouldn’t have to keep blowing up the gif file to obscene proportions every time they run a print ad, or forego using their logo entirely.\n\nMy plan is to recreate the logo with a different, more viable font, and if they really NEED me to exactly duplicate the old one, go into Illustrator and hand-manipulate the outline until it looks like the old font. I am starting with some variations on Bookman and/or Book Antiqua (sp?) that I think may serve nicely.\n\n"
    },
    {
      "time": " 19.Apr.2006 9.26pm",
      "content": "Century Old Style may be a good starting point if you go that route. FWIW, I don’t think you will be able to coax any version of Illustrator to let you work with either of the Adobe substitution fonts directly. They are meant to operate invisibly behind the scenes.\n\n"
    },
    {
      "time": " 20.Apr.2006 6.39am",
      "content": "Just thinking that it seems unlikely that the substitution font is being seen by accident, standing in for another, as recolouring the dot on the “i” would have been done after converting the text to outlines.\n\n"
    },
    {
      "time": " 20.Apr.2006 7.57am",
      "content": "That’s a good point, but it’s also possible that the original designer used a dotless i and drew the dot.\n\n"
    },
    {
      "time": " 9.Jun.2006 10.28am",
      "content": "That IS a good point, but at the risk of drawing some incorrect conclusions about the designer, I think the dot may have been colored in after the image was converted to a bitmap.\n\n"
    }
  ]
}
