{
  "id": "19321",
  "title": "Fonts in the science fair - my kid won!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "My 12-year-old won his middle school science fair with a font [legibility](http://web.archive.org/web/20100728075744/http:/typophile.com/wiki/legibility) project. He evaluated viewers’ responses to eight fonts – four [sans](http://web.archive.org/web/20100728075744/http:/typophile.com/wiki/sans%2520serif) and four [serifs](http://web.archive.org/web/20100728075744/http:/typophile.com/wiki/serif) – at simulated road sign distances. The font size was chosen to be just legible for the average person at ten feet, the test distance.\n\nThe results – from most to least legible: [Highway Gothic](http://web.archive.org/web/20100728075744/http:/typophile.com/wiki/Highway%2520Gothic), [P22 Underground](http://web.archive.org/web/20100728075744/http:/typophile.com/wiki/P22%2520Underground), [Verdana](http://web.archive.org/web/20100728075744/http:/typophile.com/wiki/Verdana), then [Arial](http://web.archive.org/web/20100728075744/http:/typophile.com/wiki/Arial), [Times New Roman](http://web.archive.org/web/20100728075744/http:/typophile.com/wiki/Times%2520New%2520Roman), and [Georgia](http://web.archive.org/web/20100728075744/http:/typophile.com/wiki/Georgia) - all roughly equal, then [Palatino](http://web.archive.org/web/20100728075744/http:/typophile.com/wiki/Palatino), and last was [Goudy Oldstyle](http://web.archive.org/web/20100728075744/http:/typophile.com/wiki/Goudy%2520Oldstyle).\n\n[Point sizes](http://web.archive.org/web/20100728075744/http:/typophile.com/wiki/point%2520size) were adjusted so that [cap heights](http://web.archive.org/web/20100728075744/http:/typophile.com/wiki/cap%2520height) of the different faces were equal. Test text (half all caps, half sentence case) was a shortened version of the “Jaded zombies” [pangram](http://web.archive.org/web/20100728075744/http:/typophile.com/wiki/pangram) with some numbers added.\n\nHis conclusions – sign makers know what they are doing, sans is best for signage, [x-height](http://web.archive.org/web/20100728075744/http:/typophile.com/wiki/x-height) is important. Hardly groundbreaking, but his methods apparently were sound. Yeah, I helped.\n\n",
  "author": "<a href=\"/web/20100728075744/http://typophile.com/user/11256\" title=\"View user profile.\">londontype</a>",
  "time": "<br>",
  "uid": "11256",
  "comments": [
    {
      "time": "",
      "content": "Wow, starting them young on the analytics of type! Good for you.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "That's really cool. It's important that these things be constantly tested, because they could, or can, or do, change. Is Highway Gothic most legible because that's what people are used to? Great stuff.\n\n"
    },
    {
      "time": "",
      "content": "The familiarity question is interesting and one we had thought of. I'm sure Hrant has a well-informed opinion on that. Terminal Design has some really interesting legibility sfuff at [http://clearviewhwy.com](http://web.archive.org/web/20100728075744/http:/clearviewhwy.com/ \"http://clearviewhwy.com\"). Their new signage font Clearview is purported to be one of the most legible ever.\n\nNext year we're looking at hooking subjects up to a lie detector-type machine to see if there are measurable stress differences when the subjects read extended text passages in different fonts, spacings, or sizes - good vs. bad typography.\n\n"
    },
    {
      "time": "",
      "content": "With regards to the british road sign system, I'm sure in the process that lead up to the choice of a sans font, a serif actually came out marginally ahead in the various tests. The serif was designed by david kingersley (sp?) -- an apprentice of eric gill\n\n"
    },
    {
      "time": "",
      "content": "I thought Kindersley's design never actually hit the road, so to speak.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I was just reading in Justin Howes' book on E. Johnston about the petit serifs that Gill and Johnston experimented with. Is that the type of serif it was?\n\n"
    },
    {
      "time": "",
      "content": "it never hit the road, apart from in test situations -- ie cars approaching at varying speeds, with varying point sizes etc. I'm pretty sure it was well tested. It had as I remember it a few interesting little features that distinguished certain similar characters from one another. It was quite charming actually in a quirky kind of way -- quirky not being very road friendly!\n\n"
    },
    {
      "time": "",
      "content": "The serifs in Kindersley's design are:  \n1) Often not where you expect them, or absent from where you do.  \n2) Sort of like deeply sheared large flares; or very chunky adnates.\n\n\\> quirky not being very road friendly!\n\nMaybe not to graphic designers, but to laymen, who knows?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "yeah perhaps -- I think laymen notice differentialities psychologically nonetheless, even if it represents a fraction of a fraction second's thought. it retrospect it seems like they made the right decision. the kindersley design feels very dated, but considering the prominence of signage in our visual landscape, I may be conditioned by this to think that. the prominence of the chosen sans did make me question what would have happened had they gone with the serif... these things have such a large knock on effect\n\n"
    },
    {
      "time": "",
      "content": "\\> I think laymen notice differentialities psychologically nonetheless\n\nI definitely agree. I just doubt that \"quirky\" (at least within bounds,  \nwith Kindersley's design being so) can't in fact do more good than harm.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Bravo to Brad's child! Glad to see something more interesting as a school project than how long it took meal worms to eat a handful of Cherios.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Hrant, are you familiar with Fernand Baudin's idea that one can't be truly literate in this age without some understanding of how to use typography? It's a little much to hope that typographic education will ever become general.\n\nAn aside: My wife's an English teacher. I wonder sometimes if her students who have limited interest in reading or slight learning disabilities might be harmed by poor typography - can bad type and arrangement make an already difficult task almost impossible for them?\n\n"
    },
    {
      "time": "",
      "content": "<cite>Next year we’re looking at hooking subjects up to a lie detector-type machine to see if there are measurable stress differences when the subjects read extended text passages in different fonts, spacings, or sizes - good vs. bad typography.</cite>\n\nThat's a really fascinating idea. I wonder if computer UI designers have done any similar tests. It might be hard to get a large enough control group, there are lots of interesting tests you could perform with varying fonts and texts. Personally, I think get a bit irritated if things aren't legible, so that might be part of it.\n\n"
    },
    {
      "time": "",
      "content": "\"_Next year we’re looking at hooking subjects up to a lie detector-type machine to see if there are measurable stress differences when the subjects read extended text passages in different fonts…_\"\n\nTest the people who claim to love reading entire books set in Helvetica. I'm sure they must be lying—\"No, honestly, I think I read _even better_ like this. Because I just _love_ design.\"\n\nP.S. Someone please close the italic tag.\n\n"
    },
    {
      "time": "",
      "content": "\\> Fernand Baudin’s idea that one can’t be truly literate in  \n\\> this age without some understanding of how to use typography?\n\nWell, it's certainly a convenient theory! :-)\n\n\\> can bad type and arrangement make an already  \n\\> difficult task almost impossible for them?\n\nI think that -as with \"normal\" readers- it's a matter of thresholds  \nbeing crossed over long periods of time. Sub-optimal design might not  \npresent an obvious and immediate impediment to reading, but it slowly  \nwears away at a reader's stamina and patience; and once in a while,  \nthere will be a <cite>snap</cite> - and then yes, you lose the reader, even though  \nit might not be obvious why.\n\nhhp\n\n"
    }
  ]
}
