{
  "id": "19325",
  "title": "(x) Oil tankers on the New Jersey Turnpike - custom painted (similar to Futura, Century Gothic) {Yves}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I saw this signage on a bunch of oil tankers on the New Jeresey Turnpike and I’ve been trying to indentify the font ever since. Word on the street is that this is the place for font identification. Checking the forum, it very well does appear to be the case!\n\nFor some reason I can’t embed the image (File copy failed: no directory configured, or it could not be accessed) so I’ll link to a photo that I found of the tankers, and I’ll try to embed it with some html.\n\n[http://www.flickr.com/photos/tampics/107748414/](http://web.archive.org/web/20071116153003/http:/www.flickr.com/photos/tampics/107748414/ \"http://www.flickr.com/photos/tampics/107748414/\")\n\n ![](http://web.archive.org/web/20071116153003im_/http:/typophile.com/files/oilheatsbest.jpg)\n\nThanks!  \nSam\n\n [‹ (x) Pure Reason Revolution band logo - Erasmus {John Thelin (self)}](http://web.archive.org/web/20071116153003/http:/typophile.com/node/19334 \"Go to previous forum topic\") [(x) \"Joanne's\" bold connected script - Ariston {David H} ›](http://web.archive.org/web/20071116153003/http:/typophile.com/node/19318 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071116153003/http://typophile.com/user/12521\" title=\"View user profile.\">sammyg</a>",
  "time": "<br>",
  "uid": "12521",
  "comments": [
    {
      "time": " 18.Apr.2006 12.15am",
      "content": "Hi Sam,\n\nObviously this is not a font — those humongous letters were painted directly on the tankers. As for digital fonts that are similar to those letters, you could try Futura or Century Gothic.\n\n"
    },
    {
      "time": " 18.Apr.2006 12.17am",
      "content": "Looks like good old Futura Bold to me (and doesn’t it look really nice in this setting...)\n\n"
    },
    {
      "time": " 18.Apr.2006 1.34am",
      "content": "It _looks_ like Futura Bold, but it’s not. Perhaps a sign painter’s interpretation of it, though.\n\n"
    },
    {
      "time": " 18.Apr.2006 3.18am",
      "content": "Ha! I pass this every time I visit my son in New York City. It is on the exit 14 connector from the Jersey Turnpike into the city. Every time I pass it I scream out FIX THE A! They didn’t know to taper the diagonals so the counter of the A is big enough. —Of course I get the indulgent ’Dad the type nut’ looks.\n\n"
    },
    {
      "time": " 18.Apr.2006 10.53am",
      "content": "William!  \nHa Ha! I pass these guys almost daily. I don’t insult the A out-loud, although I do repeat it as a mantra in my head. It may need some kerning as-well but I like seeing letters that large. If you read them in the order in which they appear, as street floor signs are read ( stay in lane is written “lane” then “in” and then “stay”) then it read “Oil Heats Best” which is a nice subliminal.\n\n"
    },
    {
      "time": " 18.Apr.2006 11.31am",
      "content": "Thanks guys. I thought it had to be a custom font, but I’m not schooled enough in signage to know if that’s always the case with giganto lettering like this.\n\nIt does look similar to Futura and Century Gothic (particularly Futura Extra Bold), but the differences intrigue me. Particularly the B and the O. Any other suggestions for similar fonts? I’m looking to copy the B and O for a font I’m using for a film title. BRUNO is the title and right now we’re using Futura Extra Bold, but it looks a little too “goofy” and is very very overused in the film industry (Wes Anderson and Kubrick particularly LOVE IT).\n\nThanks again,  \nSam\n\n"
    }
  ]
}
