{
  "id": "19323",
  "title": "Selecting a Font... where to start?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am a college senior about to graduate at the end of May and am currently putting together my final thesis. My thesis is a book of essays and photographs on the Florida Everglades and this weekend I will be doing the final layout. While I already have the design in mind I have no idea on where to start on picking a font. I would love some suggestions on what resources to look at that will help me with this process. I realize fonts are typically a very personal choice so I am not really looking for a \"use this\" but rather some information (or link to an essay) explaining how people make these decisions. Thanks for your help and I look forward to hearing your responses.\n\n",
  "author": "Drew Fulton",
  "time": "17 Apr 2006 — 9:01pm",
  "uid": "12519",
  "comments": [
    {
      "time": "17 Apr 2006 — 9:22pm",
      "content": "Hi, Drew.\n\nFonts can or may be a personal choice but they are also helping to communicate something, so it is important to bear in mind the content and subject matter of the text you are setting (which you already are, since you mention these), as well as the audience that will be reading it.\n\nOne thing you can do to get started (perhaps you have already done this) is look at existing books on the same subject and see what font choices their designers made -- not to blindly copy, but to see what you think works or doesn't work in those examples.\n\nAnother thing you could do is make a list of the different functions the texts in your thesis will have. For example, you will have body text, but probably there are also titles and subtitles, and perhaps captions for the photographs. You may want just one font, in a range of weights, for all of these... or perhaps two fonts -- one for titling, the other for body text, to give a simple example. With a list of functions you can have a better idea of what you need to look for.\n\nI hope these suggestions don't sound too obvious!\n\n"
    },
    {
      "time": "17 Apr 2006 — 9:24pm",
      "content": "Drew\n\nI am sure this is going to get me kicked off the list but if you are doing a thesis, use Courier. I'd also recommend it for resumes. Avoid \"personal choices\" for informational documents such as these. I once remember being on a job search panel, and an applicant who had sent in a very appealingly designed resume got kicked off just for that reason. You are going to be judged on the information you present not on how you present it. And, how you present it can actually be detrimental (to you) if it does not conform to the norm.\n\n"
    },
    {
      "time": "17 Apr 2006 — 9:29pm",
      "content": "Ooh, don't use Courier for resumes! I don't recommend it for anything! If you want something restrained for a thesis or resume at least go with Palatino, Garamond, Times, a real font.\n\n"
    },
    {
      "time": "17 Apr 2006 — 9:40pm",
      "content": "Thanks for the help everyone.\n\nBieler and Pattyfab:  \n Part of my thesis is in fact the design aspect. I am submitting a very nontraditional project as it is in fact a book, more than half of which will be photos. The book will be laid out as if it is a photo book purchased in a store. That's why I am trying to be careful in my font selection.\n\nRicardo:  \n Thanks for the help. Here are the different sections I am going to be using text for and I will have to do some thinking on how I want each displayed.\n\nBody text - Text of each essay, nearly half the book (~50-75 pages)  \nChapter Title - Part 1, Part 2, etc  \nChapter Subtitle - Title of each chapter (The Everglades)  \nPhoto Title - Title and location of each photograph. Currently set up in Small Caps  \nPhoto Caption - Currently set up in italics and is smaller than body text. Typically a few sentences describing the photo.\n\nI will post a link to a sample page w/ a PDF in the morning when I can get access to a full version of Acrobat.\n\nThanks again for the help and I look forward to learning more about this process. I will definately spend some time looking through other photography books this week.\n\nDrew\n\n----------  \nDrew Fulton  \nEverglades Imagery  \n [www.evergladesimagery.com](http://web.archive.org/web/20120326181240/http:/www.evergladesimagery.com/ \"www.evergladesimagery.com\")\n\n"
    },
    {
      "time": "17 Apr 2006 — 9:48pm",
      "content": "pattyfab\n\nI do have to ask this question. Based on your suggestions, has a thesis or resume proved fruitful for you using the \"real fonts\" you suggest? Also, Courier, by the way, is a real typeface. And despite its disdane among contemporary graphic designers (?) it does have a bit of a distinguished history to it. Personal taste in this matter is of little concern here since that is what you are trying to avoid.\n\nIf I am to send a manuscript to a publisher it is still going to be in Courier. They are not going to be concerned about how clever I am in my choice of typeface. In fact, it gets in the way of judgement.\n\n"
    },
    {
      "time": "18 Apr 2006 — 1:36am",
      "content": "Surprised to hear this from you, Gerald. Courier may be a traditional typeface for a manuscript, but any monospaced face _gets in the way of long reading_.\n\n"
    },
    {
      "time": "18 Apr 2006 — 2:55am",
      "content": "Gerald, I think Courier would be appropriate if this is a resquirement for theses, but otherwise not, especially in conjunction with photographs. As this evidently has a strong design component, you should look for what best complements the photos.\n\nWhatever you choose, test with the photos as these are going to dominate visually, and should. The font should be a supporting actor, not the lead.\n\n"
    },
    {
      "time": "18 Apr 2006 — 6:17am",
      "content": "Beautiful images, Drew. If design is one of the aspects of your thesis, then I agree that Palatino or Garamond would be good choices for the text.\n\nIf you will be using small caps, be sure to get a font that has \"true\" small caps as opposed to picking the \"small caps\" style in your layout program (same goes for \"bold\" and \"italic\" settings -- use a font that has these weights as part of the font package). Here's an example of [Palatino Small Caps](http://web.archive.org/web/20120326181240/http:/www.myfonts.com/fonts/linotype/palatino/small-caps-and-old-style-figures/). (And here is the whole range of [Linotype Palatino](http://web.archive.org/web/20120326181240/http:/www.myfonts.com/fonts/linotype/palatino/) weights, also by way of illustration.)\n\n"
    },
    {
      "time": "18 Apr 2006 — 6:54am",
      "content": "As you mentioned, the choice of a typeface is often the result of ones personal taste. Now let's see if you find any om mine interesting enough?\n\n[http://www.macrhino.com](http://web.archive.org/web/20120326181240/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\n"
    },
    {
      "time": "18 Apr 2006 — 8:11am",
      "content": "Ricardo,  \n Thanks for all your help. What is the benefit of using a Small caps weight rather than the \"CASE\" option under styles in InDesign? I appear to have both Palatino Linotype and Garamond but dont have a Small Caps weight for either. As a college student who has already thrown all of his money at this project I am also wondering if there are any free options.\n\nHere is a link to a temp layout done with Palatino Linotype and showing all of the different uses. Just for context, the book is a 10\" square and this is a two page spread. Small caps are done using style rather than a true Small Caps weight. File is just ~215KB\n\n[http://www.evergladesimagery.com/templayout.pdf](http://web.archive.org/web/20120326181240/http:/www.evergladesimagery.com/templayout.pdf \"http://www.evergladesimagery.com/templayout.pdf\")\n\nThanks again for all your help.\n\nDrew\n\n----------  \nDrew Fulton  \nEverglades Imagery  \n [www.evergladesimagery.com](http://web.archive.org/web/20120326181240/http:/www.evergladesimagery.com/ \"www.evergladesimagery.com\")\n\n"
    },
    {
      "time": "18 Apr 2006 — 9:30am",
      "content": "Quick observations, don't indent the first paragraph of a section, the captions don't seem to align with (and therefore appear separated from) the picture. But as you haven't asked for a crit please feel free to ignore me. Your choice of Palatino does a good job.  \nTim\n\n"
    },
    {
      "time": "18 Apr 2006 — 5:28pm",
      "content": "Drew, I am, shamefully, still something of an InDesign newbie. When I advised against using Small Caps, Italic and Bold styles rather than the actual weights in the font menu, I was referring to programs like QuarkXPress, which \"fake\" those styles -- the faked styles don't always print the way they look onscreen. Maybe someone else here can tell you how InDesign handles these things -- from the evidence of the PDF it _looks_ alright, but better to be sure.\n\nAs for your layout, you have not asked for a crit, but I agree with timd; it will look better if you don't indent the first line of the photo caption on the lefthand page (the same applies to the first paragraph of your main text on the facing page -- you could start it with a drop cap, or with the first few words in small caps, to give a couple of suggestions). And one more thing about the caption: it might look better if the parentheses around those unitalicized names were also not italicized... right now they look like they are running into the text... Sorry to get all anal on you. :-)\n\n"
    },
    {
      "time": "18 Apr 2006 — 9:41pm",
      "content": "I find the Courier comment offensive.\n\nSearch some titles from Cambridge University Press: pdf excerpts from a wide range of academic topics set in Palatino, Quadraat, Seria, Garamonds, Galliard, TNR, Baskerville, etc etc etc.\n\nPick one that appeals to you and have fun.\n\n"
    },
    {
      "time": "18 Apr 2006 — 10:44pm",
      "content": "I do not know if it is the best option to make captions in Small Caps. Small Caps seems to work better for sub-headings or in some cases the headings themselves. In this instance I would make the caption text italic but keep it the same size as the text on the right. And then I would play around with the idea of making the heading small caps at the same size as the text and drop the saturation of the overall text to about 90% so it is not overpowering. I apologize if you are not after a critique though.\n\n"
    },
    {
      "time": "19 Apr 2006 — 6:18am",
      "content": "Thanks for all the comments on the design. I wasn't looking for a critique but glad to know I can come here for one. I am frantically trying to get my writing done (past two nights have gone till 5:30) and am pretty much there. I will be spending this weekend trying to nail down my layout and I probably will be posting here for critique if people would be willing to share their thoughts. For instance, I have already changed this layout a bit, moving around the photo title and captions. Anyway, thanks again for all of your help and I will get back to you all with some design comments in the next few days!\n\nDrew\n\n----------  \nDrew Fulton  \nEverglades Imagery  \n [www.evergladesimagery.com](http://web.archive.org/web/20120326181240/http:/www.evergladesimagery.com/ \"www.evergladesimagery.com\")\n\n"
    },
    {
      "time": "19 Apr 2006 — 6:39am",
      "content": "Good luck with the writing. :^) Forget about the \"design\" of the book until you get all the words right! Once you got the font family, styles and the template the rest is easy.\n\nI agree with the earlier suggestions that Palatino and (Adobe) Garamond would be more than suitable (and economical) for setting your thesis/book in.\n\nIt seems that you've used \"faux\" Small Caps (SC) in InDesign, they don't look quite right. The problem with \"faux\" SC is that they're not weighted/designed proportionally to the regular/or corresponding weight. For this reason alone, I suggest you purchase the single SC weight of your chosen face. It should not be expensive if you've already got the other weights as you have with Palatino and Garamond.\n\nAgain, good luck. :^)\n\n"
    },
    {
      "time": "19 Apr 2006 — 10:27am",
      "content": "Your book would look very nice with Whitman. And it has true small caps.  \n [http://www.fontbureau.com/fonts/Whitman](http://web.archive.org/web/20120326181240/http:/www.fontbureau.com/fonts/Whitman \"http://www.fontbureau.com/fonts/Whitman\")\n\n"
    },
    {
      "time": "19 Apr 2006 — 11:37am",
      "content": "_It seems that you’ve used “faux” Small Caps (SC) in InDesign, they don’t look quite right. The problem with “faux” SC is that they’re not weighted/designed proportionally to the regular/or corresponding weight. For this reason alone, I suggest you purchase the single SC weight of your chosen face. It should not be expensive if you’ve already got the other weights as you have with Palatino and Garamond._\n\nDrew, Geoff's comment about the faux small caps is exactly what I was struggling to say earlier. Thanks, Geoff, for the articulate explanation! :-)\n\n"
    }
  ]
}
