{
  "id": "19332",
  "title": "Career change into graphic design",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I have an undergrad degree in Engineering and am still working in Information technology. Following my lifelong passion for design, I finally enrolled at Rochester Institute of Technology part time as a graphic design undergrad student. I still work full time and take foundation level art classes in the evenings. I do plan to attend school full time in NYC when my husband is done with school in Rochester(he is changing careers into commercial photography).  \nQuestions - I don't want a super academic school, I do not want to end up teaching (I hope not). I have already worked in web design firms in a technical capacity and worked on a lot of web sites (construction, not design, but good sites none the less). What school is in touch with reality? I had heard good things about SVA. Parsons - my impression is that it is full of youngsters who think they are the next celebrity designer. I am 32 years old, married, and a no nonsense person. Things like campus life don't worry me in the least, I am only concerned about a quality education.  \nAlso, Parsons has a 2 year degree (AAS) that they say is geared towards career changers, but they could not put me in touch with any teachers. Does the AAS count? I am not too keen on another 4 year degree but don't think I have what it takes to get into a grad program, those sound too advanced frankly. Should I try the associates route, try to find a job and then see. Frankly 4 years in school seems risky and a tad out of touch with what could be the outcome of that education.  \nAny help and advice would be greatly appreciated. How about MICA and RISD? Are those too academic? Thanks again..\n\n",
  "author": "axm",
  "time": "18 Apr 2006 — 9:12am",
  "uid": "12530",
  "comments": [
    {
      "time": "18 Apr 2006 — 9:24am",
      "content": "You might find some help in this thread:\n\n[http://typophile.com/node/16875](http://web.archive.org/web/20140805065100/http:/typophile.com/node/16875 \"http://typophile.com/node/16875\")\n\n"
    },
    {
      "time": "18 Apr 2006 — 10:49am",
      "content": "Does it really matter what art school it is? I think that a design from each institution tends to have a similar aesthetic. Not always, but most of the time. I would go for a school that is more conceptual based rather than anything else. I mean anyone can make pretty things.\n\n"
    },
    {
      "time": "18 Apr 2006 — 11:02am",
      "content": "Thanks. Would you suggest any schools?\n\n"
    },
    {
      "time": "18 Apr 2006 — 11:53am",
      "content": "Well I dont know how much of a factor money is but theres nothing that comes close of Dutch Design educations in Holland. They take graphic design very seriously over there and have entire institutions dedicated just to type-design! But also its ridiculously hard to get in. Something like 6 people per year out of thousands of candidates. As for US schools, possibly RSID would be my first choice.\n\n"
    },
    {
      "time": "18 Apr 2006 — 12:15pm",
      "content": "A lot of older students who have degrees in other fields go to RISD; when I was there (as a youngling), the older students could finish the four-year BFA in two to three years, depending. I recommend RISD whole-heartedly.\n\n"
    },
    {
      "time": "18 Apr 2006 — 12:19pm",
      "content": "If you go to RISD, say hello to Hans VanDyjk for me and tell him to feed his cats!\n\nChrisL\n\n"
    },
    {
      "time": "19 Apr 2006 — 6:57am",
      "content": "The general idea I got about RISD was that the education is aimed towards making a good teacher out of you and not get you a job. I frankly dont know if RISD is an option due to the location. Any ideas about Parsons vs SVA? I gather from the other post that Pratt is probably not worth it.\n\n"
    },
    {
      "time": "19 Apr 2006 — 7:52am",
      "content": "_The general idea I got about RISD was that the education is aimed towards making a good teacher out of you and not get you a job._\n\nThat might be true about the grad program. But you would be looking at the undergrad program, I imagine.\n\nThe only nice things that NYC schools have to offer, in my opinion, is proximity to New York designers.\n\n"
    },
    {
      "time": "19 Apr 2006 — 8:01am",
      "content": "So, it seems the general consensus for undergrad is RISD. When I spoke to their dept head, she suggested applying for the grad program as well saying that they tack on a year's worth of work for people coming from unrelated disciplines. I dont know if I can go to RI, since my husband plans to work as a commercial photographer in NYC. So, no one has anything good to say about SVA? or Parsons? Are they just bad?\n\n"
    },
    {
      "time": "19 Apr 2006 — 8:48am",
      "content": "My ex taught at Parsons and was not that impressed with the student body. I've always heard good things about SVA and Pratt (despite the other thread). FIT is also an option and, I believe cheaper. You could also apply to NYU's Interactive Telecommunications Program if you're interested in the more interactive side of design. It's not a graphic design program but more geared towards new technology.\n\n"
    },
    {
      "time": "20 Apr 2006 — 11:33am",
      "content": "Thanks for all your responses. On a slightly different note, I found out that Mica has a Post-Baccalaureate Certificate Program that prepares students from unrelated backgrounds to apply to grad school. Now, I am not sure if this is for fine art only, but I am wondering if grad programs in graphic design are generally geared towards teachers. Any insights would be appreciated.\n\n"
    },
    {
      "time": "20 Apr 2006 — 12:11pm",
      "content": "I think that grad programs vary from school to school. I went to graduate school in Visual Communication Design at Ohio State and they had 2 programs,one for teaching and one for design practice and management. That was over 30 years ago though.\n\nChrisL\n\n"
    },
    {
      "time": "27 Jan 2011 — 7:59am",
      "content": "This is funny! I have not visited my own posts in a while, I tend to dig through typeface recommendations for the most part on this forum. But I initiated this post, and 4 years later, I am 5 months away from graduating with a BFA from the School of Visual Arts in NY. I did a 1 semester stint at Pratt institute in the graduate Communication Design program and felt it would be tough to catch up with people with 4 years on top of me - they supposedly prepare you for graduate work with 6 credits worth of additional classes, which I thought would not work for me. Anyway, I have been pretty happy with my experience @ SVA and how everything worked out in the end.  \nAmrita  \namritamarino.com\n\n"
    },
    {
      "time": "1 Feb 2011 — 12:14pm",
      "content": "Congrats!\n\n"
    },
    {
      "time": "1 Mar 2011 — 4:10pm",
      "content": "Hmmmm...it looks like you have kind of a sticky situation, yet some really great opportunities still. It's really great that you are considering a 360 degree career change into something creative/not always in demand or stable--it's a big leap to take for sure. I understand when you say you want a less academic school and one focused more on your field and such since you do already have some type of experience. I mean...yes, 4 years is pretty long to start another whole new degree.\n\nSo, let's a take a look at your options...  \n1. [http://www.mica.edu/](http://web.archive.org/web/20140805065100/http:/www.mica.edu/ \"http://www.mica.edu/\") - offers the \"create your own degree\" aspect, which will allow you a little more freedom with you creativity/art which may or may not fire back in the longrun  \n2. [http://www.risd.edu/](http://web.archive.org/web/20140805065100/http:/www.risd.edu/ \"http://www.risd.edu/\") - it is more renowned with very talented teachers, but it is more structured but has really great campus environment and programs  \n3. [http://www.onlinegraphicdesigndegree.com/](http://web.archive.org/web/20140805065100/http:/www.onlinegraphicdesigndegree.com/ \"http://www.onlinegraphicdesigndegree.com/\") - this might be an alternative to you since you are only looking for something short term, you can always just take some courses online to add to your already known skills and still keep your IT job until you are ready to take on graphic design full time\n\nHonestly, when deciding schools, it's more about the environment and culture that you will feel the most comfortable at. The majority of all art schools are going to give you pretty much the education that you need to succeed, so just consider on what YOU want to gain from formal education at an art school.\n\n"
    },
    {
      "time": "1 Mar 2011 — 4:55pm",
      "content": "\"360 degree career change\"\n\n"
    }
  ]
}
