{
  "id": "19345",
  "title": "Help! Free substitute for Bodega Sans?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Can somebody possibly recommend a free substitute for Bodega Sans and also where one may find it? Your help is much appreciated.  \nMpolino\n\n",
  "author": "mpolino",
  "time": "18 Apr 2006 — 7:25pm",
  "uid": "12548",
  "comments": [
    {
      "time": "18 Apr 2006 — 7:30pm",
      "content": "If it is the caps you are after, this has a similar feel:  \n [http://moorstation.org/typoasis/designers/steffmann/samples/k/kalender.htm](http://web.archive.org/web/20141109211344/http:/moorstation.org/typoasis/designers/steffmann/samples/k/kalender.htm \"http://moorstation.org/typoasis/designers/steffmann/samples/k/kalender.htm\")\n\n"
    },
    {
      "time": "18 Apr 2006 — 7:31pm",
      "content": "This is not really the place to ask for free fonts. If you really want/need Bodega Sans, you should pay up. :^)\n\n"
    },
    {
      "time": "18 Apr 2006 — 7:41pm",
      "content": "Golly, thanks for your snooty type-wisdom. However, if you are in fact a working designer, you may realize that my client does not want to pay $648 bucks for the family. Thanks but please keep your replies helpful.  \nM\n\n"
    },
    {
      "time": "18 Apr 2006 — 7:43pm",
      "content": "Thanks fontplayer, I need the lowers too. I( am thinking I could switch to gill or clearface of something like that and my client may not realize. Heh. Appreciate your help.  \nM\n\n"
    },
    {
      "time": "18 Apr 2006 — 7:48pm",
      "content": "It might disarm those kinds of replies if you describe the type of font characteristics, and say, \"sort of like Bodega, which my client, a poor non-profit organization, can't pay for.\"\n\nThere is a very high concentration of people who make their living with fonts here, so free stuff is kind of threatening, and a sore subject with some.\n\nI know some musicians who are in a similar situation where a trend was happening when clubowners were just playing canned music rather than paying live musicians. I don't know where that issue stands these days. But art usually suffers as a result of natural tendancies toward economic savings.\n\n"
    },
    {
      "time": "18 Apr 2006 — 7:59pm",
      "content": "Gosh golly, mpolino, I don't think Geoff was being snooty. If you are in fact a working (graphic) designer, you might not find it so hard to understand that type designers also need to make an honest living from their hard work. And hey, if your client doesn't want to pay for good fonts and is willing to settle for free ones, s/he might have to settle for the lower quality that comes with that choice, i.e., missing lowercase characters. Free stuff has a price, too.\n\n_I( am thinking I could switch to gill or clearface of something like that and my client may not realize. Heh._\n\nA bit of client _education_, eh?\n\n"
    },
    {
      "time": "18 Apr 2006 — 8:09pm",
      "content": "\\> However, if you are in fact a working designer, you may realize that my client does not want to pay $648 bucks for the family.\n\nHmmm, this is absolutely NOT a case to use a free font that is derived from Bodega Sans. If your client can't afford Bodega, perhaps you could suggest a cheaper alternative (similar but not derivative) or a font from your library that could work. However if your client insists on Bodega Sans specifically, you should tell them that it is worth $648 bucks and perhaps you could educate them why fonts are so darned \"expensive\\*\".\n\n\\* They aren't really. ;^P\n\nEDIT: Ricardo, I took so long to type, but you got my point across nicely. Thanks.\n\n"
    },
    {
      "time": "18 Apr 2006 — 8:25pm",
      "content": "Listen fellas,  \nI am new to this forum and it seemed like I got a quick response that was suggecting that I am some hack who likes free stuff. For that I apologize. I have the utmost respect for the talent it takes to create a beautiful typeface, please don't think otherwise. I deal with the same problem every day with clients who want great design for a minimal price. I certainly did not mean to get off on the wrong foot here. I will take the advice and be more careful of the way I word my posts from now on. Please forgive me, I was so glad to have found this site and it is way too early for sour grapes. That is all and thank you for the help.  \nMpolino  \nP.S. For the record, I was suggesting the other typefaces because they were out of my own collection that I paid out the arse for. :)\n\n"
    },
    {
      "time": "18 Apr 2006 — 10:16pm",
      "content": "Not sure where you got the $648 quote. Price at [FontShop](http://web.archive.org/web/20141109211344/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=bodega%20sans) is $40 per font and $325 for all 9 fonts.\n\nThis may be a tough search. There are very few free fonts that come with a full set of weights.\n\n"
    },
    {
      "time": "19 Apr 2006 — 3:10am",
      "content": "No worries, Marcus. I was going to add that your choices (or your client's) don't have to be limited to $648 or nothing -- there are always less expensive alternatives in between those two extremes -- but Geoff and Stephen have already said it, and it looks like you can get at least a few weights of Bodega for less than you thought. Good luck!\n\nGeoff, you're welcome. Cheers!\n\n"
    },
    {
      "time": "19 Apr 2006 — 11:47am",
      "content": "The \"price\" of fonts and the search for similar looking alternative typefaces are very common topics in the Typophile Forum (as well as many other design forums), often spawning all levels of responses from constructive to downright nasty. :-\\\n\nI'm glad to see a more constructive approach taken above. :-)  \n(Welcome to the forum, Marcus.)\n\nBTW -- our Typowiki does has a great listing of links on the [_ **Where can I get free fonts?** _](http://web.archive.org/web/20141109211344/http:/typophile.com/wiki/FAQ_Free) page, a great resource for legit free fonts.\n\nIn the future, whenever someone less than civily asks for assistance in seeking such sources, I suggest we just point them to the Typowiki. If they are just looking for a \"look-alike\", then let them look for one themselves. The kind members of Typophile have enough to do already.\n\n"
    },
    {
      "time": "19 Apr 2006 — 12:09pm",
      "content": "There's a [Read Me](http://web.archive.org/web/20141109211344/http:/typophile.com/readme) page that every new user should be acquainted with, which addresses the topic of [free fonts](http://web.archive.org/web/20141109211344/http:/typophile.com/readme#free).\n\n"
    },
    {
      "time": "19 Apr 2006 — 12:22pm",
      "content": "\\> BTW — our Typowiki does has a great listing of links on the  \n\\> Where can I get free fonts? page, a great resource for legit free fonts.\n\nThere are some glaring ommisions there. If I have a specialty, this is it. And these are some of the best that spring to mind:\n\nDieter Steffman,  \n [http://moorstation.org/typoasis/designers/steffmann/index.htm](http://web.archive.org/web/20141109211344/http:/moorstation.org/typoasis/designers/steffmann/index.htm \"http://moorstation.org/typoasis/designers/steffmann/index.htm\")\n\nManfred Klein,  \n [http://moorstation.org/typoasis/designers/klein/index.htm](http://web.archive.org/web/20141109211344/http:/moorstation.org/typoasis/designers/klein/index.htm \"http://moorstation.org/typoasis/designers/klein/index.htm\")\n\nHarold Lohner,  \n [http://www.haroldsfonts.com/](http://web.archive.org/web/20141109211344/http:/www.haroldsfonts.com/ \"http://www.haroldsfonts.com/\")\n\nIconian Fonts,  \n [http://www.iconian.com/](http://web.archive.org/web/20141109211344/http:/www.iconian.com/ \"http://www.iconian.com/\")\n\nRay Larabie  \n [http://www.larabiefonts.com/](http://web.archive.org/web/20141109211344/http:/www.larabiefonts.com/ \"http://www.larabiefonts.com/\")\n\nTypOasis in General  \n [http://moorstation.org/typoasis/typoasis1.htm](http://web.archive.org/web/20141109211344/http:/moorstation.org/typoasis/typoasis1.htm \"http://moorstation.org/typoasis/typoasis1.htm\")\n\nDafont,  \n [http://www.dafont.com/](http://web.archive.org/web/20141109211344/http:/www.dafont.com/ \"http://www.dafont.com/\")\n\n"
    },
    {
      "time": "19 Apr 2006 — 12:41pm",
      "content": "\" my client does not want to pay $648 bucks for the family.\"  \nI wouldn't either. Who's selling it for that much!?\n\n"
    },
    {
      "time": "19 Apr 2006 — 12:53pm",
      "content": "Ahh, [found it](http://web.archive.org/web/20141109211344/http:/www.fonts.com/findfonts/detail.htm?pid=423357&grab_id=0&page_id=19319&query=bodega%20sans&SCOPE=Fonts). You might want to give Monotype a call, David. Or maybe you already know about their pricing practices.\n\n"
    },
    {
      "time": "19 Apr 2006 — 2:43pm",
      "content": "\"Ahh, found it. You might want to give Monotype a call, David. Or maybe you already know about their pricing practices.\"\n\n?\n\nThat price is for both the Bodega Sans and Bodega Serif families, complete, with all the small caps and alternates. Sans alone is $324. Price is between FB's 1-computer and 5-computer license for same product. Also, as pointed out, fonts.com sells singles, at the same price as FB for a single-computer license.\n\nIf someone needs a font, and has a budget, it will be worth their effort to explore all the options. Many of the large retailers offer singles.\n\n"
    },
    {
      "time": "19 Apr 2006 — 4:07pm",
      "content": "My apologies, Carl. I didn't see the Serif in there. If I had read, I might have.\n\n"
    },
    {
      "time": "19 Apr 2006 — 8:32pm",
      "content": "Thanks for all the help everybody. I forget where i got the $648, I just typed in bodega sans in google and clicked one. I will check out all the recommended reading. I always prefer to have the whole family but I don't suspect I'll be needing the serifs for this application. Again, thanks all!\n\n"
    },
    {
      "time": "20 Apr 2006 — 3:59am",
      "content": "\" Again, thanks all!\"  \nYou are welcome. You shop around, you'll find we make some sense.\n\n"
    },
    {
      "time": "20 Apr 2006 — 9:21am",
      "content": "\"I just typed in bodega sans in google and clicked one.\"\n\n« - bangs head on desk\n\n"
    },
    {
      "time": "8 Mar 2008 — 11:52am",
      "content": "[http://www.fontplus.net/fontes/buscar/](http://web.archive.org/web/20141109211344/http:/www.fontplus.net/fontes/buscar/ \"http://www.fontplus.net/fontes/buscar/\")\n\n"
    },
    {
      "time": "8 Mar 2008 — 12:33pm",
      "content": "Great idea \"tellingyouso\", use a pirate site and get your client sued.\n\n"
    },
    {
      "time": "8 Mar 2008 — 12:40pm",
      "content": "The world never ceases to amaze me :-(\n\nChrisL\n\n"
    }
  ]
}
