{
  "id": "19348",
  "title": "Unique+Dynamic Arabic Font / Unik+Dinamik Naskh",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Dear Friends,  \nReferring to the MRALLAH.jpg that comprises all the Arabic Characters from Hamza-to-Ya, I would like to highlight the Smart, Attractive + Space-saving Features of the Arabic Script first.\n\nNeedless to say, the Arabic letter Ha has 4 shapes: the flower-like initial, the 8-like middle + the final that looks like either o or q depending on the letter coming before.\n\nThat's right: Virtually, Arabic letters Change shape —Tails not heads— in such a way that they:  \n1. join (connect) appropriately to neighbouring letters through short curves or straight lines. See (S+J) in Sojjadan + As-Sojood and how J joins D in the first and WAW in the latter.  \n2. form easy-on-the-eye + self-explanatory Combinations (Ligatures) of 2 or more letters, not only at the beginning, but also at the mid & end of words.  \nSee (S+J) in Sojjadan and As-Sojood and (M+H+M) of Mohammed and explore more...  \n3. need no space between the words: one would simply understand where a word ends and the next one starts.  \nThat's clearly seen in virtually all the Arabic Calligraphy (AC) of the \"Qol Howa Allaho Ahad\" where the Ha of the \"Howa\" overlaps the Lam of \"Qol\". Since the Lam takes the final shape and Ha the flower-like shape, then the space between the 2 words \"Howa and Qol\" is narrowed to minus.  \n—————— 03.2003 Start bulding my Naskh with 5+1 TTFs ——————  \nAs the strength of a chain lies in its weakest link, the Quality of an Arabic font lies in its poorest feature: Ligatures , Diacritics Positioning Kerning?  \nBy Applying my own technique, I finished designing -9 months ago- a new font of AC with the help of which I successfully completed building up the most Challenging Arabic Text of the Glorious Quran—3 years of hard work...\n\n ![](http://web.archive.org/web/20140809174222im_/http:/typophile.com/files/MRALLAH_3859.JPG)\n  \nAs the MRALLAH.jpg shows, my font is distinguished by:  \n• Ligatures of upto 4 Consonants, not only at the beginning, but also at the mid + end of words.  \n• Smart Joiners: Straight and curved Tails for Consonants and ligatures.  \nSee (S+J) in Sojjadan and As-Sojood and how J joins D in the first and WAW in the latter.  \n• Full Kerning by shifting up and/or right any letter that follows, R,D,WAW and likewise. See (D+Alif) in Ashidda and (R+T) in Maghfiratan.  \n• Four (4) baselines for Consonants & 7 lines for Vowels (Diacritics).  \nSee the 3 lines in (M+H+M) of Mohammed and the fourth in (Y+N) of Allazina.  \n• Accurate Vowels Positioning. They —Vowels (Diacritics or Marks) are:  \n1 horizontally centered, slightly above or below the letters they belong.  \n2 distributed in harmony with the ligatures,  \n3 neither touching the letters to which they belong, nor transgressing neighbors.  \n• WAW Discrimination: The word WAW (AND) is lowered and attached to the next word. See (WAW+R) in WaRizwana.  \n• Compatibility with any software that runs on 98/2000/XI & reads RTF.\n\nThat's right: In order to achieve all the possible ligatures of AC, and accurately position diacritics, I:  \n• Designed (5+1) TTFs comprising more than 1100 Glyphs and  \n• Translated the Rules of AC into Word-Macros to juggle 5 TTFs accordingly.\n\nFinally, worth mentioning that Virtually, the Arabic Text (AT) of All the PC & TV Programs of the Glorious Quran  \n• is too small and/or does not match the poorest AC.  \n• does not always start and/or end meaningfully in the same screenshot,  \n• and/or does not always go in line with Recitation and/or Translation.  \nIn summary: My Font solves all the Screen and Paper Publishing problems  \n————————— 08+09.2010 Aziz Naskh = A single TTF —————————  \nAziz Unique+Dynamic Ballpen Naskh is being finalized to go with  \n [MaryamSoft Arabic Calligrapher](http://web.archive.org/web/20140809174222/http:/typophile.com/node/48495). I have typeset the above sample in Word 2003 and printed it to a PDFile (attached) in 2 colors, Glyphs in Black and the separable Dots + Marks in blue to emphasize the point mentioned by [khaledhosny](http://web.archive.org/web/20140809174222/http:/www.khaledhosny.org/node/142).  \n——————————————————————————————  \nThanks Typophiles for the Input + Feeback with [Flowers](http://web.archive.org/web/20140809174222/http:/www.typophile.com/node/51401).\n\n| Attachment | Size |\n| --- | --- |\n| [Naskh Aziz.pdf](http://web.archive.org/web/20140809174222/http:/typophile.com/files/Naskh%20Aziz_0.pdf) | 68.1 KB |\n\n",
  "author": "AzizMostafa",
  "time": "18 Apr 2006 — 9:15pm",
  "uid": "12550",
  "comments": [
    {
      "time": "18 Apr 2006 — 9:36pm",
      "content": "Try spotting the differences between the 2 jpgs.\n\n"
    },
    {
      "time": "19 Apr 2006 — 7:59am",
      "content": "\\>But so far, no sponsor to transform my 6 TTFonts into a single OTF?!\n\nFor sure the work in converting your custom-encoded fonts into an OpenType font isn't trivial, but why do you need a sponsor? What's holding you back from doing this yourself?\n\n"
    },
    {
      "time": "19 Apr 2006 — 10:59am",
      "content": "Arabic is a glorious script (one of my all-time favorites),  \nand you've put in an incredible amount of effort. Bravo.\n\nThe main thing I notice about this is its extreme tightness.  \nThis is not unique, but especially in the digital realm it  \nis pretty rare. It saves space, and creates a special texture,  \nbut as you might have already encountered, some people  \nwill say it's too tight.\n\nSpeaking of saving space, you write:  \n\\> need no space between the words\n\nAlthough this is more true for Arabic than Latin (except for fully-joined Latin script fonts :-) it's still not true enough: if the last letter of a word happens to be one that has no join on its left, it can often get confusing. On the other hand, Arabic does save space in two other ways: it can dump [short] vowels\\*; and it distributes its \"information\" more evenly in the Cartesian area\\*\\* (which also has a readability advantage). But this latter part comes at a price: lesser apparent size.\n\n\\* Although this actually comes from a linguistic advantage:  \nSemitic languages need vowels far less than Indo-European ones.\n\n\\*\\* Whereas Latin for one is much more horizontal.\n\nIn terms of getting this to market, I might suggest Linotype.  \nBut if they say no, they probably have a valid reason: they  \nalready have an accomplished \"uncompromising\" Arabic  \ntypeface, including full coverage of the Qur'aan style.  \nIf they decline you could look for font houses that would  \nlike to rival Linotype in Arabic fonts.\n\nOr you could try contacting SIL. They recently  \nreleased Arabic fonts, but nothing like yours.  \n [http://www.sil.org/](http://web.archive.org/web/20140809174222/http:/www.sil.org/ \"http://www.sil.org/\") \\_  \nJust one thing: with SIL, don't push the Qur'aan angle too much.\n\nLastly, like Simon said you could do it all on your own.  \nBut finding and leveraging good distribution channels  \nfor this sort of thing is non-trivial.\n\nhhp\n\n"
    },
    {
      "time": "19 Apr 2006 — 10:57pm",
      "content": "Misunderstood and Underestimated Space-savingness!  \nWhat makes Arabic space-saving is Not Only the Word-Spacings But Also Ligatures and Kerning (inter-word-spacing).  \nLigatures integrate 2 or more letters into one. Example: L+M+H+M occupy a single Ha-space.  \nKerning integrates 2 letters into One. Example: Alif+R occupy a single R-space.  \nLigatures and Kerning are fantastically handled in my font.\n\nVowels too play their role in Arabic Space-savingness. How?  \nArabic Vowels are virtually dropped without sacrificing readability thus made less horizontal than the Vowels-thirsty English.\n\nWord Space Modulation (WSM)  \nIf a word ending with a clockwise letter (like Ra) is followed by a word starting with counterclockwise letter (like 3ain), the space between them is eleminated without sacrificing readability. My word Macros fail to do this WSM in the case of a fully justified text.\n\nWhat’s holding me back me from transforming my the Six (6) TTFonts into a single OTF?!  \nUnfortunately, LinoType rejected my font without giving any reason save-I guess- the complexity of transforming the 6 TTFs fonts into a single OpenType Font though they have never produced any “uncompromising” font with nor without the Quran style.  \nLack of Capital, Lack of indepth Knowledge of Open-Type Tech and more discouraging is the Web that has rendered Copyrights meaningless particularly in the Arabic World. Here and around you can get All the Linotype and SIL fonts free of charge.  \nOtherwise, by now, I have marketed them without transforming them into a single font?\n\n"
    },
    {
      "time": "20 Apr 2006 — 1:25am",
      "content": "\\> My word Macros fail to do this WSM in the case of a fully justified text.\n\nWhich is a shame, since deploying \"vertical kerning\" so to speak  \nseems like a pretty clever way to justify a line. On the other hand,  \nArabic has the advantage of the wonderful kasheedah for doing the  \nsame (although admitedly by taking up MORE space instead of less).\n\n\\> they have never produced any “uncompromising”  \n\\> font with nor without the Quran style.\n\nI thought Linotype sells the fancy Diwan font that handles  \nQur'aan setting (the impressive demo of which I saw at the  \nATypI conference in Leipzig in 2000).\n\n\\> you can get All the Linotype and SIL fonts free of charge.\n\nThe SIL fonts are actually free anyway (which doesn't  \nmean however that SIL doesn't pay people to make them).\n\n\\> Otherwise, by now, I have marketed them  \n\\> without transforming them into a single font?\n\nI'm assuming that's not really a question,  \nand you're saying that you would have started  \nselling the \"complex\" system on your own were it  \nnot for piracy. Ironically though, I would think  \nthat this complexity would discourage piracy! :-)  \nBut by the same token, it would discourage sales  \nas well I guess...\n\nMaybe, if this is valuable enough to some people,  \nyou could price it very high, include training with  \nthe fonts, and settle for selling only a handful.\n\nhhp\n\n"
    },
    {
      "time": "20 Apr 2006 — 3:13am",
      "content": "Kasheedah is wonderful if deployed where needed. But It behaves randomly and indiscriminately beautifying some words and spoiling others. So, it is virtually useless. WSM is a wiser alternative. But...\n\nDiwan Mishafi font is a built-in font and applicable in Diwan Sofwares only. Still it is not a faithful production (match) to their own Caligrapher's handwriting.\n\nComplex system?!  \nMaking the fonts and building the macros was as complex as building my [Flowers](http://web.archive.org/web/20140809174222/http:/www.crauswords.com/flowers/WFlowers.htm)  \nBut deploying the font and applying the Macros is as easy as solving them.  \nHowever, I am Still fighting the web to find One of the handful you mentioned in your marketing proposal.  \nMany Thanks\n\n"
    },
    {
      "time": "20 Apr 2006 — 6:55am",
      "content": "\\>Unfortunately, LinoType rejected my font without giving any reason save-I guess- the...\n\nI can understand given the level of piracy out there that you might not want to go it alone, but Linotype isn't the only vendor working on Arabic types, Bitstream recently announced a tie-up with Mamoun Sakkal, and Monotype is involved in this area too. I'm sure there are others out there. For sure they may decide not to collaborate with you, but they'll likely give you an explanation if you ask nicely.\n\nCheers, Si\n\n"
    },
    {
      "time": "20 Apr 2006 — 9:17am",
      "content": "this may be a little bit offtopic, but:\n\nhrant said:  \n«Semitic languages need vowels far less than Indo-European ones.»\n\nas far as i know, egyptian language (2000BC or so) used no vowels at all in written language - but i dont know how it was in spoken language.\n\nthat fact leads to the problem that some names could be pronounced differently - lets say \"Ramses\" could also be \"Rumsos\". but most of the names are probably covered because there are transcripts of them in other languages (à la stone of rosetta).\n\nand yes, i know that semitic would mean \"on the arabic peninsula\" if you'd be precise, but i just wanted to add this fact, nothing more.\n\n"
    },
    {
      "time": "20 Apr 2006 — 10:10am",
      "content": "If your font is as good as you say it is, there should be enough of a market for it in the West (in fact, all around the world) to justify developing and publishing it yourself.\n\nWhile going through that process might not at first be a good return on your investment of time, other things will grow out of it.\n\nWhat you will need is your own website to publicize and explain the font, with a link to myfonts.com, where customers will be able to license and download it. That's the basic set-up for \"indie\" fonts, used by hundreds of foundries.\n\nWhile Myfonts distributes all-comers, other distributors are selective, to varying degrees, in the number of foundries they represent. But those other distributors will be more inclined to distribute your font(s) once you have established a basic presence.\n\nAnd really, there's not much difference between a contract with a distributor, and one with a publisher (\"foundry\").\n\n"
    },
    {
      "time": "20 Apr 2006 — 10:23am",
      "content": "\\> If your font is as good as you say it is, there should be enough of a market\n\nNot really. Simply because high culture is not very marketable (like you should be realizing with Panoptica). Certainly, \"good\" doesn't equate to \"trendy\". In fact sometimes, Really Good stuff simply has to be given away. And other times it's sadly not a good fit to the devious and capricious retail market.\n\nhhp\n\n"
    },
    {
      "time": "20 Apr 2006 — 10:59am",
      "content": "_high culture is not very marketable (like you should be realizing with Panoptica)_\n\nAziz (or should I be addressing you as Mostafa?) -- I have type designs released by four publishers (since 1984), and another 20-odd typefaces which I publish myself (since 1999), which are sold around the world by nine distributors. So my advice is based on practical experience.\n\nWhile it's true that a typeface such as my Panoptica sells only a small amount, and never gets on the best-seller list at Myfonts, since its release in 2003 it's sold over a hundred (individual fonts) there, to people from many countries. That's the thing, although the retail market is, if not devious, at least capricious, thanks to the Internet it is a world market, and there are enough people committed to good typography, around the world, to make self-publishing a viable business.\n\n"
    },
    {
      "time": "20 Apr 2006 — 11:27am",
      "content": "\\> So my advice is based on practical experience.\n\nBut even more so on your belief system. Which to me is  \nlike Swiss cheese: tasty, but more notable for its holes. :-)\n\nAlso: how many non-Latin fonts have you sold?  \nHow many Arabic ones? Don't understimate  \nAziz's complaint concerning piracy.\n\n\\> it’s true that a typeface such as my Panoptica sells only a small amount\n\nThe last time you brought that up, you were baffled by the fact.  \nI'm simply trying to help you understand.\n\n\\> ... to make self-publishing a viable business.\n\nI certainly agree.  \nBut it's mostly trendy faces that make the money. If you depended  \nonly on fonts like Panoptica, would things still be \"viable\"? Sadly, no.\n\nAnyway my main contention arose from your \"enough of a market\". Enough  \nfor what? Probably a return on time invested. And in the case of something that  \nso few people (especially rich ones) appreciate, there's no way that's there.\n\nhhp\n\n"
    },
    {
      "time": "20 Apr 2006 — 12:04pm",
      "content": "_Don’t understimate Aziz’s complaint concerning piracy._\n\nI don't, which is why I emphasized the size and variety of the world market.\n\n_I’m simply trying to help you understand._\n\nYou're mocking me for poor sales, because you enjoy insulting me and my \"belief system\".\n\n_If you depended only on fonts like Panoptica, would things still be “viable”? Sadly, no._\n\nI was refering to the viability of self-publishing, not related to any particular genre of typeface.\n\n_But it’s mostly trendy faces that make the money._\n\nRight, popular faces sell more. Doh.\n\n_And in the case of something that so few people (especially rich ones) appreciate, there’s no way that’s there._\n\nWell that's something for Aziz to figure out. All I'm doing is explaining a distribution model, and pointing out that obscure products can succeed, because the global market is so large and diverse.\n\n"
    },
    {
      "time": "20 Apr 2006 — 12:45pm",
      "content": "\\> I emphasized the size and variety of the world market.\n\nHere's the variety for you: in Western Europe and the  \nUS\\* people buy fonts, in the rest of the world they don't. :-/\n\n\\* I'm including Canada. ;-)\n\n\\> You’re mocking me for poor sales\n\n?  \nNo way. Poor sales (and 100 units isn't bad) on one font can be  \njust a fluke - most of the remainder of your library sells much  \nbetter, right? At least you've said before that your overall  \nsales are great - and that's enviable, not laughable.\n\nNick, we're different. If trying to help somebody else  \nunderstand something is a foreign concept to you, don't  \nthink that everybody on the planet is like that. Yes, I  \ncan, and do help people I don't like - if maybe mostly  \nbecause that helps ME become better. How many  \ntimes have I propped up Panoptica, Richler and  \neven Iowan Oldstyle? Blame my mother I guess.\n\n\\> Right, popular faces sell more. Doh.\n\nBut the association you're skirting is that TRENDY,  \nas in fashionable, hip, faces (of which Aziz's font is  \nNOT one) are the popular ones.\n\nThe consolation is that these fonts  \nalso tend to be forgotten quickly.\n\n\\> obscure products can succeed\n\nFinancially, as a rule, obscure <cite>fonts</cite> cannot.\n\nMake an Arabic font, even a trendy one, and let's see if  \nyou make one month's rent or mortgage on it in 10 years.\n\nhhp\n\n"
    },
    {
      "time": "20 Apr 2006 — 2:08pm",
      "content": "_Here’s the variety for you: in Western Europe and the US\\* people buy fonts, in the rest of the world they don’t. :-/_\n\nAgain, I'll pass on my experience -- Mostly in the US, but also this year I've sold fonts through Myfonts to people in Canada, Japan, Austria, Singapore, Australia, NZ, Switzerland, Puerto Rico, Finland, and Belgium. That's for fonts with Latin encoding. I leave it to Aziz to figure out where the Arab communities and Arab printers/publishers are.\n\n_How many times have I propped up Panoptica, Richler and even Iowan Oldstyle?_\n\nIs that like investing in insult credits?\n\n_Make an Arabic font, even a trendy one, and let’s see if you make one month’s rent or mortgage on it in 10 years._\n\nI don't know anything about Arabic fonts, or the market for them. But if there is any market at all (rather than relying on the reputation of Linotype), then the method I have outlined -- self-publishing and Internet sales -- may be one way to access it. I tend to \\*believe\\* in the unexpected, so why not try and make it happen?\n\n"
    },
    {
      "time": "20 Apr 2006 — 2:27pm",
      "content": "_Here’s the variety for you: in Western Europe and the US\\* people buy fonts, in the rest of the world they don’t. :-/_\n\nAgain, I'll pass on my experience -- Mostly in the US, but also this year I've sold fonts through Myfonts to people in Canada, Japan, Austria, Singapore, Australia, NZ, Switzerland, Puerto Rico, Finland, and Belgium. That's for fonts with Latin encoding. I leave it to Aziz to figure out where the Arab communities and Arab printers/publishers are.\n\n_How many times have I propped up Panoptica, Richler and even Iowan Oldstyle?_\n\nIs that like investing in insult credits?\n\n_Make an Arabic font, even a trendy one, and let’s see if you make one month’s rent or mortgage on it in 10 years._\n\nI don't know anything about Arabic fonts, or the market for them. But if there is any market at all (rather than relying on the reputation of Linotype), then the method I have outlined -- self-publishing and Internet sales -- may be one way to access it. I tend to \\*believe\\* in the unexpected, so why not try and make it happen?\n\n"
    },
    {
      "time": "20 Apr 2006 — 3:24pm",
      "content": "\\> Canada, Japan, Austria, Singapore, Australia,  \n\\> NZ, Switzerland, Puerto Rico, Finland, and Belgium\n\nAll affluent countries. There's a reason Malaysia, Jordan  \nand Ecuador are absent, and it's not because they don't  \nuse Latin fonts - they certainly do.\n\nBTW, if you'd like an actual list, look at the middle of this page:  \n [http://www.atypi.org/20\\_join\\_atypi/50\\_individual](http://web.archive.org/web/20140809174222/http:/www.atypi.org/20_join_atypi/50_individual \"http://www.atypi.org/20\\_join\\_atypi/50\\_individual\") \\_  \nIn fact why do you think ATypI makes such an exception?  \nKnow that it didn't come easy - there was resistance at  \nthe highest levels. But in the end it was so clearly just  \nthat plain common sense prevailed.\n\nSee what proportion of fonts you sell to THAT collection of  \ncountries (which coincidentally form the crushing majority  \nof this planet's population). I'm sorry, but no amount of  \nmelifluous serenades about \"the unexpected\" is going to  \nchange that reality.\n\n\\> Is that like investing in insult credits?\n\nPerhaps in a blindered, one-dimensional, one-upmanship world.  \nIn my world, the compliments and \"insults\" (your term) come from  \nthe same place: plain old honesty. If that fact seems... otherworldly,  \nthen I'm sorry to see such an attitude.\n\nhhp\n\n"
    },
    {
      "time": "20 Apr 2006 — 8:16pm",
      "content": "_I’m sorry, but no amount of melifluous serenades about “the unexpected” is going to change that reality._\n\nI wasn't addressing the rich country/poor country situation. I was correcting your assertion that only North America and Europe buy fonts.\n\n_plain old honesty._\n\nHow about plain old respect for other people?\n\n"
    },
    {
      "time": "21 Apr 2006 — 2:08am",
      "content": "First, please feel free to call me Aziz,  \nThen, tell me frankly:  \nIf you can get a free-copy of a cheap software—let alone the expensive one—,  \nwill you pay for it to the Author?  \nAll the best.\n\n"
    },
    {
      "time": "24 Apr 2006 — 11:01am",
      "content": "To go back abit:\n\nAziz Mustafa wrote:\n\n\\>\\>Uncompromising Arabic Font\n\nA better approach to Arabic fonts and Arabic typography is to ensure wide open options availability. We must ensure that users have options. Saying this I must congratulate Aziz on his great hard work. But “uncompromising Arabic fonts” is not the correct phrase. Perhaps \"Uncompromising Calligraphic or traditional Quraanic Arabic font\" would be better. Aziz fonts are uncompromising in their quality as related to a certain Arabic Quraanic calligraphic style but they not uncompromising fonts as Arabic fonts. Indeed they compromise technology and its economic factor, literacy, education, and global competition.  \nTraditional Arabic poetry is beautiful, but “free” Arabic poetry can be as beautiful. Both are Arabic poetry. Same goes for Arabic typography, we need to open options to the users. Arabic typography should not be defined rigidly.\n\n\\>\\>As the strength of a chain lies in its weakest link, the Quality of an Arabic font lies in its poorest feature: Ligatures , Diacritics Positioning and Kerning?\n\nLigatures, are both strength and weakness. Strength calligraphically but weakness typographically. Technology almost passed Arabic by because of insistence on institutionalizing complexity as the norm. Arabic should not be hostage of technology, it should instead emphasize simplification to conquer technology. In fact Arabic history adapted to new factors.\n\n\\>\\>need no space between the words: one would simply understand where a word ends and the next one starts.\n\nEven the greatest quraanic and calligraphic Arabic test can significantly benefits from spaces. There is a need for space.\n\nNick Shinn wrote:\n\n\\> If your font is as good as you say it is, there should be enough of a market\n\nHrant wrote:\n\n\\>\\>Not really. Simply because high culture is not very marketable (like you should be realizing with Panoptica). Certainly, “good” doesn’t equate to “trendy”. In fact sometimes, Really Good stuff simply has to be given away. And other times it’s sadly not a good fit to the devious and capricious retail market.\n\nDear hrant. I am confused. In another Forum and discussion, you attacked Mr. Thomas Milo, a pioneer Arabic caligraphic typfaces designer for decades dismissing even the need for Quraanic and calligraphic Arabic fonts. Why Aziz’s fonts are different now?\n\n-Saad\n\n"
    },
    {
      "time": "24 Apr 2006 — 9:07pm",
      "content": "\\> Ligatures ... weakness typographically.\n\nThat's a Modernist fallacy.  \nSome very recent related material: [http://typophile.com/node/19376](http://web.archive.org/web/20140809174222/http:/typophile.com/node/19376 \"http://typophile.com/node/19376\")\n\n\\> Arabic should not be hostage of technology\n\nAnd neither should readers.\n\nBTW, a hostage can't exactly liberate himself by becoming servile!\n\n\\> dismissing even the need for Quraanic and calligraphic Arabic fonts.\n\n1) Look through my previous posts in this thread, and try to find any place where I say that I actually like Aziz's font... A good critic helps a person get to where that person wants; he does not dismiss, he does not coerce; but he does educate and warn along the way. Taming one's own ideals is the key to becoming a good critic, for the simple reason that personal context is everything, and nobody is infallible or omniscient. Basically, it's an act of sharing, not shepherding.\n\n2) The argument with Thomas was messy and emotional (especially when he lapsed into historical revisionism on occasion - as you yourself complained back then) but as far as I remember my point wasn't to dismiss anything, but to ask that people not engage in historicism for its own sake, ignoring the current sociopolitical needs of users, and also that whatever path they choose, they realize and admit its full effects. To me Thomas's \"problem\" is that his work in effect (if not really necessarily) engrains chirography to the depths of the bones of visible language, where I feel that even its presence in the outer skin is a problem! This, whether anybody realizes it, admits it, or not.\n\nTo his great credit however, if you remember, Thomas had the grace and humility to admit that perhaps chirography is not as good a foundation for his scheme as would be readability. I wish that other people -including myself- could be that way more often.\n\n————\n\nToday, learn about the Armenian Genocide:  \n [http://www.armenian-genocide.org/genocidefaq.html](http://web.archive.org/web/20140809174222/http:/www.armenian-genocide.org/genocidefaq.html \"http://www.armenian-genocide.org/genocidefaq.html\")\n\nhhp\n\n"
    },
    {
      "time": "24 Apr 2006 — 11:42pm",
      "content": "Just few points for Saada!  \n1. Spaces should be exploited not sacrificed.  \n2. What is wrong with my font? It does:  \n\\> go well with the Old and New Technology (Window 3.11 and WindowsXP).  \n\\> fulfill the requirements of Arabic Calligraphy and Typography,  \n\\> cover Arabic as well as Quranic Marks,  \n\\> work well on most Adobe, Microsoft Applications and Qurakexpress. Moreover  \n\\> look easy-on-the-eye, and will prove how easy-to-use.  \nWhat else?  \nOr should I dance to the tunes of the English-like Arabic Fonts Designers?!  \nThanks with [Flowers](http://web.archive.org/web/20140809174222/http:/www.crauswords.com/flowers/WFlowers.htm)\n\n"
    },
    {
      "time": "25 Apr 2006 — 9:16am",
      "content": "\\> should I dance to the tunes of the English-like Arabic Fonts Designers?!\n\nNo, please not that! :-)  \n [http://www.themicrofoundry.com/ss\\_rome3.html](http://web.archive.org/web/20140809174222/http:/www.themicrofoundry.com/ss_rome3.html \"http://www.themicrofoundry.com/ss\\_rome3.html\")\n\nBut is there not a third way? Not that it's easy  \nto figure out; even a know-it-all smart-aleck  \nlike me is totally stumped on this! :-)\n\nBut let's wait to see the Dubai results...\n\nhhp\n\n"
    },
    {
      "time": "25 Apr 2006 — 9:50am",
      "content": "Hrant Wrote:  \n\\> Arabic should not be hostage of technology  \n\\>\\> And neither should readers. BTW, a hostage can’t exactly liberate himself by becoming servile!\n\nIf Arabic is hostage of technology then \\*users” of Arabic technology become the same. I do not see your statement in disagreement of mine. To clarify mine further, when Arabic or any other script editing and production on computers requires costly and technically sophisticated technologies we risk loosing users, markets, global competitions, and a lot of unnecessary expenses. Complex Chinese jumped to the web before Arabic! Arab petro-dollars spent billions to ensure that letters like “Dal” must have an isolated, initial, medial, and more glyphs. Why?\n\n\\> dismissing even the need for Quraanic and calligraphic Arabic fonts.  \n\\>\\>1) Look through my previous posts in this thread, and try to find any place where I say that I actually like Aziz’s font…\n\nDear Hrant, funny you mention that. Yes I did notice that you did not say that you like Aziz fonts. On the other hand I loved them. My Question was why did you attack Thomas work and passion for calligraphic and Quraanic typography but had nice words for Aziz’s similar work. This was my confusion. In that debate you even denied that Arab users need Thomas calligraphic fonts.\n\nAziz wrote:  \n\\>2. What is wrong with my font?\n\nAbsolutely nothing wrong. Despite my non calligraphic font designs, I love Arabic calligraphy and support strongly Thomas’s or your works. Arabic fonts must include both. Non should imply or hint that Arabic fonts must follow a set of rules, or they must follow calligraphic rules. Your “uncompromising Arabic fonts” title tells the reader that other non calligraphic fonts are “compromising Arabic fonts” which brought up my disagreement.\n\n\\>Or should I dance to the tunes of the English-like Arabic Fonts Designers?!\n\nDance as you like and wish as long as you do not trip and do not push or hurt other dancers in the floor. Dance is healthy for us all  \nAs for “English-like”, that is your opinion. Even if it is true I do not see why “English-like” or even “Chinese-like” is a problem here. Arabic is a great script that had adapted survived because of its great adaptability qualities. Remember font design is about options. Users options.\n\n"
    },
    {
      "time": "25 Apr 2006 — 10:15am",
      "content": "\\> I do not see your statement in disagreement of mine.\n\nWhat I meant (and one place I thought we were disagreeing) is that  \nit doesn't make sense to for example disjoin Arabic simply because  \nWestern technology (not to mention business) would like us to.\n\n\\> why did you attack Thomas work and passion for calligraphic and  \n\\> Quraanic typography but had nice words for Aziz’s similar work.\n\nWell, I can think of a few reasons, one being that I was/am not being even-handed enough. But other reasons are: like I said, Thomas is engraining chirography much more deeply; and Aziz and Thomas have different contexts, and are asking for different things (or not asking for anything\\*); Aziz for example seemed confident (too confident?) in the integrity of his design, and was actually mainly asking for marketing advice. I guess I was trying to encourage a relative unkown simply by saying that the effort is appreciated; passion is the key, and it can drive future development, often in better directions; like how I used to make cruddy Armenian fonts (I mean really cruddy - not like Aziz's work at all) and people encouraged me, so I kept at it, and now make totally different, and I think much more mature, Armenian fonts.\n\n\\* An \"arty\" attitude which is itself objectionable.\n\n\\> In that debate you even denied that Arab users need Thomas calligraphic fonts.\n\nI try to never be that absolute (I think even  \nHelvetica has its uses :-) so I don't think I  \nsaid such a thing. But if I did, I was wrong.\n\n\\> Dance as you like and wish as long as\n\nBut also, do not dance alone, in a private expressive vacuum.  \nThat's not Design; and it's very selfish.\n\nhhp\n\n"
    },
    {
      "time": "25 Apr 2006 — 11:17am",
      "content": "Hrant Wrote:\n\n\\>\\>it doesn’t make sense to for example disjoin Arabic simply because  \nWestern technology (not to mention business) would like us to.\n\nFont design should be open. Users options should be open. What makes sense to some makes no sense to others. Technology and business are technology and Business. There are no \"western technology\" or \"western Business\". Just as Algebra and Chemistry are sciences not \"Arabic Sciences\" because they were historically developed by the Arab Muslim civilization.\n\n\\>\\>I guess I was trying to encourage a relative unkown simply by saying that the effort is appreciated; passion is the key, and it can drive future development, often in better directions;\n\nI have no doubt of your passionate and good natured manner, Hrant. That is why I was a bit surprised at your severity at that debate. Like you, my first comment to Aziz was \"congratulations\" too.\n\n\\>\\>But also, do not dance alone, in a private expressive vacuum.\n\nYou can do that too. It is healthy.\n\n-Saad\n\n"
    },
    {
      "time": "25 Apr 2006 — 11:23am",
      "content": "Saad, are you sure you're from Iraq?  \nBecause your outlook seems way too rosy! :-)\n\n\\> You can do that too. It is healthy.\n\nSure, but keep it private. Or if you feel the need to  \nshow it, don't pretend it's anything more than Art.\n\nhhp\n\n"
    },
    {
      "time": "25 Apr 2006 — 11:38am",
      "content": "Hrant wrote:\n\n\\>\\>Saad, are you sure you’re from Iraq?  \nBecause your outlook seems way too rosy! :-)\n\nI do not see the font debate connection here. But still even in Iraq I am still an optimist: Bush's occupation has been a splendid failure thanks to the Iraqi heroic resistance! And as usual persistance works.\n\n-Saad\n\n"
    },
    {
      "time": "25 Apr 2006 — 11:53am",
      "content": "_Then, tell me frankly:  \nIf you can get a free-copy of a cheap software—let alone the expensive one—,  \nwill you pay for it to the Author?_\n\nYour question depends on whether the software is legally free, or \"free\" because it is pirated.  \nFor my business, there are enough people, here and there, around the world, who are not software pirates, who buy my fonts.  \nI have described what works for me, with Latin-script fonts, some of which are trendy, some of which are experimental, and some of which are straightforward.  \nYou will have to figure out how your situation compares with mine -- and decide if my business model can be used, or adapted, to work for you. Hopefully, I have given you some useful perspective. Good luck!\n\n"
    },
    {
      "time": "25 Apr 2006 — 12:08pm",
      "content": "By English-like Arabic, I meant behavior, not shapes!  \nArabic kids do not dance alone , in a private expressive vacuum.  \nContrary to English, they twist and turn for Ligatures.\n\n"
    },
    {
      "time": "25 Apr 2006 — 12:45pm",
      "content": "\\>\\>By English-like Arabic, I meant behavior, not shapes!  \nArabic kids do not dance alone , in a private expressive vacuum.  \nContrary to English, they twist and turn for Ligatures.\n\nMore of the same. Speaking and generalizing on behalf of users and the entire universe! Defining Arabic font taste, rules, history and future based on personal preferences!\n\nAgain the right approach for Arabic typography in my judgment is to ensure the availability of options through hard work.\n\n-Saad\n\n"
    },
    {
      "time": "25 Apr 2006 — 1:11pm",
      "content": "\\> here and there, around the world\n\nMore like here and here - only certain parts of the world. And critically in terms of your advice: generally not where Arabic is used. Don't get me wrong, it's very nice of you to offer advice, but be willing to modify it based on reality - based on the <cite>experience</cite>, as you say, of others.\n\n\\> to ensure the availability of options through hard work.\n\nAnd good ideas.  \nBut Saad, still, some options are more relevant and  \nneeded than others - saheeh amma la' ya khayyi? :-)\n\nhhp\n\n"
    },
    {
      "time": "25 Apr 2006 — 1:53pm",
      "content": "_but be willing to modify it based on reality_\n\nFor goodness sake Hrant get off my case and stop lecturing me.  \nI don't think Aziz is the idiot you seem to think he is, and is quite capable of understanding what I have to say, without your paraphrasing.\n\n_generally not where Arabic is used_\n\n[http://www.girlguides.ca/default.asp?id=325](http://web.archive.org/web/20140809174222/http:/www.girlguides.ca/default.asp?id=325 \"http://www.girlguides.ca/default.asp?id=325\")\n\n"
    },
    {
      "time": "25 Apr 2006 — 2:12pm",
      "content": "What \"idiot\", what \"paraphrasing\"? What <cite>you</cite> have told him is simply <cite>misleading</cite>, and I think you've actually come to realize that in fact. Except the simplest \"I was sort of wrong\" could never cross your lips I guess.\n\nI'm not \"on your case\", I just find myself having to do  \ndamage-control with you all the time - it's quite tedious!\n\nhhp\n\n"
    },
    {
      "time": "25 Apr 2006 — 3:46pm",
      "content": "_what “paraphrasing”?_\n\nNick: \"here and there, around the world\"  \nHrant: \"here and there - only certain parts of the world\"\n\nEver the pedant (as Lorenza noted), you're splitting hairs.\n\nNick: \"what works for me, with Latin-script fonts\"  \nHrant: \"in terms of your advice: generally not where Arabic is used\"\n\nI think Aziz is aware that Arabic is not a Latin script, without your having to point it out.\n\n_What you have told him is simply misleading,_\n\nThere is nothing deceptive about what I've said.  \nI have been very open in explaining how my business works, and I can assure you that none of what I said is false.\n\n"
    },
    {
      "time": "25 Apr 2006 — 9:21pm",
      "content": "To Nick Shinn,  \nAm Confused. What is your site all about?  \nFonty Girls and/or Girly Fonts?  \nThanks with [Flowers](http://web.archive.org/web/20140809174222/http:/www.crauswords.com/flowers/WFlowers.htm)\n\n"
    },
    {
      "time": "26 Apr 2006 — 12:06am",
      "content": "Yes, the Girl Guides of Canada are good fonty girls, and they use good girly fonts (Fontesque, of course).\n\n"
    },
    {
      "time": "26 Apr 2006 — 12:46am",
      "content": "In reply to Saad,  \n\\> More of the same. Speaking and generalizing on behalf of users and the entire universe! Defining Arabic font taste, rules, history and future based on personal preferences!  \nYour words has reminded me with my over-intelligent blood-brother when he looked at the Map of the Earth one day and said:  \nIf God is All-Knowing, then why does the earth look like this?\n\n\\>Again the right approach for Arabic typography in my judgment is to ensure the availability of options through hard work.  \nWhat options?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nIn reply to Nick,  \nStill Confused?  \nWhere are your Girly Fonts?  \nWhat are you doing there: Mother of All Girls?  \nOr One of the Outstanding Fonty Girls?  \nPlease put me in the right direction.\n\n"
    },
    {
      "time": "26 Apr 2006 — 10:56am",
      "content": "_why does the earth look like this?_\n\nYeah, Europe and Asia are too closely kerned :-)\n\n_Where are your Girly Fonts?_\n\n ![](http://web.archive.org/web/20140809174222im_/http:/typophile.com/files/chik.png)\n\n ![](http://web.archive.org/web/20140809174222im_/http:/typophile.com/files/chil.png)\n\n ![](http://web.archive.org/web/20140809174222im_/http:/typophile.com/files/chim.png)\n\n"
    },
    {
      "time": "26 Apr 2006 — 11:23am",
      "content": "\\> Europe and Asia are too closely kerned\n\nLucky Europe. Hopefully this helps the West maintain a view into Reality.\n\nBTW, to me calligraphic Arabic is as feminine as writing gets.\n\nhhp\n\n"
    },
    {
      "time": "26 Apr 2006 — 9:10pm",
      "content": "Though Europe and Asia are too closely kerned, still we very-3 seldom see a Japanese with sharp nose or a British with horizontal eyes!  \nOne of God signs is the creation of the heavens and earth and the variety of our Tongues and Hues (Languages and Colors). Surely in that are signs to All of us.\n\n"
    },
    {
      "time": "26 Apr 2006 — 10:35pm",
      "content": "Humans have very little variety of colour, compared to some other species. Birds, for instance. (It's more a question of tone.)  \nHowever, we have make-up and dyed hair, and genetic engineering will be able to create people with fluourescent green skin.  \nSpeaking of tongues...  \n [http://www.usatoday.com/tech/science/discoveries/2006-04-24-tongue-resea...](http://web.archive.org/web/20140809174222/http:/www.usatoday.com/tech/science/discoveries/2006-04-24-tongue-research_x.htm \"http://www.usatoday.com/tech/science/discoveries/2006-04-24-tongue-research\\_x.htm\")\n\n"
    },
    {
      "time": "26 Apr 2006 — 11:39pm",
      "content": "Poor Man, It took him centuries to discover himself.  \nAnd more time to Copy (not Create) Bodies (not Hearts)?!  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nJust a fonty joke:  \nA gentleman met a lady at a coffee shop...  \nAfter a while, the lady followed the gentleman to his apartment.  \nBefore Kerning and ligatures, the gentleman said: Frankly, My teeth are false!  \nThe lady replied: Never mind! My hair and teeth are false!  \nSoon the gentleman apologized for a forgotten appointment and the 2 got away after Marks Positioning!  \nHappy Posting\n\n"
    },
    {
      "time": "27 Apr 2006 — 11:48am",
      "content": "Aziz wrote:\n\n\\>\\>Your words has reminded me with my over-intelligent blood-brother when he looked at the Map of the Earth one day and said:  \nIf God is All-Knowing, then why does the earth look like this?\n\n\\>\\>What options?\n\nif you are really looking for answers, may be you should ask your \"over-intelligent blood-brother\".\n\n-Saad\n\n"
    },
    {
      "time": "27 Apr 2006 — 12:38pm",
      "content": "To Saad,  \nWell, 1+1=2 and 1-1=0.  \nAll the best.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nTo Hrant H Papazian,  \nMiss you. Hope everything is OK with you.\n\n"
    },
    {
      "time": "27 Apr 2006 — 7:46pm",
      "content": "Sorry Saad for my Slow Digestion  \nNow I come to understand what you meant by “pErS0na7 PrEfeREnCe5” and “@VAilabIlItY 0F oPtI0N5”.\n\n"
    },
    {
      "time": "2 May 2006 — 1:11am",
      "content": "Spicing \"The Truth shall set you free\" by Rodrigue Planck, I hope I have answered All the Friendly Marketing Proposals.  \nEnjoy reading:  \n [http://typophile.com/node/19246](http://web.archive.org/web/20140809174222/http:/typophile.com/node/19246 \"http://typophile.com/node/19246\")\n\n"
    },
    {
      "time": "3 May 2006 — 5:21pm",
      "content": "<cite>I’m not “on your case”, I just find myself having to do<br>\ndamage-control with you all the time - it’s quite tedious!</cite>\n\nNo one asked you for damage control, American.\n\n<cite>Lucky Europe. Hopefully this helps the West maintain a view into Reality.</cite>\n\nAsia is reality? What's your point? You just say things to instigate, and you only do it because you have nothing useful to say.\n\n<cite>the US* * I’m including Canada. ;-)</cite>  \nIs the smily because you're happy to be ignorant? Take a look at a map now and then.\n\n"
    },
    {
      "time": "4 May 2006 — 11:31am",
      "content": "I'm reminded nicely of one of the best lines in the already  \ngenerally superbly scripted \"The Saint\" (1997), when the  \npatazkukha says: \"You are not <cite>people</cite>, you are Americans.\"\n\nhhp\n\n"
    },
    {
      "time": "5 May 2006 — 8:54pm",
      "content": "Peace be on All,  \nPlease stop fighting and posting off-topic comments.  \nEnough GunSmoke?! Try the Power of [Flowers](http://web.archive.org/web/20140809174222/http:/www.crauswords.com/flowers/WFlowers.htm)\n\n"
    }
  ]
}
