{
  "id": "19344",
  "title": "Condensed fonts for corporate identity",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m considering a condensed font for a corporate identity application. It’s main uses would be the logotype (but this could also be regular width) on screen as headers and headlines, stationary materials (card, letterhead, envelopes, etc.), printed documents like one-page proposals and brief contracts (less than ten pages), and possibly some small format promotional materials.\n\nI like the character of the condensed version better than it’s normal width sibling, and while I’m sure they could be used n combination quite effectivley, I’m wondering if I can pull it off with just the condensed width. It is available in a wide range of weights (thin, light, normal, semi-bold, bold, black, and extra black).\n\nThe two word logo will probably pair this font (but possibly in the regular width) with another font likely more of a thick brush stroke style.\n\nI’d like your opinions about the pros and cons of using a condensed font for a project of this nature, and really just some general feedback about condensed fonts and how they are used most effectivley.\n\nRegards,\n\n-t\n\n [‹ magazine layout help](http://web.archive.org/web/20081208182843/http:/typophile.com/node/19005 \"Go to previous forum topic\") [Selecting a Font... where to start? ›](http://web.archive.org/web/20081208182843/http:/typophile.com/node/19323 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081208182843/http://typophile.com/user/1235\" title=\"View user profile.\">timfm</a>",
  "time": "<br>",
  "uid": "1235",
  "comments": [
    {
      "time": " 18.Apr.2006 7.29pm",
      "content": "I’m guessing you already have a font in mind form your post?\n\nWhile I see the benefit of having condensed fonts as part of a a family for a corporate font, I’ve never given it much consideration as part of the identity. I like identities to read well and to be useable at small sizes, something condensed or compressed fonts don’t always do. I think it’s fine to use condensed for small amounts of copy but would be leery of using it for a publication of several pages or more.\n\n"
    },
    {
      "time": " 19.Apr.2006 8.05pm",
      "content": "I do have a font in mind: Monitor by Our Type. I see your point about repro at small sizes. That’s why I was thinking the logotype should use the regular width. How much would you consider to be “small amounts of copy?” Headline, sentence, paragraph, page?\n\n"
    }
  ]
}
