{
  "id": "19354",
  "title": "\"Schoolbook\" Alternates",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm curious to find out what other typophiles think of [Bembo Schoolbook](http://web.archive.org/web/20131106065656/http:/www.myfonts.com/fonts/agfa/bembo-mt/schlbk/) with it's altered a, g & y. I know that some people believe that these letterforms are easier for children to read. I am not among that number. But is there any good reason to make these alternates available? are there better-looking versions that what we see in Bembo Schoolbook?\n\n",
  "author": "paul d hunt",
  "time": "19 Apr 2006 — 8:01am",
  "uid": "7006",
  "comments": [
    {
      "time": "19 Apr 2006 — 8:14am",
      "content": "I wonder if any writing teachers start their pupils out with binocular \"g\"s.  \nSurely the single storey g and q are too similar -- a fact attested by the addition of a check-mark to the q, which has to be later unlearned, a pedagogic kludge if ever there was one.  \nWhat can be so hard about drawing two circles and connecting them with a short line?\n\n"
    },
    {
      "time": "19 Apr 2006 — 8:33am",
      "content": "\\> What can be so hard about drawing two circles and connecting them with a short line?\n\nThat is how my 4yr old currently draws her cap B's.\n\n"
    },
    {
      "time": "19 Apr 2006 — 8:35am",
      "content": "[Sassoon](http://web.archive.org/web/20131106065656/http:/www.linotype.com/112290/sassoonfontfamilygroup-clan.html) looks good.  \nApparently children say they prefer the g, y and a forms of schoolbook fonts as they are now the handwritten forms, though they read no faster with them.\n\n"
    },
    {
      "time": "19 Apr 2006 — 8:40am",
      "content": "The altered glyphs in Bembo Schoolbook are ugly. That is what I think. They go against the rest of the typeface.\n\n"
    },
    {
      "time": "19 Apr 2006 — 8:54am",
      "content": "Oh, ecch! What is that? I agree with Paul.\n\nI think the least appealing aspect is having the same shape descender on the 'g' AND the 'y'; so much for distinct letterforms. What's wrong with a diagonally-tailled 'y'?\n\nBTW, I write single-storey 'g's, (surely they're easier for cursive writing, and therefore for speed), doesn't mean you have to abandon the double storey 'g' for typefaces derived from designs created in the metal days...\n\nHaving said that, we were all taught to write those single-storey 'a's as well, and at about the age of twelve I spontaneously switched to doing double-storey 'a's just because I felt they looked better. I still know they're slower for me to write than single-storey ones would be but what the heck it's a habit now...  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "19 Apr 2006 — 9:03am",
      "content": "i think more than giving a reading edge, these alternate glyphs give a juvenile feel to the design.\n\n_The altered glyphs in Bembo Schoolbook are ugly. That is what I think. They go against the rest of the typeface._\n\nwould these be less appopriate in something such as Bookman?\n\n"
    },
    {
      "time": "19 Apr 2006 — 9:11am",
      "content": "I think such \"primary\" glyphs are useful (although certainly not in such a bookish face as Bembo) but only for absolute beginner readers (and only because they form the -sad- standard of current alphabet instruction). Once they've been learned, and the child (or foreigner) can read them quickly, they should be replaced by full print forms.\n\n\\> the addition of a check-mark to the q, which has to be later unlearned\n\nWell, I wish it didn't. (And does it really? I'd say it depends on us a bit.)  \nTo me the best \"q\" for reading is the one with a single-sided bottom serif.\n\n\\> these alternate glyphs give a juvenile feel to the design.\n\nWhich however is lost on the target readership, so that's not so bad.\n\nhhp\n\n"
    },
    {
      "time": "19 Apr 2006 — 9:23am",
      "content": "good points, hrant. thnx!\n\n"
    },
    {
      "time": "19 Apr 2006 — 9:24am",
      "content": "Alternate forms don't need to have a special purpose. They can be purely aesthetic, make a typeface new. When I saw [Plantin Schoolbook used in _Wallpaper_](http://web.archive.org/web/20131106065656/http:/typographi.com/000490.php), I said \"Wow, that looks and reads great. What is it?\" Turns out it was just the old standard with primary forms.\n\n"
    },
    {
      "time": "19 Apr 2006 — 9:29am",
      "content": "_i think more than giving a reading edge, these alternate glyphs give a juvenile feel to the design._\n\nGood point. And rather than be redundant, complexity might help learning, eg \"that's the letter that has two shapes, normal and superhero\".\n\n"
    },
    {
      "time": "19 Apr 2006 — 9:31am",
      "content": "\\> complexity might help learning\n\nAt the right learning point.  \nAnd it certainly helps immersive reading.\n\nhhp\n\n"
    }
  ]
}
