{
  "id": "19359",
  "title": "Nebiolo rights",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Does anybody know who -if anybody- currently owns the rights to  \nthe old metal-era [Nebiolo](http://web.archive.org/web/20101114204828/http:/typophile.com/wiki/Nebiolo) fonts? I know that Simoncini's rights  \nwere split up between a couple of other font houses, but I know  \nnothing about Nebiolo.\n\nhhp\n\n",
  "author": "<a href=\"/web/20101114204828/http://typophile.com/user/1250\" title=\"View user profile.\">hrant</a>",
  "time": "<br>",
  "uid": "1250",
  "comments": [
    {
      "time": "",
      "content": "Hrant\n\nI have a Eurostyle digitized font in a Nebiolo folder. I can't recall, or find, who the licensing foundry was. But, it is there. Someone somewhere licensed some of it.\n\n"
    },
    {
      "time": "",
      "content": "A \\*bump\\* for this thread, as I would be interested in knowing this as well.  \nI am pretty sure that some of the more famous ones, like Microgramma / Eurostile, were ( sub ) licensed.\n\n_( I bought a printed vintage Nebiolo type specimen, some time ago, featuring some lovely, hidden / unseen treasures. :) By the way, If someone is interested in 'exchanging' / sharing scanned pages from such specimen books, please let me know. Thank you. )_\n\nDav\n\n"
    },
    {
      "time": "",
      "content": "Gerald, since -I presume- Eurostile was licensed by third-parties  \nbefore Nebiolo's folding (in 1977, apparently) I'm not too worried  \nthat one of those parties took over any <cite>rights</cite>, especially not of the  \nentire library. That's unlikely to have made sense for either side.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant, I tried doing a little research on any new revivals of Societa Nebiolo faces and only came up with a Sept. 2005 release of [Pendulum](http://web.archive.org/web/20101114204828/http:/www.canadatype.com/news/0509.php) from Canada Type (who also released a revival of VGC's Eight Ball!?). Not sure what [Rebecca Alaccari](http://web.archive.org/web/20101114204828/http:/www.canadatype.com/about.php) did regarding original licensing so you might try contacting her.\n\nDuring the late eighties, Aldo Novarese was making attempts to license both Eurostile and Microgramma to Compugraphic (we met a few times and kept corresondences), but whether or not he had actual rights of licensing any Nebiolo designs he hadn't made completely clear to me.\n\n"
    },
    {
      "time": "",
      "content": "Norbert, thanks. I actually learned of the Canada Type  \nconnection via Devroye's site, but I haven't contacted  \nthem yet. I have a feeling it's a... free-wheeling effort.\n\nThe Compugraphic episode is interesting, if Nebiolo did  \nindeed fold before that; I suspect ol' Aldo was trying to  \nraise some quick cash on the side...\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> _I suspect ol’ Aldo was trying to raise some quick cash on the side_.\n\nSadly, that was the case with several revered type designers whose royalties from other foundries were meager to begin with. At CG, I worked with [Tony Stan](http://web.archive.org/web/20101114204828/http:/www.myfonts.com/search?search%5Btext%5D=tony+stan) (Stanziola) on the release of his last type family, Pasquale, named after his father. Also, [Vincent Pacella](http://web.archive.org/vincent%20pacella) had been hopeful in developing a releasing some of his own designs through CG.  \nThere were many type designers from around the world, both known and yet-to-be known that I had the pleasure of meeting.\n\nAlso, a young [Garrett Boge](http://web.archive.org/web/20101114204828/http:/www.myfonts.com/person/boge/garrett/) was knocking at the door in 1989. I still have his early sketches of [Visage, Spring, and Florens](http://web.archive.org/web/20101114204828/http:/www.myfonts.com/browse/person/boge/garrett/).\n\n"
    },
    {
      "time": "",
      "content": "<cite>Not sure what Rebecca Alaccari did regarding original licensing so you might try contacting her.</cite>\n\nI am on the outside of things like this, but am curious, why would anyone need to worry about digitizing the lines of an old metal font? People do it all the time, and some have made it a career.\n\n"
    },
    {
      "time": "",
      "content": "Hrant - I've had brief communication with the Canada Type people and they seem friendly and responsible.\n\n"
    },
    {
      "time": "",
      "content": "fontplayer\n\nIn some cases, typefaces from the metal years went through further transformations; photofilm, digital. And the licensing of these typefaces generated further income. Infringement could involve one in legal hassles.\n\nHere is a hypothetical case: a very well known and long-lived typeface from a very well known firm is suspected of being based on someone else's drawings. Since this face had been licensed and cross-licensed over the years, if someone could make the claim that the very well known typeface itself was an infringement of this previous design that they had legal rights to, and won an entitlement, they could very well seek compensation based on all moneys made over the years.\n\nYes people do copy metal faces all the time, and sometimes they get a letter from a law firm. If rights had been established and there is a legal continuance of those rights, as in licensing, copying a metal face is as wrong, and potentially as dangerous, as copying a digital face.\n\n"
    },
    {
      "time": "",
      "content": "Ah, thank you.\n\n"
    },
    {
      "time": "",
      "content": "\\> In some cases, typefaces from the metal years went  \n\\> through further transformations; photofilm, digital.  \n\\> And ...\n\nGood point.  \nAnd I'll certainly be doing more research,  \nincluding contacting a grand-daughter, etc.\n\nFortunately, this particular design apparently never made it past metal. In fact the reason there's no digital version is probably due simply to the fact that there was never a photo version! These days people will much more rarely bother with reviving a metal face (especially one that's hard to find actually used extensively).  \nBecause you need to physically find it, and then print it!\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> the Canada Type people ... seem friendly and responsible.\n\nGood to know - thanks.\n\nThey also seem like they can put out impressive work:  \n [http://www.myfonts.com/fonts/canadatype/treasury/](http://web.archive.org/web/20101114204828/http:/www.myfonts.com/fonts/canadatype/treasury/ \"http://www.myfonts.com/fonts/canadatype/treasury/\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Looks like Rebecca has the bug. Someone doing similar stuff (to the Treasury set) is Michael Hagemann at Fontmesa. He puts a lot of work into making sure all the fills etc. line up correctly.\n\n"
    },
    {
      "time": "",
      "content": "I have been told that royalty checks that were mailed to Nebiolo from Letraset during the 70s and 80s were returned as undeliverable. But that could just be a comment on the efficiency of the Italian Post Office at that time.\n\n"
    },
    {
      "time": "",
      "content": "_why would anyone need to worry about digitizing the lines of an old metal font?_\n\nbecause in some cases, the designers are still alive and depriving them from profiting from their own designs is unethical.\n\n"
    },
    {
      "time": "",
      "content": "The points above and below both make perfect sense. Thanks.\n\n"
    },
    {
      "time": "",
      "content": "Also, sometimes the children or others heirs of these designers are also active in the design community. The often give their blessings to new, third-party digitizations, but they sometimes have the right to say no. So, it is always polite to ask first before you digitize, presuming that there is someone to ask.\n\n"
    },
    {
      "time": "",
      "content": "Wow... [Treasury](http://web.archive.org/web/20101114204828/http:/www.myfonts.com/fonts/canadatype/treasury/)!\n\nThat's a real blast from the past for me. I remember at one of my earliest jobs at a newspaper they used to subscribe to one of the many \"clip art\" services. Frequently these services had repro sheets of very funky alphabets.\n\nTreasury was one of them, and I used it for some restaurant newspaper ad I pasted-up (with rubber cement... pre-hot wax days). A photostat of the Treasury specimen was sized, each letter cut out then pasted down to create a display head.\n\n"
    },
    {
      "time": "",
      "content": "Dan, good stance. Although there's always a line beyond  \nwhich one could be said to be making too great an effort.\n\nAnd what if the next-of-kin is/are not \"active in the design community\"?\n\n\\> they sometimes have the right to say no\n\nBut other times they need to be politely denied that choice.  \nThe key concept to me (yes, a subjective one, but such is life)  \nis \"reasonability\", without which we're really all doomed.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_\\> they sometimes have the right to say no_\n\nHere is what I was trying to get at with the words \"the right\": In some contries, it is easier to patent the design of a typeface than it is in the US. If someone gets a 25 year design patent, and dies 20 years into it, I believe that the patent would pass on to his heirs for the remaining 5 years. In this time, you could not redigitize/release the said design without their consent.\n\n"
    },
    {
      "time": "",
      "content": "What about that lovely, very typographic Nebiolo Jenson? Could someone revive that?\n\n"
    },
    {
      "time": "",
      "content": "\\> _So, it is always polite to ask first before you digitize, presuming that there is someone to ask._\n\nAgreed, but without opening another can of worms, there have been those who claimed \"rights\" in the past who have denied revivals strictly based on \"type politics\".\n\nOne of the only type families that I personally wanted to revive (strictly out of affection) is [Hispalis](http://web.archive.org/web/20101114204828/http:/www.neufville.com/FontData/FONTS_AZ.htm#H) originally from Fundición Tipográfica Nacional, with rights held by Neufville. A visit to Barcelona in the eighties got me nowhere (my primary objective was to license Schneidler).\n\nSomehow it's still on Neufville Digital's list of \"to do\" digitizations, yet RoosterTypes has a somewhat sterilized revival version called [Schiller Antiqua](http://web.archive.org/web/20101114204828/http:/www.roostertypes.com/view_fullfont.asp?catalogid=1402&total=4) by Steve Jackaman.\n\nWhat I loved about the metal design was the eccentric \"irregularities\" which are often the first things to go when standardizing for digital.\n\nI know... sour grapes! :-\\\n\n"
    },
    {
      "time": "",
      "content": "Dan, I understand - and that make sense.  \nBut I thought you were talking about more than the legal sphere.\n\n\\> Could someone revive that?\n\nWell, I'll report here with what I find, for  \nwhoever might be interested in doing that.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant, did you ever find out anything?\n\n"
    },
    {
      "time": "",
      "content": "I love these blasts from the past. Makes me feel  \nyoung. Wait, that doesn't make sense. Anyway.\n\nI can't remember if my offer came before or after some delving I did concerning a shall-not-be-named font I was (and still am) hoping to revive. If it was before, then what I can tell you is: ask Linotype - apparently they took ownership of most of the Nebiolo stuff. If it was after, that means I got lazy and didn't actually follow up (and can't right now, sorry).\n\nhhp\n\n"
    }
  ]
}
