{
  "id": "19360",
  "title": "Illustrator View Feature",
  "forum": "Build",
  "tags": [

  ],
  "content": "Here’s a question for you Illustrator Pros. Is there an extension/plugin that adds web/screen resize views to the current view sizes.\n\nIn case you’re not following: Down in the bottom left there’s a pop-up menu with resize percentages ...100%, 150%, 200%, 300%, 400%... I’m curious if there’s a resize that works in web layout sizes like 800x600 or 1024x768 where it resizes your image to that percentage so that I don’t have to change my actual screen resolution to those sizes to get the idea.\n\nI’m not really sure how to search for such a feature or if it even exists (might be worthwhile to submit as a possible new feature for the upcoming releases.)\n\nAny ideas would be great.\n\n\\* Appreciate if you didn’t question my choice of using Illustrator to make web graphics, I prefer to start there then finish up in Photoshop. Thanks\\*\n\n [‹ All kerning lost after generating Truetype font for PC](http://web.archive.org/web/20080430221730/http:/www.typophile.com/node/16532 \"Go to previous forum topic\") [Fonts in Illustrator CS2 ›](http://web.archive.org/web/20080430221730/http:/www.typophile.com/node/17954 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080430221730/http://www.typophile.com/user/6496\" title=\"View user profile.\">Asvetic</a>",
  "time": "<br>",
  "uid": "6496",
  "comments": [
    {
      "time": " 19.Apr.2006 12.19pm",
      "content": "You **must** check out [xScope](http://web.archive.org/web/20080430221730/http:/www.iconfactory.com/xs_home.asp). I completely recommend it. I am _not_ a web designer, but have designed for the web and found it extremely useful.\n\n"
    },
    {
      "time": " 19.Apr.2006 12.30pm",
      "content": "Sounds cool, but not quite what I was looking for. I probably should have mentioned I’m on a PC right now, damned business offices are so afraid of Mac, to utter it’s name is to bring hellfire and brimstone down on the IT department (what a bunch of whine babies!)\n\n"
    },
    {
      "time": " 19.Apr.2006 4.57pm",
      "content": "Oh. I’m sorry. Well, there must be something like that.\n\n"
    },
    {
      "time": " 19.Apr.2006 5.01pm",
      "content": "Another workaround that I’ve used—pre-xScope—was create a layer that sits on top with a mask.\n\n"
    },
    {
      "time": " 19.Apr.2006 5.06pm",
      "content": "How about something like this: [http://www.microfox.com/](http://web.archive.org/web/20080430221730/http:/www.microfox.com/ \"http://www.microfox.com/\")\n\n"
    },
    {
      "time": " 20.Apr.2006 5.37am",
      "content": "Miss Tiffany, I really appreciate your suggestions, actually some of those tools seem really cool, but it’s still not quite what I’m looking for.\n\nI’m clearly not expressing my needs right.\n\nCurrently when I work in Illustator my monitor is set for 1280x1024 but most of the sites I do use a relative resolution of 800x600. When I work on them I have to switch my monitor resolution because I tend to make thing too large when I leave it at my original resolution. I hate loosing all that real estate in the larger resolution when I switch to the smaller resolution, so I was wondering if there was a quick Zoom/View feature that would allow me to keep my larger 1280X1024 resolution and only “zoom in” when I want to check to make sure I’m not making things too large. The work around I have now is thru my Video Card where I have to manually change the entire screen resolution (which usually takes a few seconds everytime, plus I don’t know how good that is for the video card to constantly switch back and forth between resolutions so frequently.\n\nI hope that makes sense. I just want to have a nice little button or drop-down menu in Illustator that just Zooms my image to simulate a different resolution from what I’m working in.\n\nThink Developer Tools extension for Firefox where you can resize the browser to different resolutions without actually changed the screen resolution.\n\n"
    },
    {
      "time": " 20.Apr.2006 7.00am",
      "content": "Can you not just set up the zoomed in, simulated 800x600 view, then create a new window (Window \\> New) for working at detail, switching to the zoomed in view when you need to preview?\n\nYou could also save the zoomed in view (View \\> New View).\n\n"
    },
    {
      "time": " 21.Apr.2006 5.59am",
      "content": "AHH... Thanks Elliot, that’s exactly what I was looking for. I didn’t think you could do that in Illustrator (I clearly had no clue.)\n\n"
    }
  ]
}
