{
  "id": "19371",
  "title": "A friend for Lexon",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "For a journal i have to design for september, i have choosen Storm's Lexon for body text. I wanted a solid face with a lot of personnality, and i think it works well. But Lexon is tricky to marry ; its bold being a sans (and headline) doesn't make choices easy. I want to use the headline version for the main titling, but i would need some others\\* — one for alternate titling, and some for specific titles, etc. And the more tricky thing is to find a good little texts sans, which would have ideally to be part of the alternate titling familly. I have quite the desire to find another serif as a compagnion, but matching two text serif looks hard to me. I have also thought about scripts which would have suitable versions for short texts, and i'm virtually open to any idea, all the more as i haven't to make that choice now.\n\n\\*ideally, if i had had some money, i would have loved to make Mr Storm expand the family to cover all i want, but…\n\n",
  "author": "ponofob",
  "time": "20 Apr 2006 — 5:16am",
  "uid": "1804",
  "comments": [
    {
      "time": "20 Apr 2006 — 3:51pm",
      "content": "What about DynaGrotesk?\n\n"
    },
    {
      "time": "21 Apr 2006 — 2:59am",
      "content": "It could match, i just have tested the possibility as i own a version of it, but i find it too pretty, too delicate, for this issue. The journal is the satirical one i speak about here : [http://typophile.com/node/19122](http://web.archive.org/web/20131020180747/http:/typophile.com/node/19122 \"http://typophile.com/node/19122\")  \nI d'like something more expressive, (Dyna is, but not the way i want).  \nThanks.\n\n"
    },
    {
      "time": "21 Apr 2006 — 3:56am",
      "content": "Hmmm... [Maple](http://web.archive.org/web/20131020180747/http:/www.processtypefoundry.com/typefaces/maple/index.html)?\n\n"
    },
    {
      "time": "21 Apr 2006 — 3:58am",
      "content": "or maybe SOPHISTO?\n\n[http://www.macrhino.com](http://web.archive.org/web/20131020180747/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\n"
    },
    {
      "time": "21 Apr 2006 — 4:41am",
      "content": "MMm, i didn't know Maple, it's very nice. But i don't know if it's not too wide for journal titling.  \nSophisto, i 've been thinking very seriously about it. I have tryed to use the pdf to make simulations on a specimen layout, but it not very easy. Stefan, i d'love to have french specimen in all styles, with dispay and text for testing it. [i looked at oxtail too]\n\n"
    }
  ]
}
