{
  "id": "19377",
  "title": "blackletter revival",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi :)  \ni’ve stumbled upon this site that contains several [blackletter](http://web.archive.org/web/20071010114323/http:/typophile.com/wiki/blackletter) faces by [manfred klein](http://web.archive.org/web/20071010114323/http:/typophile.com/wiki/manfred%252Bklein) and apparently more designers.  \nusually I’m very cautious of downloading free fonts because they are not always designed well. I’m not so familiar with klein’s work or reputation, and i just wanted to ask out of curiosity, what do you think about the faces in this site:  \n [http://moorstation.org/typoasis/blackletter/index.htm](http://web.archive.org/web/20071010114323/http:/moorstation.org/typoasis/blackletter/index.htm \"http://moorstation.org/typoasis/blackletter/index.htm\")  \nare they well designed, what do you think about the designer etc.  \nthanks  \nYaron.\n\n [‹ New interview with PMFKA](http://web.archive.org/web/20071010114323/http:/typophile.com/node/19404 \"Go to previous forum topic\") [A friend for Lexon ›](http://web.archive.org/web/20071010114323/http:/typophile.com/node/19371 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071010114323/http://typophile.com/user/9203\" title=\"View user profile.\">Yaronimus-Maximus</a>",
  "time": "<br>",
  "uid": "9203",
  "comments": [
    {
      "time": " 20.Apr.2006 12.15pm",
      "content": "for the most part i think they’re quick and dirty revivals. most likely just autotraced with minimal cleanup. that said, there are some great faces there that you may be hard-pressed to find anyplace else.\n\n"
    },
    {
      "time": " 20.Apr.2006 3.54pm",
      "content": "there was a time, where it was really hard to find “nice” blackletter, nowadys there are hype or at least called it “renaissance” of the “broken “one ;-) and manfred was one of those guys, giviing a sh”§ about zeitgeist, just having fun and helping the blackletter fonts to stay alive in digitalia, juts checkout also the “progothics”-guy ...\n\nactually have a look at [http://www.fraktur-mon-amour.com/](http://web.archive.org/web/20071010114323/http:/www.fraktur-mon-amour.com/ \"http://www.fraktur-mon-amour.com/\"), inclunding manfed kleins revivals and other great blackletter … its german, doooh but you get a cd with around 300 FREEfonts collect and/or made for the book - dont know this “manfred” guy, but i think he is cool …\n\ncheers  \ndaniel\n\n"
    },
    {
      "time": " 20.Apr.2006 8.33pm",
      "content": "i downloaded all of these about a year ago from the moorstation site. there’s a couple really nice script faces on there that i use often. i also used one of those blackletter faces just today in fact.\n\n"
    },
    {
      "time": " 20.Apr.2006 9.07pm",
      "content": "Manfred has some of the most wonderful free fonts on the internet. He also has, by far, the most free fonts on the internet. Wading through it and finding what works for you could take a very long, long, time. And his commercial use terms are very reasonable:\n\nThey are even free for commercial use – but if there’s any profit, please make a donation to organizations like“Doctors Without Borders”.\n\n[http://moorstation.org/typoasis/designers/klein/index.htm](http://web.archive.org/web/20071010114323/http:/moorstation.org/typoasis/designers/klein/index.htm \"http://moorstation.org/typoasis/designers/klein/index.htm\")\n\nAdmittedly he has just quickly finished some fonts off that were sitting around half-finished for years, kind of dusting out the cobwebs of his lifework. But some got his full attention, and when you come upon those, it is a joy.\n\n"
    },
    {
      "time": " 21.Apr.2006 4.31am",
      "content": "thanks all of you. im really interested in this and im happy to know there is such a great deal of information in the web about this.\n\nand in that note i have a question - is there a blackletter face suitable and readable for long texts?\n\n"
    },
    {
      "time": " 21.Apr.2006 4.42am",
      "content": "_is there a blackletter face suitable and readable for long texts?_\n\nNo, there is not, at least not in digital format. There are lots in metal, if you want to hand-set the long texts yourself ;-)\n\nOn a more serious note, the reason that there really aren’t any suitable digital faces is because the historical designs that were digitized were mostly based off of their display cuts, and not their text cuts, because at the time of the digitization, the days of blackletter text were over. Sort of an unending eycle, I guess. I’ve spent some time off and on over the last two years trying to make a readable textura—one optimized for text! But at the moment that is still sort of a pipe dream, because I am not a good type designer.\n\n"
    },
    {
      "time": " 21.Apr.2006 4.44am",
      "content": "I may _revive_ a text fraktur at the end of the year, but that depends on a number of things. If I do this, it will be made commercially available… but not immediately. Even something at this level would still be a long-term project.\n\n"
    },
    {
      "time": " 21.Apr.2006 4.55am",
      "content": "it should be interesting to see it, do you want to show us?\n\ni don’t know how the hell those monks were reading those heavy texts under the light of a candle. they must have been half blind when they were 30-40 years old (if they survived it).\n\n"
    },
    {
      "time": " 21.Apr.2006 5.03am",
      "content": "Blackletter’s letterforms are actually quite legible. Blackletter designs that were created to be shown big, but digitzed and shruck down very small without any correction is what is illegible and hard on the eyes.\n\nMy design has changed somewhat over time, however I have an old image buried on my website here: [http://www.typeoff.de/?p=22](http://web.archive.org/web/20071010114323/http:/www.typeoff.de/?p=22 \"http://www.typeoff.de/?p=22\")\n\n"
    },
    {
      "time": " 21.Apr.2006 5.28am",
      "content": "Dan, that’s superb. Anything else to see yet?\n\n"
    },
    {
      "time": " 21.Apr.2006 5.33am",
      "content": "this face is beautiful and interesting although hard to read. i would continue developing it.\n\n"
    },
    {
      "time": " 21.Apr.2006 5.34am",
      "content": "\\> is there a blackletter face suitable and readable for long texts?\n\nNot yet. But there could be, assuming readers  \ncan overcome their negative perceptions of it.\n\nFYI: [http://www.themicrofoundry.com/ss\\_fraktur1.html](http://web.archive.org/web/20071010114323/http:/www.themicrofoundry.com/ss_fraktur1.html \"http://www.themicrofoundry.com/ss\\_fraktur1.html\")\n\nhhp\n\n"
    },
    {
      "time": " 21.Apr.2006 5.43am",
      "content": "\\>_Dan, that’s superb. Anything else to see yet?_\n\nThank you, but no. Sorry. :(  \nI’m working on two other projects that I have to finish first. During the summer I hope to pick it up again.\n\n\\>_this face is beautiful and interesting although hard to read.  \n\\>i would continue developing it._\n\nThank you. I spent more effort trying the make the forms legible in small sizes, rather than readable. A form has to even appear correctly in its given size before it can be identified. One of the many problems…\n\n\\>_Not yet. But there could be, assuming readers  \n\\>can overcome their negative perceptions of it._\n\nI don’t think that it is the readers at all! Rather, it is the clients. And worst, other designers and their dogmatic opinions.\n\n"
    }
  ]
}
