{
  "id": "19374",
  "title": "Ligatures and flourishes",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Here is one version of the wordmark I did for Geoffrey Castle. The idea was to capture the energy of Geoffrey’s amazing electric violin playing. His logo (not shown) is a rendering of a violin, which I did not design but which I have vectorized, and use in a pattern that is displayed in grey on the right of the type. Perhaps there could be some extra space around the word “violinist”. This version of the workmark however is for portfolio use only as final version did not have word “violinist”.\n\n ![](http://web.archive.org/web/20070808143106im_/http:/typophile.com/files/Violinist.jpg)\n\n [‹ Personal Identity Expanding](http://web.archive.org/web/20070808143106/http:/typophile.com/node/19529 \"Go to previous forum topic\") [Font recommendations for back of sailboat \"Esprit\" ›](http://web.archive.org/web/20070808143106/http:/typophile.com/node/19483 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070808143106/http://typophile.com/user/7214\" title=\"View user profile.\">alchion</a>",
  "time": "<br>",
  "uid": "7214",
  "comments": [
    {
      "time": " 20.Apr.2006 10.08am",
      "content": "an added detail screen shot.\n\n ![](http://web.archive.org/web/20070808143106im_/http:/typophile.com/files/Violinist-detail.jpg)\n\n"
    },
    {
      "time": " 20.Apr.2006 10.46am",
      "content": "Very nice. Im defintely getting the energy from it. Im not too crazy about the “violinist” part. Its too cramped up in there and too close to the swashes. I would let that one breathe more. (dont think you need the flourish below the y) Also your handling of certain curves can be smoother. What I mean is, I can almost tell where you have the bezier points.\n\n"
    },
    {
      "time": " 20.Apr.2006 11.33am",
      "content": "Hey Ole - I love it!  \nJust the “as” ligation isn’t working.\n\nhhp\n\n"
    },
    {
      "time": " 20.Apr.2006 1.42pm",
      "content": "The r-e curve needs to be smoother. It flattens out improperly in the curve below the r. The curve between the a and s isn’t working. In its current form, it is superfluous. Keep an eye on the thicks in the swashes — looks like you need to be more consistent there.\n\n"
    },
    {
      "time": " 20.Apr.2006 2.46pm",
      "content": "swash thickness was an issue, if too thin it can not be used on web, I experimented a lot and found my first working files were too thick, they took away from the main letterforms. I agree with all commentary especially the “as” ligature it is somehow too geometric.\n\n"
    },
    {
      "time": " 21.Apr.2006 10.20am",
      "content": "Nice. The only things that look slightly out of place, for me, are the ’swirls’ attached to the ’e’ and ’y’. They just dont seem to fit in with the style of the other flourished swashes. _( Those were ’prefabricated’ flourishes, taken from ’Dalliance’, werent they? :)_\n\nDav\n\n"
    },
    {
      "time": " 24.Apr.2006 2.36am",
      "content": "Dav.-I did lay down Dalliance under the “y”,which was my starting point. I then re-drew it to be thinner,the ligatures are original.\n\n"
    },
    {
      "time": " 27.Apr.2006 8.15am",
      "content": "in my opinion, it looks a tad bit crowded.. maybe its just me, and my lazy eyes, but theres too much going on at once for me .. i cant really focus.\n\nit might be the ’violinist’ part being too cramped up, as prakash nair said, or it could be, that there might be too much swirls going on. but by reducing the swirls, you might take away the energy.\n\nMaybe you could work on a version that has a balanced feel to it, ie. less swirls, same amount of energy.\n\nhope that helps.\n\nedit: i like it anyhow though..!\n\n"
    }
  ]
}
