{
  "id": "19388",
  "title": "Typophile Wisdom Episode II",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "An exchange between Nick & Hrant. Hrant’s actual statement is condensed here.\n\n ![](http://web.archive.org/web/20070809000515im_/http:/typophile.com/files/cleartypwriterbaby2.jpg)\n\nFont is **[Clear Typewriter](http://web.archive.org/web/20070809000515/http:/perso.calixo.net/~uzim/fonts.html)** by Uzim\n\nTwo-headed thrift store baby photo by D. Hill\n\nBtw, don’t read anything into my using a baby. It is just something I’ve taken a lot of photos of; while my wife is shopping in thrift stores, I look for things to take photos of. One Goodwill near us always has a big turnover in dolls.\n\n [‹ \r File copy failed: no directory configured, or it could not be accessed.\r](http://web.archive.org/web/20070809000515/http:/typophile.com/node/19351 \"Go to previous forum topic\") [Just for fun... ›](http://web.archive.org/web/20070809000515/http:/typophile.com/node/19300 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070809000515/http://typophile.com/user/12014\" title=\"View user profile.\">fontplayer</a>",
  "time": "<br>",
  "uid": "12014",
  "comments": [
    {
      "time": " 20.Apr.2006 4.51pm",
      "content": "I don’t know how these guys feel about it but I gotta tell you that it made me uncomfortable. When I said you could use my words for a fontplay, I didn’t understand that it would be on the board the next day. It felt very strange but I didn’t say a word. I am now.\n\nNo big thing, I’m still intact and functioning as well as ever (whatever that’s worth), just wanted to let you know how I felt…\n\npeace\n\n"
    },
    {
      "time": " 20.Apr.2006 5.03pm",
      "content": "\\> When I said you could use my words for a fontplay, I didn’t understand that it would be on the board the next day.\n\nI’ll take that into consideration, and see of anyone else thinks this is not a good idea.\n\nI have lots of fonts, and lots of images, but what to use for text is constantly a struggle. I check bumper sticker sites, quote sites, etc. for things to use. So I am so pleased when I find something that seems like it could be used.\n\nI don’t see Nick in my IM window to see if he minds, and hrant can take it and dish it out, if I’m not mistaken.\n\n"
    },
    {
      "time": " 20.Apr.2006 5.38pm",
      "content": "The ’A’ needs work.\n\n"
    },
    {
      "time": " 20.Apr.2006 5.40pm",
      "content": "\\> The ‘A’ needs work.\n\nGood eye!  \n: )\n\nI just noticed that there each of the alt characters are individually made, so I just switched some to the other versions.\n\n"
    },
    {
      "time": " 20.Apr.2006 5.55pm",
      "content": "If you kill your conjoined twin, is it murder, or  \nself-mutilation? And can a minor be tried for that?\n\nhhp\n\n"
    },
    {
      "time": " 20.Apr.2006 6.04pm",
      "content": "I believe it is called duoautocessation, it’s a new crime so the legislature would have to go to work…\n\nAnd I don’t think it’s a “minor” offense.\n\npeace\n\n"
    },
    {
      "time": " 20.Apr.2006 6.11pm",
      "content": "By the way fontplayer - I didn’t say it was a bad idea. It just took me by surprise…\n\npeace\n\n"
    },
    {
      "time": " 20.Apr.2006 6.56pm",
      "content": "\\> <cite>I didn’t say it was a bad idea. It just took me by surprise</cite>\n\nHow do you think I felt when someone told me the design on that one was totally gay? Talk about motivation for rework.  \n: )\n\n"
    }
  ]
}
