{
  "id": "19398",
  "title": "Portland Stone Panels Problem.",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello.\n\nI wonder if any one can help me. I have a bit of a typographic design problem.  \nI have to lay out a design that is going to be carved onto Portland stone by a stonemason.  \nHope the following makes sense.  \nThere are blocks of portland stone. Please see image.\n\n ![](http://web.archive.org/files/panels.jpg)\n\nThe panels are marked Type A1.  \nNames are going to be carved into the stone.  \nThe first Type A1 column from the right is the first column to have names on. These people are more important. These will have two names on each panel within the column. The biggest sized font.  \nThe second Type A1 column will have three names on each panel within the column. The medium sized font.  \nThe third Type A1 column will have five names on each panel within the column. The smallest sized font.  \nThis isn’t the way I would have done it. I would have had the font size all the same!!  \nBut no…  \nAs you can see the layout of the stone panels makes a strong grid. I have decided because the strong grid and its a modern building that the text should be right aligned. Fine.  \nNames might have to be added later on so this means that the names should be aligned to the top of the panel (theres a margin). OK.  \nBut here is my biggest problem. Is it right to align the fonts of each of the three different type sizes to the top of the font rather than the baseline? If I align to the baseline there will be more of a gap at the top of the panel with the smallest font. What do you think I should do? Hope this all makes sense. This is giving me a headache!\n\nD.\n\n",
  "author": "<a href=\"user/10684\" title=\"View user profile.\">dwynn</a>",
  "time": "<br>",
  "uid": "10684",
  "comments": [
    {
      "time": " 21 April, 2006 - 4:42am",
      "content": "All caps, caps & SC, or u&lc?\n\n"
    },
    {
      "time": " 21 April, 2006 - 6:32am",
      "content": "My take would be to align the baselines because they are the most constant element. I would also use the baseline grid set by the largest point size to use for the next two columns.  \ne.g. (these are hypothetical sizes) 1st 24/30, 2nd 18/36, 3rd 12/42 [point size/leading].\n\nWhat typeface are you using, is it being routed or carved?\n\n_These people are more important… The biggest sized font._ Clients you’ve got to love them (or bury them under a block of Portland stone)\n\nHope it all works out  \nTim\n\n"
    }
  ]
}
