{
  "id": "19396",
  "title": "Hrant 1, Chirography 0?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I found this neat article today, whose premise I don’t know if I can stand behind. I’m not sure what I think about the scientific underlying of letterforms throughout humanity’s history. I tend to think that writing systems look similar because of their historical evolution,\\* not because of some tendancies of how humans see the world around them. But then again, I always liked history more than science when I was at school ;-)\n\nAnyway, this line stuck me in particular, because it seems to support one of Hrant’s theses (if I understand him correctly…):  \n_The shapes of letters are not dictated by the ease of writing them, economy of pen strokes and so on, but their underlying familiarity and the ease of recognising them._\n\n[The article may be found here.](http://web.archive.org/web/20081007113123/http:/www.telegraph.co.uk/connected/main.jhtml;jsessionid=KRWZXIBGZXHJBQFIQMGCFGGAVCBQUIV0?xml=/connected/2006/04/18/ecalpha18.xml&sSheet=/connected/2006/04/18/ixconnrite.html)\n\n\\* Weren’t a lot of writing systems simply “invented”? And moreover, weren’t they invented by people who were already familiar with at least one other writing system?\n\nAnd this paragarph is just too rich not to cite:  \n_There is a cosmic dimension to this study. Dr Changizi speculates that if there is intelligent alien life in the universe, then so long as these creatures live, like us, among “macroscopic opaque objects strewn about”, they will evolve writing symbols like our own. Alphabets on a planet orbiting another sun will, if materials, light and shade are similar to our own world, have features in common with those used on Earth: if ET writes home, we may think there is something familiar about his handwriting._\n\n [‹ Typographic animation](http://web.archive.org/web/20081007113123/http:/typophile.com/node/19468 \"Go to previous forum topic\") [Safari vs Firefox ›](http://web.archive.org/web/20081007113123/http:/typophile.com/node/19451 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007113123/http://typophile.com/user/1085\" title=\"View user profile.\">dan_reynolds</a>",
  "time": "<br>",
  "uid": "1085",
  "comments": [
    {
      "time": " 21.Apr.2006 5.37am",
      "content": "I think ET would be text messaging home these days :-)\n\nChrisL\n\nFun article though Dan!\n\n"
    },
    {
      "time": " 21.Apr.2006 9.20am",
      "content": "mmmm...  \nThe structure of the letters is based on natural shapes, because letters are analogic representations of old ideograms (notice that the cientifics are asian, used to write and read pictures, not words).  \nBut the shape of the letters is “dictated by the ease of writting them”, no doubt of that.\n\n"
    },
    {
      "time": " 21.Apr.2006 9.26am",
      "content": "The shape of the letters in a font is “dictated” by its designer.\n\nhhp\n\n"
    },
    {
      "time": " 21.Apr.2006 10.02am",
      "content": "Hrant, when alphabets were invented they were writting forms, alas their shape (not structure) is dictated by the writting tools. When letters are drawn, I should say their contours, one can do anything that the tool allows, and I see 2 posibilities: to respect the tradition and “copy” the shapes with little variations or vreate something new.  \nNow, with computers, almost every shape has been drawn, so there’s a lot of work to do in the structure of letters (I think you wrote something similar for the magazine Tipográfica, talking about legibility).  \nChanges of structure create new typefaces (Times), changes of shape create new fonts (Times regular or bold).\n\n"
    },
    {
      "time": " 22.Apr.2006 4.19am",
      "content": "see: [So much for the dominance of chirography](http://web.archive.org/web/20081007113123/http:/typophile.com/node/18932)\n\n"
    },
    {
      "time": " 23.Apr.2006 1.25am",
      "content": "cursusductus\n\nAlphabets were never invented. Invention is a relatively modern term. Check the OED if you don’t believe me. Though I do agree with you about the implement, and I would add, the substrate.\n\nBut, Hrant is Hrant. I don’t know, he seems so nice and polite in person.\n\n"
    },
    {
      "time": " 23.Apr.2006 3.13am",
      "content": "\\> Changes of structure create new typefaces (Times)\n\nWhile I think there’s essentially nothing new about Times.  \nIt’s stuck on the same chirographic continent like virtually  \nall other type designs. We need the courage to cross the sea,  \nto discover that in fact “almost every shape has been drawn”  \nis utterly false.\n\n\\> Alphabets were never invented.\n\nExcept for Hangul.  \nAnd tellingly, it’s by far the best writing system on the planet.\n\n\\> he seems so nice and polite in person.\n\nI would suggest taking advantage of both facets.\n\nhhp\n\n"
    },
    {
      "time": " 24.Apr.2006 7.52am",
      "content": "I think we can go on at the other link posted by enne\\_son.\n\n"
    }
  ]
}
