{
  "id": "19397",
  "title": "Where are the women?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’ve got the impression there are hardly any women using typohile. This impresssion is only based on the nicknames and on the few profiles I’ve looked at.\n\n– Is the gender ratio on this website the same as in the “real life” world of typography?  \n– If women are underrepresented, why?  \n– If women are underrepresented, what can be done to adjust the ratio? How would the typographic community benefit from this?\n\nI think more female discussion participants would help calm down the competitiveness sometimes emerging in the forums.\n\n [‹ “What a VOLTing development that was!\"](http://web.archive.org/web/20081013101627/http:/typophile.com/node/19471 \"Go to previous forum topic\") [Alpha-Betty interviewed in June issue of Grotesk ›](http://web.archive.org/web/20081013101627/http:/typophile.com/node/19488 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081013101627/http://typophile.com/user/5430\" title=\"View user profile.\">alexfjelldal</a>",
  "time": "<br>",
  "uid": "5430",
  "comments": [
    {
      "time": " 21.Apr.2006 1.44am",
      "content": "There are certainly more male graphic designers, but the most dramatic gap is between the numbers of men and women in _type design_. There are probably fewer than fifty women who have created commercial fonts. Women are not scarce in calligraphy and lettering classes, and the number in type design programs at Reading and KABK are all far greater than those who become font makers. No one has adequately explained to me why this is.\n\n"
    },
    {
      "time": " 21.Apr.2006 1.49am",
      "content": "_There are certainly more male graphic designers_…\n\nStepen, I don’t think that is true. It used to be true, but I doubt that this is still the case.\n\nMaybe men just like to boast more?\n\n"
    },
    {
      "time": " 21.Apr.2006 2.03am",
      "content": "\\> There are certainly more male graphic designers.\n\n\\> It used to be true, but I doubt that this is still the case.\n\nI absolutely agree, when I did my degree in design, the ratio of women to men was around 3:1! I think things has definitely changed in the past decade or two as with everything else.\n\n"
    },
    {
      "time": " 21.Apr.2006 2.16am",
      "content": "I studied graphic design in both the US and in Germany. In both countries, the male:female student ratio was 1:3. This was very recent, though.\n\nFrightening was the teaching staff ratio. In the states, there were female professors, but not as many as there were men. Where I was was studying in Germany, there were no female professors in the design department at all, despite the department having recently hired several new professors, and the student body ratio. (I think that this might have improved though in the year that I’ve been out…).\n\nI can’t speak to the working environments back home in the States anymore. In Germany at the moment, lots of designers are graduationg and not getting jobs for a long time. Many of these graduates start working freelance, or try to found their own studios (out of desperation?). Since there are more female and male gradutes, it seems like there are more women not entering the workforce… but demographics play some role here. The average German design graduate is not 21 but about 28–32, I’d say. Some women opt straight for motherhood once their studies are complete. _Some_ of these women who become mothers will, if the impression from the past decade is to be believed, never enter the design workforce at all, other than in a part-time/freelance capacity.\n\nStill, since there are so many new female designers in comparison with males, there should still be more women getting new jobs than men, even if you factor in possible career and life choices.\n\n"
    },
    {
      "time": " 21.Apr.2006 2.24am",
      "content": "Maybe it has something to do with the nature of type design. Its like model railroading - very focusing with a long pedantic breath.\n\n— [astype.de](http://web.archive.org/web/20081013101627/http:/www.astype.de/)—\n\n"
    },
    {
      "time": " 21.Apr.2006 4.34am",
      "content": "<cite>I think more female discussion participants would help calm down the competitiveness sometimes emerging in the forums.</cite>  \nIn the presence of the fair ones, gentlemen should hold their tongues? A chivalrous sentiment, but not now universal.\n\n"
    },
    {
      "time": " 21.Apr.2006 4.42am",
      "content": "There are women here using Typophile , but I know that I use Typophile for information - what’s new that I may want to check out, where people see trends, what typeface pairings people like since I am not an expert at these things.\n\nLately, there have been a couple of posts that have rather discouraged me from posting lest I end up in an argument I had not intended - not posts that says women aren’t welcome or anything, but posts that are openly derisive of people and their situations, questions, issues. (George is so right on this one.)\n\n"
    },
    {
      "time": " 21.Apr.2006 6.19am",
      "content": "they have their own forum for [alphabetties](http://web.archive.org/web/20081013101627/http:/typophile.com/wiki/alphabetties).\n\nSearch is your friend: I had the same question almost 2 years ago now:  \n [Women in type?](http://web.archive.org/web/20081013101627/http:/typophile.com/node/6414) and [the full thread with all moderators’ comments](http://web.archive.org/web/20081013101627/http:/72.14.203.104/search?q=cache:TXyUBHNjA6YJ:www.typophile.com/node/6414+women+in+type+site:typophile.com&hl=en&gl=us&ct=clnk&cd=1&client=firefox-a) (Read this one)\n\n"
    },
    {
      "time": " 21.Apr.2006 6.22am",
      "content": "<cite>In the presence of the fair ones, gentlemen should hold their tongues? A chivalrous sentiment, but not now universal.</cite>\n\nMy intention is not to protect anyone, Lady or Gentleman, from harsh discussions. I have worked in both all-men and all-women environments, and I must say, neither is an advantage. Reading some of the forums/threads on Typophile, I recognise the “male” patterns. These discussions evolve in a direction of who’s right and who’s wrong, and that’s not very interesting, if you ask me.\n\nSaying this, I find most discussions here very interesting. And I can not point to specific threads, this is just a general notion.\n\n"
    },
    {
      "time": " 21.Apr.2006 7.57am",
      "content": "quote - These discussions evolve in a direction of who’s right and who’s wrong, and that’s not very interesting, if you ask me.  \nSaying this, I find most discussions here very interesting.\n\nYou can’t have it both ways alex, to quote an old overused saying. :)\n\nThought comes from all directions…\n\npeace\n\n"
    },
    {
      "time": " 21.Apr.2006 8.04am",
      "content": "at my school there are 4 girls to every guy in the graphic design classes, so even if it’s more males in the business now, that certainly should change soon.\n\n"
    },
    {
      "time": " 21.Apr.2006 8.06am",
      "content": "\\> openly derisive\n\nSo women prefer being covertly derisive? :-)\n\n—\n\nIn my type design class, 5 out of 7 students are women. And I actually think that’s typical of graphic design as a whole these days. On the other hand, while the women seem to go on to become professional graphic designers, they don’t do the same with type design. My explanation is that women have more sense.\n\nhhp\n\n"
    },
    {
      "time": " 21.Apr.2006 8.32am",
      "content": "Yes, type design is such a lucrative profession—it even pays less than being a school teacher. :-)\n\nI do think most young people going into design these days are women. Perhaps the next generation will bring more women to type design.\n\nChrisL\n\n"
    },
    {
      "time": " 21.Apr.2006 9.26am",
      "content": "_help calm down the competitiveness_\n\nAlex, what would you do if most times you got in a discussion on Typophile someone joined in and started dissing your work or where you lived?\n\n"
    },
    {
      "time": " 21.Apr.2006 9.30am",
      "content": "Maybe it has something to do with the perceived technical nature of type design? I double-majored as an undergraduate, getting degrees in both English Lit and Physics simultaneously (though I work as a designer these days). My English classes were 70% female, while my Physics classes were 70% male (at a university that was circa 60% female overall). I had a chance to observe the stereotypes that members of each discipline held for the other. Male physicists often characterized literary criticism as a wishy-washy field, lacking any real rigor or organization. But the lit girls thought physics was all about crunching numbers and complicated math, stuff that was basically meaningless to their lives. They assumed physics was inaccessible, even though they’d never really been exposed to it. When a field seems innately technical, it generally appeals better to men; when it seems organic or humanistic, it generally attracts more women. At least, that’s what I’ve observed.\n\n"
    },
    {
      "time": " 21.Apr.2006 9.35am",
      "content": "All attempts at broad brushstrokes will ultimately be proven futile…\n\nUnless you’re a calligrapher or painter. :)\n\npeace\n\n"
    },
    {
      "time": " 21.Apr.2006 9.38am",
      "content": "\\> what would you do if ...\n\nThrow primadonna hissy-fits?  \n“Respect me, and using only my concept of respect,  \nor I’ll cut some ears off... starting with mine!”\n\nNick, it’s not you, it’s me: when I see somebody  \nsay something too wrong, I have to counter it.  \nWell, maybe it’s partly you as well, since you  \nexhibit the lion’s share of what [I think] is wrong.\n\nNow, if you need to keep pushing this thead in the  \ndirection of macho-wars (which I assure you is mostly  \none-sided) and reply to this (probably with something  \npassive-aggressively caustic) go ahead, and I’ll gladly  \nlet you have the last word (as I’ve been doing often).  \nOr maybe you’ll allow yourself to look better by not  \ndoing so. Your own behaviour is really only up to you.\n\nhhp\n\n"
    },
    {
      "time": " 21.Apr.2006 9.57am",
      "content": "<cite>Alex, what would you do...</cite>\n\nI hope I wouldn’t start dissing their work or where they lived.\n\n"
    },
    {
      "time": " 21.Apr.2006 10.41am",
      "content": "I studied Graphic Design in the UK and (unfortunately for me)it had a big emphasis on advertising and I tell you, it’s a male world and I’m talking about the worst kind: the mysogenous, power thirsty patronising tosser which looks at you with contempt everytime you open your mouth... I think editorial design environments are usually more balanced. In my short experience at typophile I find 90% of the discussions fine and helpful ....the discussion I posted about gays show that some still have a little problem with diversity...but nothing very upsetting really.\n\n"
    },
    {
      "time": " 21.Apr.2006 11.02am",
      "content": "<cite>patronising tosser</cite>  \nmysogenous, from _musos_ + _genein_ = ’filth-producing’.\n\n"
    },
    {
      "time": " 21.Apr.2006 12.12pm",
      "content": "well i’m here, but i’m not a type designer so i guess that doesn’t help... i like type a whole lot though!!! anyway, isn’t it a bit of a disservice to the women doing great work in graphic deisgn and type design to complain that there aren’t any women around?\n\n"
    },
    {
      "time": " 21.Apr.2006 12.59pm",
      "content": "<cite>My explanation is that women have more sense.</cite>\n\nThis rings of truth.\n\n"
    },
    {
      "time": " 21.Apr.2006 1.40pm",
      "content": "\\>anyway, isn’t it a bit of a disservice to the women doing great work in graphic deisgn and type design to complain that there aren’t any women around?\n\nI’m not complaining that there aren’t any woman around, I know there are. I was just wondering if they are underrepresented in this forum. If so, it could mean that a disproportionate amount of female graphic/type designers are excluded from the networking going on this website.\n\n"
    },
    {
      "time": " 21.Apr.2006 2.06pm",
      "content": "\\> isn’t it a bit of a disservice to the women doing great work  \n\\> in graphic deisgn and type design to complain that there  \n\\> aren’t any women around?\n\nMaybe he was complaining that there aren’t  \n<cite>enough</cite> around. But really, is there ever? :-)\n\nhhp\n\n"
    },
    {
      "time": " 21.Apr.2006 2.09pm",
      "content": "You’re absolutely right: something should be done. If there’s one thing in the world that I shall tolerate no longer, it’s seeing woman after disproportionate woman being excluded from Typophile.\n\n"
    },
    {
      "time": " 21.Apr.2006 2.30pm",
      "content": "I dunno, type designer women seem generally well-proportioned to me.\n\nhhp\n\n"
    },
    {
      "time": " 21.Apr.2006 2.41pm",
      "content": "female type designers seem to be in short supply though, yes.. honestly, i can only name two prolific female type designers off the back of my hand and that’s Zuzana Licko and Carol Twombly (of Trajan fame).\n\n"
    },
    {
      "time": " 21.Apr.2006 2.42pm",
      "content": "ok, maybe disproportionate was the wrong word. Come on, it’s not **that** easy being norwegian! I mean, all we get to eat is whale and reindeer. Maybe “off-balance” is the word I was looking for?\n\n"
    },
    {
      "time": " 21.Apr.2006 2.49pm",
      "content": "\\> “off-balance”\n\nWell, considering the crushing majority of them avoid type design  \nlike the plague, that might in fact be an accurate description. ;-)\n\nBTW, you know what I’ve been dying to have forever?  \nDolphin. Where can a guy get a filet of one?\n\nhhp\n\n"
    },
    {
      "time": " 21.Apr.2006 3.05pm",
      "content": "Yes, where are the women? Nobody wants me! Gah!\n\n"
    },
    {
      "time": " 21.Apr.2006 3.38pm",
      "content": "<cite>I mean, all we get to eat is whale and reindeer.</cite>\n\nI wish I had a catch-all excuse that good.\n\n"
    },
    {
      "time": " 21.Apr.2006 3.44pm",
      "content": "ugh...disgusting.\n\n"
    },
    {
      "time": " 21.Apr.2006 3.49pm",
      "content": "<cite>BTW, you know what I’ve been dying to have forever? Dolphin. Where can a guy get a filet of one?</cite>\n\nI wouldn’t be surprised to find it in a sushi bar being called something else.\n\nIt’s a good thing they don’t like cold water or you could probably find it in Norway.  \n; )\n\n"
    },
    {
      "time": " 21.Apr.2006 4.30pm",
      "content": "I always try to buy my canned tuna with dolphin. ;-)\n\n"
    },
    {
      "time": " 21.Apr.2006 6.01pm",
      "content": "Gents hold onto your seats, the sea of female designers will spill fourth like lemmings in about 2 years and rest assured some of them will become type designers . . .\n\nHow am I so confident? It’s simple . . . Digital Scrapbooking . . .\n\nThat’s secret code for Photoshop Art Director and I predict as the trend grows into a billion dollar industry like it’s paper and scissors counterpart the fallout of a relaxing hobby for the female scrappin’ set will become a sea of very capable female Phoshop designers who will realize there is very little difference between designing cute album pages of Rover the pooch and a website or brochure for a fortune 500 company . . .\n\nNobody sees this and it’s sure to hit the design world over the head . . .\n\nMark this post! You read it here first!\n\nStuart :D\n\n"
    },
    {
      "time": " 21.Apr.2006 6.04pm",
      "content": "<cite>Mark this post! You read it here first!</cite>\n\nDid you come up with that? That is very astute. I believe it,  \nand will remember...  \n: )\n\n"
    },
    {
      "time": " 22.Apr.2006 10.16am",
      "content": "self censored\n\n"
    },
    {
      "time": " 22.Apr.2006 10.29am",
      "content": "\\> Get yourself a dictionary\n\nBetween a dictionary and a <cite>sense of humor</cite> I’ll the latter any day...\n\nhhp\n\n"
    },
    {
      "time": " 22.Apr.2006 10.31am",
      "content": "Lorenza, I was imitating the patronising tosser of your post: I was teasing you. If the tosser dislikes you for your gender alone, he is a misogynist.\n\n"
    },
    {
      "time": " 22.Apr.2006 10.39am",
      "content": "Thanx, not everyone has access to your priviledged education and maybe English is not my mother language and hrant, what do you have to do with that anyway? Bloody hell, what a bunch of pedantic arses you are! Hrant, serious: you talk a lot for someone that doesn’t have ANYTHING to say. You are just there to post silly little meaningless comments on absolutely anything, maybe you don’t have much work to do? career not going well? get a life, mate!\n\n"
    },
    {
      "time": " 22.Apr.2006 11.22am",
      "content": "\\> maybe English is not my mother language\n\nIt was my fourth.\n\n—\n\nLorenza, come on, please take it easy.\n\nhhp\n\n"
    },
    {
      "time": " 22.Apr.2006 11.34am",
      "content": "Look: I’m working on only 5 projects and I don’t have time to breathe, I check Typophile only every couple of days and usually for a good reason. I love these forums but it pisses me off that in order to find a useful comment I have to waste my precious time going through useless observations. I strongly recommend you (and Dennis if he’s reading this) keep your contributions to a minimum in terms of quantity and try to raise the quality of your observations.  \nBack to work, now?\n\n"
    },
    {
      "time": " 22.Apr.2006 12.12pm",
      "content": "The pedantry you encounter, Lorenza, is actually a response to your thinking style: the listener, though he cannot openly insult you, must nonetheless recoil at it.\n\n"
    },
    {
      "time": " 22.Apr.2006 12.18pm",
      "content": "Lorenza: _what do you have to do with that anyway?_  \nGeorge: _the listener ... must nonetheless recoil_\n\nHmm, we might be getting somewhere.  \nMaybe women don’t like chauvinists?  \nHrant is the #1 poster and says what he likes about anything, regardless of people’s sensitivities. George, don’t be swayed by the dark side.\n\n"
    },
    {
      "time": " 22.Apr.2006 12.31pm",
      "content": "I have my own idea of the dark side/light side divide, so I’ll be alright Nick.\n\n"
    },
    {
      "time": " 22.Apr.2006 1.14pm",
      "content": "<cite>I strongly recommend you (and Dennis if he’s reading this) keep your contributions to a minimum in terms of quantity and try to raise the quality of your observations.</cite>\n\nAll my observations use **only** the freshest ingredients, and come with a money-back guarantee. A sense of humor is required for some of the esoteric allusions. I admit surprise that the brilliance of my contributions are not universally acknowledged, but I try not to let that dampen my spirits.  \n: )\n\n"
    },
    {
      "time": " 22.Apr.2006 3.05pm",
      "content": "\\> I have to waste my precious time\n\nMy time is more precious than yours.\n\n\\> Maybe women don’t like chauvinists?\n\nExcept I generally have no problem with women on these boards.  \nMy main problem has always been with a very narrow demographic:  \nthe middle-aged Anglo male. Think objectively why that’s the case.\n\nBTW, feel free to deliver warnings about the Dark Side, but I in  \nturn feel no need to counter that, since I’m confident that nobody  \nnever ever wants to go the Whiny Side. BTW, women <cite>hate</cite> that.\n\nhhp\n\n"
    },
    {
      "time": " 22.Apr.2006 4.17pm",
      "content": "_I love these forums but it pisses me off that in order to find a useful comment I have to waste my precious time going through useless observations._\n\nYeah ... But how else would you get the bliss of discovering something?\n\n"
    },
    {
      "time": " 22.Apr.2006 6.21pm",
      "content": "_Except I generally have no problem with women on these boards._\n\nBut they might have a problem with guys who say stuff like “type designer women seem generally well-proportioned to me”. Surely there is a sensitivity training course you could take in LA?\n\n"
    },
    {
      "time": " 22.Apr.2006 6.33pm",
      "content": "such a fascinating thread....I go to undergrad design school and this is a constant topic of discussion as the ration of women to men is often 15-17:1 as a single class may often have just one male in it, some none at all. In any case, that seems to be the general rule about design schools as of late.\n\nI don’t really know what that means—perhaps the scales will swing drastically within the next decade—perhaps not. At the same time, what does it matter?\n\nI find that gender is much more of a broad gradient than it is a black and white definition. Anyway, it’s all about categorization of body shapes and generalizations that don’t really have anything to do with those letters that we fiddle with all day....right\n\nexcept boys have cooties. hee.\n\n"
    },
    {
      "time": " 22.Apr.2006 7.02pm",
      "content": "\\> they might have a problem with\n\nAs usual, you are entirely too eager to feel offense, to the extent of doing so by proxy. Let the women complain if they really want to - they don’t need you as a spokesman. Stop projecting perceived offense onto yourself. Really Nick, am I not giving you enough of your fill <cite>directly</cite>?\n\nhhp\n\n"
    },
    {
      "time": " 22.Apr.2006 7.23pm",
      "content": "Canadian vs LAlien - the death match continues…\n\nWhen I was in Vancouver there were two articles on the front page of the paper on why you shouldn’t speed.\n\npeace\n\n"
    },
    {
      "time": " 23.Apr.2006 5.45am",
      "content": "\\>\\>\n\nhrant: Like you’re going to apologize and stop pontificating if someone (man or woman) complains!  \nAnd why are YOU (hrant)talking on women’s behalf? I might need Nick as a spokesman, not because I need a man (or anyone)to defend me but because he seems to be waaaaaaaaaaaaaaayyyyy more diplomatic than you with your “divine interventions” and unrequested “pearls of wisdom”.  \nAlex: Probably women don’t hang around a lot here because they are usually more sensitive to issues of discrimination: racism, sexism, ageism, homophobia, classism etc. and people that pontificate too much in general.\n\n"
    },
    {
      "time": " 23.Apr.2006 7.06am",
      "content": "\\> Like you’re going to apologize\n\nIn fact I apologize about 50 times more than Nick (and I don’t make nearly as many as 50 times more mistakes). You’ve only been here 6 weeks, and you think you’ve figured everything out about everybody, eh? It’s OK, I will tolerate your naive arrogance.\n\n\\> he seems to be waaaaaaaaaaaaaaayyyyy more diplomatic\n\nHe is. He’s from your island. Both geographically and psychologically.\n\nTypophile is not the UN - it is a place to learn,  \nand that’s best done with tolerance (but not the  \nkind you stomp your feet about) and a spine.\n\nhhp\n\n"
    },
    {
      "time": " 23.Apr.2006 11.26am",
      "content": "Sibylle Hagmann (Cholla, etc.) wrote an article last year, “Non-existent design: women and the creation of type”\n\nYou’ll need a subscription to Visual Communication Online to read it.\n\n[http://vcj.sagepub.com/cgi/reprint/4/2/186?maxtoshow=&HITS=10&hits=10&RE...](http://web.archive.org/web/20081013101627/http:/vcj.sagepub.com/cgi/reprint/4/2/186?maxtoshow=&HITS=10&hits=10&RESULTFORMAT=1&author1=hagmann%2C+S&andorexacttitle=and&andorexacttitleabs=and&andorexactfulltext=and&searchid=1&FIRSTINDEX=0&sortspec=relevance&resourcetype=HWCIT \"http://vcj.sagepub.com/cgi/reprint/4/2/186?maxtoshow=&HITS=10&hits=10&RESULTFORMAT=1&author1=hagmann%2C+S&andorexacttitle=and&andorexacttitleabs=and&andorexactfulltext=and&searchid=1&FIRSTINDEX=0&sortspec=relevance&resourcetype=HWCIT\")\n\n"
    },
    {
      "time": " 23.Apr.2006 11.33am",
      "content": "whoaaaaaaa lady ! Are you calling me jellyfish!? Umph!  \nI was waiting for you to throw on my face the number of weeks I’ve been around...actually it took you a long time! Given how territorial you are, it was all very predictable. Which is why it took me only few weeks to figure out about you. You are such a darling simple transparent person that I almost feel like hug you. BTW...I am not originally from the “island” (but I luv it!) and we don’t need to be the UN but it would be nice to consider that people here come from all sort of countries, minority groups, races, gender, sexuality etc. and a bit of love and affection and good manners would be nice. It would improve a lot the learning environment ;)  \nShall we now move on and talk about the issues that really matter, namely “equality at Typophile” if I well remember...or you might as well be “hranting” alone.\n\npeace out homeboy, we are all in the same boat (looking like the Titanic at least in this forum...)\n\nPS: what have the Brits done to you that you are still holding a grudge? ;) You’ll see everything will be fine! Hugz\n\n"
    },
    {
      "time": " 23.Apr.2006 11.41am",
      "content": "I remember my tutor at university saying ( brilliant nice woman) saying that you shouldn’t write your gender and your date of birth on your CV, cause nobody needs to know that. If she said that probably she knew (2 decades in the profession)what a male world is Graphic Design. She said that. Not me. But I agree with the CV thing.It’s nobody’s business if you are a woman, a man. Of course usually you can tell the gender by the name...  \nDamn... I don’t have a subscription to Visual Communication.\n\n"
    },
    {
      "time": " 23.Apr.2006 11.49am",
      "content": "While I think that everything matters (especially age, although not absolutely). It’s not a matter of ignoring aspects of reality, it’s a matter of treating people (including third parties who will be affected by a particular hiring decision for example) fairly. That said, it’s understandable to try to bypass unfair imbalances in the system - as long as we admit it, and not hide behind a veil of relativism.\n\nhhp\n\n"
    },
    {
      "time": " 23.Apr.2006 12.00pm",
      "content": "Yo babe! Glad you’re back in shape.  \nI don’t agree with the age thing. Age in graphic design means experience and good solid education. I see lots of kids with talent nowadays that are just worried about what’s trendy now and are just producing ephemerous work (oh jeeesss...where are you george? I don’t know how to spell ephemerous in English...) stuff you look at and forget about it after 5 secs. I don’t believe it’s absolutely necessary to know how to use the latest technology if you are creative enough. I mean, obviously if you can’t cope with the technology developments, you are missing a lot of things...type design for example?\n\n"
    },
    {
      "time": " 23.Apr.2006 12.05pm",
      "content": "\\> Glad you’re back in shape.\n\nI assimilate you.  \nIf you stick around long enough, I’m confident you will get it.\n\n\\> I don’t agree with the age thing. Age in graphic  \n\\> design means experience and good solid education.\n\n?  \nMake up your mind!\n\nBTW, it’s funny you thought I meant that young = good.  \nIn fact I meant no such thing - if anything I meant the  \nopposite. Think about why that happened; such intro-  \nspection is a key to growth.\n\nhhp\n\n"
    },
    {
      "time": " 23.Apr.2006 12.16pm",
      "content": "\\> _Age in graphic design means experience and good solid education._\n\nWow... thanks for the off-handed compliment.  \nBut age can produce wine, vinegar and very stinky cheese!\n\nAs for women in type design, the ones you learn about are the ones that outclassed many of the males. The same holds true for art. Very few males are still willing to admit that Mary Cassatt was a “better” painter than most of the Impressionists, and that Georgia O’Keefe was in a class by herself.\n\n—————————————————————————————————  \nYes, I’m old, but I’m experienced and have a solid education! ;-)\n\n"
    },
    {
      "time": " 23.Apr.2006 7.15pm",
      "content": "I know a bunch of people…\n\npeace\n\n"
    },
    {
      "time": " 23.Apr.2006 7.46pm",
      "content": "Does it even matter how many women do what? Seriously, would it change the way you use type? Besides, everyone knows women can’t do hard stuff like type design.\n\n"
    },
    {
      "time": " 23.Apr.2006 8.08pm",
      "content": "“except boys have cooties”\n\nLOL, now you sound like my daughter when she was younger. She eventually got over it :-)\n\nChrisL\n\n"
    },
    {
      "time": " 23.Apr.2006 8.28pm",
      "content": "<cite>“except boys have cooties”</cite>\n\nLOL, now you sound like my daughter when she was younger. She eventually got over it :-)\n\nBack in the ’50s the only (times have changed) Mexican girl in our So. Cal. school was Nadine. If she drank out of a certain faucet, no one else could use that faucet for the rest of the day, or they got the cooties too. This type of behavior went on for the entire year. I wish I could see that she wasn’t emotionally scarred for life.\n\n"
    },
    {
      "time": " 24.Apr.2006 3.53am",
      "content": "I was avoiding joining in this thread, but I think I want to know, what are _cooties_?  \nTim  \nbtw Lore the word you are looking for, I think, is ephemeral and the point you make about it is sadly true.\n\n"
    },
    {
      "time": " 24.Apr.2006 6.12am",
      "content": "Dennis,  \nThe ethnic reference in your anecdote is in poor taste and is not needed to tell the story. You might want to remove it and avoid offending people.\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2006 6.23am",
      "content": "<cite>Dennis,<br>\nThe ethnic reference in your anecdote is in poor taste and is not needed to tell the story. You might want to remove it and avoid offending people.,</cite>\n\nPlease tell me you are kidding? That is what puts it in context. Simply for being Mexican we emotionally tortured a girl. I only spoke out about it because I had just been wondering about her Sat. But I feel bad about it. I am married to a Mexican citizen.\n\nI won’t jump to conclusions about you, but a big problem in today’s society is how quickly so many people get offended. Unless someone is urinating on some Christian icon, of course. Then it is free speech.\n\nI bare my soul, and someone nit-picks. This week isn’t starting out good. I’ll hope things get better at the office.\n\n"
    },
    {
      "time": " 24.Apr.2006 6.42am",
      "content": "Ephemeral! Of course...how embarrassing, I’m mixing the languages you see (or it’s the age) thanx! Now I’d love to know what a cootie is...  \nI realised my comment about age equal experience/solid education wasn’t very fortunate the moment I wrote it..I knew nobody would let me get away with it! Anyway, I was trying to avoid this thread too because it’s all very vague (starting from me...). It would be best to gather statistics and figures and then try to come to some conclusion. Maybe Typophile can provide that?\n\n"
    },
    {
      "time": " 24.Apr.2006 6.47am",
      "content": "A “Cootie” is something invented by young children in elementary schools years ago. It is some sort of an evil ficticious bug creature that can infest you. Children can be cruel so at times, they would hurl the biggest insult that they could muster at someone they disliked or were jealous of. That remark was “You have Cooties”!. At which point a chorus of “Ehhuuuuuu!!!” would chime in by the rest of the 3rd graders in earshot.  \nSince at that age boys and girls are “enemies” (until puberty strikes), the Cooties insult was often blasted at members of the opposite sex.\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2006 7.07am",
      "content": "Origin:\n\nPronunciation: (kOO’tē), [key]  \n—n. Informal.  \na louse, esp. one affecting humans, as the body louse, head louse, or pubic louse. Also,cooty\n\nIndiscrimitely applied by third-graders. As an aside, (I hope no one is offended), about that age, I once called a white boy the “n” word. I didn’t know what it was, but I knew it was “bad”. I sure the meeting we had with the boy’s parents that night would be comical if it could have been video-taped.\n\n"
    },
    {
      "time": " 24.Apr.2006 10.37am",
      "content": " ![](http://web.archive.org/web/20081013101627im_/http:/typophile.com/files/Cootie_GAme_Box.jpg)\n  \n_1949 THE GAME OF COOTIE Schaper_\n\nYes, “_So-and-so has Cooties!_” was one of the earliest insults you could fling recalling early school years from the fifties.\n\nI also remember the board game, shown above dated 1949, so it must have been used as an expression many years before that.\n\nCurrent version of [Cootie Game](http://web.archive.org/web/20081013101627/http:/www.amazon.com/exec/obidos/tg/detail/-/B00000IWDO/qid=1145899514/sr=1-7/ref=sr_1_7/002-7832956-9681644?v=glance&s=toys) by Milton Bradley still available.\n\n ![](http://web.archive.org/web/20081013101627im_/http:/typophile.com/files/Cootie_game.png)\n\n"
    },
    {
      "time": " 24.Apr.2006 11.22am",
      "content": "Norbert,  \nThat game always bugged me :-)\n\nChrisL\n\nPS: Carol says hello!\n\n"
    },
    {
      "time": " 24.Apr.2006 11.33am",
      "content": "\\> _PS: Carol says hello!_\n\nGlad you had a great time at TDC, thanks for your great summary on [FontTech Weekend](http://web.archive.org/web/20081013101627/http:/typophile.com/node/19471).\n\n"
    },
    {
      "time": " 24.Apr.2006 7.49pm",
      "content": "<cite>yes.. honestly, i can only name two prolific female type designers off the back of my hand and that’s Zuzana Licko and Carol Twombly (of Trajan fame).</cite>\n\nOnly two?\n\nFreda Sack, Fiona Ross, Chris Holmes, Diane Collier, Jill Bell, Veronica Elsner, Holly Goldsmith, Teri Kahan, Lennea Lundquist, Jean Evans, Yvonne Diedrich...\n\n"
    },
    {
      "time": " 24.Apr.2006 7.52pm",
      "content": "<cite>yes.. honestly, i can only name two prolific female type designers off the back of my hand and that’s Zuzana Licko and Carol Twombly (of Trajan fame).</cite>\n\nSoon to join the ranks: Rebecca Aliccari? (At what point is “prolific” reached?)\n\n"
    },
    {
      "time": " 25.Apr.2006 3.59am",
      "content": "Chris, et al  \nThanks for the definition – children can be beasts can’t they?\n\nLore,  \nNo need to apologise, wish I could mix languages with the same facility.\n\nTim\n\n"
    }
  ]
}
