{
  "id": "19393",
  "title": "EULAs - the devil's advocate",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Now and then I read a thread the essence of which is \"I'd like to.. but the [EULA](http://web.archive.org/web/20150126052754/http:/typophile.com/wiki/EULA) says...\"  \nSo I've got a question: SO WHAT?\n\nSpecifically, what makes the EULA binding and enforceable, given your local laws regarding contracts, standard agreements, consumer rights, and EULAs in particular; and also the intellectual property and fair use laws?\n\n(For example, I recall a case where a student was given the right to resell Microsoft software; the license prohibited it, but it was found unfair.)\n\nI read the discussions posted here before, and also elsewhere, but didn't find anything convincing either way.\n\n",
  "author": "typequake",
  "time": "20 Apr 2006 — 8:06pm",
  "uid": "10556",
  "comments": [
    {
      "time": "20 Apr 2006 — 8:53pm",
      "content": "If you think of a font EULA as a written agreement between a font maker and their customer, the customer really has two choices if they don't like the terms of the agreement - they can either ignore it in the knowledge that there will likely be no repercussions, or they can take their business elsewhere. A third option, the one usually mentioned here, is to talk to the font maker and try and work something out.\n\nCheers, Si\n\n"
    },
    {
      "time": "20 Apr 2006 — 10:12pm",
      "content": "Si, thanks for that, but I am raising a legal issue here. There is a strong argument to be made that a EULA is NOT a written agreement between a maker and a consumer, and also that the agreement may not be binding or enforceable. For comparison, the sign at the entrance to a parking garage may say that by paying and entering the driver assumes all liability and waives all claims against the owner/operator - and while the consumer has the option to take her business elsewhere, the law in some jurisdictions is that the notice has no effect no matter how phrased.\n\n"
    },
    {
      "time": "21 Apr 2006 — 9:22am",
      "content": "To answer a purely legal question you'll need a pure lawyer ;-)\n\nI also think given typeface's unique position with respect to IP law a specialist in this area of law would need to be consulted.\n\nBut I think a distinction also needs to be made between warranty type stuff \"if this font melts you Mac we'll give you no more than 5 pence\" and restrictions around redistribution and modification.\n\n"
    },
    {
      "time": "21 Apr 2006 — 2:07pm",
      "content": "Your distinction is valid, but the point is that a contract, let alone a contract such as this, does not exhaust, or even accurately reflects, the rights of the parties.\n\nSo, sure, I'm making a legal argument (my legal training is in fact quite extensive, so I definitely do not condone piracy), but isn't it important to all of you? Why do you automatically assume that if a EULA says something you have to abide by it?\n\n"
    },
    {
      "time": "21 Apr 2006 — 2:33pm",
      "content": "Because I don't have the money to find out otherwise.\n\n:^P\n\n"
    },
    {
      "time": "21 Apr 2006 — 4:33pm",
      "content": "For commercial work, like say, designing a new ad campaign for Starbucks, these things can end up being pretty important...\n\n"
    },
    {
      "time": "21 Apr 2006 — 4:37pm",
      "content": "\"Pretty important\" enough to try and find out?\n\n"
    },
    {
      "time": "21 Apr 2006 — 5:02pm",
      "content": "Starbucks had a dispute with P22 over licensing for the typface Cezanne. I thought there was a Typophile thread about it, but I can't seem to find it. Also, I was simultaneosly making a reference to Sii's new icon.\n\n"
    },
    {
      "time": "21 Apr 2006 — 5:04pm",
      "content": "Actually, funny you should bring that up. [Starbucks has used Cezanne for years without paying up.](http://web.archive.org/web/20150126052754/http:/www.p22.com/comlicensing.html)\n\n"
    },
    {
      "time": "21 Apr 2006 — 5:07pm",
      "content": "Funny you should link that Stephen. They blur out the Starbucks logo in the photos but it blaatently says 'Starbucks' twice in the URL.\n\n"
    },
    {
      "time": "21 Apr 2006 — 5:18pm",
      "content": "Looks like canderson and I were simultaneoposted\n\n"
    },
    {
      "time": "21 Apr 2006 — 7:47pm",
      "content": "<cite>Looks like canderson and I were simultaneoposted</cite>\n\nBut my post is first! Thanks for the link.\n\n"
    },
    {
      "time": "21 Apr 2006 — 7:52pm",
      "content": "Yikes! Maybe I should change my icon! I hope people realize it's Dr Evil's lair from the 2nd Austin Powers Movie (The Spy Who Letterspaced Lowercase) and not connected to Starbucks in any way.\n\n"
    },
    {
      "time": "22 Apr 2006 — 1:17am",
      "content": "Mr. Typequake:  \n\\> I read the discussions posted here before, and also elsewhere, but didn’t find anything convincing either way.\n\nMr. Daniels:  \n\\> Yikes! Maybe I should change my icon!\n\nThe problem with Typophile is that, whenever someone asks a serious question, for instance here about the validity of EULAs, the discussion usually very fast degenerates into off-topics such as\n\n- Wow, a nice typeface  \n- I should redesign my logo  \n- I prefer beer brewed by ...\n\nHere in Europe, most EULAs concocted by American companies are illegal. The reason why Microsoft (the corporation Mr. Daniels is working for) is under constant supervision by the European Union as a law breaker is because Microsoft is stubbornly breaking European law.\n\nMemorize this:\n\n\\*\\*\\* Whoever thinks EULAs of font outfits are legal and valid \\*\\*\\*  \n\\*\\*\\* should have his head examined by a shrink in a loony bin. \\*\\*\\*\n\nBelow I attach an English translation of the section of the German Civil Code containing a long list of illegal and invalid provisions in EULAs.\n\nGerman Civil Code - Bürgerliches Gesetzbuch (Excerpt)  \n...  \nSection 2: Shaping contractual obligations by means of standard business terms\n\n§ 305 Incorporation of standard business terms into the contract  \n(1) Standard business terms are all contractual terms pre-established for a multitude of contracts which one party to the contract (the user) presents to the other party upon the conclusion of the contract. It is irrelevant whether the provisions appear as a separate part of a contract or are included in the contractual document itself, how extensive they are, what script is used for them, or what form the contract takes. Contractual terms do not constitute standard business terms where they have been individually negotiated between the parties.  \n(2) Standard business terms are incorporated into the contract only if, during the conclusion of the contract, the user  \n1. expressly draws the other party's attention to them, or if, on account of the way in which the contract is concluded, an express reference to them is unreasonably difficult, he draws his attention to them by means of a clearly visible sign at the place where the contract is concluded and  \n2. gives the other party, in a reasonable manner that also appropriately takes account of any physical handicap of the other party discernible by the user, the possibility of gaining knowledge of their content,  \nand if the other party agrees that they are to apply.  \n(3) Subject to observance of the requirements set out in subsection (2) above, the parties may agree in advance that particular standard business terms will apply to a particular type of legal transaction.\n\n§ 305a Incorporation in special cases  \n...\n\n§ 305b Precedence of individually negotiated terms  \nIndividually negotiated terms take precedence over standard business terms.\n\n§ 305c Surprising and ambiguous clauses  \n(1) Provisions in standard business terms which in the circumstances, in particular in view of the outward appearance of the contract, are so unusual that the contractual partner of the user could not be expected to have reckoned with them, do not form part of the contract.  \n(2) In case of doubt, standard business terms are interpreted against the user.\n\n§ 306 Legal consequences of non-incorporation and invalidity  \n(1) If all or some standard business terms have not become part of the contract or are invalid, the remainder of the contract continues to be valid.  \n(2) Where provisions have not become part of the contract or are invalid, the content of the contract is determined by the statutory rules.  \n(3) The contract is invalid if one party would suffer unreasonable hardship if he were bound by the contract even after the amendment provided for in subsection (2) above.\n\n§ 306a No circumvention  \nThe rules in this section apply even if they are circumvented by other arrangements.\n\n§ 307 Review of subject-matter  \n(1) Provisions in standard business terms are invalid if, contrary to the requirement of good faith, they place the contractual partner of the user at an unreasonable disadvantage. An unreasonable disadvantage may also result from the fact that the provision is not clear and comprehensible.  \n(2) In case of doubt, an unreasonable disadvantage is assumed if a provision  \n1. cannot be reconciled with essential basic principles of the statutory rule from which it deviates, or  \n2. restricts essential rights or duties resulting from the nature of the contract in such a manner that there is a risk that the purpose of the contract will not be achieved.  \n(3) Subsections (1) and (2) above, and §§ 308 and 309 apply only to provisions in standard business terms by means of which provisions derogating from legal rules or provisions supplementing those rules are agreed. Other provisions may be invalid under subsection (1), sentence 2, above, in conjunction with subsection (1), sentence 1, above.\n\n§ 308 Clauses whose validity depends on an appraisal  \nIn standard business terms the following terms, in particular, are invalid:  \n1. (period for acceptance or performance)  \na provision by which the user reserves the right to an unreasonably long or inadequately specified period for acceptance or rejection of an offer or for performance; this does not include reservation of the right to perform only after expiry of the period for revocation or return under §§ 355 (1) and (2) and 356;  \n2. (additional period for performance)  \na provision by which the user, in derogation from legislative provisions, reserves the right to an unreasonably long or inadequately specified additional period within which to perform;  \n3. (right of termination)  \nthe stipulation of a right for the user to free himself, without an objectively justified reason specified in the contract, of his duty to perform; this does not apply to a contract for the performance of a recurring obligation;  \n4. (right of amendment)  \nthe stipulation of the user's right to alter or depart from the promised performance, unless, taking into account the user's interests, the stipulation to alter or depart from performance is reasonable for the other party;  \n5. (fictitious declarations)  \na provision whereby a declaration of the user's contractual partner is deemed or not deemed to have been made by him if he does or fails to do a particular act, unless  \na) he is allowed a reasonable period within which to make an express declaration and  \nb) the user undertakes to draw to his attention at the beginning of the period the particular significance of his conduct; this does not apply to contracts in which the whole of Part B of the contracting rules for award of public works contracts is incorporated;  \n6. (fictional receipt)  \na provision which provides that a declaration by the user of particular importance is deemed to have been received by the other party;  \n7. (winding-up of contracts)  \na provision by which, in the event that one of the parties to the contract terminates the contract or gives notice to terminate it, the user can demand  \na) unreasonably high remuneration for the utilisation or use of a thing or a right or for performance made, or  \nb) unreasonably high reimbursement of expenditure;  \n8. (unavailability of the object of performance)  \na stipulation permitted under 3. above of the user's right to free himself of his obligation to perform the contract if the object of the performance is not available, unless the user agrees  \na) to inform the other party immediately of the unavailability, and  \nb) immediately to refund counter-performance by that party.\n\n§ 309 Clauses whose invalidity is not subject to any appraisal  \nEven where derogation from the statutory provisions is permissible, the following are invalid in standard business terms:  \n1. (price increases at short notice)  \na provision which provides for an increase in the remuneration for goods or services that are to be supplied within four months of the conclusion of the contract; this does not apply to goods or services supplied in the course of a recurring obligation;  \n2. (right to refuse to perform)  \na provision by which  \na) the right under § 320 of the contractual partner of the user to refuse to perform is excluded or restricted, or  \nb) a right of retention of the contractual partner of the user, in so far as it arises from the same contractual relationship, is excluded or restricted, in particular by making it subject to recognition by the user of the existence of defects;  \n3. (prohibition of set-off)  \na provision by which the contractual partner of the user is deprived of the right to set off a claim which is undisputed or has been declared final and absolute;  \n4. (notice, period for performance)  \na provision by which the user is relieved of the statutory requirement to give notice to the other party to perform or to fix a period for performance or supplementary performance by him;  \n5. (lump-sum claims for damages)  \nstipulation of a lump-sum claim by the user for damages or for compensation for reduction in value, if  \na) the lump sum in the cases in question exceeds the damage expected in the normal course of events or the reduction in value which normally occurs, or  \nb) the other party is not given the express right to prove that damage or reduction in value has not occurred or is materially lower than the lump sum agreed;  \n6. (penalty)  \na provision by which the user is entitled to receive payment of a penalty in the event of non-acceptance or late acceptance of performance, delay in payment or in the event that the other party withdraws from the contract;  \n7. (exclusion of liability for death[4], injury to body and health and for gross fault)  \na) (death and injury to body and health)  \nexclusion or limitation of liability for losses arising out of death, injury to body or health caused by negligent breach of duty by the user or a deliberate or negligent breach of duty by his statutory agent or a person employed by him to perform the contract;  \nb) (gross fault)  \nexclusion or limitation of liability for other losses caused by a grossly negligent breach of duty by the user or a deliberate or grossly negligent breach of duty by a statutory agent of the user or by a person employed by him to perform the contract;  \na) and b) above do not apply to restrictions of liability in the terms of transport, authorised in accordance with the Passenger Transport Act, of trams, trolley buses and motor vehicles in scheduled services, in so far as they do not derogate, to the detriment of passengers, from the Regulation concerning the terms of transport by tram and trolley bus and by motor vehicles in scheduled services of 27 February 1970; b) above does not apply to restrictions of liability for State-approved lottery or raffle contracts.  \n8. (other exclusions of liability in the event of breach of duty)  \na) (exclusion of the right to withdraw from the contract)  \na provision which, upon a breach of duty for which the user is responsible and which does not consist in a defect of the thing sold or the work, excludes or restricts the other party's right to withdraw from the contract; this does not apply to the terms of contract and tariff rules referred to in No. 7 on the conditions set out therein;  \nb) (defects)  \na provision by which, in contracts for the supply of new, manufactured things or of work,  \naa) (exclusion and reference of claims to third parties)  \nclaims against the user on account of a defect as a whole or with regard to individual elements of it are excluded entirely, restricted to the assignment of claims against third parties, or which make the pursuit of legal proceedings against third parties a condition precedent;  \nbb) (restriction to supplementary performance)  \nclaims against the user are restricted, entirely or with regard to individual elements, to a right to supplementary performance, unless the other party is given an express right to claim a price reduction if supplementary performance is unsuccessful or, except where the defects liability is in respect of building work, to choose to terminate the contract ;  \ncc) (expenditure incurred in the course of supplementary performance)  \nthe user's obligation to bear the expenditure necessary for supplementary performance, in particular the costs of carriage, transport, labour and materials, is excluded or restricted;  \ndd) (withholding of supplementary performance)  \nthe user makes supplementary performance conditional on the prior payment of the entire price or, having regard to the defect, an unreasonably high proportion thereof;  \nee) (time-limit for notice of defects)  \nthe user fixes a period within which the other party must give notice of non-obvious defects which is shorter than the period permitted under ff) below;  \nff) (facilitation of limitation)  \nfacilitates the limitation of claims on account of defects in the cases set out in § 438 (1), No. 2 and § 634a (1), No. 2, or, in other cases, results in a limitation period of less than one year from the date on which the statutory period of limitation begins; this does not apply to contracts in which the whole of Part B of the contracting rules for award of public works contracts is incorporated;  \n9. (period of recurring obligations)  \nin a contractual relationship concerning the periodic delivery of goods or the periodic supply of services or work by the user,  \na) a contract duration which binds the other party for more than two years,  \nb) a tacit extension of the contractual relationship which binds the other party for a period of more than one year in each particular case, or  \nc) to the detriment of the other party, a period of notice to terminate the contract which is more than three months prior to the expiration of the initial or tacitly extended period of the contract;  \nthis does not apply to contracts for the supply of things sold as a unit, to insurance contracts or contracts between the owners of copyrights and of claims and copyright collecting societies within the meaning of the Protection of Copyrights and Related Rights Act;  \n10. (change of contract partner)  \na provision whereby in sales contracts, contracts for the supply of services or contracts for work a third party assumes or may assume the rights and obligations of the user under the contract, unless the provision  \na) specifies the third party by name, or  \nb) gives the other party the right to withdraw from the contract;  \n11. (liability of an agent on conclusion of the contract)  \na provision by which the user imposes on an agent who concludes the contract for the other party,  \na) the agent's own liability or duty to perform the contractual obligation without having made an express and separate declaration in that regard, or  \nb) where the agent lacks authority, liability which exceeds that under § 179;  \n12. (burden of proof)  \na provision by which the user alters the burden of proof to the detriment of the other party in particular by  \na) imposing the burden in respect of circumstances which fall within the scope of the user's responsibility, or  \nb) requiring the other party to acknowledge particular facts;  \nSubsection b) above does not apply to acknowledgments of receipt which are separately signed or bear a separate, qualified electronic signature;  \n13. (form of notices and declarations)  \na provision by which notices or declarations to be given to the user or third parties are subject to a stricter requirement than the need for writing or to special requirements with regard to receipt.  \n...\n\n"
    },
    {
      "time": "22 Apr 2006 — 4:25am",
      "content": "I don't understand because ...\n\n<cite>§ 305 Incorporation of standard business terms into the contract<br>\n[...]<br>\n(2) Standard business terms are incorporated into the contract only if, during the conclusion of the contract, the user<br>\n1. <strong>expressly draws the other party’s attention to them</strong>, or if, on account of the way in which the contract is concluded, an express reference to them is unreasonably difficult, he <strong>draws his attention to them by means of a clearly visible sign at the place where the contract is concluded</strong> and [...]</cite>\n\n... this indeed is what you get when purchasing (font) software online:  \n(a) Before/during ordering process will be shown the EULA (or a link to the EULA) together with (b) a checkbox which you click to indicate that you accept this EULA, and clicking the checkbox also (c) unlocks the submit order button. You cannot place an order by accident. The combination of presenting the EULA and technical barriers make that sure your order -- of which accepting the EULA is part -- is an intentional act.  \nAs to people who \"just click through\", well, what about people who sign written contracts without reading them before?\n\nKarsten\n\n"
    },
    {
      "time": "22 Apr 2006 — 4:38am",
      "content": "Uli,\n\nThanks for your serious response. I am not surprised that the EU elected to protect consumers. I wonder if others care to respond, perhaps from Canada, Australia, and non EU countries?\n\nKL, you're referring to the process of incorporation, but the substance is presumably invalid.\n\n"
    },
    {
      "time": "22 Apr 2006 — 9:00am",
      "content": "\\>The problem with Typophile is that, whenever someone asks a serious question, for instance here about the validity of EULAs, the discussion usually very fast degenerates into off-topics such as\n\nNo the problem is that there's no one on typophile who's qualified to answer that question.\n\n\\>\\*\\*\\* Whoever thinks EULAs of font outfits are legal and valid \\*\\*\\*  \n\\>\\*\\*\\* should have his head examined by a shrink in a loony bin. \\*\\*\\*\n\nMaking up bad poetry isn't that helpful.\n\nSi\n\n"
    },
    {
      "time": "22 Apr 2006 — 11:07am",
      "content": "So what I gather is this:\n\n1. Most everyone here never took the time to ascertain the legal validity of a EULA.\n\n2. Some play safe by shopping around, or, if they need something specific -- bending over.\n\n3. Some look for faces with more accommodating EULAs on principle, attributing to the EULA symbolic importance or mystic qualities.\n\n4. But it could turn out that the EULA is not worth the paper it's printed on in Times New ROman 12 point.\n\n"
    },
    {
      "time": "22 Apr 2006 — 12:18pm",
      "content": "\\>2. Some play safe by shopping around, or, if they need something specific — bending over.\n\nWhy so confrontational? Why is it a bad thing for type designers and their customers to talk about these issues and come to an understanding? Have you been hurt by a type designer? Did a type designer threaten you after you modified a font or embedded it in a document? Please explain.\n\n"
    },
    {
      "time": "22 Apr 2006 — 12:32pm",
      "content": "You're mistaken. I am not confrontational at all, just surprised at all the talk about EULAs given points #1 and #4.  \nAnd really, what's the misleading talk about acquiring fonts embedded in a pdf, when every digital version is available online to pirate?\n\n"
    },
    {
      "time": "22 Apr 2006 — 1:10pm",
      "content": "1) It's my understanding from talking with her that Adobe's lawyer for type believes that the Adobe font EULA, as it is handled today, would stand up in any EU court (as well as in the USA and Canada).\n\n4) \"It could\" is a pretty vague statement. What probability are you assigning to the chances of any given EULA being found invalid in court?\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "22 Apr 2006 — 1:36pm",
      "content": "It really depends on the court. Having represented clients in courts, my answer to them was always \"fifty--fifty\". Your last question is phrased in a particular way, but don't forget it would be Adobe's burden to prove the validity, so you should ask your lawyer \"what probability ... found valid?\"\n\nI haven't read the Adobe EULA, but I know that Cambridge University Press makes available online book excerpts embedding Adobe fonts. I presume it can, but then suppose my neighbour across the street did the same, what damage could she cause, given that the font is already available to be ripped?\n\n"
    },
    {
      "time": "22 Apr 2006 — 7:08pm",
      "content": "<cite>KL, you’re referring to the process of incorporation, but the substance is presumably invalid.</cite>\n\nI was referring to going into a contract by intention: EULAs are not \"smuggled\" into a purchase as you suggested but are essential part of it. As you know, you don't \"buy\" fonts (just like you don't \"buy\" design work) but a license to use it. The license fee is determined by how extensive your use is. And the EULA is a standardized agreement for assumed standard cases.  \nEven if some national laws nullify parts of the agreement, still the essense of \"purchasing\" a font is getting a license whose details are defined in the EULA. (Like, in Germany you do have some rights as a customer, whether the terms of sale mention them, don't mention them, or even say the opposite.)  \nAnd that US copyright law outrightly disrespects type designers' work is still another story.\n\n<cite>And really, what’s the misleading talk about acquiring fonts embedded in a pdf, when every digital version is available online to pirate?</cite>\n\nA good point.  \nHowever, do you want to say: Because fonts are already stolen and distributed through other channels, those who license them are idiots? Please remember that there are also idiots who design them, and designing type can be an expensive hobby ...\n\nKarsten  \n(which is my first name)\n\n"
    },
    {
      "time": "22 Apr 2006 — 7:42pm",
      "content": "Karsten,\n\nI did not suggest eulas are smuggled, and I didn't allude to anyone's folly. I have no agenda here :-)\n\nThe fact that a eula is a \"license\" doesn't decide the issue. Vendors will always try to dictate the terms of a deal, and may use whatever legal terms they want, yet the law may say something different. Recall my original microsoft example? Here's another, from a completely different field:\n\nA manufacturer supplies goods (say toys) to a retailer, but doesn't get paid for 60 days. What happens if the retailer goes bankrupt? The manufacturer loses the goods and becomes just another creditor (who gets little). So the manufacturer says: \"I am not selling you the goods, but retain them as my property and give them to you on consignment (that means that you sell them on my behalf and I pay you a commission; you never get title to the goods). If you go bankrupt, I reclaim my property.\" Does this work? Maybe, depending on the law of the land. Do you see my point?\n\nAs for embedding, I meant that a court may be more inclined to view embedding as a consumer prerogatie, given that embedding really doesn't cause the supplier any harm.\n\nCheers.\n\n"
    },
    {
      "time": "22 Apr 2006 — 9:23pm",
      "content": "Your example a couple of messages back is kind of odd, as Adobe's license allows embedding. I'm not sure what point you are trying to make.\n\nYou wrote: <cite>\"As for embedding, I meant that a court may be more inclined to view embedding as a consumer prerogatie, given that embedding really doesn’t cause the supplier any harm.\"</cite>\n\nWhat about suppliers who would charge extra for embedding rights? Seems like they are definitely losing something when customers embed their fonts with the lower-end license. (Not that we do this, but many of our competitors do, and I respect their right to do so.)\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "22 Apr 2006 — 11:47pm",
      "content": "<cite>I read the discussions posted here before, and also elsewhere, but didn’t find anything convincing either way.</cite>\n\nMy post a while back was a bit flip, in part, because I thought the whole thread was kind of a troll.\n\nI think a more approrpriate discussion would be about a particular dispute; we generally don't have the scope to discuss cross-country legal minutia. I say, if you don't like people enforcing IP law, just move to a country (island?) where it isn't enforced. Don't expect to do business in US, Canada, EU, etc.\n\n"
    },
    {
      "time": "23 Apr 2006 — 3:40am",
      "content": "\\> if you don’t like people enforcing IP law\n\nIs this meant as a joke?\n\nIt should be stressed that the EULAs of American font companies do not enforce the laws of the United States. On the contrary, these US companies in fact \\*\\*replace\\*\\* the US laws by their own private \"company laws\".\n\nFor instance in the Adobe EULA we read:\n\n\"Adobe ... expressly disclaim all ... whether by statute, common law, ... or otherwise\".\n\nIn Europe, a state is defined as a \"law state\" (\"Rechtsstaat\" in Germany, \"état de droit\" in France, etc.). The word \"law state\" does not seem to exist in the American language, since the USA is obviously not a law state (in the sense of \"Rechtsstaat\" or \"état de droit\").\n\nIn a law state, it is not possible that companies replace the laws of the state by their \"own laws\" (\"company laws\", \"private laws\"). Since America is not a law state, Adobe can expressly replace the US laws (\"whether by statute, common law, ... or otherwise\") by its own private \"Adobe laws\", and in fact the Adobe EULA makes these \"law replacements\" to a large extent (with the consequence that the Adobe EULA is illegal and invalid in Europe).\n\nAs regards this situation, I made this cynical remark\n\n[http://www.sanskritweb.net/fontdocs/fstype.bas](http://web.archive.org/web/20150126052754/http:/www.sanskritweb.net/fontdocs/fstype.bas \"http://www.sanskritweb.net/fontdocs/fstype.bas\")  \n(REM \\*\\*\\* E.g. if bit 15 is set, this means that ....)\n\n"
    },
    {
      "time": "23 Apr 2006 — 6:14am",
      "content": "Canderson,\n\nWith all due respect, let me give you a taste of your own medicine: if you think I am a troll, or if you prefer a \"more appropriate\" discussion, please move yourself to another thread, where no one can disagree with you, or ask a serious question. By all means go - I do want you to be happy :-)\n\n"
    },
    {
      "time": "23 Apr 2006 — 10:17pm",
      "content": "\\> if you don’t like people enforcing IP law  \n<cite>Is this meant as a joke?</cite>\n\nYou are correct that this is badly worded. I'm not a lawyer. I suppose that contract law must, at some point, be enforced within the US. I'm not familiar with the implications of what the Adobe EULA says. I'm also not sure how font foundries could \"replace\" US law.\n\n<cite>if you prefer a “more appropriate” discussion, please move yourself to another thread</cite>\n\nYou're right, of course. :0)\n\n"
    },
    {
      "time": "24 Apr 2006 — 5:15am",
      "content": "_._  \nSince Microsoft's EULAs disregard the laws of European states, it may be of interest to learn that in this entire week (from Monday 24th through Friday 28th of April) there will be hearings on the Microsoft Antitrust Case (that's the case involving the 500 million Euro fine) at the Grand Jury of the EU Court of Justice.\n\nRead the European newspapers at the end of this week to learn whether Microsoft is now willing to respect the European laws or whether Microsoft will continue to disregard the European laws.\n\n"
    },
    {
      "time": "24 Apr 2006 — 6:40am",
      "content": "Now who's changing the subject ;-)\n\nTime for a latte.\n\nCheers, Si\n\n\"the discussion usually very fast degenerates into off-topics such as\"\n\n"
    },
    {
      "time": "24 Apr 2006 — 8:19am",
      "content": "Typequake,\n\nI’ve spent some time thinking about this over the weekend. Unlike other forms of IP, historically the EULA has been the primary (and in many cases only) line of defense for type makers against the misuse of their IP. So you’re not going to find many type designers that will support this line of reasoning. Theoretically if there were some kind of test case that threw out the validity of software EULAs then where would that leave type designers?\n\nSo in the spirit of this thread I offer you this bad poetry…\n\nwith copyrights in question,  \nbut trademarks looking fine,  \nEULA’s your only protection,  \nagainst many a typo crime.  \nSo any type designer,  \nthat says EULA terms are moot,  \nhas shot themselves (and their colleagues)  \nsquarely in the boot\\*\n\n\\*edited from foot.\n\n"
    },
    {
      "time": "24 Apr 2006 — 8:37am",
      "content": "Nice verse. Thanks!\n\nI didn't know that moot rhymes with foot in American English.  \n(Hitherto, I have been of opinion that moot rhymes with boot.)\n\n"
    },
    {
      "time": "24 Apr 2006 — 8:42am",
      "content": "But I'm not American :-) however in consideration of our US friends I'll change it to boot. If anything this will make the poem even worse. Thanks for the tip.\n\nCheers, Si\n\n"
    },
    {
      "time": "24 Apr 2006 — 9:15am",
      "content": "I've spent time too, discussing the issue with a professor of law who specializes in IP, but knows nothing about fonts and can't tell Fairfield from a chesterfield.\n\nHe believes US courts are inclined to enforce EULAs, but thinks the argument against EULAs has a fair chance.\n\nAs for this: \"Unlike other forms of IP, historically the EULA has been the primary... line of defense for type makers against the misuse of their IP\"\n\nyou should be clear that a eula is a contract, so it binds ONLY the parties who agreed to it. Intellectual property rights are enforceable against third parties. This means that if you find a font library that fell off a truck, you can embed the fonts in a pdf or use them in a tattoo.\n\n"
    },
    {
      "time": "24 Apr 2006 — 8:22pm",
      "content": "<cite>This means that if you find a font library that fell off a truck, you can embed the fonts in a pdf or use them in a tattoo.</cite>\n\nDoes that mean the person whose truck it fell off of violated the EULA by redistributing?\n\nOne common EULA feature that I have personally violated many, many times is right to pass fonts off to a printer. According to many EULAs, the prepress person is supposed to license the font also, particularly if they are working with native files. For lithographic printing, it is often necessary for the prepress person (which used to be me) to have the native InDesign or Quark files to set up the color separations. Designers typically can't do this themselves for a variety of reasons. In the shops where I worked, I don't think anyone seriously considered licensing the fonts again for my use. Also, not being a Typophile(TM) at the time, I don't think the licensing issues ever occured to me.\n\nAs composite digital printing becomes more common, documents will be submitted more as PDF files, which is more often allowed.\n\n"
    },
    {
      "time": "25 Apr 2006 — 5:02am",
      "content": "Yes, IF the EULA was held to be valid, the person who \"redistributed\" could be liable, according to the terms of the EULA.\n\n"
    },
    {
      "time": "6 Aug 2007 — 12:44am",
      "content": "Restrictive EULAs are a good reason not to \"buy\" fonts, since, obviously, most foundries don't consider your payment a purchase. And quite like any other licensing agreement on the planet, you will never ever own the font as your own.\n\nI am a letterpress printer and the process tends to require that digital fonts need be modified if they are to appear as they are supposed to when printed. If the manufacturer of a font forbids modification, I don't \"lease\" their precious commodity.\n\nHow many folks actually even buy fonts that a manufacturer would actually risk discouraging even one sale? If folks who bought fonts paid attention and obliged by the terms of agreement, foundries would be out of business. Is it really the consumer's fault that digital foundries have no other way of protection? If one chooses to freely coattail on unlicensed (and thereby unprotected) font formats, why is the onus placed on the end user?\n\nGerald  \nThe Bieler Press  \n [http://BielerPress.blogspot.com](http://web.archive.org/web/20150126052754/http:/bielerpress.blogspot.com/ \"http://BielerPress.blogspot.com\")\n\n"
    },
    {
      "time": "14 Sep 2007 — 10:04am",
      "content": "nevermind\n\n"
    },
    {
      "time": "11 Sep 2007 — 3:44pm",
      "content": "Very interesting discussion.\n\nJames, I think you may be the one who is missing the point. EULAs are everywhere, not only in this industry, so their legal validity as a general matter is very important.\n\nIt's great if designers are accommodating, but what about other sectors?\n\nEran\n\n"
    },
    {
      "time": "14 Sep 2007 — 10:04am",
      "content": "nevermind\n\n"
    },
    {
      "time": "14 Sep 2007 — 9:19am",
      "content": "Well, agreement is a good thing. But it's not a good thing for the consumer to be bargaining thinking he or she are the mercy of the foundry IF the EULA is not binding in the first place. That's why I find the thread interesting.\n\nWhy don't you care about other sectors? You are selling software, are you not?\n\n"
    }
  ]
}
