{
  "id": "19399",
  "title": "(x) Looking for New Johnston - proprietary (various alternatives) {Bert (Stephen)}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hey all,  \nDoes anybody know where I can get hold of a copy of NewJohnstone, (the font Transport for London uses), or something very similar?  \nCheers.\n\n",
  "author": "<a href=\"/web/20100228003557/http://www.typophile.com/user/12592\" title=\"View user profile.\">Robin Stephens</a>",
  "time": "<br>",
  "uid": "12592",
  "comments": [
    {
      "time": "",
      "content": "Hello Robin,\n\nYou can get is here:  \n [http://www.p22.com/products/london.html](http://web.archive.org/web/20100228003557/http:/www.p22.com/products/london.html \"http://www.p22.com/products/london.html\")\n\nPieter\n\n"
    },
    {
      "time": "",
      "content": "@Pieter: you're linking to the \\*old\\* typeface. I've read somewhere that some CI-agency did a redesign a couple of years ago. My guess is that Robin is referring to the redesigned typeface.\n\nFrom  \n [http://www.ltmuseum.co.uk/learning/online\\_resources/ecobus\\_omnibus/pg/19...](http://web.archive.org/web/20100228003557/http:/www.ltmuseum.co.uk/learning/online_resources/ecobus_omnibus/pg/1919a.htm \"http://www.ltmuseum.co.uk/learning/online\\_resources/ecobus\\_omnibus/pg/1919a.htm\")\n\n\"Wherever you go in London, you will see London Transport's famous roundel logo. It first appeared as a solid red circle in 1908, and later evolved into a red circle which was registered as a trademark by 1918. The proportions were adapted to suit the new corporate typeface, Johnston Sans, designed by the calligrapher, Edward Johnston (1874-1944) in 1916. Pick had hired Johnston to create a more harmonious and balanced typeface than previously available. A modified version of Johnston's typeface, New Johnston, is still used by London Transport today.\"\n\nFrom the wikipedia:  \n\"Typography  \nEdward Johnston also designed Transport for London's (TfL) distinctive sans-serif typeface in 1916. A version of the typeface, since modified to include a lower case, continues in use today, and is called \"New Johnston\". The new typeface is noted for the curl at the bottom of the minuscule l, which other sans-serif typefaces have discarded, and for the diamond-shaped tittle on the minuscule i and j, whose shape also appears in the period / point / full stop and as the origin of other punctuation marks in the face. Transport for London \"is the owner of all rights of copyright and otherwise now existing in the New Johnston typeface\"; but a close approximation of the face exists in the TrueType computer font Paddington (not be confused with a different, very thick and slightly seriffed font of the same name).\"\n\nThe good news is that you can request the font through this government agency:  \n [http://www.tfl.gov.uk/tfl/about/corp-design/fonts-click-through-license-...](http://web.archive.org/web/20100228003557/http:/www.tfl.gov.uk/tfl/about/corp-design/fonts-click-through-license-delf.shtml \"http://www.tfl.gov.uk/tfl/about/corp-design/fonts-click-through-license-delf.shtml\")\n\n"
    },
    {
      "time": "",
      "content": "Other interpretations:\n\n[ITC Johnston](http://web.archive.org/web/20100228003557/http:/www.fontshop.com/showfont.cfm?fid=C.118887.0.0)  \n [Granby](http://web.archive.org/web/20100228003557/http:/www.fontshop.com/showfont.cfm?fid=EF.109184.0.0)  \n [English Grotesque](http://web.archive.org/)  \n [Agenda](http://web.archive.org/web/20100228003557/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Agenda)\n\n"
    },
    {
      "time": "",
      "content": "The listmaster strikes again. :^)\n\nWhere other IDers come up with single hits, Stewf somehow always manages to whup out comprehensive lists of typefaces that are similar or otherwise related. That's why he was, is and always will be the Type Identification Daddy.\n\nWe are not worthy, sensei... ;^)\n\n"
    },
    {
      "time": "",
      "content": "Wow what a great response. Thanks everybody that's really helpful.\n\n: )\n\n"
    },
    {
      "time": "",
      "content": "Thanks Yves. There's a certain book to be released very soon that will explain the speed with which I can post these lists.\n\n"
    },
    {
      "time": "",
      "content": "Book? You mean your brain has been mapped? ;^)\n\n"
    },
    {
      "time": "",
      "content": "Yup, it took two dozen hefty volumes, but they finally managed to. :^D\n\nHow soon is \"very soon\" BTW -- to me it feels like ages since we finished working on it. Where's Erik when we need him? :^P\n\n"
    },
    {
      "time": "",
      "content": "In a deep pit, working on FontBook proofs.\n\n"
    },
    {
      "time": "",
      "content": "You put Erik in a deep pit? ;^)\n\n"
    },
    {
      "time": "",
      "content": "\"It rubs the FontBook on its skin or else it gets the hose again.\"\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "Hilarious.\n\n"
    },
    {
      "time": "",
      "content": "So would that make you the deranged serial killer in the flowery dress, Stephen? :^P\n\n"
    },
    {
      "time": "",
      "content": "BTW, have a gander at [this](http://web.archive.org/web/20100228003557/http:/www.fontblog.de/files/category-12.html#unique-entry-id-204). :^)\n\n"
    }
  ]
}
