{
  "id": "19416",
  "title": "at-sign in e-mail address",
  "forum": "Design",
  "tags": [

  ],
  "content": "I was wondering if anyone had any guidelines they used for typesetting the @ in e-mail addresses. I really don’t much like the look of the placement of the @-sign in many fonts, and I’m not so sure about the size either. It looks more like it was designed for the previous usage as the commercial “each” where it would stand alone.\n\nBelow are three iterations of an e-mail address in 9pt Palatino typeset with latex. The top one is straight out of the box (except for a \\kern0.5pt between the @ and the c). The second one is the same size, but lowered 0.25ex to approximately center the a in the @ with the x-height. The third one has the @ at 8pt and lowered 0.15ex for the same positioning. The c following the @ might have a lot to do with my problem with the typesetting.\n\n ![](http://web.archive.org/files/at-signs.png)\n\nI’ve also experimented with aligning the top of the @ with the midline, and the bottom of the @ with the baseline and I’m kind of torn. The reactions I get are one of two: “Whatever” or “Suck up and deal with the @ you’re given.” I was hoping this would be a more constructive if not congenial forum. So is there anything people usually do with large high @’s?\n\n",
  "author": "<a href=\"user/11019\" title=\"View user profile.\">pat</a>",
  "time": "<br>",
  "uid": "11019",
  "comments": [
    {
      "time": " 21 April, 2006 - 2:04pm",
      "content": "I always end up using your 2nd method, in lowering it and vertically centering it with the x-height. _( Works for me and I somehow even think it should look like that. :)_\n\nDav\n\n"
    },
    {
      "time": " 21 April, 2006 - 2:22pm",
      "content": "i don’t think i’ve ever actually used the @ in any kind of design, so i’ve never really thought about it, but in your case the 2nd example certainly looks best. considering the @ is mostly used for all lowercase email addresses it makes the most sense for it to align better with lowercase than uppercase as it does now (for the most part).\n\n"
    },
    {
      "time": " 21 April, 2006 - 2:48pm",
      "content": "“It looks more like it was designed for the previous usage as the commercial “each” where it would stand alone.”\n\nExactly. Or used with lining numerals, not lowercase. Smaller foundries are starting to get this, but the big guys have a lot of catching up to do. Your 2nd solution is best. The size change isn’t so good.\n\nAnd props for being a latex user. Not many of you guys ‘round here.\n\n"
    },
    {
      "time": " 21 April, 2006 - 7:52pm",
      "content": "Thanks for the replies (and the latex support!). Otf fonts could (and maybe they do) include both an uppercase and lowercase @. Xetex I know—and I’m sure the commercial layout applications too—can select between upper and lowercase glyphs; Adobe Garamond Pro, for example, has an uppercase hyphen.\n\nA tangential question is parentheses with lining numerals: move those up a skosh?\n\n"
    },
    {
      "time": " 22 April, 2006 - 3:05am",
      "content": "I think I would look at a touch more space either side of the @ of the second version, I believe that it will make it easier to read/understand and therefore more memorable.  \nIf a skosh equals a couple of gnat’s then I agree.  \nTim\n\n"
    }
  ]
}
