{
  "id": "19421",
  "title": "Drop cap and small amount of text",
  "forum": "Design",
  "tags": [

  ],
  "content": "this page contains a short artist statement to be included in the back of a photography monograph.\n\n ![](http://web.archive.org/web/20081120080513im_/http:/www.typophile.com/files/lucy_fur110a.jpg)\n\ni am curious about a couple of things:\n\n- is the placement and size of the drop-cap acceptable?  \n- does the phrase that is set in small caps, false-ilalics work? i am using adobe garamond and i skewed it 13 degrees. it didn’t look quite right to me with small caps roman preceding the rest of the italic text. do you think this is ok or should i set it in italics like the rest of the text?  \n- the text block is 4.2 inches. do you think that is too wide?\n\nthe page dimensions are 10x10 inches and the type is 11/14\n\nany advice and recommendations are greatly appreciated\n\nthanks,\n\ngregg\n\n [‹ a gay typeface?](http://web.archive.org/web/20081120080513/http:/www.typophile.com/node/18946 \"Go to previous forum topic\") [at-sign in e-mail address ›](http://web.archive.org/web/20081120080513/http:/www.typophile.com/node/19416 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081120080513/http://www.typophile.com/user/5823\" title=\"View user profile.\">hereandthere</a>",
  "time": "<br>",
  "uid": "5823",
  "comments": [
    {
      "time": " 21.Apr.2006 5.09pm",
      "content": "Don’t use faux italics or SC. It’s pretty obvious and icky.\n\n"
    },
    {
      "time": " 21.Apr.2006 8.01pm",
      "content": "so, otherwise, do you think everything else is ok?\n\n"
    },
    {
      "time": " 21.Apr.2006 10.21pm",
      "content": "Too much air around the drop cap. I’d nudge it closer to the type so that it reads as part of the first word.\n\nand... it’s so much nicer to make it a jpeg than to force us to download pdf files.\n\n"
    },
    {
      "time": " 21.Apr.2006 11.14pm",
      "content": "i apologize about the download. please forgive my bad form.\n\ndoes this look better?\n\n ![](http://web.archive.org/web/20081120080513im_/http:/www.typophile.com/files/lucy_fur110.jpg)\n\n"
    },
    {
      "time": " 22.Apr.2006 9.21am",
      "content": "Yes, that’s a lot better. You could even see how it looks even closer to the text so that the T overlaps a bit. One other small tweak - the period after Bird ALMOST aligns perfectly with the period after “same” at the end, you could adjust spacing in the last line so that they do.\n\n"
    },
    {
      "time": " 22.Apr.2006 9.36am",
      "content": "I would look at moving the T more to the right, the consequence should be to take room over and tighten up some of the space in that second line, I would then try to align the first and second lines to the angle of the T’s vertical.  \nTim\n\n"
    },
    {
      "time": " 22.Apr.2006 11.52am",
      "content": "thanks everyone!\n\n"
    }
  ]
}
