{
  "id": "19429",
  "title": "Looking for alternatives for \"The Riverdale Review\" nameplate blackletter",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi! I’ve been viewing these forums for some time, but I have yet to post. Maybe now that I’ve got my first one out of the way, I’ll see if I can help out instead of just asking questions.\n\nI’m pursuing a redesign of my school’s paper. I just took a look through the archives, and I found that our nameplate once was written in this great blackletter (later on we switched to what appears to be Monotype Engravers Old English, then to Times (ugh!)). I did a search on Identifont and What the Font, as well as searching through some blackletters online, but I couldn’t find anything that especially resembled it, especially the great uc letters. Using my Bringhurst, I think that it’s a fraktur or Schwabacher, but I’m not positive. I realize that this could be a typeface that hasn’t been made digitally (or a custom job), but I was wondering if anyone had any ideas about its identity.\n\nA little bit of further info: we used it originally from some time between 1932 and 1940. We then reinstated it from approximately ’91-’96. The latter fact lends a bit of hope to the fact that it might be digital, since we might have gone to Quark by that time. Thanks a ton.\n\n [‹ Start of a new FP series (Part II added)](http://web.archive.org/web/20081011042449/http:/typophile.com/node/19454 \"Go to previous forum topic\") [San-serif font for magazine redesign ›](http://web.archive.org/web/20081011042449/http:/typophile.com/node/19420 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081011042449/http://typophile.com/user/11702\" title=\"View user profile.\">auricfuzz</a>",
  "time": "<br>",
  "uid": "11702",
  "comments": [
    {
      "time": " 22.Apr.2006 3.23am",
      "content": "Looks like the image didn’t upload. Let me try again:\n\nUgh. The Insert Image seemed not to work, and using Photobucket’s auto-HTML didn’t either. Here’s the link to the image: [http://i48.photobucket.com/albums/f202/auricfuzz/RRLogo.jpg](http://web.archive.org/web/20081011042449/http:/i48.photobucket.com/albums/f202/auricfuzz/RRLogo.jpg \"http://i48.photobucket.com/albums/f202/auricfuzz/RRLogo.jpg\")\n\n"
    },
    {
      "time": " 22.Apr.2006 4.23am",
      "content": "Have you checked the many Blackletter fonts by Dieter Steffmann?\n\n[Link](http://web.archive.org/web/20081011042449/http:/www.moorstation.org/typoasis/designers/steffmann/)\n\n"
    },
    {
      "time": " 22.Apr.2006 5.19am",
      "content": "I think you could classify that as a relaxed Fraktur with hints of Art Nouveau, I suspect you might be right about the hand-drawn aspect, especially comparing the a and e’s apparent heights, if you have access to the archives you should be able to redraw it. This link will give you some more to look at,  \n [http://bowfinprintworks.com/Script03Pg1.html](http://web.archive.org/web/20081011042449/http:/bowfinprintworks.com/Script03Pg1.html \"http://bowfinprintworks.com/Script03Pg1.html\")\n\nTim\n\n"
    },
    {
      "time": " 22.Apr.2006 8.18am",
      "content": "that is one funky blackletter logo!\n\n"
    },
    {
      "time": " 22.Apr.2006 1.07pm",
      "content": "I just took a look at the resources provided by all about seb and timd (thanks a ton, BTW!). Claes, I agree, it is “funky”; that’s why I wanted to know what it is. I think that it’s a refreshing change from NY Times style blackletter nameplates.\n\nRegarding the typeface, the short answer is that none of the typefaces on the two websites matched—and I took a look at all of them! But I did find a few things. First, the blackletter is definitely fraktur; 90% of the closely matching fonts were fraktur.\n\nFrom timd’s link, I found a number of similar typefaces. Albert Betenbuch ( [http://www.myfonts.com/fonts/ingrimayne/albertbetenbuch/](http://web.archive.org/web/20081011042449/http:/www.myfonts.com/fonts/ingrimayne/albertbetenbuch/ \"http://www.myfonts.com/fonts/ingrimayne/albertbetenbuch/\") ) was probably the closest on the uc, but the other lc was far too angular. The other good one was Faber Fraktur ( [http://www.ingofonts.de/ingofonts/index.html](http://web.archive.org/web/20081011042449/http:/www.ingofonts.de/ingofonts/index.html \"http://www.ingofonts.de/ingofonts/index.html\") ), which, while still quite different from the actual nameplate, had a great swoop to the letters (especially compare the lc a’s and h’s).\n\nI took a look at every single one of Dieter Steffmann’s fonts. Phew! Couldn’t have done it without Maxthon’s links list. Anyway, there I found a number of close typefaces as well. Gothenburg Fraktur has pretty good uc, although again, it’s too angular. Other ones I liked were Bretkopf Fraktur, Fraktur Shadowed (trying to get that nice outline around the uc), Moderne Fraktur (nice sweep to the letters), Peter Schlemihl, Schmale Anzeigenschrift Zier (check out the uc!), and Schwabacher. Anyone have any other good resources? Also, if anyone’s interested, I’d appreciate feedback on the typefaces I mentioned above, as to their merits and similarities to mine. Finally, just wondering, is mine even a good blackletter? Because I’m thinking that maybe it’s the distinctiveness of it that I like, not the quality. Thanks again for everything, Typophiles.\n\n"
    },
    {
      "time": " 22.Apr.2006 1.15pm",
      "content": "Reed, I reopened your thread and moved it to the _Design_ section where it now belongs. I hope they can help you out there.\n\n"
    },
    {
      "time": " 22.Apr.2006 1.26pm",
      "content": "Thanks a ton, Bald Condensed. I just took a few minutes more to check out Linotype and Myfonts. Linotype didn’t really have anything I liked, but now that I’m looking for similar, not identical typefaces, I found a few I liked. The main thing I’m liking is the curved, soft quality to the nameplate. Neue Luthersche Fraktur, PhederFrack, Antorff, Monarchia, and NeuAltisch were the best, I think. My two favorites of these are Monarchia and Neue Lutersche Fraktur, since they combine the flow that I want with the narrow, almost sharp feel of some of the nameplate (lc d, lc v). Again, thoughts?\n\n"
    },
    {
      "time": " 22.Apr.2006 1.54pm",
      "content": "Don’t ask me, I’m Blackletter-illiterate! :^D Although I _did_ do the cross-referencing on the Blackletter section of the new FontBook. It took me a whole arsenal of notes, and it was quite enlightening I must say.\n\nI hope Dan shows up, he sure knows his Blackletters. ;^)\n\n"
    },
    {
      "time": " 22.Apr.2006 2.17pm",
      "content": "Gosh :)\n\nI agree that you won’t find any digital font that matches your masthead. Would it be possible to digitize what you have? It looks so beautiful already!\n\nWhat you have isn’t a fraktur. As was mentioned above, it is similar to the historicist, decorative blackletter+art nouveau creations that were very popular in Germany, England, and the US (among other places…) during the early 20th century. Real fraktur has an uneven “ying-yang” rhythm to its strokes (schwabacher has an even or opposite ying-yang rhythm). You have interesting, original (partial) stroke repetition.\n\nWhat ever you go with, I would recommend something with dark, heavy strokes. I don’t think that Monarchia Fett or Luther’sche Fraktur are heavy enough.\n\nWhat do you think about [Ferox](http://web.archive.org/web/20081011042449/http:/www.veer.com/products/typedetail.aspx?image=UMT0000020)? This is also a mix of several different styles. It doesn’t remind me of your old masthead’s letters, but it is one of the best examples of a new blackletter for the 21st century yet.\n\n"
    },
    {
      "time": " 22.Apr.2006 2.35pm",
      "content": "Ferox kicks some major booty — I always had a soft spot for Miles’ work.\n\n"
    },
    {
      "time": " 22.Apr.2006 2.41pm",
      "content": "that old Riverdale Review logo looks more like something out of vintage Las Vegas than Germany, if you ask me.\n\n"
    },
    {
      "time": " 22.Apr.2006 2.47pm",
      "content": "_that old Riverdale Review logo looks more like something out of vintage Las Vegas than Germany, if you ask me_\n\nExactly my point! It isn’t a real blackletter or schwabacher, but an “artistic” hybrid. These very very, very popular in the early 20th century. They seemed to be everywhere.\n\n"
    },
    {
      "time": " 22.Apr.2006 3.07pm",
      "content": "Great analysis, Dan. I see what you mean when I look at some of the fraktur’s I found—they all have that same, angular stroke on the bottom of each of them. I’m glad to hear that you like the nameplate.\n\nRegarding Ferox, I like it, as it certainly is more interesting than the many similar frakturs I saw today. But I feel that, if we’re considering it as a nameplate, it’s too heavy. It seems like the letters would almost run together (especially with out cruddy printing and paper), but maybe it’s just my unjustified fear of being too bold, which I may have to get over.\n\nTo clarify my intentions with this project: I’m looking at our 90 years of issues as partial inspiration for a redesign of the current paper. Maybe once I get closer, I’ll pop back in here to ask for some opinions on past, present, and (maybe) future type and layout. For now, I was just curious to see whether I could find such an interesting blackletter. I’m not sure whether I’ll end up using it or a blackletter for our nameplate, but your comments have certainly increased my interest in it.\n\nOne more thing. You mentioned digitizing this nameplate. I just checked the forums, and I couldn’t find anything directly dealing with it. I’m downloading the demo for Scanfont, which I saw mentioned on one post. I was wondering what you would recommend for digitizing the nameplate, which I may or may not do (to paraphrase, a pretty big “may”). I do have AI CS2, so I can do a live trace on the nameplate. It did an okay job, but not great (especially on the outline around the uc). Would you recommend using one of these two methods for getting a rough version and then going in manually with the pen tool? Or would you suggest all manual? Or something else? Thanks.\n\n"
    },
    {
      "time": " 22.Apr.2006 3.12pm",
      "content": "_Would you recommend using one of these two methods for getting a rough version and then going in manually with the pen tool?_\n\nYes, I’m sure that this would work. If I were doing it, I would place the scan in Illustrator, and draw new outlines on top, using the placed image as a guide. But cleaning up an auto trace might work, too, depending on how good the trace was… those auto-tracing engines are getting better and better.\n\n"
    },
    {
      "time": " 23.Apr.2006 7.43am",
      "content": "Forgot to say thanks to everyone who helped me with my art nouveau/blackletter adventure today. I’ll pop back in when I make some more progress on the redesign, and maybe when I have a few minutes to help out someone else.\n\n"
    }
  ]
}
