{
  "id": "19420",
  "title": "San-serif font for magazine redesign",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello all,\n\nI’m getting ready to tackle a redesign of a magazine called revenue. It’s all about performance marketing online. Currently, Gotham (headlines) and Whitman (body) are used. Because the masthead uses Whitman, I will continue to use it for the body copy. However, I would like to freshen things up a bit and I’m looking for any suggestions you may have as a replacement for Gotham.\n\nThe revenue readers are apparently very savvy entrepeneur types. So I’m looking for a font that is modern, forward looking and solid...perhaps even edgy. It also needs to be a fairly large family.\n\nI looked back at a previous post. In the past, I asked for a companion font to Whitman. Quadraat Sans, Giacomo and Malmo Sans were recommended. What do you think of those? Of those three I prefer Malmo Sans. I’m pretty sure I like it but am hoping to be pointed in a few other directions before I decide.\n\nSo any advice you have is greatly appreciated.\n\nThank you,\n\nTamara\n\n [‹ Looking for alternatives for \"The Riverdale Review\" nameplate blackletter](http://web.archive.org/web/20080829165430/http:/typophile.com/node/19429 \"Go to previous forum topic\") [Substitue for Gotham. ›](http://web.archive.org/web/20080829165430/http:/typophile.com/node/19442 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080829165430/http://typophile.com/user/4094\" title=\"View user profile.\">starlux</a>",
  "time": "<br>",
  "uid": "4094",
  "comments": [
    {
      "time": " 21.Apr.2006 6.06pm",
      "content": "FB Amplitude?\n\nhhp\n\n"
    },
    {
      "time": " 22.Apr.2006 6.44am",
      "content": "Thanks, Amplititude looks like it’s worth exploring. Any more suggestions?\n\nTamara\n\n"
    },
    {
      "time": " 22.Apr.2006 11.31am",
      "content": "STALEMATE or SOPHISTO might be fitted for thsi purpose?  \nHave a look yourself; [http://www.macrhino.com](http://web.archive.org/web/20080829165430/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\n"
    },
    {
      "time": " 22.Apr.2006 11.56am",
      "content": "Wow I really like Sophisto! This is tough.\n\n"
    },
    {
      "time": " 23.Apr.2006 4.50am",
      "content": "Thanks Tamara!\n\nLet me know if you have further questions regarding Sophisto.\n\nCheers\n\n"
    }
  ]
}
