{
  "id": "19434",
  "title": "Batch Pagination Programs - why?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I just started a new job for a company that publishes technical and scientific journals and I'm training on Xyvision - a Batch Pagination software program. As a career InDesign user, I'm pretty much out of my element. I'm learning more macros than I know what to do with and getting more and more frustrated every day.\n\nI'm just wondering if anyone can explain to me why this software is used, versus the much more user-friendly InDesign? Or even the more basic Quark? It seems like companies would save boatloads of money on manpower and training if they went to this. Perhaps there is some industry rule that I am missing out on, but I would love to know.\n\n",
  "author": "pmlaub",
  "time": "22 Apr 2006 — 12:42pm",
  "uid": "12609",
  "comments": [
    {
      "time": "22 Apr 2006 — 1:25pm",
      "content": "I'm sure they've been using Xyvision for a very very long time. Intertia (a.k.a. switching costs) is probably a big part of it.\n\nIt's also very possible that Xyvision has some particular features for scientific/technical stuff that they can't get (or that require expensive add-ons) in QuarkXPress and InDesign.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "22 Apr 2006 — 2:11pm",
      "content": "I have never used Xyvision, but I can empathize with you for I myself have been around a number of proprietary software applications that are cumbersome at best to use. One of them being Preps, which is a pagination application for production folk. It doesn't even run in OSX, and the software is free, lol, but the silly little key that you have to have costs about $5k I was told. It's horribly confusing, and anyone who does not already know how to use it is better off staying away from it, otherwise, you could really mess up and cost your printer a lot of money.\n\n"
    },
    {
      "time": "25 Apr 2006 — 6:05am",
      "content": "Automation is generally the biggest reason to still use batch systems like XyVision. Although batch systems are actually capable of a high degree of typographic control (at least the systems that are holdovers from the early days of electronic typesetting, I'm not so sure about some of the newer ones), the features that keep them in the running these days are their ability to handle huge amounts of work in a small amount of time -- as long as things are set up well. They're not designer-friendly software, but awfully useful for companies that produce a lot of material without a lot of custom layouts.\n\nInertia is a problem with companies that have never stopped using these systems as galley composers, since they're often left with tons of data that can't be converted to other software without effectively starting from scratch. These big systems really come into their own, though, when you use them to process text with standard markup languages (like SGML or XML), rather than their own proprietary coding.\n\nThe learning curve for building formats and workflows is awful (which is why they work better in places that don't need a lot of design customization or manual intervention), but once you've built your typographic and pagination specs, things can go very fast.\n\nFor instance, I work on a similar system (Miles 33) that has a terrible user interface, its own proprietary command language, and an endless list of maddening quirks, but we can bury all that underneath a workflow that lets us take a dump of marked-up text from a database and spit out hundreds of pages of tables, math, text and artwork with little need for the person processing the books to know how it's all put together.\n\nThat set-up might require a huge amount of work for someone else ahead of time, but then formatting and laying out the books themselves is pretty straightforward for everyone else, and the marked-up data can be more easily used for other purposes.\n\n"
    }
  ]
}
