{
  "id": "19438",
  "title": "Doctor Who New Series",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "The new Doctor Who series has a logo that makes you never want to use lens flare again. But what's the font?  \n [doctor who lettering](http://web.archive.org/web/20131013045652/http:/www.grodworks.com/temp/doctorwho.jpg \"lettering\")  \n [logo](http://web.archive.org/web/20131013045652/http:/www.grodworks.com/temp/doctorwhologo.jpg \"logo\")\n\n",
  "author": "grod",
  "time": "22 Apr 2006 — 2:54pm",
  "uid": "5267",
  "comments": [
    {
      "time": "22 Apr 2006 — 2:56pm",
      "content": "I have wondered this myself. I love the new series! But that is an awful font ;-)\n\nOn Doctor Who Confidential last season, they interviewed one of the graphic designers who created a lot of the visuals for the series. For some of the scene work, she did her own digital lettering. Maybe the logo for the series was completely done in house by the BBC, too.\n\n"
    },
    {
      "time": "22 Apr 2006 — 3:03pm",
      "content": "I live in the US so I have to download the episodes with bit torrent after they're broadcast in the UK, and haven't downloaded any Who Confidential episodes, are they worth it, or should I wait for the DVDs? (I'm assuming the best of the confidential would be bonus features on a DVD).  \nAlso, there's a layered PSD of the logo floating around on the interwebs, but the text layer is rasterized so there's no information about what the font is called. Whatthefont doesn't have anything useful, either, so maybe it was in house.\n\n"
    },
    {
      "time": "22 Apr 2006 — 3:17pm",
      "content": "I bought the first series on DVD in November, and saw Confidential then. I live in Germany, and we have the same DVD encoding here that they use in the UK.\n\nAnyway, why wait until July to buy the US DVDs? Season 1 has been on sale in North American format in Canada since February. Amazon.ca ships to the US, too. It just costs a bit more…\n\nI noticed on your profile that you are from Maryland. I'm from Baltimore originally, and grew up watching the old Doctor Who on MPT!\n\nI've seen some \"Doctor Who\" free fonts on the internet, but they all looked auto-traced.\n\n"
    },
    {
      "time": "23 Apr 2006 — 2:02am",
      "content": "[http://www.myfonts.com/fonts/linotype/futura-lt/](http://web.archive.org/web/20131013045652/http:/www.myfonts.com/fonts/linotype/futura-lt/ \"http://www.myfonts.com/fonts/linotype/futura-lt/\")\n\nFutura Condensed (with a bit more condensing) could have been the start.  \nTim\n\n"
    }
  ]
}
