{
  "id": "19431",
  "title": "Weinzierl Slab",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "I am struggling with the uppercase in this slab serif. But the lowercase has been refined the most. Check out the oblique lower case. The body is messed up due to fontographer not publishing my kerning pairs.  \nI was influenced by Nevelle Brody's Insignia, a little bit of Gill Sans, and a hint of Herbert Bayer's universal alphabet.  \nAny feedback would be helpful.  \nThank you,  \nTerrance\n\n ![](http://web.archive.org/web/20150124081649im_/http:/typophile.com/files/wholeset.png)\n\n ![](http://web.archive.org/web/20150124081649im_/http:/typophile.com/files/caps1.png)\n\n ![](http://web.archive.org/web/20150124081649im_/http:/typophile.com/files/caps2.png)\n\n ![](http://web.archive.org/web/20150124081649im_/http:/typophile.com/files/caps3.png)\n\n ![](http://web.archive.org/web/20150124081649im_/http:/typophile.com/files/oblique.png)\n\n ![](http://web.archive.org/web/20150124081649im_/http:/typophile.com/files/body.png)\n\n",
  "author": "weinziet",
  "time": "22 Apr 2006 — 10:20am",
  "uid": "7770",
  "comments": [
    {
      "time": "22 Apr 2006 — 10:34am",
      "content": "The oblique has potential.\n\nhhp\n\n"
    },
    {
      "time": "22 Apr 2006 — 1:44pm",
      "content": "I like it alot! Could become a nice display font.  \nBut you have done some essential mistakes with your horizontal and vertical thickness and with your circled letters!\n\nRead this before you go on:  \n [http://kleindaten.de/kaech/](http://web.archive.org/web/20150124081649/http:/kleindaten.de/kaech/ \"http://kleindaten.de/kaech/\")\n\nSo when you go change your O C G Q, make them look more like perfect circled letters. The S doesnt work. And cut off the bend of the f\n\nBye: Steven\n\n"
    },
    {
      "time": "22 Apr 2006 — 5:09pm",
      "content": "Thanks Steven.  \nI have been reading about optics. It's challenging. Do you think the lc needs to have more optic work done to it? And do you think I should draw the cap s, more organically, or build it from the other geometric parts?  \nThanks again.  \nTerrance\n\n"
    },
    {
      "time": "22 Apr 2006 — 7:03pm",
      "content": "Lc and uc needs more work with it!  \nAnd not only the S have to be more organically.  \nNot every lc needs descenders. I think O G Q D U S I dont need descenders! Shorten the descenders of the lcs a bit that lc and uc descenders dont collide when they are standing side by side.  \nTry to make old-style figure numerals.\n\n"
    },
    {
      "time": "23 Apr 2006 — 6:55am",
      "content": "\"f\" and the \"k\" legs need the most work. Even the \"U\" feels out of place.\n\n"
    },
    {
      "time": "23 Apr 2006 — 3:21pm",
      "content": "I like old-style numerals, but Im not sure they would fit with the design. I have a lot of work to do now. I am also going to do weight experiments and refine the armatures.\n\n"
    },
    {
      "time": "23 Apr 2006 — 4:23pm",
      "content": "I like the oblique and the roman lower case. To me the f, k, t have to be review.\n\n"
    },
    {
      "time": "23 Apr 2006 — 9:56pm",
      "content": "I really like the form of the k. I would retain the idea behind it just make it rounder that it could stand next to an o for example\n\n"
    },
    {
      "time": "24 Apr 2006 — 6:21pm",
      "content": "Are you talking about the lc k or the UP k? I have been reading about optics, and reviewed the article you suggested. It helped a lot. So, now, I have to make optical adjustments to the majority of the characters. It is exam week for me, so I won't be able to work on it for a while. Work coming soon!  \nThank you\n\n"
    },
    {
      "time": "24 Apr 2006 — 7:15pm",
      "content": "I was talking about the lowercase k :)\n\n"
    }
  ]
}
