{
  "id": "19445",
  "title": "Kaled Sans",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "My first attempt at designing a typeface. Still in early stage, but ready for a cirt :)\n\nPartly inspired by City, partly by Briem's Akademi, my goal was to design a display face working with relatively easy, blocky shapes but still challenging myself with Beziers in those curved terminals.\n\n[http://ebukva.cidamon.com/type/](http://web.archive.org/web/20150417202105/http:/ebukva.cidamon.com/type/)\n\nAny suggestions? Is there any extremely similar typefaces out there?\n\nP.S. Sorry for linking; I couldn't upload the attachments through the form for some reason. (I'll try to get a pdf up soon)\n\n",
  "author": "boole",
  "time": "22 Apr 2006 — 9:50pm",
  "uid": "1393",
  "comments": [
    {
      "time": "23 Apr 2006 — 7:51am",
      "content": "I really like the joins!\n\nThis may be personal preference, but it feels to me that your OSFs ascenders and descenders don't ascend and descend quite enough. If you have a good reason for where they stop then it's not worth quibbling over; otherwise maybe try extending them just a little.\n\nThis begs the question, though: how much should OSFs ascend and descend? I defer to someone with more experience!\n\n"
    },
    {
      "time": "23 Apr 2006 — 8:11am",
      "content": "This is not only sufficiently original, but I think it's  \nactually a pretty nice addition to the spectrum as well.\n\nOS num extenderness: for text fonts I'm a big fan of hybrids, where the bodies are larger than the x-height while the extenders are shorter than in the lc; this strikes the best balance in running text. But for a design like this it might be a better idea to be more \"dramatic\" (and geometrically congruent) maybe by keeping the bodies small (at the x-height) and making the extenders a bit long.\n\nBTW, great pragmatism in your zero.\n\nhhp\n\n"
    },
    {
      "time": "23 Apr 2006 — 8:21am",
      "content": "More, on the alphabetics:\n\n- Since this has an element of blackletter in it, I might do things like make the right stem of the \"h\" descend (and probably turn left instead of right).  \n- The \"r\" is out of character.  \n- The \"f\" is slightly narrow, but the \"t\" is definitely so.  \n- I would encourage you to try a binocular \"g\", maybe Koch-style.  \n- The \"s\" is leaning forward; instead of shortening the top bar, I might leverage the diagonal part of the spine.  \n- I don't think the \"v\" and \"w\" are working.  \n- The \"Q\" is da bomb. So is the \"z\".  \n- The \"J\" needs to go lower, and might benefit from a top half-serif.  \n- \"p\": unless you apply my suggestion of lowering and flipping the right stem of the \"h\", I would flip its terminal the other way.\n\nhhp\n\n"
    },
    {
      "time": "23 Apr 2006 — 1:32pm",
      "content": "Thanks for the feedback.\n\n\\>\\>OSFs ascenders and descenders don’t ascend and descend quite enough  \nSomehow, they look out of proporion when they're long. However, I started with really long ascenders and descenders and I think I overcompensated a little when I made the smaller. I'm surre they can be a little longer and still look proportionate.\n\n\\>\\>BTW, great pragmatism in your zero.  \nThanks :). “l” also works nicely with “I” in “Illicit” for example (didn't Matthew carted call these “picket fences”?)\n\n\\>\\>The “Q” is da bomb. So is the “z”.  \n“Q” is my favorite. I'm getting a lot of mixed feedback about it though. Binocular g is definitely on my list, along with some alternates and ligatures.\n\nThanks\n\n"
    },
    {
      "time": "7 Oct 2008 — 6:57am",
      "content": "I have to design a type face for a uni project, you've done well for a first one. What program did you use and what letters did you start with? I don't know where to start.\n\n"
    },
    {
      "time": "11 Dec 2008 — 8:54pm",
      "content": "goofs edited! mgk\n\n"
    },
    {
      "time": "11 Dec 2008 — 8:53pm",
      "content": "I like the concept. The only things that jumped out at me were the upper terminal on the numeral 5 and the @ sign, which is cumbersome. Otherwise, looks like it might be a very useful font.\n\nmgk\n\n"
    }
  ]
}
