{
  "id": "19444",
  "title": "(x) Staging Solutions baroque script logo - Vivaldi {Yves}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi,  \nI think I posted my last request incorrectly... I am looking for help identifying the attached typeface. Any info would be appreciated.  \nThanks  \nLori\n\n ![](http://web.archive.org/web/20080829113127im_/http:/www.typophile.com/files/Typeface.jpg)\n\n [‹ RTP logo](http://web.archive.org/web/20080829113127/http:/www.typophile.com/node/19456 \"Go to previous forum topic\") [Doctor Who New Series ›](http://web.archive.org/web/20080829113127/http:/www.typophile.com/node/19438 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080829113127/http://www.typophile.com/user/12610\" title=\"View user profile.\">LorianneMayo</a>",
  "time": "<br>",
  "uid": "12610",
  "comments": [
    {
      "time": " 22.Apr.2006 5.07pm",
      "content": "This is very strange the attached sample is not the sample that I attached. I’ll try to attach my actual sample again.\n\n"
    },
    {
      "time": " 22.Apr.2006 5.32pm",
      "content": "In the database is a picture that uses the same name as yours! just rename yours and upload it again! Then it will work!\n\n"
    },
    {
      "time": " 23.Apr.2006 8.07am",
      "content": "There should probably be a note in the FAQ about naming your images something unique before posting them... This happened to me too, the first time I added an image. Unless you know how the site treats the files, there’s no reason not to name your image something generic like “sample.jpg”.\n\n"
    },
    {
      "time": " 23.Apr.2006 8.28am",
      "content": "\\> naming your images something unique\n\nThat’s not a good solution.  \nThe old system assigned sequential numbers to posted images, so no confusion was possible. In this new filename-based setup, maybe a good tweak would be for the system to append (I would prefix) the username (which is unique) to the filename.\n\nhhp\n\n"
    },
    {
      "time": " 23.Apr.2006 9.00am",
      "content": "\\> maybe a good tweak would be for the system to append (I would prefix) the username (which is unique) to the filename\n\nThat would be very elegant. Is there a reason it’s not being done that way already?\n\n"
    },
    {
      "time": " 23.Apr.2006 9.49am",
      "content": "Thanks very much for the advice. I’ve renamed the file and will post it again.  \nLori\n\n"
    },
    {
      "time": " 23.Apr.2006 10.14am",
      "content": "Here you go...\n\n ![](http://web.archive.org/web/20080829113127im_/http:/www.typophile.com/files/Lorianne.gif)\n\nhhp\n\n"
    },
    {
      "time": " 23.Apr.2006 10.19am",
      "content": "Thanks Hrant!  \nLori\n\n"
    },
    {
      "time": " 23.Apr.2006 10.30am",
      "content": "We’re looking at a very nastily bitmapped [Vivaldi](http://web.archive.org/web/20080829113127/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&startrow=1&records=20&currpage=1&totalrecords=8&searchby=&searchID=&searchletter=&searchstr=vivaldi&font_categories_checkbox=font_name_search&fontRendererText=Staging+Solutions).\n\n"
    },
    {
      "time": " 23.Apr.2006 10.33am",
      "content": "BTW I know the new filename-based uploading system sucks big time. I really don’t have a clue why they changed and it constantly creates confusion (oooh what a nice alliteration :^P) I’m not sure if this is being addressed, but I’ll check with the codemeister.\n\n"
    },
    {
      "time": " 23.Apr.2006 10.59am",
      "content": "Dear Bald Condensed,  \nThank You, Thank You, Thank You!!  \nThe minute I read it I knew you were right!!!  \nI’ll refer this website to all my friends!!!  \nLori\n\nPS, yes very nastily bitmapped!! and you’re right, I never was able to post anything with my messages. I saved to a gif file and jpg, and named it something arcane, but the system kept telling me it couldn’t find the file. Is there a trick to posting a sample? I’d like to be able to use this forum again.  \nThanks!\n\n"
    }
  ]
}
