{
  "id": "19459",
  "title": "First Riverdale Review Nameplate (Humanist?)",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I know I said that I wouldn’t be back until the redesign had percolated a bit more, but after the amazing help I received yesterday on what I now know to be a blackletter/art nouveau nameplate, I thought that I’d see whether I could get a bit of help ID-ing a few more old nameplates. If this one goes well (and you Typophiles would like to help out even more), I’ll post the other two in separate topics; they’re each pretty distinct.\n\n[This](http://web.archive.org/web/20080629055555/http:/i48.photobucket.com/albums/f202/auricfuzz/RRFirstLogo2copy.jpg) one is the very first logo we used, starting in 1917 and ending approximately 1930. It’s a very soft, rounded font that I, in my limited typographical knowledge, would call humanist because of the minimal contrast and oblique stress. Like my original blackletter, it could be hand drawn or have never been digitized, but I thought I’d give it a shot.\n\nFor those who are interested, the other two nameplates that I’m not sure about are a script mixed with an outline serif and a “groovy” font that I feel like I’ve seen before. I’ve identified other nameplates from the Review’s history that used Bodoni, Broadway (although the uc r is slightly different in ours), Monotype Engravers Old English, Helvetica, and Times. I was surprised to see how much we’ve changed over the years, so I’m thinking that for the coming year, my school’s centennial, I might try replacing our current or future nameplate with some of these. So if I can get these three unidentified nameplates fixed, this might become a reality. Thanks a ton in advance.\n\n [‹ Fonts used to write \"Gessle\"](http://web.archive.org/web/20080629055555/http:/typophile.com/node/19455 \"Go to previous forum topic\") [(x) \"Furniture\" simple sans - Gotham {Tiff} ›](http://web.archive.org/web/20080629055555/http:/typophile.com/node/19484 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080629055555/http://typophile.com/user/11702\" title=\"View user profile.\">auricfuzz</a>",
  "time": "<br>",
  "uid": "11702",
  "comments": [
    {
      "time": " 23.Apr.2006 5.50pm",
      "content": "Anyone? In case it’s hard to see the link to the image (I’m having trouble on my monitor at least), here it is again: [Link](http://web.archive.org/web/20080629055555/http:/i48.photobucket.com/albums/f202/auricfuzz/RRFirstLogo2copy.jpg). Any help would be greatly appreciated.\n\n"
    },
    {
      "time": " 24.Apr.2006 2.38am",
      "content": "A font by Dieter Steffman (Benlamin Franklin) looks as though it’s based on your banner font. Don’t have time to track the real thing down at the mo, but this might be a useful line of enquiry.  \n [http://www.moorstation.org/typoasis/designers/steffmann/samples/b/benjam...](http://web.archive.org/web/20080629055555/http:/www.moorstation.org/typoasis/designers/steffmann/samples/b/benjamin.htm \"http://www.moorstation.org/typoasis/designers/steffmann/samples/b/benjamin.htm\")\n\n"
    },
    {
      "time": " 24.Apr.2006 3.59am",
      "content": "Wow! Privateortheris, that looks great! It definitely seems to be based on my font. Only the lc a’s and e’s seem significantly different. Out of curiousity, how would you plan on “tracking” the real thing down? Although it seems based on something, I’m unsure how to get any closer to the real font. I’m happy to do some searching on my own if someone would tell me where to luck. Thanks again, privateortheris!\n\nJust got finished searching myfonts. Good matches include Cooper Old Style (probably the best), Windsor, Goudy Catalogue, and Cooper BT. Couldn’t find any other good matches on myfonts, but these were encouraging.\n\n"
    },
    {
      "time": " 24.Apr.2006 6.16pm",
      "content": "Seemed like Typophile was down today (at least for me) and my post got a bit buried. Can anyone help me identify the font in my nameplate, which privateortheris’ Benjamin Franklin suggestion seems based on? Thanks.\n\n"
    }
  ]
}
