{
  "id": "19456",
  "title": "RTP logo",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi again. :)\n\nAlso, and while I’m here, I wonder if I might take the chance to request for another type id?…\n\nI’ve been trying but having a hard time identifying this font family (have, also for this one, asked about in other forums, yet so far no luck), and I’d very much appreciate it if someone might please help…\n\nFor bigger display of the logos I attached to this thread, please see: [RTP-logo1](http://web.archive.org/web/20070108171813/http:/www.rtp.pt/web/rtp_nova_imagem/holding/logotipo/rtp_holding/h/RTP%20RGB%20positivo%20horizontal.jpg) and [RTP-logo2](http://web.archive.org/web/20070108171813/http:/www.rtp.pt/web/rtp_nova_imagem/rtp/logotipos/rtp/h/RTP%20RGB%20positivo%20horizontal.jpg)\n\n(In the samples I provide, I know there is more than a single weight of this font, yet don’t mind about identifying each specific weight, no need for all such trouble, I only wish and very much will be happy to find out the name of just the font family for this typeface. Also, if additional samples would be required, I can provide. Or alternatively, you can browse through the site of [RTP](http://web.archive.org/web/20070108171813/http:/www.rtp.pt/), where you’ll find more samples of this font.)\n\nThank you greatly, once again, for any help. :)\n\n ![](http://web.archive.org/files/rtp.jpg)\n\n",
  "author": "<a href=\"user/12617\" title=\"View user profile.\">sweepi</a>",
  "time": "<br>",
  "uid": "12617",
  "comments": [
    {
      "time": " 23 April, 2006 - 10:36am",
      "content": "I think this one might be custom designed — see [this old thread](http://web.archive.org/web/20070108171813/http:/www.typophile.com/node/6488).\n\n"
    },
    {
      "time": " 23 April, 2006 - 10:56am",
      "content": "It’s custom. An old classmate of mine works in RTP and he said it was done in-house. AFAIK, it was not even converted into a font, as they work with Freehand outlines.\n\nBTW, logos and guidelines for their usage can be found here  \n [http://tv.rtp.pt/wportal/press/identidade\\_rtp/index.php](http://web.archive.org/web/20070108171813/http:/tv.rtp.pt/wportal/press/identidade_rtp/index.php)\n\n"
    },
    {
      "time": " 23 April, 2006 - 12:01pm",
      "content": "Oh so it’s custom made, hmm, so I see… (Such a pity then, though, as I really liked that type style…)\n\nThank you so much for your replies and clearup!\n\nAlso, still thank you, Miguel Sousa, for the link to RTP’s documentation regarding their logos and usage of them. (Been through all those documents already before, throughout my search. :-))\n\nCurious though, before deciding to post, I had previously searched over the forum, for “RTP”, yet it had returned no results, thus why I started this new thread. But so there was actually a previous thread about it! Ooops, sorry for having asked again, then. :-/ Yet, the funniest, I just searched the forum again, and still it returns no results for “RTP”… :-S This has me wondering, does the search only go through the texts within threads, and not the title lines, is that it?… Or?…\n\nThank you again, for your patience. :)\n\n"
    }
  ]
}
