{
  "id": "19455",
  "title": "Fonts used to write \"Gessle\"",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi. :)\n\nI’ve been looking to identify the fonts used in the image attached, yet with very little success so far, and I’d very much appreciate any further help...\n\nThen again, this particular case isn’t quite that of asking about one font in one thread, still I’m hoping it’s ok to post the entire original picture with the various fonts in one single thread (?), also because some fonts are superimposed to eachother, and then the entire picture does “work as a whole” so to speak, thus I believe it’s just more practical to post the picture entire, also for later tracking... (If not though, and should I be required to cut the picture to isolate each of the individual fonts and ask about each of them in new individual threads, please do advise, and thank you for your understanding, if by posting the picture entire I chose to do things the wrong way from the start.)\n\nAlso, one more note, regarding the types which are cut off (the 1st and the 7th), unfortunatelly that is actually really the whole of the original image, thus I can’t provide it any different, I’m sorry... :/ (If still there’s any chance to get to an identification of also those fonts, I thank you for any help.)\n\n(I have also previously asked about in other font identification forums, therefore a similar post may have been seen elsewhere. No conclusive id has been reached, though, in neither of those forums, that’s why I thought I’d ultimately share my request for help also here.)\n\n(From my own research, this is what I have so far:)\n\nI have (thanks to Mike Yanega’s most useful [“Bauhaus-Style” Font Identification Guide](http://web.archive.org/web/20071024005201/http:/bowfinprintworks.com/BauhausFaces1B.html) :)) identified (I believe that correctly?) the 5th font (starting from top, left to right) as [Pump Triline](http://web.archive.org/web/20071024005201/http:/www.myfonts.com/fonts/linotype/pump-2/pump-triline/).\n\nThen I’ve come to (maybe) [Giza FiveSeven](http://web.archive.org/web/20071024005201/http:/www.myfonts.com/fonts/fontbureau/giza/fiveseven/) and [AG Book Stencil BQ](http://web.archive.org/web/20071024005201/http:/www.myfonts.com/fonts/berthold/ag-book-stencil-bq/) for the 3rd and 4th fonts respectively, although I’m not completely certain about these?... (AG Book Stencil looks somewhat “less widened” than the actual font, and as for Giza, I’m also not 100% sure even whether FiveSeven would be the weight to best match the font used?...)\n\n(From helpers at other forums, this is what I have so far:)\n\nThen, for the font in the bottom line (the 7th in the image), it’s been hinted at another forum that it is like [P.T. Barnum](http://web.archive.org/web/20071024005201/http:/www.myfonts.com/fonts/bitstream/p-t-barnum/), but with a shadow, and yes, as I replied then too, indeed, P.T. Barnum does come rather close to it, however, the side of the “G” looks a bit more curved, whereas in the actual font it looks more flat... So I don’t know?...\n\nAlso, at yet another forum, for the 6th font, PizzaDude’s free font [Balls on the Rampage](http://web.archive.org/web/20071024005201/http:/www.1001fonts.com/font_details.html?font_id=2485) has been suggested, which, yes, also comes close, yet, the actual font in the image looks as it isn’t so “boldened”, having more space between each of the dots which makes each of them to be perfectly individualized, whereas in Balls on the Rampage the dots seem as they’re all “connected” to eachother, which results in a distinct less sharpened/clean pattern... Then again, and in regards to dotted fonts, I have also been told about the possibility of filling a solid font with dots, something which I actually wasn’t aware of, thus I wonder then if this might even be the case here (and even also for the 1st font), and then which originally solid fonts would those be?...\n\nIf anyone can please give any further help, again, I’d be most appreciated, thank you so much already! :)\n\n ![](http://web.archive.org/web/20071024005201im_/http:/typophile.com/files/twatg.gif)\n\n [‹ (x) Esquire ad font - Infinity {Chris Keegan}](http://web.archive.org/web/20071024005201/http:/typophile.com/node/19475 \"Go to previous forum topic\") [First Riverdale Review Nameplate (Humanist?) ›](http://web.archive.org/web/20071024005201/http:/typophile.com/node/19459 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071024005201/http://typophile.com/user/12617\" title=\"View user profile.\">sweepi</a>",
  "time": "<br>",
  "uid": "12617",
  "comments": [
    {
      "time": " 23.Apr.2006 6.14pm",
      "content": "The top one looks like [Helvetica Heavy Extended](http://web.archive.org/web/20071024005201/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=M.125966.0.5&attributes.sampleSize=48&sampleText=GESSLE&sampleSize=48) with dots added afterwards (the dots line up exactly over the entire word, and the two ’E’s don’t match).\n\nThe fourth is a stencil version of [Helvetica Bold](http://web.archive.org/web/20071024005201/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=LH.107997.0.5&attributes.sampleSize=48&sampleText=GESSLE&sampleSize=48). This could have been done “in post” so to speak.\n\nThe fifth is a hand-retracing of [Pump Triline](http://web.archive.org/web/20071024005201/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=EF.6453.0.5&attributes.sampleSize=48&sampleText=gessle&sampleSize=48).\n\nThe seventh looks like [Circus](http://web.archive.org/web/20071024005201/http:/www.myfonts.com/fonts/itfmecanorma/circus/circus/testdrive.html).\n\n- Lex\n\n"
    },
    {
      "time": " 24.Apr.2006 6.22am",
      "content": "(remove this post)\n\n"
    },
    {
      "time": " 24.Apr.2006 11.47am",
      "content": "Thank you for you reply and help, Lex Kominek. :-)\n\nI have some doubt, however, regarding the 1st font, about it being, as you suggested, Helvetica Heavy Extended.\n\nHere’s where my doubt comes from:\n\nIn Helvetica Heavy Extended, the spur of the “G” is oblique in its inner-side/left-side (I’m sorry, but I don’t know how to call it in a more correct way, still I hope you know what I mean?), whereas in the actual font it is perfectly vertical.\n\nAlso, in the “E”, in the actual font, the middle-bar of it seems to be more “out of alignement”, compared to the lower horizontal-bar, than it does in Helvetica Heavy Extended (i.e. the middle-bar appears to be even shorter, compared to the lower horizontal-bar, in the case of the actual font, than it is in Helvetica Heavy Extended).\n\nAnd still in the “E”, the space between the horizontal-bars (even compared with the width of the horizontal-bars themselves) appears to be less in the actual font than it is in Helvetica Heavy Extended.\n\n(Don’t know if any of this justifies for my doubt?...)\n\nThen again, for the 7th font, yes, Circus is also close. Though the “engraving/shadow lines” in parts are somewhat different (that is especially notorious in the “S”)... But still the thickness proportion of the main font lines seems to be yet closer to that of P.T. Barnum?\n\nAlso, one other doubt, that just came to mind. The 2nd font, that western-like patterned one, is that which most seduces me, yet I was wondering now, could it also be the case that such an inside-pattern might also result from some kind of editing of an originally solid font?... (Or maybe I’m just thinking and saying plain nonsense?... Pardon my ignorance.)\n\n"
    },
    {
      "time": " 24.Apr.2006 5.47pm",
      "content": "Not a match for the dotted font, but close: [FF Pop LED](http://web.archive.org/web/20071024005201/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=FF.2963.0.2&attributes.sampleSize=48&sampleText=GESSLE&sampleSize=96)\n\n"
    },
    {
      "time": " 24.Apr.2006 6.25pm",
      "content": "The top might be a different weight of Helvetica, stretched out. I’m 99.9% sure it’s some form of Helvetica.\n\nThe pattern on the second font is probably part of the font. You can see a similar style in [Rosewood or Zebrawood](http://web.archive.org/web/20071024005201/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontpackage&startrow=1&records=&currpage=1&totalrecords=7&displayfontid=C.8037.0.0&fontRendererText=GESSLE).\n\n- Lex\n\n"
    }
  ]
}
