{
  "id": "19463",
  "title": "Need typeface to pair with Univers",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am looking for a nice secondary font to pair with univers. Something readable at small sizes. Any suggestions? Thanks in advance!\n\n",
  "author": "mpolino",
  "time": "23 Apr 2006 — 8:10pm",
  "uid": "12548",
  "comments": [
    {
      "time": "24 Apr 2006 — 5:06am",
      "content": "\"  \nThe font Univers combines well with:  \nFonts with Old Face proportions, like Janson Text™, Meridien™, Sabon™, Wilke™.  \nFonts with Modern Face proportions, like Linotype Centennial™, Walbaum.  \nSlab serif fonts like Egyptienne F™, Serifa®.  \nScript and brush fonts like Brush Script, Mistral™, Ruling Script™.  \nBlack letters like Duc de Berry™, Grace™, San Marco™.  \nFun fonts like F2F OCRAlexczyk™, Linotype Red Babe™, Linotype Seven™.  \n\"\n\n-Linotype\n\n"
    },
    {
      "time": "24 Apr 2006 — 5:20am",
      "content": "Well, I always thought that Univers works beautifully with Bodoni. I usually use the ITC version with three optical sizes 6,12 and 72. I also think [Walbaum Text](http://web.archive.org/web/20150225214325/http:/www.stormtype.com/typefaces-fonts-shop/index.php) from [Storm Type](http://web.archive.org/web/20150225214325/http:/www.stormtype.com/) would be a good pairing as well.\n\nI haven't used Univers enough to provide any further suggestions.\n\n"
    },
    {
      "time": "26 Apr 2006 — 1:13pm",
      "content": "i have seen it paired with caslon also to good effect\n\nin david jury's 'about face'  \n [http://www.powells.com/cgi-bin/biblio?inkey=17-2880466776-6](http://web.archive.org/web/20150225214325/http:/www.powells.com/cgi-bin/biblio?inkey=17-2880466776-6 \"http://www.powells.com/cgi-bin/biblio?inkey=17-2880466776-6\")\n\n"
    },
    {
      "time": "22 Aug 2007 — 2:09am",
      "content": "A year and a half late but for anyone doing searches.  \nThe perfect pair to Univers is it's sister font: A slab serif called serifa. It is basically a slab serif based on Univers and the two typefaces work tremendously well together.\n\n"
    },
    {
      "time": "22 Aug 2007 — 5:39pm",
      "content": "Pretty much any serif face will work with Univers, choice depending on whether you want to match Univers' tone (vanilla) or add a bit of flavour. For small sizes of course you want something fairly sturdy. Storm's Baskerville Ten Pro is one of many that would work.\n\n"
    },
    {
      "time": "16 Sep 2007 — 5:24pm",
      "content": "Maybe its a bit late, but I think Bulmer works great\n\n[http://www.linotype.com/193/bulmer-family.html](http://web.archive.org/web/20150225214325/http:/www.linotype.com/193/bulmer-family.html \"http://www.linotype.com/193/bulmer-family.html\")\n\n"
    },
    {
      "time": "17 Oct 2007 — 10:36pm",
      "content": "Univers and Glypha work really well together, as they should: both are Frutiger designs. I prefer Glypha to Serifa because it's a bit stronger weight in the strokes. I've used them in both directions: Univers for titling, captions and headlines with Glypha as the body copy font, and vice versa.\n\nWhichever one I use for titling, I find there are benefits to range tracking to make it look fresher and a bit more contemporary. I use 1 point of condensed tracking for a 24 point font size; 1.5 for 36 points, etc...Then add pair-specific kerning where needed.\n\nGlypha 75 also works well as the titling font with other Egyptians as the body copy; e.g., I've used it with Canada Type's Clarendon Text to very good effect.\n\n"
    }
  ]
}
