{
  "id": "19476",
  "title": "Open Type Helvetica for all european languages?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi There,\n\nIs there any Linotype expert over there who can help me a little?\n\nOne of our clients at Smidswater need to buy an OT version of Helvetica with the characters for ALL european languages.  \nWe need also a good set of versions.\n\nThe Linotype versions I had the opportunity to check support only Latin1, cyrilic and some extra accents, but not all the necessary for Central European texts.\n\nThanks in advance.\n\nRamiro Espinoza.  \n [ramiro.espinoza@smidswater.nl](mailto:ramiro.espinoza@smidswater.nl)\n\n",
  "author": "<a href=\"/web/20110208194801/http://typophile.com/user/1137\" title=\"View user profile.\">Ramiro Espinoza</a>",
  "time": "<br>",
  "uid": "1137",
  "comments": [
    {
      "time": "",
      "content": "Hi Ramiro,\n\nWe have Helvetica World for this purpose.  \n [http://www.linotype.com/48344/helveticaworld-family.html](http://web.archive.org/web/20110208194801/http:/www.linotype.com/48344/helveticaworld-family.html \"http://www.linotype.com/48344/helveticaworld-family.html\")\n\nCheers,  \nDan\n\n"
    },
    {
      "time": "",
      "content": "Hi Dan,  \nThanks a lot. Tell me, aren't there more version of this Helvetica?  \nAs far as I can see Linotype sells only regular, bold, italic and bold italic...\n\n"
    },
    {
      "time": "",
      "content": "Helvetica World is only available in those four styles.\n\nIf you buy the OpenType \"Com\" versions of the regular [Helvetica](http://web.archive.org/web/20110208194801/http:/www.linotype.com/526/helvetica-family.html), which has a more styles, they include support for 48 European languages (basically everything used in Europe except Greek or the languages that use Cyrillic… ALL CE languages are supported).\n\nYou can see which styles have OT format fonts available by looking at the font format icons on each font display: there is one for OT that uses the familiar round O OpenType icon.\n\n[Here is a list of those languages.](http://web.archive.org/web/20110208194801/http:/www.linotype.com/16454/48languagessupportedinopentypecomfonts-doc.html)\n\n[Neue Helvetica](http://web.archive.org/web/20110208194801/http:/www.linotype.com/1266/neuehelvetica-family.html) has OpenType \"Com\" fonts as well. Or you can by \"Pro\" versions of Neue Helvetica. These are a little cheaper because they support less languages (just the Pro languages… [here is a list of them](http://web.archive.org/)… it is shorter than Com but it still includes all of the CE languages).\n\nNote that there is a package of all 51 Neue Helvetica fonts available in OT format for $749. These are just \"Pro\" fonts, though. Not \"Com\" fonts.\n\nUnfortuantely the only OT Helveticas that have all the CE fonts plus Greek and Cyrillic in them are the four Helvetica World styles. Sorry :(\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the help, Dan!\n\nRamiro\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the help, Dan!\n\nRamiro\n\n"
    }
  ]
}
