{
  "id": "19471",
  "title": "“What a VOLTing development that was!\"",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[Type Directors Club](http://web.archive.org/web/20070809002314/http:/typophile.com/wiki/Type%252BDirectors%252BClub) (TDC) FontTech Weekend (sponsored by Adobe, Microsoft, and Monotype) featured starring roles by presenters [John Hudson](http://web.archive.org/web/20070809002314/http:/typophile.com/wiki/John%252BHudson), [Adam Twardoch](http://web.archive.org/web/20070809002314/http:/typophile.com/wiki/Adam%252BTwardoch), [Thomas Phinney](http://web.archive.org/web/20070809002314/http:/typophile.com/wiki/Thomas%252BPhinney), and [Diane Collier](http://web.archive.org/web/20070809002314/http:/typophile.com/wiki/Diane%252BCollier).  \nTDC Chairman James Montalbano led a cast of Typophile characters ( [Paul Hunt](http://web.archive.org/web/20070809002314/http:/typophile.com/wiki/Paul%252BHunt), [William Berkson](http://web.archive.org/web/20070809002314/http:/typophile.com/wiki/William%252BBerkson), [Chester Jenkins](http://web.archive.org/web/20070809002314/http:/typophile.com/wiki/Chester%252BJenkins), and [yours truly](http://web.archive.org/web/20070809002314/http:/typophile.com/wiki/Chris%252BLozos)) as participants (along with several folks from the REAL world).The ever-gracious Carol Wahler was a wonderful host and made us all feel very at home. John Hudson deserves special gratitude for persevering through his presentations in spite being sick as a dog (please don’t sing “Mad dogs and Englishmen”). Thomas gets the award for best screen-saver with beautiful pictures of his daughter Miranda and Adam Twardoch’s “laptop” wins the “most likely to succeed as a lethal weapon” award. Diane Collier gets my vote for the best one-liner with the quip, “And this is easier than VTT because?...”  \nSeriously, it was a great event and I highly recommend it to all type geeks interested in the murky waters of opentype and hinting. Thomas is giving more of the same in Lisbon so if you missed this, you might fly over to AtypI.\n\nMany thanks to TDC and the presenters for making it all possible!\n\nChrisL\n\n ![](http://web.archive.org/web/20070809002314im_/http:/typophile.com/files/Durante.jpg)\n\n [‹ Nebiolo rights](http://web.archive.org/web/20070809002314/http:/typophile.com/node/19359 \"Go to previous forum topic\") [Where are the women? ›](http://web.archive.org/web/20070809002314/http:/typophile.com/node/19397 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070809002314/http://typophile.com/user/3135\" title=\"View user profile.\">dezcom</a>",
  "time": "<br>",
  "uid": "3135",
  "comments": [
    {
      "time": " 24.Apr.2006 6.44am",
      "content": "Chris, I’m glad to hear the event was a success. Hopefully such advanced courses will become a permanent and regular part of the TDC calendar.\n\n"
    },
    {
      "time": " 24.Apr.2006 7.20am",
      "content": "Perhaps, as FontLab Studio 5 and type designers technical savvy further matures over the next year we can have a super geek weekend of VTT vs FontLab in hinting tag team match. Particpants would bring a finished TrueType font, and be guided through the hinting process, one day in VTT and one day In FLS5.\n\nJames\n\n"
    },
    {
      "time": " 24.Apr.2006 11.03am",
      "content": "James, That sounds like a hinting Battle-of-the-Bands :-)\n\nSi, I also hope TDC will keep up the supply of advanced type development seminars.  \nBTW, We all missed you Si and drank your share of the beer :-)\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2006 11.05am",
      "content": "I also want to thank the little birdie who added all the wiki links to my post Paul :-)\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2006 11.17am",
      "content": "I forgot to mention that Paul Hunt gets the stealth teacher award for going around and quietly helping all of us lesser beings get up to speed with what the premier pro geeks were doing.\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2006 11.30am",
      "content": "stop or you’ll make me start blushing! ;^P\n\nbut seriously, it was a great little workshop. i wish more of you would have been able to make it.\n\n"
    },
    {
      "time": " 24.Apr.2006 11.32am",
      "content": "I was hoping we could make John Hudson start blushing; he was looking pretty pale there.\n\nChrisL\n\n"
    },
    {
      "time": " 24.Apr.2006 7.27pm",
      "content": "The TDC is committed to continue doing these sorts of seminars. All suggestion as to possible secenarios and subject matter are welcome.\n\nJames\n\n"
    },
    {
      "time": " 25.Apr.2006 6.01am",
      "content": "Thanks James!  \nI for one would like to see one on kerning. Class based kerning and exceptions with the effect of diacritics; what can be done with combining glyphs built on the fly; classes accross scripts (probably Greek Cyrillic, and Latin).  \nI would also like to see sessions on building non-Latin scripts.  \nOthers sessions on family extension strategies and workflow.\n\nI hope others will chime in and give some potential topics for TDC or others to consider.\n\nChrisL\n\n"
    }
  ]
}
