{
  "id": "19482",
  "title": "German Grotesks and the origins of sanserif",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am interested in the origins of [grotesque](http://web.archive.org/web/20150123081800/http:/typophile.com/wiki/grotesque) typefaces in nineteenth-century [Germany](http://web.archive.org/web/20150123081800/http:/typophile.com/wiki/Germany).\n\nIn my opinion, the relevance of the Grotesk typology in the context of the birth and early development of the [sanserif](http://web.archive.org/web/20150123081800/http:/typophile.com/wiki/sans%20serif) has perhaps been underestimated by a historiographic tradition focused on Anglo-American achievements. Some indications:\n\n– Most sources agree that [William Thorowgood](http://web.archive.org/web/20150123081800/http:/typophile.com/wiki/William%20Thorowgood) released the first sanserif lowercase in 1834. Nevertheless, it seems that the [Schelter & Giesecke](http://web.archive.org/web/20150123081800/http:/typophile.com/wiki/Scheltzer%20and%20Giesecke) foundry (Leipzig) had produced a light sans serif with both capitals and lower case letters by 1825. (Source: Lawson, Anatomy of a Typeface, p. 297). I find this doubtful, but if proven, this face would be not only prior to Thorowgood´s (and even [Figgins](http://web.archive.org/web/20150123081800/http:/typophile.com/wiki/Figgins)') but far more sophisticated.\n\n ![](http://web.archive.org/web/20150123081800im_/http:/typophile.com/files/thorow.gif)\n  \nThorowgood 1834\n\n ![](http://web.archive.org/web/20150123081800im_/http:/typophile.com/files/schlanke.gif)\n  \nSchelter&Giesecke 1825\n\n– The Grotesk typefaces were used in the nineteenth century for setting [body text](http://web.archive.org/web/20150123081800/http:/typophile.com/wiki/body%20text) (namely in scientific and technical publications), long before the american [gothics](http://web.archive.org/web/20150123081800/http:/typophile.com/wiki/gothic) left display and jobbing as their exclusive tasks. (Source: [http://www.typolexikon.de/g/grotesk.html](http://web.archive.org/web/20150123081800/http:/www.typolexikon.de/g/grotesk.html \"http://www.typolexikon.de/g/grotesk.html\"))\n\n– Looking at specimens from late nineteenth century, one finds a very remarkable level (for the time) of formal development, and perhaps even a tendency towards systematization and coordination of [weights](http://web.archive.org/web/20150123081800/http:/typophile.com/wiki/weight) and sizes. (Source: Schelter&Giesecke specimen, c.1898)\n\n ![](http://web.archive.org/web/20150123081800im_/http:/typophile.com/files/schelter05.gif)\n\nAny argument or contribution is more than welcome. I´d like also to pose these questions to the forum:\n\n1. When did the first Grotesk appear in Germany?\n\n2. Which typeface would be the first in including a lowercase in that country (if the Lawson statement is erroneous)?\n\n3. When did the sanserif started to be used as a text face there?\n\nThank you very much,\n\nXurxo\n\n",
  "author": "xurxo_insua",
  "time": "24 Apr 2006 — 11:21am",
  "uid": "3295",
  "comments": [
    {
      "time": "25 Apr 2006 — 4:21am",
      "content": "The collection of samples (the S&G and Thorowgood sanserifs together) suggests to me that images and data were taken from P.M. Handover's article \"Grotesque Letters\" (in Monotype News Letter 69, March 1963). There however, the \"1825\" reads \"? ca 1825\" ...\n\nTo date this Schelter & Giesecke sanserif, called \"Schlanke Grotesk\", back to 1825 is a mistake. Unfortunately, subsequent writer just copied this from Mrs Handhover. So much for writing history of type.  \nAs you already noted, it is so perfect that it cannot be from such an early date. It can be found in part one of the \"Muster-Sammlung\", of 1886. But it should be hard to trace this back earlier for type specimens weren't dated back then.  \n(Side note: In the S&G specimen books you find other sanserif of much lower quality, more like the early British ones. These were -- I bet -- produced earlier than the fine \"Schlanke Grotesk\" which you showed, but later than the early British ones.)\n\nKarsten\n\n"
    },
    {
      "time": "25 Apr 2006 — 8:30am",
      "content": "_But it should be hard to trace this back earlier for type specimens weren’t dated back then._\n\nOne would have to compare type in dated magazines with type in foundry specimens.  \nSend in the Type Scene Investigators!\n\nI say magazines, because that is the kind of printing where sans serifs were mainly used, although the German scientific tradition of using sans faces would be worth exploring, in scientific publications.\n\n"
    },
    {
      "time": "25 Apr 2006 — 11:41am",
      "content": "Or printing trade publications/advertisement. Sadly, my little library is not that well equipped ...\n\nBut then: There is the \"Handbuch der Schriftarten\" (1926-) which shows typefaces of different foundries -- by similarity. With this in mind, I wonder if \\*only\\* searching magazines would suffice to decide whether a typeface appearing in a magazine is grotesk a from foundry A or grotesk b from foundry B, because they were almost identical.  \nThat discussion today is centered around Akzidenz Grotesk so much, with some Schelter & Giesecke Breite Grotesk here and there (but only because of the revival which serves as a reminder), is a bit funny if we take into account that at its time, AG was but one among many, all of them very similar to each other. Even to experts' eyes. Similarly, almost every German foundry hat a Breite Grotesk, some better, some worse.\n\n"
    },
    {
      "time": "25 Apr 2006 — 12:09pm",
      "content": "_they were almost identical._\n\nBut that doesn't really matter.  \nThe purpose is to date a genre of type.  \nHere is an ad from the London _Punch_ magazine, 1843 (incidentally, also the best-selling humour magazine in Canada and the United States at the time).  \nI have not seen these sans faces in the Figgins, or Caslon & Livermore specimens of the day.  \nPerhaps they are in some specimen books I am not aware of.  \nOr perhaps they are types that never appeared in specimen books.  \nOr perhaps they are types from specimen books of which no copies now exist.  \nOr perhaps they are types from foundries that have vanished without trace.  \nType history is a little too dependent on foundry specimens -- from the usual suspects.\n\n ![](http://web.archive.org/web/20150123081800im_/http:/typophile.com/files/Doudney.jpg)\n\n"
    },
    {
      "time": "25 Apr 2006 — 12:29pm",
      "content": "Karsten, thank you for your explanation of the date mistake.  \nDoes the article you cite \"Grotesque Letters\" deal with German Grotesks significantly?\n\n<cite> the German scientific tradition of using sans faces would be worth exploring</cite>\n\nFor sure, Nick.\n\nAnyone knows if there is any virtual gallery on nineteenth century German publications? The only gallery of this kind I know –pointed out to me by Eduardo Manso from [Emtype Foundry](http://web.archive.org/web/20150123081800/http:/typophile.com/wiki/Emtype%20Foundry)– covers exclusively nineteenth-century USA (by the way: worth visiting, specially the reproductions of The Century magazine, printed by De Vinne. [http://cdl.library.cornell.edu/moa/moa\\_search.html](http://web.archive.org/web/20150123081800/http:/cdl.library.cornell.edu/moa/moa_search.html \"http://cdl.library.cornell.edu/moa/moa\\_search.html\"))\n\nI have found so far a lack of first-hand, proven information (or any at all) on the birth and development of early German grotesques. Is there any source (German-language included) where this topic is extensively discussed?\n\nThanks again\n\n"
    },
    {
      "time": "25 Apr 2006 — 12:52pm",
      "content": "(I missed your last two posts while I wrote mine)\n\n<cite>The purpose is to date a genre of type.</cite>\n\nI think so. The matter is to widen our knowledge of the sanserif genre´s first steps, by learning more on the history of the Grotesk –which seems to have answers to questions such as e.g. when a sanserif was first used as a text face.\n\n"
    },
    {
      "time": "25 Apr 2006 — 2:40pm",
      "content": "\\> It can be found in part one of the Muster-Sammlung, of 1886.  \n\\> But it should be hard to trace this back earlier for type specimens  \n\\> werent dated back then.\n\nNot that hard. The 'Schlanke Grotesk' dates from 1882.\n\nIn the 1870s and 18880s, Schelter & Giesecke published their own journal 'Typographische Mitteilungen' (typographic reports), in which they presented their new typefaces. This journal was published approximately every few months.\n\nIn 'Typographische Mitteilungen', 2. Band, 3. Heft, published in May 1882, on page 2 the 'Schlanke Grotesk' is presented as a new design:\n\n'In our last issue, we presented the Enge Antiqua, and we said that this typeface allowed extreme tight setting. Today we are able to present an in-house cut Schlanke Grotesk , which enables the type setter to set even more compressed without losing legibility. This typeface will prove its usefullness not only for job printing but also for the setting of advertisments.'\n\n(This is my translation from German.)\n\n(St Bride Printing Library in London has a copy of Typographische  \nMitteilungen', 2. Band, 3. Heft, May 1882)\n\n"
    },
    {
      "time": "25 Apr 2006 — 2:58pm",
      "content": "Bravo Wolfgang!\n\nChrisL\n\n"
    },
    {
      "time": "25 Apr 2006 — 2:58pm",
      "content": "[double post ...]\n\n"
    },
    {
      "time": "25 Apr 2006 — 2:59pm",
      "content": "<cite>Does the article you cite “Grotesque Letters” deal with German Grotesks significantly?</cite>\n\nMore with the British. If you send me your email (I think my Typophile contact link allows this), I can make you a copy of the article at the weekend. It is nice to read.\n\n<cite>The purpose is to date a genre of type.</cite>\n\nAh, genre not particular typeface. This is a different story. Maybe easier to deal with for the start. ;-)\n\n<cite>Type history is a little too dependent on foundry specimens — from the usual suspects.</cite>\n\nYou mean, they write their own great history?\n\n<cite>I have found so far a lack of first-hand, proven information (or any at all) on the birth and development of early German grotesques. Is there any source (German-language included) where this topic is extensively discussed?</cite>\n\nI fear there are no \\*serious\\* publications about it. For some time I tried to find something, but most of the articles present second-hand stuff themselves. Repeating myths.  \nSad because the issue is most fascinating: Like, before the Johnson and Gill sanserifs, British sanserifs (the groteques) had many features in common with the German ones. I always wondered if German sanserifs had their origin in Britain.  \nBut this is speculation. Unfortunately. Glad about any correction.\n\n"
    },
    {
      "time": "25 Apr 2006 — 3:01pm",
      "content": "<cite>In ‘Typographische Mitteilungen’, 2. Band, 3. Heft, published in May 1882, ...</cite>\n\nIn which German library can I find them?\n\n"
    },
    {
      "time": "26 Apr 2006 — 5:08am",
      "content": "Thank you for that precise data, Wolfgang.\n\nHave you got any information concerning the use of sanserif as body text face in nineteenth-century German scientific publications?\n\n"
    },
    {
      "time": "26 Apr 2006 — 1:09pm",
      "content": "\\> In which German library can I find them?  \nSorry, I don't know - but if you find them, probably you could tell us in which library ...\n\n\\> Have you got any information concerning the use of sanserif as body text face  \n\\> in nineteenth-century German scientific publications?  \nNo.  \nI have heard these rumours that sans serif was used in nineteenth-century German scientific publications - does anyone know from which source this information comes from? - but bearing in mind that back then a substantial part of the newspapers and books was printed in Fraktur (blackletter) I find it hard to believe that sans serif was used for longer texts. If it was actually used, then I would rather assume that it might have been used for some special purposes. But this is only speculation.\n\nIt just came to my mind, that some ten years before Caslon's Egyptian, the first sans serif tyeface (with upper case only), there was already a Greek unseriffed typeface (uppercase only):  \nEdward Daniel Clarke's Greek type (1805). You can find Justin Howes's article about this typeface in the Proceedings of the 1st International Conference on Typography and Visual Communication in June 2002 in Thessaloniki, Greece. John Bowman (in his book 'Greek printing types in Britain') also mentions this typeface, and he calls it 'Cambridge Small Pica Sarcophagus'. (Nice name for a typeface!)\n\nIf anyone has information about sans serif in nineteenth-century German scientific publications - now is the time to tell us more about it...\n\n"
    },
    {
      "time": "26 Apr 2006 — 4:41pm",
      "content": "TM -- so far, only at Leipzig. :(\n\n"
    },
    {
      "time": "27 Apr 2006 — 1:16am",
      "content": "<cite>sans serif was used in nineteenth-century German scientific publications - does anyone know from which source this information comes from?</cite>\n\nThe source I know of –pointed out by Andreas Seidel at [http://typophile.com/node/4567](http://web.archive.org/web/20150123081800/http:/typophile.com/node/4567 \"http://typophile.com/node/4567\"), 5th post– is the typolexikon.de website, run by Wolfgang Beinert from Berlin.\n\n\"...[in the XIX century] the Grotesk was used predominantly for jobbing and in scientific and technical publications\" (my approximated translation from German)  \n\"die Grotesk dann überwiegend im \\* Akzidenzsatz sowie in wissenschaftlichen und technischen Publikationen verwendet.\"  \n [http://www.typolexikon.de/g/grotesk.html](http://web.archive.org/web/20150123081800/http:/www.typolexikon.de/g/grotesk.html \"http://www.typolexikon.de/g/grotesk.html\")\n\nIn this other section, Beinert states that Theinhardt's Royal Grotesk was designed for the publications of the Royal Prussian Academy of Sciences.  \n\"Theinhardt entwarf um 1880 für die wissenschaftlichen Publikationen der » Königlich-Preußischen Akademie der Wissenschaften zu Berlin « die » Royal-Grotesk « in vier Schnitten.\"  \n [http://www.typolexikon.de/t/theinhardt-ferdinand.html](http://web.archive.org/web/20150123081800/http:/www.typolexikon.de/t/theinhardt-ferdinand.html \"http://www.typolexikon.de/t/theinhardt-ferdinand.html\")\n\n"
    },
    {
      "time": "27 Apr 2006 — 7:15pm",
      "content": "Both Thorowgood in England and the Johnston & Smith foundry in the U.S. showed sans serif types with lowercase in 1834. Neither design was particularly good and there is reason to believe the Johnston & Smith type, which is quite ugly, was a wood letter or metal made from wood letters.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "28 Apr 2006 — 2:04am",
      "content": "And when did lowercase first appear on a Grotesk?\n\nThe crudeness you point out seems to be a clear feature of all early sanserifs, first originated –as said– in Britain and then the US. The genre got refined afterwards through the century. I got the impression (not proven) that by the last third of the century, the Grotesks had achieved a substantially greater level of development than their Anglo-American counterparts. I wonder how the Grotesks were in the beginning (if just as primitive or if they presented early clues to that future refinement), and what was the pace of their formal growth.\n\nAnother gap in the history of Grotesks seems to be right in the birth date. What is the oldest specimen of a German sanserif anyone at the forum knows of?\n\nThank you\n\n"
    },
    {
      "time": "2 May 2006 — 3:03am",
      "content": "More on early Grotesks and their use for text setting:\n\n\"In 1830 this firm [Schelter und Giesecke] held a bold upper and lower case roman [grotesque] in fifteen sizes, and by 1850 had added a condensed in no less than nineteen sizes, of which three included a choice of body size. Steinschrift, as the design was named, was obviously intended for text setting rather than for eye-catching display.\"\n\nP.M. Handover: “Grotesque Letters”, Monotype News Letter 69, March 1963 (provided by Karsten Luecke). [The source can be doubtful (as discussed above).]\n\n"
    },
    {
      "time": "4 May 2006 — 11:48am",
      "content": "Schlanke Grotesk specimen from Schelter & Giesecke Muster-Sammlung, 1886  \n(found at Biblioteca Arús, Barcelona)\n\n ![](http://web.archive.org/web/20150123081800im_/http:/typophile.com/files/schlanke_grotesk_4620.jpg)\n\nI pose once again these questions, open for everyone:\n\nDates for first Grotesk, Grotesk lowercase, use of Grotesk as text face.\n\nAny clue, approximation or information related is welcome  \nThanks a lot\n\n"
    },
    {
      "time": "5 May 2006 — 6:55am",
      "content": "On a somewhat unrelated note, the high-flying umlauts are nice.\n\n"
    },
    {
      "time": "5 May 2006 — 7:12am",
      "content": ") They are indeed.\n\n"
    },
    {
      "time": "5 May 2006 — 7:26am",
      "content": "But the \"w\" and \"M\" have not fully evolved.  \nThe bold condensed was the leading stytle in the development of the sans, and Thorowgood has figued out how to solve the problem for that style, but Extra Light Extra Condensed -- asking for trouble! Here's Univers 39.\n\n ![](http://web.archive.org/web/20150123081800im_/http:/typophile.com/files/staat_4043.jpg)\n\n"
    },
    {
      "time": "8 May 2006 — 1:19am",
      "content": "This kind of imperfections in optical adjustment seem to be the norm at that stage of development of the Grotesk. Here is another example, Schmale Steinschrift from Schelter & Giesecke specimen book (1898)\n\n ![](http://web.archive.org/web/20150123081800im_/http:/typophile.com/files/schmale_1_6122.gif)\n\n ![](http://web.archive.org/web/20150123081800im_/http:/typophile.com/files/schmale_2_4466.gif)\n\n ![](http://web.archive.org/web/20150123081800im_/http:/typophile.com/files/schmale_3_6566.gif)\n\n(M,W,A)\n\nThe neogrotesques' main contribution was precisely to systematize and optically polish (Univers is the best example of this) the formal findings that were already there in nineteenth-century Grotesks.\n\n"
    },
    {
      "time": "10 May 2006 — 8:09am",
      "content": " ![](http://web.archive.org/web/20150123081800im_/http:/typophile.com/files/breitehalbfette_6307.gif)\n\nSample from 1898 (same specimen book mentioned in last post).\n\nWhat makes the neogrotesques of the 1950-60's (Helvetica etc.) beatiful was for the most part already there –more than a century ago from us now.\n\n"
    },
    {
      "time": "10 May 2006 — 10:57am",
      "content": "Sorry Xurxo, I don't agree with your theory of progress.  \nThe ink-traps in V, W, of Univers etc would have looked as strange (and not beautiful) to people in the 1890s as the heaviness of those characters in Schmale Steinschrift look to us.\n\n"
    },
    {
      "time": "13 May 2006 — 4:24pm",
      "content": "Nick, I'll try to explain my point more clearly (I wasn't trying to say what you comment)\n\nIt's clear, as you said, that some aspects of those Grotesks <cite>have not fully evolved</cite> (namely the optical unbalance of some characters). Their full evolution would only come with neogrotesques, like Univers.\n\nI was trying to point out the fact that neogrotesques are (roughly said) but optically polished and systematized Grotesks.\n\nThe basic formal appeals of neogrotesques (say <cite>what makes them beatiful</cite>), –e.g. their stark and robust simplicity, a kind of plain but precise synthetization–<cite> are already there </cite>in the German grotesques of the preceding century.\n\n"
    },
    {
      "time": "13 May 2006 — 4:34pm",
      "content": "(In a way, it's the remark of someone surprised by the \"modernity\" of the Grotesks)\n\n"
    },
    {
      "time": "14 May 2006 — 12:10am",
      "content": "We're generally agreeing, but the point I'm making is that the evolution has not been from ugly to beautiful, that's only the way it appears to some of us now.\n\n\"Optical polish\" is even tone, but there is nothing inherently beautiful about this quality. Many would consider the polishing excessive, resulting in a smooth but dull finish.  \nThe condensed Grotesks were just as systematized as the condensed neoGrotesques -- only with an evenness of stroke thickness, not overall tone.\n\nI certainly agree that the Neogrotesques are direct revivals of 19th century faces -- compare the type in the ad I showed earlier with Helvetica:\n\n ![](http://web.archive.org/web/20150123081800im_/http:/typophile.com/files/lombardNS_5348.jpg)\n\nWhat I really want to see (and discover when) is the first Regular weight lower case sans faces.\n\n"
    },
    {
      "time": "15 May 2006 — 4:41pm",
      "content": "<cite>the evolution has not been from ugly to beautiful</cite>  \nI fully agree with you (the slight misunderstanding was perhaps here). Explaining it with other words: the only thing neogrotesques added was even tone, but apart from that particular new feature (which is a logical evolution, but as you said can be praised for its cleanness or disliked for its homogenization) they are <cite>just as </cite>beatiful as the grotesques from a century ago.\n\nThe formal findings (the effective originalities in form, compared to other genres, that give character and appeal to a typology) are all in the beginning, in vernacular grotesques.\n\nYour more than adequate sample tells all this at just a glance.\n\n<cite>The condensed Grotesks were just as systematized as the condensed neoGrotesques</cite>  \nFor systematization I was rather referring to the fact that a typical neogrotesque is designed from the outset as an array of coordinated weights –it's conceived as a program or system (being this another new feature).\n\n<cite>What I really want to see (and discover when) is the first Regular weight lower case sans faces.</cite>  \nWe open this request to anyone at the forum, as done in previous posts. What's the earliest example of a lowercase Grotesk anyone knows of?\n\nThanks\n\n"
    },
    {
      "time": "26 May 2006 — 2:13am",
      "content": "On the use of Grotesks as text faces in nineteenth-century scientific publications.\n\n<cite>Theinhardt’s Royal Grotesk was designed</cite> [around 1880] <cite> for the publications of the Royal Prussian Academy of Sciences.</cite>\n\nAt least the main publication of the RPAS, the Abhandlungen (\"Papers\"), doesn't seem to make use at all of the Royal Grotesk or any other sanserif. I post a couple of typical pages, from 1882 (the layout remained almost unchanged until XXth century)\n\n ![](http://web.archive.org/web/20150123081800im_/http:/typophile.com/files/abhandlungen_1881_2_6602.jpg)\n\n ![](http://web.archive.org/web/20150123081800im_/http:/typophile.com/files/abhandlungen_1881_4598.jpg)\n\nThe Abhandlungen are available in digital form at [http://bibliothek.bbaw.de/bibliothek-digital/digitalequellen/schriften](http://web.archive.org/web/20150123081800/http:/bibliothek.bbaw.de/bibliothek-digital/digitalequellen/schriften \"http://bibliothek.bbaw.de/bibliothek-digital/digitalequellen/schriften\")\n\n"
    },
    {
      "time": "26 May 2006 — 5:34am",
      "content": "Thanks for that link Xurxo!\n\nChrisL\n\n"
    },
    {
      "time": "6 Oct 2013 — 12:28pm",
      "content": "Wonder if anyone has a clue about [this sans serif](http://web.archive.org/web/20150123081800/http:/typophile.com/node/106610#comment-565349), that veers very closely to these\n\n"
    }
  ]
}
