{
  "id": "19487",
  "title": "NEW logo for Authenticore",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I have posted an earlier version of the logo at [http://typophile.com/node/18997](http://web.archive.org/web/20070105024459/http:/typophile.com/node/18997)\n\nNow I have started all over again and think I’ve made a logo which is much more consistent and has more of the expression I’m looking for. As with last time I need some hardcore critique of it, since I’ve become a little blind.\n\n ![](http://web.archive.org/files/Authenticore2.png)\n\n",
  "author": "<a href=\"user/12316\" title=\"View user profile.\">fredrefs</a>",
  "time": "<br>",
  "uid": "12316",
  "comments": [
    {
      "time": " 25 April, 2006 - 8:05am",
      "content": "The e’s are a bit sharp at 6 o’clock and a bit light compared to c and o, perhaps c and o could be a touch thinner and e’s a touch broader with the connector smoothed I think for the final e you could afford to make the last stoke a bit heavier. It is difficult to see with the scrolling but the Au space seems a bit wide and the loop at the beginning of the u might be a little more pronounced. The connector on the he seems a bit broad at the beginning of the out-turn.  \nGood advance from your first post.  \nTim\n\n"
    },
    {
      "time": " 25 April, 2006 - 1:03pm",
      "content": "Thank you for the good advice. I’ve done some modifications according to what you said and it seems to work better now. However, something still feels wrong with the r. Is it too heavy with the closed loop?\n\n(I’ve managed to shrink the image a bit. but it seems like it won’t become any smaller. The image I uploaded now is 300 px wide. Must it bee even smaller?)\n\n ![](http://web.archive.org/files/Authenticore3.gif)\n\n"
    },
    {
      "time": " 25 April, 2006 - 1:23pm",
      "content": "I love that r, true it does draw attention to itself, but I think it is a charming shape and the weight is no more than the th, if anything the righthand side of the loop could be rounder. I still see something unsatisfactory about the last stroke of the last e, but I can’t put my finger on it, maybe somebody else can come up with an answer (probably that I’m wrong:).  \nAs for the size it’s the devil and the deep blue sea – one is too large and the other too small, I think you have a happy medium.  \nTim\n\n"
    },
    {
      "time": " 2 May, 2006 - 3:38am",
      "content": "Yep, i also really like the r. Great Logo by the way, its really expressive.\n\nIs this a modification? Or have you modelled it on someone’s actual writing with a marker?\n\nThe only thing bugging me is the x-height of the ‘e’. It seems a little bit low, but then again, that is probably in keeping with how we actually write (?). But, maybe its the higher ‘r’ combined with the lower ‘e’ that is leaving timd ‘unsatisfied’?\n\nGood luck, although i think your pretty much there… ;)\n\n"
    },
    {
      "time": " 5 May, 2006 - 2:17am",
      "content": "Thanks a lot! It’s not a modification. It’s only based on my handwriting testing how the strokes go when I write. I’ve drawn it by hand in ca. 8 cm height, which I feel give me the control I like. Only the final adjustments are done in Illustrator.\n\nThe final version is here:\n\n ![](http://web.archive.org/files/Authenticore4_4372.gif)\n\n"
    },
    {
      "time": " 5 May, 2006 - 6:20am",
      "content": "Sweet\n\n"
    },
    {
      "time": " 23 May, 2006 - 3:54pm",
      "content": "Yeah, I really like this. Well done.\n\n"
    }
  ]
}
