{
  "id": "19491",
  "title": "ADVICE PLEASE: Display style for portfolio pics...",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "(REPOSTED FROM THE DESIGN FORUM)\n\nHello all - Hope people are well on this sunny day (if it is in fact sunny where you are)....\n\nBelow are two screengrabs of my new portfolio site. 1)The two irregular black slabs in the corner are 'test' buttons....ignore them, they'll be replaced with the thumbnails for each section. 2)The site is fairly heavily animated, so bare that it mind.\n\nThe structure for the site is pretty much there, but I'm having a nightmare deciding on how to display my work. I produce a mixture of canvases, photography and custom shoe work....I need something appealing, commercially tangible, and fairly subtle. So far I've stuck on using speech bubbles to contain my pics - they fit in with the semi-comic book style I've created for the site, which also mimics my canvases.\n\nMY QUESTIONS:  \n-----------------------------------------  \nIs the speech bubble idea really awful?\n\nAny other alternatives you can think of? (eg. Scrolling rectangular boxes that obscure the background and display the pics ontop of those)  \n-----------------------------------------\n\nAny ideas would be a huge help - I'm stuck at this hurdle and need to get this finished.\n\nMany thanks :)\n\nP\n\n ![](http://web.archive.org/web/20150425041238im_/http:/typophile.com/files/sitepic1.jpg)\n\n ![](http://web.archive.org/web/20150425041238im_/http:/typophile.com/files/sitepic2.jpg)\n\n",
  "author": "MekOne",
  "time": "25 Apr 2006 — 1:53am",
  "uid": "11176",
  "comments": [
    {
      "time": "25 Apr 2006 — 6:57am",
      "content": "I don't think the speech bubbles are a bad idea for the shoes the style seems to suit a comic book feel, not so keen on the zigzag – it seems a bit shouty, or the heavy drop shadow, I would also like to see the image filling the bubble. Does your other work suit this style? How are you going to navigate to the next pair? Will you reshape the bubble to suit each item?  \nTim\n\n"
    },
    {
      "time": "25 Apr 2006 — 7:08am",
      "content": "Hiya Tim,\n\nThanks for the reply....\n\nI'm playing with different 'stems' for the bubble - the zigzag is a bit 'naff' as my girlfriend put it.\n\nBubbles will be reshaped for each item. This is fairly time consuming but I really don't want to rely on a straight slideshow image style. In terms of navigating bewteen pics, it's likely to involve closing the bubble and purely using thumbnails (which may get annoying for the viewer), or else fwd and prev buttons somewhere on the page - only problem with that is that speech bubbles seem to 'come from somewhere' direction-wise....Randomly loading up different speech bubbles with a fwd & prev buttons seems a bit dis-jointed, does that make sense?\n\nThe main thing is that the concept seems ok. I've actually added some white in&outlines to the bubble which seems to soften the drop shadow.  \nI'll give it a go without it though. Thanks dude :)\n\n"
    },
    {
      "time": "25 Apr 2006 — 7:54am",
      "content": "MekOne,\n\nThe speech bubbles really do go well with the comic book feel, but they are certainly not subtle -- at least not with the heavy drop shadow and lightning bolt coming out if the bottom. It may help to just soften the blow of the speech bubble some how.\n\n\\*Just and idea\\* - how about thought bubbles instead?\n\nDuncan\n\n"
    },
    {
      "time": "25 Apr 2006 — 8:05am",
      "content": "lol\n\nYeah - I guess subtle isn't really the overall feeling is it.....  \nI tried thought bubbles, but the unconnected 'o's for the stems were messy...The speech bubbles alpha tween in (fade in for none flash users) so they appear softened marginally - Switching to charcoal grey instead of black for the shadows might help too....I'll post up my 'smaller stemmed' 'recoloured' bubbles in a bit.\n\nThanks for the thoughts so far, really appreciate it :)\n\n"
    }
  ]
}
