{
  "id": "19509",
  "title": "my first post/ script, i guess?",
  "forum": "Script / Handwriting / Graffiti",
  "tags": [
    "Script / Handwriting / Graffiti"
  ],
  "content": "hi all!\n\nthis is my first post on typophile.. ! ive been lurking for quite some time now.. and i finally decided it was time to jump aboard!\n\nim Roelant van der Munnik, born and raised in Alkmaar, the Netherlands.. you can read the rest in my bio i guess..\n\nI have no real formal training in graphic design, or typography. Everything i do, is self initiated, and 'selfthaught'.. (you simply cannot learn yourself everything, hence typophile and the likes, i guess!)\n\nIve really been liking the scriptwriting/handwriting stuff. Ive been doing this for little over a year now i guess, i finally i have some result worth showing.. my very first try's were incredibly horrible, but i have consciously seen myself evolve to where i am now, and i firmly believe that practice make perfect.. I am nowhere near where i want to be, but i guess im along the way..\n\nI really admire the work of John Stevens, Mark Simonson et al. and im trying my hand at digitizing my files, but i guess i need to find some better pens to ink the scripts.\n\nanyways, heres some stuff ive been working on.\n\n ![](http://web.archive.org/web/20150419054306im_/http:/typophile.com/files/2001.jpg)\n\ngreat movie!\n\n ![](http://web.archive.org/web/20150419054306im_/http:/typophile.com/files/desperado.jpg)\n\n ![](http://web.archive.org/web/20150419054306im_/http:/typophile.com/files/velocity%20sensitivescript.jpg)\n\n ![](http://web.archive.org/web/20150419054306im_/http:/typophile.com/files/5%20boroughs2.jpg)\n\ndigitized in photoshop.. the line work was horrible.. :S\n\nanyway,  \ng'day!\n\n",
  "author": "R",
  "time": "25 Apr 2006 — 1:53pm",
  "uid": "8968",
  "comments": [
    {
      "time": "1 May 2006 — 7:34pm",
      "content": "I love them all. You have a good eye, and think you should continue to develop your skills. I'd love to see more when you do them. Thanks for posting. As I think about it, it seems more akin to illustration, but could probably apply to making fonts somehow or other.\n\n"
    },
    {
      "time": "4 May 2006 — 4:03pm",
      "content": "thanks! thats definitely a boost in the right direction, as im not sure i have the confidence to keep on going at it..\n\n"
    },
    {
      "time": "18 May 2006 — 10:13am",
      "content": "nice sketches! not quite a type face though - more lettering.\n\n"
    },
    {
      "time": "18 May 2006 — 10:33am",
      "content": "That \"Borough 8\" is texturally really wonderful.\n\nhhp\n\n"
    },
    {
      "time": "18 May 2006 — 10:36am",
      "content": "i think it's \"boroughs\": from [the beastie boys album](http://web.archive.org/web/20150419054306/http:/www.amazon.com/gp/product/B00021LRWM/102-9545620-8660947?v=glance&n=5174).\n\n"
    },
    {
      "time": "18 May 2006 — 11:31am",
      "content": "Oh. Duh. Sorry, I'm a left coaster.\n\nhhp\n\n"
    },
    {
      "time": "22 May 2006 — 9:44am",
      "content": "thanks for the replys,\n\nit is indeed boroughs.. now that i look at it, the 's' definitely looks like an 8!\n\nthe texture is done in photoshop using the bevel and some other options in there..\n\ni assumed this was the forum for posting lettering as well.. my bad..\n\ni dont really have the intent to create a typeface from any of these renderings, or future script renderings. im really kind of into the lettering stuff..\n\nthanks again!\n\n"
    },
    {
      "time": "14 Sep 2006 — 9:33am",
      "content": "Why don't you try to digitalize them or one of them in Illustrator. These would definitely look very nice when vectored.\n\n"
    }
  ]
}
