{
  "id": "19503",
  "title": "19th century typeface",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello all,\n\nI'm one of those dreaded \"Graphic Designers\" who lacks an extensive background in typography. I try to tend to my type as well as I'm able, but I'm sure I've done some things that would shock and awe. That being said, I take my type as seriously as I can, and I like to refer to the experts whenever possible.\n\nI've got a particularly high profile client, who's looking for a wordmark, and I'm looking for a suitable typeface to accompany it. The budget is quite large, so I'm looking for as close a match as I can get. I'm looking for a serif typeface with a 19th century feel (preferably something designed recently) that pays particular attention to the upper and lower case Gs. I'm looking for something elegant, but that doesn't alienate. A typeface that looks good in a suit, but has been known to lounge in a t-shirt and jeans.\n\nThanks,\n\n-J.\n\n",
  "author": "J.",
  "time": "25 Apr 2006 — 11:36am",
  "uid": "12642",
  "comments": [
    {
      "time": "25 Apr 2006 — 1:18pm",
      "content": "Usually I never refer to my own typefaces, but I think that \"Andrade\" might work.  \n [http://www.myfonts.com/fonts/dstype/andrade/](http://web.archive.org/web/20131015132400/http:/www.myfonts.com/fonts/dstype/andrade/ \"http://www.myfonts.com/fonts/dstype/andrade/\")\n\n"
    },
    {
      "time": "25 Apr 2006 — 1:27pm",
      "content": "Good call Dino.\n\n"
    },
    {
      "time": "25 Apr 2006 — 1:30pm",
      "content": "[http://www.myfonts.com/fonts/storm/walbaum-text/](http://web.archive.org/web/20131015132400/http:/www.myfonts.com/fonts/storm/walbaum-text/ \"http://www.myfonts.com/fonts/storm/walbaum-text/\")\n\nOr if you go a bit earlier look at Baskerville Ten and John Baskerville from Storm.  \nTim\n\n"
    },
    {
      "time": "25 Apr 2006 — 1:31pm",
      "content": "I do quite enjoy the lower case \"g\", but I'm looking for something a little more distinctive in the uppercase department.\n\nThanks for your response, I may suggest it to the client.\n\n"
    },
    {
      "time": "25 Apr 2006 — 2:14pm",
      "content": "\\> I’m one of those dreaded “Graphic Designers” who ...\n\nIf you're here, then you're not. :-)\n\nI thought your brief, although interesting, was a tough  \ncall with that \"G\"/\"g\" requirement, but Andrade actually  \nseems a great match! The thing is, if you think that \"G\"  \nis not distinctive enough, I think I can safely say that  \nyou won't find exactly what you're looking for, basically  \nbecause it's very hard to find a funky UC \"G\" in a reserved  \ndesign like you'd like...\n\nBut here's an idea: find a font that's as close a match as  \nyou can find but without a funky \"G\", and get a designer  \n-preferably the original one- to funketize it for you.  \nOr actually, since it's for a logo and not text, you can  \njust funketize it yourself! Just show us your work-in-  \nprogress so we can tear it apart first. ;-)\n\nOr what about this (from another current thread actually)?  \n [http://www.optimo.ch/pages/departement/index.php?id\\_categorie=1&id\\_font=9](http://web.archive.org/web/20131015132400/http:/www.optimo.ch/pages/departement/index.php?id_categorie=1&id_font=9 \"http://www.optimo.ch/pages/departement/index.php?id\\_categorie=1&id\\_font=9\")\n\nhhp\n\n"
    },
    {
      "time": "26 Apr 2006 — 5:59am",
      "content": "See if Letterhead Fonts has anything you're looking for.\n\n[http://www.letterheadfonts.com/](http://web.archive.org/web/20131015132400/http:/www.letterheadfonts.com/ \"http://www.letterheadfonts.com/\")\n\n"
    },
    {
      "time": "26 Apr 2006 — 7:31am",
      "content": "Thanks for your replies all. The art director agrees that Andrade is currently our best choice, perhaps borrowing a flourish from the ligatures to embellish the uppercase G. Quite an improvement from some of our original choices. We're going to be running it by the client to see what they think. Since you're all interested, I'll be sure to let you know where it goes.\n\nP.S. I wish myfonts.com gave you the option of kerning — or at least tracking — previews.\n\n"
    },
    {
      "time": "26 Apr 2006 — 8:48am",
      "content": "You could also check out De Vinne, it has a nice G.\n\n[http://www.myfonts.com/fonts/bitstream/de-vinne/](http://web.archive.org/web/20131015132400/http:/www.myfonts.com/fonts/bitstream/de-vinne/ \"http://www.myfonts.com/fonts/bitstream/de-vinne/\")\n\n"
    },
    {
      "time": "26 Apr 2006 — 1:09pm",
      "content": "caslon IV sans  \n [http://www.orangeitalic.com/caslon.shtml](http://web.archive.org/web/20131015132400/http:/www.orangeitalic.com/caslon.shtml \"http://www.orangeitalic.com/caslon.shtml\")\n\ndespite what it says on the site, i believe this typeface is available for licensing. alternate g and G too!\n\n"
    }
  ]
}
