{
  "id": "19518",
  "title": "Trouble posting:",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Sorry to post this message here but I have already tried posting it in the “anyTHING goes” section and my THING went!  \nGone? Anything goes all right and some go missing apparently...  \nHas something changed RE: posting attachments ETC.. or is it just me.  \nHelp appreciated\n\n [‹ Godard title sequence typeface](http://web.archive.org/web/20070808062456/http:/typophile.com/node/19549 \"Go to previous forum topic\") [(x) Ian Schrager 40 Bond - Caslon (display version) {Geoff} ›](http://web.archive.org/web/20070808062456/http:/typophile.com/node/19448 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070808062456/http://typophile.com/user/5906\" title=\"View user profile.\">planet_embroidery</a>",
  "time": "<br>",
  "uid": "5906",
  "comments": [
    {
      "time": " 26.Apr.2006 5.14am",
      "content": "Sorry this is the message I get when i try to attach a file to my post:  \nFile copy failed: no directory configured, or it could not be accessed.\n\n"
    },
    {
      "time": " 26.Apr.2006 6.08am",
      "content": "People seem to have more luck posting images in their second post using the ’insert image’ button that appears at the bottom of the comments box, providing you have Flash 8 Player installed cf  \n [http://typophile.com/node/18067](http://web.archive.org/web/20070808062456/http:/typophile.com/node/18067 \"http://typophile.com/node/18067\")\n\nTim\n\n"
    },
    {
      "time": " 26.Apr.2006 8.43am",
      "content": "I dont understand why Flash player would have any baring on attatchments to postings... as I have posted dozens of times previously with no problems and now out of no-where this error message?  \nThats why I wondered weather or not something had changed?  \nI also dont understand what you ment by their second posting?\n\nAnd how do you configure a directory???\n\nBut I dont have that installed as im not really interested in viewing bandwidth hungry animations with no real practical value.\n\n"
    },
    {
      "time": " 26.Apr.2006 8.44am",
      "content": "But thanks for your thoughts im stumped.\n\n"
    },
    {
      "time": " 26.Apr.2006 10.27am",
      "content": "I don’t understand anything about the creation or maintenance of a website, however Flash Player is required to upload images. The method for posting images has changed recently(ish), but I couldn’t tell you why, it’s all a dark art to me. And it seems to have generally affected typophile.\n\nI meant that although posters have had trouble posting an image in their initial post when they create a thread, they seem to be able to post an image in their second (or later) post to that thread, give it a go.\n\nTim\n\n"
    },
    {
      "time": " 27.Apr.2006 5.00am",
      "content": "I will thanks.\n\n"
    },
    {
      "time": " 27.Apr.2006 8.56am",
      "content": "I’ll bet the wizards are working to fix this. Have patience.\n\n"
    }
  ]
}
