{
  "id": "19516",
  "title": "Luc DeVroye's website has been closed!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[http://cgm.cs.mcgill.ca/~luc/](http://web.archive.org/web/20140821050553/http:/cgm.cs.mcgill.ca/~luc/ \"http://cgm.cs.mcgill.ca/~luc/\")\n\n\"Luc Devroye's site is now closed. He is still alive and kicking, but on April 24, 2006, censorship and political correctness won against academic freedom. To the students who are counting on my course notes: sorry. To the researchers who are trying to download my work: sorry. To the conference participants of AofA 2006: sorry. To the readers of my daily social commentary: sorry. To the mathematical community: sorry. To the funding agencies of Canada who generously supported my work: sorry. We may be up again one day after purgatory.\"\n\nMr. DeVroye's website was a great resource for anyone interested in type, and an invaluable one to those interested in font technologies.\n\nJust yesterday I was going to send Mr. DeVroye a message telling him how much I appreciate the time he has put into making such a large collection of useful information and links, but I felt a bit embarassed about sending it so I didn't. I wish I had, and now I'm going to ask him if he has backed up a copy of his pages about fonts.\n\nYou can still reach parts of his website from Google's cache ( [http://72.14.203.104/search?q=cache:\\_73aQEnCgjAJ:cgm.cs.mcgill.ca/~luc/f...](http://web.archive.org/web/20140821050553/http:/72.14.203.104/search?q=cache:_73aQEnCgjAJ:cgm.cs.mcgill.ca/~luc/fonts.html+luc+devroye&hl=en&ct=clnk&cd=3&client=safari \"http://72.14.203.104/search?q=cache:\\_73aQEnCgjAJ:cgm.cs.mcgill.ca/~luc/fonts.html+luc+devroye&hl=en&ct=clnk&cd=3&client=safari\") ).\n\n",
  "author": "Altan Orhon",
  "time": "26 Apr 2006 — 3:10am",
  "uid": "11893",
  "comments": [
    {
      "time": "26 Apr 2006 — 3:36am",
      "content": "What the hell happened? He had a _billion_ cool links.\n\n"
    },
    {
      "time": "26 Apr 2006 — 4:26am",
      "content": "A brandnew website is just being installed.  \nThe link to his new site will be announced  \nshortly.\n\nIt would have been a great loss, if his great  \nunique website had been shut down for ever.\n\nBut Luc has many true friends and helpers.\n\nUli  \n( [www.forgers.de](http://web.archive.org/web/20140821050553/http:/www.forgers.de/ \"www.forgers.de\"))\n\n"
    },
    {
      "time": "26 Apr 2006 — 5:07am",
      "content": "What's the business about \"political correctness\" and \"academic freedom\"? Did he have polemical rants that offended his \"hosts\"? Just curious. Good to know the site will be up. Often when I look up anything font-related on Google, his site is on the first set of hits!\n\n"
    },
    {
      "time": "26 Apr 2006 — 5:33am",
      "content": "Mr. Devroye had a great collection of links for typography.  \nHe also had an agenda to promote his “academic freedom” by actively promoting pirates and knock-off fonts and telling lies about type designers. Most of his information was correct and factual. Often it was opinionated and libelous. His love for typography was contradicted by his disdain for those who would try to make their living designing type. May he rest in peace.\n\n"
    },
    {
      "time": "26 Apr 2006 — 9:21am",
      "content": "Some good news:\n\n[http://cg.scs.carleton.ca/~luc/](http://web.archive.org/web/20140821050553/http:/cg.scs.carleton.ca/~luc/)\n\n"
    },
    {
      "time": "26 Apr 2006 — 9:30am",
      "content": "<cite>His love for typography was contradicted by his disdain for those who would try to make their living designing type.</cite>\n\nYou've never met him? You'd quickly find out that especially the last sentence is far from the truth. (Last from my quote not from your post.)&nbsp;&nbsp;;-)  \nThat working at a university and working freelance (me too) each has the consequence of emphasizing different aspects should not really surprise.\n\nKarsten\n\n"
    },
    {
      "time": "26 Apr 2006 — 9:37am",
      "content": "Did anyone read about why he moved the site? Hilarious.\n\nI'm glad to see it back up, it's a great resource.\n\n"
    },
    {
      "time": "26 Apr 2006 — 10:18am",
      "content": "Thanks for the link Karsten, good news indeed!\n\n"
    },
    {
      "time": "26 Apr 2006 — 10:38am",
      "content": "Luc is a true typophile.  \nThe issue of intellectual property rights in digital culture is a thorny one, and, coming from a non-type industry background, Luc apparently stepped on a few toes as he was finding his feet, which I'm sure mortified him, but isn't that ancient history now?  \nHis site put me in touch with a lot of people in the Canadian type community, and elsewhere, who I wasn't aware of, and on one of my visits to Montreal he took me to the old type section of the library at McGill.\n\n"
    },
    {
      "time": "26 Apr 2006 — 10:38am",
      "content": "Am I the only one who doesn't quite follow this?\n\n"
    },
    {
      "time": "26 Apr 2006 — 10:58am",
      "content": "Oh geez. I just finished a Typographica article speculating that certain commercial foundries (with a penchant to sue) had instigated the closure. Now I find that it was due to some nudie pics. Hilarious.\n\n"
    },
    {
      "time": "26 Apr 2006 — 11:13am",
      "content": "\\> Oh geez. I just finished a Typographica article speculating that certain commercial foundries (with a penchant to sue) had instigated the closure. Now I find that it was due to some nudie pics. Hilarious.\n\nSorry, I couldn't disclose this in my first posting.  \nWhen I looked at the photos of the chicks yesterday,  \nI was thinking that that they are more hilarious  \nthan my drab legal stuff about font forgers :-)\n\nUli  \n( [www.forgers.de](http://web.archive.org/web/20140821050553/http:/www.forgers.de/ \"www.forgers.de\"))\n\n"
    },
    {
      "time": "26 Apr 2006 — 11:17am",
      "content": "\\> A brandnew website is just being installed.\n\nWhew! That was close.  \nGodspeed, Luc.\n\nhhp\n\n"
    },
    {
      "time": "26 Apr 2006 — 12:43pm",
      "content": "I do hope that Luc files a grievance against the University,  \nand I do believe McGill owes him an apology.\n\nOn a side note, so much for a party school...\n\n"
    },
    {
      "time": "26 Apr 2006 — 9:15pm",
      "content": "<cite>Terry wrote: \"He also had an agenda to promote his “academic freedom” by actively promoting pirates and knock-off fonts and telling lies about type designers. Most of his information was correct and factual.\"</cite>\n\nHmm, I was with you right up to \"most of his information was correct and factual.\" I once dissected a lengthy rant of his and pointed out that most of his assertions of fact were false, and many of the remainder were at least misleading.\n\nI'm completely supportive of Luc DeVroye's right to express his opinions on any topic he likes. And he's welcome to tell lies, as far as I'm concerned, although that might get him sued for libel some time. (Usually he's careful to quote other people, instead of asserting things directly himself - a clever tactic.)\n\nHowever, what I object to is his posting vast numbers of links to pirated fonts. I particularly object to his doing that on a University's web site. I find it ludicrous that he could promote theft for years, but he posted some pictures of naked women and they shut down the whole site?\n\nI think McGill owes type foundries an apology. I have no particular sympathy for DeVroye. He should have been reined in years ago.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "26 Apr 2006 — 9:42pm",
      "content": "Luc's website was my very own portal to the magical world of type, so I am thankful for it and glad to see it back up.\n\n_so much for a party school…_\n\nas a McGill alumni, I can say that this is really crazy! I remember back in 1997, taking some of my Canadian McGill friends to a nasty frat party at SUNY Plattsburgh (small state school in the boonies of upper new york state) and the expressions of horror etched into their faces...\n\nbut maybe we were just nerds.\n\non another side note,  \nNO McGill students I knew hung out at Club Super Sexe or, for that matter, Ste. Catherines street. That was for the cheesy Americans looking for a weekend of drunken debauchery.\n\nsorry, back to type...\n\n"
    },
    {
      "time": "26 Apr 2006 — 9:47pm",
      "content": "<cite>I have no particular sympathy for DeVroye. He should have been reined in years ago.</cite>\n\nI hear you are with Adobe, and Adobe rocks, but his site is where I find most of my googles answered. Typohile.com a close second.\n\nI'd like to suggest the truth lies somewhere in between. Over a beer (or two) you guys could probably come to terms (Except maybe for the weird math stuff).  \n: )\n\n"
    },
    {
      "time": "26 Apr 2006 — 9:51pm",
      "content": "_vast numbers of links to pirated fonts_\n\nAre they still there?\n\n"
    },
    {
      "time": "26 Apr 2006 — 9:57pm",
      "content": "\\> LINK REMOVED Occasionally posts font packages. For example, Adobe Font Folio 7, 8, 9 and OT were posted on 31 October 2004.\n\nHmmm, found this link on his site, yes it seems like they are still there... :^/\n\nHowever, many of them seem to be dead now for good.\n\n"
    },
    {
      "time": "26 Apr 2006 — 10:01pm",
      "content": "Geoff, that's a no-no at typophile.\n\n"
    },
    {
      "time": "26 Apr 2006 — 10:02pm",
      "content": "(!) My apologies, I seem to have slipped up this time and forgot to remove the link before posting. I realised what I had just done after a few minutes, link is removed now. My intentions were good, sorry.\n\n"
    },
    {
      "time": "26 Apr 2006 — 10:10pm",
      "content": "Luc Devroye is a professor in the Math department at McGill University. If he wants to run an inaccurate typography database, links to pirated fonts\\*, a blog of social commentary, and photographs of naked women\\*, he should do it on his own server, his own time, and his own dime. McGill was completely within their rights to shut him down. And Carleton should do the same. What exactly does the typography database have to do with Devroye's math teaching?\n\nMr Devroye lurks on Typophile, and I would be curious to hear his thoughts on this matter beyond the insipid statement on \"his\" website; i.e. the directory made available to him by McGill University.\n\n\\*copyright-protected\n\n"
    },
    {
      "time": "26 Apr 2006 — 10:19pm",
      "content": "You're right, Period.\n\n"
    },
    {
      "time": "26 Apr 2006 — 10:22pm",
      "content": "Viva Google cache!\n\nAnd, Stephen, I was thinking the exact same thing.\n\n"
    },
    {
      "time": "26 Apr 2006 — 10:23pm",
      "content": "\"If he wants to run an inaccurate typography database, links to pirated fonts\\*, a blog of social commentary, and photographs of naked women, he should do it on his own server, his own time, and his own dime. McGill was completely within their rights to shut him down. And Carleton should do the same. What exactly does the typography databse have to do with Devroye’s math teaching?\"\n\nYour logic is weak:\n\n1. He was shut down for the photos only. What does piracy have to do with it? what does inaccuracy?\n\n2. The fact that Luc is a controversial figure (not in my mind) only bolsters the case for free speech, and McGill should at the very least not interfere. Bureaucrats don't tell academics what to say.\n\n3. In Canada, you can post link to whatever you want. You can also download whatever you want. You only violate copyright laws if you upload. So says the Canadian courts, and a good reference is Michael Geist's website (at least his university didn't shut him down).\n\n"
    },
    {
      "time": "26 Apr 2006 — 10:52pm",
      "content": "Quake, surely Universities can't allow professors to post Playboy pics.  \nThe optics are terrible.\n\nI don't have a problem with the type site content and links, recognizing it as an amateur endeavour.  \nBut again, having it posted on a university site lends it a spurious authority.\n\n"
    },
    {
      "time": "26 Apr 2006 — 11:01pm",
      "content": "Nick, perhaps you're right, but surely the question is not what universities should allow, but what they can prohibit. I don't think bad form gives McGill grounds for censorship, and insofar that I believe they interfered with his academic freedom (which I interpret very broadly), I'd like to see a grievance filed (which I'm sure the university would settle, with an apology).\n\n"
    },
    {
      "time": "27 Apr 2006 — 4:39am",
      "content": "Mr. Phinney wrote:\n\n\\> ... what I object to is his posting vast numbers of links to pirated fonts  \n\\> ... He should have been reined in years ago.\n\nIn my opinion, the behaviour of Adobe Inc. is sort of schizophrenic:\n\nAt Adobe, Mr. Charles Geschke, Mr. John Warnock, Mr. Thomas Phinney etc. are acting as \"policemen\" and \"prosecutors\" who are running this website:\n\n[http://www.adobe.com/aboutadobe/antipiracy/reportform.html](http://web.archive.org/web/20140821050553/http:/www.adobe.com/aboutadobe/antipiracy/reportform.html \"http://www.adobe.com/aboutadobe/antipiracy/reportform.html\")\n\nAt this website concerning what they call criminal \"felonies\" which \"can result in prison terms of up to five years, and felony charges with fines up to US$250,000\", any visitor can report \"suspects\" to Adobe's \"policemen\" and \"prosecutors\".\n\nBut I learnt to my surprise that crime reports received at this Adobe website concerning such \"felonies\" are \\*\\*not\\*\\* surrendered to the real criminal police or to the real public prosecution, but on the contrary, these reports are kept secret by Adobe's in-house \"policemen\" and \"prosecutors\". That is sort of schizophrenic, but what is more, the refusal to surrender crime reports received to official crime-prosecuting authorities is a crime in itself in many countries.\n\nHere's an example for this bizarre behavior:\n\nFor more than ten years without interruption, a font forgery collection CD called \"Schriftenpaket Osteuropa\" has been sold in Europe. This CD is a forgery of the Adobe CD \"Font Folio\".\n\nFor instance, today (27th April), this \"Schriftenpaket Osteuropa\" CD is being sold here:\n\n[Links Killed by a moderator with nothing better to do.]\n\n(Will Typophile moderators kill above links so that the police cannot see them?)\n\nAt my website, I documented this font forgery CD \"Schriftenpaket Osteuropa\" here\n\n[http://www.sanskritweb.net/forgers/osteuropa1.pdf](http://web.archive.org/web/20140821050553/http:/www.sanskritweb.net/forgers/osteuropa1.pdf \"http://www.sanskritweb.net/forgers/osteuropa1.pdf\")\n\nand pointed out the bizarre fact (see page 4 of above file) that Adobe's in-house \"policemen\" and \"prosecutors\" Charles Geschke, John Warnock, Thomas Phinney etc. have always refused to forward crime reports concerning this font forgery CD to official crime-prosecuting authorities.\n\nTherefore it is sort of schizophrenic that Mr. Phinney declares in view of Prof. Luc Devroye (who also quoted my above documentation on this font forgery CD) that \"he should have been reined in years ago.\"\n\n"
    },
    {
      "time": "27 Apr 2006 — 5:09am",
      "content": "As a university professor here in the U.S., and an amateur follower of copyright issues, I have to say that I agree McGill is within its rights to shut down any site it hosts _within_ the parameters it sets forth for operating a site on its servers. By using one's server space, email, etc., to provide anything that network administrators and any other relevant authorities at the university determine is unacceptable, one is essentially violating a contract. And hence, one has no right to complain.\n\nThat said, any actions as drastic as shutting down a prof's site have to be conducted with something like due process; that's not only fair in the common-sense sense, but also usually a formal component of all such administrative processes. I.e., it's generally expected both culturally and officially.\n\n_That_ said, this case has absolutely _nothing_ to do with \"academic freedom.\" At least in the States, and as a coordinator of a large chunk of courses, I am constantly running into abuses of the term. Academic freedom is about the right to speak on _political_ issues freely in and out of the classroom without fear of professional retribution. The historical context involves people being summarily _fired_ for having the \"wrong\" political views (think of the \"Red Scare\" and the Cold War here in the U.S.). It doesn't mean \"You can do whatever you want, and say whatever you want, and there won't be any consequences.\"\n\nThere are certainly cases in the States in which people have been asked to leave in what _appears_ to be violation of academic freedom. But often these very same people are saying things that fly in the face of other important values in higher education, such as (a) promoting sound and reasonable research rather than lies, (b) maintaining an open and free educational environment rather than damaging this environment, and/or (c) bringing disrepute upon the institution for any number of reasons (e.g., the revelation of a prior criminal record or other damaging material that was not openly revealed during the hiring process).\n\nNevetheless, these are not black and white issues. So long live academic freedom and the debate about what it is. Not that this has much to do with typography...\n\n"
    },
    {
      "time": "27 Apr 2006 — 6:32am",
      "content": "Bottom line, if there were only one set of font links on the internet, there isn't even a close second to the extensiveness of Luc's site. Definitely a very useful research tool, and although I am sorry about the pirate links (perhaps related to the Canadian Socialist way of thinking?) I would be very sorry of that resource was no longer available.\n\nHis [\"Latest\"](http://web.archive.org/web/20140821050553/http:/cg.scs.carleton.ca/~luc/latest.html) page is one of my favorite time-killers, and includes links to many of the fonts being developed and shown here by Typophile's regulars.\n\n"
    },
    {
      "time": "27 Apr 2006 — 6:40am",
      "content": "What in the blue blazes is wrong with the Socialist way of thinking!?!?\n\nI've recently seen _Bowling For Columbine_, and it painted a sorry picture of the American government's way of thinking in comparison to the Canadian government's way of thinking, so I reckon I'd _definitively_ chill on the Canadian-bashing, Dennis. :^/\n\n"
    },
    {
      "time": "27 Apr 2006 — 6:44am",
      "content": "_(Will Typophile moderators kill above links so that the police cannot see them?)_\n\nUli, do you really think we haven't got anything better to do? Just don't publish them in your post in the first place!\n\nMan, I am growing _so_ tired of your antics...\n\n"
    },
    {
      "time": "27 Apr 2006 — 6:51am",
      "content": "It wasn't bashing, just a remark. Perhaps naive. I'm not an intellectual (surprise), but isn't socialism a sort of one-for-all and all-for-one kind of thing at it roots? If you take that to a possible conclusion: So, I have as much right to your work as you do, in an abstract way.\n\nOh well, my intentions weren't to stir another hornet's nest. Please forgive if I don't have a grasp of the concept. For a while I sort of bought into that kind of thing, but it definitely has issues, I can tell you that.\n\nOne that comes to mind is rewarding the lazy and punishing the productive. How long until a sense of unfairness manifests itself? Maybe some large groups of people are far more altuistic than myself. I guess if it is successful I can't argue with it.\n\n"
    },
    {
      "time": "27 Apr 2006 — 7:33am",
      "content": "\"Socialism\" can mean a lot of things, but the safest general way to think about it is this: Socialism means the public or common ownership of the means of economic production, based on the assumption that private ownership of those means, no matter the intention of the owners, over time produces systematic and persistent inequalities in society.\n\nNot even Marx and Engels thought it meant I have the right to your personal property, or to steal your possessions, or to deprive you of the means of making a living. DeVroye's site and his links to pirated fonts have nothing to do with socialism, whatever else you might want to say about it (or him).\n\n"
    },
    {
      "time": "27 Apr 2006 — 7:39am",
      "content": "<cite>I’ve recently seen Bowling For Columbine</cite>\n\n\"Indeed, even speeches shown on screen are heavily edited, so that sentences are assembled in the speaker's voice, but which were not sentences he uttered. Bowling uses deception as its primary tool of persuasion and effect.\" was one complaint by someone pointing out it didn't qualify for a documentary. Don't believe everything Michael Moore tells you would be a good rule of thumb.\n\nIn my mind Columbine was just one result of a society that is allowing God to be outlawed. Yes, it is my society and I am not proud.\n\n<cite>Socialism” can mean a lot of things, but the safest general way to think about it is this: Socialism means the public or common ownership of the means of economic production, based on the assumption that private ownership of those means, no matter the intention of the owners, over time produces systematic and persistent inequalities in society.</cite>\n\nI had to put on my thinking cap for that one, but I can see a valid point there, I guess. Thanks for the unemotional explanation.\n\nI still remember (during the '70s) people using \"liberating\" something \"For the people\" to justify stealing anything they wanted.\n\n"
    },
    {
      "time": "27 Apr 2006 — 7:47am",
      "content": "The fascism of the one or the fascism of the masses. Pick your poison. The never-ending debate…\n\npeace\n\n"
    },
    {
      "time": "27 Apr 2006 — 9:34am",
      "content": "<cite>The fascism of the one or the fascism of the masses. Pick your poison. The never-ending debate…</cite>\n\n[Photo by D. Hill, Font: Lightfoot Narrow by Paul Lloyd](http://web.archive.org/web/20140821050553/http:/www.fontplay.com/images2/lightfootnarrow.jpg)\n\n"
    },
    {
      "time": "27 Apr 2006 — 9:35am",
      "content": "Don’t believe everything anyone tells you would be a good rule of thumb.\n\n"
    },
    {
      "time": "27 Apr 2006 — 9:42am",
      "content": "fontplayer - :)\n\npeace\n\n"
    },
    {
      "time": "27 Apr 2006 — 9:42am",
      "content": "Btw, Don’t believe everything anyone tells you to don’t believe. (or does that cancel itself out?)  \n: )\n\n"
    },
    {
      "time": "27 Apr 2006 — 10:16am",
      "content": "Already pulled it? Reminded me of Dante's Inferno or In The Heart of Darkness…\n\npeace\n\n"
    },
    {
      "time": "27 Apr 2006 — 11:43am",
      "content": "I suspect that to an American Canada seems socialist. We do have universal health care, and a government owned airline and television network. But we also have a private airline and several private networks.\n\nWe have a political part that is \"almost\" socialist, the New Democratic Party ... they have never gotten much more than 10% of the seats in Paliament, and often much less.\n\nWe have gun control, where you have to register rifles, and handguns are banned. It doesn't stop criminals from killing each other (and occasionally the innocent). But it does prevent a lot of \"rage\" deaths where people die because someone else got pissed off at them (here it results in a punch in the nose, much less deadly than a bullet).\n\nBut really ... what does any of this have to do with typography?\n\n"
    },
    {
      "time": "27 Apr 2006 — 11:56am",
      "content": "<cite>But really … what does any of this have to do with typography?</cite>\n\nNothing at all, except someone was jumping down my throat about an off-hand remark, and off we went.\n\n: )\n\n"
    },
    {
      "time": "27 Apr 2006 — 2:56pm",
      "content": "The Canadian socialist way of thinking put in power a conservative federal government.\n\nJay, you have a narrow concept of academic freedom. I'm sure you'll get tenure.\n\n"
    },
    {
      "time": "27 Apr 2006 — 3:04pm",
      "content": "\\>Jay, you have a narrow concept of academic freedom. I’m sure you’ll get tenure.\n\nWhat, is this flame-bait? Just a little potshot to show you're cleverer than me?\n\n\\<flameon\\> You don't know me, you don't have any evident clue about the history of the term \"academic freedom,\" you don't understand what tenure actually involves (it's 99% granted by your _peers_, not some abstract authoritarian regime), and yet... you proclaim that my view is \"narrow.\" Moreover, it was quite plain in my post that I was _explaining_how things work more or less here in the States, and I ended on a note that clearly said \"long live the debate,\" which is about as open-minded as anyone can be.\n\nYawn.\\</flameoff\\>\n\nBack to typography, please.\n\nP.S. I like Canada. I have relatives in Canada. Canada's social and political system is appealing. What more can I say?\n\n"
    },
    {
      "time": "27 Apr 2006 — 4:14pm",
      "content": "You call -that- a flame?\n\nI've taught law, so I think I'm qualified for an opinion on the nature of academic freedom and freedom of speech. And, yes I do know what tenure is. And You'll know better, too, when you get to write a review of one of your peers one day. I hope you won't judge him/her according to their website. Cheers!\n\n"
    },
    {
      "time": "27 Apr 2006 — 4:46pm",
      "content": "Uh, I actually don't give a damn what people put on their web sites. If some professor at McGill wants to reproduce copyrighted images of hot chicks squirming in front of a camera, I frankly don't care. Maybe if they were my daughter, that'd be another story. Then again, if my daughter ended up in a porno mag, well, we'd probably have to have a father-daughter discussion about that.\n\nAnyway, if I judge my peers, it's on the quality of their work. But if I'm working for an organization that pays me my paycheck, despite all of the checks and balances I expect to operate, and despite all of the freedom of thought and expression I'd expect to enjoy, if I put stuff up on the site that violated a pre-existing rule I've tacitly or explicitly agreed to about what's acceptable, then tough nuts for me.\n\nI could of course argue my case, and perhaps even take my university to court. But I couldn't summarily dismiss their right to act on their intepretation of the situation and applicable rules any more than I'd expect them to simply pull the plug on my site.\n\nBut perhaps, because this is a flame-exchange, you were making a sneaky comment about the quality of my own site? In other words, if I expected to get tenure on the quality of my site (which you can access via my profile), and my site really sucked, then I'd better be careful before judging others on the basis of their sites? Now _that_ would have been a clever jab. For you would have been insulted not only me, but also my hounds! _They_ insisted I put their picture up there, even though it kinda ruins the balance of things.\n\nThis still has nothing to do with academic freedom, though. And little to do with fonts, either.\n\n"
    },
    {
      "time": "27 Apr 2006 — 4:51pm",
      "content": "Where's Miss Tiffany when you need her?  \n; )\n\n"
    },
    {
      "time": "27 Apr 2006 — 5:10pm",
      "content": "I agree with Jay's second paragraph in regards to this thread topic. I don't see why people are being so (in)sensitive lately. Is it the weather? Can we please stop and get back on topic?\n\n"
    },
    {
      "time": "27 Apr 2006 — 5:17pm",
      "content": "Thank you for the link... I love you now... I don't know who the heck you are but you just made my afternoon- okay week, month and possibly year :)\n\nWinkingly,\n\nMikey\n\n"
    }
  ]
}
