{
  "id": "19514",
  "title": "Mac advice needed",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I am trying to figure out what will be my total expenditure if I switch to Mac with my upcoming laptop purchase. [The MacBook Pro 17”](http://web.archive.org/web/20080929202936/http:/www.apple.com/) sounds pretty nice. I have found for me a “desktop replacement” is the best way to go, so I can work seamlessly from anywhere, and not have to buy extra copies of the programs I use. I am almost always running off of AC.\n\nIs there some kind of website program (page editing and ftp transfer) included that will suffice, or will I need another program for that? (Using Frontpage now)\n\nAnd is it true (someone told me) that Adobe will give cross-platform software on their programs for just shipping cost?\n\nIs there a Mac magazine that is considered the best resource for tips, tricks, workarounds, etc?\n\nAny other useful info gladly accepted.\n\n [‹ When are memberships up for renewal?](http://web.archive.org/web/20080929202936/http:/typophile.com/node/19596 \"Go to previous forum topic\") [Adobe Illustrator Advice Needed ›](http://web.archive.org/web/20080929202936/http:/typophile.com/node/19603 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080929202936/http://typophile.com/user/12014\" title=\"View user profile.\">fontplayer</a>",
  "time": "<br>",
  "uid": "12014",
  "comments": [
    {
      "time": " 25.Apr.2006 8.13pm",
      "content": "\\> Is there a Mac magazine that is considered the best resource for tips, tricks, workarounds, etc?\n\nIt’s not a magazine, but I think [macosxhints](http://web.archive.org/web/20080929202936/http:/www.macosxhints.com/) is a great site.\n\n"
    },
    {
      "time": " 25.Apr.2006 8.17pm",
      "content": "<cite>Is there some kind of website program (page editing and ftp transfer) included that will suffice, or will I need another program for that? (Using Frontpage now)</cite>\n\nDepends on your skills and needs. You will find very easy and fast tools like RapidWeaver or you could get the professional app Dreamweaver (this ships as a cross-plattform CD). Both tools include FTP functions, but you can also take a look at Transmit 3.5.\n\nRalf\n\n[http://www.fonts.info](http://web.archive.org/web/20080929202936/http:/www.fonts.info/ \"http://www.fonts.info\")\n\n"
    },
    {
      "time": " 25.Apr.2006 8.29pm",
      "content": "The CS2 suite is not going to run native on that machine until CS3 - second quarter 2007. That being said I’ve heard that they run about as fast as the current G5s. There have been a few hiccups with the OS.\n\nYou can transfer through the terminal if you’re handy with Unix, but I would recommend Fetch for ftp. It’s pretty cheap and really easy to use.\n\nThere’s no web page editing software that I’m aware of with the operating system. Maybe you need to get the premium suite, which comes with GoLive. The next edition of the suite might be pretty exciting, the CEO of Apple stated that they are going to more tightly integrate their product line. They own Macromedia so we shall see…\n\nI think it’s true about the Adobe switch, you just need to transfer your license, but check their website to make sure.\n\nMacosxhints is great if you want to dive into Unix. MacFixIt has its merits. The Apple boards are about as good as any…\n\nThere’s a million boards out there for Macintosh, you don’t really need to subscribe to a magazine.\n\nWalk towards the light, walk towards the light…\n\nJust kidding, CPUs are dispensable every three years. I’m in love with monitors.\n\npeace\n\n"
    },
    {
      "time": " 26.Apr.2006 12.17am",
      "content": "\\> Is there some kind of website program (page editing and ftp transfer) included that will suffice, or will I need another program for that? (Using Frontpage now)\n\nWhen you buy a Mac, you get iWeb, which is one of the iLife apps.  \n [http://www.apple.com/ilife/iweb/](http://web.archive.org/web/20080929202936/http:/www.apple.com/ilife/iweb/ \"http://www.apple.com/ilife/iweb/\")\n\n"
    },
    {
      "time": " 26.Apr.2006 4.08am",
      "content": "\\>Is there some kind of website program (page editing and ftp transfer) included that will suffice, or will I need another program for that? (Using Frontpage now)\n\nCyberduck is great is does SSH so if you have a server that only allows that it works brilliantly.\n\n[http://cyberduck.ch/](http://web.archive.org/web/20080929202936/http:/cyberduck.ch/ \"http://cyberduck.ch/\")\n\n\\>When you buy a Mac, you get iWeb, which is one of the iLife apps.\n\nMake sure the ILife is current on the machine you buy or you have to buy the upgrade... I bought my powerbook sometime last year when IPhoto 5 had been already released and saying it supported RAW photo files... but the currently shipping Macs all had ILife old...\n\ntypical don’t get me started on all the Macs I bought,,, Mac SE ($3999, 1 meg ram.. 20meg hard drive) then the SE30 cames out months later, Wallstreet Powerbook no floppy, no USB then Apple discontinues the floppy drive and the only way to transfer was with a PCMCIA card.\n\n"
    },
    {
      "time": " 26.Apr.2006 6.32am",
      "content": "<cite>typical don’t get me started on all the Macs I bought,,, Mac SE ($3999, 1 meg ram.. 20meg hard drive) then the SE30 cames out months later...</cite>\n\nWanting to avoid anything like this, I thought it was great this Macbook just now coming out.\n\n<cite>The CS2 suite is not going to run native on that machine until CS3 - second quarter 2007.</cite>\n\nI can wait until then to upgrade (using CS now). It seems funny Adobe isn’t ready with that sooner. So this dual processor thing is that new...\n\nI’m been fairly oblivious to Mac progress since it wasn’t an option for me before. I just know I banged around on one before and it all seemed fairly intuitive, so it doesn’t scare me. And I’m told PS (where I live) will be pretty much be the same.\n\nMy friend, who recently switched to Mac is thrilled with my decision. (I was always his tech support)  \n: )\n\n"
    },
    {
      "time": " 26.Apr.2006 8.05am",
      "content": "One piece of advice: go to the refurb section of the Apple store (it’s at the lower right of the Store page - the red SAVE banner). These machines are factory refurb, have been given new serial numbers and have all the same guarantees as new machines for as much as 1/3 off the price. I bought an iMac there for a song and it works great. You should buy an extended Apple Care protection plan as well (even for a new machine).\n\n"
    },
    {
      "time": " 28.Apr.2006 12.08pm",
      "content": "Also on the same note as the above, not all refurbs are actually refurbs. Some are merely machines someone bought on a whim, decided they didn’t want it when they got it and shipped it back barely or not even used. They can’t sell it as new anymore so they restock it and sell it as used or refurbed.\n\n"
    },
    {
      "time": " 28.Apr.2006 12.33pm",
      "content": "I have my heart set on the new Macbook Pro due out this week. I doubt I’ll see that one in the refurb section for a while.\n\nOne thing I have noted so far, is if you go into a Mac store, the salesman are much better informed than the average PC outlet salesman, who it seems tries to act like he is informed, but usually doesn’t know what I am talking about when I ask a simple question.\n\nI haven’t even switched yet and am already liking it.  \n: )\n\n"
    },
    {
      "time": " 29.Apr.2006 8.25am",
      "content": "I say go for it. Enjoy your new Mac! I played with the 15 inch Macbook for a weekend and loved it.\n\n"
    },
    {
      "time": " 29.Apr.2006 3.17pm",
      "content": "I’m a longtime Mac user but I haven’t taken the plunge switching to the Intel Macs yet. The 17” MacBook Pro does look very nice however. Virtualization technology (such as Parallels) that allows you to run Windows apps with decent performance also makes the Intel Macs quite attractive.\n\nIf you are considering having a laptop as your only machine, I **strongly** encourage you to think carefully about backups and the AppleCare extended warranty.\n\nAlthough the machines are pretty expensive, after a while the data on the machine will be more valuable than the machine itself. If the laptop is lost or stolen, or if you need to send it in for repairs and they wipe the disk, you’ll be toast unless you have good backups. You can get a coupla hundred G external FireWire disk for $150-$300 depending on speed and capacity.\n\nYou should also consider the AppleCare extended warranty, which costs $349. If you carry the laptop everywhere it’ll be susceptible to damage from being jostled around, connectors being plugged and unplugged (well maybe not the cool new magnetic power plug), being dropped, having beverages spilt into the keyboard, etc. Any of these can be fatal. I’ve fortunately never had to use AppleCare. However, there are many Mac users at my workplace and several report excellent repair service under AppleCare.\n\nThese do add significantly to the cost of the machine. I recommend you factor backups and AppleCare into the cost of any new machine that you buy. Whatever you decide, happy Mac’ing! I’m sure you’ll enjoy it.\n\ns’marks\n\n"
    },
    {
      "time": " 29.Apr.2006 3.28pm",
      "content": "<cite> I recommend you factor backups and AppleCare into the cost of any new machine that you buy.</cite>\n\nBack-ups I already have covered with two USB 2.0 120 Gb drives (one complete backup is kept at a different location and updated), and the warranty I was already planning on. Both of my last two laptops it has paid for itself. One for a screen, and one for a motherboard failure. (I know as soon as I stop doing regular backups <cite>that</cite> is when I will have a hard-drive failure).  \n: )\n\n"
    },
    {
      "time": " 29.Apr.2006 3.48pm",
      "content": "Fontplayer, it sounds like you’re way ahead of me. Glad to hear it.\n\ns’marks\n\n"
    },
    {
      "time": " 29.Apr.2006 10.22pm",
      "content": "I backup my Mac portable to a cheap HD in a Firewire enclosure. I think the street value to my 80GB drive, with enclosure, is about $100. I use the free utility Carbon Copy Cloner to ’clone’ my whole laptop drive onto a 30GB partition I’ve set up. This is something that an average user can figure out, no deep technical knowledge necessary. If my drive is stolen, destroyed, etc. I’ll just get a new one and clone my data over. I try to do this every month or so. I usually set it to clone before I go to bed, it takes 30min or so....  \nI recommend it.\n\nAlso, I don’t buy Applecare. I don’t necessarily think it’s a bad idea, it’s just that its just that I’m not sure that I’ll get my money out of it. Apple products already have a warranty.\n\n"
    }
  ]
}
