{
  "id": "19517",
  "title": "Creating a bold version.",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi,\n\nI have created a font in Fontlab. I went to use the inbuilt function to make it bold and the characters have become distorted, additional points have been added and the height in some characters has decresed - do you know what is causing this and is there a way to create a bold version of the type face without these errors occuring?\n\nThanks.\n\n",
  "author": "heners",
  "time": "26 Apr 2006 — 3:48am",
  "uid": "10877",
  "comments": [
    {
      "time": "26 Apr 2006 — 5:03am",
      "content": "Yes! There is no way of just \"bolding\" a typeface.  \nYou just have to design the bold version. You should understand the specific needs  \nof your own typeface. Turning bold is not just pressing a button, that's why designing type takes so much time.\n\n"
    },
    {
      "time": "26 Apr 2006 — 5:22am",
      "content": "Thanks for the reply, I knew I would have to make some minor alternations to the font, but not to the extent that it occured.\n\n"
    },
    {
      "time": "26 Apr 2006 — 12:46pm",
      "content": "However, once you understand how the \"Bold\" and other transformations work, it is possible to design your face with these in mind, to make \"bolding\" easier.\n\nCertain kinds of typeface are more amenable to \"push button\" bolding, for instance light, monoline faces.\n\n"
    },
    {
      "time": "26 Apr 2006 — 12:53pm",
      "content": "The promise of \"Auto\" is rarely kept. As Nick says, you can learn some ways to make bolding automation less destructive but there is no avoiding a sound thorough redraw. Think of \"Auto\" as a starting point only.\n\nChrisL\n\n"
    },
    {
      "time": "29 Apr 2006 — 1:12am",
      "content": "\\> and the height in some characters has decresed\n\nThis happens when the outlines are in the _wrong_ direction.  \nReverse the contours to counterclockwise (Type 1) direction.\n\n"
    }
  ]
}
