{
  "id": "19529",
  "title": "Personal Identity Expanding",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "OK Prakash. Thanks again for the feedback/clarification. I’ve bounced it all around a bit more. Here’s where I’m at.\n\nInsert image isn’t working for me, so here’s a link.\n\n[http://i6.photobucket.com/albums/y234/jupiterboy/Sample3.gif](http://web.archive.org/web/20080118114806/http:/i6.photobucket.com/albums/y234/jupiterboy/Sample3.gif \"http://i6.photobucket.com/albums/y234/jupiterboy/Sample3.gif\")\n\n [‹ Victorian(?) style logo for small web/dtp business](http://web.archive.org/web/20080118114806/http:/www.typophile.com/node/19648 \"Go to previous forum topic\") [Ligatures and flourishes ›](http://web.archive.org/web/20080118114806/http:/www.typophile.com/node/19374 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080118114806/http://www.typophile.com/user/4204\" title=\"View user profile.\">jupiterboy</a>",
  "time": "<br>",
  "uid": "4204",
  "comments": [
    {
      "time": " 26.Apr.2006 12.00pm",
      "content": "Good layout. Nice colors. Work on hierarchy of the information more. You could add more negative spacing for more elegance + better visual balance. The character looks a bit scary at the moment. On the envelope I think its a bit large. And too much information. Use the envelope as a hint or a lead in. Think of it as telling a story. Check out this guide.\n\n[http://prakashnair.com/secret/envguide.gif](http://web.archive.org/web/20080118114806/http:/prakashnair.com/secret/envguide.gif \"http://prakashnair.com/secret/envguide.gif\")\n\n"
    },
    {
      "time": " 26.Apr.2006 12.17pm",
      "content": "Thanks. I’m stuck in this sixties office color world.\n\nWhen you say more negative spacing, I’m assuming you are talking type rather than image? That’s the second scary I’ve had, hmmmm. I’ve been reading the postal regs for a couple of weeks. I’ve got the return isolated in the right area, but the image is in violation. I see so many printed envelopes that don’t follow the guidlines though. Frustrating. Not sure I can afford to do the back flap.\n\n"
    },
    {
      "time": " 26.Apr.2006 5.11pm",
      "content": "Yes, typographic space. US postal systems are tricky. Some go through and some dont even if it does violate the system. Also think of whatever medium you are using as an opportunity. Use both sides of the business card for better pacing. Use the inside of envelopes for wild patterns or hidden messages.\n\n"
    },
    {
      "time": " 27.Apr.2006 7.16am",
      "content": "Bump. Revised.\n\n"
    },
    {
      "time": " 27.Apr.2006 8.41pm",
      "content": "Better, but still needs work. the guy is still scary. I would try outlining the figure instead of coloring him in. That could resolve a lot of issues. Also, the rounded rectangular line is annoying me. Its not needed and doesn’t help in any way. I would somewhat understand the relationship if the printed medium (card, letterhead) was also round. Your name running vertically is also strange. Again, you dont use it anywhere else. Set up relationships between each element and carefully think the hierarchy out. Its not so easy is it?\n\n"
    },
    {
      "time": " 28.Apr.2006 7.28am",
      "content": "Tell me about your fear. Tell me about the scary guy.\n\nThe vertical name relates to the mech avatars on the back, and causes both sides of the card to work as a vertical card, while the business info remains traditionally oriented for pragmatic reasons.\n\n ![](http://web.archive.org/web/20080118114806im_/http:/www.typophile.com/files/HED_6633.jpg)\n\n"
    },
    {
      "time": " 28.Apr.2006 9.55am",
      "content": "The rounded corners are really working well. In some ways it can represent the round corners on keyboard’s keys (typewriter as well?).  \nOk I would try to look closely at a typewriter and its form. Maybe you can borrow some of the vocabulary here. The guy isnt really working. I think you would want to go for a more humurous side.\n\n[http://www.shutterstock.com/pic-50570.html](http://web.archive.org/web/20080118114806/http:/www.shutterstock.com/pic-50570.html \"http://www.shutterstock.com/pic-50570.html\")  \n [http://www.jadekraft.com/image\\_manager/attributes/image/image\\_3/\\_6151194...](http://web.archive.org/web/20080118114806/http:/www.jadekraft.com/image_manager/attributes/image/image_3/_6151194_thumbnail.jpg \"http://www.jadekraft.com/image\\_manager/attributes/image/image\\_3/\\_6151194\\_thumbnail.jpg\")\n\nI highly recommend you look at Jenifer Sterlings work and understand how she utilizes her page.\n\n"
    },
    {
      "time": " 28.Apr.2006 10.55am",
      "content": "I’m appreciating your input. Retro technology, retro office, folder tabs, etc. these are all parts of the idea. I have seen too much focusing on the keyboard keys though. I feel like that has been thoroughly digested by even stock photography at this point.\n\nNow I’m really looking at the image, and having to explain, so that is a real negative. I wish I had a couple more opinions. The image is Pam and myself with vintage camera/typewriter replacing our heads. I think it is valid to call this scary, but it seems like it simply is not reading for you. It may be the way I’ve presented it here.\n\n ![](http://web.archive.org/web/20080118114806im_/http:/www.typophile.com/files/Image_6384.jpg)\n\nWhat catches me off gaurd is that, for me, this is humorous.\n\nJenifer Sterlings work is wonderful. In my situation, I do believe that many of my potential clients could be turned off by something this deconstructed. I think I may work with a radial sub-composition structure though, because I think this might work well.\n\nLook at this work. See how there is a constrained context and a formalism that is very imposed?  \n [http://store.mcsweeneys.net/index.cfm/fuseaction/catalog.list/object\\_id/...](http://web.archive.org/web/20080118114806/http:/store.mcsweeneys.net/index.cfm/fuseaction/catalog.list/object_id/625A37B0-2E23-4472-A99B-E39BB0FED607/Periodicals.cfm \"http://store.mcsweeneys.net/index.cfm/fuseaction/catalog.list/object\\_id/625A37B0-2E23-4472-A99B-E39BB0FED607/Periodicals.cfm\")\n\nI want to look in that direction without nailing everything down so tightly, rather than blowing everything up and working like a painter.\n\n"
    },
    {
      "time": " 28.Apr.2006 11.44am",
      "content": "I have to admit this is one occasion that a pdf might have been more useful, because until now I had thought it was only one figure with a typewriter on his shoulder and a camera for a head. I have to say that I don’t like the type on the illy, it seems unnecessary, I think you could look at separating the two figures slightly, or at least increasing the weight of the strokes and making the clear area between your shoulder and the typewriter white. You could also look at reducing some of the texture or making one figure have texture and the other not or using the tints in your pallette and running the colour over or short of the strokes slightly more. Pallette is a good choice but it is kind of difficult to assess the type.  \nI cannot help with the envelope, the rules for Royal Mail are bound to be different to US Mail.  \nTim\n\n"
    },
    {
      "time": " 28.Apr.2006 11.59am",
      "content": "Sry. Here’s the type. Good comments.\n\n ![](http://web.archive.org/web/20080118114806im_/http:/www.typophile.com/files/HEDCRDFP2_3860.gif)\n\n"
    },
    {
      "time": " 28.Apr.2006 12.03pm",
      "content": "Good choice, although it’s a bit too tightly kerned for my tastes, nice treatment though.  \nTim\n\n"
    },
    {
      "time": " 28.Apr.2006 12.34pm",
      "content": "Thanks for the input.\n\n ![](http://web.archive.org/web/20080118114806im_/http:/www.typophile.com/files/Final_6218.jpg)\n\n"
    }
  ]
}
