{
  "id": "1953",
  "title": "Identity marks",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Can you please give me the most honest feed back   \non the logos that I am providing. let me know if I am going on the right direction.   \n   \nplease give brief explanation to help me understand better the direction that I am going?   \nPlease think about this and not knee jerk a response\n\n<!--attachment: critique_logo-19838.unk*attachment_icon.gif*application/x-macbinary*206.1*identity+marks*critique%5clogo --><!--attachment: critique_logo-19838.unk*attachment_icon.gif*application/x-macbinary*206.1*identity+marks*critique%5clogo -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131108203829im_/http:/www.typophile.com/forums/icons/attachment_icon.gif\" align=\"left\" alt=\"application/x-macbinary\">identity marks<br><a href=\"http://web.archive.org/web/20131108203829/http:/www.typophile.com/forums/messages/29/critique_logo-19838.unk\" target=\"_blank\"><b>critique\\logo</b></a> (206.1 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "isnik",
  "time": "5 Nov 2003 — 2:30pm",
  "uid": "1986",
  "comments": [
    {
      "time": "5 Nov 2003 — 2:59pm",
      "content": "Can you please post a gif of your work. Thanks.\n\n"
    },
    {
      "time": "6 Nov 2003 — 8:07am",
      "content": "definetly tom\\_ thank you for taking the time.   \nMy strength is not in type so please, give me great criticism to bring me up on the typographic food chain.   \nonce again thank you all.   \n ![HELP/ identity_marks](http://web.archive.org/web/20131108203829im_/http:/www.typophile.com/forums/messages/29/19906.gif)\n\n"
    },
    {
      "time": "6 Nov 2003 — 9:39am",
      "content": "I would start by throwing out the \"symbols\" labeled \"A\" and \"C\".   \n   \n\"RAGIR\" is a complex name, in that there's no obvious linguistic assumption to make for pronunciation...that's coming from an English speaking perspective. Since \"CONSULTING\" is English, I assume that comment is applicable here. You may want to consider using some form of phonetic symbols. In fact, many of these symbols cross international boundaries...This may allow you to ditch the map altogether to create a purely typographical (not topographical...he he) brand mark.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "6 Nov 2003 — 10:31am",
      "content": "point taken scott.   \n   \nI used the symbols\" labeled \"A\" and \"C\".   \njust to differentiate the different ideas that I am working on.   \nplease inform me and euducate me on phonetic symbols. My intentions are as you stated crossing international boundaries, with the identity marks. The logo is for a friend that just started a translating business. English a Spanish, I want to achieve a minimal approach, however I don't thing that I am accomplishing my mission.   \n   \nPlease give me more feed back.   \n   \nsincerely;   \nIN ![logo](http://web.archive.org/web/20131108203829im_/http:/www.typophile.com/forums/messages/29/19929.gif)\n\n"
    },
    {
      "time": "6 Nov 2003 — 2:01pm",
      "content": "This could be a shipping company. A geological company. A computer company.   \n   \nI would focus on a mark that says _translation_, rather than one that says _international_. Harder maybe, but your result will be smarter if you can pull it off.   \n   \nDon't know if you can do this, but consider suggesting CONSULTING change to TRANSLATION or LINGUISTICS or LANGUAGE SERVICES or nothing at all. Nothing would be just as informative as consulting.   \n   \nBest case scenario is a logo that shows the concept translation, and the word Ragir. That's it!   \n   \nGood luck.   \nRandy\n\n"
    },
    {
      "time": "6 Nov 2003 — 3:47pm",
      "content": "I'd definitely agree with Randy about the shift from \"CONSULTING\" to \"TRANSLATION\". The only thing I can think of that might salvage using \"CONSULTING\" is to make the word somehow represent translation...maybe show the word in both English and Spanish.   \n   \nI think my suggestion of using phonetics with \"RAGIR\" is even more appropriate for a translation company (Although there is some fun irony in a translation company having a name that is difficult to pronounce). This may allow you to use the word independent of \"CONSULTING\" or \"TRANSLATION\". Phonetics has to do with sound and saying words correctly...things that a translator should master. To view phonetic symbols pick up any dictionary. These are the symbols used in the pronunciation keys of every word in the dictionary. If you're on OSX, then look at the dictionary in Sherlock.   \n   \nGood luck!   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "6 Nov 2003 — 9:09pm",
      "content": "thanks a great deal to both of you Scott an Randy,   \nI will definetly play around with the logos some more.   \nI will post the results .   \nonce again thank you for giving me great feed back and of course expanding my creativity.\n\n"
    }
  ]
}
