{
  "id": "19545",
  "title": "Stroke weights - should I really be messing with the natural order?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Good morning or evening, depending on your orientation (It’s morning for me, in an overcast region of East London...)\n\nI’ve started playing with a type logo for a very painty portfolio. I’m going with type to offset the hand-drawn-ness of the rest of the site. However, I’m worried that I’m commiting some horrid typographic faux pas. Basically...\n\n...Is it “ok” to massively distort text by ramping up the stroke weights until you’ve made a monster of what was a simple and elegant character, is it looked down on? It seems like such an easy thing to do, and some of the results, having messed with other faces looked pretty nice. I don’t like the idea of it though, it’s such an out-of-the-box conclusion...\n\nI rather like the results, but it feels wierd to have mutated the text so much. The main text is Century Old Style (5pt) & the numeral ’1’ is Letter Gothic (20pt).\n\nYour thoughts would be interesting (forgive me if the real faux pas is having very little experience with type and asking a silly question ;)\n\nKind regards,\n\nP\n\nLOGO\\>\\>\\>  \n [http://www.55designs.co.uk/skribe1.jpg](http://web.archive.org/web/20070808135502/http:/www.55designs.co.uk/skribe1.jpg \"http://www.55designs.co.uk/skribe1.jpg\")\n\n [‹ Letterpress Website](http://web.archive.org/web/20070808135502/http:/typophile.com/node/18471 \"Go to previous forum topic\") [Sans Serif for Newspaper Headlines ›](http://web.archive.org/web/20070808135502/http:/typophile.com/node/19269 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070808135502/http://typophile.com/user/11176\" title=\"View user profile.\">MekOne</a>",
  "time": "<br>",
  "uid": "11176",
  "comments": [
    {
      "time": " 27.Apr.2006 7.53am",
      "content": "i think its definitely ok.. you could also apply just the century old style without tampering with it.. what fun is that!\n\nyou took something and tried to make it your own, thats a great process in my opinion..\n\nand besides, thinking within the box is dull anyway.. !\n\n"
    },
    {
      "time": " 27.Apr.2006 7.54am",
      "content": "Do what thou wilt shall be the whole of the law…\n\npeace\n\n"
    },
    {
      "time": " 27.Apr.2006 8.12am",
      "content": "Nice line Mr Cutler.....I feel almost godlike in my typographical exploration [sic] :) - and not at all dull!\n\nI’m really pleased with the look of the text, so I’m going to keep playing. I’m like a tiny child when it comes to design, I need constant reassurance.\n\nTo both of you, I thank you kindly.....\n\n"
    },
    {
      "time": " 27.Apr.2006 9.05am",
      "content": "Peter, this broad effect has already been done in typefaces, eg ITC Pacella, with a polished typographic finish.  \nIt was an effect that could be achieved photographically (a “mod”) with the phototypositor machine c.1970, and that is probably what gave the inspiration to Mr Pacella.  \nSo in sense, you have committed a faux pas, because back in the day they would have cleaned up their artwork, and set it looser to begin with, so that the overlapping didn’t occur.\n\nHowever, there is a lot of typographic progress that has resulted when one generation’s artefacts become the next’s rasion d’etre. That kind of thing was a large part of David Carson’s working method.\n\nAnd we’ve had the de-skilling of art in recent years, which has happened in design too, so that work which is TOO slick is the faux pas.\n\nI would say, if you got your hands dirty (so to speak) and did the work yourself and experimented till you got a result that clicks for you (not to mention the client...), no worries.\n\n"
    },
    {
      "time": " 27.Apr.2006 9.46am",
      "content": "Hey Nick,\n\nJust checking Pacella Black Italic, very nice, although I’m definately fond of the spacing I’ve “achieved” with the Century. I would’ve been happier had I actually set these on a press / phototypositor and achieved the effect, notching up a slider bar in Illustrator doesn’t really constitute getting my hands even remotely dirty! For someone who doesn’t really like current trends in using random abstract arbitrary ’clutter’ as an illustrative tool (paint splats and composites of scratchy lines), I should steer clear of the above effect - I’d like to understand why I like it first, what it’s doing to the letters and why it works for me...Ideally.\n\nForgive me if I’ve misunderstood - In this arena I’m amateurish at best.\n\nIntresting stuff Nick. Thanks...\n\n"
    },
    {
      "time": " 27.Apr.2006 11.05am",
      "content": "Nice line Mr Cutler….\n\nCannot take credit for it - it was originally Aleister Crowley who lifted it from a Greek philosopher whose name escapes me - the original is “Do what thou wilt”\n\nIt is also part of the Wiccan creed.\n\npeace\n\n"
    },
    {
      "time": " 27.Apr.2006 12.44pm",
      "content": "Nice.  \nI’m all down for that.\n\nPeace\n\n"
    }
  ]
}
