{
  "id": "19548",
  "title": "help for personal logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "im required on my 2nd yr graphic design course to produce a logo for myself, for my portfolio of work, not a great idea i dont think but im doing it anyway.\n\nI had some quick ideas today that id like to show, to see if anyway could point me in the right direction, theyre quite shabby and by no means finished at all.\n\n...\n\nthe top one is supposed to be ’highlighted’ as if i have highlighted the word in order to copy it. This idea stems from my work, in which ’appropriation’ does feature, not plagiarism, obviously i wouldnt want to broadcast this, but i thought it oculd be a sort of ’in joke’ , i htought it could dictate the type treatment of headings etc, possibly\n\nthe others are centered around the idea of ’roots’. Communicating strong foundations, growing talent, researching to the root of a theme etc........at the moment it looks like the roots have just been placed on, theyre only relatively quick versions, but maybe i need some idea of integrating the roots with my name...\n\nthanks for your help!\n\npete\n\nlink:\n\n[http://i21.photobucket.com/albums/b265/jarvisjarvis/logologo.gif](http://web.archive.org/web/20070629091644/http:/i21.photobucket.com/albums/b265/jarvisjarvis/logologo.gif \"http://i21.photobucket.com/albums/b265/jarvisjarvis/logologo.gif\")\n\n [‹ Media company logo](http://web.archive.org/web/20070629091644/http:/typophile.com/node/20003 \"Go to previous forum topic\") [business cards ›](http://web.archive.org/web/20070629091644/http:/typophile.com/node/19771 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070629091644/http://typophile.com/user/2873\" title=\"View user profile.\">jarvis</a>",
  "time": "<br>",
  "uid": "2873",
  "comments": [
    {
      "time": " 27.Apr.2006 7.34am",
      "content": "I’m not convinced the roots approach adds to the design, but I do like the way it looks, and have the idea that you could adapt the lc “t” so that it flowed into a root system that spread underneath the type.\n\n"
    },
    {
      "time": " 27.Apr.2006 7.37am",
      "content": "sorry...\n\n"
    },
    {
      "time": " 27.Apr.2006 7.44am",
      "content": "strong idea, but the roots do not look like they spring forth organically from the letters\n\n"
    },
    {
      "time": " 27.Apr.2006 8.06am",
      "content": "nice idea!\n\ni like the middle one, where the J stems from the roots.. its almost reminiscent of a tree..\n\n"
    },
    {
      "time": " 27.Apr.2006 8.07am",
      "content": "Its not working for me at all...as it is now. You have to break away from the literal here and really think about what makes you different from the million other designers here. Growth, among other things, can be interesting but use it in a subtle way. Perhaps using a series, in which case you can have a kinetic identity.\n\n"
    },
    {
      "time": " 27.Apr.2006 11.57am",
      "content": "yea i understand it might look a little too cliche maybe.......perhaps if the j desended into a root type thing, but less obvious\n\nwhatabout the top one? too simple? no character?\n\n"
    },
    {
      "time": " 27.Apr.2006 8.44pm",
      "content": "Aside from formal issues, the top one is dull. Okay so you took the box-tool in Illustrator and outlined your name. Again, it doesnt really say much about you.\n\n"
    },
    {
      "time": " 28.Apr.2006 5.55am",
      "content": "The cut and paste idea could work if you highlighted part of the name, included a cursor and made use of the colour changes you sometimes get with software packages, in other words what you wanted to disguise, at the moment it looks a bit balanced on the J at the bottom of the box. As you note the roots are only sitting on the type, I think the root (sorry:) you should take is using the J and developing from there. In some ways combining the two might work with the box representing sky and breaking the J from the box to have roots stretching into the ground. Have a look at tightening your Pe and Ja kerning.  \nTim\n\n"
    },
    {
      "time": " 29.Apr.2006 4.08am",
      "content": "this has been curdling in my brain for the last day or two........maybe my name could be a stamp? because i use a lot of found material that i ’stamp’ my mark on, i oculd show my name on a rubber stamp, or i could print the name with the effect of a rubber stamp....any ideas? sorry im not showin anything new\n\n"
    },
    {
      "time": " 29.Apr.2006 9.04am",
      "content": "My first instinct would be to avoid that, it seems too much of a cliché, it also would have to be very well executed, probably by having a rubber stamp made for you, to be convincing. Once your brain starts curdling, walk away and do something else, take the Bank Holiday from thinking about it and try another approach would be my advice.  \nTim\n\n"
    },
    {
      "time": " 29.Apr.2006 10.05am",
      "content": "i am gonna have a break from it now......i had another go with the copy idea....\n\nlink:\n\n[http://i21.photobucket.com/albums/b265/jarvisjarvis/f37c6444.gif](http://web.archive.org/web/20070629091644/http:/i21.photobucket.com/albums/b265/jarvisjarvis/f37c6444.gif \"http://i21.photobucket.com/albums/b265/jarvisjarvis/f37c6444.gif\")\n\ni think it works a bit better, and it could comein useful for highlighting other stuff im going to make, though it stil may look a little dull...\n\n"
    },
    {
      "time": " 29.Apr.2006 2.30pm",
      "content": "ok i this is the idea i had when i was in sainsburys. Because in my work i use a lot of existing themes, pictures and found material, and offer a different slant on them, i thought i could have a logo that has different perspectives. Maybe there will be 4 versions of the logo with different perspectives, though the white name will never move. so here it is, or the rough idea anyway:\n\n[http://i21.photobucket.com/albums/b265/jarvisjarvis/perspectivelogo.gif](http://web.archive.org/web/20070629091644/http:/i21.photobucket.com/albums/b265/jarvisjarvis/perspectivelogo.gif \"http://i21.photobucket.com/albums/b265/jarvisjarvis/perspectivelogo.gif\")\n\nits a mess at the moment however, the s is abismal, and i think i need a different sans serif, something a little bulkier maybe, any thoughts?\n\n"
    },
    {
      "time": " 1.May.2006 9.44am",
      "content": "Try not to jump all over the place. Get a concept and work your way through it. That is a methodology of a true designer. I think the roots has possibilities...just not as it is now. I think your trying to say growth anyway so it would be more succefull as a kinetic identity rather than one image.\n\n"
    },
    {
      "time": " 1.May.2006 10.08am",
      "content": "What’s so inspiring about shopping at Sainsbury? I used to hate it!  \nHey, I don’t dislike the roots idea if it’s that what you think best represents you, but maybe you should try to invert the process: instead of having roots coming out of the letters, try to have letters originating from roots...does it make any sense?  \nI don’t know about the first...from the academic point of view, your tutors may think you didn’t try hard enough...\n\n"
    },
    {
      "time": " 1.May.2006 10.14am",
      "content": "Just out of curiosity, I’ve seen a beautiful work involving roots. It was a campaign to save the rainforest and the kids worked with 2 lungs representing the importance of the rainforest etc etc...cause lungs do look a bit like tree roots...\n\n ![](http://web.archive.org/web/20070629091644im_/http:/typophile.com/files/roots%201_3878.jpg)\n  \n\n ![](http://web.archive.org/web/20070629091644im_/http:/typophile.com/files/roots%202_5987.jpg)\n  \n\n ![](http://web.archive.org/web/20070629091644im_/http:/typophile.com/files/roots%203_4170.gif)\n  \npity I can’t find the final solution, it was really beautiful. What I am trying to say is that you can do wonderful things with roots...\n"
    },
    {
      "time": " 1.May.2006 11.33am",
      "content": "i have been jumping ideas a bit......which proabbaly as you say isnt a good thing. I do feel now though that the root idea is a bit cliche, and more importantly im trying to produce a them that could continue into some interesting printed peice to display my portfolio.  \nA the moment this is why i have continued with the ’me lookin at things in different perspectives’ route.........developed more:\n\n[http://i21.photobucket.com/albums/b265/jarvisjarvis/NEWEST.gif](http://web.archive.org/web/20070629091644/http:/i21.photobucket.com/albums/b265/jarvisjarvis/NEWEST.gif \"http://i21.photobucket.com/albums/b265/jarvisjarvis/NEWEST.gif\")\n\n[http://i21.photobucket.com/albums/b265/jarvisjarvis/outline.gif](http://web.archive.org/web/20070629091644/http:/i21.photobucket.com/albums/b265/jarvisjarvis/outline.gif \"http://i21.photobucket.com/albums/b265/jarvisjarvis/outline.gif\")\n\nthe last ones are most recent.......so maybe the idea that the logo changes, to show different perspectives.....probably only using 1 part of my name, either pete or jarvis.....any thoughts?\n\n"
    },
    {
      "time": " 1.May.2006 4.21pm",
      "content": "From your tone I get that you are not convinced of the root direction. I think those commenting want to hear that you are on board with your own idea.\n\nI like the negative shape situation in this first new direction. Maybe your idea is that you don’t have to be a growing tree or anything else for that matter.\n\n"
    },
    {
      "time": " 7.May.2006 4.40pm",
      "content": "well im still on the perspective thing which is definitely my route now........however it all was a bit in yer face and cocksure, so iv taken it down a notch but still with the perspective theme, whats the feeling about this?\n\n[http://i21.photobucket.com/albums/b265/jarvisjarvis/framelogo.gif](http://web.archive.org/web/20070629091644/http:/i21.photobucket.com/albums/b265/jarvisjarvis/framelogo.gif \"http://i21.photobucket.com/albums/b265/jarvisjarvis/framelogo.gif\")\n\n"
    },
    {
      "time": " 8.May.2006 12.14pm",
      "content": "Cocksure. What a good word.\n\nI like what you have here. It might even look nice with a hand-drawn line and less precision. Just an idea.\n\n"
    },
    {
      "time": " 18.May.2006 11.52am",
      "content": "Simply “PETE” is iconic and memorable. You’re most recent post is on to something.\n\n"
    }
  ]
}
