{
  "id": "19541",
  "title": "Alternative to Fairfield",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm the designer of an academic magazine that uses Fairfield for the main text, and have been looking for an alternative.\n\nThere's a desire to simply freshen up the look with a new typeface, but there are also practical considerations, mainly relating to stroke weight and contrast. The high contrast between the thick and thin strokes have impelled some readers to complain about readability, and the thin strokes make it particularly sensitive to very minor variations in ink density when on press.\n\nWhile I'm evaluating Sabon, Adobe Garamond, and Minion at the moment, I've also been looking for a font that has the precision and cleanliness of a Modern such as Bodoni without the drawbacks of stroke contrast. Walbaum and Centennial have the same drawbacks that Fairfield does.\n\nI know that all of you are far more aware than I of what's new — or old! — out there, and I'd appreciate any and all opinions and recommendations.\n\nThanks.\n\n",
  "author": "circlehdon",
  "time": "26 Apr 2006 — 4:38pm",
  "uid": "5344",
  "comments": [
    {
      "time": "26 Apr 2006 — 8:06pm",
      "content": "If you want to replace Fairfield but maintain its elegance and traditional forms, have a look at [Whitman](http://web.archive.org/web/20131016093509/http:/www.fontshop.com/showfont.cfm?fid=FB.116812.0.0), [Miller](http://web.archive.org/web/20131016093509/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Miller), and [FF Atma](http://web.archive.org/web/20131016093509/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=FF%20Atma).\n\nSabon, Garamond, and Minion are nice, but far more overused than these.\n\n"
    },
    {
      "time": "26 Apr 2006 — 10:56pm",
      "content": "what's the subject? what association are you looking for? Do you need italics? bold? both? small caps?\n\n"
    },
    {
      "time": "27 Apr 2006 — 9:00am",
      "content": "[FF Maiola](http://web.archive.org/web/20131016093509/http:/www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufacturer&displayfontid=FF.11516.0.0) would be nice.\n\n"
    },
    {
      "time": "29 Apr 2006 — 4:47pm",
      "content": "Thanks for all of your suggestions so far.\n\nre: Typequake's questions, the magazine is published by the school of public health at the University of Michigan, so the content is focused on public health in relation to the school's program, staff, and students.\n\nI need to have something with a range of weights, italics, small caps, and lining and oldstyle figures. That's one reason I'm considering Adobe Garamond and Minion. To me, though, both lack a certain kind of refined elegance that a Bodoni or even Fairfield has.\n\nI realize that what I'm looking for may not exist, but I've come across a whole load of interesting stuff during my search, so it's been a valuable effort regardless.\n\ncircleh\n\n"
    }
  ]
}
