{
  "id": "19551",
  "title": "Looking for font: Guild - abandoned",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi folks,  \nI need to match a font on a job and all I know is the font name — it’s called Guild. I managed to get one font from the original artist after they couldn’t tell me where I could purchase, and indeed there is no foundry listed in the font info. This font is similar to Gill Sans, however there are some nice differences in the lower case glyphs, such as p, l, g, and note the oldstyle numerals. Boy! I want this font! Anyone know where I can buy it?  \nThanks for your help —  \nEd\n\nDoh! Can’t figure out that inserting/attaching thing — not working. So, here’s a link:\n\n[http://www.tundrastudios.com/guild\\_sample.jpg](http://web.archive.org/web/20081025103712/http:/www.tundrastudios.com/guild_sample.jpg \"http://www.tundrastudios.com/guild\\_sample.jpg\")\n\n [‹ Azulera elegant serif logo](http://web.archive.org/web/20081025103712/http:/typophile.com/node/19593 \"Go to previous forum topic\") [(x) swashy wedding script (font #531) - Fine Hand {Nicolai} ›](http://web.archive.org/web/20081025103712/http:/typophile.com/node/19568 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081025103712/http://typophile.com/user/12676\" title=\"View user profile.\">Edward Scott</a>",
  "time": "<br>",
  "uid": "12676",
  "comments": [
    {
      "time": " 27.Apr.2006 11.19am",
      "content": "The i has a tail too, making this similar to the Johnston revivals. I’ve seen a font from knockoff foundry Silver Graphics called Guild Sans, but that one is closer to Gill. Odd.\n\n"
    },
    {
      "time": " 28.Apr.2006 6.20am",
      "content": "Thanks — after some further sleuthing I’m convinced this is a proprietary font. The fact it has no foundry or copyright listed in the header of the one font I have makes me believe it is not a commercial font, and I’m just going to abandon my quest to purchase it. Using TypeTool, I compared some of the glyph nodes against my own copies of Gill Sans, and they pretty much match. Somehow this font got out of private hands and made it to me. I will replace the font in the materials I produce for this client with Gill Sans, mixing it with Monotype’s Gill Sans SC & OSF for the old style figures. To bad — it’s a nice font...\n\nThanks for your help, folks...  \nEd\n\n"
    },
    {
      "time": " 28.Apr.2006 9.25am",
      "content": "This has A LOT of the same characteristics as Bliss with some very odd adjustments. I won’t cry derivative too loudly, but it sure looks to be ...\n\n"
    },
    {
      "time": " 28.Apr.2006 10.52am",
      "content": "Bliss? Really? I think it’s much closer to Gill Sans.\n\n"
    },
    {
      "time": " 28.Apr.2006 2.15pm",
      "content": "Now that I’ve done a little side-by-side I’m confused. Perhaps they started with Gill, but mimicked some of the characteristics of Bliss. Specifically the d, 2, p, a, l. However, Bliss is more condensed that this sample.\n\n"
    },
    {
      "time": " 28.Apr.2006 8.16pm",
      "content": "the lowercase g looks pretty distinctive, so it shouldn’t be impossible to find. needless to say, i haven’t found anything. it’s definitely not Gill Sans or Bliss though.\n\n"
    }
  ]
}
