{
  "id": "19558",
  "title": "Suitcase",
  "forum": "Home",
  "tags": [
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20131018121627/http:/typophile.com/wiki/Indices) : [Foundries](http://web.archive.org/web/20131018121627/http:/typophile.com/wiki/Foundries) : Suitcase Type Foundry**\n\nSee [Suitcase Type](http://web.archive.org/web/20131018121627/http:/typophile.com/wiki/Suitcase%20Type).\n\n**[Indices](http://web.archive.org/web/20131018121627/http:/typophile.com/wiki/Indices) : [Type Technologies](http://web.archive.org/web/20131018121627/http:/typophile.com/wiki/Type%20Technologies) : Font Suitcase**\n\nSee [Font Suitcase](http://web.archive.org/web/20131018121627/http:/typophile.com/wiki/Font%20Suitcase).\n\n**[Indices](http://web.archive.org/web/20131018121627/http:/typophile.com/wiki/Indices) : [Software](http://web.archive.org/web/20131018121627/http:/typophile.com/wiki/Software) : [Font Management Software](http://web.archive.org/web/20131018121627/http:/typophile.com/wiki/Font%20Management%20Software) : Suitcase**\n\n ![](http://web.archive.org/web/20131018121627im_/http:/typophile.com/files/Fusion_5358.jpg)\n\nSuitcase is a font management program for Mac OS and Microsoft Windows. Many users of graphic design tools have so many fonts that they cannot keep them all active at once in the system. A large number of active fonts may degrade application performance as well as make it difficult to find fonts.\n\nSuitcase Fusion, released in January of 2006, merges two separate Macintosh font managers previously sold by Extensis. One of the font managers, Font Reserve, was previously sold by Diamondsoft before it was acquired by Extensis. Suitcase Fusion combines the most popular features of both products. For example, Suitcase Fusion retains the straightforward, easy-to-use interface of Suitcase X1. It adds to this a key Font Reserve feature, the Vault. The Vault is a centralized repository for fonts and font metadata. Both Suitcase and Font Reserves can upgrade their databases for Suitcase Fusion.\n\n ![](http://web.archive.org/web/20131018121627im_/http:/typophile.com/files/Vault_5935.jpg)\n\nThe location of Suitcase Fusion's vault is /Users/YourUsername/Library/Application Support/Extensis/Suitcase/Suitcase Font Database.suitcasevault.\n\nIf a user needs to move their Suitcase Fusion to a different user or system, they can do so simply by moving the Vault, and placing it in the same relative location.\n\nAnother feature taken from Font Reserve is face level activation for Macintosh font suitcases. With most font managers, fonts are activated as a suitcase, which means that all of the variations packaged in a suitcase, turn on at once. This would commonly be the book, italic, bold and bold italic weights, but some families have many more variations. Face level activation makes font conflicts far less likely because only the needed parts of a suitcase can be activated.\n\nSuitcase Fusion also features auto-activation plug-ins for popular design applications. Documents opened will automatically activate the fonts they need. If a user has more than one font with the same Postscript name, Suitcase uses an Extensis-developed technology called FontSense to determine which font was used in the document. Currently plug-ins are provided for InDesign CS , InDesign CS2, Illustrator CS, Illustrator CS2, as well as English and Japanese versions of Quark 6 and Quark 7.\n\nIf an application does not have a plug-in for auto-activation, Suitcase can still intercept its font requests and activate the font. However, for applications without a plug-in, only the Postscript name of the font is used. This can be less precise if there is more than one font with the same Postscript name in the Suitcase database.\n\nSuitcase Fusion works with all fonts that are compatible with a given operating system. On Macintosh systems, this includes PostScript Type 1, TrueType, and OpenType.\n\nSuitcase Fusion is localized for English, French, German and Japanese.\n\nSuitcase Fusion version 12.1.1 is compatible with Mac OS 10.3.9 and later, including both Intel and PowerPC systems. Suitcase for Windows version 9.2.2 is compatible with Windows 2000 and XP.\n\n",
  "author": "canderson",
  "time": "27 Apr 2006 — 11:23am",
  "uid": "9913",
  "comments": [

  ]
}
