{
  "id": "19557",
  "title": "Nintendo's \"wii\" logo",
  "forum": "Design",
  "tags": [

  ],
  "content": "Nintendo’s next gen console logo “wii”.\n\n[http://www.nintendo-europe.com/NOE/en/GB/news/article.do?elementId=8BSOI...](http://web.archive.org/web/20090514070520/http:/www.nintendo-europe.com/NOE/en/GB/news/article.do?elementId=8BSOIycJ4t1tpTSwy9u2VmCZRDTV1y8N \"http://www.nintendo-europe.com/NOE/en/GB/news/article.do?elementId=8BSOIycJ4t1tpTSwy9u2VmCZRDTV1y8N\")\n\nPersonally I’m not really liking the name or the logo. I like the concept behind it, but I can’t help but think “wee”. And I don’t think the characters have been designed and spaced very well either, they don’t seem to fit togther nicely.\n\nWhat do you think?\n\n",
  "author": "<a href=\"/web/20090514070520/http://typophile.com/user/8924\" title=\"View user profile.\">i0ta</a>",
  "time": "<br>",
  "uid": "8924",
  "comments": [
    {
      "time": " 27.Apr.2006 10.35am",
      "content": "Wii = Who’s _interesting_ idea? ;-)\n\n"
    },
    {
      "time": " 27.Apr.2006 11.00am",
      "content": "_can’t help but think “wee”_\n\n...as in “be a good boy and wee in the potty”?\n\n"
    },
    {
      "time": " 27.Apr.2006 11.07am",
      "content": "This is from the European website? Did they not think of the similarity to WWII? Maybe the young have no memory of this anymore…\n\nI think the name is blather and the logo is merely OK.\n\npeace\n\n"
    },
    {
      "time": " 27.Apr.2006 11.11am",
      "content": "This looks very close to Intel’s media-PC platform, viiv.\n\n[viiv site](http://web.archive.org/web/20090514070520/http:/intel.com/viiv/index.htm?iid=HMPAGE+Sub_06ww15_L)\n\njust slide the last v to the front:\n\nviiv\n\nvivi\n\nvvii\n\nwii\n\n"
    },
    {
      "time": " 27.Apr.2006 12.57pm",
      "content": "Paul, I had the same reaction. I immediately thought it was a WWII genre game, with a cutesy lower case twist, which was odd.\n\nSony has been playing in this realm for a while, with name brands that attempt to be universal, by not coming directly from any one language (think AIWA).\n\n"
    },
    {
      "time": " 27.Apr.2006 1.06pm",
      "content": "On Identityworks, Tony Spaeth explains that we are running out of nouns for company names. Maybe the same is true in product identity…\n\npeace\n\n"
    },
    {
      "time": " 27.Apr.2006 1.59pm",
      "content": "At first I thought they were renaming their WiFi service, like joeplent said this very much reminds me of the intel viiv branding, Revolution was a great name btw, they should have stayed with it.\n\nBut I guess anything beats the PS3 spiderman edition logo/wordmark\n\n"
    },
    {
      "time": " 27.Apr.2006 2.13pm",
      "content": "_we are running out of nouns for company names._\n\nand typefaces.\n\n"
    },
    {
      "time": " 27.Apr.2006 2.43pm",
      "content": "He stated that about 90% of nouns had been used…\n\npeace\n\n"
    },
    {
      "time": " 28.Apr.2006 12.40am",
      "content": "The question is, why dump the codename Revolution, which has been public for a year, in favor of wii, or as Gamespot calls it, **wiik**.\n\n"
    },
    {
      "time": " 28.Apr.2006 12.56am",
      "content": "“let’s go play with my WEE”\n\n“do you have a second controller for your WEE”\n\n“the disc isn’t loading, try blowing on your WEE”\n\n“WEE”\n\ni like the W-I-I idea. using the I’s to imply the multiplayer-focused nature of the system and all that. but really... WEE??\n\n"
    },
    {
      "time": " 28.Apr.2006 6.28am",
      "content": "So is “Wee” really how it’s pronounced?\n\n"
    },
    {
      "time": " 28.Apr.2006 6.41am",
      "content": "That’s how they were pronouncing it on the TV news last night.\n\nCheers, Si\n\n"
    },
    {
      "time": " 28.Apr.2006 6.47am",
      "content": "no, We is how you pronounce it. WE! MULTYPLAYER! thus the two i.\n\njoe: altough i know WWII as an abreviation (mainly because i talk to alot of english speaking people over the internet), WWII isnt a used abreviation outside US/UK i think. at least its not in german, and i highly doubt the french would use an english abreviation. thus “Wii looks like WWII for europeans” isnt really valid at all.\n\ni really like the name. revolution? thats SUCH a boring name for an electronic device. and whats the name of the next console by nintendo? revolution, part 2? come on..\n\n"
    },
    {
      "time": " 28.Apr.2006 9.46am",
      "content": "Kesh: How many nintendo consoles have you owned?\n\n:P\n\nI thought I left fanboys behind on digg... guess some of you creep around here too?\n\nAnd revolution is a perfect name for the device we are talking about, a console that may completely change the way we all have been gaming since we first saw pong, the controller _is **revolutionary.** _\n\nI personally can’t wait to have one, I just think the name they picked sounds like a little boy who wants to go to the bathroom.\n\n"
    },
    {
      "time": " 28.Apr.2006 10.42am",
      "content": "_a little boy who wants to go to the bathroom._\n\nAs gamers age, a growth market for Depends :-)\n\n"
    },
    {
      "time": " 28.Apr.2006 10.58am",
      "content": "LOL @ Nick\n\n"
    },
    {
      "time": " 28.Apr.2006 10.59am",
      "content": "There are a couple of commentaries on the name [here](http://web.archive.org/web/20090514070520/http:/blogs.rockymountainnews.com/denver/freePlay/2006/04/wii_has_fans_asking_why.html#more) and [here](http://web.archive.org/web/20090514070520/http:/wiredblogs.tripod.com/games/index.blog?entry_id=1467976) (linked from Slashdot.org).\n\n"
    },
    {
      "time": " 28.Apr.2006 11.34am",
      "content": "\\>\\> Kesh: How many nintendo consoles have you owned?\n\nhmm, my parents bought me a gameboy when i was a boy, havent ever bought another console myself and never owned one neither, only played sometimes with friends on theirs. sorry, you’re wrong here :)\n\n"
    },
    {
      "time": " 28.Apr.2006 12.20pm",
      "content": "Kesh : I stand corrected.\n\n"
    },
    {
      "time": " 28.Apr.2006 6.00pm",
      "content": "so we’re not gonna talk about the type in the logo, or just lame jokes on pissing and whatnot... my first impression is that the w overpowers the i’s\n\n"
    },
    {
      "time": " 29.Apr.2006 5.03am",
      "content": "First the logo: while at first I didn’t especially love it, especially the width and feeling of slowness (at least for me) of the W, I’m now growing to like it a bit more, especially when it’s compared to the [PS3](http://web.archive.org/web/20090514070520/http:/www.ps3rules.com/ps3-images/ps3-screenshots/ps3-logo.jpg) and [X360](http://web.archive.org/web/20090514070520/http:/www.eurogamer.net/assets/articles/a58844/a_med_allegedxbox360leakedlogo.jpg) logos. To me, the logo sets the console apart; there is such a difference between the more angular PS3 and X360 logos and this one that you can’t help but think that Nintendo’s system is different (for better of worse...).\n\nBriefly on the name: I actually don’t hate it. While of course the first thought that came to my mind was the bodily fluid (makes me feel very mature...), I think that the most important thing about it is that it’s distinct. While “Revolution” did communicate the essential idea about the system, it does blend together a bit too much with the other names...think about the potential mixup between “360” and “Revolution.” While Revolution wasn’t anywhere near bad, Nintendo really wants to set itself apart from the field, which is obvious if you take a look at the current concepts for the console.\n\nI also just found (I think via Gamespot, but I’m not sure) a [blog post](http://web.archive.org/web/20090514070520/http:/www.snarkhunting.com/2006/04/nintendo-wii-brilliant/#comments) that suggests that the whole “Wii” thing is a giant publicity stunt, a la “I love bees.” It makes a compelling point, but I feel like Nintendo wouldn’t have made such a strong point for it in their press release if it were just a hoax.\n\n"
    },
    {
      "time": " 1.May.2006 12.32pm",
      "content": "I’m curious as to whom the designers are... does anyone have an idea? The write up about the logo on the other sites mentioned is interesting... Wii as “we” and the “ii” viewed uniquely as two human forms or more so the new controllers developed for the “revolution.”\n\nI can’t say I’m all that enamored with the logo either, but I’ve seen much worse. It would have been interesting if they followed a more Web 2.0 approach to the name and kept all the points rounded (arial rounded?!)\n\n ![](http://web.archive.org/web/20090514070520im_/http:/typophile.com/files/wii_5856.gif)\n\n"
    },
    {
      "time": " 1.May.2006 7.16pm",
      "content": " **TYPOPHILE AT LAST!**\n\n_First time poster, here!_ I love type, don’t know much about it... I did subscribe the RSS and have been watching you go on about it, though, and “I’m lovin’ it!”™\n\nAbout wii... well, I must say I didn’t like the name at first — lets be honest, I rejected it immediately —, but now that I know the concept behind the idea, it is growing in me... so, the name is OK. In a bit of a strange way, it actually fits the product (though I think they could probably have taken a more serious approach to it). But I’d probably like it even better if they hadn’t come up with such a “toyish” looking logo... it also reminded me immediately of other things, so much that when I took a first glance at it, it didn’t even make me stop for a while –- as one of us does -– because I just thought it was an old “over and over again” logo from some wi-fi protocol or something like that. It surely doesn’t seem like a strong enough kind of image for such a risky kind of product. Have you seen it? It really is a shot at changing the way we play...\n\nThe logo actually makes me feel like we’ve been there and done that. Reminds me of Intel’s viiv, reminds me of Sony’s VAIO — the wave with the straight edges that is the W in wii and the VA in VAIO, mostly — and of their whole communication style, and also... I’m sure I’ve seen that same WI somewhere else but I just can’t quite put my finger on it... so it’s clear: they should probably take a bit of a walk on the wild side. The name doesn’t help with that, either.\n\nOn the other hand... maybe that’s their whole idea! They make it look like anything else and everything else so that we absorb it without even noticing! Hahaha! xD (not)\n\n_(I need to come up with an original signature)_\n\n"
    }
  ]
}
