{
  "id": "19559",
  "title": "Looking for Neutra Text",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Here is another one I am looking for. I cannot find Neutra Text, especially Demi is what I need. Another missing font. I don't understand why so many people submit art with no fonts, but I guess people forget...  \nIf anyone can tell me where I can find it, I would appreciate it.\n\n",
  "author": "<a href=\"/web/20120103164131/http://typophile.com/user/1899\" title=\"View user profile.\">misalion</a>",
  "time": "<br>",
  "uid": "1899",
  "comments": [
    {
      "time": "",
      "content": "_\\> [www.houseind.com/index.php?page=showfont&id=18&subpage=viewfonts](http://web.archive.org/web/20120103164131/http:/www.houseind.com/index.php?page=showfont&id=18&subpage=viewfonts)_\n\nDav\n\n"
    },
    {
      "time": "",
      "content": "[http://houseind.com/index.php?page=showfont&id=18](http://web.archive.org/web/20120103164131/http:/houseind.com/index.php?page=showfont&id=18 \"http://houseind.com/index.php?page=showfont&id=18\")\n\nThere you go!\n\nYou know, you can’t just send fonts to other people… one has to pay for ’em…\n\n"
    },
    {
      "time": "",
      "content": "You really should tell your people to turn the type to outlines. (although this isn't a good suggestion if it is paragraphs and paragraphs of text.) Otherwise, you cannot license one weight.\n\n[http://www.houseind.com/index.php?page=showfont&id=18](http://web.archive.org/web/20120103164131/http:/www.houseind.com/index.php?page=showfont&id=18 \"http://www.houseind.com/index.php?page=showfont&id=18\")\n\n"
    },
    {
      "time": "",
      "content": "Woohoo, One of the few 'Typophile Triple Posts'. :)\n\n"
    },
    {
      "time": "",
      "content": "Some fonts are licensed for more than one user - you need to check the EULA. I just bought one that's for 1-5 users.\n\nAnd - tell me if I'm wrong - if the client did purchase the font for that job, can't they send it to their designer? I had to sign something recently promising to delete a font from my system after I completed the job.\n\n"
    },
    {
      "time": "",
      "content": "Like minds...\n\n"
    },
    {
      "time": "",
      "content": "But, the users all have to be at the same physical location.\n\n"
    },
    {
      "time": "",
      "content": "So the client is \"supposed\" to purchase another license of the font for the freelance designers than for the in-house designers?\n\n"
    },
    {
      "time": "",
      "content": "Yeah. I know. Trust me, I hate EULAs. This is one of the many flaws in a EULA. Some foundries are changing with the times, some won't. Some foundries have special clauses which allow for copies to go to service bureaus, some don't.\n\nHouse allows embedding for the service bureau. Quote: \"Our base license does, however, allow you to embed fonts in a .pdf to be sent to a service bureau or printer.\"\n\nI'd suggest getting the designer to get a PDF made.\n\n"
    },
    {
      "time": "",
      "content": "O.k. Thank you all. We do ask all the customers to outline types, but because we have so many distributors and reps for our company we always receive things with font problems. And we have to manually trap jobs, so we do not use pdfs to print.  \nHere is my question: When I freelance and design catalogs and stuff, all printers ask fonts used, and I had no idea that they have to actually buy fonts used in some cases. Does this mean all the printers and service bureaus who wanted fonts with art (many people) might not have been right?\n\n"
    },
    {
      "time": "",
      "content": "Yep. Unfortunately. Very few foundries have any sort of clause which allows for giving the actual fonts to the service bureau. More and more, however, foundries are allowing embedding (mostly uneditable however) for service bureau.\n\n"
    },
    {
      "time": "",
      "content": "I'm sorry but this just begs piracy. If the client has to buy 3 separate licenses, one for themselves, one for their designer (moi) and one for the service bureau, how am I ever going to get them to pony up for a new font? The ultimate loser is the foundry, or the type designer, whose fonts are not getting purchased because of these ridiculous EULAs.\n\n"
    },
    {
      "time": "",
      "content": "Yeah, I know. Location is a thing of days gone by.\n\nPatty, are you freelancing for them at their offices?\n\n"
    },
    {
      "time": "",
      "content": "No, I work from home, on a per-project basis - book design. Have many clients, some of whom are willing to pay for new fonts (altho I've just been purchasing single licenses) and some not.\n\n"
    },
    {
      "time": "",
      "content": "\\> Woohoo, One of the few ‘Typophile Triple Posts’\n\nA [hat-trick](http://web.archive.org/web/20120103164131/http:/en.wikipedia.org/wiki/Hat-trick) !!!\n\n"
    },
    {
      "time": "",
      "content": "Patty:\n\nNot that I'm arguing for one side or the other as to what type foundries \"should\" do, but I'm not sure I understand the logic here. If the foundry did not require separate licensing, they wouldn't be seeing any money that way, either. How would not requiring people to license the font get more money for the type foundry?\n\nT\n\n"
    },
    {
      "time": "",
      "content": "I just think if the font is being used for a single job it's a lot to ask someone to pay for it three times. I will never get a client to do that (hard enough to get them to buy it once), so then, the foundry loses out on the sale. If the foundries were a little more flexible with their licenses they'd get more business from me. That said I have been blithely giving fonts to printers for years now without additional purchase of license, since I didn't know better.\n\nI'd suggest rather than separate licenses for different locations perhaps it should be on a per job basis. But since I rarely actually read the EULAs that may already be the case. Pardon my ignorance.\n\n"
    }
  ]
}
