{
  "id": "1957",
  "title": "Letter logo",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey everyone,   \n   \nA fellow student and I are creating a design studio freelance gig thing for a credit here. We came up with the name Letter Studio and now we're working on a logo. There are several issues we have come up with in regards to these designs.   \n   \nOur idea was to have the T also look like an 'H' to represent us, our last names being Helms and Heffron.. its also split into two halfs. Do the two t's on #3 look like ' F 's ? Is the nature of the top of the ' L' less comfortable as far as readability?   \n   \n   \nThanks for any comments.   \n ![logo](http://web.archive.org/web/20131019074435im_/http:/www.typophile.com/forums/messages/4100/19852.gif)\n\n",
  "author": "drewheffron",
  "time": "5 Nov 2003 — 6:56pm",
  "uid": "2403",
  "comments": [
    {
      "time": "5 Nov 2003 — 8:53pm",
      "content": "I don't see an \"H\". I'd join the two bars - it'll still read \"letter\".   \nBut I don't get the \"r\".   \n   \nhhp\n\n"
    },
    {
      "time": "5 Nov 2003 — 11:42pm",
      "content": "Yeah, what he said. what is up with your \"r\"? you   \nmight want to try and regulate your x-height. It jumps   \naround too much. It looks like there are 4 different   \nglyphs.\n\n"
    },
    {
      "time": "6 Nov 2003 — 5:21am",
      "content": "Join the t's and change the tint of the t's to contrast with the other letters or it will never work as an H. I agree with Hrant and Kris the r comes out of left field. Dan\n\n"
    },
    {
      "time": "6 Nov 2003 — 8:50am",
      "content": "Thanks for the comments everyone!   \n   \n ![letter 2](http://web.archive.org/web/20131019074435im_/http:/www.typophile.com/forums/messages/4100/19911.gif)   \n   \nDo the two t's look too much like an H when joined? We want the 'h' to be more subtle.. I dont know. Yeah the 'r' really doesnt flow right to me.. I think I'm heading in the right direction.   \nDrew\n\n"
    },
    {
      "time": "6 Nov 2003 — 9:14am",
      "content": "Drew you have the nice round caps on your l and t's why abandon it on your r? Dan\n\n"
    },
    {
      "time": "6 Nov 2003 — 9:17am",
      "content": "The \"H\" is plenty subtle in the joined one, don't worry.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Nov 2003 — 2:11pm",
      "content": "Drew.   \n   \nYour getting lots of suggestions. Here's a few more:   \nTry that curve on the inside of the e's - top round, bottom flat. Then try using that curve to form the r (flat on bottom, curved on top).   \n   \nBTW, all those nice little slits are going to close up at small size. You're probably better off just closing them up. Your letterforms will be unique enough without it. (if you choose to try this, you can still do the curve suggestion above, just overlap a tiny bit.)   \n   \nRandy\n\n"
    },
    {
      "time": "7 Nov 2003 — 9:21am",
      "content": "Thanks alot of the suggestions guys.   \nI can see how all these important issues with my logo that you guys are bringing up goes right back to my typography class i'm in right now..   \n   \nDaniel - Good point, I was actually trying that because the typeface was orginally like that.. but then i realised that using that would not only look bad, but wouldn't represent my ideas for the design.   \n   \nHrant - I understand what Randy is saying, that at a small size it isnt really noticible. Maybe I've just been looking at it too long, but doesnt it seem akward joined? The rest of the letters have this rythmic space inbetween them and then one large glyph without a space looks weird. I guess if I join them all together it woudnt look bad.   \n   \n   \nTiffany - Thanks for your suggestion. Do you think flipping it would create the same problem in my first designs.. that it would look like two tottaly differnt characters.. an 'f' and a 't'?   \n   \nRandy.. good point, I didnt think about the size thing with the gaps. But the 'R' .. your right on the money. I didn't even consider that. I mean, I know that it looked off, but I wasnt sure why. Making it more similar to the counter space of the 'E' has made the design more cohesive I feel.   \n   \nI'm trying to figure out what else I could do to this. Perhaps back to the drawing board. This forum is a great tool and is helping me learn alot about typography and design in general.. I just don't want it to seem like I'm coming here for someone to hold my hand and make the design for me, you know? Albeit, these suggestions are very helpful and have definately improved the design. I guess, as long as I understand why it makes the design more effective.   \n   \nThanks again everyone   \n   \nDrew   \n  ![letter 3](http://web.archive.org/web/20131019074435im_/http:/www.typophile.com/forums/messages/4100/20014.gif)\n\n"
    },
    {
      "time": "7 Nov 2003 — 9:28am",
      "content": "haha! Whoops, I forgot to take out a little bit of whiteout....\n\n"
    },
    {
      "time": "7 Nov 2003 — 10:43am",
      "content": "Of this batch, bottom is best.   \n   \nOk, looking at the 2 t's:   \nThe spacing is bad. Check the space between et vs. te vs. tt, they should visually the same, and all should be tighter to jive with the le and er spacing.   \n   \nThe x-height seems too close to the ascender height. Seems like you have 2 choices: 1) raise up the L and the TT, and 2) lower them both to x-height, ok and 3) raise the L, but lower the TT. (maybe best?)   \n   \nHard to tell from the gif, but double check to make sure the L isn't below the baseline.   \n   \nRandy\n\n"
    },
    {
      "time": "16 Dec 2003 — 5:45pm",
      "content": "how about this?   \n   \n   \n ![](http://web.archive.org/web/20131019074435im_/http:/www.typophile.com/forums/messages/4100/22533.gif)\n\n"
    },
    {
      "time": "6 Nov 2003 — 9:23am",
      "content": "Drew, this last sample you posted, second one down ... try moving the t's a bit closer (not touching) but flip the second one horizontally so the curves both point inward. Maybe the eye will catch onto the curves and follow them downward completely the H??   \n   \nI agree that the r seems odd.\n\n"
    }
  ]
}
