{
  "id": "19589",
  "title": "Suggestions for Corporate Newspaper Redesign",
  "forum": "Design",
  "tags": [

  ],
  "content": "hello typophiles\n\nat work we are redesigning the corporate newspaper of a very big global company, active in the medical sector.\n\nat the moment, they use the official CD-fonts, namely Minion for text and minion condensed for headlines and Berthold Imago for subheads, and captions and infoboxes.\n\nneeded:  \n- two typefaces that get then used for headline and body copy, infoboxes and captions. normal, bold and italic, the fonts need char-sets for spanish, german, french and english.  \n- a sans and a serif that work together  \n- typefaces that dont use too much space (the layout has 5 columns, the papersize is only A3)  \n- style: classic but modern, timeless, not trendy and not too playful (no vista, for example :))\n\ndo you have any ideas or thoughts? any help would be greatly appreciated!\n\n [‹ Pratt/SCAD Grad programs?](http://web.archive.org/web/20080216132853/http:/typophile.com/node/19686 \"Go to previous forum topic\") [Typeface for female photographer ›](http://web.archive.org/web/20080216132853/http:/typophile.com/node/19671 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080216132853/http://typophile.com/user/7345\" title=\"View user profile.\">thierry blancpain</a>",
  "time": "<br>",
  "uid": "7345",
  "comments": [
    {
      "time": " 28.Apr.2006 12.50pm",
      "content": "I’m not the man, but I find it odd no one has jumped on this.\n\nTo start, classic and timeless things can be found at [Storm Type.](http://web.archive.org/web/20080216132853/http:/www.stormtype.com/index.php)\n\n"
    },
    {
      "time": " 28.Apr.2006 1.44pm",
      "content": "[Worldwide](http://web.archive.org/web/20080216132853/http:/www.myfonts.com/fonts/shinn/worldwide/) and [Brown.](http://web.archive.org/web/20080216132853/http:/www.myfonts.com/fonts/shinn/brown/)\n\nSemi-condensed, matched sans and serif, with text and display styles.\n\nPlease feel free to contact me for further information, such as specimens on newsprint.\n\n"
    },
    {
      "time": " 28.Apr.2006 2.01pm",
      "content": "Nick - I don’t know where else to insert this comment, but I had never really looked at your fonts before. I love the playful feel of several of them. I love Preface and Artefact. To me Brown even has a playful feel. It seemed you could also make an extra light for the set.\n\nWe now return to your regular programming...\n\n"
    },
    {
      "time": " 29.Apr.2006 1.59pm",
      "content": "fontplayer: funnily enough, stormtype was the first website i suggested to my coworker (who does the job, i just asked for him).\n\nnick: thanks!\n\nany others? i was so sure that this thread would overflow from suggestions :)\n\n"
    },
    {
      "time": " 29.Apr.2006 4.07pm",
      "content": "OurType’s Fresco Plus looks good.\n\n"
    },
    {
      "time": " 2.May.2006 1.13am",
      "content": "yes, fresco looks great, thanks for that one.\n\nany other ideas? thank you in advance.\n\n"
    },
    {
      "time": " 2.May.2006 8.06am",
      "content": "lol shameless nick.\n\n"
    },
    {
      "time": " 2.May.2006 9.22am",
      "content": "_shameless_\n\nMany regular Typophile contributors suggest their own faces where appropriate.  \nNothing to be ashamed of.\n\n"
    },
    {
      "time": " 2.May.2006 12.08pm",
      "content": "Many regular typophile contributors tease when appropriate\n\n"
    },
    {
      "time": " 2.May.2006 12.27pm",
      "content": "<cite>lol shameless nick.</cite>\n\nIt’s not exactly like there are an overwhelming number of other suggestions.\n\n"
    },
    {
      "time": " 2.May.2006 1.41pm",
      "content": "yes, and im frustrated! :)\n\nnicks suggestion was ok, brown is nice (and got good comments at the office), but worldwide doesnt suit what they are looking for. we’ll see.\n\n"
    },
    {
      "time": " 2.May.2006 1.54pm",
      "content": "well what are they looking for? it seemed to me that worldwide fitted the bill, so spill the beans ;)\n\n"
    },
    {
      "time": " 2.May.2006 2.27pm",
      "content": "hmm, its hard to find the right adjectives. maybe less classy? think of weekly sunday newspapers, lots of pictures and some color thrown in here and there, but still with a strong corporate look.\n\nthe concept isnt finished and im not really involved, and i dont know how much im allowed to talk about it (but my coworkers know that i asked here).\n\n"
    },
    {
      "time": " 2.May.2006 3.09pm",
      "content": "Jim Parkinson might have something.  \nTypedesign.com\n\n"
    },
    {
      "time": " 2.May.2006 3.39pm",
      "content": "nice typefaces, but (without knowing where he comes from) too american and not modern and corporate enough.\n\n"
    },
    {
      "time": " 2.May.2006 4.34pm",
      "content": "Kesh, have you looked at Gerard Unger’s typefaces? [Big Vesta](http://web.archive.org/web/20080216132853/http:/www.gerardunger.com/fontstore/store-bigvesta.html) and [Capitolium](http://web.archive.org/web/20080216132853/http:/www.gerardunger.com/fontstore/store-capitolium.html) could work within your contraints, IMHO.\n\n"
    },
    {
      "time": " 3.May.2006 1.59am",
      "content": "they are very nice. i like capitolium, but i think esp. the italics are too playful (look at the Q for example). (but no, i havent thought of unger before.. thanks).\n\n"
    }
  ]
}
