{
  "id": "19610",
  "title": "Justification of ligatures in InDesign",
  "forum": "Build",
  "tags": [

  ],
  "content": "I am setting text with an OpenType font, using ligatures in InDesign CS2.  \nTo get a better justification I allow ca. 2% letter spacing, using the justification palette.  \nThis results in a small consistency problem, if you are real picky about your text.  \nSome words are now using ligatures, others are not (when the words are letter spaced by the justification engine).  \nCan you think of a smart solution to allow letter spacing on all text except the ligatures?\n\nThanks  \nJonas\n\n [‹ Opentype Random Contextual Alternates](http://web.archive.org/web/20071010112741/http:/typophile.com/node/19625 \"Go to previous forum topic\") [Can I avoid that CE fonts are translated in InDesign? ›](http://web.archive.org/web/20071010112741/http:/typophile.com/node/19547 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071010112741/http://typophile.com/user/12710\" title=\"View user profile.\">jmouritsen</a>",
  "time": "<br>",
  "uid": "12710",
  "comments": [
    {
      "time": " 29.Apr.2006 5.15am",
      "content": "Don’t do it!\n\nI t &nbsp; w o u l d &nbsp; l o o k &nbsp; j u st &nbsp; p l a i n &nbsp; st u p i d !\n\nWouldn’t it?\n\nMaybe it would be best not to letterspace at all? Is it a narrow column? Have you considered ragging?\n\n"
    },
    {
      "time": " 29.Apr.2006 9.31am",
      "content": "The only solution I can think of right now is to completely turn off ligatures, in order to make things more consistent.\n\n"
    },
    {
      "time": " 29.Apr.2006 9.55am",
      "content": "But maybe in a future version of InDesign, the threshold for turning off ligatures could be set a bit higher? (Though this doesn’t help you with your problem now.)\n\n"
    },
    {
      "time": " 29.Apr.2006 7.20pm",
      "content": "The threshold for turning off ligatures is reasonably high already. We tried to set it to a level where, for a typical text face, it would look bad to still have a ligature.\n\nT\n\n"
    },
    {
      "time": " 29.Apr.2006 9.27pm",
      "content": "It seems to me that you should either use ligatures or don’t use ligatures. If you are setting text that requires spacing which disallows the use of ligatures in some instances, you should turn off ligatures for the entire text. The appearance of ligatures will, IMHO, be too random.\n\n"
    },
    {
      "time": " 29.Apr.2006 10.44pm",
      "content": "<cite>The threshold for turning off ligatures is reasonably high already. We tried to set it to a level where, for a typical text face, it would look bad to still have a ligature.</cite>\n\n15 units seems to be the threshold as regards spacing as defined e.g. in the character palette.  \nCan it be that the glyph spacing %-value in the justification settings (with minimum, optimum, maximum) has its own threshold? By the way — % of what? With a typeface I tested, ligature substitution was switched off at 0.7% glyph spacing allowed in the justification settings.\n\nKarsten\n\n"
    }
  ]
}
