{
  "id": "19639",
  "title": "!! Little Hills - Feedback Needed !!",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Any feedback on my new font design would be greatly appreciated. Please see the attachment. Thanks!\n\n| Attachment | Size |\n| --- | --- |\n| [Little Hills.jpg](http://web.archive.org/web/20150417121506/http:/typophile.com/files/Little%20Hills.jpg) | 176.52 KB |\n\n",
  "author": "jimsbee",
  "time": "1 May 2006 — 6:49pm",
  "uid": "12496",
  "comments": [
    {
      "time": "1 May 2006 — 7:22pm",
      "content": "I love the rounded tops. Very nice.\n\n"
    },
    {
      "time": "1 May 2006 — 7:58pm",
      "content": "Hi Jimsbee,\n\nTook a quick peek.....fun face.....I visualize it used in woodburning boutique shop signs or something like that.....it has that rustic feel.\n\nLetterform thoughts:\n\nDo you really want to make such an idiosyncratic statement with 'C' and 'G'? All the other letters are very stable and freestanding, but these lean backward.......there's plenty of character in these letterforms as is, or at least I think so!\n\nIt reminds me of Agfa Rotis in this respect....I have always been critical of that face because the lowercase 'e' and 'c' look so out-of-place with the rest of the characters. There isn't the same instability hinted at in any of the other letterforms.....\n\nIf you're sold on the 'C' and 'G', you might want then to revisit the other rounded letterforms like 'O' and 'Q' to see if they too should become less vertical in their slant.\n\nMore about the 'Q': The tail looks perhaps too \"tacked-on\" to me. It only intersects the main stroke at one point instead of overlapping a bit....the body of the 'Q' is identical to the 'O', and since both are so vertical but the tail of the 'Q' is naturally shifted to the right, it makes the 'Q' look a little backward-leaning to me as well...\n\nOh, and one more quick thing: I see that the top of the 'S' responds to the raised bars of the 'A' and 'H', but the narrowness of the upper aperture still seems smallish compared to say the attitude of the 'G' aperture. That makes the 'S' appear to tilt away from the viewer in perspective to me....\n\nNice work - Cheers!\n\n"
    }
  ]
}
