{
  "id": "19648",
  "title": "Victorian(?) style logo for small web/dtp business",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Heya all,\n\nI'de love all your criticism/advice on development of this logo.\n\n\"Eight Three Nine\" is a small DTP business that predominantly typesets display ads for Melbourne's \"The Age\" Newspaper. At the minute, the website is horrible! It looks like something from the dot com era. It was set up over-night (as was the business, which was orignially 'something on the side').\n\nThe business is going well, and with a view to have it as my only income i'de like to overhaul the whole thing.\n\nAt this stage, i've kept it mono, colour to come later. (colour will be really important in the end, but right now i'm looking at concept)  \nText is Minion Bold Condensed (small caps).\n\nI'm trying to capture that 'old book' feel, you know, with the classic old text-faces and ornamentation etc.\n\nI'm not sure that Minion is a good choice of face. Maybe i need something a bit more rustic? any suggestions?\n\nOrnaments 'can' look great, but I dont want it to be pretty or prissy. Something is'nt right, it just looks a bit too nice/lovely/feminine(?). Not really fitting for a business i dont think.\n\nNot sure exactly what direction to head next. Stay with this concept, or perhaps a whole new direction?\n\nI could easily do the really clean website with the latest trendy typeface, but thats exactly what i'm trying to avoid. I dont want to just copy the latest thing. It would be great to see what i think is a good idea through to completion. But right now i'm struggling! Any help greatly appreciated.\n\nCheers!\n\n| Attachment | Size |\n| --- | --- |\n| [proof\\_logo\\_001.gif](http://web.archive.org/web/20120225224826/http:/typophile.com/files/proof_logo_001.gif) | 5.49 KB |\n\n",
  "author": "<a href=\"/web/20120225224826/http://typophile.com/user/11331\" title=\"View user profile.\">JonnySchneider</a>",
  "time": "<br>",
  "uid": "11331",
  "comments": [
    {
      "time": "",
      "content": "Try sone of the Lanston type at P22.\n\nI've always wanted to use Pabst in something.  \n [http://www.p22.com/lanston/products/pabst.html](http://web.archive.org/web/20120225224826/http:/www.p22.com/lanston/products/pabst.html \"http://www.p22.com/lanston/products/pabst.html\")\n\n"
    },
    {
      "time": "",
      "content": "Or you could look at this kind of thing  \n [http://www.myfonts.com/fonts/canadatype/treasury/](http://web.archive.org/web/20120225224826/http:/www.myfonts.com/fonts/canadatype/treasury/ \"http://www.myfonts.com/fonts/canadatype/treasury/\")\n\n[http://www.myfonts.com/fonts/linotype/academy-engraved/](http://web.archive.org/web/20120225224826/http:/www.myfonts.com/fonts/linotype/academy-engraved/ \"http://www.myfonts.com/fonts/linotype/academy-engraved/\")\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Cheers Jupiterboy - Pabst looks really good. I think it will work well. Although it looks like i'll have to drop the small-caps, but thats okay, its probably a bit overdone anyway. Pabst's lanky Caps and small x-height lower cases look really elegant.\n\nSome of the ornament style already comes from Lanston's Granjon Fleurons. I like Lanston!\n\nI'm still a bit concerned its going to look a bit twee though. might end up looking like a brass fitting on the outside of a Victorian cottage, which is not really what i'm looking for.\n\nThe rest of the design will become really important if this is to work. At the moment, i'm thinking of the sort of style seen in old scientific journals, probably around the 40's and 50's in America.  \nMaybe i'd be better off cutting the ornaments down to just a few fleurons and using something bookier, maybe Lanston's Kennerley? [http://www.p22.com/lanston/products/kennerley.html](http://web.archive.org/web/20120225224826/http:/www.p22.com/lanston/products/kennerley.html \"http://www.p22.com/lanston/products/kennerley.html\")\n\nWhat do you think?\n\n"
    },
    {
      "time": "",
      "content": "I love Kennerley. Is it OT yet?\n\n"
    },
    {
      "time": "",
      "content": "yep ;)\n\n"
    }
  ]
}
