{
  "id": "19656",
  "title": "Equations--\\>Drawings--\\>Glyphs?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm wondering if there's a simple method for plotting equations into a drawing program (doesn't matter which), and then producing glyphs from that. For instance, I like the \" [egg curve](http://web.archive.org/web/20150302160322/http:/www.mathematische-basteleien.de/eggcurves.htm),\" but I can't see an easy way to move from the equations to the glyphs. I don't exactly want to learn Postscript.\n\n",
  "author": "jlg4104",
  "time": "2 May 2006 — 4:58am",
  "uid": "11098",
  "comments": [
    {
      "time": "2 May 2006 — 7:05am",
      "content": "You can use gnuplot, which is available for free on most operating systems, to output EPS graphics from nearly any well-behaved 2D or 3D function. On newer versions of OS X, there's a \"Grapher\" application that can also export to EPS or PDF. Most interactive Font editing programs should be able to somehow deal with those formats.\n\nBut be careful, mathematical functions seldom make for good glyphs, and in my opinion their overuse has given mathematical or parametric font creation tools such as METAFONT an undeserved bad reputation.\n\n"
    },
    {
      "time": "2 May 2006 — 10:29am",
      "content": "Thanks, Tim. I'm interested mainly in using the equations as a starting point for creating shapes. I've got nothing against free drawing, messing with Bezier curves, etc.\n\nI actually got interested in the idea of using equations when I started pencil-sketching some glyphs based on my own print handwriting-- the same egg-like shape kept occurring over and over, and I thought there oughta be a way to define it precisely and then reproduce as starting point.\n\n"
    },
    {
      "time": "3 May 2006 — 2:03pm",
      "content": "That's just what I had in mind. I'm actually very much interested in using mathematical formulae for encoding design intentions instead of endless twiddling with control points. If you're familiar with Knuth's Computer Modern fonts, you'll be aware that they are often criticized for - among other things - being to formulaic; and rightly so. My point is that this is more the fault of the authors attitude and the temptation of the tools than the idea itself, but the temptation seems very real!\n\n"
    }
  ]
}
