{
  "id": "19651",
  "title": "(x) UC DRESS - Univers 49 Light Ultra Condensed {Geoff}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi.\n\nI’m found in need of your help once more.\n\nI’ve been trying to id this font, but I can’t seem to find the right match for it, anyone who can please help?\n\nI have also asked previously at WhatTheFont and was pointed to [Univers LT 49 Light Ultra Condensed](http://web.archive.org/web/20071222005022/http:/www.myfonts.com/fonts/linotype/univers-lt/49-light-ultra-condensed/).\n\nAnd as I replied there too, indeed I also had gone through Univers. But some doubt remained (and remains) especially due to the counters of both the “D” and “R” (which seem not as wide, even comparatively to the width of the lines) and also the space between the vertical strokes of the “U” (which also seems to be not as wide as in Univers)... (Only hope I’m not talking nonsense with this what I’m saying?...)\n\nThus I’d truly appreciate also your views over it please and thank you so much already for any further enlightenment.\n\n ![](http://web.archive.org/web/20071222005022im_/http:/typophile.com/files/uc-dress-ls_4706.jpg)\n\n [‹ (x) Agostino invitation classical capitals - Delphian Open {Patricia}](http://web.archive.org/web/20071222005022/http:/typophile.com/node/19597 \"Go to previous forum topic\") [(x) Tippmann logo - Aachen {Tiff, Patricia} ›](http://web.archive.org/web/20071222005022/http:/typophile.com/node/19701 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071222005022/http://typophile.com/user/12617\" title=\"View user profile.\">sweepi</a>",
  "time": "<br>",
  "uid": "12617",
  "comments": [
    {
      "time": " 2.May.2006 4.09am",
      "content": "Hmmm, it appears to be Univers 49 Light Ultra Condensed. I think the drop shadow is creating the illusion of narrower counter in D.\n\n"
    },
    {
      "time": " 2.May.2006 1.55pm",
      "content": "Thank you, Geoff Riding, for your reply. :-)\n\nMeanwhile I have tried it out, to superimpose Univers 49 Light Ultra Condensed over the original (I have tried with 3 different consecutive sizes, 120, 121 and 122), and it feels like it still doesn’t match 100% with it?... (Or do you think that perhaps the non-100%-match may result from something like the printing of the original or maybe something else?... Or perhaps my attempt to superimpose one type to the other wasn’t done in such a correct way?...)\n\n(And again, pardon all of my ignorance... Which is in the end also the reason I wonder about and ask... :-))\n\n ![](http://web.archive.org/web/20071222005022im_/http:/typophile.com/files/uc-dress-ls-3_5660.jpg)\n\n"
    },
    {
      "time": " 3.May.2006 1.31pm",
      "content": "In the end so it was Univers Light Ultra Condensed all along... Thank you again for the confirmation. :-)\n\n"
    }
  ]
}
