{
  "id": "19679",
  "title": "Village: Too much happening for just a headline!",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20071227160343/http:/typophile.com/user/108 \"View user profile.\") : 2.May.2006 2.50pm \n\n/ / / / /\n\nHi!  \nHappy May Day from an island off the coast of America.\n\nThere’s a lot happening, so we’ll get right to it...\n\n/ / / / /\n\nOdile by Sibylle Hagmann is released!\n\nThis extraordinary new serif type family is Sibylle Hagmann’s first release on her own foundry. (You may be familiar with her Cholla family, published by Emigre.) The type is inspired by a W.A.Dwiggins design from the 1930s, but the design is completely contemporary. The family consists of two weights in roman and italic, along with two sets of initial capitals, the unique Upright Italic, and a set of beautiful Ornaments. (Even before its release, Odile was one the 18 winners of the Swiss Federal Design Competition for 2005.)\n\nUse the mudTyper to try the fonts out, and be sure to view the extended glyph tables for the types.\n\nOdile is shipped in OpenType and legacy PST1 formats; the OpenType fonts support dozens of languages, and include small caps (in the lighter weight), 6 numeral sets, and a collection of standard and discretionary ligatures.\n\n[http://vllg.com/Kontour/Odile/mudTyper+Weights/](http://web.archive.org/web/20071227160343/http:/vllg.com/Kontour/Odile/mudTyper+Weights/ \"http://vllg.com/Kontour/Odile/mudTyper+Weights/\")\n\n/ / / / /\n\nKLIM is the 11th member of the Village co-op!\n\nThe great young New Zealander Kris Sowersby - aka KLIM - is the newest member of our group. His work has its roots in history, but his work is entirely 21st-century. Stay tuned to his page for a preview of Feijoa, which will be the first KLIM type family to be published.\n\n[http://vllg.com/KLIM/](http://web.archive.org/web/20071227160343/http:/vllg.com/KLIM/ \"http://vllg.com/KLIM/\")\n\n/ / / / /\n\nAn offer you can’t refuse?\n\nTo celebrate the arrival of Spring, we are offering a selection of recent display fonts: 5 type families from 5 foundries.\n\nSpring 2006 Display set:  \n/ Bello Pro from Underware (Connecting script with OpenType ligatures and small caps)  \n/ Garda from Feliciano Type Foundry (3 variants of classic capitals)  \n/ Kaas by Hugo d’Alte for Thirstype (Silver prize in Finland’s Grafia competition!)  \n/ Local Gothic from Orange Italic (with revolutionary OpenType randomization)  \n/ Mavis from Village (2 variants with subtle alternate-replacement)\n\nGet these five families for only $229, one-third off the combined price of $353. Offer available through July 31, 2006.\n\n[http://vllg.com/offers.php](http://web.archive.org/web/20071227160343/http:/vllg.com/offers.php \"http://vllg.com/offers.php\")\n\n/ / / / /\n\nWith warm wishes from New York.\n\nVillage  \n168 Second Avenue #253  \nNew York NY 10003  \nUSA\n\ntelephone ++1 646 654 1506  \nfax ++1 646 429 8597\n\n[http://vllg.com/](http://web.archive.org/web/20071227160343/http:/vllg.com/ \"http://vllg.com/\") / / / / / / / / / / / / / / / / / / / / / /\n\n",
  "author": "<a href=\"http://web.archive.org/web/20071227160343/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 2.May.2006 2.50pm",
  "uid": "108",
  "comments": [

  ]
}
