{
  "id": "19672",
  "title": "Typeface Suggestions",
  "forum": "Design",
  "tags": [

  ],
  "content": "If I can start off by asking a question regarding type used in magazines. If a certain typeface is used for a masthead, should it be reused for all other headers and title pages within the magazine, but like in differnet fonts such as bold, condensed etc? Add to that, should the same typeface be used throughout the whole magazine (for headers, title pages, body copy etc) or should they vary depending on the article subject?\n\nAnyway, I would be thankful if you could give out a few suggestions for a typeface/s to be used for a food magazine. Masthead, title pages, body copy etc. I’m hoping to achieve a modern/in-style comtemporary look with the magazine, and would like the type to really help it shine. The photography will also be nicely done.\n\nIt’s for a student project, and so any help/advice given would be much appreciated. Thanks.\n\n [‹ Sans st ligatures?](http://web.archive.org/web/20071227160337/http:/typophile.com/node/13838 \"Go to previous forum topic\") [Need to couple ff Meta with a subhead-like font that has just a bit more beauty. ›](http://web.archive.org/web/20071227160337/http:/typophile.com/node/19716 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071227160337/http://typophile.com/user/5453\" title=\"View user profile.\">stupid_child</a>",
  "time": "<br>",
  "uid": "5453",
  "comments": [
    {
      "time": " 2.May.2006 12.06pm",
      "content": "In my opinion The masterhead should a unique piece... treated pretty much like a logotype. Also I would never use the same typeface for both headlines and body copy. Better then to pick some typeface suited best for its purpose. That would give an optimal use and display of both typefaces, I think. Some suggestions:\n\nHeadlines: SOPHISTO - STALEMATE - LUMINANCE - REMONTOIRE - OXTAIL\n\nBody copy: DELICATO - ANZIANO - TAROCCO\n\nSee for yourself; [http://www.macrhino.com](http://web.archive.org/web/20071227160337/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\nGood luck!\n\n"
    },
    {
      "time": " 2.May.2006 4.08pm",
      "content": "Rotis and all its many varitions are good used with each other. Also many of typefaces from Hoefler & Frere Jones are really good choices- too many select. Trade gothic or news gothic used with Rotis\n\n"
    },
    {
      "time": " 2.May.2006 6.45pm",
      "content": "_If a certain typeface is used for a masthead, should it be reused for all other headers and title pages within the magazine, but like in differnet fonts such as bold, condensed etc? Add to that, should the same typeface be used throughout the whole magazine (for headers, title pages, body copy etc) or should they vary depending on the article subject?_\n\nHi, s\\_c, and welcome to the forums. I don’t think that there are any “right” or “wrong” answers to your first two questions... I’m sure that there are (or have been, or will be!) real-life examples of the different options you are asking about... These are design decisions, and they in turn should be informed by your research and documentation on other magazines, not to mention trying different things out for yourself to see what works for you, etc. For example, take some dummy text and make a spread for your proposed magazine, using the same face for everything, then duplicate it and try varying the weights, or the fonts... Print everything out and compare the results...\n\n"
    },
    {
      "time": " 4.May.2006 4.55am",
      "content": "Thanks for your replies guys, and I’m liking the LUMINANCE typeface quite a lot.\n\nAgain, if anyone else has any suggestions or advice, I’d be much appreciative to hear it.\n\n"
    }
  ]
}
