{
  "id": "19690",
  "title": "opinions on akkurat",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hello\n\nim looking for opinions on [akkurat](http://web.archive.org/web/20150225214635/http:/www.lineto.com/The+Fonts/Categories/Text+Fonts/Akkurat/), esp. its use for text - i know, there are more suitable faces for longer texts, but i rather think of short paragraphs of text, its use in short letters, etc.\n\nhows the quality of \"craftsmanship\" in akkurat? after all, it would eat nearly half my month income, so i dont wanna spill out that money for \"nothing\".\n\n",
  "author": "thierry blancpain",
  "time": "3 May 2006 — 5:26am",
  "uid": "7345",
  "comments": [
    {
      "time": "3 May 2006 — 5:53am",
      "content": "I remember seeing a lot of print materials surrounding the Frische Schriften Exhbition in Zürich in 2004 that were printed in Akkurat. I have never had the pleasure of using it myself, but I've always held the design in high regard.\n\n"
    },
    {
      "time": "3 May 2006 — 5:59am",
      "content": "Well, I'm certainly not an admirer of Helvetica in the first place, but why spend more than $400 for a typeface with only six weights when it looks like a copy of ... HELVETICA. There are so many other options for better looking Sans serifs. The second best option would be to buy a bunch of adobe Helvetica Nuew and at least save you some money for other fun things!\n\nPlease note that this is a very personal opinon, and secondly no offence towards Lineto, I just think the prices are out of range...\n\n"
    },
    {
      "time": "3 May 2006 — 6:08am",
      "content": "I'll have to agree with Stefan, the prices are a bit over the top. I had to see for myself and transferred the swiss currency into Australian dollars and it came out at $550.00 AUD for only 6 weights. For comparsion, I'm planning to purchase Storm Open Library which has 12 type FAMILIES for $651.00 AUD!\n\nPrice aside, I do like the face, it seems to have a mix of some features from Akzidenz-Grotesk, Helvetica with a \"gothic\" g.\n\n"
    },
    {
      "time": "3 May 2006 — 7:05am",
      "content": "Agree, it is a lot to pay for three weights (+ italics/obliques) and a double storey g.  \nTim\n\n"
    },
    {
      "time": "3 May 2006 — 7:06am",
      "content": "I've been using lots of Akkurat for the last year, since it had already been specified as the primary type for a client of mine. I actually think it's a lovely design, with more personality than Helvetica. It has a certain crisp, clean feel to it, but doesn't feel nearly as cold and precise as Helvetica, IMHO.\n\nIt works pretty well as text in short bursts, although I find it the regular weight a little heavy for most text uses. The light weight works well, and has nice contrast when mixed with the bold. The spacing overall feels pretty good, although I tend to tighten it up a little bit for text use.\n\nFor the moment I still have a couple of sample postcards you can look at for an idea of how it works as text versus display:\n\n[http://transfer.ultrasparky.org/ps122/postcards/Danceoff\\_postcard.pdf](http://web.archive.org/web/20150225214635/http:/transfer.ultrasparky.org/ps122/postcards/Danceoff_postcard.pdf \"http://transfer.ultrasparky.org/ps122/postcards/Danceoff\\_postcard.pdf\")\n\n[http://transfer.ultrasparky.org/ps122/postcards/Hell\\_postcard.pdf](http://web.archive.org/web/20150225214635/http:/transfer.ultrasparky.org/ps122/postcards/Hell_postcard.pdf \"http://transfer.ultrasparky.org/ps122/postcards/Hell\\_postcard.pdf\")\n\n"
    },
    {
      "time": "3 May 2006 — 8:42am",
      "content": "Nice work, ultrasparky.\n\nMore discussion of Akkurat here: [http://typographi.com/000836.php](http://web.archive.org/web/20150225214635/http:/typographi.com/000836.php \"http://typographi.com/000836.php\")\n\n"
    },
    {
      "time": "3 May 2006 — 11:41am",
      "content": "Why thank you, Mr. Coles! Very nice of you to say so.\n\n"
    },
    {
      "time": "18 May 2006 — 2:58am",
      "content": "excuse my longer absence from this discussion, i havent forgotten about it and am thankful for the responses!\n\nyes, it isnt exactly cheap, but i think here i profit from living (and earning money) in switzerland. i earn about twice the price of akkurat as an intern every month.\n\nhelvetica neue instead of akkurat isnt an option, helvetica is the reason why i am even thinking about buying akkurat! i want a sans for everyday use for myself and possibly a client. it has a different character than helvetica, and i personaly think thats worth the money.\n\nthank you for your opinions!\n\n"
    }
  ]
}
