{
  "id": "19724",
  "title": "I love a deal, You love a deal, We all love a deal...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I don't know about you but I love a deal! So when I happen to snatch up a font that is...\n\nA) Gorgeous - well crafted, excellent attention to detail technically and aesthetically\n\nB) Extensive - character sets that rock your little typographic socks- we're talking ornaments, swashes, ligatures, and enough alternates to make your mouse spin\n\nC) Cheap- hello! under a hundred clams- thankyouverymuch!\n\nI flip-out with glee!!! I recently purchased Adobe Poetica and this font is love-li-si-mo. (yes I know- I'm late) Its elegant, its classic, light and feminine. Hello! its by Robert Slimbach. It has so many typographic extras. 11 stylistic alternates, beginnings, endings, and my favorite are these juicey swashes under the \"Alternate Latin small capitals\" subheading in the Adobe specimen sheets. Notice the capitals 'N' and the 'X'. Don't you just LOVE that?! Oh and another thing... in the book we all have \" The Elements of Typographic Style\" the author states Poetica pairs nicely with Minion- another genius typeface by Mr. Slimbach. So even though you can't use it everywhere, its versatility is empowering in your chosen application.\n\nAnd you wanna know the best part? ITS ONLY $29 SMACKERS!!! You can't beat that fo' nuthin. Its OpenType too so you get all this typographic goodness automatically.\n\nHere is the link so you can geek out about it too:  \n [http://store.adobe.com/type/browser/pdfs/POEQ/PoeticaStd.pdf](http://web.archive.org/web/20120207111435/http:/store.adobe.com/type/browser/pdfs/POEQ/PoeticaStd.pdf \"http://store.adobe.com/type/browser/pdfs/POEQ/PoeticaStd.pdf\")\n\nAnyhow you heard me blab about my sweet little purchase so I would like to hear from you. Tell me about the fonts that you bought that didn't cost a lot of money (relatively), came loaded with many features, and were of course- gorgeous. Many fonts are not even close to $29 mark like my Poetica so you can mention significantly more expensive faces- but remember value, looks, and features are the key to this discussion!\n\nCan I get a \"What, What\",\n\nMikey\n\n",
  "author": "<a href=\"/web/20120207111435/http://typophile.com/user/12479\" title=\"View user profile.\">SuperUltraFabulous</a>",
  "time": "<br>",
  "uid": "12479",
  "comments": [
    {
      "time": "",
      "content": "What is even better: to make such a font on your own :)  \nProblem: you can't get enough, and if you don't watch out, quality suffers as featuritis grows...\n\n"
    },
    {
      "time": "",
      "content": " **Good luck with all the wedding invitations!**\n\nƒ\n\n"
    },
    {
      "time": "",
      "content": "Try not to over-do the mid-word flourishes, concentrate on the final letters of a sentence or line.\n\nAs a good man called da Vinci once said “Simplicity is the ultimate sophistication”.\n\n"
    },
    {
      "time": "",
      "content": "Sebilar\\> I have to disagree. It depends if the designer has the mental fortitude not to rush through a large undertaking, not to cut corners. I do wish someday I have the brains to make my own typeface though ;O)\n\nFredo\\> um... err, sorry not getting married but I get your point though. Poetica would be appropriate for such an occasion although I tend to prefer Bickham Script for nuptials. However, it does make a nice companion for other texts.\n\nConor\\> This I know. ; ) Linotype has similar advice for Zapfino. Another typeface that I'm just goo-goo-gaga about. Nice quote from da Vinci too.\n\nMy pedantic filibuster on the virtues Poetica are largely rhetorical so back to my original question does anyone have any fonts that they have purchased that they found to be a good 'deal'? You know, bang for your buck!!! Did it have features you were expecting yet delighted you with the bells and whistles of a comprehensive feature set? Tell me about the fonts that made you say \"money well spent\". You got a lot for what you put out.\n\nAnother for instance... I purchased the entire FontDiner collection for about $130 and I got over 50 fonts to play with- all fun display stuff. Yum! Tell me about things like this... mention foundry's too.\n\n"
    },
    {
      "time": "",
      "content": "It is worth it to buy a font from Storm just to get his catalog. I was just told he changes it each year. How cool is that? I'd like to collect the whole set if anyone wants to put them up for bid.\n\n[Harold Lohner's CDs are one of the best bargains I've come across](http://web.archive.org/web/20120207111435/http:/www.haroldsfonts.com/)  \nVery nice quality for the buck. Mostly display fonts with full character sets.\n\nAlso what you get for $6 is amazing with [Graham Meade's hot-selling Koster](http://web.archive.org/web/20120207111435/http:/www.myfonts.com/fonts/typotheticals/koster/)  \nIn fact, most of Graham's Typothetical Fonts are good deals. Make sure you hit \"purchase options\", since often the price listed is really the price for the family. A nice casual font called Flute says $8, but it is regular and expanded versions, both for $8. Again, you'll find full character sets.\n\nSome of the [Blambot commercial fonts](http://web.archive.org/web/20120207111435/http:/www.blambot.com/fonts.shtml) are great. For instance Blambot Pro has Caps Regular · Caps Bold · Caps Italic · Lite Regular · Lite Bold · Lite Italic, all with complete char. sets, and all for $40.\n\nI'll add more to this as it comes to me.\n\n"
    },
    {
      "time": "",
      "content": "_To answer your original question:_\n\nAnything by **Underware**.  \n [http://www.underware.nl/site2/index.php3?id1=fonts](http://web.archive.org/web/20120207111435/http:/www.underware.nl/site2/index.php3?id1=fonts \"http://www.underware.nl/site2/index.php3?id1=fonts\")\n\nParticularly **Bello** , which is priced fantastically.\n\n"
    },
    {
      "time": "",
      "content": "Yes, the OpenType version of Poetica is a great deal. To get all the variants, swashes, and such in Type 1 you'd have to pay over $200!! Hint: don't use the five dozen or so ampersands all at once. The joy is in choosing exactly the right one.\n\n"
    },
    {
      "time": "",
      "content": "Emigre’s **Dalliance** is quite pretty and awash with flourishes. It’s also reasonably priced.\n\n[http://www.emigre.com/EF.php?fid=87](http://web.archive.org/web/20120207111435/http:/www.emigre.com/EF.php?fid=87 \"http://www.emigre.com/EF.php?fid=87\")\n\n"
    },
    {
      "time": "",
      "content": "fontplayer\\> I have a special \"collection\" in FontBook dedicated to Harold's fonts. Love his stuff. His crappy website masks the fact that his fonts are pretty good. Kerning and some harmony issues aside, he has wonderful things! I love Pharmacy!!! Just say unicase and I'm all over it!  \nI like Koster but I think Melico is much better. Flute is nice too. In fact there are several fonts I like from them. Though it does not look like the highest quality but some of the forms would have a place in my collection... I will them a closer look.\n\nAs for Blambot... my brain does not respond to Blambot at all ;( Post more goodies though :)\n\nConor\\> Bello pro is the bomb!!! I have seen it a dozen times and have never looked at the price. 75 euros... not bad- and you can get the pro version for the same price!!! Dalliance is lovely indeed. Great price too... and you do get a lot for the money. I have yet buy anything from Emigre- Dalliance is a good start. This one of those fonts - like Poetica- you can't use it everywhere but in the places that you do- it adds the nice, if not unusual touch.\n\nSmarks\\> Yes I remember that. In fact I remember when Poetica first came out. I was a little kid then and I remember reading all about Poetica and Cronos in Adobe's now defunct Font&Function catalog. Those were the days.\n\n"
    }
  ]
}
