{
  "id": "1972",
  "title": "CD-cover logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm designing a CD-cover and need your critique on the simple logotype I'm planning to put as a part of the cover. Here's a rough sketch. The blue background is the sky of the cover photo. Does the logo work OK? What should I change? Any specific problems?   \n   \n(and yes, the \"hurriganes\" is spelled correctly and \"the\" is missing in the sentence... Finnish band Hurriganes was notorious about their bad english ![:-)](http://web.archive.org/web/20131023200005im_/http:/www.typophile.com/forums/clipart/happy.gif))   \n   \n ![](http://web.archive.org/web/20131023200005im_/http:/www.typophile.com/forums/messages/29/19944.jpg)\n\n",
  "author": "Jan Sandvik",
  "time": "6 Nov 2003 — 2:51pm",
  "uid": "2482",
  "comments": [
    {
      "time": "6 Nov 2003 — 3:59pm",
      "content": "\"Rough sketch\" sure looks different than what I call a \"rough sketch\". I really like the type design, however, music is very emotional making it hard for me to critique its appropriateness without knowing much about Adam. I guess the only thing I would say (and many might disagree with me) is that the sliver of the \"M\" strokes seems to be crossing the baseline too far. It probably wouldn't bother me so much if the \"A\" below it wasn't so close.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "6 Nov 2003 — 4:45pm",
      "content": "really like the adam logo, however theier are some real problems with teh kerning on teh words 'A TRIBUTE TO HURRIGANES' you might want to half the word spacing and double the letter spacing. I have no problem with the M droping below the baseline but agree that the second line needs some breathing space\n\n"
    },
    {
      "time": "7 Nov 2003 — 2:56am",
      "content": "I did not even notice the thing going on with the M, I'll propably fix it in the final version. Strange how blind one can get when judging his own work!   \n   \nI'll also try out Paul's tips om kerning and spacing.   \n   \nThank you both very much! ![:-)](http://web.archive.org/web/20131023200005im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "7 Nov 2003 — 9:58am",
      "content": "RE: \"M\"   \n   \nI wouldn't worry about stopping the point right at the baseline...I just think it's crossing a little too much right now.   \n   \nRE: Kerning/Letter Spacing   \n   \nAny changes here should probably be pretty conservative. I think the look of the logo demands some fairly tight type, so I would follow Paul's suggestion, but do so conservatively.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "9 Nov 2003 — 10:22am",
      "content": "i like the tight letterspacing on the tagline. but it's true that the word spacing is too large. bring the words closer, i say. you might want to bring that tagline down too, farther away from ADAM.   \n   \nalso, i think the A in ADAM should be the same distance to the D as the other A is to the M. (what i mean is the vertical blue lines there aren't the same width, but they should be identical.\n\n"
    },
    {
      "time": "9 Nov 2003 — 10:18pm",
      "content": "It seems appropriate that the cresent shaped space between the \"D\" and \"A\" should \"appear\" even from top to bottom. In order to achieve this visual equal spacing (I say \"visual\" because the \"literal\" spacing is probably even, as is) the open space probably needs to flare out just a tad at the top and bottom.   \n   \nAlso, Loren is on the money regarding the vertical space between the A's and their adjacent consonants.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "10 Nov 2003 — 8:06am",
      "content": "Here is a new version, that is propably going to be the final one... Thank you for your helpful suggestions! ![:-)](http://web.archive.org/web/20131023200005im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n ![](http://web.archive.org/web/20131023200005im_/http:/www.typophile.com/forums/messages/29/20151.jpg)\n\n"
    },
    {
      "time": "10 Nov 2003 — 8:06am",
      "content": "Here is a new version, that is propably going to be the final one... thank you very much for your suggestions... ![:-)](http://web.archive.org/web/20131023200005im_/http:/www.typophile.com/forums/clipart/happy.gif) ![](http://web.archive.org/web/20131023200005im_/http:/www.typophile.com/forums/messages/29/20158.jpg)\n\n"
    },
    {
      "time": "10 Nov 2003 — 8:14am",
      "content": "Oh, how do you delete a post???   \nSorry about the multiple posts, I tried to change the image because I posted a wrong file but I just got somehow duplicates of the original message ![:-(](http://web.archive.org/web/20131023200005im_/http:/www.typophile.com/forums/clipart/sad.gif)   \n ![](http://web.archive.org/web/20131023200005im_/http:/www.typophile.com/forums/messages/29/20167.jpg)\n\n"
    },
    {
      "time": "12 Nov 2003 — 2:07am",
      "content": "Jan, can you post the entire CD cover....\n\n"
    },
    {
      "time": "13 Nov 2003 — 11:54am",
      "content": "Jan keep the first M's sliver it stands out nicely and gives a bit of depth. You are designing a logo, not a type face.\n\n"
    },
    {
      "time": "13 Nov 2003 — 12:06pm",
      "content": "I'll have to disagree. There's no reason for the \"M\" to stand out, in fact, I think it would detract from where the logo has gone (latest version). Also, did Jan say that he wasn't designing a typeface?   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "13 Nov 2003 — 2:36pm",
      "content": "Jan, what kind of music is it? Is it conserative and tight and justified like the logo? I agree with Tiffany lets see it in context. Dan\n\n"
    },
    {
      "time": "14 Nov 2003 — 5:04pm",
      "content": "That spacing between teh words is still very unconfortable to look at, and emphasised when the strapline is butted so close to the Mark.   \nI'm also not a great fan of hte Bauhouse light font as it make shte whole identity look dated (unless your going for the retro look? this comment is tmade completely out of context of where the Bands Image sits... is it to be a Pulp-esque retor typographical treatment?). I also agree with tiffany that the darker, greyer blue feels better, again this has no real context just an aesthetic feeling.\n\n"
    },
    {
      "time": "14 Nov 2003 — 5:22pm",
      "content": "P.S. apologies folks for the spelling typing errors it's early here and my addiction to these forums is secondary to getting some sleep...\n\n"
    },
    {
      "time": "14 Nov 2003 — 8:06pm",
      "content": "Well on the last version there is no room for the large M's sliver, and finally the desition of keeping it or not has to do with a lot of things only Jan is capable to evaluate.   \n   \nI feel that M is a bit constrained, it\n\n"
    },
    {
      "time": "13 Nov 2003 — 12:06pm",
      "content": "I think the bottom phrase is far too close for both the word spacing of that line and the letterspacing of the above. I also prefer the darker blue. But, BUT, until we see the whole thing in context we might be giving you the wrong critique.   \n   \n ![:-)](http://web.archive.org/web/20131023200005im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    }
  ]
}
