{
  "id": "19738",
  "title": "Sudtipos new releases ++ Affair & Malambo",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20071011123826/http:/typophile.com/user/108 \"View user profile.\") : 4.May.2006 4.22pm \n\n////Affair/////\n\nHow to have an affair and get away with it?\n\nAffair. It’s an event and you’re invited. Affair is an extraordinary new  \ncalligraphic typeface by Alejandro Paul with a party full of swash  \ncharacters, ligatures, and ornaments. By default, it’s simply an elegant  \nyet readable display face. Dress it up with alternates, and it becomes  \nirresistibly attractive, in styles from glamourous to over-the-top.  \nHundreds of alternates, tons of swashy endings and ligatures, all  \naccessible through OpenType palettes in programs that support such  \nfeatures.\n\nA foreign affair\n\n“Upon finishing the font I was fortunate enough that a few of my  \ncolleagues, great type designers and probably much saner than I am, agreed  \nto show me how they envision my Affair in action. The beauty they showed  \nme makes me feel small and yearn for the world to be even smaller now –  \nat least small enough so that my international colleagues and I can meet  \nand exchange stories over a good parrilla. These people, whose kindness is  \nvery deserving of my gratitude, and whose beautiful art is very deserving  \nof your appreciation, are in no particular order: Corey Holms, Mariano  \nLopez Hiriart, Xavier Dupré, Alejandro Ros, Rebecca Alaccari, Laura  \nMeseguer, Neil Summerour, Eduardo Manso, and the Doma group. You can see  \nhow they envisioned using Affair in the section of this booklet entitled A  \nForeign Affair.”\n\n[http://www.sudtipos.com/fonts-affair.htm](http://web.archive.org/web/20071011123826/http:/www.sudtipos.com/fonts-affair.htm \"http://www.sudtipos.com/fonts-affair.htm\")\n\n//////Malambo////////\n\nMaster of the dancing brush, Angel Koziupa, and the node-obsessed  \nperfectionist, Alejandro Paul, offer up another bucket of fun with  \nMalambo. Koziupa has allowed his brush to jitter one whole millimeter in  \nthis fresh design. Full of energy, cheek, and mischief, Malambo relates  \namusing anecdotes of shaving without a mirror, mistakenly pouring wine  \nover the morning cereal, and people who trip over their own shadow on the  \ndance floor. Shaken, but not disturbed.\n\nIn fact, dancing is what this typeface is all about. Malambo is a  \ntraditional Argentine dance performed by gauchos (the Argentine equivalent  \nof 19th century North American cowboys). Although they dance quite  \npassionately and make the heartiest parrillas, most of them probably don’t  \nknow what a font is. But you know... and we know. And that is something  \ncalled Malambo.\n\n[http://www.veer.com/products/typedetail.aspx?image=UMT0000174](http://web.archive.org/web/20071011123826/http:/www.veer.com/products/typedetail.aspx?image=UMT0000174 \"http://www.veer.com/products/typedetail.aspx?image=UMT0000174\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20071011123826/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 4.May.2006 4.22pm",
  "uid": "108",
  "comments": [

  ]
}
