{
  "id": "19735",
  "title": "square sans on G-UNIT Clothing web page",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "hey im a student at the art institute of tampa and was wondering what font is similar to the all caps font they have on their website  \n [http://www.g-unitclothing.com/](http://web.archive.org/web/20131020165537/http:/www.g-unitclothing.com/ \"http://www.g-unitclothing.com/\") and also if there is a website i can get the font from and hopefully not have to pay since im a poor college student =P\n\n",
  "author": "seansurfn2",
  "time": "4 May 2006 — 3:57pm",
  "uid": "12674",
  "comments": [
    {
      "time": "4 May 2006 — 4:14pm",
      "content": "That is [AGENCY](http://web.archive.org/web/20131020165537/http:/www.fontbureau.com/fonts/AgencyFB) from FONT BUREAU\n\n"
    },
    {
      "time": "4 May 2006 — 4:14pm",
      "content": "The repeating letters have different parts \"grunged\" so I think the text was rasterized and processed with something like [Mr. Retro's Wash Filters](http://web.archive.org/web/20131020165537/http:/www.misterretro.com/image_filters.html)\n\n"
    },
    {
      "time": "4 May 2006 — 4:20pm",
      "content": "can't you create something of the same effect with a brush tool or some effect in adobe photoshop? also u said agency but on that link there is about 25 different styles it looks kind of condensed to me from what i can tell almost like the type you see on military vehicles\n\n"
    },
    {
      "time": "4 May 2006 — 4:49pm",
      "content": "k i got it now and i just used a custom charcoal brush to create the effect and everything thanks for the help!\n\n"
    },
    {
      "time": "4 May 2006 — 5:02pm",
      "content": "<cite>can’t you create something of the same effect with a brush tool or some effect in adobe photoshop?</cite>\n\nYes, as you have found out.\n\nMr. Retro's way is nice for me because there are so many variations that work fine without me having to have artistic talent. I only have the first set, but as soon as I can figure out how to write this stuff off, I'm getting the others.\n\n"
    },
    {
      "time": "4 May 2006 — 5:11pm",
      "content": "ya just fooling around with it i almost got it with the chalk tool to look exactly the same i for fun made one of my name on here and the picture hopefully should show up soon here :)\n\n"
    },
    {
      "time": "4 May 2006 — 5:15pm",
      "content": "My favourite way of grunging stuff up is the following:\n\n1. Find a picture of rust, dirt, concrete, etc.  \n2. Greyscale this picture and turn up the contrast so it's mostly white with black grunge on it.  \n3. Copy this onto a layer above your text and set the blending mode to \"Multiply\".  \n4. Tweak the contrast of the top layer as necessary.\n\nThis lets you change the text underneath if necessary while keeping the grunge on top.\n\n- Lex\n\n"
    },
    {
      "time": "4 May 2006 — 5:26pm",
      "content": "oooooo cool idea !! thanks ill remember that these forums are awesome for getting information!\n\n"
    },
    {
      "time": "4 May 2006 — 5:31pm",
      "content": "<cite>My favourite way of grunging stuff up is the following:</cite>\n\nI think that is similar to what The filters do, but they make it a PS \"action\". But I am saving your comment. On the texture photo pages on my website are a lot of things that might make interesting things to try with this using my own photos. Thanks.\n\n"
    },
    {
      "time": "4 May 2006 — 7:21pm",
      "content": "I forgot to mention that this only works for images with a black background. If you want to grunge something on a white background, you'll have to invert the dirt layer and set it to \"Screen\".\n\n- Lex\n\n"
    },
    {
      "time": "4 May 2006 — 10:48pm",
      "content": "I do something similar to what Lex does however I do it in such a way as to work on all backgrounds (sorry Lex ;-P). Anyway the way I do it is to get a grunge texture (rust, flaking paint etc.) and then bring the photo into the file that also contains your text. From here I click on the photo layer, press 'Control/Command A' to select all then 'Control/Command C' to copy the photo. From here I go into my Channels palette, create a new channel and then press 'Control/Command P' to paste the grunge texture into the Channel. It will automatically become black and white, from here you can alter your levels/contrast etc. until the texture is too your liking. Then I click the channel selection button at the bottom of the palette, you should have some marching ants around the whiter areas of your texture. Then go into your layers palette click on your text layer then click the create new layer mask button. Voila, one nice sexy set of grunged up text.\n\nI have not done much grunge work recently however, I sense it's going out of style. Still I found the method to be the most effective.\n\n"
    },
    {
      "time": "5 May 2006 — 12:02am",
      "content": "Aha - layer mask. I knew there had to be something like that in Photoshop. I came up with this grunge effect when I was working on some video design in After Effects. We had to have animated grungy text where the video behind the text had to be visible through the grunge holes. In AE you can use one layer as a tracking matte for the one below it, which would be the equivalent to layer mask in PS.\n\n- Lex\n\n"
    },
    {
      "time": "5 May 2006 — 8:22pm",
      "content": "_That is AGENCY from FONT BUREAU_\n\nWRONG! It's actually [**United Sans Regular Bold**](http://web.archive.org/web/20131020165537/http:/www.houseind.com/index.php?page=showfont&id=531&subpage=un_fonts_sans), from the exceptional new type family from House Industries.\n\n"
    },
    {
      "time": "5 May 2006 — 8:55pm",
      "content": "That is one BIG avatar you have there, Sean.\n\n"
    },
    {
      "time": "6 May 2006 — 4:21am",
      "content": "\\>United Sans Regular Bold\n\nI think we are getting confused by the number of fonts used on this site, assuming we are looking at the navigation bar HOME•COMPANY etc, but I don't see anything that is United Sans Regular Bold (M & E), equally I'm not convinced by Agency (K & S). However, I can't id it either.  \nTim\n\n"
    },
    {
      "time": "6 May 2006 — 10:36am",
      "content": "I'll concede that Agency isn't a perfect match. But, G-Unit clothing has been online too long for it to be United Sans, as well, the corners are rounded and not faceted.\n\n"
    },
    {
      "time": "6 May 2006 — 11:08am",
      "content": "A few others to consider (none exact):\n\nBanque Gothique [http://www.myfonts.com/fonts/redrooster/banque-gothique-rr/](http://web.archive.org/web/20131020165537/http:/www.myfonts.com/fonts/redrooster/banque-gothique-rr/ \"http://www.myfonts.com/fonts/redrooster/banque-gothique-rr/\")\n\nStratum 1 [http://www.myfonts.com/fonts/processtype/stratum1/](http://web.archive.org/web/20131020165537/http:/www.myfonts.com/fonts/processtype/stratum1/ \"http://www.myfonts.com/fonts/processtype/stratum1/\")\n\nTX Manifesto [http://www.myfonts.com/fonts/typebox/tx-manifesto/](http://web.archive.org/web/20131020165537/http:/www.myfonts.com/fonts/typebox/tx-manifesto/ \"http://www.myfonts.com/fonts/typebox/tx-manifesto/\")\n\n"
    },
    {
      "time": "6 May 2006 — 2:08pm",
      "content": "Don't forget [Refrigerator](http://web.archive.org/web/20131020165537/http:/www.ms-studio.com/FontSales/refrigerator.html#) by fellow typophile Mark Simonson.\n\n- Lex\n\n"
    }
  ]
}
