{
  "id": "19741",
  "title": "OpenType and Freehand MX",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello all, I am by no means a computer genius and I really want to know whether or not Adobe's Bickham Script standard font opentype version will work on my program before I buy it because I can't find a TrueType version anymore. I am willing to purchase it if it's out there of course, but I can't find it. I use Window's XP, Freehand MX. Any help would really be appreciated!! ThistleBerry Press\n\n",
  "author": "<a href=\"/web/20100923100335/http://typophile.com/user/12787\" title=\"View user profile.\">ThistleBerry Press</a>",
  "time": "<br>",
  "uid": "12787",
  "comments": [
    {
      "time": "",
      "content": "As long as you stick to Freehand, you will not have enjoy an OpenType font fully, since it doesn't support more than 256 characters or any OpenType features.  \nWhy do you look for a TrueType version of Bickham? Windows XP will just work fine with any PostScript flavoured OpenType font, like Bickham Script (Pro).\n\nRalf\n\n[http://www.fonts.info](http://web.archive.org/web/20100923100335/http:/www.fonts.info/ \"http://www.fonts.info\")\n\n"
    },
    {
      "time": "",
      "content": "Hi Ralf, I don't necessarily want a TrueType version, I just thought that's what I needed. Now, if I buy Bickham Script Pro to use specifically in Freehand MX will I get the punctuation and numbers? Or will I just get capitals and lowercase? Thanks for your reply!\n\n"
    },
    {
      "time": "",
      "content": "Here are samples with Bickham Pro in Indesign CS2 (with contextual alternates on) and in Freehand MX. In Freehand you can use basic glyphs, but that's it, Open type features don't work.\n\nInDesign:\n\n ![](http://web.archive.org/web/20100923100335im_/http:/typophile.com/files/INDD_CS2_5656.gif)\n\nFreehand:\n\n ![](http://web.archive.org/web/20100923100335im_/http:/typophile.com/files/FHMX_5846.gif)\n\n"
    },
    {
      "time": "",
      "content": "All the usual punctuation, dollar signs, numbers etc are there, as you can see. I just ran my finger over the keyboard (sorry about the unorthodox approach)\n\n ![](http://web.archive.org/web/20100923100335im_/http:/typophile.com/files/Bickham_3625.gif)\n\n"
    },
    {
      "time": "",
      "content": "Hi Thistleberry,\n\nIf you read this post just wanted to say sorry for all\n\nK\n\n"
    },
    {
      "time": "",
      "content": "Without OpenType support you only get the basic latin character set, which includes everything you would normally expect to find in a font--caps, lowercase, numbers, punctuation, etc.--, but not the extra characters--alternates, swashes, Central European, etc.\n\n"
    },
    {
      "time": "",
      "content": "I'd like to point out a terminologic unclarity: \"OpenType support\" means different things. I usually say \"OpenType Layout support\" when I refer to the ability to handle the advanced typographic features. Freehand \"supports\" OpenType as a font format to the extent that it does support other font formats: the Roman codepage (256 character) and no advanced typography support. On the other hand, Adobe CS applications offer Unicode and OpenType Layout support.\n\nA.\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Adam, for clarifying that. You're absolutely correct. I was just trying to keep it simple.\n\n"
    },
    {
      "time": "",
      "content": "It is also worth noting that Kern Pairs may not necessarily be supported. We certainly had a problem with a TTF flavoured font that had both Pairs and Kern Feature tables. Neither Freehand 10 nor MX saw the pairs. Killing the Kern Feature resolved the problem on the TTF at least.  \nI seem to remember that kern feature table fonts give no access to older apps. I am not sure now, if you can actually build OTF (CFF) based fonts using Kern Pair tables or if they only come as layout feature.\n\nBruno Maag  \nDalton Maag Ltd\n\n"
    },
    {
      "time": "",
      "content": "ATM and the Adobe code that both Apple and Microsoft use for OTF (CFF) font support creates a standard kern table for older apps. The table is a subset of pairs derived from the kern feature, with all but western latin characters filtered out (more or less).\n\n"
    },
    {
      "time": "",
      "content": "Sounds like an upgrade to Ill CS2 or IND CS2 is in order. Maybe you can get an upgrade rate since Adobe owns them both now.\n\n"
    }
  ]
}
