{
  "id": "1974",
  "title": "Info24.ee",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I made some logos for a contest (and I do think that there's some other thread here similar to this one, only by a different author and about a different sketch) and I'd really like to hear what you think about it, since it's pretty hard to get constructive criticism these days...   \n ![Info24.ee logos v.1.0b](http://web.archive.org/web/20131019021038im_/http:/www.typophile.com/forums/messages/29/19984.gif)\n\n",
  "author": "jarmo",
  "time": "7 Nov 2003 — 3:54am",
  "uid": "2594",
  "comments": [
    {
      "time": "7 Nov 2003 — 3:56am",
      "content": "Sorry, forgot to mention that the phrase 'info linnutiivul' means smth like 'information on the speed of birds'\n\n"
    },
    {
      "time": "7 Nov 2003 — 10:11am",
      "content": "\"information on the speed of birds\"...That's interesting. I would've never guessed by this or the other thread, what the meaning of the logo was. I was wondering what the bird was representing. Still, I think the concept could be stronger, relative to the message. A strong indication of motion (not a pasted arrow/bird) throughout the logo would probably strengthen the concept. Your concept is moving (no punn intended) in a nice visual aesthetic direction, but the visual message could still use some exploration.   \n   \nJust think movement/speed/motion while your sketching.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "7 Nov 2003 — 11:18am",
      "content": "So should I develop the bird or find a new 'thingy' to replace it?\n\n"
    },
    {
      "time": "7 Nov 2003 — 11:41am",
      "content": "Made a (little) changed version of the logo. Is it better? (Sorry for bothering you all like that but the deadline's in 2,3h)   \n   \n ![Logo2](http://web.archive.org/web/20131019021038im_/http:/www.typophile.com/forums/messages/29/20032.gif)\n\n"
    },
    {
      "time": "7 Nov 2003 — 12:44pm",
      "content": "That helps, but I just don't know if the type is the right choice. I don't know all the details of the project, so I can't really say much more. It doesn't sound like you have much time to do more type research either...sooo, good luck!   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "7 Nov 2003 — 12:57pm",
      "content": "I agree with Scott.   \nThe bird has alot of curves whereas the typeface is just rectangles. Maybe a new typeface, or a more geometric bird? How could you integrate the bird into the type?\n\n"
    },
    {
      "time": "7 Nov 2003 — 1:48pm",
      "content": "Ok, now i've got 10 min till the deadline and I made this (probably the last one) copy:   \n ![Logo3](http://web.archive.org/web/20131019021038im_/http:/www.typophile.com/forums/messages/29/20041.gif)   \nI really would like to thank you for helping me ![:-)](http://web.archive.org/web/20131019021038im_/http:/www.typophile.com/forums/clipart/happy.gif)and let's hope the jury will like it :p\n\n"
    }
  ]
}
