{
  "id": "19748",
  "title": "Afro Clinic Card",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi guys:\n\nThere is so much about design I have yet to learn. I just play with graphics on my mac but I would like to take it to the next level some day.\n\nHere is something I'm playing with. A business card for a friend... just playing around... she does not own a business nor is she even black...hehehehe. Its cute and that's why I like it.\n\nI think there is something wrong with the address placement. Perhaps there may be a scale problem too with some of the stars.\n\nTell me what you think.\n\nThanks,\n\nMikey\n\nPS... sugar, spice and everything nice was the inspiration.\n\n| Attachment | Size |\n| --- | --- |\n| [ef black17-b.png](http://web.archive.org/web/20131018074142/http:/typophile.com/files/ef%20black17-b.png) | 54.17 KB |\n\n",
  "author": "SuperUltraFabulous",
  "time": "5 May 2006 — 5:50am",
  "uid": "12479",
  "comments": [
    {
      "time": "5 May 2006 — 7:28am",
      "content": "Mikey, those colours will look like shit in CMYK.\n\n"
    },
    {
      "time": "5 May 2006 — 4:20pm",
      "content": "Nick\\> The colors I have planned in mind do not accurately display on our RGB monitors. The green will be more brilliant and the orange and the yellow will not be muddy. I have Pantone colors marked for each color here.\n\nBut I'm not concerned with that.... its the balance of the elements and the address that's driving me crazy.\n\nI may even make the card double sided and put the address on the other side but I'm not sure yet....\n\nTell me what you think,\n\nMikey\n\nPS... I do intend to have the card professionally offset printed if I'm satisfied... for fun or not.\n\n"
    },
    {
      "time": "6 May 2006 — 5:24am",
      "content": "I would make the Erin's name larger and check the kerning especially the apostrophe s. It is reading CUNIC to me, you could kern out the first I and even have it hanging off the R's vertical and adjust the INI kerning so it is equal while tightening the RO. Since you are making things align in AFRO CLINIC you might align the address with that, for example on the vertical of the L. As for the stars a more varied scale could help the movement and try having some come from behind the figure and type. The figure's neck is bothering me as well there is a triangular shape, presumably a collar, that is not working as a silhouette and her right earring looks quite large. Nick's point about the colour is worth bearing in mind because unless you are having that printed in spot colour, I counted 7 (which will be expensive, even if you can find a printer that has the capacity to do that), four colour process doesn't handle purples and oranges that well, I suppose you could go Hexachrome (which will also be expensive).  \nTim\n\n"
    },
    {
      "time": "6 May 2006 — 11:08am",
      "content": "Hey,  \nIf its just for fun, you would want to print it in cmyk. I dont think that a printer would print process colours unless its above 1000 units. And with all those colours, it is expencive.  \nThat said, I really like the idea and fonts. I agree with Timid, and maybe have it like:\n\n758 Terrace St  \nSantee CA,  \n99960\n\n803-670-9014\n\nJust a suggestion. But it is a good idea to have the address follow the invisible line of the \"L\". Also you might check that the stars are not geeting in the way of the readability of \"erin ferrell's\".\n\nHope it helped, and good luck.\n\n\\>ER\n\n"
    },
    {
      "time": "6 May 2006 — 11:11am",
      "content": "Thanks for explaining my comment Tim.\n\n"
    },
    {
      "time": "6 May 2006 — 5:18pm",
      "content": "Excellent suggestions guys!!! A++ I really appreciate all your thoughts... and yes, I have more to do ;-)\n\n"
    }
  ]
}
