{
  "id": "19743",
  "title": "Advice asked for first time typesetting with metal",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello everybody,\n\nI have taken an interest in metal (lead) type. I have the opportunity to print at both my colleges. I have read the following book \"Boek over het maken van boeken\" and I observed someone else (making a business card for herself).\n\nI would like to typeset a poem (The Motive for Metaphor, by Wallace Stevens [http://pocast.com/?p=88](http://web.archive.org/web/20131019181549/http:/pocast.com/?p=88 \"http://pocast.com/?p=88\")). The fonts I can use are limited. From the list of the fonts they have (the complete list below) I have chosen 'Nobel' for the title and name of the author and for the body text I was thinking about 'Spectrum'.\n\nMy questions: 1) if you begin to typeset with lead type would you start with a poem (most people only print business cards)? 2) Would you start learning using fonts you do not know (not that I know any font personally)? 3) Which font would you're choice to start with? 4) Are there any books you would recommend too read before you try printing with lead type (it doesn't have to be in english)?\n\nMy goal is too (eventually) typeset a small booklet (someday; after I have practiced; a lot).\n\nThank you for you're time.\n\nBest,\n\nTerence\n\nList of Fonts\n\nAntieke  \nBaskerville  \nBordoni  \nEgmont  \nEgyptienne  \nGaramont  \nGill  \nHelvetica  \nHildago  \nIris  \nNobel  \nSpectrum  \nTimes  \nVenus\n\n",
  "author": "canus",
  "time": "5 May 2006 — 1:35am",
  "uid": "8433",
  "comments": [
    {
      "time": "5 May 2006 — 8:02am",
      "content": "Hi Terence,\n\nit's been a long, long time since I've set anything in metal, but others on this forum have kept the _Black Art_ alive.\n\n\\> _My questions:_\n\n1) if you begin to typeset with lead type would you start with a poem (most people only print business cards)?\n\nIn my opionion, a poem is fine, perhaps even better. Just keep the entire poem with title and author on a single sheet. Traditional poems have standardized typographic guidelines such as, line for line, flush left/ragged right with indents on lines that run over, etc. Review several quality books of poetry to understand how poems are set typographically.\n\n_2) Would you start learning using fonts you do not know (not that I know any font personally)?_\n\nI think that matters less than the selection of metal fonts and sizes that are available to work with.\n\n_3) Which font would you’re choice to start with?_\n\nAgain, I think it matters less than the selection available, but for a traditional poem, at least try serifs first. It really concerns the \"tone\" of the poem itself. Try setting a line or two on the same sheet with different fonts. This will give you a sense of what might work better.\n\n_4) Are there any books you would recommend too read before you try printing with lead type (it doesn’t have to be in english)?_\n\nHere are a few links I have bookmarked for myself related to hot metal printing and types that may be useful even before purchasing a book:\n\n[Five Roses Press](http://web.archive.org/web/20131019181549/http:/www.fiveroses.org/)  \n [Resources for Letterpress Printers](http://web.archive.org/web/20131019181549/http:/members.aol.com/aapa96/lpress.html)  \n [Bixler Press -- some Monotype metal type specimens](http://web.archive.org/web/20131019181549/http:/www.mwbixler.com/specimens.html)  \n [Don Black -- handset type listings](http://web.archive.org/web/20131019181549/http:/www.donblack.ca/handset.htm)  \n [Metal Type -- Hot Metal Type Links](http://web.archive.org/web/20131019181549/http:/www.metaltype.co.uk/links.shtml)\n\n"
    },
    {
      "time": "5 May 2006 — 10:29am",
      "content": "Spectrum/Nobel seem a good choice for the poem, although you might find it easier to start with just one.  \nJust remember there is no command+z for metal and you will wish there was when you drop a case:)  \nHave fun  \nTim\n\n"
    },
    {
      "time": "5 May 2006 — 12:09pm",
      "content": "\\> Review several quality books of poetry to understand how poems are set typographically.\n\nI want to elaborate on this good advice. Ignore any poetry book printed after 1984. It is possible that it is well set, but that is the year that DTP started (well, soon after) and this meant books could be set by non-experts in typography.\n\nBooks set pre-1984, if bound well and on good paper, probably followed the typographic conventions Norbert is mentioning.\n\n"
    },
    {
      "time": "5 May 2006 — 12:24pm",
      "content": "I am by no means an expert, but here are two things I would advise:  \n1) Because of its current reality and its inherent limitations (compared to what we're used to in digital) to me it seems best to \"jump in\", and let it teach you what it will; resist the urge to over-plan and fully control the experience.  \n2) Please, please, don't over-impress.\n\nhhp\n\n"
    },
    {
      "time": "5 May 2006 — 12:50pm",
      "content": "Thank you all for commenting.\n\nI will to the following:\n\n- Review several quality books of poetry to understand how poems are set typographically (before 1984).\n\n- Set a line or two on the same sheet with different fonts and then choose one font.\n\n- I will try too constrain myself and not over-impress.\n\nThank you for the links. I have some a few weeks too research a bit (so if anything comes too mind) and I will post a picture of the eventual result.\n\nBest,\n\nTerence\n\n"
    },
    {
      "time": "29 Jun 2006 — 2:57am",
      "content": "A scan from my first time typesetting with lead. I know there a a few mistakes in them. Thanks for all your advice.\n\n ![](http://web.archive.org/web/20131019181549im_/http:/typophile.com/files/firstprinting_4595.jpg)\n\n"
    },
    {
      "time": "29 Jun 2006 — 5:14am",
      "content": "There is at least one typo in there. I hope this is a proof, and not a printing.\n\nYuoself should be youself or more likely yourself.\n\nFurther up quarter-thigs ... should that be quarter-things?\n\nBut a nice setting otherwise.\n\n"
    },
    {
      "time": "29 Jun 2006 — 5:43am",
      "content": "Did you enjoy it? I always found hand composition therapeutic.  \n(btw since we're marking it up for you, harb should be hard)\n\nTim\n\n"
    },
    {
      "time": "29 Jun 2006 — 6:24am",
      "content": "Could you provide a hi-res digital photograph?  \nThat conveys letterpress less inaccurately than a scan.\n\nhhp\n\n"
    },
    {
      "time": "29 Jun 2006 — 6:36am",
      "content": "Wow, Spectrum looks so much more robust in letter press!\n\nThis is not a printing issue, and I'm not sure if I'm right because we're not looking at it at the real size, but to me it looks like you have a bit too much leading betweem the lines in the quatrains, which weakens the look. And do correct your spelling! Somehow it looks worse when it is in print, because the print looks so good.\n\n"
    },
    {
      "time": "29 Jun 2006 — 7:56am",
      "content": "Great for a first print! Pretty good word-spacing too.  \nI have never set with individual slugs, just with prepared plates. I actually have a whole fount of a Civilité which is very nice, though I've never had the patience to try and print with it.\n\nIf you want more lead type, I would suggest checking out Ohio. Many cities, Cincinnati in particular, were major printing centers, and there is much old printing equipment to be found. I saw someone on eBay selling dozens of complete fonts (amounting to hundreds of pounds of lead) for just a couple hundred dollars, but obviously you had to pick it up yourself as such a thing would be difficult to ship. Naturally these were mostly newspaper and old commercial types, but would be a cool thing to have if you get into printing.\n\nI have inquired before about full sets of new metal type, and it is horribly expensive, costing about $100 for one each A-Z, numbers and some punctuation. That was for Centaur. And I would expect you would need several sets to do a single page. The point is, if you see some old lead type for cheap, you might as well make the effort to buy it if you plan on doing a lot of letterpress.\n\n"
    },
    {
      "time": "29 Jun 2006 — 8:07am",
      "content": "\\> I actually have a whole fount of a Civilité\n\nWhich one?\n\n\\> old lead type for cheap\n\nBut be careful, much of that stuff, especially on eBay, is in junk condition.  \nThere's this one guy whe sells them filled in plastic bags.\n\nhhp\n\n"
    },
    {
      "time": "29 Jun 2006 — 8:48am",
      "content": "Nice!\n\nAnother typo: \"yuoself\" - shouldn't it be yourself\"?\n\nI don't think there's too much lead at all.\n\nI LOVE Nobel but I think you should stick with Spectrum, somehow it seems more suited to the quietude of the poem.\n\nOoh - another typo - \"harb\" instead of \"hard\". This is the biggest thing to look for obviously in metal type. Mind your p's and q's.\n\n"
    },
    {
      "time": "29 Jun 2006 — 8:55am",
      "content": "Look at this beauty a friend brought me from a Paris flea market. Wish I had the whole alphabet. It sits on my monitor and reminds me why I love what I do.\n\n ![](http://web.archive.org/web/20131019181549im_/http:/typophile.com/files/fabricant_4727.jpg)\n\n(I reversed it of course)\n\n"
    },
    {
      "time": "29 Jun 2006 — 9:20am",
      "content": "Ah, I just think I figured out what looks weak. It's not the leading--Patty is probably right. It's the title. I think if you used Van Krimpen's great Caps & Small caps it would add contrast and drama.\n\n"
    },
    {
      "time": "29 Jun 2006 — 9:40am",
      "content": "@brant:  \nI don't know what Civilité it is, perhaps Legende? I can't imagine that there are too many that made it to metal form in the late-19th, early-20th century. As far as I know, it was never a really popular letter style to begin with, I don't know if it was ever used outside of northern France and the Low Countries, and it pretty much disappeared after the 17th century until Linotype and Monotype. It seems to crop up on Lebanese restaurant menus a lot. Funny where type ends up.\n\n"
    },
    {
      "time": "29 Jun 2006 — 9:49am",
      "content": "As someone who flip-flops back and forth between Renaissance and Early Modern typography, I think Helvetica would look really cool letterpressed.\n\n"
    },
    {
      "time": "29 Jun 2006 — 10:39am",
      "content": "It's that some fonts of civilite are extremely precious.  \nBut unless you're lucky and/or filthy rich you probably  \nhave the ATF version, or something like Legende, yes.\n\n\\> It seems to crop up on Lebanese restaurant menus a lot.\n\nThat is funny.  \nLike how uncial is used on Greek restaurants!\n\nhhp\n\n"
    },
    {
      "time": "29 Jun 2006 — 11:23am",
      "content": "and Israeli ones!\n\n"
    },
    {
      "time": "29 Jun 2006 — 11:42am",
      "content": "Speaking of uncials...  \nImagine it is a pleasant, peaceful day. You are walking along the magical cliffside of type, and you cautiously creep over to the edge to steal a furtive glance at the Forbidden Canyon leading to the typographic Nether-World below. You begin to teeter – you think you're going to fall into the mighty crack and be sucked away into Oblivion, but as you regain your balance you manage to peek over the edge and notice a tiny ledge sticking out from the inside wall of the cliff that isn't visible from a safe distance. And on that ledge, safely out of reach like the bansai tree in the Karate Kid II, you briefly glimpse Simplex:\n\n[http://www.identifont.com/similar?4EY](http://web.archive.org/web/20131019181549/http:/www.identifont.com/similar?4EY \"http://www.identifont.com/similar?4EY\")  \navailable here:  \n [http://www.itcfonts.com/fonts/detail.htm?pid=206762](http://web.archive.org/web/20131019181549/http:/www.itcfonts.com/fonts/detail.htm?pid=206762 \"http://www.itcfonts.com/fonts/detail.htm?pid=206762\")\n\n"
    },
    {
      "time": "1 Jul 2006 — 5:21am",
      "content": "Thank you for the kind words. This is the first printing to check for spelling errors etc. A lot of friends looked at it and there are 4 mistakes in this text.  \nI had too purchase the paper and cut it myself, so I could not do that at the same time and because it was so close towards the summer holiday I was unable to print it on the correct paper.\n\n@ timd  \nI did enjoy it and it certainly had a therapeutic element. Most of the people next too me thought I was crazy. It took me from 9 till 3 too set this one poem and then print a few times too see how it would look in print. I still want too make a small booklet, but the person who helps you with printing is leaving at the end of this year so I'm unsure if I can print before then.\n\n@hrant  \nYes. But I need to borrow a camera from my friend, so it can take a while.\n\n@William Berkson  \nUnfortunately they don't have the small caps in the size I am working at. It was the original idea to use them for the title.\n\n"
    }
  ]
}
