{
  "id": "19742",
  "title": "updated logo for poartble bulidings company",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hey there folks,\n\nI recently got asked to do a redesign of a companies logo. This is the first time I have done this, with a real company (always been at school before). And I came up with a few ideas, I liked 2 which I think work well (my opinion I guess), and one that my boss did (he’s not very design savvy though). And they liked his. I’d like to know what you guys think. I feel that mine wasn’t took bad. I need them in only a few hours as that was the time that I was given.\n\nCheers\n\nPS - He’s logo is bad quality because he sent it to me like that. And the ones I liked most out of mine were the 2nd and 4th.\n\n| Attachment | Size |\n| --- | --- |\n| [logo.jpg](http://web.archive.org/web/20080208042950/http:/typophile.com/files/logo_13.jpg) | 132.44 KB |\n\n [‹ business cards](http://web.archive.org/web/20080208042950/http:/typophile.com/node/19771 \"Go to previous forum topic\") [children's theater ›](http://web.archive.org/web/20080208042950/http:/typophile.com/node/19722 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080208042950/http://typophile.com/user/9184\" title=\"View user profile.\">3dsnail</a>",
  "time": "<br>",
  "uid": "9184",
  "comments": [
    {
      "time": " 5.May.2006 2.29am",
      "content": "Okay, I like the first one because in some way it reminds me of a truck or something in motion which connects with the idea of trans-PORTABLE things. Then I like the last one because the star connotes ’new beginnings’ or ’new possibilities”.\n\nBut for the first one to work I think you need more trails to show motion. I’ll include a picture of a successful logo that demonstrates a dynamic ’in motion’ feeling. Or perhaps you can draw a building in the back of a truck bed in motion?\n\nFor the last one you need to move “portable building” down just a pinch- It seems like its colliding with NOVA. Perhaps even shrink the font size and loosen the letter spacing- that ones up to you. Also the star in the center of NOVA needs work. Try to make the shape seem more star like. Its a little too fat for me. :)\n\nThe two in the middle are not doing anything for me. But the outlying illustrations are the most promising. You need a logo with visual pun and whimsey. These are the most memorable.... so try the truck with a building in the back or some other pun you can come up with.\n\nHope I’m helping you,\n\nMikey\n\n ![](http://web.archive.org/web/20080208042950im_/http:/typophile.com/files/logo_praxair_6349.gif)\n\nAs you can see the logo looks like its in motion. You see the trails...that’s what I mean. Of course put your own spin on it.\n\n;O)\n\n"
    },
    {
      "time": " 5.May.2006 5.38am",
      "content": "Thanks Mikey,  \nAppriciate the help. The job already went through, but I’ll definity have a think about it, fix it with some of the things you said, so next time I’ll be better prepaid and have a better idea, cheers.  \nAnd the swirl is a visual pun, although I should have worked on it more, and would have given more time. Its a snail shell, which is a portable building, in a sense.  \nWhat gets my goat is that the client went for something which in my opinion doesnt say much, isnt dynamic, and I’ve seen heaps of logos like that and I just think its cheap.  \nBut we all have our opinions.  \nThanks for the help. Can anyone give me an idea of where I should look, such as a site or a book, that could help me with logos. Also an idea of what I should be doing or asking with clients, so I get a clearer idea of what they want. Again, a book or website would be great, if possible.\n\nThanks again micky, and thanks to everyone else...\n\n"
    },
    {
      "time": " 5.May.2006 5.40am",
      "content": "Your boss’ logo is going to be difficult to make work at all sizes due to the small size of portable buildings, leaving aside the spacing at each side of the oval and the kerning of NOVA.  \nOf yours  \n1. gives too much importance to portable buildings and the word NOVA might look better if it centred on the strapline rather than the entire graphic  \n2. the snail shell is a good metaphor for portable homes but it does also look like a downward spiral  \n3. and 4. are quite corporate (not necessarily a bad thing though) 4 reminds me of HSBC’s logo  \nI would look at 1 and 2 to develop further.  \nTim  \n{edit I cross posted with you}\n\n"
    },
    {
      "time": " 5.May.2006 5.49am",
      "content": "I’d like to chime in and say that I agree with timd - I like the snail shell metaphor (but it does bring with it negative connotations, i.e. slowness, moving at a _snail’s_ pace - although personally I didn’t take the ’downward spiral’ from it). However it was the one that stuck out for me as being the logo I noticed first. I think it would benefit from being more organic, rather than being an Illustrator fixed-width spiral path.\n\nSi\n\n"
    },
    {
      "time": " 5.May.2006 5.58am",
      "content": "The trouble is if you present a client with several ideas they will without fail choose the weakest – Sod’s Law. Just grin and bear it, you will face the same situation on many occasions.  \nReading a client’s mind is a matter of getting to know them, find out if they have a sense of design or whether they are looking to you to help them through the process, in which case give them confidence that you know what you are doing. If the company already exists ask them why they are changing their logo (try not to knock it as the client’s eldest probably did it for them) and what elements – colour, typeface, shape– they want to keep. I often look to see what competitor’s logos are like to avoid look-a-likes. When presenting a logo try and show the logo in use in stationery/vehicle livery.\n\n[http://www.amazon.com/gp/product/1581804369/qid=1146833656/sr=1-9/ref=sr...](http://web.archive.org/web/20080208042950/http:/www.amazon.com/gp/product/1581804369/qid=1146833656/sr=1-9/ref=sr_1_9/002-8341577-4047237?s=books&v=glance&n=283155 \"http://www.amazon.com/gp/product/1581804369/qid=1146833656/sr=1-9/ref=sr\\_1\\_9/002-8341577-4047237?s=books&v=glance&n=283155\")\n\nThis book has been recommended to look at.  \nTim\n\n"
    },
    {
      "time": " 5.May.2006 4.06pm",
      "content": "The one with a swirl could be used for anybody. Its not saying anything about portable structures or even the company. And the accompanying font is too weak to survive faxing and web work. A bolder weight maybe. Also the rounded points at the end make it look to heavy for me.  \nAs for the one that looks like red blocks… the idea behind it is good but you really need to make it look more like building blocks or units... so people can get the pun.\n\nTake Care,\n\nMikey\n\nPS... Is that Myriad you are using? Looks great!!! I hope your client loves your work!\n\n"
    },
    {
      "time": " 5.May.2006 7.59pm",
      "content": "I hope I don’t sound rude, coz i aont tryin to be, but, the swirl is a generic shape, and it is saying something about the company, that its portable. The end is to the side on perpose. BUt I see what your saying, it isn’t very strong, given the time I would have worked on it. And I don’t get how you knew it was a pun and then said it make it more clear. And finally the font, I know its bad, but no time was given for me to find a free, san serif font, that doesnt have faults, like most free san serif fonts have. All the fonts I have were given to me when I installled windows, and aboout a few hundred which are more decrotive fonts than anything else.\n\nOnce again, thanks\n\n"
    },
    {
      "time": " 5.May.2006 11.50pm",
      "content": "3dsnail\\>\n\nI don’t think your are being rude. So your okay.\n\nAbout the second logo with the swirl... When I first saw it I immediately thought “Illustrator spring”. I did not even think of a snail until you said that it was but I was objecting to was its vagueness. After all I did not get it. If the shape was more shell like I would liked it very much. Funny though someone said downward spiral- I would have never though that. ;-)\n\nFor the third logo. I had to think about that one, then I caught on that those were supposed to be blocks. So if you added a third dimension and changed the type... It would be like GREAT!\n\nIn other words, the metaphors in both of those logos were too weak for me to grasp instantly. Nothing against you or anything like that. In fact if all of the logos were polished and perfected then you would really have some excellent stuff there.\n\nAs far not having fonts I understand. Microsoft has the most miserable selection of type included with its operating system. But I do like the font you chose for the first one and the last one.... that is a great font.\n\nAnyhow take care,\n\nMikey\n\nPS... I had a design I was playing with maybe you can give me an opinion... search for “Afro Clinic card” and tell me what you think... if you want of course.\n\n"
    },
    {
      "time": " 6.May.2006 2.05am",
      "content": "Opps I forgot... go to fontfont.com and click on the link free fonts... excellent free stuff. MetaPRO for free!!!\n\nEnjoy,\n\nMikey\n\n"
    },
    {
      "time": " 6.May.2006 10.55am",
      "content": "Hey Mikey,  \nCheers for the help. You are spot on I think when you say that it was weak. I dont disagree, just wish I had more time, oh well. Thanks for the website, fontfont. Its pretty good. Seen a few font sites, but they are usually limited and have decrotive fonts, which aren’t my favorite. Also, I thought you was being sarcastic with the myraid font. My teacher would tell anyone off if we used mircosoft fonts, and I thought you was doing the same. My bad, sorry. Andi’ll do a search as soon as I’ve sent this.\n\nCheers, and thanks again.  \n\\>ER\n\nPS - Anyone know of a good font search program, so i can preview my fonts, like font xplorer, thats for free?\n\n"
    },
    {
      "time": " 6.May.2006 2.44pm",
      "content": "Dafont.com is the best!!! You can see the whole entire character set... be prepared to spend some time there, once you start its difficult to stop.\n\n;-)\n\nMikey\n\n"
    },
    {
      "time": " 7.May.2006 2.10pm",
      "content": "I like your first one because in my opinion is the one that best conveys dynamism/movement. Now, Tim’s sugestions are crucial, most of the times it’s not (only) a matter of skills but it’s about the relationship you create with the client and the questions you ask in order to find out what’s in his mind (if anything at all). Having said that, there are many ways you can represent movement... the blurring of the elements is probably the most obvious but you could also try to slice an image into pieces or the repetition of some elements (see Armin Hofmann)...well, good luck with the project, I just gave up a job (I’m still digesting the event) because of an infuriating client, don’t we all hate them?\n\n"
    }
  ]
}
