{
  "id": "19752",
  "title": "Hi I'm a Mac, hi I'm... restarting",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Have you guys seen the cool “Get a Mac” ads on TV?  \nIf not, watch them here: [http://www.apple.com/getamac/ads/](http://web.archive.org/web/20060703163819/http:/www.apple.com/getamac/ads/)\n\n",
  "author": "<a href=\"user/1844\" title=\"View user profile.\">Miguel Sousa</a>",
  "time": "<br>",
  "uid": "1844",
  "comments": [
    {
      "time": " 5 May, 2006 - 7:44am",
      "content": "yeah, let’s get another stereotype again…  \nAdvertising is so stupid.\n\n"
    },
    {
      "time": " 5 May, 2006 - 8:47am",
      "content": "_Advertising is so stupid._  \nbut effective\n\n"
    },
    {
      "time": " 5 May, 2006 - 10:08am",
      "content": "<cite>but effective</cite>  \nWhich tells a lot about target groups (in general).\n\n"
    },
    {
      "time": " 5 May, 2006 - 10:19am",
      "content": "Just put a shiny titanium lid on it, and  \nthe peons will fork over all their dough.\n\nhhp\n\n"
    },
    {
      "time": " 5 May, 2006 - 12:09pm",
      "content": "<cite>Just put a shiny titanium lid on it, and the peons will fork over all their dough.</cite>\n\nYes, a black plastic cover is far superior. I prefer macs for the way they work (although the way they look is a benefit as well).\n\n"
    },
    {
      "time": " 5 May, 2006 - 12:19pm",
      "content": "I advocate not worrying about the cover, just  \nlike I advocate looking beyond the cleavage.\n\n\\> I prefer macs for the way they work\n\nYou’re part of the -commendable- minority.\n\nhhp\n\n"
    },
    {
      "time": " 5 May, 2006 - 1:16pm",
      "content": "Mac shot themselves in the foot when they changed chips. No one has written software for the new chips. Sales in the advertising/graphic design market should drop like a stone.\n\n"
    },
    {
      "time": " 5 May, 2006 - 1:50pm",
      "content": "\\> Mac shot themselves in the foot\n\nI thought they were nuts when they decided to stop putting diskette drives in their computers and go for USB. Look what happened. The Intel chips move may not be as unwise as it looks…\n\n"
    },
    {
      "time": " 5 May, 2006 - 1:51pm",
      "content": "<cite> I advocate looking beyond the cleavage. </cite>\n\nI’m sure they believe you.\n\n"
    },
    {
      "time": " 5 May, 2006 - 2:47pm",
      "content": "Well, admittedly, it certainly doesn’t help when they flaunt it. :-/\n\nhhp\n\n"
    },
    {
      "time": " 5 May, 2006 - 3:41pm",
      "content": "_Mac shot themselves in the foot when they changed chips. No one has written software for the new chips. Sales in the advertising/graphic design market should drop like a stone._\n\nWhat are you talking about? Most of Apple’s software (including Final Cut Studio) is already native, Adobe and Microsoft have committed to supporting it, lot’s of other developers have already shipped native apps, Quark 7 (in beta - out soon) is already native, etc. Most PowerPC apps will run fine on it, albeit not as fast as native.\n\nThe situation is very similar to when Apple moved from 68xxx chips to PowerPC in the mid-nineties. The only problem is that Apple did it more quickly than anyone expected. Developers only learned about it when Apple made the announcement last summer. At that time, they said the new hardware would be shipping within a year. They beat that by six months. It would be nice if Adobe hadn’t decided to wait until the next major version of CS to go native, but I doubt that will be a deal-breaker since Apple’s high-end desktops still run on the G5 and will probably be the last to make the transition to Intel.\n\n"
    },
    {
      "time": " 5 May, 2006 - 4:23pm",
      "content": " ![](http://web.archive.org/files/mac_4250.jpg)\n\n"
    },
    {
      "time": " 5 May, 2006 - 7:52pm",
      "content": "Shot themselves in the foot!?\n\nI think they’re trying to get as many Windows users as possible to cross over to the Mac side. Pretty shrewd, if you ask me… even though, in my humble opinion, they’ve sacrificed having a great OS for a not-so-great OS… The native software will appear, sooner or later.\n\n"
    },
    {
      "time": " 5 May, 2006 - 9:25pm",
      "content": "About the chips\\>\n\nAdmittedly, I wish Apple would have stayed on the PowerPC platform. However IBM nor Motorola were ratcheting up the clock speed fast enough for Apple to compete with the Intel world. I thought when the Cell came out us mac users were gonna get that, but shortly afterwards Apple announced their split from their chip makers. Heck I even wished for the Power 4 to be used in some super duper graphics station but that rumor never came to fruition. And as far as the whole “Apple did it because of the laptops”- I just don’t believe that completely.  \nMotorola had just come out with the MPC8641D it was cool, supported PCI Express and Rapid IO. But the problem was not features- those chips maxed at 1.8 Ghz and it was still a G4 (which is not necessarily  \n bad because G4’s have a slight advantage in the Altivec department). Not good enough for todays marketing ‘standards’. So my opinion is that Apple did it because they have easy access to refreshed chips. Not IBM’s once a year miniscule moves.\n\nPowerPC was special but you know what… its just a chip. Intel is moving very quickly and is Apple and developers. However I will upgrade long after Adobe has converted its product line to Intel.\n\nAs far as the hardware and the OS\\>\n\nThe hardware is very expensive… attractive but expensive. So how I rationalize the price is the OS. Windows XP is a joke. Its stable and smooth until you get it connected to a network. Viruses and spyware galore and mystery slowdowns. ActiveX should die!!! My brother bought a Dell at the same time I got my G5… I have never called tech-support, he calls them all the time. My mac has caused me to restart only once since I’ve had it… I was toying with modem settings while I was dialing and the kernel panicked- big deal and that was over a year ago. Sorry, I’d pay double for a computer that does not put me through hassles and incompatibilities. I respect Windows users for the hardware price thing… I have Windows boxes too but the OS is another story. I have personally lost money with windows!\n\nFrom a typophiles perspective\\> Mac OS X has the best fonts (that you will actually use) included in any OS ever!!! We have Hoefler Text, Neue Helvetica, Cochin, Apple Chancery (which happens to be amazing), Zapfino, Optima, Didot, Bodoni, Palatino, Big Caslon, and American Typewriter to name just a few of the coolest. And what does windows have (cough)… Franklin Gothic Medium.\n\nMikey\n\n"
    },
    {
      "time": " 5 May, 2006 - 11:15pm",
      "content": "We can argue -as too many people have wasted too much time doing since day one- about the pros and cons (don’t get me started about Apple’s true stance on typography) and we can present our deterministic, puny personal experiences and what happened to our cousin’s mom, but the sad fact remains, that compared to what could have been, that in light of what those of us who started in the 70s have seen and have had to go through, truly, both platforms suck cold, hard crap. We’re being swindled, and then convinced to actually enjoy it.\n\nhhp\n\n"
    },
    {
      "time": " 6 May, 2006 - 12:13am",
      "content": "Bring back lisp machines.\n\n"
    },
    {
      "time": " 6 May, 2006 - 12:24am",
      "content": "Hrant\\> I almost agree with everything you said. I have been an Apple user since 1992 and there have been more scandals and set backs at Apple than anywhere in the computer industry. And Apple has dragged its user-base around and around with transitions and phony promises. Hello… the never-ending Type 11 errors right in the middle of a project in Pagemaker.\n\nBut as far Apple’s true stance on typography… perhaps you are alluding to Apple GX technology that they stubbornly never listened to Microsoft that led to the zillion year transition to OpenType that is still having support issues with Mac OSX and Windows? What is Apple’s true stance?\n\nBut as much as Apple has fooled around, the operating system is excellent NOW and for me exceeds my expectations in many ways. Windows just doesn’t do it for me.\n\nMy personal ‘puny’ loss-generating experience with Windows is what I’ll remember the next time I see a Vista add.\n\nMikey\n\n"
    },
    {
      "time": " 6 May, 2006 - 1:33am",
      "content": "Maybe it seems melodramatic and contrived, and maybe it’s even immature, but in the early days there was <cite>something</cite> about having and using a personal computer, something exhilarating concerning the idea itself, something that caused droves of people to be recklessly enthusiatic, and in a way selfless. It wasn’t about clockspeeds or color depths. That spirit is completely and utterly dead now. Maybe there’s something wrong with me, but it makes me cry.\n\nhhp\n\n"
    },
    {
      "time": " 6 May, 2006 - 2:10am",
      "content": "Dude, get a grip ;-)\n\nWhat did you use computers for in the late 1970s, or even the late 1980s? I suspect that you were designing a few of your earliest fonts (the bitmap Armenian and Arabic ones, right?) and also programming.\n\nI don’t know the details of your day job, but you are a programmer now, aren’t you? Sure, computers have become more standardized in the last 30 years. But what do you actually do on your computer? I suspect you work, write, chat with us online, and design and test typefaces. I don’t see the paradigm shift.\n\n"
    },
    {
      "time": " 6 May, 2006 - 5:23pm",
      "content": "Uh-oh. I agree with Hrant about something (“in the early days…”). I believe that’s one of the signs of the coming apocalypse.\n\nI’m not into a general platform wars discussion, but I think Apple made a pretty smart move by going to Intel chips. The transition is a little rough, but they have again done a masterful job of it (as they did with the 68000-to-PowerPC transition).\n\nThat being said, it’s not a great time to buy a MacTel machine, if you’re a graphics professional. I think this transition period for the next year or so will be financially hard for Apple. We’ll just have to see.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 6 May, 2006 - 5:38pm",
      "content": "When will computers exit this primeval stage of industrial design and actually function as they should?\n\nCommand line was much more reliable than any GUI, like it or not.\n\nIf your car broke down every week you would be very angry…\n\npeace\n\n"
    },
    {
      "time": " 6 May, 2006 - 5:53pm",
      "content": "I don’t get it. My Mac does not break down. System X is WAY more stable than the old Mac OSs were. Apple is not coming out with a desktop aimed at the design publishing crowd instanntly anyway. This will give developers time to make software updates. Sure, there will be a slow period for Apple till then but it was a very good move on their part.\n\nChrisL\n\n"
    },
    {
      "time": " 6 May, 2006 - 5:58pm",
      "content": "I heard technology is doubling every ten years. I think it will be about that before computers are twice as good as they are today. But as with things like washing machines, large companies don’t make the best products they are capable of because then they wouldn’t need to be replaced so often so would make fewer sales. This is a very cynical out look but contains faint truths.\n\n"
    },
    {
      "time": " 6 May, 2006 - 8:26pm",
      "content": "And lets not forget Steve Jobs’s reality distortion field.\n\n"
    },
    {
      "time": " 7 May, 2006 - 1:26am",
      "content": "For me the real high point of the macs is OS X and the fact that is (or was)almost virus free.  \nthe thing is that now that OS X is going to be written for intel chips who is going to spend the hard cash on a mac if you can get it to run on a pc that costed you half of the price to put it together??  \nDefinetely not me…  \nAnother side effect is that we are gonna start seeing viruses for macs pretty soon… don’t you think?  \nI don’t know if it was a smart move or a suicidal one, we’ll see…\n\n"
    },
    {
      "time": " 7 May, 2006 - 6:52am",
      "content": "My point is I use Photoshop, Illustrator, InDesign and Corel Painter. I am not willing to wait until the second quarter of 2007 for my applications from Adobe to be written for the Intel Chip. I don’t even know what Corel’s plans are.\n\n"
    },
    {
      "time": " 7 May, 2006 - 10:49am",
      "content": "quote - I am not willing to wait until the second quarter of 2007 for my applications from Adobe to be written for the Intel Chip\n\nAll fine and good but Adobe’s development cycle is typically 18-24 months. So this isn’t that different…\n\nComputers are in the infant stage of industrial design…\n\npeace\n\n"
    },
    {
      "time": " 8 May, 2006 - 2:31am",
      "content": "You’ve all missed the great irony… Apple’s machines are now the fastest Windows boxes shipping. Benchmarks show Windows XP run faster on Apple hardware than they do on traditional PC makers’ boxes. So much for the “platform wars”. The winner is either Apple with Windows or Apple with OS X… take your pick.\n\nCan’t wait for Adobe to ship InDesign for Mac-Intel… just pick up the Windows version and run it on your Mac. What a concept.\n\nFor trivial kicks, Apple also recently announced a move to Samsung chips for iPods. (Go ahead and google “Newton 2” or iPhone, I dare you). Suddenly the idea of Intel chips would mean an easier port to something akin to Windows Pocket PC, where desktop apps are that much more portable.\n\nAs for Intel-Macs, I’m looking forward to buying games that nobody bothered to port to Mac. Gaming on the Mac has been the proverbial bane of the platform. (Doh, I shouldn’t admit to liking fonts AND games, since everybody would know I’m a nerd, bona fide.)\n\nPS - Titus, that comic is tapped into a stereotype from like 1996 (if it weren’t for the circa 1999 ID).\n\n"
    },
    {
      "time": " 8 May, 2006 - 3:17am",
      "content": "Perpetually stuck on the kiddie stuff.  \nWhich is what the money-men want.\n\nhhp\n\n"
    },
    {
      "time": " 8 May, 2006 - 7:51am",
      "content": "Computers don’t have enough personality to love…\n\nJust pick a tool and get on with it.\n\npeace\n\n"
    },
    {
      "time": " 8 May, 2006 - 7:58am",
      "content": "<cite> Perpetually stuck on the kiddie stuff.<br>\nWhich is what the money-men want.</cite>\n\n**So, entertainment= opium for the people (sorry – <cite> peons</cite>)?**\n\nƒ\n\n"
    },
    {
      "time": " 8 May, 2006 - 8:50am",
      "content": "Give them pizza, and give them football, and they will not revolt.  \n(Oh, plus let them vote, so they think it’s their fault.)\n\nhhp\n\n"
    },
    {
      "time": " 8 May, 2006 - 8:57am",
      "content": "Don’t dress like a student  \nDress like an alien  \nmeow\n\n ![](http://web.archive.org/files/alienbootman_4813.jpg)\n\n"
    },
    {
      "time": " 8 May, 2006 - 9:09am",
      "content": "George Foreman Lean Mean Cat Reducing Grilling Machine:)  \nTim\n\n"
    },
    {
      "time": " 8 May, 2006 - 11:38am",
      "content": "joe pemberton is probably right. i’m looking into getting a macbook pro this autumn (only using winXP, im not interested in an OS-switch), just because with my students discount of 19%, they’re offering the cheapest laptops for what i want (a strong workhorse machine, i’ll put 2GB ram in it). even dell costs more (and i think high of dell laptops, only know one unhappy customer out of 20 or 30 or so).\n\ni know, there’s really no sense in discussing such stuff (again.. and again.. and again..), but i’ll do it anyway. i work every day with osx and use winXP at home. osx is ok, but it has some things in it that are just NOT user-friendly and dont work as good as they do in xp.\n\nboth OS have their pro and cons, and with a firewall (router) and a good and up-to-date AV-program, xp is as safe as osx.\n\n(and eh.. to stay ontopic, i dont really like the ads. its just the usual marketing-BS you hear from any mac-fanboy, most of it not true or unimportant if you’re not a stupid user)\n\n"
    },
    {
      "time": " 8 May, 2006 - 1:07pm",
      "content": "Viva letterpress!\n\n"
    },
    {
      "time": " 8 May, 2006 - 1:26pm",
      "content": "kesh… what are those thing that are not user friendly in OSX ???\n\nMikey\n\n"
    },
    {
      "time": " 8 May, 2006 - 1:36pm",
      "content": "for example: you cannot use your keyboard to select an answer in dialog boxes (“save / save as / no / cancel” or such), you just have a few shortcuts that stay the same all the time (apple+. for cancel). in winxp, you can just press arrow-left / arrow-right and enter to select an answer.\n\nor? in finder, you dont have a permanent adress-line (like the field you can enter the url in in a webbrowser). in winXP, you have it, so you can easily copy adresses on your local computer (folders). sure, you have drag&drop with the folder-name in the top-bar of finder, but it just doesnt work as easy as it does in winXP.\n\nor? i cant directly select an instance of a program (like one window of finder) like in windows, you have to go to finder and then press apple+\\ (i think thats what on the american keyboard at that place) to switch instances.\n\njust three points. as said, discussions about this wont lead to any result or insight on any side, lets just forget about it.\n\n"
    },
    {
      "time": " 8 May, 2006 - 11:04pm",
      "content": "Viva letterpress!\n\nNow that is funny! Actually though most studio-letterpress printers today utilize the computer as per the photopolymer plate process and most of the folks engaged in this regard do use Macs.\n\nSomeone asked what computers existed in the 1970s? Main frames mostly, but mini computers were introduced in the mid-1970s. I was employed as an information retrieval specialist searching online information databases. No GUI. And the first one I ever saw, on a Mac Plus, well, that sort of sold me on on Apple, I hated code (I refuse to use Terminal). The main difference between Apple and Microsoft is that Apple has an R&D department.\n\nGerald\n\n"
    },
    {
      "time": " 9 May, 2006 - 12:00am",
      "content": "Beiler\\> I could not agree more. If Apple does it today, Microsoft will copy it tommorow.\n\nMikey\n\n"
    },
    {
      "time": " 9 May, 2006 - 1:32am",
      "content": "Chalkboard….\n\n"
    },
    {
      "time": " 9 May, 2006 - 1:50am",
      "content": " **More cats on computers! This graphic piece of fluff prefers Mac.**\n\nI am a kitten… <cite>miaow</cite>\n\nƒ\n\n ![](http://web.archive.org/files/DSCN0436_typo_4592.jpg)\n\n"
    },
    {
      "time": " 9 May, 2006 - 2:16am",
      "content": "fredo\\> Cute cat! My cat loves to interfere- I mean help when I’m working too.\n\nMikey\n\n"
    },
    {
      "time": " 9 May, 2006 - 3:46am",
      "content": "I sold my Devon Rex for a Mac.. what was I thinking..\n\n ![](http://web.archive.org/files/gia_04_4182.gif)\n\n"
    },
    {
      "time": " 9 May, 2006 - 7:11am",
      "content": "Vincent,  \nWho is that women?\n\nChrisL\n\n"
    },
    {
      "time": " 9 May, 2006 - 7:45am",
      "content": "this is Gia Milinovich, that is rocky and that is my little toy Mac G4 bookie…\n\n[http://www.sueridermanagement.co.uk/presenters/Gia/gia.htm](http://web.archive.org/web/20060703163819/http:/www.sueridermanagement.co.uk/presenters/Gia/gia.htm)\n\n"
    },
    {
      "time": " 9 May, 2006 - 8:15am",
      "content": "Use whatever tools work best for you.\n\n"
    },
    {
      "time": " 9 May, 2006 - 8:29am",
      "content": "I’m right there with you… I learned on an Apple G4, graduated, got a job that was PC based only (i.e. Dell everywhere)… relearned all the shortcuts, purchased an Acer Laptop, borrowed all the office’s software and have been missing that Apple experience ever since.\n\nI agree there are things you can do on a PC that you can’t quite do (as well) on an Apple, but now, it’s the best of both worlds. I can get an Intel-Mac boot up Windows XP, load all my “borrowed” software, and still have that Apple experience… all on one machine.\n\nI’m in no hurry,I’ll wait for the next generation of Intel-Macs so I know the bugs are worked out and off I go, back in the Apple Experience. I don’t understand this rush to get the “newest” if all you’re going to do is bitch. Go to the Deals section at Apple and get one of the leftover PowerPCs, hold out till all the software is updated to match the hardware then purchase a new Apple. Hell Adobe isn’t releasing any new versions of their design suite till this time next year, what’s the rush?\n\n"
    },
    {
      "time": " 9 May, 2006 - 10:46am",
      "content": "Thanks Vincent. I didn’t realize she was a TV personality. Are her shows only seen in the UK?\n\nChrisL\n\n"
    },
    {
      "time": " 9 May, 2006 - 11:24am",
      "content": "Gia makes this website for Danny Boyle’s next movie.\n\n[http://www.sunshinedna.com/](http://web.archive.org/web/20060703163819/http:/www.sunshinedna.com/)\n\nShe has a blog..\n\n[http://www.giagia.co.uk](http://web.archive.org/web/20060703163819/http:/www.giagia.co.uk/)\n\nand She is in London and yes UK but might write a book for other countries soon. And we might have a secret project with me in the future, I’ll be shooting it and she is managing it.\n\n"
    }
  ]
}
