{
  "id": "19756",
  "title": "Miss dem ol' swash & alternates",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was just leafing through some of my old pre-Postscript specimen books and got nostalgic about some of the swash and alternate characters that got dropped during the initial conversions to Postscript.\n\nWith OpenType advanced features, many typefaces are becoming available with for use with alternates. Just thought I’d show you a few of the alternates that have been stash in the vaults... maybe they will make their way back.\n\nAll of these faces are currently available in digital format in one form or another. Please excuse some slight distortions as they were scanned from thickly bound books.\n\nThought some of you might have some fun just trying to identify their parent typefaces. (Samples added below)\n\n [‹ the shadow faux-pas](http://web.archive.org/web/20080119125328/http:/typophile.com/node/35409 \"Go to previous forum topic\") [Grapevine/vine typeface ›](http://web.archive.org/web/20080119125328/http:/typophile.com/node/35382 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080119125328/http://typophile.com/user/7764\" title=\"View user profile.\">Norbert Florendo</a>",
  "time": "<br>",
  "uid": "7764",
  "comments": [
    {
      "time": " 5.May.2006 12.09pm",
      "content": "1)\n\n ![](http://web.archive.org/web/20080119125328im_/http:/typophile.com/files/1_alts_6268.png)\n\n2)\n\n ![](http://web.archive.org/web/20080119125328im_/http:/typophile.com/files/2_alts2_3556.png)\n\n3)\n\n ![](http://web.archive.org/web/20080119125328im_/http:/typophile.com/files/3_alts_6288.png)\n\n4)\n\n ![](http://web.archive.org/web/20080119125328im_/http:/typophile.com/files/4_alts_5729.png)\n\n5)\n\n ![](http://web.archive.org/web/20080119125328im_/http:/typophile.com/files/5_alts_5080.png)\n\n6)\n\n ![](http://web.archive.org/web/20080119125328im_/http:/typophile.com/files/6_alts_5709.png)\n\n"
    },
    {
      "time": " 5.May.2006 12.26pm",
      "content": "1) ITC Galliard. Alts available in the [Carter & Cone](http://web.archive.org/web/20080119125328/http:/www.fontshop.com/showfont.cfm?fid=CA.6675.0.0) version.\n\n ![](http://web.archive.org/web/20080119125328im_/http:/typophile.com/files/FOM-Galliard_02_3754.gif)\n\nFrom the (now out-of-print) Newstoday Typecase:\n\nWith its sculpted majuscules and sparkling contrast, Matthew Carter’s ITC Galliard is commonly regarded as the king of elegant text faces. But many are unaware of the Carter & Cone version which expounds on the baroque beauty, adding flourished alternates to both roman and italic.\n\n"
    },
    {
      "time": " 5.May.2006 12.43pm",
      "content": "3) Goudy  \n5) Times (eww, I hope I’m wrong)\n\n"
    },
    {
      "time": " 5.May.2006 12.48pm",
      "content": "Naw, 5 can’t be Times. Terms are wrong.\n\n"
    },
    {
      "time": " 5.May.2006 12.57pm",
      "content": "\\> _1) ITC Galliard._   \nYup... you’re right Stephen. Ain’t they gorgeous!\n\n\\> _3) Goudy_  \nRight, Tiffany!\n\n\\> _5) Times (eww, I hope I’m wrong)_  \nRight, you’re wrong, Tiffany.\n\nTalk about nostalgia, we’re heading off right now to see [Peter, Paul & Mary](http://web.archive.org/web/20080119125328/http:/www.peterpaulandmary.com/) in concert. So I won’t be able to respond to IDs until early Saturday. Would you like some guesses, ’cause some are a little tough.\n\n"
    },
    {
      "time": " 5.May.2006 1.07pm",
      "content": "Hints...\n\n2) Sherlock versus the Fishman.\n\n4) This one’s a bear.\n\n5) Is it Tom, Dick or Harry?\n\n6) An old metal revival craftily done.\n\n"
    },
    {
      "time": " 5.May.2006 1.21pm",
      "content": "4. Kabel. Not sure how the bear comes in.\n\n"
    },
    {
      "time": " 5.May.2006 1.42pm",
      "content": "\\> _4. Kabel. Not sure how the bear comes in._\n\nNope... and believe me, the _bear_ does come in! ;-)\n\nMore hints…\n\n2) Based on forms in _Book of Kells_ and named after a town in the Emerald Isles.\n\n4) This one’s still a bear.\n\n5) It can only be Tom, Dick or Harry!\n\n6) An artsy old face.\n\nTa-ta for now... off to the Peter, Paul & Mary concert. Now where’s my hammer?\n\n"
    },
    {
      "time": " 5.May.2006 1.50pm",
      "content": "4. Koch?\n\n"
    },
    {
      "time": " 5.May.2006 1.58pm",
      "content": "5) Tom’s Roman\n\n"
    },
    {
      "time": " 5.May.2006 2.02pm",
      "content": "Stewf I think you are right about (4) being Kabel. Bear, as in Kabel Black or a Black bear.\n\n"
    },
    {
      "time": " 5.May.2006 2.32pm",
      "content": "5. ITC Grizzly (Stephen, you were _this_ close!)\n\n6. Artcraft\n\n(I should probably be disqualified for my age.)\n\n2. looks familiar, but I don’t know it off the top of my head.\n\n"
    },
    {
      "time": " 5.May.2006 3.04pm",
      "content": ":^P Sheesh I was _really_ reaching.\n\nI think you meant (4) Mark.\n\n"
    },
    {
      "time": " 5.May.2006 3.08pm",
      "content": "See, I said I should probably be disqualified for my age. ;-)\n\n"
    },
    {
      "time": " 5.May.2006 3.11pm",
      "content": "Oh, I remember now. It’s gotta be:\n\n2. Shannon\n\nIt was on the tip of my tongue. Sneaky of you to throw in an old CG font, Norbert.\n\n"
    },
    {
      "time": " 5.May.2006 8.02pm",
      "content": "Nice samples, Norbert.\n\n_ITC Grizzly_\n\nExcept in Typophile’s [Type Battles](http://web.archive.org/web/20080119125328/http:/typophile.com/node/17477), I don’t think I had ever seen a sans with swashes... ;-) There is always new stuff to learn.\n\n:-)\n\n"
    },
    {
      "time": " 5.May.2006 9.48pm",
      "content": "Yup... all identified.\n\n1) Matthew Carter’s ITC Galliard  \n2) [Shannon](http://web.archive.org/web/20080119125328/http:/www.myfonts.com/fonts/agfa/shannon/), a CG exclusive by Kris Holmes and Janice Prescott Fishman. The initial forms were based on the [_Book of Kells_](http://web.archive.org/web/20080119125328/http:/www.bookofkells.com/book.html) and expanded in several weights using IKARUS (now from [URW++](http://web.archive.org/web/20080119125328/http:/www.myfonts.com/Article892.html)) interpolations.  \n3) Goudy  \n4) [ITC Grizzly](http://web.archive.org/web/20080119125328/http:/www.myfonts.com/fonts/bitstream/itc-grizzly/) (I told you it was a bear) by Tom Carnase and Ronne Bonder.  \n5) [Tom’s Roman](http://web.archive.org/web/20080119125328/http:/www.myfonts.com/fonts/bitstream/itc-toms-roman/) also by Tom Carnase and Ronne Bonder.  \n6) [Artcraft](http://web.archive.org/web/20080119125328/http:/www.myfonts.com/fonts/urw/artcraft/)... yes, it helps to be “old” to remember this one.\n\nOne of my personal favorite type families (because of its eccentric qualities) is Goudy Sans, which at one point had more swash and alternate characters than ITC Avant Garde Gothic. Somewhere in my dusty vault I have specimens, but these characters were “axed” long ago when CG first licensed Goudy Sans to ITC, then subsequently Monotype took claim of licensing. Not sure if the lost alternates will ever be released again :-(\n\n"
    },
    {
      "time": " 6.May.2006 10.35am",
      "content": "Did CG do any marketing of Goudy Sans before it was licensed to ITC? I’m wondering if there may have been ads in, say, U&lc. that would show the lost characters. I’ve got nearly every issue.\n\n"
    },
    {
      "time": " 6.May.2006 10.41am",
      "content": "Norbert, I went through a phase of loving Goudy Sans. Then I decided I didn’t like it because it was too feminine and couldn’t be used for more than very specific jobs. However, a few years ago I saw a letterpressed invitation which used it. It was gorgeous. Now I’ve been waiting for the opportunity to use it again.\n\nI’d love to see the swashes I hope you can find the specimens.\n\n(I should add that I think it was the fact that it was letterpressed that gave it new life for me.)\n\n"
    },
    {
      "time": " 6.May.2006 3.54pm",
      "content": "I quite like Goudy Sans, myself.\n\nDidn’t Monotype essentially merge with Compugraphic when Agfa acquired Monotype? I wonder if MT still has the rights to the CG stuff now that they’re a separate company from Agfa. They certainly have the ITC rights. It could be that everything needed is all in one place. Mind you, Goudy Sans doesn’t seem to be terribly popular, so I don’t know how worthwhile it would be for them.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 6.May.2006 4.38pm",
      "content": "_Not sure if the lost alternates will ever be released again :-(_\n\ni’m sure you will!!! and fairly soon, i’d wager.\n\n"
    },
    {
      "time": " 6.May.2006 7.32pm",
      "content": "\\> _i’m sure you will!!! and fairly soon, i’d wager._\n\nPromises, promises... Paul.\n\nRight now I’m going ballistic since I’m having trouble copying sample files on Goudy Sans off one of my old Macs which is not connected to the network. Disk and zip drives coughing, no email, what a dinosaur!\n\nI’ve written a brief summary of Goudy Sans alternates with a few samples if I can get the images off this old Mac.\n\n\\> _Goudy Sans doesn’t seem to be terribly popular_  \nIt’s really an odd face with few applications, and I’ve hardly ever used it myself despite my affection for it. But it has been very visible here in the Northeast and has been used for POP store displays and table cards for a large coffee franchise.\n\n"
    },
    {
      "time": " 6.May.2006 9.22pm",
      "content": "From what I recall (strictly from memory... somewhere, sometime I’ll find my old notes if I didn’t trash them), between 1982—1986 Compugraphic launched a major push to improve its digital library to support the high-end MCS Digital Imagesetters. This included significant cleanup of the older “CG-lookalike” faces in favor of licensing from originating foundries, release of exclusive designs like Shannon, Garth Graphic, Pasquale and a whole series of revivals which included Goudy Sans, Albertus, Hadriano, Schneidler (these previous four families were release between 1982-83) and more.\n\nIn 1982 we also launched an aggressive ad campaign and produced a special series of 11 x 17 “Type Release” posters for what we felt were high-profile families, in fact, twenty in all. I remember when doing the Goudy Sans poster (the backs had full character specimen samples) that I was amazed by all the cap swash alternates. The family was comprised of six faces — Light, Light Italic, Medium, Medium Italic, Bold and Extrabold.\n\n ![](http://web.archive.org/web/20080119125328im_/http:/typophile.com/files/gs-postr3_6122.png)\n  \nAll I can find so far is a smaller repro of only the front of the original Goudy Sans poster (shown above). On the back of the original poster there was full specimen showings of all available characters, though there may have been sample showings in a mid-eighties CG big type book.\n\nDuring the mid-to-late eighties, I got the word to “retire” the CG version of Goudy Sans, to be replaced by ITC Goudy Sans. This version had no alternates, and from what is written in the huge 1994 _Agfa Type Reference Book for PostScript Users_ is “Designed by Fredric [Frederic] Goudy in 1929 and released by Elsener [Elsner] and Flake in 1986.” Though on the [Elsner+Flake](http://web.archive.org/web/20080119125328/https:/ssl.kundenserver.de/www.elsner-flake-shop.com/sess/utn;jsessionid=15445d738e4c121/shopdata/product_search.shopscript?query=goudy%20sans&search_logical=and&content=suche&page=1&Filename=gsbk ____.ttf&Code=EF1621-1&Family=Goudy%20Sans&Weight=Book&Layout=Text%20West&Designer=ITC%20Design%20Staff/Frederic%20W.%20Goudy&DesignYear=19,861,929&Trademark=International%20Typeface%20Corporation&content_kopf=fontvorschau&pattern=&startitem=0) site, they attribute it to the ITC Design Staff. The ITC version had four weights with corresponding italics — Book & Italics, Medium & Italics, Bold & Italics, and Black & Italics.\n\nBy the late eighties, CG and Monotype had established a relationship, and many more CG faces were “retired” and replaced by licensed versions directly from Monotype. You can see from the specimens shown below (from 1990 _Agfa Type Book_) that Goudy Sans retained a few alternates. (Thick book hard to flatten on scanner.)\n\n ![](http://web.archive.org/web/20080119125328im_/http:/typophile.com/files/gs-MT3_5633.png)\n\n"
    },
    {
      "time": " 8.May.2006 3.38pm",
      "content": "I think the ITC Goudy Sans Black Italic is especially beautiful - was this part of Goudy’s original family, or a later addition?\n\n ![](http://web.archive.org/web/20080119125328im_/http:/typophile.com/files/doodaubs_4821.jpg)\n\n"
    },
    {
      "time": " 24.Jul.2007 1.28pm",
      "content": "Norbert, do you have a poster or something else that shows swashes for ITC Tiffany? My old ITC brochure doesn’t show them, but I know they existed...once.\n\n"
    },
    {
      "time": " 24.Jul.2007 4.56pm",
      "content": "Christopher —  \nfrom what I can see in the 1980 [ITC Typeface Collection](http://web.archive.org/web/20080119125328/http:/www.amazon.com/gp/offer-listing/B000Q30HDG/sr=1-3/qid=1185320536/ref=olp_tab_used/105-2019183-6079623?ie=UTF8&coliid=&qid=1185320536&sr=1-3&seller=&colid=&condition=used) (Big Black Book), Tiffany did not have many alternates. The 1980 Letraset Type Catalog also bears this out, showing the same alternates:\n\nLowercase e and k  \nUppercase J, K and R\n\nEach of which only shows the _exclusion_ of the definitive Tiffany spurs pictured below.\n\n ![](http://web.archive.org/web/20080119125328im_/http:/typophile.com/files/Tiffany_spur_5637.png)\n\n"
    }
  ]
}
