{
  "id": "19766",
  "title": "LTC Californian",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've been looking at [ITC Berkeley](http://web.archive.org/web/20150123173538/http:/typophile.com/wiki/ITC%20Berkeley) Oldstyle. I think that's what the British Harry Potter books are set in and I've been reading a lot of them with my son recently. (Let me know if I'm wrong). That led me to FB [Californian](http://web.archive.org/web/20150123173538/http:/typophile.com/wiki/Californian) and then LTC Californian. There's a discussion in the archives ( [http://typophile.com/node/3077](http://web.archive.org/web/20150123173538/http:/typophile.com/node/3077 \"http://typophile.com/node/3077\")) comparing Berkeley and FB Californian, with some talk about the LTC version, which wasn't actually released at the time. It now is released, in Opentype and at a very good price ( [www.lanstontype.com](http://web.archive.org/web/20150123173538/http:/www.lanstontype.com/ \"www.lanstontype.com\")). Has anyone used it? Have an opinion to share?\n\nThe consensus in the earlier thread seemed to be that ITC Berkeley was relatively sanitized, FB truer to the original Goudy design and more 'quirky'. The LTC version claims to be closest to the original and looks beautiful on the Lanston PDFs.\n\n",
  "author": "Toby Macklin",
  "time": "6 May 2006 — 8:29am",
  "uid": "12360",
  "comments": [
    {
      "time": "6 May 2006 — 10:07am",
      "content": "i'm partial to LTC Californian, but that's because i digitized it. the advantage of this Californian is that it is in OT format and supports a full Central European Characterset. I still love Californian FB and the advantage I see to this set is that you have a much greater range of weights/styles. I'd love to expand our LTC family to include cyrillics and more weights, and we may do that if we get enough interest in this type family. i prefer both versions of californian to berkely.\n\n"
    },
    {
      "time": "7 May 2006 — 7:53am",
      "content": "I have seen a lot of the two other (ITC and FB) \"Californian\" efforts, and I think they look pretty good on their own merits, but if a person wants Californain true to the origianl it would be hard to beat P22's LTC Californian, since it was digitized directly from newsprint proofs of the patterns which Goudy made with his own hands.\n\nFor today's useage I guess it is expedient to supply at least one bolder version, but it would be hard work to make one that comes up to the earthiness of the original. In Goudy's book \"Typologia\" there are large point size specimens of both the roman and italic, which show clearly the wonderful grittiness of his original, since these were proofed from the lead patterns retrieved from the Lanston Monotype works shortly after the designers workshop (Deepdene) was wiped out by the fire.\n\nJim\n\n"
    },
    {
      "time": "7 May 2006 — 9:54am",
      "content": "Speaking of LTC Goudy stuff, a design faculty person recently pointed out that he couldn't stand the lc \"a\" in Kennerley. I actually saw something in it that I liked, and drew a lc \"a\" over a large undercooked burger off of Harvard Square the following day. But my main question is, now that I'm taking a closer look, is the LTC version\\* sanitized, or is the Berthold version\\*\\* just plain wrong?\n\n\\* [http://www.myfonts.com/fonts/lanston/ltc-kennerley/regular/mac-t1/294500...](http://web.archive.org/web/20150123173538/http:/www.myfonts.com/fonts/lanston/ltc-kennerley/regular/mac-t1/294500/character/0061/CP4/1/ \"http://www.myfonts.com/fonts/lanston/ltc-kennerley/regular/mac-t1/294500/character/0061/CP4/1/\")\n\n\\*\\* [http://www.myfonts.com/fonts/berthold/kennerley-bq/regular/mac-t1/300173...](http://web.archive.org/web/20150123173538/http:/www.myfonts.com/fonts/berthold/kennerley-bq/regular/mac-t1/300173/character/0061/CP4/1/ \"http://www.myfonts.com/fonts/berthold/kennerley-bq/regular/mac-t1/300173/character/0061/CP4/1/\")\n\nhhp\n\n"
    },
    {
      "time": "19 May 2006 — 8:11am",
      "content": "looking at the original \"a\", i could see how you could get both variations, especially if you're referring to smaller sizes. however, i have to agree that the LTC version is more sanitized.\n\n"
    },
    {
      "time": "19 May 2006 — 9:02am",
      "content": "I don't think santized is the right word. I'd say LTC is designed from the metal and perhaps Berthold from the print. Which is a great debate anyway.\n\n"
    }
  ]
}
