{
  "id": "19761",
  "title": "Study of Web Fonts Released",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20080208042956/http:/typophile.com/user/108 \"View user profile.\") : 5.May.2006 2.45pm \n\n- - - - -\n\nFor Immediate Release:\n\n_Ascender Corporation announces of a study of over 4500 free and shareware fonts commonly found on the Internet. This is the first study of its kind and it identified significant quality issues with these fonts and their diminished viability for use in ideas being considered by the W3C for new Cascading Style Sheets (CSS) recommendations._\n\nElk Grove Village, IL — May 8, 2006 — Ascender Corporation, a leading provider of advanced font products today announced the release of a study of free and shareware fonts that can be found on the web. The study analyzed over 4500 TrueType® fonts that can be downloaded by Macintosh®, Windows® and Linux® users to determine their viability for use in ideas being considered by the W3C for linking downloadable fonts to web pages as part of the Cascading Style Sheets (CSS) specification.\n\nThere are three primary issues with free/shareware fonts: technical, aesthetic and Intellectual Property (IP). This report addressed only the technical issues and not any of the aesthetic or IP issues that relate to the often dubious origins of many free fonts.\n\nThe study found that out of the 4572 fonts tested, 4385 fonts (95.9%) failed one or more of six tests that were performed. The tests checked the fonts to ensure proper character sets, trademark and copyright strings, TrueType hinting tables, and font embedding setting. The TrueType and OpenType® font formats were referenced by Ascender in its analysis of each of these important font features.\n\nThe test results were as follows:  \n• Code Page 1252 character set — 80.8% failed (missing one or more characters)  \n• Mac Roman character set — 95.9% failed (missing one or more characters)  \n• Trademark string — 1.7% failed (missing a trademark string)  \n• Copyright string — 68.9% failed (missing a copyright string)  \n• Proper TrueType hinting tables - 8.9% failed (had improper/incomplete tables)  \n• Embedding bit — 30.3% failed (bit set to “Restricted” or improper fsType bit)\n\n“As the W3C and other stakeholders in the web design and type community evaluate various ideas to improve fonts on the web, we felt it was important to identify the quality and integrity issues associated with free and shareware fonts” said Bill Davis, the study’s author. “The vast majority of these fonts have significant problems that would preclude their use in any serious or commercial manner.”\n\nThe Ascender team was involved in developing the most popular fonts used on the web today, including Mac OS X and Windows system fonts. Ascender is recognized as experts in creating TrueType and OpenType fonts, and knowledgeable in the myriad of issues involved with designing and developing fonts for on-screen reading and use on the web. Ascender undertook this study to help the public and web community better understand the issues with fonts on the web.\n\nCopies of the study are available at no charge from the Ascender Corp. website at: [http://www.ascendercorp.com/webfontstudy.html](http://web.archive.org/web/20080208042956/http:/www.ascendercorp.com/webfontstudy.html \"http://www.ascendercorp.com/webfontstudy.html\")\n\nAbout Ascender  \nAscender® Corporation is a leading provider of advanced font products specializing in type design, font development and licensing. Ascender’s founders are font industry experts and have been involved in developing some of the most important and influential fonts used in computers and mobile devices. Ascender provides multilingual, custom font development for a wide range of customers including creative professionals, enterprises and hardware & software developers. Ascender also provides fonts for download to graphic designers and consumers through the Ascender Font Store website.\n\nAscender Corporation | [http://www.ascendercorp.com](http://web.archive.org/web/20080208042956/http:/www.ascendercorp.com/ \"http://www.ascendercorp.com\")  \n25 Northwest Point Blvd • Suite 975 • Elk Grove Village, IL 60007 • USA  \nPhone: (847) 357 0730 • Fax: (847) 357 0731\n\n",
  "author": "<a href=\"http://web.archive.org/web/20080208042956/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 5.May.2006 2.45pm",
  "uid": "108",
  "comments": [

  ]
}
