{
  "id": "1976",
  "title": "ZedaSoft logo font is unknown",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Greetings,   \n   \n Our logo was designed by a web designer who is overseas and unavailable. We have tried whatthefont.com and other font identification services, but have been unable to find a match. We aren't sure whether he used an existing font or photoshopped the letters of another font to create our logo.   \n   \n We would like to use this font within our company to tie our products with the company.   \n   \n   \n Thanks in advance,   \n   \nSteve Tarter   \nZedaSoft, Inc ( [http://www.zedasoft.com](http://web.archive.org/web/20050518051032/http:/www.zedasoft.com/))   \n   \n ![ZedaSoft Logo](http://web.archive.org/web/20050518051032im_/http:/www.typophile.com/forums/messages/83/20011.jpg)\n\n",
  "author": "stevetarter",
  "time": "Fri, 2003-11-07 10:13",
  "uid": "2596",
  "comments": [
    {
      "time": " Fri, 2003-11-07 10:21",
      "content": "bureau agency (streched and squished?)   \nhttp://fontbureau.com/fonts/font\\_frames.tpl?cart=106822568811822551&fontname=AgencyFB\n\n"
    },
    {
      "time": " Fri, 2003-11-07 10:31",
      "content": "Nevermind, that's wrong. The A is way off.\n\n"
    },
    {
      "time": " Fri, 2003-11-07 10:56",
      "content": "I don't have the time to check, but...   \nDisregarding the \"A\", the other characters   \nare very characteristic of FB Agency.\n\n"
    },
    {
      "time": " Fri, 2003-11-07 12:05",
      "content": "I disagree about Agency, because it uses a monotone stroke. This typeface is unevenly weighted. It might be worth trying to match the S first, because the A might be a fabrication, like an inverted U. (I was originally trying to help Steve separately, and recommended that he try this board, because the best I could come up with was using letters from Red Rooster's [Europa Grotesque](http://web.archive.org/web/20050518051032/http:/www.philsfonts.com/detail.html?sku=RR00005103P2), and of course slanting them.) I know how font multilations offend Yves, but I couldn't find anything closer. I thought maybe one of you would be more up on the Tech-ish fonts.\n\n"
    },
    {
      "time": " Fri, 2003-11-07 13:10",
      "content": "though if you were to take agency and stretch the crap out of it, the stroke proportions change. See example.   \n   \n ![stretch](http://web.archive.org/web/20050518051032im_/http:/www.typophile.com/forums/messages/83/20035.gif)\n\n"
    },
    {
      "time": " Fri, 2003-11-07 13:25",
      "content": "That goes a long way to make your point. And I guess if you did it with Agency Condensed, the relative thickness of the vertical strokes would get even more pronounced. And I see that there is an alternate A that looks more like the original. I think I am agreeing with you now. Did you use Regular or Bold weight, and Normal width?\n\n"
    },
    {
      "time": " Fri, 2003-11-07 13:32",
      "content": "I used bold.   \n   \nIt could also be chanks nicotine perhaps?\n\n"
    },
    {
      "time": " Fri, 2003-11-07 13:44",
      "content": "Third time's the charm:   \n   \n [raleigh gothic](http://web.archive.org/web/20050518051032/http:/www.myfonts.com/fonts/redrooster/raleigh-gothic-rr/). I think this is the best match (with a few tweaks).\n\n"
    },
    {
      "time": " Fri, 2003-11-07 15:01",
      "content": "Here's the comparison with Raleigh Gothic Condensed Medium with the S outline tweaked (the strokes weren't long enough in its original form). The 'lower case' letters were a smaller size and then made 90% height to make the relative proportions closer. All the letters are 300% width. The bottom image is my simulation with Raleigh Condensed. ![ZedaSoftSimulation](http://web.archive.org/web/20050518051032im_/http:/www.typophile.com/forums/messages/83/20044.gif)\n\n"
    },
    {
      "time": " Fri, 2003-11-07 15:17",
      "content": "After looking at the one Karl did with Agency, I think that might actually be a better approximation, if he would use the alternate A, since he didn't need to alter the S. The letter corners look better in the Agency version, I think.   \n   \nWhat does Steve think?\n\n"
    },
    {
      "time": " Fri, 2003-11-07 15:21",
      "content": "Mike, now you know why I hate the fact you can condense and expand letterforms. They loose the designers original intention, putting stress on vertical and horizontal strokes that make the type designers here cringe. It looks that you have a good solution, I bet the example was scanned softly or it was a scan of a printed piece. A couple of generations from the original. Dan\n\n"
    },
    {
      "time": " Fri, 2003-11-07 16:00",
      "content": "Wow. I'm bowled over. I can't thank you guys enough for helping us with this.   \n   \nWe are now discussing whether it would be easier to switch our logo to one of these \"close\" fonts, or look for someone to create our font by modifying Agency or one of the others.   \n   \nThe web developer that created the logo was known for creating button images using MicroSoft Paint and filling them out a pixel at a time. If I didn't see that, I wouldn't have believed it. I do remember him looking through some fonts while creating the logo, so I was hopeful that it wasn't a mix or a free-hand effort.   \n   \nThe head hauncho is travelling today, so we can't come to a final decision today. I think he'll be pretty happy with the progress you all have helped us make.   \n   \nAgain, thank you all, and I'll be back in touch after the weekend.   \n   \n   \nSteve\n\n"
    },
    {
      "time": " Fri, 2003-11-07 16:28",
      "content": "Steve, I have an idea, reinvent your marketing postition, make it fresh and new and use an indie font, the way it was designed or have a type designer create a CI for you. Remember the saying when one door closes another opens, use this to your advantage. Dan\n\n"
    },
    {
      "time": " Fri, 2003-11-07 16:47",
      "content": "Dan, what you say is true, but the designer's original intention is not the end user's main concern. A graphics program gives anyone the means to build from a font in almost any way their job requires. Do you think the folks at Google worried if Gustav Jaeger was going to be bothered by his 'Catull' becoming three dimensional with highlights when they used it for their logo? Sometimes such 'massaging' improves the original work, whose letterforms or kerning pairs were not well planned. Sometimes it just helps you to fit the space you have, but isn't that within the user's license? You can say the end result is ugly, but that is the risk the tamperer takes. What if it's better?   \n   \nFor what it's worth I sympathize with the idea that fonts should be used as designed. I play with them when someone wants to match a font I can't find, or that was a custom design no one has any more. I play with them when a customer says 'can't you fix that 't'?'\n\n"
    },
    {
      "time": " Fri, 2003-11-07 16:56",
      "content": "Mike, I feel that there is a huge amount of lazieness. Its so easy to mash or bash a type style, why bother do, like you are doing, catalog and create a library of type designs that can be accessed. Its like the quote I used on the T-shirt contest \"I haven't heard from him last year, and I haven't heard from him from him this year and if I don't hear from him next year, I'm going to write him a letter\". The point being people won't spend the time for good design when they can do it quickly. So sad, Dan\n\n"
    }
  ]
}
