{
  "id": "19779",
  "title": "The best fonts you can't have...",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Okay folks! Here are three of my favorites that you can't have. These are unreleased- and most likely, will never be released- fonts that rock my little typographic socks.\n\nVolvo Sans... used on all Volvo controls and switches. Its like Handel Gothic only more swedish-er.\n\n ![](http://web.archive.org/web/20150424044122im_/http:/typophile.com/files/001_4215.jpg)\n\nBloomindales... This swanky typeface has been strutting its stuff while the folks who made Chalet were not even born yet. [And no, Horatio doesn't cut the mustard]\n\n ![](http://web.archive.org/web/20150424044122im_/http:/typophile.com/files/header_bags_5019.jpg)\n\nLumene Script from Suomi... This is my favorite handwriting font ever! Perhaps when Lumene Cosmetics will change campaigns will then we have access to this genius face. Think of it as Emma Script with less caffeine. Plz Script is a significantly less refined alternative however the up-and-coming Suomi Script would be fascinating.\n\n ![](http://web.archive.org/web/20150424044122im_/http:/typophile.com/files/Lumene_6099.jpg)\n\nBut good news in 2011 we get access to Dereon... a luscious scotch face and in 2008 Parisine Office from Porchez. :-)\n\n ![](http://web.archive.org/web/20150424044122im_/http:/typophile.com/files/Dereon_exemple_4263.gif)\n\nDo you have exclusive fonts that you wish you could have... post images, names, and foundries.\n\nMikey\n\n",
  "author": "SuperUltraFabulous",
  "time": "7 May 2006 — 2:43am",
  "uid": "12479",
  "comments": [
    {
      "time": "8 May 2006 — 3:16pm",
      "content": "Very cool thread. Too bad I have nothing to add yet. If something comes to mind I'll be sure to post it here.\n\n"
    },
    {
      "time": "8 May 2006 — 8:43pm",
      "content": "[http://www.guggenheim.org/](http://web.archive.org/web/20150424044122/http:/www.guggenheim.org/ \"http://www.guggenheim.org/\")\n\nit's similar to FB Nobel which I can't have either because I can't afford it.\n\n"
    },
    {
      "time": "9 May 2006 — 12:34am",
      "content": "Patty\\> I know what you mean... there are so many wonderful fonts out there begging for us to buy them. Our bank accounts will never match up with desire.\n\nYour Guggenheim choice is telling as well. These institutions often commission excellent typefaces from the world's top designers [much to our dismay].\n\nMikey\n\n"
    },
    {
      "time": "9 May 2006 — 1:01am",
      "content": "What about a really good font you used to  \nbe able to have but no longer can? Unica. :-(\n\nhhp\n\n"
    },
    {
      "time": "9 May 2006 — 1:24am",
      "content": "Hrant\\>\n\nI don't remember Unica. Do you have a sample or a website? I would love to see it.\n\nAs far as the font I wish could have, but they don't sell it any more: Antikva Margaret.  \nZoltan Nagy's organic tour de force. I hope someone [talented enough- too many lousy/sloppy remakes these days] decides to digitize this genius face... I'll be waiting too.\n\nMikey\n\n"
    },
    {
      "time": "9 May 2006 — 2:53am",
      "content": "[http://www.typofonderie.com/alphabets/view/Dereon](http://web.archive.org/web/20150424044122/http:/www.typofonderie.com/alphabets/view/Dereon \"http://www.typofonderie.com/alphabets/view/Dereon\")\n\n"
    },
    {
      "time": "9 May 2006 — 3:00am",
      "content": "kesh\\> Dereon almost makes me want to take up fashion design so I can get a hold of it.\n\n;-)\n\nMikey\n\n"
    },
    {
      "time": "9 May 2006 — 3:18am",
      "content": "The Bloomingdales face is just a 'topped and tailed' Avant Garde - went to Vignellis lecture in London last week. The rounded 'w' is differnt though.\n\n"
    },
    {
      "time": "9 May 2006 — 3:23am",
      "content": "Elliot\\> This I did not know. Vignellis lecture?\n\n"
    },
    {
      "time": "9 May 2006 — 3:25am",
      "content": "[http://www.klingspor-museum.de/KlingsporKuenstler/Schriftdesigner/Guertl...](http://web.archive.org/web/20150424044122/http:/www.klingspor-museum.de/KlingsporKuenstler/Schriftdesigner/Guertler/AGuertler.pdf \"http://www.klingspor-museum.de/KlingsporKuenstler/Schriftdesigner/Guertler/AGuertler.pdf\")\n\nHaas Unica – very limited sample on page 2 of this pdf  \nand there have been typophile mentions, try the search (or google)  \n [http://www.typophile.com/node/18387](http://web.archive.org/web/20150424044122/http:/www.typophile.com/node/18387 \"http://www.typophile.com/node/18387\")\n\nTim\n\n\\>Vignellis lecture  \nD&AD President's lecture ( [www.dandad.org](http://web.archive.org/web/20150424044122/http:/www.dandad.org/ \"www.dandad.org\")) couldn't go work too late\n\n"
    },
    {
      "time": "9 May 2006 — 3:49am",
      "content": "Mike, it's hard to come up with good samples of Unica, especially since its  \nrelevance is subtle with respect to its two sources: Helvetica and Univers.\n\nBTW, Massimo \"What's a font for?\" Vignelli bothers to use speech?!\n\nhhp\n\n"
    },
    {
      "time": "9 May 2006 — 4:00am",
      "content": "Sorry that was maybe a little cryptic. I went to a lecture by the husband and wife team, Massimo and Lella Vignelli, who did the Bloomingdales identity (in 1972) among their wide range of projects over the last 40+ years; Massimo Vignelli described the Bloomingdales logo as a simply customised Avant Garde. (In general they tend to use unadorned, tried and trusted classic and modern typefaces for identity and logo treatments - see also American Airlines, NYC subway signage, Knoll logo etc but occcasionally customise - they did their own Bodoni for example)\n\n"
    },
    {
      "time": "9 May 2006 — 4:30am",
      "content": "I didn't think you were being cryptic.  \nI just think Vignelli doesn't adequately grasp communication.\n\nhhp\n\n"
    },
    {
      "time": "9 May 2006 — 5:40am",
      "content": "I was just explaining my link between the logo and mention of a lecture to S U Fabulous.\n\nHrant, I do understand that typographers don't necessarily have a high opinion of M Vignelli - especially given his comments about there being too many fonts in the world, none he regards as useful produced in the last 30 years, etc. I can see how he could be acccused of not understanding, ignoring or even dismissing typography. Seems pretty good at communicating though.\n\n"
    },
    {
      "time": "9 May 2006 — 6:36am",
      "content": "[Axis by Akira Kobayashi](http://web.archive.org/web/20150424044122/https:/www.axisfont.com/images/AXIS_Font.pdf)\n\n"
    },
    {
      "time": "9 May 2006 — 10:37am",
      "content": "I don't know if it was on here or another design forum, and correct me if I'm wrong, but isn't Volvo Sans just a modified/renamed version of another font?\n\nAlso, if you work on Volvo stuff you get a copy of their Volvo family of fonts.\n\n"
    },
    {
      "time": "9 May 2006 — 4:44pm",
      "content": "hrant\\> Unica is very interesting. I like the fat counter to the lowercase 'a'.\n\nElliot\\> Thanks for the info on the Bloomingdales font. I did not know he made that. I actually thought that was Bengiaut's work.\n\nFontPlayer\\> Axis can be yours for the low low price of just $1100. If you want to fork over that kind of cash, Akira himself, better autograph the cd for you.\n\nJselig\\> You might be referring to this post:\n\n[http://typophile.com/node/3875](http://web.archive.org/web/20150424044122/http:/typophile.com/node/3875 \"http://typophile.com/node/3875\")\n\nThat post deals with Volvo Broad and some others. The font I love is the one actually used inside the cars. Its very different and still very much avant-garde.\n\nMikey ;-)\n\n ![](http://web.archive.org/web/20150424044122im_/http:/typophile.com/files/l_181_Volvo-1104-07_b_4315.jpg)\n\n"
    },
    {
      "time": "9 May 2006 — 6:09pm",
      "content": "<cite>FontPlayer&gt; Axis can be yours for the low low price of just $1100. If you want to fork over that kind of cash, Akira himself, better autograph the cd for you.</cite>\n\nIf he throws in an all expense paid trip to Japan to pick it up (you wouldn't want to send something that expensive through regular shipping channels), we've got a deal. After seeing some of Gia's reviews of Japan in another topic, I'm ready.  \n; )\n\n"
    },
    {
      "time": "9 May 2006 — 8:47pm",
      "content": "Alway's liked this, by Porchez Typofounderie. Dereon for Beyoncé fashion line, House of Dereon.\n\n[http://www.typofonderie.com/alphabets/view/Dereon](http://web.archive.org/web/20150424044122/http:/www.typofonderie.com/alphabets/view/Dereon \"http://www.typofonderie.com/alphabets/view/Dereon\")\n\n"
    },
    {
      "time": "10 May 2006 — 12:18am",
      "content": "K1RK\\> Yes! We love Beyonce's sexy voice. Now we love her sexy fonts too!\n\nMikey\n\n"
    },
    {
      "time": "10 May 2006 — 12:34am",
      "content": "Another one guys...\n\nTextaxis fonts- as of this moment- are still exclusively for the magazine Suite. In an email I received, they informed me: 'In the future we going to sell part of the Textaxis catalogue.\"  \nI respect the publications 'need' for exclusivity but part of me says 'ahh com'on guys, give the fonts'.\n\n ![](http://web.archive.org/web/20150424044122im_/http:/typophile.com/files/suipos_6106.gif)\n  \n;-)\n\nMikey\n\nPS... Textaxis's Suite family received a TDC award in 2002.\n\n"
    },
    {
      "time": "10 May 2006 — 4:59am",
      "content": "started my own blog of motorized fonts.. thing you inspired\n\n[http://typophile.com/blog/7029](http://web.archive.org/web/20150424044122/http:/typophile.com/blog/7029 \"http://typophile.com/blog/7029\")\n\n"
    },
    {
      "time": "10 May 2006 — 7:05am",
      "content": "I like the DB Type for the german railway company \"Deutsche Bahn\" by Erik Spiekermann\n\n[http://www.spiekermann.com/iblog/C61720386/E20051013130639/Media/DBType\\_...](http://web.archive.org/web/20150424044122/http:/www.spiekermann.com/iblog/C61720386/E20051013130639/Media/DBType_Uebersicht.pdf \"http://www.spiekermann.com/iblog/C61720386/E20051013130639/Media/DBType\\_Uebersicht.pdf\")\n\n"
    },
    {
      "time": "10 May 2006 — 7:15am",
      "content": "Telenor, by Magnus Rakeng.  \n [http://www.melkeveien.no/magnus-rakeng/telenor.html](http://web.archive.org/web/20150424044122/http:/www.melkeveien.no/magnus-rakeng/telenor.html \"http://www.melkeveien.no/magnus-rakeng/telenor.html\")\n\n"
    },
    {
      "time": "10 May 2006 — 10:50am",
      "content": "That's sick about Volvo! I always wondered about it. Have to say that Porchez is the shit! Matthew Carter's was the shit last year. Is Porchez gonna be the shit this year @ Typecon?\n\n"
    },
    {
      "time": "10 May 2006 — 10:51am",
      "content": "Oh that's gay! It edited out my cursing! Sorry if I offended anyone!\n\n"
    },
    {
      "time": "11 May 2006 — 7:02am",
      "content": " **I was thinking about Sem Hartz' <cite>Juliana</cite>, but it seems it's in the pipeline now.**\n\nƒ\n\n"
    },
    {
      "time": "11 May 2006 — 6:06pm",
      "content": "I'm thinking Archer for Martha Stewart Living.  \nI love how Frere-Jones was able to merge a soft and feminine look with a rigid slab serif face.\n\n"
    },
    {
      "time": "11 May 2006 — 6:50pm",
      "content": "_As far as the font I wish could have, but they don’t sell it any more: Antikva Margaret.  \nZoltan Nagy’s organic tour de force. I hope someone [talented enough- too many lousy/sloppy remakes these days] decides to digitize this genius face… I’ll be waiting too.  \nMikey_\n\nI've wanted to do Nagy's work for some time. Antikva Margeret has always been one of my favorites for a long time. I've never run across good samples of all of his work though. All I have is an old VGC specimen from the 70s. Anybody know of any really good sources? And is there any possible contact info for relatives, heirs, etc?\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "12 May 2006 — 5:51am",
      "content": "gthompson\\> Are you kidding!!! (your gonna pee your pants) I have ACTUAL pressure transfer sheets of Antikva Margaret sitting in my house in a box. NO JOKE!. THEY ARE IN PERFECT CONDITION! I pull them out gently and stare through them sometimes...and think how is it some people come up with brilliant ideas, whereas others like myself, can only appreciate them.\n\nI also have samples of York by Georg Sultan another genius european. You can get a lousy phony version of York called Jorvik Antikva on dafont.com  \nThe forger has the nerve to \"want to know what you'll do with it\"  \nIts bad but you can get an good idea.\n\nBack to Margaret... My scanner is dead... contact me through my profile if you need too. I'm so pumped I can't type!\n\nMikey\n\nPs... I love all these unusual squarish Melior-like display faces from the 70's and 60's. They make me want to drink tea or garden or something... I love organics!!!!!!!!!!!!!\n\n"
    },
    {
      "time": "12 May 2006 — 7:37am",
      "content": "Let's not forget those Fontographer fonts which have disappeared into the ether. Some seem to have been rescued by other foundries but lots of them are still not available.\n\n"
    },
    {
      "time": "12 May 2006 — 7:46am",
      "content": "I wish I could have ' [Luxury](http://web.archive.org/web/20150424044122/http:/www.orangeitalic.com/luxury.shtml)', but I fear I am just not wealthy enough. :)\n\n_( Ooh, And most of the other custom, exclusive 'stuff' by [Christian Schwartz / Orange Italic](http://web.archive.org/web/20150424044122/http:/www.orangeitalic.com/) and [Hubert Jocham](http://web.archive.org/web/20150424044122/http:/www.hubertjocham.de/). )_\n\nDav\n\n"
    },
    {
      "time": "12 May 2006 — 8:12am",
      "content": "But Mike, isn't the squarish style (which I admire as well, although in Melior  \nit doesn't really click for me) actually mechanical - the opposite of organic?\n\nhhp\n\n"
    },
    {
      "time": "12 May 2006 — 8:21am",
      "content": "Yea, Shhh, Hermann Zapf = Superellipseman. :)\n\nDav\n\n"
    },
    {
      "time": "12 May 2006 — 8:42am",
      "content": "Zapf's Civilite\n\nand i believe [house](http://web.archive.org/web/20150424044122/http:/typophile.com/wiki/house%20industries) will be releasing luxury sometime in the future. don't know what the pricetag will be...\n\n"
    },
    {
      "time": "12 May 2006 — 8:45am",
      "content": "_I have ACTUAL pressure transfer sheets of Antikva Margaret sitting in my house in a box. NO JOKE!. THEY ARE IN PERFECT CONDITION!_\n\nI also have samples of York by Georg Sultan another genius european. You can get a lousy phony version of York called Jorvik Antikva on dafont.com  \nThe forger has the nerve to “want to know what you’ll do with it”  \nIts bad but you can get an good idea.\n\nOkay, now I'm jealous. Do you have more than the regular roman? VGC catalog shows an italic as well as light, extrabold, and black weights.\n\nNew York was another nice one. I used to keep big photostats of both to look at, but never had a job I could use them for. There was a day school I used to pass whose sign was painted in New York. Always nice to see it, though not really the right face for the job.\n\nSurprisingly I couldn't find a specimen with New York in it, and the Jaspert & Berry _Encyclodpedia of Typefaces_ doesn't list it or Antikva Margaret.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "12 May 2006 — 8:49am",
      "content": "_But Mike, isn’t the squarish style (which I admire as well, although in Melior  \nit doesn’t really click for me) actually mechanical - the opposite of organic?  \nhhp_\n\nTake a look at Antikva Margaret and you'll see what he means. It's geometric-organic the same way C. R. Mackintosh's work is. Looks a little boxy, but all curves.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "12 May 2006 — 12:09pm",
      "content": "\\>SuperUltraFabulous\n\nThat's the font! (I believe) NewScientist, a british science magazine, uses it; you can find it at the bottom of the cover and throughout the magazine.\n\nI was about to write to NewScientist to find out what this awesome sans they used was. I love it!\n\n"
    },
    {
      "time": "12 May 2006 — 12:17pm",
      "content": "_( Ooh, And most of the other custom, exclusive ‘stuff’ by Christian Schwartz / Orange Italic and Hubert Jocham. )_\n\nI have a new font-making hero. I like almost every single one.\n\n"
    },
    {
      "time": "12 May 2006 — 5:16pm",
      "content": "The best font I can't have is in my head!\n\n"
    },
    {
      "time": "12 May 2006 — 6:28pm",
      "content": "Steven Wulf\\> I'm loving this DB Type. Looks like the design has lots of longevity.\n\nChris Keegan\\> Telenor has clean lines AND a personality. I like the light weight.\n\nTypeology\\> I know. Volvos- not so sexy. The font inside- very sexy!\n\nfredo\\> Sem Hartz’ Juliana is getting attention now and I hope they make it true to its design and modern for today. There is even a book in the works.\n\n[http://infernopress.blogspot.com/2006/04/sem-hartz-making-of-linotype-ju...](http://web.archive.org/web/20150424044122/http:/infernopress.blogspot.com/2006/04/sem-hartz-making-of-linotype-juliana.html \"http://infernopress.blogspot.com/2006/04/sem-hartz-making-of-linotype-juliana.html\")\n\nalexhb\\> I have never seen Archer before... great post! Umm... it reminds me if Stymie and Century had a baby, Archer would be it. It also reminds me of:  \n [http://www.vanderfont.com/type/page/CHARMINETTE.php](http://web.archive.org/web/20150424044122/http:/www.vanderfont.com/type/page/CHARMINETTE.php \"http://www.vanderfont.com/type/page/CHARMINETTE.php\")\n\nPattyfab\\> I have never ever heard of that... I wish someone has a site that shows some of them. I'm not a type designer so I'm clueless about fontographer.\n\nformlos\\> SuperEllipseMan???? Splain that one.\n\npaul D hunt\\> I have never seen Civilite...please elaborate!\n\nSamadam\\> Good pick... very strong. Would have never spotted that.\n\nThanks guys....\n\nMikey\n\n"
    },
    {
      "time": "12 May 2006 — 6:33pm",
      "content": "hrant\\> You have not seen Antikva Margaret I take it... have a look at this image I pulled from another thread.\n\n ![](http://web.archive.org/web/20150424044122im_/http:/typophile.com/files/screenshot_5840.jpg)\n\nSqarish yet organic... not mechanical. Is it just me or does that lowercase 'g' rock?\n\nMikey\n\n"
    },
    {
      "time": "12 May 2006 — 7:04pm",
      "content": "Sergej\\> Although I'm not a type designer I know what you mean.\n\n"
    },
    {
      "time": "12 May 2006 — 7:30pm",
      "content": "gthompson\\> Now you go me jealous. You have THE actual VGC catalog! I wish I had that puppy. Umm... sorry but I only have the regular and no italic. :-/  \nSpeaking of public sightings... there's a concrete bus stop in my city and you know what?... the inscriptions are set in Margaret.\n\nThanks....  \nMikey\n\nPS... York is the actual name to Georg Sultan's typeface. New York is the font standard on macs by Font Bureau. Not to be picking-nits but I just don't want anyone to be confused... :-)\n\n"
    },
    {
      "time": "13 May 2006 — 4:47am",
      "content": "Mikey, Ever heard of the term ' [SuperEllipse](http://web.archive.org/web/20150424044122/http:/www.google.com/search?hl=en&lr=&q=SuperEllipse&btnG=Search)'?  \n_( [Hermann Zapf + SuperEllipse](http://web.archive.org/web/20150424044122/http:/www.google.com/search?hl=en&lr=&q=%22Hermann+Zapf%22+%2B+%22SuperEllipse%22&btnG=Search) )_\n\nDav\n\n"
    },
    {
      "time": "13 May 2006 — 7:45am",
      "content": "Now that you've put up a sample, I know I'd seen Antikva Margaret, but I'd  \nforgotten what it looks like (and how nice it looks). It certainly has some great glyphs! The \"g\" though I would have given an open bottom - it's clotting a bit.\n\nBTW, I think the famed old Czech-produced ITC catalog from the 80s  \nhas decent samples of it, and I once made some copies from that, so...\n\nhhp\n\n"
    },
    {
      "time": "13 May 2006 — 11:52am",
      "content": "\\> _You have THE actual VGC catalog! I wish I had that puppy._\n\nGee, I thought everyone has at least one! ;-)  \nWhich leads me to a few faces that I doubt will ever see the light of digital-day --\n\nThough Stempel AG acquires full ownership of the type foundry Klingspor Bros., VGC had these available in Typositor fonts:  \n\\> Folkwang (H. Schardt) 1949 (which CG digitized as an experimental font manipulation exercise).  \n\\> Orplid (H. Bohn) 1929, a sans display with 3D shadow.\n\nAlso will never be digitized:  \nGerstner Program type family, nice but who needs another extended grotesk :\\\n\nAnd, oh yeah... the missing alternates for Bauer Topic!\n\n"
    },
    {
      "time": "13 May 2006 — 3:04pm",
      "content": "_… there’s a concrete bus stop in my city and you know what?… the inscriptions are set in Margaret._\n\nHey, nice. Got any pictures?\n\n_PS… York is the actual name to Georg Sultan’s typeface. New York is the font standard on macs by Font Bureau. Not to be picking-nits but I just don’t want anyone to be confused… :-)_\n\nI finally located a phototype specimen of it in an old Total Type (defunct Chicago type house) specimen that called it New York. VGC catalog calls it York, so perhaps York was the original name and New York the knockoff name.\n\nGeorge  \nI felt sad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "13 May 2006 — 4:40pm",
      "content": "I'm noticing a trend here. Its seems the most likely clients to request custom type work are: telecommunications, banking, and transportation.\n\n[http://www.teldesign.nl/opdracht/onderwijs/cito.html](http://web.archive.org/web/20150424044122/http:/www.teldesign.nl/opdracht/onderwijs/cito.html \"http://www.teldesign.nl/opdracht/onderwijs/cito.html\")\n\nYou can find Cito Sans here. Super clean, very minimalist.\n\nBut my favorite, in fact one of the most successful designs, is CakeType's work for KPN. This should be released! If Myriad and Vista had a baby this is it. In fact I would say this thousnd times better than Vista! More elegant more powerful! But too exclusive :-(  \nCheck it out:  \n [http://www.caketype.com/custom\\_kpn.html](http://web.archive.org/web/20150424044122/http:/www.caketype.com/custom_kpn.html \"http://www.caketype.com/custom\\_kpn.html\")\n\nMikey\n\n"
    },
    {
      "time": "13 May 2006 — 5:32pm",
      "content": "formlos\\> thank you for the info... apparently Zapf was ahead of his time regarding super-ellipses in type. [http://en.wikipedia.org/wiki/Superellipse](http://web.archive.org/web/20150424044122/http:/en.wikipedia.org/wiki/Superellipse \"http://en.wikipedia.org/wiki/Superellipse\")\n\nhrant\\> perhaps you can post some images...purty please :-)\n\nNorbert Florendo\\> Unfortunately, I was at a very young age when the last VGC catalog was produced and I only started to love type when I was about 11 or 12 when I got my first Font & Function catalog. Folkwang is interesting. I have never heard of the Gerstner Program font... more info on that one please. Now Topic Rocks!!!\n\ngthompson\\> I wish I could post images of that bus stop... My Minolta Dimage XT is not working either... I spilled something on it in a night club and my $69 scanner is not mac friendly. I'm just sucking right now!!!  \nI have an interesting observation about York I will post shortly in another thread.\n\nThanks guys,\n\nMikey\n\n"
    }
  ]
}
