{
  "id": "19780",
  "title": "typography on stone or monument",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I’m a student, doing a project about typography at the moment. I found the type from the old cemetery, i want to find the information about the old type face history, font name, carving letters on the stone or monument, or any website which have any information about the old typeface sample.\n\nthanks anyone who can help me\n\n| Attachment | Size |\n| --- | --- |\n| [Ma.jpg](http://web.archive.org/web/20080212060030/http:/typophile.com/files/Ma.jpg) | 80.87 KB |\n| [A.jpg](http://web.archive.org/web/20080212060030/http:/typophile.com/files/A_1.jpg) | 48.53 KB |\n\n [‹ ID font from papermag and Base-nine alternative](http://web.archive.org/web/20080212060030/http:/typophile.com/node/19790 \"Go to previous forum topic\") [slab serif close to Aachen ›](http://web.archive.org/web/20080212060030/http:/typophile.com/node/19775 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080212060030/http://typophile.com/user/12805\" title=\"View user profile.\">tomoyou</a>",
  "time": "<br>",
  "uid": "12805",
  "comments": [
    {
      "time": " 7.May.2006 4.42am",
      "content": "Hi, this is a fascinating topic!\n\nUnfortunately, only after the advent of machine cut letters into stone can one really begin to talk about “typography” in stone carving.\n\nTypography is the setting of text in a particular medium. Typefaces are families of characters that can be set by the user in any combination. Today, when machines cut stone, they use “fonts” just like everyone else. But before this, stones were lettered… the stone carver would draw each letter on the stone by hand before he cut it. This is not typography!\n\nJust because something isn’t typography does not mean that it cannot be good!\n\nBut when you look at old stones, you are looking at lettering, not typography.\n\nNow, lettering has always influenced typography, and vice versa. John Baskerville was a stone cutter before he started making type and printing books. And a lot of 19th century grave stones use letter designs that look a lot like Bodoni’s typefaces. But you can’t say, “that grave stone over there is set in Bodoni” because, actually, it isn’t typeset in anything.\n\nThere are A TON of digital typefaces that are inspired by the old lettering that can be found on stone monuments. A few typefaces by [Storm Type Foundry](http://web.archive.org/web/20080212060030/http:/typophile.com/wiki/Storm%252BType%252BFoundry) come to mind, as does (of course…) Adobe’s [Trajan](http://web.archive.org/web/20080212060030/http:/typophile.com/wiki/Trajan). There are many more. Try some keywords at MyFonts.com. I’m sure more typophiles will posts ideas here, too.\n\nToday, of course, you can have your gravestone set in a condensed Times New Roman, but I wouldn’t recommend it ;-)\n\nThankfully, there are still a few real stone carvers in the world who make beautiful hand-lettered monuments. Most of them work in New England or the UK, as far as I can tell.\n\n"
    },
    {
      "time": " 7.May.2006 7.32am",
      "content": "Dan is of course right about the terminology - something too often overlooked by many who should know better\\*. And yes, there are so many interesting things to glean from epigraphy, like how common the open-bottom binocular “g” was. One person who knows a lot specifically about gravestone lettering is Matthew Carter - he’s given talks about the topic, with an emphasis on a particular burial ground in Boston notable for its age and for the fact that the stone used is slate: very brittle, but highly resistant to the ravages of time. BTW, I think that’s the one I must have briefly visited (by sheer luck, actually) during my recent trip - it’s called Copp’s Hill. As soon as I walked in I realized it was hopeless: I would need to dedicate an entire day, or maybe even two (preferably with a mini-tripod) to do it justice.\n\n\\* Leading to things like writing in the air with a lightbulb being  \ncalled a “font”... True story - it happened on Typographica a while back.\n\n\\> John Baskerville was a stone cutter\n\nActually, a calligrapher (although not in the usual contemporary sense).\n\nhhp\n\n"
    },
    {
      "time": " 7.May.2006 7.49am",
      "content": "But he “designed” gravestones, didn’t he? Or do you mean “calligrapher” in that he drew things that other people carved?\n\n"
    },
    {
      "time": " 7.May.2006 7.54am",
      "content": "Hmmm, dunno - gotta double-check.\n\nhhp\n\n"
    }
  ]
}
