{
  "id": "19788",
  "title": "Metrics on italics: how to do it right?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Dear readers,\n\nI am trying to do metrics for my italic serif-face Canapé, but I'm stuck right at the beginning...\n\nFor upright designs, I usually would space the \"o\" symmetrically, assigning (for example) 40em/1000 on each side of it. For \"n\" I would do similar.  \nWhen testing the settings with \"nnnnn\" and \"ooooo\", this looks ok, and when typing \"nonon\", it's even as well. But not for italics obviously...\n\nWhen doing the same thing here, the \"nonon\"-combination looks very uneven. It would only help to assign asymmetrical space on the \"n\" (i.e. 10 left, 50 right instead of 30 on both sides), shifting it into the right place, but this is not very practical. Even more, the \"o\" has to stay symmetrically spaced, otherwise the effect is cancelled. So this is very inconsistent and will lead to problems I assume.\n\nCan anybody tell me how to do this right? At the moment I just don't get where the problem is...\n\nThanks for your help  \nSebilar\n\n",
  "author": "Sebastian Nagel",
  "time": "7 May 2006 — 12:04pm",
  "uid": "5444",
  "comments": [
    {
      "time": "7 May 2006 — 12:04pm",
      "content": " ![](http://web.archive.org/web/20131026163009im_/http:/typophile.com/files/italic_uneven_5805.GIF)\n\nHere is an image to illustrate the problem.\n\n"
    },
    {
      "time": "7 May 2006 — 1:10pm",
      "content": "Offsetting italic to fit with roman  \n [http://www.typophile.com/node/14966](http://web.archive.org/web/20131026163009/http:/www.typophile.com/node/14966 \"http://www.typophile.com/node/14966\")\n\n"
    },
    {
      "time": "7 May 2006 — 2:45pm",
      "content": "Sebilar,  \nTake this as my opinion, not fact. The dilemma with italic o is that the point of closest proximity on the left side is below center (about 60% down) and the point of closest proximity on the right side is above center. When you have a letter like n with a serif at bottom right but none at tp next to \"o\", the serif is in close proximity to the low left protrusion of the o making the 2 seem close together there. The left side of the n has serifs both top and bottom which makes it necessary to compensate by using a wider left sidebearing on the n.  \nThe solution is to consider the centering vector you measure from to be a diagonal equal to the angle of inclination used to slant the italic. I usually set sidebearings on italic by setting a string of glyphs interspersed with the vertical bar. If you can balance sidebearings this way, making compensations for adjoining shape differences become more predictable.  \nI hope this makes sense to anyone other than me :-)\n\nChrisL\n\n"
    },
    {
      "time": "7 May 2006 — 5:04pm",
      "content": "<cite>I hope this makes sense to anyone other than me :-)</cite>\n\nI don't understand much... There may be three reasons:  \n- it only makes sense to you  \n- it's in english, ergo a foreign language for me  \n- it's past 2 a.m. and I'm tired\n\nAs the last one changes in a few hours automatically, I'll try to understand it then :-)\n\nThanks for the answer,  \nand Miguel, thanks for the linkas well. I was looking for existing threads on this, but could not find them...\n\nSebilar\n\n"
    },
    {
      "time": "8 May 2006 — 4:08am",
      "content": "Sebilar, do you know [Briem's site](http://web.archive.org/web/20131026163009/http:/briem.ismennt.is/2/2.3.1a/2.3.1.01.notes.htm) on type design? He partly explains Walter Tracy's method of spacing from 'Letters of Credit'. In this method in the roman the right side of the n usually has less space than the left. He also discusses italic.\n\nOne important thing to remember, also from Tracy, is that when doing spacing, particularly for the italic, it may be best to modify the letters if they don't space well.\n\n"
    },
    {
      "time": "8 May 2006 — 7:29am",
      "content": "The measuring line in FontLab is very helpful when adjusting the sidebearings on slanted glyphs. For italics, I usually set it to half the x-height. There will be cases when it does not work (glyphs with open sides like c and s), but those should be done by eye anyway.\n\nThe \"vertical bar\" trick that Chris mentions needs a little clarification, I think. What I do is draw a rectangle. I then slant it to the same angle as the italic and then set the sidebearings to zero using the measurement line. This slanted rectangle can then be used as a spacing aid in the metrics window.\n\n"
    },
    {
      "time": "8 May 2006 — 9:00am",
      "content": "Am I the only one who -as a basis- unslants, spaces,  \nand applies the resultant spacing to the original?\n\nhhp\n\n"
    },
    {
      "time": "8 May 2006 — 9:18am",
      "content": "Any mathematical rule you follow for roman is likely to be useless for Italics. See the point about different serif structure, and what that does to numerical sidebearings. The object is to space each letter so it fits with each other. Math and symmetry are red herrings here. It ought to be a visual process. LC o is probably the only lowercase italic letter that can be spaced that way. Use o as a basis for subsequently spacing the other glyphs optically. Keep in mind that Caps will have even more asymmetrical sidebearings, since they are taller and intrude further to the right. You simply have to decide what part of the letter is centered (middle of x-height, top of lc, baseline, whatever), and then space everything pleasantly. It might help to look at the spacing of the Roman while working on the spacing of the lowercase, but I don't think you will be able to use a formula or methematical rule.\n\n"
    },
    {
      "time": "9 May 2006 — 2:40am",
      "content": "Thanks a lot for the tips and links, I am \"on the road again\" and doing some testing and corrections already. Maybe it was just getting over the beginner's innate inhibition to start without knowing what will come out.  \nOf course crossgrove is right: Math is useless here (it worked quite well on the roman though).\n\nSome minor modifications on the letters did solve the worst problems, most of it was just doing it by sure eye.\n\nTracy was not very helpful in this case, but deciding which part of the letter shall be centered, and follow that principle throughout, was. I still have problems with the measure line and how it could help me, I'll have to explore into that. I understand the principle, it's just getting used to it yet. Is it to automate some of the work? Or is it to aid in manual working?\n\nAnd I think I also understand the method with the \"vertical\" bar or the slanted rectangle. But do you draw the rectangle around the whole letter (including serifs) or just the \"main part\" of them?\n\nThanks  \nSebilar\n\nPS.: I wish there would be a \"designing type\" for italics ;-)\n\n"
    },
    {
      "time": "9 May 2006 — 7:57am",
      "content": "_And I think I also understand the method with the “vertical” bar or the slanted rectangle. But do you draw the rectangle around the whole letter (including serifs) or just the “main part” of them?_\n\nNeither. The slanted rectangle should be a separate character. You can put it anywhere it's convenient--the non-breaking space for example. You can then type it before, after, or between the characters you're working on in the Metrics window. You can also use it with the measurement line. When your spacing is done, you delete the slanted rectangle.\n\n ![](http://web.archive.org/web/20131026163009im_/http:/typophile.com/files/slanted-rect_5677.gif)\n\n"
    },
    {
      "time": "9 May 2006 — 8:09am",
      "content": "One other thing: The slanted rectangle should effectively have zero sidebearings. In other words, the width at any point should be the same as the advance width. In the example above, the sides of the slanted rectangle cross the sidebearings at exactly half the x-height.\n\n"
    },
    {
      "time": "9 May 2006 — 10:41am",
      "content": "I use the same thechniques as Mark explains but I simply use the existing vertical bar glyph with zero sidebearings. Mark explained it much better than I did.\n\nChrisL\n\n"
    },
    {
      "time": "9 May 2006 — 3:50pm",
      "content": "ok, now I get it :)\n\nI was quite close with the vertical bar already (doing the right thing without knowing).\n\n"
    }
  ]
}
