{
  "id": "1980",
  "title": "Illustration import query",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,   \nIm hoping someone can help me.   \nI have an illustration i created in illustrator (black line on white background), and have imported to a quark document to place on an image. I have imported it as an eps. When i created a pdf, the illustration looks bitmapped slightly and is definatly not as smooth as the illustrator version.   \nIm assuming it will be fine when i print it out, will this be the case?   \nAnd if not, what is the best way to import a line drawing so in quark you can place it on any background?   \n   \nThanks alot for your time,   \n   \ndavid.\n\n",
  "author": "david_leonard",
  "time": "7 Nov 2003 — 3:00pm",
  "uid": "1394",
  "comments": [
    {
      "time": "7 Nov 2003 — 3:15pm",
      "content": "David, what version of Quark are you using? InDesign, displays at a medium quality and it looks bitmapped but if you select high quality you get to see how it will really print. I don't know if quark has that feature or not. My best guess, if you are working with 4.1, (the last version I will ever use) is it will print out fine. Did you know InDesign out puts to PDF directly and supports PDFX. Thomas Phinney, our Adobe expert please chime in. Dan\n\n"
    },
    {
      "time": "7 Nov 2003 — 3:39pm",
      "content": "When viewing the PDF in Acrobat, check to see if you have \"smooth line art\" checked in your display prefs settings. This will help reduce jaggies. Also, you can zoom in lots to see if things get any more jagged. I expect that the vector illustration is still vector, so you're probably fine.   \n   \nBTW, QuarkXPress has added high res preview capability in QXP 6, although it is not as flexible as InDesign's options. But it sounds like this is a question of what's in the PDF, not how it shows up in QXP.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "7 Nov 2003 — 3:46pm",
      "content": "Thomas thanks for helping David out. I have one question for you: Do you have a brother named Davis, I'm a bike racer. Dan\n\n"
    },
    {
      "time": "7 Nov 2003 — 5:19pm",
      "content": "Thanks daniel and thank you Thomas it was the \"smooth line art\".\n\n"
    },
    {
      "time": "10 Nov 2003 — 12:07am",
      "content": "And if I'm not mistaken, the \"Smooth Line Art\" option is now on by default, in Adobe Reader and Acrobat 6, correct?   \n   \nA funny story, I have been working with acrobat for some time now, and after we got our upgrade to 6 in the mail I load it up, first thing I do is load a vector file, and viola, antialiasing.   \nSo I turn to the chap across the way and exclaim \"Thanks God, they have finally added antialiasing to vectors other than text in Acrobat\", after which he says, \"Um.. well, you could have just turned it on.\" Doh! ![:-)](http://web.archive.org/web/20131013165236im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nHildebrant.\n\n"
    },
    {
      "time": "10 Nov 2003 — 2:37am",
      "content": "You could thank god Adobe finally turned it on by default.   \nThat was really dumb to disable antialiasing out of the box   \nsince it's a single feature that can make a document look   \neither really awful on screen if it's disabled or really good if   \nit's enabled.\n\n"
    }
  ]
}
