{
  "id": "1981",
  "title": "Coco :: nitespot",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello fellow typophiles.   \n   \nI am working on a logo for a club. They want simple, sexy, upscale, \"fashionista\", clean and streamlined.   \n   \nHere are two beginning ideas. Working on a straightup sans (geometric) version which I think will take the cake, but wanted to see what you all thought about these secondary ideas.   \n   \nThe first one I wasn't sure if I should connect the letterforms or not. Thoughts? I think they read better by not connecting the bottom of the c to the o.   \n   \nThe second one, I know needs some help on that connection, but it's somewhat tricky since the end of the C tapers in.   \n   \nThese are 1st drafts, so tear em up.   \n   \nthanks\n\n",
  "author": "markatos",
  "time": "7 Nov 2003 — 4:47pm",
  "uid": "1839",
  "comments": [
    {
      "time": "7 Nov 2003 — 4:48pm",
      "content": "![](http://web.archive.org/web/20131022201950im_/http:/www.typophile.com/forums/messages/29/20057.gif)\n\n"
    },
    {
      "time": "7 Nov 2003 — 4:48pm",
      "content": "![](http://web.archive.org/web/20131022201950im_/http:/www.typophile.com/forums/messages/29/20060.gif)\n\n"
    },
    {
      "time": "7 Nov 2003 — 5:11pm",
      "content": "adjust the first one   \n   \n\\> fixed kerning, tightened up nitespot   \n ![](http://web.archive.org/web/20131022201950im_/http:/www.typophile.com/forums/messages/29/20063.gif)\n\n"
    },
    {
      "time": "7 Nov 2003 — 5:27pm",
      "content": "another adjustment to #2. fixed the connections, and put UNIVERS below. not sure whether APEX or univers works better. The small caps in Apex go well with this this treatment, since dogma has a small x-height.   \n   \nI forgot to mention that they want sort of an island feel if possible, hence the wave effect.   \n   \n(they were going to call this place bikini!)   \n   \n;)   \n   \n ![](http://web.archive.org/web/20131022201950im_/http:/www.typophile.com/forums/messages/29/20069.gif)\n\n"
    },
    {
      "time": "7 Nov 2003 — 10:40pm",
      "content": "I really like both of these directions, but I prefer #2 considering the island feel. Perhaps the last bowl should be a \"coco\"-nut\n\n"
    },
    {
      "time": "8 Nov 2003 — 12:04am",
      "content": "i like concept #2. i'm leaning towards the univers pairing. can we see both comps (apex & univers) side by side at the same size?\n\n"
    },
    {
      "time": "8 Nov 2003 — 5:34am",
      "content": "I also like the second, nice. But I am not sure about the fonts you are using for the text below, I think I would go for something softer and bolder (of course not as coco), \"funnier\" (I know it is not the word), something in the feel of Fountain's [Mayo](http://web.archive.org/web/20131022201950/http:/www.fountain.nu/catalogue/mayo.asp), [Mustardo](http://web.archive.org/web/20131022201950/http:/www.fountain.nu/catalogue/mustardo.asp), [Udo Wide](http://web.archive.org/web/20131022201950/http:/www.fountain.nu/catalogue/udo.asp) (something wrong with type setter for this one by the way), Garage's [Fono Expanded Unicase](http://web.archive.org/web/20131022201950/http:/www.garagefonts.com/detail.html?sku=GF06100811P2) (maybe too bold), or even a bold script, I don't know, something more ... I see your nitespots kind of serious.   \nWell just a thought Peter, I like your cocologo.\n\n"
    },
    {
      "time": "8 Nov 2003 — 7:15am",
      "content": "Hi Peter,   \n   \nI like both of your drafts.   \n   \nThe second one may be more of an eye catcher, though (and therefore preferrable?); it reminds me of some of those hip and sporty fashion label logos.   \n   \nI think I'd join the c's and the o's in the first logo:   \n ![](http://web.archive.org/web/20131022201950im_/http:/www.typophile.com/forums/messages/29/20079.gif)   \n(This is quick and dirty bitmap work only - just to illustrate what I mean.)   \n   \nBesides, I'd experiment with the same font in a heavier weight.   \nAnd I'd probably move the \"Nitespot\" a hair to the right.   \n   \nRegards   \njpg\n\n"
    },
    {
      "time": "8 Nov 2003 — 9:25am",
      "content": "Definitely the second one.   \nI'd make the subhead bolder.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Nov 2003 — 10:37am",
      "content": "Iganacio...excellent choice on mayo. My initial sketches had a font exactly like that.   \n   \nthanks.   \n   \nI made the subhead bolder, Hrant.   \n   \nI have it down to apex (top) and mayo (bottom). I think mayo is the way to go.   \n   \nI had to pick initial colors as well, the client wanted to see where I am at so they could show the contruction workers as well.   \n   \nNot 100% on the colors, picked them in 2 minutes! But I think the darker blue is working nicely.   \n   \nI am ditching the other idea, what was I thinking ;)   \n   \nThanks for the feedback thus far. Will posting my second idea later today. ![](http://web.archive.org/web/20131022201950im_/http:/www.typophile.com/forums/messages/29/20174.gif)\n\n"
    },
    {
      "time": "10 Nov 2003 — 11:07am",
      "content": "Mayo, definitely.   \n   \nBut I think blue is too innocent here.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Nov 2003 — 11:12am",
      "content": "hmm....what do you mean by innocent?   \n   \nwanted a moody, night-time blue.\n\n"
    },
    {
      "time": "10 Nov 2003 — 11:15am",
      "content": "Maybe put some red in it: a very dark, subtle purple.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Nov 2003 — 1:37pm",
      "content": "There's nothing like real Mayo\n\n"
    },
    {
      "time": "10 Nov 2003 — 1:43pm",
      "content": "Where does one look up PMS colors on-line? Blasphemy, I know - I mean just for a rough idea.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Nov 2003 — 2:15pm",
      "content": "Nice color suggestions there. Tiffany, that is exactly what I am aiming for.   \n   \nHmmm...so initial client feedback is that the coco font (dogma) looks too 'techy'.   \n   \nI can't see it. To me, it's more classic than techy. I was trying to find some background info on dogma to support my opinion. Do you guys know what dogma is based on?   \n   \nAlso, does this look techy to you?   \n   \n[side note, the word techy has so many connotations...I've had clients use that word in so many different contexts that I can't really gather what they mean by it anymore]\n\n"
    },
    {
      "time": "10 Nov 2003 — 4:47pm",
      "content": "Are you serious about the green? I don't see the correlation. On the west coast, late night ocean skies (especially right after a red/orange sunset) have that tint of red that Hrant was suggesting. I'll have to stand by the deep, red-tinted blue as my suggestion.   \n   \n\"Techy\"? NO WAY! First of all, you used the word \"opinion\". One lesson I learned well during my years of in-house design, is to eliminate opinions from the equation, if at all possible. Focus on objectives and solutions.   \n   \nYou have two potential problems here: (1) your client doesn't want \"techy\" so you need to prove that the solutions you've shown aren't \"techy\", or (2) your client doesn't want what you've shown him, and he's incorrectly calling it \"techy\". Either way, I'd suggest collecting some real techno junkie examples and some great lounge neuvo samples similar to what you're doing. One obvious distinction I'd make is that most \"techy\" stuff doesn't have the curvilinear elements that your \"coco\" type has.   \n   \nIf your client has any true concept of \"techy\", it's probably the \"nitespot\" type that has led him to this conclusion. Tiffany is right, though, \"nitespot\" doesn't look \"techy\" either. You might need to pull out the \"expert\" card here. \"Convince\" your client that it's not \"techy\" and it will work...that is, if you're confident enough that it will.   \n   \nGood luck!   \nScott\n\n"
    },
    {
      "time": "10 Nov 2003 — 1:46pm",
      "content": "I disagree with both of you. The color is just dirty enough to be interesting, and yet still has some of that \"late night sky at the ocean-ness\" to it. Also, it would look really good with an acid green, like 390 or 389.\n\n"
    },
    {
      "time": "10 Nov 2003 — 2:20pm",
      "content": "Peter. I forgot to mention that I do like the newest \"nitespot\" typeface. I do not find it to be too \"techy\".\n\n"
    },
    {
      "time": "11 Nov 2003 — 8:52am",
      "content": "This isn't a nature conservancy logo. A little acid green ... especially if there is signage ... could spice it up. The blue that Peter chose to use isn't anything like the blue I'm seeing on my monitor. I mean, it is blue, but it is more mediterranean than this.\n\n"
    }
  ]
}
