{
  "id": "19846",
  "title": "Choosing a font for a book that is evocative of New York",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am writing and designing a book that has strong connections to New York.\n\nI’d like to use a font or fonts that have an association with the city, perhaps because the font was designed there, perhaps because the font says New York.\n\nIt must be a font suitable for a book that is available in roman, small caps and oldstyle/text figures. And maybe there is a sans serif that matches.\n\nThanks.\n\n [‹ Sans serif typefaces with Latin Extended-A character sets?](http://web.archive.org/web/20071214061859/http:/www.typophile.com/node/19474 \"Go to previous forum topic\") [Need typeface not too light, not too dark ›](http://web.archive.org/web/20071214061859/http:/www.typophile.com/node/19908 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071214061859/http://www.typophile.com/user/12859\" title=\"View user profile.\">redge</a>",
  "time": "<br>",
  "uid": "12859",
  "comments": [
    {
      "time": " 9.May.2006 7.55pm",
      "content": "May I say this one?  \n(I can’t ID the font right now)  \n [http://www.newyorker.com/images/headers/he\\_big\\_logo.gif](http://web.archive.org/web/20071214061859/http:/www.newyorker.com/images/headers/he_big_logo.gif \"http://www.newyorker.com/images/headers/he\\_big\\_logo.gif\")\n\n"
    },
    {
      "time": " 9.May.2006 8.00pm",
      "content": "That’s by that guy - the one who did the Cadillac - or some other car - adverts, isn’t it? He’s in American Typeface Designers. And I don’t know whether there’s a font of it.  \nHope that helps.\n\n"
    },
    {
      "time": " 10.May.2006 6.32am",
      "content": "If you want it to be “New Yorkish” you should contact some of these guys, or buy some of their stuff;\n\nJoshua Darden  \nChristian Schwartz  \nJonathan Hoefler\n\nThey all do good stuff and some perfectly suited for books\n\n"
    },
    {
      "time": " 10.May.2006 6.56am",
      "content": "[Gotham](http://web.archive.org/web/20071214061859/http:/typography.com/catalog/gotham/index.html) by [Hoefler & Frere-Jones](http://web.archive.org/web/20071214061859/http:/typography.com/profile/index.html) is based on architectural signage found in New York. It’s very clean and legible and comes in a wide variety of weights. I really like it. However, it’s starting to get a little overused.\n\n"
    },
    {
      "time": " 10.May.2006 7.17am",
      "content": "Don’t use the New Yorker font, it’s a cliche. Gotham is great but it is really popular right now and not really suitable for text. How about Hoefler & Frere-Jones’s Mercury text?\n\n[http://www.typography.com/catalog/mercurytext/index.html](http://web.archive.org/web/20071214061859/http:/www.typography.com/catalog/mercurytext/index.html \"http://www.typography.com/catalog/mercurytext/index.html\")\n\none day I will learn the html on this site...\n\n"
    },
    {
      "time": " 10.May.2006 7.20am",
      "content": "I will make a gif\n\n"
    },
    {
      "time": " 10.May.2006 7.27am",
      "content": " ![](http://web.archive.org/web/20071214061859im_/http:/www.typophile.com/files/url_5405.gif)\n\nYou can do a view source, then paste that onto a txt doc and delete the url and displayed text\n\n ![](http://web.archive.org/web/20071214061859im_/http:/www.typophile.com/files/url2_4730.gif)\n  \nand save, then just paste it in each time\n\n ![](http://web.archive.org/web/20071214061859im_/http:/www.typophile.com/files/url3_6157.gif)\n\n"
    },
    {
      "time": " 10.May.2006 7.28am",
      "content": "Tobias Frere-Jones did [Grand Central](http://web.archive.org/web/20071214061859/http:/fontbureau.com/fonts/GrandCentral) while he was at Font Bureau. To me it is really evocative of 30s New York, and lovely. You would want it for display only though. Maybe match another of Frere-Jones’ many fonts, from either Font Bureau days or with H & F-J.\n\n"
    },
    {
      "time": " 10.May.2006 7.40am",
      "content": "Dennis, yes, I know I can go to the “html formatting options” below & copy and paste, but that is a lot of work. On the old site it was simpler. I’m lazy.\n\n"
    },
    {
      "time": " 10.May.2006 7.47am",
      "content": "Ah, I didn’t see that little link.\n\nMy problem is different. I suffer from the CRS syndrome. So pasting is my best bet to make sure it works. I do remember the cite-/cite, but now it looks like all I have to do is em-/em to get the same result, thus freeing up four extra brain cells.  \n: )\n\n"
    },
    {
      "time": " 10.May.2006 12.39pm",
      "content": "I’ve looked at Darden, Hoefler and Schwartz. The only fonts from these designers that might meet my needs (serif, small caps, text figures, support for French characters) are Frieght, Hoefler Text and Mercury. It’s a start, time to buy a book on American type designers.\n\nMuch appreciate the suggestions.\n\n"
    },
    {
      "time": " 10.May.2006 12.47pm",
      "content": "I don’t think you should obsess over the font’s designer being from New York - we had a thread recently about fonts for a gay-themed book and the same topic came up. I think you should look for the font that best reflects what you’re after even if the designer is from New Zealand. Maybe think in terms of something Deco for the display.\n\n"
    },
    {
      "time": " 10.May.2006 12.57pm",
      "content": "On the other hand, if the designer was specifically inspired by the city, it might be worth a look. HTF Gotham is such a font.\n\n"
    },
    {
      "time": " 10.May.2006 1.07pm",
      "content": "I agree that this isn’t something to obsess about. If there’s a NY connected typeface that works, great, if not, doesn’t matter.\n\n"
    },
    {
      "time": " 10.May.2006 1.19pm",
      "content": "If the book has something to do with design or the visual aspect of New York, I do think that something that resonates with the look of New York would add to the book design. Both Gotham and Grand Central are directly inspired by lettering which is prominent in NYC for a long time.\n\n"
    },
    {
      "time": " 10.May.2006 4.22pm",
      "content": "How about New York via Italy?\n\nI’ve just had a look at a .pdf of dfType’s Rialto.\n\nI think that it’s taken my heart.  \nBesides, I got a very fast response to my e-mail enquiry, which I appreciate.\n\nDoes anyone have experience using Rialto for a book? Comments?\n\n"
    },
    {
      "time": " 11.May.2006 7.02am",
      "content": "Gotham and Grand Central are both lovely but they are not text fonts.\n\n"
    },
    {
      "time": " 11.May.2006 7.11am",
      "content": "New York is such a huge amalgam of differences that finding one face to say it to everyone is quite a challenge. You might use the heads and a display face to give the piece its NYC flavor and chose a text face that doesn’t have to do as much heavy lifting in that area.\n\nPerhaps Cheltenham. Also see this New York Times link:\n\n[http://www.gothamist.com/archives/2003/10/21/new\\_york\\_times\\_facelift.php](http://web.archive.org/web/20071214061859/http:/www.gothamist.com/archives/2003/10/21/new_york_times_facelift.php \"http://www.gothamist.com/archives/2003/10/21/new\\_york\\_times\\_facelift.php\")\n\nChrisL\n\n"
    },
    {
      "time": " 11.May.2006 8.55am",
      "content": "\\>Gotham and Grand Central are both lovely but they are not text fonts\n\nYes, I did note that earlier. But I think in the display realm is where you’d have more of a chance to give a New York City flavor if you wanted to.\n\nActually, [Hightower](http://web.archive.org/web/20071214061859/http:/fontbureau.com/fonts/Hightower), also by Frere-Jones, is a text font that would perhaps go with Grand Central—though I think it doesn’t say ’New York’. But neither does any other good text font.\n\n"
    },
    {
      "time": " 11.May.2006 1.20pm",
      "content": "The problem with a New York font is two fold: Is it New York or New York City (Manhattan). The next question is what era of New York history do you want the work to reflect, 20s, 30s, 40s etc. Answer these questions and posters can better focus your search. Your initial question is painting with to broad a brush.\n\n"
    },
    {
      "time": " 11.May.2006 2.30pm",
      "content": "Dan,\n\nContemporary New York City. Lots of text plus a fair number of colour and b&w photographs.\n\nI would like to have a paragraph at the end that says something about the type designer(s) and the type(s). My preference is to use a type for the text designed by a current New York designer, but thus far have not come across one that both appeals to me and has an adequate character set. Second preference is for a deceased New York designer, second because if someone is going to get paid for a typeface, it might as well be someone who can enjoy the money.\n\nI am adamant about using a serif type for the text, quite prepared to consider a sans serif for titles and headings.\n\nEnjoyed the pinhole photos on your web site.\n\nI noticed the Bank of New York material. I think that the type they use for their name is too grave for my purposes, but I’m curious about what it is.\n\nCheers\n\n"
    },
    {
      "time": " 11.May.2006 4.06pm",
      "content": "Now that I think about it, my second choice is not a deceased New York designer, but a living designer from elsewhere.\n\nPreferably one who, unlike the Dutch Type Library, answers e-mail queries in a timely fashion (currently three days and counting).\n\n"
    },
    {
      "time": " 11.May.2006 8.30pm",
      "content": "On the Bank of New York web site it looks like they use Adobe Garamond as their serif and perhaps Bliss as the logo - it’s a bit small to be sure.\n\nI am sure someone will disagree with me but I like Filosofia for a text font. It’s got that Didone/contemporary feel that seems right to me.\n\n"
    },
    {
      "time": " 11.May.2006 8.46pm",
      "content": "As a neophyte, I’d appreciate it if someone would explain to me why it is difficult to get a response from some type designers.\n\nSeveral days ago, I sent an e-mail to Dutch Type Library asking whether I could arrange to see some of my text in one of their type faces. I am still waiting for a response, which is a bit surprising given their prices.\n\nAt the same time, I sent Tiro an e-mail asking whether Plantagenet Novus is available and, if not, when it will be.\n\nNeither of these companies has acknowledged my enquiry, let alone responded.\n\nAs a matter of curiosity, is this normal?\n\nDoes Dutch Type Library, given its prices,really think that potential clients should wait for days for the privilege of giving them hundreds of dollars?\n\nHonestly, I’m just curious, because I don’t get it.\n\nCheers\n\n"
    },
    {
      "time": " 11.May.2006 9.25pm",
      "content": "Yeah, I don’t get it either. I say don’t give them your money then. Not all foundries/type designers have that attitude. Patronize one of your fellow typophiles instead.\n\n"
    },
    {
      "time": " 11.May.2006 10.50pm",
      "content": "Well here’s the result of the fact that DTL and Tiro don’t answer e-mails,and that a lot of other current designers don’t seem to be very interested in fully functional designs for book text.\n\nI’m talking with a small European company that is fast to answer e-mails, that makes a type face that has a comprehensive character set and that has a  \ngreat attitude when it comes to working with people who are interested in using its typeface.\n\nI’ll know in the next couple of days, because of the co-operation of the designers, how the typeface looks with our material.\n\nIf it doesn’t work aesthetically, it won’t cost me anything. If it does work, it will cost me quite a lot more than your standard download, but it will be worth every penny.\n\n"
    },
    {
      "time": " 12.May.2006 7.32am",
      "content": "Will you share the name of the font/foundry with us?\n\n"
    },
    {
      "time": " 12.May.2006 2.30pm",
      "content": "I always answer my e-mails right away. No difference if the request/client is small or big. I feel ashamed when I hear that excellent foundries like DTL does the opposite. I often hear that the bigger companies (no names) tend to be a bit arrogant. It might be that indipendant foundires/designers are more polite?\n\nAnyway if you do consider something non NY style. I have a couple of familes made for body copy... Anziano, Delicato and Tarocco. [http://www.macrhino.com](http://web.archive.org/web/20071214061859/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\n"
    },
    {
      "time": " 12.May.2006 2.52pm",
      "content": "Terminal Design is a contempory New York type design company and their designs are beautiful. [www.termimaldesign.com](http://web.archive.org/web/20071214061859/http:/www.termimaldesign.com/ \"www.termimaldesign.com\")\n\n"
    },
    {
      "time": " 12.May.2006 3.14pm",
      "content": "Dan,  \nFix the link, you spelled Terminal Termimal.\n\nJames would be happy with the plug though :-)\n\nChrisL\n\n"
    },
    {
      "time": " 12.May.2006 3.20pm",
      "content": "[New York City](http://web.archive.org/web/20071214061859/http:/www.typophile.com/wiki/New%252BYork%252BCity)\n\n"
    },
    {
      "time": " 12.May.2006 5.12pm",
      "content": "Thanks.\n\n"
    }
  ]
}
