{
  "id": "19857",
  "title": "Why design will ruin your life",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi typophiles/designers,\n\nI’m putting together a book listing reasons that design will ruin a person’s life. It’s not solely about typography, but the largest chapter is devoted to it. Suggestions/contributions are welcome, and will be credited (I don’t plan on publishing or selling it, and if I did, it wouldn’t be for profit.)\n\nExamples from the text:\n\n“You will take a long detour around Illinois to avoid seeing a poorly kerned sign.”  \n—  \n“You have a carton of acid-free orange juice from 1983, and think it’s still good.”  \n—  \n“You are prepossessed to dislike any person that is an orphan or widow.”\n\nI’m looking forward to hearing any input on this. Just don’t bother telling me that I have really horrible ideas, I already know!  \nThanks,  \nCasey\n\n",
  "author": "<a href=\"user/12371\" title=\"View user profile.\">v-six</a>",
  "time": "<br>",
  "uid": "12371",
  "comments": [
    {
      "time": " 10 May, 2006 - 8:07am",
      "content": "Of course the last reason, on the last page, must be something like\n\n“It will make you want to write a book, on why design will ruin a person’s life”\n\n"
    },
    {
      "time": " 10 May, 2006 - 8:09am",
      "content": "_You will take a long detour around Illinois to avoid seeing a poorly kerned sign._\n\nSometimes they are worth getting a photo of. I saw one photo for a video store called FLICKS that had tight tracking, and when the LI got together it changed the meaning of the word. I’m betting the sign company ended up having to redo it.\n\n"
    },
    {
      "time": " 10 May, 2006 - 8:10am",
      "content": "“It will make you want to write a book, on why design will ruin a person’s life”\n\nheh, well said. Maybe if I get lucky, I’ll be able to add “The creator of this book has since been institutionalized.”\n\n"
    },
    {
      "time": " 10 May, 2006 - 8:12am",
      "content": "‘You will have numb fingers from carpal tunnel syndrome’\n\n"
    },
    {
      "time": " 10 May, 2006 - 8:18am",
      "content": "During one creative period where I used a touchpad for making some [kaleidoscope art thingies](http://web.archive.org/web/20060523165018/http:/www.fontplay.com/kaleidoplay1.htm) until the end of my pointing finger got painfully sensative for months from tapping for clicks. That was years ago, and now it still is sensative. Mind you I’m not a designer, but I was pretending to be.\n\n"
    },
    {
      "time": " 10 May, 2006 - 9:34am",
      "content": "“you have a Pantone reference for your tea”  \n [Get yours here](http://web.archive.org/web/20060523165018/http:/www.droogdesign.nl/#frames(lb=lb.php?r=166&f=2,rb=rb.php?r=13&f=2))\n\nTim\n\n"
    },
    {
      "time": " 10 May, 2006 - 10:15am",
      "content": "Fontplay,  \nI took a look at your site, and enjoyed this quote:  \nhttp://www.fontplay.com/images2/rotor.jpg  \nIs that factual?\n\n\\>“you have a Pantone reference for your tea”  \nThat’s fantastic.\n\n"
    },
    {
      "time": " 10 May, 2006 - 10:30am",
      "content": "Design has done nothing but good things for me.\n\nI, however, am my own worst enemy…\n\npeace\n\n"
    },
    {
      "time": " 10 May, 2006 - 11:48am",
      "content": "_I took a look at your site, and enjoyed this quote:  \nhttp://www.fontplay.com/images2/rotor.jpg  \nIs that factual?_\n\nIt was on a list of trivia facts. I didn’t bother to check, but it sounds silly enough to be true.  \n: )\n\n"
    },
    {
      "time": " 10 May, 2006 - 12:09pm",
      "content": "WHY (TYPE) DESIGN WILL RUIN YOUR LIFE —\n\nYou legally have your name changed so you can have a cooler looking monogram.\n\nYour vanity license plate reads, “DINGBAT”  \nYour vanity license plate reads, “GLYPHER”\n\nYou love the movie “Fontless in Seattle”\n\nYou were accused of sexual harrassment because you mentioned “interobang” at the office.\n\nYou were accused of sexual harrassment because you said “Joanna has nice ascenders”.\n\nPeople tire of you saying, “It’s Ellipsis… not dot.dot.dot.”\n\nYou’re thrown out of the cineplex for booing during the movie titles\n\nYour bumper says “STOP FONT ABUSE!”  \nYour bumper says “TO HELL WITH HELVETICA!”\n\nYou keep getting “World’s Best Designer” bobble-heads for your birthday.\n\nYou’re the only one who thinks type when you hear “Stymie Black”\n\nYou’re introduced to a hot (your gender preference – babe/hunk) at a cocktail party as a “designer” and she/he says, “Like Tommy Hilfiger?”, and you say, “No, like Hermann Zapf” and you suddenly get the feeling you’re going home alone again tonight.\n\n"
    },
    {
      "time": " 10 May, 2006 - 12:12pm",
      "content": "I guess “You might be a redneck if” was more influential than I hoped…\n\npeace\n\n"
    },
    {
      "time": " 10 May, 2006 - 1:13pm",
      "content": "I don’t know but I’ll buy the book just for the “pantone reference for tea” and for “Joanna’s nice ascenders”. The funny thing is that when I was working in London we really had a reference for tea (and coffee) colours (Not a pantone one though). You can’t play with this sort of things in England, that’s serious business. Once I was at a restaurant and I asked my non-designer friend to show me the menu to see if everything was nicely aligned. And I meant it.\n\n"
    },
    {
      "time": " 10 May, 2006 - 1:24pm",
      "content": "I can’t help noticing bad kerning in ads etc, especially when in public transport. It interferes with the message.  \nI also spoil enjoyment of pictures by wondering, how it was done.\n\n"
    },
    {
      "time": " 10 May, 2006 - 1:39pm",
      "content": "papyrus.\n\n"
    },
    {
      "time": " 10 May, 2006 - 1:57pm",
      "content": "Your rear-end has gone flat from sitting in front of the computer too much.\n\nInstead of reading, you just look at the words.\n\nHelvetica is a lifestyle.\n\nYou buy fonts behind your spouse’s, life partner’s, or your own back!\n\nThere’s hope for tacky Los Angeles when public transportation steps up to the plate with Scala:  \n [www.metro.net](http://web.archive.org/web/20060523165018/http:/www.metro.net/)\n\nYou get ‘vahclempt’ when a new font get released.\n\nYour kid asks you, “Daddy what color is this?” and you say “Sweety, that’s PMS 321 Teal uncoated.”\n\nMikey\n\n"
    },
    {
      "time": " 10 May, 2006 - 2:23pm",
      "content": "A Major Reason Why Design (or, more specifically, typography) Will Ruin Your Life\n\nYou have to work hard on tiny things for hours on end so no one will notice that you had to spend hours on end working hard on tiny things. Then get them to pay you for it.\n\n"
    },
    {
      "time": " 10 May, 2006 - 2:33pm",
      "content": "Wow, thank you everyone for the replies so far. Chris, you’re my hero.\n\n"
    },
    {
      "time": " 10 May, 2006 - 3:48pm",
      "content": "<cite>Helvetica is a lifestyle.</cite>\n\nThat should be on a t-shirt.\n\nWhy design will ruin your life:\n\n\\* One too many X-acto knife accidents.\n\n\\* Too much time on Typophile :)\n\n"
    },
    {
      "time": " 10 May, 2006 - 4:18pm",
      "content": "\\* One too many X-acto knife accidents.\n\nThat one fits me well. I learned the hard way a few years ago not to do book binding while you’re sick. The sad part is I was more worried about “rubrication” on the book than I was about disecting myself. Thankfully, I can still count base ten with my fingers.\n\n"
    },
    {
      "time": " 10 May, 2006 - 4:26pm",
      "content": "aha. self-rubrication.\n\n"
    },
    {
      "time": " 10 May, 2006 - 4:29pm",
      "content": "Ol’ Dezcom must be pretty tired getting this bobble-head for Father’s Day! :-)\n\n ![](http://web.archive.org/files/bobble_head-Dezcom_3775.png)\n\n"
    },
    {
      "time": " 10 May, 2006 - 5:57pm",
      "content": "LOL!!!\n\nChrisL\n\n"
    },
    {
      "time": " 10 May, 2006 - 6:11pm",
      "content": "You know design has ruined your life:  \nif you make your icon out of glyphs from a typeface you designed;\n\nYou get a vanity plate with the name of that typeface;\n\n ![](http://web.archive.org/files/chrisL-car_4956.jpg)\n\nThen you make a Christmas card using all type in that typeface and have a very bad visual pun in it;\n\n ![](http://web.archive.org/files/chrisnoel_4389.gif)\n\nAnd an online friend posts a picture of you as a bobblehead!\n\nChrisL :-)\n\n"
    },
    {
      "time": " 10 May, 2006 - 6:21pm",
      "content": "You know type design has ruined your life if you are not satisfied being a type A or a Type B personality and want to be a complete opentype superpro character set personality.\n\nChrisL\n\n"
    },
    {
      "time": " 10 May, 2006 - 8:13pm",
      "content": "At this rate the book could turn into a twenty-volume set. Who will volunteer to help me bind it all!? I guess this leads us to “You enjoy talking about design more than you like doing it.” I think I’ve gotten to that point.\n\n"
    },
    {
      "time": " 10 May, 2006 - 8:26pm",
      "content": "You will accept doing jobs that pay almost nothing (hell, nothing) because in spite of there being very little financial reward involved, they are cool projects, and, after all, you are in love with design, right? Even if it ruins your life. :-D\n\n"
    },
    {
      "time": " 10 May, 2006 - 10:36pm",
      "content": "\\>\\> You will accept doing jobs that pay almost nothing (hell, nothing) because in spite of there being very little financial reward involved, they are cool projects, and, after all, you are in love with design, right? Even if it ruins your life. :-D\n\nI think you hit the nail right on the head with this one.\n\n"
    },
    {
      "time": " 11 May, 2006 - 6:19am",
      "content": "Danger signs: Driving down any interstate or commercial street becomes little more than an excercise in fontspotting and legibility analysis. Billboards are your primary source of road rage.\n\n"
    },
    {
      "time": " 11 May, 2006 - 6:21am",
      "content": "Don’t forget bumper stickers too!\n\nChrisL\n\n"
    },
    {
      "time": " 11 May, 2006 - 6:28am",
      "content": "Silly of me to forget bumper stickers. I keep trying to find an arrow key in the car to kern those green signs, too.\n\n"
    },
    {
      "time": " 11 May, 2006 - 6:57am",
      "content": "I just spent a good part of my night trying to solve the problem of adding hyperlinks to physical places and things, including myself. I was baffled as to why it wasn’t working. When I woke up I finally realized what the problem was.  \n: )\n\n"
    },
    {
      "time": " 11 May, 2006 - 7:20am",
      "content": "You become illiterate.\n\nBTW:  \n\\> to see if everything was nicely aligned.\n\nAh.\n\nhhp\n\n"
    },
    {
      "time": " 11 May, 2006 - 8:08am",
      "content": "You start judging books, not so much by their cover, but whether or not they’ve used ligatures on the inside.\n\n"
    },
    {
      "time": " 11 May, 2006 - 8:22am",
      "content": "oh it wasn’t design that did that to me, hrant…i was born like that!  \nHugs\n\n"
    },
    {
      "time": " 11 May, 2006 - 9:00am",
      "content": "you throw up a little every time you see a prime mark instead of an apostrophe.\n\n"
    },
    {
      "time": " 11 May, 2006 - 9:18am",
      "content": "If you have OCD (Obsessive Compulsive Disorder), the rest of your life will be spent in the pursuit of perfect type kerning.\n\nOh, wait, you’re going to do that anyway…\n\nYou have no problem discussing PMS in public… and can’t figure out why people stare at you when you do.\n\nYou’ve had a traffic accident due to exceptionally good or bad kerning on a billboard.\n\nYour friends have been caught by their wives lusting after porn online. Your wife caught you lusting after fonts online.\n\n"
    },
    {
      "time": " 11 May, 2006 - 9:56am",
      "content": "\\> i was born like that!\n\nBut of course men and women are not born differently…\n\nTrust me: it’s never too late.\n\nhhp\n\n"
    },
    {
      "time": " 11 May, 2006 - 11:07am",
      "content": "You try to Command-Z real life events.\n\n"
    },
    {
      "time": " 11 May, 2006 - 11:53am",
      "content": "I tried to command+Z my income tax and it didn’t work :-(.\n\nChrisL\n\n"
    },
    {
      "time": " 11 May, 2006 - 11:59am",
      "content": "\\>Trust me: it’s never too late.\n\nHrant, actually it is a bit too late if you are dyslexic.\n\n"
    },
    {
      "time": " 11 May, 2006 - 12:07pm",
      "content": "Dyslexics are hard-wired to adulate Modernism?\n\nhhp\n\n"
    },
    {
      "time": " 11 May, 2006 - 1:35pm",
      "content": "You come across a glyph that resembles one of your distant relatives.\n\nYou print it, with the distant relative’s name underneath, and put it on your bulletin board at work.\n\nYou receive odd looks while explaining it to other _designers_ who come by, but you keep it on the bulletin board anyway, and then….\n\nThe distant relative, who is in no way a designer, who will never, ever understand how an uppercase G reminds anyone of anyone else, actually VISITS YOUR OFFICE without notice and asks why their name is up on your bulletin board, and “what’s the G for?”\n\nThank goodness for typophile. :)\n\n"
    },
    {
      "time": " 11 May, 2006 - 4:20pm",
      "content": "G wizz Tim! How could he not understand anything so clear :-)\n\nChrisL\n\n"
    },
    {
      "time": " 11 May, 2006 - 5:59pm",
      "content": "\\>You try to Command-Z real life events.\n\nI’ve actually spoken to many designers who have instinctively tried to command-z something that can’t be undone. Maybe Staples should have a big Command-Z button mass-produced in addition to their “Easy Button.” On that note, I was in there with a friend who needed to place a special order to have copies made. The process was an absolute hassle, so I brought over one of their easy buttons. We both pushed it, but nothing happened.\n\n\\>Dyslexics are hard-wired to adulate Modernism?\n\nThe only dyslexic designer I know owns a copy of _Grid Systems in Graphic Design_. I wouldn’t say he adulates Modernism, but the two of them are definately on speaking terms.\n\nTim, that’s too good to be something you made up. I think we all need to have a big typophile group hug. “It’s okay, we’re here for you!”\n\n"
    },
    {
      "time": " 11 May, 2006 - 10:39pm",
      "content": "Design will ruin your life because when you’re not actually designing you’ll spend hours on web sites talking about it.\n\n"
    },
    {
      "time": " 12 May, 2006 - 9:52am",
      "content": "Design will ruin your life because you want to give fonts and clip art as (paid) presents to friends and family members but you first have to explain what they are …\n\n:D\n\n"
    },
    {
      "time": " 12 May, 2006 - 1:58pm",
      "content": "\\>You try to Command-Z real life events\n\nthats funny! i swear that thought has run through my mind when i was doing something stupid - like locking my keys in my car. APPLE-Z! APPLE-Z! APPLE-Z! DOH!\n\nI think that and billboard-kerning-induced road rage resonate most with me\n\n"
    },
    {
      "time": " 13 May, 2006 - 10:42am",
      "content": "Design is a direct connection to God.\n\nCynicism is befuddling…\n\npeace\n\n"
    },
    {
      "time": " 13 May, 2006 - 10:50am",
      "content": "Ah, the Sufi Bauhaus School.\n\nhhp\n\n"
    },
    {
      "time": " 13 May, 2006 - 10:55am",
      "content": "Prelude to the Ceremonies of the Whirling Dervish  \nby the Erguner Brothers\n\nWe create the universe…\n\npeace\n\n"
    }
  ]
}
