{
  "id": "1986",
  "title": "\\* A Note from Rich Roat, House Industries",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Rich sent this today, I'm just passing it along --jared   \n   \nFolks,   \n   \nBeen looking at the shirts in anticipation of the end of the contest, and a coupla things come to mind. These are my thoughts and in no way reflect the opinions of the other judges.   \n   \nMy initial reaction the designs to date is that there is a heavy emphasis on clever ideas and concepts but not much attention to detail or craft. I will definitely be looking for the latter when I make my choices. Ideas are the easy part...execution is 99% of the battle.   \n   \n-Rich\n\n",
  "author": "Jared Benson",
  "time": "9 Aug 2002 — 11:50am",
  "uid": "3",
  "comments": [
    {
      "time": "9 Aug 2002 — 12:48pm",
      "content": "I think you might need to make the prize a bit more than 3 free t-shirts that the guy designed himself...   \n   \nhhp\n\n"
    },
    {
      "time": "9 Aug 2002 — 1:30pm",
      "content": "Jared/Rich\n\n"
    },
    {
      "time": "9 Aug 2002 — 5:14pm",
      "content": "Lines & Splines and Typographer.com have closed their doors recently. We don't intend to follow! Every entry to the Typophile Tee contest is showing your support for what we're trying to build here, and is greatly appreciated.   \n   \nThanks to everyone who has submitted designs. Keep 'em coming! We have received entries from literally all over the globe. I can't wait to find out which shirt the judges pick-   \njb\n\n"
    },
    {
      "time": "9 Aug 2002 — 7:40pm",
      "content": "i agree with Cchs completly on spec contest work and the reasoning behind why someone would want to put time into a shirt idea for this forum.   \n   \nas for an overall impression, i think freehand and illustrator are influencing the concepts a little too much\n\n"
    },
    {
      "time": "9 Aug 2002 — 9:14pm",
      "content": "Amen Michael!   \n   \nI touch on this very subject in an introduction to an upcoming book on logo design:\n\n> \"While the residue of the evaporating .com aesthetic still skulks in the drop-shadows and glows of six-color photographic logos, and many marks still bear the imprint of the designer\n"
    },
    {
      "time": "10 Aug 2002 — 10:28am",
      "content": "Concerning what Rich Roat wrote (!) concerning his well-placed preoccupation with craft, in the context of this good-samaritan-style contest allow me to make the following suggestion:   \n   \nMaybe the submissions should be regarded as only nearly-finished, and the winner should be:   \n1. Judged based on the assumption (or rather the hope) that -once chosen- the designer will refine it before production.   \n2. Provided with (entirely voluntary) recommendations by the judges as to how to improve the craft (but no recommendations concerning the concept). These recommendations can be taken up by the designer, or not.   \n   \nI think it should be a balance between concept and craft (not letting the latter take absolute precedence) - and I suspect many or all of the judges might agree. A shirt with horrible craft shouldn't be chosen, but one with a great concept that just needs polish shouldn't be discarded as-is, for the simple reason that it takes too long to make it user-ready to justify the largely intagible gain from the weak possiblity of winning - this thing has turned out to be pretty competitive. When you know you've won, you're much more motivated to finish it up for real.   \n   \nAlso, a question: is it possible to revise a submission, or should people simply submit a new version alongside?   \n   \nhhp\n\n"
    },
    {
      "time": "10 Aug 2002 — 10:43am",
      "content": "I agree with your suggestions completely.   \n   \nDiane\n\n"
    },
    {
      "time": "10 Aug 2002 — 2:08pm",
      "content": "I am with HHP.   \n   \nJacques\n\n"
    },
    {
      "time": "10 Aug 2002 — 10:29pm",
      "content": "Revisions are happily accepted. We were hoping that by posting the entries to the forums, they would be up for peer critique, and the designer could revise and repost.   \n   \njb\n\n"
    },
    {
      "time": "12 Aug 2002 — 6:46am",
      "content": "My take on contests is that you submit your best work. If you don't have time to do your best work, don't submit it. Contests are non-revenue projects, so I don't think they should be regarded as \"spec work\". And having printed a few t-shirts myself, I'm sure Jared & co. are not going to suddenly be the recipients of a financial windfall on the sales of the new typophile t-shirt. Anything they do make, they certainly deserve for creating this great forum.   \n   \nIf some of the folks commenting in this discussion are creating entries for this contest, maybe you spend more time creating a good design rather than thinking of excuses and rationalizations for a bad one.\n\n"
    },
    {
      "time": "12 Aug 2002 — 8:33am",
      "content": "Rich\n\n"
    },
    {
      "time": "13 Aug 2002 — 8:24am",
      "content": ":-)\n\n"
    },
    {
      "time": "13 Aug 2002 — 12:34pm",
      "content": "i agree with mr roat. this is not work - everyone is here doing this for free and for fun. if you don't think it's fun designing a t-shirt, after some of the boring corporate crap you have to work on during the day, go and watch tv instead.\n\n"
    },
    {
      "time": "13 Aug 2002 — 12:57pm",
      "content": "On the other hand, it's probably safe to say that the better a graphic designer, the less time he has to design a shirt with no reward and minimal prospects of success. My point is that if you make the \"polishing\" provisional (to be applied to the winner only), and you make that fact clear, you then open to door to greater and higher-quality submissions, even if they're of an \"exploratory\" nature. Look at it this way: the designer is submitting nearly-finished work-in-progress to the client. This is important because this client is a mute until the moment of truth.   \n   \nFree work is to be encouraged. But choosing the judging parameters carefully helps improve the eventual results. In fact, the official judging guidelines say nothing about highly exacting craftsmanship. Maybe that was an -unwitting- good \"feature\" of this contest?   \n   \nAnyway, I don't mean to whine. I think one great side-benefit of this contest is that it serves as a tool to learn how to do this better next time. This type of thing is a novelty, with a lot of potential, and it can only improve with critical real-world testing.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Aug 2002 — 6:47pm",
      "content": "Maybe we could have a t-shirt section under the critique forum? That way even after the contest people could play around with tshirt designs. And the world will be a better place...\n\n"
    },
    {
      "time": "14 Aug 2002 — 1:18pm",
      "content": "sure, because if it turns out that one of the runner-up shirts is in high demand, we could always print that as well.\n\n"
    },
    {
      "time": "13 Aug 2002 — 2:41am",
      "content": "Dear Mr. Papazian and Mr. Simmons,   \n   \nAs soon as the judging is done we'll be sending you   \nthe winning designs for final tweaks before rounds two   \nand three.   \n   \nThen after these rounds are judged, we'll send another   \nbatch to Mr. Simmons who will finish the production.   \nThanks for so kindly volunteering. We'll give you a   \nfree shirt for being so giving with your time.   \n   \nLove and hugs,   \n   \nTypophile   \n   \n\\_\\_\\_   \n   \nAhem, all in good fun.   \n   \nJust don't forget that we're all volunteering here --   \ncontestants, judges and moderators alike. Please just   \nsubmit your best work. If someone suggests something   \nin these critiques that tickles your fancy, then rework   \nyour design and send it in.\n\n"
    }
  ]
}
