{
  "id": "19874",
  "title": "Drop caps and quotation marks",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've been looking around and can't seem to find any clear information on this anywhere; If I use a drop capital in a sentence beginning with a quotation mark, what is the convention as far as the mark is concerned? Do I:\n\na) Include the mark, adjusted to the same size as the cap, or\n\nb) leave it out?\n\nThanks in advance for any advice!\n\n",
  "author": "jnbixler",
  "time": "11 May 2006 — 5:56am",
  "uid": "12882",
  "comments": [
    {
      "time": "11 May 2006 — 6:46am",
      "content": "Bringhurst says put it in, the examples he shows has the mark at a larger size than the body text (definitely not the equivalent size of the drop cap), and overhanging the lefthand margin if necessary, an \"A for example offers plenty of space to include it in the measure.  \nHe also says that the convention of dropping it is a result of the difficulty in setting it in metal and for the reader's sake and with the ease of digital setting to keep it in.  \nSo I think the convention (insofar as one exists) is  \nc) Include the mark, adjusted to suit the cap but not necessarily of the same size.  \nTim\n\n"
    },
    {
      "time": "11 May 2006 — 6:47am",
      "content": "I wouldn’t leave it out. How would people know it’s a quote?\n\nIf you think it’s too big, then you can always reduce the size a bit.\n\nEdit: Whoa, it took me _longer_ to write _that_?  \nBut yeah, I agree with Tim completely. And Robert, too.\n\n"
    },
    {
      "time": "11 May 2006 — 8:26am",
      "content": "You have to include it so people know it's a quote, but it can/should be smaller than the drop cap, but bigger than the text size. You'll probably have to play with kerning and baseline shift to make it look OK, it should align at top with the drop cap. Of course this also necessitates (in Quark) making your drop cap 2 characters.\n\n"
    },
    {
      "time": "11 May 2006 — 9:12am",
      "content": "Hey boys and girls, ladies and gentlemen...  \nI just recently reviewed sample specimens of lead caps _without opening quotation marks_ shown in Walter Tracy's Letters of Credit (hardbound first edition).\\*\n\nI have used cap lead-ins both with and without open quotation marks. I personally believe it depends on the publication you are working on the and the level of typographic style. As long as there are _closed quotation marks_ it is correct.\n\nHaven't you seen long series of sequential quotes as typeset in plays? It was not uncommon at the beginning of paragraphs _not_ to use open quotation marks at the beginning but use closed quotations only. (Can't get to show samples until tomorrow, not near my scanner today)\n\n\\* _EDIT: Apologies, my poor recollection. It was NOT 'Letters of Credit' but was another book I was looking at at the same sitting... \"Buddha: Life & Teachings\" published by Peter Pauper Press, illustrations by Jeanyee Wong._\n\nAlso, more apologies... I mistook the chapter opening to be the beginning of the quotation by Prince Siddhattha, but there IS an open quotation mark within the context of the first paragraph. Guess I should't be quick to recall matters of typographic details!\n\n"
    },
    {
      "time": "11 May 2006 — 10:14am",
      "content": "I've seen it the other way, Norbert. You often see a quote of many paragraphs. There will be starting quotes at each paragraph, but only one ending quote. The idea is that the start quotes remind the reader that we are still in a quotation, and the only closing quote is needed to completely end it.\n\n(But I know some editors that will make you throw in the additional close quotes.)\n\nI've never seen open quotes omitted, but closed kept. To me that is like closing the barn door after the horse gets out.\n\n"
    },
    {
      "time": "11 May 2006 — 10:27am",
      "content": "\\>To me that is like closing the barn door after the horse gets out.\n\nOr discovering that you've been in a barn for the last paragraph, I hate that, it interferes with my reading pleasure by destroying continuity and in the meantime all the livestock have escaped. Mind you I'm not keen on Don's example either, I know I'm in a barn, stop distracting me.  \nTim\n\n"
    },
    {
      "time": "11 May 2006 — 11:03am",
      "content": "I think Don is right - the convention is that each paragraph of a long quote should have opening quotes but there shouldn't be end quotes until the very end of the quotation. It is probably ok to omit opening quotes on every paragraph as long as they are clearly at the start of the quote. But to put end quotes on every para would be confusing.\n\n"
    },
    {
      "time": "11 May 2006 — 11:48am",
      "content": "Certainly the classical convention would be to leave the initial quote out; I realize that our proud insistence on consistency - say that ten times fast - is the reason for the suggestions above ... but really, it looks pretty crummy. Ideal situation would be to rewrite the paragraph so that it doesn't begin with a quote, but barring that, I'd leave it off. Just my 2¢ though.\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20150227204220/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": "11 May 2006 — 11:50am",
      "content": "I think you have to let people know they're reading a quote. Another way to handle it if you don't want an opening quotemark would be to treat the body of the quote in a different way than the text - either italics or indented or a different size so it's clear to the reader that it's a quote.\n\n"
    },
    {
      "time": "11 May 2006 — 12:57pm",
      "content": "Just a reminder...  \nnormal style standards for opening quotations of text the same point size is not being debated.\n\nOnce a large lead-in cap was decided on, it's became the typographer's (back in the days when it was an actual profession) or designer's obligation to make it work right, whether it was simply the first letter of the sentence or a quote.\n\nMy first inclination was and is always to seek one or more reliable references, then decide whether I break the rules or not.\n\nYou can't use the same guidelines for every situation. If you are designing a broadside or poster with short text, or if you are laying out a five-hundred page book... different situations call for different solutions.\n\nI follow conventions until they make no sense.\n\n"
    },
    {
      "time": "11 May 2006 — 1:58pm",
      "content": "Quite right Norbert, obligation to the reader should be the background to that decision, and each occasion should be decided on its benefits rather than one size fits all.  \nTim\n\n"
    },
    {
      "time": "12 May 2006 — 7:58am",
      "content": "Thanks for all the great advice everyone! I think I'll just try it a variety of different ways and see what looks best.\n\n"
    },
    {
      "time": "12 May 2006 — 11:17am",
      "content": "PLEASE NOTE: I made an edit to my comment above about seeing an example of 'no open quotation mark' with a drop cap. But it still doesn't change my viewpoint on style rules versus typographic decisions to benefit the readers' experience.\n\n"
    }
  ]
}
