{
  "id": "19895",
  "title": "greek old style !!",
  "forum": "Design",
  "tags": [

  ],
  "content": "hello guys!\n\nso, im designing a lettering for a short-film that have connection to greek matemathics Euclides, so i wanna learn more bout the typographic culture in greece, the styles, forms, history, does anybody can help me or knows where i can find such material ? or, indicates me some font faces !! thanx a lot\n\n",
  "author": "<a href=\"/web/20101218215818/http://typophile.com/user/11632\" title=\"View user profile.\">dblanco</a>",
  "time": "<br>",
  "uid": "11632",
  "comments": [
    {
      "time": "",
      "content": "• Lithos  \n• Herculanum  \n• Pompeijana  \n• Rusticana\n\nIs roman close enough to greek? These are antique, anyway. ;-)\n\nOf course, greek isn’t written with the latin glyphs. I don’t know how cool it is to write English with greek letters.\n\n"
    },
    {
      "time": "",
      "content": "The more \"secure\" the users of a script are (and the West is certainly no wilting lily) the more it's OK to infuse that script with attributes of another. Plus English is the current lingua franca\\*, so it's used for almost everything, including tons published outside the West, so it's almost unavoidable. I would in fact suggest a \"Hellenized\" font for this, as long as style doesn't totally overpower functionality. But I can only think of two good ones: Skia; and something once shown to me by Michail Semoglou with elegant, well-crafted forms.\n\n\\* Next up: Mandarin. South Americans being ahead of the curve in that.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "thankya man !!\n\n"
    },
    {
      "time": "",
      "content": "ATF created a Greek looking font called Perlcles, circa 1920s - Persephone NF by Nick Curtis is a version of that font (My Fonts 20$).\n\n"
    },
    {
      "time": "",
      "content": "P-22 \"Acropolis Now\"\n\n"
    },
    {
      "time": "",
      "content": "[THIS](http://web.archive.org/web/20101218215818/http:/cg.scs.carleton.ca/~luc/greek.html) is probably more than you're looking for, but it might be worth a perusal.\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n [http://homepage.mac.com/mwebert](http://web.archive.org/web/20101218215818/http:/homepage.mac.com/mwebert \"http://homepage.mac.com/mwebert\")  \n [mwebert@mac.com](mailto:mwebert@mac.com)  \n--------------\n\n"
    },
    {
      "time": "",
      "content": "[Jim Rimmer](http://web.archive.org/web/20101218215818/http:/typophile.com/wiki/Jim%20Rimmer)'s version of Pericles: [Cadmus](http://web.archive.org/web/20101218215818/http:/p22.com/rtf/products/cadmus.html)\n\n"
    },
    {
      "time": "",
      "content": "Carter had a font called Cadmus (and it's culturally quite significant).  \nIt's a Greek font, but I still wish you/Jim had chosen another name.  \nWhich is not to say I don't think Jim's design is very nice - way better  \nthan Lithos. Way.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "well, Elizabeth got renamed: she's now [Isabelle](http://web.archive.org/web/20101218215818/http:/p22.com/rtf/products/elizabeth.html)\n\n"
    },
    {
      "time": "",
      "content": "Dblanco,\n\nYou might find it useful to look at Robert Bringhurst's The Elements of Typographic Style (3rd ed.), especially pp. 106-113 and 273-278.\n\nAlso, have a look at the opening credits for the film Code 46. They are typographically very clever and the approach might work very well for your project.\n\nIf you like what you see in Code 46, or otherwise choose to use Greek as well as Latin characters, Bringhurst has useful suggestions on choosing complementary typefaces.\n\n"
    },
    {
      "time": "",
      "content": "One other suggestion...\n\nIf I were doing this, I'd want to have a quick look at the design and typeface of the English edition of a book by Nikos Kazantzakis called The Odyssey: A Modern Sequel. I'm thinking especially of the hardcover edition, not sure if the paperback is designed the same way.\n\nIf you aren't familiar with Kazantzakis, you may know him as the author of Zorba the Greek.\n\n"
    },
    {
      "time": "",
      "content": "i´d like to thank everybody for the tips and information ! so useful ! ill post the lettering as soon as possible\n\nthanx a lot!!\n\ndiogo\n\n"
    },
    {
      "time": "",
      "content": "Diogo,\n\nBringhurst discusses a number of the type faces mentioned earlier in this thread at pp. 281-87 and 118. As Grot hints, a number of them are of Roman rather than Greek inspiration.\n\n"
    },
    {
      "time": "",
      "content": "Hi Diogo,\n\nSpeaking of Bringhurst, if you can find a copy of the [companion](http://web.archive.org/web/20101218215818/http:/www.bibliopolis.com/cgi-bin/biblio/stoutbooks_64896.html) to his [Parmenides](http://web.archive.org/web/20101218215818/http:/www.peterkochprinters.com/show.php?bookid=3) there is some fairly thorough discussion on the movement from the ancient, unicameral & atonic Greek to the bicameral & polytonic form, and back to the ancient form with the type designed for the Parmenides book. An interesting read to anyone interested in fine book printing & production, but likely particularly useful for you.\n\n"
    },
    {
      "time": "",
      "content": "One thing one should be aware of when alluding to Greek is false friends, i.e. glyphs that look identical to Latin characters but linguistically have nothing to do with them. This especially concerns P and X. For example, I always get annoyed when I see [this pseudo-Greek logo](http://web.archive.org/web/20101218215818/http:/www.parkhaus-kenzingen.de/index.php) used by a local club in Southern Germany (logo is in the upper right-hand corner). It's obviously supposed to spell \"EXODUS\", but it really reads something like \"echodths\". It looks mixed-up and silly.\n\nAs a completely unrelated piece of trivia, my impression from holidaying in Greece is that the number plates of Greek cars only use glyphs which are shared by both scripts. This means that they are limited to the fourteen letters ABEHIKMNOPTXYZ. (I suppose C would also qualify if one is prepared to stretch the rules a little, but it does not seem to be used.) Presumably the Greek traffic authorities don't expect foreign police officers to be able to deal with a xi or an omega in a Greek registration, while Cyrillic countries seem to have no qualms about using their characters.\n\n"
    },
    {
      "time": "",
      "content": "I actually feel that even those that <cite>are</cite> linguistically related (called  \n\"cognates\" - a term I got from John H) should be consciously differen-  \ntiated, for reasons of cultural -hence functional- distinction.\n\nInteresting observation about the license plates. It's probably  \nfacilitated by the Greek malleability in accomodating tourists!\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_False friends._\n\nYeah, I always read the KIA car logo as KIL, and I'm not even Russian or Greek.\n\n"
    },
    {
      "time": "",
      "content": "exactly that relation christoph post i want to avoid by posting this topic...as the lettering has many others references, i ll focus on the visual style of greek antique alphabets rather than the glyphs itself\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20101218215818im_/http:/typophile.com/files/lettering_quinto_teste02_5630.jpg)\n\nhi there! well, thats a sketch i did for the lettering.  \nin my researches i found some old cursive greek fonts so i decided thats the path to follow, as i said before, among with the movie others references  \ni know thats some strange points (like the U, postulado T, L, etc) im working on it and i want to know yours opinion bout it  \nthank ya\n\n"
    },
    {
      "time": "",
      "content": "You have probably considered these issues, but here are some things that I would be thinking about in relation to this design, which I assume is the title of the film:\n\nWill the film be seen on a large theatre screen or a relatively small television screen? If the former, does it nevertheless need to be made in a way that is consistent with television viewing?\n\nWhat is the aspect ratio of the frame and how does this affect the design of the credits? If it is 16x9 (widescreen), is it nevertheless necessary to protect for 4x3 (the aspect ratio of the vast majority of television screens)? Or, if you are shooting 16x9, will it be letterboxed for TV?\n\nWill the credits be computer generated using, eg., Adobe AfterEffects, or will they be photographed? If photographed, are you concerned that a white/light background may show dust/dirt when projected/broadcast at viewing size? If photographed with a film camera, what is the emulsion's grain/resolution like at the anticipated enlargement(s)? If photographed with a video camera, what quality/resolution?\n\nAs a rough benchmark, it is useful to know that super 16 film and high definition video have similar resolution. Thirty-five mm is better and super 8, standard 16 and standard definition video are worse. If the credits are going to be photographed with a consumer video camera, it might be a good idea to do a test before going further down this road. You might or might not be satisfied with the results.\n\nWill the credits be run on their own against a solid screen (what colour?) or superimposed over or beside photographic images? In other words, will there be something on the screen, other than type, competing for attention?\n\nHow many seconds will the audience have to grasp the title of the film?\n\nDo you plan to do all of the credits this ornately? If so, how many credits are there and how long will each of them be on screen? If not, what kind of type will be used for the balance of the credits/end credits?\n\nHave you considered making overt use of Euclid's postulates in the credits?\n\nI still think that you should have a look at the credits for Michael Winterbottom's Code 46 :). In your case, the Code 46 approach would involve doing all or most of your credits in Greek and resolving each credit, directly or perhaps using other languages along the way, to Portugese. If I have translated the text correctly, and the film focuses on the fifth postulate, it might be fun to go from Greek to Portugese via the languages of prominent mathematicians who challenged the postulate. This kind of thing would be more work than static credits. However, this is, after all, a motion picture, in which type, if desired, gets to move.\n\n"
    },
    {
      "time": "",
      "content": "I think you should stick to one particular font. Randomization will not help you much. You could also try a 'geometric' font (Futura?) since Euclid is famous for his Elements of Geometry.\n\n"
    },
    {
      "time": "",
      "content": "dblanco,\n\nMy post may have raised a bunch of issues that you are already on top of. If so, sorry for getting sidetracked.\n\nTo respond to your direct question, I had trouble identifying the words in the title, less so with Quinta than Postulado. Perhaps others did not have the same difficulty, and it is possible that a native speaker of Portugese would have no difficulty whatever.\n\n"
    },
    {
      "time": "",
      "content": "hi!  \nwell, im back, hehe and know with the \"almost\" final lettering, i hope you post some comments bout it\n\nhey redge, the lettering will appear only in the movie poster, so, i dont need to concern bout the issues you have raised above (thank god) heheh, thanks anyway...and im courious bout the code 46 movie, but i didn´t find it yet !!!! ioahei\n\nthanks erveryone\n\n ![](http://web.archive.org/web/20101218215818im_/http:/typophile.com/files/lettering_quinto2_4914.jpg)\n\n"
    },
    {
      "time": "",
      "content": "If that is for a poster, I think that this is an eyecatching, fun design.\n\nNot claiming to have any expertise in Brazillian Portugese, my sense is that a Brazillian will see Quinta rather than Quinto and Postulado rather than Postelado, but I'm a little less sure of the latter. Anyway, you are the expert on Brazillian clarity.\n\nIf my assumption that the film focuses on the fifth postulate is correct, the way that the two words are balanced is cool. I love the relationship between the Q amd P and the placement of the circle over the i.\n\nit strikes me as very Latin American, which I say as a compliment.\n\nIs the poster strictly type or is there also an image element? This might have a bearing on the vertical spacing between the two words and their horizontal placement.\n\nI think that you can get this to the point where the producer wants to use it for the title on screen.\n\nThis is a big improvement on the original sketch. I'd love to see the final design.\n\nVery curious to know what other people think and to see their suggestions.\n\nWhat do you mean you can't find Code 46? Given where you are going, it is pretty much irrelevant, but even so, like several of Winterbottom's films, it is a cult film, and ought to be available at your local cult film video store :)\n\n"
    },
    {
      "time": "",
      "content": "Cancel this guy pronto.\n\nhhp\n\n"
    }
  ]
}
