{
  "id": "19924",
  "title": "The sad tale of the fonts I can't have...",
  "forum": "fontplayer's blog",
  "tags": [

  ],
  "content": "•I have decided to stop reading the topic about the best fonts I can’t have. It is making me uneasy. Probably something related to coveting.\n\n•Today I made a website for the bass player I play with. (He was too good not to have one, and didn’t have the money). Probably because the recent discussion had made me remember it, the main font I used was Devroye for the buttons etc. I was a little surprised by the ampersand:\n\n ![](http://web.archive.org/files/bassguitarclear_6535.gif)\n  \nBut it has been growing on me all day.\n\n•So, I just read that the maker of my favorite sans font (that I can never have) has been hired by Linotype to be their font director. I can’t accuse them of bad taste.\n\n•I don’t know why I haven’t been able to think of a good controversy to start to get my posting average up a little. I guess I covered all the bugaboos already. I could fall of the list if something doesn’t heat up.\n\n•Kudos to the ID people here. This has to be the best place for type ID. I am very impressed. It was hinted that Stephen Coles has a secret method, and will be revealing it one day. I wonder if I understood that correctly…\n\n",
  "author": "<a href=\"user/12014\" title=\"View user profile.\">fontplayer</a>",
  "time": "<br>",
  "uid": "12014",
  "comments": [
    {
      "time": " 13 May, 2006 - 7:31pm",
      "content": "Typophile’s ID hounds are nothing short of terrifying.\n\nhhp\n\n"
    },
    {
      "time": " 14 May, 2006 - 12:40am",
      "content": "Secret method: storing no memory of any useful information such as names, events, or location of personal belongings leaves plenty of room for typeface shapes.\n\n"
    },
    {
      "time": " 15 May, 2006 - 6:28pm",
      "content": "Identify a typeface for someone and they know a font for a day…  \nTeach someone to recognize letters and they’ll have OCD for the rest of their lives. ;-)\n\n"
    },
    {
      "time": " 15 May, 2006 - 9:00pm",
      "content": "_Secret method: storing no memory of any useful information such as names, events, or location of personal belongings leaves plenty of room for typeface shapes._\n\nI am very familiar with the general method, but haven’t managed to apply the resources. Memory may just be a figment of my imagination.\n\n"
    }
  ]
}
