{
  "id": "19927",
  "title": "Yoshiko",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Good evening!\n\nThis font is based from memory off of a poster that my grandparents in West Virginia have; I haven't actually seen the poster for a few years because each time I'm there I forget to look at it. It's some interesting geometric art, including the text\n\nyoshiko  \nmcgaw editions\n\nin this lettering. (It also has an alternate, much thinner c and s that I will make soon.) I discovered that \"McGaw Editions\" is a company that makes posters, but when I emailed them to ask if they could tell me about that particular one, they couldn't find it in their database. (I assume it's just old, and predates their digital age.) I think it was probably hand-drawn because (1) it's old and (2) I haven't been able to find anything similar, except for one that was similar but not it (I can't find it again or remember its name). Anyways, tell me what you think.\n\n| Attachment | Size |\n| --- | --- |\n| [yoshiko1.pdf](http://web.archive.org/web/20150123034051/http:/typophile.com/files/yoshiko1.pdf) | 17.24 KB |\n\n",
  "author": "Number3Pencils",
  "time": "13 May 2006 — 8:01pm",
  "uid": "7642",
  "comments": [
    {
      "time": "13 May 2006 — 8:34pm",
      "content": "Very nice!  \nI like the lower case g, it has a nice compactness to it.  \nThe contrast between the thin characters and the wider ones is huge, it adds a lot of character.  \nNot very easily read, but cool none the less.\n\n"
    },
    {
      "time": "13 May 2006 — 8:38pm",
      "content": "I love these geometric faces of old. I wish they made they that one!!!\n\nMikey\n\n"
    },
    {
      "time": "13 May 2006 — 8:43pm",
      "content": "Frankly I'm not sure why, but I think this has potential.  \nSomething about the... terminals maybe, is making it special.\n\nf: no good.  \ni/j: make dots round? In any case, align tops of dots with ascenders.  \nr: beak needs help.  \ns: some people will tell you to make the stroke weight distribution conventional; I suggest you smile and ignore them. But do make the bottom-right curve smoother.  \np/q: it might actually make sense to make their descenders shorter than the others. Maybe the \"j\"'s too (although maybe not as short).  \nt: weak.  \nv: good idea, but a bit too full.\n\nA: a bit TOO wide.  \nI: consider serifs.  \nJ: flatten terminal shear.  \nL/T: too narrow.  \nQ: come on, live a little! :-)  \nS/V: same as in lc.  \nY: unsure; maybe try using your \"v\" structure.\n\nnumerals: rationalist. niiice. The \"one\" is bril.\n\nPilcrow: dump the little bar in the middle of the stems. And you need more heft, somewhere - that's how a pilcrow works.  \n%: the bar is cool, but flatten it.  \n&: thmooooz.  \n#: I can dig it.  \n[/]: longer bars, probably.  \n(/): wishful thinking - too much like square brackets.  \nguillemets: make more angular.  \ncedilla: out of character.  \naccents: the ring is bril, the diaeresis is OK, the rest are out of character.  \n$: nice.  \nYen: I'd use one bar; if not, lower them.  \nBP: not working. Try a smaller top.  \neszet: squashed head. Let it be what it needs to be.\n\nSpacing: too tight; the stem-stems are bunching.\n\nhhp\n\n"
    },
    {
      "time": "14 May 2006 — 12:58am",
      "content": "hrant\\> I love your thoroughness!\n\n"
    },
    {
      "time": "18 May 2006 — 10:04am",
      "content": "my personal feelings:  \nthe spacing is toooooooooooo tight. it could be loosened, if even just a tad.  \nthe ascenders are toooooooooooo short. even a slight bit of adjustment would help readability. i kept reading the d as an a.\n\n"
    },
    {
      "time": "18 May 2006 — 11:14am",
      "content": "too loose and it will lose its charm. this could never be a text-face or even a subhead-face, but as a display-face it has some retro promise.\n\n"
    },
    {
      "time": "1 Jun 2006 — 2:21pm",
      "content": "I think Paul is right about the ascenders. Tiffany is quite right, too, but a little more unevenness would make it more lively. Hrant is right about the numerals as well: their style is a counterpoint to most of the letters' one.\n\nMy idea: heighten the ascenders a little, differentiate a bit some forms to get rid of an excessive homogeneous quality. Don't know how to do it without loosing the general feeling, anyway.\n\n"
    }
  ]
}
