{
  "id": "19943",
  "title": "George Salden's York and the Clinique Logo",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "In another Typophile thread, \"The best fonts you can't have\", I had mentioned Antikva Margaret and how I wished someone would digitize this wonderful forgotten face. While no one has yet to do this, I had mentioned another font I loved too- York by George Salden.\n\n[http://www.dafont.com/jorvik-informal.font](http://web.archive.org/web/20150416052009/http:/www.dafont.com/jorvik-informal.font \"http://www.dafont.com/jorvik-informal.font\")\n\nI know very little about it. It was released by Visual Graphics Corporation in 1966. There was a bold and black weight and that's it.\n\n ![](http://web.archive.org/web/20150416052009im_/http:/typophile.com/files/jorvik_4325.png)\n  \nAndreas Höfeld has done a digitization of York called Jorvik. While for the most part the glyphs are true to the original design, there are many details that have been rendered imprecisely or flat out badly. And technically the font has very bad kerning and line spacing. But for the price of free I can use it and enjoy it for its beauty.\n\nYork's alphabets evoke the idiosyncrasies of carved linoleum or some other chiseled surface by way of its variable stroke widths. Its eccentric too. Notice these looped lowercase alphabets y,k,w and v- all unique to York. Also the tops of many of the lowercase and capital letters have a peculiar stress- lowercase b, e, g, i, o and p. The capitals are not without their unique features either. Notice the overall incised look and the asymmetrical spurs in the E, K, N, and T. And my favorite glyph?- the lowercase w. It looks like a flower.  \nYes, York is organic and filled with unique details that makes this typeface both powerful for display and endearing for (very) short captions.\n\nAnd it is for powerful display work that you can appreciate the uncommon York in one of the worlds most recognizable cosmetic brands- Clinque. I have always wondered what is that font! Then a few nights ago I was looking at some old Insti-Type pressure transfers sheets. There was Antikva Margaret and York and some other 'goodies'. I looked them over several times and then while I was looking at York- click! The Clinique logo font! While probably the most trivial revelation in my life it was an enjoyable one none the less.\n\n ![](http://web.archive.org/web/20150416052009im_/http:/typophile.com/files/clinique_splash_logo_3414.jpg)\n\n ![](http://web.archive.org/web/20150416052009im_/http:/typophile.com/files/clq_63M8_250_5237.jpg)\n\n ![](http://web.archive.org/web/20150416052009im_/http:/typophile.com/files/clq_6606_250_6080.jpg)\n\n ![](http://web.archive.org/web/20150416052009im_/http:/typophile.com/files/CLINIQUEISYORK_3729.png)\n  \nSo the next time your in the mall and you feel a \"Bonus Time\" lipstick tote coming on, take a gander at the Clinique counter and check out Georg Salden's York in use for all its eccentric ways.\n\n;-)  \nMikey\n\nPS... I attached a 'specimen' of Jorvik. You can leave a comment about the design as well. I'm a student and constructive criticism helps. Thanks again.\n\n| Attachment | Size |\n| --- | --- |\n| [Jorkvik.pdf](http://web.archive.org/web/20150416052009/http:/typophile.com/files/Jorkvik.pdf) | 25.48 KB |\n\n",
  "author": "SuperUltraFabulous",
  "time": "16 May 2006 — 4:45am",
  "uid": "12479",
  "comments": [
    {
      "time": "16 May 2006 — 5:23am",
      "content": "Loosely related:  \n [http://houseind.com/showandtell/index.php?id=177](http://web.archive.org/web/20150416052009/http:/houseind.com/showandtell/index.php?id=177 \"http://houseind.com/showandtell/index.php?id=177\")\n\nHaha.\n\n"
    },
    {
      "time": "16 May 2006 — 6:34am",
      "content": "Good eye!\n\nAnother AH font I like is Fanjofey:\n\n ![](http://web.archive.org/web/20150416052009im_/http:/typophile.com/files/fanjofeyleoda_5645.jpg)\n  \nGapstown is a very nice hand font also. \n"
    },
    {
      "time": "16 May 2006 — 4:07pm",
      "content": "FontPlayer\\> Auptimagh is a good one too.\n\n:-)\n\nMikey\n\n"
    },
    {
      "time": "16 May 2006 — 4:25pm",
      "content": "Grot Esqué\\> hehehehe... bonus time plagiarism indeed!\n\n"
    }
  ]
}
