{
  "id": "19945",
  "title": "(x) Taxi TV series logo - custom drawn (similar to Pioneer) {Patricia, Mark S}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Thanks\n\n| Attachment | Size |\n| --- | --- |\n| [Taxititle.jpg](http://web.archive.org/web/20071102091638/http:/typophile.com/files/Taxititle.jpg) | 3.98 KB |\n\n [‹ (x) monospaced tech sans - Monaco {Mark S}](http://web.archive.org/web/20071102091638/http:/www.typophile.com/node/19959 \"Go to previous forum topic\") [(x) Wallpaper serif italic w/ swashes - Big Caslon {Geoff} ›](http://web.archive.org/web/20071102091638/http:/www.typophile.com/node/19947 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071102091638/http://www.typophile.com/user/4510\" title=\"View user profile.\">stephen_k</a>",
  "time": "<br>",
  "uid": "4510",
  "comments": [
    {
      "time": " 16.May.2006 6.49am",
      "content": "Pioneer\n\n[http://www.myfonts.com/fonts/linotype/itc-pioneer/](http://web.archive.org/web/20071102091638/http:/www.myfonts.com/fonts/linotype/itc-pioneer/ \"http://www.myfonts.com/fonts/linotype/itc-pioneer/\")\n\nEdit: nope the X is wrong.\n\n"
    },
    {
      "time": " 16.May.2006 7.17am",
      "content": "I can’t really tell from your sample but if it’s rendered in 3D. If it is, I think it’s likely that it was custom designed in the 3D modelling software as the stroke widths of A seem odd.\n\n"
    },
    {
      "time": " 16.May.2006 7.36am",
      "content": "This is from a TV series that began airing in 1978. I seriously doubt that they used 3D modeling software for something like this. More likely this was hand drawn and based loosely on Pioneer.\n\n"
    },
    {
      "time": " 16.May.2006 7.46am",
      "content": "1978.. that’s before my time! Mark, you’re probably right that it is hand drawn.\n\nBTW, I purchased your Refrigerator family a while back and yesterday I realised I had lost it again in a recent crash and I was too embarrassed to ask you for another copy again. But somehow I figured out the ’extended download service’ that I paid at an extra cost and got the backed up copy! So that service works well. :^)\n\n"
    },
    {
      "time": " 16.May.2006 8.52am",
      "content": "Geoff, glad to hear it. I usually only hear when something goes wrong (which, thankfully, is not that often). :-)\n\n"
    },
    {
      "time": " 16.May.2006 11.24am",
      "content": "I actually designed a book on Taxi way back in the ’80s when it was still on TV. I had to recreate that type with an enlarged stat and a rapidograph. I also had to draw the “checkers” border by hand, imagine. But the strangest part was that I needed a to draw a checker cab icon but had no reference (long long before google) and looked out my office window and there was one stopped at a light right across the street. It was one of maybe 4 or 5 still running at that time. Did a quick sketch right then and there.\n\nYoung designers don’t know how easy they have it.\n\n"
    }
  ]
}
