{
  "id": "19955",
  "title": "Books about individual typefaces",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I know of two books devoted to individual typefaces - Justin Howes' \"Johnston's Underground Type\" and Lars Muller's \"Helvetica - Homage to a Typeface\". Are there others? I'm talking about real books that treat the design, designer, context and use of the face - not just specimen books.\n\n",
  "author": "londontype",
  "time": "16 May 2006 — 12:01pm",
  "uid": "11256",
  "comments": [
    {
      "time": "16 May 2006 — 12:07pm",
      "content": "The specimen for Garamond Premier Pro could count as a book. However, I don't think you can purchase it.\n\n"
    },
    {
      "time": "16 May 2006 — 12:52pm",
      "content": "I own a great one for Octavian.  \nThen there's Connare's booklet for Magpie.\n\nhhp\n\n"
    },
    {
      "time": "16 May 2006 — 12:54pm",
      "content": "Read Naked from Underware. You can purchase it.\n\n"
    },
    {
      "time": "16 May 2006 — 12:57pm",
      "content": "crossgrove already posted it..\n\n[http://www.underware.nl/site2/index.php3?id1=underware&id2=publications&...](http://web.archive.org/web/20140713222611/http:/www.underware.nl/site2/index.php3?id1=underware&id2=publications&id3=readnaked&id4=general \"http://www.underware.nl/site2/index.php3?id1=underware&id2=publications&id3=readnaked&id4=general\")\n\nthere's \"Read Naked\" from underware, too. it is a specimen book, but the printing is absolutely lovely. you can take the book into the sauna. there are even some printed pages that only show up in the sauna (or in a steamy enviroment, i held it over cooking water and it worked), and then you can dry it again.\n\n"
    },
    {
      "time": "16 May 2006 — 3:05pm",
      "content": "\"The Centaur Types\", by Bruce Rogers. Available both in 1949 hardcover by October House and 1996 Purdue University Press facsimile.\n\n"
    },
    {
      "time": "16 May 2006 — 6:51pm",
      "content": "How many typefaces are really worthy of book-length treatment? Nominations?\n\nRaph - there's a 1st edition of \"The Centaur Types\" on alibris.com for $104.95.\n\n"
    },
    {
      "time": "16 May 2006 — 8:03pm",
      "content": "Goudy's [Typologia](http://web.archive.org/web/20140713222611/http:/typophile.com/wiki/Typologia) covers Californian in depth, but is not soely about the typeface.\n\n"
    },
    {
      "time": "16 May 2006 — 8:50pm",
      "content": "John Dreyfus' _[Italic Quartet.](http://web.archive.org/web/20140713222611/http:/dogbert.abebooks.com/servlet/SearchResults?sts=t&an=dreyfus%2C+john&y=0&tn=italic+quartet&x=0) A record of the collaboration between Harry Kessler, Edward Johnston, Emery Walker and Edward Prince in making the Cranach Press italic._\n\n"
    },
    {
      "time": "16 May 2006 — 8:59pm",
      "content": "\"On Stone\" by Sumner Stone, about his eponymous font family. It comes off a bit self-promotional, though.\n\n"
    },
    {
      "time": "16 May 2006 — 11:58pm",
      "content": "\\> Nominations?\n\nThe main one: Legato.\n\n--\n\nBTW, anybody wanting to read Drefus's fascinating \"Italic Quartet\" but intimidated by the price tag can instead get himself a copy of the same author's \"Into Print\" (with bookfinder.com showing many copies below $50) which contains that piece as well as tons of other interesting articles as well.\n\nhhp\n\n"
    },
    {
      "time": "17 May 2006 — 6:11am",
      "content": "This probably isn't exactly what you're looking for, but I recently picked up a book at the library called \"Metro Letters, A Typeface for the Twin Cities\" that has a handful of typefaces on one theme (namely, Minneapolis and St Paul, Minnesota). It includes interviews with the various designers invited, their backgrounds, and a lot about the process involved.\n\nMost of the book is spent looking at this font:  \n [http://www.letterror.com/portfolio/twin/index.html](http://web.archive.org/web/20140713222611/http:/www.letterror.com/portfolio/twin/index.html \"http://www.letterror.com/portfolio/twin/index.html\") (check out the specimen)\n\nMy favorite quotation: \"Hopefully, no city can be reduced to a single typeface--except Monaco!\" --Gilles Gavillet\n\n"
    },
    {
      "time": "17 May 2006 — 3:55pm",
      "content": "What about _Now read this: the Microsoft ClearType font collection_ by John Berry (Redmond: Microsoft, 2004)? This is indeed 'a real book that treats the design, designer[s], context and use of the face[s] - not just specimen book'.\n\n\\> <cite>The specimen for Garamond Premier Pro could count as a book. However, I don’t think you can purchase it.</cite>\n\nThe same is true for the earlier Adobe booklets showing off and telling the stories of its other _Originals_ (e.g., Minion, Jenson, et al.)\n\n"
    },
    {
      "time": "17 May 2006 — 4:02pm",
      "content": "Oh yeah, Fedra has quite a nice booklet too.\n\nhhp\n\n"
    },
    {
      "time": "17 May 2006 — 7:35pm",
      "content": "Jan van Krimpen : Lutetia &  \nZapf : Hunt Roman, The Birth of a Type\n\n"
    },
    {
      "time": "18 May 2006 — 8:42am",
      "content": "I think i saw a book on Ross Mills's Plantagenet once at one of my designer friends' offices. Or am I thinking of something else? Does anybody know where to buy this font? some weird version of it came free on my Mac, but i can't find the italic anywhere!\n\nthanks!\n\n"
    },
    {
      "time": "18 May 2006 — 8:59am",
      "content": "[http://www.myfonts.com/fonts/tiro/plantagenet/](http://web.archive.org/web/20140713222611/http:/www.myfonts.com/fonts/tiro/plantagenet/ \"http://www.myfonts.com/fonts/tiro/plantagenet/\")\n\n"
    },
    {
      "time": "18 May 2006 — 9:54am",
      "content": "thanks so much! great stuff - love the swashes, especially the E. It makes me wish i had an E in my name! his other stuff is quite nice as well. is this fun ligature from 1570 Garamond standard in any other fonts?\n\n ![](http://web.archive.org/web/20140713222611im_/http:/typophile.com/files/garam-gg_3444.png)\n\n"
    },
    {
      "time": "18 May 2006 — 1:31pm",
      "content": "Nigella, there is no book on Plantagenet, but there is a very nice limited edition specimen, designed by the brilliant Brian Morgan. If you contact Ross (ross[at]tiro[dot]ca) you can find out more information. The Plantagenet family is one of those designs that seems to be under perpertual development, but you can enquire about licensing the current state.\n\nThe version of Plantagenet that comes with Max OS X is a subset that supports the Cherokee writing system. There is no italic for this subset.\n\nFor more information see [http://www.tiro.com/Plantagenet/plantagenet\\_index3.html](http://web.archive.org/web/20140713222611/http:/www.tiro.com/Plantagenet/plantagenet_index3.html \"http://www.tiro.com/Plantagenet/plantagenet\\_index3.html\")\n\n"
    },
    {
      "time": "18 May 2006 — 2:10pm",
      "content": "[Bembo's Zoo](http://web.archive.org/web/20140713222611/http:/www.amazon.com/gp/product/080506382X/ref=sr_11_1/103-4628160-3029427?%5Fencoding=UTF8) by Roberto de Vicq de Cumptich. It's all about one typeface even if it is a children's ABC book, It does have a brief paragraph at the end that describe Bembo's history and creators.\n\nHey, you can't start too early. As it says in Proverbs 22:6: Train up a child in the way he should go: and when he is old, he will not depart from it.\n\n"
    },
    {
      "time": "18 May 2006 — 2:13pm",
      "content": "How about that Fiona Ross book on Bengali?\n\nCheers, Si\n\n"
    },
    {
      "time": "18 May 2006 — 2:27pm",
      "content": "Roballo: good one.\n\nSimon: that's really about a <cite>writing system</cite> though.\n\nhhp\n\n"
    },
    {
      "time": "18 May 2006 — 2:53pm",
      "content": "_that’s really about a writing system though._\n\nSpecifically, about the typographic representation of that writing system (i.e. there is very little material in it about the writing system itself or about the manuscript tradition). Although this book isn't about a single typeface, the whole thing can be read as a background to the development of the Linotype Bengali, which concludes the book.\n\n"
    },
    {
      "time": "18 May 2006 — 3:55pm",
      "content": "James Mosley et al: Le Roman du Roi. La typographie au service de l'tat\n\n"
    },
    {
      "time": "18 May 2006 — 3:58pm",
      "content": "James Mosley et al: Le Roman du Roi. La typographie au service de l’ Etat\n\n(oops. I lost the E)\n\n"
    },
    {
      "time": "19 May 2006 — 6:02am",
      "content": "Don't for get about [Anatomy of a Typeface](http://web.archive.org/web/20140713222611/http:/typophile.com/wiki/Anatomy%20of%20a%20Typeface) by [Alexander Lawson](http://web.archive.org/web/20140713222611/http:/typophile.com/wiki/Alexander%20Lawson). I contains 24 chapters that are devoted to a specific typeface and 6 more chapters devoted to more general type styles.\n\nAnd American Proprietary Typefaces edited by [David Pankow](http://web.archive.org/web/20140713222611/http:/typophile.com/wiki/David%20Pankow). This one contains 10 chapters each written by a different author.\n\nAnd, of course, there is D.B. Updite's [Printing Types](http://web.archive.org/web/20140713222611/http:/typophile.com/wiki/Printing%20Types).\n\n"
    }
  ]
}
