{
  "id": "1995",
  "title": "Thoughts on David Carson...",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Curious as to the 'Type Worlds' thoughts on David carson, and his typography -- or lack thereof.   \n   \nCurious to sees other opions on his work.   \n   \nHildebrant.   \n   \n(PS. I finally got around to uploading a little 'profile picture' ![:-)](http://web.archive.org/web/20131016225553im_/http:/www.typophile.com/forums/clipart/happy.gif))\n\n",
  "author": "Hildebrant",
  "time": "8 Nov 2003 — 7:11pm",
  "uid": "1286",
  "comments": [
    {
      "time": "10 Nov 2003 — 9:38am",
      "content": "\\> \"Don't mistake legibility for communication.\"   \n   \nI do agree with that. I also think we shouldn't mistake an artiste for a craftsman - noting that we need the latter more these days. I guess my main problems with Carson are that: he seems to care about the wrong things; and that he sold out.   \n   \nI've only seen Carson speak once (ATypI-Boston), and two things bothered me:   \n1) His jab against Gerard Unger, who had presented earlier in the day.   \n2) All the Gen-X idiots fawning to lick his boots afterwards. They wouldn't know type if a case of CooperBlack-72 fell on their heads.   \n   \n\\> it's troubling that one of the top-selling design books of all time remains his End of Print.   \n   \nNot least because it's a book!   \n   \nhhp\n\n"
    },
    {
      "time": "10 Nov 2003 — 12:30pm",
      "content": "\\> CooperBlack-72   \n   \nAs apposed to a case of 6 point Gill sans light? ;)   \n   \nLol.   \n   \nHildebrant.\n\n"
    },
    {
      "time": "10 Nov 2003 — 1:25pm",
      "content": "Ha!   \n   \nI must say I was quite inspired by Carson's work when I was in art school. It is remarkable to be able to use type in such spontaneous, painterly ways, and I think it does take talent, even skill. His work is more like 'typograhic painting', rather than 'typographic design'. I cringe when students say they want to 'experiment'... what they really mean is 'I want to do some David Carson stuff'. Rebelling against rules doesn't neccessarily mean experimentation.   \n   \nThere is much to learn from Carson though, seriously. His work raises important questions like: why do designers have to be so much in control? Are left-brain activities taking over our creativity and our ability to express? What do rules mean in typography and design?   \n   \nYes, 'don't mistake legibility for communication'... I still agree with that. But I also agree with Bringhurst: 'In a world rife with unsolicited messages, typography must often draw attention to itself before it will be read. Yet in order to be read, it must relinquish the attention it has drawn.'\n\n"
    },
    {
      "time": "10 Nov 2003 — 2:16pm",
      "content": "Carson is his own worst enemy. Remember the infamous spread, where he laid out an entire article in Zapf Dingbats?   \n   \nUltimately, I feel as though Carson will be relegated to a footnote in graphic design history. While he occupied an important time in the history of our field, and at least at one point was probably the most imitated designer in the history of the craft, he's no Rand. I don't believe his work will stand the test of time.   \n   \nOn the other hand, who cares? Is design the same as fine art?\n\n"
    },
    {
      "time": "10 Nov 2003 — 3:43pm",
      "content": "Keith --   \nThanks for that quote, It has been some time since I had heard it, but it still brings a smile to my face.   \n   \nOn Carson:   \nI think the issue of designers wanting control is a good one. I don't think I consider Carson a designer, but as Keith said, mor of a 'painter'.   \nA fine artists, who puts his OWN desires before the end users. Then there is the subject of the line between fine art and graphic design. I have always voiced the determining factor in this comparison is the addition of type. But, in the case of Carson, this rather twists my theory. Possibly communicaion -- not type?   \n   \nHildebrant.\n\n"
    },
    {
      "time": "14 Nov 2003 — 12:34pm",
      "content": "FYI:   \n [http://www.underconsideration.com/speakup\\_v2/interviews/carson.html](http://web.archive.org/web/20131016225553/http:/www.underconsideration.com/speakup_v2/interviews/carson.html)   \n   \nhhp\n\n"
    },
    {
      "time": "14 Nov 2003 — 1:35pm",
      "content": "There's another Q & A with Carson in the   \ncurrent STEP Inside Design magazine.   \n   \n [http://www.dgusa.com/PUBS/STEP/step.aspx?issue=current](http://web.archive.org/web/20131016225553/http:/www.dgusa.com/PUBS/STEP/step.aspx?issue=current)   \n   \nI don't see Carson as ever becoming a footnote...in our lifetime.   \n   \n1) He's not done yet.   \n   \n2) If you have a 100-page graphic design history book, I think DC would merit a page,   \nmaybe two.   \n   \nMaybe the pages will be set in Zapf Dingbats.   \n   \nbj\n\n"
    },
    {
      "time": "14 Nov 2003 — 1:39pm",
      "content": "That issue also has coverage of IndieFonts (1 & 2).   \nAnd it's the second month in a row that our Richard has been featured...   \n   \nhhp\n\n"
    },
    {
      "time": "14 Nov 2003 — 6:34pm",
      "content": "I like his stuff alot. (I am a student) I would definately call him more of a stylist than a graphic designer. He recently moved to charleston, and its been wonderful seeing local buisnesses using him for projects. Charleston has always been really conservative so seeing his work on banners and such is quite refreshing. Hopefully he'll want me to intern for him next summer : )\n\n"
    },
    {
      "time": "14 Nov 2003 — 11:20pm",
      "content": "i think carson is amazing. despite all the criticism he faces, he was what pulled me into graphic design. as a local surfer, i found out about him a while back and attended some of his talks. he has deifinetely inspired some of my earlier work including this book i made about a year ago that deals with how a surfer can make vodou work in his everyday routine here are a few spreads from that book where im sure you'll see the influence..   \n   \n   \n ![](http://web.archive.org/web/20131016225553im_/http:/www.typophile.com/forums/messages/4100/20525.jpg)   \n ![](http://web.archive.org/web/20131016225553im_/http:/www.typophile.com/forums/messages/4100/20526.jpg)   \n ![](http://web.archive.org/web/20131016225553im_/http:/www.typophile.com/forums/messages/4100/20527.jpg)\n\n"
    },
    {
      "time": "15 Nov 2003 — 8:45am",
      "content": "So I have a question:   \nThe staggered setting of the shark quote on the bottom page, I guess it's supposed to convey the feeling of a shark attack? I'm not a surfer, plus I'm too type-conscious, so it's not like I'm a good benchmark, but to me it doesn't; such a layout could just as easily convey dancing for example. More important seems to be the font choice: that font is too \"fun\". An incised italic (like maybe Octavian's) I think would work much better.   \n   \nMy point is that I'm not a classicist, and I value intuition more than anything else (my issue is with intent, and what contemporary society really needs - ie not artistes), but I have to point out something: shark attacks are not a new phenomenon, and it's probable that a \"classic\" font (especially the stuff produced in Eastern Europe in the middle of the 20th century) would work very well - and probably be better crafted as well. Craft is important for example to convey formal harmony. And you could say a shark attack is not a form of discord, but of high harmony. Human war is very discordious (mostly because we use to much machinery: even a longbow is much less harmonious than a sword), so something like notCaslon is good for that.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Nov 2003 — 9:28am",
      "content": "\\>Carson is his own worst enemy. Remember the \\>infamous spread, where he laid out an entire \\>article in Zapf Dingbats?   \n   \nYou know why he DID this? It had a reason, and a good one.   \n   \nDavid is a tremendous artist, not necessarily bothered with conveying information,ergo not necessarily with typography in teh Tschicholdian or Morrison sense of the word, but rather with intuitive and emotional impact. Perfectly geared for the short attewntion span of the herewearenowentertainus-Generation of MTV, Carsons mid-period and later work is sometimes sparse, sometimes complex, very often strikingly beautiful, quite sometimes repetetive, and with commercial success and passing over from counter-culture to over-the-counter-culture. LIke McKean, you either like his style or you don't -- and a style it is, with Carson even narrower than with the multifacetted Mr. McKean, and although I have some trouble with his more commercial work, I really dig David and most of all the evolution his work has shown post PHASE-2. Even back in the 80s/90s, he was more about structure and IDEA and challenging the thinkinginsidetheboxmindset of many designers, shortly, he was a nicely nasty little mindfucker, and he still is. Supercially he's gotten a bit away from his pasting-type-in different-sizes-over-self-shot-pix, at least to some degree, and he's mostly post the phase of using the T26-font-of-the-week, but baby, mindfucking is still the thing he does and does pretty well. Plus, imo, he's a decent and nice guy despite the superstar-status and I cannot say that of all designers I've personally met so far.   \n   \nI still teach his work in my classes as a counterpoint to the idea that typography is about information, as one of MANY (hello Cranbrock Academy of Art, hello Saville, hello Vaughan, hello Dirk Rudolph, hello Willy Fleckhaus hello Alex Branczyk, hello Weingart... and so on...) examples that typography in many various forms is actually about conveying and manipulating emotion, at least when it's not just about tyesetting a book or so.   \n   \nPersonally, I've found that a kind of quite German minimalism and engineering-kinda reduction suits me better, no matter how much I wanna do fucked-up stuff these days, it very often ends up being very simple and empty, but for me Carson is one of the examples what post-postmodern US-Design can be about. It's big, bold, carefree, emotional, fast and very Hollywood, very keen on the big effect. And to me, much as Pentagram is british (funny, clever, absolutely-honest\n\n"
    },
    {
      "time": "15 Nov 2003 — 9:17pm",
      "content": "\\> I tried to read it.   \n   \nWhich just means you're not the target demographic. Dude.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Nov 2003 — 10:47am",
      "content": "umm HD Schellnack :   \n   \nRecently DC spoke here in Ottawa - he told us why he did the dingbat article - and it wasn't any intuitive statement - it was about dealing with clients.   \n   \nHe said he had been waiting for the article for too long - they were about to go to print on that issue. The writer had spent maybe 10 minutes with the band and written a piece of crap. David took executive decision - he didn't want to print it - it was crap. It wasn't going to be seen by anyone else before press - so he layed it out in dingbats and passed it off as a \"artsy\" spread rather then actual content.   \n   \nHe wasn't challenging raygun readers - he was hiding the sloppy job of the journalist because they had nothing that they could replace it with.\n\n"
    },
    {
      "time": "16 Nov 2003 — 11:07am",
      "content": "Further to that - he told us about a magazine cover he had been asked to do. I think it was for NY Out or something. Anyway - he said he had been putting it off, obviously his heart wasnt' into it. One afternoon the editor called - sreaming for the cover...\"we need to cover david\" \"we're going to print\" Carson has said (and he was telling us this in his lecture) that he lied through his teeth, saying that he had it almost done. He'll send it over in an hour.   \n   \nThat's when he ran to a drugstore - got a disposible camera, flung himself out the office window (In London I beleive it was) shot a pic of some other office windows, got the film developed , threw it on a scanner and sent the file to the NY magazine with a rationale saying that \"New York is all about buildings and windows\" this says it all. threw the headlines on the pic and voila - bill the sucker.   \n   \nI useto buy all the intuitive stuff when I read 2nd sight...but after hearing him speak of how he's just trying to get to the beach and surf all day. (which he did do for a Bank commercial....just used footage of him and friends surfing) I really wonder if he's thinking at all. He knows he's big, he knows he can get away with murder....he was joking about it with us and then tried to justify why his work on McLuhan wasn't readable or ledgible.   \n   \nWe're talking about McLuhan frig - the man's words should be treated with utmost care, ledgibilty a blind man could read...and he screwed it up for his \"style\"...ya wotever - designer my butt.\n\n"
    },
    {
      "time": "16 Nov 2003 — 11:14am",
      "content": "Nice to see Dave hasn't changed his presentations, he told the very same story here in Germany almost six years back, IIRC. I think making that decision -- not liking the text, which he said was less about the artist and more about the backstage feeling anyway -- was a major step in which the design finally took active editorship, where content became nothing and Carsons own opinion became everything. Imo, it was the very Zenith of his Ray Gun work -- a brilliant, simple, anarchic and impertinent idea. he said that later-on many writer complained whe he DID NOT maim their text and made them illegible -- hey, David, didn't you like my story, you DID nothing to it :-).   \n   \nAlso, I think that the (for the designer) very simple act of changing a font rendering the text illegible and making it necessary to decode the Dingbats manually is a great thing. It doesn't even matter WHY he did it, imo... it just exemplifies a lot of the typography of those days, whether intended or not. Style over Content and all that. There is a reason, why people, when asked what Ray Gun is about don't think of a certain journalistic approach or editorial viewpoint of music, but of a visual style... NOT really a good thing for a serious magazine.   \n   \nI have loads of problems with what David's style was all about, in terms of it being superficial and somewhat egodriven, but on the other hand his work was and still is more often than not often so full of energy and ideas and sparkling and a very nice -ya-attitude I find myself loving it, even a decade later, when works of other people with quite a similar look feel stilted and dead.   \n   \nCarson, harkening back to Dada and shitloads of other styles he ripped, was a great package of punk, with an immensive feeling for what just felt right on a printed page and a nice touch for improvisation. I never thought of him as a typographer or even a graphic designer but rather an artist who worked with the kind of material we designers happen to work with. Loads of people aped his superficial style, but almost no one got the fact that it never was about Style but about a personal way of expressing himself... and you can't ape that.\n\n"
    },
    {
      "time": "16 Nov 2003 — 11:35am",
      "content": "well I can agree that he's an artist sure.   \n   \nPerhaps he's a prime example of why accreditation among graphic designers is v. important. if you  with the words of McLuhan the same way you do the words of some kiddy punk band article you thought was crap, you should be nixed - your obviously not responsible enough and show no care for your clients.   \n   \nAdmittedly I'm jealous that he can take such liberties, but I'd perfer to see someone who actually cared about the profession do experimental work and gain credit for it. He may have beat down some boundaries, and we can all praise him and justify it any way we want. But, when the clients get ahold of this, and see how he was acting like a flake in front of them, laughing about it to the rest of his colleagues, I fear that the door will bounce back shut, locked, because of his loud mouth spurring disrespect, unprofessional actions and leading to more trust issues then ever.   \n   \nif he himself discounts his work - why are we defending it?\n\n"
    },
    {
      "time": "16 Nov 2003 — 2:31pm",
      "content": "Ahh, see, now this is fun. :P   \n   \nTanya, HD, both some good points.   \n   \nI tend to lean towards the isle of Tanya, although maybe not quite as militantly.   \nI personally find it disheartening, seeing others rise to stardom status with apathetic values.   \nIf for the only sake, it is that I pour so much time into my craft, trying to be the best at what I can be, giving 110% (excuse the poor sports metaphor),   \nAnd to see other rewarded for half assed efforts, then to rub it in the face of there peers.\n\n"
    },
    {
      "time": "16 Nov 2003 — 2:36pm",
      "content": "P.S.   \n   \n\"Mud sometimes gives the illusion of depth.\"   \n--Marshall McLuhan\n\n"
    },
    {
      "time": "17 Nov 2003 — 1:34am",
      "content": "when i posted those spreads earlier, i really wasnt looking for a crit. anyway, there were no intentions for that layout to \"convey a shark attack.\" the book i made was from my 1st year in design school and the project was to make a fanzine where we had to create the subject and content (at least 6000 words). We had less than a month to do this and a limit of 2 colors and 2 typefaces. Anyway, I was just posting to show the influence carson had on that particular piece.. or at least in my opinion.   \n   \n Sure, I was no expert in design or typography, and still claim to be nowhere near the vicinity of that title. I thought at the time that it was a fairly decent piece as a whole, and growing up in a surftown and surfing all my life, felt i had the subject matter down. A local surfshop actually wanted to buy several copies and sell them at their shop. The book got me an A+ in the class (which I hear are very hard to come by at my school, art center college of design, and the book was on display for a term in the gallery at my school). I'll be the first to admit this doesnt mean a thing and also that i have a lot to learn. I'm getting off track here sorry.   \n   \nBecause I was only allowed 2 typefaces (1 of them being mrs. eaves for the body.. which I felt was easy to read and gave me a sort of spell book type of feeling without being too obvious.. which related to vodou). The other typeface came from research, which consisted of going through my wardrobe.. and looking at all my surf shirts and going to surf shops. I wasnt looking for a classic feel of harmony or discord or whatever you were mentioning before, but a font that would work throughout the book that related to my subect matter... surfing and my writing style. As a student, my typeface collection is limited as well as my knowledge of all the typefaces available. That being said, its the best I could do at the time, and I am still happy with the outcome.   \n   \nBack to Carson... whether we feel his work is amazing, or we think its a disgrace, we must remeber that he is more famous than most of us will ever hope to be. He must have been doing something right, no?   \n   \n\\>Which just means you're not the target demographic. Dude.   \n   \nI think this is the point here (ignoring the stereotype you've just imposed on the entire surfing community) is that he DID indeed hit his target demographic. Every surfer I knew loved his work and I feel that as a designer, thats one of the most important goals (along with doing something you enjoy and put your heart into). Carson obviously achieved both and basically created a revolution in the design world (for better or for worse). To that I must tip my hat wheter I enjoy his work or not.\n\n"
    },
    {
      "time": "17 Nov 2003 — 1:04pm",
      "content": "\"He is more famous than most of us will ever hope to be. He must have been doing something right, no?\"   \n   \nNo. Hanibal Lector was famous (forgive the comparison), that does not excuse his actions. Basing right and wrong, or good and bad on mere fame is, in my mind, a bad idea.\n\n"
    },
    {
      "time": "17 Nov 2003 — 1:16pm",
      "content": "Hannibal Lector, sorry, is a fictional character -- and I\n\n"
    },
    {
      "time": "17 Nov 2003 — 1:42pm",
      "content": "The very fact that this discussion has so many entries has to be testimony to the fact that, whether you like his work or not it certainly stirs something in all who have seen it. (both possitive and negative)   \n   \nP.S. HD do you have any links to some of Dirk Rudolph's work as I'm ashamed to say I can't source any of it? (thankfully Saville and Oliver are of my era so I know their work)\n\n"
    },
    {
      "time": "8 Nov 2003 — 9:56pm",
      "content": "Say what people will about his style (and whether it's 'tired' or not), he's had an uncanny ability to get clients to break out of the mold. And not always clients that you'd expect to take those kind of risks.   \n   \nI love his quote: \"Don't mistake legibility for communication.\" This flies in the face of the old graphic design axiom that typography should be transparent (that the type should remain unnoticed) by the viewer. Not that I personally live or die by either one of these extremes. On the contrary, I think it's important to remember that in design everything has it's appropriate time; and design rules are best when they're broken well. Not merely breaking rules just because you can, but breaking them when it serves the communication.   \n   \nHe's also had the ability, with maybe a handful of other graphic designers, to become known outside the design world.   \n   \nAll that aside, it's troubling that one of the top-selling design books of all time remains his _End of Print_. The danger of David as a vanguard of design (in the mid '90s anyway) is the minions of people who copied him without knowing why they were doing it. But, then again, is it fair to fault him for that?\n\n"
    },
    {
      "time": "15 Nov 2003 — 9:16pm",
      "content": "I used to really like Raygun but then I tried to read it.\n\n"
    },
    {
      "time": "15 Nov 2003 — 9:16pm",
      "content": "I used to really like Raygun but then I tried to read it.\n\n"
    },
    {
      "time": "15 Nov 2003 — 9:28pm",
      "content": "Probably not, but unfortunately I was interested in some of the stuff in there, like punk music, but his style of typography just seemed to get in the way. OK, it is expressive, but I am not sure whether I agree with it being THAT expressive.   \nAeshetics is one thing, but forcing a subjective emotional response is not, in my opinion what should be done. It's too obtrusive, and I think it gets in the way of reader forming his own relationship to the content\n\n"
    }
  ]
}
