{
  "id": "19952",
  "title": "Has anyone worked with t26?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hey folks,\n\nI just released my first typeface for sale through t26, [Bauer House](http://web.archive.org/web/20150416071845/http:/www.t26.com/fonts/display.php?f_id=935). I'm somewhat new to the forums here, and to some degree I wish that I'd attempted to absorb some of the knowledge that all of you have in advance of making any distribution decisions about the typeface. But, just to start, I wanted to know if anybody has worked with t26 / Segura Inc. before and if anyone can offer any useful feedback in regards to business arrangements, etc.\n\nSecondarily, I'd like to start a sort of sub-discussion—although I'm sure this has been done many times over—about the business of type; is there as much of a typographical \"elite\" as there seems to be? Is it truly impossible to achieve monetary success through typography? In all honesty, for me, it's not cash that I'm after, per se; I just wonder who purchases type in the greatest volumes, and whether anyone has any sort of insight as to how well any licensing agreements actually do work. Having seen the amount of font piracy on the Internet (and all of the typographic piracy that has existed ever since the era of Gutenberg), it's just a bit intimidating. More than financial reward, I just want to be able to say that I've contributed some quality type to the world. I'd rather see a font of mine turn up somewhere influential than receive a tremendoid royalty check. But on the other hand, I don't want to get taken advantage of...\n\nBefore I ramble on further, let's start some sort of loosely-integrated discussion, and maybe it'll branch off in interesting directions!\n\n- Josh Korwin\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n",
  "author": "jaykay109",
  "time": "16 May 2006 — 10:04am",
  "uid": "11474",
  "comments": [
    {
      "time": "16 May 2006 — 5:47pm",
      "content": "_Is it truly impossible to achieve monetary success through typography?_\n\nYes.\n\n"
    },
    {
      "time": "16 May 2006 — 8:04pm",
      "content": "Oh, you said _impossible_.\n\nIt is definitely possible. I know of one great success story. Not to mention all the big names do quite well, I'm sure.\n\nI am very sorry to have left such a wrong response sitting there for so long. It was nice of everyone not to get on my case.\n\n"
    },
    {
      "time": "16 May 2006 — 9:09pm",
      "content": "Wow, sheesh! That would have been both incredibly depressing and alarmingly definitive. Heh.\n\nI guess as with everything, success with type might be a combination of raw talent and working one's derrière off. At least that's what I hope.\n\nTo go off on my own tangent, I think what's most puzzling to me is that typography seems to be stuck in such a corner. Not to put down the subject altogether—it's definitely my favorite—but it seems like so much of the practice and the discipline is shrouded in some veil of mystery. For example: you'd think that because a huge proportion of the world is literate, many would be interested in the letterforms of their respective languages. I meet far too few people who actually understand even the most basic typographic principles, much less those who are as drawn to the topic as I am. When I finally stumbled upon this forum I was so relieved.\n\nAnd now that so much typography is digital, why is it so darn difficult to create a digital font? The process is so shrouded in nearly inexplicable technical detail; creating a good typeface design is one thing, but creating an effective font is far more difficult. I don't know where the root of this limitation lies, but it seems so unnecessary. Or maybe I'm naïve.\n\nI'll tie it all back to the original topic: I'm kind of concerned about the fact that I will have to make back a few hundred dollars worth of royalties in order to just break even. This is because when I created Bauer House, it seemed like it was working just fine on my machine, but t26 said that there were hours and hours worth of errors that needed correcting. So, I paid them out of pocket in advance to have these errors ironed out. Even after comparing their revision to my last draft, I am unable to figure out exactly what was changed.\n\nI kind of wish there was some way I could find out exactly how to properly create perfect digital typefaces, so that I would not have to spend actual money to have these errors fixed by one apparently more enlightened than myself...\n\n[end bitching session]\n\n- Josh (reminding himself to read his own sig)\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "17 May 2006 — 7:11am",
      "content": "You may have been better served to post their critique and ask around how to perform the fixes yourself . . .\n\nStuart :D\n\n"
    },
    {
      "time": "17 May 2006 — 7:40am",
      "content": "I think I'll do that anyway—I might as well learn, because I'm already in the middle of designing a handful of new faces.\n\nPerhaps it would be better on a new thread though? This one's not getting too much attention...\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "17 May 2006 — 7:43am",
      "content": "yes, there is a section just for critique. Some responses are amazingly detailed. Post each font in a seperate thread in the section that corrosponds to the style.\n\n"
    },
    {
      "time": "17 May 2006 — 7:52am",
      "content": "Joshua, the only real money (and not gobs  \nof it) is in custom commissions, not retail.  \nBut there are good things about retail too.\n\nhhp\n\n"
    },
    {
      "time": "17 May 2006 — 8:02am",
      "content": "That makes plenty of sense. Without asking too vague and foolish a question, how does one get custom commissions? Maybe I should rephrase: I have a fairly steady stream of design work, but the types of clients that I get are unfortunately mostly not the types of clients that would ever consider doing custom type. What I need to learn, strategy-wise, is either how to sell custom type to the design-blind, or how to get design clients who are more sophisticated.\n\nHow do the big kids do this? Non-stop self-promotion? Agencies?\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "17 May 2006 — 8:30am",
      "content": "Retail can be lucrative if you are prolific \\*and\\* good.\n\n"
    },
    {
      "time": "17 May 2006 — 9:11am",
      "content": "Indeed, I should qualify what I wrote - and not by appending \"Not really.\" :-)  \nIf you have strong talents and skills in display face design (like Nick Shinn) you  \ncan indeed make good money in retail. But few people (certainly not me) have  \nthat level of experience and talent.\n\nhhp\n\n"
    },
    {
      "time": "17 May 2006 — 12:58pm",
      "content": "I imagine with all his \"cute\" script designs that Rob Leushke is doing OK, although I have nothing to back that up, other than comparisons to things I know regarding others. I'll bet Storm is doing OK too.\n\nYou might check Veer out too. And myfonts.com contract is very fair. Just about everyone markets something through them these days. It is helpful to have your own website to refer visitors to the vendor's site. And get a foundry name so you can start building a reputation. Even if it is something simple like JK Type or Korwin Type.\n\nA good teacher/mentor can certainly be helpful. Most of the biographies I see usually point to some person that took them under their wing, or taught them the ropes.\n\nKeep in mind all this comes from someone on the outside looking in, but priviledged to some information here and there.\n\n"
    },
    {
      "time": "17 May 2006 — 3:00pm",
      "content": "A couple names for type companies that occurred to me:\n\nTypecaster Fonts (play on words....get it?)  \n; )  \nFont Brewery (ties fonts and beer together. what more do you want?)\n\nFeel free to use if they aren't already taken.\n\n"
    },
    {
      "time": "17 May 2006 — 3:26pm",
      "content": "\\> Font Brewery (ties fonts and beer together. what more do you want?)\n\nWhy do you think I chose The MicroFoundry? :-)\n\nhhp\n\n"
    },
    {
      "time": "17 May 2006 — 9:00pm",
      "content": "_If you have strong talents and skills in display face design (like Nick Shinn) you  \ncan indeed make good money in retail._\n\nWhile it's true that it's generally easier to make money doing display faces (note that I said \"easier,\" not \"easy\"), it doesn't mean there is no money in text fonts. There are independent font designers who specialize in doing text fonts and are doing well with it.\n\nMaking any kind of retail font is something of a gamble. It may sell well, it may not sell at all. With a display font, you're risking some time and effort. With a big text and display family, you're risking a lot of time and effort, but the payoff can also be greater than with a display font. It takes a lot of successful display fonts to equal one successful font family. (Display fonts are more fun to do, though. :-)\n\nRegarding custom fonts: Yes, it is a more reliable source of income for a lot of professional font designers. But, it's like any other freelance creative work: The client sets the schedule and controls the creative direction. I worked as a freelance designer and illustrator for years, so I am very familiar and comfortable with this arrangement. But when I started having some success at selling retail fonts, I realized something about it: No client. Nothing against clients, but I found out that I really like working on my own schedule and having complete creative control, something I never really had before. If you can manage to get lucky sometimes and can live with the possibility that you may be completely wasting your time, doing retail fonts does have its pluses.\n\n"
    },
    {
      "time": "18 May 2006 — 12:51am",
      "content": "Mark, I'm completely with you on that. I'm a designer of custom types for more than a decade now. Right now I'm preparing my own online foundry (yes another one ;-) because I want to be slightly more independent from my client relationships. Also retail pays even when you're enjoying your holidays.\n\nDennis, I just checked the dotcom-domains. Typecaster is booked already (domain dealer). Typecast, fontcaster, fontcast as well. It's not THAT easy anymore.\n\nH.\n\n"
    },
    {
      "time": "18 May 2006 — 7:31am",
      "content": "Josh,  \nHow did you go about submitting your typeface to T-26? I am interested in submitted some designs. Did you complete the design and generate the font to submit it to T-26 or Did you just send in a preview of the character set? I assume you communicated via email? Were they quick to get back to you?\n\n"
    },
    {
      "time": "18 May 2006 — 8:00am",
      "content": "Jon,\n\nI first generated a graphic to show off the typeface itself, which I will attach to this post. They wrote back a few days later and let me know that they were interested in the font and would like to see a PDF sheet of all the characters, since T26 has a minimum character set that they require for all typefaces. I was not yet done with the font, so I let them know that I would work as quickly as I could to generate it and that I would send it soon. I finished up the font (or so I thought) and sent them a character sheet in PDF format. Then I was told that I would have a much better chance of selling the font if it contained a lower case as well. I had originally designed it to only be used for upper case titling, and I had included a very small caps weight to be used as a companion (instead of a lower case). Following their advice, though, I created a lower case, finished up the complete T26 character set, and attached that, along with some samples of the typeface in use, to the email. Eventually they said that it was good to go and that I should give them the files that I generated along with the master files. I then got into the long process of discussing whether or not my font could be distributed solely as OpenType. This lasted a few weeks. Eventually they said it was possible, so I gave them the files, and they reviewed them. They got back to me 10 days later and gave me the list of repairs that needed to be made, and gave me the quote for the fee. I questioned it, and they told me that it was something that I _should_ do if I am concerned at all with the quality of the typefaces that I produce. I decided to pay for them to make the fixes. 20 days later, after prodding, I was given the typeface in its repaired form, and it was posted online a few days thereafter.\n\nTheir initial response to my first sketch was on 2/4/2006, and the typeface was posted on 5/15/2006, I think. So the whole thing took a while, partially because I hadn't completed the typeface in advance, but mostly because they took forever to get back to me, most of the time. Usually I would have to send multiple emails to have questions or concerns answered. They had even fixed the font and told me it was going to be posted soon _in advance of signing a contract with me_. I emailed them immediately to let them know that I would like to a) see the font first, and b) sign an actual contract before they went about selling the font on their site. They complied after that, but I was a bit shaken up by the fact that I had to tell them to do this. I felt silly at that point having given them the full files before having a signed contract.\n\nI hope this helps!\n\n- Josh\n\n------------  \n**EDIT**  \nSeems I cannot attach images to posts anymore?  \nAnyway, here are the graphics I referred to:\n\n[http://www.threestepsahead.com/temp/specimen\\_01.jpg](http://web.archive.org/web/20150416071845/http:/www.threestepsahead.com/temp/specimen_01.jpg \"http://www.threestepsahead.com/temp/specimen\\_01.jpg\")\n\n[http://www.threestepsahead.com/temp/specimen\\_02.jpg](http://web.archive.org/web/20150416071845/http:/www.threestepsahead.com/temp/specimen_02.jpg \"http://www.threestepsahead.com/temp/specimen\\_02.jpg\")\n\n[http://www.threestepsahead.com/temp/specimen\\_03.gif](http://web.archive.org/web/20150416071845/http:/www.threestepsahead.com/temp/specimen_03.gif \"http://www.threestepsahead.com/temp/specimen\\_03.gif\")\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "18 May 2006 — 9:10am",
      "content": "_Their initial response to my first sketch was on 2/4/2006, and the typeface was posted on 5/15/2006_\n\nThat sounds quite quick for our industry, actually. Sorry if this sounds disappointing!\n\n"
    },
    {
      "time": "18 May 2006 — 9:23am",
      "content": "<cite>That sounds quite quick for our industry, actually. Sorry if this sounds disappointing!</cite>\n\nHehe. Not disappointing, really. It seems like most things in life take forever. The overall time involved wasn't such a big deal to me, honestly, since I wanted each step to be done carefully and deliberately. My only complaint was having to communicate redundantly (send reminder emails) in order to receive a response. I felt like, if I wasn't keeping up on things, they would never get done.\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "18 May 2006 — 3:00pm",
      "content": "Josh, congratulations on your typeface. It's a great achievement to have a font in release, and I hope it sells well for you.\n\n_Their initial response to my first sketch was on 2/4/2006, and the typeface was posted on 5/15/2006, I think._\n\nI agree with Dan - the release of your font was quite speedy, especially for a large foundry.\n\nT-26 gave you some good marketing-related advice. Fonts really do sell better with a lowercase, even when they are originally intended for titling. And while OpenType is rapidly gaining acceptance, PS and TT are still very much in demand. Many designers and foundries are offering all 3 formats, as OT-only can be a tough sell.\n\nI can't comment on the quality or technical problems that your font might have had initially. I do know that 90% of fonts submitted to most foundries require quite a bit of work to get them ready for market. Some submitted fonts have severe technical issues that take many hours to repair.\n\nAs long as you are dealing with a reputable foundry, it's OK to send font files for review purposes. They need to be able to take a close look under the hood before deciding whether or not to publish your font.\n\nI know it can be frustrating when communication isn't what you hoped for. You did the right thing by keeping on top of it. It's your font, and you care the most about it. The fact that it was released so quickly means your efforts paid off.\n\nNext time should be easier - good luck!\n\n"
    },
    {
      "time": "18 May 2006 — 6:54pm",
      "content": "Josh,  \nThanks for the info. And Congrats! Bauer House looks great! I will have to go buy it! I emailed t-26 ( [info@t26.com](mailto:info@t26.com)) a while ago inquiring about submission, and I heard back quite quickly. From Carlos Segura no less! Or at least from his email account. Another person over there emailed me a few days later asking if i had any typeface designs to submit. I still have quite a bit of tweaks and fine-tuning to do though. I am sure that they will have technical difficulties if they ever go for one of my designs. Do you work in FontLab?\n\n"
    },
    {
      "time": "18 May 2006 — 9:09pm",
      "content": "Tamye,\n\nThanks for your kind words! Much appreciated. I really love this forum, everyone's so nice.\n\nI think all of T-26's advice was pretty good for the most part. Their business practices on the whole seem pretty good, and I think I'm mostly just a) nitpicking a bit, and b) being a bit uptight about things because this is my first experience with font retail. Having had so many problems in the past dealing with unscrupulous folks in the course of doing design business, I'm mostly just looking to ask more questions and be more wary of what I do. This seemed like the best place to discuss all of that, and I'm glad I did. Honestly, the few things that I had concerns about were _far_ less of a big deal than some of the problems I've had in running my own business, so I'd definitely like to keep that in context. :)\n\n- Josh\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "18 May 2006 — 9:26pm",
      "content": "Wow, thanks Jon! That'd be splendid. Heck, I'd be thrilled even if only you bought it. That's enough validation for me to feel like the whole thing is more than worthwhile. Hopefully more folks feel that way, though. ;)\n\nYup, I mostly dealt with Carlos Segura for the creative portion of the discussion, but I was referred to other staff members for matters such as the contract and other technical stuff. Mr. Segura seems to be the one who had approved of the typeface in the first place. Everyone there is pretty friendly. The only real issue I had was that I had to keep up on things myself—and act a bit of a pest in the process—in order to catalyze progress. In general, though, as Tamye had said, it really does pay to be proactive, especially when dealing with something that one has such a vested interest in.\n\nWith regards to software, so far I don't think I've really perfected my workflow. And I think this is something that contributed to me not knowing exactly how to best tweak the font before its final submission. I draw all of my glyphs in Illustrator (since I'm very comfortable with the interface) and then import them into FontLab piece by piece. The first issue that I initially came across was realizing that fonts still need to have some sense of scale, even though they are vector curves. Just by happenstance, the size of the glyphs I drew in Illustrator was something like three or four times the size of the \"default\" greyed-out characters in the FontLab table. So when I realized what the conversion ratio was, I applied the same scale percentage to each glyph before exporting each one to EPS and dropping it into FontLab. The whole thing seemed really clumsy and inefficient to me, and I feel like a complete n00b admitting to it now (but hopefully someone will drop some hints as to what I should do in the future). From that point, once all the glyphs were in FontLab, I did my tweaks and such within that program to save time and energy. I'm actually working on a new typeface now based on Bauer House but with a much more sleek, geometric feel, and multiple weights. I know, though, that I'm going to run into the same scale issue, because I based this new one off of the same Illustrator file that I used to draw Bauer House. [If anybody else knows of a better way for me to work, I'm open for suggestions!]\n\nAnywho, thanks again for the encouragement! I hope I'm of some help too. We're all in this together, typophiles.\n\n- Josh\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "19 May 2006 — 12:52pm",
      "content": "THats funny. I do the same thing creating typefaces. I create them all in Illustrator. Then increase the size 400% or whatever, to import into FontLab. There is some way of importing the individual glyphs so they are 100% (ie no scaling). Here is the link:  \n [http://groups.msn.com/fontlab/tipsandtricks.msnw](http://web.archive.org/web/20150416071845/http:/groups.msn.com/fontlab/tipsandtricks.msnw \"http://groups.msn.com/fontlab/tipsandtricks.msnw\") action=get\\_message&mview=0&ID\\_Message=2675  \nI think scaling is easier. But I am by no means an expert.\n\n"
    },
    {
      "time": "19 May 2006 — 7:03pm",
      "content": "I just wanted to mention that the thing that surprised me most was the tiny amounts of time they said some of these tasks would take. Sure, some things are quick, like fixing name table entries for a single font (not part of a bigger family). But others, like fixing kerning, are typically tasks of (at least) many hours, even for a 200-glyph font.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "19 May 2006 — 8:53pm",
      "content": "I actually thought that was fairly suprising, too, Thomas. That's why I thought, \"What am I missing? What don't I know?\" Because for some of the smaller fixes, I felt like someone could just say \"hey, check this box instead of this box\" and I'd just be able to do it myself. The \"task list\" was mostly non-specific, so while they named the category of error, I really didn't know precisely what about my version wasn't correct.\n\nThat's part of what made me feel a little bleh about the whole thing. If it's all the same to them, I could have been told roughly what the errors were, and it would have saved them the trouble of having to worry about it. Instead it seemed like they definitely wanted the business, and that it was in their best interest to have the billable hours. So while I don't necessarily think I was ripped off, per se, I think that they may see the technical repair part of their business as being another viable source of income in addition to the resale of fonts.\n\n(Side note: I'd spent a lot of time on the kerning myself before giving them the files, so maybe only a few characters required touching up in their eyes. Perhaps that has something to do with that particular thing.)\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "20 May 2006 — 3:24pm",
      "content": "Josh,\n\nI would suspect that telling you what or how to fix things may take longer than just fixing the things themselves. If you were their child (employee), it would be worth while to teach you to tie your own shoes laces. But if it's someone else's kid it's better to just tie it and keep the kid from tripping and falling on it's face than to try and explain.\n\nSelling a font can pay off tremendously. Or not. You can't tell which will catch on (think Remedy) and make you a fortune, or fall away and be forgotten (and perhaps have been your favorite and biggest labor). You may be the next Emigre, House, P-22. Or just be disillusioned after one font and quit.\n\nBut I wouldn't even bother with \"you’d think that because a huge proportion of the world is literate, many would be interested in the letterforms of their respective languages.\" That's like saying because a huge proportion of the world has sewage systems, people should be more interested in plumbing. To the majority of type users pecking away on their computers type is just a means to an end. Just like plumbing is to me. The amount of people who have a greater interest than \"copper, lead, or PCB ?\" are few and far between. Just make it flush, please.\n\nYou'd better love it!\n\nWhether you make money at it or not will greatly depend on how good a business person you are, how much you worship Mammon, how great your perserverance is (at learning the software for instance) and continuing to develop the other aspects of your craft. And maybe even how big your ego-fulfillment needs factor in (anyone who speaks at every conference going and always has to be heard or seen probably has this paradigm). I know talent DOES figure in there somewhere, but I hate to say it that the other things can be just as important, or even more important, for Success.\n\nThe business/art isn't 'shrouded' in secrecy or obscurity. I have yet to learn anything about Python scripting (and I'd really like to) or any number of the more techie things about fonts, but that's just because other things have distracted me, my time and attention. You'll figure it all out if you just stick with it. Programming is not my thing so it's probably always going to seem a bit alchemical.\n\nThe typographical \"elite\" is a funny concept. There are people who have been at it at a long time and/or are very accomplished. We all have our heros. Because typography is really such a small niche in graphic design (which is a small niche of design, art, advertising, manufacturing, etc)., it is actually very easy to access them, to speak with Carlos Segura, or Matthew Carter, or even Robert Slimbach (which was a little like playing hide and seek). It ain't rock n' roll.\n\nPersonally, I don't think designing type is a great way to plan to earn a living in and of itself, because the market is incredibly flooded by fonts, good and bad (mostly bad, amateurish fonts made by people who know little about letters), and will only become more so and this devalues them in general as well. Of course the market is also broader which helps, but probably primarily at the lower levels. It just has to be taking work and income away from better type designers that there are so many of them, although most of the great ones that I know are pedaling as fast as they can to stay ahead in various ways. The greater number of bad fonts would actually provide hope and a market for the good faces if it weren't that aspiring designers in schools are taught less and less about good typography and can't tell the difference, I'm convinced. Some just want to break the rules.\n\nMost of the BIG successful new foundaries really broke loose, got in the door, with the initial explosion of digital type. I don't think it will be as easy for subsequent type designers to get so big as easy....unless another technology comes along. That always changes everything.\n\nSince I'm on a rant, I also think we'll see further flooding of fonts coming from other countries, sold on the internet without the customer even knowing who or where they are buying from. Globalization. South America is on track and producing some great stuff. But how about when China or other places with much lower standards of living start producing original fonts, where $1 a font would look like a fortune and would be a day's or a week's income? (and where they are really into pirating without scruples?). Don't think they don't get Roman (or any other type of) letters: Akira Kobayashi is an ace (and is fortunately in Linotype's hand). We can't see what is actually coming in 5, 10 or 20 years but it doesn't hurt to try. After all, that's what you are looking at isn't it?\n\nIf you have enough drive, business sense, desire for money, perserverance, talent...and the love of letters (or a large amount of two or three of them), you should be able to find success on your own terms.\n\nAnd if you have all of them, I want to work for you!\n\nJill\n\n"
    },
    {
      "time": "21 May 2006 — 7:07am",
      "content": "Wow, Jill, thank you for that. I actually was hoping folks would post some rather spirited stuff, and yours was particularly helpful. I'm hoping I have \"all of them\"—and it would then be an honor to have you in my employ.\n\nSecondly, I posted on another one of my threads in regards to an idea; someone had pointed out that there might be some hinting problems with the typeface and I wanted to see if I could find an independent expert who would be willing to take a look at the font, if only to examine whether or not there were vast improvements made to it by T-26. I'd really like to perfect this typeface, because it means a lot to me, and with tweaking I think it can be better than it already is (at least on screen).\n\nThirdly, I found in my contract that I'm actually still allowed to sell the typeface myself as long as I'm selling to end users only. This is good news. I could then put a little PayPal thing on my website and have a way to sell the font to those who want to buy it directly from the guy who made it. I could sell it at the same price and I wouldn't have to forfeit any of the proceeds. Then, T-26's value will be in selling the font to those who would not ordinarily see it on my site or otherwise. So I think I'm going to do that soon if anybody's interested.\n\n- Josh\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "22 May 2006 — 6:09pm",
      "content": "I am in search of font and type face creators who would like to sell their finished type faces and fonts to the end users- under the Angel Policy at my online Digital Art Images, Scrapbook Inspirations, Etcetera consignment store.\n\nWe offer a high percentage of the gross sales to our designers/ artists. Our contract is very lenient. We do not require exclusivity.  \nWe have a need for fonts and alphabets for the digital download paper craft and scrapbook industry.\n\nI would be thrilled to offer fonts and type faces online. It may generate a little bit of mad money for you. I am an artist and not a font designer. So far, I 've enjoyed the freedom of selling my art work myself and have broken away from my licensing agreemnts. I am very happy to say that the new found freedom has inspired new creativity.\n\nWe can get your product online within 2 weeks. We can't fix your fonts, but if you have a font that is user friendly- and a limited key board: A-Z, 0-9, !@#?~{}... it is good enough.\n\nRonna Penner has had some success selling her fonts at Scrapbook-Elements. The fonts she offers at MyFonts.com are the expanded versions. Under her agreement with MyFonts.com she can also sell her scaled down versions at Scrapbook sites online.\n\nI am hopeful that some of you will be interested in offering your work at my store: [http://daisiecompany.com](http://web.archive.org/web/20150416071845/http:/daisiecompany.com/ \"http://daisiecompany.com\")\n\n\\*\\*\\* gina jane \\*\\*\\*\n\n'relationships are the greatest art'\n\n"
    },
    {
      "time": "26 May 2006 — 12:35am",
      "content": "I thought MyFonts was usually non-exclusive - most of the content there is available elsewhere as well.\n\nT\n\n"
    },
    {
      "time": "26 May 2006 — 6:44pm",
      "content": "Thomas Phinney:  \n\"I thought MyFonts was usually non-exclusive - most of the content there is available elsewhere as well.\"\n\nThis is something I haven't asked Ronna about. This information - mis-information- was passed to me by the site owners at Scrapbook-Elements. I am learning that much of their information was inaccurate.\n\nThanks for the heads up. I'll check into it.\n\n\\*\\*\\* gina jane \\*\\*\\*\n\n'relationships are the greatest art'\n\n"
    }
  ]
}
