{
  "id": "19966",
  "title": "ITC Charter Pro vs Bitstream Charter BT Pro, and what sans-serif with it?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,\n\nI was looking at both, they both seem pretty much the same design-wise (note that I haven't verified closely). I was wondering if any of you knew which one was best (not only design wise)? I'm not sure but it seems Bitstream's is a TTF in a OTF, whereas ITC's is a PS in OTF.\n\nAlso I was wondering what sans-serif you'd use with it, I was thinking maybe FF Scala Sans Pro since it has support for many languages, and a good range of features like Charter, and a design that would fit well I think. Only problem is that I cannot try it for real because the only font I have from both is Charis SIL (Charter clone) that lacks many of the features I want, but I thought some of you would know.\n\nThanks\n\n",
  "author": "Pierre-Luc Auclair",
  "time": "16 May 2006 — 4:57pm",
  "uid": "8675",
  "comments": [
    {
      "time": "16 May 2006 — 9:58pm",
      "content": "Pierre-Luc Auclair\\> I have wanted to know this very same information. Unfortunately, I do not have the answer. But generally speaking I have noticed ITC/Monotype to be more expensive than other distributors for a similar, if not the same product.\n\nIn this particular instance, I would go with Bitsteam on the basis of price. Charter BT PRO is $199 and ITC Charter Pro is $239. But I and you might too, be worried about proper kerning table programing and other technical considerations... I just don't know about that :-(\n\n{Compare Rotis from Linotype and Monotype} Letraset is another distributor that is about $20 more expensive for the same type.\n\nSorry I'm not very much help,\n\nMikey\n\n"
    },
    {
      "time": "17 May 2006 — 4:29pm",
      "content": "There is yet another \"Pro\" version of Charter in OpenType format, made by ParaType. It's $125:  \n [http://www.paratype.com/asearch/ptdescription.asp?page=descr&fcode=PT\\_CHR](http://web.archive.org/web/20131019201846/http:/www.paratype.com/asearch/ptdescription.asp?page=descr&fcode=PT_CHR \"http://www.paratype.com/asearch/ptdescription.asp?page=descr&fcode=PT\\_CHR\")\n\nA.\n\n"
    },
    {
      "time": "5 Aug 2006 — 8:27pm",
      "content": "What would you pair Charter with?\n\n"
    },
    {
      "time": "7 Aug 2006 — 9:53am",
      "content": "Charter started out as a Bitstream face and then was picked up by ITC.\n\nI did a detailed analysis of Charter years ago for a client and found that with the exception of the lowercase o, Charter shared a lot of the proportions of Joanna, or was well close.\n\nPerhaps Gill Sans will go well with Charter.\n\nJames\n\n"
    }
  ]
}
