{
  "id": "1997",
  "title": "Newspaper print effect",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi,   \nIm looking for a way to put a newspaper print effect (B/W) on an image. Im guessing there must be a filter/plug-in out there, would anybody recommend one?   \nAnd similarly, would anyone know what program or filter was used to create the cover for eye no.44 (an image of the queen made up of circles).   \n   \nThanks in advance,   \nDavid.\n\n",
  "author": "<a href=\"/web/20100716203844/http://typophile.com/user/1394\" title=\"View user profile.\">david_leonard</a>",
  "time": "<br>",
  "uid": "1394",
  "comments": [
    {
      "time": "",
      "content": "David, It would be clearer to understand what effect you are looking for if you could scan an image or part of an image and post it, Dan\n\n"
    },
    {
      "time": "",
      "content": "Are you talking about a halftone? That's a natural process of printing with a low line-screen. You can also use the halftone filters in Photoshop to fake it on a higher resolution printer.\n\n"
    },
    {
      "time": "",
      "content": "David,   \n   \nIf you're referring to replicating the look of newsprint fibers, it's much easier to scan in a real newspaper and photoshop the fibers into a uniform background, then multiply the image over top.   \n   \nIf you're referring to the subtle distress that comes from light ink coverage on cheap newsprint paper ran at high speeds, I've got just the thing for you . . .   \n   \nIn a few weeks I plan to launch a series of photoshop filters that do just what you're describing. I will make a post to the list when they are ready for consumer consumption.   \n   \nBest,   \nStuart :D\n\n"
    },
    {
      "time": "",
      "content": "Stuart, sounds great!   \nIf you can, please do incorporate calendaring and directionality effects. Here's a sample with both:   \n   \n ![armnews2.gif](http://web.archive.org/web/20100716203844im_/http:/www.typophile.com/forums/messages/30/20171.gif)   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "I can\n\n"
    },
    {
      "time": "",
      "content": "1) That's an extreme example. It's from Armenia, where the money is very tight these days, so type fidelity -especially in newspapers- is very low. The typical low-print-quality Western paper looks more like this:   \n   \n ![latnews.gif](http://web.archive.org/web/20100716203844im_/http:/www.typophile.com/forums/messages/30/20193.gif)   \n   \n2) I don't know if horizontals gain more than verticals _as a rule_. But it could be, because of the cylinder press direction, and maybe the paper too.   \n   \n3) In the Armenian sample the callendaring of the paper (at least I think that's what it's called) has a strong effect.   \n   \n4) There's a hard-to-find article by Beatrice Warde in a publication called \"Bowater Papers\" (#3, 1954, from page 42) that shows many great examples of fidelity loss. I have a copy, but it's pretty bad quality itself!   \n   \n5) There's an article by Philip Gaskell in issue #7 (1971) of the Journal of the Printing Historical Society called \"Photographic Enlargements of Type Forms\" (pp 51-53, but with 8 plates) with really superb close-ups of many classic fonts, printed optimally (as you can still see the gain). I have an original of that.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "And here's a couple of examples of gain in phone books:   \n   \nMy all-time favorite:   \n [http://www.themicrofoundry.com/other/mandel.gif](http://web.archive.org/web/20100716203844/http:/www.themicrofoundry.com/other/mandel.gif)   \n   \nAnd something recent:   \n ![yellow_d2.jpg](http://web.archive.org/web/20100716203844im_/http:/www.typophile.com/forums/messages/30/20195.jpg)   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Fine... far as I can see, thin strokes tend to gain more than thick ones, also notticed vertical compression between the original and the printed, is this digital or print effect?   \n   \nI\n\n"
    },
    {
      "time": "",
      "content": "\\> thin strokes tend to gain more than thick ones   \n   \nRelatively, yes - because absolutely, no. :-)   \n   \nI don't see any vertical compression, but it would make sense if high-speed presses do suffer from such distortion.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "_I don't see any vertical compression, but it would make sense   \nif high-speed presses do suffer from such distortion._      \n   \nOh yes? You mean\n\n"
    },
    {
      "time": "",
      "content": "David, you can scan in a blank sheet of newsprint for the texture and overlay, as Stuart mentioned.   \nThen use the Diffuse filter in photoshop once or twice and fiddle with the opacity.   \n   \nStuart, looking forward to seeing your new stuff soon.   \n   \nbj\n\n"
    }
  ]
}
