{
  "id": "19982",
  "title": "I want to be an expert!",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hey folks...\n\nI recently released a typeface, Bauer House, through t26. The long story short is, I had thought it was in pretty good shape overall, but I was told that there were $300 worth of fixes to be made in advance of release, so I shelled out the money up front. Now I feel like I should have come here first and asked for help. A Typophile on another thread said I should just post the list of fixes I was told they would need to make, and see if anybody has some input on those so that I'll know what to do next time. I think the list might be vague, but any input you have would be great. I'd post the whole typeface, but since it's already a commercial font being sold through t26, I don't know if that would be the best idea.\n\nBut let me know what y'all think.\n\n— Josh\n\n-------------\n\nBauer House [1 OTF with Standard, Titling/Inline, Smallcaps, Central European sets]\n\nName Structures — Need to be corrected for cross-platform / OTF use — 5 min\n\nHeader Info — Missing a few info panels, invalid FOND ID, etc — 15 min\n\nEncoding — OK\n\nVector Check — Numerous stacked points, intersecting contours, semi-perpendiculars — 30 min  \n Numerous construction errors, bulges, non-matching glyphs  \n (e.g., H I w/ no rounding or flair) — 60 min\n\nMetrics — Spacing inconsistencies and errors (J h u v etc):  \n 10 min to correct most serious; or  \n 30 min to respace full font\n\nKerning: several overtight kern pairs (At Hu et):  \n 5 min to correct / remove collisions;  \n 90 min to rekern font after respacing\n\nHinting — No hints, alignment zones need to be set:  \n 30 min to hint (optional); or  \n 0 min and font can be remain unhinted (will look fuzzier overall)\n\nEuro — OK\n\nNon-Breaking Space — Needs to be set — 0 min\n\nVertical Metrics Tables — Need to be updated — 0 min\n\nLive Testing of OTF font — OTF tables appear to be working properly\n\n- - - - - - - - - - - - - - -\n\nFinal Font Mastering and Live Proofing — 15 min\n\nCombined Correction & Mastering Times:  \n A: 140 min with most basic corrections  \n B: 245 min with new spacing & kerning  \n C: 275 min with new spacing, kerning & hinting\n\n",
  "author": "jaykay109",
  "time": "17 May 2006 — 7:58am",
  "uid": "11474",
  "comments": [
    {
      "time": "17 May 2006 — 8:44am",
      "content": "[http://www.t26.com/fonts/display.php?f\\_id=935](http://web.archive.org/web/20150416051726/http:/www.t26.com/fonts/display.php?f_id=935 \"http://www.t26.com/fonts/display.php?f\\_id=935\")\n\n"
    },
    {
      "time": "17 May 2006 — 9:44am",
      "content": "They charged you $300 to be able to sell your font?!\n\nI've heard of reducing royalties and other \"future-based\" schemes to make up  \nfor shortcomings in a design by a beginner, but this almost seems like a scam...\n\nhhp\n\n"
    },
    {
      "time": "17 May 2006 — 11:41am",
      "content": "This is precisely what I'm worried about! I feel a bit ripped off, I think. I didn't want to come out and say anything bad outright, because I thought perhaps this was just the way this was done—but now I'm feeling like there is a tremendously supportive community of type designers on this forum that I should have asked first. Everybody here seems to be interested in the benefit of those who contribute to the field, and perhaps that would have saved me some cash, and more importantly, would have allowed me to learn what I need to learn outright.\n\nWhat does everybody else think? Ripoff? No?\n\n- Josh Korwin\n\nPS: Thanks for the link to my typeface, goldgrube!\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "17 May 2006 — 11:54am",
      "content": "Well, their <cite>intent</cite> is one thing, and there's probably no way to be sure of what that is, but then there's <cite>results</cite>, and if they do wonderful improvements to your font, and especially if it sells much better as a result, then $300 might even be a really good deal.\n\nhhp\n\n"
    },
    {
      "time": "17 May 2006 — 12:51pm",
      "content": "<cite>Well, their intent is one thing, and there’s probably no way to be sure of what that is, but then there’s results, and if they do wonderful improvements to your font, and especially if it sells much better as a result, then $300 might even be a really good deal.</cite>\n\nI guess that's part of my problem. Between my final files and theirs, there are differences (I used a file compare program to try to determine exactly what), but I'm not sure exactly what changes were made. While great improvements may have been made, they seem transparent to me. Worse yet, I can still find some bugs in the font (the bugs don't seem to affect print output, only screen output at certain sizes). In the future I'd much rather somehow learn how to do it properly myself so that it's not an issue.\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "17 May 2006 — 12:57pm",
      "content": "Here's an idea: post PDFs of the before and after!  \nMaybe we can see some interesting differences.  \nYou could use this -alphabetic- pangram:  \n\"Abacists's deaf dog hijacked luminous parquetry studio, avows ex-yakuza.\"  \nI'd set the pangram in -tight- consecutive lines in each font.\n\nThis sort of thing has never been done on Typophile (or really  \nanywhere, that I know of) in the past, so if you could allow it  \nthat would be great.\n\nhhp\n\n"
    },
    {
      "time": "17 May 2006 — 11:44pm",
      "content": "It's not a rip-off, in terms of the cost for the work done.  \nAnd didn't you agree to the price before they did the work?\n\nYou probably shouldn't be airing this aspect of a business relationship in public.  \nThere may be a non-disclosure clause in your contract.\n\nYes, there are all kinds of trade secrets. Business is competitive, hard to explain, and many small businesses don't even formally rationalize how or why they do things the way they do; it just seems obvious, once you've tried a few different approaches. So it takes a while not just to become a better designer and manufacturer, but also to acquire an understanding of the business side of things. Everybody has gaps in who and what they know, it's just the way one evolves in one's niche.\n\n"
    },
    {
      "time": "18 May 2006 — 1:21am",
      "content": "Nick,\n\n<cite>It’s not a rip-off, in terms of the cost for the work done.<br>\nAnd didn’t you agree to the price before they did the work?</cite>\n\nI did. I actually would not have started asking any questions on here, though, if I was satisfied with the quality of what I received for that payment. Had I received a much-improved font, with noticable changes, I wouldn't question it. I just feel like the job may have not been done properly, due to the strange \"artifacting\" that I'm getting using the revised edition.\n\n<cite>You probably shouldn’t be airing this aspect of a business relationship in public.<br>\nThere may be a non-disclosure clause in your contract.</cite>\n\nI checked in advance. No such clause exists in my contract. Furthermore, when I paid them to make the revisions to the font, we were not yet under contract. The contract was only signed after I had received the revised edition of the typeface. (Whether I made a mistake in signing at that point is a different issue.)\n\nAfter re-reading the contract, I'm more satisfied with the contract itself than I am with both the up-front cost and the seemingly-mediocre results that it paid for. The contract itself is pretty darn fair. I just feel like I probably could have released the font as-is instead and saved a few bucks.\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "18 May 2006 — 2:33am",
      "content": "\\> It’s not a rip-off, in terms of the cost for the work done.\n\nBut we don't even know what work was done!  \nAnd what if the results are actually <cite>worse</cite>? :-/\n\nJoshua should certainly be careful (and it seems he is), but I wouldn't  \ndiscourage him from pursuing this - he's actually doing others a favor.\n\nhhp\n\n"
    },
    {
      "time": "18 May 2006 — 6:53am",
      "content": "I'm new to type design (not to design/illustration in general--been doing that for twenty years), but I have a few years' experience writing and publishing short fiction, and this brings to mind raging arguments in that community, especially with the advent of Internet-based, print on demand vanity publishers.\n\nThere's a simple solution to the question when somebody asks \"X published me, but they charged me Y for Z. Was that right?\" The solution is \"Money flows to the writer.\"\n\nIt's the same deal with any kind of publishing of individual work, like this one--as the creator, you give up a significant financial interest in the commericial exploitation of your work in return for the publisher's assuming all financial risk and marketing the work.\n\nAny publisher/distributor/whatever that doesn't assume all financial risk in return for your allowing them to make the lion's share of income from marketing your work is not worth working with. I don't know if you got scammed, but...money's supposed to flow to you from the publisher, and it should never work the other way around.\n\n"
    },
    {
      "time": "18 May 2006 — 7:42am",
      "content": "<cite>Joshua should certainly be careful (and it seems he is), but I wouldn’t discourage him from pursuing this - he’s actually doing others a favor.</cite>\n\nThanks hrant, I appreciate it. That is really my goal here. I have absolutely no intention to trash-talk anyone; frankly it's my first retailed typeface and I'm both proud of that point and also pretty happy that at least t26 was interested enough to sign a contract with me. Regardless of the repair fees, they are still under contract to market my font, and that's something they're doing at their own risk. That's the plus side of things.\n\nOn the other hand:\n\n<cite>money’s supposed to flow to you from the publisher, and it should never work the other way around.</cite>\n\nThis is how I had felt all along, and that's what made this feel somewhat fishy. I feel like, if a company was interested _enough_ in Bauer House, they would say, \"This is a great design! We'll take care of the tweaking to make it set for public consumption.\" If a publisher was to believe enough in the work that they are putting out, they are the ones responsible for the editing. As RN Lee said, it seems a matter of confidence, liability, and responsibility.\n\nMore than anything, though, I was really just hoping that I would get a much higher-quality typeface back after the few weeks that were spent on their side fixing it. I had put a lot of work into it, but since it's my first actual font, I could be sure that it worked, but not that it would work in every application and with every system. It wasn't that the font was not in good shape, it was just a matter of being sure all the settings were correct. I originally made it clear that I would pay the fee to them once but that I would really like to receive the typeface after it is complete, and that it would be great to have a log-sheet or something to say exactly what was changed about it, so that in the future I could provide a better typeface from the get-go. When I received the .otf file afterwards, I was just a bit disappointed, because I could find small changes (such as the actual font name; I had used something else after \"Bauer House\" but they changed it to \"Bauer House - Regular\"), but the overall typeface seemed the same. My kerning had not been terrible to begin with, and that may have been minorly tweaked, but again, I saw no huge difference for the most part. I'll give them some possible credit though: sometimes subtle changes are the most important. Perhaps I could not find the major fixes because they seem transparent. But the one thing I'm very, very uncomfortable with is the fact that the font seems to have some sort of error (and I believe the error was introduced _after_ the repairs were made. I'll have to test my old version to be sure).\n\nBut here's what I'm referring to. It's some sort of hinting issue, I think, because it shows up only when the type is displayed below a certain size.\n\n**Small size:**  \n [http://www.threestepsahead.com/temp/error\\_01.png](http://web.archive.org/web/20150416051726/http:/www.threestepsahead.com/temp/error_01.png \"http://www.threestepsahead.com/temp/error\\_01.png\")\n\n**Enlarged:**  \n [http://www.threestepsahead.com/temp/error\\_02.png](http://web.archive.org/web/20150416051726/http:/www.threestepsahead.com/temp/error_02.png \"http://www.threestepsahead.com/temp/error\\_02.png\")\n\nIn the larger type, it disappears. Bear in mind this is only on an alternate question mark that I designed, not the main one. The error may occur on a few other characters as well; I have to check in more detail.\n\nAnyway, this brings to mind one other last issue that I have in regards to the retailing of Bauer House. My typeface is FULL of alternate characters and OpenType features. It took some convincing to tell T26 that I insisted on having the font distributed in OpenType only. At first they had a problem with that, but I explained that so much of it is inseparable from the OpenType features that I would not want to see it distributed without them. They agreed, but said that they would have to update their entire system online to allow for an OpenType font to be used. In the end, when it was finally given back to me after the repairs, they said that they were forced to distribute it also in TTF and T1 formats for Mac and PC because their system would not allow just an OpenType font to stand alone. I've yet to receive copies of the TTF and T1 versions, but they could not possibly contain the features that I included in the OpenType version. Firstly I'm sad that they gave anybody a choice on that, as I can't really see much reason _not_ to use OpenType at this point. Secondly, maybe as a result of that, or maybe just because this isn't high on their priority list, Bauer House's alternate characters and OpenType features are in no way being explicitly displayed on the site. So, I doubt I will see much in the way of royalties, if only for that reason.\n\nLastly, I don't mean in any way to offend or upset anyone by starting the conversations that I've started. I mean to do all of this out of fairness, as I think that we can all benefit from at least knowing how things _should_ be done. By sharing our experiences, we have a little bit more confidence-ammunition to be able to negotiate for ourselves in the future. Before I even got started with designing type at all, I had run into so many problems with those I dealt with as a freelance graphic designer. Only recently have I started to get the hang of making sure I'm not taken advantage of as an independent contractor, and that's after years and years of problems. What I found, though, is that the biggest step I took was reading [_The Graphic Artists Guild Handbook: Pricing and Ethical Guidelines_](http://web.archive.org/web/20150416051726/http:/www.amazon.com/gp/product/0932102123/sr=8-1/qid=1147962757/ref=pd_bbs_1/104-7735859-3663122?%5Fencoding=UTF8). Overnight, I had much better method of running my business, because I finally had some advice and information specific to the industry. It was like having a veteran sitting on my desk and telling me \"No, no. _This_ is how it's done.\" In our case, here, I think we can all benefit from the discussion and collective advice of those that have \"been there.\"\n\n- Josh\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "18 May 2006 — 8:02am",
      "content": " **I feel like, if a company was interested enough in Bauer House, they would say, “This is a great design! We’ll take care of the tweaking to make it set for public consumption.”**\n\nEither that, or send you a list of recommended changes and corrections for you to make yourself, which is the way it's generally done with published fiction. I wouldn't let a publisher print my story if they wrote and informed me they'd be making a bunch of changes, themselves (every contract I've signed thus far, in fact, prohibits this), and if they decided they needed to make changes and wanted to charge me for proofreading and copy editing, I'd do exactly what you did, go post about it on a board where other writers hang out.\n\nYou're not revealing \"trade secrets,\" here, just exposing a practice that's dodgy, at best.\n\n"
    },
    {
      "time": "18 May 2006 — 8:08am",
      "content": " **In the larger type, it disappears.**\n\nIt actually doesn't--this is an illusion. Try pasting the smaller graphic on top of the larger and enlarging the smaller until the t's line up. The question mark is in the same place, it's just not working visually at the smaller size--it rather looks like it's trying to molest the poor t.\n\n"
    },
    {
      "time": "18 May 2006 — 8:11am",
      "content": "No, check out the dot on the question mark. On the small size, it is hollow. When enlarged, it stays solid. It's hard to see on the graphic, but it's easily visible dynamically in Illustrator (where I exported from).\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "18 May 2006 — 8:22am",
      "content": "Oh, I gotcha. Yeah, that is a bother.\n\n"
    },
    {
      "time": "19 May 2006 — 7:20am",
      "content": "Compared the alternate question mark glyph and the standard one? Maybe a hinting problem?\n\n"
    },
    {
      "time": "19 May 2006 — 7:39am",
      "content": "Both are the alternate glyph. Those graphics are the same exact file, just \"Saved for Web\" at different sizes. When the font is rasterized below a certain size, the dot goes hollow on that glyph. It seems to be a hinting problem, yes, but I think the culprit (looking at the file) is a duplicate curve. The dot is repeated over itself and hollows out (the way a compound path does). I guess I should let them know that they should fix that? I hate being obnoxious, but still.\n\n- Josh\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "19 May 2006 — 10:22am",
      "content": "What I ment was, compare the alternate and the standard glyph in Fontlab, then you should see what´s wrong..\n\n"
    },
    {
      "time": "19 May 2006 — 11:34am",
      "content": "Oh oh! Yes, that's what I did. It seems to be a duplicated path, on both the alternate question mark and the alternate version of the upside-down Spanish interrogation mark. I'll let T26 know and perhaps they can make the fix on their side.\n\nI'd do it myself and send them the fix, but as it is, I'm still unsure about how exactly I should generate fonts from FontLab in order to produce the best results. I don't know much about encoding and about the font settings themselves; it all seems so incredibly dense with so many options and potential to screw up.\n\nIt scares me.\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "21 May 2006 — 1:30am",
      "content": "RN Lee\n\nYour statement \"Any publisher/distributor/whatever that doesn’t assume all financial risk in return for your allowing them to make the lion’s share of income from marketing your work is not worth working with,\" isn't quite the way it works in non-fiction publishing. The cost of obtaining permissions for illustrations, as a for instance, is often up to the author. Since this can be prohibitive (I have a friend who would have had to fork out $23,000 for rights to use photographs), it often becomes a situation where a writer has to pursue the grant track in order to provide a viable manuscript that a publisher is willing to undertake.\n\n"
    },
    {
      "time": "21 May 2006 — 5:15am",
      "content": "I would be happy to pay someone to hint my fonts for me, because I hardly know where to begin. But if I saw results like that (look at the flaws in the verticals, like the right edge of the U and the left edge of the H), I wouldn't be convinced they'd even done it.\n\n"
    },
    {
      "time": "21 May 2006 — 7:00am",
      "content": "Cerulean, I see what you're saying.\n\nIs there an objective expert that would be willing to help me look through the typeface in its as-is state in order to determine what has or has not been fixed? While I generally trust this forum, I'm loathe to post the files themselves for free distribution on the Interweb. I'm sure that's not a good idea. But if someone in the field would be interested in giving me a hand, I could discuss the matter with them and the results of their findings could be posted here... anyone have any suggestions?\n\nAfter I re-read my contract, I found that I still have the right to sell the font myself directly to end-users as long as that agreement does not constitute a resale agreement. So I'd definitely like to perfect this typeface.\n\n- Josh\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "21 May 2006 — 7:20am",
      "content": "Why not post before/after PDFs like I described?\n\n\\> I still have the right to sell the font myself\n\nAre you allowed to sell the \"fixed\" one too?\n\nhhp\n\n"
    },
    {
      "time": "21 May 2006 — 7:56am",
      "content": "I'm positive that the PDFs won't show very noticable differences, first of all. I've already tested the typeface in Illustrator and I can't really find much that would be discernable. What I'm referring to more so is the code itself: hinting, encoding, and other such technicalities. The curves, for the most part, seem as they should, with the exception of the duplicate path issue, which does not show up in print anyway.\n\nI mostly just want to determine whether a substantial amount of work was performed, and how I can go about processing my typefaces properly in the future. Plus, if I was to attach any PDFs, especially with any embedded font information, security and licensing issues would be a-plenty.\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "21 May 2006 — 3:23pm",
      "content": "They gave you a list of fixes that could be easily checked, and if they needed fixing, I'm glad they cared enough to do so. Was the spacing inconsistent on mnh, was the kerning overtight on a few pairs, overlapping curves etc? Is it now fixed? $300 seems absolutely fair, even a bargain if they respaced and rekerned the entire font. Especially so if it has an extended character set. My gut reaction is that you're not getting hosed, but posting pdfs would be helpful.\n\nWith regard to hinting\n\nThis list may give a start:  \n [http://www.myfonts.com/activity/hinting/](http://web.archive.org/web/20150416051726/http:/www.myfonts.com/activity/hinting/ \"http://www.myfonts.com/activity/hinting/\")  \nEspecially this page:  \n [http://scripts.sil.org/cms/scripts/page.php?site\\_id=nrsi&item\\_id=NotesOn...](http://web.archive.org/web/20150416051726/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&item_id=NotesOnHintingWithFL \"http://scripts.sil.org/cms/scripts/page.php?site\\_id=nrsi&item\\_id=NotesOnHintingWithFL\")\n\nOver the lifetime of your font, I hope that $300 is a drop in the bucket! Congratulations on your first retail font. It's a big accomplishment.\n\nCheers,  \nRandy\n\n"
    },
    {
      "time": "21 May 2006 — 7:39pm",
      "content": "\\> I still have the right to sell the font myself directly to end-users as long as that agreement does not constitute a resale agreement.\n\nso does that mean that you wouldn't be able to sell it through a distibutor such as myfonts or veer?\n\njust curious about the way all this stuff works…\n\n"
    },
    {
      "time": "21 May 2006 — 7:48pm",
      "content": "<cite>so does that mean that you wouldn’t be able to sell it through a distibutor such as myfonts or veer?</cite>\n\nExactly; I think it means no more reseller agreements. Analogy time! T-26 gets to be the only store that can carry my product, but it's still OK for me to pedal around with a bicycle cart, selling it to the local tourists.\n\n\\*Rings bike bell...\\*  \nAny takers? Hehe.\n\n- Josh\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "21 May 2006 — 8:04pm",
      "content": "alrighty then… good luck with the deal; i hope it does really well!\n\ncheers!\n\n"
    },
    {
      "time": "22 May 2006 — 10:20pm",
      "content": "Let us know in five or six years if you recouped the $300. :-)\n\nCheers, Si\n\n"
    },
    {
      "time": "23 May 2006 — 4:40am",
      "content": "I'd still be thrilled even if it took that long. At this point I'm not expecting much. :)\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "23 May 2006 — 1:08pm",
      "content": "\"Your statement “Any publisher/distributor/whatever that doesn’t assume all financial risk in return for your allowing them to make the lion’s share of income from marketing your work is not worth working with,” isn’t quite the way it works in non-fiction publishing. The cost of obtaining permissions for illustrations, as a for instance, is often up to the author.\"\n\nIn some specific cases. In major magazine nonfiction writing, which pays better than anything else, the writer is absolutely not on the hook for out of pocket costs like this. In many cases involving non-fiction book publishing, authors are given limited budgets for image clearance and anything beyond that is out of pocket.\n\nAt any rate, this is not an issue of the publisher not assuming financial responsibility, simply one of controlling expenditure. Non-fiction authors \\*still\\* don't have to pay their publishers to edit and proof their books.\n\nThe only way the illustration question could be equivalent to the subject under discussion is if non-fiction authors were given lists of illustrations owned by the publisher who required them to use those illustrations and charged them per-image. Publishers and distributors shouldn't be holding editing costs over creator's heads as a ticket to entry for \\*anything.\\* It's unethical and a clear conflict of interest, given that the publisher stands to make more money the more edits they require of more creators.\n\n"
    },
    {
      "time": "23 May 2006 — 1:14pm",
      "content": ":\"T-26 gets to be the only store that can carry my product\"\n\nAnd they only charged you three hundred bucks for the privilege of restricting your marketing options to their site? That IS a good deal!\n\n"
    },
    {
      "time": "23 May 2006 — 3:16pm",
      "content": "To their credit, the end-product delivered to me is mine to keep. So I paid for the $300 of repairs, (the value of the repairs remains questionable, but still) but I get to use that end product to sell. I still bought something, in the law's eyes, at least.\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    }
  ]
}
