{
  "id": "19987",
  "title": "Legible?! (2nd Version)",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "i need your help:\n\nwhat do you read in the image?\n\nthanx y'all in advance\n\n| Attachment | Size |\n| --- | --- |\n| [threadless submission (Version2).gif](http://web.archive.org/web/20131011174811/http:/typophile.com/files/threadless%20submission%20(Version2).gif) | 10.19 KB |\n\n",
  "author": "al_x",
  "time": "17 May 2006 — 10:46am",
  "uid": "6452",
  "comments": [
    {
      "time": "17 May 2006 — 10:57am",
      "content": "I see \"remember me\" but it took me a while to figure it out\n\n--  \ndp\n\n"
    },
    {
      "time": "17 May 2006 — 10:58am",
      "content": "FE  \nMEM  \nLET  \nME\n\n"
    },
    {
      "time": "17 May 2006 — 11:10am",
      "content": "@Isaac: an 'F' and a 'T' you say?! .....hmmm\n\n"
    },
    {
      "time": "17 May 2006 — 11:37am",
      "content": "As I 'said', I read 'Teo Memo Let Me'. :)\n\n_( Hmm. 'Remember Me'? Sadly enough, it doesnt seem to work for me. You are quite randomly mixing upper case and lower case letters, I guess thats not really helping it either. )_\n\nDav\n\n"
    },
    {
      "time": "17 May 2006 — 4:58pm",
      "content": "Only the M and E work. Notice that in both cases you have a pretty conventional version of the letter in the edges of the post-it outlines. Not in any of the others though. The \"b\" doesn't work in context, because everything else looks uppercase, so it hits me as an \"L\" if anything. And the very first letter (the \"R\") is too vague.\n\nNeat experiment, though-- the problem seems to be in trying to make some of the letterforms with only two rectangles. That will make it almost impossible to distinguish, say, P and F. Then again, context does help -- but that means that you'll need text to be custom for each case, or else multiple glyphs for certain letters.\n\n"
    },
    {
      "time": "18 May 2006 — 8:13am",
      "content": "thanx to all, you helped me a lot.\n\ni will work on the 'r' + 'b', and see what comes out...\n\n"
    },
    {
      "time": "19 May 2006 — 9:10pm",
      "content": "si, teo memo let me O te mem let me\n\n• jko •\n\n"
    },
    {
      "time": "24 May 2006 — 12:37am",
      "content": "I opened the pic first, then I read your post and had to take another look then. I have recognized it just because you said that there is written something.\n\n"
    },
    {
      "time": "30 May 2006 — 5:32am",
      "content": "ok... i made some changes. (see image above)\n\nwhat do you think?!  \ndoes it work?!\n\n...and for those who still haven't seen it, what do you read?!\n\ngracias\n\n"
    },
    {
      "time": "30 May 2006 — 7:53am",
      "content": "I wonder if taking the topmost postit for the R should be rotated 90º because I am reading K and it might have something to do with the copy on the postit. I think the hyphens might be unecessary too. I wonder if the line breaks might be better like this  \nREM  \nEMB  \nER  \nME\n\n(sorry if I spoilt the suspense for anyone)  \nTim\n\n"
    },
    {
      "time": "2 Jun 2006 — 2:29am",
      "content": "Thanx Tim!\n\n"
    },
    {
      "time": "2 Aug 2006 — 1:59pm",
      "content": "'REMEMBER ME', in about two seconds.\n\nBut you <cite>asked</cite> me explicitly, so I tried to find out.\n\n"
    },
    {
      "time": "2 Aug 2006 — 9:53pm",
      "content": "I just see a pile of sticky notes. After realising that it was supposed to be letters, \"RE-MEM-BER ME\".\n\n- Lex\n\n"
    },
    {
      "time": "2 Aug 2006 — 9:57pm",
      "content": "I like that at first it is just a pile of sticky notes. An \"aha\" moment is always a good thing. Well, most of the time.\n\n"
    },
    {
      "time": "3 Aug 2006 — 2:04pm",
      "content": "I don't think I would have read anything if I hadn't been trying. In other words, you have to want to analyze this for a moment longer -- to have your aha moment -- or else you'll just see a pile of notes. And this, as Miss Tiffany said, can be a good thing.\n\nHowever, I think that if something doesn't somehow hold your attention and compel you to find the hidden image/message, you'll just move on. So, as I see it, the problem to be solved here is how to get people to stop a second longer and decipher the visual puzzle.\n\nPerhaps by adding a whole bunch of notes to the background and somehow making these stand out -- by giving them a slightly different colour, or making it seem as if they're on a plane closer to the viewer, or whatever.\n\n"
    }
  ]
}
