{
  "id": "20008",
  "title": "(x) Anaiah Isabelle Montecillo 50s script - Monterey (Mahogany Script) {Geoff (Mike)}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "the nice scripty used for these cards? would love to get it if someone can help me figure out where I can get this face from. sorry the photo is small but hope it suffice. thanks a bunch!\n\n ![](http://web.archive.org/files/sample_6485.gif)\n\n",
  "author": "<a href=\"user/1686\" title=\"View user profile.\">dzgnchic</a>",
  "time": "<br>",
  "uid": "1686",
  "comments": [
    {
      "time": " 17 May, 2006 - 11:33pm",
      "content": "[Monterey](http://web.archive.org/web/20061202213122/http:/www.myfonts.com/fonts/bitstream/monterey/) from Bitstream.\n\n"
    },
    {
      "time": " 18 May, 2006 - 12:20am",
      "content": "Monterey is one of Bitsteam’s knockoffs and looking through its character set there are some glyphs that are not drawn well or as true as Mahogany Script from Monotype. Mahogany Script also come with an Alternates font that has a few different glyphs in it. And on top of that Monotype gives a away a free font too- Chilada Dos! And its $2.75 cheaper!\n\n[http://www.fonts.com/findfonts/detail.htm?pid=203231&grab\\_id=0&page\\_id=6062&query=mahogany&SCOPE=Fonts](http://web.archive.org/web/20061202213122/http:/www.fonts.com/findfonts/detail.htm?pid=203231&grab_id=0&page_id=6062&query=mahogany&SCOPE=Fonts)\n\nSo hit that back button or cancel that transaction because the Monotype version is the one you want…\n\n:-)\n\nMikey\n\nBy the way, I actually own this font, so you can trust my opinion.\n\n"
    },
    {
      "time": " 18 May, 2006 - 12:45am",
      "content": "Mikey, we might disagree on that one. :^) Though it is common knowledge that Bitstream has a great number of renamed versions of fonts from Linotype, Monotype et al…, I can tell from first-hand experience that a lot of their digitisations are of a superior quality compared to the the “originals”.\n\nIt’s not like they actually _stole_ the digital outlines (though here again for some specific cases there are different versions to the story), but they digitised their own versions. Compare for example [Linotype](http://web.archive.org/wiki/Linotype)’s [Melior](http://web.archive.org/web/20061202213122/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=LH.76.0.1&attributes.sampleSize=48&sampleText=A&sampleSize=388) to [Bitstream](http://web.archive.org/wiki/Bitstream)’s [Zapf Elliptical 711](http://web.archive.org/web/20061202213122/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=BT.122155.0.1&attributes.sampleSize=48&sampleText=A&sampleSize=388).\n\nUnfortunately a very interesting discussion on this topic featuring some insightful comments from Erik Spiekermann and David Berlow seems to have disappeared during the transition from the original Typophile to Version 2 a little over a year ago. Bummer…\n\n"
    },
    {
      "time": " 18 May, 2006 - 12:47am",
      "content": "I wouldn’t be so quick to call it a knock off of Mahogany Script. Both companies have done numerous “knock-offs” of other faces but in this case Bitstream appears to have acquired and digitised the original face from Intertype, Monterey here. So it’s the other way around, Mahogany could be a knock-off of Monterey. I had a quick glance and it appears that Mahogany isn’t as delicate nor elegant as Monterey, the finer strokes have been thickened and some of the terminals end oddly.\n\nI don’t really know. :^)\n\n"
    },
    {
      "time": " 18 May, 2006 - 2:15am",
      "content": "Umm… Do you guys actually own any of these fonts? I do and the Bitstream- original or whatever- is not as good. The basic latin stuff is just about the same. Its the supporting symbols I have a problem with.\n\n@, copyright, greek micro sign, pilcrow, section, registered, trademark, yen, etc are all pulled out of the Times Roman parts bin. (Maybe not Times but you get my point)\n\nThe only thing I actually like in Monterey are the dagger and the double-dagger. These glyphs are tilted and look cuter.\n\nBut as for the Latin it all looks the same- and no- Mahogany Script is not thicker. (although on the Monotype site the braces look fat- they are in fact NOT fat and are well balanced in stroke.\n\nI guess instead of knockoff I should have said ‘shoddy execution”. And yes- Zapf Elliptical is much better. And in a heartbeat I would buy Charter Pro or Iowa from Bitstream. Other fonts I don’t know. I would make that purchase decision on the basis of who has done the best interpretation/implementation, price, license, perks etc.\n\nIn this case GET THE MONOTYPE VERISON!!!  \nMonotype is cheaper, better implemented, comes with an Alternate font, plus a bonus free font and I did for get to mention its cheaper… and two free tickets to Tokyo… okay NOT!\n\n;-)\n\nMikey\n\n"
    },
    {
      "time": " 18 May, 2006 - 4:50am",
      "content": "\\> _Mahogany could be a knock-off of Monterey_\n\nI couldn’t tell you for certain what face [Mahogany Script](http://web.archive.org/web/20061202213122/http:/www.fonts.com/findfonts/detail.htm?pid=203231&grab_id=0&page_id=6062&query=Mahogany&SCOPE=Fonts#history) was originally based on, but I can tell you it was released in 1981 from the “Custom Type” group collection at Compugraphic. That means that a CG customer had requested the typeface to be produced based on another specimen for their specific use, most likely done for an EditWriter filmstrip font years before.\n\nMany of the early CG customers were “Mom & Pop” shop printers, so Mahogany Script was most likely based on one of the thousands of Wedding Scripts printers used for handset invitations. I am not trying to ID the original for you, just giving you a little background on how it got into the Monotype Imaging collection.\n\n"
    },
    {
      "time": " 18 May, 2006 - 5:41am",
      "content": "\\> _It’s the supporting symbols I have a problem with._\n\n@, copyright, greek micro sign, pilcrow, section, registered, trademark, yen, etc are all pulled out of the Times Roman parts bin. (Maybe not Times but you get my point)\n\nAh, of course, I thought you meant alternate glyphs like swashes and ligatures and stuff.\n\nI completely agree with you about the supporting symbols, I now see what you mean. These are indeed a disgrace to be included in the character set of such fine digitisations. They look completely out of place and are often downright ugly.\n\nI guess Bitstream used that as a shortcut in order to get the typefaces on the market as fast as they could in the early digitisation rush, but they’ve had plenty of time to correct that mistake and still haven’t.\n\n"
    },
    {
      "time": " 18 May, 2006 - 6:35am",
      "content": " ![](http://web.archive.org/files/screenshot_06_5140.gif)\n\n"
    },
    {
      "time": " 18 May, 2006 - 7:52am",
      "content": "Yikes! Mr. Mahogany has issues.\n\nI guess, in the end, it all comes down to personal taste. ;^)\n\nBTW, I absolutely agree with the lack of analphabetic fineness in Monterey, it’s a shame. Yves is probably spot-on that they skipped this to rush the digitisation out to the market early.\n\n"
    },
    {
      "time": " 18 May, 2006 - 8:49am",
      "content": "_(…) they skipped this to rush the digitisation out to the market early._\n\nYou can tell that by the early Adobe fonts — some of them are so crappy I wouldn’t have touched them with a ten foot long composing stick (see for example [Erik Spiekermann](http://web.archive.org/wiki/Erik%20Spiekermann)’s [comparison with the Futura for VW that he oversaw](http://web.archive.org/web/20061202213122/http:/www.spiekermann.com/iblog/C61720386/index.html)). I wonder if those ever got fixed.\n\n ![](http://web.archive.org/files/futura_vw2_4532.gif)\n  \n_Top sample: Adobe’s version. Bottom sample: VW Futura.  \nImage nicked from Erik’s blog._  \n"
    },
    {
      "time": " 18 May, 2006 - 9:22am",
      "content": "\\> _You can tell that by the early Adobe fonts…_\n\nWeren’t the earliest of the PostScript conversions done by Linotype for Apple and Adobe? Chalk it up to “learning curve”?\n\n"
    },
    {
      "time": " 18 May, 2006 - 10:23am",
      "content": "In regards to Bitstream: I think we need to stop digging up their depressing past. Jim Lyles and co. have gone to great lengths to get everything above board and paid for.\n\n"
    },
    {
      "time": " 18 May, 2006 - 11:06am",
      "content": "In regards to the original sample: It’s amazing what letterpress can do for type. :^)\n\n"
    },
    {
      "time": " 18 May, 2006 - 11:27am",
      "content": "\\> _It’s amazing what letterpress can do for type._\n\nConversely, it’s amazing what computers _can’t_ do for type _yet_… like full ranged optical scaling and spacing. But then again, maybe that’s actually a _good thing_.\n\nGuess I’ll put my old Paul Simon record (those big black flat round things) on my old Dual turntable and listen to “Mama, don’t take my Kodachrome”! I need an analog moment :-)\n\n"
    },
    {
      "time": " 19 May, 2006 - 10:52am",
      "content": "wow, sorry I haven’t been able to check the posts but it’s been so interesting reading all the comments and feedbacks!! I really would like to use this font, particularly for an wedding invitation design. So my gut is telling me to go with the Mahogany Script? Seems like the thick and thins on Mahogany is more prominent, therefore nicer for wedding invites/letterpress. superultrafabulous~! Thanks!!\n\n"
    },
    {
      "time": " 19 May, 2006 - 11:10am",
      "content": "Mahogany Script! bought! thanks! tho I probably won’t find any use for the free font, Chilada Dos. eikes~ the font gives me the crippy crawlers.. strangely, it’s twice the cost of Mahogany font. I think it’s adios (trash bin) to chilada dos. :)))\n\n"
    }
  ]
}
