{
  "id": "2000",
  "title": "How to calculate the best font metrics?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi,   \n   \nWhen I have my scetches ready to be put into Fontographer, how do I best calculate the metrics (descender, ascender room)?   \nNormally the \"interlining\" (space between the descenders and ascenders of the next line) is set to 10/12. I would like to calculate the room between the lines and wonder if there is a default rule to follow here.   \nI know it also depends on the wishes of the designer, but is there something like a golden rule? How to calculate the metrics so that they reference 10/12?   \n   \nI hope this makes any sence. My english has some major holes in this technical area.   \n   \nAny tips?   \n   \nThanx,   \nRen\n\n",
  "author": "<a href=\"/web/20120207212833/http://www.typophile.com/user/1946\" title=\"View user profile.\">Characters</a>",
  "time": "<br>",
  "uid": "1946",
  "comments": [
    {
      "time": "",
      "content": "Hmm, I guess one of the best ways to understand   \nthese things, is opening an existing font and   \nlooking at it.\n\n"
    },
    {
      "time": "",
      "content": "Yes, I did this and I know h\n\n"
    },
    {
      "time": "",
      "content": "\\> my type has a x-height of 6 mm, the   \n\\> ascenders are 3 mm [...]   \n   \nHmm, don't think of type in milimeters, or inches.   \nThink about 'units'. Usually, Postscript fonts   \nhave a total height of 1000 units.   \n   \n\\> How much room do I leave in between the lines so   \n\\> that it looks and feels good?   \n   \nIt depends on a lot of things: body size,   \nline-length, language, aesthetic preferences, etc.   \nThat's why the leading (the 'room between the   \nlines') is defined by the graphic designer, the   \nperson using your typeface.   \n   \nEdit: there's a small amount of leading that   \nshould be defined by the type designer (see   \nbelow).   \n   \nIt's impossible to achieve a 10/12 leaded font.   \nYou can't change leading on Fontographer.   \n   \n---   \n   \nI'd suggest you this. You have:   \nDescender (2x) + xHeight (6x) + Ascender (3x) = Total (11x)   \n   \nChange 'x' for 70 units. You'll have:   \nDescender (140) + xHeight (420) + Ascender (210) = Total (770)   \n   \nConsidering this is a Postscript Type-1 font,   \nyou'll still have a 'residual leading', 230 units.   \nTry this in Fontographer, and compare the result   \nto an existing font. This is hard to explain   \nthrough words... :-|\n\n"
    },
    {
      "time": "",
      "content": "Rene, I guess you mean the \"internal leading\" (also called \"talus\"), the empty space below the descenders plus above the ascenders? For the former, usually it's about 10% (20% is too much), although it does vary depending on intended usage and x-height size.   \n   \n\\> don't think of type in milimeters, or inches.   \n   \nTrue - unless you're designing for an exact size! :-)   \n   \nUsing Eduardo's method, I'd use 80-85 instead of 70.   \nAlso, you should put most of the talus above the ascender height (for cap accents).   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "hhp, I take it you mean 10% of the body height?   \n   \nBut that's what I'm looking for, the internal leading. Now I know how to call that space; talus. Funny word...   \n   \nSorry about my bad technical English. I never studies type design. Everything I know I know from learning by doing and over the internet. I would like to get some more knowledge on the technical background of type design and get some more tricks on how to make a type more consistent. Now I'm working like a monk to get my types in balance. I'm a perfectionist, therefor it works. But some background information, that you might get in the first lesson of type design, I might not know.   \n   \nThanx,   \nRen\n\n"
    },
    {
      "time": "",
      "content": "\\> talus   \n   \nJust so you know, that's a very rare term\\*. \"Internal leading\" is more common, but it's still rare. Some people call it \"shoulder\", alluding to metal type, but I think that's misleading because the shoulder and the neck\\*\\* combined made up the talus.   \n   \n\\* I got it from Javal, but have seen it only one other place. I like it because it's short and sounds nice.   \n   \n\\*\\* The inclined part going up from the flat shoulder to the face of the sort.   \n   \nBTW, monk is good.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Be careful.   \n   \nBeing a perfectionist AND doing type design will result in your head exploding.   \n   \nJames\n\n"
    },
    {
      "time": "",
      "content": "Ren\n\n"
    },
    {
      "time": "",
      "content": "Ren\n\n"
    },
    {
      "time": "",
      "content": "Jim, I didn't know Ikarus runs on a Royal.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> \"internal leading\"   \n   \nSure, that was discussed at Typo-L a while ago.   \nI couldn't remember the term, though.   \n   \n\\> unless you're designing for an exact size!   \n   \n:-)))   \n   \n\\> I would like to get some more knowledge [...]   \n   \nGo to Hague (KABK)!\n\n"
    },
    {
      "time": "",
      "content": "\\> I know that many will think this is archaic   \n   \nI have never actually used Ikarus, but I guess   \nmany 'professional' foundries still use it for   \ntype design, don't they?\n\n"
    },
    {
      "time": "",
      "content": "_I have never actually used Ikarus, but I guess   \nmany 'professional' foundries still use it for   \ntype design, don't they?_      \n   \nSome of the older, larger companies might still use Ikarus if they're digitising a large amount of work from analogue artwork, but almost everyone I know now designs directly on computer. If they make drawings on paper, they are more likely to scan these and use ScanFont to create initial outlines, or to do what I do: prop up the drawing beside the computer screen and 'eye-ball' it in FontLab.\n\n"
    },
    {
      "time": "",
      "content": "Thanks, John.\n\n"
    },
    {
      "time": "",
      "content": "Hrant   \n   \nSee . . . you're never too old to learn something new.   \n   \nJim Rimmer\n\n"
    },
    {
      "time": "",
      "content": "Eduardo   \n   \nI have heard that Ikarus is being used less and less, but I am not really on an inside track regarding computers, so I don't know how popular it is. I would guess not very widespread. It is the first thing that I came across when Gerald Giampa started his font company here in the Vancouver area in the mid eighties.   \n   \nI like it that Ikarus is attuned to working right on top of your drawings rather than on scans. I realize that it is old technology, but I've gotten very comfortable with it, and once you get on to what it can do, it's FAST!   \n   \nOn the other hand, I had a student from an art college come here to my workshop, and he wanted to learn Fontographer which I also use, and he like it a lot, since he was working from scans of Victor Hammer's American Uncial. Once he had done all the outlines, I taught him the process and he cut it in 14 point metal.   \n   \nI'd like to take a shot at Fontlab. I saw it used here at the ATypI bash, and thought it looked very refined, although for me Ikarus would be quicker and with so much manual control.   \n   \nJim Rimmer\n\n"
    },
    {
      "time": "",
      "content": "I used IKARUS for years, then went to FontStudio and then to FontLab. Never did the Fontographer thing apart for the occasional diddle.   \n   \nIKARUS was great at working on analog art, but I would never go back.\n\n"
    },
    {
      "time": "",
      "content": "Although it is mighty interesting to discuss over and over the advantages of this program for font production over that program, the most interesting thing at the end is what you want to achieve. I assume that for type designers the main goal is to convert the idea into perfect contour descriptions. The font producer wants to have the most solid conversion of the outline data into the current font formats. The end user is normally only interested in the quality of the design and he wants to be sure that the fonts function fine technically. Which program(s) were used for the font production is not important at all for the end user. Also, in time the only thing that will last is the design itself. Beside some technicians and historians, in the future nobody will be interested in the current technology used for the creation of the type. If the design is good, it will last and otherwise it will be forgotten no matter how interesting we now consider the way the technology was used. And then for the font producer there is the long term technology, the digital contour description, and short term technology that preserves the best conversion to limited apparatus, like delta hints. On the (relatively) long term only the contours will be the constant factor and the short term technology will change constantly.   \n   \nSo, the type designer will use the program that fits his purposes best to create the outlines. This can be done in Illustrator, Fontographer, FontLab, BezierMaster, IkarusMaster, etc. The method used depends on the basic material. If there is analog material, the decision on which method is the best for conversion into digital outlines will be based on the quality of the drawings. For sketches normally the use of an auto tracing program is most likely but for high quality working drawings Ikarus is the most appropriate application. It makes no sense to scan a perfect contour, subsequently to auto trace this and then to end up with reworking the contours again. This is a waist of time and probably also of quality.   \nThe fact that the Ikarus algorithms are more than 25 years old does not mean it is old technology. It would be archaic in case there was a better alternative for converting working drawings into digital contours but there is none. For this reason the next generation of IkarusMaster will support the Wacom CAD tablets.   \n   \nIf it is true that most designers don't make working drawings anymore, then this worries me somewhat. The design itself should determine the most preferable production. Almost for all DTL typefaces we start(ed) with drawings which are manually digitized. Revivals like DTL Fleischmann, DTL Fell and DTL VandenKeere were completely made on paper and afterwards manually digitized to preserve as much detail as possible. The basic sets of DTL Romulus were also digitized in Ikarus. Again, the technology is only a means to help the type designer to convert his ideas. In our case DTL FontMaster fits our purposes, of course, but it is fully understandable that other designers/font producers stick to FontLab or any other (combination of) programs.   \n   \nConcerning the internal leading in the em square I would like to add that first of all you should make use as much as possible of the resolution. By reserving a large part of the em for the leading there could be a lost of accuracy because you end up with less resolution for the contours themselves. Besides this, normally the lengths of the descenders will change in case of the bolder versions of a type face. Because of the increasing x-height of the bolder versions the relation between the lenght of the ascenders and the descenders will change and it is quite common to make the descenders somewhat shorter.\n\n"
    },
    {
      "time": "",
      "content": "The amount of \"internal leading\" really does depend on the vertical proportions of the typeface (cap height : extender length : x-height).   \n   \nBut that's not all...   \n   \nThe popular Futura Book (Neufville-Adobe) has a massive overshoot of extenders! But in URW's version the extenders are within the em square..   \n   \nNewspaper text faces (eg Utopia) are very \"big on the body\", to maximize wordcount.   \n   \nThe opposite of that is Zuzana Licko's faces, many of which are \"small on the body\" -- which gives a very \"designery\" look in a default setting.\n\n"
    },
    {
      "time": "",
      "content": "\\>Newspaper text faces (eg Utopia) are very \"big on the body\", to maximize wordcount.   \n   \nNo, that doesn't make sense. It's because if there's one typographic issue that readers will write to the editor about, it's \"too small type\".\n\n"
    },
    {
      "time": "",
      "content": "Hrant -- You never cease to amuse me . . . \"talus\"?! That's funny: the neck plus the shoulder equals the ankle bone. Good one. ;-)   \n   \n   \nOn a historical note (you all knew I had one, right), typefaces designed for production as Linotype matrices were required, for mechanical reasons, to leave a small amount of space at the top and bottom of the design. (For sizes 5 and 6 pt, this was .002\"; for 7 to 12 pt, .003\"; 14 pt, .004\"; and 16 to 24, .005\".)   \n   \nSo, for example, a 12-point design, with a slug of 0.166\", could only be 0.160\" tall. Translated to Postscript units (1000 unit em), this is equivalent to 964 units on the body. This was a maximum; the designer could, if he wanted, make the face smaller.   \n   \nThe proportions of ascenders and descenders were dictated by a standard line placement for every size. On occasion, there were ways of working around these.   \n   \nI spent some time at one point examining a number of current Postscript fonts and observing various proportions. The size of designs, from top of ascender to bottom of descender, varies widely -- from designs like PMN Caecilia, MT Albertina, or Iowan Old Style which extend beyond the em square by a couple units to smallish designs like MT Fournier, MT Ehrhardt, or MT Walbaum which come in around 850 - 900 units or so. The average over 40 designs that I looked at was around 960 units -- on par with the Linotype 12-pt standard.   \n   \n-- K.\n\n"
    },
    {
      "time": "",
      "content": "_The opposite of that is Zuzana Licko's faces, many of which are \"small on the body\"_   \n   \nThe best part about Zuzana Licko's faces: you can look the client dead in the eyes and say, \"Oh, really? All the work you do in MS Word is at 12 font size number? Well, why don't we just kick it up a notch? 13pt just to be safe?\" :-)   \n   \nKent, we can always count on you for an historical tidbit and a survey of current postscript fonts with corresponding data. Thanks for taking the time.   \n   \nRandy\n\n"
    },
    {
      "time": "",
      "content": "A lot of great info, guys! :-)   \n   \nBTW:   \n\\> I'd use 80-85 instead of 70.   \n   \nOf course! I guess I was thinking of ascender-height, not total-height. :-/\n\n"
    }
  ]
}
