{
  "id": "20003",
  "title": "Media company logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Thoughts, sugestions, critisism, direction, disses, slaps, kicks and punches or whatever.\n\n| Attachment | Size |\n| --- | --- |\n| [media-drink.jpg](http://web.archive.org/web/20060602004342/http:/typophile.com/files/media-drink.jpg) | 9.36 KB |\n\n",
  "author": "<a href=\"user/9981\" title=\"View user profile.\">durojiah</a>",
  "time": "<br>",
  "uid": "9981",
  "comments": [
    {
      "time": " 17 May, 2006 - 11:02pm",
      "content": "I like the visual pun… but because its outline, I think it might not transmit well via fax. And at smaller sizes on the web you can expects lots of problems. Outlines are typically not very study in these environments.\n\nMikey\n\n"
    },
    {
      "time": " 18 May, 2006 - 7:37am",
      "content": "I second Mikey’s comment, but also - how come the straw disappears when the bottom of the glass is visible? Surely the stem of the i/straw would be shown?\n\nIt’s not a bad thing to bear in mind the limitations of having outlines - as said above, it won’t look quite the same when faxed/photocopied, and won’t look too hot at a small size - this will be the case on letterheads, forms etc., that you would create as part of a stationery suite for the company.\n\nNice idea though, it made me smile.\n\nSi\n\n"
    },
    {
      "time": " 18 May, 2006 - 8:30am",
      "content": "Tell us more about the company do they work in the drinks sector or are they heavy drinkers and how, where the logo is supposed to perform. Why is the bottom of the i not visible in the glass when the bottom is?  \nTim  \n{edit sorry, bit of a crosspost, I didn’t mean to repeat what was previously said}\n\n"
    },
    {
      "time": " 18 May, 2006 - 12:08pm",
      "content": "The idea behind the company is that it is a mix of media production. It could be called media stew but I thought drink sounded better. The other thing is a lot of media that is produced can be boring or repeated a drink is kind of a symbol of refreshment so hopefully people will think the company provides fresh ideas. Thanks for the feedback I agree completely here is a revision and I think it is an improvement.\n\n ![](http://web.archive.org/files/media-drink-black_5986.jpg)\n\n"
    },
    {
      "time": " 18 May, 2006 - 12:29pm",
      "content": "I like the new solid version. All you need is perhaps show the i through the glass… I’m not sure, try it and see if you like it.\n\nAnd also perhaps nudge the cup over a little to the left- closer to the d.\n\nGreat Work,\n\nMikey\n\n"
    },
    {
      "time": " 18 May, 2006 - 12:35pm",
      "content": "The ri needs some adjustment, you could cut the arm of the r and/or reduce the serif on the i; the dots on the i are grabbing attention; I find the m much too condensed. The glass isn’t really saying refreshing, perhaps a taller glass with some indication of liquid/ice cubes would help, I also think you are going to have problems with the weight of the stroke in reproduction but equally you don’t want it to overwhelm the lettering. As a thought you could create the logo in two lines with the glass/straw device taking the place of both i’s (I really don’t know if that will work).  \nTim\n\n"
    },
    {
      "time": " 19 May, 2006 - 1:43am",
      "content": "I like the underlying concept, I think the name is interesting (in a good way), but I really think you’re asking for problems with the thin stroke weight on the glass (the lettering is also very thin, it might look very fiddly at a small size). Maybe widen your idea around the drink idea - maybe look at more than a glass, off the top of my head you could possibly use a slice of lemon/lime that you’d find in a cool drink - the fruit would also suggest freshness, and the associated yellow/green would back this up. Just a thought, I’m sure there are lots of other drink related objects you could make use of.\n\nSi\n\n"
    }
  ]
}
