{
  "id": "20061",
  "title": "Italics style question - help pls.",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Ok, here it is. Any quick replies would be greatly appreciated:\n\nThe title of a poem/article normally appears in quotation marks, not italicized like a book title, and words in a foreign language within an English text are set in italics.\n\nI have an English text which mentions a poem with a French title. Should it be both italicized and in quotes, or do I leave off the italics?\n\nIt seems simple (I think it should be in both italics and quotes), but I am unsure all of a sudden.\n\nThanks,\n\nKristina\n\n",
  "author": "Kristina Drake",
  "time": "19 May 2006 — 11:43am",
  "uid": "9151",
  "comments": [
    {
      "time": "19 May 2006 — 12:06pm",
      "content": "What a great excuse to use... guillemets!\n\nhhp\n\n"
    },
    {
      "time": "19 May 2006 — 12:18pm",
      "content": "Heh, don't know if you're joking or not. It's that time of day when my sense of humour and reality have both left the building. (Proper terminology has alos left, apparently.)\n\nPlease tell me you're making a pun and not referring to those carrot-like characters used to set quoted material in French texts. We never use those in English... Or am I really going crazy?\n\n(I'm editing blurbs about artwork for an art gallery catalogue.)\n\nThanks, though, Hrant. Bah.\n\nK.\n\n"
    },
    {
      "time": "19 May 2006 — 12:21pm",
      "content": "_We never use those in English…_\n\nbut you said the poem mentioned had a French title.\n\n"
    },
    {
      "time": "19 May 2006 — 12:24pm",
      "content": "Is this » a guillemet?\n\nIt’s used in French but wouldn’t it be wrong to use it in English? It’s the language around the quote, not the language inside that counts, right?\n\nThey look better than ‘regular’ quote marks, though. And in Finnish, we can choose which marks to use, guillemets (?) are legit, too. Suckerrrrs!\n\nEdit: Okay, I was a little slow… But I still think I’m right. You just can’t use them. I can. Mwahahah.\n\n"
    },
    {
      "time": "19 May 2006 — 12:27pm",
      "content": "Well, yes, but we still don't use those symbols. If you were citing an English title in a French text, you would use French typographical style, not English-style quotation marks... no?\n\nI wish I had my reference books with me. OK. I'll wait till I get home and check.\n\nThanks,  \nK.\n\n"
    },
    {
      "time": "19 May 2006 — 12:29pm",
      "content": "Gorot Esqué --\n\nIt's not only me. Phew. That was my thought, too. The language outside the quotes is what counts.\n\nOk, but what would you do then? Italics and quotes?\n\n(you guys did respond quickly, thanks!)\n\nK.\n\n"
    },
    {
      "time": "19 May 2006 — 12:32pm",
      "content": "this kind of thing can usually vary depending on what style guide you're referring to. are you following any standard writing style we should know of?\n\n"
    },
    {
      "time": "19 May 2006 — 12:40pm",
      "content": "No style guide provided. I'm going with what's already consistent in the text, with what I've been taught, and with what seems to be the usual practice. It's a small contract job. Canadian - which affects some spelling.\n\nI will consult the bible when I get home, though. I haven't seen (ok, haven't noticed is more appropriate) any of those characters in English texts. Maybe I haven't been paying enough attention!\n\nThanks,  \nK.\n\n"
    },
    {
      "time": "19 May 2006 — 12:41pm",
      "content": "Gorot… Thanks. The Norwegian name I never had. :)\n\nI don’t know if I can help you. In Finnish (third time in an hour), we can either go Italian or just use quotes for titles, there are no specific rules. I think. In my opinion the English way to use a lot of French words is a bit… silly. Just based on my gut feeling and some English I’ve read, I’d say go both ways.\n\nYours, Gorot\n\n"
    },
    {
      "time": "19 May 2006 — 12:43pm",
      "content": "_go Italian_\n\ngreat terminology!\n\n"
    },
    {
      "time": "19 May 2006 — 12:46pm",
      "content": "lol. Yeah, we get stuffy about our French...\n\nThank you again, guys.\n\n"
    },
    {
      "time": "19 May 2006 — 12:49pm",
      "content": "Since not all foreign words have to be italicised, and  \nquotes indicates it is clearly a title, I would go for quotes, no italics. Ah, I just found it in the Chicago Manual of Style (section 10.5), they say no italics, yes quotes.\n\n"
    },
    {
      "time": "19 May 2006 — 12:58pm",
      "content": "Thank you!  \nmwah!\n\nK.\n\n"
    },
    {
      "time": "19 May 2006 — 12:59pm",
      "content": "William, you’re super! And it makes sense, too.\n\nPaul, what about _typeface_? Dezcom’s picture?\n\n"
    },
    {
      "time": "19 May 2006 — 1:26pm",
      "content": "\\> We never use those in English…\n\nWho's we?\n\nSee frame 14 here:  \n [http://www.themicrofoundry.com/manademo/](http://web.archive.org/web/20140127081313/http:/www.themicrofoundry.com/manademo/ \"http://www.themicrofoundry.com/manademo/\")\n\nhhp\n\n"
    },
    {
      "time": "20 May 2006 — 3:43am",
      "content": "Just to stick a spanner in the works, I would use italics for any reference to another document, not just for a foreign language, and leave quotes for quotations.\n\nHrant, isn't the French convention to use guillemets with spaces before the text?\n\nTim\n\n"
    },
    {
      "time": "20 May 2006 — 7:48am",
      "content": "Maybe thin spaces - which Mana doesn't have - although at  \nthe larger sizes you could use the space from a smaller size,  \nlike how you can do smallcaps (see frame 18).\n\nhhp\n\n"
    },
    {
      "time": "20 May 2006 — 12:12pm",
      "content": "Busted!\n\n"
    },
    {
      "time": "20 May 2006 — 12:20pm",
      "content": "Hey, it's already enough work selling screenfonts! :-/\n\nhhp\n\n"
    },
    {
      "time": "20 May 2006 — 12:37pm",
      "content": "\"Maybe thin spaces...\"\n\nI was taught, and I'm pretty sure everybody who learns French is taught, to use generous spacing around guillemets, also colons. Just pulled a bunch of French books from my bookshelves. Every one that I looked at, published from 50 years ago to the present, conforms to that practice :)\n\n"
    },
    {
      "time": "21 May 2006 — 1:49am",
      "content": "_isn’t the French convention to use guillemets with spaces before the text…_, however if you do it in an English text it might appear as a mistake and act as a hindrance to the reader rather than an assistance.  \nTim\n\n"
    },
    {
      "time": "21 May 2006 — 8:21am",
      "content": "Tim, actually redge was leading off from my suggestion to use guillemets in English and pointing out that the modern convention on the French side is to use more than thin spaces (between them and the quoted material). I based my suggestion of thin spaces on what I've seen in older books (see below), but I stand corrected on modern usage. (It's a good thing I only make fonts, and rarely actually <cite>use</cite> them. :-)\n\nThe thing is though, if you've decided to go against English convention in such a big way in the first place by using guillemets, I think you can safely ignore the <cite>spacing</cite> conventions of the language you're borrowing the symbols from!\n\nBTW, as is quite often the case, a <cite>hybrid</cite> solution I feel can really click. Check out this setting from the Imprimerie Nationale's \"Origines de l’imprimerie en France\" (A Christian) of 1901:\n\n ![](http://web.archive.org/web/20140127081313im_/http:/typophile.com/files/IN1901_53_6327.gif)\n\nSimply wonderful, and something that could serve for both English and French, especially in a publication featuring both. Also note the spaces around the... \"quotemets\". :-) Although the setting is justified, it seems they're not full spaces on the \"insides\". Why the discrepancy between that sample and modern practice? I have to think it's <cite>quality</cite>: the IN was the height of it, while the last 50 years was... not. I'd suggest that in the modern era the need to have <cite>some</cite> space on the inside coupled with the general unavailability of thinner spaces is what led to full spaces. A little bit like how many people -incorrectly- drop the accents from French caps.\n\nhhp\n\n"
    },
    {
      "time": "21 May 2006 — 10:05am",
      "content": "I think curly quotes are the secondary choice in French. Like when there’s quote inside a quote. Like in English there are single and double quotes.\n\n"
    },
    {
      "time": "21 May 2006 — 12:17pm",
      "content": "Happy Sunday, Hrant,\n\nThat sample (mana demo) was precisely the kind of text I was working with.\n\nI decided to go with William's suggestion, partly becauseit already appeared that way in the document (quotes, no italic). As my prof used to say, errors of commission are worse than errors of omission.\n\nYou (that really means I) learn something new every day... and I certainly don't claim to have a great deal of experience with this. I think the guillemets in your example actually work just fine. But I don't recall ever seeing that done before -- like I said, probably I just haven't been paying that much attention.\n\nThanks again,\n\n(That was my first contract editing job... the realm outside of Concordia's acadmeic publications is a whole different ballgame... hopefully I've got a toenail in the door -- or out, depending on how you look at it.)\n\n"
    },
    {
      "time": "21 May 2006 — 12:26pm",
      "content": "\\> I don’t recall ever seeing that done before\n\nI've seen it very rarely, and only one place I can refer to:  \n\"The letter as a work of art; observations and confrontations  \nwith contemporaneous expressions of art from Roman times  \nto the present day.\", G Knuttel, Amsterdam Foundry, 1951.\n\nThat font in that IN sample though is totally unique, AFAIK.  \nBut man does it work.\n\nhhp\n\n"
    },
    {
      "time": "21 May 2006 — 1:56pm",
      "content": "Clarifications:  \nThe Knuttel book is in English; it uses guillemets for all the  \n quotes/titles/whatever, not [just] for other-language stuff.\n\nhhp\n\n"
    },
    {
      "time": "22 May 2006 — 2:52am",
      "content": "\\>The thing is though, if you’ve decided to go against English convention in such a big way in the first place by using guillemets, I think you can safely ignore the spacing conventions of the language you’re borrowing the symbols from!\n\nYes, that's what I was saying, my reasoning being that comfort\\* for the reader was paramount and that using a guillemet was already alien enough to them without adding extra spacing, the guillemet would alert the reader to a foreign language. I like the quotemets, but because the form is already familiar to a reader (this _reader_ is a mono-lingual Anglo:) the unfamiliar positioning might be a bit much, do you think they are intended as a Didone development of the guillemet?\n\nBTW what's with the extra stroke on the l's and g's?\n\n\\* in a what we read most meaning, maybe in bi-lingual setting one would use the original convention.\n\nKristina, good luck with the toenail, hope you enjoy it.\n\nTim\n\n"
    },
    {
      "time": "22 May 2006 — 10:52am",
      "content": "\\> a guillemet was already alien enough to them without adding extra spacing\n\nAh, I get it - makes sense.\n\n\\> do you think [quotemets] are intended as a Didone development of the guillemet?\n\nI don't think so, since other Didone fonts don't have them.  \nIn fact I'd say that something with a ball-and-curl is less  \nDidone than a chevron shape. BTW, I actually prefer to  \nsee \"fake\" (straight) quotes used with Bodoni et alia.\n\n\\> what’s with the extra stroke on the l’s and g’s?\n\nThe one on the \"el\" is famous. It came about with the RdR,  \nreputedly in order to help maintain the copyright given to  \nthat design by the roi. But looking at what the \"el\" would  \nhave looked at without it, I have to think there's a much  \nmore pragmatic reason: clear differentiation with the \"I\"  \nand the numeral 1.\\* In any case, it was taken up in some  \nlater Didone designs of the IN, sometimes being flipped to  \nthe other side (by Luce, I think).\n\n\\* Here's a scan from my hand-set Balzac printed at the IN:\n\n ![](http://web.archive.org/web/20140127081313im_/http:/typophile.com/files/CharlesX_6220.gif)\n\n-\n\nThe one on the \"g\", in fact that \"g\" as a whole,  \nseems to have been an affectation: merely a way  \nfor one of the Didot brothers to differentiate  \nhimself from the others, as far as I understand.  \nOne of Porchez's Didot fonts revives it nicely.\n\nhhp\n\n"
    },
    {
      "time": "22 May 2006 — 11:49am",
      "content": "Ah! Cunning embedded trademark. Differentiation makes sense.  \nTim\n\n"
    },
    {
      "time": "23 May 2006 — 9:30am",
      "content": "Don't re-invent the wheel!\n\nin French you can use booth guillemets « and » or what we call guillemets Anglais who are in fact nothing else that the usual things you use in your side of Atlantic:  \n“ and ”\n\nfirst link about it in google:  \n [http://www.synapse-fr.com/manuels/A\\_GUILLE.htm](http://web.archive.org/web/20140127081313/http:/www.synapse-fr.com/manuels/A_GUILLE.htm \"http://www.synapse-fr.com/manuels/A\\_GUILLE.htm\")\n\n"
    },
    {
      "time": "23 May 2006 — 10:30am",
      "content": "\"Paul, what about typeface? Dezcom’s picture?\"\n\n??? Please explain your question?\n\nChrisL\n\n"
    },
    {
      "time": "23 May 2006 — 11:07am",
      "content": "Okay, Chris…\n\nYour picture pictures a face (okay, a head) made of type. Thus, a _type face_. That’s another one of my great terms, type face. Both words translated to Finnish individually. It’s sounds silly. Hehe. He.\n\nSo actually, it was more a statement than a question.\n\n"
    },
    {
      "time": "23 May 2006 — 11:37am",
      "content": "I have always enjoyed seeing translations of expressions from different languages. In the native language, it makes perfect ordinary sense to anyone but translated, it brings laughter. A perfect example might be the American expresion \"It is raining cats and dogs\" which means it is raining quite hard. I imagine translated to Finnish, this sounds quite silly.  \nTypeface is not quite as silly but is understood by English speakers without a pause. There is a Greek expression (ou na hchatheis) which translates to \"If you would lose yourself\" and sounds odd to Americans. The meaning is more like \"get lost!\" or even \"Go to hell!\" but it rolls off the tongue with a much more nasty sound than that in Greek.:-)\n\nI actually like the idea that my use of \"Typeface\" makes you laugh since I often say things in silly ways :-)\n\nChrisL\n\n"
    },
    {
      "time": "23 May 2006 — 11:47am",
      "content": "In Lebanese-Armenian slang we have a cool expression, \"pndrvil\", which  \ntranslates literally to \"being searched for\" - it means \"looking for trouble\".\n\nhhp\n\n"
    },
    {
      "time": "23 May 2006 — 12:02pm",
      "content": "It actually rains cats and dogs in Finland, too. I guess they come from English speaking countries, though.\n\nHere you can find how to say “go to hell” in Finnish.  \n [http://www.notam02.no/~hcholm/altlang/ht/Finnish.1.html](http://web.archive.org/web/20140127081313/http:/www.notam02.no/~hcholm/altlang/ht/Finnish.1.html \"http://www.notam02.no/~hcholm/altlang/ht/Finnish.1.html\")  \nNot for you Americans, it’s not that sensitive site.\n\nAbout typeface… I really say ‘typeface’ in Finnish when talking about fonts because the Finnish words are s dull.\n\n"
    }
  ]
}
