{
  "id": "2009",
  "title": "Scandinavian ornament wanted",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,   \n   \nI'm currently finishing up my next typeface but am still looking for a nice Scandinavian ornament.   \nSome types have the French Lily or any other ornament as a decorative element. I'm looking for something that fits to this type:   \n   \n ![Nordic](http://web.archive.org/web/20140307105029im_/http:/www.typophile.com/forums/messages/30/20181.gif)   \n   \nAny suggestions? I've thought about the Vikings but can't find anything.   \n   \nThanx,   \nRen\n\n",
  "author": "Rene Verkaart",
  "time": "10 Nov 2003 — 1:04pm",
  "uid": "1946",
  "comments": [
    {
      "time": "10 Nov 2003 — 2:07pm",
      "content": "Rene, the type of artwork most commonly associated with Scandinavian culture -- at least in the U.S. -- is [rosemaling](http://web.archive.org/web/20140307105029/http:/www.rosemaling.com/). These are brightly colored floral patterns, typically hand-painted by amateurs onto wood (furniture mostly).   \n   \nStephen's example, while not rosemaling, is definitely a good one as well and might be a better source of dingbat inspiration. Good luck!   \n   \nBy the way, I really like your font.   \n   \nStephen: did you buy a new pair of boxers in Sweden or something? :-)\n\n"
    },
    {
      "time": "10 Nov 2003 — 6:37pm",
      "content": "\\>_and the backside of a very nice girl I know._   \n   \nI guess if you're going to take photographs of the backsides of very nice girls, it helps if you know them.\n\n"
    },
    {
      "time": "11 Nov 2003 — 12:19am",
      "content": "Hi John,   \n   \n'I'm affraid' that is exactly what I need. I really like it, but it so 'kitsch'. Ugly in a good way.   \nI see some very nice ornaments coming up.   \n   \nRegards,   \nRen\n\n"
    },
    {
      "time": "11 Nov 2003 — 1:55am",
      "content": "Ren\n\n"
    },
    {
      "time": "11 Nov 2003 — 2:27am",
      "content": "Hi Gerald,   \n   \nThanx for your input. I've also asked my ex, she's Finnish, and also said the Norwegan flower ornaments would be to much. They don't mean anything to her, she said. She herself suggested something from the Vikings. That was my first thought also, but I realised too that it could be too prototype. She also suggested using the ear-marking of the raindeer, but that's a little too abstract for me:   \n [http://tuikku.urova.fi/avoin/poronhoito/merkitys.htm](http://web.archive.org/web/20140307105029/http:/tuikku.urova.fi/avoin/poronhoito/merkitys.htm)   \nThat's an alfabet for it self, but not enough decorative.   \n   \nPersonally I liked the birds under the trees on your site. Something like that would be great. If you have more suggestions, I have time.   \n   \nI've been in Finland once and it was great. My ex's parents live in Rovaniemi, very close to the north pole as I could feel. Perhaps I visit Finland again. I liked it a lot. I'll also visit the 'Santa Pukki' again (is that spelled correctly?).   \nWho did invent the sauna by the way? ;-)   \n   \nLove your way of working with ornaments, by the way.   \n   \nRegards,   \nRen\n\n"
    },
    {
      "time": "11 Nov 2003 — 4:01am",
      "content": "I would not dismiss Viking. In the case of prototype you could certainly do worse. Viking motif is powerful.   \n   \nEar marking, I guess you heard! I was hoping to purchase a reindeer to get around with. However they eat moss. Houtsk\n\n"
    },
    {
      "time": "11 Nov 2003 — 4:18am",
      "content": "That's interesting that rosemaling isn't really \"authentic\" Scandinavian art anymore.   \n   \nMost of the Scandinavian immigrants came to my state of Minnesota in the late 19th and very early 20th Centuries, and they brought it with. It was a very \"Swedish grandma\" thing to do. But if you were to ask a typical Minnesota Scandahoovian, they'd swear up and down it was the real deal. Well, I guess Europe has left us behind again. Damn it!\n\n"
    },
    {
      "time": "11 Nov 2003 — 4:42am",
      "content": "John,   \n   \nIt is the real deal. Nordic people are sea people, they get around. Still do. Ornaments are just a broad topic. I wish I had my hands on historical showings of \"Arabia\" china products. A distinquished Finnish pottery. Their museum is quite the place. If you get to Finland don't miss it.   \n   \nIt would take you through time zones. Quite the material. Unfortunately they closed down their hand painting department since I moved here. Things are moving the way of Nokia.\n\n"
    },
    {
      "time": "11 Nov 2003 — 4:57am",
      "content": "Gerald, the Metropolitian Museum of Art had a quarterly about ceramics and all the early colonial pottery was painted in China based on designs from the Scandinavian region. Very interesting. Dan\n\n"
    },
    {
      "time": "11 Nov 2003 — 7:12am",
      "content": "Dan,   \n   \nThat certainly is interesting. I wonder if there are any copies to be had. Thank you for the tip. As you know I am writing a book about ornaments, typographical and otherwise. My present focus, at the moment, is on traditional source readily available to me in Scandinavia.   \n   \nMy working title is \"Ornament and Function.\" This is based on some of my original thoughts. [http://www.lanstontype.com/FishBasket.html](http://web.archive.org/web/20140307105029/http:/www.lanstontype.com/FishBasket.html)   \n   \n   \nThe reason I asked about knitting: Knitting clearly illustrates my point about the subtle aspects of ornament. Also illustrates ornament as function, and the structure of mans' day to day activities. See second link.   \n   \n [http://www.lanstontype.com/SpiderWeb.html](http://web.archive.org/web/20140307105029/http:/www.lanstontype.com/SpiderWeb.html)   \n   \nOrnament is not necessarily just \"icing on a cake.\" Pretty little things tied on like a woman's bonnet, or masking an otherwise ugly face with lipstick. _Mind you, that has useful function too._   \n   \nThat ornaments have strong purpose, that they have served man and nature profoundly well. They do not deserved to become orphaned ancestors. They are building blocks of society, building blocks of nature.   \n   \nThat is why I am so delighted Ren\n\n"
    },
    {
      "time": "11 Nov 2003 — 7:54am",
      "content": "Danish stuff:   \na classic: [http://www.royalcopenhagen.com/copenhagen/webapp/news?show=604#](http://web.archive.org/web/20140307105029/http:/www.royalcopenhagen.com/copenhagen/webapp/news?show=604#)   \nYou can lift elements of of this I think.   \n   \nMaybe the ornaments ought to be furniture or pinetrees or Aurora Borealis-inspired stuff, (the patterns on) Swedish Dalar-horses (ask Stewf, he must have had encounters with them by now. Or any of the Swedes.) Norwegian sweaters could have usable elements too. hmmm, what else is there? Something woody?   \n   \nSpirals. (think viking ornaments here, not that that really defines Scandinavia today.) By the way, Ase-tro (Thor, Odin, Freya and the lot.) has just been accepted as an official religion in Denmark.   \n   \nActually, a Dalar Horse itself would be a great ornament for your typeface.\n\n"
    },
    {
      "time": "11 Nov 2003 — 8:26am",
      "content": "Stewf? what are you? Some sort of chameleon? You already tamed one! And you have even know its real Swedish name!\n\n"
    },
    {
      "time": "11 Nov 2003 — 8:35am",
      "content": "By the way, here's a bit of viking ornament.   \n [http://www.nationalmuseet.dk/sw790.asp](http://web.archive.org/web/20140307105029/http:/www.nationalmuseet.dk/sw790.asp)   \nyou may be directed to something through this:   \n [http://www.fornsidr.dk/links\\_uk.html](http://web.archive.org/web/20140307105029/http:/www.fornsidr.dk/links_uk.html)\n\n"
    },
    {
      "time": "11 Nov 2003 — 8:38am",
      "content": "Gerald,   \n   \n_Arabia. A distinquished Finnish pottery... Unfortunately they closed down their hand painting department since I moved here._   \n   \nSay it ain't so!!!! We've got Arabia's Valencia, which in my opinion is the best of the hand painted stuff (at least for the last 25 years or so). We mix it with Arabia's 24h (we couldn't afford a whole Valencia set). Gerald I think you probably are alluding to some of the patterns with a fruit/floral motif?   \n   \nThese plates make oatmeal look gourmet:   \n ![](http://web.archive.org/web/20140307105029im_/http:/www.typophile.com/forums/messages/30/20265.jpg)   \nOver the top: Expresso cups and saucers:   \n ![](http://web.archive.org/web/20140307105029im_/http:/www.typophile.com/forums/messages/30/20266.jpg)   \n   \nRandy\n\n"
    },
    {
      "time": "11 Nov 2003 — 10:05am",
      "content": "Here's a thought, Rene -- why not do a [Futhark](http://web.archive.org/web/20140307105029/http:/vikja.dk/viking/ukruner.htm) (runic) version of your font? It wouldn't be very useful but it would be a fun addition that would help \"brand\" the font. Plus, it wouldn't be that difficult to do.\n\n"
    },
    {
      "time": "11 Nov 2003 — 10:24am",
      "content": "Wow John, that's a cool idea. I found already some info on the Futhark, but couldn't seem to figure out how it works. Perhaps it's worth the trouble to find it out. Perhaps I can make a cool expert type with it.   \n   \nI found some ornaments that I like from the Vikings. I'm strongly thinking about using the spirals or snake-kind-of ornaments. I'm only not sure if I can really make them to work like a pattern. I would like that they outgrow the only-ornament state, they should also be able to work as a complete background pattern. Any suggestions Gerald?   \n   \nThese images jumped to my attention:   \n   \n ![snakes](http://web.archive.org/web/20140307105029im_/http:/www.typophile.com/forums/messages/30/20288.gif)   \n ![Dragon](http://web.archive.org/web/20140307105029im_/http:/www.typophile.com/forums/messages/30/20289.gif)   \n ![Coins](http://web.archive.org/web/20140307105029im_/http:/www.typophile.com/forums/messages/30/20290.gif)   \n ![Boat](http://web.archive.org/web/20140307105029im_/http:/www.typophile.com/forums/messages/30/20291.gif)   \n ![Golden ring](http://web.archive.org/web/20140307105029im_/http:/www.typophile.com/forums/messages/30/20292.gif)   \n   \nRen\n\n"
    },
    {
      "time": "11 Nov 2003 — 10:45am",
      "content": "Ren\n\n"
    },
    {
      "time": "11 Nov 2003 — 2:50pm",
      "content": "_I found already some info on the Futhark, but couldn't seem to figure out how it works._   \n   \nSee the [Runic code chart](http://web.archive.org/web/20140307105029/http:/www.unicode.org/charts/PDF/U16A0.pdf) at the Unicode site to see what characters you need to add to your font to support Futhark. Unfortunately, the vast majority of books on Runes are occult and New Age bollocks; try to find an academic study. The Omniglot entry for [Runic](http://web.archive.org/web/20140307105029/http:/www.omniglot.com/writing/runic.htm) is quite thorough.\n\n"
    },
    {
      "time": "11 Nov 2003 — 11:39pm",
      "content": "The thing with runes is, that they changed over the years. From about 1150 to 1450, when they went out of use, they mimicked the latin alphabet. (With which it coexisted.) These are called 'stungne runer'.\n\n"
    },
    {
      "time": "12 Nov 2003 — 12:23am",
      "content": "I see much to comment on. Unfortunately I am in a work infested invironment. Don't you wish people would just give you their money and go away?   \n   \nI find it vulgar that they expect you to actually do something.   \n   \nI have found myself an architect that I love, his work I mean. Otherwise it would be a peculiar unpredictable love, he is dead.   \n   \nEliel Saarinen, the most famous of Helsinki's architects. Not to be confused with the work of his more modern son.   \n   \nHas anyone ever visited his house and studio in Finland? Speaking of ornaments!\n\n"
    },
    {
      "time": "12 Nov 2003 — 12:57am",
      "content": "\\>I see much to comment on. Unfortunately I am in a work infested invironment. Don't you wish people would just give you their money and go away?   \n   \nGerald, funny that you speak of that. I have right now a client here and we were just talking about that too. He's a solo artist and has the wish that he gets his monthly payment and then they should leave him alone. He was thinking it would be very nice that that is accompanied by a sentence like: \"thank you for living\", or \"we thank you for working for our company\", or \"here's the money, and now be quiet\".   \n   \nRen\n\n"
    },
    {
      "time": "12 Nov 2003 — 1:29am",
      "content": "I still think you should go for the Dalar horse though.\n\n"
    },
    {
      "time": "12 Nov 2003 — 3:44am",
      "content": "One thing I noticed from John H's Omniglot link -- and had never noticed before, even though it's glaringly obvious in retrospect -- is that Icelandic gets the thorn and eth from Futhark. Now we're way off topic!\n\n"
    },
    {
      "time": "12 Nov 2003 — 4:39am",
      "content": "Randy,   \n   \n I am still in a great rush.   \n   \nI am going to mention your China. That is the same set I began collecting just before Arabia folded up their hand painting department tents.   \n   \nI drink coffee & tea from the same series you have shown. In fact a cup sits at my elbow.   \n   \nYou should invite me over for dinner. I don't steal silverware, but!   \n   \nGerald\n\n"
    },
    {
      "time": "12 Nov 2003 — 7:49am",
      "content": "\\> From about 1150 to 1450, when they went out of use, they mimicked the latin alphabet.   \n   \nKenn, I'd love to get my hands on a good \"before-and-after\" image of this shift - I'd use it in a future presentation (something like \"Latinization, and how to fight it\"). Could you help me out?   \n   \nhhp\n\n"
    },
    {
      "time": "12 Nov 2003 — 8:04am",
      "content": "I scribbled down the latinized runes in my sketchbook at Nationalmuseet, I didn't draw the runes that these evolved from as I was mainly interested in 'the end of runes'. But I'm sure they will help you if you contact them. [http://www.nationalmuseet.dk/sw73.asp](http://web.archive.org/web/20140307105029/http:/www.nationalmuseet.dk/sw73.asp)   \nIf you use the form 'Navn' means 'Name' and 'Emne' is 'Subject.'   \nOr you could simply email them: [fogf@natmus.dk](mailto:fogf@natmus.dk)   \n   \nIt might interest you that after Runes the Danes used romans as uppercase only, fraktur was used for both upper- and lowercase.   \nDuring a short period they may have had all three alphabets.   \nBoy are we off topic...   \n   \nAnd since we are off topic: go find a Finnish cemetery, they rake nice patterns in the gravel on the graves. (the one I visited was in Tornio, customs may be different further south.)\n\n"
    },
    {
      "time": "12 Nov 2003 — 9:35am",
      "content": "Thanks!   \nAnd yes, I remember seeing a photo of a wood-carved Nordic sign (right here on Typophile) that mixed Roman and blackletter.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Nov 2003 — 9:47am",
      "content": "Back to Ren\n\n"
    },
    {
      "time": "12 Nov 2003 — 10:02am",
      "content": "I definitely get a nordic vibe from his font. Sans, large bowls.   \n   \nHrant, did you see John Hudson's link above to the Omniglot site? That site shows something of an evolution of Futhark.\n\n"
    },
    {
      "time": "12 Nov 2003 — 10:13am",
      "content": "I'd only skimmed it - I'll look deeper. Thanks.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Nov 2003 — 10:58am",
      "content": "I guess Gerald ment this:   \n   \n [http://www.nba.fi/MUSEUMS/HVITTR/kuvia.htm](http://web.archive.org/web/20140307105029/http:/www.nba.fi/MUSEUMS/HVITTR/kuvia.htm)   \n   \nArt Nouveau (or Jugend) was very popular in Finland. Here is some illustrations and ornaments by Akseli Gallen-Kallela for Kalevala:   \n   \n [http://www.artpages.com/gallery/agk/index.htm](http://web.archive.org/web/20140307105029/http:/www.artpages.com/gallery/agk/index.htm)   \n   \nBut if you want to keep it strictly scandinavian, I think Norway had also very strong Art Noveau.   \n   \nThe font looks good, and nordic, by the way.\n\n"
    },
    {
      "time": "12 Nov 2003 — 11:20am",
      "content": "\\> [http://www.nba.fi/MUSEUMS/HVITTR/kuvia.htm](http://web.archive.org/web/20140307105029/http:/www.nba.fi/MUSEUMS/HVITTR/kuvia.htm)   \n   \nWow, that Ruokasali is a major party room.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Nov 2003 — 11:43am",
      "content": "The 'Latinisation' of Futhark mainly involved extension and re-ordering of the sign set to match the set of Latin graphemes, so one could write Futhark as a one-to-one transliteration of contemporary spelling. An interesting aspect of this is the addition of dots to create new consonants. All in all, this 'Latinised' Futhark doesn't _look_ very Latin. One could argue that the changes to Futhark kept it alive as part of the culture for 600+ years after it ceased to be used to regularly write a living language.\n\n"
    },
    {
      "time": "13 Nov 2003 — 12:09am",
      "content": "John's right. I re-read my earlier posts and I wasn't specific enough, the 'latinisation' was of the sounds, not the letterforms.   \nFuthark was used to write latin texts too.   \n   \nPart of what kept Futhark alive was also the occult use of runes. It's important that the language didn't die, only the writing system.   \n   \nHrant, the wood carving was in the \"Early Swedish Sans\" thread somewhere.   \n   \nBTW those ear-marks are interesting, has anyone got info on them in English?\n\n"
    },
    {
      "time": "10 Nov 2003 — 1:59pm",
      "content": "Ren\n\n"
    },
    {
      "time": "10 Nov 2003 — 2:30pm",
      "content": "That's a shirt actually, and the backside of a very nice girl I know.\n\n"
    },
    {
      "time": "11 Nov 2003 — 8:20am",
      "content": "Kenn's right! How could I forget about the [dalah](http://web.archive.org/web/20140307105029/http:/images.google.com/images?hl=en&lr=&ie=UTF-8&oe=UTF-8&safe=off&q=dala%2Bhorse&btnG=Google%2BSearch)\n\n"
    }
  ]
}
