{
  "id": "20101",
  "title": "font recommendation for academic texts",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I need some practical advice on recommending a font for academic texts.\n\nI'm giving a workshop to my students on using open source software to write their thesis, in the hope that they will abandon Word, perhaps for OpenOffice, or better yet Lyx. I will introduce basic typographic concepts, but work within practical limits.\n\nAll of the students currently use the default TNR 12pt to set text on a US letter page. I'm wondering what I should recommend that they consider instead. (They won't pay a dime for a font). Palatino? Charter? Lido? Computer modern? The choice should be pragmatic.\n\n",
  "author": "typequake",
  "time": "20 May 2006 — 7:53pm",
  "uid": "10556",
  "comments": [
    {
      "time": "20 May 2006 — 8:02pm",
      "content": "Georgia 11 pt?\n\n"
    },
    {
      "time": "20 May 2006 — 8:25pm",
      "content": "Georgia is underrated, imho. Too bad the small caps are missing.\n\n"
    },
    {
      "time": "21 May 2006 — 3:40am",
      "content": "What is wrong with Times New Roman ?  \nI would rather take care of \"double leadinging\" and the relation between the text box size/position and the page. If it is of any help, this is what expect from my students :  \n [http://www.bilkent.edu.tr/~segalini/essay.html](http://web.archive.org/web/20121213122014/http:/www.bilkent.edu.tr/~segalini/essay.html \"http://www.bilkent.edu.tr/~segalini/essay.html\")\n\n"
    },
    {
      "time": "21 May 2006 — 7:30am",
      "content": "Alessandro,\n\nThanks for the recommendation. Palatino 12 is too large for my own comfort, but I'll submit your style for consideration (the students will be free to choose their own style).\n\nOne shortcoming of all the options discussed so far is the lack of small caps, which I would like to see used for the many acronyms, but none of my students will pay for the small caps (for example, for Charter).\n\n"
    },
    {
      "time": "21 May 2006 — 5:21pm",
      "content": "I really like your idea of introducing them to TeX or one of its variants. But why LyX? A nice editor would help them understand better the philosophy behind TeX. There are some supporting packages on LaTeX to help with the typography [like komascript or memoir]. And few free fonts to choose from [http://www.math.uiuc.edu/~hartke/computer/latex/survey/survey.html](http://web.archive.org/web/20121213122014/http:/www.math.uiuc.edu/~hartke/computer/latex/survey/survey.html \"http://www.math.uiuc.edu/~hartke/computer/latex/survey/survey.html\")\n\nWhat do your students study?\n\n"
    },
    {
      "time": "21 May 2006 — 6:44pm",
      "content": "Thanks, Kon,\n\nThese are grads in the social sciences and they would rather read another book than study LaTex; so Lyx it is (and I'll offer a few preambles to get them started). They will be writing about 300 pages of solid text at 1.5, so they need something more readable than math fonts. I should have mentioned century schoolbook and bookman, too, though.  \nWhich font would you use?\n\n"
    },
    {
      "time": "22 May 2006 — 4:22am",
      "content": "These were not just math fonts. The math font is used when a mathematical formula is needed.\n\nI would use Optima Nova or Palatino(free) and MiKTeX with WinEdt or TeXnicCenter. Also ConTeXt [http://www.pragma-ade.com](http://web.archive.org/web/20121213122014/http:/www.pragma-ade.com/ \"http://www.pragma-ade.com\") could be an option.\n\n"
    },
    {
      "time": "22 May 2006 — 4:09pm",
      "content": "1. Why would you use Optima Nova, and how would you do it without paying?\n\n2. I called them math fonts, because they are not designed to set lengthy texts (non-scientific).\n\n3. It has to be an easy GUI to Latex. WinEdt is not realistic for this group.\n\n"
    },
    {
      "time": "22 May 2006 — 8:53pm",
      "content": "1. Optima Nova is a very elegant and readable font. Yes it is not free! That's why I said about Palatino for free.\n\n2. Well Computer Modern, Palatino, Times New Roman and Garamond are nice for lengthy texts unless the texts are really boring. In that case a really bad font is needed to blame.\n\n3. If you use GUI for LaTeX you miss most of its non-WYSIWYG philosophy.\n\nWhere can I find an example of such a thesis so I can get an idea how much of LaTeX it would need.\n\n"
    },
    {
      "time": "23 May 2006 — 5:07am",
      "content": "Kon,\n\nYou mean well, but I'm gonna have an uphill battle convincing students to give up Word; to get them to \"study Latex just so the thesis will look prettier\" is a lost cause. To persuade students to spend money on fonts when they still have debt belongs in DSM-IV ;-)\n\nAs for the fonts, let's agree to disagree a little here. I don't think CM is a good typeface for humanities or social sciences. URW Garamond I don't appreciate. Times New Roman is too condensed to serve well on letter paper without obscene margins. Palatino is one of my choices, though.\n\nRegards\n\n"
    }
  ]
}
