{
  "id": "20111",
  "title": "Unintended Letters",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "This isn't about \"found type\"\\*. It's about letters that are unwitting results  \nof unrelated acts of design, manufacture, etc. Sort of like the opposite of that  \nrecent study which claims that letters are designed based on other things around us. (I just hope this focus isn't too narrow!)\n\n\\* I would argue there really isn't any such thing anyway.  \nUnless you count tripping over a drawer of Caslon laying  \non the sidewalk.\n\nBesides posting images of such letters, please also discuss how you think such letters can come about. Do people incorporate them subconsciously, secretly, for show, or what? Below are my two contributions - the first is something I found in the street yesterday, the other a photo I once took in Amsterdam (I think you attach boats to it). BTW, if you can think of actual fonts that have forms very close to these or to unintended letters you've seen, that would be interesting too.\n\n ![](http://web.archive.org/web/20131023140322im_/http:/typophile.com/files/hook_s_3681.jpg)\n\n ![](http://web.archive.org/web/20131023140322im_/http:/typophile.com/files/amster_h_5131.jpg)\n\nhhp\n\n",
  "author": "hrant",
  "time": "21 May 2006 — 10:29am",
  "uid": "1250",
  "comments": [
    {
      "time": "21 May 2006 — 11:05am",
      "content": "\"I think you attach boats to it.\"\n\nIf you spend time around boats, especially sailboats, you will see all kinds of things that look like letters, starting with lifebuoys. Off the top of my head, lots of O, D, U, I (the serif kind), J, V, H.\n\nFor example, sail rigging requires objects that are closed (O rings/grommets) and objects that can be closed (eg. D shackles), and that are curved so that they do not cause undue friction on lines (aka ropes) and halyards (steel ropes).\n\n"
    },
    {
      "time": "21 May 2006 — 11:43am",
      "content": "Huh, sounds cool. I actually like maritime analogies in type BTW.  \nAny photos?\n\nhhp\n\n"
    },
    {
      "time": "21 May 2006 — 11:56am",
      "content": "If you do a search on Google or Amazon.com's boating section for, for example, \"D shackle\" or \"D ring\", you'll see plenty of photos.\n\nSounds like you'd have fun poking around at your local ship's chandlery.\n\n"
    },
    {
      "time": "21 May 2006 — 12:03pm",
      "content": "Awesome.\n\nI found a very proper \"D\":  \n [http://www.leathersmithdesigns.com/leather-craft-hardware/d-ring-brass.jpg](http://web.archive.org/web/20131023140322/http:/www.leathersmithdesigns.com/leather-craft-hardware/d-ring-brass.jpg \"http://www.leathersmithdesigns.com/leather-craft-hardware/d-ring-brass.jpg\")\n\nA cool \"Q\":  \n [http://www.davesport.com/davesport/images/items/D\\_shackle\\_small.jpg](http://web.archive.org/web/20131023140322/http:/www.davesport.com/davesport/images/items/D_shackle_small.jpg \"http://www.davesport.com/davesport/images/items/D\\_shackle\\_small.jpg\")\n\nAnd an \"i\" on its side:  \n [http://www.fatboysoffroad.com/images/recovery/11234-01.jpg](http://web.archive.org/web/20131023140322/http:/www.fatboysoffroad.com/images/recovery/11234-01.jpg \"http://www.fatboysoffroad.com/images/recovery/11234-01.jpg\")\n\nhhp\n\n"
    },
    {
      "time": "21 May 2006 — 12:06pm",
      "content": "And a question: when somebody is designing/manufacturing something called a  \n\"D-ring\" (which is called that for obvious reasons, but still) does he perhaps make  \nit even more like a \"D\" than it really needs to be?\n\nhhp\n\n"
    },
    {
      "time": "21 May 2006 — 12:28pm",
      "content": "I sure hope not. A D-ring (as distinct from a D-shackle) is often used at the corners of a sail and they are under major loads.\n\nA passage from The Sailmaker's Apprentice:\n\n\"...there are designs for various corners and specific uses.\n\n\"The simplest D-ring is a straightforward D shape - fine for straps perhaps, but prone to capsize under the torque and oblique strain of sheeting and outhauling when used in the clew of a sail. Consequently, there is a range of D-rings with inner crossbar configurations that provide stability of installation and isolate a shackle or fitting from the material holding the D-ring to the sail.\"\n\nNote the word \"capsize\", which is not something that the average sailor is keen on.\n\nIf you are prepared to qualify your third photo as an \"I\", there is a whole bunch of other gear that will make your list.\n\n"
    },
    {
      "time": "21 May 2006 — 12:37pm",
      "content": "The people who design/engineer/build expensive yachts are not in the business of making fittings like D-rings look \"more like a D than it really needs to be\".\n\nThey are in the business of making boats that are strong and safe, and either fast or comfortable (or a compromise between the two), for the expected conditions.\n\nThere are some yachts, such as America's Cup racing yachts, that push the boundaries, but the designers of these yachts are on the leading edge when it comes to strength of materials and fittings.\n\nIf you check around on Google, you will find D-rings and D-shackles that look quite different from the one in your photo.\n\n"
    },
    {
      "time": "21 May 2006 — 1:44pm",
      "content": "\\> not in the business of making fittings like D-rings  \n\\> look “more like a D than it really needs to be”.\n\nNot even subconsciously? Letters pervade all of our lives after all.\n\nAnd what about people besides those who deal with expensive yachts?\n\n\\> If you check around on Google, you will find D-rings  \n\\> and D-shackles that look quite different from the one  \n\\> in your photo.\n\nI got the first one by entering \"D ring\" in Google and the other two by entering  \n\"D shackle\" in Google. I chose those because they looked most like letters to me.\n\nAnyway, the important thing is that those are images of things that were actually designed/made, and things that were not meant to be letters. Should I really mind if they're not for expensive yachts?\n\nhhp\n\n"
    },
    {
      "time": "21 May 2006 — 1:52pm",
      "content": "BTW, it seems you're a fan of ship design, so I wonder  \nif you've heard of the theory than S Burgess actually  \ndesigned Times! It's a fascinating story (and I myself  \ntend to believe it).\n\nhhp\n\n"
    },
    {
      "time": "21 May 2006 — 4:09pm",
      "content": "Do a google search for +\"starling burgess\" +bluenose.\n\nI have a photograph that the UK marine photographer Frank Beken shot on the deck of the Bluenose just off the Isle of Wight in about 1935. The print was made from the original glass plate, which I was able to see at the Beken shop at Cowes. It is considered to be one of Frank Beken's finest photographs. There is probably an image of it at [www.beken.co.uk](http://web.archive.org/web/20131023140322/http:/www.beken.co.uk/ \"www.beken.co.uk\"). It was quite a trick, at that time, to make a glass plate photo on the deck of a moving ship, and Beken used a specially designed camera, shown on the site.\n\nI've also been on the Bluenose II, a replica built in 1967 and currently undergoing restoration, and she is a truly beautiful ship. Her home port of Lunenberg is a pretty beautiful place itself.\n\nRe your other question:\n\nMy point in mentioning that yachts are expensive is that people don't spend lots of money to build sailing vessels in order to have D-shackles and D-rings that are in the shape of a \"proper D\" for aesthetic rather than functional reasons.\n\nSailing boats in open ocean, during the night and day, and in good weather and bad, is fairly serious business. A few years ago, while I was at the Isle of Wight, a bunch of young men died while sailing between the island and the coast of England, in an area, less than half a mile from shore, that I have sailed myself. Safety/efficiency is the major design and construction priority, which when compromised, as it often is, is compromised for deliberate reasons.\n\nAesthetics is a major issue in boat design, especially hull design, just not at the level of the bits and pieces used for things like rigging. If I am chartering a boat, or crewing on someone else's boat, I might admire the lines of the hull, but the first thing that I do when I get on board is look at the condition of the rigging.\n\n"
    },
    {
      "time": "25 Jun 2006 — 8:07pm",
      "content": "Hey, how much you guys think I can get for this from a Star Wars fanatic?\n\n ![](http://web.archive.org/web/20131023140322im_/http:/typophile.com/files/R2_5415.jpg)\n\nhhp\n\n"
    },
    {
      "time": "26 Jun 2006 — 6:55am",
      "content": "Sorry, I'm being dim \\>Star Wars?  \nTim\n\n"
    },
    {
      "time": "26 Jun 2006 — 6:58am",
      "content": "Tim, Hrant's object in the picture looks like a 2, and there is an \"R\" stamped onto it…\n\nR2D2?\n\n"
    },
    {
      "time": "26 Jun 2006 — 7:08am",
      "content": "Thanks Dan, I thought it was a lower case a. I think the answer to Hrant's question is \"very little\".  \nTim\n\n"
    },
    {
      "time": "26 Jun 2006 — 7:14am",
      "content": "\\> I thought it was a lower case a.\n\nHeyyy - I hadn't realized that.  \nA very French one though.\n\nhhp\n\n"
    },
    {
      "time": "11 Nov 2006 — 7:45pm",
      "content": "When my daughter was two, we were sitting on the steps of our porch. She pointed to the ground and said with a smile \"Five! five!\" I had no idea what she was talking about, until I looked on the ground and saw, sure enough, a long pine needle, bent and broken, that lay on the ground in a perfect 5 shape.\n\nI think it's relevant that some of her favorite Sesame Street videos featured letters and numbers out in fields, on swings, walking down the street, etc. To some extent, those videos helped teach her what to expect in the world. I would overlook that pine needle 999 times out of 1000; the other time, I would marvel at the remarkable coincidence. But my daughter simply noted it as one of the happy letters that one should simply expect to find in our surroundings.\n\n"
    }
  ]
}
