{
  "id": "20127",
  "title": "Lisboa OSF as a web font?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am thinking of replace a Myriad font with Lisboa OSF on a website.  \nHow do you think Lisboa's performance would be on a website?\n\nIs it even worth it? Will the attention to a more flavorful font be noticeable??\n\nInterested in any opinions. :-)\n\nAlso, I've noticed that at small sizes, the Uppercase \"R\" is shorter than other letters... why is this so?\n\n",
  "author": "wnf",
  "time": "21 May 2006 — 4:55pm",
  "uid": "12771",
  "comments": [
    {
      "time": "21 May 2006 — 8:01pm",
      "content": "This is due to [hinting](http://web.archive.org/web/20141128021423/http:/typophile.com/wiki/hinting) or the font's lack thereof. At small sizes most fonts will get wonky on screen. Only those with superior hinting will do well without specially designed bitmaps.\n\n"
    },
    {
      "time": "21 May 2006 — 8:20pm",
      "content": "Stephen... man you know your typography.  \n(So, maybe you will give me some further \"hints.\" ;-)\n\nAny help as to a font to replace Myriad on a website that may have some flavoring would be very welcome.\n\nThanks  \nwnf\n\n"
    },
    {
      "time": "21 May 2006 — 10:46pm",
      "content": "How large? I highly recommend sticking with HTML text for anything under 18pt. Lisboa will work just fine as a GIF at 18+.\n\n"
    },
    {
      "time": "21 May 2006 — 11:35pm",
      "content": "This is good advice.\n\nTrying to get typography to size properly across browsers and systems is a task even with great css.... hence, my try at a small gif or jpeg for 16pt type.\n\nI think youve made a good point... thanks!\n\n"
    },
    {
      "time": "22 May 2006 — 12:20am",
      "content": "To help you I've put up two gif's of Lisboa in different sizes and with different anti-alias renderings:\n\n[Lisboa dark grey on white](http://web.archive.org/web/20141128021423/http:/fountain.nu/lisboa_webdisplay.gif)  \n [Lisboa light grey on black](http://web.archive.org/web/20141128021423/http:/fountain.nu/lisboa_webdisplay_inverted.gif)\n\n"
    },
    {
      "time": "22 May 2006 — 12:41am",
      "content": "Peter, both links are pointing to the same image.\n\n"
    },
    {
      "time": "22 May 2006 — 1:27am",
      "content": "I'm impressed. 14pt. Crisp or Smooth in all weights is not bad at all. What method were you using to make the GIFs, wnf?\n\n[http://www.fontshop.com/fontfeed/archives/how\\_to\\_make\\_gif.cfm](http://web.archive.org/web/20141128021423/http:/www.fontshop.com/fontfeed/archives/how_to_make_gif.cfm \"http://www.fontshop.com/fontfeed/archives/how\\_to\\_make\\_gif.cfm\")\n\n"
    },
    {
      "time": "22 May 2006 — 7:02am",
      "content": "Somebody said crisp small onscreen type?  \n [http://www.themicrofoundry.com/manademo/](http://web.archive.org/web/20141128021423/http:/www.themicrofoundry.com/manademo/ \"http://www.themicrofoundry.com/manademo/\")\n\nhhp\n\n"
    },
    {
      "time": "22 May 2006 — 1:05pm",
      "content": "Yes, Mana is nice. Am I the only one distracted by the 'r'? How about an alternate at least, Hranter?\n\n"
    },
    {
      "time": "22 May 2006 — 1:31pm",
      "content": "\\> _Am I the only one distracted by the ‘r’?_\n\nNo.  \nAm I the only one distracted by the ‘M’, 'O' and 'W'?\n\n"
    },
    {
      "time": "22 May 2006 — 2:20pm",
      "content": "Everybody knows type people can't read anyway. ;-)\n\nSeriously, it's hard to know whether given distractions on the part of \"involved\" people come from a good place. I'm not saying there are No Problems (I'm sure there are) but when Berlow claims the open-bottom bino \"g\" is a clown, and I'm sure it's not, what am I supposed to think?\n\nMiguel, I know Stephen's problem with the \"r\" (and he's not alone) but I wonder exactly what distracts you in the \"M\", \"O\" and \"W\" (and in which sizes/weights)?\n\nhhp\n\n"
    },
    {
      "time": "22 May 2006 — 2:22pm",
      "content": "Miguel wrote: <cite>Peter, both links are pointing to the same image.</cite>\n\nah sorry:\n\n[Lisboa dark grey on white](http://web.archive.org/web/20141128021423/http:/fountain.nu/lisboa_webdisplay.gif)  \n [Lisboa light grey on black](http://web.archive.org/web/20141128021423/http:/fountain.nu/lisboa_webdisplay_inverted.gif)\n\n"
    },
    {
      "time": "22 May 2006 — 2:25pm",
      "content": "Stephen wrote: <cite>I’m impressed. 14pt. Crisp or Smooth in all weights is not bad at all. What method were you using to make the GIFs, wnf?</cite>\n\nJust picking differentt anti-alais and the save for web - GIF 256 colors  \nYou could go a bit lower on the colors.\n\n"
    },
    {
      "time": "22 May 2006 — 2:38pm",
      "content": "Peter, 16 shades (per hue) is almost always enough.\n\nhhp\n\n"
    },
    {
      "time": "22 May 2006 — 4:05pm",
      "content": "Actually, Peter, I was asking wnf (the original poster) what his settings were since he found it unsatisfactory.\n\n"
    },
    {
      "time": "22 May 2006 — 5:22pm",
      "content": "\\> _Miguel, I know Stephen’s problem with the “r” (and he’s not alone) but I wonder exactly what distracts you in the “M”, “O” and “W” (and in which sizes/weights)?_\n\nIn reverse order of (alphabetic) appearance, the Ugly, the Wide and the Widest :^)\n\n"
    },
    {
      "time": "22 May 2006 — 6:18pm",
      "content": "Well, I'm not sure exactly what you're saying about which. I do realize the \"M\" is wide in every size/weight, but in a bitmap font it's not always possible to make symmetrical letters an ideal width, especially if you want to keep certainly corners sharp (one pixel). Also in bitmap fonts you have to mind the relationships of the various sizes, and you have to \"snap\" the glyphs in larger sizes to the wider possibility so you leave yourself enough room in the smaller sizes. You'll notice how some letters (like the \"T\") have quite different proportions across the sizes.\n\nThe sacrifices in a bitmap font can be strenuous and befuddling.  \nLook at the \"v\" in 16 PPEM Georgia!\n\nhhp\n\n"
    },
    {
      "time": "22 May 2006 — 9:34pm",
      "content": "Hi Stephen\n\nI had to catch up to this runaway thread.\n\nYou typo folks are really outstanding... almost complete mastery of all things type oriented.  \n(I am learning a great deal... perhaps too much for my own good ;-)  \nSelecting and implimenting adventuresome/complimentary fonts can be time consuming.  \nMaddening. Yup, that too!\n\nAnyway, for my proposed treatment of the Lisboa OSF... I was planning to just use it in a gif for subtitles and small heads as a gif from Imageready (256) standard.\n\nThx\n\nwnf\n\n"
    }
  ]
}
