{
  "id": "2014",
  "title": "Old school fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "if someone wants to develop a font froma type spec they find in an old book, by someone who is dead, how do they go about it in the right way?   \n   \nThanks   \n   \nJIM   \n===\n\n",
  "author": "union",
  "time": "Mon, 2003-11-10 17:00",
  "uid": "614",
  "comments": [
    {
      "time": " Mon, 2003-11-10 18:12",
      "content": "Jim, I would guess you could contact the estate of the dead designer for permission and if its old enough it might be in public domain, but I'm from the US and the laws might be different in different countries. Dan\n\n"
    },
    {
      "time": " Mon, 2003-11-10 18:23",
      "content": "In the US, only the software that holds the actual font data is protected by copyright, not the font design itself. According to the copyright office, typefaces (because they are the alphabet) are always in the public domain. So, while it is a nice show to contact the estate, it is wholely unnecessary. However, outside the US, there may be copyright protection that would need to be dealt with.\n\n"
    },
    {
      "time": " Mon, 2003-11-10 18:54",
      "content": "Jim,   \n   \nThere are two questions: what's legal, and what's ethical.   \n   \nFor the legal part, you should consult a lawyer. I am not a lawyer. However, I will point out that in the US, fonts may be protected by design patent (rare, and expires after a couple of decades), by copyright on the font software, and by trademark of the font name.   \n   \nIn your case, if the font is old enough to avoid design patent lifetime, you're digitizing it yourself from printed samples, and you don't use the original name, then one might think you'd be legally safe.   \n   \nPersonally, on an ethical basis, I would find it necessary to investigate whether anybody is a legitimate successor to the original typeface. In all likelihood, such a legitimate successor would also own the trademark. If the trademark has lapsed, and the font is not currently available in digital form from anybody who has any direct line of claim from the original, then I'd consider it. All this assuming there were no legal issues.   \n   \nRegards,   \n   \nT\n\n"
    }
  ]
}
