{
  "id": "20142",
  "title": "Norwegian Typography",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi there.\n\nI'm currently working on my final major project at uni. The aim is to express norwegian values through a typeface. I was hoping that you guys, could help me out in the initial stage. As i guess there is not many norwegians here, although some might be familiar with my country, i would appreciate if you know about other similar project, good books, links on the internet, or just thoughts and comments about how i should get started.\n\nI have been looking into swiss typography and i know there is a obvious link. Also german blackletters inspired norwegian typography in the early days.\n\nHope you can help me out in some way.\n\nthx.\n\nhenrik fjeldberg\n\n",
  "author": "<a href=\"/web/20111228164426/http://typophile.com/user/13020\" title=\"View user profile.\">reyo</a>",
  "time": "<br>",
  "uid": "13020",
  "comments": [
    {
      "time": "",
      "content": "This **[link](http://web.archive.org/web/20111228164426/http:/cg.scs.carleton.ca/~luc/norway.html)** may be of help if you haven't got it already. :^)\n\n"
    },
    {
      "time": "",
      "content": "Except for the modern links above, you might have found a slim topic. I grew up around Norwegian-Americans but none of them designed fonts. Even a Norwegian type designer is going to be challenged to single out (cultural?) \"values\" that can be translated into a unique typeface. Besides this, most typefaces are designed to express something in a particular kind of document, or something slightly less broad than a national \"something\". Even if one were trying to compose an exclusively \"Norwegian-looking\" document of some kind, one would need to travel back to a time before the Latin alphabet was use in order to be clear of Sweden, Denmark, or Spiekermann.\n\nNow in Boston, we have a single letter, a \"B\", in a specific font, that sums the whole culture up. NY, being twice as mouthy and not nearly as discerning, needs two letters and the font doesn't matter. Most other places, Seattle, the Bahamas or Milwaukee, e.g. have nothing much to show for themselves typographically.\n\n"
    },
    {
      "time": "",
      "content": "Bahamas does have a nice logo though  \n [http://www.bahamas.com/bahamas/filenotfound.aspx?code=404](http://web.archive.org/web/20111228164426/http:/www.bahamas.com/bahamas/filenotfound.aspx?code=404 \"http://www.bahamas.com/bahamas/filenotfound.aspx?code=404\")\n\nDo you have a list of values that you think apply to Norway?  \n(sorry I do know some Swedes, Finns and Danes but no Norwegians)  \nTim\n\n"
    },
    {
      "time": "",
      "content": "_Now in Boston, we have a single letter, a “B”, in a specific font, that sums the whole culture up_ — do you have an image of this all encompassing “B”?\n\nSounds interesting.\n\n"
    },
    {
      "time": "",
      "content": "everybody who is interested in typography (or logotype,illustration,graphic design)\n\n[www.zeixs.com](http://web.archive.org/web/20111228164426/http:/www.zeixs.com/ \"www.zeixs.com\")\n\nit´s a new project for designers.\n\n"
    },
    {
      "time": "",
      "content": "Back in December 2004 I posted this link on my news page\n\nAeroportal, Norway’s official font  \nnorway.org - 10 December 2004  \nNorway unveils its latest export, Aeorportal developed by APT Designs.\n\nThe link is dead now but might be worth MSNSearching on the font name\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "\"— do you have an image of this all encompassing “B”?\"\n\nNo...but there's one on every Red Sox Hat...\n\n"
    },
    {
      "time": "",
      "content": "I see — not quite what I’d imagined.\n\n"
    },
    {
      "time": "",
      "content": "Henrik,\n\nPerhaps you could focus some of your research on how Norway has used design to project a national image to an international audience.\n\nThis would include the Norwegian tourist authority and, obviously, the design work done for the Lillehammer Olympics.\n\nIt might be interesting to speak with some of the people involved in these campaigns, because they had to deal with the very issue in which you are interested, although embracing issues beyond typography.\n\nAs a balance, it might be usefull to look at trends in Norwegian art, writing, music and film, as they relate to popular culture.\n\nThis idea that a particular culture can be captured in type is interesting. I believe that there is some truth to it, but that it is an elusive idea among countries that share a common cultural heritage.\n\nI assume that you have seen Kitchen Stories, which would be an interesting, and amusing, point of embarkation for a project like this if you want to be whimsical.\n\nGood luck.\n\n"
    },
    {
      "time": "",
      "content": "Have you considered Norse runic style lettering? Perhaps that is too hackneyed, but it is the first thought that came to my mind.\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20111228164426im_/http:/typophile.com/files/1108648975_6576.jpg)\n\n"
    }
  ]
}
