{
  "id": "20159",
  "title": "how do i download fonts and use them in word?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "how do i add a font to word after i download from the net. that way i can use the font when i want to type something\n\n",
  "author": "stevenswift45",
  "time": "22 May 2006 — 7:40pm",
  "uid": "12997",
  "comments": [
    {
      "time": "22 May 2006 — 8:02pm",
      "content": "If it is a PC, the font should be in the Windows/fonts folder in windows explorer. If there is a way to get it there besides draggin it, it is lost in the recesses of my morass...I mean mind.\n\nI'm guessing from the question that you don't have a font installing program, so I am dredging this info up from long, long, ago. So I could be wrong.\n\nMany people who use a lot of fonts, have a program like Typograf, ATM, Suitcase, etc. Something free from Linotype is popular with the Mac people.\n\n"
    },
    {
      "time": "22 May 2006 — 8:04pm",
      "content": "Well, that is an interesting question to ask here. Most often fonts downloaded from the internet are illegal copies or of obviously bad quality. Both are frowned upon here.\n\nBut if you want to know, as always, JFGI (just f\\*\\*\\*ing google it).  \n [http://simplythebest.net/fonts/how\\_to\\_install\\_fonts.html](http://web.archive.org/web/20130819040733/http:/simplythebest.net/fonts/how_to_install_fonts.html \"http://simplythebest.net/fonts/how\\_to\\_install\\_fonts.html\")  \nor  \n [http://support.microsoft.com/kb/314960/](http://web.archive.org/web/20130819040733/http:/support.microsoft.com/kb/314960/ \"http://support.microsoft.com/kb/314960/\")  \nor  \njust copy and paste the file into C:\\Windows\\Fonts.\n\nIt will automatically appear in any windows program, after you restart the program.\n\nI am assuming you are using a windows OS.\n\n"
    },
    {
      "time": "22 May 2006 — 8:56pm",
      "content": "_Most often fonts downloaded from the internet are illegal copies or of obviously bad quality_\n\nThat's a rash conclusion. Most _purchased_ fonts are also downloaded these days.\n\n"
    },
    {
      "time": "22 May 2006 — 9:58pm",
      "content": "With such a newbie question, I can see why it would be easy to assume something like that. I didn't know there was an ethics issue until someone politely explained it in a.b.f.\n\nI wish I knew who that was, because he was sort of a font saint, compared to the reactions of others whose bitterness seems to have poisoned their spirits.\n\nKind of like how movies sometimes justify cheating on your wife by showing what a jerk she is, those people make it easy to justify snagging commercial fonts (if that's the kinds of jerks that make them).\n\nBack to the movies for a second, they didn't bother with the justification in Fatal Attraction, and that was when Ann Archer was at her prime. I was so pissed at Michael Douglas (Glenn Close?) that I had to leave the theatre when I saw where it was going.\n\nSame thing with the latest Woodie Allen movie. I didn't care what happened to that self-absorbed moron. When I saw where that one was going I had better things to do.\n\nExcuse the derail, but this thread was as good a one to sidetrack on as I am bound to see.  \n; )\n\n"
    },
    {
      "time": "22 May 2006 — 11:47pm",
      "content": "Just DL the font, then go to start\\>control panel\\>fonts\\>file\\>install new fonts\\>find where you DL'ed the font too and select it\\>install and it'll show up in word np. You also might have to unzip the font perhaps first.\n\n"
    }
  ]
}
