{
  "id": "20161",
  "title": "Fonts that resemble Klim's feijoa?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Which (other) fonts resemble [feijoa](http://web.archive.org/web/20150326031229/http:/typophile.com/wiki/feijoa) the most? It seems to be an especially legible and charming font.\n\n[http://www.klim.co.nz/content/type/feijoa\\_01.html](http://web.archive.org/web/20150326031229/http:/www.klim.co.nz/content/type/feijoa_01.html \"http://www.klim.co.nz/content/type/feijoa\\_01.html\")\n\n",
  "author": "Palatine",
  "time": "22 May 2006 — 10:09pm",
  "uid": "9249",
  "comments": [
    {
      "time": "22 May 2006 — 10:14pm",
      "content": "Which one do you mean?\n\n"
    },
    {
      "time": "23 May 2006 — 5:08am",
      "content": "There's some Gerard Unger flavour in there -- check DTL Paradox, Coranto and the likes.\n\n"
    },
    {
      "time": "23 May 2006 — 5:53am",
      "content": "And some Poppl too.  \nBut really, Kris's stuff is pretty inimitable.\n\nhhp\n\n"
    },
    {
      "time": "23 May 2006 — 7:53am",
      "content": "Kris is trying to get his out the door. I hope you can just use his. Have you contacted him about it?\n\nChrisL\n\n"
    },
    {
      "time": "23 May 2006 — 7:59pm",
      "content": "If you can wait, it will be ready in about a month, hopefully sooner!\n\n—K\n\n"
    },
    {
      "time": "24 May 2006 — 4:08pm",
      "content": "It's a lovely font, and I will certainly purchase it when it's released.\n\nBravo!\n\nAny info on pricing (if I may be so bold to ask) and cuts/weights?\n\n"
    },
    {
      "time": "24 May 2006 — 4:25pm",
      "content": "[KLIM](http://web.archive.org/web/20150326031229/http:/typophile.com/wiki/KLIM) will be distributed by village ( [www.vllg.com](http://web.archive.org/web/20150326031229/http:/www.vllg.com/ \"www.vllg.com\")) which has a price range from $39-$60 for a single weight. I'd expect the price to fall within that range. As for weights, I have no guess.\n\n"
    },
    {
      "time": "24 May 2006 — 9:01pm",
      "content": "It will have Roman, Italic, Small Caps, Bold & Display cuts. All will have nice OT character sets, the language support that we all like to have and pretty little ligatures to spice things up a tad. So nothing too large, it is only my first one, and I don't want to go overboard. Keep it manageable, y'know?\n\n—K\n\n ![](http://web.archive.org/web/20150326031229im_/http:/typophile.com/files/Feijoa_6714.png)\n\n"
    },
    {
      "time": "25 May 2006 — 7:14am",
      "content": "How about Thirsty Metaxa in Basil? :-)\n\nChrisL\n\nPS: It lokks graet Kris, I am glad you didn't let it die withn you :-)\n\n"
    },
    {
      "time": "25 May 2006 — 8:02am",
      "content": "Those are some of the most elegant ligatures I've seen. You are quite the curve wrangler. Yum!\n\n"
    },
    {
      "time": "25 May 2006 — 12:55pm",
      "content": "No bold italic? As a publication designer, that can be a deal-breaker for me.\n\n"
    },
    {
      "time": "29 May 2006 — 12:44am",
      "content": "\"No bold italic? As a publication designer, that can be a deal-breaker for me.\"\n\nI understand. At this stage, I am just dipping my toes in. If all goes well, then I will happily expand the range if needed!\n\n—K\n\n"
    },
    {
      "time": "29 May 2006 — 12:35pm",
      "content": "You are doing the right thing Kris. Get it out there show the world your stuff. Your first release does not cut off develpment of more styles. I will be looking forward to being a customer.\n\nChrisL\n\n"
    },
    {
      "time": "11 Jun 2006 — 7:50pm",
      "content": "Kia Ora, Kris. Every time I think of New Zealand I think of racing yachts - those amazing \"Kiwis\" in that famous Defender's Cup black boat, Black Magic, NZL 32. Undefeated in competition. I always found that sport fascinating. I have a bit of education in that area: White Sail 3 certification. Nothing stellar, but give me a bathtub with a sail and I think I can make it to shore alright.\n\nAnyway, I see that Feijoa is nearly complete - 91%, apparently. I eagerly await this gem. Are there any sample pdfs to tide us over until the release?\n\n"
    },
    {
      "time": "12 Jun 2006 — 12:22pm",
      "content": "Hmm, looking forward to that. Gorgeous.\n\n"
    },
    {
      "time": "13 Jun 2006 — 8:25pm",
      "content": "\"Are there any sample pdfs to tide us over until the release?\"\n\nSorry mate, not just yet. I am too close to finishing to make any PDF's, if that makes any sense…\n\n—K\n\n"
    },
    {
      "time": "14 Jun 2006 — 4:22am",
      "content": "It makes sense to me :-)\n\nChrisL\n\n"
    },
    {
      "time": "18 Jul 2006 — 5:39pm",
      "content": "So how is this gem coming along? Projected release date?\n\n"
    },
    {
      "time": "18 Jul 2006 — 6:16pm",
      "content": "Well, according to vllg, it's still \" [on the horizon](http://web.archive.org/web/20150326031229/http:/typophile.com/node/21324).\"\n\n"
    },
    {
      "time": "18 Jul 2006 — 6:25pm",
      "content": "On Kris' updated site, it states it's \"about 91% finished and should be ready for release by mid–late 2006\". ;^)\n\n"
    },
    {
      "time": "18 Jul 2006 — 10:08pm",
      "content": "Hopefully by the end of the month…\n\n—K\n\n"
    },
    {
      "time": "18 Jul 2006 — 10:19pm",
      "content": " ![](http://web.archive.org/web/20150326031229im_/http:/typophile.com/files/Feijoa_Czech_5140.png)\n\n"
    },
    {
      "time": "18 Jul 2006 — 10:25pm",
      "content": " ![](http://web.archive.org/web/20150326031229im_/http:/typophile.com/files/Feijoa_01_4171.png)\n\n ![](http://web.archive.org/web/20150326031229im_/http:/typophile.com/files/feijoa_02_5842.png)\n\n"
    },
    {
      "time": "18 Jul 2006 — 10:26pm",
      "content": "A few language tests…\n\n"
    },
    {
      "time": "18 Jul 2006 — 10:42pm",
      "content": "That lowercase \"b\" is quite an achievement. Very nice touch. And the i-n ligature is interesting. I think you pulled that off rather well. One doesn't see that sort of ligature very often.\n\nThese previews look great, but the short passage of text you have on your site looks fantastic.\n\n"
    },
    {
      "time": "18 Jul 2006 — 11:14pm",
      "content": "Kris,\n\nI love this, and I eagerly anticipate its release. For that matter I'm dying for Salamanca, and Zinc looks worth focusing on as well. I know it's a juggle.\n\nPlease consider making all these ligatures available only on a discretionary basis. Some of them seem frankly gratuitous, and they would very much hinder extended reading. Especially in languages where lots of accents are present, they could really distract.\n\nIn that context, I do not think the unjoined b or q will be strong enough. Is there a reason not to join them, considering all the other shapes? They jar me. The serif version of Salamanca (it is coming, yes?...) might be the place for such experiments. Otherwise this has such nice color and a comfortable feel for reading. Don't stop!\n\n"
    },
    {
      "time": "19 Jul 2006 — 12:49am",
      "content": "Yo,\n\nThese are totally going to be discretionary & stylistic ligs—I was trying out uncommon combinations, and it seems to be working. Don't actually know if people will use them ,but it amuses me nevertheless! Only a madman would put them in as defaults. There is a very good reason for the b & q: I like it like that. Perhaps I could include joined versions as calts…\n\n—K\n\n"
    },
    {
      "time": "19 Jul 2006 — 4:58am",
      "content": "Friggin fabulous Kris!\n\nChrisL\n\n"
    },
    {
      "time": "19 Jul 2006 — 10:27am",
      "content": "\"There is a very good reason for the b & q: I like it like that.\"\n\nI assume you're joking. Such talk angers the gods.\n\n"
    },
    {
      "time": "19 Jul 2006 — 10:37am",
      "content": "I rather like the b and q open just as they are--then again, I am just a mortal.\n\nChrisL\n\n"
    },
    {
      "time": "19 Jul 2006 — 12:26pm",
      "content": "I am fine with the b p, but something is weird about the screen display of the smaller type of your 10:35 posting, at least on my screen. At times the u looks wider than the n and at others the n looks wider, and it generally dazzles in not a good way. The display on your web site is fine, as Palatine says.\n\n"
    },
    {
      "time": "19 Jul 2006 — 1:11pm",
      "content": "\\> Is there a reason not to join them\n\nDude, don't be such a Modernist.\n\nhhp\n\n"
    },
    {
      "time": "19 Jul 2006 — 2:01pm",
      "content": "Bill: don't worry mate, they are the correct size in vector. This is just a quick screen-grab from the InDesign.\n\nCarl: it was actually the gods that suggested that I keep them open, so even talking about closing them will incur the wrath of the heavens. Best we don't speak about it…\n\n—K\n\n"
    },
    {
      "time": "19 Jul 2006 — 2:12pm",
      "content": "\"Dude, don’t be such a Modernist.\"\n\nNope, just looking at the visual scratchiness those areas create, which I think interrupts the smooth and comfortable feel elsewhere. They remind me of letterpress type with scratches and nicks.\n\nHrant, I'm surprised at you; you're always going on about removing yourself from type design and working to serve the reader.\n\n"
    },
    {
      "time": "19 Jul 2006 — 2:18pm",
      "content": "\"...the gods that suggested that I keep them open\"\n\nYou mean she talks to you too? :-)\n\nChrisL\n\n"
    },
    {
      "time": "19 Jul 2006 — 2:40pm",
      "content": "Carl, it's more accurate to say that I always go on about <cite><strong>trying</strong> to tame oneself</cite> ; and adding that I also always go on about the limits (not least in terms of benefits to the reader) of formal aesthetic control. The b/d/p/q for example want to be the same largely in the same way that teenage girls generally want to be same; which only really benefits people trying to sell ]to[ them.\n\nhhp\n\n"
    },
    {
      "time": "19 Jul 2006 — 5:08pm",
      "content": "If you think that is my concern is that vapid, you simply do not see what I see.\n\n"
    },
    {
      "time": "19 Jul 2006 — 5:35pm",
      "content": "No, I just think it has trace amounts of vapidity,  \ndue to external socioprofessional conditioning. :-)  \nAnd I have some of that too you know.\n\nhhp\n\n"
    },
    {
      "time": "19 Jul 2006 — 5:54pm",
      "content": "Carl, I share your concern, but I don't experience the visual interruption you do. To me it is like the open loop on the Baskerville g: a stylistic variation that doesn't intrude. Do you think that, for example, the open b in Fedra and Fedra Sans also hurts those faces?\n\n"
    },
    {
      "time": "19 Jul 2006 — 6:47pm",
      "content": "It looks beautiful from this view: [http://www.klim.co.nz/content/type/feijoa\\_01.html](http://web.archive.org/web/20150326031229/http:/www.klim.co.nz/content/type/feijoa_01.html \"http://www.klim.co.nz/content/type/feijoa\\_01.html\")\n\nI'm sure it'll function very nicely on paper.\n\n"
    },
    {
      "time": "19 Jul 2006 — 8:42pm",
      "content": "William,\n\nI think Fedra Serif is a suitable environment for the variations that you mention, considering the other gaps, stub terminals, angles, and general eclecticism there. The b fits, in other words. In the sans, I do not think it fits.\n\nKris may have more to say about this, since we only exchanged quips, but the reason he cited (\"I like it like that\") sounds to me like he is attached to those gaps for no functional reason, and has not tried eliminating them yet. It might be that adding more gaps would somehow make these 2 fit. They could be all over: 4 6 8 9 0 A B D H K P Q R U a d e g k p, and that would change the design a lot. but given the way the design is working now (and it is working beautifully) they don't fit; they are the lone elements that interrupt the flow of reading in such an otherwise subtle and pleasing typeface; the soft bracketing, rich color, fluid curves, excellent spacing, and the other bowls which resolve differently all work on such a different, more subliminal level, that by contrast these 2 gaps look affected and showy. I invite Kris to try:\n\nPut more unjoined bowls in the design throughout (though leave i-ligatures off while testing),\n\nor\n\nclose these 2, and examine dispassionately whether anything of value is lost, or if something else happens. Is it really important they be there; do they contribute anything?\n\nor\n\nTurn the unjoined strokes in more, to match the flow of the strokes in the bowls of d and p.\n\nKris' design has so many strengths, and one way for typefaces to be resolved fully is for the designer to try many things, letting go of favorite elements, and as someone else put it here recently, let it become itself. Because of the many unnecessary (confusing? gratuitous?) i-ligatures, and because of Kris' stated reason for keeping these cuts, I had to at least suggest he try losing them.\n\n"
    },
    {
      "time": "20 Jul 2006 — 6:08am",
      "content": "For me, showy ligatures look horribly out of place and distracting within text. So, Carl, I share your distaste for Kris' i ligatures, at least in the sample usage. But since they are discressionary, I don't think it matters.\n\nYour observation on Fedra sans vs serif is interesting. Bil'ak did a 'Fedra sans alt' replacing the more unusual characters, including the open b. I wonder if that was partly a response to requests from customers--which would tend to confirm your view.\n\n"
    },
    {
      "time": "22 Jul 2006 — 4:25am",
      "content": "This typeface and the design of the ligatures Klim are fantastic.\n\nWhile I am no way near a typograher, and I understand that the overuse of ligatures can distort readability, I still find these visually charming.\n\nI am a sucker for using ligatures. Well done.\n\n"
    },
    {
      "time": "22 Jul 2006 — 10:02am",
      "content": "KLIM takes a ligging and keeps on tigging :-)  \nI think it is quite refreshing and, since it is discretionary, totally harmless.\n\nChrisL\n\n"
    },
    {
      "time": "24 Jul 2006 — 1:43pm",
      "content": "\"Kris may have more to say about this, since we only exchanged quips, but the reason he cited (“I like it like that”) sounds to me like he is attached to those gaps for no functional reason, and has not tried eliminating them yet.\"\n\nOf course I haven't tried eliminating them, I see absolutely no problem with them. I read text set in type that has similar forms without trouble, I read text set in Feijoa without trouble! If they upset you then that is a shame. At this stage I am not going to change it. If there is overwhelming feedback that supports your concern, then I will consider changing the forms.\n\n\"The designer has to try many things, letting go of favourite elements.\"\n\nI have tried many things, I have let go of favourite elements. But erasing every little quirk or detail I like that may not be deemed purely functional will render the typeface dull & overworked. I have already spent far too long on this already. I cannot help that I want parts of me in there, parts that I like, for designing type gives me great pleasure. I cannot work dispassionately, that would kill the buzz, especially when it is an uncommissioned typeface.\n\nI suppose the function in these forms is to give me pleasure.\n\n\"Who would say that pleasure is not useful?\"  \n—Charles Eames.\n\nThis is an interesting discussion. Here are some other forms that are 'unjoined':\n\n ![](http://web.archive.org/web/20150326031229im_/http:/typophile.com/files/Feijoa_open_4792.png)\n\n"
    },
    {
      "time": "24 Jul 2006 — 2:56pm",
      "content": "The spine of the \"8\" seems slightly too stiff.\n\nhhp\n\n"
    },
    {
      "time": "24 Jul 2006 — 2:56pm",
      "content": "Kris, stick to your guns with this one. It is a fine face as is and needs to be out on the market. The world needs more type that pushes the envelope. We have plenty of classic go-by-the-rules broadly accepted faces out there already. It is one thing to respect the classic successes of the past; it is another to cringe in awe and fear of them. Make your own fonts; make your own pleasure. Be who you are proudly.  \nThere are some people who only like their old sweater because they know from years of wear that it suits them and makes them comfy. There are plenty of other folks who would just love to have a new sweater to try on, break in, and grow to feel comfy in as well.\n\nGo for it kris!\n\nChrisL\n\n"
    },
    {
      "time": "24 Jul 2006 — 2:59pm",
      "content": "\\> The world needs more type that pushes the envelope.\n\nAgreed 100%. But some envelopes are better than others.  \nFor a text face, a proper grasp and valuation of reading is  \nmuch more useful (or at least less banal) than that of style.\n\nhhp\n\n"
    },
    {
      "time": "24 Jul 2006 — 3:17pm",
      "content": "I am not talking about style and I think this text face has a very firm grasp on the valuation of reading. It is also a damn fine envelope.\n\nChrisL\n\n"
    },
    {
      "time": "24 Jul 2006 — 3:19pm",
      "content": "Klim is gorgeous, but I recently had a typeface where I had to do a lot of loop jumping to not use the st and ct ligs. I decided that I wouldn't use that typeface again unless I wanted the ligs. I would hope you, Kris, wouldn't remove the quirks, but would allow those of us who are interested in licensing your typeface the option of turning them off.\n\n"
    }
  ]
}
