{
  "id": "20160",
  "title": "can some one create one for me",
  "forum": "Design",
  "tags": [

  ],
  "content": "can any one here create me a really cool design for “Dratakis” its my bands name were looking for like a 80s metal look if you know what i mean. we want it to be pretty simple but look really good like how metallica is . all tehre letters are plain but the m and a really set it off.\n\n [‹ TYPE BATTLE: Week 12 (22 May)](http://web.archive.org/web/20080827234434/http:/www.typophile.com/battle12 \"Go to previous forum topic\") [Looking for a Text family 4 a print musik mag ›](http://web.archive.org/web/20080827234434/http:/www.typophile.com/node/20230 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080827234434/http://www.typophile.com/user/12997\" title=\"View user profile.\">stevenswift45</a>",
  "time": "<br>",
  "uid": "12997",
  "comments": [
    {
      "time": " 22.May.2006 8.31pm",
      "content": "You’ll have to at least barter something.\n\nhhp\n\n"
    },
    {
      "time": " 22.May.2006 8.36pm",
      "content": "A free copy of the debut album will probably do. IYKWIM.\n\n"
    },
    {
      "time": " 22.May.2006 8.47pm",
      "content": "alright bro\n\n"
    },
    {
      "time": " 22.May.2006 10.18pm",
      "content": " ![](http://web.archive.org/web/20080827234434im_/http:/www.typophile.com/files/Drtks_4940.jpg)\n\n"
    },
    {
      "time": " 23.May.2006 1.38am",
      "content": "Is this a contest (Halleluja!) or do you also intend to pay someone for doing this?\n\nJürgen Weltin\n\n"
    },
    {
      "time": " 23.May.2006 2.46am",
      "content": "A few of the other forums I belong to take pride in the fact the each user has at least 10 different fake accounts for silly things like this. I am not so sure that that brand of humor is well tolerated here though. Regardless, I find this humorous, while at the same time I sit and shake my head wondering how someone would think anyone would just freely give something to someone else. I suppose it is possible, but isn’t it always interesting to see how the creative professionals are the ones that are the most likely targets. As if this person were saying: “oh yeah, this is easy stuff, just whip me up a logotype, ti won’t take you but 5 minutes.” You wouldn’t ask a lawyer to give you a freebie, unless your the next OJ Simpson, and I think that the presumptive nature of many individuals is rather obtuse.\n\n"
    },
    {
      "time": " 23.May.2006 5.53am",
      "content": "Lawyers on a whole respect their own work more than many designers. I can’t imagine a lawyer simply giving away his/her service for little to nothing to the same extent designers do. Sadly people feel justified in asking for design for nothing.. and even more sadly there are designers willing to ablige, which only perpetuates the myth that what we do is nothing more than fun and therefor we should be willing to design for little to nothing:(\n\n"
    },
    {
      "time": " 23.May.2006 6.07am",
      "content": "The true humor here is Nick Shinn’s response. He solved the problem and amused the rest of us in the process. I hope you enjoy the album Nick.\n\n"
    },
    {
      "time": " 23.May.2006 6.23am",
      "content": " ![](http://web.archive.org/web/20080827234434im_/http:/www.typophile.com/files/drakgm_5705.gif)\n\nThis is a load of rubbish. Five minutes spent.\n\n"
    },
    {
      "time": " 23.May.2006 6.46am",
      "content": "Oh and if anyone recons it should be tarted up, I am a Plod’n’Stodge man, not a Whirl’n’Swirl. I could have turned the down stroke in the T into a curling tail, or even the base line of the S, but I didn’t. It was only meant tohave five minutes work done on it and thats all I spent.\n\n"
    },
    {
      "time": " 23.May.2006 7.12am",
      "content": "Hmmm, Dratakis? That band must be from Crete :-)\n\nChrisL\n\n"
    },
    {
      "time": " 23.May.2006 7.22am",
      "content": " ![](http://web.archive.org/web/20080827234434im_/http:/www.typophile.com/files/dra_4719.gif)\n\n"
    },
    {
      "time": " 23.May.2006 9.25am",
      "content": "Yeah, I know, I don’t enter competitions.  \nWell, occasionally.\n\n"
    },
    {
      "time": " 23.May.2006 9.44am",
      "content": "—Rant deleted—\n\n"
    },
    {
      "time": " 23.May.2006 11.59am",
      "content": "I think some of you are being unfair here, a barter is offered (at hrant’s suggestion) if it is not good enough for you then haggle, the situation is clearly not the same as a business asking for free work nor is it the case that you would be depriving another professional of a fee.  \nInstead of carping or offering analogies just ignore it.  \nTim\n\n"
    },
    {
      "time": " 23.May.2006 12.37pm",
      "content": "Yes, the reactions are notably defensive.\n\nhhp\n\n"
    },
    {
      "time": " 23.May.2006 1.09pm",
      "content": "MODERATOR COMMENT\n\nI think — forgive me if my thinking is wrong — that many people could simply ignore a thread if they don’t agree with the content. In a few instances lately some of us have gone too far and forgotten to self-edit our opinions and thoughts into useful and respectful posts. It seems to me that if something is blatantly wrong or partially wrong it can still be discussed in a way which allows for discussion WITHOUT insulting anyone. The world is made up of so many varieties of people and we should all respect those differences whether we agree with them or not.\n\n"
    },
    {
      "time": " 23.May.2006 7.28pm",
      "content": "I think being defensive here is very valid. I am not merely being rude. I disagree with bartering here, on this forum, for a creative work. I agree with Michael Browers in saying that this only perpetuates the feeling that “what we do is fun” and “we should do it for nothing”. Everything posted here, and everything posted anywhere else is an opinion. There is no such thing as placing your personal thoughts outside of a communicative response, for it will still exist in your subconscious, and be heard and or read in your writing or speech. I understand how you feel Miss Tiffany, and I understand how you would like to see some of us become a little less “insulting”, however, I feel that I was merely informing and not belittling. I sit and read this thread shaking my head, and all I can say now is that if someone does not say something, or make an attempt at preventing such “low balling” of the entire design industry, then it truly will evolve, or degrade, into something that is only respected as an artistic ability, and not a profession.\n\n"
    },
    {
      "time": " 23.May.2006 9.16pm",
      "content": "I know I am a bit out of my depth here, BUT... I do not recall any mention of (quote)“we should do it for nothing” (end quote) by the original poster. And I, also, get fun out of what I do. So you slave away at something you get no fun, or joy, out of ? I really pity you.\n\n"
    },
    {
      "time": " 23.May.2006 9.51pm",
      "content": "Now, this is clearly a comment that the forum could have done without. I do what I do for I have passion, and interest in something that most know nothing about. There is nothing else in life that makes me happier than typography, design, and the like. I neither asked for your pity, nor will I accept it, as pity is a waisted emotion. The original author of this thread never mentioned getting anything for free, however, as I clearly pointed out, a subsequent author did. Perhaps you should re-read my post, as you may find it clarifies your misinterpretation.\n\nI have never created anything in my life with the intent of profiting from it, however, one must come to an understanding with reality, and at some point make the decision to create [work] type and design as a means of profit.\n\n"
    },
    {
      "time": " 23.May.2006 10.02pm",
      "content": "I did ....\n\nThis portion of message self-edited by author, as he determined it was a waste of time replying to a post that should not have been placed in this thread in the first instance.\n\n.... like you did.\n\nThis post is nether racial, or repulsive, but more an affamation that I to, do have views, and not neccessarily right views.\n\n"
    },
    {
      "time": " 23.May.2006 11.03pm",
      "content": "The only problem with bartering is it’s very hard to tax... Wait, that’s a <cite>feature!</cite>  \nIf materialism is not the point of life, then just think what hard currency is [not].\n\nhhp\n\n"
    },
    {
      "time": " 24.May.2006 7.29am",
      "content": "quote - The only problem with bartering is it’s very hard to tax…\n\nEver since the agrarians took over they’ve found a way. From the verdant river deltas…\n\nTo truly accumulate one must stay put.\n\npeace\n\n"
    },
    {
      "time": " 24.May.2006 7.51am",
      "content": "Note that there is a difference between businesses that expect graphic designers to do spec work, and a guy in high school (I’m assuming) who’s looking for a logo for his band.\n\n"
    },
    {
      "time": " 24.May.2006 7.58am",
      "content": "Nick, I am making the same assumption. The points raised are valid in other circumstances.\n\n ![](http://web.archive.org/web/20080827234434im_/http:/www.typophile.com/files/dratakis_5783.jpg)\n  \nI am holding out for a cover version of “What do I get?” by Buzzcocks:)\n\nTim\n\n"
    },
    {
      "time": " 24.May.2006 8.01am",
      "content": "“My mind isn’t so open that anything can crawl right in.” - Buzzcocks\n\npeace\n\n"
    },
    {
      "time": " 24.May.2006 9.20am",
      "content": "I deal with people (clients) that often want something for nothing. I find myself reminding them that quality isn’t always cheap or free. However, I do not — no matter how much they have insulted my idea of what is right and find myself defensive — insult them. Depending upon how far into the project we are, I will do one of two things: A) Tell them that perhaps they will have better luck getting exactly what they hope for elsewhere or B) Give them exactly what they want, bill them, and do not seek them out ever again. But, I don’t burn the bridge (entirely) as you never know when someone will lead to something else.\n\nMatthew, I’m just as passionate as you are about what I do every day. Even on these forums [because of my passion] I’ve been known to not follow my own suggestions. But I try very hard to keep other’s in mind and do my best to not insult anyone.\n\nIf someone wants a free copy of a typeface it isn’t any different than wanting a free logo. I agree with you on this. However, I try to read between the lines and check the tone of the post. If the person seems nice (and innocent) enough then I try to be nice about it.\n\n"
    },
    {
      "time": " 24.May.2006 9.39am",
      "content": "On consulting the RGD Rules of Professional Conduct, I’m gonna have to decline the barter here and do this pro bono (should my design be accepted), otherwise it’s speculative and a no-no. Unless everyone who submits a design gets a copy of the CD...\n\n"
    },
    {
      "time": " 24.May.2006 9.49am",
      "content": "\\> RGD Rules of Professional Conduct\n\nAh, the Protector of the Establishment.  \nIt’s such a darn shame I refuse to think of myself as a graphic designer.\n\nhhp\n\n"
    },
    {
      "time": " 24.May.2006 9.57am",
      "content": " ![](http://web.archive.org/web/20080827234434im_/http:/www.typophile.com/files/Dratakis_4766.png)\n\nChrisL\n\n"
    },
    {
      "time": " 24.May.2006 10.08am",
      "content": "_Ah, the Protector of the Establishment._\n\nAKA solidarity. Just a bunch of freelance and small business folk in an underpaid line of work getting together to protect their interests.\n\nDid I mention education, experience, and expertise? Such a darn shame you’d never qualify.\n\n"
    },
    {
      "time": " 24.May.2006 10.18am",
      "content": "I meant the West vs the developing world.\n\nOh, and money-grubbing, and selfishness, and... Yes, I don’t qualify.  \nAnd you can keep your education in Fine Fart, and your display pimping.\n\nhhp\n\n"
    },
    {
      "time": " 24.May.2006 10.48am",
      "content": "_I meant the West vs the developing world._\n\nIn what way are the RGD Rules of Professional Conduct representative of the West vs. the Developing World?\n\nSurely the principles of solidarity, of banding together to prevent being crushed, and following responsible rules of conduct, are good ones for people everywhere to follow?\n\n_money-grubbing, and selfishness_\n\nHow’s the Baskerville coming?  \nYou were paid for it, weren’t you? Isn’t it now somewhat selfish to be keeping it to yourself?\n\n_you can keep your education in Fine Fart_\n\nRight. No art involved in typography.\n\n"
    },
    {
      "time": " 24.May.2006 10.51am",
      "content": "You have no idea. Times five.\n\nhhp\n\n"
    },
    {
      "time": " 24.May.2006 11.10am",
      "content": "_You have no idea. Times five._\n\nThe mysterious Mr Papazian, international man of mystery.\n\n"
    },
    {
      "time": " 24.May.2006 9.11pm",
      "content": "_I agree also, that you are “a bit out of your depth”_\n\nCheap shot. Can we see something of your work to see how you qualify to comment in that way?\n\n"
    },
    {
      "time": " 25.May.2006 4.43am",
      "content": "For what it’s worth, I’m with Nick and Tim. Good luck with the band, Steven.\n\n ![](http://web.archive.org/web/20080827234434im_/http:/www.typophile.com/files/dratakis_4622.gif)\n\n"
    },
    {
      "time": " 25.May.2006 5.11am",
      "content": "Nice _Quiffro_ Hamilton…\n\n"
    },
    {
      "time": " 26.May.2006 12.17pm",
      "content": "I edited me cheap shot post, as it was made in a rather hasty manner. I would like to say though, that I never knew that I had to quantify my expertise, experience, or otherwise to any member here before posting to this forum.\n\n"
    },
    {
      "time": " 26.May.2006 12.26pm",
      "content": "You don’t - they’re lying.\n\nhhp\n\n"
    },
    {
      "time": " 26.May.2006 1.13pm",
      "content": "_I never knew that I had to quantify my expertise, experience,_\n\nI mentioned those (and education) in reference to the qualifications required to be a professional member of the RGD:\n\n_You must have graduated from a three- or four-year graphic design program and you must have worked as a graphic designer for a minimum of three years so that the total of your years of education and experience combined is seven._\n\nYou must then apply to the Examination Board for Registered Graphic Designers to determine eligibility to write the Registered Graphic Designers Qualification Examination. The Examination Board will review your application and confirm that you have met the necessary requirements. If you pass the written examination, you must then complete a Portfolio Interview.\n\n"
    },
    {
      "time": " 26.May.2006 1.46pm",
      "content": "“Ah, the Protector of the Establishment. It’s such a darn shame I refuse to think of myself as a graphic designer.” Cheap shot Hrant.\n\n"
    },
    {
      "time": " 26.May.2006 1.58pm",
      "content": "Nice work Hamilton!\n\nChrisL\n\n"
    },
    {
      "time": " 26.May.2006 2.00pm",
      "content": "Maybe I don’t know what “cheap shot” means...  \nI sincerely don’t like the graphic design establishment.\n\nhhp\n\n"
    },
    {
      "time": " 26.May.2006 2.16pm",
      "content": "I can proudly say that I have been an established graphic designer for over 45 years. Like every other profession on earth, we have the normal distribution of good, bad, and everything in-between among us. It has absolutely nothing to do with the group or the profession and everything to do with the individual. Generalizations are a convenient and easy substitute for doing the decent thing and getting to know people as individuals—rather than pigeon hole dumping. Any person of tolerance and integrity will give each single human the chance to demonstrate who they are without being pre-judged by a label imposed on them. I sincerely don’t like the prejudice establishment.\n\nChrisL\n\n"
    },
    {
      "time": " 26.May.2006 2.22pm",
      "content": "\\> Any person of tolerance and integrity will give each single  \n\\> human the chance to demonstrate who they are without  \n\\> being pre-judged by a label imposed on them.\n\nI agree.  \nAnd to me the difference between the individual and the group  \nmarks the distinction between prejudice and perceptive judgment.\n\nhhp\n\n"
    },
    {
      "time": " 26.May.2006 2.31pm",
      "content": "Hrant, what I meant by “cheap shot” was that it was uncalled for.\n\n“I sincerely don’t like the graphic design establishment.” What “establishment” are you referring to? And why do you feel the need to express your dislike for such a broad category of people, merely by their chosen vocation?\n\nI think you should evaluate these statements in light of the recent discussion about tolerance on this forum. Who you do or do not like is irrelevant. Chris L. it’s a shame you should have to explain this concept of not pigeonholing people.\n\n"
    },
    {
      "time": " 26.May.2006 2.36pm",
      "content": "Hamilton, great use of that font, whatever it is.\n\nStevenswift, that is about as good as you are liable to get without shelling out some dough. (And better than you probably would have got even if you had paid money). Make sure you send him a CD.  \n; )\n\n"
    },
    {
      "time": " 26.May.2006 2.48pm",
      "content": "\\> Chris L. it’s a shame you should have to explain  \n\\> this concept of not pigeonholing people.\n\nYeah, nevermind what I actually wrote and meant.\n\nhhp\n\n"
    },
    {
      "time": " 26.May.2006 2.52pm",
      "content": "I’m with fontplayer. That is really nice Hamilton. Cool…\n\npeace\n\n"
    },
    {
      "time": " 26.May.2006 6.26pm",
      "content": "Hey Steven, what do you think of all this kerfuffle you set in motion? :-)\n\n"
    },
    {
      "time": " 26.May.2006 6.34pm",
      "content": "_kerfuffle_\n\nGreat word. It’d be a cool URL:\n\n“If you think you know what is going on, you haven’t been here long enough.”\n\nkerfuffle.com\n\nNote: That quote was actually said to me by someone in the purchasing dept. at McDonnell-Douglas Aircraft (since bought by Boeing)\n\n"
    },
    {
      "time": " 26.May.2006 11.53pm",
      "content": "_And better than you probably would have got even if you had paid money_\n\nThere is something that greatly troubles me about this comment...\n\n...........\n\nI guess Typophile’s Design forum is all set to become the new Craigslist job board, where bands ask for logos, promising all kinds of work for the logo designer if they “make it big”. And if they don’t, well, the designer has a nice portfolio piece, right? Right?\n\nHaving said that, it seems that the members of Dratakis _really are_ in high school...\n\n[http://www.myspace.com/rockmaniac](http://web.archive.org/web/20080827234434/http:/www.myspace.com/rockmaniac \"http://www.myspace.com/rockmaniac\")\n\nBut in my humble opinion, that doesn’t excuse them from finding out that designers need to make a living, just like everybody else.\n\nAnd that Typophile is not a job board.\n\n"
    },
    {
      "time": " 27.May.2006 7.10am",
      "content": "_There is something that greatly troubles me about this comment…  \n...And that Typophile is not a job board._\n\nI’m sorry for the misleading statement. I know that what he got isn’t going to get him far. I’ve seen CD art layed out for printing, and in essence, all he got was an idea. (Probably too tasteful of one for a high school rock band to recognize the value of).\n\nI was just making the point that Hamilton make something cool.\n\nSome people will do something for the fun and joy of doing it. Should they be banned from creating things just for the fun of it?\n\nTrying to be fair, in a forum attended heavily by pro designers, maybe...but a high-shooler wouldn’t have thought it through, certainly.\n\n"
    },
    {
      "time": " 27.May.2006 7.15am",
      "content": "If we do it in a classy way, I don’t see why  \nwe shouldn’t advertise type design jobs here.\n\nhhp\n\n"
    }
  ]
}
