{
  "id": "20187",
  "title": "Type on its last legs",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Some of you may have already heard the sad news - the Type Museum in London is to close. This is what I received:\n\nThe trustees of the Type Museum have taken the decision this week to  \nCLOSE and disperse the museum due to lack of funding.\n\nThese unique collections spanning the evolution of type design and  \nmanufacture will be split up and the majority put into storage -  \nunlikely to see the light of day again.\n\nYou are receiving this email because you have previously expressed  \nyour interest in, and support for the Type Museum. We need your help  \nurgently if we are save the Type Museum as a working resource for the  \nfuture. Apologies if you have received any cross postings.\n\nA meeting is scheduled to launch a Type Museum Society campaign to  \nensure a working future for the collections.  \n18:30 on Wednesday 24 May at the Type Museum, 100 Hackford Road SW9 0QU\n\nAll welcome. We need every kind of active support if we are to succeed.\n\nIf you are able to come along, or have any other time, ideas (or  \nmoney!) to offer please let us know at:\n\nThank you in anticipation\n\nTim Martin\n\nfor the Type Museum Society  \n [typemuseumsociety@gmail.com](mailto:typemuseumsociety@gmail.com)\n\n",
  "author": "bruno_maag",
  "time": "24 May 2006 — 1:27am",
  "uid": "3194",
  "comments": [
    {
      "time": "25 May 2006 — 6:48am",
      "content": "Bruno,  \nWhat was resolved/discussed, it is a shame that they have to take this course of action. I was unable to attend as I work til 7:00.  \nTim\n\n"
    },
    {
      "time": "25 May 2006 — 8:06am",
      "content": "I heard that this was sent out prematurely.\n\nAccording to Allan Haley, \"The British Museum of Science owns much of the hardware in the Type Museum and there was meeting between the principals of both museums last night. So far, the results of that meeting have not been made known.\"\n\nI hope things are resolved in a way which in the very least allows for those interested to be able to have continued access for research.\n\n"
    },
    {
      "time": "30 May 2006 — 6:57am",
      "content": "Thank you for posting this in support. Trustee Chairman Nicolas Barker has asked me to circulate the following clarification.\n\n\"The facts are that as the Museum has insufficient funds to cover its running costs, it is legally obliged to close while its trustees explore other options for keeping it going. When this process is complete, a public announcement will be made\".\n\nThe first meeting of the Type Museum Society took place at the Museum last Wednesday, well attended on a wet and windy night at almost no notice. 30 people left their contact details, a group will liase with the trustees. A second meeting will take place tomorrow Wednesday 31.05.2006 18:30 to carry the campaign forward. Many people have signed up online at [http://groups.google.com/group/typemuseumsociety](http://web.archive.org/web/20150123122159/http:/groups.google.com/group/typemuseumsociety \"http://groups.google.com/group/typemuseumsociety\") Where a digest of messages of support can be read. There's another two days worth to be added!\n\nOn Allan Haley's quote - The terms of acquisition of the elements of the collections vary. His point truly refers to the Monotype Corporation machine composition and matrix making collections. The Stephenson Blake and older hand-foundry materials would largely transfer in rights to the V&A. The DeLittle Wood Type Collection may prove to be still partly owned by the surviving Mr Delittle. The materials acquired from the former Clowes Museum & the Austen Composition collection both of great type language importance may have other safeguards built in (or not). This is only if the Type Museum fails as an entity in its own right and the collections cannot be kept accessibly together.\n\nThe principal concern is having gathered these materials and begun to see the profound educational value of having the processes side by side it is this very synergy that is at risk.\n\nThe staff were laid off last week. And I am receiving communications that indicate that the Museum is closing to the public.\n\nThe Museum on a shoestring has been working really hard to build a new purposeful and credible plan for the future - it needs all the support; and publicity it can get in a renewed drive for funding to put it on a firm foundation. For Type’s sake !! These collections are without equal and represent - in or close to working condition - the evolution of type technologies.\n\n"
    },
    {
      "time": "30 May 2006 — 8:41am",
      "content": "Tim, thank you very much for the update.\n\n"
    },
    {
      "time": "30 May 2006 — 10:51am",
      "content": "If anyone can help us get some journalists interested in writing up the real threat of losing these materials and resources - please pass them on. We now have a domain [http://www.typemuseumsociety.org/](http://web.archive.org/web/20150123122159/http:/www.typemuseumsociety.org/ \"http://www.typemuseumsociety.org/\") and a very modest site at the moment - just an anchor point. But if some of you haven't been inside the vault at the Type Museum recently you may like to follow the Typographic Treasure link.\n\n"
    }
  ]
}
