{
  "id": "20194",
  "title": "(x) Pure Poison perfume by Dior - Carolus Roman {Patricia}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello,\n\nI’m looking for the font used for the perfume PURE POISON by Dior.  \nA customer of mine would like me to use it for a new logo.  \nAny suggestion on a alternative is also (even more) welcome!\n\nTHANX\n\nIlse\n\n| Attachment | Size |\n| --- | --- |\n| [PURE POISON.jpg](http://web.archive.org/web/20091012015914/http:/typophile.com/files/PURE%20POISON.jpg) | 145.51 KB |\n\n",
  "author": "<a href=\"/web/20091012015914/http://typophile.com/user/13062\" title=\"View user profile.\">type2type</a>",
  "time": "<br>",
  "uid": "13062",
  "comments": [
    {
      "time": " 24.May.2006 7.51am",
      "content": "Carolus Roman\n\n[http://www.dafont.com/carolus-roman.font](http://web.archive.org/web/20091012015914/http:/www.dafont.com/carolus-roman.font \"http://www.dafont.com/carolus-roman.font\")\n\nInteresting Dior using a freebie. My copy says it’s from Image Club.\n\n"
    },
    {
      "time": " 24.May.2006 8.01am",
      "content": "The dafont version is a very bad digitised version. Scanned and streamlined.\n\n"
    },
    {
      "time": " 24.May.2006 8.19am",
      "content": "Yeah, it sucks, but I’m not sure the font is available anymore.\n\nEthics question: I have this font and would be willing to give it to Ilse (type2type) in a much better format. But I don’t know if that’s kosher. It seems preferable to her downloading a crappy knockoff, and if Image Club doesn’t distribute it anymore, why not? What say the powers that be?\n\nOK, I did a little homework and learned that Fonts.com acquired and distributes Image Club fonts. However Carolus Roman is not for sale on their site. If the Dafont version is all that’s available that would be unfortunate.\n\n"
    },
    {
      "time": " 24.May.2006 8.24am",
      "content": "Thanks.\n\nI don’t think it’s the free version, but it’s close!  \nIn some cases a free font is derived from a official version (and made worse!)\n\nMust say I can’t find the Image Club one you mention?  \nI’m not at all freebie minded. Any suggestion on an alternative?\n\n"
    },
    {
      "time": " 24.May.2006 8.30am",
      "content": "oeps I was to slow,...\n\nI’d prefer to have had it officially, but if it’s no longer available,...  \nMaybe I should contact Image Club?\n\n"
    },
    {
      "time": " 24.May.2006 8.42am",
      "content": "As mentioned, it seems they were acquired by fonts.com.\n\n[http://www.identifont.com/show?1RI](http://web.archive.org/web/20091012015914/http:/www.identifont.com/show?1RI \"http://www.identifont.com/show?1RI\")\n\nI’m glad you’re not freebie minded and I wouldn’t make the offer if the font were available. Why don’t you do some research (and let’s hear what the other experts on this site say) and if you can’t legally acquire the font, we can talk. I generally think it’s a real shame when fonts just slip away.\n\n"
    },
    {
      "time": " 24.May.2006 8.50am",
      "content": "I’ll do some research and hear what other experts suggest.  \nBut I’ll keep your offer in mind!\n\n"
    },
    {
      "time": " 24.May.2006 3.07pm",
      "content": "Pattyfab,  \nAs far as it being kosher. “Kosherness” takes two things into consideration.  \n1. Copying software (this would include fonts) is a hotly debated topic amongst contemporary Rabbis. Since there are now copyright laws in the Torah (Bible) we look for a precedence in the law. According to the original law there would be nothing wrong with copying anything. Nobody owns ideas. The Jewish People’s open-source platform and creativity produced some of the greatest stories and wisdom of the world. What could be not kosher is if you where copying and distributing intellectual property not for free but for sale, and therefore stealing the authors ability to make money.  \n2. When the jews found themselves exiled and living in rome they asked themselves “do we have the moral obligation to follow roman laws?” the answer was “When in Rome... do as the romans do” which is the source for that famous quote (from the jewish talmud.) therefore even if it is “kosher” it may not be kosher if the law of the land says it is illegal. That being said, the law must be a law which is of the land, meaning the people accept and follow it as law. For example stopping a full three seconds at the stop sign has never been accepted or followed as the law of the land. Therefore it is not binding.\n\nAs you can imagine, there are a lot of questions on this subject and I don’t think the western world or the rabbis have settled the debate on the ethical implications of copying intellectual property. Questions like what is ownership? what is property? what is intellectual? what is a copy? Do people think it is unethical? the people that do not copy why do they not do it ? ethics? getting caught? who loses money?\n\nBy the way I think this is a lot of fun. And I keep Kosher.\n\n"
    },
    {
      "time": " 24.May.2006 7.53pm",
      "content": "Actually, Yves, it’s not Carolus Magnus, that’s a different font.\n\nPsachyah - I’m Jewish too but don’t keep Kosher. I am well aware of the laws surrounding pirated fonts and software. I acquired my copy legally. THis font is now only available in a bad freebie copy. Ilse is willing to purchase a copy, legally, but can’t. So it seems like an ethical grey area. Maybe I should ask that guy “The Ethicist” in the NY Times what he thinks. He usually replies to my emails.\n\n"
    },
    {
      "time": " 24.May.2006 8.28pm",
      "content": "I believe that Grant Hutcheson of Veer.com was once involved with Image Club, so he probably could tell you the status of these fonts.\n\nIn [this interesting article](http://web.archive.org/web/20091012015914/http:/www.jlaw.com/Articles/copyright1.html) it is clear that according to current Orthodox Jewish religious law copyright should be respected. (I am not Orthodox.) In fact, soon after the invention of printing, a kind of copyright protection for printers of editions of traditional works was developed. Original works are another matter, and the article makes clear that the copyright of these is also respected, and not only on the grounds of “Dina De’Malchuta Dina”—the law of the governing authorities is the law—but also ethical grounds.\n\nBy the way Psachyah, according to my ’Bartlet’s Quotations’ the ’When in Rome’ quote comes from Robert Burton (1577-1640). I don’t think it’s in the Talmud. And even “Dina De’Malchuta Dina” has its limits, according to the above article.\n\n"
    },
    {
      "time": " 25.May.2006 12.03am",
      "content": "william,  \nThat article is a much more thorough an examination of these concepts than I could offer. I hope you understand that this article is making a conclusion based on selective opinions and is not “Current Orthodox Religious Law”, if there is such a thing. It is conclusive because it is offering only one side of the debate. Would you like examples? or do you agree?\n\n(PS I am looking into my unexamined sloppy story about “when in Rome” I will let you know what I find. Thank you for the crit)\n\n"
    },
    {
      "time": " 25.May.2006 12.12am",
      "content": "Patty, I think it would be better to work out your ethical dilemma yourself before going to the expert. It seemed to me that you where implying that because the font was no longer available for sale it might not be unethical to give it away for free. I assume the rationale behind this is that there is no loss of money to any party. If that is the case then there is nothing inherently unethical about copying. The unethical part of copying is removing somebody’s potential to earn money through its sale. Was this your line of thought?\n\n"
    },
    {
      "time": " 25.May.2006 12.38am",
      "content": "William close but no cigar,  \nI will keep looking.\n\nThe Saying: WHEN IN ROME, DO AS THE ROMANS DO.\n\nWho Said It: St. Ambrose\n\nWhen: 387 A.D.\n\nThe Story behind It: When St. Augustine arrived in Milan, he observed that the Church did not fast on Saturday as did the Church at Rome. He consulted St. Ambrose, bishop of Milan, who replied: “When I am at Rome, I fast on a Saturday; when I am at Milan, I do not. Follow the custom of the Church where you are.” The comment was changed to “When they are at Rome, they do there as they see done” by Robert Burton in his Anatomy of Melancholy. Eventually it became “When in Rome, do as the Romans do.”\n\n[http://www.trivia-library.com/b/origins-of-sayings-when-in-rome-do-as-th...](http://web.archive.org/web/20091012015914/http:/www.trivia-library.com/b/origins-of-sayings-when-in-rome-do-as-the-romans-do.htm \"http://www.trivia-library.com/b/origins-of-sayings-when-in-rome-do-as-the-romans-do.htm\")\n\n"
    },
    {
      "time": " 25.May.2006 2.49am",
      "content": "\\> _Actually, Yves, it’s not Carolus Magnus, that’s a different font._\n\nOops, indeed, that’s a [different font](http://web.archive.org/web/20091012015914/http:/www.fontshop.com/?fuseaction=catalog.fontdetail&searchby=manufacturer&displayfontid=FF.1533.1.5) altogether. The brainwashing I received in my formative years at FontShop promoting FontFonts doesn’t seem to wear off. :^P\n\n"
    },
    {
      "time": " 25.May.2006 4.16am",
      "content": "There is an outline version of Carolus in the  \n [Dover’s 24 Outline Display Fonts CD-ROM](http://web.archive.org/web/20091012015914/http:/store.doverpublications.com/0486995038.html). It’s not of the higher quality but I bet it’s better that the free one.\n\n"
    },
    {
      "time": " 25.May.2006 6.34am",
      "content": "Psachya, I know there is no unified body to decide what is Jewish law—the Sanhedrin hasn’t met for quite a while!—so what is accepted often takes a generation at least for a clear majority view to arise.\n\nI thought this was a review article representing the current state of the debate, but I may well be wrong, as you say. Do you have other links—in English?\n\nThe basic thing is that in the traditional context, there was no concept of intellectual innovation as something that needed protection and promotion for the sake of the general welfare of the society. But the idea that the general welfare should be promoted is central in Jewish law, so frankly I would think that in a modern context it’s a no-brainer to support copyrights and patents. Since this is an area where in general the rabbis have no power, I wouldn’t suppose it has been focused on that much.\n\nThe exception is the issue of when photocopying of articles for education becomes unethical. Here there are arguments on both sides, as the article mentions. However, I think that where US courts came down is clearly right. If you wholesale photocopy articles for classes, you are depriving authors of deserved income—and doing that is against principles of Jewish law, as the article notes.\n\nThanks for the background on ’When in Rome’. I had the feeling that it might have an earlier source than Burton, a Christian one—as Rome was their center—but I didn’t see anything.\n\n"
    },
    {
      "time": " 25.May.2006 2.35pm",
      "content": "william,  \n“the Sanhedrin hasn’t met for quite a while!”\n\n“In October 2004 (Tishrei 5765), a group of rabbis claiming to represent varied communities in Israel undertook a ceremony in Tiberias, where the original Sanhedrin was disbanded, which they claim re-establishes the body. The nascent Sanhedrin was established by Rabbi Dov Levanoni, who received ordination from Rabbi Moshe Halberstam, a leader of the Eda Haredis’ Beis Din Zedek religious court. Rabbi Levanoni ordained Rabbi Tzvi Idan as temporary Nasi, but he soon stepped aside in favour of well-known Jewish author Rabbi Adin Steinsaltz.”\n\nThe Sanhedrin and its importance has gained a lot of respect since its re-establicshment. Probobly because of Rabbi Adin Steinsaltz.\n\n"
    },
    {
      "time": " 25.May.2006 2.36pm",
      "content": "[http://en.wikipedia.org/wiki/Sanhedrin](http://web.archive.org/web/20091012015914/http:/en.wikipedia.org/wiki/Sanhedrin \"http://en.wikipedia.org/wiki/Sanhedrin\")\n\n"
    },
    {
      "time": " 25.May.2006 3.00pm",
      "content": "Thanks Psachya, didn’t know about that.\n\n"
    },
    {
      "time": " 25.May.2006 5.49pm",
      "content": "I still don’t think that even if they ruled in favor of adopting copyright law into Halachahic Jewish Law that we could say that the current Orthodox law is such. This is because all Jewish law after the loss of a unified governing body - which we had even until after the Babylonian talmud era - Is is left to the discretion of the rabbis in each community. Only something which they would all agree upon and except without exception, could be considered binding to all jews. But there are a lot of things which all rabbis agree upon and those meeting points would of-course define what is kosher or not, for those out side of that particular rabbi’s community.\n\nI just do not think that we have excepted copyright law into the Halachic framework. When a law is excepted as halachah it has a lot more at stake then a parking meter violation. Jewish Law has as much to do with ones relationship to his creator as it does with encroaching on another citizen’s right to make money, and in-fact they are one in the same. If Copyright law is part of jewish law, then by violating it I am severing my self from my creator and life-source. I am in a sense violating my very self, and the core of my being by copying someone’s fonts. I began to feel that way, and although as a teenager I had amassed a load of pirated stuff I began the painful process of removing everything that I had which was “free and easy”. But although I don’t want to copy somebody’s work, I do this not because of a religious or moral or ethical obligation but as courtesy to the one who made this program. I am affording him the rights he wishes to have. But do I think that a musician has some sort of existential right over a series of cords, or a typographer over the angle of an octothorp, no.\n\n"
    },
    {
      "time": " 25.May.2006 5.56pm",
      "content": "in other words:  \nIs it kosher? - maybe yes.  \nShould you eat? - probobly not.\n\n"
    },
    {
      "time": " 25.May.2006 6.20pm",
      "content": "Psachya, you are getting here into complicated questions about Jewish law and ethics, which I doubt that many here are interested in.\n\nJust briefly my point of view. As a practical matter, I think Jewish law as such has radically shrunk down to ritual matters, and for the orthodox community family law. So I think the application of Jewish values to issues such as copyright is more a matter of ethical guidelines than law. These are, however extremely important because, as you say, this involves being a spiritually whole person.\n\nI do think that we have to acknowledge that there is something new under the sun, and that includes the scientific, technical and artistic innovation that characterize the modern world. Ethically, intellectual property rights are absolute key to this world. The US founding fathers recognized this as the first law passed was the patent act. They were thinking about the future and how to ensure a good one. Maimonides said that all the ethical mitzvot are to insure the ’yishuv ha-olam’, the settlement of the world. As the world changes, so the impact of ethical values changes. Copyright and patents and trademarks has to do with preserving the ability of the creator of a product to profit from it. Viewed this way, if the creation of copyright is justified in the modern world to enhance and protect creators of intellectual products, then copying something with out paying the owner is just theft.\n\nThe issue is really the justification of copyrights and patents. Once you accept that—and I think the case for it is overwhelming—then copying copyright material is definitely not kosher, by my reading of Jewish ethics.\n\n"
    },
    {
      "time": " 25.May.2006 6.34pm",
      "content": "William,  \nWell said.  \nAbout the matter at hand, If I accept that there is a practical need for copyright law.  \n(which I do) And you would agree that a human has no existential right over a series of cords. (which I think you do) .Than in Pattyfab’s dilema it seems to me the only thing holding her back from letting the person have a font which for arguements sake is not for sale would be a narrow minded “orthodox” view, staunchly insisting on the law for its own sake instead of seeing the bigger picture of its application. I think this applies to all sorts of folks, not just the sons of Israel.\n\n"
    },
    {
      "time": " 25.May.2006 6.36pm",
      "content": "Although we seem to be the only ones talking about it... hmmm\n\n"
    },
    {
      "time": " 25.May.2006 6.39pm",
      "content": "Psachya, the issue here in the Image Club case is to what extent the font is still covered by the EULA, and what it that is. As I said, as a practical matter e-mail Grant Hutchinson at Veer.com and ask him—though it seems this is not the font so it’s all moot! It is awfully hard to discuss this stuff without knowing the exact facts.\n\n"
    },
    {
      "time": " 25.May.2006 7.28pm",
      "content": "william,  \ntrue, well said again.  \nI was realy just talking about Pattyfab’s dilemma before it collapsed. And I was discussing for its own sake (L’Shmah). Thanks for the Chavrusah.\n\n"
    }
  ]
}
