{
  "id": "20217",
  "title": "typetool from computer arts CD57",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "dear all, hello's from Dublin\n\nI dug out an old CA mag. with Typetool 1.3 on CD there. It's appearently a full version, though you need to go to a special website and get your serial code from there. Fair enough, but when i log in onto that website I get information that i am not authorised to access it. Is there any catch there? Or is there any other way of retrieving that serial no.?\n\ncheers for any help\n\n",
  "author": "arh",
  "time": "25 May 2006 — 5:38am",
  "uid": "13074",
  "comments": [
    {
      "time": "25 May 2006 — 6:21am",
      "content": "Computer Arts seem to make getting the serial number as difficult as possible, I'd try getting in touch with them, they have been able to help me in the past.  \nTim\n\n"
    },
    {
      "time": "25 May 2006 — 6:27am",
      "content": "timd, hi\n\nthanks for this. I agree with CA and serials...:(\n\nAnyway, got that serial from lovely people at Fontlab exactly a minute ago :)))\n\nCheers!\n\n"
    },
    {
      "time": "28 Jan 2013 — 6:39am",
      "content": "It's none of the regular thinks, so that would need some  \ninvestigation. [nsserials](http://web.archive.org/web/20130131013309/http:/www.nsserials.com/)\n\n"
    },
    {
      "time": "28 Jan 2013 — 8:26pm",
      "content": "Dragon spring is a pure traditional Chinese medicine [Replica rolex](http://web.archive.org/web/20130131013309/http:/www.watchesbeer.net/) composition ,containing no hormone ,no side effects and dependence ,taking not lit .Dragon spring effect is really good, popular throughout the 6 years ,millions of people had used the dragon spring ,in Fujian for more than 300000 people have used .  \nDragon spring across the male dragon spring 6 anniversary of obstacle best-selling super preferential shock attack last day 3 state health food word G20060585 dragon spring with amazing results, selling the country anniversary ,to allow more male friends feel dragon passion spring effect ,especially in the designated pharmacy free :with my ID card can receive the dragon spring two bags ( not repeat receive gifts ,Gifts Co.  \ndonated stock lasts ) .The specified address :North two street Gulou new pharmacy stores ( provincial hospital outpatient building across the ramp) Taijiang appropriate [Rolex Replica](http://web.archive.org/web/20130131013309/http:/www.watchesbeer.net/) and good pharmacy ( up to the road Asia Plaza ) Kuraama Yasuke pharmacies (three road for Fu Temple ) Fuqing :Banyan spring pharmacies ( Po Street after the Yellow Crane Tower restaurant opposite ) cauda equina: Johnson drug stores ( Jun Bamboo Road ) activity time October 20th :-26 daily [Cheap tag heuer Replica](http://web.archive.org/web/20130131013309/http:/www.themwatchesus.net/) morning 9:00-11:30 only yuan 9.  \nCame 15 days on June 14th, [Replica louboutin shoes](http://web.archive.org/web/20130131013309/http:/www.soilshoe.net/) province forestry bureau deputy director Huang Changchun, prevention branch Jiang Liya section chief, Zhang Hong deputy chief in Lu'an City Forestry Bureau accompanied by the leader of Jinzhai, to superintend and director of Ginkgo saturniid moth prevention and control work.  \nHuang Changchun deputy director general group listened to Jinzhai County Forestry Bureau deputy [replica panerai](http://web.archive.org/web/20130131013309/http:/www.watchesbeer.net/panerai-watches.html) director Zhao Meng on Ginkgo saturniid moth investigation and control work debriefing, and in-depth Heaven Village scenic area and the horse in natural protection area of the scene to guide the work of prevention and control.  \nDirector Huang said, Lu'an city and Jinzhai County of Ginkgo biloba L. moth prevention and control work very seriously, insect found early, comprehensive survey accuracy, prevention measures are effective, next control arrangement of scientific and orderly.  \nHe asked the Jinzhai county great efforts to further improve 8-9 month [fake rolex watches sale](http://web.archive.org/web/20130131013309/http:/www.themwatchesus.net/) light trap, to reduce its overwintering larvae number, prevent the next year the bug [Cheap Rolex Replica watch](http://web.archive.org/web/20130131013309/http:/www.themwatchesus.net/) serious occurrence, spread, ensure the Tianma National Natural Reserve and the county forest resources security.\n\n"
    }
  ]
}
