{
  "id": "20222",
  "title": "(x) Frank Zappa/Grandmaster Flash record covers - custom designed/Quicksilver {Dav/Tim D}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi\n\nJust a couple more typefaces im trying to spot, Frank Zappa and Grandmaster Flash.\n\nI'm guessing the Frank Zappa is cutom but if there is anything sinilar or \"rock\" influenced typefaces id be very inetrested.\n\nThanks!\n\n| Attachment | Size |\n| --- | --- |\n| [frank zappa.jpg](http://web.archive.org/web/20141112170444/http:/typophile.com/files/frank%20zappa.jpg) | 231.59 KB |\n| [GMF&F51.JPG](http://web.archive.org/web/20141112170444/http:/typophile.com/files/GMF&F51.JPG) | 33.28 KB |\n\n",
  "author": "Marstrois",
  "time": "25 May 2006 — 9:40am",
  "uid": "8396",
  "comments": [
    {
      "time": "25 May 2006 — 9:53am",
      "content": "Yea, The 'Frank Zappa' one is custom for sure.\n\nDav\n\n"
    },
    {
      "time": "25 May 2006 — 9:55am",
      "content": "Grandmaster Flash is Quicksilver don't know if it is digitised\n\n[http://www.dafont.com/](http://web.archive.org/web/20141112170444/http:/www.dafont.com/ \"http://www.dafont.com/\")\n\nMight have a similar to Zappa\n\nTim\n\n"
    },
    {
      "time": "25 May 2006 — 10:03am",
      "content": "Grandmaster Flash is **Twizzler** from ACME fonts if my memory serves me correctly.\n\nI’ll have to check.\n\n"
    },
    {
      "time": "25 May 2006 — 10:09am",
      "content": "To my knowledge, Quicksilver has been digitised and sold bundled with old Corel products, I think it's no longer available. If you're after a similar look, check out [Frankfurter Hightlight](http://web.archive.org/web/20141112170444/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=ITC.100337.0.3&attributes.sampleSize=48&sampleText=GRANDMASTER&sampleSize=48).\n\n"
    },
    {
      "time": "25 May 2006 — 10:15am",
      "content": "Their [website](http://web.archive.org/web/20141112170444/http:/www.acmefonts.net/) is being re-designed at the moment… pretty sure it’s them though.\n\nSo _Twizzler_ must be the digitised version of _Quicksilver._\n\n"
    },
    {
      "time": "25 May 2006 — 10:16am",
      "content": "Bit more research, Letraset's Quicksilver was renamed as Quantum for the Corel bundle, maybe Conor's Twizzler is another version.  \nTim  \n{edit crossposted with Conor}\n\n"
    },
    {
      "time": "25 May 2006 — 10:27am",
      "content": "_ **Quicksilver** (Quantum)_ is probably the only verifiable name for it.\n\nIt’s in my (very old and dusty) Letraset book too.\n\n"
    },
    {
      "time": "25 May 2006 — 10:48am",
      "content": "Grand Master Flash & The Furious Five. Seven Guys in the photo. Classic.\n\n"
    },
    {
      "time": "26 May 2006 — 2:38am",
      "content": "Thanks for the spot, Quantum is spot on!\n\n"
    },
    {
      "time": "26 May 2006 — 6:29am",
      "content": "If you look in the corner of the Zappa design, you can see Rick Griffin's signature. The lettering and the flying eyeball cartoon in the middle are typical of his style.\n\n"
    },
    {
      "time": "18 May 2007 — 8:25pm",
      "content": "\\*\\*\\*THE STORY OF LETRASET'S QUICKSILVER TYPEFACE\\*\\*\\*  \nI'm Dean Morris, the designer of the typeface \"Quicksilver\" that came out in 1976 as part of Letraset's Letragraphica range of rub-down fonts, the stylishly aggeressive ones in the yellow pages of the catalog. I named the typeface \"Quicksliver\" because it looked like bent thermometers — quicksilver being a nickname for mercury (I never meant it to suggest neon), and because \"Quicksilver\" had some of the cooler letters such as Q, K, E, and R. The name was my second choice, however. Letraset Englishly felt that my first choice, \"Polished Sausage\", would be \"rather unpopular iln foreign markets\". I designed it as a 16 year-old kid in John Glenn High School in Bay City, Michigan, and sent Letraset a xerox of a tight sketch of 3\" letters kerned with the heavy outlines slightly overlapping as I originally intended. I drew only the skinny S without an alternate and submitted no punctuation (what did I know?). Letraset must have wanted it real fast (disco was WHITE HOT then, remember), because they did the finished art themselves at 5\" high (they can't have known my age, maybe they had no confidence in my technical talent), starting with the E as did I in the design stage. And what a gorgeous rendering job they did in the pre-Mac days of ruling pens, straightedges, and handdrawn curves (those aren't compass curves)! Letraset stayed very close to my tight sketch, designed the punctuation, and suggested an alternate but wierd wide S, which I approved, figuring there was probably no other decent way to design it. I imagined the punctuation would match the stroke width of the letters but they drew them narrower and slightly oddly, but I figured what the hell. If you wondered, \"What was I thinking?\" when you looked at the A, B, E, F, K, N, Q, R, and Y, I'll tell you. I was simply trying to describe part of the letter being drawn in the wrong direction. I thought I was so clever. For instance the E cross-stroke goes from right to left rather than from left to right like, oh, any other Roman cap E in history. R and Q diagonals came from waaaaaaaay on the other side, N goes waaaaaaay around the wrong way before starting the diagonal. \"Chrome\" letters can branch but these \"glass tube\" letters don't! Alas, digitization came along eventually and fontographer technology followed. Crash went sales of rub-down type, and control of artwork was pirated without my knowledge and beyond my control, which I don't condone but I totally understand. The first album cover I saw with Quicksilver was Men At Work's first smash LP, then punk pioneer Stiff Records' logo appeared on 45 rpm labels with a clearly Quicksliver-inspired F. For about ten years I, family, and friends collected food packages, posters, took photos of signs, etc. with Quicksliver from around the world. I think it's about the easiest typeface to mishandle ever. Eventually I stopped trying to keep track of it. Maybe I'm overestimating its popularity now after 30 years (I totally forgot about it for about a decade), but to me seeing it around at all is itself a rave. I can't remember why I Googled \"Quicksilver Letraset\" a few days ago and what I found was a whole community of sites for font identification and original name lists (where they bothered to accurately credit me as designer which gets me RIGHT HERE). It makes me feel less forgotten even though I don't see royalties. BTW, I never did, nor did Letraset ask me to, design a lower case version. Feel free to pass along this modest piece of graphic microhistory to any Letraheads.  \nDean Morris, May 2007, New York City.\n\n"
    },
    {
      "time": "19 May 2007 — 8:50am",
      "content": "Check out Keith Bates' [Rick Griffin set](http://web.archive.org/web/20141112170444/http:/www.k-type.com/fontrick.html).\n\n"
    },
    {
      "time": "19 May 2007 — 8:53am",
      "content": "Oh, and some of David Nalle's [psychadelic fonts](http://web.archive.org/web/20141112170444/http:/www.fontcraft.com/scriptorium/psychedelic.html).\n\n"
    },
    {
      "time": "19 May 2007 — 10:22am",
      "content": "Dean, if you're still here: You mentioned that Letraset didn't pay royalties. How did they pay designers? Was it a flat fee? Quicksilver is a real classic. Too bad you didn't get royalties on it. DId you ever design any other fonts?\n\n"
    },
    {
      "time": "19 May 2007 — 10:29am",
      "content": "Nice to read the background Dean.\n\nTim\n\n"
    },
    {
      "time": "19 May 2007 — 1:38pm",
      "content": "I want to thank you personally, Dean, for the history. And I think [Yves](http://web.archive.org/web/20141112170444/http:/typophile.com/node/33786) will be interested, too, when he's back from TypoBerlin.\n\n"
    },
    {
      "time": "11 Jun 2008 — 8:39am",
      "content": "as i mention in a couple other locations, i'm posting on flickr examples of quicksilver i collected with more to come.\n\n[http://www.flickr.com/photos/27088565@N07/sets/72157605297772027/](http://web.archive.org/web/20141112170444/http:/www.flickr.com/photos/27088565@N07/sets/72157605297772027/ \"http://www.flickr.com/photos/27088565@N07/sets/72157605297772027/\")\n\n"
    },
    {
      "time": "11 Jun 2008 — 8:49am",
      "content": "and to mark simonson, 13 months late:\n\ni did get royalties for 15 years, then letraset's exclusive contract with me ended. by then technology put a wrench/spanner in the exclusivity works and all hell broke loose.\n\ni've made other fonts but the world will not miss not having seen them, although i like them.\n\nthere is a ton/tonne of type design talent out there today.\n\ndean\n\n"
    }
  ]
}
