{
  "id": "20265",
  "title": "How much rag is too much rag?",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "I have this small publication that I am working on, for a project, and I need some feedback on the “rag”. I typically work with justified type blocks, but this time, it seems nice to go with just a left justified ragged right setting. I have gone through an evolution of 42 layouts at this point, and have attached two. The first is one that has a more unbalanced rag, while the second is verging on fully justified type blocks. Since I am not so familiar with how much “rag” is best, or how and where to balance and where to not, I would like some input from you guys. Anything that you have to say would be appreciated, thanks.\n\nThe PDF files are rather large, sorry, outlined the type to avoid problems. Also, just a side-note, in case you think I am crazy for choosing the colors that I did. This project is going to be printed on a recycled white (similar to antique white) stock, so the colors are rather nice in real life. I took out the color background, for, i was not sure it would display correctly on everyones screen.\n\n[more rag](http://web.archive.org/web/20060630150623/http:/trackandkern.com/typophile/production33.pdf)  \n [less rag](http://web.archive.org/web/20060630150623/http:/trackandkern.com/typophile/production42.pdf)\n\n",
  "author": "<a href=\"user/11282\" title=\"View user profile.\">track and kern</a>",
  "time": "<br>",
  "uid": "11282",
  "comments": [
    {
      "time": " 28 May, 2006 - 3:11am",
      "content": "My choice would be more rag, I find the idea of reducing ragging so much that it becomes almost justified inhabits a kind of crossover world that is neither one thing nor the other and distracting where it is not possible to justify it.  \nThere are a number of spelling mistakes and maybe editing which you should sort out before you start on this polishing of a layout, you have done an impressive job with smoothing the rag, however, I would be inclined to sacrifice that to take over a short word that begins a sentence, for example, I, In, On, A etc., the space created by fullstop\\_space\\_{word} does make a standout at the end of a line.  \nI do find the outlined type a problem to really look at.  \nYou have done a good job as far as I can see.  \nTim\n\n"
    },
    {
      "time": " 28 May, 2006 - 3:30am",
      "content": "From your description I was expecting the more rag one to have  \na right edge reminiscent of white noise waveforms! :-) So I think  \nit’s just fine, while the less rag one looks like a funny mistake.\n\nhhp\n\n"
    },
    {
      "time": " 28 May, 2006 - 3:43am",
      "content": "Two more things:  \n1) I think you’re using Chaparral small enough that it needs slightly more looseness. Or maybe the type being outlines here is making it darker than it’ll actually come out, and that’s eating up the letterspacing.  \n2) Just like you’re applying a right rag\\*, I would apply misalignment to the vertical ends of things. Like in the rightmost column of text next to the table of common extensions on the first page: you’ve done an amazing job making it end right with the table, but if you look beyond the “exercise” of this approach it’s actually making the text seem like a third column in the extensions data on first glance; so I would instead make that column shorter. Also like at the very end of the article: making it end before the bottom of the page gives a nice visual clue to the reader not to look for another page.\n\n\\* Which is great - just picture how frigid the whole thing  \nwould be if all the columns were perfect rectangles.\n\nTake the effective, pragmatic spirit of the right rag to heart!\n\n—\n\nAnd something about the actual content: as you probably know, the first “Garamond” you’re showing (besides the fact that I personally think it has horrid vertical proportions) is actually based on Jannon, not Garamond.\n\nhhp\n\n"
    },
    {
      "time": " 28 May, 2006 - 3:58am",
      "content": "Uuuh, one more thing, sorry:  \nConsidering the way most people would use the “Fraction to decimal equivalency table”\\* it’s not very usable: to find the fraction you’re looking for you either have to fish around or be able to move back or forward in the table by doing some very fast math in your head (at which point you might not even need the table :-). I think it would be much better to split the table up into a bunch of smaller tables, each one covering one denominator. Or maybe you could think of another way to guide the user to the denominator he’s looking for within your existing structure, for example by having differing indents (sort of like an information-rich left rag).\n\n\\* BTW, maybe you wanna smallcaps that?\n\nAnd another content thing:  \nSome things in your font formats section (especially in the TT passage)  \nseem suspect… Try to get an expert to read it and help shape it up.\n\nhhp\n\n"
    },
    {
      "time": " 28 May, 2006 - 3:32pm",
      "content": "Well, I feel silly now fro wasting all that time balancing the rag to the point of almost being justified. The whole time I felt the same way, that it looks like a “silly mistake”. I have no idea why I kept at it. A few people have commented about the fraction decimal table, I thought that it was fairly straight forward, but now, perhaps I will take a second look at it. I have seen them both ways, and everyone has their own print out that they carry around.\n\n"
    },
    {
      "time": " 28 May, 2006 - 4:09pm",
      "content": "BTW: if anyone would be so kind at to correct me on anything that is contained in the font format sections that would be great. I am mostly familiar with the PS and OTF format, so the TTF information is really based on a novice understanding in all honesty. I did a bit of reading about it, but perhaps I am not differentiating it correctly and or defining it precisely.\n\nhrant, can you suggest another member here that my be the best person to ask on that bit?\n\n"
    },
    {
      "time": " 28 May, 2006 - 4:14pm",
      "content": "I suppose at this point, its best to fess up, not that there is anything that I really need to reveal about myself that is so much a short-coming. I am a BA student, graduating in about three weeks, and this newsletter-ish project was put together for two reasons:\n\na) to fulfill the requirement for a design class\n\nb) to leave a brief information piece behind, to the school, that they may give to new students. Really, the basis of this entire thing was to provide new students with a bunch of into that I wish I had when i first began my BA studies. Really, I had no way of getting the knowledge, for I really didn’t know how to ask the right questions.\n\n"
    },
    {
      "time": " 28 May, 2006 - 7:33pm",
      "content": "Thomas Phinney.\n\nhhp\n\n"
    },
    {
      "time": " 28 May, 2006 - 10:37pm",
      "content": "Matthew wrote me about it, so I read the doc and I sent him a marked-up version of one of his PDFs with lots of comments. I hope it’s helpful!\n\nT\n\n"
    },
    {
      "time": " 29 May, 2006 - 2:19am",
      "content": "The spelling/grammar problems that I mentioned were to do with the confusion of wont with want and won’t; and garmond in the ITC vs Stempel examples, as I mentioned I was having trouble reading the outlined pdf so there could be more.  \nIt looks like this will be a good and worthwhile resource for your fellow students.  \nAs for smoothing the rag to justified I have worked with people who insist on it, for the reasons above I believe it is rarely the best treatment, but don’t write it off as silliness there may come at time…  \nPlease let us see how it turns out.  \nTim\n\n"
    },
    {
      "time": " 29 May, 2006 - 6:58pm",
      "content": "Thank you Thomas, Tim, and hrant. This has all be most helpful. I am glad that I posted this here for review, as I have made so valuable corrections. I will be sure to repost a completed version of the file, that is not outlined.\n\n"
    }
  ]
}
