{
  "id": "20289",
  "title": "Bulleted and numbered list that hang in the gutter",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": " ![](http://web.archive.org/web/20120630101757im_/http:/typophile.com/files/HangingBullets_6121.png)\n\n ![](http://web.archive.org/web/20120630101757im_/http:/typophile.com/files/HangingNumbers_4507.png)\n\nOkay, okay, forget the argument about how such things might hinder readability for their lack of differentiation from the body text matter.\n\nNow how exactly can you make them in InDesign or a page layout program? Because, rather ironically, I've had more success achieving them in MS Word.\n\n",
  "author": "brampitoyo",
  "time": "28 May 2006 — 8:38pm",
  "uid": "13047",
  "comments": [
    {
      "time": "28 May 2006 — 8:45pm",
      "content": "The secret is the \"Indent to here\" character (available via the contextual menu or cmd-\\).\n\n"
    },
    {
      "time": "29 May 2006 — 3:52am",
      "content": "Or a plus and minus left indent setting on style sheets/format. For example, if the bullet was to hang 2mm outside the left margin of the body text, all body text would be indented 2mm while bullet text would be lefthand indent 2mm, first line indent -2mm. With numerals (especially those that go above 10) you might want to include a right aligning tab so that they all align on the righthand side.  \nThis will mean that your text box should start 2mm before your lefthand margin and be 2mm wider than your measure.  \nFor shorter pieces of text (or for working out your layout) the indent to here character would solve the problem too.  \nTim  \n{edit I should have added that you will need to set the bullet as this – bullet\\_tab\\_copy or in the case of right aligning numeral – tab\\_numeral\\_tab\\_copy}\n\n"
    },
    {
      "time": "29 May 2006 — 5:58am",
      "content": "there is actually a \"cheat\" to this also.  \nit is not recommended for longer texts but it can come in handy at times. (I use it mostly to correct the left hand positioning of two lines of headlines when big capitals seem to have a bad vertical alignment.)\n\nbefore your hanging indent numeral or bullet, type a [space],  \nthen assign a massive negative tracking to that space (i.e. -1000)  \nand the numeral/bullet will indeed hang from the left hand side of your text frame.  \ncopy/paste this character ([space]) as neccessary.\n\nbest regards,  \ntobias\n\n"
    },
    {
      "time": "30 May 2006 — 12:33pm",
      "content": "Ah,\n\nSo, unlike the hanging punctuation, there really is no \"fair\" way to make the bullet sit outside the text box.\n\nThe \"indent to here\" button I knew. Negative tracking is quite handy.\n\nl'd still be mighty curious if someone here could find a more elegant solution to this problem.\n\n"
    },
    {
      "time": "30 May 2006 — 2:40pm",
      "content": "I do what Tim says. Separate style sheet for the list as for the running text.\n\n"
    }
  ]
}
