{
  "id": "20281",
  "title": "crown logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "here's a new logo i'm working on for a new trading card game company. i'm trying to tie the look of the logo into the comic book world, as the two industries are closely connected.\n\ni'm not very experienced with outline type designs, or drawing letters by hand for that matter, so any input would be most welcome.\n\nthe company name is crown hero games, or, crown hero for short.\n\n| Attachment | Size |\n| --- | --- |\n| [totypophile.png](http://web.archive.org/web/20150415090522/http:/typophile.com/files/totypophile.png) | 4.83 KB |\n| [totypophile2.png](http://web.archive.org/web/20150415090522/http:/typophile.com/files/totypophile2.png) | 5.53 KB |\n| [totypophile3.png](http://web.archive.org/web/20150415090522/http:/typophile.com/files/totypophile3.png) | 5.06 KB |\n\n",
  "author": "tyleryoung",
  "time": "28 May 2006 — 12:46pm",
  "uid": "2139",
  "comments": [
    {
      "time": "28 May 2006 — 1:33pm",
      "content": "It's very nice!  \nJust the \"r\" is weak. Try a UC form?\n\nhhp\n\n"
    },
    {
      "time": "28 May 2006 — 2:34pm",
      "content": "I agree with hrant, it's fun and young! I especially like that the letterforms flay out to the sides to imply the word 'hero' is coming out toward the reader in perspective. Young, kind of punky and in-your-face...appropriate for the video game market.\n\nBut the 'r' is not legible: it's too easy to see an 'n' or an 'm' that's closed on the lower right....hrant's idea of UC form there may be the ticket, but perhaps then it will be difficult to center the 'e/r' on the crown once the 'o' must connect to the 'r' from the bottom....?\n\nThe thing I think is least successful is the tagline type. First, try the tagline \"It's your turn\" without the period. Then, look at it without the \"It's\" altogether: just \"Your turn\" with and without the period.....Also, try to differentiate the company name from the tagline more: the company name should perhaps be in tracked out upper case against the more conversational and informal lower case above....\n\nAnd Frutiger (oops, I guess it's actually Myriad) is just so sort of corporate & wayfinding \"friendly blah\" to me for this kind of mark. Try something with more edgy personality (perhaps digital-ish?) and maybe not a sans (the mark's forms are sans)...\n\nFun work for not being \"experienced with outline type designs\"!\n\n"
    },
    {
      "time": "28 May 2006 — 3:52pm",
      "content": "thanks for your feedback on a sunday afternoon!\n\ni have tried versions with an UC r, and as you might predict, it makes the interior spaces in the logo look too busy, and worse, ruins the symmetry of the logo. i have succeeded in getting the UC r to join the o at the bottom, but it just aint workin for me.\n\ni like your suggestions, dish, for the tag. i love playing with tags. they're so cool. however, i'm still stumped on what face to use. i tend to think that for a logo like this, that is, a typographic one, that whatever face i use for the tag ought to be as plain as possible, so there is no conflict for graphical attention. i've thrown in some trajan here, simply because it's 'kingly' in its appearance, but i'm not sold on it by any means, as it really departs from the comic/pow look i'm trying to hit.\n\nnow, as for the r... i'm not sure i like this solution, or even if this is a solution. i do think that it brings out the r more, without destroying the o. still, the o looks more like a d than it did before.\n\nso here's where things get interesting: per the first version, i was banking on the 'recognizability' of the word hero to slip the reader over the problematic r. is this a horrible nono for logo design? i know that the concept is used all the time, as graphics sometimes replace critical letters altogether in other logo designs.\n\ni guess the point to focus on, is if something looks amateurish or not. if it looks like a mistake, or a weak point in the design, it is not the same thing as a well-executed graphic treatment of text, no?\n\n"
    },
    {
      "time": "28 May 2006 — 6:30pm",
      "content": "That's cool. I like the colours and I can read it. Plus it does have a comic feel. I can't see anything wrong with it. Sorry!  \nI would keep it sans serif.\n\n"
    },
    {
      "time": "28 May 2006 — 7:48pm",
      "content": "Tyler,\n\nI think I may have noodled out some interesting solutions for you while munching on dinner.......\n\nFirst, yes it's a problem to assume recognizability in a word instead of paying close attention to the actual letterforms as they exist on the page. Our minds play all sorts of tricks on us, and often what we assume may be the only reading of something turns out to be open to many readings....\n\nThis word in particular has few alternate readings though.....perhaps if someone was a big mythology buff, they may see Zeus' wife Hera, but probably not. Still, you can make the word more legible as is by:\n\nROUNDING THE COUNTER of the \"O\".\n\nInstead of focusing on fixing the \"r\", an easy solution to the legibility issue is simply to ignore the alignment with the crown's angle you were trying to repeat from the \"H\". Once it's round, three things can happen:\n\n1. The letter is instantly \"O\"-ish because you read the counter before the form since it stretches up to the right so far.  \n2. An interesting help occurs for the \"r\".....the counterform \"o\" also becomes a ball terminal for another \"r\" in the counterform!! Double the benefit...  \n3. The connection to the crown's angle can still be maintained by keeping the intersection of that angled line and the counterform as the \"spring point\" for the round counter.\n\nNow, on to the problem of tagline type:  \nI did several versions to show what I had in mind. Most are sans solutions and the last two are serifs.\n\n1. Close Call PM: techy video-game feel.  \n2. DIN: still techy, but more tailored and machined.  \n3. Briem Akademi: very video game score display-ish.  \n4. Charlemagne + Chapparal: You said you wanted the \"kingy\" aspects of Trajan.....Charlemagne is a little spikier and plays on the crown idea....but for those spikes to still read in the smaller company name, I used Chapparal.  \n5. Scala + Scala Sans: Still the spiky, thorny, crown reference, but more modern and engineered....and interesting \"W\" in the company name sans version.\n\nGotta get back to \"real\" work,  \nCheers and Happy Holidays!  \nDiSH  \n1.\n\n ![](http://web.archive.org/web/20150415090522im_/http:/typophile.com/files/Hero_DiSH_CloseCall_6717.png)\n  \n2.  \n\n ![](http://web.archive.org/web/20150415090522im_/http:/typophile.com/files/Hero_DiSH_DIN_6531.png)\n  \n3.  \n\n ![](http://web.archive.org/web/20150415090522im_/http:/typophile.com/files/Hero_DiSH_BriemAkedemi_6356.png)\n  \n4.  \n\n ![](http://web.archive.org/web/20150415090522im_/http:/typophile.com/files/Hero_DiSH_CharleChapa_3919.png)\n  \n5.  \n\n ![](http://web.archive.org/web/20150415090522im_/http:/typophile.com/files/Hero_DiSH_Scala_5532.png)\n\n"
    },
    {
      "time": "28 May 2006 — 8:42pm",
      "content": "\"Herd\"? Kind of the opposite of hero, no?  \n(Actually, I'm mostly kidding. Mostly. :-)\n\nhhp\n\n"
    },
    {
      "time": "28 May 2006 — 10:10pm",
      "content": "HA! True, hrant....actually, now that I look at it again and that vertical line is no longer in the bowl of the \"O\", it makes the \"H\" seem unnecessarily thick to me.\n\nHe should probably give up on the symmetry and look at it with the bottom flattened out, the capital \"R\" you suggested, and leave the \"O\" be off center to the right. Then the taglines could be put to the right of the mark instead of below, or at least below and to the right...\n\n"
    },
    {
      "time": "3 Jun 2006 — 2:18am",
      "content": "I like the base (tag) text of version 1. I personally think the \"Hero\" text is unreadable.\n\n[Communication Design, Melbourne](http://web.archive.org/web/20150415090522/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "3 Jun 2006 — 7:03pm",
      "content": "Make Your Turn after Crown Hero Games. It should read: Hero, Crown Hero Games, Your Turn\n\n"
    },
    {
      "time": "24 Jun 2006 — 1:48pm",
      "content": "To me, it seems as though the logo is best without the tagline, and then when you want to include it, you should have huge 3D text in vibrant colours, maybe with the crown sitting on the end of the letters.\n\n"
    }
  ]
}
