{
  "id": "20298",
  "title": "Microsoft ClearType fonts released!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Microsoft published a public beta version of their new Office 2007 suite for Windows.\n\nOne interesting point is that Office 2007 includes all the OpenType fonts from the Microsoft ClearType collection ( [http://www.microsoft.com/resources/design/ClearType.html](http://web.archive.org/web/20140307100925/http:/www.microsoft.com/resources/design/ClearType.html \"http://www.microsoft.com/resources/design/ClearType.html\") ): Calibri, Cambria, Candara, Consolas, Constantia, Corbel, as well as Segoe UI, Microsoft's new user interface font that was disputed to be a Frutiger rip-off. All the fonts include Latin, Cyrillic and Greek characters with advanced typographic OpenType features, some include characters from additional scripts.\n\nOne highlight of Office 2007 is the new math typesetting engine in Word. It consists of the Cambria font that has a large mathematical character set, and a fully new \"equation editor\" which is seamlessly integrated into new Office applications and allows mathematical input using various text encoding schemes, including a syntax very similar to TeX as well as MathML.\n\nThe current beta version of Office 2007 will run until February 2007 and is available free of charge to anyone interested:  \n [http://www.microsoft.com/office/preview/default.mspx](http://web.archive.org/web/20140307100925/http:/www.microsoft.com/office/preview/default.mspx \"http://www.microsoft.com/office/preview/default.mspx\")\n\n(The download is rather large though, at least 450 MB).\n\nRegards,  \nAdam\n\n",
  "author": "twardoch",
  "time": "29 May 2006 — 11:42am",
  "uid": "1133",
  "comments": [
    {
      "time": "29 May 2006 — 11:45am",
      "content": "(BTW, unfortunately, the actual support for OpenType Layout features in Word 2007 does not seem to be much different from that of Word 2003.)\n\n"
    },
    {
      "time": "29 May 2006 — 2:28pm",
      "content": "from Adam's email to the OpenType list: \"Unfortunately, neither Word nor PowerPoint 2007 seem to be actually using any of the user-controlled OpenType features included in these fonts (such as smcp, onum, ss01, hist , dlig, swsh etc.). For example, \"small caps\" in Word 2007 still produces fake small caps. I guess this means that we won't see support for user-controlled OpenType Layout features in Office within the next four-five years or so, which is a pity.\"\n\nMore than a pity, but what can you do? I guess Microsoft thinks they can do whatever they want when they want. It'd be great if one of the freesource office packages would implement OT layout feature support before they got it into Word and then caught on with the public. Ah well, i can dream, can't i?\n\n"
    },
    {
      "time": "30 May 2006 — 1:53am",
      "content": "\\> I guess Microsoft thinks they can do  \n\\> whatever they want when they want.\n\nNo, I don't think it's that. This version of Office really has very dramatic changes in handling graphics, the user interface, interoperability between the applications, and the file format. I guess there was not enough power and time left for them to deal with typography on top of that.\n\nA.\n\n"
    },
    {
      "time": "30 May 2006 — 5:59am",
      "content": "Typography, the last frontier. :-)\n\nChrisL\n\n"
    },
    {
      "time": "30 May 2006 — 6:24am",
      "content": "I understand that the package consists of a number of programs, as usual, but do I understand correctly that the surmise is that they released a text editing program and there wasn't time to deal with typography ? While a picture is worth a thousand words, I still feel that text is the medium, and the main focus of their office packages, that passes the imformation to the reciprient. More time should have been given to this area even before a beta was released. Of course the mathematical equation editor will more than adequately compensate for poor type handling.\n\n"
    },
    {
      "time": "30 May 2006 — 6:31am",
      "content": "Graham makes a good point. Microsoft Word is a WORD processor not a picture processor. Microsoft says it is comitted to multilingual support and Opentype support is a big help in that area. Seems like priorities got a bit mixed up there.\n\nChrisL\n\n"
    },
    {
      "time": "30 May 2006 — 6:40am",
      "content": "Ahh, I got it. We live in the digital age, and so we must type our documents in digits, thats what the equation editor must be for. Gee, those microsoft boys and girls are quick, they realise the redundancy of type is near at hand.\n\nI give it my vote of confidance, with my new voting style, two digits up.\n\n"
    },
    {
      "time": "30 May 2006 — 6:44am",
      "content": "What I’m concerned with is that kerning is still disabled by default in Word 2007. That’s absurd.\n\nI definitely agree that improvement in text handling should have been the main focus of Word. Since the file format is changing and many other things are happening, it would have been a good chance to revamp the typographic support. With all those changes, issues of document reflow would have been acceptable, I think. Of course, Word does support OpenType Layout in principle. The Arabic/Indic stuff, composition/decomposition and the math stuff all works using OpenType Layout. But we’d appreciate support at least for contextual alternates, standard ligatures, small caps, superscripts/subscripts and perhaps alternate figure styles.\n\nA.\n\n"
    },
    {
      "time": "30 May 2006 — 6:52am",
      "content": "Adam, you obviously have seen, and used the program, Seriously, is it really much improved and user friendly than earlier versions, even with the obvious shortcomings ? Is the promise there of making it worthwhile updating by the general and average user ? Or have they done what they have been guilty of before by just shoving extra features in a current package, creating more headaches to those who buy the product with the unending patches and fixes.\n\n"
    },
    {
      "time": "30 May 2006 — 7:12am",
      "content": "_No, I don’t think it’s that..._\n\nhmmm... I guess i should have looked at the new applications first. I'm just baffled by the seeming diconnect where Microsoft pays big $$$ to develop feature-rich OT ClearType fonts, and then does nothing to implement layout feature support in their basic applications (MS Office). I guess I'm disappointed, because it is my belief that OT will not really catch on with the general public until they have a chance to see what it can do for THEM. For a majority of PC users, this means that standard programs (such as Office) must support the layout features. I guess we have to wait 2-3 more years to get the word out about what _we_'ve been doing now for several now.\n\n"
    },
    {
      "time": "30 May 2006 — 8:21am",
      "content": "<cite>I’m just baffled ...</cite>\n\nThe discrepancy of fonts that offer OT features and applications that ignore them is really astonishing. I also agree on the second point -- OpenType will have its breakthrough not before Windows & Office applications make it available to literally everybody. Apple's own OpenType support in OSX 10.4 is rather infant too, no contextual substitution. And unless at least the major system and application developers offer text engines which give same results, and more consistent user interfaces to access typographic features, OpenType will remain a toy of a few nerds.\n\nMy Office 2007 download refuses to install, and I was so curious to see the fonts ...&nbsp;&nbsp;:(\n\n"
    },
    {
      "time": "30 May 2006 — 8:48am",
      "content": "_OpenType will have its breakthrough not before Windows & Office applications make it available to literally everybody._\n\nMicrosoft isn't the only game in town.  \nMyfonts reaches a broader market than the design industry (such clear-cut disctinctions are becoming obsolete, anyway), and its marketing sophistication is growing. Now indie foundries can launch new fonts there, advertise them on \"posters\", with time-limited special offers, and hype OpenType features as product benefits, and it's already worked for at least one typeface. The missing link here is an adequate interactive online \"type tester\" which shows the different OT features that a font may have; once that is in place at online font distributors, then we will see a real breakthrough.\n\n"
    },
    {
      "time": "30 May 2006 — 9:56am",
      "content": "Hi Nick! I think the decision of acceptance or non-acceptance of OpenType is made by systems and applications, not by fonts. As long as only a handful of special interest apps (Creative Suite, XPress, Mellel)\\* give access to typographic features, a font tester could be helpful but would have the taste of a test tube. However, if applications would show these options in their interfaces, one could try them in documents one creates anyway, and maybe find them be USEFUL. And finally ask how it comes that some fonts DON'T have these features.  \nSo, I appreciate a lot that Microsoft added typographic features to ClearType fonts, and find it the more disappointing that they \"hide\" them in their own applications.\n\n\\* Yesterday I wanted to add Apple's OSX 10.4 apps to the list but then recognized some serious shortcomings. One would have to explain for every single feature: this works, this doesn't. Then better not mention them at all ...\n\n"
    },
    {
      "time": "30 May 2006 — 12:03pm",
      "content": "Hi Karsten.  \nThe distinction is between a dominant corporation, Microsoft, not pushing the use of OpenType's \"typographic\" features, and the market, using OT-supporting Adobe applications (and now Quark), pulling it.  \nEven though Adobe doesn't mention type on its home page, its applications which support OT features are used by millions of people -- many of whom are not professional designers.\n\nThe way I understand it (from a MS video documantary), Bill Gates' support of funding for the ClearType project was predicated on the type making a difference (or some such words), ie something that could be measured. Hence the readability claims of 5% faster for CT. The multi-language support of CT is a no-brainer for a multi-national corporation. The 'typographic\" features of CT -- now how would they be justified to engineering and marketing criteria? It seems they were snuck in. Perhaps the rationale was keeping pace with Adobe.\n\n"
    },
    {
      "time": "30 May 2006 — 1:31pm",
      "content": "Except Adobe doesn't make screenfonts.\n\nhhp\n\n"
    },
    {
      "time": "30 May 2006 — 2:53pm",
      "content": "What are the version numbers of \"your\" fonts?\n\nI got this Office Beta from a german computer magazine, and the package contains:  \n- the 6 new C-fonts (Cambria, Calibri, etc.) in version 0.95  \n- Segoe UI in version 0.97\n\nsebastian\n\n"
    },
    {
      "time": "31 May 2006 — 7:05am",
      "content": "\\> Seriously, is it really much improved and user  \n\\> friendly than earlier versions, even with the  \n\\> obvious shortcomings?\n\nI think it's at least interesting. I had to do some looking around in the new UI of Word to find what I wanted but once that is done, I believe the new UI is more productive. They have done good work, especially the live preview stuff is very impressive (you hover the mouse over the font size or name and the entire layout of the page changes to show you what it will look like, same for table styles etc.). Excel's new charting features and table auto-formatting is also very pleasant. They have actually hired designers to do it this time. I'm not entirely fond of the new graphic treatment of the UI but I think I'll get used to it. It's better than the cheesy Windows XP user interface.\n\nOn the other hand, I've seen where the Windows Vista UI is heading and it's a nightmare. Not only it's completely different from Office 2007, it's also an overcomplicated mess.\n\nA.\n\n"
    },
    {
      "time": "31 May 2006 — 7:08am",
      "content": "\\>The multi-language support of CT is a no-brainer for  \n\\>a multi-national corporation. The \"typographic\" features  \n\\>of CT — now how would they be justified to engineering  \n\\>and marketing criteria?\n\nAs a translator and editor who has seen thousands of Word files  \nover the years, I have to agree. Not once have I seen small caps,  \nfaux or otherwise. Demand for this feature among Word  \nusers must be almost zero.\n\n"
    },
    {
      "time": "31 May 2006 — 7:11am",
      "content": "_Not only it’s completely different from Office 2007, it’s also an overcomplicated mess._\n\nso it's gone to AO-Hell, eh? too user-friendly for its own good?\n\n"
    },
    {
      "time": "31 May 2006 — 7:13am",
      "content": "Smallcaps (especially real ones) are indeed almost never used.  \nSad but true - so something we should wake up to and design/price accordingly.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2006 — 7:16am",
      "content": "_so something we should wake up to and design/price accordingly._\n\n???\n\n"
    },
    {
      "time": "31 May 2006 — 7:18am",
      "content": "_Smallcaps (especially real ones) are indeed almost never used._  \nI think that Roman Small Caps fonts should replace Bold Italic fonts across the board. \\>^p\n\n"
    },
    {
      "time": "31 May 2006 — 7:36am",
      "content": "\\>Smallcaps (especially real ones) are indeed almost never used.\n\nIt is my impression that small caps a still often used in display, eg on book covers. I think they are a very valuable option for the designer. What are others' impression of how often small caps are used?\n\n\\>Demand for this feature among Word  \nusers must be almost zero.\n\nThe way word is set up--with easy short cuts for italic, bold, but not small caps--discourages their use. Also that they are quite often fake (are they always?), and don't look so great would further discourage their use. If they were good and easily accessible, they might be used often for display, at the very least, by Word users.\n\n"
    },
    {
      "time": "31 May 2006 — 7:42am",
      "content": "Small caps are rarely used in Word because they are either not available or buried. Small caps are used by the publishing/design community on page layout apps. A few years back pictures were not available in word processors either. The developers did not add them because their data showeed that users used them already, they did it to offer a feature which was new to the program. If you build it, they will come. Today word files are riddled with a bonanza of clip art and other visual splendors. I wish they would add a new feature to Word files called \"DeCrappify\" which would delete all the visual kaka and plain vanilla the formatting but keep italics and bolds. Adding small caps and OSF would actually help editors communicate with designers though and actually make work flow easier.\n\nChrisL\n\n"
    },
    {
      "time": "31 May 2006 — 7:47am",
      "content": "william berkson: my own impression is that SC get very rarely used in switzerland, even in comparsion with use in the anglosaxian countries.\n\n"
    },
    {
      "time": "31 May 2006 — 7:54am",
      "content": " ![](http://web.archive.org/web/20140307100925im_/http:/typophile.com/files/word2007dash_pdh_4561.png)\n\nHere's a screenshot of the Word 2007 default dashboard. As you can see, you can get Bold, italic, strikethrough, superiors, inferiors, change case all from easy to access buttons (albeit faux formatting in some cases). There should be a smallcaps and and all caps button right there. As it is, you have to click on the tiny link on the font menu to access these formatting options and in the case of smallcaps, these are faux smallcaps. I think if we gave easier access to real formatting, we would see (somewhat) more typographically sophisticated Word documents.\n\n"
    },
    {
      "time": "31 May 2006 — 9:56am",
      "content": "\\> small caps ... are a very valuable option\n\nTo the right people. Which is why if/when you  \nmake them you should price them much higher.\n\n\\> Small caps are used by the publishing/design community on page layout apps.\n\nFew of them. Fake smallcaps (including when the font has smallcaps available <cite>right there in the computer</cite>) are the crushing majority, whether in small projects or large ones - like the monumental lettering on new buildings at UCLA, or around the \"display fountain\" at Paseo Colorado. One single jet in that fountain costs more than doing proper smallcaps, but it just doesn't happen. Education has to come first. Until then, you shoot for the pinnacle of users only.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2006 — 11:59am",
      "content": "I mentioned in an earlier thread that the [B] button in Word is the 5th most used 'feature' (after copy, paste, save etc.,) in the product. So if a SC button was on there by default I think small caps would be much more widely used - but even if they were not always fake would that be a good thing? I don't know.\n\n"
    },
    {
      "time": "31 May 2006 — 12:04pm",
      "content": "Not only for Word, but for any app offering any button-based style options: Offer a Sc button alongside others. Gray it out when real small caps are not present for the font selected. Then there can be no fake small caps. I'd rather not offer the option to make fake ones, if it trained users to be aware of what they even are.\n\n"
    },
    {
      "time": "31 May 2006 — 12:31pm",
      "content": "\\> Gray it out when real small caps are not present for the font selected.\n\nDude, you have any idea how much money that would cost  \nin support calls?! :-/ When people don't know the difference,  \nthey'd very much like the fake ones, thank you very much.  \nOr they'll \"vote with their pocketbooks\", as the sickly but  \naccurate saying goes.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2006 — 12:49pm",
      "content": "Vote with their pocketbooks? Can you name a wordprosessor that has 1% of the market except for Microsoft? Word Perfect is so far gone it needs a walker to move.\n\nChrisL\n\n"
    },
    {
      "time": "31 May 2006 — 1:21pm",
      "content": "Well, my new Dell laptop came with a trial version  \nof WordPerfect pre-installed, and it keeps asking me  \nto pay up. I won't, but some people definitely will.\n\nhhp\n\n"
    },
    {
      "time": "31 May 2006 — 3:08pm",
      "content": "\"Dude, you have any idea how much money that would cost  \nin support calls?\"\n\nSimply offer a voice option for that issue that drops the caller at a message saying \"You have now entered the 21st century. You are now using typography. Congratulations. Have a Nice Day.\" [click]\n\nDo Word users really crave small caps? Simon?\n\n"
    },
    {
      "time": "31 May 2006 — 5:40pm",
      "content": "Is my observation correct that in Word 2007, kerning is off by default, and default lower threshold something like 11pt? I activated kerning and wanted to set the minimum to zero, but Word doesn't accept less than 8pt. Why?\n\n{edit 10 July 2006: Indeed it \\*is\\* possible to define lower thresholds, even down to 1pt or 0pt. But not by using up/down arrows, only by typing the value. And it seems to work.}\n\n"
    },
    {
      "time": "31 May 2006 — 6:05pm",
      "content": "I was intrigued to discover that shadow, outline, emboss and engrave effects are right in there with small caps in Word 2007. eek!\n\nT\n\n"
    },
    {
      "time": "31 May 2006 — 6:28pm",
      "content": "well, if they're faux small caps, that's prolly where they belong!\n\n"
    },
    {
      "time": "1 Jun 2006 — 12:41am",
      "content": "How about not graying the small cap button but instead updating all the default fonts with true small caps? And while they’re at it, old style figures. Now imagine Comic Sans like this, the variety all the publications would gain…\n\n"
    },
    {
      "time": "1 Jun 2006 — 3:15am",
      "content": "\"How about not graying the small cap button but instead updating all the default fonts with true small caps?\"\n\nThat's smart. So forget it. :)\n\n\"but even if they were not always fake would that be a good thing?\"\n\nYes. From a typographic point of view, it would be good if the small caps were not always fake.\n\n\"Or they’ll “vote with their pocketbooks”\"\n\n:) MS clustomers do not vote with their pocketbooks on bundled items.\n\n"
    },
    {
      "time": "1 Jun 2006 — 3:47am",
      "content": "I can't see why small caps should not work as the italic and bold buttons do: you get true italics and bold if they are available, and faked ones if not. Admittedly, the faked ones look dreadful and a surprisingly large number of users don't seem to notice (one constantly sees faked bold-italic monotype garamond). But the behaviour seems at least sane: the user gets the best typographical form of the font style s/he wants that is available.\n\n"
    },
    {
      "time": "1 Jun 2006 — 4:17am",
      "content": "Wow, there are some serious improvements. I really like the way hovering on font names in the font selection list actually changes the selected text. Unfortunately there are some serious issues. Like you said there's not access to advanced features, no use of real small-caps whether it is throught font variant or OT feature. There are still only 4 styles (mixed up with weights) recognized.\n\n"
    },
    {
      "time": "1 Jun 2006 — 5:46am",
      "content": "I suppose Word will always pander to the lowest common denominator in this way simply because practically everybody has/uses it. And if everybody has/uses it, it's perfect for files that lots of people work on and then send around amongst each other. To do a document in Quark or InDesign it's assumed you care about design (to do a document in TeX it's assumed you care about technical accuracy); but the greater the number of people working on a Word file, the greater the likelihood that some of them don't care about design and/or know how best to use Word's features to achieve good design.\n\nThe 'Small caps' control has been around for ages, even if it does apply faux small caps and is not smart enough to know when real ones are installed (either as OT features or in a separate font file), but like many other potentially useful features it's not on the default formatting toolbar so a lot of non-expert users know nothing about it. It would also help if the default formats of the styles \"Heading 1\", \"Heading 2\", \"Heading 3\" etc were a little less ghastly.\n\nPerhaps the installation routine should include a dialog box saying \"Do you give a rat's nipple about typographical design?\" and if you say \"Yes\" it switches on kerning, and visibility of non-printing characters, and 'do-full-justification-like-wordperfect-6.x-for-Windows' and only gives you bold/italic/smallcaps options if there are appropriate variants available (and, when used, the buttons automatically apply an 'emphasis' or 'strong' character style or whatever), and switches OFF all autoformatting options and... well you get the idea. And if you say \"No\" it says \"Are you sure?\" and links you to a copy of Bringhurst on Amazon.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "1 Jun 2006 — 5:51am",
      "content": "Dav,  \nLOL!!! Thanks for that witty and true post! and link me to the \"rats azz\" button :-)\n\nChrisL\n\n"
    },
    {
      "time": "1 Jun 2006 — 6:05am",
      "content": "\\> MS clustomers do not vote with their pocketbooks on bundled items.\n\nBut Word isn't bundled [all the time]. Like I said, my computer  \nfor one wants to sell me WordPerfect instead. Don't get me wrong  \nthough, I'm all for preventing voting, especially with money!\n\nhhp\n\n"
    },
    {
      "time": "1 Jun 2006 — 6:33pm",
      "content": "_I guess Microsoft thinks they can do whatever they want when they want._\n\nLet's be specific here: the Microsoft _Office_ group has made a decision not to add OpenType Layout support for quality typography in European scripts in this version, despite the efforts of a lot of people within Microsoft to persuade them otherwise. I'm very frustrated about this. [Support for OpenType Layout for complex script shaping in Office, on the other hand, has been far ahead of any major competition for years: the multilingual aspects of OpenType are very much supported.]\n\nBut one shouldn't represent Microsoft as some kind of giant monolithic entity. The major program groups within Microsoft operate in many respects like separate companies.\n\n"
    },
    {
      "time": "2 Jun 2006 — 2:40am",
      "content": "\\> one shouldn’t represent Microsoft as some  \n\\> kind of giant monolithic entity\n\nThat's obvious. Even within \"monolithic\" companies there are different opinions, often contradictory. It's naiive to think otherwise. Decisions are not made by companies, they're always made by specific managers responsible for specific things.\n\nI agree with John that the lack of support for user-controlled OpenType Layout typographic features in Office 2007 is a big disappointment.\n\nA.\n\n"
    },
    {
      "time": "2 Jun 2006 — 7:57am",
      "content": "\"...the lack of support for user-controlled OpenType Layout typographic features in Office 2007 is a big disappointment.\"\n\nSo say we all :-( Typography, children of a lesser God.\n\nChrisL\n\n"
    },
    {
      "time": "2 Jun 2006 — 8:52am",
      "content": "But Adam, when a manager makes a decision that doesn't sit  \nwell with the shareholders, he usually isn't allowed to make  \nmore decisions in that corporation... :-/\n\nhhp\n\n"
    },
    {
      "time": "2 Jun 2006 — 8:59am",
      "content": "Somehow, I doubt that Microsoft's shareholders care much about typography.\n\n"
    },
    {
      "time": "2 Jun 2006 — 9:04am",
      "content": "Shareholders by definition don't care about anything except a return on investment (which is in fact the Achilles Heel of publicly-owned companies: the product is secondary). This doesn't mean individuals at such coporations can't do any good, but it means that it must be a good that can't be shown to hurt the bottom line - and very often that means it's a good that needs to go unnoticed (except by nuts like us). Even in a type-centric place like Adobe, when Thomas for example evangelizes and implements good typographic features, he does so <cite>in spite</cite> of the \"corporate culture\" that puts bread on his table. Keep it up, Thomas!\n\nhhp\n\n"
    },
    {
      "time": "2 Jun 2006 — 2:40pm",
      "content": "Sometimes good typography is good business. Sometimes it's still good business, but it is hard to prove that it is so.\n\nAlthough there is a focus on profits at a large corporation, this may also be described as \"giving the customers what they want.\" Despite any occasional barriers here, I am sometimes surprised and gratified by the strength of internal support for good typography at Adobe.\n\n"
    }
  ]
}
