{
  "id": "20291",
  "title": "Cooks Junior",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’ve been working on this for not to long, and I’m wondering what you all think about it. Cooks Junior will be a new local PBS program with targeted at parents with recipes that parents can do with their kids, with connections to chemistry, math, ect. I’ve been thinking about the speach bubble motif, which granted, is extremely overused, but tried to make it cleaner but still playfull witht the colorblock for the “junior” text. I’ve so far chosen Gotham for “COOKS” and I’m not sure whether to use either Mrs Eaves or Base 9 for the “junior” text. Which set up do you prefer? also, any other type suggestions would be appreciated\n\n| Attachment | Size |\n| --- | --- |\n| [cj02\\_FINAL.pdf](http://web.archive.org/web/20060630195118/http:/typophile.com/files/cj02_FINAL.pdf) | 191.16 KB |\n\n",
  "author": "<a href=\"user/7571\" title=\"View user profile.\">alexhb</a>",
  "time": "<br>",
  "uid": "7571",
  "comments": [
    {
      "time": " 29 May, 2006 - 8:31am",
      "content": "Looks good! Here are a couple of things I noticed:\n\n1. I’d try A but putting “cooks” in lower case and junior in caps (leave it as is). That way, you give some kind of “power” to the word junior (making the kids part more important and making them feel important - even if the show is aimed at the parents). Actually, its kind of the opposite of the cliché (junior in lowercase, bla bla bla), It could give something interesting.\n\n2. Less space between cooks and junior and less space in the black bubble, around the type.\n\n3. The little curvy thing on the bubble doesn’t look “cartoonish” enough. Maybe you can simplify in by reducing the curve and getting rid of that pointy tip (slightly rounded tip could work)\n\n4. The colors work, but I think that the desired effect may be lost as you have an odd number of letters. I would try different tints of green without repeating the same swatch.\n\n5. Tighten up the kerning between “OR” in JUNIOR (and between “KS” in cooks if you leave it in caps)\n\nI like the fonts you chose for option A.\n\nKeep it up!\n\n"
    },
    {
      "time": " 30 May, 2006 - 2:11pm",
      "content": "I love Tarzanna, it works\n\n"
    }
  ]
}
