{
  "id": "20299",
  "title": "Simoncini Garamond",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello!\n\nI discovered this wonderful online community recently, and figured I would make my first post. I am currently a student studying graphic design, and have a quick question regarding a specific typeface.\n\nThis semester in school, we worked with Simoncini Garamond for a study. I found this typeface to be very beautiful, and a very distinctive revival of Garamond. I've been trying to research its history to learn more about this typeface, but have not been able to find much information. I looked in one of my textbooks, The Elements of Typographic Style, written by Robert Bringhurst, and all he mentions about this typeface is that it was designed by Francesco Simoncini in 1958. Does anyone know more about this typeface?\n\nAlso, I was just curious what your favorite revival of Garamond may be. I'm glad I have found a site where one can converse to other type enthusiasts!\n\nJustin Clapp\n\n",
  "author": "<a href=\"/web/20110119004929/http://www.typophile.com/user/11752\" title=\"View user profile.\">justinclapp</a>",
  "time": "<br>",
  "uid": "11752",
  "comments": [
    {
      "time": "",
      "content": "[http://typophile.com/wiki/Garamond](http://web.archive.org/web/20110119004929/http:/typophile.com/wiki/Garamond \"http://typophile.com/wiki/Garamond\")\n\nI like Sabon and I’d like Adobe Garamond Premier Pro, despite it’s name. Simoncini is very nice, too. I think there was a thread about it already but I couldn’t find it.\n\n"
    },
    {
      "time": "",
      "content": "Hi Justin,  \nSimoncini Garamond is, as perhaps you know, based on the work of Jean Jannon rather than Claude Garamond. Jannon is surprisingly well-served by modern revivals: Storm Jannon, Lanston Garamont and Monotype Garamond are all excellent, and there are others too. Jannon was a great type designer, if anything somewhat underrated. His work seems to me the most beautiful of the Baroque period; full of subtle distortions, it is sophisticated rather than serene, polished rather than pure.\n\nClaude Garamond himself has a great reputation, and is well-served by Adobe Garamond Premier Pro. He apparently designed his roman working from a copy of <cite>De Aetna</cite>, set in the Italian Francesco Griffo's half-complete final roman; rather suspiciously, he consistently chose the most unusual of Griffo's variant forms as his model, though he also eliminated most of Griffo's structual quirks and reduced his serifs, leaving what seems to me a less interesting kind of type. I like his italics better; they are revived in Stempel Garamond.\n\n"
    },
    {
      "time": "",
      "content": "George,\n\nThank you so much for the information! I learned about Francesco Griffo in a class studying the history of graphic design. There is so much more I want to learn though. Do you recommend any books or sources on the history of type design and typography?\n\nI have enjoyed \"A History of Graphic Design\" by Meggs. I found it quite interesting and very informative. I also had to read \"The Elements of Typographic Style\" for school, which was a great book. I'd love to find a great book focused specifically on the history of typographics though.\n\nJustin :)\n\n"
    },
    {
      "time": "",
      "content": "The normal reading list would include Lawson's <cite>Anatomy of a Typeface</cite>, Updike's <cite>Printing Types</cite>, Carter's <cite>A View of Early Typography</cite>, Tracy's <cite>Letters of Credit</cite>, and another Carter's <cite>20th Century Type Designers</cite>.\n\n"
    },
    {
      "time": "",
      "content": "To me the most interesting thing about Simoncini's Garamond  \nis that they <cite>still</cite> deny it's not a Garamond. The description on  \nMyFonts is hysterically apologetic (well, to a type geek).\n\nJannon: I'm not impressed. That \"a\" for one. Gag me with a typecasting ladle.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Really? My impression is that Jannon was doing with his romans something like Granjon and his C17th Dutch imitators did with italics, pushing each letter a bit off balance in order to render the precarious overall balance of the whole alphabet pleasurable and readable. I agree that Simoncini Garamond has an ugly a, but Storm Jannon's is much better, and his is apparently the most accurate revival. I'd like to find out more about Jannon - does anyone know of a really good reproduction or analysis?\n\n"
    },
    {
      "time": "",
      "content": "\\> pushing each letter a bit off balance in order to ...\n\nI think he was just sloppy.  \nFleischmann, now there was the real deal.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "[http://www.garamonpatrimoine.org/coupures\\_presse/bibliomosley.html](http://web.archive.org/web/20110119004929/http:/www.garamonpatrimoine.org/coupures_presse/bibliomosley.html \"http://www.garamonpatrimoine.org/coupures\\_presse/bibliomosley.html\")\n\n"
    },
    {
      "time": "",
      "content": "[http://museum.antwerpen.be/plantin\\_moretus/images/groot\\_03.jpg](http://web.archive.org/web/20110119004929/http:/museum.antwerpen.be/plantin_moretus/images/groot_03.jpg \"http://museum.antwerpen.be/plantin\\_moretus/images/groot\\_03.jpg\")\n\n"
    },
    {
      "time": "",
      "content": "**Obviously Beatrice Warde has written about him, and in issues 21–24 of the Printing Historical Societys Bulletin there's a serie of articles by Hugh Williamson about Jean Jannon of Sedan – the man man who was so much more than the man who was not Garamond. I believe it was meant to become some sort of book, but I haven't found it. Perhaps the articles have been published somewhere more accessible since then (1987–1988).**\n\nƒ\n\n"
    },
    {
      "time": "",
      "content": "Great! Thanks both of you.\n\n"
    },
    {
      "time": "",
      "content": "I love Storm's Jannon faces. The stormtype.com site has some information on Jannon. Bringhurst discusses the Jannon/Garamond issue in some detail in Elements but I believe his book was written before the Storm faces came out. Storm's Jannon Text Moderne is attactive and highly readable.\n\n"
    },
    {
      "time": "",
      "content": "\\> I’d like to find out more about Jannon - does anyone know of  \n\\> a really good reproduction\n\nGeorge, do you know this book?  \n [Les Caractères de l'Imprimerie Nationale](http://web.archive.org/web/20110119004929/http:/www.amazon.com/gp/product/2110810858/ref=olp_product_details/102-9727089-9661743?%5Fencoding=UTF8&v=glance&n=283155)\n\nIt shows Jannon's roman and italic (caracteres de l'Universite) in all sizes:  \n6, 7, 8, 10, 11, 12, 13, 14, 16, 18, 20, 24, 28, 36 point\n\nIt also includes other typefaces of the collection that once was at the Imprimerie Nationale in Paris, like the Roman du Roi\n\n"
    },
    {
      "time": "",
      "content": "FYI, a great RdR thread:  \n [http://typophile.com/node/6411](http://web.archive.org/web/20110119004929/http:/typophile.com/node/6411 \"http://typophile.com/node/6411\") \\_  \nContinued here: [http://typophile.com/node/7177](http://web.archive.org/web/20110119004929/http:/typophile.com/node/7177 \"http://typophile.com/node/7177\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Thanks Wolfgang, I now have the book and it's good stuff.\n\n"
    }
  ]
}
