{
  "id": "20306",
  "title": "First font, Dream of Dusseldorf",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "hi all—  \ni'm nervously posting my first font here. well, a jpg anyway. a super simple sans serif, designed to get used to fontlab really. i must say ive thouroghly enjoyed the process — very captivating indeed.\n\ninterested in getting some feedback on characters etc here.\n\nthanks.\n\n ![](http://web.archive.org/web/20150123095421im_/http:/typophile.com/files/dod_5801.gif)\n\n",
  "author": "type.forcetwelve",
  "time": "30 May 2006 — 4:48am",
  "uid": "13125",
  "comments": [
    {
      "time": "30 May 2006 — 5:06am",
      "content": "Nice one.\n\nWould I know that was a 'D' if the 'O's weren't there?\n\n"
    },
    {
      "time": "30 May 2006 — 5:32am",
      "content": "Great font. This is probably a dumb question but is it monospaced?\n\nTo me the L and F have some strange spacial weirdness happening which is making them look less balanced than the other letters. The A and the V seem slightly off too, maybe rounding the inside top intersection like the O would work or maybe having the diagonals begin lower on the V and higher on the A?\n\nThe 4 (maybe because of the diagonal) looks too wide. Also the bold at sign looks a little crowded.\n\nThe J is really great.\n\n"
    },
    {
      "time": "30 May 2006 — 5:43am",
      "content": "I love it, but I think just \"Dusseldorf\" would make a better name. You could use dream to specify the font; \"Dusseldorf Snooze\" for the thin type & \"Dusseldorf Dream\" for the bolder one. And if you decide to do a black version of the font, you could always call it \"Dusseldorf R.E.M.\" ;-)\n\n"
    },
    {
      "time": "1 Jun 2006 — 12:53am",
      "content": "thanks for the feedback guys! some great points to explore there thanks colin.\n\nmy design teacher always told me \"never trust a font named after a city\"... seems i've gone full circle.\n\n"
    },
    {
      "time": "5 Jun 2006 — 1:54pm",
      "content": "I think a stronger/longer spur on the Q would be good. The Joins are get messy like at the top of the A, The base of the W, Top of the M. The letters can look cleaner if you tweak them. I like your J too but I would like the top to be slighty less long. It would be funkier that way. I think the 4 is weak. I think it needs to be tweaked or redone. I think a stronger bend in the left top curve would do it.\n\n"
    }
  ]
}
