{
  "id": "20336",
  "title": "AC/DC logo.",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi.\n\nMy question regarding this subject is double.  \nFirst obviously, clarify who designed the logo  \nand if it was ever turned into a whole typeface?  \n [http://www.ac-dc.net/](http://web.archive.org/web/20131021023331/http:/www.ac-dc.net/ \"http://www.ac-dc.net/\")\n\nMy second questions is a bit more legally-wise.  \nThis is a wellknown logo,  \nand it is easy to see it around,  \nbeing sold printed to t-shirts aand other parafernalia.\n\nIs all this merchandising legal?  \nHas the use of the logo a liscence agreement with the designer?  \nIs it ilicit to use it with out previous consent from the band or the designer?\n\nit is not like i am going to open a \"club de fans of AC/DC\"  \nand sell merchandising of them to make a living.\n\nAll this questions are for better knowledge of subject,\n\nHere the last follow up questions,  \nis until what point is it legal or ilegal tu use this or another logo,  \nand tweek it for a new design.\n\nIn my case, i have designed a t-shirt for a limited editions brand in NY  \nand have used the same letterstyle to create a satire or parody,  \nas asked by my clientes... Basically I was asked to change AC/DC to AD/HD...  \nNow the cliente and friends want to printed for a limeted edition of 120 Tshirts,  \nbut are unsure about if it is legal or not.\n\nPlease let me know your thought and share your knowledge about subject.  \nSurely Miss Tiffany will have to say.  \nTo her or to however can bring light to subject,  \nthanks.\n\n",
  "author": "Giovanni Jubert",
  "time": "30 May 2006 — 9:07pm",
  "uid": "5062",
  "comments": [
    {
      "time": "30 May 2006 — 9:09pm",
      "content": "I think it was designed by Gerard Huerta,  \nbut i havent been able to confirm it by googling...\n\nI think that he talk about it in the NY typecon,  \nbut i might aswell been someone else i cant figure out.\n\nYves, what do you say?\n\n"
    },
    {
      "time": "30 May 2006 — 9:19pm",
      "content": "\\> First obviously, clarify who designed the logo  \nand if it was ever turned into a whole typeface?\n\nI don't know for certain who designed the original logo, I'm betting it was Gerard Huerta as well. Ray Larabie's [Squealer](http://web.archive.org/web/20131021023331/http:/www.myfonts.com/fonts/larabie/squealer/) is clearly based on the AC/DC logo.\n\n"
    },
    {
      "time": "31 May 2006 — 2:27am",
      "content": "\\> First obviously, clarify who designed the logo  \nWhy is it so important for you to know who designed what?  \nMore important is who makes it AC/DC:  \n [http://www.damasgate.com/vb/showthread.php?t=59434](http://web.archive.org/web/20131021023331/http:/www.damasgate.com/vb/showthread.php?t=59434 \"http://www.damasgate.com/vb/showthread.php?t=59434\")  \nAll the Best\n\n"
    },
    {
      "time": "31 May 2006 — 6:31am",
      "content": "I want to clarify some things regarding the AC/DC logo. In July of 1976 I was hired by Bob Defrin of Atlantic Records to design some lettering for the AC/DC album called \"High Voltage.\" This was not a logo, but lettering for the album. In April of 1977 he hired me to design the current orange beveled AC/DC logo for an album. This was just a job like any other record job: you did some sketches and you did a finish. I have never really used that art for promoting myself as it was probably one of only two jobs in my career that shared an unusual quality in my work: it was all made out of straight lines. This was not particularly virtuosic for one who prided himself on custom hand lettering. I have recently resurrected my credit for it as it seems to touch a lot of generations. This and some guitar playing has indeed made me cool with all my children's friends. How's that?!\n\nI would like to make one other comment as to the design, as this seems to be often disputed, particularly with writers who speculate and not seek a source. This logo seems to be one of the first heavy metal, goth-style logos, but its origins are misunderstood. No, there are not meant to be any fascist undertones...I designed a piece of lettering for a live Blue Öyster Cult album for John Berg called \"On Your Feet or On Your Knees.\" The album showed a church on the front with the Cults' limo on the cover. The back was a photo by Don Hunstein of me holding a bible with the credits on it. My thought on the cover was to take the metallic car marque idea and combine it with lettering reminicent of the Bible. I remembered this lettering when designing one of the AC/DC sketches and used this as my source. So you see that this logo is more Gutenberg than goth...  \nAs for typefaces, I have seen an attempt in the December issue of Guitar World magazine with Dimebag Darrell on the cover, but I had nothing to do with that. As for parodies, they are what they are.\n\n"
    },
    {
      "time": "31 May 2006 — 6:40am",
      "content": "One last thought...There is a show in Los Angeles featuring some of the best and most consistent lettering artists at:\n\n[http://www.haroldsgallery.com/](http://web.archive.org/web/20131021023331/http:/www.haroldsgallery.com/ \"http://www.haroldsgallery.com/\")\n\nIn this you will find the AC/DC logo prominently displayed.\n\n"
    },
    {
      "time": "4 Jun 2006 — 6:09pm",
      "content": "Gerard: it's so cool you joined Typophile just to comment on your AC/DC work. I really hope you'll hang around here a lot. I've always wanted to know more about this logo/lettering. Well, all my respect and thanks for the information, I bet Jubert hasn't replied yet because he's still recovering from the shock!\n\n"
    },
    {
      "time": "4 Jun 2006 — 8:49pm",
      "content": "no shock. thanks.\n\nthanks you Gerarld for your answer,  \ni coudnt seem to find the logo in any of the portfolios in your website.  \nI wanted to be sure about what I was guessing and what i remembered from last Typecon.  \nGerard's talk was something like 10am... ;)\n\nalthough very enriching to read,  \ni dont know if the answers regarding what i was asking where clear.\n\nin the AC/DC logo.  \n- Is all this merchandising legal?  \n- Has the use of the logo a liscence agreement with the designer?  \n- Is it ilicit to tweek it with out previous consent from the band or the designer?\n\nas for the particular design AD/HD,  \nit was postponed due to this issue  \neven before this thread, thats why it.\n\nthanks all.\n\nBtW. Squealer is terrible!\n\n"
    },
    {
      "time": "5 Jun 2006 — 4:41am",
      "content": "\\>in the AC/DC logo.  \n\\>- Is all this merchandising legal?  \n\\>- Has the use of the logo a liscence agreement with the designer?  \n\\>- Is it ilicit to tweek it with out previous consent from the band or the designer?\n\n– Probably not, somebody will have ripped it off to sell cheap t-shirts somewhere.  \n– The licence probably belongs to the band or the record label.  \n– Are you likely to get consent to parody/satirise the band? With or without that consent, are you doing something that you would be happy if somebody did to your work? I think if you have any doubt it is probably worth getting a proper legal opinion before proceeding.\n\nTim\n\n"
    },
    {
      "time": "5 Jun 2006 — 8:15am",
      "content": "No shock? Oh well.....\n\n"
    },
    {
      "time": "6 Jun 2006 — 12:29pm",
      "content": "For guibert: I don't know if all the merchandising is legal. I haven't answered your questions about the legal issues as they are in review, so I won't comment on that. As for parody, if parody is obvious then it probably is not an issue of copyright. I am not a copyright lawyer, so this is just an opinion.\n\n"
    },
    {
      "time": "8 Jun 2006 — 10:05am",
      "content": "thanks Gerard for your answers and your opinion,  \nwhich are very much apreciated.\n\nI have a deep respect for your work,  \nand I wish my posting didnt show the opposite.\n\nAll best.\n\nGiovanni Jubert\n\n"
    },
    {
      "time": "9 Jun 2006 — 2:34pm",
      "content": "Thank you, Giovanni. And my apologies for misspelling your name.\n\n"
    }
  ]
}
