{
  "id": "2033",
  "title": "German broadband company logo",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "following some corpoarte values, namely 'alive', natural' and 'wild', i came up with this logo, based on anime style. It's an element of   \na style that i'm working on called 'white occult'.   \nthe logo has been launched now, and there'[s also a 3d version and an animated version too, but I''ve posted it here since I feel i need to 'air' it in a critical forum. Logos like these tend to be dffficult to critique since they have to be analysed in the context of competitors logos, the visual culture of the audience, and the internal culture of the company. however, i'm interested in any negative/posative associations you may have, and since it's part of ongoing research, any typographic directions identifiable within logo design. Oh, in case you can't read it, we named the company 'ish' (www.ish.com). This work was done while working at an agency called Lucky.\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20050518051836im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">ish_logo.swf<br><a href=\"http://web.archive.org/web/20050518051836/http:/www.typophile.com/forums/messages/29/ish_logo.swf\"><b>ish_logo.swf</b></a> (94 k)</td></tr></table></center>\n",
  "author": "miles",
  "time": "Mon, 2002-08-12 03:37",
  "uid": "967",
  "comments": [
    {
      "time": " Mon, 2002-08-12 03:55",
      "content": "Will that print well?   \n   \nI like www.ish.com.\n\n"
    },
    {
      "time": " Mon, 2002-08-12 08:22",
      "content": "Miles, pretty interesting. I think with the various-sized \"thorns\" it will print well: the less the size/resolution, the more the small ones will drop out, but you'll always have some. The only thing that bugs me is the blue: to me it's saying \"ethereal\" more than \"earthy\". I guess blue is their corporate color... Try putting some green in it (towards the color I've heard called \"petrol\"). I mean next time. :-)   \n   \nLegibility: if the nature of the company makes it so that its name is already in the user's mind when seeing the logo, it's great. But for first-time exposure you might like to make the \"s\" more curvy, and the \"h\" with a longer ascender and narrower body.   \n   \nBTW, the animated thing on the site is very nice! Seen that way, it definitely looks more animalistic. And a cool three-letter domain? They must be rich... :-)   \n   \n\\> corpoarte values, namely 'alive', natural' and 'wild'   \n   \nDoes the CEO dress up in bear skins? ;-)   \n(Maybe these days that's his cover...)   \n   \n\\> 'white occult'   \n   \nNice. It's always great to have a cool name for a style.   \n   \nhhp\n\n"
    },
    {
      "time": " Mon, 2002-08-12 09:07",
      "content": "Hrant, i knew you'd get here.   \nthere is a small use version\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20050518051836im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">small_ish.swf<br><a href=\"http://web.archive.org/web/20050518051836/http:/www.typophile.com/forums/messages/29/small_ish.swf\"><b>small_ish.swf</b></a> (1 k)</td></tr></table></center>   \nsimplified for printing on pens and other small promotional items.   \nthe blue was intended to be a balance for the wildness of the style, blue would add a little cool conservatism (if at all possible with something like this).   \nYour points about legibility are true, I only hope that people learn to read it, however, the ad campaign is a pun on german words that usually en with \"isch\", so it would be \"erot\" nandthen the logo, hopefully teaching the viewer the pronunciation of the onamatopaic (sp) name.\n"
    },
    {
      "time": " Mon, 2002-08-12 09:17",
      "content": "I just had an idea:   \nIn the \"big\" version (the one you showed first), what if the outside forms were as they are, but the inside \"shimmers\" were used to form the letters in a more legible manner?   \n   \nhhp\n\n"
    },
    {
      "time": " Tue, 2002-08-13 01:36",
      "content": "nice idea, will take a look at that.   \ni did this logo in illustrator, but i see that some anime artists use an app called xara, had any experiebce with this?\n\n"
    }
  ]
}
