{
  "id": "20352",
  "title": "Activating Small Caps in OT fonts in Illustrator",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi there,\n\nI'm having some problems accessing the OpenType features in Meta Pro in Illustrator. I want to use small caps, but can't seem to find where to activate them. I know there is an OpenType palette within the Type palette in Illustrator, but there isn't a function to activate Small Caps. The only way I seem to be able to access them so far is through the Glyphs palette.\n\nIf anyone can help me out it would be much appreciated.\n\nCheers.\n\n",
  "author": "i0ta",
  "time": "31 May 2006 — 9:18am",
  "uid": "8924",
  "comments": [
    {
      "time": "31 May 2006 — 9:35am",
      "content": "It is an option off of the upper right triangle in the Character Palette - select Small Caps and then type non shifted letters for Small Caps - shifted for Full Caps\n\n"
    },
    {
      "time": "31 May 2006 — 1:32pm",
      "content": " ![](http://web.archive.org/web/20131014014543im_/http:/typophile.com/files/OTSmallCaps_4144.png)\n\n"
    },
    {
      "time": "31 May 2006 — 6:49pm",
      "content": "BTW, maybe change the title - Meta Pro OpenType problem- since the problem isn't with Meta.\n\n"
    },
    {
      "time": "1 Jun 2006 — 4:10am",
      "content": "I should have mentioned I tried activating Small Caps like that as well, but they just seem to come out as faux Small Caps ie. All Caps scaled down. I did an experiment where I scaled a line of supposed Small Caps up to the size of the same line in All Caps and the glyphs were the same.\n\nLooks like I might have to contact FontShop.\n\nThanks anyway.\n\n"
    },
    {
      "time": "1 Jun 2006 — 9:03am",
      "content": "Not sure if this will help, but I had a similar problem with Bello Pro with InDesign. I found that I had to have ligatures active in order to get the small caps to work.\n\n"
    },
    {
      "time": "1 Jun 2006 — 12:50pm",
      "content": "You have to go to preferences and change the dialog box on the percentage change of Caps to Small Caps it will never be true unless the typeface has been drawn in small caps\n\n"
    },
    {
      "time": "1 Jun 2006 — 1:48pm",
      "content": "Dan - FF Meta Pro, being an OpenType font with small caps, should work exactly as I described.\n\n"
    },
    {
      "time": "5 Jun 2006 — 8:20am",
      "content": "Just a FYI. I contacted FontShop about my problem and they replied back saying that there are some irregularities with how Small Caps works with Meta Pro and that they will be addressing the issue.\n\n"
    },
    {
      "time": "5 Jun 2006 — 8:38am",
      "content": "\\> _I found that I had to have ligatures active in order to get the small caps to work._\n\n(May this has nothing to do with it, but) This sounds familiar. I recall having to have more than one feature on FontLab's OT panel, otherwise a single feature would not show up upon compiling.\n\n"
    },
    {
      "time": "5 Jun 2006 — 8:45am",
      "content": "I think the liga feature is a requirement but I don't know why.\n\nChrisL\n\n"
    },
    {
      "time": "5 Jun 2006 — 3:44pm",
      "content": "iota's issue did indeed exist just as he said: CS/CS2 were not using using FF Meta Pro's true small caps characters. The newest rerelease of Meta Pro, which just dropped a couple weeks ago, resolves the issue.\n\n"
    }
  ]
}
