{
  "id": "20357",
  "title": "P22 releases an addition to their Frank Lloyd Wright fonts.",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20070808071658/http:/typophile.com/user/108 \"View user profile.\") : 31.May.2006 12.09pm \n\n+++\n\nFor Release: June, 1st, 2006, Buffalo, NY\n\nP22 type foundry announces an addition to its popular series of Frank Lloyd  \nWright fonts with FLLW® Midway™ and releases a new font inspired by  \nPost-Impressionist artist Paul Gauguin.\n\nFLLW® Midway™\n\nIn 1913, Edward C. Waller, Jr. commissioned Frank Lloyd Wright to expand an  \nAmusement Park complex and turn it into an upscale palatial beer garden.  \nThe Midway Gardens was born. FLLW® Midway™ is based on the lettering found  \non the Midway Garden’s working drawings. The lettering itself is in Mr.  \nWright’s distinctive hand. This type of architectural lettering is a bit  \nmore casual than standard lettering found on most blueprints. It evokes the  \npersonality of Frank Lloyd Wright in a way that complements the other fonts  \nin the P22 FLLW font series. The set contains Midway One and Midway Two,  \nwhich can be used interchangeably to give a more naturalistic feeling of  \nhand lettering. Also included is Midway Ornaments, which features over 100  \narchitectural and decorative elements that can be combined in many ways for  \nsurprising and effective decorative motifs and borders. Designed for P22 by  \nPaul hunt.\n\n[http://www.p22.com/products/fllwMidway.html](http://web.archive.org/web/20070808071658/http:/www.p22.com/products/fllwMidway.html \"http://www.p22.com/products/fllwMidway.html\")\n\nP22 Gauguin Font Set™ -\n\nP22 Gauguin™, designed by Colin Kahn, is based on the writings and sketches  \nof Post-Impressionist artist Paul Gauguin. This naturalistic writing font  \nis based on Gauguin’s notebooks from his travels to Tahiti and the South  \nSeas. This set presents two styles of script fonts (Regular & Brush) and a  \nset of decorative extras featuring Gauguin woodcuts, sketches and imagery  \nfrom his paintings.\n\nP22 Gauguin™ is also available as a Pro font. The OpenType font  \nincorporates P22 Gauguin Regular™ plus over 350 additional characters  \nincluding: Stylistic alternates for all characters (a-z, A-Z), Central  \nEuropean and Cyrillic character sets, ligatures, swash characters and many  \nother OpenType features.\n\n[http://www.p22.com/products/gauguin.html](http://web.archive.org/web/20070808071658/http:/www.p22.com/products/gauguin.html \"http://www.p22.com/products/gauguin.html\")\n\nPrices starting at $19.95 for single fonts. Both sets are available on  \nCD-ROM, contained in a DVD ThinPak case. All fonts can be test driven with  \nTypeCaster™.\n\n",
  "author": "<a href=\"http://web.archive.org/web/20070808071658/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 31.May.2006 12.09pm",
  "uid": "108",
  "comments": [
    {
      "time": " 31.May.2006 12.51pm",
      "content": "It has the Wright stuff :-)\n\nChrisL\n\n"
    }
  ]
}
