{
  "id": "20375",
  "title": "Stencil type fonts for a sign",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Dear All,\n\nI am an architect with a strong interest in all things type related and I am in the process of getting a sign made for my house/apartment here in Japan and for when we return to Australia. The sign will be made of laser cut steel plate (similar to the sign by Peter Verheul in the attached image [http://www.farhill.nl/02\\_lettering/applettering.html](http://web.archive.org/web/20140712081238/http:/www.farhill.nl/02_lettering/applettering.html \"http://www.farhill.nl/02\\_lettering/applettering.html\")).\n\nI would like to use a calligraphic such as FF Quadraat (please forgive my poor grasp of the lexicon!) as I love their letterforms and especially those of the italics (and I have an existing license of the family).\n\nThe final sign may simply have our family name (Dunlop as you can probably guess!) or we may include an additional line above of 'Grant & Yoko' in a smaller point size. The obvious problem is with the counters in some of the characters (D, O, P, a, o, p) especially and the process of laser cutting them.\n\nThere seems to be two obvious approaches to solving this problem:\n\n1. Find an alternative 'stencil' type font which possesses the same calligraphic feel of FF Quadraat (or Fedra Serif for example) which would be suitable for a stencil type use.\n\n2. Modify the problematic characters of an existing font to make it suitable for stenciling.\n\nA third less obvious solution is to design a character/font from scrarch which fits the purpose. This could be possible but I may then never end up with a sign!\n\nI have taken a look at some of the other 'stencil' threads (Wallflower:) [http://typophile.com/node/4933](http://web.archive.org/web/20140712081238/http:/typophile.com/node/4933 \"http://typophile.com/node/4933\") & [http://typophile.com/node/15078](http://web.archive.org/web/20140712081238/http:/typophile.com/node/15078 \"http://typophile.com/node/15078\") here and they have provided some inspiration to tackle the third option. Peter Verheul's letters and signs are also an inspiration and a spur.\n\nI would be grateful if anybody could provide some advice for the first two options: any fonts which fit the first options and what the correct process would be for obtaining permission to alter those problem characters to make them suitable for the purpose.\n\nI look forward to your responses.\n\nRegards,\n\nGrant Dunlop\n\n| Attachment | Size |\n| --- | --- |\n| [Sign Fonts\\_01.jpg](http://web.archive.org/web/20140712081238/http:/typophile.com/files/Sign%20Fonts_01.jpg) | 106.89 KB |\n\n",
  "author": "Grant Dunlop",
  "time": "1 Jun 2006 — 7:43am",
  "uid": "7446",
  "comments": [
    {
      "time": "1 Jun 2006 — 7:56am",
      "content": "[http://www.myfonts.com/fonts/yanone/pochoir/](http://web.archive.org/web/20140712081238/http:/www.myfonts.com/fonts/yanone/pochoir/ \"http://www.myfonts.com/fonts/yanone/pochoir/\")\n\npochoir by young german type-designer yanone?\n\n"
    },
    {
      "time": "1 Jun 2006 — 8:35am",
      "content": "There's nothing to prohibit you from customizing a type for this purpose. You just can't resell, or redistribute it. Most foundries allow you to preview type, you could preview your desired text and do a rough edit in photoshop (removing bits of letters) to see if it would work. Once you've landed on the type you like you can either edit yourself, or hire a typographer to edit the characters for you. There are plenty of capable folks on this site. Best of luck.\n\n"
    },
    {
      "time": "1 Jun 2006 — 8:41am",
      "content": "Grant,\n\nWhat Chris says is true. There is no reason you couldn't get Quadraat, or any other font, and use it to make your sign. I think it is a wonderful idea and hope you share with us the final result.\n\n"
    },
    {
      "time": "1 Jun 2006 — 9:55am",
      "content": "This sounds like an interesting challenge. Has anybody offered their services yet?\n\n"
    },
    {
      "time": "1 Jun 2006 — 9:56am",
      "content": "One piece of advice: the letters in a font (or a logotype) have to belong together. When you introduce cuts in letters like \"D\" and \"o\" out of necessity, consider also adding cuts in letters that don't absolutely need them, out of style. And this can affect where you put the cuts in the letters that necessarily need them. For example, in \"Dunlop\" it might look best to disjoin the stem and the arch in \"u\" and \"n\"... and as a result of that probably disjoin the \"p\" at the top instead of at the bottom... and as a result of <cite>that</cite> you might cut the \"o\" at the bottom, to have a low-high-low-high cut pattern in the whole.\n\nBTW, taking a cue from Eben:  \nIf you need somebody to carefully do all this slicing  \nfor you, I'm available: hpapazian\\_at\\_gmail\\_dot\\_com\n\nhhp\n\n"
    },
    {
      "time": "2 Jun 2006 — 1:08am",
      "content": "Thank you all for your suggestions.\n\nI have attached an image which has my first attempts at modifying some of the characters. I have taken some of the suggestions which Hrant has made with breaking the 'u' and 'n' characters.\n\n ![](http://web.archive.org/web/20140712081238im_/http:/typophile.com/files/DUNLOP%20Sign%20Font%20Options_Quadraat_6303.jpg)\n\nI would love to hear any comments about the changes which I have made.\n\nI have also attached an image which contains some computer generated images of what I would like the final signs to look like in terms of materials and finish.\n\n ![](http://web.archive.org/web/20140712081238im_/http:/typophile.com/files/DUNLOP%20Sign_Quadraat%20Options_5717.jpg)\n\nKesh - I have had a look at Pochoir but it is not quite what I am after.\n\nChris & Miss Tiffany - thanks for clearing that up. I intend to just stick with modifying Quadraat for the time being.\n\nI am quite partial to Fountain/Peter Bruhn's 'Eric Sans' face and which seems to lend itself to this purpose. I am not sure how well it would take to the modifications which are needed - it may destroy the elegant simplicity of the letterforms. I may contact Peter Bruhn to get his opinion on modifying Eric Sans for this use.\n\nEben & Hrant - thanks for the offer but I think that I will try to do this myself as it seems to be something which is not beyond my current skills (perhaps wishful thinking!).\n\nIt also provides a nice little introduction to letterforms and my ultimate aim of producing my own font at some time. Dreams of joining Frank Lloyd Wright, Neutra and Enric Miralles among the architects who have designed their own fonts (I wish I could also achive the same architecturally!).\n\nThanks,\n\nGrant\n\n"
    },
    {
      "time": "2 Jun 2006 — 8:57am",
      "content": "I'd say this is really working. Of the 3 rendered images, the top two need less space in between the un pair.\n\nWhile I really don't like the p open it is necessary and it look great. However in the lighter weight it starts to look vaguely like a y instead of a p.\n\n"
    },
    {
      "time": "2 Jun 2006 — 9:00am",
      "content": "I personally like the last (complete) one in the series - the one with the gappy \"u\"/\"n\". Two things that bother me though: 1) The gaps in those are smaller than the gaps in the others; I know if you make them too big \"u\"/\"n\" will become more confusable as letters, but it just looks a little imbalanced this way. 2) The \"D\" looks unhappy; I guess try cutting it elswhere.\n\nAlso, looking at the \"simulations\", it struck me that, because of the \"environmental\" strain placed on decipherability, you might want to make the \"el\" taller, to give it the character (hence decipherability) it lacks even in the best of circumstances.\n\nhhp\n\n"
    },
    {
      "time": "2 Jun 2006 — 10:25am",
      "content": "I agree with Hrant. The l does get lost. Making it taller seems smart. I wonder if spacing the letters a little wider would help as well since there is more time to read the image and the size is large. The face you are changing was designed to be used/read at much smaller sizes and the spacing was set for that purpose. Since you are changing many of the assumed variables that went into the design you may want to modify the face even further. For cues as to what changes to consider look at faces that have a display & a text version & compare them. Tiffany's point about the p is right on. You may have to exagerate the connection. Connecting at the bottom looks more successful to me.\n\nIf you do get frustated feel free to ask one of us typophiles for professional help.\n\nAlso check this out: It's not cut out ina stenciled manner but it looks quite fine because it is smart about materials, contrasts and the effect of weathering:\n\n ![](http://web.archive.org/web/20140712081238im_/http:/typophile.com/files/arthurquentinsign_3707.jpg)\n\nMaking a sign that looks better as it ages is very cool in my book.\n\n"
    },
    {
      "time": "4 Jun 2006 — 8:24pm",
      "content": "Dear Miss Tiffany, Hrant & Eben,\n\nThank you for your replies and suggestions.\n\nI have modified the letterforms a little bit more but I am now worried that the changes are taking them a long way from the original letterforms - to something which is not what I expected (wanted). I guess this shouldn't be such a suprise considering I am taking Quadraat outside its normal area of use. My main concern is that the changes are working against the nature of Quadraat. I would like to see if there are perhaps more natural ways of breaking up the letterforms which are in keeping with the pen strokes which the font seems to be modelled on.\n\nI would be grateful if any one can point me in the direction of any references to study the stroke order or construction of Quadraat and similar 'calligraphic' fonts? Understanding the strokes and construction will hopefully help me in placing the breaks themselves and how they could be designed.\n\nThanks,\n\nGrant\n\n"
    },
    {
      "time": "5 Jun 2006 — 9:21am",
      "content": "You could get a caligraphic 'practice book' from a used book store. It would show you several caligraphic forms & you could try to deconstruct the letters in Quadraat from there.\n\nOr you could - if you want to get into something with extra info or context get:\n\nGerrit Noordzij  \nThe stroke: theory of writing  \npublished 2005  \nTranslated by Peter Enneson\n\n[http://www.hyphenpress.co.uk/titles/stroke/index.html](http://web.archive.org/web/20140712081238/http:/www.hyphenpress.co.uk/titles/stroke/index.html \"http://www.hyphenpress.co.uk/titles/stroke/index.html\")\n\nIt's a lovley object in addition to being very interesting & theory rich. I think that just the bit about the process that created blackletter/fraktur/bastarda is worth the price of the book.\n\n\\> Understanding the strokes and construction will hopefully help me in placing  \n\\> the breaks themselves and how they could be designed.\n\nEither way, you won't get a recipe for cutting your letters. Just information about stroke stuctures in conventional calligraphy. I think it's a smart place to start looking.\n\nTalking about cuts: if you go that route - they are also going to have to have to support word & letter recognition, and avoid uneven color in the word form. That's why Hrant was talking about modification of more that the 'problem' letters too. The problem with cuts is that unless they are made in a clever way they jump out at you in a distracting way.\n\nRather than thinking in terms of 'cuts' you could think instead of a modified stroke - one that creates a gap. You could write out the forms yourself allowing for the breaks. Or look for a way to simulate this in the forms of Quadraat. Again, you would want to apply this approach for an even looking visual effect.\n\nOr you could Drill out the forms of the letters in circles of various sizes, so that the letter appears to be 'made' from holes like random-ish bubbles of different sizes filling up the target letter form.\n\nI guess that my suggestion for two contrasting metals isn't distracting you - huh?\n\n;-)\n\nYou could also do something po-mo like this:\n\n ![](http://web.archive.org/web/20140712081238im_/http:/typophile.com/files/minitorontocontruction_3713.jpg)\n\nAfter all you are an architect. :-P\n\n"
    },
    {
      "time": "5 Jun 2006 — 9:55am",
      "content": "\\> My main concern is that the changes are  \n\\> working against the nature of Quadraat.\n\nIndeed, and I think this is happening in two ways:  \n1) There's a difference between text fonts and display fonts, and Quadraat is [mostly] the former - while your application is entirely the latter.  \n2) As you say, Quadraat is a \"calligraphic\" (better termed chirographic) design, and I personally think that works against a signage/stencil application.\n\nI know you like Quadraat, so I didn't say anything at first,  \nbut I think there are much better fonts to base this on.\n\nhhp\n\n"
    },
    {
      "time": "5 Jun 2006 — 10:41am",
      "content": "Hrant - I had always understood you to say that you thought chirographic stuff was best suited to display faces - not text faces. Or are you just against Quadraat/Chirography in \\*all\\* cases?\n\nOf course you are right Quadraat is a face intented for text purposes. I am not sure that the chirographic quality of the face enters into the issue for Grant except in his handeling of the breaks or cuts.\n\nThat Quadraat is a text face doesn't preclude a modified version rendered suitable for display size. It is true that a pro would be better suited to the task that Grant is going to be - but maybe it doesn't have to happen tomorrow and Grant can learn how. I would suggest increasing the contrasts between thicks & thins for a start, spacing the letters a bit further apart maybe and maybe making the letters slightly wider too.\n\nGrant, why did you pick Quadraat anyway? I really like it myself. It has a rough hewn & vigorous quality. It feels very intentional rather than whimsical or processed.\n\nBut Hrant is right. It isn't the easiest place to start from. On the other hand getting a certain 'feeling' into a face that doesn't have it is even harder.\n\n"
    },
    {
      "time": "5 Jun 2006 — 11:25am",
      "content": "I think a bigger issue than typeface choice is effectiveness of the finished sign in its intended location. Grant, consider the legibility of the third virtual example you posted. To most passersby, unless the sign is right at face level, near the viewer (which signs never are, to people driving past looking for your house), a gray metal sign on a grayish background with reflections and shadows is going to be \"ambiguous\" at best. I would concentrate on finding an appropriate material to contrast with the background, and find a way to make the sign that doesn't require connecting links to hold the counters in place. It could be a piece of flashed glass (thin colored layer on clear) sandblasted so the colors contrast, and it could be lit from behind. for that matter, since you're an architect, I don't know why you aren't considering just having the letters themselves cut out and mounted on steel pins as is done on buildings. Then, you can choose any typeface that is clear and strong. Is that too obvious? It's simpler...\n\n"
    },
    {
      "time": "5 Jun 2006 — 11:34am",
      "content": "Eben, you're right - thanks for catching my confusion. I think Quadraat's  \nchirographic nature does not make it unsuitable for display - just unsuitable  \nfor stenciling. So please strike the \"signage\" from my #2 above.\n\nBTW, for the record: I like Quadraat a good deal.\n\nhhp\n\n"
    },
    {
      "time": "5 Jun 2006 — 1:48pm",
      "content": "Carl makes good points! Also, as a hybrid, you could have the letters cut out & mounted on glass so that the 'floating' counters were held in place on the glass - or - they could be on pins. Putting led light behind the sanblasted glass would be pretty marvy too - but a bit showy for Japan maybe...\n\nIf you do it then maybe the lights' color should change with the weather and or the season. Blue for night. Green for summer. Red for fall. Orange for Winter. Pink for Spring. That kind of thing.\n\nHrant: Okay good. I didn't want to think I had spent all this time attempting to understand your ideas only to have them change! ;-) .\n\nGrant, the cut out of steel thing is more fashionable now isn't it? Personally, I like Zinc!\n\n"
    },
    {
      "time": "15 Jun 2006 — 6:37pm",
      "content": "Dear All,\n\nI am sorry for the delayed reply - I have been busy with work and have had family visiting for the past week.\n\nI will read through and digest the content of the recent posts with the probable development that I will consider a different font and overall sign type and design.\n\nI will post some further sign options in the near future and hope to get some more useful responses then.\n\nRegards,\n\nGrant Dunlop\n\n"
    }
  ]
}
