{
  "id": "2037",
  "title": "Non-french font creator living in Paris needed !",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "i'm, that year, student in a journalism school.   \ni have to do an interview, in english, with an interesting person.   \ni love fonts. So i'd like very much to interview a font creator. In Paris.   \nIf you're the one i seek, please tell me. thanks.\n\n",
  "author": "ponofob",
  "time": "Tue, 2003-11-11 13:30",
  "uid": "1804",
  "comments": [
    {
      "time": " Tue, 2003-11-11 13:45",
      "content": "JFP?\n\n"
    },
    {
      "time": " Tue, 2003-11-11 13:48",
      "content": "i would have love it, but the interview is in english and therefore the person have, at least, not to be french.\n\n"
    },
    {
      "time": " Tue, 2003-11-11 15:21",
      "content": "JFP Speaks english, and is quite an accomplished type designer, with some nice accolades. I would suggest contacting him.   \n   \nYou could find his email though the board here, or possibly over at porchez (sp -- sorry to lazy to look it up right now) type foundry.   \n   \nHildebrant.\n\n"
    },
    {
      "time": " Tue, 2003-11-11 15:28",
      "content": "Ok I think I understand what your trying to communicate.   \n   \nYou want and American who is IN France, for an interview? Not just a Frenchman who speaks english?!?   \n   \nIf an english speaking Fenchman is ok, try [http://www.typofonderie.com/](http://web.archive.org/web/20050518123245/http:/www.typofonderie.com/)   \n   \nHildebrant.\n\n"
    },
    {
      "time": " Tue, 2003-11-11 15:36",
      "content": "You could try Matha Standun: Irish and living in Paris. I suspect he'd be happy to talk to you about Irish type design, and the role of language and typography in nationalist politics.\n\n"
    },
    {
      "time": " Tue, 2003-11-11 15:55",
      "content": "yeah, i need, if not necessary an American, not a french. Any person who isn't french, live (or is right now or before december) in Paris, and has something interesting for me is good.   \nI thought of M. Standun and still, as i often enjoy his posts; but my first idea is to get a font creator, if possible.\n\n"
    },
    {
      "time": " Tue, 2003-11-11 16:56",
      "content": "1) [http://www.myfonts.com/country/fr/](http://web.archive.org/web/20050518123245/http:/www.myfonts.com/country/fr/)   \n   \n2) From S Carter's \"20th Century Type designers\":   \n   \n\"   \nTwo of the designers of the generation after Roger Excoffon who have contributed most to French type design have been to some extent outsiders. Adrian Frutiger ... is Swiss, while the slightly older Jose Mendoza y Almeida, while born in France, is fiercely proud of his Spanish descent.   \n\"   \n   \nIf you could nab Mendoza, that would rock.   \nLet me know if you need contact info (although I'd have to ask permission from a third party).   \n   \n3) Try asking here: [http://typo.textbox.org/](http://web.archive.org/web/20050518123245/http:/typo.textbox.org/)   \n   \nAs for Matha, type design or no, hook up with him - you won't regret it.   \n   \nhhp\n\n"
    },
    {
      "time": " Tue, 2003-11-11 17:09",
      "content": "if i could have M. Mendoza i would be great indeed !   \ni guess i need contact info, but i'm going to do some research.   \nThank you really much for all.\n\n"
    }
  ]
}
