{
  "id": "20379",
  "title": "50 pence",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Just found this in my change, thought it was interesting.\n\n ![](http://web.archive.org/web/20140804161923im_/http:/typophile.com/files/50p_4179.gif)\n\n",
  "author": "James Eden",
  "time": "1 Jun 2006 — 10:10am",
  "uid": "10528",
  "comments": [
    {
      "time": "1 Jun 2006 — 1:10pm",
      "content": "that's remarkably lovely. wish we had such typographic excellence in all today's coinage.\n\n"
    },
    {
      "time": "1 Jun 2006 — 2:09pm",
      "content": "Not to mention the copy! None of that \"In God We Trust\" nonsense we yanks have on our coinage.\n\nA seven sided coin is pretty fascinating too. 7 is the only one of the first 10 numbers that does not divide evenly into 360° therefore it's the hardest number to work with in polygons or stars.\n\n"
    },
    {
      "time": "1 Jun 2006 — 2:59pm",
      "content": "That is a very nice coin...\n\n"
    },
    {
      "time": "1 Jun 2006 — 3:17pm",
      "content": "Cool coin. Kind of PoMo.\n\n\\> None of that “In God We Trust” nonsense\n\nIt's not nonsense at all, when you consider that the  \n\"God\" there refers to none other than the money itself.\n\nhhp\n\n"
    },
    {
      "time": "1 Jun 2006 — 4:46pm",
      "content": "Wow, that's a great coin. I think everyone should dig through their pockets and show us some interesting type specimens...\n\n"
    },
    {
      "time": "1 Jun 2006 — 4:50pm",
      "content": "i remember before Europe got the Euro they had coins in Italy that had a yellow center with silver around it.. and i remember some other coin, maybe not Italian but European, which had a hole in it.\n\n"
    },
    {
      "time": "1 Jun 2006 — 4:53pm",
      "content": "I have a Mexican coin that looks the same as the Italian one and we Canadians have a twonie (2 dollar coin) that mimicks the Italian one as well. But none of the coins have cool type on them. British West Africa (c. 1936) had a coin with a hole in it.\n\n"
    },
    {
      "time": "1 Jun 2006 — 5:09pm",
      "content": "\\>It’s not nonsense at all, when you consider that the  \n“God” there refers to none other than the money itself.\n\nSo it's a bit redundant.\n\n"
    },
    {
      "time": "1 Jun 2006 — 5:39pm",
      "content": "\\> _i remember before Europe got the Euro they had coins in Italy that had a yellow center with silver around it._\n\nActually, [2 Euro coins](http://web.archive.org/web/20140804161923/http:/www.eurocoins.co.uk/images2euros.html) are like that, and [1 Euro coins](http://web.archive.org/web/20140804161923/http:/www.eurocoins.co.uk/images1euros.html) are the opposite.\n\n"
    },
    {
      "time": "1 Jun 2006 — 5:43pm",
      "content": "Great link! Thanks Miguel!\n\n"
    },
    {
      "time": "1 Jun 2006 — 6:05pm",
      "content": "<cite>Actually, 2 Euro coins are like that, and 1 Euro coins are the opposite.</cite>\n\nyeah, i noticed that right after i posted, when i looked them up on Wikipedia. i guess they felt inspired by the Italians? i always thought those were so cool when i was a kid on vacation in Italy. makes me miss those days when each country you visited had their own money.. it was part of the whole vacation thing, really. the Euro is more convenient perhaps, but it was way more fun when you could have marks, lire, francs, etc.\n\n"
    },
    {
      "time": "2 Jun 2006 — 5:57am",
      "content": "_Not to mention the copy! None of that “In God We Trust” nonsense we yanks have on our coinage._\n\nBut doesn't this 50p coin have a picture of the Queen on the other side? And some sort of Latin abbreviation for \"Queen by the Grace of God, Defender of the Faith\"? Is that all that different from \"In God We Trust\"?\n\n"
    },
    {
      "time": "2 Jun 2006 — 7:06am",
      "content": "E pluribus unum was a much better motto.  \nTim\n\n"
    },
    {
      "time": "2 Jun 2006 — 7:12am",
      "content": "I agree. Maybe someday the EU will take it up. I'd vote for that over monarchs appointed by the grace of God any day ;-)\n\n"
    },
    {
      "time": "2 Jun 2006 — 10:15am",
      "content": "\\> So it’s a bit redundant.\n\nWell, kids learn best via repetition. I'm guessing peons too.\n\nDan: certainly, the US learned its best tricks from the UK.  \nAlthough now the roles have largely flipped; so expect the  \nlatter to dump Latin in favor of this age's vulgate soon.\n\n\\> I’d vote for that over monarchs appointed by the grace of God any day ;-)\n\nYes, He doesn't choose very well.  \nBut in His defense: he's too busy to mind us.\n\nhhp\n\n"
    },
    {
      "time": "2 Jun 2006 — 10:29am",
      "content": "Here's a really nicely lettered coin:\n\n ![](http://web.archive.org/web/20140804161923im_/http:/typophile.com/files/Livre_coin_4016.gif)\n\nThe stuff around the edge is like a cool notan-play of the name\\*, while the ligated pair next to the guy's cheek indicates the anniversary year in \"letter format\", where RA=1000 + SHA=500 totalling 1500 years. BTW, there must be a better term than \"letter format\" for that - does anybody know it? John? I know that some other languages use it too, so hopefully there's a nice[r] term for it.\n\n\\* Like check out the two little triangles below the line and the one above it: those are like small extenders that Armenian caps tend to have.\n\nhhp\n\n"
    },
    {
      "time": "2 Jun 2006 — 10:54am",
      "content": "That may be the coolest photo I have yet to see on Typophile, Hrant. Good show!\n\n"
    },
    {
      "time": "2 Jun 2006 — 3:12pm",
      "content": "I'm a fan of the bi-metal 2 pound coin.\n\n ![](http://web.archive.org/web/20140804161923im_/http:/typophile.com/files/1997twopoundgoldrev240_3754.jpg)\n  \nMainly because its central arrangement of 19 cogs is such a potent symbol of British engineering :P\n\n\"...expect the latter to dump Latin\"  \nIncidentally, it has the inscription, \"STANDING ON THE SHOULDERS OF GIANTS\" from a letter by Isaac Newton to Robert Hook. It's in English.\n\n"
    },
    {
      "time": "3 Jun 2006 — 4:40pm",
      "content": "The best is when they have Braille on it.\n\n"
    },
    {
      "time": "4 Jun 2006 — 5:35am",
      "content": "Which coins have Braille on them?\n\n"
    },
    {
      "time": "4 Jun 2006 — 7:34am",
      "content": "The Italian Lira. 500 Lire coins if I remember well.\n\n"
    },
    {
      "time": "4 Jun 2006 — 10:40am",
      "content": "Hrant, where is that coin from? What languiage is shown? It's awesome.\n\nBrooke: nice!\n\n"
    },
    {
      "time": "4 Jun 2006 — 10:57am",
      "content": "\\> _i guess they felt inspired by the Italians?_\n\nDunno who inspired who, but one thing is certain: bi-metal coins have existed in Portugal since 1989, in the form of [100 Escudos coins](http://web.archive.org/web/20140804161923/http:/www.portugalmoedas.com.pt/detalhes.asp?ID=1180) (100$ was roughly 0,50€). Then later, in 1991, appeared the [200 Escudos coins](http://web.archive.org/web/20140804161923/http:/www.portugalmoedas.com.pt/detalhes.asp?ID=1179) where the metal combination was reversed.\n\n\\> _BTW, there must be a better term than “letter format” for that - does anybody know it?_\n\nI'd call them [Armenian numerals](http://web.archive.org/web/20140804161923/http:/en.wikipedia.org/wiki/Armenian_numerals).\n\n\\> _Hrant, where is that coin from? What languiage is shown?_\n\nMust be Armenian.\n\n"
    },
    {
      "time": "5 Jun 2006 — 6:18am",
      "content": "Gee, all I have is boring stuff. You guys much use a much higher class of vending machine to get change than I do. :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Jun 2006 — 10:51am",
      "content": "i think there's a spanish coin with a hole…\n\n------\n\n"
    },
    {
      "time": "5 Jun 2006 — 10:58am",
      "content": "Then there is the old New York subway token of many years back.\n\nChrisL\n\n"
    },
    {
      "time": "5 Jun 2006 — 11:44am",
      "content": "Eben, it's a not-too-old Armenian commemorative coin,  \nnot for general currency usage. I don't know if that  \ndisqualifies it from this thread... :-/\n\nMiguel, I have one of those cool bimetal Escudos. I used to collect coins. Then I lost my best batch (which I kept in a tin mint box) during a visit to a toy store (being a typical dumb kid I insisted on carrying my collection around with me) and got discouraged. I still have a lot of cool ones though. For one thing people seemed to ignore my discouragement and kept giving me exotic coins to collect.\n\nCoins with holes: I have a really nice  \none from Oman (I think) which has a  \nhole as well as a wavy edge.\n\nAnd I'm pretty sure I still have that NYC subway one too.\n\n\\> I’d call them Armenian numerals.\n\nBut since other languages use that sort of thing too,  \nI was thinking/hoping maybe there's a term for it.\n\nhhp\n\n"
    },
    {
      "time": "5 Jun 2006 — 1:59pm",
      "content": "It's taken me a stupid-long time but now I see the armeinan shapes. It's the lines made by the cuts. Duh! I had been thinking like constructovist letters & looking at the cut shapes themselves. I think I see a great display face techique or two in that coin... Hmmm.\n\n"
    },
    {
      "time": "5 Jun 2006 — 2:29pm",
      "content": "The norwegian krone has a whole in it.\n\n ![](http://web.archive.org/web/20140804161923im_/http:/typophile.com/files/krone_3664.jpg)\n\n"
    },
    {
      "time": "5 Jun 2006 — 2:30pm",
      "content": "or a HOLE\n\n:-)\n\n"
    },
    {
      "time": "5 Jun 2006 — 2:33pm",
      "content": "a number of danish coins have holes in them, including the 5 crown coin here, which also has little hearts on the edges and a pretty nice layout of M's for Queen Margrethe:\n\n ![](http://web.archive.org/web/20140804161923im_/http:/typophile.com/files/5%20krone_4504.gif)\n\n//Peter\n\n"
    },
    {
      "time": "5 Jun 2006 — 2:34pm",
      "content": "Japan has a couple of current coins with holes in them also. The holes were from way back, when money was carried on a string and often assembled into strings of certain amounts... similar to our rolling of coins today.\n\n"
    },
    {
      "time": "5 Jun 2006 — 2:37pm",
      "content": "Is this thread getting off topic with all of the hole talk?\n\nWould it be better if we called them 'counters'?\n\n"
    },
    {
      "time": "5 Jun 2006 — 4:36pm",
      "content": "The former Czechoslovakia issued some really striking coins in the mid-1960s, but my favorite is this 1000 krónur baby from Iceland, 1974:\n\n ![](http://web.archive.org/web/20140804161923im_/http:/typophile.com/files/iceland_4486.jpg)\n\n"
    },
    {
      "time": "5 Jun 2006 — 5:26pm",
      "content": "That krónur is a beaut!\n\nChrisL\n\n"
    },
    {
      "time": "5 Jun 2006 — 8:54pm",
      "content": "Spain used to have a 25 pesetas coin with a hole in the middle, before the Euro.\n\n[http://alexandre.bernard2.free.fr/esp\\_25pt.htm](http://web.archive.org/web/20140804161923/http:/alexandre.bernard2.free.fr/esp_25pt.htm \"http://alexandre.bernard2.free.fr/esp\\_25pt.htm\")\n\n"
    },
    {
      "time": "5 Jun 2006 — 9:59pm",
      "content": "Thanks for that, Nick. Gorgeous.\n\n"
    },
    {
      "time": "6 Jun 2006 — 1:18am",
      "content": "I think the letters on these 1959 Jersey coins are quite good. And a wavy-edged dodecagon, eh? (Bet there's some technical numismatists' term for that...)  \nPretty sure I have some _old_ coins with holes somewhere...\n\n ![](http://web.archive.org/web/20140804161923im_/http:/typophile.com/files/jerscoin_4253.jpg)\n\nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "6 Jun 2006 — 11:24am",
      "content": "Nick, that Iceland one is pure... ice! Awesome - my kinda stuff.\n\nhhp\n\n"
    },
    {
      "time": "6 Jun 2006 — 1:28pm",
      "content": "It's interesting that a black coin comes from a country were the landscape is dominated by white most of the year :^) (or that's just a Photoshop effect?!...)\n\n"
    },
    {
      "time": "6 Jun 2006 — 1:42pm",
      "content": "Actually, Iceland is very green.\\*  \nSo what would be strange is if their coins were... purple? ;-)\n\n\\* And naturally of course Greenland is solid ice (except for a thin \"V\" of land)... :-/\n\nhhp\n\n"
    },
    {
      "time": "6 Jun 2006 — 2:27pm",
      "content": "Here's another coin that I think has really nice lettering:\n\n ![](http://web.archive.org/web/20140804161923im_/http:/typophile.com/files/AUS_5301.jpg)\n\n--\n\nBTW James, if you could please allow some frivolity,  \nI have a non-typographic photo that really needs a home...\n\nYou guys know how people see the Virgin Mary on water-damaged ceilings  \nand stuff? Well, guess what I saw the other day on the lid of my toaster oven:\n\n ![](http://web.archive.org/web/20140804161923im_/http:/typophile.com/files/AJ_4372.jpg)\n  \nMichael Jordan, in molten cheese shrapnel! Can you believe it?! I almost called ESPN's Hispanic department for an exclusive, but then remembered something that caused me to simply take a photo and immediately scrub it clean: I really don't like basketball at all.\n\nhhp\n\n"
    },
    {
      "time": "6 Jun 2006 — 2:51pm",
      "content": " ![](http://web.archive.org/web/20140804161923im_/http:/typophile.com/files/c3_5453.png)\n\n"
    },
    {
      "time": "6 Jun 2006 — 4:51pm",
      "content": "_It’s interesting that a black coin comes from a country were the landscape is dominated by white most of the year :^) (or that’s just a Photoshop effect?!…)_\n\nActually, neither. The coin is what is known as a **mirror proof** : the fields are polished to a bright, highly reflective finish, while the lettering and figures are frosted. The coin was simply placed on a flatbed scanner, and scanned at 600 dpi: the black fields are, oddly, how the scanner sees itself in the mirror finish.\n\nBTW, here's the other side of the coin...\n\n ![](http://web.archive.org/web/20140804161923im_/http:/typophile.com/files/iceland-2_6181.jpg)\n\n"
    },
    {
      "time": "6 Jun 2006 — 6:38pm",
      "content": "Rock.\n\n"
    },
    {
      "time": "6 Jun 2006 — 7:04pm",
      "content": "Hrant, I'm not entirely sure that's Michael Jordan. I'd say it was one of those rubber chickens that lost it's head somewhere in your toaster... hillarious to say the least! What do you think of this Australian square coin?\n\n ![](http://web.archive.org/web/20140804161923im_/http:/typophile.com/files/2002KookaburraSquare_5631.jpg)\n\n"
    },
    {
      "time": "7 Jun 2006 — 8:16am",
      "content": "Square with rounded corners? Textbook 90s graphic design! :-)  \nOf itself though, I actually like it (except for the letterspacing).\n\nhhp\n\n"
    },
    {
      "time": "7 Jun 2006 — 9:28am",
      "content": "I have a motley collection of pre-Euro currency and agree the Czech coins are nice. Also kudos to Chris for mentioning the NYC subway token which had a Y-shaped cutout.\n\nBut here's my favorite ;-)\n\n ![](http://web.archive.org/web/20140804161923im_/http:/typophile.com/files/nocashvalue_3811.jpg)\n\n"
    },
    {
      "time": "10 Jun 2006 — 3:33pm",
      "content": "Some lovely coinage here. I will have to see if I can find some of my older pieces from various places.\n\n"
    }
  ]
}
