{
  "id": "20412",
  "title": "Clay-animated movie titles",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I've tried searching the typophile archives (not working on my PowerBook!), asking friends, everything. I'm trying to identify and locate the movie that starts with a very surreal clay animated title sequence, with little clay balls, blocks and trees all marching or rolling or erupting into letters to form the names of the actors. Each name is a different sort of re-formation, from cylinders unrolling to show the letters, to craters in the ground erupting with letters, to waves of clay washing up and turning into letters. I seem to recall it's from the '60's, and it might be an Annette Funicello movie for all I know. I probably can't remember the movie because the titles are the best thing about it. It is a comedy, I'm sure. Does anyone remember that sequence, and know which movie it is?\n\n",
  "author": "crossgrove",
  "time": "2 Jun 2006 — 4:20pm",
  "uid": "2263",
  "comments": [
    {
      "time": "2 Jun 2006 — 4:58pm",
      "content": "I bet Tim Burton would know.\n\n"
    },
    {
      "time": "2 Jun 2006 — 5:20pm",
      "content": "I'm trying to evoke a flashback, but nothing yet.  \nHmmmmm....  \nThe Sixties... Claymation... Annette Funicello...  \nMy first crush! (with Annette, not clay).  \nSorry, nothing yet.\n\n ![](http://web.archive.org/web/20150223073531im_/http:/typophile.com/files/Funicello_1_4500.jpg)\n\n"
    },
    {
      "time": "2 Jun 2006 — 5:55pm",
      "content": "Still trying.\n\n[Bruce Bickford](http://web.archive.org/web/20150223073531/http:/brucebickford.com/bio.shtml) was clay animator who worked frequently with Frank Zappa during the early '70s.\n\n[Here's a link](http://web.archive.org/web/20150223073531/http:/brucebickford.com/media/BruceClayWebQuick.mov) to one of his bizarre clay morphing from jungle to title animations (Quicktime).\n\n"
    },
    {
      "time": "2 Jun 2006 — 6:03pm",
      "content": "How to Stuff a Wild Bikini (1965) - clay stuff by Art Clokey; the creator of Gumby - that's the movie you're looking for?\n\n"
    },
    {
      "time": "2 Jun 2006 — 6:03pm",
      "content": "Zappa rocks.\n\nWould love to find out what you're reffering to - sounds awesome\n\n[Communication Design, Melbourne](http://web.archive.org/web/20150223073531/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "2 Jun 2006 — 6:08pm",
      "content": "David, I think you've hit it. I actually did watch the whole thing (?!?!). Thanks a bunch!\n\n"
    },
    {
      "time": "2 Jun 2006 — 6:11pm",
      "content": "Wow, cool David!  \nAnnette meets Gumby... think of the possibilities! ;-)\n\n"
    },
    {
      "time": "2 Jun 2006 — 6:21pm",
      "content": "FYI --  \nThe Frank Zappa/Bruce Bickford reference is to [Baby Snakes](http://web.archive.org/web/20150223073531/http:/www.amazon.com/gp/product/B0000JML7G/103-1133024-0071857?v=glance&n=130).\n\n"
    },
    {
      "time": "2 Jun 2006 — 6:28pm",
      "content": "You're welcome.\n\n"
    },
    {
      "time": "2 Jun 2006 — 7:41pm",
      "content": "Carl,\n\nGot here a couple hours late. Indeed it was Art Clokey. Many of the Gumby episodes had great animated title sequences as well:\n\n[http://www.flickr.com/photos/stewf/sets/1168574/](http://web.archive.org/web/20150223073531/http:/www.flickr.com/photos/stewf/sets/1168574/ \"http://www.flickr.com/photos/stewf/sets/1168574/\")\n\n"
    },
    {
      "time": "2 Jun 2006 — 7:54pm",
      "content": "Oh, man. That Flickr link made me remember something from my childhood that probably had a hand in my obsession with letters.\n\nI had some plaster letters just like these when I was about six years old:\n\n[http://www.flickr.com/photos/stewf/53893098/in/set-1168574/](http://web.archive.org/web/20150223073531/http:/www.flickr.com/photos/stewf/53893098/in/set-1168574/ \"http://www.flickr.com/photos/stewf/53893098/in/set-1168574/\")\n\nMy dad salvaged some panels that were used at trade shows by the company he worked for. They were covered with letters like these in two sizes, around two inches tall, painted forest green. He pried them off and gave them to me. I used to spend hours playing with them. I'm sure they were a subconscious influence on [this](http://web.archive.org/web/20150223073531/http:/www.ms-studio.com/FontSales/refrigerator.html). I wonder whatever became of them.\n\n(Sorry for going OT...)\n\n"
    },
    {
      "time": "2 Jun 2006 — 7:57pm",
      "content": "One other thing: I did actually use them once for the animated title of an 8mm film I made when I was 13 or 14. Just like Art. :-)\n\n"
    },
    {
      "time": "3 Jun 2006 — 3:51am",
      "content": "I used to do stop-motion animation ... I should get back into it. Tedious but very rewarding (if that's possible)\n\n"
    },
    {
      "time": "3 Jun 2006 — 9:12am",
      "content": "[More OT.....]\n\n\\> I bet Tim Burton would know\n\nAnd Henry Selic ( great stop motion animation director - Laika Entertainment House) who directed The Nightmare Before Christmas.\n\nTim Burton and Henry Selick are involved in the digital remastering (The Nightmare Before Christmas) - 3-D release by Walt Disney Pictures , something around Oct.\n\nAnother great director + producer is Will Vinton (formerly Vinton Studios, and now Laika Entertainment House)\n\n"
    },
    {
      "time": "3 Jun 2006 — 10:50am",
      "content": "_I used to do stop-motion animation … I should get back into it. Tedious but very rewarding (if that’s possible)_\n\nIt's definitely easier nowadays. If you have a digital camera (still or video) and a Mac, check this out:\n\n[http://www.istopmotion.com/](http://web.archive.org/web/20150223073531/http:/www.istopmotion.com/ \"http://www.istopmotion.com/\")\n\n"
    },
    {
      "time": "5 Jun 2006 — 4:42pm",
      "content": "what about wallace and grommit? Can't remember much about them but had some good clay animation so you might want to check them out. Ahh gumby nice.\n\n"
    },
    {
      "time": "5 Jun 2006 — 8:17pm",
      "content": "Gumby! (What a fun departure from type...) AND Wallace & Gromit, which are also stellar clay animations.\n\n"
    },
    {
      "time": "11 Jun 2006 — 6:51pm",
      "content": "yes, Aardman certainly produce some amazing stuff, shame about the storylines of their feature animated films (i.e Chicken Run)\n\n"
    },
    {
      "time": "12 Jun 2006 — 2:23pm",
      "content": "True. I blame it on Universal who i think produced it. Probably wouldn't let him use his typical comedy and story lines :(\n\n"
    },
    {
      "time": "12 Jun 2006 — 4:51pm",
      "content": "I think it was a fairly typical Aardman story line, just stretched out to feature length. Sure, Universal probably had a fair bit to do with it too.\n\nOh and Aardman is more than just \"him\"\n\n"
    }
  ]
}
