{
  "id": "20410",
  "title": "- instant font updates - at InDesign",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "...makes the font developers life happier.\n\nOn several threads on typophile I read, font developers having massive problems updating their font in the development process. They have to search for font caches, deleting them and so on. In these days most developers made OpenType fonts and using InDesign for testing like I do. So hopefully this methode will work for you too guys.\n\ntested on: Windows XP, InDesign 2 and InDesign 4 (CS2) and several OpenType (CFF) fonts with feature code.\n\n1. Use the native font directory of InDesign for your test fonts.  \ne.g. /InDesign/Fonts/myfonts/\n\n2. Start InDesign, made a new document and made a text box using your test font.\n\n3. Made a second text box with an other OpenType (CFF) font like Myriad Pro shipping with InDesign. (an OpenType (TrueType) font like TNR don't worked for me - don't know why)\n\nInDesign is now \"holding\" your font since you have activated it by making a text box using it. So InDesign has to cover an other font, but in general it will not \"decover\" your font you like to update. - But here is the clue.\n\n4. Select the second text box with Myriad Pro or any other \"higher\" OpenType (CFF) font.\n\n5. Open the GLYPHS window, the same font should be seen like the active one from the text box - Myriad Pro, and now select any glyph and make a double click, so the glyph will appear in this text box.\n\nStrange, but now InDesign will lose the selection of your first font, your test font.\n\n6. Switch to your directory tool/manager and now its no problem to delete your test font from InDesigns native font folder. Don't use overwrite - you have do delete it first.\n\n7. Now made your changings (kerning, feature code, outlines... ) and compile your new test font. Copy this font with the same file name (the internal font names should be the same) right into your native InDesign directory.\n\n8. Switch back to InDesign. InDesign will renew its font engine - like a new font is activated and vola, you have the new test font active without closing InDesign.\n\nSo, try this and tell me if its working for you too. I hope InDesign will react the same way on a Mac system.\n\n-- [astype.de](http://web.archive.org/web/20150421064221/http:/www.astype.de/)--\n\n",
  "author": "andreas",
  "time": "2 Jun 2006 — 3:11pm",
  "uid": "655",
  "comments": [
    {
      "time": "2 Jun 2006 — 4:10pm",
      "content": "\\> _I hope InDesign will react the same way on a Mac system._\n\nIt does.\n\nIn fact, I do something similar to what you do, but probably more simple. What I do is to generate with FontLab any .otf font I'm testing, and save it directly in InDesign's own Fonts folder, overriding any previous version of that same font. And this can be done with InDesign running. Once you switch to InDesign, you'll get the hourglass/beachball and after a couple of seconds you're font is updated on-the-fly.\n\n"
    }
  ]
}
