{
  "id": "20448",
  "title": "Fonts bundled with Microsoft Word",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm creating design templates for my organisation, using Microsoft Office, but am having difficulty choosing a typeface.\n\nMicrosoft's typography page gives some useful lists of which faces are included with different incarnations. For example, Office Pro 2003 has the following:\n\n[http://www.microsoft.com/typography/fonts/product.aspx?PID=143](http://web.archive.org/web/20121109100439/http:/www.microsoft.com/typography/fonts/product.aspx?PID=143 \"http://www.microsoft.com/typography/fonts/product.aspx?PID=143\")\n\nIt's decent enough, containing several weights of Bodoni, Franklin Gothic, Gill Sans and so on.\n\nWord 2000, on the other hand, contains a far smaller selection:\n\n[http://www.microsoft.com/typography/fonts/product.aspx?PID=143](http://web.archive.org/web/20121109100439/http:/www.microsoft.com/typography/fonts/product.aspx?PID=143 \"http://www.microsoft.com/typography/fonts/product.aspx?PID=143\")\n\nOther versions (eg. the Microsoft Works series) appear to contain something in between.\n\nMy organisation uses Office Pro 2003, so I can choose from the longer list. But we will need to be able to send documents outside our organisation. In these cases, I can't be sure that the fonts I use will be available. The recipient could be using any kind of .doc viewer, but it appears that they'll only get the full range of typefaces with Microsoft's more expensive bundles.\n\nHas anyone else been in this situation, and how have you handled it? It appears my choices are:\n\n1) A two-tiered Word experience. For example, I could specify Gill Sans for use throughout. This would work for everyone in my organisation, and most people we email documents to (who will be in organisations with similar IT systems). But for some recipients, the fonts won't be available. Which fonts will Word substitute, and will the degradation be elegant?\n\n2) Choose from one of Microsoft's core fonts for web. I'm confident this solution would work in the same way on any machine, but I'd be limited to fonts like Arial, Georgia, Verdana, Times ... Comic Sans. This is undesirable to me from a design perspective, but should I eschew such concerns in favour of a consistent appearance for all viewers?\n\nComments and insight are very welcome.\n\n",
  "author": "m-ga",
  "time": "5 Jun 2006 — 3:52am",
  "uid": "8589",
  "comments": [
    {
      "time": "5 Jun 2006 — 5:26am",
      "content": "[https://listserv.heanet.ie/cgi-bin/wa?A2=ind0511&L=typo-l&T=0&P=11403](http://web.archive.org/web/20121109100439/https:/listserv.heanet.ie/cgi-bin/wa?A2=ind0511&L=typo-l&T=0&P=11403 \"https://listserv.heanet.ie/cgi-bin/wa?A2=ind0511&L=typo-l&T=0&P=11403\")\n\n"
    },
    {
      "time": "5 Jun 2006 — 5:51am",
      "content": "Alessandro,  \nYour link was a real chortle, especially, \"Doing layouts in Word is like  \nrappelling down a barbed-wire rope in a Speedo\"\n\nChrisL\n\n"
    },
    {
      "time": "5 Jun 2006 — 6:32am",
      "content": "m-ga, I've used both of those approaches.\n\nI guess it depends on how far you need to extend the corporate identity already in use to extend to these kind of documents. But in short you can't expect to maintain exact appearance of Word-originated docs outside your organisation. If you absolutely need to, you convert them into PDFs first! Aside from fonts, other aspects of a document such as margins and use of half-point sizes depend to some extent on the currectly selected printer.\n\nNote re Option 1 -- you can embed TrueType fonts in the document fonts, but I don't think it's 100% reliable; there's a suspicious lack of documentation on exactly how the different levels of embedding permissions are implemented for example.\n\nSubstitution is built into Truetype but I personally have no idea how replacement of a given font is determined. I do know that in Word, a user without the correct font will see the text in the substituted font, but it will be described as using the originally specified font in the font dropdown box etc - this makes it a bit difficult to see what font is actually being subsituted in.\n\n"
    },
    {
      "time": "7 Jun 2006 — 3:19am",
      "content": "Thanks!\n\nThis is a long-term project, so I'll do some investigating and report back with my findings.\n\n"
    },
    {
      "time": "7 Jun 2006 — 1:20pm",
      "content": "[http://www.whartonsp.com/articles/article.asp?p=455908&seqNum=1&rl=1](http://web.archive.org/web/20121109100439/http:/www.whartonsp.com/articles/article.asp?p=455908&seqNum=1&rl=1 \"http://www.whartonsp.com/articles/article.asp?p=455908&seqNum=1&rl=1\")\n\n"
    },
    {
      "time": "8 Jun 2006 — 3:56am",
      "content": "Not sure what is meant by these unannotated links, Alessandro?\n\n"
    },
    {
      "time": "8 Jun 2006 — 6:33am",
      "content": "<cite>Note re Option 1 — you can embed TrueType fonts in the document fonts, but I don’t think it’s 100% reliable; there’s a suspicious lack of documentation on exactly how the different levels of embedding permissions are implemented for example.</cite>\n\nThe biggest problem with embedding IMO is that the fonts are 'unbedded' the moment the document gets saved in a Word that hasn't got the embedding option turned on wich kind of undermines the very point of embedding.\n\n"
    },
    {
      "time": "8 Jun 2006 — 6:44am",
      "content": "I've just tested this and the \"embed fonts\" option is specific to the document, not the application.\n\n"
    },
    {
      "time": "8 Jun 2006 — 7:09am",
      "content": "How about that?\n\nMust have been one the many restriction at the network I tested.\n\n"
    }
  ]
}
