{
  "id": "20444",
  "title": "Complimentary type faces",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "There seem to be a fair amount of books out there regarding type faces and I was under the impression that same would count for the web. But, I have been browsing quite a bit and I cannot find a site which gives you lots of examples of complimentary fonts. The \"big\" sites might give you an example of the type face in a particular use, but non make suggestions what to combine it with. (bit like <cite>\"people who bought this font also bought..... \"</cite>(Amazonism)) Surely someone would have set up a site where you type in a font and automatically a list of analogous, complimentary fonts would roll out... Does anyone know about such a site?\n\nBe great if you would like to share this.  \nW\n\n",
  "author": "Wimy",
  "time": "4 Jun 2006 — 4:58pm",
  "uid": "13252",
  "comments": [
    {
      "time": "4 Jun 2006 — 6:04pm",
      "content": "That's like kudos for physiognomy.  \n\"Typeface\" needs no space between \"type\" and \"face\".\n\n"
    },
    {
      "time": "4 Jun 2006 — 7:06pm",
      "content": "Alessandro;\n\nThat may take the 'easy' way out of type selection, but it's hardly condoning physiognomy. It's type. Not people. Maybe if you place the importance of type up there with human life, but I believe Wim had a reasonable request that, if one is so inclined, a reasonable response be offered.\n\nWim:\n\nI'm not aware of any such site in particular… myfonts.com will let you search by keyword. The most recent issue of Communication Arts has an article by [Jonathan Hoefler](http://web.archive.org/web/20121128170350/http:/typophile.com/wiki/Jonathan%20Hoefler) about mixing types. Chapter 6 of Robert Bringhurst's [Elements of Typographic Style](http://web.archive.org/web/20121128170350/http:/typophile.com/wiki/Elements%20of%20Typographic%20Style) has a chapter about choosing and mixing type ( ch.6 ) as well. You might try a search of this site, or if you could be more specific, maybe the kind folks here could give some suggestions.\n\nOh, and welcome to the forums!\n\n"
    },
    {
      "time": "4 Jun 2006 — 8:26pm",
      "content": "myfonts.com has little sections underneath font previews; categories that help identify the wider family to which a particular font belongs.  \nI think this might help, although it's not entirely what I described:\n\n[http://www.myfonts.com/browse/keyword/humanist/](http://web.archive.org/web/20121128170350/http:/www.myfonts.com/browse/keyword/humanist/ \"http://www.myfonts.com/browse/keyword/humanist/\")\n\nI believe you'll need to know what you're looking for, at least. Humanist, renaissance, neo-classical, etc.\n\n"
    },
    {
      "time": "4 Jun 2006 — 8:37pm",
      "content": "Eric, thank you for welcoming me to the forum and your references to some interesting articles. I had a feeling this topic would provoke some predictably, savvy forum users but there might be an opportunity in this concept.\n\nLet's see this thread evolve......\n\n"
    },
    {
      "time": "4 Jun 2006 — 8:47pm",
      "content": "I wonder how or whether this type of resource would be feasible.  \nTypefaces that \"work\" together should ideally be matched according to specific communication requirements etc. I see such a resource becoming or existing as a \"shortcut\" to the experimental art and nature of typography (and the development of type) - by simply providing tried and tested combinations.\n\n[Communication Design, Melbourne](http://web.archive.org/web/20121128170350/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "4 Jun 2006 — 10:04pm",
      "content": "See this thread; [Good book about type mixing](http://web.archive.org/web/20121128170350/http:/www.typophile.com/node/18342)\n\nAs Eben Sorkin stated simply in a related thread, \"the eye is the final arbiter\", I think this is true in finding complementary type solutions. Books covering the basics of type and typography such as Bringhurst’s [The Elements of Typographic Style](http://web.archive.org/web/20121128170350/http:/www.amazon.com/gp/product/0881791326/102-4072842-3990505?v=glance&n=283155) should give you a basic understanding on how to complement a typeface.\n\nAs for me, I'm an obsessive magazine collector and I usually take notice of good type combinations and \"steal\" them, not necessarily down to the exact typeface itself but it's overall style.\n\nI think it's very important to be able to recognize which typefaces are suitable for display or text, or both. It is usually unwise to pair two “strictly” display faces. Also, I like to try and find complementary typefaces with similar x-heights, but in the end it all comes down to how it looks. You decide.\n\nI hope this helps.\n\n"
    },
    {
      "time": "5 Jun 2006 — 12:29am",
      "content": "ahh but a resource like that would be great for us who have not yet the eye for recognizing good type in the first place not to mention good combinations!\n\nOr even better might be a list of what typefaces are used for specifically. Times for newspaper publications, comic sans for 8 yr old birthday party invitations, etc. Does this exist already? Maybe organized by blackletter, modern, humanist, etc.\n\nI've been reading about this a lot on certain threads but is this streamlined anywhere and put on the wiki?\n\n"
    },
    {
      "time": "5 Jun 2006 — 3:57am",
      "content": "Being a subjective area, Geoff Riding's recommendation – of collecting usages that appeal – seems more productive than following a list provided by a group (or individual). A list of specific uses would only be broad generalisations more restrictive than guidance.\n\nI could see the idea of creating an \"also bought\" feature might be a good sales tool for some smaller sites (individual designers/foundries) but larger (purely retail) sites would have to step carefully to avoid offence to their suppliers.\n\nTim\n\n"
    },
    {
      "time": "5 Jun 2006 — 5:55am",
      "content": "j\\_polo9 - I figure you're more likely to learn from experimenting (succeeding and failing)\n\n"
    },
    {
      "time": "5 Jun 2006 — 10:20am",
      "content": "Or even better might be a list of what typefaces are used for specifically. Times for newspaper publications, comic sans for 8 yr old birthday party invitations, etc. Does this exist already? Maybe organized by blackletter, modern, humanist, etc.\n\nI like this concept too, I'm thinking more along the lines of what was the original intended use of the typeface. This would still leave it's use expandable upon while giving a general baseline for a more specific application.\n\nThe idea being more than the broad understanding that Serif fonts are great for small body copy and San-Serif fonts for Display and Titling.\n\nThere are definitely fonts out there with the ability to perform both tasks equally, but was that the designers original intention? Aside from some of the more unique fonts available, I'd assume that most traditional fonts were designed with great versatility in mind.\n\n"
    },
    {
      "time": "5 Jun 2006 — 10:47am",
      "content": "\\> The idea being more than the broad understanding that Serif fonts are great for small body copy and San-Serif fonts for Display and Titling.\n\nOh, great. So now when I decide to use Serif for heads, sans for body, or both, I will be derided for \"wrong use.\"\n\n"
    },
    {
      "time": "5 Jun 2006 — 12:45pm",
      "content": "Identifont does a little bit of that too - but usually only gives you a few alternates.\n\n"
    },
    {
      "time": "5 Jun 2006 — 6:19pm",
      "content": "Timothy Samara's \"Type Style Finder: The Busy Designer's Guide to Choosing Type\" might be worth checking out, Wim.\n\n"
    },
    {
      "time": "11 Jun 2006 — 7:14pm",
      "content": "Nice one Andi, will try to check it out too.\n\n"
    },
    {
      "time": "11 Jun 2006 — 7:16pm",
      "content": "hahaha, throw it in to google and typophile comes up first, mustn'y be widely available.\n\n"
    }
  ]
}
