{
  "id": "20460",
  "title": "Fontlab 5, multiple family styles Open Type or Type 1",
  "forum": "Build",
  "tags": [

  ],
  "content": "Okay, I’m a really new user of Fontlab, and I have an extremely frustrating problem. My boss has given me the company’s old Garamond font which, right now, is broken up into about four sub catagories. That is, when you go into InDesign CS2 the font pulldown menu shows Garamond as all over the place. All together there are 31 styles and about 3 catagories for them all to go into. So, I singled out all the fonts, put them into Fontlab where I can now save them as vfb’s or otf’s but I can’t generate a suitcase that will allow for so many different styles within one Family. I’m sorry if I’m confusing anyone, this is really hard to explain.  \nI’ve tried changing the FOND IDs and made sure the Family Name, the Font Name, and the Full Names were all written the way they should be according to Adam Twardoch’s posts and Leslie Cabarga’s book. Every time I wind up with the same message...\n\n“Styles in FOND named “Garamond Book” cannot be merged.  \nYou have used duplicate styles.  \nCannot Proceed. Please fix the conflict.”\n\nBut that’s not true, I went through every single font info box and made them all unique to the font, regardless of file type. There’s no way the fonts have identical styles, they’re all named differently. Especially in the FOND ID line. Am I just way off track and there’s no way to stick so many fonts into a single family? Have I been pulling my hair out for no reason. It seems like a perfectly normal application for the program. Right? Thing is, the end result has to be an Open Type font. Mac Type 1 will work, but what I really need is an Open Type.\n\n [‹ Adding Hyphenation dictionaries in Ind](http://web.archive.org/web/20070808233847/http:/typophile.com/node/20521 \"Go to previous forum topic\") [Chosen option in Font Info ›](http://web.archive.org/web/20070808233847/http:/typophile.com/node/20447 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070808233847/http://typophile.com/user/13265\" title=\"View user profile.\">NRodenbeek</a>",
  "time": "<br>",
  "uid": "13265",
  "comments": [
    {
      "time": " 5.Jun.2006 10.17am",
      "content": "Could you post a list of the different styles? Complete names.... I’m asking because that sounds like a lot of styles for one design.\n\nI think OTF’s are standalone, and you can’t put them in suitcases. Either/or.\n\nOpenType would offer you the ability to reduce the number of styles, maybe substantially. Have you considered combining Small Caps and OSF fonts with the Regular one?\n\n"
    },
    {
      "time": " 5.Jun.2006 10.43am",
      "content": "{{OpenType would offer you the ability to reduce the number of styles, maybe  \n substantially. Have you considered combining Small Caps and OSF fonts with the Regular  \n one?}}  \nI don’t know what you mean?\n\nHere’s a list of all the styles, I’ll seperate them into the catagories I would ultimately like them in.\n\nGaramond  \n Garamond Bold  \n Garamond Bold Condensed  \n Garamond Bol Con Italic  \n Garamond Bol Ita  \n Garamond Book  \n Garamond Book Con  \n Garamond Book Con Ita  \n Garamond Book Ita  \n Garamond Book Small Caps  \n Garamond Light  \n Garamond Lig Con  \n Garamond Lig Con Ita  \n Garamond Lig Ita  \n Garamond Ultra  \n Garamond Ult Con  \n Garamond Ult Con Ita  \n Garamond Ult Ita\n\nGaramond Three  \n Garamond Thr  \n Garamond Thr Bol  \n Garamond Thr Bol Ita  \n Garamond Thr Bol Ita Old Style Figures  \n Garamond Thr Bold SC  \n Garamond Thr Ita  \n Garamond Thr Ita OSF  \n Garamond Thr SC\n\nGaramond Narrow  \n Garamond Nar  \n Garamond Nar Bol  \n Garamond Nar Bol Ita  \n Garamond Nar Ita\n\nGaramond Reprise  \n Garamond Rep Bol SC OSF  \n Garamond Rep Ita OSF\n\nNow, I’ve tried breaking these into smaller catagories, but I still get the same problem when the families are over the four different kinds of styles. Even when I make sure each one is unique and written the correct way the stupid generator tells me I have identical styles. Thanks for your help. You really want the birthday cards, huh?\n\n"
    },
    {
      "time": " 5.Jun.2006 4.24pm",
      "content": "Ah, I see.\n\nThese Garamonds are from different families, even though they are all named Garamond. Have you seen samples or specimens of these?\n\nI wonder what the final result is suposed to be: will you distribute the fonts to your organization, or keep them for your use, or...? I ask because you might not need to go through all these steps if your goal is simply to use them on your own machine. Also, re-combining them may be unnecessary....\n\nIt looks from the font names like you are trying to combine 3 or 4 different families of Garamonds. ITC Garamond, which it looks like you have, is very different from Adobe Garamond and that is noticeably different from Garamond Three, which you also have. So you may want to seek out the original install discs of these fonts to see where they came from and how they were grouped originally. That may explain why they appeared in the font menu in more than one place, and why you received them in sub categories. They are different.\n\nI’ve attached a gif showing a variety of the available Garamonds (just the romans, regular or book weight). You can see that some of them would not work very well together (visually) if you had them all in the same suitcase. Since you have been assigned to be the font guy there, you may want to become familiar with these. Be advised, however, that this is the tiny tip of a gigantic iceberg; if you don’t want a new obsession to take over your other work, you might have to tell your boss to find another font guy or gal. Figuring out the different Garamonds is a good first task to attempt; if you don’t have the patience or interest for it then you may not be a type nerd like me.\n\nIn your list there are some small cap and Oldstyle figure fonts (end with OSF or SC). They are separate fonts from the Regular ones. In PostScript we always had to choose between small caps and lowercase because you could only ever have 256 characters in a font. You can use them together, but you have to mix them in your document, like epoxy. OpenType is a new format that allows much larger character sets, which means the small caps, oldstyle figures, alternates, ligatures, etc. that are part of a single style (Roman, for example) can all go in one file. That would clean up your font list a lot. However you cannot group all the characters from the Bold Condensed in the main Bold OpenType font. Each style has its own font. And of course you would not put the characters from ITC Garamond in a file with the Adobe Garamond. You would have a revolt on your hands! ;)\n\nThere are some books you might like to have to help with this:\n\nHow To Boss Your Fonts Around, by Robin Williams,  \nAnatomy of a Typeface, by Alexander Lawson,  \nThinking With Type, A critical Guide... By Ellen Lupton  \nThe Elements of Typographic Style, by Robert Bringhurst\n\nThere are others, maybe some other typophiles will recommend. There are other books listed in the typowiki as well.\n\nNow, I haven’t really solved the problem you wrote about. I didn’t ask which version of FontLab, or platform, but I think I should suggest you check the FontLab site for support info (there’s a forum to visit), since the problem you’re having could be a bug. The newer version of FL (5.02) seems to be more stable than the previous one. I realize the FontInfo window in FL is a hornet’s nest, and managing a lot of styles from FL is likely to make anyone cry, So don’t get too burned up.\n\nAnother option is to employ a font management program, and there’s a great new free one out from Linotype: FontExplorer X. I am not sure, and others can chime in here, but I think it might have the ability to organize and re-unite font families. That could solve the problem for the whole office, without cost. Just an idea.\n\nBirthday cards sound nice, but I’d rather that you have a good experience with your fonts and keep your boss happy.\n\n ![](http://web.archive.org/web/20070808233847im_/http:/typophile.com/files/garamonde_4108.gif)\n\n"
    },
    {
      "time": " 5.Jun.2006 4.52pm",
      "content": "AFAIK, a family with both Regular and Book won’t work in InDesign, so watch out...\n\n"
    },
    {
      "time": " 6.Jun.2006 12.21pm",
      "content": "Awesome, thank you so much. I was starting to suspect that I’d have to totally submerse myself in this font stuff to ever get a real grasp on it. It looks like my worst fears have been realized. It’s time I become a type-nerd.  \nNow, I’m working on Fontlab 5.0.2, and I understand you can make a single opentype font that is many characters deep. However, I don’t see how you make them. Is that what glyph generating does? And once you do generate some glyphs, i.e. “A.smcp;B.smcp;C.smcp...” how do you toggle between those when you’re in another program like InDesign?  \nMaybe I should tackle a smaller font family first, like the Garamond Books. If I have each style in Fontlab 5 and they’re all seperated and I have them saved as vfb’s or seperate otf’s or whatever I need to save them as, how do I get them to combine into one file that can be dropped into Extensis Suitcase and turned on so that all programs can use it? Does that make sense? It does to me, but I’m not sure I’m sane anymore.\n\nAlso, I was also starting to see that book and regular Garamonds wouldn’t work together, so thank you Miguel. You’ve saved me another entire eight hour shift of complete frustration.  \nTell me, do you guys dream about font vectors? Because I do. And it sucks.\n\nThanks again for everyone’s help. And I really am having fun.\n\n"
    },
    {
      "time": " 6.Jun.2006 12.48pm",
      "content": "The use of these fonts will be for distribution among the company. I think some of the design and layout people were tired of having to completely switch fonts instead of being able to pull down a list of only Garamonds. So, yeah, to answer the initial question, not for personal use.\n\n"
    },
    {
      "time": " 6.Jun.2006 4.01pm",
      "content": "I think the posts were extremely well done. But did the company at least think about buying the opentype version of those different Garamond fonts?  \nIt’s good to learn in this way, but you first have to check what the license agreement of the foundries says.  \nAnd it’s also interesting to take a deep look at the very last fonts (or fonts versions) to understand the secret of making things work :)\n\n"
    },
    {
      "time": " 6.Jun.2006 4.24pm",
      "content": "Good point, Elena.  \nAnd Noah, considering the time you’ve already spent (plus the extra one you’ll still need), It’s probably much cheaper to just buy the fonts. In addition you know they’ll work properly.\n\nDeveloping fonts is no state secret, but don’t expect to learn it overnight. And font development is getting more and more complex every day, as new functionalities are added to the font files.\n\n"
    },
    {
      "time": " 7.Jun.2006 7.18am",
      "content": "Yeah, I don’t think anyone here knows how much work this is turning out to be. They gave me this as a sort of side project to my normal workflow and it’s really stressing me out. I’ve learned a ton of info really quickly, but it’s frying my brain just thinking about starting over and making three key fonts now for the ITC, 3 and normal versions of Garamond just so I can reproduce all the styles for each one. So, tell me, how does one buy an open-type font? And how can I be sure it’s going to work on every platform, like InD CS2 and Illustrator CS2 as well as Mac OS9 and OS10?  \nAnd thanks, everybody, for not making me feel too stupid here. It’s probably annoying to see some new guy faining ignorance while asking advanced questions that are obviously out of his depth. I’m glad I found this forum.\n\n"
    },
    {
      "time": " 7.Jun.2006 8.17am",
      "content": "A ha, new question. so, I’m starting from scratch, running through each fonts information, and I come to the copyright info which, for Garamond 3 regular, is reading “Adobe Systems Incorporated” and I’m thinking that this may have a huge role in my problem. If I’m working with Adobe fonts and trying to get them to work with fonts copyrighted by someone else on the ITC Garamond end, will that hinder my ability to get them all harmonized?\n\n"
    },
    {
      "time": " 7.Jun.2006 10.13am",
      "content": "I am not really sure what you mean by the last post. Only thing that comes to my mind is that (as far as I know) ITC does not allow any modification of their fonts. ;-)\n\nAbout licensing fonts: I’d suggest that you decide which one of these Garamonds you want, and then get it from the foundry which made it. It seems you need to ask for site licenses if you will use them among a company.\n\n"
    },
    {
      "time": " 7.Jun.2006 10.46am",
      "content": "I’m sure we’ve got the liscencing, that’s not really my issue. My problem is that I don’t know what I’m doing, but everytime I mess around with it, I get something new. Like, the set of fonts my boss gave me seems to be a mixture of some ITC’s and then the standard Adobe fonts, which I now see will never mix, and all of them are post-scrypt fonts. There’s two major issues there. One, he asked me to make a set of Open Type fonts out of these post-script fonts to match this Small Caps OpenType Garamond we have. Two, I have no idea what the hell that means. I thought I could just stick it all into Fontlab, regenerate them as Open-Types, and tthey’d naturally group themselves together in InD CS2.\n\n"
    },
    {
      "time": " 7.Jun.2006 12.13pm",
      "content": "A-ha!\n\nIt may be that you don’t know what you’re doing, but your boss really doesn’t know. It isn’t worth your or your boss’ time ( = Money ) for you to try to make OpenType fonts from what you have.\n\n1. It’s MUCH harder than you are prepared for - weeks and weeks of tedious work you’ve never done before\n\n2. The typefaces you are starting with aren’t that versatile or useful anyway (ITC Garamond is only useful for a very dated kind of display work, no text)\n\n3. The problem is easily solved by licensing well-made OpenType fonts for your whole company. OpenType fonts are cross-platform and can be installed on Macs or PCs. Same file goes to anyone. Professionally-made OpenType fonts will have appropriate kerning, encodings, character sets, and functional OpenType features which are useful to you when using InDesign or Illustrator. Worth the money.\n\nConsider conferring with the design people in the company and see if there’s any consensus on what typefaces they would want. Choose one serif and one sans family, license them, distribute them and declare them corporate typefaces. Delete the others and join the 21st century. Then you can get back to your regular work.\n\nVersatile, workhorse OpenType Pro serif types:\n\nBembo Book Pro  \nAdobe Garamond Pro  \nAdobe Garamond Premier Pro (a different design from Adobe Garamond with more size variants)  \nMinion Pro  \nAdobe Caslon Pro  \nGalliard Pro  \nUtopia Pro  \nITC Charter Pro\n\nVersatile, workhorse OpenType Pro sans fonts:  \nMyriad Pro  \nMeta Pro  \nGill Sans Pro\n\nAnd superfamilies with harmonious Serif and Sans variants (can’t go wrong here):\n\nLegacy Serif and Sans Pro  \nMentor Serif and Sans Pro  \nAbsara Serif and Sans OpenType  \nFreight Text and Sans OpenType\n\nBest of luck!\n\n"
    }
  ]
}
