{
  "id": "2046",
  "title": "Ikarus?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "when i read some older threads yesturday i read about ikarus the first time. after searching google it looks like it isnt available anymore, or only in \"modified\" versions. can anyone update me on this? what is it all about? is the algorhytm still the best? what i your favourite tracing tool? etc.etc. thanks: lars\n\n",
  "author": "lars",
  "time": "12 Nov 2003 — 1:12am",
  "uid": "2145",
  "comments": [
    {
      "time": "11 Dec 2003 — 5:53am",
      "content": "Obviously there are not that many Ikarus users amongst the Typophile attendees (anymore). Ikarus was developed by Dr. Peter Karow in the early 1970s and was for a long time the de facto program for professional font production. In time versions of Ikarus were developed by URW in Hamburg for all kinds of operating systems, including Solaris, Sun OS, DOS and Mac OS. The versions for DOS (Ikarus B/D) and Mac OS (Ikarus M) were more or less stripped end user editions which lacked most of the enhanced batch functionality of the 'bigger' Ikarus systems running under Unix.   \n   \nThe Ikarus algorithm has been developed for the conversion of analog material to digital descriptions. In the Ikarus system all points are placed on the contour, which for instance is not the case with B\n\n"
    },
    {
      "time": "11 Dec 2003 — 7:24am",
      "content": "thanks franks for this \"indeep review\" ![:-)](http://web.archive.org/web/20150108095709im_/http:/www.typophile.com/forums/clipart/happy.gif) lars\n\n"
    },
    {
      "time": "11 Dec 2003 — 8:12am",
      "content": "Thanks, Frank!   \nA question: in that drawing, what are the three lines around the x-height?   \n   \nhhp\n\n"
    },
    {
      "time": "11 Dec 2003 — 9:26am",
      "content": "In the preliminary drawing for the roman of DTL Fell two lines are used to indicate the thickness of horizontal serifs. The third line is a guideline for the overshoot but not more than that. The curves of the h, m and n do not touch the overshoot for the more rounded letters like the o. I would like to underline here that this is a very early drawing from a small series that was used by several people at DTL to make more definite versions. Basically the work on the typeface has almost been finished now; the character sets are complete but we still have to do some fine tuning here and there, especially the spacing needs some extra attention. I have included here a low res illustration to give you some idea of the work we have been doing since 1997. ![DTL Fell_trial](http://web.archive.org/web/20150108095709im_/http:/www.typophile.com/forums/messages/4101/22173.gif)\n\n"
    },
    {
      "time": "28 Jan 2006 — 3:39pm",
      "content": "Is it possible to \"reanimate\" this link from Mr Blokland's post?\n\n--\\> [http://www.typophile.com/forums/messages/30/20126.html](http://web.archive.org/web/20150108095709/http:/www.typophile.com/forums/messages/30/20126.html \"http://www.typophile.com/forums/messages/30/20126.html\")\n\n"
    },
    {
      "time": "28 Jan 2006 — 4:50pm",
      "content": "I think it's [How to calculate the best font metrics?](http://web.archive.org/web/20150108095709/http:/www.typophile.com/node/2000), but I could be wrong.\n\n"
    },
    {
      "time": "29 Jan 2006 — 3:56am",
      "content": "Thank you! Seems this is it, the date is correct.\n\nKarsten\n\n"
    },
    {
      "time": "2 Feb 2006 — 5:31am",
      "content": "\"A question: in that drawing, what are the three lines around the x-height?\"\n\nHrant, there are sometimes 11 lines around the x-ht.\n\n"
    },
    {
      "time": "2 Feb 2006 — 9:54am",
      "content": "_A little_ IKARUS _trivia_\n\n-- IKARUS is (and has always been) spelled in all caps by URW, and to my knowledge is neither an acronym nor an initialism of any expression.\n\n-- Ever since I was introduced (1981) to the IKARUS System, I personally took issue with the name and foolishly argued the point with Dr. Peter Karow and Peter Rosenfeld. (Yes, I was, and forever will be foolish.) [_My argument_](http://web.archive.org/web/20150108095709/http:/www.loggia.com/myth/daedalus.html) was that in Greek mythology, Icarus was the foolish son of Daedalus, who once given mechanical wings by his father, ignored the warning of flying to close to the sun, and thereby fell to his death. Not a great person to name anything after, as Daedalus was the smart innovator and Icarus was the fool.\n\n-- [**Marconi**](http://web.archive.org/web/20150108095709/http:/www.myfonts.com/fonts/linotype/marconi/), designed by Hermann in 1976, was the first type family developed for typesetting by the IKARUS System.\n\n ![](http://web.archive.org/web/20150108095709im_/http:/typophile.com/files/Marconi-Zapf-URW.png)\n\n-- Because of this topic thread, I reopened my copy of Dr. Karow's book, _Digital Formats for Typefaces_ (1987), and rediscovered several interesting visual excersises and references that would still be viable for graphic design students (_clothoids_, circle/square/triangle visual perception survey, etc.).\n\n"
    },
    {
      "time": "7 Feb 2006 — 11:54am",
      "content": "\\> there are sometimes 11 lines around the x-ht.\n\nSounds juicy. I only use like four or something, and (so?) I don't  \neven mark them, preferring to keep them in my head (and they  \ncan always be \"looked up\" if needed).\n\nSo what are some \"non-obvious\" lines/marks?\n\nhhp\n\n"
    },
    {
      "time": "14 Feb 2006 — 6:20am",
      "content": "For those interested still in the Ikarus format, it might be interesting to know that a new edition (2.5) of DTL FontMaster will be released soon. IkarusMaster (like BezierMaster) includes several new options, including the possibility to import and export fonts directly. This functionality is the same as in DataMaster, but only for one font at the time instead of batching like in DM.  \nProgramming has been finished recently and currently I am working on the update of the supporting files (Character Layout, Features, Kern[class], et cetera).\n\nVersion 2.5 of DTL FontMaster will be the last released also for Classic besides Windows. Later in 2006 the first range of FM batch modules for OS X will be made available.\n\n"
    }
  ]
}
