{
  "id": "20466",
  "title": "Another optical trick?",
  "forum": "Build",
  "tags": [

  ],
  "content": "Since I got such excellent advices last time with my O – I feel I must ask this aswell. This is also some kind of optical trick to pull I believe, and maybe related (?). Is this also some variant of the “bone effect”?\n\nPlease, look where the arrow is in this picture. It seems that the stroke is not straight where the arrow is, there is a little irritating circular (I wish my english was more technical) inside-moving “thing” that almost makes it look like I have put a point there, and moved it inside towards left.\n\nSee it?\n\nThe points are placed as you can see, is there a better way of placing the points for a more straight “ending” that later on transforms into the little serif. I want the stroke to look 100% straight and end with this little serif at the bottom.\n\nWhat would you do to make this perfect?\n\nI thought that these triangular points would be best suited since it puts the handle in the exact angle based on the other point above, but this doesnt look good!\n\nThanks in advance.\n\n ![](http://web.archive.org/web/20080624181246im_/http:/www.typophile.com/files/anothertrickyone_6139.png)\n\n [‹ Why not Cyrillic Glyph Names instead of afii00xx?](http://web.archive.org/web/20080624181246/http:/www.typophile.com/node/20508 \"Go to previous forum topic\") [Kerning & Metrics-assistance in FOG ›](http://web.archive.org/web/20080624181246/http:/www.typophile.com/node/20587 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080624181246/http://www.typophile.com/user/11526\" title=\"View user profile.\">Goran Soderstrom</a>",
  "time": "<br>",
  "uid": "11526",
  "comments": [
    {
      "time": " 5.Jun.2006 1.34pm",
      "content": "Try shortening the two bezier arms on the right side. I do see that it looks almost like there is an inward dip in the curve as things are now. Maybe you should show the whole glyph though.\n\n"
    },
    {
      "time": " 5.Jun.2006 2.31pm",
      "content": "You might also move the lower left point on the base line slightly to the right because it affects the illusion on the other side of the stroke. Correcting for illusions seen at small sizes while looking at large sizes can be tricky. Hang in there! Fighting frustration is all part of the learning process—but a tall cool beer helps sometimes :-)\n\nChrisL\n\n"
    },
    {
      "time": " 5.Jun.2006 3.02pm",
      "content": "I think your right, I do need a beer ;-)\n\nThanks for advices.\n\n"
    },
    {
      "time": " 5.Jun.2006 3.09pm",
      "content": "Looking great Goran, can’t wait to see more characters (post ’em if you’ve got ’em).\n\n"
    },
    {
      "time": " 5.Jun.2006 3.26pm",
      "content": "Goran,\n\nType design consists of repeated changes, fixes, refinements. If you have a clear idea in your head of the shapes you want, then I suggest you experiment. If something doesn’t look right, slide the points around. Add points. Subtract points. Change the relationship of the control points. Eventually you will discover what bezier outlines can do, and you will also discover how to control them to get the effects you want. Do not cling to a previous outline; there’s no savings, economy or thrift in that. Put old outlines in the background and try again. In FontLab Studio 5 you can even leave points selected in the background so you can see what you did before.\n\n"
    },
    {
      "time": " 6.Jun.2006 11.55pm",
      "content": "Crossgrove, thanks for wise words. Of course I do experiment, everything I do is an experiment. But sometimes, I want to take the fastlane into learning, then all these useful tips here on Typophile are perfect.\n\n;-)\n\n"
    },
    {
      "time": " 11.Jun.2006 6.30pm",
      "content": "show MORE\n\n:P\n\n"
    },
    {
      "time": " 11.Jun.2006 11.23pm",
      "content": "Not yet ;-)\n\n"
    }
  ]
}
