{
  "id": "20474",
  "title": "TrueType vs. OpenType",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi all,  \nWhat's the current difference between TrueType and OpenType these days? I'm thinking of buying some fonts in the next few days and have an option between (and PostScript). I work with fonts mostly in InDesign and do a fair amount of PDF exporting. Is there a specific advantage for me?\n\nBest,  \nWill\n\n",
  "author": "winglets747",
  "time": "5 Jun 2006 — 6:01pm",
  "uid": "3967",
  "comments": [
    {
      "time": "5 Jun 2006 — 6:06pm",
      "content": "[http://typophile.com/wiki/OpenType](http://web.archive.org/web/20120415222711/http:/typophile.com/wiki/OpenType \"http://typophile.com/wiki/OpenType\")\n\n[http://typophile.com/wiki/TrueType](http://web.archive.org/web/20120415222711/http:/typophile.com/wiki/TrueType \"http://typophile.com/wiki/TrueType\")\n\n«Both Adobe and Microsoft had their own technologies for encoding and rendering fonts, and instead of hammering out a new rendering technology to match the new format, **they instead decided to allow OpenType fonts to contain either Type 1 or TrueType outlines** , resulting in two types or flavors of OpenType fonts.»\n\n"
    },
    {
      "time": "5 Jun 2006 — 8:29pm",
      "content": "Who wrote that? I've never heard that claim before.\n\nIt would be more accurate to say that despite OpenType being an extension of TrueType, Microsoft and Adobe agreed to allow the new standard to support PostScript outlines (as well as TrueType outlines) to aid the conversion and transition from PostScript Type 1 to OpenType.\n\n"
    },
    {
      "time": "6 Jun 2006 — 12:25am",
      "content": "its directly taken from the wiki, sii.\n\ni always thought of opentype as a kind of \"container\" for either ttf or t1, but not that im an expert for these kind of things in anyway.\n\n"
    },
    {
      "time": "6 Jun 2006 — 12:33am",
      "content": "Hi Will,\n\nFor your purposes, OT has the ability to contain many more glyphs, so you could get Small Caps and Oldstyle figs with the regular weight. Also OT files can be used on Macs or PCs. If you aren't sharing files in-house this may not be useful.\n\nBe aware, many vendors are selling OT collections now, and they may simply be TT or PS fonts converted to OT, with no additional glyphs. Look carefully at the character set of OT fonts you are considering. Some vendors use the name OpenType Pro to designate fonts with extra characters. The \\*Pro\\* name usually means there are extras built in. See [Adobe's](http://web.archive.org/web/20120415222711/http:/store.adobe.com/type/opentype/main.html) or [Monotype's Pro](http://web.archive.org/web/20120415222711/http:/www.fonts.com/AboutFonts/Articles/fyti/OpenTypePro.htm) OpenType pages. Adobe's talks about what OpenType is and how to use it; Monotype's talks more about the question you're asking.\n\n"
    },
    {
      "time": "6 Jun 2006 — 4:53pm",
      "content": "\\>its directly taken from the wiki, sii.\n\nthanks I'll go in and give it an edit. ;-)\n\n"
    },
    {
      "time": "6 Jun 2006 — 5:36pm",
      "content": "Many thanks everyone!\n\nBest,  \nWill\n\n"
    }
  ]
}
