{
  "id": "20495",
  "title": "Frederick Warde's Arrighi: looking for a specimen",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Can anyone send me a scan of an example of Frederick Warde's Arrighi typeface? I need to see this face in use.\n\nThanks!\n\nPaul  \n [inferno\\_press@mac.com](mailto:inferno_press@mac.com)\n\n",
  "author": "inferno",
  "time": "6 Jun 2006 — 3:53pm",
  "uid": "12838",
  "comments": [
    {
      "time": "6 Jun 2006 — 4:12pm",
      "content": "[This](http://web.archive.org/web/20131015042104/http:/infoshare1.princeton.edu/rbsc2/ga/unseenhands/collection/F3DSC_0003.jpg) is set in Arrighi (and Centaur), and you can't get much more historicallly interesting either. (Ok. that's my opinion.)\n\nFYI: _This Is a Printing Office,_ by Beatrice Warde, 1932. Broadside.\n\n"
    },
    {
      "time": "6 Jun 2006 — 4:15pm",
      "content": "That might just be the Arrighi Italic which was originally paired with Centaur Roman. Darn you Morrison!\n\n"
    },
    {
      "time": "6 Jun 2006 — 7:09pm",
      "content": "Hmmm, maybe this:\n\n[Centaur & Arrighi](http://web.archive.org/web/20131015042104/http:/www.mwbixler.com/spec_htm/spbk_centarr1_x.html)\n\n"
    },
    {
      "time": "6 Jun 2006 — 7:37pm",
      "content": "Those are some good links! Although the latter resized my browser. Bah.\n\n"
    },
    {
      "time": "7 Jun 2006 — 6:40am",
      "content": "You'll want to get your hands on a copy of Fine Print On Type.  \nPage 106 has an in depth piece on Warde - and pics of the Arrighi development - punches and all.\n\nAbebooks.com has them starting at $10.\n\n"
    },
    {
      "time": "7 Jun 2006 — 9:37am",
      "content": "Dear Miss Tiffany,\n\nThanks so much for sending this sample along. I appreciate your help. Now, concerning your comment: \"Darn you Morison!\" do I take it that you hold a grudge against this esteemed man of letters? If so, you may be interested in my parody of Stanley Morison: \"Stanley Morison's Egg-Sandwich Exegesis\" which I published in April in a limited edition of 100 copies. I expected only a handful of people on the planet might be interested in this (respectful) parody of the Master's prose style, and given your interests, you may one of the select few for whom this piece was written. Please see [http://infernopress.blogspot.com](http://web.archive.org/web/20131015042104/http:/infernopress.blogspot.com/ \"http://infernopress.blogspot.com\") for details. I still have a few copies left.\n\nIn any event, thanks for your help.\n\nPaul\n\n"
    }
  ]
}
