{
  "id": "20497",
  "title": "No Dogs Allowed on The City Walls metal sign",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi there,\n\nCan anyone help me with this one, please? How about that wacky-do spacing?! They could have used a super-expanded and still had room to spare. Maybe they think dog owners need to be spoken to slowly? :-)\n\nCheers,  \n/stephen\n\n ![](http://web.archive.org/web/20131017053038im_/http:/typophile.com/files/nodogs_5230.jpg)\n\n",
  "author": "Stephen Lording",
  "time": "6 Jun 2006 — 8:21pm",
  "uid": "4919",
  "comments": [
    {
      "time": "6 Jun 2006 — 9:39pm",
      "content": "Does that even make sense in Australia? You have anti-gravity dogs when you get down under?\n\n"
    },
    {
      "time": "6 Jun 2006 — 9:57pm",
      "content": "No anti-grav dogs, alas. Just kangaroos that we use to ride to work. :-)\n\nAs for the sign, a friend took it for me somewhere in her travels, but I can't remember where. This is the full image. Perhaps that board in the bottom-right is a clue, but it's not enough of one for me.\n\n ![](http://web.archive.org/web/20131017053038im_/http:/typophile.com/files/Nodogs-full_3857.jpg)\n\n"
    },
    {
      "time": "7 Jun 2006 — 12:11am",
      "content": "Cut'n'pasting from [another thread](http://web.archive.org/web/20131017053038/http:/typophile.com/node/20302):\n\nYou have to realise that this kind of lettering is output device-specific: it is a set of characters that is produced specifically for a certain type of sign making machine. This means it has no equivalent in what we know as digital fonts.\n\nOther examples are alphabets available for the stamping machines that produce automobile license plates, for sowing and embroidery machines, for stone engraving et al. It just is a different world. In some rare cases you’ll find alphabets that have digital font counterparts, but more often than not they will be unique to that reproduction system.\n\n"
    },
    {
      "time": "7 Jun 2006 — 2:19am",
      "content": "Goodo, that makes sense. But can anyone suggest a digital typeface that comes close?\n\nSo does that mean the people making the machines start from scratch each time? Or is there a set of non-digital sets that they'll call on?\n\n"
    },
    {
      "time": "7 Jun 2006 — 3:10am",
      "content": "To add some useless – and completely OT – words, on the board there seems to be a Richard Coeur De Lion/Lion-Heart coat of arms (the red one with three golden lions passing). I can't see the top one who could be the city emblem (or anything else, of course, as well as the one in the very corner).  \nJust because I'm terribly curious, could you please post that detail a bit bigger?\n\n"
    },
    {
      "time": "7 Jun 2006 — 3:22am",
      "content": "\\> _So does that mean the people making the machines start from scratch each time? Or is there a set of non-digital sets that they’ll call on?_\n\nI suppose they must have their \"type\" manufacturers as well, but this probably is a parallel circuit with little to no overlaps with the digital world.\n\nAs for similar typefaces, what about H&FJ's [Knockout No. 32: Junior Cruiserweight](http://web.archive.org/) or Jim Parkinson's [Balboa Light](http://web.archive.org/web/20131017053038/http:/www.typedesign.com/fonts/ballight.html)? YouWorkForThem's [Ultramagnetic](http://web.archive.org/web/20131017053038/http:/youworkforthem.com/product.php?sku=T0020) is more condensed but has the rounded corners.\n\n"
    },
    {
      "time": "7 Jun 2006 — 7:54pm",
      "content": "I love curiosity. Here's the detail at full size for you. Does that help?\n\n ![](http://web.archive.org/web/20131017053038im_/http:/typophile.com/files/detail_5962.jpg)\n\nThanks for your suggestions, Yves. Ultramagnetic is just what I'm after.\n\n"
    },
    {
      "time": "7 Jun 2006 — 11:48pm",
      "content": "Stephen,  \nThanks a lot!  \nJust the few things I could find out using the little memories I have of heraldry. The half crest on the top is an early Plantagenets and the half near the \"M\" is a late for the same bloodline, probably taken from the Tudor coat of arms. Just below the \"M\" there's what looks like the city of York's crest, but the color of the cross should be red not black, so it could be something completely different.  \nThe only thing that makes me link again the place with that county is the Yorkshire White Rose below the Lion-Heart and the (maybe)York crests.  \nI couldn't figure out the three at the bottom.  \nI had some serious geek-fun with this :)\n\n"
    },
    {
      "time": "8 Jun 2006 — 12:40am",
      "content": "Another candidate -- the absolutely gorgeous [FF Hydra Text](http://web.archive.org/web/20131017053038/http:/www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufacturer&displayfontid=FF.11463.0.0).\n\n"
    },
    {
      "time": "13 Jun 2006 — 2:51am",
      "content": "Jacopo,\n\nI thought you might be interersted? A friend of mine did some googling, A9ing, Flikring, etc, etc and found these links:\n\n[http://www.flickr.com/photos/chyleung/160796547/](http://web.archive.org/web/20131017053038/http:/www.flickr.com/photos/chyleung/160796547/ \"http://www.flickr.com/photos/chyleung/160796547/\")\n\n[http://www.york24.org/tye/thingstodo/krich/pages/Dcp\\_2550.htm](http://web.archive.org/web/20131017053038/http:/www.york24.org/tye/thingstodo/krich/pages/Dcp_2550.htm \"http://www.york24.org/tye/thingstodo/krich/pages/Dcp\\_2550.htm\")\n\nQuite an impressive bit of web-sleuthing, I think. :-)\n\n"
    },
    {
      "time": "13 Jun 2006 — 4:19am",
      "content": "Gravur Condensed at [www.lineto.com](http://web.archive.org/web/20131017053038/http:/www.lineto.com/ \"www.lineto.com\") has a similar feel,  \nalthough it is slightly more rounded. It is supposedly  \nbased on the standardised alphabet seen in Switzerland  \non signs/rubbish bags etc, which is not drastically  \ndifferent to the genric output device typeface used on  \nthis sign.\n\n"
    },
    {
      "time": "13 Jun 2006 — 7:28am",
      "content": "Stephen – impressive (verging on obsessive, especially blaming it on a \"friend\":)  \nTim\n\n"
    },
    {
      "time": "14 Jun 2006 — 6:59am",
      "content": "Stephen,  \nShame your friend is not registered here, otherwise he could have be posted the links himself telling that you found them :p  \nThanks a lot for sharing, at least I know that even if I'm nothing in type ID I have some hope in heraldry... anyone looking for a jester?\n\n"
    },
    {
      "time": "15 Jun 2006 — 7:41pm",
      "content": "Phil - Thanks for the link.\n\nTim - Hehe. I wish it had been me. I was so impressed when James\\* emailed me the links. It's not enough just having the tools to look, you also need to know <cite>how</cite> to look: knowing that that 'gate-thingy' is actually a portcullis, for example.\n\n\\*(What? Am I making up names as well now?) :-)\n\nBlueJ - Thanks for your contribution. \"Geek-fun\" is the best sort of fun. Well, one of the best, anyway. :-)\n\n"
    }
  ]
}
