{
  "id": "20509",
  "title": "Constructed record label logotype",
  "forum": "Design",
  "tags": [
    "Logos / Corporate ID Design",
    "Design"
  ],
  "content": "Hi,\n\ncurrently working on a logo for a new Danish record label start-up (see below) and in dire need of some feedback/help. I feel that most of letters work fine, but especially the Y is troubling me. So i am grateful for any constructive criticism.\n\nThanks in advance,\n\nSeb\n\n ![](http://web.archive.org/web/20131103093358im_/http:/typophile.com/files/yessirconcept_4866.png)\n\n",
  "author": "all about seb",
  "time": "7 Jun 2006 — 5:31am",
  "uid": "7285",
  "comments": [
    {
      "time": "7 Jun 2006 — 6:18am",
      "content": "Update: Redrawn the Y character and went back to a straight version of the I and R to enhance the contrast between the 2 sides. better or worse?\n\n ![](http://web.archive.org/web/20131103093358im_/http:/typophile.com/files/yessirconcept2_3967.png)\n\n"
    },
    {
      "time": "7 Jun 2006 — 6:25am",
      "content": "you could split the Y at the top\n\n ![](http://web.archive.org/web/20131103093358im_/http:/typophile.com/files/yessir_4895.gif)\n\n"
    },
    {
      "time": "7 Jun 2006 — 6:31am",
      "content": "Personally, from an aesthetic vantage point, i like the terminal of the Y that matches the terminal of the S - the very first letter Y in your first post.\n\nI know that the letter I with rounded ends does not really match any other letter, but it's funky and occupies less space that the solid vertical letter in the last sketch. It allows for more breathing room for the letters beside it.\n\nNo funky counters for the e and r? small pin hole circles like those in records? With the two different colours in use, why not push the two words together? (Random thoughts!)\n\n"
    },
    {
      "time": "7 Jun 2006 — 6:50am",
      "content": "James & Andi,\n\nthank you so much for your helpful feedback.\n\n<cite>you could split the Y at the top</cite> - thats a really nice idea as i was never that happy with the semi-circle holes.\n\n<cite>i like the terminal of ... the very first letter Y in your first post</cite> - i think with the added split that this will be the one.\n\n<cite>With the two different colours in use, why not push the two words together? (Random thoughts!)</cite> - not random at all ;) the final logo will overlap on S's - so we are thinking a like...\n\nBack to Illustrator and i ll post an update later.\n\n"
    },
    {
      "time": "7 Jun 2006 — 7:07am",
      "content": "Y is a touch too high at the top where the top right interacts with the E (why is that lowercase? btw). My preference is for your third sample with no counters or semi-circles.  \nTim\n\n"
    },
    {
      "time": "7 Jun 2006 — 7:47am",
      "content": "Okay, here is an updated version that is really growing on me. it seems like a slight departure from the original concept, as i ended up adding more elements then i intended. But see for yourself:\n\n ![](http://web.archive.org/web/20131103093358im_/http:/typophile.com/files/yessir3_3736.png)\n\ntimd, there is no 'special' reason why the E is lowercase - it is just that with the elements i decided to use i couldn't make a capital E work. Maybe i gave in to easily?\n\n"
    },
    {
      "time": "7 Jun 2006 — 8:05am",
      "content": "The kicking out leg of the R is an interesting idea - gives the letter more movement, leads your eye to the right. It does seem a tad wide though, as compared to the other vertical leg. The balance just seems a tad bit off, eh?\n\nThe same goes for the terminal on the Y. James' Y seems to be a bit better balanced up top. What do you think?\n\n(Oooo... an overlapped S - like that!)\n\n"
    },
    {
      "time": "7 Jun 2006 — 8:46am",
      "content": "'Better balanced up top'. No.  \nSebastian's hit the mark there, as I was strying to suggest a split that mimics the one at the terminal. I just did that very quickly.\n\nYes love the 'R'.\n\n"
    },
    {
      "time": "7 Jun 2006 — 11:04am",
      "content": "You've given it a nice organic quality. The only thing troubling me right now is that where the E meets the S is the only place where two sharp edges meet. I like the shape they make - but maybe you could go back to an earlier \"I\" so that it makes a similar join with the R (which I love too - mirrors the Y nicely) or flip it so the sharp edge meets the S. I dunno.\n\n"
    },
    {
      "time": "7 Jun 2006 — 11:54pm",
      "content": "Thanks again for all your feedback and Patricia, i think you are spot on about the sharp edges meeting - i ll have another look and try your suggestions.\n\n"
    },
    {
      "time": "8 Jun 2006 — 7:43am",
      "content": "I just had a thought that you are almost verging on an ambigram if the e and I could be reconciled, the Y and R are almost there already.  \nTim\n\n"
    },
    {
      "time": "11 Jun 2006 — 12:43am",
      "content": "got any updates seb?\n\n[Communication Design, Melbourne](http://web.archive.org/web/20131103093358/http:/www.solid-creative.com/)\n\n"
    }
  ]
}
