{
  "id": "20508",
  "title": "Why not Cyrillic Glyph Names instead of afii00xx?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "[Cyrillic](http://web.archive.org/web/20150420220857/http:/typophile.com/wiki/Cyrillic) glyphs have names just like any other script. If I create a [Greek](http://web.archive.org/web/20150420220857/http:/typophile.com/wiki/Greek) font, alpha is the name of the first letter, not a code. I am not a Russian speaker and have a hard time going back and forth between the glyph name, unicode number, what the glyph looks like, and the so-called glyph name afii\\_thing. Is there a reason why they can't just use the real glyph names just as they do in Latin and Greek? I feel like I need a Rossettastone to tell me what I am looking at.\n\nChrisL  \n--Frustrated neophyte Cyrillic Script attempter :-{\n\n",
  "author": "dezcom",
  "time": "7 Jun 2006 — 5:28am",
  "uid": "3135",
  "comments": [
    {
      "time": "7 Jun 2006 — 5:31am",
      "content": "Also, is there a table that has all the Cyrillic glyphs with their names, what they look like, their unicode address, and their so-called name?\n\nChrisL\n\n"
    },
    {
      "time": "7 Jun 2006 — 5:56am",
      "content": "Chris, if no one else posts anything, i'll try to work something up later today. I may have to do some research of names for some of the non-Russian glyphs though.\n\n"
    },
    {
      "time": "7 Jun 2006 — 6:20am",
      "content": "Paul,  \nThanks muchly! I certainly appreciate your kind offer but I don't mean for you to go to great lengths. I was just hoping someone had a link and there was already something available. If there isn't, I will do the leg work myself.\n\nYou are a good friend and I don't want you to go above and beyond the call of Duty. Besides, I don't want you to miss out on all that exciting party life in Buffalo :-)\n\nChrisL\n\n"
    },
    {
      "time": "7 Jun 2006 — 6:40am",
      "content": "\\>\\> Is there a reason why they can’t just use the real glyph names  \nAdobe Standard Cyrillic Font Specification, P.7:  \n\"2.2Why Use AFII Glyph Identifiers?\"  \n [http://partners.adobe.com/public/developer/en/font/5013.Cyrillic\\_Font\\_Sp...](http://web.archive.org/web/20150420220857/http:/partners.adobe.com/public/developer/en/font/5013.Cyrillic_Font_Spec.pdf \"http://partners.adobe.com/public/developer/en/font/5013.Cyrillic\\_Font\\_Spec.pdf\")\n\n\\>\\>is there a table that has all the Cyrillic glyphs with their names, \\>\\>what they look like, their unicode address, and their so-called \\>\\>name?\n\n[http://www.fileformat.info/info/unicode/block/cyrillic/index.htm](http://web.archive.org/web/20150420220857/http:/www.fileformat.info/info/unicode/block/cyrillic/index.htm \"http://www.fileformat.info/info/unicode/block/cyrillic/index.htm\")  \n [http://www.fileformat.info/info/unicode/block/cyrillic\\_supplement/index.htm](http://web.archive.org/web/20150420220857/http:/www.fileformat.info/info/unicode/block/cyrillic_supplement/index.htm \"http://www.fileformat.info/info/unicode/block/cyrillic\\_supplement/index.htm\")\n\n"
    },
    {
      "time": "7 Jun 2006 — 6:45am",
      "content": "hi chris,  \nprobably not completely what you're looking for, but for a start:\n\n[decodeunicode.org](http://web.archive.org/web/20150420220857/http:/www.decodeunicode.org/)\n\nthe single pages referring to the resp. unicode blocks (greek + coptic, cyrillic + cyrillic supplement) are nicely hidden to the left of that double dotted line :-)  \nhope this helps at least a bit.\n\n"
    },
    {
      "time": "7 Jun 2006 — 6:46am",
      "content": "See also [http://www.unicode.org/charts/](http://web.archive.org/web/20150420220857/http:/www.unicode.org/charts/ \"http://www.unicode.org/charts/\")  \n [http://www.unicode.org/charts/PDF/U0400.pdf](http://web.archive.org/web/20150420220857/http:/www.unicode.org/charts/PDF/U0400.pdf \"http://www.unicode.org/charts/PDF/U0400.pdf\")  \n [http://www.unicode.org/charts/PDF/U0500.pdf](http://web.archive.org/web/20150420220857/http:/www.unicode.org/charts/PDF/U0500.pdf \"http://www.unicode.org/charts/PDF/U0500.pdf\")\n\n"
    },
    {
      "time": "7 Jun 2006 — 6:47am",
      "content": "At [www.unicode.org/Public/4.1.0/charts/](http://web.archive.org/web/20150420220857/http:/www.unicode.org/Public/4.1.0/charts/) you can grab CodeCharts.pdf (ca 30MB). Cyrillic starts pp 40, the information include glyph names. [But this is only half of the answer. Being curious for the other half myself.]&nbsp;&nbsp;;-)\n\n[edit: One minute too late!]\n\n"
    },
    {
      "time": "7 Jun 2006 — 6:52am",
      "content": "Alexy, Franz, Karsten! THANKS GUYS!!!\n\nChrisL\n\n"
    },
    {
      "time": "7 Jun 2006 — 6:58am",
      "content": "[This](http://web.archive.org/web/20150420220857/http:/www.tiro.com/Resource_Files/Tiro_REN_Files.zip) archive includes useful AGLafii2AGLuni.ren and AGLuni2AGLafii.ren files.\n\n"
    },
    {
      "time": "7 Jun 2006 — 2:11pm",
      "content": "Here are all the 'afii' names you'll need  \n [Adobe Glyph List For New Fonts](http://web.archive.org/web/20150420220857/http:/partners.adobe.com/public/developer/en/opentype/aglfn13.txt)\n\nUse it and you'll save yourself a lot of trouble :)\n\n"
    },
    {
      "time": "7 Jun 2006 — 2:53pm",
      "content": "BRAVO Miguel! You guys are the best!\n\nChrisL\n\n"
    },
    {
      "time": "7 Jun 2006 — 5:27pm",
      "content": "The script below will work with [John](http://web.archive.org/web/20150420220857/http:/typophile.com/wiki/John%20Hudson)'s [.REN files referred above](http://web.archive.org/web/20150420220857/http:/typophile.com/node/20508#comment-127579) (and, of course, with any file one might create). Just put it in FontLab's Macro folder. It requires [Robofab](http://web.archive.org/web/20150420220857/http:/typophile.com/wiki/Robofab).\n\n[http://www.adhesiontext.com/typophile/GlyphRenamer.zip](http://web.archive.org/web/20150420220857/http:/www.adhesiontext.com/typophile/GlyphRenamer.zip \"http://www.adhesiontext.com/typophile/GlyphRenamer.zip\")\n\n"
    },
    {
      "time": "7 Jun 2006 — 11:30pm",
      "content": "\\>\\>The script below\n\nAlso Rename glyphs by scheme macro included in FontLab on Steroids Pack does the same thing.  \n [http://steroids.fontlab.net](http://web.archive.org/web/20150420220857/http:/steroids.fontlab.net/ \"http://steroids.fontlab.net\")\n\n"
    },
    {
      "time": "8 Jun 2006 — 1:07am",
      "content": "\\> _macro included in FontLab on Steroids Pack does the same thing_\n\nNot for me (on a Mac). That's why I had to write my own.\n\nIn addition, my script does not require the renaming files to be in a specific folder, to have a specific extension, or to have a specific header. All it requires is a text file with two columns of names separated by white space (can be 1 or several space characters or tab entries).\n\n"
    },
    {
      "time": "8 Jun 2006 — 5:23am",
      "content": "Miguel, no-wonder Adobe hired you :-)  \nThanks to you all for being so helpful. Now, if I only could learn to speak Russian...:-)\n\nChrisL\n\n"
    },
    {
      "time": "8 Jun 2006 — 6:47am",
      "content": "Here you go Chris...\n\n ![](http://web.archive.org/web/20150420220857im_/http:/typophile.com/files/russian_4109.jpg)\n\n"
    },
    {
      "time": "8 Jun 2006 — 7:34am",
      "content": "Danka Tovarich Simonson!  \nMy 50 cents is in the mail :-)\n\nChrisL\n\n"
    },
    {
      "time": "8 Jun 2006 — 7:39am",
      "content": "As you can see, I only paid 39¢ for my copy--over 20% off the publisher's list price! It pays to shop around.\n\n"
    },
    {
      "time": "8 Jun 2006 — 7:42am",
      "content": "LOL!!!\n\nChrisL\n\n"
    },
    {
      "time": "8 Jun 2006 — 11:19am",
      "content": "\"Danka Tovarich Simonson!  \nMy 50 cents is in the mail :-)\n\nChrisL\"\n\nActually Chris that would be more like \"Spasiba Simonson!\" Unfortunately I can't translate the rest for you... Ya Ponymiu Ruski nyem noga... and I think I absolutely butchered the phonetic spelling too.\n\n"
    },
    {
      "time": "8 Jun 2006 — 11:42am",
      "content": "У Вас прекрасно получается\n\n"
    },
    {
      "time": "8 Jun 2006 — 4:29pm",
      "content": "Michael,  \nNow you see how badly I need Mark's book :-)\n\nChrisL\n\n"
    },
    {
      "time": "8 Jun 2006 — 4:32pm",
      "content": "Looks great David--wish I knew what it says :-)\n\nChrisL\n\n"
    },
    {
      "time": "8 Jun 2006 — 4:51pm",
      "content": "It's implicit in many of the comments, files and links, but I didn't see anybody come out and say it. So, for other readers who are not as familiar with this stuff:\n\nYou can of course use whatever glyph names you like for your own internal (production) usage. But when generating the final font, the afii names from the Adobe Glyph List For New Fonts are preferable so that they will be recognized by potential consumers of the font.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "8 Jun 2006 — 5:02pm",
      "content": "\\> wish I knew what it says\n\nYou're doing fine\\*\n\n( \\> Actually Chris that would be more like “Spasiba Simonson!”\\* )\n\n"
    },
    {
      "time": "8 Jun 2006 — 5:12pm",
      "content": "Thanks Thomas.  \nWhy the afii names to begin with? They are not used for Greek? Why not Ka. Be Ze Ef?\n\nChrisL\n\n"
    },
    {
      "time": "8 Jun 2006 — 5:51pm",
      "content": "Spasiba David.\n\nChrisL\n\n"
    },
    {
      "time": "8 Jun 2006 — 6:30pm",
      "content": "\\> _Why the afii names to begin with? They are not used for Greek? Why not Ka. Be Ze Ef?_\n\nChris, looks like you missed [Alexey's comment above](http://web.archive.org/web/20150420220857/http:/typophile.com/node/20508#comment-127567).\n\n"
    },
    {
      "time": "9 Jun 2006 — 2:53am",
      "content": "I have Russian on tape, Russian on CD, three different books, and a wife from Azerbaijan who's first language is Russian and I currently know only about 40 Russian words... so I guess it has more to do with how disciplined and persistent you are than what (or how many) learning tools you have... at this rate my month old daughter will quickly know more Russian than me. Sometimes I feel like Koko the gorilla, counting and tracking how many words I know... though at this point I think Koko knows over 1000 signs and over 2000 spoken words, so I am way behind in comparison in Russian...lol\n\n"
    },
    {
      "time": "9 Jun 2006 — 3:40am",
      "content": "Hello\n\nThis is my first comment on typophile.  \ni am now finishing my MD at type & media kabk the hague.\n\nI am working on Arabic typefaces and I have the same problem that is mentioned conserning the naming of the glyphs. It could be very annoying while in the stage of designing your font to keep using the affixxx naming.  \nWhat i did is that i made my own incoding ( 1. modified the agl.nam in the mapping folder of fontlab. 2. added my personal encoding .enc file in the encoding folder of fontlab) file in the with my own naming for my font.  \nI use this encoding during the design process, but when it comes to generating the font, i  \nmade a script using Robofab that changes all my personal names back to unixxx before generation. I can also do it to change the names back to affixxx.  \nThe nice think about that is only have to do this naming and encoding stuff once, and then you will use it always and the design process will be much more friendly.  \nOk  \ncheers  \npascal zoghbi\n\n"
    },
    {
      "time": "9 Jun 2006 — 6:37am",
      "content": "Thanks Pascal, and welcome to typophile!  \nIt seems great minds think alike. Miguel, Thomas, and Alexy also use a renaming method.\n\nChrisL\n\n"
    },
    {
      "time": "10 Jun 2006 — 1:28am",
      "content": "well here is my script that i use.  \nit does not need any glyph name list file to refer to.  \nit transforms all the names to uni + the unicode number it has.  \nit only works if you want the glyph names to be in unixxxx.\n\n---------------------------------\n\n#FLM: Glyph name to uni pascal  \n#pascal zoghbi\n\nfrom robofab.world import CurrentFont\n\nf = CurrentFont()\n\nfor g in f:  \n uni = g.unicode  \n if uni:  \n unicode = \"%X\" %uni  \n name = g.name  \n lastBit = \"\"\n\nnumberOfZero = 4-len(unicode)  \n if name.count(\".\"):  \n k, lastBit = name.split(\".\")  \n lastBit = \".\" + lastBit  \n uni = \"uni\" + \"0\"\\*numberOfZero + unicode + lastBit  \n g.name = uni\n\nf.update()\n\n-------------------------------\n\ni do not know yet how to attach files.  \nso only copy and past the script and it will work.  \nMaybe you need to insert the tabs again properly if when copying and pasting the tabs were removed or so.  \ncan someone tell me how can a attach file which are not images.\n\nok  \ncheers\n\nPascal Zoghbi  \nMD type & Media\n\n"
    },
    {
      "time": "10 Jun 2006 — 5:10pm",
      "content": "Thanks Pascal!  \nAttaching files is limited to GIF, JPEG, and PNG. You need the latest Flash driver installed to see the \"insert image\" link below the text box for \"Post New Comment\".\n\nChrisL\n\n"
    },
    {
      "time": "10 Jun 2006 — 8:28pm",
      "content": "As a matter of fact, a large number of cyrillic glyphs have historical long names, following greek tradition. These are widely used by linguists and known to educated speakers of slavonic languages. The same names are used for Glagolythic alphabet, which is different from cyrillic in glyph shapes only. Details can be found on Wikipedia [http://en.wikipedia.org/wiki/Glagolitic\\_alphabet](http://web.archive.org/web/20150420220857/http:/en.wikipedia.org/wiki/Glagolitic_alphabet \"http://en.wikipedia.org/wiki/Glagolitic\\_alphabet\"). I believe these names work better as glyph names because there are less conflicts with greek (Fita =/= Theta) and latin (On =/= O, Uk =/= U).\n\n"
    },
    {
      "time": "11 Jun 2006 — 4:13am",
      "content": "WTF is danka!?\n\n"
    },
    {
      "time": "11 Jun 2006 — 5:07am",
      "content": "Thank you Sergei Egorov. It all becomes clearer now!\n\nChrisL\n\n"
    },
    {
      "time": "11 Jun 2006 — 6:48pm",
      "content": "Chris, to address your background question: The Greek alphabet is essentially used to write a single language, so transliterated letter names can be used for glyphs without causing problems for developers who might call them something else. The Cyrillic script, on the other hand, is used to write more than fifty languages, and not all of them call the letters by the same names or even use them to signify the same phonemes. So codes are better for standard glyph names. That said, I use the uniXXXX form names for Cyrillic letters, not the old afii codes, since they are a bit easier to remember once one knows the Unicode set, are more efficient in terms of font size, and save me from keeping track of two different code naming conventions. You would only need to use afii names in Type 1 fonts with some pretty ancient software.\n\nI use transliterated glyph names largely based on modern Russian names during production, and switch to the uniXXXX names for the post/CFF table entries. My Cyrillic production names are preceded by c. as a script indicator, which distinguishes e.g. Cyrillic c.A from Latin A.\n\n"
    },
    {
      "time": "11 Jun 2006 — 7:12pm",
      "content": "Thanks John! That seems like a great system!  \nNow it all makes sense.\n\nChrisL\n\n"
    },
    {
      "time": "12 Jun 2006 — 1:03am",
      "content": "hi pascal,  \ngood to hear about your project. i am currently working on my ma at the typeface design course in reading - and as it happens, i am also working on an arabic typeface!\n\nthank you for sharing your script - it doesn't work with my configuration, for which platform did you write it?\n\ni am working on winxp fl 5.0.2., python 2.3.5, robofab 1.1.1\n\n"
    },
    {
      "time": "12 Jun 2006 — 12:54pm",
      "content": "Chris,\n\nI second John's explanation. A simple example: in Russian, afii10068 (U+0433) is pronounced \"g\" (like in \"good\") but in Ukrainian, this letter is used to write a dark \"h\" sound (something like in \"hat\") while \"g\" is written using afii10098 (U+0491). There are other situations like that. A similar issue can be made between the Hebrew and the Arabic script. The Hebrew letters are practically used to write only one language so one could theoretically use \"descriptive\" transliterated names for the Hebrew glyphs, especially that the Hebrew letters have actual names (e.g. \"aleph\"). But the Arabic script is used to write many different languages of the world and the heavily diacritic structure of the script makes descriptive names at least illogical -- you end up with names like \"dotless beh\", which make little sense because you're mixing visual and phonetical elements.\n\nA.\n\n"
    },
    {
      "time": "12 Jun 2006 — 2:31pm",
      "content": "Thanks Adam!  \nIt seems as though Latin script, even with all the diacritics, is quite simple to deal with compared to most other scripts. I can't imagine how complicated the Asian scripts must be!\n\nChrisL\n\n"
    },
    {
      "time": "12 Jun 2006 — 3:56pm",
      "content": "\\>_I can’t imagine how complicated the Asian scripts must be!_\n\nOnce [Fiona](http://web.archive.org/web/20150420220857/http:/typophile.com/wiki/Fiona%20Ross) showed me one Indic font she was working on, and I got lost right in the first handful of glyphs... :/\n\n"
    },
    {
      "time": "12 Jun 2006 — 6:16pm",
      "content": "Miguel,  \nIf I ever threaten to do an Asian script, STOP ME!!! They look incredibly beautiful but I am too old to learn enough about them to finish one before I die :-)\n\nChrisL\n\n"
    },
    {
      "time": "18 Jun 2014 — 6:11am",
      "content": "Excuse me for bumping the old thread, but what exactly would happen if I output a font with non afii00xx glyph names? I'm testing my multilingual sans serif and it looks like it works fine as long as glyphs occupy their proper unicode values... I've generated an .otf, installed it and nothing seems to be broken in any applications (InDesign, Illustrator, Photoshop, Word, browsers) on both Mac and Windows.\n\nI have renamed Cyrillic glyphs to my preference (Acyr, Becyr, etc.). After all we rename the glyphs in PUA to our preference. And I have some Ukrainian ligatures like yicyr\\_yicyr that would look strange if it was afii10104\\_afii10104\n\nAm I doing something wrong? What can hypothetically break? I guess that political issues (like transliteration) are not the case because in 99,9% cases, the user won't ever see actual glyph names, only the glyphs themselves.\n\n"
    },
    {
      "time": "19 Jun 2014 — 11:17pm",
      "content": "The only real reason is that in some corner cases with OpenType CFF fonts, encoding must be inferred from glyph names alone. Mostly this occurs when the font is printed to a PostScript file, and then that file is turned into a PDF. If the glyph names are not recognized by the PDF creator, the PDF will look correct, and print fine, but the underlying text will either not be present, or be incorrect.\n\nafii names are not the only option, however. You can use uniXXXX names instead.\n\nOr you can decide that this is an unlikely or irrelevant corner case and ignore the issue.\n\n"
    },
    {
      "time": "24 Jun 2014 — 5:20am",
      "content": "Thanks, Thomas. Are you away of the actual problematic PDF creators so I could test it?\n\n"
    },
    {
      "time": "24 Jun 2014 — 9:32am",
      "content": "It’s not the PDF creator, but the workflow. Simply:\n\nUse an OTF font.  \nPrint a PS file to disk instead of to a device.  \nDe-activate the fonts  \nMake sure that your PDF creating software doesn’t know where the fonts are.  \nCreate your PDF.  \nOpen the PDF and see that everything looks right. However, copy-paste, search and so forth don’t work worth beans.\n\nYou can use Acrobat Distiller or anything else. It doesn’t matter at that point. I am not even convinced there is any need to test this—it is a pretty well-known and longstanding issue. It’s the main reason anybody cares about glyph names in the final, produced font. If you have a PS OpenType font (.otf), use completely non-standard names, and the original font is unavailable to the PDF creator, this _will_ happen.\n\nThat said, obviously it is a corner case, for most purposes. So you may choose to ignore it, your call.\n\n"
    },
    {
      "time": "25 Jun 2014 — 1:25am",
      "content": "Thanks! What if I will use a TT OpenType font? Would there be any difference?\n\n"
    },
    {
      "time": "26 Jun 2014 — 12:06pm",
      "content": "Well, that gets more complicated.\n\nIF the driver is set to send the TT font as TrueType to the PostScript device, then nothing can go wrong, and incorrect or even completely absent glyph names should not cause a problem. This is because the entire TT font, including the cmap table, gets put in the PostScript print stream.\n\nIf the driver is set to do something else, well, it depends on what that something else is....\n\nNote that my knowledge of this particular print scenario with TT to PS devices is quite a few years old. It may be that all modern drivers behave one way or another and I don't know about it. I don't have a PS printer set up right now to mess around with this; it could vary by driver/platform/moon-phase.\n\nWell, okay, probably not by phase of the moon. :)\n\n"
    },
    {
      "time": "27 Jun 2014 — 1:42am",
      "content": "Thanks, Thomas! So I think it's still unsafe to leave custom glyph names in a final font.\n\n"
    }
  ]
}
