{
  "id": "20559",
  "title": "Paul Rand script",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,\n\nThis occured to me while flipping through some old Graphis Annuals this morning, has anyone created a font based on [Paul Rand](http://web.archive.org/web/20141114030440/http:/typophile.com/wiki/Paul%20Rand)'s script lettering? It would make a pretty striking typeface (Rand Hand?). Don't know what it could be used for particularly but just thought in this day and age somebody must have had a go. Any thoughts? Is it too idiomatic? What are the ethics of adapting another designer's lettering style? Is this a job for P22? Or perhaps it could be the new Caflisch Script?\n\nOr maybe it's been done, or it's just a rubbish idea...\n\nCheers,  \nSimon\n\n[Illustrated History](http://web.archive.org/web/20141114030440/http:/www.illustrated-history.net/) | [Doodleblog](http://web.archive.org/web/20141114030440/http:/www.doodleblog.co.uk/)\n\n",
  "author": "simon",
  "time": "9 Jun 2006 — 7:02am",
  "uid": "1221",
  "comments": [
    {
      "time": "9 Jun 2006 — 7:52am",
      "content": "Why don't you give it a crack, Simon?\n\n"
    },
    {
      "time": "9 Jun 2006 — 9:27am",
      "content": "\"or it’s just a rubbish idea…\"\n\nYou answered your own question. All of these fonts based on artists writing are a rubbish idea. Leave Mr Rand's handwriting alone. He was America's greatest designer ever, maybe even the world's greatest designer ever. Its completely disrespectful to take what was his written voice and use it for your benefit.\n\n"
    },
    {
      "time": "9 Jun 2006 — 9:40am",
      "content": "You are a grumpy old bugger!\n\n"
    },
    {
      "time": "9 Jun 2006 — 10:27am",
      "content": "Ha ha!\n\nI'm afraid my FontLab skills are pretty basic Pattyfab, and I kind of agree with Mr. Old Bugger, and I need another project like a hole in the hand...\n\nBut it's a good object lesson for a new script design if nothing else. Don't you think? And maybe I should do a little more with my copy of FontLab...\n\nSimon\n\n[Illustrated History](http://web.archive.org/web/20141114030440/http:/www.illustrated-history.net/) | [Doodleblog](http://web.archive.org/web/20141114030440/http:/www.doodleblog.co.uk/)\n\n"
    },
    {
      "time": "10 Jun 2006 — 3:31am",
      "content": "can you post some samples?\n\n"
    },
    {
      "time": "10 Jun 2006 — 3:44pm",
      "content": "I'd be interested in seeing some examples as well.\n\n"
    }
  ]
}
