{
  "id": "20563",
  "title": "Atlantica in a Newspaper?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m the editor-in-chief of my high school newspaper, The Riverdale Review. I’m pursuing a redesign of the paper of the summer, and I’ve been looking for a typeface to be the centerpiece. I’ve ended up wanting to use [Atlantica](http://web.archive.org/web/20071205084127/http:/www.myfonts.com/fonts/rsantos/atlantica/) by Ricardo Santos as the main display and body face. I was wondering if anyone has had any experience using Atlantica, especially in newspaper or magazine settings or could recommend similar faces. Any help would be greatly appreciated.\n\nMaybe to help you hone in on what I’m looking for: My goal was to replace our use of Times with a face that would be somewhat reminiscent of it (transitional, a certain smoothness) but more fun and distinctive. I like that Atlantica has strong stroke contrast, but not quite like Bodoni or another modern font, and that the lc gives me a mildly similar feeling to Times, but the uc feels fresh (it reminds me a bit of cuneiform, actually). Also, it’s important to me that the face I settle on has a lot of flexibility in having small caps, oldstyle figures, and preferably text and display cuts.\n\n [‹ Nat Vignette](http://web.archive.org/web/20071205084127/http:/www.typophile.com/node/20496 \"Go to previous forum topic\") [50 pence ›](http://web.archive.org/web/20071205084127/http:/www.typophile.com/node/20379 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071205084127/http://www.typophile.com/user/11702\" title=\"View user profile.\">auricfuzz</a>",
  "time": "<br>",
  "uid": "11702",
  "comments": [
    {
      "time": " 9.Jun.2006 9.42am",
      "content": "For what it’s worth, other faces I was strongly considering were Farnham (good, but maybe too bluntly powerful), Miller (too much stroke contrast), Veritas (too much contrast again), Poppl-Pontifex, and Baskerville 1757.\n\n"
    },
    {
      "time": " 9.Jun.2006 9.48am",
      "content": "This doesn’t have all the features you seek but it is a progression of Times, I have only used it for some visuals for a newsletter, but it looks good, free to try out as well.  \n [http://www.myfonts.com/fonts/storm/lido-stf/](http://web.archive.org/web/20071205084127/http:/www.myfonts.com/fonts/storm/lido-stf/ \"http://www.myfonts.com/fonts/storm/lido-stf/\")\n\nTim\n\n"
    },
    {
      "time": " 9.Jun.2006 10.33am",
      "content": "Thanks, timd. I have taken a look at Lido STF, but it’s more similar to Times than I want. Also, as it’s lacking too many “features” for me, as I would like the face I choose to be able to accomodate my every typographic whim.\n\n"
    },
    {
      "time": " 9.Jun.2006 11.20am",
      "content": "auricfuzz, I have Atlantica (very nice text font BTW) but I haven’t tested it yet with newspapper/magazine layouts, only for a rock band cd layout. I think the best thing you can do is to send Ricardo an email (he’s a very nice guy, so I’m sure he will reply) and he can help you out on some PDF beta testing for your newspaper or magazine settings demands.\n\nContact him at info (at) vanarchiv.com\n\nAll the best for your project and please share the design with us :)\n\n"
    },
    {
      "time": " 9.Jun.2006 11.36am",
      "content": "Thanks a lot for the suggestion, adriano. That’s a really good idea; I’ll do that when I have a few minutes. I’ll put some stuff up once I progress farther in the redesign; right now, I don’t have anything concrete, only a number of ideas that I’d like to implement.\n\n"
    },
    {
      "time": " 10.Jun.2006 11.57pm",
      "content": "I don’t want to be annoying, but does anyone otehr than adriano have experience with Atlantica at all, since if I’m going to use it, I’d like to know any benefits/pitfalls of it? Thanks.\n\n"
    }
  ]
}
