{
  "id": "20578",
  "title": "Aldus Manutius Bembo",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hi, I'm working on a paper about venetian - humanist fonts and I'd like you to suggest me what's or what are the most similar current fonts to the original type from [Aldus Manutius](http://web.archive.org/web/20131024052925/http:/typophile.com/wiki/Aldus%20Manutius). (sorry for my English)\n\nthanks very much in advance\n\n",
  "author": "mariano",
  "time": "9 Jun 2006 — 4:32pm",
  "uid": "4354",
  "comments": [
    {
      "time": "9 Jun 2006 — 4:51pm",
      "content": "Hi Mariano, the current font most similar to Aldus' last roman is Poliphilus, that most similar to his italic is Griffo Classico Italic. Neither of these are entirely accurate.\n\n"
    },
    {
      "time": "10 Jun 2006 — 7:41am",
      "content": "thanks geroge, and one more question: what about Nicolas jenson Roman type. What can we found nowadays very similar to the first Jenson´s ROMAN Type ?\n\n"
    },
    {
      "time": "10 Jun 2006 — 12:51pm",
      "content": "Adobe Jenson.\n\n"
    },
    {
      "time": "10 Jun 2006 — 1:01pm",
      "content": "Meandering thought: I'll guess one possible reason we don't see much based on Aldus is because in the next century Garamond and his co-horts surpassed what was done and so is deemed as a better set of bones from which to start.\n\n"
    },
    {
      "time": "10 Jun 2006 — 1:46pm",
      "content": "It's because people are lazy, Tiffany. :)\n\n"
    },
    {
      "time": "10 Jun 2006 — 1:54pm",
      "content": "That too. :^P\n\n"
    },
    {
      "time": "10 Jun 2006 — 5:44pm",
      "content": "<cite>in the next century Garamond and his co-horts surpassed what was done</cite>.  \nThe quality of Garamond's output was certainly more even than Griffo's, but as designs his work just looks vacuous to me. I'd really be interested to know what people see in them. Griffo seems to have been much the more thoughtful and inventive of the two; and his masterpieces, the 1499 caps and 1503 italic, had no influence on the French, who stuck to reductively reproducing his 1495 roman and 1501 italic.\n\n"
    }
  ]
}
