{
  "id": "20576",
  "title": "Rolls Royce Annual Report",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "I’m printing and comping up this for my final critique so I figured that I would post it here. Basically it was a 10 week course where we picked a company, researched and designed a set of comprehensive spreads that would cover the possibilities within an annual report. Creating a whole report would be ludacris in that time period obviously. All the icons within the report were created by me, the only thing I didn’t make is the actual RR logo and the body copy. I had never done anything corporate, design wise so that’s what I wanted to do with this project…stressing the iconic nature (hence the ones I created) of the company itself. The facts in the beginning are an introduction to the report as a way to ease you into the information and make you realize the sophistication of the British culture and history.\n\n| Attachment | Size |\n| --- | --- |\n| [rolls.royce.annual.report.pdf](http://web.archive.org/web/20060630150648/http:/typophile.com/files/rolls.royce.annual.report.pdf) | 718.59 KB |\n\n",
  "author": "<a href=\"user/8451\" title=\"View user profile.\">david bailey</a>",
  "time": "<br>",
  "uid": "8451",
  "comments": [
    {
      "time": " 9 June, 2006 - 11:00pm",
      "content": "Nobody? :-/\n\n"
    },
    {
      "time": " 10 June, 2006 - 12:19am",
      "content": "I see where you are going with the “icons’ for lack of a better word. I use logos and deconstruct them myself in my work, I happen to like patterns of this sort.  \nWith a client (real or school project) such as Rolls Royce, I do not think they would allow a designer to take the steps you have taken by the manipulation (turning, mirror, duplicate, etc) the RR mark. This is not to say that other clients would not allow this, but I believe RR is too established and upscale to risk such a direction.  \nWhat exactly do these “icons” represent?\n\n"
    },
    {
      "time": " 10 June, 2006 - 12:29am",
      "content": "Did you go through all the spreads? They represent the sub-catagories of the company: Civil Aerospace, Defense Aerospace, Marine and Energy. Sure I don’t tell it right off the bat but it’s more of a discovery process.\n\n"
    },
    {
      "time": " 10 June, 2006 - 5:02pm",
      "content": "David, to be blunt, if this is for your final critique; there are some inconsistencies that you’ll probably be docked for. First off as mentioned above, using the logo in such a manner is surely against their Standards guide; while I got the shapes in the front section and thought it was clever it’s a blatant disregard for brand standards. A few other things to consider: there’s no name on front to signify which company it is, there doesn’t appear to be a consistent grid structure throughout the piece, text alignment tends to very (probably better to stick to one) and the repeating seems to be there just to fill space.\n\nI hope that helps you out a bit.\n\nCheers!\n\n"
    },
    {
      "time": " 12 June, 2006 - 7:25am",
      "content": "Rolls-Royce are notoriously protective of their image (quick anecdote, the only vehicle to officially carry their emblem that wasn’t made by them is a mock-up of Lady Penelope’s pink Roller from Thunderbirds and they want to buy it in order to crush it, I know that the car division is a separate entity now but the message is clear), so I have to join in and say that you will need to have a major rethink, in fact it is probably good practice to never refer to a company’s logo in a document unless specifically requested. I would definitely include some images, I saw on the website they have an [image library](http://web.archive.org/web/20060630150648/http:/www.rolls-royce.com/media/gallery/default.jsp).\n\nThe facts at the beginning are not performing as you want them to – tea, Wimbledon and Magna Carta provide very little in the way of an introduction to the company and its values and are wildly disconnected.\n\nMore basically on the design, the document would presumably be perfect bound, which means that the centre of the spread is pretty much impossible to view and will need a larger gutter than you have allowed. Where you have used ranged right text you should look at overhanging punctuation. In the tables where you have a negative value (signified by parentheses) the numerals should align with the numerals above, the parenthesis should overhang the column. You will need a folio throughout and a clear title showing the dates it covers on the front cover.\n\nSorry to be so negative, but it is better to discover this now.  \nTim\n\n"
    }
  ]
}
