{
  "id": "20588",
  "title": "Fresh advice for creating a Logo for my design firm!",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi Every One,\n\nI’m new to this forum and looking for some fresh advice on a logo/Identity I’m working on.\n\nThe logo is for my design studio in New Zealand. As many designers know or may appreciate it quite a difficult task to design a logo for yourself. It has sat in limbo for around 3 months and I am not sure where to go from here.\n\nFirstly the logo was inspired by the new studio we moved to- an old government office, hence the traditional emblem look. We did some research and each animal represents the founding partners of our firm. We also have a love of retro inspiired design (but I felt creating a simple circular form etc has been done to death by designers around here).\n\nWe wanted a logo that represented tradition and quality yet had a modern mood. (this was to be conveyed within supporting design elements– illustration and phtography) Hence we rolled out the logo on our web site but never completed material for print material. Which leaves us in the shameful position of not having a consistent identity!\n\nAny how, sorry for long story- I’ll cut to the case:\n\nCurrenty the logo Uses Minion Pro (I know) and I’m wanting to change the font to something more unique– yet suits the style. The logo can not really be changed dramitically as it is in use (silly I know). I require a great, well designed typeface with various weights so it can be used throughtout material. I am trying to use the traditional typography in a modern way in material.\n\nAnother problem with the current logo is the “Design & Communication” typography can not be reduced and be legable at small sizes. However I like the way it sits between the animal legs?\n\nThe typography also must have heavy weights also to be used in poster/illustratios etc. Asking too much?\n\nAny help would be most appreciated.\n\nCheers, Jason\n\n ![](http://web.archive.org/files/Logo_sample_5395.jpg)\n\n",
  "author": "<a href=\"user/13348\" title=\"View user profile.\">J_P_C</a>",
  "time": "<br>",
  "uid": "13348",
  "comments": [
    {
      "time": " 10 June, 2006 - 9:16am",
      "content": "What if there were two ‘dots’ - One for I & one for m. Or a sheild? Then the text could go in a wavy banner below as well. Or get rid of the circle & let the letters be free between the animals.\n\n"
    },
    {
      "time": " 10 June, 2006 - 11:56am",
      "content": "\\*As many designers know or may appreciate it quite a difficult task to design a logo for yourself\n\nExactly! It’s almost rediculous how much harder it is to create one for yourself. And it doesn’t help that it’s hard to create logos for design firms anyway.\n\nMore to the point, I don’t like the composition of the logo, especially for everything you want it to do. It’s too hard to read the letters in the circle and the logotype feels forced into that location. I would even think it would be better to shrink the whole mark and just put it above the type and not have the type in the feet.\n\nAlso I would think a more traditional shield would be better or something more unique. It sort of reminds me of Minds of Intelligence’s logo: [http://www.mindsofintelligence.com/](http://web.archive.org/web/20060630195222/http:/www.mindsofintelligence.com/) although the one they have currently on their site isn’t a good representation. And theirs is much more versatile. I like the shapes of the animals however they are so dramatic it consumes the logo and takes it over. Maybe reducing their size in comparison to the type would help.\n\n"
    },
    {
      "time": " 10 June, 2006 - 11:59am",
      "content": "As per the card I think it will look good. Large gold foil will be cool, can’t really tell what the other side will look like without an image, what kind of image are you going to have? I don’t really think you need an image but just some different type layouts. The cut out type as it is currently will be harder to read and there is no separation/heirchy to look at so finding information will take too much effort when it should be effortless.\n\nYou could put a gold foil border around the contact info side to tie in the theme and keep a defined look on that side also (if money permits).\n\n"
    },
    {
      "time": " 10 June, 2006 - 7:10pm",
      "content": "Thanks guys, this is great getting some outside feedback!\n\nPersonally I’m not a huge fan of the circular form in the middle and contents. It was really a way of trying to connect animals together without them looking like they were fighting (see attached).\n\nI see what you mean Eben, a sheild and wavy banner could work well, just not to sure whether it would be “modern” enough. When I orignially started sketching I used a sheild but couldn’t really come up with ideas that worked within the sheild.\n\nAnother issue I find with the current logo is that it needs to be centered within a page otherwise it looks un-balanced.\n\nAlso could it look better just having 1 animal to represent both animals or just a lion with some nice typography below.\n\nWe currently use the lion as a ico/build logo for web sites– maybe this would be a better way to go.\n\nAttached some more concepts, with your sugestions. When the logo is on top of the type it appears to just float– any suggestions on how to tie it in.\n\nCurrent logo in use:\n\n[www.imagemechanics.co.nz](http://web.archive.org/web/20060630195222/http:/www.imagemechanics.co.nz/)\n\nThanks agian for your help!\n\n ![](http://web.archive.org/files/IMAGE_sampl_logo_2_5562.jpg)\n\n ![](http://web.archive.org/files/IMAGE_sampl_logo_5785.jpg)\n\n"
    },
    {
      "time": " 11 June, 2006 - 12:34am",
      "content": "I have to admit that in context the current logo works better than I thought it would. What if you got rid of the IM & kept the circle. Then it would be like aq portal to the images you are mechanic-ing. Maybe give the crcle a more elaborate frame… Or what about a swooshy caligraphic I & M between the animals?\n\n"
    },
    {
      "time": " 11 June, 2006 - 1:28am",
      "content": "HI Eben,\n\nThanks so much for your ideas!\n\nBy changing the typography, removing the floral “I & M” and increasing the thickness of circle it looks alot better. Provides a more dynamic modern expression. Also I think the typeface being a sans serif and bolder, simplifies the look and gives the logo more downward weight to conter-act the heavy nature of the animals.\n\nMaybe if I simplfy the animals, to look a little cleaner it would improve it.\n\nI added a crown (quickly to see how it would look) This could look interesting if a little more simplified as a focal point.\n\nAny suggestions on a typeface that would work well?\n\nWhat do you think?\n\nCheers\n\n ![](http://web.archive.org/files/IMAGEMECH_LOGO_VERS_3jpg_3688.jpg)\n\n"
    },
    {
      "time": " 11 June, 2006 - 2:13am",
      "content": "How would you feel about moving the circle up to almost level with the top of the heads of Pegasus and the lion, this could still contain a simple I, centred over, M monogram, I think you would have to drop the swashes to avoid printing/legibility problems. Then break ImageMechanics into two lines, using the back legs as frames, which would allow you to increase the type size to balance the weight of the of the elements, as for your strapline, (does it have to include studio?) either way the triangular shape the type makes would allow you to increase the strapline size. Depending on the print size you might need to reduce some of the more extravagant hairs on the heraldic creatures.  \nTim\n\n"
    },
    {
      "time": " 11 June, 2006 - 4:04am",
      "content": "Good sugesttions Tim, I have mocked up a concept.  \nThinking I could place “Design Studio” within circle- or could this be mis interpreted by the audience? I Like the composition but feel the typeface is really letting it down. The spacing between “mechanics” looks bad also.  \nAny suggestions on a more unique type? Perhaps more fluid.\n\nThanks all for your ideas and feedback. Have been strugling for a while to get something I am truely happy with and is “solid”.  \nJason\n\n ![](http://web.archive.org/files/FINAL-LOGO_exp_3_4899.jpg)\n\n ![](http://web.archive.org/files/FINAL-LOGO_exp_3_4620.jpg)\n\n"
    },
    {
      "time": " 11 June, 2006 - 4:06am",
      "content": "Opps\\_ sorry about posting concepts twice. :)\n\n"
    },
    {
      "time": " 11 June, 2006 - 5:29am",
      "content": "I think having Design Studio in the circle could cause problems at small size use. Image Mechanics is struggling with the tracking issues, try without tracking and pulling them slightly down from the image and upping the point size and leading a bit so the shape is still working with the back legs but with slightly more room, I don’t have a problem with the Minion it sits well with the imagery, you could certainly have a look at other typefaces, my feeling is that it needs to be conservative maybe  \n [http://www.myfonts.com/fonts/linotype/stempel-garamond/](http://web.archive.org/web/20060630195222/http:/www.myfonts.com/fonts/linotype/stempel-garamond/)\n\nor more modern  \n [http://www.myfonts.com/fonts/emtype/relato/](http://web.archive.org/web/20060630195222/http:/www.myfonts.com/fonts/emtype/relato/)\n\n[http://www.myfonts.com/fonts/emigre/tribute/](http://web.archive.org/web/20060630195222/http:/www.myfonts.com/fonts/emigre/tribute/)\n\nAlthough the A is too narrow when set with all caps on Tribute.\n\nTim\n\n"
    },
    {
      "time": " 11 June, 2006 - 8:30am",
      "content": "I find the previous versions were stronger, I’d be concerned how well this would reproduce at small sizes. The type in the middle of the latest versions would be lost.\n\n"
    }
  ]
}
