{
  "id": "20596",
  "title": "What font do you use for your default email messages?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I used to use Arial (default) and then Helvetica Neue but since it's bad for copy I'm wondering what everyone else uses for an interesting font for emails. Also is their any particular reason you use that specific font? (is it just versatile, is that font significant to you for some special reason, etc.) Discuss!\n\n",
  "author": "j_polo9",
  "time": "10 Jun 2006 — 12:30pm",
  "uid": "13221",
  "comments": [
    {
      "time": "10 Jun 2006 — 12:41pm",
      "content": "Lucida Grande. I only wish it had an italic. :^/\n\n"
    },
    {
      "time": "10 Jun 2006 — 1:18pm",
      "content": "Verdana because I read it was optimized as a screen font, or something like that.\n\n"
    },
    {
      "time": "10 Jun 2006 — 1:42pm",
      "content": "Lucida Grande. Under Mac Os X it seems the only decently readable typeface at reasonable small sizes.\n\nThe missing Italic, as Tiffany pointed out, is mostly annoying when you use it for writing text as well, not just plain emails, as I do.  \nI use it at 11pt. size.\n\nProbably under pre-Vista Windows the best choices are still Georgia for the Serifs and Verdana or Arial for the Sans Serifs.\n\n"
    },
    {
      "time": "10 Jun 2006 — 2:11pm",
      "content": "Monaco at 9 pt.\n\n"
    },
    {
      "time": "10 Jun 2006 — 2:37pm",
      "content": "Courier New. not aliased.\n\n"
    },
    {
      "time": "10 Jun 2006 — 2:52pm",
      "content": "Courier New (plain text emails) or Verdana for html emails, since its well hinted (what fontplay said).\n\n"
    },
    {
      "time": "10 Jun 2006 — 4:00pm",
      "content": "hmm one thing I hadn't thought about until now, is how do people recieving the email view the type face if they don't have it on their system? Does it get embedded somehow? Or does it just default to their default font?\n\n"
    },
    {
      "time": "10 Jun 2006 — 4:59pm",
      "content": "Jesse, I'm pretty sure it defaults to their default font--html email works like webpages.\n\nEron\n\n"
    },
    {
      "time": "10 Jun 2006 — 5:07pm",
      "content": "Rodrigo X Cavazos's [Adaptive Mono](http://web.archive.org/web/20150129054751/http:/www.psyops.com/html/spec_adaptive.html) for outgoing mail, and Fred Smeijers's [Quadraat Sans Mono](http://web.archive.org/web/20150129054751/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories_search=font_name_search&searchstr=quadraat+sans+mono&image.x=17&image.y=16) for incoming. Each is crisp and easy to read on screen; Adaptive in particular was a real discovery.\n\n"
    },
    {
      "time": "10 Jun 2006 — 6:13pm",
      "content": "[Amplitude Wide](http://web.archive.org/web/20150129054751/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontpackage&startrow=1&records=&currpage=1&totalrecords=4&displayfontid=FB.111842.0.0&fontRendererText=To%3A+Jesse%2C+Re%3A+Fonts) is an ideal screen font — wide, square and well-hinted. It replaced Lucida Grande as my system font for a while, but that can create some issues where the OS expects type of a different width. I still use it for iChat, Mail and other defaults.\n\n"
    },
    {
      "time": "10 Jun 2006 — 9:20pm",
      "content": "\"To: Jesse, Re: Fonts\" lol thats pretty sweet!\n\n"
    },
    {
      "time": "10 Jun 2006 — 9:22pm",
      "content": "I’m with Alessandro. Aliased 9pt Monaco. Plain text rules. HTML drools.\n\n"
    },
    {
      "time": "11 Jun 2006 — 1:13am",
      "content": "10pt Verdana - almost 100% guaranteed to display the same - wherever it's seen.\n\n"
    },
    {
      "time": "11 Jun 2006 — 3:18am",
      "content": "' [LUSTPure](http://web.archive.org/web/20150129054751/http:/www.lust.nl/lust/stereotype/index.html)', by Lust.  \n' [Anonymous](http://web.archive.org/web/20150129054751/http:/www.ms-studio.com/FontSales/anonymous.html)', by Mark Simonson / Susan Lesch + David Lamkins.\n\n[Dav](http://web.archive.org/web/20150129054751/http:/www.dav.name/)\n\n\\* Edited. Sorry, Paul, It wasnt ment to 'sound' that harsh. _( I just wondered if you actually added the 'keyworded link' to every single post / reply, to 'improve' your search engine rankings. )_\n\n"
    },
    {
      "time": "11 Jun 2006 — 5:58pm",
      "content": "WTF? I added that as my signature - which happens to appear whenEVER I reply to a thread.  \nWhat's it doing to Search Engine?  \nI have removed the text which apparently caused you so much grief.\n\n"
    },
    {
      "time": "11 Jun 2006 — 9:00pm",
      "content": "Bah add it back I say. If we can help improve search engine rankings of typophile members... why not?\n\nOnly I don't remember what it looked like but you might want to make it look separate from your actual post with a rule or something to make a clean separation.\n\n"
    },
    {
      "time": "12 Jun 2006 — 12:36am",
      "content": "indeed. though the limits of this forums become apparent...\n\nThis is an example of a signature. You need to be VERY careful what you put here. Some people think it is possible to take over the world with a signature.\n\nLooks identical to other/body text doesn't it? and \\<hr\\> doesn't work.\n\n"
    },
    {
      "time": "12 Jun 2006 — 6:02am",
      "content": "Lucida Grande here too.\n\nChrisL\n\n"
    },
    {
      "time": "12 Jun 2006 — 1:43pm",
      "content": "11px Verdana\n\n"
    },
    {
      "time": "12 Jun 2006 — 8:08pm",
      "content": "Geneva\n\n"
    },
    {
      "time": "12 Jun 2006 — 8:56pm",
      "content": "Lucida Sans Unicode\n\n"
    },
    {
      "time": "13 Jun 2006 — 1:18am",
      "content": "Verdana or Arial - I think Lucida Grande is nice, but it seems to be only standard on Mac OSX - fine if you only send emails to other Mac users, but Verdana or Arial are pretty much ubiquitous.\n\n"
    },
    {
      "time": "13 Jun 2006 — 2:22am",
      "content": "Georgia. I'm a serif person and I really like Georgia. I'm glad there's a system font that's so good.\n\n"
    },
    {
      "time": "13 Jun 2006 — 3:29am",
      "content": "Georgia on my mind\n\n"
    },
    {
      "time": "13 Jun 2006 — 7:00am",
      "content": "Trebuchet - thanks to Vince. I like it except for the splayed M. And everybody has it.\n\n"
    },
    {
      "time": "13 Jun 2006 — 8:16am",
      "content": "Ha thats funny I was just wondering that no one said trebuchet yet :P\n\n"
    },
    {
      "time": "13 Jun 2006 — 12:13pm",
      "content": "Candara, one of the new MS CT fonts, designed by Gary Munch, on an off-white background. The 17 pixel size in Thunderbird is about 12pt on my screen:\n\n ![](http://web.archive.org/web/20150129054751im_/http:/typophile.com/files/CandEM_4602.gif)\n\n"
    },
    {
      "time": "13 Jun 2006 — 3:32pm",
      "content": "hey Londontype.. I had to make the M splayed because when I was working with Matthew Carter on Tahoma I had to make sure it was different at small sizes than his, So his was straight, mine is splayed.. sorry\n\n"
    },
    {
      "time": "14 Jun 2006 — 4:32am",
      "content": "View at 110% for optimal comprehension\n\n ![](http://web.archive.org/web/20150129054751im_/http:/typophile.com/files/Grabbed_3640.234122.jpg)\n\n"
    },
    {
      "time": "14 Jun 2006 — 5:38am",
      "content": "hi David, each to his own, but that is a seriously bad looking font, why is the lowercase w not hinted symmetrically? and why is the leading so tight? whats with the y shape?, and does the dot on the i need to be so high?\n\n"
    },
    {
      "time": "14 Jun 2006 — 5:52am",
      "content": "Vince - I had noticed that Tahoma had a very Johnston-like M. That explains it. For sans the splayed M is still much better than one with a \"v\" that touches the baseline. Trebuchet shows up in lots of print and display advertising, and some signage in my area.\n\n"
    },
    {
      "time": "14 Jun 2006 — 6:42pm",
      "content": "I use Verdana most of the time, it has good proportions, but I recently switched to Trebuchet.\n\n"
    },
    {
      "time": "15 Jun 2006 — 6:46am",
      "content": "M. Duggan Spanketh: \"...that is a seriously bad looking font, \"\n\nFor those of you who might wonder at Mike's post, he's pissed at me for telling another forum (a MS one at that), that he called them \"all morons\" for questioning the wisdom of converting the once nearly standard points-per-inch into a \"variable\", (and one MS has not described). But, I apologize, I'm sorry, and I give Mike free reign to start a smear and bad-type witch-hunt. I can handle it, completely. Can you?\n\nOn my post the individual pixels of this precious font are exactly where I and the client want(ed) them, sorry. The leading is mine and reflects my reading skills (the client got more). But Mike, those are all \"tree\" issues only \"appreciated\" in zoom. Maybe they are even \"leaf\" issues, but that... depends on the scale factor. ;)\n\nYou, Mike-rosoft, have forest issues you are politically and intellectually prevented from facing. Canadra e.g., is a beautiful outline, stunning even, probably the one I'd most likely use in print, if it were made for that. But the x-ht. region (9 p @ 17 a pixel em according to John's post-it-note, sans-zoom), is so ham-fistedly flattened by your (?) hints, (to the same 2 pixels as my wee font's 5 pixel x-ht....!?), that I wonder if you're trying to emulate smeared 1980's dot matrix printers. Are you?\n\nThe outline shows consistent strokes and spaces, the branches of pdbqnmru, e.g., all nice and sweet, but by the time it's in John's specimen...they're just like Robert E. Lee's brother, Ug. The aerst, a substantial subset of our Latin use, are all poorly rendered from nice outlines, and the dot on the i is so low, (how low; it looks up to a snake) it's el-ing...\n\nLeaves, I know, but these are all Screen Typography 101. Maybe, Kevin can do a study: does a human see an i with no or distant dot better than an i with-dot-too close (in context only please, no tricks)? And, since leaves are your specially, so while you're at it, why not tighten up the hyphen so two will look more like an em dash when windows users need one?\n\n"
    },
    {
      "time": "15 Jun 2006 — 9:01am",
      "content": "Once again David also speaketh, in the usual cryptic language. Dave I am not pissed off, I just thought the font looked bad, hinting is supposed at its simplest level take care of symmetry issues such as the lowercase w and the shape of the y. You can tell me whatever you like in the most cryptic terms, you can tell me you wanted the w that way, ok. but I as an observer can disagree that I think it’s a good font for reading, I don’t like it, and I wouldn’t use it ever, and my criticisms of it still stand. I don’t understand any of your comments on Candara, possibly John might? When I compare Candara in CT to your font I see that the game is finally over. I mean come on, who is finally going to say, hey look the king David has nothing on....  \nIt might be good for us to meet up sometime to discuss, as the forum here doesn’t help us progress methinks.\n\n"
    },
    {
      "time": "15 Jun 2006 — 10:43am",
      "content": "David, the Candara hinting was done by Tom Rickner. It's relatively flat in the x-height _because so is the outline design._ If you compare the screen rendering to the printed type, side-by-side, it is pretty obvious why Tom made the decisions he did, because any other decisions would be distortions of the design. We all know that black and white bitmaps can be highly readable; the goal with ClearType is to not only make type readable but actually make it look like the individual typeface at the same time. Your black and white bitmaps for Concert, regardless of whether one likes them or finds them readable, give me no idea at all about what the actual typeface design looks like.\n\nAs I see it, we have:\n\nBlack and white aliased bitmaps: good readability, bad typeface differentiation.\n\nGreyscale antialiasing: poor readability, better typeface differentiation.\n\nCLearType rendering: good readability, much better typeface differentiation.\n\nI'm sorry, but I'm with Mike: the Candara example simply looks way better than yours. Is there seriously some deliberate reason for this:\n\n ![](http://web.archive.org/web/20150129054751im_/http:/typophile.com/files/ConcW_4435.gif)\n\n"
    },
    {
      "time": "15 Jun 2006 — 3:01pm",
      "content": "Flying w's, take this pile of m&m's and shove it! :)\n\n ![](http://web.archive.org/web/20150129054751im_/http:/typophile.com/files/W_4685.grab.jpg)\n\nLike I said, nothing to hide. I'm sure every pixel of Canadra is perfect at 10 pixels per em. So, if you want to make that comparison, fine. I was asked what I read. Someone came along and said \"wow, that's bad type you read there\" I answered that bad type is a relative term...e.g. look at this yellow thing. Now, can you fellas show me Canadra at 10 pixels on a Mac or not? ;) 10 pixels at all? or are apples and oranges comparisons, studies, tests and fonts, all you ever do to arrive at the 1 \"true\" answer?\n\nAnd, I'm sure Tom did the best job he could with the staggering amount of complexity needed to make and hint these fonts. I tip my glass to him. But the x-ht. region (9 p @ 17 a pixel em according to yellow type), is ham-fistedly flattened by his hints, and still I wonder if you’re trying to emulate smeared 1980’s dot matrix printers. Are you?\n\n\"hey look the king David has nothing on….\" King? I was never so anointed, but as it only took your co. $30 million (or so), and 17 years to get where you imagine me to be, I'm glad for you. And, I'd take you up on the drink, but I hear no room for progress, and I see less. There is no default for 72 points per inch right, The rendering will only be done based on the assumption that CT outlines have been designed, There will be no variations, There will be no CT with integer spacing. Your operating system is done forever, isn't it?\n\n"
    },
    {
      "time": "15 Jun 2006 — 3:35pm",
      "content": "_Now, can you fellas show me Canadra at 10 pixels on a Mac or not? ;) 10 pixels at all?_\n\nOn a Mac? No.\n\nI can show you Candara at 10 ppem on Windows, but that makes the x-height smaller than your Concert. In order to match them one would need to go for 12 ppem.\n\n ![](http://web.archive.org/web/20150129054751im_/http:/typophile.com/files/Cand1012_6481.gif)\n\nAs you can see from the nominal point sizes, these ppem sizes are pretty friggin' small on my system.\n\n_But the x-ht. region (9 p @ 17 a pixel em according to yellow type), is ham-fistedly flattened by his hints_\n\nTom's hints are actually very light: as I said, the flatness is in the design. If you push the curve connections lower on the stems at that size, it stops looking like Candara.\n\n ![](http://web.archive.org/web/20150129054751im_/http:/typophile.com/files/CandnVTT_5889.gif)\n\n"
    },
    {
      "time": "15 Jun 2006 — 3:44pm",
      "content": "The difference between the two w's is that the 'M&M' colours are not apparent at actual size. That stray black pixel is impossible to miss even when the pixels are as small as they are on my screen.\n\nBy the way, I use an off white background in my e-mail client because I happen to like it. I got into the habit when using CRT screens, because the brightness and contrast settings always seemed to force a choice between violently glaring white and dull grey. Off white background colours, like off white paper stock, allowed me to keep up the brightness without the glare.\n\n"
    },
    {
      "time": "15 Jun 2006 — 4:37pm",
      "content": "- And, I’d take you up on the drink, -\n\nI didnt say anything about a drink ;-) David you like black and white bitmaps to read, and you like to have your characters badly shaped onscreen, what can be bad for you about that, you have everything you want. Just so you know the CT font collection was my idea originally. I proposed it because I thought that with the advent of ClearType, we could make the screen an even better place to read, and so we designed some typeface that take advantage of the new technology. I think it worked, in fact I benifit from it every day, as does JH. I use the CT fonts on my system everyday, and we have heard from many other how they also do. The CT font collection are not the only fonts however that benifit from CT. Verdana and Georgia, and Trebuchet for instance all look great in CT. Any font that is well hinted and has a good weight for onscreen rendering will also look great. There is no way forward if we stick to black and white rendering. You just cant make beuatiful pages that way, type needs to look & read like type. You mentioned earlier that I was both intellectually and politically challenged,(is the first part of that an insult? ;-) and that you didnt see any point in meeting afterall as you saw no progress. Its a shame, as there clearly is progress, but you just dont see it yet. The offer still stands, and sure ok I will buy you a drink. :-)\n\n"
    },
    {
      "time": "20 Jun 2006 — 11:13am",
      "content": "Sorry to take so, and be so, long. Summer came. I went out. It was nice. I’m back. Not for long.\n\nJohn’s in quotes.  \n“I can show you Candara at 10 ppem on Windows, but that makes the x-height smaller than your Concert. In order to match them one would need to go for 12 ppem. “\n\nNo john, you don’t get a match for Concert 10 at 12ppm, it doesn’t work that way. Ironic... on my Mac, there are five sizes for email type in “Entourage”. Smallest, Smaller, Medium, Larger and Largest, although I think these actually can be represented by numbers that represent points. On Windows, in Entourage, are there names for the sizes? or numbers?\n\n“If you push the curve connections lower on the stems at that size, it stops looking like Candara.”\n\nUnless it’s about the outline, and not the typeface, it stops looking like Canadra with a 2:1 ratio of stem to hairline i.e. From 12 to 25, (reading range!), should’a made a Gothic. The point (at this late stage in the game), of your kind of sub pixel rendering in an inflated density-of-points-per-inch universe, I’d think... is to jump to a reading range where more or less than two pixel stems exist, as fast as possible...In fact, if you were cramming points and l.c. body building with that goal in mind...I’ll tell Mike in a minute...\\*\n\n“That stray black pixel is impossible to miss even when the pixels are as small as they are on my screen.”\n\nMy little diagram (at “100%” ;) (Which I can’t attach because this crappy forum’s like that), shows how Verdana performs on the Mac (it doesn’t). If this were my product, I’d reject it before it got out the door. So, I adopted Concert, because \\*\\*\\*it was the only face I know, or have seen anywhere... that matches Verdana as Verdana appears on a Windows machine\\*\\*\\*, which I like. Pause, look, and consider the qualities I had to reject. Y and y, (Verdana), look pretty good in the outline, but (at 9, 10 and 11 ppm), turn into a radiation symbol, and a u oganek (for the world)... And you’re worried about my wee pixels (just for me)? John, your typographic judgment, which I summarize below as “get used to it”, when looking at the broad needs of users or email users, is in a believe system I do not understand.\n\n“Off white background colours, like off white paper stock, allowed me to keep up the brightness without the glare.”\n\nBack up dude, or get a better monitor. Mine adjusts minutely and by switching users as darkness grows, or when lightness comes, you have “options” that don’t involve experiments on your rods and cones. By options, I mean that type and user become more fluid than one hack after another to land in some spot...the screen is not just a book/note book — its a TV, a jukebox, a weather station, a telephone, a vending machine, a million different vending machines, a comic book and a house of worship. You gonna carry around little yellow tissues to stand on in all those places where CT goes?\n\nThen (and it’s a good thing I have a secret twin) Mike:  \n“David you like black and white bitmaps to read, and you like to have your characters badly shaped onscreen, what can be bad for you about that, you have everything you want.”\n\nI know, slam the man’s wart after giving him leprosy, I axed for it. See Verdana. See Verdana poop on the Mac? :)\n\nMike, you could have done the same magnificent job on these and the CT fonts if you/MS had allowed you/ATR to do it without tricks. These fonts greatness begin where 2 pixel stems (of any color) begin, and lasts to where the xht. has become too big on the body. See, users prefer Verdana and Georgia! (that early study), ((((until they prefer Arial and Times at...14? 16? pt.)))) (what ever “pt.” means). That says a lot ya’ know — here are print fonts, beating screen fonts on the screen! So, scaling the body has great effect, but as you know, or maybe not, you can’t tug on one end of This rug without moving the other. So, Verdana functions best in print as a small point size, not as a match of the use on screen, (or do you scale printed points too ˜˜#01(!\\*?). Arial and Times (and their genuine italics) are superior in print for their compactness in composition, for their better proportioned heights, and more favorably chosen contrasts. So, scaling the body (and other optical tricks for screen fonts), leads to a diminishment of the functional range. Adding the fact that CT does not deal in B&W, you have a range of positive effect from 10 ppm till, who knows, but it’s finite beyond your wildest claims.\n\nDensity is the second trick. (I don’t have a typographic term for it, because no one else has decided on cramming more “points” into an inch, what do you call this?). By adding significantly to the usual 72 points per inch, you almost insist on scaling the body larger to be successful at screen text sizes, you shift the location of the 1-2 pixel barrier down the point-size range, though not quite far enough\\*, and as screen resolution climbs the 1-2 barrier shifts even farther... then pffft what happens?)†. Good Job. Now we can make text OR display faces for the screen. Or, we can cop an attitude like John’s, (which I highly disrespect), that users will “get used to” huge bodies, like they’ll “get used to” his mismatched companion italics in print? NOT my clients, sorry.\n\nThere are lots of possible ways forward. But let me tell you “the one”, because I’ve seen it from MS before —Nothing will be said outside of the official party channels. I.E. There was no public help whatsoever when MS decided to change the name of Helvetica to Arial, with all the kluge work that represented. There was no guide-to, definition of, or disclaimer when MS redefined the point, with all the kluge work that represented... And now...CT fonts, will be endlessly distributed for free, and no one will ever know outside of “this room” where the rug went, and what “those nasty little designers did this time”, unless...\n\nMy ideas (of general progress for all screen font users) are: variation technology, higher resolution and bigger screens, 2 kinds of distant users, and bigger fonts, based upon a 72 point per inch system that allows integer and non-integer spacing, color and b & w rendering, and a tuner that covers the needs of all users. Personally, I’d also like 7 kinds of font encryption, one of which would be reserved for companies in the type industry.\n\nMS has ruled variation technology out, created its own definition of resolution outside of broad standards, defined the distance users should be from the screen (literally, once-and-for-all), opposes distant links of fonts to users on de web, shrinks fonts then grows fonts, uses integer metrics vertically - not horizontally, and has the b&w rendering just about right but believes only in color rendering.\n\nI am obligated, as small as I am, to stick to an infinitely more hopeful definition of progress than your dark and typographically twisted scenario. The fonts scale. They do, really, you don’t have to do it for them. The users, they know how to change point sizes too, really, they do, you don’t have to do it for them. Your way, I’ll try progress (just right now!)\\* See if you can slam a few more points into an inch, i.e. get that friggin x-ht. up to 17 pixels at 12 pt 144 dpi, because when I hear “...and square shapes work better than round ones” and I see no Old Style in your CT Collection, I know we have not gotten to “solving the screen font problem on windows.” Also, as resolution climbs further, tell me when your redefinition of the points per inch is no longer a good thing (wasn’t that just ‘cause early windoze monitors were \\< 72?)†. I know 72 points per inch is an option buried somewhere in the user’s choice, and I’ll need to figure out how to manipulate that if I want to play.\n\nIn the mean time, I’ll use a Mac. And I hope if your products of your quality definition arrive here again, and as you can see, they suck, maybe they’ll get better. But I’m mostly interested in sizing, instructing, and pressure testing my email fonts to work on the Mac. Second, my print clients use the Mac, and we only gaze into your typographic Tartarus as files fly through in PS production, above your OS we miss your kluges. Third, since you guys got into the fonts online business, print readability fonts have become all the rage, keep it up. Finally, I must stand clear of your progress because someone’s gonna have clean this mess up, and I bet you will not be there. If you are, then start cleaning up now: publish a specification for “CT on Windows” from the beginning of the “em” to the rasterizer’s decision string per pixel, x and y if they are different. If you can do that, honestly, then “it” wasn’t an insult,honestly, if you can’t then “it” also wasn’t an insult, honestly.\n\nAll the best.\n\nP.S. Mr. or Ms. Typophile, when you accept .pdf files, Email me, and I’ll be back. Until then, I’m out of here.\n\n"
    },
    {
      "time": "20 Jun 2006 — 3:35pm",
      "content": "_No john, you don’t get a match for Concert 10 at 12ppm, it doesn’t work that way._\n\nI meant that is the size at which the x-height in pixels is matched, which seems to me the best way of comparing lettershapes and rendering. But I showed you the 10ppm size too.\n\n_On Windows, in Entourage, are there names for the sizes? or numbers?_\n\nI've no idea. I use Thunderbird for email, and font size is spec'd in pixels.\n\n"
    },
    {
      "time": "20 Jun 2006 — 3:35pm",
      "content": "PS. The ending of your post seems to be truncated, David.\n\n"
    },
    {
      "time": "21 Jun 2006 — 5:38am",
      "content": "I think the greater-than symbol makes it seem to the software that there is an html tag to follow and it hides the rest of David's post.\n\nChrisL\n\n"
    },
    {
      "time": "21 Jun 2006 — 8:07am",
      "content": "Chris was correct. I edited David's post to read \"more or less than two pixels\" in the fifth paragraph so it wouldn't be truncated by the forum software.\n\nDavid, you can attach files of any type to the first post of a thread, but the feature is missing in \"comments\" or subsequent posts. I hope the guys at Punchcut will fix that soon.\n\n"
    },
    {
      "time": "22 Jun 2006 — 12:23am",
      "content": "_Or, we can cop an attitude like John’s, (which I highly disrespect), that users will “get used to” huge bodies, like they’ll “get used to” his mismatched companion italics in print?_\n\nI think this is very unfair. I don't think I have said anything, in this thread or elsewhere, to suggest that is my view. I certainly don't recall using the phrase 'get used to' about any of these things, so I'm not sure why you are putting it in quotes. You've decided that this is my attitude, and you are wrong, and in the process of being wrong you seem to be ignoring the areas in which I agree with you and the more substantial areas in which I can't disagree with you because I haven't got a clue what you are talking about.\n\nWorried that I might actually have said something to lead you to this erroneous and unfair characterisation of my opinion, I did a search to see if I had ever, in fact, used the phrase 'get used to' in any Typophile thread. I found one from the discussion on type and national identity back in April:\n\n**It takes less than one generation for readers to get used to a particular or limited set of type styles, or to the output of particular typesetting technologies which may have significant technical limitations, and then to mistakenly cling to these as being ‘correct’, in the process abandoning huge swathes of the history, evolution and variety of their writing system.**\n\nNow you might pause to consider that someone who made such a statement might share many of your concerns about limitations in type technologies and the narrowing of options. I have already said, in one of our other discussions, that I don't think Microsoft's readability research has been substantive enough to be the basis making ClearType the only rendering option in an operating system, and that such a decision is more likely to be driven by engineering criteria. I happen to think that ClearType rendering is on the whole better than other stuff I look at, but I'm also concerned about what might be compared to a loss of biodiversity.\n\nOn the subject of 'density', I'm still not sure what you are talking about. Sorry to be slow, but can you explain?\n\n"
    },
    {
      "time": "22 Jun 2006 — 6:50am",
      "content": "Garamond and sometimes Trebuchet MS  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nClaude Garamond ♥ Aldus Manutius ♥ Francesco Griffo ♥ Eric Gill ♥ Hermann Zapf ♥ William Caslon ♥ Nicholas Kis ♥ Otl Aicher\n\n"
    },
    {
      "time": "22 Jun 2006 — 3:05pm",
      "content": "Sorry... I used symbols that should never be used for anything but Mat, but some pinhead figured'd be \"okay\" to make in to typesetting commands in the midst of text.\n\n...your (windows) redefinition of the points per inch is no longer a good thing (wasn’t that just ‘cause early windoze monitors were !@#$#% less than 72?). I know 72 points per inch is an option buried somewhere in the vista user’s choices, and I’ll need to figure out how to manipulate that if I want to play according to \"my own\" rules ;)\n\nIn the mean time, I’ll use a Mac. And I hope if your (Mike'srosoft), products of your quality definition arrive here again, and as you can see, they suck, maybe they’ll get better. But I’m mostly interested in sizing, instructing, and pressure testing my email fonts to work on the Mac. Second, my print clients use the Mac, and we only gaze into your typographic Tartarus as files fly through in PS production, above your OS we miss your kluges. Third, since you guys got into the fonts online business, print readability fonts have become all the rage. Finally, I must stand clear of your progress because someone’s gonna have clean this mess up, and I bet you will not be there. If you are, then start cleaning up now: publish a specification for “CT on Windows” from the beginning of the “em” to the rasterizer’s decision per pixel, x and y if they are different. If you can do that, honestly, then “it” wasn’t an insult, honestly. If you can’t then “it” also wasn’t an insult, honestly.\n\nAll the best.\n\nP.S. Mr. or Ms. Typophile, when you accept .pdf files, Email me, and I’ll be back. Until then, I’m out of here.\n\nJohn: I’ve no idea. I use Thunderbird for email, and font size is spec’d in pixels.  \nThen I guess I wasn't asking you. :)\n\nJohn: I certainly don’t recall using the phrase ‘get used to’ about any of these things,  \nNo, you said something like \"a new aeshetic\" has been forced, same thing.\n\nJohn: On the subject of ‘density’, I’m still not sure what you are talking about Sorry to be slow, but can you explain?\n\nThat's not slow john, it's a....stationary. \"(I don’t have a typographic term for it, because no one else has decided on cramming more “points” into an inch, what do you call this?)\"\n\nIs that not clear?\n\n"
    },
    {
      "time": "22 Jun 2006 — 6:05pm",
      "content": "_No, you said something like “a new aeshetic” has been forced, same thing._\n\nNope. I don't think I said that either. What I do remember saying, and what one can find me saying if one bothers to search, is that the MS ClearType Font Collection represents the approaches of several different type designers to the briefing to design fonts specifically to work with ClearType. I also said that I didn't consider any of them to be the last word on the subject.\n\n_(I don’t have a typographic term for it, because no one else has decided on cramming more “points” into an inch, what do you call this?_\n\nYes, I got that, I'm just wondering to what specific action of Microsoft's you are referring, i.e. what did they do and when?\n\nYou wrote above that you know your 10pt Concert on the Mac is within half a pixel of actual 10pt size, but I'm not sure how important that is. But maybe that's just because I've spent almost my whole computing life on Windows machines. I tend to think of point size as a specification for size of type on paper, and I have long since ceased to expect text on screen to be 1:1 size with type on paper when both are e.g. nominally 10pt. A half pixel rounding difference at 10pt is also a variation between screen and print.\n\nI was pleased to see my email app specifying screen text sizes in pixels and allowing me to set my display resolution, i.e. to see an application from which I am almost never going to print anything treat type as a screen medium and not make any reference to point size. This is much preferable to the many applications that force an integer point size choice that skips the ppem size I actually want to use. But lack of support for fractional point sizes is another issue...\n\n"
    },
    {
      "time": "22 Jun 2006 — 6:11pm",
      "content": "Ouch! I have to remember not to check this thread again.\n\n"
    },
    {
      "time": "22 Jun 2006 — 10:43pm",
      "content": "lol ditto. my poor thread :(\n\n"
    }
  ]
}
