{
  "id": "20592",
  "title": "Underline Fonts in Macintosh",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Fonts for teaching Triqui, a language created by a missionary named Barbara Hollenbech.\n\nI have a Triqui Song book that uses underlined fonts. In Final Cut Pro and Type Styler on a Macintosh, none of the fonts use underline and I have been trying to use the SIL underline fonts to create a Karaoke file with Apple Applications.\n\nI need a font which has built in underline vowels a, e, i, o, and u, both in Capital Letters and non cap letters.\n\nNothing from SIL works with the Macintosh Applications.\n\nSeveral people have designed fonts (including me) but upon inserting text in Type Styler, they revert to different characters or just don't show up.\n\nHelp\n\nanyone\n\nthanks\n\n",
  "author": "bobbywatts",
  "time": "10 Jun 2006 — 9:26am",
  "uid": "13349",
  "comments": [
    {
      "time": "10 Jun 2006 — 9:42am",
      "content": "You need TypeTool or Fontographer to create a font with the underlines you need. Once generated and installed it will work with any application. TypeStyler just styles the type you are working with in it - you then can export it but it is not a font but a picture of your styling.\n\n"
    },
    {
      "time": "10 Jun 2006 — 1:41pm",
      "content": "Were it that simple, we would have accomplished it already.\n\nGive it a try. We hvae fontographer, fontlab and makke fonts but it appears that Type Styler reads unicode and we are unable to make the necessary changes to get to the font and make it work.\n\nIf you have a moment, could you try just a letter and let me know if you have success?\n\nAnyone\n\n"
    },
    {
      "time": "10 Jun 2006 — 1:45pm",
      "content": "Were it that simple, we would have accomplished it already.\n\nGive it a try. We hvae fontographer, fontlab and makke fonts but it appears that Type Styler reads unicode and we are unable to make the necessary changes to get to the font and make it work.\n\nIf you have a moment, could you try just a letter and let me know if you have success?\n\nAnyone\n\n"
    },
    {
      "time": "10 Jun 2006 — 2:31pm",
      "content": "\\> _We hvae [...] fontlab [...] but it appears that Type Styler reads unicode and we are unable to make the necessary changes to get to the font and make it work._\n\nYou're probably just not assigning the correct [Unicode](http://web.archive.org/web/20150420002840/http:/typophile.com/wiki/Unicode) values. Have you read FontLab's manual on this topic?\n\n"
    },
    {
      "time": "10 Jun 2006 — 2:58pm",
      "content": "\\> In Final Cut Pro and Type Styler on a Macintosh  \n\\> Nothing from SIL works with the Macintosh Applications.\n\nMac 9.2/Classic? Mac OS X? (TypeStyler runs under the Classic environment)\n\n"
    },
    {
      "time": "10 Jun 2006 — 4:54pm",
      "content": "Yep,\n\nRead the books, got some help from font designers and ....\n\nnada\n\nAnyone out there want to give it a shot? Got Macintosh?\n\nThanks\n\n"
    },
    {
      "time": "10 Jun 2006 — 5:02pm",
      "content": "In our office here in Mexico, working with the Triqui, we have a dual 2 gig with 3.2 mb ram. three terabyt of storage and 10.4.6? We have four other machines as well but can't seem to get around this one.\n\nNeed to do a Karoke video for the Triqui.\n\n[http://www.hiddenpeoples.org](http://web.archive.org/web/20150420002840/http:/www.hiddenpeoples.org/ \"http://www.hiddenpeoples.org\")\n\n"
    },
    {
      "time": "10 Jun 2006 — 5:18pm",
      "content": "We can't see it in Live Type either.\n\nWe have had three font designers try to give us a hand, there must be some briliance that can get this done?\n\nbobby\n\n"
    },
    {
      "time": "11 Jun 2006 — 8:56pm",
      "content": "Well, I have won the dumb contest in our mission.\n\nCan't figure this one out. I can make a font, change a font, correct a font but getting it to work in Final Cut Pro and Live Type or other Macintosh programs seems to be out of my grasp.\n\nIf anyone has an underlined vowel font that will work with Live Type on OSX 10.4.6,let me know?\n\nbobby\n\n"
    },
    {
      "time": "12 Jun 2006 — 7:41am",
      "content": "The staff are wondering if money is the answer?\n\nAnyone out there willing to come up with an underlined vowel font that works in Live Type and Final Cut Pro?\n\nDumb is such a nasty disease, it seems to spread.\n\n"
    },
    {
      "time": "12 Jun 2006 — 11:28am",
      "content": "Ok, I don't get it.\n\nAre you saying you have taken a font and altered it in FontLab, adding an underline to the \"a\" glyph, leaving it in the \"a\" position, and that the altered font doesn't display the underline in Final Cut? If so, are you renaming the font? How are you installing it? Could it be that you just have to clear a font cache?\n\nOr, are you using an altered glyph in a new position? If that's it, what position are you placing the new glyphs in? How are you encoding the altered font? What format are you using?\n\nI know nothing of Triqui. Has it an assigned Unicode range?\n\n"
    },
    {
      "time": "12 Jun 2006 — 2:55pm",
      "content": "One of the font writers said;\n\nGentium1021.zip which contains my modified versions of Gentium and Gentium Italic with the extra glyphs in the Private Use area. The TTF files have been renamed to avoid confusion with the originals, but the fontname is unchanged. To install them, backup your original Gentium fonts, uninstall them, and try these.\n\nThey work fine in Wordpad, so they should be OK with other applications besides Word provided you have some means of actually typing them.\n\nIn Wordpad, hold down the alter key and type the codepoints 57344 to 57348 and press space to insert the capitals. Hold down alter and type codepoints 57349 to 57353 to type the lowercase.\n\nWhat we have done is altared a text, modifyed glyphs, created private use area glyps, typed text in Word, copied it to Live Type or Final Cut Pro to make it work and it reverts to the assigned unicode range. There is no unicode range assigned to the Triqui language.\n\nThere are three downloadable fonts from SIL that do have the charachers mad but cannot be used in Live Type or FCP.\n\nWe need to import fonts from text files into Power Video Karaoke and none of the fonts we have works there either,\n\nI think I am barking up a gree that just isn't there.\n\nI need the áíóú as well so that led me to modify some of the others and nothing works with Final Cut Pro, Live type or private areas. Modifying the existing fonts works as well though Live type does not recognize the modified glyphs even when Word does. iMovie does as well, but not Live type....\n\nI really wanted to use Macintosh but I have no Karoke answer there, may need to go back to one of the doze machines.\n\nSimple as it should be, typing in word, making it work, copying to live type and outputting a file for use in Final Cut Pro just is not happening.\n\nThanks, someone must know how to make it work.\n\nbobby\n\n"
    }
  ]
}
