{
  "id": "2060",
  "title": "Book Design in need of a handwritten (childlike, not childish) font with lots of alternates",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Ideas?\n\n",
  "author": "Miss Tiffany",
  "time": "12 Nov 2003 — 3:43pm",
  "uid": "108",
  "comments": [
    {
      "time": "12 Nov 2003 — 4:18pm",
      "content": "I remembered a handwritten font that was used for the Euro 2004 (portugal) identity. It's marydale. It looks great and it's free:   \n   \n [http://www.the-cranberries.de/downloads/cranfonts.htm](http://web.archive.org/web/20131016220221/http:/www.the-cranberries.de/downloads/cranfonts.htm)   \n   \nLook for the Euro 2004 identity PDF font application:   \n [http://design.musicdrops.com/euro2004/euro2004.pdf](http://web.archive.org/web/20131016220221/http:/design.musicdrops.com/euro2004/euro2004.pdf)   \n   \nAnd if you are need the MAC version, download it here: [http://design.musicdrops.com/euro2004/mac.zip](http://web.archive.org/web/20131016220221/http:/design.musicdrops.com/euro2004/mac.zip)\n\n"
    },
    {
      "time": "12 Nov 2003 — 4:18pm",
      "content": "... Someone should fix this double post thing ![:-)](http://web.archive.org/web/20131016220221im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "12 Nov 2003 — 4:29pm",
      "content": "The child's hand font family by John Critchley and distributed by FontFont (not free by a long shot). Possibly too childish? but most definately childlike. Enough variation?   \n ![Child's hand](http://web.archive.org/web/20131016220221im_/http:/www.typophile.com/forums/messages/4100/20370.gif)\n\n"
    },
    {
      "time": "12 Nov 2003 — 5:03pm",
      "content": "Much prefer the sans as the roman appears a little too twee. My only problem is that it's almost leaning towards comic sans MS(AAAAHHHHHGGG)\n\n"
    },
    {
      "time": "12 Nov 2003 — 7:07pm",
      "content": "Tempus and Tempus Sans are not chidlike, but they are quite playful, but still very readable. I don't know if they suit your project, but they are a masterful version of this kind of thing.\n\n"
    },
    {
      "time": "12 Nov 2003 — 8:48pm",
      "content": "I'm not getting the difference between \"childlike\" and \"childish\".   \nDo you want it to look like a child wrote it? I'd worry about readability of such a design.   \n   \nWhat about this:   \n [http://www.eccentrifuge.com/clients/BarchowskyFluentHandOTGr.html](http://web.archive.org/web/20131016220221/http:/www.eccentrifuge.com/clients/BarchowskyFluentHandOTGr.html)   \n   \nhhp\n\n"
    },
    {
      "time": "13 Nov 2003 — 4:02am",
      "content": "There are a lot of good playful fonts in the [House General Collection](http://web.archive.org/web/20131016220221/http:/houseind.com/house.php?kit=GENCOL-FO).\n\n"
    },
    {
      "time": "13 Nov 2003 — 5:16am",
      "content": "While not a child's hand, ITC Zemke Hand has a lot of desirable characteristics.   \n   \n [http://www.itcfonts.com/fonts/detail.asp?sid=LXWS63SASLXB9MTHTN1AGH0F1V2U8E1C&sku=ITC2393](http://web.archive.org/web/20131016220221/http:/www.itcfonts.com/fonts/detail.asp?sid=LXWS63SASLXB9MTHTN1AGH0F1V2U8E1C&sku=ITC2393)\n\n"
    },
    {
      "time": "13 Nov 2003 — 5:53am",
      "content": "just asks some children to write it.......\n\n"
    },
    {
      "time": "13 Nov 2003 — 6:21am",
      "content": "Yes, if the text is short, actually lettering it is the best thing. If you are not a letterer, getting a great letterer like Mark Simonson might be the best route, if the publisher can afford it. An actual child's writing might be too undisciplined for readability, but you could try it, as Po-Hsuan suggests.\n\n"
    },
    {
      "time": "18 Nov 2003 — 4:57pm",
      "content": "Take P22's advice, if you want a handwritten font, then hand write it. No digital face can express what the hand can do. Script fonts look fake in my eyes.\n\n"
    },
    {
      "time": "19 Nov 2003 — 4:14am",
      "content": "i agree.. digital handwritten fonts never look quite right. probably because as each character is repeated, it is the exact same glyph, unlike what happnens when something is actually hand written.   \n   \non a side note.. does anybody know if there are any, or if it is possible to make a font where you have several (maybe 5 or so) glyphs for each character that are used at random when typing? I always thought this would be something that would help a handwritten digital face look more authentic.   \n   \nJoe- thats a great link, i enjoyed seeing holly's work.. very inspirational.\n\n"
    },
    {
      "time": "19 Nov 2003 — 5:23am",
      "content": "Great suggestions in this thread, even though I think it would be a good thing seeing some of the drawings of the illustrator, yes Tiffanny it is a PITA, they have to work so well together...   \n   \nYou could also take a look at the [Go Font Yourself Handwriting Fontpak](http://web.archive.org/web/20131016220221/http:/www.chank.com/img/aGFYdisplay.pdf) from Chank.\n\n"
    },
    {
      "time": "19 Nov 2003 — 9:20am",
      "content": "\\> probably because as each character is repeated   \n   \nI've come to the tentative conclusion that the necessity for letterform \"randomness\" is limited to foveation. What I mean is that as long as the font uses 3 or 4 variants of a glyph (which is the most we can see in the fovea at one time, and that's assuming 3 or 4 of the same letter ever actually happens in sequence...) it's OK, because short-term memory concerning exact glyph shapes probably doesn't survive a saccade. Interestingly, Letterror's FF Kosmik-Flipper uses 3 variants per character.   \n   \nBut I've also come to realize there's a much bigger problem: handwritten stuff typically has _mistakes_ in it, which can either be corrected -but visibly- or just left in. This means you need some fancy software to replicate that in order for something to truly appear handwritten...   \n   \nhhp\n\n"
    },
    {
      "time": "29 Jan 2004 — 6:21pm",
      "content": "okay here's an interesting thought: could you program random picking of alternate characters into opentype? (if you've seen any of my other posts recently, you can see that i'm developing an obession for this new type platform, sorry) if not maybe those guys at adobe and microsoft should look into it! I think it would be a fascinating dimention for faces that want to convey a bit more spontenaity.\n\n"
    },
    {
      "time": "30 Jan 2004 — 2:35am",
      "content": "Hi Paul,   \n   \nthere is a font which does what you describe: FF Kosmik from the FontFont library.\n\n"
    },
    {
      "time": "30 Jan 2004 — 8:03am",
      "content": "very interesting, anyone know or care to explain how that works?\n\n"
    },
    {
      "time": "30 Jan 2004 — 8:39am",
      "content": "Paul, you could contact the designer/programmer: Erik van Blokland   \nlook at his website: [www.letterror.com](http://web.archive.org/web/20131016220221/http:/www.letterror.com/)   \n   \nthere is also some short info on what FF Kosmik does on [www.fontfont.com](http://web.archive.org/web/20131016220221/http:/www.fontfont.com/)\n\n"
    },
    {
      "time": "30 Jan 2004 — 6:13pm",
      "content": "i shoulda gone into computer programming!\n\n"
    },
    {
      "time": "12 Nov 2003 — 4:27pm",
      "content": "Thanks for the suggestions, so far ... I'll clarify that I'm not looking for something that is free. I'm always looking for a good excuse to buy another font.   \n   \n;)\n\n"
    },
    {
      "time": "12 Nov 2003 — 4:37pm",
      "content": "If you want a full version of Marydale it can be found at the   \nfoundry that released it - [the Type Quarry](http://web.archive.org/web/20131016220221/http:/www.typequarry.com/type.html?sku=016&cart=106868373314137119).\n\n"
    },
    {
      "time": "12 Nov 2003 — 4:49pm",
      "content": "Ok. I've re-read the script. I'm pretty sure that this story is being told from the child's POV. It is, actually, more of a long poem set into a book.   \n   \nI can't show you text or images so I know this makes it into a total PITA!!! But, what do you guys think of FF Providence? Sans or Roman??\n\n"
    },
    {
      "time": "12 Nov 2003 — 11:20pm",
      "content": "For inspiration, Holly Dickens has some nice custom lettering. [http://www.hollydickens.com/](http://web.archive.org/web/20131016220221/http:/www.hollydickens.com/)\n\n"
    },
    {
      "time": "13 Nov 2003 — 8:16am",
      "content": "After sleeping on it for one night. I've decided, as some of you have suggested to pursue handlettering as an option. The illustrator also has a very unique lettering style that would fit right alongside her illustrations. This is only for a comp to present to the publisher's. They have approved the manuscript, but we are now onto getting the artwork approved. One step at a time.   \n   \nThanks ![:-)](http://web.archive.org/web/20131016220221im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n(especially for that link, Joe, I love to see lettering work)\n\n"
    },
    {
      "time": "11 Jun 2004 — 1:25pm",
      "content": "Hi guys!   \n   \nDoes Anyone knows where can I find the font for Euro 2004 under the logo?   \n   \nTks   \n   \n [http://www.euro2004.com](http://web.archive.org/web/20131016220221/http:/www.euro2004.com/)\n\n"
    },
    {
      "time": "12 Nov 2003 — 3:56pm",
      "content": "Try Felt Tip Roman by Mark Simonson, Cinahand by You Work for Them, FF Friday, Saturday, Sunday, FF Justlefthand, FF Schulschrift, FF Soupbone\n\n"
    }
  ]
}
