{
  "id": "20608",
  "title": "Falling into type habits",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Do you ever find yourself going through phases of using specific type styles/faces for almost every job you work on (for a while)? Same with colours etc.\n\nI do. Most recent is compressed sans serif for identities.\n\nAtleast I’m aware of it occuring, so will open up a whole new world through the awareness.\n\n [‹ Looking for typography studios in London](http://web.archive.org/web/20070806235720/http:/typophile.com/node/20773 \"Go to previous forum topic\") [please critique my font guide ›](http://web.archive.org/web/20070806235720/http:/typophile.com/node/17127 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070806235720/http://typophile.com/user/13171\" title=\"View user profile.\">Ratbaggy</a>",
  "time": "<br>",
  "uid": "13171",
  "comments": [
    {
      "time": " 11.Jun.2006 7.58pm",
      "content": "hehe, this happens to me quite a bit. i think it’s pretty normal though. if something worked really well last time, it would be natural to tend towards using it again (or at least trying it..)\n\nself awareness is a good thing. mine unfortunately tends to be ironic, where i see myself doing it but am seemingly powerless to change the behaviour..\n\n"
    },
    {
      "time": " 11.Jun.2006 8.37pm",
      "content": "I work with other designers and different design firms and I’ve noticed this myself—but it varies from firm to firm (and city to city) and it might have something to do with experience.\n\nWhen I was at Chermayeff & Geismar (47 years in the design business), it hardly ever happened—those guys knew what they wanted and were never afraid to experiment—one project would be Garamond, another in DIN, while we’re were doing a CI in Charlotte. One designer there did go through an Interstate phase, though.\n\nBut at newer firms with younger designers, or outside NYC, I’ve noticed that not only will a designer stick with a typestyle over several projects, but everyone else in the studio will start using it (or similiar), too. Actually makes my job easier.:)\n\n"
    },
    {
      "time": " 12.Jun.2006 2.15am",
      "content": "cool. glad I’m not completely alone in both experiencing and recognising this phenomenon.\n\nkeep ’em coming.\n\n:)\n\n"
    },
    {
      "time": " 12.Jun.2006 3.32am",
      "content": "Happens to me with everything...  \nI always find myself listening to the same CD’s, watching the same kind of movies, using the same kind of fonts and colours for a few weeks and then graduately shift into a new phase again.  \nRight now, I have a Placebo / the Rakes / the Dead 60’s, black & white (with a hint of red & lightblue here & there), Mest ( [http://surfstation.lu/07/mest.htm](http://web.archive.org/web/20070806235720/http:/surfstation.lu/07/mest.htm \"http://surfstation.lu/07/mest.htm\")) phase.\n\n"
    },
    {
      "time": " 12.Jun.2006 8.34pm",
      "content": "Yeah, I bleed a font to death then shelve it for awhile. Luckily I have a wide range of clients so they don’t know I’m repeating myself. But when I get a crush on a font, it’s hard to beat the addiction.\n\n"
    },
    {
      "time": " 13.Jun.2006 10.03am",
      "content": "Maybe [this](http://web.archive.org/web/20070806235720/http:/typographi.com/2005_12.php) will help.\n\n"
    },
    {
      "time": " 15.Jun.2006 8.06am",
      "content": "In Britain, designers use Gill, Helvetica, Bliss and a few other sans all the time for everything.\n\nNick Cooke\n\n"
    },
    {
      "time": " 15.Jun.2006 6.08pm",
      "content": "crossgrove - thanks. interesting read with some great samples.\n\nnick - do you reckon you might be exaggerating ... just a touch? ;)\n\n—————  \n [Solid Creative - Communication Design, Melbourne](http://web.archive.org/web/20070806235720/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 16.Jun.2006 2.35am",
      "content": "Maybe.\n\nNick Cooke\n\n"
    },
    {
      "time": " 16.Jun.2006 3.52am",
      "content": "Not much though:)  \nTim\n\n"
    },
    {
      "time": " 16.Jun.2006 4.44am",
      "content": "hehehehe. ;)\n\n—————  \n [Solid Creative - Communication Design, Melbourne](http://web.archive.org/web/20070806235720/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 17.Jun.2006 11.08am",
      "content": "It’s difficult to get away from repeating yourself when it comes to sign design. I have to fight the urge to lapse back to just using Frutiger for a lot of things.\n\nLots of sign designers, unfortunately, just grab the first sans they see in the font menu: Arial. They load it and then distort it to fit the space. Ugh.\n\n"
    },
    {
      "time": " 19.Jun.2006 1.51am",
      "content": "Agreed. I find myself doing this and as Michelemiller suggests, im my case its to do with experience.\n\nI mostly typeset lightweight trade ads for newsprint (so i guess it doesnt matter!) and find myself relying on a fairly solid set of 2-plate process colours, and more often than not i’ll set body copy in gill or officina sans with Univers or Gill Compressed, or maybe DIN for headings and Chaparral Italic for leadlines and accents.\n\nI’m sure this will change over time, as I become exposed to more styles and experiment more. But for the meantime I think its okay so long as I’m aware.\n\nMaybe good typefaces are like like good wine, in that you dont start to appreciate the finer points of its characteristics until you’ve had the same (good) one a few times?\n\n"
    },
    {
      "time": " 19.Jun.2006 7.43pm",
      "content": "I think typefaces are a bit like clothing.\n\nSome kinds of clothing, like jeans, go with a lot of stuff. You can wear tennis shoes, loafers, boots, sandals or just go barefoot while wearing jeans. Pleated slacks aren’t quite so versatile. The same kind of thing occurs with typefaces. Some faces can be safely used with many other kinds of fonts without drawing reactions like, “dude, what were you thinking that day?” It’s just like that clothing comment, “you’re not going to wear that shirt with those slacks, are you?”\n\nI think playing it safe is the biggest source of one repeating himself. Of course, one may just fall in love with a particular typeface and just have to use on all sorts of stuff.\n\n"
    }
  ]
}
