{
  "id": "20633",
  "title": "Copyright Conundrum",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have an idea for a typography site. The site would be community-based and populated kind of like a wiki. Without saying too much, the site would ask members to download a Flash file, export a swf for sIFR use, and upload to the site.\n\nThe swf file would be engineered to only work on the site, and also be watermarked. The site would then display it for educational and inspirational purposes, and most definitely not redistribute them (not that they could in any usable manner considering the user never upload the fonts or original Flash file, only the swf) and most definitely not be selling fonts.\n\nConsidering no one besides the site in question would be able to use the swf, would this be illegal? Technically, I don’t think the site would be doing anything illegal, but they may be asking people to violate their license with their fonts.\n\nI have been researching as much as possible, but this is a grey area for which I am unable to really find a good answer. I am very curious to hear some opinions.\n\n [‹ Best books to buy?](http://web.archive.org/web/20080408045650/http:/www.typophile.com/node/20732 \"Go to previous forum topic\") [Freelance Typesetting Work in SoCal -- IMMEDIATE ›](http://web.archive.org/web/20080408045650/http:/www.typophile.com/node/20725 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080408045650/http://www.typophile.com/user/1485\" title=\"View user profile.\">icthyo</a>",
  "time": "<br>",
  "uid": "1485",
  "comments": [
    {
      "time": " 12.Jun.2006 8.43pm",
      "content": "I don’t understand what the site is for, or what it does.\n\n"
    },
    {
      "time": " 12.Jun.2006 8.45pm",
      "content": "I thought it was just me.  \n: )\n\n"
    },
    {
      "time": " 12.Jun.2006 9.38pm",
      "content": "I think he’s intentionally withholding. hehe\n\n"
    },
    {
      "time": " 13.Jun.2006 4.55am",
      "content": "Yes, I am :D\n\nI’m trying to be vague because it really will be an amazing site. I want to display the fonts for, once again, educational and inspirational purposes, and sIFR would make it that much more useful. The other option would be just gifs or pngs, but I would hate to be tied to a specific size. I realize some foundries may have problems with sIFR, Emigre is probably one off the top of my head, but if the font software isn’t being redistributed or sold, would this be in violation?\n\nI have a deep love for type and would never want to harm designers or their interests (which is why I’m trying to make sure I’m going about this the right way).\n\n"
    },
    {
      "time": " 13.Jun.2006 8.37am",
      "content": "While the concept is interesting it will never work as most foundries have some sort of embedding clause that would disallow this kind of activity. Besides this, most reseller and/or foundries are already coming up with better solutions for font testing which in turn most people can use to study a typeface.\n\n"
    },
    {
      "time": " 13.Jun.2006 9.54am",
      "content": "Itchyo, you seem to have a plan for what your site will do, but absolutely no reason for doing it. You talk about “educational and inspirational purposes”, but that means less than nothing.\n\n"
    },
    {
      "time": " 13.Jun.2006 10.58am",
      "content": "“While the concept is interesting it will never work as most foundries have some sort of embedding clause that would disallow this kind of activity.”\n\nSome do, and some do not. I suppose another option would be writing to foundries and showing them what I intend to do to try and obtain permission.\n\n“Besides this, most reseller and/or foundries are already coming up with better solutions for font testing which in turn most people can use to study a typeface.”\n\nAre you referring to type-testing tools on foundry sites, or something else?\n\n“Itchyo, you seem to have a plan for what your site will do, but absolutely no reason for doing it. You talk about “educational and inspirational purposes”, but that means less than nothing.”\n\nNot having a reason and not telling you the reason are two different things. I’m being vague about the purpose for fear of someone stealing the idea. Rest assured, the site has a purpose, and a good one.\n\n"
    },
    {
      "time": " 13.Jun.2006 11.00am",
      "content": "\\> Rest assured, the site has a purpose, and a good one.\n\nTypophile Jr. ? :)\n\n"
    },
    {
      "time": " 13.Jun.2006 11.10am",
      "content": "Since you’re soliciting opinions from industry professionals, it seems a little underhanded to be so secretive about the site’s purpose.\n\n"
    },
    {
      "time": " 13.Jun.2006 11.16am",
      "content": "“Typophile Jr.?”\n\nNo, but will appeal to the same people :D\n\n“Since you’re soliciting opinions from industry professionals, it seems a little underhanded to be so secretive about the site’s purpose.”\n\nI wouldn’t say it’s underhanded. I’m not cheating any of you, nor am I forcing anyone to give an opinion. If you don’t want to, that’s fine. I am only trying to figure out what to do here. Unfortunately, I can’t reveal precisely what it is just yet. Trust me, I would love to tell all right now, but I have to wait. I’ve been working very hard with other to make this happen, and I would hate for everyone’s work to be lost. But this is getting away from the point.\n\nIt’s basically a question of better interactivity or not. And what the expense of that better interactivity is. If it infringes on copyrights, then it will probably have to go.\n\n"
    },
    {
      "time": " 13.Jun.2006 11.19am",
      "content": "If you have a question on copyrights, then you should be talking to a lawyer. You get a bunch of designers to say that it is not a copyright infringement, post your site, and find out that it is, and you might wind up in legal hot water.\n\n"
    },
    {
      "time": " 13.Jun.2006 11.58am",
      "content": "“If you have a question on copyrights, then you should be talking to a lawyer. You get a bunch of designers to say that it is not a copyright infringement, post your site, and find out that it is, and you might wind up in legal hot water.”\n\nYup, that seems like the best way to go. I imagine I will have to scale back to just using static images anyway. At least at first.\n\n"
    },
    {
      "time": " 13.Jun.2006 12.00pm",
      "content": "I hope you will let us know when the site is up.\n\n"
    },
    {
      "time": " 13.Jun.2006 12.29pm",
      "content": "“I hope you will let us know when the site is up.”\n\nI definitely will! It will be of great interest to type lovers everywhere.\n\n"
    },
    {
      "time": " 13.Jun.2006 4.57pm",
      "content": "icthyo - I have an idea, it will change a LOT of people’s lives in an inspirational and educational way. What do YOU think of the idea?\n\nI’m sorry I can’t tell you more at this time.\n\nSeems pretty vague doesn’t it?\n\nFrom what I can gather, you’re wanting to display fonts and typefaces for inspiration and education ... hmmmm most font foundaries already show these fonts, as do sites like whatthefont, identifont, fontshop and others. What’s your point of difference?\n\n:)\n\n"
    },
    {
      "time": " 13.Jun.2006 5.49pm",
      "content": "“What’s your point of difference?”\n\nJust because you ask the question differently, doesn’t mean I’m going to answer it :)\n\nYes, it is vague, and I said as much. I only wanted to give a small frame of reference for context of the question, that being: educational and inspirational (and not commercial). It’s just the setup for the question.\n\nSorry, but that’s all it will be at this time. You can yell at me after you see it :)\n\n"
    },
    {
      "time": " 13.Jun.2006 7.41pm",
      "content": "When are you expecting to have something more concrete?\n\n"
    },
    {
      "time": " 14.Jun.2006 4.45am",
      "content": "The project is already well underway. I am optimistic for a launch in late summer.\n\n"
    },
    {
      "time": " 14.Jun.2006 5.05pm",
      "content": " **coy...**\n\n- affectedly modest or shy especially in a playful or **provocative** way;\n- showing marked and often playful or **irritating** evasiveness or reluctance to make a definite or committing statement; “a politician coy about his intentions”;\n- modestly or warily rejecting approaches or overtures; “like a wild young colt, very inquisitive but very coy and not to be easily cajoled.”\n\nFWIW, I have recently updated my EULA to allow modification of my fonts if the modifications are strictly for personal/internal use, and to allow the creation of sIRFs, under the same circumstances. However, the EULA doesn’t cover coy uses...\n\n"
    },
    {
      "time": " 15.Jun.2006 3.35pm",
      "content": "I’ll just note that it’s my non-lawyerly understanding there are two separate things:\n\n1) is the proposed use permitted under the EULA (end useer licence agreement)  \n2) is the proposed use an infringement of copyright\n\nThere are many things that might not be allowed under some particular EULA without being copyright infringement. Contrariwise, there are uses that would be infringement of copyright if they were not specifically permitted under the EULA.\n\nAll of which might just be a long way to say, go talk to a lawyer. You can get a straw poll here of what industry folks think, but that is no-where near as valuable as a well informed legal opinion.\n\n(Note: One lawyer who I often hear people speak highly of in the area of font IP is Frank Martinez.)\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 16.Jun.2006 3.06pm",
      "content": "If foundries benefit from your website (i.e. by being “sent” potential customers) they will certainly allow you to use their fonts in the way you want.  \nIf your site really kicks off they would not want to be the only ones not represented on your amazing, polpular site.  \nLook at identifont - do you think they have bought all these fonts?\n\n"
    },
    {
      "time": " 16.Jun.2006 3.19pm",
      "content": " **Tim Ahrens:** Exactly what I am hoping. I wish that we could start out with the fonts that way, but we’ll work with what we’ve got :D\n\n(and thanks to the others for the helpful advice and lawyer name!)\n\n"
    }
  ]
}
