{
  "id": "20632",
  "title": "Dissect The George Washington University's Sports Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "The sports logo attached is pretty tacky looking. I agree that a sports logo should be playful, but the typeface makes this one look like GW is a kiddy team. Goes poorly with the academic logo, which is quite crisp and elegant. What are everyone else’s opinions?\n\n| Attachment | Size |\n| --- | --- |\n| [gwlogo7en.jpg](http://web.archive.org/web/20060709232550/http:/typophile.com/files/gwlogo7en.jpg) | 52.45 KB |\n| [gwusports.jpg](http://web.archive.org/web/20060709232550/http:/typophile.com/files/gwusports.jpg) | 50.57 KB |\n\n",
  "author": "<a href=\"user/12664\" title=\"View user profile.\">TheYellowDart</a>",
  "time": "<br>",
  "uid": "12664",
  "comments": [
    {
      "time": " 12 June, 2006 - 6:19pm",
      "content": "Agree 100%!!!!!!!!!!!!!!\n\n"
    },
    {
      "time": " 12 June, 2006 - 7:11pm",
      "content": "Arrrghhh tis true, thee logo be crap.\n\n"
    },
    {
      "time": " 13 June, 2006 - 1:05am",
      "content": "Wow that looks bad….\n\na bit off topic: In the French & Indian war Washington was 2nd in command behind the British General but Washington was in the thick of battle. In fact by the end his horse was shot his hat was shot off and his coat had 3 bullet holes in it!\n\nTo relate, the new logo does not, by any means, signify a person who had that much dedication and bravery.\n\n"
    },
    {
      "time": " 13 June, 2006 - 4:32am",
      "content": "I think the GW for the sports logo was a deliberate separation from the Universty. The GW will appear on uniforms and hopefully on TV, so It has to be simple visible. I’m not in love with the capital dome in the background but I understand what they were trying to achieve. Just think about it, how closely do you want a sports team to be associated with the learning center. Pick up the paper almost any day and you will scandles involving sports.\n\n"
    },
    {
      "time": " 13 June, 2006 - 7:25am",
      "content": "Got to say that the academic logo is no great shakes either, some very poor kerning and of limited versatility.  \nTim\n\n"
    },
    {
      "time": " 13 June, 2006 - 8:14am",
      "content": "This is a poor attempt. I can see what they were trying to do stylistically, but they didn’t pull it off. Combining the vector art with the photo of the capitol was a really bad call. They should have called Joe Bosack.\n\n"
    }
  ]
}
