{
  "id": "20671",
  "title": "Who knows a good prepress forum?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Howdy,\n\nHas anyone been involved much with a prepress/printing forum?  \nThere are so many out there, but its hard to come across a group of people as friendly and helpful as typophile members. So im curious about where you all might turn if you have a prepress topic to discuss?\n\nCheers. JonnySchneider\n\n [‹ Bleeding Edge Printing Techniques](http://web.archive.org/web/20080328093603/http:/www.typophile.com/node/21154 \"Go to previous forum topic\") [Nevermind the football who has the best type? ›](http://web.archive.org/web/20080328093603/http:/www.typophile.com/node/20984 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080328093603/http://www.typophile.com/user/11331\" title=\"View user profile.\">JonnySchneider</a>",
  "time": "<br>",
  "uid": "11331",
  "comments": [
    {
      "time": " 14.Jun.2006 7.59am",
      "content": "Adobe has a print design forum which has some good stuff, and [http://www.desktoppublishingforum.com](http://web.archive.org/web/20080328093603/http:/www.desktoppublishingforum.com/ \"http://www.desktoppublishingforum.com\") has a section that deals with printing. But the best I have used (don’t go there any more) was comp.prepress on Usenet.\n\n"
    },
    {
      "time": " 14.Jun.2006 8.23am",
      "content": "[http://www.prepressforums.com/](http://web.archive.org/web/20080328093603/http:/www.prepressforums.com/ \"http://www.prepressforums.com/\")\n\n"
    },
    {
      "time": " 14.Jun.2006 10.02am",
      "content": "Don and I frequent the Design Discussions-Print Design forum over on Adobe and there are some really knowledgable people there, of which Don is one.\n\nI really don’t frequent pure prepress forums but I have run into some really sharp prepress folks here and there.\n\nThere’s a couple of sharpies on the Layers magazine forum, learned a lot there.\n\nbest of luck!\n\npeace\n\n"
    },
    {
      "time": " 15.Jun.2006 5.43pm",
      "content": "Thanks all... Just what i was looking for.\n\n"
    },
    {
      "time": " 6.Jul.2006 9.56am",
      "content": "The best graphic design forum or prepress forums that I have used and frequented is at Software-Robotics.Com, they make prepress Xtensions and Plug-Ins and have a really industrial strength support forum. Their products are all heavily supported, that’s how I found the prepress forum there, I use their automatic PDF workflow called PDF-X-Robot.\n\nYou don’t have to be a customer, even the software support folks help non-customers there for unrelated prepress issues. There’s about 1200 users on that prepress forum from around the world, designers, publishers, prepress and printers. I’ve learned allot on there and find it more direct and less cluttered than most communities & prepress forums mentioned above.\n\n[Graphi Design & PrePress Forums](http://web.archive.org/web/20080328093603/http:/software-robotics.com/graphic-design-prepress/ \"graphic design school forums prepressforums.com computer to plate forums\")\n\nI’m a prepress manager in agraphic design company, we provide graphic design services and i teach a few prepress classes in a graphic design school from time to time.\n\n"
    },
    {
      "time": " 9.Jul.2006 4.32pm",
      "content": "Thanks for the tip. -JS\n\n"
    }
  ]
}
