{
  "id": "20676",
  "title": "Type Anecdotes",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello all,\n\nI’m busy collecting anecdotes in relation to type or to a specific letter. I know there must be loads, but they are hardly listed in any Typography book. Does anyone know any funny, interesting, exciting stories? It could also be a surprising type-historical fact.\n\nI love this one for example:  \n [www.worldnetdaily.com/news/article.asp?ARTICLE\\_ID=21501](http://web.archive.org/web/20071009174630/http:/www.worldnetdaily.com/news/article.asp?ARTICLE_ID=21501 \"www.worldnetdaily.com/news/article.asp?ARTICLE\\_ID=21501\")  \nThis story is about a Sabotage act in the White House which apparently happened shortly before George W Bush and his staff moved in. Apparently the former staff made a practical joke and removed as many “W” keys from all the keyboards in the White house as they could.\n\nThanks sharing any more stories!\n\nFox\n\n [‹ The global market](http://web.archive.org/web/20071009174630/http:/typophile.com/node/29086 \"Go to previous forum topic\") [Erik's UK tour ›](http://web.archive.org/web/20071009174630/http:/typophile.com/node/29065 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071009174630/http://typophile.com/user/10154\" title=\"View user profile.\">Brown Fox</a>",
  "time": "<br>",
  "uid": "10154",
  "comments": [
    {
      "time": " 14.Jun.2006 11.02am",
      "content": "One of the most famous incidents and misquoted-quotes involved Frederic Goudy in 1936 at an award ceremony in his honor. The result after viewing the award certificate he uttered —  \n_“Anyone who would letterspace **blackletter** (“lowecase” is substituted nowadays) would **shag** (“steal” is more commonly quoted) sheep.”_\n\n"
    },
    {
      "time": " 14.Jun.2006 11.25am",
      "content": "Mark Simonson created one of the most popular handwriting fonts ever made: [Felt Tip Roman](http://web.archive.org/web/20071009174630/http:/www.ms-studio.com/FontSales/felttiproman.html). It’s a close digitization of his own writing.\n\nHe told me once he knew he had arrived as a type designer when he received one of those direct mail pieces in which they try to fake real handwriting to make it seem more personal. They used Felt Tip Roman. It was like getting a postcard from himself.\n\n"
    },
    {
      "time": " 14.Jun.2006 11.33am",
      "content": "Ed Benguiat told me this years ago (and he has so many stories it’s hard to confirm the “truth” of it or not... but I believe him ;-P )\n\nMany, many years ago, Ed had worked on some logo designs for El Al, based on a stylized manora. El Al decided not to use the designs, so Ed shelved them. (Actually, he put them into his famous “drawer” of ideas and sketches.)\n\nA few years later, United Airlines was looking to update their logo. Ed pulled out the El Al manora, deleted a few of the candelabra arms, and came up with the logo below —\n\n ![](http://web.archive.org/web/20071009174630im_/http:/typophile.com/files/UAL-logo2_5394.gif)\n\n"
    },
    {
      "time": " 14.Jun.2006 1.20pm",
      "content": "You believe Benguiat? Okay (well, Ivan Chermayeff used to do the same thing). And I think you’ve all already heard the Chase logo story—I posted it some years back.\n\nOkay, I’ve got two I love (sorry so long):\n\n1. In the pre-desktop days, I used to give Photolettering a lot of business and Sid Haber would take me to lunch sometimes. One time, he told me that he started as a young man as a linotyper, and one night, he had a blind date. It was love at first sight! He knew he was going to marry this girl. He said he was so excited, that he had to set some type. So he took her up to the shop and and set “I love you,” and put it in her hand. And it burned her! And they got married and she still had the scar on her hand.\n\n2. Right out of school, I had the great privilege of interviewing with Herb Lubalin to be his assistant on U&lc. Well, it turned out that I interviewed him. I spent all day with him and he showed me and reminisced about all his favorite work. When we got to the PBS logo (the “P” as a head), he was infurated . . . he said that PBS used it for a while, everything was fine and then they decided it wasn’t good that the face was facing LEFT. So they gave it to Chermayeff & Geismar to rework and Lubalin said they just basically stole his logo and just turned it around.\n\nWell, 20 years later, I’m at Chermayeff & Geismar and told Tom Geismar the story and Tom loved it and said Herb was crazy and PBS approached him to rework the logo to show they were a corporation of many public stations—not just one. And it worked better facing right.\n\nI believe them both. (p.s. I got the job! But Lubalin died a week later ;( )\n\n"
    },
    {
      "time": " 14.Jun.2006 1.39pm",
      "content": "Um, according to [this](http://web.archive.org/web/20071009174630/http:/en.wikipedia.org/wiki/Saul_Bass#Logos_designed_by_Saul_Bass) Saul Bass designed United Airlines’ great logo in 1974. I’ve also heard this from a designer who is a great admirer of Saul Bass, so I believe it.\n\nThe menorah stuff sounds like Ed Benguiat was pulling your leg, Norbert.\n\n"
    },
    {
      "time": " 14.Jun.2006 1.41pm",
      "content": "Great stories, Michele! (And I believe you too!)\n\nI think I’ll reserve the better, funnier stories for a bar-night at TypeCon. I can’t see this particular thread (or even an open forum) for sharing some of the best tales.\n\nBesides, how will we convince others to pay for another round?  \n=-)\n\n"
    },
    {
      "time": " 14.Jun.2006 1.48pm",
      "content": "Yes, William...  \nEd pulled alot of legs (and will continue to... that’s why I said it was an “Ed story”)... be he also used to work behind the scenes on many famous art directors, so there’s always the “official” story and the real “dirt” on how things happened.\n\nWe can share our own “eye-witnessed” tales over brewskis? No?\n\n"
    },
    {
      "time": " 14.Jun.2006 4.38pm",
      "content": "By the way, googling the El Al logo got this [interesting story](http://web.archive.org/web/20071009174630/http:/64.233.161.104/search?q=cache:hjwSDYUrP1cJ:www.haaretz.com/hasen/spages/710398.html+el+al+logo+designed+by&hl=en&gl=us&ct=clnk&cd=1&client=firefox-a). The El Al logo is really remarkable how perfectly it integrates the Hebrew and Roman characters, which follow such different rules that they usually don’t sit very well together visually.\n\n"
    },
    {
      "time": " 14.Jun.2006 5.01pm",
      "content": "Hmmmm...  \nEl Al logo designed in 1971.  \nUnited Airlines logo designed in 1974.\n\nAt least the timing works out for Benguiat’s “fish” story.\n\nAnd now for something completely different...  \nI have a pic of Otl Aicher “mooning”, sort of an “asscender”... ;-)\n\n"
    },
    {
      "time": " 14.Jun.2006 6.04pm",
      "content": "There’s this story about Alexandre Wollner visiting Herb Lubalin in New York. He says:” H.Lubalin had this three-floor office in N.Y. The main room was as big as Alexandre Wollner’s house with tables covered with sweets and chocolates. Wollner asked him what the room was for and how he managed all the luxury when he (Wollner) back in Sao Paulo couln’t even dream of having such an adequate room. He replied:” I’m going to tell you a secret: on the first floor there’s a room full of people working, but they only do retail down there, which I don’t show to anyone and which doesn’t appear in any book. We make a lot of money there. On the 2nd floor we produce pubblications of a slightly higher level:some adverts, but mostly magazine page spreads, medical pamphletes, and these make reasonable money. I don’t publish this stuff anywhere either. Then there’s is this room here where I do the things you see; the Avant garde alphabet, Eros magazine etc. These don’t bring in a dime, they just cost money. It’s the 1st floor that sustains the other 2. I don’t know if this is the sort of anecdotes you are looking for but I’ve found it cool because now, when I visit some super high profile studio (not that I do this a lot...) I always think about the secret floors.  \nThe story is from Alexandre Wollner published by CosacNaify in Brazil (a project by Andre Stolarski)\n\n"
    },
    {
      "time": " 14.Jun.2006 11.59pm",
      "content": "My first agency job was in an agency arranged just like Lubalin’s. Top floor was for the management and grand meeting rooms, middle floor for higher grade designers with less luxury, ADs etc and the bottom floor (where I was, a trainee) had the production department (newspaper ads for department stores and shoe shops etc) with all the left over furniture. One morning I went to the office to find my chair missing. I never found it, someone higher up must have needed it.\n\n"
    },
    {
      "time": " 15.Jun.2006 9.40am",
      "content": "Hey thanks for all the info’s so far. It’s interesting to hear how agencies abroad work. (I’m based in Amsterdam.) However I was wondering if anyone has a any more anecdotes connected to a specific letter, like the missing “W” story i posted in the beginning? Another interesting thing which came to mind is:  \nLooking at the letterfrequency of the English language, the most used character is not “E” as it’s mostly believed (11.2%) but the actual “Space” character (13.2%). Source: Oxford Dictionairy 9th edition  \nStuff like that!\n\n"
    },
    {
      "time": " 26.Oct.2006 10.18am",
      "content": "Enjoying these anecdotes, and thought to add one in keeping with the general tone of the responses.\n\nRecently I finished reading a very well written book, “Book Typography” by Ari Rafaeli. There are many historical examples of types attributed to the wrong original designer. Much of the drama of early type is determining who did what. My favorite from the book is the story of Monotype Ehrhardt. Seems the original designer, a Nicholas Kis from the Holland, left town and ended up in Poland (c1680). He tried to sell his matrices to Edling Type Foundry. Edling thought Kis’ work amaturish and declined to purchase the matrices. Kis left the matrices with Edling while he scoured the area for a buyer.\n\nUnfortunately for Kis, he was arrested by the king. He was later released on the condition he promise to never bring invading armies into Poland again. Seems the King blamed Kis for his recent political troubles.\n\nKis left town and abandoned the matrices. They stayed with the Edling Foundry, passed on as companies were sold and acquired. Ultimately the matrices ended up with Stempel who issued a version from the original. The kicker for Kis is they attributed the design to Janson (Edling’s mentor/master) who was not there when Kis first arrived at Edling’s Foundry.\n\nCheers!  \nLTL,  \nXtian\n\n"
    },
    {
      "time": " 26.Oct.2006 10.26am",
      "content": "\\>Looking at the letterfrequency of the English language, the most used character is not “E” as it’s mostly believed (11.2%) but the actual “Space” character (13.2%).\n\nThat sounds fishy - since when did the space become a letter? It’s hardly even a character. This is exactly the same as saying the hole is the least filling part of a doughnut.\n\nBut in the spirit of this discovery I nominate ’2pt leading’ as the most used ’letter’ in the English language, so many books include this invisible letter above, or below, each character printed in the book.\n\n"
    }
  ]
}
