{
  "id": "20675",
  "title": "Looking for OTF Grotesques with SC/OsF",
  "forum": "Design",
  "tags": [

  ],
  "content": "I have been looking for a sufficiently cold-looking OT grotesque sans in a Swiss vein with all the goodies needed for proper typography, so far without success. There are OpenType versions of Berthold Akzidenz-Grotesk and Linotype Helvetica Neue, but neither of these have small caps or text figures, except the A-G which only has the light weight. I suspect the Helvetica Neue OT is a straight translation from the PS version and has no new typographic features. I emailed Berthold, but they didn't mention anything about producing other weights with small caps and text figures, and instead pointed me towards Imago Pro, which doesn't really do the trick.\n\nDoes anyone know if such a font as I have described exists? I would think that Font Shop would have something like this, but most of their typographic sans are humanist, and the ones that come close look more like Gotham. I seek something with a cold, blank, scientific stare that functions like a Swiss army knife.\n\n",
  "author": "<a href=\"/web/20110812200428/http://typophile.com/user/8916\" title=\"View user profile.\">NiceTry</a>",
  "time": "<br>",
  "uid": "8916",
  "comments": [
    {
      "time": "",
      "content": "[Proxima Nova](http://web.archive.org/web/20110812200428/http:/www.ms-studio.com/FontSales/proximanova.html) isn't a XIX century grotesque but has all the features you need\n\n"
    },
    {
      "time": "",
      "content": "Have a look at Storm's [Zeppelin](http://web.archive.org/web/20110812200428/http:/www.myfonts.com/fonts/storm/zeppelin/) too.\n\n"
    },
    {
      "time": "",
      "content": "[URW Corporate S](http://web.archive.org/web/20110812200428/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Corporate%20S)\n\n"
    },
    {
      "time": "",
      "content": "You could take a look of my Tang family at [www.type.fi](http://web.archive.org/web/20110812200428/http:/www.type.fi/ \"www.type.fi\"). It's not as neutral as Helvetica et. al., but it does have Roman, Italic and SC in 7 weights...\n\n"
    },
    {
      "time": "",
      "content": "Tomi, Love that black a.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Hmm. Everything looks too friendly. Hopefully someone will make a multi-weight A-G or Helvetica with SC/OsF. Keep your fingers crossed. Thanks everyone for your help. If you see something, please give me a shout.\n\n"
    },
    {
      "time": "",
      "content": "Corporate S is too friendly?\n\n"
    },
    {
      "time": "",
      "content": "Corporate S is as friendly as sandpaper in place of toilet paper. :^P\n\n"
    },
    {
      "time": "",
      "content": "It's the numbers, they don't appear to match the letters. They seem a bit calligraphic.\n\n"
    },
    {
      "time": "",
      "content": "Okay, I guess it doesn't exist. I will have to make my own, I suppose.  \nThanks for the help, wish me luck.\n\n"
    },
    {
      "time": "",
      "content": "God speed! And I hope it's something you find fit to publicly release one day. As you can see, the more choice the better.\n\n"
    },
    {
      "time": "",
      "content": "A D V E R T I S E M E N T\n\nGalaxie Polaris by chester & Tracy Jenkins, available exclusively from Village:  \n [http://vllg.com/Village/GalaxiePolaris/mudTyper+Weights/](http://web.archive.org/web/20110812200428/http:/vllg.com/Village/GalaxiePolaris/mudTyper+Weights/)\n\nSmall caps are in process; a Beta version of the Book weight with small caps in place is available to licensees upon request.\n\n"
    },
    {
      "time": "",
      "content": "Rawk.\n\n"
    },
    {
      "time": "",
      "content": "Village:  \nThat would be exactly what I need.  \nDo you have an estimated release date for the version with small caps?\n\n"
    }
  ]
}
