{
  "id": "20693",
  "title": "logo to myself",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I hope that you can help me with this logo, i buid it for myself, this is a calligraphic logo, i started with the sketch just a few days ago. The forms are based in the initials of my name (jaime ayala) write in calligraphy. I do it in a calligraphic way cuz i want to do classical look, to a young designer. regards. Jaime Ayala. p.d.: sorry about the lazy english, any comment in spanish will be wellcome.\n\n| Attachment | Size |\n| --- | --- |\n| [logo\\_typo.jpg](http://web.archive.org/web/20060630195306/http:/typophile.com/files/logo_typo.jpg) | 46.35 KB |\n| [typo1.jpg](http://web.archive.org/web/20060630195306/http:/typophile.com/files/typo1.jpg) | 22.17 KB |\n| [logo\\_print.jpg](http://web.archive.org/web/20060630195306/http:/typophile.com/files/logo_print.jpg) | 116.21 KB |\n\n",
  "author": "<a href=\"user/7401\" title=\"View user profile.\">Jaime Ayala</a>",
  "time": "<br>",
  "uid": "7401",
  "comments": [
    {
      "time": " 15 June, 2006 - 9:40am",
      "content": "There is something very lovely about this. Refreshing. After so many people going sans and cold, this is exotic and warm. The exit stroke of the tail seems a tiny bit flat on the left side, but at smaller sizes this will most likely disappear. You might need to have an accompying logotype, but I would guard against using them right next to each other as whatever you do this logo should be allowed to stay organic. I really like it.\n\nThere is something Arabic or maybe even Armenian, about it.\n\n"
    },
    {
      "time": " 15 June, 2006 - 10:25am",
      "content": "Very arabic, I cant understand the meaning behind the calligraphic part about it, if your audience is predomoniately english speaking it can be solved with a descriptor I suppose. I think its a very interesting mark, personally I like marks which are simpler and therefore easier to remember. And this does that justice… But I worry yours might not be unique enough to be remembered and just come off as looking arabic? I am trying not to sound like I have a I bias but I am being honest at the same time…\n\n\\* NOTE edited after an update was made.. I just saw that you updated the images with some text included with your mark. I think it works.\n\n"
    },
    {
      "time": " 15 June, 2006 - 10:47am",
      "content": " ![](http://web.archive.org/files/brand_typo_6616.jpg)\n thanks for both comments:\n\n**miss tiffany** : a friend told me about a font named [fontin](http://web.archive.org/web/20060630195306/http:/typophile.com/node/4372 \"fontin Type\"), he said me that maybe was perfect for my logo, in fact a attach some files to view the brand. Actually i test in a laser print to test the problem with the light stroke.\n\n**Iggyboo** : well i tried to do a mark unique, the arabic part was not on porpouse, but i like it that way, i like the hebrew and arabic calligraphy, and probably that reflect in the mark. I’m just tried to do some informal stroke, some light and classical at the same time, the ethnical look it’s a plus for me, probably because i live in Chile.\n\n"
    },
    {
      "time": " 15 June, 2006 - 10:54am",
      "content": "Well \\>\\> I like the mark, not a fan of the heavyness of the use of your name. but well done Jaime let me know when you get a site up, i’d love to check out your work.\n\nJoseph\n\n"
    },
    {
      "time": " 15 June, 2006 - 11:05am",
      "content": "The size of the logotype is over-powering the mark. I’m not sure I would stack it either. The idea would be to use the logotype in conjunction with it, but not necessarily right next to it. Fontin works, I think. I nice compromise for a sans, as I’m not sure a serif would be necessarily appropriate (or the perfect match attainable) for your mark.\n\n"
    },
    {
      "time": " 15 June, 2006 - 11:46am",
      "content": "looks cool, but i don’t see the a? Is it upside down?\n\n"
    }
  ]
}
