{
  "id": "20698",
  "title": "Bah Arial :\\",
  "forum": "Design",
  "tags": [

  ],
  "content": "Why is arial still so highly used over helvetica?  \nTake for instance my sister's highschool year book. Her instructor used arial for cutlines. Why would someone teaching design to highschool students use arial when they have pretty much any other choice? and especially over helvetica?\n\nI get that microsoft used arial in windows so it's widespread, that it is cheaper and that most people won't know the difference. But a design instructor? Also why do most people specify arial as the default font for websites over helvetica. Or even put arial before fonts like maybe verdana or trebuchet?\n\n",
  "author": "<a href=\"/web/20101203090024/http://www.typophile.com/user/13221\" title=\"View user profile.\">j_polo9</a>",
  "time": "<br>",
  "uid": "13221",
  "comments": [
    {
      "time": "",
      "content": "Arial is the only decent pre-installed sans serif typeface that is close enough to Helvetica. As for the design teacher he must be a moron.\n\n"
    },
    {
      "time": "",
      "content": "I am sure your sister's high school instructor has no background in typography. He probably teaches English or something and just was volunteered to try to help the kids with the yearbook. He used Arial, most likely, because it was there free, it was loaded at the top of the list, it was the default font or some equally benign decision route.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Is it:  \nA) Never right to ever use arial being that it is a copy and pretends not to be so we should shun it out of pure spite?  \nB) o.k. to use arial because on screen it really doesn't matter and looks close enough to helvetica in weight and proportions.  \nC) Better to use another font that will look better onscreen such as verdana, georgia, etc.?\n\nAs per the yearbook, I think it is funny that the teacher listed all these design aspects of the book on like the third page and the whole book looks horrid. For fonts its listed as:  \nHeadlines: 60 pt Times new roman, AYT Cameron, AYT Christina Print, AYT JAckson, AYT sleepwalker  \nSubheadlines: 30pt Times New Roman, Italic  \nCopy: 10pt Times New Roman  \nCutlines: 8pt Arial\n\nlol. I don't understand why they had to use times new roman either, sure it's good for news print but there are plenty of other options that would have been more interesting. Bah.\n\n"
    },
    {
      "time": "",
      "content": "My boss thought that the default font was always as good as any other. (After all, who was he to question the personal choice of someone as successful as Bill Gates, I guess?)\n\nHis other pecadillo was Algerian was the only display font he ever used. All the notices in the office were posted in Algerian. Like \"YOUR MOTHER DOESN'T WORK HERE, SO CLEAN UP AFTER YOURSELF\" in the lunchroom. To this day I hate Algerian. Even if Michael Hagemann did make a nice lowercase for it.\n\n"
    },
    {
      "time": "",
      "content": "There was a famous designer who said he could use only two type faces to do his advertising and he did the famous original VW ads in the 60s. You don't need great type designs more than great concepts to express your ideas. Good type design doesn't excuse bad conceptual thinking. The idea and not the design is the most important thing.\n\n"
    },
    {
      "time": "",
      "content": "what about for cutlines for a year book? Or website copy? Can't get too creative with cutlines or website copy unfortunately. So my above questions remain.\n\n"
    },
    {
      "time": "",
      "content": "I make a point of never using Arial since Helvetica is the real thing. Altho I don't use Helvetica much either. Prefer Akzidenz Grotesk, Franklin Gothic, Univers, etc.\n\n"
    },
    {
      "time": "",
      "content": "In a moment of anger [edit: it was anger so much as hurt that they didn't like the typeface I thought suited the project.] I once used Arial after a client told me that the typeface I had selected was ugly and they preferred that I use Helvetica. Childish, I realize this, but hey they never knew the difference. :^P\n\n"
    },
    {
      "time": "",
      "content": "Sweeeeet revenge. the only time for Arial.\n\n"
    },
    {
      "time": "",
      "content": "It's possible that they wanted a font that was legible enough to allow on-screen proofing, so Arial with it's advanced hinting would have been a good choice (especially if they were using antiquated software and OS to do the layout). Alternately they just picked something from the top of the list.\n\n"
    },
    {
      "time": "",
      "content": "_why do most people specify arial as the default font for websites over helvetica. Or even put arial before fonts like maybe verdana or trebuchet?_\n\nLike it or not, most browser out there use Windows and Internet Explorer, which means they have Arial installed on their systems; Macs, on the other hand, come with Helvetica pre-installed. Since Arial and Helvetica are reasonably equivalent in their gross metrics, web designers can be reasonably confident that the pages they design will be rendered in more or less the same way, regardless of browser or platform, following the hierarchy of arial-helvetica-sans serif. If Arial is available, the browser uses Arial; if not, it uses Helvetica; if neither is available, it uses a generic sans.\n\nI agree that almost all browsers render Verdana and Georgia better than Arial (they were designed to, and succeed admirably) but, until Verdana and Georgia ship with every computer OS and browser, its use can create problems for web designers because their gross metrics are very different from their Mac equivalents.\n\n"
    },
    {
      "time": "",
      "content": "I thought Arial was originally conceived as a computer screen font (at least that's what I was taught many, many moons ago). Was it not originally a cheap substitute for Helvetica?\n\nJesse, I found a great article by Mark Simonson on [Arial](http://web.archive.org/web/20101203090024/http:/www.ms-studio.com/articles.html), where it comes from and why it is a shameless impostor. You could always direct your sister's instructor over there just to better his understanding of what he is using. Consider it your \"good deed\" for the day. : )\n\n"
    },
    {
      "time": "",
      "content": "@oldnick: ahh that is true and a good reason to use it, even if it a shameless imposter.\n\n@andi emery: Thats funny, I read that same article right before i posted this thread to touch up on my arial/helvetica knowledge! Their yearbook team is having some week camp over the summer so i might have to stop by and have a chat with the teacher!\n\n"
    },
    {
      "time": "",
      "content": "Arial + Times New Roman = amateur desktop publishing\n\nHey, at least he didn't use default 12 pt type for body copy.\n\n"
    },
    {
      "time": "",
      "content": "I hate Algerian too, and the signs in the washroom here are in Arial.\n\n"
    },
    {
      "time": "",
      "content": "\\> Arial + Times New Roman = amateur desktop publishing\n\n...if only this were true. Amateur design would be much better if the amateurs were to stick with these two fonts - it tends to be that when they move to less forgiving typefaces that things start to get really ugly.\n\nNo one ever got fired for using Times.\n\n"
    },
    {
      "time": "",
      "content": "Arial doesn't look too bad for signs when cut out of shades of pastel sheets and slightly raised for shadows --\n\n ![](http://web.archive.org/web/20101203090024im_/http:/typophile.com/files/NotAverageArial_5186.png)\n\nHAH! Sorry... couldn't resist showing this again ;-)\n\n"
    },
    {
      "time": "",
      "content": "_HAH! Sorry… couldn’t resist showing this again_\n\nGlad you did. Quite pleasant.  \n; )\n\n"
    },
    {
      "time": "",
      "content": "Norbert, unless you used Corel Draw you were cheating.\n\n"
    },
    {
      "time": "",
      "content": "Guilty as charged.  \nPlain ol' Arial Black using Photoshop :-\\\n\n"
    },
    {
      "time": "",
      "content": "I like the colours, Norbert... : )\n\n"
    },
    {
      "time": "",
      "content": "Nick-- FYI, Macs have had both Arial and Helvetica included for quite a while, which I think goes back to when Apple was bundling Internet Explorer. Even before that, Mac users who installed just about any Microsoft app had it. Helvetica started to be included when the LaserWriter was introduced in 1985 since it was one of the core PostScript fonts.\n\n[http://docs.info.apple.com/article.html?artnum=301332](http://web.archive.org/web/20101203090024/http:/docs.info.apple.com/article.html?artnum=301332 \"http://docs.info.apple.com/article.html?artnum=301332\")\n\n"
    },
    {
      "time": "",
      "content": "Pastel colors are going to be the thing after the process inks stuff.\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "NO!!!!!!!!!\n\n"
    },
    {
      "time": "",
      "content": "I've never liked Arial because it seems Frankensteined together. It recycles the metrics of Helvetica while grabbing style cues from Univers, Akzidens Grotesk and a number of others.\n\nMy dislike for Arial intensified over seeing how it has been used in sign design. Many of these vinyl cutting shops have people who simply grab one of the first fonts they see in the menu: Arial. Their CorelDRAW font disc has lots of naturally condensed and compressed faces. But these folks just squish or stretch Arial Bold and Arial Black to fit any space.\n\nArial is ugly enough it its own natural state. It's stomach-churning when seeing it distorted and plastered on any acrylic sign face next to a street.\n\n"
    },
    {
      "time": "",
      "content": "OldNick, Andi and Mark are right on the money with their replies; if you look at the way DreamWeaver and GoLive specify default font choices, it's hardly suprising to see Arial first in the list when it comes to browser behaviour.\n\nThere was a period about 4 years ago when two versions of Arial (TT and PS1) were simultaneously installed on the Macs at college; I actually forbid anyone using it because the Truetype version would inevitably screw up on the printout - and the students could never tell which version they were using.\n\nNowadays I tell students to avoid using Impact. And Arial. And Helvetica.\n\n"
    },
    {
      "time": "",
      "content": "I've never understood how people can hate one typeface and love another, both being so similar, some kind of mindless popular opinion people repeat without reflection...\n\nArial is a good typeface. Well, it works. Haters.\n\nAnd I choose Helvetica over Arial too.\n\n"
    },
    {
      "time": "",
      "content": "well Arial is easy to hate because it is frankensteined and because of its story behind its creation/ widespread use...\n\nWhat i don't get is why some people love helvetica and some people hate it/ will never use it/ tell their students not to. Is it personal preference, over use, or some other reason?\n\n"
    },
    {
      "time": "",
      "content": "Are you judging its history and use or the typeface itself?\n\n"
    },
    {
      "time": "",
      "content": "\\>What i don’t get is why some people love helvetica and some people hate it/ will never use it/ tell their students not to. Is it personal preference, over use, or some other reason?\n\nI think there are three reasons:\n\n1. Helvetica is a poor text face for print, but is constantly mis-used this way. Its combination of circular rounds and tight spacing make it hard to read, especially if it is used in long measure on letter-sized paper. Screen Helvetica & Arial are really a different animal as hinting quite changes its forms.\n\n2. It can be an effective display face, but it is so over-used that most type-aware people are sick of seeing it. Admittedly some designers, including prominent ones, are still fans, regarding it as a completely 'neutral' face that they can turn to whatever use they want with their designs.\n\n3. Many designers feel there are better alternatives to it as a display face, if you want its general look. These include Univers, which appeared at about the same time, and Akzidenz Grotesque, which is based on the same historical model.\n\nJohn Hudson has said with some justice that Helvetica is like a fish that everyone says they don't like but in fact eat every day.\n\n[Here](http://web.archive.org/web/20101203090024/http:/typophile.com/node/19366) is one of the many, many discussions of Helvetica on typophile.\n\n"
    },
    {
      "time": "",
      "content": "_Arial is a good typeface._\n\nPerhaps. Would it be as widely used as it is if Microsoft hadn't bundled it in Windows, Office, and Internet Explorer? It's never had the chance to make a name for itself in the marketplace the way Helvetica did, so we will never know. Its history is the key to its popularity, whether people know it or not. Whether it's a good typeface or not (sure, it's functional, although many designers don't like it simply on aesthetic grounds) is almost beside the point.\n\n"
    },
    {
      "time": "",
      "content": "Arial and Helvetica are similar in some basic ways; however, there are so many subtle differences just beyond the broad appearance. Anyone who messes around with type will spot those differences eventually. Once seen, those differences are highly noticeable. The fonts become as different as night and day.\n\nThere are certain characters in Arial I find pretty ugly, such as the lowercase \"a\" with its crooked looking aperture. I don't like the angled cut at the top of the stem on the lowercase \"t\". The angled stem on the capital \"R\" seems pretty odd. Typefaces like Vectora, Akzidenz Grotesk, Trade Gothic among others handle those design cues in a more attractive manner.\n\nI'm sick of seeing Helvetica, but agree it is still highly useful in combining with other more flashy type styles. Helvetica Neue Extended has some personality at least.\n\n"
    },
    {
      "time": "",
      "content": "This one made me smile. [Arial vs. Helvetica](http://web.archive.org/web/20101203090024/http:/www.engagestudio.com/helvetica/)\n\n"
    },
    {
      "time": "",
      "content": "oh yeah, great link Seb!\n\n"
    },
    {
      "time": "",
      "content": "Damn, the teacher didn't read my yearbook typography guide :/  \n [http://typophile.com/node/17127](http://web.archive.org/web/20101203090024/http:/typophile.com/node/17127 \"http://typophile.com/node/17127\")\n\n"
    },
    {
      "time": "",
      "content": "Haha. Nice link Seb! Gwosh. My juniors at college just simply got to play that game.\n\n"
    },
    {
      "time": "",
      "content": "lol great link seb! Has anyone read the helvetica book it links to?\n\nWoot Noftus thanks for that! Will definately be sending that one over to their teacher. My sis is going to be chief editor next year so I might have to err... \"help\" her design the whole thing.\n\n"
    },
    {
      "time": "",
      "content": "I've been trying to suggest an alternative to Arial and Times New Roman, in a new book I am writing.\n\nThis list is amazing:  \n [http://www.codestyle.org/css/font-family/sampler-WindowsResults.shtml](http://web.archive.org/web/20101203090024/http:/www.codestyle.org/css/font-family/sampler-WindowsResults.shtml \"http://www.codestyle.org/css/font-family/sampler-WindowsResults.shtml\")\n\nAlso amazing is the fact that I've been sitting here for 30 mins, and cannot honestly recommend a good alternative.\n\nHelp!\n\n"
    },
    {
      "time": "",
      "content": "Nathan, do you mean a web-safe alternative to Arial and TNR? No probs, Verdana and Georgia!\n\n"
    },
    {
      "time": "",
      "content": "Thanks Geoff,\n\nI'm after a 'print-safe' alternative, that is not mainstream, but available on a widespread basis - a nice 'fringe' font.\n\nPersonally, I'm actually still not sold on Georgia for widespread use, probably the numerals. There's also something very wrong with Verdana for print, which I can't put my finger on.\n\n"
    },
    {
      "time": "",
      "content": "Oh, for print, definitely not Verdana or Georgia as they were designed specifically for on-screen reading. The link you provided made me think you needed a web-safe (on-screen) alternative. :^)\n\nBy being avaliable on a \"widespread basis\", do you mean it has to be a system font?\n\n"
    },
    {
      "time": "",
      "content": "What about lucida?\n\n"
    },
    {
      "time": "",
      "content": "OFF TOPIC:\n\nØffice Depøt's new 'Wørklife Rewards' program is ALL in arial. Don't get me started on the typography. In General the typography merits a browse around the store… I recommend extra strength aspirin and or sunglasses. Negative kerning galore, hierarchical anarchy ensues.\n\n"
    }
  ]
}
