{
  "id": "20709",
  "title": "? how to design bold from a regular weight",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I want to make sure I got this right: for a [bold](http://web.archive.org/web/20131016081539/http:/typophile.com/wiki/bold) [weight](http://web.archive.org/web/20131016081539/http:/typophile.com/wiki/weight) you need to 1) mainly increase weight on the insides of the letters and less on the outside 2) bump the x-height a bit.  \nIs that right? or why do i have these guidelines bouncing around in my head?\n\n",
  "author": "paul d hunt",
  "time": "15 Jun 2006 — 6:05pm",
  "uid": "7006",
  "comments": [
    {
      "time": "15 Jun 2006 — 6:45pm",
      "content": "Add a nice big stroke! ;-D\n\nNot to hijack but a girl in my class during a final critique was explaining her typeface choice and told the professor/class that she didn't have the extended 'version' of the font so she just stretched it horizontally....\\*shudder\\* (needless to say she got a D)\n\n"
    },
    {
      "time": "15 Jun 2006 — 6:50pm",
      "content": "I've been adding threads i've found to [Family\\_how-to](http://web.archive.org/web/20131016081539/http:/typophile.com/wiki/Family_how-to) as i go along. If you find one I missed, please add it there (or here).  \nOne problem I keep running into is broken links to old threads. I hope those get fixed somehow someday.\n\n"
    },
    {
      "time": "15 Jun 2006 — 7:23pm",
      "content": "To make a bold ya gotta move either east or west.\n\n"
    },
    {
      "time": "15 Jun 2006 — 7:29pm",
      "content": "thanx james! \\>^D\n\n"
    },
    {
      "time": "15 Jun 2006 — 7:56pm",
      "content": "ooooh nice thread.\n\n:)\n\n"
    },
    {
      "time": "16 Jun 2006 — 8:09am",
      "content": "There was quite a substantial thread on this subject a few years ago. I remember posting a graphic from Frutiger that showed the technique clearly. I can't find the scan anymore, but the whole thread should be in the archive somewhere.\n\nJames\n\n"
    },
    {
      "time": "16 Jun 2006 — 9:50am",
      "content": "James, [here](http://web.archive.org/web/20131016081539/http:/www.typophile.com/node/1753) is your post with the fabulous drawing from Frutiger.\n\nBy the way, I found the thread with the applet (is that the right word?) that Grant Hutchison supplied early in the new version of Typophile. You can do the same thing by limiting your search on Google to the typophile site, which is what the applet does.\n\n"
    }
  ]
}
