{
  "id": "20704",
  "title": "Type Battle Exhibition at TypeCon 2006",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "**Typophile Type Battles to be Exhibited at TypeCon2006 in August  \nDeadline for Submission: July 5, 2006**\n\nAt TypeCon 2006, the TypeGallery will showcase a selection of submissions from the weekly Type Battles that have raged in the Typophile forums this year.&nbsp;\n\nOn behalf of SOTA and Typophile, we'd like to invite you to submit a high-resolution version of your entry (or entries) to be printed and displayed in the TypeGallery this August in Boston. In addition to appearing on Typophile and live in Boston, some pieces may travel internationally after the conference, and/or may be selected for print publication and display on the TypeGallery website.\n\nYou may submit any selection of your entries from one or all of the battles you participated in. We are also interested in showing extensions of what was displayed in the Type Battles on Typophile. If you have continued working on your entries, please show us what you've done! Due to space constraints, this is a juried showcase, and we will use our discretion as to which pieces will be chosen for the exhibit.\n\n- Each piece will be printed on a tabloid (11in x 17in, 280mm x 432mm) sheet, black ink. Please scale appropriately. Pieces can be in landscape or portrait mode.\n\n- Please submit a **hi-res, scaled version in either EPS, TIFF or PDF** formats. Native Illustrator documents will also be accepted, though not preferred.\n\n- Submissions in JPG, GIF, PNG, .fog, or .vfb formats will **not** be accepted.\n\n- Label each file as such: **Battle#\\_lastname\\_#.eps** (example: Battle1\\_evens\\_1.eps) Please see the list of battles below, and name them accordingly.\n\nBattle 1 -- Blackletter / Slab  \nBattle 2 -- Franklin Gothic Swashes  \nBattle 3 -- Triline Pixel  \nBattle 4 -- Cooper Black ligatures  \nBattle 5 -- MICR letters  \nBattle 6 -- Found Type  \nBattle 7 -- Script Hobo  \nBattle 8 -- 3D by Hand  \nBattle 9 -- 'ch' 'th' 'sh' sounds  \nBattle 10 -- S S S S  \nBattle 11 -- More S S S S  \nBattle 12 -- Lowercase for text  \nBattle 13 -- Pointing hand dingbat  \nBattle 14 -- Alternate ampersands\n\nThe **deadline for submission is July 5, 2006.** Please zip your files (not over 10mb please), include your full name and send submissions to: [evens@punchcut.com](mailto:evens@punchcut.com). If you have files larger than 10mb, please send us a link where we can download the images.\n\nIf you wish to contribute sketches on paper or other non-digital material, please send photos or scans of the material so that we may review them for inclusion in the show.\n\n**We look forward to hearing from you and hope you'll consider being a part of the SOTA TypeGallery this year!**\n\nIf you have any questions, please let us know.\n\n",
  "author": "Zara Evens",
  "time": "15 Jun 2006 — 2:40pm",
  "uid": "111",
  "comments": [
    {
      "time": "15 Jun 2006 — 2:51pm",
      "content": "If you were already contacted offline and have made your submission, there is no need to resubmit. (Unless of course you have since extended the designs or participated in more recent battles)\n\n"
    },
    {
      "time": "15 Jun 2006 — 6:00pm",
      "content": "How do you suggest we do the Tri-Line Pixel battle in high res? Oh and the 3D by hand...\n\n"
    },
    {
      "time": "15 Jun 2006 — 7:46pm",
      "content": "David, Which application did you use to create the pixel drawings? If you created them in Photoshop, you should be able to export the paths to vector shapes, which can then be scaled.\n\nYou may submit non-digital work as a scan or high quality photograph. If you'd like to submit the original piece, or a quality duplicate of the original, you may mail that in directly, but not before having a photograph of it reviewed first by the curators of the exhibit.\n\n"
    },
    {
      "time": "15 Jun 2006 — 7:55pm",
      "content": "I used Photoshop, I'll figure out exporting paths of it...didn't think about that!\n\n"
    },
    {
      "time": "15 Jun 2006 — 7:59pm",
      "content": "I forgot to mention, for pixel font submissions, it would be great to have them at 100% in addition to a larger version -- but not required.\n\n"
    },
    {
      "time": "15 Jun 2006 — 8:14pm",
      "content": "If they're at actual size, Zara, wouldn't that make them really small? (screen res being 72px/inch and print res being 300px/inch)\n\nAs far as exporting paths goes (sorry I'm recooping from a week of little to no sleep) I'm selecting the pixels and going to the 'Make Paths From Selection' but the paths are all screwy, are there settings to make this work?\n\n"
    },
    {
      "time": "15 Jun 2006 — 10:46pm",
      "content": "<cite>If they’re at actual size, Zara, wouldn’t that make them really small?</cite>\n\nYes, indeed, they would be small. It is my understanding that a selection of submissions <cite>may</cite> be shown on screen.\n\nI honestly can't say I've done much path exporting myself, I tend to draw with vector tools while in photoshop. I use a little trick that might work for you. Assuming your Photoshop doc is a bitmap, you can save as a PDF and then open this in Illustrator. You won't be able to edit the image, but it can be scaled as large as you want.\n\n"
    },
    {
      "time": "16 Jun 2006 — 2:22pm",
      "content": "David, if you save your pixel file as bitmap (.BMP), and then import into Illustrator, you can scale as you please and, in theory, the pixels remain perfectly square. I don't know what this tri pixel thingies look like, but this is the way to export pixel-based work and be able to scale it.\n\n"
    },
    {
      "time": "16 Jun 2006 — 2:29pm",
      "content": "Thanks for the help, I was just pulling a blank as I tried to figure this out. I converted my pixel renderings to 1800 px/in Bitmap images \\> Scaled up 300% \\> Made a selection of the black pixels \\> Convert Selection To Path I think Photoshop just had trouble establishing paths when each line was only one pixel thick.\n\nI'm sending you my boards now, Zara!\n\n"
    },
    {
      "time": "18 Jun 2006 — 12:14pm",
      "content": "Zara,  \nIs the Type Battle work going to be the only thing in the TypeGallery this year? Other years also had submissions of new fonts done in that year. I was wondering if I could also submit non-Battle items in another part of the Gallery?\n\nChrisL\n\n"
    },
    {
      "time": "18 Jun 2006 — 1:02pm",
      "content": "Zara, you might want to include [an amusing exercise](http://web.archive.org/web/20131017120309/http:/typophile.com/node/16343) in the show, as it was kind of a battle before the battle was established. Also it has some terrific and amusing stuff by Mark Simonson, among others. Also apparently it went all over the internet.\n\n"
    },
    {
      "time": "18 Jun 2006 — 1:09pm",
      "content": "What about the other 'battle before the battles' where we were given the quote: \"Y'know what your problem is? You're stupid. How long will we continue to draw in our colouring books an image of God that makes us sad.\" [http://typophile.com/node/16130](http://web.archive.org/web/20131017120309/http:/typophile.com/node/16130 \"http://typophile.com/node/16130\")\n\n"
    },
    {
      "time": "19 Jun 2006 — 11:20am",
      "content": "<cite>Is the Type Battle work going to be the only thing in the TypeGallery this year?</cite>\n\nNo, there will be a much larger variety of work in the TypeGallery. If you are interesting in submitting work outside of the Type Battles, you will need to contact Shu at SOTA. I'll point him to this thread so he may respond with the necessary information.\n\n"
    },
    {
      "time": "19 Jun 2006 — 11:52am",
      "content": "Thanks Zara!\n\nChrisL\n\n"
    },
    {
      "time": "19 Jun 2006 — 11:54am",
      "content": "Hello all. I hope everyone is heartily preparing their Type Battle work for the show. Just to let everyone known, the Type Battles are just one part of what will be the biggest TypeGallery ever. There will be a TypeGallery unjuried call for submissions just as in previous years. The new website will be launching very, very soon. Very soon. There will be more info there as well as a preview of some work before the conference. But, just for a taste here are some of the other shows will we have the pleasure of showcasing this year.\n\nTDC show  \nBlackletter in Mexico  \nLetras Latinas  \nBoston Calligraphy group show  \nCurated Letterpress\n\nThat is not even near a full list. It will be grand.\n\nShu\n\n"
    },
    {
      "time": "19 Jun 2006 — 1:10pm",
      "content": "Still wondering if this ( [http://typophile.com/node/16130](http://web.archive.org/web/20131017120309/http:/typophile.com/node/16130 \"http://typophile.com/node/16130\") ) will be included...\n\n"
    },
    {
      "time": "19 Jun 2006 — 1:54pm",
      "content": "Both the recommendations from David and William are noteworthy, however I don't think they will be included in the Type Battle showcase.\n\n"
    },
    {
      "time": "19 Jun 2006 — 1:58pm",
      "content": "Ok, just curious!\n\n"
    },
    {
      "time": "22 Jun 2006 — 7:30am",
      "content": "too bad the QU ligature thread wasn't a real Type Battle.. would've submitted that one.\n\n"
    },
    {
      "time": "22 Jun 2006 — 8:48am",
      "content": "[TypeCon Registration Is Open!!](http://web.archive.org/web/20131017120309/http:/www.typecon.com/)\n\n"
    },
    {
      "time": "25 Jun 2006 — 11:16pm",
      "content": "You can also scale up in photoshop using image size. Just make sure to change the interpolation from \"bicubic\" to \"nearest neighbor\" so you don't get any blurring.\n\n"
    },
    {
      "time": "29 Jun 2006 — 10:10am",
      "content": "Thanks to all who have submitted so far!\n\nHowever, the deadline is looming, and there are some more of you out there who should be submitting files!\n\n"
    },
    {
      "time": "29 Jun 2006 — 10:57am",
      "content": "I'm workin' on it Zara.\n\n[http://typophile.com/node/20987](http://web.archive.org/web/20131017120309/http:/typophile.com/node/20987 \"http://typophile.com/node/20987\")\n\nChrisL\n\n"
    },
    {
      "time": "4 Jul 2006 — 7:55am",
      "content": "Zara,  \nWhat time tomorrow is the cuttoff for submissions? I am runnin' late :-(\n\nChrisL\n\n"
    },
    {
      "time": "12 Jul 2006 — 2:31pm",
      "content": "Crap. I missed the deadline. That's what I get for working. Maybe next time.\n\n"
    },
    {
      "time": "13 Jul 2006 — 9:07pm",
      "content": "Matt, send Zara a note... she's more than understanding about deadline extensions. It certainly couldn't hurt to ask.\n\n"
    }
  ]
}
