{
  "id": "20726",
  "title": "\"It's full of stars — Arabian Stars\" black sans and Arabic script - Gill Kayo",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": " ![](http://web.archive.org/web/20150221091437im_/http:/typophile.com/files/AB_6225.jpg)\n\nInterested in the Arab as well. No clue.\n\n",
  "author": "jupiterboy",
  "time": "16 Jun 2006 — 11:52am",
  "uid": "4204",
  "comments": [
    {
      "time": "16 Jun 2006 — 11:58am",
      "content": "Stars is Gill Sans Ultra Bold\n\n"
    },
    {
      "time": "16 Jun 2006 — 12:01pm",
      "content": "Gill Sans Ultra Bold.\n\nNo clue on the Arabic, but it's a nice match.\n\n"
    },
    {
      "time": "16 Jun 2006 — 12:18pm",
      "content": "I thought it was but I don't have the ultra to confirm, and the lc \"i\" is scooped out at the top and I didn't remember that detail.\n\nNow the Arabic.\n\n"
    },
    {
      "time": "17 Jun 2006 — 1:30am",
      "content": "Well done! Jupiterboy,  \nCan I have a look at the Complete Arabic Character Set?  \nCustom lettering works well for some words and fails elsewhere.  \nAll the Best.\n\n"
    },
    {
      "time": "17 Jun 2006 — 8:35am",
      "content": "Ah. I may not have made myself clear. That is not my work, but rather the cover of a book project by Jordi Colomer titled \"Arabian Stars\".\n\nHaving explained that, I'm working on a small project for a traveling exhibition titled \"Dafatir\". (Google if you want to see images from the show.) It features Iraqi contmporarybook art. Although we don't have the budget to set the full texts in Arabic, I wan't to possibly have the title set in Arabic.\n\nI was so impressed with the well matched script and how it works with the Gill that I wanted to see if anyone knew what font was used for the Arabic or if it was custom. I want to look at all the options available, and would also look at hiring someone to set \"Dafatir\" in Arabic script with a similar feel to the type I choose for the book.\n\nFeel free to contact me via my web page if you have interest.\n\n"
    }
  ]
}
