{
  "id": "20761",
  "title": "Confusing logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": " ![](http://web.archive.org/web/20140307122916im_/http:/typophile.com/files/equate_5313.gif)\n\nI've just finished this logo and some people don't seem to get it! I thought it was easy enough but would like to be sure.\n\n",
  "author": "Jerome Iveson",
  "time": "18 Jun 2006 — 4:08pm",
  "uid": "13290",
  "comments": [
    {
      "time": "18 Jun 2006 — 4:21pm",
      "content": "It would be better if the word wasn't in the title. Having seen the word before opening, it was what I saw.\n\n"
    },
    {
      "time": "18 Jun 2006 — 4:23pm",
      "content": "cheers I'll try and change it\n\n"
    },
    {
      "time": "18 Jun 2006 — 4:32pm",
      "content": "I read 'EQUATE'. Is that it?\n\n"
    },
    {
      "time": "18 Jun 2006 — 5:03pm",
      "content": "even as a non-native english speaker i instantly got the idea and found it easy to read, and i think that it is a clever concept. just think about the fedex-logo, after you've once found out the trick you'll never forget the brand.\n\n"
    },
    {
      "time": "18 Jun 2006 — 6:10pm",
      "content": "i don't find that confusing in the least. i feel it is a clear and smart visual message. don't change it.\n\n"
    },
    {
      "time": "18 Jun 2006 — 6:13pm",
      "content": "Totally agree with Thierry and I think it's brilliant.\n\n"
    },
    {
      "time": "18 Jun 2006 — 6:32pm",
      "content": "I understand it and like it (for the simplicity and strong message). While I DO understand it, I can imagine how/why people don't.\n\nI guess it depends on what it's for and how visually literate the audience are.\n\nWhat is it for?\n\n"
    },
    {
      "time": "18 Jun 2006 — 7:08pm",
      "content": "I got it right away and think it's very cool. But this audience is not made up of civilians.\n\nER\n\n"
    },
    {
      "time": "18 Jun 2006 — 8:12pm",
      "content": "Very simple and clever. Good work!\n\n"
    },
    {
      "time": "19 Jun 2006 — 12:49am",
      "content": "yeah thats right it just gets worrying sometmes when someone asks what is Equals Quate!\n\n"
    },
    {
      "time": "19 Jun 2006 — 12:51am",
      "content": "Thanks for the feedback so far. it seems 95% of people get it. Thats a relief as I really like the concept. By the way its for an accountancy company\n\n"
    },
    {
      "time": "19 Jun 2006 — 2:23am",
      "content": "I like it very much. I hope you don't mind I had a break on your logo, I was thinking that a vertical bar on the left might work for your reification concept (the constructive or generative aspect of perception), and also it creates a mark which can be use separately from the logotype.\n\n ![](http://web.archive.org/web/20140307122916im_/http:/typophile.com/files/equate_5314_4628.gif)\n\n"
    },
    {
      "time": "19 Jun 2006 — 2:54am",
      "content": "thanks Alessandro, I'd already tried that during the development process but thought it detracted from the = part of the logo although it does let you see the E easier. I thought this was important for the link to accountancy. I know what you mean though!\n\n"
    },
    {
      "time": "19 Jun 2006 — 3:19am",
      "content": "the vertical bar does not help the recognition of an E shape. IMO\n\nAlong similar lines, perhaps this is something worth exploring ...\n\n----------  \n**Paul Ducco**  \nSolid Creative  \n [Communication Design, Melbourne](http://web.archive.org/web/20140307122916/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "19 Jun 2006 — 4:11am",
      "content": "I saw it straight away. I like it. The vertical bar actually  \nmakes the E harder to see imo.\n\nPhil\n\n"
    },
    {
      "time": "19 Jun 2006 — 7:56am",
      "content": "I really like it, but I had to think to get it…\n\npeace\n\n"
    },
    {
      "time": "19 Jun 2006 — 8:51am",
      "content": "Jerome, I understood it immediately. I have the same question as Paul, though, who is the intended audience?\n\n"
    },
    {
      "time": "19 Jun 2006 — 8:58am",
      "content": "My training is in electrical and electronics engineering, not graphics, and it's crystal clear to me, and I like it.\n\nI don't like the vertical bar because it means \"NOT\" in many programming languages (\"!=\" means \"NOT EQUAL\").\n\n"
    },
    {
      "time": "19 Jun 2006 — 9:14am",
      "content": "Hi Andi\n\nThe company is an accountancy firm so the audience is business managers small and large, financial directors etc.\n\n"
    },
    {
      "time": "19 Jun 2006 — 9:34am",
      "content": "hmm, the fact that it's an accounting firm causes a bit of concern for me given that the source of peoples confusion is most likely the visual redundancy and phoenetic overlap between the symbol and first three letters...i certainly wouldn't want an accountant who unwittingly repeats and isn't precise to such a degree. petty and splitting hairs, but thats waht you want an accountant to do.  \nso, although i find it clever, i believe it's too 'cute' and fussy to be appropriate. it's one of those ones to be proud of discovering, but better off not pushing if there is an uncomfortability.\n\n"
    },
    {
      "time": "19 Jun 2006 — 1:17pm",
      "content": "First glance got it. No problem.\n\n"
    },
    {
      "time": "19 Jun 2006 — 1:51pm",
      "content": "What about adding a solid vertical bar immediately to the **right** side of the equals sign? (To define the right edges of the three legs of the first E?)\n\n(Hope that made sense...)\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n [http://homepage.mac.com/mwebert](http://web.archive.org/web/20140307122916/http:/homepage.mac.com/mwebert \"http://homepage.mac.com/mwebert\")  \n [mwebert@mac.com](mailto:mwebert@mac.com)  \n--------------\n\n"
    },
    {
      "time": "19 Jun 2006 — 5:32pm",
      "content": "a bit late (and a bit rough) but what about this?\n\n ![](http://web.archive.org/web/20140307122916im_/http:/typophile.com/files/Equate%20copy_5531.png)\n\n"
    },
    {
      "time": "19 Jun 2006 — 9:33pm",
      "content": "This is one of those things that is meant to be read in layers. Some people will get it right away, but if they don't it isn't a bad thing. Jerome, stick to what you have. I think most people enjoy things with an \"aha\" moment in them.\n\n"
    },
    {
      "time": "20 Jun 2006 — 2:39am",
      "content": "Dear Jerome Iveson!\n\nYour first version was the best!!!  \nReadable & understandable for the first sight.  \nSo don't change it! :)\n\n"
    },
    {
      "time": "20 Jun 2006 — 3:07am",
      "content": "I got it at first glance –&nbsp;reminded me of the [logo](http://web.archive.org/web/20140307122916/http:/www.bluewin.ch/) of a Swiss internet provider, though (upper left corner – excuse the messy homepage).\n\n"
    },
    {
      "time": "20 Jun 2006 — 5:00am",
      "content": "I get it & like it!  \nMy only thought is to maybe add a little weight to the '='.\n\n"
    },
    {
      "time": "20 Jun 2006 — 5:25am",
      "content": "I like your original conception to use an Equal Sign as the letter E. But... I can understand the confusion of people not understanding it.\n\nThe Equate seems to come through to those that are educated. Unfortunately, that is not so true of the masses. Fifth grade educations only get a person so far in this world.\n\nPerhaps you'd consider using the three bars to get the idea of the E across - and then one of the bars as an equal sign. Does that work for you?\n\n ![](http://web.archive.org/web/20140307122916im_/http:/typophile.com/files/equatex_5313_5595.gif)\n\n"
    },
    {
      "time": "20 Jun 2006 — 5:51am",
      "content": "I think the original version is best. I got it at once, albeit with a tiny \"tick\" of having to think about it, which is surely a good thing for a logo.\n\n"
    },
    {
      "time": "20 Jun 2006 — 6:20am",
      "content": "hope this one geths through...\n\n ![](http://web.archive.org/web/20140307122916im_/http:/typophile.com/files/equate_tim_4032.gif)\n\n"
    },
    {
      "time": "20 Jun 2006 — 7:51am",
      "content": "You know Tim, I'm thinking that looks more like \"= Quate\".\n\n"
    },
    {
      "time": "20 Jun 2006 — 7:58am",
      "content": "quote - The Equate seems to come through to those that are educated.\n\nA very interesting elitist observation based on?\n\nThe original logo is the best…\n\npeace\n\n"
    },
    {
      "time": "20 Jun 2006 — 8:09am",
      "content": "\\>A very interesting elitist observation based on?\n\ntsk, tsk, tsk, we don't use the word elitist around here, we're all esoteric, remember?\n\nThis last one by Ahrens is interesting but the original one is still the most forward looking in terms of style. Very basic and cool. And making them think just a little bit is a good thing, they'll feel all smart when they get it, and they will.\n\nER\n\n"
    },
    {
      "time": "20 Jun 2006 — 8:19am",
      "content": "Based on comments i think I'll leave it as it is. I wasn't expecting this amount of comments. Thanks to everyone who has posted so far\n\n"
    },
    {
      "time": "20 Jun 2006 — 8:38am",
      "content": "It might be my screen (or my eyes) but the open counters of your E look sharper on the inside than the outside corners, it might be worth trying that on the equals symbol to reinforce the origins of the letter, then again it might be too subtle to bother with.  \nI did read your logo first off and it's a nice wordplay, I wonder if the kerning between =Q needs to be tightened a bit (or QU needs loosening a touch).  \nTim\n\n"
    },
    {
      "time": "20 Jun 2006 — 9:29am",
      "content": "<cite><br>\nI like your original conception to use an Equal Sign as the letter E. But… I can understand the confusion of people not understanding it.<br>\n<cite><br>\nThe Equate seems to come through to those that are educated. Unfortunately, that is not so true of the masses. Fifth grade educations only get a person so far in this world.</cite></cite>\n\nPeople with 5th grade educations are rarely in a position to choose an accounting firm. The extra bars make it more confusing while taking away the simple cleverness of the original.\n\n"
    },
    {
      "time": "20 Jun 2006 — 9:42am",
      "content": "What about\n\n ![](http://web.archive.org/web/20140307122916im_/http:/typophile.com/files/ms_equate_3907.gif)\n\nThe initial ideas are all still there, and it might be more \"readable\" for the _general audience..._\n\n(In addition, the stem of the 'T' provides the extra help to form the _subliminal_ 'E')\n\n"
    },
    {
      "time": "20 Jun 2006 — 9:55am",
      "content": "Stick with your original. It works.\n\n"
    },
    {
      "time": "20 Jun 2006 — 10:17am",
      "content": "i'd say stick with your origional but i felt like messing around also:\n\n ![](http://web.archive.org/web/20140307122916im_/http:/typophile.com/files/equate_6661.jpg)\n\n"
    },
    {
      "time": "20 Jun 2006 — 10:37am",
      "content": "Here's a visual for my previously convoluted explanation...\n\n ![](http://web.archive.org/web/20140307122916im_/http:/typophile.com/files/equate_3672.gif)\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n [http://homepage.mac.com/mwebert](http://web.archive.org/web/20140307122916/http:/homepage.mac.com/mwebert \"http://homepage.mac.com/mwebert\")  \n [mwebert@mac.com](mailto:mwebert@mac.com)  \n--------------\n\n"
    },
    {
      "time": "20 Jun 2006 — 10:39am",
      "content": "Overall, I prefer Miguel's solution to the original for legibility's sake. Nobody is going to read that as a logo for \"EQUAT\" while there is some chance that he or she could read the original as \"QUATE.\"\n\nHope that makes sense...\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n [http://homepage.mac.com/mwebert](http://web.archive.org/web/20140307122916/http:/homepage.mac.com/mwebert \"http://homepage.mac.com/mwebert\")  \n [mwebert@mac.com](mailto:mwebert@mac.com)  \n--------------\n\n"
    },
    {
      "time": "20 Jun 2006 — 11:01am",
      "content": "Miguel's solution has something to it. In many ways it does what the original does while avoid all of the outlining, shadowing and/or other tricks which should be the goal. IMHO\n\n"
    },
    {
      "time": "20 Jun 2006 — 11:48am",
      "content": "Just the first one. It works.\n\nI saw it and my first thought was: What's this?  \nIt struck me by its simple and powerful looks.  \nAfter a split second, I got the meaning of it.\n\nIt's quite a blunt design. I like it. :-)\n\n"
    },
    {
      "time": "20 Jun 2006 — 12:42pm",
      "content": "Still like the original. Miguel's solution is insightful, but has its own, potentially worse, problem:  \nAn intelligent person notices that \"Quate\" isn't a word, finds the \"=\" and says \"Oh, it's \"EQUATE.\"\n\nBut, in a world with companies like \"Compaq,\" \"Equat\" (pronounced \"equate\" or rhymes with \"squat\") is a potentially valid company name. In fact, [www.equat.com](http://web.archive.org/web/20140307122916/http:/www.equat.com/ \"www.equat.com\") is a Web design page.\n\nThey might google for \"equat accounting.\"\n\n"
    },
    {
      "time": "20 Jun 2006 — 12:58pm",
      "content": "Don't change your original idea. It's clever so don't mess it up.\n\n"
    },
    {
      "time": "20 Jun 2006 — 1:57pm",
      "content": "\\> _An intelligent person notices that “Quate” isn’t a word, finds the “=” and says “Oh, it’s “EQUATE.”_\n\nAnd a (less) intelligent person notices that “Equat” isn’t a word, finds...\n\n\\> _But [...] “Equat” [...] is a potentially valid company name. In fact, [www.equat.com](http://web.archive.org/web/20140307122916/http:/www.equat.com/ \"www.equat.com\") is a Web design page._\n\nThat also doesn't hold as an argument. Google for 'quate' and see what you get...\n\n"
    },
    {
      "time": "20 Jun 2006 — 5:31pm",
      "content": "Funny thing\n\n ![](http://web.archive.org/web/20140307122916im_/http:/typophile.com/files/unequal1_3685.jpg)\n\ndoesn't seem to work (sorry, done in a hurry).\n\nIt occurred to me because I just saw the campaign for the II week of sexual diversity on TV (in Brazil) and they used the unequal sign as a logo to represent diversity. Unequal=diverse, get it?\n\n"
    },
    {
      "time": "20 Jun 2006 — 7:34pm",
      "content": "You're going to find that we designers love the idea because visually and symbolically it's simple but clever-as-hell.\n\nYou mentioned, though, that it's for an accounting agency of some sort, which causes a problem. Have they seen this concept yet? My worry simply stems from the fact that accountants are less likely to appreciate a clever logo and more likely to want some pretty typography with serifs and a few little swashes here and there.\n\nYou will also continue to find that some people get the word and some people don't. If this were a night club, it'd be one thing. But since it's an accounting firm, you'll have to make sure their title is clear and 100% obvious so people can take them seriously.\n\n"
    },
    {
      "time": "20 Jun 2006 — 9:32pm",
      "content": "\\> An intelligent person notices that “Quate” isn’t a word, finds the “=” and says “Oh, it’s “EQUATE.”\n\nAnd a (less) intelligent person notices that “Equat” isn’t a word, finds…\n\n\\> But […] “Equat” […] is a potentially valid company name. In fact, [www.equat.com](http://web.archive.org/web/20140307122916/http:/www.equat.com/ \"www.equat.com\") is a Web design page.\n\nThat also doesn’t hold as an argument. Google for ‘quate’ and see what you get…\n\nMiguel,\n\nI apologize if it sounded like I was sharply criticizing your design. Your idea was a very clever solution, and I liked it. It was certianly (in my opinion) the best alternative submitted. You are correct that \"quate\" gets more Google hits than \"equat.\"\n\nMy intent was to point out that your alternative is also not idiot-proof. I don't see either design as a problem, but it is fair to say that each alternative has some possibility of confusion.\n\n"
    },
    {
      "time": "20 Jun 2006 — 9:48pm",
      "content": "[liquisoft]  \n“My worry simply stems from the fact that accountants are less likely to appreciate a clever logo and more likely to want some pretty typography with serifs and a few little swashes here and there.”\n\nI’m only posting in this thread because it discusses the perspective of non-designers.\n\nMy background is electrical engineering, and engineers are considered to be almost as aesthetically retarded as accountants. I LOVE THE ORIGINAL DESIGN. I’m a bit offended at your patronizing stereotypes of non-designers.\n\n“But since it’s an accounting firm, you’ll have to make sure their title is clear and 100% obvious so people can take them seriously.”\n\nAs an entrepreneur (from the Old French for “person who hires accountants”) I would take a firm with this simple and brutally clever name and logo far, far, far more seriously than I would a swashy “Mary’s Olde Tyme Accounting” or a brain-dead firm that called itself “CPAs Plus” (in Arial or Cooper Black with a big “+” sign).\n\n"
    }
  ]
}
