{
  "id": "2078",
  "title": "A little bit of knowledge",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "is scary!   \n   \nthis came to me from another list - don't know if its been mentioned here...I just had to post it...its so funny.   \n(clip)   \nMood-Supporting Typeface Manipulation   \n   \nLooking at the typesetting for various books over the years it's become apparent that typeface can be used to support the mood of a message. An author should be able to select a section of text in a word processor and choose from menu items like Tense, Suspenseful, Angry, or Serene and have that supported by things like amount of kerning, serifs, even-ness of character spacing, line spacing, italicization, line weight, and character shape. The author should only have to worry about mood, not how the mood is achieved.\n\n",
  "author": "tsprowl",
  "time": "14 Nov 2003 — 8:32am",
  "uid": "1019",
  "comments": [
    {
      "time": "14 Nov 2003 — 1:47pm",
      "content": "\\>Thus the typesetting system would have to make an ongoing series of changes to keep renewing the desired transient effect.   \n   \nLike smell. The muffin shop located in the subway continuously vented the air from its ovens into the underground mall. But that was not sufficiently motivating, because once people had been in the mall for 15 seconds, they would tune out the marvelous aroma as \"background\". So the muffin shop would vent periodically, to keep potential customers aware.   \n   \nBut continuous text is surely not like that, the premise being that typographic nuance is subconscious, yet still meaningful.\n\n"
    },
    {
      "time": "14 Nov 2003 — 4:42pm",
      "content": "\\> I certainly don't want the text to suddenly change when some[one] is yelling   \n   \nWhat's \"suddenly\"?   \nWhat if it changes subtly, like let's say from Adobe Jenson to Downer's Iowan?   \n   \nhhp\n\n"
    },
    {
      "time": "14 Nov 2003 — 4:50pm",
      "content": "But don't you think:   \n1) There's a difference between conscious appreciation versus what our subconscious can absorb during immersive reading?   \n2) People snap out of immersion periodically, and at that time they can appreciate even certain things about a text font consciously?   \n   \nIf you're right, then we should just stop making text fonts...   \n   \nhhp\n\n"
    },
    {
      "time": "14 Nov 2003 — 6:43pm",
      "content": "Before one stops designing text fonts, one should probably stop babbling about on this thread.\n\n"
    },
    {
      "time": "14 Nov 2003 — 10:21pm",
      "content": "I don't get your point.   \n   \n--   \n   \nThere's a difference between display and text fonts. Anybody who can't see that has a black hole where his theory should be. Theory is no replacement for practical experience, but only theory can help forge new ground, the prerequisite of cultural progress (as opposed to merely paying the bills).   \n   \nThis difference between text and display affects the nature of expressiveness. What I mean for example is that Massin's \"concrete typography\" stuff -which to me has always seemed deathly boring, because it's so obvious- is only partially related to expressiveness in text design, which has to be supremely subtle to work right.   \n   \nFor a long time I'd been looking for a text counterpart to the Massin stuff, and Avital Ronell's efforts (like \"The Telephone Book\") were interesting, but still largely in the realm of display. I ended up finding (thanks to a Typo-L member) one single instance -but a superb one- of what I was looking for, in the unlikeliest of places: a trashy fantasy novel! It's called \"The Interior Life\", and in it the author, Katherine Blake (an alias), who also directed the typography, uses different fonts (all texty) to express the mundane versus exciting components of a contemporary housewife's medieval romantic adventures. It's a 300-page novel with a lot of interweaving of realities so to speak, so it must have been a lot of work to set in such an elaborate system, and there can't even be any proof that it actually works! But just the fact that somebody (who isn't even a professional designer) has done it makes me happy, and really, if you don't believe it can work, you can't believe making new text fonts is worth the effort.   \n   \nhhp\n\n"
    },
    {
      "time": "14 Nov 2003 — 11:26pm",
      "content": "There are a few other examples of different text faces being used in the same book, although not for emotive purposes. In A.S. Byatt's _Babel Tower_ the novel within the novel is set in a different typeface, and in the first chapter of Umberto Eco's _Baudolino_ different typefaces are used to indicate different texts in a palimpsest, including remnants of erased text.\n\n"
    },
    {
      "time": "15 Nov 2003 — 8:38am",
      "content": "Chip Kidd's _The Cheese Monkeys_ starts out in Apollo and at some (presumably key) point in the novel changes to a Bodoni (I think it was). It seemed more like an affectation than anything else, and I don't recall ever really figuring out what the significance was of either specific face.   \n   \nChip Kidd's work as a designer of book jackets is somewhat legendary. I remember, however, being not really that impressed with the interior scheme.   \n   \nI just noticed that the book is available in a digital version for Microsoft Reader. I wonder if they attempted to preserve the design conceits.   \n   \n-- K.\n\n"
    },
    {
      "time": "15 Nov 2003 — 8:53am",
      "content": "\\> In A.S. Byatt's Babel Tower the novel within the novel is set in a different typeface   \n   \nI'm curious: what were the nature of the stories, and the typefaces used?   \n   \n--   \n   \n\\> I don't recall ever really figuring out what the significance was of either specific face.   \n   \nIn the case of the Blake book it seems to make sense: she uses a pretty generic texty Modern for the housewife parts, but Weiss (which to me at least does look somewhat medieval, while remaining readable) is used for the alternate/adventurous reality.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Nov 2003 — 1:32pm",
      "content": "In my edition of _Babel Tower_, the main story is set in Bembo; there are a lot of narrative threads, but one involves the principal character becoming involved in the legal defence of a novel charged with obscenity. Large sections of the novel in question are interwoven into the narrative, and are set in Joanna. The contrast works very well in the well-printed hard cover edition: both types are good text faces, and Joanna nicely captures the modernity of the novel within the novel. It works less well in the paperback edition, in which the text is too small and too badly printed for the difference between the types to be obvious to the average reader.\n\n"
    },
    {
      "time": "16 Nov 2003 — 10:37am",
      "content": "I donno but if a novel needs mood supporting typefaces - maybe its not a very good novel to begin with.   \n   \nI agree with Tiffany - function before form here. your reading a story! On top of that - defining the mood with pre-sets such as typography might even diminish its worth. Most people have made up their own imagery that they like to escape into when picking up a book. If your messing with it and explaining to them exactly how \"scary\" or \"angry\" the mood is in this paragraph then you've just changed the readers path which was flowing just fine and pretty organically until you changed the face.   \n   \nif it calls for such intrusive visual clues like that perhaps it should be a movie instead.\n\n"
    },
    {
      "time": "16 Nov 2003 — 3:29pm",
      "content": "\\> if a novel needs mood supporting typefaces - maybe its not a very good novel to begin with.   \n   \n1) What exactly is \"needs\"? Versus \"benefits from\". What is a \"good novel\", to whom? How is the typographer's responsability relieved by a bad novel? Doesn't a bad novel need all the help it can get?   \n2) If a novel only needs one typeface, why wouldn't all novels need the same face? What's the point of a typographer's job?   \n   \n\\> explaining to them exactly how \"scary\" or \"angry\" the mood is   \n   \nNot \"exactly\" - that's display typography. I'm talking about a much more subtle level, like the difference between Utopia and Weiss for example. Unlike the Massin stuff it's not intrusive. The question remains however if it actually has any effect at all. If it doesn't, then there's no point making [more] text fonts.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Nov 2003 — 5:27am",
      "content": "I have no problem with mixing typefaces to elucidate stories within stories, parallel stuff, and whatnot. As far as I am concerned this can be done as structural typography, which need not have anything to do with overtly expressive typography.   \n   \nBut the kind of \"mood-supporting\" typography which I understand to be the original basis of this thread strikes me as akin to a dramatic reading, complete with theatrical effects. In general, I don't care for it myself.   \n   \nTo continue the metaphor, selecting a typeface for a book (here I'm thinking mostly of a \"reading\" book -- as opposed to reference, or how-to, or coffee-table) is not unlike casting a voice actor for a book-on-tape. To a certain extent, casting just the right voice may enhance the listener's experience of the text. And, certainly, casting a poor voice actor will get in the way of listening. But beyond a basic level of competence, it probably makes a small and subtle, if any, difference.   \n   \nBut there will be no point to having James Earl Jones read these certain passages while Jeremy Irons breaks in to read those others. Unless, like I said, you're casting a dramatic reading -- in which case you have a different animal, and most likely not what the author had in mind.   \n   \n-- K.\n\n"
    },
    {
      "time": "17 Nov 2003 — 6:08am",
      "content": "If the story sucks, no amount of typographical trickery will save it. If it's good, none will be necessary.   \n   \nPiers Anthony wrote some S.F. novels where the aliens spoke in English, for the convenience of the reader, but changed the quotes to signify language changes -- #hello# or &hello&. That was pretty cool but it wasn't necessary, it was just for fun.\n\n"
    },
    {
      "time": "17 Nov 2003 — 9:38am",
      "content": "John, nothing is ever so absolute. And one man's soup is another man's poison.   \n   \nA typographer's responsability is to apply his skills, knowledge and talent to make the reading experience as good as possible (with subtlety admittedly being a key ingredient), and richness of expression is generally relevant. It doesn't matter how good/bad you or I think the content is.   \n   \nIn the same way that different books benefit from different font choices, different facets of a given book can benefit from different fonts. Otherwise we don't really need designers.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Dec 2003 — 8:26am",
      "content": "I realize I'm resurrecting this thread from the bottom, but I've been away, so forgive my lateness with this comment.   \n   \nHave any of you read _[House of Leaves](http://web.archive.org/web/20131015071454/http:/www.amazon.com/gp/reader/0375703764/ref=sib_dp_pt/102-4692538-5006533#reader-link)_ by Mark Danielewski? It's an example book design (its interior) that becomes actively and even inextricably woven into the narrative.   \n   \n [Here's](http://web.archive.org/web/20131015071454/http:/www.amazon.com/gp/reader/0375703764/ref=sib_dp_pt/102-4692538-5006533#reader-page) a good example of a few of the more conservative type styles in action. You have the narrator in Courier and the text of a manuscript he's reconstructing in one serif, and the editor in another (I don't have it with me to venture a guess). Then, whenever the word 'house' appears, it's in blue (or grey, depending on the edition). You can also see the labrynthian footnotes coming into play. There are also sections that have red strikethrough to indicated changes made by the manuscript\n\n"
    },
    {
      "time": "17 Dec 2003 — 1:55pm",
      "content": "So why wouldn't Snooky's idea work? And why is the idea   \nbeing rubbished from the outset? Just because it hasn't   \nbeen done effectively or properly yet, is no reason to   \nassume that it won't. I reckon the guy is on to an excellent   \nidea. The changes would have to be subtle and rely on   \ngestalt to work. To my underdstanding, too little is known   \nabout the underlying emotions of reading to discredit this.   \n   \nkris\n\n"
    },
    {
      "time": "19 Dec 2003 — 9:28am",
      "content": "There are a few reasons (from my understanding) that Snookie's idea wouldn't work. First, the effect would be so subtle and so out of place (unexpected) in a novel full of running text, that all it would likely do is register as an odd visual aberration that makes reading more difficult or confusing, rather than more 'experiential'.   \n   \nWithout tapping into a certain degree of conscious comprehension (and overt design manipulation), the effect would be uncontrollable. The landscape of the page in a novel (to me) is too susceptible/ sensitive to visual changes for the effect to work on a subtle text level. How is the reader going to pick up the purpose the individual contrasts spread over an entire novel? The interrelationship (gestalt, I suppose) would be very difficult to maintain, if not impossible, particularly if they need to change the subtle effects regularly to maintain their effect, as\n\n"
    },
    {
      "time": "14 Nov 2003 — 2:14pm",
      "content": "If too much \"design\" is put into words typeset in texts to be read, for me, it becomes more e.e.cummings and less j.k.rowling. (not a good comparison, just a quick one.) If I'm reading a long text, it is because I want to learn or I want to let my imagination run wild. I certainly don't want the text to suddenly change when some is yelling or laughing.\n\n"
    },
    {
      "time": "14 Nov 2003 — 4:46pm",
      "content": "I don't think that \"most people\" would even notice this change. This amount of change would probably just be a waste of energy.\n\n"
    },
    {
      "time": "17 Nov 2003 — 4:08am",
      "content": "_\\> if a novel needs mood supporting typefaces - maybe   \nits not a very good novel to begin with._      \n   \nI agree with Hrant here: I think certain types of   \nnovels which feature stories within stories, parallel   \nstuff and whatnot might benefit from unconventional   \nsetting and variations in typefaces (re: Hrant's   \nexample \"The Interior Life\"). I'm fairly certain it has   \nan effect, and if well-balanced without hindering   \nthe flow of reading.\n\n"
    }
  ]
}
