{
  "id": "20786",
  "title": "Titling serif for catalog",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "-- edit --  \nI've added a better sample, per Paul's comment.  \n--\n\nI've done a lot of typographic design, logotype lettering, and all that, but this is my first commissioned font. that said, you would hope I gave it plenty of incubation time -- not so. hopefully you'll be kind enough to give me some direction for beta release two.\n\nthe type is for a consumer catalog, that averages around six products per page, and favors filling the space as much as possible with image. it was to replace a very good titling script that had become the scape goat for other issues. the brief was to create something that was more readable and economical than a script, and it was suggested that it not be anything too \"wierd\". the biggest hurdle was that I had about two weeks of \"free-time\" to complete one weight and style that would be put to immediate use. to assist in my expediency, I started with series of drawings I had been working on for educational purposes -- something quite traditional, fortunately.\n\nI completed the font on time, and to great acceptance by the decision-makers on the project. the trouble is, the quality is not what I would like it to be (especially in terms of spacing), so I've been doing a lot of hand-work in it's use.\n\nI have some time now to re-address the type, but I'd like some solid feedback before I start messing around. any opinions would be much appreciated.\n\n| Attachment | Size |\n| --- | --- |\n| [HD Apollo\\_ver1.pdf](http://web.archive.org/web/20140724014625/http:/typophile.com/files/HD%20Apollo_ver1.pdf) | 27.11 KB |\n| [HD Titling\\_ver1\\_smpl B.pdf](http://web.archive.org/web/20140724014625/http:/typophile.com/files/HD%20Titling_ver1_smpl%20B.pdf) | 31.02 KB |\n\n",
  "author": "plainclothes",
  "time": "19 Jun 2006 — 1:17pm",
  "uid": "872",
  "comments": [
    {
      "time": "19 Jun 2006 — 2:09pm",
      "content": "i don't think we can give a truly effective critique without seeing some text set in the typeface. can we get another sample showing some words set using the font?\n\n"
    },
    {
      "time": "19 Jun 2006 — 3:08pm",
      "content": "I don't know, this looks to me an awful like you modified Perpetua a bit. I think it needs more its own identity.\n\nThe one thing strikes me as out of place is that the right stem of the U is thick when the rest of the face follows the usual thick/thin rules.\n\n"
    },
    {
      "time": "19 Jun 2006 — 3:29pm",
      "content": "<cite>this looks to me an awful like you modified Perpetua</cite>\n\nthat's exactly where my earlier study began. oddly enough, it's also one of the reference faces the approval commitee liked. Perpetua had many of the features they were looking for, but it didn't fit with the overall needs in many ways.\n\none of the things that troubles me is though it works better for the client, I still much perfer Perpetua. I suppose trumping Gill is a foolish goal for any of us, lest of all an amateur!\n\n<cite>one thing strikes me as out of place is that the right stem of the U</cite>\n\nabsolutely! I actually hadn't looked at it much---it's one of the characters I spent next to zero time with, since it doesn't occur much in our use.\n\n"
    },
    {
      "time": "19 Jun 2006 — 3:36pm",
      "content": "<cite>I think it needs more its own identity</cite>\n\nhow do you mean? does it just retain too much of the Perpetua/Gill influence, or is my hand conflicting with Gill's and creating an disunified type?\n\n"
    },
    {
      "time": "19 Jun 2006 — 5:24pm",
      "content": "I'm not a pro, but I think it is beautiful.\n\nBottom line is the customer, of course.  \n; )\n\n"
    },
    {
      "time": "20 Jun 2006 — 4:29am",
      "content": "Yes, retains too much of Perpetua. If it were me I would want a different enough concept to justify the work that will be needed to complete it--as well as a reason for others to use it rather than Perpetua. If you started with Perpetua's outlines, there may also be legal problems, as Monotype Imaging's EULA doesn't allow modification.\n\n"
    },
    {
      "time": "20 Jun 2006 — 9:09am",
      "content": "<cite>I’m not a pro, but I think it is beautiful.</cite>\n\nthanks fontplayer! you're absolutely right about the customer. besides, I figure they'll be looking for something new within the year anyway. I was just concerned about developing my own skills.\n\n<cite>If it were me I would want a different enough concept to justify the work</cite>\n\nquite true. I'd like to get it back to paper (where I'm more comfortable) for some more analysis. is there any pervasive quality you can put into words that screams Perpetua to you?\n\n<cite>If you started with Perpetua’s outlines</cite>\n\nactually I started with it on paper. I was trying to think through Gill's reasoning by drawing the characters exactly as he had first. I then went back and attacked it with Perpetua nowhere in sight. once I had a good selection of characters down, I went into FLS5 to get a feel for the digitization process.\n\nthat was all mostly just an excercise, but it happened to fit the bill on this project.\n\nfor this version, I picked-up my drawings and matched Gill's stem width (I liked their weight on the page). I then proceded to touch up my outlines and spacing for use around 40 points.\n\n"
    }
  ]
}
