{
  "id": "2081",
  "title": "Does InDesign have white trap feature?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I know that QWACK, has a feature called white trap. So it spreads the white when setting on a dark BG within a 4 color document. Say if I had my blacks set to 50 40 30 100, and I didnt what the other colors bleeding inside my white reversed out text.   \n   \nDoes InDesign have something like this? Im looking, but it is not called White trap, so not sure what it is, or if it is available.   \n   \nThanks.   \n   \nHildebrant.\n\n",
  "author": "Hildebrant",
  "time": "14 Nov 2003 — 12:00pm",
  "uid": "1286",
  "comments": [
    {
      "time": "14 Nov 2003 — 2:00pm",
      "content": "Kyle, I'll take a look tomorrow. Which version of InDesign are you using. I don't think they changed the print engine very much but they might have. Also see if you can contact Thomas Phinney, he'd know for sure. Dan\n\n"
    },
    {
      "time": "14 Nov 2003 — 2:05pm",
      "content": "I'm afraid I don't know. This kind of question would be good to ask in Adobe's InDesign user forum at [http://www.adobeforums.com](http://web.archive.org/web/20131013050804/http:/www.adobeforums.com/)   \n   \nT\n\n"
    },
    {
      "time": "14 Nov 2003 — 2:18pm",
      "content": "Dan --   \n   \nI just got CS.   \n   \nThomas --   \n   \nI will give it a shot there.\n\n"
    },
    {
      "time": "17 Nov 2003 — 2:02pm",
      "content": "Kyle I slipped up today and didn't check the manual. I've pulled the manual and will look in the morning here, Dan\n\n"
    },
    {
      "time": "17 Nov 2003 — 7:19pm",
      "content": "Have done all this, and adobe's forum was a major bust, no reply yet.   \n   \nIt might not have this feature, but it seems it should. I couldnt find anything in the .pdf help.\n\n"
    },
    {
      "time": "18 Nov 2003 — 5:39am",
      "content": "No luck here Kyle. Maybe there is a InDesign users group you could contact.\n\n"
    },
    {
      "time": "23 Nov 2003 — 6:58pm",
      "content": "Still out of luck. Then there is the whole saving back to 2.0 format. !@%#&$!#!   \n   \nHildebrant.\n\n"
    },
    {
      "time": "17 Nov 2003 — 2:36pm",
      "content": "Kyle - Did you search for \"trap\" using InDesign's html-based   \nhelp system (which is pretty decent)? There is an entry titled   \n\"Trapping with blacks and rich blacks\".\n\n"
    }
  ]
}
