{
  "id": "2082",
  "title": "Mr Pixel",
  "forum": "Bitmap Display / Script",
  "tags": [
    "Bitmap Display / Script"
  ],
  "content": "Hi !   \nHere is Mister Pixel 16 pt font that I designed. What you think about it ? All remarks are bienvenue. Thanks by advance, merci, salutations. ![Mr Pixel Font 16 pt](http://web.archive.org/web/20150317114410im_/http:/www.typophile.com/forums/messages/29/20497.gif) ![Mr Pixel Font2](http://web.archive.org/web/20150317114410im_/http:/www.typophile.com/forums/messages/29/20498.gif)\n\n",
  "author": "Christophe Badani",
  "time": "14 Nov 2003 — 1:05pm",
  "uid": "947",
  "comments": [
    {
      "time": "17 Nov 2003 — 10:11am",
      "content": "How does this look for those who have very hi-res display setups?   \n   \nhhp\n\n"
    },
    {
      "time": "17 Nov 2003 — 11:04am",
      "content": "Hello Hrant,   \nThanks for your message.   \nIf I understand your question, I don't know. But if you want, and If you have a very hi-res display setups, I can send you Mister Pixel by email. This font will be free, it's not a problem.\n\n"
    },
    {
      "time": "17 Nov 2003 — 11:12am",
      "content": "Thanks for the offer! What format would you send it though? I'm [generally] on Windows.   \n   \nAnyway, what I'm mostly wondering is this: Since this is a large design, but with good weight and spacing, how does it function as a _text_ font for hi-res displays? I'm hoping John Hudson will chime in.   \n   \nAnd the main reason I'm curious is that I've been working on a similar font since '98, but mine uses grayscaling, so it requires special treatmen/usage. It will be released soon.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Nov 2003 — 1:26pm",
      "content": "At an aspect ratio of 4:3, a 15\" screen is 12 inches wide. So your PPI is just over 100. BTW, how close to your screen is your head, typically?   \n   \nI'm thinking that a 1600 dpi display on a 15\" (~130 PPI) would make a 16 PPEM font really sing.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Nov 2003 — 1:30pm",
      "content": "Christophe -- looks like you put a lot of work into it. It shows! Good job.   \n   \nI love the font's quirkiness. It seems like bitmap fonts end up being a tad mechanical, but I don't get this from yours as much. (Of course, with 16 pixels high instead of 7-9, it's easy to add detail.)\n\n"
    },
    {
      "time": "18 Nov 2003 — 2:38am",
      "content": "Hrant: I generate a PC version & I send you.   \n   \nThis font are designed in only one size (16 pt or pixel) with bitmap and PS contour. This is a screen font, bitmap font, no grayscale. I made this for the new version of my website (not visible at this moment), I wanted a special typography for the titles of sections.   \nFor the moment, this font is Postscript version (Mac and Win). Use it as usual. But, on Photoshop, on font specifications, set in 16 pt and select \"No smothing\" or \"Net\" (I don't know how it is in english version, but I put a screen shoot). Of course, Zoom must be set at 100 %. This font are well on Flash too.   \nI have a question: I want generate TrueType or OpenType version. But for that, I must embed bitmap infos into font. How can I do that ? I know BitFonter, but I don't have this soft (it's too expensive for me for the moment). Do you know a free utility able to do that ? or a tips ? I work on Mac (OS9 and X), on PC (wind XP), I have Fontographer & Fontlab 4.6.   \n ![ecran1](http://web.archive.org/web/20150317114410im_/http:/www.typophile.com/forums/messages/29/20699.gif)   \n   \nStephen: Thanks for your remark, I try something to change 'v' & 'w'.   \n----------------   \n   \nI think that designing this kind of font are very cool (educational) for those who want learn type design.\n\n"
    },
    {
      "time": "18 Nov 2003 — 8:55am",
      "content": "\\> This is a screen font, bitmap font, no grayscale.   \n   \nFYI: Truth in Design now has a way to deliver grayscale _bitmap_ fonts reliably and portably.   \n   \nIf you want to make embedded (true) bitmap fonts:   \n1) For MacOS you can't any more.   \n2) For Windows you don't absolutely need BitFonter (unless you're making grayscale bitmaps), all you need is a free MS utility called SBIT.   \n   \n\\> designing this kind of font are very cool (educational) for those who want learn type design.   \n   \nI agree - although many \"classical\" designers don't - some of them even think you have to be right-handed, if you know what I mean... My first fonts were 8x8 bitmaps for Armenian and Arabic on a C64.   \n   \nhhp\n\n"
    },
    {
      "time": "18 Nov 2003 — 12:31pm",
      "content": "\\> 1) For MacOS you can't any more.   \nWhy not ? May be with BitFonter ?   \n   \n\\> 2) For Windows you don't absolutely need BitFonter (unless you're making grayscale bitmaps), all you need is a free MS utility called SBIT.   \nThanks for the info.   \n   \n\\> I agree - although many \"classical\" designers don't - some of them even think you have to be right-handed, if you know what I mean...   \nI know, but I never said it was the only thing to do to learn type design.   \n   \nHere is new image with new design of v, w, x in lc and cap.   \n ![Mr_pixel_v2b](http://web.archive.org/web/20150317114410im_/http:/www.typophile.com/forums/messages/29/20730.gif)   \n   \nAbout my PC Type1 version, there is something of strange: when I open my Fog file (native Mac) on PC, the bitmap which I had generated into 16 pt on Mac are now in 12 pt on PC. But all seems ok when I set in 16 Pt in photoshop for example. Idea ?\n\n"
    },
    {
      "time": "18 Nov 2003 — 5:55pm",
      "content": "\\>16 pt on Mac are now in 12 pt on PC   \n   \nChristophe, you may be running into the 96ppi vs 72ppi display difference on the two platforms. Essentially because Windows use 96ppi to figure out how to draw stuff, things come out looking smaller than on a Mac. How to get past this problem in producing a font like this is beyomd me. Hrant may have some good insight into the size difference and how to compensate / allow for it in your production.   \n   \nI like this face - it's quite nice, and I think that Hrant may be right: useful for text at high resolutions.   \n   \nJon\n\n"
    },
    {
      "time": "18 Nov 2003 — 6:18pm",
      "content": "\\> Why not ? May be with BitFonter ?   \n   \nAs far as I know contemporary MacOS only supports outline fonts, and furthermore ignores any bitmaps TT fonts might have embedded. But maybe I'm wrong?   \n   \nAs for the nominal-dpi difference between platforms, there's not much you can do: a 16 PPEM font will be seen in [default] Windows as \"12 point\". But Photoshop in Windows will see it as 16 point _if_ the document you're working has its dpi set to 72.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Nov 2003 — 9:00am",
      "content": "Hrant: yeah some pretty whacky stuff with bitmap fonts. I'm using Mac OS X 10.3 and my system sees Silkscreen and displays it properly and without anti-aliasing at 8pts. But won't see Sevenet at all, list it or display it. Both are identified as the same kind of font file.   \n   \n:-( progress   \nJon\n\n"
    },
    {
      "time": "25 Nov 2003 — 6:32am",
      "content": "\\> As far as I know contemporary MacOS only supports outline fonts, and furthermore ignores any bitmaps TT fonts might have embedded. But maybe I'm wrong?   \nI think it's possible. Read this interesting Adobe's page about AAT:   \n [http://developer.apple.com/fonts/TTQualSpec/QS05/FQS5.html](http://web.archive.org/web/20150317114410/http:/developer.apple.com/fonts/TTQualSpec/QS05/FQS5.html)   \n   \nChristophe\n\n"
    },
    {
      "time": "25 Nov 2003 — 1:56pm",
      "content": "I don't know...   \nMaybe that's only for AAT fonts? BTW, are those fully supported now?   \n   \nAt the very least I'm pretty sure MacOS doesn't support grayscale fonts (except for the kind Truth in Design is now making). And isn't it true that you can't turn off anti-aliasing? Where does that leave bitmap fonts that have outline counterparts?   \n   \nhhp\n\n"
    },
    {
      "time": "30 Nov 2003 — 2:26am",
      "content": "Bonsoir Christophe ettoutlemonde,   \n   \nTRUTH in Design will sort out how to use grayscale bitmap fonts all over MacOS. Until then, as reported, they work great in Flash and Photoshop.   \n   \nThe trouble is, there is no cross-platform bitmap font standard except TrueType and OpenType pixel fonts. Even MacOS which gave us brilliant post-PARC typography ( [http://www.kare.com/MakePortfolioPage.cgi?page=4](http://web.archive.org/web/20150317114410/http:/www.kare.com/MakePortfolioPage.cgi?page=4)) has now abandoned its bitmap font heritage. shame. Upside is, if they support pixel sizes, they have to support pixel fonts. Details to be posted to this board. As far as bitmap\\<-\\>outline correlation, it may have to be handled by the designer, not insensitive operating systems and apps.   \n   \nTiD wants to publish MR. PIXEL. Qu'en pensezvous M. Badani?\n\n"
    },
    {
      "time": "30 Nov 2003 — 10:57am",
      "content": "\\> TRUTH in Design will sort out how to use grayscale bitmap fonts all over MacOS.   \n   \nAnd Windows too!   \n   \nhhp\n\n"
    },
    {
      "time": "17 Nov 2003 — 12:30pm",
      "content": "I'm on a 15inch Powerbook at 1280x845. I don't know what   \nthat is in PPI, but it looks great to me. Too large for body   \ntext, though. Maybe not on John's fancy display.   \n   \nThe only glyphs that distract are the 'v' and 'w'. Where they   \nget to be 1 pixel stroke widths it looks like a gradient to a   \nlighter gray. Perhaps you can avoid this with by getting   \ncreative with their shapes.   \n   \nBut as Hrant will tell you, 2-pixel stem widths make for   \ngood pixel font readability, so nice job!\n\n"
    },
    {
      "time": "18 Nov 2003 — 12:57pm",
      "content": "Nice solutions on the v, w, christophe. I thought you might   \nhave to change the design, but you managed to keep the   \nshape and gain uniform weight. Only the cap W seems a bit   \nbottom heavy, but I think it's the best you're going to get.\n\n"
    }
  ]
}
