{
  "id": "20821",
  "title": "~~A PIXEL AT A TIME~~",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "\"To design is to communicate clearly by whatever means you can control or master.\" –&nbsp;Milton Glaser\n\n\"Art has to move you and design does not, unless it's a good design for a bus.\" –&nbsp;David Hockney\n\n\"Both optimists and pessimists contribute to our society. The optimist invents the airplane and the pessimist the parachute.\" –&nbsp;Gil Stern\n\n\"Design is a plan for arranging elements in such a way as best to accomplish a particular purpose.\"&nbsp;–&nbsp;Charles Eames\n\n\"It's not what you look at that matters, it's what you see.\" – Henry David Thoreau\n\n\"In art the hand can never execute anything higher than the heart can inspire.\" –&nbsp;Ralph Waldo Emerson\n\n\"Painting is poetry that is seen rather than felt, and poetry is painting that is felt rather than seen.\" –&nbsp;Leonardo da Vinci\n\n\"The visual image is a kind of tripwire for the emotions.\" –&nbsp;Diane Ackerman\n\n\"Designers can create normalcy out of chaos; they can clearly communicate ideas through the organising and manipulating of words and pictures.\" –&nbsp;Jeffery Veen\n\n\"Design is in everything we make, but it’s also between those things. It's a mix of craft, science, storytelling, propaganda, and philosophy.\" –&nbsp;Erik Adigard\n\n\"A common mistake that people make when trying to design something completely foolproof is to underestimate the ingenuity of complete fools.\" –&nbsp;Douglas Adams\n\n\"Life beats down and crushes the soul and art reminds you that you have one.\" –&nbsp;Stella Adler\n\n\"Design in art, is a recognition of the relation between various things, various elements in the creative flux. You can't invent a design. You recognize it, in the fourth dimension. That is, with your blood and your bones, as well as with your eyes.\" –&nbsp;D. H. Lawrence\n\n\"Delay always breeds danger; and to protract a great design is often to ruin it.\" –&nbsp;Miguel de Cervantes\n\n\"There is always a heavy demand for fresh mediocrity. In every generation the least cultivated taste has the largest appetite.\" –&nbsp;Paul Gauguin\n\n\"Design, in its broadest sense, is the enabler of the digital era - it's a process that creates order out of chaos, that renders technology usable to business. Design means being good, not just looking good.\" –&nbsp;Clement Mok\n\n",
  "author": "jesse stagg",
  "time": "21 Jun 2006 — 12:13am",
  "uid": "13511",
  "comments": [
    {
      "time": "21 Jun 2006 — 2:23am",
      "content": "Hi Jesse,\n\nsorry about the loss of your data, but i am afraid you won't find much sympathy with this kind of request here.\n\n<cite>I’m trying to replenish cool textures, vector sets, fonts, basically anything that’s beautiful and useful.<br>\nPlease don’t hesitate to hit me up with any juicy links or if you want to send me anything directly, please feel free.</cite>\n\nThis just sounds \"arrrgh, Pirate\" to me. If you purchased licenses for your fonts etc you shouldn't have a problem in getting new copies. But hey, maybe you are a good guy and i am just paranoid...\n\n"
    }
  ]
}
