{
  "id": "2083",
  "title": "Cerulean",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I'm working on extending my logotype into a whole font. The A and E will probably be alternates for proper capitals, I suppose. What do you think so far?   \n   \n ![Cerulean](http://web.archive.org/web/20131017043256im_/http:/www.typophile.com/forums/messages/29/20509.gif)\n\n",
  "author": "cerulean",
  "time": "14 Nov 2003 — 9:03pm",
  "uid": "2462",
  "comments": [
    {
      "time": "15 Nov 2003 — 12:05am",
      "content": "Wow, very nice. I always had a preference for those 'flowery' types. I'm a big fan of Jugendstil and this reminds me a bit of that.   \nI would make this one type. I think you can mix the lc a and e with the UC.   \nI love the R.   \n   \nI'm very interesed in the numerals.   \n   \nRegards,   \nRen\n\n"
    },
    {
      "time": "15 Nov 2003 — 5:14pm",
      "content": "I would try a different F. That one looks\n\n"
    },
    {
      "time": "17 Nov 2003 — 5:19pm",
      "content": "Numerals:   \n   \n ![cerulean numerals](http://web.archive.org/web/20131017043256im_/http:/www.typophile.com/forums/messages/29/20673.gif)   \n   \nI had been very fond of that F, in a purely platonic and typographical way. Freud ruins everything.\n\n"
    },
    {
      "time": "18 Nov 2003 — 12:12am",
      "content": "Kevin, they are great. I will not criticize the style. I think the irregularities of the type gives it it's charme.   \nI would maybe only change the upper serif of the UC F a little. It's to agressiv sticking forward. Just a little that you don't see the difference with the UC T.   \n   \nPerhaps make the horizontal leg of the 2 a little longer. It needs a bit more balance.\n\n"
    },
    {
      "time": "2 Jan 2004 — 4:44am",
      "content": "The extent of my progress to date:   \n   \n ![Cerulean](http://web.archive.org/web/20131017043256im_/http:/www.typophile.com/forums/messages/29/23230.gif)\n\n"
    },
    {
      "time": "5 Jan 2004 — 5:05pm",
      "content": "I think this is a rare instance where unicase is justified - and it seems well conceived.   \n   \nClotting: I don't see any in the \"e\" or \"P\", but there is some at the bottom-right of the \"&\".   \n   \nAnd yeah, the \"@\" is malformed.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jan 2004 — 3:28pm",
      "content": "Gave the VWXY area more curvy flair, made alternate R, tapered stroke of & to unclot corner.   \n   \n ![Cerulean](http://web.archive.org/web/20131017043256im_/http:/www.typophile.com/forums/messages/29/23987.gif)   \n   \nStill working on the issues I have with the @. Thanks for all your help so far.\n\n"
    },
    {
      "time": "14 Jan 2004 — 12:30pm",
      "content": "These are really beautiful forms, Kevin. I love the new V.   \n   \nI also liked the old (excited) F, though it somehow didn't feel right; maybe making the arm (is it called an arm?) curve in the opposite direction could work, or even giving it some of the swaying movement of the A. Could make an interesting alt. Or maybe you could take a middle-of-the-road approach and make the F just a little bit excited. That would be nice too.   \n   \nI might suggest flaring the stem base of the A just a tiny, tiny bit to the right; at the moment, it gives me this feeling that it's one of those paisley amoeba whatsits.   \n   \nFinally, something about your $ is bugging me; it looks more or less like a speared S rather than a symbol in its own right.   \n   \nCheers! I look forward to the completion of this face; I already have some ideas of where I might use it. \\*sinister chuckle\\*\n\n"
    },
    {
      "time": "2 Jan 2004 — 8:50am",
      "content": "Is your \"Commercial At\" round enough. Is the left side too flat going round to the left and down? While I admire the R, will you run into some weird spacing issues? The way some of your bowls aren't conventionally shaped, such as the e and the P ... Hrant would maybe call the clotting but I think that is a negative term in this instance ... Should you have more of the rounding or filling in of the shapes in your N and M or X and Y? Do your joins end in too sharp a point?   \n   \nVery interesting I can almost feel the Art Nouveau coming through, but your shapes aren't Art Nouveau.\n\n"
    }
  ]
}
