{
  "id": "20859",
  "title": "Kilo Records - Independent Label",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello all,\n\nI've been lurking on these forums for a short while now and have finally decided to post something of mine. This a logo for Kilo Records, a label that a friend of mine and myself are running and we'll be the spotlight band for now. However we want to be able to release things without being restricted to a particular genre, so I tried to go for an ecclectic feel. It's working really well for me right now but maybe some of you could shed some outside insight that could improve upon the design.\n\nI designed these from scratch using faces like Cooper Black and Sauna for reference. I might need to add \"records\" underneath the logo but since I can't afford Sauna I'd probably have to make the letters for that. Does anyone think that this part of the name would be necessary or not?\n\nOK, well thanks for your time,\n\nMike\n\n| Attachment | Size |\n| --- | --- |\n| [kilologo.jpg](http://web.archive.org/web/20131023142034/http:/typophile.com/files/kilologo.jpg) | 27.91 KB |\n\n",
  "author": "kostal",
  "time": "22 Jun 2006 — 10:18am",
  "uid": "10612",
  "comments": [
    {
      "time": "22 Jun 2006 — 10:30am",
      "content": "I kinda like it but I miss the base of the <cite>l</cite>. You might work it in and let it all join together.\n\nI don’t think you need rekids. Now someone will disagree with me.\n\n"
    },
    {
      "time": "22 Jun 2006 — 10:35am",
      "content": "Hello. Welcome to the forum.\n\nI can see where you are going, but I think in the process you've created two ligatures instead of one smooth word.\n\n- You could exaggerate the terminal on the K more rounder) so it reads as a dot on the i more.  \n- You could continue the exit on the i into the l as some scripts do.  \n- You could eilimate the connections and just make the serifs more script like.  \n- The lo is not working and reads more as an odd letter b  \n- The connection of the Ki ... maybe re-visit how Sauna italic exits and enters on the strokes. Also take into consideration Bello.\n\nI appreciate the desire to depart and make it more ownable and hope my comments help in some way.\n\n"
    },
    {
      "time": "22 Jun 2006 — 11:17am",
      "content": "Thanks Miss Tiffinay, this my first real whack at doing custom lettering digitally like this. Bezier curves aren't exactly my strong point quite yet. So part of my excitement with this logo is simply that curves look nice. To me, anyway.\n\nI really appreciate the comments though and I'm going to check into a many of them and report back. I don't quite understand this suggestion though \"You could eilimate the connections and just make the serifs more script like.\" Or maybe it's that I don't want to have the letters sepearte.\n\nWith this version I like that there's a certain ambiguity about the serifs but I don't particularly want to seperate the characters. One thing I was thinking about trying was making some sort of tail on the top of the l to make it appear more like a cap. Maybe this could help distinguish it from being a \"b\"?\n\nWell, like I said this is still fairly new, so I might not be totally quick with an update but in a day or two I should have something new to show. More comments are welcome, I'm very friendly in discussion and just want to push it until the best result is there. Thanks again.\n\n"
    },
    {
      "time": "22 Jun 2006 — 12:04pm",
      "content": "I'm not a big fan of reworking other people's ideas, but in the interest of clarity, this is what I was getting at. Curves are a mess, but you get the idea.\n\n ![](http://web.archive.org/web/20131023142034im_/http:/typophile.com/files/kilologo_3572.gif)\n\n"
    },
    {
      "time": "22 Jun 2006 — 12:37pm",
      "content": " ![](http://web.archive.org/web/20131023142034im_/http:/typophile.com/files/kilologo2_5728.jpg)\n\nHere's a little progress. I actually do like the way you have it worked, I must've just wrote that off when I thought of connecting them all. For some reason I liked the idea that they were acting as sepearte ligatures. That is a nice result Jupiter, perhaps I'll try that myself.\n\n"
    },
    {
      "time": "22 Jun 2006 — 1:19pm",
      "content": "Just explaining myself. You have solved the issue of the <cite>lo</cite> looking like a <cite>b</cite>. Good luck with it. I do think you will find that it will be a very versatile mark. Cheers.\n\n"
    },
    {
      "time": "26 Jun 2006 — 9:35am",
      "content": "Here's the latest:\n\n ![](http://web.archive.org/web/20131023142034im_/http:/typophile.com/files/kilologo10_4004.jpg)\n\n"
    },
    {
      "time": "27 Jun 2006 — 10:03am",
      "content": "This one reads better. The counter feels a little stiff and geometric. The joins between the \"il\" and \"lo\" have a difference in weight that throws me off a bit.\n\nLook at the curves at the top of the \"l\" and the bottom of the \"K\" leg—a bit rough.\n\nIt keeps getting better, and I can see your skill with the curves improving.\n\nHope this helps. I wish someone else would comment as I may be influencing this too much.\n\n"
    },
    {
      "time": "27 Jun 2006 — 10:56am",
      "content": "(Doing a good job so far James), the various iterations mean that the K needs some work it is too soft and rubbery now the leg seems to be swamping the i I think if you made the vertical a bit more vertical like the l you could start the sweep of the leg earlier and bring it lower down to make more of a curve up into the l. I would also try making the i dot more like the counter of the o.  \nTim\n\n"
    },
    {
      "time": "27 Jun 2006 — 11:40am",
      "content": "[http://www.typeworkshop.com/index.php?id1=type-basics&id2=&id3=&id4=&id5...](http://web.archive.org/web/20131023142034/http:/www.typeworkshop.com/index.php?id1=type-basics&id2=&id3=&id4=&id5=&idpic=15#pictloader \"http://www.typeworkshop.com/index.php?id1=type-basics&id2=&id3=&id4=&id5=&idpic=15#pictloader\")\n\nI assume you've seen this, but just in case.\n\n"
    },
    {
      "time": "27 Jun 2006 — 4:10pm",
      "content": "James,\n\nthanks for the link to typeworkshop, i wasn't aware of that site before...\n\nSeb\n\n"
    },
    {
      "time": "28 Jun 2006 — 3:49pm",
      "content": "yep, i've seen that link (great site!) and also have leslie carbagas lettering bible which has some helpful bezier instructions too.\n\ni agree about the joins and i'm going to experiment with the letters some more.\n\nonce again i appreciate the comments and i'll see if i can further it a long just a bit.\n\n"
    },
    {
      "time": "28 Jun 2006 — 4:28pm",
      "content": "like where this is going. fun! a few thoughts.\n\n ![](http://web.archive.org/web/20131023142034im_/http:/typophile.com/files/kilologo10_4004tkw_3763.gif)\n\n"
    },
    {
      "time": "10 Jul 2006 — 2:14pm",
      "content": "well, i've been working out the letters. they are still not quite right to me, but i've finally gotten to a point i feel better about. it's getting closer to being finished, but i've got to work on the i stem right now (and then the others... again).\n\ni also want to try to smooth out the curves a bit more. it took me a long time to be satisfied with arm of the k and the dot of the i. it was stumping me for a while. anyway your help is letting me take this to more satisfying results, i really appreciate it. thank you. i'll try not to take advantage of you guys ;)\n\n ![](http://web.archive.org/web/20131023142034im_/http:/typophile.com/files/kilonew_5298.png)\n\n"
    },
    {
      "time": "10 Jul 2006 — 3:05pm",
      "content": "This is getting there. Really. I do think you need more separation (not complete) between the K and the i ... and perhaps decide if you like the join thickness between the il or the lo.\n\n"
    },
    {
      "time": "10 Jul 2006 — 3:17pm",
      "content": "Way to stick with it. You seem to see what it is boiling down to. Tiffany's comments are good. I would add that I would prefer to see a stronger relationship between the counter of the \"o\" and the dot of the eye.\n\nYou are getting the curves refined to the point that you will probably need to post a PDF to get better criticism.\n\nGood job and good luck with your venture!\n\n"
    },
    {
      "time": "11 Jul 2006 — 1:58am",
      "content": "\\>and perhaps decide if you like the join thickness between the il or the lo\n\nGo with the thickness of il, the lo is starting to look anaemic.  \nTake advantage of us no-one is forcing us to reply to your post:)\n\nTim\n\n"
    },
    {
      "time": "11 Jul 2006 — 6:32am",
      "content": "And I, for one, maintain a functional turntable ; )\n\n"
    },
    {
      "time": "13 Jul 2006 — 11:53am",
      "content": "Ditto. Miss Tiffany, is this what you meant by more seperation?\n\n ![](http://web.archive.org/web/20131023142034im_/http:/typophile.com/files/kilonew2_5622.png)\n\nIt's close now. I'll try to post a pdf later tonight if you all think it would help.\n\n"
    },
    {
      "time": "13 Jul 2006 — 12:22pm",
      "content": "Yes. But I'd take it a little further, or, you could raise the line in between the il and lo combinations. Does the K seem a little too heavy for the other three letters?\n\n ![](http://web.archive.org/web/20131023142034im_/http:/typophile.com/files/morelikezeez_6176.gif)\n\n"
    },
    {
      "time": "13 Jul 2006 — 1:14pm",
      "content": "That's funny, I tried lowering the \"ki\" space to the others but not the opposite. d'oh. I'm not sure about the K, it could probably lose some fat but I really like the way it's working as the dot and the arm right now. I'll experiment some more when I get back home tonight.\n\n"
    },
    {
      "time": "13 Jul 2006 — 1:26pm",
      "content": "I like the K as well. You could always try adding weight to the other three.\n\n"
    },
    {
      "time": "18 Jul 2006 — 3:07pm",
      "content": " ![](http://web.archive.org/web/20131023142034im_/http:/typophile.com/files/kilo2_4251.png)\n\nhey all, i've been kind of sitting on this a while. i was wondering what you're opinion is of these reincarnations. the most current is on top. i thought i might have been on to something with the middle one but i was getting a lot of swooshes and right now i think someone fresh to it might read it as something else entirely. and i don't really dig the cavity it makes. but i'm not sure if stripping it more basic (top) makes it better. i had to try some other options though besides the ki ligature. which do you find most compelling, or is their one you feel stronger about than the others? what would make it better? thank you kindly.\n\n"
    }
  ]
}
