{
  "id": "20854",
  "title": "bootround font",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I have recently done that and need some feedback.  \nI have couple of ideas for fonts and I may lack of patience a little bit and mostly experience.\n\n| Attachment | Size |\n| --- | --- |\n| [bootround\\_big.jpg](http://web.archive.org/web/20150123184620/http:/typophile.com/files/bootround_big.jpg) | 56.74 KB |\n| [aria.jpg](http://web.archive.org/web/20150123184620/http:/typophile.com/files/aria.jpg) | 17.51 KB |\n\n",
  "author": "bootchec",
  "time": "22 Jun 2006 — 7:23am",
  "uid": "11252",
  "comments": [
    {
      "time": "26 Jun 2006 — 1:17am",
      "content": "No one even dislikes it? Or already burried?\n\n"
    },
    {
      "time": "26 Jun 2006 — 3:05am",
      "content": "I like it. Can you typeset a small text in it? Some characters can be hard to read...  \nPieter\n\n"
    },
    {
      "time": "26 Jun 2006 — 6:17am",
      "content": "Oh sorry I should have done it at first :)\n\nI find it difficult to read as well :(\n\n"
    },
    {
      "time": "27 Jun 2006 — 6:47am",
      "content": "A few characters are hard to read. A and R are for example almost the same. I know the text you used but wasn't able to read it at once...  \nP\n\n"
    },
    {
      "time": "3 Jul 2006 — 3:41am",
      "content": "Thanks. Any suggestions what I can do to make this font working better in terms of readability? It works fine for me for short words or as a single characters but for something longer it is simply annoying.\n\n"
    },
    {
      "time": "13 Jul 2006 — 12:45am",
      "content": "It will probably never become somthing that is good for more that 4 or five words on maybe a slightly longer book title. But you could attempt to make it a little easier to read. And a lower case would round it out nicely. However, I am having trouble assessing what I think because the rendering of each glyph is sort of small. The way you handle the slightly curved portions isn't that clear as it is. Can you post a few letters 300% larger? Or post a PDF?\n\n"
    },
    {
      "time": "14 Jul 2006 — 2:47am",
      "content": "There is new bigger file attached to first post.  \nUnfortunatelly you're right with the length. Bigger looks better indeed, haven't thought about that before. Anyway I have no clear idea for lower case. As I said I have no experience on that field so it comes to me quite difficult to imagine possible changes/improvements.  \nI have played with A a little bit, although it does not look as I initially wanted to (it all started from letter A) but it looks better I think.\n\n"
    },
    {
      "time": "1 Aug 2006 — 1:57pm",
      "content": "Now I can see what happening I do have several things to offer you: take them or not.\n\nI am not sure that I like the 'bitten' quality of some of the openings where one shape has been cut from another. Some places like the upper end of low tail of the the L seem to benefit from this approach. But the bottom of your M it seems like a problem. And I don't know if it helps the opening under the A either.\n\nMaybe instead of making the R so round you should bring the arm in. Or cut a bite in the right side.\n\nI would like to see the Y being built out of the forms I see in the D. That vertical width.\n\nLooking at the comma I wonder if it can be at an angle, why not the arm of the R? Or maybe the comma should be build up from squares too...\n\nThis is all to suggest that there are many more ways of making these forms & that I want to encourage you to keep trying things. I think you might try 3 or 4 more possibilities for each letter and look for ways of creating a bit more harmony between them. There is always going to be some tension in a font like this between the 'rules' you have set for yourself to build the font & the needs of the eye. When in doubt - go with the eye.\n\nI hope this is helpful.\n\n"
    }
  ]
}
