{
  "id": "20861",
  "title": "Fenice with Small Caps",
  "forum": "Design",
  "tags": [

  ],
  "content": "Does anybody know of a version of Fenice with genuine small caps?  \nTim\n\n [‹ TYPE BATTLE: Week 14 (5 June)](http://web.archive.org/web/20081007163334/http:/www.typophile.com/battle14 \"Go to previous forum topic\") [Looking for modern face, please help ›](http://web.archive.org/web/20081007163334/http:/www.typophile.com/node/20872 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007163334/http://www.typophile.com/user/2289\" title=\"View user profile.\">timd</a>",
  "time": "<br>",
  "uid": "2289",
  "comments": [
    {
      "time": " 23.Jun.2006 6.46am",
      "content": "Alright how about a similar face?  \nTim\n\n"
    },
    {
      "time": " 23.Jun.2006 9.12am",
      "content": "What is it that you like about Fenice? There are many Didone fonts with small caps, which you probably know already, but I’m curious what about Fenice do you like maybe there is something more similar than simply a Didone.\n\n"
    },
    {
      "time": " 23.Jun.2006 9.25am",
      "content": "Unfortunately Fenice is the corporate font of the client, I like it but I’m not deeply in love with it. The client has decided that small caps are the way to go and I’d like to prevent a crime against type, I can’t tell you the client’s name but they are a clothing company (no guesses I’m not allowed to answer:).  \nTim\n\n"
    },
    {
      "time": " 23.Jun.2006 9.42am",
      "content": "Oh. Well, that makes a difference. Let’s see what can be found.\n\n"
    },
    {
      "time": " 23.Jun.2006 9.53am",
      "content": "Can you use all small caps? Meaning, do you have to have a cap followed by small caps? How is it to be used? Paragraph form?\n\n ![](http://web.archive.org/web/20081007163334im_/http:/www.typophile.com/files/fakedfenicecaps_4745.png)\n\n"
    },
    {
      "time": " 23.Jun.2006 9.54am",
      "content": "Everything is a bit wide. New Caledonia or the Lanston Bodoni Bold might work. Storm’s Walbaum is nice as well.\n\n"
    },
    {
      "time": " 23.Jun.2006 9.58am",
      "content": "Main style will be for heads and instore announcements, not accompanied by body copy, initial – large cap rest of the word –&nbsp;small cap. I investigated mixing weights which I can sometimes get away with with other fonts but the differences are too great.  \nTim\n\n"
    }
  ]
}
