{
  "id": "20897",
  "title": "Classic \"I Want You For U.S. Army\" Uncle Sam recruitment poster",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "| Attachment | Size |\n| --- | --- |\n| [letters.jpg](http://web.archive.org/web/20150312080503/http:/typophile.com/files/letters.jpg) | 126.42 KB |\n\n",
  "author": "kylehickman",
  "time": "24 Jun 2006 — 7:23am",
  "uid": "1860",
  "comments": [
    {
      "time": "24 Jun 2006 — 7:26am",
      "content": "Here is all the type from the poster.\n\n ![](http://web.archive.org/web/20150312080503im_/http:/typophile.com/files/Sam_3940.jpg)\n\n"
    },
    {
      "time": "24 Jun 2006 — 7:31am",
      "content": "That actually looks like it was hand lettered, or else my eyes are blurry. However, [FF DIN](http://web.archive.org/web/20150312080503/http:/www.myfonts.com/fonts/fontfont/ff-din/) has most of the same characteristics.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "24 Jun 2006 — 8:02am",
      "content": "Gotham & Condensed is nice too\n\n[http://www.typography.com/catalog/gothamcondensed/index.html](http://web.archive.org/web/20150312080503/http:/www.typography.com/catalog/gothamcondensed/index.html \"http://www.typography.com/catalog/gothamcondensed/index.html\")\n\n"
    },
    {
      "time": "24 Jun 2006 — 9:44am",
      "content": "Definitely not hand-lettered--look at the A's--all the same and so are the rest of the repeating characters. Probably out of someone's case a long time ago. Nice, though, does remind of Gotham.\n\n"
    },
    {
      "time": "24 Jun 2006 — 9:50am",
      "content": "Your suggestions lead me to Interstate as well. Not exact – especially not the M – but the overall feel is similiar.\n\nLet me know if you find anything closer.\n\nThank you!\n\n"
    },
    {
      "time": "24 Jun 2006 — 10:00am",
      "content": "I think it was handlettered, extremely well.\n\n"
    },
    {
      "time": "24 Jun 2006 — 10:43am",
      "content": "Getting consistent lettershapes when doing lithographic artwork was fairly easy — the artist would use a type of transfer (meaning he or she would draw a letter and using appropriate paper to transfer to and reapply on the stone or zinc plate). So: handlettered & clean!\n\n"
    },
    {
      "time": "24 Jun 2006 — 12:13pm",
      "content": "I l know, used to do it myself and my grandfather was a sign painter. But look at the negative space in the \"A\" at different sizes and the blob at the end of the top crossbar of the \"E.\"\n\nI too, thought it was hand lettered the first time I looked at it with the asymetrical \"A's\" and the bugling bottom curve of the \"O's\", and it is very beautiful. But when I look very closely at it, it just feels \"set\" to me.\n\n"
    },
    {
      "time": "24 Jun 2006 — 12:18pm",
      "content": "Okay, I looked at it again and I'm waffling--it's impossible on a computer screen. If it is hand done, it is very good.\n\n"
    },
    {
      "time": "24 Jun 2006 — 1:50pm",
      "content": "I think it was hand lettered. There are slight, yet noticeable inconsistencies between repeating characters.\n\n"
    },
    {
      "time": "24 Jun 2006 — 3:10pm",
      "content": "That was a time of crafts-people, not to say we aren't, that could wield a mean paint brush. Some of the work that Dwiggins did, for example, is quite astonishing.\n\n"
    },
    {
      "time": "24 Jun 2006 — 6:17pm",
      "content": "Yeah, I have some photos of my grandfather's work--just beautiful. Then he taught my father and when I was very young, I used to watch him in amazement. He loved when they invented magic markers. Then he taught me. And one day he watched me cut a silkscreen frisket in Souvenir (sorry) and he was so proud.\n\n"
    },
    {
      "time": "24 Jun 2006 — 9:01pm",
      "content": "In the old days, when they did lithographed posters like this, they did not use type at all. Everything--even small print--was done by hand. It was not like it is now when practically anything that looks like type almost always is. There were, in fact, practical reasons why they did not use type.\n\nFirst, type was available only in specific sizes, up to about an inch tall for metal, larger for wood. Even so, if the type was a little too big or too small, tough luck. Theoretically, you could photograph the type and enlarge or reduce it, but that was too complicated and expensive at the time. Instead, there was a whole army of lettering artists ready to step in whenever you wanted greater control over how your letters looked, including the simple (to us) case of making them fit nicely into a layout. These people became all but obsolete when phototype, stat cameras, and offset printing became the norm.\n\nSecond (and more important), posters like this were made by drawing or painting the art actual size onto lithographic stone. (Hint: lith = stone, graph = draw). You couldn't use metal or wood type to put letters on a lithographic stone because the surface is hard and smooth. Type was designed to work with the soft, absorbent surface of paper. Even if you could have used type, the image would be backwards from what you need. The art on lithographic stones had to be wrong-reading so that when it was transfered to paper it would be right-reading. Type printed onto stone would thus be backwards from what was needed.\n\nSorry for the lecture, but I sense that there seems to be somewhat of a lack of knowledge concerning graphic arts history here.\n\nShort answer: Most letters on posters made before the 1950s were done by hand, even when it looks an awful lot like type.\n\n"
    },
    {
      "time": "25 Jun 2006 — 12:36am",
      "content": "Mark (above) answered the issue pretty well.\n\nFor future font-finding reference, myfonts.com has a really nifty font-identification app called \"Whatthefont.\"\n\nYou upload a jpeg of the font, walk it through identifying the letters themselves, and then it tries to match it based upon its database of known fonts. It hasn't failed me yet.  \n+  \nRyan Ford\n\n"
    }
  ]
}
