{
  "id": "20902",
  "title": "designers who think they know it all",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "this could possibly be considered a parody thread of the “non-design” question.\n\nthough ... we’ve all had to deal with one, and at times I’m sure we’ve all been one.\n\nsurely it affects our image as creative thinkers and visual communicatiors.\n\n [‹ you know you're a typoholic when...](http://web.archive.org/web/20081021101624/http:/typophile.com/node/20733 \"Go to previous forum topic\") [An interesting blackletter graffiti ›](http://web.archive.org/web/20081021101624/http:/typophile.com/node/20934 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081021101624/http://typophile.com/user/13171\" title=\"View user profile.\">Ratbaggy</a>",
  "time": "<br>",
  "uid": "13171",
  "comments": [
    {
      "time": " 24.Jun.2006 7.54pm",
      "content": "Nice one. :-)\n\n"
    },
    {
      "time": " 24.Jun.2006 8.11pm",
      "content": "Hmmm.... This is very tempting, but I’ve had a heart to heart with “Norbert”. Please be nice and civil to one another. I’ll pass on this... for now!\n\nER\n\n"
    },
    {
      "time": " 25.Jun.2006 12.23am",
      "content": "My ex-boss is a great example for this thread...  \nHe used to stretch a Helvetica Black Condened to 200% instead of using Helvetica Black Extended. He used RGB-images at 72 dpi & blew them up to somewhere between 150 & 200% (in Quark, not changing the image size in Photoshop). It’s a miracle the company survived so long ;-)  \nAt one point, I started keeping a log of all the things he f\\*cked up, but after only a few days I had to give that up because it was far too time-consuming.  \nOh, and he always used the bold/italic/...-“styles” instead of the proper fonts. Any idea how ugly a bold, italic University Roman looks like?\n\n"
    },
    {
      "time": " 25.Jun.2006 12.30am",
      "content": "The horror...\n\n+  \nRyan Ford\n\n"
    },
    {
      "time": " 25.Jun.2006 12.32am",
      "content": "Well, I just saw some work earlier today from a designer I still had an ounce of professional respect for.\n\nHe had taken type and Photoshop-beveled the hell out of it. When I asked him about the reasoning behind such an atrocity, he proclaimed it was to create the illusion of depth, acting as though I was a fool for not seeing the obvious answer.\n\n+  \nRyan Ford\n\n"
    },
    {
      "time": " 25.Jun.2006 2.05am",
      "content": "Hahaha. Yes. foo.\n\n—————  \n**Paul Ducco**  \n [Solid Creative](http://web.archive.org/web/20081021101624/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 25.Jun.2006 10.57am",
      "content": "Thinking you know it all is a bad trait for a designer. Being  \nafraid of ’getting it wrong’ is possibly even worse.\n\nPhil\n\n"
    },
    {
      "time": " 25.Jun.2006 12.43pm",
      "content": "Phil: Nicely put. In addition to these things to avoid ( there may be more) what advice to do you positively assert?\n\n"
    },
    {
      "time": " 25.Jun.2006 1.10pm",
      "content": "Thinking you know it all is a bad trait in any kind of person. If you cannot question yourself, you are capable of some scary things…\n\nDeep down I don’t think anyone really thinks that anyway, it’s primarily a defense mechanism for insecuriity. The problem is if you think you know it all you may never realize what the real problem is.\n\nThe ego and insecurity are forever bound…\n\nTo a large degree I think that’s what the dance called design is all about.\n\npeace\n\n"
    },
    {
      "time": " 25.Jun.2006 3.05pm",
      "content": "_Thinking you know it all is a bad trait in any kind of person._\n\nPaul, you are entirely correct: only truly ignorant people believe that they know everything that can be known about a particular subject or subjects: every truly intelligent person I have ever known has not been afraid to admit his or her ignorance on a great many subject, even their own fields of expertise.\n\nIgnorance is no crime: we are all born ignorant, and overcome it to varying degrees as we grow...\n\n"
    },
    {
      "time": " 25.Jun.2006 9.31pm",
      "content": "This discussion has become interesting. good one.\n\n—————  \n**Paul Ducco**  \n [Solid Creative](http://web.archive.org/web/20081021101624/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 26.Jun.2006 1.21am",
      "content": "My point of view is that there’s always a fine line between learning & working. It’s as if every project has new things to be discovered.\n\nCould I put it in this way?\n\n’The praises become empty when the learning process is completed.’\n\n"
    },
    {
      "time": " 26.Jun.2006 7.44am",
      "content": "There’s also a line between process and result. The process honestly followed is always a learning process. If you have faith in yourself the results take care of themselves and are not something to be contemplated or gloated over once done. I try to just let it go and move on to the next process, which for me is the only part that matters.\n\nThe more I know the more I don’t know…\n\npeace\n\n"
    },
    {
      "time": " 26.Jun.2006 3.19pm",
      "content": "Yeah interesting points about learning processes.\n\nPerhaps a slight digression ...  \nI have reached a stage of my visual design career, where I now feel I HAVE to focus more on the process, the experimentation, the discovery of ideas and solutions that may not have been discovered whilst thinking “we’ve only got THIS time to produce a (e.g) financial report” or “the client has given us examples of what they’d like” - until now I believe my understanding of brief delivery and interpretation has existed within a kind of bubble. It’s bursting that bubble ... I think ... that holds truly good ideas and truly rewarding results for a career I love.\n\nBasically ... the future is bright, adn bright is exciting.\n\n:)\n\n—————  \n**Paul Ducco**  \n [Solid Creative](http://web.archive.org/web/20081021101624/http:/www.solid-creative.com/)\n\n"
    }
  ]
}
