{
  "id": "20908",
  "title": "FF Transit",
  "forum": "Home",
  "tags": [
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20130617202839/http:/typophile.com/wiki/Indices) : [Typefaces](http://web.archive.org/web/20130617202839/http:/typophile.com/wiki/Typefaces) : Transit**\n\nDesigned at [MetaDesign](http://web.archive.org/web/20130617202839/http:/typophile.com/wiki/MetaDesign) during the early 1990s for the CI and navigation system of the BVG (the Berlin transit authority). Distributed by FSI [FontShop](http://web.archive.org/web/20130617202839/http:/typophile.com/wiki/FontShop) International.\n\nFont descriptions from FSI:\n\n**FF Transit Print**\n\nFF Transit is a highly legible font that works well for readers who may need quick orientation while en route. It was originally designed by MetaDesign in Berlin for the official use of the Berlin Public Transportation Services (BVG) and Düsseldorf Airport, but will now be available commercially all over the world. Designed to blend aesthetic quality with legibility.  \nThe FF Transit fonts are based on the Frutiger family (licensed from Linotype-Hell). MetaDesign pared the font design down and extended the family by creating a new set of matching italic fonts. In addition, they altered the widths and spacing of each font to enhance their functionality in different situations.\n\n**FF Transit Front and Back**\n\nFF Transit Front and Back are designed to compensate the visual distortion that appears on illuminated signs which are lit from the front or the back, and do so no matter whether the text is displayed as a positive or as a negative (white text on a dark background). Transit Front Negativ, for example, is thinner and has wider spaces, to balance out the visual illusion that negative fonts appear thicker.\n\n**Transit Pict**\n\nFF Transit Pict contains pictograms, direction symbols and warning symbols. FF Transit's extensive collection of pictograms makes it the perfect font for universal orientation systems. The pictograms can be used for local public transportation systems, airports, companies or on private property. It contains all warning symbols, informational symbols and up-to-date pictograms which cannot be found in comparable collections of symbols. As a special free bonus, each FF Transit package contains a special set of symbols used by Berlin's Public Transportation Services for the various subway, streetcar and bus lines. FF Transit Linie is a versatile symbols font which is made up of letters, numerals and colored backgrounds that can be combined to form subway line signets. The considerable number of FF Transit pictograms is now also available for another FontFont typeface designed for orientation and information systems: FF Info Pict for FF Info, designed by Erik Spiekermann and Ole Schäfer.\n\n**External Links**  \n [FF Transit](http://web.archive.org/web/20130617202839/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=FF%20Transit) at FontShop\n\n",
  "author": "dan_reynolds",
  "time": "25 Jun 2006 — 6:39am",
  "uid": "1085",
  "comments": [

  ]
}
