{
  "id": "20905",
  "title": "Berlin's Train Station signage",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi there,\n\nWhen I was in Berlin last year I was impressed by the variety in type and style on the signage of Berlin's Rail Stations. Impressed, but also surprised as (and maybe it's a stereotype, but) I would have expected more uniformity. Particularly when you consider the story of the [Ampelmännchen](http://web.archive.org/web/20150424144259/http:/en.wikipedia.org/wiki/Ampelm%C3%A4nnchen).\n\nUnfortunately I was only there for a week, so a couple of days had passed before I really noticed, but I photographed what I could in the time that I had. This meant some shots were a bit blurry, but then I quite like blurry photos.\n\nSo I don't <cite>need</cite> to know if these samples have names, I'm just curious. Obviously a number of them pre-date digital typefaces, but they might still have a name or a history to them that one of you might know? I loved Berlin. Wish I could have stayed there longer, and not just so I could get more photos of train station signs. :-)\n\nFriedrichstrasse 1: So this one is good old Helvetica. (Which is <cite>all</cite> we have here in Melbourne.)\n\n ![](http://web.archive.org/web/20150424144259im_/http:/typophile.com/files/01-friedrich_helv_4097.jpg)\n\nFriedrichstrasse 2: I don't know this one.\n\n ![](http://web.archive.org/web/20150424144259im_/http:/typophile.com/files/02-friedrich_3573.jpg)\n\nStadtmitte 1: This looks like DIN, but the 'S' is wrong.\n\n ![](http://web.archive.org/web/20150424144259im_/http:/typophile.com/files/03-stadtmitte_DINbutS_3625.jpg)\n\nStadtmitte 2: This looks like Frutiger, but the 'i' is wrong.\n\n ![](http://web.archive.org/web/20150424144259im_/http:/typophile.com/files/04-stadtmitte_frutbuti_5456.jpg)\n\nStadtmitte 3: I don't know this one.\n\n ![](http://web.archive.org/web/20150424144259im_/http:/typophile.com/files/05-stadtmitte_5070.jpg)\n\nUnter den Linden 1: This Helvetica Bold is a crime when you consider they've got the one below elsewhere at the station. :-)\n\n ![](http://web.archive.org/web/20150424144259im_/http:/typophile.com/files/06-unter_helvbold_5729.jpg)\n\nUnter den Linden 2: This is my absolute favourite.\n\n ![](http://web.archive.org/web/20150424144259im_/http:/typophile.com/files/07-unterdenlinden_3669.jpg)\n\nPotsdamerplatz 1: Don't know.\n\n ![](http://web.archive.org/web/20150424144259im_/http:/typophile.com/files/08-potsdamerplatz_4938.jpg)\n\nPotsdamerplatz 2: Don't know.\n\n ![](http://web.archive.org/web/20150424144259im_/http:/typophile.com/files/09-potsdamerplatz_6145.jpg)\n\nHallesches Tor: Don't know.\n\n ![](http://web.archive.org/web/20150424144259im_/http:/typophile.com/files/10-halleschestor_4928.jpg)\n\nHansaplatz: This blurry one looks like Interstate Regular Condensed.\n\n ![](http://web.archive.org/web/20150424144259im_/http:/typophile.com/files/11-hansa_IntRegCnd_4693.jpg)\n\nNollendorfplatz: Don't know.\n\n ![](http://web.archive.org/web/20150424144259im_/http:/typophile.com/files/12-nollendorfplatz_3473.jpg)\n\nZoologischer Garten: And finally, I can't work out if this is Univers or Zurich.\n\n ![](http://web.archive.org/web/20150424144259im_/http:/typophile.com/files/13-zoologischer_univ-zuri_3889.jpg)\n\nThanks a lot.\n\n",
  "author": "Stephen Lording",
  "time": "25 Jun 2006 — 5:24am",
  "uid": "4919",
  "comments": [
    {
      "time": "25 Jun 2006 — 5:52am",
      "content": "Wow! Thanks for sharing these with us.\n\nStadtmitte 1; Probably pre-digital? Reminds me a lot of [Stratrum](http://web.archive.org/web/20150424144259/http:/www.processtypefoundry.com/typefaces/stratum2/index.html).\n\nStadtmitte 2; Myriad.\n\nUnter den Linden 2 & Potsdamerplatz 1; Both \"jackboot grotesques\", Potsdamerplatz seems close to the 1934 Deutschland type.\n\nZoologischer Garten; Univers, just poorly executed.\n\n"
    },
    {
      "time": "25 Jun 2006 — 6:36am",
      "content": "_Friedrichstrasse 2_  \nThis is a custom font, based loosely on Helvetica, which was made for the Deutsche Bahn a few years ago. This was done by [Henning Krause](http://web.archive.org/web/20150424144259/http:/typophile.com/wiki/Henning%20Krause) ( [www.formgebung.com](http://web.archive.org/web/20150424144259/http:/www.formgebung.com/ \"www.formgebung.com\")) for them. The Deutsche Bahn will not be using that in the future though. They have a new super family, which was recently designed for them by Erik Spiekermann and Christian Schwarz. I do not think that either the older face on that sign nor the new Bahn faces are/will be available for public distribution. But maybe the designers or the Bahn have something up their sleeve.\n\n_Stadtmitte 2: This looks like Frutiger, but the ‘i’ is wrong._  \nThis should be [FF Transit](http://web.archive.org/web/20150424144259/http:/typophile.com/wiki/FF%20Transit) (specifically FF Transit Back, I guess, if it is a back-lit sign), which [MetaDesign](http://web.archive.org/web/20150424144259/http:/typophile.com/wiki/MetaDesign) created in the early 1990s. After the reunification, Erik Spiekermann and his Meta Design firm (which he is no longer part of) created a comprehensive signage system and CI for the Berlin transit authority. Henning Krause may of been working at Meta then, and could have played a role in the design of this as well.\n\n_Unter den Linden 2 and Potsdamer Platz 1_  \nThese are [Schaftstiefelgrotesk](http://web.archive.org/web/20150424144259/http:/typophile.com/wiki/Schaftstiefelgrotesk) lettering jobs… they seem very similar to [Tannenberg](http://web.archive.org/web/20150424144259/http:/typophile.com/wiki/Tannenberg), which was a Neo-Gothic face popular in Germany in the 1930s, and seemingly in West German (to which West Berlin belonged) in the 1950s as well.\n\n"
    },
    {
      "time": "25 Jun 2006 — 8:11am",
      "content": "Stephen -\n\nThanks for sharing these. I was in Berlin last year too and was similarly struck by the lack of a coherent identity for the train signage (altho was WAY impressed by the punctuality of the trains! especially coming from NY where \"we're being held in the station by dispatch\" is the subway slogan) Can't shed much light on the fonts tho. I remember in particular that really odd font used for Stadmitte 3 - looks like someone made a font out of some bad handlettering.\n\nI loved Berlin too.\n\n"
    },
    {
      "time": "25 Jun 2006 — 6:28pm",
      "content": "Geoff - I really like that Stratum. Just have to find a good job for it.\n\nDan - Thanks for those links. I wish I had more than a smattering of German. One day I'll find the time to learn it properly. (One day, one day). People always look at me blankly when I say I love German, but I think it's such a rich and expressive language. Like these Schaftstiefelgrotesk forms which are so expressive as well. Such a shame that Hitler had a preference for them. I guess they won't easily live that down.\n\nPatty - The Berlin system did run very well. Although I was in New York before I went to Berlin, and my subway experience there was great as well. Maybe I got lucky? I was amazed at the quality of the buskers in New York! There were full-on jazz combos down there and they were brilliant! It's obvious, but it was also amazing how many cultural references come to life in the New York subway: from Duke Ellington (I actually got to Take the 'A' Train, woo!) to the Beastie Boys (on the 1 or 9 line) for just two otherwise disparate examples. :-)\n\n"
    },
    {
      "time": "25 Jun 2006 — 6:29pm",
      "content": "How good a word is 'Schaftstiefelgrotesk'? :-)\n\n"
    },
    {
      "time": "25 Jun 2006 — 10:48pm",
      "content": "Stephen, If you're interested in fraktur and Germany, you should pick up [Blackletter: Type and National Identity by P. Bain and P. Shaw](http://web.archive.org/web/20150424144259/http:/www.amazon.com/gp/product/1568981252/sr=8-1/qid=1151300546/ref=sr_1_1/102-2962883-0166538?ie=UTF8) (if you haven't already). It's a nice little book containing some great essays on blackletter. I was able to order my copy from Readings St Kilda which bought it in a heartbeat. :^)\n\nAlso, Dan has some cool flickr photos of blackletter [here](http://web.archive.org/web/20150424144259/http:/www.flickr.com/photos/typeoff/sets/920641/) and [here](http://web.archive.org/web/20150424144259/http:/www.flickr.com/photos/typeoff/sets/72057594108318257/). I feel like a stalker posting this. :^P\n\n"
    },
    {
      "time": "1 Jul 2006 — 1:56am",
      "content": "Geoff - Thanks for those links and for the book suggestion. It looks very interesting. I need to make an Amazon purchase at the mo (a new volume of my favourite TV show, Mystery Science Theater 3000, has just been released), so I'll have to see if I can scrape enough together to add it to the order.\n\n"
    },
    {
      "time": "7 Dec 2006 — 4:21pm",
      "content": "Wonderful! [I just got back from Berlin too.](http://web.archive.org/web/20150424144259/http:/www.flickr.com/photos/stewf/sets/72157594386592999/) There's some time stuff in these photos.\n\n"
    },
    {
      "time": "7 Dec 2006 — 7:39pm",
      "content": "Stephen, isn't Berlin grand??? I love that city.\n\n"
    },
    {
      "time": "7 Dec 2006 — 8:17pm",
      "content": "I hope you can see from the pics that I love it too. So much history and character. Rich.\n\n"
    },
    {
      "time": "12 Dec 2006 — 6:17pm",
      "content": "Thanks for sharing your photos, Stephen. I'd never seen FF Typestar in use before; it's a great looking face. I'm a sucker for a flared M. I think my favourite bit of type (just edging out the blackletter on the King's scroll), is that ' [diebels](http://web.archive.org/web/20150424144259/http:/www.flickr.com/photos/stewf/305529918/in/set-72157594386592999/)'. So sharp and crisp, it's like a slap in the face. Absolutely magnificent bit of lettering.\n\nPatty, I loved Berlin and would love to go back sometime. Although, I've still got the rest of Germany to explore!\n\n"
    },
    {
      "time": "11 Oct 2010 — 5:52am",
      "content": "I thought this might be of interest to people i got more photos from the ubahn of the station type.. about 50 photos in total!\n\n[http://www.flickr.com/groups/berlin\\_u-bahn/](http://web.archive.org/web/20150424144259/http:/www.flickr.com/groups/berlin_u-bahn/)\n\n"
    },
    {
      "time": "11 Oct 2010 — 1:36pm",
      "content": "Stephen, Hitler didn't have a preference for Schaftstiefelgrotesk at all. Schaftstiefelgrotesk just happened to be in fashion during the third Reich. The Nazis abolished it in 1941. See this article: [http://en.wikipedia.org/wiki/Antiqua%E2%80%93Fraktur\\_dispute#The\\_20th\\_ce...](http://web.archive.org/web/20150424144259/http:/en.wikipedia.org/wiki/Antiqua%E2%80%93Fraktur_dispute#The_20th_century \"http://en.wikipedia.org/wiki/Antiqua%E2%80%93Fraktur\\_dispute#The\\_20th\\_century\")\n\n"
    },
    {
      "time": "15 Aug 2014 — 12:27am",
      "content": "Coming to this a bit late but, is this the same typeface as the one by Henning Krause?\n\nIt certainly looks like it but notice the top left of the lowercase 'a' comes down unlike in Friedrichstrasse?  \n [![](http://web.archive.org/web/20150424144259im_/http:/s30.postimg.org/ksrkpzkhd/calendar_412.jpg)](http://web.archive.org/web/20150424144259/http:/scotterb.files.wordpress.com/2012/05/calendar-412.jpg)\n\n"
    }
  ]
}
