{
  "id": "20930",
  "title": "Swiss Bank Logo",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi there,\n\nI was hoping I could get a few opinions and maybe some constructive critique on a logo I have designed.\n\nIt is for a Swiss bank who are situated on the Italian border. I have shown them various logos, the one attached as well as some more traditional looking swiss designed ones. They thankfully chose this logo to move forward with. It is quite rare to see banks using scripted logos so I was excited that they chose it, but I am not an expert in Scripted letterforms so could do with a few pointers.\n\nCheers\n\n| Attachment | Size |\n| --- | --- |\n| [BANK LOGO.jpg](http://web.archive.org/web/20080921155731/http:/typophile.com/files/BANK%20LOGO.jpg) | 61.82 KB |\n\n [‹ Revealing smoothly text in flash](http://web.archive.org/web/20080921155731/http:/www.typophile.com/node/20953 \"Go to previous forum topic\") [Does anyone knowes what font is used at the World Cup 2006? thanks ›](http://web.archive.org/web/20080921155731/http:/www.typophile.com/node/20900 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080921155731/http://www.typophile.com/user/11806\" title=\"View user profile.\">Matt Squire</a>",
  "time": "<br>",
  "uid": "11806",
  "comments": [
    {
      "time": " 26.Jun.2006 3.26am",
      "content": "Well at least it looks pretty thin. May not work so well used in a document that gets faxed somewhere.\n\nWhat if you posted another picture in a more realistic size. With some text perhaps?\n\n"
    },
    {
      "time": " 26.Jun.2006 3.54am",
      "content": "Is it GLZ or G/Z?  \nI agree you will potentially have problems with the lightness.  \nTim\n\n"
    },
    {
      "time": " 26.Jun.2006 4.51am",
      "content": "Yeah I have been wondering about the weight of it and it is looking a little flimsy, I have attached a couple of letterhead designs with some lorum ipsum to show you how it might be used.\n\nIts GLZ by the way, I had a problem before where the Z was also looking like and L which is why I added the cross bar.\n\n ![](http://web.archive.org/web/20080921155731im_/http:/www.typophile.com/files/LH1_6346.jpg)\n\n ![](http://web.archive.org/web/20080921155731im_/http:/www.typophile.com/files/LH2_3608.jpg)\n\n"
    },
    {
      "time": " 26.Jun.2006 5.30am",
      "content": "Matt,\n\nI have to agree with earlier posts. You will get problem in smaller sizes. Desigwise I think  \nit’s balanced etc. Just make it heavier and you’ll be fine. Btw I was surprised to find your stationed (or maybe even living) in Stockholm, Sweden! Typophile sure narrow things down.\n\nGood luck with the project\n\n"
    },
    {
      "time": " 26.Jun.2006 5.38am",
      "content": "Of the two lettter head designs the first is definately better in  \nmy opinion, with the the slightly less dominating logo. I think  \nthe Z needs a bit of work to make it look more like a a Z.  \nPossibly make the diagonal a bit more upright.\n\nPhil\n\n"
    },
    {
      "time": " 26.Jun.2006 5.52am",
      "content": "Thanks for the comments guys,\n\nI think making the downstroke on the Z a little more upright is a good suggestion, it will reflect the downstrokes of the other letters, probably bring a bit more harmony to the logo.\n\nIts been an interesting process creating the logo, scripts I think are something we all neglect a little too much and it certainly is a wake up call when you are faced with designing one. I am not a type designer but the research that I needed to put into this project has been a little more tasking than others. It was like going back to college, but I guess thats what its all about.\n\nI will work on thickening the strokes a little and let you know.\n\nCheers\n\nMatt\n\n"
    },
    {
      "time": " 26.Jun.2006 5.58am",
      "content": "Good luck with it.\n\nPhil\n\n"
    },
    {
      "time": " 26.Jun.2006 7.06am",
      "content": "It appears that the G is too far away from the L. Can you create some interaction ( as you have with the L and the Z). with those two glyphs the create a unified mark. Also the G appears lighter than the other two glyphs. This screams out to me more of a monogram and less three separate glyphs.\n\nJust a thought.\n\n"
    }
  ]
}
