{
  "id": "20946",
  "title": "Font Problems",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have been working with the Kievit family for about three monts, but since the last week I can´t get all of the styles listed on the Adobe CS2 applications, I can only get about the half of the styles and sometimes they appear with a wrong name (I choose medium SC and I get bold italic). I can get the 23 styles to appear on Word, but they appear with wrong names.\n\nI deactivated and reactivated them with Font Explorer X several times, also cleaned the font caches with it and replaced the files used by Font Explorer with a back up copy in case they could be corrupted but nothing works.\n\nWhat can I do?\n\n",
  "author": "<a href=\"user/1530\" title=\"View user profile.\">rs_donsata</a>",
  "time": "<br>",
  "uid": "1530",
  "comments": [
    {
      "time": " 26 June, 2006 - 12:55pm",
      "content": "Place them in your [user]:Library:Fonts folder. You may have to logout/login.  \nOr use the folder that’s exclusive to Adobe apps (I think the path is: library:application support:adobe:fonts — it’s the one that also contains the Req’d Adobe fonts.\n\n"
    },
    {
      "time": " 26 June, 2006 - 1:00pm",
      "content": "I uninstalled Font Explorer X, restarted the machine and installed the fonts on the sistem fonts folder, more styles appeared, but three of the ones I need are still missing.\n\nHéctor\n\n"
    },
    {
      "time": " 26 June, 2006 - 1:05pm",
      "content": "Have you reinstalled the fonts? Perhaps they’ve been corrupted. Especially if it’s Postcript not Open Type if the suitcase gets corrupted then you can have problems like this…\n\npeace\n\n"
    },
    {
      "time": " 26 June, 2006 - 7:53pm",
      "content": "If you’re using Mac OS 10.4 you can clear your system font caches simply by deleting the following folder:  \n/Library/Caches/com.apple.ATS/  \nWhen you drag it to the trash you will be prompted for your administrative password. You should then immediately restart. The folder will be regenerated when ATSServer restarts. That pretty much resets the Mac OS side.\n\nI’m not aware of Adobe applications ever caching anything more than lists of fonts. In older applications AdobeFnt.lst files held some of this data. You could try doing a Spotlight search for them and deleting them as well.\n\nYou could also test removing your InDesign preferences folder as a test to see if that makes any difference. Obviously, you would want to restart InDesign after each test.\n\n"
    },
    {
      "time": " 29 June, 2006 - 9:07am",
      "content": "I made it all, but it’s not working. I finally cleaned all chaces, used the backup font files, unistalled all font managing applications, installed the fonts in the sistem folder and restarted several times.\n\nI installed the fonts on another machine and they worked fine, then made an illustrator file with a small text sample of every font style of the family and opened it on my computer.\n\nIllustrator recognized the fonts and then I could work with all of the styles until I restarted the computer, then all was lost. When I do this I can work with most of the font styles on Indesign but four of them.\n\nWhat the hell is happening? everyting worked fine until the last week.\n\nHéctor\n\n"
    },
    {
      "time": " 29 June, 2006 - 9:19am",
      "content": "Are you sure that you don’t have a duplicate of this font loaded somehow? Like in multiple locations or duplicates in your font management program. This is very weird…\n\nBest of Luck!\n\npeace\n\n"
    }
  ]
}
