{
  "id": "20958",
  "title": "What is the best font for a flooded basement?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "My family and I have just returned home from a 4 day trip to Cincinati. We had a horrid drive through pouring rain. I just checked my basement (which has never been wet in 20 years) and found it flooded. It is still pouring buckets out and is supposed to rain for the next few days here.  \nIn an effort to take my mind off the frustration and damaged goods, I thought I would pose a typical Typophile question. What is the best face for a flooded basement. It can't have small caps because they would drown. No delicate wispy fonts either. Perhaps something along the lines of \"Sandbag\" or \"Mould-in-the Making\". Any thoughts?\n\nChrisL\n\n",
  "author": "dezcom",
  "time": "26 Jun 2006 — 5:48pm",
  "uid": "3135",
  "comments": [
    {
      "time": "26 Jun 2006 — 5:58pm",
      "content": "Well [Flood](http://web.archive.org/web/20131101043508/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=C.107017.0.0&attributes.sampleSize=32&sampleText=rain%2C+rain+go+away&sampleSize=32), of course\n\n"
    },
    {
      "time": "26 Jun 2006 — 7:09pm",
      "content": "Good choice Ken! I am glad someone knows how to dampen spirits around here :-)\n\nChrisL\n\n"
    },
    {
      "time": "26 Jun 2006 — 7:22pm",
      "content": "You know, it's beyond unoriginal, but for some reason hobo comes to mind. Something about that soggy lower section, combined with the rage that hobo is likely to evoke may make it strangely appropriate..\n\n"
    },
    {
      "time": "26 Jun 2006 — 8:05pm",
      "content": "Sauna?\n\n"
    },
    {
      "time": "26 Jun 2006 — 8:10pm",
      "content": "Arial\n\n"
    },
    {
      "time": "26 Jun 2006 — 8:37pm",
      "content": "I'd go for something skinny with a high x-height.\n\n"
    },
    {
      "time": "26 Jun 2006 — 8:55pm",
      "content": "That sucks, Chris. I drove down from MA to Philly on Sunday and it poured buckets the ENTIRE 7 hour drive and has been raining here since. Bleh.\n\n"
    },
    {
      "time": "26 Jun 2006 — 9:33pm",
      "content": "I guess it's some consolation that the water only filled your basement and hasn't risen as high as the Eaves. Although I guess it's still raining... :-(\n\n"
    },
    {
      "time": "26 Jun 2006 — 9:57pm",
      "content": "A typographical opera: \"Requiem for a Flooded Basement,\" now playing at La Scala.\n\n"
    },
    {
      "time": "27 Jun 2006 — 2:45am",
      "content": "Pump\n\n"
    },
    {
      "time": "27 Jun 2006 — 3:53am",
      "content": ":) good choice James.\n\nNeed a font that describes wandering through a dark flooded cellar?  \nYou need [this.](http://web.archive.org/web/20131101043508/http:/www.myfonts.com/fonts/letraset/wade-sans-light/)  \nTim\n\n"
    },
    {
      "time": "27 Jun 2006 — 3:56am",
      "content": "Dez, I'm sorry to hear that. When I went Rafting once, I took Cooper Black because I think it floats better than most. Good luck, and remember Noah.\n\n"
    },
    {
      "time": "27 Jun 2006 — 5:38am",
      "content": "Tim, Wade Sans is so hip man!  \nDavid Berlow, Cooper Black's image is inflated, aren't you tired of it? :-)  \nDavid Bailey, I think you also need some of the font suggestions mentioned here to float your boat:-)  \nBruce, I think I saw the debut last night! Glad to hear there are opera fans out there!  \nJames, I need something a bit more deep in the body :-)  \nDennis, That is baiting the question, Arial swims wit' da fishes!  \nStephen, It is rising right up to Mrs Eaves' bloomers :-)  \nJohn, I could use a Sauna right now!  \nBen, I feel like a Hobo the way I am so bummed about this :-)  \nPatty, thanks for the Skinny on type! Maybe it would be named \"Stilts\"?  \nChrisL\n\n"
    },
    {
      "time": "27 Jun 2006 — 6:07am",
      "content": "Chris... sorry to hear of your water woes. Here in New England the main cellar under the house remains dry, but smaller basement under the house addition had at least 3-4 feet which resulted in soaking most of my garden tools, lawn mower, grill... not so bad considering.\n\nHow about designing some new faces --  \nUnderhaus Grotesk  \nCrustacean Sans  \nAtlantis Minuscule\n\n"
    },
    {
      "time": "27 Jun 2006 — 6:19am",
      "content": "Norbert, I am thinking of doing one called \"All Wet\". It would consist of only 3 glyphs: H, 2, and O.\n\nChrisL\n\n"
    },
    {
      "time": "27 Jun 2006 — 6:20am",
      "content": "a Pump and a Tippecanoe\n\n"
    },
    {
      "time": "27 Jun 2006 — 6:25am",
      "content": "Vincent, what about Tyler too?  \nActually, I wish I had a bunch of Comic Sands to fill these bags with and stack around my door :-)\n\nChrisL\n\n"
    },
    {
      "time": "27 Jun 2006 — 7:05am",
      "content": "_Dennis, That is baiting the question, Arial swims wit’ da fishes!_\n\nI was going to suggest Helvetica, which we all know works for everything, but figured why not take it to the next step.\n\n"
    },
    {
      "time": "27 Jun 2006 — 7:16am",
      "content": "I thought you chose Arial because that was the name of the \"Little Mermaid\" from the Disney film.\n\nChrisL\n\n"
    },
    {
      "time": "27 Jun 2006 — 7:17am",
      "content": "That just shows you where my mind goes:-)\n\nChrisL\n\n"
    },
    {
      "time": "27 Jun 2006 — 7:24am",
      "content": "<cite>I thought you chose Arial because that was the name of the “Little Mermaid” from the Disney film.</cite>\n\nYou're just too witty for all of us.\n\n"
    },
    {
      "time": "27 Jun 2006 — 7:28am",
      "content": "David, you get a fin for that comment :-)\n\nChrisL\n\n"
    },
    {
      "time": "27 Jun 2006 — 8:24am",
      "content": "Something with high water retention. I think a lot of those have been mentioned. You might also consider Omnes Black. Or, maybe something with large counters.\n\n"
    },
    {
      "time": "27 Jun 2006 — 9:10am",
      "content": "Tiff, Yes, I think Omnes Black would have a good water displacement ratio, especially with that good counter-weight :-)\n\nChrisL\n\n"
    },
    {
      "time": "27 Jun 2006 — 9:54am",
      "content": "<cite>only 3 glyphs: H, 2, and O</cite>\n\nYou might need N, F, and a few of these: @#$%&.\n\n...so you could make \"O NO, F@&$ H2O!!\" :)\n\n"
    },
    {
      "time": "27 Jun 2006 — 10:00am",
      "content": "\"David Berlow, Cooper Black’s image is inflated, aren’t you tired of it? :-)\"  \nI thought you have a flooding problem though.\n\n"
    },
    {
      "time": "27 Jun 2006 — 10:26am",
      "content": "David,  \nI was just floating a very bad pun with Cooper, Tires, and inflation. I guess it was not buoyant enough to float though. Although you could say that Cooper has had a deluge of use:-)\n\nChrisL\n\n"
    },
    {
      "time": "27 Jun 2006 — 10:30am",
      "content": "Chase, You may be right about adding those extra glyphs. Fredericksburg probably got a piece of the same storms we had here in Falls Church as well.\n\nChrisL\n\n"
    },
    {
      "time": "27 Jun 2006 — 10:47am",
      "content": "_I thought you chose Arial because that was the name of the “Little Mermaid” from the Disney film._\n\nYou must have kids. In any case, that was a more sophisticated conclusion than I had intended.  \n; )\n\n"
    },
    {
      "time": "27 Jun 2006 — 10:56am",
      "content": "I have kids but they are 22 and 18. They did love that movie when they were younger.  \nThe line I most remember is King Triton saying to his daughter: \"ARIAL!!! You have been to the surface again HAVEN'T YOU!!!\"\n\nChrisL\n\n"
    },
    {
      "time": "27 Jun 2006 — 11:02am",
      "content": "I was thinking Arial as in floating or flying over the water, like being above it.\n\nrk\n\n"
    },
    {
      "time": "27 Jun 2006 — 11:21am",
      "content": " ![](http://web.archive.org/web/20131101043508im_/http:/typophile.com/files/Arial_5744.jpg)\n\nDisney's Arial\n\nChrisL\n\n"
    },
    {
      "time": "27 Jun 2006 — 12:34pm",
      "content": "What? It is flooded down there? I don't care, I am in a helicopter.\n\nUnfortunately I was mistaking Arial for Aerial. Spelling was never one of my strong points.\n\n:)\n\n ![](http://web.archive.org/web/20131101043508im_/http:/typophile.com/files/90floodaerial_4117.jpg)\n\nrk\n\n"
    },
    {
      "time": "27 Jun 2006 — 12:37pm",
      "content": "Don't worry Rob, I would be deadmeat if it weren't for spellcheck :-)\n\nChrisL\n\n"
    },
    {
      "time": "27 Jun 2006 — 12:41pm",
      "content": "Start with Dispatch (for help), pump with Venus, check the Copperplate; then move to Neuland or Murray Hill; go to Park Avenue (to enjoy the rest of the day). And don't forget to feed the Peigno(t) Medium.\n\n"
    },
    {
      "time": "27 Jun 2006 — 4:21pm",
      "content": "Bravo David! Good selection of advice (and the fonts arn't bad either :-)\n\nChrisL\n\n"
    },
    {
      "time": "27 Jun 2006 — 4:30pm",
      "content": "Splashdown by Comic Craft\n\nYellow Submarine by Designers Republic\n\nBubbly by Font Bank\n\nPool House by House Industries\n\nRaincheck by Treacy Faces\n\nAnything by Thirst Type\n\nSorry for your situation…\n\npeace\n\n"
    },
    {
      "time": "27 Jun 2006 — 4:41pm",
      "content": "Paul, I laughed all the way to the Font Bank with those!  \na tip of the bubbly to ya'\n\nChrisL\n\n"
    },
    {
      "time": "27 Jun 2006 — 5:05pm",
      "content": "Speaking of House, I think 'House Slant' is the one to watch out for. Here's hoping your foundations don't get too soggy...\n\n"
    },
    {
      "time": "27 Jun 2006 — 8:04pm",
      "content": "Thanks Stephen, I'll look for a font with a strong foundation :-)\n\nChrisL\n\n"
    },
    {
      "time": "28 Jun 2006 — 12:53am",
      "content": "if i had to say, it would either be something really \"bloated\" like miss tiffany said, showing the water retention; or it would be an outline font, for they would float!\n\n"
    },
    {
      "time": "28 Jun 2006 — 2:12am",
      "content": "[If it has stopped raining.  \n](http://web.archive.org/web/20131101043508/http:/www.dafont.com/ragg-mopp.font)  \n [If it hasn't.](http://web.archive.org/web/20131101043508/http:/www.myfonts.com/fonts/spiecegraphics/ark-monogram-sg/ark-monogram-center-sg-regular/)  \nIt is the time for unseasonal downpours in London – Wimbledon has started.  \n_FWIW it's Ariel (as in the Tempest)_\n\nTim\n\n"
    },
    {
      "time": "28 Jun 2006 — 2:48am",
      "content": "I just tested Cooper Black on this poster  \nfor [my son's school](http://web.archive.org/web/20131101043508/http:/www.eleanorpalmer.camden.sch.uk/) and as you can see it  \nwasn't as buoyant as one might expect.\n\n ![](http://web.archive.org/web/20131101043508im_/http:/typophile.com/files/eleanor_p_4124.jpg)\n\n"
    },
    {
      "time": "28 Jun 2006 — 10:39am",
      "content": "Chris, what did you go to Cincinnati for? What, are we trading places or something? :)\n\n"
    },
    {
      "time": "28 Jun 2006 — 10:40am",
      "content": "Well, at least today in DC it isn't raining. The sun has been out for most of the day, thank goodness.\n\n"
    },
    {
      "time": "28 Jun 2006 — 10:56am",
      "content": "[Army Pool Tiles!](http://web.archive.org/web/20131101043508/http:/www.eyebytes.com/cproj/index.html)\n\nMake a feature out your 'pool'!\n\n"
    },
    {
      "time": "28 Jun 2006 — 10:58am",
      "content": "TERRY!!!  \nGood to hear from you!\n\nWe took my son on a trip as a graduation present. He is a NASCAR junky so we took him to this racetrack in Kentucky about 40 mile south of Cincy where he got to ride around the track at 160 mph in a racecar. We also went to the aquarium, the Freedom Museum, and the new Reds Ballpark. I'll post some pictures later.\n\nWhat are you up to and doing in DC? We should do lunch? Are you going to TypeCon this year?\n\nChrisL\n\n"
    },
    {
      "time": "28 Jun 2006 — 11:14am",
      "content": "T&K, I do feel bloated and I like the outline font idea--hoping it would get its fill of water;-/\n\nTim, RagMop was an old 50s R&B song that I used to love, it was right up there with \"Slippin' n Slidin\"!\n\nKellie, I think your Cooper floats just fine! Your poster reminded me of the old days when my kids were young (and sometimes wet:-)\n\nEben, Cool tiles dude! I love that face!\n\nChrisL\n\n"
    },
    {
      "time": "28 Jun 2006 — 1:54pm",
      "content": "Anything from Storm ;). Andulka sounds mucky.\n\n"
    },
    {
      "time": "28 Jun 2006 — 2:08pm",
      "content": "Chris the Pump suggestion is okay but it should be Triline.\n\n"
    }
  ]
}
