{
  "id": "20972",
  "title": "Big City Fonts - Targeted to the Bars & Clubs scene",
  "forum": "Design",
  "tags": [

  ],
  "content": "Looking For a font to express lively, Fun, Contemporary, City Activities. For use in advertising Flyers for NightClubs/ Bars & Restaurants. Any Thoughts? Thanks!\n\n",
  "author": "<a href=\"/web/20110609055829/http://www.typophile.com/user/13221\" title=\"View user profile.\">j_polo9</a>",
  "time": "<br>",
  "uid": "13221",
  "comments": [
    {
      "time": "",
      "content": "[FF QType](http://web.archive.org/web/20110609055829/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=qtype) was inspired by club flyers with multiple weights and widths to fit the longest or shortest band names.\n\n"
    },
    {
      "time": "",
      "content": "Sounds like OXTAIL to me... see for yourself at [http://www.macrhino.com](http://web.archive.org/web/20110609055829/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\n"
    },
    {
      "time": "",
      "content": "FF QTYPE looks good but I'd like similar diversity for less price if its availalbe. If need be I might just get one set at a time.\n\nOXTAIL seems great for Restaurants but not so much for the 21-35 Bar crowd.\n\nI think I am thinking more sans-seriff Bold Condensed Fonts for Titles/ display, or maybe fonts with grunge textures or ones that look more hand generated, like air brushed. What do you think?\n\n"
    },
    {
      "time": "",
      "content": "Grunged fonts very rarely look good at large sizes where the limits of the original drawings are too visible, better to take a clean base font and apply your own texture, or there is software called something to do with washing (help?) that will apply texture to type, at least repeating characters won't look the same.\n\nAre grunged fonts not reaching the end of their fashionability?  \nTim\n\n"
    },
    {
      "time": "",
      "content": "I certainly hope so. But they keep popping up…\n\nI think you're talking about the Machine Wash filters by Mister Retro…\n\npeace\n\n"
    },
    {
      "time": "",
      "content": "For bars, nightlife, etc...\n\nNot incredibly original but it works - House Gothic:  \n [http://www.houseind.com/index.php?page=showfont&id=15](http://web.archive.org/web/20110609055829/http:/www.houseind.com/index.php?page=showfont&id=15 \"http://www.houseind.com/index.php?page=showfont&id=15\")\n\nOr the Chalet typefaces:  \n [http://www.houseind.com/index.php?page=showfont&id=4](http://web.archive.org/web/20110609055829/http:/www.houseind.com/index.php?page=showfont&id=4 \"http://www.houseind.com/index.php?page=showfont&id=4\")  \n [http://www.houseind.com/index.php?page=showfont&id=11](http://web.archive.org/web/20110609055829/http:/www.houseind.com/index.php?page=showfont&id=11 \"http://www.houseind.com/index.php?page=showfont&id=11\")\n\n"
    },
    {
      "time": "",
      "content": "I think Ed Interlock OTF would be great for use on night club flyers, especially if you're using IllustratorCS2 or InDesignCS2 to utilize all the specialized ligatures.\n\n"
    },
    {
      "time": "",
      "content": "if you're doing a lot of nitelife flyers, you might want to just invest in the whole device library.  \n [http://www.devicefonts.co.uk](http://web.archive.org/web/20110609055829/http:/www.devicefonts.co.uk/ \"http://www.devicefonts.co.uk\")  \nand  \n [http://www.veer.com/products/vendor.aspx?vendor=det](http://web.archive.org/web/20110609055829/http:/www.veer.com/products/vendor.aspx?vendor=det \"http://www.veer.com/products/vendor.aspx?vendor=det\")\n\n"
    },
    {
      "time": "",
      "content": "@timd: Ahh yes I suppose I can add my own texture to the type that would work better.\n\n@Paul Cutler: Are their any more filters like those ones? Those ones are pretty sweet and i might definately have to use those on some T-shirts im gonna do!\n\n@chris & bobby: House gothic I've always liked. Chalet and Ed Interlock OTF are very nice as well.\n\n@Paul: Ugh Why do type designers seem to have un-user-friendly websites? Ahh the veer link is much better thanks. Hmm at around $200 a flyer a $5000 font set might be a bit much. Although really I would only need to do 25 fliers to get the set...Thats a tough one.\n\n\"At a great pennyworth pause a while\" - I think it works the same for a great cost ;) Thanks for all the sugguestions!\n\n"
    },
    {
      "time": "",
      "content": "_Why do type designers seem to have un-user-friendly websites?_\n\nA good type designer does not necessarily a good web developer make. Nor does one make enough money to afford a professional site. Thus the role of the reseller.\n\n"
    },
    {
      "time": "",
      "content": "--- delete --- Never mind. Already answered.\n\n"
    },
    {
      "time": "",
      "content": "True but neither does a web developer make enough to buy the typefaces he wants. And the sites look fairly professionally made just annoying to use. Store sites that are annoying to use would have a much harder time selling their products when their are so much easier to use stores selling similar products.\n\n"
    }
  ]
}
