{
  "id": "21019",
  "title": "Typography in New Superman Movie",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Well I just watched the New Superman and wasn't overly impressed. But What I am wondering is why the type explaining the story was sprawled across the whole screen so that i had to read a line scan my head back to the left and make sure i went to the correct line each time...\n\nAlso In the opening credits, why did every letter connected to an E have to be a ligature?\n\n(Waiting to see how long before this thread gets off typography and debates the movie/ pets/ etc. (not that i mind))\n\n",
  "author": "j_polo9",
  "time": "29 Jun 2006 — 4:49am",
  "uid": "13221",
  "comments": [
    {
      "time": "29 Jun 2006 — 6:23am",
      "content": "This thread would be alot more compelling if it had some visuals to accompany it...\n\n"
    },
    {
      "time": "29 Jun 2006 — 6:34am",
      "content": "indeed.\n\nwhat's your point j\\_polo?\n\n----------  \n**Paul Ducco**  \n [Solid Creative](http://web.archive.org/web/20140911043304/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "29 Jun 2006 — 6:53am",
      "content": "lol too bad I didn't take my digital camera to see the movie and have it ready to shoot... My point is for those who see the movie tell my why all the E's have ligatures and why they made the type so hard to read for the back story.\n\n"
    },
    {
      "time": "29 Jun 2006 — 10:02am",
      "content": "I think he was waiting for a response from someone who HAS SEEN IT.\n\nMaybe?\n\n"
    },
    {
      "time": "29 Jun 2006 — 11:41am",
      "content": "Just came back from the movie. Well, as J said, there lots of ligatures all over the opening credits. All the upper terminals of a particular letter such as T, E, S etc. will be added longer to be joined with the following letters, (CAPITAL LIGATURES?!) not the letters before it as far as i remember. Oh yeah, they're outlined... Not filled up with the trademarked Daily Planet's steel blue color. Also, the ending credits seems to be done pretty bad too.\n\nMy guess is that the best type in the movie is on Lex Luther's boat. ;)\n\n"
    },
    {
      "time": "29 Jun 2006 — 2:11pm",
      "content": "\\>I am wondering is why the type explaining the story was sprawled across the whole screen so that i had to read a line scan my head back to the left and make sure i went to the correct line each time…\n\nThat's why font people should always sit at the back - perhaps with a pair of field glasses for the small print.\n\n"
    },
    {
      "time": "30 Jun 2006 — 10:13am",
      "content": "By the way, I liked the typeface used for the back story and the opening credits. Was the geometric sans type Gotham?\n\nThe ligatures were weird though...maybe it was done for the sake of doing a type treatment? Or was it done as homage to Superman I and II? The effects for the opening credits were done 1970's style(blue-laser-zoom away, as in the previous movies) but I don't know with the ligatures.\n\n"
    },
    {
      "time": "4 Jul 2006 — 1:31pm",
      "content": "Saw it last night and I was thinking Gotham too for the back story (that indeed stretched from the very left of the screen to the right).\n\nAlso, I found the original titles here: [http://homepage.mac.com/trickmonkey/superman/iMovieTheater41.html](http://web.archive.org/web/20140911043304/http:/homepage.mac.com/trickmonkey/superman/iMovieTheater41.html \"http://homepage.mac.com/trickmonkey/superman/iMovieTheater41.html\") (hope that doesn't crash the guy's .mac server) and as far as I can tell they don't have the same weird capital ligatures that the new movie has...  \n---\n\n"
    },
    {
      "time": "5 Jul 2006 — 7:25pm",
      "content": "sweet thanks for the link.\n\n"
    },
    {
      "time": "11 Jul 2006 — 6:16pm",
      "content": "I finally got around to checking out the new Superman Returns movie.\n\nI was a little put off by the handling of the opening titles, as well as the rest of what I thought was a highly derivative movie. I'll leave the rest of the actual movie review stuff for more movie review oriented people. Let's just talk about the type.\n\nI've never been able to pin down exactly what typeface was used in the glorious opening titles of the 1978 edition of \"Superman: The Movie.\" It looks a bit like Gill Sans, but then has a bit of Frutiger in it...in the end, I don't know. It was still really great. I was only 11 years old when watching the Christopher Reeve version of \"Superman\" for the first time and I was just blown away by it -right from the opening title sequence. There is a joke in Hollywood: \"the fancier the movie titles, the more terrible the movie.\" Not sure if that's true, especially when many of the posters are just set lockstep in Trajan. But \"Superman: The Movie\" is a guilty pleasure of mine. I watch it on DVD and think about riding my bike over bike ramps and crap like that.\n\nThe then fledgling R/Greenberg and Associates put together one of the greatest movie title sequences of the 2nd half of the 20th century. I watch it on DVD and still get exhilarated by it. It's just cool.\n\nFast forward to 2006.\n\nFirst, they don't match the correct font even though they're trying to make this movie into a legitimate sequel to the 1978 and 1981 versions. Gotham is a very good typeface. But it is still not the correct font. Superman lives in \"Metropolis.\" Batman lives in \"Gotham City.\" Why didn't \"Batman Begins\" use Gotham for its type? I digress.\n\nThen we have to factor in the EXTREMELY irritating move of the effects house or whoever rendered this title sequence in doing it at too LOW a level of resolution. Did anyone else see all the pixellation all over those outlined titles, or was it just me? Not everything \"digital\" equals perfect. R/Greenberg and Associates did their opening title sequence BETTER and more SMOOTHLY waaaay back in 1978. Yet today, here in 2006, we are way smack in the land of pixellated alias-land. Really horrible. Flicker those pixels!\n\nOn top of that, the whole opening title sequence had a pace to it more frantic and fast-forward sped-up than most rap gangsta wannabe music videos MTV even bothers to play anymore. Everything was firing by so fast I thought I was looking at miniature planets or some kid's marbles in a microscope. It was embarrasing. Have any of these guys ever thought about a term called \"pacing\" or ever concentrating on a shot for more than 6 frames of celluloid? Gigantic objects, such as a planet, have to move by the camera sloooooly. If it shoots by in only 5 frames it has the scale of a soccer ball. Arrgh!\n\nI see this kind of dreck happening and it makes me feel like all the \"DIGITAL\" tools we have at our use these days have made a lot of people retardedly lazy. They don't follow any of the rules those who had to live under the limits of the analog realm had to follow. Just throw anything at it and caboose it with that \"digital\" word. Blah!\n\nDigital, analog, I'd just like for these movie people to start doing their jobs right again!\n\n"
    },
    {
      "time": "12 Jul 2006 — 10:31am",
      "content": "I saw the movie in IMAX 3-D on opening weekend and didn't notice the pixelation Bobby did, and that was on a 6-story-tall screen. Also, reading the backstory title card didn't seem overly laborious on such a giant screen, but I do remember thinking they should have split the text onto two cards rather than one.\n\nI do remember reading (in Entertainment Weekly, I believe) that the director intended the titles to be a homage to Superman I and II's swooshing blue outline type.\n\n(btw, the 3-D part amounted to only 20 minutes or so, mostly action sequences. Very cool for most of the scenes, but I forgot to take off my glasses after one scene.)\n\n--m\n\n"
    },
    {
      "time": "13 Jul 2006 — 11:02am",
      "content": "Kyle Cooper's [Prologue Films](http://web.archive.org/web/20140911043304/http:/www.prologuefilms.com/) produced the new opening titles. As a tribute to one of the greatest opening titles in the last forty years, I thought they did a swell job.\n\nI wasn't thrilled about the large block of prologue text that opens the movie, but it was short and non-intrusive. The most annoying part was seeing DC Comics' atrocious new logo before it -- Milton Glaser, we miss you!\n\nAs far as typography in the rest of the film, did anyone else notice that The Daily Planet's signage and globe were set in Broadway (or some similar Art Deco typeface)? Nice attention to detail, I thought -- it resembles the banner type on the original issues of _Action Comics_.\n\nI can't wait to see the movie again in IMAX.\n\n"
    },
    {
      "time": "18 Jul 2006 — 6:29pm",
      "content": "I was in Colorado Springs over this past weekend. So I took the opportunity to watch \"Superman Returns\" in IMAX at the Cinemark theater there (to see if there would be any visual improvement over what I saw in 35mm).\n\nThe pixelation in the opening titles was even more obvious than in 35mm. I even saw vertical dark lines separating the light pixel lines on those opening title letters. The fast foward acid trip pacing of those titles made it difficult to \"read\" objects like planets as they sped across the huge screen.\n\nThe generally blurry nature of image detail in this movie seems to work as a good case study that movies shot in HDTV videotape format do not work well blown up to IMAX sized screens. Many objects on various sets in this movie that would normally be well in focus if shot in IMAX or just 35mm were a blur with \"digital.\"\n\nThere's a lot of digital-based tools which have greatly improved filmmaking and many other creative endeavors. But shooting major feature films on video is proving to be, at least for now, a big step backward in terms of quality. It takes more than 2000 columns of pixels to be competitive with 35mm film.\n\n"
    },
    {
      "time": "19 Jul 2006 — 10:10pm",
      "content": "[The content of this post has been moved to a new thread: [<cite>Opening credits in \"Superman: The Movie\"</cite>](http://web.archive.org/web/20140911043304/http:/typophile.com/node/21428).]\n\n"
    },
    {
      "time": "22 Jul 2006 — 6:16am",
      "content": "I definitely noticed the pixelation too. One name (don't recall which it was) came out diagonally and the jaggies were awful. And on all of them, the outlines of the letters seemed to flicker between white and blue early in their zoom towards me.\n\nAs for the ligatures, I kept thinking they got their late-70's action blockbusters mixed up...\n\n ![](http://web.archive.org/web/20140911043304im_/http:/typophile.com/files/logo_4642.jpg)\n\n"
    },
    {
      "time": "22 Jul 2006 — 12:16pm",
      "content": "I have to agree with Down10, the titles were fantastic. When I first saw them and realized that they did an homage to the original, my heart did a little leap for joy. I titles I seem to like most are the ones I find out later happened to by done by Kyle Cooper.\n\n"
    }
  ]
}
