{
  "id": "21014",
  "title": "Portfolio Website Question...",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m revamping/recharging my portfolio website with a new design and a lot of new work/scrapping old work. The question now comes to mind, how do I showcase a 38 page (20 spreads) design? Do I just show key pages from within the book? Should I provide a low res PDF of the entire book on my site or just leave that till actual portfolio reviews? (in person that is)\n\nThanks.\n\n [‹ Bah Arial :\\](http://web.archive.org/web/20081120083239/http:/www.typophile.com/node/20698 \"Go to previous forum topic\") [Can you ever pair two sans serifs? ›](http://web.archive.org/web/20081120083239/http:/www.typophile.com/node/21000 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081120083239/http://www.typophile.com/user/8451\" title=\"View user profile.\">dave bailey</a>",
  "time": "<br>",
  "uid": "8451",
  "comments": [
    {
      "time": " 28.Jun.2006 6.09pm",
      "content": "I would just show the best pages from the piece. Perhaps the cover and two or three spreads. Also, show variety in the spreads you choose.\n\nIf you show too much people will get bored and move on.\n\nLuke.\n\n"
    },
    {
      "time": " 28.Jun.2006 6.45pm",
      "content": "Agreed. I personally dont like to show anything digital if it isnt a digital work. Take pictures of the book from interesting angles which shows another layer of composition. The portfolio is just a preview (think movie trailer) that grabs attention. If they wanna see the actual book, they’ll have to interview you.\n\nDon’t know if you are working on a personal identity but that will make you stand out and shows you know how to market yourself.\n\n"
    },
    {
      "time": " 28.Jun.2006 6.57pm",
      "content": "Pretty much just looking for a place to send people when they ask if I have a website. I know face-to-face interviews is where I’ll get a job, but a website doesn’t hurt as a preview. I don’t have access to the book as it’s being photographed entered into a competition. I’ll just go for the spreads idea.\n\nThis is what the page layouts will look like: [http://users.adelphia.net/~dabailey/portfolio.identity.thumbs.png](http://web.archive.org/web/20081120083239/http:/users.adelphia.net/~dabailey/portfolio.identity.thumbs.png \"http://users.adelphia.net/~dabailey/portfolio.identity.thumbs.png\")\n\nand then I’m using Lightbox JS to show my work like this: [http://users.adelphia.net/~dabailey/portfolio.lightbox.mockup.png](http://web.archive.org/web/20081120083239/http:/users.adelphia.net/~dabailey/portfolio.lightbox.mockup.png \"http://users.adelphia.net/~dabailey/portfolio.lightbox.mockup.png\")\n\n"
    },
    {
      "time": " 28.Jun.2006 8.51pm",
      "content": "I disagree with Prakash in that it tends to annoy me when a book is shown from a funky angle. I just want to see the design. I think show the best spreads (2-5) on the site.\n\nThe worst offender was AIGA - one year for their 50 books/50 covers catalogue all the books were shot way close up from absurd oblique angles so you couldn’t see the design at all. Then to add insult to injury they included THEIR OWN BOOK in their annual the next year.\n\n"
    },
    {
      "time": " 29.Jun.2006 3.27am",
      "content": "David,\n\nnice looking layout. I am interested in how you achieve a smooth navigation between projects - how will that be done? Also a big fan of lightbox which I use on my site, as it is so easy to implement and never failed to impress potential clients.\n\nAbout presenting books, i personally don’t mind a ’funky’ cover shot as long as it only serves as an opener and is supported by detailed previews. (2-3 spreads)\n\nGood luck with your site,\n\nSeb\n\n"
    },
    {
      "time": " 29.Jun.2006 5.10am",
      "content": "Well you could go with a nice Flash Based Book so they can see through the whole thing. Or you can just show snipets of each page and some doodles/ sketches/ explinations/ etc. for each page but that is a lot of work altogethar.\n\nTo be honest the site is a bit plain. Not that its necessarily a bad thing, I love plain portfolio sites, but this one seems a bit too generic. The textured background seems like a default idea, why not make a custom background out of type or logos that you’ve done all one colour fading out instead of some walllpaper? The logo looks cool but I think it would look good by itself with the X and without Graphic Artist and the underline. The Nav is a bit boring, the blank space doesn’t look like it has a purpose, and how will it look with say 20 items for each section?\n\nDo you design/ impliment websites along with your other talents as a designer?\n\n"
    },
    {
      "time": " 29.Jun.2006 6.23am",
      "content": "Seb: Thanks for the kind words. Complete logistics won’t be worked out till I sit down with my friend who’s a web developer and start actually creating the website.\n\nJesse: I know it’s plain, I’m really just giving my work a chance to be shown on the web. My work is primarily print design with a little identity and typographic work now and then. If it’s absolutey necessary, I can do a little hand coding in HTML but that’s about it, my focus is not to impress them with my website design, but rather the work included.\n\n"
    },
    {
      "time": " 29.Jun.2006 7.51am",
      "content": "I like the plainess but I have a gripe about slightly obscure big zoom icons, they seem to everywhere and rarely add to the view experience, I understand the reasoning for them but I wonder if you would not be better off showing the front cover (or whole image) that one can click on and get a larger view, preferably with an even larger view option so the details can be inspected. Bit of a rant sorry.\n\nThe pdfs are are good idea (avoids the requirement for the largest zooms) would there not be a copyright issue if you put the whole book up on your site? Two or three spreads should be sufficient for a portfolio though.\n\nTim\n\n"
    },
    {
      "time": " 2.Jul.2006 10.09am",
      "content": "j\\_polo: Your idea got me thinking...I can’t find anything as far as a domain with my name so what if I went with xDB designs...something along this line (DIN is just a quick place holder...not sure what sans I would use there yet.):\n\n ![](http://web.archive.org/web/20081120083239im_/http:/www.typophile.com/files/xdb_5775.png)\n\nor\n\n ![](http://web.archive.org/web/20081120083239im_/http:/www.typophile.com/files/xdb2_3986.png)\n\nor this which is a lot closer to my actual signature...\n\n ![](http://web.archive.org/web/20081120083239im_/http:/www.typophile.com/files/xdb3_6695.png)\n\n"
    },
    {
      "time": " 2.Jul.2006 11.56am",
      "content": "Ahh I like your last version much better. Some people might wonder what XDB stands for. Myself I just wonder what the X is for. And I agree you have to change the design font and i’m not a big fan of the letterspacing.\n\n"
    },
    {
      "time": " 2.Jul.2006 12.05pm",
      "content": "Well at least it’s going in the right direction. Maybe I should post up a version for critique and go from there.\n\n"
    },
    {
      "time": " 2.Jul.2006 3.27pm",
      "content": "sounds good.\n\n"
    },
    {
      "time": " 3.Jul.2006 11.48am",
      "content": "How about now?\n\n[http://users.adelphia.net/~dabailey/new.layout.png](http://web.archive.org/web/20081120083239/http:/users.adelphia.net/~dabailey/new.layout.png \"http://users.adelphia.net/~dabailey/new.layout.png\")\n\nWhat do you think about the thumbnails? zoomed in? or fit as much in the thumbnail size as possible? Mostly just placeholders in there now but the first three thumbs in ’PRINT’ are fitting as much in as possible (almost a full spread).\n\n"
    }
  ]
}
