{
  "id": "21063",
  "title": "[P22] Declaration of Independence Fonts",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [paul d hunt](http://web.archive.org/web/20100923143805/http:/typophile.com/user/7006 \"View user profile.\") : 30.Jun.2006 10.28pm \n\nWhen, in the course of human events, it becomes necessary for people to change a font from one to another, to choose from the thousands of available fonts, the separate and equal place in a font menu entitles them decent respect to the opinions of a client or audience and requires that they should declare the causes which impel them to visual separation. We hold these truths to be self-evident, that all fonts are not created equal, that they are endowed by their Foundry with certain unalienable attributes; that among these are Legibility, Usability and the pursuit of Impressive Design. That to secure these rights, designers should use P22 fonts whenever possible.\n\nIntroducing the P22 Declaration Font Set\n\nThe new Declaration font set from P22 features two lettering fonts based on the Declaration of Independence of the United States of America. A script font that features the look of classic 18th Century penmanship, with a slightly irregular edge, as found on documents made with ink quill pens on vellum or parchment. The accompanying Blackletter font is also derived from the Declaration of Independence as it was used for emphasis and of course the famous document title itself. A third font, which features the signatures of the signers of the Declaration of Independence, is also included.  \n [http://www.p22.com/products/declaration.html](http://web.archive.org/web/20100923143805/http:/www.p22.com/products/declaration.html \"http://www.p22.com/products/declaration.html\")\n\nP22 Declaration Pro Combines The Script, Blackletter and Signatures fonts from the regular set plus much more into one OpenType font with smart features (OT features only accessible with Adobe CS or other applications which currently support OpenType). For those applications that do not support the OpenType features, \"Declaration Alternate\" and \"Declaration Sorts\" fonts are included along with the regular 3 font set in TrueType and PostScript formats.  \nThe Pro font set is offered as an introductory special at 25% off of the regular price of $49.95 (only $37.46) [http://www.p22.com/products/declarationpro.html](http://web.archive.org/web/20100923143805/http:/www.p22.com/products/declarationpro.html \"http://www.p22.com/products/declarationpro.html\")\n\nThe regular set is also available as a special in combination with Franklin's Caslon set for only $49.95 [http://www.p22.com/products/declaration\\_caslon.html](http://web.archive.org/web/20100923143805/http:/www.p22.com/products/declaration_caslon.html \"http://www.p22.com/products/declaration\\_caslon.html\")\n\nNow you can declare your own independence from the oppressive regime of your choice...in style!  \n(sales valid until July 31,2006)\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100923143805/http:/typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": ": 30.Jun.2006 10.28pm",
  "uid": "7006",
  "comments": [
    {
      "time": "",
      "content": "very nice, i bought it :P\n\n"
    }
  ]
}
