{
  "id": "21076",
  "title": "What kind of printer do you have?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I have an HP Officejet 7310 All-in-One and I love it.  \n [My Printer](http://web.archive.org/web/20081120081303/http:/www.shopping.hp.com/webapp/shopping/product_detail.do;jsessionid=En0r4Zg1DvyP2BG0x1FMDPfnp8cMkFLqZ52ersVzng5k8w7bcH9q!-852219418?storeName=storefronts&landing=&category=all_in_ones&orderflow=1&a1=Color+printing&v1=Color&product_code=Q5562A%23ABA&catLevel=2)  \nUp to 4800 x 1200 optimized dpi (HP Premium Photo Paper, 1200 x 1200 dpi input. And I love auto duplexing. What do you think? What do you have?\n\n [‹ Gorune born 7:02pm, now newest Armenian typgrapher!](http://web.archive.org/web/20081120081303/http:/www.typophile.com/node/17554 \"Go to previous forum topic\") [Butterfly letters ›](http://web.archive.org/web/20081120081303/http:/www.typophile.com/node/21143 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081120081303/http://www.typophile.com/user/13221\" title=\"View user profile.\">j_polo9</a>",
  "time": "<br>",
  "uid": "13221",
  "comments": [
    {
      "time": " 2.Jul.2006 6.30am",
      "content": "Are you running it on a **Mac?** If so, how long have you been using the printer? Thanks in advance for the info. I’m looking for a small-footprint printer for my home office. More black and white need than color these days, too.\n\n"
    },
    {
      "time": " 2.Jul.2006 9.30am",
      "content": "I recently bought the Laserjet 1320 from HP. The printer is only black and white, but I use it only for looking at the typefaces I design, so color is not really needed.\n\nI think it’s OK.\n\n"
    },
    {
      "time": " 2.Jul.2006 11.49am",
      "content": "Ahh no i’m running it on a pc sorry. Been using it for about 6 months and no complaints. Not sure what other printers are better but to me this one is very nice.\n\n"
    },
    {
      "time": " 3.Jul.2006 7.34am",
      "content": "Old Epson 3000 running the roll paper, and an HP 4MV laser. Both good, but long in the tooth.\n\n"
    },
    {
      "time": " 3.Jul.2006 4.15pm",
      "content": "I had two HPs in a row start being fussy about picking up paper after 2 years, so I decided to switch to Epson since it doesn’t pick it up, but has gravity helping feed it.\n\nAlso since most of my output is for the web, and I rarely print anything important, I decided to stop buying expensive printers. I just got an R300 for $79 with a coupon about a year ago at Costco. It does a decent job. I have to say I’m satisfied with it.\n\nSomeday when money isn’t so tight, I’ll splurge on a decent one again that prints up to 13”x19”. I have a bunch of expensive oversized paper to use up. But I don’t think I’ll buy HP again because of the pick-up thing.\n\n"
    },
    {
      "time": " 3.Jul.2006 5.28pm",
      "content": "We have a variety of printers at work. At home, I have a Xerox Phaser 7300 DN: Adobe PostScript 3, 2400x600 dpi, duplex, LED color printer. Up to 12” x 18” single-sided, or 11” x 17” double-sided.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 3.Jul.2006 6.12pm",
      "content": "I’m saving my pennies for a [Xante Accel-a-Writer 4G](http://web.archive.org/web/20081120081303/http:/www.xante.com/products/4g/). I’ve had my eye on one for a while, and when I had a new desk built a few months ago I spec’d a drawer big enough to hold the printer.\n\n"
    },
    {
      "time": " 3.Jul.2006 7.32pm",
      "content": "John, You’ll love the Xante 4G. I’ve had one for a while now (and a 3G before that). That 2400 dpi does make a difference!\n\n"
    },
    {
      "time": " 3.Jul.2006 9.57pm",
      "content": "I do most of my printing on a [Canon i860](http://web.archive.org/web/20081120081303/http:/www.steves-digicams.com/2003_reviews/canon_i860.html). It does beautiful photos and graphics; but, as with most consumer-level inkjets, text isn’t so great. I have a HP Laserjet 1000 for printing that stuff.\n\nI recently stol—er—adopted an Epson Stylus Photo 1280 (a 13x19 6-color inkjet) that I’ll hook up eventually. Besides being able to print on 13x19 paper, the 1280 supposedly does PostScript when connected to a Mac or PC server running Epson’s RIP software... so that’s something to look forward to... I think? I don’t know much about PS, so feel free to clue me in about it!\n\n"
    },
    {
      "time": " 5.Jul.2006 7.26pm",
      "content": "yea some info on post script for printers would be cool.\n\n"
    },
    {
      "time": " 5.Jul.2006 8.30pm",
      "content": "For color printing I have the Epson 1280 which I hate. This is my second Epson and both have been huge wastes of money. When I decide to replace this one I’ll look closely at other brands for inkjet printing. For my first Epson I bought a software called PowerRip for postscript, it sucked, the color was terrible. At the time Epson didn’t have postscript support for this printer (the 1160) I haven’t researched Epson’s Rip software for the 1280.\n\nFor black and white laser I have the Ricoh Aficio AP610N which I adore. It’s fast and the quality is great. Can’t recommend it enough.\n\nJohn - pound for pound, pennies for pennies I decided on the Ricoh over the Xante (altho I was looking at a different model than the 4G) - it had more speed for about $300 less. I suggest you look into it. This baby prints 35 ppm.\n\n"
    },
    {
      "time": " 5.Jul.2006 9.15pm",
      "content": "Patty, I have the Xante AW 1200, which is what I think you are comparing the Ricoh to, as it has similar resolution and wide format. It is a wonderful printer, but its output still has gain compared to offset printing. So for proofing typefaces, I would think that the Xante AW 4G at 2400 dpi would be definitely better. At more than four times the price it had better be!\n\n"
    },
    {
      "time": " 6.Jul.2006 3.16am",
      "content": "i have an Epson R800 (A4) and a [R1800](http://web.archive.org/web/20081120081303/http:/www.photo-i.co.uk/Reviews/interactive/Epson%20R1800/page_1.htm)mostly for doing photography up to A3+. I use Calumet Matt and Gloss photo paper, mostly because it’s good, not overpriced and doesn’t have crap on the back of the paper.\n\nBoth Epson’s handle heavy weight watercolour paper. Both Epsons print individual CD lables on the CD which is good and I use for low runs of CDs for clients.\n\nFor text I have an HP Laserjet 2200D duplexer which is fine. The R series Epson printers use pigment based inks and use 8 printer cartriges, red,blue,yellow,mattblack, photoblack,cyan,magenta,glossoptimizer. They are pricey to replace at about £11-14 each.\n\nWe tested the R1800 with type since our local bromide printer stopped doing bromides. We had trouble matching my test on my home print done from Windows (which were excellent) to a Mac printed on a work R1800. The mac drivers are not as clear as the Windows ones so the settings might not be correct. It is very important to get the right paper type and colour profile.\n\n"
    },
    {
      "time": " 6.Jul.2006 8.00am",
      "content": "Have you ever tried a lightscribe for cd labels? You can burn the image for the cd label right onto the cd. Seems like it would be much better than stick on ones.\n\n"
    },
    {
      "time": " 6.Jul.2006 8.00am",
      "content": "William - yes, that’s the Xante I was talking about. I don’t find a lot of dot gain on the Ricoh, I think it’s pretty crisp actually, but of course 2400 dpi will give better results. I was just so floored with the value on the Ricoh - it’s only about $800 which makes it an unbelievably affordable machine for wide format, especially compared with the HPs which start at $1500.\n\nI would welcome recommendations for inkjets - especially those compatible with OS X as I will eventually need to replace that stupid Epson.\n\n"
    },
    {
      "time": " 6.Jul.2006 8.08am",
      "content": "@j\\_polo9.. for the Epson you stick a blank CD label onto a CD, then you put it in a special tray that fits into the printer. then you just print. The tray with the CD goes into the printer and prints directly onto the CD. Which is fine for one CD but it would be better to print directly onto the sheets so you can add them when needed such as when you need to send out a CD for someone.\n\nI wasn’t impressed by the images, they are all b&w on gold. And I wondered what happen to the CD printing does it get etched off?\n\nthese are some labels printed directly on the cd from the Epson\n\n ![](http://web.archive.org/web/20081120081303im_/http:/www.typophile.com/files/cd_6286.jpg)\n\n"
    },
    {
      "time": " 6.Jul.2006 8.41am",
      "content": "Lightscribe is so slow that my hair growth has surpassed it!  \nI print in color right on the CD with my Epson 960 (not a label).\n\nChrisL\n\n"
    },
    {
      "time": " 6.Jul.2006 7.25pm",
      "content": "Canon i9900, 8 colour inkjet, 13x19, great for doing my school work and smaller posters and things like that since the quality and colour definition is outstanding, plus it is nice to be able to print out spreads in full size for critiques. Not great with really fine details for type at text sizes but serves its purpose. I use my schools 2400 dpi HP lasers (wish I remembered the model) when I have needed to test output at text sizes etc.\n\n"
    }
  ]
}
