{
  "id": "21099",
  "title": "Typography 06 Critique",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "This is just an ode to typography. Does this look at all original? I have been so immersed in design lately I can not remember what I have and have not seen. Please critique concept and composition. Thank you in advance.\n\n ![](http://web.archive.org/web/20131018143925im_/http:/typophile.com/files/typ06_3459.jpg)\n\n",
  "author": "lazyeye88",
  "time": "3 Jul 2006 — 4:48am",
  "uid": "11443",
  "comments": [
    {
      "time": "3 Jul 2006 — 5:04am",
      "content": "Why are a-bit-less-legible-than-normal letters an ode to typography? And the missing parts are all around? I don’t get it but maybe you could fill me in?\n\nBut it reads ‘typography’ all right, that’s nice.\n\n"
    },
    {
      "time": "3 Jul 2006 — 8:04am",
      "content": "I take the incomplete letters along with pieces of characters as a hint at the \"working\" type. This composition, to my eye, talks about craft of using type. I think the weakness of the design is that the bits of letters become to decorative. I think maybe the bits should look as though they have been set aside or as if they are not yet included in the artist's work but may soon be needed (like a palette of letter parts).\n\nReally that is how i work. I will key some type in illustrator, then tear it apart, deform it, whatever and then put it back together. During the process i keep all sorts of copies, different approaches, etc just laying around the artboard.\n\nPerhaps this cover could be a \"snapshot\" of the process of working with type.\n\n"
    },
    {
      "time": "3 Jul 2006 — 8:16am",
      "content": "It looks like a CD Album case.\n\nNice though. I like the 06 / OG.\n\n"
    },
    {
      "time": "3 Jul 2006 — 8:59am",
      "content": "kinda cool but the letters look too unreasonably cut apart. It looks not random but neither does it look as if it was done purposefully. If you figured out a way to clean that up I think it would help a lot. Also I don't like how the pieces are all spread out. I would prefer them mixed togethar in a little group. Maybe like the E's on The Elements of Typographic Style.\n\n"
    },
    {
      "time": "3 Jul 2006 — 11:59am",
      "content": "Nice work. That is to say - it works. Great! Do you think you will post more itterations or ideas? The feeling is a little out of date as far as type nuts are concerned but I bet it would sell just fine.\n\n"
    },
    {
      "time": "3 Jul 2006 — 12:24pm",
      "content": "Thank you for all the comments.\n\nI suppose that calling this an ode to typography was slightly incorrect. This was more of an experiment in typography for myself. There wasn't really an underlying theme except for the fact that this has to do with typography and it's 2006!\n\nEach baseline is cut at alternate 3 degree angles. I like how on each line there's a sliver of the serif left behind to imply a delicate quality to the letterforms and at the other end the letter seems to be a mix between serif and sans.\n\nThis was just a puzzle for me, and I have, in the past, had a hard time composing elements. I figured the random shards of letterforms would make for nice abstract pieces of a puzzle to work with.\n\nI do suppose it is 'dated' feeling already, but I'm okay with that! Once I can make solid compositions, I will head for a more cutting edge feel in my layouts.\n\nThanks again for taking the time to critique my post.\n\n"
    },
    {
      "time": "6 Jan 2008 — 3:19pm",
      "content": "I had made something very similar for one of our classwork displays.\n\n ![](http://web.archive.org/web/20131018143925im_/http:/typophile.com/files/POSTER%20WORK%20DIPLAY_5817.jpg)\n\nSatya\n\n"
    }
  ]
}
