{
  "id": "21094",
  "title": "itunes help?",
  "forum": "Build",
  "tags": [

  ],
  "content": "i uploaded a whole bunch of mp3’s to my itunes and then changed /adjusted the names and artists on the itunes program.\n\ndoes this alter the file for good? i don’t want to have to do all the renaming all over again if i put them on another computer.\n\n",
  "author": "<a href=\"user/8034\" title=\"View user profile.\">nycersalife</a>",
  "time": "<br>",
  "uid": "8034",
  "comments": [
    {
      "time": " 3 July, 2006 - 12:55am",
      "content": "Altering the tags in iTunes will also modify the file itself.\n\n"
    },
    {
      "time": " 3 July, 2006 - 12:55am",
      "content": "Yes it does if you have checked the option “Keep iTunes Music folder organized” in advanced preferences.\n\n"
    },
    {
      "time": " 3 July, 2006 - 12:55am",
      "content": "Huh?\n\nAnyways, if you’re going to play them back on iTunes in another computer, they should retain any information that you edit in the first place. So yes, editing song information does alter them for good.\n\n"
    },
    {
      "time": " 3 July, 2006 - 1:11am",
      "content": "Grot - The tags in the MP3 file associated with the iTunes library will always be modified, regardless of whether that option is checked. “Keep iTunes Music folder organized” only sorts the files automatically in folders by artist and album.\n\n"
    },
    {
      "time": " 3 July, 2006 - 1:24am",
      "content": "Yeah, I think I read “does this alter the file name for good”…\n\n"
    },
    {
      "time": " 3 July, 2006 - 1:55am",
      "content": "THERE DOESN’T HAPPEN TO BE A WAY TO MODIFY THE FILE NAME TO LOOK LIKE THE ITUNES NAME, IS THERE?\n\n"
    },
    {
      "time": " 3 July, 2006 - 2:37am",
      "content": "If you select “Keep iTunes Music folder organized” in prefs iTunes will name the files with the track name.\n\n"
    },
    {
      "time": " 3 July, 2006 - 3:09am",
      "content": "iTunes can be good and evil when it comes to arranging your music. Although, there really is no better way to do this, then have it automagically completed for you. I have a large collection, and I can’t even fathom having to sort them myself at this point. Just be aware that iTunes may not archive things in the most intuitive manner. Sometimes I wonder what the hell that program is thinking, and half of all my problem arise from incorrect information in the ID3 tags.\n\nIt there are things that you are unclear about, as far as wether your information is correct or not, you might consider using [iEatBrainz](http://web.archive.org/web/20060705204712/http:/www.indyjt.com/software/). This tool attempts to match up a tracks acoustical fingerprint with another track that already exists in a large database. It’s not always right, so definitely exercise caution, but for the most part, I have found it useful. In my own experiences, it is most often the first match that will be correct, although on occasion it will produce several results. When this happens, I usually check a third source, such as Amazon.com to ensure that I am properly tagging the track with the appropriate information.\n\nIf there is anything i hate more than having corrupt fonts, strange fonts, or just font crap on my machine, it has to be having incorrectly labeled tracks in my iTunes library.\n\n"
    },
    {
      "time": " 3 July, 2006 - 3:23am",
      "content": "There are also Applescripts to change the file names if don’t want iTunes to manage your files.\n\n"
    },
    {
      "time": " 3 July, 2006 - 4:44am",
      "content": "If you axe this person from the list, maybe we’ll get back to type and they’ll go to the Apple site and a dating site for the help they need. If you answer, you’re nuts.\n\n"
    },
    {
      "time": " 3 July, 2006 - 7:32am",
      "content": "Typophile is so great, just because it’s all about type - and not a lifestyle forum, or something else… So please – let’s keep it a type related forum. There are SO many other forums for questions like this.\n\n"
    }
  ]
}
