{
  "id": "211",
  "title": "Siebel",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Background:   \nQuirky typographic oddities often live under the false   \nprotection of a corporate identity. These aren't limited to   \nmom and pop shops, some of these logotypes identify   \nwell-established, global companies. Some of them   \nhave been around a surprisingly long time. Too long.   \n   \nWe want to see them here.   \n   \nRules:   \n1\\_ Show us the odd, the strange and the poorly   \ndesigned logotypes or word marks of the corporate   \nworld.   \n   \n2\\_ Submit marks from companies that a lot of   \nus would recognize.   \n   \n3\\_ Provide some background if you know any.   \n   \n4\\_ Post a graphic please.   \n   \n5\\_ Show us stuff we can learn from. (Even if   \nit's learning from other people's mistakes.)\n\n",
  "author": "Joe Pemberton",
  "time": "8 Jan 2002 — 2:00pm",
  "uid": "1160",
  "comments": [
    {
      "time": "8 Jan 2002 — 2:20pm",
      "content": "Joe and I had the opportunity to design this client's site, which has evolved a little since we released it.   \n   \nThe corporate style guide placed a strong emphasis on the proper use of Benton Gothic, so we were intrigued by the corporate logotype, which uses a manually-squashed version of Benton Gothic Black.   \n   \nSomeone should approach Siebel with a small contract to clean this logotype up.   \n   \n ![siebel](http://web.archive.org/web/20150416181829im_/http:/www.typophile.com/forums/messages/4100/639.gif)\n\n"
    },
    {
      "time": "8 Jan 2002 — 2:25pm",
      "content": "You stole my thunder... heh.   \n   \nAt first glance, it's a typical American corporate logo.   \n   \nOn further scrutinization, you'll see that it's Benton Gothic (based on Benton's Trade and News Gothic faces. From FontBureau?) an otherwise great typeface but used here it's stretched 150%. Note how the cap S is unnaturally wide in the curves. Finally, the cut strokes are an attempt to customize this beauty one step further.   \n   \nThe Lesson: next time you want to use an extended face get one for the job. But don't force an otherwise beautiful face to contort its way into something 'original.'   \n   \n//joe\n\n"
    },
    {
      "time": "8 Jan 2002 — 11:13pm",
      "content": "Benton Gothic is a custom job done by FB. I think it's kind of a summing-up of all the MFB related gothics (Franklin, News, Alternate, errr.. Lightline?). It's in the FB 3rd edition specimen book. FYI, Trade Gothic was done by Jackson Burke (at Mergenthaler), not MFB.\n\n"
    },
    {
      "time": "9 Jan 2002 — 10:06am",
      "content": "Thanks for the correction. //joe\n\n"
    },
    {
      "time": "8 Jan 2002 — 3:08pm",
      "content": "\\> not the mom and pop video rental place you frequent.   \n   \nYou mean like this?   \n [http://bizstone.com/misc/wrongfont.html](http://web.archive.org/web/20150416181829/http:/bizstone.com/misc/wrongfont.html)   \n(Thanks L&S)   \n   \nLesson #1:   \nIf you're using a font with a curvy UC \"L\", watch your \"LI\"s very carefully...   \n   \nLesson #2 (unexpected plus):   \nWith the right font you can circumvent obscenity laws and grab some minds and hearts... and other parts.   \n   \nhhp\n\n"
    }
  ]
}
