{
  "id": "21102",
  "title": "Aquaholic",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This logo is for a boat called Aquaholic (the name should go over well with water patrol). She likes margaritas, so I used a margarita surrounded by tropical flowers, behind old parchment.\n\nI would like criticism on the illustration, but I would also like to know if there is a font that looks similar to what I have drawn in the thumbnail below. I have already tried the wedge serif Latin MT and I hate it. I don't know if what I have drawn is the best solution, but I want something more unused.\n\nThanks.\n\n ![](http://web.archive.org/web/20130304225341im_/http:/typophile.com/files/aqua_5218.gif)\n\n",
  "author": "cannon46",
  "time": "3 Jul 2006 — 7:48am",
  "uid": "1739",
  "comments": [
    {
      "time": "3 Jul 2006 — 8:13am",
      "content": "\"Brothers\" from Emigre looks to be the best solution so far. It has a woodcut look to it.\n\n"
    },
    {
      "time": "3 Jul 2006 — 8:21am",
      "content": "i love your lettering, why don't you digitize it?\n\n"
    },
    {
      "time": "3 Jul 2006 — 10:43am",
      "content": "I have to agree with Paul. The writing fits to the illustration. I like it alot.\n\n"
    },
    {
      "time": "3 Jul 2006 — 10:52am",
      "content": "I like the \"chunkier\" look of your pencil rendering. Use your type.\n\n"
    },
    {
      "time": "3 Jul 2006 — 10:56am",
      "content": "You might as well draw it Tom, you will have to distort a font to fit your art anyway. Give it a try.\n\nChrisL\n\n"
    },
    {
      "time": "3 Jul 2006 — 11:54am",
      "content": "I would just look at the 1st A & see if you can't get it working a bit better. I think it's angle is slightly off & it should be a little bigger. You might try it bigger than the other letters. Why stand on ceremony. It's a booze boat! The Q needs to be a bit bigger too I think. And maybe moove the right diamond to the right & make it bigger too. Your drawing seems head & shoulders over that line art. Which came 1st? The pencil drink looks MUCH tastier!\n\n"
    },
    {
      "time": "3 Jul 2006 — 8:53pm",
      "content": "Thanks for all your comments. The drawing was my first thumbnail and the vector art was many drafts later.\n\nI did what you all suggested. I traced my hand-drawn font, thickened the outer lines, reformed parts of the parchment to look more like the original thumbnail, and changed the inside of the flowers to look like the drawing.\n\nI still have to work out the lime. It is just floating behind the glass. I also have to possibly redraw the margarita inside the glass to look better.\n\nPlease keep the criticism coming. I have a feeling I will need it on my amateur attempt at type.\n\n ![](http://web.archive.org/web/20130304225341im_/http:/typophile.com/files/aqua4_5142.gif)\n\n"
    },
    {
      "time": "3 Jul 2006 — 11:55pm",
      "content": "My suggestions: Move the cross bar of the H up. On the A too. But just a bit. Not as high as the H. The middle A in the drawing seems like a better shape. The verticals on it in particular. In your drawing the Serifs on the U are smaller & have a better shape. Id like to see the Q a bit bigger & maybe with a different tail. This one seems too restrained for a party ship. What about bending the lettershapes to match the ribbon more? The lines on the top & bottom of the ribbon could be thicker. I think it would create a stronger text focus which will make the mark stronger overall I think.\n\n"
    },
    {
      "time": "4 Jul 2006 — 6:41am",
      "content": "I would add that the U and O need a bit more overshoot, especially with those chunky wedges, top of the Q has about enough although it could be a touch wider. The diamonds could do with something to help them sit with the illustration style, you might also add in some shading on the back of the ribbon as your pencil drawing.\n\nI might be confused but isn't a Margarita a cocktail?\n\nTim\n\n"
    },
    {
      "time": "4 Jul 2006 — 8:20am",
      "content": "It seems from the letters on the sketch to digital it lost a lot of character. The digital version looks to 'cleaned up'. The corners got sharper and the line widths got even, which I think makes it less interesting.\n\n"
    },
    {
      "time": "6 Jul 2006 — 9:13am",
      "content": "I have addressed most things suggested in the previous posts. I have made the minor changes on the type. I am still thinking about changing the way it flows with the banner. I am overall happy with how the drawing translated to vector.\n\nI changed the illustration of the margarita to make it tie to the water more by it splashing like a wave. I am still cleaning it up. I know I need to beef up some areas in it.\n\n ![](http://web.archive.org/web/20130304225341im_/http:/typophile.com/files/aq3_4442.gif)\n\n"
    },
    {
      "time": "6 Jul 2006 — 10:04am",
      "content": "As you say there is more work to be done to the type, but that tail on the Q is much better and the other changes to the illustration are definite improvements.  \nLooking good.  \nTim\n\n"
    },
    {
      "time": "6 Jul 2006 — 10:24am",
      "content": "The cross-bar on the H looks a bit out of perspective in angle. It looks a tad high on the right side.\n\nChrisL\n\n"
    },
    {
      "time": "6 Jul 2006 — 11:31am",
      "content": "Here is the adjusted \"H\".\n\n ![](http://web.archive.org/web/20130304225341im_/http:/typophile.com/files/aq6_6032.gif)\n\n"
    },
    {
      "time": "6 Jul 2006 — 12:10pm",
      "content": "That is much better but just a tad more is still needed I think.\n\nChrisL\n\n"
    },
    {
      "time": "6 Jul 2006 — 12:48pm",
      "content": "This is really great. My only crit might be the curve in the crossbars of all the letters. Because this is 2D, I find myself wondering if those curves aren't bumps in the banner. I might be tempted to draw a line which follows the curve of the banner and align my crossbar angles more to that.\n\n"
    },
    {
      "time": "6 Jul 2006 — 1:03pm",
      "content": "This is getting better & better. I really like the wave. I echo what Tiff said. Also, Rather than dink around with the letters one by one, as a technique I would print the thing minus the lettters & draw them in by hand a few more times until you get it to gel. It will be less frustrating, faster, more fluid & you have a better shot at getting it just right as a result. Digitizing the letters will be a snap after that. What about shading the leaves? I think the left side diamond still needs to be a bit bigger. Congradulations. It's gonna be sweet!\n\n"
    },
    {
      "time": "6 Jul 2006 — 1:51pm",
      "content": "I am offended by the concept. Adiction to anything is bad. To associate water to adiction is ofensive. You are a great designer, but its a horrible concept.\n\n"
    },
    {
      "time": "6 Jul 2006 — 3:10pm",
      "content": "I'm addicted to water.\n\nMust we never say <cite>typoholic</cite> again?\n\n[http://www.typophile.com/node/20733](http://web.archive.org/web/20130304225341/http:/www.typophile.com/node/20733 \"http://www.typophile.com/node/20733\")\n\nHumor often employs juxtaposition, and much humor has misfortune feeding its root.\n\n"
    },
    {
      "time": "6 Jul 2006 — 3:39pm",
      "content": "RE: feeding its root.  \nInteresting idea!\n\nRE: horrible concept\n\nI am not sure. Putting 'holic' in the name could be blutting the negative association but this has been happening for a long time with workaholic etc. Maybe the name should be praised as truth in advertising.\n\nIf cities don't want to have these business' they can stop licensing the boats. No? That has happened before. Maybe it's a good idea. Maybe not.\n\nBut agree that there is a provakative question embeded in the design. Tom: What's your attitude about this?\n\n"
    },
    {
      "time": "6 Jul 2006 — 5:29pm",
      "content": "\\>\\> I’m addicted to water.\n\nI'm an aquabib.\n\n"
    },
    {
      "time": "9 Jul 2006 — 10:03pm",
      "content": "Below are two new versions. I thought I would try an uppercase and lowercase mix as well as the all uppercase.\n\nAs far as shading the flowers, I have tried that and it is too much. It overtakes everything else.\n\nI think what Dan is saying is that associating water with alcohol is bad (surely he doesn't mean that being addicted to water is bad). It is an ironic title intended for humor. They like margaritas. They like water. They like drinking margaritas on the water.\n\nEither way, the client loves the concept and they pay the bills. It isn't a title I would choose for my boat, but it works for them. To each his own.\n\n ![](http://web.archive.org/web/20130304225341im_/http:/typophile.com/files/aqua2_6215.gif)\n  \n\n ![](http://web.archive.org/web/20130304225341im_/http:/typophile.com/files/aqua2_2_5717.gif)\n\n"
    },
    {
      "time": "10 Jul 2006 — 12:45am",
      "content": "There is something about this new a which seems much more in keeping with the subject. Nice one. But I think the 'a' itself needs a bit more work. It isn't fitting in yet. It seems too light for a start.\n\nWill there be a color version too?\n\nThe tail on the Q is really fippant now. I like that.\n\nMaybe try adjusting the shape of the O so it sits on the banner better.\n\nThe diamonds seems right now.\n\nThe AQUA letter could probably be just a bit bigger & taller to follow the banner shape & perspective better.\n\n"
    },
    {
      "time": "10 Jul 2006 — 12:48am",
      "content": "What if part the bowl of the cup overlapped the banner? That would add a little bit more dynamism to the composition. It would also look even more out of control. Ot more fun maybe.\n\n"
    },
    {
      "time": "10 Jul 2006 — 2:53pm",
      "content": "I dont like the smooth serifs much. I think the first edgy ones were better. They matches with the sharp shape of the banner. And I think that the L could be a little bit shorter to fit the whitespace between the letters L and i.\n\n"
    },
    {
      "time": "11 Jul 2006 — 9:56am",
      "content": "Or try to set the i over the arm of the L to make a Li ligature!?\n\n"
    },
    {
      "time": "11 Jul 2006 — 10:03am",
      "content": "Fun new direction with the lettering. I think the unicase version has a little more wink to it than does the standard U/lc. Not sure I'd do an Li ligature on the back of a boat because of readability.\n\n"
    },
    {
      "time": "11 Jul 2006 — 3:14pm",
      "content": "looking hot.  \ngreat to have seen the progression too.\n\n----------  \n**Paul Ducco**  \n [Solid Creative](http://web.archive.org/web/20130304225341/http:/www.solid-creative.com/motion.htm)\n\n"
    },
    {
      "time": "12 Jul 2006 — 8:56am",
      "content": "This is where I am going with the color. I am not happy with it yet however.\n\n ![](http://web.archive.org/web/20130304225341im_/http:/typophile.com/files/aqlogo_6157.gif)\n  \n\n ![](http://web.archive.org/web/20130304225341im_/http:/typophile.com/files/aqlogo2_6320.gif)\n\n"
    },
    {
      "time": "12 Jul 2006 — 9:12am",
      "content": "It could be the contrast, Tom. The flowers and the glass have less contrast between the colors than does the banner. The blue of the glass is brighter than the brown of the banner so it is popping forward more and throwing the dimensional quality out too.\n\n"
    },
    {
      "time": "12 Jul 2006 — 9:29am",
      "content": "Overall I think you need more saturation to the color. These colors are too dull for the fun feeling held in the illustration. Are you going for an old fashioned color scheme somehow? If so - why?\n\nGot a pantone book? I could suggest some numbers to you.\n\nIn the meantime why not try this: take your darkest brown on the banner & apply it to the shaded parts of the banner, take the lightest brown & make it the base banner color & then use a pure white for highlights? The lime is almost in the army there. It neeeds saturation. Maybe make it a lemon? I would look at making the leaves a darker green, the flowers a brighter purple & the drink/wave a bright magenta pink. The glass could have two colors, a pale ( but saturated) blue for the glass & a mix of the two for the contents of that cup seen through the glass.\n\nActually, what is the reason for the color restriction? Do you want to use flat solid color rather than 4 color process?\n\n"
    },
    {
      "time": "12 Jul 2006 — 9:43am",
      "content": "The cocktail glass looks steel, the liquid and lime could benefit from some white highlights, it seems to me that the drp shadow is redundant and there is not enough contrast on the scroll, in many ways I prefer the black, how are you producing this, vinyls?  \nTim\n\n_{edit: sorry most of my comments have been covered already}_\n\n"
    },
    {
      "time": "13 Jul 2006 — 9:18pm",
      "content": "Here is my progress. I am not done with colors, but it is improving. I will still add white to the splash. I know the colors are still dull, but I am still deciding on the highlighted areas and tweeking.\n\nI will be making this out of vinyl.\n\n ![](http://web.archive.org/web/20130304225341im_/http:/typophile.com/files/logo4e_3684.gif)\n  \n\n ![](http://web.archive.org/web/20130304225341im_/http:/typophile.com/files/logo4ef_4196.gif)\n\n"
    },
    {
      "time": "14 Jul 2006 — 7:03am",
      "content": "Glass is much better, background of the scroll is still too dark for my taste.  \nTim\n\n"
    },
    {
      "time": "14 Jul 2006 — 7:16am",
      "content": "I have nothing to add other than this is a mighty fine illustration/logo, Tom. Great work.\n\n"
    },
    {
      "time": "15 Jul 2006 — 10:24am",
      "content": "I have added more fresh colors and adjusted the illustration further. I think it is about done.\n\n ![](http://web.archive.org/web/20130304225341im_/http:/typophile.com/files/aqlogo_4856.gif)\n\n"
    },
    {
      "time": "15 Jul 2006 — 7:56pm",
      "content": "This is another color I am thinking of using. It doesn't takie away from the green as much as the other more yellow banner.\n\n ![](http://web.archive.org/web/20130304225341im_/http:/typophile.com/files/aqlogo4_6649.gif)\n\n"
    },
    {
      "time": "17 Jul 2006 — 7:08am",
      "content": "This is probably the final. I have showed this to the customer and they are happy.\n\n ![](http://web.archive.org/web/20130304225341im_/http:/typophile.com/files/aq_3656.gif)\n\n"
    },
    {
      "time": "17 Jul 2006 — 7:37am",
      "content": "I love it! Hope you will upload some photos of the printed stuff\n\nplzzzzz : )\n\n"
    },
    {
      "time": "17 Jul 2006 — 7:51am",
      "content": "Unfortunitely I have to send it off once I have the vinyl cut. They are then going to have it installed, so I won't see the final product (which happens too often to me).\n\n"
    },
    {
      "time": "21 Jul 2006 — 10:07pm",
      "content": "Hey this is a great process, bad luck I didnt came before so I could participate. Did you tried something with the lime? I still find it in the background.\n\nHowever, its an excelent result.\n\nRegards,\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n [www.gabssnake.4t.com](http://web.archive.org/web/20130304225341/http:/www.gabssnake.4t.com/ \"www.gabssnake.4t.com\")\n\n"
    },
    {
      "time": "22 Jul 2006 — 12:05am",
      "content": "I like the all overall design, but I think a continuation of the leaf & flower arrangement at the bottom of the banner will help to complete the design.\n\n ![](http://web.archive.org/web/20130304225341im_/http:/typophile.com/files/Aquaholic1b_6339.jpg)\n\nHope that helps...\n\nHiroshige\n\n"
    },
    {
      "time": "11 Nov 2008 — 5:49pm",
      "content": "Woah, that's a very nice illustration. Props!\n\n"
    },
    {
      "time": "11 Nov 2008 — 8:25pm",
      "content": "WTF TIME MACHINE?!?\n\n----------  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20130304225341/http:/www.solid-creative.com/)  \n [Bicycle Film Festival](http://web.archive.org/web/20130304225341/http:/www.bicyclefilmfestival.com.au/)\n\n"
    },
    {
      "time": "11 Nov 2008 — 9:12pm",
      "content": "lol\n\npenn\n\n"
    },
    {
      "time": "12 Nov 2008 — 1:37am",
      "content": "lol that's odd, didn't see that yet.\n\nI didn't necro the thread, it was on the frontpage.\n\nO\\_O\n\n"
    },
    {
      "time": "12 Nov 2008 — 1:41am",
      "content": "Maybe Typophile is just being weid, now it posted same message twice. (Which I now changed to this).\n\n"
    }
  ]
}
