{
  "id": "21100",
  "title": "Junius",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Ever since reading about [Menhart](http://web.archive.org/web/20131014013702/http:/typophile.com/wiki/Oldrich%20Menhart)'s Manuscript years ago in Bringhurst's _The Elements of Typographic Style_ I've wanted to do a digital version... but i wanted a super-cleaned up version. After getting to know Menhart's work a bit better, i decided a synthesis of his designs would be even more interesting for me. I want to make a text face that preserves what Brinhurst calls the \"abrasiveness\" of Menharts work. I finally broke down last week and started on it.\n\n ![](http://web.archive.org/web/20131014013702im_/http:/typophile.com/files/chutzpah_3459.gif)\n\nI started with the capitals and really liked how they turned out. Miss Tiff says that the diagonals feel too stiff compared to the elegant swoop of the diagonal stroke on the Z -- I haven't figured out the best way to fix this yet. I think the lower portion of the Z needs to be a bit heavier so that it doesn't just look like a mistake. The lower case follows the lc of Menhart's Parlament quite closely, but i'm less pleased with it than the capitals. I'm still in the process of tweaking the lc quite a bit. the a feels too wide to me. the bowls on bdpq feel squooshed a bit. the mid part of the g is a bit congested. the s is just wrong and need some serious attention. i'm not quite sure yet if i like the f or not... I like this best at 9-10 pts, but i only have a lazer printer to test this out on, so i'm not sure if i'm looking at the best printed samples to be judging. Anyhow, i thought i'd go ahead and throw this out there and get some feedback while i'm working on it too see if there are otherthings i overlooked/hadn't noticed. Thnx for taking the time to read this!\n\n| Attachment | Size |\n| --- | --- |\n| [chutzpah.pdf](http://web.archive.org/web/20131014013702/http:/typophile.com/files/chutzpah.pdf) | 26.21 KB |\n| [jsmplpdh0717006.pdf](http://web.archive.org/web/20131014013702/http:/typophile.com/files/jsmplpdh0717006.pdf) | 31.01 KB |\n\n",
  "author": "paul d hunt",
  "time": "3 Jul 2006 — 6:58am",
  "uid": "7006",
  "comments": [
    {
      "time": "3 Jul 2006 — 7:29am",
      "content": "I'm liking this… or at least parts of it. Without comparing this to any Menhardt sources, I have the following reactions:\n\nThe uppercase looks much nicer than the lowercase. The lowercase looks to me like it may have been \"too cleaned up.\" The lowercase a in particular does not feel right to me. Maybe in a text setting? The top curve feels too round and too \"perfect.\" The bottom right does not feel like it is anchored. The b feels lighter than d, p, and q. The arm on the r feels too light and too diminutive, although I like the hook, and I think that its relationship with the s is very cute.\n\nPlus your lowercase y may be one of the best lowercas y's I have ever seen.\n\nOn the caps, I have less to say. Except that the Q looks like it has been strangled by machine-setting requirements. How about more of a tail-swash?\n\n"
    },
    {
      "time": "3 Jul 2006 — 7:33am",
      "content": "Sorry if my last post sounds negative. I really like the direction you are going in… there are just a few parts that I'd like to take a hammer to ;-) I hope that the project turns out nicely.\n\n"
    },
    {
      "time": "3 Jul 2006 — 7:36am",
      "content": "no prob dan, thnx for the comments. if the pdf wasn't showing b4, it is now. this NEEDS a lot of hammering, esp at this point when it's still maleable. I agree on the Q, i don't know why i was trying to make it so discreet: Probably because I hadn't decided on a decender length at that point... oh, and to clarify, this isn't meant to be a literal rip on Menhart, just an \"inspired by\" kinda piece. in any case, have a look at the text setting in the pdf. thnx.\n\n"
    },
    {
      "time": "3 Jul 2006 — 8:25am",
      "content": "Paul, Good show dude! This thing is going to good places!  \nI don’t know Menharts work so I am just looking at this as just your own face and not a revival.  \nC D seems too wide for the O. The E F seems too wide and perhaps the U and Y as well. I really LOVE that Z and wish you could put some of that whimsey into the M V W and X. The M seems to be out of balance with itself. The counterspace under the right side looks smaller than that under the left side. Very sweet lookin’ S but the arm of the R feels a bit stiff.  \nI love your f but wish there was more of that chopped curve look in some of the other lower case. The a, x, and w seem a tad wide; splendid tail on the y, do more of it! (maybe in the upper right serifs of the v w x and y). The lower case is a bit too tame for me compared to the caps but at 9 point, it may not matter as much. You might think about a more varied stem width on vertical strokes throughout the lc similar to your f. The s seems a bit light to me and falling over right.  \nRelax and have fun with this puppy. It needs your sense of whimsey and it will be a fresh new feel in the text arena while still having enough pop for some display use.\n\nChrisL\n\n"
    },
    {
      "time": "3 Jul 2006 — 8:55am",
      "content": "The caps have wonderful liveliness. I agree with others that the diagonals other than the Z need more modelling. You might look to Palatino, which has tapered stems, for an example of how to handle the diagonals, though here you probably would want to do more. My feeling is that the Z is a little too modulated, but that the others need some.\n\nThe stress seems off on the 'e'; the north east quadrant seems too heavy. Overall, I think the stress on your round lc could be refined. The sharp link on the g doesn't seem to go so well with the rest of the character, which is round.\n\nCheck whether the caps and lower case are too much the same weight. I suspect the lc could benefit from lightening.\n\nThe f looks like it got its nose broken in a painful fight. I know you use the same angle on the arches of the mn, but there the contrast between the straight and round is not so great. Here it is extreme and out of character with the rest of the face.\n\nI think the thick diagonals on the lc also could also benefit with some tapering, I am guessing, though of course less than the upper case.\n\nI agree with Chris that the feel in the Z and y ought to make itself felt throughout the face. Though it is going to have to be a bit restrained if you want this to work as a text face.\n\nGood luck!\n\n"
    },
    {
      "time": "3 Jul 2006 — 11:16am",
      "content": "FYI: Alex White won a TDC award for his [Manuscript](http://web.archive.org/web/20131014013702/http:/tdc.org/news/2001Results/Manuscript.html) digitization. It looks you're taking a very different approach.\n\n"
    },
    {
      "time": "3 Jul 2006 — 11:59am",
      "content": "i was aware of White's digi version, but it doesn't really capture Menhart's essence for me. when i think of Menhart, I think crisp instead of blobbly. I think you can see a lot of Menhart in Veronika Burian's Maiola, although it is clearly her own thing. This is the kind of approach that i am trying to take.\n\n"
    },
    {
      "time": "5 Jul 2006 — 11:16am",
      "content": "{Tracking hook}\n\n"
    },
    {
      "time": "5 Jul 2006 — 11:38am",
      "content": "ChrisL\n\n ![](http://web.archive.org/web/20131014013702im_/http:/typophile.com/files/hook_3725.jpg)\n\n"
    },
    {
      "time": "5 Jul 2006 — 12:15pm",
      "content": "I'd say White's version is more of a Caricature--to borrow from John Downer's [excellent essay](http://web.archive.org/web/20131014013702/http:/www.emigre.com/Editorial.php?sect=2&id=1)--whereas what Paul is doing is an homage to the style.\n\n"
    },
    {
      "time": "5 Jul 2006 — 5:00pm",
      "content": "Hola, Paul (perdón escribir en español):\n\n¿Conoces este trabajo?\n\nSi lo deseas, pongo a tu disposición una imagen digitalizada. Pertenece al catálogo de la Bauersche Gießerei (ca.1930).\n\nSaludos cordiales,\n\n/p.\n\n ![](http://web.archive.org/web/20131014013702im_/http:/typophile.com/files/menhart_bauer_3607.jpg)\n\n"
    },
    {
      "time": "5 Jul 2006 — 7:06pm",
      "content": "hola pablo!  \nperdon por escribir in español malo.  \nSi, conozco este trabajo. es uno de los tipos que yo estudié en preparacion para hacer trabajo mio. Menhart Antiqua es muy bonito--tomé la estructura del serif de Antiqua.\n\n"
    },
    {
      "time": "17 Jul 2006 — 6:42pm",
      "content": "new pdf. see above. i've tweaked most characters, but still haven't tackled the J,K,f,j,k.\n\n"
    },
    {
      "time": "17 Jul 2006 — 7:21pm",
      "content": "At first glance, the base of the Z is too dominant. I really like your original Z better. I will give it a more thoprough look tomorrow but right now, sleep beckons :-)\n\nChrisL\n\n"
    },
    {
      "time": "19 Jul 2006 — 6:14am",
      "content": "yes? no? maybe?\n\n"
    },
    {
      "time": "19 Jul 2006 — 6:32am",
      "content": "I'll get back to you this evening on it Paul. but the s looks a bit narrow and the left sidebaring of the t is too big.\n\nChrisL\n\n"
    },
    {
      "time": "19 Jul 2006 — 8:02am",
      "content": "I think there are consistency issues here. Mind you, where to break consistency--and what constitutes a break--is a matter of judgment of the designer, and different people will have different views...\n\nNot working through it systematically, here are some that appear to me.\n\nThe serifs on the caps. the bottom of the E and L are much bigger than the other serifs. They can be a bit bigger, but these seem out of proportion. The vertical serifs can be a bit meatier relative to the horizontal ones, and I would go for thickening the C G etc vertical serifs rather than reducing the E L ones. Altogether, it feels to me like the serifs on the caps need more weight--at least the more pointy right sides anyway. I don't know what will work best, but I think it is worth trying a lot of variations on this, if you haven't already.\n\nLower case. The top counter of the a sticks out as being too big. It may be that the letter is too wide overall, or that the top arm needs to be shorter, the bottom counter bigger, etc. I don't know what will work, but it looks too big now. Does it come farther above the x-height than other letters?\n\nThe contrast on the e g look too little compared to other letters. Something else is off on the e; I'm not sure what. I agree with Chris the s looks narrow. But also you have big serifs compared to the size of the counters there, so that may be the problem. Also maybe the vertical part of the stroke may need to be thinner. I don't know exactly, but it needs work.\n\nThe horizontals on the calligraphically stressed z seem too thick. Also on the cap Z the top I would think needs more touch of the pen if you are going to go with the calligraphic stress. Goudy had put some more calligraphic z's into his faces, so if he can do it you can too, but I think it needs more consistency within the letter.\n\nOverall, the lower case doesn't have the same unity of look as your caps, which have a nice distinctive look. I would consider, if you haven't tried already, flattening the angle on head serifs to resemble the slant on the right part of the foot serifs. This might unify the look with the upper case, which I find the most successful part of this design so far.\n\n"
    },
    {
      "time": "29 Jul 2006 — 5:29pm",
      "content": "Anyone else want to comment on this one before i take an axe to it?\n\n"
    },
    {
      "time": "29 Jul 2006 — 7:42pm",
      "content": "Paul,  \nDon't take an axe to it! You have given yourself a tough task with this one. Give yourself some time with it.  \nEvery time I look at it, I get hung up on what is a font metrics issue and what is a glyph shape issue. I see some proportion group issues as well. The a as opposed to the s is the most troublesome pair. They should feel like they are in the same proportion group but the s feels quite narrow compared to the a. The s can work ok at display sizes but at text size, it is a dark spot. There is a lot happening in that small space withe three horizontal curves and 2 big serifs. You have to find a way-to open it up more like the a. The a may be a tad too wide though.\n\nI am missing a rhythm in the lower case. I think you need a bit more of the curve whimsey you have in the caps. You might try a few lines with a flat pen mimicking your font just to take you out of this stiff stage. I think you are putting too much pressure on yourself to have something for Typecon that is far along. This puppy may take more long walks than you expect. Bring it to TypeCon in whatever stage it is by then. Those guys may have some real insight for you to solve this anyway.  \nI have looked at it several times since your first post. Every-time I think I see something that might help, I go back to it and say to myself, that is not the solution. I mumble to myself, trying to find some sage advice but come up empty handed. A silly thing I do is look at type upside down just to take away the familiarity you get from long hours with it. Here I go again, rambling with no nugget to give you.\n\nThere is something there of value though. You must know that. My guess is, if you gut it out, you will end up with something quite unique in a good warm, friendly way. I know this kind of struggle but I don't know the magic potion to pull you through it. I know you should stick with it though.\n\nChrisL\n\n"
    },
    {
      "time": "30 Jul 2006 — 6:14am",
      "content": "Paul,  \nI think it is the diagonals that make the rhythm strange for me. Also, the lowercase o is too clean for the rest. Rotate the stress on it back a tad.\n\nYou were probably asleep when I called this morning but give me a call back.\n\nChrisL\n\n"
    },
    {
      "time": "31 Aug 2006 — 11:58pm",
      "content": "I was going to comment on the 1st pdf, but you fixed a lot in the second! Forgive me if I repeat comments, as I haven't read like a good boy.\n\nStill, your thins are a little inconsistent in the caps. See the U and B especially. R leg needs a touch more length. It's lifting. Q: put some goudy in already! oops did that slip out? r needs more heft in the horizontal move. Not quite the stem width but close. That beak will be interesting to space. The f too (weight I mean). w,v too flat on bottom for my taste. Not related at all to the uppers. More point. Dot on j and i seem boogerish, which is a technical term for too blobish in a face where pen is in evidence. Also seem high to me. lc z is too expressive relative to the rest of the lowercase, see next scentence.\n\nSomehow, I get the feeling that you're designing a set of display caps and text lc. Maybe take it one direction or the other in a commanding way. I'd go towards the caps. They say less \"hello, my name is spikey palatino\" than the lowers. Can you post some source that's influencing your LC?\n\nI prefer a slightly shorter cap height, but that's me.  \nThat's more than my fair share of opining. It's a good start.\n\nCheers,  \nRandy\n\n"
    },
    {
      "time": "1 Sep 2006 — 6:06am",
      "content": "Hi Randy! Welcome back! I have not seen you about for a while.\n\nChrisL\n\n"
    },
    {
      "time": "1 Sep 2006 — 6:42am",
      "content": "Hey Randy, thnx a lot for taking the time to look at this. I always appreciate your insights. I have a long way to go on this before i'll be happy with it, but it's my first original serif and i think i'm learning a lot in the process. It's funny you caught that the lc looks a lot like palatino, i didn't reference it in any way while drawing this, but maybe it's just embedded in my subconciousness and came out. I'm planning a major overhaul on the lowercase. thus far i've done as much as bumping the x-height and changing the head serifs. now i want to go back and put a lot more pen influence in it, including those boogerish dots on the i and j. Your comment on trying to go too display and too text in one font is a great one. I think my problem is i'm _trying to_ think in terms of optical sizes and what different sizes may look like, but all that's resulting at this point is an over-bold display face. hopefully i'll get it all wrangled out in the end so that the text version works for text and the display for, well... you know. If you want to see the sources of my \"inspiration,\" i've tried to capture the essence of [Manuscript's Capitals](http://web.archive.org/web/20131014013702/http:/diacritics.typo.cz/view_image.php?id=47) and marry them to the more stately lower case of [Parlament](http://web.archive.org/web/20131014013702/http:/diacritics.typo.cz/view_image.php?id=49) while stealing the overall serif structure of Menhart Antiqua. Hopefully it will all come together for good effect in the end. Thanks for looking!\n\n"
    },
    {
      "time": "1 Sep 2006 — 6:49am",
      "content": " ![](http://web.archive.org/web/20131014013702im_/http:/typophile.com/files/MenhAntiqPDH090106_4946.jpg)\n\nMenhart Antiqua (for reference)\n\n"
    },
    {
      "time": "1 Sep 2006 — 7:33am",
      "content": "Thanks for the scan. Menhart's unusual and beautiful Z is related to the other caps in their tapering thins (see KMNVWXY). You've put more more flourish in the thicks (see MN)and left the thins relatively uniform. I think his solution works better because it causes more consistent sparkle in the UC and the taper is reinforced by the serifs.\n\nI look forward to seeing where you go next.\n\nChris: Howdy!\n\n"
    },
    {
      "time": "4 Sep 2006 — 5:33am",
      "content": "Hi, I am new and young so this is just an opinion, I can't claim any authority.\n\nI agree with Randy that the lc looks too much like palatino, or it seems to me it is more in the spirit of Zapf than Menhart (my only source on Menhart is Bringhurst). Zapf to me is just as much about pen as Menhart but he is so extremely mechanical in modulation and movement that it is perhaps \"easier\" to go that way when you do something digital. I would loosen up the lc and try to put some of Mehart's careless flair into the forms. A good example of this flair is the lc z in Manuscript, wich I don't think Zapf would pull in his wildest dreams.\n\n"
    },
    {
      "time": "9 Sep 2006 — 10:01pm",
      "content": "Love the tail on the cap R...in ballet, that's called a battement tendu...the only problem I have is with that corner chop taken off the curve on the lowercase f...when it shows smaller, it will look like a tiny bit of bad printing.\n\n"
    }
  ]
}
