{
  "id": "21119",
  "title": "Newt, fmrly. Salamander, feat. Greek",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "This entire font, to say it quite honestly, is actually back-engineered from the italic g. However, as that has quite a bit of character, the font itself ended up with quite a bit of character, and it can stand on its own and not just as something to put around the italic g. It's a recent sketch, which means I'm still neglecting some older ones, but I've decided I'm not going to do anything with any fonts other than this one this summer, being as how I need to do other things too, and fonts have an interesting way of swallowing all available time. I came up with the name Salamander, but to my horror discovered that that name is already taken, so I'll have to come up with something else, I guess. In fact, any ideas would be welcome, though they will probably have to be inspiration for one that I think of, because I could never bear releasing a font under a name someone else had come up with. (How did Zapf do that with Optima?) I have a few concerns I'll preliminarily voice:\n\na: too annoying?  \nb: spike unattractive?  \nK: odd?  \nitalic p: remove nub?\n\nOther stuff: haven't done kerning on italic yet. The story is the beginning of one I came up with on the fly; originally I hadn't thought of anything and I started out not knowing where I was going to go from the sentence about going barefoot. I know the italic seems kind of too formal, but the roman I came up with was the only one I could think of to be its counterpart, and I've grown to like its rustic sort of charm as well as the italic's seeming formality.\n\n| Attachment | Size |\n| --- | --- |\n| [Sal.pdf](http://web.archive.org/web/20150123044316/http:/typophile.com/files/Sal.pdf) | 55.07 KB |\n| [Sal2.pdf](http://web.archive.org/web/20150123044316/http:/typophile.com/files/Sal2.pdf) | 71.29 KB |\n| [Sal3.pdf](http://web.archive.org/web/20150123044316/http:/typophile.com/files/Sal3.pdf) | 171.97 KB |\n| [Sal4.pdf](http://web.archive.org/web/20150123044316/http:/typophile.com/files/Sal4.pdf) | 91.14 KB |\n| [GrecianFormula.pdf](http://web.archive.org/web/20150123044316/http:/typophile.com/files/GrecianFormula.pdf) | 34.81 KB |\n| [Sal5prime.pdf](http://web.archive.org/web/20150123044316/http:/typophile.com/files/Sal5_0.pdf) | 320.68 KB |\n\n",
  "author": "Number3Pencils",
  "time": "4 Jul 2006 — 5:57pm",
  "uid": "7642",
  "comments": [
    {
      "time": "4 Jul 2006 — 11:50pm",
      "content": "a is too annoying, b is falling left. The italic looks real nice, maybe you could remove the nub, though. The descender of q ends oddly. Should the roman lower case be just a little bit narrower?\n\n"
    },
    {
      "time": "5 Jul 2006 — 4:57am",
      "content": "Your work is absolutely nice. I love it.  \nI have to agree with Grot Esqué and it also seems that your round letters have no overhang!?\n\n"
    },
    {
      "time": "8 Jul 2006 — 5:42am",
      "content": "I too like it a lot, and I agree with most things Grot Esqué and Steven said.\n\nOn the other hand the lc 'a' is kinda sweet. It gives the font more character, which IMHO is a good thing. The horizontal part of the 'a', with the little curl on, should be thinner. That way it is not that present in the font what could work out positively on the annoyance factor.\n\nYour baseline overshoot could be bigger, if there is one at all. This brings a bit more optical balance in the font.\n\nI agree that the lc romans could be a bit narrower. The italics seem to be very narrow compared to the romans.\n\nI do like the italics, but you could give the UC a bit more personality. The V, W, Y, Z could be a good starting point.  \nPersonally I would put the italic 'f' a bit more upright. It seems now to have a steeper angle than the rest of the characters. It would give it a bit more classical note if it was less italic than the rest.  \nThe only character that feels out of tune is the lc 'x'. I can't really say why, but to me it just doesn't seem fit to the italic character of the font.\n\nOther than that I would not change that much. Some little things that I see and would propably change myself:\n\nITALIC  \n- The italic UC should be narrower.  \n- The middle stem of the lc 'w' a bit lower. It seems to stick out a bit too much.\n\nROMAN  \n- The lc 'b' needs more balance. It wants to be an italic, but is held back by the ascender. Perhaps the upper bowl/stem connection is too open.  \n- The 'r' could be a bit wider. You could than also make the right side serif a bit longer for balance.  \n- The '6' seems to be too small next the the '5'. Try making the ascender higher. The '9' would follow the '6'. Don't make the bowls smaller.  \n- UC 'T' could be less high. The horizontal part seems to stick out.  \n- Lc 'u' a bit narrower.  \n- Balance the UC 'S' a bit. It seems now like a cobra about to attack. The upper inner form seems much smaller than the lower. Maybe opening the upper part by bringing the serif out would do it.  \n- Maybe a little 'leg' on the 'G' would work here. It's now completely round in the bottom. You could than make the inner serif a bit smaller, what would open the 'G' more.\n\nBOTH  \n- the dot on the 'i' bigger. It seems much smaller than the comma. The same goes for the ; :\n\nThis font should be balanced disharmony so don't loose too much of the irregularities.\n\n®\n\n"
    },
    {
      "time": "8 Jul 2006 — 6:00am",
      "content": "I very much like the freedom of it! It still reads well with the almost cursive flair in the terminals. The top of the a where the curve meets the upright needs to be tapered into the curve because it causes a dark spot there which pops out to me.\n\nChrisL\n\n"
    },
    {
      "time": "21 Jul 2006 — 3:00pm",
      "content": "This is interesting, Nathanael. I'd like to look at it more closely before suggesting anything. I'll print your PDF and have a look. From first glance I agree with Chris; it has a nice freedom.\n\nZapf actually was not given a choice in naming Optima. The foundry chose that name and apparently it was their prerogative to override Zapf's choice, which (I think) was Neue Antiqua. I tend to agree, from a marketing standpoint, Neue Antiqua is not evocative and even a little dry and vague.\n\nBack then, there weren't 40,000 typefaces available anywhere, much less from one website, so it was a lot easier to choose a name. I got Mundo Sans because I asked Archie Provan at RIT to register it with the name registry in 1993, and then later (1998) when I finally released Mundo Sans (the first time) it was still available. Once, I saw something in a FontShop catalog named Mundo, but it was renamed or pulled, I assume since they discovered I had registered the name.\n\nHowever, I do not advocate hoarding unused names in the registry; that's as bad as hoarding web domains.\n\n"
    },
    {
      "time": "30 Jul 2006 — 6:09am",
      "content": "A luscious typeface. The trouble with the 'a' is that the top is too square; it may be fixed by exaggerating those curves rather than toning them down.\n\nI would suggest a portmanteau of \"salamander\" and some other word beginning with \"mand-\".\n\nWhere is this registry? I'm over the same barrel...\n\n"
    },
    {
      "time": "19 Aug 2006 — 11:13pm",
      "content": "I'm back! And I brought revisions with me. I've:\n\n-made more characters  \n-followed most of Characters's suggestions, with the exception of:  \n--narrowing down the italic caps  \n--fooling around with the italic x (I like it!)  \n--putting a leg on the G  \n-lightened the top of the a  \n-put a lot more overhang on round letters (I always drastically underestimate for some reason)  \n-&c.\n\nI'll leave it to you fine folks. Also thank you for what you've already given me.\n\n"
    },
    {
      "time": "22 Aug 2006 — 5:56am",
      "content": "This is coming along now. It is a bit less free so it needs some more correction in the joins. The problem is mostly in the n and m. The cut needs to be a tad deeper, perhaps change the curved join to a hard corner? Look at the b d p q as well but they don't show the dark spots as much as the m n u glyphs.\n\nChrisL\n\n"
    },
    {
      "time": "12 Sep 2006 — 3:52pm",
      "content": "Hi Nathanael,\n\nHow's everything? I finally got this newer PDF out and had a look. I think it's good. There are uneven bits, mostly in proportions and weights, which probably jump out at you in a larger text setting. There's lots of personality, and I think the soft finish is pleasing in that context. This design especially looks like a good starting point to adapt for both extended text and display. Things like the upward spur on a, z, 2, 3, and 7 could be carefully modulated in the text variant to be quiet enough not to disrupt, and enhanced with all the other vivacious traits in the display cut. The Italic has a skeleton and a rhythm that could easily be adapted to text sizes. Intriguing.\n\nI'd say, decide if you want to enhance the hand-drawn feel of it, or polish it more and make it more \"typographic\". See also Sirenne from MvB fonts, and Olduvai (Veer.com), which Randy Jones developed and shared here on Typophile.\n\nI also have to point out; depending on what sizes it will be intended for, x-height to cap-height to ascender height is an important relationship. At this point, I know I'm not alone in feeling I can only take a typeface so seriously if it has a voluminous x-height. \"Classy\" is shorthand for small x-height. Salamander's x-height isn't monstrous, but it is large for a text face. With a design this informal and lively, it might be useful to have this height relationship established, and then adapt the liveliness and proportions to that. Even so, you can do versions for text and display. Goudy's designs are interesting to look at with that in mind.\n\nThe double-dagger from your PDF is very fun (among other things).\n\n"
    },
    {
      "time": "26 Jan 2007 — 8:23pm",
      "content": "Hello, or haldo, as the case may be!  \nI've made a couple new weights for this. I still have yet to make italics for the new weights. I also worked on the roman. Significantly, I think I've figured out the way to make the \"a\" work in text. I made the point less pointy, more blunt. The \"z\" followed. And I ironed out a few kinks and things of that nature. One thing I didn't get to, apparently, was fixing the right bearing on the light \"!\". And, somehow, I ended up with naked letters in some of the diacritic letter spots in the italic.  \n-My only preliminary concern here is, is my bold not bold enough? After that, I leave it to you. Sample at top: Sal3.\n\n"
    },
    {
      "time": "27 Jan 2007 — 6:30am",
      "content": "Not being an expert, I can say that I like the \"feel\" of this typeface, its friendly quirkiness, and that the bold is sufficiently bold for me. Cheers!\n\n"
    },
    {
      "time": "17 Mar 2007 — 11:38pm",
      "content": "I've made two new weights. Only two left until the completed family! Here they are. I made a bold bolder than the old bold; old bold is now \"demi\". I like the way that sentence sounds. The new weights are the new Newt Bold and also Newt Light Italic. New sample, Sal4, up top. Critiques much appreciated on these and the other weights. Thank ye all.\n\n"
    },
    {
      "time": "20 Mar 2007 — 9:52pm",
      "content": "Beautiful. I question the italic \"ae\" in that it almost reads like \"ie\" or \"ce\"...\n\n"
    },
    {
      "time": "26 Mar 2007 — 9:49pm",
      "content": "Hi Nathanael,\n\nQuickly:\n\nBold looks narrow; add weight to outside of letters, not just inside. With counters so small, it now wants tighter sidebearings. See aegsn in all weights to compare these proportions.\n\nLight and Light Italic look like typewriter versions of the regular and Italic. Also long serifs look highly exaggerated in the Light Italic. Serif length can be varied from one weight to another, independently of serif thickness, stroke contrast and everything else. Can you make a trial of some Light versions with more contrast and less flappy, emphatic serifs? In Light Italic especially, long serifs give noisy effect. Consider that at this weight, nobody can use the Light for small text anyway, so smaller serifs and more delicate details are appropriate. For an example of this, see the different weights of the Luxury Text faces by House Industries. Because the Regular is so finely detailed, the Bold works better at smaller sizes than the Regular. In the case of Newt, the Demi looks to me like the basic Text weight and the Regular looks like a Light text weight. That makes your Light into a display version.\n\nUnless you want these all to be for display. In which case, blow them up and take note of which features don't fit at large sizes.\n\nRoman designs: The Dutch trend toward soft terminals on s notwithstanding, Newt has such emphatic, classic serifs, I would suggest using them on s and especially S as well.\n\n"
    },
    {
      "time": "27 Mar 2007 — 5:32pm",
      "content": "Aw phooey, I liked the big serifs. I even planned to make them that way. Also, I don't even know how I would go about putting a serif on the s and S. I don't think it could look anything other than awkward. It would just end up looking like Windsor. I'll probably give it a shot, but I don't guarantee anything.\n\n"
    },
    {
      "time": "14 Apr 2007 — 10:18pm",
      "content": "I thought I'd take a break from designing new weights to design some new characters, namely, a Greek section. There are so few of those Greek text fonts with the delightful reversed stress. I decided I'm going to add my font to them. Critique appreciated, hopefully even from a real live Greek person.  \n(New PDF above)\n\n"
    },
    {
      "time": "18 Apr 2007 — 2:48pm",
      "content": "I'm not sure your l-c kappa works for me, but I'm no Greek. I just read the language.\n\n"
    },
    {
      "time": "18 Apr 2007 — 5:52pm",
      "content": "What is it about the kappa that bugs you?\n\n"
    },
    {
      "time": "18 Apr 2007 — 7:53pm",
      "content": "It feels more like a nu than a kappa, to me, anyway. I'm probably completely off base here, but it seems to me that the upper arm starts too low? It's entirely a style thing, though.\n\n"
    },
    {
      "time": "19 Apr 2007 — 1:24pm",
      "content": "Well, what my kappa here is is a compromise between the two popular kinds of kappa. I like the clarity of the second--the first seems amorphous--but I had to change it a bit towards the first to get it to show reversed contrast like the rest of the font. I think the second form evolved into the first in this picture; Newt's kappa is about halfway through the evolution. However I'll see what I can do to integrate the lower leg more into the design--it does sort of look tacked on.\n\n ![](http://web.archive.org/web/20150123044316im_/http:/typophile.com/files/aptemp_4388.PNG)\n\n"
    },
    {
      "time": "20 Apr 2007 — 7:35am",
      "content": "I think your kappa is exactly the sort of thing we need.\n\nhhp\n\n"
    },
    {
      "time": "20 Apr 2007 — 10:21am",
      "content": "I didn't even notice the 'κ' when I looked at the PDF, so I think it's fine.\n\nHowever, the 'φ' reads as a 'ψ' to me. You may want to go with the other form. I'm no expert on Greek, so take this with a few grains of salt.\n\n- Lex\n\n"
    },
    {
      "time": "3 May 2007 — 2:37pm",
      "content": "Well, I like it!  \nI wouldn't change much more. The whole nature of the font is the quirkiness and playfullness. The more you change now, the more risk you take in killing the beauty of it.  \nI think your italic is absolutely beautifull and very natural and it fits very well to the roman.  \nYou should work on your fonts more like a sketch and not a construction, IMHO. That way you preserve the freedom and playfull nature of it.\n\nI do agree with the 'ae' ligature, though. It looks like 'ie'. Besides some really minor tweaks here and there, I think it's ready for the next level.\n\nRegards,  \n®ené\n\n"
    },
    {
      "time": "3 May 2007 — 3:13pm",
      "content": "Thanks for the vote of confidence, René! And thanks to the rest of you for the suggestions too. I haven't been responding to any of these threads, because I've been really busy for a good while, what with deciding on and enrolling in a college, and graduation, and AP tests. Probably I should have planned ahead and said I was going to be. I have, however, already reworked the æ. I'm not sure about the phi-psi issue; how changing it to the other form would make it much clearer, but I'll take a look at it again and see if it works. One concern I have about that, though, is that if I change the phi to curlicue form, I'll lose the big strikethrough, and only the psi will have it, and it will look out of place with only one character incorporating it. But as I say I'll try it out. I'll have to do some brute work making the other two weights, and then some more to put the Greek in all seven that don't have it. That sounds like something I can do after seniors get out of school on the 23rd. After I finish that, I'll post another sample up here for some more critique, and then, hopefully, go on to selling it, for which I'll solicit advice. Until then, thanks for all the help.\n\n"
    },
    {
      "time": "19 Jun 2007 — 3:42pm",
      "content": "Okay. Man, did this ever get tedious. Remind me not to draw a font with eight styles again when it's such a detailed font and all the corners have to be rounded off. Anyhow, I've finally finished all eight styles, though I still only have Greek in the regular. Here's an exhaustive sample sheet (Sal5 up top).\n\nDo you think I ought to rename the weights:  \nLight -\\> ?  \nRegular -\\> Light text  \nDemibold -\\> Dark text  \nBold -\\> Bold  \nOr something along those lines--or just keep them the way they are?\n\nAny critique is welcome, including finding stupid mistakes I haven't caught, such as characters that are in the wrong weight, or characters with spacing that's off.\n\nI might do Greek for the rest of the weights soon, but I'm a bit burnt out on this font, so I might do something else before I try that.\n\n"
    },
    {
      "time": "19 Jun 2007 — 3:54pm",
      "content": "Nathanael this is gorgeous. There is something about this design that really resonates with me. The light weight especially.\n\nLooking at it I wonder if the lowercase italics, in the regular weight, aren't a bit think compared to the uppercase?\n\n"
    },
    {
      "time": "19 Jun 2007 — 4:14pm",
      "content": "Is that \"thick\" or \"thin\"? Probably \"thin\"; I'll take a look at it, thanks.\n\n"
    },
    {
      "time": "19 Jun 2007 — 4:57pm",
      "content": "Query: Which S is best? I just cooked these up, after rereading the comments and seeing Crossgrove's.\n\n ![](http://web.archive.org/web/20150123044316im_/http:/typophile.com/files/allpurposetemp_5058.PNG)\n\n"
    },
    {
      "time": "19 Jun 2007 — 5:25pm",
      "content": "I think no. 1 is the best\n\n"
    },
    {
      "time": "19 Jun 2007 — 5:28pm",
      "content": "The first one goes best with the lc.  \nBut if you find you'd like the caps to stand apart a bit, the second one is very nice.\n\nhhp\n\n"
    },
    {
      "time": "28 Jun 2007 — 3:41pm",
      "content": "Okay, I've done a few very minor edits to spacing and such, and I also thinned out the italic capitals a little bit to match the lowercase, whereas I also almost imperceptibly bulked up the serifs in the lowercase, but now they don't look like they're going to fall apart anymore. Hopefully it all looks roight noice.  \n-So now, I want to know: being as how I put in applications too late to find a summer job this season, I want to make at least some money so I can help pay for my absurdly expensive college education starting this fall. Is this font of saleable quality? And, if it is (hopefully), how do I go about selling it? I've never done it before. I also do not have my own website. And, how much money can I expect to make off a font such as this? Will I be able to expand the family to include Greek and Latin-Extended after it's put up for sale? (I need to get a more high-end font editor, because TypeTool 2 doesn't support any codepages that aren't Basic Latin. I figure if I sell now I can get something better and then expand from there.) I'm new to this stuff.\n\n"
    },
    {
      "time": "6 Jul 2007 — 11:31pm",
      "content": "I guess I kind of got lost in the shuffle during the server switch. I'm going to bring my font here back up to the top, because I never did get any responses, and I really would like to try to market it this summer. If anyone has any helpful ideas, or perhaps a webpage to point me to, for advice on selling a font, that would be quite spectacular for me.\n\n"
    },
    {
      "time": "6 Jul 2007 — 11:40pm",
      "content": "_Is this font of saleable quality?_\n\nyes.\n\n_And, if it is (hopefully), how do I go about selling it?_\n\neither try approaching a foundry or distributor to market your typeface. you might try [veer](http://web.archive.org/web/20150123044316/http:/typophile.com/wiki/veer), or set up you own foundry through [MyFonts](http://web.archive.org/web/20150123044316/http:/typophile.com/wiki/MyFonts).\n\n_how much money can I expect to make off a font such as this?_\n\nit all depends on your pricing, the market, and your arrangement with a distributor.\n\n_Will I be able to expand the family to include Greek and Latin-Extended after it’s put up for sale?_\n\nyes. many foundries go back to popular typefaces and extend them for additional language/typographic support.\n\n"
    },
    {
      "time": "7 Jul 2007 — 11:18am",
      "content": "Thanks for the advice. I snooped around veer's site, but I couldn't find anything about how to sell a font with them. But, browsing their catalog, it seems all theirs have very complete character sets: could I expect to get them to sell Newt with just Basic Latin so far? And then, if I decide to set up a foundry to use MyFonts, what does that entail? Would I have to create a website, or just submit a font to them under a foundry name? Which site do you think would get my font better exposure and (no point in pretending I don't care about it) me more money? And, how should I price a font such as this?\n\n(Should I create a new thread in the Marketing & Promotion area for this stuff?)\n\n"
    },
    {
      "time": "7 Jul 2007 — 11:30am",
      "content": "you're quite welcome for the info, i hope it's helpful. distributing through veer and through myfonts both have pros and cons. Just a few quick notes:  \nMyfonts gives a greater royalty rate (so you get to keep more of each sale), myfonts is well known and hordes of type fans go there first to see what's new. however, your fonts and foundry can easily be lost among the thousands and thousands of typefaces offered there. Veer gives a smaller royatly than Myfonts, but they do more extensive marketing, including beautiful printed pieces that may feature your fonts. If you want to go the Myfonts route, check out: [http://www.myfonts.com/info/prospectus/](http://web.archive.org/web/20150123044316/http:/www.myfonts.com/info/prospectus/ \"http://www.myfonts.com/info/prospectus/\"), if you want to see if Veer would be interested, contact [Grant](http://web.archive.org/web/20150123044316/http:/typophile.com/user/1011). if you have other questions, you can post them here or contact me directly: your option. just trying to help you get this out the door as soon as you can. :D\n\n"
    },
    {
      "time": "11 Jul 2007 — 2:41pm",
      "content": "Easy ways to get started selling your fonts: myfonts and fonts.com. they both have specifications for sending data, and different royalty arrangements. But I would not expect a tidal wave of income from font sales, especially if they send checks quarterly. I'm not commenting on your typefaces or your abilities, but on the statistics of the type industry. Your design would need more marketing (like with Veer or FontShop), as well as that rare, universal appeal, to really launch into the stratosphere. Retail type is speculative, so there's very little assurance you'll even make bus fare. Again, I am not being harsh or judgemental, it's just tough. With thousands of new products every year, it's hard to make an impression. There really isn't a motherlode of money in retail type unless you're offering thousands of different products. Don't be discouraged; do be patient. Summer is also not a big money time in general, unless you're in tourism.\n\nOne way to work this is to finish 2 or 4 weights to a decent character set, then offer them for sale. If response is good, finish the other 4 weights and add them. If not, you've tested the waters and minimized your time investment.\n\nDesign thoughts: Choose the S that goes with the caps, so all-cap setting don't look weird. We're used to seeing this split personality in mixed-case settings, so it's not that important to match features like this with lowercase. Another option is also to use the more straight or firm serifs on the lowercase. Remember, one single feature does not define the character of the design, especially a design this lively. Be willing to discard something small in order to get better harmony among all the parts. Otherwise it's lettering, not type. Consider also the sort of arabesque serif from the a, applied to the s. Could be the top or bottom one, probably not both. Try it!\n\nIs the Sal5Prime PDF the latest? I still think the internal proportions need work. The Bold looks so narrow compared to the breezy, wide Roman and Light. The eocdbqp look so pinched, whereas E and A look wide. And the spacing of the Bold is also too loose. Put a line of text up with mnuhilt together; see how stems within a letter are close, and stems between letters are far apart. This effect is greater in the Bold Italic. An easy way to deal with both issues is to move stems apart, losing sidebearing width and gaining internal space.\n\n"
    },
    {
      "time": "12 Jul 2007 — 12:53pm",
      "content": "Yes, Sal5prime is the latest--I replaced Sal5 with it, but it was only a minor update, so I didn't change any of the text. I've sent an e-mail to Grant, and gotten one back saying that he thinks some of your comments ought to be applied. Unfortunately, I didn't see your latest comment here until after I sent him back an e-mail with the font files. (I thought he was talking about your older comments.) I'll probably implement some of your ideas, now that I've seen them. However, I think an upward serif on the s would make it look distractingly like a 5. (And on the bottom, it turns out looking like something from a blackletter or a Poe book.) By the way, until I have money to commit to a less temperamental font program, I can't do anything with any codepages other than basic Latin (I'm with TypeTool 2 right now, and it has certain foibles, one of which is that it only lets you generate a font with one codepage at a time, so Twardoch has told me). I've finished that codepage for all eight weights. The Greek you see up there is actually mapped to Latin letter spots.\n\nWhich S did you mean--2 or 3?\n\n"
    },
    {
      "time": "5 Nov 2007 — 8:46am",
      "content": "I came here via the link you posted on the [type ID board](http://web.archive.org/web/20150123044316/http:/typophile.com/node/38699). The only thing I see right now in Sal5prime.pdf, is that I think your lc 'c' could probably use a bit of overshoot on the bottom. Only slightly, about as much as the 'e'. I see the 'c' bouncing up when I read the text. Since it actually sits above the baseline (as far as I can see in the PDF).\n\nWell, consider it. It's looking very nice nevertheless. :)\n\n"
    },
    {
      "time": "6 Jan 2009 — 1:29pm",
      "content": "Hello after a long time, everyone!  \nNewt Serif has at long last been released, with Veer. I've [made a thread](http://web.archive.org/web/20150123044316/http:/typophile.com/node/53193) in the Release section of the forum. Thanks for all your help! You've definitely helped Newt Serif to become a better font.\n\n"
    }
  ]
}
