{
  "id": "21118",
  "title": "I ‘found’ a letterpress museum.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all,\n\nLast night I made a trip out of town into the middle of nowhere to find a place called the [Bedplate Press Printing Museum](http://web.archive.org/web/20150322223848/http:/www.bedplatepress.org.nz/). The chaps there are total enthusiasts, all skilled in various areas of letterpress, Intertype / Linotype machines, rotary & platen presses. The have a fairly solid collection of wood type, hand-set metal type (Univers! Yes!) and those Linotype/Intertype matrices (I think that is what they are called). It is most definately a working museum.\n\nAnyway, my head was reeling last night, all I dreamed about was what I could do with this stuff. However, I am aware that it may be of limited interest to other people, especially in New Zealand. So I was wondering what we could do to garner interest in the museum. What have others done to revive interest in this beautiful technology? Who would be the ideal people to target? What sort of businesses would benefit from letterpress printing?\n\nAny ideas would be gratefully received.\n\n—K\n\n",
  "author": "kris",
  "time": "4 Jul 2006 — 2:14pm",
  "uid": "1519",
  "comments": [
    {
      "time": "4 Jul 2006 — 4:51pm",
      "content": "Hi Kris,\n\nWe have a similar place here called the [Melbourne Museum of Printing](http://web.archive.org/web/20150322223848/http:/home.vicnet.net.au/~typo/welcome.htm). It's called a museum, but it's basically a huge warehouse o' stuff in piles that survives because of the passion of a dedicated few. I've been a couple of times to see the machines they have working in action, and the main guy, Michael, gets so excited. It's brilliant.\n\nOne way that they've tried to get themselves out into the public eye (well, the design public eye anyway) is through the AGIdeas design conference that runs annually here in Melbourne. Design Nights are held on the first night of the conference where groups of students get to go and spend an evening at a design studio somewhere around Melbourne. MMP has been involved over the last two years, and from what I've heard the nights have been very successful, with students heading back later to get a print or a bit of type made for an assignment, or whatever.\n\n"
    },
    {
      "time": "4 Jul 2006 — 10:39pm",
      "content": "Hi Kris,  \nA few years ago I think they wanted to move their equipment into the city, potentially in partnership with Massey's School of Design. Obviously, nothing came of it. Which is a pity, as both Victoria and Otago universities both have their own antique press facilities. Used for both comercial and academic purposes.  \nLink:  \n [Otago](http://web.archive.org/web/20150322223848/http:/www.otago.ac.nz/nzpg/print/research.html)  \n [Victoria](http://web.archive.org/web/20150322223848/http:/www.vuw.ac.nz/wtapress/)  \nIt would seem to be the kind of thing that the Designer's Institute would have some interest in too. Maybe.\n\nDavid\n\n"
    },
    {
      "time": "5 Jul 2006 — 1:39pm",
      "content": "Kia Ora David!\n\nThe chaps did tell me that they had a possible opportunity with Massey, but it fell through. It was going to be too expensive etc. I am sure that there must be a government fund somewhere to help out.\n\nThanks for all the replies so far! Very helpful. Any more?\n\nK\n\n"
    },
    {
      "time": "5 Jul 2006 — 5:06pm",
      "content": "The [Museum of Printing](http://web.archive.org/web/20150322223848/http:/www.museumofprinting.org/) has such a collection. You could e-mail them and ask them what they are doing to promote themselves. One thing is that they have regular visits from students at design schools in the area.\n\nI visited it this spring and it is wonderful.\n\nAnother thing they are doing is co-sponsoring TypeCon this year. There will be a trip to the museum also as a final activity.\n\nThe Museum of Printing also holds the Merganthaller Linotype library of over 250 thousand measured drawings of type, including Dwiggins' types--pretty amazing stuff.\n\n"
    },
    {
      "time": "1 Jul 2011 — 9:46pm",
      "content": "I am Hidayat Tapran from Bandung Indonesia, for your Info we just rebuild an antik intertype machine (see bellow), if somebody interest for these machine please contact me ( [jh.tapran@gmail.com](mailto:jh.tapran@gmail.com))\n\n ![](http://web.archive.org/web/20150322223848im_/http:/typophile.com/files/DSC04363-30_4092.jpg)\n\n"
    },
    {
      "time": "1 Jul 2011 — 9:48pm",
      "content": "Here is another 2 picture.\n\n ![](http://web.archive.org/web/20150322223848im_/http:/typophile.com/files/DSC04361-25_4820.jpg)\n  \n\n ![](http://web.archive.org/web/20150322223848im_/http:/typophile.com/files/DSC04357-30_4758.jpg)\n\n"
    }
  ]
}
