{
  "id": "21121",
  "title": "(x) Puma's World Cup uniforms font - custom font by Dalton-Maag {Miguel}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Anyone know anything about the ytpeface used for the players' names on the back of their uniforms? It's all lowercase and stunning. Is it custom/what is it/who designed it? I love it! I have yet to get a sample. but will try to photograph the TV for some captures during the final on Sunday.\n\nITALIA!!!\n\n",
  "author": "timfm",
  "time": "4 Jul 2006 — 9:32pm",
  "uid": "1235",
  "comments": [
    {
      "time": "4 Jul 2006 — 10:45pm",
      "content": "Equally, the German team seems to have had a bad version of Bauhaus on theirs. I think today the best typography won.\n\n"
    },
    {
      "time": "4 Jul 2006 — 11:29pm",
      "content": "[http://www.typophile.com/node/16565](http://web.archive.org/web/20141115033142/http:/www.typophile.com/node/16565 \"http://www.typophile.com/node/16565\")\n\n[http://www.typophile.com/node/20681](http://web.archive.org/web/20141115033142/http:/www.typophile.com/node/20681 \"http://www.typophile.com/node/20681\")\n\n"
    },
    {
      "time": "4 Jul 2006 — 11:29pm",
      "content": "Dalton Maag London!!! [www.daltonmaag.com](http://web.archive.org/web/20141115033142/http:/www.daltonmaag.com/ \"www.daltonmaag.com\") for information about \"Italians look better!\"\n\nPuma Pace!\n\n"
    },
    {
      "time": "4 Jul 2006 — 11:42pm",
      "content": "Well put! The german had letterspaced the names so that they’re equal in lenght but with names like Lahm and Schweinsteiger, you know how it’s gonna end…\n\n"
    },
    {
      "time": "5 Jul 2006 — 12:12am",
      "content": "Interesting to me is that so many contrries have the same jersey design. Adidas seems to have mandated how its country teams' jerseys will look. This is why Germany, France, Argentina, etc. all had the same (ugly) type and numbers—this ITC Bauhaus monstrosity. Italy, Switzerland, and at least one other country were sponsored by Puma, who got their type from Dalton Maag.\n\nUmbro and Nike seem to have taken a different approach. Their jerseys all have **different** lettering, some of which, like that for England, was even designed by \"local\" typographers (i.e., The FA uses a custom typeface by Jeremy Tankard).\n\nSo, we can't really say that the best typography won yesterday: Italy may have had better lettering on their jerseys, but those letters weren't really Italian. Tonight, Nike's Portugal jerseys go up against Adidas' French ones (which look quite similar to the German jerseys from last night…). Will the final be Puma–Nike or Puma–Adidas? I love the new Puma lettering (and the ingenious lowercase!), but I'd like to see Adidas… errrr, France, take it all on Sunday anyway.\n\n"
    },
    {
      "time": "5 Jul 2006 — 12:20am",
      "content": "\\> _(...) I think today the best typography won._\n\nWell, \"best\" being a relative concept. The Puma type looks like a poor man's version of Max Kisman's early work. I'm so not impressed.\n\nThe Dalton Maag typefaces usually are pretty OK, but altogether not very exciting nor particularly inventive.\n\n"
    },
    {
      "time": "5 Jul 2006 — 4:02am",
      "content": "Well, another german link here, sorry. But quite interesting in this case I think.  \nJürgen Siebert from fontshop.de was contacted by Bruno Maag from DaltonMaag because of his weblog-entry regarding jersey-typography. And Jürgen posted the comments of Bruno Maag in his weblog [Fontblog](http://web.archive.org/web/20141115033142/http:/www.fontblog.de/files/bruno_maag-spricht.html#unique-entry-id-315). Enjoy.\n\nEDIT: Here is a poor translation of it, please forgive my english:\n\n\"A comment on my contribution thought on the Worldcup-jersey-Typografie came from the creator of the Puma typeface ” Pace “, Bruno Maag.\n\nQuote:\n\nRegarding lowercase-writing: It is unusual, because you always see uppercase. But I find it refreshing doing things new.\n\nNo special characters for Polish: The Font has a full character set with all necessary specifications for West and Eastern Europe. If users do not use it, it is not a fault of the typeface. Other nations have managed to use their characters.\n\nOrganization of the numbers: there are clear regulations from FIFA and UEFA concerning the design-area. I think italizing the numbers is a refreshing idea. It indicates movement and the shadowline is a decoration element, which is not necessarily wrong.\n\nNames have different lengths: We have to live with this fact. Designing specific fonts with different widths is not a practicable way. Don’t forget that the jerseys are made at local print shops (which aren’t the best in typography). They simply get their font and insert the name. Period. It doesn’t makes much sense to give them more opportunities.\n\nFootball jerseys have a fashionably expiration date: What we see at the WC today is out of date next year. According to it the Typo has to present itself. Balanced Typografie is not important, what matters is the uniqueness in the competition. In the case of Puma we chose numbers developed on a rectangle.\n\nTypeface Design: We co-operated closely with GBH Design. The basis were sketches, developed from a rectangle. Deliberately no curves were integrated. We worked on different versions of the serifs, but in the end we decided that the current are the best. The problem of the readability is solved, because everything is written in uppercase.\n\nReadability: You always have to be aware in which cases the typeface will suit the purposes. The typeface was never be intended to be used anywhere else than on jerseys. For something longer than names it is not useful. And don’t forget: The readers do not read letter by letter, they always read whole names\n\nBranding: Puma has succeeded in having created a profile against the competition (Nike, Adidas). All Puma jerseys use the same typeface. It is a beautiful example of corporate design. I think that this typeface is perfect for the purpose. I do not know what happens next year or at the European Cup also. Anyhow, the typeface is practically, either in fashion matters also regarding jersey-production. Finally, for me as a type-designer: The job was well done.\n\nBruno Maag, Dalton Maag Ltd.\"  \nEnd of quote.\n\n"
    },
    {
      "time": "5 Jul 2006 — 6:02am",
      "content": " ![](http://web.archive.org/web/20141115033142im_/http:/typophile.com/files/netherlands_home_vnr_300_6598.jpg)\n  \n,,Luftkissenfahrzeug '' \n"
    },
    {
      "time": "5 Jul 2006 — 5:38pm",
      "content": "Yves,\n\nTo what earlier work of Max Kisman’s do you refer?\n\nt\n\n"
    },
    {
      "time": "5 Jul 2006 — 7:27pm",
      "content": "Hi Vincent,\n\nAny chance I could get a look at the lc \"s\" or you could maybe give  \nme a sample of the setting \"timpish.\" I like to base a logotype for a  \npersonal project on Puma Pace, but with significant modifications.\n\n-t\n\nps - [techsupport@connare.com](mailto:techsupport@connare.com) is broken\n\n"
    },
    {
      "time": "6 Jul 2006 — 12:44am",
      "content": "[FF Vortex](http://web.archive.org/)  \n [FF Rosetta](http://web.archive.org/web/20141115033142/http:/www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufacturer&displayfontid=FF.730.0.0)  \n [Traveler](http://web.archive.org/web/20141115033142/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=HO.118938.0.0)\n\n"
    },
    {
      "time": "9 Jul 2006 — 3:04am",
      "content": "@timfm...\n\nabout Puma Pace :  \n\"Created exclusively for the client, **this product is not available to buy or licence.**\"  \n [http://www.daltonmaag.com/browse/custom/clients/puma](http://web.archive.org/web/20141115033142/http:/www.daltonmaag.com/browse/custom/clients/puma \"http://www.daltonmaag.com/browse/custom/clients/puma\")\n\n"
    },
    {
      "time": "24 Jun 2010 — 11:15am",
      "content": "On a similar note - does anyone know the font on the Slovakian jerseys? (Sorry, this is the best picture I could find)\n\n ![](http://web.archive.org/web/20141115033142im_/http:/typophile.com/files/Screenshot_5595.png)\n\n"
    },
    {
      "time": "24 Jun 2010 — 11:25am",
      "content": "Mandy – would that be the Adidas font that Yomar Augusto did?:  \n [http://fontfeed.com/archives/world-cup-typography-yomar-augusto/](http://web.archive.org/web/20141115033142/http:/fontfeed.com/archives/world-cup-typography-yomar-augusto/ \"http://fontfeed.com/archives/world-cup-typography-yomar-augusto/\")  \nAlso see: [http://typophile.com/node/71295](http://web.archive.org/web/20141115033142/http:/typophile.com/node/71295 \"http://typophile.com/node/71295\")\n\nBTW, it's usually a better idea to start a new thread for a new inquiry.\n\n"
    }
  ]
}
