{
  "id": "21126",
  "title": "Complete beginner - What's best to start with?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi all,\n\nI've only ever designed two fonts, way back during my time at college. (One was called Pill Popper, which can still be downloaded off of 1001fonts.com)\n\nAnyway, I designed these using some Windows program called FCP - Font Creator Program - which I think I bought online from about £20. It was okay, but given my lack of font design skills, I spent ages forming one character! I also didn't have much of a clue about how things should be spaced, kerned, etc...\n\nI've been graphic designing for three years in book publishing - I want to get back into designing some fonts, even if it is only ever a hobby/personal work.\n\nI need to know where to start. I know that Fontographer is available for OSX, which would set me back a few hundred quid. Or is there another option to creating fonts? Can I use Illustrator, or Photoshop? Or is there a better alternative to Fontographer?\n\nAre there any suitable books for designing digital typefaces? Recommendations a must!\n\nApologies if you've had loads of email like this before.  \nBest,  \nRuss\n\n",
  "author": "russ",
  "time": "5 Jul 2006 — 3:45am",
  "uid": "4902",
  "comments": [
    {
      "time": "5 Jul 2006 — 4:25am",
      "content": "[http://www.as8.it/edu/bibliography-TD.html](http://web.archive.org/web/20150427113415/http:/www.as8.it/edu/bibliography-TD.html \"http://www.as8.it/edu/bibliography-TD.html\")\n\n"
    },
    {
      "time": "5 Jul 2006 — 4:27am",
      "content": "Russ: Go to Fontlab.com and look at all of the options for software, I also think Leslie Cabarga's \"Logo, Font and Lettering Bible\" might be a good book for you to get an idea of working methods. [http://www.logofontandlettering.com/](http://web.archive.org/web/20150427113415/http:/www.logofontandlettering.com/ \"http://www.logofontandlettering.com/\")\n\n"
    },
    {
      "time": "5 Jul 2006 — 6:51am",
      "content": "Thanks for the links guys.\n\nI've been comparing Fontographer with FontLab Studio... Fontographer is (much) nearer my budget - but Fontlab Studio has other features, but would actually benefit me...  \nFor example, what is \"TrueType hinting\"?\n\nThere's other things I don't understand, so maybe it's best to crawl, then walk before running! Should probaby head down the safer route with Fontographer, as a novice! At least it can import EPS files - that way I could create some Illustrator letterforms and bring them into Fontgrapher.\n\nHow did you guys start out making fonts? Is the Fontographer software easy to get on with? The FCP software I previosuly used was quite basic.\n\n"
    },
    {
      "time": "5 Jul 2006 — 7:08am",
      "content": "Russ, Fontographer is simpler and quicker to learn - If you know Illustrator or Freehand, then it is pretty easy to pick it up. At some point you will want to move on to FontLab as you progress.\n\n"
    },
    {
      "time": "5 Jul 2006 — 9:27am",
      "content": "I am pretty much a beginner in Font-producing aswell, and by coincidence I started with Fontographer. After a couple of weeks I started to love it. If you compare the path-tools with Illustrator – Fontographer is so much better and more \"logical\" in a way too.\n\nThere is really only one thing that bothers me about Fontographer, and this is the strange preview. It doesnt show (or print out) fonts with a good screen resolution. So if you want to look at it on screen, you'll have to use InDesign or similar app. And also print from another app.\n\nOn the other hand; this is also actually rather nice in some strange way. It feel a little bit retro - and it doesnt bother mo anymore.  \nI would probably advance to FontLab sometime in the near future UNLESS Fontographers big feature update that is coming, implements a better screen preview and some Opentype-support. Today it can't produce Opentype-fonts, so if you want to add some Opentype-feature, you have to open the Fontographer-file in Fontlab anyway.  \nDownload and test the demo's available at Fontlab.com, and see what appeals to you.\n\nWith the latest CS2 Illustrator you can even copy paste Illustrator vectors. But really, you dont gain anything if you start drawing the letters in Illustrator - better do them directly in Fontographer (or Fontlab) in my opinion.\n\nBut, hey - just a little warning: Designing Type is like a drug! You can't stop ;-)\n\n"
    },
    {
      "time": "5 Jul 2006 — 6:38pm",
      "content": "\" For example, what is “TrueType hinting”? \"\n\nFor a good explanation, see Laurence Penney's page:  \n [http://www.truetype-typography.com/tchint.htm](http://web.archive.org/web/20150427113415/http:/www.truetype-typography.com/tchint.htm \"http://www.truetype-typography.com/tchint.htm\")\n\nAnd the Monotype Typography page:  \n [http://www.microsoft.com/typography/AboutFontsOverview.mspx](http://web.archive.org/web/20150427113415/http:/www.microsoft.com/typography/AboutFontsOverview.mspx \"http://www.microsoft.com/typography/AboutFontsOverview.mspx\")\n\nThey do a good job of summarizing, which I won't attempt (I could go on and on...)\n\nJason Campbell\n\n"
    },
    {
      "time": "5 Jul 2006 — 6:47pm",
      "content": "One thing you should consider: Type Tool has the same interface as FontLab. So if you contemplate going on to FontLab, it would mean less to re-learn than starting with Fontographer.\n\n"
    },
    {
      "time": "11 Jul 2006 — 6:02am",
      "content": "Thanks for all the help/info, guys.\n\nGood point about the demo's - will try them out!  \nIf Fontlab is the (obvious) progression from Fontographer, it might be best to buy that first and save the expense...\n\nAdmittedly I'm thinking of starting with display fonts (like big chunky Designer's Republic fonts) and then hopefully moving onto sans and then serif families... crawl before walking!\n\nAre there any \"Dummies Guides\" to the Font Lab and Fontographer software?\n\n"
    },
    {
      "time": "11 Jul 2006 — 6:24am",
      "content": "[Learn FontLab Fast](http://web.archive.org/web/20150427113415/http:/www.logofontandlettering.com/).\n\n"
    },
    {
      "time": "11 Jul 2006 — 6:57am",
      "content": "Excellent - will have to get it shipped over to the little island of the UK. (Amazon.co.uk don't stock it!)\n\nP\n\n"
    }
  ]
}
