{
  "id": "21120",
  "title": "Looking for a typeface with squiggly outlines and dotted/slashed \"O\"s",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "hey, i’m looking for a font that i’ve seen before but can’t seem to find an example of. i’ll try my best to describe it, so please bear with me.\n\nthe most prominent feature are the O’s…there’s dot in the center and a diagonal slash through it. the outlines aren’t clean, they’re a bit squiggly, and it’s a solid color. i had originally thought that it was the type used on the old Bloodwars card game, but i was wrong.\n\nif you guys could help me out, i’d totally appreciate it.\n\n",
  "author": "<a href=\"user/13704\" title=\"View user profile.\">25cents</a>",
  "time": "<br>",
  "uid": "13704",
  "comments": [
    {
      "time": " 4 July, 2006 - 10:59pm",
      "content": "It doesn’t have the O you’re looking for, but you could do worse than [FF Merlin](http://web.archive.org/web/20070223090745/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories_search=font_name_search&searchstr=ff+merlin&image.x=0&image.y=0).\n\n"
    },
    {
      "time": " 5 July, 2006 - 12:47am",
      "content": "actually, i’m looking for something pretty specific, it’s for a tattoo.\n\nand it’s not quite so squiggly (based on the ‘d’ and the ‘g’), but thank you for the effort.\n\n"
    },
    {
      "time": " 5 July, 2006 - 7:42am",
      "content": "If you can’t find an example, why not try to draw one?\n\n"
    },
    {
      "time": " 5 July, 2006 - 7:47am",
      "content": "when i get home, i’ll give it a shot. it ain’t gonna be pretty though.\n\n"
    },
    {
      "time": " 5 July, 2006 - 8:38am",
      "content": "argh, now that i think about it, the ‘o’ is the only letter i really have memorized.\n\nguess i better get back to browsing 1001fonts.com\n\n"
    },
    {
      "time": " 5 July, 2006 - 11:52pm",
      "content": "it looks a LOT like this font…\n\n[Blood Omen](http://web.archive.org/web/20070223090745/http:/www.dafont.com/img/charmap/b/l/blood_omen0.png)\n\n"
    },
    {
      "time": " 6 July, 2006 - 3:25am",
      "content": "[Kadonk](http://web.archive.org/web/20070223090745/http:/www.typodermic.com/61.html)?\n\nThat “Blood Omen” doesn’t look very attractive, even for a free font.\n\n"
    },
    {
      "time": " 6 July, 2006 - 3:25am",
      "content": "Where did you see the font? That could help.\n\n"
    },
    {
      "time": " 6 July, 2006 - 4:40am",
      "content": "no, nothing like kadonk.\n\nlike i said,it’s only similar to BO, but the slash on the o is diagonal and i don’t believe there’s so much frilliness.\n\nand i could have sworn i found the font on [1001freefonts.com](http://web.archive.org/web/20070223090745/http:/www.1001freefonts.com/), but when i looked the other day, it’s nowhere to be found. i’ll have to look again, i s’pose.\n\n"
    }
  ]
}
