{
  "id": "21141",
  "title": "introducing myself",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everyone  \nI came across this forum whilst looking for some information about Louis John Poucheé’s Ornamented types but got distracted by the content of some of the posts - it’s great to see such informed information and eclectic tastes!\n\nOne particular post I thought I’d make a comment on was one about Trajan and the origin of the serif; I believe it was Catisch who suggested that the roman lettercutters painted their letters on the masonry first and then carved them and that the serif may have developed from this practice. Well, I’ve considered this, having done some lettercutting myself over the past ten years (only in an amateur fashion I hasten to add, but under some fairly qualified guidance) and what I’ve found is that its actually much easier to carve a letter with serifs than without – the purely mechanical action of the chisel and the angles at which you use it at, particularly at the terminals of letters seems to suggest that serifs were developed as a practical response to the question of ’how can I finish this letter off neatly and uniformly’. Square-ended ’sans serifs’ are much harder…\n\n| Attachment | Size |\n| --- | --- |\n| [first alphabet!.jpg](http://web.archive.org/web/20080213234605/http:/typophile.com/files/first%20alphabet!.jpg) | 192.65 KB |\n\n [‹ Nike font 2006](http://web.archive.org/web/20080213234605/http:/www.typophile.com/node/21058 \"Go to previous forum topic\") [I've got a question. ›](http://web.archive.org/web/20080213234605/http:/www.typophile.com/node/21226 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080213234605/http://www.typophile.com/user/13715\" title=\"View user profile.\">jack sans</a>",
  "time": "<br>",
  "uid": "13715",
  "comments": [
    {
      "time": " 6.Jul.2006 4.03am",
      "content": "[http://typolapidaire.free.fr](http://web.archive.org/web/20080213234605/http:/typolapidaire.free.fr/ \"http://typolapidaire.free.fr\")\n\n"
    },
    {
      "time": " 6.Jul.2006 5.59am",
      "content": "Wow! Beautiful! I hope you can excuse these outbursts... I have quite a fetish for stone carved letters. I spent about a month in college carving New England slate. Those letters were just terible, though... that stone is in a deep, dark place... never to see the light of day again!\n\nI found your comment “Square-ended ‘sans serifs’ are much harder…” quite interesting. When you are drawing with a brush (or even a broad nibbed pen), or carving, it is certainly more convenient to flare out and use serifs. But when one is drawing outlines, straight lines win out in the contest against curves every day of the week. So, digitally, serifed letters are much more different. Interesting parallel, I guess.\n\nIn Emigre 64(?), Elliot Earls wrote an interesting piece about contemporary type design approaches. What I remember the most from that piece was his emphasis on stroke endings. He wrote that something has to happen there to define the design of the face (if I rememebr correctly).\n\n"
    },
    {
      "time": " 6.Jul.2006 6.36am",
      "content": "Lovely caps you have cut there Jack!  \nI quite agree about the stone cutting tools and the practical reason for the serif to come into being. If you start with a V shaped tool, it is difficult to start with a flat cut. The Romans sure did do it in a striking manner though :-)\n\nChrisL\n\n"
    },
    {
      "time": " 7.Jul.2006 6.40am",
      "content": "Welcome, impressive carving and working in the SPQR is a nice touch.  \nTim\n\n"
    },
    {
      "time": " 11.Jul.2006 2.37am",
      "content": "Thanks Tim - believe it or not most people don’t spot the SPQR - I guess we all scan over things - well spotted!\n\n"
    },
    {
      "time": " 11.Jul.2006 2.42am",
      "content": "Thanks ChrisL - much appreciated. Strangely enough the ancient Greeks did cut alot of ’sans’ - hence Lithos but I’m led to believe they had a different technique in their carving...\n\nThanks again\n\n"
    },
    {
      "time": " 11.Jul.2006 2.47am",
      "content": "Hi Dan\n\nThanks for the enthusiasm - is the New England slate a deep red? I’ve seen a Richard Long stone sculpture/installation of deep red slate and wondered where it came from. Hehe I know what you mean though about stones in deep dark places - the lettercutter who taught me described my first attempts at serifs as “British Rail angle-irons” - the profile of a railway track I guess!\n\nThanks again\n\n"
    },
    {
      "time": " 11.Jul.2006 2.48am",
      "content": "Thanks Alessandro  \nlettercutting - the movie!\n\n"
    },
    {
      "time": " 11.Jul.2006 2.59am",
      "content": "The New England slate I was refering to is a gray slate. I think it gets almost black if you polish it.\n\n"
    },
    {
      "time": " 11.Jul.2006 12.28pm",
      "content": "“Strangely enough the ancient Greeks did cut alot of ‘sans’ “\n\nJack,  \nΓια την απόλαυσή σας  \nThis site may be of interest to you:\n\n[http://www.csad.ox.ac.uk/CSAD/Images.html](http://web.archive.org/web/20080213234605/http:/www.csad.ox.ac.uk/CSAD/Images.html \"http://www.csad.ox.ac.uk/CSAD/Images.html\")\n\nChrisL\n\n"
    }
  ]
}
