{
  "id": "21150",
  "title": "Searching for a sober sans serif",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi all. This is my first post here, so I'm not sure if I'm in the correct forum. In any case, I'm searching desperately for a sans serif that isn't so warm, fun, cute, etc. Something along the lines of Din in coldness/seriousness, but not so tech-y. I just tried Aaux Pro, but I think it's a bit too Din-like. Freight Sans and Whitney are nice, but a little warm. Galaxie Polaris is close, but maybe too similar to Helvetica. Am I crazy or is this hard to find? Any recommendations?\n\n",
  "author": "<a href=\"/web/20110603061656/http://typophile.com/user/13723\" title=\"View user profile.\">jeanjeudi</a>",
  "time": "<br>",
  "uid": "13723",
  "comments": [
    {
      "time": "",
      "content": "Flama?  \n [http://vllg.com/Feliciano/Flama/mudTyper+Weights/](http://web.archive.org/web/20110603061656/http:/vllg.com/Feliciano/Flama/mudTyper+Weights/ \"http://vllg.com/Feliciano/Flama/mudTyper+Weights/\")\n\n"
    },
    {
      "time": "",
      "content": "[Facit](http://web.archive.org/web/20110603061656/http:/justanotherfoundry.com/Facit/index.htm)  \n [Flama](http://web.archive.org/web/20110603061656/http:/vllg.com/Feliciano/Flama/mudTyper+Weights/)  \n [Malmo Sans](http://web.archive.org/web/20110603061656/http:/www.fountain.nu/catalogue/malmo.asp)  \n [Pill Gothic](http://web.archive.org/web/20110603061656/http:/www.veer.com/products/typedetail.aspx?image=UMT0000043)\n\n"
    },
    {
      "time": "",
      "content": "Most geometric sans (Futura, Avenir, etc) feel very sober to me. If you are looking for something not geometric, try [Kievit](http://web.archive.org/web/20110603061656/http:/www.fontfont.com/shop)'s lighter weights.\n\n"
    },
    {
      "time": "",
      "content": "Thanks! Good choices. I tend to not really like geometrics in text, though I think they look great in display. I was hoping to find a sans that looks good both ways. I think I like Flama and Pill Gothic best out of these, but Pill Gothic is a little pricey. Kievit is nice too. Reminds me a little of Whitney. Maybe Flama is the way to go. I love the \"l\"s in Flama (and Din). Any others?\n\nBy the way, I saw coop's Depot ( [http://typophile.com/node/19040](http://web.archive.org/web/20110603061656/http:/typophile.com/node/19040 \"http://typophile.com/node/19040\")) here and liked it, though I know it's not finished. I was wondering if there's anything else in that vein out there.\n\n"
    },
    {
      "time": "",
      "content": "Take a look at our ClearviewOne\n\n[http://www.terminaldesign.com/retail\\_specimen.php?ID=1001&viewFam=1](http://web.archive.org/web/20110603061656/http:/www.terminaldesign.com/retail_specimen.php?ID=1001&viewFam=1 \"http://www.terminaldesign.com/retail\\_specimen.php?ID=1001&viewFam=1\")\n\n"
    },
    {
      "time": "",
      "content": "Univers, Franklin Gothic, News Gothic, Trade Gothic Akzidenz Grotesk are all pretty un-warm, un-fun, un-cute. Maybe not trendy but they do information well. What's the font for?\n\n"
    },
    {
      "time": "",
      "content": "I'm looking for general use, but I may specifically use it for a magazine design, coupled with Coranto. Coranto is a bit fanciful, so I thought that a clean, serious sans serif would work well.\n\n"
    },
    {
      "time": "",
      "content": "Gerard Unger's own [Vesta](http://web.archive.org/web/20110603061656/http:/www.gerardunger.com/fontstore/store-vesta.html) is a very impressive rather neutral face, and he says it can be a companion to Coranto.\n\n"
    },
    {
      "time": "",
      "content": "[Bau](http://web.archive.org/web/20110603061656/http:/www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufacturer&displayfontid=FF.11312.0.0)\n\n"
    },
    {
      "time": "",
      "content": "With Coranto I'd definitely use a humanist over a geometric sans. I can't say I'm wild about Vesta (no offense to Gerald Unger if he visits this site). I'd go for something cleaner. That Clearview is nice altho the lowercase L and the q are a little fun ;–)\n\n"
    },
    {
      "time": "",
      "content": "[Akkurat](http://web.archive.org/web/20110603061656/http:/www.lineto.com/The+Fonts/Categories/Text+Fonts/Akkurat/)\n\n"
    },
    {
      "time": "",
      "content": "You might like SOPHISTO or STALEMATE? HAve a look yourself...  \n [http://www.macrhino.com](http://web.archive.org/web/20110603061656/http:/www.macrhino.com/ \"http://www.macrhino.com\")\n\n"
    },
    {
      "time": "",
      "content": "What I am impressed with in Vesta is how readable it is as text. As display maybe it is too dull. [Big Vesta](http://web.archive.org/web/20110603061656/http:/www.gerardunger.com/fontstore/store-bigvesta.html) remedies this a bit, but perhaps you want more pizzaz.\n\n"
    },
    {
      "time": "",
      "content": "I can see it's a useful font, I just don't like it personally. Don't like Dax either which it kinda reminds me of. I'm not a big fan of stressed sans in general.\n\n"
    },
    {
      "time": "",
      "content": "\\>I’m not a big fan of stressed sans in general.\n\nThat's interesting. Do you feel: might as well use a serif--or do you just not like them? Optima included?\n\n"
    },
    {
      "time": "",
      "content": "I find them clunky. I have yet to find one whose proportions I genuinely like. Optima I find hard to look at objectively since to me it is so dated and overused. But... it still crops up.\n\n"
    },
    {
      "time": "",
      "content": "\\>one whose proportions I genuinely like\n\nTraditionally, sans all were roughly monoline in appearance. I'm trying to get an understanding of whether there is some underlying reason for this. I think you are on to something here.\n\nCould you give some examples of the non-stressed sans whose proportions you do like?\n\nIncidentally, very heavy weights tend to be inevitably stressed so the joins are not clotted and the counters don't close up. Do you have a problem with these as well, or do you think the heavy weights work?\n\n"
    },
    {
      "time": "",
      "content": "Patty, do you like Whitney?\n\n"
    },
    {
      "time": "",
      "content": "I do like Whitney although I'm not crazy about the angles on, for example the cap A. Seems on some level to split the difference between Gotham and Verlag.\n\nI'm madly in love with Verlag and Nobel because they both have the retro elegance of a font like Neutraface without quite the quirkiness.\n\nAs far as which other sans I like... there are so many! Seria Sans, Scala Sans, TheSans, Akzidenz Grotesk, Avenir, Bernhard Gothic (occasionally), Meta, Today. News Gothic and Franklin Gothic & Univers have their uses. Mostly, however, those are fonts I own and have worked with. I'm sure there are SO many others I'd give a spin if I had endless funding and time to research them.\n\nConspicuously missing from above list: all those DIN-alikes because I am so SICK of them. Ditto Interstate.\n\nI'm so over Futura, Gill Sans, and Helvetica. It's like going back to high school for me.\n\n"
    },
    {
      "time": "",
      "content": ":^) I've said recently that Verlag is somewhere in between Whitney and Gotham.\n\nI think you and I might have similar taste in Sans. I licensed Whitney before I had a project for it because I really wanted to try it out. Same with Gotham. Now they are my go to sans for a lot of things. I will license Verlag because I do see it as a nice in between and because I see a lot of Metro in it and I love Metro. The only character I'm not completely enraptured with is the lighter weights of the lowercase t. In general I'm not fond of that sort of angling off of the crossbar. But, it suits the face so overall I won't complain about it.\n\n"
    },
    {
      "time": "",
      "content": "We DO have similar taste, I agree that Verlag and Nobel are new interpretations of Metro (Geometric 415) which I used to use a lot. I'm pretty demanding of fonts now - I don't have a lot of patience for fonts that don't have full character/expert sets except for display use. Since I design cookbooks and art books I have a real need for fractions, ligatures, true small caps etc.\n\nI do use the humanists too tho.\n\n"
    },
    {
      "time": "",
      "content": "How about Mr. Majoor's Quadraat Sans? It's lively but humble at the same time.\n\nPersonally, though, I like the Meditteranean-Catalan flavored neo-humanist sans with warm, curvy terminals and hooks like Costa, Lisboa and Eva. Their letterforms dance smoothly on the page when set on large, but are surprisingly usable at small sizes.\n\nBut I can never say no to Kievit -- one of the most versatile creature out there. It managed to be clean without being too sterile, and has the workmanship of a Grotesk without being too impersonal. It has all the OpenType goodness, too.\n\n"
    },
    {
      "time": "",
      "content": "Kievit is nice. Reminds me of Bliss and Today. Agenda a little too.\n\nI'm not a fan of the Quadraats, serif or sans, but they seem to be very popular on this site. I don't like 'brushy' sans either (god I'm picky) which includes Stone Sans.\n\nI think my dislike of stressed sans comes from the assault by Peignot of the 70s and 80s.\n\n"
    },
    {
      "time": "",
      "content": "Do you mind describing the terms \"stressed\" and \"brushy sans\"? Stone looked kind of glyphic to me, of course minus the stroke width variations and serifs.\n\n\"The Assault of the Peignot\"  \nThat should be the title of Coudal's yet-to-be-produced movie!\n\n"
    },
    {
      "time": "",
      "content": "Thanks Patty. I find very interesting the reasons for the taste of a person who really has put a lot of time and thought into their work. Of course another person of similar experience and thoughtfulness might have quite different taste. But still it is quite informative.\n\nThe sans you like I think are all quite strong, with a degree of formality. --Except for Today Sans, which has some modulation and some 'serif' action. That one doesn't seem to quite fit your list. Well, so much for theory!\n\nAnyway, I think what might be going on is that a lot of the strength of seriffed faces comes from their serifs, and when you take that away they but still have the variation in stress, they tend to be weaker, even when they have some charm.\n\nI think that bolder weights of stressed sans can still be quite strong, though with less formality.\n\n"
    },
    {
      "time": "",
      "content": "I actually tried Whitney with Coranto and I liked it. I was just hoping to find something a little more serious. Trade Gothic looks nice with it, as well. I think Vesta may be too matchy in this instance. Clearview is a great face. I actually like the l and q. It adds a little something without being too whimsical.\n\n"
    },
    {
      "time": "",
      "content": "Ah,\n\nSo that is what she referred to as stressed sans.\n\nPersonally, I have the same thought as Mr. Berkson. Much of the strength (and more importantly, the structure and the beauty) of a serif face stems from its serifs.\n\nHowever, I do like to set them large, all-capped and letterspaced. This is when faces like Optima can look majestic _and_ contemporary at the same time.\n\n"
    },
    {
      "time": "",
      "content": "Coranto is a pretty fancy looking typeface.\n\nSome of the typefaces suggested, such as Flama and Sophisto, look really really cool. But I don't think they really match up with Coranto; they seem a bit too technical.\n\nI really like ClearviewOne, but it has a certain kind of friendly looking quality to it (just look at all those bright AT&T ads lately). You could go with ClearviewHwy for a more DIN-like feel. But it costs more than Pill Gothic. However, I don't think it goes well with Coranto either.\n\nCall it a boring choice, but I think something like Frutiger Condensed would work really well in combination with Coranto.\n\n"
    },
    {
      "time": "",
      "content": "Hi Jean\n\nMost of the good ones have already been mentioned here already, but also worthy of consideration would be (in no particular order)\n\nGoudy Sans (old but unusual). Syntax. Avenir Next (with condensed weights at last). Charlotte Sans. Finnegan. Information. Fedra Sans. Wayfarer.\n\nI find the comments from Patty and William fascinating; so focussed, so erudite. And all those lovely contemporary sans serifs under discussion.\n\nAs for the idea that 'Optima can look majestic and contemporary' - well it might have been either of those things 48 years ago, when it was new, but I think the general taste has moved on from that, despite the release of Optima Next.\n\n"
    },
    {
      "time": "",
      "content": "Personally, I wouldn't recommend ClearviewHwy for anything but signage. The exaggerated x-height and wide letterspacing make it very difficult to use on anything but its intended use. Also there are no italics. (Now that would freak FHWA out, italics on the roadscape!)\n\nJames\n\n"
    },
    {
      "time": "",
      "content": "Yeah, italics (particularly true italics) would not go over very well on roadway traffic control signs. Lowercase \"a\" characters wind up looking like \"o\" glyphs at a certain distance. It's a big reason why I tend to steer clear of them when designing street signs for businesses -unless I can make the letters huge.\n\n"
    },
    {
      "time": "",
      "content": "Ben, maybe but maybe not. Though I never fancy the likes of Optima for their lack of strength, it does its job very well -- under the aforementioned specification at least.\n\nFrutiger is a great choice. It's somewhat too sober, though (see Tschichold's newly-republished _The New Typography_ cover). How about Mr. Darden's Freight Sans or TheSans? They're two of the more anonymous looking humanists that are still friendly.\n\nYum! True italics on the roadway :)\n\n"
    },
    {
      "time": "",
      "content": "Those italics might look good on screen in SignCad, Flexi, Corel or whatever is used to design the sign. Once installed, it would kind of stink to not easily tell the difference between words like \"Las\" and \"Los.\" It could be wierd gender-bending visual word play.\n\nFrutiger would be nice jeanjeudi's task. FrutigerNEXT would be even better (bringing those true italics into play).\n\nThe rather ubiquitous Myriad would be another good choice. Sure, everyone with a recent copy of Illustrator or InDesign has it. But I think it still looks good with Coranto.\n\n"
    },
    {
      "time": "",
      "content": "The French use italics (or more accurately obliques) on some of their roadsigns.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "I think the following are good sans serif faces. They are sober and corporate but still feel modern\n\nNeo Sans  \nNeo Tech  \nConduit\n\n"
    },
    {
      "time": "",
      "content": "Scott,\n\nMaybe you will find something [here](http://web.archive.org/web/20110603061656/http:/typematters.de/).\n\n"
    },
    {
      "time": "",
      "content": "Hi all,\n\nLooking for sober, fresh, legible, unique... Sans Serif? See and test Xtra Sans at Jarno Lukkarila Type Foundry ( [www.jarnolukkarila.com](http://web.archive.org/web/20110603061656/http:/www.jarnolukkarila.com/ \"www.jarnolukkarila.com\") ). You'll also find lots of info about the font.\n\nXtra Sans and the site are just launched. Take a look!\n\n"
    }
  ]
}
