{
  "id": "21154",
  "title": "Bleeding Edge Printing Techniques",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello Folks,  \nI was just handed a pretty amazing job. I can't really go into detail, but I basically will need to define how my client is going to market their HD DVD's. Part of this exercise will include advice on cutting edge printing techniques. Think liquid foils, spot UV's, clear foil spot varnishes...the sky is the limit and so is their budget.\n\nI would be grateful for any ideas/applications you've come across lately. They could be types of inks, printing processes, maybe even amazing papers you've seen or used. If I can get a sample somehow please pass that info along as well (i.e. paper mill, magazine, or printer info).\n\nThanks in advance.\n\nBest,  \nPeter.\n\n",
  "author": "<a href=\"/web/20100424065602/http://www.typophile.com/user/1839\" title=\"View user profile.\">markatos</a>",
  "time": "<br>",
  "uid": "1839",
  "comments": [
    {
      "time": "",
      "content": "Letterpress!\n\npeace\n\n"
    },
    {
      "time": "",
      "content": "I've been impressed with the Agfa Crystal Raster screening.\n\nLocal press Jaykay\n\n[http://www.jaykaypress.com/](http://web.archive.org/web/20100424065602/http:/www.jaykaypress.com/ \"http://www.jaykaypress.com/\")\n\nuses a process they call \"spots and dots\" (?) that combines a metalic in with the process inks with interesting results. They do some work for Disney.\n\n"
    },
    {
      "time": "",
      "content": "ha! I know letterpress the new black, but they are looking for something more hi-fi.\n\n"
    },
    {
      "time": "",
      "content": "you can contact high end print shops (maybe [http://www.orange32.com/](http://web.archive.org/web/20100424065602/http:/www.orange32.com/ \"http://www.orange32.com/\")) and ask them what are their priciest/ best/ most unusal/ etc. printing methods. And post up the results here so we can all find out!\n\n"
    },
    {
      "time": "",
      "content": "how do i delete a comment?\n\n"
    },
    {
      "time": "",
      "content": "soy based inks and washable papers, blind embossing, fluorescent boosters for bright colors, satin finish instead of gloss or matte, metallic touch-plates, higher than normal line screen, transparent spot colors, split fountains...\n\nA few of these things I have no experience with. I have seen transparent spot colors, the ink chemists that I work with at the shop I am usually at make us these, I'm not sure how. We had one job in which we had to smoothly blend a series of 8 transparent spot colors into one another. It may have not looked nice the way they had designed it, but it could be something really cool if done in an elegant way. Blind embossing is snazzy, I think, and it isn't something done very often. Consider maybe a intricate pattern to give the paper a unique texture. Split fountains are neat, you always get amazing color combinations with this technique. You probably already know about adding a fluorescent booster to achieve spectacularly bright colors. I once worked with a project printed at a 600 line screen, that could be interesting.\n\n"
    },
    {
      "time": "",
      "content": "i love the paper named neobond, used for the sauna-book from underware. i got some samples, i had it under the shower for two minutes, waited half an hour and it was in a pretty good state already again. you can also take with you in the sauna and put it in the oven or the microwave afterwards to dry.\n\nsadly enough, there arent too many weights for this paper, 90 and 180 only i think :(\n\nif you wanna research, i had the idea of using temperate-dependeable ink where one would have to rub over the printed parts (= make them a bit hotter than normal room temperature or something) to see everything.\n\none great thing, already used before once for a flyer (a friend told me about it): they made the flyer, shot photos of it, developed the photos but didnt expose it to light, put them in black-printed zip-bags that didnt let through any light, and if you opened the bag and pulled out the flyer/photo it started to develop fully. im sure THATS a great effect.\n\n"
    },
    {
      "time": "",
      "content": "There's a few things you can use; but it's hard to use most of these more 'novelty' print processes effectively and not make it look tacky.\n\nM-real: [http://www.m-real.ca](http://web.archive.org/web/20100424065602/http:/www.m-real.ca/ \"http://www.m-real.ca\") - make some great papers. Everything from gloss to matte and I believe they have a double thick board paper as well.\n\nThere's a print method called MetalFX that is starting to get some more coverage. This can be quote gaudy but also insanely cool at the same time. You have to buy the software and then find a printer that will print it for you.\n\n[http://www.metal-fx.com/](http://web.archive.org/web/20100424065602/http:/www.metal-fx.com/ \"http://www.metal-fx.com/\")\n\n"
    },
    {
      "time": "",
      "content": "Six or 8 color process. Heatsensitive inks. Iridiscent inks. Those new metalics that combine with cmyk, enabling a huge range of effects (edit: that's been mentioned, I see). Flock. Lasercutting. Holographic labels (oversized). Lenticular printing (3d or movement).  \nHandmade papers. Different substrates (transparant, metal, stone, anything goes).  \nMonks sitting in rows, copying and painting miniatures.\n\nGod, I AM jealous…\n\n"
    },
    {
      "time": "",
      "content": "Laser diecuts look pretty slick...you can use pretty intricate designs but you have to use dark paper as the laser will burn the edges.\n\n"
    },
    {
      "time": "",
      "content": "quote - I know letterpress the new black\n\nActually letterpress is the old black. :)\n\nThere's some very good suggestions in this thread.\n\nBest of Luck!\n\npeace\n\n"
    },
    {
      "time": "",
      "content": "Someone mentioned Agfa Crystal Raster screening. Adobe almost had a product based on the same stochastic, frequency-modulated screening technique years ago. I happened on a local print shop here in SF (Clubcard) that uses the stochastic screening for 4- and 6-color work that really gives stellar results in layouts with mixed photos/type/art. Type at any size, reversed, or odd colors, comes out crisp and fine, and photos look like you're looking at the object in the photo. Veer has been printing some of their catalogs using the new screening, but I think it looks less impressive (less sharp) on the soft papers they specify. None of this gives a particularly snazzy impression, but it does significantly improve the overall quality of offset impressions, especially using 6 colors. Add some iridescent foil and blind embossing and that will \"make it pop\", as they say.\n\n"
    },
    {
      "time": "",
      "content": "wow. some rad suggestions in here guys. thanks.\n\nalmost overwhelming.\n\n"
    },
    {
      "time": "",
      "content": "yes the sugguestions are sweet but I don't understand half of them lol. Can you go to nice print shops like Clubcard and get samples of these? Or are there picture examples anywhere online?\n\n"
    },
    {
      "time": "",
      "content": "Yes, Clubcard has an extensive sample pack to look at; one of their samples is also a price list, with tiny white type reversed perfectly on top of silver and wine-red.... I imagine they'd send samples on request.\n\nI think they do their printing in Vancouver, and I'm sure the presses and screening technology is available elsewhere too. They once told me the name of the screening product.\n\nOnline you wouldn't be able to see the quality; it's so fine most people wouldn't notice the difference between high-linescreen conventional halftones and this other stuff, even if they held it in their hand.\n\n"
    },
    {
      "time": "",
      "content": "I got some samples of some inks here a while back that actually change color due to environmental conditions, typically heat. One of the samples has a image printed on it, and then it was covered with a black ink, obscuring everything. When you touched it, the image would slowly be revealed as the black would go from opaque to completely transparent. Another one of the examples was a coffee cup that was printed with a similar ink, red perhaps, and it would indicate the level of the liquid in the container through another heat reaction. So, as you drank the coffee, obviously the reaction on the outside of the beverage would slowly move down the side of the cup, until it was empty.\n\nThis will take a bit of research on the internet, but I am sure you can find it.\n\nThe thermographic suggestion is a good one. I have seen so many magazine covers lately that have started to use this technique. Interesting how it's the new fad. Basically, they just take an intricate pattern, and use a clear gloss (laminate type overlay) and print over the entire cover. Think of those cheap business cards that you get at Office Max, that have the raised type, that doesn't really feel like ink; this is the same process.\n\n"
    },
    {
      "time": "",
      "content": "For a recent example of the thermographic application that I mentioned in the above post, see the recent debut of the new magazine \"Lemon\".\n\n"
    },
    {
      "time": "",
      "content": "I second the Hexachrome suggestions, perhaps with additional plates (fluorescent, metallic, etc.). HD deserves highly-saturated color, IMHO. Shorewood Packaging & DiscGraphics are the big DVD packaging outfits in my area; they do some great stuff.\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n [http://homepage.mac.com/mwebert](http://web.archive.org/web/20100424065602/http:/homepage.mac.com/mwebert \"http://homepage.mac.com/mwebert\")  \n [mwebert@mac.com](mailto:mwebert@mac.com)  \n--------------\n\n"
    },
    {
      "time": "",
      "content": "Hi Peter\n\nWhat an insanely great project! Many terrific suggestions here, including the unusual substrate-and-ink combos, and the Crystal Raster/FM screening plus Hexachrome high-end stuff.\n\nMy suggestion would be to use holographic foils as the substrate for some or all of the design; you could use an opaque white ink (possibly silkscreened) in combination with the transparent spot/cmyk inks to produce some fairly nice eye-candy...\n\n\"The thermographic suggestion is a good one. I have seen so many magazine covers lately that have started to use this technique.\"\n\nI think you'll find that is just a double-hit spot varnish going on the magazine covers... and the whole cover is processed on a single 6 colour press. Sometimes for a really thick one we might silkscreen an ultraviolet-curing varnish.\n\nReal thermography is a little-used labour-intensive process whereby enamel crystals are sprinkled by hand over the still-wet ink and then passed under a heat source to melt them and raise the surface/volume of the ink with a super gloss. The difference is that real thermography will crack when flexed, whereas a spot varnish won't, which makes it more suitable for the magazine covers.\n\nThermography used to be _de rigeur_ for society cards and stationery, but like deckle edges, chromo-lithography and gravure printing, it's increasingly rare. I last saw it done commercially in the early 90s.\n\nLove the idea of sending the whole lot to the monastery, Bert.\n\n"
    },
    {
      "time": "",
      "content": "Holographic printing can be quite a challenge :)  \nusually worth it.\n\n"
    },
    {
      "time": "",
      "content": "<cite>My suggestion would be to use holographic foils as the substrate for some or all of the design; you could use an opaque white ink (possibly silkscreened) in combination with the transparent spot/cmyk inks to produce some fairly nice eye-candy…</cite>\n\nIf you do something like this, make note of the cast of the white ink, which can be a bit more blue than an average paper white.\n\n"
    },
    {
      "time": "",
      "content": "i've used a paper called curious metallic. looks really expensive. (it is really expensive, too). how about really filigran cutouts? they are done with l a s e r. ooh la la. those are expensive, too.\n\nyou lucky bastard :-)\n\n"
    },
    {
      "time": "",
      "content": "[http://www.curiouscollection.com/](http://web.archive.org/web/20100424065602/http:/www.curiouscollection.com/ \"http://www.curiouscollection.com/\")\n\nI agree with Alex, these papers are very nice for expensive look.\n\n"
    }
  ]
}
