{
  "id": "21156",
  "title": "Logo for Home Improvement Co.",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I am somewhat \"creativity-challenged\" when designing corporate logos. Here is a logo I designed for a home improvement company. I am looking for suggestions to make this a better logo ... any critique would be helpful.\n\n| Attachment | Size |\n| --- | --- |\n| [homesolutions4you\\_logodesigns.gif](http://web.archive.org/web/20130621112551/http:/typophile.com/files/homesolutions4you_logodesigns.gif) | 21.74 KB |\n\n",
  "author": "misserica",
  "time": "6 Jul 2006 — 9:08pm",
  "uid": "13725",
  "comments": [
    {
      "time": "6 Jul 2006 — 9:57pm",
      "content": "[http://www.jpb.com/creative/index.php](http://web.archive.org/web/20130621112551/http:/www.jpb.com/creative/index.php \"http://www.jpb.com/creative/index.php\")\n\n"
    },
    {
      "time": "7 Jul 2006 — 1:02am",
      "content": "hi misserica. I think that the space between the words is too large.  \nColor-differtation and the space makes it a bit awkward.\n\nI do not understand the letter \"e\".\n\nThe number 4 relates to 3 icons it maybe not important but it kept me busy for few seconds.\n\nregards.\n\n"
    },
    {
      "time": "7 Jul 2006 — 12:16pm",
      "content": "First you don't need three colors for this logo, it makes no sense. You need to work on the letter spacing on the subheads, way too much space between (an example) w and a. In the title S 4 Y is poorly spaced, the 4 Y is floating. Look at the negative space and balance the look. Illustrations are fine.\n\n"
    },
    {
      "time": "7 Jul 2006 — 1:26pm",
      "content": "It works and it looks nice and i like the colours, but i don't like this logo. The #4 in the title with three images is confusing as stated. Especially with the 4 services listed that don't directly correspond to the icons. The icons match but only because they are so simple- there is nothing unique about them to set them apart. The type is too plain for my tastes. For such a long title why not throw some different weights/ styles/ etc? Also the L and M look too wide for some reason.\n\n"
    },
    {
      "time": "9 Jul 2006 — 2:04am",
      "content": "Not sold on the illustrations: the pot of paint doesn't seem to fit in that it's got 3D perspective. Also, considering the front lawn of the house doesn't touch the edge of the ring, should the hammer handle similarly not make contact?\n\n"
    },
    {
      "time": "9 Jul 2006 — 4:25am",
      "content": "I find the icons dominate the logotype you could try placing them beneath or to the side of the type, while at the same time they contain too much detail to reproduce at smaller sizes, they also are drawn from different points of view, in different styles; the paint pot is more lifelike, the house a simplified icon and the hammer a silhouette, the fact that one bleeds off the circle, one follows the edge of the circle and the last is placed centrally doesn't help. Obviously one cannot cover all the products of the business in the icons, I would consider working up one symbol that captures, at least partially, the more important aspect. It could use the pallette of the type as long as a monocolour version is considered.  \nOn the type front I might consider developing M,N,Y from E and U, making the L slightly narrower and redrawing the 4 as a slightly wider character (probably as wide as O). The tagline is too small and weak I might look at a heavier weight.  \nTim  \n{edit: sorry, some of my comments overlap with the previous post}\n\n"
    },
    {
      "time": "11 Jul 2006 — 3:25pm",
      "content": "really ... the only thing constructive I have to say at this point is that I feel for you having to work with such an AWFUL business name \"Home Solutions 4 You\" Uuuuuuurrrrrgggghhhh Yucks!! It's going to be difficult at best to design ANYTHING that will work with a stupid name like that. Having said though, perhaps you could create a logo that could stand alone (and strongly) by itself - without type - or abbreviate along the lines of DIY -\\> HSY.\n\n----------  \n**Paul Ducco**  \n [Solid Creative - Communication Design, Melbourne](http://web.archive.org/web/20130621112551/http:/www.solid-creative.com/)\n\n"
    }
  ]
}
