{
  "id": "21172",
  "title": "Script companion for Adobe Jenson",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello to all!\n\nI’d like to use a good companion script typeface to pair with Adobe Jenson (main text face). It’s for an invitation.  \nAny suggestions are greatly appreciated.\n\nThanks,\n\nAndrew\n\n [‹ Searching for a sober sans serif](http://web.archive.org/web/20071116161737/http:/www.typophile.com/node/21150 \"Go to previous forum topic\") [Evil Robot Font? ›](http://web.archive.org/web/20071116161737/http:/www.typophile.com/node/21136 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071116161737/http://www.typophile.com/user/8874\" title=\"View user profile.\">andrewh</a>",
  "time": "<br>",
  "uid": "8874",
  "comments": [
    {
      "time": " 7.Jul.2006 4.29pm",
      "content": "LTC Metropolitan Italic Alt was based on Beatrice Warde’s 1925 Arrighi design — you know, the one that was ’tamed’ and then paired with Roger’s Centaur? — and therefore, can be set alongside the likes of Adobe Jenson. You might, however, want to use the same roman for setting the main text.\n\nOr P22 Operina if you like to play rough. It was also based on Arrighi’s italic, by the way.\n\n"
    },
    {
      "time": " 7.Jul.2006 4.32pm",
      "content": "Nice ideas, Bram.\n\nIn addition, Poetica springs to mind, although it might be too close unless you use some of the alternates. Check out [this pdf.](http://web.archive.org/web/20071116161737/http:/store.adobe.com/type/browser/pdfs/POEQ/PoeticaStd.pdf)\n\n"
    },
    {
      "time": " 7.Jul.2006 4.46pm",
      "content": "If LTC Metropolitan is not available in an opentype format, or if you don’t intend to use Metropolitan Roman to set the text, I would totally go for Poetica — simply because pairing two Venetian faces, one roman and one italic, is one tough act to pull.\n\nBy the way, what was Poetica based on? It definitely have sharper hooks and more complicated (but rather conservative, in comparison to Arrighi’s) ligatures and swashes. Was it based on a more contemporary italic?\n\n"
    },
    {
      "time": " 7.Jul.2006 5.44pm",
      "content": "Adobe Jenson Italic, with the swashes, is great in itself, and you have the optical sizes to match the size you’re going to print. I’d try it first.\n\nBy the way Poetica matches Minion. The structure of its italic is quite different from Adobe Jenson’s italic.\n\n"
    },
    {
      "time": " 7.Jul.2006 5.48pm",
      "content": "That, William, is the best idea yet.  \nI set a keepsake for my in-laws’ 50th wedding anniversary in Jenson Italic.\n\n"
    },
    {
      "time": " 7.Jul.2006 5.57pm",
      "content": "I agree, that is the best idea so far. I failed to consider the fact that Adobe Jenson did have accompanying swashes with its italic.\n\n"
    }
  ]
}
