{
  "id": "21184",
  "title": "serif which will work well with Helvetica",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello, my first post..\n\nI know, its written everywhere, Helvetica is dead. But im in situation where my client already got license for it, and he insist in using it. So I decided to combine it with serif font. My idea is to make the serif main, and helvetica secondary one.\n\nI would be very grateful for any advice and especially tips for serif font which will work well with helvetica. thanks in advance..\n\n",
  "author": "nin",
  "time": "9 Jul 2006 — 5:19am",
  "uid": "13745",
  "comments": [
    {
      "time": "9 Jul 2006 — 6:01am",
      "content": "Unlike color combinations that can benefit from subtle contrast, typeface changes need to be obvious - I'd say almost all serif typefaces could be mixed with Helvetica; try ITC Veljovic for instance.\n\n"
    },
    {
      "time": "9 Jul 2006 — 6:13am",
      "content": "Hi Ondrej\n\nForced to use Helvetica huh? Sheesh. Another client from hell.\n\nI'm guessing the client's taste runs towards the obvious, so you could try Times Roman. Or if you're feeling adventurous, Palatino. Garamond is another great default text face that springs to mind.\n\n"
    },
    {
      "time": "9 Jul 2006 — 7:00am",
      "content": "I've paired Helvetica with Hoefler Text. Turned out nicely.\n\n"
    },
    {
      "time": "9 Jul 2006 — 7:54am",
      "content": "If you like it \"stiff\", \"formal correct\" you can check out Walbaum, especially take a look at [Walbaum Text](http://web.archive.org/web/20150217140135/http:/www.stormtype.com/typefaces-fonts-shop/typeface.php#sample) from Stormtype.\n\nAnd Helvetica works good together with Headline-Display faces (Classification: Modern) like Bodoni, Didot. You could pair it with, for example, Clarendon, too (Egyptienne).\n\nRegards\n\n"
    },
    {
      "time": "9 Jul 2006 — 9:38am",
      "content": "Helvetica is dead is the common wisdom?\n\nBetter start using it right away…\n\npeace\n\n"
    },
    {
      "time": "9 Jul 2006 — 10:41am",
      "content": "I disagree Helvetica is dead. Quite far from it. It's just the font many love to hate.\n\nFor one thing, it is a staple font in signage applications (even though other faces like Frutiger are often more suited to the purpose). Lots of government and military post signs specifically mandate its use. If they switch it will be to something more hated: Arial. Our sign company made a main entry sign for an Air Force base featuring chrome Arial Black letters.\n\nHelvetica Neue is very popular these days. I see the extended weights of it used all the time in various types of advertising.\n\nTo get back to topic, what's a good serif font that goes with Helvetica? I think Berthold's version of Baskerville looks good with it. Utopia isn't bad either.\n\n"
    },
    {
      "time": "9 Jul 2006 — 10:44am",
      "content": "I used Neue for years. It is so flexible. I have moved on but will always be fond of it, especially the extended…\n\nSecond the Baskerville suggestion.\n\npeace\n\n"
    },
    {
      "time": "9 Jul 2006 — 6:37pm",
      "content": "\\> _Or if you’re feeling adventurous, Palatino. Garamond is another great default text face that springs to mind._\n\n ![](http://web.archive.org/web/20150217140135im_/http:/typophile.com/files/Helvetica_L_3452.png)\n\nI would not use an old style, let alone a calligraphic old style with Helvetica, or with Univers, or with any other neo-grotesque sans, for that matter.\n\nIn my opinion, Amts-Antiqua (now available from Bitstream as Century 725) would make for a much better combination with Helvetica:\n\n ![](http://web.archive.org/web/20150217140135im_/http:/typophile.com/files/Madison-Antiqua_4028.png)\n\nIn general, the Century-style moderns/ionics could work pretty well with the neo-grotesques, e.g., ITC Century:\n\n ![](http://web.archive.org/web/20150217140135im_/http:/typophile.com/files/ITC_Century_4665.png)\n\nAn oval-based slab-serif, either bracketed, or unbracketed, might work nicely with Helvetica, e.g., Egyptienne F:\n\n ![](http://web.archive.org/web/20150217140135im_/http:/typophile.com/files/Egyptienne_F_4312.png)\n\nor Glypha:\n\n ![](http://web.archive.org/web/20150217140135im_/http:/typophile.com/files/Glypha_5636.png)\n\nIf you absolutely insist on using an old-style, or a transitional serif, I think those whose proportions are, again, oval-based (not circle-based), might make more sense, e.g., ITC Slimbach:\n\n ![](http://web.archive.org/web/20150217140135im_/http:/typophile.com/files/Utopia_6649.png)\n\nor Utopia:\n\n ![](http://web.archive.org/web/20150217140135im_/http:/typophile.com/files/Slimbach_3499.png)\n\nor Miller:\n\n ![](http://web.archive.org/web/20150217140135im_/http:/typophile.com/files/Miller_5641.png)\n\n"
    },
    {
      "time": "10 Jul 2006 — 2:52am",
      "content": "Better advice than mine, Maxim!\n\nI have just taken note of what you say here and re-read Bringhurst (2nd edition) pages 96-98 and I stand (or sit) corrected; I was too busy having a swipe at the client and the mindset that insists on Helve, rather than concentrating on the shapes of the letters.\n\n<cite>6.5.5 Pair serifed and unserifed faces on the basis of their inner structure </cite>\n\nHe recommends Haas Clarendon. Perhaps any of the legibility group faces would work, like Century Schoolbook.\n\nSorry for the red herrings Ondrej.\n\n"
    },
    {
      "time": "10 Jul 2006 — 6:36pm",
      "content": "Helvetica is the nice suit that goes with everthing but you've worn too many times! I love Helvetica! I can use it for just about any purpose. But that's the problem- I'm not the only one. The entire WORLD uses it too much.\n\nMikey\n\n"
    },
    {
      "time": "10 Jul 2006 — 11:17pm",
      "content": "Hey Mikey\n\nI have nicer suits than that. So you would think to use Helvetica, for example, on a prestigious bespoke brand or client that definitely does **not** want to look like everyone else?\n\nC'mon, you can do better than that... <cite> Helvetica is the freeze-dried instant mashed potato of the design kitchen – it's filling and it'll do in a hurry but it has no flavour and it's not very nutritous.</cite>\n\n"
    },
    {
      "time": "11 Jul 2006 — 9:11am",
      "content": "The important thing in matching types is to get them looking like they are both set to the same specs.\n\nBy this I mean that one should not appear more condensed than the other, or relatively tracked out. The x-height should also be considered, as should ascender-to-cap height.\n\nif you don't take care of all these correspondences, your pairing will look \"off\". For instance, in Maxim's selection, Egyptienne is too wide, and Slimbach too narrow. (Although these things can be fixed by applying tracking and scaling, such distortions can be problematic, hard to police in a production environment.)\n\nDon't forget figure style: your matching face should have 3/4 height tabular lining figures, like Helvetica.\n\n\\*\\*\n\nAs an alternative to the above, you can choose a partner that is quite different, such as Garamond. So, either have close harmony, or pointed contrast -- but avoid faces which fall between these two stools.\n\n"
    },
    {
      "time": "11 Jul 2006 — 1:32pm",
      "content": "Monotype Garamond -- but make sure to get the small caps and old-style figures along with it! It's one of the quirkier interpretation of Garamond, in my opinion, one that could balance Helvetica.\n\nOr if you want to play it safe, Bembo Book.\n\n"
    },
    {
      "time": "12 Jul 2006 — 1:18pm",
      "content": "If your are using Helvetica only for headlines or pull quoutes, you have more freedom in the choices, get a text face that goes well with the overall character of the design, not just Helvética.\n\nHéctor\n\n"
    },
    {
      "time": "25 Jul 2007 — 4:55pm",
      "content": "I haven't used it myself, but most people don't know about [Helserif](http://web.archive.org/web/20150217140135/http:/www.fontshop.com/search/?q=helserif), Phil Martin's slab version of Helv.\n\n"
    },
    {
      "time": "4 Jul 2009 — 2:01pm",
      "content": "Great post and advice. Thanks everyone.\n\n"
    }
  ]
}
