{
  "id": "21203",
  "title": "The Oxford Student newspaper redesign",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello All,\n\nAs the new editor of my student newspaper - The Oxford Student - I am keen to scrap the old masthead, headline and bodytext fonts. I hope to intoduce much greater typographic elegance and impact to the paper, but the problem is that I have no real experience in typography.\n\nI have a couple of months before the first edition goes to press. If you could give a few suggestions or point me in the right direction I would be tremendously grateful.\n\nThe most recent front page: [http://www.oxfordstudent.com/pdf/165/frontpage.pdf](http://web.archive.org/web/20100910020611/http:/www.oxfordstudent.com/pdf/165/frontpage.pdf \"http://www.oxfordstudent.com/pdf/165/frontpage.pdf\")  \nArchive of front pages from past issues here: [http://www.oxfordstudent.com/archive/2005](http://web.archive.org/web/20100910020611/http:/www.oxfordstudent.com/archive/2005 \"http://www.oxfordstudent.com/archive/2005\")\n\nAudience: the students of Oxford University (about 17,000)\n\nThe paper is 44 pages long. The page dimensions are approximately 12 X 15 inches - i.e. tabloid size.\n\nThe content of the paper varies dramatically, from fairly purient news stories to more intellectual pieces. I dont know if it's possible but my aim is for the paper's masthead and fonts to convey gravitas, while also showing that we have a sense of humour, are just students, and dont take ourselves too seriously.\n\nSophisticated but brash, if that's not too contradictory.\n\nThe masthead provides a huge challenge because \"The Oxford Student\" is such a clunky name. Creative typographic solutions are very welcome.\n\nMany thanks in advance,\n\nBest,\n\nRob\n\n",
  "author": "<a href=\"/web/20100910020611/http://typophile.com/user/13765\" title=\"View user profile.\">Airwaves</a>",
  "time": "<br>",
  "uid": "13765",
  "comments": [
    {
      "time": "",
      "content": "Wow. If you've no typographic experience, i'd be hesitant to tell you to attempt a redesign. How old is the current design? Just wondering if you're just itching to leave your mark.\n\nIf you insist:\n\n**Great starter books**  \n [Pure Design](http://web.archive.org/) (Mario Garcia has headed a gazillion redesigns including The Wall Street Journal)  \n [The Newspaper Designer's Handbook](http://web.archive.org/)\n\n**Good Web sites**  \n [NewsDesigner.com](http://web.archive.org/) Search the archives for extensive blogs and postings about redesigns.  \n [VisualEditors.com](http://web.archive.org/)  \n [NewsPageDesigner.com](http://web.archive.org/)\n\n"
    },
    {
      "time": "",
      "content": "nice links seventy7! Airwaves... why not show you are a good leader by finding someone else to redesign it for you. Go out into your community and find good designers/ typographers who can help give you ideas and such and you can give them credit for it in your paper (good PR/ Advertising to compensate for the help). You still get the credit for supervising the redesign, and it will turn out better than if you try it on your own.\n\n"
    },
    {
      "time": "",
      "content": "seventy7 you're absolutely right in urging caution about a redesign given that I'm not a professional typographer, but the point is that my predecessors were equally inexperienced. That's why I've come here - to get advice from people who do know what they're talking about.\n\nThe paper gets redesigned to different degrees every term with the changeover of the team. I am of course itching to leave my mark but I am very conscious that rushed redesigns usually fail, which is why I am here.\n\nThanks for the recommendations. I'd browsed newsdesigner.com extensively but didn't find it particularly helpful. I'll check the books out.\n\nWhat would be really helpful though would be some more specific advice on potential fonts for the masthead and how to solve the problem of the extremely clunky \"The Oxford Student\" title.\n\n"
    },
    {
      "time": "",
      "content": "I thought I'd chime in with my suggestions, since I'm in a similar position. I'm the Editor-in-Chief of a high school newspaper, The Riverdale Review (Bronx, NY), and I am redesigning the paper this summer. I'll get to more specific suggestons at the end of my post, but I thought that my general experiences could help you. I apologize in advance for the long post; I guess I have a lot to say about redesigning.\n\nI've found that a useful thing to do is to think long and hard about what idea you want to promote with your redesign, especially if you want it to be considered more than just \"shaking things up\" for no reason. For me, I decided that I wanted the design to be purposeful, i.e. not to be whatever just happened to work, and to make the paper feel modern, yet keep the general flavor of it around.\n\nIf you're committed to doing it mostly on your own, I recommend a lot of reading. I recommend Bringhurst's _Elements of Typographic Style_ (an amazing text for teaching you what to look for in a typeface and how to sense a face's character), the already mentioned _Newspaper Designer's Handbook_ , which really opens your mind to how to layout a good-looking paper, and _Contemporary Newspaper Design_ edited by John Berry, which has a lot of really great designs and why they work. In the last book, the final chapter discusses nameplates (after reading _Handbook_ , you'll know that the newspaper's name at the top is actually called a nameplate) in great depth. I'd also recommend a book on Photoshop (there are lots, but _Photoshop Masking & Compositing_ by Eismann is great for making silhouettes in newspapers) and one on either InDesign or Quark.\n\nAfter you've read these, I think that you're ready to begin. I began by spending two weeks looking for the right typeface. Since my paper used Times and I wanted to preserve its general feeling, I confined my search to transitional typefaces. I searched on Myfonts.com mainly, using keywords like \"transitional\" and \"Times-like\" to find possibilities. I kept track of the ones I liked (using a tabbed browser like Firefox or Maxthon is really useful here, especially if it can save groups of links) and looked at them for a really long time. Ultimately, most felt too much like Times, or had too much contrast between the thick and thin strokes, or felt too lively for a somewhat conservative newspaper. I ultimately decided on Mercury by Hoefler & Frere-Jones, as it is transitional, a face tailor-made for newspapers, and felt different, new, and well-made without seeming too crazy. A big factor in my decision was seeing it used in the old layout, so I'd recommend that once you are down to three or four typefaces, you e-mail the foundries that make them to ask if they can make a PDF substituting their typeface into your layout file. You might be lucky, as I have been, and get the typefaces you want sent to you for you to demo on your own for one or three months.\n\nYou probably won't have to spend as much time picking out a sans serif to complement it. Make sure that it doesn't conflict strongly with your main font and you should be fine. You may want to consider choosing your sans serif and other fonts from your current font library, since you'll probably have settled on a main typeface that you don't own, requiring your newspaper to purchase it for a good amount of money.\n\nAs to redesigning the layout, after reading Bringhurst and Harrower, you should be able to see when your old layout worked and when it didn't. Change all the didn'ts to dids and change some of the things that worked that you think could work better.\n\nFinally, the most important thing to do is consult with other people. Ask the other members of the staff, your friends, your faculty advisor (if you have one), your family, people who read the paper now, and people who never read it what they think about every bit of the design. After all, you're designing for everyone else first, then yourself. If most people hate something that you love, change it. A tough concept and one that I struggle with all the time, but a very essential one.\n\nNow, the specific comments. It's hard to actually suggest anything about the nameplate before you've chosen a main typeface, since it should either be made from the same typeface or a completely different one. For your main typeface, I'd suggest something like Mercury, in that it feels traditional but different, throwing a wrench of uniqueness into the works as it were. The ones that I liked for my paper were Mercury, Farnham, Miller, Veritas, Atlantica, John Baskerville, and Electra.\n\nI ended up using Mercury for both my main typeface and the nameplate. I solved my similar typographic problem by using small caps for the name, capitalizing the two R's but not the \"T\" in \"the,\" and creating a pseudo-bevel effect using a transparent copy of the text with a black outline. I like the idea of somehow minimizing the importance of the \"the.\" Take a look at the student newspapers at this link ( [http://www.studentpress.org/bohsp/2005/A-01.html](http://web.archive.org/web/20100910020611/http:/www.studentpress.org/bohsp/2005/A-01.html \"http://www.studentpress.org/bohsp/2005/A-01.html\")) for a lot of interesting nameplates, some of which deal with this problem. One that I like rotates the \"The\" counter-clockwise and makes it the caps height.\n\nThe one thing I wouldn't recommend is going blackletter; to do this, no typeface is really so great, so hand lettering is required. The one thing I would wholeheartedly recommend is just trying things yourself: try sketching the nameplate really roughly at small sizes. If you work on making these \"thumbnails\" for a good hour or two, you should have a number of ideas that you can try out with a font on your computer.\n\nGood luck with your redesign. It's a really time consuming process, but at least for me, it seems like it will be well worth it from the responses I've gotten. Feel free to e-mail me (click on my name to the left) if you have any questions or are annoyed that I wrote so much.\n\nI've uploaded JPEGs of my four-page prototype to the links below. It's not quite finalized, as I'm still waiting on some comments, but it's close. If anyone wants to give me their opinion they're welcome to, although please don't hijack this thread.\n\n[http://i48.photobucket.com/albums/f202/auricfuzz/RR5CFrontMercuryInlineM...](http://web.archive.org/web/20100910020611/http:/i48.photobucket.com/albums/f202/auricfuzz/RR5CFrontMercuryInlineMay.jpg \"http://i48.photobucket.com/albums/f202/auricfuzz/RR5CFrontMercuryInlineMay.jpg\")  \n [http://i48.photobucket.com/albums/f202/auricfuzz/RR5CFrontMercuryInlineM...](http://web.archive.org/web/20100910020611/http:/i48.photobucket.com/albums/f202/auricfuzz/RR5CFrontMercuryInlineMay2.jpg \"http://i48.photobucket.com/albums/f202/auricfuzz/RR5CFrontMercuryInlineMay2.jpg\")  \n [http://i48.photobucket.com/albums/f202/auricfuzz/RR5CFrontMercuryInlineM...](http://web.archive.org/web/20100910020611/http:/i48.photobucket.com/albums/f202/auricfuzz/RR5CFrontMercuryInlineMay3.jpg \"http://i48.photobucket.com/albums/f202/auricfuzz/RR5CFrontMercuryInlineMay3.jpg\")  \n [http://i48.photobucket.com/albums/f202/auricfuzz/RR5CFrontMercuryInlineM...](http://web.archive.org/web/20100910020611/http:/i48.photobucket.com/albums/f202/auricfuzz/RR5CFrontMercuryInlineMay4.jpg \"http://i48.photobucket.com/albums/f202/auricfuzz/RR5CFrontMercuryInlineMay4.jpg\")\n\n"
    },
    {
      "time": "",
      "content": "auricfuzz thanks for your post. I've ordered a couple of those books and look forward to wading through them. It's probably worth saying that I'm not completely ignorant of newspaper design and typography; I've been writing and laying out pages for The Oxford Student for over a year now, and have a good working knowledge of In Design and Photoshop.\n\nI completely agree with you that the aim of a redesign shouldn't be just to \"shake things up\", but should be a content-driven and precise movement towards a well-defined endpoint.\n\nAs I see it, in the past the paper was designed without much thought. Now I'd like distil everything that we do well and combine this with some fresh ideas.\n\nMy aim is for the paper to look bolder and clearer, and to forge a more cohesive identity. I feel that this thread is in danger of becoming too broad, so to narrow the focus again, let's take things back to typography.\n\nI'm interested that you recommend Mercury as the main body text typeface as I'm not sure that sans serif works as newspaper body text. Personally I'm planning to go for as readable a serif font as possible, possibly Swift.\n\nOur current body text font is Palatino, Headlines and standfirsts are Adobe Caslon, photo captions are Helvetica Neue, and the nameplate is Trajan Pro.\n\nI do not think that Trajan Pro works for the image I'm trying to send out. Any suggestions for a more exciting nameplate typeface?\n\ncurrent front page design: [http://www.oxfordstudent.com/pdf/161/frontpage.pdf](http://web.archive.org/web/20100910020611/http:/www.oxfordstudent.com/pdf/161/frontpage.pdf \"http://www.oxfordstudent.com/pdf/161/frontpage.pdf\")\n\n"
    },
    {
      "time": "",
      "content": "Have you considered changing the name. The Oxford Student seem a bit formal to me. Perhaps shortening it to \"The Oxford\" might help generate interest. Listen to how people refer to the paper. Do they refer to it by it's name or a nickname. This could succeed in \"personallizing\" the paper. Also, maybe you can go with a Sans Serif font for the nameplate or a more modern serif.  \nYou're off to a good star twith the clean design but I think it lacks a bit of direction. For example the pic of the model might be mistaken as part of the student vote story on the left. I would suggest you place a hairline rule of perhaps just increase the gutter width (perhaps two or three times the original width) to help seperate. I like the magazine flavor you're trying to add to the paper, go with it.\n\n"
    },
    {
      "time": "",
      "content": "Well, first things first. You probably searched on Myfonts for Mercury, which brought up Mercury by T-26. Wrong Mercury. I'm referring to this Mercury: [http://www.typography.com/catalog/mercurytext/index.html](http://web.archive.org/web/20100910020611/http:/www.typography.com/catalog/mercurytext/index.html \"http://www.typography.com/catalog/mercurytext/index.html\") . Much more appropriate. Actually, if you poke around the site, you'll see that Mercury was made to be ultra-legible. If you search for Yves Peters' review of it, you'll see that he concurs with it's readibility in long passages. Even more, the typeface you see on Typophile's main page is Mercury. That's a pretty good endorsement, I would think.\n\nWhat I was suggesting was that you choose a typeface for your body text (your \"main typeface,\" as I wrote it) before looking at making the nameplate.\n\nIn that vein, I'd recommend the typefaces I did in my previous post: Mercury, Farnham, Miller, Veritas, Atlantica, John Baskerville, and Electra. Especially Farnham, Atlantica, and Electra, I think, fit with your desire to be \"sophisticated, but brash.\" I happen to like them both small and at display sizes. Swift could work, but I've always found typefaces that are especially calligraphic and angular (like Palatino and the similar text face, Aldus) to be a bit distracting as body copy. I much prefer more rounded, contrasty faces.\n\nI agree that Trajan doesn't work for your new idea of an image. If you're intent on designing the nameplate first, I can make a few suggestions. Maybe, to drive the point about the \"new\" paper home, you could use a non-geometric slab serif like Chaparral Pro (which should be bundled with InDesign and thus on your computer). Search on Myfonts for \"slab serif\" for some other possibilities.\n\nIn this \"out there\" vein, a sans serif could be a good choice, too. Font Bureau has a ton of great, character-filled faces. I like their Amplitude, Titling Gothic, and Nobel.\n\nOne interesting one that I re-discovered as I looked at their website is Prensa. If you want to say, \"This is new,\" it could definitely work.\n\nVeer.com collects a number of quirky, interesting typefaces for the discriminating typographer. You might want to give their fonts a look.\n\nI happen to love art-deco-style typefaces for when you want to make a statement, so I'm listing a number that I found to be interesting here, even though they might be too American for you: Toasted Vein, Avenida, EF Mahlau.\n\nUltimately, though, I think you'll find that the most modern, boldest feeling will come less from your typeface and more from your design. The craziest typeface will feel dull if you make a nameplate with it in all caps, as will something like Times in an avant garde design. The key is to find a typeface that has a little something that suggests your newspaper and couple it with a design that defies convention to some extent.\n\nThese are my suggestions. I'm gleaning these from only about six months of really delving into type, unlike a number of people on this forum, so you may want to see if anyone else can give you a supremely tailored recommendation.\n\n"
    },
    {
      "time": "",
      "content": "Oxford has its very own type family, the Fell Types, which are indeed both sophisticated and brash; but DTL Fell is rather bland, and Hoefler's and Marini's versions (the latter free) are too irregular for news. I recommend you look at Storm Regent Pro, in roughly the same style, which would work nicely for text.\n\nI used to read the Cherwell myself.\n\n"
    },
    {
      "time": "",
      "content": "To me, the most typical thing about Oxford is that so many buildings are gothic. It is the \"most gothic\" town I have seen. It seems when the rest of the world followed fashions like renaissance, baroque or modernism they kept on building in the gothic style. Which is confusing today because you can hardly tell whether a building is 150, 300 or 800 years old.\n\nI wonder why so many newspapers keep their broken script mastheads but if there is any town that needs a gothic one it is Oxford!\n\nI assume a \"proper\" gothic font is too dusty for you so you might try something that relates to this style more loosely, like [Litteratra](http://web.archive.org/web/20100910020611/http:/kltf.de/kltf_litteratra.htm). I think it fits the OU's mix of northern European gothic-ness and sophistication and latin-ness very well. It is a bit cocky and does not take itself too seriously. Apart from that, it is an excellent design.\n\n"
    },
    {
      "time": "",
      "content": "If you are a bit more daring you might try something by [Arthur Baker](http://web.archive.org/web/20100910020611/http:/www.myfonts.com/browse/person/baker/arthur/).\n\n"
    },
    {
      "time": "",
      "content": "One thing to do is learn what a masthead is. I think you are using the tag to describe the nameplate of the newspaper, which is something else entirely. The masthead is the place where the officers of the newspaper are listed, generally on the editorial page. It seldom appears at the top of the front page.\n\n(historical trivia: the first mastheads were on ships, brass plates nailed to the main mast, listing the owners of the ship.)\n\n"
    },
    {
      "time": "",
      "content": "There is a designer on here, who doesn't post a lot, who does the sports sections, most recently for the Arizona Republic. You might want to look through some of his stuff here: [http://www.dustyaltena.com](http://web.archive.org/web/20100910020611/http:/www.dustyaltena.com/ \"http://www.dustyaltena.com\")\n\nHe goes by gerald on here I believe.\n\n"
    },
    {
      "time": "",
      "content": "Why don’t you phone up Reading University; they aren’t to far away and the have a department of Typography; I am sure some students would jump at the chance. And its free.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for all the help so far. I've been intrigued by all the recommendations and have enjoyed immersing myself in typography, even if it has all been a bit mind-boggling.\n\nAsking for help from students at Reading University is an excellent idea and I plan to get in touch as soon as possible. If anyone from this forum would like to try their hand at designing The Oxford Student's next masthead then I'd be very grateful. We would of course credit the designer in the paper. For more information please email bass\\_pressure @ hotmail.com\n\n"
    },
    {
      "time": "",
      "content": "My goodness - I would almost certainly eliminate every trace of color from that front page, as it is just horrid to look at.\n\nThat was my best imitation of an Oxford don. Pretty pitiful, huh?\n\nBut seriously - can the color. Eliminate! It's no good, unnecessary, and you can save it for the guts and inner spreads where you advertisers will pay good money for a bit of spot or process even.\n\nJLT\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20100910020611/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    }
  ]
}
