{
  "id": "21219",
  "title": "Optimizing inner- and counter forms for legibility",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’ve been reading and searching a lot on how to optimize the inner- and counter forms in a font for legibility. I found some material, but this is mostly an explaination of the matter and not an explaination of **hów it works**.  \nWhat I would like to know are the ’does-and-dont’s’, the ’never-worked-for-me’s’, the ’my-tip-is-better’ and the ’look-at-this’.  \nI do what I can and feel that optimizing the inner closed forms for itself helps a great deal in the balance of the font. But I never corrected my curves for enhancing legibility. So it’s hard for me to judge from my own fonts if the are display or text fonts. Perhaps most of them are a bit of both.  \nI’m currently working on my newest font called ’Reethi Rah’ and this should be a text font. I would like to start in the right way with my proportions and not correct this when it’s almost ready.\n\nIs there anyone that optimizes his fonts this way and could shed some light on the practical details?\n\nThanx,  \n®ené\n\n [‹ World Cup Design](http://web.archive.org/web/20081205192830/http:/typophile.com/node/20967 \"Go to previous forum topic\") [Comic strip speech bubble fonts ›](http://web.archive.org/web/20081205192830/http:/typophile.com/node/21084 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081205192830/http://typophile.com/user/1946\" title=\"View user profile.\">Characters</a>",
  "time": "<br>",
  "uid": "1946",
  "comments": [
    {
      "time": " 11.Jul.2006 6.43am",
      "content": "Well, you’ve ruled the women designers out, haven’t you?\n\n"
    },
    {
      "time": " 11.Jul.2006 7.11am",
      "content": "Rene,  \nThat is a tough one to quantify into a procedure. There are differing opinions on what constitutes legibility and different solutions. I don’t think in the end that there is a recipe agreed upon. It is hard work trying then testing then changing then testing again. The size also matters. A type ballanced for 10pt has different needs than one ballanced for 14pt. My not-very-helpful suggestion is that you just have to fight with it long enough to train yourself to see differences and tinker to make it work.\n\nChrisL\n\n"
    },
    {
      "time": " 11.Jul.2006 9.43am",
      "content": "There are also numerous threads on typophile that get into this question. I suggest you search for them; read them. After that you may have a more specific question or questions that you want to ask. Right now your question is pretty broad. It’s hard to know where to start. What Chris was getting at - that the conetxt of use is crucial to defining what to do is bang on. You might want to decide a bit more about how you think the face would be used & at what size and actually try it out in that way - before you start adjusting.\n\n"
    },
    {
      "time": " 11.Jul.2006 9.53am",
      "content": "One tidbit: Look at Gill Sans Extra Bold, and Gill Sans Display Extra Bold. Note the awkwardness of the counters of the “text” version, when enlarged. The huge variation of stroke weights in Gill Extra bold are there to provide adequate legibility at small sizes. That’s something you don’t do in a display face. Look at other robust text faces (Serif too), for more things like this. This is just an extreme example of optical compensation for legibility.\n\n"
    },
    {
      "time": " 11.Jul.2006 9.55am",
      "content": "I think his question is a little more specific, and I’d be curious to hear new thoughts. But, you are right, [there are several threads that probably touch on this topic.](http://web.archive.org/web/20081205192830/http:/www.google.com/search?hl=en&lr=&client=safari&rls=en&q=legibility+research+site%3Atypophile.com&btnG=Search)\n\n"
    }
  ]
}
