{
  "id": "21244",
  "title": "InDesign Paragraph styles",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi there, please someone help me. I am going crazy and loosing faith in InDesign.\n\nI have a document where I have made a set of paragraph styles. I have another document that I am copying and pasting text from. Now... when I select the text box and then select the paragraph style I want it doesnt complete change all the specs. Eg, it might change the colour but not the actual typeface, or point size. The paragrapg style still shows the little + sign by the side of it. SOmetimes it is obvious what is wrong but when it is not it is really annoying to try and find it.\n\nI thought that by just selecting the right para style it would change the block of text. It gets quite annoying when you have to change every single block of text manually. Surely this defeats the object of paragraph styles.\n\nPlease, for the love of god, someone help me..\n\nThanks\n\n [‹ looking for a font](http://web.archive.org/web/20071216225058/http:/www.typophile.com/node/21319 \"Go to previous forum topic\") [Tiger Woods monogram - who designed it? ›](http://web.archive.org/web/20071216225058/http:/www.typophile.com/node/21304 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071216225058/http://www.typophile.com/user/11806\" title=\"View user profile.\">Matt Squire</a>",
  "time": "<br>",
  "uid": "11806",
  "comments": [
    {
      "time": " 12.Jul.2006 8.48am",
      "content": "My guess, without actually firing up InDesign, is that the original doc has local formatting, for example Normal style is 12 pt Times, and some one has changed the typeface and point size “by hand”, ie not changing the style sheet. If you go into your original document, and change the style so it matches the actual point size and typeface, you might avoid this problem.\n\nOne of the many reasons I still prefer Quark, where problem workarounds are generally easier to figure out.\n\n"
    },
    {
      "time": " 12.Jul.2006 8.50am",
      "content": "First off, usually when copying and pasting text into a styled paragraph, I like to use the “Paste Without Formatting” (Command + Shift + V), which will automatically assign paragraph attributes to the pasted text. This will also prevent styles from other documents from being imported.\n\nSecond, the “little + sign” means the style is unpure, in this because it’s maintaining attributes from its original document. You can make the paragraph pure again simply by Option-clicking the style.\n\n"
    },
    {
      "time": " 12.Jul.2006 8.51am",
      "content": "If you hold down the Option key (and I assume the Alt key in Windows will work the same way) when you click on the paragraph style, then the style’s settings will override any other settings applied to the text. (The +plus sign indicates that the current settings of the selected text do not match the specs of the current style.)\n\n"
    },
    {
      "time": " 12.Jul.2006 8.51am",
      "content": "Try holding the option key down when you click on the stylesheet you want it to have.\n\n- Select the paragraph  \n- Holding the OPT key down, double-click on the style\n\nThis should work.\n\n"
    },
    {
      "time": " 12.Jul.2006 9.40am",
      "content": "_One of the many reasons I still prefer Quark, where problem workarounds are generally easier to figure out._\n\nI felt this way until I became more familiar with InDesign. Workarounds are generally easy to figure out once you understand how the app works.\n\n"
    },
    {
      "time": " 12.Jul.2006 10.39am",
      "content": "Until I can get InDesign tags to be as useful as Quark tags, and have the same control of kerning, I dont think I’ll be happy with InDesign, in spite of its many good features.\n\n"
    },
    {
      "time": " 12.Jul.2006 12.17pm",
      "content": "Tags? XML?\n\n"
    },
    {
      "time": " 12.Jul.2006 1.33pm",
      "content": "Maybe it’s because your paragraphs have character styles applied to them as well, try selecting no style on the character style palette.\n\nHéctor\n\n"
    },
    {
      "time": " 13.Jul.2006 3.16am",
      "content": "HI there,\n\nThe Option Key sorted out the problem. THanks for that everyone. Seems as though InDesign need to sort out the hirachy of things like that. It should just be a simple click of the button, but I guess we all have our own ways of working\n\nCheers\n\n"
    },
    {
      "time": " 14.Jul.2006 8.47am",
      "content": "Matt, there is a clear hierarchy, outlined in the InDesign help file.\n\nWhen applying styles, here’s how to control what InDesign does with existing formatting:\n\n- To apply a paragraph style and preserve character styles, but remove overrides, hold down Alt (Windows) or Option (Mac OS) as you click the name of the style in the Paragraph Styles palette.\n\n- To apply a paragraph style and remove both character styles and overrides, hold down Alt+Shift (Windows) or Option+Shift (Mac OS) as you click the name of the style in the Paragraph Styles palette.\n\n"
    },
    {
      "time": " 16.Jul.2006 3.42pm",
      "content": "You might want to set InDesign’s Type Preference (Accessed through Apple+,) to disregard style when pasting text from other applications.\n\n"
    }
  ]
}
