{
  "id": "21253",
  "title": "FontExplorer X: Workaround Discovered",
  "forum": "Miss Tiffany's blog",
  "tags": [

  ],
  "content": "I love FEX. So, this is in no way shape or form to become a rant of any sort. What I'm about to say might boggle the minds of some of you. However, I am hoping to help some others.\n\nI found that FEX saw duplicates of some of my fonts when I know darn well there weren't any. In a last bit of desperation I tried activating the family. Well, of course, it saw some as already active, but when I skipped all the rest of the messages it still ends up with a complete set of active fonts. I can make it happen with the Helvetica family:\n\n ![](http://web.archive.org/web/20131017024907im_/http:/typophile.com/files/myhelveticahell_6160.png)\n\nSo after activating them, I simply selected those activated fonts, dragged them out (exported them), removed the font from FEX, cleaned the manage folder, quit FEX, emptied the trash, restarted FEX, and imported the newly created set from the desktop. All is right with the world now.\n\n ![](http://web.archive.org/web/20131017024907im_/http:/typophile.com/files/myhelveticaheaven_4626.png)\n\n",
  "author": "Miss Tiffany",
  "time": "12 Jul 2006 — 1:26pm",
  "uid": "108",
  "comments": [
    {
      "time": "12 Jul 2006 — 1:43pm",
      "content": "/me scratches head\n\nMy only problem with FEX is that it always took forever to render my fonts, and there was a significant lag time. For example, if I happened to just be browsing, using my up and down arrow keys, when I would switch from one family to the next, it took a while for them to show up and I always got the spinning beach ball of death while it was thinking. Is this still a problem?\n\n"
    },
    {
      "time": "12 Jul 2006 — 2:12pm",
      "content": "Yes. I have found that. But I've decided it is a small price to pay for an application that seems to be superior to the others. I mean I've licensed all of the font management software at one point and now I'm happy to use FEX.\n\n"
    },
    {
      "time": "12 Jul 2006 — 2:14pm",
      "content": "What was your biggest beef with FontAgent Pro, Tiff?\n\n"
    },
    {
      "time": "12 Jul 2006 — 2:36pm",
      "content": "Promise not to laugh?\n\nI didn't like the gui.\n\n"
    },
    {
      "time": "12 Jul 2006 — 3:47pm",
      "content": "Understandable. I've dropped many an app or stuck with crap for the same reasons. That said, I would argue that FAP is still the most stable and efficient of the managers. If they cleaned up their interface they might be able to gain some more ground.\n\n"
    }
  ]
}
