{
  "id": "21265",
  "title": "\"fire\" work in progress",
  "forum": "Motion / 3d / Experimental",
  "tags": [
    "Motion / 3d / Experimental"
  ],
  "content": "Hi all,\n\nHad originally created a logo for a ficticious record label called \"Fire\" but decided to take the project further by doing a whole typeface. (Done in Illustrator.) It's a work in progress as I've literally spent a couple of days on the lowercase characters.\n\nIf you image I started with F I R and E, these were made from quarter circles / half arches, depending on what you want to called them. Anyway, the logo looked quite effective (see attached image) so I continue to use the original shapes plus some straight lines.\n\nI've tried not to be too traditional with X-height - the C and E are good examples. The idea is to try and keep the characters as clean and simple as possible. I ran into problems creating a effective S, T and Z... I'm quite happy with the S and T now, but the Z isn't quite right - it doens't look at all right... I'm tempted to go for a simple X-height version, but ideally I wanted it to have a descender, like the C and E. I'm also considering losing the dots off the I and J (as the original Fire logo didn't have this.)\n\nAnyway let me know what you like, don't like about it. Would like to finish the l/c before I even attempt the u/c set.\n\nFor numbered characters, I was thinking to ditch the traditional idea of English/Mathematical numbers, but to replace with digits or even just the words: EG: \"3\" would be \"three\" or \"...\" - that way 131 would be: \"onethreeone\" or \". ... .\"\n\nI wish I was a student again, I'd have ore time, but would lack money!\n\n ![](http://web.archive.org/web/20150317182301im_/http:/typophile.com/files/Fire-Text_5007.gif)\n\n ![](http://web.archive.org/web/20150317182301im_/http:/typophile.com/files/Fire-Logo_4727.gif)\n\n",
  "author": "russ",
  "time": "13 Jul 2006 — 5:58am",
  "uid": "4902",
  "comments": [
    {
      "time": "13 Jul 2006 — 6:59am",
      "content": "hmmm, ok. now decrease the size of the logo to about 50 pixels wide.\n\n----------  \n**Paul Ducco**  \n [Solid Creative](http://web.archive.org/web/20150317182301/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "13 Jul 2006 — 7:30am",
      "content": "I think it is a little difficult to read the word \"fire\", I think it is because the F, and although I like the general appereance of the typography, have you tried to write some words to balance if you like the way they look? Sorry for my English.\n\n"
    },
    {
      "time": "13 Jul 2006 — 8:20am",
      "content": "D'oh - sorry Paul - they were a little large weren't they!?! (Does my lack of design-for-web come to light now?)\n\nHopefully these will look better...\n\n ![](http://web.archive.org/web/20150317182301im_/http:/typophile.com/files/Fire-Logo_6062.gif)\n\n ![](http://web.archive.org/web/20150317182301im_/http:/typophile.com/files/Fire-Text_3466.gif)\n\nSo the F is causing problems? I kind of like the way it \"techinically\" is an F despite it's lack of descender. The text doesn't particularly have to be legible at 8pt, as it's more a club/flyer orientated display font. I've put some word together and like it but stick need to try it out as a proper font (i.e converted via Fontographer, which I still need to buy!)\n\n"
    },
    {
      "time": "14 Jul 2006 — 5:23am",
      "content": "Not a problem at all Russ, I was more meaning the decrease in size to make the point about readability.\n\nKeep us posted with progress/refinements :)\n\n----------  \n**Paul Ducco**  \n [Solid Creative](http://web.archive.org/web/20150317182301/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "17 Jul 2006 — 7:17am",
      "content": "I like that font, but the over-sized C, X and Z bother me and there's something about the e, f and s that doesn't seem to connect with the rest of the lettershapes. That p is great though.\n\n"
    },
    {
      "time": "18 Jul 2006 — 1:30pm",
      "content": "Cool, cheers for the feedback Asvetic.\n\nThe Z was bothering me, too, so I've changed to a smaller version. I see what you mean about the X and the S.\n\nIn regards to the E and F - these were literaly two characters I started with, so the idea was to keep them as they are. But saying that, I see why people would view them with some concern. So what I'm thinking about now is to create some alternative lower case characters... I'll stick a new post on here soon.\n\nCheers, Russ\n\n"
    },
    {
      "time": "20 Jul 2006 — 4:59am",
      "content": "nice. lookign forward to it. :)\n\n----------  \n**Paul Ducco**  \n [Solid Creative](http://web.archive.org/web/20150317182301/http:/www.solid-creative.com/about.htm)\n\n"
    },
    {
      "time": "25 Jul 2006 — 9:28am",
      "content": "Hi guys, here's an update.  \nChanged a few characters, added the capitals and created some alternatives.\n\nLet me know what you think on these - the capitals need some work. Once these are done I'll start the numbers and punctuation marks.\n\nCheers  \nPaul\n\n ![](http://web.archive.org/web/20150317182301im_/http:/typophile.com/files/Fire-Text-copy_5857.gif)\n\n"
    },
    {
      "time": "9 Aug 2006 — 9:31am",
      "content": "Hey this is looking alot better. I like that first \"f\", something about that descender is nice. You might want to carry that look into the \"t\" and the \"j\". I see you reworked the \"e\" and the \"s\" as well, while the letterforms are much more consistant with the rest of the alphabet, they still seem unfinished. Both have a compressed look (as if smushed from the top down.) The \"s\" is definitely too wide as well. I know you're trying to make every character unique, I think in this instance, you might have to give up and go with a more traditional look to these characters (follow?)\n\nAs far as the Capitals. I'm not really feeling the majority of these at all. Most of them look like you took the lowercase letters and extended them or resized and compressed them. While they're not all horrible, I think this might need some new attention.\n\nI'm still very impressed with the look. This will be a fun font when you're finished. Keep at it.\n\n"
    },
    {
      "time": "16 Aug 2006 — 12:43am",
      "content": "Now you're talking!  \nThe new version is a vast improvement in legibility & could even work for longer texts.  \nIt's good however that you've kept the alternatives & added some more (the lowercase g alternative is very nice).  \nThe uppercase G looks a little condensed compared to the rest, maybe it might be better to put the bar on the right side?\n\n"
    },
    {
      "time": "19 Dec 2006 — 12:05pm",
      "content": "Russ -\n\nI really like this type face, although its definetly not a complete system yet and you should push it further. I know Im coming into this discussion late as its December now and you all havent posted since August but keep up the interesting work!\n\nA couple quick suggestions:\n\n- have you investigated what a rounded terminal would do for some of the characters?  \n - try adding a curling descender to certain letters (k, m, n, etc) like on your 'y' but with an exaggerated curl?  \n - Your caps do seem condensed, also the B and R have akward bowl shapes, I would reccomend incorporating a look similr to the g, p, q\n\nIm really into this typeface, creating an entire type face is no small task, keep going. I think your number/lettering concept was interesting; kind of out there...have you looked into old numerals with offset baselines? I think you may be apt to follow that route as your descenders are already breaking ground so to speak, I would love to see that carry over into the numerals.\n\n~ 3r\n\n"
    }
  ]
}
