{
  "id": "21264",
  "title": "Adobe Acrobat Pro 7.0 Font problems - HELP!",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "We publish B2B magazines. We process our own files in InDesign, and create hi-res PDF's for the printer. I have 5 designers/workstations (G5 Macs). All generate PDF's. The problem: We get boxes with X's in them in some areas of the PDF, and it is exclusively Garamond Premier Pro (OTF), ITALICS that becomes funky. Not always, not all instances, but randomly within the document. It seems to be related to that font (I am guessing), as the other designers, using different typefaces DON'T experience the same thing when creating theif issue's PDF's.\n\nWe generate PDF's of the spreads/pages, then we pull them together as one big PDF of the entire issue to send to the printer. A tall-tell sign is the copy at the bottom of the page (the file name, and date) that is generated on each PDF, has characters missing. You know then that somewhere there will be boxes with X's in them.\n\nWe've deleted and replaced the font with the original on CD. That didn't work. I thought maybe it was just one machine, but when we use other Macs, same thing happens. I've spoken to my printer tech specialist, and he says that he thinks it's an Adobe software problem (this guy has written code and worked on Adobe software for them). He has spoken to them about it, but they seem to want to deny that there is any problem.\n\nIt get's weirder! So I take the entire PDF file we created. I noted that roughly 6 pages had boxes with X's in them (and the copy at the bottom of the page is missing characters). I recreated those pages that were funky. I began to delete and insert the new \"fixed\" pages in the big PDF file. I replace about the 3rd one, and whoosh... it's like suddenly the font (subset?) is now recognized, and the remaining pages that needed to be fixed, are now okay... and the copy at the bottom of each page is now all there. The characters all appear.\n\nGETS EVEN WEIRDER!! So, we send that file to the printer. Their proof comes back, everything appears to be fine. I open up the original file we sent them, and WHOA... now the pages that had problems originally, now have boxes with \"X\"'s in them, and the copy at the bottom of the page has a lot of characters missing!!!! I did nothing to the file, simply opened it. Plus, when I opened up the very first original file, the one that I started to correct, it now seems fine. NO \"x-boxes\" NO copy missing at the bottom of the page.\n\nVery FREAKY!! Anybody out there have any suggesstions? Keep in mind, when distilled, we indicate to \"Embed all fonts\", so the fonts should be there. In Adobe Pro 7.0, I can see the font list, and the font in question is there, but there still is a problem with the x-boxes, etc. I wish there was a way for Adobe to have a choice to \"activate all fonts\"? As it seems to me as though, for some odd reason, it doesn't want to recognize the font, and in particular the italics, (though not in all instances, which is strange). If we send the file with the problem, we've actually gone to press with type dropping off, but more importantly, the x-boxes printing. A real problem! So we are having to pay extra close attention to the files, and proofs, which is taking up a lot of time.\n\nAnybody experiencing something similar? Any possible solutions? I'm thinking it must be that font, since it doesn't appear to happen any other time, as least not yet!\n\nThanks,\n\nBryan\n\n",
  "author": "art0ist",
  "time": "13 Jul 2006 — 5:45am",
  "uid": "13831",
  "comments": [
    {
      "time": "13 Jul 2006 — 7:04am",
      "content": "I had a similar problem with Adobe Garamond on a book cover series - I didn't get X boxes, but charatcers were not processing when Distilled with Acrobat 7 Pro. The fonts would not embed, and would corrupt.  \nIt was causing so much grief that I simply removed the font from the system and refuse to use it again.\n\nI assuming you only have one file installed? (Not and older version and a newer version?)  \nDo you have an alternative Garamond to use - say an ITC version?\n\nSorry I can't be much help.\n\n"
    },
    {
      "time": "13 Jul 2006 — 9:16am",
      "content": "I've moved your thread to the BUILD forum and have e-mailed Thomas (Phinney) to see if he can help.\n\n"
    },
    {
      "time": "13 Jul 2006 — 10:38am",
      "content": "My non-professional guess is that there is some sort of bizarre embedding permissions (bits?) within the font. The Adobe type team is aware of your problem. You might also go to the Adobe support forums and post there. Wish I could help.\n\n"
    },
    {
      "time": "13 Jul 2006 — 12:53pm",
      "content": "My guess (and I'd like to stress that this is only a guess) is that your installation of Acrobat might be corrupted. You may say, \"Ok, but this happens in all 5 computers\", which would be a huge coincidence, I know. (But it can happen. Maybe due to a Mac OS X update?)\n\nThis guess is based on the random behavior you describe — usually buggy fonts don't behave randomly within the same application —, and on the fact that some things only get scrambled when you open the file — as you said, _\"So, we send that file to the printer. Their proof comes back, everything appears to be fine. I open up the original file we sent them, and WHOA… now the pages that had problems originally, now have boxes with “X“‘s in them\"_.\n\n"
    },
    {
      "time": "13 Jul 2006 — 1:24pm",
      "content": "That is a much better guess than mine.\n\n"
    },
    {
      "time": "13 Jul 2006 — 1:31pm",
      "content": "We do have other Garamond fonts. This font was picked (and purchased) as part of a recent re-design of the magazine. So changing it is an option, but a challenge, since we just did. Editors like the font.\n\nBecause it only happens on that font, my thinking is it is the font, that Adobe Pro 7.0 is having problems reading (as an embedded subset). My printer indicated to me that we are not the only ones whom have this problem. Others too are running into it (but not the same font). Might be how the original font was created in the coding?\n\nThanks.\n\n"
    },
    {
      "time": "13 Jul 2006 — 2:38pm",
      "content": "Could it be a font caching issue?\n\nChrisL\n\n"
    },
    {
      "time": "14 Jul 2006 — 1:49pm",
      "content": "What is \"Adobe Pro 7.0\"?\n\n"
    },
    {
      "time": "14 Jul 2006 — 1:59pm",
      "content": "I may be way off base here, but...\n\nTry de-activating the fonts you used in the publication BEFORE opening the PDF. It could be that Acrobat is not bothering with the embedded fonts and is instead using the ones you have installed. I have noticed, from time to time, that when Acrobat embeds and creates subsets, the subsets aren't always mapped the same way the original font is.\n\nThis may not be the answer, but it would explain why your printer isn't experiencing the same problems you are...\n\n"
    },
    {
      "time": "14 Jul 2006 — 3:33pm",
      "content": "\\> _What is “Adobe Pro 7.0”?_\n\nBryan meant \"Adobe Acrobat 7.0 Professional\"\n\n\\> _Try de-activating the fonts you used in the publication BEFORE opening the PDF. It could be that Acrobat is not bothering with the embedded fonts and is instead using the ones you have installed._\n\nThere's no need to do that. AFAIK, if you deselect the option \"Advanced-\\>Use Local Fonts\", Acrobat will display only the fonts embedded in the document, and Adobe Serif & Sans for the non-embedded.\n\n"
    },
    {
      "time": "16 Jul 2006 — 2:16pm",
      "content": "_There’s no need to do that. AFAIK, if you deselect the option “Advanced-\\>Use Local Fonts”, Acrobat will display only the fonts embedded in the document, and Adobe Serif & Sans for the non-embedded._\n\nTheoretically, that fix _should_ work, but my experience with Acrobat 6 Professional tells me that it doesn't always...\n\n"
    },
    {
      "time": "17 Jul 2006 — 8:06am",
      "content": "I've had the same problems with this font -- getting strange x-instead-a-box characters instead of the italics. In my case, I \\*believe\\* it was caused when I used the \"Replace Pages\" feature in Acrobat 7 to swap out a page with an error with a corrected page, or possibly just when combining multiple PDF files into a single PDF file, but more than likely it was the combination of both that did it.\n\nThe print version of the book was perfect, but I had numerous problems when assembling the PDF version. The PDFs were all created from distilled postscript files. Similar setup: PowerMac G5, InDesign CS2, Acrobat 7.\n\nI've just started work on another reprint of the book at a different printer, so I'll possibly learn some \"new and exciting things\" about this font and its wonky interactions very soon.\n\n"
    },
    {
      "time": "17 Jul 2006 — 1:49pm",
      "content": "In my experience, when you combine pages from several PDFs into one, it's best to use the \"SAVE AS\" command, which will \"consolidate\" the various fonts, eliminate unused objects and, usually, make the final file a little smaller.\n\n"
    },
    {
      "time": "17 Jul 2006 — 2:03pm",
      "content": "OK, here's an update on this issue:\n\nBryan's workflow went like this:  \nInDesign (CS2/4.0.2) --\\> PostScript files --\\> Distiller 7.0.7 --\\> PDF files --\\> Acrobat Pro (7.0.8) --\\> single PDF file\n\nSeveral PDF pages had indeed some characters replaced by [notdef](http://web.archive.org/web/20141009114637/http:/typophile.com/wiki/notdef)s (technical name of the mentioned X-boxes), and overall it seemed to affect only fonts of the Garamond Premier family (not restricted to a specific weight or style). Upon further analyses it was diagnosed that the fonts had not been correctly embedded. It was suggested to Bryan to change his workflow. He did, and now the problem seems to be solved.\n\nNew workflow:  \nInDesign (CS2/4.0.2) --\\> PDF files --\\> Acrobat Pro (7.0.8) --\\> single PDF file\n\nConclusion:  \nThe fonts are working as expected\n\n"
    },
    {
      "time": "17 Jul 2006 — 2:37pm",
      "content": "Very nice.\n\nHis workflow looks similar to how I used to have to create PDFs from Quark 4. Eek!\n\n"
    },
    {
      "time": "14 Aug 2006 — 5:26am",
      "content": "Problem solved! Thanks to Miguel Sousa with Adobe. There appears to be a problem when postscripting the file first, then distilling it. Since InDesign allows you to PDF directly through its software, it skips the postscripting process through Distiller, and just creates a PDF. We have specific settings that our printer requires, so it was just a matter of getting that from them and setting up a preset.\n\nIt actually made it easier, since now it became a one step process. The bottomline is, it fixed the problem, and so far it has gone smoothly. Of course, I was told that InDesign 4.0 was necessary, as I guess earlier versions did not do as good of a job in the PDF workflow. But I wouoldn't know that from personal experience. That was according to my printer.\n\nAccording to Miguel, Adobe has been informed of the problem, and the developers are looking into it for Acrobat and Distiller to fix it. Thanks for everyone's input and hopefully this will help someone else with the same problem.\n\nBryan\n\n"
    },
    {
      "time": "15 Aug 2006 — 7:44am",
      "content": "Bryan,  \nYou can always count on Miguel to come through for you. Adobe made a smart decision when they hired him.\n\nChrisL\n\n"
    }
  ]
}
