{
  "id": "2126",
  "title": "Narrow serif",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm looking for a narrow serif typface. It's going to be used for an one page essay (about politics), and I want to fit a lot of text on the same page. It should of course be legible...\n\n",
  "author": "ikonoklast",
  "time": "19 Nov 2003 — 9:18am",
  "uid": "2643",
  "comments": [
    {
      "time": "19 Nov 2003 — 9:35am",
      "content": "It might seem counter-intuitive, but narrowness actually results in less economy than a wide face!   \n(Except in one-line settings.)   \n   \nThe reasons are that:   \n1) A wide face can be used at a smaller point size while maintaining (and possibly even improving\\* on) apparent size.   \n2) Linebreaks in text will often negate the culmulative horizontal savings a narrow face accumulates over many lines. A wider face at a smaller point size always saves in vertical space.   \n   \n\\* This I still have to verify.   \n   \nSo a narrow face will only be more economical than a wide face -at a smaller size- if your text has very few linebreaks.   \n   \nHowever, wide faces can convey less elegance/sophistication than a narrow face (like see the new LA Times body face), so a good reason to use a narrow font to save space would be if you want to convey a certain atmosphere. And note that a good narrowness/width depends on the point size (more like point size _range_) you're using.   \n   \nAnyway, if you do decide on a narrow font, try Stone Print.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Nov 2003 — 10:10am",
      "content": "well, my teacher doesn't like when the size is anything other than 12 points (12/14). Otherwise I would have set the text in a smaller size. Stone Print looks nice Hrant - any other suggestions?\n\n"
    },
    {
      "time": "19 Nov 2003 — 10:32am",
      "content": "\\> my teacher doesn't like when the size is anything other than 12 points (12/14)   \n   \nIs this a pre-law class? :-/   \n   \nDoesn't he think point size (not to mention leading) depends on what's being designed?   \nWould he set a newspaper in 12 point? I mean, I know Swedes have long arms, but that's ridiculous.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Nov 2003 — 11:22am",
      "content": "I just thought of a potential loophole in your teacher's \"rule\".   \nIf you could just get him to drop the 2-point leading requirement (try to think of a good excuse for that, like short lines), what you could do is use a font that's wide but small on the body, with zero (or maybe even negative) leading. That way you'll have a \"12 point\" font (\"Just look, Quark says it's 12 point!\"), but you could use width/size instead of narrowness to save space.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Nov 2003 — 12:44am",
      "content": "Make the layout with two or three columns, with a generous gutter, try to keep your measure to 40-50 characters, no hyphenation if possible.   \n   \nTim\n\n"
    },
    {
      "time": "20 Nov 2003 — 2:46pm",
      "content": "I've read that 65 characters is ideal, but I guess it all depends on the typeface used. Changing the leading is of course an option, I'll do some experiments on it...   \n   \nAny more suggestions on a narrow font?\n\n"
    },
    {
      "time": "20 Nov 2003 — 3:05pm",
      "content": "If you can get away from a serif face I like Agenda\n\n"
    }
  ]
}
