{
  "id": "2128",
  "title": "Should the EULA be standardized?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Have you ever NOT licensed type because the EULA was too restrictive? Have you ever licensed type only to realize that the EULA was too restrictive? Are there certain type foundries from whom you do not or will not license type because their EULA is too restrictive? On the other side of the proverbial coin, are there foundries for whom you are loyal because (besides beautiful and useful type) they have what you deem to be a fair EULA?   \n   \nIf you had a say in the standardization of the EULA, how would you format it? (Within reason, of course, and with what is semi-standard now.) Would you have it side with output devices or with desktops? Would you include a laptop or some sort of 70/30 clause?   \n   \nThoughts? Ideas? Links to favorite EULAs?   \n   \n(No flaming or insulting or name calling, please.)\n\n",
  "author": "Miss Tiffany",
  "time": "19 Nov 2003 — 10:06am",
  "uid": "108",
  "comments": [
    {
      "time": "19 Nov 2003 — 12:40pm",
      "content": "I \\_try\\_ to avoid any EULA that doesn't allow embedding, but it gets hard.   \n   \nAdobe's EULA is good, Nick Shinn's is better. Storm allows modication for internal use, Linotype expessly forbids it.   \n   \nI think I \\_should\\_ be allowed to modify a font for my use, and I should be allowed to embed it.   \n   \nFont Bureau, and lots of others, require a separate agreement for embedding. This seems inequitable: I don't see why McDonald's should be able to buy, say...Whitman, and put it on their placemats coast to coast for less than it would cost me to distribute teacher's guides for my children's theatre productions as PDFs.   \n   \nBut I know it's their call, so I use Adobe fonts for my study guides.   \n   \nMy $.02 CDN.\n\n"
    },
    {
      "time": "19 Nov 2003 — 1:09pm",
      "content": "With regards to standardizing EULAs, there are two things that come to mind:   \n   \nFirst, standardizing the \\*language\\* of a EULA might be done without standardizing the actual \\*content\\* of a EULA. It seems to me these are two different things.   \n   \nSecond, standardizing the content of EULAs across foundries might run afoul of anti-trust laws. So it's not something I would pursue without consulting a lawyer. (Heck, even standardizing the language might be dangerous, though I can't see why. But I'm not a lawyer.)   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "19 Nov 2003 — 1:12pm",
      "content": "I just finished an article on the embedding of fonts (web and PDF) for the Dutch magazine Publish. The reason was a dispute between a designer, the customer of the designer, the font distributor and the legal advisor of the Dutch Association of Graphic Arts Designers BNO.   \nIt was a technical/legal problem and the designer (and the association of designers) blamed the distributor to provide poor information on the subject of embedding, subsetting and additional client-licenses for service applications.   \nThe distributor sold fonts from some twenty sources with mostly different EULA's.   \nThe user hates to read one EULA; how about twenty?   \nDesigners would like a list of differences on each of the relevant conditions such as embedding allowed, subsetting requested, web embedding allowed, 5-cpu license, multi user license, multi site license, output only license etc. etc.   \nI agreed with the association of designers BNO to do some investigation on the different forms of licenses and conditions (EULA's). I agreed to do the basic research and will send an e-survey (in the English language) to font producers within short.   \nMost typefoundries in the Netherlands (as you know we have a few) agreed to cooperate.   \nAdobe, Agfa-Monotype and Linotype sponsored my earlier publication on that subject in 2001.   \nIf interested I will send you the documents on this new survey and publication later this year.   \nRegards, Henk Gianotten   \nGiarte Media Group BV\n\n<!--attachment: Fontsand_illegal_softwareUS-20830.pdf*mime_pdf.gif*application/pdf*32.9*Fonts+and+illegal+software*Fontsand%26%2340%3billegal%26%2341%3bsoftwareUS%2epdf --><!--attachment: Fontsand_illegal_softwareUS-20830.pdf*mime_pdf.gif*application/pdf*32.9*Fonts+and+illegal+software*Fontsand%26%2340%3billegal%26%2341%3bsoftwareUS%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150414142130im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Fonts and illegal software<br><a href=\"http://web.archive.org/web/20150414142130/http:/www.typophile.com/forums/messages/4102/Fontsand_illegal_softwareUS-20830.pdf\" target=\"_blank\"><b>Fontsand(illegal)softwareUS.pdf</b></a> (32.9 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "19 Nov 2003 — 1:32pm",
      "content": "John: What do you like better about Nick's EULA over Adobe's?   \n   \nT\n\n"
    },
    {
      "time": "19 Nov 2003 — 2:29pm",
      "content": "John said: I \\_try\\_ to avoid any EULA that doesn't allow embedding, but it gets hard.   \n   \nIts not just the EULA though. I've had to hack into font files to change the embedability settings so that I can use them as per the agreement. I've also done this with font files which have a EULA which forbids embedding, but when I ask the vendor/foundry they say that my circumstances don't require a special licence, but the software I use will only let me embed embedable fonts.   \n(See the level of paranoia here - I have to post under an anonymous persona, even though I've only used fonts in the way I've been entitled to. I just think that as soon as I admit to hacking around with font files someone will be on my back. Am I right to be so paranoid?)\n\n"
    },
    {
      "time": "19 Nov 2003 — 2:50pm",
      "content": "Joe, great idea!   \n   \nMr Question: most font houses aren't _that_ nasty - they're usually ecstatic you bought the thing in the first place! Like the other day I admitted in public to modifying MS Times, and I even showed a sample of it, and a heavy from MS was posting in that thread too! Well, I'm _assuming_ a letter isn't on its way...   \n   \nBut some houses certainly are supernasty.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Nov 2003 — 3:10pm",
      "content": "\\>avoid any EULA that doesn't allow embedding   \n   \nI'm not the most knowledgable about EULAs as I purchase a very small amount of fonts, but I'm with John on this point. Most of my type I use in materials for the classes I teach - so the inabilty to create PDFs is quite a hindrance.   \n   \nIf I ever get around to finishing/releasing the fonts I'm working on now, ideally I'd like to have a license that allows for embedding, service bureaus, 'laptop clauses', etc. Primarily because I want people to _use_ the fonts, and I'd like to make that as easy as possible.   \n   \nI'm also very inexperienced and naïve :-)   \n   \n\\>Who is going to volunteer   \n   \nWell, I've got some time tomorrow afternoon, so I'll try to sift through some of them.\n\n"
    },
    {
      "time": "19 Nov 2003 — 3:32pm",
      "content": "Thomas:   \nNick permits \"archival copies\", not just a single backup, and he allows the font to be supplied to a service bureau for output, as long as the bureau assures you they will use it for your output only, and trash it afterward!   \n   \nNow, I would send a PDF, not a native file, so that one's not too big a deal to me, but it sure gives one a \"I trust you\" feeling.   \n   \nI don't expect Adobe's lawyers to go for that one, but they might allow 2 backups.   \n   \nDon't get me wrong, though: I think Adobe's EULA is very fair and well thought out. I know that Adobe embedding permissions are \"enlightened self-interest\", but it sure benifits me!\n\n"
    },
    {
      "time": "24 Nov 2003 — 12:17pm",
      "content": "I actually have some work done on that AI file that Joseph posted, Tiffany. I'm on my way to the airport, but I can send it to you when I get to Boston if you want.\n\n"
    },
    {
      "time": "24 Nov 2003 — 12:27pm",
      "content": "No problem - I'll get it to you on Tuesday or Wednesday. As soon as I find an internet connection there.\n\n"
    },
    {
      "time": "24 Nov 2003 — 12:33pm",
      "content": "This might be useful to some folks. It's just links to the online EULAs of several foundries - maybe a time saver.   \n   \n [Bitstream](http://web.archive.org/web/20150414142130/http:/store.bitstream.com/license.asp?handle=10028)   \n [Fonthaus](http://web.archive.org/web/20150414142130/https:/www.fonthaus.com/order/license.cfm?CFID=283357&CFTOKEN=13657304)   \n [LettError](http://web.archive.org/web/20150414142130/http:/letterror.com/foundry/license.html)   \n [ShinnType](http://web.archive.org/web/20150414142130/http:/www.myfonts.com/viewlicense?id=46)   \n [Emigre](http://web.archive.org/web/20150414142130/http:/emigre.com/EUL.php)   \n [House Industries](http://web.archive.org/web/20150414142130/http:/houseind.com/house.php?page=licensing&subpage=heavy#1)   \n [Enschede](http://web.archive.org/web/20150414142130/http:/www.teff.nl/licenties/licentie.html)   \n [Berthold](http://web.archive.org/web/20150414142130/http:/www.bertholdtypes.com/info/agreement.html)   \n [Storm](http://web.archive.org/web/20150414142130/http:/stormtype.com/licenceCz.html)\n\n"
    },
    {
      "time": "24 Nov 2003 — 1:32pm",
      "content": "For embedability the chart will need to go into a bit more detail.   \n   \nFor example does the foundry\n\n"
    },
    {
      "time": "24 Nov 2003 — 2:39pm",
      "content": "Simon:   \n_Restrict embedding to cases where the embedded font   \ncan not be extracted?_      \n   \nAre there such cases?\n\n"
    },
    {
      "time": "24 Nov 2003 — 5:09pm",
      "content": "There is quite a lof of debate on the embedding question, partly involving protection against piracy, but also regarding the value added to things like electronic books by inclusion of fonts. There is a recognition that value is being added by font embedding, and that this value is not fixed but depends on the ways in which the embedded font can be utilised. For example, does the embedded font simply display the text, or can the embedded font be copied with text into annotations or comments? If the document includes specialised characters, there is a legitimate need to be able to display these in annotations, but then the reader of the document may also become a _user_ of the font. So distributing a commercial ebook with an embedded font may be seen as distribution of that font, not simply as distribution of something made with that font as in the case of a paper book. So yes, rights management is something that is likely to be applied to fonts in future, in which users will pay different amounts depending on the collection of rights that they want to purchase, i.e. on how they want to use the fonts. The good side of this is that it will offer more flexibility in pricing, and may make fonts less expensive for some uses; however, without a serious rights management system this would lead to a lot of confusion. In other words, simply relying on people to read a EULA to know what they can and cannot do with a font is not sufficient, especially if you are trying to tailor EULA's to individual user rights.   \n   \nI don't have a problem with the idea of standardising a kind of boilerplate EULA for typical retail font distribution by companies with large libraries. I think the situation for small foundries may be more complicated. In the future, my own company will be distributing fonts under a number of different license agreements, some of which are unique to particular fonts and reflect agreements with the original clients. We will have some families in which different fonts will be covered by different licenses, because some fonts will be freely redistributable and others will not. The idea of a standardised EULA is really too simplistic for us.\n\n"
    },
    {
      "time": "25 Nov 2003 — 3:37am",
      "content": "Restrict embedding to cases where the embedded font   \ncan not be extracted?   \n   \nAre there such cases?   \n   \nYes.   \nYou need to embed fonts into exe files if you are to use them in dynamic text (displaying the value of a variable, for example). The fonts cannot be extracted from the exe file (although you could create an exe file which was a text editor, embed one or more fonts and allow printing or screen capture of the text).\n\n"
    },
    {
      "time": "25 Nov 2003 — 5:02am",
      "content": "This is an interesting topic. We work with some large telecom and financial organisations, and have started offering a Commercial Embedding License to these companies who want to embed the Type1/TTF's in distributed documents e.g. PDF's   \n   \nWe decided on this because we realised that our barcode fonts were being embedded into Phone Bills, Financial Statements etc to lierally millions of home users per month, thus adding considerable value to the docuemnt.   \n   \nI'm all for protecting the Type Industry and think the designers should be rewarded accordingly.   \n   \nCheers   \nNeil\n\n"
    },
    {
      "time": "26 Nov 2003 — 6:26am",
      "content": "_The fonts cannot be extracted from the exe file (although you could create an exe file which was a text editor, embed one or more fonts and allow printing or screen capture of the text)._   \n   \nHmm... I'm not so sure about that, Steve. It depends on how you compile your executable.   \n   \n_We decided on this because we realised that our barcode fonts were being embedded into Phone Bills, Financial Statements etc to lierally millions of home users per month, thus adding considerable value to the docuemnt._   \n   \nLeave it up to a phone company to embed a barcode into a document that's already digital! :-)\n\n"
    },
    {
      "time": "26 Nov 2003 — 12:21pm",
      "content": "\\>\\>Hmm... I'm not so sure about that, Steve. It depends on how you compile your executable   \n   \nJohn, I'm not sure about which bit you're not sure about!   \nIf you mean you doubt whether the fonts can be completely 100% protected from extraction from the exe, then, fair enough, you may be right. Dismembering exe files isn't my speciality so I don't know what's possible. I couldn't guarantee that someone would not be able to dismember my exe files enough to extract a font file, but I assume that it would be more difficult to do that than to just pick up a pirate version from the web.\n\n"
    },
    {
      "time": "27 Nov 2003 — 11:38am",
      "content": "Although some of you doubt the standardization of font licenses Agfa Monotype and Linotype agreed to standardize their license conditions.   \nI only could find the Linotype press release covering that subject. It was dated May 28 2003 but AMT most probably will have used identical wordings to explain the benefits.   \nThe attachment descibes the Lino version.\n\n<!--attachment: Linotype ___Agfa_Monotype_EULA-21435.pdf*mime_pdf.gif*application/pdf*69.3*Linotype+Agfa+standard+EULA+PR*Linotype+%26amp%3b+Agfa+Monotype+EULA%2epdf --><!--attachment: Linotype___ Agfa_Monotype_EULA-21435.pdf*mime_pdf.gif*application/pdf*69.3*Linotype+Agfa+standard+EULA+PR*Linotype+%26amp%3b+Agfa+Monotype+EULA%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150414142130im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Linotype Agfa standard EULA PR<br><a href=\"http://web.archive.org/web/20150414142130/http:/www.typophile.com/forums/messages/4102/Linotype___Agfa_Monotype_EULA-21435.pdf\" target=\"_blank\"><b>Linotype &amp; Agfa Monotype EULA.pdf</b></a> (69.3 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "3 Dec 2003 — 3:53am",
      "content": "I've been thinking about licenses for font   \nembedding on web documents when this question   \ncame out: Does anybody if is there a way of   \ndisassembling the embedded font? I mean, if   \na font is converted by a tool such as MS WEFT,   \nis there a way of converting it back to a   \nvalid TrueType file?   \n   \nI've heard there's also a way of extracting fonts   \nfrom PDF files, but I didn't see it working yet.   \n   \nIf that kind of hack exists, my opinion about   \nlicenses for embedding fonts would change a lot.\n\n"
    },
    {
      "time": "3 Dec 2003 — 4:03am",
      "content": "There is indeed a way to extract embedded or subset fonts from PDF documents, which is, if I'm not mistaken, linked on Luc Devroye's site - but that can be prevented with a simple step, which is password protecting the file. Cracking the password is (to my knowledge) a much harder step.\n\n"
    },
    {
      "time": "3 Dec 2003 — 5:55am",
      "content": "_that can be prevented with a simple step, which is   \npassword protecting the file_      \n   \nHmmm. I don\n\n"
    },
    {
      "time": "3 Dec 2003 — 8:06am",
      "content": "You don't have to password-protect it for reading or printing, but for editing - what I gather from one of the methods listed on Devroye's site is that you need to open the file with Acrobat and export an EPS, which cannot be done if the file is protected.   \n   \nEdited: export an EPS, not a PDF, duh.\n\n"
    },
    {
      "time": "3 Dec 2003 — 9:15am",
      "content": "\\> if a font is converted by a tool such as MS WEFT, is there   \n\\> a way of converting it back to a valid TrueType file?   \n   \nI also would like to hear people's opinions about the ease/ubiquity of extracting fonts from MS's EOT method.   \n   \nhhp\n\n"
    },
    {
      "time": "3 Dec 2003 — 10:27am",
      "content": "Anti: you do have password protection for   \nprinting, but it works together with all other   \nsecurity features. Just set a password for   \nchanging the permissions and then turn on   \nthe \"no printing\" checkbox.\n\n"
    },
    {
      "time": "3 Dec 2003 — 11:02am",
      "content": "I guess what Rodolfo meant with:   \n   \n\\> password-protecting the reading of the file -   \n\\> which makes it almost a private thing   \n   \nhas nothing to do with the PDF settings. It's something you would do through the OS, a password to prevent someone from _opening_ the file...\n\n"
    },
    {
      "time": "3 Dec 2003 — 1:22pm",
      "content": "Oi Eduardo. No, I meant setting a password for opening the PDF file,   \nbut through Acrobat itself. I haven\n\n"
    },
    {
      "time": "3 Dec 2003 — 2:32pm",
      "content": "Ok, I stand corrected. Even though protecting a file against alterations (not against printing or viewing) prevents an EPS from being generated, you can export a .PS file with the same contents.   \n   \nRodolfo - yes, he posted (I think) 2 different techniques for extracting fonts from PDF documents. It's one of the first Google results for \"extract fonts from pdf\".\n\n"
    },
    {
      "time": "3 Dec 2003 — 4:09pm",
      "content": "Thanks for the tip Antew ![:-)](http://web.archive.org/web/20150414142130im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI've checked Luc's site and it seems that a   \nsimilar technique for extracting fonts from EOT   \nfiles doesn't exist (yet).   \n   \nI've also googled a lot and didn't find even   \nthe EOT format specification, which would be   \na way of starting a hack.\n\n"
    },
    {
      "time": "3 Dec 2003 — 5:07pm",
      "content": "As I informed you earlier I recently wrote an article for Publish on embedding of fonts. Erik van Blokland (Letterror) gave me some information on the technology to prevent the extracting of fonts from PDF's. It's called Final-form PDF and he proposed that a few years ago. I attached a PDF describing his opinion and suggestions on that.   \nAny comments?   \nHenk\n\n<!--attachment: Final_Form_PDF-21722.pdf*mime_pdf.gif*application/pdf*78.9*Final%2dform%2dpdf*Final+Form+PDF%2epdf --><!--attachment: Final_Form_PDF-21722.pdf*mime_pdf.gif*application/pdf*78.9*Final%2dform%2dpdf*Final+Form+PDF%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150414142130im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Final-form-pdf<br><a href=\"http://web.archive.org/web/20150414142130/http:/www.typophile.com/forums/messages/4102/Final_Form_PDF-21722.pdf\" target=\"_blank\"><b>Final Form PDF.pdf</b></a> (78.9 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "3 Dec 2003 — 5:18pm",
      "content": "Doesn't EOT just place the embedded fonts as plain TT files (with the extension changed) in the cache?   \n   \nhhp\n\n"
    },
    {
      "time": "3 Dec 2003 — 6:05pm",
      "content": "Well, I have no desire to give anyone a tutorial on how to steal fonts, but let's just say that it's \\*very\\* easy to get fonts out of EOT when EOT is actually in use. Much easier than PDF.   \n   \nNot that PDF is ultra-secure, but I have never had any indication that any noticeable amount of piracy has occurred due to fonts being ripped out of PDFs. As I usually say, there are much easier ways to steal a font. Besides which, the fonts have lost their kerning and other supplemental information once put into the PDF.   \n   \nT\n\n"
    },
    {
      "time": "3 Dec 2003 — 7:28pm",
      "content": "With regards to the final form PDF proposal, it's interesting, but upon further consideration, I don't think it's really useful. There are a fair number of PDFs out there that only contain one font, and the proposal does not help at all for those cases.   \n   \nAdditionally, what incentive is there for an end user to create their PDFs specifically in this format? Since that wouldn't work, you'd need to convince PDF creation software developers (at least Adobe and Apple) that they need to always do this, with all the fonts in the document that allow only preview-and-print embedding.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "3 Dec 2003 — 10:20pm",
      "content": "It's no silver bullet, but it does allow foundries to distribute \"special\" PDFs that are much less likely (\"impossible\" is a word I try to avoid...) to hack.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Dec 2003 — 9:31am",
      "content": "Sure, \"Final Form PDF\" is possible. But the only people who would actively want to use it are type foundries, and it doesn't fundamentally protect their work except when they're doing it. Sure, they could do a EULA that only allows \"Final Form PDF\"; but it wouldn't help with docs that only have one font in them. So there would still be \\*some\\* PDFs that would be \"problematic.\"   \n   \nThe thing is, nobody has ever demonstrated that there is a noticeable real-world piracy problem with fonts embedded in PDF. Sure, it's possible to extract fonts from PDFs. But it's just much easier to just get them off of pirate newsgroups or the like. By and large, nobody's bothering to steal them from PDFs, except for people from the type industry who just want to prove that it's possible and not all that difficult.   \n   \nAll that being said, if there were a strong desire from the type industry as a whole to have \"final form PDF\" per this definition, I would certainly ensure that it got circulated to the decision-makers on the Acrobat team.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "6 Dec 2003 — 1:08pm",
      "content": "PDF already has mechanisms for locking content against extraction, which is the only thing that designers would care about. Very very few designers are going to actively take any special measures against font piracy, which is the only thing Erik's proposal helps with.   \n   \nI have emailed you separately....   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "13 Dec 2003 — 2:21pm",
      "content": "I was wondering that too, as I was reading Emigre's embedding info.   \n   \n**from Emigre's Embedding page:**   \nSet font subsetting to 99% in Acrobat Distiller 3.0, before running your PostScript files through Distiller.   \n   \nWhat's the difference between not subsetting, and subsetting at 99%?\n\n"
    },
    {
      "time": "13 Dec 2003 — 7:12pm",
      "content": "_What's the difference between not subsetting, and subsetting at 99%?_   \n   \nSetting Acrobat to subset if anything up to 99% of the glyphs in the font are used means effectively that subsetting always happens. You probably are not using 99% of the glyphs, but whatever percentage you actually use, subsetting will automatically happen. The default subsetting limit in Acrobat 3.0 was 10%, so if you used more than 10% of the glyphs the whole font would be embedded. Adobe changed this default in later versions in response to requests from the font industry.\n\n"
    },
    {
      "time": "14 Dec 2003 — 6:49am",
      "content": "Earlier in this treat I mentioned the condition in a license (one of the non-FontFont fonts distributed by FontShop International) to subset to 99%. (forced subsetting 99%)   \nThis condition was based on Acrobat 3. What these conditions are really saying is that   \nthey require that you always subset fonts.   \nIn Acrobat 4 and later, using \"subset if less than 100%\" causes any and all embedded fonts to be subset even if all glyphs actually in the font are accessed from within the PDF file.   \nAdobe (Dov Isaacs) explained in an earlier discussion on this subject that the subsetted fonts are specially tagged to contrast them with fully-embedded fonts.   \nIn reality, the 99% of Acrobat 3 did the same thing although conceivably, if you used all glyphs in the font within the PDF file, the full font would be embedded with the special tagging.   \nThe opposite of this is\n\n"
    },
    {
      "time": "14 Dec 2003 — 10:16am",
      "content": "Plenty of useful comments from Henk, but a few of them need clarification.   \n   \n\\> Dov mentioned that Distiller always subsets TrueType and OpenType fonts.   \n   \nUnless Distiller always subsets Type 1 fonts as well, this cannot be true. OpenType CFF fonts \\*are\\* Type 1 fonts by the time they reach Distiller (in a PS print stream), and Distiller does not always have access to the original font on the host computer to tell the difference.   \n   \n\\> Any additional editing later on in the process has to be done with installed and fully licensed fonts anyway. That\n\n"
    },
    {
      "time": "16 Dec 2003 — 5:42am",
      "content": "I take that to mean that Henk means \"allowed\" by the EULA?   \n   \nAs Thomas stated, some fonts explicitly allow editing in the pdf with the embedded fonts. In terms of Adobe-sold/licensed fonts, there is a list of fonts at adobe.com and whether they are licensed for \"Preview and Print Embedding\" or for \"Editable Embedding\" according to the EULA   \n [http://www.adobe.com/type/browser/legal/embeddingeula.html](http://web.archive.org/web/20150414142130/http:/www.adobe.com/type/browser/legal/embeddingeula.html)   \n   \nFrom that I would certainly not state that a beautiful new OT typeface like Brioso, when embedded in a PDF, would only be allowed to be edited elsewhere \"if they use the installed and licensed fonts\" as other Henk wrote.   \n   \nOf course, Thomas will correct me if I'm wrong. Or Henk will, if I misinterpreted him:-)   \n   \nCheers\n\n"
    },
    {
      "time": "10 Jan 2004 — 4:35pm",
      "content": "Sorry, Adobe Minion that I was a little bit late in responding.   \nI went to the mentioned site and I did read:   \nEditable fonts permission   \nFonts with an Editable Embedding permission can be embedded in electronic documents, and the embedded font can then be used by the recipient of the electronic document to view, print and further edit or modify the text and structure of the document in which it is embedded. These changes or edits can then be saved in the original document. Only fonts with an Editable Embedding permission may be embedded in an Acrobat Forms file for use by the forms recipient to fill in that document.   \nIf I read it correctly and interpret it correctly it states that in PDF Forms (alone) you may embed and edit these Editable fonts. Why would Adobe mention Forms if it would be applicable to all kinds of PDF\n\n"
    },
    {
      "time": "11 Jan 2004 — 5:03am",
      "content": "Correction!   \n   \nSorry, but I forgot just the word \"not\"!   \n   \nI wrote in my previous post: \"If I do read some Enfocus documentation based on Acrobat 6.0 they   \nstate that Editing is not allowed if the font is not resident on the   \nsystem. They even mention that the purchase of\n\n"
    },
    {
      "time": "11 Jan 2004 — 10:17am",
      "content": "It is important to understand the distinction between what it technically possible with current tools, and what the Editable embedding flag suggests.   \n   \nCurrent tools don't (generally) allow editing with embedded fonts. However, if the embedding flag is set to Editable, it would be reasonable for such tools to use the embedded fonts for editing. Users should expect that future tools might start doing this. Until recently, there haven't been many fonts set to \"Editable,\" but this has changed.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "11 Jan 2004 — 6:01pm",
      "content": "Hi Thomas,   \nthanks for the explanation.   \nI think my observations were right. You confirm that at this moment these tools (generally) don't allow editing.   \nIn your next sentence you mention that users should expect that future tools might do this with an \"editable flag font\". But these tools are not yet available.   \nSo it will be wise to invest in editable fonts even if these fonts would cost more money compared to \"Print & preview\" versions if you can give the guarantee that these embedded editable fonts could be used for (what Adobe calls) Full text editing capabilities?   \nRight now (in Acrobat 6.0) one needs installed fonts (editable or print & preview versions) to conduct those full editing tasks in print files, such as PDF/X-1:2001.   \nIf BSA controls the fonts they won't take care of embedded fonts but check only the installed ones. And these can (at this moment) only be the ones the \"editor\" legally owns.   \nIf you can guarantee that (future) availibility of those tools and the allowance to use them in Acrobat 6.0 it would mean that investing in an additional fee for the editable-flag versions of a typeface is not a waste of money.   \nAnd the proud owner who paid more for the editable version of a font just has to wait a while.   \n   \nSome EULA conditions (this tread by the way!) describe that the rights to edit at the recipients side could be delivered by just a legal document. They would not deliver the editable flag version fonts (or replace them) but just deliver the legal allowance additional to the print & preview font.   \nThat would mean that one still has to transport those fonts without the editable flag from the creator the the processor. Because the processor has to use those installed (print & preview) fonts.   \nThere is however no \"proof of purchase\" in such a case to show the legal rights.   \n   \nCould you give some more info on those future tools wich might do what you describe?   \nregards, Henk\n\n"
    },
    {
      "time": "11 Jan 2004 — 9:38pm",
      "content": "Well, I'd say that if you think you would want such capabilities if they were available, you should buy fonts that permit it, both in terms of the embedding settings and the EULA.   \n   \nWhat a user is legally allowed to do is dependent on the EULA. The embedding settings are a separate issue, creating a maximum ceiling on what other software ought to let one do with a font.   \n   \nI can't really comment on the capabilities of future PDF editing tools, whether from Adobe or third parties. I was simply observing that it was reasonable to guess that such tools will become more capable, and will tend to respect the embedding settings of fonts.   \n   \nI'll also note that Adobe for one does not charge more for fonts that are set to \"editable embedding.\" However, pricing is a matter for each type foundry to decide.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "6 Apr 2004 — 10:58am",
      "content": "Wow, the EULA topic showed up in another thread and I thought I was going to start a thread but it looks like it's already going at it big time!   \n   \nI was wondering if someone modifies a font to design a logotype (tweaking for optical balance or maybe adding a special element) would it be considered infringing against the licenses in most cases? What is normally standard?\n\n"
    },
    {
      "time": "6 Apr 2004 — 12:42pm",
      "content": "I'll just add that this is definitely an area where there is no common or standard license.   \n   \nIt's also worth noting that licenses change over time. For example, some large foundries that used to permit modifications for your internal use, have stopped doing so in recent years. I suspect you are bound by the license you agreed to at the time of purchase, regardless of what the current license says (though I'm not a lawyer, and this is really a legal question).   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": "6 Apr 2004 — 1:43pm",
      "content": "Actually I was just asking in a general manner.   \n   \nThough I did modify a font for another purpose (school project). It's Courier New (the one that comes with Windows) and I made the apostrophe and comma lighter. What would this imply legally?\n\n"
    },
    {
      "time": "6 Apr 2004 — 2:52pm",
      "content": "_If I understand Emilie's question, she's asking about making a logotype, not a font for redistribution. Right? Then this is a non-issue. Hack away and more power to you!_   \n   \nThis actually depends on how you make the logotype. If you use the font in e.g. Illustrator, convert to outlines and then edit those outlines or even import them into a font editing program, you are not contravening any EULA that I know of. But if you open the font itself in a font editing program then you need to be more aware of the EULA terms re. decompilation and modification. 'Courier New', if obtained as part of the Windows OS, is a system component covered by exactly the same EULA as all the other software that makes up the OS.   \n   \nWhen we talk about whether font EULAs should be standardised, we should be clear that we are referring specifically to retail font licenses. There is a whole world of font development and distribution that has nothing to do with the retail market, and for which the typical terms of retail license agreements do not apply. If a font is developed as a component of an operating system or other software package, I don't think we should assume that we can treat it the same way as a font that is developed and sold as a product in itself.\n\n"
    }
  ]
}
