{
  "id": "21294",
  "title": "modifying individual letterforms vs modifying fonts",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "G'day,\n\nI know this has probably been broached before (if this is the case can someone brusquely tell me where to find it?) but is it ok by copyright to use illustrator to modify individual letterforms for use in, say, a poster? I realize that you normally need to get permission before altering the software of a font, but I wondered whether this extends to the individual letterforms which can be turned into vector data  \nthanks again, sorry if it's old ground\n\nNick\n\n",
  "author": "nicholasgross",
  "time": "14 Jul 2006 — 5:19pm",
  "uid": "9500",
  "comments": [
    {
      "time": "14 Jul 2006 — 5:41pm",
      "content": "The main objections to derivative fonts is the dilution of ownership rights that such fonts may contribute to. In general I think most type designers and foundries would find it acceptable to modify a character or set of characters in Illustrator, that's how most logos get made after all.\n\nThe practice is so common I doubt many EULAs even talk about it. But having said that some EULAs are tricky and the best advice would be to check.\n\n"
    },
    {
      "time": "14 Jul 2006 — 9:40pm",
      "content": "Hi Nick\n\nWhat you're talking about here is pretty much accepted practice throughout the industry; as Simon says it's common enough to do this in corporate logoland. Good to hear that you're not settling for some 'off the shelf' approach to your poster...\n\n"
    },
    {
      "time": "16 Jul 2006 — 2:26pm",
      "content": "Modifying a letterform (or even several letterforms) that has been converted to outlines is **not** modifying the font. If anyone has a EULA that prohibits this very common practice, he/she/they ought to give some serious consideration to changing that EULA to conform to real-world practice.\n\nAfter following several threads in this forum, I changed my EULA to allow modification of my fonts for personal/corporate use: as long as the end product is not resold or redistributed, the end user ought to have the option of making changes that make the product work best for them.\n\n"
    },
    {
      "time": "16 Jul 2006 — 3:15pm",
      "content": "\\> I changed my EULA to allow modification of my fonts\n\nWhat kind of modification?\n\n"
    },
    {
      "time": "16 Jul 2006 — 3:28pm",
      "content": "Nick, good for you. It is nice to hear that type designers are listening to users. In fact, several foundries have come round to doing this. Sadly, I don't know that it will ever be the norm.\n\nI like your use of the phrase \"real-world practice.\" The PDF is how the \"real-world\" shares files now, and yet many foundries still prohibit this in some way.\n\nNicholas, which foundry's fonts are you considering to use in the way you describe?\n\n"
    },
    {
      "time": "16 Jul 2006 — 3:37pm",
      "content": "\\> In fact, several foundries have come round to doing this. Sadly, I don’t know that it will ever be the norm.\n\nwho's the good/\"bad\"?\n\nWhat is the best EULA that you're looking for (as a graphic designer)?\n\n"
    },
    {
      "time": "16 Jul 2006 — 7:23pm",
      "content": "Gee, thanks for all the feedback, I'm thinking of modifying rockwell (my options are limited and I think it's a good font for what it is ;) ) by making individual letters 3-dimensional using the illustrator effect; (glamourous I know) but more generally I would like to modify type by distressing it/adding swashes and ligatures and just generally integrating the type more into my designs  \nthanks again\n\n"
    },
    {
      "time": "16 Jul 2006 — 8:24pm",
      "content": "\\>What is the best EULA that you’re looking for (as a graphic designer)?\n\nProbably some kind of freeware - you can modify the font and sell the results. ;-) Unfortunately and unsurprisingly the best EULA terms don't often sync up with the best fonts.\n\n"
    },
    {
      "time": "16 Jul 2006 — 11:51pm",
      "content": "\\> Probably some kind of freeware - you can modify the font and sell the results. ;-)\n\nThat's OK with MS? :)\n\n"
    },
    {
      "time": "17 Jul 2006 — 6:41am",
      "content": "I'll check...\n\n"
    },
    {
      "time": "17 Jul 2006 — 6:41am",
      "content": "Sorry, our license doesn't allow this.\n\n"
    },
    {
      "time": "17 Jul 2006 — 6:41am",
      "content": ":-)\n\n"
    },
    {
      "time": "17 Jul 2006 — 1:46pm",
      "content": "_What kind of modification?_\n\nAs long as the result is not resold or redistributed, whatever modification the user feels necessary/helpful, including but not limited to, custom kerning, adding ligatures or modifying individual letterforms.\n\n"
    }
  ]
}
