{
  "id": "21298",
  "title": "Poll: Best font for on-screen reading?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I asked this question as a [test poll](http://web.archive.org/web/20111209213234/http:/www.grupthink.com/poll/1531) at the pretty slick new site Grupthink.com. Log in and submit your vote if you have a moment.\n\nThis is only a test for amusement. No need to take it too seriously. This is not scientific, nor will the results be published anywhere but on that page.\n\n",
  "author": "<a href=\"/web/20111209213234/http://typophile.com/user/103\" title=\"View user profile.\">Stephen Coles</a>",
  "time": "<br>",
  "uid": "103",
  "comments": [
    {
      "time": "",
      "content": "Not sure what the purpose of your posting is, but since I am a new member and this is my first posting, I will make something out of it:  \nAs a screenfont I prefer Verdana / Tahoma / Arial, in that order. The only problem with Verdana is, that it is rather wide.  \nOn websites that need a serif (maybe for a classy, old, luxureous look n feel) I prefer Georgia.\n\n"
    },
    {
      "time": "",
      "content": "I've actually come to appreciate pixel fonts for web material.\n\n"
    },
    {
      "time": "",
      "content": "I think it somewhat depends on the rendering. From what I recall, Verdana was designed to be a screen-friendly font, back before anti-aliasing became more prevalent. However, now that most operating systems support some form of anti-aliasing technology, many more fonts can be \"screen-friendly\" without necessarily being designed for the screen. With anti-aliasing in play, Verdana still looks good--but not a whole lot better than [insert font here].\n\nFor me, the best sans-serif is a tie between Verdana and Lucida; the best serif is Georgia.\n\nIMO, when printed on paper, Georgia still looks nice... but Verdana looks awful, especially at larger sizes.\n\n"
    },
    {
      "time": "",
      "content": "Survey format looks great - a few nit picks (maybe)...\n\nLucida - I wouldn't say that it was \\*for\\* Adobe, or Apple or MS, these companies (Adobe included?) just licensed the font.\n\nIf Tom gets credit for Nina he should also for Verdana, Georgia and Tahoma.\n\nArial, for IBM originally, no?\n\n"
    },
    {
      "time": "",
      "content": "Oh you're right, Si! I was sloppy. Wish I could fix the answers, but no. Didn't know about the Arial for IBM.\n\n"
    },
    {
      "time": "",
      "content": "I'm using ITC Officina Sans, the hand-hinted multilingual TrueType version produced by ParaType\\*. Works splendidly in all major rasterizers (Windows standard, ClearType, Mac OS X).\n\n\\*) [http://www.paratype.com/pstore/default.asp?fcode=PT\\_OSN](http://web.archive.org/web/20111209213234/http:/www.paratype.com/pstore/default.asp?fcode=PT_OSN \"http://www.paratype.com/pstore/default.asp?fcode=PT\\_OSN\")\n\nA.\n\n"
    },
    {
      "time": "",
      "content": "ITA with elzosmid's choices.\n\n"
    },
    {
      "time": "",
      "content": "Okay, which one of you clowns voted for Comic Sans?\n\n:)\n\n"
    },
    {
      "time": "",
      "content": "Hi guys:\n\nLucida is the only (interface) sans good for print and screen. Verdana and Tahoma are very ugly in print but highly readable on screen (the best). Helvetica is nice for print and o-kay screen but for interfaces???? Georgia is lovely on screen and print- if they made a PRO version with small caps I would snatch it up!!!\n\nWith Vista just on the horizon... there is going to be even more choices than ever... I'm loving these new fonts- I hope us mac folks can get these preinstalled with leopard too.\n\n[http://www.ascendercorp.com/WPF\\_fonts.html](http://web.archive.org/web/20111209213234/http:/www.ascendercorp.com/WPF_fonts.html \"http://www.ascendercorp.com/WPF\\_fonts.html\")\n\nBTW... comic sans looks excellent on screen at smaller sizes- apatures are nice and open- very readable!\n\ntwardoch\\> Where did you find the information officina sans being hand-hinted?\n\nMikey\n\n"
    }
  ]
}
