{
  "id": "213",
  "title": "Create a new Font Lab GUI!",
  "forum": "Build",
  "tags": [

  ],
  "content": "For those of you who have read my posts over the past few days and weeks, it's obvious to see my concern and frustration with the current state of font development software. I want an application that does technically what Font Lab can do but I want it to work like Fontographer.   \n   \nSo, let's redesign the Font Lab GUI and submit them to Yuri for potential integration!   \n   \nThere is no question that our cumulative talents lie in design, not programming and since this is a design problem, not a technical one, we are the only folks who can affect change at a larger level with regard to this problem.   \n   \nI think a picture is worth a thousand words and will speak volumes to the Font Lab development team to know that this is a genuine concern for many of us on the boards designing type in our daily professional lives and it must be addressed.   \n   \nHere's what I propose . . . .   \n   \nLet's start with the current version of Font Lab - For those of you who don't own a copy, download the demo and work from that.   \n   \nThen from those elements, modify the GUI to something you'd like to see it become. Complete with shortcut buttons, icons, whatever you feel will get the point across and post it here as a gif for us to see and critique.   \n   \nWe'll critique the GUI's as we do typefaces and modify it accordingly till we arrive at a collaboratively designed GUI we all feel we'd like Font Lab to become or include in its options and present it to Yuri to integrate.   \n   \nIf you think of it, without direction, Font Lab may never create a GUI that we feel is adequate for our purposes especially since they come from a programming background instead of a design background and all wish lists aside, we need to start from the current foundation of what we know Font Lab has in it now.   \n   \nLet the posting begin!   \nStuart :D\n\n",
  "author": "Diner",
  "time": "21 May, 2003 - 9:39pm",
  "uid": "1226",
  "comments": [
    {
      "time": " 21 May, 2003 - 11:53pm",
      "content": "I'm all for providing Yuri & Co. with feedback on interface and usability issues, but to propose a complete overall of FontLab seems to be asking too much at this point. I can only speak for myself, but I will say:   \n   \nI was a die-hard Fog4 user for ages. Bought FL3 to get into TT deltas and never used it much. Finally got FL4.5 the moment it came out, and have never looked back.   \n   \nEven coming from the programming side of things, the FontLab people have done an exceptional job of making things brilliant and easy. Many forehead-slapping moments of \"How could I have ever lived without this?\" Other things were confusing to me at first, but now I'm glad they're there. Sure, it needs some polish, but that will come.   \n   \nI would be curious to see what people come up with as their own ideas of how FL could evolve, but even as a paying customer, I feel more like thanking them profusely than demanding GUI adjustments to make the interface \"adequate\", which I feel it far overshoots. Suggestions about interface and workflow might be best posted on the FontLab user forum ( [http://groups.msn.com/FontLab](http://web.archive.org/web/20051126215557/http:/groups.msn.com/FontLab)).   \n   \nJust my opinion! ![:-)](http://web.archive.org/web/20051126215557im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nNow, as for improving Fontographer, that's another story ...   \n   \n ![Fontographer 5 Preferences](http://web.archive.org/web/20051126215557im_/http:/www.typophile.com/forums/messages/4101/11056.jpg)\n\n"
    },
    {
      "time": " 22 May, 2003 - 12:06pm",
      "content": "Hee, hee. I like it.   \n   \nSometimes, I think what would be good is if somebody could create a modern font editor that would use all our favorite elements from old FOG, adding a few new ideas to make it even better. BUT, leave out all the production-oriented stuff (hinting, advanced encoding, etc.). Instead, focus on the design and drawing stage (and maybe spacing and kerning). It would save the fonts in some standard format which could be brought into FontLab for finishing.   \n   \nAs it is, this is how many people are using FOG now. So basically, it would be a stripped down FOG which would run on modern OS's. An alternative to FL's inscrutible (at least for some people) tools.   \n   \nOn the other hand, don't you think that the difficulty inherent in font creation tools tends to filter out all but the most determined souls? If it was much easier, anyone could do it, there would be untold numbers of fonts available--people could even give them away!--and we would all be put out of business (he says only half seriously...).\n\n"
    },
    {
      "time": " 22 May, 2003 - 12:39pm",
      "content": "That's what the $99 tool they created was for :D . . .   \n   \nI would be a hypocrite if I continued to complain about a lousy interface and not at least make some effort to re-design it myself or influence a GUI update to the application.   \n   \nWhile I agree with Alan that FL is to be praised for their efforts in getting the application this far, I do feel if they are serious about their financial success they would be inclined to make \"minor\" GUI enhancements to get a larger audience to purchase their product.   \n   \nAgain, I think Font Lab is 98% there already and to modify the GUI may be only a few days effort since so much of it has been already programmed.   \n   \nI'd even be inclined to fly to Russia and sit over their shoulders to direct the effort - BUT since they're coming to town for Typecon, I can do it form here :D   \n   \nI think if we're talking about modifying the editor, there could be a nice opportunity to have different \"modes\" that one could toggle through for different tasks ala Drawing, Spacing, Kerning, and Hinting as well as a more integrated Font Generation suite.   \n   \nI still think it'd be cool to have a quick method to add alternate glyphs to a font and a quick kern for those . . .   \n   \nStuart :D\n\n"
    }
  ]
}
