{
  "id": "21306",
  "title": "Hyphens; or a strange line break",
  "forum": "Design",
  "tags": [

  ],
  "content": "I have this sample from a friend who has asked me what exactly the hyphen-like character at the end of the first and fourth line is. Basically, it appears to be half of a pipe, and it extends from the baseline up to the full measure of the x-height. I tried to do some of my own research, and the only thing that came close was a Mongolian character, i have now forgotten exactly which one, that actually sits above the x-height and ascends to the full cap height. This obviously isn’t a match, and now, I am just curious myself as to what this break character is, and why it was used instead of the usual hyphen.\n\nThis sample, for those of you whom may be familiar, came from the following book:\n\n[Design with Type by Carl Dair](http://web.archive.org/web/20080328093619/http:/www.amazon.com/gp/product/0802065198/ref=pd_rvi_gw_2/102-0798949-3412132?%5Fencoding=UTF8&v=glance&n=283155)\n\n| Attachment | Size |\n| --- | --- |\n| [cdair.png](http://web.archive.org/web/20080328093619/http:/typophile.com/files/cdair.png) | 230.54 KB |\n\n [‹ TYPE BATTLE: Week 16 (10 July)](http://web.archive.org/web/20080328093619/http:/www.typophile.com/battle16 \"Go to previous forum topic\") [Yet another case of font abuse ›](http://web.archive.org/web/20080328093619/http:/www.typophile.com/node/21327 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080328093619/http://www.typophile.com/user/11282\" title=\"View user profile.\">track and kern</a>",
  "time": "<br>",
  "uid": "11282",
  "comments": [
    {
      "time": " 16.Jul.2006 5.53am",
      "content": "I’ve never seen this character, but i have an idea why the designer used it:\n\nPerhaps the character offers a smoother-set right edge when setting justified type. Since a hyphen is so small and thin, the right edge often looks a bit anemnic. This vertical bar adds “uniformity” to the column.\n\n"
    },
    {
      "time": " 16.Jul.2006 11.00am",
      "content": "I would tend to agree with Roy, but I must say I find it rather frustrating when authors of typographic texts take their own books as opportunities to push unconventional typographic treatments. Most readers coming to such books are looking for instruction, and view the books in question as a sort of gospel example. Setting up line breaks like this, however clever an application it might be, just confuses those seeking knowledge of the conventions and principles of typographic design.\n\nThat said, given the content of the brief passage included in the graphic, perhaps Dair was simply making a visual point, drawing attention to the alternate hyphen glyph as a way of showing the difference between what a conventional hyphen can do to the right margin, and what something more unusual might do. Does he mention optical margin alignment so that right-margin hyphens extend slightly beyond the text block, thereby creating a more consistent right edge?\n\nMy point is simply that despite the fact that such an alternate hyphen glyph might address a certain issue, it does much more to confuse the reader (as your query shows) and misguide the novice typographer (who is likely to think the glyph a dotless-i or simply a typo).\n\n"
    },
    {
      "time": " 16.Jul.2006 4.16pm",
      "content": "Well, this is all too surprising, as I thought for sure I would see a response today that would include a specific definition of the glyph. Funny how all we have now is some more confusion, a bunch of skeptics, and a hypothesis. Everything said here is valid, and it does make for a valid argument. I did find some more sources, however none of them defined the vertical en-dash, as what I found it to be referred to as, for line breaks. I think that this character is more important for languages that read top to bottom, such as chinese. The obscure reference that I came by suggested that one should chose a typeface with a vertical en-dash when setting a language with this orientation.\n\n"
    },
    {
      "time": " 17.Jul.2006 3.42am",
      "content": "Could it be an extreme example of a canted hyphen (5.1.4 in Bringhurst)?  \nTim\n\n"
    },
    {
      "time": " 17.Jul.2006 8.15pm",
      "content": "You know, i thought about this at first, but it isn’t canted at all, in my opinion; it is perpendicular to the baseline.\n\n"
    },
    {
      "time": " 18.Jul.2006 7.42am",
      "content": "That’s kind of what I meant when I said extreme. Ultimately it is a reader unfriendly device a gently canted hyphen partly outside (or fully) the measure would have been better if that was the effect he was trying to recommend.  \nTim\n\n"
    }
  ]
}
