{
  "id": "21330",
  "title": "Fried Baskerville",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Is it appropriate to mix John Baskerville's Baskerville and Isaac Moore's Fry's Baskerville on the same page? The conventional wisdom, I think, is that Fry's Baskerville is a sharper face, more appropriate for display sizes.\n\nIt's also interesting that there was a time when one could reinterpret a face, and both give credit to the inpiration while still taking credit (or blame) for the changes. I wish I could do that with a few fonts.\n\n",
  "author": "canderson",
  "time": "17 Jul 2006 — 1:49pm",
  "uid": "9913",
  "comments": [
    {
      "time": "17 Jul 2006 — 2:01pm",
      "content": "Doh! I was hoping this post would be related to some kind of olde recipe for an 18th century English breakfast cooked over a boiling pot of molten lead. Disappointed!\n\n"
    },
    {
      "time": "17 Jul 2006 — 2:39pm",
      "content": "Well, if were stuck on the topic of breakfast...I wonder if Mrs. Eaves ever made omlettes?\n\n"
    },
    {
      "time": "17 Jul 2006 — 2:47pm",
      "content": "If it looks right, go for it. In metal type, display and text sizes of the same font often differed substantially.\n\n"
    },
    {
      "time": "17 Jul 2006 — 6:35pm",
      "content": " ![](http://web.archive.org/web/20131017120221im_/http:/typophile.com/files/baskerville_3734.jpg)\n\nITC New Baskerville  \nFry's Baskerville (Bitstream)  \nUnidentified Baskerville\n\nFry's Baskerville really has a lot more \"character\". That is, it has characteristics that one can easily argue againt, if your goal is, say, legibility or consistancy. I kind of like it though. I wonder what size the Bitstream version was taken from. Maybe it was inspired by one of the larger sizes.\n\n"
    },
    {
      "time": "17 Jul 2006 — 11:08pm",
      "content": "The date I have on Bitstream's Fry's Baskerville is 1990. A bit early for digital type foundries to consider reproducing from sizes larger than 10- to 12-pt.\n\nThat heavy weighted cap to lower case weight and the reduced x-height though is far more technically traditional than the others shown.\n\nGerald  \n [http://BielerPress.blogspot.com](http://web.archive.org/web/20131017120221/http:/bielerpress.blogspot.com/ \"http://BielerPress.blogspot.com\")\n\n"
    },
    {
      "time": "18 Jul 2006 — 5:37am",
      "content": "In response to speculation on the origin of Fry's Baskerville, here's an bit from <cite>An Atlas of Typeforms</cite> (James Sutton and Alan Bartram):\n\n\"Fry's Baskerville is much later in feeling than the original, and has more in common with Bell or Scotch Roman than with Baskerville. This \"improved\" version was cut by Isaac Moore for Dr. Fry in 1769, and reproduced by Stephenson and Blake in 1913.\"\n\n"
    },
    {
      "time": "5 Aug 2006 — 4:26pm",
      "content": "Use Monotype Baskerville for text. It's a little light, but generally faithful to the original.\n\nIf you try to use Fry's Baskerville at text sizes, you will not be happy. The hairlines are too thin to hold -- think Linotype Didot. Unreadable. It looks great at large sizes, especially if you tighten the letterspacing and tweak the kerning.\n\nAs an alternative to Baskerville for text, try Utopia. It looks really good in a range of sizes.\n\n"
    },
    {
      "time": "5 Aug 2006 — 5:06pm",
      "content": " ![](http://web.archive.org/web/20131017120221im_/http:/typophile.com/files/BaskervilleBEsample_5112.gif)\n\nThis is a sample of Berthold's \"BE\" version of Baskerville Adobe bundled in with some of their applications in the early 1990s. It has a more slab-serif feel to it. I think the bold weight is an attractive alternative to Clarendon.\n\n"
    },
    {
      "time": "5 Aug 2006 — 6:14pm",
      "content": "So wait, what cooking oil does one use for dog meat?\n\n--\n\nWell, metal versions of Fry's (such as ATF's) had optical scaling,  \nso they worked fine. But to me Fry's is in fact different enough  \nthat it's a shame it's called Baskerville. You have to remember  \nthough that it was a clone, intended to cannibalize on the sales  \nof the original. Except both actually fared poorly on the market  \nat the time! It was the French who ended up saving it.\n\nBTW, Berthold later replaced that cut of Baskerville  \nwith a much better one, done by GGL. Many people  \nthink it's the best (digital) version out there.\n\nLastly, don't forget Fountain's Baskerville.  \nIt does happen to have the best \"g\" for one.\n\nhhp\n\n"
    }
  ]
}
