{
  "id": "21345",
  "title": "English translation for german \"Auszeichnung\"?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm looking for the english translation for the german term \"Auszeichnung\". This is a general term denominating any optical deviation from the main text (which might be typeset in \"regular\"), hence \"Auszeichnung\" can be e.g. bold, italics, small caps, etc. Thanks a lot.\n\n",
  "author": "tina",
  "time": "18 Jul 2006 — 3:52am",
  "uid": "4754",
  "comments": [
    {
      "time": "18 Jul 2006 — 4:22am",
      "content": "Oh, I'm looking for a translation for this, too. Specifically fro the phrase \"Text mit Auszeichnung\"\n\nText with accent isn't right, because typefaces have accents in them as well. I don't like highlight either. Does anyone have any ideas?\n\n"
    },
    {
      "time": "18 Jul 2006 — 4:52am",
      "content": "Some possibilities: 'accentuated text' 'emphasized text'\n\n"
    },
    {
      "time": "18 Jul 2006 — 5:02am",
      "content": "Hi Tina\n\nHmmm. Commonsense tells me the terms 'variation', 'stress' or 'emphasis' might work, because that's the syntactical function of the bold, italics, small caps, etc. that you mention.\n\nWeirdly, the online translation engine Babelfish translates this term as 'honour' (or 'honor' for some of us); which would point to Auszeichnung having a meaning within typographic hierarchy, like an 'elevated position', which in turn could translate as 'heading' or subheading'. But maybe Auszeichnung also applies to elements lower in the hierarchy, like footnotes and references?\n\nI'm sure it'll only be minutes before a fluently bilingual typesetter offers a far better and more exacting translation, but I thought I'd have a go...\n\n"
    },
    {
      "time": "18 Jul 2006 — 5:05am",
      "content": "Auszeichnung means an honor or distinction. But typographically it refers to small accentuation… when you have a line of type set in regular, and one word is bold, that bold word is the \"Auszeichnung\" here. The question is, what do you call that in English… and I'm looking not just a translation of the word, but an example of how the word fits into a sentence.\n\n"
    },
    {
      "time": "18 Jul 2006 — 5:16am",
      "content": "How about the prominent word since it is given prominence in the sentence?\n\nChrisL\n\n"
    },
    {
      "time": "18 Jul 2006 — 5:17am",
      "content": "\"The prominent word was set in italics\"\n\nChrisL\n\n"
    },
    {
      "time": "18 Jul 2006 — 5:20am",
      "content": "‘emphasized text’ sounds good to me.\n\n"
    },
    {
      "time": "18 Jul 2006 — 5:27am",
      "content": "The underlying problem is, that \"Auszeichnung\" can be a colloquial expression (honor, distinction) as well as a technical term (outstanding in a typo-technical context).\n\nFootnotes and references may contain \"Auszeichnungen\" (i.e. whatever accentuation), but Auszeichnungen are more \"character styles\" than \"paragraph styles\" (to say it in indesignish, but these expressions would be too software-bound for a general text ...)\n\n\"Accentuation\" sounds fine to me at the moment, but being no native english speaker, I don't know if that's ok or if there's another special expression?\n\n"
    },
    {
      "time": "18 Jul 2006 — 5:32am",
      "content": " **Accentuated text** maybe, but definitely not **accented text** , which would be something else.\n\n"
    },
    {
      "time": "18 Jul 2006 — 5:34am",
      "content": "wow, you're all fast :-)\n\nDan, could you possibly tell some more context around \"Text mit Auszeichnung\"? At the moment it's still kind of ambiguous.\n\nOur text here is quite abstract, like: \"... choice of the appropriate \"Auszeichnungen\" for a given text\"\n\n"
    },
    {
      "time": "18 Jul 2006 — 6:22am",
      "content": "I don't have any more info. My question doesn't relate to a text of my own. It is just a label for a type specimen that a friend of mine is translating. If there were more text in the sentence, the translation would have been a bit easier, I think\n\n"
    },
    {
      "time": "18 Jul 2006 — 6:23am",
      "content": "_Our text here is quite abstract, like: “… choice of the appropriate “Auszeichnungen” for a given text”_\n\nthe appropriate level of emphasis for a given text?\n\n"
    },
    {
      "time": "18 Jul 2006 — 6:42am",
      "content": "\\>… choice of the appropriate “Auszeichnungen” for a given text\n\nChoice of appropriate \\*visual marker\\* for a given text.\n\nSometimes in translation a phrase in the translated language is better than a single word. And the best phrase may change with context...\n\n"
    },
    {
      "time": "18 Jul 2006 — 8:48am",
      "content": "Styled text?\n\n"
    },
    {
      "time": "18 Jul 2006 — 10:14am",
      "content": "Dan wrote:\n\n<cite>Auszeichnung means an honor or distinction.</cite>\n\nIn the English version of a Tschichold text on the subject -- 'Italics, Small Capitals and Quotation Marks in Books and Scientific Publications' in <cite>The Form of the Book</cite>, Lund Humphries, p.110 -- the word 'differentiation' is used, e.g.:\n\n<cite>The beginning of a typographical differentiation goes back to the Baroque. Here, we find italic used within roman text as a means of differentiation.</cite>\n\n<cite>[...] text will benefit and become more lucid and comprehensive if some manner of type differentiation is applied.</cite>\n\nBut maybe '(typographic) distinction'/'distinguished' is the better choice? 'Distinction' seems to denote both (mere) differentiation and, in addition, the aspect of 'being destinguished'. Which is not too far away from 'Auszeichnung'.\n\n"
    },
    {
      "time": "18 Jul 2006 — 10:28am",
      "content": "It's actually quite simple: a person can _sich auszeichnen_ (the verb) in something, i.e. excel in something, be outstanding.\n\nIn typography, a text can be _ausgezeichnet_ (the adjective), which simply means it stands out from the rest of the text. In that sense, _Auszeichnung_ could be translated as distinction, or differentation. To preserve the ambiguity in \"Text mit Auszeichnung\", one could translate \"Text with distinction\". \"Choice of the appropriate _Auszeichnungen_ for a given text\" could become \"Choice of the appropriate differentations/distinguishing features\".\n\nThe chapter devoted to _auszeichnen_ in the German typography bible [Lesetypografie](http://web.archive.org/web/20131106075331/http:/www.typografie.de/verlagsverzeichnis/typografie/652-5.html) (pp. 120–173) not only considers distinguishing one or two words from the main text, indeed, through italics, bold, small caps, or a different typeface altogether (\"character styles\" in InDesignish), but also of whole blocks of text (e.g., block citations), for instance through another font size, indentation, change of colour (\"paragraph styles\") &c.\n\n_Note: I started typing the reply, went away, came back and posted – only then I read k.l.'s reply._\n\n"
    },
    {
      "time": "18 Jul 2006 — 10:31am",
      "content": "I have to go with \"differentiation\" in the contexts mentioned, too--especially bearing in mind that the best English translation of _ausgezeichnet_--the adjective with the same roots, \"to draw out\"--is \"outstanding.\"\n\n\"Differentiation\" is a bit Latinate for the William Strunk and George Orwell fan in me, but it probably reads better than \"making stand out\" in most cases.\n\n"
    },
    {
      "time": "18 Jul 2006 — 11:28am",
      "content": "Indeed, \"Auszeichnung\" in general sense means \"honors\" and \"ausgezeichnet\" means \"excellent\". But the typographic meaning has its own peculiarity.\n\nThese days, \"Auszeichnung\" in German typography is used in two meanings: \"emphasis\" or \"styling\". The latter translation gives a better sense of the practical use of the term. \"Auszeichnung\" in German typography does not really mean visual \\*emphasis\\* as in using bold, but all sorts of deviation from the regular. Therefore, I'd use the term \"styling\", as in \"styled text\", \"use various forms of styling\", \"applying styling to the text\". If you're confident that the intended meaning is about really adding emphasis to the text, use \"emphasis\".\n\n"
    },
    {
      "time": "18 Jul 2006 — 2:37pm",
      "content": "Thanks a lot for all your thoughts and the rich variety of suggestions for different contexts -- translations are really very tricky.\n\n"
    },
    {
      "time": "18 Jul 2006 — 9:38pm",
      "content": "Just as a point of reference from my copy of _Polygraph Wörtenbuch für die Druckindustrie/Polygraph Dictionary of the Graphic Arts -- Polygraph Verlag_, 4th Edition German-English/English-German, 1987:\n\n- **Auszeichnen** _f_ to accentuate, to display  \n &nbsp; &nbsp; **_mit Halbfetter_** -- to accentuate with bold;  \n &nbsp; &nbsp; **_mit Kapitälchen_** -- to accentuate with small caps;  \n &nbsp; &nbsp; **_mit Kursiv_** -- to accentuate with italic  \n- **Auszeichnung** _f (Schrift)_ display setting  \n- **Auszeichnungsshrift** _f_ display characters _pl_ display type  \n- **Auszeichnungszeile** _f_ display line\n\n_(Edit-a-bit) -- found more definitions related to accentuation:_\n\n- **Akzentbuchstabe** _m_ accented letter  \n- **akzentuieren** to accentuate  \n- **Akzentuierung** _f_ accentuation\n\n"
    },
    {
      "time": "19 Jul 2006 — 5:50am",
      "content": "Coming back to Hans Peter Willberg's \"Lesetypografie\":\n\nHe uses the term \"integrierte Auszeichnung\" (integrated) for italics and small caps as opposed to \"aktivierende Auszeichnung\" (activating) for bold or all caps. This is a very sensible distinction to me and helps beginners understand that pressing the bold button or the italics button is not a random choice.\n\nAny suggestions for an English adaptation?\n\n"
    },
    {
      "time": "19 Jul 2006 — 7:01am",
      "content": "Within(out)-weight accentuation would cover italic and bold but not the caps.  \nTim\n\n"
    },
    {
      "time": "19 Jul 2006 — 5:30pm",
      "content": "\"Aktivierende Auszeichnung\" could be called \"emphasis styling\" while \"integrierte Auszeichnung\" could be called \"distinction styling\".\n\n"
    },
    {
      "time": "20 Jul 2006 — 9:15am",
      "content": "\\> “aktivierende Auszeichnung” (activating) for bold or all caps.\n\nWillberg & Forssman use the term \"aktive\", not \"aktivierende\", _Auszeichnung_.\n\nTo me the only acceptable – and rather obvious – translation would be \"integrated\" and \"active\" _Auszeichnung_. The difference between the two lies in the fact that the reader notices _aktive Auszeichnungen_ at first sight of the page and _integrierte_ only when he reaches the spot in the text (i.e. the latter are more in line with the whole of the text, the former stand out more).\n\n"
    }
  ]
}
