{
  "id": "21350",
  "title": "Text \"color\" origins",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does anyone know how the term text \" [color](http://web.archive.org/web/20131019002519/http:/typophile.com/wiki/color),\" describing the relative grayness of text, came about ? My half-baked theory is that back in the seventeenth century and before, when the norm for text type was black ink on white paper, the term \"color\" was used as a metaphor because no one of any consequence would actually mistake text \"color” as being text hue.\n\n",
  "author": "dgc",
  "time": "18 Jul 2006 — 9:37am",
  "uid": "8494",
  "comments": [
    {
      "time": "18 Jul 2006 — 10:33am",
      "content": "Red has also played a large part since the beggining of printing.  \nSo I wouldnt think that would be the case.\n\n"
    },
    {
      "time": "18 Jul 2006 — 10:36am",
      "content": "I asked the same question and got insightful and interesting responses on this thread: [Why is it called 'color'?](http://web.archive.org/web/20131019002519/http:/typophile.com/node/15326)\n\n"
    },
    {
      "time": "18 Jul 2006 — 10:43am",
      "content": "An aside - on May 19th the US Senate voted to make English the national language of the USA. So soon 'color' and other common misspellings present in the American language will be a thing of the past.\n\n"
    },
    {
      "time": "19 Jul 2006 — 8:54am",
      "content": "The thread Norbert supplied was most helpful. Clearly this is an ongoing discussion.\n\n"
    },
    {
      "time": "19 Jul 2006 — 9:29am",
      "content": "\\>So soon ‘color’ and other common misspellings present in the American language will be a thing of the past.\n\nThe capricious American changes in the already capricious spelling of English took place, I believe, after the war of 1812 (between the US and England); and they were done mainly out of spite, I think.\n\nOf course being irrationality piled on top of irrationality they have lasted for nearly two centuries.\n\nSo you see how far being logical will move public policy :) or is that :(\n\n--Is there an 'I don't know whether to laugh or to cry' emoticon?\n\n"
    },
    {
      "time": "19 Jul 2006 — 12:46pm",
      "content": "Typographers and type designers try to avoid local contrasts in colour, \"hot spots\" that stand out from the general tone of the text (although an overall lack of colour can, conversely, be problematic). The reason for this aversion is partly aesthetic--one likes one's pasta _al dente_)--and partly functional, as obtrusive features tend to disrupt fluent reading.\n\nCOLOUR ISSUES  \n1. Hot-spots caused by poor global spacing. For instance, if the sidebearings on vertical strokes are too narrow, relative to those on curved verticals, then double-l etc. will create clots in text.  \n2. Hot spots caused by glyph shapes that fit awkwardly. The f ligatures address this. Double-g of the two-bowl kind is hard to avoid.  \n3. Hot spots caused by glyphs of abnormal weight. At the extreme, a bold condensed sans serif M or W tends to overpower other characters.  \n4. Hot spots caused by ink trapped in acute joints: even the tiniest overinking can exacerbate this, affecting glyphs like the said M and W disproportionately.  \n5. Entangled ascenders and descenders.  \n6. Rivers in justified text.  \n7. If the space character is too wide or too narrow, text will be too halted or too slurred.  \n8. Emphasis fonts that don't harmonize with the main style. For instance, a bold weight can look too extended, or an italic too fussy.  \n9. Lining figures (tabular, no doubt) to be replaced by old-style.  \n10. Excessive case disparity: this is why Goudy found Caslon wanting, \"...a spotty appearance, largely due to the strong contrast in color between the capitals and the lower-case...\" and designed Kennerley. So typographic colour is also an historical, cultural, and subjective quality.\n\nDenise, I'm afraid I don't know the source of the usage, but given the variety of factors affecting the quality of colour, from type design to layout specs to press gain to personal preference, I'd be inclined to agree with you that this somewhat perverse, broadly metaphorical term does seem appropriate, for what is really the distinctly typographic personality of massed text.\n\n"
    },
    {
      "time": "21 Jul 2006 — 5:19am",
      "content": "Nick,  \nThat was a very clear in-the-nutshell description and worthy of a good read by both students and old hands alike.\n\nThanks!\n\nChrisL\n\nPS: the \"Official\" language of the USA should be called Hodge-podge English for all the adopted and adapted speech influences we incorporate into our melting-pot language :-)\n\n"
    }
  ]
}
