{
  "id": "21361",
  "title": "Design help for my dads site (He's an author -- lots of text)",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,  \nWould someone mind throwing a few examples and suggestions of good web design that incoporate a lot of text. I’ve done a lot of minimal design but I’ve never quite gotten the hang of dealing with text for the web.\n\nHere is the site\n\n[http://www.gordonbasichis.com/index.html](http://web.archive.org/web/20080907004409/http:/www.gordonbasichis.com/index.html)\n\nI really appreciate it. I’m not much of designer these days but I really want to do a decent job for him.\n\nThanks,  \nCasey\n\n [‹ Beton opinions](http://web.archive.org/web/20080907004409/http:/www.typophile.com/node/21378 \"Go to previous forum topic\") [TYPE BATTLE: Week 16 (10 July) ›](http://web.archive.org/web/20080907004409/http:/www.typophile.com/battle16 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907004409/http://www.typophile.com/user/13903\" title=\"View user profile.\">estherrose</a>",
  "time": "<br>",
  "uid": "13903",
  "comments": [
    {
      "time": " 18.Jul.2006 3.47pm",
      "content": "[The Elements of Typographic Style Applied to Web](http://web.archive.org/web/20080907004409/http:/webtypography.net/)\n\n—————  \n**Paul Ducco**  \n [Solid Creative - Custom Typography, Melbourne](http://web.archive.org/web/20080907004409/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 18.Jul.2006 3.49pm",
      "content": "I’d look to text heavy, design-centric sites such as [designobserver.com](http://web.archive.org/web/20080907004409/http:/www.designobserver.com/) and [Speak Up](http://web.archive.org/web/20080907004409/http:/www.underconsideration.com/speakup/) for inspiration. The important thing is too have a clear hierarchy of information and present the text in web digestable bits that the user can navigate into and possibly provide a simple printable version if desired.\n\n"
    },
    {
      "time": " 18.Jul.2006 9.10pm",
      "content": "Thanks for the tips. I just recently bought the three type books reccomended on this site. I do wish there was a greater focus on the aesthetics of page layout though.\n\nIt occured to me that the latter two are designed with a greater concern for updatability and flexibility than for the sheer amount of text.\n\nAny good examples of sites with non generated layout, interesting design and ample text\n\nAlso. Long, long ago, when I did web dev professionally at a firm, they insisted that everything be comped in photoshop before going to code... for work like this do you all follow this rule? Should I be planning this out in something like indesign?\n\nThanks again!\n\n"
    },
    {
      "time": " 19.Jul.2006 5.40am",
      "content": "I would probably start with indesign in this case. First get all the text in there and then play around with the general layout. Make a couple of different layouts and compare them. after you are happy with the text layout you can get ps in there (or illustrator or flash..whatever you use) to add navigational items. But I think it’s most important to have a clear view of the plain text first before being distracted by images and things.  \ndav.\n\nNone are so hopelessly enslaved as those who falsely believe they are free.  \n-Goethe-\n\n"
    },
    {
      "time": " 19.Jul.2006 8.26am",
      "content": "I would look at these two sites, which happen to be blogs by designers:\n\n[http://www.subtraction.com/](http://web.archive.org/web/20080907004409/http:/www.subtraction.com/ \"http://www.subtraction.com/\")\n\n[http://www.markboulton.co.uk/journal](http://web.archive.org/web/20080907004409/http:/www.markboulton.co.uk/journal \"http://www.markboulton.co.uk/journal\")\n\nYou’ll see that they rely on strong grid systems in their layouts; this helps to manage any size/length of text that they post. Clean designs both, the text is the focal point with the “design” receding into a structural background.\n\n"
    }
  ]
}
