{
  "id": "21383",
  "title": "Combining Text Objects in Illustrator",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I'm working in Illustrator CS, trying to update the text in a huge pile of forms that were provided as EPS exports from Quark or from PDF files. The text of the forms is split up into many, many text objects instead of full lines or paragraphs that can be edited easily. It seems like any instances of custom kerning or spacing values are converted as the start of a new text object, so that the result is a series of aligning words or characters instead of a single, flowing line of text.\n\nDo you know of any utilities or Illustrator scripts that can combine multiple text objects into one? I've tracked down one so far (The \"Concat Text\" script at [http://rj-graffix.com/software/scripts.html](http://web.archive.org/web/20120625052748/http:/rj-graffix.com/software/scripts.html \"http://rj-graffix.com/software/scripts.html\")), but the results are a little unpredictable. I'd like to investigate some others for a comparison.\n\nIf you have any recommendations, that would be awfully helpful.\n\n",
  "author": "ultrasparky",
  "time": "19 Jul 2006 — 11:26am",
  "uid": "4356",
  "comments": [
    {
      "time": "19 Jul 2006 — 2:03pm",
      "content": "If/when you find the magic program, please let us all know. Even selecting all the text and pasting it into a simple text editor can have unpredictable results, because the \"stacking order\" of the various pieces of the text don't necessary follow a linear progression from start to finish.\n\nOne thing you might try for paragraph text is to save the EPS as a PDF file, open the PDF in Acrobat, use the \"Select Text\" to copy the paragraph, then paste the type into a new paragraph/area text box in Illustrator. You'll probably stand a better chance of keeping the word order this way.\n\n"
    },
    {
      "time": "19 Jul 2006 — 3:58pm",
      "content": "I've found -- although thankfully haven't had the need to do it in a while -- it is often easier to export the text from Quark as a TXT file and then reformat it in Illustrator.\n\n"
    },
    {
      "time": "19 Jul 2006 — 5:54pm",
      "content": "Ultrasparky,\n\nopen the PDF file in Acrobat, choose Advanced / Accessibility / Add Tags to Document.\n\nThis may help.\n\nA.\n\n"
    }
  ]
}
