{
  "id": "21387",
  "title": "Need Feedback on \"logo\"",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hey there.\n\nI am trying to define my own companies logo.\n\nHeller means “brighter” in the german language. Therefore i want to use a abstract “SUN”.\n\nThe letters are constructed. But something is wrong- especially with the “e” ‘s\n\nI cant figure it out.\n\nPlease check.  \nthanks.\n\nmarshimaro “heller”\n\n“According to your tips i changes some thing” Please check. thanks\n\n| Attachment | Size |\n| --- | --- |\n| [feedback2.jpg](http://web.archive.org/web/20081015141656/http:/typophile.com/files/feedback2.jpg) | 13.84 KB |\n| [feedback.jpg](http://web.archive.org/web/20081015141656/http:/typophile.com/files/feedback.jpg) | 58.13 KB |\n| [feedback5.jpg](http://web.archive.org/web/20081015141656/http:/typophile.com/files/feedback5.jpg) | 109.52 KB |\n| [feedback7.jpg](http://web.archive.org/web/20081015141656/http:/typophile.com/files/feedback7.jpg) | 68.15 KB |\n\n [‹ Confusing logo](http://web.archive.org/web/20081015141656/http:/www.typophile.com/node/20761 \"Go to previous forum topic\") [Manufacturing Firm ›](http://web.archive.org/web/20081015141656/http:/www.typophile.com/node/8881 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081015141656/http://www.typophile.com/user/13923\" title=\"View user profile.\">marshimaro</a>",
  "time": "<br>",
  "uid": "13923",
  "comments": [
    {
      "time": " 19.Jul.2006 1.20pm",
      "content": "The horizontals are too thick.\n\n(Edit-a-bit: the horizontals of the e’s. Maybe excluding the middle one. :^)\n\n"
    },
    {
      "time": " 19.Jul.2006 1.30pm",
      "content": "I think “l” should be thicker. I think the radius of the corners is too large. The left side of the “e” looks too thick. The counters in the “e” look too small.\n\n"
    },
    {
      "time": " 19.Jul.2006 1.36pm",
      "content": "Hi there: the star or the sun seems a little too small in relation to the size of the word heller.\n\nMikey\n\n"
    },
    {
      "time": " 19.Jul.2006 2.21pm",
      "content": "I completely agree with SuperUltraFabulous that the sun graphic should be larger. Right now it looks like an asterisk, which (at least in America, I don’t know about elsewhere) means that there’s a footnote attached, which may not be the best message you want to send with your logo.\n\nAs far as the type goes, I would recommend that you use a typeface that already exists instead of trying to create your own. There are fonts out there made by designers taking into account minute details that you or I would never even catch. It’d be easier but more importantly you’d definitely end up with a better and more professional looking logo.\n\n"
    },
    {
      "time": " 20.Jul.2006 12.24am",
      "content": "Thanks for your comments. really interesting as i have no clue about type design.\n\nas far as ahellerax goes i should stop doing that and looking for a already fixed one.\n\nDoes any of you may know some fonttypes which are similar to my more or less desired appearance. ?\n\nThanks a lot.\n\n"
    },
    {
      "time": " 20.Jul.2006 1.39am",
      "content": "[House Gothic](http://web.archive.org/web/20081015141656/http:/houseind.com/index.php?page=showfont&id=15&subpage=viewfonts)\n\n"
    },
    {
      "time": " 20.Jul.2006 11.18pm",
      "content": "I actually like your constructed “font”. A couple of questions though:\n\n1. Why is the second ’e’ different from the first? The counter is much bigger in the second one, and I think it looks better. I agree that the horizontals (especially the bottom one) should be slightly thinner in the ’e’.\n\n2. What type of company is this? When I look at it, I think of power tools. Do you make cordless drills? If so keep the logo. Do you make fancy pastries? If so, dump the logo.\n\nThe size of the star/sun/asterix actually works for me. Try placing it in different positions (such as before “Heller”, as the counter of the ’e’s, &c.) and see what happens. I also like the rounded ’r’ better than the one with the 90 degree corner.\n\n- Lex\n\n"
    },
    {
      "time": " 21.Jul.2006 12.57am",
      "content": "Dear Lex,\n\nI like you :-)\n\nPlease check the changed files. I corrected the horizontals as well as the “l”‘s.\n\nthe company is a creative studio. [http://www.heller.tv](http://web.archive.org/web/20081015141656/http:/www.heller.tv/ \"http://www.heller.tv\") not much to see yet.  \nI am a architect and we are doing webstuff, 3d animations, art directoring etc...\n\nthanks for your eyes.\n\nmarcel\n\np.s i could not attach images to this reply. so i attached them to the forst post ?\n\n"
    },
    {
      "time": " 22.Jul.2006 4.31am",
      "content": "I think the problem with your e’s are that they are slightly too short, in the way that in a more conventional typeface the rounded characters are slightly taller than the squarer characters to visually compensate for their shape so that in a line of type they appear to be of the same height. Try slightly increasing the height of the e’s (or reducing the height of the r and the lower part of the h) until they appear to be of equal height. I like the shape and position of the sun/cog/asterix (partly _because_ it is ambiguous and has that missing footnote feeling), although you might have to enlarge it or reduce its points for some uses.  \nTim\n\nYou need Flash to upload an image into a reply there are guidleines at the top of the general Discussions forum.\n\n"
    },
    {
      "time": " 26.Jul.2006 1.46am",
      "content": " ![](http://web.archive.org/web/20081015141656im_/http:/www.typophile.com/files/Heller_Varianten_%C3%9Cbersichtb_5272.jpg)\n\nThanks for the comments on the “e”. I will work on that.\n\nI also changed the proportion between the vertical and the horizontal in the “e”. /sorry i dont know the ecaxt words...\n\nThe second image shows a more condensed option of the e.\n\nWhat do you think, ?\n\n ![](http://web.archive.org/web/20081015141656im_/http:/www.typophile.com/files/Heller_Varianten_%C3%9Cbersichtd_4859.jpg)\n\n"
    },
    {
      "time": " 26.Jul.2006 2.02am",
      "content": "I now changed the position of the e and pushed it slightly down.\n\n ![](http://web.archive.org/web/20081015141656im_/http:/www.typophile.com/files/Heller_Varianten_%C3%9Cbersichtf_5070.jpg)\n\n"
    },
    {
      "time": " 26.Jul.2006 6.53am",
      "content": "I meant that the e’s should actually be taller than the x-height, the overshoot should take place at the bottom and top of the letters and only needs to be very slight. I think you can also reduce the open counter of the h horizontally which will improve the kerning of the logo as well.\n\nTim\n\n"
    },
    {
      "time": " 26.Jul.2006 9.13am",
      "content": "in my opinion the e’s are standing out too much and are scrambling the logo.. and i think the top bar of the e’s is thicker than the one of the h and r\n\nnice concept so far though\n\n"
    },
    {
      "time": " 26.Jul.2006 3.43pm",
      "content": "typography aside, what happens when you reproduce the logo at a realistic size?\n\n—————  \n**Paul Ducco**  \n [Solid Creative](http://web.archive.org/web/20081015141656/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 28.Jul.2006 4.01am",
      "content": "Thanks for your infos..\n\nI printed the logo in small sizes. Seems to be ok.  \nProblematic will be the Flash/webthing... I will check.  \nThanks for the hint Ratbaggy.\n\nI will put your suggestions into account.\n\ncheers marcel\n\nheller \\* | design studios\n\n ![](http://web.archive.org/web/20081015141656im_/http:/www.typophile.com/files/heller_everaendert__6000.jpg)\n\n"
    },
    {
      "time": " 28.Jul.2006 5.09am",
      "content": "The E’s are too tall now. Could it be sligthly lighter?\n\nIsn’t there a design company called Heller? Orange Helvetica in the logo?\n\n_Edit-a-bit: Found it. [http://www.helleronline.com/](http://web.archive.org/web/20081015141656/http:/www.helleronline.com/ \"http://www.helleronline.com/\")  \nThere are quite a lot of companies called Heller, it seems._\n\n"
    },
    {
      "time": " 31.Jul.2006 12.07am",
      "content": "There are many out there.  \nAlso big and famous fish.  \nBut most of them aren‘t architecture/design orientated...\n\nthanks for the tips. i will put them inside...\n\nheller \\* | design studios\n\n"
    },
    {
      "time": " 1.Aug.2006 1.40am",
      "content": "Looking good Marshi.\n\nThe asteriks I’m still unsure about.\n\n—————  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20081015141656/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": " 3.Aug.2006 7.17am",
      "content": "I agree. I’m wondering if you’ve already explored other options for the asteriks...would like to see them. The current feels...may I say it, ’generic.’ How could you ’own’ this mark?\n\n"
    }
  ]
}
