{
  "id": "21402",
  "title": "Generation Font",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "My way to generate an Arabic font.  \n1. I had an Arabic font which included ALL Arabic glyphs from Unicode 4.1 and ready to generate it to produce TTF file to add Volt project.  \n2. I made an encoding file (.enc) which included all of my glyphs.  \n3. Sorted it depending on this .enc. (I arranged them depending on my encoding file.  \n4. Pressed on Codepages  \n5. Generated the font.  \n6. Go to Ms Volt to complete OpenType project.\n\nMy questions are:  \nI know that there are 4 ways to do generation in FontLab:  \n1. By arranging font depending on Names mode (By pressing on Names mode button then generating)  \n2. By arranging font depending on Unicode range (By pressing on Unicode range button then generating).  \n3. By arranging font depending on Codepage (By pressing on Codepage button then generating).  \n4. By arranging font depending on Index mode (By pressing on Index mode then generating).\n\n- Could you please tell me the difference between 4 ways and when we use them?  \n- Is my way correct or not? (I know that we can use any of four ways because Volt doesn’t consider the arrangement but looks on font glyphs names themselves, but I would like to know the correct way which was used by the professional typographic designers)  \n- What is the best way to produce ttf file?\n\nLooking for your soon response.\n\nThanks.\n\nPlease send a copy of your reply to [h\\_afash@yahoo.com](mailto:h_afash@yahoo.com)\n\n",
  "author": "H_Afash",
  "time": "20 Jul 2006 — 2:27pm",
  "uid": "13755",
  "comments": [
    {
      "time": "22 Jul 2006 — 2:50pm",
      "content": "Please, why don't anyone find the answers?  \nPlease help.\n\n"
    },
    {
      "time": "26 Jul 2006 — 12:28am",
      "content": "What you desribe are internal representations of the glyph set in FontLab. That is, the names, codepage, Unicode range or index options control how the glyph set is displayed in the FontLab font window. When making a TTF or OTF font, it doesn't matter which view you are in when you export the font.\n\nIn FontLab options, you should check that the setting is **not** to re-order glyphs when outputting the font. In this case, the generated font will have the same glyph order as shown in index mode (which will be the same as in names mode if you have sorted by .enc).\n\nVOLT works by both glyph names and order. You'll notice, for example, that groups in postioning lookups are listed by glyph order.\n\nPS. I recommend upgrading to FontLab Studio 5.0\n\n"
    },
    {
      "time": "30 Jul 2006 — 1:17pm",
      "content": "Thanks John,  \nI have FontLab 5.  \nAs you are an expert person in typography, could you please tell me your way when you generate the font? Because I want to use one way for one view to generate my fonts.\n\nPlease see attached file which was found in FL5. Is this the screen you talked about?\n\n ![](http://web.archive.org/web/20140725122556im_/http:/typophile.com/files/1_6288.png)\n\n"
    }
  ]
}
