{
  "id": "21449",
  "title": "Takashimaya Department Store logotype",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Dear All,\n\nPosted this a little while ago but there were no takers, so try again...\n\n ![](http://web.archive.org/web/20150301011229im_/http:/typophile.com/files/Takashimaya%20Sample_6125.jpg)\n\nThis is the logotype from one of the large department stores here in Japan, Takashimaya (I am always seeing this one as it is my wife's favourite department store here! This one from a bag of rye bread).\n\nI am curious to know whether it is a font or custom lettering?\n\nThanks,\n\nGrant\n\n",
  "author": "Grant Dunlop",
  "time": "25 Jul 2006 — 12:28am",
  "uid": "7446",
  "comments": [
    {
      "time": "25 Jul 2006 — 12:40am",
      "content": "[edited]\n\nI'm still sleeping obviously... :^P\n\n"
    },
    {
      "time": "25 Jul 2006 — 3:04am",
      "content": "This is a \\*great\\* logo.\n\nI don't think you will find this as a font unless commissioned by head office.  \nHere is info from \"Changes in logos and trademarks in Japan\":\n\nThe trademark with the Chinese character TAKA in a circle, the identical character when seen from the front or behind.\n\nversion of circle-mark shown from 1886\n\nThe mark registered in 1904. In 1968, the prototype of the mark was established to avoid distorted shapes by branches.\n\n"
    },
    {
      "time": "25 Jul 2006 — 4:08am",
      "content": "Thanks Userone for that info.\n\nIt is a great logo and the type works really well, I just wish they would use it more. Their website and other print materials use a lot of other display fonts none of which are as characteristic as the logo.\n\nWhenever I saw the logo and type it reminded me of Alex Scholing's 'Engine' & 'Roice' fonts for FontFont. Similar qualities but very different.\n\n"
    },
    {
      "time": "25 Jul 2006 — 9:16am",
      "content": "The typeface used looks a lot like a fat version of [ITC Stymie Hairline](http://web.archive.org/web/20150301011229/http:/bowfinprintworks.com/SerifGuide/serifsamples/serif_s/stymie_hairline_full.gif), which had the same single-storey 'a' and serif on the 'y'. (I don't think this font is sold any more. I made this sample from an old Image Club font.)\n\n- Mike Yanega\n\n"
    },
    {
      "time": "25 Jul 2006 — 4:58pm",
      "content": "Mike,\n\nITC Stymie Hairline looks like a pretty good match.\n\nThanks very much.\n\nGrant\n\n"
    }
  ]
}
