{
  "id": "21458",
  "title": "The oldest?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "What are the oldest extant:\n\n1. Printing press  \n2. Type font  \n3. Punches and matrices?\n\n",
  "author": "Nick Shinn",
  "time": "25 Jul 2006 — 11:12am",
  "uid": "2021",
  "comments": [
    {
      "time": "25 Jul 2006 — 12:42pm",
      "content": "The use of the word \"extant.\" :^P Just kidding. Wouldn't the press be the oldest?\n\n"
    },
    {
      "time": "25 Jul 2006 — 12:50pm",
      "content": "Ya gotta make a font to print so you need punches first but block printing is much older than text printing so some sort of \"press\" may have been first. They may have just rubbed the back of the paper on the block with a wooden spoon or other tool though as we did in printmaking class.\n\nChrisL\n\n"
    },
    {
      "time": "25 Jul 2006 — 12:58pm",
      "content": "No, what I want to know is, what are the oldest existing examples of these kinds of equipment.\n\n"
    },
    {
      "time": "25 Jul 2006 — 1:16pm",
      "content": "Check out the [Plantin-Moretus Museum](http://web.archive.org/) in Antwerp:\n\n\"The Plantin-Moretus Museum possesses an exceptional collection of typographical material. Not only does it house the two oldest surviving printing presses in the world and complete sets of dies and matrices, it can also be proud of its magnificent library, a richly decorated interior and the entire archives of the Plantin business.\"\n\n"
    },
    {
      "time": "25 Jul 2006 — 1:22pm",
      "content": "(assuming you talk about \"western\" civilization)\n\nMaybe not real the oldest of them all but at least among them you can find at the [Museum Plantin-Moretus at Antwerp](http://web.archive.org/web/20141114062148/http:/museum.antwerpen.be/plantin_Moretus/index_eng.html) (go to collection).  \nType fonts, punches and matrices from the same time - about 1550 - can also be found at the Imprimerie Nationale at Paris.\n\nI remember having read about a metallurgical analysis of types from the 1520s. Maybe I can find the text at work.\n\nBy the way, the library I work at owns a woodcut block from the 1550s with a line of inserted metal types.\n\nWolfgang\n\n"
    },
    {
      "time": "25 Jul 2006 — 1:28pm",
      "content": "\\> 3. Punches and matrices?\n\nDon't know whether these are the oldest, but these two are pretty old  \n(both are from 1543):\n\n**Garamont’s Royal Great Primer or Gros-romain (Greek) 16 pt (1543)**  \nPunches and matrices preserved: Imprimerie Nationale, Paris, boite 47  \n(That is, it was at the Imprimerie Nationale, before it closed down due to lack of funding).\n\nThe typeface was probably ready by the end of 1542.  \nThe first use of it is in Robert Estienne's 1543 'Alphabetum Graecum'.\n\nfacsimile and literature:  \n• Vervliet, Hendrik D. L., 'Greek printing types of the French Renaissance: the ‘'grecs du roy’' and their successors', in: Journal of the Printing Historical Society, new series number 2, winter 2000, p 13-14\n\nThe Plantin-Moretus Museum has some pretty old stuff, too, for example:\n\n**Granjon’s Italique Saint augustin première 12 pt (1543)**  \nMatrices preserved: Plantin-Moretus Museum, Antwerp, MA 27a\n\nfacsimile and literature:  \n• Vervliet, H. D. L., ‘The italics of Robert Granjon’ in Typography Papers 3, 1998, p 10-11;  \n• Vervliet, H. D. L., Type specimen facsimiles 2. Reproductions of Christopher Plantin’s Index sive specimen characterum 1567 & Folio specimen of c. 1585; together with the Le Bé-Moretus specimen c. 1599, London 1972, see p 4 and no. 16/25\n\nSo, 1543 is my guess right now.  \n(it's not much more than a guess - I didn't do proper research)\n\nAny other or earlier suggestions?\n\n"
    },
    {
      "time": "25 Jul 2006 — 2:50pm",
      "content": "If you want to do research about the matrices and punches at the Plantin-Moretus museum, have a look at\n\nParker, M., K. Melis & H. D. L. Vervliet, 'Early Inventories of punches, matrices, and moulds, in the Plantin-Moretus archives', in De Gulden Passer, 38 (1960), pp 1-139\n\nThis article lists all the matrices and punches, but unfortunately there are no facsimiles in it.\n\n"
    },
    {
      "time": "25 Jul 2006 — 3:18pm",
      "content": "Thanks, that's great information.\n\n1543 is not long after the Incunabula, but it's still too bad that the type, tools, and presses of Aldus, Jenson, Griffo etc. have not survived.\n\n"
    },
    {
      "time": "25 Jul 2006 — 3:20pm",
      "content": "Don't the Garamond punches still exist? Seems like they do. I can't remember the name of the library.\n\n"
    },
    {
      "time": "25 Jul 2006 — 4:29pm",
      "content": "\\> Don’t the Garamond punches still exist?\n\nThese are the (punches and) matrices by Garamond romans (with upper- and lowercase) that survived at Plantin-Moretus.\n\n**Garamont’s Gros Canon Romain** c. 40 pt, (1555 ?)  \nMatrices preserved: Plantin-Moretus Museum, Antwerp\n\n**Garamont’s Parangonne Romaine** caps-height: 4mm (c. 1560/1561)  \nMatrices preserved: Plantin-Moretus Museum, Antwerp\n\n**Garamont’s Texte Romaine or Gros Romaine** caps-height 3.5 mm (1564 ?)  \nMatrices preserved: Plantin-Moretus Museum, Antwerp\n\n**Garamont’s Augustine Romaine** caps-height: 3 mm (1556/1564)  \nPunches and matrices preserved: Plantin-Moretus Museum, Antwerp\n\n**Garamont’s Mediane Romaine or Cicero Roman** caps-height: 2.5 mm (1558)  \nMatrices preserved: Plantin-Moretus Museum, Antwerp\n\n**Garamont’s Garamonde Romaine Premiere or Petite Romaine romaine or Petite Ascendonia** caps-height: 2 mm (1558)  \nMatrices preserved: Plantin-Moretus Museum, Antwerp\n\n**Garamont’s Garamonde Romaine** caps-height: 2 mm (1592 ?)  \nMatrices preserved: Plantin-Moretus Museum, Antwerp\n\n**Garamont’s Bible Romaine or Brevière romaine** caps-height: 1.5 mm (1559)  \nPunches and matrices preserved: Plantin-Moretus Museum, Antwerp\n\nFacsimiles for all of these typefaces you can find in:  \nVervliet, H. D. L., Type specimen facsimiles 2. Reproductions of Christopher Plantin’s Index sive specimen characterum 1567 & Folio specimen of c. 1585; together with the Le Bé-Moretus specimen c. 1599, London 1972\n\nThese unfinished punches and matrices by Garamond romans are also at Plantin-Moretus, (but there is no facsimile of the second of these two typefaces in Vervliet, H. D. L., Type specimen facsimiles 2.):  \n• Garamont’s Grosses Capitales Romaines caps-height: 14.5 mm (unfinished)  \n• Garamont’s Capitales de 2 Règles Bible ?? pt (unfinished)\n\nThe Garamond Greeks are (were?) at the Imprimerie Nationale.\n\n\\> too bad that the type, tools, and presses of Aldus, Jenson, Griffo etc. have not survived  \nAt least we have the books  \n:)\n\n"
    },
    {
      "time": "26 Jul 2006 — 4:20am",
      "content": "\\>too bad that the type, tools, and presses of Aldus, Jenson, Griffo etc. have not survived.\n\nConsidering the 400 years of, use, war, weather and progress, finding anything is pretty remarkable, no? I mean the Plantin Museum is a fluke brought on by the closing and shuttering of an entire foundry-press. The French kept stuff, I think, just because nobody wanted to loot it. . . but why would anything that was still good for use survive?\n\n"
    },
    {
      "time": "26 Jul 2006 — 5:00am",
      "content": "The oldest matrices may be those done by Henric Pieterzoon de Lettersnijder about 1492 - kept by Enschede en Zoonen at Haarlem.  \n-\\> Henry Carter: A view of Early Printing. 1969\n\nThe oldest type font my be the letters found at Lyon in the Saone in 1878. They are from late 15th / early 16th century.  \n-\\> Maurice Audin: Types du XVe siècle in: Gutenbergjahrbuch 1954\n\n"
    },
    {
      "time": "26 Jul 2006 — 7:06am",
      "content": "_but why would anything that was still good for use survive?_\n\nA theory: When an old plant became obsolete, businesses would shutter it up, and build a new one next door, on the same premises. Clearing the ground and disposing of the remains was an avoidable expense, by doing nothing. So as long as the business had continuity, the old buildings retained their contents. The situation was the same with the old family mansion, where it would have been disrespectful, bad luck even, to chuck out one's ancestors' effects.\n\n"
    },
    {
      "time": "26 Jul 2006 — 7:48am",
      "content": "Good question… The consensus is that several existing technologies came together when Gutenberg invented \"printing\". There were presses (eg for winemaking), the technique of making punches was around (for decorating metalwork) — even the use of counterpunches was in use. The technique of printing by using a counterform was known and used (blockprint). Paper was being produced in quantity. Literacy was increasing as well as the buying power of the middle classes. Etc. etc.\n\nGutenberg's genius lays in putting all this together, industrializing several processes (eg producing the loose type) and (very important!), inventing an ink that was suitable for his needs — something new and the last cog needed to get it done. In the end he never benefited from his invention, but untold others have…\n\nAs with most mayor inventions the art of printing sprung up in more places at the time, but Gutenberg hit it spot on and the others have been relegated to the outposts of local history (sorry, Coster).\n\nThe speed with which printing spread throughout the world was impressive — almost comparable to the revolution of the world wide web. Go figure — that happened five centuries plus ago…\n\n"
    },
    {
      "time": "26 Jul 2006 — 2:05pm",
      "content": "\\> The oldest matrices ...  \n\\> by Henric Pieterzoon de Lettersnijder about 1492\n\n\\> The oldest type font may be the letters found at Lyon in the Saone in 1878.  \n\\> They are from late 15th / early 16th century.\n\nThanks a lot for this information. That's great!  \nNow we only need the oldest printing press...  \n:)\n\nHere's a link to an article by James Mosley:  \n'Preserving the typographical patrimony'  \n [http://www.garamonpatrimoine.org/coupures\\_presse/bibliomosley2.html](http://web.archive.org/web/20141114062148/http:/www.garamonpatrimoine.org/coupures_presse/bibliomosley2.html \"http://www.garamonpatrimoine.org/coupures\\_presse/bibliomosley2.html\")\n\n"
    },
    {
      "time": "26 Jul 2006 — 7:15pm",
      "content": "Nick\n\nThe typefoundry blog\n\n[http://typefoundry.blogspot.com/2006/01/materials-of-typefounding.html](http://web.archive.org/web/20141114062148/http:/typefoundry.blogspot.com/2006/01/materials-of-typefounding.html \"http://typefoundry.blogspot.com/2006/01/materials-of-typefounding.html\")\n\nhas an entry by Mosley on existent punches.\n\nI think the Plantin-Moretus Museum might have the earliest of surviving wooden common presses. The problem with the wooden common press was that it was built into the structure of the building; the roofing beams. Thus they were more likely scavenged rather than moved.\n\nTo go a bit non-western, the Tokyo Printing Museum has some great examples of sand moulds and castings from earlier Japanese and Korean efforts. They've a couple of catalogs with great photos.\n\nQuaerendo: quarterly journal from the Low Countries devoted to manuscripts and printed books has a very useful examination of existing wooden common presses. An index to articles can be found at\n\n[http://www.msh-reseau.prd.fr/RevuesSom/detailrevue.jsp?Drevue=%22Quaeren...](http://web.archive.org/web/20141114062148/http:/www.msh-reseau.prd.fr/RevuesSom/detailrevue.jsp?Drevue=%22Quaerendo%22 \"http://www.msh-reseau.prd.fr/RevuesSom/detailrevue.jsp?Drevue=%22Quaerendo%22\")\n\nGerald\n\nThe Bieler Press  \n [http://BielerPress.blogspot.com](http://web.archive.org/web/20141114062148/http:/bielerpress.blogspot.com/ \"http://BielerPress.blogspot.com\")\n\n"
    },
    {
      "time": "19 Nov 2012 — 5:27am",
      "content": "Hello,\n\nYou might like to check this [post](http://web.archive.org/web/20141114062148/http:/typophile.com/node/98161).\n\n"
    },
    {
      "time": "19 Nov 2012 — 11:22am",
      "content": "I did.  \nBut it’s not relevant.\n\n"
    },
    {
      "time": "19 Nov 2012 — 6:36pm",
      "content": "Alter Littera - it's generally not polite to resurrect old threads unless you're the original poster or you're adding something relevant to the thread. Unfortunately your posting comes off as \"spammy\" - unsolicited marketing - and may potentially alienate you from the Typophile community.\n\n"
    },
    {
      "time": "19 Nov 2012 — 7:05pm",
      "content": "I think I’m going to win with this one. Drumroll please…\n\n**[The Phaistos Disc](http://web.archive.org/web/20141114062148/http:/en.wikipedia.org/wiki/Phaistos_Disc)**.\n\n ![](http://web.archive.org/web/20141114062148im_/http:/typophile.com/files/disc_5770.JPG)\n\n"
    },
    {
      "time": "19 Nov 2012 — 8:10pm",
      "content": "Nah, that's a board game. ;)\n\n"
    },
    {
      "time": "19 Nov 2012 — 8:14pm",
      "content": "@bemerx25 re Alter Littera, agreed.\n\n"
    },
    {
      "time": "19 Nov 2012 — 8:18pm",
      "content": "Interesting. After checking [Alter Littera’s track](http://web.archive.org/web/20141114062148/http:/typophile.com/user/183250/track), it appears as though all of the posts are in fact ads for various (similar) blackletter fonts…\n\n"
    },
    {
      "time": "21 Nov 2012 — 1:30pm",
      "content": "_Unfortunately your posting comes off as \"spammy\" - unsolicited marketing - and may potentially alienate you from the Typophile community._\n\nI am very sorry to read that. Please excuse my (unintentional) impoliteness. I am just a newcomer to typography, type design, type forums and the like. I just thought my latest post on Gutenberg fonts might be interesting/relevant to some forum topics, but this is obviously not the case. Indeed, I had no intention to spam. Lesson learned. Please accept my apologies.\n\nKindest regards.\n\n"
    },
    {
      "time": "21 Nov 2012 — 2:06pm",
      "content": "The announcement itself seemed fine to me, it was just that you posted multiple blind links — \"You might like to check this post [link]\" — which seemed spammy because the reader didn't know they were taking him to an advertisement. More informative links would have been better.\n\n"
    }
  ]
}
