{
  "id": "21451",
  "title": "WHAT IS THIS????",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Please if somebody can tell me where i can get this font called SHAG LOUNGE for free because i need it for some web page. It is used in cartoon network page and it looks like on this picture. Thnx\n\n ![](http://web.archive.org/web/20091205085735im_/http:/typophile.com/files/as_4321.JPG)\n\n",
  "author": "<a href=\"/web/20091205085735/http://typophile.com/user/13977\" title=\"View user profile.\">sebabosss</a>",
  "time": "<br>",
  "uid": "13977",
  "comments": [
    {
      "time": " 25.Jul.2006 3.55am",
      "content": "Feel free to purchase your very own ’copy’ at House Industries, [www.houseind.com](http://web.archive.org/web/20091205085735/http:/www.houseind.com/).  \n _\\> [www.houseind.com/index.php?page=showfont&id=22&subpage=viewfonts](http://web.archive.org/web/20091205085735/http:/www.houseind.com/index.php?page=showfont&id=22&subpage=viewfonts)_\n\n[Dav](http://web.archive.org/web/20091205085735/http:/www.dav.name/)\n\n_( Just in case you are all new to this buying stuff ’thing’ and wondering: ’Shag Lounge’ is a commercial typeface and therefore a license has to be bought, and, there is no legal way to obtain a free ’copy’ of it. Ooh, And, Greetings to Ljubljana, Ive been there last friday. :)_\n\n"
    },
    {
      "time": " 25.Jul.2006 4.53am",
      "content": "Can you tell me where I can get web pages made by you for free, please? Thnx.\n\n"
    },
    {
      "time": " 25.Jul.2006 4.58am",
      "content": "grot esque xontact me to [sebabosss@gmail.com](mailto:sebabosss@gmail.com)\n\n"
    },
    {
      "time": " 25.Jul.2006 4.59am",
      "content": "please i still need that font SHAG LOUNGE\n\n"
    },
    {
      "time": " 25.Jul.2006 5.40am",
      "content": "Ooohkay, Sadly enough you didnt ’get’ it. Not in the sense of actually getting the font, but in the sense of understanding how all this works, or should work. There is no legal FREE copy / version / whatever of that typeface. Got it?\n\nWant it? Buy it!\n\n_( Maybe someone else will write some more about this. I wont. Its too hot for this.  \nJust a few more things: I dont think any fellow Typophile will send you the typeface. Neither do I think that anyone will send you a link to illegally download a bootlegged copy of it. Thats it. For now. )_\n\n[Dav](http://web.archive.org/web/20091205085735/http:/www.dav.name/)\n\n"
    },
    {
      "time": " 25.Jul.2006 5.47am",
      "content": "<cite>please i still need that font SHAG LOUNGE</cite>\n\nThis is definitely the wrong forum to ask for free copies of commercial fonts. If you want Shag Lounge, follow the link Dav mentions. Alternatively, you might try — for example — [www.myfonts.com](http://web.archive.org/web/20091205085735/http:/www.myfonts.com/category/myfonts/index.html) and follow the link to category “funny”. With some luck you find something similar at a lower price?\n\nKarsten\n\n"
    },
    {
      "time": " 25.Jul.2006 7.00am",
      "content": "New to typophile.com, but certainly not new to the biz.\n\nSometimes young guys don’t know the ropes and don’t realize there is an easy way to get the font you need for a client. Usually all you have to do is ask. Compared to the overall cost (not just what they’re paying you — if they’re paying) and the projected returns, a font like Shag is well worth the $$ investment. Show your client the font, explain how you’d use it, and present them with the cost. It’s just like stock photography… And every young designer should learn to work WITH their clients.\n\n"
    },
    {
      "time": " 25.Jul.2006 7.46am",
      "content": "Dan,\n\nSadly I wish it were that simple. My clients (publishing companies) are pretty tight fisted when it comes to buying fonts. As a result I tend only to buy them when I know I am going to have a lot of uses for them. It means I end up going with the reliable workhorses and not having a lot of “flings”, at least not on my clients’s dime.\n\n"
    },
    {
      "time": " 25.Jul.2006 8.11am",
      "content": "I’ve had a few tight-fisted clients over the years, and I always found it best to get new clients.\n\nJim\n\n"
    },
    {
      "time": " 25.Jul.2006 8.17am",
      "content": "Yes, fresh fonts are often seen as a designer’s indulgence.  \nAnd that may be true.  \nThe way to find out is to present comps set in a choice of either an Adobe/Apple/Microsoft bundled font that’s free and everyone has, or something special that will have to be bought. If it really does make a difference that the client can appreciate, then the outlay should be no problem.  \nYou can certainly do comps for web work, which is low resolution, using screen-grabs from type-testers such as Veer’s Flont. But unfortunately for Seb, House industries don’t do that feature... no doubt to disable unscrupulous designers from using screen-grabs for finished art.\n\n"
    }
  ]
}
