{
  "id": "21460",
  "title": "replacing the eszett in pill gothic with the alternative glyph",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "hello,\n\ni'm using christian robertson's typeface [pill gothic](http://web.archive.org/web/20130712200429/http:/typophile.com/wiki/pill%20gothic) in a project. setting text in german language, i found the font's \"ß\" not that suitable for my purpose. it's looking a bit \"old fashioned\" whereas the font itself is rather modern. unfortunately, the two alternive \"ß\" are not evoked by the opentype titling alternatives or other opentype programmings. it seems as if it isn't even possible to search and replace the specific character in indesign, for i can't place the alternative glyph (taken from the indesign glyph table) into the replace field. it won't be recognized correctly then and just \"^;\" will be replaced instead of the real glyph.  \nany suggestions/solutions for that issue?\n\nalex schmidt\n\n",
  "author": "Plaintype",
  "time": "25 Jul 2006 — 1:11pm",
  "uid": "9326",
  "comments": [
    {
      "time": "25 Jul 2006 — 1:30pm",
      "content": "Hmm. That's a tough question. Obviously picking the alternate in the glyph palette wouldn't be an option. Unfortunately, when this font was authored no one supported stylistic sets. The good news is that the license on my fonts allows users to decompile/recompile/edit as long as they don't resell them. I could probably give you a custom cut, though. I'm assuming that you bought a license ;)\n\n"
    },
    {
      "time": "25 Jul 2006 — 3:56pm",
      "content": "hello christian, nice to meet you here. :)  \nthis font was actually bought by the client from veer after i suggested it for the work. apart from me, the font is used by a translator and a layouter, who don't even know, that i want to have the \"ß\" changed. the deadline for printing is near, and i don't want to upset the people with bringing in a changed font right now. therefore i've been looking for a search&replace solution. On the other hand, this is not very practical anyhow, because of wrong spelling and hyphenation problems.\n\nwhere did you get the inspiration for drawing the \"ß\" this way? i'm asking, because here in germany you won't meet this specific form very often – although, you can see it on a lot of street signs here in berlin ( [http://upload.wikimedia.org/wikipedia/commons/0/0d/Berliner\\_Strassenschi...](http://web.archive.org/web/20130712200429/http:/upload.wikimedia.org/wikipedia/commons/0/0d/Berliner_Strassenschilder.jpg \"http://upload.wikimedia.org/wikipedia/commons/0/0d/Berliner\\_Strassenschilder.jpg\")).  \nthis form derives from the ligature long-s and blackletter-z. that's what makes it look a bit nostalgic. the commonly used one derives from long-s and short-s – double-s, so to speak. although it is not the same as \"ss\"... okay, german language – difficult to understand anyway. but whom i'm talking with – i guess, you have thought about all that when drawing the alternative forms.\n\ni'd like to come back to your offer after talking to the client (maybe he likes the \"ß\" the way it is anyway ;)).\n\n**edit:** btw, it is the pill gothic condensed 1 package.\n\n"
    }
  ]
}
