{
  "id": "21473",
  "title": "photo-lettering,inc type specimin books",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hey all, as im sure a lot of people here would be on the hunt for these books this might be a worthless post... but anyone have any ideas on places to look for the old photlettering books like the ones on [http://photolettering.com/](http://web.archive.org/web/20131015204248/http:/photolettering.com/ \"http://photolettering.com/\") ? i have the 2 thesauruses (thesaurusi?), but im on the lookout for some of the old smaller books like the ones piled up in the photo in the background.\n\ni assume there must be some around in nyc somewhere... but id prefer to not have to resort to gallaghers and pay 200 bucks a book.\n\nthanks for any help!  \njustin\n\n",
  "author": "justinthomaskay",
  "time": "26 Jul 2006 — 7:56am",
  "uid": "3244",
  "comments": [
    {
      "time": "26 Jul 2006 — 8:43am",
      "content": "Occasionally one will show up on eBay. Not often though. A copy of _Psychedelitypes_ sold a few weeks ago. And there are several people looking for them on eBay.\n\nYou can also use bookfinder.com and abebooks.com. Between the two they cover most of the online dealers in the U.S. and several in Europe. Do periodic searches for \"photolettering\" and \"photo lettering.\"\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "26 Jul 2006 — 9:35am",
      "content": "Best site I've found for rare/used/out of print books is:\n\n[http://www.addall.com/Used/](http://web.archive.org/web/20131015204248/http:/www.addall.com/Used/ \"http://www.addall.com/Used/\")\n\nThey seem to have a few.\n\nThis site searches all the other used book sites. I've found some gems there.\n\n"
    },
    {
      "time": "26 Jul 2006 — 10:42am",
      "content": "Several of the booklets and flyers shown in the image you linked pre-date ITC. Lucky pack-rat that I am I still have several of the ones shown, like \"Nostalgia\" signed by Ed Benguiat.\n\nIf I find any duplicates (I know I have a couple) I will donate what I find to [TypeCon's Typographic Treasures](http://web.archive.org/web/20131015204248/http:/typophile.com/cms/node/21405).\n\n"
    }
  ]
}
