{
  "id": "2156",
  "title": "(x) house & garden - Pistilli Roman {Marc Simonson}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi all,   \n   \nHere's a font that's been vexing me for ages. I only have a scan from a fax copy and want to improve it somewhat.   \n   \nLooks like a form of Bodoni or Century 725 Black from the Corel disk... but the killer is the ampersand (the &).   \n   \nAny ideas? Thanks in advance. ![House & Garden logo](http://web.archive.org/web/20141128234646im_/http:/www.typophile.com/forums/messages/83/20934.gif)\n\n",
  "author": "anonymous",
  "time": "20 Nov 2003 — 6:07pm",
  "uid": "1203",
  "comments": [
    {
      "time": "20 Nov 2003 — 6:23pm",
      "content": "Here it is:   \n   \n ![pistilli](http://web.archive.org/web/20141128234646im_/http:/www.typophile.com/forums/messages/83/20936.gif)\n\n"
    },
    {
      "time": "20 Nov 2003 — 7:54pm",
      "content": "Getting a lot of mileage from that Phil's Photo book Mark? (I have a copy too -- too bad so much of the type isn't digitized). Good eye.\n\n"
    },
    {
      "time": "20 Nov 2003 — 8:02pm",
      "content": "I love my Phil's book too. I wonder if Ralph Smith and the gang at Phil's Fonts have access to any of that film. Seems a shame that so much of it hasn't made to it digital.\n\n"
    },
    {
      "time": "20 Nov 2003 — 9:32pm",
      "content": "Hey, I don't pick 'em. The fact is, the Phil's book has some   \nof the best samples, and it's fairly comprehensive as of   \nabout 1980 for old film fonts. Other books have a broader   \nsampling, but poorer showings. Mine is #573. I still have   \nthe receipt for $48 (plus $3 shipping).\n\n"
    },
    {
      "time": "21 Nov 2003 — 6:38am",
      "content": "What I find most useful is having the groupings of fonts by Categories, such as Ultra Bold (where Pistilli showed up & Egiziano too, from another post), and especially by Serif type. Very Handy. I have a Second Edition version with a $39.95 sticker still on the back. What do you mean that yours is #573?\n\n"
    },
    {
      "time": "21 Nov 2003 — 1:28pm",
      "content": "The inside front cover (it's in a 3-ring binder) has a sticker   \nwith my name written in and the number \"573/2500\" which   \n(I assume) means it's number 573 of a run of 2500. There's   \nalso a coupon in the back to put the cost of the book   \ntoward the first job I might send to them. I don't know if   \nyou remember, but typesetters usually kept track of who   \nhad their catalogs for marketing purposes. Those things   \nweren't cheap to produce, I'm sure.\n\n"
    },
    {
      "time": "21 Nov 2003 — 1:37pm",
      "content": "Fascinating! Mine was a softbound book I purchased new at a bookstore in Seattle, published by Rockport Publishers in 1985. You have a collector's item to be sure.\n\n"
    },
    {
      "time": "21 Nov 2003 — 3:10pm",
      "content": "Huh! I didn't realize it was published as a book. I always   \nassumed that everyone had a copy like mine. In addition to   \nthe coupon and receipt in the back pocket, it also has a   \ncredit application and price list. It's loose-bound in a   \nthree-ring binder, so it's easy to take the pages out. The   \nthree indexes in the front are saddle-stitched separately   \nand bound in with the other pages. A fairly elaborate   \npackage, actually.\n\n"
    },
    {
      "time": "21 Nov 2003 — 3:59pm",
      "content": "I just ordered a copy at abebooks through   \n [Bowfin Printworks Typographic References List](http://web.archive.org/web/20141128234646/http:/www.bowfinprintworks.com/ListPages/FontBookList.html)   \n   \nThanks again Mike.\n\n"
    },
    {
      "time": "21 Nov 2003 — 4:36pm",
      "content": "Thanks Ignacio. Using that link helps support my site. Glad it helped you out.\n\n"
    },
    {
      "time": "21 Nov 2003 — 5:49pm",
      "content": "I've got a copy on the way too!   \nWhat a painless way to support your very useful site , Mike.\n\n"
    },
    {
      "time": "21 Nov 2003 — 5:58pm",
      "content": "Thank you too, Mike. I appreciate it.\n\n"
    },
    {
      "time": "23 Nov 2003 — 7:15pm",
      "content": "I don't know much about it, but I don't think it's from any   \nearlier than the late 1960s. I can tell you that it was a VGC   \nfont designed by John Pistilli and that it came in three basic   \nweights--normal, bold, and black. The weights appear to   \nrefer mainly to the thickness of the hairlines, sort of like   \noptical scaling. There were two other styles--Open No. 1   \nand Open No. 2--which only differed in stroke thickness.\n\n"
    },
    {
      "time": "24 Nov 2003 — 10:42am",
      "content": "Mark,   \nI just found a site ( [Incipit](http://web.archive.org/web/20141128234646/http:/www.incipit.com/typefaces.html)) that says they have a photocomposition (film type) library of 3,500 faces, including the 4 Pistilli faces. A quick glance at their type catalog listing shows a lot of the Phil's Photo typefaces alive and well in that collection. Makes you wish you had your own Typositor doesn't it?\n\n"
    },
    {
      "time": "24 Nov 2003 — 12:26pm",
      "content": "Yes Mark, you have a collector's item for sure.   \n   \nI sent Phil's Fonts an e-mail and told me that they sold the last one about 3 years ago,   \nthanksTamie for the clue though, and yes, that would have been the perfect gift.   \n   \nBTW Grant, now that you are close, thank you very much for that [link-thread](http://web.archive.org/web/20141128234646/http:/www.typophile.com/forums/messages/30/20790.html?1069322372) on original cartoon titles,   \nlovely things there.\n\n"
    },
    {
      "time": "24 Nov 2003 — 12:37pm",
      "content": "Yeah, I found that site a while back, too. Looks like they   \nhave all of them.   \n   \nI actually have a dozen old Typositor reels with 60 or so   \nfaces on them. They used to belong to the University of   \nMinnesota's Journalism School. I grabbed them when they   \nwere going to be thrown out. No Typositor, though.   \n   \nI wanted very badly for a while to have a Typositor in-house   \nwhen I was a magazine art director early in my career, but   \nthey were not cheap and we could never justify the cost.\n\n"
    },
    {
      "time": "24 Nov 2003 — 2:42pm",
      "content": "All of our typositor reels found their way to the dumpster around mid 1995. Typositors are long gone too.   \n  \nOn a brighter note I do have about 20 \"Homage to the Alphabet\" 3 ring binders and a \"slightly improved design\" 7 ring binders in my personal stash.   \n   \nI keep thinking I'd like to get someone to complete a full alphabet of the script typeface design on the cover of the binder version of \"Homage\".   \n [http://www.philsfonts.com/tist\\_main052103.html](http://web.archive.org/web/20141128234646/http:/www.philsfonts.com/tist_main052103.html)\n\n"
    },
    {
      "time": "24 Nov 2003 — 3:17pm",
      "content": "Who did that lettering? There's no credit that I can find in the book.   \n   \nI just realized I've been calling mine a \"three-ring binder,\" but it's actually got seven. I guess I have the \"slightly improved design.\"\n\n"
    },
    {
      "time": "24 Nov 2003 — 4:36pm",
      "content": "The credit (James Helmuth) is on the image Ralph posted (assuming that's the same lettering on your copy), isn't it?\n\n"
    },
    {
      "time": "24 Nov 2003 — 5:44pm",
      "content": "I totally missed that. He's just listed as the designer in the   \nbook itself so it's hard to say from that, but, no doubt, the   \ncredit given on their site is correct.\n\n"
    },
    {
      "time": "25 Nov 2003 — 6:06am",
      "content": "The designer was indeed James Hellmuth. He did 99% of the design work for Phil's Photo. Very talanted guy. I've been out of touch with him for years.   \n   \nBy the way the catalog ,\"Homage\", is the first instance I can recall that has a \"found typography\" or what ever you want to call it. Photos of type in everyday use separate each alphabetical section.\n\n"
    },
    {
      "time": "25 Nov 2003 — 7:28am",
      "content": "I've always thought those dividers were a nice touch.   \n   \nThere's one photo in there that gets to me now. It's the one   \nfor \"T\" which is from the giant letters for The Big Kitchen   \nwhich used to be at the top of one of the WTC towers. It   \nwas designed by Milton Glaser and I always thought it was a   \nneat thing. I'm sure it was long gone by the time of the   \nattacks, but seeing it now reminds me of everthing thing   \nthat's happened since. You never know what you'll find in a   \ntype specimen book.\n\n"
    },
    {
      "time": "25 Nov 2003 — 9:45am",
      "content": "![bigkitchen](http://web.archive.org/web/20141128234646im_/http:/www.typophile.com/forums/messages/83/21222.gif)\n\n"
    },
    {
      "time": "21 Nov 2003 — 7:36pm",
      "content": "The Phil's Photo \"Homage to the Alphabet\" is indeed a treasure. The first edition in a 3-ring binder is beautiful, and is definitely a collector's item. When I still worked at Phil's a couple of years go, they had a small stash left of the first edition. If I recall correctly, they were selling for around $150 each, and there may be a few copies left. Yes, it's more than the later paperback editions you can find second-hand, but the original is just wonderful. I highly recommend it as a Christmas gift (to yourself).   \n   \n [www.philsfonts.com](http://web.archive.org/web/20141128234646/http:/www.philsfonts.com/)   \n   \nAnd no, I am no longer affiliated with Phil's Fonts in any way, I just want everyone to have the joy of owning this book if possible.\n\n"
    },
    {
      "time": "23 Nov 2003 — 2:35pm",
      "content": "Thanks to all, especially to Mark for his keen eye.   \n   \nLooks like the font will keep on vexing me since it's not digitised! At least I now know what it is; the original must go back a fair way. Thanks again for your help.\n\n"
    },
    {
      "time": "25 Nov 2003 — 8:50am",
      "content": "Can you show it to us, Mark?\n\n"
    },
    {
      "time": "20 Nov 2003 — 6:19pm",
      "content": "Pistilli Roman. Although it looks like it's been heavied up a bit with ink spread or some outline/shadow treatement. I'll post a scan shortly.\n\n"
    }
  ]
}
