{
  "id": "2167",
  "title": "Typography contests?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "There are several graphic design websites where I can go, post a dollar amount and a project overview, and people will post competing entries. I can then give feedback on the entries, and they'll be revised, altered, etc., until the deadline comes, at which point I pick a winner and they receive the cash.   \n   \nIs there anything like that for typography, possibly on this forum? (It might be here and I'm just not seeing it...)   \n   \nThere's a huge amount of talent here. I'm currently rebranding my firm, and I'd much rather have something designed by typographers than just graphic designers.   \n   \nAny suggestions?   \n   \nThanks,   \nJames\n\n",
  "author": "jamesaz",
  "time": "21 Nov 2003 — 8:54am",
  "uid": "2667",
  "comments": [
    {
      "time": "21 Nov 2003 — 9:18am",
      "content": "I don't think you'll find too much help in here. What you are asking for is considered spec work...something a lot of designers frown upon.\n\n"
    },
    {
      "time": "21 Nov 2003 — 9:23am",
      "content": "That's kind of what I was thinking -- of course, one would expect the same of graphic designers, but sites like designoutpost.com are quite busy with this kind of work going on -- and generally with reasonably good quality as well.\n\n"
    },
    {
      "time": "21 Nov 2003 — 9:34am",
      "content": "James, a lot of graphic designers (and all major design associations) _do_ frown on spec work. It devalues the work, invites amateurism, and opens the artist to all kinds of intellectual-property vulnerabilities. Design contests are often tolerated when run by nonprofit organizations, but that's about it.   \n   \nGood design involves more than just coming up with a neat idea. It requires research, investigation, and getting to know the client. If you want good design, hire professionals and pay them for their time and work.\n\n"
    },
    {
      "time": "21 Nov 2003 — 9:40am",
      "content": "\"I'd much rather have something designed by typographers than just graphic designers.\"   \n   \n   \nI think what your looking for is a 'good graphic designer'. A 'good designer' would be one well versed IN typography. I think you will find many talented 'typographers' who could set a beautiful page for you, but would be clueless when it came to trying to develop and impliment an identity. If this makes sense.   \n   \nOhh, and no, you will NOT find a 'good designer'   \nwho will do spec work. (period)   \nMaybe if you were a fortune 100 company.   \n   \nSpec work is for the art school kids.   \n   \nHIldebrant.\n\n"
    },
    {
      "time": "21 Nov 2003 — 1:50pm",
      "content": "\"designoutpost.com are quite busy with this kind of work going on -- and generally with reasonably good quality as well.\"   \n   \nHmm...never been to that site. Just went and had a look-see. I think your definition of 'reasonably good' differs than mine. ;o)   \n   \nBut hey, if that's what you want, there's no crime in it...\n\n"
    },
    {
      "time": "21 Nov 2003 — 2:28pm",
      "content": "Well, I'm a small business owner, so \"reasonably good\" means \"as good as you're going to get on a miniscule budget.\" ![:-)](http://web.archive.org/web/20131020073016im_/http:/www.typophile.com/forums/clipart/happy.gif)  \n   \nIt's not great, it's not going to be printed in any design magazines, and it's not going to win any awards, but for the amount a small business is able to pay -- it's reasonable.   \n   \nThis makes me realize, of course, that I might be better asking the question in a different way -- how can I get typographical work done on a shoestring budget?\n\n"
    },
    {
      "time": "21 Nov 2003 — 2:37pm",
      "content": "By sacrificing quality? The usual method...   \n   \nhhp\n\n"
    },
    {
      "time": "21 Nov 2003 — 2:51pm",
      "content": "There aren't many alternatives to that, unfortunately.\n\n"
    },
    {
      "time": "21 Nov 2003 — 2:57pm",
      "content": "Well, it depends what \"miniscule budget\" means. You could certainly check out a bunch of designers, approach the smaller shops whose work you respect, and say, \"Here's what I can afford -- can you do anything for me?\" Can't hurt to ask.\n\n"
    },
    {
      "time": "21 Nov 2003 — 3:01pm",
      "content": "There's also bartering.   \n   \nhhp\n\n"
    },
    {
      "time": "21 Nov 2003 — 3:03pm",
      "content": "Ahhh, bartering's not a bad idea. I would think that more talented amateurs would probably already have websites (I operate a web development firm), but it might be worth a shot...\n\n"
    },
    {
      "time": "21 Nov 2003 — 3:23pm",
      "content": "Well, there are a few things to consider.   \n   \nDo you not have a marketing budget? If you're running a business, you should have one.   \n   \nThe bartering idea is a good one. Do you offer web hosting? That might be a useful swap. Otherwise, just find and hire a good freelancer. You'll probably pay more than $100, but you might be surprised what you can get if you work with the designer.\n\n"
    },
    {
      "time": "21 Nov 2003 — 4:43pm",
      "content": "I do indeed offer webhosting. Where would be a good place to make such an offer and see if anyone's interested? Would it be inappropriate to post some kind of \"will barter for typography?\" post on this site?   \n   \n(To answer your question, we do have a marketing budget, but it's currently only in the hundreds of dollars.)\n\n"
    },
    {
      "time": "2 Dec 2003 — 6:17pm",
      "content": "Something I often suggest to potential clients with limited budgets is to approach local design schools with their project proposals. Some schools will take on business projects as class efforts, give design students school credit for taking on such work, or suggest student designers who might be able to work within the client's budget limitations.   \n   \nOn the topic of \"spec\" work the following article offers some good information:   \n   \n [http://www.creativelatitude.com/articles/articles\\_cb\\_spec.html](http://web.archive.org/web/20131020073016/http:/www.creativelatitude.com/articles/articles_cb_spec.html)   \n   \nJeff Fisher   \nEngineer of Creative Identity   \n   \nJeff Fisher LogoMotives   \n [http://www.jfisherlogomotives.com](http://web.archive.org/web/20131020073016/http:/www.jfisherlogomotives.com/)\n\n"
    }
  ]
}
