{
  "id": "2171",
  "title": "Indesign CS to Indesign 2.0????",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "From help:   \n\"You can export InDesign CS documents in InDesign Interchange format (.INX) for compatibility with InDesign 2.0. To open these documents in version 2.0, you'll need to obtain and install the Scripting plug-in and the XML Reader plug-in. You can obtain these plug-ins from the Adobe Web site.\"   \n   \nOK, I CAN NOT find these plugins ANYWHERE on the Adobe Site?   \n   \nAnyone else experience this, or have found a way to do this??\n\n",
  "author": "hildebrant",
  "time": "Fri, 2003-11-21 13:07",
  "uid": "1286",
  "comments": [
    {
      "time": " Fri, 2003-11-21 13:18",
      "content": "Check the readme:   \nThey aren't there.The feature wasn't included.   \nI know, I know...\n\n"
    },
    {
      "time": " Fri, 2003-11-21 14:01",
      "content": "Adobe's website is very confusing. It took me two days and two phone calls to find a form to fax back to them.\n\n"
    },
    {
      "time": " Sat, 2003-11-22 15:31",
      "content": "WTF!   \n   \nSeriously. What about saving earlier versions of AI??   \n   \nNothing like a CHOKE HOLD, into upgrading EVER system in yor office to CS. I mean, this WAS the plan, but all at once is a little spendy, so in the meantime, I have some systems with, some without, and I'm f\\*cked? ![:-(](http://web.archive.org/web/20050526221428im_/http:/www.typophile.com/forums/clipart/sad.gif)   \n   \nHildebrant.\n\n"
    },
    {
      "time": " Sat, 2003-11-22 15:34",
      "content": "The only thing more confusing than there website is there forums. Complete MADNESS.\n\n"
    },
    {
      "time": " Sat, 2003-11-22 18:06",
      "content": "Kyle, you can save down to earlier versions of AI... File\\>Export\\>Legacy AI. Just make sure you don't need to edit any of the text in the saved down version.\n\n"
    },
    {
      "time": " Sun, 2003-11-23 05:35",
      "content": "Glad I didn't make my usual frantic leap towards the purchase of InDesign's latest and greatest. Reminds me of Macromedia's same stunt a short while ago.\n\n"
    },
    {
      "time": " Sun, 2003-11-23 05:36",
      "content": "For anyone who did make the leap, would you mind keeping the rest of us posted on this issue? Thanks!\n\n"
    },
    {
      "time": " Mon, 2003-11-24 18:32",
      "content": "I am very irritated with Adobe. I would love to be working in CS full time, but a lot of my printers have yet to upgrade. I understand that a lot of CS features won't translate to 2.0 (mixed spot inks for example), but give us the option to down-save please!! I would gladly pay $50 for a plug-in to go from CS to 2.0.2.\n\n"
    },
    {
      "time": " Mon, 2003-11-24 21:25",
      "content": "Can't use PDF, Tom?\n\n"
    },
    {
      "time": " Mon, 2003-11-24 21:56",
      "content": "It is possible that a feature like this might show up in the future. As many have noted, it was in development for InDesign CS. It got shelved because it didn't work well enough for prime time.   \n   \nEven a translation feature that did work well enough to be released would \\*NOT\\* be useful for sending a document to a printer! To use it for such a function would be a Really Bad Idea, and people who tried it would be Very Disappointed. The functionality would be to allow a document to go back to the older version for changing content.   \n   \nAs Chris suggests, if you want to print, and somebody doesn't have the right version of the application, use PDF.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " Tue, 2003-11-25 01:16",
      "content": "more reason not to upgrade?\n\n"
    },
    {
      "time": " Tue, 2003-11-25 17:01",
      "content": "The PDF standards complince that is starting to become more prominent, in my mind, is a great thing. ie: PDF X-1A and 3a and such.   \n   \nI have had quite a bit of success with print from the x-1a compliant PDFs.   \n   \n ![:-)](http://web.archive.org/web/20050526221428im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    }
  ]
}
