{
  "id": "2179",
  "title": "Serif type face lc",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "This is the lc of a typeface I design for my personal correspondence. I wanted to approach a mixture between classic and modern.   \nPlease tell me where I could do some improvements.   \n(and there are some for sure, look at v,w,y,y,z(I was fighting with these))   \nMy main aim was to have good counterforms.   \nNothing further to say about it yet, expect I hope you'll like it.   \n   \nDominik   \n ![](http://web.archive.org/web/20150417090543im_/http:/www.typophile.com/forums/messages/29/21084.gif)\n\n",
  "author": "golfomat",
  "time": "23 Nov 2003 — 12:30pm",
  "uid": "2323",
  "comments": [
    {
      "time": "24 Nov 2003 — 10:12am",
      "content": "There are some things I really like (such as the shy top of the \"a\"), but I have two big complaints:   \n- The strong head serifs are pulling the design counter-clockwise (which is not easy to counteract).   \n- The widths are inconsistent, like look at the \"b\" versus the \"h\".   \n   \nSome specific suggestions:   \n- The \"f\" is too soft and big on top.   \n- The \"g\" is too mannered: tame the ear, and make the head smaller.   \n- The \"k\" is wonderful, although in the \"too narrow\" group.   \n- Put a notch in the ear of the \"q\".   \n- Tame the beak of the \"r\".   \n- Make the \"t\" stronger.   \n- I actually like the \"v\" et al.   \n- Open up the \"x\".   \n- The \"z\" is too blocky.   \n   \nBTW, your vertical proportions are right on for use at small sizes (like 9 pt), and the darkish color matches that too. On the other hand, overall it's too narrow for small sizes.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Nov 2003 — 10:14am",
      "content": "Thanks for your Tips Hrant, they have been very useful. Sometimes somebody else has to open up your eyes.   \n   \nI hope I understood everything in the right way.   \nI decided to change the head serifs for some smaller .   \nMy problem still is the color of \"v et al.\" , as you said, they appear as if they didn't belong to the typeface.   \n   \nI was fighting hard with the g and decided fo a closed version, the other one (you don't see) with the opened tail was way too disturbing for text.   \n   \nGenerally I have to thank all who post here at typophile, since I have learned a lot from this thread yet.   \n   \nI also found a nname for it now: \"apena\". It's senseless, but the word looks good if you set in apena.   \n   \nServus   \n   \nDominik ![](http://web.archive.org/web/20150417090543im_/http:/www.typophile.com/forums/messages/29/21228.gif)\n\n"
    },
    {
      "time": "25 Nov 2003 — 1:52pm",
      "content": "I think you went a bit too far making the head serifs smaller.   \nThe new \"f\", \"g\" and \"t\" are very nice.   \n   \nBTW, in Spanish \"apenas\" means \"barely\"...   \n   \nhhp\n\n"
    },
    {
      "time": "25 Nov 2003 — 2:34pm",
      "content": "Hi Dominik,   \n   \nThis looks nice!   \nI don't think you went too far with the head serifs :-)   \n   \nf: I think it wants the same kind of terminal as your y and r. (Though I'd choose beaks not ball terminals.) Also, it curves too abruptly. Look at the c for more of the flavor.   \n   \nhmn: the h and n are too narrow. The m looks like 2 n's. keep the m, and widen the h and n.   \n   \nr: The arm joins to high (same place as the n). Lower that down for better color. I'd also make it narrower. (and do a beak like the f)   \n   \ns: I'd take a touch of weight out of the curves and put it into the spine.   \n   \nvw: take in the serifs a bit. These letters cause spacing problems as it is. More serifs mean too much white space around the letter.   \n   \nx: looks like he's just kicked a soccer ball. ie, the bottom right should extend below the baseline (too high now). Also, you are in the presence of an optical illusion:   \n   \n ![](http://web.archive.org/web/20150417090543im_/http:/www.typophile.com/forums/messages/29/21279.gif)   \n   \nSliding the thins left and right does two things:   \n1. Fixes the optical illusion and makes them look like they're connected.   \n2. Helps the shape fit into a trapazoid:   \n ![](http://web.archive.org/web/20150417090543im_/http:/www.typophile.com/forums/messages/29/21280.gif)   \nYou want the trapezoid shape so the letters don't feel like they are leaning, and are nicely balanced on the ground. Check your x,s,g,z   \n   \ny: A little wider up top (left)   \n   \np: decide what you want. I'd put a serif on the left side of the decender too. Keep the form for the q.   \n   \nKeep it up!   \nRandy\n\n"
    },
    {
      "time": "26 Nov 2003 — 8:52am",
      "content": "Thanks guys!   \n   \nto hhp: could be worse than \"barely\", think of \"pajero\"...   \n   \nto randy: a lot of stuff and very helpful. As soon as I checked those things you'll hear and see more.   \n   \nWhere does this optical illusion result from, or is it not explainable?\n\n"
    },
    {
      "time": "26 Nov 2003 — 11:00am",
      "content": "Hi Dominik,   \n   \nHere is another diagram that shows the optical illusion a little better:   \n ![](http://web.archive.org/web/20150417090543im_/http:/www.typophile.com/forums/messages/29/21352.gif)   \nHere is the nature of the optical illusion. The more acute the angle, the more adjustment is needed. A + would need no adjustment!   \n ![](http://web.archive.org/web/20150417090543im_/http:/www.typophile.com/forums/messages/29/21353.gif)   \nDoes that answer it?   \nRandy\n\n"
    },
    {
      "time": "26 Nov 2003 — 12:31pm",
      "content": "Hi Randy.   \n   \nSo it's a human fault. And this is what was meant by : \"typedesign doesn't always follow mathematical correctness\"(vaguely quoted). One of the sentences I could always accept but never really understood fully.   \n   \nStill working on apena.   \n   \nServus   \n   \nDominik\n\n"
    },
    {
      "time": "26 Nov 2003 — 1:27pm",
      "content": "Randy, nice.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Dec 2003 — 6:47am",
      "content": "I'm back again.   \n   \nI had a long fight with the uppercase. I couldn't really decide about the proportion of these. I didn't like them to have same width all over (as far as this is possible). So I took a base rectangle and tried to construct them.   \n   \nFurther I changed the lc \"s\" again and made it a bit narrower. I didn't like the look of two wide \"ss\" standing next to each other. (An \"ss\" ligature comes to my mind right now, because if the \"s\" stands alone at the beginning it looks a bit small now)   \n   \nNext thing I'll get done is the spacing. I played arround a bit and had some good results. (I used the summary in \"Type & Typography\").   \nBut after changing some character widths I quickly used FOG's autop spacing and lost it all again.   \nThe optical spacing feature in InDesign wasn't better though, the type seemed like \"gesperrt\" (I don't know the english term right now). I had to correct it by at least \"-50\" to get a good result.   \nSo I hope I can provide a text setting soon.   \n   \nThese were my problems so far. Next on the list are the Itallics. guess I'll have a lot of fun with them, too.   \n   \n   \nServus   \n   \nDominik   \n   \n ![apena serif](http://web.archive.org/web/20150417090543im_/http:/www.typophile.com/forums/messages/29/23018.gif)\n\n"
    },
    {
      "time": "13 Jan 2004 — 12:24pm",
      "content": "Finally I found time to complete the spacing and do the text setting, which you can see in the attached PDF.   \n   \nAfter printing out some pages, on my cheap low-res home printer, I felt the color of the face was a little to dark for longer texts. What do you think.   \n   \nI'm not a 100% sure about the Caps. Sometimes I think they're too high, sometimes I feel they're just right. I tried smaller ones but they also didn't satisfy me.   \n   \nI awarwness of legal issues: The typeface resulted from my own sketches. \"Nuri\" didn't influence the design process and my ideas nor have seen it before ;-).   \n   \nServus   \n   \nDominik\n\n<!--attachment: specimen-24048.pdf*mime_pdf.gif*application/pdf*59.2*apena+serif*specimen%2epdf --><!--attachment: specimen-24048.pdf*mime_pdf.gif*application/pdf*59.2*apena+serif*specimen%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150417090543im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">apena serif<br><a href=\"http://web.archive.org/web/20150417090543/http:/www.typophile.com/forums/messages/29/specimen-24048.pdf\" target=\"_blank\"><b>specimen.pdf</b></a> (59.2 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "13 Jan 2004 — 12:25pm",
      "content": "Finally I found time to complete the spacing and do the text setting, which you can see in the attached PDF.   \n   \nAfter printing out some pages, on my cheap low-res home printer, I felt the color of the face was a little to dark for longer texts. What do you think.   \n   \nI'm not a 100% sure about the Caps. Sometimes I think they're too high, sometimes I feel they're just right. I tried smaller ones but they also didn't satisfy me.   \n   \nIn awareness of legal issues: The typeface resulted from my own sketches. \"Nuri\" didn't influence the design process and my ideas nor have seen it before ;-).   \n   \nServus   \n   \nDominik\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<table>\n<tr>\n<td align=\"center\" valign=\"top\"> <img src=\"http://web.archive.org/web/20150417090543im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" alt=\"\"><br> 59.2 K </td>\n<td align=\"left\" valign=\"top\"> specimen.pdf<br> <b>\"apena serif\"</b> </td>\n</tr>\n</table>\n</td>\n</tr>\n</table>\n<p> </p>\n</center>\n"
    },
    {
      "time": "13 Jan 2004 — 1:01pm",
      "content": "Looking good! Your curves a bit wobbly though (like look at the \"c\" and the \"G\"). The ear of the \"q\" is too clotty. The \"r\" is too wide.   \n   \nWeight: It is slightly dark, even for my tastes. But in any case don't trust low-end printers: they make small text totally different (and darker) than the \"real\" (imagesetter) output.   \n   \nSpacing: A bit tight overall, but too irregular anyway. Look at \"molor\" on your second line for a benchmark of good spacing.   \n   \nCap size is fine - a bit big even. But the cap structures still need some work.   \n   \nhhp\n\n"
    },
    {
      "time": "14 Jan 2004 — 12:39am",
      "content": "Thanks for your tips hrant.   \n   \nI'm always astonished when I realize how obvious things are that I don't see by myself. But that's another topic.   \n   \nThe spacing issue: This was a first lousy effort now. Something deep inside me told me they're to tight. But then again, thinking of enconmical issues (which I should, with what I know, perhaps leave out right now) I wanted to have it tight, to be able to press as much text on one page as possible.   \n   \nThe relation lc/uc is 2/3. But I think due to the narrowness, as you claimed, I felt the smaller Caps I tried were way to small for Reading.   \n   \nHow do you normally fix those small bugs? I mean should there be some, do you always realize it or do they have to be pointed out by someone else?   \n   \nServus   \n   \nDominik\n\n"
    },
    {
      "time": "14 Jan 2004 — 7:43am",
      "content": "Well, Typophile is great for getting feedback. But another good way of seeing problems is to actually NOT look at the design for a while.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Feb 2004 — 2:18pm",
      "content": "You're second tip is very practical. I've reached one month now.   \n   \nServus   \n   \nDominik\n\n"
    }
  ]
}
