{
  "id": "2187",
  "title": "Show us your sketches!",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "i'm curious on everyones sketches ... is anyone willing to post some of his own? (handdrawn ones i mean). thanks: lars\n\n",
  "author": "lars",
  "time": "24 Nov 2003 — 7:44am",
  "uid": "2145",
  "comments": [
    {
      "time": "24 Nov 2003 — 9:24am",
      "content": "If you look at my post on Thursday, March 14, 2002 in this thread,   \n [http://www.typophile.com/forums/messages/29/805.html](http://web.archive.org/web/20131019092403/http:/www.typophile.com/forums/messages/29/805.html)   \nyou'll see the two ways I sketch, depending on what circumstances I'm in.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Nov 2003 — 12:35pm",
      "content": "I don't do much sketching, as I tend to work out stuff directly on the computer. But here is a picture of my sketches for the SBL Hebrew typeface. This is the first time I've used this approach: writing letters with a broad-nib pen. This was mainly of value in determining good proportions and for getting the relative weight of stems correct (especially the median weight of diagonal strokes that is important for Hebrew because of the steep ductus). If you compared these sketches to the final font, you would find that a lot of details are different, but the overall proportions of the letters are about the same.   \n   \n ![SBL Hebrew sketches](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/21171.jpg)   \n   \nYou should take a look at Jeremy Tankard's [website](http://web.archive.org/web/20131019092403/http:/www.typography.net/). In the 'history' section for each typeface, he shows pages from his notebooks.\n\n"
    },
    {
      "time": "25 Nov 2003 — 1:01pm",
      "content": "Here are some early sketches of one of my typefaces   \n(Coquette):   \n   \n ![coquette1](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/21251.jpg)   \n   \nYou can tell I was in a boring meeting when I did this one   \n(\"Information Gathering\"--ha!). I had a full-time job at the   \ntime. I was supposed to be taking notes, but I usually did   \ndoodles like this instead.   \n   \n ![coquette2](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/21252.jpg)   \n   \nBoth of these are actual size (at 72dpi) and are typical of   \nthe size I work at when I'm working on an idea for a   \ntypeface. I use to work larger, but I found that it is easier to   \nget the proportions I want at this size, maybe because it's   \ncloser to the size it will be used. My sketches don't get   \nmuch tighter than this either. I scan in the sketches and use   \nthem as a rough guide when I redraw the characters in   \nthe computer.   \n   \nHere are some unfiled sketches:   \n   \n ![sketches](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/21253.jpg)\n\n"
    },
    {
      "time": "25 Nov 2003 — 1:27pm",
      "content": "Here is a preliminary sketch from a recent lettering job I did. I wound up not using this version because a) I had trouble balancing the swash N with its terminals crossing both A\n\n"
    },
    {
      "time": "25 Nov 2003 — 3:27pm",
      "content": "Randy, are you left handed?\n\n"
    },
    {
      "time": "25 Nov 2003 — 6:05pm",
      "content": "John\n\n"
    },
    {
      "time": "25 Nov 2003 — 7:37pm",
      "content": "No, not the letterforms, just the shading pattern.   \n   \nSpeaking of shading in the context of sketching type, Gerrit Noordzij discusses a kind of shading as a sketching technique on pages 51-52 of _Letterletter_:   \n   \n_The moving counterpoint is conveniently represented by zigzag shading which evokes the shape very quickly. Different levels of articulation are reached with different densities of shading. The effectiveness and speed of this method can persuade students to abandon drawing outlines, and only then can design start. The speed also encourages them to make the alternatives they would otherwise only talk about. So we got used to a practice of discussing design by quickly shading the subjects of the discussion._   \n   \nI've experimented a little with this technique, and think it has a lot of value. Earlier this year, I watched Erik van Blokland sketch some letters in this way -- he's had a lot more practice at it than I have -- and was impressed by the speed with which one got a sense of letter as a solid thing.\n\n"
    },
    {
      "time": "25 Nov 2003 — 10:26pm",
      "content": "But of course GN's moving point/counterpoint is a direct violation of notan. By tying the two edges of the Black, you fail to fully control what _really_ counts in perception: the boundary between Black and White. If we mean to take the needs of the reader seriously, and we carry the GN theory to its terminus, its only justification is in effect WRBWWRM - and we know that's bollocks.   \n   \nAny simulation of a tool (a broad-nib pen) that's not actually used towards the given functionality (reading) is not Design, it's Art. It's a combination of insular self-expression and ideological lethargy. Any disciple of GN can make wonderful, usable fonts (in fact they would have an advantage in doing so, as so many Dutch designers have demonstrated). But he can never mark true cultural progress.   \n   \nDo you prefer the deep ocean, or the fish market?   \n   \nhhp\n\n"
    },
    {
      "time": "25 Nov 2003 — 10:43pm",
      "content": "Hrant, I considered leaving out the single mention of the moving counterpoint in my quote from Noordzij, because I don't think one has to accept that aspect of his ideas in order to appreciate the usefulness of shading as a technique in sketching type. It isn't even necessary to sketch in a way that represents the moving counterpoint.   \n   \nYou might consider this: shading letters produces immediate notan, while drawing outlines certainly does not. You can shade letters at a comfortable size -- a couple of inches tall for caps, say -- and immediately step back with a reducing glass\\* and get a sense of how they are going to work as type.   \n   \n\\* I thoroughly recommend all type designers invest in a reducing glass. Fiona Ross pulled one out of her bag when we were looking at some 144pt Arabic sketches a couple of years ago: it was wonderful because one could actually get a sense of how the letters were going to work at smaller size. Very useful device: almost as essential as a linen tester.\n\n"
    },
    {
      "time": "26 Nov 2003 — 7:44am",
      "content": "\\> appreciate the usefulness of shading as a technique in sketching type.   \n   \nThere's no doubt it's useful. It saves time and nicely abstracts the presence of the hand in the forms. But it ties you to the hand, so the results are regressive. The reader's eye never asked for help from the writer's hand.   \n   \nAs for notan, on paper shading gets you to a black shape faster, but there's good notan and bad notan. The act of shading creates a relationship between the two \"moving points\" at the extremes. You cannot have both that and a sound relationship between the black and the white. You cannot for example account for optical scaling or trapping. But most of all you're limiting yourself in structure. It's like exploring by hugging the coast of your own continent, while the liberation from the hand -and hopefully the subsequent reliance on the true nature of readability- is the astrolabe that allows the discovery of new continents.   \n   \nThe reason to draw outlines (and then fill them in, sure) is simply that that's what the represents what the reader sees. Shading represents more what the designer wants to express.   \n   \nBTW, didn't you say you generally draw directly on the computer anyway?   \n   \n\\> It isn't even necessary to sketch in a way that represents the moving counterpoint.   \n   \nAre you sure? How would somebody like van Blokland justify the deviation? They would see it as \"arbitrary\".   \n   \nBTW, what's the stronger reduction glass you've found?   \n   \nhhp\n\n"
    },
    {
      "time": "26 Nov 2003 — 11:30am",
      "content": "I disagree that shading, per se, necessarily ties you to either abstracting the presence of the hand in the forms or to any fixed relationship between the moving edges of the extremes. Noordzij uses shading in a particular way, but it is far from the only way. I'm interested in shading as a technique to put down ideas quickly, not to force my ideas into a particular model. Yes, I generally draw directly on the computer, but when I'm sitting in a cafe I sometimes draw letters and work out ideas that I later implement on the computer, usually without reference to the drawings, which are part of the thinking process not capital-D Designs.   \n   \n   \nMy reducing glass isn't particularly strong: it's a typical artist lense. Still very useful, especially if your office isn't big enough to stand far enough away from your screen to judge a typeface ![:-)](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "26 Nov 2003 — 11:32am",
      "content": "_Are you sure? How would somebody like van Blokland justify the deviation? They would see it as \"arbitrary\"._    \n   \nBut I'm not asking Erik to justify what I do. Something is only arbitrary if you don't have a reason for it. Heck, it doesn't even have to be a good reason to avoid being arbitrary. ![:-)](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "28 Nov 2003 — 5:02pm",
      "content": "here's something that was going to be a typophile shirt   \n...but it needed too much work and was filed away.   \n   \nBy the way, I know it says Typohile, sted of Typophile. ![:-)](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI just omitted the repeating letter, figuring I could fix it up nice and pretty   \nin Illustrator.   \n   \n   \n ![typop](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/21477.jpg)\n\n"
    },
    {
      "time": "28 Nov 2003 — 10:01pm",
      "content": "People would see that and think it's an advertisement for forums about typographical errors.   \n   \n:runs:\n\n"
    },
    {
      "time": "8 Dec 2003 — 7:32am",
      "content": "Great thread!   \n   \n ![Typosketch by aaron](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/21975.jpg)   \n   \nMost of my sketches wander around between a bunch of different styles. This sketch is typical in that almost all the glyphs drawn are forgetable with just a few that might be worth mining later. All my sketches happen during class since I've noticed that I can sketch and pay attention to lectures at the same time. Fortunately listening and drawing don't seem to use the same part of my brain.\n\n"
    },
    {
      "time": "11 Dec 2003 — 6:14am",
      "content": "Hi Aaron,   \n   \nI been missing your posts over here at typophile. I just visited your site for the first time in ages. Nice work on the more contemporary text face. In the end I guess it doesn't matter if you think it will work for 100pages, others will do with it what they want :-) I think it works! Second, you mention you've been working on wedge. Mind showing us an update?   \n   \nAll that to say, i've very much liked your style and approach. In my opinion you are ready for the bright lights of public distribution. Have you sent off any of your designs?   \n   \nCheers!   \nRandy\n\n"
    },
    {
      "time": "11 Dec 2003 — 8:25am",
      "content": "Aaron, you really need to keep us updated! :-) You could say that anybody who's truly interested in your stuff will check your site periodically, but some of us have too many links floating in our heads -and no ability to organize them- to keep on top of it all!   \n   \nI think 009 is entirely a text face - and a sufficiently novel one - reminds me of Whitman (a GoodThing). It just needs a little bit more weight to hold the necessary tight letterspacing together. And my only \"micro\" complaint is that the right foot serif of the \"r\" should be longer.   \n   \nThat Helvetica stuff is pretty cool!   \n   \nAs for the optical work on Wedge, I think you're on the right track. Besides the xheight though you should increase the \"openings\" too, like the eye of the \"e\" and the top-left valley of the \"n\".   \n   \nhhp\n\n"
    },
    {
      "time": "22 Feb 2004 — 5:19pm",
      "content": "![](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/22443.jpg)\n\n"
    },
    {
      "time": "16 Dec 2003 — 5:52am",
      "content": "Here's a quickie from yesterday. I'm working the hands into a larger type illustration for my Custom site.   \n   \n ![hands sketch](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/22483.gif)\n\n"
    },
    {
      "time": "16 Dec 2003 — 6:53am",
      "content": "That guy is hilarious.\n\n"
    },
    {
      "time": "16 Dec 2003 — 8:09am",
      "content": "Nice lettering, Caleb. What is it for?\n\n"
    },
    {
      "time": "18 Dec 2003 — 6:33pm",
      "content": "\\>\\>But of course GN's moving point/counterpoint is a direct violation of notan   \n   \nSounds interesting. Any links to elaborate on this notan business?   \n   \nkris\n\n"
    },
    {
      "time": "18 Dec 2003 — 6:50pm",
      "content": "Surf Report was a sketch for a family newsletter in comic form. Squatch was sketched as a title for another comic. Old stuff. Just been digging around in the Dylan archives this week... ![surf report](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/22688.jpg)\n\n"
    },
    {
      "time": "18 Dec 2003 — 6:51pm",
      "content": "Squatch: ![squatch type sketch](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/22691.gif)\n\n"
    },
    {
      "time": "18 Dec 2003 — 10:53pm",
      "content": "\\> Any links to elaborate on this notan business?   \n   \nWell, you can look up \"notan\" in Google, but none of it that I know of is applied to type design. Ironically, the main person who has been \"documented\" extolling the virtues of notan in type (although he doesn't call it that) is Noordzij! Ironic, because you can't have good notan when you favor the Black (as all chirography does).   \n   \nhhp\n\n"
    },
    {
      "time": "18 Dec 2003 — 11:52pm",
      "content": "_...you can't have good notan when you favor the Black (as all chirography does_   \n   \nThat's a pretty funny statement if you consider that one of the most widespread and obvious applications of notan in Japanese aesthetics is calligraphy.\n\n"
    },
    {
      "time": "19 Dec 2003 — 12:00am",
      "content": "It's not just funny, it's hilarious.   \nI guess the Japanese make mistakes too - just look at Pearl Harbor.   \n   \nOn the other hand, you could say that good notan depends on the purpose of the given design - like how there's a difference between display and text type. So you could say that notan in calligraphy (something serving to convey humanity expressively) has different requirements than notan for a text font (something serving to convey textual content smoothly).   \n   \nhhp\n\n"
    },
    {
      "time": "19 Dec 2003 — 5:08am",
      "content": "\\> [...] one of the most widespread and obvious   \n\\> applications of notan in Japanese aesthetics is   \n\\> calligraphy.   \n   \nSo Hrant completely distorted the original meaning of this word?... Anyway, if 'notan' = 'relationship between black and white', then it's obvious to me that good notan for Japanese is one thing, good notan for Latin is another completely different thing, almost the opposite.   \n   \nBTW, what's the difference between 'notan' and 'color'?\n\n"
    },
    {
      "time": "19 Dec 2003 — 5:11am",
      "content": "BTW:   \n\\> I guess the Japanese make mistakes too   \n   \nEveryone makes mistakes. ; )\n\n"
    },
    {
      "time": "19 Dec 2003 — 9:19am",
      "content": "Distorted? If I'm using the word confusingly, let me know and I'll find another - I even enjoy that! But nobody can own a concept (except if you have a beefy legal department, I guess), and when I say notan I mean the idea that Black and White are part of one thing, and in a given purpose their relationship has to make sense. Certainly favoring the Black makes sense in calligraphy for practical reasons, but in digital type design (where you make outines) they are essentially of equal importance - even though they exist in different forms: the Black is defined atomically, while the White is defined partly atomically (the insides of letterforms) and party through groupings of multiple letters.   \n   \nAs for the difference between Japanes and Latin type design, certainly optimal notan is different for each (partly due to the current state of each on the evolutionary path away from chirography) - but I don't think it's fundamentally different. An actual fundamental difference is between display and text type, both of which of course exist in both scripts.   \n   \nIn text design, good notan is [mostly] good boumas.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Dec 2003 — 10:26am",
      "content": "\\> If I'm using the word confusingly [...]   \n   \nWell, sometimes it's really confusing, maybe because   \nit's too abstract in your definition?   \n   \n\\> But nobody can own a concept [...]   \n   \nOk, I wasn't trying to accuse you of anything... Sorry.   \n   \n\\> when I say notan I mean the idea that Black and   \n\\> White are part of one thing, and in a given   \n\\> purpose their relationship has to make sense.   \n   \nI guess I understand it, but, again, isn't this too   \ngeneric?   \n   \n\\> in digital type design (where you make outines)   \n\\> they are essentially of equal importance [...]   \n   \nOk, agreed.   \n   \n\\> As for the difference between Japanes and Latin   \n\\> type design, certainly optimal notan is different   \n\\> for each (partly due to the current state of each   \n\\> on the evolutionary path away from chirography) -   \n\\> but I don't think it's fundamentally different.   \n   \nBut, the fact that Latin text requires 'even color' (space   \nbetween letters = space inside counters) while in   \nJapanese any attempt to evenness is impossible; isn't   \nthis a fundamental difference too (regarding notan)?\n\n"
    },
    {
      "time": "19 Dec 2003 — 11:00am",
      "content": "\\> it's too abstract in your definition?   \n   \nLet me try this:   \nNotan is the relationship between but also the unity of positive and negative spaces. Like Yin/Yang.   \n   \nI guess it's sort of \"metaphysical\", but at least you can show examples in black & white, so to speak!   \n   \n\\> isn't this too generic?   \n   \nIf by \"generic\" you mean \"too theoretical\", then I would point to a gem of an example that brings it all into the real world: chirography says that the two edges of the black must be related - this means you can't really contol notan fully - this can only be done through _outlines_. Chirography precludes optical effects, trapping, and all those _typographic_ subtleties. It's kiddie type design.   \n   \nIf you mean \"obvious\", I would raise a caution: Noordzij talks the talk when it comes to notan, but his \"moving front\" clearly violates notan's primacy (in the realm of type if not chirography). It's sweetly ironic that the wonderful formalization of chirography performed by Noordzij allows one to fight it better. Without his \"help\", I for one wouldn't have such a solid explanation of how chirography fails.   \n   \n\\> Latin text requires 'even color' .... while in   \n\\> Japanese any attempt to evenness is impossible;   \n   \nHey, you've make me realize something great! Japanese is a great counterpoint (pardon the pun) against mainstream beliefs about what Latin type should be: Totally even color\\* is bad for readability (no matter the writing system). Sure Japanese is much harder to enslave in terms of even color, and maybe that makes it \"snap out of it\" and not suffer under such a fallacy. The uneven color in Janapese is actually a huge functional benefit. Latin has yet to grasp that (although it has had a hint of it in the past, like in some Eastern European efforts).   \n   \n\\* BTW, I forgot to address a previous question of yours: the difference between color and notan is that the former is merely a measure of darkness. The idea of Texture though is another animal, but you could say it fits within notan nicely. As for Rhythm, there is none.   \n   \n--   \n   \nSomething else about the origins of the term \"notan\": as far as I know the Japanese use it within calligraphy, rock gardening, and many other forms of expression. I would propose that it's not well suited to any calligraphy that needs to convey textual content, and if I were a Japanese calligrapher (something twice removed from reality :-) I would start a new school were you draw hair-thin outlines, not bodies.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Dec 2003 — 2:09pm",
      "content": "_...if 'notan' = 'relationship between black and white'..._   \n   \nActually, 'black and white' is misleading. Notan is about 'dark and light', not just the extremes of black and white. One of the most important traditional uses of notan is in _sumi-e_ painting, which typically involves a full range of greys.\n\n"
    },
    {
      "time": "19 Dec 2003 — 2:12pm",
      "content": "That's an interesting elaboration, but in the realm of type design let's worry about the binary situation first!   \n   \nhhp\n\n"
    },
    {
      "time": "19 Dec 2003 — 3:06pm",
      "content": "Hrant,   \n\\> I guess it's sort of \"metaphysical\",   \n   \nYes, it is.   \n   \n\\> but at least you can show examples in black &   \n\\> white, so to speak!   \n   \nThen please show us some examples of good and bad notan! (best in a new thread ;-)   \n   \n\\> chirography says that the two edges of the black   \n   \nPardon the ignorance: what are the 'two edges of the black'?   \n   \n\\> [...] Without his \"help\",   \n   \nI haven't read his 'Letterletter' (yet), but I've heard that he is less dogmatic than you consider him to be...   \n   \nBTW, you're using this 'notan' concept just to deny chirographic type. First, I think you don't need to go that far to do that, and second, I'd like to _see_ an example of (what you think it is) _good_ notan.   \n   \n   \nJohn:   \n\\> Notan is about 'dark and light', not just the   \n\\> extremes of black and white.   \n   \nCorrect. I'm with my Japanese dictionary here, and 'no-tan' is defined as 'light and shade'. 'No' means dark, dense, while 'tan' means shallow. It's a density-thing, not a duality-thing...\n\n"
    },
    {
      "time": "19 Dec 2003 — 3:18pm",
      "content": "Eduardo, I will write an article on this, not just a post. Patience, grasshopper! ;-)   \n(And your instincts are right: the refutal of chirography is one of the lesser things notan is good for.)   \n   \nI will just point out this to clarify for now: in chirography, the \"two edges of the black\" are related by their being at the extremes of the moving broad pen.   \n   \n--   \n   \nThe essential problem with Noordzij isn't that he's deceptive or unintelligent (in fact he seems to be the opposite of those things), it's that he has no respect for typography. As Kinross has conveyed in a now-obscure article, Noordzij sees printing as a fall (compared to handwriting). And that's actually reflected in my own \"micro-impressions\" of his writings: his opinions make sense in proportion to their _distance_ from type.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Dec 2003 — 4:45pm",
      "content": "\\> I will write an article on this   \n   \nSounds great, Hrant.   \n   \n\\> the \"two edges of the black\" are [...]   \n   \nThanks, I think I got it.\n\n"
    },
    {
      "time": "19 Dec 2003 — 6:34pm",
      "content": "_I will just point out this to clarify for now: in chirography, the \"two edges of the black\" are related by their being at the extremes of the moving broad pen._   \n   \nIn broad-nib chirography, yes. A more general description would be that, in chirography, the edges of the black are determined by the nature of the writing tool. If the writing tool is a pointed split nib or, referring back to Japanese calligraphy, a brush, the relationship of the edges of the black are determined by pressure. The key aspect of chirography is that it is made up of strokes, not outlines, so the relationship of the edges of the black is always the relationship of two sides of a single stroke.\n\n"
    },
    {
      "time": "21 Dec 2003 — 2:02pm",
      "content": "also loving this thread, but lets see some more sketches now?\n\n"
    },
    {
      "time": "28 Dec 2003 — 12:19am",
      "content": "a little before and after action.   \n   \n ![sketches](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/23024.gif)   \n   \n-phillip\n\n"
    },
    {
      "time": "28 Dec 2003 — 12:22pm",
      "content": "Here\n\n"
    },
    {
      "time": "28 Dec 2003 — 2:08pm",
      "content": "Heh, when I saw that \"h\" I immediately thought of Dr. Seuss for some reason.\n\n"
    },
    {
      "time": "29 Dec 2003 — 8:10am",
      "content": "\\> _Grant - make a typeface out of that delightful scribbling_   \n   \nDo you mean the letters? Or the doodling? Or both?   \n   \nMan, I need to get to work on this stuff...\n\n"
    },
    {
      "time": "29 Dec 2003 — 9:06am",
      "content": "Hrant:_...if I were a Japanese calligrapher (something twice removed from reality :-) I would start a new school were you draw hair-thin outlines, not bodies._   \n   \nThis still strikes me as a highly artificial way of arriving at your precious notan: you need to know exactly what the filled in result is going to look like even as you are drawing the outlines. It seems to me that there is much to be said for working directly with the notan, i.e. in solid black and white, and your objection to stroke-based processes doesn't necessarily preclude other methods. A couple of possibilities:   \n   \n1. Design type on black scratchboard, removing the surface to expose the white area in and around the black letterforms.   \n   \n2. Design type on black paper using white paint to define the space around and within the letterforms.\n\n"
    },
    {
      "time": "29 Dec 2003 — 9:32am",
      "content": "I dont no nutin about this notan, but I wonder if any of you have ever watched a master Japanese or Chinese calligrapher write out a poem.   \n   \nThe ones I have watched stand there for several moments meditating on the paper in front of them, and then abruptly begin writing. Its over almost before it starts, pure expression and emotion from the master through the brush to the paper. Hardly a moment to think.   \n   \nJust an observation.   \n   \nNow back to the nothing of notan.\n\n"
    },
    {
      "time": "29 Dec 2003 — 10:45am",
      "content": "\\> you need to know exactly what the filled in result is going to look like   \n   \nHere you're touching on what might be called \"arbitrariness\", and this is in fact one reason some people love chirography: it brings a tangible order to creation, since a physical tool (either in the first-hand or virtually) helps you decide where things end up. That's why I say that chirography is a great practical shortcut.   \n   \nBut the catch is two-fold:   \n1) There's no reason to believe that the reader needs what the hand favors.   \n2) Control shouldn't be the objective. Letting go -accepting the arbitrariness of it all anyway- helps you escape the confines of chirography.   \n   \nThe reason the \"moving front\" precludes good notan (a notan that the _reader_ needs) is simply that the White is made subservient to the Black (and it doesn't matter what color the two are). It is made subservient to satisfy the creator, but at the expense of the user.   \n   \nThe tricky thing though is that -in type design- you can't create the White the same way as you create the Black. In Latin type design especially with its \"atomic\" Blacks it's hard to take the White seriously: it exists in a half-world - some of it is internal to the Black, but some of it takes shape only when multiple Blacks come together - something that happens outside the control of the type designer. This complexity makes chirography even more appealing... but it's still a cop-out.   \n   \n--   \n   \nJames, I've only seen oriental calligraphy on TV, but I respect it because it doesn't pretend to be anything besides self-expression - Art. It doesn't pretend to be very good at conveying the literal text. The same goes for that Jack Stauffacher stuff\\*: I don't mind people setting very large type in color at an angle and slamming the letterpress as long as they admit to doing it as self-expression.   \n   \n\\* [http://www.creativepro.com/story/feature/20603.html](http://web.archive.org/web/20131019092403/http:/www.creativepro.com/story/feature/20603.html)   \n   \nBTW, oriental calligraphers certainly don't think notan is nothing.   \n   \nhhp\n\n"
    },
    {
      "time": "29 Dec 2003 — 11:14am",
      "content": "\\>BTW, oriental calligraphers certainly don't think notan is nothing. \\<   \n   \nIn this context, I object to the word \"think\".\n\n"
    },
    {
      "time": "5 Jan 2004 — 7:23am",
      "content": "Here are some of my sketches. I don't sketch a lot on paper, but seem to 'construct' a lot in the computer, because I have a very clear view on how the font has to look.   \nI now want to try to first sketch out a font and then digitize it. I want to work more detailed on the curves.   \n   \n ![Nordic(c)ReneVerkaart](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/23361.gif)   \n   \nFor more details go here:   \n [http://www.typophile.com/forums/messages/29/23351.html?1073315465](http://web.archive.org/web/20131019092403/http:/www.typophile.com/forums/messages/29/23351.html?1073315465)   \n   \n ![Nantua(c)ReneVerkaart](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/23362.gif)   \n   \nFor sale at Union Fonts   \n [http://www.unionfonts.com/new/rene.html](http://web.archive.org/web/20131019092403/http:/www.unionfonts.com/new/rene.html)   \n   \n ![Vagebond(c)ReneVerkaart](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/23363.gif)   \n   \n   \n   \nGreetings,   \nRen\n\n"
    },
    {
      "time": "5 Jan 2004 — 10:41am",
      "content": "Ren\n\n"
    },
    {
      "time": "16 Jan 2004 — 3:09pm",
      "content": "Wow, I'm happy I stumbled across this site. I have these very preliminary sketches of a logo for a truck decaling company. I wish I had a camera around so I could show more detailed ones. I just began putting the ideas into Illustrator yesterday. I'm just excited to see so many awesome sketches. Feel free to crit my stuff if you want, too. The helmet is still pretty crappy. ![vikingsketch1](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/24294.jpg) ![vikingsketch2](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/24295.jpg) ![logo1](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/24296.gif) ![logo2](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/24297.gif) ![logo4](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/24298.gif) ![typedetail](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/24299.gif) ![logo3](http://web.archive.org/web/20131019092403im_/http:/www.typophile.com/forums/messages/4100/24300.gif)\n\n"
    }
  ]
}
