{
  "id": "219",
  "title": "Archive through January 06, 2002",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "This is my first post, but anyway, I was thinking that House Industries makes a darn good living doing what they do. What is it five, or six guys. My customer number is in the 28,000s and their boxed sets, love them or hate them, seem popular among people I know. I've bought four of them.   \n   \n[Anonymous #1]\n\n",
  "author": "anonymous",
  "time": "30 Sep 2001 — 8:19pm",
  "uid": "1203",
  "comments": [
    {
      "time": "2 Oct 2001 — 10:40pm",
      "content": "Paul! You've pointed out two great designers we overlooked in this discussion so far. To my embarrassment I thought Frutiger wasn't still with us, but here he is at the Linotype site:   \n [http://www.fontexplorer.com/isroot/FontStore/content/00\\_home/content/home\\_05b\\_fdesigner\\_f/frutiger/frutiger.html](http://web.archive.org/web/20150414063140/http:/www.fontexplorer.com/isroot/FontStore/content/00_home/content/home_05b_fdesigner_f/frutiger/frutiger.html)   \n(This is a frame from their slow-loading frame-ridden site.)   \nCheck out his birthday pix.   \nAnd here is Slimbach at Adobe:   \n [http://www.adobe.com/type/typedesign/slimbach.html](http://web.archive.org/web/20150414063140/http:/www.adobe.com/type/typedesign/slimbach.html)   \nI wonder if these guys ever troll through the web and read stuff like Typophile...\n\n"
    },
    {
      "time": "2 Oct 2001 — 11:43pm",
      "content": "Hi Mart,   \n   \nThanks for the links. What a grouping at Adrian Frutiger's party - I was especially impressed at the shot of Frutiger and Zapf together.\n\n"
    },
    {
      "time": "3 Oct 2001 — 9:28am",
      "content": "Did you see the pic of \"Univers\" in the fireworks display? It made me smile.   \n   \nThe Lesson: Never mix pyrotechnics and modern gothics.   \n   \n//joe\n\n"
    },
    {
      "time": "4 Dec 2001 — 9:21pm",
      "content": "And I'm the Queen of England.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Dec 2001 — 9:43pm",
      "content": "I agree Hrant. If Anonymous could name names then we'd have something to chew on. A few years ago, when I was more passionate about my own designs, I thought it would be a great endeavor - to craft fonts for a living. Nowadays, I get font design ideas several times a week, like I imagine many readers of this forum do. Some of them I sketch out on paper, and some I file in the back of my head: a mix of Bodoni and Eurostyle - yes! That's it - the next great font phenomenon! But none of these will ever get past the sketch stage. It's simply not worth the effort - commercially.   \nIf there are T-26, or P22, or Chank, or Font Bureau submitees or whoever you care to shake a stick at reading this forum who do indeed make more than pocket money from their designs then please step forward and tell us how it's done. We're dieing to know and we have no intention of ripping you off by copying you! And if there are any major font publishers out there, then please make the case for us as to how it is worth spending Xhundred hours developing a font/font family for $1 or less per hour.\n\n"
    },
    {
      "time": "5 Dec 2001 — 10:26am",
      "content": "\\> there's the bloke and his two helpers, the   \n woman in the west...   \n   \nI have no idea what you mean here, but it's   \nvery entertaining.   \n   \nI can dig your desire to withhold your name   \non the Web. Still, it appears pretty shady to   \ngo Anonymous here where everyone else   \ngoes by name. (Maybe shady is your game.)   \n   \nAs it is, people are dismissing your points   \nbecause you come off like a tough guy with a   \npantyhose over his head. You have some fine   \ninsights, sir/ma'am - show thyself.   \n   \nStephen\n\n"
    },
    {
      "time": "5 Dec 2001 — 10:43am",
      "content": "Stephen: I agree with you. Anonymous makes some interesting points, and it is nice to see criticism with some teeth for a change. It does tend to be a little soft in some of the critique forums, although people here seem to be very astute on purely typographical matters, and the level of expertise in many discussions is very high indeed. Personally I refrain from posting negative comments on designs I don't like. I'd rather just keep out of it, and I don't want to pretend my taste in design is better than anyone else's - so I guess I've been adding to the softness of the critique here. But let's at least keep it amicable.\n\n"
    },
    {
      "time": "5 Dec 2001 — 11:33am",
      "content": "I doubt Christian Schwartz earns most of his keep   \nfrom type design. But even if he did, he doesn't now.   \nNow he breeds Alpaca...   \n   \n [http://www.orangeitalic.com/](http://web.archive.org/web/20150414063140/http:/www.orangeitalic.com/)\n\n"
    },
    {
      "time": "5 Dec 2001 — 12:06pm",
      "content": "Anon: it would help if you qualified these with url's and other sources to refer to. There's a lot of people I've never even heard of. And anyway, if you're prepared to go to these lengths, then how would you define the parameters?\n\n"
    },
    {
      "time": "5 Dec 2001 — 12:56pm",
      "content": "Guys, focus.   \nWhat's the point of this thread? Of course it's different for each of us, but practically speaking to me it's a way to measure (albeit informally) the viability of physically spending time doing type design (which does not include lettering, logo design, oriental calligraphy, etc.) This necessarily means we can't factor in what \"making a living\" really means; each of us would have to skew the \"results\" of this list based on his/her own lifestyle/circumstances. Once we have a good (never perfect) list, each of us can look at it and say, for example: \"From what I know, about half of those 20 people seem to live too modestly for my tastes, so for me the list is actually around 10\". No absolute list is going to work for everybody: so it has to be inclusive, but not imprecise.   \n   \nThe only way I see that this thread can have any real value is if the list is defined somewhat narrowly, by simplifying the parameters: so I think the list should contain the names of individuals who currently earn enough money directly from their own personal time spent designing type to substancially sustain a lifestyle they consider satisfying. It doesn't have to be 100% of their income, but it does have to be enough on its own to maintain the person in a relatively happy state. Yes, this is all subjective, but that can't be avoided, and picture this thread if we tried to factor in more parameters...   \n   \nIf there is a better way to make this thread \\*productive\\*, please explain. If not, that list of 52 for example holds no water at all, I'm sorry to say. There are people on it who no longer design type, a person I know for a fact has had to start working as a waiter because he couldn't make a living in type design, a person who has released for sale a single -and unpopular- font in his entire \"career\", and a bunch of others who aren't even close to making any such list.   \n   \nLet's agree what the list \\*is\\* before we argue for the sake of confrontation...   \n   \nhhp\n\n"
    },
    {
      "time": "5 Dec 2001 — 1:35pm",
      "content": "I agree that the list should include custom type work.   \n   \n\\> So we all do things \"on the side\".   \n   \nDo accountants do things on the side? Why not? Doing things on the side is fine if you enjoy it (and I do). But if I do things on the side because doing more of what I really want to do (type design) doesn't pay \\*enough\\* of the bills (not just a few), then I'm not on the list.   \n   \nAs for the difference between type and not:   \nIt's not just an \"eye\" for it. Type design involves things that lettering or any other letter-related art/craft does not (and the other way around too). Moving between them is fine, and people have different reasons for doing so, but the distinction is important, not least in coming up with a \"list\".   \n   \nhhp\n\n"
    },
    {
      "time": "5 Dec 2001 — 2:41pm",
      "content": "Well, you're right that it's not the number, it's the conclusion. I myself agree with your conclusion, but my impression is that the people behind the \"revival\" of this thread don't. The only real problem with our disagreement is that it might affect the life-choices of the undecideds.   \n   \nBTW, forget thousands: if it is/were even close to 300, I'd be happy.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Dec 2001 — 2:53pm",
      "content": "We might as well just pack up and go 'ome...   \n   \nFont design always was a labor of love, and personally that's all it will remain for me. I think it's safe to say that a graphic designer who doesn't enjoy type could not be forced at gunpoint to design a four font family with complete character sets. There again, I've never met a graphic designer, even a bad one, who didn't like fonts.   \n   \nAnon's list is not valid in my opinion if they can't back up the names with other points of reference to assess their validity, notwithstanding the supposed subjectivity of the \"making a living\" parameter. I always understood the definition to be someone whose main income was from font design. We already went over this, though. Side work does not invalidate a candidate, but it does factor into the hypothetical question of if you took that away from them, would they soon become bankrupt on font design income alone.\n\n"
    },
    {
      "time": "5 Dec 2001 — 3:01pm",
      "content": "Clive:   \n\\> I think to be on \"the list\" you have to be able to make the \"choice\" about what you want to work on.   \n   \nThat's a cool way of looking at it.   \n   \n\\> You know, type was a sideline for Eric Gill, but didn't he make something of it?   \n   \nMan, if Gill were a full-time type designer...   \n   \nhhp\n\n"
    },
    {
      "time": "5 Dec 2001 — 7:46pm",
      "content": "\\> It's a completely different story if you want to narrow the list down to people who SOLELY design type.   \n   \nI personally don't think it should be that narrow. We should simply try to include people who make \\*enough\\* money from type design (and only type design - that's the topic here) to keep them financially stable with no other income. If you spend weekends restoring the lettering on rich people's tombstones to support your lifestyle, then you're not on the list.   \n   \nSo I think your list is way too inclusive.   \nMany of the people on there are \\*way\\* off, come on.   \n   \n\\> My other point is that a list is pointless, a red herring.   \n   \nI might agree with that.   \n   \n\\> If someone is considering\n\n"
    },
    {
      "time": "5 Dec 2001 — 9:49pm",
      "content": "I just thought of this spin-off question:   \nTo be a full-time type designer, is it better to be single, or at least not have kids?... :-\\>   \n   \nIf there's a strong correlation between being a type designer and having no dependents, maybe that's another indication that there's not enough money in the field.   \n   \nOr maybe it's just a matter of type designers being generally too bullheaded to have a \"partner\"? :-)   \n   \nhhp\n\n"
    },
    {
      "time": "6 Dec 2001 — 5:19pm",
      "content": "\\>\\> 1. To be a full-time type designer, is it better to be single, or at least not have kids?... :-\\>   \n   \n\\>\\> 2. If there's a strong correlation between being a type designer and having no dependents, maybe that's another indication that there's not enough money in the field.   \n   \nAS A FATHER OF TWO, I would assume that question 1 is asked by someone who does not have kids. ![:)](http://web.archive.org/web/20150414063140im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nIf you are a type designer or any occupation, and have nothing else going on in your life, you will of course be more prolific in your chosen endeavor because you will have hundreds (thousands?) more hours of free time in year. Is that better? Any parent would say No. Someone obsessed with a career may put off a family or love interest because they have goals to fulfill, or even type libraries to build. These are choices that individuals make every day. But the two don't have to be mutually exclusive. You just have to strike a balance. You are not working on your typefaces when you are teaching your kids about volcanos or answering questions like, 'Why can't humans live on Jupiter?' When you have kids, the best time to work on type is after the kids go to bed.   \n   \n2. Just an outsider's evaluation: There is money in the field, but only for those who can consistently apply themselves to the craft and learn HOW to make money. Everybody knows it's long hours hunched over a computer moving around anchor points. The people who have a career in type (some of them on the Typophile 50) ![:)](http://web.archive.org/web/20150414063140im_/http:/www.typophile.com/forums/clipart/happy.gif) have learned that you can't just make brilliant faces, but you have to network, market, have some good timing and act smart when big companies come calling. ![:)](http://web.archive.org/web/20150414063140im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n   \nbj   \n   \np.s. does anyone care for the word 'hobby'? Not a good word. Designing type, or even just eyeballing type, might better be described as a 'passion' or a side interest' , depending on the severity of your condition.\n\n"
    },
    {
      "time": "7 Dec 2001 — 10:31am",
      "content": "Real quick t'philes - I never cared much for the whining/complaining in this thread so when it went off on the 'blokes and pantyhose' tangent up a ways on the thread, I was irritated and wrote a reply (Wednesday, December 05, 2001 - 10:39 am --This thread is all over the place...) and clicked on the 'anonymous' radio button. I shouldn't have clicked on anonymous but I did. Sorry. This isn't how I live my life so it has been bothering me. I won't be anonymous again, I'll just say what's on my mind and live with the consequences.   \n   \n   \nbj\n\n"
    },
    {
      "time": "7 Dec 2001 — 11:37am",
      "content": "BJ da man.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Dec 2001 — 4:03pm",
      "content": "I could not resist this one.   \n   \nWhat if one married someone that was as passionate about type as oneself? This could help, no?\n\n"
    },
    {
      "time": "7 Dec 2001 — 4:19pm",
      "content": "You're kidding, right?   \nConsidering what most type designers are like, I would predict a murder/suicide deal within a month. :-)   \n   \nhhp\n\n"
    },
    {
      "time": "7 Dec 2001 — 5:21pm",
      "content": "No. If one partner were more of the designer and the other perhaps more of an historian, let's say, this could be a wonderful thing.   \n   \nAs for this list. Is it mandatory that one of the designs be from 2001?\n\n"
    },
    {
      "time": "7 Dec 2001 — 9:48pm",
      "content": "Clive:   \nFull-time \\*type\\* designers? No we haven't. For one thing, that list of 52 is much more than half wrong, using any decent benchmark. However, I no longer think 20 is too high. But 300 is completely lala-land.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Dec 2001 — 10:09pm",
      "content": "Nah, but I \\*am\\* objective.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Dec 2001 — 6:11pm",
      "content": "Clive, with every post you make it becomes clearer that you're counting something different than [most of] the rest of us - only ~3 of the people you've just named fit the bill, and the fact that that's in \\*London\\* works against your argument...   \n   \nYou're intelligent enough to figure things out, so there   \nmust be another reason for your drowsy judgment.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Dec 2001 — 8:37pm",
      "content": "Clive: No need to get shirty about it. Let's keep this civilized.   \n   \nMy assertion was part guess, part assertion, part provocation to discussion. I don't think I know the real answer any more than you do. And I certainly don't think you're right based on my understanding of the parameters. But I don't think we've successfully established the parameters, let alone agreed on them.   \n   \nPerhaps someone might start a project: Contact all those in the biggest list that was up for argument here and pop the question to them. If successful, it might serve as the basis for some sort of \"State of the Profession\" report.   \n   \nI don't know. If I think about putting myself in their position, then I can imagine that I'd be quite straightforward with the answer and not pretend either that type design was more or less financially rewarding to me. Some people might just say \"mind your own business\", but we might get enough data to form a more precise answer to our question here.\n\n"
    },
    {
      "time": "8 Dec 2001 — 9:14pm",
      "content": "Random thoughts to help push this thread into 2002.   \n   \n(Theater of the Absurd 1)   \n   \nDuring the past 15 years, TENS of THOUSANDS of typefaces have been digitized, a lot of them by foundries working from their existing 'paper' libraries. Somebody did (is doing) all that work. They are making a living at it. So should we at least acknowledge major foundry 'house' designers that 'fontify' in the shadows with no credit ever given to their 'work'. I'm not talking about Adobe. I'm talking about Image Club, E & F, DsnHaus and that ilk.   \nCan anyone pinpoint how many major foundries this involves?   \n   \n   \n(Theater of the Absurd 2):   \n   \nThere are dozens of companies that digitize handwriting and make it into a font. These are not type designers buy they make a living designing, er, compiling type.   \n   \n(Theater of the Absurd 3):   \n   \nHasn't every major profession been featured in a film or movie or book? Are there any instances of a type designer being portrayed in any of these mediums? What about a lettering artist?   \n   \n   \n\"I am not a type designer, but I play one on TV.\"   \n   \nbj\n\n"
    },
    {
      "time": "8 Dec 2001 — 9:18pm",
      "content": "\\> I think we're counting people who earn most of their income from type design, right?   \n   \nNo.   \nJust looking at the title of this thread -not to mention pretty much all the posts until its revival (we might also discuss the real -and very petty- reasons for that revival, two full months after the thread had died down)- should make it clear that we're talking about MAKING A LIVING. If you cut my income to 51% of what it is now, you can bet I would no longer be making even \\*close\\* to a living. People don't save up big chunks of what they make to account for their field running low on money. They \\*spend\\* it, and/or \"ramp up\" their lifestyle. For example, I can think of a co-owner of a medium-sized font house who certainly makes some money from his/her own designs (maybe even 51% - although that would surprise me greatly), but if you cut his/her income from the fonts of \\*others\\* in the library, his/her whole life would fall apart! That person might be on \\*your\\* list, but never on \\*this\\* one.   \n   \nNow, why do I insist that the list be restricted to people who can live as they expect to live \\*exclusively\\* through type design? Not because I want the list to be very short. Believe me, what would make me most happy is if I could justify devoting more time to this wonderful craft. It's because:   \n1. This thing needs as much focus as it can get. Any extra arbitrariness (like going for your \"most of his income\") would make this much trickier than it already is, much trickier than it needs to be.   \n2. It's the friggin' point of the whole thread!   \n   \nNow, if you want to have a list that includes people who make only \"most\" of their income through type design, or even merely \"some\" of their income, or if you want to make a list of \"insiders\" (ignoringing that knowing people and things about people does \\*not\\* make you somebody who designs type for a living), then that's fine, do whatever turns you on. Start your own thread, and I even promise to take it seriously. But please don't derail \\*this\\* effort.   \n   \n\\>What you seem to want to count is anything that supports your initial assertion that there were 10 full time type designers in the world.   \n   \nYou're warping what I said, and you know it (unless I was wrong to give you that compliment in my previous post). And this reinforces my suspicion that you are doing something you've repeatedly accused \\*me\\* of: harboring an agenda.   \n   \nGood night.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Dec 2001 — 6:05pm",
      "content": "Man!   \nI think a few people here could stand to \\*breathe\\* more. Typographers certainly are not a dying breed, far from it, and the point somebody is trying to make is contentious, not to say ludicrous. Does it matter, at the end of the day, if Jean-François makes more money than Susana? If Emigre is better known for their magazine or their fonts? The fact of the matter, I think, is that there are tons of good type designers out there and we should simply know about them and learn from them, not discuss if they are/are not full time, bona fide type designers. Its kinda silly and a real wanking waste of time.   \nAnd just for the sake of going on to the name dropping band wagon, here are a few names:   \n   \n- Chester (definitely a type designer making a living out of it)   \n- patric king (I don't think he is with Thirstype anymore)   \n- Rick Valicenti (I rest my case)   \n- Patrick Giasson (working in London as a type designer and creator of Oz)   \n   \nFrom [http://www.thirstype.com/](http://web.archive.org/web/20150414063140/http:/www.thirstype.com/)\n\n"
    },
    {
      "time": "10 Dec 2001 — 10:52am",
      "content": "Luce,   \n   \nWhile some of the arguments in this thread have   \ntaken a contentious or ludicrous route I'm not   \nsure it's a wanking waste of time to discuss the   \nstate of the type industry. It is a market that is   \nin a very sad state, whether there are 20 or 200   \nfull-time designers.   \n   \nI think the main point is that regardless of   \ntraining and talent it may be more difficult than   \never to dedicate one's working life to type   \ndesign. If true, that reality hurts everyone,   \ndesigner and user alike.   \n   \nStephen\n\n"
    },
    {
      "time": "10 Dec 2001 — 12:11pm",
      "content": "Stephen,   \nI agree completely, but I feel like a lot that is happening in this thread is more ranting and self-pity or angry lashing or abc-grade statements than a serious discussion on pitfalls and solutions to/for/by the industry. And now I'll be quiet for a while.   \n   \nOh, and we forgot Mr Keedy and the Zeitguys.   \n   \n\\*L\\*\n\n"
    },
    {
      "time": "4 Jan 2002 — 3:00pm",
      "content": "...and some more clarification from me. it's actually quite frightening how most of the people participating in this thread have no idea what they're talking about. And we haven't heard much from actual typedesigners on those lists, apart from jonathan.   \n   \nFirst:   \nlet's distinguish between getting paid for designing a typeface, like a corporate font for a one-off fee, then the residual income from royalties, and finally income from retail sales of libraries.   \n   \nIn the case of emigre, for example, zuzanna licko earns royalties from the sales of her fonts as do other designer who have designs with that foundry -- eg john downer et al. Zuzanna also makes money from the retail business as she is one of the owners of the company.   \n   \nAnother example: Roger Black. While Roger has never designed a typeface in his life (how did he ever make that list?), he is still a partner in FontBureau who make their money from both selling retail type and designing special commissions. So Roger makes money from type, but isn't a type designer.   \n   \nAnd a last one: Erik Spiekermann. The residuals of my fonts -- FF Meta, FF Info, ITC Officina, even the fonts I did for Berthold 25 years ago, but not from Harvey Hunt who doesn't pay designers -- could provide a handsome living if I didn't spend so much money on international flights and if I could be sure those fonts would sell forever. I also design typefaces on an exclusive basis for a one-off fee. Recently that was the case for Nokia, where I just did some rough digital concepts and Monotype did the rest. Then, as a partner in FontShop International, I would receive an income it we didn't spend all the money on fighting Harvey Hunt's legal cases against us and our designers. Until 2 years ago, I was a partner in MetaDesign and designed typefaces for clients of that company, helped by -- amonst others -- our resident typedesigners like Lucas de Groot, Ole Schäfer, Albert Pingerra, Erik van BLokland, Just van Rossum et al, who all got paid a wage but no license fees for the fonts MetaDesign did for our clients like Volkswagen, Audi, Heidelberg etc.   \n   \nFontFont designers get 20% of retail, and most other foundries pay similar fees. If you have bestseller, you can make a few thousand dollars a month. There are, however, not many bestsellers out there that sell over a long period of time. And designers like Adrian Frutiger have old contracts with Linotype paying much less than 20%. In fact, if Adrian was on 20%, he'd be a millionaire. Unfortunately, a few foundries sold their libraries to distributors for a one-off fee (like ITC did to Linotype afew years ago), so the designes got a few dollars once, but now only the distibutor earns. If you buy ITC Officina from Linotype, I don't get a penny, but if you buy it from Agfa, I get 20%.   \n   \nOut of the dozens of typedesigners who have their work represented by FontShop International, only a dozen or so could have lived off their royalties, at least for a while.   \n   \nThe confusion stems mainly from the fact that design and production have merged, and in some cases the designers and producers are also the retailers. Gerard Unger has a few faces with other libraries but also sells some of them from his home as a one-man foundry. He still designs for commissions (like the Dutch Highway Authority) and also works as a freelance graphic designer.   \n   \nSo strangely, while all the typedesigners I know also do other work, there are some people who make a living entirely from selling fonts: all those who work for a foundry. And Clive is totall right with his estimate of maybe 600 people making a living out of font sales worldwide. Clive is totally wrong with giving me credit as a designer and not as a typedesigner. These days, it's the other way round.\n\n"
    },
    {
      "time": "4 Jan 2002 — 3:56pm",
      "content": "Erik! Thanks so much for your clarifications. In defence of my own ignorance on the subject of earning a living as a type designer; it was never through want of asking. When I was designing type nobody ever gave me any idea how much I might make off any royalty agreement I might sign except for those who offered an up front advance on royalties. (Is it only ITC that still does this?) Frankly, from almost every design company that ever bothered to respond to my questions about type design - the technicalities of production and the business side - I got what ammounted to snide amusement at my lack of knowledge, as if I was simply not in the club and never going to get in either. (Evidently they were right.) I'm not complaining about the whole self-educated aspect of type design which seems to be the common denominator amongst designers, great and small. And I don't wish to sound like I'm whining about a lack of commercial success. But until the internet came along and people began to share information on the technicalities, at least, type design was for me, work in a dark vaccuum, where no sound or light seemed to enter or leave. It was a mystery to me how font companies ever got any new designs, because the last thing they seemed to be doing was giving the eager designer any helpful advice.   \n   \nOn the subject of actual dollar amounts earned: I'm not about to ask a designer to show me their bank statements, but can't someone, somewhere show us some figures? E.g. how many units of a bestseller were sold over a certain period of time; and perhaps for comparison the figures on a very average-selling font.\n\n"
    },
    {
      "time": "6 Jan 2002 — 7:08pm",
      "content": "If you read the last few posts critically, carefully, and objectively, you'll realize that my point has in effect been made!   \n   \nhhp\n\n"
    },
    {
      "time": "30 Sep 2001 — 8:25pm",
      "content": "I'm a teenager who designs band crap for my friends. I buy quite a few fonts from Mr. Chank Diesel. I heard that he was listed as a 'young millionaire' by a business magazine, but then I saw when he went in the hospital, they had a picture of him and he looked like he was desperate for cash to pay his medical bills. I've also heard that his 'Chank Army' pay him royalties, but I cannot verfy.   \n   \n[Anonymous #1]\n\n"
    },
    {
      "time": "4 Dec 2001 — 6:41pm",
      "content": "Hmm, I think there aren't too many people who earn a good proportion of their income from type design, but it's way more than the estimates here. And those cited are mostly wrong.   \n   \nI'd say around 50-60, just in Latin, and plenty more in non-Latin.   \n   \n[Anonymous #2]\n\n"
    },
    {
      "time": "5 Dec 2001 — 9:38am",
      "content": "Anonymously naming names would make me unanonymous.   \n   \nBut, in the immediate vicinity there's the bloke and his two helpers, the woman in the west, the bloke by the water, the homme in the nord, the two in the centrum, the guru and her two assistants... what am I up to, 11?   \n   \nI do not need to travel far to exceed even your top estimates, and could easily get to 25 or 30 with travel not much further.   \n   \nThou knows not what thou speaks of.   \n   \n[Anonymous #2]\n\n"
    },
    {
      "time": "5 Dec 2001 — 10:03am",
      "content": "What's this nonsense, of \"individuals\" vs \"firms\".   \n   \nHTF is now a \"firm\" because TFJ joined a couple of years ago?   \n   \nHTF has had three or more employees for a long time.   \n   \nAnd this:   \n   \n::Hoefler/Jones (they work together now) are in a   \n::special category because a substantial portion   \n::of their income is certainly from their   \n::respective corporations (foundries) consisting   \n::partly of designs other than their own.   \n   \n!?   \n   \nWhat designs does HTF have that aren't credited to Jonathan or Tobias?   \n   \n::Quay and Sack would be back on board.   \n   \nWhat is it that either of these do other than design type?   \n   \n:...and Wolff Olins?   \n   \nA design consultancy that has never been known for designing type, always subbed it out to others!?   \n   \nWhy are you trying to make some distinction between \"lettering\" and \"type\". If you're going that way you may as well wipe Zapf off your list, and Roger Black!? C'mon.   \n   \n[Anonymous #2]\n\n"
    },
    {
      "time": "5 Dec 2001 — 10:34am",
      "content": "The anonymous posts require the rest of us to focus on the merits of his/her argument, and not on the credibility of his/her name. I'm not dismissing any points yet-\n\n"
    },
    {
      "time": "5 Dec 2001 — 10:39am",
      "content": "This thread is all over the place b/c the premise of 'making a living from their \\*\\*own\\*\\* type designs' has become 10 other things. Maybe the word 'freelance' is what originally was meant. And what does 'making a living' mean? Supporting one's self? Someone single, a student, could live at home with mom and sell $10,000 worth of fonts and be living high on the hog, 'making a living' Certainly anybody with a foundry and multiple employees is 'making a living' -- for themselves and their employees. What's the point? What if only 20 percent of the sales at their foundries were \\*\\* their fonts \\*\\*? Do they qualify for the list?   \n   \nCertainly the proprietors of smaller foundries -- Font Diner, FontHead, DincType, are 'making a living', mostly from their font sales. If they are scraping by or doing freelance design or working part-time at Taco Hut, we don't know. Is Jeremy Tankard making the \\*\\* majority \\*\\* of his money from his nice type or his design work? Doesn't Chank Diesel have three or four employees? Aren't the guys at House Industries making a living...primarily from \\*\\* their own \\*\\* type? Don't you see...this list can never stand or never be agreed upon b/c the parameters change and \\*\\* WE DON'T KNOW \\*\\* how some of these people are doing.   \n   \ntwo cents.   \nL)   \n   \n   \n/attach -adnausea.hqx   \n   \n[Anonymous #3]\n\n"
    },
    {
      "time": "5 Dec 2001 — 11:16am",
      "content": "Here's 52 names off the top of my head. Quibble away.   \n(submitted by Anonymous #2, Professional Type Designer)   \n   \n1. David Berlow   \n2. Cyrus Highsmith   \n3. Jill Pichotta   \n4. Jonathan Hoefler   \n5. Tobias Frere-Jones   \n6. Jesse Ragan   \n7. Josh Darden   \n8. Kevin Dresser   \n9. John Downer   \n10. Matthew Carter   \n11. Zuzana Licko   \n12. Christian Schwartz   \n13. Ken Barber   \n14. Tal Leming   \n15. Jim Parkinson   \n16. Jeremy Tankard   \n17. David Quay   \n18. Freda Sack   \n19. Dave Farrey   \n20. Jean Francois Porchez   \n21. Petr van Blockland   \n22. Erik van Blockland   \n23. Just van Rossum   \n24. Martin Wenzel   \n25. Luc(as) de Groot   \n26. Ole Schafer   \n27. Brazo Fuerte   \n28. Martin Majoor   \n29. Hans Reichel   \n30. Bram de Does   \n31. Christoph Noordzij   \n32. Gerrit Noordzij   \n33. Mattias Noordzij   \n34. Fred Smeijers   \n35. Paul van der Laan   \n36. Hannes Famira   \n37. Akiem Helmling   \n38. Bas Jacobs   \n39. Sami Kortemäki   \n40. Lars de Beer   \n41. Bruno Maag   \n42. Clive Bruton   \n43. Nick Shinn   \n44. Adrian Frutiger   \n45. Herman Zapf   \n46. Hans Eduard Meier   \n47. Gerard Unger   \n48. Steven Gibbs   \n49. Robert Slimbach   \n50. Carol Twombly   \n51. Marco Ganz   \n52. Robert J. Smartner\n\n"
    },
    {
      "time": "5 Dec 2001 — 11:37am",
      "content": "Frantisek Storm?   \nChank Diesel?   \nSpiekermann?   \nDeLora Tim¿n?\n\n"
    },
    {
      "time": "5 Dec 2001 — 12:33pm",
      "content": "There's at least two anons here:-)   \n   \nMy point about the \"woman in the west etc\", is that in quite a limited geographical area, ie within five miles of where I'm now sitting, are at least 11 professional type designers, who have 80-90% of their income from type. If they're doing \"other things\" it's because they're between projects or they want to do other things.\n\n"
    },
    {
      "time": "5 Dec 2001 — 12:38pm",
      "content": "Just to expand on this, those that doubt the numbers put forward are just not on the \"inside\" of this business. That's not to say it's exclusive, but you need to get to know the people in order to know the business.   \n   \nI've worked hard at getting to know the people, even though I'm mostly an anti-social grouch (aha, now you know me), because there is a commonality between those on the inside - we're just real typo nuts (and you might be on the outside too, but it's of a different kind).\n\n"
    },
    {
      "time": "5 Dec 2001 — 1:14pm",
      "content": "Hey look, I'm in the top 50!   \n   \nI'd disagree with a few of those names earning most of their income from type, definitely me anyway, at the moment.   \n   \nWhat some of you seem to be concentrating on is retail sales of fonts. I don't think that's a really major feature of many people's incomes. I've never put out a retail font, but I've certainly paid more than a few bills through my type work. I've never flown on Concorde, but I've been to the US and Canada 6 or 7 times in the past five years, all over Europe and even as far as New Zealand.   \n   \nI'd say that the type business supports around 3-400 people world wide on a full time basis, excluding those working in retail sales which probably comes to around another couple of hundred.   \n   \nThe 3-400 is probably comprised of 600 or so actual bodies who drift in and out over time or as they are completing other projects. Most of those I know and have contact with directly, on a regular basis would agree that sitting down and drawing type 100% of the time would drive us nuts.   \n   \nSo we all do things \"on the side\".   \n   \nYou can believe what you like, but I'm certain that those throwing around figures like \"10\" are very wrong.   \n   \nI'd also say that for those trying to separate type design, lettering and even straight up typography, that's a losing game. Anyone with an \"eye\" for it is going to be moving between the three all the time.\n\n"
    },
    {
      "time": "5 Dec 2001 — 2:36pm",
      "content": "Welcome Anons. You both raise some   \ninteresting insights. (Please, get yourself a   \npseudonym and stay awhile. Even Anonymous   \n1 and Anonymous 2 is fine.)   \n   \nClive, great points. And congrats on being in   \nthe 50. (Heh.)   \n   \nOk, seriously, I wonder what the real value of   \nthat name list is. Clearly we can knit-pick till   \nthe next Star Wars sequel comes out. But   \nwhat's the point? It seems a little futile.   \n(Whether it's 30 or 200 doesn't really prove   \nanything--just that it's not thousands.)   \n   \nWhich gets at my next point: Namely,   \nthe point made early in this thread, that   \nrelatively few people make a living SOLELY as   \nfull-time type designers.   \n   \nBut, if that's the point, what are we   \nmeant to conclude?   \n   \n//joe\n\n"
    },
    {
      "time": "5 Dec 2001 — 2:53pm",
      "content": "Actually, at the moment, I'm pretty much an accountant that does a bit of type on the side. :-)   \n   \nI think to be on \"the list\" you have to be able to make the \"choice\" about what you want to work on. My current choice is not to be doing much type, however I know that if I want to I have plenty of opportunity to be doing it, I probably will be doing a \"bit on the side\" over the next six months. Not sure I deserve to be on the list anyway. :-)   \n   \nBut I do think there are a lot more people involved than has been stated here.   \n   \nAs to what is/is not worthy of the list. I'll basically stick with what I wrote previously: type design, lettering and straight-up typography are all of a mix to me. I will qualify that in stating that I'm really looking to the higher end there.   \n   \nI'll discard my own input for a moment, because i think otherwise it'll look really subjective. However, all of the people I know pretty well, working at the higher end, are all first rate typographers as well as being type designers and or letterers. People have mentioned Roger Black and Erik Spiekermann, despite initial reactions I'd say that both of them are really better known for their typography. That flows throughout the higher end, people have the \"eye\".   \n   \nEven if you look at Erik van Blokland and Just van Rossum, two people definitely known for their type design, they've always done some really neat typography to go with it - and the way they do that is sometimes shocking, but they really can pull it off.   \n   \nYou know, type was a sideline for Eric Gill, but didn't he make something of it?\n\n"
    },
    {
      "time": "5 Dec 2001 — 2:58pm",
      "content": "Martin, the short answer is, if those practising type design were to do so exclusively, then the market would be able to support less of them.   \n   \nHowever they choose to go with the flow of work as it comes and goes. I do believe that there is enough work to keep 300+ people working full time, but as i wrote before, that's a subset of a group that's quite a bit larger.\n\n"
    },
    {
      "time": "5 Dec 2001 — 3:06pm",
      "content": "Sorry, the conclusion is what?   \n   \n\"There are relatively few people working full time in type design\"!?   \n   \nCompared to what? There are relatively few people that win gold medals at the olympics, or are world class concert pianists, or who give birth to sextuplets.   \n   \nAnd?   \n   \nThere are relatively few people who show their faces on bigger budget films, who can make records when and where they choose.   \n   \nIt's relative to the market that class of person can support.\n\n"
    },
    {
      "time": "5 Dec 2001 — 6:05pm",
      "content": "Anonymous #2 coming back for more...   \n   \nThe point of my list was not to be \\*\\*THE\\*\\* list. It was a response to the RIDICULOUS assertion that there are no more than 10 people who earn a substantial part of their living from type design. These were simply the first 52 people that I thought of, in no particular order (sorry Clive). Indeed, my list is flawed in a few instances... there are countless glaring omissions, several individuals probably would not even describe themselves as\n\n"
    }
  ]
}
