{
  "id": "2202",
  "title": "Uppercase is expensive",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "From Swedish newspaper Aftonbladet:   \n   \nThe director of J\n\n",
  "author": "<a href=\"/web/20090627135833/http://www.typophile.com/user/951\" title=\"View user profile.\">spiral</a>",
  "time": "<br>",
  "uid": "951",
  "comments": [
    {
      "time": " 25.Nov.2003 5.54am",
      "content": "Very interesting, kemie. I'm right here in Sweden and if I   \ngot off my butt and learned Swedish I would have already   \nread this news.   \n   \nI've wondered what would happen if an all-lc style, which is   \nused quite effectively by a near majority of internet   \nchatters, was instituted among a broader public. I believe   \nthis is a case of what Emigre coined as \"we read best what   \nwe read most\" and Hrant acronymized as [\"WRBWWRM\"](http://web.archive.org/web/20090627135833/http:/www.typophile.com/forums/messages/30/20701.html#POST38239).   \nThere is little proof that capitalization, which is largely   \nbased on subjective cultural and traditional grammar rules,   \nimproves the innate readability of text. Is there?   \n   \n [Bradbury Thompson didn't think so.](http://web.archive.org/web/20090627135833/http:/www.pbtweb.com/alpha26/index.html) But his experiment   \ndoesn't benefit from the word shapes created by ascenders   \nand descenders. An all-lowercase system does.\n\n"
    },
    {
      "time": " 25.Nov.2003 7.27am",
      "content": "Nonsense, nonsense.   \n   \n**1.) Upper and lowecase.**   \n   \nVery interesting, kemie. I'm right here in Sweden and if I got off my butt and learned Swedish I would have already read this news.   \n   \nI've wondered what would happen if an all-lc style, which is used quite effectively by a near majority of internet chatters, was instituted among a broader public. I believe this is a case of what Emigre coined as \"we read best what we read most\" and Hrant acronymized as \"WRBWWRM\". There is little proof that capitalization, which is largely based on subjective cultural and traditional grammar rules, improves the innate readability of text. Is there?   \n   \nBradbury Thompson didn't think so. But his experiment doesn't benefit from the word shapes created by ascenders and descenders. An all-lowercase system does.   \n   \n**2.) Lowecase only.**   \n   \nvery interesting, kemie. i'm right here in sweden and if I got off my butt and learned swedish i would have already read this news.   \n   \ni've wondered what would happen if an all-lc style, which is used quite effectively by a near majority of internet chatters, was instituted among a broader public. i believe this is a case of what emigre coined as \"we read best what we read most\" and hrant acronymized as \"wrbwwrm\". there is little proof that capitalization, which is largely based on subjective cultural and traditional grammar rules, improves the innate readability of text. is there?   \n   \nbradbury thompson didn't think so. But his experiment doesn't benefit from the word shapes created by ascenders and descenders. an all-lowercase system does.   \n   \n**Saving no paper!**   \n   \nEither will this lovely specimen.   \n   \n [http://www.lanstontype.com/Bodoni26.html](http://web.archive.org/web/20090627135833/http:/www.lanstontype.com/Bodoni26.html)   \n   \nHowever if you wish to save paper.   \n   \n**Try this on for size**   \n   \nVery interesting, kemie. I'm right here in Sweden and if I got off my butt and learned Swedish I would have already read this news.\n\n"
    },
    {
      "time": " 25.Nov.2003 7.54am",
      "content": "Caps at the beginning of sentences have the functionality of marking when once sentence ends, and another begins. In 'chatting' people generally do one or two sentences at a time, so the differentiation is already marked by the exchange, and caps don't help further. But in continuious text like this, they are very functional. You could do away with this use of caps by adding extra space between sentences, but this would not save space, as the Swedish official wanted to.   \n   \nIn capitalizing proper names, you give the readers the signal that if the name is not important to them, they don't have to slow down to read it. So it is functional too.   \n   \nI don't know whether the noun caps in German are a benefit in German and what their impact on English would be.   \n   \nHow to capitalize titles is also currently in flux, and I could see this changing, as it is not really an issue of functionality.   \n   \nI was interested to read in one of Giampa's links on the 'Bauhaus' thread that they were opposed to caps, as well as serifs.   \n   \nTo a great extent their ideas have been tested over time. Sans serifs have succeeded in titles and display, but not in small solid text. And caps have not been abandoned. I personally think that this is not conservatism, but that the scribes who evolved these conventions - like the lower case letters themselves - were on to what is really functional.   \n   \nI think that those who don't use caps in continuous text either don't understand their functionality, or can't be bothered to hit the shift key to help their reader.\n\n"
    },
    {
      "time": " 25.Nov.2003 8.02am",
      "content": "PS the use of san serifs on the internet for continuous text is I think a compromise because of low res. And I think everyone recognizes reading long text on lo-res screens is a chore compared to high resolution printing, with serifs.\n\n"
    },
    {
      "time": " 25.Nov.2003 8.05am",
      "content": "How Bauhaus...\n\n"
    },
    {
      "time": " 25.Nov.2003 9.02am",
      "content": "\\> The director of J\n\n"
    },
    {
      "time": " 25.Nov.2003 9.12am",
      "content": "I have a better idea, rather than setting everything lowercase, why not set all government documents in Agenda Thin Ultra Condensed and have alot of minus tracking, you'd save tons of paper.\n\n"
    },
    {
      "time": " 25.Nov.2003 9.27am",
      "content": "Hrant: _Thompson did his stuff because of his son's condition._   \n   \nWhat condition is that, other than being a new reader?   \nAccording to [Martin Spector's article](http://web.archive.org/web/20090627135833/http:/www.pbtweb.com/alpha26/commentary.html), Thompson noticed   \nhis son had trouble with his first text because many capitol   \nletters have completely different forms from their lowercase   \ncounterparts requiring all new readers to learn more forms.   \n   \nBut that digresses from his main point: that caps aren't   \nnecessary for reading comprehension.\n\n"
    },
    {
      "time": " 25.Nov.2003 9.35am",
      "content": "\\> What condition is that   \n   \nDyslexia, no? Or some disability (not just \"learning to read\").   \n   \nHowever, I would agree that the UC letters which look like big versions of their lc counterparts should be reformed to diverge more. Latin is already too simple: the brain -unlike a computer- relishes much more complexity than that.   \n   \nThat's the main problem with Thompson, Cassandre, the Bauhaus, Noordzij, Crouwel et alia: they don't get that conscious design is only tangentially relevant to what our subconscious needs.   \n   \nhhp\n\n"
    },
    {
      "time": " 25.Nov.2003 9.57am",
      "content": "\\>main point: that caps aren't   \nnecessary for reading comprehension.   \n   \nMy main point - and Hrant's and Giampa's (Hey if we three agree it must be right!) - is that caps are HELPFUL to reading comprehension. You can set text with no word spaces and no punctuation, as I believe the Romans once did, and it is perfectly legible - and very much harder to read.\n\n"
    },
    {
      "time": " 25.Nov.2003 10.32am",
      "content": "_That's the main problem with Thompson, Cassandre, the Bauhaus, Noordzij, Crouwel et alia._   \n   \nOh dear. Who\n\n"
    },
    {
      "time": " 25.Nov.2003 10.51am",
      "content": "It never seems simple around here. And here I was thinking we were talking about saving trees. Patiently I was waiting for the obvious Bauhausian conclusion that all books should be made out of fibreglass.   \n   \nWhat make me sick is this incredible learning disability that everyone seems to have become afflicted. I can see that it is becoming contagious. Please don't sneeze in my direction!   \n   \nGood old fashion serifs and traditional typography has fared us well for more than five hundred years, but now, it seems to be impairing \"typographers\" ability to read. This ailment may require serious medication. Perhaps less vanity and a good pair of glasses.   \n   \nStop deamonizing good typography. If you are having trouble learning you are just going to have to study harder. The answer is not to make bigger type, or remove capitals, or remove \"humanizing serifs\". The answer is that you are a slow learner, blind or, not paying attention. Or the more obvious.   \n   \nSo go to bed drink plenty of fluids and pick up a good old fashioned reading habit. When was the last time you read Moby Dick?   \n   \nIt is not necessarily life threatening. Good literature, unlike fire extinguishers, or poultry do not have expiry dates. Your only danger is that you may learn that caps and serifs are not going to make you grow warts.   \n   \nSo stop believing horned rimmed morons that do not know how to put their pinky on the shift key. For instance this baboon.   \n [http://people.ucsc.edu/~gflores/bauhaus/type.html](http://web.archive.org/web/20090627135833/http:/people.ucsc.edu/~gflores/bauhaus/type.html)\n\n"
    },
    {
      "time": " 25.Nov.2003 10.54am",
      "content": "dON'T tRY tO eliMinAte onE caSe Out of COnveNIeNCe. ThE MoRe vAriEty tHe BeTTEr.\n\n"
    },
    {
      "time": " 25.Nov.2003 11.07am",
      "content": "At least someone agrees with me.\n\n"
    },
    {
      "time": " 25.Nov.2003 11.08am",
      "content": "_And since caps only take up only about 5% of text (although double to triple that in German)..._   \n   \nUnlike lowercase letters, the frequency of caps depends very much on the nature of the text being sampled, _e.g._ something written in the first person is likely to have a high incidence of uppercase I, while something in the third person might have few or even none. Similarly, if a document makes reference to many proper nouns -- people, places or organisations -- or uses acronyms, it will have a higher frequency of uppercase letters. When I was sampling texts for average English letter frequency, I deliberately ignored uppercase letters, because including them distorted the frequency more than excluding them.   \n   \nI initially thought that it would be essential to sample uppercase letters in German frequency analysis, but I was surprised by just how low the frequency of uppercase letters _compared to lowercase letters_ is even in German. Sampling the same text in English and German translation -- a Bible text of 30,000+ words, including a lot of proper nouns that bumped up the average uppercase letter count for the English --, I found that in the German the uppercase letters only accounted for 3.7% of the total alphabetic characters. I think the frequency of uppercase letters in German is often overstated.\n\n"
    },
    {
      "time": " 25.Nov.2003 11.16am",
      "content": "_Good old fashion serifs and traditional typography has   \nfared us well for more than five hundred years_      \n   \n...and the world was flat for much longer. Gerald, you're   \nsmart enough to know tradition isn't reason enough to keep   \ndoing something in the same way.   \n   \nJust to be clear, I'm not advocating the elimination of   \nuppercase. I'm only questioning whether our dependence   \non caps is based on their empirical aid to readability or   \nsimply because we're used to them.\n\n"
    },
    {
      "time": " 25.Nov.2003 11.35am",
      "content": "\\>ThE MoRe vAriEty tHe BeTTEr.   \n   \nNo, not the more variety the better, and not the more simplicity the better - as Bauhaus theology would have it. The degree and nature of the variety should suit the purpose. Caps help distinguish sentences from words, just as word spaces help distinguish letters from words. It is all about visual clues to structural information.\n\n"
    },
    {
      "time": " 25.Nov.2003 11.37am",
      "content": "\\> Who\n\n"
    },
    {
      "time": " 25.Nov.2003 11.43am",
      "content": "Apparently not.\n\n"
    },
    {
      "time": " 25.Nov.2003 12.04pm",
      "content": "Stephen, can you agree that it helps the reader to have visual markers distinguishing words from letters (word spacing), sentences from words (period and initial cap) and paragraphs from sentences (indents, line space, etc.)?   \n   \nIf so then the question is what works visually to separate sentences. I think that the period is too small to do it by itself. Either more space after the sentence or a cap or a bigger punctuation than the period would be needed.   \n   \nI can't get the sentences to have more space after a period here - something to do with the program - but try it and you will see what I mean.\n\n"
    },
    {
      "time": " 25.Nov.2003 12.08pm",
      "content": "\\>Right, and Latin doesn't have nearly enough.   \n   \nLetters looking too much alike is not just a problem of the Roman alphabet. I think it is a problem in the Hebrew alphabet- which is actually the Aramaic alphabet - too. This makes me think that there is some deeper reason for it - maybe there is no ideal solution of harmony vs variety.\n\n"
    },
    {
      "time": " 25.Nov.2003 12.18pm",
      "content": "Stephen,   \n   \n_...and the world was flat for much longer. Gerald, you're smart enough to know tradition isn't reason enough to keep doing something in the same way._   \n   \nTo Americans and Europeans the world is still flat. America was not discovered, it was invented. Columbus when he died was almost unknown. White man has never seen what they claim to have discovered because the saw only one big flat equation, gold and silver = fat men, women and children. They stole the Gold and destroyed a civilization. I find it absolutely incredible, for instance, after all the good Preachers converted the Indians to Christianity that they had not noticed the great moral decline of the natives.   \n   \nI would not have thought that would be the objectives of Christianity. Would you?   \n   \nIf you break all the rules of good typography what do you get, \"bad typography\". Why would that surprise anyone.   \n   \nBayer, the premier spokesmen for sans serif, one alphabet types tells me the menace of such pursuit.   \n   \n_1) \"destruction of the old representational image in order to achieve new experiences, a new wealth of optical expression.\"_   \n   \n **NOTE THE WORD DESTRUCTION!**\n\n"
    },
    {
      "time": " 25.Nov.2003 12.19pm",
      "content": "_Right, and Latin doesn't have nearly enough._    \n   \nEnough for what? Once again, Hrant, you seem set to ignore the fact that hundreds of millions of people read hundreds of languages using the Latin script every day. The idea that the Latin script lacks sufficient visual clues simply is not supported by the most massive piece of evidence: the fact that it is read comfortably and efficiently by so many people.\n\n"
    },
    {
      "time": " 25.Nov.2003 12.29pm",
      "content": "All the academia aside, I dig unicase. But only because it adds variety to the palette of possibilities. I also dig Herbert Bayer's work (his originals, not the ITC Bauhaus revival).   \n   \nStephen, your mention of unicase makes me want to put some in front of my four year old (kindergarten age). She knows her capitals, but can't recognize all her lowercase yet.   \n   \n\\_\\_\\_   \n   \nBy \"the more variety the better\" I'm referring to the variety that both cases (and the third quasi-case, unicase) adds to the collective design palette. I'm not really talking about long-running text. Which is why I'll get out of your (plural) way.\n\n"
    },
    {
      "time": " 25.Nov.2003 12.34pm",
      "content": "George Bush has got to stop taking money out of the American School system.\n\n"
    },
    {
      "time": " 25.Nov.2003 1.17pm",
      "content": "I'm not sure, Gerald. Were you insulting George Bush, the American school system or my daughter? I could choose to not be defensive on that but your tact is sorely lacking.\n\n"
    },
    {
      "time": " 25.Nov.2003 1.25pm",
      "content": "Hehehe. I hope he was just taking a random potshot at Bush   \nwhich I admit to doing from time to time. Either way, it's off-topic.\n\n"
    },
    {
      "time": " 25.Nov.2003 1.33pm",
      "content": "I know. \\*sigh\\* Usually I can look the other way... I didn't mean to derail this thread. (I'm fully prepared, as the parent of my child, to take responsiblity for the quality of her education -- which is probably why I overreacted.)\n\n"
    },
    {
      "time": " 25.Nov.2003 1.38pm",
      "content": "\\> Letters looking too much alike is not just a problem of the Roman alphabet.   \n   \nCertainly - I don't mean to single out the Roman alphabet, but it _is_ the world's main script, for the moment. Armenian has problems too (like an overly homogenous x-height region), but only [part of] 8 million people use it. Let's work on the big clumsy one first.   \n   \n\\> Enough for what?   \n   \nI guess \"enough\" isn't a good qualifier - it's all relative, after all. Compared to Morse Code for example Latin is wondefully diverse. But compared to Hangul it's a village idiot.   \n   \nSo my \"enough\" might mean \"not as mush as it could\". Why do you think dyslexia is much more common in Latin-using countries? It's pretty obvious for example that:   \n1) Some groups of letters (like b/d/p/q, and h/n/u) are too similar.   \n2) The vertical space is poorly used. Compare the descender and ascender space for example: the former has much richer shapes, but is used a lot less. All the ascenders except the \"f\" are sticks. And one of the letters (el) is just a stick by itself.   \n   \nThe fact that laymen get along \"just fine\" and don't realize the problems means very little. That's a bit like saying we don't need airplanes.   \n   \n\\> She knows her capitals, but can't recognize all her lowercase yet.   \n   \nA fine example of how _not_ to teach the alphabet...   \n   \nYeah, let's first learn the letters that are used for 5% (or a lot less) of text, since the Romans were such fine people and all...   \n   \nhhp\n\n"
    },
    {
      "time": " 25.Nov.2003 2.23pm",
      "content": "Setting everything in caps is in fact the best way to save paper. Let me draw your attention to this:\n\n> To save paper, Van den Bergh\n"
    },
    {
      "time": " 25.Nov.2003 2.30pm",
      "content": "Fredrik, could it also be that its to hard to figure out the language of beurocrats, it certainly isn't a generally spoken language and making it small would require everone who delt with them would need a microscope to read the regulations?\n\n"
    },
    {
      "time": " 25.Nov.2003 2.37pm",
      "content": "Is this the same guy who proposed saving paper by printing two pages on one page in different colors, and you'd alternate colored glasses to read consecutive pages? Last year Unger gave a talk in Thessaloniki about it, and people were in stitches.   \n   \nhhp\n\n"
    },
    {
      "time": " 25.Nov.2003 2.43pm",
      "content": "\\>Setting everything in caps is in fact the best way to save paper   \n   \nThis sounds correct to me. You could also eliminate word spaces, as the Romans. Also you could do as people did when postage went by weight and was very expensive: write first horizontally, then rotate 90 degrees and write again. Sometimes they would write along two diagonals as well as left to right. If the most important thing is to save paper. You could do the same thing with printing.   \n   \nBut it is all at the cost of readability. The stupidity of the government regulation is that the priority is on saving paper - a renewable resource - rather than on helping people.   \n   \nThe better government policy would be to invest in teaching bureaucrats to write more clearly and succinctly - and make better use of internet technology.\n\n"
    },
    {
      "time": " 25.Nov.2003 2.54pm",
      "content": "William you are making sense and we know governments policies are to confuse and not make sense. Alot of beurocrats would be out of business if they were efficient. It would make sense to post information on the internet, with interactive forms, save a bunch of paper that way and who cares how long the forms have to go?\n\n"
    },
    {
      "time": " 25.Nov.2003 3.02pm",
      "content": "In fact English is known to be about 50% redudant, meaning you could dump 50% of the information (letters here and there, whole words here and there) and still maintain total decipherability. Readability though it a whole different matter...   \n   \nI think the best way to save paper is to stop printing crap: like all those thick, glossy consumerist catalogs, but also 90% of the LA Times.   \n   \n\\> the priority is on saving paper - a renewable resource   \n   \nOn the other hand, trees won't be renewable when we run out, and at this rate we most certainly will - although the idiotic hubris leading to deforestation will kill us off by other means much sooner than we run out of trees...   \n   \nhhp\n\n"
    },
    {
      "time": " 25.Nov.2003 3.07pm",
      "content": "Hrant we can hope for the next Metorite to wipe out the (naked apes\\*)   \n   \n\\*Cartoon (Sherman's Lagoon)\n\n"
    },
    {
      "time": " 25.Nov.2003 5.02pm",
      "content": "Keith and Hrant wrote on the Dutch \"innovations\" on UC only text. We even had national telephone directories in lc only. It was cheaper to produce (no photocomp at that time: the sixties!) but the readers disliked that innovation too.\n\n"
    },
    {
      "time": " 25.Nov.2003 11.22pm",
      "content": "Joseph,   \n   \nSorry John, _it is not all about you._   \n   \nI was not speaking of your daughter. I had an interruption in the middle of posting. As a consequence my posting followed your posting. That hour of day in Finland is not similar to yours. It was late for me in Finland. The final thing I did was hit the post button, turn off the office lights and go read a book. I was not aware of the unfortunate sequence until reading your posting this morning.   \n   \nIt would be nice if this Forum system allowed for a review of \"new almost simultaneous postings\". As you know, it does not. I am not the first one to have this experience.   \n   \nMy reference is about apparent difficulties typographers are having reading. The apparent confusion they seem to have about the alphabet in general. If you read about Bayer you will see he is seeking laziness in learning.   \n   \nThe present Administration, I have read, does not put much value on the education system.   \n   \nOr is this Hollywood theatre?   \n   \n [http://edworkforce.house.gov/democrats/rel2303.html](http://web.archive.org/web/20090627135833/http:/edworkforce.house.gov/democrats/rel2303.html)\n\n"
    },
    {
      "time": " 26.Nov.2003 1.47am",
      "content": "Traditional typography wins.   \n   \nPrinting on hand made paper, (cotton, not trees) with hand set types on a hand press would certainly save many trees. Also I suggest it may take serifs, caps and common sense _off the endangered species list._   \n   \nBut I forgot, _all of us_ do not find value in such things as the Kyoto agreement.   \n [http://unfccc.int/resource/convkp.html](http://web.archive.org/web/20090627135833/http:/unfccc.int/resource/convkp.html)\n\n"
    },
    {
      "time": " 26.Nov.2003 4.21am",
      "content": "Preschoolers tend to learn to write UC first because they learn by copying and UC are generally simpler shapes to draw than lc. Young kids draw, they don't write.\n\n"
    },
    {
      "time": " 26.Nov.2003 1.59pm",
      "content": "I had a similar reaction to Hrant - if the idea is to only   \nsave paper then cut the moronic ads out of the   \nnewspapers, and while you're at it stop printing all of   \nthat hyped up Christmas sale junk mail and putting it   \nin my over-gorged letterbox.\n\n"
    },
    {
      "time": " 26.Nov.2003 2.44pm",
      "content": "\"Printing on hand made paper, (cotton, not trees) with hand set types on a hand press would certainly save many trees. Also I suggest it may take serifs, caps and common sense off the endangered species list.\"   \n   \n   \nFrom what I'm given to understand, all paper by American paper companies is made with farmed trees. European paper makers, on the other hand, just love those old growth forests.   \n   \nNo need to save paper if the trees are grown specifically for it.\n\n"
    },
    {
      "time": " 26.Nov.2003 10.14pm",
      "content": "I am from British Columbia. Without question Finland has far better forestry practices than Canada.   \nIn British Columbia, Washington State, Quebec, Ontario, Main, farmed trees, I don't think so. It is strictly \"slash and burn baby\".   \n   \nIn Finland logging is super selective. Lumber is air dried, common house building wood suitable for boat building. North America\n\n"
    },
    {
      "time": " 26.Nov.2003 11.45pm",
      "content": "I don't know if the lumber companies use farmed trees, but the paper companies are supposed to from what I understand.   \n   \n:shrug:\n\n"
    },
    {
      "time": " 27.Nov.2003 1.42am",
      "content": "Apparently some type designer does not like trees. See vote, 2nd post.\n\n"
    },
    {
      "time": " 27.Nov.2003 5.02pm",
      "content": "Let's be realistic. If there were no \"idiotic ads\" in newspapers, there would be NO newspapers, and the same goes for magazines. Publishers don't crank this stuff out because they feel it their duty to keep us informed. It's money.   \n   \nCertainly we could remove most of the problem of paper waste if the publishers of material on glossy and clay coated paper would desist. I know the world would be a better place for it.   \n   \nIn British Columbia it is now a very widespread practice to recycle paper (and all materials like metals and plastics that previously went into land fills). The clay-coated papers, that incidentally create bucks for graphic designers in the form of annual report work etc., dont recycle worth a damn.   \n   \nDecades ago when I worked on newspapers, there was a shift from 11 pica columns to 10 picas and 9 points. The reason was that they saved about 3/8\" in width on every newspaper roll, and that translated to many tons of paper each year. The newspaper carried on skinnying up the columns ever couple of years by three points or so until they dailies were down to 10 pica columns. Eventually they furnished all of the Linotype machines with a more condensed typeface, and in a smaller size of 9 point rather than the previous 10 point. These apparently minimal measures saved the publisher lots of money in paper because the paper could order narrower rolls. I am certain their concern was with their bottom line rather than leaving a tree for a bobcat to climb.   \n   \nI have to say, as other have, that eliminating capital letters seems like an ineffective way to save paper . . . but who knows what if anything is going on in the brain box of any politican?   \n   \nJim Rimmer\n\n"
    },
    {
      "time": " 27.Nov.2003 7.53pm",
      "content": "Let\n\n"
    },
    {
      "time": " 27.Nov.2003 8.27pm",
      "content": "\\> If there were no \"idiotic ads\" in newspapers, there would be NO newspapers   \n   \n1) It's not just the ads I mind (even though 75% of the LA Times main section is ads - I counted), it's also the content - it's mostly crap.   \n2) In a non-capitalistic system a newspaper can exist just fine without ads.   \n3) Newspapers aren't the biggest source of use: those damn J Jill and Dell catalogs are.   \n   \nThe key to all of this (not just saving paper) is down-scaling. Reverting to bartering and home production. Very few people these days actually _make_ anything, or even think about anything. It's all watch-buy-consume, instead of think-make-share.   \n   \nhhp\n\n"
    },
    {
      "time": " 27.Nov.2003 9.45pm",
      "content": "_Newspapers aren't the biggest source of use: those damn J Jill and Dell catalogs are._    \n   \nI like Dell catalogues: computer hardware porn. Almost as good as [French property](http://web.archive.org/web/20090627135833/http:/www.french-property.com/) porn.\n\n"
    },
    {
      "time": " 28.Nov.2003 3.31pm",
      "content": "\\> They were allowed to write just like they   \n\\> always do, BUT in a smaller type-size.   \n   \nThat's totally different. Now the 10% makes sense.   \n   \nThis means the problem was something else: lack of understanding of the effect of scale on type. You can't just reduce the size, the font has to become bigger on the body, looser, darker, more open, etc.   \n   \nIf that Swedish politician had had a competent typographer guiding him, it might have worked out.   \n   \nCan somebody please find me his contact info, somehow? I'd like to make him a proposal.   \n   \nhhp\n\n"
    },
    {
      "time": " 29.Nov.2003 4.55am",
      "content": "The article mentions Karin Torstensson Hirsmark, and the kommun's page ( [http://www.jonkoping.se/](http://web.archive.org/web/20090627135833/http:/www.jonkoping.se/)) lists her email address as [karin.torstensson@stk.jonkoping.se](mailto:karin.torstensson@stk.jonkoping.se)\n\n"
    },
    {
      "time": " 29.Nov.2003 8.34am",
      "content": "Thank you Kemie!   \n   \nhhp\n\n"
    },
    {
      "time": " 29.Nov.2003 10.51am",
      "content": "_\"I know. \\*sigh\\* Usually I can look the other way... I didn't mean to derail this thread. (I'm fully prepared, as the parent of my child, to take responsibility for the quality of her education -- which is probably why I overreacted.)\"_   \n   \nJohn, I missed this. To me you seem extremely interested in the quality of your daughter's education. That's a good thing, don't apologize for that. Forgive me if that is what you think I was saying, it was not.   \n   \nMy sequence was out, if I read yours first I would never have posted mine. I would have known you could easily have read it wrong. As it turned out, you did.   \n   \nIf any one knows the importance of an education it would be me.\n\n"
    },
    {
      "time": " 29.Nov.2003 12.46pm",
      "content": "Hrant, make sure you inform us of how your proposal comes across.\n\n"
    },
    {
      "time": " 29.Nov.2003 2.55pm",
      "content": "OK. But it _is_ a major long shot...   \n   \nhhp\n\n"
    }
  ]
}
