{
  "id": "223",
  "title": "Arabic Typography",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Arabic has got to be one of the most beautiful written languages, and upon searching for more info on the history of Arabic type, i found this:   \n   \n [http://www.amazon.com/exec/obidos/ISBN=0863563473/dmastypebooksforA/103-7803911-4528629](http://web.archive.org/web/20150417042326/http:/www.amazon.com/exec/obidos/ISBN=0863563473/dmastypebooksforA/103-7803911-4528629)   \n   \nHas anyone seen this, I am very interested in an opinion before I make the purchase. Any other recommends on books dealing with similar subjects?\n\n",
  "author": "kraftie",
  "time": "9 Apr 2002 — 2:09pm",
  "uid": "643",
  "comments": [
    {
      "time": "9 Apr 2002 — 2:49pm",
      "content": "You've come to the right place! :-)   \n   \nArabic is a script I hold in great admiration. I consider Tibetan as the most beautiful, but Arabic is glorious, in the true sense of the word. And the language has a euphony unrivaled.   \n   \nThe book you've pointed to has a good reputation, and I'm actually waiting for UCLA to get the copy they recently ordered - I'll report back here.   \n   \nLast year I bought this other book (from the wonderful \"Builders Bookstore\" in SF's chocorgiastic Ghirardelli Square), and it's \\*wonderful\\*:   \n   \n [http://www.amazon.com/exec/obidos/ASIN/0789207109/qid=1018388660/sr=2-2/ref=sr\\_2\\_2/104-9962888-5644764](http://web.archive.org/web/20150417042326/http:/www.amazon.com/exec/obidos/ASIN/0789207109/qid=1018388660/sr=2-2/ref=sr_2_2/104-9962888-5644764)   \n   \nAlso, you might be interested in visiting the acclaimed [http://www.arabictypography.com](http://web.archive.org/web/20150417042326/http:/www.arabictypography.com/) site. But note that it's part of a \"reformist\" platform - don't expect to find a view into Arabic's hallmark glory there.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Apr 2002 — 2:58pm",
      "content": "thank you hrant. i would love to actually learn the language as well.   \n   \nfor some reason, i just thought of the movie \"The Pillow Book\" about a young japanese girl that was obsessed with the written word ... just popped in there, call me random.   \n   \nheres a link:   \n [http://www.amazon.com/exec/obidos/ASIN/0767819772/qid%3D1018389411/ref%3Dsr%5F11%5F0%5F1/103-7803911-4528629](http://web.archive.org/web/20150417042326/http:/www.amazon.com/exec/obidos/ASIN/0767819772/qid%3D1018389411/ref%3Dsr%5F11%5F0%5F1/103-7803911-4528629)   \n   \nmaybe this could become the official movie of the typophile forums.\n\n"
    },
    {
      "time": "9 Apr 2002 — 3:13pm",
      "content": "The Arabic language isn't as complex as the script - except for the fact that in some countries (like Lebanon) the spoken language is somewhat different than the \"formal\" stuff everybody learns/teaches.   \nThe thing with Arabic is the repertoire of sounds: it's so different than Indo-European languages that it can be pretty discouraging to learn. You think it sounds funny when an Arab speaks English? You should hear it the other way around! :-) Even Armenians (we have some of the same sounds, but notably not the really guttural ones) have trouble with it. There used to be this stand-up comedian in Beirut, and his whole act for many successful years was talking Arabic like an Armenian.   \n   \nBTW, I'll be taking a Mandarin Chinese class one night a week, starting April 22 - it's just \"conversation\", without getting into their daunting logography - but wish me luck anyway!   \n   \n\\> The Pillow Book   \n   \nI \\*still\\* haven't managed to see that movie. :-(   \nBut I think I'd vote for it anyway...   \n   \nhhp\n\n"
    },
    {
      "time": "9 Apr 2002 — 3:22pm",
      "content": "\\> There used to be this stand-up comedian in Beirut, and his whole act for many successful years was talking Arabic like an Armenian.   \n   \nThe Armenian Yakov Smirnoff?   \n   \n\\> BTW, I'll be taking a Mandarin Chinese class one night a week, starting April 22 - it's just \"conversation\", without getting into their daunting logography - but wish me luck anyway!   \n   \nI took japanese in high school in Hawaii. There were no conversational classes at all until you got to college. Had to learn to write it before you spoke it.   \n   \nspeaking of classes, I'll be here this May:   \n [http://www.mnbookarts.org/main.html](http://web.archive.org/web/20150417042326/http:/www.mnbookarts.org/main.html)   \ntaking a letterpress class.   \n   \n\\> The Pillow Book   \n   \nI \\*still\\* haven't managed to see that movie.   \n   \nyou really must!\n\n"
    },
    {
      "time": "22 May 2002 — 1:44pm",
      "content": "So I got my hands on the Abi-Fares book, and it's just plain goddam amazing. I'll report back soon, but in the meantime:   \n   \n1. There's actually a short review of it in the current issue of Baseline magazine.   \n   \n2. [http://www.google.com/search?hl=en&lr=&q=arabic+smitshuijzen](http://web.archive.org/web/20150417042326/http:/www.google.com/search?hl=en&lr=&q=arabic%2Bsmitshuijzen)   \n   \nhhp\n\n"
    },
    {
      "time": "22 May 2002 — 2:42pm",
      "content": "You're taking a MN Book Arts class, Kevin? I'm jealous -- let me know how it goes.\n\n"
    },
    {
      "time": "23 May 2002 — 9:16am",
      "content": "hah, well i thought i was ... the funds just arent available right now. ugh. i actually spoke to the folks at blinc publishing (see the last issue of how in the diy article - chank actually digitized some of their woodtype - 'goshen' for one) about a internship/apprentiship sorta thing, hopefully that will happen over the summer. im also fine-tuning my screenprinting skills, and am working on setting up a studio at my place (or somewhere else ... who knows). i need to get a membership to MCBA just so i can hang out in their library!\n\n"
    },
    {
      "time": "7 May 2002 — 9:18pm",
      "content": "Last month, I purchased Gabriel Khan's ARABIC SCRIPT (Abbeville, link to Amazon is above) and Jonathan Bloom's PAPER BEFORE PRINT: THE HISTORY AND IMPACT OF PAPER IN THE ISLAMIC WORLD (Yale).   \nHaven't had time to really delve into them yet but both of these are beautiful books, well laid out and illustrated, and I recommend their purchase highly. If you buy them at Amazon you save $10 each off retail...\n\n"
    },
    {
      "time": "24 May 2002 — 5:25am",
      "content": "Ditto on the Abi-Fares book -- monumental. Everyone should have one!\n\n"
    }
  ]
}
