{
  "id": "2252",
  "title": "Indesign Units & increments help",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I know the answer to this must be simple but i cant find what it is.   \nAll i want to do is set my InDesign so when create a new document the units and increments are in mm rather that points.   \nI know I can change this when i create the document through prefenences but i want the units always to be in mm when i go to create a document, it leads to a lot of time trying to set a proper grid, columns and gutters.   \n   \nThanks in advance,   \ndavid.\n\n",
  "author": "david_leonard",
  "time": "Sat, 2003-11-29 20:27",
  "uid": "1394",
  "comments": [
    {
      "time": " Sat, 2003-11-29 21:24",
      "content": "Once you set it in the preferences it should permanent for all documents.\n\n"
    },
    {
      "time": " Sat, 2003-11-29 21:39",
      "content": "You need to set the preferences when no documents are open. If a document is open, the new preferences will be applied only to that document. If you set preferences without any documents open, the new preferences will be applied to any new documents.\n\n"
    },
    {
      "time": " Sat, 2003-11-29 22:03",
      "content": "Chris, John Thanks   \nsimple.\n\n"
    },
    {
      "time": " Sun, 2003-11-30 21:43",
      "content": "\"You need to set the preferences when no documents are open. If a document is open, the new preferences will be applied only to that document.\"   \n   \n   \nAre you sure? I could swear the units stay the same for any document once you set them regardless of whether one is open or not?   \n   \n   \nI'll have to try it out one day.\n\n"
    },
    {
      "time": " Mon, 2003-12-01 00:06",
      "content": "Document preferences are saved with a document. So existing documents will retain the preferences they had, regardless of whether you change the global preferences when no documents are open. The global preferences affect _new_ documents.\n\n"
    },
    {
      "time": " Mon, 2003-12-01 08:08",
      "content": "David one of the things I like about Adobe products is you can control(key) click on the rulers and a dialog box comes down and gives you options to change ruler settings on the fly.\n\n"
    }
  ]
}
