{
  "id": "2253",
  "title": "\"Boston\" Numerals?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "In De Vinne's \"The Practice of Typography: Plain Printing Types\", there's a sample of a face that's intriguing for its use of what are often called [\"hybrid\" numerals](http://web.archive.org/web/20140803010812/http:/typophile.com/wiki/hybrid%20figures):\n\n ![](http://web.archive.org/web/20140803010812im_/http:/typophile.com/files/21516_5414.gif)\n\nThat's actually a collage from a more extensive setting. The font is the #19 of the Phelps, Dalton & Co., and was probably made at the end of the 19th century. This makes it the earliest \"true\" hubrid numeral scheme I've encountered - in fact by far: the most recent ones I knew of previously were in Fenway (Carter) and some of de Groot's work. The Austin numerals (like the kind Carter has recreated in Miller) have some hybrid traits, but I find them too irregular (although in a nice way) to really qualify as a scheme.\n\nAnyway, this might be an opportunity to find a better name for \"hybrid numerals\", and I propose calling them \"Boston numerals\", not just because of this Phelps design, but also because Carter is in Boston. Luc[as] loses out though. :-(\n\nWhat do you guys think?\n\n(I hope Rodolfo and Kent are listening...)\n\nhhp\n\n",
  "author": "hrant",
  "time": "30 Nov 2003 — 12:45pm",
  "uid": "1250",
  "comments": [
    {
      "time": "30 Nov 2003 — 8:45pm",
      "content": "What are hybrid numerals?\n\n"
    },
    {
      "time": "30 Nov 2003 — 8:58pm",
      "content": "Basically old-style numerals that have bodies notably larger than the lc x-height, to the point where they sometimes seem like lining numerals shifted up/down - sometimes they even look like they're floating around a centerline.   \n   \nSome people (like me) think that hybrid numerals are the optimal style for text work.   \n   \n--   \n   \nBTW, I'm starting not to like the \"Boston numerals\" label... :-/ I did some reading, and it's looking like Alexander Phemister might have been the designer/punchcutter at Phelps, Dalton & Co. (AKA Dickinson Foundry) at that time, and apparently he was a very bright fellow, so...   \n   \nPlus I still have a nagging feeling that Austin might deserve the credit after all. Dunno, yet.   \n   \nhhp\n\n"
    },
    {
      "time": "30 Nov 2003 — 10:17pm",
      "content": "Besides, Carter & Cone is in Cambridge.\n\n"
    },
    {
      "time": "30 Nov 2003 — 11:03pm",
      "content": "New England figures.\n\n"
    },
    {
      "time": "1 Dec 2003 — 2:00am",
      "content": "Nantucket, clearly Nantucket. Heavily Influenced by Newfoundland Screech.   \n   \nYeah gotta love those figures but I am far from recommending them as a candidate to completely \"purge oldstyle figures in text\".   \n   \n_Cast brass early Boston hardware store figures_ probably predate Hrant's showings. Which is neither here nor there. John Downer would find nothing unusual about that.   \n   \nDon't speak loudly or Mike Parker may show up. Boston hardware store figs are those which Starling Burgess based for one of his typefaces.   \n   \nGoudy had used these style figures in Forum Title. The figure 4 in Goudy's give more probability for a balance setting. Notice dates in Hrant's showing.   \n   \n [http://www.lanstontype.com/ForumTitleRoman.html](http://web.archive.org/web/20140803010812/http:/www.lanstontype.com/ForumTitleRoman.html)   \n   \nI see nothing, and I mean nothing, is sacred!   \n   \nNow \"oldie style figs\", has joined \"upper case\" as _mud flat terra nova_ for the \"New Typographical Bourgeoisie.\"   \n   \n_Not to be confused with Bourgeois, approximately 9 pt. midway between Long Primer and Brevier which most of them, probably were not aware_  \n   \nSo I ask them what they think of the suggestion below? Pretty strange. I kind of like strange, that's why I hang around here.   \n   \n [http://www.lanstontype.com/Bodoni-Roman.html](http://web.archive.org/web/20140803010812/http:/www.lanstontype.com/Bodoni-Roman.html)\n\n"
    },
    {
      "time": "1 Dec 2003 — 9:53am",
      "content": "\\> New England figures.   \n   \nThat seems much better than \"Boston\".   \nBut I'm realizing that if there's going to be any geographic reference, it really needs to be Scotland: both Austin and Phemister were Scottish (although the latter's working life was in New England). The former certainly deserves credit for breaking from the oldstyle/lining polarity\\*, and the latter might have in fact been the first to discipline the deviation into a clear new style (I might find out when I check out a 1888 Dickinson specimen book at UCLA). Plus in this case I think it's not right to favor Carter anyway, since it seems de Groot did it first (among living designers).   \n   \n\\* Back around 1800. In fact, he (or maybe Bell) also deserves credit for the 3/4 lining numerals, which I also like. There seems to have been a lot of numeral innovation in the Highlands, for some reason.   \n   \nSo what I'm leaning towards is calling them Phemister, since Scottish is too broad: I'd like to be able to refer to \"Bell numerals\" (3/4 lining) and \"Austin numerals\" as well (like in Miller). But that's assuming Austin didn't make the first true hybrids as well! More research required...   \n   \n--   \n   \n\\> Notice dates in Hrant's showing.   \n   \nYou mean that they predate Goudy?   \nThe absoute latest that font could be is 1902, but it's probably 2-3 decades earler.   \n   \nThe Forum numerals are interesting, and seem very similar to the ones in ATF Garamond (which did however come a bit later), in that they're a very extreme case of hybrids, almost lining. BTW, I seem to remember Kent pointing out a precedent to the ATF Garamond numerals from around 1900, but I'm not sure.   \n   \n\\> [http://www.lanstontype.com/Bodoni-Roman.html](http://web.archive.org/web/20140803010812/http:/www.lanstontype.com/Bodoni-Roman.html)   \n   \nThose I call \"French old-style\", since they were pioneered by the Didots (thanks to Rodolfo for pointing that out, a while back now). And I actually think that vertical arrangement is better than our conventional one, which is too low on the body overall.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Dec 2003 — 11:32am",
      "content": "[http://www.lanstontype.com/Bodoni-Roman.html](http://web.archive.org/web/20140803010812/http:/www.lanstontype.com/Bodoni-Roman.html)   \nFrench Oldstyle Figures, indeed they are.   \n   \n_Notice dates in Hrant's showing._   \n   \nI was just pointing out that Goudy used a slightly hanging \"figure 4\". For those new to this thread, these are not French Oldstyle figures. See the very interesting top posting by Hrant. Below is Goudy's version of alternate figures. These follow somewhat Hrant's posting. These are not French Oldstyle Figures.   \n [http://www.lanstontype.com/ForumTitleRoman.html](http://web.archive.org/web/20140803010812/http:/www.lanstontype.com/ForumTitleRoman.html)  \n   \nI suggest Goudy's addition may have been helpful to balance the 1848. See 1848 without such balance, illustrated by Hrant's showing.   \n   \nI am a little confused though. First, Hrant you say that your showing is the earliest you have found, but now indicate there were earlier experiments across the great pond. Are the earlier ones consistent with the #19 of the Phelps, Dalton & Co?   \n   \nThat question aside, I am not sure what they should be named. They are not French Oldstyle, they are too lining to be oldstyle and too oldstyle to be lining. Perhaps _old lining figs_ would do. Tempting as it may be, naming such things after either location, foundry or designer can be a misleading.   \n   \nUnless one can clearly establish the source not only to be fact, but to be first in fact.\n\n"
    },
    {
      "time": "1 Dec 2003 — 12:11pm",
      "content": "\"Basically old-style numerals that have bodies notably larger than the lc x-height, to the point where they sometimes seem like lining numerals shifted up/down - sometimes they even look like they're floating around a centerline. \"   \n   \n   \nAh, okay! I was just recently using Poetica for a wedding invitation (cliche I know), and I noticed it's numbers moved up and down like OSF numbers, but not enough for my liking. I wound up using the lining numerals.\n\n"
    },
    {
      "time": "1 Dec 2003 — 1:33pm",
      "content": "{OK, OK...}   \n   \n\\> I was just pointing out that Goudy used a slightly hanging \"figure 4\".   \n   \nNot just that - all the oldstyle up/downs are there too.   \n   \n\\> these are not French Oldstyle figures.   \n   \nWell, of course not.   \n   \n\\> I suggest Goudy's addition may have been helpful to balance the 1848.   \n   \n1) What's 1848? That's just the year Samuel Dickinson died.   \n2) What's \"balance\"? I'm looking for the person who first made hybrid numerals; Goudy isn't it.   \n   \n\\> but now indicate there were earlier experiments across the great pond.   \n   \nSince Austin had a track record for numeral innovation (3/4 lining, as well as what might be called \"erratic\"), and since Phemister worked for the same foundry (back in Scotland) immediately following him, it's possible that Phemister got more than just a hint from Austin. More research is required.   \n   \n\\> old lining figs   \n   \nThat's an interesting angle... but they're not lining! :-/   \n   \n\\> Unless one can clearly establish the source not only to be fact, but to be first in fact.   \n   \nBut you can never prove something does _not_ exist. So it's a matter of sufficient certainty (and staying open to future correction - like what happened with Garamond/Jannon). If I find proof that Phemister made that #19 (noting that he was both punchcutter and designer\\* for most of his career, certainly after 1872 when he got promoted to full partner at Phelps), and I don't see anything like that in Austin's oeuvre, then \"Phemister numerals\" it is, since his \"lineage\" of numeral innovation is strong.   \n   \n\\* Very rare during his era.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Dec 2003 — 3:37pm",
      "content": "\\> What's 1848?   \n   \nHmm, see fifth line in your sample: '16th December, 1848'.\n\n"
    },
    {
      "time": "1 Dec 2003 — 3:46pm",
      "content": "Hi Hrant, I'm hearing now. : )   \n   \n\"Boston numerals\"? Interesting suggestion - but it seems that you're   \nnow on to different things? (I'd be afraid in any case that people   \ntranslated it here as \"n\n\n"
    },
    {
      "time": "1 Dec 2003 — 10:56pm",
      "content": " **\"Scotch on the rocks\"** Go figures!\n\n"
    },
    {
      "time": "1 Dec 2003 — 11:59pm",
      "content": "_That's an interesting angle... but they're not lining! :-/_    \n   \nWhat about \"not lining figures\"?   \n   \n_But you can never prove something does not exist._   \n   \nI agree, you can't. To make things worse, sometimes they too often do exist. I suggest naming as if to indicated \"discovery\" or suggest \"certainty\" would be folly.\n\n"
    },
    {
      "time": "2 Dec 2003 — 5:48am",
      "content": "They aren't lining? If they aren't lining, then why oh why must the huge gaping space around the numeral one be preserved? It's what I most dislike about lining numerals in text, and everybody seems to have gotten used to it except me. If you saw a word such as, say, \"ions\" or \"late\" set like that, you'd immediately say \"fix that crapulous kerning, it practically looks like two words.\" What I would like to see more of, on the flip side of these sort-of-lining oldstyle numerals, are non-lining equal-height numerals, with visual kerning on par with letters.\n\n"
    },
    {
      "time": "2 Dec 2003 — 7:12am",
      "content": "Is my face red. Thank you for setting me straight on the terminology, but you can see why I was confused; in most conversations \"lining\" would seem to be shorthand for lining tabular, and \"oldstyle\" would seem to be shorthand for oldstyle proportional. I was under the impression that no one had ever yet considered that lining and tabular could be separated, hence my pet peeve. My hand has been out of typography for a long time, and I'm mostly exposed to the \"defaults\" of the masses, in which lining tabular figures are often all you get.\n\n"
    },
    {
      "time": "2 Dec 2003 — 8:36am",
      "content": "\\> Call them Scotch figures once and for all   \n   \nI'm taking this pretty seriously now...   \n   \n\\> Don't let this happen to you.   \n   \nYou should see how I drive.   \n   \nBTW, there is also some evidence that the Ancient Egyptians (the ones before the ones we think we know\\* about - the ones that made the Sphinx, not the much later Pyramids) visited the \"New World\".   \n   \n\\* But: [http://news.bbc.co.uk/2/hi/americas/3254852.stm](http://web.archive.org/web/20140803010812/http:/news.bbc.co.uk/2/hi/americas/3254852.stm)   \n   \nSpeaking of \"transitional\", last night I found myself revisiting a passage in Updike that Kent had once pointed out. In it (vII, p230-1) Updike says that one Hunter introduced lining figures in 1785, but then shows what he calls \"transitional\" figures that look like hybrids, except you can't be sure because there's no lc to compare to. The thing is, his \"transitional figures\" look very much like the Miller (Scotch) ones, except those weren't made before the Hunter innovation (as far as I can tell), so how can they \"transition\"?   \n   \n--   \n   \nKevin, actually some people use \"lining\" to mean fixed-width (probably because such figures do enable _vertical_ alignment across subsequent lines). BTW, it is interesting that the numerals in that #19 seem to be fixed-width. I don't remember seeing that in [early] hybrids - it seems to be an influence of lining figures (although oldstyles are actually easier to make fixed-width).   \n   \nhhp\n\n"
    },
    {
      "time": "2 Dec 2003 — 10:00am",
      "content": "Trying to find out who first designed this kind of figures sounds great. But, I don't see why this new terminology should necessarily be tied to its history. Let's see, who first designed lining figures?   \n   \nIf these 'hybrid' figures need a new name, then it should be something related to its 'physical' aspect:   \n   \n\\> Basically old-style numerals that have bodies   \n\\> notably larger than the lc x-height, to the   \n\\> point where they sometimes seem like lining   \n\\> numerals shifted up/down - sometimes they even   \n\\> look like they're floating around a centerline.   \n   \n:-)\n\n"
    },
    {
      "time": "2 Dec 2003 — 10:55am",
      "content": "'Scotch figures' may be confusing to many people, since there is already a Scotch classification of type, many examples of which do _not_ include this kind of figure.   \n   \nI think having what amount to nicknames for different figure styles is fine, but we should first have an accurate way to describe figures. The most important distinction to this discussion is that between lining and ranging figures. The term 'lining figures' is used so commonly for cap-height figures that we tend to forget that it is an abbreviation for 'cap-height lining figures', i.e. of figures that are a common height, aligned to the caps. It is perfectly possible to have lining figures that align to other heights, e.g. to smallcap height, even to x-height and, in the case of Bell's famous figures, 'three-quarter cap height lining figures' (commonly called simply 'three-quarter figures' -- again, an abbreviation). Just as the term 'lining' does not by itself imply anything about the height of the figures -- other than that it is common --, so the term 'ranging' doesn't necessarily imply oldstyle figures, i.e. figures that range above and below a median defined by the x-height. It is perfectly feasible to have ranging figures that range above and below a median defined by the smallcap height, or even the cap height, although the latter would look very odd. From this it should follow pretty obviously that what we're talking about in this thread, precisely, are _three-quarter cap-height ranging figures._ Anything else is simply a nickname (of which there might be many: Scotch, Phemister, Boston, etc.) or an abbreviation (three-quarter ranging figs).   \n   \n   \nNB: using 'lining' to mean fixed-width is simply _wrong_. Lining and ranging describe vertical characteristics of figures; proportional and tabular describe horizontal characteristics. The truth of this is obvious as soon as one sits down to design typefaces with multiple figure styles: cap-height lining proportional, cap-height lining tabular, x-height ranging (oldstyle) proportional, x-height ranging(oldstyle) tabular, smallcap-height lining proportional, smallcap-height lining tabular, etc.\n\n"
    },
    {
      "time": "2 Dec 2003 — 12:24pm",
      "content": "_three-quarter ranging figs_ ![:-)](http://web.archive.org/web/20140803010812im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "2 Dec 2003 — 1:57pm",
      "content": "\\> it should be something related to its 'physical' aspect   \n   \nTrue.   \n   \n--   \n   \nJohn, although I don't believe \"ranging\" is a good qualifier (too rare and ambiguous), I like the directness of your approach. Even though \"3/4 oldstyle numerals\" is cumbersome, it's certainly better than \"hybrid\", and without [near-]total historical clarity, just slapping somebody's name on it is too cavalier. The only problem with it that I see is that it implies there are _full-height_ oldstyle numerals... But I guess there might even be such a thing (like maybe Quadraat Headliner could use them).   \n   \nBTW, this is the second time you've made me change/adopt terms. The first two were \"chirography\" and \"wedge serif\". I only have two on you (\"bouma\" and \"notan\") but I'm not sure how committed to those you are. :-)   \n   \nhhp\n\n"
    },
    {
      "time": "2 Dec 2003 — 5:31pm",
      "content": "_The only problem with it that I see is that it implies there are_ full-height _oldstyle numerals..._   \n   \nAs I wrote: 'three-quarter ranging figures' should be understood as an abbreviation of 'three-quarter cap-height ranging figures'. If you want to be really precise, use the latter. Of course, making this distinction does oblige us to stop calling Bell's figures 'three-quarter figures' and start calling them 'three-quarter cap-height lining figures'.   \n   \n   \nI like 'notan' -- although I suspect we disagree about its role in a subtle but important way --, but you can keep bouma.\n\n"
    },
    {
      "time": "3 Dec 2003 — 5:55am",
      "content": "Sorry I've been too damn busy with projects and deadlines to join in. I was fine with \"hybrid\". I don't mind \"Scotch\" as a nickname. But I think John's terminology is the most descriptive and precise, if that's your intention. I like \"three-quarter ranging\".   \n   \nFor the record, the lining figures in Whitman are proportional, not tabular, since they were intended to work primarily in all-caps headings and such, not so much financials. It wouldn't take much to adjust them to tabular width and I'm prepared to do that if FB ever gets a request.   \n   \n-- K.\n\n"
    },
    {
      "time": "3 Dec 2003 — 5:59am",
      "content": "Oh, I see that Stephen edited the Whitman reference out of his post. So my last statement might seem _non sequitur_. Oh well, I'll let it stand.   \n   \nBack to the grindstone . . .\n\n"
    },
    {
      "time": "3 Dec 2003 — 6:19am",
      "content": "_'three-quarter ranging figures' should be understood as   \nan abbreviation of 'three-quarter cap-height ranging figures'._      \n   \nThe best thing about Vox\n\n"
    },
    {
      "time": "3 Dec 2003 — 7:41am",
      "content": "Well, the \"cap-height\" part we can dump - it's totally moot.   \nAnd in practice just \"3/4\" will work most of the time, because the lining and oldstyle versions of 3/4 numerals (please don't use \"figures\", it's unfocused) share more than they don't: a sensitivity to functional scale. Somebody who makes 3/4 oldstyle nums will probably make his lining style 3/4 too.   \n   \nhhp\n\n"
    },
    {
      "time": "3 Dec 2003 — 1:42pm",
      "content": "Rodolfo, most people call me 'John'. Some people call me 'Mr Hudson'. Those who wish to distinguish me from my brother call me 'Mr John Hudson'. Those who need to distinguish me from some other John Hudson might append '...Tom Hudson's son' or '...the type designer' or '...the Anglo-Canadian type designer'. I have a friend who has known me since we were thirteen, and she's the only person who calls me 'Johnny' with impunity.   \n   \nThe terminology we use to refer to things is determined by our need of precision, which typically is determined by whom we are talking to (although in my case it is also influenced by a certain, ahem, 'retentiveness'). Sure, I know what you mean by the _nickname_ 'Didone', but will a non-typographer?\n\n"
    },
    {
      "time": "3 Dec 2003 — 2:26pm",
      "content": "Mr Hudson,   \n   \nthat\n\n"
    },
    {
      "time": "3 Dec 2003 — 2:35pm",
      "content": "\\> serve us a short, practical, easy term for typographic online chat   \n   \nThat's a very good point. So I'll keep thinking...   \n   \nhhp\n\n"
    },
    {
      "time": "3 Dec 2003 — 4:43pm",
      "content": "On the basis that three-quarters of anything implies a quarter of the same. And on the basis that the numerals in question are Ranging. I propose the name 'Quarange Numerals'.   \n   \nThe slogan shall be 'Quarange: it rhymes with orange'.\n\n"
    },
    {
      "time": "3 Dec 2003 — 8:25pm",
      "content": "Free Range Numerals.   \nCockadoodletwo.\n\n"
    },
    {
      "time": "1 Dec 2003 — 12:48pm",
      "content": "Just an aside to say that I am a big fan of this topic, Hrant.   \nIt shows how far Typophile has come that it's a legitimate   \nforum for proposing new naming standards. I don't mean   \nthat in a sarcastic way. I'm very sincere about how mature   \nand useful the discussion at this site can be. _Type on!_\n\n"
    },
    {
      "time": "2 Dec 2003 — 6:20am",
      "content": "I believe you're confusing the term \"lining\" with \"tabular\", Kevin.   \n   \nHeights   \n_Lining_ = Numerals are all the same height, lining with caps   \n_Oldstyle_ = Numerals are of various heights for better   \nflow with mixed-case text   \n   \nWidths   \n_Tabular_ = Numerals spaced with the same width for easy   \nsetting of columnar data on multiple lines   \n_Proportional_ = Numeral spacing of varying widths,   \nin the same way as the letter glyphs.   \n   \nA good text family should include at least 2 types of   \nnumerals, Oldstyle Proportional and Lining Tabular, but the   \nreally useful families include 4 variations, one font with   \neach width and height combination. See [Neutraface](http://web.archive.org/web/20140803010812/http:/houseind.com/house.php?kit=NEUTRAFACE-FO&sub=features).\n\n"
    },
    {
      "time": "31 Jan 2012 — 10:25am",
      "content": "I think this thread deserves revival after seeing [this somewhat clumsy term](http://web.archive.org/web/20140803010812/http:/www.typography.com/fonts/font_features.php?featureID=74&productLineID=100034). \"3/4 oldstyle figures\" didn't really stick like \"wedge serif\" and \"chirography\" did, dit it?\n\n"
    },
    {
      "time": "31 Jan 2012 — 10:54am",
      "content": "Hey, it's been over 8 years?!  \nNumerals in fonts have come along way, baby.\n\nAnd in that time I guess good old \"hybrid\" has proven  \nits staying power. As lousy as it is it's still better than  \n\"short-ranging\", which is totally confusing.\n\nhhp\n\n"
    },
    {
      "time": "31 Jan 2012 — 11:09am",
      "content": "These figures are conventionally old-style.  \nSure, they have a large “zero-height”, but that doesn’t make them a lining-oldstyle hybrid.  \nMany “normal” oldstyle figures have zero-heights that are larger than x-height.  \nAnd many “normal” oldstyle figures have zero and one that are lining-style (rather than a one that looks like a small-cap “I” and a zero that is a monoline circle), but we don't call those hybrids, which IMO would be a more accurate use of the term.\n\n"
    },
    {
      "time": "31 Jan 2012 — 11:37am",
      "content": "No, conventional old-style is where the bodies of the numerals  \nare x-height. It's only quite recently that designers have taken  \nup the good habit of breaking that established practice. If you  \nlook at fonts from around the time this thread\\* started you'd  \nbe hard-pressed to find hybrid numerals.\n\n\\* It might even be true that hybrid numerals  \nstarted spreading faster due to the numerous  \nTypophile discussions on the topic.\n\nAs for the way the zero and one look, that's moot here: we're  \ntalking about height, and the way a couple of numerals look  \nis not enough to label the whole set of them as a new idea.\n\nhhp\n\n"
    },
    {
      "time": "31 Jan 2012 — 11:47am",
      "content": "BTW, a textbook case of hybridity being non-kosher in  \nthe very recent past was what happened to Georgia, which  \ninitially had superb hybrid numerals\\* that were eventually  \ntoned down to near-conventional proportions. I think the  \nchances of that sort of thing happening now are much lower.\n\n\\* [http://typophile.com/node/63979#comment-377194](http://web.archive.org/web/20140803010812/http:/typophile.com/node/63979#comment-377194 \"http://typophile.com/node/63979#comment-377194\")\n\nhhp\n\n"
    },
    {
      "time": "31 Jan 2012 — 12:37pm",
      "content": "@Hrant: _conventional old-style is where the bodies of the numerals are x-height._\n\nYou are mistaken.  \nConsider that most conventional of faces with OSF as default, Georgia, which you just referred to.  \nOr the ClearType faces.\n\n"
    },
    {
      "time": "31 Jan 2012 — 12:51pm",
      "content": "As I said earlier in the thread, Carter was one of the very  \nearly proponents of hybrid numerals; Georgia is famous,  \nbut it's only one font\\*. As for the ClearType designs, they  \nare exactly part of the recent trend that I describe.\n\n\\* And, to repeat, the hybridity of  \nits numerals was tellingly neutered.\n\nTry to compile a list of fonts with hybrid numerals that came  \nout before Typophile caught on. You will find almost nothing.\n\nhhp\n\n"
    },
    {
      "time": "31 Jan 2012 — 10:50pm",
      "content": "Lining, stepping and ranging? Sounds better to me than lining, hybrid and ranging. When someone mentions hybrid, I think of roses.\n\n"
    },
    {
      "time": "31 Jan 2012 — 11:05pm",
      "content": "_Try to compile a list of fonts with hybrid numerals that came  \nout before Typophile caught on. You will find almost nothing._\n\nOlder faces with old-style figures that aren't “x-height”: Bodoni Antiqua, Plantin, Perpetua.  \nPreface (one of mine).\n\n"
    },
    {
      "time": "1 Feb 2012 — 1:27am",
      "content": "<cite>When someone mentions hybrid, I think of roses.</cite>\n\nNo, no, hybrids are the environment-conscious ones (an twos, and threes... ;-)\n\n"
    },
    {
      "time": "1 Feb 2012 — 9:07am",
      "content": "Bodoni Antiqua (URW++) does have gently hybrid numerals.  \nBTW, do you know how closely it's based on Bodoni's work?  \nIt would be cool if old Giambattista actually make hybrids.\n\nThe digital version of Plantin seems to have full lining nums,  \nand I don't have any of my metal typeface specimen books  \nhandy. Do you have a link/sample?\n\nPerpetua: The Italic does indeed have nice hybrids, but the  \nRoman's nums are actually _shorter_ than the x-height! Which is  \nquite strange. In any case Gill was indeed a numeral innovator;  \nthe tall \"2\" in Perpetua's Roman and Joanna is something we  \nshould all be doing frankly. Although the French _were_ ahead of  \neverybody in terms of OS nums (until they took a break from text  \nfonts for a while\\* and when they resumed they picked up some  \nnasty Anglo habits).\n\n\\* \"Thanks\" to Charles Peignot.\n\nPreface: those nums are barely a hair taller than the x-height.  \nI've seen that done before, but I've never understood it. Being  \na typeface designer I would notice it and believe it's intentional,  \nbut how could it appear as anything but a \"mistake\" to laymen?  \nIsn't it a sort of golden rule of visual design to either deviate  \nclearly or not at all? (Which is not to say that rules shouldn't  \nbe broken - to me it does need to make sense though.)\n\nSo, how long did it take you to find ~1.5 examples of  \nearly hybrid numerals? :-) BTW, the #19 of the Phelps,  \nDalton & Co. handily predates those.\n\nhhp\n\n"
    },
    {
      "time": "1 Feb 2012 — 9:46am",
      "content": "\\>When someone mentions hybrid, I think of roses.\n\nAre you taking the prius!? :-)\n\n"
    },
    {
      "time": "2 Feb 2012 — 3:52am",
      "content": "Nope. I'm not toy'ting wit' ya. Got an eco-friendly vehicle already anyway: A bike.\n\n"
    },
    {
      "time": "2 Feb 2012 — 8:02am",
      "content": "This digital Plantin version does have hybrid numerals: [http://myfonts.us/td-iueTpR](http://web.archive.org/web/20140803010812/http:/myfonts.us/td-iueTpR \"http://myfonts.us/td-iueTpR\")\n\n"
    },
    {
      "time": "7 May 2014 — 1:44pm",
      "content": "Maybe the face has changed, but all I can see on MyFonts for Francisco Serial are full oldstyle figures.\n\n"
    }
  ]
}
