{
  "id": "2270",
  "title": "Book on how to design type",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi there, first posting here, can anyone suggest a book that will teach me the anatomy of letterforms and type design. I'm a graphic designer of about 10 years standing but have never designed my own face. I did Fine Art at college rather than Graphics and a friend was telling me that on his graphics course they redrew Gill Sans and learnt the intricasies of each letter shape, that's the level of detail I'd like. I'm looking for something very hands on, telling me why different letters are particular widths, relationships between shapes etc. not anything theoretical, historical or overview.   \n   \nAny suggestions? Many thanks.\n\n",
  "author": "AngelFlonne",
  "time": "2 Dec 2003 — 5:57am",
  "uid": "2519",
  "comments": [
    {
      "time": "2 Dec 2003 — 9:15am",
      "content": "There's nothing really very useful, but I'd recommend Doyald Young's \"Fonts & Logos\" for some great detail, and Walter Tracy's \"Letters of Credit\" for a broader view.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Dec 2003 — 9:47am",
      "content": "There are some great tips at [Briem's website](http://web.archive.org/web/20130819155605/http:/briem.ismennt.is/).\n\n"
    },
    {
      "time": "2 Dec 2003 — 10:37am",
      "content": "Leslie Cabarga's book was scheduled for Fall 2003.   \n   \n [http://www.flashfonts.com/flashsite/entries.html](http://web.archive.org/web/20130819155605/http:/www.flashfonts.com/flashsite/entries.html)\n\n"
    },
    {
      "time": "2 Dec 2003 — 12:58pm",
      "content": "This is not a book, nor authoritative wisdom, but...   \n   \nI find myself saying the same thing very often over in the critique section. So here is my list of some of the top mistakes beginners make. (re: Beginners. I designed my first font less than two years ago, so I'm no expert, but I have spent a rediculous amount of time learning about and drawing letters since then. You will find the learning curve is steep.)   \n   \nStructural Problems:   \n1. m != n != r != u (does not not equal)   \n2. Stoke modulation problems. I recommend looking at Bodoni. Trace over it with a chisel tipped pen. Notice where it is thick and where it is thin.   \n3. [The Trapazoid Effect](http://web.archive.org/web/20130819155605/http:/www.typophile.com/forums/messages/29/21083.html?1069882058) (scroll down to diagrams)   \n4. Width problems. The best advice I know is to look at a lot of type.   \n   \nOptical Problems:   \n5. The mathematical center != the optical center (it's too low!) Trust your eyes not your ruler.   \n6. Two lines of equal thickness one vertical, one horizontal. For them to look the same, the horizontal one will need to be thinned a little bit.   \n7. [The X Ordeal](http://web.archive.org/web/20130819155605/http:/www.typophile.com/forums/messages/29/21083.html?1069882058) (scroll down to diagrams)   \n   \nRather than a book take a class from somebody really good. Surely there must be something happening in london? (Help people, please!). The only resource I know of is Reading. Do they offer weekend workshops?   \n   \nFinally, hang around typophile. Post your work in the critique section! Dont be afraid, thats why its there. Email people privately too. Most everyone is eager to lend a hand. The people at typophile have been so helpful to me as I learn my way around the alphabet.   \n   \nThe water is warm. Enjoy!   \nRandy\n\n"
    },
    {
      "time": "2 Dec 2003 — 3:38pm",
      "content": "I missed the trapezoid effect and x ordeal   \nwhen you originally posted that ... gotta go   \nback and look at the Xs in some stuff i'm working on.   \ngreat tips.\n\n"
    },
    {
      "time": "3 Dec 2003 — 3:39am",
      "content": "Muchos gracias everyone, there's a wealth of information here. The books look great and in fact the info at Briem's site and in Randy's post is a great start so I figure the best thing to do is get on with it then come back for feedback from you once I've something to show.   \n   \nBe a couple of weeks or so but \"I'll be back\". Thanks again and I've already taken your advice and joined the mailing list.\n\n"
    },
    {
      "time": "3 Dec 2003 — 5:03am",
      "content": "Edwin before you go, here's another online resource: [Underware's Workshop Basics](http://web.archive.org/web/20130819155605/http:/www.typeworkshop.com/index.php?id1=type-basics)   \n   \nRandy\n\n"
    },
    {
      "time": "3 Dec 2003 — 8:10am",
      "content": "Oh thanks Randy, it's exactly the kind of info I want. I'm going to disseminate it over the coming days and try to take as much as possible on board. I hope this thread is useful for others in my position, sure it will be. Catch you all later this month hopefully.\n\n"
    },
    {
      "time": "3 Dec 2003 — 9:23am",
      "content": "Edwin, just be aware of the difference between making \"calligraphic\" (more properly called \"chirographic\") type (like Zapf or Majoor\\*) versus making \"synthetic\" (Bilak's term) type (like Carter or Licko). You might end up favoring the former, but I'd recommend the latter. Anyway, it's never to early to realize the distinction - probably the first thing a type designer should learn, in fact.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Dec 2003 — 2:16am",
      "content": "Thanks Hrant, comments noted, and sorry all for the multiple postings above, my browser hung when I was trying to submit and I must have replied repeatedly\n\n"
    },
    {
      "time": "4 Dec 2003 — 6:36am",
      "content": "> quoth **Hrant** :   \n> Edwin, just be aware of the difference between making \"calligraphic\" (more properly called \"chirographic\") type (like Zapf or Majoor\\*) versus making \"synthetic\" (Bilak's term) type (like Carter or Licko).\n\nCould you elaborate on this for the benefit of the lurking ignorami? Or do you have a link that would do so? I expect the difference is that chirographic types explicitly build upon 'written' letterforms and therefore show evidence of the pen, whereas synthetic types do not. What I am not sure of, however, is why you feel the distinction is so significant. I do understand that if one _wants_ to work in one or the other style one needs to be aware of the characteristics thereof, and likewise understanding how the techniques/technology of writing impacted the forms of letters is valuable. However, I'm not sure I understand why you draw a bright line between them.\n\n> quoth **Hrant** :   \n> You might end up favoring the former, but I'd recommend the latter.\n\nAre synthetic types easier to draw? Is this a matter of taste? Or something else I've missed completely?\n\n"
    },
    {
      "time": "4 Dec 2003 — 9:27pm",
      "content": "Chirographic type is type that is somehow influenced (usually by structure, but sometimes also of finish - think Ex Ponto) by the arm/hand/broadnib\\_pen system.   \n   \nI don't know of any resource (online or otherwise) that explains the opposition between chirographic and synthetic type. Peter Bilak's Fedra specimen has some stuff. There are resources that elaborate on chirography, but they generally avoid an analytical treatment of the functionality of typography (with good reason). When you pin down a chirographer, he ends up invoking WRBWWRM as an escape clause for functionality. Which is hilarious because chirographers disdain the Emigre/PoMo school.   \n   \nIs the distinction significant? Is _type_ significant? To most of the world, not a bit, so certainly chirography shmirography isn't going to affect the world very much. But we do have to focus on the context of this way in which we've chosen to spend our time, and if we mean to help type progress (instead of vegetate, or even regress), then the distinction is central.   \n   \nWhich way of type design is \"easier\"? That's a very rich question. It depends on what kind of person you are. If you feel that control over you own creative process is the primary concern, then chirography is very attractive: it lays downs easy rules that you can follow cheerfully. But if you a) are worried more about the readability at the user's end, and b) are willing to realize that total control is illusional anyway, then chirography is nothing but an artificial limitation.   \n   \nIn synthetic type, the rules you need to build (in order to make \"good design\" easier) start form elsewhere. So I would say that chirographic type is easier if you master its rules, while synthetic type is easier if you just don't bother so much with rules (PoMo). In that pairing the former is certainly better. But chirographic type is never very hard, while synthetic type can be surreally hard (by accounting for the true nature of reading), and that's the \"real stuff\" as far as I'm concerned.   \n   \n--   \n   \nLet me try to give a concrete example:   \nIn chirography, the bowls of the \"b/d/p/q\" generally have to be the same way (not identical, I mean structured the same way). In synthetic type, they don't - and this creates a problem: what _do_ they need to be? How to avoid arbitrary results? The answer is:   \n1) Don't have such a phobia of arbitrariness - the control you have is proportional to the control you relinquish. This can be psychologically very hard.   \n2) Work backwards from the process of reading. This is technically very hard.   \n   \nYou can see why chirography is so popular: it strokes your ego, and it reduces your analytical load. You can be a free, happy artist, in your own little world of rules. Selfish.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Dec 2003 — 4:59am",
      "content": "Wow. Thanks Hrant.   \n   \nIf I understand you correctly, your preference for synthetic types is based on a rejection of what you perceive to be arbitrary rules derived from the characteristics of now-outmoded (in the context of lengthy, mass-produced texts) technologies in favor of new rules derived solely from the function of the type.   \n   \nIs that a reasonable summary? If so, what about limitations imposed by current technology? Are they to be dealt with on a type-by-type basis depending on the intended use of a given design? Or, insofar as most all designs nowadays are executed with beziers drawn on a computer, are there more general rules for legibility/readability that are a necessary consequence of that process? As well, are other old technologies still exerting undue influence on type design (punchcutting, hot metal, phototypesetting, etc.)?\n\n"
    },
    {
      "time": "5 Dec 2003 — 7:36am",
      "content": "How much should the pen influence digital letter forms in text type?   \n   \n_Letterletter_ by Gerrit Noordzij is on the side of strong pen influence. _Counterpunch_ by Fred Smeijers argues that though the starting point was calligraphy, even old style serifs are to a significant extent constructed, not pen drawn. Hrant, as you see, is militantly opposed to the influence of the pen.   \n   \nTo me, and I am much less knowledgeable than any of the above three, Smeijers' view rings true. On one hand, it is very hard to draw a good looking two story a or g that doesn't show the influence of the pen. And when you do an upper case M, if you don't let your weights be influenced by the broad-nibbed pen, the result tends to look unbalanced. On the other hand, Smeijers makes the case effectively that the look of Garamond and even Jenson are decisively influenced by construction of the punch, not the pen.   \n   \nAlso an important point is what Eric Spiekerman said: that text faces can only vary about 5% and still be readable and good. To me this means that you can be too pen influenced or get too far from the pen.   \n   \nSo to me the dichotomy that Hrant is setting up is misleading. It is rather that there is a sliding scale between pen-written and mechanical, and most successful faces, and probably all successful text faces, are somewhere in the middle range.   \n   \nIn display faces you can get away with very pen drawn scripts or very mechanical sans.\n\n"
    },
    {
      "time": "5 Dec 2003 — 8:11am",
      "content": "Hmmm. I probably should have written 'constructed' rather than 'mechanical' above - this is more accurate.\n\n"
    },
    {
      "time": "5 Dec 2003 — 9:58am",
      "content": "\\> a rejection of what you perceive to be arbitrary rules derived from   \n\\> the characteristics of now-outmoded (in the context of lengthy,   \n\\> mass-produced texts) technologies in favor of new rules   \n\\> derived solely from the function of the type.   \n   \nCouldn't have said it better myself!   \nAnd really, it was \"outmoded\" the second Gutenberg did his thing.   \n   \nAs for technology, in any form it always exerts \"undue influence\" - it forces deviations from the [perceived] ideal. But that's life, so we have to work with it (like by using TT hinting to make outline fonts look nice onscreen). However, one thing that we have to mind is potential cultural damage where it does more harm than good, such as the desecration of Arabic during its application to Linotype.   \n   \n--   \n   \nSmeijers and GN are ideologically very close (in the context of the whole)\\*. In a broader sense even Crouwel and GN are pretty close: they both apply superficial visual construction rules to something that must be derived from vision/perception/cognition instead.   \n   \n\\* GN doesn't say type has always been totally influelnced by the pen in every way, he just says it _should_ be, in most ways. To me Smeijers essentially says the same thing. And neither of them make room for conscious improvement of communication.   \n   \nAnd I'm not \"militantly\" opposed to chirography (have you ever met a militant?). I'm willing to let people choose their own way in life (even if it's a waste of potential), and I'm even on good personal terms with some strongly chirographic type designers (as long they're not so insecure as to shun me for my typographic views). Not many of them though, because artistes can't handle criticism very well.   \n   \n\\> the result tends to look unbalanced   \n   \nTo whom? Type designers (and users) who have been conditioned to see things in a certain way, sure. What do we really know about what _readers_ need? This actually reflects on the difference between display versus text type, between deliberation versus immersion - that whole network of parallels.   \n   \n\\> text faces can only vary about 5% and still be readable and good.   \n   \nWhat exactly is this benchmark, from which we need to measure?   \nThis doesn't work.   \n   \n\\> probably all successful text faces, are somewhere in the middle range.   \n   \nIt is tempting to see sliding scale (because it gives you control), but it's an illusion.   \nAnd what exactly is \"successful\"?   \n   \nBTW, \"synthetic\" is a much better term than \"constructed\", because the latter implies ruler & compass stuff and/or making type by putting pieces together, neither of which is required (or even encouraged) in synthetic type.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Dec 2003 — 10:28am",
      "content": "Yes, I agree, 'synthetic' is better.   \n   \nMy basic difference here with you, I think, is that I don't think it is likely that we will ever greatly improve on the readability of a well designed and set and printed page of Garamond or Baskerville. While I think the readibility stuff is very interesting and an important direction for improvement, I don't think it in the end is going to make a huge difference.   \n   \nBut I could be wrong, and would be happy to be proven so.\n\n"
    },
    {
      "time": "5 Dec 2003 — 10:34am",
      "content": "\\> I don't think it is likely that we will ever greatly improve on the   \n\\> readability of a well designed and set and printed page of   \n\\> Garamond or Baskerville.   \n   \n1) What exactly is the basis for this opinion?   \n2) What is \"greatly\"?   \n3) How great does the improvement have to be for it to be worth the while of type designers to push their beziers in a certain way, which costs nothing but awareness?   \n   \n\\> I don't think it in the end is going to make a huge difference.   \n   \nWell, it certainly can't make a huge difference for most of the world's population.   \nNothing related to type can.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Dec 2003 — 10:40am",
      "content": "Also: Shouldn't we use new technologies to improve functionality?   \nTypography no longer has to be static and linear.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Dec 2003 — 6:45pm",
      "content": "\\>1) What exactly is the basis for this opinion?   \n   \nWell, I am considering first that people had a very long time with the alphabet and calligraphy to try to make letter forms easily readable. And after all the end test is the person reading, which hasn't changed. And some of the scribes were, very, very good.   \n   \nThe second thing is that I don't see much change in readibility over thousands of years. If you look at a page of the Torah scroll, which has looked the same for probably 2,500 years or so - since they switch to the pen drawn Aramaic script - it is pretty much just as readable as anything today.   \n   \nThe third thing is that changes from the early model of Garamond haven't improved readability, but if anything reduced it. One change with the 'modern' styles of Bodoni etc. which are less readable in text. Another change has been the sans serifs that proliferated in the 20th century; again not a gain but a loss in text.   \n   \nA fourth thing is that you have different alphabets, and Chinese characters and I haven't ever heard that is makes a radical difference in the rate you can read with comprehension.   \n   \nThe basic thing with all of these written language systems is that they are systems of lines in closed or open forms with branches. The brain seems to get used to dealing with one, and is very, very good at decoding.   \n   \nAll this makes me think we are near some limit on what the brain can do, and the problem isn't shaping the alphabet a little differently.   \n   \nWhat I think we can do is understand better what makes for comfortable reading, and for reading with less strain. Also at the limits perhaps some innovations can really help. These are such things as very small type, signs at night, low res. screens, etc.   \n   \nI am interested in improving readibility, but all these things make me think we are talking about small improvments.   \n   \n\\>2) What is \"greatly\"?   \n   \nWell, I would be very surprised if you could increase reading speed with the same comprehension by more than 5% by any improvments in type design.   \n   \nAny improvement is great, and there are also aesthetic considerations, which are very important as well.   \n   \nThere is something beautiful and magical in letters. I just don't think there are any revolutions to come in letters, as there surely will be in science, for example.   \n   \nAll this is explaining a hunch. I don't claim to have any iron-clad proofs.\n\n"
    },
    {
      "time": "5 Dec 2003 — 7:22pm",
      "content": "Just weighing an a quick note about the\n\n"
    },
    {
      "time": "5 Dec 2003 — 8:22pm",
      "content": "\\> people had a very long time with the alphabet and   \n\\> calligraphy to try to make letter forms easily readable.   \n   \n1) They were essentially concerned with _writing_, not reading. Remember that the lc letters evolved from the UC through subconscious writing facilitation.\\*   \n2) They didn't know how we read (Javal made the first breakthrough, very recently), so how could they properly address it?   \n   \nIn fact the only pro-readability (more accurately pro-legibility) feature of the alphabet is the force of conscious \"heterogenization\" to alleviate blatant problems resulting from writing facilitation. For example, in cultures where the numeral \"1\" is written with a prominent \"beak\", the numeral \"7\" is given a horizontal bar to differentiate it.   \n   \n\\* See \"Canons of Alphabetic Change\" in The Alphabet and the Brain, p. 133.   \n   \n\\> the end test is the person reading, which hasn't changed.   \n   \nThe reader hasn't physically changed, but that's moot here. And the act of reading is in constant change, sometimes cataclysmic change, like when the Irish scribes introduced the word space in the middle ages, thereby enabling immersive reading for the first time. But more often it's subtle, like when people started reading less books on pedestals and more newspapers on trains.   \n   \n\\> the Torah scroll ... is pretty much just as readable as anything today   \n   \nThe Hebrew script is actually known to be extremely slow to evolve. But Latin has changed a lot, not least since Gutenberg.   \n   \n\\> changes from the early model of Garamond haven't improved readability, but if anything reduced it.   \n   \nDifferent time periods have different amounts of respect for typographic quality. Sure, the 19th century mostly sucked, but what about Unger's fonts for example? It doesn't sound right for you to say there's no more room for improvement. That's never been true about anything in life.   \n   \n\\> Chinese characters and I haven't ever heard that is makes a   \n\\> radical difference in the rate you can read with comprehension.   \n   \nWhere have you looked?   \n   \n\\> 5%   \n   \nI think we can do 15% pretty easily.   \nBut even 5% is worth it, when you consider the aggregate savings.   \n   \nAnd that's not counting improvement via dynamic and non-linear techniques.   \nMy hunch is that in an ideal setup 50% is not unrealistic.   \n   \n\\> There is something beautiful and magical in letters   \n   \nAs long we don't think they're Holy - thus stunting progress.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Dec 2003 — 9:11pm",
      "content": "\\> I am a far sight better with a pencil and bezier program   \n   \nThe good news is that -contrary to what the chirographers will insist- the important thing is to control the boundary between Black and White - which is best done with outlines. When you focus on the relationship between the two edges of the Black instead (GN's \"moving front\"), good notan becomes demoted. You can't have both.   \n   \n\\> constructed type   \n   \nThe modularity you describe is actually not a requisite of synthetic type. Not only that, I would even say that such modularity is a sister to a central tenet of chirography, where the modules arise from the motions the hand favors. This is what I meant by the [unwitting] brotherhood between Noordzij and Crouwel, and how they're both hopelessly superficial. BTW, the punchcutters used modularity too (through the use of counterpunches).   \n   \nModularity is its own thing (that needs to be controlled).   \n   \n\\> you must learn how to fix the problems   \n   \nAnd it's the same for chirography! Think of the \"z\" for example. Or optical compensation (something the GN school never addresses).   \n   \n\\> people have forgotten how to write   \n   \nThey've also forgotten how to forge their own horseshoes. So what?   \nAs long as they're leaning new things\\*, it's all good.   \n   \n\\* Which I actually agree they're not doing enough, but that's tangential.   \n   \n\\> Virtually every letter shows the effect of the pen.   \n   \nI wouldn't argue that type has generally reflected the pen (and it continues to do so). Some people even point out that the famous Romain du Roi -which was supposed to be the first synthetic type- was in fact chirographic (at least to some extent). History is not the point, the future is. What does type _need_ to be?   \n   \n\\> don't forget your pencil.   \n   \nCertainly, but only because the pencil is very different than the broadnib pen: the former creates outlines, the latter merely Black. I use a pencil myself, but only because computer software simpy isn't good enough yet - or you could say I'm not good enough to use it to good effect, since some of the most accomplished designers (like Carter) work directly on the computer. That's totally different than chirography.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Dec 2003 — 6:16am",
      "content": "I'm not going to try and argue the readablility issue of chirographic vs. synthetic. Just trying to suggest which might be easier for a beginner since they likely have more practice with the tools. (my main point, in response to the original question)   \n   \nAs I alluded to, chirographic type is a dying art, mainly limited to display at this point. So you've already won the battle Hrant. Perhaps the proof is in the pudding. Regardless, I can think of dozens of designers who are doing synthetic type for text. I'm having a hard time at this early hour coming up with one chirographic designer.   \n   \nIt is not the trade of blacksmithing that I'm notalgic for, it is crafting something unique and the message sent by doing so. It is the limited edition factor of letter writing. (totally different than making chirographic type for text\n\n"
    },
    {
      "time": "6 Dec 2003 — 7:13am",
      "content": "\\>the Irish scribes introduced the word space in the middle ages, thereby enabling immersive reading for the first time.   \n   \nI read this in Noordzij, but it seems to me to be poppycock. Is there anyone else who says this? The dead sea scrolls have word spacing, and they are more than 500 years earlier. And as there were Christian Hebraists, so the Irish clerics would have know about this. Do we have any roman letter manuscripts from earlier? Is there any reason to think that the Romans never word spaced in manuscript (as opposed to stone inscriptions)? How about cuneiform - was there ever word spacing?   \n   \nI think the big change was from reading aloud - which was normal because there would be many students or worshipers to one manuscript - to silent reading, which I believe came some time in the middle ages.   \n   \n\\>Well, it certainly can't make a huge difference for most of the world's population.   \nNothing related to type can.   \n   \nWritten language has been fundamental to the growth of civilization. You can't have law without it, for example. And universal education, the foundation of economic growth can't take place without it.   \n   \n   \n\\>improvement via dynamic and non-linear techniques. My hunch is that in an ideal setup 50% is not unrealistic.   \n   \nWhat do you mean by 'dynamic and non-linear techniques'? Why to you think such dramatic improvement is possible? Can you name one change in typography in the past 500 years that actually sped up reading with comprehension?   \n   \nI hope you're right, but I just don't see it.\n\n"
    },
    {
      "time": "6 Dec 2003 — 5:06pm",
      "content": "\\> chirographic type is a dying art, mainly limited to display at this point.   \n   \nI think you're overestimating the degree to which type has \"matured\" in this way.   \n   \nBTW, just so we're clear: I'm not some cold robot - I value \"humanism\" very much, it's just that since the conveyance of the hand in type _is_ in the end a losing battle, it simply distracts us from the things we _can_ do regain some of the humanity we've been losing since the so-called Englightenment. And I love expressing myself - it's just instead of tangible shapes made by hand, I'm turned on by expressing my thoughts - often in the form of glyphs. When I make a glyph like the \"d\" in my Patria, I'm expressing something to some extent very personal, even though I didn't use the arm/hand/pen system. And I even enjoy using my hands, although I admit I don't do that sort of thing often enough - I think most of the West doesn't.   \n   \nAnd is this amazing individual somehow acultural?   \n [http://news.bbc.co.uk/2/hi/south\\_asia/3253168.stm](http://web.archive.org/web/20130819155605/http:/news.bbc.co.uk/2/hi/south_asia/3253168.stm)   \n   \n--   \n   \nBTW, about the \"M\": there are some textish fonts with have the outside stems thick and the inside diagonals thin. How can we know that's less readable?   \n   \n--   \n   \n\\> poppycock   \n   \n?   \nThere's a whole book about it: Saenger's \"Space between words\".   \n   \nI don't know about Hebrew, but Latin was in fact devoid of word spaces before those Irish monks invented it, _improving_ the act of reading immenselty. Why is it so uncomfortable realizing that the level of quality in typography generally improves over time? Do you think it sprung out of some Supreme Being fully formed and perfect?   \n   \n\\> the big change was from reading aloud   \n   \nWhich was precisely enabled by the invention of the word space!   \nWithout it reading silently is much slower than reading aloud.   \n   \n\\> Written language has been fundamental to the growth of civilization.   \n   \nBut contrary to what Noordzij would have us believe, its absense does not preclude civilization. In fact I would point out that the most uncivilized behavior seems to come from people who have been literate the longest!   \n   \n\\> Can you name one change in typography in the past 500   \n\\> years that actually sped up reading with comprehension?   \n   \nNope. The time is ripe! Maybe we can invent something as huge as the word space?   \n   \nThe idea of dynamic and non-linear type isn't anything fancy. One idea is to display text on a screen in one spot and refresh the display intelligently. This would remove saccades from the act of reading, thus greatly increasingly comfort. Huge. Keep an open mind, that's the only way to progress.   \n   \nHow do you think we advanced from using scrolls to using books?   \n   \nhhp\n\n"
    },
    {
      "time": "6 Dec 2003 — 6:27pm",
      "content": "\\>I don't know about Hebrew   \n   \nNow you do know about word spaces in Hebrew, as least as old as this Dead Sea Scroll:   \n   \n [http://www.loc.gov/exhibits/scrolls/images/psalm-b.jpg](http://web.archive.org/web/20130819155605/http:/www.loc.gov/exhibits/scrolls/images/psalm-b.jpg)  \n   \nThe Irish may have introduced word spaces to Latin, but frankly I am skeptical. In any case it is ridiculous to to call an 'invention' what Hebrew had been doing likely for a thousand years, and which the monks had reason to be well aware of.   \n   \nHrant, my mind is open on the improvements. I am skeptical, but I am happy that you are taking on the challenge.\n\n"
    },
    {
      "time": "6 Dec 2003 — 10:37pm",
      "content": "Can you provide a close-up view of that scroll? Preferably with some transliteration of a snippet of it.   \nI have a feeling the spaces might be something besides _word_ spaces, but I'm just guessing.   \n   \nAnyway, even if I agree that \"invention\" might not be the best word (kinda like Gutenberg didn't invent jack :-), I can't know if the Irish monks were working from a precendent or not, but I have no reason to doubt Saenger as to the origins of the word space in Latin (and I can't think of any good reasons you should either), and in the context of this discussion it doesn't really matter who did it first: the point is that reading in Latin went through an upheaval between the time words spaces were not used (as we know they were not for over a thousand years), and the time they were (whenever that was, but apparently in the early Middle Ages).   \n   \nMost to the point, there's no reason to doubt that other such   \nleaps in functionality are possible, especially now that we can:   \n1) understand reading much better than before;   \n2) display text dynamically;   \n3) customize the typography to the user;   \n4) track eye movements realtime.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Dec 2003 — 4:54am",
      "content": "> sayeth **Randy Jones** :   \n> On a seperate note: It is still important to trace over Bodoni with a chisel nibbed pen.\n\nFirstly, by 'chisel nibbed' you mean something more or less like [this](http://web.archive.org/web/20130819155605/http:/www.gellyroll.com/products/pens/pigmacallipen/callipen.html), no? If so, for purposes of the current discussion does it differ significantly from, say, a good broad-nibbed fountain pen or the flat tips used with the quill-style pen holders I remember from art classes?   \n   \nIf not, then according to the [Underware workshop](http://web.archive.org/web/20130819155605/http:/www.typeworkshop.com/index.php?id1=type-basics&id2=&id3=&id4=&id5=&idpic=04#pictloader) linked from this thread, Bodoni is the result of varying pressure with a sharp-tipped pen, rather than varying orientation with a flat-tipped pen. Or am I missing something?\n\n> continued **Randy** :   \n> I would also encourage you Setmajer, even if you dive headlong in to a bezier program, don't forget your pencil. You can mess with handles for hours trying for something a pencil would give you in 5 minutes.\n\nI agree, of course. I've been working on several things as I have time (logotypes for my own use, nothing of any great interest) and have actually abandoned the computer altogether until I am quite certain what it is I want. Illustrator's pencil tool + a WACOM can be a lovely thing, but I find even that is no substitute for meatspace drawing.   \n   \nI would quibble just a touch regarding speed: hand drawing is no doubt faster for someone with even modest hand skills, but mine are so poor as to make even a rough sketch of a single letterform an hour-long project. :-(\n\n"
    },
    {
      "time": "7 Dec 2003 — 6:09pm",
      "content": "Hi Setmajer.   \n   \nThe point of the excercise with Bodoni is not to the pen or even the results you produce. The point is to really look at bodoni. To really see where the thick parts are, where are the thin parts. How does it transition between the two. Then you are on your way. (But yes that pen would work I'd use something even more chiseled. One that would give you a razor thin thin, and a really thick thick. maybe 1 to 5 ratio).   \n   \nRandy\n\n"
    },
    {
      "time": "7 Dec 2003 — 8:35pm",
      "content": "\\> does it differ significantly from, say, a good broad-nibbed fountain pen   \n   \nMaybe a felt pen can go \"backwards\" whereas a fountain pen can't?   \nIf so, that's a huge difference.   \n   \nBTW, in the chirographic workspace there are three \"dimensions\": translation (movement), expansion (pressure), and rotation.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Dec 2003 — 2:01am",
      "content": "> informed **Randy Jones** :   \n> The point of the excercise with Bodoni is not to the pen or even the results you produce. The point is to really look at bodoni. To really see where the thick parts are, where are the thin parts. How does it transition between the two.\n\nAhh. Back when I was studying visual communications at NIU (cheap but decent; most profs also taught at the School of the Art Institute and Illinois Tech) they had us tracing a number of faces, including Bodoni. They did not specify a tool, though, and most of us used pencil for comps and Sakura fine point pens for 'finals'. More recently, I've been drawing them over from the old specimen book as my tracing paper seems to have gotten lost on the road from Chicago to NYC to Bonn, and as I'm moving back to Chicago I've not got the Euros to replace it (I'm a web developer by trade, so this is all hobbyist stuff for me).\n\n> continued **Randy** :   \n> But yes that pen would work I'd use something even more chiseled. One that would give you a razor thin thin, and a really thick thick. maybe 1 to 5 ratio\n\nDo you know of a brand offhand? As I said I'm strapped now, but I'm keeping a list of supplies/books/software to purchase as soon as I'm gainfully employed again.\n\n> posited **Hrant H Papazian** :   \n> Maybe a felt pen can go \"backwards\" whereas a fountain pen can't? If so, that's a huge difference.\n\nTrue, and a good broad-tipped fountain pen will, as I understand it, increase or decrease line width relative to pressure like a sharp-tipped pen. Still, it seems to me if one is learning the mechanics of the strokes one could just not go backwards. My concern was that there might be characteristics intrinsinc to the tool, rather than techniques one can refrain from using, which make it pointless to try to 'simulate' the tool with something second-best. Naturally, I understand that second-best is, well, second-best. But better second-best than not at all, no?\n\n> furthered **Hrant** :   \n> BTW, in the chirographic workspace there are three \"dimensions\": translation (movement), expansion (pressure), and rotation.\n\n_nod_ I picked that up from [Gerrit Noordzij](http://web.archive.org/web/20130819155605/http:/www.letterror.com/noordzij/index.html), mentioned earlier in this thread (I do at least _try_ to pay attention, however thick I may seem :-). But I see translation and rotation as two sides of the same coin: both rely on the orientation of a flat- or chisel-tipped pen relative to stroke direction. Expansion operates independently of the orientation of the pen, and in fact does not rely on the pen having a flat or chisel tip at all. Rather, what seems to be important is that the tip tapers at the end so that increased pressure brings more of the tip in contact with the paper. Is that right?\n\n"
    },
    {
      "time": "8 Dec 2003 — 7:29am",
      "content": "\\> they had us tracing a number of faces   \n   \nBut, again: tracing over the _edges_ is totally different than tracing over _the body_ of the Black with a broadpen.   \n   \n\\> Expansion operates independently   \n   \nI wouldn't say so, because its given effect depends on the present angle of rotation (and of course the location of the point).   \n   \nhhp\n\n"
    },
    {
      "time": "8 Dec 2003 — 8:47am",
      "content": "> clarified **Hrant H Papazian** :   \n> But, again: tracing over the edges is totally different than tracing over the body of the Black with a broadpen.\n\nMakes sense. But here the distinction between a broad pen tip and a chisel tip isn't as significant in terms of what you're learning, or? I mean, as far as going backwards, they didn't have felt tips back when Bodoni was designed, did they? So lack of that ability shouldn't matter\n\n"
    },
    {
      "time": "8 Dec 2003 — 9:00am",
      "content": "BTW, I just noticed this in Bilak's Fedra specimen... There's a small picture showing some of his sketches for different ampersands. His sketching technique, is (I suppose) Noordzij's 'moving counterpoint'.\n\n"
    },
    {
      "time": "8 Dec 2003 — 9:09am",
      "content": "Bilak is a very interesting designer precisely because he's torn between chirographic and synthetic design, and the battle is producing some most interesting results. My hope is he'll go the Bloemsma way, but the journey is more important.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Dec 2003 — 10:34am",
      "content": "fyi, Another workshop in the works   \n   \n [http://www.typeworkshop.com/index.php?id1=Rovaniemi\\_12\\_2003&id2=daily&id3=day1](http://web.archive.org/web/20130819155605/http:/www.typeworkshop.com/index.php?id1=Rovaniemi_12_2003&id2=daily&id3=day1)\n\n"
    },
    {
      "time": "8 Dec 2003 — 10:55pm",
      "content": "Very nice trhead. About the reading speed improvementI have started questioning out if the mind's comprehension hability can be a limit.\n\n"
    },
    {
      "time": "9 Dec 2003 — 6:48am",
      "content": "Any cheap felt tip is fine. Use what you have.   \n   \nI continue to point to [this resource](http://web.archive.org/web/20130819155605/http:/www.typophile.com/forums/messages/4100/modern_caps-7240-18160.pdf) which shows the modern cap proportions based on the H and E. Also, drawn in a black bodoni for the purposes mentioned. Other tasty tidbits on the chart: decending R foot, cleavage on the R and B, the X ordeal, how to do the thick diagonal on an N, how to do the apex on an A, V+V vs W. Enjoy.   \n   \nAs far as the bodoni tracing, maybe don't even trace it. Try to recreate the letters in the chart above using the broad pen. Do the thicks in one thick stroke, the thins in one thin stroke. Dont worry about pretty letters. These won't win any contest, but at least they are \\*correct\\*   \n   \nRandy\n\n"
    },
    {
      "time": "11 Dec 2003 — 6:33pm",
      "content": "Great tips, Randy!\n\n"
    },
    {
      "time": "14 Dec 2003 — 10:11am",
      "content": "There is an extensive text by Bilak in the latest issue of the Japanese IDEA magazine, where he explains his synthetic approach towards type design. ( [http://www.idea-mag.com/cgi-bin/book/catalog.cgi?language=en&item=302](http://web.archive.org/web/20130819155605/http:/www.idea-mag.com/cgi-bin/book/catalog.cgi?language=en&item=302)) Worth a read, if you manage to find a copy.\n\n"
    },
    {
      "time": "30 Dec 2003 — 3:44am",
      "content": "I know I have it (Dwiggins-Ruzicka) as a facsimile in some book. But I can't remember which. If any one knows, let me know and I'll scan it.\n\n"
    },
    {
      "time": "30 Dec 2003 — 4:15am",
      "content": "The \"WAD to RR\" letter seems to be available as text at:   \n   \n [http://www.cs.kun.nl/~freek/books/wadtorr.sat](http://web.archive.org/web/20130819155605/http:/www.cs.kun.nl/~freek/books/wadtorr.sat)   \n   \n/m\n\n"
    }
  ]
}
