{
  "id": "2272",
  "title": "Beardsley",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hi!   \nThis is my first post on this forum.   \nI would like some feedback on my new   \ntypeface inspired by the art of Aubrey Beardsley..   \n   \n ![sample](http://web.archive.org/web/20150417183346im_/http:/www.typophile.com/forums/messages/29/2160.gif)\n\n",
  "author": "danielw",
  "time": "16 Aug 2002 — 1:34am",
  "uid": "1154",
  "comments": [
    {
      "time": "16 Aug 2002 — 1:50am",
      "content": "wonderful! Texture!\n\n"
    },
    {
      "time": "16 Aug 2002 — 1:51am",
      "content": "I feel moved and enlighted. Is this what nirvana feels like?   \n   \nSeriously, Daniel. Once you get the spacing   \nright this thing is ready to be sold to masses   \nof Beardsley and beauty fans everywhere.   \n   \nLike what's up with the 'I' 'J'? Is that just   \nso the 'I' lines up with the 'W' for the sample?   \n   \nGo ahead and slap this on a shirt for the   \nTypophile Tee Shirt Contest and win.\n\n"
    },
    {
      "time": "16 Aug 2002 — 1:51am",
      "content": "snälla. jag vill ha.\n\n"
    },
    {
      "time": "16 Aug 2002 — 1:54am",
      "content": "God, I love this! Who do I have to sleep with to get a copy of it?\n\n"
    },
    {
      "time": "16 Aug 2002 — 1:56am",
      "content": "very nice Daniel. I have seen a lot of designs going in this direction but somehow this looks more historical. I would perhaps try to modify the areas indicated. the S has one shorter   \nstem. the short lines look a bit out of place with everything else in my opinion.   \n ![type.jpg](http://web.archive.org/web/20150417183346im_/http:/www.typophile.com/forums/messages/29/2161.jpg)\n\n"
    },
    {
      "time": "16 Aug 2002 — 2:00am",
      "content": "I disagree a bit with Ole. The short lines are   \nperfectly consistent with the design . The 'S'   \ncould use another look tho.\n\n"
    },
    {
      "time": "16 Aug 2002 — 2:03am",
      "content": "It would be nice to see this up close. Do the   \nwindy, scrolly lines have rounded or straight ends?\n\n"
    },
    {
      "time": "16 Aug 2002 — 2:36am",
      "content": "Thank you everyone for your kind words and critic!   \n   \nRichard: Tack, kul att se lite svenskar på forumet! :D   \nOle: Yes, i´ve been thinking of changing them, i will post a new version later today with these lines removed.. In the new version I will also change the \"S\" as suggested by Stephen Coles   \n   \nStephen Coles: Thanks alot!   \nIm currently working on the spacing so that whats weird with the \"I\" and the \"J\" i guess (if i understod you question correct ![:)](http://web.archive.org/web/20150417183346im_/http:/www.typophile.com/forums/clipart/happy.gif))   \n   \nthis is what the typeface looks like up-close:   \n   \n ![upclose](http://web.archive.org/web/20150417183346im_/http:/www.typophile.com/forums/messages/29/2162.gif)\n\n"
    },
    {
      "time": "16 Aug 2002 — 2:44am",
      "content": "Perhaps the C looks a bit E-ish? ![:)](http://web.archive.org/web/20150417183346im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nI think it would work in a text setting, it's just that the C alone looks a bit much like an E.   \n   \nDet vore jättebra om du kunde skicka ett mail till mig på [richardwikstrom@home.se](mailto:richardwikstrom@home.se)   \n   \nJag har lite frågor...   \n   \nNice work to sum it up, really nice!\n\n"
    },
    {
      "time": "16 Aug 2002 — 2:56am",
      "content": "Ok, ok. I'm getting very giddy here at 4 a.m.   \nthinking about the emense possibilities this   \nfont holds. For instance:   \n   \n1 - Consider making 3 seperate fonts, one as it   \nis now, one with the heavy \"alphabetic\" lines,   \nand one with the windy scroll lines. This would   \nallow the designer to combine the fonts and color   \nthe two elements seperately. Layering is hip.   \n   \n2 - Create another font in which the windy scroll   \nlines extend out of the letters. Could also be   \nanother layerable font.   \n   \n3 - Create a bitmap version. You think I'm kidding?   \nTalk to this guy: [Miguel Hernandez](http://web.archive.org/web/20150417183346/http:/www.typophile.com/forums/messages/29/1944.html). He makes   \ndisplay fonts out of pixels.   \n   \nAbout the short lines... I'm beginning to see why   \nsome work and some don't. On the 'M' the lines   \nare a continuation of the flow of the lines above   \nit - they are just crossed by another pair. So   \nI think they work on the 'M' and 'R'. On the 'Q'   \nand 'O' they seem to be space fillers rather   \nthan continuations of the lines. This makes them   \ndistracting. You see? Or am I dillusional from   \nlack of sleep?   \n   \nStephen\n\n"
    },
    {
      "time": "16 Aug 2002 — 3:25am",
      "content": "For those who don't know him, [here's](http://web.archive.org/web/20150417183346/http:/161.58.208.54/artchive/b/beardsley/beardsley_venus_tannhauser.jpg)  \na nice example of Beardsley curlage.\n\n"
    },
    {
      "time": "16 Aug 2002 — 3:32am",
      "content": "Yeah. There were some great Velvet Underground posters in that style in the late 60's...\n\n"
    },
    {
      "time": "16 Aug 2002 — 4:59am",
      "content": "Daniel, you've certainly captured that fin-de-siecle decadence of Beardsley and Wilde. It's also strangely reminiscent of some good ol' Letraset stuff, ca. early 70s.   \n   \nOne technical question: It's hard to tell exactly from just a screen rasterization, but did you build any overshoot into all those rounds? I can't see any in the samples, and it's disturbing the rhythm, to my eye. But maybe its just the low resolution of the gifs.\n\n"
    },
    {
      "time": "16 Aug 2002 — 9:07am",
      "content": "This **IS** amazing. And I completely agree with Stephen. I **WANT** to see this on the typophile t-shirt contest!   \n   \nAlso, Stephen's idea about 3 separate fonts -- Did you mean this (for my visual impairment) to be similar to the woodcut fonts that have fills?   \n   \nShort lines -- because they only appear in such small amounts, this is perhaps why they don't quite jive with the rest (?)   \n   \nLOVE -- ABEFGIJNPTUVXY   \nTWEAK -- C, go a little more traditional on the heavy stroke; D, not sure about the tiny little corner; H, not loopy enough; K, could the scrolling lines intertwine just as the heavy strokes (?); L, too similar to the J; M, i see an R; O, short lines; Q, short lines; R, short lines; S, again a little more traditional on the darker stroke   \nWORK -- MWZ all three are a little too wacky.   \n   \nbut hey. this is amazing and maybe my boring old traditional eyes are wanting too much? as for the I & J, what if there was a hanging alternate J ? by the way, i think the T rocks!\n\n"
    },
    {
      "time": "16 Aug 2002 — 11:20am",
      "content": "Uh oh - Tiffany has become code happy. (Those bolds!)   \n   \nThe 3 fonts...   \n   \nFont A - The design as it exists.   \nFont B - Contains only the thick lines - the forms of the letters.   \nFont C - Contains only the curly, scroll lines.   \n   \nThe idea is to allow the user to seperately   \ncontrol the color of each element. For instance:   \nif there was a legibility concern, the user could   \nmake the alphabetic forms a slightly darker color   \nthan the inside ornamentation. The different fonts   \nwould allow this change much quicker than tedius   \nediting in Illustrator.   \n   \nIf there is room for expiramentation with the inside   \ncurls, there is an opportunity for two more fonts:   \n   \nFont D - Could contain alternate (maybe longer), scroll lines.   \nFont E - The full design with the alternate scroll lines.\n\n"
    },
    {
      "time": "16 Aug 2002 — 11:47am",
      "content": "Stephen, good plan.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Aug 2002 — 12:05am",
      "content": "Hi, and thanks for all the feeback!   \nHeres the new (and hopefully) improved version of the typeface based on your feedback.. beside reworking many of the chars i've also fixed the overlaps of the thin lines and made them \"rounded\" .. I still feel that it need some work so please continue to give feedback!   \n   \n ![new version](http://web.archive.org/web/20150417183346im_/http:/www.typophile.com/forums/messages/29/2182.gif)\n\n"
    },
    {
      "time": "19 Aug 2002 — 12:13am",
      "content": "The absolute loveliness of the typeface hinders any worthwile critique. sorry ![:)](http://web.archive.org/web/20150417183346im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nIt's looking even better though.\n\n"
    },
    {
      "time": "4 Sep 2002 — 2:44pm",
      "content": "The sentence \"timeless\" fits in pretty well at this one i think. So the purposes can be many.   \n   \nEtt gedigert arbete Daniel.   \nDu såg aldrig när jag snodde en kopia av den va?   \n ![:)](http://web.archive.org/web/20150417183346im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "17 Nov 2008 — 10:06am",
      "content": "So, whatever happened to Mr Wallberg and his amazing Beardsley? Has anyone heard from him in the six years that have passed since this thread was started? I’d love to see this face released (as would a few other folks, I’m sure.)\n\n"
    },
    {
      "time": "17 Nov 2008 — 11:12am",
      "content": "I haven't heard from him, Grant. Probably have the same email address that you do. :/\n\n"
    },
    {
      "time": "17 Nov 2008 — 7:00pm",
      "content": "Sigh. Haven’t heard anything back from him at that address, unfortunately.\n\n"
    },
    {
      "time": "17 Nov 2008 — 7:22pm",
      "content": "Well, he does seem to be on Facebook.\n\nhhp\n\n"
    },
    {
      "time": "17 Nov 2008 — 9:56pm",
      "content": "I see 4 Daniel Wallbergs on Facebook and none are the fella I met while in Stockholm.\n\n"
    }
  ]
}
