{
  "id": "2273",
  "title": "Critique, kind words and negative ones please.",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello.   \nSo, here follows my first modest attempt at creating a face, and my first post here as well.   \n   \nThis first part of rambling concerns the \"display\" version:   \nWhat I initially had in mind was indeed a very dark 'grotesk' (yes I'm danish which is quite close to germany). And it was supposed to have been a display face including only capitals. As I progressed I felt it perhaps could be more and started working on lowercase as well. It is not to be seen as complete, rather very much in progress.   \nThe lowercase alphabet caused me a lot of troubble, and right now I can't seem to get on with it, so please critique would be nice.   \n   \nNow the \"text\" version:   \nAs I was doing the lowercase, I decided to progress it into a more human sans, and see wether that was possible. The result you see here is very much not finished, but indeed this is the face which I am in most need of critique and pointers.   \nI hope you'll help out, -Thomas   \n(By the way, the reason the lowercase 'g' is red, is that I am not quite sure wheter to do a single story or this..)   \n ![Typeface v.01](http://web.archive.org/web/20131012150055im_/http:/www.typophile.com/forums/messages/29/21603.gif)\n\n",
  "author": "tmadsen",
  "time": "2 Dec 2003 — 10:14am",
  "uid": "2723",
  "comments": [
    {
      "time": "2 Dec 2003 — 12:18pm",
      "content": "Hi Thomas,   \n   \nHere are some thoughts for you to consider:   \n1) The text version is better all the way around. I'd pursue that one.   \n2) This is condensed, but some glyphs are wide. Either narrow them up, or widen up the others. If you do intend this for text, i'd suggest widening the others. The wide letters are: c, g, s.   \n3) Again if this is in fact for text, you will probably want to decrease the x-height. That is, unless it is intended as a small-size, space saving type. In that case, you would need to refine the letterforms for performance at that size.   \n4) If you're going to put the caps with the text version, you may want to make the cap letterforms more open. (Compare upper and lower case Ss - caps vs text) Same goes for the numerals.   \n   \n5) Individual letters (text):   \ne: Has a slight overbite :-)   \ng: Tight in the waist. Drop the bottom down to rest on (or slightly above) the baseline.   \ni: Should it hook like the l? Just a thought. Or maybe it is a square serif to the right on both?   \nm,n: Is the m just two n's? if so you'll need to widen the n. If you choose to widen all the letters mentioned above, keep the m at it's current width.   \nr: Too narrow. Looks like a chopped n. You'll need to lower the join between the branch and stem + widen the branch adding a touch more heft at the end.   \ns: Looks flipped. But I bet if you rotate it 180 it will still look flipped. Try shortening the top arm. Lengthening the bottom arm, and raising the spine up to where it \\*looks\\* in the middle.   \nt: A bit wider on the right.   \nu: Looks like the n rotated 180. This make it look wider by comparison. They should \\*look\\* the same.   \nv,w: Several issues here. First, the bottoms are too flat. Look at Helvetica bold condesed for tricks to narrow up the base but keep the crotch deep (btw, this is a tough problem\n\n"
    },
    {
      "time": "3 Dec 2003 — 2:46am",
      "content": "K\n\n"
    },
    {
      "time": "3 Dec 2003 — 4:21am",
      "content": " **This place is crawling with danes!**   \n   \nNice work so far!   \nMay I suggest you focus on working with the display-version   \ninstead of both at the same time? I think it might turn out quite well...   \n   \n:-)   \n   \nFedt at se nogen kaste sig ud i det og trodse \"gamle Jante\".   \nHeld & lykke med projektet!\n\n"
    },
    {
      "time": "3 Dec 2003 — 5:17am",
      "content": "Hey, I saw my name mentioned in there :-)   \nOday ouyay eakspay Nicolaj igpay atinlay?   \n(He he. Couldn't help myself!)   \n   \nSo what will it be, my advice to go with the \\*text\\* version, or Nicolai's advice to go with the \\*display\\* version. We are a confused group aren't we?   \n   \nSince this is your first font I wouldn't worry about trying to make it too unique. Get the basics first. If it's too crazy, you can avoid wrestling with issues type designers have worked on since they put down the pen and picked up the press. My suggestion might be to make a thoroughly mundane type. Looking a lots of sources to guide your decisions. You will learn quickly in this fashion. Then use the knowledge as a point of departure.   \n   \nRandy\n\n"
    },
    {
      "time": "3 Dec 2003 — 5:52am",
      "content": "Randy wrote \\>\\> I wouldn't worry about trying to make it too unique   \n   \nYes, maybe your right, one thing at the time. I tend to be very bad at doing that :-)\n\n"
    },
    {
      "time": "3 Dec 2003 — 7:19am",
      "content": "Hello all, and thank you very much indeed for all the kind and constructive words!   \nOg ikke mindst, til danskerne ![:-)](http://web.archive.org/web/20131012150055im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nHmmm... what to choose, the text or display version? -Well indeed I am quite sure the text version would be most interesting in all aspects, as it would undoubtfully be the best 'learning experience' to throw myself into the troubbles of making it well balanced and (hopefully) legible as well.   \nAnd the possibility of adding more personality and a little more quirkyness to the face intrigues me equally. Also it would allow me to work on the capitals as well, as they would then need to be more in line with the lowercase.   \nSo, enough rambling, I think I'll leave the 'display' as it is, and focus on the 'text' version. I will continually be uploading work-progress in this thread (hopefully you might want to give me some pointers along the way..).   \nAgain, thanks for the help -this sort of thing (forums that is..) might indeed be what makes the internet great!   \n-Thomas\n\n"
    },
    {
      "time": "8 Dec 2003 — 7:32pm",
      "content": "Hi Thomas...a fellow Dane...How is the design scene is DK. I live in Seattle these days and mostly follow the work of (danish firms) Kontrapunkt and E-Types. If you know these folks get them involved with typophile.   \nAs for the the critique. Nice work. A very friendly font. I can see lots of commercial uyse. Good luck.\n\n"
    },
    {
      "time": "8 Dec 2003 — 11:49pm",
      "content": "Hi Ole.   \nThe danish design 'scene' is looking very promising indeed in my view.   \nAlthough their website is currently under redesign, you would probably want to pay attention to the danish studio A/P/O/G/S ( [http://www.apogs.com](http://web.archive.org/web/20131012150055/http:/www.apogs.com/) ) -They are in my oppinion one of the most interesting studios in denmark theese days. (They did the typeface for the danish broadcasting company DR and DR2).   \nIndeed E-types do very nice things as well, also you might want to check out: [http://www.2gd.dk](http://web.archive.org/web/20131012150055/http:/www.2gd.dk/)  \nAnyways, I will pass on your note to get people involved in theese forums... And thank you very much for the kind words!\n\n"
    },
    {
      "time": "19 Mar 2004 — 12:54am",
      "content": "I think that your descenders are a hair too long... the q especially. But I like your\n\n"
    },
    {
      "time": "19 Mar 2004 — 1:15am",
      "content": "Hi Dan.   \nThe fact that the circles connect to the letters, is not per se the norm. But if you look into danish typography history (mostly based on a handful of architects and their work), you will find this detail in many early danish faces. I suspect the original idea of this was to 'save space' in order to have lesser leading. As most of the pioneers of danish type history were architects they were indeed more practical oriented rather than focused on typography history as such. Anyway, I included this feature in the face to keep some 'nationality' in it. I would gladly post some more about dansih type history if people are interested, as the subject is something I take great interest in myself ;)   \n-Thomas\n\n"
    }
  ]
}
