{
  "id": "2276",
  "title": "(x) FLAVIA Greeting Cards - hand lettered {Mike F}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Looking to ID the font used by Flavia Greeting Cards in their logo. Go to [www.flavia.com](http://web.archive.org/web/20050516141439/http:/www.flavia.com/) to view. Script with spiral flourishes. Does anyone know what this typeface is, or if there is anything similar available as a shareware/freeware font??? Thanks for your help.\n\n",
  "author": "kenb",
  "time": "Tue, 2003-12-02 13:42",
  "uid": "2720",
  "comments": [
    {
      "time": " Tue, 2003-12-02 14:03",
      "content": "That is certainly hand drawn, Ken. Look at repeating characters, not only in   \nthe logo, but in the various other places on the site that script is used. Those   \nrepeating characters are always a bit, or much, different.   \n   \nFor example, there are lots of 'a's and 'e's in the various words and they all   \nvary. Look at the word Free on the \"About Flavia\" link and there's even a much   \ndifferent 'F' than is used in the word Flavia.   \n   \nAs far as similar fonts go, realize that there's no way to actually match a   \nflowing, calligraphic, varying script like this, but give us a few minutes to think   \nup suggestions for fonts with a similar \"feel\" (if someone hasn't already done   \nso by the time I post this).\n\n"
    },
    {
      "time": " Tue, 2003-12-02 14:19",
      "content": "Ken,   \nAs Mike said the 'Flavia' signature and some of the site lettering looks like it was hand-drawn. Since there are fonts with alternate characters and endings, it's theoretically possible that a font was used, but I would expect it to be a custom one. The curly spirals would be pretty memorable if this were a commercial font, I think.   \n   \nThe lettering shown on that site for the wording of the greeting card, does look like a font (identical letters look identical), but I didn't try to ID it as it wrote on the screen.   \n   \nThere are a couple of places to look for similar fonts in the [ScriptFont ID Guide](http://web.archive.org/web/20050516141439/http:/bowfinprintworks.com/ScriptIDGuide.html), such as Part 10, Part 4, or Part 7. You might find the font used for the 'animated' cards that way.\n\n"
    },
    {
      "time": " Tue, 2003-12-02 15:43",
      "content": "The fonts that might be acceptably similar are few enough. Your requirement   \nof freeware/shareware limits the candidates greatly, Ken.   \n   \nHere are a few possibilities:   \n [Caffe Latte](http://web.archive.org/web/20050516141439/http:/www.dafont.com/en/search.php?q=caffe%2Blatte&nb_ppp_old=10&page=1&texte=Flavia%2BGift%2BNews&nb_ppp=10) (freeware by Peter Stanton), [HipnOtik](http://web.archive.org/web/20050516141439/http:/www.geocities.com/arrfdesigns/fonts.html) (shareware by Randy Ford)   \nand [Moonpie](http://web.archive.org/web/20050516141439/http:/www.dafont.com/en/search.php?q=moonpie&nb_ppp_old=10&page=1&texte=Flavia%2BGifts%2BNews&nb_ppp=10) (shareware by Steven Lundeen).   \n   \nNon-freeware candidates that come to mind include Frivolous, Gigi, Pablo and   \nParty, all available from [MyFonts](http://web.archive.org/web/20050516141439/http:/www.myfonts.com/).   \n   \nSee Mike Yanega's site for an incredible showing of script fonts to get more ideas.\n\n"
    },
    {
      "time": " Tue, 2003-12-02 22:24",
      "content": "Blue Vinyl's [Delorita BV](http://web.archive.org/web/20050516141439/http:/www.myfonts.com/fonts/bluevinyl/delorita-bv/delorita-bv/testdrive.html?s=Flavia%20Gifts%20New&p=72) might be the closest I've come across.\n\n"
    },
    {
      "time": " Thu, 2003-12-11 21:09",
      "content": "Thank you for all the suggestions and comments.   \n   \nI wasn't limiting myself to shareware/freeware fonts - just had hoped I could find something close in the shareware offering.   \nWould gladly purchase, if I knew this was available commercially. I have sent an inquiry to FLAVIA.com. If I come up with anything, I'll let you know. Let me know if anyone comes up anything close\n\n"
    },
    {
      "time": " Fri, 2003-12-12 06:39",
      "content": "Pepe Regular and Swash has a similar feel,   \nyou can take a look at it   \nin [fontfont](http://web.archive.org/web/20050516141439/http:/www.fontfont.com/shop/).\n\n"
    }
  ]
}
