{
  "id": "2278",
  "title": "My first attempt at magazine design",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "OK guys, as I mentioned in the Magazine Design discussion (see General), I started working on a project for a new magazine that I hope to get published, with the help of a few friends and a huge dose of luck, here in Italy (I'm from Milan).   \n   \nIt will be a gay lifestyle magazine. It will focus primarily on Italy, but with an international feel (btw, did you get the Flaunt Italian issue? Nice. Hrant ,you'll probably like the lavish Monica Bellucci centre article!). The text will be in Italian.   \n   \nAfter doing a lot of research, two certainties:   \n1) ALL gay magazines look like CRAP (So much for the myth that most gay men have good taste!)   \nSeriously, I coudn't find a single one decently designed. Attitude (UK), Out (US), Zero (Spain), Tetu (France) are the best ones, but they are all very average stuff.   \n   \n2) Italian gay magazines are even MORE CRAP. The biggest one, Babilonia, is a horrid mess (both in terms of design and content). Honestly, guys, even if I assume most of you wouldn't be interested, I'll spare you the JPGs, because of its utter ugliness (I know the guy who does it, he's a nice guy, but he's NOT a designer and it shows). All other Italian gay magazines are free, and, essentially, fanzines.   \n   \nThat said, here's where I'd like some opinions from you, if you can bother:   \n   \n1) I'd like it to be a mainstream title, but with some class (this magazine won't be free). I'm looking at the currently best designed men magazines around for ideas. I like Details and the US Esquire (I agree with you Tiffany on this one, if you're reading). Most of all, I like the colors of these two, which are pretty similar.   \n   \n2) The magazine will be 230 x 287 mm (same as Colors Magazine), printed on uncoated paper. I'd like it to be not too busy, with more generous white space than the two titles I mentioned before.   \n   \n3) Here's the deal for typefaces:   \none serif body text for main articles;   \none sans for departments (and possibly headlines);   \nmaybe an additional headline face.   \nYou think two faces, with a versatile sans, should be enough?   \n   \nSANS: I really, REALLY like the new DTL, Prokyon. Not availabe yet, unfortunately, and I fear outrageously expensive, like all DTFs. Have a look at its PDF ( [http://www.dutchtypelibrary.nl/Nieuws.html](http://web.archive.org/web/20131108084353/http:/www.dutchtypelibrary.nl/Nieuws.html))   \n   \nSERIF: guys, you input here is mostly needed!   \nMy favorite serif EVER is still FB Proforma, but I'm only slightly concerned that the Book weight is a little too light and its Medium a little too dark (although it is beautifully used in Eye magazine) at 9,5/12, which is what I used to build the grid.   \nI also happen to like a lot the Baskervilles and their revivals. I was never too fond of Licko's Mrs. Eaves; the new FF Atma (by Alan Green) is prettier, but I'm still not convinced. [Mid Caps? Quarter Caps? Hmmmmpf.])   \nI recently saw the face used as main text in the Typography 22 Type Directors Club Annual and immediately fell in love with it: Letraset/Fontek Eplica, by Yvonne Diedrich. It looks beautiful at small sizes and it has a very distinctive structure. I don't really care about the fancy ligatures (similar to Mrs. Eaves), but I think its \"bilateral serif construction\" is truly interesting.   \nWhat do you guys think of it ( [http://www.letraset.com/LetrasetUK/Templates/Letraset/mainscreen.asp](http://web.archive.org/web/20131108084353/http:/www.letraset.com/LetrasetUK/Templates/Letraset/mainscreen.asp))?   \n   \nHEADLINES: If I decide to add a headline only face, I like the new HTF Gotham by Frere-Jones ( [http://www.typography.com/catalog/gotham/index.html](http://web.archive.org/web/20131108084353/http:/www.typography.com/catalog/gotham/index.html)), although I still love good old HTF Knockout.   \n   \nSo what do you think of this possible combination?   \nSerif Text: Eplica or Proforma;   \nSans text (and possibly some headlines for departments): Prokyon (although I'm still testing it, there's only a PDF!);   \n3) Headlines only: Gotham (maybe Knockout instead?).   \n   \nDo you think it may work? Other suggestions? Opinions? Your help will be really much appreciated.   \nThanks, and please excuse me for this very long posting.   \nCiao a tutti.   \n   \nPaolo\n\n",
  "author": "paolo",
  "time": "16 Aug 2002 — 4:02am",
  "uid": "922",
  "comments": [
    {
      "time": "16 Aug 2002 — 5:26am",
      "content": "Paolo --   \n   \nRegarding FB Proforma, I'd be willing to bet that Blokland did the design using MMs and that you might be able to get a custom weight in between the Book and the Medium without too much hassle. If you want to pursue it, you should talk to Harry at FB. He could tell you what might be possible and for how much.   \n   \nI've liked Eplica since the TDC last year, but I haven't seen extended text settings. I'm skeptical about how it might hold up over the long run as a primary text face in a magazine. I think it could be useful for decks and pulls, depending upon the text face. But I wouldn't use Mrs. Eaves (unless possibly the updated version has been refitted). Perhaps you would like to consider my [Whitman](http://web.archive.org/web/20131108084353/http:/www.kentlew.com/WhitmanDetail.html). _(Sorry for the shameless plug, everybody.)_ It's not as idiosyncratic or as hip as Eplica, but it is somewhat Baskervilleian (even though that wasn't my intent). I hope to be able to announce Whitman's official release very soon.   \n   \nMuch as I like them both, I suspect that the combination of Gotham and Prokyon would clash a little. I can't be sure without testing them in proximity. I think Knockout would provide a better contrast to Prokyon. And, of course, Knockout would provide a lot more opportunities for variety in your heads with all its weights and widths.   \n   \n-- K.\n\n"
    },
    {
      "time": "16 Aug 2002 — 5:35am",
      "content": "Eplica is a good choice. I think it has lots of wonderful ligatures which are always a nice bonus. For sans Prokyon does not do it for me.   \nI would suggest contacting Peter Bilak to see what release date is scheduled for Fedra Serif, it would be great with the rest of the Fedra Family and a good solution for the whole magazine. thers is even a bit map (for website0, and a mono spaced version (all unique designs)   \nperhaps it does not have the best headline version but this could be designed as a custom version. By the way I think Kent's Whitman is also a nice choice. (peters site is typotheque.com)\n\n"
    },
    {
      "time": "16 Aug 2002 — 10:02am",
      "content": "Paolo, et al --   \n   \nSeparately, your fonts choices are all very nice. I agree that Mrs. Eaves is too OTT and has also been over-used making it more than a face to simply be read. Prokyon -- wow! -- Hrant, check out the lowercase g, two amazing choices for you! Gotham is great, I purchased it and have been using it for this and that and I love it. You might send a wish list to the friendly people at HTF and mention a desire for more weights, you might not be denied. (?) Knockout **IS** a knockout.   \n   \nIMHO and especially in magazine design (if not all design) less is always more. This, I think, applies to your typefaces. I personally would pick families with a lot of variety. Titling, text and smaller text for the serif and ultra thin to mega fat for the sans. Cover all of your bases.   \nSERIF: Have you looked at [Hoefler's Requiem](http://web.archive.org/web/20131108084353/http:/www.typography.com/catalog/requiem/index.html)? **Beautiful, Elegant** or their Hoefler Text? [Hoefler's Text](http://web.archive.org/web/20131108084353/http:/www.typography.com/catalog/hoeflertext/index.html) which also has [Hoefler's Titling](http://web.archive.org/web/20131108084353/http:/www.typography.com/catalog/hoeflertitling/index.html). Have you looked at [Font Bureau's Eldorado](http://web.archive.org/web/20131108084353/http:/www.fontbureau.com/fonts/font_frames.tpl?cart=323847932975971&fontname=Eldorado)? I really haven't noticed recently, but it really used to be used quite elegantly by Entertainment weekly. If you do want something a little more idiosyncratic, but in a good way IMHO, try [Emigre's Vendetta](http://web.archive.org/web/20131108084353/http:/www.emigre.com/EF.php?fid=130) I do think this face is very beautiful and I haven't seen it used very much. But it doesn't offer titling and text weights, which is a problem for publication design. One other that I find very elegant and it does have companions of variance, is [Typofonderie's Le Monde Livre](http://web.archive.org/web/20131108084353/http:/www.typofonderie.com/Alphabets/LMLivre.asp).   \n   \nSANS: [Font Bureau's Noble](http://web.archive.org/web/20131108084353/http:/www.fontbureau.com/fonts/font_frames.tpl?cart=323847932975971&fontname=Nobel), perhaps [Le Monde Sans](http://web.archive.org/web/20131108084353/http:/www.typofonderie.com/Alphabets/LMSans.asp) should you choose Le Monde Livre? And you could use [Anisette](http://web.archive.org/web/20131108084353/http:/www.typofonderie.com/Alphabets/Anisette.asp) and [Anisette Petite](http://web.archive.org/web/20131108084353/http:/www.typofonderie.com/Alphabets/AnisettePetite.asp) for display and flavor? or you could try [Berthold's Gerstner Original](http://web.archive.org/web/20131108084353/http:/www.bertholdtypes.com/bq_library/90012.html) paired with [Corporate S](http://web.archive.org/web/20131108084353/http:/www.bertholdtypes.com/bq_library/090152000.html) for a more cool feel. There is [Agenda](http://web.archive.org/web/20131108084353/http:/www.fontbureau.com/fonts/font_frames.tpl?cart=323848045177327&fontname=Agenda) with tons of variety also. And there is also [Rhode](http://web.archive.org/web/20131108084353/http:/www.fontbureau.com/fonts/font_frames.tpl?cart=323848045177327&fontname=Rhode)   \n   \nAs boring as this perhaps will make me, I think that you really will be happier with streamlining your font choices. Even if you choose two serif families and two sans faces they should still harken to something similar. What I mean by this is not mixing the humanist sans with the grots or the oldstyle serif with the transitional.   \n   \nI like the idea of uncoated paper, but considering your desires, I might consider a dull or matte coated instead. I do like the paper _Colors_ uses.   \n   \nThis is exciting. Thanks for including us Paola, mille grazie!\n\n"
    },
    {
      "time": "16 Aug 2002 — 10:57am",
      "content": "Slight oversite on my part, but [Kent's Whitman](http://web.archive.org/web/20131108084353/http:/www.kentlew.com/Type.html) would be great for a body face. Kent, any plans for display versions?\n\n"
    },
    {
      "time": "16 Aug 2002 — 11:46am",
      "content": "\\> more generous white space than the two titles I mentioned before.   \n   \nI don't know about gay Italians, but personally I like white space when it's not white. And I don't mean a solid color either, I mean a texture. Check out the \"L'Occitane\" brochure for a breathtaking example. A weak view here: [http://www.loccitane.com/usa/index.html](http://web.archive.org/web/20131108084353/http:/www.loccitane.com/usa/index.html)   \n   \nFonts:   \nIt's always tempting to read too much into the demographic and make crazy associations in your design choices. I think it's useful and necessary to make associations, but it has to be toned down to work in real life.   \n   \nI think Prokyon would be a superb choice. Also look at Tankard's brand-new Aspect:   \nhttp://www.typography.net/type/aspect.htm   \nBut it doesn't have a nice dark weight.   \n   \nProforma is one of my all-time favorite designs, but I'm not sure it works here. Do you have a view of Eplica that doesn't require a site registration? Atma, I don't see working at all, even though I love the multiple cap sizes. Gotham I don't think works here, but maybe Knockout. Mrs Eaves is pretty, but the horrid spacing makes it unsuitable for text (as Kent implied, but so tactfully).   \n   \n\\> So what do you think of this possible combination?   \n\\> ....   \n   \nWell, unless Eplica is a really plain design (or if it's close to Prokyon - unlikely) I think it's too busy.   \n   \nWait a second, OK, I see Eplica at the TDC:   \nYeah, it's too strong to coexist with your other stuff. Plus it couldn't carry too much text anyway. If you want people to read your magazine (not just look at the pictures), then you need to be more subtle.   \n   \nKent:   \n\\> you should talk to Harry at FB   \n   \nHmmm.   \nKent, am I smelling Whitman coming out at FB?   \n   \nPaolo, Whitman might in fact be a great choice (maybe a breath of fresh air in your seemingly overdesigned environment), and it will be released soon I think.   \n   \nThe Fedra series might actually be a good choice, but it depends on the upcoming serif version, noting that Bilak's previous text face (Eureka) is too loose for readability. Sure, you can tighten it, but only if you're willing to manually add some positive kerning pairs for the resultant clashes.   \n   \nI was going to suggest the wonderful Kepler/Meridien/Vendome triumvirate, but maybe it's too stodgy.   \n   \nAlso consider Bloemsma's unique Avance, possibly with Cocon for heads.   \n   \nTiffany:   \n\\> Hrant, check out the lowercase g, two amazing choices for you!   \n   \nBut I think Kent is right that the bicam one got dumped. :-( Well, maybe it makes sense since it's no text face.   \n   \nI think Vendetta might be an interesting choice, but its lack of texture-versus-size compensation really cripples it.   \n   \nJFP's library is also a good place to look (he has some funky display stuff too - like Costa).   \n   \nhhp\n\n"
    },
    {
      "time": "16 Aug 2002 — 12:25pm",
      "content": "Guys, I love you, you are all great!! Thank you so much for sharing your ideas with me.   \nI certainly am NOT a typography expert as all of you obviously are (no formal training on typography here, sadly, only a graphic design degree, a healthy curiosity, and - this worries me the most - a very limited experience in print, as I've been working on websites mostly for the past 7 years). For this, I really treasure your opinions, since you have so much more experience.   \nPlease, keep going with your ideas on my project, critiques, suggestions, EVERYTHING!   \n   \nThank you Kent and Ole for your suggestions, both Whitman and Fedra look very interesting.   \n   \nFor the serif text face: for now I'll TRY using Eplica, see if it works, but of course I'm willing to reconsider. I'm still at a very early stage of the design.   \n   \nFor the sans: I definitely want to try to use Prokyon, IF it will be available anytime soon (I already wrote asking for info to the DTL guys).   \nBy doing a lot of cut & paste from the PDF, I'm trying to see if it may work for the headlines also (and even for the masthead), even though it doesn't have the versatility of Knockout, having only four weights.   \n   \nI like the idea of using two faces only for this project, and try to explore all their possible uses.   \n   \nIf Prokyon is not available anytime soon, I would like to use another humanist sans (been giving a try to Wenzel's FF Profile and Abbink's FF Kievit, I like them both as a sans for text, but I'm not sure if they can cut it for headlines).   \n   \nTiffany, thank you for your enthusiasm, you obviously love magazines at least as much as I do!   \nYou are absolutely right about narrowing my choice. I'll try to stick to Eplica and Prokyon only, at first (even though I wanted to try Gotham so much, it's so nice!)   \n   \nI think you are right about not mixing a humanist sans with a Grotesk like Knockout, and Kent's thoughts about Prokyon and Gotham possibly clashing almost convinced me about not using them together.   \n   \nOf course, I can't wait to hear also Hrant's opinions, even though I know already he likes Prokyon, from his postings on Typographi.ca.   \n   \nTiffany, could you please elaborate some more about your thoughts on the paper I should use?   \n   \nThis forum is so great. Why did I wait so much for joining?   \nThank you all for now.   \nCiao   \n   \nPaolo\n\n"
    },
    {
      "time": "16 Aug 2002 — 12:36pm",
      "content": "\\> Guys, I love you, you are all great!!   \n\\> This forum is so great. Why did I wait so much for joining?   \n   \nI adore Italians. Welcome Paolo.   \nNow we have our resident [Roberto Benigni](http://web.archive.org/web/20131108084353/http:/us.imdb.com/Title?0118799).   \n   \nStephen\n\n"
    },
    {
      "time": "16 Aug 2002 — 1:08pm",
      "content": "Hrant, just saw your postings, while I was writing mine.   \n   \nI knew you would have liked Prokyon (even though your comment about my \"seemingly overdesigned environment\" hurt a little, but I accept it)!   \n   \nInteresting thought about Eplica: you think it wouldn't carry too much text? I'm not thinking of using it with all those ligatures for the main copy, of course I would stick to f-ligatures only. Still not convinced it may work with Prokyon? I like its roundness, I think it might make a good contrast with Prokyon's starkness.   \n   \nI AM very interested in Whitman. It does look much more spartan than Eplica, but it has grace. Are there already some printed examples or a PDF anywhere, to get a closer look?   \nKent?   \n   \nTankard's Aspect: I am a big fan of Bliss, I think his Enigma works very well in Details Magazine, but I'm not too fond of Aspect. Too fancy. Maybe in other contests, not here. It would be too much, to put it bluntly.   \n   \nAgree on Mrs. Eaves: and I always thought its italic looks too different from the roman.   \n   \nHrant, if we agree on Prokyon, other ideas about a good choice for a serif?   \n   \nAs I said, I will definitely consider Whitman as an alternative to Eplica, but I'm a little worried working with two yet unreleased faces. Although I don't have a strict deadline, I don't want to put things off too much.   \nThank you for your thoughts.   \nCiao   \n   \nPaolo\n\n"
    },
    {
      "time": "16 Aug 2002 — 1:20pm",
      "content": "\\> \"seemingly overdesigned environment\"   \n   \nI didn't mean you - I meant your \"competition\".   \n   \n\\> if we agree on Prokyon, other ideas about a good choice for a serif?   \n   \nAsk Hans Reichel to make one for you! He's the owner of that style.   \n   \nI dunno... what about FF Sheriff? I hate it, but maybe it can work for you. (Being a type aficionado means knowing how to side-step your hatered... :-)   \n   \nWell, give me time, I'll try to think of a good housewife for Prokyon.   \n   \nBTW, I think Profile might work well, but Kievit is most useful for its ultra-generic aspect (I know a very good type designer who was working on a face that would be as generic as possible - when he saw Kievit he stopped: unlike faces with expression, there's room for only one generic!), so I don't think it's good for you.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Aug 2002 — 1:21pm",
      "content": "Hey guys, great news! Just got a very kind (if a little formal) email back from Frank E. Blockland from DTL: Prokyon will be available from their online shop in early September.   \n   \nThank you Steven. I couldn't be more different from Roberto Benigni (great guy, btw), but I am very happy and excited about finding so many other type enthousiasts to talk to.   \n   \nI'm really enjoying talking to you guys, even though posting messages on a forum is a time consuming activity, especially if you do it in a secondary language.   \n   \nNow. A quick dinner and back to work!   \nTalk to you later.   \n   \nPaolo\n\n"
    },
    {
      "time": "16 Aug 2002 — 1:27pm",
      "content": "Oops. Sorry about the misunderstanding, Hrant. As I said, English as a secondary language here, so forgive me for my frequent missteps and bad grammar.   \nHah! A good housewife for Prokyon! I love that.   \nCiao   \n   \nPaolo\n\n"
    },
    {
      "time": "16 Aug 2002 — 2:31pm",
      "content": "Ok, ok. My last posting for this evening. Kept thinking about a \"good serif housewife\" for Prokyon, while eating my pasta.   \nAnd leafing through my tattered copy of Bringhurst's \"Elements\" for the nth time, I just got an idea: DTL Documenta.   \nIt may not be as pretty as Eplica, but it might work well with P.   \nWhat do you guys think? Hrant? I may be on to something...   \nI'll give this a try. But I still like Eplica more.   \n   \nCiao   \n   \nP\n\n"
    },
    {
      "time": "16 Aug 2002 — 2:35pm",
      "content": "I think you found Prokyon's housewife. Documenta   \nis ideal, Paolo. It's got a modernity that fits   \nwith Prokyon but it's not as quirky as Eplica.   \nGo with it.   \n   \nPasta must make good food for thinking about type.\n\n"
    },
    {
      "time": "16 Aug 2002 — 3:19pm",
      "content": "You can afford \\*two\\* DTL fonts?! (I guess the \\*other\\* thing they say about gay men is true... ;-)   \n   \nDocumenta is a solid, functional text face, and the lc \"a\" saves it from being too boring. And I like the flare terminals.   \n   \nIt's always nice to match up fonts from the same foundry, and I think Prokyon/Documenta would work for you, but in this case probably only because Documenta is so \"flat\" (mainstream). At least it's not Myriad! But no, with Documenta you have a housewife that looks good in the kitchen \\*and\\* can occasionally spark interesting conversation at the cocktail party.   \n   \n\\> But I still like Eplica more.   \n   \nWhich is exactly why you can't use it for your text! :-/ There has to be a certain \"coldness\".   \n   \nhhp\n\n"
    },
    {
      "time": "16 Aug 2002 — 5:47pm",
      "content": "_I AM very interested in Whitman. It does look much more spartan than Eplica, but it has grace. Are there already some printed examples or a PDF anywhere, to get a closer look?_    \n   \nPaolo, there are two books being printed with pre-release versions of Whitman, but they aren't published just yet and they're both from small imprints here in the States.   \n   \nI don't have any publicly available PDF specimens yet, but I can put something together for you. One of the TDC specimens I did was in a pseudo-magazine, 3-column format and I could distill that for you. Tell you what, though: I'll do one better. If you want to send me a couple paragraphs of Italian text and maybe a couple specs (pt size/leading, column width), I'll set you up a custom PDF showing.   \n   \nI tend to agree with Tiffany's less-is-more advice and the one drawback about Whitman, I have to admit, is that I don't have any of the bold weights done. And because I have some pressing book-design commissions on my plate, I don't know if I'll be able to get them together before the end of the year. But they're on the boards. (There's some discussion at the foundry about whether to release the fonts as is, without the Bolds, or to wait.) Tiffany, display weights are even further off, unless I can get a specific commission for them.   \n   \nTiffany, Hrant: thanks for your votes of confidence. (Good nose, Hrant.)   \n   \nPaolo: let me know off-list about those samples.   \n   \n-- K.\n\n"
    },
    {
      "time": "16 Aug 2002 — 6:14pm",
      "content": "\\> Good nose, Hrant.   \n   \n:-)   \nNow you just have to wait for their (eventual) 4th Type Specimens Book to see Whitman parade in grand style!   \n   \nhhp\n\n"
    },
    {
      "time": "16 Aug 2002 — 8:37pm",
      "content": "So I took a gander at Flaunt. An interesting cross between eurocool and NY flare. That Bellucci chick, she reminds me of Adjani. So, is she coming to ATypI? Oh, was I supposed to check out the \\*typography\\*?... Well, I did notice the textured cover - that was a nice touch (pun intended), except I think people were wondering why I was trying to peel off that vixen.   \n   \n----   \n   \nBTW, Paolo, the Critique area is a visual place, so as soon as you have something tangible, you'll show us, right? :-)   \n   \nhhp\n\n"
    },
    {
      "time": "17 Aug 2002 — 2:14pm",
      "content": "\\>That Bellucci chick, she reminds me of Adjani. So, is she coming to ATypI?   \n   \nHeh! Hrant, I knew you would have liked it. :-) Even though I think Asia Argento is currently hotter in the States, for that new movie with Vin Diesel just out.   \n   \nBack to the magazine: it's still very early days, Hrant, but I promise I'll put up something for all of you to dissect mercilessly as soon as possible.   \n   \nAt the cost of Being Boring (disgustingly smug Pet Shop Boys reference): really, joining this forum seems to be the smartest idea I had about this project so far.   \nI wasn't expecting such an enthusiastic response and support. You have all been extremely helpful and friendly, and my magazine can only improve because of your suggestions.   \n   \nTo have someone like Kent, who is willing to give me printed samples of his still unreleased new typeface for possibly using it on my project is simply AMAZING (thank you so much, Kent, I will send you my specs and italian copy by email tonight or tomorrow).   \n   \nMost of all, being here talking with all of you is FUN (almost too much, in fact, I have a magazine to do here, even though it's just a dummy issue - back to work, Paolo!)   \n   \nToday I took half a day off. Hot and sunny here in Milan, everybody is away from the city (in Italy nobody works in August, there's a long holiday break; Tibor Kalman was complaining about it, when he was in Rome art-directing Colors Magazine: those lazy Italians...). Only me and the cat left in the city, apparently.   \nBeen doing A LOT of thinking, about this project, my daily job, my future... but I digress.   \n   \nI woke up in a good mood: now that I have Stephen and Hrant's approval, I will try using Prokyon and Documenta for the magazine, with Kent's Whitman as a possible alternative for text.   \nThat's it. Only two faces. (Hey, Bruce Mau did it brilliantly for I.D.; The guys at Wallpaper keep doing it).   \n   \n\\>You can afford \\*two\\* DTL fonts?! (I guess the \\*other\\* thing they say about gay men is true... ;-)   \n   \nWhat the hell is wrong with me? Why did I end up liking two faces from possibly the most expensive foundry in the world?   \nI don't know, for some reason i like the idea of using two Dutch faces (even though that Prokyon guy is actually German, I think). Must be something in the water, in Holland. And besides, nobody uses them here in Italy, I bet.   \n   \nFor Documenta, I'll stick to the minimum of weights and styles necessary for text, for now: Roman, Italic and Small Caps.   \nI have an old issue of Print with it nicely displayed, and been printing the PDF from the DTL website. I like what I see.   \n   \nProkyon... I simply have to have it. The moment I saw that PDF my gut said: that's it, that's the face I want for the magazine. And my gut is usually right, most of the times.   \n   \nBut guts and instinct don't compensate for lack of experience in print, I know.   \n   \nSo I thank you again. Without your help, my choice of typefaces for this project would have been different, and probably questionable.   \nNow I feel safe (well, almost safe, Prokyon is not out yet).   \n   \nEnough! I need to work on being more concise, I know.   \n   \nBe warned: I'll pester you again with some of my silly type questions, and don't groan too loud.   \n;-)   \n   \nCiao a tutti.   \nMille grazie.   \n   \nPaolo\n\n"
    },
    {
      "time": "17 Aug 2002 — 5:50pm",
      "content": "Mmmmmmm... doubts.   \nOkay, I'm still working on the main grid, the colors and I plan to start working on spreads, departments and the inner stuff of the magazine first leaving the cover for last, but I could't resist doodling a bit with a possible masthead.   \n   \nA bit of background around the proposed name for the magazine: Tom. It comes after endless brainstorming sessions with friends (mostly with Antonio, who will be this magazine's Editor, if it will ever see the light of day).   \nIt's short. Friendly. It works in Italian (as short for Tommaso), as a pretty common guy's name. And it works in English too (Hrant, you were talking about Flaunt's Euro-cool factor, I think it's pretty much what we'd like here). Besides, in Italy we already have Max, a men's magazine sort of like GQ. And of course, Tom has many free associations for gays: Tom Cruise (show me a gay man who doesn't fancy this guy, if you can); Tom Ford (Italian men are obsessed with fashion, gay OR straight); and Tom of Finland (the king of tasteful gay erotica; [www.http://archive.salon.com/health/sex/urge/2000/04/08/tom\\_finland/], if you feel inclined).   \n   \nHere's where I need you opinions.   \nPlease note: these are absolutely preliminary sketches, nothing is final here. (Tiffany, if you're reading this, please don't get too distracted by the harshly-lit stock library hunk, this image is just a generic placeholder, a possible background for the masthead).   \n   \nI tried to see if Prokyon could work for the masthead; here are the two heaviest weights that I ASSUME will be the final ones. (Note that I cut and pasted from the Prokyon PDF as bitmaps, so the kerning is obviously wrong.) I don't speak German, but I think they will be Medium and Bold; or maybe Bold and Extra Bold? Wait a minute, maybe there is an intermediate weight between these two! Hard to tell.   \n   \n ![TOMdraft003.jpg](http://web.archive.org/web/20131108084353im_/http:/www.typophile.com/forums/messages/29/2171.jpg)   \n   \n003: I like the chunkyness of this (and I know that italians in general like chunky type). But I think this is possibly too chunky. Besides, if it wasn't for the lovely M, it reminds me too much of the previous masthead for the US Out magazine (before it got redesigned again; I have some old issues, I could post it for reference if you want).   \n   \n ![TOMdraft004.jpg](http://web.archive.org/web/20131108084353im_/http:/www.typophile.com/forums/messages/29/2172.jpg)   \n  \n004: More elegant. But maybe too spindly for a masthead? Again, if it wasn't for the M, isn't it a little too generic-looking? Maybe an intermediate weight about these two would be right.   \n   \n ![TOMdraft005.jpg](http://web.archive.org/web/20131108084353im_/http:/www.typophile.com/forums/messages/29/2173.jpg)   \n   \n005: an alternative to Prokyon for the masthead, with Thirstype's Infinity. I think it works, but I'm afraid it's a little too trendy looking. Gay Italians would probably love it, and grow tired of it after six months.   \nBut somehow, it has a lot of character, maybe more than Prokyon.   \n   \nWhat do you think? Be ruthless, guys. Tell me which one you hate most. Or love. Or both.   \nShould I reconsider and start from scratch? Or try more elaborate type treatments?   \nI don't know about you, but I don't like overdesigned mastheads, in general. I like them to be effective, distinctive but still simple, somehow.   \n   \nIt's late, I'm tired, it's hard to judge. I'm off for tonight.   \nTalk to you tomorrow, I hope.   \nCiao e grazie.   \n   \nPaolo\n\n"
    },
    {
      "time": "18 Aug 2002 — 5:22am",
      "content": "003 for me, because 004 too thin and 005 too much a mix of round and straight. But then I'm no expert. If you do use 003, add a little extra space between the O and the M.   \n   \nmatthew\n\n"
    },
    {
      "time": "18 Aug 2002 — 5:28am",
      "content": "Paolo --   \n   \nI don't care for 005. It's too techno looking to me. I like 003 best, of what you've shown. Heavier is better than lighter. But for just the three letters, it probably wouldn't be too much work to tweak an in-between weight.   \n   \nAs for the overall character, the challenge you face with a name like TOM is that these are three bilaterally symmetrical letters and, of the three, the M is usually the only one with any creative aesthetic possibilities, especially in a general-purpose type design. You might want to consider customizing a little bit for a more unique nameplate.   \n   \nOne quick idea for the Prokyon is to add a little rounding to the right arm of the T to reflect that wonderful M. This adds just a little touch of character to the letter and allows it to snuggle up to the O a little better. I doctored a quick example of what I'm describing:   \n   \n ![TOM 003 tweaked](http://web.archive.org/web/20131108084353im_/http:/www.typophile.com/forums/messages/29/2176.jpg)   \n   \nJust an idea. It has more character, but I don't know if it's the right character.   \n   \n-- K.\n\n"
    },
    {
      "time": "18 Aug 2002 — 5:35am",
      "content": "Another thought: because of the bilateral symmetry, you might be able to get away with stacking TOM vertically in the upper left corner, for a slightly different effect. The downside is that you might lose the full nameplate in the back of a magazine rack. But . . . if your T is distinctive, then it might act as a teaser and get browsers to pick it up to see what the rest says. Or maybe people will just think the name is T, like O or W magazines.\n\n"
    },
    {
      "time": "18 Aug 2002 — 5:58am",
      "content": "I was re-reading a piece by Steven Heller in his column Magazine Watch, in a recent issue of Print, July/August 2001 (his articles are the most consistently interesting read in this mag, with the other column Type in Print, of course).   \nHe's criticizing the recent redesign of Details Magazine. I quote:   \n   \n\"... What's more, the typeface for the masthead - even granted that this is the most difficult of all design decisions - bears no relationship to any other type style in the magazine. Just as one can tell a lot about an artist by the way he draws hands, so does a logo's integration into a publication format say much about the designer.\"...   \n   \nMmmm, interesting thoughts. I tend to agree, especially for new publications. I mean, to build a \"brand\" from scratch, the consistency of the \"logo\" with the rest of the magazine is essential, IMHO.   \n   \nOn the other hand, when you are already an established mark - as is the case with the Rolling Stone's or Esquire's mastheads, for example, well, you can do what you want with the rest.   \nWhat do you guys think about this? I'd be interested in reading your thoughs, maybe in the General Discussion about Magazine Design.   \nCiao   \n   \nPaolo\n\n"
    },
    {
      "time": "18 Aug 2002 — 6:15am",
      "content": "Kent, I think what you're suggesting about a minimum of customisation for a Prokyon masthead is the right direction (I like what you did to the T!). Maybe with an intermediate weight, which I'm sure will be there, judging from the PDF. I just couldn't find anywhere in it a T, O, or M in a medium weight.   \nAnyway, I'll put the masthead design in the backburner for now (but please, keep going with your opinions!), al least until Prokyon will be released.   \nThank you (Kent, let me eat something, then I'll send you the copy and specs for Whitman).   \nGrazie e ciao   \n   \nPaolo\n\n"
    },
    {
      "time": "18 Aug 2002 — 11:36am",
      "content": "\\> Tom   \n   \nIt seems you've chosen the name very intelligently.   \n   \n\\> italians in general like chunky type   \n   \nNow that's very interesting. A backlash against the backlash against blackletter? :-)   \n   \nMasthead: I like the heavy weight, but possibly only in the context of your image - which gives me the idea that maybe the weight (or even the case?!) should vary depending on the image - like if it's a strong, dark image, you might use a lighter weight\\*. This sort of thing is becoming more common, even though there's a risk to building a strong identity.   \n   \n\\* You could even throw in Kent's vertical idea, as needed.   \n   \n\\> if it wasn't for the M, isn't it a little too generic-looking?   \n   \nIn fact, not only that, but there's no harmony between the \"T\" and the \"M\". Lettering (like in a masthead) is very different than a font. Probably not in the context of the actual font, but in this context the \"T\" needs to be modified. Consider rounding off the top corners of the horizontal bar of the \"T\". And/or you could introduce some flaring in the bar.   \n   \nAnother thing:   \nThe \"M\" has some relatively strong trapping (those cuts in its armpits and in the V element). If you like them, great: you should put traps in the \"T\" also; and maybe even the \"O\" (probably at top and bottom)! There's the risk that people will make crazy associations with homosexuality, and it might reflect as amateurism on your part. Personally, I would remove the trapping from the \"M\".   \n   \nBTW, you should tighten the \"TO\" a bit.   \n   \nLastly: I think you should avoid Infinity.   \n   \n\\>\\> \"the typeface for the masthead ... bears no relationship to any other type style in the magazine\"   \n   \nI think this is too purist. To me, the cover has a very distinct function (as compared to the inside, or even the back cover), especially for a money-making operation: it needs to get the person to pick it up, and then open up the magazine. If your insides make the sale, chances are the person will not refuse to buy the next issue based solely on a mismatch between the masthead and the inside type. Meaning: if you use Prokyon for the masthead, you don't \\*have\\* to use it inside. (Except the price of this particular font would make such a decision somewhat wasteful.)   \n   \nUnless the magazine is for gay Italian \\*typographers\\*...   \n   \nhhp\n\n"
    },
    {
      "time": "18 Aug 2002 — 2:23pm",
      "content": " **First** Before you set aside the design of the flag (or masthead) you should consider the fact that the cover sets the stage for the rest of the piece. Type, paper, grid, colors... all important things. But, the flag should come next. I'm not sure what Mr. Heller's is getting at, I can only guess that I would agree with him based on past writings. I need a little more context. But if what he is saying is that cover is separate from the interior of the magazine then he is entirely wrong. I believe that the cover should reflect the interiors.   \n   \nHere's a silly analogy. As you walk toward the kitchen, you smell garlic and reggiano. What foods do you envision? I'm thinking pasta, capellini perhaps. Then you step through the kitchen doors and you are treated with microwave chinese. Your stomach will lurch and then you will be sad because your taste buds had worked themselves into a frenzy for something else.   \n   \nThis has happened in other magazines. The cover is all tease and promise and the interiors fall short of that promise. Or viceversa.   \n   \nShould not the cover, as Hrant mentioned, be the reason to pick it up? Yes. Should not also the cover hint and what is inside? Yes. Obviously, certain things, rules, can be broken. Such as the grid. But then you've already set that up and for the features your grid is this and for your departments the grid is that. I think you get the idea.   \n   \nI really think you should not save the cover until last. You could miss out on opportunties and discoveries.   \n   \nIn my experience as a teacher, (perhaps to some of you this doesn't count), the students that solved the grid, flag, general style (photography & illustration) type choices, and themes (color) first, they were the ones that were more successful in seeing this throughout the magazine. The cover should not be the afterthought. Not, Paolo, that this is what you are doing. I'm only trying to make a point.   \n   \nSo I guess I disagree with Hrant. Not that every face used within has to be used without (on the cover). Or vice versa. As long as the face used is not so completely different or against what the rest of the magazine does. ???   \n   \nYou are right _Rolling Stone_ does get to break a lot of the rules. But, if you notice (and I wish I had an issue here to make sure this is still the case) does not the flag/masthead still resemble the contents page faces, the departments? The features are a little different in that they, _Rolling Stone_, also try to conceptually open each feature. Or at least they used to. So I could be entirely wrong.   \n   \nWhat about using Whitman (an early display version Kent?) as the flag? Isn't everyone trying to use Sans now? I also like Kent's idea of altering Prokyon. This is, after all, _the_ place at which people should be able to begin to make assumptions about the magazine?   \n   \nOne more boring, and perhaps redundant point. Really explore the placement of your flag. How you treat this could also set the stage for other things like placement of other big type in your department, for instance.\n\n"
    },
    {
      "time": "7 Dec 2002 — 4:33am",
      "content": "I really like the subtly of the first one. I think the type needs to have tighter kerning (letters closer together)\n\n"
    },
    {
      "time": "12 Jan 2005 — 10:33pm",
      "content": "White space is so 1980s. It should be abolished. How about Optima and Life for fonts? And why be just about lifestyle? What could be more shallow and boring. There is a pretty good new magazine out of Wilmington, Delaware/Philadelphia called Visions Today. It has at least some substance. Have you begun publication yet? How about an English language edition so we can read about our favorite men, the Italians?\n\n"
    },
    {
      "time": "12 Jan 2005 — 10:34pm",
      "content": "White space is so 1980s. It should be abolished. How about Optima and Life for fonts? And why be just about lifestyle? What could be more shallow and boring. There is a pretty good new magazine out of Wilmington, Delaware/Philadelphia called Visions Today. It has at least some substance. Have you begun publication yet? How about an English language edition so we can read about our favorite men, the Italians?\n\n"
    },
    {
      "time": "12 Jan 2005 — 10:35pm",
      "content": "White space is so 1980s. It should be abolished. How about Optima and Life for fonts? And why be just about lifestyle? What could be more shallow and boring. There is a pretty good new magazine out of Wilmington, Delaware/Philadelphia called Visions Today. It has at least some substance. Have you begun publication yet? How about an English language edition so we can read about our favorite men, the Italians?\n\n"
    }
  ]
}
