{
  "id": "2293",
  "title": "Arrival \\_ a new sans for signs",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi! I've just finished my typeface Arrival, designed for signs. It has three variants: Normal, Normal Italic and Extrabold. It was the practical project for my MA Typeface Design course at Reading. Main features of this typeface:   \n   \n\\_ Large x-height   \n\\_ Calligraphic flow   \n\\_ Subtle stroke modulation   \n\\_ Flaring on stems for clarity of reading from a distance   \n\\_ Flowing, legible hybrid italic   \n   \nDownload the pdf of my specimen booklet if you want to know more about it:   \n   \nhttp://home.lynx.net/chtam/arrival\\_spec\\_web.pdf.sit   \n   \nHere are the images:\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150414103210im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">Arrival Normal<br><a href=\"http://web.archive.org/web/20150414103210/http:/www.typophile.com/forums/messages/29/arr_norm.swf\"><b>arr_norm.swf</b></a> (27 k)</td></tr></table></center>   \n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150414103210im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">Arrival Normal Italic<br><a href=\"http://web.archive.org/web/20150414103210/http:/www.typophile.com/forums/messages/29/arr_ita.swf\"><b>arr_ita.swf</b></a> (28 k)</td></tr></table></center>   \n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150414103210im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">Arrival Extrabold<br><a href=\"http://web.archive.org/web/20150414103210/http:/www.typophile.com/forums/messages/29/arr_xbold.swf\"><b>arr_xbold.swf</b></a> (27 k)</td></tr></table></center>   \n   \nMy web site's here: www.keithtam.com   \n   \nLooking forward to your comments. I'm just trying to test the waters on this board... Be honest with your comments, O.K.?   \n   \nCheers!   \nKeith.   \nVancouver BC, Canada!-/attachment-!\\>!-attachment:\\>!-/attachment-!\\>!-attachment:\\>!-/attachment-!\\>!-attachment:\\> \n",
  "author": "keith_tam",
  "time": "17 Aug 2002 — 1:33am",
  "uid": "1202",
  "comments": [
    {
      "time": "17 Aug 2002 — 6:27am",
      "content": "The italic version reminds of Lucida...   \n   \n   \n:::shudder:::\n\n"
    },
    {
      "time": "17 Aug 2002 — 7:26am",
      "content": "Keith,   \n   \nHey there I've not seen your posts before. Welcome from a fellow Reading Grad! Did you just finish then? Are you going to ATypI?   \n   \nI disagree with Milan. I see more of a meta-esqueness in it. I also think the eversoslight stroke modulation is very nice. Will you make more weights? It made me smile to see an extrabold. Seems like most people put this off until they've finished all the other weights. I'm downloading the PDF so I'll have to read this before I can make more comments.   \n   \n   \nTiffany\n\n"
    },
    {
      "time": "17 Aug 2002 — 9:31am",
      "content": "Don't get me wrong - I love it! The ampersand is exquisite.\n\n"
    },
    {
      "time": "17 Aug 2002 — 11:24am",
      "content": "Hi there Tiffany, it's nice to see someone from Reading too! No, I haven't finished yet. I'm in the process of writing my 10,000-word dissertation! You might be interested to know, it's on the influce of calligraphic writing on the development of sanserif type. Well, only 7,000 more words to go now! Hey, thanks for your comments! Waiting to hear more from you!   \n   \nKeith\n\n"
    },
    {
      "time": "27 Jan 2003 — 9:51am",
      "content": "I haven't looked at the PDF yet, but from the Flash views I'd say it's a nice, solid humanist sans. The problem is we have so many of those now, it's hard to appreciate! :-/ The good news is that your flares (although I don't see how they might promote \"clarity of reading from a distance\") do give the design some subtle originality. And the Heavy has a nice presence.   \n   \nFor signage I presume this needs to be conservative, but for the retail market you might consider putting some funkiness in it, somehow. A good example of what I'm talking about is FF Profile.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2003 — 10:06am",
      "content": "My web site is now here: [www.keithtam.net](http://web.archive.org/web/20150414103210/http:/www.keithtam.net/)   \nThe PDF for Arrival is under \"types\". Download it directly [http://www.keithtam.net/documents/arrival\\_spec.pdf](http://web.archive.org/web/20150414103210/http:/www.keithtam.net/documents/arrival_spec.pdf) (875k).   \n   \nK.\n\n"
    },
    {
      "time": "27 Jan 2003 — 10:35am",
      "content": "Nice clean site.   \n   \nI'll have to check out the PDF later: I think your server crashed from all the simultaneous downloads! :-/   \n   \nBTW, the loose spacing seems to be right on (for highway signage), partly from what I've gathered from James Montalbano. BTW, he'll be giving a talk about the topic at TC2003: you should go and ask him some heavy technical stuff during the Q&A!   \n   \n--   \n   \nHey, you work with Michail Semoglou?! Wow, cool. He showed me his most recent work in Rome - very nice. It's a very original (and apparently culturally authentic) Greek, and has a subordinate \"Hellenized\" Latin component - something that hasn't been done since Carter's Cadmus in the 70s. Wonderful.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2003 — 10:56am",
      "content": "Thanks, Hrant. Yes, Michail is a good friend of mine. We studied together at Reading. He's an excellent calligrapher, and his type really shows.   \n   \nI'm afraid the text version of Arrival still won't be very funky. It will be a good serviceable humanist sans (yet another, I know.). Quirkiness will come later with my DG Sans... even more calligraphic (a sans version of Albertus?).   \n   \nI'll definitely try to go to TypeCon this year...   \n   \nK.\n\n"
    },
    {
      "time": "27 Jan 2003 — 3:28pm",
      "content": "Some quick observations from the PDF:   \n1. The italic angle seems jittery.   \n2. I'm liking the Black more and more, especially in all-caps.   \n3. The spacing seems uneven in places.   \n4. The roman lc \"s\" seems malformed to me.   \n5. Love the [primary] italic lc \"a\"!   \n6. Love the Euro.   \n7. UC accents too high.   \n8. Cedilla too cramped/dark.   \n   \nThe \"process\" part looks very interesting - I'll be perusing that soon!   \n   \nKeep this up, eh? :-)   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2003 — 11:39pm",
      "content": "Sorry to intrude...   \n   \n\\>Hey, you work with Michail Semoglou?! Wow, cool. He showed me his most recent work in Rome - very nice. It's a very original (and apparently culturally authentic) Greek, and has a subordinate \"Hellenized\" Latin component - something that hasn't been done since Carter's Cadmus in the 70s. Wonderful.   \n   \nHrant, can you tell me all you know about Cadmus? And on Semoglou, also. I'm really missing a contact in Greece!\n\n"
    },
    {
      "time": "27 Jan 2003 — 11:42pm",
      "content": "Keith, I beg your help, also. May I be introduced to Michail?   \nThx!\n\n"
    },
    {
      "time": "27 Jan 2003 — 11:52pm",
      "content": "M Carter made a slew of Latinized Greeks in the 70s via Linotype, at the sorry-arse request for such culturally degenerative designs by certain Greek news designers. He rightfully had an allergic reaction to this process, and made Cadmus, and unconventional but in a way culturally authentic (at least \"lapidarily\") design. About 20 years later he made Skia, which is in effect a Hellenized Latin font:   \n [http://www.themicrofoundry.com/other/cadmuskia.gif](http://web.archive.org/web/20150414103210/http:/www.themicrofoundry.com/other/cadmuskia.gif)   \n   \nMichail's email: [msemoglou@operamail.com](mailto:msemoglou@operamail.com)   \nBTW, a few months ago this place was full   \nof Greeks - maybe they're still lurking?   \n   \nhhp\n\n"
    },
    {
      "time": "28 Jan 2003 — 4:54am",
      "content": "Thank you so much, Hrant!   \nI loved Skia since my old Mac and its System 7.5 and I'm sorry its advanced features are built in just as a Quickdraw GX face. Do you know if someone translated in in Type1, OpenType or something?   \nCadmus is too wide. A bit narrower and it could be the perfect greek counterpart to the recent Skia. Do you know if Cadmus has a digital version or if Carter is intentioned to work again on Skia. Is Skia still a property of Apple?   \n   \nWhat do you mean by \"culturally degenerative designs\"? Something like bastard and dull roman fonts designed on the wave of advertising urge from the 1960s onwards we have for latin?\n\n"
    },
    {
      "time": "28 Jan 2003 — 8:10am",
      "content": "Hi to everyone!   \nKeith + Hrant, you should know that your praise is a great encouragement to me.   \nThank you.   \n   \nBest wishes to everyone,   \nMS/\n\n"
    },
    {
      "time": "28 Jan 2003 — 8:38am",
      "content": "\\> Do you know if Cadmus has a digital version   \n   \nI would be utterly shocked if there's a digital version, since I think it sold like one copy (to Cyprus, where that sample is from) when it was originally released... In the book \"Greek Letters\", Carter says he's only seen it used that one time.   \n   \n\\> \"culturally degenerative designs\"?   \n   \nI guess I mean something that dilutes native culture for no (or not nearly enough) good reason.   \nBTW, I'd say Latin is too way strong (currently) to worry about that... although some people have accused my Alphabet Reform work of violating Latinate culture... as if I needed more motivation. ;-\\>   \n   \n--   \n   \nHey, Michail! Nice to ASCII you again.   \n   \nhhp\n\n"
    },
    {
      "time": "28 Jan 2003 — 10:29am",
      "content": "Hello Keith, et al.   \n   \nYour site is so clean. One of these days (as she keeps saying) I'll show you mine.   \n   \nReviewd _Arrival_ again. I think overall the dots are a little big. Especially over the i & j -- I'll download the .pdf to see what other offerings are hidden. Just in case there is a paragraph setting in there.   \n   \n ![:-)](http://web.archive.org/web/20150414103210im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "28 Jan 2003 — 1:38pm",
      "content": "The PDF is actually a very nice presentation - highly recommended.   \n   \nhhp\n\n"
    },
    {
      "time": "28 Jan 2003 — 6:45pm",
      "content": "Hi Keith!   \n   \nIt\n\n"
    },
    {
      "time": "28 Jan 2003 — 9:10pm",
      "content": "After looking through your PDF and printing it to my _completely_ undeserving and lowly hp posing as an inkjet. Being extra sensitive to the letter w, I love the fact that yours works. I think this is one character that usually looks frumpy and out of place in other sans types that are trying to maintain constraint. The dot over the i and j, only looked big on my monitor and the remark was supposed to be tongue in cheek, but instead it came across more foot in mouth. Very _very_ nice work. Will there be a condensed version?\n\n"
    },
    {
      "time": "29 Jan 2003 — 12:06am",
      "content": "Re. Cadmus: I agree that it is generally better than the heavily Latinised old Helvetica Greek, Baskerville, etc., but I still wouldn't describe it as authentically Greek. It is really a kind of 'what if?' historical fantasy, in which Matthew applies the fairly rigid geometry of early Attic inscriptions to a lowercase alphabet that did not exist at the time. It's interesting and in some respects successful (it doesn't suffer from the deadness and lack of rhythm of the Helvetica), but it is no more authentically Greek than the other types of this period. The straight _lambda,_ the symetrical _chi_ and _gamma_; the lack of descenders on _beta_, _zeta_ and _ksi_; the monodirectional ascender on the _delta_: none of these are any more authentic to Greek than the serifs on the Baskerville. Perhaps Cadmus just seems more Greek because it is less obviously Latin?   \n   \nAnyway, sorry for the digression. Back to Arrival...\n\n"
    },
    {
      "time": "29 Jan 2003 — 8:37am",
      "content": "\\> I still wouldn't describe it as authentically Greek   \n   \nRight, I can understand that. I'm just attracted to the _intention_ more than anything else.   \n   \nBTW, that sample uses some strange alternates that don't seem to have been intended (as primaries) by Carter. Some of your specific complaints might be covered by that, but I'd have to check.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Feb 2003 — 2:15pm",
      "content": "Is it possible to buy Arrival at the moment.   \n   \nRapha\n\n"
    },
    {
      "time": "12 Feb 2003 — 2:30pm",
      "content": "Yes, it is possible... The University of Reading has just agreed to buy Arrival for its signage, in fact. If you're interested, email me, and we'll talk... [keith@typography.net](mailto:keith@typography.net)\n\n"
    },
    {
      "time": "12 Feb 2003 — 2:35pm",
      "content": "Congrats!   \n   \nWait a second: don't they already \"own\" it? You made it while you were there, right? Since a nasty legal precedent a few years ago at Stanford, colleges have been very dog-eat-dog about this type of thing...   \n   \nhhp\n\n"
    },
    {
      "time": "12 Feb 2003 — 2:47pm",
      "content": "Yes...the PDF is a beautiful presentation.   \n   \nI did notice that you have left and right facing directional arrows. May I suggest you add up and down, and, possibly, the 45 degree angles? I would those quite useful when creating signage. (but maybe that's best left for an Arrival Dingbats face...)\n\n"
    },
    {
      "time": "12 Feb 2003 — 6:14pm",
      "content": "Yes, I did design it when I was there, but it's Reading... How can you teach type design without respecting a student's intellectual property?\n\n"
    },
    {
      "time": "12 Feb 2003 — 6:15pm",
      "content": "You're right... I think I'll add the up down and diagonal arrows...\n\n"
    }
  ]
}
