{
  "id": "2294",
  "title": "VH1",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Not that their old logo (left) was so great, but does anybody get what they were going for with this redesign? A crate with a leaf sticking out?   \n  ![VH1 old and new](http://web.archive.org/web/20131019162555im_/http:/www.typophile.com/forums/messages/4100/21705.jpg)\n\n",
  "author": "rotodesign",
  "time": "3 Dec 2003 — 10:06am",
  "uid": "2731",
  "comments": [
    {
      "time": "3 Dec 2003 — 10:14am",
      "content": "You can't be serious.   \n   \nhhp\n\n"
    },
    {
      "time": "3 Dec 2003 — 10:33am",
      "content": "Okay, let me phrase it differently, and with a lot more words. \"VH1\" originally stood for \"Video Hits 1,\" but nobody remembers that. The old logo emphasized the \"1,\" which ties into the slogan \"Music First\" -- probably an attempt to differentiate VH1 from sister station MTV, who were showing fewer videos and more non-music programming. The new logo emphasizes the Vh, with the backwards 1 disappearing into the h. Maybe there's something obvious I'm missing (wouldn't be the first time), but what does this new logo represent?\n\n"
    },
    {
      "time": "3 Dec 2003 — 1:36pm",
      "content": "I didn't see it as a leaf, I saw it as a piece of the V folding over on its self. I'm sorry but it looks just plain bad. Hard to read and why a box. Was that for thinking inside the box?\n\n"
    },
    {
      "time": "4 Dec 2003 — 9:07am",
      "content": "Considering that the only reason to watch VH1 is for the rare source of '80s nostalgia, Mike's original design is exactly what they need now.   \n   \nAs for the new logo, count me among the dumbfounded. What the hell is it? Why is the one backwards? Did they actually _pay_ for that train wreck?\n\n"
    },
    {
      "time": "4 Dec 2003 — 9:39am",
      "content": "Okay, waaait a minute... I think I see...   \n ![vtM, Vh1](http://web.archive.org/web/20131019162555im_/http:/www.typophile.com/forums/messages/4100/21750.gif)   \nTenuous, but better than no explanation at all.\n\n"
    },
    {
      "time": "4 Dec 2003 — 10:28am",
      "content": "More discussion on the VH1 logo took place over at Speak Up back in September.   \n   \n [http://www.underconsideration.com/speakup\\_v2/archives/001579.html](http://web.archive.org/web/20131019162555/http:/www.underconsideration.com/speakup_v2/archives/001579.html)\n\n"
    },
    {
      "time": "4 Dec 2003 — 12:14pm",
      "content": "But small doses help build up your immune system. :-)   \n   \nhhp\n\n"
    },
    {
      "time": "4 Dec 2003 — 1:29pm",
      "content": "Oh toughen up Pemberton : P\n\n"
    },
    {
      "time": "4 Dec 2003 — 8:52pm",
      "content": "Well, now I've read the designer's explanation, such as it is, in the Speak Up thread. So, it's just... deliberately nonsensical, meant to look \"unfinished\" by doing a number of meaningless and unattractive things.   \n   \n**I** wanted to give them more credit than **that.** I saw how the shapes in \"h1\" were smooshed together to make a sort of T, and how the V extended off the side of the block, and said to myself, \"At least someone was trying to do something even if they may have failed. I can respect that.\"   \n   \nInstead it's the free verse philosophy. \"There's no right or wrong way to do anything, so if I create something at random and you think it's ugly, that's a fault in you, not it.\" Bleah.\n\n"
    },
    {
      "time": "5 Dec 2003 — 4:55am",
      "content": "Kevin they say if you put a bunch of monkeys in a room with typewriters eventually you will get a novel. I think VH1 should have tried that approach (give the monkeys crayons and paper) to designing their logo, I bet it would have been better.\n\n"
    },
    {
      "time": "5 Dec 2003 — 7:27am",
      "content": "I have no problem with non-representational logos, and perhaps if the VH1 logo were just the type treatment I wou'dve bought that argument. My issue is it looks like it's trying to symbolize something, but is really meaningless. Why a box? Why a leaf? Why is the type crammed onto one side with a big empty panel to the right? The designer's explanation can be summed up as \"why not?\"   \n   \nSure, music and pop-culture industry logotypes have to change with the times, but to build something clunky and not worry about it because it's just going to get changed again anyway seems pretty lazy to me, and would tend to reinforce the notion that VH1 stands for nothing and will more than likely change directions when the next trend rolls along. Maybe that's the truth, but it's hardly the thing you want to emphasize in your corporate identity.\n\n"
    },
    {
      "time": "8 Dec 2003 — 1:57pm",
      "content": "Joe,   \nFirst, thanks for the invite. I understand everyone is referring to the\n\n"
    },
    {
      "time": "8 Dec 2003 — 2:06pm",
      "content": "\\> it\n\n"
    },
    {
      "time": "8 Dec 2003 — 2:35pm",
      "content": "To me spineful is when your looking the person in the eye. And I think being sincere is also about making \"contact.\" Again, just my 2cents No need to change the icon...\n\n"
    },
    {
      "time": "8 Dec 2003 — 3:04pm",
      "content": "great job, Nancy.\n\n"
    },
    {
      "time": "9 Dec 2003 — 11:30am",
      "content": "1) Here is a color version uploaded to one of the   \nRussia-based logo sites.   \nI don't know if these are the colors actually being used.   \n   \n2) How it looks (roughly)   \nwithout the box and without the obliquing.   \n   \n   \n ![](http://web.archive.org/web/20131019162555im_/http:/www.typophile.com/forums/messages/4100/22029.jpg)\n\n"
    },
    {
      "time": "9 Dec 2003 — 11:50am",
      "content": "Just want to say, I'm am FOR\n\n"
    },
    {
      "time": "9 Dec 2003 — 2:29pm",
      "content": "Glad to hear it, as I was getting the impression someone expected me to be ashamed of myself. It is in fact possible to give something careful consideration and still come to a negative conclusion. I examined it, looked for possible motives for the choices made, and read the justifications expounding that the design is existentially appropriate to something or other, but what I see is still the picture I would put next to \"arbitrary\" in a dictionary. Some seem to be arguing that that **is** the message VH1 should want associated with itself (most notably the assertion that begging to be replaced with another design as soon as possible is one of its inherent strengths), in which case, great job. But I am skeptical.\n\n"
    },
    {
      "time": "9 Dec 2003 — 6:18pm",
      "content": "\\> why not \"own\" a different attribute like playfulness   \n   \nBecause that stuff isn't \"memorable\", like a good logo should be?   \nThe brown of UPS for example is memorable, because it's a tangible thing - heck, it's a physical wavelength! But I don't see any \"atmosphere\" successfully being associated with a company.   \n   \nIs this a form of rebellion, perhaps? I could believe that there's a malaise with the formulaic way of making things so typical of the West, but I'm not sure that such \"design exploration\" can serve as more than a temporary venting mechanism. It seems parallel to the grunge font hooliganism of the 90s.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Dec 2003 — 8:25pm",
      "content": "I may be wrong, but I \\*think\\* that some third-party hooligan   \ndesigner digitized a crude copy and posted it at logo.nino.ru.   \n   \nThe gray version at the top doesn't appear to have the weird leaf join.   \n   \n   \nNancy could probably tell us how the uploaded version   \ncompares to her version. And maybe it would be a good   \nidea for VH1 to upload the correct version ... maybe?\n\n"
    },
    {
      "time": "10 Dec 2003 — 3:44pm",
      "content": "The version at the top is a screen grab from the VH1 web site. I cropped out the background, but it's otherwise unaltered.\n\n"
    },
    {
      "time": "10 Dec 2003 — 3:48pm",
      "content": "just for the record, wasn't referring to you Patrick   \nas the third-party hooligan. ![:-)](http://web.archive.org/web/20131019162555im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nWhen I referred to the 'uploaded' version, I meant the vector .eps   \nuploaded to logos.nino.ru or whatever it is.\n\n"
    },
    {
      "time": "10 Dec 2003 — 3:55pm",
      "content": "Gotcha, just trying to stay out of trouble.\n\n"
    },
    {
      "time": "23 Jan 2004 — 12:36am",
      "content": "There is alot of graphic design being done now that isn't interested in craft - just effect.   \n   \nThe thing is I don't think it is wrong per se. If it works it works. I don't 'like' the vh1 logo but it is interesting & flexible & a bit irritating which makes me look at it- perfect for them.   \n   \nAnother thing is that creating a classic logo that will stand the test of time may not be needed by every client or suit their purposes in fact. VH1 could be gone in 2 years - probably not - but you never know. So why make something classic & sturdy when a something flimsy & fun will do?\n\n"
    },
    {
      "time": "29 Jan 2004 — 2:16pm",
      "content": "Wow, this is why I like Typophile. Feedback like Nancy's. Very cool.   \n   \nI'm not a fan of the logo, but with context (colors, the use of the cube, etc.) and explanation (Nancy's), it makes more sense to me.   \n   \nI won't get into my opinions, as this thread's a bit stale now, but I did want to give some props to the Typophile boards. Rock on.\n\n"
    },
    {
      "time": "3 Feb 2004 — 11:59am",
      "content": "Some times I wonder! Is it really possible to say if a logo is good or bad - just by looking at it? Of cause everybody can, on a individual aestetic level, say if it nicely done, if the colours fit the goal etc. BUT if the logo is good or bad? Mayby in a year og two you can start \"messure\" the effect of the new logo and then mayby you can start tarking about good or bad.   \n   \nI know this is kind of of topic, but all the different opinions and the lack of my own made me wonder.   \n   \nAm I wrong?   \n   \nNicolaj\n\n"
    },
    {
      "time": "3 Feb 2004 — 1:36pm",
      "content": "hm?   \n   \nNicolaj\n\n"
    },
    {
      "time": "3 Feb 2004 — 2:56pm",
      "content": "Well said 'interested observer'   \n   \nI my humble opinion, the logo is poorly resolved. The perspective is incorrect, the mix of the 2D box, overlapping letters/number and flat leaf! is visually over complex and too small within the overall logo. (Look at the logo really small and you will see what I mean)   \n   \nColours are nice though.\n\n"
    },
    {
      "time": "20 Feb 2005 — 1:22am",
      "content": "Sorry, but I still don't like it. While the old one had a boldness, claiming to be the No. 1 music channel even though it was perceived as MTV's li'l sister, this new logo just isn't memorable, isn't modern, isn't unique and, worse, doesn't tell me anything at all about the channel. The same holds true for the original MTV-logo, sure, but that at least has the power of nostalgia and a certain (s)punky flair that I dig. The redesign for VH1 cold just as well be for some health-care organisation or some wellness product. Frankly, I'd rather have seen VH-1 all done in Helvetica and be done with it :-D.   \nNancy, great to see you defend your work and if it really was picked from 25 designs, all the more power to you and your work. But, alas... a pitch with TWENTYFIVE new logos, in my opinion, is a grave mistake in itself. I'm completely against pitches these days, and maybe that is the problem with the logo.\n\n"
    },
    {
      "time": "27 Jul 2005 — 5:49pm",
      "content": "Does anybody which comapany created the new logo?\n\n"
    },
    {
      "time": "27 Jul 2005 — 6:27pm",
      "content": "in house design\n\n"
    },
    {
      "time": "5 Aug 2005 — 12:24pm",
      "content": "This got me wondering how most other well known logos have been chosen. How do they get the nod of approval from the typical target audience of design unsavy higher-ups (usually CEOs, partners and probably their family members)? How did logos like Lucent, NASA (worm), bp, etc. make the committee say \"aha!\"?\n\nI think was just circumstance that Nancy was employed at the time that VH1 was taking submissions for a new logo, the same time other firms were submitting. And the comets aligned and that select group of decision makers selected Nancy's because it hit a vein with most of them; not necessarily everyone in the world, but the only decisions that mattered were that of the committees. Which is also the reason why we have logo's like Verizon, UPS, Gateway... no one knows the reasons except for the people that decided.\n\nPersonally I like the logo for reasons only my gut knows. I like it for the abstract symbol that it is, I like the vibrant colors, I like that it doesn't scream out \"We're a music channel!\" Overall, I like the new brand of VH1 in general. If I were on that committee, I can imagine the amount generic, corporate, overly-thought out, expertly crafted, letterspaced submissions and seeing Nancy's and feel a bit of freshness because of it's purely \"I put these elements together because it instinctively felt right\".\n\n"
    },
    {
      "time": "5 Aug 2005 — 12:44pm",
      "content": "Killer, a saying my mother use to say to me: (as a joke) (I think she got it from The New Yorker (a cartoon)). \"Its all a matter of taste and your taste stinks.\" Remember, it was a committee that designed a horse and created the camel.\n\n"
    },
    {
      "time": "9 Aug 2005 — 11:05am",
      "content": "My mom also had a saying she used to say to me:(being serious)(I think it's from confucius(a wise man)\"To practice five things under all circumstances constitutes perfect virtue; these five are gravity, generosity of soul, sincerity, earnestness, and kindness.\" Thanks for taking the time to point out that I have no taste.\n\n"
    },
    {
      "time": "9 Aug 2005 — 11:46am",
      "content": "There is also the very true cliche that 'there is no accounting for taste'. Also 'One man's food is another man's poison' & so on.\n\nIf Dan or Micheal have taste or not is hardly important in some ways.\n\nThe more pressing question for me is - is the VH1 logo 'working' with it's target demographic. Is suspect it is.\n\n"
    },
    {
      "time": "9 Aug 2005 — 11:50am",
      "content": "The lucent logo worked well when it was introduced too. LOTS of people bought the stock.\n\n"
    },
    {
      "time": "9 Aug 2005 — 2:29pm",
      "content": "Eben, the logevity of the new mark proves all us nay sayers were wrong. It works for VH1, so hurray for the mark. I'm not a VH1 viewer and my taste probably reflects that.\n\n"
    },
    {
      "time": "9 Aug 2005 — 2:48pm",
      "content": "Remember: it's been empirically proven that the memorability of a piece of music is directly proportional to how annoying people find it. Ergo: graphic designers need to design less for each other. That said, I think the VH1 logo is horridly ugly. If I were a viewer, it would cause me to view less of it. But I know I'm not normal.\n\nhhp\n\n"
    },
    {
      "time": "9 Aug 2005 — 3:33pm",
      "content": "\\> the logevity of the new mark proves all us nay sayers were wrong\n\nI wouldn't go that far, but I think that might be one measure to consider using if you are evealuating the 'success' mark. Being outside a given logo's demographic or target group is a hazard/benefit we all share in. ;-)\n\n\\> I know I’m not normal.\n\nNot average - certainly.\n\nI agree that good graphic design often challenges the user/viewer a little, and if it is accepted it is stronger for the encounter and displaces previously accepted culture.\n\nAlso - people like a little pain. Coke & Fizzy water hurts the tougue & mouth a little. Hot foods do too. But we like the stimulation. Design need be no different as far as I can see. It's a matter of proportion.\n\n"
    },
    {
      "time": "9 Aug 2005 — 4:06pm",
      "content": "\\> people like a little pain.\n\nIndeed. I wish the West wasn't so afraid of facing up to this.\n\nhhp\n\n"
    },
    {
      "time": "9 Aug 2005 — 4:44pm",
      "content": "I like it a lot, especially the typography, the way the leaf and the flipped 1 are melded into the V and h, and all stuck together with kind of keyline mortar (like the Avant Garde logo). It's clever the way it pokes fun at all those logos that are just some type in a square (oops sorry BJ). Yes, it's very clever, very fun.\n\n"
    },
    {
      "time": "9 Aug 2005 — 9:43pm",
      "content": "\\> It’s clever the way it pokes fun at all those logos that are just some type in a square\n\nIt is clever. & it does suggest fun.\n\nWhat I like about it is the fact that it's design seems to have incorporate almost to know that it is just one in a succession of logos and unlike the others it is okay with it's temporary status. That comfort with transience seems cool. It's one of the things in aughtie (2000+) design which I found distintctive. VH1 isn't my favorite example but is is probably the most ubiquitous example.\n\n"
    },
    {
      "time": "10 Aug 2005 — 3:07pm",
      "content": "Indeed. I wish the West wasn’t so afraid of facing up to this.\n\nWell, Bush is making us face up to pain. I feel for the casualities reported every day from Iraq.\n\n"
    },
    {
      "time": "3 Dec 2003 — 10:38am",
      "content": "This topic has come up on other boards. Forgive me if I repeat what I've said elsewhere.)   \n   \nWhy hang on to the old logo? Sure, nothing was wrong with it, but nothing was great about it either. It was stagnant, symmetrical and vanilla. That's why I appreciate their need to move on.   \n   \nI'm not sure what to think of the new logo. The leaf, the hacked h and flipped 1 feel fresh. But overall it seems kind of slapped together. The stroke weights of the V h and 1 don't fit and Helvetica just seems tired here...   \n   \nBut the net takeaway is a needed change in that it lets the VH1 mark grow up.   \n   \nThe broadcast work is rock solid. The whole play on pop culture is fun and the original scoring is great. Finally, to beat the MTV comparison to death -- you can tell they're not deifying the logo like MTV did. See the VH1 reel at [WeWorkForThem](http://web.archive.org/web/20131019162555/http:/www.weworkforthem.com/).   \n   \n(WWFT did not design the logo. It was done in-house at VH1 by Nancy Mazzei.)\n\n"
    },
    {
      "time": "4 Dec 2003 — 12:42am",
      "content": "I was also sorry to see this new logo, however I was sorry to see the old logo which was the second logo. I may be biased as I was the letterer for the ORIGINAL logo which I think is still the best of the three. ![](http://web.archive.org/web/20131019162555im_/http:/www.typophile.com/forums/messages/4100/21729.gif)   \nI don't mind my work being replaced. i have enough logos on the market that one or two are inconsequential but it would be nice if I could say \"Gee, that's nice!\"   \nIf this is a V peeling the rendering is off, and if it's a leaf hten it needs to be clearer. But we shouldn't have to guess. And I wont even discuss the relative weights of the 1 and the \"h\".\n\n"
    },
    {
      "time": "4 Dec 2003 — 11:28am",
      "content": "What difference does it make if it's a V folding on itself or a leaf or just an abstract organic shape? Should a logo always be a literal representation? I don't think so. I'm not necessarily going to defend this logo to the death, but I don't think it should be dismissed because we don't immediately get it.   \n   \nAnd Kevin, you don't really think they have MTV envy do you? I can't imagine them sitting in a conference room saying, \"what can we do to evoke the MTV logo?\" At least I want to give them more credit than that.   \n   \nThat said, I think the execution is lacking. (As I've said before in this thread.)   \n   \nMike, your original logo may have worked well at the time, just like the second logo worked for them through the last decade. I see this third logo as simply more of the same. Not stylistically the same but it's an adequate logo that will serve them well for a time but need to be replaced or evolved sooner than later.   \n   \nCouldn't we argue that identities for these kind of ephemeral brands (fashion, music, extreme sports, etc.) need to change more often to stay relevant or interesting? (Food thought, not necessarily words to design by.)   \n   \nI think this is why this particular logo redesign is interesting. Because it's not for an airline or a telecom or something that needs to convey stability, longevity, timelessness, etc. It almost demands to be redone regularly.   \n   \nRe: Speak Up   \nTrue, Grant. That's where you can see my earlier comments in context. As much as I like some of the dialogue at Speak Up, the acidic tones (attitude) over there are hard to take in large doses.\n\n"
    },
    {
      "time": "4 Dec 2003 — 1:26pm",
      "content": "Joseph,   \nI'm not so sure. A successful mark could last maybe 20 or 30 years. Think about CBS, NBC, IBM, Nike (which I didn't do) and A&E, The History Channel, Sears, W magazine (which I did). And if you DO change it, make it better or equivalent like TNT (also my orig.) whose update I have no trouble with.   \nMike\n\n"
    },
    {
      "time": "4 Dec 2003 — 1:36pm",
      "content": "VH1 and MTV cannot be compared ... really ... I mean, think about it. It is almost ... not quite ... like comparing haute couture to street fashion. Most of the haute couture fashion houses that are still in business have reinvented themselves through their clothes, but not their \"logos\". But, most street cred fashion changes so often. Think about the hangtags that so many different designers did for [Express](http://web.archive.org/web/20131019162555/http:/www.idanda.net/brand.php?article=111), these are meant to serve a purpose, fast fashion (not unlike fast food) and then disappear.\n\n"
    },
    {
      "time": "4 Dec 2003 — 1:42pm",
      "content": "My illness isn't helping me write at all. I wasn't saying that VH1 is to street as MTV is to haute couture. Not at all. I was thinking generally or abstractly. Hmmph!\n\n"
    },
    {
      "time": "8 Dec 2003 — 3:04pm",
      "content": "It's easy to just dismiss something as \"just plain bad\" or \"you can't be serious\" (legitimate gut reactions, I suppose). But, it takes more thought to consider something and develop an informed opinion -- whether you agree or not.   \n   \nI'm glad this thread and others have a variety of opinions and different perspectives. We need more careful consideration, not just blunt 'sincerity.' (This isn't an either / or... careful consideration requires sincerity.)\n\n"
    }
  ]
}
