{
  "id": "2295",
  "title": "(x) AD&D, TSR, Dark Sun product line - Opti Packard {Randy}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "This is the font used by the publisher of AD&D, TSR, for their 1st edition releases in the Dark Sun product line. I have found similar fonts, but none that match it precisely.   \n   \nI have chosen letters for the sample that are some of the most distinctive of the font as a whole. If this still is not enough for a positive ID, I can provide a whole page of scanned text.   \n   \nGood luck...I don't think you can do it. ![:-)](http://web.archive.org/web/20141026054753im_/http:/www.typophile.com/forums/clipart/happy.gif) (Just challenging you to excellence.)   \n   \n ![Text Sample](http://web.archive.org/web/20141026054753im_/http:/www.typophile.com/forums/messages/83/21713.jpg)\n\n",
  "author": "anonymous",
  "time": "3 Dec 2003 — 1:25pm",
  "uid": "1203",
  "comments": [
    {
      "time": "3 Dec 2003 — 8:18pm",
      "content": "Wow! nice eye Randy. I knew I'd seen this before. If I'd gotten further   \ninto my Old Style font notebook, I'd have reached my entry for Packard.   \n   \nLike many typefaces in the Solotype Catalog, Dieter Steffmann   \ndigitized this as [Packard Antique](http://web.archive.org/web/20141026054753/http:/www.moorstation.org/typoasis/designers/steffmann/index.htm). So if you are able to use Windows   \nTruetype or Type 1, it's a freebie. Comes with a bold variant as well.   \n   \nNo promise, of course, that Steffmann's version will match your   \nsample precisely.\n\n"
    },
    {
      "time": "4 Dec 2003 — 2:41pm",
      "content": "OptiFonts are handled these days by [Castcraft](http://web.archive.org/web/20141026054753/http:/www.castcraft-software.com/homepage.html).   \n   \nTheir website is, to say the least, outdated and the only part that   \nfunctions usefully is the Designer Collections link. Since Opti   \nPackard is not in any of the four Designer Collections and the   \nOnline Catalog images don't appear, you would need to contact   \nCastcraft.   \n   \nOver the last few years, I've contacted them by e-mail 5 times and   \nreceived a reply once. Hopefully you'll fare better. I'm sure that they   \ncould provide the font in the format of your choosing.   \n   \nAs to which font would be most accurate, it seems likely that the   \nOptiFont was used. Since Dieter Steffmann's version is free, you   \ncan check it out for yourself. It doesn't fare the best on-screen, so   \nbe sure to print a sample paragraph or two to see it on paper,   \nwhere it looks splendid.\n\n"
    },
    {
      "time": "4 Dec 2003 — 3:07pm",
      "content": "There was a version called 'Paliard' that was made by NovelFonts in the mid-90's but I have been unable to find anywhere that still sells them. I found only one site that shows a sample, and it [looks identical](http://web.archive.org/web/20141026054753/http:/www.professionalinvitations.com/cfont2.htm).\n\n"
    },
    {
      "time": "4 Dec 2003 — 3:36pm",
      "content": "Great info Mike and Mike.   \n   \n$57.50 per font, did I read that correctly?   \n   \nDoes OPTI have a connection to URW?   \n   \nI'd love to see a Foundry Flow Chart to see where   \nall these obscure type companies came from.   \n   \nbj\n\n"
    },
    {
      "time": "5 Dec 2003 — 8:37am",
      "content": "My advice would be to contact Dieter Steffmann before you do anything to distribute this (if you just use it yourself that's up to you). For one thing, Dieter may want to know what changes were made; for another your software may 'fix' it only so that your software doesn't see errors/warnings -- are you sure that makes it compatible with any other similar software, like FontLab or Fontographer?   \n   \nAnyway, talk to Dieter, is my advice.\n\n"
    },
    {
      "time": "4 Dec 2003 — 8:35am",
      "content": "I am impressed! I have been looking for the font off-and-on for about 5 years or more.   \n   \nI had begun to think that it was a custom font.   \n   \nI have a couple questions: First, is Opti Packard a Truetype or Type 1 font, or does it only appear in the Solotype Catalog? Second (if Opti Packard does not exist in an electronic form), do I understand you correctly that Packard Antique would be the closest electronic form of Opti Packard?   \n   \nThank you!   \n   \nOnce again...I am truly impressed. ![:-)](http://web.archive.org/web/20141026054753im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "5 Dec 2003 — 8:27am",
      "content": "Thanks for the info.   \n   \nNow...I opened up Steffmann's Packard Antique font with High-Logic's Font Creator Program and I noticed that there were several errors/warnings. I fixed (very meticulously, mind you) the errors and warnings, which included contour directions, redundant points, overlapping contours, and a few obvious defects. I saved my fixed font as a new font file (Truetype).   \n   \nWhat is the best way to handle this in terms of releasing this \"fixed\" version out into the \"wild\" of the Internet. Of course, I would give Steffmann full credit still, but I would make a note within the font that it was a cleaned up version of the font. Should I name my fixed font differently? Should I even be doing this?   \n   \nI was hoping that my cleanup work would make the font appear better on screen, but unfortunately, my changes had no effect in this regard. You are right however, that the font looks excellent when printed out.\n\n"
    },
    {
      "time": "5 Dec 2003 — 8:42am",
      "content": "Thanks for the advice...I will heed it. ![:-)](http://web.archive.org/web/20141026054753im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "3 Dec 2003 — 8:01pm",
      "content": "Don\n\n"
    }
  ]
}
