{
  "id": "2296",
  "title": "Important news about a scam",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "809 Area Code   \n   \nWe actually received a call last week from the 809 area code. The woman said \"Hey, this is Karen. Sorry I missed you--get back to us quickly.   \nHave something important to tell you.\"\n\n",
  "author": "Dan Weaver",
  "time": "3 Dec 2003 — 1:26pm",
  "uid": "2203",
  "comments": [
    {
      "time": "3 Dec 2003 — 1:48pm",
      "content": "Damn Canadians, them and their area-code swipin' islands. ;-)   \nBTW, where's 284 and 876?   \n   \nAnd I wonder how much they bribed US Senators to give foreign   \ncountries \"native\" area codes... Must've been a real sweet deal.   \n- \"Hey, you pass this law, and we'll give you a beachfront palace - deal?\"   \n- \"What a stupid question - you don't have to be so nice - that's my _job_.\"   \n   \nhhp\n\n"
    },
    {
      "time": "3 Dec 2003 — 2:01pm",
      "content": "Hrant, to show how small the world has become I got this email from a friend from China. I have no idea where these area codes are from, but it seems someone wants to spread some holiday joy (for themselves). As for politics one New Jersey canadate for the state house spent a record, over 4 million dollars to get that office and thats not even a national post.\n\n"
    },
    {
      "time": "3 Dec 2003 — 2:04pm",
      "content": "[http://www.snopes.com/inboxer/scams/809.htm](http://web.archive.org/web/20131107173515/http:/www.snopes.com/inboxer/scams/809.htm)\n\n"
    },
    {
      "time": "3 Dec 2003 — 2:13pm",
      "content": "Great link Chris!\n\n"
    },
    {
      "time": "3 Dec 2003 — 9:25pm",
      "content": "Snopes is great for stuff like this. Especially all those other ones that aren't true and get people all paranoid.\n\n"
    },
    {
      "time": "4 Dec 2003 — 8:37am",
      "content": "I feel it's my duty to play Geography Police and point out that the Bahamas and the British Virgin Islands are two totally different island groups. Both, however, have blue skies, soft breezes, sandy beaches, gin-clear waters that are warm and welcoming ... [sigh] ... just thinking about it lowers my productivity by more than 9.4% (annual rate).   \n   \nIf I could figure out a scam -- phone or otherwise -- that would keep me in beer and mangos on the caribbean, I'd be there in a heartbeat.\n\n"
    },
    {
      "time": "7 Dec 2003 — 5:13pm",
      "content": "\"Damn Canadians, them and their area-code swipin' islands. ;-)\"   \n   \nHmm... Witty quips really aren't your thing, are they? Just in case you care, the British Virgin Islands are \\*British\\*. I can see how that may be confusing... Also, for future reference, canadians do not live in igloos, and I personally, have never had direct experience with hockey. Eh?!   \n   \n(Of course, as they say, ignorance is bliss... You must be very happy...)\n\n"
    },
    {
      "time": "15 Jan 2013 — 7:42pm",
      "content": "<cite>We must read or watch a news of scams or even malaysia fraud that could affects to your lifestyle and thinks of not to negotiate to any strangers.</cite>\n\nImagine, A lawyer in Los Angeles who can't speak English.\n\nOh, wait... a lawyer...\n\n"
    },
    {
      "time": "15 Jan 2013 — 7:45pm",
      "content": "Three-digit area codes with a 0 or 1 in the middle are a feature of the zone of the world with 1 as its country code. (Now abandoned because of the need for more numbers.) This includes the United States, Canada, and the Carribean. Prior to Castro, Cuba was in this area as well, under the 809 area code, which originally covered all the Carribean before being confined to the Dominican Republic.\n\n"
    },
    {
      "time": "15 Jan 2013 — 7:50pm",
      "content": "LA is the only city in the world where the tourists speak the local language better than the locals.\n\nhhp\n\n"
    }
  ]
}
