{
  "id": "2297",
  "title": "Typo alternatives",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi people,   \n   \nI'm doing an identity-package for a newly formed company called Hoffmann & Rich. They do coaching-tasks for medium and large companies - a very experienced couple ![:-)](http://web.archive.org/web/20131013031002im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nWell, so far the colours and the symbol have been approved but I could really use some feedback on the typography. Any suggestions for alternatives?   \n   \nAs always, thanks for your help and time!   \n   \nCheers,   \n/Henriko   \n   \n ![Hoffmann & Rich - various logos](http://web.archive.org/web/20131013031002im_/http:/www.typophile.com/forums/messages/4100/21736.jpg)\n\n",
  "author": "superfetz",
  "time": "4 Dec 2003 — 3:33am",
  "uid": "1388",
  "comments": [
    {
      "time": "4 Dec 2003 — 4:56am",
      "content": "Cocon, definitively.   \n(But maybe a lighter version?)   \n(Or, reduce its size?)\n\n"
    },
    {
      "time": "4 Dec 2003 — 6:51am",
      "content": "The color combo and layout seems awfully familiar. IIRC there's a similar logo in use by some IT or management consulting outfit but I can't for the life of me remember which...not terribly helpful, I suppose, but maybe something to research if you haven't. Or not.   \n   \nOn a more substantive note, I agree with Eduardo regarding Cocon, though I also like Dutch 809, modulo the ampersand which isn't among my favorites.   \n   \nThe symbol has been approved, so I probably should keep my mouth shut. Discretion, however, is not one of my virtues. So, what is it? How does it relate to coaching?   \n   \n(aside: am I the only one whose skin crawls upon reading/hearing that word? too much time on Ryze and eCademy amongst the throngs of 'life coaches', perhaps)   \n   \nBack to substance, I'm not feeling any real relationship between it and the type in any of the mooted solutions. Perhaps it should be closer to the type? The two elements just seem to me to 'float' in space. I'd try mucking with both larger and smaller text and see what that does.\n\n"
    },
    {
      "time": "4 Dec 2003 — 8:32am",
      "content": "Hey.   \n   \nThe Cocon definitely gives a more informal feel, it's warmer. But is it just me, or does it feel like it's leaning to the left? I think the logo is pulling it some, and combined with the terminals...   \n   \nIs it heresy to suggest putting a few degrees of right lean into it to optically straighten it?   \n   \nI do like the logo. It looks like 4 people in very nice chairs gathered around a very small table, or maybe a big group hug.   \n   \nDavid Roughs\n\n"
    },
    {
      "time": "4 Dec 2003 — 9:38am",
      "content": "Cocon rules.   \n   \nBloemsma has in fact been fighting the backwards lean in his design style for a while - and with Avance has found one solution. But a few degrees is too much, try half or one degree. Syntax for example leans forward by half a degree, while Seria's \"upright italic\" leans by [an average of] one.   \n   \nThat's unless you want to make the lean visible. In that case I've found that about 3 degress is the comfortable minimum (at normal reading sizes).   \n   \nhhp\n\n"
    },
    {
      "time": "5 Dec 2003 — 12:40am",
      "content": "Cocon, definitively.   \n(But maybe a lighter version?)   \n(Or, reduce its size?)   \n   \nMy thoughts exactly.   \n   \nThe 'ff's might look fun if they were joined?   \n   \nHildebrant.\n\n"
    },
    {
      "time": "11 Dec 2003 — 2:42am",
      "content": "I find the symbol with cocon makes a kind of teddybear/toy feel and given the approval of the symbol and the colour Avenir seems a better choice.\n\n"
    }
  ]
}
