{
  "id": "2310",
  "title": "Methoda: Triple Height Hebrew Font",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hello everyone! Itay K introduced me to these forums, and it's a real pleasure seeing such widely active discussions on type.   \n   \nI'm uploading a sample of a typeface I've been working on, it's a simple Hebrew font, stretched to fit three different \"x-heights\". The basic letter shape is also my design.   \n   \n ![\"Methoda\"](http://web.archive.org/web/20131011060717im_/http:/www.typophile.com/forums/messages/29/21813.gif)\n\n",
  "author": "meir",
  "time": "5 Dec 2003 — 7:16am",
  "uid": "2595",
  "comments": [
    {
      "time": "5 Dec 2003 — 8:00am",
      "content": "My Hebrew is poor, and my eye for it not good enough to really comment, but a lot of the 'sans' style Hebrew fonts look very clunky to me, not having the subtle modeling that the best modern Roman sans do.   \n   \nI was struck by the sign in back of the four security chiefs that appeared recently in the papers that the font was very well done in this respect. (Yes I read the 'we are headed for catastrophy' message - I was glad I could think about the font!)   \n   \nYour font is more graceful than some other Hebrew sans I have seen. My only questions would be about your tet and tsadi sofit, which don't seem quite as balanced. But I don't know enough to comment further.\n\n"
    },
    {
      "time": "5 Dec 2003 — 9:05am",
      "content": "Thank you for your responce, William!   \n   \nYou are right about the Tet, I made an alternative version of it, without a slanting line, it has much more inner white space.   \n   \nAbout the Tzadi Sofit, I also made an alternative shape that has a lower intersection point (positioned on its baseline).   \n   \nI'm including an image of the alternative letters compared with the originals.   \n   \n ![\"Methoda\" Tet And Tzadi Sofit](http://web.archive.org/web/20131011060717im_/http:/www.typophile.com/forums/messages/29/21821.gif)\n\n"
    },
    {
      "time": "5 Dec 2003 — 10:04am",
      "content": "The construction seems interesting.   \nBut I'm not really qualified to say more.   \nGood luck with it!   \n   \nhhp\n\n"
    },
    {
      "time": "5 Dec 2003 — 10:05am",
      "content": "I like the alternates; they feel 'right' and balanced to me.   \n   \nYou might consider what they call 'trapping' - a widened, deeper 'v' of white space on some of the narrow angle joins, such as on the narrower versions of the tzadi sofit, and on the middle arm of all the widths of shin. This will make it not 'close up' with ink or on screen when it is small.   \n   \nI think the numerals need some work, but I'm not sure how. I know that Arabic numberals are handled different in Roman fonts than in Arabic ones. Are they handled yet again differently in Hebrew fonts, to harmonize with the Hebrew?   \n   \nIn the big size I can see better what is going on, and I like the way you've rounded the bottom of the tet, and rounded outside corners. This adds a finesse that I have sometimes found missing in Hebrew sans faces, as I said.\n\n"
    }
  ]
}
