{
  "id": "2312",
  "title": "Two fonts or not two fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Please can anyone help settle a simple disgreement. Can two different fonts be used in the same Corporate identity. And   \n   \nIs this written down anywhere? ie it is okay or it is not okay.   \n   \nA quick answer will make my life instantly bearable   \n   \ncheers\n\n",
  "author": "coops",
  "time": "19 Aug 2002 — 4:34am",
  "uid": "681",
  "comments": [
    {
      "time": "19 Aug 2002 — 4:41am",
      "content": "yes.\n\n"
    },
    {
      "time": "19 Aug 2002 — 5:58am",
      "content": "yes. as a matter of fact it is good idea: type for web is more or less a question of a few fonts. everybody uses them. but if you use the same fonts for the rest of your publications, identity is lost. because everybody uses them.   \n   \nsoren o\n\n"
    },
    {
      "time": "19 Aug 2002 — 9:06am",
      "content": "I dont think it is necessarily a question of \"different\" so much as being \"compatible\" or \"appropriate\". So long as the combination is thoroughly thought through in terms of the messages it gives out, its range, readability, the typographic structure you intend to use and, of course, its historical contexts, it should not matter.\n\n"
    },
    {
      "time": "22 Aug 2002 — 4:31pm",
      "content": "it would be a branding nightmare if we only used one. think of what would be the difference between a title, sub-head and body text...bolds? another bold a heavy? and an underline? - it would look like a high school essay produced in word doc.   \n   \na designer's mark should be in matching pairs of type for collateral and corp systems.\n\n"
    },
    {
      "time": "22 Aug 2002 — 8:54pm",
      "content": "the answer is that you need to be wary of **anything** dogmatic. and yes, this **is** me saying this.\n\n"
    },
    {
      "time": "23 Aug 2002 — 5:11am",
      "content": "If you're using Impact you have bigger issues. All the time I be hatin' on Impact.\n\n"
    },
    {
      "time": "29 Aug 2002 — 3:51am",
      "content": "Thanks for all your input. I am forwarding comments and a couple of quotes I pulled from 'The Complete Typographer' (a book a found from my college days). To the big wigs who (unfortunately) as usual make the choices on final design. Amazing considering all the skills they possess in relation to design\n\n"
    },
    {
      "time": "19 Aug 2002 — 6:27am",
      "content": "I assume you mean 'corporate identity' as a   \nsystem and not just a 'mark.' In which case I'd   \nalso say yes. It's a good idea unless you're   \nusing Helvetica and Impact because you can't get   \nthe right set of weights. (Just one lame example.)   \n   \nBut, in general, it seems to make little sense to make   \nrules about this stuff, when it's totally dependent on how   \nyou're using it and what it's for.\n\n"
    }
  ]
}
