{
  "id": "2313",
  "title": "Ignaz Textura",
  "forum": "Blackletter / Uncial",
  "tags": [
    "Blackletter / Uncial"
  ],
  "content": "Hello everyone, this is my first post of Typophile!   \n   \nIgnaz Textura's forms, pictured below, are based off letters that I found on a sepulchral memorial outside of St. Ignaz church in Mainz (Germany).   \n   \n ![Inaz Textura?first sample](http://web.archive.org/web/20150419182312im_/http:/www.typophile.com/forums/messages/29/21834.gif)   \n   \nThe memorial dates from the mid-16th century. The original letters seem to be similar to a textura, but being carved into stone, are quite different from contemporary printed, or written blackletters. I hope that I've been able to capture some of this in my drawings.   \n   \nThis typeface is still in its early stages, and I'd really love to hear what ever people think about it.\n\n",
  "author": "dan_reynolds",
  "time": "5 Dec 2003 — 9:26am",
  "uid": "1085",
  "comments": [
    {
      "time": "5 Dec 2003 — 9:44am",
      "content": "Very concrete.   \n   \nThe most interesting letter to me was the \"e\" with the little hookling. Was it also carved, or did you add it yourself? Does this shape match the meaning of what was written on the memorial?\n\n"
    },
    {
      "time": "5 Dec 2003 — 12:11pm",
      "content": "All three of the e's are based off of the actual stone carving, so I didn't \"invent\" the hookling myself (unfortunately!). It is possible that the unattached hookling on the second e may have actually been attached once; the inscription is on red sand stone, which is very soft. Most of the letters are now quite corroded, and some are illegible to me.   \n   \nThe letters are from a c.A3-sized inscription on an outdoor sepulcher. Over the seplcher is a larger-than-life, multi-figured sculpture group, depicting the crucifixion (boy, that's a mouthful). The inscription is in German, which seems abnormal for the ecclesatic art of the time, which at least in Catholic Germany was usually done in Latin. However, I don't think that the inscribed text has any deep, inner meaning. I think that its more of your average variety of gravestone thing.\n\n"
    },
    {
      "time": "5 Dec 2003 — 12:12pm",
      "content": "\\<font class=\"dontLookLikeCrap\"\\>\\<font class=\"dontLookLikeCrap\"\\>\\<font class=\"dontLookLikeCrap\"\\>\\<font class=\"dontLookLikeCrap\"\\>\\<font class=\"dontLookLikeCrap\"\\>\\<font class=\"dontLookLikeCrap\"\\>\\<font class=\"dontLookLikeCrap\"\\>\\</font\\>\\</font\\>\\</font\\>\\</font\\>\\</font\\>\\</font\\>\\</font\\>\n\n"
    },
    {
      "time": "5 Dec 2003 — 12:12pm",
      "content": "\\<font class=\"dontLookLikeCrap\"\\>\\<font class=\"dontLookLikeCrap\"\\>\\<font class=\"dontLookLikeCrap\"\\>\\<font class=\"dontLookLikeCrap\"\\>\\<font class=\"dontLookLikeCrap\"\\>font\\>\\</font\\>\\</font\\>\\</font\\>\\</font\\>\n\n"
    },
    {
      "time": "5 Dec 2003 — 12:13pm",
      "content": "Ack! I accidently posted the same thing four times! I can go into the fields and delete the text, but not the posts themeselves! Sorry!\n\n"
    },
    {
      "time": "16 Mar 2004 — 3:20pm",
      "content": "anything new on this one?\n\n"
    },
    {
      "time": "17 Mar 2004 — 4:58am",
      "content": "Yes, Paul, here's something for you. I haven't posted anything new, since I didn't get much feedback from my first round, but here are two new samples. My letterspacing isn't right yet. And I'm still working on things, like the uppercase. The second sample shows some alterations to 5 uppercase letters that I'm working on now.   \n   \n ![ignaz textura sample 1](http://web.archive.org/web/20150419182312im_/http:/www.typophile.com/forums/messages/29/28750.gif)   \n   \n ![ignaz textura sample 2](http://web.archive.org/web/20150419182312im_/http:/www.typophile.com/forums/messages/29/28751.gif)\n\n"
    },
    {
      "time": "17 Mar 2004 — 5:37am",
      "content": "Wow, very nice, Dan.   \nThe lowercase seems fine to me. But maybe I'd like to see a descending z. The uppercase... yes, it needs work. There are some good ideas, like the two A's in your bottom image, and the T, but there are also some confusing glyphs, like V/W, M/N, O/P/Q, I/J. Finally, I'd try to make the figures just a bit heavier.\n\n"
    },
    {
      "time": "17 Mar 2004 — 6:01am",
      "content": "Dean,   \n   \nThis is beautiful type. It really stands apart from every other Textura I've seen. Keep going in the same direction with it. You already recognize that the spacing is an issue, and that's the only major thing I've noticed.   \n   \nYou should consider adding a half-r, which looks somewhat like a condensed x-height 2. One example can be found in Helzel's K\n\n"
    },
    {
      "time": "17 Mar 2004 — 7:59am",
      "content": "hey thanks dan. it's looking good! i'd have to agree that some of the caps are confusing, i have the most trouble with the O/P/Q and the Y & Z just don't seem to fit with the rest for me. For some reason i also feel that the figures don't fit either. They seem to belong more to the Schwabacher style. The lowercase really shines, if you can just pull the uppercase and figures up to their level you'd have a real solid face. keep up the good work!\n\n"
    },
    {
      "time": "17 Mar 2004 — 9:17am",
      "content": "I'm lovin' it! Reminds me of Margo Chase's stuff. Post a PDF when you get a chance.   \n   \n-Addison\n\n"
    },
    {
      "time": "17 Mar 2004 — 9:59pm",
      "content": "John what about the site you posted? are those typefaces for sale?\n\n"
    },
    {
      "time": "18 Mar 2004 — 11:43pm",
      "content": "Thanks for the feeback, guys. I'm working on all the trouble-letters that you've pointed out, and some others too. (I though you'd slam me for that X)   \n   \nFirst, two new I variants, then three Ps. I really like the form of P number 2, but it looks alot like a schwabacher E\n\n"
    },
    {
      "time": "19 Mar 2004 — 8:51am",
      "content": "Somebody kill me! I'm what's left of a duplicate post!\n\n"
    },
    {
      "time": "19 Mar 2004 — 8:56am",
      "content": "_John what about the site you posted? are those typefaces for sale?_   \n   \nYes. That's Gerhard Helzel's site. His main blackletter page is [here](http://web.archive.org/web/20150419182312/http:/www.romana-hamburg.de/fraktur1.htm) and his general page is [here.](http://web.archive.org/web/20150419182312/http:/www.romana-hamburg.de/) I don't know if he speaks English, but he appears to understand Latin and Greek. He's built a library of neglected and forgotten blackletter fonts. He added some swift code info, so I guess he's been getting some foreign orders lately.   \n   \n--   \nBack to Ignaz:   \n   \n_First, two new I variants, then three Ps. I really like the form of P number 2, but it looks alot like a schwabacher E_\n\n"
    },
    {
      "time": "21 Mar 2004 — 11:08am",
      "content": "Yes, I do have plans for a descending z. I'm going to add a half r, too. I'll post them soon.   \n   \nI'm very excited by OpenType, but I've never done anyth\n\n"
    },
    {
      "time": "22 Mar 2004 — 7:07am",
      "content": "Great news! If yer already a registered Fontographer user, you can get a great discount on FontLab. You should check out their website, if i 'member correctly it's something like $200 savings, and making the swich is worth it, IMO.\n\n"
    },
    {
      "time": "22 Mar 2004 — 7:26am",
      "content": "\\>I don't suppose that I could combine that with a student discount, could I?\n\n"
    },
    {
      "time": "25 Mar 2004 — 8:57am",
      "content": "OK, here is an updated version, based on feedback. I've even added a half-r, although I'm not sure how to use it properly. Some numerals and caps are new, along with a few additional characters and a long-z.   \n   \n(John, in Albert Kapr/Hans Peter Willberg's _Fraktur: Form und Geschichte der gebrochenen Schrfiten_, I found a sample of a half-r, but not any description of usage, even though the book has a nice appendix on setting Fraktur correctly, etc. Do you know anyone who has written a nice tract about this?)   \n   \n ![](http://web.archive.org/web/20150419182312im_/http:/www.typophile.com/forums/messages/29/29244.jpg)\n\n"
    },
    {
      "time": "25 Mar 2004 — 9:27am",
      "content": "i think john summed it up nicely when he wrote   \n\\>\\>The half-r is generally substituted after a \"round\" letter like o, p, or b.   \nThere may be more to it than that, but i think that's it!   \nThe diaganol of the new Z seems weak to me.\n\n"
    },
    {
      "time": "26 May 2004 — 12:21pm",
      "content": "i'm gonna keep buggin you on this one till we see it released though some venue. where are you at on this one these days?\n\n"
    },
    {
      "time": "1 Jun 2004 — 6:08am",
      "content": "Hey Paul, thanks again for keeping me on the money. Speaking of money, I can't imagine this puppy getting adopted by anyone anytime soon\n\n"
    },
    {
      "time": "1 Jun 2004 — 6:52am",
      "content": "Sweet!\n\n"
    },
    {
      "time": "1 Jun 2004 — 10:35am",
      "content": "That's a plan!   \n   \nhhp\n\n"
    },
    {
      "time": "1 Jun 2004 — 10:48am",
      "content": "\\> Hey Dan, looks good! One thought tho: the lc \"e\" in the sample above (and the rest of the examples too i supose) looks more like an alternate \"c\" to me. perhaps the \"e\" should look more like the one in the \"de\" ligature? just a thought. \\>\n\n"
    },
    {
      "time": "5 Jun 2004 — 1:40pm",
      "content": "Posted below are full, fleshed-out alphabets that follow the new sizing concept. (No ligatures, special characters, or numerals yet, though). Thanks for the nice words, everybody!   \n   \n ![opticals2](http://web.archive.org/web/20150419182312im_/http:/www.typophile.com/forums/messages/29/37624.gif)\n\n"
    },
    {
      "time": "17 Jun 2004 — 6:30am",
      "content": "Here is a PDF, with various settings of Ignaz in text, in English and in German. I'd love to hear your feedback on its further development!   \n   \nThe first two pages are Ignaz Text. Page 3 is a Waterfall from Ignaz Titling, and page four displays character sets.\n\n<!--attachment: Ignaz-in-Text-38539.pdf*mime_pdf.gif*application/pdf*51.2*Download+my+Ignaz+sample+now%21*Ignaz%2din%2dText%2epdf --><!--attachment: Ignaz-in-Text-38539.pdf*mime_pdf.gif*application/pdf*51.2*Download+my+Ignaz+sample+now%21*Ignaz%2din%2dText%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150419182312im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Download my Ignaz sample now!<br><a href=\"http://web.archive.org/web/20150419182312/http:/www.typophile.com/forums/messages/29/Ignaz-in-Text-38539.pdf\" target=\"_blank\"><b>Ignaz-in-Text.pdf</b></a> (51.2 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "17 Jun 2004 — 9:25am",
      "content": "Nice.   \nIn your text cut your blank space needs to be slightly bigger.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jun 2004 — 5:24am",
      "content": "The text samples in the attached PDF have revised spacing, and more accented/special characters at the end.\n\n<!--attachment: Ignaz-in-Text2-39339.pdf*mime_pdf.gif*application/pdf*53.6*more+developed+pdf*Ignaz%2din%2dText2%2epdf --><!--attachment: Ignaz-in-Text2-39339.pdf*mime_pdf.gif*application/pdf*53.6*more+developed+pdf*Ignaz%2din%2dText2%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150419182312im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">more developed pdf<br><a href=\"http://web.archive.org/web/20150419182312/http:/www.typophile.com/forums/messages/29/Ignaz-in-Text2-39339.pdf\" target=\"_blank\"><b>Ignaz-in-Text2.pdf</b></a> (53.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "1 Jun 2004 — 7:03am",
      "content": "Very nice. Better name: maybe just drop the \"Text\" from that version.\n\n"
    }
  ]
}
