{
  "id": "2323",
  "title": "Project ideas",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi,   \nIm aware this may be a silly request but I am not working at the moment and want to produce some work while I have the time. The problem is setting myself a project.   \nIm asking for ideas on what I could do. Nothing too wacky but a project that would be beneficial to my portfolio.   \nThanks for any ideas,   \nDavid.\n\n",
  "author": "david_leonard",
  "time": "Sat, 2003-12-06 23:31",
  "uid": "1394",
  "comments": [
    {
      "time": " Sun, 2003-12-07 03:33",
      "content": "What kind of projects are currently in your portfolio?\n\n"
    },
    {
      "time": " Sun, 2003-12-07 05:47",
      "content": "David what kind of work are you looking for? POS, DM, web design, type design, print? Also see if there is a local charity who could use your help pro-bono.\n\n"
    },
    {
      "time": " Sun, 2003-12-07 15:26",
      "content": "My work is all print at the moment and I want to continue with some print projects. I have some business cards , letterheads already so I want to move away from that and give my portfolio a better range of work.   \nI have done some work for the National Aids trust, It was for a competition, Ill look up some charities but I dont want to just produce posters. Im looking for something that will deal with alot of type. I was thinking about a cd + booklet but am afraid alot of places I will try to get a job with will not have alot of experience with cd's themselves. So something that future employers have dealt with. I know I should be able to think of something, Its just difficult to set your own project and create a brief. But Im thinking along of a theatre production program.   \n   \nThanks for any help,   \nDavid.\n\n"
    },
    {
      "time": " Sun, 2003-12-07 17:20",
      "content": "A theatre productuon programme is a good idea. A 3- or 4-panel brochure can also be in interesting project: not too large, easy to include in a portfolio, but with potential for relatively complex interraction of text and image.\n\n"
    },
    {
      "time": " Sun, 2003-12-07 17:23",
      "content": "This reminds me of a student project that the Underware guys described during their ATypI presentation. A bunch of their students went out and found a small cafe with really bad signage: the project was to redesign the signage for the cafe, and then take the redesign to the owners and see if they want to implement it. The last bit didn't go too well: the owners of the cafe were immigrants who didn't speak the local language well enough to understand what the students were asking; they thought the students were from the immigration police ![:-(](http://web.archive.org/web/20050518123358im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": " Mon, 2003-12-08 07:30",
      "content": "David, I listen to WBGO a Jazz station out of Newark NJ, they are a non-profit and produce a newsletter that at best is bad. Try contacting a non-profit in your area they always need help and don't have the money but can give you exposure and they will be real projects.\n\n"
    },
    {
      "time": " Mon, 2003-12-08 08:05",
      "content": "Hey.   \n   \nNo-profits will definitely give you a lotta work. And they're a great learning experience for students, like myself.   \n   \nLearn How To Work Under A Deadline!   \nExperience Approval By Committee!   \nDeal With Tight Budgets And Kinkos Level Output!   \nVariety! Postcards! Newsletters! Posters! T-Shirts!   \n   \nAnd something I plan on doing one of these days is some guerilla show-flyering. Find an upcoming show that appeals, create a kick- poster for it and cover the town with it. No pay and some out-of-pocket expense, but it'd be fun and might get ya noticed (if ya include contact info for the designer).   \n   \nDavid Roughs\n\n"
    }
  ]
}
