{
  "id": "234",
  "title": "San Fransico Giants typeface",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Here's another sports team like face for your perusal:   \n   \n ![image.jpeg](http://web.archive.org/web/20150311150619im_/http:/www.typophile.com/forums/messages/83/1117.jpg)\n\n",
  "author": "graficartist",
  "time": "10 Apr 2002 — 9:39am",
  "uid": "1031",
  "comments": [
    {
      "time": "10 Apr 2002 — 10:59am",
      "content": "So it's called Tuscan, huh? This particular typeface is from a Rawlings catalog and is called \"Fancy\". (See also \"Pittsburgh Pirates Typeface\" posting.) I just now found a very similar one on the MyFonts website called \"URW Wood Type D\".   \n   \nAnd I made a mistake on the team myself. It's the Pittsburg Pirates that use a similar typeface and not the SF Giants. I reversed the two names. Oops.\n\n"
    },
    {
      "time": "10 Apr 2002 — 12:37pm",
      "content": "Revealing my ignorance once again. Thank you for the correction.   \n   \nThese fonts are from the 1999 Men's or Women's Basketball Rawlings Catalogs. They didn't have much more information than that. I've looked on their website but can't find anything about the typefaces.   \n   \nThanks for your help and my congrats to 'Brother' Jones on the Retina face. Truly Divine.\n\n"
    },
    {
      "time": "10 Apr 2002 — 1:42pm",
      "content": "Libraries are the best, but for those wanting to purchase, the inimitable [http://www.bookfinder.com](http://web.archive.org/web/20150311150619/http:/www.bookfinder.com/) happens to be showing available copies of both works.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Apr 2002 — 2:15pm",
      "content": "Jonathan have you come across any reference for an animated tuscan? I'm planning such a beast right now. Bouncing baseline and offbeat playfulness.\n\n"
    },
    {
      "time": "10 Apr 2002 — 2:25pm",
      "content": "If there wasn't such a difference between northern and southern Italy, one might consider naming such a font \"Tarantella\"!   \n   \nhhp\n\n"
    },
    {
      "time": "10 Apr 2002 — 2:34pm",
      "content": "Jonathan - Thanks! I'm just a stone's throw from BYU's library that\n\n"
    },
    {
      "time": "10 Apr 2002 — 2:35pm",
      "content": "Check out the site:   \n   \n [http://www.lib.byu.edu/hbll/](http://web.archive.org/web/20150311150619/http:/www.lib.byu.edu/hbll/)\n\n"
    },
    {
      "time": "10 Apr 2002 — 2:38pm",
      "content": "Dude, when it comes to a serious type library this side of the Atlantic, UCLA rules:   \n [http://www.library.ucla.edu/](http://web.archive.org/web/20150311150619/http:/www.library.ucla.edu/)   \n   \nIn fact, to me it's the one good thing UCLA has...   \n   \nhhp\n\n"
    },
    {
      "time": "11 Apr 2002 — 8:53am",
      "content": "Jonathan, here's another one for you...   \n   \n ![image.jpg](http://web.archive.org/web/20150311150619im_/http:/www.typophile.com/forums/messages/83/1136.jpg)\n\n"
    },
    {
      "time": "11 Apr 2002 — 12:33pm",
      "content": "I wouldn't be surprised. My bosses brought a bunch of font cd's back from the Philippines. There's no such thing as copyright honor in that country.   \n   \nI've got a couple other Tuscan-like typefaces I found today by Ray Larabie. Take a peek:   \n   \n ![image.jpg](http://web.archive.org/web/20150311150619im_/http:/www.typophile.com/forums/clipart/your_image.gif)   \n ![image.jpg](http://web.archive.org/web/20150311150619im_/http:/www.typophile.com/forums/clipart/your_image.gif)\n\n"
    },
    {
      "time": "11 Apr 2002 — 12:42pm",
      "content": "I wouldn't be surprised. My bosses bring a lot of stuff back from the Philippines where even software can be bought for $2 per (pirated) cd.   \n   \nI found a couple of other Tuscan-like typefaces today. You might check out:   \n   \n [http://www.larabiefonts.com](http://web.archive.org/web/20150311150619/http:/www.larabiefonts.com/)\n\n"
    },
    {
      "time": "11 Apr 2002 — 12:43pm",
      "content": "oops. thought i fixed that...\n\n"
    },
    {
      "time": "9 May 2002 — 12:37pm",
      "content": "Just discovered some fun tuscans at [FontMesa](http://web.archive.org/web/20150311150619/http:/www.fontmesa.com/font_index.htm).   \n   \nStephen\n\n"
    },
    {
      "time": "10 Apr 2002 — 10:22am",
      "content": "These are great, Tom. Where are you finding them?   \n   \nIt's strange how many sports teams use Tuscan lettering. Our local New York Mets feature Tuscans in both their 'NY' monogram and the words 'NEW YORK' spelled out on their jerseys (or at least on the tie-in merchandise they license...) At least one of the 'Sox' teams uses a Tuscan as well, though I've forgotten which, and I'd hate to make a clay-footed blunder by guessing. (The only topic more contentious than font piracy is sports.)   \n   \nI'm collecting Tuscans for a project, so if you come across any others, I'd love to see them.\n\n"
    },
    {
      "time": "10 Apr 2002 — 11:08am",
      "content": "Tuscan's not the name of the typeface, it's the general species. \"Tuscan\" letterforms are those that have bifurcated (fishtail) serifs, and more often than not, some sort of ornamentation midway along the stems. For obvious reasons, the phototype crowd used to refer to this style as \"pineapple type.\"   \n   \nAdobe's got a couple of Tuscans in their various Wood Type collections. And if you look very carefully at the banner at www.typography.com, you'll see some Tuscans lurking in the background. Another project to come...   \n   \nI'd love to get that Rawlings catalog. Could I trouble you for some more information about it? (Name, date, etc.)\n\n"
    },
    {
      "time": "10 Apr 2002 — 1:07pm",
      "content": "Thanks on both accounts!\n\n"
    },
    {
      "time": "10 Apr 2002 — 1:25pm",
      "content": "By the way, if you're interested in Tuscans, check out Nicolete Gray's \"Nineteenth Century Ornamented Types and Title Pages,\" and Rob Roy Kelly's \"American Wood Type: 1828-1900.\" They're both annoyingly out of print, but a good library should have them. They're both chocked full of Tuscans.\n\n"
    },
    {
      "time": "10 Apr 2002 — 4:56pm",
      "content": "Animated Tuscan! Keep us posted.\n\n"
    },
    {
      "time": "11 Apr 2002 — 10:57am",
      "content": "Thanks. Now that one looks a little more familiar; Letraset's 'Quentin,' I believe? There's some fishiness (eh, 'Customization') afoot in a few of the letters, but I'm confident that's where it began.\n\n"
    },
    {
      "time": "21 May 2002 — 2:43pm",
      "content": "Hey -- check it out:   \n   \n [http://www.ortiz-lopez.com/OLP06.html](http://web.archive.org/web/20150311150619/http:/www.ortiz-lopez.com/OLP06.html)\n\n"
    },
    {
      "time": "26 Jun 2009 — 2:59pm",
      "content": "hrant,\n\nHow do I access the UCLA type libraries?\n\nThanks.\n\n-n\n\n"
    }
  ]
}
