{
  "id": "2346",
  "title": "PDF Magnification Limiting",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Is there a way of making a PDF viewable only at 100%?   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "Tue, 2003-12-09 16:22",
  "uid": "1250",
  "comments": [
    {
      "time": " Tue, 2003-12-09 22:04",
      "content": "Yeah, just zoom out till it's 100, type 100 in the box, use the pull down and click \"actual size\", etc.\n\n"
    },
    {
      "time": " Tue, 2003-12-09 23:19",
      "content": "No, I meant making a PDF that is always shown at 100% and the viewing user isn't allowed to change that.   \n   \nhhp\n\n"
    },
    {
      "time": " Wed, 2003-12-10 02:18",
      "content": "I think the short answer is no,   \nIf that's what you want, why not just supply a bitmap?\n\n"
    },
    {
      "time": " Wed, 2003-12-10 10:32",
      "content": "\\> why not just supply a bitmap?   \n   \nThe point is in fact to use a bitmap font (actually, a grayscale pixelfont) in PDF.   \nIt seems that supplying a raw bitmap is asking for viewing (and printing\\*) trouble.   \n   \n\\* Although printing a pixelfont is a last resort type of thing.   \n   \nhhp\n\n"
    },
    {
      "time": " Wed, 2003-12-10 11:36",
      "content": "Hrant,   \n   \nThere's a way round this, but not foolproof. You could set the 'open options' (file \\> document properties \\> open options) to make the file open at full screen mode, at 100%. Set the permission as viewing only. Then every time the file is opened it will display the way you intended. But of course the users can always get out of the full screen mode and do whatever they want with it... Putting navigation on the actual pages would help, I guess, making the PDF a self-contained 'application'.\n\n"
    },
    {
      "time": " Wed, 2003-12-10 16:20",
      "content": "Keith, not a bad approach.   \n   \nhhp\n\n"
    },
    {
      "time": " Wed, 2003-12-10 17:28",
      "content": "I think the best way would be to simply make it a greyscale bitmap at a specified resolution. Then any further zooming past a certain point would be ineffective.   \n   \nIf one was concerned about size of the PDF, it is technically possible to use a bitmap Type 3 font in PDF. Don't ask me how one would easily force this to happen, though!   \n   \nT   \nT\n\n"
    }
  ]
}
