{
  "id": "2348",
  "title": "TYPECON 2004",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "alrighty, who's going ![:-)](http://web.archive.org/web/20050516141540im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n [http://typecon2004.com/](http://web.archive.org/web/20050516141540/http:/typecon2004.com/)   \n   \nis Type High an echo of Aim High?\n\n",
  "author": "bjharvey",
  "time": "Tue, 2003-12-09 16:54",
  "uid": "1014",
  "comments": [
    {
      "time": " Tue, 2003-12-09 16:59",
      "content": "I had this idea: us SoCal-ers should hire a bus, decorate it with funky lettering\\*, and pick up any and all fontoholics on the way up north. Yeah, font hippies. I'll bring some \"refreshments\". I'll even drive if you guys get hammered enough not to realize the danger involved.   \n   \n\\* We can negotiate on any chirographic tendencies.   \n   \nAnd if there's enough bodies from south of the border, the bus could even start there (or maybe in San Diego). I know a fontman heavy in Tijuana.   \n   \nAs for them Salt Lakers, if they can somehow make their way down to Las Vegas or Bishop or something we could pick them up too.   \n   \nhhp\n\n"
    },
    {
      "time": " Tue, 2003-12-09 19:17",
      "content": "_I had this idea: us SoCal-ers should hire a bus, decorate it with funky lettering\\*, and pick up any and all fontoholics on the way up north..._   \n   \nHow very Scooby-Doo.   \n   \nI plan to be there.\n\n"
    },
    {
      "time": " Tue, 2003-12-09 20:18",
      "content": "I hope to make my conference debut. I'll be the guy in the helmet.\n\n"
    },
    {
      "time": " Tue, 2003-12-09 20:50",
      "content": "I'm planning on being there. I'll have poor shaving habits. Apparently I'm also a ['bad boy'](http://web.archive.org/web/20050516141540/http:/www.munchfonts.com/Misc/BkRts/smokers.JPG) (based on highly empirical surveys from TypeCon 2003).\n\n"
    },
    {
      "time": " Tue, 2003-12-09 21:11",
      "content": "he he. I just saw the link at typographi.ca so I thought   \nI'd post it.   \n   \nHigh on Type.   \n   \nThe bus ideer sounds fun if you're serious. ;)\n\n"
    },
    {
      "time": " Tue, 2003-12-09 21:12",
      "content": "Bouma-mobile.\n\n"
    },
    {
      "time": " Tue, 2003-12-09 21:18",
      "content": "Type is a gateway drug.   \n   \nBTW that is my typotee entry for next year, but only as long as you make a bouma-mobile shirt. :-)\n\n"
    },
    {
      "time": " Tue, 2003-12-09 21:34",
      "content": "If it sounds fun I'm serious.   \nJust hope we can saccade over all the CHP speed traps.   \nDid I tell you I plan on relying heavily on my parafovea? On-ramps, you know.   \n   \nhhp\n\n"
    },
    {
      "time": " Tue, 2003-12-09 22:21",
      "content": "\\> _Maybe Cheshire and I could just knock out the fence_   \n\\> _in between our houses and you all could camp out there._   \n   \nJoe and Chesh are neighbors? Well, I never...   \n   \nCrazy.   \n   \nI'll be there too. At TypeCon, that is. Not your backyard. Unless you're grilling something...\n\n"
    },
    {
      "time": " Wed, 2003-12-10 10:01",
      "content": "_I had this idea: us SoCal-ers should hire a bus, decorate it with funky lettering\\*, and pick up any and all fontoholics on the way up north. Yeah, font hippies. I'll bring some \"refreshments\". I'll even drive if you guys get hammered enough not to realize the danger involved._   \n   \nFont hippies, cool man, I can dig it.   \n   \n [http://www.lanstontype.com/Lunenburg-Foundry.html](http://web.archive.org/web/20050516141540/http:/www.lanstontype.com/Lunenburg-Foundry.html)\n\n"
    },
    {
      "time": " Wed, 2003-12-10 10:28",
      "content": "Hey, if you send one of your boats down the coast (or across the Arctic Sea), I'm game. I hear the Coast Guard is more lenient than the CHP.   \n   \nhhp\n\n"
    },
    {
      "time": " Wed, 2003-12-10 10:29",
      "content": "and also flying in for Spaced Out on the 21st\n\n"
    },
    {
      "time": " Thu, 2003-12-11 11:25",
      "content": "i love the name of the conference. if that doesn't bring up a bunch of jokes, i don't know what will.   \n   \ni'm working on a new and improved afro for this next conference. can't wait, it's going to be a blast!   \n   \nmaybe the bus should read: 'keep on kerning'\n\n"
    },
    {
      "time": " Thu, 2003-12-11 11:34",
      "content": "Then we need a theme song too: \"Prowwwwd Tamye keep on kerrrrning!\"   \n   \nhhp\n\n"
    },
    {
      "time": " Thu, 2003-12-11 12:03",
      "content": "\\>\\> maybe the bus should read: 'keep on kerning'   \n   \n   \nBouma Bus Bans Blackletter Banners, Bitmap Bauer Bodoni,   \nBroken Beziers & Bicycle-like Baskerville, BJ Barks.   \n   \nBrought to you by the letter B ... and lack of coffee ...   \nmust ... get ... some\n\n"
    },
    {
      "time": " Thu, 2003-12-11 12:08",
      "content": "\\>What? No \"Taking Tea Together\"?   \n   \nWell yeah, \"...and have some fun,\" as Robert Plant put it.   \n   \nI'll be there, if not stopped at the border.\n\n"
    },
    {
      "time": " Thu, 2003-12-11 19:42",
      "content": "_\\>maybe the bus should read: 'keep on kerning'_   \n   \n:-D   \n   \nI hope to be there as well!\n\n"
    },
    {
      "time": " Thu, 2003-12-11 21:38",
      "content": "\\> _maybe the bus should read: 'keep on kerning'_   \n   \nOr... \" Warning: This vehicle takes tight kerners.\"\n\n"
    },
    {
      "time": " Fri, 2003-12-12 00:03",
      "content": "\"I break for pilcrows.\"\n\n"
    },
    {
      "time": " Fri, 2003-12-12 11:45",
      "content": "\\>I break for pilcrows   \n   \nLOL!!!   \n   \nI hope to soon be able to get this bumper sticker as a veer premium (set in a shinn-o-font, of course, not boring old avenir)   \n   \n(however, must cofess that with the exception of Oneleigh, my pilcrows aren't actually that interesting).   \n   \nSegueway (before we prematurely exhaust TypeCon): what's your favorite pilcrow, people?\n\n"
    },
    {
      "time": " Fri, 2003-12-12 11:55",
      "content": "\\> what's your favorite pilcrow, people?   \n   \nThat's like the ultimate type-geek question! :-)   \n(And being a major type-geek, I'll have to seriously think about it...)   \n   \nhhp\n\n"
    },
    {
      "time": " Fri, 2003-12-12 11:55",
      "content": "Talking about TypeCon   \n   \nAnybody know when they will show the gallery at [http://www.typegallery.com/](http://web.archive.org/web/20050516141540/http:/www.typegallery.com/) from TypeCon 2003?   \nTIA\n\n"
    },
    {
      "time": " Fri, 2003-12-12 12:18",
      "content": "It's already there... See [here](http://web.archive.org/web/20050516141540/http:/www.typegallery.com/TG2003/visualindex.html).\n\n"
    },
    {
      "time": " Fri, 2003-12-12 12:27",
      "content": "I'll see you there. Those are some old stomping grounds.   \n   \nLast year was great!\n\n"
    },
    {
      "time": " Fri, 2003-12-12 14:27",
      "content": "Last year was my first and it was amazingly amazing. I won't miss it if I can help it.\n\n"
    },
    {
      "time": " Fri, 2003-12-12 14:44",
      "content": "Count on me for the Bouma-mobile, but, Hrant, please, no driving on parafoveal vision.   \n   \nSaludos.\n\n"
    },
    {
      "time": " Sat, 2003-12-13 09:36",
      "content": "Am thinking it would be nice ... I have never attended before.   \n   \nwest coast - wonder if I could get my company to pay?   \n   \nWhat is there for type lite weights like me? I have never designed my own face, but I love typography. What is a typical event like? What is the typical attendee demographic?\n\n"
    },
    {
      "time": " Sat, 2003-12-13 14:12",
      "content": "\\>What is a typical event like? What is the typical attendee demographic?   \n   \nGenerally, less formal or less \"industry\" oriented than AtypI. Definilty not a replacement for AtypI, but a good way to have a weekend of total type-geek immersion (I mean that in a good way). I have been trying to recall Peter Bain's exact phrasing when describing the various type conferences and organizations, but it was something to the effect of \"TypeCon is where the type hits the street\". There are at least as many type \"aficionados\" as type designers at these events. Without sounding too much like a sales pitch: if you love typography, you must go.   \n   \nI leave you with some [pics from last year](http://web.archive.org/web/20050516141540/http:/p22.com/photoalbum/typecon/typecon2003pics/index.html)\n\n"
    },
    {
      "time": " Sat, 2003-12-13 16:26",
      "content": "Thanks, Richard.   \n   \nI fall easily into the aficionado category. Pics look great.   \n   \nIf I can swing the event I am there!\n\n"
    },
    {
      "time": " Sat, 2003-12-13 19:18",
      "content": "Stephen, I don't think that's Ross. Ross doesn't wear blue jeans, especially not ones with frayed hems.   \n   \n   \nLast year was my first TypeCon, although Ross has been before. I had a great time: thoroughly enjoyed it. It makes a very nice complement to ATypI, and provides a good option for North American type nuts in the 3:4 years when ATypI is in Europe.\n\n"
    },
    {
      "time": " Sun, 2003-12-14 07:02",
      "content": "I floated the idea by my wife yesterday. She was all for it on the condition that I drop here in LA for the duration of the conference so she can visit with some friends.   \n   \nWe live in NY and she hates the climate here. So, any excuse to get out is a good one! Looks like maybe I can make this happen. How exciting. Well, for me, that is ...   \n   \n;)\n\n"
    },
    {
      "time": " Sun, 2003-12-14 07:25",
      "content": "From behind, and despite the disguise, the person about to be clubbed certainly has Ross-like qualities, so I would have made the same guess. However the profile in the mirror is distinctly un-Ross like. Perhaps you could post a full size cropped detail of the mirror so we can correctly identify the victim. It would be the right thing to do.   \n   \nCheers, Si\n\n"
    },
    {
      "time": " Tue, 2003-12-16 11:23",
      "content": "I've been kicking myself for missing ATypI, so I'll probably be there. Besides, it's a good excuse to visit friends in SF.\n\n"
    },
    {
      "time": " Wed, 2003-12-17 11:34",
      "content": "Well, that's probably the single best reason to miss it!   \n   \nhhp\n\n"
    },
    {
      "time": " Sun, 2004-01-04 19:19",
      "content": "Already used that reason two years ago :D\n\n"
    },
    {
      "time": " Sun, 2004-01-04 19:39",
      "content": "I remember the first time I met Luc[as] de Groot (ATypI '99), he had just arrived to the conference venue, and I sort of ran into him, and the first thing he said to me is \"Oh, hello. I just had a son.\"   \n   \nhhp\n\n"
    }
  ]
}
