{
  "id": "2356",
  "title": "Chank Army Jams out a New Garamond",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "20 August 2002   \n   \nCHANK ARMY JAMS OUT A NEW GARAMOND   \nCollaborative Free Font from Designers around the World   \n   \nFor the first official font release from ChankArmy.com, all 12 members of the Chank Army chipped in a few letters to create a new Garamond, now available for free at [www.chankarmy.com](http://web.archive.org/web/20131015021407/http:/www.chankarmy.com/). Martin Fredrikson of Sweden had the idea for the font jam. The font took months to create and became an exercise in self-discipline and collaboration.   \n   \n\"It forced people who make poster fonts to take a closer look at a traditional text face and recreate it as best they could with their technical abilities,\" explains Chank Diesel of [www.chank.com](http://www.chank.com), founder of the Chank Army. \"Some of us drew the letters on paper and scanned them in. Others recreated the characters entirely on the computer.\"   \n   \nThe Chank Army Garamond font is chock full of irregularities and quirkiness, but works surprisingly well at smaller sizes, giving the face a weathered-appearance. Letters that are particularly well crafted include David Cushman's Q with an extra fancy swash, David Buck's killer lowercase g, and precise lowercase vowels by Martin Fredrikson.   \n   \nAlthough it is a free font, the Chank Army encourages users who download it to make a donation to the Red Cross. \"With the European contingency and their anti-military beliefs, we tried to tone down the aggressive tones of the Army theme and balance that off by making this a donation-ware font,\" says Chank. There is a link to the Red Cross from the download page. The page was designed by Milan Zrnic of Florida.   \n   \nDiesel started the Chank Army in 1997 to give exposure and encouragement to talented up-and-coming font designers. This is the second Chank Army troop. It is represented by people from U.S., Canada, Sweden, Germany, Denmark, and New Zealand.   \n   \nThe Chank Army is:   \nDan Bailey - USA   \nBen Balvanz - USA   \nDavid Buck - New Zealand   \nStefan Claudius - Germany   \nDave Cushman -USA   \nChank Diesel - USA   \nJakob Fischer - Denmark   \nMartin Fredrikson -Sweden   \nJess Latham - USA   \nMichael Piercey - Canada   \nJason Ramirez -USA   \nMilan Zrnic -USA   \n   \nFor more information, visit www.chankarmy.com or call 1-877-GO-CHANK!   \n   \n-END-\n\n",
  "author": "elmack",
  "time": "20 Aug 2002 — 10:52am",
  "uid": "1168",
  "comments": [

  ]
}
