{
  "id": "236",
  "title": "\\*Ontosoft Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello everyone. I would appreciate any critique you have regarding the following logo.   \nThe background: [www.ontosoft.de](http://web.archive.org/web/20150417141135/http:/www.ontosoft.de/)   \nI did the site and the logo last year. The logo had to represent a lot of concepts for one sign, I believe. The stars are \"beginning\" and \"end\", the swooshes are \"ontology\" and \"software\". Finally this year, the guy is going global and I managed to persuade him, that the old logo is not really \\*that\\* nice, though it was my job to do it. :-/ The focus is IT and new technologies; the audience ranges from managers to state institutions to students; ages from 20 to 60; different nationalities, different cultures. We've already had a lot of variants discussed and tried out, but neither seems to work. He is still into swooshes, I am more into typo play. Here is what I have right now. The variant with O-matrix is just there to show you, what I've tried and what was already declined. I thank you for your constructive critisism.   \n ![](http://web.archive.org/web/20150417141135im_/http:/www.typophile.com/forums/messages/29/11168.gif)   \nAlso, before you start - the variant 1 was not presented yet. Variant 2 was presented yesterday and was marked as \"hmm... nice, I like it\", the variants 3 and 4 are just my personal favourites, though the client hates both of them.   \nI thank you.\n\n",
  "author": "popovich",
  "time": "26 May 2003 — 3:16am",
  "uid": "1788",
  "comments": [
    {
      "time": "26 May 2003 — 6:04am",
      "content": "Nice work, I like the fact that you tried several varying ideas. Personal favorite would be wordmark no. 4, but I'd like to see where it could go with color and maybe an accompanying symbol. The top right, no. 2, is ok but feels dated a bit and reminds me of an older airline logo, but I can't remember the name... this already is a bad thing ![:-)](http://web.archive.org/web/20150417141135im_/http:/www.typophile.com/forums/clipart/happy.gif) 3's Good, if it was for a design related product or service, because it's a definite thinker, but I think it might be too much for the average management member, and probably for some students. Good job though. Definitely liking 4 more and more.\n\n"
    },
    {
      "time": "26 May 2003 — 6:11am",
      "content": "Hmm, Nice, I like it..   \n   \nI am especially fond of the 3rd and 4th version..   \nReally nice work..\n\n"
    },
    {
      "time": "26 May 2003 — 6:36am",
      "content": "thanks a lot, guys. See, the client wants to be traditional, to look older, than he is, but also to have a strong identity. People even say, that they like the old logo (the one on the website), but I personally tend to hate it more and more. ![:-)](http://web.archive.org/web/20150417141135im_/http:/www.typophile.com/forums/clipart/happy.gif) Anyway. I've mailed him the following variants.   \n ![](http://web.archive.org/web/20150417141135im_/http:/www.typophile.com/forums/messages/29/11176.gif)   \nJust received his reply: 1a and 2b. Damn! I thought he will never take that wording for real... He likes the \"bolt\" theme as well... Which airline was that, again? ![:-)](http://web.archive.org/web/20150417141135im_/http:/www.typophile.com/forums/clipart/happy.gif))\n\n"
    },
    {
      "time": "26 May 2003 — 6:41am",
      "content": "2b is beautiful... just what I was imagining... WTG.\n\n"
    },
    {
      "time": "26 May 2003 — 6:55am",
      "content": "Thanks, Randy. And btw, WTG = way to go? ![:-)](http://web.archive.org/web/20150417141135im_/http:/www.typophile.com/forums/clipart/happy.gif))\n\n"
    },
    {
      "time": "27 May 2003 — 11:10pm",
      "content": "I think 2b is right on. And I was hoping you'd come up with an OS mark that was simple. And 2b is just that.   \n   \nSolid!\n\n"
    },
    {
      "time": "29 May 2003 — 2:51am",
      "content": "okay, this is what has become final and what will be the logo. the client is happy. me, somehow, too. ![:-)](http://web.archive.org/web/20150417141135im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n ![](http://web.archive.org/web/20150417141135im_/http:/www.typophile.com/forums/messages/29/11251.gif)   \nI can still make some fine-tuning, so if you think proportions and position of the symbol are bad - tell me now.\n\n"
    },
    {
      "time": "29 May 2003 — 8:20am",
      "content": "well, I think the 2nd to last was a bit more unique. But hey, what can you do.   \n   \nI think proportions are good. What type are you using for this? Also, looks like a different face down below, the T's look different?\n\n"
    },
    {
      "time": "29 May 2003 — 8:28am",
      "content": "It's Avenir. It's the same type on every variant I've posted here. Maybe just rendered a bit strangely. :-/   \nYeah, I did like the earlier variant more, but \"hey, what can you do\". exactly. I mean, I am struggling with this for, like, a month. Okay, not 8 hours a day every day, but still. I am fed up with trillion variants I had tried and billions the client has seen. Normally, I present between 3 and 5. At max. This time it was very different. ![:-)](http://web.archive.org/web/20150417141135im_/http:/www.typophile.com/forums/clipart/happy.gif)   \nYounger people (till 30) tend to like the earlier variant. Somewhat older people (30 to 40) tend to like this very variant.   \nProportions are still bothering me a bit. Maybe not really the proportions, but the alignment and/or distance between type and symbol...\n\n"
    },
    {
      "time": "29 May 2003 — 8:46am",
      "content": "I actually was going to say something about the distance between mark and symbol. Seems a bit wide, but the main criteria there is to just look at its scalability. And maybe, just maybe it;s a tad too big?\n\n"
    },
    {
      "time": "29 May 2003 — 9:07am",
      "content": "Thanks Peter. I'll play with it a bit more for sure.\n\n"
    },
    {
      "time": "30 May 2003 — 1:14pm",
      "content": "Love it. The only issue is that the Ts seem to have a slight flare on their lower hook. That may be just an onscreen thing, but that's where all of my focus ends up.   \n   \nI really think #3 had a lot going for it. Perhaps yet another example of better design not winning due to lack of sales ability. (That's not meant to be a knock towards anyone in here, I've just learned over time that it doesn't really matter how good your designs are if you don't have a good sales-guy/gal on staff to sell it to the client!)\n\n"
    },
    {
      "time": "7 Oct 2003 — 2:34pm",
      "content": "It's a really nice job!   \n   \nI agree with Peter Markatos about the distance between mark and symbol.   \nBut it's a minor detail, as I can see.   \n   \nelsebra\n\n"
    }
  ]
}
