{
  "id": "2366",
  "title": "Creating a logotype for aviation info site...",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello.   \n   \nI'm creating a Estonian avation information webpage called 'Tallie' (the title might change), which offers information about international civilian and mil aircraft, texts about history, info about local companies and so on.   \n   \nAnyway, at first I was thinking about a logotype with similar motive to Boeing's logotype, but when developing one I got another idea- a logotype that symbolises the middle window of a commercial aircraft, which has a view to the wing. Here is the first version of it.   \n   \nFeedback about comosition, typography and logotype is welcome.   \nI will probably post the more Boeing-like motive later.\n\n",
  "author": "magnus72",
  "time": "11 Dec 2003 — 10:57am",
  "uid": "2394",
  "comments": [
    {
      "time": "11 Dec 2003 — 11:29am",
      "content": "I'm sorry, I messed up when editing the post. Here is the picture file:   \n ![](http://web.archive.org/web/20131019234537im_/http:/www.typophile.com/forums/messages/29/22190.jpg)\n\n"
    },
    {
      "time": "11 Dec 2003 — 11:31am",
      "content": "I love the first version, here is a case where the gradient works.\n\n"
    },
    {
      "time": "11 Dec 2003 — 11:36am",
      "content": "Hmmm. my problem is that somehow on first sight it feels as if the wing-pictogram (which also reminds me a bit of a runway, which ain't a bad double-association, I think... but maybe you should make the wing graphically more recognizable) belongs to the typo, which makes me read Atallie or Ntallie.   \n   \nOther than that, perhaps a less overused typeface would be nice, just for fun's sake. Apart from that, the letters could do with a bit of manual kerning, especially t and a and the lli.   \n   \nThe window-idea is very very nice, almost too smart for an aviation company :-D.\n\n"
    },
    {
      "time": "11 Dec 2003 — 11:52am",
      "content": "Thanks for the nice feedback.   \n   \nActually I'm having double thoughts about this symbol, because it relates more to the commercial aircrafts than military ones, and that is not right because of the information database's content. Since I didn't make the \"wing\" that recognisable, it also works as a silhouette of rear wing. I don't know if this double meaning is good or not. Well, triple meaning, since it really works as runaway too!   \n   \nConcept definitely needs more work and luckily I have you guys ![:-)](http://web.archive.org/web/20131019234537im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "11 Dec 2003 — 1:15pm",
      "content": "Okay, I made some changes in the text part- kerned the letters manually and made the text smaller.   \n   \n ![](http://web.archive.org/web/20131019234537im_/http:/www.typophile.com/forums/messages/29/22194.jpg)\n\n"
    },
    {
      "time": "11 Dec 2003 — 1:37pm",
      "content": "I think that this is a really good concept, Magnus. Like Tiffany, I was also uncomfortable with the alignment. Would something like this work? This was done before you worked on the font weight. ![tallie logo test](http://web.archive.org/web/20131019234537im_/http:/www.typophile.com/forums/messages/29/22197.jpg)\n\n"
    },
    {
      "time": "11 Dec 2003 — 1:49pm",
      "content": "Very nice. The tail rules (better than a wing because you rarely see a wing's actual shape).   \n   \nBut the font isn't saying anything to me.   \n   \nBTW, I think one way am's alignment is better is that it doesn't read \"Ntallie\".   \n   \nhhp\n\n"
    },
    {
      "time": "11 Dec 2003 — 1:54pm",
      "content": "Going one weight down is difficult because I think there is no medium extended version of Swiss 721. But I will try out the regular extended version or make the text even smaller. Text's Blue will be lighter next time too.   \n   \nI like the horis. alignment because it makes it more easy to use the logo tight spaces (web banners for instance), although I need to bring the mark down a bit anyhow (I didn't notice the mark's hovering effect before). But am-s suggestion is also nice, I will try out that too.\n\n"
    },
    {
      "time": "11 Dec 2003 — 2:49pm",
      "content": "Here is a set with 3 versions.   \nIn my opinion the first one supports more the rear wing motif and others the wing window motif.   \n   \n ![](http://web.archive.org/web/20131019234537im_/http:/www.typophile.com/forums/messages/29/22207.jpg)\n\n"
    },
    {
      "time": "11 Dec 2003 — 4:31pm",
      "content": "5{t a great name...\"Magnus\", that is. I just got an identity job for a company using that title.   \n   \nThe first design reads as a runway because the \"t\" looks like it is traveling on it...that's just the way the positioning of the \"t\" in relation to the runway, I mean wing, I mean rear wing...I give up.   \n   \nI really like the concept of the window view of the wing, but I don't know that I would've seen it had you not included the description. Have you thought of any ways to make it more obvious? The most apparent visual seems to be the rear wing. At least that's what I'm seeing.   \n   \nI agree with Tiffany 100%. The type is relatively heavy. Find some method to balance the type and mark (color, mass, positioning, or some combination, or whatever).   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "11 Dec 2003 — 4:48pm",
      "content": "Darn ![:-)](http://web.archive.org/web/20131019234537im_/http:/www.typophile.com/forums/clipart/happy.gif) When creating the mark I really wanted to leave it as abstract as possible, but yes, in this case more \"explanation\" might be necessary. I will try to make the mark more obvious later.   \n   \nBut then again, from the imaginable POV in the logo, this can't be the seat of the pilot. But that doesn't fit the meaning of the information centre very well.   \n   \nWhat shall I do, what shall I do???   \n   \nMORE EDIT: Is it wrong if I leave the mark with indefinite meaning- just as a \"wing\"?\n\n"
    },
    {
      "time": "11 Dec 2003 — 5:39pm",
      "content": "On second thought, maybe I am all wrong. Perhaps you should push the abstract and make it less obviously any of the above. Make a mark that resembles all of the above, but isn't necessarily any of them.   \n   \n...and no, this isn't to taunt you.\n\n"
    },
    {
      "time": "11 Dec 2003 — 5:55pm",
      "content": "#2 from your recent post is really nice.   \nI think the mark has just the right level of: _oh i get it!_   \n   \nTwo thoughts:   \n1) Have you tried the gradient going light on bottom to dark on top (more like the actual sky, particularly at high altitude\n\n"
    },
    {
      "time": "11 Dec 2003 — 6:13pm",
      "content": "Randy, your suggestion about reversed gradient was great. It makes the mark look much more natural, but I think it requires a bit darker colours now. Judge for yourself.   \n   \n ![](http://web.archive.org/web/20131019234537im_/http:/www.typophile.com/forums/messages/29/22216.jpg)\n\n"
    },
    {
      "time": "11 Dec 2003 — 6:37pm",
      "content": "\\> I don't know that I would've seen [the window]   \n   \nI wasn't seeing it either. Which is fine if you want it to be so subtle.   \nBut if you do want to window to be more explicit, you could try arching the window frame, like the way it hugs the fuselage (the way you generally actually see it).   \n   \nhhp\n\n"
    },
    {
      "time": "11 Dec 2003 — 9:51pm",
      "content": "Randy's gradient suggestion helped the weight relativity between the type and mark. Much better!   \n   \nHrant's idea is worth exploring. It may open the window (no pun intended) to some alternative type also\n\n"
    },
    {
      "time": "12 Dec 2003 — 4:31am",
      "content": "Maybe also rounding the wing form especially at the tip along with the other suggestions (more space on the left side and curving the window) would make it more wing-like?\n\n"
    },
    {
      "time": "12 Dec 2003 — 4:37am",
      "content": "\\<font class=\"dontLookLikeCrap\"\\>I would modify the 't', 'a' and 'e' in the word.   \n   \nt: top part could be angled like the wing, only to the other direction   \n   \na+e: narrower   \n   \n---Jacques\\</font\\>\n\n"
    },
    {
      "time": "12 Dec 2003 — 5:13am",
      "content": "Hi, just any observation, I find the window in icon form too abstract. You need think for too long to recognise what's trying to portray. Wouldn't it be more effective to make the window and wing more realistic - moving clouds (blue sky) through the window? think Netscape icon - introduce some action - passing jet trail?   \nHow about placing window over name\\>   \n   \ncheers, charley\n\n"
    },
    {
      "time": "12 Dec 2003 — 5:13am",
      "content": "Hi, just any observation, I find the window in icon form too abstract. You need think for too long to recognise what's trying to portray. Wouldn't it be more effective to make the window and wing more realistic - moving clouds (blue sky) through the window? think Netscape icon - introduce some action - passing jet trail?   \nHow about placing window over name\\>   \n   \ncheers, charley\n\n"
    },
    {
      "time": "12 Dec 2003 — 6:10am",
      "content": "I disagree. Iconic forms that are learned or open to multiple interpretations (for example: I saw a tailfin first) are more likely to be remembered. A good graphic symbol should be as simple as possible without being so abstract that it has no meaning. I think this it still makes sense as is--adding clouds or vapour trails would just muddy it up.   \n   \nTo add more of a wing flavour, couldn't you perhaps add flaps or some other distinctive wing features?\n\n"
    },
    {
      "time": "12 Dec 2003 — 6:12am",
      "content": "d'oh! triplicate post! This must be like an IRS form or something!\n\n"
    },
    {
      "time": "12 Dec 2003 — 7:41am",
      "content": "I will post some mark studies later.   \n   \nI think I will skip the frame part and just make the silhouette more wing-like. This will probably weaken the window concept, but in that case it has meaning on two levels - a wing, or a wing seen through window - and not two separate meanings.   \n   \nThanks for the great feedback everybody. I really learn a lot in Typophile forums and I will definitely continue to bug you in the future too ![:-)](http://web.archive.org/web/20131019234537im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "12 Dec 2003 — 12:49pm",
      "content": "Magnus did you try flipping the mark horizontally so its the front of the plane and tallie is like the rest of the fusulage. Sort of flying to the left\n\n"
    },
    {
      "time": "13 Dec 2003 — 12:56pm",
      "content": "Daniel, here is the flipped version. I didn't change anything else yet.   \n   \nDo you people think that I would be making a mistake when I leave the mark's meaning open and don't add any details? I know what I said about the concept in the beginning, but now I'm thinking that if the mark is more general, then it suits the project much more. In its current state a pilot might see the mark as a tail fin or runway and a passanger might recognise the view to the wing.   \n   \n ![](http://web.archive.org/web/20131019234537im_/http:/www.typophile.com/forums/messages/29/22333.jpg)\n\n"
    },
    {
      "time": "13 Dec 2003 — 2:31pm",
      "content": "Magnus I like the mark flipped. It no longer looks like a letter form. Take a look at lining up the baselines now but keep the space from the mark to the title the same.\n\n"
    },
    {
      "time": "13 Dec 2003 — 4:55pm",
      "content": "Here are a few quick mark and alignment tests I did. Lining the mark's baselines caused the wing to narrow quite a lot, so different shape might be necessary.   \n   \n ![](http://web.archive.org/web/20131019234537im_/http:/www.typophile.com/forums/messages/29/22340.jpg)\n\n"
    },
    {
      "time": "14 Dec 2003 — 7:20am",
      "content": "I'm kind of partial to a3. Also look at putting the gradient through the type too.\n\n"
    },
    {
      "time": "14 Dec 2003 — 7:24am",
      "content": "a1 looks best so far, the piktogramm is much better than the b-version. More abstract, yet at the same time more readable. a43 looks a bit too crammed together for me...\n\n"
    },
    {
      "time": "11 Dec 2003 — 12:00pm",
      "content": "This is nice. I alway like to sit next to the wing when I fly, and look out the window in amazement that we are actually flying. But I love to travel.   \n   \nI would say if your rounded the ends of the wing a bit, it might be a little more \"wing-like\". Also, the type seems too big for this size of a mark. It might also be too bold.\n\n"
    },
    {
      "time": "11 Dec 2003 — 1:19pm",
      "content": "The type is still visually too bit. I think the reason is (1) the type is darker than the mark, (2) the thinnest space in mark is thinner than the type. Yes, that is a matter of opinion, but I think you will find that going one weight down will help. I might also consider aligment. Should it be a the \"visual\" bottom of the mark? Or, should it line up with the \"actual\" bottom of the mark?\n\n"
    },
    {
      "time": "11 Dec 2003 — 2:53pm",
      "content": "the first one is too tricky, and there isnt' enoug deliniation between mark and type. The second one is nice because now you have created a sort of automatic hierarchy. The thrid one the type, and I'll admit it might be me, is still too big for that placement.\n\n"
    }
  ]
}
