{
  "id": "237",
  "title": "ModernUsual PE",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "hello everyone..   \ni'm not sure in originality of this one, but anyway this type was born during creating of other (sans serif) type.. so here it is - ModernUsual Pixel Edit.. any comments?   \n   \n ![preview](http://web.archive.org/web/20150414190444im_/http:/www.typophile.com/forums/messages/29/11172.gif)\n\n",
  "author": "taran80",
  "time": "26 May 2003 — 4:41am",
  "uid": "1846",
  "comments": [
    {
      "time": "26 May 2003 — 2:00pm",
      "content": "i think there are one or two pixel faces that are quite similar to this. I like it at 12pt because there are some wonderful characters, especially the 'E'. However, at 6pt, B, E, G, and Q all look too similar, I reckon that would destroy legibility.\n\n"
    },
    {
      "time": "14 Jul 2003 — 2:51am",
      "content": "Hi Dmitry,   \n   \nI like it. Ok, it looks like something I saw before but still it has something of its own.   \nI like the feeling of an italic that is not an italic. Maybe you should use that a little more. If I look for the S and Z, they are for me to much upright. Perhaps they should also lean a little to the right like het A, B, E, F, P, R, etc.   \n   \nI can immagine how hard it must be to make something original. Seeing the fact that it are pixels. You have only so much of them.   \n   \nKeep it up.   \n   \nRen\n\n"
    },
    {
      "time": "16 Jul 2003 — 12:41am",
      "content": "I like where you're going, but it feels like you're trying to fit things to rigidly to a formula.   \n   \nIn your nickname (taran80), I read the 8 as a B (taranb0). 8, B, and Q all look like Bs to me.   \n   \nI think you should pull in the sides on the 8 (eliminate 1 pixel on each side of the crossbar you have now). Try a vertical tail on the Q. At 6 px, you're going to have to occasionally compromise the pureness of your design in favor of legibility.\n\n"
    },
    {
      "time": "24 Jul 2003 — 2:43am",
      "content": "hello everyone! thanks for reaktion..   \nhere is a nu edition.. and it looks weird for me 8)   \nother edition soon.. thank again..   \n   \n ![preview](http://web.archive.org/web/20150414190444im_/http:/www.typophile.com/forums/messages/29/13264.gif)\n\n"
    },
    {
      "time": "24 Jul 2003 — 3:37am",
      "content": "Hi Dmitry,   \n   \nThat's it (for me). Now more comment. Good job.   \n   \nRen\n\n"
    },
    {
      "time": "28 Jul 2003 — 1:44am",
      "content": "but i think i'd loose somethin' in last edition\n\n"
    }
  ]
}
