{
  "id": "2387",
  "title": "Sensodyne",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Just noticed this as my tube ran out and the next one started.   \n   \nBefore   \n ![Sensodyne before](http://web.archive.org/web/20131018222124im_/http:/www.typophile.com/forums/messages/4100/22304.jpg)   \n   \nAfter   \n ![Sensodyne after](http://web.archive.org/web/20131018222124im_/http:/www.typophile.com/forums/messages/4100/22305.jpg)   \n   \nSo that's a typographical shift and the new version seems to have some slight 3D puffiness too.\n\n",
  "author": "Jon Whipple",
  "time": "12 Dec 2003 — 9:38pm",
  "uid": "2332",
  "comments": [
    {
      "time": "12 Dec 2003 — 9:45pm",
      "content": "They're appealing to your feminine side.   \nBut the multiple italic slants suck paste.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Dec 2003 — 5:14am",
      "content": "Oooooo. 3D makes _everything_ look cooler.\n\n"
    },
    {
      "time": "16 Dec 2003 — 7:37am",
      "content": "With this and the new UPS logo, Paul Rand must be rolling over in his grave.\n\n"
    },
    {
      "time": "6 Jan 2004 — 1:54pm",
      "content": "Well, the puffy text \\*does\\* correspond to the puffiiness of irritated gums. ;)\n\n"
    },
    {
      "time": "7 Jan 2004 — 3:51pm",
      "content": "well, at least they aligned the 'D' and the 'n'.   \n   \n;)\n\n"
    },
    {
      "time": "7 Jan 2004 — 4:08pm",
      "content": "The irony is I could care less what the product looked like, it works.\n\n"
    },
    {
      "time": "10 Jan 2004 — 10:44am",
      "content": "yet another gradient filled corp logo. someone should steal the computers away from the in-housers.\n\n"
    },
    {
      "time": "11 Jan 2004 — 5:26am",
      "content": "Tanya, with the release of the new Illustrator 11 look for cheesy 3D effects to add to the gradients.\n\n"
    },
    {
      "time": "11 Jan 2004 — 9:16pm",
      "content": "_someone should steal the computers away from the in-housers._   \n   \nTanya: perhaps **skill** has something to do with it. I doubt that you're impressed by all the stuff that [these guys](http://web.archive.org/web/20131018222124/http:/www.landor.com/) do (who aren't in-housers).   \n   \nWhile I appreciate the sentiment that some people have no respect or sensibility, I don't think that the test is whether you work inside the place or outside of it. Some of us struggle daily trying to make the best of a bad thing left behind by people who weren't in house. And I am positive the opposite is the case as well.   \n   \nI am not impressed by this revision, in-house or not. Although I have no idea who did it, or what the design brief was (assuming there was one), I don't like the result. The puffy letters look like a certain [cereal](http://web.archive.org/web/20131018222124/http:/www.cheerios.com/about/honeynut.asp), and kind of have a non-identifiable and indistinct harmless feel. At least the type in the original felt somehow reassuringly technical or clinically effective (It appears to be Avant Garde...anyone?).   \n   \nI question whether making something kind of mundane and me-too is what you really want do do when competing in the personal care market.   \n   \nJon\n\n"
    },
    {
      "time": "13 Jan 2004 — 2:58am",
      "content": "I'd have to agree with Jon. Being Inhouse or an outside agency designer has nothing to do with the final design. Having been both I find all too often that the end result is based on the whims of a committee of bad taste with no knowledge of design much less typography.\\<br\\>\\<br\\>   \nThe best designer in the world could be hamstrung by an inept marketing department unwilling to relinquish the least bit of control to the those more qualified.\n\n"
    },
    {
      "time": "13 Jan 2004 — 3:20am",
      "content": "Man, what is UP with Landor... do they have a copyright on gradients or what?   \n   \n   \nAnd Daniel is right... even as a freelancer your work is messed up by stubborn customers and awful design-by-committee processes. At least as a free designer you can walk away from such jobs, if your financial status allows for it.   \n   \nAt least they visually stressed the BAKING SODA CLEAN, which is one of the most absurd poieces of advertisement. It was less conspicious before, but now this new package basically communicates the idea of smearing a paste of sodium bicarbonate on your teeth... which makes me imagine a pulvery, smeary, badtasting dry, awful substance... not what I'd like a customer to associate with my product at ALL... ugh :-).\n\n"
    },
    {
      "time": "13 Jan 2004 — 9:22am",
      "content": "\\<font class=\"dontLookLikeCrap\"\\>Jon, my remark was a big generalization, but from my point of view its often true.   \n   \nThe new breed designer that gets hired in-house for minimum wage is given a computer for \"tools\" and a copy of photoshop for dummies. Often enough they get reshuffled from the communications dept once some manager discovers that John Doe created that smashing powerpoint with rotating globes. I've met plenty of them who now carry the title \"graphic designer\" on their biz card.   \n   \nHowever there are a few in-house designers, such as yourself I'm sure that do have the education to back the position.   \n   \nOne has to admit that their numbers are dwindling in favor of those candidates who meet job requirements which include 30 different software programs for 20K a year.   \n   \nThe corporation is lucky that you can fix things nicely but sadly uneducated about your job and design in general if they are hiring these outside agencies responsible for gradient crap.   \n   \nIn all, Its just hard to beleive that any respectable design firm would allow gradient tricks and plug-ins out the door to any client, committee or not. And who does that leave? students, beginners, and the cost-saving in-housers. I'm not trying to be elitist believe me, just pragmatic.   \n   \nOn the other hand, I'm starting to think that these larger design firms are hiring the same dime a dozen. Or perhaps there's some new school of thought that justifies gradients that no one knows about?   \n   \nSee its just very scary to see! If more and more large co.'s are getting 3-D'ed then its gonna be very hard to explain to our next clients why its bad and why these large co.'s are doing it wrong.   \n-t   \n\\</font\\>\n\n"
    },
    {
      "time": "13 Jan 2004 — 8:46pm",
      "content": "Tanya, I agree largely with what you say. Especially about the the smashing powerpoint. I have also just seen a job posting for a graphic designer for my city government cleverly disguised a clerical opening for a rate significantly smaller than what they pay me and requiring more technical knowledge in print and online work than I have with 7 years of experience.   \n   \nI DO undertand what you are witnessing. I just don't think that the inside/outside dichotomy is really the thing.   \n   \n_Or perhaps there's some new school of thought that justifies gradients that no one knows about?_    \n   \n\\<speculation\\> Maybe a confluence of production technology with inadequate designers? I wonder if better techniques in printing, painting whatever, make things like gradients more doable and more tempting?\\</speculation\\>   \n   \n_I'm not trying to be elitist believe me, just pragmatic._   \n   \nI wonder if it's not more pragmatic to think that **any operation** (inside or outside) will hire cheaper if they know they can sell the work.   \n   \nI don't think you're being elitist. I just think that the inside/outside dichotomy is false.   \n   \n_hard to explain to our next clients why its bad and why these large co.'s are doing it wrong._   \n   \nI know this is hard for those who really care about visual communication. But at least you know you're right and why so you can say it.   \n   \nJon\n\n"
    },
    {
      "time": "22 Jan 2004 — 10:18pm",
      "content": "I don't get it. Why is the \"O\" different? I don't get the point, but hey, maybe I'm an old grumpy designer who got left behind... anyone?\n\n"
    },
    {
      "time": "28 Jan 2004 — 10:43am",
      "content": "Marius, after you mentioned this I keep coming back to it and looking at it and I can't take my eyes off that 'o'. Now it's making me crazy...Maybe THAT was the plan.   \n   \n\\<imagine\\>_\"...and the resized \"O\" implies the targeting of the customer's pain. The size difference is enough to have mental impact, but not enough to be noticed by the general public. The subconcious manipulation here shown will yield millions for stakeholders, shareholders and the comany's directorate...\"_\\</imagine\\>   \n   \n\\<imagine\\>_...when I was drawing the logo I noticed that the o actually dipped below the bottom line of the other letters like the n, so I changed it to match..._\\</imagine\\>   \n   \nWow, this cold medicine is pretty fun...   \n   \nJon\n\n"
    },
    {
      "time": "28 Jan 2004 — 5:10pm",
      "content": "Tiffany:   \n   \nSorry, I was actually being 'sarcastic'. Which can sometimes be hard to comunicate in this medium.   \n   \nHildebrant.\n\n"
    },
    {
      "time": "8 Jan 2004 — 8:42am",
      "content": "I don't think they should have aligned the D and the n -- it causes problems with the visual hierarchy. The eye follows the n down instead of reading the rest of the word. They should have focused on even spacing on the line in which \"Daily Care\" falls. It look heavy and poorly balanced. Too many people focus on the seemingly obvious alignments when there are far more important alignments to be watched. Kyle, I'm not picking on you, I'm just remembering some past things of which you reminded me.   \n   \nJust my two cents. It is a little late to critique, but you guys seems to have so much fun critiquing work that is finished. ![:-)](http://web.archive.org/web/20131018222124im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    }
  ]
}
