{
  "id": "2388",
  "title": "Kilbirnie Sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "So I have Graduated. Yay. But on the up side, Mr. Yan   \n   \n [http://www.jyanet.com/fonts/index.html](http://web.archive.org/web/20131012091616/http:/www.jyanet.com/fonts/index.html)   \n   \nwill, at some stage in the future, license my typefaces   \non his site. This is one of them. It will have a companion   \nserif, which is almost ready for it's first posting. I have   \na friend who is the designer for a national teen   \nmagazine (printed on newsprint) that is very keen to   \nuse this for body, which would replace Meta Plus   \nNormal. So it has to be a decent bloody effort on my   \npart. So here is Kilbirnie Sans, all feedback is much   \nappreciated.\n\n<!--attachment: Kilbirnie_test_01-22309.pdf*mime_pdf.gif*application/pdf*12.2*Kilbirnie+Sans*Kilbirnie_test_01%2epdf --><!--attachment: Kilbirnie_test_01-22309.pdf*mime_pdf.gif*application/pdf*12.2*Kilbirnie+Sans*Kilbirnie_test_01%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012091616im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Kilbirnie Sans<br><a href=\"http://web.archive.org/web/20131012091616/http:/www.typophile.com/forums/messages/29/Kilbirnie_test_01-22309.pdf\" target=\"_blank\"><b>Kilbirnie_test_01.pdf</b></a> (12.2 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "kris",
  "time": "12 Dec 2003 — 10:26pm",
  "uid": "1519",
  "comments": [
    {
      "time": "13 Dec 2003 — 9:16am",
      "content": "Very interesting. At first glance, it seemed like an upright version of Gill Sans' Italics!   \nAll in all, very good work, although I'm curious about how effective are the round serifs in the \"p\", \"d\".\n\n"
    },
    {
      "time": "14 Dec 2003 — 5:57pm",
      "content": "Pretty nice.   \nI think the few unorthodox letterform features (like that \"d\", which happens to be my favorite form) don't push it over the egde of being a usable \"text sans\" (although I actually have a problem with that term). Three things:   \n1) It's a bit small on the body. I'd make the descenders shorter.   \n2) It's a bit too light to hold together under the necessary tight spacing.   \n3) The caps look a hair too dark for the lc.   \n   \nCan we see a character set?   \n   \n--   \n   \nBTW, will the serif version be a slab?   \nI would consider making it only nominally congruent with the italic, instead of making the two a \"separated at birth\" deal - like maybe give it some gentle stroke contrast, and make the serifs blunt wedges. That will make it more texty than a monoline slab (see Adobe Chaparral), and make for a refreshing pairing strategy.   \n   \nhhp\n\n"
    },
    {
      "time": "14 Dec 2003 — 6:52pm",
      "content": "By no means an expert opinion:   \n   \n-I find the vertical placement of \"o\" a little high.   \n-the serif on \"d\" seems to push out the next character.   \n   \nLooks really good though, and I like the serifs on the \"p\" and \"d\".\n\n"
    },
    {
      "time": "15 Dec 2003 — 12:43am",
      "content": "The serif is a subtle wedge, and there is a definate stroke contrast. I have also made a \"stemless\" version, with stroke contrast, inspired by FF Dax. There will also be a monospaced. Crumbs, I have a lot of work. Thanks for the feedback. The descenders do need shortening, I have shortened them on the stemless, and they look right. The serif on the \"d\" is a bit of trouble, but I will work on it. As for the lightness, I haven't yet been able to print it out yet! I have only been loooking at the screen, which is a bit naughty. I am thinking of getting an Epson EPL-5900L Monochrome Laser Printer, because it is a reasonable pprice and prints true 1200 dpi.   \n   \nwill post soon. kris.\n\n"
    },
    {
      "time": "15 Dec 2003 — 2:31am",
      "content": "Elegant, and good ideas. I agree that it is better to keep the serif on the d, and solve it, if possible. Now it pulls the eye along, but then 'catches' it and slows you down. Would smaller do it? The counters of your b and d seem to be not quite matching, though I may be wrong about this.   \n   \nSomehow I have the feeling that this needs a little more coherence, but I'm not sure what needs to be done. One possibility is to have one more letter with an unusual treatment that pulls the eye horizontally, like your r and d.   \n   \nHave you studied Goudy Sans, which evidently was also an inspiration for Meta? Your face is definitely reminiscent of it. It was really innovative, and is quite interesting, though maybe too quirky.\n\n"
    },
    {
      "time": "15 Dec 2003 — 6:41am",
      "content": "Nice.   \nIt reminds me of Majoor's Scala (just a little), and Piccinini's [Ottomat](http://web.archive.org/web/20131012091616/http:/www.myfonts.com/fonts/emigre/ottomat/), of course (see that 'd').   \nQuick comment: in characters like h, m, n and u, the spots where the curves meet the vertical strokes look a bit too dark.\n\n"
    },
    {
      "time": "19 Dec 2003 — 3:20am",
      "content": "Thanks for the comments. The caps were too dark, because I had pretty much slapped them up to fill space. Now they are (hopefully) a bit more in line with the rest. Changes:   \n   \nr - got rid of the old one and made this one.   \ny - straightened up the tail   \np - vertical cut on the 'serif'   \nd- thinned out the 'serif'   \n   \nh,m,n,u,b,p, - thinned out the joins.   \n   \ng,j,p,q,y - shortened descenders.   \n   \nI should now work on the kerning, which I'm thinking of trashing and starting afresh. Or maybe it's just too late at the mo... Thank for the feedback!\n\n<!--attachment: Kilbirnie_test_02-22695.pdf*mime_pdf.gif*application/pdf*13.2 **Kilbirnie_test_02%2epdf --><!--attachment: Kilbirnie_test_02-22695.pdf*mime_pdf.gif*application/pdf*13.2** Kilbirnie_test_02%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012091616im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131012091616/http:/www.typophile.com/forums/messages/29/Kilbirnie_test_02-22695.pdf\" target=\"_blank\"><b>Kilbirnie_test_02.pdf</b></a> (13.2 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "19 Dec 2003 — 6:53am",
      "content": "Thinning the joins helped.   \n   \nI can see why you abandoned the bent stem r, as it wasn't consistent with the m and n. But I think it would be good to add the horizontal emphasis of your p and d to more round letters. The reason is that there are a number of very good humanist sans out there, and yours needs to have a different look to be useful.   \n   \n [Prokyon](http://web.archive.org/web/20131012091616/http:/www.dutchtypelibrary.nl/ProkyonRegular.html) has a one story g with a top 'tail' to the right. It might work well with your face. You might experiment also with the b and the q. Another horizontal touch you could experiment with is extending the bar of the e slightly to the right, beyond the connecting curved stroke, like Jenson does - either with the straight or a slant bar.   \n   \nI don't know what of this stuff can work in extending your concept, and what will be 'too much'. But I think it is worth experimenting to get a more distinctive look. I think at least one more lower case letter needs something distinctive.   \n   \nOn the d, the tail is better, but still a little distracting to me. Would it help to be a little shorter, with a vertical cut, like the new p?   \n   \nIn any case, very impressive work.\n\n"
    },
    {
      "time": "13 Jan 2004 — 3:41pm",
      "content": "Here is a pdf of Kilbirnie Sans and Kelburn. (note, on the pdf Kilbirnie NoStem is now Kelburn, NoStem was just a working name)   \n   \nThere is lower case italics for both, very rude at the moment but pretty good for a day's work. I haven't actually made any italics before, so be brutal. The spacing of the italics are very sloppy, so any hints would be much appreciated.   \n   \nI am not too sure what is new with K-Sans, but I am pretty sure there have been improvements. I just talked to my man at the teen mag today (for whom the type is for) and he wants to go with Kilbirnie Sans, not Kelburn.   \n   \nThanks for the feedback,   \n   \nkris.\n\n<!--attachment: K_Sans_KNS_9-13-24092.pdf*mime_pdf.gif*application/pdf*58.1 **K%2eSans%26%2343%3bKNS%2e9%2d13%2epdf --><!--attachment: K_Sans_KNS_9-13-24092.pdf*mime_pdf.gif*application/pdf*58.1** K%2eSans%26%2343%3bKNS%2e9%2d13%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012091616im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131012091616/http:/www.typophile.com/forums/messages/29/K_Sans_KNS_9-13-24092.pdf\" target=\"_blank\"><b>K.Sans+KNS.9-13.pdf</b></a> (58.1 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "13 Jan 2004 — 6:08pm",
      "content": "I'm not sure if your stemless version is that different from Dax and its variants. Recently there was [this](http://web.archive.org/web/20131012091616/http:/www.typophile.com/forums/messages/4100/22440.html) thread in which the wizards at the type ID board gave a big variety of variations. You might want to look at these before you go ahead.   \n   \nYour 'stemmed' version has become still more original, but my feeling is that it needs more work to sort of become itself. The strokes sweeping to the right actually work naturally in the italic, but are a little awkward in the Roman. It think it is because we are used to seeing that kind of 'swashiness' with italic.   \n   \nThere are several wonderful faces that adapt italic features to the roman, and I would suggest that you look at these to see whether you can get some ideas about changing the shape of your round letter parts to make the swashes more natural and elegant.   \n   \nOne of these is [Sauna](http://web.archive.org/web/20131012091616/http:/www.underware.nl/site2/index.php3?id1=sauna&id2=overview) and another is Sansa at [www.ourtype.com](http://web.archive.org/web/20131012091616/http:/www.ourtype.com/). Yet another is Aspect at [www.typography.net/](http://web.archive.org/web/20131012091616/http:/www.typography.net/)  \n   \nIn all of these cases they made the oval letters, o b d e p d c q, quite assymetrical, and they all are quite fascinating, to me any way.   \n   \nIt may be that you can pull off the right-sweeping strokes with a more geometrical round shapes, but I'm wondering whether taking this recent direction in type would serve your design. Also I know from your fabulous Art Deco design you showed here that you have the gift for elegant lines that could bring this off.\n\n"
    },
    {
      "time": "13 Jan 2004 — 6:54pm",
      "content": "\\>\\>There are several wonderful faces that adapt italic features to the roman,   \n   \nReally? Could you please give some indication, some names would be really helpful. I realise that Kelburn is quite similar, in form and concept to Dax. It is the concept of \"stemless sans-serifs\" that fascinates me, the earliest ones (to my knowledge) are Bernhard Gothic, 1930 and Chambord by Roger Excoffon in 1951. Kelburn is, for me, a first step towards resolving the concept of a \"stemless\" type. I have a few ideas about how to resolve it, and am not really comfortable with it's current form.   \n   \nI am not mad about Sansa, it is a bit funny. I have had the speciman for a couple of weeks now, but can't really see the good in it. I actually fell in love with Aspect, but only for what it does in display. (I was at the NZ design awards when it picked up loads of awards for the company that comissioned it, and Mr. Tankard barely got a mention! I was quite annoyed) I have just downloaded the Sauna pdf, quite interesting. A bit round and happy, though, for my taste in text. Thanks for the feedback!\n\n"
    },
    {
      "time": "13 Jan 2004 — 7:46pm",
      "content": "Ok, maybe Sansa is a little too mannered for text. But very interesting shapes. I don't much like any sans for extended text, so I think of sans more for display - ads, titles, etc.\n\n"
    },
    {
      "time": "13 Jan 2004 — 9:05pm",
      "content": "I reckon this is a good way to go. The top is the old kilbirnie, the bottom is the new. There is more stroke modulation, and it is slightly narrower - remembering that it has to be used to replace Meta. Is it starting to be more of itself?   \n   \nKris   \n   \n   \n ![](http://web.archive.org/web/20131012091616im_/http:/www.typophile.com/forums/messages/29/24123.jpg)\n\n"
    },
    {
      "time": "13 Jan 2004 — 10:11pm",
      "content": "The new g and j are nice\n\n"
    },
    {
      "time": "13 Jan 2004 — 10:12pm",
      "content": "Like William, I like the stemmed one - the \"nostem\" version is saying nothing to me, and its italic isn't different enough from the Roman - I might just abandon that angle entirely.   \n   \nOn the other hand, the stemmed version is reminding me somewhat strongly of DTL Prokyon (which is good in a way), but maybe I'm not remembering Prokyon well enough. The [stemmed] italic is really nice.   \n   \nCould we see some character sets?   \n   \nAs for the revision immediately above - I think it's losing more than its gaining. It seems less disciplined and honest.   \n   \n\\> Chambord by Roger Excoffon   \n   \nNote that this was a direct rip-off from Cassandre's genial (in intent if not execution) Peignot design.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Jan 2004 — 10:47pm",
      "content": "\\>\\>As for the revision immediately above - I think it's losing more than its gaining. It seems less disciplined and honest.   \n   \nInteresting. Less disciplined & honest - wouldn't this be more appropriate for a teen mag? : )   \n   \nkris\n\n"
    },
    {
      "time": "13 Jan 2004 — 10:50pm",
      "content": "Actually, how many other people think it is regressing rather than progressing?   \n   \nkris\n\n"
    },
    {
      "time": "13 Jan 2004 — 11:19pm",
      "content": "\\> Less disciplined & honest   \n   \nWell, I think teens tend to be more honest than adults (or maybe that's just because I'm from the Old Country :-), but you do have a point about the \"discipline\" aspect. Dunno. The stroke contrast for one thing doesn't seem to fit - I guess it's clashing with the stems. But I'm a lousy teen, so... :-)   \n   \nhhp\n\n"
    },
    {
      "time": "14 Jan 2004 — 5:09am",
      "content": "Stroke modulation aside, I thought I'd mention the improvment in the **a** with your latest version. Structurally you have put more emphasis on the bottom of the bowl, less on the top. It helps to counter the tail. Look at the d for comparrison. Looks like a rocking horse ready to spring to the left. Try that move in all the tailed glyphs.   \n   \nI don't think adding a hair more modulation is bad in principle. It will give you a bit more sparkle. There are some problem spots in the version above. For example the k. The leg wants it's original thickness, the arm thinned. In the h,n your transition from thick to thin seems a bit abrupt. Keep a hair more thickness in the transition otherwise you head down the road of two sticks connected with dental floss :-) I do prefer the original form of the g. Much of that is personal taste speaking as I like a strong horzontal move at the baseline. But, the tail is also a little wobbly.   \n   \nAs far as the overall design. I don't have any experience working with Dax. Somehow it has managed to avoid my radar. My impression though, is that if you want this to be a best seller you'll have to add more than a bit of stroke contrast. I know that doesn't help you when you're this far in :-) What about adding alot of stroke contrast? What about flairing (a stemless optima)? What about a stemless semiserif (you never know)? A stemless slab serif? Or you could take a different form entirely and make it stemless. A stemless didone? That could be pretty.   \n   \nOr you could continue with what you've got. In the end you'll have a competent alternative. The print looks lovely. Spacing a hair tight. Italics are fine. There is no rule that says italics have to scream for attention. They don't have to be narrower. They don't have to be lighter. Your's looks fine with subtle amounts of both.   \n   \nCheers,   \nRandy\n\n"
    },
    {
      "time": "14 Jan 2004 — 10:51am",
      "content": "I also think the new g is terrific. I agree with Randy's astute analysis - the a is definitely better, the d still needs work. I think your continuing to play with the shapes of the round letters to make the tails work is the way to go. Keep up the good work!\n\n"
    },
    {
      "time": "14 Jan 2004 — 3:15pm",
      "content": "Kelburn: On a side note, I remembered that I had done this (saved under an obscure name) in regards to extreme stroke modulation. I had also though of flaring it like Optima (we seem to think alike, Mr. Jones : )   \n   \n   \n   \nKilbirnie: I don't think that a bit more stroke modulation hurt that much either. It also seems to make condensing the glyphs a little easier and less noticeable. The 'g' has been modified slightly, and I agree entirely about the 'a' being better and the rocking horse 'd'. I knew that balancing these would be tricky right from the start!   \n   \nthanks, kris.\n\n"
    },
    {
      "time": "14 Jan 2004 — 3:17pm",
      "content": "Kelburn: On a side note, I remembered that I had done this (saved under an obscure name) in regards to extreme stroke modulation. I had also though of flaring it like Optima (we seem to think alike, Mr. Jones : )   \n   \n   \n ![](http://web.archive.org/web/20131012091616im_/http:/www.typophile.com/forums/messages/29/24181.jpg)   \n   \n   \n   \nKilbirnie: I don't think that a bit more stroke modulation hurt that much either. It also seems to make condensing the glyphs a little easier and less noticeable. The 'g' has been modified slightly, and I agree entirely about the 'a' being better and the rocking horse 'd'. I knew that balancing these would be tricky right from the start!   \n   \nthanks, kris.\n\n"
    },
    {
      "time": "14 Jan 2004 — 8:43pm",
      "content": "I don't know what happens to your Jan 14 3:17 post when the letters are small, but big it is clearly a different look from Dax, which your earlier version really wasn't. It also looks wonderful, large anyway. It also has a rhythm that the stemmed and 'tailed' version hasn't yet achieved.\n\n"
    },
    {
      "time": "15 Jan 2004 — 7:27am",
      "content": "If you did this kind of more extreme modulation on the stemmed and 'tailed' version, the tails would have less weight, which might work better.   \n   \nI guess the thing to do is to think through what you want to accomplish with the tails, and then carry through that principle. The tails on the d and a might be easier to get away with, because they sort of exist on seriffed faces. Tankard's Bliss mixes stemmed and unstemmed letters in a very elegant way. I guess the big challenge is to make this new element of the tails seem visually natural and logical.\n\n"
    },
    {
      "time": "26 Jan 2004 — 2:37am",
      "content": "Here is what I hope to be an updated version. Things have been tweaked, I think the 'a' and 'd' have been sorted. There is an alternate 'g', shown in the bottom half of the page which I think is more suitable. I would like to know whether the double storey or single storey 'g' is better. I thought I had respaced it, but the type setting says otherwise! The '9' is funny, as is the 'w'. All of the punctuation has been changed, and there is a current character set at the bottom. I have a feeling that \"hybrid\" numerals will be the best way to go at the moment (see Hrant, the term is catching on!)   \n   \nWhat is you opinion?   \n   \nThanks, kris.\n\n<!--attachment: Ksans_mag-24918.pdf*mime_pdf.gif*application/pdf*39.6 **Ksans%2emag%2epdf --><!--attachment: Ksans_mag-24918.pdf*mime_pdf.gif*application/pdf*39.6** Ksans%2emag%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012091616im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131012091616/http:/www.typophile.com/forums/messages/29/Ksans_mag-24918.pdf\" target=\"_blank\"><b>Ksans.mag.pdf</b></a> (39.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "26 Jan 2004 — 2:45pm",
      "content": "Old 'g' vs new 'g'. I am inclined to go with the new, it seems to fit more appropriately with the rest of the lower case. Yay or Nay?   \n   \nkris   \n   \n   \n   \n ![](http://web.archive.org/web/20131012091616im_/http:/www.typophile.com/forums/messages/29/24943.jpg)\n\n"
    },
    {
      "time": "27 Jan 2004 — 2:44am",
      "content": "Hi Kris,   \n   \nI really think the old g would be better. I like it much more to look at as a piece of...art. You showed the separation stage of the dangly bit on the g in the jan 13 post and I think that was a nice detail. Wow!!!   \n   \ncrotty.\n\n"
    },
    {
      "time": "27 Jan 2004 — 5:34am",
      "content": "Hi Kris.   \n   \nHere are some thoughts after looking at the recent pdf and large gif showing.   \n   \nNew g: Here is a tip for single storey g's. The bowl shouldn't overshoot the baseline (as the p does). Raise is up a bit. Right now yours is looking top heavy. It will also make the decender more prominent without sacrificing economy.   \n   \na: Is looking narrow in the pdf.   \n   \nr: I might drop the join even further. (my taste)   \n   \nSpacing may be a bit tight for 9/13   \n   \nI think your stoke modulated version will have more sparkle in text settings than the current version. In fact, even if you don't go that way, I might suggest thinning the joins. However, I have to be careful, because this style isn't my cup of tea. For example, despite the fact that most everyone loves and uses Gill Sans, I can't bring myself to like it. Perhaps I will see the genius at some point. Don't let that discourage you though, Gill is good company regardless of what I think :-)\n\n"
    },
    {
      "time": "27 Jan 2004 — 6:14am",
      "content": "Your letterforms are really elegant, but I still don't see a consistent visual logic in this face. The tails on the a and d are innovative and interesting, but what idea do they have that is carried through in the rest of the face?   \n   \nThe tail on the a I think works well now, but on the d lifts higher above the baseline. I think an advantage of the d and a tails is that they give an element of baseline that san-serifs normally don't have, and this can work for the face. The d tail lifting above the baseline more you don't get this advantage. One thing you might consider is a flat bottom to the d, like Perpetua, which with its flat serif is the only anticipation of your idea I know of. In \"Letters of Credit\" Tracy says that Gill also tried the flat bottom in Gill Sans, and then was talked out of it. He shows the draft version. His version in the sans did not have the tail you have invented.   \n   \nIf the idea is to add an element of increased readibility by the quasi-serif on the a and d, then would the face be more logical as a semi-serif? For example, going back to the bent stems, or maybe a curled bottom for the l, and maybe even n m u?   \n   \nI don't know if any of these are good ideas, but I do think you need to have more of a visual justification for the a and d tails, by more consistency.   \n   \nOn the two g's. I personally tend to like binocular g's as more readable in a text face. Here the one story fits more smoothly, but I think (and this may be just a prejudice) makes the face a little less easy to read in text. Both g's are beautiful, but I think have some problems. In your 9 pt PDF showing the loop of the binocular g looks a bit squashed against the top. You might need more space for small sizes. The top of the one story g I think doesn't look quite consistent with the other shapes. Does the top corner need to be lower? Or does it need a stem?   \n   \nOverall, with your innovations and gift for elegant letter forms, this is very promising, but I think needs more work on having a visual logic that is carried through consistently.\n\n"
    },
    {
      "time": "27 Jan 2004 — 5:36pm",
      "content": "Thank you all for the feedback so far. Even you Crotty, and your \"dangly bit!\" (see you soon). I have been giving myself a lot of grief over this, more than I should. It gets frustrating being an amateur! (hurry up experience, I'm waiting...) I have probably made so many changes that it is getting a little confusing, I think typified by Randy with \"Anyways, can you show the modulated version in a text setting? (or did I miss it?)\" I think you were looking at the modulated version - the modulation is perhaps too subtle!   \n   \n   \n ![](http://web.archive.org/web/20131012091616im_/http:/www.typophile.com/forums/messages/29/25054.jpg)   \n   \n   \nSo, to help clarify things a little, here is a brief overview of what has happened. 1 is the first posting, and 2 is the second, with the slight modulation. 3 is the \"stemless\", which was deemed to be too similar to others to be wortwhile, namely Dax. 4 is my attempt at modifying 3, and was posted as a 'side note', but was seemingly well received. However, it is still 'stemless', and digressed too far from the initial a, p, and d, which are the redeeming but unresolved features. 5 is the last pdf version, which is essentially a tweak of 2, with a new g.   \n   \nI know that there have been a lot of positive responses to the 'tails' so far, for which I am very grateful. William suggested that I try a 'g' similar to DTL's Prokyon. I have been reluctant, because it seemed to be very iconic, and I have never seen another like it and wanted to avoid accusations of copying. However I think I may have a solution in the 'g' of 6. This is the latest incarnation that takes the better elements of the above iterations and attempts to combine them in harmony. I have done a test print, and (to me) looks to be an improvement on the rest. I also think that \"visual justification...by more consistency\" is exactly right, thanks William. I will post a setting with as much of a character set soon.   \n   \nThanks, kris.\n\n"
    },
    {
      "time": "27 Jan 2004 — 8:53pm",
      "content": "Wow. Your line 6 is wonderful. Great evolution of the ideas.   \n   \nIt has greater rhythm and consistency, and has a distinctive look.   \n   \nOn your concern about being accused of imitation. In 'What is Art?' R.G. Collingwood points out that in the most fruitful eras in art (Greek & Renaisance art, Elizabethan English literature) people took freely from each other and adapted the ideas in their own way. Of course, if you simply have a stale imitation, it is pathetic. But if you build on the best ideas around, and encorporate them in your own work, and make them your own, then your work becomes better than it otherwise could have been.   \n   \nIn Prokyon, I think the innovative g actually doesn't fit that well in the face, as someone else pointed out on these boards. But your version of the tailed g does fit in your face, and you've made it your own as well. I think it goes wonderfully well with the a, and sets up a nice rhythm.\n\n"
    },
    {
      "time": "28 Jan 2004 — 1:51am",
      "content": "I like the version in line 6 as well very much.   \n   \nAlthough I have some doubts about the 'e'. I think it would work better, if it were more 'geomatrical'. I think this the force of your face: relatively gepmetrical in its structure, but fresh in its details and contrast.   \n   \n--Jacques   \n   \nPS: I wouldnt botter about the 'copying': your face stands on its own and has enough distinction. Keep up the good work.\n\n"
    },
    {
      "time": "28 Jan 2004 — 5:55am",
      "content": "Hi Kris.   \n   \nI agree that 6 and 4 show the most promise.   \n   \nHere are a few comments about 6 based on hamburgevons.   \na: still needs more width (IMHO)   \ng: The tail begins it's curve a bit soon I think. Maybe make it a little more abrupt. Currently, it's causing the g to lean right. I might raise the bowl up a tad more also.   \nv: The right stem is too thick right now. Make it visually match the other thins.   \ns: The top terminal seems soft. Maybe trim at the same angle as the bottom terminal?   \nBTW, nice fix on the m between 4 and 6   \n   \nCarry on!   \nRandy\n\n"
    },
    {
      "time": "28 Jan 2004 — 4:33pm",
      "content": "I think you really have something exciting here - a face with a new look that can be used for text as well as display.   \n   \nThe mysteries of width, weight and fitting I have little idea about, but I think there is a danger with the modulation that face will look too grey and weak when small.   \n   \nThis is what happened to the digitized Optima, which is also a quite modulated sans. Zapf just corrected it in his Optima Next. You might find it interesting, if you haven't already done it, to look at the Linotype site where they compare the old and revised versions.\n\n"
    },
    {
      "time": "28 Jan 2004 — 5:11pm",
      "content": "\\>\\>look at the Linotype site where they compare the old and revised versions.   \n   \n?? I can't find anything apart from a few paragraphs, and they say very little indeed. Could you please link it?   \n   \nkris\n\n"
    },
    {
      "time": "28 Jan 2004 — 5:37pm",
      "content": "Sorry, I messed up the new name: It's Optima Nova   \n   \nAt the Linotype site, a comparison of the old and new digital is [here](http://web.archive.org/web/20131012091616/http:/www.linotype.com/15525/optimanovaredesign-doc.html). And [here](http://web.archive.org/web/20131012091616/http:/www.linotype.com/15525/pdf/00_home/images/home_06/home_06b/optnova/step.pdf) is a PDF of an article about the redesign.   \n   \nBut probably most informative is this [review](http://web.archive.org/web/20131012091616/http:/www.creativepro.com/story/feature/20399.html) by John Berry at Creative Pro. He has shots of the metal, first digital, and the redesign.\n\n"
    },
    {
      "time": "28 Jan 2004 — 7:30pm",
      "content": "Thanks for the links, William. Here is a setting of Kelburn as it now stands. Upper and lower, numerals, punctuation etc. Thank you all for the positive feedback so far. Be ruthless.   \n   \nkris.\n\n<!--attachment: Kelburn_02-25142.pdf*mime_pdf.gif*application/pdf*26.3 **Kelburn_02%2epdf --><!--attachment: Kelburn_02-25142.pdf*mime_pdf.gif*application/pdf*26.3** Kelburn_02%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012091616im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131012091616/http:/www.typophile.com/forums/messages/29/Kelburn_02-25142.pdf\" target=\"_blank\"><b>Kelburn_02.pdf</b></a> (26.3 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "29 Jan 2004 — 5:44am",
      "content": "Very nice.   \nBut caps are overall too narrow.   \nSome other specific comments:   \n- make the bowls of B/D/P/R completely round (like   \nMyriad), instead of 'straight line + curve bowl';   \n- lower the bars of E/F/H;   \n- J is descending too much;   \n- M's legs are too open (bring the top peaks to   \nthe outside of the glyph keeping its total width);   \n- Q needs a different tail;   \n- great U;   \n- make the parenthesis wider;   \n- the pound sign is falling to the right;   \n- great dagger;   \n- those curvy bars on the pilcrow look out of   \nplace IMHO;   \n- the section sign is a bit narrow.\n\n"
    },
    {
      "time": "29 Jan 2004 — 6:54am",
      "content": "Hi kris   \n   \ni like how it works in long text,   \n   \none little thing: i miss the \"a\" and \"d\" tail in your lc \"u\", and i think it could be part of your number 4.   \nand in your ( ), [], and {} i mis the sharp edges like in your 6 and 9.   \n   \ngood luck   \nCG\n\n"
    },
    {
      "time": "29 Jan 2004 — 11:55am",
      "content": "Oops, double post.\n\n"
    },
    {
      "time": "29 Jan 2004 — 11:59am",
      "content": "Being a rank amateur in these things, I don't have confidence in my judgments about type, so I tried typing the book weights of Meta Plus and Myriad (both at 31 pt) over your large PDF alphabet.   \n   \nBoth are significantly darker in their book weights, which reinforced my feeling that your current line 6 is too light for a book weight. (Hence my urging you to look at Optima & the revisions, neither of which I have unfortunately.) I don't know if you want to go as dark as Meta Book, but I would think that at least as dark as Myriad would give the type more strength and bite.   \n   \nI have been reading Tracy's 'Letters of Credit' and he always put a great emphasis on evenness of color. Here my impression in looking at the text in the PDF was that the o and especially the g were too wide in relation to the other lower case letters. At least by the standards of meta this seems to be so: your proportions are similar to meta's - humanist - proportions, but meta's o is narrower in relation to its m n h, and so is its g (a two story g). Myriad has a wider o, similar to yours, but then its b d p q are wider to match, and its m n h are wider also. (Myriad is a bit more 'softened geometric', following Frutiger)   \n   \nBoth Meta and Myriad are very well crafted, so my tentative conclusion is that your o and g are indeed too wide, causing unevenness of color.   \n   \nYour 'a' looked fine to me big, but small the arm seems a little close to the bowl. The a's of both Meta and Myriad are quite a bit wider, in accord with Randy's feeling, above. You might check on variations on the width of the 'a' and the height of top of the bowl to see whether any thing is improved to your eye in small sizes.   \n   \nOn the caps, I think there is an issue here of caps to go with lower case vs all caps setting. Bigger variation in cap width can get you more elegance - like the new titling version of Optima - but, as Jonathan Hoefer has pointed out in a Daidala interview, then you will have problems harmonizing with the lower case.   \n   \nAs you can see, I am crazy about this face you are developing. I think you can really make a splash with it, and it is well worth taking your time to try all the variations to see what works best to get polished, balanced alphabets with your innovative letter forms.   \n   \nFor example, how does a stemless instead of stemmed m n look with the rest? How do somewhat thicker stems look? I ask these questions in relation to the other letters - the full stem, narrower stem and no-stem versions all look fine on their own.   \n   \nThe only letter I don't like aesthetically is the w and W. Your treatment of it is similar to Goudy Sans, but I don't like it there either. To me the third stroke sticking up on its own to the left looks ungainly.\n\n"
    },
    {
      "time": "29 Jan 2004 — 3:07pm",
      "content": "Wow, I'm loving this feedback. I'll give detailed replies soon. In the meantime, here is a quick comparison with Optima. (I'd love to compare to Optima nova, but can't cos I don't have that much money!) Optima seems slightly lighter than Kelburn.   \n   \nkris.   \n   \n   \n   \n ![](http://web.archive.org/web/20131012091616im_/http:/www.typophile.com/forums/messages/29/25189.jpg)\n\n"
    },
    {
      "time": "1 Feb 2004 — 9:08pm",
      "content": "This is coming together very well!   \n   \nI also think the caps are too narrow.   \nAnd the overall spacing is loose.   \n   \n\\> Optima seems slightly lighter than Kelburn.   \n   \nThat's good news, since Optima is really too light.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Mar 2004 — 11:48pm",
      "content": "Apologies for the delay, but RealLife\n\n"
    },
    {
      "time": "15 Mar 2004 — 7:23am",
      "content": "The M is a definite improvement. The w,W are better also, though they are more conventional now. And the new y fits better with the rest of the letters.   \n   \nOverall the lc is innovative, elegant and very readable. Did you narrow the o and g slightly? I think they are looking more harmonious now. Some nit-picks on the lc:   \n   \nI think there is some kind of optical illusion going on with your g in small sizes. It looks as if the top of the vertical stem is bent to the right. Do you see this or is it just me? Would pulling down the upper right corner slightly be better?   \n  \nIs the gap between the top of the bowl and the stem of the 'b' a little too wide?   \n   \nI still think the 'a' is too cramped.   \n   \nMy main critique here is that the upper case is getting too bland. The old upper case with the straight part of the BDPR to me had more bite, though the current more round shape draws less attention to to themselves. This is a virtue or a vice depending on what you are aiming for.   \n   \nHave you considered doing caps that are more variable in width, like Trajan or Optima's knock-out caps? Another way to go would be to keep the caps modest for text but do another set of more stylish, variable-width caps for titling and perhaps for small caps too.\n\n"
    },
    {
      "time": "15 Mar 2004 — 7:34am",
      "content": "Oh I just noticed that you added a 'tail' to the 'u' but kept the 'U' as is. Clever idea, it works.\n\n"
    }
  ]
}
