{
  "id": "240",
  "title": "SOTA Announces Call for Submissions for TypeGallery2003",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "BUFFALO, NY, MAY 19, 2003 - The Society of Typographic Aficionados (SOTA) has announced a call for submissions for TypeGallery2003. The TypeGallery is an international showcase of new typeface design that will be exhibited during TypeCon2003, in Minneapolis, Minnesota, July 17-20. All typefaces shown at TypeCon2003 will also become part of a permanent online exhibition at [http://www.typegallery.com](http://web.archive.org/web/20131019233936/http:/www.typegallery.com/).   \n   \nOriginal type designs created, published, or significantly updated from June 2002 through June 2003 are eligible for inclusion in the TypeGallery. Submissions are limited to 3 new typefaces from a single designer or foundry.   \n   \nThis year's exhibition will also feature the winners of the 2002 Type Directors Club and Morisawa typeface design competitions; a South American typography showcase; an international poster show, typographic fine art and photography, and an exhibit from the Hamilton Wood Type and Printing Museum.   \n   \nDeadline for submissions is July 8, 2003. Further information and submission forms are available at [http://www.typegallery.com](http://web.archive.org/web/20131019233936/http:/www.typegallery.com/). Examples of typefaces from the 2002 gallery in Toronto are also displayed on the site.   \n   \nThe TypeGallery is presented by SOTA, an international not-for-profit organization dedicated to the promotion, study, and support of type design, typography, and the related arts. For more information about SOTA, please visit the website at [http://www.typesociety.org](http://web.archive.org/web/20131019233936/http:/www.typesociety.org/), or email [info@typesociety.org](mailto:info@typesociety.org). For details about TypeCon2003, visit the conference website at [http://www.typecon2003.com](http://web.archive.org/web/20131019233936/http:/www.typecon2003.com/).\n\n",
  "author": "tamye",
  "time": "26 May 2003 — 10:41pm",
  "uid": "107",
  "comments": [

  ]
}
