{
  "id": "2407",
  "title": "(x) Essolub - hand lettered {Mike Y}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I need to re-create this old logo and need to know the fonts used. Is the \"E\" a custom design? Is the whole word \"Essolub\" custom? If someone happens to have a better photo/scan of the logo I would be very interested...   \n   \n ![](http://web.archive.org/web/20051125084241im_/http:/www.typophile.com/forums/messages/83/22380.jpg)\n\n",
  "author": "Jan Sandvik",
  "time": "15 December, 2003 - 10:28am",
  "uid": "2482",
  "comments": [
    {
      "time": " 15 December, 2003 - 11:10am",
      "content": "It's probably a custom type design, but I think you can simulate it easily by using a backwards 3 for the E. I did this sample with Quay Sans Black, which is maybe not the best font match for the s and u, but it gives the idea (the 3 was the right sort of shape). ![EssolubSimulation](http://web.archive.org/web/20051125084241im_/http:/www.typophile.com/forums/messages/83/22398.gif)\n\n"
    },
    {
      "time": " 15 December, 2003 - 12:03pm",
      "content": "I am continually surprised at how often people assume that some old piece of lettering is type. Old advertising art like that is most likely not type, even if it was mass-produced, and even when it looks like it could be type (i.e., nothing particularly irregular about the letterforms or their treatment). Doing it by hand was the only way back then to have the kind of flexibility and control over the design that we take for granted today.\n\n"
    },
    {
      "time": " 15 December, 2003 - 1:35pm",
      "content": "\"I am continually surprised at how often people assume that some old piece of lettering is type. \"   \n   \nI didn't express myself clearly enough (my bad english!). I was thinking that the logo was handpainted, but because I need reproduce the logo a typeface as close as possible would be a good starting point. It's also a personal project just for fun, so the result don't have to be 100% exact.   \n   \nMike, I have found many typefaces with the right \"3\", but not yet found a match where both the \"3\" and the rest match. I'll propably have to use two typefaces. Any good suggestions for the \"ssolub\"-part?\n\n"
    },
    {
      "time": " 15 December, 2003 - 2:27pm",
      "content": "Present company excepted. :-)\n\n"
    },
    {
      "time": " 16 December, 2003 - 6:56am",
      "content": "Of course Mark is right, and so I assumed that what you wanted to do was match the lettering, not find the 'font'. I looked at a number of sans serif fonts, and had trouble finding one that had everything. Futura has the right 's', but its 'u' has no stem; the 'b' from Quay Sans Black was fine, but the 'u' isn't quite right. If I were going to replicate this I would use the 3, o, l and b from Quay Sans Black (above), and use the s from Futura Heavy and modify the Futura u by adding a stem. (see attached version done that way, with some adjustments to size, tracking, and using the Futura'l' for the l and stem of the 'b'.) If that's too much work I'd stay with the Quay Sans version I did above. It would probably be close enough if you weren't comparing them side-by-side.   \n ![Essolub Sim 2](http://web.archive.org/web/20051125084241im_/http:/www.typophile.com/forums/messages/83/22486.gif)\n\n"
    },
    {
      "time": " 16 December, 2003 - 12:25pm",
      "content": "Mike, the combination Quay Sans Black and Futura Heavy looks close enough. Thank you very much for your efforts!\n\n"
    },
    {
      "time": " 16 December, 2003 - 1:26pm",
      "content": "Only for sans faces, of course... ;-)\n\n"
    },
    {
      "time": " 16 December, 2003 - 1:39pm",
      "content": "Good idea Yves. By the way, Jan, I think I ended up using Futura Bold, rather than Heavy. You will need do do some tweaking, as I said, but my re-creation took about 15 - 20 minutes to do. I could have played with outlines to make some things closer, and it would have been more efficient to flip the n to make the u.\n\n"
    }
  ]
}
