{
  "id": "2415",
  "title": "(x) alternative for Corporate S - various {gang}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "We are all aware of the typeface [Corporate S](http://web.archive.org/web/20070403075031/http:/www.bertholdtypes.com/bq_library/090161000.html) from Berthold Types. Yes? I'm wondering if anyone knows of a suitable replacement. I feel awful putting it that way. Oh, the guilt! I know that once you do the math it is only $20 per font, but ... well ... any ideas? Is someone else licensing this typeface for less?\n\n",
  "author": "<a href=\"user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": "<br>",
  "uid": "108",
  "comments": [
    {
      "time": " 16 December, 2003 - 12:01am",
      "content": "I may understand you, Tiffany, I always loved the look of 'Corporate A' ( the serif one )..   \n( So, Maybe i am just going to save some more money, and buy it, in the, hopefully near, future.. )   \n   \nBut, of course, I am thankful for any cheaper licenses, links and hints, too.. ![:-)](http://web.archive.org/web/20070403075031im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 16 December, 2003 - 1:02am",
      "content": "Take Univers, change i (square) to i (round) and you've got Corporate S in better.   \n   \n(merde alors, I have no clue the g!)   \n   \nAnyway, about the Corporate S, the Q is very funny. And oh, the OsF, quite incredible! ;-)\n\n"
    },
    {
      "time": " 16 December, 2003 - 1:12am",
      "content": "Probably a stupid question, but why is the font called Corporate S? Sounds awkward.\n\n"
    },
    {
      "time": " 16 December, 2003 - 2:01am",
      "content": "Weidemann designs the corporate familiy for Mercedes-Benz. as far as I know,   \nmost glyphs based on the \"golden cut\". I love those faces especially the lc g,   \nthe corpo A small caps and the whole corpo E.   \n   \nI've done some work for daimler chrysler and used the urw-version of corporate.   \nthis version has a few bugs and its badly screen optimized.   \n   \ncorporate A ntiqua   \ncorporate S ans   \ncorporate E gyptienne\n\n"
    }
  ]
}
