{
  "id": "2419",
  "title": "Can I get a crit?",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is a work in progress. These guys develop enterprise software for the academic / education industry.   \n   \nCheck out their current site to get an idea of where they're at today.   \n   \nThe new logo is the first step to a new corporate ID. They wanted it to reflect an evolutionary step yet to resolve some of the inconsistencies of their existing look.   \n   \nThey're looking for something strong, approachable, classic, etc. :-\\ Anyway, tell me what you think.   \n   \nThanks,   \nNathan   \n   \n ![Unicon Logo](http://web.archive.org/web/20131020201339im_/http:/www.typophile.com/forums/messages/29/22447.jpg)\n\n",
  "author": "sativo",
  "time": "15 Dec 2003 — 7:08pm",
  "uid": "2230",
  "comments": [
    {
      "time": "15 Dec 2003 — 7:11pm",
      "content": "BTW - their current site is at:   \n   \n [www.unicon.net](http://web.archive.org/web/20131020201339/http:/www.unicon.net/)\n\n"
    },
    {
      "time": "16 Dec 2003 — 8:23pm",
      "content": "No takers??\n\n"
    },
    {
      "time": "16 Dec 2003 — 8:50pm",
      "content": "Haven't been on for a little bit. I like the colors and the cant on the top of the U shape.   \n   \nThe flat bottom of the mark kind of bugs me though. Could it be rounder on the bottom like it is in the U of Unicon? Or could you change the typeface to match the mark?   \n   \nI'd lose the reg. symbol if at all possible.   \n   \nAm I correct that you're showing these three as variations of same for different layouts and applications?\n\n"
    },
    {
      "time": "16 Dec 2003 — 9:30pm",
      "content": "Sativo,   \nI like the U, but   \ni would shoot for a more distinctive type treatment.   \n   \nis that Myriad?\n\n"
    },
    {
      "time": "16 Dec 2003 — 10:43pm",
      "content": "Jon, I was thinking the same thing about the mark. Making it rounder at the bottom. And yes, these are variations of the same for different applications. One of the requirements is to stay flexible. The have a product UI, web site, print, etc. It needs to scale well too.. which it seems to do.   \n   \nbj, I really liked the myriad. What else do you recommend?\n\n"
    },
    {
      "time": "17 Dec 2003 — 9:46am",
      "content": "\\> bj, I really liked the myriad. What else do you recommend?   \n   \nI could say, Myriad is super-duper, just go with that I guess.   \n   \nBut that would be doing you a disservice.   \n   \nI would opt for a little more time spent either:   \na) creating something distinctive yourself   \nb) modifying Myriad to make it more distinctive   \nc) perusing some foundries with great type underused in the U.S. (linotype.com, for example)   \nd) look at some indie foundries, such as Mark's   \n   \n [www.ms-studio.com/](http://web.archive.org/web/20131020201339/http:/www.ms-studio.com/)   \n   \nYou found typophile, so you are on the right path.   \nI would go further to say that it behooves any logo   \ndesigner to follow the type industry closely, be aware of new releases,   \nand learn about big and small foundries and the type of type they offer.   \n   \nAnd if you have time, do something distinctive.   \nUsing an Apple System Font, no matter that it\n\n"
    },
    {
      "time": "17 Dec 2003 — 2:30pm",
      "content": "My two lincoln cents: the U mark looks like something created for a paper company. I don't feel its Academic, maybe its the colors. The typeface is forgettable. I like the Caps and small caps version of the old logo better. I think you have a ways to go. Maybe its time to go away from the computer (paper and a pencil, come up with a look you like then find a way to make it on the computer)\n\n"
    },
    {
      "time": "19 Dec 2003 — 11:15am",
      "content": "how about a lowercase u for unicon?\n\n"
    },
    {
      "time": "26 Dec 2003 — 6:20pm",
      "content": "I think it works. The Colors and the \"U\" mark all seem quite resolved. T'd stick with the U/lc type treatment - all lowercase id very fashionable now, but more appropriately reserved for projecting the kind of self-conscious humility yhat multi national corporations crave these days. Initial caps and lowercase seems more formally suited for an educationally-oriented venture.   \n   \nThe selection of typeface should, of course, be more considered.   \n   \nAnyway, it's tons better than this:   \n   \n ![united rentals](http://web.archive.org/web/20131020201339im_/http:/www.typophile.com/forums/messages/29/23012.gif)\n\n"
    },
    {
      "time": "16 Jan 2004 — 9:50am",
      "content": "Here's an update. Thanks for the feedback. It's helped a lot.   \n   \nAs far as lowercase/uppercase.. I decided to stick with the uc U because of the emphasis on the letter U in the mark as well as other campaign related issues that tie into their market.   \n   \nFor example, they deal with Universities so the promenent U makes sense for them.   \n   \nMyriad was the favored typeface because of its close resemblence to Frutiger, which was initially appealing due to its clean / symmetrical strokes and its classic nature. But since Myriad is a bit more friendly, it worked better for their messaging.   \n   \nI wasn't comfortable really changing it because sometimes you can't improve on perfection. Also, I think uniqueness and memorability can be achieved through orientation, in this case the mark, colors, and layout of the logo.   \n   \nI would still like to hear other views, so please share your thoughts to help me make whatever improvements I can before this goes live.   \n   \n   \n ![](http://web.archive.org/web/20131020201339im_/http:/www.typophile.com/forums/messages/29/24267.jpg)\n\n"
    },
    {
      "time": "16 Jan 2004 — 10:19am",
      "content": "I think you need to seperate the \"n-i\" ever so slightly. It seems to be just a little tighter than the rest\n\n"
    },
    {
      "time": "16 Jan 2004 — 2:58pm",
      "content": "hi sativo   \n   \nyour first post reminds me this   \n   \n ![unilever](http://web.archive.org/web/20131020201339im_/http:/www.typophile.com/forums/messages/29/24284.gif)   \n   \nsometimes when we work with simple forms we are risking to look like others.   \n   \nanyway, when the work is honest it don't matters to me. i think that your recent update has nothing to do with the unilever logo. i find it better than your first post, but i do think that the union between Unicon and the logo needs work   \n   \ngood work   \n   \nCG\n\n"
    },
    {
      "time": "17 Jan 2004 — 9:50am",
      "content": "I'll play with the kerning a bit more on monday. The files are on my work machine. Thanks for the input.   \n   \nCristian, can you elaborate on your last suggestion? How would you recommend making a stronger connection between the mark and type?   \n   \nBTW: I increased the vertical scale of the mark just a bit after I posted this version. I think it helped. I'll post when I get in on monday.   \n   \nThanks again for everyone's feedback!!\n\n"
    },
    {
      "time": "18 Jan 2004 — 8:35pm",
      "content": "I think Scott is right in his last comment. Looking forward to the finished result.   \n   \nJon\n\n"
    },
    {
      "time": "19 Jan 2004 — 4:56am",
      "content": "sativo... is just a change of proportions and ubication.   \n   \nthe dot of the \"i\" bothers me, and push up the isotype from the word, i think that you should try \"Unicon\" in a lighter weight, trying to match with the white stroke of the \"U\" in your isotype.   \n   \nIt's really small stuff but it realy matters when your finishing a work.   \n   \nanyway, i hope i make mi self clear.   \n   \ngood luck   \nCG\n\n"
    },
    {
      "time": "19 Jan 2004 — 8:39am",
      "content": "Cristian,   \n   \nThanks for the comments. I'll make a few changes today and post later.   \n   \nAs far as the weight of the stroke, I actually changed it manually to be a bit heavier then the original. I was going for more of an optical balance between the white stroke that seperates the U in the mark and the overall weight of the mark. Besides, having it any lighter looks odd in print -- just too thin. You disagree?\n\n"
    },
    {
      "time": "19 Jan 2004 — 9:22am",
      "content": "I think Chritian might be right. It would seem that either the logo mark and logo type need to be connected somehow (maybe some alternative positioning) or their needs to be some unifying element (maybe the suggested weight association, I don't think the color is enough to do the trick here). If you do try to optically match the weight of the white stroke and the type, then it could probably most successfully be accomplished by a combination of lightening the type weight and decreasing the overall typesize. As it appears right now, the mark and type are competing a little for attention, rather than combining to make a strong logo. You are fortunate to have a typophile like Christian to catch this, because I was too blind to see it at first.   \n   \nGood luck!   \nScott\n\n"
    },
    {
      "time": "19 Jan 2004 — 2:30pm",
      "content": "I see what you guys mean now. Thanks, I'm going to work on it. Still haven't had a chance today as I've been swamped.   \n   \nBut this is great feedback!\n\n"
    },
    {
      "time": "19 Jan 2004 — 2:54pm",
      "content": "Okay.. here's what I've come up with. The changes are very subtle as I didn't want to move to far away from where it was at.   \n   \nWith Option 1 I played with the kerning and scaln o he mark with the type to give it better proportion.   \n   \nOption 2 slopes the U in the type.   \n   \nOption 3 uses a slightly ligher stroke on the type.   \n   \nOption 4 is just a different layout.   \n   \n   \n ![](http://web.archive.org/web/20131020201339im_/http:/www.typophile.com/forums/messages/29/24469.jpg)\n\n"
    },
    {
      "time": "19 Jan 2004 — 2:57pm",
      "content": "PS: Sorry about the typeos. My keyboard is on the fritz!\n\n"
    },
    {
      "time": "19 Jan 2004 — 3:36pm",
      "content": "I like 3.\n\n"
    },
    {
      "time": "19 Jan 2004 — 11:03pm",
      "content": "The angles at the top of the U's stems are interesting in Option 2, although I think the angle is a little too severe. I'm guessing that it is mathmatically equal to the angle at the top of the mark, but optically it doesn't match up. I'd be interested in seeing angles on all of the verticals (U, n, i, n)\n\n"
    },
    {
      "time": "20 Jan 2004 — 10:01am",
      "content": "i completely agree with scott, i think that a lighter version wont harm nobody. the solutions with the angles is very clever, you should make the optical match in the as scott sugested and keep the others just how they are.   \n   \ngood job   \n   \nCG\n\n"
    },
    {
      "time": "21 Jan 2004 — 12:07pm",
      "content": "The client wasn't too keen on the slopes. Personaly I felt that it had technical merit, but made the piece look a bit less classic.   \n   \nHere's the last round. These variations should reflect the feedback around the stroke width.   \n   \nLet me know.   \n   \nAlso, if you like the thinner version, could you explain why. I'll need to communicate this to the client. One thing they wanted, as a departure from their current logo, is something with more strength and dominance. Haveing too thin of a stroke reverts back to a subtly more elegant look, and that's not what they're going after.   \n   \n   \n ![](http://web.archive.org/web/20131020201339im_/http:/www.typophile.com/forums/messages/29/24627.jpg)\n\n"
    },
    {
      "time": "21 Jan 2004 — 8:24pm",
      "content": "I like option 2.   \n   \nI think it's a matter of contrast. You've got this thick slabby U above. It gives interest and interplay between the element rather than having each fight for dominance.   \n   \nRandy\n\n"
    },
    {
      "time": "21 Jan 2004 — 9:36pm",
      "content": "I agree with Randy.   \n   \n\\>something with more strength and dominance   \nSo with the lighter stroke is it less strong and dominant than their current logo? Maybe you've already achieved that and don't need a heavy type.\n\n"
    },
    {
      "time": "22 Jan 2004 — 12:47am",
      "content": "Option 2   \n   \n\"Strength and dominence\" is not only achieve through bold type. Depending on the industry, \"strength and dominence\" may be achieved through various elements. In this case, developers of \"enterprise software for the academic/education industry\" would be served well if their logo was a beacon of refinement. I don't think this option is \"elegant\", but rather a little more sophisticated relative to the other options. I believe if you pitched this design as refined and sophisticated, it would demand attention\n\n"
    },
    {
      "time": "22 Jan 2004 — 7:29am",
      "content": "congratulations, option 2 is clearly the winner   \n   \ni agree with Scott, sophisticated is the concept you should sell to your client   \n   \nwell done   \n   \nCG\n\n"
    },
    {
      "time": "2 Feb 2004 — 11:20am",
      "content": "Thanks for all the feedback guys! It's really helped drive the refinement of this thing.   \n   \nSo much in fact, the when I began to take a close look, I realized that there were some inherent balance issues with the symbol and the type. The symbol also wasn't very flexible when arranged in a different position other than presented.   \n   \nSo what I went back the drawing-board. I have a couple of variations here which I think make a cleaner evolution of the existing logo ( [www.unicon.net](http://web.archive.org/web/20131020201339/http:/www.unicon.net/)).   \n   \nPlease let share your thoughts.   \n   \n   \n ![](http://web.archive.org/web/20131020201339im_/http:/www.typophile.com/forums/messages/29/25349.jpg)\n\n"
    },
    {
      "time": "2 Feb 2004 — 8:47pm",
      "content": "I don't think the circle adds anything. Why did you add a circle?\n\n"
    },
    {
      "time": "2 Feb 2004 — 9:56pm",
      "content": "I really liked where you had ended up before the circle phase.   \n   \nIf you are hooked on the circle or have already sold it upstream then I would choose option 1 but no TM. I am assuming all logos shown in option 1 are variants. If I were to choose 1 out of option 1 I would choose Bottom Row first Logo.   \n   \nTM on option 1 but not 2? I don't know if I understand.   \n   \nJon\n\n"
    },
    {
      "time": "4 Feb 2004 — 9:27pm",
      "content": "I like the typeface in option 3, but just because I don't like the other typeface (Myriad?).\n\n"
    },
    {
      "time": "5 Feb 2004 — 10:01am",
      "content": "Don't skew the U.   \n   \nIf I buy Unicon I dont want the stock to topple.   \n   \n3 is best.\n\n"
    },
    {
      "time": "25 Mar 2004 — 5:50am",
      "content": "i def. like you first concepts better, i am not a fan of the later ones with the circle and italicized type. I think also that it might be very valid to see if you cannot incoporate all the letters so that they combine somehow, like using modified serifs to attach all the letter to each other. This might give a little bit of play on the company name, being as all the letters would be acting as a sinlge word, unified, rather than individual letters, not unified. It might now work, you might have already tried, but I think its an idea. I like your concept, and execution, and I think this logo has great potential.\n\n"
    },
    {
      "time": "25 Mar 2004 — 8:20am",
      "content": "ooo I like option 3 - it looks \"established\" which is probably something your going for.   \n   \nthe first ones don't really say anything - in a way they kind'a look like every other logo to come after year 2000 - although design wise they are \"nicer\", but personally I wouldn't give it a second look. However, if I saw option 3 - I'd look and wonder...who are they, how come I havn't seen them before, how come they're so well put together - it has quiet confidence while the others look like they are striving to be something, or need investors.\n\n"
    },
    {
      "time": "26 Mar 2004 — 6:47pm",
      "content": "Cacelia is definately a good choice, a favorite of mine.   \n   \nHildebrant.\n\n"
    },
    {
      "time": "27 Mar 2004 — 6:30am",
      "content": "I think you should back up and forget about the typeface until you get a logo that they can live with for years to come. To me the image says fabricated metal or formed plastic. I would work on that, throwing away a lot of sketches, and challenging them all by the dawn's ugly light next day. You'll get it. The simpler it is, the longer and harder you have to work. Remember, they want strong, approachable, and classic. That's a tall order. Good luck.\n\n"
    },
    {
      "time": "1 Apr 2004 — 10:32am",
      "content": "tray smal caps ore jsut \"u\" for text adn perspectif sems litl of, but that depends what you ment\n\n"
    }
  ]
}
