{
  "id": "2421",
  "title": "Problem generating font",
  "forum": "Build",
  "tags": [

  ],
  "content": "I may be overlooking something really stupid, but I'm lost. I'm using TypeTool 2 on Mac OS 9 and up until tonight everything worked fine. I've added kerning pairs and wanted to test them, but when I use \"generate mac suitcase\" to create a usable font, my applications won't recognize it (I'm putting them directly in the fonts folder). Any help would be appreciated.   \n   \nIn case it isn't obvious, I'm fairly new at this.   \n   \nThanks,   \nAddison\n\n",
  "author": "addison",
  "time": "Mon, 2003-12-15 21:02",
  "uid": "2412",
  "comments": [
    {
      "time": " Mon, 2003-12-15 22:25",
      "content": "Are you generating bitmaps too? Macs need at least one bitmap, IIRC.\n\n"
    },
    {
      "time": " Mon, 2003-12-15 22:42",
      "content": "Chris, these days it's the other way around:   \nMacOS treats bitmaps (I mean \"true\" bitmap fonts) like Unlawful Combattants.   \n   \nhhp\n\n"
    },
    {
      "time": " Tue, 2003-12-16 06:17",
      "content": "Is this all I need to do (for bitmaps)?   \n   \n ![Type 1 preferences](http://web.archive.org/web/20050526120838im_/http:/www.typophile.com/forums/messages/4101/22480.gif)   \n   \nI haven't created any hinting yet, but like I said, it worked fine before last night. The kerning is the only thing I can think of that's different.   \n   \nThanks for your help,   \nAddison\n\n"
    },
    {
      "time": " Tue, 2003-12-16 16:19",
      "content": "He's on OS9, Hrant.   \n   \nAddison, are you trying to make PC type 1 fonts or Mac type 1? Because PFM and AFM/INF files are only used on the PC.\n\n"
    },
    {
      "time": " Tue, 2003-12-16 17:32",
      "content": "Well, I have no idea what happened, but it works now. Perhaps there's a problem with my computer -- sorry for the false alarm.   \n   \nBTW, I have a Mac font from the Storm Type Foundry and it includes an AFM file. Why is that?   \n   \nOh, and Chris, I'm creating Mac type 1 fonts.   \n   \nThanks for the help,   \nAddison\n\n"
    },
    {
      "time": " Tue, 2003-12-16 22:00",
      "content": "AFM files are used almost exclusively in \\*nix now. Maybe they can install Mac fonts with the AFM.   \n   \nI wish I could've helped more, but at least you got it working now.\n\n"
    },
    {
      "time": " Thu, 2004-08-19 08:24",
      "content": "Sorry to bring up this old thread, but I'm having this same problem again. Here's the info:   \n   \nI'm using TypeTool 2 on Mac OS 9 and X, plus TypeTool 2 for Windows XP. On all of these platforms, the \"Generate Mac Suitcase\" or \"Generate Font/Type 1\" fails to produce a working font. It always appears empty, if that makes sense. For instance, in OS 9 the suitcase icon is there, but when I try to open the suitcase and view the bitmaps, they display as Charcoal (system font).   \n   \nI've posted a thread on the MSN/Fontlab messageboard twice, but I get no response. Does anyone here have any suggestions? For what it's worth, if someone can help me, I'll give them a copy of my font when it's finished (if anyone actually wants it).   \n   \nThanks in advance,   \nAddison\n\n"
    },
    {
      "time": " Thu, 2004-08-19 19:42",
      "content": "Could the path directions have anything to do with it? Or possibly something in the Font Info dialogs?   \n   \nThanks,   \nAddison\n\n"
    },
    {
      "time": " Fri, 2004-08-20 09:08",
      "content": "Apparently if the FOND ID is set to 0, you cannot generate a font--in case you want to know. I'm not sure how or why I changed it, but that was extremely frustrating.   \n   \n-Addison\n\n"
    }
  ]
}
