{
  "id": "2441",
  "title": "Ourtype.com ... brilliant site, nice fonts, cool type tool",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "check   \n   \n [http://www.ourtype.com/](http://web.archive.org/web/20051110135507/http:/www.ourtype.com/)   \n   \na brilliant site (as most of the ones group94.com did) and an excellent show case, type try tool and so on ... be sure to check it. lars\n\n",
  "author": "lars",
  "time": "17 December, 2003 - 3:31am",
  "uid": "2145",
  "comments": [
    {
      "time": " 17 December, 2003 - 4:38am",
      "content": "Group94 is my fave webdesign company for quite sometime. All their work is simply amazing... Back to real life...\n\n"
    },
    {
      "time": " 17 December, 2003 - 5:15am",
      "content": "very slick. like the interface alot.\n\n"
    },
    {
      "time": " 17 December, 2003 - 6:08am",
      "content": "Hmm, where are the fonts?   \nI can't see them.\n\n"
    },
    {
      "time": " 17 December, 2003 - 6:12am",
      "content": "there seems to be a bug. i doesnt work for me in firebird 0.7, too (win). ie6 works fine.\n\n"
    },
    {
      "time": " 17 December, 2003 - 6:17am",
      "content": "No go in Firebird or Netscape 7, but it works in Safari and IE 5.2 on Panther.\n\n"
    },
    {
      "time": " 17 December, 2003 - 6:25am",
      "content": "Ah, thanks. I was using Mozilla.   \nIt works fine on IE.\n\n"
    },
    {
      "time": " 17 December, 2003 - 3:04pm",
      "content": "Jeesu, that is the most beautifulist foundry site that I   \nhave ever seen! It is a little slow on dialup, but is worth   \nthe wait. For once, the on-screen previews are BIG. I like   \nbig samples!   \n   \nkris\n\n"
    },
    {
      "time": " 17 December, 2003 - 5:14pm",
      "content": "Great faces. Arnhem is probably my favourite. But I miss a few words about each face. Take Monitor, for example. Is it a screen-optimized font?   \n   \nThe interface is nice too, although I don't really like PDF-links from Flash websites. And, wasn't 'security' the main reason for typedesigners avoiding Flash showings?\n\n"
    },
    {
      "time": " 18 December, 2003 - 5:09am",
      "content": "\\>No go in Firebird   \n   \nThats true, you need to install the latest flashplayer for firebird. After that it worked on my \"jaguar\"-machine!\n\n"
    },
    {
      "time": " 18 December, 2003 - 5:12am",
      "content": "\\>And, wasn't 'security' the main reason for typedesigners avoiding Flash showings?   \n   \nyes, this way all font can be easly ripped from the swf as all chars are embedded.\n\n"
    },
    {
      "time": " 18 December, 2003 - 6:23pm",
      "content": "That is a killer site! I love the print preview feature. I don't see how anyone could \"rip\" the characters from the swf. Maybe I just don't know enough about Flash, but it seems secure to me.   \n   \nSpeaking of silly-funky-fresh flash sites, I stumbled upon this after seeing the movie: [http://www.sonypictures.com/movies/identity/main.html](http://web.archive.org/web/20051110135507/http:/www.sonypictures.com/movies/identity/main.html)\n\n"
    },
    {
      "time": " 20 December, 2003 - 4:07am",
      "content": "About the Flash security:   \n   \nas far as I know there are tools to open Flash files (.swf-s) to gain the access to pictures and scripts used in them but I have never heard of anybody ripping a font from a Flash file.\n\n"
    },
    {
      "time": " 22 December, 2003 - 5:49am",
      "content": "Hmm... seems I was wrong. There appear to be at least a few tools that can extract glyphs embedded to a swf-file. I am still not sure about if it is possible to extract a full font from the file.\n\n"
    },
    {
      "time": " 24 December, 2003 - 9:50am",
      "content": "So, ummm, anyone know how or where to buy these fonts in the United States?   \n   \nI want Sansa. Bad.\n\n"
    },
    {
      "time": " 25 December, 2003 - 5:36pm",
      "content": "Well, I guess you can buy it online, no?\n\n"
    },
    {
      "time": " 26 December, 2003 - 6:11am",
      "content": "there are tools to extract the font data, but none of them can't extract the metrics, as flash simply doesn't use them. even obfuscating the swf doesn't help. or in other words: there is no protection against ripping fonts from flash files if you embedd all characters. i just like offering pdf's that have embedded the fonts instead of converting them to raster or outlines. lars\n\n"
    },
    {
      "time": " 26 December, 2003 - 9:02am",
      "content": "Why does Arnhem have such short ascenders and capital letters? I thought this was supposed to be a newspaper font. Is this supposed to enhance readability?\n\n"
    },
    {
      "time": " 26 December, 2003 - 5:02pm",
      "content": "It makes sense for a newspaper face to have a big x-height.   \nThe descenders are apparently too long, though.\n\n"
    }
  ]
}
