{
  "id": "2445",
  "title": "Website design / brand audit (your feedback)",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I didn't design this site but I'm redesigning it. I've voiced a few of my concerns with the current design that they are using, but they don\n\n",
  "author": "funcmedia",
  "time": "17 Dec 2003 — 9:50am",
  "uid": "554",
  "comments": [
    {
      "time": "17 Dec 2003 — 2:19pm",
      "content": "It takes forever to load, Its boring (too boxey, break out of the boxes please)and I hate having to wait for flash animations. The date is cut off on right hand side (I'm using Safari) There should be a splash screen where you could bypass any animation. On the plus side the navigation is straight forward. I don't go to sites to entertain me if I want entertainment I will go to a movie. I want information, and ease of navigation, if its interesting to look at, good, but not at the cost of reading content. Just some thoughts\n\n"
    },
    {
      "time": "18 Dec 2003 — 4:28am",
      "content": "ok, my few thoughts:   \n   \nthe animations are to big, the menu/navigation shouldnt be centered, the colors dont \"match\", the contrast between top and content is to \"hard\" (black/white), the whole site is a bit to hectic (because of \"all\" the animations), the date bug occurs in firebird/win, too, the shadowed boxes on the solution page are ugly, the different menu levels are confusing because the 2nd level menu is placed to deep and doesnt seem to have a relation to the top level menu, this top level flash animation doesnt make any sense it's just disturbing, the right hand menu on the 1st page is confusing to, too much text on the 1st page imho, ... hth: lars\n\n"
    },
    {
      "time": "18 Dec 2003 — 1:03pm",
      "content": "When redesigning stick the mainmenu and submenus together at all times. Keep it on the same place throughout the site. There are few things that are worser than having to look for the navigation.   \nTry to find some grid so it all feels tight and fixed. right now everything seems to float around   \nThe current site doesn't have an eyecatcher of some sort, the top animation is to wide and cluttered.   \nThe type is way to booring.   \n   \nBe gentle and subtile with them. They have ordered and paid for the current site and it's like their baby. you dont tell other people that their kids are ugly right :-). What I'm trying to say is that you dont want them to become defensive...it happens to me all the time though :-(   \n   \n/fredde\n\n"
    }
  ]
}
