{
  "id": "2455",
  "title": "Luca Titling",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Here is Luca Titling, a bifurcated serif face that has been   \nkicking around on my hard drive for a while. There will   \neventually be a complete Luca family soon, with a matching   \nsans and inline/fancy. All comments are appreciated.   \n   \nkris.\n\n<!--attachment: luca_post_01-22599.pdf*mime_pdf.gif*application/pdf*18.5 **luca_post_01%2epdf --><!--attachment: luca_post_01-22599.pdf*mime_pdf.gif*application/pdf*18.5** luca_post_01%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131024003902im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131024003902/http:/www.typophile.com/forums/messages/29/luca_post_01-22599.pdf\" target=\"_blank\"><b>luca_post_01.pdf</b></a> (18.5 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "kris",
  "time": "17 Dec 2003 — 4:07pm",
  "uid": "1519",
  "comments": [
    {
      "time": "22 Dec 2003 — 5:25pm",
      "content": "Goodness. Not one comment! It must be bad ;-)   \n   \nkris\n\n"
    },
    {
      "time": "22 Dec 2003 — 7:17pm",
      "content": "Kris, I love it. I am not a type designer, so I can not really offer much in the way of technical criticism. But, I can tell you that I like it. The face is pleasing and seems to have nice ballance.   \n   \nNice work!\n\n"
    },
    {
      "time": "22 Dec 2003 — 9:07pm",
      "content": "How is it considered bifurcated? I thought that meant split in two?   \n   \nI like it though. But I have to say that the bottom of the \"head\" (can't remember what it's called) of the R should be thicker. Also, what about moving the tail under the baseline? It sticks out so far that it creates an awkward space between the letter next to it.   \n   \nAnd the E looks very thin, should be wider I think.   \n   \nThe C looks small.   \n   \n   \nReally good start.\n\n"
    },
    {
      "time": "22 Dec 2003 — 11:36pm",
      "content": "It makes me think of flowers and sun\n\n"
    },
    {
      "time": "23 Dec 2003 — 11:33am",
      "content": "very nice especially the S and R.   \nReminds me of Hoeflers work.\n\n"
    },
    {
      "time": "14 Jan 2004 — 2:56pm",
      "content": "\\>\\>How is it considered bifurcated? I thought that meant split in two?   \n   \nI meant the serifs are bifurcated, not the stems. I think it is correct terminology. I am more than willing to stand corrected, though.   \n   \nkris\n\n"
    },
    {
      "time": "14 Jan 2004 — 8:21pm",
      "content": "bi\n\n"
    },
    {
      "time": "15 Jan 2004 — 4:51am",
      "content": "I think those are called cupped serifs.   \n   \nThe style is nice. The trouble I see is a color issue. It has to do with your thins. Take a look at the BETW combination. The B has some of the thinnest thins in the whole face. Compare it to the BE. The W is even more thick than them. True they won't be exactly the same, but they should \\*look\\* the same. I'd shoot for a uniform thin slightly less than the arms of the E.   \n   \nOh here's a tip on E's. The arms shouldn't be of equal thickness or they will look unequal. I start with them equal, then add a hair to the bottom (heft is needed at the bottom), and shave a bit off the middle. Again the key is making them \\*look\\* the same. (top of T = bottom of E)   \n   \nWhile I'm at it, here are some common construction issues with caps:   \nF: Equals the E with the middle arm moved down slightly (sometimes extended), and the bottom right serif extended (how much is up to you)   \nL: Equals the E with the bottom arm shortened.   \nP: Bowl equals the top of the R dropped down a bit (or the R is raised up a bit.   \nX: Watch out for [this](http://web.archive.org/web/20131024003902/http:/www.typophile.com/forums/messages/29/21083.html?1074095015) problem. (scroll down)   \n   \nKeep an eye on the curves on the S. They're wobbly through the spine.   \nI'd try a different leg on the R. With those fancy pants serifs it want's something more than a straight crutch. (also raise up the waist\n\n"
    },
    {
      "time": "15 Jan 2004 — 12:51pm",
      "content": "Bah, I can't edit my post... not a \"y shame\", a \"y shape\"! heh.   \n   \nAnd cupped serif does sound better.\n\n"
    },
    {
      "time": "15 Jan 2004 — 1:41pm",
      "content": "\\>\\>With those fancy pants serifs...   \n   \nThat's pretty much it, isn't it! It's just a bloody fancy, almost pretentious typeface. It is amazing what a few grouped beziers can say...   \n   \n\\>\\>And cupped serif does sound better.   \n   \nDo you think? I reckon \"bifurcated\" sounds fancier, \"cupped\" sounds more friendly, and reminds me of bra's. Thanks for the feedback, I realised that it is quite rough at this stage. It is a digitisation of a speciman I found in an old type journal. I am pretty much using it to have a play and familiarise myself with the older titling proportions.   \n   \nkris.\n\n"
    }
  ]
}
