{
  "id": "2461",
  "title": "Logo for a lobbying group.",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Please be brutal!   \n   \n ![benbarnes](http://web.archive.org/web/20131108092648im_/http:/www.typophile.com/forums/messages/29/22623.jpg)\n\n",
  "author": "veen",
  "time": "18 Dec 2003 — 8:07am",
  "uid": "2814",
  "comments": [
    {
      "time": "18 Dec 2003 — 10:25am",
      "content": "Nevine explain what the company is all about. You really can't comment without some background information. Such as is it a musical group or a lawyers office?\n\n"
    },
    {
      "time": "18 Dec 2003 — 10:34am",
      "content": "Hi Nevine.   \n   \nNothing wrong with straignt type. You've done a nice job picking caps and italic lowers that are close in weight.   \n   \nHowever, I'd choose something other than Trajan. Particularly since it is type only. There are so many great Classic Caps to choose from. Consider the following:   \n   \n [Forum Titling](http://web.archive.org/web/20131108092648/http:/www.myfonts.com/fonts/redrooster/forum-titling-rr/) (Funky Trajan)   \n [Serlio LH](http://web.archive.org/web/20131108092648/http:/www.myfonts.com/fonts/linotype/serlio/) (Has small caps)   \n [Aeneas Light](http://web.archive.org/web/20131108092648/http:/www.myfonts.com/fonts/tiro/aeneas/) (My pick of the group. Check out the alternate R)   \n   \nSeveral other classics have alternates and swashes that could lend some interest: Centaur, Bembo Titling etc.   \n   \nNow, your italic is Berkley Oldstyle. Don't know if that swash p ending is stock or not. It's a good idea, but I'd make the loop open from the stem. Plus, I would use a more calligraphic in nature, like Centaur's arrighi italics. It offers a light weight, nice swash possibilites, and my instincts say it will work better. Consider other layouts (ie. not one long line\n\n"
    },
    {
      "time": "19 Dec 2003 — 6:47am",
      "content": "It's a logo for a lobbying group, Washington DC-based.   \nThey don't concentrate on just one topic.\n\n"
    },
    {
      "time": "19 Dec 2003 — 7:00am",
      "content": "Randy,   \n   \nAeneas Light is really lovely. Unfortunately, Tiro is revamping their site, so the face remains unavailable to me for some time\n\n"
    }
  ]
}
