{
  "id": "2472",
  "title": "Eidolon",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Kind of a one-off font, but I'm trying to refine it. Any suggestions?   \n   \n ![eidolon](http://web.archive.org/web/20131017082054im_/http:/www.typophile.com/forums/messages/29/2269.jpg)\n\n",
  "author": "glutton",
  "time": "24 Aug 2002 — 8:28am",
  "uid": "1204",
  "comments": [
    {
      "time": "24 Aug 2002 — 9:25am",
      "content": "I think you need to make this entirely organic and loose, not a mix of straight and curvy.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Aug 2002 — 12:15pm",
      "content": "or just concentrate on curvy serifs and keep the rest straight.   \n   \nthe first thing I noticed that bothered me a little was the baselines...they change too much, but maybe your not at that point yet?\n\n"
    },
    {
      "time": "26 Aug 2002 — 8:47am",
      "content": "This would be interesting as an animated font. I can see it used in a Tim Burton movie title. --- My vote is more organic.\n\n"
    },
    {
      "time": "2 Sep 2002 — 10:26am",
      "content": "i like the endings, but there are some irregularities which i don't like, such as the width of the \"z\", which disrupts the flow when reading(this happens a bit with the \"r\" too), and the numbers, which have all square endings, none of the lovely organic \"tentacles\".\n\n"
    },
    {
      "time": "5 Sep 2002 — 2:44pm",
      "content": "Tiffany's \"Tim Burton Comment\" was on the mark. I like your odd font.   \n\\_craig\n\n"
    },
    {
      "time": "14 Dec 2002 — 6:22pm",
      "content": "Thanks for the great advice, everyone... for better or worse, here is where I am now.   \n   \n ![mo eidolon](http://web.archive.org/web/20131017082054im_/http:/www.typophile.com/forums/messages/29/3283.jpg)\n\n"
    },
    {
      "time": "10 Jan 2003 — 10:52am",
      "content": "The \"a\" looks way too much like a \"d\" to me. I 'd suggest making the bowl smaller for that character or eliminate the stem altogether.   \n  \nAlso, I'd have to agree with Tanya. I'd like to it see with a more even baseline. I might not like it, but I'd like to see it.   \n  \nsean\n\n"
    },
    {
      "time": "17 Jan 2003 — 11:07pm",
      "content": "dont take it personal, but its awful. Experimental, yes. but horrible.   \nif this was your intention, then good for you   \n   \ni hope they dont thrown me out of this very politically correct forum but its my heart right out....\n\n"
    },
    {
      "time": "18 Jan 2003 — 12:03am",
      "content": "Actually, I'd say the font fits your sample use quite well. Readable enough to elucidate the ideas of the text, but disruptive enough to slow the reader and encourage further thought. This will work great for pull-out quotes and other short settings.   \n   \nYour **a** is just right, toeing the line between roman and italic forms. While not entirely legible, it's easily readable and, to my mind, works well.   \n   \nI very much like how the **t** combines with the **h** , where the swash of the **t** seems to complete the stem of the **h**.   \n   \nResist the urge to normalize this font by evening the baseline. The sample settings escape the feel of bars of text, enriching the sprawling organic feel of the character shapes.\n\n"
    },
    {
      "time": "18 Jan 2003 — 8:14am",
      "content": "In Response to Victors comment :   \n   \n\"dont take it personal, but its awful. Experimental, yes. but horrible. if this was your intention, then good for you\"   \n   \nYour comment says very little. Maybe you could elaborate on \"horrible\". Also, try to imagine this font in a complimentary setting. Someone made a comment earlier about it having a Tim Burton feel... there's a saying in art: There are no ugly colors, only combinations.   \n   \n\"i hope they dont thrown me out of this very politically correct forum but its my heart right out...\"   \n   \nIt's more about being coutreous/constructive than being politically correct. Criticism is what the critiques are all about, but I'm pretty sure that they're more about the constructive kind than just saying that something is awful without an explanation.\n\n"
    },
    {
      "time": "20 Jan 2003 — 5:14am",
      "content": "Thanks for your comments, guys.   \n   \nVictor: Heh heh heh.... I'm not offended. I figured out long ago that my taste in type is very different than most others' here. You were probably saying bluntly what a lot of other people were thinking.   \n   \nBut as Craig mentioned, Victor, there is an art to critique that generally involves backing up your comments -- both positive and negative -- by explaining your thought process. That is usually a lot more helpful to the critiqued individual.   \n   \nThanks and have a great day.\n\n"
    }
  ]
}
