{
  "id": "2486",
  "title": "Benton Sans vs. News Gothic",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "How is it that 100 years later, News Gothic is still as fresh as it ever was. It's quite possibly the best workhorse sans ever. (No really.) Lots of people have digitized it (Linotype, URW, Elsner & Flake, Adobe, Bitstream -- the latter being my usual fallback).   \n   \nSo, now [The Font Bureau](http://web.archive.org/web/20150417022507/http:/www.fontbureau.com/) offers the latest addition, [Benton Sans](http://web.archive.org/web/20150417022507/http:/www.fontbureau.com/). With 21 weights and styles it could be everything I ever wanted from News Gothic.   \n   \nAccording to the FB site, Cyrus Highsmith collaborated with The Font Bureau designers in the production and the project was originally started by Tobias Frere-Jones in 1995.   \n   \nI haven't gotten my hands on it enough to know firsthand, but I wonder how much of the design is true to to the News Gothic I've grown to love and how much of it is an interpretation of Benton's other sketches and/or work.   \n   \nAre you as anxious as I am to test out this face? Will this do to News Gothic what FF DIN did to reg'ler DIN? Or what Helvetica Neue did to Helvetica olde.\n\n",
  "author": "Joe Pemberton",
  "time": "19 Dec 2003 — 6:41pm",
  "uid": "1160",
  "comments": [
    {
      "time": "20 Dec 2003 — 6:59am",
      "content": "Speaking of custom versions of News Gothic, Typophiles who attended either of the Linotype TypoTechnica events at the Print Media Centre in Heidelberg might have noticed this:   \n ![Heidelberg Gothic](http://web.archive.org/web/20150417022507im_/http:/www.typophile.com/forums/messages/4100/22750.gif)\n\n"
    },
    {
      "time": "20 Dec 2003 — 1:56pm",
      "content": "The first batch of FB Benton (then Benton Gothic) also   \nhad an italic. More of a tuned oblique really, nothing   \nlike the image above.\n\n"
    },
    {
      "time": "21 Dec 2003 — 12:38am",
      "content": "_The first batch of FB Benton (then Benton Gothic) also had an italic. More of a tuned oblique really, nothing like the image above._   \n   \nThe Heidelberg Gothic italic is a strange hybrid. Erik Spiekermann was art directing the project as part of his overall design for Heidelberg Drucksmachinen. My initial italic was a bit more 'normal' -- e.g. fully cursive e -- but Erik wanted it more idiosyncratic. One of the nice things about this project is that the typeface is _always_ incredibly well printed ![:-)](http://web.archive.org/web/20150417022507im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "21 Dec 2003 — 5:51am",
      "content": "Joseph --   \n   \nI don't actually have access to the fonts themselves, so I can't provide your request. I grabbed those images from the PDFs. I see that the Benton Gothic web page is no longer found through the FB front door. But it seems the PDF is still hiding on the server. So, you can still grab the Benton Gothic PDF for yourself [here](http://web.archive.org/web/20150417022507/http:/www.fontbureau.com/images/specimen/pdf/BentonGothic.pdf) and compare for yourself.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "19 Dec 2003 — 6:51pm",
      "content": "Aww, you usurped the discussion at my place, meanie! It was   \ninadvertent, I'm sure. And I've swiped from Typophile plenty.   \nSo never mind.   \n   \nI think Benton Sans (or Gothic as it was called in the previous   \nFB catalogs) has done well as a magazine face simply   \nbecause it offered more cuts. Mags require a lot of styles.   \nI'm not sure I see enough of a difference from the onscreen   \npreviews to determine whether the design itself is reason   \nfor picking it over News Gothic. I think it's merely the new flexibility.   \n   \nI'll print the PDF soon to have a closer look. They really need   \nto offer a text sampling PDF too.\n\n"
    },
    {
      "time": "20 Dec 2003 — 12:01am",
      "content": "Didn't mean to usurp. Maybe it's subconscious now, but I always know in the back of my mind that I should post stuff quickly, without looking over my shoulder at Typographi.ca or MS Typography or Speak Up for that matter. =)   \n   \n(Great minds think alike.)\n\n"
    },
    {
      "time": "20 Dec 2003 — 9:54am",
      "content": "Thank you for clearing me up, Kent.   \nJoe - no worries at all.\n\n"
    },
    {
      "time": "20 Dec 2003 — 11:51pm",
      "content": "Kent, thanks for the great insights. Funny how something so subtle can be so striking when your eye is tuned to see it. Also, thanks for the images. (You posted what I couldn't.) Also, you've confirmed my suspicion about News Gothic versus a broader interpretation of Benton's body of work... (Who among us now will be the subject of future designers' tinkering.)   \n   \nCan I trouble you for a posting of the roman/regular weight of each. (Hamburgevons or handgloves or whatever.) (Pretty please with a tilde on top?)   \n   \nOh, and Stephen, of course not. =)\n\n"
    },
    {
      "time": "22 Dec 2003 — 1:56pm",
      "content": "FYI ---\\> At least one version of this font was used at Martha Stewart Living.\n\n"
    },
    {
      "time": "26 Dec 2003 — 12:50pm",
      "content": "Good thing Highsmith took over - Frere Jones seem to make all of his recent work out of the Interstate font, making everything look the same...\n\n"
    },
    {
      "time": "20 Dec 2003 — 5:59am",
      "content": "Stephen --   \n   \nIt's not quite precise to say that Benton Sans was previously called Benton Gothic, as the two remain slightly different families. Benton Gothic was the original family of styles developed for various corporate customers, under Frere-Jones's guidance.   \n   \nThe design family was reworked under Cyrus's direction for retail release. As you might imagine, when a series is developed piece-meal for a variety of clients, each with particular needs, the family may develop some idiosyncracies and inconsistencies across the spectrum. So (I was told) the FB team wanted to harmonize the family and revise it slightly for this release -- hence the new name.   \n   \nYou'll notice that the range of weights and styles is slightly different between the two. The earlier Benton Gothic has seven weights from Thin to Black and only two widths. Benton Sans has eight weights from Thin to Black and four widths. So right away, things will be different.   \n   \nAt a more subtle level, there are small differences that, to my eye, betray the Highsmith touch. Here is one of the more obvious examples, Benton Gothic Black Condensed and Benton Sans Black Condensed:   \n   \n ![Benton 'a' comparison](http://web.archive.org/web/20150417022507im_/http:/www.typophile.com/forums/messages/4100/22743.gif)   \n   \nThe differences lie mostly in the curves of the \"shoulder\" and \"belly\". Subtle; but to me, I can just see the two designers, clear as day -- Tobias on the left, Cyrus on the right. It just jumped out at me when I first looked at the new release specimen.   \n   \nJoe --   \n   \nIf I recall correctly, Tobias spent a bit of time looking at a whole bunch of Benton's original work at the Smithsonian -- not just News Gothic, but Franklin Gothic and all the others as well. As a result, the Benton Gothic family was not meant so much as a reinterpretation of News Gothic specifically, so much as a sort of \"Benton gestalt\".   \n   \n-- K.\n\n"
    }
  ]
}
