{
  "id": "2498",
  "title": "Web Hosting: Who Can You Recommend?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I'm in need of a new web hosting solution for 2004 and, at present, looking at [www.mediatemple.net](http://web.archive.org/web/20071009143609/http:/www.mediatemple.net/). Their $10/month deal seems to be all I need. And I get some comfort when I read about their facility being virtually nuke-proof.   \n   \nAnyone here use 'em? Or can you heartily recommend a trustworthy hosting solution?\n\n [‹ Food for thought](http://web.archive.org/web/20071009143609/http:/typophile.com/node/2591 \"Go to previous forum topic\") [Illegal usage, prosecting stories.. ›](http://web.archive.org/web/20071009143609/http:/typophile.com/node/2622 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071009143609/http://typophile.com/user/1022\" title=\"View user profile.\">dylan</a>",
  "time": "<br>",
  "uid": "1022",
  "comments": [
    {
      "time": " 21.Dec.2003 8.26pm",
      "content": "[www.warped.net](http://web.archive.org/web/20071009143609/http:/www.warped.net/) is as low as $5 a month, and they're very reliable and attentive. There's a special now where the first month is free. If you use them, tell them I referred you (my username is cerulean) and I'll save a fiver also.\n\n"
    },
    {
      "time": " 21.Dec.2003 8.51pm",
      "content": "I'm actually gathering steam to move from Hostway (avoid   \nlike the plague), and I'm favoring: [http://www.netfirms.com/](http://web.archive.org/web/20071009143609/http:/www.netfirms.com/)   \n   \nBut Warped seems worth a look too.   \nGet Kevin to give you 50% of his finders fee for you to sign up. ;-\\>   \n   \nhhp\n\n"
    },
    {
      "time": " 21.Dec.2003 9.04pm",
      "content": "I have used http://www.portland.co.uk for a couple of years and they are **FREE** and very reliable with no advertising.   \n   \nCheck them out.   \n   \ngln   \n   \n   \nCaution: this posting may contain traces of nut.   \nPosted with 100% post-consumer recycled electrons.\n\n"
    },
    {
      "time": " 22.Dec.2003 12.03am",
      "content": "Can't really say anything about the service because I'm not hooked up yet, but I'm currently looking at going with POWweb (quite possibly the worst ending to a name brainstorming session ever). [POWweb Link.](http://web.archive.org/web/20071009143609/http:/www.powweb.com/) Their package seems to be pretty awesome for only $7.77 per month, with tons of storage, bandwith, etc. The only complaint I've heard from some current users is that they have some downtime and their support takes a little bit to reply. Otherwise, if you know what you're doing and don't need to be walked through, POWweb is supposed to be great.\n\n"
    },
    {
      "time": " 22.Dec.2003 12.04am",
      "content": "A friend has been using [http://www.pair.com/](http://web.archive.org/web/20071009143609/http:/www.pair.com/) for a couple of years now, and has found them to be really excellent. She's been on the Internet since before the World Wide Web existed, and thinks Pair is the best ISP she's seen in all those years.\n\n"
    },
    {
      "time": " 22.Dec.2003 3.36am",
      "content": "I have hosted at Pair for over a year now (on the recommendation of Dean Allen at Textism), and they are reliable, quick, have great online management tools and I have to agree with Mr Hudson's friend - they're great.\n\n"
    },
    {
      "time": " 22.Dec.2003 11.48am",
      "content": "I third the recommendation for Pair. I've never had a problem with them, they have a good range of packages/features, prices are terrific, and they're good for geeks and novices both. Like John's friend, I've been on the 'net since before the Web and have worked with quite the gamut of hosts. Pair rocks.   \n   \nAlso, do heed Hrant's caution about Hostway -- blech. Stay away from Verio, too. As for free web-hosts: I'd be wary, as you have little recourse if something goes wrong or you need special assistance.\n\n"
    },
    {
      "time": " 22.Dec.2003 11.54am",
      "content": "I quite like my current host, [cyberpixels](http://web.archive.org/web/20071009143609/http:/www.cyberpixels.com/). Despite the \"tr3ndy\" name, the prices are very good and so is the service.\n\n"
    },
    {
      "time": " 22.Dec.2003 11.54am",
      "content": "I'm definitely not interested in the free stuff. I'm a firm believer in 'you get what you pay for' (with love being the exception, but let's not derail this post, eh?). I'll give Pair a look. Thanks, all.\n\n"
    },
    {
      "time": " 22.Dec.2003 4.07pm",
      "content": "Lots of satisfaction from Cornerhost -- [http://www.cornerhost.com/](http://web.archive.org/web/20071009143609/http:/www.cornerhost.com/) -- a down-to-earth host with an accessible, personable, responsible admin, at a reasonable rate.\n\n"
    },
    {
      "time": " 22.Dec.2003 4.50pm",
      "content": "I will drop in a nod to Hurricane Electric. The cost is fairly competitive ($9.99). Service good. And they have php/mysql support at the base level. Don't know if that's important to you, but for me it has been great to drop my stock CMS system on a shared host website.   \n   \nRandy\n\n"
    },
    {
      "time": " 22.Dec.2003 5.19pm",
      "content": "As long as there is an \"avoid like the plague\" sidebar, I will mention Gisol (Global Internet Solutions). They belong in jail.   \n   \nThe selling point of Warped is that you pay for what you get. If you are slashdotted and see a huge spike in traffic, other places usually ask you to upgrade to a higher-limit plan from then onward. At Warped, your bill would be $10 instead of $5 _just for that month._   \n   \nAlso, there is no obscenity clause in Warped's terms of service. Even when it isn't necessarily relevant, knowing I don't have to worry about running afoul of someone's \"community standards\" is peace of mind to me.\n\n"
    },
    {
      "time": " 22.Dec.2003 10.20pm",
      "content": "Media Temple is definitely worth their slightly higher prices because they're rock solid, and have 24hr phone support.   \n   \nI currently have two sites on their servers, a transfer I made after a bad run-in with Stargate. Maybe it was just by comparison, but I can't get over how professional and customer-oriented these guys are. I mean, just look at their company website.\n\n"
    },
    {
      "time": " 22.Dec.2003 10.49pm",
      "content": "I am currently hosted with ' [Eurodomein](http://web.archive.org/web/20071009143609/http:/www.eurodomein.net/)' / Sjeufit, in Amsterdam, The Netherlands, and I am, currently, for the very first time, really happy with my web hosting.. ( And you dont really have to be able to speak dutch to communicate with them.. ![:-)](http://web.archive.org/web/20071009143609im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n [http://www.eurodomein.net](http://web.archive.org/web/20071009143609/http:/www.eurodomein.net/)   \n   \n( And, If you happen to sign up with them, maybe you want to tell them I / 'formlos' sent you.. ![:-)](http://web.archive.org/web/20071009143609im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " 22.Dec.2003 11.09pm",
      "content": "readyhosting.com   \n   \nbest ive seen.   \nthey pay your domain name as long as you stay with them, and its $99 bucks a year, thats like 8 something a month, BUT you get lotsa stuff, their reliable, and they pay your name fee.   \n   \n\"and tell em LARGE MARGE SENT YA!!\"\n\n"
    },
    {
      "time": " 23.Dec.2003 12.29pm",
      "content": "[http://www.dreamhost.com](http://web.archive.org/web/20071009143609/http:/www.dreamhost.com/)   \n   \npricing is unbeatable. good service and options.\n\n"
    },
    {
      "time": " 23.Dec.2003 7.07pm",
      "content": "I would never let a host register a domain for me - it almost always ends in confusion.\n\n"
    },
    {
      "time": " 24.Dec.2003 4.14am",
      "content": "I run a mountain biking e-zine in my spare time. We get about 30-50,000 unique users per month and transfer around 50 gigs each month too. We had been hosting with someone who had a server on RackSpace, but they've become pretty unreliable, so I think we'll head over to Pair. It looks like a good solution.\n\n"
    },
    {
      "time": " 24.Dec.2003 7.36am",
      "content": "I second [http://www.dreamhost.com](http://web.archive.org/web/20071009143609/http:/www.dreamhost.com/)   \n   \nI use both dreamhost and mediatemple. Dreamhost now has a lot more, i've used them for about 4 years, very reliable. The only thing missing is some php extensions.   \n   \nnic\n\n"
    },
    {
      "time": " 24.Dec.2003 1.44pm",
      "content": "Nic, you weren't by some coincidence part of Swankarmy were you. I only ask because I was (briefly) and Dreamhost hosted them, they gave very good deals to members at the time.   \n   \nAnyway, I second any recomendation of Dreamhost as well; I've been using them for various things for about four years.   \n   \n   \n\\_\\_\\_\\_   \nNick\n\n"
    },
    {
      "time": " 24.Dec.2003 4.52pm",
      "content": "Nope sorry Nick.\n\n"
    },
    {
      "time": " 24.Dec.2003 6.31pm",
      "content": "I like [Shanje](http://web.archive.org/web/20071009143609/http:/www.shane.com/). Yes a little pricy but look at what you get: 1 gig of storage space, up to 75 websites, and 10gb of bandwidth per month. What i do is share it with several friends and the cost goes down considerably.   \n   \nI'm curently on an older plan and havn't upgraded to their new widoze Server 2003 that they are advertising here yet. But I've been pretty happy with that and assume this is even better.   \n   \nI'd switch over but it means havng to reupload all of the sites that are under my name and that will be a pain trying to coordinate it all.   \n   \nAnd no i don't get any commission for new customers ;)\n\n"
    },
    {
      "time": " 8.Jan.2004 12.06am",
      "content": "We use [westhost](http://web.archive.org/web/20071009143609/http:/www.westhost.com/).   \n   \nThree years with no down time. Cheap, reliable, good badwidth, and support for most server technologies.\n\n"
    }
  ]
}
