{
  "id": "2500",
  "title": "A little help.",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "I'm thinking about trying to create my first pixel font and I was just hoping I could get some tips and tricks from the pros. Anything that might help me get started and create something worthwhile would be extremely helpful.   \n   \nAs well, I've seen post after post in this forum commenting on good grays, grayplay, etc. Could someone explain this, and how to create it?   \n   \nThanks.\n\n",
  "author": "down",
  "time": "22 Dec 2003 — 12:29am",
  "uid": "2744",
  "comments": [
    {
      "time": "22 Dec 2003 — 8:47am",
      "content": "Hi Myke. I dont know but i believe that with the greyplay fonts you are must be talking to the greys that a not filled pixels,figures like my curves. I can get at the same time Print unique details, as a display font plus a diferent kind of greys, it looks like it works great to view it small in any screen as a postcript or truetype font. Look at the Flash & Photoshop preview of my Ohiggins..\n\n"
    },
    {
      "time": "22 Dec 2003 — 9:06am",
      "content": "Choosing the right grays (2 is good, 5 is too many) is probably the single most important tangible decision you'll make. The other \"secret\" is getting in the groove of grayscale design: it has elements of both b&w and (to a lesser extent) outline font creation, but it requires its own mindframe too.   \n   \nBTW, Luciano, your Flash stuff isn't coming out at 100% magnification (at least not on my end), so everything is super blurry.   \n   \n--   \n   \nSo you guys like \"grayplay\", eh? :-)   \nThe way I'd like to use it though isn't to mean just grayscale font design; \"grayplay\" is the use of gray pixels to simulate subtleties, like lightening of joins and bending of stems.   \n   \nhhp\n\n"
    },
    {
      "time": "22 Dec 2003 — 12:23pm",
      "content": "How do you create gray pixels in font design? I thought everything was either on or off. I had no idea you could do \"textured\" fonts.\n\n"
    },
    {
      "time": "22 Dec 2003 — 9:19pm",
      "content": "Hrant save the swf file on your pc. I noticed a difference between the Pshop version and the flash version.\n\n"
    },
    {
      "time": "23 Dec 2003 — 8:50pm",
      "content": "Myke, take a look here   \n [http://www.fontsforflash.com/](http://web.archive.org/web/20150414064412/http:/www.fontsforflash.com/) (Super Pixel Fonts)   \nand here.   \n [http://www.truthindesign.com/gray-cell.html](http://web.archive.org/web/20150414064412/http:/www.truthindesign.com/gray-cell.html)   \n   \nI would start by painting the font you want, and try this 'greyplay' as they call it. Seek the right grey between Black and White. Photoshop or any similar program is good for this. Then build the font.   \n   \n---   \nWhenever I drop a swf file into a browser, it enlarges to the browser window. o'higgins got all blurry. Does anyone know how to view swfs correctly without having to resize the window.\n\n"
    },
    {
      "time": "23 Dec 2003 — 9:52pm",
      "content": "Save it on your pc then view it. If you use Mozilla firebird right click and select save link to disk.\n\n"
    },
    {
      "time": "24 Dec 2003 — 6:37am",
      "content": "it's also possible to create fonts with colored and/or transparent pixels through the [photofont](http://web.archive.org/web/20150414064412/http:/www.photofont.com/) technology...   \n   \nhas anyone tried this out...?   \n   \n-g.\n\n"
    }
  ]
}
