{
  "id": "251",
  "title": "Shard",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hello everyone. I happened upon this site a week ago, and I must say I enjoy looking at all the original logotypes and custom lettering. So much so that I felt like dusting off an old project.   \n   \nThe loose name for the face is Shard. It is not done yet, and it needs Caps. I thought I'd turn to the online type community for inspiration.   \n   \nBtw, I am without $549 at the moment to buy Fontlab, any other way I can turn this into a font from an EPS file?   \n   \nThanks much,   \nAndrew Baker   \n   \n ![shardlite.jpg](http://web.archive.org/web/20131017082217im_/http:/www.typophile.com/cgibin/board-post.pl?action=posting_upload_form&what=show&img=11233)\n\n",
  "author": "andrew_baker",
  "time": "28 May 2003 — 1:12pm",
  "uid": "1864",
  "comments": [
    {
      "time": "28 May 2003 — 1:28pm",
      "content": "this is a cropping from a poster i did   \n ![](http://web.archive.org/web/20131017082217im_/http:/www.typophile.com/forums/messages/29/11245.gif)\n\n"
    },
    {
      "time": "28 May 2003 — 1:37pm",
      "content": "Ebay has fontographer for sale   \n [here](http://web.archive.org/web/20131017082217/http:/search.ebay.com/search/search.dll?cgiurl=http%3A%2F%2Fcgi.ebay.com%2Fws%2F&krd=1&from=R8&MfcISAPICommand=GetResult&ht=1&SortProperty=MetaEndSort&query=fontographer/)   \n   \n   \n$42.00   \n   \nThere's also a book to go with it, courtesy   \nof Stewf. That'll cost you a little bit more.   \n   \nbj\n\n"
    },
    {
      "time": "28 May 2003 — 1:39pm",
      "content": "As far as the font, it's very cool.   \n   \nLooking forward to the UC.\n\n"
    },
    {
      "time": "28 May 2003 — 3:55pm",
      "content": "thanx for the link, BJ   \n   \nI am going to start drawing UC when I get some time.   \n   \nPlz feel free to post your likes/dislikes about the font. I want to improve it as much as possible.\n\n"
    },
    {
      "time": "29 May 2003 — 6:51am",
      "content": "This is nice. I'm not sure what i'd use it for, but   \nit's still nice. The only comment I'd make is   \nthat your numerals look too bland compared   \nto the lc. So much, that it looks to me like a   \ndifferent font. Add some of the \"shard-ness\" or   \nwas that \"sharditude,\" to them.   \n   \nOn the other hand...   \nI'd say your lc is just right. Yes there are   \nsome characters that have less of the   \n\"shardification,\" but i tend to feel like less   \nweirdness is better because it makes a font   \nmore usable/readable (particularly in a lower   \ncase) . Otherwise it becomes really difficult to   \nread and really narrow in it's application   \n(klingon spaceship lettering only :-). You've got   \nit right here IMHO.   \n   \nIf you want, I'd think more of the caps could be   \n\"shardical.\"   \n   \nGood luck   \nrandy   \n   \nOh... shard is also just the right name.\n\n"
    },
    {
      "time": "29 May 2003 — 7:18am",
      "content": "Thanks Randy, some criticism I can chew on!   \nI will work on making the numerals more 'Shardical'.   \n   \nAndrew\n\n"
    },
    {
      "time": "29 May 2003 — 8:04am",
      "content": "The 'd' is wonderful, as well as p and q, and I like your round letters generally. I think there is a problem with the junctions in the vertical letters, especially in 'f' and 't' where readability is affected.   \n   \nIs the problem that the bottom of the left vertical on h m n etc is too fat? That the cut at the joint is too deep?   \n   \nIs the 'southwest' part of the e and c too fat?   \n   \nI suspect the bottom of the 'l' either straight or like the right bottom of h will look more harmonious.   \n   \nI think that your round letters are so original and good that making the vertical ones more harmonious with them will result in a very useful display face. Even if the vertical are more conventional, but harmonious, the look will still be very original and intriguing.   \n   \nI am a beginner so listen to the pros, but I think you have a gem that is still half in the rough.\n\n"
    },
    {
      "time": "29 May 2003 — 4:08pm",
      "content": "Thanks William! I will take your comments into consideration. I also plan to put words up at some point.   \n   \nAndrew\n\n"
    },
    {
      "time": "30 May 2003 — 9:05am",
      "content": "Andrew, I strongly recommend you not buy Fontographer. Instead buy the $199 [Scanfont](http://web.archive.org/web/20131017082217/http:/fontlab.com/html/scanfont.html) from Pyrus, which comes bundled with TypeTool 2.0, a light version of FontLab that still matches or exceeds Fontographer. Once you need the added power of FontLab, they'll sell you an upgrade at a reduced price. It's really the best family of products if you're new at this.   \n   \nTelling a newbie to buy Fontographer is like telling them to buy Ikarus. You're not doing them any favors.\n\n"
    },
    {
      "time": "30 May 2003 — 11:18am",
      "content": "\\>\\> Telling a newbie to buy Fontographer is like telling them to buy Ikarus. You're not doing them any favors.   \n   \nJohn, c'mon I saved him $157!   \n   \nSeriously, for a hobbyist type designer with a penchant for display fonts made in a vector environment\n\n"
    },
    {
      "time": "30 May 2003 — 11:47am",
      "content": "Fair enough, $42 for Fog is pretty cool, assuming that's what it finally sold for. But I would still not recommend it for someone brand new to the craft who hasn't had his UI preferences skewed toward The Fog Way.   \n   \nHe should at least download the TypeTool demo and see if he likes it better.   \n   \nBy the way, Shard is a pretty good design, so if he's going to get started in this, he might as well try starting in TypeTool.   \n   \n:-)\n\n"
    },
    {
      "time": "24 Jun 2003 — 10:56am",
      "content": "I sat down on Sunday and did a little sketching... Here are some letterroughs.   \nComments always appreciated.   \n   \nAndrew   \n   \n ![](http://web.archive.org/web/20131017082217im_/http:/www.typophile.com/forums/messages/29/12165.gif)\n\n"
    },
    {
      "time": "30 Jul 2003 — 1:51pm",
      "content": "Some of the capitals you've drawn are very good sketches. Especially the C, D E and F.   \nFor the G, try to keep it consistent with the C. The same goes for B and R.   \nIf the idea behind Shard is to have a pretty good deal of anarchy among letters, you're always in time to add it later.   \nOut of experience I can tell you it's always best to keep an internal consistence among letter parts. Then, you may change many of them and introduce the desired degree of randomness.   \nMaybe after the summer I should post a typeface I started in 1999, full of hydiosincracies and with a wide array of influences. Usually I find uncomfortable to discuss in public, and I prefer single discussion with each one of friend and colleagues, but I got stuck at least two times with that face: it's too varied.   \n   \nBut since Barry Deck pretty liked it (his Eunuverse was one of the initial influences) I might find useful any imput.   \nI said this because, in some ways, Shard has problem(s) similar to the ones I find in my own freezed typeface.\n\n"
    },
    {
      "time": "30 Jul 2003 — 8:23pm",
      "content": "I, also, think that this face has tons of potential. While looking at the l.c., I wonder if you have considered reconciling the ascenders of b, d, h, and k? More specifically, could the ascender of the d (which is a handsome character) work if inverted horizontally to match that of b, h and k?   \nAlso, when setting your characters in rather short entries (headlines, etc.), is a \"font\" absolutely necessary at this time? Could the letters be placed carefully in a vector drawing program and then imported into the final application of choice? Yes, I know, quite a bit of labour... but in the short term, this procedure might replace the absolute necessity of purchasing a font-building program... until you have more coin.\n\n"
    },
    {
      "time": "31 Jul 2003 — 10:28am",
      "content": "I finished all the caps, but opted not to post.   \nDue similarly to the reasons stated by Claudio, the caps were too inconsistent. A type Professor who I show my work to advised me to start afresh on something more traditional.   \n   \nThank you all for your comments. I'm going to put shard away until I understand typography a great deal more.   \n   \nBTW, I have a copy of Fontlab now, and it looks complicated.   \n   \nPeace,   \n   \nAndrew\n\n"
    },
    {
      "time": "31 Jul 2003 — 10:50am",
      "content": "\\> something more traditional   \n   \nScrew that.   \nI think Shard needs a lot of work, but don't waste too much time imitating dead people.   \n   \nhhp\n\n"
    },
    {
      "time": "31 Jul 2003 — 2:45pm",
      "content": "well, here's what I've been working on. ![](http://web.archive.org/web/20131017082217im_/http:/www.typophile.com/forums/messages/29/13528.gif)\n\n"
    },
    {
      "time": "1 Aug 2003 — 1:33am",
      "content": "Hi Andrew,   \nfirst: who is your type professor?   \nsecond: You seem quite able in sketching, why don't you use this and really start up from scratch to answer your professors demand (if you really want to answer it!). I am saying this, because the last sample you showed us is not as good as shard. Try sketching on different ways 'hamburgerfontsiv' and the digitalize it. For example with Illustrator. You'll see that you'll come up with more interesting results and you might even start to understand 'typography' quicker as you mighth think so.   \nThird: In your last post your have mixed up several styles. Beware. Typography can be about concistance, sometimes combined with small irregularities.   \n   \n---Jacques\n\n"
    },
    {
      "time": "1 Aug 2003 — 6:20am",
      "content": "Jacques, I know that drawing my letterforms by hand is what i should be doing. So why dont I do it? I am stubborn. Hand-drawing for good results requires much practice, and I am impatient and want to dive in.   \n   \nJohn Langdon was my professor at Drexel and not surprisingly he tells me the same thing. To draw to a refined form before I digitize. I keep saying that I will, but I dont.   \n   \nYou can see his work at [www.johnlangdon.net](http://web.archive.org/web/20131017082217/http:/www.johnlangdon.net/)\n\n"
    },
    {
      "time": "1 Aug 2003 — 7:06am",
      "content": "Hi Andrew,   \n   \nI think you should continue with Shard. See, the lowercases are really nice. I respectfully disagree with your teacher, who asked you to draw more tradicional characters. The lowercases are far from traditional designs, so should be the uppercases.   \n   \nAlso, about drawing sketches... to me it's something very particullar the way we design. That's not a rule that you have to draw all characters on paper. I respectfull typefoundry I know, sketches just main letters like \"n\" and \"o\" and do the rest directly at Fontographer.   \nOne think I'm sure, no matter if we design type with hand or mouse, the most important are our eyes.   \nFabio\n\n"
    },
    {
      "time": "1 Aug 2003 — 7:37am",
      "content": "That new \"conventional\" design is only useful for practicing certain skills in type design - otherwise neither the culture nor the market of type design need it.   \n   \nJohn Langdon is a talented letterer more than a type designer.   \n   \nThere is no real requirement of drawing on paper first (although that's how I do it myself). Although it can be argued that drawing software has yet to be made as compatible with the human hand as the pencil (and not the fancy broadnib pen - I'm talking about drafting, not chirography), one should also note that the very best designers (like Carter) draw directly on the computer. So it seems to be a matter of personal affinity as well as getting used to it.   \n   \nhhp\n\n"
    },
    {
      "time": "1 Aug 2003 — 8:13am",
      "content": "Fabio, sorry for the miscommunication. What he had advised is not a more traditional approach with Shard in particular, but to put it aside and experiment with something less unique. I took this to mean \"more traditional\". Maybe I mispoke.   \n   \nHrant, I suspect Carter has had his share of drafting experience under his belt, and now works exclusively digitally? I'm just one year out of design school. Realistically, I wonder if I can be expected to work competently digitally.   \n   \nI think I may have jumped to digital too quickly given my knowledge of type, hence the noticeable inconsistencies of my designs. I find the constant reworking on paper more frustrating to deal with than tinkering with glyphs on a computer. Probably I just ignore my mistakes much easier on computer where I cannot on paper?   \n  \nAndrew\n\n"
    },
    {
      "time": "1 Aug 2003 — 8:22am",
      "content": "Also, Hrant, how do you approach a new design?   \nWhat is your process?\n\n"
    },
    {
      "time": "1 Aug 2003 — 8:32am",
      "content": "I'm probably not the best person to ask...   \n   \nI'd recommend starting a new thread in General Discussion with this question posed to everybody.   \n   \nhhp\n\n"
    }
  ]
}
