{
  "id": "2519",
  "title": "Fred Smeijers type now?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "has any one read his newest book?   \nalso what can you say about it?\n\n",
  "author": "isaac_b",
  "time": "23 December, 2003 - 6:03pm",
  "uid": "2544",
  "comments": [
    {
      "time": " 23 December, 2003 - 8:14pm",
      "content": "What is his newest book?\n\n"
    },
    {
      "time": " 23 December, 2003 - 11:00pm",
      "content": "the title is \"type now\" you can find it @ [www.typotheque.com](http://web.archive.org/web/20051126091029/http:/www.typotheque.com/) sorry about that..\n\n"
    },
    {
      "time": " 23 December, 2003 - 11:10pm",
      "content": "A font friend recently sent me copies of parts of it, to help me figure out if I should buy it or not. I haven't read much of it yet, but just so you know it seems to be more of an informal discussion type thing (as opposed to something that addresses the techniques of design). So it's essentially more free-form and ideological than counterpunch, but of course anything that helps see inside the head of such a good designer is valuable. And it makes me want to write more.   \n   \nhhp\n\n"
    },
    {
      "time": " 24 December, 2003 - 7:31am",
      "content": "I read already \"Type Now\". I strongly recommend the book. You can agree or not with some of the Smeijers's statements, but the arguments are serius and solid.   \nMy review will be published soon in \"Tipografica\" magazine (I hope so... ha!)\n\n"
    },
    {
      "time": " 24 December, 2003 - 10:28am",
      "content": "Something else: I realized this morning that my copies are the entire first section (\"Type Now; a manifesto\") and none of the second part (\"work so far\", and more than half the book in pages). I assume the second part is an extensive type specimen.   \n   \nhhp\n\n"
    },
    {
      "time": " 24 December, 2003 - 11:35am",
      "content": "Ramiro, what do you think of the way Smeijers (and by extension GN) uses the term \"rhythm\"?   \n   \nhhp\n\n"
    },
    {
      "time": " 27 December, 2003 - 4:23pm",
      "content": "Mmmmmhhhh... I am just a \"grasshopper\" in the monastery. I am not qualified indeed to critic the teachings of the Masters. ;)\n\n"
    }
  ]
}
