{
  "id": "252",
  "title": "Old logos you would like to see redone...",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "you know the ones...the logos that are burned into the sublayering of your grey matter, but yet, they seem tired and well, old   \n   \ni can think of a few but here is my top list of candidates:   \nCoke   \nPepsi   \nChevy   \nhonda   \nnike   \nespn   \n   \nand firstly: ABC\n\n",
  "author": "freehand_guru",
  "time": "29 May 2003 — 8:25am",
  "uid": "1795",
  "comments": [
    {
      "time": "3 Jun 2003 — 5:04am",
      "content": "I would NEVER change Nike or Coca-Cola...\n\n"
    },
    {
      "time": "3 Jun 2003 — 6:18am",
      "content": "UPS is long overdue for a re-design.   \nI don't think the parcel and string really   \nrepresent the multi-faceted offering   \nof this forward thinking company. Not   \nto mention string has been forbidden   \non packages for over a decade.   \n   \n:-)) sorry, couldn't help myself.\n\n"
    },
    {
      "time": "3 Jun 2003 — 6:31am",
      "content": "Randy\n\n"
    },
    {
      "time": "3 Jun 2003 — 8:09am",
      "content": "Peter, spot of sarcasm there.   \nSorry, carry on.   \n   \nRandy\n\n"
    },
    {
      "time": "5 Jun 2003 — 12:22pm",
      "content": "In Soviet Russia, the Real Thing beats you!\n\n"
    },
    {
      "time": "6 Jun 2003 — 2:23pm",
      "content": "i agree with the anonymous post. being an old logo doesn't justify a redesign. as long as the logo is still a good represenation of the company why change it? especially when the logo is as established as those you listed?   \n   \noff the top of my head the only logo i can think of in need of a facelift is AAA.\n\n"
    },
    {
      "time": "6 Jun 2003 — 2:25pm",
      "content": "sorry...i can't spell representation!\n\n"
    },
    {
      "time": "10 Jun 2003 — 11:57am",
      "content": "the IBM trademark needs to be changed. Paul Rand may have been a conceptual power house but he had weak typography skills. the UPS and Westinghouse marks were the best he did and even they are only ok.\n\n"
    },
    {
      "time": "10 Jun 2003 — 12:01pm",
      "content": "Jay said...   \n_a conceptual power house but he had weak   \ntypography skills._      \n   \nI'm glad someone said it!\n\n"
    },
    {
      "time": "10 Jun 2003 — 12:11pm",
      "content": "troll i'm not... honest i am.   \n   \ni sound like yoda there and he's kind of a troll so maybe i am a troll after all. ![:-)](http://web.archive.org/web/20131018023751im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nplain clothes, i'm glad someone else agrees. now i've just got to get you on the helvetica side of things. \\<joke\\> ![:-)](http://web.archive.org/web/20131018023751im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "12 Jun 2003 — 6:54pm",
      "content": "My comments:   \n   \nCoke - not the script, anything else I'm ambivalent to   \nPepsi - not the ying-yang-like mark, but if they want to continue the \"taste of the new generation\" gig, they need to keep redoing the wordmark   \nChevy - what would be the point?   \nhonda - bland, but not dated   \nnike - definitely not! this logo still looks cool and fresh, and there is no wordmark per say, so they can combine it with different settings of \"nike\" to change the look   \nespn - definitely dated, but recognizable   \nABC - it's dated, but it still works just fine\n\n"
    },
    {
      "time": "20 Jun 2003 — 6:10am",
      "content": "change the coke logo? the epitome of logo? hell, no! they may change whatever they want to, but the coke logo should stay untouched. forever. if you ask me. some logos become more valuable the older they get and the coke logo is one of them. ![:-)](http://web.archive.org/web/20131018023751im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "11 Jul 2003 — 10:14pm",
      "content": "You know, if you go to Futureland at Disneyworld, there are crates with a futuristic Coke logo on them. I wish I'd had a camera last time I went to take a pic.\n\n"
    },
    {
      "time": "12 Jul 2003 — 2:48pm",
      "content": "Woohoo!   \n   \n:kisses Anonymous:   \n   \nThat's just so cool looking.\n\n"
    },
    {
      "time": "14 Jul 2003 — 7:35am",
      "content": "Remember that an 'ok' logo like IBM can become a great logo if the company supports it with a quality brand experience.\n\n"
    },
    {
      "time": "17 Jul 2003 — 6:35am",
      "content": "I would have thought quite a few Muslim clerics would love to see the Coca Cola logo changed. I forget who, but there is a fella that is convienced that the scripted logo looks like \"there is no Mohammed\" in Arabic!!\n\n"
    },
    {
      "time": "17 Jul 2003 — 8:07am",
      "content": "he shouldn't have a problem, he is probably drinking mecca cola himself\n\n"
    },
    {
      "time": "3 Jun 2003 — 7:37am",
      "content": "\\>\\>I would NEVER change Nike or Coca-Cola...   \n   \nMaybe Coke should change their logo to keep up with their image...   \n   \nFrom lawsuit brought by International Labor Rights Fund and United Steel Workers of America against coca-cola:   \n==========================================================================   \nComplaint against Coca-Cola for Use of Anti-union Death Squads in Colombia   \n==========================================================================   \nThis case involves the systematic intimidation, kidnapping, detention and murder of trade unionists in Colombia, South America at the hands of paramilitaries working as agents of corporations doing business in that country. The violent persecution of trade unionists in Colombia has been at epidemic proportions for many years. Since 1986 ... over 3,800 trade unionists have been murdered. Presently, more than 60% of trade unionists murdered in the world are Colombian.   \nThis case...is brought to remedy and prevent the violent persecution of trade unionists at various   \nlocations of one particular company doing business in Colombia -- **Coca Cola**.\n\n"
    },
    {
      "time": "5 Jun 2003 — 9:32am",
      "content": "the logos seem old because they are old - but I don't think that's a good enough justification to re-design an identity that's become part of our visual culture. - if it ain't broke....plus those logos were designed to be long lasting and withstand the test of time - and is that not the sign of a successful design anyway? I'd be afraid that if anyone were to re-design them now they'd add some contemporary crap to it - and it would have to be redo again next year. i.e. ups and its freakin swoosh.\n\n"
    },
    {
      "time": "5 Jun 2003 — 3:21pm",
      "content": "Not sure what you mean PD.   \nCare to elaborate?\n\n"
    },
    {
      "time": "10 Jun 2003 — 12:01pm",
      "content": "Ahem. I smell a [troll](http://web.archive.org/web/20131018023751/http:/info.astrian.net/jargon/terms/t/troll.html).\n\n"
    },
    {
      "time": "11 Jul 2003 — 3:52pm",
      "content": "what would be the point of re-designing any of them they already have what they need and wanted in terms of success for a company   \n   \nhelp young companies, small biz, NGO's - y'no people who need an identity out there.\n\n"
    },
    {
      "time": "12 Jul 2003 — 4:23am",
      "content": "Here's a pic of the Tomorrowland Coca-Cola logo   \n   \n ![Coca Cola Tomorrowland logo](http://web.archive.org/web/20131018023751im_/http:/www.typophile.com/forums/messages/4100/12832.jpg)\n\n"
    }
  ]
}
