{
  "id": "2528",
  "title": "(x) Citibank print campaign - custom version of OCRK Bold Square {Stephen}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Citibank",
    "OCR",
    "solved",
    "Type ID Board [OLD]"
  ],
  "content": "Hey Y'all,   \n   \nI'm looking for the name of the font and/or who sells the font that is used in the citibank ads. I found a sample of it here: [http://www.citibank.com/us/cards/images/impact.gif](http://web.archive.org/web/20150425045728/http:/www.citibank.com/us/cards/images/impact.gif)   \n   \nAny help would be appreciated.   \n   \nLater,   \nBo\n\n",
  "author": "anonymous",
  "time": "22 Jun 2001 — 3:23pm",
  "uid": "1203",
  "comments": [
    {
      "time": "24 Jun 2001 — 10:24pm",
      "content": "I did a quick search and it's remarkably similar   \nto the OCR fonts (OCR-A, B, F - search at   \nmyfonts.com). So maybe those might do for you in   \nthe meantime.   \n   \nI'll keep on the lookout.\n\n"
    },
    {
      "time": "22 Jul 2001 — 10:05am",
      "content": "After 1 month of fasting and praying I've found   \nthe source of the mystery OCR face. It's OCRK   \nMediumSquare by Joe Kral of Test Pilot Collective.   \nTPC also sells (or sold) his OCRJ family - also   \navailable in 6 weights - but they seem to be in   \nlimbo since the fall of Makambo.com.   \n   \nFunny thing: I met Mr. Kral at TypeCon last week.   \nI'll send him this thread and we'll see what's up.\n\n"
    },
    {
      "time": "22 Jul 2001 — 9:09pm",
      "content": "Hah! So Stephen, you not only found the typeface in question but you've reeled in the actual designer... Have you considered becoming a private investigator?   \n   \nHere's a possible Tpyophile tagline: \"The Typophile Identification Board. It's worth the wait!\"   \n   \nCheers,   \n   \n//joe\n\n"
    },
    {
      "time": "25 Jun 2001 — 11:40pm",
      "content": "Thanks Stephen.   \n   \nYou're right about it being similar to the OCR fonts. I looked at them and others (citizen, platelet, letter gothic, etc.) prior to posting here but it's not any of them. I saw a font called OCR-J once but can't remember where or what it looked like.   \n   \nBo\n\n"
    },
    {
      "time": "22 Jul 2001 — 4:36pm",
      "content": "hello typophiles,   \n   \nthanks stephen for the email.   \n   \nThe Citibank font is a custom version of OCRK Bold Square. There's only a few changes from the regular font. We're working on getting a shopping cart system set up for TPC. I think we're also gonna put our fonts up on myfonts.com too. They should be up soon...   \n   \n [http://www.testpilotcollective.com](http://web.archive.org/web/20150425045728/http:/www.testpilotcollective.com/)   \n   \nthanks, joe kral\n\n"
    },
    {
      "time": "28 Jul 2001 — 10:05am",
      "content": "That's a fine complement, Joe. Never thought I could be   \na P.I. When I took those career direction tests in high   \nschool the result was always \"clerk\". I guess that's   \nmost appropriate.   \n   \n\"Looking for that file, Mr. Carter? I'll find it   \nfor you in a jiffy.\"\n\n"
    },
    {
      "time": "24 Jun 2001 — 10:21pm",
      "content": "I've wondered the same thing.   \n   \nI'm willing to bet it's a monospaced (typewriter) font. Hope that helps.   \n   \n//joe\n\n"
    }
  ]
}
