{
  "id": "2542",
  "title": "Type-Engraved rings?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Can anyone recommend a good merchant or jewelry artist for a typophile who wants great type engraved on the inside of a ring?\n\n",
  "author": "<a href=\"/web/20100519120806/http://typophile.com/user/3\" title=\"View user profile.\">Jared Benson</a>",
  "time": "<br>",
  "uid": "3",
  "comments": [
    {
      "time": "",
      "content": "YOU WANTS IT! YOU CAN'T HAVES THE PRECIOUSSSSS!\n\n"
    },
    {
      "time": "",
      "content": "Website? That narrows down my candidates a lot... :-\\>   \n   \nTry this guy: [http://www.orodiamante.com/](http://web.archive.org/web/20100519120806/http:/www.orodiamante.com/)   \nI forget his name though.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "I think any reputable jeweler can do it or knows someone who can.   \n   \nSometimes the typefaces are limited -- I had a choice of two when I got my wedding ring engraved.\n\n"
    },
    {
      "time": "",
      "content": "Ok, who's getting married? Need some advice from an old master?\n\n"
    },
    {
      "time": "",
      "content": "I know, no one is going to say yes to that question. But let me put it out.   \n   \nHave Jim Rimmer cut punches. Or one punch with all the characters. Drive it into the material before the ring is made.\n\n"
    },
    {
      "time": "",
      "content": "here in germany you can engrave your handscript into a ring. so it's in your hands.\n\n"
    },
    {
      "time": "",
      "content": "I had a friend -- a poet -- who had the alphabet tattooed around her ankle. I always coveted that. Maybe you could skip the ring and just have the words tattooed around your finger. I mean after all, if you were _really_ committed to type....   \n;)\n\n"
    },
    {
      "time": "",
      "content": "Meredith,   \n   \n_\"just have the words tattooed around your finger.\"_   \n   \nBoy that\n\n"
    },
    {
      "time": "",
      "content": "Ok not really engraved but enamel text on rings by a british jeweller [Solange Azagury Partridge](http://web.archive.org/web/20100519120806/http:/www.solangeazagurypartridge.com/), you have to dig a bit through the site, but in the Collection on the left, look for the 'Vices and Virtues' ring, there is also a '7 days of the week' ring. One has to chuckle at a collection that has a 'F\\*\\*k Off' bracelet made from emeralds and jet.\n\n"
    },
    {
      "time": "",
      "content": "You could try Mottl Industry. They make the RISD class rings, which have type on all four surfaces (including an optional script on the inside, whose height doesn't fill the whole ring width).   \n   \n [http://www.risdring.com](http://web.archive.org/web/20100519120806/http:/www.risdring.com/)\n\n"
    },
    {
      "time": "",
      "content": "Latin alphabet, any reputable place with a phone or website is a good lead. Bonus points for custom type (or some degree of choice) - thx\n\n"
    },
    {
      "time": "",
      "content": "Once, while travelling, I chanced upon a jewelry artist who was designing what seemed to be innocuous silver bands, but inside were complete alphabets and/or phrases. I've always been intrigued ever since, and would love to find if anyone's doing it. The typical \"engraved\" option doesn't appeal, mostly due to lack of choice in style and size. The rings I saw, the cap-height of the letters took up the entire width of the ring.   \n   \nand no, this is not a lord of the rings thing. Yes, I saw the movie. No, I'm not a huge Tolkien fan. Typophile, yes. guilty as charged.\n\n"
    },
    {
      "time": "",
      "content": "What writing system(s)?   \nIs downtown LA too far?   \n   \nhhp\n\n"
    }
  ]
}
