{
  "id": "2551",
  "title": "(x) ID - The International Design Magazine: text face - Coranto {Mike Y}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "The Last couple versions of ID have abandoned Meta, for a new -- and in my opinion -- much more appropriate serifed face. Unfortunately I dont have a scan, but would somone have the mag handy for an ID (no pun intended).   \n   \nThanks.\n\n",
  "author": "Hildebrant",
  "time": "Tue, 2003-12-30 11:50",
  "uid": "1286",
  "comments": [
    {
      "time": " Tue, 2003-12-30 12:47",
      "content": "The answer is on page 19 of the Jan/Feb 2004 issue:   \n\"In the new design, by current art director Nico Schweizer, the workhorse typeface Scala used for body copy has been replaced by Coranto, a font created by Gerard Unger in 2000. Meta, which appeared in headlines, will be succeeded by a variety of typefaces that will change over time. We start with Gotham, designed by Tobias Frere-Jones with Jesse Ragan for the Hoefler Type Foundry.\"\n\n"
    },
    {
      "time": " Tue, 2003-12-30 13:12",
      "content": "Ahh, damn I was just saying to my partner here, that looks quite a lot like Ungers work, but couldnt place it. Thanks. I might actually read through this mag once in a while now ![:-)](http://web.archive.org/web/20050825174519im_/http:/www.typophile.com/forums/clipart/happy.gif). Although not being an 'industrial designer', I really find very little use for the mag, aside from something for client to flip through. On the subject of magazines, I recently picked up a subscription to STEP, which had a great layout on type in this current issue, highlighting Bilak's work and some other great articles.   \n   \nOn a fairly different note, who designed the face for the new york times? Was that Unger? it has quite a similar 'feeling'.   \n   \nCheers.   \n   \nHildebrant.\n\n"
    },
    {
      "time": " Wed, 2003-12-31 07:09",
      "content": "Yves, I see you closed this out with 'Scala' as the answer, but it was really ['Coranto' by Gerard Unger](http://web.archive.org/web/20050825174519/http:/www.gerardunger.com/fontstore/store-coranto.html) that was the answer to the question.\n\n"
    }
  ]
}
