{
  "id": "2552",
  "title": "Adobe and Unicode?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi Folks!   \n   \nMaybe some of you are asking themselves the same thing...   \n   \nDoes InDesign CS support Unicode? With InDesign 2, I just tried to write something in Hangul (Korean) with the Seoul font. The Glyph Palette shows the characters, but when I use PowerInput that came with Jaguar, and works in all of my newer apps, I get crippled %$\n\n [‹ Happy New Year](http://web.archive.org/web/20070824231750/http:/www.typophile.com/node/2557 \"Go to previous forum topic\") [TYPE BOOKS on ebay ›](http://web.archive.org/web/20070824231750/http:/www.typophile.com/node/2483 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070824231750/http://www.typophile.com/user/2444\" title=\"View user profile.\">Frank Jonen</a>",
  "time": "<br>",
  "uid": "2444",
  "comments": [
    {
      "time": " 30.Dec.2003 6.13pm",
      "content": "Unicode input in InDesign 2.0 on the Mac is not really feasible. It was deisnged around the lowest-common-denominator APIs that work on both OS 9 and OS X.   \n   \nThe new version may fix all or part of this problem. Try installing the free tryout version of CS and see if that works better. Alternately, try the Windows version of the program.\n\n"
    },
    {
      "time": " 30.Dec.2003 7.51pm",
      "content": "The first thing to remember is that \"supporting Unicode\" is not a simple yes-or-no affair.   \n   \nWith that in mind, every version of InDesign has used a Unicode based text engine. However, that is a separate question from compatibility with OS X text input methods. In previous versions of InDesign, it has often been the case that one could import text for certain languages, but not enter it directly in the application.   \n   \nI believe that InDesign CS has done a much better job of working with arbitrary Unicode-based keyboards, such as those which come with OS X or can be created by end users (using an XML-based syntax). However, I am not familiar with \"PowerInput\" so I can't say whether that in particular works.   \n   \nJohn's suggestion about the tryout version is a good one, except that AFAIK the tryout isn't available yet for InD CS.   \n   \nRegards,   \n   \nT\n\n"
    },
    {
      "time": " 30.Dec.2003 8.02pm",
      "content": "_John's suggestion about the tryout version is a good one, except that AFAIK the tryout isn't available yet for InD CS._   \n   \nHmmmm. Could one extrapolate from the [Photoshop CS tryout](http://web.archive.org/web/20070824231750/http:/www.adobe.com/products/tryadobe/download.jsp?ftpID=2350)?\n\n"
    },
    {
      "time": " 31.Dec.2003 2.14pm",
      "content": "I'd just wait Adobe just released the GoLive CS tryout version I bet its only a short time before InDesign CS tryout is available. Darn Thomas its too bad Adobe gave up on Live Motion. I liked that application.\n\n"
    },
    {
      "time": " 31.Dec.2003 8.34pm",
      "content": "What about typing it in another programme and copying it into Indy?\n\n"
    },
    {
      "time": " 31.Dec.2003 10.51pm",
      "content": "If that doesn't work, there's always importing a Unicode text file. Or a Microsoft RTF file.   \n   \nT\n\n"
    },
    {
      "time": " 2.Jan.2004 1.10pm",
      "content": "Thomas, please correct me if I'm wrong, but don't InDesign, Photoshop and Illustrator CS share the same type engine? If so, the Photoshop and Illustrator tryouts should be valid tests.\n\n"
    },
    {
      "time": " 2.Jan.2004 1.32pm",
      "content": "They all use the same type engine which handles how the applications access fonts and the glyphs within those fonts. Illustrator and Photoshop even use the same text layout engine (which is a separate component). However, compatibility with input methods and clipboards are still partly separate issues.   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": " 5.Jan.2004 12.13am",
      "content": "_However, compatibility with input methods and clipboards are still partly separate issues._    \n   \nSince the power input method is triggered by the Character Palette in Jaguar and Panther, and you type in a little box, almost like a line caster that copy & pastes everything after you press Space or Enter, to the foreground application, I don't see much difference.   \n   \nHappy 2004!   \nF   \n---   \nBut since I'm a bit of an Adobist I'll get the CS suite anyways ;)\n\n"
    }
  ]
}
