{
  "id": "2559",
  "title": "Logotype Feedback",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I've been working on putting together the logo for a company called Momentum. I'd love to get your feedback on the finer points of the type. I'm wrestling with the ligature between the M and the E, it just doesn't quite feel right to me. Also, the O seems a little off. Any thoughts?   \n   \nThe business will works with utility companies and other big industries. We want to create a solid presence, while also a sense of dynamism.   \n   \nI'd love to hear your ideas!   \n   \n-Josh   \n   \n ![The logo itself](http://web.archive.org/web/20131017140117im_/http:/www.typophile.com/forums/messages/4100/23221.jpg)\n\n<!--attachment: JustLogo-23222.ai*attachment_icon.gif*application/postscript*188.4*the+illustrator+source*JustLogo%2eai --><!--attachment: JustLogo-23222.ai*attachment_icon.gif*application/postscript*188.4*the+illustrator+source*JustLogo%2eai -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131017140117im_/http:/www.typophile.com/forums/icons/attachment_icon.gif\" align=\"left\" alt=\"application/postscript\">the illustrator source<br><a href=\"http://web.archive.org/web/20131017140117/http:/www.typophile.com/forums/messages/4100/JustLogo-23222.ai\" target=\"_blank\"><b>JustLogo.ai</b></a> (188.4 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "joshuaezra",
  "time": "1 Jan 2004 — 3:15pm",
  "uid": "2865",
  "comments": [
    {
      "time": "2 Jan 2004 — 6:20am",
      "content": "Joshua: It's an okay start, but you really need to push it some. The ligatures work on a certain level, but I think it needs some more breathing space. The \"O\" looks like an egg that is about to be crushed. Also, your angles are all over the map and there is no consistency between the M's.   \n   \nPerhaps you should give some more thought to how the symbol works with the type. Can you integrate the two somehow creating more of a wordmark? As it stands now, it doesn't seem like a very original solution. Something as simple as moving the lower shape forward would give it more visual interest. (abstracting it slightly)   \n   \nI would also suggest re-working ENERGY. I am not a big fan of artificially skewed and stretched type. The G makes me wince.   \n   \nDo you have other sketches or directions? It might be helpful to see how you arrived at this point.\n\n"
    },
    {
      "time": "2 Jan 2004 — 6:27am",
      "content": "The \"o\" seems so claustrophobic between those MM's. everything is a little too \"italic\" for me, and maybe you could reduce the M logo to something like this (with an obvious \"O\" distortion:   \n   \n   \n   \n ![](http://web.archive.org/web/20131017140117im_/http:/www.typophile.com/forums/messages/4100/23234.gif)\n\n"
    },
    {
      "time": "2 Jan 2004 — 6:29am",
      "content": "Ok, I only push the post button once and I'm getting 3 posts... ![:-(](http://web.archive.org/web/20131017140117im_/http:/www.typophile.com/forums/clipart/sad.gif) This sucks.\n\n"
    },
    {
      "time": "2 Jan 2004 — 11:44am",
      "content": "In terms of integrating the logo and wordmark, why not drop the cap M in the black part? Use the cap M from the logo as the M?   \n   \nI like the shape of the O that Adriano put in, but trying to make it into ligatures with the two M's makes a big black blob. The way Joshua had it just touching in the first place was good.   \n   \nT\n\n"
    },
    {
      "time": "2 Jan 2004 — 12:00pm",
      "content": "Hey everyone,   \n   \nThanks for the feedback! I've worked on the O, trying to make it parallel the curve of the U more. This is what I came up with, a bit boxy, but coming along. Also included is a preview of the business card I'm working with.   \n   \nRegarding sketches and process- this is actually an old project which was just revitalized, I put together the rough over the summer. I should probably sit down and reconceptualize the piece, see where it leads me.   \n   \nKeep the good words coming!   \n   \n-Josh   \n ![](http://web.archive.org/web/20131017140117im_/http:/www.typophile.com/forums/messages/4100/23255.jpg)   \n ![business card](http://web.archive.org/web/20131017140117im_/http:/www.typophile.com/forums/messages/4100/23256.jpg)\n\n"
    },
    {
      "time": "2 Jan 2004 — 1:13pm",
      "content": "Josh, maybe you are looking for a harsh look, but could you look at making Momentum in gray instead of black, since everything runs together. Also maybe look at it as an outline stroke. Please make something smaller its way to crammed. White space please. Try making the red panel thinner left to right and Momentum smaller.\n\n"
    },
    {
      "time": "5 Jan 2004 — 5:20pm",
      "content": "I think that business card has some great movement in it. Just the paralellisms seem to be off.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Jan 2004 — 8:37am",
      "content": "The motion might be more exaggerated and dynamic (and interesting) if the less important type (address, etc.) weren't set at an angle. Does the address (etc.) need more spacing? Is the address too light?\n\n"
    }
  ]
}
