{
  "id": "2612",
  "title": "(x) Wedding invitation - (similar to) Opulence {Mike Y}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "see attached\n\n",
  "author": "alice",
  "time": "Wed, 2004-01-07 10:44",
  "uid": "2882",
  "comments": [
    {
      "time": " Wed, 2004-01-07 15:40",
      "content": "Alice, your attachment didn't attach...\n\n"
    },
    {
      "time": " Wed, 2004-01-07 15:43",
      "content": "Alice sent me this recently and I told her I didn't recognize it, and thought it might be engraving or film type used by a stationer. It's the main thing they can offer that we can't all reproduce by buying the font.   \n(This was the image she sent me)   \n ![AlicesSample](http://web.archive.org/web/20050516141930im_/http:/www.typophile.com/forums/messages/83/23630.jpg)\n\n"
    },
    {
      "time": " Wed, 2004-01-07 18:49",
      "content": "Mike, if you don't recognize it, I'm not sure any of us has any hope in doing so!   \n   \nI'd check the wedding-invitation catalogue that was sent to me in the mail -- now that I'm caught up in the wheels of the bridal industry -- but I threw it out in disgust. I'll be designing ours, thankyouverymuch -- now if I could only find the right typeface...\n\n"
    },
    {
      "time": " Wed, 2004-01-07 18:50",
      "content": "Looking at it again, and checking some other books, I think it looks a fair amount like Zoom Script (Solotype). Jason Walcott did this one for Jukebox as \"Opulence\". The sample is from my Script guide. You can get it from Veer.com   \n ![Opulence/ZoomScript](http://web.archive.org/web/20050516141930im_/http:/www.typophile.com/forums/messages/83/23636.gif)\n\n"
    },
    {
      "time": " Wed, 2004-01-07 18:56",
      "content": "Whoops, wrong 'r' and wrong 'S'. If it's one of the similar Z-series Solotype Scripts, it means it's probably only got a small chance of being digitized. I guess I really didn't know what it was.   \n   \nSorry. Still I think this is quite close.\n\n"
    }
  ]
}
