{
  "id": "2626",
  "title": "Gaijaaethao",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "Been tinkering around with a grayscale Thai font in my spare time. Don't have a full character set yet - nor digits & punctuation. Just thought I'd throw it out there to the wolves. Prematurely, so to speak, with no real pressing questions on the mind just yet. It's a bit more text-oriented than the last Thai face I posted here. Incidentally, I'm using black + 3 grays. I may try cutting down to 2 grays.   \n   \n ![](http://web.archive.org/web/20150414144017im_/http:/www.typophile.com/forums/messages/29/23627.gif)\n\n",
  "author": "matteson",
  "time": "7 Jan 2004 — 4:15pm",
  "uid": "1026",
  "comments": [
    {
      "time": "7 Jan 2004 — 5:40pm",
      "content": "Looks a little clotted on my end. Would look less so on Macs (due to the flatter gamma), but still too much adjacency in the grays. I've found that there's still a strict limit to the effectiveness of gray pixels, and when you cross that limit you trade in too much crispness for fidelity.   \n   \nTwo grays is better than three for a true bitmap font (since it requires one less bit of data per pixel), but for pixelfonts it's moot. On the design end, I've found that three grays can make a big difference (over two), especially for light (1 pixel stem) fonts. Using different grays on the insides and outsides of abrupt curve transitions works much better than using the same gray on either side.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Jan 2004 — 12:17pm",
      "content": "\\>Macs (due to the flatter gamma)   \n   \nYeah, I realized it looks totally different on a Mac and a PC. I didn't know there was that big of a perceptible difference between the gammas of the two. It might be interesting to do a informal online study of which grays look better among PC CRT, PC flat, Mac CRT, & Mac flat.   \n   \nAnyhow, I stripped this down to one gray & I figure I might work up from there - rather than vice versa. And I see what you mean about the loss of crispness. There's a huge difference.   \n   \n ![](http://web.archive.org/web/20150414144017im_/http:/www.typophile.com/forums/messages/29/24045.gif)\n\n"
    },
    {
      "time": "13 Jan 2004 — 12:46pm",
      "content": "The platform difference in gamma means that you need to avoid a certain ranges of grays, where things look exceptionally good on one platform but really bad on the other. Fortunately the gamma difference doens't make grayscale pixelfonts hopeless though.   \n   \nWorking up from too-few grays is indeed a great strategy: you can control the process much better, getting a feel for where crispness is losing out too much\\*. In this case I would split that 178 into two, maybe something around 200 and another much darker.   \n   \n\\* As well as minding the total bit depth in the case of \"true\" bitmap fonts.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Jan 2004 — 2:10pm",
      "content": "BTW, grayscale bitmap font design is best done on Windows: you err on the side of crispness, and you see what most users will end up seeing.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Jan 2004 — 2:19pm",
      "content": "\\>best done on Windows   \n   \nThat's what I typically assume - for the end user reason more or less. Luckily that's my platform of choice, but I'm lucky enough to work in a school where I can pop into a Mac lab whenever I want/need to ;-)\n\n"
    }
  ]
}
