{
  "id": "2627",
  "title": "Logotype for youth forum",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello again.   \n   \nHere is the first version of a logotype for a debating meeting. The overlay area of two dialogue bubbles represent the stripes of zebra, which is the symbol of Estonian Debating Society.   \n   \nThis concept will definitely be used, but I have a few more days to make changes in the logo. Lighter colours are have been requested for instance.   \n   \nAnyway, I'm worried about the balance and the use of tilted bubble. What do you think?   \n   \n ![](http://web.archive.org/web/20131018212412im_/http:/www.typophile.com/forums/messages/29/23640.jpg)\n\n",
  "author": "magnus72",
  "time": "7 Jan 2004 — 6:11pm",
  "uid": "2394",
  "comments": [
    {
      "time": "7 Jan 2004 — 7:09pm",
      "content": "Magnus,   \n   \nI like. Have you tried small caps for \"Youth Forum Estonia\" and perhaps some variations on the dialogue bubbles' shapes/angles (more rounded corners or ellipses)? Is the color pallette set? You might get a more pronounced color vibration effect in the zebra stripes with \\<i\\>slightly\\<i/\\> more saturation.   \n   \nVery nice start.\n\n"
    },
    {
      "time": "7 Jan 2004 — 7:37pm",
      "content": "I think this looks really nice. The dialogue bubbles are a good idea, but they look crooked. Could you rotate one or both a little more than they are to accentuate their different angles? Or make them square to the rest of the design?   \n   \nI like the saturated colours, but maybe it would work better with lighter tints or brighter colours. BTW maybe you could use transparency for where the bubbles meet, like this example:   \n   \n ![](http://web.archive.org/web/20131018212412im_/http:/www.typophile.com/forums/messages/29/23643.jpg)   \n   \nI am NOT suggesting using curved bubbles necessarily (unless you want or feel that it could work).   \n   \nJon\n\n"
    },
    {
      "time": "8 Jan 2004 — 1:02am",
      "content": "I agree with Jon regarding the accentuating of the dialogue bubbles. Rotate the orange about 5\n\n"
    },
    {
      "time": "8 Jan 2004 — 6:53am",
      "content": "Thank you for the great feedback.   \n   \nI'm working on different bubble shapes, but meanwhile I took the old version, tilted the symbol object, brought it closer to the text and made the colours lighter. Result:   \n   \n ![](http://web.archive.org/web/20131018212412im_/http:/www.typophile.com/forums/messages/29/23679.jpg)\n\n"
    },
    {
      "time": "9 Jan 2004 — 12:49am",
      "content": "Transparency at intersection could be a nice idea Jon, but there might be a meaning in those \"waves\". Youth Forum is probably about opinions. The opinions do not necessarily become a compromise (a color which is a mixture of orange and blue). Debates are rather battles where the opinions are waving side by side and against each other...   \n   \nFrom a designer's point of view I find those waves a nice rhythmical part of the whole composition.\n\n"
    },
    {
      "time": "9 Jan 2004 — 5:57am",
      "content": "You might go to [www.wildbrain.com](http://web.archive.org/web/20131018212412/http:/www.wildbrain.com/) and check out their logo for some inspiration. You could incorporate the idea of seeing or not seeing \"eye to eye\" (to communicate the idea of debate) along with the two dialogue bubbles.\n\n"
    },
    {
      "time": "9 Jan 2004 — 6:11pm",
      "content": "Magnus: I think it's an improvement, but now I am curious to see the other bubble shapes.   \n   \nMatjaz: I think you are right. I hadn't given any prpoer reflection about that aspect of debate. I was thinking merely in terms of trying various techniques.   \n   \nKeep us posted Magnus!   \n   \nJon\n\n"
    },
    {
      "time": "15 Jan 2004 — 5:02pm",
      "content": "Okay, I tried other shapes but in my opinion they didn't work very well. So I basically kept the old bubbles, made them a tiny bit rounder, shrinked the darker one a little and corrected the stripes.   \n   \nAlso we finally decided to go with more contrast and since the subject of this forum is the drug use of young people, vibrant colours fit pretty well. Maybe the contrast is a bit too stong?   \n   \nRemember that time is up and budget small, so no major changes will be made.   \n   \n ![](http://web.archive.org/web/20131018212412im_/http:/www.typophile.com/forums/messages/29/24224.jpg)\n\n"
    },
    {
      "time": "15 Jan 2004 — 5:20pm",
      "content": "Those two bubbles seem askew. My suggestion would be to get them both oriented vertical/horizontal, and then maybe rotated clockwise slightly so the red bubble's arrow sticks out a bit. Right now, it seems tenuous and weak to me.\n\n"
    },
    {
      "time": "15 Jan 2004 — 5:33pm",
      "content": "I also much prefer the previous (ie. second) blue-and-orange version.\n\n"
    },
    {
      "time": "15 Jan 2004 — 6:59pm",
      "content": "On these different versions I used slight skew on the last three and rotation on none.   \n   \nFirst: no skew   \nSecond: Red bubble is skewed -4 degrees   \nThird: Red is skewed -4 and blue 4 degrees   \nFourth: Both are -4   \n   \n ![](http://web.archive.org/web/20131018212412im_/http:/www.typophile.com/forums/messages/29/24241.jpg)\n\n"
    },
    {
      "time": "16 Jan 2004 — 5:44am",
      "content": "One more typographic detail Magnus, before you send these files to print. I think that terminals of the \"arrows\" should be defined. In this case probably by a very tiny curve (see image below). Not only it makes the logo more compact it is more resistant to small sizes and on-screen display, as well. It works better with different sign-cutting machines.   \n   \nExcuse me if this is already done, I can't see it at this size.   \n   \nBTW: I like blue-orange color scheme more.   \n   \n ![Curved terminal](http://web.archive.org/web/20131018212412im_/http:/www.typophile.com/forums/messages/29/24263.gif)\n\n"
    },
    {
      "time": "16 Jan 2004 — 6:01am",
      "content": "The second one seems best aligned to me.\n\n"
    },
    {
      "time": "16 Jan 2004 — 8:04am",
      "content": "Just a flat shear on the arrow tips might be better.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2004 — 5:37pm",
      "content": "I like the alignment of #2 and the brighter (second) blue orange color scheme.   \n   \nI'd also like to see what small-caps for the first letter of each word on the second line might look like.   \n   \n -t\n\n"
    },
    {
      "time": "16 Jan 2004 — 5:40pm",
      "content": "I like #2 - it suggests a bit of movement toward the right, taking the eye to the text part of the logo.\n\n"
    },
    {
      "time": "19 Jan 2004 — 10:02am",
      "content": "Magnus, I like number 2 in your blue and red skew comparison. The new colours are okay, but I like the blue + orange in the brighter version.   \n   \nThis looks pretty good. Way to go.   \n   \nJon\n\n"
    }
  ]
}
