{
  "id": "2631",
  "title": "Ebony",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is an idea I\n\n",
  "author": "matt_bluett",
  "time": "8 Jan 2004 — 12:45am",
  "uid": "2635",
  "comments": [
    {
      "time": "8 Jan 2004 — 12:49am",
      "content": "Sorry didn't mean to post twice! I'm having some computer problems.   \n   \nCheers\n\n"
    },
    {
      "time": "8 Jan 2004 — 2:56am",
      "content": "Looks pretty mr bluett. You have some spacing issues   \nbetween the N and Y, maybe try opening the whole thing   \nup a little. I am not particulary mad about the ultra-sharp   \nterminals on the E,N,Y. They don't seem too organic and   \ncoffee like. Don't spend too long on this, they might not   \nappreciate it ; )   \n   \nlove kris\n\n"
    },
    {
      "time": "8 Jan 2004 — 4:19am",
      "content": "The E with the wavy crosspiece definitely evokes a very coffeehouse image in my mind. That said, I'm not sure how well the bottom serifs on the N and Y work with the rest of the glyphs. The letter forms (contrasting with ornament) seem to ride high, and don't have the bulk of the E,B, and O - an impression only accentuated with the crossbar of the N riding so high. It's not really an issue of color, the word EBONY just seems to fizzle and die at the end.   \n   \nRealize that this comes from someone who could probably never equal your work, so a critique is really all I have for you. I don't know how else to preserve the elements of the face in the N and Y, so I guess it's up to you to decide whether I'm full of it.   \n   \nPS, I like this face a lot. It seems to have a lot of the soul of the old-west woodcut lettering with a distinctly modern feel - a potent and interesting combination.\n\n"
    },
    {
      "time": "8 Jan 2004 — 4:46am",
      "content": "Ashton, could you post a jpg or gif I can't see the pdf on this forum.\n\n"
    },
    {
      "time": "8 Jan 2004 — 1:29pm",
      "content": "Ah, here is a gif. I haven't altered anything yet. I will have a better look at the N anf Y since there is some doubt about them.   \n ![Ebony Gif](http://web.archive.org/web/20131108002541im_/http:/www.typophile.com/forums/messages/29/23754.gif)\n\n"
    },
    {
      "time": "8 Jan 2004 — 4:25pm",
      "content": "It seems to me that you are borrowing from alot of influances and not focusing on one direction. Try one pencil version of each idea, like african or Victorian and then see if they work. Focus the concept then execute\n\n"
    },
    {
      "time": "11 Jan 2004 — 9:32pm",
      "content": "VERY ROUGH, I noticed this perky dude pouring a coffee   \n   \n\\<img\\>\n\n"
    },
    {
      "time": "11 Jan 2004 — 9:35pm",
      "content": "sorry, ![image](http://web.archive.org/web/20131108002541im_/http:/www.typophile.com/forums/messages/29/23921.gif)\n\n"
    }
  ]
}
