{
  "id": "2648",
  "title": "Vandercook parts?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Does anyone know if it is possible to find replacement jacket and packing for the impression cylinder of a Vandercook 4 press?   \n   \nAny sources in the Los Angeles, California area?\n\n",
  "author": "<a href=\"user/1315\" title=\"View user profile.\">kidbritish</a>",
  "time": "<br>",
  "uid": "1315",
  "comments": [
    {
      "time": " 8 January, 2004 - 11:17pm",
      "content": "_American Printing Supplies, New York._ My memory for names is terrible!   \n   \nIf not, take the best samples of your packing, or exact measurements with _crease and angle measurements_ to a die cutter. You will need, if you don't have them, _tympan, make ready_ and _under sheets._ Complexity is in the same order.   \n   \nYou can make them up on your own. The paper is generally sold in rolls. The rolls are expensive. _Close to the core_ makes inferior packing. The results, unless you are professional, will predictably cause difficulty in giving equal _Drum Tone._   \n   \nGerald Lange, or Jim Rimmer may have other suggestions.\n\n"
    },
    {
      "time": " 10 January, 2004 - 2:37am",
      "content": "Jonathan   \n   \nNA Graphics bought out Vandercook some years ago but still has replacement parts and various materials and supplies.   \n   \nNA Graphics Fritz Klinke P O Box 467, 1314 Greene Street, Silverton, CO 81433 970-387-0212 [nagraph@frontier.net](mailto:nagraph@frontier.net)  \n   \nGerald's items, in Vandercook-speak, would be top blankets (drawsheets), under blankets, undersheets (.006 manila). NAG has a catalog. Basically a mylar top blanket and Kimlon under blanket (about $50) will do you, along with the undersheets. These are all cut to fit your press, which had a long production life, so there are still lots of parts, etc. On a Vandercook, various thicknesses of professional grade tracing paper will work nicely for minor makeready (actually taped directly to the tympan - Vandercooks aren't exactly production presses and aren't all that fussy). NAG also has a lithographer's sheet, called generically, non-slip paper, in various thicknesses. Works well as makeready and/or as an undersheet.   \n   \nNo real outlet for any of this stuff in LA anymore.\n\n"
    },
    {
      "time": " 11 January, 2004 - 12:14pm",
      "content": "Johnathan   \n   \nOn top of the other advice you have received from G and G, I use old litho plates as bottom packing. This is cheaper than using up you oiled packing paper, and makes for clean impression, and is easy on your type.   \n   \nI have made a cardstock template of the tympan for my press, and cut pieces to this size and shape from a fat roll of oiled packing paper.   \n   \nJim\n\n"
    }
  ]
}
