{
  "id": "2651",
  "title": "TYPOPHILE UNIVERSITY",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "You could spend $179.00 here   \n   \n [http://www.sessions.edu/syllabus/WebTypeDesign.html](http://web.archive.org/web/20131101034943/http:/www.sessions.edu/syllabus/WebTypeDesign.html)   \n   \nor study gratis at Typophile University under Profs. Papazian, Benson, Pemberton et al.   \n   \nokay it's late. \\   \n   \nbtw, hrant, you should write a book.\n\n",
  "author": "beejay",
  "time": "29 Aug 2002 — 1:33am",
  "uid": "1014",
  "comments": [
    {
      "time": "29 Aug 2002 — 1:42am",
      "content": "[http://hotwired.lycos.com/webmonkey/design/fonts/tutorials/tutorial3.html](http://web.archive.org/web/20131101034943/http:/hotwired.lycos.com/webmonkey/design/fonts/tutorials/tutorial3.html)   \n   \n\"From the calligraphy schools of ancient China to the explosive new forms of David Carson, it's clear that type is more than just a vehicle for conveying information to the user.\"   \n   \n\"Why should we care so much about this arcane art?\" - Nadav Savio.   \n   \nOut of curiousity, how many explosive typefaces did Carson actually draw himself?   \n   \nArcane art. Is that a compliment or an insult?   \n   \nOverall, Nadav does a nice job considering his audience.   \n   \nbj\n\n"
    },
    {
      "time": "29 Aug 2002 — 8:10am",
      "content": "I'm no professor, although I've been called a \"rogue academic\" in ID magazine. I would have prefered \"rogue scholar\", but hey. BTW, get off me with the book. I already spend enough time with crap that doesn't make money. :-/   \n   \nhhp\n\n"
    },
    {
      "time": "29 Aug 2002 — 7:33pm",
      "content": "I suspect he had plenty of interns at Garage...   \n   \nhe certainly knows how to f up some perfectly good typefaces now. (referring to 'End of Print') althougth had some excellent content wasn't it a chore to read. End of \\*his\\* Print career perhaps.\n\n"
    },
    {
      "time": "29 Aug 2002 — 8:19pm",
      "content": "opps I meant \"Intuition\" Carson's last.\n\n"
    },
    {
      "time": "30 Aug 2002 — 5:50am",
      "content": "\\>\\>\"I'm no professor\"   \n   \n...but you, Hrant, are better as teacher than many of the teachers I had at the University.   \n   \nCU.   \n   \nRamiro Espinoza.\n\n"
    },
    {
      "time": "30 Aug 2002 — 8:42am",
      "content": "I agree with Ramiro, but don't let it go to your head Hrant. ;) In fact, everyone here has had the opportunity to teach someone else something be they small points or large. (no pun intended.)   \n   \nBy definition, a teacher does not have to someone at a university or for that matter human. It only need be something that guides us further down our own path of discovery.\n\n"
    },
    {
      "time": "30 Aug 2002 — 9:40am",
      "content": "Don't worry. I \"teach\" what [little] I know not because I'm qualified to, not because anybody needs it, but because I enjoy it.   \n   \nhhp\n\n"
    }
  ]
}
