{
  "id": "2674",
  "title": "Archive through January 07, 2004",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "_Of course, the Nazis outlawed blackletter once they realized that using it might make world domination just a little harder. It was suddenly \"discovered\" to be \"Jewish.\"_   \n   \n [http://www.typophile.com/forums/messages/4077/17238.html?1066336912](http://web.archive.org/web/20131023033616/http:/www.typophile.com/forums/messages/4077/17238.html?1066336912)   \n   \nHeller was against both the \"Swastika and Fraktur?\" This inconsistency smells of racism.   \n   \nHello, Heller!\n\n",
  "author": "gerald_giampa",
  "time": "24 Dec 2003 — 2:39am",
  "uid": "2094",
  "comments": [
    {
      "time": "24 Dec 2003 — 7:01am",
      "content": "\\>US \"brethren\" (not being at any risk of life themselves) are much thicker and fundamentalisic.   \n   \nA tiny fraction of U.S. Jews are fundamentalists, and some of those Jewish fundamentalists are anti-Zionist.   \n   \nAnyone interested in the facts, as opposed to Hrant's ravings - and he has shown on the Typographica thread on this issue to be impervious to facts - may consult the following surveys, which show that very strong majorities of American Jews favor withdrawal from the occupied territories and a Palestinian state.   \n   \n 2003 survey on support for peace treaty with withdrawal.   \n [http://www.rice.edu/projects/reno/Newsrel/2004/20031124\\_survey.shtml](http://web.archive.org/web/20131023033616/http:/www.rice.edu/projects/reno/Newsrel/2004/20031124_survey.shtml)   \n   \n2003, current survey of American Jews on Israel: Americans don\n\n"
    },
    {
      "time": "24 Dec 2003 — 7:23am",
      "content": "Incidently,the difference in tone and figures between the second and the third and fourth surveys reflect the biases of surveyors. Each is clearly slanting the information in its direction, one being pro and the others anti Sharon.\n\n"
    },
    {
      "time": "24 Dec 2003 — 8:56am",
      "content": "_...would you have trouble equating Christians with Nazi's?_   \n   \nWhat do you mean? If you are pointing out that many people who considered themselves Christians joined the Nazi party and supported Hitler, obviously this is terribly true. If you are pointing to the contribution of 19 centuries of Christian antisemitism in European culture to the making the Holocaust possible, you will get no argument from me. However, if you are suggesting that the tenets of Christian belief and Nazi ideology are the same, then obviously this is not true. They are, at least, different, and most people would agree that they are plainly incompatible: you need to grossly distort one to arrive at the other.   \n   \nAlso, I'm increasingly of the opinion that the term 'Christian' is close to meaningless today, and probably has been since long before even the rise of protestantism. There is no religion called Christianity, and the most that can be said is that the term recognises the central position of the figure of Christ in a great number of different religions that do not agree on who or what Christ was.\n\n"
    },
    {
      "time": "24 Dec 2003 — 9:25am",
      "content": "William, then let's see you peons make a difference.   \n   \n--   \n   \nMore on Heller soon.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Dec 2003 — 9:37am",
      "content": "\\>no religion called Christianity   \n   \nPerhaps no single religion, but a group of religions. Any religion recognizing the divinity of Jesus may reasonably be called Christian. This leaves out Jews,Muslims, Buddhists, Hindus and probably Unitarians. Also the belief in original sin, which is closely tied to the belief in the divinity of Jesus, seems to be part of all versions of Christianity. If I remember rightly, this minimal but important commonness of belief was view of the long Encyclopedia Britainica article 'Christianity'.   \n   \nFor example, I see on the internet that different Christian groups continue to argue about the historical reasons for and legitimacy of Sunday Sabbath worship - an (irrelevant) issue I mentioned earlier. But all these groups agree on the divinity of Jesus.   \n   \nIt is my observation that how an individual or subgroup interprets and applies the set of beliefs is as important as the beliefs themselves, or moreso, when it comes to how the faith is actually lived.   \n   \nAnd happy holidays to all.\n\n"
    },
    {
      "time": "24 Dec 2003 — 9:51am",
      "content": "BTW, William, you should know that a recent BBC survey (_slightly_ more objective than some of your sources...) showed that there was greater support for Israel's \"policy\" towards the Palestinians than there is within Israel itself! Not even counting its 10% Arab population. What does that tell you? Or at least us, who are not encumbered by a legacy coping mechanism...   \n   \nYou can pretend to be compassionate (or even merely pragmatic) as much as you want, but the fact on the ground is that the US (in its broader political presence of the House and Senate, even more than the White House) unwaveringly supports apartheid measures such as the limiting of marriages and the construction of artificial concrete borders\\*. Only the people already brainwashed are fooled. Claiming that popular opinion guides foreign (or even domestic) policy is part of the deception. So is the use of \"Democracy\" like a blunt weapon. But this two-faced approach will get you in the end.   \n   \n\\* Something you won't hear on CNN or Fox: [http://news.bbc.co.uk/2/hi/technology/3334235.stm](http://web.archive.org/web/20131023033616/http:/news.bbc.co.uk/2/hi/technology/3334235.stm)   \n   \nhhp\n\n"
    },
    {
      "time": "24 Dec 2003 — 9:52am",
      "content": "As a U.S. citizen, I neither support nor reflect the actions of the U.S. government; in the same way, being a Jew doesn't make one a human incarnation of the state of Israel. Let's try to remember that the set \"Jews\" overlaps with but is different from the set \"Israel.\" It's sloppy and inaccurate to equate the two. Plus, it annoys us Jews.\n\n"
    },
    {
      "time": "24 Dec 2003 — 10:05am",
      "content": "Certainly, but let's not make that a convenient escape. Jews are responsible for the actions of Israel, since Israel is The Jewish State. US Jews are responsible for the actions of Israel _and_ the US (although they might prioritize one over the other as they see fit). I'm responsible for three. But above all else, we are all responsible for this earth.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Dec 2003 — 10:13am",
      "content": "_Perhaps no single religion, but a group of religions. Any religion recognizing the divinity of Jesus may reasonably be called Christian. This leaves out Jews,Muslims, Buddhists, Hindus and probably Unitarians. Also the belief in original sin, which is closely tied to the belief in the divinity of Jesus, seems to be part of all versions of Christianity. If I remember rightly, this minimal but important commonness of belief was view of the long Encyclopedia Britainica article 'Christianity'._   \n   \nI would probably agree with you that, if the term Christian were to be at all useful, one would probably need to agree on the divinity of Christ and the necessity of redemption from original sin. However, off the top of my head, I can think of at least a few sects who at least consider themselves nominal Christian that do not believe in the divinity of Christ and/or who believe Christ's sacrifice redeems us only of individual sin.   \n   \nMy main point is that the term Christian doesn't refer to anything specific. And God is in the details ![:-)](http://web.archive.org/web/20131023033616im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "24 Dec 2003 — 10:24am",
      "content": "_It is my observation that how an individual or subgroup interprets and applies the set of beliefs is as important as the beliefs themselves, or moreso, when it comes to how the faith is actually lived._   \n   \nAbsolutely. The idea that a religion is a set of beliefs reflects, in my opinion, a distinctly individualist, protestant interpretation: what a friend of mine -- herself a protestant -- calls 'head religion'. It ultimately leads people to think they can be religious without actually doing anything. Catholicism is emphatically a set of beliefs _and a set of actions,_ both individual and communal, and this is also the impression I have of Judaism. There are things one should believe and there are things that one should do, and together they define the way one should live.\n\n"
    },
    {
      "time": "24 Dec 2003 — 11:01am",
      "content": "\\>BBC survey   \n   \nLink?\n\n"
    },
    {
      "time": "24 Dec 2003 — 11:18am",
      "content": "The only relevant link I find on the 'slightly more objective' bbc site is this:   \n   \n [http://news.bbc.co.uk/1/hi/world/americas/2500019.stm](http://web.archive.org/web/20131023033616/http:/news.bbc.co.uk/1/hi/world/americas/2500019.stm)   \n   \nIt references the survey reported on more extensively in my fourth link above, done jointly by the Arab American Institute and Americans for Peace now in 2002. Neither the BBC article, nor the joint article by James Zogby, President of the Arab American Institute, and Debra DeLee,President of Americans for Peace Now, say what you claim.\n\n"
    },
    {
      "time": "24 Dec 2003 — 11:19am",
      "content": "I remember it was in a story about a year ago (maybe a bit less), but some searching hasn't turned it up yet - I'll keep looking. I remember mentioning it in public before, and if I can find that I can narrow down the dates.   \n   \nBut I did find these:   \n [http://news.bbc.co.uk/2/hi/2960080.stm](http://web.archive.org/web/20131023033616/http:/news.bbc.co.uk/2/hi/2960080.stm)   \n [http://news.bbc.co.uk/2/hi/europe/3234264.stm](http://web.archive.org/web/20131023033616/http:/news.bbc.co.uk/2/hi/europe/3234264.stm)   \n   \nhhp\n\n"
    },
    {
      "time": "24 Dec 2003 — 11:31am",
      "content": "How convenient that that's the only one you found... and I'm Queen Nefertiti. And nevermind it's more than a year old. I think you can give Heller a run for his money (joke intended) in the Spin Olympics.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Dec 2003 — 11:34am",
      "content": "Neither of your new references bears on your claim.\n\n"
    },
    {
      "time": "24 Dec 2003 — 11:36am",
      "content": "Order in the court! Order in the court! Fortunately the court of public opinion is not a US courtroom. I just thought to prod your black fortress with some real news, that's all.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Dec 2003 — 11:42am",
      "content": "BTW, please tell us exactly what search terms you typed in to the BBC site where that page came up as a prime article. You have 2 minutes.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Dec 2003 — 11:56am",
      "content": "Here's something you should ponder:   \n [http://news.bbc.co.uk/2/hi/middle\\_east/3237277.stm](http://web.archive.org/web/20131023033616/http:/news.bbc.co.uk/2/hi/middle_east/3237277.stm)   \n   \nBut of course Europeans are all Jew-haters. And nevermind the rest of the world, where people like Saddam are voted by 80% of African _listeners of the BBC_ a few years ago as the Man of the Year (out of nothing but desparation for fair payback).   \n   \nListen to what the world is feeling, instead of the voices in your head.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Dec 2003 — 11:57am",
      "content": "'Jews survey' is the search term. It's the first article.   \n   \n   \n\\>You have 2 minutes   \n   \nQueen Nefertiti, I didn't know you had become Empress of the U.S. and could issue orders like that.   \n   \nHrant, take a rest. Have a nice Holiday. Bye.\n\n"
    },
    {
      "time": "24 Dec 2003 — 11:58am",
      "content": "Hrant, I really don't understand what you are trying to argue, especially as the BBC stories you cite don't obviously relate to anything that you've said. First, you say that Israeli Jews are more sensible and less 'fundamentalistical' than American Jews, and then you cite a BBC story about public opinion of world leaders in which only Israelis trust George Bush above other leaders. Seriously confusing. Take your time.\n\n"
    },
    {
      "time": "24 Dec 2003 — 12:06pm",
      "content": "I gave you two minutes because you would (and did!) use more time to find a hoaky set of search terms that give that page a higher priority than all the other damning ones you should have been pointing too! Your underware is showing. I refuse to believe you're dumb.   \n   \nAnd I'll have good holidays when my people are treated fairly.   \n   \n--   \n   \nIsraeli Jews are indeed more sensible because they don't trust their own leadership. And that only leaves The Moron, the poor souls!   \n   \nhhp\n\n"
    },
    {
      "time": "24 Dec 2003 — 12:14pm",
      "content": "_But of course Europeans are all Jew-haters. And nevermind the rest of the world, where people like Saddam are voted by 80% of African listeners of the BBC a few years ago as the Man of the Year (out of nothing but desparation for fair payback)._   \n   \nHrant, you've said in the past that the American masses believe anything that's told to them. But now we should pay attention to surveys of Europeans and Africans? Even when the results are based on 'desperation for fair payback' and 'feeling' and not, say, on a knowledgeable consideration of the situation in the Middle East?   \n   \nCiting surveys of people who agree with you doesn't actually make you right. I thought you didn't approve of democracy, so why are you suddenly appealing to mass opinion?\n\n"
    },
    {
      "time": "24 Dec 2003 — 12:20pm",
      "content": "_I gave you two minutes because you would (and did!) use more time to find a hoaky set of search terms that give that page a higher priority than all the other damning ones you should have been pointing too!_   \n   \nHrant, you referred William to a BBC story regarding a survey of Jewish opinion (a story to which you have yet to provide a link). What's hoaky about the search term 'Jewish survey'? You may not believe that William is dumb, but apparently you think all the other readers of this thread are. Remember, when you're desperate, your desperation shows in your increasingly ludicrous tactics and increasingly poor grammar.\n\n"
    },
    {
      "time": "24 Dec 2003 — 12:46pm",
      "content": "I pay attention to every poll, I just don't take any of it literally. Otherwise I'd think Africans are dumb. As for William's tactics, I've seen enough of them to have a feeling of how he works.   \n   \nMy poor grammar is a reflection of my decreasing interest in the topic, of _no_ interest in getting fossilized opinions to change. I _am_ desparate, but only to avoid falling in your dual tarpits of waste. So let me save my keyboard some strain and point to this: [http://typographi.ca/000755.php](http://web.archive.org/web/20131023033616/http:/typographi.ca/000755.php)   \nThe rest is wasted effort.   \n   \nhhp\n\n"
    },
    {
      "time": "25 Dec 2003 — 12:22am",
      "content": "John,   \n   \nif you are suggesting that the tenets of _Jewish_ belief and _Sharonazi ideolog_y are the same, then obviously this is not true.\n\n"
    },
    {
      "time": "29 Dec 2003 — 1:34pm",
      "content": "Stop the frenzy, back on topic, and see what I've found by chance:   \n [http://www.undt.co.uk/pukkaexplanation.html](http://web.archive.org/web/20131023033616/http:/www.undt.co.uk/pukkaexplanation.html)   \nIt's an interview conducted by Steven Heller, for a new book he's working on, about the education of type designers, with Marcus McCallion on his typeface Pukka.   \nMcCallion is the mind behind the Undt type foundry and works also with Jonathan Barnbrook on the development of Virus faces.   \nThe points expressed in the interview are very similar to what Heller have already said in his many articles and books on the Swastika topic, and McCallion's answers keep underlining what I consider the point, which was, in a very similar way, the same behind Jonathan's own Manson \"craze\", and behind this Microsoft Dingbat silly story.   \nThe discussion fostered, of course, from the inspiration behind the Pukka typeface which, needless to say, puts in discussion the demonization of the Svastika and the polivalent meaning of symbols as we already talked about at typographi.ca, using a swastika form (both cw and ccw) for its \"x\" glyphs.   \nThat's, more or less, my idea and intention, when I talk of \"redemption\" of symbols put to an ominous use.\n\n"
    },
    {
      "time": "29 Dec 2003 — 1:46pm",
      "content": "I don't think \"stop the frenzy\" and \"Heller\" can be used in the same post...   \n   \nQuestion: Why was Heller the one to do the interview? Here again, read the _questions_ very carefully.   \n   \nhhp\n\n"
    },
    {
      "time": "29 Dec 2003 — 2:00pm",
      "content": "\\>I don't think \"stop the frenzy\" and \"Heller\" can be used in the same post...   \n   \nHa ha! Well, I just generally appreciate McCallion's answers. Of course, Heller tries always to underline his position, which I don't share.\n\n"
    },
    {
      "time": "30 Dec 2003 — 7:22am",
      "content": "What's Hellers opinion about wearing black shirts? I love black shirts.\n\n"
    },
    {
      "time": "30 Dec 2003 — 7:54am",
      "content": "Meredith   \n_set \"Jews\" overlaps with but is different from the set \"Israel.\"_  \n   \nWould that fall into \"Russell's Paradox\" _Principia Mathematica?_ Me without my library. Somewhere I have a book by Afred North Whitehead addressing this very issue.   \n   \nThank God for pocket calculators.\n\n"
    },
    {
      "time": "3 Jan 2004 — 10:12am",
      "content": "This   \n [http://pages.compuserve.ebay.com/help/community/png-offensive.html](http://web.archive.org/web/20131023033616/http:/pages.compuserve.ebay.com/help/community/png-offensive.html)   \nis not just increasingly ridiculous.   \nIt's becoming annoying (seriously).\n\n"
    },
    {
      "time": "3 Jan 2004 — 10:23am",
      "content": "Adjustment:   \nMcCallion's Pukka, here   \n [http://www.undt.co.uk/pukka.html](http://web.archive.org/web/20131023033616/http:/www.undt.co.uk/pukka.html)   \nand Propaganda, here   \n [http://www.undt.co.uk/propaganda.html](http://web.archive.org/web/20131023033616/http:/www.undt.co.uk/propaganda.html)   \ndon't just use the swastika (both cw and ccw) as an x, but the entire structure of Pukka letters is actually constructed upon a swastika structure.   \nI think the face is great (especially Propaganda).   \nWhy designers, instead of complaining about non-issues, don't start employing this typeface on pieces against racism, the holocaust, on historical books about nazism, to sensibilize youngsters and kids about recent and contemporary violence, abuse and terrorism, starting to put those new age fanaticskins into the light they deserve (the one of the ridiculous)?   \nMaybe I'm naive (or maybe not) but people tend always to see how things can be potentially used for the bad, never for improvement works. They look at the present, at the past just to complain, at the future just to worry. Aww, go have a pic-nic!\n\n"
    },
    {
      "time": "3 Jan 2004 — 10:27am",
      "content": "Freedom of speech exists only to the extent of getting people to think they actually have it when they don't. Freedom of speech is also beneficial in reducing the motivation for freedom of _action_: when you can complain about something to your buddies (although never really in mass media) you are less likely to _do_ anything about it. The anti-establishment ideas are not new, they're all out there, so discussing them is moot. The important thing is to make people more vegetative by giving them comfortable illusions like freedom of speech and democracy.   \n   \n\\> Why designers, instead of complaining about non-issues, don't start employing this typeface on pieces against racism ....   \n   \nThat's verbotten because it would limit the ability of the System to keep perpetrating those things.   \n   \nhhp\n\n"
    },
    {
      "time": "3 Jan 2004 — 7:05pm",
      "content": "Freedom of speech is something guaranteed by some _states,_ it is not something guaranteed by companies -- such as eBay --, which reserve the right to discriminate as to what is said or expressed in or via the services that they offer. Freedom of speech means that you won't be arrested, fined, thrown into jail, executed, etc. _by the state_ for saying things, and this is the basis on which it must be judged. It is fair and accurate to observe that some states that affect to guarantee freedom of speech also impose limits on that freedom, but it is neither fair nor accurate to present, as an example of the restriction of freedom of belief, the decision of a company like eBay exercising its rights to define the ways in which its services may be used.\n\n"
    },
    {
      "time": "3 Jan 2004 — 8:17pm",
      "content": "The owners of eBay are the owners of our societies.   \nSeparating them is exactly what they want us to do.   \n   \nAs for \"guarantee\", snake oil salesmen guaratee their products too. In the West \"guarantee\" is no evidence of truthfulness - it simply means that a customer could get his money back. The main thing the illusion of freedom of speech guarantees is that we will remain peons.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Jan 2004 — 4:22am",
      "content": "_Freedom of speech means that you won't be arrested, fined, thrown into jail, executed, etc._   \n   \nMany people who have excercised such rights by way of peacful protests no longer suffer from this illusion. How about getting gassed, beaten and firehosed in Canada sound?   \n   \nI recall the Ottawa free trade talks which included the countries of Central America. The then Prime Minister Jean Cretien had just issued a scathing lecture to these countries on human rights abuse. CBC interviewed one Central American representatives directly afterwards asking for reflections on the human rights lecture. The Central American representative pointed his finger to the TV monitors in the hallways showing civilians almost drowing pinned to a fence. His response was, _it looks like fairly low bar, I think we can manage._\n\n"
    },
    {
      "time": "4 Jan 2004 — 10:27am",
      "content": "Gerald, as I said: 'It is fair and accurate to observe that some states that affect to guarantee freedom of speech also impose limits on that freedom'. I'm not debating whether freedom of speech is illusory, I'm saying that it is disingenuous to use the service policies of a company like eBay as evidence of a lack of freedom of speech _because such policies are under no obligation to provide freedom of speech._ When peaceful protesting students at UBC are pepper-sprayed by RCMP officers reporting directedly to the Prime Minister's Office, it is an infringement of freedom of speech; when eBay says it won't allow you to sell SS memorabilia using its services, it is not. The government has an obligation under the constitution to provide a level of freedom of speech that includes peaceful protest. eBay is under no obligation to allow you to sell SS memorabilia.\n\n"
    },
    {
      "time": "4 Jan 2004 — 10:45am",
      "content": "I just wanted to make that clear.   \n   \nI have always reserved the right to refuse business.\n\n"
    },
    {
      "time": "4 Jan 2004 — 1:07pm",
      "content": "The example you cited is an \"additional example of abuse\". It was the same government, same Prime Minister. The example I was citing was the Ottawa \"Free Trade Talks\". The BC example was the \"World Trade Organization\".   \n   \nThe abuses were sequential and serial even after litigation was in the works by the first BC complaintants.   \n   \nSo it puzzles me when you say . . .   \n   \n_Freedom of speech is something \"guaranteed\" by some states,_   \n   \nHow do you collect on such a guarantee? Or is this just a \"feel warm and fuzzy perception of one's own country\". A misguided pride.   \n   \nHrant may indeed have very good point.   \n   \nDid I ever tell you I made national headlines for winning a constitutional argument with the Province of New Brunswick. Very eye opening. I won though, cost them \"millions\".\n\n"
    },
    {
      "time": "4 Jan 2004 — 4:12pm",
      "content": "_How do you collect on such a guarantee?_   \n   \nBy taking the government to court and by voting them out of office. In short, by making it against their interests to abuse freedom of speech.   \n   \nOf course, you could also violently overthrow the state, but funnily enough that always seems to result in less freedom of speech, not more.\n\n"
    },
    {
      "time": "5 Jan 2004 — 6:11am",
      "content": "John,   \n   \n_by voting them out of office_   \n   \nDid you manage to vote Cretien out of office, or did you approve of his behaviour? Easier to say than do maybe. Why? Canada is not a democracy! What makes for successful _western style \"guided\" democracies_ is a gullible population shammed by a 'controlled press'. _(As in, anything but free.)_ It is the beauty of the system. Personally, I would prefer to live in a democracy rather than in the _illusion of a democracy._   \n   \nThis is peculiarly evident in North America.   \n   \nI hate to be nationalistic but Finland has a _model democracy._ It accumulates an unimaginable variation of different ideals. Before making a comment otherwise you should look to see the democratic structure. Also, and rightfully so, their citizens are able to have enormous gatherings of protest without sending in Nazi's disguised as RCMP. In other words, Finland it is not a quasi-moto democracy.   \n   \n_conjecture of_\n\n"
    },
    {
      "time": "5 Jan 2004 — 7:28am",
      "content": "_What makes for successful_ western style \"guided\" democracies _is a gullible population shammed by a 'controlled press'._   \n   \nDamn this gullible population! These mindless lemmings! Do I have to do everything around here?! Seize him! [Seize him you fools!](http://web.archive.org/web/20131023033616/http:/www.theonion.com/onion3215/seizehim.html)\n\n"
    },
    {
      "time": "5 Jan 2004 — 8:26am",
      "content": "Good thinking?\n\n"
    },
    {
      "time": "5 Jan 2004 — 6:27pm",
      "content": "Gerald, there are two things to take into account when comparing different democratic states: one is the mechanism of democracy employed and the other is the political culture of the society. Neither of these things can be considered in isolation, either from each other or from other factors, including external factors, but together they provide a basic understanding of the differences between, say, Canada and Finland. Only some of these differences can be understood in terms of different democratic mechanisms (e.g. first-past-the-post vs. proportional representation); in order to 'accumulate an unimaginable variation of different ideals' you need a political culture that encourages such diversity as well as the mechanism to give voice to it. It also helps to be a relatively small country in which ideas are a greater factor in everyday political discourse than geography and regionalism.   \n   \nBearing these two things (democratic mechanisms and political culture) in mind, let me answer your question: _Is Israel a democracy John?_   \n   \nYes, Israel is a democracy, and in purely mechanical terms, it is much more like Finland than like Canada. Indeed, one can easily argue that proportional representation, which in the Finnish political culture reflects a diversity of ideals, is one of the factors contributing to what you object to about Israeli government policy. For example, extremist settler groups can find a voice in parliament as a result of proportional representation, and can influence voting blocks on issues affecting the occupied territories. At the same time, Israel manages its own 'unimaginable variation of different ideals' -- especially unimaginable to those who see Israel only in terms of the Palestinian conflict --, including a very significant peace movement and a democratic judiciary that has been effectively utilised by human rights organisations representing Palestinians in Israel and the occupied territories. Considering the particular political culture -- and the external factors that contribute to it -- that resulted in the election of Ariel Sharon, you might pause to consider what kind of country Finland would be if it had spent the past 50 years in near-continuous conflict with belligerent neighbours.\n\n"
    },
    {
      "time": "5 Jan 2004 — 11:43pm",
      "content": "Israel is a democracy for Jews only.   \n [http://www.indybay.org/news/2002/12/1553620.php](http://web.archive.org/web/20131023033616/http:/www.indybay.org/news/2002/12/1553620.php)   \n   \n_political culture -- and the external factors that contribute to it -- that resulted in the election of Ariel Sharon, you might pause to consider what kind of country Finland would be if it had spent the past 50 years in near-continuous conflict with belligerent neighbours._   \n   \nIs it political culture John? Or the morality of its' citizens? Dog pack mob mentality perhaps!   \n   \nAre you saying Finland would be like Israel if it had near-continuous conflict with belligerent neighbours for _only fifty years_. That Fins should now turn to genocide exterminating the Swedish settlers still on it's shores. That now, Fins would be entitled to build 14 foot concrete walls around these Swedes, shoot their woman and children, and also any Swede that _dare protest,_ bulldoze their houses, separate them from employment, farms and fields. Cut down their orchards. Rape their women. Common, you know better than that. Fins are fierce fighters, but they are humans. And they like apples.   \n   \nJohn, assuredly you would be _singing in the choirs of protest_ as would the Americans, your fellow Canadians along with Europeans. You and I both know why. Swedes are _Bright White._ God didn't make people any whiter than the Swedes.   \n   \nFurthermore John, Finland has only had _several years of its' history without conflict and, or occupation._ Thanks to _Hitler,_ this changed.   \n   \nFinland gained her independence in 1917, but she was under \"continuous attack\" and several armed invasions from Russia. The Germans put an end to the threat. After which the Fins drove out the Germans returning to the threat of Russia. This stopped at the end of the cold war. Those conflicts have not made the Finnish people butchers of innocent women and children.   \n   \nThey are _world re-known for human rights and sexist issues._ Such comparison is extreme insult.   \n   \n [http://www.freedomofchoicecanada.org/Consent/BR1-84-helsinki.pdf](http://web.archive.org/web/20131023033616/http:/www.freedomofchoicecanada.org/Consent/BR1-84-helsinki.pdf)   \n   \nI don't think Israel makes that grade, do you? Not even after the second coming of Idi Amin.   \n   \n [http://www.moreorless.au.com/killers/amin.htm](http://web.archive.org/web/20131023033616/http:/www.moreorless.au.com/killers/amin.htm)\n\n"
    },
    {
      "time": "6 Jan 2004 — 3:03am",
      "content": "There goes that productive anti-semite word once again. \"Every body hates me, nyah, nyah, nyah ha\".   \n   \n [http://www.iht.com/articles/123581.html](http://web.archive.org/web/20131023033616/http:/www.iht.com/articles/123581.html)\n\n"
    },
    {
      "time": "6 Jan 2004 — 5:59am",
      "content": "Gerald writes:   \n [http://www.indybay.org/news/2002/12/1553620.php](http://web.archive.org/web/20131023033616/http:/www.indybay.org/news/2002/12/1553620.php)   \n   \nThis article cites, among other things, Israel's \"right of return\" as evidence of racism.   \n   \nTo this day, Gerald, one has been able to emigrate to Germany as long as one can prove that one's ancestors were German. Would you call modern Germany a racist state? If not, would you call this a racist policy?\n\n"
    },
    {
      "time": "6 Jan 2004 — 10:45am",
      "content": "Gerald, if 'Israel is a democracy for Jews only' how come they have representatives of Arab political parties sitting in their parliament? How come they have an Arab judge sitting on their High Court? How come my Arab Israeli friends are able to vote in Israeli elections? How come my Arab Israeli friends would rather be citizens of Israel than of, say, Syria, or even Jordan or Egypt?   \n   \nUnderstand, I'm not saying that Israeli democracy is anything like perfect, or that the legal position of Arab Israelis can't be significantly improved (not least by prohibiting private discrimination against them by employers, etc.). But it is a calumny to say that Israel is a democracy only for Jews.   \n   \nIt is also a calumny to accuse the Israelis of genocide: a calumny against both the Israelis and the Palestinian fighters. When much of the world's media was swallowing the lie that Israeli troops had deliberately massacered civilians in Jenin (a lie that still gets repeated, despite even the report of _Palestinian_ doctors in Jenin that the massacre never took place), the Palestinian Authority was declaring a military victory in Jenin because 15 Israeli soldiers had been killed in the _battle._ If the Israelis wanted to practice genocide, this whole conflict would be over in a matter of minutes. Instead, Israel puts its soldiers at risk conducting infantry searches for armed militants who have declared themselves to be dedicated to the destruction of Israel -- not to peace, not to human rights, not to a separate Palestinian state: 'Israel will exist and will continue to exist until Islam will obliterate it, just as it obliterated others before it' (Hassan al-Banna quoted in the Hamas Covenant) --; if it were interested in genocide, Israel could level entire towns with missiles without any risk to its own soldiers. As I've said in the past, much of Israel's actions in the occupied territories are immoral and illegal -- including the crime of turning off the water supply to Jenin during the incursion --, but calling it 'genocide' is unsupportable by the evidence of either the method or the result.\n\n"
    },
    {
      "time": "6 Jan 2004 — 11:20am",
      "content": "John Butler   \n   \nGermans, nor the Italians, (I have personal knowledge of Italian right of return immigration practices regarding ancestry) require racial purity, proof of \"motherhood\", or spiritual gravity towards specific religions as condition to their return immigration practices. They require proof their ancestors lived in Germany, or Italy. Skin colour is not a requirement.   \n   \nThat is not racism. That is claiming ancestral rights.   \n   \nWhy, do you think the German state is racist?\n\n"
    },
    {
      "time": "6 Jan 2004 — 11:46am",
      "content": "John,   \n   \n_accuse the Israelis of genocide:_ That is odd John, you accused Sharon of the same thing yourself, so did the Belgium court.   \n   \nWhy am I always to blame?   \n   \nMaybe Sharon should clear his name and insist on a trial, or sue for defamation of character. What's your take?   \n   \n [http://www.iran-press-service.com/articles\\_2003/Feb-2003/sharon\\_trial\\_13203.htm](http://web.archive.org/web/20131023033616/http:/www.iran-press-service.com/articles_2003/Feb-2003/sharon_trial_13203.htm)\n\n"
    }
  ]
}
