{
  "id": "2677",
  "title": "My big plunge",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Ok, I'm putting this out for the world to see. I'm looking for constructive criticism, just realize that I am really an amateur here. I am especially looking for comments on metrics/spacing, and stylistic coherence because these are things I just plain don't see well.\n\n<!--attachment: Oregon-23901.gif*attachment_icon.gif*image/bmp*1161.7 **Oregon%2egif --><!--attachment: Oregon-23901.gif*attachment_icon.gif*image/bmp*1161.7** Oregon%2egif -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150417173515im_/http:/www.typophile.com/forums/icons/attachment_icon.gif\" align=\"left\" alt=\"image/bmp\"><br><a href=\"http://web.archive.org/web/20150417173515/http:/www.typophile.com/forums/messages/29/Oregon-23901.gif\" target=\"_blank\"><b>Oregon.gif</b></a> (1161.7 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "vanisaac",
  "time": "11 Jan 2004 — 5:53am",
  "uid": "2876",
  "comments": [
    {
      "time": "11 Jan 2004 — 3:29pm",
      "content": "Woah, that file is over a megabyte!   \n   \nSave down to 16 colours, that's more than enough for anti-aliasing and it'll bring the file size down.   \n   \nAnyway, some letters like the B, P, G and W are squished, could be wider. The S is weird, but I don't know enough to say why it is, someone else might be able to elabourate.   \n   \nI like the concept for the ampersand, but it looks very rough, needs to be fixed up a bit.   \n   \nAlso, I don't know if it's me or not, but the thickness of the letters doesn't seem to be very consistant.\n\n"
    },
    {
      "time": "11 Jan 2004 — 4:16pm",
      "content": "Van, I can't open the file - it's corrupted, or at least acts so on my end (WinXP).   \n   \nhhp\n\n"
    },
    {
      "time": "11 Jan 2004 — 5:04pm",
      "content": "Ok, I'll try it again. This one's only 21 K. I'm not sure what's up with the thickness not seeming even, as every vertical line is a consistent mathematical width. If you could tell me which characters seem inconsistent with others, that might help if there is an optical distortion that I don't see because I'm so close. I'm taking a look at the P,B,G,and W. Thanks.   \n ![](http://web.archive.org/web/20150417173515im_/http:/www.typophile.com/forums/messages/29/23915.gif)\n\n"
    },
    {
      "time": "11 Jan 2004 — 6:06pm",
      "content": "I think what Chris means about the thickness is some of your diagonals: like the M, that is way off from the rest. It isn't really up to mathmatical precision of your stems, it is also things like the terminals and horiz/vert joins and the spaces around and within the glyphs. The size of the 'e', for example, iseems larger and lighter than the 'd'. The hairlines in 'v' seem thinner than those of the 'y'. This is a good, fairly complete start! I reckon the next step is to make the glyphs a little more consistent.   \n   \nkris.\n\n"
    },
    {
      "time": "11 Jan 2004 — 7:38pm",
      "content": "God help me, but this is just a small sample of they glyphs in this face. I have about a thousand glyphs, including 50 ligatures so far, nearly complete Greek and Cyrillic glyphsets, IPA characters, and extended Latin characters. The reason I put the simple Roman out is that I can use that information throughout the face. The mistakes I've made here are ones I have probably made everywhere, and I've already started using these critiques throughout.\n\n"
    },
    {
      "time": "11 Jan 2004 — 10:11pm",
      "content": "You can't rely on mathematics alone. You have to compensate sometimes for thing to look optically correct.   \n   \nTo me f h i and j look too thick, and the k looks too thin. A couple other letters look out of sorts as well.   \n   \nThough, this could be an artifact of turning your outlines into bitmaps as well. A PDF'd sample would be helpful.\n\n"
    },
    {
      "time": "11 Jan 2004 — 10:53pm",
      "content": "\\> I have about a thousand glyphs   \n   \nOuch. The \"plunge\" seems to have been a while ago, actually...   \n   \nWell, the good news is that such obsessive behavior is a requirement for type design. :-)   \nThe bad news is that -as far as I'm concerned- just what you've shown really needs a _lot_ of polish...   \n   \nUnless the intent -or at least an acceptable result- is to have a rough, \"naive\" looking font, there are issues of both structure and finish that need to be commanded before you worry about the _quantity_ of glyphs. I don't want to be discouraging - in fact I think your heart is in the right place! But before you do any more bezier-pushing maybe it's a good time to look closely at existing (good) designs first? Develop a grasp of how things balance.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jan 2004 — 3:11am",
      "content": "Chris- Unfortunately, I don't have PDF capability. I will check at school (I am an AmeriCorps volunteer) to see if someone has the software, but I don't know of any Acrobat writers at my disposal.   \n   \nDo you think the ball terminal of the j is too heavy, or is it the body? And does the short ascender on the k make it too weak? For h and i, is it more of a cramped flow (spacing/metrics) or are the glyph forms too heavy?   \n   \nHrant - the purpose was to actually do something artistic, for once in my life. And I never worried about the quantity of glyphs, it was just borne out of my process; If I got stuck, I'd go and find some composite characters to make till inspiration hit.   \n   \nThat said, what are the issues of structure and finish that you see being detrimental to the face as it currently stands? Does it lack historical cohesiveness? Is it more a matter of color and feel? And more importantly, what do you mean by \"how things balance\"?   \n   \nPS, it was the fit of obsessiveness with type design that turned me on to it in the first place.\n\n"
    },
    {
      "time": "12 Jan 2004 — 6:08am",
      "content": "Hello Van.   \n   \nWelcome to typophile. This is a great first effort!   \n   \n_That said, what are the issues of structure and finish that you see being detrimental to the face as it currently stands?_   \nBeing a first effort, you've turned up many of the classic first time problems. Many of the issues turn up as a result of the constructed nature of your font (ie. you've borrowed the o to make the c, you've borrowed the c to make the n, youve borrowed the n to make the h, and I don't know why she swollowed the fly.) This is a very common way of doing things (even among accomplished designers). With time you will learn how the constructed letters need to be \\*fixed\\* to look correct. Aside from that, consider first the following font-wide problem:   \n   \n_Stoke Modulation:_ This is the location and flow of the thicks and thins of your font. Kudos to you, the locations of thick and thin look pretty good, it's the consistent application of thick and thin that is a big issue here\n\n"
    },
    {
      "time": "12 Jan 2004 — 8:16am",
      "content": "Another highly helpful post, Randy!   \n   \nAnd Van, sorry if I sounded too negative - this is actually notably better than my own first effort...   \n   \nhhp\n\n"
    },
    {
      "time": "12 Jan 2004 — 3:14pm",
      "content": "\"Chris- Unfortunately, I don't have PDF capability. I will check at school (I am an AmeriCorps volunteer) to see if someone has the software, but I don't know of any Acrobat writers at my disposal.\"   \n   \nWhat are you using to draw your characters? If you're using Illustrator that can save as PDF.\n\n"
    },
    {
      "time": "13 Jan 2004 — 1:14pm",
      "content": "I actually use the Font Creator Program ( [www.high-logic.com](http://web.archive.org/web/20150417173515/http:/www.high-logic.com/)), a native True Type editing tool, so I'm directly manipulating the quadratic Bezier curves of my ttf file. No PDF save option there. I really am not the artist type. I don't know what I'd do with a tool like Illustrator. Probably nothing - it'd be so over my head.   \n   \nHrant - I didn't take it personally, and I apologize if I sounded as such. I just wanted you to know where I was coming from on this.   \n   \nRandy - that was incredibly helpful, and I am carving out some time to work with your suggestions. Hopefully this evening will pan out. As is, I thank everyone who has posted here. You have inspired me and given me the guidance to continue working on this so that it becomes as good as it can.   \n   \nThanks guys. I'll post back as soon as I can implement most of this. Hopefully, I'll find a PDF writer somewhere on campus by that time.\n\n"
    },
    {
      "time": "11 Feb 2004 — 10:48am",
      "content": "Sorry for digging up / polluting this thread, I just wanted to thank Randy for his highly insightful posts on type design. I'm sure I'm not the only lurking beginner/layman on this subforum to appreciate your posts. Thanks for sharing!\n\n"
    },
    {
      "time": "16 Nov 2009 — 8:46am",
      "content": "where can you find unicode version of Oregon font?\n\n"
    }
  ]
}
