{
  "id": "26813",
  "title": "Booktracker Update! Book 19 moves on",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Jared Benson](http://web.archive.org/web/20090714060548/http:/typophile.com/user/3 \"View user profile.\") : 6.Aug.2003 1.50pm \n\nFor those of you who are following along, the Typophile Book project marches on! We've recently updated the booktracker page with our first designer's entry!   \n   \nBook #19 was given out at TypeCon to Amy Conger ( [http://www.abecedarienne.com](http://web.archive.org/web/20090714060548/http:/www.abecedarienne.com/)) of San Francisco, who sent us images of her three spreads before passing it to a colleague. We couldn't be more thrilled!   \n   \nAmy tells about her experience:\n\n> \"When I got the book, my mind started running wild with ideas. Having no idea of what or how much was expected of me, I decided to do my own thing, of course. I did three spreads of typographically-inspired collage. (It was a challenge to keep the book clean while working!)   \n>    \n> When I was done, I was pleased with the result, and I felt a little remorse in passing it on -- but that's part of the deal, of course. Kiss it and let it go...   \n>    \n> The next decision was who to send it to. I thought of so many font-makers, calligraphers, illustrators and so on. But I settled on one who is local and who I figured would not otherwise be included: artstar Marlon Vito Picasso. His mailart style is great for this sort of thing, and he is outside the design community, so I think he might send the book on a unique trajectory.   \n>    \n> It also occurred to me that there was a disadvantage in being first: you don't get to see anyone else's artwork! But I am looking forward to seeing the finished products.   \n>    \n> My only concern now is that some of the 20 books won't make it back to Typophile for whatever reason. So, you all out there: when a book comes your way, do the right thing and register immediately! If you get married or kidnapped or the book gets lost in your studio, we want to be able to track you down!\"\n\nSee images of Amy's work and photos of the first 3 books at [http://www.typophile.com/booktracker/](http://web.archive.org/web/20090714060548/http:/www.typophile.com/booktracker/)   \n   \nAll 20 books have been spoken for, but if you want to add your name to the queue of potential recipients, email your name and mailing address to [booktracker@typophile.com](mailto:booktracker@typophile.com).\n\n",
  "author": "<a href=\"http://web.archive.org/web/20090714060548/http:/typophile.com/user/3\" title=\"View user profile.\">Jared Benson</a>",
  "time": ": 6.Aug.2003 1.50pm",
  "uid": "3",
  "comments": [

  ]
}
