{
  "id": "2682",
  "title": "Sans font(s) that work best at 4 or 5 pt",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Know of any?\n\n",
  "author": "<a href=\"user/2395\" title=\"View user profile.\">emp</a>",
  "time": "<br>",
  "uid": "2395",
  "comments": [
    {
      "time": " 12 January, 2004 - 9:19am",
      "content": "The font that I usually use at 5pt is FF DIN Regular. It's ultra legible for that size.\n\n"
    },
    {
      "time": " 12 January, 2004 - 9:34am",
      "content": "You could try Signa, considering it has a huge x-height...\n\n"
    },
    {
      "time": " 12 January, 2004 - 10:19am",
      "content": "Bell Centennial, etc.   \n   \nhhp\n\n"
    },
    {
      "time": " 12 January, 2004 - 10:27am",
      "content": "Din, Meta, FFOcr (esp as caps, Section, Info, some of the Bell Fonts were designed especially with bleed agates for phonebooks and can be printed very small. On that note, maybe Fontbureaus Amplitude works as well, I sadly can't test it though, as I don't owe that font.\n\n"
    },
    {
      "time": " 12 January, 2004 - 10:32am",
      "content": "Thanks, fans. After putting a few that I own to the test, I realized that I also need italics and at least one heavier weight. DIN condensed doesn't have italic versions and neither does Bell Centennial. Sorry I didn't mention this earlier.   \n   \nEDIT (one more time): I should have mentioned that this font will be used for legal copy. So I want a condensed type that I can cram as much copy into the space as possible.\n\n"
    },
    {
      "time": " 12 January, 2004 - 11:05am",
      "content": "Eric, you might look at non-condensed types. When you are dancing on the edge of readability, non-condensed type actually saves space over condensed type. (Among other things,) condensing a type emphasizes the vertical strokes and de-emphasizes the horizontals. This makes the face more difficult to read, so you have to increase the type size. All other things equal, I can usually save 5-10% by switching to a non-condensed version.   \n   \nOf course, the whole point of legal \"fine print\" is to make it difficult to read, so that might not be an issue. Extra points if you screen it back 50%.\n\n"
    },
    {
      "time": " 12 January, 2004 - 1:22pm",
      "content": "I don't know how well it works, but [Biblion](http://web.archive.org/web/20060529233700/http:/www.itcfonts.com/fonts/detail.asp?nCo=AFMT&PID=ITC9188) was designed to print at very small sizes, has an italic, and won an award. You might have a look at it. There is a PDF at Stormtype.com, but I couldn't get it to download.\n\n"
    },
    {
      "time": " 12 January, 2004 - 2:40pm",
      "content": "Legal copy, eh? Well, legibility probably the real concern then, right? It doesn't have to be _easy_ to read, merely capable of being read. Helvetica Condensed is used on all of the Terms and Conditions of legal/ contractual documents I handle where I work. I don't believe that they are 4 or 5 pt, but more like 6-8, and it works. Give it a try. It's not a type-saavy choice, but it's got what you need, and doesn't have much character to get in the way of legibility. However, glancing at the last few posts, I'm inclined to agree with Jay about dancing on the line when you get as small as you say you will.   \n   \nAlso, if you're working on a legal document, check how the type reproduces after faxing, which may eliminate some contenders for you. Helvetica Condensed survives enough for purposes of the company I work for.\n\n"
    },
    {
      "time": " 12 January, 2004 - 9:04pm",
      "content": "What about this:   \n   \n [http://www.letterror.com/foundry/goodies/index.html](http://web.archive.org/web/20060529233700/http:/www.letterror.com/foundry/goodies/index.html)   \n   \nIt is made especially for contracts/legal copy, and it is absolutely free!   \n   \n(tongue firmly in cheek!)   \n   \nkris\n\n"
    }
  ]
}
