{
  "id": "26825",
  "title": "The ATypI Auction 2003: Call for Donations",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20101227041137/http:/typophile.com/user/108 \"View user profile.\") : 28.Aug.2003 10.12am \n\nHello everyone,   \n   \nOn Friday, September 26th in Vancouver we will have our 2003 ATypI Auction, an event that everyone looks forward to. The Auction is an important way in which ATypI raises money to pay for our publications/website, as well as being a wonderful way to buy type treasures provided by friends of ATypI.   \n   \nPlease bring your auction item(s) with you to the Conference, and give it to the organizers when you arrive. If you are not attending, but still wish to send something, please give it to someone who is attending to bring for you. (Contact us if this presents a problem for you). Items will be accepted on site in Vancouver up to the last minute, however it would help very much to have the information about your donation as soon as possible.   \n   \nPlease feel free to forward this message to anyone you think would be interested in participating.   \n   \nIf you are planning to bring or send any items for the Auction, please send the information below to [atypi@typofonderie.com](mailto:atypi@typofonderie.com). We will compile a complete list of items and then will distribute the list via e-mail prior to the start of the conference, and possibly again showing late arriving items after the start of the conference. Again, if you are unable to attend the Conference and wish to send your items, please specify this in your email so that we can make arrangements.   \n   \nName of Donor   \nName of Item   \nBrief Description   \nBrief statement about the item that may be of interest  i.e., how you came to have it, significance of the item, or special notes that will help bidders appreciate its importance.   \n   \nAll messages to the auction mailbox ( [atypi@typofonderie.com](mailto:atypi@typofonderie.com)) will be acknowledged indeed.   \n   \nPlease feel free to give as many items as you like for this event, anything type related, from rare specimens, to T-shirts, wood type, drawings, etc, Your participation through donating Auction items makes this event possible, and great fun for everyone. We thank you very much!   \n   \nSincerely,   \nTiffany Wardle and Jean François Porchez   \nAuction Organizers for ATypI Vancouver 2003   \n [atypi@typofonderie.com](mailto:atypi@typofonderie.com)   \n [http://www.atypi.org/40\\_conferences/28\\_Vancouver/30\\_other\\_events](http://web.archive.org/web/20101227041137/http:/www.atypi.org/40_conferences/28_Vancouver/30_other_events)\n\n",
  "author": "<a href=\"http://web.archive.org/web/20101227041137/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 28.Aug.2003 10.12am",
  "uid": "108",
  "comments": [

  ]
}
