{
  "id": "26837",
  "title": "French graphic design great Massin to appear in San Francisco",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [tamye](http://web.archive.org/web/20090526010542/http:/typophile.com/user/107 \"View user profile.\") : 14.Sep.2003 11.35pm \n\nThrough September 26, the San Francisco Center for the Book (SFCB) hosts \"Massin in Continuo: A Dictionary,\" a touring exhibition devoted to French graphic design artist Robert Massin. SFCB has just announced a symposium will be held in conjunction with the exhibition, focusing on Massin's career as one of the world's great book designers.   \n   \nThe event will take place Saturday, September 20, in San Francisco. Massin, often called the father of expressive typography, will journey from his home in Paris to appear at the symposium. Other presenters will include Seattle-based type and design authority John Berry, and exhibition curator Laetitia Wolff (editor-in-chief of \"Graphis\" magazine and founder of New York-based marketing/design firm futureflair).   \n   \nThe Massin Symposium will be held Saturday, September 20, from 2-4 p.m., at the California College of the Arts (CCA), Timken Lecture Hall, 1111 8th Street, San Francisco. A reception immediately follows at SFCB, 300 De Haro Street. Both events are free and open to the public.   \n   \nMassin's graphic interpretations of dramatic works remain some of the most unique and influential examples of the potential for dynamic interaction between word and image. His in-depth survey of letterforms in Western cultures, \"Letter & Image,\" is a major contribution to the understanding of graphic arts. His manipulations of typography in the 1950s anticipated the elastic spatial possibilities of computer graphics. Massin's collaborations with writer Jean Cocteau and playwright Eugene Ionesco yielded a new \"visualized literature.\" His masterwork for Gallimard's 1964 edition of Ionesco's \"The Bald Soprano\" combines the pictorial economy of a comic book with the letter play of Surrealist poetry.   \n   \nThe exhibition originated at the Cooper Union School of Art's Herb Lubalin Study Center of Design and Typography in New York, and has since traveled to Los Angeles, Boston, Baltimore, and Montreal. The exhibition is produced by futureflair, with assistance from the Cultural Services Department of the French Embassy in New York. The symposium and reception are presented by SFCB, with support from Mills College Center for the Book, CCA, the Book Club of California, and The Society of Typographic Aficionados (SOTA).   \n   \nFor more on Massin, see John Berry's article on Creative Pro, located at   \n [http://www.creativepro.com/story/feature/19759.html](http://web.archive.org/web/20090526010542/http:/www.creativepro.com/story/feature/19759.html). For further details on the symposium and exhibition, call 415-565-0545, email [info@sfcb.org](mailto:info@sfcb.org), or visit the SFCB website at [http://www.sfcb.org](http://web.archive.org/web/20090526010542/http:/www.sfcb.org/).\n\n",
  "author": "<a href=\"http://web.archive.org/web/20090526010542/http:/typophile.com/user/107\" title=\"View user profile.\">tamye</a>",
  "time": ": 14.Sep.2003 11.35pm",
  "uid": "107",
  "comments": [

  ]
}
