{
  "id": "26845",
  "title": "ATypI Auction Update #2",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20100217233934/http:/typophile.com/user/108 \"View user profile.\") : 19.Sep.2003 11.00am \n\n**ATypI Auction news #2**   \n   \nDo you have empty shelf space? Are you a humble bibliophile? Are you a type designer that has only worked digitally? Do you collect rare printed or lettered work? Are you a typophile? With every century represented this year, it is quite possible that every typophile's desires will be met.   \n   \n_The original publication of this text came from the [ATypI News Section](http://web.archive.org/web/20100217233934/http:/www.atypi.org/news_tool/news_html?newsid=126&from=/), posted on 19 September 2003 by Jean-François Porchez & Tiffany Wardle, ATypI Vancouver_   \n   \nA drawer or two that are begging to be used? Do you have an empty hole on a wall that you would like to fill? Do you collect all things Monotype? Well, we have pamphlets and posters, books and booklets, matrices and brass, periodicals and journals, bins and boxes, and bags and t-shirts. All for the taking should your bid be the highest.   \n   \nAre you a humble bibliophile? How about _Printing Metals_, Fry's Metal Foundries, London, 1936. Or _A Book of Scripts_ by Alfred Fairbanks, Penguin Books, First Edition, 1949. That's right, this one was designed by Jan Tschichold. And _Orthotypographie_ by Jean Méron, preface by Fernand Baudin, composed in Photina. _La Fonderie Typographique_ by Honoré Balzac, reprint presented by René Ponot (1917-2003) and preface by John Dreyfus (1918-2002). And not to forget _Dutch Typefounders' Specimens_, Dutch typefaces from Nikolaas Kis (1687) to TEFF (PMN Noordzij) Lexicon (1997) (John Lane and Mathieu Lommen) 356 pages. English. Also donated is a Deluxe (unbound) Edition of _Dear. Mr. Hunter_, this book was compiled from letters between Vojtech Preissig and Dard Hunter which occurred in 1920. Plus!! A whole plethora of other rare type specimens and books on typography.   \n   \n ![](http://web.archive.org/web/20100217233934im_/http:/www.typophile.com/forums/messages/72/16459.jpg)   \n  \n ![](http://web.archive.org/web/20100217233934im_/http:/www.typophile.com/forums/messages/72/16460.jpg)   \n   \n_(Top) Christian Paput shows his belowed Échoppe that he used for 30 years to cut several Garamonts. What a symbol this small nice tool in a box! And (below) he shows how it's used._   \n   \nAre you a type designer that has only worked digitally? Or are simply a traditionalist needing more tools? We have _Punchcutting_ by Christian Paput. A Small book in French and English which explains the punchcutter's job. But for this rare gem to be used properly you will need the Échoppe, which is a very rare tool in a box from the last official punchcutter of the world, Christian Paput, Imprimerie Nationale. This tool is composed of two parts, metal part (10 years old) who probably be used to repair some Garamont, Romain du Roi. The wood part show the initials from the owner (30 years old).   \n   \nDo you collect rare printed or lettered work? How about a folio double-sided two-page spread from the Ashendene Press edition of _Don Quixote_? Or is the Incunable period more to your liking? We have a quarto double-sided single page from _Scriptores Historiæ_ _Augustæ_. Printed by Joannes Rubeus Vercellensis, in Venice, 1490.   \n   \n ![](http://web.archive.org/web/20100217233934im_/http:/www.typophile.com/forums/messages/72/16461.jpg)   \n  \n_Albert Boton show us one of the large collection of various drawings from his Carrénoir typeface (originally called Quadrat)_   \n   \nAre you a typophile? Do you collect rare bits and bobs that only someone as refined as yourself could possibly understand? We have two Monotype Composition Matrix Cases with Matrices:10 point Times New Roman with Italic and Small Caps10 point Caslon 37 with mixed sorts. And two banks of Monotype Keyboard Buttons. One Left hand side. One Right hand side. These are a pair that slide onto the keyboard to activate the keybars that drive the punches to make the controller ribbon that gives air-activated signals to the Monotype Composition Caster.   \n   \nWith every century represented this year, it is quite possible that every typophile's desires will be met. Keep the donations coming!! It will be your donations that make the auction great.   \n   \n ![](http://web.archive.org/web/20100217233934im_/http:/www.typophile.com/forums/messages/72/16462.jpg)  \n   \n_Marc Kopylov, the French publisher of the Éditions des Cendres (he was at ATypI Lyon, 1998), is quite obviously proud of the new huge reprint of the Didot specimen. Just published this year, it will be availabe to see and to bid for during the Auction._   \n   \nTiffany Wardle and Jean François Porchez   \nAuction Organizers for ATypI Vancouver 2003   \n   \n_Note about the images: All have been shot on the 18 September 2003 by Jean François during his Auction Paris tour. More are available and offered to the purchasers of the corresponding items (if they ask!)._\n\n",
  "author": "<a href=\"http://web.archive.org/web/20100217233934/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 19.Sep.2003 11.00am",
  "uid": "108",
  "comments": [

  ]
}
