{
  "id": "26870",
  "title": "Erik Spiekermann receives Gerrit Noordzij Prize",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Jared Benson](http://web.archive.org/web/20090525212142/http:/typophile.com/user/3 \"View user profile.\") : 23.Oct.2003 5.16pm \n\nFor immediate release   \nOctober 21, 2003   \n   \n   \nType designer Erik Spiekermann receives Gerrit Noordzij Prize   \n   \nThe Gerrit Noordzij Prize has been awarded to Erik Spiekermann for the typefaces that he has designed and for his contribution as co-founder of FSI FontShop International and the FontFont library. The prize is an initiative of the postgraduate course in type and media at the Royal Academy of Art and the Meermanno Museum in The Hague to award designers playing an important role in type design and typography. The jury consisted of Jack Verduyn Lunel, Marie Christine van der Sman, Fred Smeijers, Robin Kinross and Petr van Blokland. The prize was given to Erik Spiekermann on October 17, 2003 at the gallery of the Royal Academy of Art in The Hague at the opening of an exhibition of the work of Fred Smeijers, the previous winner of the Prize.   \n   \nErik Spiekermann is an information architect, type designer (FF Meta, the new FF Unit, ITC Officina, FF Info, FF Govan, and others) and author of books and articles on type and typography.   \n   \nIn 1979 he founded MetaDesign, Germany's largest design firm with offices in Berlin, London and San Francisco. Projects included corporate design programmes for Audi, Skoda, Volkswagen, Lexus, Heidelberg Printing, Berlin Transit, Duesseldorf Airport and many others. In 1988, with Joan Spiekermann, he started FontShop, a company for production and distribution of electronic fonts. He holds a professorship at the Academy of Arts in Bremen, is a board member of ATypI and the German Design Council, president of the International Institute of Information Design and of the International Society of Typographic Designers.   \n   \nIn July 2000, Spiekermann withdrew from the management of MetaDesign Berlin. He now lives and works in Berlin, London and San Francisco, designing publications, complex design systems and more typefaces. His new project is The United Designers Network and brings together a lot of the people he has worked with over the past 25 years.   \n   \nIn 2001 he redesigned The Economist magazine in London. His book with co-author E.M. Ginger for Adobe Press, Stop Stealing Sheep (now in its second edition), came out in 1993 and has sold over 150,000 copies. His corporate font family for Nokia was released in 2002. He is currently designing the corporate design programme for Deutsche Bahn (the German railway system), including a family of corporate typefaces, and preparing a relaunch for the German newspaper Der Tagesspiegel.   \n   \n# # #   \n   \nBackground Info: Typefaces by Erik Spiekermann   \n   \n   \nFF Unit\n\n",
  "author": "<a href=\"http://web.archive.org/web/20090525212142/http:/typophile.com/user/3\" title=\"View user profile.\">Jared Benson</a>",
  "time": ": 23.Oct.2003 5.16pm",
  "uid": "3",
  "comments": [

  ]
}
