{
  "id": "26895",
  "title": "[Will work for Fonts?]",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Jared Benson](http://web.archive.org/web/20090526005656/http:/typophile.com/user/3 \"View user profile.\") : 16.Dec.2003 2.31pm \n\nFontShop has asked me to share this with you. //jared   \n   \n**Keywording fonts for fonts and prizes!**   \n   \nKeywording fonts for sale online seems to have become a necessity now-a-days. How else does anybody but a handful of typomaniacs find their way around all that's on offer? Customers ask us all the time to please let them search by keywords. There are obviously people who want   \nto look for a correspondence font in Cyrillic or a headline for a rave magazine without any idea of what's available. We need to accommodate them, whether we like that approach or not. As we are busy working on a new site, it would be nice to have this feature available at the time of the relaunch.   \n   \nNo mean task with more than 25,000 individual fonts in the FontShop database. Who would consider that fun?   \n   \nWell: after having followed the conversations on typophile.com, we realized that I may not be the only mad person who enjoys reading proofs for the FontBook. Typophile.com must be the most type dedicated and knowledgeable of all the type sites. Then perhaps there are some of you out there who want to help us with this mammoth task? We offer **font rewards** and a draw for a grand prize which we're sure you'll like.   \n   \nIf you're interested in finding out more, read below.   \n   \nErik Spiekermann   \n   \n   \n**Information**  \n   \n- You will receive random single fonts from our database accessed with your own individual code number.   \n- There are 12 fields: 2/3 are supplied by the database, 7 fields require you to click one or more pre-selected radio buttons in each field to describe the font, the last 2 fields are filled in manually only if you are able.   \n   \nSelected participants will be required to register, agree to a non-disclosure and keyword a minimum of 50 single fonts (fifty). Once you have completed 50 fonts, decide if you've had enough or want to go onto the next 50 and so on until the database is complete.   \n   \n   \n**Rewards**  \nFor keywording the following number of fonts you can choose from our FontFont library accordingly:   \n   \n50 single fonts (the minimum): you will receive **I free font of your choice** from the FontFont library (value $40)   \n   \n100 single fonts: choose **3 single FontFonts or package costing up to $129** from the FontFont library   \n   \n150 single fonts: choose **5 single FontFonts or package up to $179**   \n   \n200 single fonts: choose **8 single FontFonts or package up to $249**    \n   \nYou can do more, if you like for the same rewards. For example keywording 400 fonts will get you twice the rewards as 200. FontFont designers will, of course, receive their usual royalties on the fonts you choose.   \n   \n**Grand Prize:**    \nEveryone who completes keywords for the minimum of 50 fonts will be entered into THE GRAND DRAW!   \n   \n**A trip to Berlin Germany in May 2004, flight (economy) for one person, one ticket to FontShop Germany's 3 day Berlin Typo04 conference where this year's theme is \"Schrift\" (translation type/the written word) plus 5 days /4 nights accommodation.**    \n   \nAnd a **roundtrip flight from Berlin to Antwerp, Belgium, 2 nights.** Visit to the famous Plantijn-Moretus museum with Fred Smeijers and Rudy Geerarts. Dinner with Rudy and Fred. Fred is well known for many type designs including FF Quadraat and Fresco. Fred's latest book is entitled \"Type Now and work so far\". Rudy Geearts is the founder of FontShop Benelux and the energy behind Druk, Undercover and now 96 - all great publications by FontShop Benelux.   \n   \nThe random draw will be by Typophile, supervised by Jared Benson.   \n   \nIf you want to join in, send a brief email to [keywording\\_project@typophile.com](mailto:keywording_project@typophile.com) with your qualifications. As there are limited spaces available, only serious applicants **who know type** need apply. All applicants will be subject to a selection process based on available positions.   \n   \nThank you!\n\n",
  "author": "<a href=\"http://web.archive.org/web/20090526005656/http:/typophile.com/user/3\" title=\"View user profile.\">Jared Benson</a>",
  "time": ": 16.Dec.2003 2.31pm",
  "uid": "3",
  "comments": [

  ]
}
