{
  "id": "26918",
  "title": "Type Identification Board - Frequently Asked Questions",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": " **How do I post a type identification request?**   \n   \nAt the top of the main page you'll see a link which says [Start a new thread \\>](http://web.archive.org/web/20150425041357/http:/www.typophile.com/cgibin/board-post.pl?HTTP_REFERER=/83/83.html&action=form). Click it. You can also use the [Start New Thread](http://web.archive.org/web/20150425041357/http:/www.typophile.com/cgibin/board-post.pl?HTTP_REFERER=/83/83.html&action=form) in the gray block at the bottom of the thread list.   \n   \n**What do I enter in the \"Subject\" line?**   \n   \nTry to define your type ID request as clearly as possible. For example \"1960's newspaper headline face\" or \"Lost in Translation movie logo\" or \"retro script\" will do nicely. Whereas \"Please help me identify this font\" is pretty pointless as that's the only thing we do on the Type Identification Board. Compare it to a newspaper where every single headline would say \"Stuff happened!\"   \n   \n**How do I post the sample to be identified?**   \n   \nThere's a whole topic on adding [Images, Attachments and Clipart](http://web.archive.org/web/20150425041357/http:/www.typophile.com/cgibin/discus.pl?pg=formatting#images) in the [Formatting](http://web.archive.org/web/20150425041357/http:/www.typophile.com/cgibin/discus.pl?pg=formatting) section on the [Help](http://web.archive.org/web/20150425041357/http:/www.typophile.com/cgibin/discus.pl?pg=help) page. If your sample is available online, you can also link to it via a [Hyperlink](http://web.archive.org/web/20150425041357/http:/www.typophile.com/cgibin/discus.pl?pg=formatting#links), though we prefer a sample in the thread itself.   \nMake sure your sample image is compatible with this board (rgb GIF or JPEG only, no TIFF or BMAP) and try not to exceed 556 pixels in width.   \n   \n**How do I create these nifty red hyperlinks?**   \n   \nHow to add [Hyperlinks](http://web.archive.org/web/20150425041357/http:/www.typophile.com/cgibin/discus.pl?pg=formatting#links) gets explained in the [Formatting](http://web.archive.org/web/20150425041357/http:/www.typophile.com/cgibin/discus.pl?pg=formatting) section on the [Help](http://web.archive.org/web/20150425041357/http:/www.typophile.com/cgibin/discus.pl?pg=help) page. If you type in a regular URL like [http://www.typophile.com/forums/messages/83/83.html?1075593513](http://web.archive.org/web/20150425041357/http:/www.typophile.com/forums/messages/83/83.html?1075593513) it will activate the URL automatically, but it's tidier to \"cleanlink\".   \n   \n**Can I help with the identification of my sample?**   \n   \nAs a matter of fact yes. Tell us whatever you know about your sample that might be useful. Information such as the country and age of the sample, and whether it is from a web site, or from a scan of printed material. (For example, if we know something comes from an advertisement published in the 50's it rules out a lot of possibilities.)   \n   \n**Do I need to register to post a type ID request?**   \n   \nNot at all: this is a public posting area. If you are a \"returning customer\" it's nicer if you register of course. What the heck, it's free!   \n   \n**Is this a free service?**   \n   \nYep, lucky you. Most of the areas on Typophile are free, but if you wish to support Typophile, gain access to the members-only areas and receive cool stuff, you can [Become a Member](http://web.archive.org/web/20150425041357/http:/typophile.com/needs/your/support/).   \n   \n**I've posted an ID request just three minutes ago and my sample has already been identified. How is that possible?**   \n   \nAlmost all of our type IDers have e-mail notification turned on in their user profile, which means we receive an e-mail as soon as a new entry is posted. As we do this for fun and there's a healthy level of competition of this board, we're going to try to ID your sample as fast as possible. Furthermore we have IDers all over the world, so there's bound to be at least one of us online whenever you might post your request, day or night, even during the weekend.   \n   \n**I've posted an ID request two days ago and still haven't received any reply. How is that possible?**   \n   \nThough it's quite rare, that can happen too. Rest assured we will have had a look at your sample but sometimes we simply don't have a clue. The best way to \"revive\" your thread is to post a little reminder in your original thread. _Please don't create a duplicate thread with the same request_ as this annoys the hell out of me.   \n   \n**The subject line of my thread has been changed.**   \n   \nThere's two possible reasons for that.   \nOne: the name you gave to your thread was very vague so we changed it into something better defined. This makes it easier for our type IDers to keep track of the different threads.   \nTwo: your sample has been identified. Your thread gets tagged, (x)ed and we include the name of the typeface(s) you were looking for and the name(s) of the person(s) who IDed it/them for you. That way we don't need to needlessly open threads to check if there's still need for our services.   \n   \n**My sample has been identified. How do I change the subject line to indicate that?**   \n   \nThere's no need. We'll do it for you.   \n   \n**Why is there sometimes more than one person credited for the identification?**   \n   \nWe call that cross-posting: when two or more people identify a sample simultaneously they won't know somebody else is posting the solution untill their own message appears in the thread. As they clearly didn't know of each other, they both get credited.   \n   \n**Can I have a go at it myself?**   \n   \nDefinitely: the more the merrier! The reason this board works so efficiently is because we have gathered a group of people from very different backgrounds with each their area of expertise. So join in with the fun: each new type IDer adds his/her little extra to the mix.   \n   \n**Where can I do my own research?**   \n   \nFirst of all our very own [Advanced Search](http://web.archive.org/web/20150425041357/http:/www.typophile.com/cgibin/search.pl) allows you to search through previous threads in order to check if your sample has been IDed before. For example if you're looking for the Gucci logo or the typeface used for the Bj\n\n",
  "author": "Bald Condensed",
  "time": "31 Jan 2004 — 4:44pm",
  "uid": "110",
  "comments": [

  ]
}
