{
  "id": "26915",
  "title": "URW Woodtype or Saloon, without central pointy things",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I am trying to find, or at least identify, certain fonts related to baseball teams. The NY Giants and the NY Mets.   \n   \nThe early Giants used the Victorian, or Western, typeface resembling Urwood, or Fanciful in a Mac font, I have seen it as an embrodery font called Tiffany...There are scalloped serifs with the inward points very pointy (Western and MAD blunts them, cuts the points off), and the indentation on the outside. The fonts mentioned above and the early trypeface the Giants used also have/had the points in the middle of the vertical and diagonal elements of the typeface's characters. OK, I have found this style.   \n   \nThe Giants in the 1930s, and the early Mets in the 1960s used this typeface but with smooth verticals, the central diamonds, the triangular points are gone....In my typeface printing catalogs there are fancy, decorative versions of this, names for the typeface are Davison's Carousel, Baroque....but these fonts or the simpler example I can't find in a computer font.   \nDoes anyone both understand what I am asking and know what and where this font may be? SO far the best I can do is to use the Urwood and Saloon as .bmp files and shave those elements off myself...   \n   \nA related font is the later version; by the 1950's the Giants were using a modernized version of that font...The serifs were now solid trapezoid shape the wide part inward; the Mets use this one today for their \"NEW YORK\", highly outlined and inlined on their jackets. With stylized central points as well....This font I have no clue as to a name, having seen it in no catalog and no font page....anyone know of it?   \n   \nLastly would be the large size script style the Mets use in their logo.   \n   \n   \nAny help or condilences about these three or so fonts I am asking about would be great and finely appreciated.   \nPaul\n\n",
  "author": "anonymous",
  "time": "1 Sep 2002 — 5:53pm",
  "uid": "1203",
  "comments": [

  ]
}
