{
  "id": "2691",
  "title": "OsF means?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I shamefacedly ask a basic question. What does OsF stand for when describibg a face. But most important, how is it different from the other versions. HELP PLEASE.\n\n",
  "author": "tehelka",
  "time": "12 Jan 2004 — 10:41pm",
  "uid": "2896",
  "comments": [
    {
      "time": "12 Jan 2004 — 10:49pm",
      "content": "OldStyleFigures. Which are medieval-style numerals with varying heights/ascenders/descenders.\n\n"
    },
    {
      "time": "12 Jan 2004 — 10:53pm",
      "content": "Well, more than medieval. They were common through the Renaissance through the Age of Reason. Really only started to become less common in the 1800s or thereabouts.   \n   \nT\n\n"
    },
    {
      "time": "12 Jan 2004 — 10:59pm",
      "content": "Oh, sorry Thomas. They're known in Germany as Minuskelziffern (because they're following the logic of small letters) and Medi\n\n"
    },
    {
      "time": "13 Jan 2004 — 4:43am",
      "content": "Oldstyle figures are also known as hanging figures.\n\n"
    },
    {
      "time": "13 Jan 2004 — 5:20am",
      "content": "Hmm... I thought 'ranging figures' meant 'lining figures'...\n\n"
    },
    {
      "time": "13 Jan 2004 — 6:37am",
      "content": "And these, of course, differ from tabular figures, in which the numerals are not only of a single height, but are monospaced for orderly (you guessed it) tabular data. An example of a font including tabular figures is Thirstype's [Apex Sans](http://web.archive.org/web/20141010043339/http:/www.thirstype.com/font_apexsans.html#).\n\n"
    },
    {
      "time": "13 Jan 2004 — 7:53am",
      "content": "I wondered about that after I posted it. Thanks for the clarification!   \n   \n(spends 10 minutes drooling over Neutraface... again)\n\n"
    },
    {
      "time": "13 Jan 2004 — 8:18am",
      "content": "MVB Fonts include tabular figures in some of their fonts such as [Sirenne](http://web.archive.org/web/20141010043339/http:/www.mvbfonts.com/html/fonts/sirenne/cs_sirenne_text_rm.htm) and [Verdigris](http://web.archive.org/web/20141010043339/http:/www.mvbfonts.com/html/fonts/verdigris/cs_verdigris_rm.htm). Feliciano also includes them in [Rongel](http://web.archive.org/web/20141010043339/http:/www.myfonts.com/fonts/feliciano/rongel/). They're all on my wish list. (As well as Neutraface -- I hear ya, Chris.)\n\n"
    },
    {
      "time": "13 Jan 2004 — 9:35am",
      "content": "HD: No need to apoplogize. Indeed, my comment shows my ignorance of the German terminology, which I find most interesting.   \n   \nStephen: There are also probably 50+ Adobe type families with tabular oldstyle figures. Essentially any family that has oldstyle figures generally comes with both proportional and tabular ones. Most of the same families also have both proportional and tabular lining figures.   \n   \nStephen again: You're right, \"ranging figures\" really is a synonym for \"oldstyle figures\" or \"text figures.\"   \n   \nCheers,   \n   \nT\n\n"
    },
    {
      "time": "13 Jan 2004 — 1:02pm",
      "content": "Old style figures were the norm until around 1800, when they were almost wholly replaced by lining figures.   \n   \nWhen the historical revival occurred around 1900, old style figures again became available, but as a little used option, mainly for quality book publishing.   \n   \nThe \"definitive\" digital face, Licko's Matrix (1985) featured OSF as standard. This set the tone.   \n   \nTwo FontFont faces, Scala and Meta, can also be credited with popularizing OSF again.   \n   \nWhen these faces were introduced c.1990, they had OSF as the standard figures, and Lining figures as the alternates.   \n   \nThis was a radical idea at the time (for instance, Adobe and Monotype followed the standard practice of creating \"Expert\" fonts, which grouped Small Caps and Old Style Figures on an alternate font, often named \"SC/OSF\").   \n   \nHowever, Matrix, Scala and Meta did not take the next step, which was to also make the OS figures tabular.   \n   \nI reason that if one is designing a typeface from scratch today, it makes sense to have the standard figures as tabular, and oldstyle. This is what I have done with many of my designs -- Oneleigh, Merlin, Fontesque Sans, Bodoni Egyptian, Preface.   \n   \nAn exception to the trend towards OSF seems to be for newspaper fonts, where OSF tends to look too \"bookish\".\n\n"
    },
    {
      "time": "13 Jan 2004 — 10:46am",
      "content": "Lanston Type Company was first to offer old style (hanging) figures in PostScript, full set of ligatures, drawn small caps, and tied letters.   \n   \nNaturally we also offered lining figures with these fonts. There was never need to order expert fonts.   \n   \nAlso first to offer both long and short descenders, swash italic and a full set of quaints, (long s with ligatures) Also with long and short descenders. Not to mention first with the questionable merits of italic small caps.   \n   \nPlus our Keycap arrangement for Caps, small caps and oldstyle figures became industry standard. I believe that my conversation with Linotype in that regard was helpful.\n\n"
    },
    {
      "time": "13 Jan 2004 — 10:48am",
      "content": "Mrs. Eaves Roman includes tabular lining, tablular oldstyle, tabular small lining and tabular petite figures. As well as all their proportional counterparts.\n\n"
    },
    {
      "time": "13 Jan 2004 — 11:00am",
      "content": "John,   \n   \nIs that a good idea? We always wondered about that! We kerned the figures. But if you wanted the figures tabular you simply turned kerning off. This is not operator painless. That reduced the quantity of fonts. Caslon 337 has 17 fonts for one weight which is confusing enough to double that we thought may be cumbersome.   \n   \nWhat would you do?\n\n"
    },
    {
      "time": "13 Jan 2004 — 11:00am",
      "content": "BTW, you guys remember how I was looking for a [better] term for \"hybrid\" numerals? Well, I'm still pondering that, but I have found a pet term for my favorite kind of numerals, 3/4 oldstyle (hybrid) with a high \"3\" and \"5\": I'm calling them \"poodlemix\" numerals, since they're hybrids with a French flavor... :-\\>   \n   \nhhp\n\n"
    },
    {
      "time": "13 Jan 2004 — 11:01am",
      "content": "Gerald, now I know who to blame for that \"industry standard\" -- it was a royal pain in the butt. It meant that if one wanted to set Palatino or Adobe Garamond text with OSF, one had to change font each time figures appeared!   \n   \nFortunately, Emigre and FontFont established a better industry standard.   \n   \nBut those days are history, now that many foundries provide separate versions of regular roman for Lining and OSF. And of course OpenType has the works.\n\n"
    },
    {
      "time": "13 Jan 2004 — 11:04am",
      "content": "Sorry Hrant, don't think \"Poomix\" will catch on.\n\n"
    },
    {
      "time": "13 Jan 2004 — 11:48am",
      "content": "Nick,   \n   \nOur fonts are not like that.   \n   \nWith our fonts you simply choose the font you wish to use.   \n   \nIf you pick Kaatskill with oldstyle figures that font comes with oldstyle figures.   \n   \nIf you pick Kaatskill with lining figures it comes with lining figures. All come complete with ligatures. There is no back and forth font changes required.   \n   \nThe industry standard that I was speaking of is Upper Case, Small Caps Oldstyle Figures. We did not name it, I think they called it SCOFS or something.   \n   \nIn any event, no changing back and forth required.   \n   \nOr am I missing the nature of your complaint. How does Emigre and FontFont differ?\n\n"
    },
    {
      "time": "13 Jan 2004 — 11:53am",
      "content": "Thomas:   \n\\> \"ranging figures\" really is a synonym for   \n\\> \"oldstyle figures\" or \"text figures.\"   \n   \nI just did a quick [google search](http://web.archive.org/web/20141010043339/http:/www.google.com.br/search?q=%22ranging%2Bfigures%22&ie=UTF-8&oe=UTF-8&hl=pt-BR&btnG=Pesquisa%2BGoogle&meta=), and it seems   \nthat most people use 'ranging figures' as a   \nsynonym for 'lining figures'.\n\n"
    },
    {
      "time": "13 Jan 2004 — 12:11pm",
      "content": "Bringhurst backs up Eduardo on this one, as does James Felici's _The Complete Manual of Typography_.\n\n"
    },
    {
      "time": "13 Jan 2004 — 1:02pm",
      "content": "Old style figures were the norm until around 1800, when they were almost wholly replaced by lining figures.   \n   \nNick, would you say that's true generally, or are you mainly speaking of the US & Canada?   \nI have no study or research to go on, but my impression was that OSFs were popular right through the C19, going out of fashion slowly over thre first few decades of the C20. This impression was formed largely through UK material, so it could be a 'local' thing. (It could just as easily be a false impression, though a quick - and unrepresentative - look around the stuff in my house shows hardly any lining figs on C19 items, becoming more frequent up to the 40s, then hardly any OSF in the 50s, and none after that until recent years).   \n   \nThe exception to this is documentation (as opposed to books,adverts etc) - lining figures throughout.\n\n"
    },
    {
      "time": "13 Jan 2004 — 2:40pm",
      "content": "Dang, dunno how I missed that, since I have read Bringhurst several times. Maybe it never stuck in my head since I never use the term. Anyway, I guess I needed to learn something new today! Thanks, all.   \n   \nT\n\n"
    },
    {
      "time": "13 Jan 2004 — 3:12pm",
      "content": "Steve, I hope I haven't got this backwards. It's my understanding that text faces of the 19th century in most western countries were mainly moderns, which had lining figures.   \n   \nHowever, there's no way to prove this without statistical analysis!   \n   \nI'm assuming that the popularity of OSF is related to the popularity of old style faces.   \n   \nSo when the moderns, scotches, and romans of the 19th century held sway, this drastically reduced the amount of OSF in use.   \n   \nFor the 20th century, Linotype setups that were \"Typeface + Italic + small caps\" only occasionally had OSF (even for old style faces), so I believe that this resulted in a lack of OSF during the Linotype era.\n\n"
    },
    {
      "time": "13 Jan 2004 — 9:42pm",
      "content": "_Anyway, I guess I needed to learn something new today! Thanks, all._    \n   \nThis thread has been very edifying. Thanks from me as well!\n\n"
    },
    {
      "time": "14 Jan 2004 — 9:35am",
      "content": "Nick,   \n   \nI take that as a yes. I assume we have done the right thing. Thank you.\n\n"
    },
    {
      "time": "14 Jan 2004 — 11:02am",
      "content": "Gerald,   \n   \nYes, it's OK now, but back in the early 1990s, when one bought a typeface like Adobe Garamond or Palatino, the Regular Roman had lining figures, and there was also an \"Expert\" font that had a \"standard\" of Uppercase, Small Caps, Old Style Figures.   \n   \nSo, if one had a long piece of text in those problem typefaces, where one wanted to use OSF, one had to change fonts every time a figure was used.   \n   \nAlso, if one wanted to set \"Caps with Small Caps\" in Adobe Garamond, one had to change fonts for every Cap!   \n   \nSo obviously Emigre and FontFont had a much better idea, first by making the OSF the standard figures for the roman U&lc font.   \n   \nHowever, there were also introduced in the early nineties Linotype fonts such as Electra, that had alternate U&lc fonts, both \"Regular\" (with lining figures) and \"OSF\".\n\n"
    },
    {
      "time": "14 Jan 2004 — 1:09pm",
      "content": "_Thomas:   \n\\> \"ranging figures\" really is a synonym for   \n\\> \"oldstyle figures\" or \"text figures.\"   \n   \nI just did a quick google search, and it seems   \nthat most people use 'ranging figures' as a   \nsynonym for 'lining figures'._      \n   \nThis terminology is so bad that people can\n\n"
    },
    {
      "time": "14 Jan 2004 — 2:41pm",
      "content": "Yes, I was annoyed to find recently that the majority of people use ranging as a synonym for lining, when I'd been using it as a synonym for 'oldstyle' figures. I still think the latter makes much more sense: the figures don't stay coralled in a fixed height, they range like cattle on the wide open prairie of the extender length.   \n   \nAnother term for oldstyle figures is 'hanging', although this isn't very satisfactory as only some of them typically hang (3 4 5 7 9), others sit (0 1 2), and others stand (6 8) -- ignoring for now that fact that some French figures are more upstanding than their cousins in other nations.   \n   \nHow about 'extending figures'?\n\n"
    },
    {
      "time": "14 Jan 2004 — 5:02pm",
      "content": "\" It's my understanding that text faces of the 19th century in most western countries were mainly moderns \"   \n   \nWell most of the books printed in M\n\n"
    },
    {
      "time": "14 Jan 2004 — 9:00pm",
      "content": "John,   \n   \nI agree that hanging figures may not be the ultimate _descriptio._   \n   \nHowever,   \n   \nBodoni is a modern, why suddenly oldstyle figures?   \n   \nSo perhaps hanging figures has its place.\n\n"
    },
    {
      "time": "14 Jan 2004 — 9:22pm",
      "content": "Did the original Bodoni have oldstyle figs?   \n   \nT\n\n"
    },
    {
      "time": "14 Jan 2004 — 11:12pm",
      "content": "It appears that Bodoni had _hanging figures_ or rather, _oldstyle figures_. At least the best I can make of it.   \n   \n [http://unostiposduros.com/paginas/bodopag.html](http://web.archive.org/web/20141010043339/http:/unostiposduros.com/paginas/bodopag.html)   \n   \nBodoni is a _modern,_ so the figures would be, on a stretch, _modern oldstyle figures._ Or, some what less confusing, _hanging figures._   \n   \nI say this knowing probably non of us suffer from such confusion.\n\n"
    },
    {
      "time": "15 Jan 2004 — 5:16am",
      "content": "_\\>Did the original Bodoni have oldstyle figs?_    \n   \nThomas, I just took a quick spin through my [Octavo copy](http://web.archive.org/web/20141010043339/http:/www.octavo.com/collections/projects/bodtip/index.html) of the Bodoni _Manuale Tipografico._ The type specimens themselves to not generally show numerals. But the figures used in the introduction are indeed \"oldstyle\".   \n   \nNote that Bodoni used the standing 3 and 5 (as opposed to the more common hanging form). I usually think of these as \"French style\" -- but I would be curious now to know who was the first to raise those two. Perhaps one of the Didots?   \n   \n-- Kent.   \n   \nP.S. I also always tend to think of \"ranging\" figures as oldstyle for precisely the same reason that John described.\n\n"
    },
    {
      "time": "15 Jan 2004 — 6:13am",
      "content": "Stephen,   \n   \nI believe John, and Kent to be right. It was never _our plant_ terminology, but that was my understanding.\n\n"
    },
    {
      "time": "15 Jan 2004 — 6:14am",
      "content": "_Types of Typefaces_ by J. Ben Lieberman, 1967, uses 'ranging' as a synonym of 'lining' and both as opposed to 'old style'. As he was very familiar with type literature, his usage is probably the correct traditional one. You could check this with older books. Obviously it is a confusing term, best avoided.\n\n"
    },
    {
      "time": "15 Jan 2004 — 6:15am",
      "content": "John:   \n_How about 'extending figures'?_   \n   \nI\n\n"
    },
    {
      "time": "15 Jan 2004 — 7:01am",
      "content": "_Encyclopaedia of Typefaces_ by Jaspert et al., dating from 1953 (I have the 1970 edition), British, uses the term 'short-ranging figures' to mean \"Numerals which range on the base line\" and applies it to the numerals which extend from the base line to cap height.\n\n"
    },
    {
      "time": "15 Jan 2004 — 8:04am",
      "content": "Rodolfo Capeto ,   \n   \nOur Bodoni 175 comes with French Figs and Lining Figures. Unfortunately we are in the middle of a web hosting change which should be up in a day or two. They promised that several times now.   \n   \nI found the French Figures charming sometimes, not so charming at others.\n\n"
    },
    {
      "time": "15 Jan 2004 — 9:24am",
      "content": "Bringhurst dates the first lining figures to Richard Austin at the Bell foundry, 1788.   \n   \nHe also believes that it was commercial usage that prompted the movement towards lining figures.   \n   \nTo some extent, however, I believe it is more likely to have been part of the general modernization of typography c.1800 -- in particular, caused by people finding the roman numerals that had been used for numbers in all cap settings (because old-style figures looked so mismatched) to be archaic, long-winded, and complicated.\n\n"
    },
    {
      "time": "15 Jan 2004 — 9:47am",
      "content": "(Thanks, Rodolfo.)   \n   \nThe French old-style figs rule (I even like the \"2\" to ascend), especially in fonts with short descenders - and when you make them hybrids you get cute poodle mongrels! And Kent, I'm pretty sure it was indeed the Didots.   \n   \nBTW, Updike cites a Mr Hunter as inventing lining nums in 1785, for use in log tables. And they apparently were called \"ranging\". :-/ It's looking like we need to avoid \"ranging\" like the plague.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Jan 2004 — 4:49pm",
      "content": "Rodolfo, Grazia Bodoni is shown in Allan Haley's _Hot Designers Make Cool Fonts._ The numerals follow the traditional OsF pattern.   \n   \nI don't know if Bodoni was consistent with the standing 3 and 5 in all of his fonts. The _Manuale Tipografico_ does not generally show figures with the specimens for each size. Also, I have not done an exhaustive search of the work. But the numerals within the introduction are all \"French style.\" Same with the page numbers and the index and the numbers identifying his catalog of ornaments. And there are two pages toward the end which show large numerals (I can't tell what size, but display sizes) which have a standing 3, 5, _and_ 7, but short 0, 1, and 2, and a hanging 9.   \n   \nLooking quickly through Updike, I notice that the Romain du Roi (as cut by Grandjean, c. 1700) appears to have had the standard pattern of OsF. Same with Luce's fonts (c. 1770s). The standing 3 and 5 show up with the Didots (c. 1780s).   \n   \nHowever, I notice at least one instance of Baskerville cutting a standing 3 and 5! In figure 272 (Vol. II, opposite pg. 115), a notice of sale of some of Baskerville's types in Paris, c. 1789, (set, of course, in one of Baskerville's fonts) shows a standing 3 and 5.   \n   \nThe standing 3 is also seen in figure 165 (Vol I), which is an example of Voltaire's _La Pucelle_ printed in France in 1789 using one of Baskerville's types.   \n   \nBaskerville died in 1775. So, it seems conceivable to me that the \"French style\" of OsF may, in fact, have originated in a Baskerville experiment.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "15 Jan 2004 — 5:16pm",
      "content": "_Rodolfo, Grazia Bodoni is shown in Allan Haley's Hot Designers   \nMake Cool Fonts. The numerals follow the traditional OsF pattern._      \n   \nOh, thank you. I never got this one. Always ran away from that title.   \n   \n_However, I notice at least one instance of Baskerville cutting   \na standing 3 and 5! [...]_      \n   \nKent, I remember reading (but I don\n\n"
    },
    {
      "time": "15 Jan 2004 — 5:52pm",
      "content": "_two pages toward the end which show large numerals (I can't tell   \nwhat size, but display sizes) which have a standing 3, 5, and 7,   \nbut short 0, 1, and 2, and a hanging 9._      \n   \nBTW, my blunder. That\n\n"
    },
    {
      "time": "16 Jan 2004 — 10:14am",
      "content": "\\> it seems conceivable to me that the \"French style\" of OsF   \n\\> may, in fact, have originated in a Baskerville experiment.   \n   \nIndeed! Especially when you consider that he was so admired and emulated by the French.   \nGreat find, Kent.   \n   \n\\> WB for his personality is the kind of guy who one thinks of as doing such experiments.   \n   \nReally? I've always thought the shows on Warner Brothers are pretty mainstream... ;-)   \nJB.   \n   \n\\> [http://www.stonetypefoundry.com/html\\_pages/BodoniOverview.html](http://web.archive.org/web/20141010043339/http:/www.stonetypefoundry.com/html_pages/BodoniOverview.html)   \n   \nNote however that the \"4\" is also raised there. I'd never seen that elsewhere.   \n   \nBTW, that Haley book is actually as good as the title is lame.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2004 — 11:49am",
      "content": "_\\> it seems conceivable to me that the \"French style\" of OsF   \n\\> may, in fact, have originated in a Baskerville experiment.   \n   \nIndeed! Especially when you consider that he was so admired   \nand emulated by the French._      \n   \nI remembered where I read that it was the French who\n\n"
    },
    {
      "time": "16 Jan 2004 — 11:54am",
      "content": "\\> I need some holidays.   \n   \nJust take along your own fingerprinting ink, please. ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "13 Jan 2004 — 5:04am",
      "content": "...or _ranging figures_ or _text figures_.\n\n"
    },
    {
      "time": "13 Jan 2004 — 5:28am",
      "content": "Yikes! I take that back. Wow, I guess I always applied my   \nown definition to the term because it sounded like the   \nnumerals \"ranged\" above and below the x-height. I'm ashamed.\n\n"
    },
    {
      "time": "13 Jan 2004 — 6:57am",
      "content": "Thanks Chris. But remember, tabular oldstyle figures exist. See Neutraface.\n\n"
    },
    {
      "time": "15 Jan 2004 — 5:23am",
      "content": "Back on Tuesday I said:   \n   \n\"Wow, I guess I always applied my own definition to   \nthe term because it sounded like the numerals \"ranged\"   \nabove and below the x-height. I'm ashamed.\"   \n   \nNow with Kent Lew and John Hudson on my side, I am no   \nlonger ashamed.\n\n"
    }
  ]
}
