{
  "id": "26983",
  "title": "From PHD-List: \"More food for thought to Designers\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "It is events such as this that cause one to pause and ponder the fact that as designers, especially those whom are involved in product design, we do have the responsibility to be involved and to educate. Perhaps I am blowing things out of proportion, but in this instance I doubt it.   \n   \nQuoted from an e-mail sent by Francois-Xavier Nsenga\n\n> * * *\n> **quote:**\n> \n> Dear Colleagues,   \n>    \n> Several hundreds of ex-patients in hip surgical wards in Quebec   \n> hospitals are soon being recalled for investigation of an eventual   \n> contamination by HIV and other infectious diseases, due to a badly   \n> sterilized surgical instrument. The whistle was recently blown by an   \n> employee in one hospital sterilization department, signaling that the   \n> particular instrument is currently not being properly sterilized,   \n> simply because it is not, as it should normally be, completely   \n> disassembled after use.   \n>    \n> One of the interviewed PR medical doctors showed us last evening in   \n> public media the incriminated instrument, and   \n> declared: \"...obviously, there is no way one could know that this   \n> head - of the instrument - is detachable ...\"   \n>    \n> The employee in the sterilization department found out, by chance,   \n> probably through routine manipulation, that the head of the   \n> instrument could be removed, and all components thoroughly sterilized   \n> separately.   \n>    \n> One is thenn tempted to conclude that no competent design work was   \n> done at the successive life phases of the instrument use, \"from the   \n> cradle to the ...\". Quite obviously there has been incomplete design   \n> input in the early briefing phase and at the drawing board or   \n> software designing phases. One could add also that no full design   \n> supervision has been ensured during the manufacturing process of the   \n> instrument, and definitely no design intervention at the time of   \n> multiple government inspections and approval procedures. Had research   \n> and practice designers been adequately trained to \"sell\" their   \n> expertise to medical equipment vendors and government approval   \n> officials, to hospital purchasing agents and medical personnel   \n> training teams, most probably the whole present mess would have been   \n> avoided, or at least the damage greatly limited.   \n>    \n> We are told the surgical instrument has been in use for a couple of   \n> years without proper sterilization, and it is believed it has been   \n> sold and used not only here in Quebec but surely elsewhere in Canada   \n> and in other countries. One of the expected outcomes is the financial   \n> disbursement that will be estimated in millions of dollars after   \n> legal responsibilities and indemnification will be ascribed. But   \n> there also are inestimable social effects (increasingly diminished   \n> confidence of citizens in public institutions) and emotional   \n> catastrophes resulting from the agonizing anguish of all those   \n> individuals who might have been (or not!) infected and having (or   \n> fear of!) spread the deadly diseases to loved ones.   \n>    \n> Another case for reflection by all of us, each from our respective   \n> sub-fields of design involvement.\n> \n> * * *\n> !-/quote-!\\>!-quote-!\\>\n",
  "author": "Miss Tiffany",
  "time": "13 Apr 2004 — 4:20pm",
  "uid": "108",
  "comments": [

  ]
}
