{
  "id": "2709",
  "title": "Your chance to give your 2 cents, nickel, dime, etc...",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am working on designing a logo for a new youth hockey league. I've \"test-driven\" about 2500 fonts today and none of them feel quite right. The request is to make it feel very contemporary or very classic. Here a couple of logos that they gave me to review   \n   \n ![blues](http://web.archive.org/web/20131018214030im_/http:/www.typophile.com/forums/messages/4100/24110.jpg) ![wolves](http://web.archive.org/web/20131018214030im_/http:/www.typophile.com/forums/messages/4100/24111.gif)   \nthese are the more modern ones   \n   \n ![bombers](http://web.archive.org/web/20131018214030im_/http:/www.typophile.com/forums/messages/4100/24112.jpg) ![cubs](http://web.archive.org/web/20131018214030im_/http:/www.typophile.com/forums/messages/4100/24113.jpg)   \nthese 2 are more retro style   \n   \nMost youth hockey logos are really bad. Keep in mind that the type must be readable on a jersey as well as a small pin. The name of the team is the   \n   \n ![capitals](http://web.archive.org/web/20131018214030im_/http:/www.typophile.com/forums/messages/4100/24114.png)  \n   \n(one of the fonts I'm considering). My brain is getting fried. Does anyone have any fonts they would like to offer up as possible ideas? Any input would be greatly appreciated!\n\n",
  "author": "figrsk8r",
  "time": "13 Jan 2004 — 5:02pm",
  "uid": "2328",
  "comments": [
    {
      "time": "14 Jan 2004 — 5:52am",
      "content": "What city is the Capitals from? As for the samples the bottom two look like baseball logos. The Chicago Blues logo uses a good regional device a note symbol. If you are lucky maybe you have something as distictive like a Capital Dome.\n\n"
    },
    {
      "time": "14 Jan 2004 — 10:58am",
      "content": "Thanks for your input. The Capitals are from Indianapolis (it used to be a professional league here in the 40s). I know the logos look like baseball, but they are youth hockey logos and are modern versions of old hockey logos. I have plenty of great artwork, I just can't find the fonts that really fit with the \"look\" they're trying to achieve. The Capitals had 2 logos (one is shown below-they didn't put the name of the team on their jersey just the picture) and the other one was just a big C with the player's number in it. All the current youth travel league teams are named after former professional Indianapolis hockey teams. They thought about just using the Washington Capitals logo, but decided they wanted something unique. I am also trying to incorporate the an updated version (just bits and pieces of it) of our states flag's torch (which I will also show below). The look they want is modern with a possible nostalgic feel, cool but classic. They want to project an image that they represent up-to-date hockey teaching backed by the history of Indianapolis hockey. I do appreciate all input. Thanks!   \n   \n ![logos](http://web.archive.org/web/20131018214030im_/http:/www.typophile.com/forums/messages/4100/24160.jpg)\n\n"
    },
    {
      "time": "16 Jan 2004 — 9:58am",
      "content": "Try [www.JAWarts.com](http://web.archive.org/web/20131018214030/http:/www.jawarts.com/)   \nJukebox is an indie font company. He has some styles that have a sports feel like Fenway. Also try Font Diner\n\n"
    },
    {
      "time": "16 Jan 2004 — 10:14am",
      "content": "Thank you very much! I have several of the font diner font packages, but I didn't know about the other site. I will check it out.\n\n"
    },
    {
      "time": "16 Jan 2004 — 2:08pm",
      "content": "\\> _Jukebox is an indie font company._   \n   \nJust a small correction Daniel...   \n   \nThe Jukebox foundry was acquired by [Veer](http://web.archive.org/web/20131018214030/http:/www.veer.com/) back in October { [press release](http://web.archive.org/web/20131018214030/http:/www.veer.com/about/pressroom/releases/veer_pr_jbaquis_release.asp) }. Jason Walcott, the proprietor of JAWarts, still designs and develops the faces for us. I'd like to mention that [Fenway](http://web.archive.org/web/20131018214030/http:/www.veer.com/results.asp?Image=JBT0000019) is definitely one of the most popular faces in the collection.\n\n"
    },
    {
      "time": "16 Jan 2004 — 2:19pm",
      "content": "You know that M Carter has a font called \"Fenway\", right? It's used in Sports Illustrated and BusinessWeek.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2004 — 2:37pm",
      "content": "Actually, the Jukebox face is named _Fenway Park_, not simply _Fenway_.\n\n"
    }
  ]
}
