{
  "id": "2711",
  "title": "Brasspounder",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "First time getting critiqued as well.   \n   \nThe character set isn't complete, though all the capitals and lower case letters are done, as well as a first shot at the numbers. No kerning or anything yet, because FCP 2's kerning feature is extremely user-hostile.   \n   \nThe text below (not the title) is set in 28 point.   \n   \n ![Brasspounder - Jackals *love* marzipan.](http://web.archive.org/web/20150415064410im_/http:/www.typophile.com/forums/messages/29/24120.gif)\n\n",
  "author": "dart",
  "time": "13 Jan 2004 — 7:56pm",
  "uid": "1975",
  "comments": [
    {
      "time": "13 Jan 2004 — 10:09pm",
      "content": "Oh, I like this. It has a nice hand tooled feel to it, and is kind of whimsical with some art nouveau and old west mixed in. I'm assuming it's a smallcaps face? If so, any chance of actual lower case letters?\n\n"
    },
    {
      "time": "14 Jan 2004 — 3:31am",
      "content": "Yes, it's small caps. It started life as a header I lettered for some game materials.   \n   \nI had no plans for lower case, but two of the characters that are giving me grief are the @ and the monogram I use in place of the rectangle for any undrawn characters, which is my three initials married together in lower case. So it's not impossible. . . .\n\n"
    },
    {
      "time": "14 Jan 2004 — 8:17pm",
      "content": "Well, eitherway, I love it. It's very fun.\n\n"
    },
    {
      "time": "23 Apr 2004 — 4:23am",
      "content": "I found the lower case very difficult to do, and some of the other characters are still giving me grief. The lc is done though:   \n   \n ![Brasspounder with lc](http://web.archive.org/web/20150415064410im_/http:/www.typophile.com/forums/messages/29/34148.gif)   \n   \nNotice both types of _a_ here. I'd greatly appreciate any critiques or suggestions you have.\n\n"
    },
    {
      "time": "21 Aug 2004 — 4:48am",
      "content": "If anyone was ever interested in this, it's now available at my temporarily relocated site: [http://leviathan.dyn.dhs.org/~djrigby/Graphics/yorn.html](http://web.archive.org/web/20150415064410/http:/leviathan.dyn.dhs.org/~djrigby/Graphics/yorn.html)\n\n"
    },
    {
      "time": "25 Aug 2004 — 1:02am",
      "content": "you did all that with font creator? i don't have that kind of patience!!! very nice i must say.\n\n"
    },
    {
      "time": "25 Aug 2004 — 2:53am",
      "content": "Thanks, Paul. ![:-)](http://web.archive.org/web/20150415064410im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nYeah, I sorta got the idea there were people who were able to work a lot faster than I could. I just put it down to my being a beginner. The big programs are faster and easier too, huh?   \n   \nUmm, to keep this on topic, I had the idea of doing some swash caps and other goodies in an alternate font. So there.\n\n"
    },
    {
      "time": "25 Aug 2004 — 9:06am",
      "content": "I rellly like this one, but i'm into victorian and blackletter faces and this one seems to sample from both those styles. swash caps would be very much in the spirit of victorian type and if yer real ambitious swash lc letters too.   \n   \nyou really should download the demo version of FontLab from their website and convert your outlines to PS outlines just so you can see how much easier it is to work with beziers instead of pushing on- and off-curve points around - the difference is incredible! I started with font creator too it got me hooked on the whole font making thing.   \n   \ng'luck with this one.\n\n"
    }
  ]
}
