{
  "id": "27121",
  "title": "TYPO.GRAPHIC.BEIRUT 2005: Call For Papers",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20081123031142/http:/typophile.com/user/108 \"View user profile.\") : 3.Nov.2004 9.11am \n\n![logo of the conference](http://web.archive.org/web/20081123031142im_/http:/www.typophile.com/forums/messages/72/52732.jpg)   \n   \nFROM: Nathalie fallaha   \nRE: TYPO.GRAPHIC.BEIRUT 2005 conference   \n   \nWe, at the Lebanese American University (LAU) in Beirut, Lebanon,   \nare holding a graphic design and typography conference;   \nTYPO.GRAPHIC.BEIRUT, from April the 14th till April the 16th 2005.   \n   \n   \nThis is the CALL FOR PAPERS for the TYPO.GRAPHICS.BEIRUT conference 14th, 15th & 16th of April 2005 Lebanese American University Beirut, Lebanon   \n   \nCONFERENCE THEME:   \n   \nThis 3-day conference will be the first ever major graphic design event of its kind to be held in the Middle East. It will focus on various issues pertaining to typography and graphic design, such as:   \n   \n\\* design in a multi-lingual environment   \n\\* socially responsible design   \n\\* design history   \n\\* graphic design and technology   \n\\* visual communication in a global age   \n\\* typeface design   \n\\* moving type   \n   \n   \nPlease note that the topics won't be limited to the categories listed above.   \n   \nTYPO.GRAPHIC.BEIRUT 2005 conference aims to provide a platform for students, professionals and graphic design educators from the region and the wider international range, to exchange new views and ideas.   \n   \nWe are hoping to have participants and attendees from around 20 countries. Speakers include so far: Ken Garland, Gerry Leonidas, Huda Smishuijzen AbiFares, Reza Abedini, Nadine Chahine and many more.   \n   \nREGISTRATION:   \n   \nAttendance is free of charge, participants are required to register online through the conference website.   \n   \nTRAVEL AND ACCOMMODATION:   \n   \nAssistance will be provided for entry visas to Lebanon, reception at Beirut International Airport and hotel reservations. Special rates will be arranged with nearby local hotels for the conference participants.   \n   \nGENERAL INFORMATION:   \n   \nGraphic Design at the Lebanese American University was established in 1996; it is a three years program that includes a foundation year where students are introduced to the design discipline as a whole. A junior year, where they engage in building their skills and knowledge in typography, packaging, publication, illustration, corporate identity, and digital screen-based design. And finally the senior year where assignments take on specific areas of design selected by the students. Cutting across various topics, thoughts and ideologies translate into visual communication solutions in their final projects.   \n   \nThe graphic design program has currently 350 students enrolled, under the supervision and guidance of 20 faculty members. Some of our students and faculty work has been featured lately in several international design magazines and publications, such as Novum, Output, Communication Arts, Design Graphics... (The LAU is a member of the IEN ICOGRADA)   \n   \nEXHIBITION:   \n   \nWe will also be interested in featuring your work as part of our exhibition; we will await to hear from you to discuss any needed arrangement and equipment.   \n   \nACTIVITIES & SIDE EVENTS:   \n   \n\\* graphic design and typography exhibition during and after the conference   \n\\* workshops during break time   \n\\* Side events: visiting the first printing press of the Middle East in Khenchara, a field trip to Byblos, the city where the alphabet spread from, also known as one of the oldest cities in the world.   \n   \n   \nCALL FOR PAPERS:   \n   \nAbstracts are to be sent to [TYPO.GRAPHIC.BEIRUT@lau.edu.lb](mailto:http://TYPO.GRAPHIC.BEIRUT@lau.edu.lb) in word and/or PDF format no later than November 15th 2004. A notification of acceptance will be sent by January 15th 2005. The deadline for full paper submission is February 30th 2005 All details will be soon posted on the conference website.   \n   \n   \nORGANIZING COMMITTEE:   \n   \nZeina El Abed, Nathalie Fallaha, Yasmine Taan\n\n",
  "author": "<a href=\"http://web.archive.org/web/20081123031142/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 3.Nov.2004 9.11am",
  "uid": "108",
  "comments": [

  ]
}
