{
  "id": "27220",
  "title": "Position Available: Font Production",
  "forum": "Home",
  "tags": [

  ],
  "content": "POSITION AVAILABLE   \n   \n   \nTitle: FONT PRODUCTION ASSISTANT   \nLocation: New York, NY   \nDate: 21 March 2005   \n   \n   \n [Hoefler & Frere-Jones](http://web.archive.org/web/20150104012101/http:/www.typography.com/) (H&FJ) specializes in the design and production of original typefaces for editorial, institutional, and corporate clients. We are currently looking to hire a full-time developer to assist in the production, testing, and manufacture of digital fonts.   \n   \nCandidates should have an interest in typography, first-hand experience with digital font development tools such as FontLab, and some experience with publishing packages such as InDesign and QuarkXPress. Strong candidates will be familiar with RoboFog or RoboFab, have experience in developing feature-rich OpenType fonts, and be fluent in at least one programming language.   \n   \nDuties will include the production, testing, and manufacture of fonts in industry-standard formats (such as PostScript and TrueType for both Macintosh and Windows), as well as the ongoing investigation of developing font technologies. This person will work with H&FJ's design and sales staffs to propose solutions to both technical and typographic problems, and will be responsible for assisting a range of different kinds of clients with font implementation.   \n   \nApplicants will be expected to exhibit strong analytical skills, good problem-solving abilities (and a predilection for technological solutions), and excellent verbal and written communication skills. Professional experience in the field is encouraged but not necessary. This position is open to applicants of all levels, from recent college graduates to experienced type developers.   \n   \nThe position is full-time in our offices in New York City.   \n   \nRequired Experience:   \n   \n - Working knowledge of FontLab   \n - Proficiency with the Macintosh operating system (OS9/OSX)   \n - Proficiency with Microsoft Windows XP   \n - Working knowledge of earlier Windows operating systems   \n   \nPreferred Experience:   \n   \n - Object-oriented programming experience (ideally Python)   \n - Familarity with editorial pagination systems   \n - BS/BA or equivalent   \n   \nPlease send r\n\n",
  "author": "hoefler",
  "time": "21 Mar 2005 — 6:01pm",
  "uid": "101",
  "comments": [

  ]
}
