{
  "id": "2723",
  "title": "Baby's first book face",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Howdy All -   \n   \nThis is my first post here though I've been lurking for a few months. I've been having a crack at my first 'serious' typeface. My plan was to create two basic weights for use as a book face - regular and bold. Peculiarly I started creating a bold weight first (don't ask me why), and at this point have only designed the lowercase. I have a great deal to learn and no doubt have made many mistakes - I'd appreciate your help putting me on the straight and narrow.   \n   \nmany thanks\n\n<!--attachment: book_first-24190.pdf*mime_pdf.gif*application/pdf*16.6*lowercase+%2d+bold*book_first%2epdf --><!--attachment: book_first-24190.pdf*mime_pdf.gif*application/pdf*16.6*lowercase+%2d+bold*book_first%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131013232348im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">lowercase - bold<br><a href=\"http://web.archive.org/web/20131013232348/http:/www.typophile.com/forums/messages/29/book_first-24190.pdf\" target=\"_blank\"><b>book_first.pdf</b></a> (16.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "dux",
  "time": "14 Jan 2004 — 3:38pm",
  "uid": "2193",
  "comments": [
    {
      "time": "14 Jan 2004 — 3:54pm",
      "content": "I don't think I'd call this particularly monoline in construction to be honest. Perhaps it does need more modulation though.\n\n"
    },
    {
      "time": "14 Jan 2004 — 9:37pm",
      "content": "Well, it's not totally monoline, but it's not a book face either. The extenders are generous enough to play a positive role in readability, but it's still a sans (with narrow, constructed forms to boot), so I wouldn't set too much text in it. Display? Definitely.   \n   \n\\> Peculiarly I started creating a bold weight first (don't ask me why)   \n   \nI tend to draw dakish glyphs to begin a design too - I guess it what appeals to you, plus the fact that drawing large glyphs is display-centric: you have to tame your aesthetic preferences in order to draw a text face [large].   \n   \nhhp\n\n"
    },
    {
      "time": "15 Jan 2004 — 4:13am",
      "content": "hmmm... bugger - I had thought I had curbed my aesthetic preferences sufficiently. So what we're looking at is that I should be creating wider letterforms with more modulation in order to get on track with a book face? thankyou both for your time\n\n"
    },
    {
      "time": "15 Jan 2004 — 9:15am",
      "content": "Don't let the comments get you down. This a very well done first effort. Extremely well done in fact. The proportions are good. The color is even. Your sense of optical width vs. actual width is great. You've taken time to put in alot of the subtleties.   \n   \nFirst we gotta define what we mean by book face. I bet you don't mean you plan to set A Tale of Two Cities in this font. Nor (judging from the thread title) did you mean that this is intended specifically for use in children's books. I'm guessing you meant that you can use this font for short passages of text. Or even more generally, not just a display face.   \n   \nI think you've done that. If want it to work better below 12pt you probably want to consider a bit more width, and perhaps a bit more modulation. As a side note: I'm tempted to say this looks very much like many existing fonts. But really, who cares? This is a place to start, and it looks nice. Press on.   \n   \nRandy\n\n"
    },
    {
      "time": "15 Jan 2004 — 9:42am",
      "content": "Certainly, the proportions, modulation and detailing are very well done. Maybe it's just a matter of being cautious (anal?) with terms: to me \"book face\" means a font that can be used to set a book without causing rejection (conscious or subconscious) on the part of the reader before the book finishes! I tend to have a narrow definition of \"book face\" (although in some ways it's actually much broader than usual - like in \"allowing\" unorthodox structures): it needs serifs, and the color and width have to be within a certain range. Plus it all has to correspond - like a darkish font works better small which means the x-height has to be bigger, the forms looser and wider, etc.   \n   \nYou shouldn't abandon this design, not at all! It's already nice and firm. Just move it towards more display usage - which still means some people will use it for short text - which is fine - usage is out of our hands anyway. Practically this might mean things like making the terminals of the \"a\", \"c\" and \"s\" congruent, making the \"k\" more elemental, etc.   \n   \nAs for pulling it away from existing designs, one interesting place you could do that is in the caps. I've recommended this before to others: look at uncial structures if you really want to make a convincing innovation in caps that are conformant to the lc - conventionally they're like two separate creatures.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2004 — 7:57am",
      "content": "You're both right in raising questions over my use of the term 'book face'. You're right randy, I don't intend on using it to set A Tale of Two cities - I had in mind much short blocks of text ![:-)](http://web.archive.org/web/20131013232348im_/http:/www.typophile.com/forums/clipart/happy.gif) What would be a better description if it is not exclusively for display or setting short passages? I realised from the outset that its width could inhibit readability at small sizes but had in mind that it would save space and hoped to find a healthy balance. I think now looking back, as you said Hrant, I was paying too much attention to my aesthetic preferences with regards to the modulation.   \n   \nI agree randy - it does look like a lot of existing fonts. Like you say, it's a place to start - I didn't set out to make an original contribution to type design with it. How could I if I couldn't get something like this down properly? Hopefully I'll be able to one day.   \n   \nI really like the idea of referencing uncial structures as an innovative alternative to standard caps. I think for this project I'll keep orthodox caps but I will certainly not forget that idea.   \n   \nI'm not all that familiar with the your terminology when you suggest making the K more 'elemental'. I think I'm on same hymn sheet but it's best to clarify ![:-)](http://web.archive.org/web/20131013232348im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nthanks again chaps\n\n"
    },
    {
      "time": "16 Jan 2004 — 8:08am",
      "content": "\\> What would be a better description if it is not   \n\\> exclusively for display or setting short passages?   \n   \nMiles Newlyn has used the term \"text sans\". I used to not like that, but now I see its merits.   \n   \nBTW, it doesn't much matter what we call our stuff: users will decide what it really is anyway! :-/   \n   \n\"Elemental\": I meant \"simple\" or \"minimal\". The staggering of the arms is a more complex, texty feature.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2004 — 8:12am",
      "content": "interesting - I like that term myself. Re. elemental - thanks for clarifying - was exactly what I thought it was\n\n"
    },
    {
      "time": "14 Jan 2004 — 3:44pm",
      "content": "In order to be used in books, at those point sizes used, don't you think you need more modulation? Typefaces with monoline character shapes general start to blend when they get to be too small.   \n   \nMy 2 bits.\n\n"
    }
  ]
}
