{
  "id": "2727",
  "title": "LOGO CONFIDENTIALITY",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "does anyone have examples of logos that have been modified at the development stage to hide the name of the organization so that it can be market researched/print tested without fear of leaking a) a new name b) an new design for a existing company?   \na collection of these might be interesting.\n\n",
  "author": "miles",
  "time": "Thu, 2004-01-15 10:58",
  "uid": "967",
  "comments": [
    {
      "time": " Thu, 2004-01-15 15:46",
      "content": "This is something we worked on back in 2001   \n   \ntender image:   \n ![Tender image](http://web.archive.org/web/20050516142141im_/http:/www.typophile.com/forums/messages/30/24274.jpg)   \nfinal image   \n ![Final image](http://web.archive.org/web/20050516142141im_/http:/www.typophile.com/forums/messages/30/24275.jpg)   \n   \nGist is basically the road transport distribution part of BOC(a UK medical & industrial gases business)expanded to offer services to third parties. I believe they carry Marks & Spencer grocery products for instance.   \n   \nWhat intrigued me was that neither the word GIST or the broad style of the image we saw was associated with any business at the time, so even if we knew what it was going to be called, it still wouldn't have meant anything to anybody.   \n   \nPS: I never knew that \"gist\" was the centre of the word \"logistics\" until five minutes ago!   \n   \nSome linkage:   \n   \nGIST [http://www.gistworld.com/index.html](http://web.archive.org/web/20050516142141/http:/www.gistworld.com/index.html)   \nBOC [http://www.boc.com/index.cfm](http://web.archive.org/web/20050516142141/http:/www.boc.com/index.cfm)   \nBrand consultants [http://www.corporateedge.com/search/article.asp?ArticleID=408&ArtCat=12&Search=gist&Order=dd](http://web.archive.org/web/20050516142141/http:/www.corporateedge.com/search/article.asp?ArticleID=408&ArtCat=12&Search=gist&Order=dd)   \nFlash animators [http://www.two3rdswater.net/portfolio/web/boc\\_gist/](http://web.archive.org/web/20050516142141/http:/www.two3rdswater.net/portfolio/web/boc_gist/)\n\n"
    },
    {
      "time": " Mon, 2004-01-19 06:51",
      "content": "thanks,   \nwasnt it jeremy T that work on the type on that?\n\n"
    },
    {
      "time": " Mon, 2004-01-19 12:14",
      "content": "I don't think I should have said \"worked on\", my involvement was in the production of reflective badges for staff uniforms, from the finished artwork.\n\n"
    },
    {
      "time": " Mon, 2004-01-19 12:54",
      "content": "Whoa - I've never heard of this. Is it some new British thing?   \n   \nHow do they equate results from this research for a logo design   \nwith no name, is the answer that blue is better and red didn't work for your   \ncompany called 'Company A Inc.'?   \n   \nLooks like Richard's client wasn't even testing type or colour on their market. Was the test only about a gradient? Was that research oriented or for printability?   \n   \nAnd finally why would any company do this? Sounds like a waste of money that could otherwise be spent on their product or service. Sounds like some clients don't trust our skill,   \nor a matter of watching over our shoulders while we work, plain ol disrespect   \nor is this the final answer that would hold all designers liable for our work.   \n   \n   \n-t\n\n"
    },
    {
      "time": " Mon, 2004-01-19 16:37",
      "content": "Well, the logo is only one element in a corporate design, so perhaps they just wanted to do some focus group testing of ads, without tipping their hand.\n\n"
    },
    {
      "time": " Mon, 2004-01-19 23:15",
      "content": "In this case the first image was supplied to companies who were actually going to manufacture product with this new branding, in our case, reflective badges for high-visibility jackets.   \n   \nI can only imagine(and hope, for the client's sake!) that the design and evaluation process had already been carried out.   \n   \nThis sort of thing is very useful in a production environment. It isn't usually as good as this when our client is the end user's garment supplier, and we get all the right information from the start.   \n   \nA more common situation goes something like this:   \n   \nA freight company somewhere in England.   \nA decision is taken to obtain high-visibility jackets.   \nThe guy who normally places orders(probably knows all there is to know about truck tyres) rings his contact in an industrial supply company(who happens to major in packing tape and warehouse supplies).   \nTapeman speaks to somebody in our sales department(very keen, but can't always tell how many colours make up CMYK) and asks for a quote for , say it was the GIST image above, a two colour badge.   \nIf we're really lucky they'll fax us a photocopy of the logo as well.   \n   \nBTW the first image above was a scan of an old inkjet print I had hanging around, so there isn't much colour management going on here.\n\n"
    },
    {
      "time": " Wed, 2004-01-21 10:10",
      "content": "aa ok - I can see it now.   \n   \nfor production tests yeah - but don't see why one would hide the corp name or not test it on the real one still save for the client being disorganized.   \n   \nfor focus group as Nick mentioned - yeah if it was a ad..I get it now.\n\n"
    }
  ]
}
