{
  "id": "273",
  "title": "Internship",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I'm going in for an interview at P22 to possibly get an internship. I was wondering if you guys think I should include these two unfinished fonts in my portfolio. Also feel free to critique them as well. Thanks.   \n ![ebin](http://web.archive.org/web/20131023151008im_/http:/www.typophile.com/forums/messages/29/11347.gif)   \n ![ebin2](http://web.archive.org/web/20131023151008im_/http:/www.typophile.com/forums/messages/29/11348.gif)   \n ![untitled](http://web.archive.org/web/20131023151008im_/http:/www.typophile.com/forums/messages/29/11349.gif)\n\n",
  "author": "colin kahn",
  "time": "2 Jun 2003 — 2:16pm",
  "uid": "1165",
  "comments": [
    {
      "time": "3 Jun 2003 — 1:31am",
      "content": "Hi,   \nWhen I interview people, I see nothing wrong with unfinished work in a portfolio. If nothing else it shows that you're active. Refer to it as work in progress though, as 'unfinished' could give the wrong impression that you started the work, but couldn't be arsed to finish it.   \n   \nBTW I don't know the people at P22, but when I've dealt with them, they seem laid back enough not to be anal about things like this.   \n   \nAs for the fonts, I like the first one a lot - maybe the lc a looks a little out of place.\n\n"
    },
    {
      "time": "3 Jun 2003 — 8:01am",
      "content": "Thanks Steve.   \nYeah I guess presentation is everything when your in an interview so calling it unfinished wouldn't be so smart. Now that i've had some time to think about it i'm probably not going to put the second one in. I haven't really worked on it that long and it's a little too generic.   \nAlso, I can see what you mean about the lc a. If i ended up changing it should i also change the e?\n\n"
    },
    {
      "time": "3 Jun 2003 — 8:48am",
      "content": "\\>\\>If i ended up changing it should i also change the e?   \n   \nMaybe, I think both the 'a' and the 'e' (and maybe even the 'g') suggest a slight pause and change of direction in the penstroke, which seems out of place in this font   \nI like the bowls of the lc 'b', 'c' & 'd' more   \n   \nAlso the lc 'a' may benefit from a tail - does it look a bit too futuristic for the rest of the font?\n\n"
    },
    {
      "time": "4 Jun 2003 — 3:06pm",
      "content": "Well, I got the internship (which looks like it's going to be great), so now maybe I'll have time to work on this again.   \n   \nI also found out that Rich Kegler sometimes posts here so... Rich if your reading this AVERT YOUR EYES!   \n   \n\\>\\>Also the lc 'a' may benefit from a tail   \n   \nI see what you mean, compared to the \"e\" it looks a little off balance. I'm going to work on this tomorrow and friday so i'll do some revisions and post them. Thanks again.\n\n"
    },
    {
      "time": "4 Jun 2003 — 3:11pm",
      "content": "Congrats!   \nP22 has always seemed like a great place to work.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Jun 2003 — 7:07pm",
      "content": "Thanks Hrant. I'm sure it's going to be great. I'll keep you posted on how it goes.\n\n"
    }
  ]
}
