{
  "id": "27309",
  "title": "Nasty Impact",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "In the interests of fairness, isn't it about time [Impact](http://web.archive.org/web/20150123174658/http:/typophile.com/wiki/Impact) got the beats?  \nAfter all, other types made ubiquitous by [bundling](http://web.archive.org/web/20150123174658/http:/typophile.com/wiki/bundling), such as [Comic Sans](http://web.archive.org/web/20150123174658/http:/typophile.com/wiki/Comic%20Sans), [Papyrus](http://web.archive.org/web/20150123174658/http:/typophile.com/wiki/Papyrus), [Trajan](http://web.archive.org/web/20150123174658/http:/typophile.com/wiki/Trajan) and [Arialvetica](http://web.archive.org/web/20150123174658/http:/typophile.com/wiki/Arialvetica) have been roundly dissed for overexposure.  \nOnly trouble is, it could prove difficult to find an alternative with suitable, er, impact, especially considering Impact's barely-protruding [descenders](http://web.archive.org/web/20150123174658/http:/typophile.com/wiki/descender).  \nSuggestions, anyone?\n\n",
  "author": "Nick Shinn",
  "time": "28 Jul 2006 — 9:07am",
  "uid": "2021",
  "comments": [
    {
      "time": "28 Jul 2006 — 9:13am",
      "content": "Isn't impact just a copy of helvetica inserat?\n\n"
    },
    {
      "time": "28 Jul 2006 — 9:25am",
      "content": "Oh there are plenty of alternatives.\n\nVery similar, but not nearly as overused:  \n [Hadrian](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/showfont.cfm?fid=LP.9491.0.0)  \n [Aura](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/showfont.cfm?fid=C.106994.0.0)  \n [Swiss 924](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/showfont.cfm?fid=BT.122451.0.0)  \n [Helvetica Inserat](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/showfont.cfm?fid=LH.120906.0.24), [Compressed](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/showfont.cfm?fid=LH.120906.0.21), [Extra Compressed](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/showfont.cfm?fid=LH.120906.0.22), and [Ultra Compressed](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/showfont.cfm?fid=LH.120906.0.23)  \n [Anzeigen Grotesk](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/showfont.cfm?fid=LH.106437.0.0)  \n [British Inserat](http://web.archive.org/web/20150123174658/http:/www.myfonts.com/fonts/itfmecanorma/british-inserat/?refby=typographica)  \n [Haettenschweiler](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/showfont.cfm?fid=M.119167.0.0) (often mistaken for Impact, but much more square. [Bundled with MS Office](http://web.archive.org/web/20150123174658/http:/www.microsoft.com/typography/fonts/font.aspx?FID=30&FNAME=Haettenschweiler&FVER=2.30) and other Microsoft products so also prone to overuse.)\n\nFurther afield, but equally bold, compact, and short in the descender:  \n [Compacta](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Compacta)  \n [Balboa](http://web.archive.org/web/20150123174658/http:/www.typedesign.com/fonts/balblk.html)  \n [Placard](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/showfont.cfm?fid=M.215.0.0)  \n [Aurora](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Aurora)  \n [Bigticy](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/showfont.cfm?fid=PRE.119257.0.0)  \n [Permanent Headline](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/showfont.cfm?fid=UR.123755.0.0) (no descenders!)\n\nNot so short in the descender, but equally powerful condensed headline grots:  \n [California Grotesk](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=california%20grotesk)  \n [ITC Roswell](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Roswell)  \n [Bureau Grotesque](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Bureau%20Grotesque)  \n [Knockout](http://web.archive.org/web/20150123174658/http:/www.typography.com/catalog/knockout/index.html)  \n [Champion Gothic](http://web.archive.org/web/20150123174658/http:/www.typography.com/catalog/champion/index.html)\n\n"
    },
    {
      "time": "28 Jul 2006 — 9:49am",
      "content": "_Isn’t impact just a copy of helvetica inserat?_\n\nNot at all. Geoffrey Lee, the designer himself, [joined a Typophile discussion](http://web.archive.org/web/20150123174658/http:/www.typophile.com/node/7921) a couple of years ago to talk about its origins. I gained some more respect for the face and was reminded that its over- and misuse is mostly due to bundling.\n\n"
    },
    {
      "time": "28 Jul 2006 — 11:44am",
      "content": "It is a great face for dealing with retail advertising, which I once did (and overdid, using Antique Olive Bold). The customers (or is it just the ad space salesmen) were always crying for a bolder, blacker font. You can't get much more black on the page than with Impact.\n\n"
    },
    {
      "time": "28 Jul 2006 — 12:54pm",
      "content": "I have been working on such a face. It is in very early stages. For now it is called \"Big Squeeze\":\n\nChrisL\n\n ![](http://web.archive.org/web/20150123174658im_/http:/typophile.com/files/bigsqueeze_4162.png)\n\n"
    },
    {
      "time": "28 Jul 2006 — 1:30pm",
      "content": "Wait, is this \"yet another\" new design you are working on?\n\nI work hard, Chris, all day, and all too often most of the night. I can't touch your productivity, though ;-)\n\n"
    },
    {
      "time": "29 Jul 2006 — 10:11am",
      "content": "That's incredible. Thanks for the link, Stephen.\n\n"
    },
    {
      "time": "29 Jul 2006 — 4:23pm",
      "content": "Dezcom, that new design reminds me a little of a very bold and compressed MM instance of Briem Akademi, but more readable and not quite so technical looking as that MM face.\n\nOn the subject of Impact, I got pretty sick of it years ago. It does serve its purpose well but if I need to use a face like that I normally select a weight of Compacta or one of the compressed weights of Helvetica instead.\n\n"
    },
    {
      "time": "29 Jul 2006 — 4:59pm",
      "content": "Thanks Dan and Bobby.  \nHere is a file with the 3 variations in width that I have so far. One is called \"Tight Squeeze\", followed by \"Main Squeeze\" and \"Tight Squeeze\"\n\nChrisL\n\n ![](http://web.archive.org/web/20150123174658im_/http:/typophile.com/files/3-squeezes_5233.png)\n\nPS: with this, I will stop hijacking Nick's thread.\n\n"
    },
    {
      "time": "30 Jul 2006 — 6:18am",
      "content": "In all honesty, I actually still like Impact, but I do use Compacta more frequently. Saw some nice alternatives in Stephen's list & can't wait to see the finished Squeeze from Chris.  \nI also like Qhytsdakx, a free font on Dafont quite a lot.\n\n[http://www.dafont.com/search.php?q=Qhytsdakx](http://web.archive.org/web/20150123174658/http:/www.dafont.com/search.php?q=Qhytsdakx \"http://www.dafont.com/search.php?q=Qhytsdakx\")\n\n"
    },
    {
      "time": "30 Jul 2006 — 10:47am",
      "content": "_\"In the interests of fairness, isn’t it about time Impact got the beats?\"_\n\nHere, here, I agree. Impact is like so totally lame.\n\nWhat's needed is an easy scapegoat to blame for all the crap typography in the world. We should form a lynch mob and pay **[www.ascendercorp.com](http://web.archive.org/web/20150123174658/http:/www.ascendercorp.com/ \"www.ascendercorp.com\")** a visit.\n\nIts gotta be a step in the right diretion. Well, it'll make me feel better anyway.  \n;)\n\n"
    },
    {
      "time": "30 Jul 2006 — 11:06am",
      "content": "Wormwood - The root of bad type choices is in the bundling of fonts in operating systems and software. 99% of the Impact you see in use came from the fonts included with [Windows or Office](http://web.archive.org/web/20150123174658/http:/www.microsoft.com/typography/fonts/font.aspx?FID=7&FNAME=Impact&FVER=2.35) or OS X. Ascender didn't infect the world with Impact, that happened long before they bought the rights to license it to other chumps.\n\n"
    },
    {
      "time": "30 Jul 2006 — 11:48am",
      "content": "Illsans, Dan, and Bobby,\n\nI will be posting my progress on \"Squeeze\" here in the Critique area:\n\n[http://typophile.com/node/27326](http://web.archive.org/web/20150123174658/http:/typophile.com/node/27326 \"http://typophile.com/node/27326\")\n\nChrisL\n\n"
    },
    {
      "time": "30 Jul 2006 — 1:58pm",
      "content": "Stephen, you don't think i was being serious, do you? I was just lampooning the whole font bashing thing. I sould have made my ;) winking smiley bigger.\n\nBundling fonts with software is to be expected, and Windows et al have an adequate range for most peoples needs.\n\nI think Impact is an OK font, just not my choice for anything. So is Comic Sans come to that, as long as it's used in the right context, ie a cartoon speech bubble and not a business letter or funeral service.\n\nArial is only commonplace because someone didn't want to pay for the rights to Helvetica and the unrefined masses can't tell the difference anyway.\n\nBut hey, we shouldn't get snobby, it's the price to be paid for typographic liberation.\n\n"
    },
    {
      "time": "30 Jul 2006 — 2:12pm",
      "content": "Cool, Chris. I'll check out that thread.\n\nOn font bundling, sure the mere availability of computer-based fonts allows for misuse. But that's true for every creative application ever sold for a computer -at least one that was priced at any somewhat affordable level. What do we do about it? Price fonts and any application that can handle them well out of reach of most people?\n\nI'll offer what I think is the root of the problem: our education system.\n\nThere were penmanship courses in the past. Sometimes the garden variety art course in high school would delve into calligraphy. High schools have taught typing. But what are they doing that is appropriate for today? I think schools need to offer some basic page layout courses that include some basic coverage of typography.\n\nJust from the simple standpoint of putting together a résumé regular people aren't given much of a clue on what is appropriate for business communication. They are left on their own to guess.\n\nEven if operating systems and office productivity suites had their font bundles removed, we would still see lots of bad type happening.\n\nA lady I know who makes banners and other \"fast sign\" stuff in my town has really horrid taste in type. But she has fun doing what she's doing and other people are stupid enough to pay her for it. The awful nature of her work comes from a lack of design sense (or talent for that matter) in knowing what kind of fonts can work well with each other. She downloads lots of freeware fonts at various free font sites and comes up with some really strange combinations.\n\nI think most people know good typography when they see it. They know the page looks better, but don't know how to break down the mechanics on why the page looks better.\n\nIn the end good designers have to look at the situation as being more of an opportunity rather than a problem, work harder and use the imbalance to get more work for themselves. The most loyal customers tend to be the ones who are educated enough to understand the difference.\n\n"
    },
    {
      "time": "30 Jul 2006 — 6:49pm",
      "content": "Worm - I failed to recognize the winky and now I'm embarrassed!\n\n"
    },
    {
      "time": "31 Jul 2006 — 3:52pm",
      "content": "Maybe this is just a case of something being popular because it's good, or bundled because its popular? I like some of stephen's suggestions but none of them quite thump you in the head the way Impact does. Well maybe Compacta but it's not as readable. the Impact ampersand is rubbish though. House Gothic is quite cool too even though it's a bit disco for my everyday work. (and Squeeze looks like a naff version of it.)\n\n"
    },
    {
      "time": "31 Jul 2006 — 7:12pm",
      "content": "Good sometimes, but less effective when it's seen so often. Here are some more from Font Bureau:\n\n[\n ![](http://web.archive.org/web/20150123174658im_/http:/typophile.com/files/get_Font_Image-1_4461.php.png)\n  \nTasse](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Tasse)\n\n[\n ![](http://web.archive.org/web/20150123174658im_/http:/typophile.com/files/get_Font_Image-2_6741.php.png)\n  \nTitling Gothic](http://web.archive.org/)\n\n[\n ![](http://web.archive.org/web/20150123174658im_/http:/typophile.com/files/get_Font_Image-3_6346.php.png)\n  \nRhode](http://web.archive.org/web/20150123174658/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Rhode)\n\n"
    },
    {
      "time": "31 Jul 2006 — 7:15pm",
      "content": "I quite like [Tourist Gothic](http://web.archive.org/web/20150123174658/http:/www.p22.com/lanston/products/touristgothic.html) for something bold and condensed.\n\n"
    },
    {
      "time": "31 Jul 2006 — 7:47pm",
      "content": "Nice, Paul. I missed that release. The alts are cool, but a pity that the caps are so much heavier than the lc. Artifact of the metal type I suppose.\n\n"
    },
    {
      "time": "31 Jul 2006 — 7:49pm",
      "content": "Nice preview, Paul. Law italic is pretty cool too!\n\n"
    },
    {
      "time": "31 Jul 2006 — 8:29pm",
      "content": "Lotsa contenders Stephen, but dare they go head to head with the Big Imp?\n\nThose last few look OK until you see how big on the body Impact is, and how truly stunted its extenders are. I don't have any of those three on hand, but here's Impact vs. Helvetica Black Condensed at the same point size, to illustrate the two features I mentioned.\n\n ![](http://web.archive.org/web/20150123174658im_/http:/typophile.com/files/ThumpThump_6344.png)\n\n"
    },
    {
      "time": "31 Jul 2006 — 9:39pm",
      "content": "To REALLY get the effect of Impact, you have to set it with no leading! That's how I like it best. (Can somebody else make a preview of this? I can't be bothered to figure out how to add an image to my message because I don't see a button for it). Do any of you experts know why there's no italic?\n\n"
    },
    {
      "time": "31 Jul 2006 — 10:40pm",
      "content": "Because an italic would look bad.\n\n"
    },
    {
      "time": "1 Aug 2006 — 7:37am",
      "content": "...There's an idea for a design challenge: \"Design an 'Impact Italic' that doesn't look bad\"... :D\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "1 Aug 2006 — 8:09am",
      "content": "It's an interesting question - should bundled fonts come in the four basic styles? At a more basic level would true italics for Impact or Comic Sans improve the typographic landscape or just encourage people to use them more?\n\n"
    },
    {
      "time": "1 Aug 2006 — 9:59am",
      "content": "_should bundled fonts come in the four basic styles?_\n\nHow long have you been with Microsoft Si? :-)\n\n"
    },
    {
      "time": "1 Aug 2006 — 10:13am",
      "content": "\\> should bundled fonts come in the four basic styles?\n\nMany people here will say fonts should not be bundled.\n\nI like it when fonts come in all four weights. The most overly used bundled font is probably Zapf Chancery, which most people think is a script, since it was bundled without the romans and the italics in other weights. It's a fine font, if you can avoid overuse of the italic weight everyone is so familiar with.\n\nBut I got one of the Shelley fonts bundled in an Adobe product once. There just isn't a roman version, and it would be silly to think of one.\n\nDisplay fonts, traditionally, come solely or in incomplete families.\n\n"
    },
    {
      "time": "1 Aug 2006 — 10:22am",
      "content": "_There just isn’t a roman version, and it would be silly to think of one._\n\nRight, not a very useful idea--but that kind of thing has been done.  \nThe roman of Frank Heine's Dalliance was reverse-engineered from an italic script.\n\n"
    },
    {
      "time": "1 Feb 2009 — 6:44pm",
      "content": "For some reason I remembered this thread from long ago and came back to look at it again.\n\n**Nick Shinn** said:  \n_Only trouble is, it could prove difficult to find an alternative with suitable, er, impact, especially considering Impact’s barely-protruding descenders. Suggestions, anyone?_\n\nI wonder why Block Berthold wasn't mentioned. Also, I'm very enamored of [TeslaDynamo](http://web.archive.org/web/20150123174658/http:/www.typonine.com/site/index.php?option=com_content&view=article&id=147&Itemid=79) at the moment. Don't have it yet, alas, but hope to soon.\n\n ![](http://web.archive.org/web/20150123174658im_/http:/typophile.com/files/tesladynamo_5725.png)\n\n"
    },
    {
      "time": "1 Feb 2009 — 8:11pm",
      "content": "I know these are not in the same league as Impact, but I get a lot of use out of them in similar situations. I also know for a fact that they are not over used.\n\n[http://www.thefontry.com/narrowblockpak1all](http://web.archive.org/web/20150123174658/http:/www.thefontry.com/narrowblockpak1all)\n\n"
    },
    {
      "time": "2 Feb 2009 — 1:22pm",
      "content": "there are at least three times i've used IMPACT, and each time. i thought it was perfect. this could easily be a stronger indictment on me than the typeface. but still-- i'm all for throwing a face out there into the public square, and seeing if it can come away without charges of heresy.\n\n"
    },
    {
      "time": "2 Feb 2009 — 1:29pm",
      "content": "But... but... what about the LOLcats?\n\n"
    }
  ]
}
