{
  "id": "27326",
  "title": "Big Squeeze bold display facing the public",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I have added a PDF poster with the z changed as per Eben's good idea.\n\nHere is an early look at a display family I started that will be multiple widths of very heaqvytype with italics to come later.\n\nChrisL\n\n ![](http://web.archive.org/web/20131019185420im_/http:/typophile.com/files/squeezed-out_4703.png)\n\n| Attachment | Size |\n| --- | --- |\n| [DezSqueeze3a.pdf](http://web.archive.org/web/20131019185420/http:/typophile.com/files/DezSqueeze3a.pdf) | 186.45 KB |\n\n",
  "author": "dezcom",
  "time": "30 Jul 2006 — 11:39am",
  "uid": "3135",
  "comments": [
    {
      "time": "30 Jul 2006 — 11:44am",
      "content": "Here is a small peek at the 4 weights:\n\nChrisL\n\n ![](http://web.archive.org/web/20131019185420im_/http:/typophile.com/files/Squeeze-4showing_5451.png)\n\n"
    },
    {
      "time": "31 Jul 2006 — 2:22am",
      "content": "I like, I guess you're going to use it only in big size, aren't you? You could design one even thinner.\n\ntonicastro\n\n"
    },
    {
      "time": "31 Jul 2006 — 7:57am",
      "content": "Thanks Toni, Yes, large sizes only.\n\nI think I will make a narrower one as well. Perhaps I should call it \"Charmin Squeeze\" :-)\n\nChrisL\n\n"
    },
    {
      "time": "31 Jul 2006 — 7:55pm",
      "content": "I like it. I wish this had come out a year and a half ago - I might have used it instead of Compacta for a rebranding I did.\n\nYou should also make a unicase version if you have time. I find that these sort of fonts look great in unicase.\n\n- Lex\n\n"
    },
    {
      "time": "31 Jul 2006 — 9:19pm",
      "content": "Thanks Lex!  \nI'll try the unicase as well.\n\nChrisL\n\n"
    },
    {
      "time": "5 Aug 2006 — 4:20pm",
      "content": "Here is another take on it with an added weight and deQued tail (detailedQ)\n\nChrisL\n\n ![](http://web.archive.org/web/20131019185420im_/http:/typophile.com/files/tallsqueeze_4350.png)\n\n"
    },
    {
      "time": "6 Aug 2006 — 3:06am",
      "content": "That q is a great hybrid solution. You keep the curves you like without having to resort to a tail.\n\n"
    },
    {
      "time": "6 Aug 2006 — 4:57am",
      "content": "It was the tail wagging the dog Dan :-)\n\nChrisL\n\n"
    },
    {
      "time": "21 Aug 2006 — 11:09pm",
      "content": "Some of the spacing is not quite right. Look at the t's in Tight. But in general it's quite strong. There is something about the cuts in the Z that catch my eye too strongly. Maybe they could use a different angle. Or find a way to use the horizontal by making the cut less deep. That what I see so far.\n\n"
    },
    {
      "time": "22 Aug 2006 — 5:38am",
      "content": "Thanks Eben! I see that \"ti\" and \"fa\" as being too loose as well. Regarding the z, I have to give it more time in absence before I can judge it properly. I was thinking about making thenarrow wedges flat horizontalto line up with the horizontal of the \"e\".\n\nChrisL\n\n"
    },
    {
      "time": "26 Sep 2006 — 8:18pm",
      "content": "I think that letter \"q\" without tail makes it cleaner. Regarding the small cuts in letter \"z\", I think they give more personality to the font.\n\n—  \nCarlos Fabián Camargo G.\n\n"
    },
    {
      "time": "27 Sep 2006 — 8:53am",
      "content": "Thanks Carlos!\n\nChrisL\n\n"
    },
    {
      "time": "21 Oct 2006 — 2:34pm",
      "content": "Looking again I wonder if the curves I see in some of the others letters should be in the z too. Maybe here:\n\n ![](http://web.archive.org/web/20131019185420im_/http:/typophile.com/files/z_4873.jpg)\n\nWhat do you think?\n\n"
    },
    {
      "time": "21 Oct 2006 — 5:40pm",
      "content": "That might make sense! It is the only letter witthout a softness and that would bring it in to the fold. I'll give it a try! Thanks Eben.\n\nChrisL\n\n"
    },
    {
      "time": "21 Oct 2006 — 6:05pm",
      "content": "Your welcome! Will you be posting PDF later? I Really like the slight rise in the Main squeeze q btw. Cheers!\n\n"
    },
    {
      "time": "21 Oct 2006 — 6:13pm",
      "content": "the dot on the i seems to be going the wrong direction. or is it just me?\n\n"
    },
    {
      "time": "21 Oct 2006 — 6:46pm",
      "content": "You know, I think you might be right.... Chris, can we see it the other way?\n\n"
    },
    {
      "time": "21 Oct 2006 — 7:42pm",
      "content": "Hi Chris.  \nVery nice work you have done there.  \nCould it be that the _faucet/water tap_ of the r isn't straight, it looks a bit slanted.\n\n"
    },
    {
      "time": "21 Oct 2006 — 8:05pm",
      "content": "OK, here is a PNG with the Eben Z and the i dot at bottom both ways:\n\n ![](http://web.archive.org/web/20131019185420im_/http:/typophile.com/files/Squeeze-6showing-i2_5853.png)\n\nChrisL\n\n"
    },
    {
      "time": "21 Oct 2006 — 8:07pm",
      "content": "The line in brown at bottom which says:  \n\"big i jilting dot\" has the dot flipped as per Paul's suggestion. The one below it in green is the original way.\n\nChrisL\n\n"
    },
    {
      "time": "21 Oct 2006 — 8:29pm",
      "content": "Eben,  \nI just added a PDF poster at the top of the thread.\n\nChrisL\n\n"
    },
    {
      "time": "22 Oct 2006 — 12:31am",
      "content": "looking at it now, i think i was wrong about the tittle. sorry, dez. :P\n\n"
    },
    {
      "time": "22 Oct 2006 — 6:15am",
      "content": "Paul, no sweat, it was worth a quick try. The dot the original way (in green) matches the \"l\" and looks better in a string like \"jil\".\n\nI like Eben's suggestion for the curve on the z though; that is a keeper! Thanks Eben!\n\nChrisL\n\n"
    },
    {
      "time": "22 Oct 2006 — 11:35am",
      "content": "I have an idea about the dot. I bet you could go either way ( with the curved side orientation) if the space between the dot the rest of the letter was tighter as the letters get fatter. I should say that the narrower faces' dot looks fine to me. But I think the dots on the heavier weights are maybe breaking away from their letters - sort of breaking the grammer of the design. I am attaching an example but keep in mind I am working in whole pixel increments which are unsubtle. There is a big difference between the top & bottom & it's a sub pixel difference. I think I like the top one better at this weight. Let me know what you think.\n\n ![](http://web.archive.org/web/20131019185420im_/http:/typophile.com/files/dot_4096.jpg)\n\n"
    },
    {
      "time": "22 Oct 2006 — 11:48am",
      "content": "The top one still gives me a problem next to the lower case L. It makes the il combination look too complete, almost like one glyph.\n\nChrisL\n\n"
    },
    {
      "time": "22 Oct 2006 — 1:23pm",
      "content": "Your right. The direction does matter.\n\nThe more I look the more I get ideas. I will mention them but obviously take them with a grain of salt.\n\n- I noticed ( or think I did) that you have the bottom part of the join of the bottom of the bowl in the q for Big squeeze cutting upward slightly. That looks good. I think the other q's would look better with it too. And other letters too. Like the d. The lc a in main has alternative form that is like the top of the q. It sticks out a little. I might like that even better. The top of the bowl in lc b could maybe use it too. Or be cut in & down at the top join. And I am running on here... but, what about the z? What if it had a rise like you have in the lc a at the far upper left & far bottom right corners? Also I wonder if the crossbar on the t needs to get slightly thicker as the face gets heavier.\n\nMany of these suggestions are a bit chirographic in nature. But the type is somewhat constructed looking. What kind of balance or impression are you going for? I don't have a very clear picture of your intentions with this face and my suggestions are comming from too many guesses about that I bet. There are probably other more abstract ways of making a balance you could be choosing too. Would you tell us about your intention a bit? What faces would it compete with do you think? Does that matter?\n\n"
    }
  ]
}
