{
  "id": "27331",
  "title": "NOW Gaunt Display, the eating disorder typeface",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I am working on a display face for the NOW family. I have always liked using really skinny weights so added the following as the gaunt member of the family.\n\nJust added a new PDF with some corrections\n\nChris\n\n ![](http://web.archive.org/web/20150419055124im_/http:/typophile.com/files/Now-gaunt-opener_5095.png)\n\n| Attachment | Size |\n| --- | --- |\n| [NOW\\_Gaunt\\_display.pdf](http://web.archive.org/web/20150419055124/http:/typophile.com/files/NOW_Gaunt_display.pdf) | 29.37 KB |\n| [NOW\\_Gaunt2.pdf](http://web.archive.org/web/20150419055124/http:/typophile.com/files/NOW_Gaunt2.pdf) | 29.23 KB |\n\n",
  "author": "dezcom",
  "time": "30 Jul 2006 — 2:18pm",
  "uid": "3135",
  "comments": [
    {
      "time": "30 Jul 2006 — 2:31pm",
      "content": "You just don't stop, do you? :-)\n\nI'm not so sure about this curve you have on the top of some of your lowercase verticals. On the m, n, and r, I think it is OK. I don't like it on the i when the strokes get this thin. It looks too wobbly. It also makes me wonder why you have straight, flat entries on your ascenders.\n\nI like the ampersand.\n\n"
    },
    {
      "time": "30 Jul 2006 — 2:33pm",
      "content": "Dan,  \nI did it that way with the text version and was just being consistant.\n\nChrisL\n\n"
    },
    {
      "time": "30 Jul 2006 — 2:53pm",
      "content": "Yeah, I know. Somehow in my head I'm envisioning a multiple master axis for the tops of these strokes that runs from straight to curved as the weight axis is increased as well. Wouldn't that be something! Then, your regular's curve would be in between the hairline and the heavy.\n\nBut then again, I envision a lot of things in my head, and I wouldn't assume that most of them are credible ;-)\n\nI remember Tiffany writing something about not liking sans serifs that have flat entry strokes a few days ago… or something to that effect. That made me think a bit. Quite an interesting perspective.\n\n"
    },
    {
      "time": "30 Jul 2006 — 3:07pm",
      "content": "\"not liking sans serifs that have flat entry strokes a few days ago\"\n\nI wonder why?\n\nChrisL\n\n"
    },
    {
      "time": "30 Jul 2006 — 4:53pm",
      "content": "Hmm. I don't remember either. Do you know where I said this? Context would help jog my memory.\n\nChris, this is looking really nice for a huge thin display font. I think the open bowl on your cap P is a little too open. But then this is coming from someone who doesn't really like open bowls.\n\n- a -- is the entry stroke a little too long?  \n- B (reg and sc) -- is the bottom bowl a little too large?  \n- P (reg and sc) -- too open?  \n- R (reg and sc) -- too open?  \n- Q (reg and sc) -- tail too long?\n\nI wonder the same thing about the angled strokes on the i & j ...\n\n"
    },
    {
      "time": "30 Jul 2006 — 5:48pm",
      "content": "tiff i think you were talking about Verlag and saying how you didn't like the shear on the light weight \"t\". I think that's what dan is referring to.\n\n"
    },
    {
      "time": "30 Jul 2006 — 11:44pm",
      "content": "It was this thread.  \n [http://typophile.com/node/21352](http://web.archive.org/web/20150419055124/http:/typophile.com/node/21352 \"http://typophile.com/node/21352\")\n\nIt took me a couple of minutes to ‘understand’ what you meant. I though you were talking about the opening (and a couple of ending) strokes. So…?\n\n"
    },
    {
      "time": "31 Jul 2006 — 8:09am",
      "content": "Dan,  \nI am wondering about the \"i\" being a 90 degree entry stem like my alternate i ? The i needs something at that thin weight.\n\nChrisL\n\n"
    },
    {
      "time": "31 Jul 2006 — 8:16am",
      "content": "Tiff,  \nYou may be right about the \"a\", I will try it.\n\nIn terms of the open strokes, I tried them before with more closure and they just look appologetic. I think a harline weight needs a dominant negative space and the opened glyphs seem to help that for me. See my post above on the i for the i and j as well.\n\nRegarding the B, I have a real dilemma with the top bowl meeting the bottom bowl. If the bowls are more equal, there is a hot spot at the join. I fought more with that spot than anyting else on the font. With a harline, a one unit move is about 10% shift and quite noticable. I am wondering if I should move up to 2000 UPM on this font?\n\nChrisL\n\n"
    },
    {
      "time": "1 Aug 2006 — 5:00am",
      "content": "Chris,\n\nDid you consider lightening the join of the 'B' by opening it, mirroring the 'R' and 'P' ?\n\nadrian\n\n"
    },
    {
      "time": "1 Aug 2006 — 5:07am",
      "content": "Adrian,  \nActually, I have been debating that in my mind but worried it would be to far a stray of the other weights. I think i will at least do an alternate B as open and see what people think. thanks for the encouragement!\n\nChrisL\n\n"
    },
    {
      "time": "6 Aug 2006 — 6:17pm",
      "content": "I created an alternate B and smcp B with open center as suggested by Adrian.  \nI tinkered with some other things throughout.  \nSee PDF above.\n\nChrisL\n\n"
    },
    {
      "time": "8 Aug 2006 — 1:50pm",
      "content": "People can’t wait!  \n [http://typophile.com/node/27522](http://web.archive.org/web/20150419055124/http:/typophile.com/node/27522 \"http://typophile.com/node/27522\")\n\n"
    }
  ]
}
