{
  "id": "27330",
  "title": "(x) Bauhaus-like \"Substruct\" logo - House Chalet {Lari}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I did something really stupid. I forgot to save all of my photoshop/illustrator files when moving from a PC to a Macbook Pro for design this past month.\n\nI lost a design I was working on, and the font I was using with it.\n\nCan anyone ID the font used for the logo here: [http://substruct.subimage.com/](http://web.archive.org/web/20080410005407/http:/substruct.subimage.com/ \"http://substruct.subimage.com/\")\n\nI think it’s in the Bauhaus family, but the ITC Bauhaus isn’t a direct match. The closest thing I can find on my computer is Bauhaus93, but the weight is way too heavy. I remember having multiple weights of this font, as I also created a heavier version of the logo, but not as heavy as Bauhaus93.\n\nNotice it’s close to ITC Bauhaus, but the S is shaped differently, and the lowercase b is connected all the way through.\n\nCan anyone help???\n\n [‹ Nice script on Pillsbury packaging](http://web.archive.org/web/20080410005407/http:/www.typophile.com/node/27340 \"Go to previous forum topic\") [Prince of Persia: Warrior Within font ›](http://web.archive.org/web/20080410005407/http:/www.typophile.com/node/27325 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080410005407/http://www.typophile.com/user/6431\" title=\"View user profile.\">subimage</a>",
  "time": "<br>",
  "uid": "6431",
  "comments": [
    {
      "time": " 30.Jul.2006 1.57pm",
      "content": "Chalet Paris 1970\n\n"
    },
    {
      "time": " 30.Jul.2006 2.49pm",
      "content": "I agree with the Chalet Paris 1970 ID, particularly because of the S shape. The Chalet family was based on Bauhaus-related fonts and Avant Garde Gothic (apparently). I was thinking ’Pump light’, but it’s not this light and the S and c don’t match well.\n\nOdd that you would forget if you had Chalet, though.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 30.Jul.2006 6.45pm",
      "content": "Thanks! Yeah it’s been kind of scattered and I lost some backup cds since I moved to the macbook :(\n\n"
    },
    {
      "time": " 31.Jul.2006 7.34am",
      "content": "If you had really bought Chalet from House, they may be able to provide you with a download to replace your lost files. Some foundries do this for registered users.\n\n"
    }
  ]
}
