{
  "id": "27353",
  "title": "Fonts representing Old Italy?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey I'm looking for fonts representing Old Italy. It is for an italian motiff day spa. Any sugguestions?\n\n",
  "author": "j_polo9",
  "time": "1 Aug 2006 — 1:05am",
  "uid": "13221",
  "comments": [
    {
      "time": "1 Aug 2006 — 3:32am",
      "content": "Hmmm… Italian Old Style? ;-)\n\n[http://www.myfonts.com/fonts/linotype/italian-old-style/](http://web.archive.org/web/20150307184913/http:/www.myfonts.com/fonts/linotype/italian-old-style/ \"http://www.myfonts.com/fonts/linotype/italian-old-style/\")\n\n"
    },
    {
      "time": "1 Aug 2006 — 4:18am",
      "content": "\"Hey I’m looking for fonts representing Old Italy\"\n\n\"Hmmm… Italian Old Style? ;-)\"\n\n;)\n\nItaly has a lot of age(s) :), but staying with the theme of \"off the top of my head\", for a day spa...I'd use an antiqued version of Lithos regular, or light.\n\n"
    },
    {
      "time": "1 Aug 2006 — 4:31am",
      "content": "Old Italian style is a bit too plain and literal lol. Lithos is probably a bit too greek/Oscan/Etruscan or whatever it is lol.\n\nThe imagery of the spa will be old italy but the type doesn't so much have to be \"Old Italian Type\" as much as it should appear to have the qualities representing the period.\n\nThe main visual imagery is Old Italian, and Expensive/Sheik. here's my little brief about it:\n\nDolce Vita is an Italian Day Spa with expensive services marketed towards the wealthy. Dolce Vita should represent Old Italy and/or Sheik/Expensive. The logo must have an unforgettable quality, can be overly extravagant, and should be directed at men as well as women. The location will be decorated with Greek columns, Plaster Wall textures, Italian wall murals, dark textured concrete floors, fish tanks, and a circular relaxation room. Some additional visual imagery: Art Deco, Fancy/Floral, crown molding, little details, rich looking, drapery, olive branch, fruit theme/ Adam & Eve (dolce vita means \"sweet life\").\n\n"
    },
    {
      "time": "1 Aug 2006 — 4:52am",
      "content": "I guess I could use something from like Antiquity Through 16th century so that is probably too broad a category. Any sugguestions on how to narrow down what i should be asking for based on my short brief?\n\n"
    },
    {
      "time": "1 Aug 2006 — 5:05am",
      "content": "I would suggest you look for inspiration in the Italian Food section of your local supermarket - thats what the designer of this Chuck Mangione record cover did\n\n ![](http://web.archive.org/web/20150307184913im_/http:/typophile.com/files/Mangione_4866.gif)\n\n"
    },
    {
      "time": "1 Aug 2006 — 5:41am",
      "content": "ahh good idea. I think i might have to check out the wines at BevMo While I'm at it...\n\n"
    },
    {
      "time": "1 Aug 2006 — 5:44am",
      "content": "[http://www.fontsmith.com/fonts.php?font\\_num=250](http://web.archive.org/web/20150307184913/http:/www.fontsmith.com/fonts.php?font_num=250 \"http://www.fontsmith.com/fonts.php?font\\_num=250\")\n\nA nice alternative to Trajan. Do you mean chic/expensive?\n\nTim\n\n"
    },
    {
      "time": "1 Aug 2006 — 5:48am",
      "content": "Bodoni still says it for me.\n\nChrisL\n\n"
    },
    {
      "time": "1 Aug 2006 — 6:04am",
      "content": "Some Version of Bodoni would be a good start - perhaps combined with something more \"classic roman\".\n\n"
    },
    {
      "time": "1 Aug 2006 — 6:43am",
      "content": "Two thoughts:  \nOld Rome with a new twist: [Karv](http://web.archive.org/web/20150307184913/http:/www.klim.co.nz/content/type/karv_02.html)  \nLuxury + Expensive: [Luxury](http://web.archive.org/web/20150307184913/http:/www.orangeitalic.com/luxury.shtml)\n\nJust one problem. Neither of these are released yet, but perhaps if you contact Kris Sowersby/House Industries (respectively) they can work with you on getting advance copies?\n\n"
    },
    {
      "time": "1 Aug 2006 — 8:52am",
      "content": "Is suggesting an italic too obvious? If not:\n\n[http://www.myfonts.com/fonts/ihof/p22-operina/](http://web.archive.org/web/20150307184913/http:/www.myfonts.com/fonts/ihof/p22-operina/ \"http://www.myfonts.com/fonts/ihof/p22-operina/\")\n\n[http://www.myfonts.com/fonts/agfa/fairbank-mt/](http://web.archive.org/web/20150307184913/http:/www.myfonts.com/fonts/agfa/fairbank-mt/ \"http://www.myfonts.com/fonts/agfa/fairbank-mt/\")\n\n"
    },
    {
      "time": "1 Aug 2006 — 8:53am",
      "content": "[Louise Fili](http://web.archive.org/web/20150307184913/http:/louisefili.com/flash.html) is, in my opinion, a very thoughtful collector of italian (amongst other locale) typography. She designed a small book, _A Designer's Guide to Italy_ which was beautifully produced by [Darby LItho](http://web.archive.org/web/20150307184913/http:/www.darbylitho.com/) focussing on some of her collections. It is a little pricey, but for someone who collects I thougth it was worth it. Seeing pictures of this little book isn't the same as holding as you miss out on all of the tactile qualities from the production. There was a small article written about it in [STEPInside](http://web.archive.org/web/20150307184913/http:/www.stepinsidedesign.com/STEPMagazine/Article/28461) in 2005 which is now online.\n\nEqually you can't miss out on her book _Italian Art Deco: Graphic Design between the wars_ and _Deco Type: Stylish Alphabets from the '20s and '30s_, among many others, which features all of her collections. [Available at Amazon.](http://web.archive.org/web/20150307184913/http:/www.amazon.com/s/ref=br_ss_hs/002-3027848-3844840?platform=gurupa&url=index%3Dblended&keywords=%22louise+fili%22&Go.x=0&Go.y=0&Go=Go)\n\nAlso, you can't miss [Travel Brochure Graphics](http://web.archive.org/web/20150307184913/http:/www.travelbrochuregraphics.com/Top_Level_Pages/Italy/Italy_Main.htm) with there section on Italy.\n\n"
    },
    {
      "time": "1 Aug 2006 — 9:29am",
      "content": "I just dropped in to mention Louise Fili but Tiff beat me to the punch!\n\n"
    },
    {
      "time": "1 Aug 2006 — 9:43am",
      "content": "I have both of the Deco Books mentioned by Tiffany and they are well done, useful and not that pricey. A couple of good sources for \"old Italian\" Type.\n\n"
    },
    {
      "time": "1 Aug 2006 — 1:58pm",
      "content": "Handle Old Style?\n\n[http://www.myfonts.com/fonts/agfa/handle-old-style/](http://web.archive.org/web/20150307184913/http:/www.myfonts.com/fonts/agfa/handle-old-style/ \"http://www.myfonts.com/fonts/agfa/handle-old-style/\")\n\n"
    },
    {
      "time": "1 Aug 2006 — 3:00pm",
      "content": "@tim: ahh yes chic/expensive, thanks!\n\nAhh Bodini is a classic and it seems that most places use either the bodini look, the avante garde look, or the weathered papyrus look lol.\n\nThanks for all the replys! I'm looking into the other fonts sugguested as i type, well after i type this. I emailed rich yesterday about luxury and he said that it isn't available for setting but you can purchase a pre-release version in OT format now. Thanks!\n\n"
    },
    {
      "time": "2 Aug 2006 — 3:03am",
      "content": "My thoughts on the spa aren't about the type but imagery. Try finding a symbol of a god of luxury. Stylize it and use it as your CI and let the type be the supporting element. Just a thought\n\n"
    },
    {
      "time": "2 Aug 2006 — 6:39am",
      "content": "Bodoni just doesn't say luxury to me, but if the name has a lowercase g maybe [Roman X](http://web.archive.org/web/20150307184913/http:/www.myfonts.com/fonts/woodentypefonts/roman-x/) is a possibility.  \nHow about  \n [http://www.myfonts.com/fonts/dstype/kartago/](http://web.archive.org/web/20150307184913/http:/www.myfonts.com/fonts/dstype/kartago/ \"http://www.myfonts.com/fonts/dstype/kartago/\")\n\nor  \n [http://www.myfonts.com/fonts/linotype/optima/](http://web.archive.org/web/20150307184913/http:/www.myfonts.com/fonts/linotype/optima/ \"http://www.myfonts.com/fonts/linotype/optima/\")\n\nTim\n\n"
    },
    {
      "time": "2 Aug 2006 — 7:27am",
      "content": "Funny how fonts convey different feelings to different people. Bodoni really says luxury to me.\n\nChrisL\n\n"
    },
    {
      "time": "2 Aug 2006 — 7:57am",
      "content": "At the risk of going way off topic it would be interesting to work out what factors make people associate emotions with typestyles, trouble is I can't really pin down what it is that makes me feel that Bodoni doesn't portray luxury.  \nTim\n\n"
    },
    {
      "time": "2 Aug 2006 — 8:20am",
      "content": "I don't know either Tim. Maybe all of the high end fashion magazines printed in Bodoni or Didot give me that pricey feel?\n\nChrisL\n\n"
    },
    {
      "time": "2 Aug 2006 — 8:27am",
      "content": "wow Louise Fili is awesome and that book looks very nice!\n\n@Dan: I will try to find some good imagery, I don't think a god would be a good choice for this particular one, they want old italian. But maybe some play on davinci's creation of adam might work. (though its probably been done to death).\n\nKartago is cool. I think bodini looks luxurious, but it might just be because so many luxury brands use similar styles.\n\n"
    },
    {
      "time": "2 Aug 2006 — 10:49am",
      "content": "Creation of Adam is a Michaelangelo on the Sistine Chapel ceiling, I suspect you mean Vitruvian Man. Yes, it has been done to death, it is probably the Trajan of the illustration world.\n\nI do like Didones it's just that they don't convey luxury for me or at least not in this circumstance, I think I am thinking more of Italian\\>spa\\>Roman bath\\>Trajan and branching out from that:)\n\nTim\n\n"
    },
    {
      "time": "2 Aug 2006 — 1:55pm",
      "content": "There's always the classic Leonardo proportions of man thingie but maybe he's been done to death after the Da Vinci code. Or even before.\n\n"
    },
    {
      "time": "2 Aug 2006 — 5:46pm",
      "content": "lol oops of course it was michealangelo. I happened to be reading a davinci art book at the time and my cuba libre probably helped in the typo :P\n\nI've got some other hopefully less used ideas for the logo. But if anyone has any inspired ideas I would love to hear them, and love to recipricate help. Thanks!  \n-Jesse\n\n"
    },
    {
      "time": "2 Aug 2006 — 8:18pm",
      "content": "that Louise Fili book is gorgeous, thanks for the tip.\n\nHmm...I guess my interpretation of \"Old Italy\" was something a bit different. Here's a selection of covers of old italian 45s from my grandmother's collection-not exactly what this thread's about, but i just really love these and thought i would share...\n\n ![](http://web.archive.org/web/20150307184913im_/http:/typophile.com/files/italian45s_6704.jpg)\n\n"
    },
    {
      "time": "3 Aug 2006 — 4:50am",
      "content": "Wow! Nice tune boxes! Were these after WWII when they didn't have much metal left?\n\n"
    },
    {
      "time": "3 Aug 2006 — 7:35am",
      "content": "Maybe FTF Garda!?\n\n ![](http://web.archive.org/web/20150307184913im_/http:/typophile.com/files/GardaNet08_6690.jpg)\n\n[http://vllg.com/Feliciano/Garda/mudTyper+Weights](http://web.archive.org/web/20150307184913/http:/vllg.com/Feliciano/Garda/mudTyper+Weights \"http://vllg.com/Feliciano/Garda/mudTyper+Weights\")\n\n"
    },
    {
      "time": "3 Aug 2006 — 10:02am",
      "content": "\"Dolce Vita is an Italian Day Spa with expensive services marketed towards the wealthy\"  \nItalian??? How? Owned by American-Italians?\n\n\"The location will be decorated with Greek columns, Plaster Wall textures, Italian wall murals, dark textured concrete floors, fish tanks, and a circular relaxation room. Some additional visual imagery: Art Deco, Fancy/Floral, crown molding, little details, rich looking, drapery, olive branch, fruit theme/ Adam & Eve\"\n\nThe short version: kitsch. Is the spa in Las Vegas?\n\nFancy floral , little details, rich looking (whatever that means) is more art nouveau (800s/900s) than art deco (1920s). Art Deco and Art Nouveau are two different things and if you really want to be accurate you should make some research because Art Deco is more associated with geometric elements (see Charles Rennie Mackintosh etc.) and very stylised florals.\n\nLa Dolce Vita literally means \"the sweet life\" (or the good life) but it's also strictly associated with Fellini's film which is set in Rome in the sixties.\n\nIt is actually a nice name for a spa, but all these historical references and the visual imagery need to be sorted out urgently. And then Bodoni (1780) and Leonardo da Vinci and bottles of Italian wine???? That's Disneyland! Why bother finding the historically accurate typography if everything is so messed up? You can use any font!\n\n"
    },
    {
      "time": "3 Aug 2006 — 4:32pm",
      "content": "Ahh great post. Yes American-Italians. But in reality German German's could own it and still make it an italian style spa, no?\n\n\"The short version: kitsch. Is the spa in Las Vegas?\"  \nWell i don't think the spa will be \"kitsch\" but then I'm not building the spa just the logo. No not las vegas lol, just an expensive part of town here.\n\n\"...is more art nouveau (800s/900s) than art deco (1920s).\"  \nBy additional imagery I did not mean that it had to be all of those things lol, those are just the different things i'm trying out. Also I did purchase the Italian Art Deco book so i should get some good ideas from that. I got it on ecampus for $13! when it's normally $120.\n\nYour last point throws me off a bit, not sure what you mean about disneyland. You see I would never use Bodini + bottles of wine + da Vinci imagery togethar. But while Bodini might show luxury, wine might represent Old Italy and Da Vinci could represent High Italian Art; they all have their own benefits. I've always been told in brainstorming that there is no such thing as a bad idea becaues even bad ideas fused with good ideas can make great ideas.\n\nCan I ask what to you represents Old Italy in visual imagery and type?\n\n"
    },
    {
      "time": "3 Aug 2006 — 6:57pm",
      "content": "Oh yes, there are bad ideas. Lots of them. In fact the world is full of them!\n\nOld Italy.. It's centuries of history, art and culture we are talking about here. Not including the Roman empire (which was not in Old Italy really!).\n\nAnd what is an Italian style spa? You mean something inspired on Roman baths? With Greek columns and fish tanks in it??? Sorry: that is not kitsch because kitsch can be fun. It's plain silly. Obviously this is not your fault but you need to graphically represent this nightmare and boy, I don't envy you.\n\n"
    },
    {
      "time": "4 Aug 2006 — 12:53am",
      "content": "\\*\\* sorry wrong thread \\*\\*\n\n"
    },
    {
      "time": "4 Aug 2006 — 12:54am",
      "content": "Well of course there are bad ideas... but in brainstorming it is like the golden rule to not harp on bad ideas.\n\nOld italy is centuries of history, but i only need to represent the feel of what people think is old italy. Or draw certain qualities from what it could be to give the Day Spa a unique feel.\n\nsorry i thought you were using kitsch in a bad way. I don't think the clients would want this spa to feel kitsch. I kind of like this project, mostly because of the things i've found out from this thread lol. Too bad it will take too long for the Louise Fili book to get here for it to be of any help on this project.\n\n"
    },
    {
      "time": "4 Aug 2006 — 5:16am",
      "content": "You can get the Heller & Fili Deco books at Borders or Barnes & Noble asap.\n\n"
    },
    {
      "time": "4 Aug 2006 — 6:18am",
      "content": "\\>You mean something inspired on Roman baths? With Greek columns and fish tanks in it???\n\nNot so far fetched the Romans were not averse to borrowing architectural styles and whole features, and were adept at fish farming, (also murals and concrete), but I can imagine a intrepretation going wildly astray, let's hope not in this case, even the best logo can't save us from interior designers and architects:)\n\n[http://www.thermaebathspa.com/](http://web.archive.org/web/20150307184913/http:/www.thermaebathspa.com/ \"http://www.thermaebathspa.com/\")\n\nPretty unpleasant logo for this place more Greek than Roman.  \nThat Garda is lovely.  \nTim\n\n"
    },
    {
      "time": "4 Aug 2006 — 10:46am",
      "content": "\"Old italy is centuries of history, but i only need to represent the feel of what people think is old italy\"\n\nYes, you're right. Probably it makes more sense to ask local people what they perceive as old Italy than to ask an Italian, after all your audience is American. I personally take historical issues very seriously and spend a lot of time in research. I am not a heavy weight designer, not even a medium weight, but it does bother me a lot when people can't distinguish ancient Rome from Greece from 17th century from 1920s...\n\nbut back to your brainstorming (if you are still interested in my opinion!) I find art deco such a good idea (even if it probably doesn't reflect the interior design which sounds kind of heavy and, I insist, not very chic).\n\nI love the elegance and sophistication of art deco, It's not about luxury you see, it's about elegance and grace and lightness. That's chic (to me).\n\nLuxury could be anything: it could be heavy velvet stuff, rococo, golden frames and neo classic sculptures...none of these are necesserally chic. I would go with art deco (even if it wasn't really embraced very much by the Italian as far as I know, more France and Austria I think...).\n\nAlso may I ask you which sort of murals are we talking about here? And which sort of greek columns (are you sure they are Greek?), I'm just curious now, it would help to have a more accurate description of the place to understand what goes on in your boss (sick) mind (joke...).\n\nTim: you almost got me with the farm fishing argument here ; )\n\n"
    },
    {
      "time": "4 Aug 2006 — 11:27am",
      "content": "There were some Doric and Ionic columns in Rome but it makes more sense to either use arches or some of the Rococo palacio feeling from northern italy rather than the Neapolitan restaurant feeling I am getting from your description.\n\nChrisL\n\n"
    },
    {
      "time": "5 Aug 2006 — 2:05pm",
      "content": "Chris just reminded me that maybe you should stay clear from any food or beverage reference Jesse! Water is fine though, Spa meaning Salutem Per Aquam (Health Through Water in Latin).\n\nI would stick to the architectural elelements and since Chris and Tim decided to pick on me with those damned columns (creeps!) than why don't you check the order of the columns that will be placed in the spa and see if you can use the image of the columns' capital in your logo? Just an idea... I think the nicest one is the Corinthian (the one with the acanthus leaves, sorry I couldn't find a picture) which is perhaps the more ornamental therefore more appropriate for this specific spa's interior design.\n\n ![](http://web.archive.org/web/20150307184913im_/http:/typophile.com/files/image002_6526.gif)\n  \n\n ![](http://web.archive.org/web/20150307184913im_/http:/typophile.com/files/image003_6359.gif)\n\n"
    },
    {
      "time": "5 Aug 2006 — 3:23pm",
      "content": "LOL Lore! :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Aug 2006 — 4:06pm",
      "content": "Zapf created Michelangelo as a titling face for Paletino. You don't see it much anymore, but it's got a refined, calligraphic feel to it.\n\n[http://www.myfonts.com/fonts/berthold/michelangelo-bq/](http://web.archive.org/web/20150307184913/http:/www.myfonts.com/fonts/berthold/michelangelo-bq/ \"http://www.myfonts.com/fonts/berthold/michelangelo-bq/\")\n\n"
    },
    {
      "time": "6 Aug 2006 — 2:08am",
      "content": " ![](http://web.archive.org/web/20150307184913im_/http:/typophile.com/files/corinthian_4558.jpg)\n  \nLore's right (when she's not picking on me:), a Corinthian column is the most attractive and more appropriate for Romans.  \nTim \n"
    },
    {
      "time": "6 Aug 2006 — 4:58am",
      "content": "Would that be \"First Corinthians\"?\n\n:-)  \nChrisL\n\n"
    },
    {
      "time": "6 Aug 2006 — 7:54am",
      "content": "No, dez it's Romans.\n\n"
    },
    {
      "time": "6 Aug 2006 — 9:43am",
      "content": "LOL!!!\n\nChrisL\n\n"
    },
    {
      "time": "7 Aug 2006 — 5:29pm",
      "content": "ahh thanks for all the help. Im trying to work on this tonight.\n\n"
    },
    {
      "time": "8 Aug 2006 — 12:47pm",
      "content": "When I design a logo for a public place ( or a place that is going to be visited by people) I like to give a flavour of what people are going to find inside (decoration, artefacts etc.).  \nI am quite convinced that water is a good association...a detail of the Fontana di Trevi in Rome or any other water feature maybe?\n\nI saw a few beautiful Roman Amphoras (pottery) on the net and I thought it could be a nice idea. Amphoras or any terracotta pot with a nice shape...and I won't hold a grudge if you pick a Greek amphora and it'll keep Chris and Tim quite for a while!  \nI guess water amphoras is the kind of things you could find in Roman baths (I wasn't born at the time but I'm pretty sure I've seen that in Asterix!)\n\nA beautiful amphora with water coming out of it? Ok, maybe not a genius idea but with clients you never know!  \nI think shape is important...I've read somewhere (not in Asterix) that the brain aknowledges and remembers shapes first...as far as fonts are concerned I really like the Garda one too.\n\n ![](http://web.archive.org/web/20150307184913im_/http:/typophile.com/files/Igw_pot_3839.jpg)\n\nI'll be back...\n\n"
    },
    {
      "time": "9 Aug 2006 — 8:57am",
      "content": "Ahh lore that's a very good idea! Unfortunately I had to meet with the clients last night and they liked one of the logos (not the one i was hoping they'd like but what can you do?)\n\nI might try a logo with your idea just for fun though!\n\n"
    },
    {
      "time": "9 Aug 2006 — 9:48am",
      "content": "\\>(not the one i was hoping they’d like but what can you do?)  \n [Sod's Law](http://web.archive.org/web/20150307184913/http:/en.wikipedia.org/wiki/Sod%27s_law) says that this is always the way unfortunately\n\nShow us what you came up with after all the diversions this thread has taken.  \nFurther off-topic Asterix, at the time it was drawn, was drawn with an effort to be true to archaelogical knowledge of costume and architecture, for the Romans at least, I don't think anyone has dug up Obelix.  \nTim\n\n"
    },
    {
      "time": "9 Aug 2006 — 5:33pm",
      "content": "ahh see now im timid about posting the logo. For starters the client was err mistaken in asking for art deco when apparantely she confused it with art nuevo so all my art deco research was for naught. Secondly I didn't like any of the logos I made but a designer friend of mine had some ideas so he did one for me that the client chose. Only it still needs some work so I will have to get back to you with the logo :P\n\nThe one good thing is that I got to read up a lot on art Deco which is a cool period. And Louise Fili's work is awesome. Just to note, the deco books are out of print. Instead they combined all the european ones into one book, so i got that which is great. I also got just the italian one though from ecampus books. And I still need to order the one from their site just because it looks awesome.\n\nOn a side note are their any good art nuevo books that are comparable?\n\n"
    }
  ]
}
