{
  "id": "27360",
  "title": "Can't Get my Wiki up so I'll use this tent instead",
  "forum": "dezcom's blog",
  "tags": [

  ],
  "content": "Sii suggested we have a Wiki for the best and worst puns on typophile. This could be added to by anyone with a high groan factor or just copied from any olde Typophile posts. The floor is open.\n\nChris and Si\n\n",
  "author": "<a href=\"/web/20081007110727/http://typophile.com/user/3135\" title=\"View user profile.\">dezcom</a>",
  "time": "<br>",
  "uid": "3135",
  "comments": [
    {
      "time": " 1.Aug.2006 7.08am",
      "content": "Here is a beauty from Si posted recently:\n\n“\\>Depends if you count the carved letterforms on the Trajan column as the corporate face of Rome :-)\n\nGreat attention to detail. Proves that the letter carvers fiddled while Rome kerned. ;-)”\n\nChrisL\n\n"
    },
    {
      "time": " 2.Aug.2006 9.43am",
      "content": "Si strikes again. His comment on the recent merger of hotmetal giants Linotype and Monotype:\n\n“Their biggest challenge will be unifying their respective hot metal technologies - my guess is that Linotype casters will be retrofitted to cast one letter at a time - a “mono line” if you will.”\n\nChrisL\n\n"
    },
    {
      "time": " 7.Apr.2007 7.08pm",
      "content": "Here’s a groaner for ya that I just came up with:\n\n“I have designed three fonts for my girlfriend, but I can’t decide which one descender!”\n\nAnyone? Anyone? Well, the crickets sure seem to approve...\n\n"
    },
    {
      "time": " 7.Apr.2007 8.13pm",
      "content": "Va-rum-pah!  \n:-)\n\nAs long as she doesn’t do like the Elvis song and “Return De-sender” :-P\n\nChrisL\n\n"
    },
    {
      "time": " 10.Aug.2007 1.47am",
      "content": "Dear Chris Lozos\n\nThis comment has nothing to do with your blog, sorry. I just don’t know any other way to ask you this question.\n\nIn a forum, 26. May 2006 about the Kunstgewerbeschule Basel you asked: “Also, was Frank Vigliotti there then as well?”\n\nI was a friend of Frank in the late sixties and early seventies in Basel but have lost touch years ago. Are you still in touch or do you know someone who is?\n\nRegards\n\nMartin\n\n[Martin\\_Suter@mac.com](mailto:Martin_Suter@mac.com)\n\n"
    }
  ]
}
