{
  "id": "27383",
  "title": "First Typeface - Need Feedback.",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "hello folks,\n\nThis is my first attempt to the type design. It's still incomplete but I have taken a snapshot from the Illustrator just to show the idea. I need your feedback to improve on the design. Am facing problems designing few letters and thus your comments would be really helpful for me. Though at the moment am not satisfied with any of these letters.\n\nThe Idea was to combine both small and the capitals in one and thats why i've named it \"Capsmall\".\n\nThanks in advance.\n\nsatya,  \nStudent, Graphic Design  \nNational Institute of Design  \nAhmedabad, India\n\n ![](http://web.archive.org/web/20150123094154im_/http:/typophile.com/files/Capsmall_6389.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [Capsmall\\_6389\\_3810.gif](http://web.archive.org/web/20150123094154/http:/typophile.com/files/Capsmall_6389_3810_0.gif) | 127.43 KB |\n\n",
  "author": "satya",
  "time": "1 Aug 2006 — 7:21pm",
  "uid": "14032",
  "comments": [
    {
      "time": "1 Aug 2006 — 7:27pm",
      "content": "First ask yourself, would each letter be legible if it was taken out of order? Put some of the glyphs together to form words because they never act alone, always as a cohesive group.\n\n"
    },
    {
      "time": "1 Aug 2006 — 11:12pm",
      "content": "Satya, I think the letters are very fantasyful and decorating. Nice idea with combining caps and capitals.\n\nIt's a little more difficult to find a area of use for it, however, due to its decorative shapes. It feels they are more like a graphic design element than a typeface, if you know what I mean, but that is of course OK. I kind of like them. Keep going working on it.  \nGoran\n\nBtw, Say Hello to India from me, I visited your country a couple of years ago and stayed for a couple of months – and really loved it.\n\n"
    },
    {
      "time": "2 Aug 2006 — 3:26am",
      "content": "Satya -\n\nThere's something really appealing about it, very graphic. I think you should persevere.\n\nPersonally, I like the forms which 'flow' into each other, such as 'b/B', 'p/P' and even 'u/U', rather than the ones which feel like one letterform is superimposed over another, like 'r/R' or 't/T', but that's just me.\n\nadrian\n\n"
    },
    {
      "time": "2 Aug 2006 — 2:39pm",
      "content": "Thanks for the feedback and critique..will post right it here when i'll done with this.\n\n:)\n\n"
    },
    {
      "time": "4 Aug 2006 — 2:07pm",
      "content": "I cant see the image!\n\n"
    },
    {
      "time": "4 Aug 2006 — 5:43pm",
      "content": "Satya, make sure you images are RGB so everyone can see them.\n\n ![](http://web.archive.org/web/20150123094154im_/http:/typophile.com/files/Capsmall_6389_3810.gif)\n\n"
    },
    {
      "time": "4 Aug 2006 — 6:40pm",
      "content": "Yeah I'll definitely keep it in mind for the next time.  \n...thanks a lot for converting it into RGB and uploading it again  \nsatya\n\n"
    },
    {
      "time": "5 Aug 2006 — 4:16pm",
      "content": "I like the way you play with letterforms. It might not be very useful in a way typefaces can be, but it looks great. Keep up the work, I wanna see more of this..\n\n"
    },
    {
      "time": "5 Aug 2006 — 5:00pm",
      "content": "Beautiful forms Satya. How did you envision your font being used?\n\nChrisL\n\n"
    },
    {
      "time": "12 Oct 2006 — 4:36am",
      "content": "I just love your work!\n\n"
    },
    {
      "time": "12 Oct 2006 — 5:09am",
      "content": "thanks tom!!!\n\n"
    },
    {
      "time": "24 Oct 2006 — 12:37pm",
      "content": "wow. What a novel idea. Yeah, application is a question, but i have no doubts there will be application for it.\n\nI am not sure all your solutions work, but some are marvels. I love the T/t and the S/s. dont think the R/r works at all, though.\n\nbtw, I was unable to view the offsite file. Thanks Miss Tiffany.\n\ngeo.\n\n"
    },
    {
      "time": "24 Oct 2006 — 1:49pm",
      "content": "A new thought about this design: Should the N and the X be left open?\n\nYour're welcome, Geo.\n\n"
    },
    {
      "time": "24 Oct 2006 — 2:37pm",
      "content": "miss tiffany..these were incomplete...now they are closed btw.  \nI'll post the final typeface very soooon.\n\n"
    },
    {
      "time": "25 Oct 2006 — 2:09am",
      "content": "What a great idea! I like it!  \nI like first A, B, G, H, P, last Y, N and O. W, X and fist N seem like a bit different style as they have more crossing lines.\n\n\\_\\_\\_\\_\\_\\_\\_  \nAL  \n [lenart.pl](http://web.archive.org/web/20150123094154/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": "21 Dec 2006 — 4:20pm",
      "content": "So, what has become of this face, satya?  \nThey are nicely done. I'm interested in how the final product looks.\n\n"
    },
    {
      "time": "22 Dec 2006 — 5:04am",
      "content": "Thanks Jelmar,  \nI'll soon post them right here.\n\nsatya\n\n"
    }
  ]
}
