{
  "id": "27388",
  "title": "Mono & Lino Together At Last",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "The merger between Monotype and Linotype announced this morning makes me wonder how typographical history might have played out had the union occurred at several other key points over the last hundred years. It seems a very positive step to take at this point, very synergistic. I like the idea of a strong company that only does type.\n\n",
  "author": "billtroop",
  "time": "2 Aug 2006 — 5:44am",
  "uid": "4019",
  "comments": [
    {
      "time": "2 Aug 2006 — 5:52am",
      "content": "CG Triumvirate =\\> Arial =\\> Helvetica\n\n"
    },
    {
      "time": "2 Aug 2006 — 5:57am",
      "content": "[Link to the announcement.](http://web.archive.org/web/20150124161349/http:/www.monotypeimaging.com/aboutus/pr_display.aspx?year=2006&pr=292)\n\nIs this a sign of weakness or strength in the font industry? What does it mean?\n\n"
    },
    {
      "time": "2 Aug 2006 — 6:03am",
      "content": "\\*rolls thumbs, and continues to patiently wait for Linotype's FontExplorer X for Windows...\n\n"
    },
    {
      "time": "2 Aug 2006 — 6:26am",
      "content": "Weak or strength? - I dont know. But for the designers these merger is not a step forward.\n\nnoftus: Keep waiting, maybe in the next life...\n\n-- [astype.de](http://web.archive.org/web/20150124161349/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "2 Aug 2006 — 7:13am",
      "content": "Is digital type following the ATF model in metal type? I hope not - but when biggies merge this is not a sign that everything is OK.\n\n"
    },
    {
      "time": "2 Aug 2006 — 8:12am",
      "content": "Their biggest challenge will be unifying their respective hot metal technologies - my guess is that Linotype casters will be retrofitted to cast one letter at a time - a \"mono line\" if you will.\n\n"
    },
    {
      "time": "2 Aug 2006 — 8:20am",
      "content": "LOL Si!\n\n"
    },
    {
      "time": "2 Aug 2006 — 9:26am",
      "content": "_Weak or strength? - I dont know. But for the designers these merger is not a step forward._\n\nwhy not? (i'm not saying i agree or disagree. i just want to know why you say it's bad for designers.)\n\n"
    },
    {
      "time": "2 Aug 2006 — 9:42am",
      "content": "Si! You are my HERO!\n\nChrisL\n\n"
    },
    {
      "time": "2 Aug 2006 — 10:01am",
      "content": "Now watch as those royalty agreements with independent designers get smaller and smaller.\n\nJames\n\n"
    },
    {
      "time": "2 Aug 2006 — 10:22am",
      "content": "James, not sure if that will happen but there's a quote from Bob Givens in this [MacWorld UK article](http://web.archive.org/web/20150124161349/http:/www.macworld.co.uk/news/index.cfm?NewsID=15426&Page=1&pagePos=4)...\n\n\"Font people are tiny people.\"\n\nConjures up an interesting image. But there is a connection between little people and the world of type. Robert Norton's mum, Mary Norton wrote the book \"The Borrowers\" in which a family of miniature humans borrowed buttons etc., Aren't all type designers \"borrowers\" too, standing on the shoulders of giants?\n\n"
    },
    {
      "time": "2 Aug 2006 — 11:05am",
      "content": "_“Font people are tiny people.”_\n\nThat's not the only paradigm.  \nThe tail is long -- 285 foundries at Myfonts.  \nMergers & acquisitions is not the only way to acquire scale and synergy, so too is being distributed by Myfonts, Veer, Fontshop etc., -- these distributors are coming up with plenty of new retail marketing ideas.\n\n"
    },
    {
      "time": "2 Aug 2006 — 12:21pm",
      "content": "I think the merger marks the paradigm shift. For years, when the font-output machinery drove the wagon, large companies were the only ones who could put it all together. Today everything is separated. Type design and distribution (and output is in the users hands). The overhead in having a large corporation having everything in-house is a cost issue that is hard to pass on unless there is constant new development to cover it. Today's smaller and more independent groups work in consort but handle only their own overhead. Yes, type people \"are small people\" but they need very small parking places and use less fuel.\n\nChrisL\n\n"
    },
    {
      "time": "2 Aug 2006 — 12:32pm",
      "content": "Let us all pray for Akira.\n\nToo bad it's been so long since ITC / MT published much of interest. No offense, but when little outfits like P22 can put out a dozen beautiful and well produced faces in six months and Monotype has, in 2006 so far, not a lot of note besides a Michael Harvey revival (which is quite nice) and an overdue Galliard pro (and, what - Julietrose? Morris Freestyle? :/) - well, I'm thinking this continued amalgamation is anything but a good thing.\n\nIt seems that the ITC and Monotype websites get worse and are less frequently updated the larger the company gets.\n\nWhat does Mr. Haley have to say about it?\n\nAnd a related question: what exactly is the relation of Bayer to Compugraphic, Monotype & Linotype? I see they own most of the CG faces, and my Linotype-Hell scanner and imagesetter came in Bayer-branded boxes, and I thought they owned at least part of LH, but ... I'm not sure.\n\n"
    },
    {
      "time": "2 Aug 2006 — 12:44pm",
      "content": "I wonder if Monotype refunded the ITC sellout that M. Batty sold to Linotype with no regard to the agreement ITC had with its designers.\n\n"
    },
    {
      "time": "2 Aug 2006 — 1:43pm",
      "content": "\\>what exactly is the relation of Bayer to Compugraphic, Monotype & Linotype?\n\nThere's a timeline here...  \n [http://www.monotypeimaging.com/MK/Linotype/History.aspx](http://web.archive.org/web/20150124161349/http:/www.monotypeimaging.com/MK/Linotype/History.aspx \"http://www.monotypeimaging.com/MK/Linotype/History.aspx\")\n\n\\>Too bad it’s been so long since ITC / MT published much of interest.\n\nTo their credit over the past few years they've been OpenType Pro'ing a lot of gems from the Monotype and ITC library. Also seem to have been signing up a lot of smaller foundries on fonts.com\n\n"
    },
    {
      "time": "2 Aug 2006 — 1:44pm",
      "content": "I am a little concerned about the way Bob Givens's quote has been taken out of context. In full, he said,\n\n“We need to be a strong company to deliver products to the likes of Adobe and Microsoft. Font people are tiny people. We are tiny businesses in comparison to these big companies. We will be much stronger together than we are alone”.\n\nSi of course meant the extract humorously, but it's getting a life of its own, and the fact is that there is nothing exceptionable in what Bob Givens actually said.\n\nI also don't see why this should be bad for designers. During the press call, Steinert and Givens went out of their way to mention their commitment to the actual font designer, and they really didn't have to. The issue, in the end, is never what your royalty percentage is. The issue is how many copies the foundry can sell. Combined marketing + combined and better targeted advertising probably = more sales.\n\nMore compellingly, I think this stronger entity can better deal with font format problems, inconsistencies and new technologies, such as OT, Multiple Master (which I have persuasively heard - not for attribution - is due for a revival 'sometime'), etc. etc. In the past few years, the important decisions have been made exclusively by Adobe and Microsoft, and the results have not altogether been happy. I believe the combined Linotype Monotype entity will be able to change that paradigm and I couldn't be happier. Of course any merger can fail to work out well, or can fail to work out well in some particular area if not in others. But why expect the worst when there are so many potentially positive elements here?\n\nI must say, too, that I know very well Bruno Steinert's passionate commitment to the font industry in general and to Linotype and its legacy in particular, and if there is anything I can be certain of, it is that he has made the best choice for Linotype. This experienced strategist knows very well that you sometimes have to make a daring sacrifice in order to gain a great and lasting success.\n\n"
    },
    {
      "time": "2 Aug 2006 — 1:55pm",
      "content": "Thanks Sii. So Agfa is a division of Bayer, and Bayer seemed to already own some of Hell when it was combined with Linotype; so this new purchase really seems like Agfa simply condensing its varied holdings - is that right?\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20150124161349/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": "2 Aug 2006 — 1:58pm",
      "content": "_i just want to know why you say it’s bad for designers_\n\nWell, I have found Agfa-Monotype-whatever to be--how shall I say it?--a little less than honest in their dealings with me...\n\n"
    },
    {
      "time": "2 Aug 2006 — 2:04pm",
      "content": "\\>Agfa simply condensing its varied holdings - is that right?\n\nNo Agfa sold \"Agfa Monotype\" to the TA investment group and the name changed to \"Monotype Imaging\". Monotype Imaging is wholly owned by TA.\n\nAlso I find myself in agreement with most of Bill's comments. Out of context Bob's quote is humorous, but in context it's definitely on the mark.\n\n"
    },
    {
      "time": "2 Aug 2006 — 2:07pm",
      "content": "Ah - I understand. I see that now in the timeline. Thanks.\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20150124161349/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": "2 Aug 2006 — 4:25pm",
      "content": "I should also mention that Fonts.com and Faces (which are part of Monotype Imaging and therfeore of the new merged company) also distribute a lot of small foundries, and do alright for them.\n\nI don't think that's likely to change, as one of the advantages of being a large font distributor is that you have a lot of product on the shelf, with new product frequently, and search engines driving people to your site all the time.\n\n"
    },
    {
      "time": "3 Aug 2006 — 1:21am",
      "content": "_Combined marketing + combined and better targeted advertising probably = more sales._\n\nBill, have you seen the marketing attempts from these two companies of late? 1 lame + 1 lame ≠ 2 good. They could learn a few lessons from MyFonts and Veer.\n\nPoking aside, I'm hopeful that the retail arms of both companies will grow stronger from this. Monotype could gain from Linotype's content-rich and semi-navigable site. (Will we see a useful fonts.com? A larger FontExplorer X store?) And Linotype could get the resources it needs to churn out more than one retail family a year. (Akira could use some backup. Send in your resume, Bill!)\n\n"
    },
    {
      "time": "3 Aug 2006 — 4:00am",
      "content": "I can't say I'm surprised by this merge. The bigger gets bigger and the \"Indies\" keep on fighting! I can't really tell if it's for better or for worse. I've never been a fan of either of them. I respect them for sure, but I've always preferred the close contact you get with the smaller foundries. They become \"part of the family\"... that would hardly happen as part of the \"Giants\".\n\nFrom a marketing point I think you might even have an advantage being small. As mentioned already the smaller foundries keep working harder and connect easier with the trendier designer. From my own experience things travel VERY fast over the Internet if you're able to get the right connections. The awareness of MAC Rhino Fonts have increased a lot with a very limited marketing budget.\n\nNow let's hope this merge will have a good outcome for the whole type industry. I think we need both big and small players on this arena.\n\n"
    },
    {
      "time": "3 Aug 2006 — 4:41am",
      "content": "\"I think we need both big and small players on this arena.\"  \nI don't think you have to worry about that, do you?\n\n\"I wonder if Monotype refunded the ITC sellout...\"  \nI don't think you have to worry about that, do you?\n\n\"Today everything is separated.\"  \nI don't think you have to worry about that, do you?\n\nI think, as with any merger, you have to watch for a while, I mean don't all mergers have \"synergy\". It's a lot like all the advanced buzz about a game, sports-wise, that's meaningless bla--bla-- until \"the game\" is actually played.\n\n\"“Font people are tiny people.”  \n... .. ..... .. . ............ . ..? .... ... ............. . ... .. .. ........  \n. . ... ..... . ......! ....... .. . . .......... ..... ......... . ....... .....,  \n.... .......... .. ..... . ...... ........... — ....... .. ......... ....!?\n\n"
    },
    {
      "time": "3 Aug 2006 — 1:11pm",
      "content": "In general terms, the purchase of Linotype seems to be simply part of Monotype's acquisition policy of several years standing, beginning with ITC. But I agree with Nick that synergy in the font business doesn't necessarily reside in conglomeration of big foundries into one very big foundry, and that most of the creative development, especially in the retail font market, has been taking place outside of big foundries. Linotype realised this years ago, and got rid of most of their internal design staff, eventually settling for one creative director (Akira) working with individual designers outside the company, and this is a model that has worked very well for them.\n\nBob Givens' is quoted as saying: _“We need to be a strong company to deliver products to the likes of Adobe and Microsoft. Font people are tiny people. We are tiny businesses in comparison to these big companies. We will be much stronger together than we are alone”._\n\nAs a very small foundry that delivers to both Adobe and Microsoft, I have to say that I disagree. What has been ably demonstrated in the past few years is that small foundries and independent designers can compete with the large companies for OEM contracts as well as they can compete in the retail font market, especially when what is desired by the client are new designs. The primary material advantage of the older and larger foundries is in what Peter Lofting at Apple calls 'the shoebox', i.e. the store of historical types which they can endlessly repurpose for new formats. Monotype's shoebox just got a whole lot bigger.\n\nThe secondary material advantage was technical savvy, which Monotype in particular has tried hard to maintain. But open access to decent manufacturing and QA tools has largely eradicated that advantage. It is interesting to note, in reference to Bob Givens' choice of Adobe and Microsoft as examples, that these two companies have been at the forefront of making font development tools freely available and, hence, of enabling small foundries and individual designers to compete in technical quality with larger companies. Since Adobe and Microsoft clearly have an interest in enabling such competition and in not becoming tied to a monopolistic megafoundry, I question the logic behind Bob's statement. Does making a company bigger really make it more attractive to clients who have demonstrated a desire to enable smaller companies to compete?\n\nOccupying the middle ground, between the megafoundry and the boutique foundry, are the ex-Monotype folk at Ascender Corp., who have probably been the most aggressive OEM-based type business for the past couple of years. For the time being, that is probably where Monotype sees its biggest competition in its most important market. Perhaps this is the context in which the acquisition of Linotype should be seen.\n\n"
    },
    {
      "time": "3 Aug 2006 — 2:16pm",
      "content": "I don't know what kind of a deal you got with Microsoft for ClearType, John, but I recall your lamenting the comparatively higher fees commanded by lawyers. Do you think you could have cut a better deal if you were the CEO of a large company? I expect so -- purchaser corporations like to match bodies, hierarchically speaking, with their suppliers, and if your company is flat, that's not possible. Neither Microsoft or Adobe mention type on their home page. Adobe leads with \"Solutions\". So I think Mr Givens talk of \"delivering product\" is a smokescreen -- the new company will be named \"Font Solutions\" :-)\n\n"
    },
    {
      "time": "3 Aug 2006 — 4:43pm",
      "content": "\\> Is this a sign of weakness or strength in the font industry? What does it mean?\n\nif they want to share the last-quarter profits -- we'll know. one of them is/was zombie , and see the quote: we need to be a strong comapny....\n\n\\> Bob Givens’s quote has been taken out of context. In full, he said,\n\n“We need to be a strong company to deliver products to the likes of Adobe and Microsoft. Font people are tiny people. We are tiny businesses in comparison to these big companies. We will be much stronger together than we are alone”.\n\nAdobe isn't just -- strong company; MS isn't just -- strong company, but company with strong vision.\n\n\\> What does it mean?\n\nThe Indies.... doing the job.\n\n"
    },
    {
      "time": "4 Aug 2006 — 8:24am",
      "content": "\"As a very small foundry that delivers to both Adobe and Microsoft,[] I disagree. What has been ably demonstrated [] is that small foundries and independent designers can compete with the large companies for OEM contracts as well as they can compete in the retail font market,\"\n\nSay what? Because MS and Adobe have significant internal staffs of type folk, small foundries can compete when delivering \"whatever\" and leaving the rest to the internal folk and/or their contractors. There are other models. :-\n\nCompetition in the OEM market, and in the retail market, are completely different until the retail market can contain fonts as transparently installed to networked users as the bundled MS fonts. Then, you'll see lots of founders of all sizes who can \"do it all\" not as a \"middle ground\", but as the ground that it should be, up ahead. On the other side, I have no idea what Tiro's volume is, but I know the FB's volume in retail fonts is way below the Big Sites and none of us, not even FS actually compete with those big retail sites, unless we're on them ;)\n\nThe tools published by MS and Adobe, (and Apple once), were to aid in the competition of formats, not to make competition among their suppliers. Competition among their suppliers was ensured by the release of Fontographer.:-\n\n\"purchaser corporations like to match bodies, hierarchically speaking\"  \nGeeze. That's not true Nick... :-\n\n\" Neither Microsoft or Adobe mention type on their home page. \"  \nand? They have type on the home page, that's a good thing. When they talk about it, that is generally a bad thing.\n\n"
    },
    {
      "time": "4 Aug 2006 — 8:49am",
      "content": "\\>The tools published by MS and Adobe, (and Apple once), were to aid in the competition of formats, not to make competition among their suppliers.\n\nI don't think this contradicts David's claim but in way of clarification. The reason that internally-produced tools like VTT, VOLT and Font Validator were released free of charge to anyone making fonts was to improve the technical quality of fonts being used on the Windows platform. The fact that these same fonts could be used on Macs, Linux, and other platforms was not a major concern. Likewise the fact that these tools might level the playing field is not a bad thing for companies like Monotype or Linotype, as it increases the available expertise of people they can hire or partner with.\n\nI realize that I'm talking about type and I apologise if that is considered a bad thing.\n\n"
    },
    {
      "time": "4 Aug 2006 — 8:57am",
      "content": "Not to change the subject, but I've noticed that all the [press](http://web.archive.org/web/20150124161349/http:/www.microsoft.com/typography/links/news.aspx?NID=5611) generated by this announcement has been published on the other side of the pond - wonder why the story isn't of interest over here?\n\n"
    },
    {
      "time": "4 Aug 2006 — 9:02am",
      "content": "Allan Haley, who cannot seem to login, asked that I post the following:\n\n\"The acquisition of Linotype by Monotype Imaging was, indeed, momentous. Linotype could, however, have been acquired by a much larger company – a company that could have commoditized its wonderful typeface library. Monotype Imaging will never do that. As Bob Givens, the president and CEO of Monotype Imaging, said in several interviews, there will be no changes to Linotype’s culture, structure, or personnel. Bob is good to his word.\n\nI am sure, however, that there are still many questions regarding the acquisition. I would be happy to try to answer any and all of them. Please feel free to write me at , include your phone number and I will call or write to you. I will also be at TypeCon next week and welcome the opportunity to talk to you about the acquisition and what it may mean to you or your business.\n\nBob Givens, Bruno Steinert and Akira Kobayashi will also be at TypeCon. I’m sure that they would also be happy to talk to you about the merging of Monotype Imaging and Linotype.\"\n\nAllan\n\n"
    },
    {
      "time": "4 Aug 2006 — 9:05am",
      "content": "Why wasn't Monotype bought by Linotype?\n\nThe Heidelberger Druckmaschinen AG (\"Heideldruck\") is the world's largest prepress and printing maschine company with 3.5 billion Euro annual sales and 18,000 employees in the current fiscal year 2005/2006. Why should Heideldruck as the biggest company in this industry want to sell its small font department Linotype to Monotype? Why didn't Heideldruck buy the small Monotype outfit (although Heideldruck would have enough financial means to buy all font companies worldwide) ?\n\n10 years ago, the former Linotype had debts to the amount of 300 million Deutschmark. Heideldruck's CEO Hartmut Mehdorn waited like a vulture until Linotype was on the brink of bankruptcy, and then he bought Linotype for the symbolic purchasing price of one Dollar and transformed Linotype into a font department of Heideldruck. See the extract from a report made by Joachim Peters at that time attached below in German language.\n\nIt is my guess that now, 10 years after, Linotype was again on the brink of bankruptcy, and Heideldruck decided that the font business is not lucrative enough and got rid of Linotype by selling it to Monotype, presumably again for the symbolic price of one Dollar.\n\n-----------------------------------------------------------------\n\nWie Heidelberg Linotype-Hell für einen Dollar bekam  \n(How Heideldruck bought Linotype for one Dollar)\n\n(Extract from a German article by Joachim Peters, 06/1997)\n\nAls im Oktober 1995 Hartmut Mehdorn den Vorstandsvorsitz bei Heidelberg übernahm, befand sich die Linotype-Aktie schon im freien Fall. Für Heidelberg hat Mehdorn eine Einkaufsliste aufgestellt. Hinter Linotype-Hell stand darauf ein senkrechtes Kreuz: Abwarten, bis der Patient stirbt.\n\nDie Nachricht moribundus kam telephonisch um Pfingsten 1996. Mehdorn hörte den Bittsteller Dr. Königs an und gab Order zu kaufen. Die Abwicklung erfolgte streng nach der Etikette der Großfinanz.\n\nDer Bankier Dietrich-Kurt Frowein trat nach einem Jahrzehnt Amtszeit als Aufsichtsratsvorsitzender von Linotype-Hell zurück. Zugleich besann er sich auf zwei weitere Funktionen: Vorstandsmitglied der Commerzbank und Aufsichtsratsmitglied von Heidelberg. Die Commerzbank hielt über ihre Vermögensverwaltungsgesellschaft Frega rund 17 Prozent der Aktien von Linotype-Hell, weitere 33 Prozent lagen bei Siemens.\n\nHeidelberg war bereit, Linotype-Hell zu übernehmen, wenn die Commerzbank 75 Prozent der Aktien im Paket anbietet. Siemens nickte. Es galt also noch, von den freien Aktionären ein Viertel des Stammkapitals einzusammeln. Zeit- und zielgerecht taumelte der Kurs noch einmal steil nach unten und erreichte den Tiefpunkt von 60 Mark pro Aktie. Die Commerzbank machte ein Übernahmeangebot zum Kurs von 95 Mark. 8000 freie Aktionäre stießen ihre Depots ab.\n\nHeidelberg bekam das Gesamtpaket von 79 Prozent der Aktien rechnerisch für maximal 180 Millionen Mark. Praktisch war es der berühmte Kauf für einen Dollar. Linotype-Hell bringt 300 Millionen Verlustvortrag mit, der Heidelbergs Steuerlast etwa in Höhe des Kaufpreises mindert.\n\n"
    },
    {
      "time": "4 Aug 2006 — 9:13am",
      "content": "\\>Why should Heideldruck as the biggest company in this industry want to sell its small font department Linotype to Monotype? Why didn’t Heideldruck buy the small Monotype outfit (although Heideldruck would have enough financial means to buy all font companies worldwide) ?\n\nIf you want to play the numbers game you should consider that  \n [TA](http://web.archive.org/web/20150124161349/http:/www.ta.com/), Monotype Imaging's owner has $10 billion of capital - so they could likely swallow up the entire Heidel-outfit and half of Belgium if they really wanted to.\n\nCheers, Si\n\nPS. small e in euro please - you wouldn't want to get in trouble with the EU authorities. ;-)\n\n"
    },
    {
      "time": "4 Aug 2006 — 11:30am",
      "content": "_purchaser corporations like to match bodies, hierarchically speaking”  \nGeeze. That’s not true Nick… :-_\n\nWell I suppose you're right in that the CEO of Microsoft doesn't have too many meetings with the CEOs of companies which supply him with typographic solutions, but that's my point.\n\nBody, or job matching: the marketing manager of a corporate client deals with the CEO of a creative supplier; the product manager deals with the account executive.\n\n"
    },
    {
      "time": "4 Aug 2006 — 3:25pm",
      "content": "_I don’t know what kind of a deal you got with Microsoft for ClearType, John, but I recall your lamenting the comparatively higher fees commanded by lawyers. Do you think you could have cut a better deal if you were the CEO of a large company?_\n\nI'm very happy with the fee I received for the CT font work. My comment about lawyer fees wasn't a lament, merely an ironic comment on what MS pay for global trademark searches on typeface names.\n\nI don't know how much Monotype charged for the Cambria development, so I don't know if it was significantly different from what the independent designers charged. But I'm pretty sure that what the Monotype designers got paid in salary from Monotype was less than the independent designers received as design fees. From the type designers' perspective, that is what matters. If independent designers can be competetive in pricing and quality with large foundries and still make more money than their colleagues who work for e.g. Monotype, that is obviously the better situation for type designers to be in. Some people, I suppose, like the regularity of a pay cheque and don't want to have to go looking for work, but it doesn't appeal to me.\n\n"
    },
    {
      "time": "4 Aug 2006 — 3:34pm",
      "content": "David: _Because MS and Adobe have significant internal staffs of type folk, small foundries can compete when delivering “whatever” and leaving the rest to the internal folk and/or their contractors._\n\nMicrosoft's quality requirements have become much higher in recent years. They don't like having to do much work on fonts; hence the free distribution of Font Validator and other tools to improve QA.\n\nTiro has been responsible for basically all manufacturing on every font I have delivered to Microsoft and Adobe in the past four years. Even if they do find bugs in testing, they get us to fix them and provide new sources, rather than touching the fonts themselves.\n\n"
    },
    {
      "time": "5 Aug 2006 — 8:42pm",
      "content": "There's a name for this syndrome:\n\nINFECTIOUS MONO\n\n:-)\n\n"
    },
    {
      "time": "5 Aug 2006 — 10:41pm",
      "content": " ![](http://web.archive.org/web/20150124161349im_/http:/typophile.com/files/MyOIdAssScanner_3505.jpg)\n\nWith the merger complete, do you think there's any chance they'll buy back my overpriced old-assed mere 1200ppi SCSI scanner?\n\n"
    },
    {
      "time": "6 Aug 2006 — 4:05am",
      "content": "\"Tiro has been responsible for basically all manufacturing on every font I have delivered to Microsoft and Adobe in the past four years\"\n\nThat may be true, John. Unfortunately the point was not responsibility, but completeness. And the fact is, though this is from the point of view of someone looking from the outside, (and at a seven-year development with no documentation ;), you did not, could not, and probably still cannot do it ALL (make CT products, e.g.) internally.\n\nI'll throw in Apple 'cause you brought them up, they have old tired shoes and MS has custom shoes for \"feet\" that have not yet existed, could not have developed \"naturally\" and are not likley to last long, they are so \"big\". The requirements of these kind of fonts for the future is not clear, though I had a long conversation with MS about it. But smaller foundries are never going to be able to make much less distribute these fonts succesfully.\n\nif that is even important to the commonwealth :) Do you think it is?\n\n"
    },
    {
      "time": "6 Aug 2006 — 11:15am",
      "content": "_FB’s volume in retail fonts is way below the Big Sites and none of us, not even FS actually compete with those big retail sites, unless we’re on them_\n\nBut FB has chosen not to compete -- its web site positions the company primarily as a supplier of fonts for periodicals to the trade, not Helvetica and scripts for the masses. Although scale it out a bit and change the g, and Bureau Grotesque could become Bureau Helvetica :-)\n\nIn theory, a reciprocal distributor-foundry arrangement may be possible, where FB could distribute, say, the fonts that Veer distributes, but that would get messy as FB would end up selling Shinntype fonts et al. And all those extra fonts would dilute its market position, if not actually compete with its own product. Another marketing option would be a \"distributed retail co-op\", where several foundries sell each others fonts as well as their own. That's something I'd like to do, if I ever get it together to add e-commerce to my site.\n\nThe big sites depend on representing a lot of foundries, fairly indiscriminately, to bottom trawl the end of the long tail, and in order to keep a constant stream of fresh product enlivening their sites, which no foundry can do at the same rate, although FB and House keep up a fair clip. FSI and Linotype maintain production rate by actively courting freelance designers. FB and Emigre publish both in-house and freelance designs.\n\n_But smaller foundries are never going to be able to make much less distribute these fonts succesfully._\n\nIt would be nice to think that the Internet levels the field, but the traditional retail distinctions of manufacturers, wholesalers, retailers, factory direct, and distributor house brands still apply, along with the conflicts they produce. Then mix in custom work done by individuals who work for or own one or more of those categories, or freelancers, and it gets messy. Nothing to do with technological capabilities.\n\n"
    },
    {
      "time": "7 Aug 2006 — 2:37pm",
      "content": "Nick, what you are leaving out of your equation is the fact that resellers have found, again and again, that they must represent the maximum number of foundries for the simple reason that a substantial portion of their purchasers will have a purchase order that can only be spent in one place. So a corporate designer out on his let's say twice yearly shopping spree can't spend a little here and a little there, but must find the reseller who has the greatest number of his choices.\n\n"
    },
    {
      "time": "8 Aug 2006 — 5:27am",
      "content": "\"But FB has chosen not to compete — \"\n\nNot exactly Nick. We've chosen to compete where our added services are often required, and we've chosen to license where added services are not often required. I think this is because we try hard to make sense.\n\n"
    },
    {
      "time": "8 Aug 2006 — 5:34am",
      "content": "\"...a substantial portion of their purchasers will have a purchase order that can only be spent in one place.\"\n\nAnd if that ONE place is MyFonts?\n\nChrisL\n\n"
    },
    {
      "time": "8 Aug 2006 — 5:39am",
      "content": "Myfonts.com sells fonts from most of the foundries, even the huge ones. If one stop shopping is the market driver, MyFonts is the \"Big Box Store\" of type--Instead of being a Walmart, it is more like a coop though.\n\nChrisL\n\n"
    },
    {
      "time": "10 Aug 2006 — 5:15am",
      "content": "I don't know what the figures are, but myfonts.com seems to have all of the mindshare and most of the marketshare. I would imagine that one hope in the Lino/Mono alliance is to be able to compete better online, but myfonts.com already seems to be to fonts what Google is to search engines.\n\nHowever, it is always incredibly unlikely that real font income will primarily come from retail sales, and it is worth noting that Lino/Mono were much more interested in talking about fonts and mobile phones last week, than fonts and traditional printing.\n\nMoving down the feeding chain, for a company like Font Bureau, retail sales have always been a minor focus. The major focus has been on identifying the few customers still willing to pay handsomely for very high quality fonts, and delivering a product that actually works for its intended use.\n\nIt's a much more difficult world for smaller foundries, which don't have the technical expertise to attract that calibre of customer. Smaller foundries are much more like to have to rely on impulse purchases, most likely of novelty, decorative fonts that don't require the expert construction of a successful newspaper or book font.\n\nIt's amazing how many things can go wrong with a text font. I was just looking at a luxurious catalogue set in Scala Serif, a font I've always thought highly of, and I noticed that the sidebearings of the left and right single quotes were disturbingly out of balance. I wondered if this was a problem with the font? With one of the many versions of the font? With a pirated version? Was the designer of the text using some special kerning that put the quote marks out of balance? Who knows! At least with Font Bureau fonts, you never have to worry that things like that will go wrong. The basic problem, of course, isn't the font, but the person who is using it. If people setting type today don't know, and don't care that quotation marks look correctly balanced, what's the point?\n\n"
    },
    {
      "time": "10 Aug 2006 — 8:29am",
      "content": "_“I don’t know what the figures are, but myfonts.com seems to have all of the mindshare and most of the marketshare.”_\n\nI only know what our numbers are (shhh... it's a secret...) and the relative size of the marketplace. Based on that, I am comfortable in saying that MyFonts.com does not have _“all of the mindshare and most of the marketshare”_. Yes, they are a prime mover in the marketplace, but so are Veer and FontShop. I would argue that the majority of creative consumers purchase products from sources they like - more often than sources that simply have more to choose from. Selection and price are strong persuaders, but so are ease of use, site functionality, customer service, alternative product categories, voice and attitude, quality of marketing materials, affective use dead-tree media, etc. All of the above companies share many of these qualities, but they also differ drastically in how they implement them.\n\n"
    },
    {
      "time": "11 Aug 2006 — 8:25am",
      "content": "I dunno Grant, why not give us some numbers?\n\nThe funniest thing about the font industry is how close everybody is with their numbers. I can't see that these numbers are of any particular value to their competition anyway. But everyone seems to think so. So let me put a couple of more general questions to you, Grant.\n\n1. Suppose that we all had an idea of what myfont.com's marketshare was. How could this knowledge possibly harm myfont.com and how could it possible help its competitors?\n\n2. Same thing with your numbers. Suppose we knew you sold 38,000 units netting $x per month on average for the first quarter this year, x % from catalogue, x % from the web. To what extent is this knowledge really going to hurt you or help your competitors?\n\nIt sometimes seems that the font biz is the only biz in the world where people are afraid to come out with this info, and I have the theory that this might actually be harmful rather than helpful. One reason being that you can't really do any substantive economic forecasting about an industry if you don't have adequate factual information.\n\nTo what extent does this truly tiny industry benefit from secrecy?\n\nHey, if someone can establish that this probably somewhat holey veil of secrecy is actually beneficial for the industry, I'm all for it. Anything that helps the font industry is a good thing. But what if this secrecy is a self-defeating mechanism? Is that possible?\n\n"
    },
    {
      "time": "11 Aug 2006 — 9:47am",
      "content": "David:\n\n_Unfortunately the point was not responsibility, but completeness. And the fact is, though this is from the point of view of someone looking from the outside, (and at a seven-year development with no documentation ;), you did not, could not, and probably still cannot do it ALL (make CT products, e.g.) internally._\n\nSorry, but you're wrong on that one. MS gave us the tools, we made the fonts.\n\nIronically, considering Bob Given's comment that 'We need to be a strong company to deliver products to the likes of Adobe and Microsoft', one of the things I needed to do in mastering the CT fonts was to rebuild the Cambria OTL tables from VOLT because Monotype's own tools had generated GSUB table errors.\n\n_The requirements of these kind of fonts for the future is not clear..._\n\nThis is true, although I'm not sure in which sense you mean. It is true in both senses:\n\nThe requirement to have this kind of font in the future is not clear (the same point that Matthew made to MS when they asked him to design Verdana and Georgia: a font optimised for a particular technology will be obsolete before too many years).\n\nAnd the obverse of this coin:\n\nThe requirements of a font optimised for CT in the future is not clear, because CT itself is a moving target.\n\n_But smaller foundries are never going to be able to make much less distribute these fonts succesfully._\n\nWho said anything about distributing? Bob Givens made a comment about _delivering to Microsoft,_ suggesting that a company needs to be big and strong in order to deliver products to Microsoft. I made the observation, based on experience, that this is not the case. When Microsoft goes shopping for multiple font families to bundle with products, obviously a company like Monotype with a large library has an advantage. When Microsoft goes shopping for new, custom designs, small foundries and independent designers have a creative advantage, which they can leverage if they organise themselves in ways that maximise their ability to deliver. The CT font project was an interesting case because Monotype was the one corporate participant alongside a group of independent designers. Hinting was split between Monotype (Cambria, Candara, Meiryo), Tiro (Constantia, Corbel) and LucasFonts (Calibri, Consolas), and Tiro was responsible for final mastering of all the western fonts, including the Monotype submission. [Tiro was subsequently given the job of taking Cambria and making a math font out of it.]\n\nIn conclusion, there are many good reasons why a company like Monotype buys a company like Linotype. But you don't need to buy Linotype in order to be able to deliver fonts to Microsoft. That's just silly pressreleasesprache.\n\n"
    },
    {
      "time": "12 Aug 2006 — 3:31am",
      "content": "Monoype finally gets the US registration back for Times Roman!  \nEven funnier though, is, well a knockoff, like Palladin (Compugraphic), will it be discontinued because they got the real thing? What about Arial? Monotype now owns the font that they knocked off for MS, boy, fonts are a mess! CG pushed Lino way back when and it was good for the font business overall.  \nBusiness wise Heidelberg has been divesting itself from non core operations. Notice barely any prepress on their website (I think Screen actually builds the Platesetters for them). No scanners of any sort, they got rid of all the digital printing (toner based) and then all the Direct Imaging (DI) presses and they got rid of their web presses too.  \nI was way ahead on this merger, having had a Compugraphic front end and a Linotronic 202! Oh yeah, they blamed each other when things went wrong!  \nLibrary wise it makes a lot of sense and Monotype Imaging has a virtual stranglehold on the classic font libraries. Uhm can some one cough up Berthold?  \nIf you have been around fonts long enough, you must admit that Bitstream won, becuase Linotype was the last big player from the font middle ages where typesetting machines and fonts were tied together. Personally, if I were Monotype systems, I would put all the fonts into one library and sell them as unified, assimilation is the way to go.\n\nRodi\n\nThe Truth shall set you free\n\n"
    }
  ]
}
