{
  "id": "27393",
  "title": "Web Type",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m about to create a weblog and thought I’d get some advice on type. I’m looking to ignore the 800 x 600 and going for a bigger 1024 x 768 design. This means more space - more type options.\n\nAnyone got any suggestions for web type or websites where type is good and well used? Type on the web can be pretty difficult I’ve read. Would appreciate any input for either weblog or type design. Thanks.\n\n",
  "author": "<a href=\"user/5453\" title=\"View user profile.\">stupid_child</a>",
  "time": "<br>",
  "uid": "5453",
  "comments": [
    {
      "time": " 2 August, 2006 - 8:13am",
      "content": "If you’re working with CSS, then you should take advantage of the linespacing, size, and tracking options and go for typefaces that are common on most machines which are Arial, Times New Roman, Georgia, and Verdana. My advice is to avoid the first two fonts ;)\n\nIf you’re using images as text spaces, then look into “screen fonts” or “pixel fonts.”\n\n"
    },
    {
      "time": " 2 August, 2006 - 11:24am",
      "content": "Other suggestions would be:\n\nTrebuchet  \nTahoma\n\n"
    },
    {
      "time": " 2 August, 2006 - 11:29am",
      "content": "The biggest difficulty is the lack of usable text faces. You got add Trebuchet, Tahoma and perhaps Lucida Sans to Cyanide’s list, though. There are also Arial Black, Impact, Courier New and… …sigh, Comic Sans.\n\n"
    },
    {
      "time": " 3 August, 2006 - 3:31am",
      "content": "Palatino Linotype is also common (Windows XP), but be sure to provide alternatives and don’t make it too small. A hint: Book Antiqua and Zapf Calligraphic are nearly identical to Palatino.\n\nWeb type is 99% about line spacing and widths of text blocks (if the contrast between background and the type color is already sorted).\n\nBe careful with Verdana, it has a much bigger x-height than other popular web fonts. If your type is set in 8px Verdana it will be less legible if a browser decides to display it in e.g. Arial. Verdana is found on both Windows PCs and Macs, so you won’t let down many of your viewers anyway. The biggest problem is Linux, but there you have “Bitstream Vera Sans” which also has a large x-height.\n\nGood use of Georgia: [Jason Santa Maria](http://web.archive.org/web/20061130175750/http:/www.jasonsantamaria.com/archive/2006/06/25/letterpress_adventure.php)\n\nGood use of Arial: [Six Apart](http://web.archive.org/web/20061130175750/http:/www.sixapart.com/about/corner/)\n\nGood use of Verdana: [Mark Simonson Studio](http://web.archive.org/web/20061130175750/http:/www.marksimonson.com/)\n\nGood use of Lucida Grande: [Mint](http://web.archive.org/web/20061130175750/http:/www.haveamint.com/faqs)\n\nGood use of Times New Roman: Can’t think of any…\n\nGood use of Palatino: [Joe Clark](http://web.archive.org/web/20061130175750/http:/blog.fawny.org/2006/06/24/failed3/)  \n(you’ll see it if you don’t have “Constantia”, “Rockwell” or “Serifa” on your machine)\n\nGood use of Comic Sans:  \nNever. Or, in some cases, 9px italic. Or not.\n\nThere are also a few new kids on the block: Cambria, Constantia, Calibri, Corbel and Candara as well as the monospaces Consolas, but don’t count too much on them just yet.\n\n"
    },
    {
      "time": " 3 August, 2006 - 3:40am",
      "content": "Century and Century Schoolbook are also common, but once again, provide alternatives.\n\n"
    },
    {
      "time": " 3 August, 2006 - 3:41am",
      "content": "Good use of Times New Roman: [Coudal Partners](http://web.archive.org/web/20061130175750/http:/www.coudal.com/)  \nTypophile uses Georgia.\n\nThose new kids on the block come with Vista, so you’ll have to wait at least a year to get to use them.\n\n"
    },
    {
      "time": " 3 August, 2006 - 3:46am",
      "content": "Yes, but how about Times in body copy?\n\n"
    },
    {
      "time": " 3 August, 2006 - 5:41am",
      "content": "Ah, you guys are super. Thanks for all the info. I’ll keep y’all posted.\n\n"
    }
  ]
}
