{
  "id": "27411",
  "title": "Calling All Designers...",
  "forum": "Design",
  "tags": [

  ],
  "content": "So ladies and gents, I'm working at a company that is pretty much just forming an in-house design department. I have a few questions that I'm hoping to find answers to.\n\n1) How much is a reasonable target price to get a design firm up and running? We have virtually NO purchased typefaces, most are system fonts.\n\n2) What are some of the best valued combined packages that contain multiple typefaces? I need the classics too (I can't live without Univers.)\n\n3) I also need some more modern typefaces to keep things fresh, any suggestions on more modern packages? (I also can't live without the Thesis Family.)\n\n4) How do I convince my company that after taking the huge hit financially in purchasing a \"classics\" package that modern typefaces also need to be part of the budget?\n\nI'm hoping a few of you might be able to point in the right direction. I know the subject of price is a touchy subject so if you'd rather not discuss it in a public forum please e-mail through the link on Typophile or at the e-mail address listed on my site. Thanks all!\n\n",
  "author": "<a href=\"/web/20100113165403/http://www.typophile.com/user/7475\" title=\"View user profile.\">biddy</a>",
  "time": "<br>",
  "uid": "7475",
  "comments": [
    {
      "time": "",
      "content": "If you get the Storm library you will get a some good versions of classics. The Walbaum is great as is the Baskerville and Jannon.\n\nAndulka and Amor Sans are also nice.\n\nThe new Vida family looks good.\n\nThen Fountain library is right there as well with some nice packages and a good price for the library, with Delacato, Baskerville 1757, Stalemate, and Montrachet/Montverdi.\n\n"
    },
    {
      "time": "",
      "content": "I would go with Fontfont. They have more choices than anyone else IMHO.\n\nScala Sans + Serif  \nAbsara Sans + Serif\n\n"
    },
    {
      "time": "",
      "content": "Wade through the chaff here for one designer's answer to your question:\n\n[http://typophile.com/node/2928](http://web.archive.org/web/20100113165403/http:/typophile.com/node/2928 \"http://typophile.com/node/2928\")\n\n"
    },
    {
      "time": "",
      "content": "FYI: Purchase of the Adobe CS2 package includes a good variety of classics.\n\nOff the top of my head, Pro versions of Caslon, Garamond, Jenson, Chaparral, Cronos, Myriad, Warnock, Minion, possibly Trajan?, etc.\n\nURL here:  \n [http://www.adobe.com/products/creativesuite/type.html](http://web.archive.org/web/20100113165403/http:/www.adobe.com/products/creativesuite/type.html \"http://www.adobe.com/products/creativesuite/type.html\")\n\n"
    },
    {
      "time": "",
      "content": "I think most versions of CorelDRAW also come with large type libraries, mostly Bitstream fonts. A few classics, and a bunch of crazy display faces you'll probably never use.\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "Jupiter Boy!\n\nThanks for mentioning Delicato and Stalemate ;-)\n\n"
    },
    {
      "time": "",
      "content": "It's nice you're considering typefaces as part of your development/establishment costs. But it does raise questions as to whether the department is ready to be established (i.e, why are such trivial questions being asked?)\n\nJust some thoughts. Design and particularly and associated department is a LOT more than a few 'classic' fonts and budgets to buy new fonts.\n\n:)\n\n----------  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20100113165403/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "",
      "content": "Paul-  \nI love your profile animation. Can you tell me where you got the animation? did you or friends of yours make it?\n\n"
    },
    {
      "time": "",
      "content": "if you're looking for some beautiful and fresh modern typefaces I would recommend checking: [http://www.underware.nl](http://web.archive.org/web/20100113165403/http:/www.underware.nl/ \"http://www.underware.nl\")\n\ngrtz,  \ndav.\n\n"
    },
    {
      "time": "",
      "content": "\\>I’m working at a company that is pretty much just forming an in-house design department.\n\nI'm surprised no one asked for an explanation to this. What type of company would decide they want to set up an \"in-house\" design department, that would need to be stocked with a wide range of typefaces?\n\nMost companies I've had experience with set up an in-house design department so that they can remove or reduce their dependency on the outside design firms they use. Either they want to do everything in house or they want to do the grunt work in-house to cut out the middle-man's markup. Either way they’d normally start with the fonts their existing design resources are using and then acquire additional fonts as the need arises. But maybe I’m missing something?\n\n"
    },
    {
      "time": "",
      "content": "_What type of company would decide they want to set up an “in-house” design department, that would need to be stocked with a wide range of typefaces?_\n\nThe company didn't decide. As a designer, its just very hard to design without having much type to choose from. We're missing many necessary fonts.\n\n"
    },
    {
      "time": "",
      "content": "Terry,  \nTell us something about the company? Products, services, target clients...\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Its political design work, advertising and also branding. Our clients run the gamut. Some small, some major corporations.\n\n"
    },
    {
      "time": "",
      "content": "American Political clients rarely stray from middle-of-the-Road American type that is not going to annoy any potential voter. This is true of both parties. There was a thread here a year or so ago here called \"What is American Type\" or something close to that. You might find some good suggestions from that thread.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Good luck with the new job.  \nBitstream's Type Oddity, sorry, Odyssey, will provide all the classics, including your fave, Zurich. For a Typophile, there's hours of fun there just relating the wacky names to the proper ones. Also included are new fonts from a variety of independent foundries (self-interest declared).  \nIt's affordable, but not the latest versions, and not OpenType.  \nHowever, it delivers the canon, and in a way that doesn't make it indispensible. So when a job cries out for a spiffy new OT typeface, you should be able to justify the expense, because there's nothing like that in the collection, and continue to add to your library in that way.\n\n"
    },
    {
      "time": "",
      "content": "Here is the thread I mentioned Terry:\n\n[http://typophile.com/node/12634](http://web.archive.org/web/20100113165403/http:/typophile.com/node/12634 \"http://typophile.com/node/12634\")\n\n\"Quintessential American Type\"\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I'd agree with Chris - avoid any of those 'crazy' european fonts like Meta and Thesis and collect as many different cuts of Franklin Gothic, Interstate and Gotham as you possibly can.\n\n"
    },
    {
      "time": "",
      "content": "Chris, yeah I participated in that thread. I think it was called All-American Type or something like that. I just don't think that Arial is acceptable to use for every ad campaign. There is plenty of good type out there that is not too in your face. Off the top of my head Griffith Gothic and Knockout are two faces with a lot of personality, that I could see being used for political ads. I don't think either one would annoy a potential voter. System fonts used in print ads annoy _this_ potential voter.\n\nNick, thanks for the suggestion. Wading through the \"Humanist\" faces is indeed an ordeal.\n\n"
    },
    {
      "time": "",
      "content": "_Here is the thread I mentioned Terry:_\n\nD'OH!\n\n"
    },
    {
      "time": "",
      "content": "Arial is not an American type. It is just a redraw of the Swiss Helvetica which is grounded in Agzidenz Grotesk--More of that European stuff Nick was talking about :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I don't feel that Humanist typefaces are appropriate for political advertising. Something with them just doesn't feel right there.\n\nThe Linotype Essentials packages will soon be available in OpenType format. Aside from that, I don't have any big scoops on deals that haven't already been mentioned. Sorry :(\n\n"
    },
    {
      "time": "",
      "content": "I know I'm being to hopeful when I think, \"I would like to think politician's and corporations understand the concept of differentiation in the marketplace.\"\n\n"
    },
    {
      "time": "",
      "content": "_Arial is not an American type._ The point wasn't about \"Arial\" but about system fonts. Sorry for the confusion.\n\n"
    },
    {
      "time": "",
      "content": "\\>Arial is not an American type.\n\nAs Arial was originally drawn for IBM and was called [Sonoran](http://web.archive.org/web/20100113165403/http:/www.desertusa.com/du_sonoran.html) Sans there is an American angle.\n\n"
    },
    {
      "time": "",
      "content": "Tiffany,  \nPoliticians and very large organizations are committee addicts and make decisions based on what is \"least objectionable\" and won't make a negative soundbite. Since the marketplace for political campaigns is perceived by them as being \"Gaff grabbers\" as opposed to ground-breakers, I don't think they fear market loss by lack of innovation.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\"As Arial was originally drawn for IBM and was called Sonoran Sans there is an American angle.\"\n\nAre you sure? I did a lot of work with Sonoran Sans and it was not width compatible to Linotype's Laserwriter Helvetica was it?\n\nMy little bit of Biddle advice is to build a library by charging the clients for fonts. In the meantime, steal what you need until you can pay. :)\n\n"
    },
    {
      "time": "",
      "content": "David, Terry is building a library for his client… I think he is talking about an in-house studio building up its software resources. All work done by the studio would be for the same client, right? So the client (the design studio) would be paying for the fonts.\n\nI guess you think that he should license fonts on a per per project basis, as is needed. This is not a bad idea, and I'm sure that he'll do that, too. He just wants to license a bulk library of good types to fall back on first, I think.\n\nWhat FontBureau fonts do you think would be good for political advertising? I'll bet that your catalog is full of Republican fonts, Democrat fonts, Independent fonts, Green fonts, and who-knows-what else fonts. The question is, which is which ;-)\n\n"
    },
    {
      "time": "",
      "content": "\\>Are you sure?\n\nThis was the info that Robin Nicholas gave me a month or two ago. He did say that this was from memory so he might have got the name wrong?\n\n\\>I did a lot of work with Sonoran Sans and it was not width compatible to Linotype’s Laserwriter Helvetica was it?\n\nCorrect, this was the original design before it was forced onto Helvetica's widths.\n\n"
    },
    {
      "time": "",
      "content": "`My little bit of Biddle advice is to build a library by charging the clients for fonts. In the meantime, steal what you need until you can pay. :)`\n\nI don't know about stealing, but paying for a font that you've decided to use after being able to experiment with it would make a lot of sense. Foundries should have a \"try & buy\" proposition -- you're free to play with their fonts, but have to pay for the ones you use in designs that you sell (or give away). Isn't there a licensing scheme along these lines out there?\n\n"
    },
    {
      "time": "",
      "content": "While I agree trying and buying would be ideal ... it's difficult enough as it is to control licencing of fonts.\n\nMuch like ... you can download music to 'try' and then you go out to buy the album cause you like it ... of COURSE you do!\n\n----------  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20100113165403/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "",
      "content": "\"I don’t know about stealing, but paying for a font that you’ve decided to use after being able to experiment with it would make a lot of sense.\"\n\nlike i said...\n\n"
    },
    {
      "time": "",
      "content": "`Much like … you can download music to ‘try’ and then you go out to buy the album cause you like it … of COURSE you do!`\n\nPaul, I agree with you that enforcing licensing policies is a nightmare, but there really isn't much a foundry can do if someone decides to download one of their multi-thousand dollar packages without paying anything. I mean, it's as simple as running a Google search with the words `font folio 10 torrent` and then using a torrent client to download the stuff.\n\nIn the end, all this discussion about licensing -- whether or not a EULA allows for the fonts to be installed on one, two, five, or more machines; whether a PS1 font can be converted into an OT font; etc -- is really a matter of trusting that some people will respect the licence. What are you going to do if someone doesn't? Ever heard of a foundry getting a warrant to check whether one of their fonts is being used on eight computers instead of the allowable five? Or to make sure that the client is not using an OpenType font they created from the PS1 font originally purchased?\n\nMy point is, in the real world foundries _have_ to trust their paying customers, because it's just so easy to obtain their fonts for free from illegal sources anyway. And if it's all a matter of trust, why not go the \"try & buy\" way?\n\n(I'm afraid we're straying further and further from the original topic, but it's my fault.)\n\n"
    },
    {
      "time": "",
      "content": "Stated policy and practice often diverge.\n\nI've had type designers give me a tryout before, and I think a brilliant idea is linking that tryout to some printed swag showing the font in use. For a few dollars (less than the font) you can get a good taste—the font designer gets to sell a printed sample rather than giving it away, and the customer gets a disc with a tryout version of the font plus printed sample.\n\n"
    },
    {
      "time": "",
      "content": "Mr Hatley obviously understands the principle of the marketing exchange. Both parties walk away with something and both parties get something for their investment. When only one side gives and the other side just takes, only the taker walks away happy.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "And how would the \"Tryout\" version of the font differ from the real font?\n\nThere are many graphic designers who have relationships with type designers, and get all their fonts on a tryout basis. The secret is establishing a relationship with the type producer. That can begin by licensing a fair amount of fonts, and just maybe you'll be put on the short list to get the tryouts. You'll have to sign some legal documents, but hey, what are a few contracts between 'friends'.\n\n"
    },
    {
      "time": "",
      "content": "Oh, and yes there are many cases of type designers (well cactually their lawyers) going after people who license their fonts fraudulently. Someone who licenses for 5 and uses on 10 maybe not. But someone licensing for 5 and using on 100 worldwide? Youbetcha..\n\n"
    },
    {
      "time": "",
      "content": "In my experience the tryout version has been a complete version, save a few alternate ligatures. It is clearly stated what the terms are though. So trust plays a big part.\n\n"
    }
  ]
}
