{
  "id": "27415",
  "title": "Has anyone used AsiaFont Studio?",
  "forum": "Build",
  "tags": [

  ],
  "content": "I have searched the site, and found few detailed information on FontLab’s two-byte font editor, AsiaFont Studio. I gather it’s a high-end version of FontLab with features that come handy for dealing with CJK font.\n\nIn the long run, I would like to create fonts with Hangul (Korean alphabet) support. However, the $1,999 price tag is rather prohibitive. Is there anyone who has used AsiaFont Studio, preferably with an Asian script, that could tell me whether it would be worth blowing my annual budget on it?\n\nI know about the ability to support something like 65,000+ glyphs at once. But just how much of an improvement is it over the method of working on several smaller files separately using FontLab or other font editors then combining them at the end? I’d appreciate any opinions from those who have used this program.\n\n [‹ Wonky hinting](http://web.archive.org/web/20080208230113/http:/www.typophile.com/node/27444 \"Go to previous forum topic\") [More FL class based Kering ›](http://web.archive.org/web/20080208230113/http:/www.typophile.com/node/27424 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080208230113/http://www.typophile.com/user/12009\" title=\"View user profile.\">Jongseong</a>",
  "time": "<br>",
  "uid": "12009",
  "comments": [
    {
      "time": " 5.Aug.2006 12.56pm",
      "content": "You can’t use FontLab or FontLab Studio to combine smaller fonts into a larger one, simply because FontLab [Studio] will not output fonts with more than 6,400 glyphs.\n\nAsiaFont Studio 4 is functionally equivalent to FontLab 4.5 plus it has support for reading CID-keyed Type 1 fonts, reading and creating TrueType collections, supporting fonts with more than 6,400 glyphs.\n\nAsiaFont Studio 5 is under development. It will be functionally equivalent to FontLab Studio 5, plus it will have some additional features such as improved Change weight and Clean up paths algorithms, CID-keyed Type 1 and OpenType import and export, support for vertical glyph metrics, support for non-BMP (5-digit) Unicode codepoints etc. We don’t have yet a precise release date or pricing information, but I’m sure there will be an upgrade path for both AsiaFont Studio 4 and FontLab Studio 5 users.\n\nRegards,  \nAdam Twardoch  \nFontlab Ltd.\n\n"
    }
  ]
}
