{
  "id": "27425",
  "title": "Apartment 32",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is a personal brand for a design company I've started with my brother. We're pretty set on the mark, but the type needs work.\n\nWe don't really have a big budget at this point, so something in the $0 to $40 range would be nice, but not required.\n\nThe .pdf contains both horizontal and vertical versions. We'll probably be using the vertical version more often, but the horizontal at small sizes.\n\nThis is the horizontal version:\n\n ![](http://web.archive.org/web/20150414215803im_/http:/typophile.com/files/apartment32logo_4311.png)\n\n- Lex\n\n| Attachment | Size |\n| --- | --- |\n| [apartment32logo.pdf](http://web.archive.org/web/20150414215803/http:/typophile.com/files/apartment32logo.pdf) | 10.77 KB |\n| [apartment32logo\\_2.pdf](http://web.archive.org/web/20150414215803/http:/typophile.com/files/apartment32logo_2.pdf) | 11.94 KB |\n\n",
  "author": "Lex Kominek",
  "time": "3 Aug 2006 — 10:54am",
  "uid": "5398",
  "comments": [
    {
      "time": "3 Aug 2006 — 11:03am",
      "content": "Thinking out loud: would an abbreviated \"Apt.\" be possible? If not, you've a long one there {if you know what I mean ;)} I'm immediately thinking of using a complimentary tall 'face such as Linotype Univers. It's out of your budget, but perhaps someone could set it for you for a reasonable fee? Then again, this might be a great opportunity, considering your budget, for a custom-designed type job! Might be a great exercise, matching a custom face to your icon. Moreover, what could you do to mesh the two (icon and typeface)? Something to consider.\n\nDylan — who is now done thinking out loud\n\n"
    },
    {
      "time": "3 Aug 2006 — 11:05am",
      "content": "We were thinking of going with Apt 32, but apt32.com was already registered, so I had to go with apartment32.com.\n\nI was thinking of doing a custom typeface - maybe i'll just have to bite the bullet and do that.\n\n- Lex\n\nP.S. I've got the Bitstream version of Univers (Zurich) which is what this is set in. I could go with a condensed weight to see how that looks.\n\n"
    },
    {
      "time": "3 Aug 2006 — 11:08am",
      "content": "I like the Univers but I am having trouble with your alignment it seems just too high on the horizontal version, I would also slightly increase the size of the numerals to cap height. The vertical version seems like the mark is crushing the type could you get away with just the numerals or maybe make the type two lines and increase both?  \nI'm sure that somebody is going to ask why the \"light\" is on the ground floor, some people can be so literal :)  \nTim  \n_Edit, seems to be my day for cross-posting_\n\n"
    },
    {
      "time": "3 Aug 2006 — 11:12am",
      "content": "I assumed there was a concept behind that light on the ground floor...guessing it was in relation to you guys...'getting in on the ground floor' or something. What's the scoop?\n\nAnd agreed about the alignment. Doesn't look intentional. Either align along the bottom or jack it up enough to look intentional and more asymmetrically balanced.\n\nDylan — who is now really curious about your light.\n\n"
    },
    {
      "time": "3 Aug 2006 — 11:17am",
      "content": "hello,\n\nlike Dylan, I am also intrigued with teh light, as dylan asks, does it have something to do with the placement of your office, if not, and it does not reflect such things as starting from the bottom etc, then maybe the light could be at the very top floor, the penthouse if you like, always associated with quality and all that jazz.\n\nJust a thought,\n\nooh I love lights\n\nMatt\n\n"
    },
    {
      "time": "3 Aug 2006 — 11:24am",
      "content": "I've added a new pdf with a few changes. The first is just the vertical logo with 32 under it. I'm not sure if this would say \"Apartment 32\" to someone unfamiliar with our business.\n\nThe second is the horizontal with the type brought closer to the mark and raised so the baseline is aligned with the top of the window instead of the bottom.\n\nThe third is the same as the second, with the baseline aligned to the bottom of the mark.\n\nAnd as for the light, you'll notice that there are 32 windows in the building. The last one - apartment 32 - has a light on.\n\n- Lex\n\n"
    },
    {
      "time": "3 Aug 2006 — 11:36am",
      "content": "What about Atrament? It's a relatively new typeface with a bit of character, and it's condensed. Price is reasonable (well, it was to me) at $165 for a decent set of weights. I set your name in the attached JPEG quickly to give you an idea of what it might look like.\n\nThe font is available at MyFonts.com if you're interested.\n\nDylan — an admitted Type Whore that buys type even if he doesn't need it\n\n ![](http://web.archive.org/web/20150414215803im_/http:/typophile.com/files/apt_32_3880.jpg)\n\n"
    },
    {
      "time": "3 Aug 2006 — 11:37am",
      "content": "Oh, and I like your thinking concerning the light. Subtle.\n\n"
    },
    {
      "time": "3 Aug 2006 — 11:43am",
      "content": "yeah, I definitely love the mark.\n\nI immediately realized that it was apt 32.. but the idea of the placement of your studio would have been a nice branding element as well...\n\nprops on the mark, you have my vote.\n\nedit\n\nAlso, I think that apartment spelled out is fine. I think the placement, and the size of the lettering is fine as well on the image you had originally posted...\n\nmy opinion.\n\n"
    },
    {
      "time": "3 Aug 2006 — 2:09pm",
      "content": "`And as for the light, you’ll notice that there are 32 windows in the building. The last one - apartment 32 - has a light on.`\n\nThe way I read this image, apartment 32 would be the 4th square on the \"top floor\" (topmost row). I see a light on in apartment 4. I also think that metaphorically positioning yourself at the top is probably a better idea.\n\n"
    },
    {
      "time": "3 Aug 2006 — 2:13pm",
      "content": "I was debating whether to put it in that position as well. We decided on the bottom right because of reading order (top down, left to right) and because we work out of our condo, which happens to be a basement suite.\n\n- Lex\n\n"
    },
    {
      "time": "3 Aug 2006 — 2:27pm",
      "content": "Also, you are on the \"ground floor\" which seems to be a good placement metaophorically and otherwise...\n\nErik has a good point though.\n\nAs for my confusing post earlier, I was trying to say I immediately realized that you had 32 windows and you were in apt 32...\n\n"
    },
    {
      "time": "3 Aug 2006 — 2:31pm",
      "content": "`I was debating whether to put it in that position as well. We decided on the bottom right because of reading order (top down, left to right) and because we work out of our condo, which happens to be a basement suite.`\n\nWell, we don't read buildings the same way we read roman script. The convention is that apartment number 1 will be on the first floor, and 10 on the tenth floor (if there's only one unit per floor). Anyway, this is not the biggest issue in my opinion. If after considering the options you decide that being on the ground floor, metaphorically speaking, is a good thing, that's what matters most.\n\n"
    },
    {
      "time": "3 Aug 2006 — 2:46pm",
      "content": "Another common convention would have apartment 32 be the second apartment on the third floor.\n\n"
    },
    {
      "time": "3 Aug 2006 — 3:16pm",
      "content": "`Another common convention would have apartment 32 be the second apartment on the third floor.`\n\nTrue. In any case, it´s unlikely that 32 would be on the first floor.\n\n"
    },
    {
      "time": "4 Aug 2006 — 12:31am",
      "content": "When I first saw it I was confused because I thought the light was on in apt. 4 as well (apt. 32 being the top rightmost room), So i changed the logo to put the light where apt. 32 seemed like it should be, and it didnt seem to do good things graphically. I'd suggest you keep the light on the bottom. It seems like metaphorically it works either way, and your office is on the bottom. Plus, having the light on the bottom makes it easy to notice (2nd window, 3rd floor is really confusing to look for), and grounds the whole logo. If you put it in the far upper right it makes the building look like its going to tip over. (to me at least).\n\n"
    },
    {
      "time": "4 Aug 2006 — 4:14am",
      "content": "hey lex..\n\ngenerally you've got a nice mark there but i agree that the font shouldn't be the ultimate solution.  \nI also agree that logically apartment 32 should be rather on the top floor than on the ground floor but i understand your justification due to the general reading habit..\n\nhave you considered making the other windows rather grey than white? it would symbolise that everbody's already gone home but apartment 32 is still working?\n\njust my 2 cents  \ncheers mike\n\n"
    },
    {
      "time": "4 Aug 2006 — 5:04am",
      "content": "Maybe flip the word Apartment to vertical reading down with the 32 beneath it.\n\nAnother way is to just let your graphic imply the word apartment and just put the number 32 below the graphic without typesetting \"apartment\" at all?\n\nChrisL\n\n"
    },
    {
      "time": "4 Aug 2006 — 5:06am",
      "content": "Well, I just noticed your 3rd pdf has already done my second idea. I like it!\n\nChrisL\n\n"
    },
    {
      "time": "4 Aug 2006 — 5:20am",
      "content": "Here is another thought:\n\nChrisL\n\n ![](http://web.archive.org/web/20150414215803im_/http:/typophile.com/files/apt32_3930.png)\n\n"
    },
    {
      "time": "4 Aug 2006 — 11:35am",
      "content": "hello. I am a new-comer here, but i stumbled upon this and thought you could use input. The simplicity is good. I also agree with the aforementioned crits about putting the light at the top of the building.  \nif you did something like that your eye starts at the top anyways and travels natually downward, which would probably allow for an easier read. I agree with the person right above me to a degree only that Apartment 32 should contain a little touch of color as to relate back to the \"light\" in the window.\n\n"
    },
    {
      "time": "6 Aug 2006 — 10:26am",
      "content": "I guess working on the top floor of the apartment would give a better view.\n\n(Spuit 11, I see.) ;-)\n\n"
    },
    {
      "time": "21 Jun 2009 — 4:40pm",
      "content": "just curious ... why isn't the apartment at the top? don't most apartment numberings go up?\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20150414215803/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": "22 Jun 2009 — 8:12am",
      "content": "Paul,\n\nYes, but apartment 32 would be on the ground floor. Apartment 532 would be on the 5th floor....at least that's what I've always noticed, and I've lived in a lot of big, ugly apartment buildings.\n\nAK\n\n"
    },
    {
      "time": "22 Jun 2009 — 1:44pm",
      "content": "I feel like apartment 32 would be on the third floor, second window from the left.\n\n"
    },
    {
      "time": "22 Jun 2009 — 2:27pm",
      "content": "Another option is 5th floor, second from the left. That's where a programmer would live :)\n\n"
    },
    {
      "time": "22 Jun 2009 — 5:07pm",
      "content": "seems pretty literal. I'd be putting it at the top of the building.\n\n\\*shrug\\*\n\n----------  \n**Paul Ducco**  \n [Graphic Designer](http://web.archive.org/web/20150414215803/http:/www.solid-creative.com/) - Melbourne\n\n"
    },
    {
      "time": "22 Jun 2009 — 8:43pm",
      "content": "Thanks guys, but I finalized this logo almost three years ago. The only reason this thread came up again was from that spammer (tomfeinberg).\n\n- Lex\n\n"
    },
    {
      "time": "22 Jun 2009 — 9:40pm",
      "content": "Drat! I hate it when I don't catch that. For the record, I think it's cool, Lex.\n\n"
    }
  ]
}
