{
  "id": "2742",
  "title": "Viking Decal Identity",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I posted this on another thread about sketches, I think this spot is a better fit.   \n   \nThese are a few initial directions of an identity system for a truck decaling company in NJ. Pretty much they travel the NJ/NY/PA area putting gigantic decals on trucks like FedEx (I worked for them and after staring at that logo for entire summer I no longer see the ingenuity of the \"hidden\" arrow) and other big names. It's tedious work, blowtorches are involved, and it's blue collar. So that's the background.   \n   \nI am of course interested in receiving feedback on my work. As most who post their work on these forums, I am very open to criticism.   \n   \nI only have two jpgs of pencil sketches. My Illustrator sketches are in the preliminary stages.   \n   \n ![sketch 1](http://web.archive.org/web/20131022144031im_/http:/www.typophile.com/forums/messages/29/24323.jpg)   \n   \n ![logo 3](http://web.archive.org/web/20131022144031im_/http:/www.typophile.com/forums/messages/29/24324.gif)   \n   \n ![logo type](http://web.archive.org/web/20131022144031im_/http:/www.typophile.com/forums/messages/29/24325.gif)   \n   \n ![logo 4](http://web.archive.org/web/20131022144031im_/http:/www.typophile.com/forums/messages/29/24326.gif)   \n   \n ![logo 1](http://web.archive.org/web/20131022144031im_/http:/www.typophile.com/forums/messages/29/24327.gif)   \n   \n ![logo 2](http://web.archive.org/web/20131022144031im_/http:/www.typophile.com/forums/messages/29/24328.gif)\n\n",
  "author": "whoisdan",
  "time": "16 Jan 2004 — 6:54pm",
  "uid": "2739",
  "comments": [
    {
      "time": "16 Jan 2004 — 7:28pm",
      "content": "The bottom one is great in every way!   \nJust chop off that appendage off the middle bar of the \"E\".   \n   \nAnother possibility: try one large \"V\" (like your first one) where the arms become the horns - or maybe that would get too gothic...   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2004 — 7:54pm",
      "content": "Thanks Hrant.   \n   \nYeah, the V with horns didn't work. I had that idea but the sketch looked bad. It was worth a shot. I do live in Chicago...   \n   \nWhat do you think about the spacing between letters? I even kerned while viewing it upside down... I'm nervous about the \"A L\" space and the horizontal position of \"DECAL\". That appendage on the E is stupid. Oops.   \n   \nThe typeface is some random one that I spent a long time fixing to look like that. I may as well have started from scratch.   \n   \n ![gobulls](http://web.archive.org/web/20131022144031im_/http:/www.typophile.com/forums/messages/29/24331.gif)\n\n"
    },
    {
      "time": "16 Jan 2004 — 9:07pm",
      "content": "Here's another cheezeball idea I had. Since it's a decal-putter-upper company, I tried out a direction where that's incorporated into the design. Get it, the \"V\" is a sticker? I kinda like it, but I feel like I've joined the Dark Side... ![logo peel](http://web.archive.org/web/20131022144031im_/http:/www.typophile.com/forums/messages/29/24335.gif)\n\n"
    },
    {
      "time": "16 Jan 2004 — 9:44pm",
      "content": "I redrew the helmet to be a head on from slightly above. The logo is now a square. I'm not sure about the leading now, nor am I completely comfortable with the distance between the type and the sides. I think I'm creating some spacing problems by using an exact square. Then again, I can always redraw the helmet to help me out.   \n   \n ![logo posneg](http://web.archive.org/web/20131022144031im_/http:/www.typophile.com/forums/messages/29/24338.gif)\n\n"
    },
    {
      "time": "16 Jan 2004 — 10:23pm",
      "content": "The straight helmet is stronger, but less interesting.   \n   \nSpacing: \"AL\" tighter, and maybe the \"IK\" slightly too - it's hard to tell at that low resolution.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Jan 2004 — 11:53pm",
      "content": "I'd suggest going back to the rotated-helmet concept, but having the higher horn on the left. I would also encourage you to really think about the helmet's shape, and how it would silhouette; I feel like the horns are strangely skewed in your initial drawings.   \n   \nI'd definitely round the tips of the horns as you did in your most recent image; it makes them more \"hornlike\", and takes the egde off the counterchanging.\n\n"
    },
    {
      "time": "17 Jan 2004 — 10:31am",
      "content": "Jolly good. I too think the rotated helmet is a more interesting, dynamic graphic. Thanks for the input Shreyas and Hrant\n\n"
    },
    {
      "time": "17 Jan 2004 — 10:59am",
      "content": "I concur with Hrant regarding the angled view of the helmet, and more specifically with Shreyas' direction of \"having the higher horn on the left\", or rather the red horn in the white area (whichever side it ends up being on).   \n   \nHave you explored any solutions \"outside of the box\", but within the same direction as this concept? Maybe there's no red frame outlining the red area and the type, and red type is to the right of the mark. Perhaps try framing the graphic mark only, then positionig the type somewhere outside of the rectangle. Try creating a random red and white/negative space checker pattern (not a square board) and incorporating the elements (graphic and type) into a portion of that pattern. Just some ideas\n\n"
    },
    {
      "time": "18 Jan 2004 — 10:07pm",
      "content": "Ooh. Good thoughts. Revisions tomorrow (Monday).\n\n"
    },
    {
      "time": "19 Jan 2004 — 8:47am",
      "content": "Daniel, I think the best thing you have going is your 'cheeseball' decal logo : )\n\n"
    },
    {
      "time": "19 Jan 2004 — 9:20am",
      "content": "I agree with Drew. I'd love to see you develop the peeling sticker logo idea a bit more. Could be really great, if you balance the strong/ bold design with just a little wit. Though, I suppose it could be seen as peeling _off_, rather than being applied.   \n   \nI also agree with Hrant. The angled helmet's much more interesting. Personally, I like the one set in the V maybe with some centered type. It's bold and simple but not boring. The strong V makes up for the less impactful shape. (also taking a refined helmet into account)   \n   \nOf course, this is posted after the weekend, so you've probably moved on. Oh well, 2 cents in.\n\n"
    },
    {
      "time": "19 Jan 2004 — 10:24am",
      "content": "2 cents gotten. I haven't moved on at all, actually. I was pretty full with other work this weekend, including research and designing [this poster](http://web.archive.org/web/20131022144031/http:/whoisdan.com/sweeney) for Notre Dame.   \n   \nI will certainly have updates tonight and tomorrow. Awesome feedback, guys. I too think the applied V could work if I get it right...We'll see.\n\n"
    },
    {
      "time": "19 Jan 2004 — 11:20pm",
      "content": "I didn't have much time to work on this, but here's a little update.   \n   \nI changed the helmet. It looks better, but it's not great. I messed around with the pos/neg ideas on the computer, results aren't as good as I'd hoped. I'm thinking about combining the peeling-off V with the pos/neg idea. Who knows.   \n   \nI played around with type/object positioning, but it's not there yet. Any objections to my type choice? Any suggestions? I don't think it looks right if it's not in white with a red backing.   \n   \n ![lots of logos](http://web.archive.org/web/20131022144031im_/http:/www.typophile.com/forums/messages/29/24482.gif)   \n   \nAs I previewed this gif I thought of extending the red rectangle all the way left to back up the type, then change the type to white. That could go somewhere.\n\n"
    },
    {
      "time": "20 Jan 2004 — 1:30am",
      "content": "The curved Viking horns reminded me of the \"V\" in Armada, so I threw it in with your helmet graphic\n\n"
    },
    {
      "time": "20 Jan 2004 — 1:42am",
      "content": "Daniel,   \n   \nI like what you've done with the helmet. I'd like to see your last idea (extend red rectangle left and knock out text to white) executed. It's a strong concept which may pull it all together and allow the type treatment to dominate the visual field.   \n   \n -t\n\n"
    },
    {
      "time": "20 Jan 2004 — 7:52am",
      "content": "I think the helment is strong, but the pos/neg stuff weakens it.   \n   \nI like the all-dark helmet. What if the V was in the helmet, rather than the other way around? Perhaps like a V applied on the helmet? (It's a bit sports-ish, though.)   \n   \nI'm going to throw another idea out there, because it's gnawing at my brain now. What if you gave the helmet a nose guard ( [example](http://web.archive.org/web/20131022144031/http:/www.northerner.com/large_images/scg-s52b.jpg)), but in the shape of the counterform of the V or a V itself? Then you might be able to use that straight-on view from before.\n\n"
    },
    {
      "time": "20 Jan 2004 — 8:07am",
      "content": "I'm about to mess around with type treatment, but here's an update.   \n   \nScott, I think Armada is the wrong direction for this one.   \n   \n ![morelogos](http://web.archive.org/web/20131022144031im_/http:/www.typophile.com/forums/messages/29/24503.gif)\n\n"
    },
    {
      "time": "20 Jan 2004 — 9:38am",
      "content": "I like the angled shading on the helmet.   \n   \nChris, that nose-guard helmet would have helped Ty a lot!   \n   \nBTW, the Notre Dame poster: do remove the traps from the large[r] letters.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Jan 2004 — 9:44am",
      "content": "Hi Daniel,   \n   \nJust put two and two together with your ID thread. I was thinking this was Schwabesque.   \n   \nA side note about viking helmets: [no horns](http://web.archive.org/web/20131022144031/http:/elfwood.lysator.liu.se/loth/l/u/luiro/vikinghelmet_01_copy.jpg.html)   \nBut you probably want to keep them for recognition since the myth is more recognized than the original. I think you can add some more details and still be simple enough. Perhaps some rivet highlights? Mabe the eye/nose mask? Maybe not?   \n   \nI'd also try non-horizontal type treatments. Circle, with VIKING between the horns and DECAL below? Maybe a simple U shape below the helm?   \n   \nWhoops, just got another idea. Second to the viking helmet in recognizability is the viking longship. I think that might make a more compelling image.   \n   \nFor inspiration:   \n [http://www.celticcharms.com/viloshpe.html](http://web.archive.org/web/20131022144031/http:/www.celticcharms.com/viloshpe.html)   \n [http://www.lysator.liu.se/nordic/mirror/longship/0298hale.html](http://web.archive.org/web/20131022144031/http:/www.lysator.liu.se/nordic/mirror/longship/0298hale.html)   \n [http://www.woodenboat.com/](http://web.archive.org/web/20131022144031/http:/www.woodenboat.com/)   \n   \nDefinitely less clich\n\n"
    },
    {
      "time": "20 Jan 2004 — 9:54am",
      "content": "This might also help:   \n   \n [http://www.yorkarchaeology.co.uk/piclib/photos.php](http://web.archive.org/web/20131022144031/http:/www.yorkarchaeology.co.uk/piclib/photos.php)   \nSearch using the keyword: BOAT   \n   \nFor a better helmet shot try this link:   \n [http://www.jorvik-viking-centre.co.uk/resources/resource1.htm](http://web.archive.org/web/20131022144031/http:/www.jorvik-viking-centre.co.uk/resources/resource1.htm)   \n   \nRandy\n\n"
    },
    {
      "time": "20 Jan 2004 — 10:53am",
      "content": "Or beards, [Vikings like beards](http://web.archive.org/web/20131022144031/http:/www.scandinavianheritage.com/sh-gods.htm).   \n   \nCan't you see it? [This guy](http://web.archive.org/web/20131022144031/http:/www.scandinavianheritage.com/Age.jpg) _screams_ Viking Decal to me.   \n   \n ![:-)](http://web.archive.org/web/20131022144031im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "20 Jan 2004 — 11:14am",
      "content": "That dude's not screaming, Chris! He's indoctrinating that yes, Viking Decal is indeed where it is at. What a wise sage he is.   \n   \nOr were you just saying that although he's not currently screaming, he does scream \"Viking Decal!\" from time to time?   \n   \nSweet links.\n\n"
    },
    {
      "time": "21 Jan 2004 — 12:22am",
      "content": "I'm just tooling around with the helmet. Some time soon I will tool around with the peeling V idea. Also, I want to try out a solid helmet, per Chris's suggestion.   \n   \nThe Viking Ship is the logo for Viking Books. It's a good logo I think, I haven't seen it in a long time and I haven't searched for it online.   \n   \nMy brother wants me to use the pos/neg idea with an actual viking dude, maybe with a sword or something. We'll see if that ever happens. As of now I need to get some feedback from the client. Thanks for the recommendations.   \n   \n ![helmets](http://web.archive.org/web/20131022144031im_/http:/www.typophile.com/forums/messages/29/24567.gif)\n\n"
    },
    {
      "time": "21 Jan 2004 — 11:20am",
      "content": "I like the solid square with the type + helmet, but I'm not sure if you need the reversed square in there...it's almost too much. Maybe try one with just the white helmet?   \n   \nThe peeling V is also actually quite nice, though it may seem more like it's 'falling off' rather than 'being applied'. Ie, it may look like a shoddy decal that's coming off. Still, I like it.\n\n"
    }
  ]
}
