{
  "id": "27435",
  "title": "design company logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi, I'm working on a logo for my freelance stuff. I have a company registered and stuff. Anyway, first is the logo that I did last year. I'm trying a new idea, what do ya'll think? Thanks!\n\nfirst is the one from last year…\n\n ![](http://web.archive.org/web/20131108192527im_/http:/typophile.com/files/ambia-logo_6008.jpg)\n\nThis is some ideas that I came up with…\n\n ![](http://web.archive.org/web/20131108192527im_/http:/typophile.com/files/logo-revision_6244.jpg)\n\n",
  "author": "jeremydouglas",
  "time": "3 Aug 2006 — 7:43pm",
  "uid": "6500",
  "comments": [
    {
      "time": "3 Aug 2006 — 10:31pm",
      "content": "Have you tried with everything in blue? I can see only the big M, and the white diagonals don't tell me too much. Maybe you could explain the meaning. What do you think?\n\n"
    },
    {
      "time": "4 Aug 2006 — 12:37am",
      "content": "I think the old one is stronger than these new iterations.\n\n----------  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20131108192527/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "4 Aug 2006 — 7:11am",
      "content": "The old one is indeed stronger. The problem with the new one is that it's not simple. The broken pieces and outlines create uncessary complexity. Just as important, what do the broken pieces communicate? The old logo has more contrast, the red 'M' is eye catching, and even the typographic choices are better. Keep it simple.\n\n"
    },
    {
      "time": "4 Aug 2006 — 10:11am",
      "content": "Thanks for the input.\n\nI see what you mean. As a logo simplicity is probably the better way to go than trying to be too \"designy\".\n\nI may even change the name, alot of people seem to be confused by the name \"aMbia\". They try to figure out what it meansf. It doesn't really mean anything I just thought it sounded nice. Is that dumb?\n\n"
    },
    {
      "time": "4 Aug 2006 — 11:24pm",
      "content": "The meaning of the name is not the problem, it's the meaning of the design. I think that design is not to make it complex without a reason to look \"special\". You must decide what you want to communicate, and after that then you draw.\n\n"
    },
    {
      "time": "5 Aug 2006 — 3:03pm",
      "content": "I think I see what you mean, tonicastro. I find it more dificult donig this than anything else I've done. How to communicate \"design\" through a log without being cliche or complicated. I think it should say more than just \"design\". I guess as my work gets more defined over time I'll have a better go at it.\n\n"
    }
  ]
}
