{
  "id": "27479",
  "title": "Helvetica: The Film",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Greetings Typophilers, just wanted to let you know about the documentary I'm making.\n\n**Helvetica** is a feature-length independent film about typography, graphic design and global visual culture. It looks at the proliferation of one typeface (which will celebrate its 50th birthday in 2007) as part of a larger conversation about the way type affects our lives. The film is an exploration of major cities and the type that inhabits them, and discussions with renowned designers about their work, their views on type, and the past fifty years of graphic design. **Helvetica** was shot in high-definition on location in the United States and across Europe. The film is currently in post-production and will begin screening at film festivals worldwide in early 2007.\n\nInterviewees in the film include Matthew Carter, Massimo Vignelli, Erik Spiekermann, Michael Bierut, Wim Crouwel, Hermann Zapf, Stefan Sagmeister, Jonathan Hoefler, Tobias Frere-Jones, Lars Müller, Rick Poynor, Experimental Jetset, Pierre Miedinger, and many more. The film will also feature an original soundtrack with new music from Sonic Youth, Sam Prekop, Kim Hiorthøy, and others.\n\nFor more info, there's now a website for the film: [http://www.helveticafilm.com](http://web.archive.org/web/20110812213848/http:/www.helveticafilm.com/ \"http://www.helveticafilm.com\")\n\nI'll also be screening a four-minute teaser at TypeCon this week, during Wednesday night's Typophile Film Festival. Hope to meet those of you who are attending.\n\nLooking forward to hearing all your thoughts and feedback on the film, and of course screening it all over the place in '07. We're currently finishing the editing process, and will be posting some clips and trailers on the site soon. If you'd like me to keep you posted about the film's progress, screenings and other news, we have a [mailing list](http://web.archive.org/web/20110812213848/http:/www.helveticafilm.com/mailing.html) so if you're interested, get on it.\n\nThanks!\n\n-Gary\n\n ![](http://web.archive.org/web/20110812213848im_/http:/typophile.com/files/sm_4063.badges.jpg)\n\n",
  "author": "<a href=\"/web/20110812213848/http://typophile.com/user/11572\" title=\"View user profile.\">swiss dots</a>",
  "time": "<br>",
  "uid": "11572",
  "comments": [
    {
      "time": "",
      "content": "That's pretty amazing!\n\nI'm looking forward to seeing it already! When is it likely to be released in the UK (we usually lag way behind the USA when it comes to release dates)?\n\nNice badges, by the way! Where did you get them?\n\nSi\n\n"
    },
    {
      "time": "",
      "content": "Free with the merch - [http://www.helveticafilm.com/shop.html](http://web.archive.org/web/20110812213848/http:/www.helveticafilm.com/shop.html \"http://www.helveticafilm.com/shop.html\")\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "Wow. I think might have just soiled myself.\n\n"
    },
    {
      "time": "",
      "content": "Only time will tell if it's better than \"Cooper Black, behind the typeface\" or that Frutiger movie. But it looks promising.\n\n"
    },
    {
      "time": "",
      "content": "[http://typographi.com/001071.php](http://web.archive.org/web/20110812213848/http:/typographi.com/001071.php \"http://typographi.com/001071.php\")\n\nYikes, I hope it's better than the Frutiger film. I feel pretty confident it will be.\n\n"
    },
    {
      "time": "",
      "content": "the frutiger-film really was bad, reading his own autobiography told you more about his typefaces AND his person than the whole film, imho.\n\ncant wait for the helvetica-film, im pretty sure it will be better than the other examples mentioned above.\n\n"
    },
    {
      "time": "",
      "content": "Oh, some design trivia that I forgot to mention: the film's Director of Photography, Luke Geissbuhler, is the son of designer Steff Geissbuhler. Luke's done some great film work (he's also the DP on the upcoming Sasha Baron Cohen film, among others).\n\nNaturally, I had to go with the Swiss DNA for a film like this...\n\n-Gary\n\n"
    },
    {
      "time": "",
      "content": "Man I wish the Film Festival wasn't on the very first night, as I won't be able to make it.\n\n"
    },
    {
      "time": "",
      "content": "David, we'll be posting a remixed version of the TypeCon teaser on the film's wesbite in a few weeks.\n\n"
    },
    {
      "time": "",
      "content": "swiss dots: please make sure that we swiss typophiles (or at least i :)) can buy the film in switzerland. if you need help finding specialised stores, write me a mail and i'll be glad to help you.\n\n"
    },
    {
      "time": "",
      "content": "Will you be giving away free buttons, Gary? : )\n\n"
    },
    {
      "time": "",
      "content": "Was that the 30,000 (general discussion) post? Or is this?\n\n"
    },
    {
      "time": "",
      "content": "no, maybe it's stuck at 29999?\n\n"
    },
    {
      "time": "",
      "content": "30,000 posts? that's incredible!\n\n"
    },
    {
      "time": "",
      "content": "YES! Free love/hate Helvetica buttons at TypeCon!\n\nYou blew my surprise Andi...\n\n"
    },
    {
      "time": "",
      "content": "Andi must have a Love/Hate thing going with you :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Thanks Kesh, we'll definitely have a public screening in Zurich in the Spring. And maybe a guerilla outdoor screening on the walls of the old Haas type foundry in Munchenstein (here's a shout out to super-sleuth Tobias Frere-Jones for helping me track down the building). The DVD will be distributed throughout Europe, I'll let you know if we need help with Swiss stores.\n\n"
    },
    {
      "time": "",
      "content": "Looks like it's stuck at 29,999...\n\n[http://typophile.com/forums](http://web.archive.org/web/20110812213848/http:/typophile.com/forums \"http://typophile.com/forums\")\n\nsomeone needs to give it a knock.\n\nSi\n\n"
    },
    {
      "time": "",
      "content": "ok gary, please just announce the screening in zurich in your newsletter - again, if you need adresses to get some publicity for it, feel free to ask.\n\n"
    },
    {
      "time": "",
      "content": "Hi Gary. Hope there will be a repeat, for all of us who don't show up until Thursday!\n\nI can't wait to see the film. Congratulations!\n\nJLT\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20110812213848/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": "",
      "content": "Gary,\n\nFirst sorry for going off-topic - I though it was exciting that typophile general discussions was about to click over to 30,000 posts, shouldn't have sidetracked the thread.\n\nAnyway, I note that the site mentions Apple, but did you visit Apple and film any of the font folk over there?\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "Thanks Si, no worries. That is weird that it's still stuck though!\n\nWell there was talk about interviewing Steve Jobs for the film... but it never went anywhere. But then so many of the designers we interviewed referenced the Apple/Mac influence on Helvetica's popularity, and its affect on graphic design in general, that we figured the point had been made.\n\nThanks again,\n\n-Gary\n\n"
    },
    {
      "time": "",
      "content": "True, I wonder how much a part of popular culture the font would be today if it wasn't for Apple bundling it? But if you couldn't get his Steveness, would interviewing a mere mortal like Peter Lofting or Dave Opstad have been a suitable substitute, probably not.\n\n"
    },
    {
      "time": "",
      "content": "One of the challenges putting this film together was my desire not to make it a standard talking-head film, where dozens of people chime in with one quote about the subject. I wanted each interview to be a mini-profile, so you're getting to spend a few minutes with, say, Matthew Carter, learning about his background, his views on type, what he tells people when they ask him what he does for a living, etc. And then you get his views about Helvetica. The downside of this approach is that I could only include so many people in the film. There are hundreds of people who've got an opinion about the typeface, or were in some way responsible for its popularity.\n\nIt's funny because I originally wanted to make a documentary about type design, past/present/future. Then I realized that it would take a loooong time, like 3 to 5 years at least, to make a film that really covered all that and got it right. So I thought \"Well, I'll just pick one typeface, that'll be easy!\"\n\nBut of course, I was wrong!\n\n-Gary\n\n"
    },
    {
      "time": "",
      "content": "How exciting\n\n"
    },
    {
      "time": "",
      "content": "There should be \"What's Helvetica?\" pins set in Arial.\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "Really looking forward seeing it. Do you know when it comes to Sweden?\n\n"
    },
    {
      "time": "",
      "content": "Any chance of seeing it in Finland?\n\n"
    },
    {
      "time": "",
      "content": "\\> There should be “What’s Helvetica?” pins set in Arial\n\nComplete with an incorrect apostrophe?\n\nWhen I saw the button, I Hate Helvetica above, I thought the font should have been something different. Univers, Arial, Gill, heck, even Times. But perhaps there is some satire involved in using Helvetica for it.\n\n"
    },
    {
      "time": "",
      "content": "yes, we'll be screening the film in finland/sweden/all over europe in the spring, either at film festivals, as part of design conferences, or at event screenings in major cities. if you get on the mailing list at the helvetica film site, we'll keep you posted, should have the screening schedule setup by november.\n\nand yes, \"i hate helvetica\" set in helvetica = satire.\n\nstay on the lookout for our \"friends don't let friends use arial\" shirts...\n\n-gary\n\n"
    },
    {
      "time": "",
      "content": "This sounds great, and I can't wait to see it. I'm slightly curious, because, like two other mostly teutonic products, the VW bug and the Beatles ;), it was not until they were hits in America that they gained world culture status. Helvetica becoming a hit here depended on Mike Parker bringing it to America, and Marva Warnock bringing it to DTP. So, it sounds like you presenting \"the greatest story ever told\", without the involvement of St. Peter or Mary Magdalene ;)\n\n“friends don’t let friends use arial” That's just ridiculous. If friends don’t let friends use Windows, the Arial use takes care of itself. ;)\n\n"
    },
    {
      "time": "",
      "content": "Whoa! That sounds awesome. Of course I don't know who I will be able to convince to see it with me ;)\n\n"
    },
    {
      "time": "",
      "content": "\"stay on the lookout for our “friends don’t let friends use arial” shirts…\"\n\nAhhh, what are friends for :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\> That’s just ridiculous. If friends don’t let friends use Windows, the Arial use takes care of itself.\n\nArial has been included with Mac OS since OS9 and is also very common in Linux installations, so you're about five years too late.\n\n\\>it was not until they were hits in America that they gained world culture status.\n\nDavid, can you point us to an article, or better yet tell us the story behind this? I'd always imagined the font as being smuggled into the country along with a hoard of Nazi gold, the original Mona Lisa, and various alien artifacts by a group of unscrupulous Swiss art dealers, aboard a decommissioned U-boat manned by the cast and crew of Casablanca. But I watch too much TV.\n\n"
    },
    {
      "time": "",
      "content": "Actually, it came to the U.S. on the \"LoveBoat\" after being smuggled aboard from \"Fantasy Island\" \"The font boss, the FONT!!!\"\n\nBut then again, I have a short memory :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\> stay on the lookout for our “friends don’t let friends use arial” shirts…\n\nGotta get me one of those! Yowza!\n\nK.\n\n"
    },
    {
      "time": "",
      "content": "The version I heard had the LoveBoat going towards Europe, when it was torpedoed by a West-bound decommissioned U-boat, to the tune of \"Haarrrr, Play it again Sam, ya scurvy dog\". I also heard the crew of the LoveBoat were seen wearing t-shirts saying \"I love Arial\", \"I love Helios\", \"I love Triumverate\" and/or \"I love Megaron\".\n\nIf only there had been no life jackets...\n\n"
    },
    {
      "time": "",
      "content": "\\>The version I heard...\n\nNo disrespect to Gary, but that's one movie I'd pay to see!\n\n"
    },
    {
      "time": "",
      "content": "\"...that’s one movie I’d pay to see!\"\n\nI'm checking \"Movietickets.com\" right now for tickets.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "David, I've actually been in contact with Mike, trying to arrange a time this week at TypeCon to interview him. I know he played a huge part in the Helvetica story, and he's already referenced in the film by Matthew Carter and others.\n\nAnd actually, I was kidding about the \"Friends Don't Let Friends Use Arial\" shirt! But hell, maybe we'll make up a few just for kicks...\n\nCheers,\n\n-Gary\n\n"
    },
    {
      "time": "",
      "content": "Hey Gary,\n\nGreat news about the film. Let us know when us peeps in Blightly can get hold of it!  \n(Blighty = Great Britain)\n\nWhat's this about limited edition film prints? You've done with Build? Would that be Build as in Michael C Place of The Designers Republic? I love his work! Might have to order one of those... just got to work out when I'm getting paid!\n\n"
    },
    {
      "time": "",
      "content": "correct russ, that's michael c. place of build, formerly with TDR.  \n [http://www.designbybuild.com](http://web.archive.org/web/20110812213848/http:/www.designbybuild.com/ \"http://www.designbybuild.com\")\n\nhere he is below with his \"coffee, tea and helvetica\" mug.\n\nwe'll be unveiling his print design in a few weeks.\n\ncheers,\n\n-gary\n\n ![](http://web.archive.org/web/20110812213848im_/http:/typophile.com/files/place1_6346.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Fantastic - can't wait to see it!\n\nHave you heard of a Melbourne design studio called The Letterbox? I saw a lot of lectures by the owner, Stephen Banham, on typography when I lived there, and he also lectured at one of the universities I went to.\n\nAnyway, he produced a lot of work based on Helvetica, including a book mapping typefaces in the CBD of Melbourne \\> [http://www.the-letterbox.com.au/merchandise/mer\\_bks\\_grand.html](http://web.archive.org/web/20110812213848/http:/www.the-letterbox.com.au/merchandise/mer_bks_grand.html \"http://www.the-letterbox.com.au/merchandise/mer\\_bks\\_grand.html\") (of which he found Helvetica dominated). He also sells some nice t-shirts \\> [http://www.the-letterbox.com.au/framesets/frames\\_mer\\_tshirts.html](http://web.archive.org/web/20110812213848/http:/www.the-letterbox.com.au/framesets/frames_mer_tshirts.html \"http://www.the-letterbox.com.au/framesets/frames\\_mer\\_tshirts.html\")\n\nI added a link to your website from my blog :)\n\n"
    },
    {
      "time": "",
      "content": "kim hiorthøy. i so like his music!  \nthat's all i can say.\n\n"
    },
    {
      "time": "",
      "content": "i want that mug. in fact, i think i'll just make one for myself if i cant find it in a store. any idea? (please answer via mail on art-theglyphyouknow-ificial.ch - dont wanna take this thread offtopic again)\n\n"
    },
    {
      "time": "",
      "content": "thanks anthony, yes i've talked to stephen banham a lot, i was trying to make it down to film in melbourne but just didn't have the budget.\n\nand kesh, you should contact michael at build to see how to get a mug, you can reach him through his site: [http://www.designbybuild.com](http://web.archive.org/web/20110812213848/http:/www.designbybuild.com/ \"http://www.designbybuild.com\")\n\ni think he designed it for a japanese company that sells them.\n\ni'm off to typecon...\n\ncheers,\n\n-gary\n\n"
    },
    {
      "time": "",
      "content": "thanks, just sent him an email.\n\n"
    },
    {
      "time": "",
      "content": "We saw the preview of the Helvetica film at TypeCon and enjoyed the snippet--even though it was just a rough cut. I guess when we see the \"now playing at a theatre near you\" sign, we will know it is golden :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "The film snippet was definitely enough to wet my appetite! It looks very clever and well thought out - you'll have to give us a countdown to the theater release, Gary!\n\nAndi\n\n"
    },
    {
      "time": "",
      "content": "I hope it's like [The Red Violin.](http://web.archive.org/web/20110812213848/http:/www.imdb.com/title/tt0120802/)\n\nMatt C. could play Vince Figgins with a cockney accent, like Noel Coward in Red Peppers.\n\n"
    }
  ]
}
