{
  "id": "27496",
  "title": "i lost my topic pizzaman",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "hello i hope Timd sees this  \nit seems that i lost my topic i might have deleted it by mistake  \ni have a vector file and a psd file unfortunatly i can not open the psd file since i have older programs imageready 7 photoshop 7 and macromedia flash mx opens the vector but the font is diffrebt is there a way of openning them\n\nthis is the last jpg that he has sent me. it looks diffrent doesn’t it\n\n ![](http://web.archive.org/files/sunpizzalastjpg_3987.jpg)\n\n",
  "author": "<a href=\"user/13797\" title=\"View user profile.\">pizzaman</a>",
  "time": "<br>",
  "uid": "13797",
  "comments": [
    {
      "time": " 7 August, 2006 - 8:44pm",
      "content": "If the font in the vector file is different, he probably forgot to convert the text to curves before sending it to you.\n\n- Lex\n\n"
    },
    {
      "time": " 8 August, 2006 - 1:32am",
      "content": "thank you lex\n\n"
    },
    {
      "time": " 8 August, 2006 - 6:52am",
      "content": "Hi, sorry your thread disappeared, as Lex said an outlined vector file should sort the font issue, on that latest jpg there seems to be something going on where N meets Y.  \nHow do you feel about it?\n\nTim\n\n"
    },
    {
      "time": " 9 August, 2006 - 4:07pm",
      "content": "hello timd  \nyou won’t belive this! now this guy does not know how to make a vector file and has made this in paintshop. the N and Y are too close to each other and the first triangle does not connect to the second one again  \noverall it seems to be the design that i think i am going with and i gave him a partial payment for the use of the idea and the design. i do not think that i have lost too much since i have found a design that can work for me.now i guess i have to try to get this in a vector format i downloaded a copy of inkscape so i just have to learn a little or maybe get someone to do it  \nby the way before i lost the last topic someone suggested this. it looks nice but i think is too heavy for the site what do you think\n\n ![](http://web.archive.org/files/horizontal_5438_6357.jpg)\n  \nthank you very much for all the help\n"
    },
    {
      "time": " 9 August, 2006 - 5:11pm",
      "content": "the latter has a concept, attention to detail, and some consistency in the weight. I’m not saying it’s a great logo, but it’s definitely more of a solid solution than the other’s were. IMHO, of course.\n\n"
    },
    {
      "time": " 9 August, 2006 - 6:52pm",
      "content": "yes it does look better but i lost the designer info and this is how it looks in the site it over powers it\n\n ![](http://web.archive.org/files/pizza_delivery=logo_5974.gif)\n\n"
    },
    {
      "time": " 10 August, 2006 - 2:21am",
      "content": "[http://typophile.com/user/14144](http://web.archive.org/web/20061127143516/http:/typophile.com/user/14144)\n\nThis was the designer\\* of that logo and it does have potential, but as you say it is overpowering at the moment, try contacting him and see if he is willing/able to work on it further.  \nTim\n\n\\*I hope, if it isn’t apologies to all concerned.\n\n"
    },
    {
      "time": " 10 August, 2006 - 6:48pm",
      "content": "thank you very much timd i pm the designer but the more i look at the simple one the more i like it.I think i am going to stay with that. now i just have to make a clean version and i am done.you were right from the beginning.\n\n"
    },
    {
      "time": " 12 August, 2006 - 6:48am",
      "content": "you are going to laugh  \nalthough the wall is very hard but i hear cracks it is either the wall or my skull lol  \nthe designer could not make a vector file i do not know why?!  \nso we came to an agreement and i get to use the idea but i had to make it myself  \ni found inkscape downloaded and started playing with it but i could not use the font that he was using so i had to start fresh\n\nso here it is\n\n ![](http://web.archive.org/files/pizza_delivery_york_3815.gif)\n\n"
    },
    {
      "time": " 9 September, 2006 - 8:10pm",
      "content": "I changed a lot of the things to compensate for my logo\n\n[my pizza listing site](http://web.archive.org/web/20061127143516/http:/pizzainny.com/)\n\n"
    },
    {
      "time": " 15 September, 2006 - 10:43am",
      "content": "I don’t get the colors, why not the Italian flag colors, red instead of orange. Or use New York state colors blue and gold. The big apple is red. Where did the orange come from\n\n"
    },
    {
      "time": " 15 September, 2006 - 11:30am",
      "content": "It is a company based in East Orange New Jersey :-)\n\nChrisL\n\n"
    },
    {
      "time": " 15 September, 2006 - 3:05pm",
      "content": "i was in macy’s and noticed that a lot of the sale signs used in the store were orange and green. they spend enough money on researching these things so i decided on these colors\n\n"
    },
    {
      "time": " 15 September, 2006 - 3:51pm",
      "content": "Nuff said.\n\n"
    },
    {
      "time": " 15 September, 2006 - 8:31pm",
      "content": "I really did not want to get into the experiments that I did with the two colors but here we go.  \nI also noticed the extensive use of these colors by other big retailers like sears  \nI started experimenting in my own store I painted one of the walls in the light green and noticed that people generally stayed longer in my store specially women. I added a large orange design on one of the walls. I had a 5% increase in sales in that section it seems that the green makes the people more relaxed and orange helps them to make decision easier  \nnow i am not a college grad but I had been in sales for 20 years and have learned that a lot of small things add up to big success for example we used to cover the floor of the store with shredded newspaper to look busier.Color has more benefit than just design.  \nSo when I started with this concept I decided to use these colors  \nnow if some one can point to a couple of fonts that i can use for my logo to get a nice clean fresh design please point me to it  \nalso what do you think about the little ilustration rather than stock photo\n\n"
    },
    {
      "time": " 16 September, 2006 - 1:24am",
      "content": "[http://www.spacehijackers.org/html/ideas/archipsy/tricks.html](http://web.archive.org/web/20061127143516/http:/www.spacehijackers.org/html/ideas/archipsy/tricks.html)\n\nThis was on Boingboing, sneaky retailers, the tiles trick is particularly creative.\n\nHasn’t your logo changed since you first posted that revision? I thought I saw it with the crown on the left and without the mysterious (read superfluous and ambiguous) swoosh under it. The illustration isn’t bad, although the hand (always a difficult thing to draw) is not very well rendered and the pizza looks as though it has green and yellow jellybeans on it and the salami seems more detailed than the rest of the illustration, if it possible to tone down those areas it might improve it, however if you can’t it is serviceable. I really wouldn’t use the earlier iteration of the logo in the find restaurant column.\n\nAs you know from the first thread I think the decision over avoiding the obvious colours was correct. What are you looking for from a new font, which areas do you want to use it – the sans and serif you are using are fairly well matched although the weights and sizes in the welcome section need some rationalisation.  \nTim\n\n"
    },
    {
      "time": " 16 September, 2006 - 2:53pm",
      "content": "very intresting reading  \ni knew about some of them but a few new ones for sure  \ni heard that they also use green and blue in jails to relax the inmates but i am not sure  \ni think i might have fixed my logo but i would appreciate if you take a look  \nalso i think i made the pizza more realistic  \ni also changes the recycled logo to an icon i had made as a fall back for a new logo  \ni am also going to stay with the fonts since i am not really good with them and i will work on their size and weight as soon as i settle on the content 100%  \n [http://pizzainny.com](http://web.archive.org/web/20061127143516/http:/pizzainny.com/)\n\n"
    },
    {
      "time": " 17 September, 2006 - 12:34am",
      "content": "And there goes the logo again:)  \nIt is kind of tricky to keep track of your logo iterations, the crown in the current one is not working as a unit with the lettering, either centre on the stem of P or centre on the width of P. Toning down the colours of the illustration have improved it and the icons are far better than the recycled logo. On the copy in your site I recommend you look at the periods a lot of them have spaces before and not every abbreviation of Ave or St has one.  \nTim\n\n"
    },
    {
      "time": " 17 September, 2006 - 6:49am",
      "content": "i am so sorry thank you very much for sticking with me  \ni am going crazy  \ni found this font and i figured the tall letters are more NY and more importantly it would allow me to take the angel out of the crown. this way i would be able to make it more even.  \ni centered it on the width of p exactly, but i can’t figure out how the placement of the crown from the high point of the p should be.\n\n ![](http://web.archive.org/files/newlogo1001a_5511.pl.svg.png)\n\n ![](http://web.archive.org/files/newlogo1001B_5979.pl.svg.png)\n\n ![](http://web.archive.org/files/newlogo1001C_6294.pl.svg.png)\n  \ni will fix the other issues when i enter their menu and the other info for each one in the db i am having the menues converted to excell now\n"
    },
    {
      "time": " 17 September, 2006 - 7:49am",
      "content": "The third of those works best to my eye and that typeface has a tall, elegant character.  \nTim\n\n"
    },
    {
      "time": " 17 September, 2006 - 9:24am",
      "content": "i agree the third one looks the best  \nit looks clean and sharp and works with the site  \ni think i can also use it and maybe even with the illustration to make decals to put on the doors of the restaurants and on postcards for advertising and things like that  \nyou know if i can get the pizzeria owners to each chip in a few hundred dollars a month i would have a good amount of advertising budget. there are about 350 of them you know.maybe even stop domino lol  \nso if you don’t have any other suggestion i think i should call this the final version and leave it alone  \nthank you very much for all your help\n\n"
    },
    {
      "time": " 18 September, 2006 - 10:59pm",
      "content": "Wow - this looks nice. It’s almost too nice for your colour scheme. I’d make the green a little more silvery, and the orange a bit more burnt. The new logo suggests somewhat of an art deco elegance.\n\nAs for the position of the crown, I’d align the centre spike with the centre of the counter of the ‘P’ (a little to the left of where it is now). The vertical placement in version 3 looks the best.\n\n- Lex\n\n"
    },
    {
      "time": " 19 September, 2006 - 3:04am",
      "content": "thanks to timd he is a real gentelman  \ni managed a crown with a little more detail and wonder if i should use the crown with the band seems to pullthe crown together but i don;t know about the overall effect\n\n ![](http://web.archive.org/files/pizza_delivery_york2crown_5353.gif)\n  \ni also made the narrow lines in N and Y a little bolder and also the a in pizza i don’t know if i ruined the font but it seemed a little hard to read  \nif the head band adds to the logo then i will polish it up ofcourse\n"
    },
    {
      "time": " 19 September, 2006 - 4:02am",
      "content": "It is my pleasure. I would say that it is too much to include the headband the simple lines of the earlier version are far better and the same goes for the letterforms, the more extras you add, the less elegance. Lex’s point about the horizontal position might be worth trying, just a touch to the left.  \nTim\n\n"
    },
    {
      "time": " 19 September, 2006 - 5:09am",
      "content": "is this what you mean\n\n ![](http://web.archive.org/files/pizza_delivery_york_5950.gif)\n  \nand this with colors although i feel i lose a little impact for the lack of a better word  \n\n ![](http://web.archive.org/files/1001logo_5036.pl.svg.png)\n\n"
    },
    {
      "time": " 19 September, 2006 - 6:15am",
      "content": "Yes, that is better harmony with the lettering, and I agree the colours are a little too tonally similar in the second.  \nTim\n\n"
    },
    {
      "time": " 19 September, 2006 - 4:43pm",
      "content": "i made 4 diffrent color combo  \nand i have the 4th one on the site  \nthe first one seems to create more connection between the crown and the p but i don’t know if it is any better  \nhere i go rambling again\n\n ![](http://web.archive.org/files/g1o2_4594.pl.svg.png)\n\n ![](http://web.archive.org/files/o1g1_5696.pl.svg.png)\n\n ![](http://web.archive.org/files/o1g3_3648.pl.svg.png)\n\n ![](http://web.archive.org/files/pizza_delivery_york_4150.gif)\n\n"
    },
    {
      "time": " 20 September, 2006 - 4:54pm",
      "content": "I like the ones where the crown and the word “Pizza” are different colours - it creates more contrast. I like the colours in the bottom version best. I wonder what would happen if you made the dot (period) triangular to match the dots on the ‘i’s.\n\n- Lex\n\n"
    },
    {
      "time": " 20 September, 2006 - 5:55pm",
      "content": "thank you for your assistance lex  \ni have the last one working [logo in the site](http://web.archive.org/web/20061127143516/http:/pizzainny.com.com/)\n\nintresting idea here we go i changed the dot\n\n ![](http://web.archive.org/files/1000laaog_6355.gif)\n\n ![](http://web.archive.org/files/1000labog_5819.gif)\n\n"
    },
    {
      "time": " 20 September, 2006 - 8:14pm",
      "content": "link is not good try this  \n [my pizza logo](http://web.archive.org/web/20061127143516/http:/pizzainny.com/)\n\n"
    }
  ]
}
