{
  "id": "27519",
  "title": "Where do I go with this biz card design?",
  "forum": "Design",
  "tags": [

  ],
  "content": "So I’m doing a last minute small run of biz cards for Typecon as I’ve just registered a domain that will point to my new portfolio site: [http://www.dsinelab.net/dave/index.html](http://web.archive.org/web/20071104015750/http:/www.dsinelab.net/dave/index.html \"http://www.dsinelab.net/dave/index.html\") (temp location) I’m trying to keep the site, resume and biz cards of the same family so they feel cohesive but I don’t know what to do about the card. Here is what I have so far...hopefully there’s still a few people who aren’t on their way to Boston.\n\n ![](http://web.archive.org/web/20071104015750im_/http:/typophile.com/files/db_4431.bizcard.1.png)\n\n [‹ Advice, suggestion, critique these tables please](http://web.archive.org/web/20071104015750/http:/typophile.com/node/27559 \"Go to previous forum topic\") [Full points in contents page ›](http://web.archive.org/web/20071104015750/http:/typophile.com/node/27601 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071104015750/http://typophile.com/user/8451\" title=\"View user profile.\">dave bailey</a>",
  "time": "<br>",
  "uid": "8451",
  "comments": [
    {
      "time": " 8.Aug.2006 11.39am",
      "content": "You use oldstyle figures for your telephone number… how about lowercase for the URL and e-mail address. The Internet is lowercase anyway and it matches the numbers better… plus you’ll be able to read it to boot!\n\nThe “GRAPHIC DESIGNER” can stay uppercase, since that matches your stuff on your site.\n\n"
    },
    {
      "time": " 8.Aug.2006 1.12pm",
      "content": "Letterspace all your capital letters and numbers at the lower right. They are hard to read right now. If they are full caps (and you are in Illustrator) try setting tracking to 100 and work down from there. If they are small caps, start at 50 and work up. Also the type at the lower right is too big. If you are printing litho, you can go as small as 5 pt with that kind of slabby serif in all caps. 7 pt is probably more realistic. It will add some depth to the card.\n\n"
    },
    {
      "time": " 8.Aug.2006 1.35pm",
      "content": "couple mistakes (new portfolio site)....\n\n“It wasn’t til I reached....”\n\ntill or until\n\n“I developed a affinity....”\n\nan (a, e, i,o,u) not a\n\n"
    },
    {
      "time": " 8.Aug.2006 2.08pm",
      "content": "Leveraging the nice playfulness of the logo, I  \nmight have “A GRAPHIC DESIGNER” instead.\n\nhhp\n\n"
    },
    {
      "time": " 8.Aug.2006 2.11pm",
      "content": "Not helpful, but I like the logo - it makes me think “$80 a barrel”\n\nCheers, Si\n\n"
    },
    {
      "time": " 8.Aug.2006 3.17pm",
      "content": "Yeah, I like what Hrant says. Classy. Er, playful.\n\nI would also echo Dan’s comments. The CAP-height overpowers the non-lining numerals.\n\nIs the black border going to print?? Or are you just showing me the edges of the card? Trimming out a border that thin will cause headaches.\n\n"
    },
    {
      "time": " 8.Aug.2006 3.35pm",
      "content": "I’m doing all the trimming by hand, and the printing as well (not by hand, but on a high end inkjet at school). Is it kosher to letterspace the lowercase a bit to enhance readability? they look a bit squished together at 8pt.\n\nNew version:\n\n ![](http://web.archive.org/web/20071104015750im_/http:/typophile.com/files/db_6665.bizcard.2.png)\n\n"
    },
    {
      "time": " 8.Aug.2006 4.19pm",
      "content": "\\> Is it kosher to letterspace the lowercase\n\nI’ve heard of playing with your food, but I like my lamb... fresh.\n\nhhp\n\n"
    },
    {
      "time": " 8.Aug.2006 9.26pm",
      "content": "\\> Is it kosher to letterspace the lowercase\n\nYes. Even Bringhurst recommends adding in a little letterspace to URLs and Email addresses.\n\n"
    },
    {
      "time": " 8.Aug.2006 9.47pm",
      "content": "Dan: Agreed, I looked at my Elements of Typographic Style book and did so. I’m printing 30 ganged up on A3+ sheets right now, watercolor paper with a very fine texture.\n\n ![](http://web.archive.org/web/20071104015750im_/http:/typophile.com/files/db_6387.bizcard.final.png)\n\n"
    },
    {
      "time": " 9.Aug.2006 6.58am",
      "content": "If it’s not too late move the dots (fullstops) slightly to the left in each case in the url and e-mail, if it is too late don’t get blood on them when trimming out.  \nTim\n\n"
    },
    {
      "time": " 9.Aug.2006 5.27pm",
      "content": "well it looks a bit boring imo. The logotype is the only thing that stands out and it doesn’t match the look and feel of the rest of the card. Also why not adding some colour? or some logomark, or something to show people that you are a designer. Right now that card could be for dumbo the clown or Jane the interior designer, nothing says “graphic design” to me.\n\nAre yout printing on white stock? Did you leave enough extra black around the border so that if your cutting is off it is still a full black border?\n\n"
    },
    {
      "time": " 10.Aug.2006 11.44am",
      "content": "I’ll echo the applause for the logotype!\n\nI might worry about the knocked-out type and rule breaking up or filling in, if you’re printing on an inkjet. I hope you’ve tried a few printouts already?\n\n"
    },
    {
      "time": " 10.Aug.2006 12.45pm",
      "content": "I think the white rule at the right is a bit heavy - not sure it’s necessary either.\n\n"
    },
    {
      "time": " 12.Aug.2006 9.22pm",
      "content": "Nothing wrong with gray, but a bold color might have more impact. Like the lowercase, but think the lower right type could be even smaller and url and email letterspaced a bit. I also agree about the rule; don’t think it’s necessary. Also, the leading looks a bit tight and uneven to me. The oldstyle figures provide more space above than the line above.\n\n"
    },
    {
      "time": " 14.Aug.2006 7.32am",
      "content": "Do you need the thick black border? It seems to weigh everything down. I’d try a version sans border.\n\n"
    },
    {
      "time": " 14.Aug.2006 8.52am",
      "content": "Thanks for the replies everyone. Concerning the weird spacing lower right...that’s just a product of the fact it’s a screenshot. I’ve already printed/trimmed about 100 and passed a good deal out at TypeCon this weekend. I’ll come back to this thread when I need to print more.\n\n"
    }
  ]
}
