{
  "id": "27538",
  "title": "help! MELIOR anatomy/history",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "hey guys,\n\nI need some information on the [Melior](http://web.archive.org/web/20090503072522/http:/www.typophile.com/wiki/Melior) typeface. ANYTHING about it; history on the typeface, anatomy, common places/businesses it is used. It is for a homework assignment that is due tommorow and google isnt helping me at all.\n\nany links or book recomendations would be greatly appreciated.\n\nThanks in advance!\n\n",
  "author": "<a href=\"/web/20090503072522/http://www.typophile.com/user/14172\" title=\"View user profile.\">cffy</a>",
  "time": "<br>",
  "uid": "14172",
  "comments": [
    {
      "time": " 8.Aug.2006 8.33pm",
      "content": "Dude, if you are going to get into design, you’ll have to learn at least 2 things: project management, & effective google use:\n\nfifth one down when I googled melior:\n\n[http://www.myfonts.com/fonts/linotype/melior/](http://web.archive.org/web/20090503072522/http:/www.myfonts.com/fonts/linotype/melior/ \"http://www.myfonts.com/fonts/linotype/melior/\")\n\n... from there you can google Herman Zapf, squared circle, Linotype, Newspaper fonts, & “melior font equivalents”. Drink some coffee, whack it all together, & you have a report. Next time give yourself some more time so you can enjoy & learn from the content.\n\nGood luck!\n\n"
    },
    {
      "time": " 9.Aug.2006 3.35am",
      "content": "there was a thread about melior (or supercurve-fonts, if i recall the name correctly, in general). for more effective search results on typophile, use the google-query (site:typophile.com “search term”) - without the brackets of course.\n\n"
    },
    {
      "time": " 9.Aug.2006 5.46am",
      "content": "thanks\n\nanyone know any popular usages of melior.\n\ni know queer eye uses the typeface...anymore?\n\n"
    },
    {
      "time": " 9.Aug.2006 7.02am",
      "content": "I’ve never used Melior myself but they say it doesn’t work for long texts (like books) but looks great in short ones. X-height is kind of large, so good legibility of the letterforms, but requires more leading for body text.\n\nI think it has kind of a friendly, slightly old-fashioned feel to it, sort of like Souvenir or Cheltenham, but maybe that’s just me. It feels very 70s somehow. Somebody who was old enough to experience that decade will probably find it attractive and familiar.\n\nMelior is based on the “super-elipse” (a squared-off elipse) which was advocated by a Danish poet called [Piet Hein](http://web.archive.org/web/20090503072522/http:/en.wikipedia.org/wiki/Piet_Hein_%28Denmark%29) who thought it was the most beautiful of all forms and spent a lot of time talking about it. He thought it should be used in everything from furniture to city planning. Maybe the designer took a clue from him?\n\n"
    },
    {
      "time": " 9.Aug.2006 7.06am",
      "content": "[http://www.linotype.com/2574/fontsofhzapfpart1.html](http://web.archive.org/web/20090503072522/http:/www.linotype.com/2574/fontsofhzapfpart1.html \"http://www.linotype.com/2574/fontsofhzapfpart1.html\")\n\n[http://designers.linotype.com/hermann-zapf/](http://web.archive.org/web/20090503072522/http:/designers.linotype.com/hermann-zapf/ \"http://designers.linotype.com/hermann-zapf/\")\n\nTim\n\n"
    },
    {
      "time": " 9.Aug.2006 7.09am",
      "content": "One example of use: the Univerity of Oregon. Also, the North Carolina Central University. Something about it says “University”, appearantly.\n\n"
    },
    {
      "time": " 9.Aug.2006 7.14am",
      "content": "And the Swedish magazine [Kommunaktuellt](http://web.archive.org/web/20090503072522/http:/www.a4.se/artikel.asp?id=192&eng=) (Municipality News, news for people working for municipalities).\n\n"
    },
    {
      "time": " 9.Aug.2006 7.20am",
      "content": "You might also look at people using Verona as it’s very similar in spirit (cough\\*ripoff\\*cough). For instance, Swedish mobile phone operator [Tre](http://web.archive.org/web/20090503072522/http:/tre.se/).\n\n"
    }
  ]
}
