{
  "id": "27559",
  "title": "Advice, suggestion, critique these tables please",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "i am in the process of designing a book and i'm not so sure about what i have done with a few pages.\n\nthis particular section of the book contains quite a bit of tabular data and i could really use some feedback about how to improve the design.\n\nany suggestions as to how to make this all seem a little more legible, \"zippy\" or just visually interesting would be much appreciated.\n\nthe book dimensions are 6\"x9\".\n\n(i hope this is not too many pages, but i could really use your help).\n\nthanks!\n\ngregg\n\n ![](http://web.archive.org/web/20131018065648im_/http:/typophile.com/files/go116_6417.jpg)\n\n ![](http://web.archive.org/web/20131018065648im_/http:/typophile.com/files/go117_4236.jpg)\n\n ![](http://web.archive.org/web/20131018065648im_/http:/typophile.com/files/go121_4796.jpg)\n\n ![](http://web.archive.org/web/20131018065648im_/http:/typophile.com/files/go122_6434.jpg)\n\n ![](http://web.archive.org/web/20131018065648im_/http:/typophile.com/files/go124_5628.jpg)\n\n ![](http://web.archive.org/web/20131018065648im_/http:/typophile.com/files/go125_5947.jpg)\n\n ![](http://web.archive.org/web/20131018065648im_/http:/typophile.com/files/go126_6518.jpg)\n\n ![](http://web.archive.org/web/20131018065648im_/http:/typophile.com/files/go127_3942.jpg)\n\n",
  "author": "hereandthere",
  "time": "9 Aug 2006 — 4:25pm",
  "uid": "5823",
  "comments": [
    {
      "time": "9 Aug 2006 — 5:21pm",
      "content": "I'm questioning the indent on the paragraphs.\n\nYou might look at lighter numbers in the listed tables. Put emphasis on the name and stat.\n\n"
    },
    {
      "time": "10 Aug 2006 — 12:57am",
      "content": "As a rule, all figures should be alligned right.\n\nI think it has something to do with traditional adding up of numbers before the time of calculators and such.\n\n"
    },
    {
      "time": "10 Aug 2006 — 12:58am",
      "content": "On the world abortion Lawas page, it would look a lot smoother if all the columns alligned, they seem to just around a lot right now which makes the page a little messy.\n\n"
    },
    {
      "time": "10 Aug 2006 — 1:04am",
      "content": "Sorry for all the seperate posts, just noticing things as I go along,\n\nOn the Crime pages, all the numbers are marked with an asterix, information design is all about making the information as simple as possible, and getting rid on any unnecessary information. As every number is marked it would probably be a wise thing to mention in the text somewhere that all these figures represent per 1000 people rather than having an asterix beside them all.\n\nThe same goes for the percentage symbol on the Canabis Use page, you could mention that these figures represent a percentage, maybe in a small text just below the table.\n\nM\n\n"
    },
    {
      "time": "10 Aug 2006 — 2:27am",
      "content": "thank you very much!!  \ni really appreciate the suggestions!!\n\n"
    },
    {
      "time": "10 Aug 2006 — 2:38am",
      "content": "Rather than align right I would align on the decimal point as per the righthand column of the burglaries table.  \nTim\n\n"
    },
    {
      "time": "10 Aug 2006 — 3:52am",
      "content": "what is the best way to align on the decimal point - would you suggest tabs?\n\n"
    },
    {
      "time": "10 Aug 2006 — 4:06am",
      "content": "What software are you using to set it?  \nIn Quark, Illustrator and Indesign there are a variety of tabs which give the option to align on a character. I think the symbol for this is approximately the same in each piece of software, a downward pointing arrow next to an asterisk or point.\n\nTabs are certainly be the way to go though.  \nTim\n\n"
    },
    {
      "time": "10 Aug 2006 — 5:03am",
      "content": "good thought on the aligning with decimal points, but that will result in a ragged line on both sides of the figues. As the difference is so minimal it might look a little wierd, almost a printers error when it goes to print, i guess you have to make a judgement call, both sides of the figures ragged, or a slightly ragged decimal point, both very minimal, I personally would be ok with a little ragged point.\n\nBut thats just me\n\n:}\n\n"
    },
    {
      "time": "10 Aug 2006 — 7:05am",
      "content": "Aligning on the decimal point is a good idea. And, like Matt said, put the asterisk notation in the copy, and drop the asterisks themselves. If every datum has the same measurement / unit, there's no point in putting the asterisk on every line.\n\nAlso, I'd drop the indent a little bit, and I'd make the titles to the different sections (\"High Crimes and Punishments\") flush left.\n\nAlso, you're splitting the key on pages 121 and 122. I'd try to have those on the same spread, if at all possible. Otherwise, there's a bit of a break between the usage of the key and the key itself.\n\nI really like the faded graphics. That's a nice touch.\n\n"
    },
    {
      "time": "10 Aug 2006 — 7:33am",
      "content": "Ilike the cannibis graphic, not because it is this but because it is almost a symbol against what the book is on about. The symbol itself has been outlawed in god knows how many schools, on t shirts it is frowned upon, so to include it in the book is a nice touch.\n\n"
    },
    {
      "time": "10 Aug 2006 — 8:26am",
      "content": "As stated, decimal numbers need to be aligned on the decimal. You may also want to see how it looks using lining numerals.\n\nThe indents bother me too. Indents are used to separate one paragraph from the previous one. However, if there is only one paragraph, there's no need to indent it. (So, all that said, don't indent the first paragraph in a block of paragraphs).\n\nThe colored boxes are a bit bold. I'd maybe fade them out a tad more. Personal preference would also be to give the boxes a bit of padding around the edge and the type. Give the type a bit of room.\n\nAlso, it would probably be ambitious, but a lot of this data looks suited for a presentation via maps.\n\n"
    },
    {
      "time": "10 Aug 2006 — 8:49am",
      "content": "Look at bumping up your headlines and subheads by just a few points. They look a bit lost. The \"arrow\" symbols are standing out more than the copy, maybe fade those back a bit or reduce in size? By the way, .pdf files would be more helpful. It's tough to really see these pages clearly.\n\n"
    },
    {
      "time": "10 Aug 2006 — 5:28pm",
      "content": "charlie, re: pgs 121 & 122 - i agree with you. i really don't like splitting the key, but i don't know what else to do to make the key fit on the same page. the copy in the chart is 9pt and even if i went down to 8pt, it would still not fit on one page. any ideas?\n\nre: paragraph indents - is there a way for InDesign CS (3.0.1) to automatically not indent the first paragraph? i can't seem to find anything in paragraph styles. or is this something that has to be done manually?\n\n"
    },
    {
      "time": "10 Aug 2006 — 11:20pm",
      "content": "Watch for spelling or grammar errors as well. I noticed \"earth\" (usually capitalised when referring to the planet instead of soil) and \"caucasion\" upon first glance. There may be more.\n\n- Lex\n\n"
    },
    {
      "time": "11 Aug 2006 — 6:57am",
      "content": "On your two column tables the white area around the number on the righthand column appears not to be equal on each side.\n\nI'm not totally conversant with InDesign but I expect you would have to make two paragraph styles one for first para and one for subsequent paras or manually amend each first para. For the key I would also use a tab to make a smooth vertical edge between the symbol and copy.\n\nTim\n\n"
    },
    {
      "time": "12 Aug 2006 — 11:17am",
      "content": "As others are suggesting, there are a variety of spacing and alignment issues, but the primary \"problem\" with the samples in general is an overall \"cold\" design: that is, the design feels really static, uninviting, mechanical. This is partially due to the all-sans type, but equally tied to a strangely rigid yet chaotic layout. The various content types feel forced into place, rather than feeling as though they're exactly where they should be, likely due to too many different alignment points that are competing with each other.\n\nTo me, the stand-out bugs are the poorly padded/spaced boxes on 121, and the mess of 122, but these are just examples of a fairly pervasive situation throughout the document.\n\n"
    },
    {
      "time": "12 Aug 2006 — 4:29pm",
      "content": "What are some good books on designing things like this? Tabular data etc? I just got an edwarde tuft book but not sure if it is what i want.\n\n"
    },
    {
      "time": "12 Aug 2006 — 8:29pm",
      "content": "jason,\n\nyou are right. i think, as is too often the case, my book design often feels static and mechanical.  \nusually, the only other people to see the design before the book is published are the clients. i wish i had peers locally with whom i could show pages, but i don't know how to go about finding anyone. it would be so helpful for me to get critiques from experienced book designers. it somehow seems unreasonable to post all my questions/problems on typophile - because i usually so have many!\n\ni have a number of books on typography & design, among them:\n\n_the elements of typographic style  \nstop stealing sheep…  \nthinking with type by ellen lupton  \ndesigning books by joost hochuli & robin kinross  \nplus various designer monographs_\n\nvery often, i will understand what i am reading, but when it comes time to put it into practice i find that i often need more concrete or specific examples to really help me.  \nbringhurst, is of course really good, but there is a lot of information there to retain.\n\nhaving said that, the samples i posted were the most problematic i thought. i've never really had to work with tabular data before and i really did not know what to do. even technically i was confused - sometimes i used tables and sometimes i just used tabs within my normal body copy formatting. it does seem like a bit of a mess.\n\nit is too late in design process to radically change things, but i am posting some samples from other chapters of the book for reference and if you see anything else that seems glaringly awful, please let me know.\n\nthe book is a guide for aspiring american expats and explains everything one needs to know to get out of the U.S. and live and work abroad. the light blue text boxes contain accounts from americans who have already expatriated.\n\none thing that i would definitely like advice about is the font used for URLs. i am currently using knockout cruiserweight, but i don't think it works too well.\n\ni really appreciate everyone's advice!\n\n ![](http://web.archive.org/web/20131018065648im_/http:/typophile.com/files/go88_5308.jpg)\n\n ![](http://web.archive.org/web/20131018065648im_/http:/typophile.com/files/go102_4022.jpg)\n\n ![](http://web.archive.org/web/20131018065648im_/http:/typophile.com/files/go172_5649.jpg)\n\n ![](http://web.archive.org/web/20131018065648im_/http:/typophile.com/files/go190_4807.jpg)\n\nPDFS here:\n\n[http://betweenhereandthere.com/clients/download/go88.pdf](http://web.archive.org/web/20131018065648/http:/betweenhereandthere.com/clients/download/go88.pdf \"http://betweenhereandthere.com/clients/download/go88.pdf\")  \n [http://betweenhereandthere.com/clients/download/go102.pdf](http://web.archive.org/web/20131018065648/http:/betweenhereandthere.com/clients/download/go102.pdf \"http://betweenhereandthere.com/clients/download/go102.pdf\")  \n [http://betweenhereandthere.com/clients/download/go172.pdf](http://web.archive.org/web/20131018065648/http:/betweenhereandthere.com/clients/download/go172.pdf \"http://betweenhereandthere.com/clients/download/go172.pdf\")  \n [http://betweenhereandthere.com/clients/download/go190.pdf](http://web.archive.org/web/20131018065648/http:/betweenhereandthere.com/clients/download/go190.pdf \"http://betweenhereandthere.com/clients/download/go190.pdf\")\n\n"
    },
    {
      "time": "12 Aug 2006 — 8:35pm",
      "content": "i don't know what happened with those links  \nsorry\n\n"
    },
    {
      "time": "13 Aug 2006 — 11:30am",
      "content": "Page 103 of the new samples, to my mind, is a good example of the problem. There is a rigidity to the page, and yet each element still feels like it's floating. What compounds the issue is, as others have mentioned, the indenting. I'm not entirely sure why you've indented your heads/subheads, and in general your indent looks too deep (especially considering how many one-line paragraphs you have to work with).\n\nBe careful, however, in taking my comments too much to heart. For instance, my advise on your list of books would be to throw _Stop Stealing Sheep..._ in the garbage. I evaluated a copy a couple of years ago for possible use in my class (I teach publication design) and found myself cringing at each spread. That book seems an incredibly efficient way to totally mess up new students of typography. Beyond that, I'm fairly conservative in my typographic tastes, which in this case speaks to my comment on the all-sans setting, which to me is sort of like setting a table with steel cutlery, steel plates and steel glasses. Utensils (like captions) are built for utility, but plates and tumblers should combine function and form: they should not only hold your food and drink, but should add visual flavour as well. On the table this might mean anything from classical china and crystal to chipped and much-loved stoneware, but in either case the setting has personality. All-sans, however, is sort of like an entire table setting of shiny metal: clean, sleek and simple, but also cold, bland and lifeless.\n\nBut you've already conceded this point, so I'm really just indulging myself here. My apologies.\n\nAs for concrete suggestions, I'd remove the indents from the heads/subheads and maybe find a different face for these, something with a bit of personality that will contrast well with the body type. And reduce the depth of the indents across the board. As for the boxes, try something as simple as adding rounded corners, and make sure you have some padding added in every box (note the bottom of your boxes on 121).\n\n"
    },
    {
      "time": "13 Aug 2006 — 4:38pm",
      "content": "Ahh well I think stop stealing sheep is still a good resource even if the spreads are bad it has some good info. I just wish I read that before I read bringhursts book. After reading Elements, stop stealing sheep doesn't add a lot of knowledge. I think the same with Thinking With Type.\n\nBut I'm not really looking for a typography book but a book on information design. I bought one so ill see how it turns out\n\n"
    },
    {
      "time": "13 Aug 2006 — 6:21pm",
      "content": "j\\_polo9\n\nI think the best (high-end) books on information design would be those put out by [Edward Tufte](http://web.archive.org/web/20131018065648/http:/www.edwardtufte.com/tufte/books_vdqi), although they're a bit heavy both in weight and content. (There are a few of them, so explore the linked page a bit.) They're the equivalent of Bringhurst to typography for information design, so you might want to take a look.\n\n"
    },
    {
      "time": "14 Aug 2006 — 5:23pm",
      "content": "Ahh thanks. That's what I had heard and I purchased Envisioning Information a few days ago but I wasn't sure if his books were more geared towards graphs or whatnot. Kind of hard to tell from the descriptions on amazon lol.\n\n"
    }
  ]
}
