{
  "id": "27551",
  "title": "A new sign as an abreviating for `www´?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hai,\n\nWhenever there is a URL to be typeset I get really annoyed by the three W´s. Those characters will never space nicely and they don´t give any information anyway. So therefore I thought of a new sign, a new character, to replace `WWW´. And it looks like this\n\n ![](http://web.archive.org/web/20131017031945im_/http:/typophile.com/files/world%20wide%20web%20character_4957.gif)\n\nAnyone in favor of adding a new sign to the world? Any suggestions are more than welcome!\n\nCheers,\n\nTijs Krammer  \n(The Netherlands)\n\n",
  "author": "Tijs Krammer",
  "time": "9 Aug 2006 — 8:49am",
  "uid": "14182",
  "comments": [
    {
      "time": "9 Aug 2006 — 8:57am",
      "content": "You're not the first: I think there was a whole thread about these before...  \nSomeone'll dredge up the link, I'm sure.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "9 Aug 2006 — 9:11am",
      "content": "Well I don't about anyone else but I love this idea. Saves spaces and looks good.\n\nMikey\n\n"
    },
    {
      "time": "9 Aug 2006 — 12:35pm",
      "content": "I thought about these things tooo.  \nThere are a lot of new \"afkortingen\"(shortings?\" in modern communication which could be replaced bij somekind of \"ligature\". What about 'fax', 'tel' or perhaps even labels on forms and businesscards 'name', 'Adress', 'Country'. What happens in other languages? Are there any Japanese or Arabic solutions to this?\n\n"
    },
    {
      "time": "9 Aug 2006 — 12:38pm",
      "content": "_\\> [typophile.com/node/12949](http://web.archive.org/web/20131017031945/http:/typophile.com/node/12949)_\n\n[Dav](http://web.archive.org/web/20131017031945/http:/www.dav.name/)\n\n"
    },
    {
      "time": "12 Aug 2006 — 1:42pm",
      "content": "Thanks for the thread. Very interesting. But everybody's writing nice options without much real visual proposals. The large W with the two small w's beside is nice, but not a serious option in my view, because it takes up too much space. A W combined with a 3 is a thought, but remember that people should always have the option to use three w's instead of the new sign.\n\nOne of the comments had me thinking. Wouldn't it be a nice idea to use a very simple globe as a sign for the world (!) wide web?\n\nCheers\n\n"
    },
    {
      "time": "13 Aug 2006 — 5:43am",
      "content": "Tijs,\n\ni am not a big fan of the clumsy 'www' either, yet instead of finding a replacement i've just started dropping this useless bit of info from all stationary etc that i designed. If you set contact info, it is just so obvious isn't it? ie. if it says typophile.com , what else then a web address could it be?\n\nSeb\n\nPS\\> Although your www ligature is visually quite pleasing ;)\n\n"
    },
    {
      "time": "13 Aug 2006 — 8:08am",
      "content": "Tijs:\n\nYour www figure is brilliant. Granted, I agree with seb's comment that we can simply drop the www and go with the straight \".com\" name and not miss a beat. But in those cases where \"www\" is required I think your ligature will work beautifully. This should be implemented into font character sets. Heck, it's not only functional and clear, but it also looks very stylish.\n\n"
    },
    {
      "time": "13 Aug 2006 — 2:39pm",
      "content": "Seb,\n\nThanks for your reply.\n\nThe temptation to leave out www is indeed present. But still it has a function. It is indicating that a web adress is following. Just like the at-sign is always a part of an email adress and immediately recognisable. Therefore a single character might even be stronger than three characters.\n\nAnyone still interested in the sans version? (I chose Frutiger for this purpose.)\n\n"
    },
    {
      "time": "13 Aug 2006 — 3:56pm",
      "content": "Hi Tijs\n\nYour proposal makes sense to me; if we can do this for currency signs like the euro, then why not for more frequent glyphs like communication symbols. Rather than creating a specific sans and serif version, you might consider publishing guidelines for how people can make this glyph in any font they are developing...\n\n"
    },
    {
      "time": "13 Aug 2006 — 4:37pm",
      "content": "I did some experiments on this with [Sofa](http://web.archive.org/web/20131017031945/http:/typophile.com/node/17136), but I'm not sure if I should include them in a final release of the font. At the moment, they are mere drafts to find out what could be done.\n\nI like your design, it is really short and works well despite it is a new sign. (I doubt it would work for Sofa, as with equal stroke-weight, everything gets very claustrophobic fast...)\n\n ![](http://web.archive.org/web/20131017031945im_/http:/typophile.com/files/www_3593.png)\n\n"
    },
    {
      "time": "14 Aug 2006 — 7:27am",
      "content": "\"It is indicating that a web adress is following. Just like the at-sign is always a part of an email adress and immediately recognisable.\"\n\nVisually, I agree, though technically speaking, this isn't necessarily true.\n\nAn email address must have an @ sign.\n\nA URL doesn't have to have the www at all, and, these days, most competant sysadmins know enough not to require the www to get to one's web site.\n\nAs such, I'd agree that the solution to the problem is to just drop the www altogether. I think the presence of a .com/org/net/etc is enough to clearly indicate a URL these days.\n\n"
    },
    {
      "time": "15 Aug 2006 — 11:13pm",
      "content": "Sebestian:\n\nNice sketches. Thanks. Looking forward to your new font.\n\nAlumin:\n\nYou are right. URL can indeed exist without the 'www'. But as far as I know most top level URLs, the ones mentioned on ads, do start with 'www'.\n\nAnyway, the sign might still help in saving space and also help in making it look a little better.\n\nTo find out if the sign would still work on a sans font, I did a Frutiger version. It might look like this, though I'm not complete satisfied, because the inner w's do not have the same nice proportions as in the serif version.\n\n ![](http://web.archive.org/web/20131017031945im_/http:/typophile.com/files/www%20charachter%20sans_4558.gif)\n\nCheers\n\n"
    },
    {
      "time": "16 Aug 2006 — 7:16am",
      "content": "\"But as far as I know most top level URLs, the ones mentioned on ads, do start with ‘www’.\"\n\nThat's a completely arbitrary thing most of the time. It's just an old habit. And if the old habit is 'ugly' then the solution, IMHO, is to drop it. And I do see a lot more folks dropping the www. in their marketing. Off the top of my head, my 4 year old walks around the house singing 'pbs kids dot org' each morning.\n\nNot that this isn't an interesting challenge. It is, and is fun, but I'm not sure how practical it actually is in real world use. Is it more useful to have an odd looking glyph that might take a second look to fully understand or to just drop it altogether?\n\n"
    },
    {
      "time": "16 Aug 2006 — 10:44am",
      "content": "[http://typophile.com/node/16343](http://web.archive.org/web/20131017031945/http:/typophile.com/node/16343 \"http://typophile.com/node/16343\")\n\nTim\n\n"
    },
    {
      "time": "16 Aug 2006 — 2:37pm",
      "content": "Alumin:\n\nBut isn't it true that for example \"typography.linotype.com\" might exist alongside \"www.typography.linotype.com\"? In that case the \"www.\" is essential.\n\n"
    },
    {
      "time": "16 Aug 2006 — 3:14pm",
      "content": "As I just mentioned in another thread\\*, my ideal would  \nbe Sebastian's bottom-right attempt. Many of the other  \nones here are way too cluttered.\n\n\\* [http://typophile.com/node/21340](http://web.archive.org/web/20131017031945/http:/typophile.com/node/21340 \"http://typophile.com/node/21340\")\n\nhhp\n\n"
    },
    {
      "time": "17 Aug 2006 — 7:13am",
      "content": "\"But isn’t it true that for example “typography.linotype.com” might exist alongside “www.typography.linotype.com”? In that case the “www.” is essential.\"\n\nanything.yourdomain.com is fine.\n\nso, yes, you can have both\n\ntypography.linotype.com  \n [www.typography.linotype.com](http://web.archive.org/web/20131017031945/http:/www.typography.linotype.com/ \"www.typography.linotype.com\")\n\nand have them point to different web sites. In which case, yes, you'd have to have the www for one of them and not the other.\n\nSome site still require the www. as without it, their domain points at a completely different site. However, I'd say that is defintely the exception these days and is bad practice.\n\nAgain, I'm merely speaking from a pragmatic usage standpoint. I still think the excercise in terms of typography is both fun and useful.\n\n"
    },
    {
      "time": "6 Aug 2007 — 10:57am",
      "content": "There is however one serious problem:  \nIf you replace three glyphs by one 'new' sign (which is quite easy in OpenType) links from within a PDF-file will start looking for _'U+F810'.typovar.nl_.  \nAnd what Unicode-value do we assign to the 'www'?  \nArjen\n\n"
    },
    {
      "time": "6 Aug 2007 — 11:53am",
      "content": "Besides that (I think) links are, like in HTML, stored separate from the text that links them. (Although, totally OT, I find it interesting that there can ever be a \"go back\" or \"up a level\" hyperlink, since by definition that's a hypolink)\n\nBut, if you name the glyph w\\_w\\_w then Adobe Reader will extrapolate that it's a ligature for the sequence of characters named w, w, and w. If you wanted to do a ligature for \"http://www.\", then you would name it  \n`h_t_t_p_colon_slash_slash_w_w_w_period` and the resulting text for copy and paste or other purposes would be as expected. If you named it \"weblig\" though, a copy and paste or whatnot will give garbled results.\n\nYou would assign a unicode value of -1, unless any of the psuedo-standards for the PUA include a glyph for it already, in which case I'd use that.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "7 Aug 2007 — 2:30pm",
      "content": "I'm going to try this, OK?  \nI didn't know Adobe Reader is so smart.\n\n"
    },
    {
      "time": "7 Aug 2007 — 2:56pm",
      "content": "OK, just made a quick try in Fontforge (draw 'w', draw 'w\\_w\\_w', create lookups (discretionary ligs, generate font, install...)  \nThings seem to work fine (I can see www being subst bij the 'www-sign'), but when I export as pdf, the www is not recognised as hyperlink. What did I do wrong?\n\n ![](http://web.archive.org/web/20131017031945im_/http:/typophile.com/files/www_test_6431.gif)\n  \nP.S. The other glyphs are Yanone Kaffeesatz (closest to 'www\\_test') \n"
    },
    {
      "time": "7 Aug 2007 — 5:58pm",
      "content": "What happens when you copy and paste the text into another doc from the PDF? Do you still have a \"www\" or is it something else?\n\nT\n\n"
    },
    {
      "time": "8 Aug 2007 — 10:44am",
      "content": "It appeared in notepad as [http://?.typovar.nl](http://web.archive.org/web/20131017031945/http:/typophile.com/?.typovar.nl \"http://?.typovar.nl\").  \nWhen I assign a hyperlink to the text in InDesign, any text will become a hyperlink and I believe then links and text are stored seperately.\n\n"
    }
  ]
}
