{
  "id": "2755",
  "title": "Movie title laziness...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was watching The Practice earlier, and during one of the commercials I started flipping through, like usual.   \n   \nI turned on TNT and it was at the beginning of a movie\n\n",
  "author": "kakaze",
  "time": "18 Jan 2004 — 8:35pm",
  "uid": "1977",
  "comments": [
    {
      "time": "18 Jan 2004 — 10:08pm",
      "content": "Queer Eye often uses Arial for captions.   \nI found it funny in a geeky sort of way.\n\n"
    },
    {
      "time": "19 Jan 2004 — 1:49am",
      "content": "You guys are making me homesick.   \n   \nEither I see Finnish movies. Or I see American movies dubbed into Finnish without subtitles.   \n   \nSo stop it already.\n\n"
    },
    {
      "time": "19 Jan 2004 — 3:22am",
      "content": "Fredrik,   \n   \n  ![:-)](http://web.archive.org/web/20150415181353im_/http:/www.typophile.com/forums/clipart/happy.gif)  \n   \nMaybe it's like Herring. You have to get used to the \"taste\"! I watched that (spelling) Moscow. The Reindeer Lord? Quite the flick. I heard that wolf song by that famous Laplander. I owned a wolf, he got old, walked away into the bush and died. The wolf song made me think Shylo came home. Dark as a coal mine these days. Do you get the Northern Lights where you are?   \n   \nYou are close, we should meet one of these days. I am not really as mean and nasty as I pretend. It's just my role. I am supposed to be a bitter old grump.   \n   \nI never used comic sans or courier when I did subtitles. One face they used lots of at BBC was Lanston's Globe Gothic. It got lots of use.   \n   \nWe have a Bruce Rogers face that was never completed. There was interest in having us complete it for a movie. I worked on lots movies, what a pain.\n\n"
    },
    {
      "time": "19 Jan 2004 — 4:49am",
      "content": "I guy from Suomi once asked me if i had a bottle opener. I opened his beer with a knife and his jaw dropped. He didn't know that trick, which made my jaw drop. One would think the Finnish knew all the knife tricks.   \nI remember very beautiful type in Finnish cemeteries though. And nicely raked patterns.   \n   \nGerald, I read your post as 'I have a Bruce Rogers face that was never completed' . (Interpreting 'face' as 'the part of your head that has the most openings' not 'typeface'.) Which is a very cool line.\n\n"
    },
    {
      "time": "19 Jan 2004 — 5:53am",
      "content": "When you get to be my age you get a bad case of lazy mouth.\n\n"
    },
    {
      "time": "19 Jan 2004 — 6:00am",
      "content": "BTW. When is 'Northern Lights Season'?   \nI've only been way up North in summer when it's day all the time.\n\n"
    },
    {
      "time": "19 Jan 2004 — 6:02am",
      "content": "How far away is Denmark?   \n   \nMaybe we should have gathering of northern typographers.\n\n"
    },
    {
      "time": "19 Jan 2004 — 6:09am",
      "content": "You again? ![:-)](http://web.archive.org/web/20150415181353im_/http:/www.typophile.com/forums/clipart/happy.gif) I am getting dizzy.   \n   \nNorthern lights, the spectacular season ends about the beginning of December. This year was cosmically out of this world. The sun was causing electrical disturbances.   \n   \nNot many northern lights in Summer. If there was you wouldn't see them. I read a book until four in the morning without any lights on.\n\n"
    },
    {
      "time": "19 Jan 2004 — 6:21am",
      "content": "Denmark's just around the corner. Just south of Norway and Sweden. A northern typorgraphers gig wouldn't be a bad thing.\n\n"
    },
    {
      "time": "19 Jan 2004 — 11:01am",
      "content": "Yeah, I see Microsoft's \"Internet\" faces used a lot in print.   \n   \nIt would be nice if they were available with a few more goodies -- display weights for the serif fonts, Light and Thin weights for the sans, and small caps and OSF, of course.   \n   \nSurely Microsoft, as one of the originators of OpenType, will be releasing OT versions of Georgia, Verdana, and Trebuchet, etc.?   \n   \nSimon, shall I start a petition?\n\n"
    },
    {
      "time": "19 Jan 2004 — 11:58am",
      "content": "\\> It would be nice if they were available with a few more goodies   \n   \nYeah. Comic Serif Demi OSF Antique.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Jan 2004 — 3:40pm",
      "content": "Speaking of impossible, how about a Multiple Master font between the axes of Comic and Chalk?\n\n"
    },
    {
      "time": "19 Jan 2004 — 4:30pm",
      "content": "\"Chris, I'm glad I'm not the only one that noticed that. I had to blink and look again. Maybe even sadder. I found this valentine's book with nice little thoughts set entirely in trebuchet. Too bad Vince doesn't get royalties on usage. Eh, Vince?\"   \n   \nI wish Trebuchet had a bigger family, I really like it a lot. Though I don't think I'd use it for a valentines day thing...it doesn't really scream love.\n\n"
    },
    {
      "time": "19 Jan 2004 — 4:44pm",
      "content": "What about a half of the movie posters using Trajan?. Maybe Trajan should recieve an Oscar... I wonder which type would win at Cannes.\n\n"
    },
    {
      "time": "19 Jan 2004 — 9:47pm",
      "content": "[http://news.bbc.co.uk/2/hi/europe/3410547.stm](http://web.archive.org/web/20150415181353/http:/news.bbc.co.uk/2/hi/europe/3410547.stm)   \nBut if you follow Finnish Formula-1 drivers as I do, this is really not shocking at all.   \n   \nhhp\n\n"
    },
    {
      "time": "20 Jan 2004 — 2:03am",
      "content": "There you have it. We hung a sign asking the dead to lie down so we could distinguish them from the living.   \n   \nAlcoholic comatose workers would sometimes become victims of premature burials. We had to take the sign down. Lanston actually did have a dead worker in its' office. Rather interesting story. Goudy happened to be at the plant and sent a memo to Sol Hess complaining about the smell. Apparently it was rather varnishy hot in Philadelphia. This was before the USA got bombed in Pearl Harbour. The fellow was an optical genius from Germany parked at Lanston (before my time, be kind now) when we were looking into photocomp. Remember brass was predictably going to be hard to find. I would love to tell the rest of the story but you will have to read the book.   \n   \nBut thanks for the tip Hrant.   \n [http://news.bbc.co.uk/2/hi/europe/3410547.stm](http://web.archive.org/web/20150415181353/http:/news.bbc.co.uk/2/hi/europe/3410547.stm)   \nI almost missed the end of the article.   \n_Finnish citizens pay among the highest taxes in the world, but enjoy one of the best welfare systems._  \n   \nI knew I was doing something wrong. I have been missing out on the _enjoy._   \n   \nSo we should have this Northern Typographers thinga-ma-jig. Maybe we should start an new thread??   \n   \nI had always welcomed _movie title typography._ We only did several but we set and printed many _dummy newspapers._ I had to invent all manner of headlines and advertisements. One ad I wrote had a rather bold headline.   \n   \n**Wet Nurse Needed**   \n   \nThey shot the scene. I must report, _movie directors_ have very good lungs.   \n   \nWhen I saw the movie I must admit my face was red as a beet.   \n   \nIn any event I found the workings for the Bruce Rogers' face, I wonder if I should finish it. There are missing characters. A good job would be when you could not tell who did what. But the face is not without its' charms. It would make a great movie title face for the right movie.\n\n"
    },
    {
      "time": "20 Jan 2004 — 2:18am",
      "content": "Actually I live in the middle of the Baltic Sea. Deeper than the usual swamp. I am in the Swedish speaking Archipelago.   \n   \nBut otherwise, yes!\n\n"
    },
    {
      "time": "29 Jan 2004 — 1:25pm",
      "content": "Count me as one in the new founded Northic Type Congress ;-)   \n   \nNicolaj - another Dane\n\n"
    },
    {
      "time": "19 Jan 2004 — 7:23am",
      "content": "Count this Stockholmer in! Maybe a new thread is in order...\n\n"
    },
    {
      "time": "19 Jan 2004 — 8:24am",
      "content": "Chris, I'm glad I'm not the only one that noticed that. I had to blink and look again. Maybe even sadder. I found this valentine's book with nice little thoughts set entirely in trebuchet. Too bad Vince doesn't get royalties on usage. Eh, Vince?\n\n"
    }
  ]
}
