{
  "id": "27569",
  "title": "Personal Logo... and Type",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Starting to build a look/feel for my portfolio website. The attached image shows the latest version. One of my best friends (also a designer) commented that the ’dm’ logo and the “Dylan...” custom type compete instead of compliment each other. He suggested that I scrap the custom type and just spell out my name using a sans serif such as the one used in the navigation (which is House’s United ’face.)\n\nDo you agree that a simpler typeface like United would be a better visual compliment to the ’dm’ mark? Or should I keep this custom type solution?\n\nTypophiles, what say ye?\n\nThanks,\n\nDylan\n\n ![](http://web.archive.org/web/20080118115438im_/http:/www.typophile.com/files/home_v3_lo5_LAYERS_3465.jpg)\n\n [‹ :: ambigram critique ::](http://web.archive.org/web/20080118115438/http:/www.typophile.com/node/8667 \"Go to previous forum topic\") [Integration ›](http://web.archive.org/web/20080118115438/http:/www.typophile.com/node/30443 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080118115438/http://www.typophile.com/user/1022\" title=\"View user profile.\">dylan</a>",
  "time": "<br>",
  "uid": "1022",
  "comments": [
    {
      "time": " 10.Aug.2006 3.38am",
      "content": "I love the custom type, but I do agree that it really does compete with your logo, which is better than the type.\n\nWhat about setting your name in United, too?\n\nYou could keep the custom type elsewhere, perhaps, like in the “WELCOME” and”LOOSE SKETCHES”\n\n"
    },
    {
      "time": " 10.Aug.2006 4.04am",
      "content": "I love the custom font. Think changing it to United will ruin it. Don’t be bullied into turning your signature into a corporate logotype. However, I would give thought to descending Y and ascending which may be the things that are starting to competing with the dM device. Have you considered a different colour for the dM? eg gold/yellow #FFCC00 which will help the dM not be outplayed by ’DYLAN MENGES’ logotype.\n\n"
    },
    {
      "time": " 10.Aug.2006 8.31am",
      "content": "I think both the type and the logo are great. Do they compete? Maybe...so just separate them on the page more.\n\n"
    },
    {
      "time": " 10.Aug.2006 2.02pm",
      "content": "Great feedback, everyone. Thank you for weighing in. I’m still a bit torn as to how to finish this ’problem.’ My gut check on this is still not quickly answering one approach or the other, although, if you put a gun to my head and said ’decide’...I think I would let the logo be curvalinear and leave the type more formal. Let the other subheads do the hand-drawn work. That’s where I’m at.\n\nAnyone else care to weigh in? As I mentioned in my other thread about this logo (see Personal Logo), putting the work in front of you maniacs is a sort of final review, as I highly respect the talent that surges through these forums.\n\nAgain, thank you.\n\n"
    },
    {
      "time": " 11.Aug.2006 10.54am",
      "content": "Here’s what I’ve set today: one of House’s United weights. Color matches the green of the shirt.\n\n ![](http://web.archive.org/web/20080118115438im_/http:/www.typophile.com/files/home_v3_lo5_LAYERS_4315.jpg)\n\n"
    },
    {
      "time": " 12.Aug.2006 6.00am",
      "content": "Darrel made a good point separate the hand lettering from the mark, or letter your name in a similar style of the m, not in the 3d form of your logo perhaps (although you could use the M in the centre as a coner with the other characters leading off). I feel that since the masthead is the first thing that will be seen you should show your talents there.  \nTim\n\n"
    },
    {
      "time": " 15.Aug.2006 12.25pm",
      "content": "Dylan, one thing you might consider is having your mark in white and the type in the darker red. I’d also consider scaling the mark a bit larger and the type a bit smaller. The mark is great and I’d let it shine more.\n\n"
    },
    {
      "time": " 16.Aug.2006 10.29am",
      "content": "Thanks, Miss T.\n\n"
    },
    {
      "time": " 22.Aug.2006 6.28am",
      "content": "New header with type treatment. Tiffany’s suggestions in full effect, yo!\n\n ![](http://web.archive.org/web/20080118115438im_/http:/www.typophile.com/files/home_20august_6644.jpg)\n\n"
    },
    {
      "time": " 22.Aug.2006 6.46am",
      "content": "woohoooo.. that’s it.. I’D make the flames behind the head less visible.. maybe colour them in a dark red again..\n\n"
    },
    {
      "time": " 22.Aug.2006 10.39am",
      "content": "Do you like the result, Dylan? I think it works. I’d also echo Mike’s remark about the flames. One color, zero blend, dark red ... maybe?\n\n"
    },
    {
      "time": " 22.Aug.2006 10.39am",
      "content": "... Or go back to your original color in the first post.\n\n"
    },
    {
      "time": " 4.Jan.2007 8.33am",
      "content": "Any updates on this? I’d love to see the finished product!\n\n"
    },
    {
      "time": " 11.Jan.2007 8.38am",
      "content": "Shelved this project for the past several months...that self-promo work always gets kicked into a dusty corner.\n\nShelved but not abandoned...stay tuned, and thanks for asking, Chris.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nBuild a man a fire, and he’ll be warm for a day.  \nSet a man on fire, and he’ll be warm for the rest of his life.\n\n"
    }
  ]
}
