{
  "id": "27599",
  "title": "Free Fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Does anyone know of any sites where you can download good, free fonts? I need one for a logo, it's for a college organization so we can't afford to pay for one.\n\n",
  "author": "<a href=\"/web/20100513173347/http://typophile.com/user/9308\" title=\"View user profile.\">ChroniX</a>",
  "time": "<br>",
  "uid": "9308",
  "comments": [
    {
      "time": "",
      "content": "Design a custom typeface for the logo?\n\n"
    },
    {
      "time": "",
      "content": "[[FAQ\\_Free]].\n\nDav\n\n"
    },
    {
      "time": "",
      "content": "I wouldn't know where to start and it would probably turn out awful.\n\n"
    },
    {
      "time": "",
      "content": "Try to design a typeface and post it on Typophile. We can help you.\n\n"
    },
    {
      "time": "",
      "content": "I really don't know where to start with designing one. I tried to do it a while back and got no-where.\n\n"
    },
    {
      "time": "",
      "content": "Hey, go for it. It's just a few letters for the logotype. Anyone could try that ;-)\n\nGood luck!\n\n"
    },
    {
      "time": "",
      "content": "What is the organisation, what kind of look do you want for it, what are you going to use the logo for (web/print/t-shirt &c.)?  \nTim\n\n"
    },
    {
      "time": "",
      "content": "The group will run a college radio station, hold live music events, have student websites etc. basically anything 'media' related, so the logo would be used on videos, web, print and possibly t-shirts. We don't want horrible logos or fonts you usually get with things like this. The look should be a professional/corporate style.\n\n"
    },
    {
      "time": "",
      "content": "Maybe restrict yourself some of the fonts that come freely bundled with a PC or Mac? They'll give you a reasonable range of letterforms to base a logo on, especially on the Mac. If you're using a package like Creative Suite that comes bundled with a fairly decent collection of additional fonts.\n\n"
    },
    {
      "time": "",
      "content": "Notice how nine or ten people replied, and not one gave you a source for free fonts? Most of the people here are professionals, and know that some (not all or even most) free fonts can be defective and cause software to malfunction.\n\nI have heard dozens of stories of people downloading hundreds or thousands of free fonts and discovering that Photoshop or other programs no longer will load. All it takes is one badly built font. And finding the bad one in 100 is a chore. Finding it in 1000 or more is a ridiculous amount of work, and would make you sorry that you didn't spend $22 or more to buy a quality font.\n\n"
    },
    {
      "time": "",
      "content": "I do have CS but there aren't any that I can see being any good as a logo.\n\n"
    },
    {
      "time": "",
      "content": "We would love to be able to buy a good font and there are a lot we have looked at, some fairly cheap and others a little more expensive, like FF Cocon, Info Display and FS Sophie, but we just can't afford to buy any we like, so we have no choice but to try and find a good free font until we can afford to buy one. I have tried designing a font before and got no-where, as well as taking an existing font and trying to customize it, but that turned out awful.\n\n"
    },
    {
      "time": "",
      "content": "Don't be lazy, design the stuff, post it here and you will recieve profesional critique and advice.\n\nYou can look at all comercially available fonts online as a reference, if you want to look at a particular style ask for it and someone will offer links.\n\nEven if you had the money, if you only want the font for a single logo it would be a pricey adquisition.\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "Dean,\n\nHave a look at MRF and see if you find anything you like? If so I'm willing to discuss some student discount. As you can see we're a friendly community here, and we want to help ;-)\n\n[Http://www.macrhino,com](Http://www.macrhino,com \"Http://www.macrhino,com\")\n\n"
    },
    {
      "time": "",
      "content": "OK, I'll give designing a font one last go.\n\n"
    },
    {
      "time": "",
      "content": "Thanks a lot. I'll have a look but I'll give designing one another try first.\n\n"
    },
    {
      "time": "",
      "content": "Dean,\n\nTo clarify; It's ok with me if you find some of my typefaces as a start and then modify the letters which you need for the logotype. This is almost standard procedure. ;-)\n\nGood luck anyway, cheers\n\n"
    },
    {
      "time": "",
      "content": "\"and know that some (not all or even most) free fonts can be defective and cause software to malfunction.\"\n\nLet's not start spreading FUD about this.\n\nFree fonts are fine. There are some very good ones, actually (see the link to the WIKI above). Of course, there are infinitely more good commercial fonts...many quite affordable.\n\nHowever, we need to know more about what you are looking for before we could even begni suggesting anything specific. You said 'corporate'. That, alone, isn't a whole lot to go off of. Lot's of corporations use Helvetica and Times which came with your machine. If you're looking for something else, try to give us a bit more info if you can as to what you are specifically looking for.\n\n"
    },
    {
      "time": "",
      "content": "I've tried to sketch things and ehhh they suck lol  \nI got an 'n' and a 'c' trying to base them very roughly on the C4 font (which I love)and it looks nothing like it what-so-ever.\n\nI think I best just leave it and look for an existing font. It would be far easier and I'd get something decent.\n\n ![](http://web.archive.org/web/20100513173347im_/http:/typophile.com/files/Picture%2011_6256.jpg)\nJust to prove how bad and how much I should leave it. :D\n"
    },
    {
      "time": "",
      "content": "Sketches are rough by nature, take a screen shot of a font you would like as reference, print it and trace over with transparent paper to start.\n\nAny way I think you are being too lazy.\n\nHéctor\n\n"
    },
    {
      "time": "",
      "content": "Try [http://www.alvit.de/blog/article/20-best-license-free-official-fonts](http://web.archive.org/web/20100513173347/http:/www.alvit.de/blog/article/20-best-license-free-official-fonts \"http://www.alvit.de/blog/article/20-best-license-free-official-fonts\")\n\nI have most of those. I use the serifs to set college papers, as I hate to use times new roman, and I have no money to spend on expensive fonts. I would if I could.\n\n"
    },
    {
      "time": "",
      "content": "Hello:\n\nActually your drawing is not that bad... keep going- keep perfecting. Push comes to shove: the 'rough/irregular' look is highly desirable these days. But if its not working for you, try it once or twice more, then you need to move on to modifying exsisting type so you don't fail the assignment or run out of time. If you simply don't have the money that's okay. There are good free fonts out there but you have to look. FontShop being no. 1 on the list. And I would definately check out Maniakers. Look at the (mentionaed) Free faq on typophile. Also you need to have the concept down first. That will help. So when you go font hunting you know what to look for.\n\nBTW...Don McCahill your comments are so false. There are many excellent free fonts out there. You just have to look (sometimes really hard). FontBook (or other 3rd party utility) checks for errors and stops you from installing bad fonts so that argument is out... you are using Mac OS X right? If your 'friends' are unwise enough to install hundreds or thousands of fonts (free or otherwise), have them all activated, and not even validate them they must NOT be a professional.\n\nMike Diaz\n\nPS... Also I think Stefan H (MacRhino) is awesome for offering a discount- I think thats very nice of you guy!\n\n"
    },
    {
      "time": "",
      "content": "samadam\\> great link!!! thanks... Mikey\n\n"
    },
    {
      "time": "",
      "content": "I'm on a PC :( so I can't use the fonts on MRF, very thankful for the offer thoough. I've had Lacuna for a while and I like the shape of the italic characters, but not the fact they're in italics, the shape of the 'y' etc. I think I'll try and change a few of them and use that.\n\n"
    },
    {
      "time": "",
      "content": "Lacuna comes with a regular as well as italic, what software are you using to make your logo.  \nbtw Stefan's fonts (MRF) _are_ available for Windows, I think the Mac bit is misleading you, I don't think any type designer only makes typefaces for Macs only, it must be difficult enough to make a living from type design without limiting yourself:)  \nI think one of Samadam's link list provides another font which is closer to Channel 4's,  \n [http://portfolio.denis-potschien.de/zeige.php?titel=newmedia](http://web.archive.org/web/20100513173347/http:/portfolio.denis-potschien.de/zeige.php?titel=newmedia \"http://portfolio.denis-potschien.de/zeige.php?titel=newmedia\")\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "I'll second SuperUltraFabulous on your links, samadam!  \nJust had a quick glance at it & added it to my favourites afer seeing only the first 2 fonts. Great stuff!\n\n"
    },
    {
      "time": "",
      "content": "I've used Illustrator to make the logo and now I just need a good font to be used across everything. I'm not that keen on the regular Lacuna.\n\nI downloaded all those fonts a while back and I think the NewMedia font isn't very good at all.\n\nI came across a sort of 'beta' of Fonce Sans earlier, which I really liked, but then found there are characters missing.\n\n"
    },
    {
      "time": "",
      "content": "It sounds like you need to splash out on a proper font or use a system font, nearly all free fonts have some area which is lacking, especially pointed on text fonts, if you were just looking for a display font or just some characters to make a logo you would have a better chance of getting a free font to answer your requirements. Browse through these though  \n [http://www.myfonts.com/search?search%5Btext%5D=free&page=1](http://web.archive.org/web/20100513173347/http:/www.myfonts.com/search?search%5Btext%5D=free&page=1 \"http://www.myfonts.com/search?search%5Btext%5D=free&page=1\")\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Hi all,\n\nI got a question that sort of relates to what is being discussed here.  \nI'm working on a logo for a fashion designer that makes anything from wedding dresses to very modern ladies shirts, skirts, etc.  \nI want to use custom fonts for her logo, but like Chronix I'm not that comfortable creating my own font. What my question is whether it it's ok to create a new font from exsisting fonts and then to tweak it that it looks as I want...or is that kinda like stealing? I would have to change it a bit in illustrator to make it all fit and to make it look natural..but still the main parts would be stolen from 2 other fonts.\n\nnext question...what can I use better: Illustrator or fontlab? I know Illustrator very well (worked on it for about 5 years now) and don't know much about fontlab (I have played around with it but seemed a bit complicated, or is that just because I don't have a lot of practice yet?).\n\nOfcourse if you all say to create one myself without any other fonts as base I will do that...but I was just wondering.\n\n\\tnx a bunch!  \ndav2.\n\n"
    },
    {
      "time": "",
      "content": "There's a fine line between getting your inspiration from something that already exists, paying an ode to something & stealing. I'm not sure when basing something new on something old is considered stealing, but from what I've seen it actually happens a lot.  \nI started working on a font & I'm using Illustrator (since I'm also very familiar with it) & Fontographer, but this combinaton leaves a lot to be desired. I haven't used Fontlab, but I do think it's most commonly used in designing typefaces. You'll probably be able to import Illustrator drawn letters in Fontlab as well.  \nGood luck!\n\n"
    },
    {
      "time": "",
      "content": "It is usual to customise lettering for a logo, often this will mean amending a typeface to your design to improve on spacing and letterforms and is probably the most effective way of achieving it as somebody else (the type designer) will, with their knowledge and experience, have worked out a lot of the problems of stroke modulation etc. If your intention is just to create a logo rather than take a font change it and then use it as a font you are on safe moral ground is my perspective. And to that end I would just work in Illustrator.  \nTry it and if you want to get some opinions post it in the Critique section.  \nTim\n\nps In future perhaps you should start a new thread and link to another if you think it is relevant\n\n"
    },
    {
      "time": "",
      "content": "tnx a lot for the fast and very useful replies!!\n\nOnce I got a bit of a start on a typeface I'll definately post it in a different thread.\n\ndav2.\n\n"
    }
  ]
}
