{
  "id": "27601",
  "title": "Full points in contents page",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi there,\n\nI need some advice. I have a contents page and I am a little unsure whether I need full points at the end of the chapter headings.\n\nWIthin the book, the main chapters, (Set in Avenir in contents page) do not end in full points.\n\nThe interviews, (set in Janson Text within contents page), do end with full points within the actual page.\n\nAnd then The Pink text,(set in Janson Text within contents) do not end with full points on the actual pages.\n\nMy queery is whether to add full points within the contents page or follow how the book is set out and only include full points on the interview titles.\n\nAny thoughts anyone, hope that allmakes sense.\n\nM\n\n| Attachment | Size |\n| --- | --- |\n| [contents.pdf](http://web.archive.org/web/20060821185340/http:/typophile.com/files/contents.pdf) | 67.48 KB |\n\n",
  "author": "<a href=\"user/11806\" title=\"View user profile.\">Matt Squire</a>",
  "time": "<br>",
  "uid": "11806",
  "comments": [
    {
      "time": " 11 August, 2006 - 6:40am",
      "content": "I would suggest not, to include some and not others would give the impression of mistakes, however I would prefer the contents to read subject\\_\\_page number, which I think would help with your indenting, if the numbers all ranged right. You could also consider using a baseline grid to keep all the lines in each of the columns aligned, and dropping the “Interview with” to make finding a particular interview easier.  \nbtw I spotted three _possible_ errors in the copy (and there may be more) – harper Collins (Harper), Ericcson (Ericsson) and Rabbit send a Little Bill (surely sends?)  \nTim\n\n"
    },
    {
      "time": " 11 August, 2006 - 7:48am",
      "content": "Good call on the page numbers, it would indeed be easier to read. I do have a baseline grid that I work from but got a little mixed up with teh chapter headers, the interviews belong to the Main headers as they are contained within that chapter which is why I have decreased the leading a little, the pink headers are seperate chapters and so keep the main leading values. But I guess taking the leading in may not be needed due to the fact that the headers are set in different fonts. What do you think..\n\nAnd I really need to get onto our copywriters and proof readers, I am finding mistakes all over the place. .\n\nThanks for the input\n\n"
    },
    {
      "time": " 11 August, 2006 - 8:08am",
      "content": "I am also a fan of dropping the points. If you reverse position, as Tim suggests, it would look horrid to have them. The old newspaper rule was that headings never have points … I think it applies here. I am surprised that they are being used for the Interview headings.\n\n"
    },
    {
      "time": " 13 August, 2006 - 10:20am",
      "content": "The interview headers shown in the contents are actually shortened versions of the interview descriptions that appear on the actual interview pages. In this case some of the descriptions are a few sentences long so therefore call for a full point. THis is were I needed advice on weather to include them in the contents, as the full length ones do.\n\nHope that makes sense.\n\n"
    },
    {
      "time": " 14 August, 2006 - 5:17am",
      "content": "I have adjusted the COntents page, I agree that the numbers on the right does make it easier to read.\n\n ![](http://web.archive.org/files/contents_4229.jpg)\n\nJust as an add on, I wanted to attach a pdf of the page, but there was no option to do this, any ideas.\n\n"
    }
  ]
}
