{
  "id": "2760",
  "title": "(x) Michael Schwabish font - Neutraface {Romesh, Mike Y, Tiff}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I see this font from time to time but can't find its match. I assume there's a few like it. I got the shot off coudal.com.   \n   \n ![wedding](http://web.archive.org/web/20150327015328im_/http:/www.typophile.com/forums/messages/83/24444.jpg)\n\n",
  "author": "whoisdan",
  "time": "19 Jan 2004 — 8:09am",
  "uid": "2739",
  "comments": [
    {
      "time": "19 Jan 2004 — 8:36am",
      "content": "looks like neutraface, let me check.\n\n"
    },
    {
      "time": "19 Jan 2004 — 8:40am",
      "content": "It's House Industries [Neutraface Display](http://web.archive.org/web/20150327015328/http:/houseind.com/house.php?kit=NEUTRAFACE-FO).\n\n"
    },
    {
      "time": "19 Jan 2004 — 8:53am",
      "content": "nope. its very close to neutraface titling but the \"G\" doesn't match.   \n   \nI should have known it better. If it was so simple the typophile id-gurus   \nstill had posted the answer.\n\n"
    },
    {
      "time": "19 Jan 2004 — 8:55am",
      "content": "maybe it's slightly modified.\n\n"
    },
    {
      "time": "19 Jan 2004 — 8:59am",
      "content": "Neutraface Display comes with 2 G's, one of which matches the sample. I have their catalog and it shows them both.\n\n"
    },
    {
      "time": "19 Jan 2004 — 9:05am",
      "content": "Very cool. Thanks, ladies and gentlemen.   \n   \nCan anybody help me out with a font like this that matches well with Michael Schwab's stuff?   \n   \n [www.michaelschwab.com](http://web.archive.org/web/20150327015328/http:/www.michaelschwab.com/)\n\n"
    },
    {
      "time": "19 Jan 2004 — 9:07am",
      "content": "My catalog is at home. I just checked the specimen online and there are no alternates shown.\n\n"
    },
    {
      "time": "19 Jan 2004 — 10:38am",
      "content": "I can scan the catalog page that shows the Display alphabet with alternates. Just hang on a bit.\n\n"
    },
    {
      "time": "19 Jan 2004 — 10:48am",
      "content": "OK. Here is the sample page. It doesn't show all weights, but these are the characters and alternates. The rounded G is the one used in the posted sample.   \n ![NeutrafaceAlphabet](http://web.archive.org/web/20150327015328im_/http:/www.typophile.com/forums/messages/83/24452.gif)\n\n"
    },
    {
      "time": "19 Jan 2004 — 4:11pm",
      "content": "My first guess was Nobel from Dutch Type Library or FontBureau... but the \"E\" doesn't match\n\n"
    },
    {
      "time": "19 Jan 2004 — 4:47pm",
      "content": "Daniel, When I look around Schwab's site, the navigation font is a bold Sans, but not Neutraface. Futura, Metro and Kabel are similar to it, but they have splayed M's. Nobel has flattened apex of N, but the M is better. Offhand I can't pick one font that matches both criteria: straight-sided M, pointed apex on N. Maybe he used Nobel with a Futura N?\n\n"
    },
    {
      "time": "20 Jan 2004 — 7:29am",
      "content": "Hi Daniel,   \n   \nI suspect Schwwab's font is a custom one based on his lettering. This is conceivable given his illustrative superstardom. As you look through his posters and logos you find the same heavy deco sans lettering, but there are slight variations in weight and form which says to me that he is drawing his letters. To Mike's observations about the hallmarks of his lettering I would add: slightly rounded corners and a very dark A. These qualities are also found in the navigation font, though I suspect it's a digital version given it's regularity.   \n   \nI've always enjoyed Schwab's type. If you want to match it, for a logo, i'd suggest drawing :-)   \nOr if you haven't got time, then the alternatives mentioned plus Mark's [Moestra](http://web.archive.org/web/20150327015328/http:/www.ms-studio.com/FontSales/mostra.html) and [Blakely](http://web.archive.org/web/20150327015328/http:/www.ms-studio.com/FontSales/blakely.html)\n\n"
    },
    {
      "time": "19 Jan 2004 — 8:42am",
      "content": "The bolder is Neutra Display Titling   \nThe lighter is Neutra Display Bold   \n   \nOr at least so it seems ...\n\n"
    },
    {
      "time": "19 Jan 2004 — 8:58am",
      "content": "There are two variations on cap G in Neutra Display Titling. What don't you find to be the same?\n\n"
    }
  ]
}
