{
  "id": "27615",
  "title": "(x) Sort of handwriting, some serif chars, supposedly ITC - ITC Kristen {Mike F}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi, my first post and first request for assistance - there’s clearly a lot of expertise here - let me say thanks in advance!\n\nThis font is supposedly “Kaiten ITC” but I can’t find any reference and the usual ID tools aren’t helping.\n\nWhat do I have on my hands with this one?\n\n| Attachment | Size |\n| --- | --- |\n| [font.jpg](http://web.archive.org/web/20060821185557/http:/typophile.com/files/font_47.jpg) | 37.67 KB |\n\n",
  "author": "<a href=\"user/14216\" title=\"View user profile.\">arunda</a>",
  "time": "<br>",
  "uid": "14216",
  "comments": [
    {
      "time": " 11 August, 2006 - 4:40pm",
      "content": "Not Kaiten. Rather, it’s [Kristen ITC](http://web.archive.org/web/20060821185557/http:/www.myfonts.com/fonts/linotype/kristen-normal-itc/kristen-normal-itc/testdrive.html).\n\n"
    },
    {
      "time": " 11 August, 2006 - 5:32pm",
      "content": "Wow, Kristen Normal it is for sure. Thanks very much.\n\nI bet I couldn’t find it because it’s been ‘italicized’ if that makes any sense? It looks like someone might have skewed the text in photoshop to make it lean forward. There doesn’t appear to be any official italic version… most interesting.\n\n"
    },
    {
      "time": " 12 August, 2006 - 7:44am",
      "content": "More probably the ‘Shear’ function was used in Illustrator, which is a better application for playing around with lettering. It allows you to specify in degrees how much you would like to slant the lettering.\n\nIf you hang out here long you will see all kinds of graphic manipulation of type, with one of the most popular being one we like to call ‘Squooshing’. I think it was Tiffany who coined that one.\n\nSometimes the graphic power of some software tools is irresistible, much to the detriment of the type being used, but often it’s just in the eye of the beholder. (You can tell from this remark that I am not above graphic manipulation myself ;) )\n\n- Mike Yanega\n\n"
    }
  ]
}
