{
  "id": "27613",
  "title": "Tyophile search function",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all.\n\nIs there a reason why Typophiles search function isn't working for me. What ever I search for I just get 'Your search yielded no results.' - I'm using OS X, and I've tried on a number of browsers with the same results. Is anyone else having the same problem ?\n\n",
  "author": "coop",
  "time": "11 Aug 2006 — 1:32pm",
  "uid": "5642",
  "comments": [
    {
      "time": "11 Aug 2006 — 6:45pm",
      "content": "I tried it and was well impressed.\n\nI got 1 matching category for \"font\" and a cornucopia of 2 for \"type\".\n\nI got nothing for \"logo\" though :o(\n\n(I'm on WinXP)\n\n"
    },
    {
      "time": "11 Aug 2006 — 6:59pm",
      "content": "It's been broken for quite a while if I'm not mistaken.\n\nBetter results can be obtained using Google. Type \"site:typophile.com [search]\" in Google to search Typophile only.\n\neg. site:typophile.com fonts\n\n"
    },
    {
      "time": "11 Aug 2006 — 6:59pm",
      "content": "Yeah, Search has been pretty ineffective of late.\n\nThat's probably why there have been so many \"been there, done that\" threads.\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "12 Aug 2006 — 7:26am",
      "content": "As mentioned above, Google is the best bet - unfortunately it's limited by how often the forum is crawled so you may not find the latest posts.\n\n"
    },
    {
      "time": "10 Mar 2010 — 8:17am",
      "content": "The search has been fixed. Kudos to Jared!\n\n"
    },
    {
      "time": "10 Mar 2010 — 1:45pm",
      "content": "Has search really been fixed? My search for \"gotham\" returned 4 hits. I have to believe that word has been used many, many more times than that.\n\n\\*Edit\\*  \nA Google search yield 753 results.\n\n"
    },
    {
      "time": "10 Mar 2010 — 2:59pm",
      "content": "Still being indexed, I believe. May take Drupal a little while.\n\n"
    }
  ]
}
