{
  "id": "27620",
  "title": "Triangular type/logo for \"Rising Star\" category",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi there,\n\nI am designing a title for an awards show and the segment I am doing is “Rising Star”  \nI have attatched my design for it,I doubt the word “rising” is even legible,but with my other solutions it seems to drift off from the original star shape.\n\njust wondering if you guys have any tips,or could recomend a triangular font I can base my letter forms off that would be cool as.\n\nThanks Al\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 30.png](http://web.archive.org/web/20060821185634/http:/typophile.com/files/Picture%2030.png) | 36.44 KB |\n\n",
  "author": "<a href=\"user/9952\" title=\"View user profile.\">guncry</a>",
  "time": "<br>",
  "uid": "9952",
  "comments": [
    {
      "time": " 12 August, 2006 - 3:38am",
      "content": "I think partly the problem is that star has a perspective wheras rising doesn’t, the mixture of case is also contributing to the unreadability I can only read S and G comfortably, since you have an uppercase R in star I think you need to develop that for rising. The N reminds me of A from [Stop](http://web.archive.org/web/20060821185634/http:/www.myfonts.com/fonts/linotype/stop/). Overall I think you need to start with a more [constructivist typeface](http://web.archive.org/web/20060821185634/http:/www.myfonts.com/search?search%5Btext%5D=constructivist) or draw the characters based on something similar, to two equal rectangles, then create the perspective, if you are using Illustrator or similar it is easy to distort, then mend the damage done by the distort, it should help get the weights of the strokes more realistic.  \nTim\n\n"
    },
    {
      "time": " 12 August, 2006 - 5:11pm",
      "content": "It’s nice looking and stylish, but quite unreadable in its current state.\n\nMake no mistake: readability is the first priority for a graphic designer. The very first. Make your logo so “that he may run who is reading it”. If you don’t have readability, you don’t have anything. Make it readable, then make it beautiful.\n\n"
    },
    {
      "time": " 13 August, 2006 - 2:21pm",
      "content": "thanks guys,i like the idea of looking at constructivist stuff,and doin it straight then skewing it. Great stuff thanks.\n\n"
    }
  ]
}
