{
  "id": "27636",
  "title": "Charles Bigelow to be next Cary Professor at RIT",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "Charles Bigelow has just received the position of Melbert B. Cary Professor at Rochester Institute of Technology. It's a chaired professorship and quite an honor – Alexander Lawson and Hermann Zapf previously held this position while teaching typography and type design at RIT. Bigelow, who taught at Stanford University from 1982-1997, had been contemplating teaching again, so the timing and opportunity were very auspicious.\n\nBigelow said he first plans to offer a course on the history, theory, and technology of typefaces and fonts, followed by an advanced course on newspaper typography (not only types and fonts, but also usage and the typographic image and identity of a newspaper) and later, advanced typography seminars on subjects like typography on mobile devices (cell phones, pocket PC's, etc) as well as typography and material culture: how typography contributes to the experience of super markets, chain stores, and the rest of our marketed civilization.\n\nOver lunch at Izzy's Deli in Santa Monica, California last monday, Chuck Bigelow and partner Kris Holmes said they will really miss Los Angeles which, along with Cambridge, Massachusetts, has been their favorite city to live in. They will be moving to Rochester in September.\n\nBigelow's typographic accomplishments are quite extensive: he established a master's program in digital typography at Stanford along with Donald Knuth in 1982 and has taught, lectured and written extensively. His students include Carol Twombly, David Siegel, Dan Mills and Gary Munch. Bigelow & Holmes created the extensive (and still growing) Lucida family, one of the first fonts created to optimize typography for output on personal computers' lower resolution printers. They also created some of the first truetype fonts including Apple's city fonts Chicago, Geneva, Monaco, New York, Apple Chancery, and the ubiquitous Microsoft Wingdings font.\n\n| Attachment | Size |\n| --- | --- |\n| [Bigelow and Holmes.jpg](http://web.archive.org/web/20150415113733/http:/typophile.com/files/Bigelow%20and%20Holmes_0.jpg) | 33.52 KB |\n\n",
  "author": "Jill Bell",
  "time": "13 Aug 2006 — 9:58am",
  "uid": "4349",
  "comments": [

  ]
}
