{
  "id": "27635",
  "title": "Fly Through... Series Handwriting Font",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Any ideas?\n\n ![](http://web.archive.org/web/20130916185126im_/http:/typophile.com/files/11450479_4116.jpg)\n\nThanks!  \n--Michael.\n\n",
  "author": "mwebert",
  "time": "13 Aug 2006 — 8:10am",
  "uid": "4479",
  "comments": [
    {
      "time": "13 Aug 2006 — 9:09am",
      "content": "I've gone through the fonts on [Comicraft](http://web.archive.org/web/20130916185126/http:/www.comicbookfonts.com/) and [Blambot](http://web.archive.org/web/20130916185126/http:/www.blambot.com/), but I can't find an exact match.\n\nOddly enough, the font I've found that has the most in common with your mystery font (in the basic letterforms) is [GFYJeanna](http://web.archive.org/web/20130916185126/http:/www.myfonts.com/fonts/chank/gfy-handwriting-fontpak/gfyjeanna-regular/), a [\"Go Font Yourself\"](http://web.archive.org/web/20130916185126/http:/www.chank.com/font_detail.php?sku=5456) font from [Chank](http://web.archive.org/web/20130916185126/http:/www.chank.com/). I suppose there's a chance that your mystery font is a customized -- and much-improved -- version of GFYJeanna.\n\nIf you don't need an exact match (and no one else is able to find one for you), I suggest that you go through the offerings of Comicraft and Blambot. They both have many fonts that are much nicer than an unmodified GFYJeanna.\n\n"
    },
    {
      "time": "13 Aug 2006 — 9:52am",
      "content": "I've been hunting for this in [Part 11 of the Script Font ID Guide](http://web.archive.org/web/20130916185126/http:/bowfinprintworks.com/Script11Pg1.html), which is all hand-printed fonts. I used the 'G' and the 'y' as my initial filter, and I couldn't find a match for this lettering.\n\nThe problem, as our [FAQ](http://web.archive.org/web/20130916185126/http:/typophile.com/forums/typeid/faq) says, is that there are just too many hand-printed fonts, because they are cheap and easy to make. It's very possible that this is a custom font done for this company.\n\nMy suggestion is similar to Spire's, although I suggest looking for a similar font in the Script Guide, and then looking up the supplier in the Reference List. Many of them can be found as free downloads, or part of a rather inexpensive font collection.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "13 Aug 2006 — 10:02am",
      "content": "I just went and had a look at GFY Jeanna and I absolutely believe that the same person who did that lettering did your sample. The 'g' and 'G' are obvious differences, but it looks like the one used for the ad is a 'cleaned up' version of that lettering.\n\nThe problem is still that this was probably done as a custom version, so you will have to find the best match available.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "13 Aug 2006 — 10:08am",
      "content": "Here's a quick-and-dirty animated comparison with GFYJeanna:\n\n ![](http://web.archive.org/web/20130916185126im_/http:/typophile.com/files/FLY-THROUGH-ALGEBRA_amimation_5127.gif)\n\n(I've tweaked the spacing and stroked the type to get it closer to the weight of the original. Aside from that, this is an unmodified GFYJeanna.)\n\nI'm pretty convinced now that this font started life as GFYJeanna.\n\n"
    },
    {
      "time": "13 Aug 2006 — 10:14am",
      "content": "There's a very good chance that this customization job was done by Chank himself. It's probably worth a shot to [contact him directly](http://web.archive.org/web/20130916185126/http:/www.chank.com/contact.php) to see if he can provide you with the exact font.\n\n"
    },
    {
      "time": "13 Aug 2006 — 11:35am",
      "content": "My impression, partly based on things I have read before, was that Chank doesn't actually do all of those handwriting fonts. Handwriting is, after all, handwriting, and usually reflects an individual style. Looking through those GFY fonts suggests to me that they were not all done by the same individuals, although I guess anything is possible.\n\nThis is not to say that 'Spire' might not be right. My point was mainly that I think the information that Chank designed those fonts may be oversimplifying their true origins.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "13 Aug 2006 — 11:54am",
      "content": "Chank runs a service called [Go Font Yourself!](http://web.archive.org/web/20130916185126/http:/www.chank.com/gofontyourself/index.php); for $199 he will turn your handwriting into a font.\n\nThe [Go Font Yourself Handwriting Fontpak](http://web.archive.org/web/20130916185126/http:/www.chank.com/font_detail.php?sku=5456), which includes GFYJeanna, is a collection of Chank's favorite GFY fonts. I presume that he's worked out some kind of deal with the respective owners of the original handwriting (that is, the ones who commissioned the fonts in the first place).\n\nBTW, Mike, you can call me Edward if you like. :)\n\n"
    },
    {
      "time": "14 Aug 2006 — 5:04am",
      "content": "Thanks, gents, I think you've got it. I appreciate the homework and the fast reply, as always.\n\nAnd Mike: your ID Guides are phenomenal...thanks for providing such a great resource for the type community. I've already used them countless times. If I could humbly offer one suggestion to you about the site, inspired by Edward Tufte, it would be to integrate the Supplier Reference List into the ID Guide itself, so clicking on a given sample takes your visitor (via target=\"\\_blank\" or something) to the respective supplier's site. I know it's more work for you to integrate the two, but I think it would ultimately make searching a simpler, one-step affair. Also, you could keep the Supplier Reference List, which has obvious merits unto itself, as a feature on the site.\n\nThanks again all.\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "14 Aug 2006 — 7:11am",
      "content": "Michael,\n\nThanks for your comments about my Guides. I agree that your suggestion would make things easier for the users, but there are two main reasons that I have not made links to suppliers from the samples:  \n1) There are multiple suppliers for most of the fonts, since the designing foundry is usually only one source, and I am not trying to play favorites, even though I could benefit from doing so, with sales referral fees.  \n2) Links have a way of getting out of date, and the maintenance task would be horrendous. I have been lucky enough to have wonderfully generous volunteers to help make samples for the Guides, and even to take on the design of the Serif Font ID Guide for me, but I'm spread too thin to take on the addition and maintenance of about 6,000 links.\n\nI am thinking about the idea of putting links into the [Supplier Codes List](http://web.archive.org/web/20130916185126/http:/bowfinprintworks.com/ListPages/SupplierCodes.html), and I already do have them on the [Type Providers page](http://web.archive.org/web/20130916185126/http:/bowfinprintworks.com/providers.html).\n\n- Mike Yanega\n\n"
    }
  ]
}
