{
  "id": "27634",
  "title": "Seeking permission to use a photo of a linotype matrix",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hello,\n\nI am a lit major whose first job at age 14 was in 1951 in a printshop; I am presently putting together pictures and thoughts from my misspent youth in HTML to go onto a CD for the kids. It may be published eventually if I can find a publisher with a taste for the quirky, but I can't see it in any form other than electronic: afterthoughts, sidebars, sidebars to the sidebars, essays on the draft, etc. live in a nexus of hyperlinks and would be infuriating on paper.\n\nEvery time I mention some object, I find that nobody today, except for a dwindling few, knows what I am talking about, so I have been grabbing pictures of admats, transposition brackets (I was later a telephone lineman), Paige compositors (always a lit major: Mark Twain invested heavily in this just when Ottmar was busy with his invention) and the like to explain.\n\nI should like to use your image of the linotype matrix 14919.jpg found on Google Image search (which lists the link as broken) in my work. I give good attribution with a link to your site, and I offer a copy of my eventual CD, if you would care to have one. Whom do I contact?\n\n",
  "author": "mjkovich",
  "time": "13 Aug 2006 — 6:04am",
  "uid": "14230",
  "comments": [
    {
      "time": "13 Aug 2006 — 7:04am",
      "content": "The typophile Admins may be able to trace who posted that image...\n\n[http://www.typophile.com/forums/messages/4100/14919.jpg](http://web.archive.org/web/20131015071628/http:/www.typophile.com/forums/messages/4100/14919.jpg \"http://www.typophile.com/forums/messages/4100/14919.jpg\")\n\nbut it looks like it was scanned from a book. Someone here may have an image that they could share.\n\n"
    },
    {
      "time": "13 Aug 2006 — 7:36am",
      "content": "The image was originally posted by Kent Lew in a thread from August 2003 that no longer appears to be accessible via typophile.com.\n\nHere is [Google's cache of that thread](http://web.archive.org/web/20131015071628/http:/www.google.com/search?q=cache:www.typophile.com/forums/messages/4100/14651.html).\n\n"
    },
    {
      "time": "13 Aug 2006 — 2:22pm",
      "content": "I have some matrices, maybe I can try a macro photo like the one from Kent.\n\n-- [astype.de](http://web.archive.org/web/20131015071628/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "14 Aug 2006 — 6:35am",
      "content": "Feel free to use it, a 10 Point ch ligature matrice.\n\n-- [astype.de](http://web.archive.org/web/20131015071628/http:/www.astype.de/)--\n\n ![](http://web.archive.org/web/20131015071628im_/http:/typophile.com/files/IMG_0003_6263.jpg)\n\n ![](http://web.archive.org/web/20131015071628im_/http:/typophile.com/files/IMG_0005_4535.jpg)\n\n"
    }
  ]
}
