{
  "id": "2765",
  "title": "Footnotes in InDesign",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Am I missing something, or doesn't InDesign do footnotes?   \nI know that I could do them manually, but surely there's a way to have them automated.   \nThe text is currently in a Word doc BTW.\n\n [‹ Flash Alternative](http://web.archive.org/web/20081104035453/http:/www.typophile.com/node/2757 \"Go to previous forum topic\") [Type for a magazine ›](http://web.archive.org/web/20081104035453/http:/www.typophile.com/node/2781 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081104035453/http://www.typophile.com/user/1717\" title=\"View user profile.\">steve_p</a>",
  "time": "<br>",
  "uid": "1717",
  "comments": [
    {
      "time": " 19.Jan.2004 9.54pm",
      "content": "ID 2 doesn't do it,except as Endnotes (which is nicer, imo, anyway). I've read that CS does support footnotes similar to the way Word does...\n\n"
    },
    {
      "time": " 20.Jan.2004 12.09am",
      "content": "Thanks for the reply HD - but its CS I'm using.   \nID is new to me, so I may well be looking in the wrong place.   \n   \nEnd notes aren't an option - the content dictates that it has to be footnotes.\n\n"
    },
    {
      "time": " 21.Jan.2004 1.38pm",
      "content": "OK, so if In Design can't do footnotes, then is there some other software I should be using, or does anyone have any advice about how to go about this manually.   \n   \nI have around 110,000 words, with 850 or so footnotes. The footnotes vary from 2 to 250 words.\n\n"
    },
    {
      "time": " 21.Jan.2004 1.55pm",
      "content": "Oh boy... Ventura was able to do this, but that isn't an option. The last job like this I did -- years ago, mind -- I did in Word. If it is just text and a bit of visuals... it's not all that bad, actually. :-D.   \n   \nYou could try Sonar Bookends...   \n [http://www.virginiasystems.com/](http://web.archive.org/web/20081104035453/http:/www.virginiasystems.com/)   \n   \nAdobeFramemaker does support footnotes, but welcome to HELL if you try working with that as a designer...\n\n"
    },
    {
      "time": " 21.Jan.2004 2.09pm",
      "content": "Yep. I was just going to suggest Sonar Bookends' InFnote:   \n [http://www.thepowerxchange.com/sonar\\_bookends\\_index\\_pro\\_1441\\_prd1.html](http://web.archive.org/web/20081104035453/http:/www.thepowerxchange.com/sonar_bookends_index_pro_1441_prd1.html)   \n   \nYou could also try this person's clever scripting:   \n [http://www.guyverville.com/html/scripts.php](http://web.archive.org/web/20081104035453/http:/www.guyverville.com/html/scripts.php)\n\n"
    },
    {
      "time": " 21.Jan.2004 2.42pm",
      "content": "HD & Tiffany   \nThanks, I'll have a look at those   \n   \nIts a personal thing, rather than a work thing, so I think the $195 for InFnote might be pushing it a bit. (I just need to find a work project with loads of footnotes so I can justify the expense!)   \n   \n\\>\\>clever scripting   \nOf course! Scripting...why didn't I think of that?   \nMy background is javascript, php, dhtml, xml blah, blah.   \nLooks like I need to go & read some documentation.\n\n"
    },
    {
      "time": " 21.Jan.2004 3.22pm",
      "content": "Steve, Adobe has an InDesign Scripting Guide [here](http://web.archive.org/web/20081104035453/http:/www.adobe.com/products/indesign/pdfs/idsnscripting.pdf).\n\n"
    },
    {
      "time": " 21.Jan.2004 4.00pm",
      "content": "OK thanks for the link - its 15mb though, so I'll pick it up tomorrow when I get to work as we have a proper connection there, and I'm still on 56k at home\\*.   \nI guess that's a different one to the one on the CD, which is 9mb.   \n   \n\\*Don't know if this will mean much to anyone outside ofthe UK, but today is Hooray day for us as we have finally hit BT's ludicrous trigger level for broadband. Now we just have to wait a month or so to see when they're going to activate our exchange - some that already have activation dates will be waiting till september.   \nWell, thank Maggie we don't have to put up with a slow , innefficient, expensive owned-by-the-people telephone system anymore.\n\n"
    },
    {
      "time": " 22.Jan.2004 2.55pm",
      "content": "HD Schelnack said : Endnotes (which is nicer, imo, anyway   \n   \nOuh i don't think so. How unconfortable is it, when you read a book, to keep the endnotes pages marked in any way, and to be obligated going to theses pages when you could simply look in the back of the page you read. It's kind of a torture.\n\n"
    },
    {
      "time": " 22.Jan.2004 3.26pm",
      "content": "I certainly prefer footnotes if I'm the reader.   \nI think end notes can be OK if they are purely academic references - all the info you need when you read it is in the text, and if you need to look up a source, then you can check the endnotes.   \n(Its really annoying though, when all the notes are at the end of the book, rather than the end of each chapter, under headings like 'Notes for Chapter 6', and you have check every page from the reference back to the chapter start to make sure you have the correct reference).   \n   \nIn this case, the footnotes include academic references, but also, sometimes, asides, qualifications and clarifications as well as detailed discussion of supporting evidence. Most of this stuff has to be footnoted in order to keep the momentum of the main thrust of the argument going in the text, On the other hand it shouldn't be hidden away, as it includes details which are essential to a more considered appreciation of the finer points of the argument.   \nIn this case, as well, I think the demands of the content over-rule any kind of typographic judgement.   \n(typography...over-ruled...am I allowed to say that here?)\n\n"
    },
    {
      "time": " 22.Jan.2004 3.53pm",
      "content": "Yves Perrousseaux even counsels to put the notes the nearer of the text possible, like in the margin with that middle age style he likes, and i think it's not a bad idea. It might be very aesthetical if well done.\n\n"
    },
    {
      "time": " 22.Jan.2004 8.41pm",
      "content": "Depends. I have done a book some years ago in which the footnotes were so endlessly long, that they actually supplanted the main body text, there were whole pages filled with footnotes, which was patently absurd of course.   \n   \nI think visually endnotes bring more cleanliness and\n\n"
    },
    {
      "time": " 22.Jan.2004 9.52pm",
      "content": "Guillaume, Gunnar Swamson has done that in a very novel fashion in \"Graphic Design & Reading\".   \n   \nBTW, I was recently looking at one of Theodore Lowe de Vinne's books, and there was actually a footnote that was so long that it took up the whole of the subsequent page... and it had a footnote of its own on that second page!   \n   \nhhp\n\n"
    },
    {
      "time": " 22.Jan.2004 10.07pm",
      "content": "(That's Gunnar Swanson - sorry.)   \n   \nhhp\n\n"
    },
    {
      "time": " 23.Jan.2004 9.49am",
      "content": "I find footnotes best if they are short and serve to directly elucidate some statement in the text. I find footnotes best if they are longer and involve a tangential discussion, e.g. a summary of conflicting opinion on a subject, or of prior scholarship. It is possible to conceive of a text that would have both footnotes and endnotes.\n\n"
    }
  ]
}
