{
  "id": "27658",
  "title": "Healthcare company",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Logo for a company working on systems to improve and enhance patient/doctor information and decision-making.  \nNo red cross, so maybe a shepherd’s crook/ankh/cross symbol (Balance “f”)  \nwith co. name.\n\nSurgical green. (green is the color of the academic hood for medicine)\n\nAll comments appreciated.  \nThank you.  \nJohn\n\n| Attachment | Size |\n| --- | --- |\n| [efficase logo.jpg](http://web.archive.org/web/20080821141643/http:/typophile.com/files/efficase%20logo.jpg) | 34.84 KB |\n\n [‹ The Plough: English Pub Logotype Critique](http://web.archive.org/web/20080821141643/http:/www.typophile.com/node/27752 \"Go to previous forum topic\") [Logo/lettering advice for travel website ›](http://web.archive.org/web/20080821141643/http:/www.typophile.com/node/27644 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821141643/http://www.typophile.com/user/5106\" title=\"View user profile.\">polypica</a>",
  "time": "<br>",
  "uid": "5106",
  "comments": [
    {
      "time": " 14.Aug.2006 10.57pm",
      "content": "I am sorry, but this looks more like a ’Type Test’, than a logo. Right now I only see the word ’Efficase’ set in front of a ’f’. Unmodified and unmotivated type. Dont get me wrong, I looove nice typographic logotypes and minimalistic approaches in logo design. But there is just something missing here. One thing that would bother me is the ’f’. As you wrote its just an ’f’, set in Balance, enlarged, colored and moved to the back. About the ’wordmark’ itself, What about slightly adjusting / customizing the type, so it stands out. What about a ’ffi’ ligature? A logo should be unique, or at least as unique as possible. Especially typographic logos should have ’That Something’. Otherwise everyone with a license of ’Balance’ could just set ’TheirCompanyName’ and ’copy’ your ’logo’ in an instant.\n\nDav\n\n"
    },
    {
      "time": " 15.Aug.2006 7.04am",
      "content": "Is this a medical software company? I am getting that impression based upon what you have said. Either way, this doesn’t evoke healthcare or information management. I would do some research on other similar companies. A logotype/mark should “identify” a company, like a fingerprint it should be unique. You have a font and color choice, but you have to put these elements together in a more unique way as Dav said. Keep working on it.\n\n"
    },
    {
      "time": " 15.Aug.2006 7.43am",
      "content": "Subtlety is lost on you folks. (joke, joke)\n\nThis is not a defense, just a chronology.\n\nRegarding ligatures:  \nBloesma didn’t draw any. I tried an ff, ffi and fi. The f is so asymmetric that  \nI lack the imagination to improve it. I like it as a shape/glyph. Large, and slanted on the business card (so seventies), it has presence. Add Legato for name.address, etc and Avance for body copy . . . Too much Bloesma?\n\nIs the ankh, crook, cross evocation a miss?\n\nSpacing, etc: Well, I did change the c in efficase to provide a (too) subtle emphasis on the ‘case’. Letterspacing can always be improved.  \nSo can font selection, for that matter.\n\nThanks, as always, for your counsel. Please keep it coming.\n\nJohn\n\n"
    },
    {
      "time": " 16.Aug.2006 8.19am",
      "content": "I think you need to change the font choice. It looks more playful than serious, as it is in the medical profession. A more geometric, rational look will present itself more appropriately. The color is a very good choice, though.\n\n"
    }
  ]
}
