{
  "id": "27669",
  "title": "Code Studio: Logo Design Advice/Critique Please",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is a logo that I am working on for a firm that \"prepares development codes.\" It is a pro bono job that I am doing for a friend, but of course I want it to look nice. I am having some trouble with the typesetting of the name around the symbol.\n\nPlease tell me what you think. Any recommendations, advice or critiques will be warmly welcomed.\n\nDuncan Robertson\n\n ![](http://web.archive.org/web/20131023121754im_/http:/typophile.com/files/CodeStudio_LogoCritique_6209.png)\n\n",
  "author": "duncan",
  "time": "15 Aug 2006 — 7:41am",
  "uid": "10219",
  "comments": [
    {
      "time": "16 Aug 2006 — 7:53am",
      "content": "I think the center version works best (centered, letterspaced on one line, in one weight), but I would look at spacing it out just a tad more, and look at the kerning.\n\n"
    },
    {
      "time": "16 Aug 2006 — 8:06am",
      "content": "The tension in the middle of the 'S' bothers me. Try pushing it inwards more for a shorter 'S' and more of a gap in the middle to reduce the tension. I like the one in the left best given that the \"STUD\" looks compressed in the middle version. The problem with the left version is that the 'C' and the 'S' doesn't align properly.\n\n"
    },
    {
      "time": "16 Aug 2006 — 8:15am",
      "content": "Thank you for the feedback. I will have some adjustments up to look at just as soon as I can.\n\nDuncan\n\n"
    },
    {
      "time": "16 Aug 2006 — 8:17am",
      "content": "cyanide,\n\nWhen you say \"The tension in the middle of the ‘S’ bothers me.\" do you mean the \"c/s\" \"S\" in the symbol or the \"S\" in the text?\n\nDuncan\n\n"
    },
    {
      "time": "16 Aug 2006 — 3:07pm",
      "content": "I changed the way the 2 'c' shapes line up in the mark and made some adjustments to the type. How do you feel about this one?\n\n ![](http://web.archive.org/web/20131023121754im_/http:/typophile.com/files/CodeStudiosLogo-favorite2_4165.png)\n\n"
    },
    {
      "time": "16 Aug 2006 — 4:07pm",
      "content": "I like the first version of the mark better. How would the first version look if the 'C's interlocked (black overlaps blue on left, blue overlaps black on right)?\n\nJust a note - Century Gothic is Monotype's \"rip-off\" version of Avant Garde. See [here](http://web.archive.org/web/20131023121754/http:/www.ms-studio.com/articlesarialsia.html) for more info. I'd recommend using either Avant Garde or Futura rather than Century Gothic.\n\n- Lex\n\n"
    },
    {
      "time": "16 Aug 2006 — 10:40pm",
      "content": "Here are some variations based on suggestions that have been made.\n\nWhen I switched to Avant Garde the endings on the 'C' changed quite a bit and that made it feel like I needed to change the \"C shapes\" in the symbol.\n\nDuncan\n\n ![](http://web.archive.org/web/20131023121754im_/http:/typophile.com/files/CodeStudiosLogo-favorite5_4635.png)\n\n"
    },
    {
      "time": "17 Aug 2006 — 9:38pm",
      "content": "not bad. immediate reactions are that it doesn't really convey flexibility.\n\n----------  \n**Paul Ducco**  \n [Identity Design, Melbourne](http://web.archive.org/web/20131023121754/http:/www.solid-creative.com/identity.htm)\n\n"
    },
    {
      "time": "17 Aug 2006 — 10:47pm",
      "content": "Hmm... I hadn't really thought about it that way, Paul. I'll have to think about it for a little while to see if I can find a way to convey more flexibility.\n\nThough... I'm not really sure it needs to convey flexibility. They are a firm that specializes in plan implementation -- drafting development regulations and preparing infrastructure financing studies. On the one hand one might think \"a consultant should be flexible and accomodating to a clients needs,\" but on the other hand plans and regulations are notoriously inflexible.\n\nPerhaps the interlinking designs could communicate that unified, hand-in-hand partnership with the clients...?\n\nDuncan\n\n"
    },
    {
      "time": "20 Aug 2006 — 2:29am",
      "content": "yeah sounds good.\n\nyou know the client best, as long as it communicates a message about the business, in a way that 'talks' to the existing and potential customers, you're 70% there.\n\nkeep us posted.\n\n----------  \n**Paul Ducco**  \n [Identity Design, Melbourne](http://web.archive.org/web/20131023121754/http:/www.solid-creative.com/identity.htm)\n\n"
    },
    {
      "time": "20 Aug 2006 — 3:08am",
      "content": "Of the last four you published the top left version is a better iteration of the symbol in terms of weight and composition, I think, if you go with that version you should look at amending the C of CODE to the same angled terminals and slightly widen the E to better match the widths of the other characters in that line.  \nTim\n\n"
    },
    {
      "time": "24 Aug 2006 — 12:00pm",
      "content": "I came by this logo today that is somewhat similar to your logo concepts.\n\n ![](http://web.archive.org/web/20131023121754im_/http:/typophile.com/files/322352_4148.gif)\n\n"
    },
    {
      "time": "24 Aug 2006 — 1:25pm",
      "content": "That is kind of close. Though it is mirrored. Where did you find it?\n\n"
    },
    {
      "time": "24 Aug 2006 — 11:49pm",
      "content": "Duncan,\n\nHere's where I found the logo:  \n [http://da-flow.deviantart.com/](http://web.archive.org/web/20131023121754/http:/da-flow.deviantart.com/ \"http://da-flow.deviantart.com/\")\n\n"
    },
    {
      "time": "29 Aug 2006 — 9:15pm",
      "content": "It has been a while. Hope you are all still with me. I customized the 'C' in the name and made some adjustments to the mark.\n\nWhat do you think?\n\n ![](http://web.archive.org/web/20131023121754im_/http:/typophile.com/files/CodeStudiosLogo-typophile3_5125.png)\n\n"
    },
    {
      "time": "31 Aug 2006 — 9:46pm",
      "content": "heaps better, for my money, I'd lose the 'icon' and develop a logotype, might just be a phase though\n\n----------  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20131023121754/http:/www.solid-creative.com/)\n\n"
    }
  ]
}
