{
  "id": "27678",
  "title": "Introducing Candyland - my first font",
  "forum": "Script / Handwriting / Graffiti",
  "tags": [
    "Script / Handwriting / Graffiti"
  ],
  "content": "Hi guys!\n\nThe past week I've been working on my very first font made from scratch. What started off as 10 custom letters for an illustration I was working on quickly became a 3-piece fontset (so far) including all possible accents I could find & a complete DIY-construction dingbat. I'm still working on everything, but since I won't be having any time the next few days, I thought It'd be a good time to post it here for some professional comments & advice. Please be gentle though seeing as this is my first time & I don't have any typographic background. I'm just a simple admirer whose real roots lie in illustration.  \nI've tried to make a handwritten font with a monotype attitude. It's not a real monotype, but all characters are based on the same lines & I've made sure that the \"baseline curves\" are always vertically aligned so you won't get a messy \"scale effect\". Having put aesthetics before comfort, this adds a little to its legibility, but it's still not the kind of font you'd want to use for more than a paragraph. The dingbat follows the same thread as to be beeing semi-monotype & interacts perfectly with the typeface. I'm still working on some more plants, hills & critters to enable the user to create his very own \"candyland\" of sweet flavoured things.  \nA full character map might follow some day, but in the meantime requests & suggestions will be kindly appreciated ;-)  \nHope you all like it!\n\n| Attachment | Size |\n| --- | --- |\n| [Candyland.gif](http://web.archive.org/web/20150423162928/http:/typophile.com/files/Candyland.gif) | 25.86 KB |\n| [NewCharacters.gif](http://web.archive.org/web/20150423162928/http:/typophile.com/files/NewCharacters.gif) | 43.48 KB |\n\n",
  "author": "ill sans",
  "time": "15 Aug 2006 — 10:39am",
  "uid": "13099",
  "comments": [
    {
      "time": "15 Aug 2006 — 12:14pm",
      "content": "Looks great, only the n gets confused with an m.\n\nHéctor\n\n"
    },
    {
      "time": "15 Aug 2006 — 12:24pm",
      "content": "Some letters really might induce confusion -I know, especially the lowercase w followed by u might require a second look, but those are actually the letters I based on my own handwriting (m, n, v & w). I tried to use as little stems as possible to add to the fluent & elementary handwriting feel of the font.\n\n"
    },
    {
      "time": "15 Aug 2006 — 12:58pm",
      "content": "This type of thing has become popular, so sales prospects are probably  \nbetter than average. And the pi stuff is a very cute and useful touch.\n\nJust one suggestion: do consider a slanted version.\n\nhhp\n\n"
    },
    {
      "time": "15 Aug 2006 — 1:48pm",
      "content": "I like it! Cute, I would say.\n\nBut, I would definately take away (or at least think twice about it) one of the upgoing bowls (is it called that?) on both n and m - so that the n only has one upgoing, and the m two. It looks like the n is the m now, and the m is some non-existing letter consisting of two n's.  \nLike... “Camdylamd” ;-)\n\nVery cute dingbats aswell.\n\n"
    },
    {
      "time": "16 Aug 2006 — 1:05am",
      "content": "Actually, the m was the first letter I made ;-)  \nI've kind of grown fond of its handwritten look & although I hàve considered taking a bowl off of the m & n for legibility, I just didn't have the heart to change them.  \nI have also considered an italic version, but that would screw up the entire \"baseline wave\" & is probably way too advanced for me.  \nI might do a bolder outline version (with the current strokes in white centered in thicker black strokes to obtain 3 equally thick optical strokes).  \nI have no intentions of putting this up for sale, but it's nice to have options ;-)  \nBesides, I also included a simplified version of Tim Biskup's ( [http://www.timbiskup.com/](http://web.archive.org/web/20150423162928/http:/www.timbiskup.com/ \"http://www.timbiskup.com/\")) \"helper\" & San Rio's \"hello kitty\" (which -with a slight alteration in the second word- makes a fun combination with the turd in the 3rd row ;-p ) for personnal use. I'll try to contact them both to make sure they don't object to this (I'll leave out the turd part though).\n\n"
    },
    {
      "time": "18 Aug 2006 — 2:34pm",
      "content": "Have you also tried making the first upgoing stroke (which is not part of the letter really but more a movement of the \"pen\") a little bit closer to the following stroke than rest of the letter?\n\nThis will probably make it more legible, but still keep the concept.\n\n"
    },
    {
      "time": "18 Aug 2006 — 2:47pm",
      "content": "No, I hadn't even thought about that, but I wanted to make the letterjoints the same curve as the letters themselves so if you type a shorter letter on a different line at the same height, the curves will still be vertically aligned. If I'd make the joints shorter, I would either have to make a real monotype font òr settle for a scale-like effect.  \nMight be nice for a more legible alternative though (one in which I could make a regularly stemmed m & n as well ;-) ).  \nI haven't had much time to work on it the past few days (just a few extra dingbats), but I have been thinking about adding less decorative caps as well that I could also use in a segment (which doesn't look good & not at all legible now).  \nDon't know how far I really want to take this since I originally only wanted to make 10 custom letters, but there's still lots of things I can experiment with.\n\n"
    },
    {
      "time": "18 Aug 2006 — 8:44pm",
      "content": "I'm reading the 's' as an 'r'. Not sure if anyone else sees that, or if it's just me.\n\n- Lex\n\n"
    },
    {
      "time": "3 Oct 2006 — 7:06pm",
      "content": "Certainly cute. A little hard to read but I can see a company like Sanrio using it for their logotype.\n\n"
    },
    {
      "time": "21 Feb 2007 — 10:07am",
      "content": "I'm updating Candyland with a new font & a whole bunch of extra characters. Check out the preview!\n\n"
    }
  ]
}
