{
  "id": "27688",
  "title": "logo critique/advice",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi guys, i was directed to this site from another forum for some addvice on a logo i've been working on for a new online magazine that will focus on streetwear, shoes, art, and music. Any feedback or suggstions would be much appreciated. Thanks!\n\nHere are the latest versions i have:\n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format501_4705.gif)\n  \n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format502_4916.gif)\n  \n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format503_4036.gif)\n  \n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format601_6732.gif)\n  \n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format602_4978.gif)\n  \n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format603_3612.gif)\n\nThe magazine is called \"Format\". Since the magazine is focusing on cool stuff inside & out i thought a logo thats looks the same inside & out would fit well, so as you can see it's a mirror image ambigram.\n\n",
  "author": "noyz319",
  "time": "15 Aug 2006 — 1:07pm",
  "uid": "14264",
  "comments": [
    {
      "time": "15 Aug 2006 — 1:34pm",
      "content": "It reads surprisingly well. Nicely done.\n\n"
    },
    {
      "time": "15 Aug 2006 — 2:00pm",
      "content": "wow! Its going to be great one. I can read this easily.  \nBut im not satisfied with the final look of the logo..  \nnon of them seems final.  \nTry aligning the horizontal bar of the 'f' and 't\" to the x-height of the other letters, and reduce the height of these letters too.  \nI'm keenly waiting for its final version:)  \nsatya\n\n"
    },
    {
      "time": "15 Aug 2006 — 2:12pm",
      "content": "A surprisingle legible \"visual palindrome\" (is this the right translation?)! Very clever & definitely cool!\n\n"
    },
    {
      "time": "16 Aug 2006 — 12:52am",
      "content": "i like #1 best\n\n- 1-3 read better than 4-6  \n- the ones with swashed lower part of \"f\" and \"t\" are more natural  \n- baseline versions are more compact than ones with descenders  \n- and yes: I'd lower the bars to x-height and reduce ascender-height as well  \n- is the upper swash of the \"t\" in #1 longer than the swash of the f? It appears to me, but maybe it's an optical illusion\n\nIf everything is done, you may decide whether you still need the \"upstroke\" of the \"o\" or if you can sacrifice total consistency to a more natural form of this letter (it works with the upstroke as well of course).\n\n"
    },
    {
      "time": "16 Aug 2006 — 7:18am",
      "content": "maybe a happy compromise would be to just lessen the upstroke on the o and a.\n\n"
    },
    {
      "time": "16 Aug 2006 — 8:10am",
      "content": "Another happy compromise is to connect the 'f' and the 'o' and connect the 'a' and 't' for the middle design. Hopefully that'll still look consistent.\n\n"
    },
    {
      "time": "16 Aug 2006 — 11:42am",
      "content": "Thanks for the input guys, much appreciated! I'll post up the revisions as soon as i have them.\n\n"
    },
    {
      "time": "16 Aug 2006 — 12:42pm",
      "content": "The ones with the rounded terminals just say 'juvenille' to me, so I'd stay away from those.\n\n"
    },
    {
      "time": "16 Aug 2006 — 3:57pm",
      "content": "playing with the a/o:\n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format604_3741.gif)\n  \n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format504_6632.gif)\n  \n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format505_3534.gif)\n\n"
    },
    {
      "time": "16 Aug 2006 — 4:02pm",
      "content": "I think the 'a' and 'o' in #3 of your first post work the best. The 'f' and 't' from #1 of your first post are my favourite as well.\n\n- Lex\n\n"
    },
    {
      "time": "17 Aug 2006 — 7:19am",
      "content": "I have to agree with Lex. After seeing the changes, I think the original slanted-stems of the o/a are better. The latter '0' looks much more like a backwards 'a' while the originals were abstract enough that they weren't quite an 'a' or 'o' and seem to play off the ambigram better.\n\n"
    },
    {
      "time": "17 Aug 2006 — 8:14am",
      "content": "Try aligning the horizontal bar of 'f' to the x-height. You can also try some 'cuts' on the end of the strokes(specially down ends)..and you can explore few more variations in a/o. I have modifed the top curves of f/t a little..you can try that too.  \nI did it very badly as i dont have its originals...but you can modify these things nicely..These are just my thoughts..dunno they'll work or not.\n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/just%20a%20thought_3631.jpg)\n\n"
    },
    {
      "time": "17 Aug 2006 — 9:42am",
      "content": "Oh, I really like this kind of palindrome typography. It works: it's legible, and beautiful too. Think #1 is the best.\n\nWell done!\n\n"
    },
    {
      "time": "17 Aug 2006 — 11:50am",
      "content": "The only problem with yours, Satya, is that shearing the f/t at that height gives the illusion that the baseline on those two glyphs has been shifted up a few points. Plus the straight terminals on the o/a are not cohesive with the rest of the rounded terminals.\n\n"
    },
    {
      "time": "17 Aug 2006 — 1:14pm",
      "content": "noyz319, can you give me the vector file of this identity...I wanna try this. its very interesting..Im free these days. :)\n\n"
    },
    {
      "time": "17 Aug 2006 — 1:42pm",
      "content": "what about this one:\n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format507_6171.gif)\n\n"
    },
    {
      "time": "17 Aug 2006 — 1:48pm",
      "content": "here's a link to the vector version:\n\n[http://noyz319.com/format/format502.ai](http://web.archive.org/web/20131108184808/http:/noyz319.com/format/format502.ai \"http://noyz319.com/format/format502.ai\")\n\n"
    },
    {
      "time": "17 Aug 2006 — 2:55pm",
      "content": "Im not able to open this file..im on PC.\n\n"
    },
    {
      "time": "17 Aug 2006 — 8:13pm",
      "content": "Fast trial: why not to make letters a little different from each others, not just mirrored?\n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format_5245.jpg)\n\n"
    },
    {
      "time": "17 Aug 2006 — 8:54pm",
      "content": "No, the whole idea was to keep it mirrored, so that it can be read same from the back too. It must be resolved that way only.  \nWe can't move away from the problems..thats the only thing in design where fun comes.  \nLet's resolve it.\n\ncheers,  \nsatya  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n.  \n.  \nLive Typography\n\n"
    },
    {
      "time": "18 Aug 2006 — 2:49am",
      "content": "I go with shawkash.  \nIt's one thing to set up a rule and keep strictly to it whether it works or not, and another to make small tweaks so the original intention works well.\n\nIt is still readable backwards. it could, actually nobody does, but it could... And that's the original intention, not to actually read it backwards, but that it \\*could\\* be read backwards. It's about the idea, not the practical actual action.  \nTo specify this: It's the same as with Futura: the idea of a geometrical typeface ist nice, but when creating it the designer comes to the conclusion that things just do not work that way. The trick is to make them work with small tweaks, without dropping the idea as a whole.\n\nI would also tweak the horizontal bars a bit, making the left part of the \"f\" slightly shorter, the right longer, and the same thing for the \"t\", so the characters look more natural.  \nAnd I would stick with the curved lower part of \"f\" and \"t\" (the ones from #1 in the original post). They give the \"t\" it's natural form that is distorted by the upper curve at the moment, and do not bother the f.\n\nAnd of course, spacing is not good yet in shawkash's version: \"m\" and \"a\" need more space.\n\nedit: here is a quick scetch (it still needs some finetuning, but the intention should become clear)\n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format502_4041.png)\n\n"
    },
    {
      "time": "18 Aug 2006 — 5:00am",
      "content": "OK, my two cents:\n\n\\* I like suggestion number one the best. It's clever and you can read it.  \n\\* I think there's room for improvement with the \"f\" and \"t\". I think you should decrease there height somewhat so that they don't stick up as much, and perhaps make the vertical bar shorter for better spacing. Maybe make everything just slightly bolder?\n\n"
    },
    {
      "time": "18 Aug 2006 — 8:55am",
      "content": "few explorations..\n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format%20explorations_5080.jpg)\n\n"
    },
    {
      "time": "18 Aug 2006 — 9:11am",
      "content": "Also because when I saw the logo at first time, I had read it \" farnrat \". I didn't recognize it was Format except after reading the brief.\n\n"
    },
    {
      "time": "18 Aug 2006 — 9:12am",
      "content": "I think this one will work..what you guys think??  \nBecause i asked 8 peoples(my friends) and all said its 'format'.\n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format%20curved%20copy%20copy_5121.jpg)\n\n"
    },
    {
      "time": "18 Aug 2006 — 4:43pm",
      "content": " ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/FORMAT%20SHINING_3475.jpg)\n\n"
    },
    {
      "time": "18 Aug 2006 — 4:51pm",
      "content": "In my mind's eye I'm flipping that first \"o\" to an \"a\" so it reads \"farmat.\"\n\n"
    },
    {
      "time": "19 Aug 2006 — 8:04am",
      "content": "I agree with Tiff. Apart from the f & t problem ( I agree mostly about that #13 post from sn rajpurohit ( staya) works best for me. For me it solves the a/o issue best so far. I would run with a modified version of it.\n\n"
    },
    {
      "time": "19 Aug 2006 — 3:25pm",
      "content": "Another approach to treat o/a:\n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format502_5339.png)\n  \nWould need some refinement in stroke thickness etc. where f-o and a-t join. Also I think that it puts too much visual weight on \"fo\" and \"at\", so I'm unsure but thought I'd share the idea. Also tried playing around with connecting f-o-r and m-a-t, but that resulted in o looking too a… \n"
    },
    {
      "time": "20 Aug 2006 — 2:51am",
      "content": "My taste would definitely be for the top image in your first post, I think the rounded versions work so much better in with the ambigram concept while retaining the legibility component, there is something about the white space between the fo and at pairs where the two curves have different radii, you could look at kerning the or and ma pairs out to take into account the large open counters of the rm. Your last post with the semi-rounded terminals might work better if you lower the crossbars a touch and change the kerning as above.  \nTim\n\n"
    },
    {
      "time": "20 Aug 2006 — 4:01am",
      "content": "I liked the idea of 'Stephan Kurz' to join the ends of 'fo' and 'at'..but also agree that they grabs to much of attention because of the too much visual weight over there(but this can be resolved)...other wise its a nice solution.\n\nwelldone guys!\n\n"
    },
    {
      "time": "21 Aug 2006 — 7:50am",
      "content": "I agree with timd. Sometimes the first solution is the best solution.\n\n"
    },
    {
      "time": "24 Aug 2006 — 3:15pm",
      "content": "Thanks for the input guys. Here is the final version, client approved:\n\n ![](http://web.archive.org/web/20131108184808im_/http:/typophile.com/files/format-08_3807.gif)\n\n"
    }
  ]
}
