{
  "id": "27686",
  "title": "Fontalicious Fonts Again for Sale!",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi All!\n\nAs promised, with the news of the [Font Bros](http://web.archive.org/web/20150123075439/http:/www.typophile.com/wiki/Font%20Bros) launch, I thought it was a good time to also discuss the news of the [Fontalicious](http://web.archive.org/web/20150123075439/http:/www.typophile.com/wiki/Fontalicious) font foundry re-releases.\n\nOver a year ago I got in touch with [Ben Balvanz](http://web.archive.org/web/20150123075439/http:/www.typophile.com/wiki/Ben%20Balvanz) who granted us the exclusive right to distribute his collection. We had the opportunity to work from the original .fog files to digitally remaster and expand all of Ben's original fonts to complete character sets and improved metrics while keeping the original vision of the work as Ben intended it.\n\nAt the launch of the site, we've only remastered and released perhaps 25-30% of the entire collection and are in the process of getting the entire collection again available for sale and licensing.\n\nHaving run the Font Diner for over 10 years, I have learned a lot about distribution and decided it was a good time to take the best of what I know and bring it to bear among some of the most talented font designers online. While my knowledge extends to the design, marketing, and licensing aspects of the company, my founding partner and brother Mike Ibach will be managing the daily operations.\n\nWe're always looking for new display fonts to carry but are selective about what we will feature at the site so this is an open call to all Typophiles to drop an e-mail (stuart at fontbros dot com) and let me know if you'd like to chat further. It has been our goal to favor our designers and teach them about building great quality fonts and the fine art of licensing their work.\n\nOften times there isn't enough guidance in our industry and rather than just releasing new work into the wild and taking a cut, we'd rather do more to help you grow as a professional type designer.\n\nBest,  \nStuart :D\n\n",
  "author": "Diner",
  "time": "15 Aug 2006 — 12:27pm",
  "uid": "1226",
  "comments": [
    {
      "time": "15 Aug 2006 — 12:43pm",
      "content": "The fontdiner influence is still showing on your site... Niccce!  \nVery nice offer aswell! I don't know much about the whole type design industry, but I can imagine it's a hard place to find decent guidance.  \nGood luck with your company!\n\n"
    },
    {
      "time": "15 Aug 2006 — 1:06pm",
      "content": "Thanks for the kind words! When I was the thick of the design process, it was hard to escape the 'retro' so I went with it but 'modernized' it a bit so the look wouldn't get dated after a short time.\n\nStuart :D\n\n"
    },
    {
      "time": "15 Aug 2006 — 1:12pm",
      "content": "Retro is OK in my book. I've scavenged the attic for all of my mom's original 70s stuff when I moved out. Luckily for me, my mom & both my sisters have a \"better\" taste, so I got to take all the treasures with me!\n\n"
    },
    {
      "time": "15 Aug 2006 — 2:00pm",
      "content": "Congrats, Stuart! We missed you at Typecon, but it looks like you had other things keeping you busy this past week (and longer).\n\n"
    },
    {
      "time": "15 Aug 2006 — 11:09pm",
      "content": "Thanks Paul! I definitely plan to see everybody in Seattle for next year but wanted to take some time to get this and some other projects off the ground before then.\n\nStuart :D\n\n"
    },
    {
      "time": "16 Aug 2006 — 5:25am",
      "content": "Checked out site using Safari on G5 Mac - clicked on style buttons - got this error message:\n\nLicense Error  \nThe following error message was returned by the shopping cart:  \nThis web store is not licensed to operate on this web server. Please obtain a new license from your software vendor.  \nError Code: -9\n\n"
    },
    {
      "time": "16 Aug 2006 — 6:44am",
      "content": "It should be working fine now - make sure you're going to fontbros.com, not fontbrothers.com - we're getting the redirect in place soon so the cart license error doesn't happen . . .\n\nStuart :D\n\n"
    },
    {
      "time": "16 Aug 2006 — 6:49am",
      "content": "Works great now! Will check it out -\n\n"
    },
    {
      "time": "16 Aug 2006 — 8:35am",
      "content": "This is really cool. Congratulations, Stuart! I'm happy (all of) you finally were able to take the site live. Competition is good for business and I'm all for business being good.\n\n(Am I missing something, or is there not a page on which to view all the foundries?)\n\n"
    },
    {
      "time": "16 Aug 2006 — 10:05am",
      "content": "Very interesting from an historiographic (?) POV.\n\n\"Retro\" (1936--65) seems to be a grab-bag term for the era between Deco (1910--35) and Groovy (1966-78), because really, it's all retro, ie \"Modernism, huh?\".\n\nBetween Groovy and New Wave, there's a missing year, 1979: Punk? Should be 1977.\n\nIf you had of stuck to the musical metaphor:  \nDeco would be Jazz  \nRetro would be Pop (which would include Swing, R&B, and Rock'n'Roll)\n\nNicely done bro, rock on!\n\n"
    },
    {
      "time": "16 Aug 2006 — 11:43am",
      "content": "Thanks Tiffany! And to clarify, if you want to see all the foundries, simply check out the home page! :D - Each foundry has two featured fonts that appear in random mini showings on the home page and the real cool part is that we developed programming to assure each home page mini showing gets equal face time among our foundries.\n\nWhen you sit down to think really hard about the fairest way to share pixel room on the home page among a collective, this seemed like the most logical method. In addition we feel the work speaks of the quality of the foundry and we felt it was as important to present the work as a quality collection rather than a gathering of individuals.\n\nAnd thanks Nick for your thoughts on the Selectonic categories. Generally classifying display type by its aesthetic is a subjective judgement so we were more focused on creating simple buckets for each style so that the end user wouldn't be disappointed with the results they were expecing when they clicked on those terms. Overall I'm very pleased with the results of this.\n\nToo often there is a desire to assign way too many keywords to a specific font design which instead of helping the font by bringing it to the top of every style search ends up dilluting what category it is most powerfully defined as so we decided to be more 'stingy' with the results. I think people appreciate that . . .\n\nStuart :D\n\n"
    },
    {
      "time": "16 Aug 2006 — 5:10pm",
      "content": "Stuart YOU ROCK!!!\n\nBen Balvanz is the best type designer in the world and it SO very cool that the Fontalicious marquee is here to stay! If it wasn't for Fontalicious I would have never have started appreciating type the way I do now. (So there! Free fonts are GOOD!!!) Fontalicious is the benchmark in 'cute and funky' that no one has surpassed.\n\nI wonder though... will Ben be designing new fonts anytime soon or is he just focusing on his t-shirt biz?\n\nNow for my 2 cents on the site:\n\nThe new site is too dark. I think the background elements need more color- to make the type see a little more dynamic. When I look at Fontdiner the colors and graphics are stimulating and inviting. Does this mean make a themed page for each font/collection? No. What I mean is that the elements surrounding the font images are dull and suck the life out of the fonts.\n\nAnd the jukebox theme doesn't fit (for me). The website says nifty 50's but not all the fonts being distributed (or in the future) have that feeling and that (to me) diminishes the capacity to perceive the type designs in end-users context. Another design more slightly more neutral in this regard will allow you to sell anything in the future.\n\nOn the home page the fonts are broken up into two columns. This list visually merges all the designs together and- again- can take away from someone browsing along and spotting the perfect font for their project.\n\nI know it was mentioned earlier but the ability to sort by foundry/designer is a must. It’s a feature that is expected and it’s a selling point too… you have foundries I have never heard of before.\n\nI hope you don’t think I’m being a jerk or anything. I just really like the premise behind your new site and I want you to have the most success :-)\n\nAnd besides- we need every designer (and their grandmothers) to start buying up Bens fonts so he can make us more new goodies!\n\nAll my best to you on your new venture,\n\nMike Diaz\n\n"
    },
    {
      "time": "16 Aug 2006 — 5:59pm",
      "content": "I think the juke box metaphor works fine, it doesn't have to be any more precise.  \nTypically, juke boxes were in use for a long time, so you could listen to a song from the 50s on a 60s jukebox, during the 70s.\n\nAs for the colour, yes it's dark, but it didn't bother me, more Astigmatic than Diner I thot. But I'm working on my old sony CRT monitor right now, I spect it would be brighter on my laptop.\n\n"
    },
    {
      "time": "16 Aug 2006 — 8:24pm",
      "content": "Hi Mike!\n\nThanks for your kind words about Ben and his work and your honest critique of the site. . .\n\nI agree with you that Bens font work was always original and unique and I felt it was too important to let his collection fo work simply remain abandon and unavailable for purchase or licensing. For me, I am pleased just to be able to help bring it back to the masses among his fans who like yourself so admired the amazing work he created.\n\nNow regarding the site, even though retro flows through my veins, rest assured a jukebox was NOT even closely inspired when I created the design of the site. Generally jukeboxes are far more colorful, have many moving lights and more whiz-bang elements. The original inspiration was actually an old film projector from the 1930s which has a beautiful textured enamel finish and brushed steel accents. The buttons were inspired by old ivory bakelite plastic. Just to be clear about the aesthetic inspiration . . .\n\nAnd generally Nick and Mike you are both correct in your observation that it is a 'darker' site. This primarily was important so the site could do its job well much like the bezel that surrounds a tv tube. Its purpose is to present content, be interesting, but compliment what it is presenting, not be the focus of the presentation. The fonts are the stars of the show and so it was important to present them as the main focus. That aside, it was important to me to be able to present a foundry to end users that could be taken 'seriously' and presented the work professionally I feel something bright and bouncy wouldn't be taken as serious as what we ended up with.\n\nBeyond that, if you take a blank sheet of paper and sit down to create an online commerce site that retails font software among 12+ individuals/foundries, you start to become overwhelmed with a way to categorize the work, promote the foundries, the designers, and encourage a positive buying experience for the end user. Its alot like starting with a huge pile of books and designing a library where each author gets the same shelf space and everybody who enters can easily find exactly what they're looking quickly and check out hassle free.\n\nI agree that it isn't a traditional font foundry commerce model but then we're selling professional quality display type which is such eye candy to begin with, most of the audience who appreciates display fonts is getting a very full eyeful very quickly. Dare I say peep show!\n\nThanks for the comments though, we do appreciate 'em . . .\n\nStuart :D\n\nPS: To your comment about new fonts from Ben, I beleive there is some unreleased material sitting on a zip disk near Ben's computer I will try to pursuade him to mail to me! Personall, I think if he sees the renewed interest in his work he may start making new fonts from scratch.\n\n"
    }
  ]
}
