{
  "id": "27713",
  "title": "please help",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello all,  \nI'm new to this site and wondering if someone would be able to help me out with a fontographer question?  \n(I'm also new to fontographer). I'm experiencing difficulty with the metrics window.  \nI've created vector letterforms in illustrator and pasted them into their little corresponding boxes in the main font area.  \nI now want to fix up the kerning, so i've opened the metrics window and typed in a and b, this is fine and both letters can be seen side by side in the metrics window. However, if I type in any other combination, I can only view the letter 'a' which makes it tricky to know where to slide the measurement bars to for the corresponding letter. The example shows a and c typed into the metrics field.  \nthanks,  \nSally\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 1.png](http://web.archive.org/web/20110519105313/http:/typophile.com/files/Picture%201_44.png) | 28.37 KB |\n\n",
  "author": "<a href=\"/web/20110519105313/http://www.typophile.com/user/14278\" title=\"View user profile.\">sally</a>",
  "time": "<br>",
  "uid": "14278",
  "comments": [
    {
      "time": "",
      "content": "Just a guess: I think perhaps the outline for your c is open, so it's not filling in when it's previewed.\n\n"
    },
    {
      "time": "",
      "content": "Sally,\n\nHave you corrected the path direction on all glyphs and made sure the fill tint is set to 100 in the character information panel.?\n\ns.\n\n"
    },
    {
      "time": "",
      "content": "I've experienced the same problem (& I was also kind of new to Fontographer) & I think the problem lies somewhere in Illustrator. I've been trying so many different things (changing to black & white, CMYK, saving as .EPS for Illustrator 7, 6,...) & I actually managed to see some of the glyphs afterwards, but I've been messing around with it so much that I can't even remember what changes made the difference. Luckily for me, my font was very mathematical, so I worked with numbers instead of trusting my eyes. If I figure out what it was, I'll definitely let you know!\n\n"
    },
    {
      "time": "",
      "content": "Following on from ill sans comments, make sure the illustrator files are saved as EPS version 3.2, the earliest version.\n\n"
    },
    {
      "time": "",
      "content": "I suggest that you change the title of this thread to reflect it's contents. 'please help' isn't very descriptive. That way people who have the same problem, or who can help, are more likely to comment.\n\n"
    },
    {
      "time": "",
      "content": "I second Eben's suggestion. I almost grabbed my defibrillator. ; )\n\nFor a quick fix, you could try \"correct path direction\" on everything (select all at once), and maybe they'll show up. Otherwise I think you can select a preference to show open path ends, which are allowed in Illustrator, but not in FOG.\n\nThough it may not be very satisfying in solving this issue, Sally, I suggest something else: In the future, don't use Illustrator to digitize your type; use the type drawing tools built into Fontographer. Fontographer always had a difficult time importing EPS files, and there are pitfalls that may not be apparent: FOG scales outlines at different percentages on import, and there's this issue with path integrity that you've encountered.\n\nIllustrator's tools are not as useful or intuitive as FOG's for drawing type. Even if you're used to using Illustrator, I suggest you only use FOG for digitizing type. Since you already use Illustrator, it's a tiny learning curve, and it saves a bunch of time. You can also put scans in the background and autotrace or hand-trace them in FOG, so there's no loss of functionality. You can trust FOG.\n\nOne other note: Sally, please note the difference between spacing (the permanent, built-in sidebearings of each letter) and kerning (the additional tightening or loosening of specific letter pairs to compensate for gaps in default spacing). Space the whole font completely, and when that is done, THEN add kerning, only where it's needed. Kerning is only meant to fix problems that are unavoidable when the spacing is complete, such as LT, AV, or To.\n\nFor tutorials on spacing a font, see Briem, Underware, or Anatomy of a Typeface.\n\n"
    },
    {
      "time": "",
      "content": "Carl is absolutely right about the drawing tools. You will find that drawing curves in FOG makes much more sense for type. The curves spring out rather than collapse into a heap as they do in AI. Jump right in! the water is fine :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Maybe it's because I'm working with an older version of Fontographer, but the thing that really bugs me about it is that the tools don't have any shortcuts (eg. \"v\" for the selection tool). I spend most of my time in Illustrator & when switching to Fontographer (or Quark for that matter) I really feel like I'm only working at half the speed if not less.  \nThen again, Crossgrove is right about the little problems Fontographer has importing .EPS-files. I switched the box in the preferences to \"keep original size\", but it keeps fitting them in the window, so I had to add a lot of small \"guidelines\" in Illustrator to the smaller letters (that I later had to delete again in Fontographer) to make sure the whole thing wouldn't be scaled to fit the window... & it cost me a lot of aggitation, patience & all my mathematical skills to get the result I wanted.\n\n"
    },
    {
      "time": "",
      "content": "I know this is a very late reply, but if you're still having problems with your metrics window in Fontographer, try generating your font files, opening them & resave them as a fog-file. It worked for me!\n\n"
    }
  ]
}
