{
  "id": "27711",
  "title": "font piracy and the internet",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Although I am aware of the fact that their is widespread piracy of type in the design community, I'm somewhat perplexed on how and who exactly it's done. Is the majority of font piracy done between people who know each other, or anonymously through the internet, or what? And is participation in it limited to students and hobbyists, or do professional designers themselves take part in it? And finally, what venue does the majority of piracy take place through (traditional websites/peer-to-peer networks/ect)?\n\nJust curious, I hope you guys could clarify the whole situation to me!\n\n",
  "author": "alexhb",
  "time": "16 Aug 2006 — 2:28pm",
  "uid": "7571",
  "comments": [
    {
      "time": "16 Aug 2006 — 3:11pm",
      "content": "I would be willing to bet that the bulk of font piracy occurs at the corporate level. Many workgroups will actually be a licensed for a font family, but for far less users than actually use the software.\n\nAnd that's not to say that it's malicious, either. Many workgroups just have a hard time keeping track of which fonts are licensed for how many users.\n\nI'm sure their are also many individual font traders out there, but they are small potatoes compared with the big corporate abusers.\n\n"
    },
    {
      "time": "16 Aug 2006 — 4:05pm",
      "content": "\"Corporate\" is responsible, indirectly, for many small design firms pirating fonts.  \nIt's like, if you have to do some work for a corporation, and they use Meta or whatever, and you don't have it, a friend will help you out.\n\nI've found that large corporations are very responsible about their own software licensing, including fonts. They have IT people who don't want issues, and that includes piracy, conflicts, bad fonts, etc. Quite apart from ethics, playing it straight makes practical sense, you can get immediate foundry support if you have a problem, without having to worry whether you have a licence for the font in question.\n\nIt's easy for a freelance designer to acquire all the fonts from where they're working. Do people do that?\n\n"
    },
    {
      "time": "16 Aug 2006 — 10:15pm",
      "content": "interesting, although corporate piracy is a significant portion of font piracy, I was more interested in piracy done by individuals.\n\n"
    },
    {
      "time": "17 Aug 2006 — 12:06am",
      "content": "Many organizations (businesses, non-profits, schools, churches, etc.) often put up fonts for download on their website that that employees/memebers/the public can read/write their internal documents. In the vast majority of cases, these entities do not realize that they are violating IP or EULAs.\n\nP2P file-sharing is also a big piracy chanel. In some ways, I think it has replaced the role that static websites used to play in sile \"sharing\".\n\n"
    },
    {
      "time": "17 Aug 2006 — 4:02am",
      "content": "If you do not have to pay for anything and you can make money...it is profitable but...  \n [http://www.theregister.co.uk/2006/06/27/unlicensed\\_software\\_shocker/](http://web.archive.org/web/20131015063526/http:/www.theregister.co.uk/2006/06/27/unlicensed_software_shocker/ \"http://www.theregister.co.uk/2006/06/27/unlicensed\\_software\\_shocker/\")\n\n"
    },
    {
      "time": "17 Aug 2006 — 4:54am",
      "content": "I would assume that many designers use a lot of pirated fonts when they start out, simply because they can't afford to pay thousands of dollars for fonts and have small clients who don't want to pay for them either. For instance, how many graphic design students do you think really own all the (hundreds of) fonts they use at their home computers?\n\nI think most people gradually drop the practice as they become more established and start to work for larger clients. For a really well known designer doing very visible work for an established firm it would be stupid to use unlicenced fonts, as well as unethical.\n\nHowever, I am aware of people who illegally copy fonts to use when they try out alternatives for a design. When the customer accepts something, they'll buy the font. Personally I can't see anything much wrong with this approach, since it helps designers without hurting foundries in any obvious way.\n\n"
    },
    {
      "time": "17 Aug 2006 — 6:17am",
      "content": "This is an interesting question. Has anyone done a confidential survey to find out what is actually going on? I would think that maybe the new Monotype/Linotype joint owners might be interested in funding such a survey, as they now own most of the classic fonts.\n\n"
    },
    {
      "time": "17 Aug 2006 — 11:45am",
      "content": "Yes, I saw that article on typophile several weeks ago and I was suprised that a publisher (who should be familiar with the amount of work individuals invest in prodjects like books, records, and type and with with the design industry) would alllow that to happen. Its one thing for it to affect a company like BP, or General Electric, or another big conglomerate were most people don't realize that things like typefaces need to be licensed, but quite different with something like a publishing house.\n\n"
    },
    {
      "time": "17 Aug 2006 — 12:29pm",
      "content": "Actually I think the opposite would be true - large companies such as GE and BP would be more likely to have their desktops controlled, administered and locked down to prevent unauthorized software from being loaded. They'll also have corporate typefaces used for communications, limiting the need for employees to have a large number of unlicensed fonts.\n\nAs for the piracy angle I think there are two distinct groups of potential offenders. There are the collectors who just want to have as many fonts as they can, much like the neighbor who hoards cats. And then there’s the guy who ‘needs’ a font for a project and will ask around, search the web etc., to locate it. As Bruno said at TypeCon the goal of Font Explorer X is to make it easier and cheaper for that type of user to license a font than find a pirate copy. This is going to be hard. I’ve had various end-user email me over the years saying “I’ve just spent the last five hours searching for a free version of font X” – essentially putting the value of their time at 4 bucks an hour. :-(\n\n"
    },
    {
      "time": "17 Aug 2006 — 6:20pm",
      "content": "What I ment by that was that because they are so large and cover such a broad geographic area and have a large number of employees, their corporate typefaces would have to be loaded on a large number of computers and given to people who aren't familiar with the legalities of font licensing. Also, she sher number of people employeed by the company, it would be more diffucult to control distribution of software to an unauthorized end-user.\n\nI know for a fact that both of these companies had public or insufficiently secured brand websites. GE Brand Center was completely open, and BP Brand had just one username/password, brand/beyond. ( [http://www.cidoc.net](http://web.archive.org/web/20131015063526/http:/www.cidoc.net/ \"http://www.cidoc.net\"), [http://users.ncrvnet.nl/mstol/55.htm](http://web.archive.org/web/20131015063526/http:/users.ncrvnet.nl/mstol/55.htm \"http://users.ncrvnet.nl/mstol/55.htm\"))\n\n"
    },
    {
      "time": "17 Aug 2006 — 8:35pm",
      "content": "To try to answer Alex's original question:\n\nThere are many kinds of font piracy that use the Internet. All of these have some sort of legitimate use, but the proportion of non-pirate activity varies widely. Some examples....\n\n- Certain Usenet binaries groups\n- font sharing groups on Yahoo\n- peer-to-peer filesharing networks\n- Web sites that offer free font downloads\n\n"
    },
    {
      "time": "17 Aug 2006 — 10:30pm",
      "content": "\\>What I ment by that was that because they are so large and cover such a broad geographic area and have a large number of employees, their corporate typefaces would have to be loaded on a large number of computers and given to people who aren’t familiar with the legalities of font licensing.\n\n\\>I know for a fact that both of these companies had public or insufficiently secured brand websites.\n\nAs an aside these are great arguments for custom type vs off-the-shelf corporate font solutions. Imagine the hot water GE would have been if they'd posted Myriad or Avenir for the world to download, instead of the custom font they paid Monotype to make?\n\n"
    },
    {
      "time": "18 Aug 2006 — 11:43am",
      "content": "There is also a form of piracy where commercial fonts are opened in a font editor, renamed and then resaved. I suspect some of the free fonts floating around are in this catagory.\n\n"
    },
    {
      "time": "20 Aug 2006 — 3:01am",
      "content": "That's definitely the case. There's a stolen version of Bickham Script that has been given that treatment, for instance.\n\nT\n\n"
    },
    {
      "time": "20 Aug 2006 — 8:31am",
      "content": "\\>There is also a form of piracy where commercial fonts are opened in a font editor, renamed and then resaved.\n\nThat's very likely the case - check out the Ascender analysis of available free fonts - [http://www.ascendercorp.com/webfontstudy.html](http://web.archive.org/web/20131015063526/http:/www.ascendercorp.com/webfontstudy.html \"http://www.ascendercorp.com/webfontstudy.html\")\n\n\\>Copyright string – 68.9% failed (3152 fonts missing a copyright string)\n\nPeople like Ray Larabie and other legitimate free font makers will put their name in the (c) string.\n\n"
    }
  ]
}
