{
  "id": "27769",
  "title": "Taurine - Modern Style",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hey, I am currently a student in my second typography class. We have been working on a font for the past 6 weeks, and I am to the point where I am ready to input it into a font software. However, I wanted to put it out there first for a critique\n\nThis is my first font, so any and all feedback is very much appreciated.\n\nMy inspiration for this font is from a Celtic writing style mixed with a Modern typestyle (Didot being my primary reference.) While most of the Celtic touches have disappeared during revisions, a few touches still remain.\n\nI am mostly looking for consistency between the letterforms, however all comments and suggestions will be helpful.\n\nAnyways, I am looking forward to some outside opinion. I have been staring at these letters for so long that I tend to not see the flaws until someone points them out to me.\n\nBecause I have not put it into the font software yet, I am not including entire paragraphs of text. However, I did hand set a quote in three different sizes, so I am including that as well as the upper and lowercase. I have the numbers and most of the punctuation and special characters drawn and inside the computer, but they are not cleaned up yet, so I am not including them.\n\nFor the time being, this font is called Taurine, named after the main ingredient consumed while creating it, hope you enjoy.\n\n| Attachment | Size |\n| --- | --- |\n| [taurine.pdf](http://web.archive.org/web/20150123065201/http:/typophile.com/files/taurine.pdf) | 250.41 KB |\n| [passage.pdf](http://web.archive.org/web/20150123065201/http:/typophile.com/files/passage.pdf) | 396.62 KB |\n\n",
  "author": "ncharshaf",
  "time": "20 Aug 2006 — 5:25am",
  "uid": "12382",
  "comments": [
    {
      "time": "9 Sep 2006 — 9:54pm",
      "content": "I love it...to my eye, it's quite original and fresh...love the H and K, both caps and lc, esp how the top crossbar offsets the inventive action down below for the lower case k. I'm not a type designer, just a bigtime consumer, so I can't give more detailed by-the-letter critiques, but this one has real promise and I hope you carry it on.\n\n"
    }
  ]
}
