{
  "id": "27780",
  "title": "New logotype review",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Here is a logotype we are working on for an architect. This client does really nice work, very simple and sharp but with some bits of beautiful ornament. I have thought of it like the photos of the opening of Mies' Barcelona Pavilinion: an iconically simple structure inhabited by a bunch of guys in top hats and women with fur collars. Hope that means something to some one out there.  \nMy design idea therefore is to create a mix font - Helvetica Neue Ultra Light representing style and simplicity, American Typewriter representing a sort of ornament, VAG Rounded representing a smart but friendly attitude, and semi serifs (The Mix or Rotis Semi) representing technological ornament. Sounds like a lot, right?  \nThe actual aprocess has been to modify Hel to create this mix, taking selective cues from each of the previous.  \nSo, just looking for general comment and tips to refine this. I am confident in the design and really like it generally.  \nPlease be aware that I love Helvetica, tight letterspacing, Swiss-style simplicty and all those other things that you might hate! Our client shares my general design disposition.  \nThis is my first post, so thanks for taking it easy on me!\n\n| Attachment | Size |\n| --- | --- |\n| [BY concept.GIF](http://web.archive.org/web/20150123095718/http:/typophile.com/files/BY%20concept.GIF) | 5.02 KB |\n\n",
  "author": "jbland",
  "time": "21 Aug 2006 — 12:59am",
  "uid": "14319",
  "comments": [
    {
      "time": "21 Aug 2006 — 1:10am",
      "content": "I like what you've done with the b, a, h & t, but I'm not too sure about the dots & kerning. I'd try to make a version with more square-ish dots & more space inbetween the letters (\"higher\" kerning?).  \nIs the t-tail the same width as the a-tail (it seems thinner)?  \nOh, and I still have a thing for Helvetica (not to mention Rotis Semi Serif) as well ;-)\n\n"
    },
    {
      "time": "21 Aug 2006 — 11:06am",
      "content": "_(“higher” kerning?)._\n\nill sans, do you mean more spacing, kerning is more the space between certain characters  \nsuch as 'To, Ta, Tc' etc.\n\n"
    },
    {
      "time": "21 Aug 2006 — 11:21am",
      "content": "Both actually. In general I think it would look better if more \"open\", but some letters might need some extra adjustments (especially \"it\"). That however could already be resolved by adding extra space.\n\n"
    }
  ]
}
