{
  "id": "27809",
  "title": "Design in Ontario",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I know there’s a few people on here that hail from Ontario; I, myself am currently in Sudbury (please keep laughter to a minimum ). Moved here from NB for my wife’s schooling but are now considering the possibility of relocating to a different city, one that offers better employment opportunities in the industry.\n\nI do mainly focus on print design, but some web layout architecture as well. Currently working as the sole designer/artistic director for a small company up here and am wondering what the prospects are like in places like Ottawa (the first choice), Toronto, or several of the other southern cities.\n\nAny links, recommendations, etc… you might know of would be greatly appreciated.\n\nThanks  \nJonathan\n\n [‹ Old style figure height?](http://web.archive.org/web/20080725000059/http:/www.typophile.com/node/27918 \"Go to previous forum topic\") [Typo Puns Abound ›](http://web.archive.org/web/20080725000059/http:/www.typophile.com/node/27922 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080725000059/http://www.typophile.com/user/12112\" title=\"View user profile.\">jselig</a>",
  "time": "<br>",
  "uid": "12112",
  "comments": [
    {
      "time": " 21.Aug.2006 10.16am",
      "content": "[Canada](http://web.archive.org/web/20080725000059/http:/www.typophile.com/wiki/Canada)  \n [Nick Shinn](http://web.archive.org/web/20080725000059/http:/www.typophile.com/wiki/Nick%252BShinn)  \n [Type Club of Toronto](http://web.archive.org/web/20080725000059/http:/www.typophile.com/wiki/Type%252BClub%252Bof%252BToronto)\n\nand if you go just south of the border, there’s [P22](http://web.archive.org/web/20080725000059/http:/www.typophile.com/wiki/P22) in Buffalo.\n\n"
    },
    {
      "time": " 21.Aug.2006 10.22am",
      "content": "The question is: Is P22 hiring? :P\n\nBut really, it’s kind of a hassle to work in the US.\n\n"
    },
    {
      "time": " 21.Aug.2006 10.28am",
      "content": "Toronto is the once and future boomtown, so there are plenty of prospects, but as the ROC will tell you, it’s a rat race here, beggars and Beemers.\n\n"
    },
    {
      "time": " 21.Aug.2006 10.31am",
      "content": "Oh the girls are out ta bingo the boys are gettin’ stinko...  \n...sorry, couldn’t resist.\n\nAccording to the DIAC Design industry study, two thirds of all designers in Ontario reside in Toronto. I think that says something. Toronto is also the largest design centre in Canada and the third largest in North America (after NY and Boston).\n\nBeing born and raised in Ottawa, I can’t imagine there being much in the way of exciting design happening there - unless you fancy working for the government.\n\nLuke.\n\n"
    },
    {
      "time": " 21.Aug.2006 10.37am",
      "content": "You could be in worse places than Sudbury (like Kenora or Thunder Bay!)\n\nAs Luke mentioned, there isn’t much outside of Toronto: we’ve been looking at moving east to be closer to my in-laws, who are in London.\n\n(That being said, there ain’t much here in Calgary, where “design” and “art” aren’t considered “legitimate” occupations....)\n\nLinda\n\n"
    },
    {
      "time": " 21.Aug.2006 10.41am",
      "content": "In Sudbury, when you say design people think you’re a CAD operator or mining engineer.\n\n"
    },
    {
      "time": " 21.Aug.2006 10.44am",
      "content": "Oy, that’s sad. :-P\n\n"
    },
    {
      "time": " 21.Aug.2006 11.03am",
      "content": "If you’re job searching, there’s nothing quite as usefull as networking. Typophile is a great networking tool in that you get to know folks in the type industry. In fact, that’s how I found my job at P22, but as far as i know we’re not currently hiring.  \nThe fact that this topic came up today is kind of interesting because today i just got an email from someone i met at [TypeCon](http://web.archive.org/web/20080725000059/http:/www.typophile.com/wiki/TypeCon) to join their linkedin network ( [www.linkedin.com](http://web.archive.org/web/20080725000059/http:/www.linkedin.com/ \"www.linkedin.com\")). I was surprised at how many type people i know or know of are on that site. You may do well to use that site as a networking tool and start making connections and sending out feelers there as it is more dedicated to networking with people of all different occupations. In any case, i think it may be worth your effort. I hope this helps.\n\n"
    },
    {
      "time": " 21.Aug.2006 11.20am",
      "content": "I am a graphic designer and type teacher living in Ottawa and have lived here for about 15 years now. It’s a small town and most of our graphic design graduates do find work in and around Ottawa. With several schools churning out grads each year and an established graphic design community, there isn’t too much new work. Still, everyone I know is working and I still get the occasional freelance contract so I think that if you are resourceful, you’ll always find work. Ottawa certainly is a nice place to live, especially if you’re outdoorsy.\n\n"
    },
    {
      "time": " 21.Aug.2006 12.12pm",
      "content": "I like Ottawa for the city, which is in part, why we were looking there, despite it being the ’capital’ and general cluster of government work.\n\n"
    },
    {
      "time": " 22.Aug.2006 6.54am",
      "content": "“I can’t imagine there being much in the way of exciting design happening there - unless you fancy working for the government.”\n\nThough I have to say, Canada seems to ’get’ the value of graphic design in government moreso than down here in the US. From their postal service to their .gov web sites they seem to appreciate some thought put into graphic design.\n\n"
    },
    {
      "time": " 22.Aug.2006 9.48am",
      "content": "Ontario’s new logo:\n\n[http://typophile.com/node/20965](http://web.archive.org/web/20080725000059/http:/typophile.com/node/20965 \"http://typophile.com/node/20965\")\n\n"
    },
    {
      "time": " 23.Aug.2006 8.09am",
      "content": "“Though I have to say, Canada seems to ‘get’ the value of graphic design in government moreso than down here in the US.”\n\nIn general, I’d have to agree with you: I’ve worked in Ottawa and Washington and done a lot of government work on both sides of the border.\n\nThat being said, why is the official Government of Canada logo in Times Roman? aaaarrrrgggghhhhh (getting an early start on Talk like a Pirate Day!)\n\nLinda\n\n"
    },
    {
      "time": " 23.Aug.2006 8.20am",
      "content": "_official Government of Canada logo in Times Roman_\n\nIsn’t it (Fry’s) Baskerville?\n\nBut what’s with this??!! —\n\n[http://canada.gc.ca/main\\_e.html](http://web.archive.org/web/20080725000059/http:/canada.gc.ca/main_e.html \"http://canada.gc.ca/main\\_e.html\")\n\n"
    },
    {
      "time": " 23.Aug.2006 8.41am",
      "content": "Tombstone graphics, etcetera.\n\n[http://www.flickr.com/photos/19697494@N00/](http://web.archive.org/web/20080725000059/http:/www.flickr.com/photos/19697494@N00/ \"http://www.flickr.com/photos/19697494@N00/\")\n\n"
    },
    {
      "time": " 23.Aug.2006 9.00am",
      "content": "oops, posted to wrong forum! Excuse the gravestone imagery with reference to Ottawa! hahahah...!\n\n"
    },
    {
      "time": " 23.Aug.2006 9.07am",
      "content": "[http://typophile.com/node/10582](http://web.archive.org/web/20080725000059/http:/typophile.com/node/10582 \"http://typophile.com/node/10582\")\n\nDid you see this thread Andi?\n\n"
    },
    {
      "time": " 23.Aug.2006 9.10am",
      "content": "Thanks Nick - the more info the better.  \n (And sorry for the wrong post - too many windows open on my computer!)\n\n"
    },
    {
      "time": " 23.Aug.2006 9.56am",
      "content": "I can testify that jobs are far easier to come by outside of Toronto.\n\nI used to live/work in London, Ontario and our design firm always had vacant positions that we couldn’t fill. It was especially tough to find qualified intermediate or senior candidates... even tougher to find people willing to relocate to London!\n\n"
    },
    {
      "time": " 23.Aug.2006 9.58am",
      "content": "Ah, yes, the Regressive Conservative web makeover. Ain’t it putrid?\n\nThe last gummint style guide I saw stated it was Times Roman.\n\nNow whether it’s Times New Roman, or some other flavour....\n\nLinda\n\n"
    },
    {
      "time": " 23.Aug.2006 10.06am",
      "content": "I’ve been looking at a company called Organic in Toronto. They do pretty much all web stuff; not my ideal market but I suppose I could get back into it. They seem to have a plethora of vacancies right now.\n\nI’d relocate to London, it’s smaller and probably doesn’t have the same pollution problems.\n\n"
    },
    {
      "time": " 23.Aug.2006 11.29am",
      "content": "I like London a lot — there’s a reason their motto is “City of Trees” — but pretty much anywhere in southern Ontario is going to have a smog issue. There were certainly air quality warnings when we were out in June....\n\nRIM was looking for people awhile back. Have you checked their website?\n\n"
    },
    {
      "time": " 23.Aug.2006 1.51pm",
      "content": "I will leave Toronto after a 10 month stay at the end of the month. Glad to be going (to Sarnia). The trick to living in Toronto is to live within a few miles of where you work. I only had a 10 minute commute, others in the office were driving an hour or more. I never liked the idea of “working” for an extra two hours a day, without pay.\n\n"
    },
    {
      "time": " 24.Aug.2006 6.41am",
      "content": "Good point Don: there is that commuting problem. I know of many people who didn’t get to see their kids until they were tucking them into bed at night due to all the commuting they had to do. That’s definitely something to be wary of.\n\n"
    },
    {
      "time": " 24.Aug.2006 9.47am",
      "content": "The beauty of living in Toronto is that you can actually walk to the shops, rather than having to drive to the mall. You may have to settle for slightly smaller lodgings, but it’s worth it.\n\n"
    },
    {
      "time": " 24.Aug.2006 10.17am",
      "content": "I work in printing in Ottawa. I see plenty of top quality design stuff going by from the local design firms. Banfield-Seguin does work for Nokia. Hewson Bridge Smith is another biggie doing international stuff. There are quite a few others, because there is so much high tech and government work in the city.\n\nI was born and grew up in Toronto, and I would never want to live there again. Too polluted, a giant rat race, getting increasingly more violent all the time. It’s like a big US city now.\n\nOttawa has most of the same entertainments and things to do as Toronto, and within a few minutes you are out in the country if that’s what you like.\n\nTim\n\n"
    },
    {
      "time": " 24.Aug.2006 10.51am",
      "content": "_getting increasingly more violent all the time_\n\nDon’t believe everything the Tories say.\n\n[http://www.statcan.ca/Daily/English/050721/d050721a.htm](http://web.archive.org/web/20080725000059/http:/www.statcan.ca/Daily/English/050721/d050721a.htm \"http://www.statcan.ca/Daily/English/050721/d050721a.htm\")\n\n"
    },
    {
      "time": " 24.Aug.2006 10.54am",
      "content": "Did you know? Toronto has more sidewalk facing retail than all of the sunbelt states together?\n\n"
    },
    {
      "time": " 24.Aug.2006 12.17pm",
      "content": "Then there are those of us who don’t believe anything the Tories say! ;-)\n\n"
    },
    {
      "time": " 26.Aug.2006 1.35pm",
      "content": "People still listen to politicians? I hear the press doesn’t :P\n\nThanks Tim for the added info on Ottawa. In the coming weeks I’m sure I’ll be looking into a more comprehensive list of companies and whatnot.\n\n"
    }
  ]
}
