{
  "id": "27818",
  "title": "Bookends nameplate",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey all! Was wondering in you can give me some feedback on this nameplate I'm designing for a monthly news letter for a public library system. This is not a final version, it still needs work but it is the general direction I'm headed to.  \nAny suggestions?\n\nI was thinking something purely typographic that will in no way rely on cliched book imagery. I thought the lowercase 'k' and 'd' would serve to illustrate bookends and also serve to describe the diversity in reading material through different case settings. Does this make sense? Anywho, would greatly appreciate any critique.\n\nIvan\n\n| Attachment | Size |\n| --- | --- |\n| [Bookends.pdf](http://web.archive.org/web/20131108192515/http:/typophile.com/files/Bookends.pdf) | 30.1 KB |\n\n",
  "author": "Mister M",
  "time": "21 Aug 2006 — 4:17pm",
  "uid": "9114",
  "comments": [
    {
      "time": "21 Aug 2006 — 4:31pm",
      "content": "The uppercase <cite>E</cite> looks more book-like than the lowercase <cite>e</cite>.\n\n"
    },
    {
      "time": "21 Aug 2006 — 6:50pm",
      "content": "Yeah Spire, you're right. Anyone else have any comments?\n\n"
    },
    {
      "time": "22 Aug 2006 — 5:52pm",
      "content": "Anyone out there? Oh well, guess this posting is a little boring. Perhaps next time I'll offer free milk and cookies for those who comment:)\n\nIvan\n\n"
    },
    {
      "time": "23 Aug 2006 — 9:48am",
      "content": "bump\n\n"
    },
    {
      "time": "23 Aug 2006 — 12:01pm",
      "content": "I'm all for contrast in scale, but I think this is a little too much. The concept is fun, but I think it needs a little more work.\n\nOne idea would be to break the second smaller line so all three lines read:\n\nFrom the friends of  \nBERKS COUNTY  \nPUBLIC LIBRARIES\n\nYou could then play a bit more with the ascender height of the \\_k\\_ and the \\_d\\_ and at the same time enlarge the type of the smaller text.\n\n"
    },
    {
      "time": "23 Aug 2006 — 6:39pm",
      "content": "Thanks for the comments.\n\nPaul  \nDon't know what you meant by \"bump\". Do you mean bump as in; \"you really should bump the idea, and try somthing new\" or did you just type the word so you can get a \"comment\" in and thus benefit from my cookies and milk offer. (should have been specific about submition criteria)\n\nMiss Tiffany  \nI agree with you 100% about it needing more work. The more I look at it, the less impressed I am with the result (even at this early stage). Just a bit of clarification, what exactly did you mean the \"contast in scale\" being too much. Do you mean the contrast between the \"from the friends of Berks County Public Libraries\" and the nameplate or the mixing of both lowercase an caps. I do believe the ascender of both letters are high and will lower them. I also considering omitting the \"friends of...\" phrase all together. Is this idea even worth it or should I explore others?\n\nIvan\n\n"
    },
    {
      "time": "23 Aug 2006 — 6:43pm",
      "content": "Paul was posting a dummy message to \"bump\" your thread up to the top of the list of recent threads, in order to increase its visibility and improve the chances of getting responses.\n\nIt's a common practice on discussion forums.\n\n"
    },
    {
      "time": "23 Aug 2006 — 6:52pm",
      "content": "acutally... i was waiting for the \\*set\\* so i could spike it! er, um, spire is right.\n\n"
    },
    {
      "time": "23 Aug 2006 — 7:40pm",
      "content": "Thanks for that Paul. I was starting to think my idea was so lame that it didn't warrant anyone's attention. I would like your honest opinion about what i'm trying to do If possible. I've taken more serious steps at pursuing my growth as a designer (recently purchased Adobe CS2 instead of going bootleg to prove to myself how seriously commited I am about this) so I just want to gauge my design sensibility. I need brutal, honest critique. I feel it's the only way I'll reach refinement.\n\n"
    },
    {
      "time": "24 Aug 2006 — 10:24am",
      "content": "When I said, \"contrast in scale,\" I was referring to the size difference from the word \"bookends\" to the sentence.\n\nIf you shorten the ascenders anymore than they are you will eliminate some legibility as you are already interrupting the legibility by putting words in between them.\n\nIf the books are donated, I think the phrase \"from the friends of\" is very nice and you should use it.\n\nYou could also try using a lowercase b at the beginning and switch the k to be a unicase K and then have that additional space for the friends of to breathe a little more. While you are at it, does it have to be bookends? I guess you'd usually find two and so the need for plural, but if you made it singular you would have bookends implied by the ascender of the b and the d.\n\n"
    },
    {
      "time": "24 Aug 2006 — 6:23pm",
      "content": "Oh, I see now what you mean. You're right the contrast in scale is too much. I will try your suggestion about using a lowercase b at the beginning and switching the k to be a unicase K. The Idea of naming it just bookend crossed my mind and it would definately make the solution more simpler but they won't go for it. They've used they exsisting title for so many years. I'll explore some more options and submitt new versions. Thanks for the input. You're a great help.\n\n"
    },
    {
      "time": "27 Aug 2006 — 8:33pm",
      "content": "New versions for review. I like the first one the most. though maybe he second one might make \"more sense\". There's just something about the 'S' (on the second one) that seems a bit off. I'm working on one ersion with custom lettering which I'll post soon. In the mean time, these will hopefully serve to display the process. Let me know what u think.\n\n ![](http://web.archive.org/web/20131108192515im_/http:/typophile.com/files/Bookends-1_4275.jpg)\n\n"
    },
    {
      "time": "29 Aug 2006 — 3:13pm",
      "content": "The top version in your latest image is definitely better than adding a capital 'S' to the end. Plus, the ascenders of 'b' and 'd' are completely straight and symmetrical, whereas the bookend idea gets lost in the bottom version.\n\n- Lex\n\n"
    },
    {
      "time": "31 Aug 2006 — 2:38pm",
      "content": "My sentiments exactly Lex. And to be honest I really don't mind the 's' being outside the word bookend. I've seen book being place outside on a pair of bookends before.\n\n"
    }
  ]
}
