{
  "id": "27829",
  "title": "Best intruction books for CS2",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I recently purchased Adobe CS2 and was wondering what book(s) I can purchase that will best instruct me on it’s use. Should I buy a book covering the entire bundle or should I buy a seperate book for each program.\n\nIvan\n\n [‹ Independent Studio...suggestions?](http://web.archive.org/web/20080828095723/http:/typophile.com/node/27888 \"Go to previous forum topic\") [Service Mark Glyph ›](http://web.archive.org/web/20080828095723/http:/typophile.com/node/27877 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080828095723/http://typophile.com/user/9114\" title=\"View user profile.\">Mister M</a>",
  "time": "<br>",
  "uid": "9114",
  "comments": [
    {
      "time": " 22.Aug.2006 5.17am",
      "content": "Hey Ivan\n\nI’ve tried books but they really get boring real fast. So I tried this site [www.totaltraining.com](http://web.archive.org/web/20080828095723/http:/www.totaltraining.com/ \"www.totaltraining.com\") and got this bundle\n\n[http://www.totaltraining.com/prod/bundle/creativesuite2\\_std.asp?mscsid=](http://web.archive.org/web/20080828095723/http:/www.totaltraining.com/prod/bundle/creativesuite2_std.asp?mscsid= \"http://www.totaltraining.com/prod/bundle/creativesuite2\\_std.asp?mscsid=\")\n\nReal cool and there is always the manual\n\nMark\n\n"
    },
    {
      "time": " 22.Aug.2006 6.32am",
      "content": "For Illustrator, I personally think you’re better off experimenting & using online tutorials or forums in case of any problems. Or -worst case scenario- you can always read the manual ;-)  \nFor Photoshop you might want to buy a book if you really want to make full use of its capacities (but for basic things, the same goes for Photoshop as for Illustrator).  \nThere’s no better (or more fun) teacher than curiosity... mixed with a little stamina & interest, that is.  \nIf you’re used to working in older versions of these programs, it’s just of matter of staying up-to-date & the Adobe-site features all the new stuff.  \nGood luck!\n\n"
    },
    {
      "time": " 22.Aug.2006 8.01am",
      "content": "The “Classroom in a book” series are available for various Adobe products, and are very solid.\n\nAlso, I can highly recommend the book “Photoshop CS2 for digital photographers” by Colin Smith - best photo book I’ve come across.\n\nFor some great insights in the use of Illustrator for typography as well as some excellent drawing techniques and shortcuts, read the “Logo, font and lettering bible” by Leslie Cabarga.\n\n"
    },
    {
      "time": " 22.Aug.2006 11.39am",
      "content": "I actually recommend [Lynda.com](http://web.archive.org/web/20080828095723/http:/lynda.com/) rather than books. The videos are much easier to get through than books. A year ago, I transitioned a workgroup of 35 people from Quark to InDesign using only Lynda and it worked out great. Not to mention the cost of $20 per month is much cheaper than books.\n\nAlso, my experience is that Lynda is much better than Total Training.\n\n"
    },
    {
      "time": " 22.Aug.2006 12.35pm",
      "content": "The Visual Quickstart Books from Peachpit Press are good for learning and quick reference - I tell my students to buy them when they get a job - you can not remember everything if you do not use it everyday.\n\n"
    },
    {
      "time": " 22.Aug.2006 4.02pm",
      "content": "I still prefer books with detailed indexes in combination with extensive use of colored pencils for underlining and marginal notes and comments, because this way it’s possible to re-find special tricks even after some time has passed. So for InDesign I can recommend [Real World Adobe InDesign CS2](http://web.archive.org/web/20080828095723/http:/www.amazon.com/gp/product/0321322029/sr=8-3/qid=1156286584/ref=sr_1_3/102-9381537-2953704?ie=UTF8) by Olav Martin Kvern and David Blatner.  \nNice as well, e.g. as reminders, are [tips via email](http://web.archive.org/web/20080828095723/http:/www.senecadesign.com/designgeek/indesign.html) now and then, the corresponding discussions are even more interesting. There is a link to an [InDesign podcast](http://web.archive.org/web/20080828095723/http:/www.indesignsecrets.com/category/podcasts/) as well in case you like podcasts.\n\nFor beginners I’d second the “Classroom in a Book” series mentioned above.\n\n"
    },
    {
      "time": " 22.Aug.2006 5.47pm",
      "content": "Wow everybody, thanks!\n\nFreelanceren  \nI like what this site has to offer and I’m sure it’s a great resource. But I just spent alot of cash buying Adobe CS2 legitimately instead of bootlegging it and I need additional cash to buy myself a decent font library. Perhaps someday when my budget permits it I’ll buy a few videos.\n\nIll Sans  \nI agree wholeheartedly about self training through experimentation. It’s how I learned Illustrator. But my photoshop is weak at best, and I have no expirience with Indesign whatsoever. I want to learn as much as possible in the quickest amount of time and i think a book or two will do the trick. At least with a book, I can alway take it with me and read thru it when I have the time (like on my lunch break at work. Heck, even during work while I’m sitting on my desk.) What online forums do you suggest I visit?\n\nTermopolium  \nI’ve heard good things about the “Classroom in a book” series and it’s one of my top choices. I will definately check out “Photoshop CS2 for digital photographers” by Colin Smith since I would like to learn more about retouching and perhaps get into digital photography. I agree 100% about the “Logo, font and lettering bible” by Leslie Cabarga that’s why I bout a copy:)\n\nFisheye  \nThank you so much for putting me on to this site! It’s a great resource and the prices are very good. I’m thinking about purchasing their “InDesign Professional Typography” DVD.\n\nBojev  \nYou’re right about not remembering everything which is why I’d like to purchase a book. I’ll checkout your suggestions.\n\nTina  \nI’ve also heard good things about the “Real world” series. And I’ve already bookmarked the Seneca design site. Great resource!\n\nGracias Todos!  \nIvan\n\n"
    },
    {
      "time": " 23.Aug.2006 1.39pm",
      "content": "For specific problems I usely just “google” a bit with a few keywords, but when Iooking for some inspiration I frequently visit [http://www.computerarts.co.uk/](http://web.archive.org/web/20080828095723/http:/www.computerarts.co.uk/ \"http://www.computerarts.co.uk/\")  \nFor Photoshop tutorials you might want to visit [http://www.photoshopplanet.com/](http://web.archive.org/web/20080828095723/http:/www.photoshopplanet.com/ \"http://www.photoshopplanet.com/\")  \nI’ll try to post a few other links in the next days, but I’ll have to organize my favorites first ;-)\n\n"
    },
    {
      "time": " 23.Aug.2006 8.40pm",
      "content": "Mister M,\n\nI use books and the web depending on the situation i’m in. The web is unbeatable if you troubleshooting a specific problem, but I find that books are nicer for conceptual, or instructional content. Good books have excellent indexes, and personally I like printed pages as opposed to screen.\n\nNot sure about the rest of the bundle, but Ben Willmore has published [Photoshop CS2 - studio techniques](http://web.archive.org/web/20080828095723/http:/www.amazon.com/gp/product/0321321898/sr=1-3/qid=1156390619/ref=sr_1_3/002-6628514-3561600?ie=UTF8&s=books)\n\nI shopped around and read a stack of threads and reviews before I bought this one, and it really payed off.\n\nIt is honestly a fantastic book. Can’t speak highly enough of it. Ben is really good at making seemingly complicated topics seem easy. He doesnt offer scores of pointless ’PS effects’ tutorials, but rather explains how each tool/technique works and put them into context to real applications. It’s deep too! He covers a lot of ground.\n\n"
    },
    {
      "time": " 24.Aug.2006 1.47pm",
      "content": "I’m going to second Tina’s recommendation for “Real World Adobe InDesign CS2” by Kvern and Blatner. Blatner and Concepción’s podcasts are very informative, and they do answer e-mailed questions! Hands on training, although potentially expensive, is an option I’d seriously consider. The “Classroom in a Book” series, while well done, covers the basics and doesn’t go much further.\n\nAlso by the same group, try “Real World Adobe Photoshop CS2” by Fraser & Blatner and “Real World Image Sharpening with Adobe Photoshop CS2” by Bruce Fraser. I’d also recommend reading “Real World Color Management, Second Edition” by Bruce Fraser, Chris Murphy, and Fred Bunting. Do check out Nigel French’s “InDesign Type: Professional Typography with Adobe InDesign CS2”, which addresses the core of print collateral, that being well set text.\n\nAbove all, have patience; this is a complex group of programs you are embarking on learning. It takes time to learn them at an expert level. —Bill Lomax\n\n"
    }
  ]
}
