{
  "id": "27823",
  "title": "Looking for the best Sans Serif EVER",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Just kidding.\n\nBut I'm looking for some ideas on a sans-serif face for a logotype that is well crafted enough to be timeless but different enough to be cutting edge. Something with a humanistic feel but yet has a solid geometric foundation (yet without being too cold). Something that speaks to the gallery crowd, but yet has some street cred as well. Fun, but not tacky. Something that says fine art, but isn't as old-school and used to death as Futura. It should have a tiny hint of elegance, however.\n\nI guess this can begin to sound like the search for the perfect sans serif after all.\n\nAny thoughts are well received. I hate asking these questions, but at the same time I'm green to this frontier and submit myself to the masters.\n\nCheers,  \nDC\n\n",
  "author": "dcastillo",
  "time": "21 Aug 2006 — 9:58pm",
  "uid": "7765",
  "comments": [
    {
      "time": "21 Aug 2006 — 10:08pm",
      "content": "Scala Sans sounds like what you're looking for.\n\nMeta might work as well, though it's less artsy and more homey.\n\n"
    },
    {
      "time": "21 Aug 2006 — 10:09pm",
      "content": "How about Avenir?\n\n"
    },
    {
      "time": "21 Aug 2006 — 10:18pm",
      "content": "Sans fonts I like:\n\n[Proxima Nova](http://web.archive.org/web/20130207035833/http:/ms-studio.com/FontSales/proximanova.html)  \n [Richmond](http://web.archive.org/web/20130207035833/http:/typedesign.com/fonts/ricmed.html)\n\n- Lex\n\n"
    },
    {
      "time": "21 Aug 2006 — 10:19pm",
      "content": "These 'BEST FONT' threads are pretty ridiculous.\n\n"
    },
    {
      "time": "21 Aug 2006 — 11:11pm",
      "content": "It may be an absurd question to ask, but it does elicit interesting and useful responses.\n\n"
    },
    {
      "time": "21 Aug 2006 — 11:46pm",
      "content": "<cite>It may be an absurd question to ask, but it does elicit interesting and useful responses.</cite>\n\nAbsurdity is completely understood. That's why humor is necessary, because this is indeed a question that will get some intriguing and useful responses.\n\nI suppose the point of this thread is more on the lines of 'put us up on some new stuff we may not know about.'\n\nScala and Avenir are oldies and goodies, but I suppose I'm looking for something that has a bit more edge. Something with more flare points. I know what kind of sound I want, but couldn't tell you any chords.\n\n"
    },
    {
      "time": "22 Aug 2006 — 12:06am",
      "content": "Could you describe \"flare points\"?\n\n"
    },
    {
      "time": "22 Aug 2006 — 12:07am",
      "content": "What do you think about [Aptifer](http://web.archive.org/web/20130207035833/http:/www.linotype.com/137226/aptifersans-family.html)? It is a new sans serif framily from Mårten Thavenius that we just released at Linotype. It has a [slab serif](http://web.archive.org/web/20130207035833/http:/www.linotype.com/137269/aptiferslab-family.html) companion, too.\n\n"
    },
    {
      "time": "22 Aug 2006 — 12:08am",
      "content": "_I know what kind of sound I want, but couldn’t tell you any chords._\n\nNow you sound like a client.\n\nAnyway, Neutraface?\n\n"
    },
    {
      "time": "22 Aug 2006 — 6:44am",
      "content": "Verlag (HTF) is my new fave.  \nNobel\n\n"
    },
    {
      "time": "22 Aug 2006 — 8:09am",
      "content": "Futura is not, never has been and never can be used to death. It's actually a lot fresher than many of the brand new typefaces that come out. Have you tried Futura Condensed in all caps?\n\n"
    },
    {
      "time": "22 Aug 2006 — 10:27am",
      "content": "You should look at Bloemsma's Sans-Serifs:FF Balance and FF Legato. Really interesting.\n\n ![](http://web.archive.org/web/20130207035833im_/http:/typophile.com/files/brochure_balance_6434.gif)\n\n ![](http://web.archive.org/web/20130207035833im_/http:/typophile.com/files/legato_mirrored_c_5630.gif)\n\n"
    },
    {
      "time": "22 Aug 2006 — 12:08pm",
      "content": "Timeless, yet cutting-edge, humanistic, yet geometric, gallery, yet street, fun, yet classy, fine-art, yet fresh, elegant, yet not old-school....\n\nThis is the voice of the nightmare client. Offer 300 different solutions until they see the one they want. After looking at 300 of them they'll pick the safe system font.\n\nIf this is a logo, just draw it, so you can control how groovy/classy, fresh/timeless and organic/geometric it is. Who knows, it might be so good you could make a typeface out of it. Sounds like it would be an amazing typeface.\n\n"
    },
    {
      "time": "22 Aug 2006 — 1:40pm",
      "content": "<cite>This is the voice of the nightmare client. Offer 300 different solutions until they see the one they want. After looking at 300 of them they’ll pick the safe system font.</cite>\n\nIf this is a logo, just draw it, so you can control how groovy/classy, fresh/timeless and organic/geometric it is. Who knows, it might be so good you could make a typeface out of it. Sounds like it would be an amazing typeface.\n\nThe voice of the nightmare client will not leave my head! And please don't hold the details of my queries against me, I assure you they're in jest (to some degree).\n\nI'm already leaning strongly on drawing the iconic element of the logo by hand, and what seems fitting is a nice clean Futura face. I'd love to make the perfect typeface, but I respect and know enough about the craft too much to think this can easily be done and at the same time be successful. (if that makes any sense)\n\nI really appreciate all these suggestions. Verlag is beautiful. I'm loving the lowercase + italics. Antifer looks like something I would use for my own identity. It seems to have some DIN qualities, and I'm a huge fan.\n\n"
    },
    {
      "time": "22 Aug 2006 — 3:12pm",
      "content": "You could start with the closest current match and customize it for a logo.\n\n"
    },
    {
      "time": "23 Aug 2006 — 7:36am",
      "content": "Thesis - TheSans is one of my faves.\n\n"
    },
    {
      "time": "23 Aug 2006 — 1:12pm",
      "content": "I have been lucky enough to mess with the beta OpenType version of Galaxie-Polaris, with small caps, text figures and glyph palette large enough to give Minion Pro a run for its money, and I think it is pretty close to ideal. Grotesque, but not autoclaved like Helvetica. The full typographic accoutrements make it suitable for book type and, by extension, sophisticated smaller bits of type. V3 is not yet released, but it shouldn't be too long. If you get the regular version, you can upgrade later. So I recommend it as something new and good, and an alternative to the current deluge of Gill-esque humanist sans faces.\n\n"
    },
    {
      "time": "24 Aug 2006 — 3:58pm",
      "content": "Give a good look at DTL Prokyon, it is a great font that I have not seen used as a logo, but it is $$$$CHACHING.\n\nRodi\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "25 Aug 2006 — 8:11am",
      "content": "DTL Prokyon all the way. It costs some money to actually get enough type to work with, but it's great if you can get someone else to pay for it. That's what I did.\n\n"
    },
    {
      "time": "25 Aug 2006 — 8:31pm",
      "content": "_Could you describe “flare points”?_\n\nThe 22-inch distance between the seams at the bottom of your (grrooovy) trouser legs? The glowing afterimage burnt into your retinas after staring at the fireworks display? The tailights of my car as it disappears from view down that darkened highway? Or the thicker bits of the strokes in [Optima?](http://web.archive.org/web/20130207035833/http:/www.linotype.com/1305/optima-family.html)\n\nJust kidding. David maybe meant 'something with more _flair…_'\n\nBTW David, if you go for a nice clean Futura face, please take note of what Eric Spiekermann says [here](http://web.archive.org/web/20130207035833/http:/www.spiekermann.com/iblog/C61720386/E1641366970/index.html) because evidently not all Futuras were created equal. To my mind the [Neufville Digital](http://web.archive.org/web/20130207035833/http:/www.ftbauer.com/bswebs.G3?log%3Apkid=2&log%3Acompany=22&log%3Acontract=1&log%3Aserviceid=1&xtd%3Alanguage=es&pkid=2&idcompany=22&idcontract=1&idservice=1&language=es&behaviour=PRODUCT&menukeys=TYPES_BUSCADOR&buscador=Futura) one is the best, but other people may tell you differently.\n\nTo answer your initial question directly, I'd recommend Richard Dawson and Dave Farey's [ITC Johnston Sans](http://web.archive.org/web/20130207035833/http:/www.itcfonts.com/fonts/font/pid/415078/ITC+Johnston+Complete+Family+Pack/detail&grab_id=0&page_id=53647&query=ITC%20Johnston%20Sans&SCOPE=ITCFonts) as a contender. Also Jeremy Tankard's [Bliss.](http://web.archive.org/web/20130207035833/http:/www.typography.net/type/bliss.htm) They both say 'the art that conceals its art' to me, but they're both old school compared to Futura.\n\n"
    },
    {
      "time": "25 Aug 2006 — 9:44pm",
      "content": "_‘the art that conceals its art’_\n\n[Freight Sans](http://web.archive.org/web/20130207035833/http:/www.fontshop.com/showfont.cfm?fid=GF.118889.0.0)\n\n"
    },
    {
      "time": "26 Aug 2006 — 4:34am",
      "content": "Underware's Auto should definitely be on the list. I have paired it with an ocean of serif faces to great effect. It also appears in my personal letterhead, and it'll stay there, too. Don't forget to have a look at Sauna as well.\n\n[http://www.underware.nl/site2/index.php3?id1=fonts](http://web.archive.org/web/20130207035833/http:/www.underware.nl/site2/index.php3?id1=fonts \"http://www.underware.nl/site2/index.php3?id1=fonts\")\n\n"
    },
    {
      "time": "1 Sep 2006 — 8:38am",
      "content": "These suggestions are all great. My want list has expanded immensely!\n\nOddly but possibly predictably, the client went back with Futura, but they are worried about the low X-Height of the standard Futura, and would like something a little higher than usual. My easy answer to this would be to use [PL Futura Maxi](http://web.archive.org/web/20130207035833/http:/www.fonts.com/findfonts/detail.htm?pid=243160&grab_id=0&page_id=388&query=futura%20maxi&SCOPE=Fonts), but I know there's been some issues with some early digitizations being egg-shaped. Can anybody vouch for this version?\n\n"
    },
    {
      "time": "1 Sep 2006 — 8:44am",
      "content": "[Futura Maxi is indeed round](http://web.archive.org/web/20130207035833/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=C.106298.0.2&attributes.sampleSize=144&sampleText=ok&sampleSize=230), but a little extreme in x-height. I'd go for [Drescher Grotesk Small Sizes](http://web.archive.org/web/20130207035833/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=BT.122658.0.0) unless you need more weights.\n\n"
    },
    {
      "time": "2 Sep 2006 — 11:29pm",
      "content": "David; absolutely! My want list too is straining at the leash...\n\nFunny how clients do that – revert to the original (boring?) plan after asking the designer to consider so much else besides. I'd swear they do it on purpose...\n\nSince I put that earlier post up I had a chance to closely compare the Neufville, the Adobe Linotype and the Bitstream version of Futura, but I hadn't thought to include either the PL Futura Maxi or the Drescher Grotesk. To my eye the counters in Futura Maxi b,d,p and q as shown at the Fontshop font detail link do indeed, look egg-shaped. But not the o. If the x-height got increased but the type design attempted to stay true to the geometry then something had to give, right?\n\nAlthough I'm loathe to suggest it, [ITC Avant Garde](http://web.archive.org/web/20130207035833/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories=1&font_categories_search=font_name_search&searchstr=Avant+Garde) is often treated like a Futura with a greater x-height (maybe that's why my students like it so much: ).\n\nEven with the revamped Futura scenario my money would still be on [Neutraface](http://web.archive.org/) or [Verlag,](http://web.archive.org/) as modern reworkings of the same thing but with better features.\n\n"
    },
    {
      "time": "5 Sep 2006 — 4:48pm",
      "content": "A little unrelated, but does anyone else find Freight Sans a touch too cramped -- i.e., its word spaces are a touch too narrow?\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "5 Sep 2006 — 4:59pm",
      "content": "I actually find a lot of typefaces to be too loosely spaced (word).\n\n"
    },
    {
      "time": "5 Sep 2006 — 7:51pm",
      "content": "It is, Michael, and it will be fixed in the OT revision.\n\n"
    },
    {
      "time": "6 Sep 2006 — 12:30am",
      "content": "Hi everyone. I joined just so I could share this great sans font: _[Delicious](http://web.archive.org/web/20130207035833/http:/www.josbuivenga.demon.nl/delicious.html)_. It was created by Jos Buivenga, and he has even released it for free.\n\n"
    },
    {
      "time": "6 Sep 2006 — 4:41am",
      "content": "Thanks for the info, Stephen. Any idea when that revision is due out?\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    }
  ]
}
