{
  "id": "27842",
  "title": "Old movie credits lettering",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Can someone help me ID the font below.  \nI'm pretty sure its handdraw, but might there be something  \nout there like it?\n\nthank you  \ns  \nf\n\n| Attachment | Size |\n| --- | --- |\n| [arrow\\_.jpg](http://web.archive.org/web/20150124020117/http:/typophile.com/files/arrow_.jpg) | 39.75 KB |\n\n",
  "author": "SF",
  "time": "22 Aug 2006 — 2:08pm",
  "uid": "10870",
  "comments": [
    {
      "time": "22 Aug 2006 — 2:17pm",
      "content": "Similar to New Yorker Type:\n\n[http://www.myfonts.com/fonts/wiescherdesign/new-yorker-type/regular/](http://web.archive.org/web/20150124020117/http:/www.myfonts.com/fonts/wiescherdesign/new-yorker-type/regular/ \"http://www.myfonts.com/fonts/wiescherdesign/new-yorker-type/regular/\")\n\n"
    },
    {
      "time": "22 Aug 2006 — 2:23pm",
      "content": "More info on the variations of this font here\n\n[http://typophile.com/node/12831](http://web.archive.org/web/20150124020117/http:/typophile.com/node/12831 \"http://typophile.com/node/12831\")\n\n"
    },
    {
      "time": "22 Aug 2006 — 2:51pm",
      "content": "Thanks Patty. You saved me going through that again.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "22 Aug 2006 — 6:14pm",
      "content": "Thank you. That is very much like the one i showed.  \nBut i have some other samples of it used with a Lowcase.\n\nuhmmm. I will show you them soon as i get them. Maybe a mix.\n\nthanks  \ns  \nf\n\n"
    },
    {
      "time": "24 Aug 2006 — 1:07pm",
      "content": "Here are the example can anyone help me ID these fonts.\n\nthank you\n\n ![](http://web.archive.org/web/20150124020117im_/http:/typophile.com/files/openingcredit_6104.jpg)\n\n ![](http://web.archive.org/web/20150124020117im_/http:/typophile.com/files/Producer_4795.jpg)\n\n ![](http://web.archive.org/web/20150124020117im_/http:/typophile.com/files/the_players2_6583.jpg)\n\n"
    },
    {
      "time": "24 Aug 2006 — 1:22pm",
      "content": "That stuff is all hand-lettered. Sadly. Sorry.\n\n"
    },
    {
      "time": "24 Aug 2006 — 1:44pm",
      "content": "But might it be based on a old Face? then hand lettered?\n\n"
    },
    {
      "time": "24 Aug 2006 — 2:07pm",
      "content": "You could try looking through the [Lanston](http://web.archive.org/web/20150124020117/http:/www.p22.com/Lanston/) library or the [Sherwood Type](http://web.archive.org/web/20150124020117/http:/www.p22.com/sherwoodtype/fonts.html) library. The letter are vaguely Goudy-esque in their soft serifs.\n\n"
    },
    {
      "time": "24 Aug 2006 — 4:22pm",
      "content": "You could also try looking in the [Serif Font ID Guide](http://web.archive.org/web/20150124020117/http:/bowfinprintworks.com/SerifGuide/intro.php), using the key letters. That might show you some typefaces that resemble this lettering. (Hint for using the Guide: use the least ambiguous letters, even if you have samples of other key letters.)\n\n- Mike Yanega\n\n"
    },
    {
      "time": "24 Aug 2006 — 4:43pm",
      "content": "thanks all. I serif font id guide had no results in the seach. :(  \nBut Goudy Village is close but not all the letters. The upper and lower case Y.  \nis really different.\n\nbest  \nsf\n\n"
    },
    {
      "time": "25 Aug 2006 — 4:55pm",
      "content": "Any body else have suggestions on what font this example is based off?\n\n"
    },
    {
      "time": "25 Aug 2006 — 8:16pm",
      "content": "Are you under the impression that these are all showing the same typeface? Each one of your samples has something different in it, although the same lettering appears as one of the typefaces in the last two samples. Including the first sample, which was 'Irvin', you have about 8 different typefaces in your samples. Is there a particular one you want to try to identify a similar font for?\n\nThe assumption that you are making that these all must be based on a 'font' is not necessarily valid. As Tiffany said, those are all hand-lettered. Some of the hand-lettering could be original styles, and not copied from a metal typeface. The one with the strongly curved lower case 'y' is an example of something that may have been a style of that artist, and not a 'real' (existing) typeface at all. Even if there were a metal type that some of these were based on, they may not all have been digitized, so there might be no (digital) font like it at all.\n\nJust something to think about.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "26 Aug 2006 — 8:38am",
      "content": "Just to show that I can be at least as obsessed about these 'quests' as the next person, I went through Mac McGrew's book 'American Metal Typefaces of the Twentieth Century' page by page looking for something that might resemble the last sample in your series, which I will call 'Myrna' thanks to it's distinctive 'y'.\n\nThere was only one 'y' that was very close, and that was in the 'ty' ligature for 'Announcement Roman', done in 1916 by Morris Fuller Benton. That was almost its only resemblance to 'Myrna'. It seems the sweepingly curved 'y' was not very common in Twentieth Century metal type.\n\nSecondarily I looked for the odd 'a', which has no serif on the arch, and looks like it is going to tip over to the left. I couldn't find anything very close, although Pencraft and Packard had a little of that feeling, with a sort of blob serif that curls back into the letter. One other somewhat similar 'a' I will mention in a moment.\n\nWhile I was looking for these other specific letters I also was looking for typefaces that gave a similar 'feel' to 'Myrna', and here is where Goudy comes into it. For one thing Goudy's types often look like hand-lettering that has been cast in metal. For another, he often favors the stepped W, although I'm not sure we have this in the 'Myrna' lettering (it shows up in your other samples over and over though). In particular ['Kennerly Oldstyle'](http://web.archive.org/web/20150124020117/http:/www.myfonts.com/fonts/lanston/ltc-kennerley/regular/charmap.html) (I've linked to the Lanston version of Kennerley) has the Venetian 'e' and an 'a' that looks like it's tipping over, although it has a straight serif on the arch. Certainly it was around well before this movie was made in 1931. However, it's 'y' is barely curved. ['Goudy 38'](http://web.archive.org/web/20150124020117/http:/www.myfonts.com/fonts/redrooster/goudy-38-rr/), done in 1908, also has many of these features and has a more curved 'y'. The R and K are less similar, though.\n\nThe typeface that might have been the closest overall also has a Goudy connection. Robert Wiebking was an engraver of Goudy's designs since 1911, and in 1922 he released a design of his own called 'Munder Venezian'. It has the Venetian 'e', a stepped W, a K with the arms meeting below the midpoint on the stem (barely), an 'a' with no serif that leans ever-so-slightly leftward, and a somewhat sweepingly curved 'y', though not nearly as much as in 'Myrna'. (I can post a scan on a web page in a few minutes, but my old Mac cannot post into the thread. Grrrr!)\n\nAs far as I know, 'Munder Venezian' has never been digitized.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "26 Aug 2006 — 11:45am",
      "content": "I'm looking to ID all the fonts in the examples except the \"COPYRIGHT MCMXXX..\"  \nI'm not looking for a exact digital version, Just one or some thats are as close as possible. I going to have to redraw them, but i don't want to redraw them all.\n\nYes. The K, y, W, a, and the Swooping Capital A out of my example are the most distinctive. The ones' i most likely will have to redraw.  \nI have more example i'll post them monday.\n\nSo how do you think the person that made these title sequences (my examples) create them? Did he draw complete font set.  \nor was each title made as a one off like a piece of art?\n\nMike yes i would love to see the ‘Munder Venezian’ example.\n\n"
    },
    {
      "time": "26 Aug 2006 — 12:05pm",
      "content": "In answer to your question about how the lettering was done, the simple answer is yes, each title card was done as a one off piece of art. That's the way all display lettering was done when it was done by hand. The point is that there were people who did this for a living -- they were lettering artists, and they were very good at it. Many of today's font designers also got started doing lettering by hand, but the computer gave them a new tool for doing this job, and exactly duplicating each letter. Before computers, film types were made by photographing hand-drawn letters. Before that engravers made the masters for metal type from the hand-drawn lettering of the designer. Before that artists drew all the letters by hand.\n\nThere are others here who can probably speak from experience, but I would expect that each artist made himself a set of lettering master alphabets for each lettering style they used. Probably many were copied from existing metal typefaces, or at least influenced by them, but I think it's fair to presume that some of these alphabets were essentially original designs by these artists.\n\nYou can see the sample of Munder Venzian I have scanned [here](http://web.archive.org/web/20150124020117/http:/bowfinprintworks.com/ID_Sample_Pages/MunderVenezian.html).\n\n- Mike Yanega\n\n"
    },
    {
      "time": "27 Aug 2006 — 4:39pm",
      "content": "Here is a sample of Munder Venezian with its italic.\n\nLook, I can post images now!! (Upgraded to OS X with Mozilla, at last)\n\n- Mike Yanega\n\n ![](http://web.archive.org/web/20150124020117im_/http:/typophile.com/files/munder_venezian_full_3626.gif)\n\n"
    },
    {
      "time": "27 Aug 2006 — 5:20pm",
      "content": "Welcome to the future, Mike ;P\n\n- Lex\n\n"
    },
    {
      "time": "27 Aug 2006 — 7:52pm",
      "content": "Indeed! Only about three years too late (and still only barely into OS X), but at least I can post images again.\n\n- Mike Yanega\n\n"
    }
  ]
}
