{
  "id": "27879",
  "title": "Icon and Masthead",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "First time ever doing something of the sort, thought I’d get some views. I wanted to communicate simple, and nothing too distracting in the look.\n\nThe type, I couldn’t find a more simple serif font with ligatures. Want something clean and simple. Suggestions welcome.\n\nPersonally, I think the masthead works better without the icon and background ... on it’s own in a way. Let me know your thoughts anyway.\n\n [‹ logo critique/advice](http://web.archive.org/web/20080316192624/http:/www.typophile.com/node/27688 \"Go to previous forum topic\") [personal logo ›](http://web.archive.org/web/20080316192624/http:/www.typophile.com/node/27826 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080316192624/http://www.typophile.com/user/5453\" title=\"View user profile.\">stupid_child</a>",
  "time": "<br>",
  "uid": "5453",
  "comments": [
    {
      "time": " 24.Aug.2006 7.04am",
      "content": "Leave it, don’t touch a thing, if I was being picky I might say that the brain could look like one of those hand puppets where the fist and thumb form a mouth.  \nTim\n\n"
    },
    {
      "time": " 24.Aug.2006 7.18am",
      "content": "This looks very nice. I would lean towards the top treatment - an icon that can be used above or to the side of the type. The way you have used sharper angular lines, and smoother curved lines in the brain does bother me. I would smooth out and curve all those lines on the inside, the contrast of forms draws attention to the lines too much. Would probably look at some other type options as well, not that this is bad though. Nice work.\n\n"
    },
    {
      "time": " 24.Aug.2006 7.50am",
      "content": "I agree with the 2 previous posts: the typography part looks really great (nice colours too), but the brain could use a make-over. More curvy lines & perhaps a few more “bumps” at the top might do the trick.  \nLike Chris said: they do work better next to eachother or perhaps maybe even separately (like Mercedes has a logo & a type-logo that are hardly used together).\n\n"
    },
    {
      "time": " 24.Aug.2006 11.35am",
      "content": "Thanks guys, will see what I can do futher.\n\n:)\n\n"
    }
  ]
}
