{
  "id": "27902",
  "title": "Apple battery recall!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://news.bbc.co.uk/1/hi/technology/5283424.stm](http://web.archive.org/web/20080404214403/http:/news.bbc.co.uk/1/hi/technology/5283424.stm \"http://news.bbc.co.uk/1/hi/technology/5283424.stm\")\n\nCaused by Sony battery cells in G4 Powerbooks, IbooksG4 and 15in MacBook...\n\nMine is one and in the range but Apple’s website checker said my number is invalid.\n\naffected battery model: A1079  \naffected range: 3K428 - 3K611\n\nMine is A1079 and serial number 3K441.. but their stupid website said the number is invalid.\n\nAnyone else have an affected battery but Apple’s website say’s the serial no. is invalid?\n\nDell and some HP laptops have also had a Sony based recall.\n\n [‹ Nice type, shame about the content?](http://web.archive.org/web/20080404214403/http:/www.typophile.com/node/27640 \"Go to previous forum topic\") [How do you Classify ›](http://web.archive.org/web/20080404214403/http:/www.typophile.com/node/27883 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080404214403/http://www.typophile.com/user/7029\" title=\"View user profile.\">vinceconnare</a>",
  "time": "<br>",
  "uid": "7029",
  "comments": [
    {
      "time": " 25.Aug.2006 3.53am",
      "content": " ![](http://web.archive.org/web/20080404214403im_/http:/www.typophile.com/files/screenshot_01_6076.jpg)\n  \nFrom Apples website - you are correct Vince\n"
    },
    {
      "time": " 25.Aug.2006 3.59am",
      "content": "Yes I put the whole serial number in and it didn’t work. Then I tried it with just the 3K441 and it also didn’t work. So Maybe I’ll go down to the Apple store and show them the battery and see if they can sort it.\n\nEver since I had this laptop I was always worried it would catch on fire since I never trust Apple laptops since the Powerbook 100.\n\n"
    },
    {
      "time": " 25.Aug.2006 6.52am",
      "content": "“I never trust Apple laptops”\n\nTo be fair to both Apple and Dell, this has been Sony’s fault...and, specifically, the Chinese factory they sourced these batteries from.\n\n"
    },
    {
      "time": " 25.Aug.2006 8.00am",
      "content": "I am having the same problem. Please let us know if you have any luck at the Apple store or elsewhere.\n\n"
    },
    {
      "time": " 25.Aug.2006 8.08am",
      "content": "Hi there Guys,\n\nyou ave got me thinking now, I bought a G€ powerbook a couple of yars ago within this time period, what should I do to check the battery?\n\nM\n\n"
    },
    {
      "time": " 25.Aug.2006 8.19am",
      "content": "you should remove the battery by turning the screw thing on the bottom to release the battery.\n\non the back of the battery will be the battery model and serial number.\n\nCheck your numbers against the ones on [www.apple.com/support/](http://web.archive.org/web/20080404214403/http:/www.apple.com/support/ \"www.apple.com/support/\") Then select the link from ’Exchange and Extensions’ and ’Battery Exchange’\n\nThere you will find the models affected and the serial numbers affected.\n\n ![](http://web.archive.org/web/20080404214403im_/http:/www.typophile.com/files/battery_12inch_pbook_large_4852.jpg)\n\n"
    },
    {
      "time": " 25.Aug.2006 8.41am",
      "content": "fantastic, thanks for that,\n\n"
    },
    {
      "time": " 25.Aug.2006 10.00am",
      "content": "People are disappointed if their laptop doesn’t fall under the recall and they miss the opportunity to get a new fresh battery! The recall involves registering, waiting to receive a new battery and sending the old one back, so there’s no down time. By the way, I beleive Sony’s paying for the whole thing\n\n[https://support.apple.com/ibook\\_powerbook/batteryexchange/index.html](http://web.archive.org/web/20080404214403/https:/support.apple.com/ibook_powerbook/batteryexchange/index.html \"https://support.apple.com/ibook\\_powerbook/batteryexchange/index.html\")\n\n"
    },
    {
      "time": " 25.Aug.2006 10.12am",
      "content": "FYI to save you time opening up the back of your laptop:\n\nThe affected batteries were sold worldwide from October 2003 through August 2006 for use with the following notebook computers: 12-inch iBook G4, 12-inch PowerBook G4 and 15-inch PowerBook G4.\n\nI actually bought mine before this date so I guess I won’t self-combust.\n\n"
    },
    {
      "time": " 26.Aug.2006 7.24am",
      "content": "I called Apple support in the UK and they said that the reason the site said the battery serial number was invalid is because it is not affected and not one of the recall batteries. It has been made by somewhere else.\n\nSo 3K441 is ok.\n\n"
    },
    {
      "time": " 26.Aug.2006 3.26pm",
      "content": "[Your ’Book battery wasn’t recalled? Check again. Apple revises list.](http://web.archive.org/web/20080404214403/http:/www.macmerc.com/news/archives/3435)\n\n"
    },
    {
      "time": " 27.Aug.2006 1.07am",
      "content": "To clearify your battery might be in the range but may not be manufacturered with Sony parts.\n\nIe. 3K428 - 3K611 is the range for my PowerBook battery. My battery starts with 3K441 which is in the Apple recall range. The website said the number was invalid. Calling Apple they said that even though it is in the range some batteries in the range are made by different manufacturers and not affected.\n\nAlso a Dell we have is also in the Dell recall list and the battery is listed but the Dell website also says the battery is not affected even though it is in their recall list.....\n\n"
    },
    {
      "time": " 29.Aug.2006 2.31pm",
      "content": "When I first tried to enter the info on Apple’s Battery Recall page it didn’t work. I think this must have been because so many people were trying to access the site at the same time because the battery I was checking fell in the s/n range. Then a few days later I tried again and it worked. I am now waiting on a new battery.\n\nAt first the pages wouldn’t load completely. Then, after I entered the information and clicked continue, the link timed out. Later, the link worked but it said the battery s/n was invalid. A few days later I tried again and everything went through.\n\nThe point is, if your battery s/n is within the specified range, but you got a message declaring it invalid, perhaps you should try again.\n\n"
    }
  ]
}
