{
  "id": "27918",
  "title": "Old style figure height?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Should the “x-height” of old style figures correspond to that of the lower case, or the small caps?\n\n [‹ Question ... down but not down](http://web.archive.org/web/20080907042724/http:/www.typophile.com/node/27942 \"Go to previous forum topic\") [Design in Ontario ›](http://web.archive.org/web/20080907042724/http:/www.typophile.com/node/27809 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080907042724/http://www.typophile.com/user/2021\" title=\"View user profile.\">Nick Shinn</a>",
  "time": "<br>",
  "uid": "2021",
  "comments": [
    {
      "time": " 25.Aug.2006 11.33am",
      "content": "To the lowercase. It is nice to make special “small cap figures” for the caps, too… yet another figure option. But we’ve started to do this with some Linotype designs (Avenir Next, for instance). This means that an OpenType font has six figure styles, not including fractions, numerators, demoninators, etc.:\n\nProportional Lining  \nTabular Lining  \nProportional Small Cap Figures  \nTabular Small Cap Figures  \nProportional OsF  \nTabular OsF\n\nThere isn’t a pre-defined feature for SC figures, but you can write the small caps features so that if the number default is lining fuigures, and you turn on a small caps feature, the numbers will switch to SC figures when the letters switch to small caps.\n\n"
    },
    {
      "time": " 25.Aug.2006 11.41am",
      "content": "i would agree with Dan and say with the lowercase as they are more correctly referred to as [text figures](http://web.archive.org/web/20080907042724/http:/www.typophile.com/wiki/text%252Bfigures) with the assumption being that they are to be used in running text with the lower case. i also agree that if your smallcaps are taller, having a set of small cap figures would be useful. perhaps [hybrid figures](http://web.archive.org/web/20080907042724/http:/www.typophile.com/wiki/hybrid%252Bfigures) could be designed to work with the small caps?\n\n"
    },
    {
      "time": " 25.Aug.2006 11.44am",
      "content": "It depends on the design, e.g. how much lowercase and smallcaps height differ. Sometimes, lowercase height osf look a bit small, so smallcaps height is not too bad, at the same time they work with small caps. Making a special set of small caps numerals of course is nice too, but there are already so many numerals to do ...\n\n"
    },
    {
      "time": " 25.Aug.2006 11.47am",
      "content": "Good question. I don’t think there is any rule about this. Adobe Garamond’s OSF are between the x and the small-cap height. Karen Cheng gives examples of OSF both at and above x-height.\n\nThe best choice may well depend on the design. I’d be interested in people’s views of the pros and cons of different choices.\n\n"
    },
    {
      "time": " 25.Aug.2006 11.50am",
      "content": "I’d say trust your eyes not the x-height. Nothing worse than puny little old style numbers. If the typeface has a small x-height you’ll probably want to go a bit highter and vice versa.\n\n"
    },
    {
      "time": " 25.Aug.2006 11.52am",
      "content": "Quasi-simultaneous posting ... :)\n\n<cite>Adobe Garamond’s OSF are between the x and the small-cap height.</cite>\n\nIn addition to my previous post: x-height for osf may work too — in smallcaps context — for numerals’ ascenders compensate for their smaller x-height.\n\n"
    },
    {
      "time": " 25.Aug.2006 11.53am",
      "content": "after reading more and really thinking about it, i’m agreeing that x-height might be too small depending on the design.\n\n"
    },
    {
      "time": " 25.Aug.2006 12.00pm",
      "content": "Another important question is the height (meaning vertical size, not position) of 3 5 7 9 and 6 8. Most designers simply shift cap-height numerals down to get the oldstyle 3 5 7 9. However, depending on the typeface they can be too tall and might descend even further than the descenders, which just looks wrong. This is a mistake seen quite frequently.\n\nAs a second step, I would always adjust (decrease) the size of 3 5 7 9. As a result, 6 and 8 also have to become smaller, making them smaller than the lining numbers.\n\nMyriad and Minion are two examples where this is done particularly well.\n\n"
    },
    {
      "time": " 25.Aug.2006 12.28pm",
      "content": "_This means that an OpenType font has six figure styles,_\n\nIf the lining figures aren’t full cap height, you also need another big set for the “case” (all caps) feature!\n\nI don’t really think tabular small cap figures serve any purpose, and how would they be supported in the application menu?\n\nI propose that the logical disposition is to connect the “Small Caps” menu choice with proportional Old Style Figures, on the assumption that they will likely be used in text with U&lc — whereas “All Small Caps” would bring up lining, proportional, small-cap height figures.\n\nOr perhaps “Small Caps” should have no special provision for figures, but just leave the default or whatever other figure style is applied to the text.\n\nBut “All Small Caps” should definitely have lining, proportional figures, for use in places like a page folio, or in very small captions — as a sort of optically scaled all-caps setting.\n\n\\*\\*\n\nBack to the thread: my preference, where small caps are significantly larger than x-height, is for OSF with an “x-height” that matches small cap height. Otherwise things like postal codes will look scrappy; the proviso is that the form of “zero” be different than lower case “o”.\n\n"
    },
    {
      "time": " 25.Aug.2006 12.39pm",
      "content": "_I don’t really think tabular small cap figures serve any purpose, and how would they be supported in the application menu?_\n\nThey’re supported via the other tabular/proportional numeral options. So tabular smallcap figures are technically smallcap variants of tabular lining or oldstyle numerals, amd proportional smallcap figures are technically smallcap variants of proportional lining or oldstyle numerals.\n\n"
    },
    {
      "time": " 25.Aug.2006 12.40pm",
      "content": "_But “All Small Caps” should definitely have lining, proportional figures, for use in places like a page folio, or in very small captions..._\n\nAnd in alphanumeric postal codes.\n\n"
    },
    {
      "time": " 25.Aug.2006 12.51pm",
      "content": "_So tabular smallcap figures are technically smallcap variants of tabular lining or oldstyle numerals, amd proportional smallcap figures are technically smallcap variants of proportional lining or oldstyle numerals._\n\nDude, that is so featuritis.\n\n"
    },
    {
      "time": " 25.Aug.2006 3.23pm",
      "content": "Dude, whaddya call this:\n\n“If the lining figures aren’t full cap height, you also need another big set for the “case” (all caps) feature!”\n\n?\n\nIf the lining figures are not cap height, and you’re proliferating figures to match every situation, then the lining figs should be cap height. You wouldn’t need any 3/4 height figs.\n\nIn general, my answer to your original question is “x-height or lowercase”, for the reasons named above. They are meant for use with lc, and they have extenders, which increases their apparent size, so they don’t need to be as big as small caps. But I agree, if the lc is very tiny compared to SC then the osfs should be somewhere in the middle where they would work with both, or else make a set for every single alphabet. Keep in mind, though, figures aren’t read like words, and they only need to blend into text so much, whatever height.\n\nThis could become its own unhealthy obsession, however. Or at least delay your typeface release by months. “I’ve got superior and inferior figures for my demi-petite caps!”\n\n"
    },
    {
      "time": " 25.Aug.2006 3.51pm",
      "content": "_demi-petite caps_\n\nhmmmm.... i LIKE it! \\>^p\n\n"
    },
    {
      "time": " 25.Aug.2006 4.26pm",
      "content": "_If the lining figures are not cap height, and you’re proliferating figures to match every situation, then the lining figs should be cap height. You wouldn’t need any 3/4 height figs._\n\nUnless you want to make these the default figures for applications that do not have OpenType Layout support or, as in the case of one multilingual typeface I’m working on, you want them as the default style because they match the height of the Hebrew letters.\n\n"
    },
    {
      "time": " 25.Aug.2006 5.53pm",
      "content": "\\> _with the lowercase as they are more correctly referred to as text figures with the assumption being that they are to be used in running text with the lower case_\n\nJust for the record. If memory serves, in German the OsF are often called [_Minuskelziffern_](http://web.archive.org/web/20080907042724/http:/de.wikipedia.org/wiki/Medi%C3%A4valziffer). Of course, that does not mean they must always be x-high.\n\n"
    },
    {
      "time": " 25.Aug.2006 7.03pm",
      "content": "I agree with William’s earlier point; the osf x-height must be in context of the rest of the design.\n\nI’ve just been browsing the Karen Cheng book (which has finally arrived in New Zealand, and is of course entertainingly discussed at [http://www.typophile.com/node/18679](http://web.archive.org/web/20080907042724/http:/www.typophile.com/node/18679 \"http://www.typophile.com/node/18679\")) and she points to a number of possibilities here. There don’t seem to be any hard-and-fast rules other than which osf descend and which ascend, and which go to a mean height that agrees with the lowercase and/or the small caps.\n\n_the proviso is that the form of “zero” be different than lower case “o”._\n\nBy the same token, the form of ’one’ must be different from lowercase ’l’ and uppercase ’I’ – if you don’t believe me, just have a look at [Gill Sans.](http://web.archive.org/web/20080907042724/http:/www.linotype.com/52771/gillsansfamilyvaluepack-compilation.html)\n\n"
    },
    {
      "time": " 25.Aug.2006 9.39pm",
      "content": "_There don’t seem to be any hard-and-fast rules other than which osf descend and which ascend..._\n\nWith the caveat that in French Romantic types the 3 and 5 are often ascending.\n\n ![](http://web.archive.org/web/20080907042724im_/http:/www.typophile.com/files/DidotNumerals_5029.gif)\n\n"
    },
    {
      "time": " 26.Aug.2006 8.17pm",
      "content": "John that really makes me giggle – those crazy French romantic types! Always up when they should be down...\n\nI notice that ’four’ looks quite massive compared to everything else on the line, but guess I need to amend that earlier statement to just ’there are NO hard-and-fast rules...’ which doesn’t get any closer to answering Nick’s original question. um.\n\n"
    }
  ]
}
