{
  "id": "27952",
  "title": "Indesign prints text and vector as bitmap (and so does illustrator)",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi\n\nI have a brand new imac intel running indesign cs2.\n\nThe problem occurs when I want to print a document from indesign.  \nAny document containing text or vector graphics will be printed as bitmap and therefore any printout through indesign or illustrator is wothless. However if I export the document as a pdf and print throught pictureviewer the output is fine. Strange indeed. Adobe reader also printed out in nice quality but it took forever.  \nI am wondering if this could be a ram issue or if it could be related to the fact that cs2 currently is not prepared for the Intel macs.\n\nMy setup is iMac Intel 512 mb ram.  \nThe printer is a Brother HL-2070N laserprinter.\n\nHow to solve this...\n\nMKSG\n\n",
  "author": "magnus_gaarde",
  "time": "29 Aug 2006 — 2:19pm",
  "uid": "3408",
  "comments": [
    {
      "time": "29 Aug 2006 — 4:15pm",
      "content": "\"export the document as a pdf and print throught pictureviewer\"  \nWhat's wrong with that?\n\n"
    },
    {
      "time": "29 Aug 2006 — 4:25pm",
      "content": "Hmmm, Sounds like a PostScript interpretation issue. Do you have the correct printer descriptions/drivers for your printer?\n\n"
    },
    {
      "time": "29 Aug 2006 — 4:25pm",
      "content": "Do you have the PS print drivers installed?\n\nEDIT: damn cross posts...\n\n"
    },
    {
      "time": "29 Aug 2006 — 5:30pm",
      "content": "you can download it here for your mac:\n\n[http://welcome.solutions.brother.com/bsc/public/us/us/en/dlf/download\\_to...](http://web.archive.org/web/20131018211440/http:/welcome.solutions.brother.com/bsc/public/us/us/en/dlf/download_top.html?reg=us&c=us&lang=en&prod=hl2070n_all \"http://welcome.solutions.brother.com/bsc/public/us/us/en/dlf/download\\_top.html?reg=us&c=us&lang=en&prod=hl2070n\\_all\")\n\n"
    },
    {
      "time": "31 Aug 2006 — 2:16pm",
      "content": "Hi all\n\nThanks for taking the time to answer.\n\ndberlow\\>\\>  \nThe problem is that Indesign and illustrator doesn't print my documents right. The fact that Pictureviewer is able to print it right is ok because it means that I can print but it also adds to makee everything more confusing.\n\nI have all the correct drivers installed. Been throught that process a couple of times just to make sure.\n\nI got some more ram yesterday, so now it's 1.5 GB which surely speeds the things up but does nothing about the printing... I kind of figured it would have to be something else anyway.\n\nIn Indesign I have the choice of saving as an Adobe postscript file through the print dialogue and I can select the correct ppd but I cannot choose a ppd when printing.\n\nIn illustrator theres a checked box in 'print as bitmap' under the advanced tab in the print dialogue. It's grey and cannot be unchecked.\n\nThis is very frustrating.\n\nHope to find a solution soon before I go mad\n\n"
    },
    {
      "time": "31 Aug 2006 — 4:03pm",
      "content": "Does the document use transparency or related effects (drop shadows, etc)?\n\nIf so, it may be a question of your transparency flattener settings....\n\nT\n\n"
    },
    {
      "time": "31 Aug 2006 — 8:00pm",
      "content": "It sounds like it's the driver not handling postscript. PDFs printing correctly would indicate it's the driver.\n\nPictureViewer is a Classic application. If you're running OS9 then your driver isn't loaded... it's in Tiger's system folder... are you positive you've loaded the OSX driver? I don't know why you would have Classic running at all, or why you would transfer your CS app output to print into Classic... ? Go to System Preferences and keep Classic turned off.\n\nIf you've already confirmed by the Printer Setup Utility that the driver is configured, here are a few threads from the Apple support forum on your printer. You may find some good info here.\n\n[http://discussions.apple.com/thread.jspa?messageID=1882798&#1882798](http://web.archive.org/web/20131018211440/http:/discussions.apple.com/thread.jspa?messageID=1882798&#1882798 \"http://discussions.apple.com/thread.jspa?messageID=1882798&#1882798\")\n\n[http://discussions.apple.com/thread.jspa?messageID=2498739&#2498739](http://web.archive.org/web/20131018211440/http:/discussions.apple.com/thread.jspa?messageID=2498739&#2498739 \"http://discussions.apple.com/thread.jspa?messageID=2498739&#2498739\")\n\n[http://discussions.apple.com/thread.jspa?messageID=1950081&#1950081](http://web.archive.org/web/20131018211440/http:/discussions.apple.com/thread.jspa?messageID=1950081&#1950081 \"http://discussions.apple.com/thread.jspa?messageID=1950081&#1950081\")\n\n[http://discussions.apple.com/thread.jspa?messageID=2440569&#2440569](http://web.archive.org/web/20131018211440/http:/discussions.apple.com/thread.jspa?messageID=2440569&#2440569 \"http://discussions.apple.com/thread.jspa?messageID=2440569&#2440569\")\n\n"
    },
    {
      "time": "31 Aug 2006 — 11:35pm",
      "content": "Magnus,\n\nI had the same problem, or so it seems, on my G5 PowerMac (running 10.4.7), Brother HL-5050, and old InDesign 2.0.2. It was fixed when I installed the PostScript printer driver--instead of the \"recommended\" one.\n\n"
    },
    {
      "time": "1 Sep 2006 — 1:48am",
      "content": "Hi all, thanks again for all your help.  \nSadly so far nothing has solved the problem.  \nIt does not matter what kind of document I try to print everything comes outas bitmap. Pixelated. I can change the printer resolution to print in 1200 dpi and then the pixels become a bit smaller but still bitmap.\n\nI don't think it is a os9 classic thing. It does not run on intels as far as I am informed.\n\nIt seems that all the correct drivers are installed and working in the system.\n\nOlli, what do you mean? How do I install the postscript drivers? Is it something that can be done manually?\n\nHere's a copy of the print summary from indesign cs2, surely something doesn't look right.\n\n<dd>\nPrint Preset: [Custom]<br>\nPrinter: HL-2070N series<br>\nPPD: N/A<br>\nPPD File: N/A\n<p>General<br>\n    Copies: 1<br>\n    Collate: N/A<br>\n    Reverse Order: Off<br>\n    Pages: All<br>\n    Sequence: All Pages<br>\n    Spreads: Off<br>\n    Print Master Pages: Off<br>\n    Print Non-printing Objects: Off<br>\n    Print Blank Pages: Off<br>\n    Print Visible Guides and Baseline Grids: Off</p>\n<p>Setup<br>\n    Paper Size: Defined By Driver<br>\n    Paper Width: 210 mm<br>\n    Paper Height: 297 mm<br>\n    Page Orientation: Portrait<br>\n    Paper Offset: N/A<br>\n    Paper Gap: N/A<br>\n    Transverse: N/A<br>\n    Scaling: 100%<br>\n    Constrain Proportions: On<br>\n    Page Position: Upper Left<br>\n    Thumbnails: Off<br>\n    Tiling: Off</p>\n<p>Marks and Bleed<br>\n    Crop Marks: Off<br>\n    Bleed Marks: Off<br>\n    Registration Marks: Off<br>\n    Color Bars: Off<br>\n    Page Information: Off<br>\n    Printer Mark Type: Default<br>\n    Crop Mark Weight: 0.25 pt<br>\n    Mark Offset from Page: 2,12 mm<br>\n    Use Document Bleed Settings: On<br>\n    Bleed Top: 0 mm<br>\n    Bleed Bottom: 0 mm<br>\n    Bleed Inside: 0 mm<br>\n    Bleed Outside: 0 mm<br>\n    Include Slug Area: Off</p>\n<p>Output<br>\n    Color: Composite RGB<br>\n    Text As Black: Off<br>\n    Trapping: N/A<br>\n    Flip: N/A<br>\n    Negative: N/A<br>\n    Screening: N/A<br>\n    Simulate Overprint: Off</p>\n<p>Graphics<br>\n    Send Data: All<br>\n    Download: N/A<br>\n    Download PPD Fonts: N/A<br>\n    PostScript®: N/A<br>\n    Data Format: N/A</p>\n<p>Color Management<br>\n    Document Profile: Adobe RGB (1998)<br>\n    Color Handling: Let InDesign Determine Colors<br>\n    Printer Profile: Document RGB - Adobe RGB (1998)<br>\n    Preserve RGB Numbers: Off<br>\n    Proof Profile: N/A<br>\n    Simulate Paper Color: N/A</p>\n<p>Advanced<br>\n    OPI Image Replacement: N/A<br>\n    EPS: N/A<br>\n    PDF: N/A<br>\n    Bitmap Images: N/A<br>\n    Transparency Flattener Preset: N/A<br>\n    Ignore Spread Overrides: N/A<br>\n</p>\n</dd>\n\nRegards\n\nMagnus\n\n"
    },
    {
      "time": "1 Sep 2006 — 3:05am",
      "content": "With my 3-year-old Brother HL-5050, I had to go to [http://solutions.brother.com/hl5000/download/drivers.html](http://web.archive.org/web/20131018211440/http:/solutions.brother.com/hl5000/download/drivers.html \"http://solutions.brother.com/hl5000/download/drivers.html\") and download the driver labeled \"PS Driver (PostScript Emulation Language)\", then run the installer and set the new, PS driver as the default. (Sorry, I don't remember the details and I'm not at my own computer now.)\n\nIt might well be different with your (newer?) Brother model.\n\n"
    },
    {
      "time": "1 Sep 2006 — 6:38am",
      "content": "This won't help with your problem, but just a general observation here about Brother, and in general to beware/be careful with their Mac print drivers. I'm on the Mac and have had a Brother printer or two, and as far as I can discern, they seem to be one of those companies who deal with the Windows market first and foremost, with their Mac drivers tacked on as an afterthought to pick up some extra change. Their stuff can be terribly buggy.\n\nI currently have a Brother P-touch labelmaker which can be used either manually (typing directly on its keyboard) or driven directly from the computer. Even having had it for a couple of years now, through two versions of the Mac OS, and with a few different revs to the labelmaker's print driver by Brother, they cannot seem to get the Mac OSX drivers sufficiently debugged. Only recourse for me is to use the OS9/Classic drivers for the labelmaker and print via the Classic application for it they also supply. Which is quite crude-looking in that it displays fonts as jagged bitmaps, but at least the line endings are displayed correctly, and it prints fine.\n\nThe first couple of OSX drivers for the Brother unit worked, barely, with seriously crippled functionality. Recently, after trying to install the latest one they came out with--the third one I have tried--and trying to install it two different times with the same results), I had to give up and go back to the Classic version yet again. It had somehow hosed something in my system so badly (couldn't load fonts, couldn't print from any app, many apps would quit on launch) that after an hour or so of unsuccessfuI troubleshooting, I decided to stop wasting my time and simply restore the entire hard drive from a cloned backup (I back up every night) to get my system functioning properly again.\n\n"
    }
  ]
}
