{
  "id": "27960",
  "title": "Cyrillic script glyphs",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm working on a script font with [Cyrillic](http://web.archive.org/web/20120416002522/http:/typophile.com/wiki/Cyrillic) characters and in perusing existing scripts I've noticed that some letters don't use the Cyrillic letterform / glyph shape and instead have a Latin form. Is this just a convention created by type foundries because they couldn't figure out how to make the Cyrillic glyph correctly in a script or is there an underlying reason that I'm not seeing? It doesn't seem that difficult to have a script version of the Cyrillic glyphs.\n\nThe most blatent example is uni0414 which is a stacked form in Cyrillic and in script fonts is frequently a Latin D instead. If the Latin form is acceptable why have a different Cyrillic form then? Anyone know?\n\nGeorge  \nI felt bad because I had no shoes until I met a man who had no Bodoni.\n\n",
  "author": "gthompson",
  "time": "29 Aug 2006 — 8:41pm",
  "uid": "4883",
  "comments": [
    {
      "time": "29 Aug 2006 — 8:56pm",
      "content": "_If the Latin form is acceptable why have a different Cyrillic form then? ?_\n\nThe \"upright\" de is not a happy cursive form. In that respect, it's similar to the roman double-bowl \"g\", which is a lot of business to attend to if you're wrting it. So in the script form, shapes which are easier and faster to write will be preferred to the more elaborate forms of the upright alphabet.\n\n"
    },
    {
      "time": "29 Aug 2006 — 9:29pm",
      "content": "_Is this just a convention created by type foundries because they couldn’t figure out how to make the Cyrillic glyph correctly in a script_\n\nNo. That's just silly. Take a look at any of [ParaType](http://web.archive.org/web/20120416002522/http:/typophile.com/wiki/ParaType)'s script fonts and you'll find the same things. In fact, some slavic languages [including Bulgarian](http://web.archive.org/web/20120416002522/http:/img198.imageshack.us/img198/4452/bgvsru9vl.jpg) prefer roman forms that more closely mirror the script forms.\n\n"
    },
    {
      "time": "31 Aug 2006 — 1:13pm",
      "content": "Cyrillic script forms have their own history and logic, parallel to latin in some respects, different in others. Some shapes which are easy to write may have close resemblance to latin shapes (sometimes belonging to completely unrelated letters); there are also many distinct historical variations (3-4 per letter).\n\n ![](http://web.archive.org/web/20120416002522im_/http:/typophile.com/files/1431_6719.jpg)\n\n"
    },
    {
      "time": "31 Aug 2006 — 3:22pm",
      "content": "_The “upright” de is not a happy cursive form. In that respect, it’s similar to the roman double-bowl “g”, which is a lot of business to attend to if you’re wrting it. So in the script form, shapes which are easier and faster to write will be preferred to the more elaborate forms of the upright alphabet._\n\nWell, I'm sitting here making script letters and other Cyrillic characters which are more difficult to write don't revert to a Latin form so why the de? And I disagree that a script double-bowl 'g' is more work since I sign my name with one (easier than that convoluted thing they taught me in school) and the font I'm working on already has that form for the Roman 'G'. And if easier is the reason why wouldn't the same apply to the upright? The Latin form is easier to write than the Cyrillic.\n\n_Take a look at any of ParaType’s script fonts and you’ll find the same things._\n\nYes, but why? That's what I want to know. Compare PT Betina Script with PT Birch -- similar non joining scripts -- and Betina uses the Latin 'D' and Birch a Cyrillic. It would seem to make more sense to change to the Latin form for a flowing scirpt, but PT Adventure does several odd things: Teh (U0422) for instance, which is more complicated. Is the choice merely based historical precedence or what? Is there a rule of some sort?\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "31 Aug 2006 — 3:53pm",
      "content": "_Yes, but why? That’s what I want to know._\n\nSergei gave the answer above.\n\n"
    },
    {
      "time": "31 Aug 2006 — 8:13pm",
      "content": "There are a lot of things that are true in typography for historical reasons. It's an interesting question to wonder why, but it doesn't change the fact that things are the way they are.\n\nAnother case like the Cyrillic script glyphs is the l-slash, which takes on a very different form in script fonts (the slash becomes a tilde-like squiggle above the el, IIRC).\n\nT\n\n"
    },
    {
      "time": "1 Sep 2006 — 11:08am",
      "content": "Sergei,  \nThat is a beautiful book! Which one is it?\n\nChrisL\n\n"
    },
    {
      "time": "1 Sep 2006 — 12:01pm",
      "content": "_Betina uses the Latin ‘D’ and Birch a Cyrillic_\n\nThey are both cyrillic, just as two different script shapes of d are. Betina's designer (Alexander Tarbeev) made the upper \"serif\" of D longer and tilted the vertical stem slightly to the right so it resembles a traditional cyrillic script D, but can also work as latin D (for which these features are acceptable but not critical). Why use the same shape for both, while it was easier to make two different ones? I guess some people like a challenge.\n\nBirch's uppercase, strictly speaking, is not a script alphabet - it has no specific script forms. Its D is a \"printed\" shape made with multiple strokes and no circular motion, while script D is made with one stroke - down/left and counterclockwise.\n\n"
    },
    {
      "time": "1 Sep 2006 — 12:17pm",
      "content": "_That is a beautiful book! Which one is it?_\n\nChris, this is 17th century manuscript of Andrey Kurbsky's History of the Grand Prince of Moscow, originally written in 1572.\n\n"
    },
    {
      "time": "1 Sep 2006 — 12:37pm",
      "content": "_I disagree that a script double-bowl ‘g’ is more work since I sign my name with one_\n\nI don't know how you do that, but when I write a double-bowl g, I have to take pen off paper twice, whereas I do a single-bowl script g in one continuous movement.\n\n"
    },
    {
      "time": "3 Sep 2006 — 4:03pm",
      "content": "I recommend getting Yuri Gordon's \"Book of Letters From Аа to Яя\". The text is in Russian only, but the book is richly illustrated.\n\nI've seen it, and I love it. Its concept is somewhat similar to Karen Cheng's book, but Gordon analyzes each Cyrillic letter one-by-one in different styles, and he also includes samples from various Russian logos and calligraphic creations. This gives you a very fair overview of the extent to which you can experiment with Cyrillic forms while staying within the boundaries of what the Russian reader considers \"normal\". You can order the book at:  \n [http://store.artlebedev.com/catalog/books/design/kniga\\_pro\\_bykvy/](http://web.archive.org/web/20120416002522/http:/store.artlebedev.com/catalog/books/design/kniga_pro_bykvy/ \"http://store.artlebedev.com/catalog/books/design/kniga\\_pro\\_bykvy/\")\n\nAdam\n\n"
    },
    {
      "time": "3 Sep 2006 — 4:47pm",
      "content": "Sergei,  \nYou are lucky to have such a beautiful specimen.\n\nChrisL\n\n"
    },
    {
      "time": "4 Sep 2006 — 12:38pm",
      "content": "_I don’t know how you do that, but when I write a double-bowl g, I have to take pen off paper twice, whereas I do a single-bowl script g in one continuous movement._\n\nMy mistake, you're right. I have to plead brain-fade here. I was thinking of something else entirely. Sorry.\n\nI use the lower case single-bowl 'g' for uppercase but loop the descender back to make the lower bowl. Sort of like Galliard italic lc 'g' but rounder.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "4 Sep 2006 — 12:45pm",
      "content": "_I recommend getting Yuri Gordon’s “Book of Letters From Аа to Яя”. The text is in Russian only, but the book is richly illustrated._\n\nThanks Adam, I've been looking for an ABCDerium for Cyrillic and couldn't find anything. This looks like it will be of great help.\n\nDo you also know of any good paleographies for Cyrillic that are in English? Everything I've located is either in Russian or Bulgarian.\n\nP.S. Just went to order it and the shipping is more than the book. $78 vs. $53. Anywhere closer that I might find it?\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "4 Sep 2006 — 12:58pm",
      "content": "_Sergei gave the answer above._\n\nI'm trying to get a sense of the underlying design principles and appropriateness for these alternate characters. When is the uppercase deh not like a deh? When can the teh (upper and lower) look like an upside down shah and why? I guess the scope of what I'm asking is too broad to be covered simply.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "4 Sep 2006 — 4:13pm",
      "content": "George,\n\nthe magic keyword is \"cursive\". It's not an obvious term to define, because cursive is not the same as italic. But if you know what cursive is, you know when the cursive Cyrillic forms are appropriate.\n\nA.\n\n"
    }
  ]
}
