{
  "id": "2797",
  "title": "Research on vertically stacked characters?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "H   \nE   \nL   \nP   \n!   \n   \nI am looking for research or studies done on the legability/readability of vertically stacking letterforms, or any studies at all on the subject. Contact me at: [pacedes@cableone.net](mailto:pacedes@cableone.net) if you have any sources.   \nTHANKS!\n\n",
  "author": "anonymous",
  "time": "30 Aug 2002 — 10:45am",
  "uid": "1203",
  "comments": [
    {
      "time": "5 Sep 2002 — 6:19am",
      "content": "is it Japanese that reads vertically? I forget. but there's some languages that do...check with your librarian\n\n"
    },
    {
      "time": "5 Sep 2002 — 7:41am",
      "content": "Spine titles:   \nIt's actually a difference between European and American practice.   \n   \nBTW, Chinese is written in both vertical and horizontal, although the latter is more prominent now. I don't think Japanese is written vertically, at least not in the mainstream. Another interesting vertical language in Mongolian, which used to be written in Cyrillic, but recently switched back to their original script, which looks somewhat similar to Arabic, interestingly enough.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2002 — 7:44am",
      "content": "A small sample of Mongolian from an \"obsolete\" book I once bought from the UCLA library, for 75 cents: [http://www.themicrofoundry.com/other/mongol.gif](http://web.archive.org/web/20140719174837/http:/www.themicrofoundry.com/other/mongol.gif)   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2002 — 7:44am",
      "content": "A small sample of Mongolian from an \"obsolete\" book I once bought from the UCLA library, for 75 cents: [http://www.themicrofoundry.com/other/mongol.gif](http://web.archive.org/web/20140719174837/http:/www.themicrofoundry.com/other/mongol.gif)   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2002 — 7:46am",
      "content": "BTW, in terms of research, I think I remember reading about a study that compared reading Chinese vertically versus horizontally, finding that the latter was better. Which is no surprise, considering the shape of our field of vision, not to mention our necks.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2002 — 11:48am",
      "content": "Hrant... do you ever use Chinese, Japanese or any other non-english based fonts on your computer? I'm trying to get some Chinese fonts working on a WinXP and Win2000 machine in Photoshop, and am getting nowhere. Can you help me??\n\n"
    },
    {
      "time": "5 Sep 2002 — 11:53am",
      "content": "Doesn't your Character Map utility let you access glyphs directly? And if you have the latest version of Photoshop you should be able to use Unicode fonts.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2002 — 12:32pm",
      "content": "Actually I'm using PAINT SHOP PRO, but I generally say I'm using Photoshop because it works very similar. I just got Photoshop a few weeks ago (version 6, not the latest), so maybe I'm missing this Unicode font ability, but I can't even see the font title in the list of available fonts.   \n   \n As far as viewing the characters, I can't see any of the Chinese fonts I installed with ANY application- not my font viewer applications, not Word, PSP, nothing. I DO have Photoshop installed for some special functions, but even with that app when I try browsing fonts I can't see the font names of the new ones I have installed, because Windows doesn't know what to make of the non-english font characters. So far the suggestions I've gotten are:   \n   \n ~Do a \"Windows Update\" and download Japanese and Chinese language packs   \n   \n ~Change my Region settings to Chinese.   \n   \n I'm nervous about both these solutions however, as I don't want to inadvertantly change my core display properties to Chinese, thereby making my PC unusable. Am I making any sense here?\n\n"
    },
    {
      "time": "5 Sep 2002 — 12:38pm",
      "content": "I wouldn't change my Region settings either, but the first option should be fine.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2002 — 12:48pm",
      "content": "Sorry if I'm being obtuse here; I'm not dumb just uneducated. ![:)](http://web.archive.org/web/20140719174837im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n I've read your other posts and I can tell you REALLY know your stuff when it comes to fonts. All \\*I\\* know coming at this from a graphics person is \"Launch graphics app... select text tool... pick an installed font... start manipulating\", so I don't know what needs to be installed in the OS to support the kanji fonts.   \n   \n So what you're saying is that downloading the japanese/chinese will ONLY install the background support files for that particular language, thereby making the chinese fonts I installed usable?   \n   \n In case it matters, the fonts I'm trying to use are from this site: [http://www.4gee.com/font/pages/fonthtml/chinese.htm](http://web.archive.org/web/20140719174837/http:/www.4gee.com/font/pages/fonthtml/chinese.htm) (give it a minute to disply... it's slow).   \n   \n Thanks for all your help, and sorry for hijacking the thread. Hrant, please feel free to email me if you're afraid we're cluttering up the thread ( [bombshelter@hotmail.com](mailto:bombshelter@hotmail.com)).\n\n"
    },
    {
      "time": "5 Sep 2002 — 1:02pm",
      "content": "Thanks, but I don't know that much, I just talk a lot. I study and admire Eastern scripts, but I don't do any actual setting on my computer. But I'm sure there are people listening who do, so just hope they're 1/10th as talkative as I am. (Sorry.)   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2002 — 7:41pm",
      "content": "No problem- thanks anyway! I have a thread out on the Technical Issues forum about this that I hope someone will read and respond to. Thanks again! ![:)](http://web.archive.org/web/20140719174837im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "9 Sep 2002 — 4:19am",
      "content": "The traditional way of writing Japanese is indeed from top to bottom and from right to left (!), but nowadays it is often written horizontally from left to right. However, the vertical way of writing is in no way extinct\n\n"
    },
    {
      "time": "5 Sep 2002 — 5:53am",
      "content": "this hardly constitutes a study but I have noticed that german books tend to have the title on the spine written so that one reads bottom to top rather than top to bottom...\n\n"
    },
    {
      "time": "30 Aug 2002 — 11:43am",
      "content": "Check \"The Visible Word\" by Herbert Spencer. It's old, but a treasure trove.   \n   \nhhp\n\n"
    }
  ]
}
