{
  "id": "27981",
  "title": "joke or colossal error?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": " ![](http://web.archive.org/web/20150124154458im_/http:/typophile.com/files/1858943558_5017.02._SS500_SCLZZZZZZZ_V53032881_.jpg)\n\nNot _quite_ in print yet, have they got time to save it?  \nNice to see you back again.  \nTim\n\n",
  "author": "timd",
  "time": "1 Sep 2006 — 3:48am",
  "uid": "2289",
  "comments": [
    {
      "time": "1 Sep 2006 — 6:34am",
      "content": "I guess I am missing something. Is this a real book coming out or a joke?\n\nChrisL\n\n"
    },
    {
      "time": "1 Sep 2006 — 6:54am",
      "content": "It sure looks like it could a real book to me, and an interesting one at that. Where is the colossal error? The tongue-in-cheek religious play?\n\n"
    },
    {
      "time": "1 Sep 2006 — 6:55am",
      "content": "It's the misspelling of <cite>foreword</cite>, silly.\n\n"
    },
    {
      "time": "1 Sep 2006 — 7:01am",
      "content": "Spire gets the gold star and two of you stay behind after class:)  \nThe book isn't out yet but it is on various book-selling websites and appeared in Design Week (a UK trade mag) yesterday with that spelling.  \nTim\n\n"
    },
    {
      "time": "1 Sep 2006 — 7:02am",
      "content": "…I guess that shows everyone how good of a copy editor I am ;-)\n\n"
    },
    {
      "time": "1 Sep 2006 — 8:20am",
      "content": "Maybe its ment to say 'Forward'? :)  \nIts always 'forward' with Jonathan Barnbrook, never 'rewind'. :)  \n_( But I dont really 'see' the 'by'. Maybe 'forward' = Barnbrook? :)_\n\nNice find, nonetheless.\n\nDav\n\n"
    },
    {
      "time": "1 Sep 2006 — 8:35am",
      "content": "I believe--but could, of course, be wrong--that this is still an accepted spelling of this word in England.\n\n"
    },
    {
      "time": "1 Sep 2006 — 8:39am",
      "content": "Am I the only one that thinks this a really ugly cover, with bad typography? Maybe this--including the typo--is supposed to be a joke. Violating all the ten commandments or something.\n\n"
    },
    {
      "time": "1 Sep 2006 — 8:44am",
      "content": "As PR stunts go, I have to say this one is pretty sad :-(\n\nSi\n\n"
    },
    {
      "time": "1 Sep 2006 — 8:56am",
      "content": "My foreward shall be drawn out all in length,  \nConsisting equally of horse and foot.  \n- Shakespeare; Richard III, Act V, Scene 3\n\nI don't think this was ever the correct spelling of the word in England, certainly not in any current use, the above is the only quote I can find and means a vanguard (a guard sent ahead); but it could still be a joke, however weak.  \nTim\n\nAnd I'm guessing these are errors too  \n [http://eggcorns.lascribe.net/forum/viewtopic.php?pid=1117](http://web.archive.org/web/20150124154458/http:/eggcorns.lascribe.net/forum/viewtopic.php?pid=1117 \"http://eggcorns.lascribe.net/forum/viewtopic.php?pid=1117\")\n\n"
    },
    {
      "time": "1 Sep 2006 — 9:45am",
      "content": "I'm pretty sure from the [this description](http://web.archive.org/web/20150124154458/http:/www.amazon.co.uk/Ten-Commandments-Typography-Type-Heresy/dp/1858943558/sr=8-6/qid=1157127915/ref=sr_1_6/026-1981832-7267626?ie=UTF8&s=gateway) of the book that my interpretation of the bad typography and typo is correct.\n\n"
    },
    {
      "time": "1 Sep 2006 — 9:58am",
      "content": "Well then that is too bad, as the humor is going to be lost on a lot of people.\n\n"
    },
    {
      "time": "1 Sep 2006 — 10:26am",
      "content": "\"Am I the only one that thinks this a really ugly cover, with bad typography?\"\n\nNo, that is why I asked if it was a joke. It is ugly as sin (punintended) to me but not executed in such a way as to amuse. If anyone has ever seen the old film \"Plan Nine\" they will know that is so increadibly bad that it is a joy to watch and laugh your guts out. This cover, on the other hand, is just boringly bad and needs to be excomunicated or excorcized.\n\nChrisL  \n(I know my spelling sucks)\n\n"
    },
    {
      "time": "5 Sep 2006 — 1:23pm",
      "content": "A friend of mine works as a designer at that particular publisher and assures me that the typo is just that, not an intentionally antiquated spelling. Steps are being taken to rectify the error as we speak.\n\nInstead of sniping why not be constructive and say why you dislike it? You never know who might be reading...\n\n"
    },
    {
      "time": "5 Sep 2006 — 1:36pm",
      "content": "\\>A friend of mine\n\nCome on Chris G, \"a friend\" ;-)\n\n\\>Instead of sniping ... You never know who might be reading…\n\nI think everyone who posts to threads like this hopes the 'culprit' is lurking and will respond - the most interesting typophile threads start that way... (The iPod-Che-Nike thread being an exception).\n\n"
    },
    {
      "time": "5 Sep 2006 — 2:19pm",
      "content": "\"Instead of sniping why not be constructive and say why you dislike it?\"\n\nThe difficulty in this is that your cover is supposed to be bad on purpose so whatever is specifically wrong is obvious. My objection is that the parody has not gone far enough to make me want to look at it. I think you could have done more with the heresy aspect. The problem is that it is just boring looking. Having a concept in your mind of doing bad typography as a joke is not enough. You have to execute it so that it works. It still has to function as a book cover and do its job. If I saw this at a bookstore, I would never have given it a second glance. I would not have looked at it long enough to see that it was a joke. It just melts into the visual clutter. The only half-way saving grace in it may be an accident--the two brown rectangles appear to be the negative space in the letter \"H\" which may be Heresy. Other than that, snore zzzzzzz.\n\nChrisL\n\n"
    },
    {
      "time": "5 Sep 2006 — 3:40pm",
      "content": "_... say why you dislike it?_\n\nNot to put too fine a point (sic) on it: they could send a lot of wordspace (or should that be _ward_space?) to some worthy cause that may not have enough. Every line is set in that awful default: 100%, which looks particularly nasty in the headline “Type ... Heresy”. Or is that large gap an intended illustration of itself?\n\n"
    },
    {
      "time": "5 Sep 2006 — 4:24pm",
      "content": "Unless I'm mistaken, it looks from the Amazon UK picture that the white on the sides is not part of the cover, so the 'H', which Chris finds a redeeming device, isn't there. Ouch.\n\nOk, I'm game. Here are my commandments of Typography (pinched from others):\n\n1. Thy type shall be legible.  \nObedience here.  \nOk, but now downhill.\n\n2. Thy visual hierarchy shall express the conceptual relationships of the author.  \nViolation.  \nThe idea of the book is a duality: Those who represent classic type wisdom and obey the rules, including Tschichold and Spiekermann, verses type 'heretics' who break the rules.\n\nHere there are random sized bits of brown and white, no relation. A way to do this would be to split the cover in half, eg horizontally or diagonally, with one side black on white and the other black with white knocked out, or red and black or another two colors. The border could look like torn paper, indicating visually the opposition and disruption. I don't know if this particular concept would work, but it would be a. more visually arresting and b. reflect the idea of the book. Both a plus.\n\n...to be continued...\n\n"
    },
    {
      "time": "5 Sep 2006 — 5:02pm",
      "content": "3. Thy placement of type will have a pleasing relation to the space it occupies.\n\nViolation.\n\nAside from being centered, the type seems to have no visual logic. Does the shape of the cross relate to the top brown block? No. Does the Cross plus the text relate? No. Why do we have a short line, long line then small short line, followed by a new color with lines all different lengths again? Why the color block again at the bottom? I at any rate can't see any rhyme or reason.\n\nPart of the problem here is the two titles and subtitles of the book. The full thing according to Amazon: The Ten Commandments of Typography/Type Heresy: Breaking the Ten Commandments of Typography\n\nNow having two titles and subtitles is breaking the rules. In my opinion this breaking can be ok because it has a compensating benefit: it is an arresting, interesting opposition. But the cover doesn't have the whole two titles, so the whole thing becomes a muddle. The point is, if you are going to break rules, you need to make a virtue of it. It has to have a strong point. Here the point is just lost because the two titles are not even put on the cover!\n\nBut--back to placement of text--as it is there is no rhyme or reason to the placement. And that is what looks most weak in the layout.\n\n4. Thou shalt keep logically related words visually together.\n\nViolation.\n\nThe important concepts are: 'Ten Commandments' and 'Typography'.\n\nSo the designer \\*breaks up\\* the words 'Ten' and 'Commandments'!\n\nThe other key concept is \"Type Heresy\", which as Erik Spiekermann points out are separated now by a double word space or something.\n\n3. Thy typeface shall be well suited to the subject matter.\n\nOk if the top title were in Sabon (Tschichold) or Meta (Spiekermann) that would make sense. But it's not, it seems. Since the subject is actually type, I don't understand why the avoidance. Also is the 'Type Heresy' one of Branbrook's fonts? Maybe but I couldn't spot it checking. Why not use Mason or one of his other wonderfully disturbing faces?\n\nAlso why put 'Heresy' in black letter and Ten Commandments in Roman? If you are playing on the association of Church and Blackletter, then \\*both\\* should be in blackletter. The two titles should also be massaged so they are parallel. That is a failing of the author or publisher, but the designer could ask. Then perhaps you could have 'Ten Commandments' twice in black letter, and 'Heresy' in Mason.\n\n4. Space and size thy lines, word spaces and letter spaces in a way that suits their function and purpose.\n\nViolations.\n\nWhy is the top title smaller than the bottom title? Why is the second subtitle in a different font again? Why is the second time the author mentioned smaller than the first?\n\nI could go on, but I'm now tired of the game.\n\nAs others have said: if this was trying to break rules in a funny way, it doesn't succeed. If it wasn't trying to break rules, well it does, all over the place.\n\n"
    },
    {
      "time": "5 Sep 2006 — 6:31pm",
      "content": "\\>the ‘H’, which Chris finds a redeeming device, isn’t there. Ouch.\n\nAh, Chris obviously saw a 3pt field goal opportunity, looks like he's knocked it wide right setting up good field position for the opposing team. William capitalized with an additional 6 unanswered points. ;-)\n\n"
    },
    {
      "time": "5 Sep 2006 — 6:49pm",
      "content": "\"...Chris obviously saw a 3pt field goal opportunity...\"\n\n3pts? I don't know Si, that cross bar looks like it is at least 72pts high to me, I am throwing in the red flag and challenging that call :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Sep 2006 — 6:55pm",
      "content": "After further review...\n\n"
    },
    {
      "time": "5 Sep 2006 — 6:58pm",
      "content": "Doh!\n\n ![](http://web.archive.org/web/20150124154458im_/http:/typophile.com/files/simpsons_scream_lo_3886.jpg)\n\n:-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Sep 2006 — 9:57pm",
      "content": "Hey, doesn't the title look like \" letterspaced lowercase? \"\n\n"
    },
    {
      "time": "5 Sep 2006 — 11:46pm",
      "content": "Thou shalst not shag thy sheep!\n\n"
    },
    {
      "time": "6 Sep 2006 — 12:13am",
      "content": "Good Advertisement! Ask Dezcom?\n\n"
    },
    {
      "time": "6 Sep 2006 — 2:11am",
      "content": "<cite>Come on Chris G, “a friend” ;-)</cite>\n\nLOL! :) So cynical Sii... believe me I would love to be doing some book design, particularly typography books, but am currently at an ad agency doing design of a more ephemeral nature. My friend at Merrell is lurking on the forum and has no doubt taken on board your comments - thanks to everyone for their input\n\n"
    },
    {
      "time": "6 Sep 2006 — 5:20am",
      "content": "Thou shalt not covet thy neighbors sheep.\n\nChrisL\n\n"
    },
    {
      "time": "6 Sep 2006 — 9:38am",
      "content": "\\>LOL! :) So cynical Sii…\n\n;-)\n\n\\>My friend at Merrell is lurking on the forum and has no doubt taken on board your comments\n\nBlessed be the lurkers for they shalt inherit the advice, (whilst cloaked in a veil of secrecy)\n\n"
    },
    {
      "time": "6 Sep 2006 — 11:25am",
      "content": "\\> Thou shalt not covet thy neighbors sheep.  \nDezcom, How if the neighbor insists? Rights of Neighborhood?\n\n"
    },
    {
      "time": "6 Sep 2006 — 11:28am",
      "content": "LOL!  \nThen you just give him that sheepish grin and tell him you can't do to health reasons :-)\n\nChrisL\n\n"
    },
    {
      "time": "6 Sep 2006 — 11:30am",
      "content": "How if healthy, wealthy, wise and welcoming .000O\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_O000.?\n\n"
    },
    {
      "time": "6 Sep 2006 — 11:32am",
      "content": ":^D\n\nChrisL\n\n"
    },
    {
      "time": "6 Sep 2006 — 11:35am",
      "content": "Learning to see is harder than learning to look?!\n\n"
    },
    {
      "time": "6 Sep 2006 — 11:39am",
      "content": "I wonder where you saw that?\n\nChrisL\n\n"
    },
    {
      "time": "6 Sep 2006 — 7:08pm",
      "content": "I do believe we are now participating in something called 'viral marketing.'\n\n"
    },
    {
      "time": "6 Sep 2006 — 7:41pm",
      "content": "That struck me as well Eric.\n\nChrisL\n\n"
    },
    {
      "time": "6 Sep 2006 — 8:11pm",
      "content": "Five Stages Of Grief  \n1. Denial - \"Is this a real book coming out or a joke?\"  \n2. Anger - \"Am I the only one that thinks this a really ugly cover, with bad typography?\"  \n3. Bargaining - \"Instead of sniping why not be constructive and say why you dislike it?\"  \n4. Depression - \"As PR stunts go, I have to say this one is pretty sad\"  \n5. Acceptance - \"I do believe we are now participating in something called ‘viral marketing.’\"\n\n"
    },
    {
      "time": "7 Sep 2006 — 4:52am",
      "content": "Si,  \nYou forgot one Step\n\n6. Resignation--I resolve to never buy this book.\n\nChrisL\n\n"
    },
    {
      "time": "7 Sep 2006 — 5:15am",
      "content": "**I guess Barnbrooks ideas go somewhere close to what Bob Gill once said.  \n\"If this deliberate typo only creates one thread on Typophile and annoys only a handful of visitors there, then all of the months I spent putting it together will not have been worth it.\"**\n\nƒ\n\n"
    },
    {
      "time": "7 Sep 2006 — 10:33am",
      "content": "also, wtf is up with the bizarre break on the front?\n\nthe ten / commandments? why break the principal subject onto two lines? very odd looking to me. Ruari would not be pleased.\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20150124154458/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": "4 Oct 2006 — 2:34pm",
      "content": "Hello Everyone,  \nI Hope everyone is well. I'm the author of the book you've all been discussing, so I thought who best to answer all your questions than myself.\n\nFirstly, I would like to say please don't judge the book off this picture, Originally this picture was created for the sole purpose of showing the printers where the foil was intended to go and was produced incredibly quickly (hence the spelling mistake, no it wasn't a stunt!) This picture has now been used on pretty much everything, which I wouldn't say I'm over the moon about really, but thats one of those things, Very well spotted though!\n\nRegards the line break on the cover, I considered the title to be too long to occupy one line and ideally I wanted to keep the 'ten commandments of typography' part together. If you think thats odd then thats fair enough, I respect your opinion and if we all had the same opinions regarding typography the world would be a very dull place, so I do accept that.\n\nRegarding the comment about never buying it, that again is totally fine, I'm often just as guilty of making decisions on a book purely by the cover, but I personally think its a bit harsh to make the comments you have without actually viewing the content. Judging by the fact that Matthew Carter, Jeff Keedy and Jonathan Barnbrook have all seen the content and were happy to be associated with it, plus the review in this months Grafik magazine it can't be that bad.\n\nI don't want to go on too much but I think the Type Heresy section, needs clearing up too. The book is a flip format book, so the image you can see is only the Commandments cover, I know its a bit hard to understand with just that cover image, the white section is essentially a belly band, its alot easier to understand when you actually have the book in front of you.\n\nI hope I don't come across like I'm having a rant because I'm not, I just wanted to get my case across! Maybe I can arrange to post a copy out to one of you guys and then make a judgement, Its not strictly buying it so you wouldn't be going back on your word! Plus if you still think its crap then I will hold my hands up and respect your decision!\n\nSorry to ramble on but I hope to hear back from you all soon\n\nPaul\n\n"
    },
    {
      "time": "4 Oct 2006 — 2:58pm",
      "content": "Dear Paul,\n\nIf you would like me to read and review your book, I would be happy to do an honest job of it. That means I will tell what I think and why. I try not to judge a book by its cover but that can be a problem when the book deals with typography. I wish you had just come out straight with an announcement of your book without the cover becoming the issue. There are a lot of type people here on Typophile who would give it a fair read and a courteous but unbiased review.\n\nChrisL\n\n"
    },
    {
      "time": "4 Oct 2006 — 3:09pm",
      "content": "Paul, thanks for delurking and stumping up a response to the choir.. I’m sure we’ll all have a flick through it once it hits our local bookshop. Cheers, Si\n\n"
    },
    {
      "time": "4 Oct 2006 — 3:13pm",
      "content": "Hi Chirs,  \nThanks for getting back to me, I do completely agree, if I was in your shoes I would most probably have been saying the same as you guys, having seen that image on its own. I would be most pleased for you to read my book and the more your honest your review the better, I hope I didn't come across like I only want people say how wonderful my book is, thats not the case at all, I'm a strong believer in critisicm, its how we learn to become better designers after all. All I ask is that my book gets judged on the book itself not a jpeg off Amazon.\n\nSorry for the late reply I have only just got back from spain on my hols last week so have been bogged down at work  \nPaul\n\n"
    },
    {
      "time": "4 Oct 2006 — 3:17pm",
      "content": "Thats great,  \nThanks Si, do both bare in mind however the target audience of the book isn't so much you guys that are well educated in type, although I have tried to still make it enjoyable for the more advanced typographers. I hope you enjoy it but let me know any feedback if do get chance to have a look at it\n\nCheers  \nPaul\n\n"
    }
  ]
}
