{
  "id": "27990",
  "title": "What happened at Type Con 2006?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I wasn’t able to go to [TypeCon](http://web.archive.org/web/20080908102032/http:/typophile.com/wiki/TypeCon) this year so when I saw all the features on the TypeCon website (TypeCon Talk, Type Gallery, TypeCon TV!) I was excited that I wouldn’t be totally missing out. Well, it’s been a few weeks now and theres still nothing up. I was hoping to see video or audio of speekers, blog posts... It looks like TypeRadio didn’t do anything special either. So... what happened? Those that went, what was the highlight for you. Best presentation, workshop, best thing you learned...\n\nJosh\n\n [‹ Books on CSS?](http://web.archive.org/web/20080908102032/http:/typophile.com/node/28496 \"Go to previous forum topic\") [Printing cost question ›](http://web.archive.org/web/20080908102032/http:/typophile.com/node/28463 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080908102032/http://typophile.com/user/7730\" title=\"View user profile.\">scruggsdesign</a>",
  "time": "<br>",
  "uid": "7730",
  "comments": [
    {
      "time": " 1.Sep.2006 10.14am",
      "content": "Best presentation for me was the Frutiger tribute. I also learned a great deal from the Dwiggins Fest. The best one-liners were from David Berlow “Scrolling all the way to Martha’s Vinyard”  \nThe best part is always meeting the people and being able to unabashedly talk type without seeing the unannointed glaze over in boredom :-)  \nThe PunchCut online hazing via onscreen textmessaging was a scream too! The Boston weather was PERFECT!\n\nChrisL\n\n"
    },
    {
      "time": " 1.Sep.2006 10.39am",
      "content": "Only one session was recorded (OS X Font Management) and it will be up next week. We’d like to do more recording (at least audio) next year, but that is largely dependent on able volunteers.\n\n"
    },
    {
      "time": " 1.Sep.2006 10.54am",
      "content": "TypeRadio isn’t a part of TypeCon, but they have in the past (and hopefull will again) broadcast from TypeCon.\n\nTypeCon TV is something we are hoping to incorporate in the future.\n\nTypeGallery will be updated soon(ish).\n\n"
    },
    {
      "time": " 1.Sep.2006 4.31pm",
      "content": "I enjoyed everything David Berlow said, and I also enjoyed the presentation on the type design for the Xbox 360. I would have been annoyed enough to stab myself if I had to do such a project without being able to see what it would look like in its final setting. That, I suppose is one of my personal issues I ought to work on. ;)\n\nAlso, if you haven’t already, I recommend checking out the Typecon group on Flickr. Viewing those photos will give you an idea of what went on at typecon.  \n [http://www.flickr.com/groups/typecon/pool/](http://web.archive.org/web/20080908102032/http:/www.flickr.com/groups/typecon/pool/ \"http://www.flickr.com/groups/typecon/pool/\")\n\nDaidala has a few good blog entries on TypeCon too.  \n [http://www.daidala.com/](http://web.archive.org/web/20080908102032/http:/www.daidala.com/ \"http://www.daidala.com/\")\n\n-Jon-\n\n"
    },
    {
      "time": " 1.Sep.2006 5.16pm",
      "content": "I really enjoyed meeting all the real live typographic afficionados and talking to them face to face (rather than online). It was so wonderful to be surrounded by people who all dealt with and who were all involved with type in different ways. I thought the most entertaining bit was the typographic videos that were presented at the start of the conference and especially the little video on what a typographer sees when out in the real world. I would \\*love\\* to get a copy of that to show my students!\n\nFor me, seeing the Helvetica film preview was a real treat; hearing personal stories about Adrian Frutiger was really impressive; meeting other type teachers and attending the type education forum was great fun and provided me with lots of ideas; and I really enjoyed the presentation by Nicolas Benson on the memorial he designed and his experience with cutting all the letters into the stone and battling the elements.\n\nIt was a really great time.  \nAndi\n\n"
    },
    {
      "time": " 3.Sep.2006 7.01am",
      "content": "David Berlow “Scrolling all the way to Martha’s Vinyard”\n\nI did not say that...we were too far north at the time and looking at a character that had no descenders, (I).\n\nThanks to Sota and the attendees, there was a good amount for content with guts. My faves: Apple admitting their font management is thin. w3c’s Lilly announcing that the “network” was going to take care of this (screen font) problem. MS announcing that they would not help was also refreshingly honest. The fashion show was really cool, I wish now that I’d bought a “kern” hoodie. And it’s always nice to be un-caffeinated, as I always am, amongst a whirling swirl of addicts. But the most joy I always get at conferences is seeing the people come out of the engine rooms of this industry to sit in the sunshine and hear nice things about type, because they deserve it the most.\n\n"
    },
    {
      "time": " 3.Sep.2006 7.56am",
      "content": "“I did not say that…we were too far north at the time and looking at a character that had no descenders, (I).”\n\nLOL!!! But it at least was always 10pt :-)\n\nChrisL\n\n"
    },
    {
      "time": " 4.Sep.2006 7.14am",
      "content": "David, I think those observations arise from the “blue-collar” (as you’ve put it) advantage that Typecon has over ATypI (although I personally think we need both for balance). Now if we could just get SoTA to revert to more populist venues...\n\n[http://www.ehi.com/travel/mexico/majorcit/tijuana-hotels-grand-hotel-tij...](http://web.archive.org/web/20080908102032/http:/www.ehi.com/travel/mexico/majorcit/tijuana-hotels-grand-hotel-tijuana.htm \"http://www.ehi.com/travel/mexico/majorcit/tijuana-hotels-grand-hotel-tijuana.htm\")\n\nhhp\n\n"
    },
    {
      "time": " 4.Sep.2006 8.24am",
      "content": "Being a “grass roots” organization, SOTA relies on locals for a significant part of its attendance. Conferences are organized by a local committee, and these are also people who have been involved as volunteers at previous TypeCons. So there is a combination of conference experience, committment, and local knowledge and connections going into every TypeCon.\n\nA number of South Americans have attended TypeCon, and one board member, Claudio Rocha, is from Brazil. So Sao Paulo would be a more likely venue than Tijuana.\n\n"
    },
    {
      "time": " 4.Sep.2006 8.45am",
      "content": "We’ve had this exact same discussion before, but the Typophile search isn’t working properly, and I’m too lazy/bored to rehash all the reasons why I think Tijuana is a much better option than anywhere in South America (at least until SoTA really gets its feet internationally wet).\n\nGet in touch with Jorge de Buen, and you’ll have the best Typecon to date.\n\nhhp\n\n"
    },
    {
      "time": " 4.Sep.2006 9.13am",
      "content": "I guess Tijuana is an easy drive from LA?\n\nChrisL\n\n"
    },
    {
      "time": " 4.Sep.2006 9.15am",
      "content": "\\>at least until SoTA really gets its feet internationally wet\n\nOnce again Canada gets lumped in with the US - no wonder they all hate us up there :-)\n\n"
    },
    {
      "time": " 4.Sep.2006 9.18am",
      "content": "With all the type folks in Canada, it seems like a good choice. I don’t know which city would be best though. Toronto?\n\nChrisL\n\n"
    },
    {
      "time": " 4.Sep.2006 9.30am",
      "content": "Yep, we did Toronto in 2002. Hence the smiley.\n\nCheers, Si\n\n"
    },
    {
      "time": " 4.Sep.2006 9.36am",
      "content": "Chris: Yeah, that explains how I drove to Thessaloniki, twice.\n\nSimon: Please note the “really”. It’s a magically useful qualifier. Really.\n\nhhp\n\n"
    },
    {
      "time": " 4.Sep.2006 9.42am",
      "content": "Seattle is the farest point of US we have from South America :) (between 17 and 26 hours from Buenos Aires). Anyway I think I ll go next year.... but San Diego or Tijuana sounds more funny and less rainy for me :P\n\n"
    },
    {
      "time": " 4.Sep.2006 10.55am",
      "content": "\\>Tijuana sounds more funny and less rainy for me :P\n\nSeattle is ’funny’ but in a different way. As for the rain that’s a myth designed to keep the Californians away (sorry Hrant) - sure it’s gray and damp between October 1 and June 1st, but NYC gets more annual rainfall. First week of August is a safe bet, and my guess is that the weather will be more comfortable in Seattle than Tijuana at that time of the year. Not that the weather really matters - my forecast “72 and fluorescent” inside the hotel.\n\n"
    },
    {
      "time": " 4.Sep.2006 10.58am",
      "content": "_72 and fluorescent_\n\nLOL!\n\n"
    },
    {
      "time": " 4.Sep.2006 11.05am",
      "content": "_I think Tijuana is a much better option than anywhere in South America_\n\nThat may be, but without anyone from Tijuana getting involved with TypeCon first, it’s unlikely to happen. Si waited for so long for TypeCon to come to Seattle, he went over to the other side.\n\n"
    },
    {
      "time": " 4.Sep.2006 2.29pm",
      "content": "“that explains how I drove to Thessaloniki, twice.”\n\nLOL!!!\n\nChrisL\n\nPS: Wish I could drive to Thessaloniki once!\n\n"
    },
    {
      "time": " 4.Sep.2006 3.09pm",
      "content": "I understand TJ is getting some culcha, once you get out of the immediate vicinity of the border. Might be a very fun location....\n\nI’m biased; I’m a Mexican citizen.\n\n"
    },
    {
      "time": " 4.Sep.2006 3.56pm",
      "content": "Hombre, TJ’s culture is muy pero muy rico, and it’s the Typecon kind.\n\n\\> without anyone from Tijuana getting involved with TypeCon first\n\nWhat is this, Israel versus Hzballa? Judging from what I’ve seen (like the Q&A after my talk at a university there about what it takes to design type) the merest flicker of attention on SoTA’s part would trigger a deluge of interest. Giving that a shot certainly wouldn’t take much energy; in fact with Jorge in the picture all it might take is one email. BTW, MS and Adobe aren’t exactly “grass roots”...\n\nAnd Simon: The weather is here, wish you were beautiful.\n\nhhp\n\n"
    },
    {
      "time": " 4.Sep.2006 4.04pm",
      "content": "Mira, just ask Armin Vit.\n\nhhp\n\n"
    },
    {
      "time": " 4.Sep.2006 4.16pm",
      "content": "\\>And Simon: The weather is here, wish you were beautiful.\n\nWhere there’s smog there’s ire ;-)\n\n"
    },
    {
      "time": " 4.Sep.2006 8.36pm",
      "content": "_MS and Adobe aren’t exactly “grass roots”…_\n\nThat’s what we keep telling them, and hopefully next year MS will rise above the “24pt” sponsorship level.\n\n"
    },
    {
      "time": " 4.Sep.2006 9.04pm",
      "content": "Ha!\n\nBut we should get back to answering Josh’s question I think.\n\nI’ll have a slash -\n\nBest workshop - for me Adam Twardoch and Thomas Phinney talking about using MM tech with fontlab.\n\nBest pressentation - That’s hard because I liked nearly all of them and the vast majority were very strong. But if pushed I would make it a 3 way tie between John Benson talking about Dwiggins, Bruno Steinert talking about Adrien Frutiger & Mike Parker talking about Adrien Frutiger.\n\nBest thing I learned... probably the current state of font tech/management and how difficult is is inevitably going to be to be even mostly on top of it.\n\nMy feeling is that you are only ever going to get 2% of what an attendee had available to them via typophile even if we all cooperate fully & disgourge all our fave info from TypeCon.\n\n"
    },
    {
      "time": " 4.Sep.2006 9.14pm",
      "content": "The strangest moment: In a darkened room, Bruno Steinert at the lectern, reading the Book of Genesis to the hushed congregation, while we gazed in awe upon Adrian Frutiger’s illustrations and book design for the same.\n\n"
    },
    {
      "time": " 4.Sep.2006 11.18pm",
      "content": "That was remarkably weird & cool.\n\n"
    },
    {
      "time": " 5.Sep.2006 4.51am",
      "content": "Amen Brother Nick.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Sep.2006 7.27am",
      "content": "Hr: “the “blue-collar” (as you’ve put it) advantage that Typecon has over ATypI”\n\nSadly, the gap is widening as A continues to put it’s money into professional managment, turning the content into a Sponsor-Feast of lessening interest to the constituents at the required price point. Or as V.P. Hudson put it, you “Must be willing to work with others” or you can’t speak. Good for a miner’s convention perhaps, but you end up with a majority of content from folks who are willing to be herded together intellectually, which basically means the food and weather has got to be good, or else. The other option seems to be getting on the programme commitee, allowing you to appoint yourself to as many sessions as you want, something I never had the “class” to do even when I was both sponsoring and organizing my little butt off.\n\nAn example of this content mismanagement is the Tech thingy, where one 1 hr. session would do for all the “Table Editor Wars”, but instead it’s 3-4 hours of developers, giving a demo, some of which are about “automatic” OT (like du-udes, how much do you need to know, (in person), about something that’s automatic?!). This one’s not for me, being more interested in things like CT vs. Quartz, Optical scaling for midgets, and the Em as a unit of thought.\n\n“Tijuana” ??? They don’t have a four-star conference center there which is why I suggested Cancun. And no, I’m not organizing for a summer conference there, that would be stupid.\n\n"
    },
    {
      "time": " 5.Sep.2006 8.04am",
      "content": "I do agree with some of your perspective on ATypI. On the other hand,  \nTypecon itself has been veering towards the ATypI model in some ways...\n\nCancun?! Spoken like a true right coaster. Guys, just spend the extra couple of hundred, forego the 50s-Cuba of the 90s, and see something real (like grade-A bicultural graffiti) on your breaks from the oversized margaritas and guacamole nachos. Cancun isn’t a town, it’s a really big wetbar.\n\nI’ve stayed at the Grand Hotel Tijuana (which is a short drive from San Diego, so you can guess at the quality of the weather there) and I suspect it would work out, but I admit that’s an inexpert evaluation (for one thing I don’t know if the audio-visual technicals are in place). But if the technicals are there, it’s El Venue (for Typecon if not for ATypI).\n\nhhp\n\n"
    },
    {
      "time": " 5.Sep.2006 8.47am",
      "content": "A parallel to Cancun tourism:  \n [http://www.theonion.com/content/node/28470](http://web.archive.org/web/20080908102032/http:/www.theonion.com/content/node/28470 \"http://www.theonion.com/content/node/28470\")\n\nhhp\n\n"
    },
    {
      "time": " 5.Sep.2006 9.03am",
      "content": "\\>An example of this content mismanagement is the Tech thingy\n\nI think this is somewhat insulting to the volunteers (Tiffany, Tom, and John Hudson before) who’ve put in many hours pulling these forums together. I’ve been involved in three or four of these, and I don’t recall seeing a single submission from you or anyone associated with the Font Bureau.\n\n"
    },
    {
      "time": " 5.Sep.2006 12.00pm",
      "content": "David: _Or as V.P. Hudson put it, you “Must be willing to work with others” or you can’t speak._\n\nIt is a good thing that people can go and read [what I actually wrote](http://web.archive.org/web/20080908102032/http:/typophile.com/node/27776), David. I never said that willingness to work with others was a prerequisite to speaking at an ATypI conference, I said it was a prerequisite to getting involved with organising an ATypI conference. It is simply a practical observation: they are collaborative efforts.\n\n"
    },
    {
      "time": " 5.Sep.2006 12.36pm",
      "content": "David: _Sadly, the gap is widening..._\n\nHrant: _On the other hand, Typecon itself has been veering towards the ATypI model in some ways…_\n\nSo is it widening or narrowing? Reports I hear from attendees of both conferences suggest that it is indeed narrowing, and that doesn’t surprise me at all. I suspect TypeCon will become more and more like ATypI simply because the grassroots enthusiasm and verve that pulls off something like the first TypeCon or pulls off TypeLab or pulls off the first Font Technology Forum (Leipzig) is not sustainable. Things become institutionalised in order to continue to happen, and there is a constant tension between what is gained in terms of sustainability and what is lost in terms of experimentation and immediacy. Some of us do our time in the institution, trying to balance these things, and some of us (Jean François, myself, many other ATypI board members) do so despite grave doubts about even the wisdom of perpetuating the institution, but in an effort to see if it can be improved. Other people just complain a lot, which can be helpful too.\n\nAfter the Font Technology Forum in Leipzig, David, you came up to me and told me that it was the only worthwhile part of the conference. Now you are telling me that what that evolved into — the TypeTech Forum — is ’content mismanagement’. Also in Leipzig, Erik Spiekermann suggested to me that the best type conference would consist of about 50-100 people with a few projectors and screens in a warehouse. No caterers. No ’official conference hotel’. No association. No conference planners. No programme committee. Just the right people getting together to talk about the best ways of doing things and to share information.\n\nI basically agree with that. And I think it would happen once, and if one tried to do it more than once it would start to assume an institutional structure and would follow TypeCon into ATypIdom. I remember when Petr van Blokland was elected to the ATypI board, and he expressed discomfort: that he had gone from being a revolutionary to being part of the establishment. I told him then that it is the purpose of every revolution to create a new establishment.\n\nMy view of ATypI is this: it is going to need to change and to become something new, but in order to do that it needs to be structurally changed. The ways in which decisions are made need to be freed up and made more democratic and transparent. Fifty-years worth of ossification and outdated statutes need to be broken down, and _then_ members have to want to take control of the association. And all the while, the thing has to be kept afloat financially. I think its great that people are talking about what they like and dislike about ATypI and what they think it should do differently, because that conversation needs to happen. But after two years on the board, my ambitions are pretty much limited to structural change, to allow others to take control of the future of the association.\n\nWhen my term on the board ends, and Erik’s term ends, perhaps we’ll go find that warehouse.\n\n"
    },
    {
      "time": " 5.Sep.2006 1.45pm",
      "content": "\\>Also in Leipzig, Erik Spiekermann suggested to me that the best type conference would consist of about 50-100 people with a few projectors and screens in a warehouse.\n\nI love it! TypeScrum!\n\nSi\n\n"
    },
    {
      "time": " 5.Sep.2006 2.14pm",
      "content": "_TypeScrum!_\n\nAdd to my list of no caterers, no official hotel, no etc. _no trademarkable name._\n\n"
    },
    {
      "time": " 5.Sep.2006 2.21pm",
      "content": "The Type Conference With No Name\n\n"
    },
    {
      "time": " 5.Sep.2006 2.25pm",
      "content": "If there are no caterers, then it can’t be scrumptious.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Sep.2006 2.44pm",
      "content": "Thanks for your comments everyone. It’s obvious there is no experience like being there. I will have to make next year my 1st TypeCon experience.\n\nJosh\n\n"
    },
    {
      "time": " 5.Sep.2006 4.36pm",
      "content": "John, are you implying that David and I agree as a rule?!  \nAnyway, the gap between Typecon and ATypI could be  \ngetting narrower or wider, but they could still be both  \ngoing in the wrong or right direction!\n\n\\> Things become institutionalised in order to continue to happen  \n&  \n\\> it is the purpose of every revolution to create a new establishment.\n\nThese are classic Western fallacies.\n\n\\> Fifty-years worth of ossification and outdated statutes need to  \n\\> be broken down, and then members have to want to take control\n\nAaah, how nice it would be to hear you admit that about the alphabet,  \nchirography, etc... Not that I think Control is the point of life though.  \nBut certain people are only capable of being critical of things they  \ndon’t already own. It’s OK - the world needs all kinds.\n\nhhp\n\n"
    },
    {
      "time": " 5.Sep.2006 4.45pm",
      "content": "I would definitely go to Typecon in Tijuana. It’s a hell of a lot more convenient than Boston or Seattle, though I realize that this is not true for many of us. And there’s so much wonderful lettering there that is so genuine and alive!\n\n"
    },
    {
      "time": " 5.Sep.2006 5.48pm",
      "content": "_If there are no caterers, then it can’t be scrumptious._\n\nSure it can, it just needs to be located close to some good restaurants.\n\n"
    },
    {
      "time": " 5.Sep.2006 5.50pm",
      "content": "_These are classic Western fallacies._\n\nSo what is the classic Eastern counter example? The Cultural Revolution?\n\n"
    },
    {
      "time": " 5.Sep.2006 6.14pm",
      "content": "Large warehouses close to good restaurants?  \nA type conference in downtown LA, yay!\n\n\\> counter example?\n\nThere you go again.\n\nhhp\n\n"
    },
    {
      "time": " 5.Sep.2006 6.25pm",
      "content": "\\>If there are no caterers, then it can’t be scrumptious.  \n\\>Sure it can, it just needs to be located close to some good restaurants.\n\nI’m sure we can convince the local roach-coach/catering-trucks to stop by - however they may up their prices when they see the line of expensive Beemers and Audis parked up outside the warehouse.\n\nAs an alternative to the warehouse space I was thinking we could use a largish bar/nightclub during the day - they could provide some nice pub-grub and other “refreshments”, and such a location might help convince the typorati to hang around into the evening. I’ll suggest this to Tamye.\n\n"
    },
    {
      "time": " 5.Sep.2006 8.11pm",
      "content": "_John, are you implying that David and I agree as a rule?!_\n\nNo, I was just drawing attention to the fact that we had two contradictory statements about the comparative relationship of TypeCon and ATypI. Both of them are interesting statements, but they can’t both be true or, rather, in order to both be true they need to be talking about different aspects of the two conferences.\n\nBut I really think David just wants to give ATypI a hard time — perhaps for good reasons —, and I find it bemusing that his biggest target is the TypeTech Forum which a) is not part of the ATypI conference, b) is not planned by the conference programme committee, and c) is run by three people whom you can expect to be very involved in next year’s TypeCon conference in Seattle.\n\n"
    },
    {
      "time": " 6.Sep.2006 5.48am",
      "content": "I am not sure how a venue is picked for either AtypI or TypeCon but I imagine it starts with some grassroots interest at the locations who want it to be there. This means a core of zealots who are willing to bust their butts to make it happen and have the contacts and wherewithall to do it. This hardcore group are of course volunteers and willing to sweat blood for free to make the event a success. I assume there might be competing groups from various cities and countries pushing for their own region.  \nSo, I imagine if their were such a hardcore group of volunteers in either Tijuans or Cancun, or Brisbaine or Tuscaloosa, that they could make their case and do the work.  \nI, for one, am very grateful to the folks who have put forth the tremendous effort it took to make the 2 Typecons happen which I have been to. I applaud their effort and wish them a speedy transfusion to replenish their blood count! I am sure the same is true for AtypI events, TDC events—some of them are the same core people who continually give of themselves. Certainly everyone on the SoTA board needs a solid round of applause from the rest of us who have been able to reap the harvest of their labor.\n\nBravo to all those who make things happen!\n\nChrisL\n\n ![](http://web.archive.org/web/20080908102032im_/http:/typophile.com/files/clapping_6192.JPG)\n\n"
    },
    {
      "time": " 6.Sep.2006 7.31am",
      "content": "Atypi Is headed, from 500-700 people to 200-400. TypeCon is headed from 50-100 to who knows, 400-500 is likely to be a minimum.\n\n“the TypeTech Forum which a) is not part of the ATypI conference,” lol. This...is a distinction that very very few people would recognize, anywhere. Anyone here who can tell from the web site that the Tech forum is a separate entity? raise your mice.\n\n“c) is run by three people whom you can expect to be very involved in next year’s TypeCon conference in Seattle.”\n\nAnd?\n\n“After the Font Technology Forum in Leipzig, David, you came up to me and told me that it was the only worthwhile part of the conference”\n\nYou have to pay attention John, a.) I got in for free, b.) just about the same content was offered then as now...but it was fresh.\n\n"
    },
    {
      "time": " 6.Sep.2006 8.49am",
      "content": "TypeTech is separate insofar as it is a mini-conference leading up to ATypI and is, similar to the workshops at TypeCon, an additional fee for those who wish to attend.\n\nThis is my first year being involved with TypeTech as an organizer, so I cannot speak for past years. I hope Thomas or Simon respond as they understand the topics to a level that I do not.\n\nThat said, this year the hope was to have content for intermediate to advanced people who wish to spend 2 days delving deeper into the various topics. Given that the talks are not longer than 1.5 hours (except those that also have tuturials) and not shorter than .5 hours, they are to some extent introductory. But, that is not to say they are introductory for someone who has never designed type.\n\n"
    },
    {
      "time": " 6.Sep.2006 9.51am",
      "content": "\\> they could make their case\n\nThat’s one way, and it does work. But a less aloof, more proactive and in the end more conducive to growth (not least culturally) alternative is to keep an eye out for locations that have <cite>potential</cite> and at the very least plant a seed. That way you don’t just react, you create.\n\nDavid, the paradox though is that ATypI <cite>membership</cite> seems to have gone up quite a lot (and I’m assuming not all of that is due to the highly gracious “non-affluent” membership scheme that Typophile can be credited with triggering).\n\nhhp\n\n"
    },
    {
      "time": " 7.Sep.2006 10.42am",
      "content": "I think TJ is a fantastic idea - Zona Rosa is one of the most pleasant walking/shopping/eating districts on all of the west coast of North America, and cheap too! We could have folks in 2 or 3 3-star hotels for $70 a night, easily. And San Diego has become a cheaper airport to fly into in the last year as more and more southwest and united flights have been using it.\n\nHowever, I’m holding out for Havana. Haven’t seen my uncle Fidel for years.\n\nas for ATypI, I haven’t gone in years. Went one year as a student and had a good time, but of course no student can really afford it (at least, not students without wealthy benefactors); I was able to work in exchange for my registration. I attempted to do the same several years after that, but once its management became a ’for-profit’ endeavor, nobody seemed interested in accomodating student volunteers (or other low-income folks). This elitism and exclusivity really turned me off, so it was refreshing when I found a group like SoTA that with a few small caveats avoids those problems and embraces everyone in the discipline.\n\n—-\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20080908102032/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": " 7.Sep.2006 11.24am",
      "content": "BTW, a room at the Grand Hotel should end up being less than US$100 (like they have a weekend special right now for $90, and that includes a quite impressive buffet breakfast for two). More money left over for the auction! And the San Diego connection might work out superbly, with a rented “typoholic bus” (remember the ill-fated Bouma Bus? :-) across the border a stratagem to consider.\n\nhhp\n\n"
    },
    {
      "time": " 7.Sep.2006 5.51pm",
      "content": "Joshua, ATypI is a non-profit association and the organisation usually just scrapes by financially each year. It’s management is not a ’for profit’endeavour, but the association does employ professional conference organisation and administration because of bad experiences relying solely on well-meaning amateurs and volunteers. ATypI has done so since 1997; what year did you attend, and what do you think was different in subsequent years? Regarding accomodating student volunteers, we have large numbers of them at every conference (there is a roster of 30 of them for Lisbon), but they are local students from design schools who are partnering with the association. Obviously, giving such opportunities for involvement and attendance to local students is one of the things ATypI is able to offer to the local design and education community.\n\n"
    },
    {
      "time": " 8.Sep.2006 1.46am",
      "content": "Joshua,\n\nthe early-bird ATypI Lisbon conference registration for students and for citizens from low-income countries is US$175, and I don’t remember it being higher than US$250 in the past. While the TypeCon registration fee is lower, the last TypeCon events have taken places in cities where food and accomodation is not necessarily cheap (esp. when compared to Leipzig, Prague or Lisbon). I believe the overall cost is comparable.\n\nOf course, it’s usually more expensive to fly overseas, so it’s not surprising that the Europeans tend to visit the conferences that happen in Europe (which usually is ATypI) and the Americans tend to visit the conferences that happen in the U.S. (which usually is TypeCon). But the prices for overseas flights aren’t what they used to be, they are cheaper than they were 5 years ago, I think.\n\nIn fact, it is more difficult for a foreigner to attend TypeCon than any ATypI conference (for example, the U.S. requires visas from citizebs of more countries than the E.U. does, if ATypI happens to be in the E.U.) — remember that in 2004, I could not attend TypeCon San Francisco since I was not given a U.S. visa on time?\n\nI’ve been to all ATypI conferences since 1998, except the 1999 Boston event. Until I started working for Fontlab Ltd. in 2004, I always financed the trips all by myself, and I did live on a “student budget” for quite a long time. As for the typographic “folk” who attends the conference, I never felt much difference in “elitism and exclusivity” between ATypI and TypeCon — I actually felt they kind of are the same. However, at ATypI, it is actually true that people speak in more languages (English is still predominant but not to the same extent), and sometimes it is a bit difficult to communicate with everybody.\n\nThe profiles of the conferences certainly are different. I believe the ATypI conferences have a more international flair, simply because each year, they happen in a country where a different language is spoken. Even just visiting cities like Lyon, Leipzig, Copenhagen, Rome, Vancouver, Prague, Helsinki or Lisbon, noticing the different typographic styles in signage, observing how the alphabet works in different languages — this is all absolutely fascinating, and always has, for a typophile like myself. Also, you always have the unique chance to see some local speakers and attendees who never actually go to any foreign conferences whatsoever.\n\nI’ve been a member of the ATypI Board since 2000, and I simply cannot agree with the remarks about “for-profit management”. Both SoTA and ATypI have paid postitions of an Executive Director, who has also been organizing the conference, while all the other positions are unpaid and based entirely on volunteers’ work. In fact, after having some conversations with SoTA Board members this year, I found out that both the structure and the actual problems that we’re facing, are really quite the same.\n\nI’m trying to attend both ATypI and TypeCon because I would feel that missing one would always deprive me of something interesting. Luckily, the conferences are quite complementary, and I don’t think there is much redundancy.\n\nA.\n\n"
    },
    {
      "time": " 8.Sep.2006 7.11am",
      "content": "Siiiiii “...this is [] insulting to the volunteers who’ve put in many hours... I don’t recall seeing a single submission from you or anyone associated with the Font Bureau.”\n\nInsult? No, an insult is when a company tells A Continent that it’s new OS will be delayed for “Regulatory Reasons” ;) A criticism is something else: It says, in our case, there should have been, e.g. detailed CT sessions at this “forum” 5, 4, 2, 3 and 1 year(s) ago, not to mention zero years ago, and into the future..along with 3, 4 or 5 other critically important topics besides CT, “web font specs 07” e.g., should have been replacing some of the....other stuff that is, if not, repeating, just plain dumb content. That is mismanagement.\n\nP.S. You can’t recall seeing a single submission from me or anyone associated with the Font Bureau because...well, what do they look or sound like? so I can check the records.\n\nAnd... the link between the Continental issue and this, is Brad Smith, who recently complained that all these challenges in Europe “should have been done before, not after the product is released.” Well, if “I’ve been involved in three or four of these” is as true a Simon says, then you should talk to yourself, and see if you can “open up” the discussion before it’s too late, and someone rare, like me, who can partially rewrite their job discription, has to do so.\n\nCheers!\n\n"
    },
    {
      "time": " 8.Sep.2006 7.23am",
      "content": "\\>there should have been, e.g. detailed CT sessions at this “forum”\n\n[http://www.atypi.org/30\\_past\\_conferences/09\\_Vancouver/30\\_other\\_events/in...](http://web.archive.org/web/20080908102032/http:/www.atypi.org/30_past_conferences/09_Vancouver/30_other_events/index_html \"http://www.atypi.org/30\\_past\\_conferences/09\\_Vancouver/30\\_other\\_events/index\\_html\")\n\nDay 1 - Wednesday September 24  \nMorning  \n Introduction (MS Typography & Adobe)  \n Strategies in defining glyph and OT feature repertoires (MS Typography & Adobe)  \n Making clean outlines (MS Typography & Adobe)  \nAfternoon  \n Making OpenType tables using VOLT (MS Typography)  \n Making OpenType fonts using the FDK/FontLab (Adobe)\n\nDay 2 - Thursday September 25  \nMorning  \n Testing and proofing OpenType fonts (MS Typography & Adobe)  \nAfternoon  \n**Hinting theory (MS ClearType)  \n Hinting strategies (MS ClearType)  \n Hinting and ClearType (MS ClearType)**\n\nWhen I ran the forum last year I invited the CT team to participate, but didn’t get any takers. I’m hopeful that we’ll get some CT related stuff going at TC2007.\n\n"
    },
    {
      "time": " 8.Sep.2006 10.58am",
      "content": "\\>P.S. You can’t recall seeing a single submission from me or anyone associated with the Font Bureau because…well, what do they look or sound like? so I can check the records.\n\n[http://www.google.com/search?hl=en&q=atypi+tech+forum+call+for+papers&bt...](http://web.archive.org/web/20080908102032/http:/www.google.com/search?hl=en&q=atypi+tech+forum+call+for+papers&btnG=Google+Search \"http://www.google.com/search?hl=en&q=atypi+tech+forum+call+for+papers&btnG=Google+Search\")\n\n<cite><br>\nCall for Presentations for the TypeTech Forum at ATypI Lisbon 2006<br>\nAssociation Typographique Internationale (ATypI) Annual Conference Lisbon, Portugal, 27 Sep - 1 Oct, 2006 </cite>\n\nMarch 21, 2006 - Announcing the opening of the Call for Presentation Proposals for the TypeTech Forum of the ATypI Lisbon 2006 conference.\n\nThe Board of Directors of ATypI is proud to note that the ATypI Conference is sponsored by many of the leading companies in the graphic arts and computing. Early sponsorship for Lisbon comes from the Microsoft Corporation.\n\nThe ATypI 2006 TypeTech Forum committee invites submissions of abstracts for presentations on any theme related to technology in type design and typesetting. Based on previous feedback, there will be no separate introductory section this year; potential presenters should assume that their audience is versed in the basics of type technology, such as Unicode and OpenType.\n\nAppropriate topics include, but are not limited to: new methods in typeface design and production; approaches to testing fonts; issues and solutions for font development; and new technologies in typesetting. Proposals are welcome for practical demonstrations as well as lectures and panel sessions. Preference will be given to talks which have not been done before at TypeTech Forum or ATypI.\n\nAbstracts should include the title of the proposed presentation, the requested time length, the presenter’s name(s) and a short biographical note (50-100 words), and a short summary (100-200 words) suitable for publication in the conference programme. (Note: Biographies and presentation descriptions may be edited for length and/or clarity.) Presentation lengths in the TypeTech Forum are variable, but generally run between 15 and 60 minutes, including questions. Actual time allotted may sometimes be less than requested. Preference may be given to submissions received earlier, but the actual deadline is May 31, 2006.\n\nIt is expected that the speakers will provide the text of their presentations, and images if possible, for inclusion in a publication or on the web site after the conference.\n\nPresentation proposals should be sent to the programme planning committee by e-mail to [mailto:typetech@atypi.org](mailto:typetech@atypi.org \"mailto:typetech@atypi.org\").\n\nPlease note that all other correspondence should be addressed to the ATypI Secretariat and Conference Office (see below).\n\nLisbon TypeTech Forum Committee\n\nThomas Phinney, Adobe Systems; Simon Daniels, Microsoft Corporation; Tiffany Wardle\n\nATypI Executive Director: Shelley Gruendler\n\nAbout ATypI: Association Typographique Internationale is the only worldwide organisation dedicated to type and typography. Founded in 1957, ATypI provides the structure for communication, information and action within the international type community. ATypI annual conferences are attended by delegates from more than 40 countries. Recent Conferences have been held in Helsinki (2005), Prague (2004), Vancouver (2003), Rome (2002) and Copenhagen (2001). The ATypI Board of Directors: Jean-François Porchez, President; John Hudson, Vice President; Mark Barratt, John D. Berry, Henrik Birkvig, Ted Harrison, Gerry Leonidas, Thomas Phinney, Fiona Ross, Erik Spiekermann, Sumner Stone, Adam Twardoch, Pavel Zelenka, and Maxim Zhukov.\n\nAnd here’s a sample proposal (sure Ted won’t mind me posting it)\n\n<cite>——-Original Message——-<br>\nFrom: Adam Twardoch [mailto:adam@twardoch.com]<br>\nSent: Monday, March 27, 2006 6:40 PM<br>\nTo: <a href=\"mailto:typetech@atypi.org\">typetech@atypi.org</a><br>\nSubject: Submissions for ATypI TypeTech 2006</cite>\n\n3. Ted Harrison  \n“The Ubiquitous EULA. Practical application of the Electronic EULA Abstract.”  \n30 minutes\n\nTed will demonstrate the use of the EEULAA in protecting your fonts from casual  \npiracy and in improving your font sales. The EEULAA is now being incorporated  \ninto Fontlab tools and will be available to all font foundries by the time the  \nnext generation of tools appears. With a EEULAA in your fonts you can track  \nlicenses, solicit font upgrade sales, and make your customers easily and  \npainlessly aware of their rights and obligations under the EULA.\n\nSo easy a caveman could do it ;-)\n\nIt seems as if the content of the forum isn’t of interest to you, I’d suggest a strategy I took for Helsinki. First volunteer to organize the whole thing yourself, you could even have some of your peeps do the leg work.\n\nHere’s what I did. I started by going to the people I wanted to hear speak, about subjects I was interested in, that’s why we had Brian Kraimer talking about font certification, Michael Jansson talking about font embedding, Dave Opstad demoing some tools, Carl talking about Segoe Script, Tiffany talking about the EULA. I also posted a call for submissions on several lists and was able to find spaces for everyone who submited an idea - Victor Gaultney for example.\n\nSadly a few people I asked couldn’t make it - Joe Clark, the ClearType team and Peter Lofting (Apple sent an engineer, who actively participated and answered questions but didn’t give a talk). But I have to say, in my opinion, it was the best tech-forum ever. ;-)\n\nCheers, Si\n\n"
    },
    {
      "time": " 9.Sep.2006 4.38am",
      "content": "“So easy a caveman could do it ;-)”  \nWhat if cave woman loses the email?\n\n"
    },
    {
      "time": " 9.Sep.2006 7.43pm",
      "content": "Besides the active call for submissions, IIRC, I later posted to the ATypI list specifically asking for suggestions of topics people wanted to go see at TypeTech.\n\nDave, rather than waiting until the schedule is announced, why not submit suggestions about what you want to see, before the deadline? Heck, even shortly after the deadline. But not two weeks before the conference! :)\n\nPersonally, I’d love to see a talk on ClearType vs Quartz (possibly vs CoolType as well). However, it would be a matter of finding somebody to do such a talk. Any volunteers for next year?\n\nI’ll comment that my goals for this year’s TypeTech content were: (1) have as much new material as possible; (2) assume that people have some technical type background and focus on intermediate to advanced topics; (3) focus on the audience being people making fonts. So there’s no more “intro to Unicode” or “intro to OpenType layout” talks in the main track of TypeTech this year. We’ll do a survey of attendees again this year (as last year), and see how this goes over with them.\n\nT\n\n"
    },
    {
      "time": " 12.Sep.2006 9.24am",
      "content": "SII “But I have to say, in my opinion, it was the best tech-forum ever. ;-)”  \nAs W.C. said, “You should get out more often.”\n\nTF “But not two weeks before the conference! :)”  \nWe aren’t two weeks out even now, are we? July 27th was the first I became aware of, and commented towards any of this. Count much?\n\n“ClearType vs Quartz” don’t know...Screen fonts is the issue, Thomas, does anyone in this audience think Q vs CT? Ever? If anything they might think about CT & Q... But that wouldn’t occur to you ’cause you’re too busy trying to figure out how to slide CoolType in there, which is best kept hidden permanently, Thank you.  \n“The Ubiquitous EULA” it’s free, it’s documentable and ubiquitous, so what do lawyers from the various IP zones think? We’ll find out, not.  \n“The “boldness” information in an MM font is used to change the size of glyphs” This is New? Are you friggin asleep?  \n“What’s next?” “A presentation on something automatic?” “O good, maybe, if we’re really lucky, it’ll crash onstage.”\n\nFellas, I give you yourselves, and content that mirrors your limited understanding of the critical issues facing the purported audience, one that is perhaps not even you, and I’d hope you could be gracious and classy enough to see so, (though this my third year of commenting “Too late” lol, I’m trying at least). I don’t think people want this stuff, I certainly don’t think you’ll see me ever, on either end, your way, unless, with all due respect, you quit and never do it again.:)\n\nCheers!\n\n"
    },
    {
      "time": " 12.Sep.2006 1.10pm",
      "content": "_focus on the audience being people making fonts._\n\nThat would be me, I guess, but the last time I went to a type workshop (except once when I was a presenter) I quite literally ended up in hospital, after a muscle in my leg started twitching uncontrollably. I took that as a sign.\n\nIMO you have your military-industrial complex, your legislative-administrative complex, and then your typographic-software complex. The purpose of these organizations is to make life as complex, bureaucratic and technological as possible, thereby ensuring lots of work for bureaucrats and technicians. Not really the indie foundry profile.\n\nSure, indie folk can handle the paperwork and wouldn’t be in the biz if not technically inclined. We need to keep up to date, so we attend these events and some of us might even enjoy them occasionally, but it’s a necessary evil and _not_ the reason we decided to become the “people making fonts”.\n\n"
    },
    {
      "time": " 12.Sep.2006 1.34pm",
      "content": "Technique is an integral part of type design - manifest everywhere in the craft, even in something as seemingly simple as setting a sidebearing. If you don’t enjoy technique, that doesn’t mean you shouldn’t be making fonts, or that you can’t make good fonts\\*, but it does put you at a disadvantage, and that can’t be blamed on anybody (even if certain people don’t in fact have the best intentions for you otherwise). Personally, if there weren’t so much technique in type design, if it were essentially painting pretty shapes, I would never have started doing it.\n\n\\* Although I might argue that it does prevent you from making the <cite>best</cite> fonts, at least in the realm of text.\n\nhhp\n\n"
    },
    {
      "time": " 13.Sep.2006 10.55am",
      "content": "\\>As W.C. said, “You should get out more often.”\n\nI realize that you’re a very busy man, with important things to do, but I think if you’d exerted 5% of the effort you’ve exerted in griping about the event, there might have been some content of interest to you.\n\nPerhaps you could have sent an email to the organizers, or picked up the phone and had someone submit a talk idea, hey maybe even put forward a talk idea yourself.\n\nBut no, it’s more fun to gripe and moan, hint at conspiracy theories and conveniently ignore the fact that the content you’re interested in was presented four years ago.\n\n"
    },
    {
      "time": " 28.Sep.2006 5.45am",
      "content": "Dear Simon,  \n\\>Perhaps you could have sent an email to the organizers  \nI did, several times, beginning in feb. Can you read CT?\n\n\\> the content you’re interested in was presented four years ago.  \nCorrect. It was presented at the Poynter Institute for Media Studies by your company. I called it a rabbit hole out of which the emperor’s new fonts had emerged, and I did so to the developer’s face at the time. It seemed to have no effect.\n\nMy response has been to follow that content here and other places, and debunk it, as best an individual can. As I hope you’ve read on the atypi list, ( Re: [ATypI] ClearType Hinting ) the content I was interested in is a refutation of the content your company, Mr. Hudson, and others involved in ATypI, have been presenting since 2000 — Namely, that the “intersection” of optimized screen fonts for any great stretch of the Unicode Marathon, in a multi-biplane environment or 3.... is in a different direction and location from the intersection your company, Mr. Hudson, and others are just beginning to understand the limitations of...now.\n\n\\>hint at conspiracy theories  \nI have never said any such thing consciously existed — but if you insist, the conspiracy to make the content understood was made by me at some great risk. The conspiracy to rise above the humdrum of normal typographic content, normal content development “rules”, not to mention schedules, and other nonsense objections — should have been simple. That my “intersection”, (which is really an endless field relative to the MS CT Collection’s rabbit hole), requiring Gazzilla-bytes of skilled letter drawing and contextual substitution hounding, was about to intersect with a conference of letter drawers and substitution hounds, was a coincidence I tried to take advantage of since February.\n\nAre you with me so far? :)\n\nCheers!\n\n"
    },
    {
      "time": " 28.Sep.2006 7.08am",
      "content": "\\>I did, several times, beginning in feb.\n\nNo you didn’t - no mail came from you to the typetech alias. If you sent mail to JFP and John Hudson, they neglected to pass it on - perhaps they couldn’t follow what you were saying.\n\n\\> the content you’re interested in was presented four years ago.  \n\\>Correct. It was presented at the Poynter Institute for Media Studies by your company.\n\nEr, no. I was talking about the afternoon of sessions on ClearType hinting at ATypI Vancouver.\n\n\\>requiring Gazzilla-bytes of skilled letter drawing and contextual substitution hounding\n\nso your entire problem is that making fonts is hard and somehow by spending a lot of money and having a bunch of rocket scientist hinters Microsoft is cheating? You can say that on your blog, you don’t need a afternoon of talks on the subject.\n\n"
    },
    {
      "time": " 2.Oct.2006 5.23am",
      "content": "Ahhhh. Vancouver. The beginning of the big lie.\n\n“so your that making fonts is hard and spending a lot of money and having a bunch of rocket scientist hinters Microsoft is cheating?”\n\n:) Yes and no. Making fonts is harder than your company has tried, and hinting is dead, though hints are not. Rocket Scientists...no. Type Scientists, neither. You missed it, so I think you deserve a promotion, maybe even a presidential medal of honor.\n\n“You can say that on your blog, you don’t need a afternoon of talks on the subject.”  \nOh, I don’t think so, my blog is for clients. There is only one group who would need an entire afternoon of talks to get this, and that is your own.Type designers, and users, understand it right away, (or in less than 35 minutes). Ask Greg, he can both read and understand.\n\nIf your team was about to run into a bear mauling, you’d feel bad if I didn’t tell you in advance, wouldn’t you? ;)\n\n"
    }
  ]
}
