{
  "id": "27993",
  "title": "(x) Great Dane Charters - Desdemona {Stephen}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Looks like eaglefeather. Anyone know the real name?\n\n ![](http://web.archive.org/web/20120122122458im_/http:/typophile.com/files/gd_5611.jpg)\n\n",
  "author": "<a href=\"/web/20120122122458/http://typophile.com/user/5948\" title=\"View user profile.\">evan</a>",
  "time": "<br>",
  "uid": "5948",
  "comments": [
    {
      "time": "",
      "content": "I think this is [Quaint Gothic](http://web.archive.org/web/20120122122458/http:/www.myfonts.com/fonts/spiecegraphics/quaint-gothic-sg/) from Spiece Graphics.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Looks like a Rennie Mackintosh inspired, rather than Wright. Others:\n\n[ITC Rennie Mackintosh](http://web.archive.org/web/20120122122458/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontpackage&startrow=1&records=&currpage=1&totalrecords=3&displayfontid=ITC.100488.0.0&fontRendererText=GREAT+DAYNE+CHARTER)  \n [Noovo](http://web.archive.org/web/20120122122458/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&startrow=1&records=100&currpage=1&totalrecords=2&searchby=&searchID=&searchletter=&searchstr=noovo&font_categories_checkbox=font_name_search&fontRendererText=GREAT+DAYNE+CHARTER)\n\n"
    },
    {
      "time": "",
      "content": "Ahh, you may be right, Mike. Tho [Quaint](http://web.archive.org/web/20120122122458/http:/www.myfonts.com/fonts/spiecegraphics/quaint-gothic-sg/?refby=typographica) is heavier.\n\n"
    },
    {
      "time": "",
      "content": "Could it be the interior of [Desdemona](http://web.archive.org/web/20120122122458/http:/www.identifont.com/show?1N7) which is available in the MS Office Pack for Mac?\n\n"
    },
    {
      "time": "",
      "content": "That's possible Stephen, but I can also make it lighter by adding white stroke. I'd have to check the MS character set, because this uses the alternate S, which is present in Quaint.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "The inside of Desdemona is exactly right. Good call.\n\n"
    },
    {
      "time": "",
      "content": "Desdemona does have the alternate S (and the regular one in the other case). I am trying to make the samples, since I have both fonts, but it may take a few minutes.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "_\"The inside of Desdemona is exactly right.\"_\n\nIt might seem that way, but at least with Illustrator I cannot get that to 'fill'. The font was drawn as an outline. When you reverse 'stroke' and 'fill' you just get a darker outline.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I see you already gave Desdemona as the final answer, but please look at this.\n\n- Mike Yanega\n\n ![](http://web.archive.org/web/20120122122458im_/http:/typophile.com/files/GreatDayneSim_4111.gif)\n\n"
    },
    {
      "time": "",
      "content": "And please pardon my typo on the last item. I am still trying to figure out how to get fonts from the old OS to the new one, and I was hurrying to prove my point.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I'm not sure about Illustrator, but in CorelDRAW, you can convert the text to curves, break the curves apart, then manually delete everything you don't want. It would take some time, but you could potentially get only the inside of Desdemona.\n\n- Lex\n\nP.S. Just thought of a slightly faster way - convert the text to curves, draw a big rectangle around everything, combine all the objects together, break it apart, delete the big rectangle, then delete all the shapes within the counters.\n\nEDIT: Whoops - that wouldn't work.\n\n"
    },
    {
      "time": "",
      "content": "I think my point is that the inside of the MS Desdemona is empty. I would be interested to see someone actually create this from Desdemona. I tried everything I could think of, but just with Illustrator, which can normally do anything with type you want.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Use the direct selection tool and select and delete the paths you don't want. Easy.\n\n"
    },
    {
      "time": "",
      "content": "Hmmm. Interesting. I'm having a devil of a time getting the counters to stay white. And the letters still look too fat.\n\nSo you actually did this, and think this is the right answer?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20120122122458im_/http:/typophile.com/files/SAMPLE_3529.jpg)\n\n"
    },
    {
      "time": "",
      "content": "OK. I know when to give up. You win.\n\nCan you tell me how you keep the counter white?\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I think that you can achieve that by converting the characters to outlines and removing the outer shapes.\n\n"
    },
    {
      "time": "",
      "content": "I did that, then used the individual selection tool, and was able to expose the black underlayer, but I couldn't do it so the counter stayed white.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "You have to recombine the outlines - don't know what it's called in Illustrator.\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "OK. I did it with the Pathfinder tools. I isolated the counter outline and filled it with white, and then went back to the outer shape and filled it with black.\n\nNow I would need to use the white outlining stroke to reduce the apparent stroke thickness. Whew! Thanks for the tutorial Lex. I'm done with this one.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "In Illustrator, glyphs with counters that have been converted to outlines should then be converted individually into \"compound paths.\" This will allow the counters to \"show\" whatever you put behind them - including a blank page.\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    }
  ]
}
