{
  "id": "28005",
  "title": "Church logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "So, I'm starting this logo for a church and would like some feedback before I submit it to the client. This is the first round, so see how it goes.\n\nWhat do you think?\n\n ![](http://web.archive.org/web/20131023033943im_/http:/typophile.com/files/CFF-logo_3531.jpg)\n\n",
  "author": "jeremydouglas",
  "time": "1 Sep 2006 — 9:35pm",
  "uid": "6500",
  "comments": [
    {
      "time": "1 Sep 2006 — 11:45pm",
      "content": "I like the leaf graphic, but it may not be immediately recognizable as church from the graphic alone. The sans \"CORNERSTONE\" lettering seems spaced to closely, especially on the bottom one. I'm not particularly fond of that sans font. Doesn't seem solid enough for a place with the name Cornerstone. On the bottom graphic, try modulating the white horizontal curving line to make it more calligraphic. Also, lowercase looks bad letterspaced. Instead, having the \"Faith Fellowship\" align right might look good. The \"Faith Fellowship\" is also pretty lightweight compared to everything else in the bottom one. The C graphic in the second one is nice, but does not match any of the the font choices. The C in the 3rd one is kinda awkward--should lean more towards either a recognizable graphic (what is going on?) or a letter (is that a G?). I hope these suggestions are helpful to you--its just the stuff that immediately came to mind. Those logos are great to start from.  \nEron\n\n"
    },
    {
      "time": "2 Sep 2006 — 1:20am",
      "content": "To me, the bottom one says \"church\" the clearest. The top would be my second choice. For some reason, I think \"community college\" when I look at the second and third logos.\n\nFor the bottom one, I agree that \"CORNERSTONE\" could use a little space, both between the letters, and on either side. Try to match the space on the sides with the space on the top. It looks off that there's so little space in \"CORNERSTONE\" and so much in \"Faith Fellowship\". The letterspacing in the latter doesn't work.\n\nThere should also be more space between the two lines of text. The text seems too close to the image below as well (the sun is almost poking Fellowship's 'i' out :P).\n\nWhat type of church is this? Most religions have a symbol that can identify them easily. Was the decision to leave out a Cross / Star of David / &c. intentional?\n\n- Lex\n\n"
    },
    {
      "time": "2 Sep 2006 — 9:15am",
      "content": "If you need to letterspace the bottom line of type, try using small caps instead, provided your typeface has them.\n\n"
    },
    {
      "time": "2 Sep 2006 — 8:24pm",
      "content": "Slightly off topic to the original post ... can someone tell me why chruches need logos?\n\n----------  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20131023033943/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "2 Sep 2006 — 8:33pm",
      "content": "What about taking the name literally and draw a square with a circle on one of the corners or something? Or make it more advanced? I think that would look pretty good, actually.\n\n-- David\n\n"
    },
    {
      "time": "3 Sep 2006 — 3:59pm",
      "content": "\"What type of church is this? Most religions have a symbol that can identify them easily. Was the decision to leave out a Cross / Star of David / &c. intentional?\"\n\nYeah, so many churches have a cross, dove, and the like. It's very overdone. Thanks for the pointers on spacing.\n\n"
    },
    {
      "time": "3 Sep 2006 — 4:04pm",
      "content": "\"Slightly off topic to the original post … can someone tell me why chruches need logos?  \n—————  \nPaul Ducco  \nGraphic Design, Melbourne\"\n\nIt's funny how everything is marketed these days. I guess that can turn into an ethical discussion. IMO it can be good or bad.\n\n"
    },
    {
      "time": "3 Sep 2006 — 4:11pm",
      "content": "What are your communication goals, Jeremy? As others have pointed out and I agree with, these logos don't say 'church' or even \"religion' to me, so clearly you have other driving factors. If you are avoiding religious iconography simply because they are \"overdone\", I think your reason for avoiding them is not very strong. I'm trying to imagine the client meeting with church representatives where you tell them about playing down the religious aspect. Is there something in the client's creative brief or desires that led you in this direction?\n\nFrankly, a well-chosen typeface and sensitive typesetting will take you much further than any of the imagery you've used. (One example that I've seen on book covers and some films is H&FJ's [Requiem](http://web.archive.org/web/20131023033943/http:/www.typography.com/catalog/requiem/index.html). I think you might be trapping yourself into doing something that feels generic for non-churches in an effort to avoid the generic for churches. Christian institutions have been integral in design, art, and architecture for centuries. There's more than enough there to draw from without falling on overdone solutions. Much of it is subtle and can be incorporated with stylistic choices, rather than direct references (crosses, doves, etc.).\n\nThis is an instance where your logos aren't bad, per se, just perhaps not as appropriate as they could be.\n\n"
    },
    {
      "time": "3 Sep 2006 — 4:14pm",
      "content": "However, if you want to avoid overt religious imagery, then I'd push the concept/visual of the cornerstone. This would allow for some more contemporary interpretation, as well, which seems to be what you're going for.\n\n"
    },
    {
      "time": "3 Sep 2006 — 6:00pm",
      "content": "Thanks for all the pointers folks. I do really love this forum for all the great input.\n\nHere's a thought I had on fathairyape (David's) suggestion…\n\n ![](http://web.archive.org/web/20131023033943im_/http:/typophile.com/files/CFF-logo-circle-square_5404.jpg)\n\n"
    },
    {
      "time": "3 Sep 2006 — 6:27pm",
      "content": "Thanks Chris Rugen, Requiem looks like it would be nice. I haven't purchased it but maybe I'll try a version with a similar typeface. I'm not sure that it would on it's own give the solid weight of \"Cornerstone\".\n\nAs far as what the client is looking for, they aren't looking for something \"too crazy\". Small town, small church.\n\nMy reason for not using doves and crosses is that the company that contracted me the job has told me on other similar jobs not to use such imagery. There's always a way to use traditional imagery in a new way though. I guess I could have tried since this particular church didn't say that, but I figured it was best to stay away.\n\n"
    },
    {
      "time": "3 Sep 2006 — 7:56pm",
      "content": "Still thinking… maybe a simpler one is better…\n\n ![](http://web.archive.org/web/20131023033943im_/http:/typophile.com/files/CFF-logo-circle-square_3662.jpg)\n\n"
    },
    {
      "time": "4 Sep 2006 — 11:18am",
      "content": "or even more simple…\n\n ![](http://web.archive.org/web/20131023033943im_/http:/typophile.com/files/CFF-logo-circle-square_3922.jpg)\n\n"
    },
    {
      "time": "4 Sep 2006 — 11:20am",
      "content": "The word spacing is large enough to drive a truck through it. ;^) Especially in comparison to the linespacing. That typeface also seems a little too light compared to the boldness of the head and the mark.\n\n"
    },
    {
      "time": "4 Sep 2006 — 7:52pm",
      "content": "I don't see the relevance of the circular form within the square. A cornerstone would be square or angular - maybe a square within a square. You might try something sort of 3D - like a 3/4 or corner view of a cube. But, this sounds like a contemporary church that would want to appear anything but square. It seems most churches today market like hospitals, housing developments, or shopping centers.\n\n"
    },
    {
      "time": "5 Sep 2006 — 2:36am",
      "content": "I would avoid any direct reference to an actual cornerstone, however I think that the mark you have may be read as a single person in a large space, not really a fellowship.  \nAs Tiffany says your second line is too light and airy and will lose out at smaller sizes.  \nIf I am working on an identity for a company/body that has a fairly common name I like to check to see what else has been done, not for inspiration more as a guide of what to avoid\n\n[http://images.google.com/images?client=safari&rls=en&q=cornerstone%20log...](http://web.archive.org/web/20131023033943/http:/images.google.com/images?client=safari&rls=en&q=cornerstone%20logo&ie=UTF-8&oe=UTF-8&sa=N&tab=wi \"http://images.google.com/images?client=safari&rls=en&q=cornerstone%20logo&ie=UTF-8&oe=UTF-8&sa=N&tab=wi\")\n\nTim\n\n"
    },
    {
      "time": "5 Sep 2006 — 2:55am",
      "content": "It's hard to comment without knowing more about the brief as stated above. The spacing so far has been a bit off, especially letter spacing lowercase!!\n\nI think the leaf idea works the best so far with a better font. Just letterset the fonts you want and if you clients approve them then have them pay for the font so you can actually use nice professional fonts.\n\nI think you need more ideas to go from, and a stronger idea of what exactly you need for this logo. Or if you have these already post them up here so we might get some ideas to help you out.\n\n"
    },
    {
      "time": "5 Sep 2006 — 6:43am",
      "content": "I think the corporate-looking sans is wrong for a religous community. People want warmth and emotional support out of a religous community, not neutrality.\n\nAlso I don't see the point in avoiding the Cross. I'm not a Christian, but if I were I think I'd see the Cross as very positive, particularly if I were looking for a church to join. To me the logical solution includes a cross and a more human font, like one of Goudy's. [Here's](http://web.archive.org/web/20131023033943/http:/www.lcms.org/) an example of the feeling I am talking about. Ok, that example has a bit too much swooshiness, but you get the idea. \"The obvious is better than the obvious avoidance of the obvious\". If you can be innovative as well, fine, but something more conventional that works is good too.\n\nAlso, speaking of Goudy, he said 'Anyone who would letter space lower case would steal sheep.' And Erik Spiekermann wrote a whole book \"Stop Stealing Sheep.\" There are better solutions.\n\n"
    },
    {
      "time": "6 Sep 2006 — 11:03am",
      "content": "\\> can someone tell me why chruches need logos?\n\nWhy does any organization need a logo? To build/strengthen an image, to be recognized quickly, to be identifiable.\n\nThe fact that the group is not (or should not be) profit making really doesn't enter into the equation.\n\n"
    },
    {
      "time": "6 Sep 2006 — 1:34pm",
      "content": "<cite> can someone tell me why chruches need logos?</cite>\n\nProbably so they have something to put on the sign and their letterhead. Kudos to them for paying for something that matches and looks good rather than something haphazard and impromptu.\n\nI'm guessing that this church is Christian (with \"cornerstone\" and all), and if so, I like the image of the leaves in the first example (\"I am the vine, you are the branches...\"). But, I agree with the others that you need type that is warmer, more inviting, and far less corporate. For this reason, I like the way you set \"Cornerstone\" in the third example. Lowercase just seems more friendly (but, please not _all_ lowercase a la at&t).\n\n"
    },
    {
      "time": "8 Sep 2006 — 1:07pm",
      "content": "I don't see the need to justify the type. Why not let the type rag. It would imply flexibility rather than rigid (thinking, faith). Take a look at Caps and lowercase or Caps and Smallcaps. I like the organic leaves look, its friendly, unlike a rock (cornerstone). Try for a friendly inviting look, not a corporate product oriented look.\n\n"
    },
    {
      "time": "10 Sep 2006 — 9:21am",
      "content": "Careful consideration needs to be done when selecting the typeface. Look for something that would be appropriate if it actually were inscribed on a cornerstone (avoiding cliches like Trajan).\n\nThe circle in the square, while graphic and easily reproduced at smaller scales, is so generic that if I saw it without the accompanying text, I would never think \"Cornerstone Faith Fellowship.\"\n\nI think something might be explored with a typographic based symbol. Here is a concept I came up with for the church I attended. Keep in mind it's still rough--that sans serif F is killing me now--but you get the gist.\n\n ![](http://web.archive.org/web/20131023033943im_/http:/typophile.com/files/lcf_4313.jpg)\n\n"
    },
    {
      "time": "10 Sep 2006 — 4:44pm",
      "content": "I love the one with the \"stone\" in the corner! Maybe change the colors a little bit though? I think this one makes the most sense and looks the most \"church-esque\", if you will.\n\n-- David\n\n"
    },
    {
      "time": "16 Sep 2006 — 1:25pm",
      "content": "Sorry to hijack the thread, but David (adnix), I'd suggest removing the 'c's from your logo. The \"Christian\" part is already implied by the cross, and it would probably look a little cleaner and more subtle with just the 'L's and 'F's.\n\n- Lex\n\n"
    },
    {
      "time": "17 Sep 2006 — 8:39am",
      "content": "Lex, that concept is around a year old and never got past the initial stage. I hadn't even looked at it for months. I would probably take a different approach today. I think I tried one without the Cs but felt that without them, people wouldn't get that there is an L and F--just a funny cross with things sticking out. Anyway, it's a closed project.\n\n"
    }
  ]
}
