{
  "id": "28017",
  "title": "Does HDMX table have new functions?",
  "forum": "Build",
  "tags": [

  ],
  "content": "I’ve heard somewhere that HDMX table in TTF fonts has some new functions (besides containing records about non linear glyphs widths). Does it mean that even if hinting didn’t touch any sidebearings (e.g. cleartype hinting), it is recommended that font should include HDMX table?\n\nSo if hinting moves some of the right sidebearings ( e.g. in B/W hinting) and I will not generate HDMX table, this font will not work correctly? Or is it that, the font WILL work correctly ( concerning spacing ) but will be slower, because it will need to recalculate all moved sidebearings?\n\nThanks for your time, peter\n\n [‹ Best font management software](http://web.archive.org/web/20071112200936/http:/typophile.com/node/28083 \"Go to previous forum topic\") [Lucida Sans working strangely in OS X ›](http://web.archive.org/web/20071112200936/http:/typophile.com/node/28050 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071112200936/http://typophile.com/user/3279\" title=\"View user profile.\">peter bilak</a>",
  "time": "<br>",
  "uid": "3279",
  "comments": [
    {
      "time": " 4.Sep.2006 7.30am",
      "content": "hi Peter, we are not aware of any changes, do you recall where you may have heard this?\n\nmike\n\n"
    },
    {
      "time": " 8.Sep.2006 7.53am",
      "content": "Mike, it was an informal chat with people who work professionally with hinting, and they said that they ALWAYS use HDMX table, even when they do not modify the sidebearing, because it has some other functions. Sorry i don’t know anything more, I’ve searched for it, found nothing, and that’s why I am asking here. But if you say that you don’t know about any changes, or reasons to use it when the sidebearings are not modified, that would also answer my question.\n\nPeter  \n [http://www.typotheque.com](http://web.archive.org/web/20071112200936/http:/www.typotheque.com/ \"http://www.typotheque.com\")\n\n"
    }
  ]
}
