{
  "id": "28020",
  "title": "For Like Ever on Domino's cover",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Not trying to clutter the forums with type sightings, but I couldn't pass this one up. The cover of [Domino Magazine](http://web.archive.org/web/20131020233317/http:/www.dominomag.com/) features the apartment of a shoe designer, and check out what's right over her fireplace and essentially front and center on the mag's cover: a Village Type 'For Like Ever' poster. All you TypeCon '05 attendees are now even hipper...or something.\n\n ![](http://web.archive.org/web/20131020233317im_/http:/typophile.com/files/domino_village_3565.jpg)\n\nAh, I see that [Village has taken notice, as well](http://web.archive.org/web/20131020233317/http:/www.vllg.com/products/Village/Villageposter_limited/).\n\n",
  "author": "Chris Rugen",
  "time": "3 Sep 2006 — 11:52am",
  "uid": "2172",
  "comments": [
    {
      "time": "3 Sep 2006 — 12:35pm",
      "content": "Woah, kickin'! Nice find, Chris, thanks for sharing this. :^)\n\n"
    },
    {
      "time": "3 Sep 2006 — 1:23pm",
      "content": "we village members got this email yesterday from t & c:\n\n_Well friends, we find ourselves on the receiving end of a great deal of attention thanks to “Domino” magazine. [http://www.dominomag.com/](http://web.archive.org/web/20131020233317/http:/www.dominomag.com/ \"http://www.dominomag.com/\")_\n\nFor those unfamiliar with Domino, it is a homewares magazine which is quite popular, and has a large and devoted readership. In the September issue of the magazine our launch poster was shown in the apartment of rising star fashion designer Jessie Randall.\n\nAs a result of this appearance there has been a veritable flood of orders for the poster. We had to go back on-press twice with the “For Like Ever” graphic in order to satisfy the demand. (While we were at it, we decided to go for super-high production values, and had the poster silkscreened on heavy archival stock.)\n\nSo, the month of August was pretty much 90% poster-rolling and mailing tube stuffing, taping, and labeling. We got a postage meter and filled our little apartment with big boxes of mailing tubes.\n\nWe thought that you’d be amused and/or interested. And some of you might have wondered why we’ve been so quiet lately. It was because we were up to our eyeballs with posters and mailing tubes.\n\nWith best wishes for a great autumn from us,  \nTracy & chester\n\n"
    },
    {
      "time": "3 Sep 2006 — 1:58pm",
      "content": "This is wonderful PR for Village. Good for them. Kudos.\n\nI must say, however, that it strikes me as an odd selling-point to print a poster on archival paper with fugitive fluorescent ink. But, what the heck . . .\n\n-- K.\n\n"
    },
    {
      "time": "4 Sep 2006 — 1:01am",
      "content": "Entropy, Kent. Everything goes to hell in the end, one way or another. ;^)\n\n"
    }
  ]
}
