{
  "id": "28028",
  "title": "Jensen",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hola!\n\nIm looking for a font called Jensen. It’s similar to DIN Schrift. I’ve been looking everywhere to buy it, but i just can’t find it (am I really such a n00b??)\n\nAny1 know where to find it?\n\nCheers\n\n/10W\n\n [‹ Looking for the best Sans Serif EVER](http://web.archive.org/web/20081123031525/http:/typophile.com/node/27823 \"Go to previous forum topic\") [Cyrillic script glyphs ›](http://web.archive.org/web/20081123031525/http:/typophile.com/node/27960 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081123031525/http://typophile.com/user/14475\" title=\"View user profile.\">Tenwatts</a>",
  "time": "<br>",
  "uid": "14475",
  "comments": [
    {
      "time": " 4.Sep.2006 6.13am",
      "content": "The Jensens I know aren’t at all similar to DIN. There’s a Jensen Oldstyle and a Jensen Arabique (not at all similar).\n\nAre you sure that’s the name? There a lot of confusingly similarly named fonts - Janson, Jenson, Johnson etc...\n\n"
    },
    {
      "time": " 4.Sep.2006 11.14pm",
      "content": "I know Jensen Oldst and Arabique are way far from what i looking for:) Thos are the only ones coming up when i try to find it.\n\nWell, I cant really be totally sure the name is correct. But I read an article in a design magazine on how they remade a newspaper. In this they replaced the former DIN with “Jensen”. Ofc they can have made a typo there. So I might be looking for a Jensen-similarly named font that looks like DIN maybe:)\n\n/10W\n\n"
    },
    {
      "time": " 5.Sep.2006 5.51am",
      "content": "could it possibly have been johnston?\n\n"
    },
    {
      "time": " 5.Sep.2006 6.48am",
      "content": "If they replaced Din with Jensen would it necessarily have been similar or a replacement?  \nTim\n\n"
    },
    {
      "time": " 5.Sep.2006 7.18am",
      "content": "Bookplus: I checked Johnston, but it’s not that one:(\n\ntimd: I saw a picture of the replaced page head in the article. The head was written all in caps, and it was very similar to DIN mittelschrift. But it seemed like the “S” was a little more like Akzidens Grotesque.\n\n/10W\n\n"
    }
  ]
}
