{
  "id": "28023",
  "title": "In the beginning",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "G’day type people,\n\nLike many before me, I want to design my first font and I would like to know where to start. I tend to learn well from books but I know there are a lot of books with a lot of type theory/history in them and not a lot of practical direction. It’s the latter that I want at this stage having ingested already enough former for the moment.\n\nI have two titles in mind: ’designing type’ and ’Letter letter’ from typophile’s forum history, these seem to be the most discussed, I am curious to know which you think would be better, or if you have any better options. I realize the best-case scenario is for me to become an expert in hand-drawing all of the typefaces from typographic history in pen and ink and completing a four-year apprentiship in sign-writing, but surely there must be a middle-way.\n\nthanks for your time and I understand if you might baulk at the prospect of answering an oft-asked question\n\nNick\n\n [‹ Autopsy, multi-faceted](http://web.archive.org/web/20071106163312/http:/www.typophile.com/node/28009 \"Go to previous forum topic\") [Site of Deepdene ›](http://web.archive.org/web/20071106163312/http:/www.typophile.com/node/28038 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071106163312/http://www.typophile.com/user/9500\" title=\"View user profile.\">nicholasgross</a>",
  "time": "<br>",
  "uid": "9500",
  "comments": [
    {
      "time": " 3.Sep.2006 8.05pm",
      "content": "The [Logo Font and Lettering Bible](http://web.archive.org/web/20071106163312/http:/www.logofontandlettering.com/) by Leslie Cabarga has great practical stuff on how to design fonts and also on hand lettering. I highly recommend it. The [Triumvirate](http://web.archive.org/web/20071106163312/http:/typophile.com/wiki/Triumvirate) is frequently recommended on these forums. Of those, I’ve read The Elements of Typographic Style. It is a good reference guide, with much practical information on font design and typography.  \nI have not read Designing Type nor Letter letter. The forum threads and [this review](http://web.archive.org/web/20071106163312/http:/www.typotheque.com/articles/designing_type_/) have led me to believe that Designing Type doesn’t have much on actual _type design_ though.\n\nEron\n\n"
    },
    {
      "time": " 3.Sep.2006 8.45pm",
      "content": "I wouldn’t start with Letterletter if I were you.\n\n—K\n\n"
    },
    {
      "time": " 3.Sep.2006 8.52pm",
      "content": "I have a copy of Letterletter. It’s big on theory, abstract argument and formation of letterform via handwritten strokes, but if you want practical advice on making digital fonts, then Leslie Carbarga’s work is pretty much it. He put out a companion book to the LFLB called Learn Fontlab Fast. They’re both at [www.flashfonts.com](http://web.archive.org/web/20071106163312/http:/www.flashfonts.com/ \"www.flashfonts.com\"), but IMHO the LFLB is the better book and probably exactly what you’re asking for.\n\nCarbarga favours Illustrator as a drawing program, but all of the material he covers is equally applicable to FreeHand, if that’s what you prefer.\n\nHaving got the Karen Cheng book out of the library, I have to agree with what Eron says above, and the conclusion that Peter Bilak makes in his review. It’s a book about comparisons rather than any particular process.\n\nIn my own stumbling attempts to find out more I would say the advice Lucas de Groot has about interpolation of weights at [http://www.lucasfonts.com/index\\_neu.html](http://web.archive.org/web/20071106163312/http:/www.lucasfonts.com/index_neu.html \"http://www.lucasfonts.com/index\\_neu.html\") is good value, as is the process documented at [www.typeworkshop.com](http://web.archive.org/web/20071106163312/http:/www.typeworkshop.com/ \"www.typeworkshop.com\") by the lovely people at underware.\n\n"
    },
    {
      "time": " 3.Sep.2006 9.26pm",
      "content": "This is a difficult question. I don’t think there really is a book about designing type, despite a number that make that claim. There are lots of books about looking at type, of which Karen Cheng’s is a good example, and some very good books about the history of type (which were my references when I started out), but I don’t think there are any books that really describe a process. I rather hope Gerry Leonidas and his colleagues teaching in the MA programme at Reading will write one eventually, based on the experience of running that programme, having been able to test theory and praxis over a number of years and with a good number of graduates working on varied projects.\n\nIn the meantime, I think Michael Harvey’s _[Creative Lettering Today](http://web.archive.org/web/20071106163312/http:/www.amazon.ca/Creative-Lettering-Today-Michael-Harvey/dp/1558214534/sr=8-1/qid=1157342999)_ is one of the better introductory books, and a good companions to Leslie Cabarga’s _Logo Font and Lettering Bible._\n\nAlthough Hrant will probably come and beat me up again, I’m going to recommend Gerritt Noordzij’s _[The Stroke](http://web.archive.org/web/20071106163312/http:/www.amazon.com/Stroke-Theory-Writing-Gerrit-Noordzij/dp/0907259308)._ But let me be very clear that I don’t think one should take Noordzij’s work as a prescription for creating typefaces based on calligraphic or other written forms. What I like about _The Stroke_ and parts of _Letterletter_ is that they encourage one to think about the elemental construction of letterforms, from the inside-out. This is not sufficient in itself to designing a good typeface, because one also needs to understand letterforms from the outside-in, i.e. from reading, but I simply don’t know any other works that are as thought-provoking. These are not manuals on how to design a typeface: they are jumper cables to get you thinking about letterform construction. Even if you even up disagreeing with everything Noordzij writes, the books will have done their job.\n\n"
    },
    {
      "time": " 4.Sep.2006 8.32am",
      "content": "_encourage one to think about the elemental construction of letterforms, from the inside-out._\n\nThe Modification of Letterforms by Stanley Hess\n\n"
    },
    {
      "time": " 4.Sep.2006 8.51pm",
      "content": "Wow, thanks so much everyone for your generous advice. The consensus seems to be the slightly unhinged logo/font/lettering bible with glowing reviews on typophile and everywhere I looked on the web.\n\nIf there is anyone in Australia who would like to sell me a copy, it would sure be cheaper then shipping it from the states or the UK\n\nNick, thanks for your alternative suggestion, what has the Hess’ book got going for it over Carbunga’s?\n\nthanks again\n\n"
    },
    {
      "time": " 4.Sep.2006 9.41pm",
      "content": "Wow, something else Hrant and I agree on.\n\nThe Hess book is wonderfully useful in helping you understand how letterforms work with different weights and widths (and secondarily with different styles). I haven’t looked at it in many years, but if I had ever tried to do a big family early on in my typographic education, it would have been invaluable.\n\nThat being said, if you’re going to start with just one book, Cabarga’s may be more broadly useful, though it doesn’t instill the same discipline of thinking about things.\n\nT\n\n"
    },
    {
      "time": " 4.Sep.2006 10.34pm",
      "content": "_what has the Hess’ book got going for it over Carbunga’s?_\n\nI think Thomas can speak for both Hrant and myself on this.\n\n"
    }
  ]
}
