{
  "id": "28036",
  "title": "Call it what it is!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "In a world where titles are freely given to others and, in most part, to ourselves. I thought it necessary to clarify a few thing as far as titles in typography are concerned. Now I’m starting to market myself as a [graphic designer](http://web.archive.org/wiki/graphic%20designer) who emphasizes in typography. But I have not gone as far as calling myself a [typographer](http://web.archive.org/wiki/typographer) for 2 reasons; 1) don’t really know the exact definition of a typographer and 2) Mathew Carter I consider a typographer and I’m nowhere near his level. But, isn’t a typographer someone who practices good typography in all sense not just type design? I don’t consider myself a [type designer](http://web.archive.org/wiki/type%20designer), I’ve never designed a typeface. But I have, however, done custom lettering. So what does that make me? A [lettering artist](http://web.archive.org/wiki/lettering%20artist)? I only ask because I’m designing a self-promotion mailer and I want to be clear on the meaning of the services I offer. Plus I’m hoping this topic might help clarify things a bit. I grow weary of meeting those who call themselves typographers or type designers just because they attended one type course in college.  \nWhat are your thoughts?\n\nIvan\n\n",
  "author": "<a href=\"user/9114\" title=\"View user profile.\">Mister M</a>",
  "time": "<br>",
  "uid": "9114",
  "comments": [
    {
      "time": " 4 September, 2006 - 1:02pm",
      "content": "Deeds not Words?!\n\n"
    },
    {
      "time": " 4 September, 2006 - 1:04pm",
      "content": "Huh?\n\n"
    },
    {
      "time": " 4 September, 2006 - 3:15pm",
      "content": "Typographer: User of type, preferably well-trained. Many excellent typographers never design any typefaces. A graphic designer can also be a typographer, but many graphic designers have no training, interest or instinct for typography, and so should not call themselves typographers.\n\nType Designer: Designer of typefaces, preferably with some typographic training. Sadly, many type designers don’t use type.\n\n"
    },
    {
      "time": " 4 September, 2006 - 4:28pm",
      "content": "Hmmmm, clear and well said. Thank you very much.\n\n"
    },
    {
      "time": " 4 September, 2006 - 5:43pm",
      "content": "I recently received a copy of a small pamphlet from Robert Bringhurst entitled _The typographic mind,_ published by Gaspereau Press as one of their occasional series ‘The Devil’s Whim’. It is a good little essay, with something to say about the distinction between graphic designer and typographer, or, at least, something useful to say about how a distinction could be made.\n\nIn purely practical terms, a typographer is someone who uses type, and this may involve using type in the context of graphic design and, as endlessly and tediously demonstrated in so-called typography annuals, it can involve using type as a graphic element, i.e. type as something other than a conveyance for text.\n\nBut I’m inclined to agree with Robert that typography, properly understood, has to be related to text, to language, and that this provides the distinction between typography and graphic design:\n\n_‘Graphic design deals with things that only exist in visual form. Typography deals with things that are only incidentally visible. Language is spoken before it is written. It is written in order to be read, but it is read only in order to be tasted and digested in the mind. There is nothing to see at either end of the process—nothing, that is, except the real, which is why language is worthwhile.’_\n\nIn 2003, I gave the title ‘Between text and reader’ to the theme of the ATypI conference held in Vancouver that year, and I invited Robert to be the keynote speaker. I don’t know if the term typographer can be exclusively applied — i.e. rejecting the generic usage of ‘someone who uses type’ — but certainly the most interesting typographers I know are people who share a commitment to text and to language. They are, to use Dean Allen’s memorable moniker, Textists.\n\n"
    },
    {
      "time": " 5 September, 2006 - 12:31am",
      "content": "Please Tick (/) or (x) opposite these statements:\n\n1 Not every Graphic designer is a Typographer.  \n2 Not every Typographer is a GraphicDesigner.\n\n3 Not every GraphicDesigner is a TypeDesigner.  \n4 Not every TypeDesigner is a GraphicDesigner.\n\n5 Not every Typographer is a TypeDesigner.  \n6 Every TypeDesigner was a Typographer.\n\n7 Whos is the Typophiler?!  \nA do-more-with-less GraphicDesigner, typeDesigner, & Typographer?!\n\n"
    },
    {
      "time": " 5 September, 2006 - 4:01am",
      "content": "\\>But, isn’t a typographer someone who practices good typography in all sense not just type design?\n\nI think you nailed it there, type design is a separate but overlapping discipline, Aziz’ checklist would give an information designer a tricky problem. Computers have blurred the distinctions so much that it is almost possible to tick or cross every box, for me though, being a typographer means being able to appreciate at least some of the nuances of type design, while being more conversant with graphic design (which itself covers a wide spectrum of disciplines). Deeds not words – ultimately the proof of one’s title is in one’s work.\n\nTim\n\n"
    },
    {
      "time": " 5 September, 2006 - 6:13am",
      "content": "I like to use the term typographer in Carl Crossgrove’s and John Hudson’s sense. And I also feel that a good typographer knows how to make adjustments to fonts (Bringhurst, in chap. 10 of Elements, speaks of “tuning” the fonts).\n\nMy problem is that I’m trying to find a job as a book typographer (book designer?), but at least here in Finland, where editions are small, publishing houses seem to expect you to be an all-around graphic designer (whose primary job is cover/jacket design).\n\nThere was a thread on the Graphic Designer vs Typographer issue about a year ago ( [http://typophile.com/node/15197?from=50&comments\\_per\\_page=50](http://web.archive.org/web/20061116091040/http:/typophile.com/node/15197?from=50&comments_per_page=50)), where Miss Tiffany said that “someone, usually, cannot only be a typographer”. But maybe I could be a typographer, book designer and typesetter? (Thanks to my education as a linguist, albeit primarily a phonetician, I could perhaps be a little bit of editor as well.) Is this still too narrow?\n\nIn other words, is it viable to concentrate on the design and typesetting of the book block (and perhaps hope to have a say on the choice of format and on the case design)—to do everything except cover/jacket design and image scanning/manipulation/color correction and illustration?\n\nUnless I’m considered too nosy to ask about this, I’d be interested in knowing what combination of things you guys actually do—or plan to do—for a living (if it’s type-related).\n\nPardon the long post (and my inability to do HTML)!\n\nOlli\n\n"
    },
    {
      "time": " 5 September, 2006 - 6:40am",
      "content": "Once upon a time a typographer was more akin to a type setter but elevated to more of a quality craftsman who had very good visual sensitivity as well. The type setter as profession is now gone in this postscript world and the typographer may need some more graphic design skills to find enough work in some places (perhaps Finland?). I started work as a graphic designer in the 1960s but also worked briefly as a type setter. I also studied caligraphy in design school. I always had a great interest in typography and used quite a bit of type in my graphc design work over the last 45 years. In the past 2 years I have begun to design typefaces. I don’t know what my “title” is anymore and I don’t know how much that matters. I think you need to get a portfolio together of your work and show it to potential employers. They will hire you or not based on what they see, not on what title you assign to yourself.\n\nChrisL\n\n"
    },
    {
      "time": " 5 September, 2006 - 6:41am",
      "content": "\\> Mathew Carter I consider a typographer and I’m nowhere near his level\n\nYes, but that doesn’t mean you might not be a typographer. Labels would be pointless if you can only use them for the experts of each field. You cannot call yourself a “world class typographer” if you are not as good as Carter, but if you have the basics of the art down you can call yourself a “typographer”.\n\n(Said the guy who is using typewriter quote marks.)\n\nOh cool, the forum software fixes the quotes for me. They are only typewriter on the input screen.\n\n"
    },
    {
      "time": " 5 September, 2006 - 6:55am",
      "content": "Thanks, Chris, for sharing your story! I do realize the need to have a portfolio, and I have scraped together something. (I might post some of it here later.)\n\nAnd Don, I definitely claim, for now, to be a typographer only in the “basic” sense.\n\nOlli\n\n"
    },
    {
      "time": " 5 September, 2006 - 7:49am",
      "content": "Chris, I should’ve added that I had the impression that there still were typesetting firms in the US and UK. For one thing, the writers (book designers) in Richard Hendel’s On Book Design ( [http://www.amazon.com/On-Book-Design-Richard-Hendel/dp/0300075707/sr=8-1/qid=1157467495/ref=pd\\_bbs\\_1/002-8344409-3206412?ie=UTF8&s=books](http://web.archive.org/web/20061116091040/http:/www.amazon.com/On-Book-Design-Richard-Hendel/dp/0300075707/sr=8-1/qid=1157467495/ref=pd_bbs_1/002-8344409-3206412?ie=UTF8&s=books)) speak of good and bad typesetters all the time.\n\nDoes this book, published in 1998, actually reflect past practice?\n\nEDIT: Not that I myself would want the books I design to be set by someone else.\n\nOlli\n\n"
    },
    {
      "time": " 5 September, 2006 - 8:18am",
      "content": "Olli,  \nThere are places that set type but not like it used to be. If you are lucky, you can find some well skilled people who actually trained in the craft and know what they are doing. If you are not lucky, you will find people who are not much more than typists who have learned a software program. Knowing the tools is only part of the job. Having done design and paste-up the old way, I am very good at using a knife. If you need brain surgery though, you had better find someone with far more than knife skills so don’t hire me to cut you open :-)\n\nChrisL\n\n"
    },
    {
      "time": " 5 September, 2006 - 8:19am",
      "content": "\\>EDIT: Not that I myself would want the books I design to be set by someone else\n\nThat, depending on in the company you work at is something that might happen, as Chris notes before the onset of computers on every desktop that is the way a typographer worked he would do a specification and mark-up to send to a typesetter and then to proof the galleys in conjunction with author and editor. There are fewer typesetting firms although they still exist and the trend seems, in the UK, to be for in-house operations and often for the designer to be typesetter, image creator and manipulator, client and photographer and illustrator contact and jack-of-all-trades although others will have a separation between concept and artwork. There is also a separation between cover design and interior design although this can also be unified, it really depends on the working practices of the company.  \nTim\n\n"
    },
    {
      "time": " 5 September, 2006 - 8:43am",
      "content": "Changing the font size on your web browser is typography, ennit?  \nAnd so is formatting the text to your _Typophile_ posts.\n\nIf desktop publishing elided the distinction between typesetter and typographer, user-generated content takes things a step further.\n\n"
    },
    {
      "time": " 5 September, 2006 - 9:00am",
      "content": "I am old-fashioned, I guess, being primarily interested in ink on paper.\n\nOlli\n\n"
    },
    {
      "time": " 5 September, 2006 - 9:20am",
      "content": "I think you nailed it in your first sentence: a graphic designer who emphasizes in typography\n\nOr at least, if that’s how you want to direct your career, that sounds like a good description. I use type (I think) with knowledge, care, and attention to detail, but would not refer to myself as a typographer because I don’t want to pigeonhole myself.\n\nTo me typography (as distinct from type design) implies a real emphasis or specialty on type over other elements of design.\n\nIf handlettering is one of your specialties you could include that both on your cv and as a highlight on your website/tear sheet.\n\n"
    },
    {
      "time": " 5 September, 2006 - 10:07am",
      "content": "_but would not refer to myself as a typographer because I don’t want to pigeonhole myself._\n\nGood point.  \nIt should be understood that graphic designers are, _de facto,_ typographers.\n\n"
    },
    {
      "time": " 5 September, 2006 - 10:28am",
      "content": "Or at least they should be… although it’s amazing how lazy some of them are when it comes to typesetting (which is of course different from typography - or is it?)\n\n"
    },
    {
      "time": " 5 September, 2006 - 10:52am",
      "content": "To me typesetting is formatting and fitting text to specifications from the client. Typography is more qualitative. It takes typesetting beyond the level of being a stockboy in a supermarket who sees to it that all the Peas and Quinces are kept stocked into their proper place. The typographer is also concerned with the quality of the experience of the perceiver and the effortless flow of communication—the art and the craft of it.\n\nChrisL\n\n"
    },
    {
      "time": " 5 September, 2006 - 12:26pm",
      "content": "Typesetting is more than formatting and fitting, a good typesetter will also take appearances into account - in terms of kerning, ragging, H&Js, etc. It’s a form of design too.\n\n"
    },
    {
      "time": " 5 September, 2006 - 12:59pm",
      "content": "I wish I had a good or clever answer for this.  \nFrankly, I think “typographer” has become an archaic term referring to one who is much more than just a practioner of typography.\n\nOnce, being a “typographer” was an actual profession, though one _without accreditation or degree_, such as architects or chefs are.\n\nToday, it’s much the same way someone might consider themself a “photographer” as it has become somewhat _easier_ to produce photographic imagery consistently with greater fidelity using relatively inexpensive photographic equipment. Technology has helped to achieve the “craft” aspects that otherwise would have required training and experience on the operators part.\n\n"
    },
    {
      "time": " 5 September, 2006 - 2:17pm",
      "content": "Interesting discussion.\n\nI think ‘typographer’ can be used much the same way that ‘photographer’ is used. The degree of skill any person has in either field is not implied, and can be qualified by modifying words. Thus, a person can be described as being a ‘great photographer’, a ‘good photographer’, or a ‘crappy photographer’. Therefore, I think one can rightly say, _“I am a typographer, though not in the league of Mathew Carter”._ And then genuflect. :-)\n\nLike Chris, I also started my career in the heady days of hot wax and traditional paste-up. That included a goodly number of years working as a typesetter. I would say a ‘typesetter’ was only responsible for keyboarding (and for operating the machine). Once the galleys of type were processed and could be viewed, the art of the thing commenced: proofreading, kerning, H&Js, etc., as Patty suggests. These operations were considered separate from typesetting. Until the advent of the desktop computer, we didn’t have WYSIWIG monitors.\n\nNow, with the machine on everyone’s desk, the lines of delineation are blurred. I can be a typesetter and a typographer and a designer. (I can even be a photographer!)\n\n"
    },
    {
      "time": " 5 September, 2006 - 2:20pm",
      "content": "Sorry Norbert. I took soooooooo long typing out my missive, I missed your post. Didn’t mean to re-state everything you said.\n\nCheers, Ken\n\n"
    },
    {
      "time": " 5 September, 2006 - 6:52pm",
      "content": "Wow, what a great response to the post.\n\n_would not refer to myself as a typographer because I don’t want to pigeonhole myself_.\n\nMy thoughts exactly pattyfab. Especially because I believe no one will just hire a typographer in adittion to a graphic designer. But it helps me in describing the services I offer. For example, If I where marketing myself to a publisher I would describe myself as a graphic designer who emphazises in typography. But if I where marketing myself to a signage manufacturer or a full service architectual firm, then I would belive it would be beneficial to describe myself as a typographer as I feel that typography and the way information is displayed is more important, in my opinion, than the design.\n\nOne example, I recently met this woman who heads up the wayfinding committee in a hospital. Her job is not to design the signage, but to insure consistancy is maintained. The design is being handled by an interior designer who , in my opinion, knows very little about typography. Her typesetting is too tight, signs are filled with superflous info and she seems to be under the impression that if people can’t navigate to where they want to go it’s because their aren’t enough signs, so she adds more. I swear some of these hallways are starting to look like some of the streets in Beijing:) On top of that, she’s not a very nice person. Anyway, I’ve been giving feedback and I feel that because I have described myself as a typographer that feedback has had more credibility than someone who is perhaps ‘moonlighting’ as a signage designer.\n\n"
    },
    {
      "time": " 6 September, 2006 - 12:17am",
      "content": "Typophilers!  \nThe more I read, the more I get confused . But for one thing, a designer is a designer only and only if he/she is creative?!\n\n"
    },
    {
      "time": " 6 September, 2006 - 4:27am",
      "content": "The course I studied on was described as ‘Typographic Design’ which covered both typography and graphic design. Although I generally describe myself as a Graphic Designer (purely because most people haven’t got a clue what typography is) I have been known to describe myself as a ‘typographic designer’ which covers both bases nicely!\n\n"
    },
    {
      "time": " 6 September, 2006 - 7:04am",
      "content": "\\> a designer is a designer only and only if he/she is creative?!\n\nI’ll buy that remark only if you define creative. To me the best design is the simplest, most useful presentation of something. To many others “creative” means making something wierd, different, and often confusing.\n\n"
    },
    {
      "time": " 6 September, 2006 - 8:53am",
      "content": "Don’t we use our creativity to find the best solutions?\n\nI am a graphic designer with a fetish for typography. I like to think I’m a typographic designer, but sometimes that confuses people when they know I work at an ad agency. :^P\n\n"
    },
    {
      "time": " 6 September, 2006 - 9:22am",
      "content": "Yes, Tiffany and Don—I think the best kind of creativity is a means of arriving at the simplest and must useful design. Though I also like (dare I say this?) beauty, which to me means mostly harmony and integrity (of course, tension is also needed at times).\n\nOlli\n\n"
    },
    {
      "time": " 6 September, 2006 - 10:01am",
      "content": "“but sometimes that confuses people when they know I work at an ad agency. :^P”\n\nYears ago, when I worked at an ad agency, I found plenty of confused people. I just thought it was te nature of the beast :^P\n\nChrisL\n\n"
    },
    {
      "time": " 6 September, 2006 - 10:03am",
      "content": "Interesting discussion indeed, Ken!\n\nMister M: this discussion reminds me of a quote from Hideo Sasaki, a well-known architect in Boston. He says “Contribution is the only value.”\n\nHybrid fields of practice now exist in nearly every industry and boundaries are being blurred on a daily basis (and yes, sometimes gratuitously). We must try to let go of rigid distinctions between professional domains if we want to realize the potential of truly collaborative practice, where knowledge is allowed to compound interest throughout a group of creatives.\n\nI’m an architect by training, and believe me - I understand your pain with the interior designer story! Architects, being licensed, have very rigid ideas about professional boundaries, usually tied to some level of insurability against liability. But I have also found that professions without the barrier to entry of licensure tend to be touchier about protecting their domains…they feel they have to be since there is no legal protection.\n\nI’m going back to get a Masters in Graphic Design starting this Fall because I want to work in the environmental graphics arena but feel my formal graphic training needs to be bolstered to practice credibly. To me, it’s not about the degree or title or position, but rather about the knowledge. If you don’t feel you have it, get it, whatever it takes.\n\nIn the end, there is no way to **demand** respect. You can only **command** respect! The way you do that is by focusing on the work and bringing wisdom and insight to the table. Say things at those meetings and design things that are so well considered and smart that their truth seems self-evident. Make solutions that seem inevitable. That will simply trump ignorance and professional pride to the people that matter. Let the rest sort itself out…it will anyways with or without your input and worry and effort.\n\nIt’s amazing to me how much time people in corporate environments spend on learning how to “play the game” instead of focusing on the work and becoming the best they can at what they do. That’s where value is built. The better, smarter, more talented, and more experienced you are at something, the more you are needed…and the jobs will come to you.\n\nThere is also an interesting phenomenon in the professional world where you are never an “expert” at anything until you SAY you are! Nobody told Matthew Carter he was an “expert typographer”. He didn’t wake up one morning and realize, “oh, I’m an expert at typography now.” He just stayed focused on the work for so long and got so good at it, that his status became obvious over time: it worked itself out. If you really want to be a “typographer” and that’s where your passion is, then just say it dammit: call yourself a typographer. But then recognize that you have the terrifying task of dedicating your life to the pursuit of typographic knowledge and living up to it.\n\nEither have some fun with your title, or just make it so generic it’s meaningless (since it is anyway, really…) Like Miss Tiffany: NICE! So, the business card is “Type Fetishist”?…Love it!\n\nHow about just using “Designer”? Yes, it’s so broad as to be worthless, but maybe that’s exactly what you need to avoid being boxed in. There will inevitably be a follow-up question: “Well, what do you design?”, and that’s when you have the opportunity to list your interests and show the portfolio. It’s unrealistic to expect a reasonably short and printable phrase on a business card to convey all that.\n\nCheers All!\n\n"
    },
    {
      "time": " 6 September, 2006 - 11:23am",
      "content": "\\> I’ll buy that remark only if you define creative. To me the best design is the simplest, most useful presentation of something. To many others “creative” means making something wierd, different, and often confusing.\n\nMiss Tiffany , Creativity lies in simplicity (Beauty), easiness and functionality.\n\n"
    },
    {
      "time": " 6 September, 2006 - 11:31am",
      "content": "I’ve actually heard of type designers referred to as “Fontographers”. It makes any of the previously discussed distinctions seem fairly sophisticated.\n\n"
    },
    {
      "time": " 6 September, 2006 - 11:46am",
      "content": "Or another longer way to say it:  \n“The guy who just thinks of letters and then draws the outlines around them”\n\n:-)\n\nChrisL\n\n"
    },
    {
      "time": " 6 September, 2006 - 12:18pm",
      "content": "Ur. I didn’t say that. But, I do agree with you.\n\n"
    },
    {
      "time": " 6 September, 2006 - 3:49pm",
      "content": "Much typological constructivism occuring.  \nWhat about the type mechanics.It is easy to jam the pieces together to create a whole, while not observing the end result and future useage and useability of the construct. It’s the type professors who observe the long term aesethetics of each glyph and how they interact with others within the typeface. I must fall within the purleau of mechanic.\n\n"
    },
    {
      "time": " 6 September, 2006 - 5:02pm",
      "content": "So sayeth Google:\n\nA typographer is…\n\n- a specialist in the design of printed matter, and in particular the art of typography, the art and technique of selecting and arranging type styles, point sizes, line lengths, line leading, character spacing, and word spacing for typeset applications.\n- A person with knowledge of letter design, punch cutting, type-founding and printing processes, who designs printed material from moveable type.\n\nExcept for those few lovable Luddites who still practice the art of letterpress printing, the second definition is laughably quaint. As for the first definition, who is to say that one is a specialist? In the absence of formal accreditation, calling one’s self a typographer isn’t much different from calling one’s self a fashion plate, a oenophile or a guru: saying it’s so doesn’t make it so…unless someone else buys it.\n\n"
    }
  ]
}
