{
  "id": "2805",
  "title": "Severino",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "That my latest font. Any comments is welcome.   \n   \nThanks.\n\n<!--attachment: severino-24685.pdf*mime_pdf.gif*application/pdf*169.9*Severino*severino%2epdf --><!--attachment: severino-24685.pdf*mime_pdf.gif*application/pdf*169.9*Severino*severino%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012235324im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Severino<br><a href=\"http://web.archive.org/web/20131012235324/http:/www.typophile.com/forums/messages/29/severino-24685.pdf\" target=\"_blank\"><b>severino.pdf</b></a> (169.9 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "Ramiro Espinoza",
  "time": "22 Jan 2004 — 8:12am",
  "uid": "1137",
  "comments": [
    {
      "time": "22 Jan 2004 — 8:28am",
      "content": "i like this work...   \ni only see certain noise in the lc-g   \n   \n(y)   \nODA\n\n"
    },
    {
      "time": "22 Jan 2004 — 8:38am",
      "content": "It doesn't wok... Maybe a GIF...   \n   \n ![severinoGIF](http://web.archive.org/web/20131012235324im_/http:/www.typophile.com/forums/messages/29/24692.gif)\n\n"
    },
    {
      "time": "22 Jan 2004 — 9:23am",
      "content": "I like this alot. I am noticing that the weight of the strokes on your curved letters appear heavier than your straight strokes (uppercase G,Q). I agree that the \"g\" needs some tweaking also. The upper stroke on the lowercase \"r\" seems a little wimpy also. With some tweaking it will be nice!\n\n"
    },
    {
      "time": "22 Jan 2004 — 9:31am",
      "content": "Cool.   \nThis reminds me of a typeface used by David Carson in his 'Revised Edition'.   \nIIRC, it is called Neulin Sans, and it was designed by Miles Newlin.   \n   \nAnyway, I like the 'rawness' in this.   \nQuick comments:   \n- a: nice, did you try a smaller bowl?   \n- g: it may be disturbing at display sizes, but I think it'll work great at small sizes.   \n- r: too narrow;   \n- M, S: too wide;   \n- there are some weight inconsistencies... for example, C, G and S are too dark;   \n- the figures are 'technically' fine, but they don't fit the style.   \n   \nSaludos!\n\n"
    },
    {
      "time": "22 Jan 2004 — 9:40am",
      "content": "Nice!   \nSome apparent weight imbalances.   \nThe \"g\" doesn't work.   \nThe \"Q\" could be braver.   \nDescenders a bit long.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Jan 2004 — 8:58am",
      "content": "Nice one Ramiro   \n   \nP, R and B looks little narrow in the eye for me. J too.   \nMaybe E and F middle hoorizontal is a little optical down.   \nS middle is too bold.   \n   \nAle\n\n"
    },
    {
      "time": "27 Jan 2004 — 3:49am",
      "content": "Hi Ramiro, I like this font a lot. As usual it can always use a few changes here and there. I think S is a bit wide and also a bit heavy on the top. terminals are a bit too bulky for my taste. LC \"g\" is unusual and perhaps my favorite character. the new LC. \"g\" is much nicer than the older version on your website. ![type](http://web.archive.org/web/20131012235324im_/http:/www.typophile.com/forums/messages/29/24985.jpg)\n\n"
    },
    {
      "time": "27 Jan 2004 — 5:50am",
      "content": "Hi Ramiro.   \n   \nThis is really very nice. I would definitly use it.   \nHere are some comments in addition to what's been said.   \n   \nP vs R: Are the bowls the same size? The P should be slightly larger (north to south) than the R.   \n   \nr: Lower the join some for color, and add width as Eduardo suggests.   \n   \nE vs F: The middle bar looks to be at the same height. The F should be a bit lower (in this case, I'd raise the E a bit)   \n   \n3: I'd bring in the middle a bit (on the left side). It's hanging out a little far.   \n   \nTrapazoid Problems: As I've said in other posts, most of the letters should fit in a trapazoid that is wider at the base than the top. That way they look balanced and stable. There are several glyphs that have this trouble in your alphabet.   \nS: As Ole mentioned. I'd bring in the top left and top right.   \ns: Similar but to a lesser degree. Mostly on the top right.   \na: Bring the top left in a little bit.   \n   \nLooking forward to seeing more.   \n   \nRandy\n\n"
    },
    {
      "time": "27 Jan 2004 — 9:30am",
      "content": "Thanks a lot, guys. Your comments are really useful.   \n   \nI am working too in a extra bold version. And I made some changes in the 'g'.   \n   \n ![seve-black](http://web.archive.org/web/20131012235324im_/http:/www.typophile.com/forums/messages/29/25008.gif)\n\n"
    },
    {
      "time": "27 Jan 2004 — 10:58am",
      "content": "Hi Ramiro,   \n   \nThe extra bold looks nice!   \nI noticed 2 very small details:   \n   \n ![](http://web.archive.org/web/20131012235324im_/http:/www.typophile.com/forums/messages/29/25015.gif)   \nWith the **m** it is clear that you made it from an n because the final branch joins before the middle one has finished curving. I tried to illustrate how you could reconfigure the branches to eliminate this small problem.   \n   \nWith the **b** we get really detailed. This is another one of those pesky optical illusions. The stem appears to get thicker below where the bowl joins the stem. It is even more noticable in the extra bold version. To compensate, shave off a little bit.   \n   \nOh, also the extra bold **a** and **s** beak terminals look a little heavy. I would thin them so they look the same as the spurs on the **m, r, n** etc.   \n   \nCheers,   \nRandy\n\n"
    },
    {
      "time": "10 Feb 2004 — 3:55am",
      "content": "Well, I have been working in the corrections.   \nPlease, again, any comment is welcome.   \nThanks in advance.\n\n<!--attachment: severinoPDF-26180.pdf*mime_pdf.gif*application/pdf*183.9*sevePDF*severinoPDF%2epdf --><!--attachment: severinoPDF-26180.pdf*mime_pdf.gif*application/pdf*183.9*sevePDF*severinoPDF%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131012235324im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">sevePDF<br><a href=\"http://web.archive.org/web/20131012235324/http:/www.typophile.com/forums/messages/29/severinoPDF-26180.pdf\" target=\"_blank\"><b>severinoPDF.pdf</b></a> (183.9 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\n![seveGIF](http://web.archive.org/web/20131012235324im_/http:/www.typophile.com/forums/messages/29/26181.gif)\n\n"
    },
    {
      "time": "10 Feb 2004 — 5:37am",
      "content": "Quick comments: if this is intended to work at 9 pts, it should be wider. And the @ looks odd. Make it shorter (the @ should be shorter than the caps), and also make the inner 'a' one-storey.\n\n"
    },
    {
      "time": "10 Feb 2004 — 9:42am",
      "content": "Have you changed your vertical proportions? They were better before, especially for smallish setting (9 pt). And for small sizes, besides the narrowness being a problem it's also too light (although the spacing is nice and loose). I suggest shooting for 11-12 point instead (in which case you need to tighten it up though). But even so, I like the feel of this - really nice. We need a contemporary replacement for Caecilia.   \n   \nThe \"a\" is too bulky. The \"g\" is too mannered. It's almost like Formata's (which I like), so maybe just emulate that. But try a diagonal ear.   \n   \nThe \"J\" I'd either make descending, or give it more width. The \"M\" is a bit narrow. The \"L\" and \"T\" a bit wide. Yeah, the \"@\" needs work.   \n   \nI might try some serifs on some numerals.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Feb 2004 — 2:00am",
      "content": "Hrant, I didn't change the proportions, only the values of ascender and descenders in relation with the M square, so now the typeface looks a little bigger in the same size. That's all.   \n   \nYeah, the regular version is pretty light, but I'm gonna do interpolations, so I tought about future masters. I like to think the details in a light way... it's harder.   \n   \nThanks!\n\n"
    },
    {
      "time": "12 Feb 2004 — 10:43am",
      "content": "When I say \"vertical proportions\" I mean the _relative_ size of the three zones - so you have in effect changed the proportions. Specifically, I think your descenders are way too long now.   \n   \nhhp\n\n"
    }
  ]
}
