{
  "id": "28064",
  "title": "Come on people! RELAX",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I don't know what happened to a topic that was posted by Paul Petch aka 'iostmypassword'. But in it he was sharing a buiseness card he designed for his wife, I belived it was titled \"Buiseness Card\" or something. Anyway, when i posted a comment it said \"Page not found\" so perhaps the topic was removed. But I just want to repost my comment because i feel it's important that others hear what I have to say.\n\nNow I love Typophile, it has been a tremendous help to me as a designer and continues to be. I know others feel the same way. But lately I found this forum to be leaning toward harsh, petty criticism of people's work. Now I have always believed that criticism equals refinement, especially in our line of work, but we must not forget that this blog also serves to edify, to encourage to bolster our confidence. I mean come on people it's just a buiseness card and in my opinion a beautifully designed one at that. But all I can read is comment's like \"It looks like another card you designed before\", \"why do you need the letter 'e' before the email address\", \"the name Amy shows through on the other side\". In the end Mr Petch commented on how it's just a card and defended his work. BRAVO. But it was upsetting to me because lately I've been thinking twice about posting anything. I mean Mr. Petch obviously worked hard on the design and proofed it multiple times to insure that it was just right and all others can do is, in my opinion, be petty. Comments like that can really undermind a person's confidence and with time render them useless with selfdoubt. Oh and another thing, This kind of behavior also discourages others from posting great examples of their work, like Mr Petch's. When he posted the topic he clearly stated that he wanted to _share_ his work with us. He never asked us directly what we thought or how we could improve it. So please, let us not give answers to questions no one asked.\n\nI don't pretend to be this great designer who is better than everyone else. But I do believe their is truth in what I say. And we All (myself included) must be careful of not to fall into this trap.\n\nMr Petch, love your work. Please dont stop sharing it with us.\n\n",
  "author": "Mister M",
  "time": "5 Sep 2006 — 8:59pm",
  "uid": "9114",
  "comments": [
    {
      "time": "5 Sep 2006 — 9:39pm",
      "content": "Typophile is not a \"blog\". It is a \"forum\". cheerio\n\n"
    },
    {
      "time": "5 Sep 2006 — 9:50pm",
      "content": " **He never asked us directly what we thought or how we could improve it. So please, let us not give answers to questions no one asked.**\n\n\"Mr Petch, love your work.\"  \nDid Paul contact you asking for your opinion of his work?\n\nER - Mister M did not ask if Typophile was a blog or a forum, please don't answer questions no one asked.\n\n----------  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20150123231821/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "5 Sep 2006 — 9:51pm",
      "content": "I cannot find the thread either, or rather, I found the thread on Google, but the link is dead. Perhaps its author asked for it to be removed, and it was. I do not know.\n\nHowever, I would encourage anyone (and everyone) to post their work on Typophile… both for show AND for critique. We have several forums here on Typophile. In the critique section, posted work should be critiqued; that is why it is posted there in the first place, right? I have gotten great feedback over the years in that forum, and I recommend it to anyone.\n\nWork posted in General Discussions or in the Design forums (I don't know where the thread in question was posted), is not for outright critique per se. However—and this is only my personal opinion—I think that some critique of others' work should be allowed, if other posters find such helpful or necessary. Anytime anyone puts their work in the public forum, they should be open not only to constructive feedback, but negative feedback as well… I'm not saying that anyone's work should be trashed here… not at all! But, when you post your work to the public, you should keep in mind that not every one in the public is necessarily nice.\n\nAlso, the line between constructive criticism and negative feedback is subjective. Everyone has different degrees of personal sensitivity to these matters. As a poster posting on someone else's thread, it can be difficult to sense out someone's boundaries if you do not know them personally. Heck, it can be difficult sometimes even if you DO know them personally.\n\nI hope that this has not scared you off, Ivan. Please do post your work here on Typophile. Depending on the project and its level of completion, place your posts in the relevant section… put please don't go away… Typophile is a lovely place.\n\nP.S.: The best thing to do about negative posts is to ignore them.\n\n"
    },
    {
      "time": "5 Sep 2006 — 9:54pm",
      "content": "you're so much more eloquent than I Mr Reynolds.\n\n----------  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20150123231821/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "5 Sep 2006 — 9:55pm",
      "content": "Yeah, I logged on for the first time in a couple months just recently because of this kind of stuff.\n\n"
    },
    {
      "time": "5 Sep 2006 — 9:56pm",
      "content": "Paul, I don't know if I'm eloquent or not, but I am a moderator on these forums, and Ivan did raise a serious issue. I hope that I've answered it to some degree of satisfaction.\n\n"
    },
    {
      "time": "5 Sep 2006 — 9:59pm",
      "content": "Oh my! Now I'm confused ... are people being aggressive or nice?!?!/\n\nhehehe\n\n:)\n\n----------  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20150123231821/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "5 Sep 2006 — 10:31pm",
      "content": "Thanks for your post everyone.\n\nDan Reynolds  \nI agree 100% with your comment. I'm in no way saying I won't post here anymore and I do understand that this is a public forum but i just felt it got a bit out of hand. It seemd the longer the forum topic stayed up the worse and petty I thought some of the comments got. Maybe the post was removed because of it. I don't belive it was in the 'Critique'  \nsection. I remember the first time I posted some type I designed. I was so excited for feedback and got it. I remember Hrant described it as having a 'me too\" kind of feel (he was right by the way). That hurt. But he also commended me on the effort I put into my work and encouraged further exploration. So I took a licking and became better for it. That's what it's all about.\n\nER  \nMy bad, Thanks for the correction\n\nRatbaggy  \nI apologize if my comments came off a little \"holier-than-thou\" that was not my intention. This is a public forum so I'm free to say what I feel just like evryone else. And I'm sure he expected to get a comment or two but probably didn't expect it to go that far. I'm in no way advocating personal censorship, just tactfullness.\n\n"
    },
    {
      "time": "5 Sep 2006 — 10:48pm",
      "content": "Hey Guys,\n\n\\*blushes\\*\n\nQuite simply, the thread was becoming very negative and personal.\n\nI had no choice but to delete it from within my Admin panel. Apologies.\n\nThis does not mean that i will stop posting my work in the future.\n\nIt's all good :D\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nPaul\n\n"
    },
    {
      "time": "6 Sep 2006 — 12:52am",
      "content": "Ahh see this is why i think we need a critique forum and a showcase forum. I think we would get to see a lot more cool work with a showcase forum where some of the pros on here can post their work without little people like me undermining them :P\n\nIt would be nice for people who don't want critiques to be able to post their work. And we could see more general work like print designs or websites etc. that also displays their cool type.\n\n"
    },
    {
      "time": "6 Sep 2006 — 1:30am",
      "content": "Great idea J-polo9!\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nPaul\n\n"
    },
    {
      "time": "6 Sep 2006 — 2:58am",
      "content": "Well, being able to defend your work and take constructive critique is the most important skill a designer can have. In real life, it often trumps mere technical or artistic skill. The design process is, after all, a process of communication, and the client must be involved.\n\nCritique is not an attack, it's a contribution.\n\n"
    },
    {
      "time": "6 Sep 2006 — 3:36am",
      "content": "Hey Term.\n\nNo one is denying that it's vital as a designer to embrace constructive feedback.\n\nOr that we see critique as an attack.\n\nI believe that people should be able to post work without having analyzed if they don't want it be analyzed. J\\_polo's suggestion about setting up a thread that caters to people who \"just want to show their work\" is a great idea.\n\nIf this concept was embraced, i'm sure that the forum would see a lot of varied works posted.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nPaul\n\n"
    },
    {
      "time": "6 Sep 2006 — 4:41am",
      "content": "allow posted threads to be locked (i.e, no replies).\n\nor ...\n\nif you don't want feedback (good AND/OR bad) ... don't post?\n\n----------  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20150123231821/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "6 Sep 2006 — 5:08am",
      "content": "\\> _if you don’t want feedback (good AND/OR bad) … don’t post_\n\nI vote for this option, actually. I don't want to sound crass, but I find the idea of posting \"show\" threads that cannot be replied to silly. Unless it is a simple text press release or something. I'm not sure that Typophile should be a marketing tool for designers' images. Shouldn't this place be about discussion? Isn't that what keeps us all coming back?\n\n"
    },
    {
      "time": "6 Sep 2006 — 5:13am",
      "content": "As the heading says - RELAX.  \nMr DuccoDesign, settle down a bit and stop the aggressive push. I didnt get to see original thread, but if the poster had decided the critique had become personal, when should have been about the work (and constructive), then I see no problem with the choice to remove the thread as obviously the intended original reason for posting was peverted.  \nOh, I see like a good advertising exec, you have a link to your company. What a good little advertiser you are.\n\n"
    },
    {
      "time": "6 Sep 2006 — 5:43am",
      "content": "Thing is ratbaggy, at no time did i ask for feedback.. i just wanted to share. I mean if i was to visit your folio and post up modified (copyrighted by the way) versions of it…. make sexist comments and then tell you that your “personal” likes and preferences are “incorrect” …. is that appropriate behaviour & classed as critique?\n\nYou have your website linked as part of your signature, so does this mean i can critique your work without an invite?\n\nInfact, what actually constitutes an appropriate critique? Are personal likes/ dislikes really valid? Call me old fashioned, but it’s just poor manners to comment on ones work unless invited.\n\nBut let’s be a little realistic here. It’s a public forum, not a client briefing or meeting room. And I've now learnt that posting artwork will provoke a response (not necessarily a critique) of all shapes and sizes!... Even if i want to hear it or not ;)\n\nSo in the future I’ll keep my work private unless I want a critique.\n\nSeriously, problem solved and no harm done :D\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nPaul\n\n"
    },
    {
      "time": "6 Sep 2006 — 6:39am",
      "content": "Paul, it's good to see you taking the high road. I've subscribed to your blog.\n\n"
    },
    {
      "time": "6 Sep 2006 — 6:45am",
      "content": "Just a comment. When I see threads such as this one I generally read through them completely. I learn from the comments. I don't agree with some of the comments, but I like to try to see where the poster was coming from. It helps me understand the difficult-to-understand design process.\n\nI commend the original poster for submitting his work. I commend all those people who made suggestions on how it might be improved. (I think we should assume that posted work is being posted for comment. Why else would it be posted?)\n\n"
    },
    {
      "time": "6 Sep 2006 — 6:55am",
      "content": "\"where some of the pros on here can post their work without little people like me undermining them\"\n\nThere are no little people, there are just people. As people, we all have faults. Some of our faults are demonstrated here when we post in a tactless manner. That does not make us large or small, just one more fallable creature among many.\n\nChrisL\n\n"
    },
    {
      "time": "6 Sep 2006 — 7:02am",
      "content": "The motto of Typophile is \"Typographic Collaboration\" and the subtitle on \"General Discussions\" is \"Anything goes\". Perhaps for these reasons, anything posted to the forum is regarded by regulars as an invitation to comment and critique.\n\nThere is also a 'person blog' option where people can post without the same implicit invitation to comment.\n\nPerhaps Paul Hunt could add this info to his useful set of guidelines?\n\n"
    },
    {
      "time": "6 Sep 2006 — 7:11am",
      "content": "typothetical - MrMeadeDesign ... the aggression you find in my comment/s is non existent (or at the very least unintentional). I'm not an advertsing exec. I do have a link to a website in my signature, I hand out business cards too. Should the link not be there, is it inappropriate?\n\n:)\n\nPaul (Petch) I hear you. Seriously I do. It's one of those endless arguments (unfortunately)  \nThe sexist stuff (I'm not aware of the context) may have been out of line. Though, on the other hand it may have been a joke - perhaps not appropriate behaviour (but nonetheless, nothing to lose sleep, or a thread over IMO).\n\nI do have a website linked as part of my signature, if people would like to comment on the site, or on any of the work ... and they have ... great! I welcome the feedback - I can choose which feedback is appropriate and holds some merit/significance, but I read/listening to it all - it just might offer a completely new perspective for future reference.\n\nDevil's advocate time - if all the comments supported your personal likes and preferences would you have closed the thread because you 'at no time' asked for feedback?\n\n:)\n\n----------  \n**Paul Ducco**  \n [\"MrDuccoDesign\" - Graham Meade 2006](http://web.archive.org/web/20150123231821/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "6 Sep 2006 — 8:06am",
      "content": "Paul Petch, I followed the thread. I found your work beautiful and impressive. And some of the comments were in bad taste.\n\nHowever, I think you may have misinterpreted a well-intentioned remark, which was not simply a critique of 'personal preference'. This was on the question of best leading. The point that one poster made on leading is discussed in James Felici's 'Complete Manual of Typography', p. 127, under the title \"Assymetrical Leading in Display Type\". Such issues are always debatable, and sometimes unimportant. But it is a legitimate, reasonable query.\n\n"
    },
    {
      "time": "6 Sep 2006 — 8:32am",
      "content": "\"So in the future I’ll keep my work private unless I want a critique. \"\n\nBah. See this is why a showcase forum would be sweet. We could still comment and talk about it, we would just know that that forum is more for showing off cool work that is already finished and shouldn't be railed on. I can imagine how annoying it would be spending $500 on some new business cards or print ads ets. and then bringing it here to get railed on.\n\nMaybe it is better for people to post their work and get critiques always, but that is only some people's opinion. How much cool work are we not seeing because people don't want critiques?\n\nWhat about if it's a client project. We post up the finished work and then get all these comments on how it is bad. Then the client somehow finds the thread and gets upset at all the mistakes everyone else sees lol.\n\nSo critique could be more for unfinished works and showcase more for finished works, unless you still want critiques on them. Personally I will probably always post in critiques, but then I still have a lot to learn.\n\n"
    },
    {
      "time": "6 Sep 2006 — 8:51am",
      "content": "_I can imagine how annoying it would be spending $500 on some new business cards or print ads ets. and then bringing it here to get railed on._\n\n• But then you wouldn’t make the same mistake again, would you?  \n• If you were so worried about critique, how ‘cool’ a work would it really be?\n\nMoreover, it’s not saying someone’s work is crap, it’s saying how things could be improved in the future. Nobody’s perfect, right?\n\n"
    },
    {
      "time": "6 Sep 2006 — 9:14am",
      "content": "I also don't see the point in a Showcase forum. That seems counter to the purpose of this site, which is typographic collaboration. I think if you post a design in the Design forum you should be prepared for comments/suggestions. Defending your work before a bunch of professionals is good preparation for defending it to the client.\n\nThat said, I too have been dismayed by some of the nastiness and personal sniping at times here, and also once posted a thread suggesting comments be constructive and considerate rather than just derogatory. I think it's better recently but this forum should not be a place for blood feuds.\n\nThere have been episodes of sexism and homophobia here as well, which is really unfortunate. Those sorts of comment do NOT belong here and the moderators are very good at deleting them when they cross a line.\n\nI also suggest posting your work BEFORE you spend the money getting it printed.\n\n"
    },
    {
      "time": "6 Sep 2006 — 9:15am",
      "content": "_However, I think you may have misinterpreted a well-intentioned remark, which was not simply a critique of ‘personal preference’. This was on the question of best leading. The point that one poster made on leading is discussed in Jame Felici’s ‘Complete Manual of Typography’, p. 127, under the title “Assymetrical Leading in Display Type”. Such issues are always debatable, and sometimes unimportant. But it is a legitimate, reasonable query._\n\nUps... it seems that was me. Well, I've posted it because I think it's quite important in small text forms. And my post was meant to be technical and constructive, not personal! :)\n\nAs for general discussion whether to criticise or not - I think we CAN discuss/criticise EVERY work in PUBLIC FORUM space. It's all about getting better, isn't it?\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nAL  \n [www.lenart.pl](http://web.archive.org/web/20150123231821/http:/www.lenart.pl/ \"www.lenart.pl\")\n\n"
    },
    {
      "time": "6 Sep 2006 — 9:24am",
      "content": "I should add that it is my impression that the \"critique\" forum is specifically for typeface design, as opposed to graphic design. I don't frequent that forum, so I could be wrong.\n\n"
    },
    {
      "time": "6 Sep 2006 — 9:52am",
      "content": "The critque forum is not just for type design. There is a section for logos and another for typography in use. These two are actually the most popular sections.\n\nChrisL\n\n"
    },
    {
      "time": "6 Sep 2006 — 10:07am",
      "content": "Chris, a number of people, including myself, suggested during the 'beta' phase of the new design that the critique section have fewer sections, and be joined with the main list.\n\nPerhaps if there were one 'type critique' and one 'graphic design critique' on the main list of forums, that would be better. It might draw more people to these, and that way it would also be clear that if you posted there it was for critique. Otherwise not. Still posting only for showing completed work, with no question, even to the 'design' section seems not to fit a forum setting. That could be done in the 'personal blog' sections--which show up in the 'recent postings' list, which I and I think others look at regularly.\n\n"
    },
    {
      "time": "6 Sep 2006 — 10:14am",
      "content": "Chris, that's totally not clear on the 'Forums' page - makes it sounds like it's fonts only. I never go there so I had no idea there was design work on it.\n\nI think it's important to have distinct forums for graphic design and type design as suggested above.\n\n"
    },
    {
      "time": "6 Sep 2006 — 10:15am",
      "content": "William,\n\nI was one of the people who made that suggestion as well so I heartilly agree. The Critique venue is just too buried. Since you don't see updates of recent posts there, everyone ignores it.\n\nHere is a list of [Critique Forum](http://web.archive.org/web/20150123231821/http:/typophile.com/forum/1) sections which are not type design:\n\nLogos / Corporate ID Design\n\nMotion / 3d / Experimental\n\nTypography / Composition\n\nChrisL\n\n"
    },
    {
      "time": "6 Sep 2006 — 10:25am",
      "content": "Yeah, relax... Choose a Sofa, or build your own!\n\n ![](http://web.archive.org/web/20150123231821im_/http:/typophile.com/files/sofa_4855.GIF)\n\nSorry for hijacking, I'm back from Germany and felt like showing some of my yet clumsy travel-work: A font tileset (or a concept of it yet) to create your own type- [Sofa](http://web.archive.org/web/20150123231821/http:/typophile.com/node/17136) to relax... :)\n\n"
    },
    {
      "time": "6 Sep 2006 — 10:34am",
      "content": "LOL!\n\nChrisL\n\n"
    },
    {
      "time": "6 Sep 2006 — 11:45am",
      "content": "This is a design forum. Posting work is going to get you feedback whether you want it or not. That's the nature of the beast (both the fact that we are all fellow designers and that this is a forum).\n\nThe key is to just not take any of it personally.\n\n"
    },
    {
      "time": "6 Sep 2006 — 11:45am",
      "content": "just my own personal feelings:\n\ni have to agree with dan and patty in that typophile is meant for discussion. i don't know that this is the right place for a \"showcase.\" my feeling is that if you want to showcase your work, have a portfolio section on your own website. anything posted to typophile is bound to generate comments and criticism (except, of course, type designs up for critique). this is what makes typophile interesting. concerning the critique sections, it is unfortunate that they are \"buried\" in a lower level of the forums page, but i don't think they're lost. Anyone who has taken the time to read the [Forum Posting Guidelines](http://web.archive.org/readme) should know that there is more than just type designs up for critique in those sections. By the same token, if they have read this page, they'll know that they should keep a thick skin when posting to typophile. to quote the punchcut guys, \"typography is not for the faint of heart.\"\n\n"
    },
    {
      "time": "6 Sep 2006 — 11:49am",
      "content": "\"except, of course, type designs up for critique\"\n\n(B^O)\n\nThat's a scream Paul!\n\nChrisL\n\n"
    },
    {
      "time": "6 Sep 2006 — 11:50am",
      "content": "\"I should add that it is my impression that the “critique” forum is specifically for typeface design, as opposed to graphic design. I don’t frequent that forum, so I could be wrong.\"\n\nYES! Another vote for raising up the critique area to the main level. Seems like a common request.\n\n"
    },
    {
      "time": "6 Sep 2006 — 11:52am",
      "content": "\"Anyone who has taken the time to read the Forum Posting Guidelines should know\"\n\nI have a hunch those get read as much as software EULAs and Sears Appliance Extended Warranty contracts. ;o)\n\n"
    },
    {
      "time": "6 Sep 2006 — 11:54am",
      "content": "I just was trying to read my Sears extended warranty the other day but I must have lost the page that was in English :^P\n\nChrisL\n\n"
    },
    {
      "time": "6 Sep 2006 — 12:00pm",
      "content": "_I have a hunch those get read as much as software EULAs and Sears Appliance Extended Warranty contracts._\n\nsad, but true. i'm afraid the same is true for the [FAQs](http://web.archive.org/web/20150123231821/http:/typophile.com/wiki/FAQs) section of the wiki as well, but it's always nice to have someplace to point the askers of the Freqently Asked Questions.\n\n"
    },
    {
      "time": "6 Sep 2006 — 12:09pm",
      "content": "\\>sad, but true.\n\nOk so what's the case \\*against\\* consolidating the critiques and putting them on the opening screen of the forums? I only see the 'pros'. Is there something I don't get?\n\n"
    },
    {
      "time": "6 Sep 2006 — 12:38pm",
      "content": "_what’s the case \\*against\\* consolidating the critiques_\n\ni'm guessing it goes something like this: consolidating the critiques will actually take work. work = time. typophile is run by volunteers. there are more pressing concerns at the moment... but i wouldn't know what exactly doing this would entail.\n\n"
    },
    {
      "time": "6 Sep 2006 — 12:41pm",
      "content": "If you read Typophile as I read it, ergo checking recent comments, you'd not miss any of the new threads.\n\n"
    },
    {
      "time": "6 Sep 2006 — 1:06pm",
      "content": "\\>YES! Another vote for raising up the critique area to the main level. Seems like a common request.\n\nA \"No\" from me. In my opinion, it has an adequate place in the structure of typophile.com\n\nt.\n\n"
    },
    {
      "time": "6 Sep 2006 — 1:11pm",
      "content": "\\>consolidating the critiques will actually take work.\n\nGood reason. However, when stuff is worked on (I assume by the good Christian R.), it looks like there is some sentiment for consolidation...\n\n\\>checking recent comments\n\nI do that too, but then I'm an addict :) Yes, there is a work-around, but if there is a chance to put it up front, that would be a plus.\n\nAlso a few brief words on playing nice above the Formatting guidelines, with a link to your longer 'read me'. That would get it read more, I'd wager.\n\n"
    },
    {
      "time": "6 Sep 2006 — 1:36pm",
      "content": "I think it's great that this topic generated so much attention. Thanks guys!\n\n_Critique is not an attack, it’s a contribution_\n\nWell said, but-in my opinion-not 100% accurate. Because critique can and has become an attack as it did in the deleted post.\n\n_if you don’t want feedback (good AND/OR bad) … don’t post?_\n\nI also agree with this but how bad does it have to get before we cross the line. I don't believe measures should be taken by this forum to filter out what we deem offensive. My comment was to elicit personal analysis. When I give a critique I always think if what I'm saying really that important, that significant. Has it already been said? (though i must admit sometimes different posters will submitt the same comment simultaniously) Do my comments disrespect the prefrences, likes/dislikes, personal beliefs of the poster? Yes there are rules in design and typography, but have we not been taught to learn them so that way we may bend, break or even ignore the rules to aid us in our creative process? Has enough good things been said about it? And i don't care how bad it is, even the time put into posting the design is a good thing.\n\n_I also suggest posting your work BEFORE you spend the money getting it printed_\n\nWhy? Doesn't experience thru out the years entitle us to follow our gut instincts. Besides this project was personal, for his wife. What we say really doesn't matter. If his wife loved it, which I'm sure she did, then mission accomplished.\n\n"
    },
    {
      "time": "6 Sep 2006 — 1:52pm",
      "content": "I'd like to chime in as a moderator along with Dan and Paul.\n\nWe all agree that comments are inevitable. I don't think anyone took it personally, the critiques I mean, until they evolved from helpful critiquing to hurtful attacking. It is one thing to make suggestions, but another to do so in a heartless and cruel manner.\n\nIn addendum: I really just hope people would consider there words more carefully. I'd like to think all of us are here to learn and grow and share and ... collaborate. Collaboration implies more than one person working together for a common goal. This doesn't include being off-handed or rude. You can joke, but make sure you use smilies, some of us has thinner skin that others.\n\n"
    },
    {
      "time": "6 Sep 2006 — 2:17pm",
      "content": "I dunno, to me the Critique section works fine as is, if in fact it were to follow its description (Typefaces on the chopping block). Maybe the descriptive line under Design could be more... descriptive, say \"Comments and feedback on design issues\" or something like that. That should then cover those 3 buried items (Logos, Motion, Typography) in the Critique section.\n\nI wouldn't want to limit \"Design\" to only critique because some interesting threads have come up that don't fall into that category. But it is unclear at first glance where to go if you have a design you want feedback on. I'd instinctively go to Design based on the taglines.\n\n"
    },
    {
      "time": "6 Sep 2006 — 2:36pm",
      "content": "I agree with Miss Tiffany. Typophile is, after all, a typographic collaboration (having it literally spelled out in the site name helps, too :)\n\n"
    }
  ]
}
