{
  "id": "28078",
  "title": "What are your pet peeves about common typefaces?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "OK, yesterday I rejected Freight Sans for a project. It's simply beautiful, but I believe its narrow word spaces hinder legibility, especially in comparison with other humanist sans faces.\n\n ![](http://web.archive.org/web/20150322223906im_/http:/typophile.com/files/freightsans_3885.gif)\n\nThis morning I briefly considered using TheSans, until I got a look at that uppercase \"Q\" with its disconnected tilde for a tail. Please, Lucas! I absolutely love TheSans, but no alternate for that Q?!!\n\n ![](http://web.archive.org/web/20150322223906im_/http:/typophile.com/files/TheSans_6540.gif)\n\nSo it got me thinking... What common typefaces are \"spoiled\" for you by their quirks? And what makes these features deal-breakers?\n\nThanks in advance,  \n--Michael.\n\n",
  "author": "mwebert",
  "time": "6 Sep 2006 — 4:11pm",
  "uid": "4479",
  "comments": [
    {
      "time": "6 Sep 2006 — 4:21pm",
      "content": "Hi Michael, just out of curiosity, What is the project that you couldn't set up new H&Js to suit your needs?\n\nGreat thread. I'm generally against typefaces with open bowls in the P and especially in the B. I'll have to go find a sample.\n\n"
    },
    {
      "time": "6 Sep 2006 — 4:42pm",
      "content": "You're right, I could have. But we were under a major time pressure and I wanted it to work \"right out of the box.\"\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "6 Sep 2006 — 4:51pm",
      "content": "Wow, I didn't realize how small the wordspace is on FreightSans. Definitely too small for extended reading!\n\n"
    },
    {
      "time": "6 Sep 2006 — 4:53pm",
      "content": "See, I'm not crazy. Lazy not to have set up custom H&Js, perhaps, but not crazy... :-)\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "6 Sep 2006 — 5:24pm",
      "content": "The Freight word spaces aren't that small. How hard is it for you to set them yourself? It would take about 5 seconds.\n\n—K\n\n"
    },
    {
      "time": "6 Sep 2006 — 5:58pm",
      "content": "Well, I beg to differ, Kris... set a test sheet of a few common humanist faces -- Freight Sans, Syntax, TheSans, Frutiger, Meta, etc. -- at 10/14 with no H&J adjustments. I think you'll agree that Freight's default wordspaces make it harder to read than a good number of the others. I was resetting a huge, multipage document in an old version of InDesign, and it was a \"get-it-out-the-door-NOW\" scenario. Guilty as charged.\n\nI guess the tight default wordspaces are not really a deal-breaker, but they got me thinking about this pet peeve topic.\n\nHope that makes more sense,  \n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "6 Sep 2006 — 7:14pm",
      "content": "<cite>I wanted it to work “right out of the box.”<cite></cite></cite>\n\nSince we are living in the world of scaleable type, one could argue that there is only one instance where a font will work \"right out of the box\". All other instances will require some user modifications, to word space, letterspace, kerning etc. It seems that your \"out of the box instance\" and Freight's \"out of the box instance\" are two different things. I guess that is going to leave you with an awful lot of pet peeves.\n\nWho has the time?\n\nJames\n\n"
    },
    {
      "time": "6 Sep 2006 — 7:15pm",
      "content": "Just a suggestion, ever tried [Kievit](http://web.archive.org/web/20150322223906/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Kievit)?\n\n"
    },
    {
      "time": "6 Sep 2006 — 7:27pm",
      "content": "Kievit is a great suggestion for out of the box play ... only minimal tweaking is required if you want to find god in the details.\n\n"
    },
    {
      "time": "6 Sep 2006 — 7:48pm",
      "content": "Nice thread idea, Michael. The Thesis Q is something we hear about at FontShop at least once a month. I know more than one company that has created and licensed their own version of the font with a more reasonable tail.\n\nAdding to the pet peeve pile: @-signs that sit too high. It's amazing how many type designers are still plopping the @ circle on the baseline. I assume they haven't broken free of the pre-digital era when the symbol was aligned with lining numerals instead of lowercase. The more thoughtful type users will see this and baseline shift, but it's often overlooked.\n\n ![](http://web.archive.org/web/20150322223906im_/http:/typophile.com/files/45d4f5d9d9e91aa184f433b62ce7568c_3798.png)\n  \n\n ![](http://web.archive.org/web/20150322223906im_/http:/typophile.com/files/6e1ae553e9147898e89ae2404bb864d9_4390.png)\n  \n\n ![](http://web.archive.org/web/20150322223906im_/http:/typophile.com/files/7177d7a38b1d43fc34cb4c5356e8dfac_4972.png)\n  \n\n ![](http://web.archive.org/web/20150322223906im_/http:/typophile.com/files/840cc85c8de4ee5376f9f062170a9867_6178.png)\n\n[FF Max](http://web.archive.org/web/20150322223906/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&startrow=1&records=20&currpage=1&totalrecords=18&searchby=&searchID=&searchletter=&searchstr=FF+Max&font_categories_checkbox=font_name_search&fontRendererText=too%40high.com)'s @ is delicious, but still misplaced:\n\n ![](http://web.archive.org/web/20150322223906im_/http:/typophile.com/files/get_Font_Image-2_4898.php.png)\n\n"
    },
    {
      "time": "6 Sep 2006 — 8:30pm",
      "content": "Adjusting wordspacing is a snap in Quark.\n\nI have beefs about nearly every Emigre font, which results in my not using them that often. The a in Priori, about half the letters in Dalliance, etc.\n\nToday Sans has the ugliest ampersand ever.\n\nMy biggest beef however is incomplete character sets. I need fractions and it drives me crazy when they only include 1/4, 1/2 and 3/4.\n\nI love the Q in TheSans.\n\n"
    },
    {
      "time": "6 Sep 2006 — 10:38pm",
      "content": "Actually, Emigre has been pretty good about the fraction matter. Tribute, for instance, has a full numerator/denominator numeral set.\n\nMy hope is that with the slew of their new OpenType releases, they do improve the kerning table. Maybe then we'll consider sparking another \"Mrs. Eaves for body copy\" topic :)\n\nThe Q in TheSans I have mixed reaction of. I love it, but it's not as flexible as the regular Q construction -- not that you would use it that much.\n\n"
    },
    {
      "time": "6 Sep 2006 — 11:38pm",
      "content": "Personally, the absence of an ff ligature would be unforgivable. :^)\n\n"
    },
    {
      "time": "7 Sep 2006 — 2:45am",
      "content": "I have considered Goudy Sans for several book designs, but i think the 'A' is too silly.\n\n ![](http://web.archive.org/web/20150322223906im_/http:/typophile.com/files/Untitled-1_5476.gif)\n\n"
    },
    {
      "time": "7 Sep 2006 — 3:02am",
      "content": "<cite>@-signs that sit too high.</cite>\n\nTo me, not just the @ sign, but the copyright symbol ©, parentheses (), brackets [], and braces {}, as well as the slash / and mathematical operators, sit too high in most fonts—especially when used with old-style numerals. (In Adobe Caslon, even the hyphen, the en dash, and the em dash look too high to me.)\n\nParentheses, brackets, and braces also tend to have too little space “inside” them. Actually, I find even periods and commas too tightly spaced in many fonts—for example, the ubiquitous Adobe Garamond Pro (the same goes for many of the kerning pairs, e.g. Ta To Te Tu).\n\nThese are part of the reason why I would want to be allowed (by the EULA) to modify the fonts I use.\n\nIn ITC Mendoza, I didn’t like the old-style numerals 1 and 3, so I made my own versions (thought 3 didn't turn out that well), along with “correcting” many of the things that I mentioned above.\n\nEDIT: I do understand that those of you who design type from scratch might not be too happy about the thought of someone modifying the actual outlines of glyphs (esp. when that someone is a beginner like me). But fonts aren't really works of art, are they?\n\nBut to go back to the start of this thread, I think the _character_ spacing is too tight in most sans fonts—especially the lighter ones. For example, Frutiger Light is much less readable than the normal weight (Roman). Sans fonts, of course, have the problem that when there are no serifs to tie the characters together, spacing that is loose enough for readability tends to look too loose esthetically (so I don't like to use them for extended texts). Just my two cents' worth.\n\nOlli\n\n"
    },
    {
      "time": "7 Sep 2006 — 3:25am",
      "content": "My pet peeve: the silly \"I\" in Bell Gothic. It's a serif \"I\" in an (otherwise great) sans serif typeface.\n\n"
    },
    {
      "time": "7 Sep 2006 — 3:29am",
      "content": "Oh, and many common fonts have terrible umlaut characters. Since I'm a Swede and my language has some very common vowels with umlauts, this is a biggie. I spent a long time looking for a Franklin cut with decent umlauts.\n\n"
    },
    {
      "time": "7 Sep 2006 — 3:31am",
      "content": "<cite>My pet peeve: the silly “I” in Bell Gothic</cite>\n\nI too kind of dislike this feature (which is part of Verdana as well) at a gut level--but it was done for a good reason, legibility.\n\nOlli\n\n"
    },
    {
      "time": "7 Sep 2006 — 3:40am",
      "content": "Thermopolium, what are the faults you see in the 'terrible' umlaut characters? What are some good ones?\n\n"
    },
    {
      "time": "7 Sep 2006 — 5:12am",
      "content": "My native Finnish, too, has ä and ö in its orthography. I can't name any fonts offhand, but for one thing, I remember seeing umlauts that are too small (and perhaps sit too low), thus looking like insignificant flyspecks. The umlauted version represent different phonemes than a and o, so the umlauts are important.\n\nAlso, Tä and Tö kerning pairs are often too tight.\n\nOlli\n\n"
    },
    {
      "time": "7 Sep 2006 — 9:18am",
      "content": "I like the I in Bell Gothic. Otherwise it just looks like any old sans.\n\nI don't like the R in Gill Sans and truly hate how silly it looks at the bolder weights.  \nDon't like Frutiger's R either. It's a dealbreaker for me in that font.\n\nCaslon's italic is a bit too slanty and skinny for me, not readable.\n\nI wish Seria & Seria Sans had a true italic, the one they have looks indistinguishable from the roman.\n\n"
    },
    {
      "time": "7 Sep 2006 — 9:30am",
      "content": "Martin Majoor designed a [more angled Seria Italic](http://web.archive.org/web/20150322223906/http:/www.typotheque.com/articles/my_type_design_philosophy.html) but has yet to release it. I'll get on his case.\n\n"
    },
    {
      "time": "7 Sep 2006 — 10:29am",
      "content": "\"Caslon’s italic is a bit too slanty and skinny for me, not readable.\"\n\nPatty, talk to Bill Berkson about this. He is working on a new Caslon and the italic is one of his targets.\n\nChrisL\n\n"
    },
    {
      "time": "7 Sep 2006 — 11:36am",
      "content": "trenbuchet MS is clearly not one of my prefered Fonts, but given the rather poor choice of fonts one can use for the web you it need now and then and after all its quite okay as a groteque. But for the the Umlaute (i am from Germany) are odd in my eyes:\n\n ![](http://web.archive.org/web/20150322223906im_/http:/typophile.com/files/%C3%B6%C3%A4%C3%BC_3824.gif)\n\n"
    },
    {
      "time": "7 Sep 2006 — 11:43am",
      "content": "What makes the umlaute bad and what would make it proper? The only thing I notice, as someone who does not understand German, is that the dots seem a bit too far to the left. The resolution above is too low for me to tell if the shape is off or if it is just pixelation.\n\nChrisL\n\n"
    },
    {
      "time": "7 Sep 2006 — 11:52am",
      "content": "Chris - I am aware of William's Caslon redesign - he IM'd me about it.\n\nI just can't pay FontBureau prices, especially not for a font I already own in several versions.\n\nI think that Trebuchet umlaut is awful - dots should be closer together.\n\n"
    },
    {
      "time": "7 Sep 2006 — 11:55am",
      "content": "You are right, the example is not so good. The Dots are a bit to much on the left and a bit to high. In small size they seem far to big. Maybe it gets clear when you look at it on a website? Just a random example:\n\n[http://www.theater-der-gezeiten.de/](http://web.archive.org/web/20150322223906/http:/www.theater-der-gezeiten.de/ \"http://www.theater-der-gezeiten.de/\")\n\n"
    },
    {
      "time": "7 Sep 2006 — 12:22pm",
      "content": "I jump to the defense of Lucas! (Belatedly!!) I think Thesis is an amazing, and well thought out, family. I've never had trouble using it, in either display or text settings. It's easy to work with, which is to say it's character spacing and it's kerning tables are good and do not require further fine-tuning. It's a very well designed face. (family of faces??)\n\nThough quirky, I love the Q. Especially in text. In English, the Q occurs infrequently enough to give bodycopy (set in TheSans) more personality than, say, Frutiger. Without overdoing it.\n\nHowever, now that one of my fave faces has properly been defended from you scurvy lot, I wholeheartedly agree with Michael's observation that an alternate Q would be a good thing.\n\n(Can't comment on Freight Sans. I've never used it.)\n\n"
    },
    {
      "time": "7 Sep 2006 — 12:29pm",
      "content": "The 7 in Adrian Williams' Monkton causes me problems. A lot of my work passes over the desks of accountants. And many seem to dislike Monkton's 7 when set in tables and charts.\n\nSo my pet peeve with this face would be \\*accountants\\*.\n\n"
    },
    {
      "time": "7 Sep 2006 — 12:34pm",
      "content": "Are you really saying that in 'pünklich' at the bottom of the page you link to the umlaut is too large? Looks quite small to me (and properly centered). Maybe at the top the umlauts on the caps are too big?\n\nWith screen fonts so much is hinting. Could you or other readers of German give examples with fonts that are normally outline?\n\n\\>I just can’t pay FontBureau prices, especially not for a font I already own in several versions.\n\nWhoa, one tough customer! You know sight unseen that it won't be worth buying, even if upon completion it has achieved my goal of being far more readable and inviting than any other digital Caslon?\n\nJust checking, Fontbureau's retail prices seem to be about the same as fonts in the FontFont catalogue. Mono-Linotype and Adobe are less, the smaller European founderies are more.\n\n"
    },
    {
      "time": "7 Sep 2006 — 12:41pm",
      "content": "William - I have every confidence it will be beautiful, and if I can find a good reason to buy it I'll consider it. But when it comes to plunking down my own moolah for a font I'm gonna go with something that fills a gap in my already large collection of fonts. Fontbureau's fonts are great, and also pretty extensive but as a result I'm only gonna buy it if I can swing the whole collection, and when you add it up... big bucks. I already have a ton of text faces so nowadays I'm more inclined to buy one-off display fonts when I need them for a job. I have - and use - Adobe Caslon which has a much more readable ital than 540 (which I also have).\n\nBut I can't wait to see your new Caslon.\n\n"
    },
    {
      "time": "7 Sep 2006 — 12:49pm",
      "content": "Another try to show you what I mean:\n\n ![](http://web.archive.org/web/20150322223906im_/http:/typophile.com/files/%C3%B6%C3%A4%C3%BC2_3686.gif)\n\n"
    },
    {
      "time": "7 Sep 2006 — 12:53pm",
      "content": "\"I think that Trebuchet umlaut is awful - dots should be closer together.\"\n\nThis may be a screenfont issue. Screenfonts have to find a happy place where a 2-pixel wide and a 1-pixel wide stroke work well. This means small shifts are not possible as they are in fonts made for print. This is a similar problem to small type designed for use in phone books being enlarged for use as display type. Sometimes the specific intent of the font precludes its use outside of that arena.  \nI would be curious to see if the German speakers here on Typophile can point to some examples of very good and bad umlautes in fonts and tell us why this is so. The same is true for any diacritic glyph. I was quite happy to see Oscar Bjarna, an Icelandic speaker, comment on glyphs peculiar to his language in a previous thread.\n\nChrisL\n\n"
    },
    {
      "time": "7 Sep 2006 — 1:09pm",
      "content": "IMHO most well known fonts have quite good Umlaute. To name an other typical screenfont: Georgia's Umlaute look fine in any size. In my expirience readability is increased if the dots-part is a bit smaller then the letter below and placed a bit lower then upper-case letters tops. A to great difference in size and placement between the umlaut-dots and the i/j-dot seems odd to me.\n\nSome examples to judge for yourself:\n\n ![](http://web.archive.org/web/20150322223906im_/http:/typophile.com/files/bsp%C3%B6%C3%BC_6708.gif)\n\n"
    },
    {
      "time": "7 Sep 2006 — 1:11pm",
      "content": "'Hey', in the example you just posted I see the effect you wrote about: the umlauts do look too big on my screen also.\n\nAnother issue is whether the dot on the i and the umlauts should be the same height. If I'm not mistaken the dot on the i is often higher. Looking at Georgia in my post, in 'pünklich' they seem the same height. Surprisingly to me, in Trebuchet in your example, the umlauts are bigger and higher than the i dot.\n\nedit: we cross posted 'Hey'. Thanks for the info. I'll look for some examples myself.\n\n"
    },
    {
      "time": "7 Sep 2006 — 1:13pm",
      "content": "An obvious thing, I can't stand faces with not lowercase numerals. Also dumb looking lower case \"a\" like in Trebuchet (extra big bowls) or Helvética (mannered upcur) make me think twice about the face.\n\nHéctor\n\n"
    },
    {
      "time": "7 Sep 2006 — 1:17pm",
      "content": "The dreaded old style O (Zero, Zed). Especially in typefaces that aren't monoline.\n\n"
    },
    {
      "time": "7 Sep 2006 — 1:23pm",
      "content": "The upside-down question mark in Stempel Schneidler. I had to have it redrawn for me.\n\n[http://www.myfonts.com/fonts/linotype/stempel-schneidler/roman/charmap.html](http://web.archive.org/web/20150322223906/http:/www.myfonts.com/fonts/linotype/stempel-schneidler/roman/charmap.html \"http://www.myfonts.com/fonts/linotype/stempel-schneidler/roman/charmap.html\")\n\n"
    },
    {
      "time": "7 Sep 2006 — 1:45pm",
      "content": "Here are some example of o-umlauts with dotted i's. Do you German speakers think that the difference in Galliard's heights is too extreme or OK?\n\n ![](http://web.archive.org/web/20150322223906im_/http:/typophile.com/files/umlaut%20test_5753.png)\n\nIf I'm not mistaken, you never have an i and an umlaut next to each other in German. Is that right? What about other languages?\n\nedit: I just saw your graphic--did you post it after the text? The ninth in the list has a considerably higher i dot. Is that one Ok to your eyes? Galliard?\n\n"
    },
    {
      "time": "7 Sep 2006 — 1:53pm",
      "content": "I think that Galliard is just at the limit. I might use it for small amouts of text, but certainly not for long texts in german. There are some words with i next to an Umlaut (i.e. böig) but not many.\n\n"
    },
    {
      "time": "7 Sep 2006 — 2:02pm",
      "content": "Thanks, Philipp. The reason I ask is that in the original Caslon a high, heavy dot on the i and j is part of the 'look' of the face. For my Caslon I have to decide what to do. Of course Caslon himself was producing for England and its colonies so the umlauts probably weren't an issue.\n\nOne possibility might be an alternate i with a lower dot for setting German language.\n\n"
    },
    {
      "time": "7 Sep 2006 — 2:13pm",
      "content": "As far as I'm concerned, Lucas needs little or no defense... :-)\n\nI just wish I had an alternate \"Q\" to work with. To my eyes, everything else... and I mean EVERYTHING else... about the entire Thesis family is perfect. I just found it unsuitable for a \"Q\"-heavy project.\n\nOK, onto more pet peeves...\n\n1) The lack of a true italic for Syntax. (Why pair an oblique with a humanist sans?)  \n2) The above-cap-height ascenders & below-baseline descenders of Eidetic Neo Omni (Rodrigo might kill me for saying so... I'm one of the people who suggested he create a unicase version of Eidetic way back, but unicases don't usually have ascenders or descenders...)  \n3) The too-narrow-for-my-tastes italic of Joanna.\n\nHappy we're back on track after my 30 lashes for H&J laziness... :-)\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "7 Sep 2006 — 2:20pm",
      "content": "Michael,\n\nShhhh! Don't remind them :-)\n\nChrisL\n\n"
    },
    {
      "time": "7 Sep 2006 — 2:28pm",
      "content": "<cite>The reason I ask is that in the original Caslon a high, heavy dot on the i and j is part of the ‘look’ of the face. For my Caslon I have to decide what to do. Of course Caslon himself was producing for England and its colonies so the umlauts probably weren’t an issue. One possibility might be an alternate i with a lower dot for setting German language.</cite>\n\nI think in your case i would prefer to keep the typical i-dot in german too. There seem to be room to place the Umlaut-dots a bit higher without getting them to high.\n\n<cite>edit: I just saw your graphic—did you post it after the text? The ninth in the list has a considerably higher i dot. Is that one Ok to your eyes? Galliard?<cite> </cite></cite>\n\nYes I posted it afterwards. The ninth is Day Roman and I think here again that the difference is too big. Still suitable for small texts though but not for long ones.\n\n"
    },
    {
      "time": "7 Sep 2006 — 4:11pm",
      "content": "Thanks, all, for posting images of diereses and i's together and discussing them. This is useful information for a type designer, book designer or graphic designer, since we all are likely to deal with multilingual texts going into the future. Does anyone have comments about the height of accents over capitals?\n\nIt's little things such as have been mentioned here, which are deal-breakers for me in purchasing a type family for general use; if I spend a few hundred dollars for a tool, I want it to work all the time, as well as it can. As James points out, no type works perfectly in every setting, at every size, without some modifications. But individual letters shouldn't bother the user.\n\nThere were problems with every humanist sans I knew about, when I started drawing Mundo Sans; the obliques in so many (Syntax), irritating spurs and curved terminals (Today, Gill Sans), and other things like the narrow oldstyle 5 and unjoined Q in Thesis. Some were spaced obviously for display, some had proportions that wouldn't work below 24 point. I wanted a family that could work at a lot of sizes; Syntax starts to look weird at display sizes, as does Gill, and others like Formata look regimented and square in text sizes. Gill's weight progression is bizarre; the mismatch of weight and contrast between the caps and lowercase always bothers me, as do some of the wide caps. Mundo is meant to have a wider range of sizes it performs at, without any distracting bits. Unfortunately you can't space a typeface to look good at every size; the only typeface I think does this well is Frutiger, and some weights are spaced tighter than others.\n\nYes, I'm very very picky. If I hadn't drawn Mundo, I'd probably be using Kievit.\n\n"
    },
    {
      "time": "7 Sep 2006 — 4:45pm",
      "content": "<cite>Does anyone have comments about the height of accents over capitals?<cite></cite></cite>\n\nIn a displayfont anything that looks good is fine to me. In continuous text I would prefer to keep them low and as flat as it is possible while preseving the typical character. If the accent takes too much space it can look realy bad. That is the reason why in some languages accens on capitals are optional (i.e. in french).\n\n"
    },
    {
      "time": "7 Sep 2006 — 6:26pm",
      "content": "Carl, Mundo is downright gorgeous. Nary a peeve to be found.\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "8 Sep 2006 — 12:45am",
      "content": "Great thread Michael. I agree with what you say about Syntax and Joanna (although the Perpetua italic is pretty darn narrow too – it was just the Gill style).\n\nThe weight progressions in Gill Sans **are** ludicrous, and in a (yet unpublished) piece called 'Eric Gill got it wrong' I've written a critique of how self-contradictory Gill was in the context of the sans' weights and the 'Essay on Typography'.\n\nTo respond to your initial point, I can still remember being hauled out during a class critique many, many years ago, for using overgenerous word spacing; therefore I completely support the word spacing arrangement in Freight Sans and see no problem with it. I also sympathise with some of what is said in the chapter called \"The school of close spacing\" in [Ari Rafaeli's 'Book Typography'.](http://web.archive.org/web/20150322223906/http:/www.amazon.com/exec/obidos/tg/detail/-/0712306935?v=glance)\n\nOther pet peeves? Most of them have already been listed, like the wonky italics in Caslon, but most of all, my peeve would be about the complete lack of balance or grace in the lowercase of [Rotis.](http://web.archive.org/web/20150322223906/http:/www.spiekermann.com/iblog/C1109747452/E1829097339/index.html) It makes no difference if one is talking about the sans or the serif or the semi of either – the fault is in the construction. The 'e' and 'c' look like they are falling over backwards.\n\nAt the Spiekerblog they are talking about it looking OK as signage – but here in Auckland it is the corporate face of the town council and used for a lot of the municipal signage. It looks plain awful in every application.\n\n"
    },
    {
      "time": "8 Sep 2006 — 1:45am",
      "content": "Pet peeves?  \n--I love old style figures, so I get enraged when Adobe converts a family to Open Type and the new version STILL has no old style figures! What's the point?  \n--in some fonts with old style figures, some numbers, like the 3 in FF Acanthus, come out like liner figures instead of dipping down demurely as they should.  \n--Hoefler Text used to display so very badly on Mac, but that's been corrected in Quark 7, thankfully.  \n--I know it's churlish to say so, but for freelancers who pay for their own fonts, the prices add up to fancy money rather quickly! How about a deep discount for lone cowboys, the way books are discounted for library purchase?\n\n"
    },
    {
      "time": "8 Sep 2006 — 4:44am",
      "content": "A bit of a peeve, though more like an unfilled niche:\n\nI'd love to see a beautiful sans serif version of Symbol, or really any good solution for typesetting mathematics with a sans.\n\nTypically, I use Frutiger with MathType, but it just isn't that pretty. And with Greek characters, etc., I end up having to import from MyriadPro Italic.\n\nAny suggestions?\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    }
  ]
}
