{
  "id": "28075",
  "title": "Recommendation for book/story collection typeface",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello everybody,\n\nI’m designing a book for a literary club. Actually, it might be more accurate to call it a journal, a collection of short fiction. This is not a high-tech affair - I’m going to use InDesign (with which I have a little experience, but I’m very much an amateur), but it’s going to be bound and printed at a local printing shop, which means it will probably be laser printed. Still, we want it to look as professional as possible, and at least to follow sound design principles, even if it’s not fancy.\n\nIt will be on letter-sized paper, in two columns, double sided, and due to size constraints, print will not be very large - not newspaper sized, but compact.\n\nThe stories in this collection are all of the same genre and involve similar sorts of characters; they’ll all be cop/detective crime-fighting stories, set in gritty London in the 1970s, but with a smattering - or more - of romance, and aimed mostly at an adult female audience.\n\nI’m looking for a serif font that is suitable for continuous text, extremely readable/legible even in modest sizes (say, 10-pointish, though the actual size will depend of course on the typeface), that works well with laser printing, and that complements the subject matter. I’ll need italics for emphasis, but other than that this will be typical fiction, with mostly plain old roman text.\n\nAny suggestions? I’m not a typographer - I’m really new to all this (though I’m seeing how easy it would be to get hooked!). I’ve read thoroughly through the forums here and made myself a list of seemingly can’t-go-wrongs, like Sabon and Stempel Garamond and Bembo Book and maybe Dante. Deciding among those seems hard enough, but then I get diverted by potentially more interesting possibilities like Dolly or Warnock, and then I end up even more confused. I’m further hamstrung by the fact that I’ve never seen many of these other than as examples online.\n\nSo now I’m overwhelmed and looking for guidance from people with experience!\n\nI very much appreciate any help or suggestions you can offer.\n\n",
  "author": "<a href=\"user/14502\" title=\"View user profile.\">Jes</a>",
  "time": "<br>",
  "uid": "14502",
  "comments": [
    {
      "time": " 6 September, 2006 - 2:13pm",
      "content": "Warnock seems reasonable. It is fairly contemporary and has an x-height tall enough to be seen at 10-point. It has a really humanist, stroke quality to it, too.\n\nHowever, I never seen Warnock set in a long text, so staying with 1970’s classics like, lo and behold, ITC Garamond, might be the way to go :)\n\n"
    },
    {
      "time": " 6 September, 2006 - 4:25pm",
      "content": "Bram, that smiley tells me you’re joking. Right? RIGHT??!!?!?!\n\nDon’t make me open a can of legibility spray on you.\n\n"
    },
    {
      "time": " 6 September, 2006 - 5:46pm",
      "content": "Of course, Mr. Crossgrove, of course.\n\n"
    },
    {
      "time": " 7 September, 2006 - 3:32am",
      "content": "I’d suggest Caslon. Very readable and the archetypal British typeface (though used for the Declaration of Independence).\n\n"
    },
    {
      "time": " 7 September, 2006 - 7:32am",
      "content": "I have to agree! When in doubt, set it in Caslon.\n\n"
    },
    {
      "time": " 7 September, 2006 - 8:44am",
      "content": "I hope this isn’t a dumb question but… which Caslon? There appear to be a number of Caslons - Adobe, Classico, #3, 540. Is there one in particular you have in mind?\n\nAnd why Caslon over, say, Warnock? This is an honest question - it’s difficult for me to understand how those of you who have experience make these sorts of decisions, and some of the terms that get thrown around sound are like wine terms - “lively,” “warm” - I’m trying hard to associate them with what I’m seeing!\n\n"
    },
    {
      "time": " 7 September, 2006 - 10:26am",
      "content": "I kind of like [Paperback](http://web.archive.org/web/20070403192010/http:/www.houseind.com/index.php?page=showfont&id=171). I think someone suggested it in another thread a while back for a gritty crime/pulp project.\n\n"
    },
    {
      "time": " 7 September, 2006 - 11:47am",
      "content": "Jessica,\n\nre: your last question: It’s a matter of flavor, of tone. Caslon is very sensible, reliable, some would say boring and old-fashioned. Warnock is more electric, crisp, modern. Another face like Paperback is more tough, hard-boiled, flat-footed. Others have more flavor, or different flavors, and this aspect of typography is what interests book typographers. It’s not really different from display typography, but the flavors have to be subtle. I have read books set in Trump Mediaeval and it’s a nice dark color, but the shapes are so peculiar and exotic that it’s a little distracting.\n\nYour material is gritty 70’s cop crime romances for women (to oversimplify). What is the appropriate tone to overlay on the text, via type choice? Some might say Century Schoolbook is appropriate here, or newspaper types. But your choice can also influence the tone. For example, if you chose Fournier, it is still readable and serviceable, but more delicate, old-fashioned, and might draw out the romantic element of the stories. The type’s own tone or flavor could be a contrast or counterpoint to the tone of the writing.\n\nThis might all sound like a nonsensical wine-snob discussion. It’s like that; if you’re into the details to the degree that you’re using descriptors like warm, lively, quaint, aggressive, serious, then you’re perceiving the qualities typefaces add to the text they’re representing. If it doesn’t matter, or if these influences are undesireable, use types that disappear: Times, Caslon, Baskerville, Janson, Caledonia, Sabon.\n\nI think it’s nice that you’re curious about this.\n\n"
    },
    {
      "time": " 7 September, 2006 - 12:01pm",
      "content": "My suggestion: print out some type specimen (in high dpi, please) and see it for yourself.\n\nTwo things to watch, among the many, are:\n\n- The overall color (read: blackness) and texture of the paragraph.  \n- The ‘butteriness’ of the typeface, or how easy it is to read through the paragraph. Remember that fast reading aren’t always appropriate, because text matter that is to be scrutinized by the reader (like a serious essay or technical material, for instance) will require a face that follow suit. Furthermore, there’s that “We read best what we read most” adage, so this observation can be subjective.  \n\n"
    },
    {
      "time": " 7 September, 2006 - 8:00pm",
      "content": "crossgrove, thank you - and that all makes sense; there are simply so many choices that I have no idea how to go about narrowing it down!\n\nI think I want to be subtle, for the most part. I want the typeface to complement the subject matter and tone, and not to look like it was printed out on Microsoft Word in Times New Roman or whatever Garamond comes with Word, and yet I don’t really want it to draw attention to itself. I’d prefer it not to be overtly romantic.\n\nThis is good, because it’s forcing me to think about what I really want … and I think if I had to pick a single descriptor it’d have to be that I’d mostly like it to have a “British” feel - or more specifically, a London-in-the-70s feel! ;-)- rather than a hard-boiled cop-detective feel or a romantic feel. And … this is entertainment; not meant to be serious technical reading. I want it to be serviceable and very, very readable - \\*almost\\* invisible to the reader - but really attractive and clean.\n\nPerhaps this suggests Caslon - though part of me is still drawn to Dolly and/or Warnock! And I just don’t know enough to know if using those would be a mistake, or if Caslon would be boring and ugly, or if Century Schoolbook would be just too common - or maybe no one would notice at all and I’m driving myself crazy for nothing.\n\nWhew, this could be a challenging hobby! Fun, though; I’ve just sent away for a bunch of books from Amazon, because I’m liking this …\n\nIt does seem like printing out samples would be a good idea, but brampitoyo … \\*how\\* exactly do I print out a type specimen for fonts without buying them? I can’t figure that out, though I know surely there must be a way!\n\n"
    },
    {
      "time": " 7 September, 2006 - 11:07pm",
      "content": "You can usually find them right at the foundry’s website.\n\nHere’s some specimens (and a few more ideas) to get you going:  \n [Warnock](http://web.archive.org/web/20070403192010/http:/store.adobe.com/type/browser/pdfs/WarnockPro.pdf)  \n [Freight Text](http://web.archive.org/web/20070403192010/http:/www.joshuadarden.com/shop/freighttext.pdf)  \n [Kingfisher](http://web.archive.org/web/20070403192010/http:/www.typography.net/info/Kingfisher_Sample_Book.pdf)\n\nOr you could always ask for the foundry’s type specimen. I know that, among many others, FontShop has a free one.\n\n"
    },
    {
      "time": " 8 September, 2006 - 7:40pm",
      "content": "There’s a secret here of real use to you. Some Adobe Open Type releases, like Warnock, offer optical weights, so that instead of Warnock Pro regular, you can choose Warnock Subhead, which is a shade cleaner and thus will come out of laser printing as clean, or cleaner, than the regular optical weight. Minion Pro, Adobe Jenson, Chaparral—same option. If you find yourself setting 9 pt for long stretches, try ITC Stone Serif, it’s a superbly readable workhorse I’ve used for many such jobs.\n\n"
    },
    {
      "time": " 8 September, 2006 - 9:56pm",
      "content": "And let’s not forget Garamond Premier Pro.\n\nITC Stone Serif has a stubby r, but “reads like butter”, says Before&After. But does it scream “English”? I never tried it myself.\n\n"
    }
  ]
}
