{
  "id": "28080",
  "title": "(x) classic serif face used for Thomas Murray website navigation - Delphian {Skylar Fein}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi guys, I’ve been playing around with Google with lots of unsuccessful keywords when I finally tried ’typography forum’ and got right here. Typophile was not the first entry, but was the first I clicked though :)\n\nIt amazed me to see this thread in the forum and I realised that I am not the only one who does “what font could this be..” but instead, there are lots of like of me!\n\nOk, now to the point. Can you please help me to identify the font which is used on the attached image, or probably find the closest font which would also make my happy. This is from the Thomas Murray website, [www.thomasmurray.com](http://web.archive.org/web/20080208230134/http:/www.thomasmurray.com/ \"www.thomasmurray.com\").\n\n ![](http://web.archive.org/web/20080208230134im_/http:/www.typophile.com/files/tmmenuc_4081.gif)\n\nFirefox got crushed a number of times when attaching the image, but the Flash upload tool worked like a charm.\n\n [‹ (x) \"molding\" script - Vivaldi {Mark S}](http://web.archive.org/web/20080208230134/http:/www.typophile.com/node/28172 \"Go to previous forum topic\") [aNYthing / NY Giants logo, please id this font ›](http://web.archive.org/web/20080208230134/http:/www.typophile.com/node/28071 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080208230134/http://www.typophile.com/user/14512\" title=\"View user profile.\">ulmas</a>",
  "time": "<br>",
  "uid": "14512",
  "comments": [
    {
      "time": " 6.Sep.2006 8.22pm",
      "content": "Similar to Classic Roman but not sure\n\n[http://www.myfonts.com/fonts/agfa/classic-roman/](http://web.archive.org/web/20080208230134/http:/www.myfonts.com/fonts/agfa/classic-roman/ \"http://www.myfonts.com/fonts/agfa/classic-roman/\")\n\nAlso check out Felix Titling, Cresci.\n\n"
    },
    {
      "time": " 7.Sep.2006 1.58am",
      "content": "I agree looks like Felix Titling MT to me.\n\n"
    },
    {
      "time": " 7.Sep.2006 2.05am",
      "content": "A PDF from their site contains lots of Book Antiqua and also an embedded subset of a TrueType “THOMASMURRAY” so perhaps it’s custom.\n\nRichard\n\n"
    },
    {
      "time": " 7.Sep.2006 8.40am",
      "content": "I think this might be our old friend Schneidler Initials (a.k.a. [Shango](http://web.archive.org/web/20080208230134/http:/www.myfonts.com/fonts/castletype/shango/)). The wide M and N are what pointed me this way.\n\n- Mike Yanega\n\n ![](http://web.archive.org/web/20080208230134im_/http:/www.typophile.com/files/shango_investments_4708.png)\n\n"
    },
    {
      "time": " 7.Sep.2006 8.46am",
      "content": "I looked at Shango too but the crossbar on the A didn’t match.\n\n"
    },
    {
      "time": " 7.Sep.2006 8.50am",
      "content": "However,... I notice the ampersand is not from Shango. That looks more like one from Palatino/Book Antiqua that has been widened.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 7.Sep.2006 8.59am",
      "content": "_” the crossbar on the A didn’t match”_\n\nHmm, I see what you mean. Cresci is out, because it doesn’t have the U stem. How about [Cicero Caps](http://web.archive.org/web/20080208230134/http:/www.fontshop.com/?fuseaction=catalog.fontdetail&searchby=manufacturer&displayfontid=C.103161.0.1)?\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 7.Sep.2006 9.24am",
      "content": "If you look at the site in the link you’ll see that (unless there’s been manipulation) it’s one of those fonts that has small caps instead of ulc which is why I initially went with Classic Light. Another font that has similarites is Michelangelo.\n\nAlso I don’t think the A in the sample is a true point, it looks like it has a spur.\n\nI can’t find that ampersand anywhere.\n\n"
    },
    {
      "time": " 7.Sep.2006 9.51am",
      "content": "I’m stuck. I don’t think the G on Classic Roman is right. The Zapf faces have an S that doesn’t fit. I would like to go back to Shango, and say they modified the A, or maybe they mixed a few fonts here. If I look at the details of the enlarged tops of the T and M on the web site, they look more like Shango than the others, especially the M serifs.\n\nIn any case it’s starting to seem like this is at least customized.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 11.Sep.2006 10.19pm",
      "content": "Call me crazy, but I think this might be [Delphian](http://web.archive.org/web/20080208230134/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=C.106288.0.0&attributes.sampleSize=14&sampleText=CAPITAL&sampleSize=14), and with the small size and lack of aliasing, the inline just disappears. In Delphian, the U has a stem, the A has a spur, and the ampersand matches.\n\n"
    },
    {
      "time": " 12.Sep.2006 8.03am",
      "content": "I think you got it - Delphian. Silly font to use that small. We had another ID like that once.\n\n"
    },
    {
      "time": " 12.Sep.2006 8.53am",
      "content": "I don’t think this is an inline font, but the idea of a customized solid version of Delphian might work. The Delphian letterforms are hard to tell apart from the site lettering, except for the T, which has more of a serif than Delphian. That wouldn’t be too hard to add, though.\n\n- Mike Yanega\n\n"
    }
  ]
}
