{
  "id": "28099",
  "title": "Who Designed the Fed Ex logo",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Just doing some research, anyone know who and when designed the wonderful FedEx Logo. .. ?\n\nCheers\n\n",
  "author": "James Scriven",
  "time": "7 Sep 2006 — 11:29am",
  "uid": "14360",
  "comments": [
    {
      "time": "7 Sep 2006 — 11:32am",
      "content": "A graphic design agency overly interested  \nin impressing other graphic design agencies.  \nThey can't however be accused of violating  \nthe norm in this respect...\n\nhhp\n\n"
    },
    {
      "time": "7 Sep 2006 — 11:38am",
      "content": "I get the first part, im just not sure what you mean? care to elaborate?\n\n"
    },
    {
      "time": "7 Sep 2006 — 11:42am",
      "content": "[http://en.wikipedia.org/wiki/FedEx#Operating\\_units\\_and\\_logos](http://web.archive.org/web/20131017184930/http:/en.wikipedia.org/wiki/FedEx#Operating_units_and_logos \"http://en.wikipedia.org/wiki/FedEx#Operating\\_units\\_and\\_logos\")\n\n"
    },
    {
      "time": "7 Sep 2006 — 11:46am",
      "content": "I think the answer you were looking for is Landor.\n\nThe designer was Lindon Leader, he did it inn '94. Info below.\n\n[http://www.thesneeze.com/mt-archives/000273.php](http://web.archive.org/web/20131017184930/http:/www.thesneeze.com/mt-archives/000273.php \"http://www.thesneeze.com/mt-archives/000273.php\")\n\nHrant's snide and irrelevent comment nonwithstanding, it is a brilliant logo.\n\n"
    },
    {
      "time": "7 Sep 2006 — 12:30pm",
      "content": "Woe is me, I have so insulted The Lifestyle - whatever shall I do to make it up  \nto Them? What's irrelevant is gazing at one's navel and seeing an arrow there.\n\n[http://www.manic.com.sg/blog/archives/000232.php](http://web.archive.org/web/20131017184930/http:/www.manic.com.sg/blog/archives/000232.php \"http://www.manic.com.sg/blog/archives/000232.php\")\n\nhhp\n\n"
    },
    {
      "time": "7 Sep 2006 — 12:49pm",
      "content": "I don't think you need to \"see\" the arrow for it to be effective. It's more classy than the skulls in the ice cubes in old drink ads (much easier to spot when you're drunk of course). If Leader wanted the arrow to be obvious he would have done something different.\n\nThat said, what the h\\*\\*l is wrong with designing something that delights other designers? Clearly it's working for a more general audience as well. It's a clean, elegant, distinctive logo with a subtle surprise. What could be better than that?\n\nIf you have an arrow in your navel I'd say you better see a doctor and fast.\n\n"
    },
    {
      "time": "7 Sep 2006 — 1:59pm",
      "content": "Patricia,\n\nWell said. The Fedex logo is brilliant stuff and I don't think the arrow is a \"show off\" for colleagues. Rather a thing that happend because of the letters used.\n\n"
    },
    {
      "time": "7 Sep 2006 — 2:08pm",
      "content": "Contradictions, and fallacies. For one thing, please  \nread the answer to \"Did you have to manipulate the  \nfont in anyway to create a perfect\\* arrow?\" here:  \n [http://www.thesneeze.com/mt-archives/000273.php](http://web.archive.org/web/20131017184930/http:/www.thesneeze.com/mt-archives/000273.php \"http://www.thesneeze.com/mt-archives/000273.php\")\n\n\\* Gotta love them Modernists, eh!\n\nPatricia: What could be better? Simply not fooling ourselves.\n\nhhp\n\n"
    },
    {
      "time": "7 Sep 2006 — 2:57pm",
      "content": "I like the FedEx logo. Always have, probably always will. I admit that I didn't see the arrow at first, but the logo doesn't need the arrow to function. Most of its success, in my opinion, is its clarity, distinct & quick read, and the way it's used by FedEx. The arrow just adds another nice layer to the whole thing that gives it depth. Plus, if the arrow is too overwhelming, it can be a liability (pointing backwards, etc.).\n\nI believe that any shortcomings it has are more subtle than that arrow.\n\n"
    },
    {
      "time": "7 Sep 2006 — 3:00pm",
      "content": "The problem is neither the logo (which is fine) nor the arrow  \n(which is harmless), it's the underlying, unspoken intent.\n\nhhp\n\n"
    },
    {
      "time": "7 Sep 2006 — 3:06pm",
      "content": "Hrant - what exactly is your problem with graphic design? I'm getting mighty tired of your railing on my industry. Could you please explain once and for all why you find us so useless? And furthermore, if you find us so insidious, why you waste your time at this forum where so many of us lurk?\n\nResponding to the first part of your post - designers manipulate or customize fonts all the time when they create logos. It's part of the job.\n\n"
    },
    {
      "time": "7 Sep 2006 — 3:06pm",
      "content": " **deleted**\n\nƒ\n\n"
    },
    {
      "time": "7 Sep 2006 — 3:13pm",
      "content": "heh heh, I got to read Fredo's comment before it was deleted...\n\n"
    },
    {
      "time": "7 Sep 2006 — 3:20pm",
      "content": "I guess that must have been Fredo's \"underlying, unspoken intent\"?\n\nChrisL\n\n"
    },
    {
      "time": "7 Sep 2006 — 3:24pm",
      "content": "On a related note - a friend was designing a logo for an airline for an Arab country (can't remember which) and he realized almost too late that there was an embedded crucifix between two of the letters (squared off sans lower case s and a) and he had to rework the design so as not to offend.\n\n"
    },
    {
      "time": "7 Sep 2006 — 3:27pm",
      "content": "**Patty, You pretty much made my point.  \n _Say something once – why say it again_? Fafafafafafaaaa...**\n\n"
    },
    {
      "time": "7 Sep 2006 — 3:38pm",
      "content": "Having an element in a logo which does not become evident at first glance aids in the branding process. It makes another pocket of memory to associate the logo in. It also causes discussion among those who saw it and those who did not, further increasing brand awareness. There was no trick and no hidden agenda, no more than making adjustments to a text face so that it reads better at text sizes. Creating overshoot is also a \"trick\" to \"fool\" the eye--I guess that is pretty sinister stuff those damn type designers do. Don't talk about ink traps or thinning horizontal strokes either. Those are really dirty tricks that type designers do just to impress each-other. It is their underlying unspoken intent to snicker at readers who are not in the know about such things. There is going to be a tell-all expose on 60 Minutes this week where Mike Wallace has a hidden camera in Matthew Carter's studio looking for such dirty schemes as he pulled off for Ma Bell. Graphic designers are just pikers at this sneaky business ;^{\n\nChrisL\n\n"
    },
    {
      "time": "7 Sep 2006 — 4:13pm",
      "content": "_The problem is neither the logo (which is fine) nor the arrow (which is harmless), it’s the underlying, unspoken intent._\n\nTo, like all corporations, pursue shareholder returns to the detriment of all else? I'm no fan of that either.\n\n"
    },
    {
      "time": "7 Sep 2006 — 4:27pm",
      "content": "You are too afraid of seeing your sacred cows for the livestock that they are.\n\nWaste of time? Agreed. ASCII is no match for decades of rich-media conditioning.\n\nhhp\n\n"
    },
    {
      "time": "7 Sep 2006 — 4:45pm",
      "content": "{Deleted}\n\n"
    },
    {
      "time": "7 Sep 2006 — 7:57pm",
      "content": "zzzzzzzzzzzz.\n\n"
    },
    {
      "time": "7 Sep 2006 — 8:53pm",
      "content": "\"Sacred cows make great hamburgers.\" --Mark Twain\n\nSeriously, though (and to rescue this thread from the Flame War Dustbin), I agree that the FedEx logo is pretty genius -- arrow or not. If I remember right from design magazine articles of the time, the client specifically wanted to get \"Federal\" out of the name, encountering resistance in other countries (especially Latin America). The original design included an animation suggestion where a large yellow arrow (larger than the space in between the \"e\" and the \"x\" flew in from the left, then settled into the space while fading away. It was never used, largely because of what Chris said above -- half the time on any mode of transport, it's pointing the wrong way.\n\nFrom a typographic standpoint, I believe the designer said he started with Futura, but used the counters from Univers (which seems to have taken over as their corporate font, website graphics in Frutiger notwithstanding).\n\nSee all their current branding at once [here](http://web.archive.org/web/20131017184930/http:/www.fedex.com/us/about/today/companies/index.html?link=2).\n\n(_Nota bene_: A crucifix is a cross with a _corpus_, an image of the crucified Christ, on it. In other words, all crucifixes are crosses, but not all crosses are crucifixes. Please pardon my splitting hairs, but it's the name of my order, after all.) :-)\n\n"
    },
    {
      "time": "8 Sep 2006 — 4:33am",
      "content": "Wow, I never noticed the arrow until now. That's brilliant!\n\n"
    },
    {
      "time": "8 Sep 2006 — 8:23pm",
      "content": "The logo works.\n\n"
    },
    {
      "time": "9 Sep 2006 — 7:07am",
      "content": "Hrant... What are you actually trying to say? Your comments are like reading William Blakes verse.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nPaul\n\n"
    },
    {
      "time": "9 Sep 2006 — 7:36am",
      "content": "That tends to happen when I get tired/embarassed of  \nrepeating myself - this is something I've harped on  \nabout a few times before. The thing is the Typophile  \nsearch function is totally bonkers so I can't dig up  \nany of it to link to... but fortunately my comments  \non Snog Blog linked above\\* are still there.\n\n\\* Here it is again: [http://www.manic.com.sg/blog/archives/000232.php](http://web.archive.org/web/20131017184930/http:/www.manic.com.sg/blog/archives/000232.php \"http://www.manic.com.sg/blog/archives/000232.php\") \\_  \n(Just sub \"or\" for \"and\" in \"you either see it and you don’t\" please.)\n\nhhp\n\n"
    },
    {
      "time": "9 Sep 2006 — 10:06am",
      "content": "The arrow isn't what was important about the re-branding, it was the natural capitualtion to the direction of the masses. Everybody called them 'Fed Ex' when their legal & (& brand) name was 'Federal Expresss'. This discontinuity got in the way. It was haming the brand. So it was a good idea to rebrand on that basis alone. Their old logo wasn't in tune with the age they were in either. It was weak compared to their competion. Making a stonger ID meant that they could capitalize on the growing confidence they were enjoying vis a vis their competitors. I think Landor did a solid job but that in a way it was a cake walk of a job because the job needed to be done so very badly at the time. The fact that the logo is still fairly strong is proof that the work they did was solid work. And making their own letters was smart. But NIVEA made their own letters too. Making your own letters wasn't a new idea.\n\nTo me the the question is how long until it needs to be redone? As it stands it is full of the 70s-80 culural adoption of mid centuruary modern ideals. At some point that will seem outdated and quaint. And their recent rebranding of Fedex Kinkos is hesitant and weak I think. There is a thread about that here on typophile. Find it iof you wish. Search is on the upper right of the page. Here's a sample though.\n\n ![](http://web.archive.org/web/20131017184930im_/http:/typophile.com/files/fxks_logo_5415.gif)\n\nBut to Hrant's points ( as best I can make them out. It isn't easy to see your point other than 'these guys are show offs & so we should not like them'...)\n\n-\\> _Is the arrow for for ad agency buddies?_ : I don't know - maybe. But I don't think it's important anyway. It neither makes nor breaks the ID. It's a sideshow; not the main event.\n\n-\\> _Was the rebranding as a whole for other ad agencies as an audience?_: No. In fact, no f\\*\\*\\*ing way. It was inevitable and obvious and very very needed for pure and basic business reasons. And put in Mr. Leader's place I bet you or I would have done something pretty similar. The real core of rebranding has to do with making the name change & changing the type.\n\nThat said, I might have even thought the arrow was fun once I saw it. And I probably would not have wanted to make a big deal out of it even if I allowed it to emerge in the text. Maybe I am making the classic mistake of seeing genius as 'easy' or 'obvious'. But I don't think so. I think it was just solid work in the right place & right time.\n\nFeel free to help me see the light if you disagree. But you had better have some compelling arguements!\n\n"
    },
    {
      "time": "9 Sep 2006 — 10:36am",
      "content": "The Fedex logo appeared to me to have an energy and forward-moving feel to it, even before the arrow was pointed out to me. My conclusion is that the presence of the arrow does have a subliminal affect even when you are not consciously aware of it. Of course the 'vibrating' colors also contribute. Superb design.\n\n"
    },
    {
      "time": "9 Sep 2006 — 1:48pm",
      "content": "Eben, you're fighting the reality that when graphic designers talk about the FedEx logo, they always focus on the arrow - in fact when they bring up the logo, that's usually why they do so. Think about how that ties in to what I'm saying.\n\nhhp\n\n"
    },
    {
      "time": "9 Sep 2006 — 3:06pm",
      "content": "1. Leader was creative director, not necessarily the designer, but that brings up issues of credit and work in design.\n\n2. Yes, when designers talk about logos they talk about the concept, the visual tricks, the details, the craft. Not only do non-designers not talk about the FedEx arrow, they don't talk about logos. Period. If they do, it's a rarity (and maybe spurred by someone seeing something like a hidden arrow). So Hrant and Paul Rand would have colored in the arrow. What difference would that have made? Well, it couldn't have made their business go much better, they have done very well for themselves. It couldn't have done a better job of making them look contemporary, as it forced UPS to update in order to look relevant (no need to discuss that one). If the logo didn't work because the arrow was too hidden, I sure have been fooled.\n\nChris' argument is right on. Besides, if it keeps coming up, how is it a problem?\n\n"
    },
    {
      "time": "9 Sep 2006 — 3:25pm",
      "content": "Results are the ripples on the surface of Intent.\n\nhhp\n\n"
    },
    {
      "time": "9 Sep 2006 — 6:06pm",
      "content": "Hrant, you have made my point for me I think - in a way.\n\nIf graphic designers focus on the arrow they are just being themselves, concerned with idiosycratic stuff & trivia. We are the same when it comes to fonts... But back to the arrow, for the public - the folks who matter for fed ex - the arrow is irrelevant. Or very nearly so.\n\nPut another way, If a bunch of GD want to wank on about the arrow - they are just fooling themselves - not me, not you, and not fed ex customers. And probaly not FedEx either.\n\nSo what's the BFD? Why do you care about the chatter of the GD? To me, that's the mystery. Maybe you have a reason or two. I just figure out what they are.\n\n"
    },
    {
      "time": "9 Sep 2006 — 6:14pm",
      "content": "I almost never post here anymore, but your last comment Hrant is the best wording I've seen of something I have known and cherished for many years.\n\nIntent is everything.\n\nKudos.\n\npeace\n\n"
    },
    {
      "time": "9 Sep 2006 — 6:23pm",
      "content": "\\> they are just being themselves\n\nBut what are the people who put that arrow there being?\n\n\\> We are the same when it comes to fonts…\n\nMany of us indeed are, like when some type designers insist a font must be chirographic to be accepted by the reader. But I personally try not to appreciate only things that fulfill my own prophecies.\n\nOne interesting extension to this parallel is the difference between display fonts and text fonts, and that's related to my valuation of the proper application of subtlety in design. My essential complaint is that the way the arrow ended up being in the FedEx logo is bad design - that's all. Opinions like \"the new logo is much better than the old one\" and \"it's OK if most people don't notice the arrow\" are completely beside my point. And I won't let this go because I'm trying to counterbalance all the \"ohmmm, the arrow is divine, ohmmm\" delusion that I constantly run into.\n\n\\> they are just fooling themselves\n\n1) Which can influence their own work negatively.  \n2) The people who put such an arrow there are also fooling the client.\n\n\\> Why do you care about the chatter of the GD?\n\nThe material side of me cares because graphic designers buy fonts, and it's harder to sell them my fonts since there's a mismatch in the characterization of useful subtlety. The ideological side of me cares because it hates to see deception and delusion, not least of the self (screw the client). So I guess I have two reasons. :-)\n\nhhp\n\n"
    },
    {
      "time": "9 Sep 2006 — 6:29pm",
      "content": "_But what are the people who put that arrow there being?_\n\nsubtle, which is a very nice thing to be.\n\n"
    },
    {
      "time": "9 Sep 2006 — 6:31pm",
      "content": "It's very nice when it's good design, not when it's self-aggrandizing tokenism.\n\nhhp\n\n"
    },
    {
      "time": "9 Sep 2006 — 6:33pm",
      "content": "Hrant, I have a lot of respect for you, and perhaps I haven't read enough of your threads, but I'm lost...\n\nI'm assuming that you're suggesting that the arrow was more than a \"happy accident\" or subtle graphic device to suggest motion.\n\nI'm intrigued, but I don't quite see the point you're trying to make.\n\n"
    },
    {
      "time": "9 Sep 2006 — 6:46pm",
      "content": "Actually I used to think it was a happy (more like tragicomic) accident, and diagnosed it as the pandemic Post-Rationalization Disease, but Gunnar Swanson pointed out that you can't get such a clean arrow by luck with any font\\*, so I revised my diagnosis to Overkilled Subtlety Flaunting Disease.\n\n\\* Please, do read the answer to \"Did you have to manipulate the  \nfont in anyway to create a perfect\\* arrow?\" in this interview:  \n [http://www.thesneeze.com/mt-archives/000273.php](http://web.archive.org/web/20131017184930/http:/www.thesneeze.com/mt-archives/000273.php \"http://www.thesneeze.com/mt-archives/000273.php\")\n\nhhp\n\n"
    },
    {
      "time": "9 Sep 2006 — 8:13pm",
      "content": "I don't think that the \"subtle\" arrow is being \"flaunted\" at all -- there's been no emphasis in any FedEx advertising that I'm aware of. In fact, while there may have been an initial proposal by the designers to show off the arrow, it wasn't necessary because the client was happy with getting a clean identity system that made them stand out as distinctive from other firms in their field. So, if the client doesn't care that there's an arrow in there, why should we? And, for that matter, was the designer supposed to then edit the arrow out of the logo, just so that the typeforms would return to being \"pure\"?\n\n"
    },
    {
      "time": "9 Sep 2006 — 9:43pm",
      "content": "I think I'm reaching the limits of the English language (maybe even written communication) to dispel this illusion... :-/ But I'm also starting to feel like I owe people/Typophile more than cryptic drive-bys, and if I do a good job and keep track of this thread I could even simply point to it whenever a \"So guys, how cool is the arrow in the FedEx logo!\" crosses my path (assuming the link stays live) - the Snog Blog thing is clearly not cutting it.\n\n--\n\n\\> I don’t think that the “subtle” arrow is being “flaunted”\n\nNo, it's not that the arrow is being flaunted - it's not, and it couldn't be - because it's the <cite>subtlety</cite> that's being flaunted. Wanting to self-validate graphic design and by the same token appeal to other graphic designers -who are however of no concern to the client- is distracting from the ideal.\n\n\\> if the client doesn’t care that there’s an arrow in there, why should we?\n\n1) What kind of client doesn't care about every detail in its logo? Not the FedEx kind.  \n2) Do you really mean to say that The Customer Is Always Right? I couldn't agree less.\n\nIf the design studio put the arrow in there on purpose (see below - and above, twice, for that matter) then one would assume they told the client about it. If they didn't tell the client, that just validates my point more. So let's assume they did; at that point if the client didn't like the idea, they would have asked for it to be removed (in favor of the original letterforms, presumably) - they wouldn't have thought \"what the heck, these designer dudes really want it in there, let's just humor them\". Chances are they thought (probably because that's exactly what they were told during the pitch) what many people here have been saying: that hey, it can't hurt, it can only help. I think that deep down it does in fact hurt, because the <cite>intent</cite> is misaligned with what the client really needs, so the result is necessarily non-ideal. Somewhere, there was a better solution, but it would have required the designer to not suffer from Overkilled Subtlety Flaunting Disease - you can't get there from here.\n\nThe further the intent is \"off\", the less the results can approach the ideal.\n\n\\> was the designer supposed to then edit the arrow out of the logo,  \n\\> just so that the typeforms would return to being \"pure\"?\n\nThis is getting into the mechanics of how design studios operate, and relate to their clients. I know little about that, but I do believe there's a lot of variance, so for example one studio might work on a bunch of proposals and show the client only a handful of them, another might work on a bunch and show them all, another might work on only two and show those, etc. And then there's the client culture, which might love or hate a given approach.\n\nBut I would say that ideally there would be enough effort on the part of the studio and enough clear, iterative communication between the studio and the client that you'd never end up in a position of removing a subtle arrow and reverting to original letterforms - you'd have done one with the original forms to begin with, and ideally shown that version to the client no later than the subtle-arrow one, and in fact alongside a not-too-subtle arrow one (because the arrow is a Concept, not a happy accident). But of course the real world never works so elegantly.\n\n--\n\nBut guys, you know what? This arrow business really isn't so bad. There are worse things in the graphic design field - in fact I think there are worse things in the type design field, so please stop thinking that I hate all graphic designers or something - it's just that I think some fields, through historical precedent, plain circumstance, the pressures put upon it by society and capitalism, or whatnot, are further from some form of an ideal than others. Like how very many people think politicians are opportunistic low-lifes, and most people -among those who know we even exist- think that type designers are harmless idealistic freaks, I'd say that graphic designers are somewhere between those two (although much closer to the latter). Now <cite>photographers</cite>... ;-)\n\nhhp\n\n"
    },
    {
      "time": "9 Sep 2006 — 10:54pm",
      "content": "having started this not knowing what kind of response it would generate I thought I might chime in on my new found two cents. . . I look at it at the root of the design, whether or not it succeeds. I think we all know it does, second its clearly generated a lot of jazz and talk amongst us fellow designers . . . so somewhere along the line Leader must of done something somewhat correct beacuse he has left an impact.\n\nHowever can that impact be questioned if it is just felt across the design world? It would not be a successful design in that case. And to counter that can it succeed as many other designs do, naturally, on two levels, one ours, as the designers, and the other to the rest of the peons out there who dont look at pretty much everything, the way designers do. Deep Breath. . .\n\nMake any sense?\n\nWhat did Leader set out to do? not sure if ts clear from that interview. Im sure the impact and hubub amongst the design world was not really considered when he was immersed in the design process.\n\nAlright feels like I could go on and on, so Ill make it a point to stop. As a typographer, my threading quality of text is about as poor as what some might say, the stupid arrow in the fedex logo.\n\nCheers\n\n"
    },
    {
      "time": "10 Sep 2006 — 7:52am",
      "content": "I sort of see your point, Hrant, although I don't believe any harm or deceit of any kind was intended. Whether or not a layperson sees the arrow does not change the fact that it's still a good logo -- but that added visual does give it a little something extra, and the arrow is perfectly appropriate. I think Leader would have been foolish not to share the arrow with the client.\n\nSometimes while exploring shapes and letterforms during the process of logo design, one can \"accidentally\" discover forms that contribute meaning -- that is the happy accident I was referring to. Usually they must be refined to reach full potential, just as Leader did with the letterforms.\n\nI've read all of the links, Hrant, and I still can't help but think that all of this is harmless.\n\n"
    },
    {
      "time": "10 Sep 2006 — 9:08am",
      "content": "Hrant, thanks for expanding your remarks. With that elucidation, I now see your point.\n\nI'm positive the arrow design was shared with the client (my recollections of the animation pitch, and all), and I'm fairly sure -- from FedEx's lack of emphasis about it since then -- the client is not eager to make a big deal about it. I don't think that is because they are embarrassed by it, just that they are more focused on getting their brand out there on boxes, envelopes, trucks, buildings, planes, etc.\n\nIf anything, I think FedEx should be praised for their restraint in neither flaunting their cleverness nor succumbing to fad, which I don't think can be said for another overnight delivery service (whose sins have been widely discussed in these pages). On that note, I wonder how FedEx's logo would look if they succumbed to the fads of today? (Apparently, it's already [been decided](http://web.archive.org/web/20131017184930/http:/yh.yayhooray.com/thread/90661/yh-collab:-redesign-famous-logos-in-web-2-0-format?page=1).)\n\nAnd, while we're being serious in here, the people have spoken and not only see the arrow in the FedEx logo, but also a hidden brie spoon, taco and Tony Danza:  \n [http://yh.yayhooray.com/thread/94651/theres-a-hidden-spoon-in-the-fedex-logo?page=1](http://web.archive.org/web/20131017184930/http:/yh.yayhooray.com/thread/94651/theres-a-hidden-spoon-in-the-fedex-logo?page=1)  \nStrange, yes, but I thought it was funny.\n\nCheers!\n\n"
    },
    {
      "time": "11 Sep 2006 — 9:48am",
      "content": "\"so please stop thinking that I hate all graphic designers or something\"  \nhhp\"\n\nOh, I don't know why we would think that?\n\n\"A graphic design agency overly interested  \nin impressing other graphic design agencies.  \nThey can’t however be accused of violating  \nthe norm in this respect…  \nhhp\"\n\n"
    },
    {
      "time": "11 Sep 2006 — 9:54am",
      "content": "Hey, every field has its delusions. Just don't shoot the messenger.  \nIn fact buy him a donut. Chocolate old-fashioned, please.\n\nhhp\n\n"
    },
    {
      "time": "11 Sep 2006 — 9:57am",
      "content": "Another thought, do we ever see the arrow pulled out of the logo in the commercials? Havnt really noticed before...?\n\n"
    },
    {
      "time": "11 Sep 2006 — 10:08am",
      "content": "<cite>do we ever see the arrow pulled out of the logo in the commercials?</cite>\n\nNope. To my knowledge, its never been done, except in the designers' pitch to the client.\n\n"
    },
    {
      "time": "11 Sep 2006 — 10:58am",
      "content": "\"Hey, every field has its delusions.\" hhp\n\nAs every person does.  \nThe belief that one's own view of reality is the only reality is the most dangerous of all delusions.\n\n"
    },
    {
      "time": "11 Sep 2006 — 11:18am",
      "content": "Indeed. And by extension any belief in any reality is delusional (but humans are just like that I guess). Reality, Truth, what gives? Like I really don't get this \"will set you free\" business at all, coz like I've been a US Citizen since the early 90s dude.\n\nhhp\n\n"
    },
    {
      "time": "11 Sep 2006 — 11:40am",
      "content": "I think this thread has ceded ground to Hrant which needn't be - not just yet anyway.\n\nI think that he thinks ( I could be wrong) that the arrow is just a token gesture made to be self agrandizing at the expense of the message/client. That the arrow is either a) useless or b) negative in it's impact on the design.\n\nI don't think there is any basis for supporting these ideas. So why does Hrant think this? A: Maybe he is just utterly type-centric. A sort of type bigot if you will. I can't condem him for that if it's the case. Type is pretty great. But the point is: the opposite feeling is needed in Graphic Design. Type is there to play a role. Sometiomes it's key. Sometimes it ain't.\n\nI think that instead c) the arrow works for the client.\n\nI think the arrow is positive because when someting catches & holds attention it is working for the logo ( as long as the are no negative associations & so on). There are lots of ways of doing this. In the case of the FedEx logo attention is caught by the tension between the immediate resolution of the letterforms as 'FedEx' and then the _potential_ resolution of the arrow. That tension takes time to resolve. So there is more eye-time for the logo. More attention. Put another way the arrow plays the role of a brain/eye magnet. If you resolve the arrow or not isn't the point because it's the tension that holds your eye & so it works. This tension does not dissappear when you have 'seen' the arrow either. You still go back & forth from one recognition to the other. Sort of like the classic old woman and girl image. Except that in the case of the logo the text is clearly dominant whereas in the classic illusion they are balanced.\n\n ![](http://web.archive.org/web/20131017184930im_/http:/typophile.com/files/fig3_4998.gif)\n\n"
    }
  ]
}
