{
  "id": "28103",
  "title": "No showcase forum :(",
  "forum": "Motion / 3d / Experimental",
  "tags": [
    "Motion / 3d / Experimental"
  ],
  "content": "so wondering what your thoughts are on the typography of this site:\n\n[www.springcreative.biz](http://web.archive.org/web/20150317202252/http:/www.springcreative.biz/ \"www.springcreative.biz\")\n\nthanks.\n\n",
  "author": "j_polo9",
  "time": "7 Sep 2006 — 11:15pm",
  "uid": "13221",
  "comments": [
    {
      "time": "8 Sep 2006 — 1:14am",
      "content": "Hi there,.\n\nNot amazing, the font used breaks up when it is in small sizes. My be due to the light weight of it, probably needs bumping up to regular. I think the leading is far too generous within the body copy. Needs tightening a little. The Where Fresh Ideas Grow intro probably needs tighter kerning, the letters read almost more as seperate letters rather than words.\n\nI think the kerning within the body copy is ok, its easy on the eye.\n\nIt is also a simple layout which makes it easier to navigate and know where you are which is a nice thing.\n\nOverall its a nice little site, just needs a few tweaks here and there.\n\nM\n\n"
    },
    {
      "time": "8 Sep 2006 — 1:42am",
      "content": "Hi,\n\n\"Grownig plant\" intro reminds me another great website [El Semillero](http://web.archive.org/web/20150317202252/http:/www.semillero.net/).  \nAfter seeing the intro I miss some floral elements that would unify the main site with the intro.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nAL  \n [www.lenart.pl](http://web.archive.org/web/20150317202252/http:/www.lenart.pl/ \"www.lenart.pl\")\n\n"
    },
    {
      "time": "8 Sep 2006 — 3:05am",
      "content": "There are plenty of Typophiles who can say much more much better than me about your typography.\n\nBut as an interface designer, I've gotta say it: navigation which only functions on rollover (not click) is an absolute disaster. I accidentally switched pages on your site every 0.3 seconds, just because I moved my cursor. Were I you, I'd think real hard about switching to clicks and ditching the rollover gag, esp. since you're presenting yourself as a web designer.\n\n"
    },
    {
      "time": "9 Sep 2006 — 9:48pm",
      "content": "ahh thanks! Sorry I've been out all weekend at a water polo tournament :P\n\n@Matt Squire: Thanks for the ideas, I'll take a look at what I can do.\n\n@aleksander: The client's logo is that leaf shape that was styalized for the intro. But if you have any ideas on how to add some more floral elements to the main site I would love to hear the!\n\n@MattB: Frankly I find your remark condesending. The clients insisted on having actions occur on rollover so I had no choice in the matter. But since we are talking about user friendliness you might want to get you company to use a different flash embed method so that there is no click to activate on you site ;)\n\n"
    }
  ]
}
