{
  "id": "28107",
  "title": "Who should pay for the fonts... client, designer, or both?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "John Stahle's recent post in my [_\"What are your pet peeves about common typefaces?\"_](http://web.archive.org/web/20150218043325/http:/typophile.com/node/28078) thread got me thinking about the whole \"who-ought-to-pay-for-a-freelancer's-type-library\" thing...\n\nOn the one hand, in the past I've built purchasing a family of faces into my fees for some of my freelance projects and then kept the fonts myself... That way I can achieve my design objectives, and I get to use the fonts in future freelance projects.  \n (Win-win for designer and client, of course.)\n\nOn the other hand, I've also built purchasing a family of faces into my fees for other projects and given the fonts to the client along with the deliverables... that way I can achieve my design objectives, and the client gets to use the fonts in future in-house projects (to maintain some brand consistency). (I obviously can't just use these fonts in a future freelance project straight away.)\n\nFinally, on the other other hand (we could all use three!), I have plenty of experience where I've neglected to build purchasing a family of faces into my fees for a project, and then I had to eat the cost in order to achieve my design objectives.\n\nSo what makes the most sense for a freelancer, a) economically, b) ethically, and c) creatively? Does a client who will pay your \"font-inflated\" fee deserve to own the fonts after the project? Or do you?\n\nLet 'er rip.\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n",
  "author": "mwebert",
  "time": "8 Sep 2006 — 4:33am",
  "uid": "4479",
  "comments": [
    {
      "time": "8 Sep 2006 — 4:43am",
      "content": "The client still has to purchase the licence for the correct number of users. You can't 'give' the client the fonts as they aren't your property anyway – You (should) have bought a licence to use them.\n\nNick Cooke\n\n"
    },
    {
      "time": "8 Sep 2006 — 4:47am",
      "content": "That's what I meant, Nick... just using \"bought\" for shorthand. In my projects where the client \"pays & owns,\" I've built in the cost of the requisite licensing as a line item in my estimate, and then I use the font for the design first, delete it from my system, and then they use it. (They are the licensee the whole time.)\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "8 Sep 2006 — 5:01am",
      "content": "You could transfer your license to your client. But when you purchase the license, you are the one \"buying\" the font. You purchase the right to use it on your workstations, which you happen to use to creat work for your client.\n\nWhen you are done with the work, you could transfer your license to your clients, provided that the font's EULA allows this. Otherwise, your client would have to license the fonts on their own. If you transfer the license to your client, you—of course—loose the license, and must therefore delete your copies of the files.\n\nIt is probably best just to have your client license their own copies of the fonts directly from the distributor; most clients will want to use the fonts onmore than 5 computers. If you bough a single license (i.e., for five computers), transfering that license to your client may confuse them, and they might think that they could do whatever they want with these fonts that they got from you (i.e., simply install it on 50 computers).\n\nIf you build in font purchases into your client fees, that doesn't automatically give the client the rights to those fonts. They pay you a fee, which to two of you agree on. What you do with theat money is not their concern. If you use money a client pays you in fees to upgrade to the Adobe CS 2 suite, should you give the client those programs once the project is finished?\n\nEvery designer must make sure that his fees are high enough to allow him to run his businness. Software licenses are a business expense. And fonts are software.\n\n"
    },
    {
      "time": "8 Sep 2006 — 5:12am",
      "content": "Good points, Dan.\n\nI agree that many of us view \"building your own freelance type library\" as just another business expense and thus we just encourage clients to license any fonts they wish to use on their own.\n\nI guess as far as \"cost of goods sold\" there's little difference between CS2, an Aeron chair, a new Mac Pro, and the latest H&FJ release. But I just wondered how people felt about a) padding fees to cover font purchases or b) having the client license fonts, using them as an agent of the client and then deleting them, and then having them be able to use them.\n\n--M.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "8 Sep 2006 — 5:17am",
      "content": "I don't see it as padding. Are any of your other purchses \"padding\"? Why do some designers see fonts as anything different from their other software applications?\n\nA fee is something that a designer sets for himself, based on what he thinks he and his time is worth. Every designer will find some potential clients who find their fees too high. Certain market factors will probably always create an \"average\" hourly rate. A fee is also in part determined by what customers are willing to pay. But a designer does not have to explain why his fees are what they are. Image a client telling you, \"I think that your apartment is too big. How about you move into a smaller place. Then you could cut your fees in half for me, right?\"\n\n"
    },
    {
      "time": "8 Sep 2006 — 5:18am",
      "content": "Sounds like some clients I've had. :-)\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "8 Sep 2006 — 6:54am",
      "content": "Well, you might be hired to do a project on a certain financial basis, and only then find out that the client expects you to use a certain family of fonts to match their visual identity -- in which case it would be reasonable to then ask the client for the cost of your new licences. Arguably, even if you already happen to own those licences.\n\n"
    },
    {
      "time": "8 Sep 2006 — 7:10am",
      "content": "If the client requires a particular font it is certainly their responsibility to pay for it.\n\nBut... here's where I don't understand EULAs - if the client gives you the font to use just for that project and you delete it when you're done, do they need to pay for a new license for you, the designer, if it's only temporary and you're not keeping the font?\n\n"
    },
    {
      "time": "8 Sep 2006 — 7:41am",
      "content": "Actually, I don't think that they can give you the font at all, at least under most EULAs. Rather, you need to license the font for yourself, even if you are only going to use it for just a little while! You're still using it, aren't you? A license is required for use.\n\nThis takes us back to budgeting and billing… if a client requests that you use a font for the project, that license has to be paid for somehow. It is the same with the client. If he has 57 computers in his office, or 5700 computers, then he has a license for using the fonts on those computers. Unless he has a special license, that license normally won't allow him to install the font on another computer in an external location… that's what he'd be doing if he \"gave\" you the font (even for just a little while).\n\n"
    },
    {
      "time": "8 Sep 2006 — 7:59am",
      "content": "The client always pays, that's how you survive with a profit. ;o)\n\nWhether you make it a line-item on the bill is your call.\n\nTypically, we'd usually include the cost of our license for the font into the project, and then let them know that if they want their own licenses (for internal maintenance) that we can bill them separately for that.\n\n"
    },
    {
      "time": "8 Sep 2006 — 9:52am",
      "content": "If you, as a graphic designer, are fortunate enough to have clients who will install the fonts in your design work on a multi-user network, then you should be able to acquire all the fonts you want, free of charge, on a \"test purposes only\" licence, from foundries such as my own.\n\nIf the carrot is \"my client will install the font family of my corporate design for them, on 500 terminals\", I'll bite. Another beautiful feature of this arrangement is that you ask your client to license the fonts directly from the foundry: they appreciate that you aren't marking it up, and the foundry doesn't lose a percentage of the fee to a distributor.\n\n"
    },
    {
      "time": "8 Sep 2006 — 10:00am",
      "content": "I suppose the next question (or perhaps the question Michael was getting at) is how common is it to build the price of 2 separate licenses into a contract (assuming, for this example, a single-user licence each for the client and designer)?\n\nLet's say a given font costs $50 for a single-user license (one location). The _designer_ selects a font for use in a project (that he/she _doesn't_ already have a license for) and the client agrees they like and want to use the font (and will need a copy for future use). Licenses for both the designer _and_ the client now must be purchased. So, how common is it for the cost of _both_ licenses to be built into the project price (either listed or buried)?\n\nI'm no accountant, but this decision seems to play into income/expenses. If the cost for the designer's license is built into the project fee, then the license can not be written-off as an expense (against taxes). If the license is _not_ built into the fee, then it _can_ be written-off as an expense. Obviously the better \"deal\" is to get the client to foot the bill, but that's my question really: How common is it to shove this expense to the client?\n\n[Edit: I just realized aluminum's reply directly addressed my query, but I'm still curious to hear from others...]\n\n[Edit: I've also just realized that regardless of how the contract is written up, it is still the designer who is paying for his/her own license, it's just a matter of charging more if the designer's license is built into the design project contract. In any case, the designer will need to hand money over for his/her own font license, and depending on whether they did or did not build that cost into the design contract they will be left with more or less of the contract fee at the end of the day. Therefore, it seems my question is totally moot. I can stop talking (typing) now...]\n\n"
    },
    {
      "time": "8 Sep 2006 — 10:14am",
      "content": "I've missed the meat of this discussion. Dan answered all the questions as I would have.\n\nIf you license a typeface to use in a project (with a non-transferrable EULA) then you must also instruct your client to license a copy if they have need to use the same fonts on given files, such as templates. This is how I do it. I don't hide the cost and I don't \"pad\" the project. Also, as Dan mentioned, most foundries do not have licenses which allow for transferring, so if you are going to go the route of licensing type, using it, sending to the client and deleting from your machine, make sure you are aware of this fact.\n\nWhen I license any type I see it as putting another tool in my toolbox which I'll more than likely be using again. I don't see it as something the client necessarily has to pay for.\n\nI do turn all of my font costs over to my accountant every year though.\n\n"
    },
    {
      "time": "8 Sep 2006 — 11:16am",
      "content": "A question or comment as a design student. . . Our school has a selected library of typefaces all built into suitcase on each lab computer. At the Academy, you can use and are reccomended to have quite a large inventory of typefaces. Where does the line get drawn? Our work is purely of the experimental kind, being students, and the work is not being published in the sense that a freelancer would his or hers. . . Do type designers take into mind students like us, perhaps offering free student packages of typefaces (similiar to student discounts on the various Adobe programs) I would certainly love to use some of the lovely designs out there with total incentive to pay for them when using them in hopefully many designs to come. . .\n\nAny thoughts or comments?\n\nCheers\n\n"
    },
    {
      "time": "8 Sep 2006 — 1:25pm",
      "content": "I was once a student and I do empathize with you James. So please don't take this as preaching. But the problem with giving students free fonts is that those same students do become designers and take those fonts they've \"collected\" at school with them to the agencies where they are hired. (I'm generalizing, but it is mostly true.)\n\nThere are some foundries that do offer student discounts, or have student priced packs. But, very few foundries give fonts for free to students. One thing to keep in mind are the books such as [Indie Fonts](http://web.archive.org/web/20150218043325/http:/www.p22.com/indiefonts/indieset.html) which have oodles of fonts in them that you can use. Many of the license with those fonts (if not all, I'd need to check to verify this) even allow commercial use.\n\nAnother foundry, [Underware](http://web.archive.org/web/20150218043325/http:/www.underware.nl/site2/index.php3?id1=fonts), sell specimen books which contain the entire font which is shown in said book, and the license specifically says that students can use them.\n\nKeep your eye out for foundries that offer free downloads. [FontShop](http://web.archive.org/web/20150218043325/http:/www.fontshop.com/), for instance, offers a free font for download at least once a month.\n\nOur wiki has an entry dedicated to [free fonts](http://web.archive.org/web/20150218043325/http:/typophile.com/wiki/FAQ_Free).\n\n[FontLeech](http://web.archive.org/web/20150218043325/http:/fontleech.com/) has links to valid free fonts.\n\nThe problem with anything free in life is that someone had to pay for it somehow. If a foundry offers a font for free, they still put the time in creating it. But, they also know that students are future business so I wouldn't avoid asking them. You never know, they might have student pricing.\n\n"
    },
    {
      "time": "8 Sep 2006 — 2:28pm",
      "content": "I think foundries should consider the same kind of student discount that other software companies offer: a reduced price with proof of enrollment. It's not a giveaway, the student who cares about having quality type can afford it, and the goodwill is in place for the student/new designer to continue purchasing from the foundry. Maybe the discount could continue for 1 year after graduation. I know I still couldn't afford type for a while after I graduated.\n\nThat really is a different topic, a good one.\n\nFonts are part of the working expenses/toolset of a graphic design shop. The clients, on some level, have to pay for them. Isn't there a way for a design shop to budget for fonts each year and build those costs into their general charges? Like expensing the cost of new computers over a number of years.\n\n"
    },
    {
      "time": "8 Sep 2006 — 11:07pm",
      "content": "Linotype offers a 30% student discount: [http://www.linotype.com/2158-16993/linotypeadvantagesdiscount.html?PHPSE...](http://web.archive.org/web/20150218043325/http:/www.linotype.com/2158-16993/linotypeadvantagesdiscount.html?PHPSESSID=e81e2bf562fe0c4b004d94ae2e40dbb8 \"http://www.linotype.com/2158-16993/linotypeadvantagesdiscount.html?PHPSESSID=e81e2bf562fe0c4b004d94ae2e40dbb8\")\n\nT-26 has a student discount as well, as far as I can remember, but I cannot find a link to a page on their site that states that.\n\n"
    },
    {
      "time": "9 Sep 2006 — 6:25am",
      "content": "I completely understnad where you are coming from. I have purchased a few standard sets of must haves, with the idea in mind that perhaps one day I will be on the other side of the desk. . . creating the typeface.\n\nI watch and research a lot of typefaces and find that most of the \"free fonts\" out there are rubbish. I am far more willing to pay for top shelf liquor rather than the S\\*\\*t they pour from the well (if you catch my alcoholic analogy)\n\nCheers\n\n"
    },
    {
      "time": "9 Sep 2006 — 6:39am",
      "content": "James:  \nAre you aware of this Adobe offer?  \n [Type Classics for Learning.](http://web.archive.org/web/20150218043325/http:/www.adobe.com/education/products/typeclassics.html)\n\n"
    },
    {
      "time": "10 Sep 2006 — 9:34am",
      "content": "If I find that I have to buy a font for a project, I won't add the price to the bill. After all, I'm likely to use the font in some other project in the future. Sometimes, especially with expensive fonts, I don't buy the whole package, but just a few, like a regular and a bold, depending on the case. The price of fonts are business expenses, like any software, and are looked upon kindly by the tax man.\n\n"
    },
    {
      "time": "12 Sep 2006 — 7:23am",
      "content": "Only a few minutes ago I posted a question which seems to be (partly) addressed in this thread, which got my attention just now. I’m new to Typophile, so excuse me for cross-posting. My question is under [http://typophile.com/node/28180](http://web.archive.org/web/20150218043325/http:/typophile.com/node/28180 \"http://typophile.com/node/28180\"), probably the wrong forum as well. The second part has already been answered in full. I’d still like to hear your opinion on the first part:\n\n“Font licenses, in general, prohibit adaptation of the font files, and of the glyphs and artwork included therein. Furthermore, the user is not allowed to redistribute the font by embedding or packaging it into another format. Now, how could a logo designer use such a licensed font, if he’s supposed no to tweak nor adapt its glyphs so as them to meet the corporate identity with which the logo has to conform? Additionally, even if the glyphs were not to be modified, how could the designer supply his customer with ready-to-use .pfd, .eps, .tiffs, .jpeg files with the font glyphs embedded, or even converted into outlines?”\n\n"
    },
    {
      "time": "12 Sep 2006 — 7:58am",
      "content": "\"I’d still like to hear your opinion on the first part\"\n\nLike most EULA's, it sounds insanely restrictive.\n\n"
    },
    {
      "time": "12 Sep 2006 — 8:25am",
      "content": "Designers bill their overhead into their hourly rate. They also may bill line items purchased for that particular job. When you get a font and pay from your overhead, you are not giving the client your liscence to use it. The client has purchased a completed job (brochure, book, whatever). If you are establishing a corporate identity which will involve the client using the fonts directly, then this should be a line item cost for their own font liscence.\n\nChrisL\n\n"
    }
  ]
}
