{
  "id": "2811",
  "title": "Font weights and font weight scaling",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Does anybody have any sources for the theory behind exponential or ( or interpolation curve) font weight scaling?   \n   \nDoes anybody use mathematical formulas for determining a weights up or down?   \n   \nDoes anybody have anything good to say about linear font scaling?   \n   \nDo you think that theories can't be trusted & only the eye can tell?   \n   \nWhat am I talking about? Go to [http://www.lucasfonts.com/](http://web.archive.org/web/20131019214552/http:/www.lucasfonts.com/) and follow the links to 'font families' & 'the sans' & then 'info & samples' & then 'interpolation curve'. He even offers some formulas for making weights.   \n   \nWhat do you think is the limits are of the genuinely useful weight range? I got thinking about this because I was reading (in [www.daidala.com?](http://web.archive.org/web/20131019214552/http:/www.daidala.com/)) that Jean-Fran\n\n",
  "author": "ebensorkin",
  "time": "22 Jan 2004 — 5:50pm",
  "uid": "2942",
  "comments": [
    {
      "time": "23 Jan 2004 — 11:51pm",
      "content": "Nobody's taking this?   \n   \nhhp\n\n"
    },
    {
      "time": "24 Jan 2004 — 6:13am",
      "content": "If the weights look good, they are good.\n\n"
    },
    {
      "time": "24 Jan 2004 — 11:52pm",
      "content": "James, I agree with you as far as perception is concerned. But thats where it ends. Think of the labour. There is more to this issue than just thinking: 'There it is! I have a nice set of weights.'   \n   \nObviously if you are making two or three faces for a font then you may be able to wing things a bit - but what about 20 weights?   \n   \nYou might want to try to automate production. Then check results of course. (I am not advocating using blind dogma to replace the evidence of your senses) You might save maybe 100 or even 1000+ hours of work! Also you might have more time to critically look at the work - as opposed to slogging away.   \n   \nAlso, a theory which explains why something looks good & is helpful in general is worthwhile to know about - even if you decide to leave it behind for some reason another. Ever heard of the 'golden mean'? I don't think it's the be all & end all. But it can be helpful in some cases.   \n   \nI will post some experiments I have done over the next few days & explain my current & probably naive thinking a bit more.   \n   \nIf only I had more math in highschool!   \n   \nHrant? Surely you have ideas about this? :-)\n\n"
    },
    {
      "time": "24 Jan 2004 — 11:59pm",
      "content": "_Is anybody making new font weights using python scripts for in Font Lab?_    \n   \nI'll sometimes do this to rough out a weight. Generally, I'll start with a single weight, use Python to extrapolate bold and light versions, and then make these axis extremes for a Multiple Master font. The results are pretty messy, and not useable for final fonts, but the MM font is useful for guaging basic stems and trying different weights.\n\n"
    },
    {
      "time": "25 Jan 2004 — 5:59am",
      "content": "Eben,   \n   \nYou asked the question, I gave an answer. And personally \"There it is, I have a nice set of weight.\" Is the only issue.   \n   \nAs far as the labor, I have done and continue to do the labor. Have you? Maybe what you are really seeking is a way out of all the labor.   \n   \nIf you build a proper font MM database you don't need an underlying theory, just you eyes, and a problem that needs solving.   \n   \nI have never trusted any theory that explains why something looks good.   \n   \nNot only am I sure Hrant has an idea about this. He no doubt has his own name for the process.\n\n"
    },
    {
      "time": "25 Jan 2004 — 1:49pm",
      "content": "\"Before I invent something, I need a good name for it\", some famous guy once said. But even though I actually haven't \"invented\" any ideas about optimal weight gradations (yet), I still don't have a name for it either! :-)   \n   \n--   \n   \nEben, keep asking (and I don't mean me).   \n   \nhhp\n\n"
    },
    {
      "time": "25 Jan 2004 — 5:07pm",
      "content": "John, That helps alot - I had a feeling that there might be a way to steamline the process of looking & comparing the possibilities - even if it doesn't give finnished results.   \n   \nDo you have any suggestions for sources of python scripts?   \n   \nAn aside about MM fonts: I think that MM instances are generated using a linear process. When you make a MM font you have to decide as the maker where the 50% mark is & if you will have additional defined midpoints & if so, where they are - which lets you establish a sort of curve. Not a true curve but something more like one.   \n   \nAs a user of MM font you have to generate a font & decide what values it will have and if the maker has only two extremes & no strategically placed midpoints built in to cause sort of psudo curve then you might think a 75% value is going look like 75% - which it isn't. Linear scaling does not equal optical scaling.   \n   \nI'll talk more about that in another posting because I see MM as (maybe) flawed when it comes to generating weights in a purely theoretical sense both with & without midpoints because it is a linear process.   \n   \nThere is more to this but I am going to hold off for now. MM per se is really a side issue & not too important in a practical sense at this point.   \n   \nJames, Sorry if I came off as snotty. I didn't mean to be. I just thought your answer was incomplete. I see now that theory isn't your thing. Fair enough. I don't 'trust' theories either. I don't reject them out of hand either. Dogma is a bad thing because it closes your eyes to your own authentic aethetic perception. Dogam about rejecting all theories is equally dubious in my opinion.   \n   \nAm I seeking a way out of \\*all\\* the labour? No.   \n   \nSome of it? - Definitely.   \n   \nIf I dig a ditch I might choose a shovel rather than a spoon. Does that make me less nobel or my ditch less good because it took me 3 hours vs. 6 days to dig my ditch?   \n   \nI want to avoid the drudgery that computers are good at so I can do what I hope am good at - looking & judging.   \n   \nIn the end I think you are right that the eye has the be the final arbiter. I am admittedly new to this. I see that you are not. (Nice stuff BTW).   \n   \nI also see how doing most things yourself by hand & not leaving it to machines is the only way to make really solid wothewhile stuff in nearly every case - even when making something like a handwriting font from scans.   \n   \nOn the other hand if I can look at lots of sets of weights made with different equations (& therefore different weight curves) then I imagine I can do a better job of making multiple weights - particularly if there are lots & lots of weights.   \n   \nQuite apart from whether you want math in your font process - you could talk about which model of weights looks better to you; Porchez, DeGroot, someone else, or maybe your own weight system. And you could talk about why you think that. You could talk about how you decided to make the weights you made for Alfon.   \n   \nYou could talk about really skinny or fat fonts & why you don't make them - or haven't so far from what I can see on your web site.   \n   \nThis kind of info could be seen as a trade secret too I suppose...   \n   \nHrant,   \n   \nDo you work in multiple weights much or are you concerned with middle/normal weight forms for the most part?   \n   \nAll, sorry this entry is so long winded. When I post some examples & test images with the formulas behind them I am sure they will clarify what I am after & why better than my typing here has for the past two postings.\n\n"
    },
    {
      "time": "25 Jan 2004 — 7:51pm",
      "content": "There was a very illustrative post about weight gradation written once (if I don\n\n"
    },
    {
      "time": "25 Jan 2004 — 10:45pm",
      "content": "Here is the first of the examples: Jonathan Hoefler's Gotham   \n   \nCaptured from: [http://www.typography.com/catalog/gotham/index.html](http://web.archive.org/web/20131019214552/http:/www.typography.com/catalog/gotham/index.html)   \n   \n ![](http://web.archive.org/web/20131019214552im_/http:/www.typophile.com/forums/messages/4100/24902.gif)\n\n"
    },
    {
      "time": "25 Jan 2004 — 10:51pm",
      "content": "Here is the second example. Taken from Lucas De Groot's site:   \n   \n [http://www.lucasfonts.com/indexneu.html](http://web.archive.org/web/20131019214552/http:/www.lucasfonts.com/indexneu.html)   \n   \n ![](http://web.archive.org/web/20131019214552im_/http:/www.typophile.com/forums/messages/4100/24905.gif)\n\n"
    },
    {
      "time": "25 Jan 2004 — 11:21pm",
      "content": "Here is the 3rd image it is of Anisette from Jean-Fran\n\n"
    },
    {
      "time": "26 Jan 2004 — 1:57am",
      "content": "What I have done so far to make sense of this issue is to take the sample I found on the De Groot page (See above with the arrows) & measure the density of pixels that compose the arrow's horizontal lines. A black pixel is 100 units & grey one might be worth between 1 & 99 units. Two black pixels measure as '200'.   \n   \nWhen I had estimated relative widths I looked for a rule or equation that could describe & predict the changes that I saw from the thinest to the thickest.   \n   \nThe rule that seemed to be used for weight increase was: take 1+1/3 of the weight of a charcter add it to get the target weight of the next charcter. In excel the formula is =Cx/3+Cx where C is the column & x is the number of the starting weight.   \n   \nIn this way 21 is converted to 28 & so on. Not all number convert cleanly like this. For instance 28 becomes 37.33333...   \n   \nBecause points in FontLab or Fontographer do not come in fractionally numbered positions some rounding must be done and an ideal curve/formula would therefore:   \n   \n- Provide a pleasing optical 'one step' increase.   \n   \n- Provide numbers that either were either whole or were as close to a whole number as possible eg 1.1 (1)is better than 1.4 & 1.9 (2) is better than 1.5.   \n   \n- Provide a whole pixel em unit number at 9 or 12 points or whatever screen size you might be targeting. For the font I am working on now ( monoline ) that would be 100 em units for a target of 9 pixels on screen. This last point is irrelevant if you are making a font with no focus on screen rendering such as a display face.   \n   \nThe em units I calculated using my hypothetically 'De Groot style' curve & 1 as a base with every 2nd number sampled starting with 1 are   \n   \n1,2,3,6,10,18,32,56,100,177,315   \n   \nThese are also the rounded or clean numbers. The unrounded mathematical result is:   \n   \n1   \n1.333333333   \n1.777777778   \n2.37037037   \n3.160493827   \n4.21399177   \n5.618655693   \n7.491540924   \n9.988721232   \n13.31829498   \n17.75772663   \n23.67696885   \n31.56929179   \n42.09238906   \n56.12318541   \n74.83091388   \n99.77455184   \n133.0327358   \n177.3769811   \n236.5026414   \n315.3368552   \n   \nProbably none of these numbers match the Thesis fonts exactly either in terms of their actual ratios to each other. If I have sussed the formula he used that would be interesting especially since it yeilds mostly nice #s. I like the fact that it yields a 10 & a 100 for instance.   \n   \nHere is what the rule/formula looks like as a curve charted in excel:   \n   \n ![](http://web.archive.org/web/20131019214552im_/http:/www.typophile.com/forums/messages/4100/24914.gif)   \n   \nHere is the same formula rendered to screen using a cross & circle as examples. I have4 used weights 1-177 for 10 weights:   \n   \n ![](http://web.archive.org/web/20131019214552im_/http:/www.typophile.com/forums/messages/4100/24915.gif)   \n   \nMy reaction to this curve is that it emphasizes the light & dark too much in 10 steps. A flatter curve would be better. The steps do feel even though - that much is good. A smaller fraction than 1+1/3rd might give better results. It would be nice to sample every number too. It might be better to start with 2 or 3 or even 5 rather than 1. These are the ideas I will be testing next.   \n   \nIt seems like a golden mean ratio could be tried too. I have to look into it.   \n   \nIf I owned thesis I could measure it directly - but I don't. As you can see it wasn't really crucial to know what he did exactly to be able to start experimenting. I am not sure I like his formula so well that I would want to use it in any case. I mean I really like & respect his stuff, but Porchez may have something in that crit.   \n   \nAlso I'd rather work out my own rationale. It more fun, it's valid intellectual property ( if I was keeping it to myself ) and maybe it's even a noble kind of labour or something like that.   \n   \nBTW : DeGroot actually provides three equations on his site but I have not been able to make anything out of it so far. If anbody else can explain them please let me know!   \n   \nI will do some additional experiments and post them if folks are interested - especially if I make something I like.   \n   \nI could also post the my excel sheet somewhere if it could help anybody work out formulas/weight curves they like.   \n   \nDoes my original question make better sense now? Am I just nuts?   \n   \nDo you think a split curve would make better sense or give better results? eg: One curve for the bolds & one for the ligher weights with a normal weight in the middle. If you think so, why?   \n   \nThanks!\n\n"
    },
    {
      "time": "26 Jan 2004 — 4:18am",
      "content": "Check out this thread   \n   \nTypophile Forums\n\n"
    },
    {
      "time": "26 Jan 2004 — 5:31am",
      "content": "\\> BTW : DeGroot actually provides three equations on   \n\\> his site but I have not been able to make anything   \n\\> out of it so far. If anbody else can explain them   \n\\> please let me know!   \n   \nActually it's only one equation, in different 'arrangements'.   \nI don't know what you want to be explained, I think it's   \npretty simple.   \n   \nIn any case, I've applied his equation to some of your data,   \nand it's surprising. For example:   \n   \nYour data:   \na = 1.333333333   \nb = 1.777777778   \nc = 2.37037037   \n   \nResult from De Groot's equation b = sqrt(a\\*c):   \nb = 1,777777777   \n   \nAnother try, your data:   \na = 74.83091388   \nb = 99.77455184   \nc = 133.0327358   \n   \nDe Groot's equation:   \nb = 99,77455184 !!!\n\n"
    },
    {
      "time": "26 Jan 2004 — 6:10am",
      "content": "H\n\n"
    },
    {
      "time": "26 Jan 2004 — 6:37am",
      "content": "I don't have read all this page, but what I can say is it more simple than formula and so on. Each new font require different way, just because the contrast is variable and some have Serifs, others not. Some need to be used in small size, so large counters in Black when others mostly for display.   \n   \nDon't miss also that a real letter is not just a + or a circle.   \nWhen designing a Black, I say BLACK not b l a c k as in many case, most of the job is to achieve the perfect visual weight, not the mathematical weight: So a g lc will be very different than n. Same for the horizontal of a B or E compared to vertical of a N, etc.   \n   \nAnd in Thin weight it will be more mathematical adjustment, as less contrast by definition.   \n   \nSo, when you interpolate such extrems, your regular or demi can suddenly appear to contrasted when x an y interpolation are same values. So, again some adjustment need to be made.   \n   \nNot also that an interpolate curve is not straight, the regular between thin and black is not at 50%!   \n   \nHere after some adjustement made for Anisette intermediate weight.   \n ![](http://web.archive.org/web/20131019214552im_/http:/www.typophile.com/forums/messages/4100/24926.gif)\n\n"
    },
    {
      "time": "26 Jan 2004 — 9:14pm",
      "content": "Maybe then the post was made by John Hudson.\n\n"
    },
    {
      "time": "26 Jan 2004 — 9:37pm",
      "content": "No, it was... James!!   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2004 — 1:49am",
      "content": "Hrant, Where was James' post? The one I referred to earlier?   \n   \nJean Porchez, thanks for looking in!   \n   \nI hope you have time to look closer at my arguement later. If you have anything else to say I would love to hear it - especially anything theoretical in nature, even it turns out that you, like James, reject outright using any sort of theory or math to design fonts.   \n   \nActually, I think I can prove my basic point about curves in general if only because DeGroot clearly used a formula to make some \\*really\\* nice fonts & clearly didn't use some sort of crude global process as James assumed I was inquiring about.   \n   \nMaybe, if I am fortunate, I can find a better curve than De Groot did & show how an improved curve can work to make something really nice & really functional.   \n   \nActually, I think finding a better curve will probably be easy. Applying that curve in a sensitive, inteligent & inspired manner will probably be much, much harder.   \n   \nUsing a formula for a major element such as acenders will probably be straightforeward. A modified set of formulas could probably be developed to handle many other aspects of develping a bold ( or light) face. Maybe a different curve can or should be invented for altering each major aspect of a font. I don't know if I will do it - but that it is possible to do & that some mathematical process' can help a typographer's initial process' both seem obvious to me now.   \n   \nI still wonder which aspects of DeGroot's face were subject to his formula. Maybe all of them were - in some way. Maybe he will enlighten us. Wouldn't that be excellent?   \n   \nI'll post to this thread if I find anything in my experiments that seems useful.   \n   \nIf anybody owns a license to a thesis series font & can hypothesize about the weights work for different aspects of the fonts that would be fun to hear about!\n\n"
    },
    {
      "time": "27 Jan 2004 — 3:42am",
      "content": "Well, without try change original Luc[as] view about his own theories: I have the feeling that the interpolation theory he published in 1995 (I remember clearly when he gave it to me during ATypI Barcelona) on his Thesis specimen is more a non serious thing and nice illustration than anything else. It need to be in the context of the specimen, nothing more and that case, the theory illustration work.   \n   \nBuilding mathematic methods and systems for typeface design is a really a funny idea! Sound building mathematic theories for Jasper Jones projections (positions in spaces) or Picasso drawings (relationship of the sizes of eyes and mouths).\n\n"
    },
    {
      "time": "27 Jan 2004 — 5:47am",
      "content": "JFP's post with Anisette sums up the reality of this   \nsituation. The Black is usually very different than   \nthe thin. For instance, compare the shared stroke   \nweights on a black to that of a thin. It's common to   \nslightly reduce the stroke weight on letters like e and a   \nin the black but not in the thin. These irregularties will   \nin turn create less than perfect interpolations. This is   \nwhere the labor comes in! I recomend coffee   \nin the mornings followed by green tea in the afternoons ![:-)](http://web.archive.org/web/20131019214552im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nRecently I've been using MM to create my intermediate   \nweights. I've had much better results than just a Blend.   \nI'm not actually making MM fonts, just using MM to   \ndefine the weights.\n\n"
    },
    {
      "time": "27 Jan 2004 — 6:24am",
      "content": "I share Eric's observations on creating accurate interpolations between Extra Thin and Black.   \n   \nFor that reason, I usually created the Xtra Thin and the Black separately and use less extreme masters for any interpolation. This started by creating heavy weights that were ultimately not heavy enough, and using extrapolation to create the beginnings of a black weight.   \n   \nThis extrapolation also helped create very light weights. I say helped because extrpolated outlines need a lot of additional labor to look good.\n\n"
    },
    {
      "time": "27 Jan 2004 — 8:49am",
      "content": "I guess [this](http://web.archive.org/web/20131019214552/http:/www.typophile.com/forums/messages/4100/14103.html?1060892227#POST25607) is what you guys are looking for.\n\n"
    },
    {
      "time": "19 Mar 2007 — 1:40pm",
      "content": "this is totally brilliant\n\n"
    },
    {
      "time": "19 Mar 2007 — 1:43pm",
      "content": "What is? The thread or a link?\n\n"
    },
    {
      "time": "29 Jan 2008 — 9:45am",
      "content": "Hi,  \nI found this post by searching the web, hope no one minds.  \nI have very bad eyes and can see well when fonts are very very small, thin, dark, curved and spaced; any suggestion is appreciated.\n\nThanks You in advanced,  \nJoseph\n\n"
    },
    {
      "time": "29 Jan 2008 — 10:35am",
      "content": "Hi Joseph,  \nI advise you to [start a new thread](http://web.archive.org/web/20131019214552/http:/www.typophile.com/node/add/forum/4) for your concern; as this one is 1) quite old and 2) about font production methods. I presume you are not interested in that – but what do I know?  \nF\n\n"
    }
  ]
}
