{
  "id": "2812",
  "title": "Define \"typography\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "hi,   \nmy name is roy and i study typo at cooper union in nyc. for a project i just wanted to ask you guys how do you define \"typography\"? what is it for ya?   \nthanx !!\n\n",
  "author": "roy_rob",
  "time": "22 Jan 2004 — 8:15pm",
  "uid": "2944",
  "comments": [
    {
      "time": "23 Jan 2004 — 9:44am",
      "content": "In simplest terms, typography is design with type.   \n   \nHowever, I think the value of typography is best appreciated in relation to text, so my working definition is 'Typography is the application of design to the articulation of text'.\n\n"
    },
    {
      "time": "23 Jan 2004 — 1:37pm",
      "content": "Typography is the making of images from type.   \nAnd also:   \nTypography is an image made from type   \n   \nSome people would add an adjectival qualifier \"artistic\" or \"pleasing\", to differentiate Typography from mere typesetting. But this muddles the definition, because such value judgements are subjective: one person's typography is another's typesetting, and vice versa.   \n   \nAnd this is what John has done with the concept of \"design\". Who is to say whether a piece of typography has been designed? -- unless of course all typesetting is designed, because \"you cannot not design\".   \n   \nConsider the typography you are now reading. In a sense, I am the designer, but so is the site designer, and also the end user who stipulates browser preferences: we all have some say in the determination of typographic variables such as font, size, paragraph leading, punctuation style, even aliasing. On the Internet: the Post-modernity of multiple authorship.\n\n"
    },
    {
      "time": "23 Jan 2004 — 2:59pm",
      "content": "hi nick,   \nwell don't you think that we need to include a say about the function of typography? its relationship with a massage... or maybe the craft side in it?\n\n"
    },
    {
      "time": "23 Jan 2004 — 3:05pm",
      "content": "I'm not touchin' this thread with a 10-foot composing stick... :-/   \n   \nhhp\n\n"
    },
    {
      "time": "23 Jan 2004 — 4:50pm",
      "content": "\\>its relationship with a massage   \n   \nRoy, I'd rather discuss some of the issues raised by my post, rather than go off at a tangent.\n\n"
    },
    {
      "time": "23 Jan 2004 — 5:03pm",
      "content": "Nick, I don't think the word design constitutes a 'value judgement'. Design is an activity, or more accurately a collection of activities, and in my understanding this includes what might be termed micro-typographic aspects of 'mere typesetting' such as the decision about how much space to put on between a letter and a following punctuation mark.   \n   \nI'm not keen on your term 'image', because it seems to overemphasise the whole to the detriment of a proper consideration of the parts. Again, this is not about value judgement, but whether one focuses on the product of typography as a key to its definition, or on the process of typography. Probably both approaches are valid.   \n   \nThe idea of 'articulation of text', which is central to my working definition, does imply a value judgement, because it suggests a measure of the success of any piece of typography -- or act of typography, if I were really to stress the process -- relative to a text. This is why it is a _working_ definition, and different from my simpler definition: design with type. The working definition tells you something about the kind of work I do.\n\n"
    },
    {
      "time": "23 Jan 2004 — 5:39pm",
      "content": "John, I agree with you that the word design does not literally constitute a value judgement. However, in practice much professional typography, especially at the high end, is done by (graphic) designers. So to use the term \"design\" in a definition is problematic -- it suggests that there is some aspect of professionalism involved, when that is not a prerequisite to making typography.   \n   \nI can see what you're getting at with \"articulation\", but it's surely necessary to include the word \"image\", because as it stands, your definition could equally apply to \"text to sound\".\n\n"
    },
    {
      "time": "23 Jan 2004 — 10:30pm",
      "content": "Generally, when I say text I mean something written. The idea of 'oral text' is problematic in this regard, but can be ignored unless specifically talking about oral literature. I don't have much time for the more extreme post-modern thesis that anything can be regarded as a text, not least because it imposes an ideological primacy of writing that I think is wrong.   \n   \nHowever, in the interest of seeking a genuine synthesis of our ideas, I'd happily include the word 'visual' in my definition, e.g. 'The application of design to the visual articulation of text'. Or, to simplify further, and remove that word design which is troubling you, one could forumulate a working definition of typography simply as 'the visual articulation of text'.   \n   \nI dislike the term 'image' because it suggests a visual whole which is presented 'all at once' -- as a painting or a photograph -- and not a text, which is a thing that you move through temporally. The image of typography is its most superficial aspect. I also think there is a tyranny of the image in much contemporary design, especially in North America, and a corresponding lack of regard for text. This is evident from the pages of 'typography' annuals, in which one sees few examples of type that is not sitting on top of or adjacent to a photograph, illustration, or other image, and usually subservient to it. This attitude has its ideological expression in Bruce Mau's statement 'Heaven is a place without text'. Wanker.\n\n"
    },
    {
      "time": "24 Jan 2004 — 10:38am",
      "content": "Hrant's right,   \n   \nIt's a sticky wicket.\n\n"
    },
    {
      "time": "24 Jan 2004 — 3:07pm",
      "content": "_In simplest terms, typography is design with type._   \n   \nThat would be a fine definition, but it would need to be complemented   \nby a definition of\n\n"
    },
    {
      "time": "24 Jan 2004 — 6:24pm",
      "content": "\\>\\>This attitude has its ideological expression in Bruce Mau's statement 'Heaven is a place without text'. Wanker.   \n   \nOh really? I have suddenly lost a lot of respect for Mr. Mau.   \n   \nRoy, you do realise that this is a very hard thing to explain. My dad had only just realised what fonts are, and that I like to make them. This took a couple of months to explain. I actually find it very difficult to explain/define type design, let alone typography. But, (in part) typography is a visual transcription of lanquage. Sometimes.\n\n"
    },
    {
      "time": "24 Jan 2004 — 6:25pm",
      "content": "oops\n\n"
    },
    {
      "time": "24 Jan 2004 — 6:31pm",
      "content": "As I mentioned, 'articulation of text' is a _working_ definition, which doesn't claim to be exhaustive. I think it is appropriate to the majority of typographic work, and certainly to the kind that most interests me, but there are of course uses of type in which text is secondary to the overall image or, less often, in which text is not a factor at all. To encompass all this, a more general definition is necessary.   \n   \nAs regards a definition of type, I think you would need to include the prefabricated and reusable nature of type that distinguishes it from chirography and other unique, manual expressions of written forms. At TypeCon last year, Allan Haley gave a talk on what he called 'non-font typography', by which he meant hand-lettering in a graphic design context. He showed some nice work by various people, but his terminology was a mess of misconceptions: hand-lettering is not typography, non-font or otherwise.\n\n"
    },
    {
      "time": "24 Jan 2004 — 6:36pm",
      "content": "\\> he called 'non-font typography'   \n   \nIt's a good thing I wasn't there...   \n   \nhhp\n\n"
    },
    {
      "time": "24 Jan 2004 — 6:41pm",
      "content": "\\<digression\\>   \n   \n_I have suddenly lost a lot of respect for Mr. Mau._   \n   \nAvowed textist Dean Allen [annotated](http://web.archive.org/web/20140804040157/http:/www.textism.com/maunifesto/) Mau's 'Incomplete Manifesto for Growth' a couple of years ago. It bears rereading.   \n   \n\\</digression\\>\n\n"
    },
    {
      "time": "24 Jan 2004 — 10:08pm",
      "content": "Like Tibor Kalman, Mau is a great conceptionist and a very sexy writer. Im not always too hot on the actual graphic work of both (although there are some beautiful gems in there), but their thoughts on graphic design and the social role of design are absolutely inspiring. Kalmans Perverse Optimist retrospective is beautiful and so is Mau's LifeStyle, especially for the opeining sequence and for the included Manifesto for Growth, which is just plain fun.\n\n"
    },
    {
      "time": "24 Jan 2004 — 10:08pm",
      "content": "Like Tibor Kalman, Mau is a great conceptionist and a very sexy writer. Im not always too hot on the actual graphic work of both (although there are some beautiful gems in there), but their thoughts on graphic design and the social role of design are absolutely inspiring. Kalmans Perverse Optimist retrospective is beautiful and so is Mau's LifeStyle, especially for the opeining sequence and for the included Manifesto for Growth, which is just plain fun.\n\n"
    },
    {
      "time": "24 Jan 2004 — 11:43pm",
      "content": "I have quite a lot of respect for Tibor Kalman, although I've only read a little of his stuff. I think Mau is essentially a snake-oil salesman posing as a guru: a very charismatic guy, sometimes entertaining, but neither original nor profound. _Lifestyle_ is a good example of the tyranny of the image to which I alluded above: has so large a book ever before had so little content? A good counter example is the slim but densely packed [_What is a designer_](http://web.archive.org/web/20140804040157/http:/www.hyphenpress.co.uk/titles/what_is_a_designer/synopsis.html) by Norman Potter, originally published in 1969 and still managing to be have the freshness of strong ideas lacking in most recent design writing. Refreshingly 'the book has no visual illustrations. By this means it achieves a greater generality of reference and\n\n"
    },
    {
      "time": "25 Jan 2004 — 11:25am",
      "content": "I will stick to the traditional meaning of typography. I see _no need_ to redefine. Even with new technology there is insufficient excuse to review. These two definitions I provide are already _Cyborgian_ friendly.   \n   \n**First definition: Collins Dictionary.**   \n   \n**TYPOGRAPHY:** _The art, craft, or process of composing type and printing from it._  \n   \n**Second definition: Penguin Dictionary**   \n   \n**TYPOGRAPHY:** _The style, arrangement, or appearance of typeset matter._  \n   \nThe Collins Dictionary more closely resembles _root definition._ Fournier's definition of a t_ypographer_ includes, printing and typefounding. These peas from the modern dictionaries are boiled enough, let us not make them mushy.\n\n"
    },
    {
      "time": "25 Jan 2004 — 11:57am",
      "content": "I'm going to chime in with a question and a definition.   \n   \nRoy, did you mean: what's the literal definition of typography, stated as succinctly as possible? Or more of a 'What typography means to me' kind of a situation? Although, I suppose you can't really state them separately, as you've seen so far.   \n   \nAt its most basic, I'd call it '_the consideration and/ or appearance of typeset matter_'. I mean, it's all there in the name. When I say 'appearance and/ or consideration', I'm hitting on design's potential presence, but design is such a loaded word, I'd be inclined towards a more neutral term, that also carries no value judgements (sorry, John), because I believe that design implies intent. With modern 'typesetting' being so automated, much of the process for amateurs contains no intent, but contains many defaults. Also, I'm including the action and the thing itself. Typography can be good and bad, as in: \"Man, that typography sucks,\" which is not the action, but the result of it. Typography exists when type is present, but design exists only when it is exercised (I know, this is debatable, but I'm sticking to it for now.).   \n   \nBut that basic definition can be taken as very inclusive or exclusive, depending on your opinions about: the role of the typesetter/ typographer vs. the role of the graphic designer (or, typography vs. design).   \n   \nI can look at a poster that uses type as a purely visual element (you might call it a typographic element), but that does not, in my mind, represent the result of typesetting (typography). It's a typographic design, and in the sense that typographic elements exist there, but I'm not sure it's typography as a manifestation of typesetting. See the problem? Type isn't only geometry, it's a set of symbolic glyphs. But, those glyphs only get meaning based on how they're treated. That's what makes (in my mind) the definition so potentially contentious. The intent of the typesetter/ designer/ artist and the end result affect the meaning of how typographic elements function in an individual situation, and whether it is typography or typographic.   \n   \nI think. ...I'm starting to twist my thoughts a little too hard, but I believe this is a conceptually consistent post. But what better place to have this discussion than with Typophiles?   \n   \n ![:-)](http://web.archive.org/web/20140804040157im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "25 Jan 2004 — 3:12pm",
      "content": "Gerald, your dictionary definitions are not, as you claim, modern: they are pre-digital, and hence obsolete. On the Net, type is neither \"printed\" nor \"set\".\n\n"
    },
    {
      "time": "25 Jan 2004 — 9:41pm",
      "content": "Having reread my post many hours later, I have to admit that I'm not sure what _my own_ point was (I think there were a few, in fact).   \n   \nI meant it to bring up the differences between design and typography and how they merge and blend with type, largely because it carries meaning in such a unique fashion. And thus, the definition becomes loaded with potential meaning. But I don't think it went as well as I meant it to.\n\n"
    },
    {
      "time": "25 Jan 2004 — 10:16pm",
      "content": "Nick   \n   \n_Gerald, your dictionary definitions are not, as you claim, modern: they are pre-digital, and hence obsolete. On the Net, type is neither \"printed\" nor \"set\"_\n\n"
    },
    {
      "time": "25 Jan 2004 — 11:37pm",
      "content": "On a computer screen, type is displayed, not printed.   \nIt is not set, but varies according to different readers' equipment and preferences.   \n   \nRather than the maestro's virtuosity, with its single, authoritative interpretation of the text, we have a situtation where there are many \"authors\" (typographers) involved.   \n   \nSo you are right Gerald, those dictionaries have the modern definition. But it's out-of-date. We need a post-modern definition.\n\n"
    },
    {
      "time": "25 Jan 2004 — 11:58pm",
      "content": "Here's my simple definition:   \n   \nTypography is the arrangement, composition, and/or setting of type\\*.   \n   \n\\*Type being a font of alphanumeric characters.   \n   \nNot to be confused with lettering or topography.   \n\"Do you have a typography section?\"   \n\"Um, check over by the maps?\"   \n   \nI actually got that once at a bookstore. :-)   \n   \nI'm sure glad I don't have a job writing dictionary definitions, not fun.\n\n"
    },
    {
      "time": "26 Jan 2004 — 12:54am",
      "content": "Nick,   \n   \nI resemble that statement.   \n   \nThe problem is this Nick. You do indeed \"type\" but you do not typeset unless you are setting type. If it is not type, it is not typography. So I am in agreement. I was just trying to be kind. Never works for me.   \n   \nBut let us examine first the non noun definition of type, or rather _to type._   \n   \n**Penguin:** _To write something using a typewriter or computer._   \n   \nNow that's pretty modern. At least the latter.   \n   \nHowever the noun _type._   \n**Penguin:** _A small metal block with a raised character or letter on its upper surface, used in printing._   \n   \nWe are fooling ourselves to think otherwise. I am easily talked into that distinction. I am a typographer, even by Fournier's definition.   \n   \nThis illustration is \"modernized\". See Giampa.   \n [http://lanstontype.com/TypeStick.html](http://web.archive.org/web/20140804040157/http:/lanstontype.com/TypeStick.html)   \n   \nSetting.   \n [http://lanstontype.com/GiampaStick.html](http://web.archive.org/web/20140804040157/http:/lanstontype.com/GiampaStick.html)   \n [http://lanstontype.com/TypeSet.html](http://web.archive.org/web/20140804040157/http:/lanstontype.com/TypeSet.html)   \n   \nPrinting.   \n [http://lanstontype.com/GiampaHat.html](http://web.archive.org/web/20140804040157/http:/lanstontype.com/GiampaHat.html)   \n   \nDesigning.   \n [http://lanstontype.com/ATF.html](http://web.archive.org/web/20140804040157/http:/lanstontype.com/ATF.html)   \n [http://lanstontype.com/EzraPound.html](http://web.archive.org/web/20140804040157/http:/lanstontype.com/EzraPound.html)   \n   \nPublishing   \n [http://lanstontype.com/Robin-Blaser-Poet.html](http://web.archive.org/web/20140804040157/http:/lanstontype.com/Robin-Blaser-Poet.html)   \n   \nType Founding   \n [http://lanstontype.com/OrphanAnnie.html](http://web.archive.org/web/20140804040157/http:/lanstontype.com/OrphanAnnie.html)   \n [http://lanstontype.com/CaliforniaCase.html](http://web.archive.org/web/20140804040157/http:/lanstontype.com/CaliforniaCase.html)   \n [http://lanstontype.com/StonePattern.html](http://web.archive.org/web/20140804040157/http:/lanstontype.com/StonePattern.html)   \n [http://lanstontype.com/StoneRimmerFrame.html](http://web.archive.org/web/20140804040157/http:/lanstontype.com/StoneRimmerFrame.html)   \n   \nAnd running a business. Still part of the \"early\" definition.   \n [http://lanstontype.com/BuickIvy.html](http://web.archive.org/web/20140804040157/http:/lanstontype.com/BuickIvy.html)   \n   \nSo let's stick with Fournier's definition. I am not in a peculiar rush to modernize anything.   \n   \nThat would make _me_ a \"retired typographer\". And as you all know, I am just so   \neasy to get along with.\n\n"
    },
    {
      "time": "26 Jan 2004 — 6:36am",
      "content": "Gerald Giampa, FLEURON MASTER   \n   \n**Without Prejudice**  \n   \nYes Gerald, you are a\n\n"
    },
    {
      "time": "26 Jan 2004 — 4:11pm",
      "content": "Matthew, that's not as bas as being sent to the Fine Art section...   \n   \n\\> The great craft of handset type as a commercial printing   \n\\> process has now been reduced to a cottage industry.   \n   \nOh, it's much worse than that: it's become a whore at hands of the tactility junkies.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Jan 2004 — 4:31pm",
      "content": "Gerald G   \n   \nLet's go out and pick out our  burial plots.   \n   \nJim\n\n"
    },
    {
      "time": "27 Jan 2004 — 12:45am",
      "content": "Hrant   \n   \n_Oh, it's much worse than that: it's become a whore at hands of the tactility junkies._   \n   \nThat's not way to talk. I think you have offended Mr. Rimmer.   \n [http://lanstontype.com/JimRimmer.html](http://web.archive.org/web/20140804040157/http:/lanstontype.com/JimRimmer.html)\n\n"
    },
    {
      "time": "27 Jan 2004 — 7:41am",
      "content": "Jim is an honorable exception - he should have realized that by now! :-)   \n   \nI'm talking about the people who abuse letterpress as a provincial escapism from the digital world.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2004 — 9:35am",
      "content": "Hrant,   \n   \nI thought you and Gerald Lange were friends? Or is he excluded too? Just who are you talking about? And why would you think that way? Just what are you going on about?\n\n"
    },
    {
      "time": "27 Jan 2004 — 10:35am",
      "content": "Hrant: I didn't think you were levelling the Tactile Junkies term at me.   \n   \nDisregard my short outburst of yesterday.   \n   \nRegarding \"what is typography?\"   \nI am one of those people who consider letters on art board, calligraphy on vellum, capitals carved in marble, and Spaghettios to all be typography.   \n   \nJim Rimmer\n\n"
    },
    {
      "time": "27 Jan 2004 — 10:41am",
      "content": "Gerald Lange is also an exception.   \nHere's an example of a letterpress abuse mainstreamer:   \n [http://www.creativepro.com/author/home/1939.html](http://web.archive.org/web/20140804040157/http:/www.creativepro.com/author/home/1939.html)   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2004 — 11:57am",
      "content": "Hrant, I don't think the president of Seybold Seminars and Publications can be accused of 'provincial escapism from the digital world'. So the guy has a hobby. Beats shooting smack.\n\n"
    },
    {
      "time": "27 Jan 2004 — 12:04pm",
      "content": "I don't know Seybold well enough to know what kind of president they'd have...   \n   \nHobbies are great, but I'm not sure a letterpress hobbyist _has_ to be the kind of person I'm railing against. To me it's the intent. Doing something to please yourself is great, I'd just worry about people looking at nostalgic fetishism as something to emulate.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2004 — 12:11pm",
      "content": "Jim   \n   \n_Regarding \"what is typography?\"   \nI am one of those people who consider letters on art board, calligraphy on vellum, capitals carved in marble, and Spaghettios to all be typography._\n\n"
    }
  ]
}
