{
  "id": "28132",
  "title": "Hamsa Typeface. { transitional serif display face }",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hey guys,  \nHere is something I've been working on. This is my first sketch and I could use any help.\n\nCONCEPT  \nI wanted to create an elegant face based on the very curvy physique of swans. For inspiration, I am refering to Baskerville and the occasional Bodoni.\n\nLINK (its in flash so you can zoom in)  \n [http://prakashnair.com/secret/hamsa/hamsa.pdf](http://web.archive.org/web/20150124100557/http:/prakashnair.com/secret/hamsa/hamsa.pdf \"http://prakashnair.com/secret/hamsa/hamsa.pdf\")\n\nThanks,  \nPrakash.\n\n",
  "author": "•Prakash Nair",
  "time": "9 Sep 2006 — 5:30pm",
  "uid": "12101",
  "comments": [
    {
      "time": "9 Sep 2006 — 9:22pm",
      "content": "Almost all of the letters looked like they had been cut off right at their baseline and x-height. Is that your intention? That could also be due to low resolution. Care to give us a PDF of higher resolution?\n\nAlso, the _s_ look rather imbalanced and the stroke on the upper part of _f_ need to be thinned -- like Rotis' c, it is in danger of falling over, albeit much less so. But I dig the _g_ :)\n\nAny possibility of using the face at text size? It looked robust enough to me.\n\n"
    },
    {
      "time": "10 Sep 2006 — 8:17am",
      "content": "yea I thinks its the quality. I just uploaded a PDF with the fixes.\n\n"
    },
    {
      "time": "10 Sep 2006 — 9:00am",
      "content": "Great font!\n\nIt definitely has a lot of curvy enegry to it. I am a beginner, so take my comments with a grain of salt.\n\nThe upper curve of the 'a' may be a bit too heavy shouldered. The 'g' has a lot of character. Its lower ear may be a bit too heavy and its upper right section looks a bit too rectangular. What about starting the curve of the 'f'-hook a bit lower in its stem. Now it seems a bit abrupt.\n\nHope this makes sense.\n\nSebastian\n\n"
    },
    {
      "time": "11 Sep 2006 — 5:19pm",
      "content": "Hey thanks Pixion. Yea makes sense. That \"s\" has always been a pain in the \\*\\*\\* for me.\n\n"
    }
  ]
}
