{
  "id": "28158",
  "title": "Ambigram feedback",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "So I was tinkering around with an ambigram of my son's name (Sam) and was making very little progress with anything that looked good. A really cool guy from yayhooray came up with this\n\n ![](http://web.archive.org/web/20131108224416im_/http:/typophile.com/files/samiam2_3820.jpeg)\n  \nand two other versions, both without the stroke and one a little bit lighter. \n\nI'm planning on getting this tattooed on me in the next week or so but after reading the ambigram thread noyz319 posted here ( [http://typophile.com/node/27688](http://web.archive.org/web/20131108224416/http:/typophile.com/node/27688 \"http://typophile.com/node/27688\")) and on yayhooray I thought I'd get some feedback from you experts. What do you think?\n\n",
  "author": "Mary Wise",
  "time": "11 Sep 2006 — 9:15am",
  "uid": "14562",
  "comments": [
    {
      "time": "11 Sep 2006 — 10:02am",
      "content": "Works well as a tattoo, I think. Tattoos don't really follow the normal rules of typography, they're more of akin to the art of illustration. I mean, nobody'd make a tattoo with Helvetica, right? Althought that would be really cool. Hmmm...\n\n"
    },
    {
      "time": "11 Sep 2006 — 10:15am",
      "content": "as long as you don't mind people asking what it says, i think it's nice. i read Tam.\n\n"
    },
    {
      "time": "11 Sep 2006 — 1:07pm",
      "content": "Don't do it. It's good, but not that good, and i guess you're having doubts or you wouldn't have posted for feedback.\n\nI would have struggled to read Sam if you hadn't already said. I read Tam too, and wam. I think there is a more elegant, fluid and legible solution. You just need to find it.\n\n"
    },
    {
      "time": "11 Sep 2006 — 2:18pm",
      "content": "Work on the lower part of the s as it merges into the left-most loop of the 'w'. I think curving that more might be enough to emphasize the 'S' without harming the 'm' too much.\n\n"
    },
    {
      "time": "11 Sep 2006 — 3:49pm",
      "content": "Here's what I think: it's almost impossible to read, but that's OK for a tattoo, and as a tattoo it's alright (I'm not really a connoisseur of tattoos but to me it looks good). I'm otherwise a proponent of readability in a big way. But in a tattoo, does it really matter if nobody but the owner can see exactly what it says?\n\nOf course if you're having doubts (and since you're asking you probably do) you should give it more time, look at some alternative designs maybe. Once it's there it's hard to get rid of. And it's a fact that most people regret their tattoos.\n\n"
    },
    {
      "time": "11 Sep 2006 — 10:25pm",
      "content": " ![](http://web.archive.org/web/20131108224416im_/http:/typophile.com/files/sam_6028.gif)\n\na (really) rough idea of my suggestion.\n\n"
    },
    {
      "time": "12 Sep 2006 — 5:27am",
      "content": "thanks for the feedback so far. and Termopolium i'm not having doubts about it, i just wanted to hear what some other people thought about it. you're right, the tattoo is really for the person whose skin its on not the rest of the world.\n\ni've been scribbling around with it at home a little bit but nothing i have done improves it i don't think, the current design is cool IMO. i know a guy who's planning on getting a tattoo of his son's birthdate tattooed on him (like 07.23.02 or 72302 or something like that) in a certain typeface. he considered avant garde. that could be cool too.\n\n"
    },
    {
      "time": "12 Sep 2006 — 8:33am",
      "content": "The top of the S is still looking a lot like a T or J. I would suggest trying some other ways to make the top of the S that look less T-like. I don't think it will interfere with seeing the m. Look at some blackletter fonts to get ideas.\n\n"
    },
    {
      "time": "12 Sep 2006 — 12:02pm",
      "content": "Look at more blackletter styles before (fraktur, schwabacher, bastarda, etc.) before you design a \"lifelong\"… – this style is (sooo) dated.\n\nPS. I really love blackletter, that's why i'm interrupting…\n\n"
    },
    {
      "time": "12 Sep 2006 — 5:28pm",
      "content": "Hey MW: Pretty well everyone here knows the person who did this for you. ;)\n\n"
    },
    {
      "time": "12 Sep 2006 — 5:35pm",
      "content": "<cite>Hey MW: Pretty well everyone here knows the person who did this for you. ;)</cite>  \nNot so much, please clue us in.\n\n"
    },
    {
      "time": "12 Sep 2006 — 6:02pm",
      "content": "\\> Hey MW: Pretty well everyone here knows the person who did this for you. ;)\n\nHey Mark, Paul, Jonathan, and everyone else ... haven't posted much since the redesign,  \n(email notification was the greatest) but I'm still trying to keep up with the happenings here.\n\nhmm, didn't expect to see this ambigram (that I did rather quick) up for critique here,  \nbut oh well. ;)\n\nbut your comments are right on, and before MW inks this permanently,  \nI'm going to revise, and fix the S-T thing and the odd curve of the upper S,  \namong other fixes.\n\n"
    },
    {
      "time": "12 Sep 2006 — 6:36pm",
      "content": "good to see you back, bj! we've missed you. hope to see you on the boards more often.\n\n"
    },
    {
      "time": "13 Sep 2006 — 6:39am",
      "content": "i doodled around some more with it last night. well at least as much as my son would let me. i'll post it later this afternoon.\n\nalso props to bj. you rule.\n\n"
    },
    {
      "time": "13 Sep 2006 — 5:48pm",
      "content": "Hey Brian, nice to see you here (more).\n\n"
    },
    {
      "time": "18 Sep 2006 — 5:12pm",
      "content": "I guess you will have already checked out the site of [John Langdon](http://web.archive.org/web/20131108224416/http:/www.johnlangdon.net/gallery.html)?  \n(Yes, the one that created the ambigrams for the Dan Brown book).\n\nHe would be one of the kings of ambigrams I think.\n\n"
    },
    {
      "time": "19 Sep 2006 — 1:26pm",
      "content": "Yes I'm a big fan of his work.\n\n"
    }
  ]
}
