{
  "id": "2816",
  "title": "Caslon's Caslon's Caslon",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Back in June, there was a long, [interesting discussion](http://web.archive.org/web/20131221004428/http:/www.typophile.com/cgibin/discus.pl?pg=prev&topic=30&page=11991) here about different metal versions of Caslon's oldstyle types. At the time, I uploaded an image of the version shown in the H.W. Caslon and Co. Ltd. specimen of 1924, offering _Caslon old face roman & italic, cast entirely from matrices produced from the original punches engraved in the early part of the eighteenth century in Chiswell Street, London, by William Caslon_. One can't get much more of a precise description of the alleged provenance of the types shown, but I pointed out that compared to William Caslon's own specimen sheets -- and those of his grandson, which I have on my wall -- it was clear that the 1924 types had been refitted, with both the horizontal spacing and vertical alignment much improved. Because of the claims of the 1924 specimen about the provenance of the matrices ('produced from the original punches engraved in the early part of the eighteenth century' etc.), I thought that only the fit had been adjusted, presuming that other differences were due to the relatively heavy inking of the 1924 specimen.   \n   \nA few days ago I came across this paragraph in James Mosley's essay 'Reviving the classics: Matthew Carter and the interpretation of historical models' in the very good [catalogue](http://web.archive.org/web/20131221004428/http:/www.amazon.com/exec/obidos/tg/detail/-/1568984278/qid=1074880515/sr=1-1/ref=sr_1_1/103-4402685-6125406?v=glance&s=books) of the recent exhibition of Matthew's work:   \n   \n_When type was cast in metal, the revival of an old type was sometimes merely a matter of dusting down the old copper matrices and putting them back into use. But when in the 1880s the Caslon foundry in London wanted to promote the wider sales of the 'original' Caslon types that they had been casting for some decades for a few select clients, they found that some of the old materials were awkward to cast from. Many of the sizes of the Caslon Old Face were therefore recut in steel by expert punchutters, who unobtrusively reduced some of the stranger irregularities of the design. The foundry never publicly admitted what it had done to the type, which it continued to market as 'original', and the recutting was so skillfully accomplished that clients happily continued to accept the product in the mistaken belief that the Caslon type with its eccentricities was an authentic casting from the 18th-century matrices._\n\n",
  "author": "John Hudson",
  "time": "23 Jan 2004 — 10:03am",
  "uid": "1262",
  "comments": [
    {
      "time": "23 Jan 2004 — 11:19am",
      "content": "John,   \n   \nThis certainly unveils a mystery. I noted differences and wondered about them.   \n   \nLanston had all important castings for referral. We had very early Caslon with little signs of wear. Un-inked Caslon from the Caslon Foundry cast in the 60\n\n"
    },
    {
      "time": "23 Jan 2004 — 11:26am",
      "content": "\\> Exact duplication of punches was not possible   \n\\> until the invention of the Benton Pantograph.   \n   \nBut we know -for example through the testimonial here by   \nJim Rimmer- that the pantograph couldn't reproduce the   \nsharpest of corners. (Let's not go over this again...)   \n   \nAt the Imprimerie Nationale for example (where cost-cutting cannot   \nbe said to be a non-issue, since they recently dismissed one of their   \ntwo remaining punchcutters) Christian Paput does all his work (like   \nthe recreation of lost/missing characters) by hand. He doesn't even   \nlike to use counterpunches - it's all in the burin for him.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Jan 2004 — 11:35am",
      "content": "_...it's all in the burin for him._\n\n"
    },
    {
      "time": "23 Jan 2004 — 12:18pm",
      "content": "Hrant,   \n   \nWhatever Lanston made on a pantograph could be duplicated exactly by Lanston on a pantograph. That is for sure. What ever is _made by hand_ can not be duplicated _exactly by hand or by pantograph._   \n   \nCatch my drift?\n\n"
    },
    {
      "time": "23 Jan 2004 — 12:28pm",
      "content": "And we know that the Caslons didn't use a pantograph.   \n   \n\\> What ever is made by hand can not be duplicated exactly by hand or by pantograph.   \n   \nBut it can be duplicated much better by hand than by pantograph.   \n   \n--   \n   \nAnyway, John, I'm wondering: is there any \"before & after\" stuff to compare?   \n   \nhhp\n\n"
    },
    {
      "time": "23 Jan 2004 — 12:52pm",
      "content": "_But it can be duplicated much better by hand than by pantograph._   \n   \nDepending on the nature of the design, the best result might be achieved by a combination of pantograph and manual cutting. The pantograph is extremely good at duplicating proportion and weight, while the graver is better at cutting fine details. One could probably cut most of a punch on the pantograph, and then take a graver to it to get the sharp corners.   \n   \n_Anyway, John, I'm wondering: is there any \"before & after\" stuff to compare?_   \n   \nIf you wanted to compare immediate before and after material, rather than comparing something like the 1924 specimen to the 18th-century sheets, you would need to locate some material printed in the mid-19th century by one of those 'few select clients' to whom James Mosley refers. This would give you an idea of the state of the matrices just prior to the recutting. Then you would need to locate material printed in the last decade of that century, from newly cast type, in order to compare the recutting. I'm sure appropriate stuff exists.   \n   \nSomething to take into consideration, though, is the changing fashion in typography that occured at the very end of the 19th-century. Morris and his imitators introduced a fashion for dark, heavy types, and this resulted in some printers deliberately overinking traditional types such as Caslon. The editions of the Chiswick Press from the beginning of the 20th century, which kickstarted a major Caslon revival in Britain, are a good example of such overinking combined with deep rag paper, giving a really heavy appearance. So locating material printed after the recutting that matches the print conditions typical before the recutting might be difficult.\n\n"
    },
    {
      "time": "24 Jan 2004 — 12:28am",
      "content": "Hrant   \n   \n_But it can be duplicated much better by hand than by pantograph._  \n   \n**PROVE IT**\n\n"
    },
    {
      "time": "24 Jan 2004 — 9:36am",
      "content": "Hrant and anyone else who is interested in the idea:   \n   \nSomehow I have to get some people to come here to work with me at my studio/foundry for a few days. My intention is not to prove any point of mine, because I don't need to have everyone share my beliefs, but rather to give any interested typographer the opportunity to make a piece of type by: hand cutting a punch, pantographing a punch or pantographing a directly-cut matrix. And as a part of the pantographing process, to additionally make a pattern. The final steps: to cast the character and print it. After all this the difference in the three approaches to cutting type would be clearly obvious to the participant.   \n   \nThe workshop would require a minimum of four or five days, (there are a couple of B&B spots in the neighbourhood) so it would cost a person a bit for accommodation and travel.   \n   \nIf this snowballs into anything meaningful, I would like to approach Dan Carr to see if he would like to travel here on a cheap flight and teach the hand punchcutting part.   \n   \nI think if Dan will participate, I have enough equipment and tools to take five people.   \n   \nFor myself, I would do it free of charge, but Dan would need to be paid something for his time and travel.   \n   \nIf there is any interest in this idea, my email is: [rimmertype@shaw.ca](mailto:rimmertype@shaw.ca)   \n   \nComments?   \n   \nJim Rimmer\n\n"
    },
    {
      "time": "24 Jan 2004 — 9:46am",
      "content": "Hrant,   \n   \nThere is your chance!\n\n"
    },
    {
      "time": "24 Jan 2004 — 10:17am",
      "content": "Having spent an afternoon visiting Jim's studio last fall (during ATypI in Vancouver), I can say that this would be a great opportunity for any serious student.   \n   \nI only wish that I'd had the chance to stay on a little longer and do something like this with Jim -- get my hand's dirty, so to speak. But even just watching was a welcome education.   \n   \nJim, if you weren't all the way over on the other side of the continent, I'd be there in a heartbeat. If I can ever justify the trip again, I'll let you know.   \n   \n-- Kent.\n\n"
    },
    {
      "time": "24 Jan 2004 — 10:55am",
      "content": "Jim, know that the next time I'm in Vancouver it will probably be mostly due to your offer!   \nAnd Dan would be great too.   \n   \nhhp\n\n"
    }
  ]
}
