{
  "id": "28175",
  "title": "Triangulor-now with alternet set (My first post)",
  "forum": "Motion / 3d / Experimental",
  "tags": [
    "Display",
    "Motion / 3d / Experimental"
  ],
  "content": "I'm new to these forums, but I've been gradually designing fonts over the years as a hobby. I know I have a long way to go before even thinking of standing in some of your shadows. Anyway, here is my latest creation: Trialgulor\n\n ![](http://web.archive.org/web/20150317190817im_/http:/typophile.com/files/Triangulor-1_4471.png)\n\nI fully expect to be ripped to shreds here. Please, tell me whether this or any of my other fonts are total crap, and what could be done to fix them.\n\nThis one can be downloaded at [1001fonts.com](http://web.archive.org/web/20150317190817/http:/www.1001fonts.com/font_details.html?font_id=3017).  \nOthers are linked from my author profile there.\n\nEDIT: It occure to me this might be more appropriate in the \"experimental\" category rather than \"display\". Please correct me if I'm wrong.\n\n",
  "author": "cuttlefish",
  "time": "12 Sep 2006 — 2:16am",
  "uid": "14556",
  "comments": [
    {
      "time": "12 Sep 2006 — 5:10am",
      "content": "I dont feel qualified, or knowledgeable enough to give criticism, but dont go into this post feeling as if you will be \"shot down in flames\", rather look upon the information given as being helpful in furthering your knowledge so that you can apply this to future works.  \nThe people here, with very few exceptions, will give an honest opinion and advice/methods/knowledge to improve upon your characters.\n\nContrary to the view that some may get from the debate that can occur in some posts, it is all good... and contrary to my original statement regarding criticism I offer the following -\n\nPersonally I would offer the opinion that the upwards leg of the N could be straighter. The 'J' seems to lean a bit too far, the lc 'w' and 'x' seem to be of a different style than the rest. Also suggest you try typing a few sentences in this, and you could find that the opposing lean on characters gives for an uncomfortable read. You seem to have an idea for a optical distance lean (backwards). This would work better (like in the cap O) if rather than lean, they reduced in thickness over the height of the characters, eliminating the lean but retaining the effect.\n\n"
    },
    {
      "time": "12 Sep 2006 — 11:27am",
      "content": "Oh I fully expected this font to be an uncomfortable read. It's a novelty font at best. I tried to constrain all the characters within the shape of the O, a rounded isoceles triangle, which obviously was impossible and I fudged that rule extensively. I see it as more useful for titles, signs, and logos, where it is only used for one or two words at a time. If someone wants to set a bible with it, that's great, but it's not my problem.\n\nI have made some better fonts. This is just my most recent one.\n\n"
    },
    {
      "time": "12 Sep 2006 — 11:43am",
      "content": "I would make a caps-only\\* version with an \"A-frame\" set like you [mostly] have now plus a \"V-frame\" set so a user could alternate\\*\\* them and get a nice tight texture out of the font in addition to the sawtooth. That could be useful. Sometimes.\n\n\\* It's much harder to make lc work well in confined polygons.\n\n\\*\\* And I'd put one set in the lc locations and the other in the UC locations for ease of typing/composition.\n\nhhp\n\n"
    },
    {
      "time": "21 Sep 2006 — 3:07pm",
      "content": "Ok, I came up with the alternating caps version as you suggested. The spacing still needs a lot of work, and some of the letters just don't really work in some instances of going up or down. I couldn't come up with a solution for \"X\" going either way, so they're the same.\n\n ![](http://web.archive.org/web/20150317190817im_/http:/typophile.com/files/TriangulorAlts-sample_4950.png)\n\nI'm really pretty happy with the lc in the regular version. I do agree the \"x\" is a little weird, but I couldn't quite think of another way to do it.\n\n"
    },
    {
      "time": "21 Sep 2006 — 3:14pm",
      "content": "Heh, the \"a\" looks like a salmon steak.\n\n"
    },
    {
      "time": "27 Sep 2006 — 12:38pm",
      "content": "Anybody have a suggestion on how to design the A-frame \"v\"? I don't think it's even possible. That solution I came up with looks like a swan/turd/erhlenmeyer flask. Might make a good pharmaceutical logo, but not a \"v\".\n\n"
    },
    {
      "time": "16 Oct 2006 — 11:48am",
      "content": "I got a little catalog in the mail recentlyand found that my font bears a vague passing resemblance to both [Tiki Wood and Trickhouse](http://web.archive.org/) by House Industries, but they tackle the problems I'm facing far differently than I have. If there is a name for this style, I guess you'd call it interlocking sawtooth. But my cap angles are inconsistent, and look better with the lc than with the alternating caps version.\n\n"
    }
  ]
}
