{
  "id": "28183",
  "title": "Late Breaking News from Apple",
  "forum": "Home",
  "tags": [

  ],
  "content": "In what will surely be seen as a textbook case of Steve Jobs’ misdirection, Typophile has just learned of the reality behind today’s highly-anticipated and overly-speculated Apple product announcement.\n\nWhile the analysts, entertainment industry and Apple enthusiasts are looking the other way, expecting new iPods and movie downloads, an anonymous source close to today’s presentation has leaked that the Cupertino-based company will release a new portable font management device.\n\n“If music is the soundtrack of our customers lives, surely fonts are their voice.” claims our reputable source.\n\nSteve Jobs will announce that this new device has been designed specifically for the design professional, one of Apple’s key customer segments. “Designers are being asked to be more mobile than ever, working from client sites, public transit, studio or home.” revealed our source. “This device will allow them to take their fonts with them so they’re always accessible no matter where the work demands.”\n\nSources who have seen the device report that it features a 3.5-inch touchscreen for easy font display and management.\n\nTight integration with Apple’s iLife and iWork products is expected with continued font support in iPhoto and iDVD, Keynote and Pages. Wireless capability is speculated but not confirmed, which would allow designers to initiate purchases and downloads directly from the new device.\n\nThe Apple Music Store is also expected to get a name change. The new Apple Media Store will allow for downloads of digital fonts in a move which is expected to revolutionize a floundering retail font market.\n\nInternal sources have confirmed that the new device is close to Steve Jobs’ heart. The iconic black-turtlenecked Apple CEO has authorized the new product name personally. The Jobcase™ clearly affirms Steve’s well-known affinity for typography.\n\nPhones are offline this morning at Apple’s International & Text Group.\n\n_—Late-Breaking Addition—_\n\nSources outside San Francisco’s Yerba Buena Center for the Arts this morning are claiming that glimpses of a Jobcase interface can be seen through a gap in window graphics meant to obscure today’s announcement.\n\nJoin us at 10am PST for the exciting announcement. Tune into this thread and set your browsers to auto refresh.\n\n[[Post a comment]](http://web.archive.org/web/20070126001655/http:/typophile.com/node/28184)\n\n",
  "author": "<a href=\"user/3\" title=\"View user profile.\">Jared Benson</a>",
  "time": "",
  "uid": null,
  "comments": [
    {
      "time": " 12 September, 2006 - 1:03pm",
      "content": "A thinner design. Five stylish colors. A brighter display. Up to 24 hours of battery life. Just about the only thing that hasn’t changed is the name. In 2GB, 4GB, and 8GB models starting at $149, iPod nano puts up to 2,000 songs in your pocket.(1)\n\n**turns out it’s a new iPOD nano, but let’s hope the’ll also launch the _jobcase_ .**\n\n"
    },
    {
      "time": " 12 September, 2006 - 1:40pm",
      "content": "Darn, well hey, we tried.\n\n"
    },
    {
      "time": " 13 September, 2006 - 3:27am",
      "content": "Dries, volgende keer niet vergeten je \\<em\\> en \\<strong\\> tags af te sluiten. ;^)\n\n"
    },
    {
      "time": " 13 September, 2006 - 6:53am",
      "content": "There will be something soon. Probably next year\n\n"
    },
    {
      "time": " 13 September, 2006 - 8:30am",
      "content": "This was a joke, right?\n\nHéctor\n\n"
    },
    {
      "time": " 13 September, 2006 - 8:33am",
      "content": "OK, Yves, whad’ya say?\n\nChrisL\n\n"
    },
    {
      "time": " 13 September, 2006 - 9:56am",
      "content": "Next time, don’t forget to close your tags??? :)\n\n"
    },
    {
      "time": " 13 September, 2006 - 1:42pm",
      "content": "I won’t :)\n\n"
    },
    {
      "time": " 13 September, 2006 - 3:01pm",
      "content": "???? … only because your post came through fine for me :)\n\n"
    },
    {
      "time": " 17 September, 2006 - 3:13pm",
      "content": "That’s because _I_ closed them. ;^) Everything after his post was bold italic, including the right hand column. Made it look kinda messy.\n\n"
    },
    {
      "time": " 19 September, 2006 - 5:02am",
      "content": "It’s called a hard drive ; P\n\n"
    },
    {
      "time": " 19 September, 2006 - 5:32am",
      "content": "Michele,  \nYour icon is perfect! I just noticed trhat your last name strts with M as well—I must be slow in my old age :-)\n\nChrisL\n\n"
    },
    {
      "time": " 29 September, 2006 - 8:20pm",
      "content": "I already keep the 50,000 fonts I don’t use on my iPod so that Spotlight doesn’t have to chug through those on top of all the fonts I keep on the internal hard disk. Why would I need a specialized device?\n\nWhat Apple really needs to sell is a device that goes through all my fonts, and constantly deletes every font that isn’t Bodoni, Helvetica, Times Roman, Century and Futura.\n\nAnd AG.\n\n"
    },
    {
      "time": " 29 September, 2006 - 9:38pm",
      "content": "A Vignelli man, eh? What a waste.\n\nhhp\n\n"
    },
    {
      "time": " 30 September, 2006 - 1:33pm",
      "content": "_a device that goes through all my fonts, and constantly deletes every font that isn’t Bodoni, Helvetica…_\n\ni need one that goes through and deletes these fonts specifically!\n\n"
    },
    {
      "time": " 26 October, 2006 - 10:07am",
      "content": "SO… Is this going to be like a “Suitcase” that you would plug in and go. Like Plug-and-Play font storage?\n\nI soo want one, and with open type on top of it I could jump form the my Mac to my PC to work with no hassle.\n\n"
    },
    {
      "time": " 31 October, 2006 - 11:57am",
      "content": "Why not just call it a 007 California Case instead of an ipod?\n\n~ Rusty\n\n"
    },
    {
      "time": " 10 November, 2006 - 2:09pm",
      "content": "so Yves, what does ‘Dries, volgende keer niet vergeten je en tags af te sluiten’  \nall mean? i’m curious now :D  \nand why is half my text bold? tags i guess\n\n"
    }
  ]
}
