{
  "id": "2818",
  "title": "Trebuchet in Mac PS-1???",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Anyone know if there is a PS-1 version of Trebuchet out there?   \n   \nHow about Trebuchet Bold?   \n   \nTrebuchet Italic?   \n   \nOr is there something similar enough that we could use instead?   \n   \nI've got an art director saying they \"need it\". Yesterday, of course.\n\n",
  "author": "kristin",
  "time": "Fri, 2004-01-23 11:46",
  "uid": "1553",
  "comments": [
    {
      "time": " Fri, 2004-01-23 11:56",
      "content": "There might be, but note that it's illegal as per the MS license agreement.   \n   \nAs for using a similar font... let me know if you find one! :-/   \n   \nDoes the guy have a budget for a custom font?   \n   \nhhp\n\n"
    },
    {
      "time": " Fri, 2004-01-23 12:48",
      "content": "We're checking on that, Hrant.   \n   \nIt's one of those weird questions we get here in the corporate world. I'm about three people removed from the original art director.   \n   \nThe message I got was that the art director noticed that the Postscript Bold and Italic were \"missing\" and hoped we could provide them because she \"needs\" them for a project.   \n   \nThey aren't \"missing\" from our corporate files because we never had them. I'm checking to see whether such an animal as a Trebuchet bold or italic exists anywhere.   \n   \nMy colleague gets the unenviable job of trying to track down the original art director to see whether there are other ways of solving the problem on the design level.   \n   \nSo far, the only answer I have is your suggestion: a custom font. It could happen, I suppose, but I'm guessing that a new type choice is in the offing -- thus my request for something similar to trebuchet that comes in bold and italic as well!   \n   \nThanks!\n\n"
    },
    {
      "time": " Fri, 2004-01-23 13:17",
      "content": "Uh, so they have a PS of the Regular? FYI, that violates the EULA.   \nTrebuchet does have the four basic styles, but only in TT.   \n   \nhhp\n\n"
    },
    {
      "time": " Wed, 2004-01-28 05:10",
      "content": "I'm pretty sure you can do what ever you want to a font as long as it's for your own use and work. Which would include converting to PS for your own print work. You just can't spread it around or sell it as a derivative work. Fonts are for using not sharing. If you have the right to the font you can use it as you wish.\n\n"
    },
    {
      "time": " Wed, 2004-01-28 12:58",
      "content": "But Vincent, isn't Trebuchet covered by the license agreement of the MS software with which it ships? In which case decompiling is prohibited, and that arguably includes conversion from TT to PS.\n\n"
    },
    {
      "time": " Wed, 2004-01-28 15:43",
      "content": "I think most of the TT-PS and PS-TT conversions are illegal anyway.   \nMost EULA's forbid this.   \nRecently there was a case where BSA checked the fonts from a specific Library. All TT versions seemed illegal.\n\n"
    },
    {
      "time": " Wed, 2004-01-28 16:02",
      "content": "It's actually pretty recently that \"internal\" modification was made illegal by a large number of foundries. MS was the first high-profile case (that I noted) when they released their core fonts, but for a while they were the only ones to be so anal - and you could even say they had a decent reason: saving support headaches for funky versions floating around.   \n   \nI actually think forbidding internal mods in EULAs is generally unethical. And it might be dumb too, because people will do it anyway, and that will make them feel like they've already broken the law so it's OK to get away with more.   \n   \nA little bit of decency can go a long way - with individuals if not with megacorporations.   \n   \nhhp\n\n"
    },
    {
      "time": " Wed, 2004-01-28 16:50",
      "content": "I would have to agree. The 'forbidding' of font modifications for internal use is quite pointless. I see ZERO benefit in it. Being able to, for instance take a font you use for your identity and replace a character -- with say a graphic your company uses frequently -- for the sake of ease for, lets say the receptionist -- well, this just makes sense.   \n   \nHow would this hurt a foundry?   \n   \nHildebrant.\n\n"
    },
    {
      "time": " Wed, 2004-01-28 19:16",
      "content": "For Microsoft and other companies that bundle software, there is a practical reason that has nothing to do with forbidding font modifications per se but with simplifying licensing. It is much easier in every respect to have a single license that covers your entire software produce, including bundled components -- be they fonts, dlls or whatever -- than to have multiple licenses for different aspects of your product.   \n   \nRemember: Microsoft is not a font foundry. Even when they produce original fonts internally or through vendors like Tiro, rather than licensing existing fonts from a company like Agaf Monotype or Font Bureau, they are providing fonts as a value added component of their software, not as a product in their own right.\n\n"
    },
    {
      "time": " Thu, 2004-01-29 04:12",
      "content": "Mr Hudson, how do you feel personally (and indeed at Tiro) about licensing making it illegal to alter fonts in what many regard as morally legitimate ways, such as format conversion or, as Kyle points out above, insertion of extra glyphs?\n\n"
    },
    {
      "time": " Thu, 2004-01-29 08:28",
      "content": "_...decompiling is prohibited..._   \n   \nIf that's true, wouldn't converting text to outlines in a graphics program be considered a violation?\n\n"
    },
    {
      "time": " Thu, 2004-01-29 09:16",
      "content": "However, those who don't know what they're doing are often the ones who don't even know that fonts are licensed, rather than purchased. So expecting them to know that they shouldn't modify it seems like an even further stretch.\n\n"
    },
    {
      "time": " Thu, 2004-01-29 12:40",
      "content": "Mr Earls, my personal opinion is that the owner of intellectual property has the moral right to dictate how that property is used by others, within the limits of fair use as recognised by law. I think there is a good argument to be made that modifying a font for your own personal use should constitute fair use, but it is important to remember that this is a _legal_ argument: fair use is an apportioning of rights decided by legislators and courts, not something that users can arbitrarily claim for themselves because it seems right. Good intellectual property law seeks to define and protect the rights of both author and user, and should ideally represent a balance of interests. It takes into consideration both the private good of the author and the public good of the society.   \n   \nTiro EULAs generally permit font modification for personal use, and some also permit modification for redistribution under certain conditions (typically, the condition that recipients of the modified fonts also have valid licenses for the original font). Since any such modified font is a derivative work [_'Tiro Typeworks maintains copyright to all derivative fonts in any format.'_], some of our licenses require that copies of modified fonts be sent to us, and we reserve the right to incorporate the same or similar modifications into future versions of our own releases. This also helps us keep track of the possible source of a modified font if we receive support calls from someone.\n\n"
    },
    {
      "time": " Fri, 2004-01-30 07:22",
      "content": "Everything we've heard from multiple sources agrees that we cannot legally create a T1 version of Trebuchet. We tend to err on the side of discretion. The idea of \"personal use\" in a corporation with 330,000 employees is a difficult one we try to avoid.   \n   \nWe were able to be heavy-handed and tell the art director she had to pick a different font for her project. Just another tiny lesson in licensing reality to the minions here at Giganticorp. I'm thinking it's easier to tell an art director \"no\" because we are a retail corporation and not a design firm.   \n   \nThe corporation does a good job of backing up the typography team on licensing issues. We're allowed the time and budget to investigate font licensing and to make sure we do everything legally.   \n   \nA lot of times, however, we don't hear about a new font that is used until a typographer sees one of their fonts in the store and lets us know what's up. We appreciate those that do!   \n   \nSo the final outcome: There is not now, nor has there ever been a T1 version of Trebuchet here at Giganticorp.   \n   \nThanks for all the help. The discussion has been useful!\n\n"
    },
    {
      "time": " Fri, 2004-01-30 10:46",
      "content": "Please clear up my confusion...   \nLogotypes are often modifcations of existing fonts.   \nAre you suggesting that the designer of the logo, must, in addition to purchasing the font, negotiate with the font designer, for permission?\n\n"
    },
    {
      "time": " Fri, 2004-01-30 11:27",
      "content": "Logotypes are not mods of fonts.   \nThey are usually mods of the typeface outlines in a program such as Ilustrator.   \nBut the font software from which those outlines were extracted by Illustrator has not been altered.\n\n"
    },
    {
      "time": " Sat, 2004-01-31 14:30",
      "content": "\\> How would this hurt a foundry?   \n   \nAs Tiffany alludes to, it can hurt a font house by increasing support calls to it. But in the case of houses selling fonts I'd say that's simply a normal cost of doing business: it's a slight overhead checking that the font in question isn't the one they sold and simply telling the person to bug off. And in the case of MS, pardon me but I'm having trouble feeling sorry for them!   \n   \n\\> the owner of intellectual property has the moral right to dictate how that property   \n\\> is used by others, within the limits of fair use as recognised by law.   \n   \nThis is the classic western way of looking at it (absolute formal law). It doesn't really work, mostly because the laws are unfair, being written by a minority. Formal law is incompatible with human nature. Hammurabi was an idiot.   \n   \nA much better \"law\" is common decency, and this would preclude such ridiculous clauses in EULAs, which are nothing but a lowly scare tactic in almost all cases. But the cruncher is that it's just plain stupid, because it ends up as an ice-breaker _promoting_ \"illegal\" behavior.   \n   \nFont houses of the world, get real!   \n   \nhhp\n\n"
    },
    {
      "time": " Mon, 2004-02-02 12:51",
      "content": "Hrant, who are these font house you want to 'get real'? Again, the vast majority of _foundries_ do permit modifications to fonts in their EULAs. Microsoft is not a foundry, it's a software company and software companies license _software_, usually according to a standard EULA that does not make a distinction between a font, a dll, or any other bundled piece of code.   \n   \n_Formal law is incompatible with human nature._   \n   \nSadly, law exists because of (corrupted) human nature, because people cannot be relied upon to treat each other with 'common decency'. And what is such decency in terms of font use? Is decency really 'common' -- i.e. generally recognised --, or is it debateable, composed of conflicting interests seeking balance. You think decency demands that foundries permit font modification, and you hold them responsible for the illegal behaviour of people who ignore license agreements that prohibit this. I think decency demands that users respect the terms of license agreements into which they enter: if you don't like the agreement, don't agree to it. If you agree to it and then break it, no one is responsible but you.   \n   \nAs stated, above, all Tiro EULAs permit modification for personal use, and I think this is a good thing. But I respect the right of any of my colleagues to disagree and to prohibit modification, and I certainly understand the motivation of software companies to simplify their licensing by treating fonts the same way they treat other code.\n\n"
    },
    {
      "time": " Mon, 2004-02-02 13:03",
      "content": "\\> who are these font house you want to 'get real'?   \n   \nJust the ones that forbid internal modification (in this case).   \n   \n\\> law exists because of (corrupted) human nature   \n   \nI think it exists to make the powerful more powerful.   \n   \n\\> you hold them responsible for the illegal behaviour   \n   \nNo, that wouldn't be fair. But I do hold them responsible for putting an indecent and unintelligent clause in their EULA. (Please let's not get into the \"you're making he victim the perpetrator\" business.)   \n   \n\\> if you don't like the agreement, don't agree to it.   \n   \nI'm sure that's what Louis XVI said right before they relieved him of his head.   \n   \nThe Tiro EULA seems OK though.   \n   \nhhp\n\n"
    }
  ]
}
