{
  "id": "28191",
  "title": "Antherton Cloister",
  "forum": "Blackletter / Uncial",
  "tags": [
    "Blackletter / Uncial"
  ],
  "content": "It's hard to classify this font that I made. I felt I was inspired by blackletter and uncial forms, but clearly this is not either, and it's far too hard to read to think of it as display type. Anyway, I'd just like to get your impressions on the thing.\n\n ![](http://web.archive.org/web/20150318000223im_/http:/typophile.com/files/antherton-test_4811.png)\n  \nYou can download the font at [1001fonts.com](http://web.archive.org/web/20150318000223/http:/www.1001fonts.com/font_details.html?font_id=2586) and make something with it if you like. I don't know what to do with it. \n",
  "author": "cuttlefish",
  "time": "12 Sep 2006 — 4:59pm",
  "uid": "14556",
  "comments": [
    {
      "time": "13 Sep 2006 — 10:40am",
      "content": "This is very nice. I would:  \n1) Probably lose the slant.  \n2) Fix the overly-regular glyphs like the \"M\" (presuming there are others).  \n3) Mind the too-short extenders (like the \"d\").  \n4) Don't re-use parts, like you've done with \"a\"/\"d\".  \n5) Some other stuff.\n\nhhp\n\n"
    },
    {
      "time": "26 Sep 2006 — 4:35pm",
      "content": "Wonderfully original.  \nThe \"k\" is rather ambiguous; it could read equally well as a \"t\".  \nThe \"t\" itself may be a bit too obscure, too, especially since it is taller than the other ascenders, instead of shorter as is usually the case, so I keep wanting to read it as an \"l\".\n\n"
    },
    {
      "time": "26 Sep 2006 — 11:02pm",
      "content": "Character chart from 1001fonts.com:\n\n ![](http://web.archive.org/web/20150318000223im_/http:/typophile.com/files/2586_5291.big.png)\n  \nI'm not sure how one could mistake the \"k\" for a \"t\". It isn't distinct, I'll grant you that.\n\nI suppose this whole thing is due for a revision. I made it years ago and I only had a vague concept of what I was doing. I'm learning a lot more here than I did in my past years of fumbling blindly through Fontographer.\n\n"
    },
    {
      "time": "15 Apr 2007 — 10:43pm",
      "content": "Jason, I'm using this for the invitations for my son's upcoming 7th  \nbirthday party, which has a jungle/animal theme. It's looking super.\n\nhhp\n\n"
    },
    {
      "time": "18 Apr 2007 — 2:01pm",
      "content": "Thanks! I'm glad you found a good use for it.\n\nI'd like to see the invitation, if you wouldn't mind sharing. The last time someone showed me what they used this font for it was for a church newsletter, and you know how those can go.\n\n"
    },
    {
      "time": "18 Apr 2007 — 4:10pm",
      "content": "It's actually nothing memorable... except for the font!\n\nhhp\n\n"
    },
    {
      "time": "2 Nov 2009 — 5:03am",
      "content": "I adore this font and have used it for my etsy banner; \"Mossmottle\". The only thing is the lower case \"t\" is rather cluttered looking on my banner, also Etsy blurs things a little too which is a bit frustrating, and I've deliberately made the word somewhat difficult to decipher by filling it with moss! :-) All in all though this is one of the best elaborate fonts I've ever seen. Thankyou so much for creating it!\n\n ![](http://web.archive.org/web/20150318000223im_/http:/typophile.com/files/msmtlshopbanner_5662.jpg)\n\n"
    },
    {
      "time": "2 Nov 2009 — 5:59am",
      "content": "How timely!  \nI used it as one of my slides in my ATypI talk on Wednesday. I was trying to show that organicity does not depend on chirography. The parts where the strokes bifurcate (and trifurcate!) are especially relevant towards that end. Oh, and I set it green. :-)\n\nSo again, Jason: thank you. Just one thing: some terminals are uncharacteristically stubby. I suggest cleaning up this baby a little bit and actually selling it. The original version could even remain as a free font alongside (which would additionally make it a nice illustration of how pay fonts are generally better).\n\nhhp\n\n"
    },
    {
      "time": "30 Nov 2009 — 11:38am",
      "content": "I see little figures on the terminals waving their arms  \nvery original\n\n"
    }
  ]
}
