{
  "id": "2821",
  "title": "Rolling Stone -August03 What Font?",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi Check out this font from Rollign Stone August 2003 Issue. What is this amazing font? Any info or identity?   \n   \n ![Angelina Jolie Font from Rolling Stone](http://web.archive.org/web/20050516142318im_/http:/www.typophile.com/forums/messages/83/24765.jpg)\n\n",
  "author": "redgumball58",
  "time": "Fri, 2004-01-23 12:35",
  "uid": "2949",
  "comments": [
    {
      "time": " Fri, 2004-01-23 12:44",
      "content": "I don't know, though it looks like a blackletter over Frutiger or something. If it's a typeface (and not a clever design, cool all the same) I'd like to hear its story.\n\n"
    },
    {
      "time": " Sat, 2004-01-24 09:10",
      "content": "Looks to me like a synthesis of [Helvetica](http://web.archive.org/web/20050516142318/http:/www.myfonts.com/fonts/linotype/helvetica/bold/testdrive.html?s=OneToughMother&p=48) and [Fette Gotisch](http://web.archive.org/web/20050516142318/http:/www.myfonts.com/fonts/ef/fette-gotisch/gotisch-ef-bold/testdrive.html?s=OneToughMother&p=48). Very cleverly done.\n\n"
    },
    {
      "time": " Sat, 2004-01-24 12:41",
      "content": "It's a good idea...I'm not entirely sure it was as well executed as it might have been.   \n   \nI think for titling I'd have created a \"Mo\" ligature, more like \"To\".   \n   \nI work a lot with sign making software, and I'm used to the odd lumps and bumps that get created when you combine or weld shapes together. Sometimes they may be geometrically correct, but visually, they've often gotta go. Like the small \"blip\" top left on the \"g\" and the small white space mid left on the \"M\".   \n   \nLike I said, I like the idea, I just think it would have benefited from a bit more polish.\n\n"
    },
    {
      "time": " Sat, 2004-01-24 12:42",
      "content": "Where can I find Royal Family if it has been pulled? I am googling everywhere, any leads?\n\n"
    },
    {
      "time": " Sat, 2004-01-24 13:58",
      "content": "From Typographica:   \n   \n\\> Royal Family was pulled from the collection as   \n\\> a request of Patrick Giasson, the designer of   \n\\> the family.   \n\\>   \n\\> POSTED BY: Rob Irrgang | Jul 14, 2003 07:04 AM   \n   \nThat's it. It's not available anymore.\n\n"
    },
    {
      "time": " Sat, 2004-01-24 18:26",
      "content": "Is there any sample online of this Royal Family for us to see?\n\n"
    },
    {
      "time": " Sun, 2004-01-25 03:51",
      "content": "Great feedback. I think the original post/pict is a hand job, with a Helvetica and Fette Gotisch overlay. Great pick up on that Mark, it hadn't crossed my mind.   \n   \nThanks Yves for the Royal Family Scan! At least it gives me an idea for the direction I want to go in...Superb input, thanks everyone.   \n   \nNo love from Mike Y?\n\n"
    },
    {
      "time": " Mon, 2004-01-26 12:56",
      "content": "Sorry, it looked like everyone had a good grip on this without any interference from me. ;-) I've been gone the past few days, and am just catching up anyway.\n\n"
    }
  ]
}
