{
  "id": "28212",
  "title": "(x) “Emily & Aaron” script on wedding invitation - Bickham Script {Edward Maddison}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello all. Could someone help ID the script font on this weddding invitation? The font used where it says “Emily & Aaron”? I’m trying to recreate a similiar design for the place cards at my wedding to match our invitations. Thanks!\n\n| Attachment | Size |\n| --- | --- |\n| [209\\_front\\_large.jpg](http://web.archive.org/web/20070911194817/http:/typophile.com/files/209_front_large.jpg) | 42.56 KB |\n\n [‹ (x) Dunkin Donuts box type - Frankfurter {Geoff}](http://web.archive.org/web/20070911194817/http:/typophile.com/node/28205 \"Go to previous forum topic\") [\"Mother\" square sans ›](http://web.archive.org/web/20070911194817/http:/typophile.com/node/28218 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911194817/http://typophile.com/user/11557\" title=\"View user profile.\">EqualizingDistort</a>",
  "time": "<br>",
  "uid": "11557",
  "comments": [
    {
      "time": " 13.Sep.2006 10.42am",
      "content": "Bickham Script:\n\n[http://www.linotype.com/98476/bickhamscriptregular-font.html](http://web.archive.org/web/20070911194817/http:/www.linotype.com/98476/bickhamscriptregular-font.html \"http://www.linotype.com/98476/bickhamscriptregular-font.html\")\n\n"
    },
    {
      "time": " 13.Sep.2006 11.01am",
      "content": "_The_ Wedding Font of the 00s.\n\n"
    },
    {
      "time": " 13.Sep.2006 11.05am",
      "content": "I was going to type that in without even looking at the sample.\n\n"
    },
    {
      "time": " 13.Sep.2006 11.07am",
      "content": "Hah!\n\n"
    },
    {
      "time": " 13.Sep.2006 11.23am",
      "content": "What I find sad about it, is that in most instances people aren’t even exploring the typeface. Sad really. It might be the most over-used under-utilized script font.\n\n"
    },
    {
      "time": " 13.Sep.2006 1.04pm",
      "content": "Tiffany, in some ways that’s not all bad. The hugely flamboyant initials can really be overkill, and it also takes restraint not to get carried away with all the optional beginnings, endings and other flares that are part of that set.\n\nOne reason for the limited use we see is that I think a lot of people don’t really know how to use all the OpenType character sets. Some OpenType fonts and applications are more user friendly than others. I don’t know how many times I’ve answered questions about ’how do I get the Bickham Swash font’?\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 13.Sep.2006 2.22pm",
      "content": "True on the OT. But the number of people who don’t understand gets smaller every day. It’s something like the move from CRTs to LCDs, casettes to CDs, DOS to GUI.\n\n"
    },
    {
      "time": " 13.Sep.2006 2.25pm",
      "content": "Or the move from Mac OS 9 to OS X? ;)\n\n- Mike Yanega (former foot-dragger)\n\n"
    },
    {
      "time": " 13.Sep.2006 2.37pm",
      "content": "Mike, have you made the leap at last?\n\n"
    },
    {
      "time": " 13.Sep.2006 2.53pm",
      "content": "Mike, I’m not saying that I wish everyone was using all the swashes. I am only saying that there have been missed opportunities for a little apropos flourish here and there.\n\n"
    },
    {
      "time": " 13.Sep.2006 3.31pm",
      "content": "Patty, yes, I am now struggling to get comfortable with an old version of OS X(10.1) Once that happens, who knows?\n\nTiffany, I understand, and I agree with you that Bickham has a lot to offer. I was burned-out by a customer who wanted swash everything, so I know there can be too much of a good thing.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 13.Sep.2006 3.37pm",
      "content": "I went straight to Tiger. But I’m still running 9 on my other machine.\n\nI like Bickham’s alternate characters & ligs - used a bunch of them in a recent job.  \nThe swashes are a bit over the top.\n\n"
    },
    {
      "time": " 13.Sep.2006 7.44pm",
      "content": "I went from 9.2 to Tiger on my main box, but I’m running a slave with 9.2 still (mostly because it’s easier for my mailing list....)\n\nAt least the 00s have a nicer looking typeface than Park Avenue! ;-)\n\n"
    }
  ]
}
