{
  "id": "28210",
  "title": "Ticket typography rant",
  "forum": "Design",
  "tags": [

  ],
  "content": "I have major problems with typography seen on tickets (movie tickets, boarding passes, etc) Maybe someone can enlighten me on the reasons why it’s usually so bad.\n\nIs the current technology for ticket printing so outdated that it can only do off-register dot matrix patterns? In addition to figuring out the distorted letters, numbers, and cryptic abbreviations, the information organization on airline tickets could drastically be improved. The logical me wants to believe there’s a reason for it all. Is there maybe a digital-based foundation to the design of these things, like the MICR font?\n\n [‹ The letter \"S\"](http://web.archive.org/web/20080415213714/http:/www.typophile.com/node/28236 \"Go to previous forum topic\") [Looking for the best Serif font on earth ›](http://web.archive.org/web/20080415213714/http:/www.typophile.com/node/27736 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080415213714/http://www.typophile.com/user/4186\" title=\"View user profile.\">koleslaw</a>",
  "time": "<br>",
  "uid": "4186",
  "comments": [
    {
      "time": " 13.Sep.2006 10.56am",
      "content": "_Is the current technology for ticket printing so outdated that it can only do off-register dot matrix patterns?_\n\nMy guess is: yes. For ultra fast, high volume printing, dot matrix is still the way to go. Why the letterforms are so poor, I do not know.\n\n"
    },
    {
      "time": " 13.Sep.2006 12.10pm",
      "content": "I would presume the continued use of dot matrix is still used because “it will do”. I guess airlines in particular have bigger issues to deal with. Maybe the letterforms are poor because no-one has given these types of typeface any serious consideration (there’s been plenty of parodies) since the technology that used them became antiquated.\n\nOn the subject of the presentation of information on the tickets, it’s probably down to who ever set up the computer systems behind them. As a programmer,their interest would be in what was quickest and simplest for them to set up, rather than what would be simplest for the user. A similar thing happens with utility bills, and in some cases, websites. I know Erik Spiekermann recently did design work on the tickets for (I assume) DB German Railways.\n\n"
    },
    {
      "time": " 14.Sep.2006 8.10am",
      "content": "Will the airlines profit from printing better tickets? No.\n\n"
    },
    {
      "time": " 15.Sep.2006 3.47am",
      "content": "Probably not. There is however a real benefit from considering the way they present the other information on tickets, for example how long before departure passengers should arrive at their gate. Airlines get hit financially for missing their departure slots so making passengers very aware of the need for puctuality (and the fact that being late means your bags will get a nice flight but you won’t) would be a useful innovation for airlines.\n\n"
    },
    {
      "time": " 15.Sep.2006 11.01am",
      "content": "Most folks that fly these days don’t even use tickets...at least not here in the US. You do it all online and then just check-in at the gate.\n\n"
    },
    {
      "time": " 15.Sep.2006 11.51am",
      "content": "That’s a very valid point but I suspect it’s slightly culture specific –&nbsp;I once heard that Americans use planes like the rest of us use trains. Those who fly frequently are less likely to be the ones who are late to their gates as they are more aware of the dimensions of their airport.\n\nDespite the fact I work on projects similar to the airline ticket one discussed, I agree with the principle that there isn’t really a need for them.\n\n"
    },
    {
      "time": " 15.Sep.2006 12.51pm",
      "content": "Ticketmaster tickets are printed with thermal printers. Don’t leave your tickets in your car on a hot day or they will turn black.\n\nI don’t know how that interfaces with typography but I’m sure there are limitations.\n\nDesigning tickets is a pain. I’ve done many vanity tickets and the amount of legal mumbo jumbo they want on the back is mind-boggling. I think at one point I had it in sub 3pt type. Couldn’t read a lick of it - but it was there and they were satisfied with that…\n\npeace\n\n"
    },
    {
      "time": " 15.Sep.2006 1.20pm",
      "content": "Paul, you’ve made a point I avoided because I couldn’t find a suitably eloquent way of saying it – you did. The design of legal information is (and the attached ethical issues), I suspect an entirely different thread! Out of curiousity, what do you mean by a “vanity ticket”? It’s not a term I’ve come across.\n\nCheers\n\n"
    },
    {
      "time": " 15.Sep.2006 3.53pm",
      "content": "I work in the concert industry and usually we just use standard Ticketmaster tix, but every once in a while there is an event that they want a “vanity” ticket designed for. I don’t know if that’s the official term, it’s just what we call it.\n\nSo it’s the same size as a TM ticket except designed. It’s like working on a miniature painting by the time I’m through including everything that has to go on there.\n\nKind of fun in a super anal retentive way…\n\npeace\n\n"
    },
    {
      "time": " 16.Sep.2006 8.04pm",
      "content": "Great insight, all. Sadly enough, the legal mumbo jumbo jammed on the back of tickets, boarding passes, and other documents, is usually the most “designed” part of the piece. Though it loses some of the charm and authenticity compared to the “undesigned” primary info.\n\n"
    },
    {
      "time": " 17.Sep.2006 8.59am",
      "content": "The extent of my design on the legalese was to make a text box and shrink the text until it fit, if I remember correctly it ended up being 2.7 pts.\n\nAn interesting bit of legalese on a project I just worked on:\n\nEvent date, time, artists and venue are subject to change.\n\nWhat exactly is left? I wanted to add the disclaimer:\n\nIn other words this ticket is useless…\n\npeace\n\n"
    },
    {
      "time": " 17.Sep.2006 12.17pm",
      "content": "I think that’s the inspiration for a new thread Paul – nothing to do with typography but what the hey!\n\n"
    },
    {
      "time": " 17.Sep.2006 4.52pm",
      "content": "Speaking of legal disclaimers, I’m cursed with the job of doing pharmaceutical work which sometimes involves banner ads (shoot me, already) that include tons of safety information and medical references. Imagine a 120x600 wide space crammed with 4 paragraphs of long medical words and superscripted copyright symbols. Destination Ragland, next stop, hyphen-Nation.\n\n"
    },
    {
      "time": " 18.Sep.2006 1.48am",
      "content": "…and I’m sure, despite all your best attempts, it’s completely incomprehensible. Is it any wonder people misuse products and try and sue!\n\n"
    }
  ]
}
