{
  "id": "2822",
  "title": "Pomegranate",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi All!   \n   \nThis is an internal project to redesign the identity of the design company I work for.   \n   \n ![](http://web.archive.org/web/20131019024306im_/http:/www.typophile.com/forums/messages/29/24775.gif)   \n   \nI've decided to go with a very simple text treatment and Clarendon Light seems very appropriate for the word as well as the target market.   \n   \nI've tried to slightly modify the type face in the second and third renditions but I'm always a little nervous about tampering with something like that.   \n   \nAnyway, please have at it! Let me know if what I've done works or if anyone has any other suggestions. I would be happy to hear them.   \n   \nCheers!\n\n",
  "author": "khayden",
  "time": "23 Jan 2004 — 12:21pm",
  "uid": "2950",
  "comments": [
    {
      "time": "23 Jan 2004 — 12:32pm",
      "content": "Tinkering: I think it's a good idea if it's subtle. Like not the middle one, more like the bottom one, but only in one place. Try doing the \"g\" - maybe make a monocular form.   \n   \nSpacing: close up the \"gra\" and \"at\".   \n   \nBTW, I would use a darker red, like vermillion.   \n   \nhhp\n\n"
    },
    {
      "time": "23 Jan 2004 — 12:43pm",
      "content": "I like the \"g\" idea, it would help the word sit on the baseline if it had a monocular G, plus it would through something cool into a typeface that is super hot right now.   \n   \nAaron\n\n"
    },
    {
      "time": "23 Jan 2004 — 12:57pm",
      "content": "Just playing around with Photoshop...   \n   \n ![](http://web.archive.org/web/20131019024306im_/http:/www.typophile.com/forums/messages/29/24780.gif)\n\n"
    },
    {
      "time": "23 Jan 2004 — 1:04pm",
      "content": "RE: \"Clarendon Light seems appropriate for the word as well as the target market\"   \n   \nAs you have stated, I think your type selection is appropriate for the word, but I am partial to Clarendon, having used it for my own logotype:   \n ![CreativeSqueeze](http://web.archive.org/web/20131019024306im_/http:/www.typophile.com/forums/messages/29/24782.jpg)   \n   \nWhat is the target market?   \n   \nThe \"a\" in version 3 is a nice form, but I don't see how it relates to the rest of the type. If you pursued that letterform, you'd have to work the other letters also. It'll take some work, but I think you can make some nice, unique logotype.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "23 Jan 2004 — 1:20pm",
      "content": "I was typing while others were posting.   \n   \nI like that \"g\" idea. I even like that \"g-r\" ligature. The \"g-r\" might even serve well as an element to carry through other promo pieces.   \n   \ngraphic design   \nmake the grade   \ncorporate grammar   \ncommunicate with gravity   \nthe greenroom (instead of the war room)   \ngroovy\n\n"
    }
  ]
}
