{
  "id": "28229",
  "title": "What makes a typeface \"classic\"?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am currently writing my dissertation about ‘classic’ typefaces, well those that make up the Linotype Platinum Collection ( [www.linotype.com/1805/platinumcollection.html](http://web.archive.org/web/20150218043846/http:/www.linotype.com/1805/platinumcollection.html \"www.linotype.com/1805/platinumcollection.html\")), and was wondering if I could get your opinions on a few questions that I have to ask…\n\n- what defines a ‘classic’ face? Is it its age, individuality, history etc.  \n- do you think the faces chosen are a fair selection or have they missed a face or even got it wrong?  \n- do you think they even needed reinventing?\n\nThanks\n\n",
  "author": "ema",
  "time": "14 Sep 2006 — 7:37am",
  "uid": "9908",
  "comments": [
    {
      "time": "14 Sep 2006 — 8:11am",
      "content": "Their Platinum collection certainly isn't a classic collection in my opinion. I think a better way to describe it is that it is a quality collection.\n\nIn my mind 'classic' font's are font's that have proved themselves by standing the test of time and probably a good breadth of uses. The ones that jump to mind are Helvetica (Linotype), Garamond, Eurostyle, Gill Sans (Monotype), Times New Roman (Monotype), Baskerville.\n\n"
    },
    {
      "time": "14 Sep 2006 — 8:17am",
      "content": "I actually have a 'classic' set in my library and there is very little overlap with Linotype's set.  \nTheir's is weighted more to the modern/sans than my set, which includes Garamond, Baskerville, Bodoni, Bembo and Caslon among others.\n\nFor Sans, you have to include Futura and Franklin Gothic I'd think, not to mention Helvetica. I hate Frutiger.\n\nI'd call Linotype's Platinum collection more of a 'versatile' collection.\n\n"
    },
    {
      "time": "14 Sep 2006 — 8:23am",
      "content": "This is interesting, because there are a number of the \"classic\" typefaces are not generally well-liked by typographers and designers. Helvetica is a prime example. Times is another. So there are typefaces that are widely used, but could be improved upon for various reasons - poor digitization when making the transition from film or metal to postscript being one.\n\n"
    },
    {
      "time": "14 Sep 2006 — 8:30am",
      "content": "My knowledge of typeface design/typography is quite minimal at the moment and i'm using this dissertation and an excuse to expand on it.....and the more i read on various typefaces and collections, i am seeing very little of the faces in the Platinum Collection being refered to as \"classics\"\n\n"
    },
    {
      "time": "14 Sep 2006 — 8:33am",
      "content": "\\> This is interesting, because there are a number of the “classic” typefaces are not generally well-liked by typographers and designers. Helvetica is a prime example. Times is another\n\nThis would be because classic and over-used are not mutually exclusive terms.\n\n"
    },
    {
      "time": "14 Sep 2006 — 8:44am",
      "content": "The Platinum Collection is more New Coke than Classic.\n\n"
    },
    {
      "time": "14 Sep 2006 — 8:57am",
      "content": "Brilliant, Nick.\n\nOptima is only a 'classic' because it was one of the early digitized fonts and therefore massively overused. It SO does not merit classic status in my book. And certainly fonts that are bundled in every computer (Times, Palatino) do not necessarily merit 'classic' status. If that's your standard, why not include Arial? Or Comic Sans?\n\nTo me, a classic is a font that has stood the test of time. Fonts like Bembo and Garamond have been around for centuries and can still look fresh.\n\n"
    },
    {
      "time": "14 Sep 2006 — 10:20am",
      "content": "The British historian and critic James Secord made this observation about literary classics\n\n_'Those books that allow us to forget the most are accorded the status of a classic.'_\n\nAnd I think this is applicable to type design in many respects too. A classic typeface is one that dominates an idiom or genre, such that any other typefaces in that idiom are automatically compared to it. A classic typeface also becomes a kind of filter through which we view typographic history. So, for example, we have come to view Venetian typography through the filter of Bembo. And here is where Secord's observation applies, because the filter makes us forgetful and we ignore large amounts of actual Venetian typography.\n\n"
    },
    {
      "time": "14 Sep 2006 — 12:36pm",
      "content": "But who are the \"We\" who become forgetful?\n\nThere are media involved, most obviously when a classic has not been in continuous use.  \nThen it is the cultural arbiters such as Updike, Meggs, Heller and Bringhurst, and the commercial influences such as Linotype, who have some say in the matter.\n\nThis is driven home by Charles Murray in his statistical analysis of \"Human Accomplishment\", where he correlates achievement with mention in published reference works.\n\nAlso, if a particularly talented redesigner, or one who works for a dominant font distributor, goes to work on reviving a face, it stands a much better chance of becoming a classic.\n\n"
    },
    {
      "time": "14 Sep 2006 — 12:50pm",
      "content": "Yes, like FontBureau's redraws of some of the classics.\n\n"
    },
    {
      "time": "14 Sep 2006 — 12:54pm",
      "content": "Classic does not mean beloved by all. You must also consider some visions of classic are marketing attempts. A true classic defines a model. As John Hudson points out, the one you compare the others of its kind to. The older a type is, the less argument about its status as a classic. Nobody argues Garamond but there is more angst about Helvetica. To me AG is the classic European grot but Helvetica rained in many peoples faces since 1957.\n\nChrisL\n\n"
    },
    {
      "time": "14 Sep 2006 — 4:26pm",
      "content": "Classic is everything that is exemplifying, and therefore outstanding, forming a canon of models to be emulated. Applied to typefaces, this means that 'classic' are those that are/were used by classic typographers — which only postpones the question. Nevertheless, I guess, there is a quite greater consensus to be found on its answer.\n\n"
    },
    {
      "time": "14 Sep 2006 — 5:41pm",
      "content": "Hey,  \nOptima is a classic font. It really was the first humanist sans. It is often copied, poorly used and applied to the lowest rung of the typographical ladder. That said though, when used properly it still looks beautiful. It started on fire, has been through metal, film, phototypesetting and now digital. If a font is continually in use, perhaps not always at the zenith of popularity, but used enough through several generations, it becomes a classic. Some fonts are found again and become popular again. I think it is easier to figure Oldstyle and transitional fonts being classic compared to most sans, as time appropriates the classic line.  \nPlantin is a classic while almost every font from film-O-type is not. Why? who uses the fonts from film-O-type (Skokie, Ill)? I did, but it has been 20 years. Photolettering fonts (which I thought were great) are pretty much not in any use (except House did revivalof sorts), of 12,000 font library. Gone. Poof. au revior.  \nI guess just as important as to what is a classic is what is not.\n\nThe Truth shall set you free\n\n"
    }
  ]
}
