{
  "id": "28226",
  "title": "Petition Adobe for unified OpenType support!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I got fed up today (finally) of the spotty OpenType support in Adobe CS applications, so i finally looked up their feature support page and sent them a couple of product feature requests. I’d like to ask all of you who have time to do so to do the same thing. Or if this is not a big concern to you, perhaps you’ll use this form to request a glyph pallete in Photoshop. These were my two requests this morning. Hopefully if Adobe gets enough requests like this, they’ll actually do something about these shortcomings! The link to Adobe’s Product Feature Support Page is:\n\n[http://www.adobe.com/support/feature.html](http://web.archive.org/web/20061116085606/http:/www.adobe.com/support/feature.html)\n\nIf anyone knows of a similar link to petition Microsoft…\n\n",
  "author": "<a href=\"user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": "<br>",
  "uid": "7006",
  "comments": [
    {
      "time": " 14 September, 2006 - 8:37am",
      "content": "I suspect that open type support will happen in all versions in CS3.\n\nPetitioning Microsoft is a better idea. (Not that there is a pressing need for OpenType support in Publisher, but it would be nice in Word and PowerPoint.\n\n"
    },
    {
      "time": " 15 September, 2006 - 11:08am",
      "content": "\\>^D\n\ni’m sure CS3 will have OT support too, but will it be unified? will it work the same way across the full suite of applications? that’s what i would like to see.\n\n"
    },
    {
      "time": " 15 September, 2006 - 11:24am",
      "content": "DONE! Now let’s see if they really do anything about it.\n\nChrisL\n\n"
    },
    {
      "time": " 15 September, 2006 - 12:09pm",
      "content": "\\> but will it be unified? will it work the same way across the full suite of applications?\n\nI would suspect so on the old Adobe ones. I’m not so sure on the ones picked up from Macromedia, like Flash and Dreamweaver. It might be too much to hope that they have completely integrated those programs.\n\nOf course this is just a guess.\n\n"
    },
    {
      "time": " 15 September, 2006 - 12:41pm",
      "content": "_I would suspect so on the old Adobe ones._\n\nI expected so as well, but it turns out different programs handle things differently. if you put a ‘hlig’ feature in your font, InDesign will apply this when you activate discretionary ligatures, Photoshop won’t. Same story with the ‘cswh’ feature and applying swash. Another thing, InDesign will link alternate glyphs to the reference glyph in the glyph palette without an ‘aalt’ feature, Illustrator won’t. It’s these types of things that i hope are cleared up in the near future.\n\n"
    },
    {
      "time": " 15 September, 2006 - 12:56pm",
      "content": "Maybe try Kevin Goldsmith’s Blog ( computer scientist — core technologies, Adobe):\n\n[http://blogs.adobe.com/kevin.goldsmith/categories.html](http://web.archive.org/web/20061116085606/http:/blogs.adobe.com/kevin.goldsmith/categories.html)\n\n"
    },
    {
      "time": " 15 September, 2006 - 1:55pm",
      "content": "\\> _DONE! Now let’s see if they really do anything about it._\n\nWe hear you and we’re working on things, as you speak :^)\n\nPaul, thanks for having started the thread, and for having submitted your request. This type of feedback is very important for us. Please keep it coming!!\n\n(Now allow me to get back to the polytonic Greek conundrum I have in hand.)\n\n"
    },
    {
      "time": " 15 September, 2006 - 2:07pm",
      "content": "Yasou Miguel!\n\n:-)\n\nChrisL\n\n"
    },
    {
      "time": " 15 September, 2006 - 2:18pm",
      "content": "Chris, does that stand for Young Aggressive Sincere Organized and United? ;^)\n\n"
    },
    {
      "time": " 15 September, 2006 - 7:59pm",
      "content": "malista  \n:-)\n\nChrisL\n\n"
    }
  ]
}
