{
  "id": "28238",
  "title": "Problem with Apple Font Tools",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello to all. I have just joined the Typophile list, in the selfish hope of getting some advice on a problem.\n\nI am a font designer, using Windows XP, FontLab 4.6 and Studio 5, and MS VOLT. I have been commissioned to add a Unicode Hebrew set to the Gentium font (with the permission of its owners SIL). No problem with the Windows side of this, but my client needs AAT data added to the font, so that it will behave correctly in Mac applications that don't support OpenType.\n\nThe data is for one purpose only: to place vowel points on the Hebrew letters. Cantillation marks are not required, luckily (even in Lucida Grande these don't work properly).\n\nHe has provided me with a Mac running the latest OS 10.4.7, and I have the Apple Font Tools v 3.\n\nI have been trying to use ftxenhancer to add data from an .add file to this font, using the command ftxenhancer -v -A FluentL2.add FluentL.ttf\n\nThe -v switch is for 'verbose', so that the stages of the process are reported. It starts, and runs as far as 'Generating XML data', then sticks and I get a 'Bus error'.\n\nThe font, although made with Windows, passes ftxanalyser's test without report of a fault, and works normally on the Mac.\n\nThe .add file, in XML format, was composed by extracting a sample .add file from the font with ftxanalyser, which included some Hebrew instructions, and rewriting these to fit my requirements.\n\nIt is absolutely possible that I have made some stupid error in the .add file, but if so, I can't spot it. At present I am using a small test file that has instructions only to place vowels on alef, so it is easy to check the text.\n\nThe font didn't have the same glyph names as those of Lucida Grande: these all end in '-hebrew'. Thinking that it might be vital to use official glyph names, I renamed all the Hebrew characters in LG style, and altered the .add file and tried again.\n\nBut this still caused a bus error. Anyway, in doing this I discovered that the Hebrew glyph names in LG contained several irregularities and one misspelling, so I doubt that exact names matter here.\n\nIn case anyone is interested enough to want a look,\n\n[www.users.dircon.co.uk/~hancock/FluentLTest.zip](http://web.archive.org/web/20131107123704/http:/www.users.dircon.co.uk/~hancock/FluentLTest.zip \"www.users.dircon.co.uk/~hancock/FluentLTest.zip\")  \n [www.users.dircon.co.uk/~hancock/FluentLXTest.zip](http://web.archive.org/web/20131107123704/http:/www.users.dircon.co.uk/~hancock/FluentLXTest.zip \"www.users.dircon.co.uk/~hancock/FluentLXTest.zip\")\n\ncontain the first and second versions of the font, with their .add files. But if anyone else has had trouble with ftxenhancer, I should be very grateful for some more general pointers.\n\nThank you very much in advance,\n\nRalph Hancock  \n [hancock@dircon.co.uk](mailto:hancock@dircon.co.uk)  \n [www.users.dircon.co.uk/~hancock](http://web.archive.org/web/20131107123704/http:/www.users.dircon.co.uk/~hancock \"www.users.dircon.co.uk/~hancock\")\n\n",
  "author": "Ralph Hancock",
  "time": "14 Sep 2006 — 11:43am",
  "uid": "14606",
  "comments": [

  ]
}
