{
  "id": "28256",
  "title": "Logo for clothing company",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I have been given the task to design a logo for a clothing company that will manufacture skirts (for women obviously). It's not supposed to be extremly upper class, neither very hippy style. For the avarage young modern woman I suppose. This is what I have been working on. Any feedback here would be very welcome. Does the design suck? Is it good?\n\n| Attachment | Size |\n| --- | --- |\n| [oppskjortet\\_liten.jpg](http://web.archive.org/web/20110322094043/http:/typophile.com/files/oppskjortet_liten.jpg) | 73.15 KB |\n\n",
  "author": "<a href=\"/web/20110322094043/http://typophile.com/user/5494\" title=\"View user profile.\">green_child</a>",
  "time": "<br>",
  "uid": "5494",
  "comments": [
    {
      "time": "",
      "content": "I think its very nice, is the script an adapted existing typeface?\n\nThe \"since 2006\" troubles me a little, maybe it has too much character and fights with the oppskjortet. A quieter alternative might be a geometric sans like verlag or futura or something?\n\n"
    },
    {
      "time": "",
      "content": "Thank you for your feedback. The script is Poodle Pusher from Nick's Fonts, somewhat modified. You may be right about the \"since 2006\". I will try Gotham or Futura instead. Or maybe a SC Freight?\n\n"
    },
    {
      "time": "",
      "content": "Hi there!\n\nNice work! I think it looks appealing - I'm not 100% sure about the 'Since 2006' typeface - I'd be tempted to try a less organic-looking font (it looks a bit like a celtic type style). It was only on the second viewing that I saw the needle - I like the idea, but I think you're trying too hard to make the acsender of the k like an eye of a needle, and it looks a bit awkward. Why not try to make it flow more and not be 100% like an needle eye as you don't get a counter anyway in the letter k, so it would be noticeable and might well encourage someone to asscoiate the meaning with it). Leave the eye in - the logo doesn't depend on someone 'getting it' to read it - but it's a cute touch if they read that meaning into it.\n\nI'd like to see it at a small size also - the eye of the needle might fill in when it goes small.\n\n"
    },
    {
      "time": "",
      "content": "Here is a new version with Neutraface. It works better already.\n\n ![](http://web.archive.org/web/20110322094043im_/http:/typophile.com/files/oppskjortet_liten2_6614.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Thank you Duckworth for your kind input. I will now let the design rest for a few days so I can see it again with fresh, and not tired, eyes. Here is a small version also.\n\n ![](http://web.archive.org/web/20110322094043im_/http:/typophile.com/files/oppskjortet_small_6017.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I think it's a great logo, I love the subtlety of the needle and pin...\n\n"
    },
    {
      "time": "",
      "content": "great logo!\n\n"
    },
    {
      "time": "",
      "content": "Try to put the 'SINCE 2006' under the lettering 'Oppskjørtet', next to the j's tail, about two or even three times bigger. It will be much more readable (and hence more fit for embroidery at small sizes).\n\n"
    },
    {
      "time": "",
      "content": "I think you need to add a bit more weight to the s j and o; and increase the space between r and t, I read …odet. I am not sure that the pin is as successful as the needle, might need to be thicker or maybe even dropped to keep the image play to a minimum. The cross of the ø looks a bit too symmetrical.  \nHowever, I am not sure that it is appealing to the modern young woman and it might be something as simple as pallette or slightly rotating it.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Very sixties! Is that what you are looking for?\n\n"
    },
    {
      "time": "",
      "content": "I really like it!  \nOne concern: the \"r\" seems a bit heavy and too close to the following \"t\", almost suggesting a \"d\".  \nA subtle adjustment: I would recommend thinning the bottom curve of the \"r\", and moving the vertical stroke of that \"t\" a little to the right.  \nAlso, you might consider tweaking the two \"p\"s so that they are not identical -- after all, it's supposed to look hand done, not mechanical.\n\nIs it too retro for today's young woman -- grandma's brand?  \nIt's hard to say. Kids rock those styles, which is annoying. When I dress like my dad, I look like an old geezer--when my son does it, he looks hip.  \nSo, it might be a good idea to present your client with some alternatives, and have them tested by a focus group.\n\n"
    },
    {
      "time": "",
      "content": "Green\\_Child, Can I include that talking [Thread and Needle](http://web.archive.org/web/20110322094043/http:/typophile.com/node/28022) to my new English book for the Green Children?\n\n"
    },
    {
      "time": "",
      "content": "I think you need to think about how its ultimately going to be used. Will it be stiched into the skirt? Will it be on a label on the skirt and how big will it be used. I will guess unless its very large your Since 2006 will be lost. I would suggest getting more information then you can focus your design based on end use.\n\n"
    },
    {
      "time": "",
      "content": "\"since 2006\"?\n\nWhat's the point of that?\n\nMaybe I'm wrong, but I always thought what little value there was in 'since...' or 'founded...' tag-lines was to indicate some long-term health of the company.\n\nMaybe hold off 25 years or so before adding that. ;o)\n\nThe logotype, though...wonderful!\n\n"
    },
    {
      "time": "",
      "content": "Thanks everyone for the great (and positive) feedback. Very helpful and appreciated. I will tweak the logo a bit more according to your valuable input over the weekend. To be continued...\n\n"
    },
    {
      "time": "",
      "content": "There is a little inconsistency between the line weight of where the interior swash meets the right side of the \"O\" and where it emerges. It might be an optical illusion, but line seems to dramatically narrow as it \"passes through\" the O.\n\nAlso, the curve of the swash on the interior of the O doesn't match the angle that it emerges from the O and travels up to the K. The curve on the interior looks like it produce an exterior swash curving lower, more toward the tops of the Ps. Right now it looks too stiff as it emerges from the O--the swash needs to feel as fluid as it does on the interior of the O.\n\n"
    },
    {
      "time": "",
      "content": "Does your client manufacture skirts for other labels or will this be the final logo that will be used on the skirts? I know a fews things about the apparel industry and it's looked down upon to actually involve tools like sewing machines, needle and thread in a fashion logo. This would work better for a seamstress that manufactured clothing for other labels.\n\n"
    },
    {
      "time": "",
      "content": "I'd recommend a slight alteration to one of the p's so they're each unique...\n\nAs long as it is reproduces faithfully (silkscreened/printed and not embroidered/stitched as others have cautioned), I think this is fantastic. I'm a sucker for visual puns/hidden elements.\n\nOne other random thought... what are your thoughts about the color palette? Maybe a second color (for the thread and the pin) would add some spice? (On the other hand, maybe it would make the puns too obvious.) What does everyone else think?\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "",
      "content": "I think your logo is great, but I'm quite sure it wouldn't work for modern young women in the market where I currently work (south-eastern Brazil). Since I don't know anything about the \"average young modern woman\" in your market (Scandinavia?), I would strongly suggest that you try this logo on a focus group.\n\nMaybe you'll find out that you're in perfect tune with average modern young women in your corner of the world, maybe you'll come to the conclusion that their taste sucks, or that they don't get and/or don't interpret your logo the way you would like them to. Problem is, you can't change the target audience (well, at least not without spending several million dollars on a massive campaign); you must adapt to it.\n\nGet your focus group to rate your logo on several different criteria, using a scale from 1 to 5. For instance:\n\n(a) This logo suggests products that are:  \n1 (old-fashioned) ... 2 ... 3 (neutral) ... 4 ... 5 (modern)\n\n(b) You're most likely to associate this logo with:  \n1 (techno music) ... 2 ... 3 (rock'n'roll) ... 4 ... 5 (classical music)\n\n(c) A product bearing this logo is likely to be:  \n1 (horribly expensive) ... 2 ... 3 ... 4 ... 5 (dirt cheap)\n\nAnd so on. Example (b) might be silly, but questions along these lines can be helpful, since people normally associate things in intricate ways. And anyway, you may want to know whether a girl would feel comfortable wearing an Oppskjørtet skirt to a hip nightclub.\n\nMake sure your scale isn't always 1=low/bad, 5=high/good, or people may become biased towards one end of the scale.\n\n"
    },
    {
      "time": "",
      "content": "I like this.\n\n"
    }
  ]
}
