{
  "id": "2826",
  "title": "Cyrillic/Russian Small Caps in InDesign",
  "forum": "Build",
  "tags": [

  ],
  "content": "I have attempted to turn on SmallCaps in InDesign CS, running on WinXP. Works find with Western typefaces. For Cyrillic, (i.e. Adobe's Open Type Warnock Pro, Palatino Linotype or Minion), it only will small cap the latin text and not the Russian. The only font that seems to work properly for both is Lucida San Unicode.   \n   \nI know, I know., Russian is usually not small capped, but I need it to match the Latin heading.\n\n",
  "author": "<a href=\"/web/20100826074909/http://typophile.com/user/2952\" title=\"View user profile.\">hristofor</a>",
  "time": "<br>",
  "uid": "2952",
  "comments": [
    {
      "time": "",
      "content": "The 'smcp' feature most likely does not include the Cyrillic characters in the font you're using. That is to say, the font is working the way it was built to work, with no feature for Cyrillic small caps (or glyphs to support it, for that matter).   \n   \nAlan\n\n"
    },
    {
      "time": "",
      "content": "InDesign should still do faux small caps, unless that was disabled in CS?\n\n"
    },
    {
      "time": "",
      "content": "Alan is correct, the fonts to which you refer do not contain Cyrillic smallcap glyphs. However, because they do contain an \\<smcp\\> feature, InDesign will not apply fake smallcaps. InDesign will only apply fake smallcaps if the font contains no OpenType feature for smallcaps, regardless of whether particular characters are convered in that feature.   \n   \nThere are relatively few Cyrillic fonts with proper smallcaps. I know of several in development, but only a handful from Paratype (non-OT, last I checked their catalogue) that are currently shipping. My take on this is that if a font contains any smallcaps it should contain appropriate smallcaps for all the characters supported, but obviously Adobe have decided to spend their resources in other ways.\n\n"
    },
    {
      "time": "",
      "content": "Okay, that sucks. If ID can't find glyphs for the small caps being made it should fake them.   \n   \nThough, truthfully, since ID won't let you faux italic and bold, etc, without going through hoops, it shouldn't let you do it with small caps either. Something I realise when I small capped Myriad and realised it looked wrong.   \n   \nCan someone explain why Myriad doesn't have small caps?\n\n"
    },
    {
      "time": "",
      "content": "Almost nobody uses smallcaps, dude.   \nA font with smallcaps should be priced much higher, since it's for connoisseurs.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Cyrillic miniscules are already functionally small caps anyway. I'm thinking that u, ye, f, a, r, and b (this forum doesn't seem to support Cyrillic characters) are the only ones that aren't already small caps. Do the standard miniscules not match the Latin small caps in some way?\n\n"
    },
    {
      "time": "",
      "content": "_Cyrillic miniscules are already functionally small caps anyway._   \n   \nNo, they are not _functionally_ smallcaps: many of them are \\<i\\>visually\\</i\\> similar to small versions of the capital letters in upright style (not in cursive italics), but there is a typographic function for actual smallcaps in Cyrillic text just as there is in Latin text, e.g. acronyms, running heads, etc. The typical difference between Cyrillic smallcaps and Latin ones is that the former tend to be slightly taller, in order to distinguish them more clearly from the similar lowercase letters, whose proportions also differ. This is something to be kept in mind when designing fonts that combine support for multiple scripts.   \n   \nA few years ago I was commissioned to design a set of Cyrillic smallcaps for Minion Cyrillic for a publisher who needed them for a book that included some words that always appeared in all-caps. See attached PDF.   \n\\<!--attachment: Minion\\_Cyrillic\\_SC-24888.pdf\\*mime\\_pdf.gif\\*application/pdf\\*32.9\\*Minion+Cyrillic+smallcaps\\*Minion+Cyrillic+SC%2epdf --\\>\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20100826074909im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Minion Cyrillic smallcaps<br><a href=\"http://web.archive.org/web/20100826074909/http:/www.typophile.com/forums/messages/4101/Minion_Cyrillic_SC-24888.pdf\" target=\"_blank\"><b>Minion Cyrillic SC.pdf</b></a> (32.9 k)</td>\n</tr>\n</table>\n<p></p>\n</center>\\<!--/attachment--\\>\n"
    },
    {
      "time": "",
      "content": "\"Almost nobody uses smallcaps, dude.   \nA font with smallcaps should be priced much higher, since it's for connoisseurs. \"   \n   \nAlmost all the other \"pro\" fonts from Adobe have small caps, why not myriad?   \n   \nAnd I use them, so pfffffft\n\n"
    },
    {
      "time": "",
      "content": "John, I'm curious: Did you [feel the need to] get permission from Adobe and/or Slimbach to do the extension?   \n   \nChris, I use \"true\" smallcaps also. But don't forget, we're weirdos.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Yes, I got permission from Adobe, and also ensured that the client had appropriate licences for Minion to cover the installation of the custom fonts. Arguably, if I had drawn the Cyrillic smallcaps from scratch and had not used any Adobe data, I wouldn't have needed permission, but it's only polite to ask and Adobe have been very good about granting such permission so long as the licensing is properly arranged.\n\n"
    },
    {
      "time": "",
      "content": "\\> if I had drawn the Cyrillic smallcaps from scratch and had not   \n\\> used any Adobe data, I wouldn't have needed permission   \n   \nI agree 100%. But some people don't - some people think type designers should act like they're part of a medieval cartel, a Brotherhood of Lead where the \"elders\" make sure the \"lesser craftsmen\" grovel for permission with breakfast, lunch and dinner. Gag me with an echoppe.   \n   \nhhp\n\n"
    }
  ]
}
