{
  "id": "28266",
  "title": "(x) Unidentified serif face (Noordzij?) - Sudum (unpublished) {Philipp Jüttner}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "This is from a pdf I once downloaded—forgot its source. As the text is from [Gerrit Noordzij](http://web.archive.org/web/20150415064216/http:/typophile.com/wiki/Gerrit%20Noordzij), I suppose so is the typeface. If that's the case, I'm afraid it will not be commercially available. The font specs in the pdf read \"SuduX050-Roman\", \"SuduX050-Italic\" and \"SuduX100-Roman\":\n\n ![](http://web.archive.org/web/20150415064216im_/http:/typophile.com/files/type_ID_5171.jpg)\n\nAny idea? Is it available? And what about other Noordzij-typefaces, as e.g. his \"Ruit\"? (I know \"Ruse\" is available through [TEFF](http://web.archive.org/web/20150415064216/http:/www.teff.nl/fonts/ruse/ruse.html).)\n\n",
  "author": "Rhythmus.be",
  "time": "15 Sep 2006 — 4:12pm",
  "uid": "14571",
  "comments": [
    {
      "time": "15 Sep 2006 — 5:02pm",
      "content": "Have a look there:\n\n[http://typophile.com/node/14918](http://web.archive.org/web/20150415064216/http:/typophile.com/node/14918 \"http://typophile.com/node/14918\")\n\n"
    },
    {
      "time": "15 Sep 2006 — 5:14pm",
      "content": "Thanks. I noticed that all TEFF fonts have a similar name codification. So, probably the face was digitised by Gerrit's son Matthias indeed.\n\nDamn pity those Enschedé fonts are so expensive, considering also that they don't ship as OpenType, neither have many glyphs. No wonder that TEFF publishes so little: with these outrageous license fees, they don't need to bother…\n\n"
    },
    {
      "time": "15 Sep 2006 — 7:24pm",
      "content": "Ludwig - I understand your bitterness about the price. But they publish so little because there are so few design(er)s that are worthy of the name. Lexicon and Renard, for instance, are two of the finest typefaces ever made, digital or pre-.\n\n"
    },
    {
      "time": "16 Sep 2006 — 4:58am",
      "content": "I agree that the TEFF typefaces are outstanding—at least aesthetically. But this has to do more with their designers than it has with corporate policies. Bram de Does' \"Trinité\" is imho the most beautiful typeface ever designed and probably one of the most researched. The same goes for his \"Lexicon\".\n\nBram de Does originally didn't want his \"Trinité\" to be digitised; at that time Matthias Noordzij experimented with Ikarus and suggested that he'd like to digitise Trinité. de Does was reluctant, but in the end convinced by the possibilities and adequateness of the new digital format. But, I guess, the fact that Matthias' father Gerrit had been student together with de Does was an extra argument. So was probably the fact that Enschedé (the esteemed old company) gave up its foundry division. Were it not because of these arbitrary coincidences and corporate tactics, Trinité might be affordable to more than a few Dutch publishing houses.\n\nBram de Does is not only a great type designer, but a most fine human being too. I find it shocking that his talents are exploited in this way. If Noordzij (both father and son) whish to sell their designs at these outrageous fees, that's their decision. But most likely \"Trintité\" and \"Lexicon\" make up for the company's complete turnover, which is why it doesn't need to invest in much more publications.\n\n\\> they publish so little because there are so few design(er)s that are worthy  \n\\> of the name\n\nI think it's the other way around: the technical and other specs of TEFF fonts (no OpenType, no features, no complete glyph sets, harsh EULA) are not worthy of Bram de Does' designs. And as for the name: it was bought from the company that over the centuries added to its esteem by giving opportunities to such men as Fleischman, van Krimpen, Salden and de Does, not by simply buying pre-made designs.\n\n"
    },
    {
      "time": "16 Sep 2006 — 5:45am",
      "content": "Ludwig – as you say Trinité is one of the most researched typefaces, so I'm curious about _Bram de Does originally didn’t want his “Trinité” to be digitised... etc_\n\nWhat is your source for saying this? And the following statements in the paragraph? I too am researching Trinité...\n\n"
    },
    {
      "time": "16 Sep 2006 — 6:22am",
      "content": "Ludwig, I don't think you're being fair. And to me it's mostly  \na business decision, and in some ways it makes great sense.\n\n--\n\nBTW, Trinite was originally owned by Autologic, a CAD firm, no?\n\nhhp\n\n"
    },
    {
      "time": "16 Sep 2006 — 6:23am",
      "content": "I meant that Bram de Does himself did a lot of research before and during the design process of <cite>Trinité</cite>. I don't know about an extensive study on <cite>Trinité</cite>, but the story is adequately covered in the only monograph on de Does:\n\nMathieu Lommen (ed.), <cite>Bram de Does: letterontwerper &amp; typograaf/typographer &amp; type designer</cite>, Amsterdam: Uitgeverij De Buitenkant Publishers, 2003.  \nISBN 90-76452-91-1\n\n"
    },
    {
      "time": "16 Sep 2006 — 6:41am",
      "content": "Hrant — can you say why my statements aren't fair? And in what way the business decision makes great sense? As a business decision, sure. As a decision of people concerned with type and the divulgation of typography, no.\n\nThe TEFF license rates are by far the most expensive. This would make sense if they had a lot to offer. But apart from designs in which they themselves put no effort at all, they don't. Technically speaking, their products are outdated and incomplete. I think lots of small foundries out there could do a much better job and likely would sell their product at more appropriate fees. But they simply can't, because of the copyrights TEFF acquired years ago in a completely different situation.\n\nI think people should get paid for their work. And they also have the right to rate the value of their work themselves. All I am saying is that TEFF determines the price of the work done by someone else (de Does' design), but does not put up an equal amount of work in maintaining the technical quality of the fonts. The complete package of Trinité is sold for almost the same price as Adobe's Font Folio, whereas one Adobe Original on merely technical grounds offers a lot more.\n\nTrinité was never owned by Autologic. It was and still is the property of its designer, Bram de Does. Because de Does was an employee of Enschedé, the company had the rights of distribution. When the firm ordered a photosetter from the Swiss company Bobst Graphic, Enschedé decided to have a new typeface designed by de Does, to be used with the new technology. This was to become Trinité. Bobst Graphic got the license to produce the font, but for exclusive use of Enschedé only. When Bobst Graphic got bankrupt, the firm was bought over by Autologic. It is at this point of time that the first specimen of Trinité was published, under the imprint of Autologic. Autologic tried to get the license to produce the typeface as a digital font, but de Does objected, because of the poor quality of the glyphs they digitised as samples. It is only after that, that Matthias Noordzij convinced de Does and TEFF was founded. I wonder what would have happened with Trinité when Autologic would have gotten de Does's permission…\n\n"
    },
    {
      "time": "16 Sep 2006 — 5:04pm",
      "content": "Fairness is a tricky thing. For example, if your implication that De\\* Does doesn't agree with the pricing is true, then that does constitute a certain unfairness to him; on the other hand Trinite could have ended up at a much worse font house than TEFF, and he can be considered lucky in that respect. So it's a balancing act. And I think your own balancing act has been poor in this thread - the negative way you've cast TEFF in the overall. To an outsider (or at least to me) it basically seems like you're angry that you/more\\_people can't afford Trinite; although I'm all for helping \"mass culture\" along by promulgating good type, it can be argued that many talented people need to be compensated materially for them to engage in making good type to begin with - and making some people angry comes with the territory.\n\n\\* BTW, in Dutch \"qualifiers\" such as \"de\", \"van\", etc. actually become capitalized when the given name is omitted.\n\nIn terms of the business angle, I would say there are (at least) two good reasons for unusually high pricing. One is that pricing is self-fulfilling: something that's expensive is seen as being more valuable. But much more relevant here is piracy: font files are tiny; their effort-to-K ratio is ridiculously high; and something that costs somebody a lot of money is less likely to be shared by that person with others. Even though it's technologically trivial, when you buy a TEFF font you're extremely unlikely to pass it along to your buddy - and you're buddy, if he's really your buddy, will probably understand. The only risk with very high pricing is that too many people will lose respect for you in thinking you're being unfair, arrogant, etc. You seem to be one of those people, and you're certainly not alone. But are there enough of you?\n\nBut perhaps the most important counter to you that I would offer is that the quality of a text face is primarily based on its alphanumeric setting. Not fancy ligature code. The \"magic\" of a text face is in its notan, and superb notan should be pretty expensive, no matter how low-tech the font software is.\n\nFor the history on the Autologic angle, thank you.\n\nhhp\n\n"
    },
    {
      "time": "16 Sep 2006 — 7:52pm",
      "content": "Ludwig – clearly I didn't understand your initial point about De Does' research (rather than anyone elses). Thank you for pointing me to Mathieu Lommens' book, and clarifying the Bobst/Autologic relationship.\n\nWithout wanting to hijack the thread, what I've managed to work out and write about Trinité so far is contained in the following paragraph – for which I am looking for feedback/correction – so if anyone would like to comment?\n\n_Trinité; Designed as a large interchangeable family of weights and styles, Trinité was a reprise of fellow Dutchman Jan van Krimpen’s ideas for a related text family, but made originally for photo setting by Bobst Graphic (later Autologic) in Switzerland. The typeface comprises of three weights of wide roman, two weights of narrow roman, two weights of small capitals and two weights of italic. The seven weights and widths of the roman and italic also come in three ranges of differing heights for the ascenders and descenders; with expert sets, pi fonts and ornaments, the total family consists of 81 separate digital fonts. Due to the pricing and licensing policies of Peter Mathias Noordzij’s Enschedé digital type foundry (TEFF), Trinité remains exclusive – a little-known but much admired typeface._\n\nDo you think this last sentence is 'fair'?\n\nThe issue here is that I think Hrant's point about the high pricing actually protecting the face is correct; (I suspect that like a lot of people in this forum) I happen to know somebody who has been looking for a way of obtaining Trinité without paying the full price for several years – but they have been completely unsuccessful in this attempt. As the ongoing debates about piracy on typophile will suggest, there are not many typefaces one can say this about.\n\nLastly, can either of you please tell me if TEFF still retain the copyright to Cancellaresca Bastarda? And whether they will ever release it as digital font?\n\n"
    },
    {
      "time": "16 Sep 2006 — 8:25pm",
      "content": "\\> ... by Bobst Graphic (later Autologic) in Switzerland.\n\nBetter:  \n\"... by Bobst Graphic in Switzerland (later Autologic in California).\"\n\n\\> Trinité remains exclusive – a little-known but much admired typeface.\n\nMaybe \"little-used\" instead of \"little-known\".\n\nBTW, what I call \"type squatting\", the practice of hogging the rights to a highly desired and/or culturally significant typeface with only a hypothetical interest in and/or ability of actually releasing it, personally bothers me much more than any pricing scheme ever could.\n\nhhp\n\n"
    },
    {
      "time": "16 Sep 2006 — 9:17pm",
      "content": "Cheers Hrant (again). Can I assume from what you say that TEFF are 'type squatting' Cancellaresca B? At least no-one's knocking it off in the meantime then ; )\n\n"
    },
    {
      "time": "16 Sep 2006 — 9:44pm",
      "content": "I can't know (of course). I just get bad vibes like that sometimes, and CB isn't the only such case of theirs. The classic defense of course is We Have The Right. But I think there's also something to be said for abruptly giving away a right that you have, for the greater good; saying for example: \"Dear world, I am too busy and/or too ambivalent, so you may have CB to do with as you please. Have a blast, and godspeed.\" That would be so amazingly gracious and magnanimous - the stuff of legend - and free, nutritious food for culture to thrive on.\n\nhhp\n\n"
    },
    {
      "time": "16 Sep 2006 — 10:46pm",
      "content": "I think Cancellaresca Bastarda was \"knocked off,\" a very long time ago. Richard Beatty Designs came out with Romulus Bastarda, which as far as I can tell is both Romulus and the Cancellaresca. It's obviously not an authorized version and I have never seen it for sale. He may never have released it publically. He sort of disappeared from the scene but was championed somewhat in Stephen Moye's Fontographer: Type by Design.\n\n"
    },
    {
      "time": "17 Sep 2006 — 1:23am",
      "content": "\\>comprises of three weights\n\nNot really helping the discussion, but ‘of‘ in this phrase is not required.  \nTim\n\n"
    },
    {
      "time": "17 Sep 2006 — 3:47am",
      "content": "Hrant\n\nPerhaps my tone on TEFF is a bit harsh and therefore obscuring my point. I would very much like to use Trinité, but (1) I can't afford the TEFF license (which is my problem and nothing to be angry about with TEFF) and (2) I wouldn't even want to use their font software, because it's \"technologically trivial\". I am not angry with TEFF, but rather got \"bad vibes\", as you call it, on their \"type squatting\". TEFF has the exclusive right of producing and distributing Trinité. If they hadn't, I would produce it myself, or would welcome some or more foundries to do so. I would accept high pricing only, if the fonts shipped as OpenType, with complete glyph sets, proper hinting and with a fair EULA.\n\nI didn't mean to imply that Bram de Does doesn't agree with the pricing. I wouldn't know, since I didn't meet de Does yet. All I hear of him, is that he's a very sensitive and modest person, and certainly not the kind of fellow who needs \"to be compensated materially for [him] to engage in making good type\". I also know that back in the metal/photo composition days when he was still working at Enschedé (the original), font production was extremely expensive and pricing accordingly high. And it's a known fact that when market leader Adobe lowered it's fees in the 1990s, digital fonts became way cheaper — except for those of TEFF. Perhaps de Does is not aware of the pity stock flows in DTP world.\n\nYour argument on the piracy/pricing issue, I can follow. But then again, let's be real: it's only fonts! There are lots of things in this world that deserve protection, type design and font production included. Nonetheless should the protective measures be in accordance with the value of the protected good <cite>and</cite> to the likeliness or proportion of its theft. How many people out there have an interest in type? And is it so bad that if someone <cite>gets</cite> interested after all, he wants to try out? Hey, let that kid alone, till he decides to become another brick in the wall and uses the font for commercial purposes. Really, in the whole of human culture and its economy, fonts are not a big think.\n\nTrinité doesn't need \"fancy ligature code\", since it forms its ligatures automatically by its design — in fact it was the first design to do so. And you're completely right that the magic and quality of type \"is in its notan\", if you mean even spacing and overall even greyness by that. de Does spent a lot of effort on it, whereas TEFF just copied the original sidebearings. Coding for automatic glyph substitution, ligatures or otherwise, is however a conditio sine qua non in today's high-end font production.\n\n\\* As for the spelling issue: thanks for the suggestion. I am however natively Dutch speaking and have a degree in philology.\n\n"
    },
    {
      "time": "17 Sep 2006 — 3:52am",
      "content": "Ben — Your summary is all right; Trinité sure is exclusive.\n\nAs for Jan van Krimpen's Cancellaresca Bastarda. All of van Krimpen's designs were acquired by Peter Matthias Noordzij's brother-in-law Frank Blokland from the Dutch Type Library; DTL is not allied with TEFF. Potential \"type squatting\" of the Cancellaresca is on the part of DTL, not TEFF. Last time I spoke with Blokland, and asked him after his plans with the Cancellaresca, he said that he likely would not digitise it in the near future, since it has no commercial importance.\n\nHrant — I am as much as you offended by what you call \"type squatting\". This is really my point with TEFF. We all agree Jan van Krimpen is a classic in type design. So is de Does. And, perhaps, so is S.H. De Roos. Alas, how very much we'd like to use their typefaces (digitally), we are not allowed to do so. Either because the fonts that are issued by the monopolists that hold the rights of reproduction, are way too expensive or their software is outdated, either because the monopolists regard us as too bibliophilistic, financially incapable and hence undeserving clients to make the effort for of producing these classics. Classics, by the way that belong \"to the 'patrimoine humaine', not them \" (cfr [http://typophile.com/node/6411#5](http://web.archive.org/web/20150415064216/http:/typophile.com/node/6411#5 \"http://typophile.com/node/6411#5\")).\n\n"
    },
    {
      "time": "17 Sep 2006 — 8:37am",
      "content": "<cite>Technically speaking, their products are outdated and incomplete. I think lots of small foundries out there could do a much better job and likely would sell their product at more appropriate fees.</cite>\n\nTEFF was one of the first foundries to publish Euro-glyphs for all their fonts…\n\nSure, TEFF-fonts are quite expensive, but compare it to the cost of a single fount from Berthold in the \"old days\" — not excessive at all, I think.  \nNow consider the cost to a designer who wants to compose a publication with Trinité. You'll NEVER use all of the variants in one book, so it's a matter of selecting the variants needed. The more complex your subject matter, the more you'll probably need. But — guess what — the more complex a design, the more you'll charge for it. So what's the big deal? For a simple book you'll probably need no more than three cuts and that's 790 euro. Quite reasonable imho.\n\n"
    },
    {
      "time": "17 Sep 2006 — 8:41am",
      "content": "The Dutch spelling thing I learned from a Dutchman who sounded like he knew what he was talking about on the ATypI list. And I think I've since heard it elsewhere too.\n\n\\> the magic and quality of type “is in its notan”,  \n\\> if you mean even spacing and overall even greyness\n\nSpacing is fully half the story (and the hidden half) but I've actually come to realize that even color isn't the true objective; good notan lives around the threshold of too much divergence and too little. You can see this for example in the difficulty of making a lowercase \"g\" that's neither distracting nor too homogenous with the rest of the alphabet.\n\n\\> S.H. De Roos\n\nIn fact I've been an admirer of the italics especially of his eponymous typeface, and would love to see it released [from captivity].\n\nhhp\n\n"
    },
    {
      "time": "17 Sep 2006 — 9:27am",
      "content": "Bert — Comparison to \"the old days\" simply doesn't make sense. I am speaking of today and the pricing scheme of one foundry to another. In the old days type production was a cumbersome and cost-intensive process: punches were chiseled by hand, matrices being struck and justified by hand, type was founded in costly alloys and so forth. Or different trials were executed with highly expensive glass or film material. Not mentioning the cost of dedicated typesetting systems and plate setters. Back in 1985 a Mac was really a bargain in relation to those one billion dollar systems; compared with the newest MacPro, though, it was outrageously expensive. But nobody makes that comparison. Technology evolves and so do price settings with it. Or at least they should.\n\nSure, not all the different variants of a type family are needed in one project. So what? I might, one day, still need this or that variant and likely will not be happy having to purchase the extra fonts at a cost which in the end is twice the price of the bundle. Certainly not when a similar amount of variants and versatility is offered in that one package I didn't buy, from another foundry/vendor, at one tenth of that price. I also wonder what's the big deal with those variants: weight/width interpolations, adding or modifying the ascenders/descenders of only eleven glyphs. Yes, yes, \"in the old days\"… I know, then these variants were cut by hand, one by one, and founded on different body sizes.\n\nHrant — thanks for the clarification. Could one say \"notan\" is the equivalent of what the Germans call \"Rhythmus\" or \"Duktus\"? You're completely right that more than spacing is involved. De Roos Romein — sigh… What a beauty! I have this Lettergieterij Amsterdam specimen book with the full range and I too hope to one day see it on screen and printed by offset or ppl. You know what? Over there in the U.S., type designs are themselves not protected (read: kept in custody) by copyright laws…\n\n"
    },
    {
      "time": "17 Sep 2006 — 11:28am",
      "content": "Notan is the unity-relation of black and white. It is essentially what allows us to read, and not related to rhythm (which I contend doesn't actually exist at the level of type, not as far as the reader is concerned) or ductus.\n\nBTW, not that I would consider reviving De Roos myself, but the one place I've had a good look at it was not available for scanning or even photcopying, so if you could put up some nice hi-res scans of your specimens (especially mid-range and small sizes, as well as a large size of the italic) that would be highly appreciated.\n\nhhp\n\n"
    },
    {
      "time": "17 Sep 2006 — 2:21pm",
      "content": "Hrant — I made the scans you asked for and put them here (for now):\n\n[http://perswww.kuleuven.be/~u0043518/deroos\\_600ppi\\_1.jpg](http://web.archive.org/web/20150415064216/http:/perswww.kuleuven.be/~u0043518/deroos_600ppi_1.jpg \"http://perswww.kuleuven.be/~u0043518/deroos\\_600ppi\\_1.jpg\")\n\n[http://perswww.kuleuven.be/~u0043518/deroos\\_600ppi\\_2.jpg](http://web.archive.org/web/20150415064216/http:/perswww.kuleuven.be/~u0043518/deroos_600ppi_2.jpg \"http://perswww.kuleuven.be/~u0043518/deroos\\_600ppi\\_2.jpg\")\n\n[http://perswww.kuleuven.be/~u0043518/deroos\\_600ppi\\_3.jpg](http://web.archive.org/web/20150415064216/http:/perswww.kuleuven.be/~u0043518/deroos_600ppi_3.jpg \"http://perswww.kuleuven.be/~u0043518/deroos\\_600ppi\\_3.jpg\")\n\n[http://perswww.kuleuven.be/~u0043518/deroos\\_600ppi\\_4.jpg](http://web.archive.org/web/20150415064216/http:/perswww.kuleuven.be/~u0043518/deroos_600ppi_4.jpg \"http://perswww.kuleuven.be/~u0043518/deroos\\_600ppi\\_4.jpg\")\n\n[http://perswww.kuleuven.be/~u0043518/deroos\\_600ppi\\_5.jpg](http://web.archive.org/web/20150415064216/http:/perswww.kuleuven.be/~u0043518/deroos_600ppi_5.jpg \"http://perswww.kuleuven.be/~u0043518/deroos\\_600ppi\\_5.jpg\")\n\nI guess this is stuff for a new thread: [http://typophile.com/node/28292](http://web.archive.org/web/20150415064216/http:/typophile.com/node/28292 \"http://typophile.com/node/28292\"). This one is becoming tedious, rehearsing the old same crap of \"I grant this price to be outrageous!\" vs. \"I don't!\" (Ay, guilty, mea culpa.) Anyhow, we're discussing the right things on the wrong forum.\n\nIf, against all expectations, you <cite>would</cite> manage to digitise this typeface, please keep me informed — I told Blokland I would like to revive the De Roos Romein myself, until I heard of copyright restrictions in the E.U. I am nevertheless not sure who owns the rights: Blokland was quite vague on this.\n\nBy the way, if you would ever release the fonts, please, keep those damn license fees down!\n\n"
    },
    {
      "time": "17 Sep 2006 — 2:34pm",
      "content": "BTW, did you notice the sample text in the Italic specimen?\n\n<cite>wegen ihrer feinen und zierlichen Formgebung verleiht Sie </cite>[sic] <cite>einer Seite gerade den erwünschten Unterschied ohne die Einheitlichkeit auch nur wenig zu stören.</cite>\n\nThinking of your definition of \"notan\"… I actually read those specimen texts just now, which — appropriately to finish (?) this thread — reminds me of Gerrit Noordzij: \"Perhaps typographers never read.\"\n\n"
    },
    {
      "time": "17 Sep 2006 — 8:11pm",
      "content": "Ludwig, thank you so much for those scans - keepers for sure.\n\nMan, look at the sober grace of that italic. Just amazing.  \nMakes what we usually get look like a gaggle of drunken whores.\n\nhhp\n\n"
    },
    {
      "time": "17 Sep 2006 — 8:31pm",
      "content": "Hrant\n\nWe printed a ton of certificates in De Roos back in the USC Fine Press days. Next time you are in I'll dig them out. Great face. In metal though, very brittle as a result of the casting process used. We had to be very careful with it.\n\nGerald\n\n"
    },
    {
      "time": "17 Sep 2006 — 8:43pm",
      "content": "Super. It might be a early as this Tuesday, but don't rush on my account.\n\nWas it brittle because of the alloy?  \nSomething to do with supplies after the war perhaps?\n\nhhp\n\n"
    },
    {
      "time": "17 Sep 2006 — 10:11pm",
      "content": "Hi\n\nYeah, good guess. Certain kinds of foundry typefaces were cast with different alloys. Scripts were made quite hard which also made them brittle. Same with the De Roos; it didn't wear down, it just chipped.\n\nProbably could get them together by the Tuesday after next.\n\nGerald\n\n"
    },
    {
      "time": "17 Sep 2006 — 11:28pm",
      "content": "Thank you Tim and Ludwig for the feedback about the summary; the thread has provided me with (yet) more stuff I wasn't entirely sure about ... so, now to revise what I'd written about CB... so little time, so many faces.\n\nI too admire the work of De Roos. Thanks for sharing the scanned examples you put up Ludwig.\n\n"
    }
  ]
}
