{
  "id": "28273",
  "title": "perfect dotted line in Illustrator",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I've been trying to make a perfect dotted line in [Illustrator](http://web.archive.org/web/20150215224223/http:/typophile.com/wiki/Adobe%20Illustrator), but nothing seems to work...  \nI've made my own dotted brush, but it keeps deforming in corners... I've tried using a dashed line with round corners & short dashes, but the dots are not perfect circles... At the end I just used the line as a textpath, typed bullets & shifted the baseline negatively to center the bullets on the line.  \nI've searched the internet on tutorials, but they only ever seem to be about expanding dashed lines (flatten transparency; for those interested). I refuse to believe Adobe still hasn't included some way to create a dotted line with perfect circles & an even spacing inbetween them.  \nCan anyone help?\n\n",
  "author": "ill sans",
  "time": "16 Sep 2006 — 4:01am",
  "uid": "13099",
  "comments": [
    {
      "time": "16 Sep 2006 — 4:31am",
      "content": "I use the same method as you settled on, I have tried brushes, but it really seems to be overcomplex or maybe what you and I are trying is too basic; the stroke method will produce circles as long as it isn't expanded using zero as the dash length, but it really seems too long a method to accurately produce a simple shape, when the text path trick works quicker and easier.  \nTim\n\n"
    },
    {
      "time": "16 Sep 2006 — 4:33am",
      "content": "Try creating an elipse as a pattern brush with 100% spacing. That should do the trick, be good to hear if it works out for you\n\n"
    },
    {
      "time": "16 Sep 2006 — 5:05am",
      "content": "I did make a pattern brush with circles, 100% spacing & checked the box \"add space to fit\" so it wouldn't deform the circles. It works well for straight lines, but in sharp corners it turns the circles into rounded triangles. I think the best solution is indeed either using the dashed line with round corners or using your line as a textpath & fill it with bullets.  \nIt seems strange though that Adobe never picked up on this problem & I can't imagine I'm the only person who wants to make a dotted line in Illustrator. Then again, it amazes me just as much that you need to flatten transparancy to expand a dotted line (which doesn't seem to have anything to do with it).  \nMaybe the best thing to do would be to adress this problem to Adobe & hope for the best when Illustrator CS3 comes out ;-)\n\n"
    },
    {
      "time": "16 Sep 2006 — 6:31am",
      "content": "My two cents, thought they may be worth less. Use the pen tool, change the stroke to a dotted line, presto, if it turns or joints, just make sure each path is connected, thus equling one path. Not sure if thats it, I will go experiment.\n\n"
    },
    {
      "time": "16 Sep 2006 — 6:37am",
      "content": "It is actually quite simple to do this in Illustrator. Set your dash to zero, your ends to rounded and set your gap to the amount of space betwen each circle. You will always get perfect circles on your stroke, no matter how large your stroke is. All you have to do is adjust your gap. Have fun!\n\n"
    },
    {
      "time": "16 Sep 2006 — 8:34am",
      "content": "What drives me crazy are two things - one is that the spacing between the dots is kind of all over the place if you're making a shape with corners, such as a square. Quark on the other hand will always put a dot in each corner, although in Quark you can't adjust the spacing between the dots, only the thickness.\n\nMy other peeve is that if you go to \"outline stroke\" you get a solid rather than the dotted rule.\n\nI've resorted to both the bullet method (and then doing \"create outlines\" for the type) and also making a tiny circle, step and repeating it, and then redistributing the spacing using \"Align\".\n\n"
    },
    {
      "time": "16 Sep 2006 — 9:36am",
      "content": "Patrick’s solution is the one I use and the only problem I have is that there seems to be no option to automatically have a dot (or corner dash) in each corner.\n\nI know this would force the spacing or the dash-length but it would be a useful option where precise dot or dash spacing is less important than having neat corners.\n\nIs this an option I have missed?\n\n"
    },
    {
      "time": "16 Sep 2006 — 9:41am",
      "content": "I've tried everything and missed it too. If you could \"outline stroke\" and have it be dots instead of a solid you could manipulate the dots so they're in the corners. But I can't figure out a way to do that either.\n\n"
    },
    {
      "time": "16 Sep 2006 — 10:11am",
      "content": "Patty try flatten transparency and check the box to convert strokes to outlines.  \nHowever you don't end up with circles but an ellipse formed of two circles joined with a rectangle.  \nTim\n\n"
    },
    {
      "time": "16 Sep 2006 — 10:24am",
      "content": "Flatten transparency? Where is that.\n\nOh, I just found it. That's useful (also because it converts the text to outline in one fell swoop), but why don't they let you do that in 'outline stroke'?\n\n"
    },
    {
      "time": "16 Sep 2006 — 3:13pm",
      "content": "Object \\> Flatten transparency & set the raster/vector balance to 100%...  \nIt's a trick I found on the internet some time ago trying to find a way to expand dashed lines.  \nI still don't know what transparency has to do with dashed lines, but it works!  \nAs far as the dotted line with a dot in each corner is concerned, I'm beginning to lose faith in Adobe... Maybe in CS3?\n\n"
    },
    {
      "time": "16 Sep 2006 — 5:11pm",
      "content": "What about using the blend shape tool? Create two tiny little circles and blend them with a specific step number. You can have perfect corners everytime.\n\n ![](http://web.archive.org/web/20150215224223im_/http:/typophile.com/files/step01circlemaking_3738.png)\n\n ![](http://web.archive.org/web/20150215224223im_/http:/typophile.com/files/step02circlemaking_4334.png)\n\n ![](http://web.archive.org/web/20150215224223im_/http:/typophile.com/files/step03circlemaking_5469.png)\n\n ![](http://web.archive.org/web/20150215224223im_/http:/typophile.com/files/step04circlemaking_3555.png)\n\n ![](http://web.archive.org/web/20150215224223im_/http:/typophile.com/files/step05circlemaking_3805.png)\n\n ![](http://web.archive.org/web/20150215224223im_/http:/typophile.com/files/step06circlemaking_5549.png)\n\n"
    },
    {
      "time": "17 Sep 2006 — 4:30am",
      "content": "There are always ways to get what you want, but I was just wondering if there's any \"easier\" way to do it. The problem with the blend tool is that you have to experiment with the number of specific steps to get almost equal spaces between the dots.  \nIt's comforting to hear that I'm not the only one who seems to have experimented with dotted lines & even more so that we all use the same methods ;-)\n\n"
    },
    {
      "time": "17 Sep 2006 — 7:20am",
      "content": "It seems to me to be a flaw in the program that we have to come up with these workarounds for something that should be quite simple.\n\n"
    },
    {
      "time": "21 Sep 2006 — 12:15pm",
      "content": "I just made a couple, and they worked out okay. You have to have the math correct to make circles meet in the corners. For instance. a 240 x 200 point box, with 6 point circles placed 10 points apart works perfectly. (using a stroke of 0, gap of 10, and round caps). Another one, same size box, with 3 point circles placed 8 points apart. (stroke 0, gap 8, round).\n\nThe trick is to figure out the gap to fill the size of box you need.\n\nAnd I don't understand the inability to get round circles in a stroked border. How are they not round?\n\n"
    },
    {
      "time": "6 Oct 2006 — 11:27am",
      "content": "Hello all.  \nI am pretty new here, but I have a super-duper, perfect-dotted-line, dot-on-the-corner, create once use many times workaround.\n\n1. create a 1-point circle with no stroke and black fill\n2. drag circle into swatches\n3. in brush palette create new pattern brush with following settings using the 1-point circle as pattern with following settings \n ![](http://web.archive.org/web/20150215224223im_/http:/typophile.com/files/1point-brush_4867.gif)\n4. away you go!\n\nthis line changes size and shape and colour too, and when you outline stroke, you get free dots!  \nEnjoy :)\n\n"
    },
    {
      "time": "6 Oct 2006 — 11:36am",
      "content": "Nice! Ok so how do you get the circle into the last four windows? I can only get it into the first.\n\n"
    },
    {
      "time": "6 Oct 2006 — 11:44am",
      "content": "Oh. I missed the part about putting the circle into the palette. Lovely!!\n\n"
    },
    {
      "time": "12 Oct 2006 — 8:44am",
      "content": "Excellent suggestions everyone.\n\nI don't mean to be a jerk, though this will sound like it, but in Freehand you've always had the option of a dotted line. I am hoping, as someone who was dragged kicking and screaming to Illustrator, that they will adopt this pretty basic tool in the next version (Now that they've bought freehand, they can cannibalize it). Just so I don't sound like too much of a complainer I will contribute this link I found on this subject, it isn't perfect but might be a quick fix:\n\n[http://docs.rinet.ru/Ill/ch11/05.htm](http://web.archive.org/web/20150215224223/http:/docs.rinet.ru/Ill/ch11/05.htm \"http://docs.rinet.ru/Ill/ch11/05.htm\")\n\n"
    },
    {
      "time": "13 Oct 2006 — 12:16am",
      "content": "a simple way to do it in illustrator :\n\n\\_ make a line with only border (I am not sure of the term, because my illustrator's in french …) color  \n\\_in the border palette :\n\n ![](http://web.archive.org/web/20150215224223im_/http:/typophile.com/files/contour_5066.gif)\n\nand the thickness of the border (2,5 pt) must be half the size of the gap (5pt), of course !\n\n"
    },
    {
      "time": "11 Nov 2006 — 3:16pm",
      "content": "another ... I did a quick scan down the page, so sorry if this is repeating someone elses suggestion, or doesn't respond to 'issues'.\n\nDraw a circle \\> Select the circle \\> Brushes \\> New Brush \\> Select scatter brush, set your spacing at something other than 100 ... no deformations.\n\n;)\n\n----------  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20150215224223/http:/www.solid-creative.com/print.htm)  \n----------  \n [Little Mischief](http://web.archive.org/web/20150215224223/http:/www.littlemischief.com/)\n\n"
    },
    {
      "time": "7 Apr 2007 — 12:44am",
      "content": "It is possible to use a dashed line with rounded corners...it is like Jonathon said...Set your dash to 0 and your gap to any desired number...If it doesnt work perfeclty then try setting the meter to the same number as your stroke weight...from there you can just increase or decrease stroke weight to make the perfect circle dots bigger or smaller.\n\n"
    },
    {
      "time": "27 Jul 2007 — 9:43am",
      "content": "I've been using Filip's method and it works great! However, I found that the circles/dots can become distorted if they are on an irregular path. This doesn't matter if your dots are only going to be a couple points wide, but it will matter if you want large dots.\n\nYou can fix this by creating the original dot with a Stroke INSTEAD of a Fill. Things to remember:\n\n1. Make sure that the stroke fills the inside of the circle\n2. The Stroke options MUST be set to \"Round Join\" and \"Round Cap\" (these are in the Stroke Palette\")\n ![](http://web.archive.org/web/20150215224223im_/http:/typophile.com/files/stroke_5381.jpg)\n3. The wider the stroke is in comparison to the width of the circle, the less possibility there is for distortion. A 1pt circle with a 25pt should be more than sufficient to keep the dots circular. If you want to be more certain that they stay circular, just raise the stroke width.\n\nEnjoy!\n\n"
    },
    {
      "time": "25 Aug 2007 — 6:15pm",
      "content": "i think mine is similar 2 mackit's,\n\nDepending on what settings you have set for weight, line caps, and joins, you can create a stitched line, a skip line, or almost anything. You control the dash and gap (the space between each dash) by entering numbers into the Dash and Gap fields at the bottom of the stroke palette.\n\n ![](http://web.archive.org/web/20150215224223im_/http:/typophile.com/files/stroke_5382_3467.jpg)\n\nIf you're just using one sequence, you can enter just the first two fields. Or you can enter up to three different Dash and Gap settings to achieve complex dash patterns.\n\nexamples below:\n\n ![](http://web.archive.org/web/20150215224223im_/http:/typophile.com/files/06tyi91_3840.gif)\n\nwith rounded caps the larger the weight the larger the gap number just play around n u'll get the effect u want.\n\n ![](http://web.archive.org/web/20150215224223im_/http:/typophile.com/files/tute_5795.gif)\n\n"
    },
    {
      "time": "31 Aug 2007 — 12:10am",
      "content": "Filip's method is probably the better option. To get the dots to 'outline', all you have to do is save your file in one of the old EPS formats. When you reload the file, the dots will only be there and not the lines.\n\nWhen you do that though, make sure it's your final draft -- otherwise you'll lose your editability of the lines.\n\n"
    },
    {
      "time": "23 Oct 2007 — 9:34pm",
      "content": "Thank you for the instructions on how to do this. It works great.\n\nHere is my question:\n\nI created the dotted line and now I need to use it in a different file. I drag and drop it into the new file, but it doesn't allow me to change the color of the dots. If I change the fill color, I get a faint line connecting the dots. I can change the outline color, but it has no effect on the dots. What am I doing wrong?\n\nThanks\n\n"
    },
    {
      "time": "5 Nov 2007 — 6:09pm",
      "content": "[quote]\n\ngardenmomma\n\nIf I change the fill color, I get a faint line connecting the dots. I can change the outline color, but it has no effect on the dots. What am I doing wrong?\n\n[/quote]\n\nI've played around with illustraitor and i see what you mean about the 'faint line connecting the dots' the only way i found to stop this is to select the colour you want and then create the dashed stroke. it looks like illustrator doesn't like changing the colour after a dashed stroke has been made. something i hope they will fix in cs4.\n\ncheers\n\n"
    },
    {
      "time": "20 Nov 2007 — 3:35pm",
      "content": "Is there a way to \"save\" the brush stroke so I don't have to make a new dotted line stroke when I need to make it in a different file?\n\nThanks!\n\n"
    },
    {
      "time": "21 Nov 2007 — 10:43am",
      "content": "You can open your brush library from the original document.\n\n"
    },
    {
      "time": "18 Sep 2010 — 1:15pm",
      "content": "HI I'm new; I came across this site while trying to fix an error. I am trying to create a brush stroke with graduating dots. When I apply the brush to a curved path, (a spiral) my dots are deformed, looking like pebbles. I used this tutorial: [http://www.vectorials.com/tutorials/Dot-Pattern-Art-Brush-in-Adobe-Illus...](http://web.archive.org/web/20150215224223/http:/www.vectorials.com/tutorials/Dot-Pattern-Art-Brush-in-Adobe-Illustrator-90634.html \"http://www.vectorials.com/tutorials/Dot-Pattern-Art-Brush-in-Adobe-Illustrator-90634.html\")\n\n"
    },
    {
      "time": "18 Sep 2010 — 2:11pm",
      "content": "Hi Rainydaze,\n\nWhile there \\*are\\* a couple of Illustrator users frequenting this site, it's mainly about typography. You might get better results when asked in an Illustrator-dedicated forum -- I'd suggest Adobe's own, [http://forums.adobe.com/community/illustrator/illustrator\\_general](http://web.archive.org/web/20150215224223/http:/forums.adobe.com/community/illustrator/illustrator_general).\n\n"
    },
    {
      "time": "17 Nov 2010 — 10:40pm",
      "content": "Thank you, Filipia! This worked pretty darn well, tho' it did distort with a freeform line. I will try using the stroked shape next. Seriously, though, this is too difficult to figure out to believe. Illustrator has some shocking gaps that I hope are addressed soon. Anyway, thanks to all!\n\n"
    }
  ]
}
