{
  "id": "28270",
  "title": "Does anyone print?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does anyone print, I mean with a real press, for any sorts of typographical use? What kind of presses do you use, what size presses and how many colors? What is your workflow, what kind of plates. What kind of paper(s) are you using? Tell me all about it. Why are you printing? I'm getting the urge to maybe get a press and set some specimens and would like to hear from anyone who has undertaken this. I often think that this is the ultimate goal of type, to be printed (sorry webguys.)\n\n",
  "author": "Rodrigue Planck",
  "time": "15 Sep 2006 — 6:58pm",
  "uid": "4592",
  "comments": [
    {
      "time": "15 Sep 2006 — 9:51pm",
      "content": "I don't print nearly enough to have a \"workflow\", but I have been printing letterpress on and off for almost 4 years now. I've only ever used Vandercook cylinder presses, and have never done more than one color. Until recently I only printed from metal type in black ink, mostly to make specimens, including an ATF Garamond waterfall, 60pt Pascal (one version with rules between each sort to extract the sidebearings), and various Baskervilles. The one exception to that was a batch of parody courtesy cards\\* which I submitted to the TypeCon auction. Over the past few months though I had photopolymer plates made and printed my business cards - explained and shown in here: [http://typophile.com/node/21340](http://web.archive.org/web/20131015003141/http:/typophile.com/node/21340 \"http://typophile.com/node/21340\")\n\n\\* \"Don't Mention It\" cards, intended as a preposterously formal reply  \nto a \"Thank You\" card... Set in a cloyingly self-conscious type of course,  \nin bronze ink.\n\nPaper: I like \"honest\" paper - white, hard, thin. Good inkjet paper actually works great! I can't stand the spongey crap that tempts so many printers to smother the type. Goo-goo-gaa-gaa letterpress. I favor what's called a \"kiss\" impression, but when I print specimens for digitization (not too often though) I go even gentler, to the breaking point of the blackness of the letterform bodies. I call that \"platonic kiss\" impression. :-) On the other hand, well-paying clients can ask for whatever the hell kind of impression they want! :-) As long as I won't be damaging some rare beauty of a metal face.\n\nI print letterpress because: it yields a different and useful (in more than one way) result; it's cheaper for small runs; and the control-to-price ratio is great - in the case of my business cards for example I made my own ink using reduced wine. But I personally feel metal letterpress is highly over-rated, and recommend using ppl as much as possible.\n\n\\> this is the ultimate goal of type\n\nTo me that's too creationistic, too Art. The primary goal of type is  \nto help multiple people communicate, not one person express himself.\n\nhhp\n\n"
    },
    {
      "time": "15 Sep 2006 — 9:52pm",
      "content": "I have a Vandercook SP15 proof press and print (not often enough) from magnesium engravings mounted type high. I compose digitally and have the plates made and mounted from film.\n\nI print on all sorts of cardstock and cardboard. My makeready skills are not great though so I don't usually do well with thinner stock, although the few times I've attemped anything of the level of bookwork, I've used Mohawk Superfine, cream, eggshell finish - which is IMHO the be all end all of book paper.\n\nI print because I love to print. not sure why. Ink in the veins maybe. my first job was as an assistant in a print shop, I did letterpresswork all through high school, and then operated a sign press and Heidelberg Windmill after school; in college I took apart and put back together a Windmill and worked on a C&P Pilot in my apartment.\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20131015003141/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": "16 Sep 2006 — 8:16pm",
      "content": "Rodrigue\n\nI did a monograph \\_Printing digital type on the hand-operated flatbed cylinder press\\_ a while back. This will answer some of your questions since it is specifically about printing digital type via the letterpress process. You can find more information about it here:\n\n[http://bielerpressxi.blogspot.com/](http://web.archive.org/web/20131015003141/http:/bielerpressxi.blogspot.com/ \"http://bielerpressxi.blogspot.com/\")\n\njlt\n\nI wouldn't actually recommend printing type from magnesium engravings. One reason is the lack of structural density if mounted on wood [this is also stated in the Heidelberg Windmill manual]. Another is that magnesium corrodes quickly. Of the three metals commonly used for engravings, copper, zinc, magnesium, the latter is the worst for holding detail. Digitally produced film generated engravings, however, aren't as bad as engravings that were generated direct from camera; the latter's distortion is why type was not commonly printed in engraved form. The conjoining of digital film output and the photopolymer plate process eliminated this problem and provided a viable alternative to metal type. You would get far more satisfactory results from this method.\n\nGerald\n\n"
    },
    {
      "time": "16 Sep 2006 — 8:33pm",
      "content": "\\> You would get far more satisfactory results from this method.\n\nBut backs are expensive! (Uh-oh, I just validated one  \nof your qualifications for being a typeface designer...)\n\nhhp\n\n"
    },
    {
      "time": "16 Sep 2006 — 9:11pm",
      "content": "Hrant\n\nBy backs do you mean photopolymer plates?\n\nIf so, about they are roughly the same price as mounted magnesium. Processed photopolymer plates are about a third cheaper than copper, which, if mounted on a honeycomb or patent base, is as good as.\n\nIf you mean bases, well, yes, but that is just the cost of doing business. Presses are expensive, operation space is expensive... The trick is to make more money, using the tools and equipment, than you spend.\n\nBut it's \"characteristics,\" or \"traits' if you will; not \"qualifications.\"\n\nGerald\n\n"
    },
    {
      "time": "16 Sep 2006 — 9:43pm",
      "content": "No, the plates are cheap... even for a type designer. :-)  \nYes, I meant the bases, not the backs, sorry.\n\nhhp\n\n"
    },
    {
      "time": "17 Sep 2006 — 6:08am",
      "content": "Hrant, nice bcs, but what else should we expect, right? It also makes sense that I saw you make a post on trap in fonts (at flexoexchange?) a while back. Gerald, I went to the link and it is quite facinating. My main question is why do you have to distort the fonts? It is obvious you put quite a bit of time and love into the site and book.\n\nI have been contemplating a little 2up 2color offset press, but Vandercook I think is pounding all other types of presses.\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "17 Sep 2006 — 7:46am",
      "content": "Monotype would be worth considering. Takes some-know-how. The lead alloy can be remelted keeping costs under control. No \"base\" is required. Also, polymer plates can be mounted on \"high Monotype spaces\". Typos can be corrected by hand, polymer plates with typos requires a new plate. I know all of you set perfect type, spell like Dr. Squid, so that may not concern you.\n\nWe used both. So I am not biased. Polymer is certainly superior to magnesium plates.\n\nGerald Giampa\n\n"
    },
    {
      "time": "17 Sep 2006 — 7:49am",
      "content": "\\> what else should we expect, right?\n\nDunno about that - it sure took me long enough.\n\n\\> flexoexchange?\n\nYou were there? Wow.  \nBasically I was asking about the amount of ink bleed that's typical in flexo printing. The eventual answer (~1 mil) was in surprising and reassuring agreement with my other sources, including Dwiggins decades ago!\n\nhhp\n\n"
    },
    {
      "time": "17 Sep 2006 — 10:23am",
      "content": "Good things take time. I thought the same thing when I read your post This guy is everywhwer, how does he find the time!\"\n\nGerald, I never even considerd a monotype (My grandfather and father are rolling, becaus we were strictly a Linotype metal house!) but it is interesting and I bet the results, with enough practice could be pretty awesome.\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "17 Sep 2006 — 10:45am",
      "content": "Rodrigue\n\nIt is not an attempt to \"distort\" the letterform but rather a modification. Besides a concern about the weight of digital type in general there is gain to the letterform during the letterpress printing process. A thinning of the letterform will help a bit to counteract this. The idea is to bring the letterform back to what it should look like when printed rather than allow the process itself to distort it.\n\nModification is also a way to provide a form of optimization. I feel this is absolutely essential but it is not commonly practiced at all and yet it takes maybe five minutes to do this in either FontLab or Fontographer. Note that Hrant, our champion of optimization, did not alter the letterforms in this manner when he printed his business card. Maybe I need a fifth \"trait.\"\n\nGerald\n\n"
    }
  ]
}
