{
  "id": "28292",
  "title": "Revival wish list",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Which classic designs Typophiles like to see revived into digital fonts?\n\nPlease mention the year of its release, its designer/punchcutter, the foundry/institution that issued the type, and, if possible, include a sample.\n\n",
  "author": "Rhythmus.be",
  "time": "17 Sep 2006 — 2:02pm",
  "uid": "14571",
  "comments": [
    {
      "time": "17 Sep 2006 — 2:04pm",
      "content": "De Roos Romein (1947, Sjoerd H. De Roos, Lettergieterij Amsterdam)  \nLutetia (1923–24, Jan van Krimpen, Enschedé)  \nPierre Didot l'Aîné (1819)  \nRomain du Roi (1693–1745, Philippe Grandjean, Académie des Sciences)\n\nSome De Roos samples:\n\n ![](http://web.archive.org/web/20150415081148im_/http:/typophile.com/files/deroos_72ppi_2_4229.jpg)\n  \n\n ![](http://web.archive.org/web/20150415081148im_/http:/typophile.com/files/deroos_72ppi_3_5019.jpg)\n\n"
    },
    {
      "time": "17 Sep 2006 — 2:17pm",
      "content": "[Faces I Wish Were Digitized](http://web.archive.org/web/20150415081148/http:/typophile.com/node/12787)\n\n"
    },
    {
      "time": "17 Sep 2006 — 2:36pm",
      "content": "Grandjean (Romain du Roi) was digitised by Franck Jalleau in 1995-1997 for the Imprimerie Nationale. Don't know if it's available to buy.\n\nI would love to see, among other things, a digitisation of Touraine by Cassandre (Deberny & Peignot, 1947) or its lookalike Chambord by Excoffon (Olive, 1945-1951). Both can be seen in Jaspert, Berry & Johnson's Encycl. of Typefaces. Nicely post-deco and not quite as bizarre and dogmatic as Peignot.\n\nVery much looking forward to the digitisation of [Ronaldson](http://web.archive.org/web/20150415081148/http:/www.myfonts.com/WhatTheFont/forum/viewthread.php?threadid=37115) (MS&J, 1884), soon to be completed by Rebecca Alaccari (Canadatype). Not really what you would call a classic, but there's nothing quite like it around anymore, and surprisingly comfortable as a textface despite unclassical letterforms.\n\n"
    },
    {
      "time": "17 Sep 2006 — 3:39pm",
      "content": "Nice choice!  \nCurrently I'm working on De Roos and believe it will be finished next year.  \nI saw it on the \"Catalogue de caractères de la fonderie de caractères Plantin\" and I felt completely in love with that typeface.\n\nDino dos Santos  \nDSType\n\n"
    },
    {
      "time": "17 Sep 2006 — 4:55pm",
      "content": "Dino — Apart from a few comments, I put links to some larger scans in this thread: [http://typophile.com/node/28266](http://web.archive.org/web/20150415081148/http:/typophile.com/node/28266 \"http://typophile.com/node/28266\") (bottom of the page). The scans were taken from a Spanish/Portuguese edition of a specimen book of the Lettergierij Amsterdam \"voorheen Tetterode\". (The Etbs Plantin were the Belgian distributor of this Dutch foundry and are still active as the Belgian exclusive sales agent for Heidelberg Druckmaschinen AG.)\n\nI didn't know about your foundry. Beautiful typefaces, you have there! Please keep me informed of your De Roos revival: I am most interested.\n\n"
    },
    {
      "time": "17 Sep 2006 — 5:37pm",
      "content": "Marc, the Jalleau version is a digitization of what Grandjean ended up with; more interesting to me would be the digitization of the original design by the Bignon committee, especially the highly pure -if also rigidly ideological- italic.\n\nDino, how are you handling the rights issue?\n\nhhp\n\n"
    },
    {
      "time": "17 Sep 2006 — 11:51pm",
      "content": "Element (1934, Max Bitroff, Bauer). If only to shake it up a little with more recent typefaces of the same name; Bitroff got there first with the title, and did a culturally significant design at the same time.\n\n ![](http://web.archive.org/web/20150415081148im_/http:/typophile.com/files/Elementtitle_4017.png)\n\n"
    },
    {
      "time": "18 Sep 2006 — 12:41am",
      "content": "van Krimpen's Lutetia, Romanée and Romulus, of course. I think Fred Smeijers did revive one of them, but it was also never released.\n\n"
    },
    {
      "time": "18 Sep 2006 — 12:42am",
      "content": "One of my wishes  \n [Maximum A](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/index.php?target=shop/shop_details&artikel_id=654&b=0004&pic=a&PHPSESSID=5bba8a32a7c6fec2232498258c8306ba)\n\n"
    },
    {
      "time": "18 Sep 2006 — 1:52am",
      "content": "Another vote for Lutetia. Anybody else read Doyald Young's article about Van Krimpen?\n\n"
    },
    {
      "time": "18 Sep 2006 — 2:24am",
      "content": "My specimens book was published by Établissements Plantin S.A. - Buxelles, Anvers.  \nThe main languages in the book are Portuguese and Spanish, besides French.\n\nI started designing De Roos but then I stopped because there are legal issues I don't know how to handle. I totally ignore if the anyone owns the rights.\n\n"
    },
    {
      "time": "18 Sep 2006 — 3:01am",
      "content": "Actually, Hrant, digitising the Bignon design would be fascinating for more than one reason. Grandjean had to change it because the details were more or less unfeasible in metal type, of course, whereas a digital version could be absolutely true. But at text size we would also see how well it works optically as it is. And probably have to agree with some of Grandjean's changes. First problems in sight: the skinny lowercase g and y.\n\nI must admit I never did really like the Romain du Roi for its symmetrically-seriffed ascenders. How can you get any flow into a text interspersed with Corinthian pillars?\n\n"
    },
    {
      "time": "18 Sep 2006 — 4:04am",
      "content": "Bram — Romulus has been digitsed by DTL; it's not as such on their website (preview only), but it might ship already. (They're in the process of converting their library into OpenType.)\n\nDTL has the rights on van Krimpen's designs, including lots of original drawings (for which, it seems, they paid a high price). The attempt is to digitise and revive JvK's oeuvre: [http://www.dutchtypelibrary.nl/VanKrimpen.html](http://web.archive.org/web/20150415081148/http:/www.dutchtypelibrary.nl/VanKrimpen.html \"http://www.dutchtypelibrary.nl/VanKrimpen.html\"). As far as I know, however, Lutetia and the Cancellaresca Bastarda will likely not be issued very soon. Romanée might be in the pipeline.\n\n"
    },
    {
      "time": "18 Sep 2006 — 4:17am",
      "content": "Dino — Please keep up the good work on De Roos! As far as I remember, DTL tried to get the rights (not planning, though, to digitise/release the face), but did not succeed. I think it was because it's not all too clear who the present owner is. Likely the Buhrmann concern is involved (they own the company that formerly was the Lettergieterij Amsterdam); I grant the rightful owners are De Roos' heirs. I'll try to find out, as long as you're not giving this up. For Beauty's sake, please?\n\n"
    },
    {
      "time": "18 Sep 2006 — 4:50am",
      "content": "I wont give up. I'm working carefully\n\nI wont give up. I'm working carefully on that project.  \nI thought that De Roos was already public domain and I think that is a typeface of major typographic interest.\n\n"
    },
    {
      "time": "18 Sep 2006 — 7:46am",
      "content": "Sorry for disturbing.  \nYou are showing a digital bold or xbold version of Element, right?  \nHere is the regular one. And the guys' name is Bittrof not Bitroff - but this is only a minor detail.\n\nGroup Xa - Gebrochene Schriften - Gotisch  \nElement schmalhalbfett\n\nBauersche Giesserei, Frankfurt am Main  \nErstguß 1934  \nMax Bittrof\n\n ![](http://web.archive.org/web/20150415081148im_/http:/typophile.com/files/1_4154.jpg)\n\n"
    },
    {
      "time": "18 Sep 2006 — 8:10am",
      "content": "\\> Doyald Young’s article about Van Krimpen\n\nWerzat?\n\n\\> Grandjean had to change it because the details  \n\\> were more or less unfeasible in metal type\n\nTrue, but I also think it was as much a stylistic imposition on his part. He shouldn't have done it. It's not like the world had a dearth of conventional italics.\n\n\\> symmetrically-seriffed ascenders\n\nI remember JFP also objecting to that, to the point of ridicule. But I see the positive in it: not only does it express a grand style ahead of its time (note how liked Democratica became centuries later) but I think they actually help readability (by reinforcing extenders). Which is not to say I think the RdR is highly readable overall.\n\n\\> it’s not all too clear who the present owner is.\n\nIf a good effort at research validates this ambiguity, then I personally see the free third-party revival of the design as contingent only upon the informal blessing of De Roos's heir (unless he's unreasonable to the point of misanthropy, in which case I would ignore him). As a point of courtesy protocol however I would inform competing potential revivers of the decision.\n\nhhp\n\n"
    },
    {
      "time": "18 Sep 2006 — 4:50pm",
      "content": "Georg – you're not disturbing and thank you for the correction. Details are good. Yes I had drawn the schmalhalbfett not the mager. Yes I had missed the double t in Bittroff. Now I can fix them both.\n\nActually your example of Maximum A made me think that this type has another name in the English speaking world. It looks familiar – does anyone else agree?\n\nOther types on the wish list to be revived? Er, the Doves Type? (1900, T.J. Cobden Sanderson, Emery Walker, Edward Prince, Doves Press) or have we had this old chestnut already? Monotype Condensa? (designer unknown? date unknown?) The full family of Erbar Grotesk, not just the condensed version. Every time I look through an older specimen books I see stuff that I'm pretty sure has not yet been revived, but everytime I go online I get the opposite feeling!\n\nOr, coming back to De Roos, the Hollandse Mediaeval (1912, Sjoerd H. De Roos, Lettergieterij Amsterdam/Intertype) with its decorated initials...\n\n"
    },
    {
      "time": "18 Sep 2006 — 5:40pm",
      "content": "Ben — The Doves Type has been revived—from drowning—already, by Torbjörn Olsson: [http://www.sinnebild.se/font/large/doves.html](http://web.archive.org/web/20150415081148/http:/www.sinnebild.se/font/large/doves.html \"http://www.sinnebild.se/font/large/doves.html\"). Have a look at his \"Troycer\" too.\n\nAs for De Roos: only his eponymous typeface is really worth mentioning. The Hollandsche Mediaevaal is of historical interest because of its widespread use in the Netherlands and Flanders, and, of course, for its being the first Dutch design since Fleischman, but it's an ungainly thing. (So in order not to bring anyone into temptation of reviving the old bastard, I'm not going to put up these scans.)\n\n"
    },
    {
      "time": "19 Sep 2006 — 1:21am",
      "content": "Ludwig – that should be exhumed, resurrected and revived for the Doves! Did they use scuba divers? ; ) Thanks for the info. I didn't know about Torbjörn Olsson or his site.\n\nI had meant to put up a scan of the Hollandse Mediaeval Initials (if only because on the earlier thread Paul listed people are talking about reviving Helvetica Flair... honestly you can have a Helv Flair revival right after all the other _ungainly things_ in the universe)\n\nBut I can't insert the image and don't know why; worked fine before.\n\n"
    },
    {
      "time": "19 Sep 2006 — 9:07am",
      "content": "A question to you all:  \nWhat about the copyrights?  \nLots of the old german fonts are still belonging to someone.  \nIn my font collection I have some hundreds of examples of german fonts and all are scanned in low reselution and high res for a print-project what we'll start in 2007.\n\nIs it legal to offer and to use high res scans for typographists to revive these fonts? (Not only by law but although from an ethic standpoint).\n\nPlease let me know.\n\nHere is my font collection - all classified by DIN 16 518\n\n[http://www.bleisetzer.de/index.php?target=shop/shop&b=0004](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/index.php?target=shop/shop&b=0004 \"http://www.bleisetzer.de/index.php?target=shop/shop&b=0004\")\n\nGeorg\n\n[Preußisches Bleisatz-Magazin](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/)  \n [\"Ich bin ein Preuße, kennt Ihr meine Farben?\"](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/img/ichbineinpreusse.mp3)\n\n"
    },
    {
      "time": "19 Sep 2006 — 9:13am",
      "content": "Man, you Germans sure used to know how to make Italics. What happened?\n\nhhp\n\n"
    },
    {
      "time": "19 Sep 2006 — 10:25am",
      "content": "Sorry?\n\nGeorg\n\n"
    },
    {
      "time": "19 Sep 2006 — 10:42am",
      "content": "Well, you weren't the only ones - the French also knew how to make them towards the end of the 19th century - but then all of you started falling for the Italian stuff. Revive the genius\\* of Höhnisch, please.\n\n\\* Please see my post of September 20.\n\n ![](http://web.archive.org/web/20150415081148im_/http:/typophile.com/files/GenzschItalic_4457.jpg)\n\nhhp\n\n"
    },
    {
      "time": "19 Sep 2006 — 10:44am",
      "content": "BTW Georg, for your consideration:  \n [http://typophile.com/node/28118](http://web.archive.org/web/20150415081148/http:/typophile.com/node/28118 \"http://typophile.com/node/28118\")\n\nhhp\n\n"
    },
    {
      "time": "19 Sep 2006 — 11:44am",
      "content": "Walter Höhnisch's genius by designing the National in 1934?  \nMay be it was the right time to make money with these kind of fonts but its opportunistic, isn't it? I do not think the National is a genius one, sorry.\n\n ![](http://web.archive.org/web/20150415081148im_/http:/typophile.com/files/1_3883.jpg)\n\nI prefer the german types before 1933.  \nOne of my favourite types what I'ld like to beware is e.g.\n\n ![](http://web.archive.org/web/20150415081148im_/http:/typophile.com/files/2_4361.jpg)\n\nYou know that?  \nElegant-Grotesk halbfett  \nD.Stempel AG, Frankfurt am Main  \nErstguß 1928  \nGustav Möhring\n\nGeorg  \n [Preußisches Bleisatz-Magazin](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/)  \n [\"Ich bin ein Preuße, kennt Ihr meine Farben?\"](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/img/ichbineinpreusse.mp3)\n\n"
    },
    {
      "time": "19 Sep 2006 — 12:18pm",
      "content": "Georg — There is no problem with publishing specimens. After all, fonts are meant to be used in printing or other publishing projects, right? What others intend to do with those publications is something different, for that matter. For a digital revival, legally one would have to acquire the proper rights from the present owners, I guess, if the designs and/or names are not in the public domain already. How is Dipl.-Ing. Menzel managing the rights issue? [http://www.romana-hamburg.de/fraktur1.htm](http://web.archive.org/web/20150415081148/http:/www.romana-hamburg.de/fraktur1.htm \"http://www.romana-hamburg.de/fraktur1.htm\")\n\nI suggest you take contact with the Bund für deutsche Schrift und Sprache. They published an interesting book with specimens of 114 German types, most of it Fraktur: Wolfgang Hendlmeier (ed.), <cite>Kunstwerke der Schrift.</cite> Gedichte und Sinnsprüche im Kleide schöner Druckschriften aus sechs Jahrhunderten, Bayreuth: Bund für deutsche Schrift und Sprache, 1994.\n\nReviving typefaces of typographic interest, is imho always ethically right. If the designer is still alive, it makes no sense to \"revive\" a typeface of his; plagiarising his design would be robbery. If he's passed away, I think his children should benefit from their father's labour, to a certain extent. But if some clever boys managed to get hold of someone else's intellectual property, making money out of it by acting as monopolists, denying mankind access to its cultural heritage, ignoring these mercantile stolen \"rights\" is not only ethically correct, it's a moral obligation.\n\n"
    },
    {
      "time": "20 Sep 2006 — 5:40pm",
      "content": "Georg, \"genial\" was too strong a term - sorry. I was rushed - normally I use that term very rarely - but instead of editing it and making your post confusing I've just asterisked it.\n\nThat said:  \n1) Nobody's perfect, and the more type you make the more likely you'll end up with a lemon or two.  \n2) Making money sometimes or even often (some would even say usually) does not preclude being intelligent, insightful or culturally responsible.\n\nLooking specifically at your two samples\\*, I would say:  \n1) Elegant-Grotesk is cute[r], but not really significant. And I can see plently of issues of craft in its forms.  \n2) National might have been overly nationalistic and/or mainstream when it was made, but right here right now it's more useful and interesting than Elegant-Grotesk.  \n3) If you feel that either of those (and specifically Elegant-Grotesk) are more interesting and more worthy of revival than the Höhnisch sample I posted above, then we really are looking for very different things in type design.\n\n\\* And assuming you meant to say \"be aware\", not \"beware\" above.\n\n\\> There is no problem with publishing specimens.\n\nActually IIRC, P M Noordzij once told me (I have the email somewhere) that merely scanning a type sample and sending it to a friend is illegal in the Netherlands, much less \"publishing\" it. Of course, each country is different, but be careful of blanket statements.\n\n\\> mercantile stolen “rights”\n\nHere again I think you're being unfair.\n\nhhp\n\n"
    },
    {
      "time": "20 Sep 2006 — 6:29pm",
      "content": "I should have been more precise. Why do you use fonts? Right, to set type. Should that mean, with those fonts of which you legally purchased the user's license, you're supposed to set running text only (for which, of course, you or your client has the proper copyrights)? Are you not allowed to set <cite>and</cite> publish alphabets and such? Of course you are. Probably someone did this before, though, and he might have done so in a particular inventively new composition, of which he, the type specimen designer, is the rightful owner. You cannot simply steel his work and copy it right along. But is P.M. Noordzij or whoever now going to tell whether \"The quick brown fox\" or \"Quousq; tandem\" has been set already in, say, 10/12, in that particular font, so that nobody else can do that any longer without copyright infringements? Honestly, that's mere nonsense!\n\nI suppose Georg and every other type collector that desires to give the world a glance at his collection, has to set those specimens all over again, instead of scanning those which are available already. Poor, poor world.\n\n"
    },
    {
      "time": "20 Sep 2006 — 11:07pm",
      "content": "Well,  \nfirst of all: Good Morning. Its 8:03 am in Germany and this is not my time.  \nI'll think about your arguments, you brought logical ones.  \nWhat I do is not only to collect fonts.  \nMy place here is like a heater: I buy old german typesetting departments (there are still dozends of it all over Germany from family printing companies, which are existing since more than two or three generations).  \nI clean and check the types and I print new ones with a full sort of alphabet, digits and - what is it in english \"Punkturen\" (all special signs). After printing I offer the type in my Online-Shop and give it back to printers again. Because I want it to be used in real life, not only sleeping in my cabinets. There is a small community of, let's say, 200 up to 300 printers from Germany, Italy, England and from the US, which buy and use my types.  \nFor 2007 I am planning a printing project - so I scan all my alphabets. May be you'll see it as senseful for your own projects to use one of my scans. Let me know.  \nI want to look for some advices from some experienced typesetters here in Germany to make my own decision.\n\nRegards,  \nGeorg  \nPS: Please do not use those fonts between 1933 and 1945 - there are other fonts which even better characterize Germany.\n\n[Preußisches Bleisatz-Magazin](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/)  \n [\"Ich bin ein Preuße, kennt Ihr meine Farben?\"](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/img/ichbineinpreusse.mp3)\n\n"
    },
    {
      "time": "21 Sep 2006 — 12:03am",
      "content": "@ben\\_archer  \n\\>Actually your example of Maximum A made me think that this type has another name in the English speaking world. It looks familiar – does anyone else agree?\n\nDoes that reminds you of some Neville Brody stuff?\n\nps.  \nMorgen, Georg\n\n"
    },
    {
      "time": "21 Sep 2006 — 12:16am",
      "content": "Hallo Poms,  \ndie typophile Welt ist klein, isn't it?\n\nGeorg\n\n[Preußisches Bleisatz-Magazin](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/)  \n [\"Ich bin ein Preuße, kennt Ihr meine Farben?\"](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/img/ichbineinpreusse.mp3)\n\n"
    },
    {
      "time": "21 Sep 2006 — 1:20am",
      "content": "before even bothering about reviving atrocities\\* like National, Tannenberg, Gotenburg etc. – give me a digital Futura with optical sizes!\n\n\\* i mean it!\n\n"
    },
    {
      "time": "21 Sep 2006 — 1:58am",
      "content": "hrant said :  \n\\> the Höhnisch sample I posted above\n\nI thought the sample was Genzsch Antiqua - Kursiv, by Friedrich Bauer. Now I'm confused :( Looks very close to the version digitized by [G. Helzel](http://web.archive.org/web/20150415081148/http:/www.romana-hamburg.de/Schriftmappe.zip)\n\n"
    },
    {
      "time": "21 Sep 2006 — 2:11am",
      "content": "This is Genzsch Antiqua kursiv:\n\nGenzsch & Heyse, Hamburg  \nErstguß 1908  \nEntwurf Friedrich Bauer\n\n ![](http://web.archive.org/web/20150415081148im_/http:/typophile.com/files/1_3474.jpg)\n\nFrom Walter Höhnisch worked for Ludwig & Mayer.  \nHere you can find all his fonts:  \n [http://www.klingspor-museum.de/KlingsporKuenstler/Schriftdesigner/Hoehni...](http://web.archive.org/web/20150415081148/http:/www.klingspor-museum.de/KlingsporKuenstler/Schriftdesigner/Hoehnisch/Hoehnisch.pdf#search=%22walter%20h%C3%B6hnisch%22 \"http://www.klingspor-museum.de/KlingsporKuenstler/Schriftdesigner/Hoehnisch/Hoehnisch.pdf#search=%22walter%20h%C3%B6hnisch%22\")\n\nGeorg\n\n[Preußisches Bleisatz-Magazin](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/)  \n [\"Ich bin ein Preuße, kennt Ihr meine Farben?\"](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/img/ichbineinpreusse.mp3)\n\n"
    },
    {
      "time": "21 Sep 2006 — 2:26am",
      "content": "Now I'm really confused. The Helzel version looks different.\n\n ![](http://web.archive.org/web/20150415081148im_/http:/typophile.com/files/genzsch-helzel_5873.JPG)\n\nUnfortunately the pdf from Klingspor Museum doesn't have many samples.  \nI think someone should make a searchable online database with low resolution samples of all those old fonts ...\n\n"
    },
    {
      "time": "21 Sep 2006 — 2:34am",
      "content": "Great idea! The TypeBank: just load up the samples you've got, fill in the form with all the data there is to it. You can search by period style, designer, punch cutter, whether or not there exist digital revivals (with a listing) &c. &c.\n\n"
    },
    {
      "time": "21 Sep 2006 — 4:01am",
      "content": "Alright, with Genzsch Antiqua Gerhard Helzel shows the right version and I the wrong one - sorry about that.\n\nThis is a scan from the original Genzsch & Heyse specimen from 1908:\n\n ![](http://web.archive.org/web/20150415081148im_/http:/typophile.com/files/genzsch_4975.jpg)\n\ngrrrr..\n\nGeorg\n\n[Preußisches Bleisatz-Magazin](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/)  \n [\"Ich bin ein Preuße, kennt Ihr meine Farben?\"](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/img/ichbineinpreusse.mp3)\n\n"
    },
    {
      "time": "21 Sep 2006 — 7:25am",
      "content": "Futura is a caricature of type. My pet name for it is Fartura.\n\nhhp\n\n"
    },
    {
      "time": "21 Sep 2006 — 7:32am",
      "content": "\\> before even bothering about reviving atrocities\\* like National,  \n\\> Tannenberg, Gotenburg etc. – give me a digital Futura with  \n\\> optical sizes!\n\nIt seems Paul Renner's Futura was Adolf Hitler's favourite typeface:  \n [http://www.druckerey.de/pdf/FrakturschriftSZ2005.pdf](http://web.archive.org/web/20150415081148/http:/www.druckerey.de/pdf/FrakturschriftSZ2005.pdf \"http://www.druckerey.de/pdf/FrakturschriftSZ2005.pdf\")\n\nTannenberg has been revived, by both G. Helzel and Delbanco Schriften.\n\n"
    },
    {
      "time": "21 Sep 2006 — 11:39am",
      "content": "\"Futura is a caricature of type. My pet name for it is Fartura.\"\n\nYou are joking, are'nt you?\n\nGeorg\n\n[Preußisches Bleisatz-Magazin](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/)\n\n"
    },
    {
      "time": "21 Sep 2006 — 11:57am",
      "content": "No, and sadly neither was Renner. Or maybe he was simply being <cite>opportunistic</cite>...\n\nAnd something else to fan the mainstream flames:  \n [http://www.themicrofoundry.com/ss\\_fraktur1.html](http://web.archive.org/web/20150415081148/http:/www.themicrofoundry.com/ss_fraktur1.html \"http://www.themicrofoundry.com/ss\\_fraktur1.html\")\n\nhhp\n\n"
    },
    {
      "time": "21 Sep 2006 — 12:10pm",
      "content": "@ Ludwig, do you understand this german article you sent the links from?  \n\"It seems Paul Renner’s Futura was Adolf Hitler’s favourite typeface:  \nhttp://www.druckerey.de/pdf/FrakturschriftSZ2005.pdf\"\n\nWhat you say is absolutely wrong.  \nThere is not one sentence in the article about Paul Renner.\n\nPaul Renner was striktly forbidden to work as a typographist after 1933. He was against the Nazis.\n\nThe article explains about the so called \"Fraktur-Verbot\" (all use of Fraktur were forbidden) sind 1941. Only Antiqua fonts where allowed for all administrative letters.\n\nGeorg\n\n"
    },
    {
      "time": "21 Sep 2006 — 12:15pm",
      "content": "Obsessively linking everything -such as the future of a resplendent and highly promising typestyle- to the misdeeds and twists of your previous generation is holding you (and by extension the whole world) back. Don't be such Hellers.\n\nhhp\n\n"
    },
    {
      "time": "21 Sep 2006 — 12:38pm",
      "content": "Lieber Georg — Haben Sie den Artikel gelesen? Ich nehme an Sie verstehen ja besser Deutsch als ich. Bitte keine Schlauheiten, besonders wenn Sie sich nicht mal die Mühe nehmen zu prüfen entweder was Sie verkündigen richtig sei.\n\n\\> There is not one sentence in the article about Paul Renner.\n\n<cite>Daß Hitler die gebrochenen Schriften nicht mochte, zeigt Luidl an einem Beispiel: ein Wettbewerb für einen Urkunden-Entwurf. <strong>Hitler entscheidet sich für die Futura</strong>, eine serifenlose, moderne Schrift. Luidl führt dazu nichts weiter aus, dabei ist diese Geschichte hochinteressant und unterstreicht Hitlers modernen Geschmack. Die Futura war 1928 unter den Händen <strong>Paul Renner</strong>s entstanden mit dem etwas absurden Anspruch, die Schrift dieser Zeit zu sein. […] Hitlers Leute, so Luidl, nannten <strong>Renner</strong> einen Kulturbolschewisten, machten da also keinen Unterschied, weil sie eigentlich der Fraktur anhingen. Hitler selbst differenzierte gewiß unbewußt zwischen <strong>Renner</strong> und Bauhaus, <strong>wenn er die Futura anderen Schriften vorzog</strong> und gegen das Bauhaus wetterte</cite>\n\nSS. 2–3\n\n"
    },
    {
      "time": "21 Sep 2006 — 12:44pm",
      "content": "Hrant — That's what they call \"die Deutsche Betroffenheit\".\n\nBut let's us continue talking about type. Even Hermann Zapf drew a blackletter (his Gilgenhart), <cite>after</cite> the War. I notice a growing interest for the blackletter (Fraktur, Gotisch, Rundgotisch, Schwabacher) in the type world. Books are being published, in Germany, typepset in blackletter again.\n\n"
    },
    {
      "time": "21 Sep 2006 — 12:52pm",
      "content": "Whee, van Krimpen's type in digital! Now if I can only read Dutch :)\n\nSpeaking of Romain du Roi revival, I did make a topic about it here. Somebody -- that I unfortunately don't remember -- also replied that he was in the process of digitizing it. Here's to seeing it soon.\n\n"
    },
    {
      "time": "21 Sep 2006 — 12:55pm",
      "content": "Lieber Ludwig,  \nich bin froh, daß Sie besser deutsch verstehen und schreiben als ich englisch.\n\nIch kenne den Autor des Beitrages im PDF. Er ist ein guter Bleisatz-Freund und ein guter Kunde von mir. Wir haben fast täglich Kontakt über ein deutsches Typographen-Forum. Aus diesem Grund kenne ich auch seine Einstellung zu diesem Thema.\n\nIhr genanntes Beispiel zeigt eindeutig, daß Hitler die Fraktur ablehnt. Eben weil er sich stattdessen im Beispiel für die Futura entscheidet. Aber das bedeutet doch nicht, daß die Futura seine Lieblingsschrift ist.\n\nIf you ask me which font I like more:  \nUnivers or Folio-Grotesk (I don't like both) I'ld say: Folio.  \nBecause its from K.F.Bauer. But this does not mean that I like the Folio.\n\nGeorg\n\n[Preußisches Bleisatz-Magazin](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/)\n\n"
    },
    {
      "time": "21 Sep 2006 — 12:57pm",
      "content": "\\>Books are being published, in Germany, typepset in blackletter.\n\nTell me, show me. Blackletter for copytext, i would directly go to my local bookstore buying it. I don't mean headlines in fraktur and FF Din for the copy ;)\n\n"
    },
    {
      "time": "21 Sep 2006 — 12:59pm",
      "content": "@ Ludwig\n\nYou are thinking in stereotypes.  \n\"The Germans\" is as wrong as \"The Americans\".\n\nBut its alright.  \nWould be more honest to ask me to leave instead of starting to flame me, mh? Question of style.\n\nHowever: All the best for your stereotype futures, guys.\n\nGeorg\n\n[Preußisches Bleisatz-Magazin](http://web.archive.org/web/20150415081148/http:/www.bleisetzer.de/)\n\n"
    }
  ]
}
