{
  "id": "28299",
  "title": "Finished Depot",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi all,\n\nI posted this a while back, I continued to work on it and I think it might be finished now. I'd love to know what people think.\n\n[Depot](http://web.archive.org/web/20131012025020/http:/homepage.ntlworld.com/c.dickinson40/Character%20Set-1.pdf) (180 KB, PDF)  \nc.\n\n",
  "author": "coop",
  "time": "18 Sep 2006 — 6:01am",
  "uid": "5642",
  "comments": [
    {
      "time": "18 Sep 2006 — 8:01am",
      "content": "I think this is very well done. I would love to see some text settings in English though to get a better feel for it.\n\n"
    },
    {
      "time": "18 Sep 2006 — 2:01pm",
      "content": "Very nice! Easy to read & pleasing to the eye.  \nI'd like to see the first page without the name \"Depot\" on the background.\n\n"
    },
    {
      "time": "18 Sep 2006 — 2:47pm",
      "content": "A nice clean and useful sans - seeing something set in a English sample pdf would be nice\n\n"
    },
    {
      "time": "18 Sep 2006 — 2:47pm",
      "content": "Thanks for the reply  \nUpdated PDF's [here](http://web.archive.org/web/20131012025020/http:/homepage.ntlworld.com/c.dickinson40/Character%20Set-2.pdf)\n\n"
    },
    {
      "time": "19 Sep 2006 — 6:52am",
      "content": "Niccce!  \nI wonder what else we can make you do ;-)\n\n"
    },
    {
      "time": "19 Sep 2006 — 8:22am",
      "content": "The english text setting is much better. Personally I like seeing some large phrase, and single word settings on specimens as well. Take a look at Font Bureau's and Process Type Foundry specimen sheets. Pull some words that contain the characters you feel most strongly convey the spirit of the face. (Not trying to create more work for you, but I think it may help get some additional comments as well). I hope some of the type designers here chime in, I think this is a very solid face. There are a few things I noticed, will comment later when I have more time. Great work.\n\n"
    },
    {
      "time": "19 Sep 2006 — 9:36am",
      "content": "Oops, you misspelled Medium at the bottom of the second page.  \nMaybe you should wait for Chris' comments before adjusting it though ;-)  \nAny plans of making this font available?\n\n"
    },
    {
      "time": "19 Sep 2006 — 11:06am",
      "content": "Aah I'll make sure I spell check in future.\n\n[**Here**](http://web.archive.org/web/20131012025020/http:/homepage.ntlworld.com/c.dickinson40/fullSet.pdf) is a full character set PDF\n\n"
    },
    {
      "time": "20 Sep 2006 — 11:20pm",
      "content": "Hi,\n\nI've taken Chris' advise and done a large phase specimen sheet [**here**](http://web.archive.org/web/20131012025020/http:/homepage.ntlworld.com/c.dickinson40/fullSet02.pdf)\n\nc.\n\n"
    },
    {
      "time": "4 Oct 2006 — 8:16am",
      "content": "Coop, I think the kind of advice you need at this point is beyond my realm of expertise (I'm a graphic designer, not a type designer). But there are a few things that I noticed. Maybe you can contact some of the regulars here directly, you may get a better response. A few things I noticed: the s seems to be falling over to the right; there is a feature on the leg of the k that doesn't seem to appear in any of the other characters, almost an inktrap effect where the leg meets the diagonal. I like the way it looks, but I don't see that treatment on any of the other characters; I think the o needs more contrast. If you can finese this a bit more I think you'll have something very solid. I think it looks great, very open and clean, and I would use it myself. Great work.\n\n"
    }
  ]
}
