{
  "id": "28309",
  "title": "Script logo (Tap O'Noth Gundogs)",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hello, this is my first post here, I’ve seem some great work and I’m hoping to get some critique…\n\nI’m putting together an identity for a friend’s business, this is one of the logo candidates.  \nI’ve had no experience in drawing a script face before, and wanted to know if anyone can spot any major bloopers?\n\nAn thoughts on the logo in general would be nice too :)\n\n| Attachment | Size |\n| --- | --- |\n| [logo2.gif](http://web.archive.org/web/20061201164948/http:/typophile.com/files/logo2_0.gif) | 17.68 KB |\n\n",
  "author": "<a href=\"user/14666\" title=\"View user profile.\">Steel Rat</a>",
  "time": "<br>",
  "uid": "14666",
  "comments": [
    {
      "time": " 18 September, 2006 - 4:05pm",
      "content": "Noth works. I think Top would work more if it weren’t overlapping. the O’ gets lost because of the image within it. The quality of the letters is light and airy and has a nice not over-done quality to it.\n\nWhat are your goals?\n\n"
    },
    {
      "time": " 18 September, 2006 - 4:22pm",
      "content": "Just in case… don’t forget to check the spelling before sending it to the printer’s.\n\n"
    },
    {
      "time": " 18 September, 2006 - 4:24pm",
      "content": "If it’s called ‘T **a** p O’Noth Gundogs’, the a in ‘Tap’ is not too clear imo. It could either be an ‘o’ or an ‘a’ (it is very similar to the ‘o’ in Noth).  \nThe O’ indeed is a bit lost because of the image. I’m not sure if I like the fact that the ‘tail’ of the N is filled white when overlapping the O. And is it ‘gundogs’ or ‘gundogds’, like in your image?\n\nAnyway, apart from the critique I may have, the letters are very nicely done on themselves. Especially the Noth part, and the capital T. Keep it up.\n\n"
    },
    {
      "time": " 18 September, 2006 - 4:50pm",
      "content": "Just noticed an extra “d” in GUNDOGS. You’ve spelled it “GUNDOGDS”\n\n"
    },
    {
      "time": " 18 September, 2006 - 4:54pm",
      "content": " ![](http://web.archive.org/files/logo2b_5579.gif)\n\nThanks for the (lighting fast) feedback.  \nAll excellent points :)\n\nI’ve reduced the roundness of the stalk in the ‘a’ and made the loop in the ‘o’ larger, hence distinguishing the letters better.\n\nI’ve moved the ‘p’ off the ‘O’ and taken out the white counters, which as suggested brings out the ‘O’ better and makes the whole thing more readable. A clearance area has also be made around the inside of the ‘O’ to try and stop the image hiding it.\n\nAnd err.. gundogds :| it’s late !\n\n"
    },
    {
      "time": " 18 September, 2006 - 5:06pm",
      "content": "The ‘a’ in Tap is actually much more readable now, nice one :)  \nThe clearance in the ‘O’ does work, it’s more an ‘O’ now. However it still also does look like a frame for the image a bit.\n\n"
    },
    {
      "time": " 18 September, 2006 - 10:54pm",
      "content": "I didn’t see the ‘O’ as well. Not sure if putting the dog inside works. The curve where the bottom of the ‘T’ loops back towards the left looks kind of strange. It should flow a little better. Also, watch your apostrophe. It’s looking like an inch mark.\n\nHaving said this, I really like your script’s style.\n\n- Lex\n\n"
    },
    {
      "time": " 19 September, 2006 - 2:25am",
      "content": "I think the th could do with a bit of extra weight in the verticals they are a little unbalanced compared to the ap of Tap. The top of the dog’s head looks a little flat.  \nTim\n\n"
    },
    {
      "time": " 19 September, 2006 - 12:28pm",
      "content": "I just thought of something that might make the ‘O’ read better - try putting a loop on the top right as an exit stroke. You’ll probably have to make the dog smaller, or put the loop behind the dog.\n\n- Lex\n\n"
    },
    {
      "time": " 19 September, 2006 - 2:12pm",
      "content": "Thanks for the further advice, If my friend goes with this one I’ll make the suggested changes.  \nLex, I was thinking about making the ‘O’ more handwritten :)  \ntimd, thanks for the spot on those verticals, its difficult to notice these things when you’ve been staring at it for hours.\n\n"
    },
    {
      "time": " 25 September, 2006 - 3:14pm",
      "content": "They loved it so I’ve made the suggested corrections (plus a little more flair here and there). I think it’s there now, do you agree?\n\n ![](http://web.archive.org/files/logo2c_4592.gif)\n\n"
    },
    {
      "time": " 26 September, 2006 - 2:02am",
      "content": "A touch more stress on the lefthand side of the o in Noth and I agree.  \nTim\n\n"
    }
  ]
}
