{
  "id": "28311",
  "title": "Didot in Mac OS X...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi guys:\n\nI just noticed something really annoying. Open any non-adobe application- like Text Edit or Pages. Type some text with numbers set in Didot regular. Highlight it. Press command-T for the font panel then open the typography panel.\n\nThe typography panel showns some options including OSF figures but when you click on the buttom to make that happpen- NOTHING!\n\nI thought maybe my Didot font became corrupt so I went to an Apple store to verify the OSF figures working, but then on these NEW machines they also did not work.\n\nI checked FontBook and the Special Character utilites. I see the OSF figures there but... they don't work or I'm not allowed to access them.\n\nI ask somebody at the help desk... the guys says that's probably an Apple corporate decision!!!\n\nVery Annoying indeed! Its like buying a car with a radio installed that does not play the AM band even though the hardware is there.\n\nI don't own any Adobe apps... just curious can you guys access the OSF figures in InDesign?\n\nAll my best,\n\nMikey\n\n",
  "author": "SuperUltraFabulous",
  "time": "18 Sep 2006 — 4:48pm",
  "uid": "12479",
  "comments": [
    {
      "time": "18 Sep 2006 — 5:03pm",
      "content": "OSF are accessible in Glyph palette in InDesign and Illustrator\n\n"
    },
    {
      "time": "18 Sep 2006 — 5:49pm",
      "content": "[http://www.redlers.com/mellel.html](http://web.archive.org/web/20150419013256/http:/www.redlers.com/mellel.html \"http://www.redlers.com/mellel.html\")\n\n"
    },
    {
      "time": "18 Sep 2006 — 6:54pm",
      "content": "Mellel won't do it either. Illustrator and InDesign can access the old style figures via the Glyph palette only. I think there is something broken in the font.\n\n"
    },
    {
      "time": "18 Sep 2006 — 8:20pm",
      "content": "Absolutely: I'm going through serious font issues with OSF versions with TextEdit and InDesign myself.\n\n"
    },
    {
      "time": "19 Sep 2006 — 7:54am",
      "content": "I suspect the Didot font (Didot.dfont) uses [AAT](http://web.archive.org/web/20150419013256/http:/en.wikipedia.org/wiki/Apple_Advanced_Typography) tables and not OpenType tables, that's why OsF are not accessible in InDesign.\n\nBut I agree this doesn't explain why the font doesn't work correctly in TextEdit. It ought to.  \nSmall caps work, so I'd say the font has a bug.\n\n ![](http://web.archive.org/web/20150419013256im_/http:/typophile.com/files/didot_macosx_4759.png)\n\n"
    },
    {
      "time": "19 Sep 2006 — 2:20pm",
      "content": "Hello all:\n\nThanks guys. I thought I was the only one in the world experiencing this.\n\nNow here is the big question: WHO DO I CONTACT/YELL TO REMEDY THE ISSUE- APPLE OR LINOTYPE???\n\n:-) Mike Diaz\n\n"
    }
  ]
}
