{
  "id": "28331",
  "title": "Band logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi\n\nI've recently designed a logo for a band called 'Pink on Black'. they are a four piece band with 2 females and 2 males. Their brief was to design a logo that was dark and slightly gothic with a femine touch.\n\nThe logo I've come up with has a clean typeface with the serifs adding a slightly gothic 'dark' feel without going over the top.\n\nThe format of it has 'pink' on top of the word 'black' to reinforce 'Pink ON black' (obvious).\n\nI've slanted the 'A' in 'black' to create a negative space within the 'N', the 'L' and 'A' which creates a triangular shape that resembles the play button of a CD player. When turned at 90 degrees this shape also represents the female form (according to the Da vinci code!). This rotated shape is repeated underneath the type to confirm the idea and add another element of interest.\n\nOverall, it is meant to have a simple, classic and timeless look that shouldn't date as the band grow and develop.\n\nAs usual all constructive comments welcomed.\n\nThanks\n\nDave\n\n| Attachment | Size |\n| --- | --- |\n| [Pink\\_on\\_black.gif](http://web.archive.org/web/20150330212340/http:/typophile.com/files/Pink_on_black.gif) | 12.08 KB |\n\n",
  "author": "WhitePepper",
  "time": "19 Sep 2006 — 5:09am",
  "uid": "9776",
  "comments": [
    {
      "time": "19 Sep 2006 — 6:39am",
      "content": "I'm afraid this does nothing for me, the colour pallette seems too obvious or perhaps not as well used as it could be and the triangle device seems, at the same time, to be forced and meaningless, while Friz Quadrata doesn't convey a gothic feel to me [this](http://web.archive.org/web/20150330212340/http:/www.myfonts.com/search?search%5Btext%5D=macbeth) is in a similar vein but far darker.  \nI apologise if you feel this is harsh, but my feeling is you should start again.  \nTim\n\n"
    },
    {
      "time": "19 Sep 2006 — 6:40am",
      "content": "My first reaction is that you're trying to wrap too many concepts into this design. You're using the color pink on the color black, The work \"Pink\" is above the word \"Black.\"\n\nI'm also not getting the play button thing. I understand the idea, it's just not prevalent enough in the design to really need to be present.\n\nI understand what you are saying about the rotated shape under the type adding another element of interest and \"confirming\" the idea of the female form. But, since the pink triangle is such a global symbol of gay pride, you may want to rethink its use here.\n\nAs for the typeface itself, i'm really not sure if it's appropriate. I'd have to hear the music or know the genre of music to make an assessment.\n\n"
    },
    {
      "time": "19 Sep 2006 — 8:32am",
      "content": "I always look at the logo before reading the justification, so here's what I originally thought:\n\nA group of homosexuals who play Black Flag covers.\n\nThe pink triangle to me said \"Gay Pride\" right away. The band Black Flag uses Friz Quadrata (although the bold version) in their logo, which has black rectangles in it, much like yours, and the name \"Pink on Black\" could definitely be a pun on the whole gay cover band idea. Since you didn't mention anything about this in the post, I'd rethink the logo.\n\n- Lex\n\n"
    },
    {
      "time": "19 Sep 2006 — 9:47am",
      "content": "Funny, the first thing that came to my mind was Black Flag too!  \nWell, you could just make two of the four bars in the original Blag Flag logo pink and you're finished :-)\n\n ![](http://web.archive.org/web/20150330212340im_/http:/typophile.com/files/bf2_5843.jpg)\n\n"
    },
    {
      "time": "19 Sep 2006 — 10:41am",
      "content": "With a band name like \"Pink on Black\" my first suggestion would be to take your expectation (ie, a logo which is pink and black) and do exactly the opposite. Reading the words \"Pink on Black\" while looking at a mark which _is_ pink and black creates no resonance. You might try exploring other visual ways of expressing the deeper idea of femininity paired with aggression?\n\n"
    },
    {
      "time": "19 Sep 2006 — 12:28pm",
      "content": "This is all good (if slightly soul destroying) so far! I had no idea about the gay pride thing either - quite the wrong message! I think a total re-start seems like the best option.\n\nThanks,\n\nDave\n\nP.S Please don't take this as a sign to stop the feedback. Please continue :)\n\n"
    }
  ]
}
