{
  "id": "28354",
  "title": "iPod font Question",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I know the correct font for the an iPod 5G is Podium Sans from searching this website, but my question is whether the font is the same for the outside too [http://www.apple.com/ipod/gallery/images/ipod02\\_20060912.jpg is a link to a picture of the outside front - the only text using the font is the word menu on the scroll wheel]. If they are indead the same like I sorta thought they would, is Lucidia Sans an ok alternative for Podium Sans? Thanks for the help in advance.\n\n [‹ Cougar & Cronenberg samples](http://web.archive.org/web/20071208063251/http:/www.typophile.com/node/28356 \"Go to previous forum topic\") [(x) Chicago script - Dream Lover {Ignacio} ›](http://web.archive.org/web/20071208063251/http:/www.typophile.com/node/28334 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071208063251/http://www.typophile.com/user/14692\" title=\"View user profile.\">Unreal</a>",
  "time": "<br>",
  "uid": "14692",
  "comments": [
    {
      "time": " 20.Sep.2006 5.26pm",
      "content": "i believe it is Myriad Apple, which is based on Myriad Pro. And PodiumSans is based on Myriad Apple actually.\n\nI don’t think it’s Podium Sans because there is no splayed “M”\n\n"
    },
    {
      "time": " 20.Sep.2006 5.36pm",
      "content": "I believe apple at one point used Myriad Apple but then switched to Podium Sans after the iPod photo which you can cite at wikipedia ( [http://en.wikipedia.org/wiki/Podium\\_Sans](http://web.archive.org/web/20071208063251/http:/en.wikipedia.org/wiki/Podium_Sans \"http://en.wikipedia.org/wiki/Podium\\_Sans\")). But my real question is if the word “MENU” on the outside of the ipod in the photo is the same as the font used inside the iPod, what would be the best clone font that is free.\n\n"
    },
    {
      "time": " 20.Sep.2006 6.14pm",
      "content": "The outside is not Podium Sans b/c in the word “MENU” the “M” has splayed ends, and the Podium Sans “M” ends are verticle. Besides, Podium Sans is not used in any sales collateral, packaging, online, or anything else besides onscreen use for newer iPod. In all other applications, Apple still uses Myriad Apple.\n\n"
    },
    {
      "time": " 20.Sep.2006 7.09pm",
      "content": "Ok, now that I compare it, I see your completely right :)  \nSorry for this rather useless question that was asked before. I was really confused by the two different fonts and where they were placed.  \nThanks for the help.\n\n"
    },
    {
      "time": " 20.Sep.2006 8.58pm",
      "content": "\\>I was really confused by the two different fonts and where they were placed.\n\nI think Apple may have contributed to the confusion by orignally claiming that the color iPods were using Myriad as a UI font. But that’s explained at the wiki.\n\n"
    }
  ]
}
