{
  "id": "2836",
  "title": "Clam",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "This is a display face I have been working on, provisionally titled clam. I would appreciate any comments and critiques.\n\n<!--attachment: clam_sample-24843.pdf*mime_pdf.gif*application/pdf*88.6*clam_sample*clam_sample%2epdf --><!--attachment: clam_sample-24843.pdf*mime_pdf.gif*application/pdf*88.6*clam_sample*clam_sample%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131017043508im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">clam_sample<br><a href=\"http://web.archive.org/web/20131017043508/http:/www.typophile.com/forums/messages/29/clam_sample-24843.pdf\" target=\"_blank\"><b>clam_sample.pdf</b></a> (88.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\nThanks in advance   \nTim\n\n",
  "author": "timd",
  "time": "25 Jan 2004 — 3:04am",
  "uid": "2289",
  "comments": [
    {
      "time": "25 Jan 2004 — 4:21am",
      "content": "Is there a reason the numbers don't match the letters?   \n   \nAre you planning on using open type to implement the alternate glyph variants?\n\n"
    },
    {
      "time": "26 Jan 2004 — 2:27am",
      "content": "At the moment it is set up as two fonts in the same family with the fully round letters in place of upper case for each of the fonts, I have no plans for using open type, although it might be something for the future when I'm happier with the way it looks.   \nAs for the numerals, I tried out various ways of keeping in with the rounded style but the results were confusing (as were the original drawings for i, j and l) and I considered the best answer was to keep them as basic, following a similar weight.   \nTim\n\n"
    },
    {
      "time": "26 Jan 2004 — 11:01am",
      "content": "Ok. I can accept that. My only suggestion is that since you have this implemented as two separate font files, that gives you the option of having both classic and matching number forms. My criteria on a display face such as this would be whether I could write everything I wanted. As is, I couldn't use Clam if I needed to write a date because the numbers don't sylistically match the letters - so what's the point?   \n   \nI guess I'm strongly urging you to consider at least making numbers that match as an option. Also, in thinking about the open type features for Arabic, \\*if you wanted\\*, you could probably use the initial, medial, and terminal form support to map out the different glyph variants in Clam.\n\n"
    },
    {
      "time": "27 Jan 2004 — 8:23am",
      "content": "Here are the initial drawings of the numerals, I don't think they work, but maybe I should perservere.   \n ![numerals](http://web.archive.org/web/20131017043508im_/http:/www.typophile.com/forums/messages/29/24997.jpg)   \nHowever, I feel that the current numerals do work with the characters, maybe not as a direct connection in style (although they do need work 1,5,7 need to be reduced in height).   \n ![acme](http://web.archive.org/web/20131017043508im_/http:/www.typophile.com/forums/messages/29/24998.jpg)\n\n"
    },
    {
      "time": "18 Feb 2004 — 7:27pm",
      "content": "yikes   \ncreative, but hard to read.\n\n"
    },
    {
      "time": "19 Feb 2004 — 3:11pm",
      "content": "It may be legible when you've had a little drinks - kind of niche type for drunk readers. Oh, and \"w\" inevitaby reminds me butt : )   \n   \nI think you should use those new numerals to make it a whole. Nice work!\n\n"
    },
    {
      "time": "20 Feb 2004 — 12:21am",
      "content": "Thanks for your comments   \nJoshua\n\n"
    }
  ]
}
