{
  "id": "28384",
  "title": "Bon Magazine from Sweden",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20101011145610im_/http:/typophile.com/files/bon_logo_3550.gif)\n\nAnyone know on what script typeface this logo is based on?\n\n",
  "author": "<a href=\"/web/20101011145610/http://typophile.com/user/13804\" title=\"View user profile.\">philippe@basede...</a>",
  "time": "<br>",
  "uid": "13804",
  "comments": [
    {
      "time": "",
      "content": "Perhaps [Snell Roundhand](http://web.archive.org/web/20101011145610/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontpackage&startrow=1&records=&currpage=1&totalrecords=3&displayfontid=M.125940.0.0&fontRendererText=BON+) or [Ballantines Script](http://web.archive.org/web/20101011145610/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontpackage&startrow=1&records=&currpage=1&totalrecords=4&displayfontid=EF.104011.0.0&fontRendererText=BON+).\n\n"
    },
    {
      "time": "",
      "content": "Why does everything have to be based on something?\n\nIt could have been, and probably was, created from scratch.\n\nNick Cooke\n\n"
    },
    {
      "time": "",
      "content": "\\> _Why does everything have to be based on something?_\n\nMy thoughts exactly. I know they aren't meant like that and there was no harm intended, but those kind of remarks belittles the talent of professional letterers and type designers. :^)\n\n"
    },
    {
      "time": "",
      "content": "_those kind of remarks belittles the talent of professional letterers and type designers._\n\nUsually we just answer questions like this by saying ' It looks custom designed, but Snell Roundhand or Ballantines Script might be similar', and I suppose if Stephen had said it that way maybe Nick wouldn't have reacted. As Yves said, the poster intended no harm, and so it seems unnecessary to consider an innocent question (or the reply) as any sort of slight to type artists/designers. Regardless of the way the questions are worded, people are usually coming here to ask us for something that can re-create a certain typographic look, hopefully by telling them the exact typeface (digital, if possible) that was used, but failing that to offer something that might give a similar look without needing to be able to draw it yourself, or hire a designer to do it.\n\nThat's what we do here, isn't it? (Maybe with a little education about lettering artists and type designers thrown in, as a bonus.)\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Or for something slightly different, Fenway Park\n\n[http://www.myfonts.com/search?search%5Btext%5D=fenway+park](http://web.archive.org/web/20101011145610/http:/www.myfonts.com/search?search%5Btext%5D=fenway+park \"http://www.myfonts.com/search?search%5Btext%5D=fenway+park\")\n\nI 'm with Mike - I don't think there was any belittling going on. The question was innocent, and a lot of custom logos were either based on or inspired by an existing font.\n\n"
    },
    {
      "time": "",
      "content": "I didn't mean to offend. It was just a statement of fact.\n\nNick Cooke\n\n"
    },
    {
      "time": "",
      "content": "_but those kind of remarks belittles the talent of professional letterers and type designers. :^)_\n\nAnd graphic designers. We draw our own glyphs for logos as well.\n\n"
    },
    {
      "time": "",
      "content": "Even very good custom script logotypes follow models, usually (in my experience) rather closely. Even though a handdrawn Bickham can be very different from a custom Bickham-based script, it's still a Bickham (not that this is, of course, just an example).\n\nFor example, if you read the writings of The Doyald (Young), he'll almost always describe how he bases each logo on an existing typeface, and he's one of the most talented logo artists around.\n\nI've sometimes thought that some very good letterers have a limited number of \"typefaces\" (types of writing that they have learned and that are part of their repertoire). Like a \"typeface\" typeface, only more flexible, and some of these typefaces can be the creation of the letterer him or herself. I don't know if that's a fair comparison though.\n\n"
    },
    {
      "time": "",
      "content": "I always like logos created from scratch, with a nice individual touch. So it's quite funny that this discussion comes up around the BON logo. I just happened to stumble over the ornaments on the sides of it, and they are taken straight from Wingdings. Nice.\n\n ![](http://web.archive.org/web/20101011145610im_/http:/typophile.com/files/bon_wingding_3636.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Ha!\n\n"
    },
    {
      "time": "",
      "content": "Whoa! =^O\n\n"
    },
    {
      "time": "",
      "content": "Nice one.\n\n"
    },
    {
      "time": "",
      "content": "Perhaps what has happened in recent years is that many people experience type and letterforms primarily through their computer and the font menu. It is easy to assume someone started with an existing typeface and made a logo or brand name. It is easy to fall in to the trap of assuming things came from a pull-down menu unless you have been in the business for long enough to remember otherwise.  \nIn years past, hand lettering for such things was quite normal and expected. It was even easier to find a skilled lettering artist than it was to try and manipulate typeset forms. Today, there are fewer lettering artists who work the old fashioned way and billions of digital fonts available. A person can post an image here on this forum and in minutes get a close relative to a lettering sample, go to an online vendor, download and use it within the hour. Pretty amazing actually what a service folks like Mike, Patty, and Yves perform in minutes!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "... and Stephen and Lex and Rainer and Mark and Tiff and Angel and Marc and Pieter and Mike F and Dav and... ;^) We've got a quite impressive team here.\n\n"
    }
  ]
}
