{
  "id": "2838",
  "title": "Logotype for GI",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi Typophiles!   \n   \nI'm doing some voluntary for my friend's union. The name of their little group is simple but catchy Generating Ideas (GI).   \n   \n ![1st](http://web.archive.org/web/20131023032527im_/http:/www.typophile.com/forums/messages/29/24857.gif)   \n   \nFirst I made a roundy-arrow with a dot-as-an-idea (above), but:   \n\\> it's too clich\n\n",
  "author": "Hendrik",
  "time": "25 Jan 2004 — 4:29am",
  "uid": "2960",
  "comments": [
    {
      "time": "25 Jan 2004 — 6:48am",
      "content": "Hendrik, Don't try to force the lightbulb to be a GI, remember most of the end users are not designers and the idea will sail way over their heads. You might look at a typeface with Caps and Small Caps, with some contrast between the Caps and the small caps such as a tint of color or a second color. But define what is important, Is GI the most important thing or is it Generating Ideas, or is it a symbol. Focus on one direction, then explore other ideas.\n\n"
    },
    {
      "time": "25 Jan 2004 — 3:13pm",
      "content": "you could make the \"g\" like this out of the 3:00 ray of light.   \n   \n(quick render)   \n   \n ![](http://web.archive.org/web/20131023032527im_/http:/www.typophile.com/forums/messages/29/24885.gif)\n\n"
    },
    {
      "time": "26 Jan 2004 — 10:36am",
      "content": "Hendrik,   \n   \n You have a million directions you can run with this, and more than a handful are interesting.   \n   \n-There's a lower case \"g\" in your yellow/purple post. The bulb and the part that screws in form the \"g\". So you've got a G and a g.   \n   \n-What about making the part that screws in, the \"g\" (lots of lowercase g's to try out)?   \n   \n-IdeaS: the plurality of this concept seems to be lost currently. One \"i\" seems to represent one idea. What about lots of i's as the beams on the outside of the bulb--no \"i\" inside. Lots of i's: lots of ideaS.   \n   \n To make the lightbulb clich\n\n"
    },
    {
      "time": "26 Jan 2004 — 6:39pm",
      "content": "Great feedback Ty! I love the lower case \"g\" as lightbulb with many \"i\"s coming off as beams of light. In this case, the letterforms naturally present _many_ possible soultions.   \n   \n -t\n\n"
    }
  ]
}
