{
  "id": "28383",
  "title": "typophile.com - page navigation",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello,\n\ni don't find it usable for site navigation to display the \"1 2 3 ... next page last page\" navigation at the bottom of the thread only. In my opinion, it would be nice to have it at the top of the thread, too.\n\n",
  "author": "poms",
  "time": "22 Sep 2006 — 12:40am",
  "uid": "10974",
  "comments": [
    {
      "time": "22 Sep 2006 — 12:58am",
      "content": "Hear hear!  \nAnother annoying feature is that you can only access a thread starting with the oldest posts, when what you usually want to see is the most recent ones.\n\n"
    },
    {
      "time": "22 Sep 2006 — 1:02am",
      "content": "there's a number of things about this site that aren't quite as user-friendly as they should/could be\n\n----------  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20131017135720/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "22 Sep 2006 — 1:21am",
      "content": "Hi,\n\nI agree with poms - sometimes you want to jump quickly to previously visited place and it's annoying to wait all the attached pictures load and finally page stays still.\n\nMarc I think it's natural to read from top to bottom rather than the opposite. It would be really annoying if I had to start reading new thread from the last page.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nAL  \n [www.lenart.pl](http://web.archive.org/web/20131017135720/http:/www.lenart.pl/ \"www.lenart.pl\")\n\n"
    },
    {
      "time": "22 Sep 2006 — 1:25am",
      "content": "Of course. I just mean that immediately accessible short cuts at the top of the page are all the more desirable.\n\n"
    },
    {
      "time": "22 Sep 2006 — 3:39am",
      "content": "Typophile.com's homepage shows new threads only, next to \"hottest\" and \"handpicked\". It would be useful to have a quick overview of the most recent posts on all of the forums, as well, even the older ones. Furthermore, I second the suggestions made above.\n\nThe website is quite often hanging: is this only temporarily? Are you preparing for a server upgrade?\n\nAnyhow, congratulations to the designers and builders of this website. I never participated in online forums before, just sticking to good-old mailing lists, because most of the time they injure my typographic feelings. Typophile.com is however, beautifully designed and it's a pleasure to read and navigate through it.\n\n"
    },
    {
      "time": "22 Sep 2006 — 5:52am",
      "content": "If you bookmark the recent posts page, Ludwig, you'll find one of your wishes granted.\n\n"
    },
    {
      "time": "22 Sep 2006 — 6:04am",
      "content": "_you can only access a thread starting with the oldest posts, when what you usually want to see is the most recent ones_\n\nMarc – if you use the 'track' feature on your user account page you'll be able to use the link at the right 'number of replies' to get to the most recent posts in the threads you're interested in.\n\n"
    },
    {
      "time": "22 Sep 2006 — 6:45am",
      "content": "Yes, there is lots to complain about usability wise, but, the content is great, the people are good, and the site works for the most part.\n\n"
    },
    {
      "time": "22 Sep 2006 — 7:09am",
      "content": "I agree with Thomas. Some navigation aids at the top of the thread would ease my scrolling.\n\n"
    },
    {
      "time": "22 Sep 2006 — 7:10am",
      "content": "I wish that if you add a post to the second or third page of a thread that it would refresh to that page, rather than back to the first page.\n\n"
    },
    {
      "time": "22 Sep 2006 — 7:23am",
      "content": "I was going to say the same as Patty. And Ben, thanks for the advice, you've saved me lots of minutes a day in the future.\n\n"
    },
    {
      "time": "22 Sep 2006 — 7:18pm",
      "content": "When I click on the \"1 new\" link for a topic that has, say, 75 posts in it, I'd like to be taken to the second page of posts rather than the first. That's my biggest pet peeve, but as Willy Wonka might say to me, \"Well, you're just happy to be here!\"\n\n"
    },
    {
      "time": "25 Sep 2006 — 11:59am",
      "content": "It's back! Thanks Christian!\n\nChrisL\n\n"
    },
    {
      "time": "25 Sep 2006 — 4:24pm",
      "content": "I'm another one who would prefer to start with the newest posts rather than having to click through several pages to get to the current discussion.\n\n"
    },
    {
      "time": "25 Sep 2006 — 6:53pm",
      "content": "I've mentioned this before, I think... I wish, when I use Back & Forward , Typophile.com would remember where I'd scrolled down to: right now, it always starts at the top of every screen.\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "25 Sep 2006 — 6:55pm",
      "content": "just a stupid question: if typophile can mark which posts are \"new\" to a particular user, can it take you to the first new post to a thread previously vistited?\n\n"
    },
    {
      "time": "25 Sep 2006 — 7:09pm",
      "content": "Paul, read Ben Archer's post above, which was news to me.\n\nIf you click on the link that says '2 new' or whatever it takes you directly to the new post.\n\nThanks Ben!\n\n"
    },
    {
      "time": "26 Sep 2006 — 4:38am",
      "content": "Ben & Paul & William & whoever has the power to make things even better here: the \"go to new\" feature only works for a one-page thread. As soon as it has overflowed to page 2, the link just drops you off at the beginning of page 1. At least that's the way it works for me (Windows/Opera).\n\n"
    },
    {
      "time": "26 Sep 2006 — 4:56am",
      "content": "\\>the “go to new” feature only works for a one-page thread\n\nI am using Firefox on Windows, and it brings me to the new posts (not always the first one) even in multi-page threads.\n\n"
    },
    {
      "time": "26 Sep 2006 — 5:08am",
      "content": "I have the same problem as MHSmith with Safari on Mac\n\n"
    },
    {
      "time": "26 Sep 2006 — 5:55am",
      "content": "It would also be nice to be able to open the threads I'd like to read in new tabs. I don't know if this is possible when using a Flash interface, but I find it annoying to have to use the back-button all the time.\n\n"
    },
    {
      "time": "26 Sep 2006 — 6:17am",
      "content": "I always find it a bit disorientating when on the 2nd or 3rd page of a thread that the initial post appears at the top, not differentiated in any way, as if it were the 51st or 101st post.\n\n"
    },
    {
      "time": "26 Sep 2006 — 3:47pm",
      "content": "I like pizza\n\n----------  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20131017135720/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "27 Sep 2006 — 12:09am",
      "content": "I agree with Elliot. And when you're editing one of your posts, I don't see the point in having the first post of the thread plus various other things appearing under the editing box. Also a little disorientating.\n\n"
    },
    {
      "time": "27 Sep 2006 — 12:46am",
      "content": "Copying and pasting the node will take you to the first page.  \n [http://typophile.com/node/20638](http://web.archive.org/web/20131017135720/http:/typophile.com/node/20638 \"http://typophile.com/node/20638\").  \n?from=50&comments\\_per\\_page=50 will take you to the 2nd page  \n?from=100&comments\\_per\\_page=50 will take you to the 3rd page  \n?from=150&comments\\_per\\_page=50 will take you to the 4th page  \nand so on...  \nIt is the from=?? that takes you where you like!  \nJust try it with [Flowers](http://web.archive.org/web/20131017135720/http:/www.crauswords.com/flowers/WFlowers.htm)  \n [http://typophile.com/node/20638?from=50&comments\\_per\\_page=50](http://web.archive.org/web/20131017135720/http:/typophile.com/node/20638?from=50&comments_per_page=50 \"http://typophile.com/node/20638?from=50&comments\\_per\\_page=50\")  \n [http://typophile.com/node/20638?from=100&comments\\_per\\_page=50](http://web.archive.org/web/20131017135720/http:/typophile.com/node/20638?from=100&comments_per_page=50 \"http://typophile.com/node/20638?from=100&comments\\_per\\_page=50\")  \n [http://typophile.com/node/20638?from=150&comments\\_per\\_page=50](http://web.archive.org/web/20131017135720/http:/typophile.com/node/20638?from=150&comments_per_page=50 \"http://typophile.com/node/20638?from=150&comments\\_per\\_page=50\")\n\n"
    },
    {
      "time": "27 Sep 2006 — 1:04am",
      "content": "Still interesting, 00 will take you to the first page also.  \n [http://typophile.com/node/20638?from=00&comments\\_per\\_page=50](http://web.archive.org/web/20131017135720/http:/typophile.com/node/20638?from=00&comments_per_page=50 \"http://typophile.com/node/20638?from=00&comments\\_per\\_page=50\")  \nSo by changing 00, 50, 100, 150, 200, you can easily and happily walk back and forth through pages.  \nHappy walking with [Flowers](http://web.archive.org/web/20131017135720/http:/www.crauswords.com/flowers/WFlowers.htm)\n\n"
    },
    {
      "time": "27 Sep 2006 — 4:57am",
      "content": "More Interesting, if you enter a number bigger than that of the last page, Typophile will take you to the body text of that node, with no addition or comment! Well-done Typophile!  \nExplore more with [Flowers](http://web.archive.org/web/20131017135720/http:/www.crauswords.com/flowers/WFlowers.htm)\n\n"
    },
    {
      "time": "27 Sep 2006 — 5:31am",
      "content": "This is fun+fantastic!  \nType any number in between, and you are right to the [target](http://web.archive.org/web/20131017135720/http:/typophile.com/node/19348?from=52&comments_per_page=50)  \nHappy Juggling with [Flowers](http://web.archive.org/web/20131017135720/http:/www.crauswords.com/flowers/WFlowers.htm)\n\n"
    }
  ]
}
