{
  "id": "28394",
  "title": "OT Ligatures \\> calt or liga?",
  "forum": "Build",
  "tags": [

  ],
  "content": "I plan to do a lot of ligatures in a script. Ligatures like o\\_r, b\\_r, t\\_t\\_i, t\\_u etc.\n\nI want them to appear all automatic for the user, cos the font needs them really.\n\nHowever, I can’t seem to figure out which is better; put them as “liga”, or as “calt”.\n\nIt seems like the contetextual ligatures are ON by default in InDesign, aswell as the regular ligature-function, so for me it feels as if it doesn’t matter really, but perhaps there is (probably) advantages in using one of them instead of the other (?).\n\nWhat are your opinions on this?\n\nThanks in advance.\n\n",
  "author": "<a href=\"/web/20110201225630/http://typophile.com/user/11526\" title=\"View user profile.\">Goran Soderstrom</a>",
  "time": "<br>",
  "uid": "11526",
  "comments": [
    {
      "time": "",
      "content": "'calt' is intended for contextual stuff, whereas your examples seem to be plain ligatures. If you really consider them to be <cite>necessary</cite> ligatures, then they belong into 'liga'. If you want to give the user more control, you can put them into 'dlig' (discretionary ligatures) which is intended to be applied on individual glyphs rather than paragraphs.\n\n"
    },
    {
      "time": "",
      "content": "Karsten, thanks again for your assistance. You’ve been a great help you should know. I’ve also found your files from you webpages excellent guides.\n\nBut... hmm... What exactly does the contextual stuff mean, in practice? I’m not quite sure I do understand it completely.\n\n"
    },
    {
      "time": "",
      "content": "Contextual rules govern instances in which particular glyphs should or should not appear together.\n\nTo take a simple case: In a script face, one form of a glyph might have no connecting strokes, to be used at the beginning or end of a word, while another form would be applied in the middle of a word.\n\nIt can get more sophisticated than that of course.\n\nExamples of fonts with contextual feature include Shinn's Handsome Pro, and Abode's Caflisch Script.\n\n"
    },
    {
      "time": "",
      "content": "Caflisch Script is a very good example. Notice how the 'f' changes depending on the letters surrounding it.\n\n ![](http://web.archive.org/web/20110201225630im_/http:/typophile.com/files/caflisch_f_6705.png)\n\n"
    },
    {
      "time": "",
      "content": "I don't think it matters for a script whether you use one default OT feature or another. In practice, there's no difference.\n\nHowever, there are certain script substitutions you may want to include in your font that are not, strictly speaking, ligatures, such as end forms.\n\n ![](http://web.archive.org/web/20110201225630im_/http:/typophile.com/files/end_4146.jpg)\n\nTypographers are a punctilious bunch; I therefore put all the substitutions in Handsome Pro in the calt feature (except, for sentimental reasons, fi and fl). I suppose I could have split them between calt and liga (or dlig), to be absolutely correct, but why make things unecessarily complex? The real use for the distinctions between calt, dlig, and liga is in old style roman faces, not scripts.\n\n"
    }
  ]
}
