{
  "id": "28395",
  "title": "Alternates/Synonyms for Georgia and Lucida Grande for print work.",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Working a web interface and logo for a low budget project that use these two excellent screen optimized typefaces, but need to reproduced the logo in/find similar fonts that will stand up to the rigours of a wide variety of print applications (ID, Poster, Package).\n\n-t\n\n",
  "author": "timfm",
  "time": "22 Sep 2006 — 2:37pm",
  "uid": "1235",
  "comments": [
    {
      "time": "22 Sep 2006 — 3:21pm",
      "content": "[Miller](http://web.archive.org/web/20131019003856/http:/fontbureau.com/fonts/Miller) is the obvious print analogue to Georgia. It was also designed by Matthew Carter, and comes in a variety of cuts for text and display.\n\n[Lucida](http://web.archive.org/web/20131019003856/http:/www.myfonts.com/fonts/ef/lucida-sans/) started life as a print face so it can do double duty, onscreen and off.\n\n"
    },
    {
      "time": "22 Sep 2006 — 3:55pm",
      "content": "Thank you marcox,\n\nIs Lucida Grande that comes standard on the Mac the same as Lucida Sans/usable for print work?\n\n"
    },
    {
      "time": "22 Sep 2006 — 4:17pm",
      "content": "Sorry, Tim, but I've never compared the two. The \"Grande\" in the name might suggest it was created for print display work, a la Big Caslon, but I'm just speculatin' at this point.\n\n"
    },
    {
      "time": "22 Sep 2006 — 4:34pm",
      "content": "'Grande' is refering to the gigantic character set it comes with. Its basically covers all of unicode. Cyrillic, Turkish, CE ete. I think it ways specially hinted too. But still no OSF or small caps though.\n\nOut of all the interface sans available- Lucida is good for both print and on screen. Whereas Verdana/Tahoma are readable on screen but horriable in print... and in my opinion look like inspired by Lucida.\n\nMikey\n\n"
    },
    {
      "time": "22 Sep 2006 — 4:43pm",
      "content": "Grande: I believe it's the same also. Unfortunately no italics on the os screen version. Not a big fan of the printed look myself. It is a mater of taste. I think technically it's good.\n\n"
    },
    {
      "time": "22 Sep 2006 — 5:50pm",
      "content": "Thanks everyone.\n\nNice icon, Jones : )\n\n"
    },
    {
      "time": "22 Sep 2006 — 6:11pm",
      "content": "\\> Its basically covers all of unicode.\n\nNo way.\n\nhhp\n\n"
    },
    {
      "time": "25 Sep 2006 — 4:10pm",
      "content": "all of latin unicode?\n\n"
    },
    {
      "time": "26 Sep 2006 — 4:29am",
      "content": "I don't think that Lucida Sans and Georgia go really good together...  \nMaybe you can complement Georgia (or a similar Scotch Roman) with Weidemanns Corporate S.\n\n"
    },
    {
      "time": "13 Oct 2006 — 4:05pm",
      "content": "poms,\n\nHave an example of \"Weidemanns Corporate S.?\"\n\n-t\n\n"
    },
    {
      "time": "13 Oct 2006 — 4:28pm",
      "content": "[http://www.myfonts.com/search?search%5Btext%5D=corporate+s](http://web.archive.org/web/20131019003856/http:/www.myfonts.com/search?search%5Btext%5D=corporate+s)\n\n"
    }
  ]
}
