{
  "id": "28399",
  "title": "\\*\\*\\* Updated\\*\\*\\* Saddle Ridge Farm business card- critique please.",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "Hi guys:\n\nWhile on vacation in Florida I was able to snatch up two clients. Here is the business card for the first.\n\nAt first I wanted to get the look of Fournier's \"Manual Typographique\" with lots of ornaments but that would take up too much space and get really rococo really fast.\n\nThe feel (I'm going for- this time) is buttoned-down british hunt club/french europe. I'm using Didot for the entire identity. (I'm trying to avoid the wild-wild-west look that's over used and abused in Florida)\n\nTell me about the spacing.  \nShould I used another font- like a sans or a script?  \nIs it too tight? Tell me all your thoughts.  \nDoes this look make you think $$$$ expensive? It supposed to.\n\nAnd what do you think of the section at the bottom:\n\nfull board,  \npartial board,  \npasture board,  \n& retirees\n\nor should it be:\n\nfull, partial & pasture board  \nplus retirees\n\nThank you in advance for all your help(s),\n\nMike Diaz\n\nPS\\>\\>\\>\\>\\>THE C3 AND C4 PDF ARE THE NEWST!!!\n\n| Attachment | Size |\n| --- | --- |\n| [Saddle Ridge- New Directionb- space tweak 1.pdf](http://web.archive.org/web/20150418130736/http:/typophile.com/files/Saddle%20Ridge-%20New%20Directionb-%20space%20tweak%201.pdf) | 431.83 KB |\n| [Saddle Ridge- New Directionb- space tweak 1- no background.pdf](http://web.archive.org/web/20150418130736/http:/typophile.com/files/Saddle%20Ridge-%20New%20Directionb-%20space%20tweak%201-%20no%20background.pdf) | 431.59 KB |\n| [Saddle Ridge- New Directionb- space tweak 1 BACK.pdf](http://web.archive.org/web/20150418130736/http:/typophile.com/files/Saddle%20Ridge-%20New%20Directionb-%20space%20tweak%201%20BACK.pdf) | 16.56 KB |\n| [C3 FRONT BLACK.pdf](http://web.archive.org/web/20150418130736/http:/typophile.com/files/C3%20FRONT%20BLACK.pdf) | 440.4 KB |\n| [C3 FRONT WHITE.pdf](http://web.archive.org/web/20150418130736/http:/typophile.com/files/C3%20FRONT%20WHITE.pdf) | 440.41 KB |\n| [C4 BACK BLACK.pdf](http://web.archive.org/web/20150418130736/http:/typophile.com/files/C4%20BACK%20BLACK.pdf) | 434.31 KB |\n| [C4 BACK WHITE.pdf](http://web.archive.org/web/20150418130736/http:/typophile.com/files/C4%20BACK%20WHITE.pdf) | 434.31 KB |\n\n",
  "author": "SuperUltraFabulous",
  "time": "22 Sep 2006 — 4:53pm",
  "uid": "12479",
  "comments": [
    {
      "time": "22 Sep 2006 — 4:57pm",
      "content": "Oh and I forgot... the double line divider I'm using... should I keep it???\n\nMikey\n\n"
    },
    {
      "time": "25 Sep 2006 — 12:19pm",
      "content": "Spontaneously, it feels great! If it fits with their image and clientele, of course.\n\nI like the striped background. With the right kind of paper, it can be very strong.\n\nIf you go for the one with one without background, I would consider doing the border embossed instead of printed, and use a nice thick paper.\n\nDouble divider line: keep, but I think it's a bit strong as it is. Tone down somehow (width or color).\n\n"
    },
    {
      "time": "25 Sep 2006 — 5:16pm",
      "content": "Termopolium\\> Thank you so much for the tips!!! I think the embossing idea is excellent. I will pass that along to my client.\n\nMikey\n\n"
    },
    {
      "time": "25 Sep 2006 — 6:00pm",
      "content": "Hello again:\n\nOkay here is some updates to the Saddle Ridge Farm business card.\n\nFor the Front:\n\nI removed the bottom divider to add more air to the design. The boarder has been simplified although I may go back to original. I also made the background lines diagonal. If you look at the new pdf's (c3 & c4) the colors are inconsistant but that's not my fault... Its an apple/adobe bug (I think.)\n\nI adjusted the letter spacing 'SADDLE'- made the 'addle' closer to the 's'. I increased the letter spacing in 'Quality Boarding by'.\n\nOh and another serious deal... I added old style figures to the design. And apperently these do not work as expected and I'm not really happy as I has to manually adjust every single number. I probably will have to go back to using lining figures. Didot is a very old font- why they have not fixed it is beyond my comprehension.\n\nFOR THE BACK:\n\nI ghosted the image of the logo in the background and I used OSF figures and MANUALLY corrected them \\>:-/ I added more space to \"Saddle Ridge Farm\".\n\nI have yet pin down the exact pantone yet but that's in the works. As the paper, its going to be somewhere between natural and warm cream.\n\nThanks for new suggestions,\n\nMikey\n\n"
    },
    {
      "time": "15 Oct 2006 — 12:50am",
      "content": "The diagonal stripes feel a bit hard-edged and garish. Consider getting rid of the black diagonal lines and using tweaking the greens so that they're closer to each other in hue and lightness -- more of a tone-on-tone approach. Or screen the black so that you end up with a grey that's the same lightness as your greens.\n\nNot crazy about the client's name in all caps and italics. But if you want to use that approach, consider making the type smaller and looser.\n\n"
    },
    {
      "time": "17 Oct 2006 — 5:59pm",
      "content": "MarcoX: Hello and thanks for the feedback. I don't exactly get what you mean by a 'tone on tone' approach. As for screening the black diagonals- I don't think that's a good idea because that would created {ugly} half-tone dots. I did make a card without the black diagonals though.\n\nAlso would it be better if the diagonals were vertical instead? As in 'space tweak 1.pdf'\n\nYou are right about the spacing of the clients name. Although I do like italic but there is something wrong with 'stucture' of the bottom half of the card. I can't put my finger on it.\n\nOh and by the way is it better to have:\n\nfull board,  \npartial board,  \npasture board  \n& retirees\n\nor should it be:\n\nfull, partial, & pasture board  \nplus retirees\n\nThanks for the input,\n\nMike Diaz\n\n"
    }
  ]
}
