{
  "id": "28409",
  "title": "Spacing after paragraphs - a full line break or manual leading?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "What's generally considered better form when spacing paragraphs - following the paragraph with a full space using the same leading as the rest, or manually leading the space between the paragraphs to slightly less than a full line?\n\nI was taught to use manual leading, but it's recently been pointed out to me that not only is doing it this way a pain in the neck when layout changes, but that it also breaks up the alignment of baselines in pages with multiple columns of text. I'm inclined to agree with the latter–but what's generally preferred by typographers?\n\n",
  "author": "blank",
  "time": "25 Sep 2006 — 4:27pm",
  "uid": "14722",
  "comments": [
    {
      "time": "25 Sep 2006 — 4:30pm",
      "content": "I rarely do this for print designs because of the issues that you raised. But I've started doing manual leading after paragraphs for web typography.\n\nThey just look better with manual leading if you know what I mean.\n\n"
    },
    {
      "time": "25 Sep 2006 — 4:30pm",
      "content": "What application are you using? My preferred method in InDesign is the \"Space after\" value in the Paragraph palette.\n\n"
    },
    {
      "time": "25 Sep 2006 — 4:40pm",
      "content": "I'm with Stephen when it comes to InDesign.\n\nMy general rule-of-thumb is to add 50% space after a paragraph than leading: i.e., 10 pt text, 12 pt leading, 18 pt space after each paragraph for body text. Of course, that depends on the face....\n\nSetting heads is different: I usually use a mix of Space Before and Space After to account for times when you have various levels of heads with text following them.\n\nAs always when dealing with stuff like this, YMM, and certainly W, V.\n\n"
    },
    {
      "time": "25 Sep 2006 — 5:51pm",
      "content": "Actually, I should have written \"18 pt space from baseline of the end of the paragraph to the baseline of the next paragraph\" -- in other words, 6 pt space after the paragraph.\n\n(That'll teach me to try to write and cook dinner at the same time....)\n\n"
    },
    {
      "time": "25 Sep 2006 — 7:19pm",
      "content": "I'm using InDesign, I haven't tried space after in my styles yet (I'm still a student).\n\n"
    },
    {
      "time": "25 Sep 2006 — 8:09pm",
      "content": "It's true that secondary lead between paragraphs is a pain, and screws up the baseline. But it sure is pretty and (IMHO) aids to readability.\n\n"
    },
    {
      "time": "25 Sep 2006 — 8:18pm",
      "content": "Not so much a pain if you use Space After.\n\n"
    },
    {
      "time": "25 Sep 2006 — 8:30pm",
      "content": "Yeah, it's true. And if you take the care and attention to properly justify along the width (line length), you should spend just as much care with the depth.\n\n(Or you could just Flush Left and hang every column from the top baseline. Different schools of thought, but they both work.)\n\n"
    },
    {
      "time": "25 Sep 2006 — 9:05pm",
      "content": "\\>aids to readability.\n\nIf you have enough leading between lines and appropriate line length, extra space between paragraphs is not necessary. In extended, continuous reading texts, such as novels, it is hardly ever done.\n\nIn other situations--such as the relatively long lines of Typophile!--short paragraphs with extra leading between is a desirable style. Sometimes it is just an aesthetic choice.\n\nI have seen it recommended that if you do extra leading it should be either a full line or half line, so that facing pages relate...\n\n"
    },
    {
      "time": "25 Sep 2006 — 9:48pm",
      "content": "Certainly I agree with you, William, that book settings such as novels do not want, or need, secondary lead between paragraphs.\n\nThe argument is that a full return can be excessive when secondary lead between paragraphs is used. This is especially true in multi-column settings with narrow gutters. And yet we still want the first line and the last line, in multiple columns, to be aligned. Therefore we need to add space (or delete space) between lines and between paragraphs to \\*justify\\* the depth of each column (or \\*feather\\* it, as Felici defines it).\n\n"
    },
    {
      "time": "26 Sep 2006 — 12:23am",
      "content": "50% extra leading is good, you can still make the lines even, then, by adding 150% extra leading before a subhead or something.\n\nThus, in the case of 10/12 pt. text and 18 pt. space between paragraphs, the space before sub heads should be 30 pt., so that:\n\n50% + 150% = 200% (a multiple of the leading)\n\nOr if you can control the text matter, make sure that every page has an _even_ number of space-inbetweens, so that:\n\n50% + 50% = 100%  \n50% + 50% + 50% + 50% = 200%  \netc.\n\nThis might impede the overall color of the page, especially when seen through the paper, but at least you'll get an even baseline down at the bottom margin.\n\nBy the way, what page of _The Elements_ was this taken from? I remember that Bringhurst have said it somewhere.\n\n"
    },
    {
      "time": "26 Sep 2006 — 3:24am",
      "content": "In my experience, with anything multicolumn or with facing pages, you will regret using anything other than no extra space, or a whole line space between paragraphs, as soon as any edits are made to the text.\n\n"
    },
    {
      "time": "26 Sep 2006 — 3:42am",
      "content": "\\>If you have enough leading between lines and appropriate line length, extra space between paragraphs is not necessary. In extended, continuous reading texts, such as novels, it is hardly ever done.\n\nBut that form does normally use an indent on paras after the first, which is a good alternative for extended text.\n\nI also go for half line spacing in multi-column work (I use align to the baseline grid as well as space after values), I far prefer non-aligning bottom lines of columns to adjusting leading to align because it's not always practicable and it affects the colour within the text. For single column work I think you can use a different figure and rely on the inner margins to separate the columns sufficiently for non-aligning lines across the pages to be unnoticeable, added to which in a high-volume, low-budget run it is rare for the pages to exactly align.\n\nTim\n\n"
    },
    {
      "time": "26 Sep 2006 — 5:27am",
      "content": "<cite>I also go for half line spacing in multi-column work ... I far prefer non-aligning bottom lines of columns</cite>\n\nBut if you have a page with three columns which align on the last line and which one doesn't this looks odd.\n\n"
    },
    {
      "time": "26 Sep 2006 — 6:16am",
      "content": "I usually use indented first line of paragraphs, since I find this least disturbing both for the texture on the page and for the reading process.\n\nWhen I use 'align to baseline grid' for the text in InDesign, I usually like to give uneaven space above and below subheadings (that appear in the middle of a column). The way I do this is to assign the subheading the amount of space above and below that will give it a blank line above and below. Then, to pull it a little closer to 'it's' paragraph (the one below) I give it a 'baseline shift' in the minus/negative range.\n\nDon't know if this is a frowned upon way to do it, but it has worked so far. The problem is when the subheading appears on the top of a column/page, since it (the subheading) then won't align right with the top of the other columns.\n\n"
    },
    {
      "time": "26 Sep 2006 — 6:16am",
      "content": ".\n\n"
    },
    {
      "time": "26 Sep 2006 — 6:26am",
      "content": "\\>But if you have a page with three columns which align on the last line and which one doesn’t this looks odd.\n\nNot entirely sure I get your point, but if you mean there is a ‘rag’ at the bottom of the columns, as long as they are broken in a logical way or don't align because there are an uneven number of paragraphs, it doesn't bother me as much as trying to make a perfect rectangle of type.  \nTim\n\n"
    },
    {
      "time": "26 Sep 2006 — 7:44am",
      "content": "I generally use an indent for any paragraph after the first, unless it follows a head. When I do add space btw paragraphs (no indent then) I do it using Space Before, not Space After. I was taught this by a former typesetter. If you add the space before, it's attached to the paragraph itself not the preceding paragraph which means you can have a separate style sheet for the first paragraph with no space before, and also it won't affect any heads or following typographic elements. I hope this is clear.\n\nAlways build the space (whether before or after) into the style sheet itself even if it's a full line space. Good typography is about MINIMIZING superfluous characters, such as an extra return (which will come back to haunt you, say, at the top of a column). This is also why a paragraph indent should be in the style sheet itself rather than a tab character.\n\n"
    },
    {
      "time": "26 Sep 2006 — 7:48am",
      "content": "Also I agree with Tim that it's better to have uneven columns at the bottom than to adjust the space btw paragraphs to align them.\n\n"
    },
    {
      "time": "26 Sep 2006 — 8:08am",
      "content": "William is correct, of course, when talking about novels, or if indenting paragraphs, about there being no need to add space,\n\nOr if one is dealing with narrow columns, justified text, and the other multitudinous combinations everyone else has come up with. ;-)\n\nAs I said, mileage certainly varies....\n\n"
    },
    {
      "time": "26 Sep 2006 — 10:32am",
      "content": "Traditionally, extra paragraph leading, in your understanding James, is more likely to occur in advertisements and packaging than books and editorial. A bit of an oddity, really.\n\nIn page layout applications, it gets more prominence on the palette than its use might merit, as it is a basic variable, and very useful in one particular circumstance -- when going from one size of type and leading to another, such as between deck and main text or between text and smaller quoted matter. in fact, this is its main utility, not for adding extra leading between paragraphs of the same spec.\n\n"
    },
    {
      "time": "26 Sep 2006 — 10:49am",
      "content": "I use the same spacing method as Patty described above for multi page designs. I always use style sheets to do the work since, in 45 years of work, I have never had a job without a text change along the way.\n\nChrisL\n\n"
    },
    {
      "time": "26 Sep 2006 — 10:53am",
      "content": "Style sheets are a MUST even for relatively short texts.\n\n"
    },
    {
      "time": "26 Sep 2006 — 11:01am",
      "content": "Yes, especially for the \"do me another one like last time\" jobs.\n\nChrisL\n\n"
    },
    {
      "time": "26 Sep 2006 — 12:23pm",
      "content": "Patty: You're absolutely right about style sheets for even the smallest texts -- I did a project last month where eight words got their own separate style!\n\n"
    },
    {
      "time": "26 Sep 2006 — 12:39pm",
      "content": "You might use \"space after\" for a deck when you're not sure how large the type in a subsequent paragraph may be, but you want to be sure it clears the descenders.\n\n"
    },
    {
      "time": "27 Sep 2006 — 10:01pm",
      "content": "On a completely different note, a message to Linda:\n\nHi! How's your unique book project coming?\n\n"
    }
  ]
}
