{
  "id": "28406",
  "title": "Typophile problems?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Is is only me, or has Typophile been down all weekend?\n\n",
  "author": "<a href=\"/web/20110709001849/http://typophile.com/user/11526\" title=\"View user profile.\">Goran Soderstrom</a>",
  "time": "<br>",
  "uid": "11526",
  "comments": [
    {
      "time": "",
      "content": "This error message was shown on the homepage:\n\n<cite>Warning: mysql_connect(): Can't connect to local MySQL server through socket '/tmp/mysql.sock2' (2) in /home/httpd/vhosts/typophile.com/httpdocs/cms/includes/database.mysql.inc on line 31<br>\nCan't connect to local MySQL server through socket '/tmp/mysql.sock2' (2)</cite>\n\n"
    },
    {
      "time": "",
      "content": "I couldn't access either : (\n\n"
    },
    {
      "time": "",
      "content": "Me too. Quite disconcerting — like the off license being closed ; )\n\n"
    },
    {
      "time": "",
      "content": "And it's been happening way too often.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Well, I wasn't too worried about it. Gave me an excellent reason to spend my weekend out of the home.\n\n"
    },
    {
      "time": "",
      "content": "Punchcutters - I know you are all far too busy to deal with these bugs over a weekend. If the fix is simple, how about delegating to a responsible admin?\n\n"
    },
    {
      "time": "",
      "content": "I think it is necessary to be off once in a while to feel the love and the lovemaking when you comeback!  \nWelcome with open arms and legs?!  \nAbsence makes wonders!\n\n"
    },
    {
      "time": "",
      "content": "The issue is one of disk space and pruning back content is a manual and sometimes tedious task. We've addressed the issue with Media Temple and have requested more disk space on the server. Thanks for your patience, and sorry for the inconvenience.\n\n"
    },
    {
      "time": "",
      "content": ":( I thought they gave us more space already? Must we start a campaign to raise some funds for more space?\n\n"
    },
    {
      "time": "",
      "content": "With respect to the wonderful resources donated by the current hosts, is there anything users can do to avoid this problem? Like others I'd image, I can donate server resources.\n\nDisk space is not expensive, and shouldn't be an issues these days.\n\n"
    },
    {
      "time": "",
      "content": "Here's an update for anyone interested in the gory details. First of all, apologies for the recent outages.\n\nIn order to enable a database cache, we upgraded MySQL to version 4.1x. At the same time, we added an autostart script. What I neglected to do was to name the said script starting with a capital S (RedHat likes it that way).\n\nIn the mean time, our server is being relocated to a really sweet data center, so for the last few weekends the nice folks at Media Temple have restarted the server a couple of times. Since the startup script was failing, MySQL didn't come back online with the rest of the server like it's supposed to. The problem has been fixed, and hopefully we won't have any more sad Typophile-less weekends.\n\nThe disk space issue has been solved and isn't an issue.\n\n"
    },
    {
      "time": "",
      "content": "\\> The problem has been fixed, and hopefully we won’t have any more sad Typophile-less weekends...The disk space issue has been solved and isn’t an issue.\n\n\"Sadly, the 2 problems have been been fixed, I will have more and more Sad weekends\" my spouse has said.\n\n"
    },
    {
      "time": "",
      "content": "Ok, minor blip this morning. It's been fixed for real. :-/\n\n"
    },
    {
      "time": "",
      "content": "You were saying, Christian? :-/  \n(Ah, the price of success...)\n\n{Hey, you beat me... by a minute.}\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "This is ridiculous!\n\n"
    },
    {
      "time": "",
      "content": "Don't upset Patty. She'll mess you up.\n\n"
    },
    {
      "time": "",
      "content": "No rest for the weary, poor Christian gets another volley of the slings and arrows of outrageous fortune :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "still 'Access denied' -- why?\n\n"
    },
    {
      "time": "",
      "content": "As everyone knows forum software is free and super-reliable, and you can't blame the typophile farm of Mac OS servers, Xboxes and iPods that host the site as they boast 99.99999999% uptime. It must be the complex \"Hrant-Bot\" software that causes the problems. Some may recall the time when it was disabled for a few months, and during that time no-one visited Typophile! But during that time there were no outages. You people can’t have it both ways.\n\n"
    },
    {
      "time": "",
      "content": "We know, we know. But beware the cold-turkey of the addicted! :-)  \nAnd especially beware Patty, apparently. ;-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I think the system goes down when Chris overloads it with his dreadful puns. :-)\n\ns'marks\n\n"
    },
    {
      "time": "",
      "content": "(And there's one on its way even as I type this...)  \n(Unless I just pre-empted it - in which case you guys owe me.)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant, my hreo.\n\n"
    },
    {
      "time": "",
      "content": "Sorry Stewart, I have been up to my Shinns in type solicitations and unable to respond.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Ouch! You might cause me to crash instead!\n\ns'marks\n\n"
    },
    {
      "time": "",
      "content": "Actually, since you got it, the thing doesn't work so I guess we are safe for at least a little while longer.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\> I have been up to my Shinns in type solicitations\n\nAh, valiantly self-critical at least!\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": ";-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "_Don’t upset Patty. She’ll mess you up._\n\nFunniest sh\\*t I've seen all day.\n\n"
    },
    {
      "time": "",
      "content": "Huh???\n\n"
    }
  ]
}
