{
  "id": "28417",
  "title": "custom fonts: types of licenses",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all,\n\nWhen a company (be it a design bureau or any type of corporation) pays for a custom design, what are the type of licenses available in most cases?\n\nFor instance, I'm aware of:  \n\\_ exclusive usage forever  \n\\_ exclusive for X years  \n\\_ ...\n\nCan anyone help me on this issue?\n\nThx!\n\n",
  "author": "Martin LAllier",
  "time": "25 Sep 2006 — 8:18pm",
  "uid": "7309",
  "comments": [
    {
      "time": "25 Sep 2006 — 8:35pm",
      "content": "My impression is that the most common scheme is exclusivity for 2-3 years. And the reason I think this seems to make sense is that the novelty of a new magazine or newspaper design or re-design is what counts most, and after that time the novelty is deemed to have expired. But of course not every custom job is tied to fashion, and in some cases perpetual exclusivity can make more sense.\n\nAnother thing to consider is redistribution rights: the client of a custom font can purchase the rights to merely use it (and even only within a certain sphere, let's say its US operations) or it can purchase the rights to give it away or sell it.\n\nhhp\n\n"
    },
    {
      "time": "25 Sep 2006 — 8:41pm",
      "content": "Thx Hrant, but in the case of a company - a branding font - could be defined to last for a much longer time?\n\nDo some designers sell non-exclusive licenses in some of these cases?\n\n"
    },
    {
      "time": "25 Sep 2006 — 8:46pm",
      "content": "Do you mean a totally non-exclusive license, such that the designer can immediately start selling the font via retail or even sell it as a custom font to another party? That seems like it would be rare - except maybe if the font's main purpose is to solve a particular technical issue, like maybe rendering on a certain low-res device.\n\nI suspect that in the case of a serious brand the client will want perpetual exclusivity, and probably even outright ownership: they would pay to have a font made for them, and then the designer is out of the picture... unless they need more Unicode coverage or better hinting or... :-) In fact one thing the designer could do in such cases is stipulate that any future modification/extension has to be done by him (although it's hard to imagine an astute client accepting such a clause).\n\nhhp\n\n"
    },
    {
      "time": "25 Sep 2006 — 8:51pm",
      "content": "thx\n\nand what would be the price - I'm talking of an average, an “in between” such and such amount - for an exclusive font creation?\n\n"
    },
    {
      "time": "25 Sep 2006 — 8:54pm",
      "content": "I haven't done enough of those to be a reliable source.  \nAnd good luck finding out... :-/\n\nBTW: [http://typophile.com/node/28302](http://web.archive.org/web/20150122084315/http:/typophile.com/node/28302 \"http://typophile.com/node/28302\")\n\nhhp\n\n"
    },
    {
      "time": "26 Sep 2006 — 7:00am",
      "content": "The type of license varies with each commission. It depends on the clients needs, and their budget. Custom work that is non-exclusive is priced lower than exclusive work. 2 to 3 year exclusive work is less costly they longer periods. Some clients prefer to pay a yearly fee to maintain their exclusivity.\n\nAs to price, discussing price in a forum such as this can bring the participants into some legal hot water, Price fixing, that sort of thing.\n\nIf you want to get an idea on how much these things cost, why not begin by pricing enterprise licensing from various foundries. How much do they charge per font for a worldwide license? We all have those prices. Then, if you are going to spend that much money for a worldwide license for a font that already exists, and is in use by many, how much is a custom design going to be worth? At least as much as the enterprise solution, no? Most likely a little more.\n\nJames\n\n"
    },
    {
      "time": "26 Sep 2006 — 8:13am",
      "content": "\\> Some clients prefer to pay a yearly fee to maintain their exclusivity.\n\nInteresting.\n\n\\> At least as much as the enterprise solution, no?\n\nBut don't some companies commission type to actually save money?  \nLike UPS did I belive (although that's not the best example :-).\n\nhhp\n\n"
    },
    {
      "time": "26 Sep 2006 — 10:01am",
      "content": "Save money? I think it would be more like getting a solution and a license that fits their needs. Say Foundry X charges $10,000 per font for a worldwide license. Compay Z wants to license 4 fonts for a enterprise solution. Do they pay $40,000 for a four font family that exists and is being used by others, or do they pay a silmilar figure (maybe a little higher, maybe a little lower) for a custom solution?\n\n"
    },
    {
      "time": "26 Sep 2006 — 10:39am",
      "content": "I can't add anything to what James has said.  \nI've done custom work for varying durations of exclusivity, from zero to, gulp, forever.\n\nI like the renewable fee idea.  \nI mean, it's not something I've considered before, but will put it in proposals from now on.  \nThanks James!\n\n"
    },
    {
      "time": "26 Sep 2006 — 11:04am",
      "content": "James: what I was getting at is that if Company Z is big enough (in terms of number/geographic-range of computers needing the new font) the cost of a custom font even with perpetual exclusivity might be less than the cost of a worldwide license of a given existing font. And the fact that a \"cheap\" custom font tends to be inferior (except in its exclusivity) to high-quality existing fonts seems sadly lost on many clients.\n\nhhp\n\n"
    },
    {
      "time": "26 Sep 2006 — 11:22am",
      "content": "Custom fonts don't have to be \"cheap\" in the negative quality sense. They can be of equal quality to commercial fonts but economically feasable--indeed attractive--to an organization with broad expanse.\n\nChrisL\n\n"
    },
    {
      "time": "26 Sep 2006 — 11:29am",
      "content": "If you look at James's formula above, you can see that if you divide the cost of producing a good custom font by the licensing cost per seat of an off-the-shelf face, you can find the breakeven point for a given organization. You could then begin marketing your custom services to organizations above that size and use economy of scale as a selling factor.\n\nChrisL\n\n"
    },
    {
      "time": "26 Sep 2006 — 11:41am",
      "content": "That's not what I meant.\n\nhhp\n\n"
    },
    {
      "time": "27 Sep 2006 — 3:33am",
      "content": "I think the length of exclusivity depends very much on the type of organisation you are doing the work for. Some, say publishers, may need only 2 years. Others, like global corporate entities may need much longer ones as implementation throughout the organisation alone can take a year or two. That, and given the fact that a rebrand is unlikely within 8 to 10 years means that they need longer exclusivity.  \nAccordingly, you set your pricing.\n\nFor most corporates, the lure of a custom font is not about design (although it is part of the idea) but that it has logistic advantages. They are able to distribute these fonts from their brand site to all their suppliers without having to worry about extra licensing. This is probably one of the major factors why companies go for it. Ease of use!\n\nBruno Maag  \nDalton Maag Ltd\n\n"
    },
    {
      "time": "27 Sep 2006 — 2:10pm",
      "content": "[Leslie Cabarga](http://web.archive.org/web/20150122084315/http:/typophile.com/wiki/Leslie%20Cabarga) gives some good buisness advice including advice on pricing in his book [The Logo, Font & Lettering Bible](http://web.archive.org/web/20150122084315/http:/typophile.com/wiki/Logo_Font_and_lettering_bible). Also, i'm sure that James' advice above is some of the best you can expect to find.\n\n"
    },
    {
      "time": "27 Sep 2006 — 3:25pm",
      "content": "Hi Paul, I just got a copy of Leslie Carbaga's book. I haven't looked at the business end of it yet, but I have no doubt it is as good, practical, enjoyable and readable as the rest of it.\n\nNow - back to the thread.\n\n"
    },
    {
      "time": "2 Oct 2006 — 5:45pm",
      "content": "No precise information on pricing in the Cabarga book...\n\n"
    }
  ]
}
