{
  "id": "2842",
  "title": "NEWORLD software",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "OK, so it's my turn.   \n   \nFor over 15 years I've used the name \"NEWORLD\" (yes, I know others use it too) informally for the multimedia productions/programming that I do. I chose that name because of many reasons, but the one reason that might be usable in logo design is this: \"norashkharh\" (which translates to \"new-world\") is the Armenian name of a fruit that I really love. I've never known its English name, but it looks like a tiny pear with a very thick, fuzzy, dark greenish-brown stem; the body is dark orange, with a thick peel; the seeds are huge, dark brown, and usually in pairs or triples\\*; the trees have large, thick, dark green leaves. (It's ironic btw that it's originally from the New World, but people here don't seem to harvest them.)   \n   \n\\* Superb ammo for improvised wargames, btw! Just the right heft for pain with no injury. And great aural resonance when dropped onto car roofs (preferably in a fistfull) from a 6th-story apartment... :-\\>   \n   \nAnyway, I never had a [decent] logo, but now some of your guys's design sense has [hopefully] rubbed off onto me, and I feel ready to \"congeal\" a visual identity.   \n   \n ![neworld.gif](http://web.archive.org/web/20131018213220im_/http:/www.typophile.com/forums/messages/4100/24876.gif)   \n   \nI would like to have some melding trick in the \"w\", not least as an allusion to the WWW.   \n   \nFor the top-left one, I can make it all-caps, or maybe unicase (which might create a good avenue for \"w\" trickery). If I leave it lc, I could nestle the \"software\" above it (to the left of the ascending \"ld\"). I don't think I can make it an intercap -\"NeWorld\"- decently, and \"Neworld\" detracts from the \"World\" part.   \n   \nFor the other three, the inside squarish part I'm thinking needs really full, blocky, kinda hard to decipher letters (like in FF Extra) - maybe in reverse field. For the bottom-left one (or maybe the top-right one too), I'm wondering if I could make the \"W\" into rays\\*, like a newly rising sun or something - but the \"W\" would have to remain strongly legible.   \n   \n\\* In which case maybe I could set \"NEWORLD\" in a semi-circle around a sun-disk (or half a disk). Huh, a disks is a good allusions to a CD too...   \n   \nBTW, the \"software\" part is really optional. I'd even consider using another word that makes sense (or for the logo just \"NEWORLD\" maybe).   \n   \nAdvice appreciated... and needed! I hope the multiplicity of directions I mention above don't derail some totally different -and much better- ideas you guys might dream up.   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "25 Jan 2004 — 12:24pm",
  "uid": "1250",
  "comments": [
    {
      "time": "25 Jan 2004 — 8:12pm",
      "content": "I think that the top left one is a good setting which can work well with a Symbol which involves the ww \"trick\".   \n   \nThe other settings I think that will be hard to read and remember, but i\n\n"
    },
    {
      "time": "25 Jan 2004 — 10:40pm",
      "content": "\\> What kind of work do you specifically do?   \n   \nMulti-media CD-ROMs of almost anything (promotional pieces, edutainment, training, press kits, etc.) using Director, as well as Shockwave and Flash, and some pure programming too (but rarely). Most projects are a tightly-integrated mix of design (graphic, interface) and coding (mostly lightweight though), where I often don't do most of the art (but usually do do the sound), but almost always specify how the art needs to \"fit\".   \n   \nYou're right that \"software\" can confuse some people, but in a way it's a general term that covers what I do nicely, plus it alludes to the fact that I'm a programmer by education. I'm trying to convey that I'm not just some Flash monkey (with apologies to all the Flash monkies out there, especially in this Year of the Monkey\\*). I could also use \"productions\", but probably not \"design\", since I suck at graphic design per se.   \n   \n\\* BTW, my Chinese horoscope sign is Monkey, so watch out for some heavy ranting this year!   \n   \n(Thanks for the link.)   \n   \nhhp\n\n"
    },
    {
      "time": "26 Jan 2004 — 8:51am",
      "content": "Hrant, try something with a circle. It reflects your media and the world as a circle. Maybe some research into native american sun symbols will give you some inspiration for the w as rays. Its so refreshing to see sketches. I don't need to see a semifinished idea to get it.   \n   \nWasn't Return of the King awesome, it kicked some serious posterior\n\n"
    },
    {
      "time": "26 Jan 2004 — 9:24am",
      "content": "I agree with H\n\n"
    },
    {
      "time": "26 Jan 2004 — 4:21pm",
      "content": "\\> native american sun symbols   \n   \nPardon the language, but that's a goddam good idea.   \n   \n\\> Its so refreshing to see sketches.   \n   \nEspecially mine, which make people feel really good about their own sketching skills... :-/   \nBTW, I started with sketches because I need as much help as early as possible!   \n   \nSo what I'm thinking is two possibilities: the top-left one in unicase; an Amerind half sun disk with the \"W\" as rays. But I have to figure out if \"software\" is in fact a good idea.   \n   \n--   \n   \nLord of the Rings: the sad thing is that movies that good are so rare. Amazing stuff.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Jan 2004 — 4:29pm",
      "content": "The three things I'd say are:   \n- The \"e\" is way too shy - it should be exploding with characater!   \n- The \"w\" should be braver.   \n- Take a look at your ascender lengths.   \n   \n   \n-----   \n   \njust kidding   \n   \n----   \n   \nSeriously, maybe you could barter with some folks   \nhere and do some kind of trade?   \n   \nPascal anyone?   \n   \nbj\n\n"
    },
    {
      "time": "26 Jan 2004 — 4:43pm",
      "content": ":-\\>   \n   \n\\> maybe you could barter   \n   \nI suck THAT hard, huh? :-)   \n   \nBut yeah, I do have metal Pascal (amazing design from the late 50s by Jose Mendoza y Almeida - puts Optima to shame) in 60, 48 and 30 point. Anybody interested in an outright purchase? (And I'm not paying for shipping...)   \n   \nI'll consider farming this out if you guys start making puking sounds once I put up my first actual outlines.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Jan 2004 — 8:22pm",
      "content": "ooops. Sorry, no.   \n   \nA barter sounded like a good idea at the time\n\n"
    },
    {
      "time": "26 Jan 2004 — 8:44pm",
      "content": "Well Hrant I think that before you go further on the graphic development of your new logo (which started on a good path) you first need to define more precisely the identity message you will convey with it.   \n   \nTry to give it an estrategic approach because your logo can do a lot of selling for you if you make it tell the right message.   \n   \nYou are an specialist inside a specialiced niche with advantageous profesional skills trying to sell your work to graphics and communication specialists (if I don\n\n"
    },
    {
      "time": "26 Jan 2004 — 8:53pm",
      "content": "By the way Hrant, don\n\n"
    },
    {
      "time": "26 Jan 2004 — 10:01pm",
      "content": "Brian, no apology necessary at all! I'm really not good at logo design, period. But neither am I a megacorporation: as some people have pointed out recently, there's a limit to how relevant an identity can be for a smallfry.   \n   \nI'd like to have something decent that conveys one or two key concepts, and maybe has a little bit of charm/humor too. With the guidance of people here I think I can probably achieve that \"internally\". That makes it more personal, not to mention less expensive. If/when I make it big (yeah, right) then I'll spend money in proportion to the relevance of having a good mark. But I'm not _that_ cheap - like I'm considering buying Panoptica if I go with the top-left option.   \n   \nHector, thanks for the pointers. I guess basically I want people to think I know how to handle the \"new world\" of media. It's not that new any more I guess, but being an \"old hand\" at \"new media\" (since '87) has its advantages. This \"old-timer of the new world\" aspect I think is conveyed well with Amerind symbology - plus it has a personal dimension, so it would tell people something about me, although very indirectly.   \n   \n\\> what is so goddamed (did I write this well?) good about you.   \n   \nI would like to convey my affinity for innovation and technique.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2004 — 7:26am",
      "content": "Hrant, don't make the logo do your sales, just make it interesting, unlike most media. Use language to make sales. If you can incorporate a sun symbol into your mark just think what you could do animating it. Media isn't always static, it just pretends to be that way\n\n"
    },
    {
      "time": "5 Feb 2004 — 11:22am",
      "content": "OK, so I've had time to play with this some more.   \n1) The two Amerind symbols that I found that might have worked were the Zia sun (think New Mexico flag), and that dark, angular spread-out bird. But for the fomer I couldn't get the \"W\" to fit well, and for the latter I it needed to be too literal to really work. :-(   \n2) Of my first sketches, only the top-left seemed to have any merit.   \n3) I've dumped the second word. No \"software\" or \"multimedia\" or anything, at least not as part of the main logo.   \n4) Please don't flog me, I still don't like wanton use of swooshes, but in my case (\"world\") it really does make sense. Really, really... So please tell me what you think of these:   \n   \n ![NW2](http://web.archive.org/web/20131018213220im_/http:/www.typophile.com/forums/messages/4100/25684.gif)   \n   \nI also have one other totally different idea, where \"NEWORLD\" is rendered as a quasi-bitmap with rays... I'll have that in a digital file soon.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Feb 2004 — 11:35am",
      "content": "\\> but in my case (\"world\") it really does make   \n\\> sense. Really, really...   \n   \nThat's what everybody says... Hehe!   \nNo swoosh please.\n\n"
    },
    {
      "time": "5 Feb 2004 — 11:46am",
      "content": "Hrant, try flipping the the swoosh on the 2nd idea on the top row, then join it with the custom 'w', top make the bottom of a sun dipping into the word to make the w. You may want to eliminate the extra v on the w if you do this (too many tricks at once).   \n   \nAnother idea would be to abandon the swoosh (and I'd advise it) and use a more 'planetary' circle. Then you could do a newOrld or something...\n\n"
    },
    {
      "time": "5 Feb 2004 — 1:09pm",
      "content": "Chris, I'm not seeing how the \"underside\" of a planet could become a \"w\"...   \n   \n--   \n   \nTo keep Typophile a swoosh-free zone ;-) I came up with this too:   \n   \n ![NW3](http://web.archive.org/web/20131018213220im_/http:/www.typophile.com/forums/messages/4100/25697.gif)   \n   \nI'm thinking if I should make the rays more like rays - maybe taper them thinner towards the outside. Right now the rays get thicker (with mathematical precision, of course ;-) to keep the gaps constant in size.   \n   \nDo you think the \"W\" is too open? I could drop out the center bar, but wanted to give that letter some weight (and I couldn't make it legible enough as a \"triple-u\" in this rendering).   \n   \nAnd what do you think that circle thing is?   \n   \nhhp\n\n"
    },
    {
      "time": "5 Feb 2004 — 1:33pm",
      "content": "\\> power button?   \n   \nYes, although it's not supposed to be so literal. It's basically a zero and a one (which is where the power button comes from too).   \n   \n\\> could you do that same thing to the circle?   \n   \nMaybe horizontally, yeah.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Feb 2004 — 1:36pm",
      "content": "Plus the circle thing can be an iris too, with the type being an eyelid, or a brow? I could make the type shorter/squatter to emphasize that.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Feb 2004 — 2:47pm",
      "content": "I like the last one minus the power button. Maybe the weight of the lines could taper towards the top (ray like), more triangles than rectangles\n\n"
    },
    {
      "time": "5 Feb 2004 — 2:52pm",
      "content": "It seems ( from the posts so far ) like you are jumping into the creative act before knowing what you intend.   \n   \nYou would never design a typeface without having it's intended use/purpose in mind would you?   \n   \nI don't really think it's wrong to say to yourself - 'maybe a sun design, maybe a deep red color '- or whatever you may think up. However I do think you would feel more confident & satisfied in your choice if you knew what your you meant by those choices. Your pleasure & confidence in your mark could be good for business in & of itself!   \n   \nIf I were doing this project I would want to know what you wanted a prospective client to assume about you. Logos are great for suggesting things about their owners/companies.   \n   \nIf your logo was a poem spoken into the unconcious mind of a viewer allowing you to quietly shape his ideas about your company - what would it say?   \n   \nWith the Nike swoosh you get : motion. Simple. That's what I think the nice swoosh's 'poem' is. Motion.   \n   \nAnother issue is distictiveness. What do your competitors logos/identities look like? You should probably avoid anything that looks too much like their logos or which uses similar ideas to avoid any confusion & or any dimishing of your logo.   \n   \nWhat about having a no logo identity which work off of graphic standards rather than a mark per se? Or a logo that is a set of variations rather than something static? I have to admit that some of the best work I have seen in the last 10 years seems to be about identity rather than a 'logo'. There are logos in most of the examples I am thinking about but the logo is part of an larger & cohesive whole.   \n   \nWhere the logo will be used - computer screens/web presumably - but where else? Does it need to work at a small size on a TV screen for instance?   \n   \nIf you know where it is going to be used that will shape your thinking too. It's quite alot like like when you know a font is going to be used on newsprint- you will avoid obvious problems when designing it or selecting it.   \n   \nA one color design, or a design that works well in one color can save on repro costs too!\n\n"
    },
    {
      "time": "5 Feb 2004 — 2:52pm",
      "content": "Daniel, you read my mind!   \n   \n ![NW4](http://web.archive.org/web/20131018213220im_/http:/www.typophile.com/forums/messages/4100/25712.gif)   \n   \nhhp\n\n"
    },
    {
      "time": "5 Feb 2004 — 2:58pm",
      "content": "I like it Hrant, its different and unique\n\n"
    },
    {
      "time": "5 Feb 2004 — 3:11pm",
      "content": "Eben, I'm usually guilty of overloading my design work, so I'm trying to keep things simple this time. As I said before, \"I would like to convey my affinity for innovation and technique\", and/or of being an old-timer in new media. But even that might be asking too much, so just some humour/meaning would be great - which is what I'm trying to do with the arc-of-a-circle stuff (and now with the rays). But I'm frankly not sure what that button is... :-/ It's supposed to be a \"digital eye\" or something... Do you guys think the logo would look OK with nothing there?   \n   \nOf the stuff I've tried so far, the only two that speak to me are the simple ones with the \"triple-u\" (maybe sans swoosh), and this latest one.   \n   \nBTW, isn't it cool that this lastest one is getting an Amerind feel without me even trying?   \n   \n\\> What do your competitors logos/identities look like?   \n   \nThat's a very good question. But it feels like there's too many of them to figure out what _not_ to look like... What I guess I can/should do is look at the bigger local outfits, ones that my potential clients might go to instead of going with me. Do you guys know of a directory where I can them look up?   \n   \n\\> a logo that is a set of variations rather than something static?   \n   \nThis type of thing fascinates me, and it's fashionable now too. I'll think about it. Any ideas yourself on this?   \n   \nBTW, the logo will be used mostly on business cards, stationary and in credits of produced pieces - so nothing _too_ low-fidelity. One big advantage my logo could have though is being animatable. And I think something made up of rays has a lot of potential there.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Feb 2004 — 3:27pm",
      "content": "Thats the beauty of the new mark you can animate it using the rays, the potential is fun but I still don't get the keyhole below it. KISS\n\n"
    },
    {
      "time": "5 Feb 2004 — 3:46pm",
      "content": "When you say \" affinity for innovation and technique\" I guess I was thinking of the evocation associations that are less cerebral & more emotional or poetic. Innovation could be bleed out into description like mutable, as opposed to static, variety etc. It could also associate with ideas of dynamicness, shifting - not resting.   \n   \nWhen you say technique I can't imagine what you couyld mean. I think of skilled maybe but I don't feel confident that thats what you have in mind.   \n   \nAbout the logo you have going I think you don't need the eye per se. It seems like an afterthought to me - as it is being presented now. I get the idea that you press the button & you get a glowing new world. If thats the idea then maybe it would be good to integrate the two a little more.   \n   \nI bet the letters could work on their own though!   \n   \nI would loose the button myself. When I look at GUI with buttons I usually don't like it because the metaphor of the physical is almost always wrong somehow. In the case of a logo it's less so but my prejudice remains.   \n   \n\\<venting\\>Buttons are so then... Also the rise of simple text based blogs & boards like this one & typographi.ca which use simple looking but sophiticated layout are happily showing us that buttons are not needed.\\</venting\\>   \n   \nWhat about adding some kind of texture or phyical reference to the logo. Like as if it was woven into a basket or cut into pottery - Amerind craftishness embeded at a subliminal level could offer alot of richness.   \n   \nThat actually might refer to your idea of 'technique' via the reference of craft.   \n   \nAlot of what I have enjoyed about your posts is that you seem concerned with legitimate craft as a means to expression as opposed to expression without regard for craft. I am probably putting words in your mouth to some extent & if so sorry about that if I am.   \n   \n- Actually you could have versions of the logo as they would be woven carved or printed using a variety of old style, real world, materials as a basis for a logo with multiple permutations.   \n   \nhmm   \n   \nAlso would you sell type designs under this brand? I assume not but...\n\n"
    },
    {
      "time": "5 Feb 2004 — 7:00pm",
      "content": "_Chris, I'm not seeing how the \"underside\" of a planet could become a \"w\"..._    \n   \nHrant, this is what I meant. The w would evoke the image of sun rays. Although, as you can see, it's not that clear what's going on. But, at this point, the newer ideas you've been posting probably have a better chance of yielding something distinct and interesting.   \n   \n ![newworld sketches](http://web.archive.org/web/20131018213220im_/http:/www.typophile.com/forums/messages/4100/25736.gif)\n\n"
    },
    {
      "time": "5 Feb 2004 — 7:21pm",
      "content": "Since you're not an American Indian and your business has nothing to do with native Americans, I think dragging in Indian symbols and the sun is a mistake. Your first upper left concept was good, and formalized will be excellent. I tried, for example, setting it in Mark Simonson's [Sharktooth](http://web.archive.org/web/20131018213220/http:/www.myfonts.com/fonts/marksimonson/sharktooth/bold/testdrive.html?s=Newworld&p=48).\n\n"
    },
    {
      "time": "6 Feb 2004 — 8:57am",
      "content": "Chris' design is pretty cool. It makes you 'atlas' which considering the name has 'world' ( read also globe & planet) in it seems appropriate.   \n   \nWhat about domain names? What will that be? Have you checked that there is one that will work. Newworld & neworld are taken. Other obvious ones look to be for sale. Do you own one of them?\n\n"
    },
    {
      "time": "6 Feb 2004 — 10:20am",
      "content": "\\> you can animate it using the rays   \n   \nRight - I can make them come up from the \"surface\", or make them ripple laterally, or even have them as cones with a fly-through\\*. I did 3D animation for 8 years, although now I'm pretty rusty.   \n   \n\\* Yeah, make them orange, and have the slogan \"Neworld will help you navigate through obstacles\"... ;-\\>   \n   \n--   \n   \n\"Technique\": I guess it's a more contemporary way of saying \"craft\". Like something you do to ensure long-term quality that might not be obvious. Like putting good kerning in a font. (BTW, no font stuff at Neworld - that's what The MicroFoundry does.)   \n   \nThat button isn't supposed to be a button... But anyway, it's gone now.   \n   \n\\> What about adding some kind of texture or phyical reference to the logo.   \n   \nThat sounds like a good idea - although it might push my design skills beyond my abilities... I'll see what I can come up with.   \n   \nDomain names: I used to think a catchy domain name is very important. It might be for a Joe Shmoe using the web semi-randomly to find a megacorporation, but for highly focused operations that you could never employ by chance encounter, just throwing in a hyphen or something will avoid problems with existing names. So any decent domain name (with a pre/post-fix to \"neworld\") would work fine in my case, I think. And if I go with a logo with a triple-u (\"ww\" when spelled out) that might help a lot.   \n   \n--   \n   \nChris, I like your rendering with the triple-u! Pretty clever concept - definitely a strong candidate. It kinda looks like a bird, but most people like birds.   \n   \n--   \n   \n\\> dragging in Indian symbols and the sun is a mistake.   \n   \n1) American Indians are the old-timers of the New World - like me in my field.   \n2) I'm Armenian, and our histories have strong parallels - so it has personal relevance\\*. I agree that shouldn't be made too important - but I think it's a nice, meaningful touch. And if I offend people who think the American Indians are just a bunch of drunkards who should have been wiped out totally (as opposed to the partial treatment they got...), and decide not to give me their business as a result, I think I can live with that.   \n   \n\\* You don't have to be part of a minority to feel a connection. Heck, many people (notably westerners) feel a strong connection with WHALES... It's like the Irish guy in The Commitments said: \"We're the niggers of Europe\"! :-/   \n   \nOn the other hand, I do think that an Amerind reference shouldn't be too literal - which is why I didn't bother with that dark angular bird symbol - although Daniel brought a bird in anyway! :-)   \n   \nSharktooth is an interesting suggestion - thanks.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Feb 2004 — 1:39pm",
      "content": "Here's a couple of renderings.   \n   \nThis one's a few days old, from before my decision not to have a second word in there:   \n   \n ![Old](http://web.archive.org/web/20131018213220im_/http:/www.typophile.com/forums/messages/4100/25851.gif)   \n   \nIt shows what a triple-u could look like.   \n(Note: the \"N\" needs work on the serif lenghts.)   \n   \nAnd this is the one I THOUGHT I'd like most, but it seems too static. The one I'd done before (Feb 5, 2:52) was a quickie test with only partially correct scaling of the tips, but its funky weight distribution seems to give it an energy this doesn't have (plus it's more Amerind-looking). This new one does have kerning, though: a hair off the \"EW\", and a bit more off the \"LD\".   \n   \n ![NW4a](http://web.archive.org/web/20131018213220im_/http:/www.typophile.com/forums/messages/4100/25852.gif)   \n   \nBut what do YOU guys think of this new -perhaps \"colder\"- one?   \n   \nOh, and the button/eye/whatever is gone.   \n   \nTwo questions:   \n1) Is the \"W\" too open?   \n2) Is the bottom too empty?   \n   \nhhp\n\n"
    },
    {
      "time": "6 Feb 2004 — 2:05pm",
      "content": "I like the last one Hrant, just think, of what it will look like when you shrink it as on a business card. It will be even more cohesive. There is also a code feel to it 101010, line space line space. (To me) Nevvvold looks like a typesetting mistake, not a logo.\n\n"
    },
    {
      "time": "8 Feb 2004 — 12:24am",
      "content": "I agree with daniel about the triple u. I would like to see some work done to enhance the readability somehow. Seeing the design for the 5th time it seems to vibrate just a little too much. What do you think more contrast in the rays would be like? I mucked with it a little to see   \n   \n. ![](http://web.archive.org/web/20131018213220im_/http:/www.typophile.com/forums/messages/4100/25943.gif)\n\n"
    },
    {
      "time": "8 Feb 2004 — 2:04pm",
      "content": "ok hrant, you've been so helpful to me i'll pitch in my two cents here for you. extrapolating from what eben just posted, i'd set the newworld (using the triple-u) in a good sturdy san serif on an arc and then apply the rays over it. i'd use two good contrasting colors, one for the background and one for the rays (maybe making the triple-u the solid ray color) i'd put in a second word within the arc (i know you scratched that idea) but i kinda like \"newworld newmedia\" but that might be too cheesy for ya (but then you would use a ww-ligature and a wm-ligature ha ha) and for a domain name, neuuuorld.com isn't taken yet. so there ya go, for what it's worth\n\n"
    },
    {
      "time": "9 Feb 2004 — 10:10am",
      "content": "\\> There is also a code feel to it   \n   \nVery cool.   \n   \n\\> I agree with daniel about the triple u. I would like to see some work done to enhance the readability somehow. Seeing the design for the 5th time it seems to vibrate just a little too much.   \n   \nI'm confused where you stop talking about the triple-u version and where you start talking about the rays one. BTW, I'm surprised that you guys really think the triple-u would be seen as a typo... You could never even type that! :-)   \n   \nFor the readability (of the rays, I'm assuming), wouldn't you say that I need to strike a balance between looking like rays versus looking like \"NEWORLD\"? I'm thinking if people see rays first and a second later see the name, maybe that's a _good_ thing?   \n   \nFor the \"vibration\" I'm sure you mean the rays one, but is it a _bad_ vibration? The annoyance it generates, could it be slight enough to be \"a feature and not a bug\"? Hard for me to see \"from inside\". That and the earlier version with the heavier outside rays give the logo a nice dynamism, a rawness, no? Dunno. I have an aversion to it looking too polished, too static. Do remember this is multimedia work (in terms of movement).   \n   \nYou can tell I'm thinking out loud here. Hopefully that'll help me overcome my weaknesses in graphic design...   \n   \nBTW, I like your thinner and taller rays (I'd just have to negate the skew).   \n   \n--   \n   \nPaul, interesting ideas - I'll see how far I can take them. I think I could create your combo triple-u/rays thing with positive/negative shapes instead of two colors. Hopefully it won't be too overloaded though.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Feb 2004 — 12:25pm",
      "content": "_I've never known its English name, but it looks like a tiny pear with a very thick, fuzzy, dark greenish-brown stem; the body is dark orange, with a thick peel; the seeds are huge, dark brown, and usually in pairs or triples\\*; the trees have large, thick, dark green leaves._   \n   \nI immediatly thought of a [loquat](http://web.archive.org/web/20131018213220/http:/plantsdatabase.com/showpicture/19339/) because of the desciption matches perfectly -- down to the fuzzy stem -- some are darker in color than those shown. It is found through california, but originates in asia. We had several at my parents house. Very little flesh in them, mostly seed. We used to eat them, some people make preserves out of them. Also called a Japanese Plum.   \n   \nOthers thoughts were [cumquat](http://web.archive.org/web/20131018213220/http:/www.bhg.com.au/gardening.nsf/Content/Plant%2Bencyclopedia%2B-%2BCumquat%2B-%2B0358?openDocument&print=yes), and [JuJube](http://web.archive.org/web/20131018213220/http:/www.parsproduce.com/Kiwifruit.html).   \n   \nRandy\n\n"
    },
    {
      "time": "9 Feb 2004 — 12:50pm",
      "content": "That's it!! Thanks so much Randy! Yeah, the meatier the blander, usually.   \nI knew cumquat - called \"serguevil\" in Armenian - my dad makes jam from it.   \nAnd \"jujube\" (called 'anab in Arabic, which just means vine, I think) I think I've had once or twice.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Feb 2004 — 4:59pm",
      "content": "hey hrant,   \nhere's a rought pass at what i was trying to describe. ![](http://web.archive.org/web/20131018213220im_/http:/www.typophile.com/forums/messages/4100/26132.gif)   \ni just think it works better to have solid letterforms, anyhow that's just my spin on things. give us some updates on what you're coming up with.\n\n"
    },
    {
      "time": "10 Feb 2004 — 3:20am",
      "content": "New World might have a resonance of native americans, but I really don't see it having any relevance to software, high tech, more a kind of organic/farming feel. I would approach this more from Chris' new world/new planet feel. But for a more personal and distinctive approach try incorporating the fruit.   \nTim\n\n"
    },
    {
      "time": "10 Feb 2004 — 6:10am",
      "content": "Hrant stay with something abstract a logo doesn't have to be literial, just memorable. Sorry folks but I still see New vorld. Sort of has a german sound to it, huh. I still like the rays that look digital, they say new to me and its different and simple.   \nTim did you ever hear the term \"A new world of discovery\" used in connection with science or medicine? Its a relivant name for Hrants business, he's not doing things in the same old way.\n\n"
    },
    {
      "time": "10 Feb 2004 — 7:37am",
      "content": "Daniel, I'm afraid you misunderstood my point, I was observing that to link the name of the company to a native american symbol (or even to hint at one) might lead to confusion, whereas a logo based on new planets/new voyages would be more relevant to his business.   \nTim\n\n"
    },
    {
      "time": "10 Feb 2004 — 10:04am",
      "content": "I actually don't mind literal elements\\* as long as they don't have negative connotations - like a ship/sail in this case is too imperalistic for me. Maybe something alluding to a compass or a map would work though. And longitude/latitude lines might work too. Maybe a pair of perpedicular lines, bulging like they're wrapped on a sphere, with a circle/dot at the intersection. That would be nicely animatable.   \n   \n\\* Like I've always had the fruit in the back of my mind - it's nice and neutral, but not bland.   \n   \n\\> N E W (world) are directional points.   \n   \nThat's a great observation! Let me think about it.   \n   \n--   \n   \nChris's design has been on my mind, but as funny as it might sound it seems too polished. A superb mark for a larger, prestigious operation, but maybe too \"slick\" for me - like the version of my rays with the \"perfect\" tapering - too static. I'm seeing if I can \"rough up\" Chris's idea though, and I'd like to figure out how animatable it is.   \n   \n--   \n   \nThere's been some great ideas here, thanks a lot. I think I need to spend a little bit of time thinking now - but that doesn't mean you should stop! :-)   \n   \nhhp\n\n"
    },
    {
      "time": "11 Feb 2004 — 4:09am",
      "content": "my suggestion...   \n   \n ![](http://web.archive.org/web/20131018213220im_/http:/www.typophile.com/forums/messages/4100/26278.gif)   \n   \nODA\n\n"
    },
    {
      "time": "11 Feb 2004 — 6:20am",
      "content": "hhp you are reaping the benefits of your title as postmaster general. Here are my two cents. I think since you are the one executing the logo we should not pass up your biggest strength: type design.   \n   \nGiven that, your mention of maps or compasses got my mind ticking. It is ironic to me that those two things that we conote with the\n\n"
    },
    {
      "time": "11 Feb 2004 — 7:35am",
      "content": "Hrant, another thought: keep a felt tip sketch, drawn carefully, for neworld, as in your original upper left sketch. Then as subtitle some very mechanical typeface, like OCR B. I think the handwritten quality of the combined w's work better, because it's obviously deliberate. The 'neworld' in felt-tip also has an immediacy, like you've just discovered, and have to get on to important things. Just a thought.\n\n"
    },
    {
      "time": "11 Feb 2004 — 8:29am",
      "content": "On Chris's idea:   \n   \nI've been thinking of what would happen if you turned the \"wings\" the other way - or made the tops of the rest of the word into the horizon.\n\n"
    },
    {
      "time": "11 Feb 2004 — 10:35am",
      "content": "Randy, I do want to play my type skills into the logo, but that includes bitmap fonts - which I think plays great with the 0/1 idea you have, and alludes nicely to the digital age too. I don't like the weathered type look though.   \n   \nIf I could use zeros and ones in the rays version, that might be great, assuming it doesn't get too busy. Your idea of using zeros and ones as borders is also nice - I could even embed numbers that mean something - I like that complexity shite.   \n   \n(BTW, I think individual generosity is a bigger factor than people wanting to \"reward\" me or something.)   \n   \nWilliam, I might try that. For one thing Randy just gave me the idea that maybe just the \"W\" in \"NEWORLD\" should be in a rougher (weathered or handwritten) style than the rest.   \n   \nShreyas, I'm actually playing with Chris's idea - if I have anything presentable I'll pass it by you guys.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Feb 2004 — 11:35am",
      "content": "Hi all (I'm new here, hi!), I think the 'www' has a certain mischievous quality to it when its stuck together like that kind of playful, I think handwritten www sounds good   \n   \nAn idea for animation is that you have initially two words 'New and World'. They move towards each other (slow glide), they touch, lights buzz glow etc (but no sound fx, not sure about musuc). The glow fades and your logo appears. The background is dark blue to black. =)   \n   \nHorse-ed some logos out, inspired to use Futura by Solaris movie title ... just (silly) ideas ...   \n   \n ![](http://web.archive.org/web/20131018213220im_/http:/www.typophile.com/forums/messages/4100/26348.gif)\n\n"
    },
    {
      "time": "11 Feb 2004 — 12:15pm",
      "content": "Hrant,   \n   \nI didn't mean that you should do a weathered logo. Just that you might riff on the old world forms. Do a pixel arrighi, or a very constructed arrighi (not calligraphic)\n\n"
    },
    {
      "time": "11 Feb 2004 — 1:47pm",
      "content": "Edward, I think \"fusing\" the triple-u as a basis for animation is a really great idea.   \n   \nRandy, I think the pixellated Arrighi is worth a shot.   \n   \n\\> You come right out and say what you think   \n   \nOnly among friends and/or in the world of type - because my living doesn't depend on it.   \n   \nIn multimedia (the money end of my life) I'm just as \"diplomatic\" as the next guy...   \nWell, maybe a little less. :-)   \n   \nhhp\n\n"
    },
    {
      "time": "5 Mar 2004 — 10:41pm",
      "content": "Where is this project now? Any new samples?\n\n"
    }
  ]
}
