{
  "id": "28458",
  "title": "Comments On Camingo Typeface - Attack of the Square Sans",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I was checking the new releases on myfonts yesterday and found [Camingo](http://web.archive.org/web/20150414220944/http:/www.myfonts.com/fonts/jan-fromm/camingo/). Any thoughts on this? Has anyone used it? I bought ITC Tabula a while back and have been disappointed (I should have bought Section from Village). But this has a similar geometric structure that I am drawn to, but is more subtle. Considering this was designed by a student of Lucas de Groot I am a bit more confident that it will be a well-made typeface. Just wondering what your thoughts are.\n\n",
  "author": "Chris Keegan",
  "time": "27 Sep 2006 — 8:27am",
  "uid": "1115",
  "comments": [
    {
      "time": "27 Sep 2006 — 8:36am",
      "content": "Gawd it looks just like every other squarish sans out there right now.\n\nI own Klavika which suffices for my square sans needs.\n\nHowever, it looks like a fairly complete family.\n\n"
    },
    {
      "time": "27 Sep 2006 — 9:36am",
      "content": "This is much more subtle than Klavika (which I like too), which is one of the reasons I think I like it so much. I think I may get more mileage out of Camingo. Has anyone used it yet? For kicks here is a comparison of some recent square sans designs (off the top of my head)...\n\n ![](http://web.archive.org/web/20150414220944im_/http:/typophile.com/files/square-sans_5277.jpg)\n\n"
    },
    {
      "time": "27 Sep 2006 — 10:23am",
      "content": "Don't forget Apex Sans, Neo Sans.\n\nI hate that 'a' in Vista, ruins the font for me. Why does Emigre always do that?\n\n"
    },
    {
      "time": "27 Sep 2006 — 10:26am",
      "content": "Gee you forgot Zwo, Unit, Meta, Info, Fago, Zine, and Cachet.\n\n"
    },
    {
      "time": "27 Sep 2006 — 10:26am",
      "content": "Good ones Patty. I have Neo. There are a lot of Emigre faces that have a single character that I can't stand. Ruins it for me as well.\n\n"
    },
    {
      "time": "27 Sep 2006 — 10:54am",
      "content": "I agree that Unit, Fago and Zine are similar. Cachet isn't feasible for me, since it has only 3 weights, no italics, etc. Which reminds me of Zemestro - another one. Are there any thoughts in regards to the craftsmanship of this typeface?\n\n"
    },
    {
      "time": "27 Sep 2006 — 11:39am",
      "content": "If nothing else, this thread will serve as a good reference the next time someone needs a square sans ID'd.\n\n"
    },
    {
      "time": "27 Sep 2006 — 7:38pm",
      "content": "\\> I hate that ‘a’ in Vista, ruins the font for me. Why does Emigre always do that?\n\nto create something that doesn't look absolutely like everything else?\n\n"
    },
    {
      "time": "27 Sep 2006 — 9:27pm",
      "content": "Camingo has a lot of nasty little attention getters that bug me. For example:  \n- There's too much flourish in the descender of f. I love f with a pretty descender–I make my handwritten f descenders so crazy that my notes are often illegible. But it doesn't fit with the rest of the letters.  \n- The A is gross–the internal and external apexes are too close–it's annoying. It's worse on the bold weights, where it looks like a little white triangle fighting for freedom.  \n- Why are the outer vertical strokes of the M diagonals? It's like the M from Lithos snuck in when nobody was watching.\n\nI could stay up all night nitpicking at the letterforms in this one. I'll just keep using Unit instead.\n\n"
    },
    {
      "time": "28 Sep 2006 — 5:36am",
      "content": "I really like Foundry Form.\n\n[http://www.foundrytypes.co.uk/foundry\\_form\\_sans/formSansMedium.html](http://web.archive.org/web/20150414220944/http:/www.foundrytypes.co.uk/foundry_form_sans/formSansMedium.html \"http://www.foundrytypes.co.uk/foundry\\_form\\_sans/formSansMedium.html\")\n\nI wish Freda would improve her website, it desperately needs better type samples, and perhaps a test drive thing.\n\n"
    },
    {
      "time": "28 Sep 2006 — 7:46am",
      "content": "JPAD, thanks for your comments, I'll look at those items more closely. I hate licensing a typeface without examining it closely first, those things jump out at you later. Miles, I love Foundry Form too. It would be nice if they had a more user-friendly site. Their type is so nice, the site should be equally well-done.\n\n"
    },
    {
      "time": "28 Sep 2006 — 8:37am",
      "content": "Then there's Argo and Vesta by Gerard Unger....\n\n"
    },
    {
      "time": "24 Oct 2007 — 1:26pm",
      "content": "_Why does Emigre always do that?_\n\nEmigre didn't do it. [Xavier Dupré](http://web.archive.org/web/20150414220944/http:/www.typophile.com/wiki/Xavier%20Dupr%C3%A9) did. Maybe you're thinking of Tarzana, which has a similar ostentatious tail on the 'a', but Vista is a much more usable typeface in the same vein.\n\n"
    },
    {
      "time": "24 Oct 2007 — 4:23pm",
      "content": "Wouldn't [Stainless](http://web.archive.org/web/20150414220944/http:/www.fontbureau.com/fonts/Stainless) belong in this category?\n\n"
    },
    {
      "time": "29 Jul 2008 — 10:04am",
      "content": "Hah.\n\nI was just about to suggest Stainless.\n\nMiss Tiffany beat me to it... by about 9 months :)\n\n"
    },
    {
      "time": "3 Feb 2010 — 3:05pm",
      "content": "Any updates we can add to this now? What about Soho Gothic? [http://www.monotype.co.uk/sg/](http://web.archive.org/web/20150414220944/http:/www.monotype.co.uk/sg/ \"http://www.monotype.co.uk/sg/\")\n\n"
    },
    {
      "time": "3 Feb 2010 — 11:48pm",
      "content": "Allumi PTF, Etelka, Morgan Sans, Ubik, and of course PF Square Sans...\n\n"
    },
    {
      "time": "4 Feb 2010 — 12:24am",
      "content": "I created a list of [square sans fonts](http://web.archive.org/web/20150414220944/http:/www.fontshop.com/fontlist/genres/square_sans_serif/) at FontShop based on my own notes and suggestions from this thread.\n\n"
    },
    {
      "time": "4 Feb 2010 — 12:47am",
      "content": "Yay! Thanks.\n\n"
    },
    {
      "time": "4 Feb 2010 — 8:15am",
      "content": "The genre of sophisticated square sans faces, where squareness is integrated into a conventional sans effect by subtle drawing, has come on strong since I investigated square types in a magazine article, [Hip 2B Square](http://web.archive.org/web/20150414220944/http:/www.shinntype.com/Writing/Hip2BSqr.pdf), 10 years ago\n\nDave Farey's Cachet was one of the first of this new breed, IIRC, and may even have been released when I wrote the article, but I didn't anticipate the way things would develop enough to mention it. In fact according to Dave, squareness wasn't the main theme of Cachet.\n\nA lot of ideas that were raw ten or 15 years ago have been cooked up nicely.\n\n"
    },
    {
      "time": "4 Feb 2010 — 9:49am",
      "content": "Yyyup, it almost always takes a while...\n\nhhp\n\n"
    },
    {
      "time": "4 Feb 2010 — 3:18pm",
      "content": "Cachet is still one of my favorites in the bunch. Way ahead of its time. I keep crying to Dave for italics.\n\n"
    },
    {
      "time": "8 Feb 2010 — 2:18am",
      "content": "I had never heard of Cachet - very nice. I love square sans :-)\n\n"
    },
    {
      "time": "8 Feb 2010 — 5:17am",
      "content": "You can see also \"Chaco\" at  \n [http://www.tipo.net.ar/chaco/index.html](http://web.archive.org/web/20150414220944/http:/www.tipo.net.ar/chaco/index.html \"http://www.tipo.net.ar/chaco/index.html\")\n\nEduardo Tunni\n\n"
    },
    {
      "time": "11 Mar 2010 — 6:27am",
      "content": "Hermes ! :)\n\n"
    },
    {
      "time": "17 Aug 2011 — 6:58am",
      "content": "Great thread! And thank you Stephen for the FontShop list, very helpfull. Any suggestions on new 2010/2011 square sans fonts?\n\n"
    }
  ]
}
