{
  "id": "28457",
  "title": "Malmö Sans—What Do You Think of It?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Just wanted to know what everyone thinks of this font. I personally love it, but haven't used it in anything. Any comment?\n\n-tsongtze\n\n",
  "author": "<a href=\"/web/20120124015903/http://typophile.com/user/5290\" title=\"View user profile.\">tsongtze</a>",
  "time": "<br>",
  "uid": "5290",
  "comments": [
    {
      "time": "",
      "content": "Which font? – I can't see anything.\n\nNick Cooke\n\n"
    },
    {
      "time": "",
      "content": "Here's the font...\n\n ![](http://web.archive.org/web/20120124015903im_/http:/typophile.com/files/elbogen_real_4369.gif)\n\n"
    },
    {
      "time": "",
      "content": "Our local Target used it in the food section at one point. It's since been replaced with Avenir. The forms are a little quirky (the straight quotes bother me a little), but I've enjoyed using it on a couple of projects.\n\n"
    },
    {
      "time": "",
      "content": "I have always liked this face, and have almost purchased it a few times. But there is, as Addison pointed out, some quirkiness to it. It seems a little inconsistent between weights, so I have not used it. I think I like that black, headline weight the best.\n\n"
    },
    {
      "time": "",
      "content": "I'm contemplating if I could use the regular/medium weight for a magazine logotype. However, I know that the magazine Nordic Reach uses this typeface already... I love the ligatures... Do you know any other typeface that has the nice arch for ligatures?\n\n"
    },
    {
      "time": "",
      "content": "Hello guys, what do you feel is quirky about Malmö Sans?\n\nSince we (fountain) are slowly starting to update the library to OT and fixing up the fonts, it would be good to get any suggestions and pointers. Addison mentioned the straight quotes, so I'll write that down.\n\nAs a sidenote (even tough I'm more than a bit bias) – I love working wth Malmö Sans on design jobs. Especially the Small Caps.\n\n"
    },
    {
      "time": "",
      "content": "One of the things I dislike is the difference in stroke width (modulation?) in the bold weight versus the regular weight. The regular weight has very little. And the bold weight seems to have too much. It almost doesn't look like the same typeface to me. I love the headline weight, and the unicase characters. I love the character of the typeface though. It has a very friendly feel, while still being very constructed. PS: Peter, I hope when the site is updated you'll be releasing \"South\" that is one nice looking typeface.\n\n"
    },
    {
      "time": "",
      "content": "Peter, I note that the dieresis dots have the same weight and height as the i dot.  \nIs this some kind of Malmö cooperative movement thing :-) ?\n\n"
    },
    {
      "time": "",
      "content": "Hey Peter, if I buy the font next week, will I get a chance to get the upgraded version and the OT?\n\nIt's really great reading your responses. As a designer, I should really look at type as closely as you guys do. I'm learning!\n\n"
    },
    {
      "time": "",
      "content": "\\>Do you know any other typeface that has the nice arch for ligatures?\n\nMaybe not the same arch, but quite graceful.\n\n[http://www.typography.net/info/fonts/Aspect2R\\_Sample.pdf](http://web.archive.org/web/20120124015903/http:/www.typography.net/info/fonts/Aspect2R_Sample.pdf \"http://www.typography.net/info/fonts/Aspect2R\\_Sample.pdf\")\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Chris wrote:  \n<cite>One of the things I dislike is the difference in stroke width (modulation?) in the bold weight versus the regular weight. The regular weight has very little. And the bold weight seems to have too much. It almost doesn’t look like the same typeface to me.</cite>\n\nThat's one of the things I love about it. The serif approach to a bold cut. Almost a humanist sans, but still containing a very geometric base.\n\nNick wrote:  \n<cite>Peter, I note that the dieresis dots have the same weight and height as the i dot.<br>\nIs this some kind of Malmö cooperative movement thing :-) ? </cite>\n\n<cite>Peter, I hope when the site is updated you’ll be releasing “South” that is one nice looking typeface.</cite>\n\nNot the next release, which I hope to be within the next weeks, but i hope to have it fixed and ready befor ethe end of this year. Running a foundry on your own promoting other designers typefaces as well unfortunately leaves less and less time for your own designs.\n\nYou're correct – it is the the same. I propably wouldn't have done it that way (I'm too boring), but I try not to interfere too much with the designers ideas and designs. One thing I like about Martin and his approach to type is that is so unbiased – he draws as he see's it, without any presumtions of how type \"should be done\" but still with a lot of love. I think that is what makes them (his typefaces) stand out. It's the same feeling I get from looking at a typeface from the Nebiolo foundry. It's different but somehow it fits.\n\ntsongtze wrote:  \n<cite>Hey Peter, if I buy the font next week, will I get a chance to get the upgraded version and the OT?</cite>  \nYes..well almost! Everyone who's bought their licenses from Fountain the last 2 years will be able to upgrade for a very small price. Hopefully most fonts will be OT within a few months, but I really can't say when.\n\nHere's a design were I used Malmö Sans:  \n [http://www.bruhnfamily.com/portfolio/ma\\_folder\\_ap.asp](http://web.archive.org/)\n\n"
    }
  ]
}
