{
  "id": "28454",
  "title": "1850-1900 serif remake / caps only",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "I've been working on this... I don't really do this kind of typographic work usually so I am a bit lost... Would someone point me to some really obvious mistakes that I might have made? It is not supposed to be a complete copy rather than a slight remake... The bottom serifs on the Vs are totally weird.. the M is also a problem... I also don't understand what is happening with the bottom serif on the L wich appears to be pointing backwards - it might be some kind of kerning... I am not sure...  \nI will be very gratefull for any comments...\n\n ![](http://web.archive.org/web/20150417102705im_/http:/typophile.com/files/RudolfinumInWork_5984.jpg)\n\n",
  "author": "cicifoo",
  "time": "27 Sep 2006 — 3:59am",
  "uid": "11421",
  "comments": [
    {
      "time": "27 Sep 2006 — 6:17am",
      "content": "I'm thinking the V has serifs on either side of the bottom, not just on the right side. Also, the serifs in the original may be less pronounced than in your re-creation. It looks like you've exaggerated things a little bit. Looks good, though.\n\n"
    },
    {
      "time": "27 Sep 2006 — 8:00am",
      "content": "I think you're approaching this a bit too conventionally. The \"twisted\" serif on the \"L\" is a nice Art Nouveau element (and the bar of the \"F\" actually has it too). The old-school bottom of the \"V\" and the Elzevir \"M\" are also things I would keep.\n\nThen there's the spacing...\n\nhhp\n\n"
    },
    {
      "time": "27 Sep 2006 — 8:05am",
      "content": "The bent-in spike on the L was probably to help space the L tighter, and put less of a hole in the middle of the word. Adding to Brad's suggestions: some of your serifs are less bracked than in the original. These should be consistent, as in the original, for a nice look.\n\n"
    },
    {
      "time": "27 Sep 2006 — 9:55am",
      "content": "R has serifs on both sides of the tail. D, O and R curves look in the photo like \"superellipse\" or gradual curves, not straights with round corners. R is too round, D and O are too straight.\n\nI agree; there are some fun, irregular things about this carving. Observe them and decide which to keep and repeat, especially if you plan to finish the alphabet. Some features might change (F middle bar too short). I agree with Hrant that it should not be made more conventional or regular.\n\n"
    },
    {
      "time": "25 Nov 2006 — 7:30am",
      "content": "Cicifoo, where is this original image from? just curious.\n\n"
    }
  ]
}
