{
  "id": "28477",
  "title": "architect logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "hi guys!\n\nI'm currently in the process of designing a logo for a local architect who's got about 20 years of experience but finally decided to start his own bureau.\n\nHis area of activity reaches from building small hospitals to large casinos and it's currently a one-man business but he's NOT aiming to become a 50 people agency anyway..\n\nHe wanted his logo to be mainly typography which should be clean, corporate looking and shouldn't be embarrassing. The only shape or form I'm allowed to use is a square due to his vision of a square being the ultimate form, undistorted and straightforward.\n\nthe concept I came up with can be seen here\n\n ![](http://web.archive.org/web/20140724040228im_/http:/typophile.com/files/stefan_4698.jpg)\n\nSTEFAN is placed in capitals to distuingish itself from \"architect\" and to make clear that the architect is called stefan...  \nthe squares between the text are pretty small so that the don't stand out too much and they're seperated into 3 pieces to give the impression of something being built..  \nthey also form an arrow pointing upwards to intensify the impression of something going on..\n\nwhat do you think so far?\n\nany c&c appreciated  \ncheers mike\n\n",
  "author": "mikeb7",
  "time": "28 Sep 2006 — 4:05am",
  "uid": "4397",
  "comments": [
    {
      "time": "30 Sep 2006 — 2:44am",
      "content": "There is something about the relationship between the two words – Stefan is not quite short enough to match the x-height of architekt (I should say this image size makes it difficult to be sure). I would also say the FA of Stefan and the hi of architekt need to be kerned slightly tighter. The squares don't sit comfortably with the type, perhaps if the top of the bottom square was flush with the x-height/cap height and moved slightly to the left. Again this is affected by screen/image size but the lowercase seems to have quite a rambling baseline, where the rounded characters overshoot and the dot of the i seems too prominent.  \nWhen reversed out is it your intention to use that rectangular shape or is that just an example?  \nTim\n\n"
    },
    {
      "time": "14 Oct 2006 — 12:06pm",
      "content": "hi guys..  \nafter going through a couple of concepts with the clients (the one above has been dumped) this is what seems to be the final concept\n\nany c&c?\n\ncheers mike\n\n ![](http://web.archive.org/web/20140724040228im_/http:/typophile.com/files/stefan1_5325.jpg)\n\n"
    },
    {
      "time": "14 Oct 2006 — 12:17pm",
      "content": "It looks pleasant, but the vertical stroke of the T needs to be aligned with the square, not the terminal. I'd also like to see the text aligned with the outer edge of the stroke as opposed being inside the square. Having it inside the square creates a good tension between the letter and the gap, but penetration would be more dynamic.\n\n"
    },
    {
      "time": "14 Oct 2006 — 1:07pm",
      "content": "Yellow frame = National Geographic.\n\nI'd think about changing the colour of the frame. Also, maybe align the left edge of the stems of the 'T' and 'N' to the left edge of the frame border, rather than the right edge of the stems to the left edge of the frame border (I hope that makes sense).\n\n- Lex\n\n"
    },
    {
      "time": "18 Oct 2006 — 4:49pm",
      "content": "My first reaction upon seeing this second design was also immediately: National Geographic.\n\n"
    },
    {
      "time": "23 Oct 2006 — 3:26am",
      "content": "hi guys! The problem is that it's nearly impossible to convince the client of a different colour.. he is so satisfied with the yellow (which actually comes from concept number 1) because no political party in austria has got yellow as \"their\" colour.. ans since he's worried about being pushed into a political direction with choosing a different colour.. yellow is theonly option for him.  \nPersonally I don't think that the yellow frame is such a huge problem because National Geographic is barely known in Austria..\n\ncheers mike\n\n"
    },
    {
      "time": "23 Oct 2006 — 5:43am",
      "content": "_National Geographic is barely known in Austria_\n\nWell then, your problem seems to be solved. If the client is happy, that's what really counts! :-)\n\n"
    },
    {
      "time": "24 Oct 2006 — 4:57am",
      "content": "I really like this, I saw this as a flatplan of a room, not the National Geographic at first glance. I also like the colourways, the brightness of the yellow is offset by the charcoal greys and works well. It looks contemporary and quite sophisticated and I think it suits the subject matter really well.\n\nDon't worry about the National Geographic, sure they employ a yellow frame, but it's rectangular not square; they're also in a completely different area of business.\n\nNice work!\n\n"
    },
    {
      "time": "27 Oct 2006 — 1:42pm",
      "content": "I didn't associate this logo with National Geographic at first ...what I saw was a big letter C. I like the idea that it looks like the floorplan to a simple square room, but I don't think people will see that right away. Maybe if a door was added to the opening?\n\n"
    },
    {
      "time": "2 Nov 2006 — 7:17pm",
      "content": "The rectangular yellow border positively screams National Geographic. Particularly alongside a typeface in a shade similar to some of that logo's variations.\n\namd\n\n"
    },
    {
      "time": "2 Nov 2006 — 9:42pm",
      "content": "When you think about it, it's pretty scary  \nthat architects design the buildings we use.\n\nhhp\n\n"
    },
    {
      "time": "3 Nov 2006 — 1:51am",
      "content": "_\\> because National Geographic is barely known in Austria_\n\nWell, I DO think 'National Geographic' is known in Austria, as well. _(And, I also instantly thought 'National Geographic' when seeing your 2nd logo proposal.)_\n\n_\\> because no political party in austria has got yellow as “their” colour_\n\nWell, There actually IS a political party in Austria related to 'Yellow': 'Liberales Forum (LIF)' / 'Liberale'.\n\nDav\n\n"
    },
    {
      "time": "3 Nov 2006 — 5:21am",
      "content": "Hang on... the thing is, when a logo is posted on this forum, you're crucially seeing it _out of context_. The very fact that the word architect is part of the logo should mark it out as an architect's practice to the vast majority of people. I don't think if you saw a business card with the logo on you would think that it had some kind of bizarre architect/National Geographic affiliation. Sorry, can't see it myself.\n\n\"When you think about it, it’s pretty scary that architects design the buildings we use.\" Wow. That's really deep, Hrant! I think I'd be more scared if architects _hadn't_ designed the buildings we use.\n\n"
    },
    {
      "time": "3 Nov 2006 — 6:33am",
      "content": "It's just that it would be useful for them to realize things like there's not a square to be seen anywhere on the creatures who inhabit buildings, and that political parties change color, literally and figuratively, all the time. You could even say that they're <cite>all</cite> yellow.\n\nhhp\n\n"
    }
  ]
}
