{
  "id": "28479",
  "title": "New BBC 1 ident",
  "forum": "Design",
  "tags": [

  ],
  "content": "[http://www.fontsmith.com/custom.php?id=772](http://web.archive.org/web/20101227152900/http:/www.fontsmith.com/custom.php?id=772 \"http://www.fontsmith.com/custom.php?id=772\")\n\n ![](http://web.archive.org/web/20101227152900im_/http:/typophile.com/files/pic179-o_4867.jpg)\n\nTim\n\n",
  "author": "<a href=\"/web/20101227152900/http://typophile.com/user/2289\" title=\"View user profile.\">timd</a>",
  "time": "<br>",
  "uid": "2289",
  "comments": [
    {
      "time": "",
      "content": "Interesting. I particularly like that litle quasicrypto-serif bit at the base of the T and the 1, and the right leg of the n.\n\nOddly enough, the last time I was cruising BBCWorld's website (earlier this week), I filled out their user survey, where one of the questions was soliciting my opinion on their logo. Do you know if the Beeb is doing a wholesale makeover, Tim?\n\nL.\n\n"
    },
    {
      "time": "",
      "content": "As far as I understand from the fontsmith announcement this is only for BBC 1, I'll watch some telly tonight to see if it affects the other BBC channels. I suppose the real test is how it performs on tv screens.  \nWhat did you think of the logo?  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Hi Tim,\n\nI worked on the re-brand typeface with Jason Smith here at Fontsmith.  \nThe new BBC One channel identity will be launched on the morning of Saturday 7th October. The typeface was designed exclusively for the channel in collaboration with Red Bee Media.\n\nHere’s a link to some of the new idents - [http://www.youtube.com/watch?v=ofTBnuXpa-8](http://web.archive.org/web/20101227152900/http:/www.youtube.com/watch?v=ofTBnuXpa-8 \"http://www.youtube.com/watch?v=ofTBnuXpa-8\")\n\nPhil\n\n"
    },
    {
      "time": "",
      "content": "Thanks Phil, I'll look forward to it, youtube doesn't really do it justice. Was there a non-aesthetic reason for the slight out-turns on the verticals?  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Tim: Yes, I do, in fact, I like pretty much all the grafix on BBCWorld (except for the nasty little newscrawl!), but without a monster plasma screen, I'm not sure I would notice much of a difference, at least consciously. ;-)\n\n(The BBC Canada logo certainly hasn't changed either.)\n\nPhil: Thanks for the link. Do you know (or can you tell us?) if the redesign will be extended across all their channels?\n\nLinda\n\n"
    },
    {
      "time": "",
      "content": "Somehow, the massive x-height doesn't fit my notion of BBC 1. Strongly suggestive of the 1970s, and hence too retro for Aunty. Please explain.\n\n"
    },
    {
      "time": "",
      "content": "\\> Strongly suggestive of the 1970s\n\nWell, the previous font Gill Sans was strongly sugestive of the fifties, so this represents a giant 20 year leap forward.\n\n"
    },
    {
      "time": "",
      "content": "Good point Si, and I would agree up to a point, but Gill Sans has been a permanent fixture in the UK since the 1930s, so it's more like suggestive of the 20th century establishment, which would seem to be an obvious choice for such an institution as BBC1 (if not for Saab...)\n\nI just wondered, since we have Phil who was involved in the re-branding, in this thread, what the discussion around the positioning of the face was, with regards to the 70s x-height thing.\n\n"
    },
    {
      "time": "",
      "content": "all i knw, based on an assignment i did on gill sans was kind of ironic that Mr Gill had something to do with the BBC building in (date i forgot now) and all these yrs later, they decided to use his font.\n\n"
    },
    {
      "time": "",
      "content": "Not really. Everybody still uses Gill all the time in the UK. It is the UK's corporate typeface.\n\nNick Cooke\n\n"
    },
    {
      "time": "",
      "content": "Hi Phil, didn't you design Clerkenwell? Very nice!\n\nGood bit of business - limiting the new font to BBC 1, ...now for 2, 3 and 4.\n\nNick Cooke\n\n"
    },
    {
      "time": "",
      "content": "\\>Mr Gill had something to do with the BBC building\n\nAriel and Prospero amongst others, Broadcasting House was opened in 1932.\n\n_\"Maidens are said to blush and youths to pass disparaging remarks regarding the statues of Prospero and Ariel\" (Daily Herald, 1933)_\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "I take it you're going to be watching tomorrow for the launch, Tim? Those of us in the colonies on this side of the pond will be waiting anxiously for your report. ;-)\n\nLinda\n\n"
    },
    {
      "time": "",
      "content": "That's a great typeface-I see it as an ultra-legible sans, similar to Myriad but a friendlier and a little less quirky.\n\nAnd it goes really well with the hippos. Thanks for sharing this with us colonials–otherwise we might not have seen it till it popped up in a Comm Arts annual or something similar.\n\n"
    },
    {
      "time": "",
      "content": "My first reaction was a bit shocked (to see new BBC ident) and very positive. Though you see the ident logo for a short period of time its has a strong presence and communicates a fresh and solid feeling. After seeing the first time - I knew I liked it and was looking forward to seeing again. I could tell it was from Fontsmith as has an attitude resemblance to the 'friendly media' itv typeface.\n\n'one' is GREAT\n\nI like the optical 'o' shape, I like the reference to Johnston's Underground 'e' (a bit like Gill sans) and I like how the 'n' has a subtle relationship witht he 'e'.\n\nNICE\n\n"
    },
    {
      "time": "",
      "content": "Agree that the relationship between n and e does make sense of the slight outturn on the n vertical, I felt that the font in text use, and admittedly I didn't see that much of it, seemed to have a tight fit. The circular imagery is still rolling out, I suspect that some will be more popular than others, for example circling hippos and wall of death riders seem better conceived and realised and more potential longevity than the football and moon/ships.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "\"Circling hippos\"? I can hardly wait until the rebrand comes to BBCWorld! ;-)\n\nLinda\n\n"
    },
    {
      "time": "",
      "content": "\\>It is the UK’s corporate typeface.\n\nLet's not forget Sweden! Gill is the face of Saab too.\n\n\\>I can hardly wait until the rebrand comes to BBCWorld! ;-)\n\nBBC America too! It will be a good distraction between endless re-runs of Cash in the Attic and diet pill ads!\n\n"
    },
    {
      "time": "",
      "content": ":-) I actually rather like the telly ads for BBCCanada, so I hope they don't change too much.\n\n(You mean you're not watching the new series of \"How Not to Decorate\" Si?)\n\nLinda\n\n"
    },
    {
      "time": "",
      "content": "Ads on the BBC, what is the world coming to?  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Yes, I know.\n\nEspecially in the middle of \"Top Gear\" reruns.... :-(\n\nWhat's really quite odd is that if one gets surveyed when surfing the BBCWorld website, it regularly contains a list of the current adverts that are supposedly running on it, none of which I've seen here. India has a bunch of them right now that we do get, and they're all acceptable, except for the English chap who talks about having surgery to his knee and it costing so little in India that he and the wife are on holiday at the same time. Talk about an indictment of the NHS....\n\nLinda\n\n"
    },
    {
      "time": "",
      "content": "Well, the ads are sometime better than the shows...\n\n\"Oh no, the collection of 19th century thimbles failed to meet our estimate, leaving only the dog eared collection of Beano comics and granny’s chamber pot left to meet our target. It doesn't look like the Smiths are going to get their dream greenhouse after all.\"\n\n"
    },
    {
      "time": "",
      "content": "[http://www.bbc.co.uk/radio4/excessbaggage/index\\_20060624.shtml](http://web.archive.org/web/20101227152900/http:/www.bbc.co.uk/radio4/excessbaggage/index_20060624.shtml \"http://www.bbc.co.uk/radio4/excessbaggage/index\\_20060624.shtml\")\n\n[http://news.bbc.co.uk/1/hi/world/south\\_asia/3149454.stm](http://web.archive.org/web/20101227152900/http:/news.bbc.co.uk/1/hi/world/south_asia/3149454.stm \"http://news.bbc.co.uk/1/hi/world/south\\_asia/3149454.stm\")\n\nMedical tourism is quite a big thing among the chattering classes. The effect of ads on the BBC is that when you get an hour long programme we get 50 minutes, or, like the latest David Attenborough series, we get ten minutes of \"how we did it\" footage tacked on the end.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Si, that'd be the programmes presented by people with the peculiar colouration that only exists among TV presenters:) Not the highest point in broadcasting history, but a good time for suppliers of orange dye.\n\n"
    },
    {
      "time": "",
      "content": "Sadly the true colour requires a PAL transmission, it's just not the same on NTSC\n\n"
    },
    {
      "time": "",
      "content": "[http://www.cbc.ca/canada/story/2006/07/06/china-falungong.html](http://web.archive.org/web/20101227152900/http:/www.cbc.ca/canada/story/2006/07/06/china-falungong.html \"http://www.cbc.ca/canada/story/2006/07/06/china-falungong.html\") doesn't make me want to go to China anytime soon....\n\n"
    },
    {
      "time": "",
      "content": "One side effect of the new typeface is the reduction of instances of Helvetica 25 on the telly, Orange Telecom seem to have gone with 55 now, others will follow.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Some of the new ident is now showing up on BBC World -- they've changed their bug to the new face, and, from the look of it, the supers and the \"Live\" tag as well.\n\n"
    }
  ]
}
