{
  "id": "28488",
  "title": "Kerning crime",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Surely this is only a hastily prepared facsimile of Bob Woodward's new book cover (gif from Barnes & Noble). If the actual cover is this bad....\n\n ![](http://web.archive.org/web/20140713221901im_/http:/typophile.com/files/11850855_5096.gif)\n\n",
  "author": "londontype",
  "time": "29 Sep 2006 — 11:56am",
  "uid": "11256",
  "comments": [
    {
      "time": "29 Sep 2006 — 12:18pm",
      "content": "Nothing wrong here and if there is it is just an extraordinary rendition\\*  \nTim  \n(\\*I am recycling this joke from another thread)\n\n"
    },
    {
      "time": "29 Sep 2006 — 12:37pm",
      "content": "Even if it were to be spaced properly, this is a pretty dull book jacket! I guess when you have a sure sell item, you don't need to hire a designer--just have your clerk type it out in Word (with kerning turned by default off of course)\n\nChrisL\n\n"
    },
    {
      "time": "29 Sep 2006 — 12:45pm",
      "content": "It does look like Word spacing. Another recyled joke -\n\n ![](http://web.archive.org/web/20140713221901im_/http:/typophile.com/files/stop_6722.jpg)\n\n"
    },
    {
      "time": "29 Sep 2006 — 12:56pm",
      "content": "[http://typophile.com/node/5310](http://web.archive.org/web/20140713221901/http:/typophile.com/node/5310 \"http://typophile.com/node/5310\")\n\nhhp\n\n"
    },
    {
      "time": "29 Sep 2006 — 4:28pm",
      "content": "This isn't a type crime–it's just par for course in Washington. This town is full of ugly dust jackets that would make a designer weep, because the publishers know that these books only sell to policy wonks and political junkies who really couldn't care less about the jackets anyway. Bob Woodward certainly deserves better, but for yet another political book in the endless stream that the current political climate engenders, it's really not all that bad.\n\n"
    },
    {
      "time": "29 Sep 2006 — 6:47pm",
      "content": "I believe it's bad by any standard. Kerning is to typography what grammar is to writing. A certain minimal standard in non-negotiable. Again, this may not be the real cover - may be a hastily done gif.\n\n"
    },
    {
      "time": "29 Sep 2006 — 7:08pm",
      "content": "Given its content, however, it will sell like hotcakes.\n\nI can just hear potential clients now: \"I want my job to look like Bob Woodward's latest book jacket!\"\n\naaarrrrgggghhhhhh....................\n\n(mateys!) ;-)\n\n"
    },
    {
      "time": "29 Sep 2006 — 7:11pm",
      "content": "James,  \nThere is a far broader market than our DC beltway Blackberry addicts for that kind of book and the publisher knows it is not a point-of-purchase sale issue. It will sell purely on title and author. The publisher probably thinks this might be the next \"All the Presidents Men\" best seller. Therefore, no need to throw money away on a cover design worthy of print. It is just a cheap way out and they don't care about the small number of type-savvy readers who probably would never buy it anyway.\n\nChrisL\n\n"
    },
    {
      "time": "29 Sep 2006 — 7:17pm",
      "content": "\"That kind of book\"? Except for typography books (not even graphic  \ndesign books, actually) all books are in the situation you describe.\n\nhhp\n\n"
    },
    {
      "time": "29 Sep 2006 — 7:23pm",
      "content": "Linda,  \nBut you won't be able to match that chic whacked kerning thing they did and next time they'll take the job to Walmart for design instead of back to you :-)\n\nChrisL\n\n"
    },
    {
      "time": "29 Sep 2006 — 8:15pm",
      "content": "Schlock in schlock out. To me the galling thing is that people who ought to know better, look the other way, this is not just in books, but in a lot of printed material. The fact that more people buy and use type than any other time does not mean any more are doing it better than earlier periods. To me there will always be a highend market that will use type amazingly well, but then there is now a separation where there used to be a middle ground of designers who used type well enough, if not a little dull. It used to be easy, they looked at the galley of type and then they either politely called or screamed for changes to their liking. When the responsibilty changed to them doing the grunt work, well the common thinking seems to be \"good enough from my house.\" This is where we are at and why book covers like this look like, well, schlock.\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "29 Sep 2006 — 8:23pm",
      "content": "Sorry, but Washingtonians have to mock our little bubble now and then. It's the self-inflicted price we pay for living in a city where we get home delivery of the Economist on Friday mornings instead of having to wait for it to come in the mail.\n\n"
    },
    {
      "time": "29 Sep 2006 — 8:33pm",
      "content": "So James, come down to the Mall tomorrow and read a book under a tent courtesy of the LOC and Laura :-)  \nSure Hope the book covers are better than this one!\n\nChrisL\n\n"
    },
    {
      "time": "30 Sep 2006 — 8:20am",
      "content": "Speaking of book covers, this is a great book and I love it, and I don’t even feel worthy writing this really.\n\nBut… I can’t seem to stop irritating myself over the very tight space between T and y in Type ;-)\n\nIs bothering you too? Maybe just a matter of taste.\n\n ![](http://web.archive.org/web/20140713221901im_/http:/typophile.com/files/Lettersofcredit_4380.jpg)\n\n"
    },
    {
      "time": "30 Sep 2006 — 9:18am",
      "content": "It bothers me too, So does the loose space between E and T in LETTERS and the T and R in TRACY.\n\nChrisL\n\n"
    },
    {
      "time": "30 Sep 2006 — 1:37pm",
      "content": "Chris: Put enough alcohol into me and I could not only do book design that poorly but forget how to punctuate too. :-P\n\nRodrigue: You make a good point, and one that I'm sure many of us have raised with our clients (and in some cases, former clients!).\n\nFor example, our local transit authority has an on-going campaign about what is kewl on the system (i.e., don't crowd doorways, use earphones for your iPod, etc.) -- one of the posters deals with \"Appropriate Behavior.\" However, they have used the word \"behaviour\" three times in it -- once spelled with the \"u\", the other two without.\n\nNow given that the City standard is British spelling (we are in Canada, after all), and the illustration has \"City Center\" in it (and the signage on the train platforms is \"City Centre\"), one has to wonder who designed this project and who approved it up the line.\n\nI emailed them a note about this just before Christmas last year, and while I notice there are a few new ones up with proper (and consistent) spellings, you still see a lot of the \"wrong\" ones around.\n\nEvery time I see one, I want to have a \"Billy Jack\" moment.....\n\nLinda\n\n"
    },
    {
      "time": "30 Sep 2006 — 9:17pm",
      "content": "Londontype\n\nWhat kerning crime? You'd have to kern to commit the aforesaid crime. The Woodward cover titling is just tracked out. The Tracy titling is the same. Maybe tracking crime would be more appropriate.\n\nGerald\n\n"
    },
    {
      "time": "1 Oct 2006 — 11:25am",
      "content": "Saturday Night Live did a bit on the Woodward book last night and the thumbnail they showed had \"DENIAL\" corrected, or at least cleaned up. Couldn't make out the details all that well, but it was definitely in better shape than the graphic posted with this thread.\n\n"
    },
    {
      "time": "1 Oct 2006 — 12:35pm",
      "content": "We now have the book sitting on the coffee table, and the final design does indeed have the heinous kerning. It's also done on paper that many companies wouldn't even consider using for a trade paperback.\n\n"
    },
    {
      "time": "1 Oct 2006 — 1:46pm",
      "content": "\"We'll track down the evildoer and send him to Kernersville, North Carolina for interrogation\" - GWB\n\n"
    },
    {
      "time": "1 Oct 2006 — 1:50pm",
      "content": "Perhaps the evildoer is in \"Denial\" as well?\n\nChrisL\n\n"
    },
    {
      "time": "1 Oct 2006 — 2:10pm",
      "content": "Yeah, put some electrodes on their finials and trust their head serifs underwater!\n\nhhp\n\n"
    }
  ]
}
