{
  "id": "2849",
  "title": "Bahn",
  "forum": "Blackletter / Uncial",
  "tags": [
    "Blackletter / Uncial"
  ],
  "content": "Here's a blackletter font I recently started. It's purely geometric with mostly straight lines except for a few quirky letters. Let me know what you think.\n\n<!--attachment: bahnshowing-24951.pdf*mime_pdf.gif*application/pdf*13.1*bahn%2epdf*bahnshowing%2epdf --><!--attachment: bahnshowing-24951.pdf*mime_pdf.gif*application/pdf*13.1*bahn%2epdf*bahnshowing%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150420021803im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">bahn.pdf<br><a href=\"http://web.archive.org/web/20150420021803/http:/www.typophile.com/forums/messages/29/bahnshowing-24951.pdf\" target=\"_blank\"><b>bahnshowing.pdf</b></a> (13.1 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "matt_desmond",
  "time": "26 Jan 2004 — 4:19pm",
  "uid": "2919",
  "comments": [
    {
      "time": "26 Jan 2004 — 4:27pm",
      "content": "Killer textura.   \nOnly the \"t\" and the \"z\" seem unhappy.   \n   \nhhp\n\n"
    },
    {
      "time": "26 Jan 2004 — 4:30pm",
      "content": "Thanks, yes there are still things to work out, like the z etc. I think it should turn out quite nice though.   \n   \nSorry about the crappy pdf, I could not get the font to embed in there for some odd reason.   \n   \nMatt\n\n"
    },
    {
      "time": "26 Jan 2004 — 6:03pm",
      "content": "I suppose a moderator could move this to the blackletter forum. D'oh.\n\n"
    },
    {
      "time": "26 Jan 2004 — 7:26pm",
      "content": "wow I got it to work...   \n   \n ![](http://web.archive.org/web/20150420021803im_/http:/www.typophile.com/forums/messages/29/24967.gif)\n\n"
    },
    {
      "time": "26 Jan 2004 — 8:07pm",
      "content": "Matt, the thing that really sets this face apart for me is the curved top stroke of the 'a'. I'd like to see this closed semi-circular stroke used throughout the characters that warrant it - such as the 'g', 'j', 'y' and the new 'z'. If you leave the curved stroke open in these characters, then the 'a' should be treated similarly.   \n   \nAnd I really didn't mind the original 'z'. Keep it as an alternate.\n\n"
    },
    {
      "time": "26 Jan 2004 — 9:26pm",
      "content": "This is nice. Maybe the \"d\" ascender can be curved too. I\n\n"
    },
    {
      "time": "27 Jan 2004 — 9:07am",
      "content": "Grant: Thanks for the comments. I did make a version of the \"a\" with an open loop, I guess I need to make a decision and stick with either open or closed loops. Maybe I could make alternates for all letters that have them. I wish I could afford Fontlab so I could do an opentype version. Someday.   \n   \nAs for the upper case, I'm trying to decide whether to go traditional with the characters or do something new. The only thing I don't like about traditional blackletter uppercase is that while the forms are beautiful, they're not very legible/readable.\n\n"
    },
    {
      "time": "27 Jan 2004 — 9:30am",
      "content": "Hector: I tried out a version of the \"d\" with the ascender curved and while I like the look, I think I would have to make many of the other letters curved also for it to work right with the rest of the font. I sense an alternate (curved) version coming...\n\n"
    },
    {
      "time": "27 Jan 2004 — 9:34am",
      "content": "Caps: something new, definitely.   \n   \nhhp\n\n"
    },
    {
      "time": "27 Jan 2004 — 4:53pm",
      "content": "Upper case coming soon. I came up with a way better name. The font is now called Brauhaus, I don't believe it's taken.\n\n"
    },
    {
      "time": "27 Jan 2004 — 8:07pm",
      "content": "Did some tweaking of the lowercase before starting the uppers. A few characters were too roman influenced, like the m and n and p. I tightened them up a bit and fixed a few other chars. What do you think?   \n   \n ![](http://web.archive.org/web/20150420021803im_/http:/www.typophile.com/forums/messages/29/25066.gif)\n\n"
    },
    {
      "time": "28 Jan 2004 — 2:12pm",
      "content": "Thanks Tiffany.   \n   \nI've made a first pass at the uppercase and the alternate characters, and also updated the \"k\" as it was bugging me. Any comments?   \n   \n ![](http://web.archive.org/web/20150420021803im_/http:/www.typophile.com/forums/messages/29/25123.gif)\n\n"
    },
    {
      "time": "28 Jan 2004 — 7:47pm",
      "content": "This set of caps is nice, but isn\n\n"
    },
    {
      "time": "28 Jan 2004 — 7:59pm",
      "content": "I was trying to do something that wasn't roman or traditional. I guess it may be a bit more towards roman, but I think it works ok. I'll do some more researching and drawing to see if I can come up with something better.\n\n"
    },
    {
      "time": "29 Jan 2004 — 4:41am",
      "content": "Nice work, Matt.   \nThe new lowercase is better, and the 'p' is great.   \nThe uppercase: it is a good start, but notice that it looks too light. The 'J' is clearly too wide.   \nI also think you could try using less geometric forms for the caps.\n\n"
    },
    {
      "time": "29 Jan 2004 — 9:35am",
      "content": "some more textura designs, I think I'm going to stick with this style caps. The typeface that is closest in design to mine is Benton's [American text](http://web.archive.org/web/20150420021803/http:/www.myfonts.com/fonts/bitstream/american-text/), and while his caps are more ornate, they are of similar structure to mine. I think if this was a more humanist textura, the traditional caps would be more appropriate. I'm going to thicken the uppers up a bit and work on the other weights/alternates. Thanks for the inputs for the input\n\n"
    },
    {
      "time": "29 Jan 2004 — 9:57am",
      "content": "Try uncial.   \n   \nhhp\n\n"
    },
    {
      "time": "29 Jan 2004 — 8:06pm",
      "content": "\\>\\>I wish I could afford Fontlab so I could do an opentype version. Someday.   \nif no one else offers, i'll attempt to convert this for ya, if ya like...\n\n"
    },
    {
      "time": "30 Jan 2004 — 1:20pm",
      "content": "Thanks for the offer. I'll let you know if/when it gets nearer completion.\n\n"
    },
    {
      "time": "30 Jan 2004 — 3:20pm",
      "content": "yer welcome. just lemme know...\n\n"
    },
    {
      "time": "31 Jan 2004 — 8:03am",
      "content": "Hi Matt, thanks for pointing me here.   \n   \n\\>I was trying to do something that wasn't roman or traditional.   \n   \nI don't see a reason for which you should worry about doing a thing \"too this\" or \"too that\". What makes a rivisitation of an historical form interesting is what you add/subtract/modify, more than what you \"preserve\" or \"redo\", in my opinion.   \n   \nFor this reason, I find the original z less traditional and thus more appropriate to be used as the main z (with some adjustment, maybe). The new d, g, p and y are great.   \n   \nBe careful with the alternate f: it can be easily mistaken for a long s.   \n   \nI would definitely try stranger forms, anyway (like the alternate D).\n\n"
    },
    {
      "time": "19 Feb 2004 — 2:39pm",
      "content": "About The Typeface: Bahn   \nNicely done on the capitals and with alternate characters which make a unique typeface for singage or greeting card around Christmas time.   \n   \nDo you know when this typeface will be available at Myfonts.com?   \n   \n Yours truly,   \n Robert\n\n"
    },
    {
      "time": "27 Feb 2004 — 2:37pm",
      "content": "One more thing I forgot to mention about the capitals of Bahn is the some of the characteristics remind of the same style used on a sign on a laundrymat back in the late 1960's and into the early 1970's before it closed,   \nespecially the caps A, C, L, M, N, O, P, R, T, U, W,   \nand X, and the alternate cap H.   \n   \nWhat if the cap A had a second alternate with a diamond crossbar like the alternate cap H?   \n   \n Yours Truly,   \n Robert\n\n"
    },
    {
      "time": "6 Mar 2004 — 7:03am",
      "content": "Robert,   \nI'd love to see the signage you're talking about, are there images of it on the web anywhere?   \n   \nIt will be available on MyFonts before the end of the year, hopefully.\n\n"
    },
    {
      "time": "6 Mar 2004 — 1:14pm",
      "content": "The signage in which I remember from the laundry has long been painted over or the building has been remodeled and made into a church and probably has several layers of material over the lettering that I remember.   \n   \nWhen the laundry closed some time in the early 1970's, it what converted in to a church, along with the changing of the style of lettering.   \n  \nI doubt that there are any images available on the web\n\n"
    },
    {
      "time": "8 Mar 2004 — 12:01pm",
      "content": "Here's the latest update for Brauhaus. I've removed the extra serifs on the lowercase (a, i, j, r, m, n, etc.) to simplify the forms. I've refined quite a few letters and started on the numbers (they need help, especially the 2). Any comments?\n\n"
    },
    {
      "time": "8 Mar 2004 — 12:05pm",
      "content": "Attachment:\n\n<!--attachment: show_3_08_04-28156.pdf*mime_pdf.gif*application/pdf*120.5*Brauhaus*show_3_08_04%2epdf --><!--attachment: show_3_08_04-28156.pdf*mime_pdf.gif*application/pdf*120.5*Brauhaus*show_3_08_04%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20150420021803im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">Brauhaus<br><a href=\"http://web.archive.org/web/20150420021803/http:/www.typophile.com/forums/messages/29/show_3_08_04-28156.pdf\" target=\"_blank\"><b>show_3_08_04.pdf</b></a> (120.5 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "10 Mar 2004 — 1:52pm",
      "content": "Hi, Matt. Why don't you fashion the 2 and 3 numerals like the lowercase c (in the top part, I mean)?   \nI think they would appear stronger. You may find hints for the 4 in lowercase b and d, maybe.   \nThe 5, 6 and 9 are very fresh.\n\n"
    },
    {
      "time": "10 Mar 2004 — 4:30pm",
      "content": "Claudio,   \n   \nThe reason I haven't used a shape like the top of the lowercase c is that I am trying to keep the strokes true to how they would have been if hand lettered. This makes the solutions for some of the letters and numbers difficult, but I think it's the best way to go.   \n   \nI made a couple of exceptions to that rule with the g and y so maybe I can cheat on the 2 and 3 too.\n\n"
    },
    {
      "time": "12 Mar 2004 — 9:04am",
      "content": "Here's where I'm at today (went a little nuts on the characterset yesterday). I think the normal weight is getting very close to being done. I'm thinking about doing an antiqued (dirty) version as well as a really swashy version where all of the letters have circles like on the a and g. Any more comments?   \n   \n  ![](http://web.archive.org/web/20150420021803im_/http:/www.typophile.com/forums/messages/29/28409.gif)\n\n"
    },
    {
      "time": "12 Mar 2004 — 8:57pm",
      "content": "i think it's looking great. so are there going to be other weights???\n\n"
    },
    {
      "time": "13 Mar 2004 — 7:21am",
      "content": "There will be at least a bold and probably bold alternate as well as this one and alternate. I did a quick version of the bold and it looks really cool.   \n   \nI just had a thought, what if I do a light version? That could be interesting.\n\n"
    },
    {
      "time": "23 Mar 2004 — 12:00pm",
      "content": "Just letting everyone know that I released Brauhaus today via MADType/Myfonts.com.   \n   \nYou can have a look at [http://www.madtype.net](http://web.archive.org/web/20150420021803/http:/www.madtype.net/) or [http://www.myfonts.com/fonts/madtype/brauhaus/](http://web.archive.org/web/20150420021803/http:/www.myfonts.com/fonts/madtype/brauhaus/)   \n   \nThanks for everyone's help with this one!   \n   \nMatt\n\n"
    },
    {
      "time": "23 Mar 2004 — 6:30pm",
      "content": "Congratulations.\n\n"
    },
    {
      "time": "1 Apr 2004 — 2:24pm",
      "content": "That's an excellent idea, a lighter weight version of Brauhaus does see interesting.   \n   \n Yours truly,   \n Robert\n\n"
    },
    {
      "time": "13 Dec 2004 — 2:34pm",
      "content": "Wow - I wish I discovered this forum earlier. This looks almost exactly like a concept I started working on a few months ago. Great execution (that's how I fixed my z problem too).   \n   \nI guess great minds think alike ![:-)](http://web.archive.org/web/20150420021803im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n - Lex\n\n"
    },
    {
      "time": "28 Jan 2004 — 8:34am",
      "content": "Hehe. Consider it moved.   \n   \n\\*\\*\\*   \n   \nVery nice forms. I'm glad you closed the g, y and z ... the p looks a little uptight now, but i guess if you are using only certain shapes this is a better alternative. The d is nice as well, although it seems a little exaggerated.   \n   \nnice name. ![:-)](http://web.archive.org/web/20150420021803im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    }
  ]
}
