{
  "id": "28496",
  "title": "Books on CSS?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Does anybody know of any comprehensive reference books to learn the ins and outs of [CSS](http://web.archive.org/web/20080829175005/http:/typophile.com/wiki/CSS)? I think i can do fairly well with the basics, but i’d like to get a more in-depth working knowledge of CSS. Any comments would be helpful. thnx.\n\n [‹ Going to NYC](http://web.archive.org/web/20080829175005/http:/typophile.com/node/28529 \"Go to previous forum topic\") [What happened at Type Con 2006? ›](http://web.archive.org/web/20080829175005/http:/typophile.com/node/27990 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080829175005/http://typophile.com/user/7006\" title=\"View user profile.\">paul d hunt</a>",
  "time": "<br>",
  "uid": "7006",
  "comments": [
    {
      "time": " 30.Sep.2006 11.44am",
      "content": "Beginning CSS Web Development: From Novice to Professional — Simon Collison\n\nmore?\n\n"
    },
    {
      "time": " 30.Sep.2006 12.04pm",
      "content": "If it’s a comprehensive CSS reference book you’re after, Eric Meyer writes [The Definitive Guide](http://web.archive.org/web/20080829175005/http:/meyerweb.com/eric/books/css-tdg/).\n\n"
    },
    {
      "time": " 30.Sep.2006 12.17pm",
      "content": "Håkon Wium Lie’s thesis, [http://people.opera.com/howcome/2006/phd](http://web.archive.org/web/20080829175005/http:/people.opera.com/howcome/2006/phd \"http://people.opera.com/howcome/2006/phd\")\n\n"
    },
    {
      "time": " 30.Sep.2006 12.20pm",
      "content": "sure, give me more.\n\n"
    },
    {
      "time": " 30.Sep.2006 12.34pm",
      "content": "W3C, [http://www.w3.org/TR/REC-CSS2](http://web.archive.org/web/20080829175005/http:/www.w3.org/TR/REC-CSS2 \"http://www.w3.org/TR/REC-CSS2\")\n\n"
    },
    {
      "time": " 30.Sep.2006 1.30pm",
      "content": "great links, alessandro, but i’m looking for books. i want something i can curl up with in bed.\n\n"
    },
    {
      "time": " 30.Sep.2006 1.39pm",
      "content": "You definitely want Meyer’s book: worth every penny.\n\nL.\n\n"
    },
    {
      "time": " 30.Sep.2006 1.42pm",
      "content": "[Stylin’ with CSS](http://web.archive.org/web/20080829175005/http:/www.amazon.com/Stylin-CSS-Designers-Charles-Wyke-Smith/dp/0321305256/sr=8-1/qid=1159648875/ref=pd_bbs_1/002-2155342-9606448?ie=UTF8&s=books) is very good, in spite of the silly title.\n\n"
    },
    {
      "time": " 30.Sep.2006 2.04pm",
      "content": "Two books I recommend to anyone wanting to learn best practices CSS are [by Dan Cederholm](http://web.archive.org/web/20080829175005/http:/www.simplebits.com/publications/). I wouldn’t exaclty call them comprehensive, but good references nonetheless...\n\nAlso be sure to bookmark [www.positioniseverything.net](http://web.archive.org/web/20080829175005/http:/www.positioniseverything.net/ \"www.positioniseverything.net\").\n\n"
    },
    {
      "time": " 30.Sep.2006 3.27pm",
      "content": "“The Zen of CSS Design” is a must-read if you want to learn to use CSS. Shea and Holzshcag are about as good as it gets when it comes to CSS, and since most browsers still haven’t finished CSS 2 support (and IE never will) the book hasn’t gone out of date.\n\nThe best comprehensive CSS reference that I’ve found is O’Reilly’s “Web Design in Nutshell, 3rd Edition.” It covers just about every bit of the HTML/XHTML/CSS standards, explaining how they work and how to integrate them. It’s not the kind of book you read cover-to-cover and learn from, but when you need to know something in a hurry, there just is no better option. Combine this one with the “Zen” book and you’re set.\n\n"
    },
    {
      "time": " 30.Sep.2006 10.03pm",
      "content": "If you buy just one book, I’d recommend CSS Mastery: Advanced Web Standards Solutions by Andy Budd. It has a couple introductory chapters, then has several devoted to specific topics, such as styling menus and doing multi-column layout. (This makes it a useful reference, albeit not necessarily comprehensive.) Then the last two chapters are case studies by Cameron Moll and Simon Collison that put many of the best techniques into practice.  \n [http://www.cssmastery.com/](http://web.archive.org/web/20080829175005/http:/www.cssmastery.com/ \"http://www.cssmastery.com/\")\n\nI also recommend Eric Meyer (EM on CSS, More EM on CSS, and Definitive Guide) and Jeffrey Zeldman (Designing with Web Standards; make sure you get the new 2nd edition). The EM on CSS books are mostly tutorials. Zeldman is like CSS mastery but more introductory and, in my opinion, has too much web standards advocacy and not enough in-depth design.\n\n"
    },
    {
      "time": " 1.Oct.2006 1.51am",
      "content": "The different W3C CSS Specifications – as it could be –  \nand  \na lot of bookmarks and testing – for the limitation of the user agents css-support and how to go with it.\n\nDon’t forget semantic (x)html\n\nbooks? really?\n\n"
    },
    {
      "time": " 1.Oct.2006 7.00am",
      "content": "[http://www.mezzoblue.com/zengarden/alldesigns](http://web.archive.org/web/20080829175005/http:/www.mezzoblue.com/zengarden/alldesigns \"http://www.mezzoblue.com/zengarden/alldesigns\")\n\n"
    },
    {
      "time": " 1.Oct.2006 11.33am",
      "content": "Once you read the book (I second Eric Meyer), another idea is to print out the markup and CSS of a site you like and see how it works in practice.\n\nI did that with the blogs of Doug Bowman ( [www.stopdesign.com](http://web.archive.org/web/20080829175005/http:/www.stopdesign.com/ \"www.stopdesign.com\")) and Khoi Vinh ( [www.subtraction.com](http://web.archive.org/web/20080829175005/http:/www.subtraction.com/ \"www.subtraction.com\")). Guess I had good taste, as they are now the design leaders at Google and the New York Times.\n\n"
    },
    {
      "time": " 2.Oct.2006 6.26am",
      "content": "I recommend [Professional CSS](http://web.archive.org/web/20080829175005/http:/www.wrox.com/WileyCDA/WroxTitle/productCd-0764588338.html). It’s written in such a way that geeks and novices can understand, and there are plenty of examples online that it references. (Some have moved, such as the 2005 PGA Tour site, but you can still find them.) There’s a sense of humor throughout.\n\nLet me add this: if you’re new to CSS, it should be a fairly easy concept to understand if you’re already familiar with the idea of using style sheets in page layout software such as QuarkXPress or InDesign. (Now I wish the page layout programs handled things other than just type in their style sheets! Why can’t style sheets also affect images and placement?)\n\nI also recommend [A List Apart](http://web.archive.org/web/20080829175005/http:/www.alistapart.com/) as an excellent resource for anything CSS or interactive. It’s also been a source of ideas for print as well, in terms of approaches to problem-solving.\n\n"
    },
    {
      "time": " 2.Oct.2006 6.31am",
      "content": "InDesign lets you set some limited style sheets for images (space around, boxes, that sort of thing) in CS2.\n\nLinda\n\n"
    }
  ]
}
