{
  "id": "285",
  "title": "New font database - Search by keyword or concept?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "For my thesis i intend to create a typeface library on the web in which users can search for fonts (free, commercial, not really sure yet) by entering a keyword or creative concept (as well and name, style, designer etc).   \nI guess it would function like the stock photography sites (imagebank, photonica).   \n   \nI believe this is a more effective and more relevant way to search for fonts and would remove the need to scroll through screed of alphabetised pages. This process would also be accompanied with a new waay to browse through the search results - this is omething i am currently working on.   \n   \nI'm just gonna put my idea out there.   \nWhat do guys think?   \nDo you reckon a tool like this is needed for the type community?   \nAny feedback would be great!\n\n",
  "author": "<a href=\"/web/20110510141742/http://typophile.com/user/1903\" title=\"View user profile.\">chowmein</a>",
  "time": "<br>",
  "uid": "1903",
  "comments": [
    {
      "time": "",
      "content": "Some font houses have systems like this on-line, like MyFonts, Linotype FontExplorer, and I think Identifont, and probably others too.   \n   \nSome people like them, others (usually those more expertise with fonts) think they're a waste. I personally think \"organic\" identification is an interesting field, with still unrealized potential.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "[AllMusic](http://web.archive.org/web/20110510141742/http:/www.allmusic.com/)'s Artist Browser is interesting model that might be relevant. Find a band you like, and scroll down and take a look.   \n   \nI can imagine something similar with fonts could be pretty valuable. Kind of like MyFonts' \"More like this\" but with a little more direction.\n\n"
    },
    {
      "time": "",
      "content": "I took a look a Myfonts word database. it sort of has the seeds of what i think i want to create but the keyword list appears quite limited at this stage.   \n   \ni was considering the idea of having a live database and polling system in which people can place their opinion or even add their own words/meaning to a particular typeface. Sort of like an miniature ongoing forum for each font.\n\n"
    },
    {
      "time": "",
      "content": "\\> \"organic\" identification?   \n   \nSomething where \"Feminine\" is a category (or at least a factor), for example.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "I think Stephen Coles is/was working on something like this.   \n   \nHrant, as for what I can understand from your idea of \"organic id\", isn't it a very subtle difference between \"organic id\" and the \"keyword id\" we see today?\n\n"
    },
    {
      "time": "",
      "content": "With the difference that keywords are a fixed, user-defined thing, while \"organic\" is open to interpretation - kind of like everything else humans do! :-)   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "_\\>while \"organic\" is open to interpretation_   \n   \nWhose/what interpretation?\n\n"
    },
    {
      "time": "",
      "content": "I think there's a basic problem. As soon as you start categorising fonts by \"creative concept\", you are in effect stereotyping the use of the font. Anyone who used such a system as a way of selecting fonts would be stuck with cliches, because the system would be (in effect) a giant cliche reproduction machine ... which is not what anyone needs.   \n   \nYou can go only so far with reasonably \"objective\" categories (serif, sans serif, text, display etc). They end up being too large to be really useful. As soon as you start trying to sub-divide them into specific \"styles\" or \"uses\", you enter the realm of subjective judgement. Nothing wrong with that. But a system that tries to allow you to make choices like that by relying on the crutch of how others use or see type is not really going to produce \"creativity\", but bland uniformity.   \n   \nIt's tempting to think this would work because it works in some other areas (like choosing books or restaurants or whatever). There is some value in those fields to being guided by what other people think. But they are about consumption not production. Once \"creativity\" becomes the replication of what is generally accepted it is going to be stale.\n\n"
    },
    {
      "time": "",
      "content": "\\> which is not what anyone needs.   \n   \nAre you sure?   \nNot to imply that _any_ system can be perfect.   \n   \nhhp\n\n"
    },
    {
      "time": "",
      "content": "Some people like cliches. What one has to look at is the use for the engine. If I need to identify a typeface, then cliches are _good_ in that they can help me identify a particular font.   \n   \nBut what about for a new font selection. The world of type is immensely large, just like music - it is unlikely that someone will listen to every album on earth in the hope of finding new music to listen to.   \n   \nTo beat that similie into a bit more shape, look at Amazon. If I have a look for a Crass CD on amazon, I'll also get peer recommendations for other bands - some of these will be close in style, some will be close in politics, some will be close merely in that the people who like that band may be more _inclined_ to like other completely unrelated bands, but of a similar _statue_.   \n   \nBack to a font example - if I did a search for a 30s typeface, in with all that chaff of art deco nonsense, I might come across Gill Sans. Further exploration could tell em that other people who liked this also liked Perpetua (which is a 30s font, but does not necessarily look like the cliche of one, at least, not to Joe Bloggs). Suddenly, because of the use of human beings in all this, I have a few items presented to me that may be fitting, but do not extend the cliche.   \n   \nJust a thought.\n\n"
    },
    {
      "time": "",
      "content": "Have anyone noticed the keywords assigned to [Luc de Groot's](http://web.archive.org/web/20110510141742/http:/www.myfonts.com/fonts/fontfabrik/theserif/) typefaces at MyFonts? It seems like someone is joking there.\n\n"
    },
    {
      "time": "",
      "content": "i said before that the database would be live. This it seems is they key to the sustainability of a tool like this.   \n   \nI've imagined it as a place where users can have an opinion of the results that come up. Possibly a polling system could be set up for each defntion in realtion to the typeface   \nit would allow for and also generate discussion.   \n   \nsuggested fonts or 'font also used' would also make a for a functional feature.\n\n"
    },
    {
      "time": "",
      "content": "I agree - Many sites already have functionality like this online.\n\n"
    },
    {
      "time": "",
      "content": "Hrant, what is \"organic\" identification?   \n   \nAnd while I'm thinking of it, do you know any good articles/books/works on typeface classification history and schemes?   \n   \nThanks.\n\n"
    }
  ]
}
