{
  "id": "28500",
  "title": "{ Reethi Rah 0.1 } - Please give me your expert opinion",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hi guys,\n\nThis is a font that I have been working on on and off in the last year and I will call it \"Reethi Rah\". I named it after the One&Only Resort island Reethi Rah, where my wife and I spent our honeymoon. This place is sheer paradise and I started sketching on this font from the first day.  \nI think this has big potential and I want to go all the way with this font. It's the first serif font I've made and I did it very intuitive. The font should be optically and emotionally balanced. You'll find the details where I fiddled with forms and proportions.\n\nI'd like your expert opinion on this first draft. I think this font will polarise some of you people out there. The serifs are kinda extreme and will not be everyones darling. In small these serifs work very well and give the font a pleasant warmth and softness to it. In large the serifs come out in full strength and show their freaky nature. It's a love or hate thing...\n\nI optimized the proportions for setting long reading texts in (art)books, articles, etc. The font has no correct spacing and kerning yet. I will do this when I leave the beta stage.\n\nWhat do you think about it? What do you like and what not? But most important is that you give me some expert feedback on the proportions, legibility and charisma of the font.\n\nThanx in advance,  \n®ené\n\n| Attachment | Size |\n| --- | --- |\n| [RV©ReethiRah1.pdf](http://web.archive.org/web/20150123141728/http:/typophile.com/files/RV%C2%A9ReethiRah1.pdf) | 217.37 KB |\n| [RV©ReethiRah2.pdf](http://web.archive.org/web/20150123141728/http:/typophile.com/files/RV%C2%A9ReethiRah2.pdf) | 148.11 KB |\n| [RV©ReethiRah3.pdf](http://web.archive.org/web/20150123141728/http:/typophile.com/files/RV%C2%A9ReethiRah3.pdf) | 147.71 KB |\n\n",
  "author": "Rene Verkaart",
  "time": "30 Sep 2006 — 4:07pm",
  "uid": "1946",
  "comments": [
    {
      "time": "30 Sep 2006 — 4:48pm",
      "content": "Hi René, cool, to me: the centre of the 'w' and 'W' looks heavy; 's' and 'S' need some delicate touches to flow; the bottom serif of 'y' is too blocky; the bottom left part of the 'M' stem has a bump, same for the 'q'; '2' looks lighter.\n\n"
    },
    {
      "time": "30 Sep 2006 — 5:13pm",
      "content": "This is quite amazing - it's clear you were inspired by your circumstances.  \nIn fact I'm envious... I mean of the font. :-)\n\nThis is what PoMo was supposed to mature into. Serious mannerism. Very nice the way the serifs do indeed seem to have a dual personality, as you claim. And some of your stroke weight distribution (like in the \"w\") and termination (like in the \"c\"/\"e\") is genial.\n\nI'll try to find the time to do a full critique (I haven't succeeded in doing that lately) but for the time being I'd like to point out the following:  \n1) Vertical proportions: good. Somewhat generous x-height.  \n2) Nice and darkish.  \n3) 1 & 2 combine to make this ideal for ~9 point text... assuming you get the spacing right: on the loose side.  \n4) Trapping: great idea (especially considering your color and -presumed- target size) but don't actually put it in until the end.  \n5) The bottom-left link of the \"g\" is too much.  \n6) Some lc letters could be less timid: \"f\" (narrow), \"r\" (why castrated?), \"t\" (blah) and \"x\" (narrow).  \n7) Numerals: \"7\" is a bit too curvy; \"8\" is out of character. And why not hybrid nums? They work best overall (even though your x-height is big enough to make traditional OS nums OK).  \n8) UC: \"G\" not working; \"K\" high waist out of character; \"N\" not working; \"Q\" lousy - give it a TAIL dude - what is this, Minion?!; \"T\" top too symmetrical.\n\n\\> I want to go all the way with this font.\n\n\\> It’s a love or hate thing…\n\nSounds like a honeymoon font for sure. :-) BTW, definitely use \"optically and emotionally balanced\" in your promotional text.\n\nOh, and if you don't finish this, I'm coming after you.  \nMaldives, Upper Waziristan, doesn't matter - I'll hunt you down.\n\nhhp\n\n"
    },
    {
      "time": "30 Sep 2006 — 6:47pm",
      "content": "Great face. Ton of character.\n\nKudos!\n\nHildebrant\n\n"
    },
    {
      "time": "1 Oct 2006 — 12:58am",
      "content": "Thanx for your critique Hrant. I see your most criticism goes out to the UC characters. To me, if I'd characterize them, they have a touch of Jugendstil in them. The curved legs of the A, M, N, might date it in the early 1910's, right? Perhaps this is wat bothers you in an otherwise quite unconventional font?  \nI can totally follow you with your critique, but I guess it is that I'd hate to kill my darlings. I kinda like the 7 and 8 because they totally fit to the atmosphere and decorational elements on the island. But I see that in the font they're kinda out of place.  \nWould you give the Q a really long tail, and make it dive under the neighbour character?\n\nThe best thing of this font though is that it makes me think of my holiday... ;-)\n\nI'll get back to you later on this. I'm very busy lately so progress is slow.\n\nTHANX,  \n®\n\n"
    },
    {
      "time": "1 Oct 2006 — 5:49am",
      "content": "hey....  \nfirst post on this forum\n\ndont know very much about fonts & typography (kerning, x-height, trapping and what not heheh)  \nexcept i know what i like and dislike....  \nand this one i really like, it got a memorable quality to it...atleast i think so\n\n//chuckan\n\n"
    },
    {
      "time": "1 Oct 2006 — 6:23am",
      "content": "Hi Christian,\n\nWelcome to Typophile! And thanks for your compliment. You'll be an insider soon enough if you involve yourself in this forum.\n\n®\n\n"
    },
    {
      "time": "1 Oct 2006 — 1:47pm",
      "content": "Hi Rene,\n\nThis is a great font, definetely a lot of character!\n\nIt looks like the way the characters are 'drawn' is by nib based pen mainly. Bearing this in mind, some of the characters feel a bit off. For instance the legs of the K and R, don't have that characteristic 'nib' ending as is present in the other letters / nums.\n\nI played around with your R and gave it a nib-ending.\n\nI think this may be a slightly better fit, the same can be done on the K, and maybe on the J / j as well.\n\nAlso the lower beak of the S / s, seem to have a brush type ending, which is not apparent in the other characters. Here a nib ending may provide a better fit as well.\n\nI agree with hrant on the 8, the 'crossing' in the center feels a bit blocky, which is a bit out of tune with the rest.\n\nMy comments are based on the reflection of the 'writing tool' in the final shape of the letters (nib pen, brush etc.). This may be a too rigid of a viewpoint, but as I am learning type design myself, this forms a good reference.\n\nBtw, great specimen, I like the text as well (I am Dutch as well...).\n\nSebastian\n\n ![](http://web.archive.org/web/20150123141728im_/http:/typophile.com/files/R_5521.jpg)\n\n"
    },
    {
      "time": "1 Oct 2006 — 6:09pm",
      "content": "\\> The curved legs of the A, M, N, might date it in the  \n\\> early 1910’s, right? Perhaps this is wat bothers you  \n\\> in an otherwise quite unconventional font?\n\nI love the \"A\" and \"M\". The \"N\" just seems off in terms of structural proportion. BTW, check out these old sketches of mine, for Paphos:\n\n ![](http://web.archive.org/web/20150123141728im_/http:/typophile.com/files/uca_4192.gif)\n  \n\n ![](http://web.archive.org/web/20150123141728im_/http:/typophile.com/files/ucm_5813.gif)\n\nYou should see the lc \"g\". :-\\>  \nI showed it to GMM at ATypI-Leipzig and literally his jaw dropped.\n\n\\> I’d hate to kill my darlings.\n\nBut, like gardening, text face design is as much about death as it is about life.  \nNotan isn't only graphically relevant.\n\n\\> they totally fit to the atmosphere and decorational elements on the island.\n\nBut you left the island, and your font is still alive. :-)\n\nTail of the \"Q\": Dunno, I'm imagining something like Baskerville or Electra.\n\n\\> It looks like the way the characters are ‘drawn’ is by nib based pen mainly.\n\nIs that true? (I hope not.)\n\nBut that \"R\" suggestion isn't bad at all.\n\nhhp\n\n"
    },
    {
      "time": "1 Oct 2006 — 7:50pm",
      "content": "hrant,\n\nIts probably not a nib pen per se. I was referring to the origin of the contrast.\n\nWhat about the tail of the Q, similar to the legs proposed above? It can be made nice and swashy I think...\n\nSebastian\n\n"
    },
    {
      "time": "2 Oct 2006 — 1:32am",
      "content": "I did some changes to a few characters (see ReethiRah2.pdf above). One step at a time.\n\nI totally agree with the N and the new one looks also much better. Together with this N I also changed the M, because it felt a bit out of tune. I'm not sure if I should keep the old or new M, what do you think?\n\nThe new 't' fits like a glove to the rest of the font, so that's a done deal. I'm still fiddling with the 'f'. I made one with a small serif in the upper curve, and one without. I don't know which one is better. To me the one with the serifs feels better, but I like the other one too. On page 6 of the pdf you can see the difference.\n\nSebastian, I like the leg of the R. My only consideration would be if it's not to edgy for the font? All serifs are soft and curved and this leg is sharp and edgy. But I definitely will give it a spin.\n\nFor your information, I drew this font with a regular pencil. No nibbed pen or any other tool. Like I said it's a very intuitive font, so it's even more important to get the consistancy in the details right.\n\nHrant, I'll kill all my darlings if it works for the font, but don't ask me to kill my memory of the honeymoon. ;-)\n\n®\n\n"
    },
    {
      "time": "2 Oct 2006 — 8:25am",
      "content": "Rene,\n\nThe new letters indeed look better. For the leg of the R and K, I think it may need some massaging of the serif I proposed to make it a bit less blocky.\n\nRegarding the nib-pen confusion, I didn't mean that you drew your design with it. I merely was observing the fact that your design had contrast to it (O, R etc.) which I linked to a writing tool. Like Venetian / Garalde faces such as Bembo, Kuenstler, Garamond etc. have an origin in nib pens.\n\nSebastian\n\n"
    },
    {
      "time": "2 Oct 2006 — 9:06am",
      "content": "Old \"M\" for sure. And the new \"N\" is pulled back a little bit too much I think. The new \"t\" is nice, but if you can make it exhibit more stroke contrast (without making it too wide - the narrowness of the \"t\" is one of its major defining attributes) that would be good. For the \"f\", the rightmost one is the safest, but you only need it if the middle one is too distracting in text[ure], which I don't think it is (thanks to all the other funkiness). Your texture, btw, I forgot to mention before, is what's most encouraging about this (which is of course what a text font is all about).\n\nBTW, this just hit me: are you a fan of Fleischmann? For one thing this would make a great display companion to a Fleischmann for body for anybody who's too afraid of using it for text.\n\nKilling memories: the fact that that's not possible is part of what makes them so much better than things like photographs and videos (with the former being especially fake to me).\n\nhhp\n\n"
    },
    {
      "time": "3 Oct 2006 — 5:40am",
      "content": "Another update. This time I did the 'Q, N, 7', and some other small things you propably won't see.  \nI think the 'Q' is a mega improvement, so a big THANKS goes out to Hrant for seeing that.\n\nI kept the 'N' as close to the original as possible, but optimized the diagonal. Is this enough or should it be even more 'classical'? I think it should harmonize with the M, that's why I kept the bent diagonal.  \nI tried taking the lower right serif out, but that suddenly reminded me of captain Hooks wooden leg. Very strange, so I descided to keep it in and just made it smaller for optical proportion.\n\nI've changed the 'r' before, but I just wanted to point it out. It's also much better, so my thumbs up again for Hrant. This looks very sweet it the text, and I think it should not have more hanging at his nose.\n\nWhat do you think about the serif on the '5'? Inside or outside? I see them normally more outside, but I spontaniously put mine inside. I feel it's alright there, but what do you think?\n\nI'm not so sure about the '7', because I can't seem to get the contrast right. I will have a closer look at it later. Option 3 is the old version. Option 2 is also not bad, but for now I'd go for option 1.\n\nOn to the next level...\n\n®\n\n"
    },
    {
      "time": "3 Oct 2006 — 8:14am",
      "content": "{Until next week...}\n\nIt seems you forgot the updated PDF in your memories... :-)\n\n\\> suddenly reminded me of captain Hooks wooden leg.\n\nWell, you <cite>did</cite> say island!\n\nhhp\n\n"
    }
  ]
}
