{
  "id": "28502",
  "title": "Kerning help/suggestions...",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "How does the kerning in this look to y'all?  \nAny suggestions would be greatly appreciated!\n\nKyle\n\n(Revised PDF attached)\n\n| Attachment | Size |\n| --- | --- |\n| [Molly\\_Trademark\\_PMS.pdf](http://web.archive.org/web/20131011014230/http:/typophile.com/files/Molly_Trademark_PMS.pdf) | 10.71 KB |\n| [Molly\\_Trademark\\_PMS\\_v2.pdf](http://web.archive.org/web/20131011014230/http:/typophile.com/files/Molly_Trademark_PMS_v2.pdf) | 10.71 KB |\n| [Molly\\_Trademark\\_PMS\\_v3.pdf](http://web.archive.org/web/20131011014230/http:/typophile.com/files/Molly_Trademark_PMS_v3.pdf) | 10.71 KB |\n\n",
  "author": "Hildebrant",
  "time": "30 Sep 2006 — 6:39pm",
  "uid": "1286",
  "comments": [
    {
      "time": "30 Sep 2006 — 9:24pm",
      "content": "I think you obviously need to kern in the M closer to the o and the o closer to the l. Or conversely kern out the l further from the l and the l further from the y. All the letterforms should visually have the same amount of white space between them. The colored counter will alter that a bit but not by much.\n\nGerald\n\n"
    },
    {
      "time": "1 Oct 2006 — 12:39am",
      "content": "Why the 'tm' is so small and on the bottom ?  \nBefore adjusting the white space as Gerald Lange said, I think you could try to reduce a tad the larger diameter of the 'o' keeping the same stroke thickness (I am thinking this because of the use of the orange).\n\n"
    },
    {
      "time": "1 Oct 2006 — 12:55am",
      "content": "I forgot to say to keep the baseline for the 'o'. Ah, another point, why do you present it for critique in such an abundant space ?\n\n"
    },
    {
      "time": "1 Oct 2006 — 10:41am",
      "content": "The l and the y are too close together. I'd also enlarge the TM slightly and tuck it in under the y more - where it is now it gets too much attention.\n\n"
    },
    {
      "time": "1 Oct 2006 — 7:39pm",
      "content": "Gerald:\n\nI have done as you suggested. (see pdf)\n\nAllessandro:\n\nI am affraid I don't quite follow you. Are you saying make the \"o\" glyph smaller!? As far as the \"abundant space\"... well, its just a letter sized PDF that I printed to. In my experience it has been easier to \"preview\" things on a larger workspace. Seems less distracting.\n\nPatty:\n\nI have moved the y out a bit from the l. My concern was that there was a lot of counter space there. How does this look!?\n\nThanks for the feedback all.\n\nKyle\n\n"
    },
    {
      "time": "1 Oct 2006 — 7:41pm",
      "content": "It feels like the y has too much space now. Am I wrong?\n\n(Version 3 has less space between the l and y.)\n\n"
    },
    {
      "time": "4 Oct 2006 — 11:52am",
      "content": "If we really only see the top half of words while we scan, then I'd agree that the -y- is too close to the -l-. Tricky kerning challenge. :^)\n\n"
    },
    {
      "time": "4 Oct 2006 — 7:00pm",
      "content": "Tiff:  \nbeing that this is a trademark, and will always exist in some type of white space (that is to say without other character or words next to it)... would the same apply!?\n\n"
    },
    {
      "time": "4 Oct 2006 — 7:06pm",
      "content": "I don't know. This is tough. Really. I think I might try making the space a hair larger. But, even still, on the whole I think it is working. My tendency is to, of course, balance the whole, but I tend to see the top more than the bottom first.\n\n"
    },
    {
      "time": "4 Oct 2006 — 7:07pm",
      "content": "Sounds good. Thanks for the input! I have just been staring at this too long. ;)\n\n"
    }
  ]
}
