{
  "id": "2850",
  "title": "Best software for editing fonts on Mac",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello--I'm new to this forum. I've used FontMonger on a Mac off and on for years to make OSF versions of typefaces for book projects, and add ligatures, etc. Now I'm composing type for books that need more stuff, like macrons over Os, etc. . . and I'm sure FontMonger is going to stop working someday. What is the current program of choice for this kind of combining/editing job?Is TypeTools enough? I don't design new fonts--just mix & match. I still use KernEdit to do my kerning on OS 9.2\n\n",
  "author": "imagine",
  "time": "26 Jan 2004 — 5:47pm",
  "uid": "2188",
  "comments": [
    {
      "time": "26 Jan 2004 — 7:24pm",
      "content": "Practically, the only software for font editing on Mac that is constantly being developed, updated, supported etc. is FontLab (currently at version 4.6): [http://www.fontlab.com](http://web.archive.org/web/20150122201727/http:/www.fontlab.com/)  \nApart from the flagship application (FontLab), the company Fontlab Ltd. offers other tools for font-related work: ScanFont (a FontLab plugin for turning bitmaps into outline fonts), TransType (a font formats converter), BitFonter (a bitmap font editor), TypeTool (a lightweight version of FontLab), and others. Some of the applications are available for both Mac and Windows, while others are only available on one platform.   \nVisit [http://www.fontlab.com](http://web.archive.org/web/20150122201727/http:/www.fontlab.com/) for more details.   \nRegards,   \nAdam\n\n"
    },
    {
      "time": "2 Apr 2004 — 6:30am",
      "content": "I too would love to find a copy of FontChameleon!   \nI actually have FC 1.5 (the starter version) for the Mac. I am VERY interested in purchasing either the pro version (with all the type descriptors) for EITHER Mac or PC, OR the additional type pack(s) for the 1.5 Mac version. I am VERY motivated to find one or both! If you have ANY information relating to locating a copy of FontChameleon OR the additional type library, please contact me.   \nThanks so much for your attention, and any help you may be able to offer!   \nKen Ryan   \nKR Studio   \nBraintree, MA\n\n"
    },
    {
      "time": "13 Feb 2004 — 8:13pm",
      "content": "an excellent choice is pfaedit -   \n   \nI would love to find FontChameleon\n\n"
    },
    {
      "time": "9 Jan 2008 — 6:34pm",
      "content": "Ken,  \nif you ever wish to sell FontChameleon, let me know! I have V1 and it is great but, no true italics.  \nHow many fonts did 1.5 come with? I know 1.5 pro came with 220 or so.\n\nRodi\n\nThe Truth shall set you free\n\n"
    },
    {
      "time": "9 Jan 2008 — 8:23pm",
      "content": "pfaedit is now known as [FontForge](http://web.archive.org/web/20150122201727/http:/fontforge.sf.net/). It is free, open source software that runs quite nicely on Mac OS X (10.3-ish and up) with X11, once you get used to its non-Mac-ness. It's updated and improved continuously, with full rebuilds on a nearly monthly basis.\n\n"
    }
  ]
}
