{
  "id": "28518",
  "title": "Adrian Frutiger on Myriad",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Has anyone seen the interview of [Adrian Frutiger](http://web.archive.org/web/20131024053309/http:/typophile.com/wiki/Adrian%20Frutiger) recently posted on the [TYPO](http://web.archive.org/web/20131024053309/http:/typophile.com/wiki/typo%20magazine) webpage?\n\n[http://www.magtypo.cz/buxus/generate\\_page.php?page\\_id=345](http://web.archive.org/web/20131024053309/http:/www.magtypo.cz/buxus/generate_page.php?page_id=345 \"http://www.magtypo.cz/buxus/generate\\_page.php?page\\_id=345\")\n\nWhat do you make of Frutiger's statement below?\n\n<cite><strong>Who do you respect of contemporary type designers? Is there a next “Frutiger”?</strong></cite>\n\n<cite>\"of the younger generation there is Roger Slimbach of the US, except the unnecessary doubt concerning <a href=\"http://web.archive.org/web/20131024053309/http:/typophile.com/wiki/Myriad\" class=\"freelinking\" rel=\"nofollow\">Myriad</a>, his work is also very good.\"</cite>\n\n",
  "author": "Dan Gayle",
  "time": "1 Oct 2006 — 11:38pm",
  "uid": "12948",
  "comments": [
    {
      "time": "2 Oct 2006 — 5:42am",
      "content": "Slimbach is, what, 50? Younger than Frutiger, yes, but it feels strange to have him referred to as the younger generation. Slimbach's a genius though.\n\nI would make this of the statement above: some people have said that Myriad is a rip-off of Frutiger. AF doesn't think that it is. Personally I agree with him.\n\n"
    },
    {
      "time": "2 Oct 2006 — 7:00am",
      "content": "Man, for a type site they really need to read some Bringhurst. The measure on those lines is a bear to wade through. I had to increase the point size twice to handle it.\n\n"
    },
    {
      "time": "2 Oct 2006 — 9:17am",
      "content": "Maybe Roger is the younger brother of Robert!\n\n"
    },
    {
      "time": "2 Oct 2006 — 9:52am",
      "content": "\\>The measure on those lines is a bear to wade through.\n\nA ploy to sell the print version? Or maybe an attempt to emulate it?\n\nFortuantely their CSS allows you to maximize the type size using your browser, making it somewhat more readable.\n\nCheers, Si\n\n"
    },
    {
      "time": "2 Oct 2006 — 10:25am",
      "content": "The thing most telling to me rather than thinking of Slimbach as the \"new young guy\" is what he said about technological changes:  \n\"Well, I was just lucky to be in every place where technical changes took place in the last 50 years. We won’t have so many changes now,...\"\n\nI wonder why he assumes changes will stop or slow down?\n\nChrisL\n\n"
    },
    {
      "time": "2 Oct 2006 — 11:52am",
      "content": "We'll have myriad of changes, then back to the sticks :)\n\n"
    },
    {
      "time": "2 Oct 2006 — 11:55am",
      "content": "FYI, Carol Twombly also worked on Myriad.\n\nAdrian Frutiger is a little out of touch. Too bad he can't travel, but he could always log on to Typophile.\n\n_I was just lucky to be in every place_\n\nFont bundlin' bin berry berry good fo' me.\n\n"
    },
    {
      "time": "2 Oct 2006 — 11:56am",
      "content": "That might actually bear Frut!\n\nChrisL\n\nLOL! Your best ever Alessandro!\n\n"
    },
    {
      "time": "2 Oct 2006 — 1:06pm",
      "content": "\\>FYI, Carol Twombly also worked on Myriad.\n\nAt least they didn't have a Minion work on it.\n\n"
    },
    {
      "time": "2 Oct 2006 — 1:15pm",
      "content": ":-\\>  \nFrom what I've heard she was actually treated like one on occasion. :-)  \nBut she managed to get some trapping in there in spite of RS, so yay for her!\n\nhhp\n\n"
    },
    {
      "time": "4 Oct 2006 — 1:56pm",
      "content": "I've always chosen to avoid using Myriad because of my respect for Frutiger. Now, I guess I don't need to be silly.\n\nDoes that mean I can start using Book Antiqua and Arial now?\n\n"
    },
    {
      "time": "4 Oct 2006 — 3:11pm",
      "content": "\\>Now, I guess I don’t need to be silly.\n\nTrue. Go buy that new iPod! Steve needs the cash.\n\n"
    },
    {
      "time": "4 Oct 2006 — 3:18pm",
      "content": "Actually Wells Fargo ATM's use Myriad too so you could bypass the whole iPod thing and just send cash ;-)\n\n"
    },
    {
      "time": "4 Oct 2006 — 6:41pm",
      "content": "I'm afraid that some of the microtype on our shiny new American bills is Myriad. At least, it wouldn't surprise me if it were. Have you noticed that the people who designed the new bills and coins in America have no sense of style? Yeah, the old ones might have needed updating to reflect current security practices, but come on, live a little.\n\n"
    },
    {
      "time": "4 Oct 2006 — 7:27pm",
      "content": "_because of my respect for Frutiger._\n\nBut what if he is wrong about this, and you are right?\n\n"
    },
    {
      "time": "4 Oct 2006 — 9:03pm",
      "content": "\"Have you noticed that the people who designed the new bills and coins in America have no sense of style?\"\n\nYou really need to spend more time in this country if you think that the design of the money is a problem. It's the design of everything ELSE that's really scary.\n\nExcluding all the goodies from Cupertino, of course.\n\n"
    },
    {
      "time": "4 Oct 2006 — 9:09pm",
      "content": "\\>Excluding all the goodies from Cupertino, of course.\n\nAren't they designed by Brit ex-pats? Maybe the US itself has no style - gulp!\n\n"
    },
    {
      "time": "5 Oct 2006 — 4:05am",
      "content": "It seems to me that the phrase\n\n\"except the unnecessary doubt concerning Myriad\"\n\nwas not correctly translated. Does anyone know what Frutiger really said (in German? in French?) during this interview. He can't speak Czech, can he?\n\n"
    },
    {
      "time": "5 Oct 2006 — 11:14am",
      "content": "<cite>But what if he is wrong about this, and you are right?</cite>\n\nI dunno, I come more from an artistic background. As long as the artists, who are typically a fickle bunch of longhairs, don't care, then why should I?\n\n<cite>It’s the design of everything ELSE that’s really scary.</cite>\n\nThat's implying that <cite>people</cite> are actually designing things. It's my opinion that **machines** are doing most of the design these days. Most classmates/teachers/workmates/etc seem to be Photoshop Gurus, but there really isn't any design involved.\n\nExcept for type people, of course. Cuz, you know, they are always totally original and design-ery.\n\n"
    },
    {
      "time": "7 Oct 2006 — 12:06pm",
      "content": "Yeah, the translation of that quote is a little odd. I don't take it to necessarily mean that AF is okay with Myriad. It would be nice to know what he intended to say there.\n\nI think Myriad owes much of its identity to its multiple master origin; its design reflects the requirements and capabilities of that technology. I also think that the merits of its design have been proven by how frequently it is seen lately (despite MM going away). Apple and Wells Fargo are two significant examples, but I see it used everywhere these days -- much more than I did ten years ago. The fact that it is used for so many prominent applications confirms to me that it has made its own place in the typographic milieu. (Reinforcing that thought: I often see the italic used by itself, too.)\n\nRobert has told me many times that the collaboration with Carol was a crucial aspect to its design. Robert's own designs usually bear his personal fingerprint, and the back-and-forth with Carol for Myriad helped keep the design tempered and utilitarian, which was obviously the point from the beginning.\n\n"
    },
    {
      "time": "7 Oct 2006 — 12:08pm",
      "content": "Myriad is also free with Adobe software and the default font in Illustrator.\n\nChrisL\n\n"
    },
    {
      "time": "7 Oct 2006 — 12:23pm",
      "content": "But only a few weights.\n\n"
    },
    {
      "time": "7 Oct 2006 — 12:26pm",
      "content": "Enough weights to get noticed--besides, the whole package was an incentive bundled with some prior incarnations old Adobe software.\n\nChrisL\n\n"
    },
    {
      "time": "7 Oct 2006 — 3:02pm",
      "content": "Which software? And was it a PS version?\n\n"
    },
    {
      "time": "7 Oct 2006 — 8:17pm",
      "content": "[TMN](http://web.archive.org/web/20131024053309/http:/www.tmn.pt/), the biggest mobile phone communications provider in Portugal, uses Myriad as its corporate typeface.\n\n"
    },
    {
      "time": "7 Oct 2006 — 9:59pm",
      "content": "_the merits of its design have been proven by how frequently it is seen lately_\n\nJust don't try that argument with Comic Sans :-)\n\n"
    },
    {
      "time": "7 Oct 2006 — 10:53pm",
      "content": "<cite>I don’t take it to necessarily mean that AF is okay with Myriad. It would be nice to know what he intended to say there.</cite>\n\nThe context indicates that AF was speaking of Slimbach in a favorable way, i.e., the next Frutiger.\n\nWho says they weren't speaking English and the Czech version isn't the translation? There isn't a Czech version of the article on the webpage. (Although, the little .jpegs at the bottom of the page show that the print edition was indeed at least also translated into Czech.)\n\nIt would make more sense since the intended final languages are Czech and English. If both parties spoke English, that means you would only have to translate <cite>once</cite>, instead of twice if AF doesn't speak Czech.\n\n"
    },
    {
      "time": "8 Oct 2006 — 10:59am",
      "content": "Yeah, all I meant was that the wording of that quote is a little weird, and doesn't give me a lot of confidence that its intended meaning is being conveyed. I mean, when AF says\n\n<cite>\"... except the unnecessary doubt concerning Myriad, his work is also very good.\"</cite>\n\nwhat does \"except the unnecessary doubt\" mean? If he's saying Robert's work is good, why state an exception for Myriad? It just reads like something that was messed-up in translation. Maybe is should have been \"despite\" instead of \"except\"? I guess we'll never know.\n\n"
    },
    {
      "time": "9 Oct 2006 — 8:40am",
      "content": "\\> I’ve always chosen to avoid using Myriad because of my respect for Frutiger.\n\nWhile I've always chosen to avoid using either of them because of my respect for Mankind.\n\n\\> the collaboration with Carol was a crucial aspect\n\nThen why did they have a bad relationship?  \nOr is this a revisionism parallel to that of the pedigree of some of his fonts?\n\nhhp\n\n"
    },
    {
      "time": "9 Oct 2006 — 9:43am",
      "content": "Dan, please close your italic tag. Thx, Si\n\n"
    },
    {
      "time": "9 Oct 2006 — 10:17am",
      "content": "\\>It just reads like something that was messed-up in translation.\n\nI think it more likely that it is somewhat broken English from a non-native speaker. A translator would put it into smooth English from either German or French. In any case the message seems to be that he doesn't have a problem with Slimbach's Myriad.\n\nOf course Myriad was influenced by Frutiger, but so have been a hundred others. Frutiger evidently recognizes that Myriad has enough of a different look to be part of the normal process of designers--in all fields--being strongly influenced by others, both past and present, but taking their ideas and making something significantly different.\n\nFor what it's worth, I don't think that any of the faces strongly influenced by Frutiger, the typeface, are as good as the original, including Myriad.\n\nMyriad's condensed version is somewhat of a different animal. I believe I remember reading on Typophile that it was done before there was the condensed version of Frutiger--which appears in Frutiger Next. And I remember reading that Slimbach drew the condensed and Twombly the regular, and then they revised each other's work. To me the lighter terminals on Myriad mean that the condensed version actually works better than the regular.\n\nJust checking on screen the Frutiger Next Condensed and Myriad Condensed, I actually like the Myriad Condensed better.\n\n"
    },
    {
      "time": "9 Oct 2006 — 10:33am",
      "content": "Bill, I agree with you about Myriad Condensed, it's a very useful face, and the fitting is brilliant. When I was art directing, I used the Condensed a lot (great for sidebars and captions), but never the regular scaling.\n\n\\*\\*\n\nAdrian's \"unnecessary doubt\" could also be interpreted as him saying that Myriad is unnecessarily close to Frutiger (the typeface), creating doubt as to whether it's plagiarism. That would be a subtle ethical nuance, like saying some people might consider it dubious, and perhaps he doesn't want to point a finger at a fellow designer, because no one is innocent and can do brilliant original designs all the time (including AF).\n\nSo, there is outright plagiarism, and \"too close for comfort\", which is tolerable, but one should try and avoid it if possible.\n\n"
    },
    {
      "time": "9 Oct 2006 — 10:35am",
      "content": "Aren't you guys aware that AF once made a big stink about Myriad? Although it's always possible that advancing age has changed (to use a kind term) his mind.\n\nhhp\n\n"
    },
    {
      "time": "9 Oct 2006 — 11:05am",
      "content": "I didn't know he made a stink about it.  \nBut as you say, he might have toned down his criticism.  \nOne reason -- as I said, no one is innocent, and even he has done some derivative designs.  \nTwo, he might realize that having his eponymous face become a genre is pretty cool, right up there with Garamond and Bodoni.\n\n"
    },
    {
      "time": "9 Oct 2006 — 4:31pm",
      "content": "<cite>Then why did they have a bad relationship?<br>\nOr is this a revisionism parallel to that of the pedigree of some of his fonts?</cite>\n\nI think you're being superfluously provocative. I'm not seeing the \"revisionism\" in anything I said. Robert and Carol did indeed collaborate on Myriad, and I do believe that collaboration had a substantial impact on its design. If you dispute that, ask Robert yourself.\n\n"
    },
    {
      "time": "9 Oct 2006 — 5:01pm",
      "content": "And there I was thinking I was being substantially provocative.\n\n\\> collaboration had a substantial impact on its design.\n\nThis does not contradict [the implication in] my question.\n\nYour potrayal of their relationship was revisionistic in its implication of a harmonious effort, and I simply don't let things like that slide, sorry.\n\nhhp\n\n"
    },
    {
      "time": "9 Oct 2006 — 5:43pm",
      "content": "God, Sii, BOZ?\n\n ![](http://web.archive.org/web/20131024053309im_/http:/typophile.com/files/gallery_bosworth_5766.jpg)\n\n"
    },
    {
      "time": "9 Oct 2006 — 6:02pm",
      "content": "Boz, so much hype, so little game :-)\n\nChrisL\n\n"
    },
    {
      "time": "9 Oct 2006 — 6:15pm",
      "content": "<cite>Your potrayal of their relationship was revisionistic in its implication of a harmonious effort, and I simply don’t let things like that slide, sorry.</cite>\n\nUm, yeah, you seem to want to make some big soap opera out of it, but I think you're letting your imagination get away from you. If it's more exciting for you to project all this controversy and drama onto the matter, then have fun with that. I don't see the relevance.\n\n"
    }
  ]
}
