{
  "id": "28516",
  "title": "Choosing a typeface for an engineering/architecture/construction firm",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello,\n\nI'm making an important typeface selection for a logo that belongs to a recruitment agency specialising in engineering, architecture and constructions.\n\nTheir current logo (mis)uses Bauhaus. [attached]  \nIt's probably okay for the mark, but definitely doesnt work for the company name at small type sizes, not surprising for a display face.\n\nThere are a few key considerations:\n\n1. It must be legible across print and web delivery, specifically at small sizes in newsprint.\n2. They dont want to move too far from the existing design - they want me to 'clean up the mark and use a typeface that is more legible'\n3. The new logo will set the scene for a mini-branding in a few months, where a new website and stationary will be produced.\n\nFor newsprint ad campaigns, so far I've mainly used DIN for display settings and Oficina Sans for body setting.\n\nI know its seen as a cliche to use 'square sans' typefaces like DIN and Meta for engineering/architecture firms, but given the requirements, I think this is a fitting direction that is not likely to upset a fairly conservative client.\n\nSo far i'm looking at:  \n [Klavika](http://web.archive.org/web/20131107164038/http:/www.processtypefoundry.com/typefaces/klavika/index.html)  \nBecause its handsome looking, will print well on web-offset, and offers a lot of weights and variations which should make light work of stationary design later.\n\n[Locator](http://web.archive.org/web/20131107164038/http:/www.processtypefoundry.com/typefaces/locator/index.html)  \nFor similar reasons to Klavika, except that I think this looks too much like a Real-Estate magazine face.\n\nAnyone have any other suggestions, or thoughts on my direction so far?  \nBTW, i didn't design the original logo!\n\nThanks,  \nJonny\n\n| Attachment | Size |\n| --- | --- |\n| [logo.gif](http://web.archive.org/web/20131107164038/http:/typophile.com/files/logo_26.gif) | 3.24 KB |\n| [NX6043935.pdf](http://web.archive.org/web/20131107164038/http:/typophile.com/files/NX6043935.pdf) | 76.68 KB |\n\n",
  "author": "JonnySchneider",
  "time": "1 Oct 2006 — 10:18pm",
  "uid": "11331",
  "comments": [
    {
      "time": "2 Oct 2006 — 12:38am",
      "content": "Jonny, I don't in any way mean to be facetious, but if you keep the d and b in the current positions and use a typeface with ascenders any longer than are presently in use, you are in danger of having a logo that will be reminiscent of the male genitalia in a state of arousal!\n\nI noticed this only because I had a design student encounter something similar recently.\n\n"
    },
    {
      "time": "2 Oct 2006 — 4:28am",
      "content": "Yes, that was my first thought too - very phallic! So it's not just me. I would say it's your duty to the client to tell them that has got to go. Nice looking, yes, but prone to reduce grown men and women to giggling.\n\nI would stay away from a lowercase logo in rounded fonts for this very reason. Unless perhaps you come up with a different placement of the \"d\" and \"b\", perhaps? Maybe joining the stems together, or placing one letter higher than the other?\n\n"
    },
    {
      "time": "2 Oct 2006 — 4:53am",
      "content": "Yes, I agree with both of you, and it is indeed what I first thought when I saw the logo for the first time. Let me say again, I didnt design this logo!\n\nI will have to bring this to their attention and leave it to them to decide.\n\nI dont want to hijack this thread, but you might find the attached broadsheet banner advert [NX6043935.pdf] amusing. Again, this advert was produced very much under duress.\n\nThat aside, any thoughts on typefaces? Another idea is to use the a more decorative ampersand from another face with a square sans face. But this is somewhat cliche too right? You tell me! This is my first commercial logo design gig, I'm after all the input I can get.\n\nHopefully I'll be able to post something to critique shortly, but still planning at the moment.\n\n"
    },
    {
      "time": "2 Oct 2006 — 6:44am",
      "content": "You could use an ampersand, but that would lose the reflective quality, maybe using the + sign would be more engineering/architecture etc. To that end I would choose Locator (or similar) because the characters have similar characteristics when reflected.  \nTim\n\n"
    },
    {
      "time": "2 Oct 2006 — 9:12am",
      "content": "_hee hee_ Just the sort of logo I'd expect from engineers. It's gotta go....\n\nI'll second Tim on Locator -- I think it strikes an appropriate tone for such a business.\n\nLinda\n\n"
    },
    {
      "time": "24 Mar 2007 — 12:16am",
      "content": "This thread was among some others in one of my searches earlier today and I just happened to run across a [relatively new logo](http://web.archive.org/web/20131107164038/http:/www.feedback20.com/en/) that does precisely what Termopolium was suggesting. heh.\n\n(It still looks phallic...just a little, uh, uncomfortable.)\n\n ![](http://web.archive.org/web/20131107164038im_/http:/typophile.com/files/feedback_3578.jpg)\n\n"
    }
  ]
}
