{
  "id": "2853",
  "title": "Interesting things to see in Savannah, GA, anyone?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Going there this weekend, wondering if anyone knows of any interesting places to see?   \n   \nI'd like to head up to the American Papermaking Museum in Atlanta, but I won't be able to. bah.\n\n",
  "author": "kakaze",
  "time": "26 Jan 2004 — 9:55pm",
  "uid": "1977",
  "comments": [
    {
      "time": "27 Jan 2004 — 12:28pm",
      "content": "I've always enjoyed walking down the Riverfront with a plastic cup of beer. Mostly because it's fun to drink in public with impunity. The Riverfront also used to have great breakdancing. It's been a while since I've been there though.   \n   \nValdosta, Georgia has the best all-you-can-eat fried catfish and hushpuppy dinner known to man. Unfortunately it's about 3 hours from Savannah.\n\n"
    },
    {
      "time": "27 Jan 2004 — 8:06pm",
      "content": "Thanks Brian, might check it out.   \n   \nNathan, supposedly we are going to the Riverfront, though I don't drink alcohol so that part won't be for me, heh. No Valdosta either, just Savannah this time.\n\n"
    },
    {
      "time": "28 Jan 2004 — 10:10am",
      "content": "You know, the Riverfront can be pretty fun. There's a lot of crappy tourist-style souvenir stands, but there are also some pretty good reaturants & shops & such. Plus, having reloacted to the landlocked Midwest, the stink of ocean air makes me swoon.   \n   \nWhen I was wee, my parents used to drag me around to all the quasi-historical re-enactment stuff. Savannah has some of that, too - perhaps there's an old-timey letterpress shop somewhere.\n\n"
    },
    {
      "time": "28 Jan 2004 — 3:29pm",
      "content": "I'd love to go see a letter press shop.   \n   \nI know we're probably going on a ghost tour or two.   \n   \nAnd most likely we will be eating at the riverfront at least once.   \n   \nJust over 24 hours and counting until we leave.\n\n"
    },
    {
      "time": "29 Jan 2004 — 5:55am",
      "content": "Enjoy the South, Chris. No matter what you end up doing in Savannah, you'll have fun. It's actually one of my favorite cities down that way.\n\n"
    },
    {
      "time": "29 Jan 2004 — 3:05pm",
      "content": "Here's hoping I enjoy it.   \n   \nBout 14 hours or so until we leave now.\n\n"
    }
  ]
}
