{
  "id": "28551",
  "title": "freefontmanifesto.blogspot.com",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Anyone back from ATypI care to share the back-story here? By not attending I feel as if I missed three episodes of LOST...\n\n[http://freefontmanifesto.blogspot.com/](http://web.archive.org/web/20150124055224/http:/freefontmanifesto.blogspot.com/ \"http://freefontmanifesto.blogspot.com/\")\n\n[http://www.designwritingresearch.org/free\\_fonts.html](http://web.archive.org/web/20150124055224/http:/www.designwritingresearch.org/free_fonts.html \"http://www.designwritingresearch.org/free\\_fonts.html\")\n\n",
  "author": "Si_Daniels",
  "time": "3 Oct 2006 — 2:23pm",
  "uid": "1049",
  "comments": [
    {
      "time": "4 Oct 2006 — 3:44pm",
      "content": "Looks like people are posting over [there](http://web.archive.org/web/20150124055224/http:/freefontmanifesto.blogspot.com/), and not here. Which is fine, but I just found this pic over at flickr which I have to share... ;-)\n\n[http://www.flickr.com/photos/opto/259958941/](http://web.archive.org/web/20150124055224/http:/www.flickr.com/photos/opto/259958941/ \"http://www.flickr.com/photos/opto/259958941/\")\n\nCheers, Si\n\n"
    },
    {
      "time": "4 Oct 2006 — 4:55pm",
      "content": "Si,\n\nI wish we would get some more of the scoup too. There was one post earlier on Yves' blog that opened the question.\n\n[http://typophile.com/node/28565](http://web.archive.org/web/20150124055224/http:/typophile.com/node/28565 \"http://typophile.com/node/28565\")\n\nChrisL\n\n"
    },
    {
      "time": "4 Oct 2006 — 5:02pm",
      "content": "What kind of scoop do you want. Nothing is hidden. She posed the question and now type designers are responding. The way I took it was all hypothetical. It would be great to raise the public's awareness, but I think it needs to start way before font selection. The public must first understand composition and typography and then... well, then we can discuss font selection.\n\n"
    },
    {
      "time": "4 Oct 2006 — 5:15pm",
      "content": "I think the public also needs to understand the value of type. Somehow giving it away does not seem to be a way to do this.  \nA strange thing happened to me today--maybe not so strange. While taking the elevator from the Metro, I ran in to a women I see frequently in my daily commuting. I told her I was retiring from my day job this Summer and planned to design typefaces. Her response was, \"What is a Typeface?\" She is an educated professional who works for the Smithsonian and was not kidding.\n\nWe have a lot of \"public awareness\" to do before font selection.\n\nChrisL\n\n"
    },
    {
      "time": "4 Oct 2006 — 8:46pm",
      "content": "\\>What kind of scoop do you want. Nothing is hidden.\n\nIt seems to make a bit more sense now, but on first glance (I spotted the link on that French chap's blog - so context was a bit weak given my poor grasp of French) it seemed a bit left-field for an ATypI keynote - glad to see that this was just a footnote to her talk and not the whole thing.\n\nAlso shame the typophile blogs are not more accessible :-(\n\nSi\n\n"
    },
    {
      "time": "4 Oct 2006 — 9:30pm",
      "content": "Ellen's got a good point. If people don't start giving stuff away soon, we're all going to grow old designing everything in Times, Georgia, Verdana, and Arial/Helvetica because clients will think that those fonts are \"the standard.\" A lot of US Federal Government agencies, along with a lot of courts, are already standardizing on Times; God help us all if the entire world standardizes on fonts that come with MS Office.\n\nAnd besides, Adobe needs to do SOMETHING with all that money. After all, they aren't using it to patch all the nasty bugs in their software in-between releases like they used to.\n\nOf course, with my luck they'll give us ITC Garamond and Papyrus.\n\n"
    },
    {
      "time": "5 Oct 2006 — 6:46am",
      "content": "My first internship in college was at 3M. EVERYTHING = Times + Helvetica. As young graphic design student, that was hell. ;o)\n\n"
    },
    {
      "time": "5 Oct 2006 — 7:12am",
      "content": "If we use 100 hours as a average time span to create a basic font (256 character set), and given this manifesto is geared towards underserved markets, and given that creating a more complex font for these underseved markets may take upwards of 200 hours per font, perhaps we type designers can ask for all the graphic designs out there to contribute 200 hours of their time to servicing these underseved markets as well.\n\nIs 20-50 dollars for a basic font license that out of reach to these underserved markets?\n\n"
    },
    {
      "time": "5 Oct 2006 — 9:41am",
      "content": "I remember when I was in design school in the dark ages. The type foundries did exactly what Ellen suggested. One day 4 burely guys in a Caterpillar front-end loader came to my apartment to deliver my set of fonts. The huge package was labeled to \"Underserved market person #864.\" It was 8 tons worth of California job cases filled with 72 point lead type. I asked if there was a charge (before they got the lead out). They said, \"No, it all comes bundled with your Haberule.\"\n\nChrisL\n\n"
    },
    {
      "time": "5 Oct 2006 — 11:17am",
      "content": "\"...perhaps we type designers can ask for all the graphic designs out there to contribute 200 hours of their time to servicing these underseved markets as well.\"\n\nI understand where you're coming from, and I think it's too much to ask smaller foundries or individual designers to give away entire typefaces. But companies like Adobe and Microsoft, which make billions of dollars selling web-development/server software, would make life a lot better for many of the designers and content buying said software by releasing more fonts for free.\n\n"
    },
    {
      "time": "5 Oct 2006 — 11:42am",
      "content": "James, how do you spell \"greedy\"?  \nIf you're a professional designer working on a Mac using Adobe CS, which is the standard, you have been bundled a shitload of free fonts, more than enough to cover all the basic typesetting requirements of your work.  \nIf you're a professional, you can drop $1000 on a new tab-sized inkjet printer, an Aeron chair, a Cinema 24\" display, and a similar amount on 1000 fonts in Bitstream's Type Odyssey. If you're a professional, you presumably have some cash flow, and a library of fonts is a business expense like any other.  \nBut of course, software wants to be free.\n\n"
    },
    {
      "time": "5 Oct 2006 — 11:52am",
      "content": "Friday night drinks at the chic club where all the young cool people go? $50.\n\nA typical font from MyFonts? $30.\n\nThe look on your face when you get a compliment on your work from a client? Priceless.\n\nChrisL\n\n"
    },
    {
      "time": "5 Oct 2006 — 12:05pm",
      "content": "No professional just starting out in any profession gets \"free stuff\" , why should the publishing/design professional be any different.\n\nGenerations of designers graduated from design schools for years and got zilch handed to them for free. Type is way, way cheaper now than it ever has been in history. What you get for free today, you perceive of lesser value tomorrow. If you want free type, there is a ton of it out there now. If you want something that you don't see out there for free, spend a few hundred hours and design it yourself. You might see some value in that $30 font then.\n\nChrisL\n\n"
    },
    {
      "time": "5 Oct 2006 — 6:29pm",
      "content": "The fonts that designers have to use on their own computer of often irrelevant online. I'm not interested in free fonts so that I can use them for free–like you said, between OS X and CS2 I've got all the fonts I'll ever need.\n\nBut web users? The only fonts a designer can count on them to have are Arial, Verdana, Georgia, Times, and maybe Helvetica. For me, the point of having more free type out there, provided by companies like Microsoft or Adobe, is that they'd be doing a huge favor to designers, who would finally be free to use more type without resorting to raster images or flash tricks, or funky javascript stuff. Either that or they need to do us all a favor and work out embedded type–something Adobe could have done two years ago had they kept up SVG support–and clarify the related licensing terms.\n\n"
    },
    {
      "time": "5 Oct 2006 — 7:01pm",
      "content": "Food for thought: There are tons of people who have to use type who are not going to buy type. But I still have to view what they make with the default choices, and it gets old. Free typefaces have a chance at becoming ubiquitous by natural selection. Ans becoming parts of standards for compatibility, that I would balk at choosing proprietary fonts for. If any decent casual fonts were truly free back-in-the-day, would we all be forced look at Comic Sans? Astigmatic One Eye makes sales today, based on the recognition their free fonts garnered them; I've sold them to clients. Finally, is it not one of those things where, if you don't like the idea, you needn't participate? FOSS grows well despite MS and other major developers.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150124055224/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "5 Oct 2006 — 7:14pm",
      "content": "\\> who would finally be free to use more type\n\n\"More\" bundled type is never going to meet demand. Web designers who want more should lobby for font embedding solutions that they can use with the fonts they pay for.\n\n"
    },
    {
      "time": "5 Oct 2006 — 7:56pm",
      "content": "\\> who would finally be free to use more type\n\n\\>“More” bundled type is never going to meet demand.\n\nTouche. Maybe I'll start a charitable fund to get a good embedded font solution in Firefox 3.0.\n\n"
    },
    {
      "time": "5 Oct 2006 — 9:22pm",
      "content": "James, you have a point about the web.  \nI think that up to a point more bundled type would be very useful (in the absence of font embedding solutions). In particular, a light weight of any of the standard sans faces would brighten things up considerably. A display weight of Georgia would be good too.\n\n"
    },
    {
      "time": "6 Oct 2006 — 3:16am",
      "content": "@web  \nWait how Vista is going, wait if MS allow the Vistafonts for using in earlier Win OS (XP) and if so, how they manage it to install the vistafonts for that systems automatically, plus changing the settings of cleartype to \"on\" by default.  \nThen wait if there is a possiblity including the vista fonts in OSX.  \nIn the meantime there is flash, pictures, php to get some corporate design look. Okay, it would be nice to have a \"strictly\" Georgia Print version with optical sizes and such. (or is there one, maybe Miller?)\n\nI'm not really interested in browser-based solutions (like fontface for IE) or in css-/ javascript-solution downloading fonts from foundries and such... This is not working well, i promise, if there are no standards in use, for all user agents.\n\n"
    },
    {
      "time": "6 Oct 2006 — 6:26am",
      "content": "\\>Wait how Vista is going,\n\nAlthough Web page designers are free to specify whichever fonts they like, I think it's going to be many years before the ClearType Collection fonts reach any level of saturation on user's machines.\n\n\\>Okay, it would be nice to have a “strictly” Georgia Print\n\nPlease drop Ascender a line, they're free to produce intermediate weights of versions Microsoft fonts (including Georgia and Verdana) and if enough people express interest I'm sure they'll get going on this.\n\n"
    },
    {
      "time": "6 Oct 2006 — 9:44am",
      "content": "<cite>Although Web page designers are free to specify whichever fonts they like, I think it’s going to be many years before the ClearType Collection fonts reach any level of saturation on user’s machines.</cite>\n\nIf the Vista fonts eventually migrate over to OS X (probably a pipe dream) it will still be nice to have more good fonts to call on.\n\nI just picked up some extra 40-gig hard disks from a friend who was moving, maybe this weekend I'll install Vista on one and start checking those fonts out. Hell, maybe I'll do my next design project as a web site that only uses the Vista fonts, just to really screw with people...\n\n"
    },
    {
      "time": "6 Oct 2006 — 10:53am",
      "content": "\\>If the Vista fonts eventually migrate over to OS X (probably a pipe dream) it will still be nice to have more good fonts to call on.\n\nI guess for the Web Fonts, we had the advantage that they were hinted for bi-level rendering, so worked just as well on Windows 3.1 and Mac OS 7 as they did on the new cutting edge Windows 95 and Mac OS 8 machines. :-)\n\nSo even with a free distribtion program like we had for the web fonts, many users would not get a good experience with these fonts, and as such less Web sites would specify them.\n\n"
    },
    {
      "time": "6 Oct 2006 — 11:33am",
      "content": "<cite>So even with a free distribtion program like we had for the web fonts, many users would not get a good experience with these fonts, and as such less Web sites would specify them.</cite>\n\nI'm not sure that's entirely the case. Linux on the desktop is still in roughly the same place with was in the 1990s (nowhere) and Apple, while growing on its own, is still losing overall market share. At some point in the not-too-distant future, when 75+ percent of the internet-connected masses are running Vista, some big corporation might do some great promotional site that only uses the Vista fonts, and Windows-friendly designers might follow. The same thing happened with Flash-for a long time nobody would think of doing entire web sites with Flash, but once a few rocks bands and movies pulled it off, all-Flash web sites became common.\n\n"
    },
    {
      "time": "6 Oct 2006 — 11:56am",
      "content": "Gah! When that happens I\"ll move to the mountains!! ;^)\n\n"
    },
    {
      "time": "6 Oct 2006 — 12:24pm",
      "content": "Tiff, aren't you already in the mountains? :-P\n\nChrisL\n\n"
    },
    {
      "time": "6 Oct 2006 — 1:12pm",
      "content": "\\>I’m not sure that’s entirely the case. Linux on the desktop is still in roughly the same place with was in the 1990s (nowhere)\n\nBlub, I'll fetch my violin.\n\n\\>and Apple, while growing on its own, is still losing overall market share.\n\nIt's a deliberate strategy to avoid spyware.\n\n\\>At some point in the not-too-distant future,\n\nBut for the Web fonts, adoption happened almost immediately - within the space of six months to a year, many top-level sites were specifying Verdana.\n\n"
    },
    {
      "time": "6 Oct 2006 — 2:23pm",
      "content": "\"Apple, while growing on its own, is still losing overall market share. At some point in the not-too-distant future, when 75+ percent of the internet-connected masses are running Vista, some big corporation might do some great promotional site that only uses the Vista fonts\"\n\nLinux has come a long way. Give Ubuntu a try. It's on the cusp of picking up considerable speed in the next several years.\n\nTotal computer market share is completely irrelevant. A huge chunk of PC sales are strictly terminals in cubicle farms. Many won't even be hooked up to the internet at large.\n\nAs as for vista, that's way in the future getting 75% of the people on it. Many large corporations are just migrating to XP from 2k. So don't get your hopes up too much in the near-future.\n\n"
    },
    {
      "time": "6 Oct 2006 — 4:34pm",
      "content": "<cite>But for the Web fonts, adoption happened almost immediately - within the space of six months to a year, many top-level sites were specifying Verdana.</cite>\n\nMy argument is not concerned with the pace of font adoption, only that widespread adoption of new Microsoft operating systems is inevitable. And if embedded font technology keeps advancing at the pace it has been, I think that web designers may start designing with the newer Windows fonts before we finally have a good way of just embedding any font we want.\n\n<cite>Linux has come a long way. Give Ubuntu a try. It’s on the cusp of picking up considerable speed in the next several years.</cite>\n\nSo were Red Hat, and SuSE, and Mandrake, and several other distros. There's always some hot new Linux distro that's going to make it big, and just like all the others, it doesn't happen. The same goes for StarOffice, AbiWord, GIMP, Inkscape, and a long list of other open-source stuff that was supposed to bring Stallmanism to the masses.\n\n"
    },
    {
      "time": "6 Oct 2006 — 6:30pm",
      "content": "i think a better solution (and perhaps just as naieve as asking type designers to give fonts away for free) would be for the w3c (or some other interested organization) to commission typefaces that would be made available freely to whoever wanted to use them for whatever purpose. ideally, these would be designed as web fonts (of course). perhaps, the organization could organize a fund-raising opperation taking donations from web/graphic designers who would like to have an available library of fonts that could be used freely to develop websites, &c.\n\n"
    },
    {
      "time": "6 Oct 2006 — 7:05pm",
      "content": "If the W3C made typefaces:\n\n- It would take five years for designers to figure out how to use them without everything looking like crap, partly because they would remove any ability to center or align type that didn't involve manipulating the margins.  \n- Every typeface would have to work equally well in print, on cellular devices, and on game consoles.  \n- Every typeface would come with a lecture on how \"open\" it is, and then the W3C would start whinging any time someone tried to change it, only implement certain weights, add weights, or change the design at all.  \n- There would be numerous discussions between the corporate backers and the W3C about the direction of the type design, none of which would go anywhere.  \n- We'd only ever be able to view the fonts properly on Opera and Safari. The Firefox developers would keep trying to implement the fonts, and claim to be W3C-font-compliant, but still not be able to render 20% of them properly.\n\n"
    },
    {
      "time": "6 Oct 2006 — 7:12pm",
      "content": "\\>i think a better solution (and perhaps just as naieve as asking type designers to give fonts away for free) would be for the w3c (or some other interested organization) to commission typefaces that would be made available freely to whoever wanted to use them for whatever purpose.\n\nI don't think the w3C would be the right organization, but this matches my personal opinion. Here's what I posted on El's blog...\n\n\"With few exceptions\\* the successful free fonts have had corporate, governmental or other organizational backers that have bankrolled their production. This is true for SBL Hebrew, Euphemia UCAS, Vera, Verdana, Georgia, Cyberbit and pretty much every other useful free font you can mention. Time and time again it’s been proven that paying professional type designers for their time and effort is the only way to produce professional results, that the amateurs can’t match. So rather than calling on type designers and foundries to donate typefaces, perhaps it would be better to call on corporations and governments to pool their donations into a central fund that would finance the production of high quality fonts for the public domain?\"\n\nIf a type designer wants to make a free font, that's their choice. But my personal opinion is that if you want good results you should be prepared to put up some cash or other incentives.\n\n"
    },
    {
      "time": "6 Oct 2006 — 8:41pm",
      "content": "^ Hmm, you got a point...\n\n"
    },
    {
      "time": "6 Oct 2006 — 8:43pm",
      "content": "<cite>Time and time again it’s been proven that paying professional type designers for their time and effort is the only way to produce professional results, that the amateurs can’t match.</cite>\n\nAnd that's another reason I'd rather see companies like Microsoft and Adobe, which may have some business interest in doing so, release a few good new families. It worked out very well with Verdana and Georgia-far better than it has with just about all the other free fonts out there, most of which are almost never used by anyone, for good reason.\n\nSomething else I've been thinking about, regarding the possibility of Lupton inspiring a whole lot of designers to release more free fonts, is that even if it does happen, theres no good way to deal with distribution of the fonts for use on the web. Would users really want to deal with a few more big families, a few dozens small ones, and hundreds of display faces just to be able to use the internet and see the fonts that are available out there? This one leads me back to wishing that either Microsoft or Adobe (or better, both) would pick get their respective embedded font balls rolling again.\n\n"
    },
    {
      "time": "6 Oct 2006 — 10:00pm",
      "content": "A painless embedding standard, endorsed by the right folks, could be retroactively applied to all existing OT fonts, based on their embedding tags. The platform independence of OpenType also makes this viable this very moment.\n\nOf course, most of the good typographical stuff in CSS2 has not been implemented in any browser, and 2.1 was essentially a rolback from the W3C, since they couldn't get browser support. Things look equally grim for typography in CSS3's type stuff, assuming it ever gets out and gets even partially implemented.\n\nI think the only way anything will progress soon has to be a non-proprietary standard orchestrated by the Typographic trade organizations in communications with the browser developers. Individuals can't do it. Short of paying dues to a trade group, the next best bet is the FOSS community. It'll be a while that way though.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150124055224/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "6 Oct 2006 — 10:45pm",
      "content": "<cite>Things look equally grim for typography in CSS3’s type stuff, assuming it ever gets out and gets even partially implemented.</cite>\n\nPersonally, I hope that by the time CSS3 gets implemented, someone else will have already come up with a good replacement for XHTML/CSS–and for that matter, the W3C. I also doubt that CSS2 will ever see a full implementation in Firefox or, more importantly, Internet Explorer, so CSS3 may be a lost cause.\n\n<cite>I think the only way anything will progress soon has to be a non-proprietary standard orchestrated by the Typographic trade organizations in communications with the browser developers. Individuals can’t do it. Short of paying dues to a trade group, the next best bet is the FOSS community. It’ll be a while that way though.</cite>\n\nAs much as I wish the F/OSS community could make it happen, they probably won't. I'm a reformed sysadmin/engineer, and I've spent enough time in the trenches with F/OSS types to know that they code stuff that's of interest to F/OSS programmers. They would have done it all with SVG by now if there was serious interest. Unless someone offers a big financial bounty for a F/OSS option, it won't happen.\n\nDoes anyone else just wish that Adobe would start trying to make Flash the new PDF for the web? With Flex to handle the backend there's no reason that the combined talents of Adobe and Macromedia can't do something a lot better than the W3C has done with XHTML/CSS. It would be great for designers, who would no longer have to worry about dealing with browser incompatibilities, not to mention not having to learn their way around the obtuse mess that is HTML/XHTML/CSS/Javascript.\n\n"
    },
    {
      "time": "7 Oct 2006 — 9:14am",
      "content": "_As much as I wish the F/OSS community could make it happen, they probably won’t. I’m a reformed sysadmin/engineer, and I’ve spent enough time in the trenches with F/OSS types to know that they code stuff that’s of interest to F/OSS programmers._\n\nBy 'a while', I meant FOSS could take decades. The incredible slowness that IM has moved from a mess of proprietary nightmares of incombatibility, to today, with the dawn of XMPP just barely starting to matter is aperfect example of even a geekier thing moving at FOSS speed. But hey, maybe as the /. hordes get older, they'll want EvenClearerType. Otherwise, I don't know who'd pay the bounty. An e-book developer?\n\nI think trade groups could make it happen in 4-5 years, which is still a long time in code-land. Are there even any important industry organizations? Do they have much motivations or membership?\n\n_Does anyone else just wish that Adobe would start trying to make Flash the new PDF for the web?_\n\nI don't know. Off the top of my head, I just want Adobe to not behead the vision that made Macromedia great. The competition between the two has been beneficial to me, and I don't know what will help keep Adobe, now an even older, larger corporation, taking risks.\n\nAlso, there is a lot that would need to be done to make flash light enough for little pages, and to get it as freely interlinkable/indexable as web pages. Also, as soon as Flash was open-specced, competitors would turn it's output into a rendering mess, like what we've got now.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150124055224/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "7 Oct 2006 — 12:47pm",
      "content": "Note: the Flash SWF format is a publicly available specification, and has been for years.\n\nT\n\n"
    },
    {
      "time": "7 Oct 2006 — 3:40pm",
      "content": "Tom, what's the current status of Flash's respect for font embedding permissions?\n\nCheers, Si\n\n"
    },
    {
      "time": "12 Oct 2006 — 7:29am",
      "content": "it's interesting to look back and see how quickly the interest in making free fonts fizzles out: [Time for a website for free font development?](http://web.archive.org/web/20150124055224/http:/typophile.com/node/16620)\n\n"
    },
    {
      "time": "12 Oct 2006 — 2:02pm",
      "content": "What the campaign needs is a charismatic front-man to extract the corporate and governmental contributions, and pass them on to the type designers and foundry people on staff. Kind of like NickNeg of the \"one laptop per child\" program - also need a catchy name and a gimmick.\n\nHere's my suggestion, call it the \"one font per language\" campaign complete with bright green KERN hoodies for every supporter? Maybe Bruno Steinart might be convinced to come out of retirement to front the organization.\n\nDon't laugh, it might just work.\n\n"
    },
    {
      "time": "12 Oct 2006 — 2:18pm",
      "content": "How about, \"No Laptop Left Behind\" program Si?\n\nChrisL\n\n"
    },
    {
      "time": "12 Oct 2006 — 4:18pm",
      "content": "I would join to get the KERN hoodies, Si :)\n\n"
    },
    {
      "time": "12 Oct 2006 — 4:54pm",
      "content": "now if they actually WERE hoodies...\n\n"
    },
    {
      "time": "12 Oct 2006 — 8:53pm",
      "content": "\\>now if they actually WERE hoodies…\n\nTrue, I myself have corrected people - Veer sells KERN \"zip-ups\" and they are blue (how sad it is that I'm wearing mine as I type) - but for this campaign they must be green and they must be hoodies - in some way being like the OLPC concepts you see on TV...\n\n[http://www.engadget.com/2006/10/11/nickneg-signs-up-libya-for-1-2-millio...](http://web.archive.org/web/20150124055224/http:/www.engadget.com/2006/10/11/nickneg-signs-up-libya-for-1-2-million-2b1-laptops/ \"http://www.engadget.com/2006/10/11/nickneg-signs-up-libya-for-1-2-million-2b1-laptops/\")\n\n\\>I would join to get the KERN hoodies, Si :)\n\nI'll hold you to that! ;-)\n\n"
    },
    {
      "time": "12 Oct 2006 — 9:36pm",
      "content": "_it’s interesting to look back and see how quickly the interest in making free fonts fizzles out: Time for a website for free font development?_\n\nIt hasn't fizzled out. When I first learned of open source several years ago, the typographic subgenre was rather slim pickings. It is growing. And, will keep growing, things don't just fall out of open licenses, so the fruits will continue to be there. It won't be important tomorrow, but it will be important.\n\nNevertheless,I am not worried. Open fonts will inevitably take over the legible-functionality aspect of type, while the professionals will continue to cater to the specialist demands; topicality, branding, high art, prestige product, and pretty much everything else interesting today.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150124055224/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "12 Oct 2006 — 9:59pm",
      "content": "_Open fonts will inevitably take over the legible-functionality aspect of type_\n\nThat doesn't make sense. Basic functionality is already catered to by system-bundled fonts.  \nWithout bundling distribution, a free font will have to be a quite remarkable design to get any kind of \"market\" penetration. It worked for Ray Larabie's Neuropol, but that was part of a phenomenon when digital fonts were new and trendy. Or a \"gimmick\", like Gentium.\n\nIt's not enough just to be free, a free font has to have a Big Idea and be brilliantly designed, just like retail fonts, for people to want to use it.\n\nOnline font retailers have done free font promotions, but have those fonts proven to have legs? At least if I spend time creating a font and marketing it, I can make something back on the work, even if it doesn't sell a lot or become a classic, but imagine going to the same effort for nothing, with no guarantees that anyone will even warm to it. There's all this BS about \"giving something to the world\", but the likelihood the world would even want one's free offerings is extremely slim.\n\n"
    },
    {
      "time": "13 Oct 2006 — 5:22am",
      "content": "I think \"The World\" is more interested in more basic needs like food, shelter, and medicine. If anyone is interested in helping, they can sell their wares of any kind, be they Type Books, fonts, or graphic designs, and donate the proceeds to help those in real need. \" [Building Letters](http://web.archive.org/web/20150124055224/http:/typophile.com/wiki/Building%20Letters)\" is a good example.\n\nChrisL\n\n"
    },
    {
      "time": "13 Oct 2006 — 6:06am",
      "content": "<cite>I think “The World” is more interested in more basic needs like food, shelter, and medicine. If anyone is interested in helping, they can sell their wares of any kind, be they Type Books, fonts, or graphic designs, and donate the proceeds to help those in real need.</cite>\n\nLegible type is going to become essential to providing food, shelter, and medicine in the third world over the next several decades. There are currently several programs (More of Nick Negroponte's work IIRC)that provide solar/people powered satellite internet linkups in Africa which are used by villagers to access VoIP, online information about farming and health, and current market prices (which allow farmers to get the best prices for their goods). Without good type, the information isn't worth much.\n\nOf course this doesn't require every type designer to make a gift to humanity, but some good free fonts certainly won't hurt.\n\n"
    },
    {
      "time": "13 Oct 2006 — 8:55am",
      "content": "\\>It hasn’t fizzled out. When I first learned of open source several years ago, the typographic subgenre was rather slim pickings. It is growing.\n\nAs free fonts get spewed into the public domain they stay there, it's hard to un-public-domain a piece of IP (although some have tried) - so in one way it can’t contract. But as far as serious Open Source (rather than simply free) font development goes there's no growth. If anything those who were interested have lost interest.\n\n"
    }
  ]
}
