{
  "id": "28559",
  "title": "(x) square type on cover The Face - custom design by Neville Brody {Thierry Blancpain (self)}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "im looking for typeface that was designed - if i remember correctly - for the cover and or logo of a magazine in the 90ies (or end of the 80ies). i think i saw it on typophile once, but cant find it anymore.\n\nits made of straight lines and has a similar feeling to [this typeface](http://web.archive.org/web/20061202015306/http:/www.art.ificial.ch/2005/octroy.gif) i did (but without round elements i think, it looked sharper). i thought the name of the magazine was ELEKTRA, but i also remember the S, so elektra is probably not right. i think the type was in red on the cover, but you see that its quite a distant memory ;)\n\nany idea?\n\n",
  "author": "<a href=\"user/7345\" title=\"View user profile.\">thierry blancpain</a>",
  "time": "<br>",
  "uid": "7345",
  "comments": [
    {
      "time": " 3 October, 2006 - 6:32pm",
      "content": "The Face? New Socialist?\n\n"
    },
    {
      "time": " 3 October, 2006 - 6:42pm",
      "content": "no to both. the face isnt straight enough, new socialist is too detailed and playful. but brody could be the designer.\n\n"
    },
    {
      "time": " 3 October, 2006 - 6:52pm",
      "content": "so what about Hard & Heavy ?\n\n\\> for the cover and or logo of a magazine in the 90ies (or end of the 80ies)\n\nnews & politics? lifestyles? style & fashion?\n\n"
    },
    {
      "time": " 3 October, 2006 - 7:16pm",
      "content": "i would say either lifestyle or style & fashion from the picture i have in my head. i know, my memories are so precise! ;)\n\n"
    },
    {
      "time": " 3 October, 2006 - 8:11pm",
      "content": "brody was right, i did some google-search on typophile and found it.. the tricky thing is, it was a face-cover, but the typeface was in a headline, not in the logo.\n\n ![](http://web.archive.org/files/Face842_4651.png)\n\n[http://typophile.com/node/17631](http://web.archive.org/web/20061202015306/http:/typophile.com/node/17631)\n\n“Two months later, the typeface later named Industria appeared in the magazine.” - but [industria on myfonts](http://web.archive.org/web/20061202015306/http:/www.myfonts.com/fonts/linotype/industria/), designed by brody, isnt an exact fit - too round. is it possible to buy this typeface (ELECTRO)?\n\nthank you for your help again, david.\n\n"
    },
    {
      "time": " 5 October, 2006 - 3:31am",
      "content": "any idea if the ELECTRO-typeface is available digitaly?\n\n"
    },
    {
      "time": " 5 October, 2006 - 2:19pm",
      "content": "No. Sorry.\n\n"
    },
    {
      "time": " 5 October, 2006 - 3:43pm",
      "content": "hmm.  \n1. is there a similarly condensed typeface in this style available digitaly?  \n2. whats your take of loosely basing a font on those letters for a personal project? im not nearly good enough to make a professional typeface anyway, so the biggest it could be would be a freefont (but i wouldnt have a problem not releasing it). it would just fit a project i had in mind for months. maybe asking mr. brody would be a way.\n\nshall i start a new thread for this in the appropriate forum?\n\n"
    },
    {
      "time": " 6 October, 2006 - 4:21am",
      "content": "A font like this is extremely easy to slap together. I did a similar one last century (my first and only typeface) based on the lettering of a thriller by Mark Folsom. I think I called that one “Folsom”. It may still be around on the web (although that was in its infancy at the time). Don’t have it anymore myself, sorry…\n\n"
    }
  ]
}
