{
  "id": "28562",
  "title": "!Square Engine",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "The naming debacle is resolved, and I even found inspiration in something [a bit more mechanical](http://web.archive.org/web/20150417051213/http:/en.wikipedia.org/wiki/Square_engine). With a name like !Exclamachine, there should be at least a few industrial-flavored fonts. I now present **!Square Engine** , a font family.\n\n!Square Engine 050 _Defex_  \n!Square Engine 150 _Simplex_  \n!Square Engine 250 _Reflex_  \n!Square Engine 350 _Latex_\n\n144 characters x 4 Styles x 2 weights in each. Includes Euro, Irony Mark, lc accents and more.\n\nThe family is inspired by the European tradition of using model numbers to describe the body & motor combination of a car or bike(and sometimes a name). These four fully-interchangeable monospaced fonts have different wrappers or \"bodies\" (\"0xx\"-\"3xx\"), and share character design, or \"engine\"(the \"x50\").\n\nFuture additions to the !Square Engine family will be numbered similarly, and spaced/scaled to also interchange.\n\n ![](http://web.archive.org/web/20150417051213im_/http:/typophile.com/files/promo-on-burg_3710.jpg)\n  \n(Apologies to Daft Punk ;) ) \n",
  "author": "Choz Cunningham",
  "time": "3 Oct 2006 — 10:02pm",
  "uid": "13605",
  "comments": [
    {
      "time": "3 Oct 2006 — 11:39pm",
      "content": "Great work. Also love Zugzwang.\n\n"
    },
    {
      "time": "4 Oct 2006 — 12:34am",
      "content": "Thank you! Really, thank you very much! I appreciate the feedback because every font I make is both an experiment and an education. I often get frustrated and estatic several times over, because the vision in my head might look nothing like what I had in mind (sometimes better, sometimes not.)\n\nI already have a few sketches for a sister series in the !Square Engine line, give me a few weeks, and I'll post a prototype.\n\nI like to think of my fonts as an open invitation to an artistic collaboration, waiting for whoever might pick it up and use it in a page. The hand off of a baton can be an anxious moment.\n\nOn !Zugwang; Thank you again. ( I peeked at your website: pretty, cool, hip. )Oddly, this is my least favorite font! I'm fairly happy with the letters' shapes, but I find it impossible to really use anywhere. I may revisit it another day. Tonight, I will sleep.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n|\\/|O D Z 4 L 3 T T 0 R Z\n\n"
    },
    {
      "time": "4 Oct 2006 — 10:27am",
      "content": "Including punctuation in font names sometimes leads to heartbreak and technical difficulties even if its techncially legal according to the fonts specs.\n\nCheers, Si\n\n"
    },
    {
      "time": "4 Oct 2006 — 5:19pm",
      "content": "I was at first very apprehensive about that. All the fonts I've made as\"!Exclamachine\" have a \"!\" at the beginning, even though it sometimes isn't included when others refer to them. And it's invalaid in some early specs, but I _believe_ it degrades gracefully.\n\nIf you, or anybody, has any technical problems with the fonts please bring it to my attention immediately. [chozcunningham@exclamachine.com](mailto:chozcunningham@exclamachine.com) If you can tell me what OS, application or printing hardware this has happened on, I will offer all the support I can.\n\nFrom my testing, or from feedback, things seem to function correctly under Win98/NT4/2K/XP/Server 2003, Mac OSX and 3 distros of Linux, Redhat, Ubuntu and Debian. All contemporary Adobe products seem to be okay as well, when bypassing the OS's font management. I've also had good luck with several Windows free/shareware type managers. At this time I am unable, to experiment more in Linux, or Pre-X Macintoshes.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150417051213/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "4 Oct 2006 — 9:18pm",
      "content": "The problems I've seen have been when the font name is referenced in code or CSS - an example being the Monotype font \"Monotype.com\" where the period caused issues when the font name was refferenced in code.\n\n"
    },
    {
      "time": "5 Oct 2006 — 1:09pm",
      "content": "In theory, a good web designer (or software) will replace the \".\" in the above, or the \"!\" in both my foundry and font names with either their (x)html equivalents or unicode descriptors. Of course, in theory, theory is as good as practice.\n\nI may later drop this gimmick, or reserve it only for occasional use.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150417051213/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "14 Oct 2006 — 1:56am",
      "content": "What in the bloody hell is an 'irony mark'????????\n\n"
    },
    {
      "time": "14 Oct 2006 — 1:41pm",
      "content": "Irony Mark? New thread time. I answer here: [http://typophile.com/node/28817](http://web.archive.org/web/20150417051213/http:/typophile.com/node/28817 \"http://typophile.com/node/28817\")\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150417051213/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    }
  ]
}
