{
  "id": "28578",
  "title": "Laser printer recommendations",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Looking to buy a laser printer. Any suggestion on a brand other that HP? I love HP but I rather look for something that is not so pricey if it can be helped. Just looking for something basic that will print good text in Black and White in 8.5 x 11 or even 11 x 17. Doesn’t have to be fast, just reliable. Also, are all laser printers PS printers or just HP?\n\nInput will be greatly appreciated, thanks in advance.\n\n",
  "author": "<a href=\"user/9114\" title=\"View user profile.\">Mister M</a>",
  "time": "<br>",
  "uid": "9114",
  "comments": [
    {
      "time": " 4 October, 2006 - 2:40pm",
      "content": "This Samsung got strong reviews on CNET.com:\n\n[Samsung Printer](http://web.archive.org/web/20061118044835/http:/reviews.cnet.com/Samsung_ML_2571N/4505-3159_7-31954713.html?tag=pdtl-img)\n\n"
    },
    {
      "time": " 4 October, 2006 - 3:50pm",
      "content": "Not sure if this is a real 1200x1200 dpi. It may be a 600x600 with ‘optimization’, which look better than 600x600, but not as good as 1200x1200…\n\nI have another model, which probably uses the same engine. Prints fast, looks good, but not good enough for proofreading 10pt text.\n\nSebastian\n\n"
    },
    {
      "time": " 4 October, 2006 - 9:21pm",
      "content": "Dell has a lot of good deals on cheap laser printers. Regarding brands, try to stay away from oddball brands and go with the good stuff: Lexmark, Xante, KonicaMinolta, Canon, Xerox. I think Dell sells rebranded Lexmark models.\n\nMake sure that you check and see what toner stores in your area stock. If you have to pay $10 to have Okidata ship you toner whenever you run out, it might not make sense to get their printer…\n\nI’ve been having good luck with my KonicaMinolta magicolor 2430DL. I’ve been using it with no hassle for nearly a year, and when I use glossy laser paper, the photographs look almost as good as high-end inkjet prints. Not bad for a $350 printer, especially since I haven’t bought any new toner since I got the printer.\n\n"
    }
  ]
}
