{
  "id": "28572",
  "title": "Magazine Redesign / Switching to a Sans-Serif",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm currently working on a redesign for a magazine. We've decided to switch our body copy from a serif to a sans serif. We've been trying out some fonts, however are trying to find a font that has not been used by any mainstream magazines in the USA. We're drawn to fonts like Akzidenz Grotesk, Meta, and Whitney for their legibility and readability. However we would rather find something more independent with a unique personality. Readability is highest on the priority list. Next would be memorable ligatures and subtleties to the characters that could make the font unique to us.\n\nAny input or suggestions would be greatly appreciated!\n\n",
  "author": "TwoTwoFour",
  "time": "4 Oct 2006 — 9:25am",
  "uid": "14812",
  "comments": [
    {
      "time": "4 Oct 2006 — 9:34am",
      "content": "sans serifs are generally considered harder to read for running texy, especially one with a 'unique personality'. Why must it be a sans?\n\n"
    },
    {
      "time": "4 Oct 2006 — 10:52am",
      "content": "Preference.\n\n"
    },
    {
      "time": "4 Oct 2006 — 11:03am",
      "content": "I think you are limiting your palette if you completely eliminate the use of serif fonts. Perhaps you will use a sans for the main body -- even though I agree with Patty -- but could use serif for small sections or sidebars, etc.\n\nThere are many others similar to Meta and Whitney, such as [Zwo](http://web.archive.org/web/20120729203553/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories_search=font_name_search&searchstr=zwo&image.x=0&image.y=0), for instance. You might also consider [Legato](http://web.archive.org/web/20120729203553/http:/www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufacturer&displayfontid=FF.11433.0.0) or [Megano](http://web.archive.org/web/20120729203553/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories=1&font_categories_search=font_name_search&searchstr=megano) (which has a lovely italic).\n\nThe problem being, of course, that there are soooooo many sans faces that all we can do is give our subjective ideas.\n\n:^)\n\n"
    },
    {
      "time": "4 Oct 2006 — 11:04am",
      "content": "I never said we're completely eliminiting serifs. We plan on using them through the magazine. However the main body copy will be switching to a sans. Thanks for the suggestion!\n\n"
    },
    {
      "time": "4 Oct 2006 — 11:25am",
      "content": "Check out  \n [Kievit and Milo](http://web.archive.org/web/20120729203553/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fonts&CURRROWSPAN=yes&FWDBACK=yes&SEARCHID=1079&SEARCHLETTER=A&CURRPAGESPAN=yes&FONTRENDERERTEXT=AaBbCc%20Handgloves&SEARCHBY=designer&JUMPTO=yes&ITEMSPERPAGE=yes&QUERYNAME=qItems&TOPBOTTOM=bottom&TOTALMSG=no&SEARCHSTR=&PAGELINKS=no&records=20&currpage=2&totalrecords=28&startrow=21) from Michael Abbink, for readability and solid, harmonious looking.\n\nFF Milo is my new Frutiger, hehe\n\n"
    },
    {
      "time": "4 Oct 2006 — 11:45am",
      "content": "FWIW, I agree with Patty. I think it is not simply aesthetic preference, but a fact that it is tiring to read extended text in sans. Well admittedly there's no scientific test to prove that. But I think one day there will be :)\n\nIf you have short blurbs of text, with space between you can get away with more, but otherwise...\n\n"
    },
    {
      "time": "4 Oct 2006 — 11:52am",
      "content": "Alastair,\n\nI'm finishing a serifless roman right now that is designed for extended reading: [Beorcana](http://web.archive.org/web/20120729203553/http:/www.beorcana.com/). Contact me through the typophile form if you'd like to look at it in detail. To further plug my own work, I recently discovered that Gourmet (Sweden) is using Mundo Sans for their editorial and caption face. It seems to work well.\n\n"
    },
    {
      "time": "4 Oct 2006 — 11:54am",
      "content": "[FTF Stella](http://web.archive.org/web/20120729203553/http:/www.felicianotypefoundry.com/main/?page_id=23) was originally designed as a body type for a magazine. I wouldn't say it has a very unique personality, but it's very readable for a sans.\n\n[Priva Pro](http://web.archive.org/web/20120729203553/http:/www.myfonts.com/fonts/dstype/priva/) is probably a more \"unique\" sans, and it has lots of ligatures. However, I'm not sure how it would hold up as body text throughout an entire magazine...\n\nUnique and readable sort of contradict one another. Hmmm...\n\n"
    },
    {
      "time": "4 Oct 2006 — 2:18pm",
      "content": "I don't think there is a law against using a sans as a text face for a magazine. Magazine reading is quite often scanning pages and reading a few here and there. That is hardly immersive reading. The research that has been done has yet to give you a meaningful measure of how much better a given serif face reads. If you prefer a sans, use one. I don't think the serif Sherif will be by to read you your rights.\n\nChrisL\n\n"
    },
    {
      "time": "4 Oct 2006 — 2:35pm",
      "content": "I generally avoid the Sans vs Serif debate. The only time I take the serif side is for book layout. We have plenty of reasons for switching to a sans, mostly demographic/audience. It's just not worth trying to convince people when their views are just as valid.\n\nDezcom; Would your NOW Sans typeface be available for sale anytime soon? I was browsing through the pdf's and would love to use it. Our circulation is a little about 80,000 an issue.\n\n"
    },
    {
      "time": "4 Oct 2006 — 3:06pm",
      "content": "Alastair,  \nNOW isn't quite ready yet but let's talk offline, perhaps we can work out something.\n\nChrisL\n\n"
    },
    {
      "time": "4 Oct 2006 — 3:13pm",
      "content": "NOW you're showing good taste Alastair!\n\nCarl's Beorcana is a knockout also, but quite a different flavor.\n\n"
    },
    {
      "time": "4 Oct 2006 — 3:26pm",
      "content": "William,  \nYou beat me to the punchline!\n\n:-)\n\nChrisL\n\n"
    },
    {
      "time": "4 Oct 2006 — 10:07pm",
      "content": "If you're in the U.S., check out the latest issue of Sunset magazine. They redesigned recently using Underware's Auto, with its many weights and multiple italics, as the sole typeface in the magazine.\n\n\\*EDIT\\*  \nOddly enough, Sunset uses what looks like Whitman (serif, Font Bureau) for about 10 pages (out of 250+) in the feature well. Otherwise, though, it's all Auto all the time.\n\n"
    },
    {
      "time": "5 Oct 2006 — 1:16am",
      "content": "Alastair,\n\ncontact me offline; i’ve been working on a new sans which is finished, but not yet on the market. Maybe it’s what you need. 32 styles, OT, ligatures, etc.\n\nJürgen\n\n"
    },
    {
      "time": "5 Oct 2006 — 4:47am",
      "content": "\"I’m currently working on a redesign for a magazine.\"  \nWhat kind of magazine? What kind of readers?\n\n"
    },
    {
      "time": "5 Oct 2006 — 6:48am",
      "content": "RELEVANT Magazine (relevantmagazine.com)  \nGod, life, progressive culture.  \nTarget audience 18-34 (20somethings)\n\n"
    },
    {
      "time": "5 Oct 2006 — 6:49am",
      "content": "\"Well admittedly there’s no scientific test to prove that. \"\n\nExactly. ;o)\n\nIt's a magazine, folks. Not a 1000 page novel. And people will even read those when printed on newsprint with crappy inks if it's on sale for $4 in paperback.\n\n"
    },
    {
      "time": "5 Oct 2006 — 11:45am",
      "content": "Alastair,\n\nFellow magazine creative director here, with a special interest in redesigns. I've given a couple of presentations on the subject at publishing conferences in the last year, and I'm always interested in learning more about how the process plays out for other publications.\n\nIf you have time to trade a couple of e-mails on the topic, contact me at marco(at)mcmurry.com.\n\nMarc\n\n"
    },
    {
      "time": "5 Oct 2006 — 11:50am",
      "content": "\\>printed on newsprint with crappy inks if it’s on sale for $4 in paperback.\n\nIn a serifed typeface--check it out :)\n\n"
    },
    {
      "time": "5 Oct 2006 — 11:56am",
      "content": "Look at Martha Stewart Living for an effective use of sans serif. You can't buy their typefaces (it was custom made) but it's a successful use of sans serif in a mag.\n\n"
    },
    {
      "time": "5 Oct 2006 — 1:46pm",
      "content": "Jürgen; You have been emailed, I look forward to seeing your work.\n\n"
    },
    {
      "time": "5 Oct 2006 — 2:23pm",
      "content": "How about the sans face [Sebastian](http://web.archive.org/web/20120729203553/http:/www.stormtype.com/typefaces-fonts-shop/families-42-sebastian) from Storm? It has a nice text weight.\n\n"
    },
    {
      "time": "5 Oct 2006 — 10:58pm",
      "content": "Any inclination towards slab?\n\nIn the sans department, [Textaxis'](http://web.archive.org/web/20120729203553/http:/www.textaxis.com/) Latina would be my first choice. Modern interpretation, classic construction, but definitely not typical (read: like Scala or something) -- kind of like RELEVANT magazine, right?\n\n"
    },
    {
      "time": "6 Oct 2006 — 8:20am",
      "content": "Latina is a nice alternative to Bliss or Gill, do you know if it has any more of a family – small caps, aligning numerals etc?  \nTim\n\n"
    },
    {
      "time": "6 Oct 2006 — 11:17am",
      "content": "I have no idea. I tried e-mailing them once, and the reply said that the fonts are specifically designed for [Suite Magazine](http://web.archive.org/web/20120729203553/http:/www.suitemagazine.es/); _but_ they're going to sell part of the catalogue in the future, so there's hope for the rest of us. Mr. Sterne should e-mail them to see if they would make it available for the redesign.\n\nTheir serifs (and humanist sans like Latina) are just irresistible, don't you think?\n\n"
    },
    {
      "time": "7 Oct 2006 — 1:06am",
      "content": "Agreed, my Spanish isn't good but it looks like the designer at textaxis, Iñigo Jerez, is the art director of Suite, which by the way looks very sumptuous. Worth keeping tabs to see if they release Quixote and Latina.  \nTim\n\n"
    },
    {
      "time": "14 Oct 2006 — 10:02am",
      "content": "My problem with sans serifs in editorial settings is that the base weight is just a shade too dark and becomes tiresome to the reader. Linotype Syntax with oldstyle figures has a base weight which I find simply perfect for text. It offers the perfect trade-off between delicacy and strength, and is always clear. Lots of weights make it very adaptable. Try it!\n\n"
    },
    {
      "time": "14 Oct 2006 — 11:19am",
      "content": "Alastair, I think you need to think harder about why you want sans, and if it's really justified. If it's just personal aesthetic preference, that's not Design, that's Art. For one thing, when you state \"Readability is highest on the priority list\" it simply doesn't jibe... Don't get me wrong, it's very possible that a sans would be your best choice, but I just want to caution against closing your mind based on preferences that don't actually benefit your readers/users. Once your basis is sound, then you can find a good solution. Another way I think you should put your readers first is by telling us more about your magazine and its demographic, instead of focusing too much on the context-less formal attributes of your \"ideal\" type choice.\n\nhhp\n\n"
    },
    {
      "time": "14 Oct 2006 — 4:24pm",
      "content": "Agreed,\n\nI would add the audience's psychographic and relevant behavior to that, then we'll be in business. I never saw Relevant in person, as well. Is it sold everywhere, or just on Christian bookstore and the likes?\n\n"
    },
    {
      "time": "2 Feb 2012 — 2:52pm",
      "content": "Sorry to open this back up. Serif fonts look dated to me. I know all of the \"rules.\" I have clients that will not allow us to use serif fonts on their designs. I am okay with that.\n\nI believe sans is the way to go these days for a more modern look. The whole issue about readability is relative. The serifs are harder on my eyes.\n\n"
    },
    {
      "time": "2 Feb 2012 — 3:01pm",
      "content": "\\> The whole issue about readability is relative.\n\nNope.  \nTry digesting tree bark.\n\nhhp\n\n"
    },
    {
      "time": "2 Feb 2012 — 7:35pm",
      "content": "I don't think people are too concerned with maximizing their visual perception, or else why would they wear those narrow-slitted rectangular glasses? Admittedly, the style is foisted on the masses by the spectacles industry, but there nonetheless seems to be a willingness amongst its victims to appear _au courant_, to the detriment of what they see.\n\n"
    },
    {
      "time": "2 Feb 2012 — 7:40pm",
      "content": "One thing to remember is how narrow an angle the _fovea_ subtends.\n\nhhp\n\n"
    },
    {
      "time": "3 Feb 2012 — 7:31pm",
      "content": "Another is that the eyeball moves in its socket, but the frames do not track that movement.  \nSo when one looks down, wearing one’s slitty glasses, the parafovea covering the ground immediately in front of one is not lensed, and the bottom of the frame is visible.\n\n"
    },
    {
      "time": "3 Feb 2012 — 7:57pm",
      "content": "Except while reading our eyes only move laterally.  \nWhen we move down the page our eyeballs don't do  \nmuch vertically - we tilt the neck.\n\nConsidering how central vision is to our existence I  \nhave to think that any pair of glasses that severely  \ninhibits functionality would be rejected by anybody  \nwith half a brain. Which is, like, almost everybody.\n\nhhp\n\n"
    },
    {
      "time": "6 Feb 2012 — 5:22am",
      "content": "\\> I believe sans is the way to go these days for a more modern look.  \nThere are plenty of very modern serif typefaces.\n\n\\> The whole issue about readability is relative. The serifs are harder on my eyes.  \nI don't see how your experience has much to do with people's general experience, however I don't really believe setting a magazine in a sans serif is bad practice per se. I would however still prefer serif. If most of the serif typefaces feel too old to you perhaps look for a slab serif.\n\n"
    }
  ]
}
