{
  "id": "28593",
  "title": "Book About Human Heart",
  "forum": "Design",
  "tags": [

  ],
  "content": "Greetings,\n\nWondering if anyone has any suggestions for possible typeface choices for a book about the human heart?\n\nIt’s a small book (size & length) broken down into four sections, that deal with both the rational and irrational sides of the heart. I’m dealing with history, anatomical structure, emotion and symbolism, so I want an inviting typeface that’s appropriate for both rational and irrational musings about the heart. Obviously some connection with the human heart is desirable.\n\nI’ve been looking at using a sans-serif for the body to give it a more contemporary feeling. It’s not going to be long chunks of copy at once, so I think I can get away with not using a serif for the body. I’ve considered something like Vista Sans or Absara Sans for their contemporary feel and humanist approaches, but I’m second guessing myself now.\n\nI’m hoping someone can offer some alternate suggestions to get me on track.\n\nThanks in advance for any replies.\n\nNick\n\n[edit: I failed to mention that this is meant to be more of a design project than a reference source. I’m somewhat going for style over substance, with a heavy visual treatment. The importance of text and visuals is split 50/50. Having said that, all comments on traditional book design are more than welcome.]\n\n",
  "author": "<a href=\"user/14728\" title=\"View user profile.\">Heise</a>",
  "time": "<br>",
  "uid": "14728",
  "comments": [
    {
      "time": " 5 October, 2006 - 2:54am",
      "content": "Do you want the text to be read or do you want the font to be looked at. Don’t be cute and use something like Vista Sans, it works for ad copy but for a book? Stay with something that will allow the reader to focus on the content of the book and its illustrations.\n\n"
    },
    {
      "time": " 5 October, 2006 - 7:20am",
      "content": "Auto and Dolly by Underware (maybe Sauna instead of Dolly…).\n\n[http://www.underware.nl/site2/index.php3?id1=fonts](http://web.archive.org/web/20061202100459/http:/www.underware.nl/site2/index.php3?id1=fonts)\n\n"
    },
    {
      "time": " 5 October, 2006 - 10:20am",
      "content": "[http://www.typofonderie.com/](http://web.archive.org/web/20061202100459/http:/www.typofonderie.com/)\n\n"
    },
    {
      "time": " 5 October, 2006 - 11:42am",
      "content": "I was about to suggest Dolly as well; it’s organic, and would complement the subject matter well, and reasonably contemporary in look. Plus, it has a really pleasant, even color that looks great even when used pretty densely.\n\nJLT\n\n—-\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20061202100459/http:/www.hewnandhammered.com/) : rnrmf!\n\n"
    }
  ]
}
