{
  "id": "28602",
  "title": "Newfoundland and Labrador - new branding",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Recently the government of the Canadian province in which I live, Newfoundland and Labrador, came out with a new million-dollar branding scheme. The new logo features our provincial flower, the pitcher plant, and what I consider to be a debaucherous bit of type design which is, I guess, supposed to emulate the pitcher plant. I keep picturing the three flowers as space weapons poised to zap the repugnant f into oblivion.  \nWhat does everyone think?\n\n| Attachment | Size |\n| --- | --- |\n| [new logo.jpg](http://web.archive.org/web/20061111004951/http:/typophile.com/files/new%20logo.jpg) | 30.86 KB |\n\n",
  "author": "<a href=\"user/14787\" title=\"View user profile.\">dmajor</a>",
  "time": "<br>",
  "uid": "14787",
  "comments": [
    {
      "time": " 5 October, 2006 - 7:47am",
      "content": "Egads! It’s the Day of the Triffids.\n\n"
    },
    {
      "time": " 5 October, 2006 - 8:07am",
      "content": "i feel sick.\n\nreminds me of Times in Hell by T26.\n\n"
    },
    {
      "time": " 5 October, 2006 - 8:20am",
      "content": "And people wonder why us other Canadians tell Newfie jokes….\n\n"
    },
    {
      "time": " 5 October, 2006 - 8:37am",
      "content": "blaarrgghghhsshewwwoooolllgggggg…(passing out on toilet)\n\n"
    },
    {
      "time": " 5 October, 2006 - 8:42am",
      "content": "UGH\n\n"
    },
    {
      "time": " 5 October, 2006 - 8:54am",
      "content": "“The chances of anything coming from Mars were a million-to-one they said… but still the came”\n\n"
    },
    {
      "time": " 5 October, 2006 - 9:13am",
      "content": "You are pulling our leg.\n\n"
    },
    {
      "time": " 5 October, 2006 - 9:27am",
      "content": "Looks like a job done by two retrievers.\n\nChrisL\n\n"
    },
    {
      "time": " 5 October, 2006 - 10:09am",
      "content": "A very loud AAAAHH from some thousand kilometers away. This must be intelligent fundamental-islamic conspiracy or something… brilliant.\n\n"
    },
    {
      "time": " 5 October, 2006 - 10:11am",
      "content": "St Bernards laden with brandy are scurrying from Switerland to the aid of all canine typographers in Canada.\n\nTim\n\n"
    },
    {
      "time": " 5 October, 2006 - 10:25am",
      "content": "\\>Looks like a job done by two retrievers.\n\nChris, you’re barking up the wrong tree.\n\n\\>This must be intelligent fundamental-islamic conspiracy or something\n\nThat’s right, blame the terrier-ists!\n\n\\>You are pulling our leg.\n\nNot unless CBC is in on the joke - [http://www.cbc.ca/canada/newfoundland-labrador/story/2006/10/03/williams-logo.html](http://web.archive.org/web/20061111004951/http:/www.cbc.ca/canada/newfoundland-labrador/story/2006/10/03/williams-logo.html)\n\n"
    },
    {
      "time": " 5 October, 2006 - 10:37am",
      "content": "ewww\n\n"
    },
    {
      "time": " 5 October, 2006 - 10:47am",
      "content": "I knew it, this thread has gone to the dogs already…. ;-)\n\n(Did you hear the one about the Newfie who won a gold medal at the Olympics? He was so proud, he went out and had it bronzed.)\n\nLinda\n\n"
    },
    {
      "time": " 5 October, 2006 - 10:53am",
      "content": "I knew I could count on you guys to brighten my afternoon! LOL!!!\n\nChrisL\n\n"
    },
    {
      "time": " 5 October, 2006 - 11:11am",
      "content": "Wow… those look like the marker sketches people bring to branding classes before they develop something good looking.\n\n"
    },
    {
      "time": " 5 October, 2006 - 2:31pm",
      "content": "A space mutt smashed on swiss brandy…  \nYes, it is an abysmal logo, but made by an awful company (Target Marketing and Communications). The gifts of the newfoundland typographic proletariat are much greater!! If the government had called upon one of our letterpress printers/book enthusiasts…\n\n"
    },
    {
      "time": " 5 October, 2006 - 2:41pm",
      "content": "You’d get something a lot better. For all the dissing it got when it first came out, I think Chris Pratt’s flag is brilliant — too bad there isn’t a comparable look for the logo.\n\nBet it doesn’t fly in Dildo, either. ;-)\n\nLinda\n\n(There’s a town in NL called “Dildo.” Really!)\n\n"
    },
    {
      "time": " 5 October, 2006 - 2:49pm",
      "content": "They should have asked Strongbad for help with the redesign:\n\n[http://www.homestarrunner.com/sbemail153.html](http://web.archive.org/web/20061111004951/http:/www.homestarrunner.com/sbemail153.html)\n\n"
    },
    {
      "time": " 5 October, 2006 - 3:03pm",
      "content": "Newfoundland used to permit loafing, but then it joined canada and the cold, grey, conservative hand of cookie-cutter provinces like Alberta took away our loafing rights.\n\nFor anyone interested, this is the old (pre-apocalyptic) N&L logo(sorry for the low res):\n\n[http://www.cruisenewfoundland.com/partner\\_images/Logo.jpg](http://web.archive.org/web/20061111004951/http:/www.cruisenewfoundland.com/partner_images/Logo.jpg)\n\n"
    },
    {
      "time": " 5 October, 2006 - 3:52pm",
      "content": "Nice to see deconstructed fonts and Illustrator 88 icons coming back into fashion.\n\n"
    },
    {
      "time": " 6 October, 2006 - 6:59am",
      "content": "Now, now. every once in a while, step back, take a deep breath and put yourself in the shoes of the target audience.\n\nI’m not sure who that is in this case, but I’ll try to do it anyway. I’ve got an elastic-bound candy necklace around my neck, and I’m inching the first candy link up my chin via the miracle of stretchiness to take that delicious bite. I’m feeling closer to this logo. I’m doing this while I’m speeding along in the back seat of my parents Quebec registered car…I’m feeling closer. I see the sign through the streaming red hair of my dolly, who’s hanging out the window, and it hits me, she’s so lucky she doesn’t have to wear a seat belt. I’m feeling it for sure now. I can see the sign! and I shout in my shrill little voice, “MOMMY! DADDY! Can we go da New Found Land and Laber Door!?” And Mommy says, “We’re almost there Barbie dear!”\n\n"
    },
    {
      "time": " 6 October, 2006 - 8:52am",
      "content": "And mom’s name is Della Ware?\n\n"
    },
    {
      "time": " 6 October, 2006 - 11:04am",
      "content": "The good news is that logo should look dated by the time they use it, thus an immediate call for a new redesign. Money makes the world go round…\n\n"
    },
    {
      "time": " 6 October, 2006 - 11:22am",
      "content": "Just today on the radio some Newfoundland polititian was talking about how they needed to take them selves more seriously - And, now this?\n\nReminds one of the recent [Ontario rebranding effort](http://web.archive.org/web/20061111004951/http:/www.rebelsell.com/blog/2006/7/24/political-meddling-as-brand-idiocy.html#comments)\n\n"
    },
    {
      "time": " 6 October, 2006 - 1:49pm",
      "content": "Here’s a quote from our premier, giving clues as to the intended audience:\n\n“We have been working hard to promote Newfoundland and Labrador as a spectacular tourism destination, a smart place to invest and do business, and a preferred place to live, work and raise a family. And while we have been very successful, this new brand will help further position the province at the forefront of a competitive global marketplace. When people see this brand, they will see a people and place that are resourceful, innovative and energized.”\n\nPersonally, I find that frightening.  \nThey say the type was Celtic-inspired.\n\n"
    },
    {
      "time": " 6 October, 2006 - 2:08pm",
      "content": "Ah, yes, Danny Millions…. :-(\n\n_When people see this brand, they will see a people and place that are resourceful, innovative and energized._\n\nAnd who have all moved to Fort McMurray to buy Ford Bonaventures.\n\nLinda\n\n"
    },
    {
      "time": " 6 October, 2006 - 2:48pm",
      "content": "This isn’t a joke, ahh:\n\n“How will the world know and recognize Newfoundland and Labrador? It will know us for our pride and passion. Our unique way of looking at the world. And our creativity. Creativity that runs deep within our culture and in our DNA. That helps us adapt in a harsh and unforgiving environment, through the wind and the rain, the sleet and fog. It’s our fierce determination and tenacity that give us the strength to rise above it all, facing the sun and the future with youthful optimism.  \nJust like the pitcher plant. A plant so odd, yet so comfortable in its own skin. So tough, yet so adaptable. A survivor, fighting whatever comes its way with a resilience like no other plant on Earth.  \nIt’s a symbol that reflects who we are and what we stand for. It’s how the world will recognize us and know us. It’s a symbol that speaks our language. And a symbol that’s as unique as the people who live here, in every corner of Newfoundland and Labrador. One symbol, one voice. True to who we are. And true to this place we call home.”&nbsp;\n\n[http://www.gov.nl.ca/brand/brand\\_gallery.htm](http://web.archive.org/web/20061111004951/http:/www.gov.nl.ca/brand/brand_gallery.htm)\n\n\\> Creativity that runs deep within our culture and in our DNA  \nThis is more creative:\n\n[http://learn.genetics.utah.edu/units/activities/extraction/](http://web.archive.org/web/20061111004951/http:/learn.genetics.utah.edu/units/activities/extraction/)\n\n"
    },
    {
      "time": " 8 October, 2006 - 10:06am",
      "content": "I almost feel compelled as a canadian designer to write to the company and express my dislike for the logo. Not to mention the amateurish use of type and illustration. Maybe in the future people will take time and money to invest in using good type.\n\nI feel bad for N&L, their old one was much more sophisticated.\n\n"
    },
    {
      "time": " 8 October, 2006 - 1:29pm",
      "content": "Hey come on. There’s an axiom: every client gets what he (or she) deserves…\n\nIt doesn’t get me really excited about New Foundland ; )\n\n"
    }
  ]
}
