{
  "id": "28615",
  "title": "The worst thing to get in your inbox",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "is probably a subpeona from your Ex, the newly elected District Attorney. This isnt that bad, but it isn't good. _Please read all of this, the community's insight is prety important to me._\n\nI went through a personally dictated [naming crisis](http://web.archive.org/web/20131014193909/http:/typophile.com/node/28510) for my latest free font family. Despite the idea that it might be okay to use an existing name (since the context was so different), it finally didn't sit right with me.\n\nThen I settled quite happily on the name [!Square Engine](http://web.archive.org/web/20131014193909/http:/typophile.com/node/28562). Sassier, more fun, more 'techno'. Each substyle was then assigned a model number, 050, 150, 250 and 350. Finally, I gave each a visual nickname, since #s are a little sterile. They were **Apex, Simplex, Reflex** and **Latex**. I even made humourous bio's for each font on my site. The notices embedded in the fonts themselves mention only !Exclamachine and !Square Engine for copyright or trademarks.\n\nSo, a name might look like this **!Square Engine 350 Latex Bold\"**.\n\nToday I recieved a letter from a vendor that sells a font named the same as one of these substyle nicknames. Politely, they informed me of their font's existence. They claim it was first developed in 2003, and substantially used in the type world. They request I pick another word. They suggest I use Google. I normally use myfonts for name research. This is where it gets interesting.\n\nWhen I picked the nicknames, I saw there were fonts by those names already (except for Latex, which is a whole 'nother thing), but I considered the likelyhood of confusing a tertiary (redundant) naming of a !Square Engine variant to be slim at best. I was more worried about getting wrath from the makers of \"Square 721\" or \"Allied Engine\".\n\nSo, I just googled the debated term, along with the word font, since it is so common, and found that there was a font freely available in 1994 (no designer/vendor info), and a commercial font from Elfring Soft Fonts, re-released in retail packs in 1994. Then I find two links to the generic term's typographic definition. Further down the page, the results show the font who's creators contacted me.\n\nNow, really, what do I do? I voice-mailed a lawyer-friend, but I don't think IP is her bag. This is a free font, so my liability is low, but I was planning on releasing a commerical version in the next 6 months. When I find there are pages [like this](http://web.archive.org/), I find the whole names thing hard to take seriously. If I drop every word that anyone has used in any font anywhere, all I'll be able to call them is !1, !2 (If that!)\n\n",
  "author": "Choz Cunningham",
  "time": "5 Oct 2006 — 2:07pm",
  "uid": "13605",
  "comments": [
    {
      "time": "5 Oct 2006 — 2:48pm",
      "content": "Those guys would likely have good lawyers, and I'd guess that the trademark registration is real (many fonts claim TM when no TM has actually been registered). Maybe change it to \"Perplex\" - that should keep the lawyers at bay.\n\n"
    },
    {
      "time": "5 Oct 2006 — 2:49pm",
      "content": "Hello all. Chester from Village here to set the record straight.\n\nI had indeed sent an email to Ms/Mr Cunningham concerning the weight name of \"Apex\" which had been assigned to a font from the \"!Square Engine\" family.\n\nFirst, let's clear up a couple of things from the original post.  \n1. I wrote to Mr/Ms Cunningham via email to save any embarassment which might result from a public airing of this little matter on Typophile.  \n2. I didn't send a letter.  \n3. I prefer \"designer\" to \"vendor\" in the case of my Apex types.  \n4. I don't claim that the Apex Sans type family was published in 2003, it WAS published in 2003.  \n5. Not all typefaces available in the universe are listed on MyFonts, so a search of MyFonts is far-from-complete in terms of research. If one googles \"Apex + typeface\", the first listing is for Apex New on the Village site. (The \"Apex\" font which comes up in a Google search for \"Apex + font\" is actually a pirate version of Aachen. The word \"font\" is an html tag which probably appears on 99% of all web pages, so produces many false returns. \"Apex + font\" = 774,000 returns versus 24,500 for \"Apex + typeface\".)\n\nThe multiple-name structure of the \"!Square Engine\" font-naming scheme seems more than a little confusing to me, but who amongst us hasn't had our moments of levity? I only worry about the confusion that might emerge from this use of so many names, including names of existing typefaces. (The fact that \"Apex\" is trademarked is both beside the point and also at the heart of the matter.)\n\nAnyhow, I have no intention of making this into a big deal, if Ms/Mr Cunningham does the same. I'm not going to have my lawyer contact Mr/Ms Cunningham's lawyer; I simply noted, \"Hopefully this information will convince you to rename your 'Apex' weight.\" In my experience, type people are quite logical and they do the right thing if they ever find themselves mistakenly standing on a colleague's toes.\n\nWith very best regards to the Typophile community,  \nc\n\n"
    },
    {
      "time": "5 Oct 2006 — 3:00pm",
      "content": "Hi Chester! I hope all is well with you.\n\nChrisL\n\n"
    },
    {
      "time": "5 Oct 2006 — 3:33pm",
      "content": "\\> find the whole names thing hard to take seriously\n\nSadly, names are essentially all a designer has to legally protect their work, so have to be taken seriously. Stepping on someone's name will often result in a nastygram from their lawyer, or more often than not, a more friendly email from the owner (which seems to be the case here).\n\n"
    },
    {
      "time": "5 Oct 2006 — 3:52pm",
      "content": "Sii -  \nDarnit, I already had plans for that term, see below. But at least you recognize the value of the stress and rhyme! :)\n\nChester -  \nThe record was more or less straight. 1-4: It was a letter, sent via email. You are the designer and, via your involvement in Village, also the vendor, though I only knew the latter for certain until I researched the font's history. If it was created in 2003 (and I am not loony enough to think otherwise) and you tell me, then you still 'claim' it, even if it is true. :)\n\n(I am a Mr. Or, at least, a 'he'. Just for the record.)\n\nI appreciate you contacting me first, rather than here. I tried to leave it ambigous in my post, so that you would not feel coerced into a public debate you did not desire. It just happens that this is the place to find people who deal with this stuff, and I really wanted their feedback. To be clear, I didn't come to complain about you or your actions in any way, only the situation I was in. And no flock of lawyers are gathering, I just mentioned that I was going to talk to a friend so everyone wouldn't tell me to get a lawyer. We just play video games together.\n\n5. Hmm, I think you are right, \"typeface\" would be a much better modifier for researching in the future. Or, first that, then with 'font'. I will make use of that in the future, for certain.\n\nI brought this here, because I am of more than two minds. First, I am inclined to just go with the flow; you asked, my mortgage isn't riding on the issue, you were polite and clear. Second, you may be right, and I will appear as a hack, jerk or otherwise naughty person, that mixes with my novice stature to create a poor reputation quickly. I enjoy type design, and have no interest in being a type troll.\n\nAt this point the only places that I have mentioned it are here, my blog and @ exclamachine.com, and two of those are easy for me to edit. :)\n\nOn the other hand, while I don't want it to be a big deal either, I want to do what is most abstractly correct, and gain a better understanding of what I can do with a name. This _perhaps_ means not acquiescing, if it is not the proper stance to take.\n\nAs I mentioned earlier the makers of the faces Simplex TR (Monotype) or Relflex (Sudtipos) might ask the same of me later. Or demand. And, I might be selling an OpenType fancy version at the time. I also already had plans to add a 4xx 'Perplex'(wavy) 5xx 'Vertex' (double border) and 9xx 'Index' (graduated) versions. I cannot change the names over and over, so must I change them now? Again, all but one of those, could put me at risk of more complaints, while I see other foundries share face names like lovers do spit.\n\nI meant them to just a little flourish, inspired by the idea of a Toyota MR2 Spyder and the Fiat 850 Spyder; or, The Triumph TR7 Spyder, for that matter.\n\nI feel trapped, and while that is not your problem, I am trying to deal with it as rapidly as possible to reach a decision to your satisfaction, as well as my own. I am sorry if bringing it here made you uncomfortable, or left you feeling misrepresented. !Exclamachine fonts are designed to portray levity, funkiness and lightheartedness. And rocketships. I want this ambience to affect all things about my fonts, and how I am seen in the community. Please, bear with me.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20131014193909/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "5 Oct 2006 — 4:00pm",
      "content": "\\> Sadly, names are essentially all a designer has to legally protect  \n\\> their work, so have to be taken seriously.\n\nI agree, and I do take it seriously. I just meant it is sincerly difficult, considering the above link, but I have taken time and thought to appreciate this before (as well as your input). I just don't think things are working right when the big foundries have all the good names they want regardless of who else has it, but the 'little guys' have to scramble for anything remotely pronouncable, then, for fear of [something] draw an oversized circle in the sand to protect it. Or, find a good name, then have no idea if they can use it.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20131014193909/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "5 Oct 2006 — 4:25pm",
      "content": "I think if Village had reserved the name Apex, but had not yet released it, you would have a point. But, because Apex has been available for 3 years now it is a little unfair, just a tad?, to accuse them of having an unfair advantage.\n\nI feel for you. Naming is probably quite a challenge. But a necessary evil, no?\n\n"
    },
    {
      "time": "5 Oct 2006 — 4:46pm",
      "content": "I'm not saying that he has an unfair advantage in any way. Whatever it is that allows some MAJOR foundries to share names verbatim, That's the unfair advantage. Meanwhile he must be so vigilant about anything somewhat similar is the sad part.\n\n\\>But a necessary evil, no?\n\nI don't know. The naming part is quickly losing its charm. I am afaid that my font names will become just long scrambled strings of characters, out of fear of doing anything slightly like anything anyone has ever done anywhere ever. The compliments for the choices of names had actually been something of a motivator to continue previously.\n\nMaybe I'll switch to purely goofy mispellings, !BaZkeT uv hammmmmmers, !SKWAYR NGN... Ugh. I think I need to go for a walk.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20131014193909/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "5 Oct 2006 — 5:24pm",
      "content": "You are blowing this way out of proportion. Just change the name.\n\n—K\n\n"
    },
    {
      "time": "5 Oct 2006 — 6:17pm",
      "content": "That fixes Chester's problem right now, but doesn't do anything to help me resolve the bigger picture. The porportions vary, depending on perspective.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20131014193909/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "5 Oct 2006 — 6:50pm",
      "content": "If so-called major foundries are sharing names:\n\nA) Show some examples so maybe we can explain why.  \nB) They've made a legal/financial agreement to do so. (I'd guess.)\n\n"
    },
    {
      "time": "5 Oct 2006 — 7:09pm",
      "content": "What is the bigger picture? That you want to use a name that is already in use? Everybody else who is making typefaces seem to be doing alright.\n\nLike I said before: just change the name.\n\n—K\n\n"
    },
    {
      "time": "5 Oct 2006 — 7:10pm",
      "content": "\\>A) Show some examples so maybe we can explain why.\n\nMaybe Choz is thinking of something like Garamond? Some names are in the public domain, and until a clever lawyer manages to register them, they're free for all to use, not just 'major foundries'. Maybe?\n\n"
    },
    {
      "time": "5 Oct 2006 — 7:18pm",
      "content": "Si, that is what I was thinking. Or perhaps how some foundries sell other foundries work such as Adobe selling Linotype. Or if you search on MyFonts for \"Aachen\" you get several different foundries with that same font and fontname ... on FontShop too.\n\n"
    },
    {
      "time": "5 Oct 2006 — 7:58pm",
      "content": "Sii, Tiffany -  \nthose are both examples of some of what I am referring to. In the first post I linked to\n\n[http://www.myfonts.com/fonts/linotype/times-roman/familytree.html](http://web.archive.org/web/20131014193909/http:/www.myfonts.com/fonts/linotype/times-roman/familytree.html \"http://www.myfonts.com/fonts/linotype/times-roman/familytree.html\")\n\nThat was what I meant by hard to understand/take seriously.\n\nAll individual words are in the public domain. that's about copyright, and I am not up for that one at this moment. Times and Roman are just words to be used, though they _may_ be trademarked in relation to a distinctive font. I think that means they couldn't be used together or apart in a way where one would think they were looking at the Mark holder's font.\n\nFrom the page, \".... Both Linotype and Monotype claim trademark rights in spite of the origin at The Times.\" So who is right. Why hasn't one budged? Related to that, why do difrerent foundries sell each other's fonts, and then claim thier own trademarks on them, or alter the fonts but not change the names? It all seems screwy to me.\n\nAnd most specifically, there are \"Roman\" versions of many fonts, many have nothing to do with Times (x) Roman. When is the version part of the name and when is it just a descriptor? Is one limited to what ever popular style variants are only in a common list, ie; Bold, Demi, Cond/Condensed, Italic?\n\nkris -  \nThis is a forum, what you last said is still right there in the thread. Thank you for your input.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20131014193909/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "5 Oct 2006 — 8:09pm",
      "content": "The Code of Federal Regulations:  ``The following are examples of works not subject to copyright and applications for registration of such works cannot be entertained: . . .typeface as typeface ' 37 CFR 202.1(e).\n\n The House of Representatives report that accompanied the new copyright law ( passed in 1976):  \n ``The Committee has considered, but chosen to defer, the possibility of protecting the design of typefaces. A 'typeface' can be defined as a set of letters, numbers, or other symbolic characters, whose forms are related by repeating design elements consistently applied in a notational system and are intended to be embodied in articles whose intrinsic utilitarian function is for use in composing text or other cognizable combinations of characters. The Committee does not regard the design of typeface, as thus defined, to be a copyrightable 'pictorial, graphic, or sculptural work' within the meaning of this bill and the application of the dividing line in section 101.'' H. R. Rep. No. 94-1476, 94th Congress, 2d Session at 55 (1976), reprinted in 1978 U.S. Cong. and Admin. News 5659, 5668.\n\n++++++\n\nWarning: I'm not a lawyer\n\n"
    },
    {
      "time": "5 Oct 2006 — 8:18pm",
      "content": "Times is an interesting one, and I think its a unique case - probably well documented in some scholarly journal. I think the simple answer is that \"Times New Roman\" is a Monotype TM, \"Times Roman\" is a Linotpye mark, \"The Times\" is of course owned by Newscorp, as is the \"Times Classic\" name, with co-existence agreements in place amongst the parties? However no one here is a TM attorney so who knows. Any other examples?\n\n"
    },
    {
      "time": "5 Oct 2006 — 8:19pm",
      "content": "David, what do copyrights have to do with this discussion??? Just wondering?\n\n"
    },
    {
      "time": "5 Oct 2006 — 8:23pm",
      "content": "Thank you, I was looking for that earlier! It relates indeirectly i suppose. I feel that the above information has left type artists very touchy, since the very essence of the work, its design, has be left apart from the protections offered to most other American media. I don't know why it is like that, but it is. Has that left us all more touchy about the names themselves, in reaction? For example, the revers is far more common: a movie name is reusable by other movies (not just licensed remakes, but unrelated works) but the movie itself isn't so free.\n\nAlso, in digital type, isn't the work still copyrightable, and possibly patentable, as software instead?\n\n"
    },
    {
      "time": "5 Oct 2006 — 8:46pm",
      "content": "Sii, what about other fonts that use times in their names? examples\n\n[http://www.myfonts.com/fonts/elemeno/times-kangaroo-down/](http://web.archive.org/web/20131014193909/http:/www.myfonts.com/fonts/elemeno/times-kangaroo-down/ \"http://www.myfonts.com/fonts/elemeno/times-kangaroo-down/\")\n\n[http://www.1001fonts.com/font\\_details.html?font\\_id=942](http://web.archive.org/web/20131014193909/http:/www.1001fonts.com/font_details.html?font_id=942 \"http://www.1001fonts.com/font\\_details.html?font\\_id=942\")\n\n[http://www.deviantart.com/deviation/26240258/](http://web.archive.org/web/20131014193909/http:/www.deviantart.com/deviation/26240258/ \"http://www.deviantart.com/deviation/26240258/\")\n\nAnd thank you for all your time and thought on this subject.\n\n"
    },
    {
      "time": "5 Oct 2006 — 8:49pm",
      "content": "Mr Murdoch's lawyers are probably working on other cases right now.\n\n"
    },
    {
      "time": "6 Oct 2006 — 3:44am",
      "content": "Miss Tiffany:\n\n\\> I think if Village had reserved the name Apex, but had not yet released it, you would have a point. But, because Apex has been available for 3 years now it is a little unfair, just a tad?, to accuse them of having an unfair advantage.\n\nJust a tad?\n\nTrademark law is based on the principle of priority. Therefore the Village outfit (or Mr. Chester Jenkins) cannot claim the word \"Apex\" (by the way, it is a Latin word) as a trademark for the \"Village\" font \"Apex\", because the \"Village\" font \"Apex\" was published in 2003, whereas the \"Elfring\" font \"Apex\" was published many years before the year 2003:\n\nsee [http://www.sanskritweb.de/files/apex.gif](http://web.archive.org/web/20131014193909/http:/www.sanskritweb.de/files/apex.gif \"http://www.sanskritweb.de/files/apex.gif\") (dated 3rd July 1996)\n\nThe \"Elfring\" font \"Apex\" is \"traded\" (= sold) ever since, for instance on the Herlitz font collection CD 2002, so that the trademark \"Apex\" of the \"Elfring\" font \"Apex\" is still in use.\n\nsee [http://www.forgers.de/forgers/herlitz.pdf](http://web.archive.org/web/20131014193909/http:/www.forgers.de/forgers/herlitz.pdf \"http://www.forgers.de/forgers/herlitz.pdf\") (pages 2, 79)\n\nsee also the Elfring website [http://www.elfring.com](http://web.archive.org/web/20131014193909/http:/www.elfring.com/ \"http://www.elfring.com\")\n\nThe statement by Chester Jenkins that the \"Elfring\" font \"Apex\" \"is actually a pirate version of Aachen\", does not have an influence on the trademark law, because in the funny font forging industry, even font forgeries may be trademarked. Examples:\n\n\"Arial\" is trademark of a font forgery of \"Helvetica\".  \n\"Segoe\" is a trademark of a font forgery of \"Frutiger\".  \n\"Apex\" is a trademark of a font forgery of \"Aachen\".\n\nIncidentally, there are many forgeries of the font \"Aachen\", partly traded under the trademark \"Aachen\", partly traded under other trademarks. For examples of other \"Aachen\" forgeries study my website.\n\nIf Mr. Chester Jenkins were allowed to use the trademark \"Apex\" for the \"Village\" font \"Apex\", then also Mr. Choz Cunningham were allowed to used the trademark \"Apex\" for his font. But due to the priority of the trademark \"Apex\" originally coined by the font forging outfit \"Elfring\" for the forgery of the font \"Aachen\", neither Mr. Chester Jenkins nor Mr. Choz Cunningham are allowed to use the trademark \"Apex\", irrespective of whether the fonts by Mr. Chester Jenkins and by Mr. Choz Cunningham are forgeries or not.\n\nDe lege ferenda (by a future legislation), the trademark law should disallow the use of trademarks for forgeries of commodities. Yet after the enactment of such a future trademark law, most fonts (\"Arial\", \"Segoe\", \"Apex\" etc. etc.) would be nameless, because thousands and thousands of fonts are forgeries.\n\n"
    },
    {
      "time": "6 Oct 2006 — 7:39am",
      "content": "Roman is a classification, like Regular or 55, I find it difficult to believe that a lawyer would be able to demonstrate otherwise although I suppose TNR would be the one to prove that with.\n\nBut it is surely the end user who should be considered here, if there are two fonts with substantially different names but could end up being called Apex in a studio or between client and designer (both can be equally clueless about giving a full name and confusion _does_ happen) it seems fair (to a potential user) that the less established should look for another name, personally I quite like the numerical system you have developed.\n\nTim\n\n"
    },
    {
      "time": "6 Oct 2006 — 8:22am",
      "content": "Hello again.\n\nFirst, I would like to point out that the Aachen clone mentioned by \"Uli\", and trademarked by Elfring is named \"Aapex\", not \"Apex\". I'm pretty sure that I saw this typeface in my searching for conflicts with the Apex name, but felt that we were safe because; 1) The words were not the same, and 2) The Aapex font was clearly a rip-off of Aachen, down to the \"Aa\" in its name.\n\nAs far as who gets to name their fonts what they want to... It's not about large versus small foundries, it's about who was first. If one of the large foundries came along with an \"Apex\" typeface, I would not roll over for them because they are bigger. We had the name in 2003, when the type family was initially published; we didn't \"squat\" on the name for a few years.\n\nI had not threatened Mr Cunningham - and thank you for clearing that up; I felt silly with all of the Mr/Ms stuff - with legal action, but merely pointed out that one of his colleagues - namely me - had already released a typeface named Apex, which had already gained a certain market presence. I asked him to consider another name, since it's always best to avoid confusion in the marketplace. I was relying upon Mr Cunningham's professional courtesy to \"do the right thing.\"\n\nAs Mr Daniels pointed out, a typeface's name is really very important to the marketing and awareness of that typeface, which is why professional type designers and publishers are so concerned with finding a unique, memorable, and appropriate name for their wares.\n\nI hope that Mr Cunningham will reconsider his use of previously-used names, regardless of trademark status, as he joins the type industry/community.\n\nWith best,  \nc\n\n"
    },
    {
      "time": "6 Oct 2006 — 10:38am",
      "content": "Chester Jenkins:\n\n\\> First, I would like to point out that the Aachen clone mentioned by “Uli”, and trademarked by Elfring is named “Aapex”, not “Apex”.\n\nThat is correct: A Apex (\"peak of A\"), (not Apex alone).  \nBut the same holds true for \"ApexSans\" (not Apex alone).  \nAnd holds true for \"Square Engine Apex\" (not Apex alone).\n\nSo \"ApexSans\" is a trademark infringement concerning the prior Elfring trademark.\n\n\\> The Aapex font was clearly a rip-off of Aachen\n\nI repeat: In trademark matters, it is irrelevant whether \"Aapex\" and \"ApexSans\" are \"rip-offs\".\n\nYou may also label \"ApexSans\" as a \"rip-off\". For instance:\n\nThe \"A\" of \"ApexSans\" is a \"rip-off\" of a \"A\" from  \n [http://www.forgers.de/letters/char\\_aa.pdf](http://web.archive.org/web/20131014193909/http:/www.forgers.de/letters/char_aa.pdf \"http://www.forgers.de/letters/char\\_aa.pdf\")\n\nThe \"B\" of \"ApexSans\" is a \"rip-off\" of a \"B\" from  \n [http://www.forgers.de/letters/char\\_bb.pdf](http://web.archive.org/web/20131014193909/http:/www.forgers.de/letters/char_bb.pdf \"http://www.forgers.de/letters/char\\_bb.pdf\")\n\netc. etc. (see [http://www.forgers.de/letters](http://web.archive.org/web/20131014193909/http:/www.forgers.de/letters \"http://www.forgers.de/letters\") for the other letters)\n\nBut as I said: It is irrelevant here whether \"Aapex\" and \"ApexSans\" are \"rip-offs\".\n\n"
    },
    {
      "time": "6 Oct 2006 — 10:52am",
      "content": "Tim Daly:\n\n\\> Roman is a classification, like Regular or 55, I find it difficult to believe that a lawyer would be able to demonstrate otherwise although I suppose TNR would be the one to prove that with.\n\nAs regards \"Times New Roman\" etc. read the section \"Acquired distinctiveness\" in the Wikipedia \"Trademark\" overview article, where it is stated: \"... the right to use the mark and the registration may become \"incontestable\".\n\nsee [http://en.wikipedia.org/wiki/Trademark](http://web.archive.org/web/20131014193909/http:/en.wikipedia.org/wiki/Trademark \"http://en.wikipedia.org/wiki/Trademark\")\n\nFor more details consult a textbook on trademark law.\n\n"
    },
    {
      "time": "6 Oct 2006 — 11:47am",
      "content": "To wrap it all up------------------\n\nI am renaming the typefaces in question to \"!Square Engine 050 Defex\" and \"!Square Engine 050 Defex Bold\" tonight.\n\nWhether it is the name of one font or another, it makes several people uncomfortable to be used as a generic classification term. I have found so many things in the font world to explore, and seek to see this resolved promptly, so that I may continue. I see this exact situation as playing nice, but I hope that everyone takes note of the issues it brought up.\n\nAs far as I understand, there is some way to make the non-standardized stylistic variants appear as submenu items, rather than being forced into the title-space, at least on some operating systems. Does anyone have any more details on that? I think it might have helped soothe things in this case a lot.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20131014193909/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "6 Oct 2006 — 1:08pm",
      "content": "This seems like quite the naming legal issues that screwed many in the industry by company B that for the sake of all involved shall remain nameless.\n\nWhile of course this isn't as severe since no legal action has been threatened— I don't see the logic. Clearly, this is a subject that has gray area— particularly when said publisher carries a typeface with a name similar to a well-known classic. It should also be noted that it is imperceptible to the human ear which typeface is being referred to when spoken. Univers or [Eunuverse](http://web.archive.org/web/20131014193909/http:/www.vllg.com/Thirstype/Eunuverse/mudTyper+Weights)?\n\nI didn't think common words could be trademarked? I think I'll call a typeface \"the.\" Nope, \"The Sans\" already exists. Well then \"Apex Sans\" seems to be sufficient to avoid confusion.\n\n"
    },
    {
      "time": "6 Oct 2006 — 1:29pm",
      "content": "Mr Cunningham,  \nthis has all become far too Kafka-esque for me...\n\nI thank you for choosing to rename the \"Apex\" version of your typeface as \"Defex\". And I wish you luck with the other foundries whose names you are also using: \"As I mentioned earlier the makers of the faces Simplex TR (Monotype) or Relflex (Sudtipos) might ask the same of me later.\"\n\nI wish you luck and best wishes.  \nc\n\n"
    },
    {
      "time": "6 Oct 2006 — 9:26pm",
      "content": "This came down to a personal decision, regardless of the legal fine points. If there is a next time, we'll see what happens. Perhaps I'll get the styling out of the namespace by then. Perhaps I'll be the world's first stinkin' rich type designer, and just throw gobs of money at all my problems. ;)\n\n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20131014193909/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "7 Oct 2006 — 1:29am",
      "content": "Uli,  \nThanks for the link, looks like font bundling _could_ change classification, on the other hand descriptive use would seem to negate any attempt to trademark Roman on its own or to stop others using it to _honestly_ describe their typeface.  \nTim\n\n"
    },
    {
      "time": "7 Oct 2006 — 5:33am",
      "content": "Tim Daly:\n\nAs you surely saw at [http://www.uspto.gov/main/trademarks.htm](http://web.archive.org/web/20131014193909/http:/www.uspto.gov/main/trademarks.htm \"http://www.uspto.gov/main/trademarks.htm\")\n\n\"Times New Roman\" is registered for Monotype, and  \n\"Times Roman\" is registered for Linotype\n\nBut in both cases, only the FULL word expression is registered, not the single words. As regards \"Roman\", the registration at the above link contains the disclaimer:\n\n\"No claim is made to the exclusive right to use \"Roman\", apart from the mark as shown.\"\n\nGenerally speaking, any substantive (noun) used to denote a class of commodities (e.g. \"Font\") and any adjective used to characterize a class of commodities (e.g. \"Italic\") is excluded from registration as a trademark for THIS GIVEN class of commodities. However such words may be registered as trademarks, if they do NOT denote or characterize a given class of commodities, i.e. if they are used as trademarks for OTHER classes of commodities.\n\n- For example, the word \"Roman\" is registered for a specific brand of meal bread by the American Roman Meal Company. This was permitted, because the word \"Roman\" has nothing to do with bread.\n\n- For example, the word \"Antiqua\" is registered for a specific brand of kitchen faucet by the German Hansgrohe AG. This was permitted, because the word \"Antiqua\" has nothing to do with a faucet.\n\nIn the font business, however, \"Roman\" (in English-speaking countries) and \"Antiqua\" (in German-speaking countries) denote a specific class of fonts (i.e. non-italic old-style fonts). Therefore it is not permitted to register the word \"Roman\" alone or the word \"Antiqua\" alone as a trademark for a specific font.\n\n"
    },
    {
      "time": "7 Oct 2006 — 5:45am",
      "content": "No, I looked at this site  \n [http://www.patent.gov.uk/tm.htm](http://web.archive.org/web/20131014193909/http:/www.patent.gov.uk/tm.htm \"http://www.patent.gov.uk/tm.htm\")\n\nTim\n\n"
    },
    {
      "time": "7 Oct 2006 — 12:41pm",
      "content": "Just wanted to send a quick apology to Chester. I think my post sounded a bit sarcastic and I apologize for coming off like a \"big meany.\" :)\n\nUli brings up some good points and articulated his point a little better than I may have. The bottom line is for me, if you use a common English word in the name of your font, there might be naming problems later on down the line. And as I illustrated, it seems to be pretty common to walk the line of font naming ambiguity.\n\nAdditionally, before you decide on a naming system you should check trademarks, patents and all that other fun stuff before you settle on names. It will save you trouble in the long run. Imagine if Frutiger gave each width and weight of Univers a different name...it'd get confusing and a bit ridiculous eventually.\n\nI'm sure both sides had good intentions and I'm glad the issue has been settled. This is a very good thread as it discusses a lot of issues that aren't often talked about in the type \"bit-ness.\" Well, at least to us lay-folk...\n\nWhat's with the 800 lb. gorilla threads lately? As Martha says, \"its a good thing.\" :)\n\n"
    },
    {
      "time": "7 Oct 2006 — 5:58pm",
      "content": "_What’s with the 800 lb. gorilla threads lately?_\n\nI think some of it comes from just being a good place to talk about what is at hand. The readership must be immense. Signifigant/famous type and graphic designers, and type technology developers chime in right alongside pleasant regulars, and newbies are made pretty comfortable. Plus, the posts' collective coherence here blows the doors off of other forums.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20131014193909/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "8 Oct 2006 — 12:52am",
      "content": "Terry Biddle:\n\n\\> Uli brings up some good points\n\nTypophile's Yves Peters labels such points as \"troll\" points :-)\n\n\\> Clearly, this is a subject that has gray area— particularly when said publisher carries a typeface with a name similar to a well-known classic. It should also be noted that it is imperceptible to the human ear which typeface is being referred to when spoken. Univers or Eunuverse?\n\nI do not think that we have a gray area here:\n\nFor \"Univers\" see [http://www.linotype.com/53226](http://web.archive.org/web/20131014193909/http:/www.linotype.com/53226 \"http://www.linotype.com/53226\")\n\nFor \"Eunuverse\" see [http://www.vllg.com/Thirstype/Eunuverse](http://web.archive.org/web/20131014193909/http:/www.vllg.com/Thirstype/Eunuverse \"http://www.vllg.com/Thirstype/Eunuverse\")\n\nThe non-registered trademark \"Eunuverse\" constitutes a trademark infringement on the following grounds:\n\n1) Both commodities - Univers and Eunuverse - are sans serif fonts thus belonging to the same class of commodities.\n\n2) Both trademarks - Univers and Eunuverse - though written differently, are pronounced identically.\n\n3) The older font \"Univers\" has priority over the later font \"Eunuverse\".\n\nWhile \"Eunuverse\" is not registered, \"Univers\" is a registered trademark in the USA:\n\nSee [http://www.uspto.gov/main/trademarks.htm](http://web.archive.org/web/20131014193909/http:/www.uspto.gov/main/trademarks.htm \"http://www.uspto.gov/main/trademarks.htm\")\n\nSearch for the registration numbers 1203444 and 1203444 to directly locate the registrations of \"Univers\".\n\nIn Germany, \"Eunuverse\" would constitute a trademark infringement on the grounds stated above (for Germans: siehe BGH-Entscheidung vom 14.5.1998, Az. I ZB 9/96, Stichwort \"DRAGON\").\n\nIn the USA, it appears that \"Eunuverse\" also constitutes a trademark infringement on the same grounds. See e.g. the article\n\n[http://www.tms.org/pubs/journals/JOM/matters/matters-0212.html](http://web.archive.org/web/20131014193909/http:/www.tms.org/pubs/journals/JOM/matters/matters-0212.html \"http://www.tms.org/pubs/journals/JOM/matters/matters-0212.html\")\n\nIn this article, we read:\n\n\"Obviously, if the marks are exactly the same in spelling and how they are pronounced, there is a greater chance of likelihood of confusion between the marks. It is important to note that slight misspellings or changes in an established mark will not enable a competitor to use his proposed mark. For example, a beverage manufacturer could not adopt the mark “Koka Kola,” because although this mark is spelled differently from the famous Coca-Cola mark, it is still pronounced the same.\"\n\nIt goes without saying that Mr. Chester Jenkins of the Village outfit selected the name \"Eunuverse\" in order to exploit the fame of the competitor's font \"Univers\" which is claimed to rank among the ten most often purchased fonts according to the (unverified, unattested) sales ranking published at the Linotype website.\n\nFor those who still wonder or still doubt why the pronuncation of trademarks is essential, it should be noted that a \"trademark\" covers both the \"trade by writing\" (e.g. purchase order by typed letter) as well as the \"trade by speaking\" (e.g. purchase order by telephone).\n\nFor example, the FontShop in California sells both \"Univers\" and \"Eunuverse\". Let's assume, there are two telephone calls by purchasers:\n\nA says: \"I want to order the sans serif font \"Univers\"  \nB says: \"I want to order the sans serif font \"Eunuverse\"\n\nI guess, it is now clear why Mr. Chester Jenkins should not have selected the name \"Eunuverse\" and that he should drop this illegal trademark as fast as possible for this reason: Linotype (now owned by Monotype) as a big font company engaging a couple of lawyers is far above the small-time league of the Elfring outfit which probably does not have enough money to institute a lawsuit against the Village outfit in the similar \"Apex\" infringement matter.\n\n"
    },
    {
      "time": "8 Oct 2006 — 2:08pm",
      "content": "Hi Uli,\n\nI just browsed through your website and your posts here with utter amazement. You seem to be full of anger on one hand and enthusiasm on the other - I really wonder what gives you the motivation to do what you do.\n\nAre you connected to the type business in any way? If not, do you think what you do changes the world? Have you ever achieved anything? Do you think it is helpful to anyone? Is it fun to piss of people? If not, what makes you tick?\n\nJust curious.\n\nTim\n\n"
    },
    {
      "time": "8 Oct 2006 — 4:17pm",
      "content": "Aplex, Simpex, Refex and Latrex\n\ninteresting read.\n\n----------  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20131014193909/http:/www.solid-creative.com/motion.htm)\n\n"
    },
    {
      "time": "8 Oct 2006 — 4:26pm",
      "content": "Univers is pronounced \"You-knee-vair\".  \nEunuverse is pronounced \"You-new-verse\".\n\n[posted a little later...]\n\nAnyone familiar with Mr Barry Deck's work over the past two decades knows that he takes a very ironic approach to both disciplines of type and graphic design, best exemplified by his early student works, Canicopulis Script, Repressed Victorian Roman, Template Gothic, and Arbitrary, the last two of which were published by Emigre in the early days of digital type in 1990.\n\n\"Eunuverse\" was designed by Mr Deck, as the text face for \"Ray Gun\" magazine in 1998/9, when Barry was the art director, after stints by David Carson and Wolverton & Johnston. The name was meant as an inside joke for designers, who would never be allowed to specify such a non-traditional typeface. (Just as they would have a hard time convincing their clients to adopt \"Cyberotica\", \"\\*\\*\\*\\*\", or \"Amputee\", (aka \"Traitor\".)\n\nMany artists over the years have appropriated past works in order to make a point about the nature of art, and the nature of art appreciation, from Andy Warhol to Bansky, and from composers such as Luciano Berio, John Cage, and the pop musician Beck, whose grandfather was the Fluxus artist Al Hansen.\n\nNot only is Eunuverse not trying to pass itself off as Univers, but it is adamantly shouting that is is not Univers.\n\n"
    },
    {
      "time": "8 Oct 2006 — 7:30pm",
      "content": "_Univers is pronounced “You-knee-vair”.  \nEunuverse is pronounced “You-new-verse”._\n\nThomas Phinney pointed that out not too long ago...this may be, but most graphic designers don't actually pronounce it that way. Most designers also say Helvetica \"New.\"\n\nAnyway, its all good. But I still think its gray area. Although my opinion differs in this matter, I'm still a big fan of Village distributed typefaces. :)\n\n"
    },
    {
      "time": "9 Oct 2006 — 6:24am",
      "content": "In the French-speaking country France, the font \"Univers\" is pronounced like the French word \"univers\" (l'univers = le monde, i.e. universe = world). In the late 1950s, when \"Univers\" was designed, Frutiger was art director of the defunct foundry Deberny & Peignot, and Charles Peignot himself coined the font name \"Univers\" (see Frutiger's German book \"Buch der Schriften\", Wiesbaden 2005, page 98. Adrian Frutiger pronounces the font name \"Univers\" and his own name \"Frutiger\" in the German way, unless he talks to French-speaking people.)\n\nIn the English-speaking country United States, the font \"Univers\" is usually pronounced like the English word \"universe\". In the thread [http://typophile.com/node/28042](http://web.archive.org/web/20131014193909/http:/typophile.com/node/28042 \"http://typophile.com/node/28042\"), Mr. Mark Simonson states: \"I think most American designers pronounce “Univers” the same as “universe” (including me)\". Likewise, the font \"Eunuverse\" is also pronounced like the English word \"universe\" (compare the first two syllables of \"Eunuverse\" with the first two syllables of \"eunuchoidism\").\n\nMr. Chester Jenkins's report about Mr. Barry Deck's work is very interesting, and also his remark that \"Eunuverse\" was meant as an inside joke for designers, but in legal trademark matters, the only decisive question is this: Can the font name \"Eunuverse\", when uttered orally, be confused with the font name \"Universe\"? The answer is \"yes\". Such confusions always arise when the pronunciation of two trademarks is either very similar or identical. For the German Supreme Court, even a very similar pronunciation is sufficient for trademark infringement, see the BGH decision quoted above.\n\nMr. Tim Ahrens asks, whether it is fun to piss off people. This make me recollect Linotype's former managing director Bruno Steinert, who was recently dismissed and replaced by the new managing director Frank Wildenberg, who studied mechanical engineering in Barcelona and who knows as much about typography and typefaces as my grandmother knew about mechanical engineering. To judge from the information received from the visitors to my website, Bruno Steinert, during his long career in the font forging industry, seems to have sent off more cease-and-desist letters in typeface trademark matters than royalty statements in typeface design matters. He must have had much fun to piss off people.\n\n"
    },
    {
      "time": "11 Oct 2006 — 4:48am",
      "content": "Chester Jenkins:\n\nWhile doing research in other matters, by pure chance I discovered this:\n\nA font with the name \"Apex\" was designed by Gerrit Noordzij thus having font name priority over your much later font \"Apex\". See \"Typography. When Who How\", edited by Friedrich Friedl et al., Cologne 1998, page 411.\n\n"
    }
  ]
}
