{
  "id": "28625",
  "title": "serif font and san serif in logos",
  "forum": "Design",
  "tags": [

  ],
  "content": "what does a serif type face represent in a logo? is it the fact that the company is well established? if so, how many decades/yrs does it have to be around for u to use serif fonts to represent its establishment? thankyou  \nps is there specifically any rules for uppercase and lowercase being used in logos, i.e. lowwercase gives a sense of .... and uppercase reflects a certain aesthetic in the company. is tehre anything like that i should know about?\n\n",
  "author": "<a href=\"/web/20090418233005/http://typophile.com/user/14600\" title=\"View user profile.\">missgiggles</a>",
  "time": "<br>",
  "uid": "14600",
  "comments": [
    {
      "time": " 6.Oct.2006 6.04am",
      "content": "Hi allgiggles1984!\n\nI don’t think that serif typeface represents well establishment by itself. Sans serif can do it too.\n\nIf you look around you’ll see many big companies, very well established :), wich brands and logos are made with sans serif, even scripts or hand-made fonts.\n\nNowadays, many companies are changing its serif logos to sans serif ones, to “modernize”, I think, its “graphic speech”.\n\nLowercase means certain flexibility, certain “humanity”, if you know wath I mean. Uppercase it’s like an ancient Roman column, unremovable. :)\n\nelsebra  \n [www.elsebra.com.ar](http://web.archive.org/web/20090418233005/http:/www.elsebra.com.ar/ \"www.elsebra.com.ar\")\n\n"
    },
    {
      "time": " 6.Oct.2006 8.51am",
      "content": "how do u mean ’humanity’ and ’UPPERCASE=unremovable’, sorry i dint get those bits. please can you expand ojn that.sorry...im just a baby in typog coz im doing graphic design and not specifically type.\n\n"
    },
    {
      "time": " 6.Oct.2006 10.28am",
      "content": "I’m guessing that humanity here means that the company isn’t presenting itself as a monolithic giant corporation, even if it is, but as a friendly approachable group, wheras uppercase can present the opposite.  \nSo, for example, Company A is a financial institution, although it was founded last year it needs to represent itself as trustworthy and established with good business behaviour so it might use a serif font like Trajan (if it is unimaginative:), however, Company B is a computer company and needs to represent itself as hip and 21st century and so might go for Neo Sans all lowercase.  \nAlthough none of the above is true, because, simply by opting for the sans doesn’t lend a logo hipness and Trajan will not by itself make a company responsible or established, the choice of colour, image, icon or the simple act of kerning the type properly can all add to the impression.  \n(A truely established company or a sufficiently hip company will not use a specific font but have their logo lettered.)  \nTim  \nPS you might think about asking a moderator to move this to the Design forum where more people will look at it and refute everything I have written.\n\n"
    },
    {
      "time": " 6.Oct.2006 2.26pm",
      "content": "“what does a serif type face represent in a logo? is it the fact that the company is well established? “\n\nIt represents whatever you convince the client to believe it represents in your presentation.\n\n"
    },
    {
      "time": " 7.Oct.2006 2.37am",
      "content": "“It represents whatever you convince the client to believe it represents in your presentation.”\n\nOr, rather, it represents whatever the spectator believes it represents.\n\n(Don’t believe that the designer of Apple’s trademark can guarantee what it is going to represent. Don’t believe that Apple’s Co. can guarantee what it is going to represent. It will, in time, represent to the spectator everything Apple does and says)\n\n—  \nsoren\\_olsen\n\n"
    }
  ]
}
