{
  "id": "28627",
  "title": "best book you would recommend on typography",
  "forum": "Typographic Education",
  "tags": [
    "Typographic Education"
  ],
  "content": "which one do you reckon is a good book for a student to buy on typoghraphy? any ideas any1?\n\n",
  "author": "missgiggles",
  "time": "6 Oct 2006 — 5:24am",
  "uid": "14600",
  "comments": [
    {
      "time": "6 Oct 2006 — 8:15am",
      "content": "A good place to start is the with [Typographic Triumvirate](http://web.archive.org/web/20150417042115/http:/typophile.com/wiki/Triumvirate).\n\n"
    },
    {
      "time": "6 Oct 2006 — 8:27am",
      "content": "Faz,\n\nAs mentioned by Tiffany, the Triumvirate of books is a good beginning. You might also consider telling everyone what aspects of typography interest you most. Type design? History of letterforms? Proper usage of type? Technical development?, etc. We may be able to then suggest some books which are directed to your specific interest. At any rate, Welcome to Typophile!\n\nChrisL\n\n"
    },
    {
      "time": "9 Oct 2006 — 11:30am",
      "content": "History of type from the Mesapotania to now if possible.thanks\n\n"
    },
    {
      "time": "9 Oct 2006 — 12:06pm",
      "content": "\"The Story of Writing\" by Andrew Robinson,\n\nChrisL\n\n"
    },
    {
      "time": "9 Oct 2006 — 12:10pm",
      "content": "Another good one is:\n\n\"Type and Typography\" by Phil Baines and Andrew Haslam\n\nChrisL\n\n"
    },
    {
      "time": "9 Oct 2006 — 12:11pm",
      "content": "thanks chris\n\n"
    },
    {
      "time": "9 Oct 2006 — 12:22pm",
      "content": "Any book that covers too large a span of time is more than likely to not give you the depth you really need. I'd avoid books like that if what you are hoping for is any amount of depth.\n\n"
    },
    {
      "time": "10 Oct 2006 — 12:38am",
      "content": "theres one pulished in i think 1999 and one in 1995. theres a new one coming out in  \nJan 2007. are they the same book or are they kind of updated tahn the previous one. thanks.\n\n"
    },
    {
      "time": "10 Oct 2006 — 12:39am",
      "content": "sorry chris i mean the book the story of writing.\n\n"
    },
    {
      "time": "10 Oct 2006 — 12:39am",
      "content": "sorry chris i mean the book the story of writing.\n\n"
    },
    {
      "time": "10 Oct 2006 — 5:55am",
      "content": "Faz,\n\nThe only difference is that the 1999 version is paperback--and perhaps therefore a bit cheaper :-) I have the paperback version. I am sure either is fine.\n\nThe 2007 version may have some minor update but probably not a big change.\n\nChrisL\n\nPS: To answer Tiffany's concern about depth, the back of the book contains a suggested reading list to give you more depth if you get hooked on the subject (as many of us here are). I thought you were looking for an overview to get you started. There are thousands of years of material to cover.\n\n"
    },
    {
      "time": "10 Oct 2006 — 9:25am",
      "content": "A couple of my favorites (and less likely to be mentioned than the excellent _Elements of Typographic Style_):\n\n_Letters of Credit_ -- Walter Tracy  \n_The Form of the Book_ -- Jan Tschichold\n\n"
    },
    {
      "time": "10 Oct 2006 — 9:55am",
      "content": "\\>The Form of the Book — Jan Tschichold\n\nThis is a great book--I looked at it at a library--but it is out of print and 2nd hand copies cost over $100 :(\n\n"
    },
    {
      "time": "10 Oct 2006 — 10:33am",
      "content": "Always keep your eyes open at used book stores: good books on type/typography are't exactly big sellers or frequent finds, so often they're insanely expensive, but I found my used copy of _The Form of the Book_ (and in excelent condition) for $10. As for the original query, early on I found Chappell/Bringhurst's _A Short History of the Printed Word_ quite educational (like _The Form of the Book_, also published by Hartley & Marks).\n\n"
    },
    {
      "time": "13 Oct 2006 — 9:14am",
      "content": "thanks all, see what i can get my hands on.\n\n"
    },
    {
      "time": "30 Nov 2006 — 9:42am",
      "content": "Next to Bringhurst's Elements of Typographic Style I can recommend the First Principles of Typography by Stanley Morrison.\n\nRegards,  \nArtur\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*  \nnew release at [www.ourtype.com](http://web.archive.org/web/20150417042115/http:/www.ourtype.com/ \"www.ourtype.com\") : Parry and Parry Grotesque\n\n"
    },
    {
      "time": "3 Jan 2007 — 9:34pm",
      "content": "karen cheng: designing type\n\ngreat book!!!\n\n"
    },
    {
      "time": "7 Jan 2007 — 12:06am",
      "content": "found a list on [http://www.patricialillie.com/OBooklist.html](http://web.archive.org/web/20150417042115/http:/www.patricialillie.com/OBooklist.html \"http://www.patricialillie.com/OBooklist.html\")\n\n"
    },
    {
      "time": "8 Jan 2007 — 12:29am",
      "content": "how can people not mention:  \nStop Stealing Sheep & Find Out How Type Works: Eric Spiekermann  \nand  \nTypography: Ambrose & Harris\n\nvery good!!!\n\n"
    },
    {
      "time": "6 Jan 2008 — 10:42am",
      "content": "The Logo, Font and Lettering Bible - Leslie Cabarga.\n\n"
    },
    {
      "time": "6 Jan 2008 — 3:06pm",
      "content": "I have read the Stop Stealing Sheep and Type and Typography book. Thank you all for posting.\n\n"
    },
    {
      "time": "12 Jan 2008 — 6:39am",
      "content": "Hi  \nI have the following recommendations - to have a thoroughly rounded introduction to typography (first three form the Typographic Triumvirate):\n\nElements of Typographic Style, Robert Bringhurst (3rd Ed.)  \nLetters of Credit, Walter Tracy.  \nAnatomy of a Typeface, Alexander Lawson\n\n+\n\nShort History of the Printed Word, Chappell & BRINGHURST (Rev ed.) - brilliant intro' to the history of type  \nThe Complete Manual of Typography, James Felici (2003) - good accompaniment to 'Elements'.  \nMaking & Breaking The Grid: A Layout Design Workshop, Timothy Samara (2003) – good intro' to grids  \nType & Typography, Andrew Haslam & Phil Baines - well rounded book with invaluable glossaries.\n\nI have more suggestions – just shout if you'd like them.  \nBut, if I had to recommend just one it would be the very first text - Elements of Typographic Style.\n\n"
    },
    {
      "time": "17 Jan 2008 — 7:20pm",
      "content": "Thankyou :) Very much appreciated.\n\n"
    },
    {
      "time": "6 Aug 2008 — 12:40pm",
      "content": "Hi guys.. not wanting to start another thread, since this is pretty much the same case.. I need an article on typography for a class reading, any suggestions? The only thing- the author must be a practitioner of typography/ type design/ communication design!  \nThe elements of typographic style (Robert Bringhurst) virtually being the bible for us all, is something I'm trying to avoid, since a number of students in my class would have picked up the same book!\n\nHelp!\n\n"
    }
  ]
}
