{
  "id": "28630",
  "title": "Remove overlap",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello,\n\nWhat is the best way to remove overlap?  \nI made two shapes,  \nshape 1:\n\n ![](http://web.archive.org/web/20081202143908im_/http:/www.typophile.com/files/1_shape1_5333.gif)\n\nshape 2:\n\n ![](http://web.archive.org/web/20081202143908im_/http:/www.typophile.com/files/2_shape2_3773.gif)\n\nshape 1 and 2:\n\n ![](http://web.archive.org/web/20081202143908im_/http:/www.typophile.com/files/3_shape1and2_4600.gif)\n\nAfter Removing overlap (I’m using FontLab Studio om Mac) I got two new nodes which I don’t want (red arrows):\n\n ![](http://web.archive.org/web/20081202143908im_/http:/www.typophile.com/files/4_removeoverlap_6712.gif)\n\nI’m sure the nodes and handles are right.  \nWhat went wrong?\n\nThanks,  \nPieter\n\n [‹ OpenType-PS with more than 1000 UPM?](http://web.archive.org/web/20081202143908/http:/www.typophile.com/node/32134 \"Go to previous forum topic\") [Deleting nodes in FontLab Studio 5 ›](http://web.archive.org/web/20081202143908/http:/www.typophile.com/node/20680 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081202143908/http://www.typophile.com/user/5585\" title=\"View user profile.\">Pieter van Rosmalen</a>",
  "time": "<br>",
  "uid": "5585",
  "comments": [
    {
      "time": " 6.Oct.2006 8.49am",
      "content": "I know it doesn’t sound like a solution, but can’t you just hand-delete the two nodes? If you put the original curves on the mask layer, you can tweak some handles to get as close as possible to the original curves.\n\nThe additional nodes are probably generated by some kind of rounding off / curve fitting scheme. I am not sure, but I thought that by definition T1 and TT curves could be cut (i.e. node inserted) at any point without affecting the overall shape. This only holds if you have an infinitely fine grid (mathematical x-y plane...), so it wouldn’t apply on the typical 1000 PPM grids FL works with. Bezier handles and nodes are then restricted to be placed on these incremental ’grid points’.\n\nI guess that this is why FL sometimes inserts these additional nodes to best approximate the original curves. You could confirm this if you ’loosen up’ the original curves and make them meet at a larger angle, or if you size them up, so they span more grid points. At some point FL doesn’t have to insert extra nodes as it can put the Bezier handles more accurately.\n\nHope this theoretical speculation helps...\n\nSebastian\n\n"
    },
    {
      "time": " 6.Oct.2006 11.04am",
      "content": "Hi Pieter,  \nthe image you show for shape 2 is a bit confusing. We do not know where white and black is like this. Could you show the whole shape instead of just a section? Also, it would be helpful if you showed the BCPs. Maybe they are not exactly horizontal and vertical?  \nTim\n\n"
    },
    {
      "time": " 7.Oct.2006 1.03am",
      "content": "Hello Sebastian,\n\nThanks for the information. Hand tweaking the curves is possible, but I made an entire typeface like this... Because Fontographer has no problems with it I’m sure FontLab can do it also....\n\n"
    },
    {
      "time": " 7.Oct.2006 1.07am",
      "content": "Hi Tim,  \nYou’re right about the confusing picture, so I made new ones. The BCPs are exactly horizontal and vertical... I hope you have the answer to my problems. Thanks.\n\n ![](http://web.archive.org/web/20081202143908im_/http:/www.typophile.com/files/1_glyph_6603.gif)\n  \n\n ![](http://web.archive.org/web/20081202143908im_/http:/www.typophile.com/files/2_shape1_6707.gif)\n  \n\n ![](http://web.archive.org/web/20081202143908im_/http:/www.typophile.com/files/3_shape2_4465.gif)\n  \n\n ![](http://web.archive.org/web/20081202143908im_/http:/www.typophile.com/files/4_shape1and2_1_3960.gif)\n  \n\n ![](http://web.archive.org/web/20081202143908im_/http:/www.typophile.com/files/5_shape1and2_2_5275.gif)\n  \nAfter :  \n\n ![](http://web.archive.org/web/20081202143908im_/http:/www.typophile.com/files/6_merge1_4784.gif)\n  \n\n ![](http://web.archive.org/web/20081202143908im_/http:/www.typophile.com/files/7_merge2_6378.gif)\n\n"
    },
    {
      "time": " 7.Oct.2006 3.08am",
      "content": "Hmmmm, quite interesting. My guess is that FL somehow retains the existing nodes (they are in perfectly identical positions, right?). Then, because node positions are whole-numbered, it treats the two curves as identical up to the point where they diverge by more than one unit, hence the additional node.\n\nThe curves in shape(s) 2 are not visible in the final result anyway - what happens if you turn them into straights (select a BCP and delete it)? This would mean that the two shapes touch without overlap. In my experiance FL should still recognise this and join the shapes.\n\nIf this fails you could insert a node somewhere in the curves of shape 2 and then turn them into straight lines, leaving a triangular overlap.\n\nThird attempt: make the curves of shape(s) 2 very shallow, i.e. retract the BCPs almost completely. This leaves an overlap but makes the curve “leave” the other one more rapidly.\n\nTim\n\n"
    },
    {
      "time": " 7.Oct.2006 4.07am",
      "content": "Hi Tim,\n\nThanks for the tips.  \nThe nodes are on an identical position and also the handles are.  \nI used your first tip (remove the curves in shape two) and it worked. I’m going to do this with all the other glyphs I designed this way. It still is strange that Fontlab can’t handle it right. Again, thanks for the tips.\n\nPieter\n\n"
    },
    {
      "time": " 7.Oct.2006 4.35am",
      "content": "I decided to do the part in Fontographer because that program works fine. Still I think that this should be possible in FontLab also. So if someone knows how to do it in FontLab, please let me know. Thanks.\n\nPieter\n\n"
    },
    {
      "time": " 9.Oct.2006 6.43am",
      "content": "Try putting the starting points somewhere else, that might do the trick..\n\n"
    },
    {
      "time": " 9.Oct.2006 7.26am",
      "content": "Hello Toby,\n\nIt tried that already. Still the same result...\n\nPieter\n\n"
    },
    {
      "time": " 9.Oct.2006 8.15am",
      "content": "Pieter,\n\nWhat if you do ’FontAudit’ on your glyphs? I think it will notice that those nodes can be removed and it may gove you the option of ’change all’.\n\nOr what about outline ’Optimization’?\n\nSebatstian\n\n"
    },
    {
      "time": " 9.Oct.2006 1.21pm",
      "content": "Hello Sebastian,\n\nNot only adds FontLab a node, but also the curves are changed. When I remove the node the curve is not the same as before. To do this on all the glyphs is very much work. I did the trick in Fontographer and it went fine. It’s strange that FontLabs can’t handle such an easy job.\n\nPieter\n\n"
    },
    {
      "time": " 10.Oct.2006 1.09am",
      "content": "Pieter -\n\nWhat happens if you join the shapes with Merge Contours and then while still selected, press it again? This will “clean” up shapes sometimes.\n\n"
    },
    {
      "time": " 10.Oct.2006 2.04am",
      "content": "Hello Eric,\n\nWhen I do that the ’new’ nodes will stay and the original nodes will be removed:\n\nbefore:\n\n ![](http://web.archive.org/web/20081202143908im_/http:/www.typophile.com/files/1_before_3532.gif)\n\nmerge contours 1:\n\n ![](http://web.archive.org/web/20081202143908im_/http:/www.typophile.com/files/2_merge1_5892.gif)\n\nmerge contours 2:\n\n ![](http://web.archive.org/web/20081202143908im_/http:/www.typophile.com/files/3_merge3_5715.gif)\n\nThe red arrow is pointing on the ’new’ node. That node has no horizontal handle so the curve is not smooth.\n\nPieter\n\n"
    }
  ]
}
