{
  "id": "28634",
  "title": "does type have 'movements'...",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "like in art there is art noveau, arts and craft movement, bauhaus, pop art etc. is there something similar in type? im just a baby in all this yet so pls be patient with me :D many thanks.\n\n",
  "author": "missgiggles",
  "time": "6 Oct 2006 — 9:19am",
  "uid": "14600",
  "comments": [
    {
      "time": "6 Oct 2006 — 9:46am",
      "content": "Many of the art movements, including those you mentioned, have counterparts in type. You can do searches at foundries or at MyFonts use art movement names and end up with examples of type relating to the movement you searched.\n\nHere is a search for art nouveau at MyFonts:\n\n[http://www.myfonts.com/search?search%5Btext%5D=art+nouveau](http://web.archive.org/web/20150416025635/http:/www.myfonts.com/search?search%5Btext%5D=art+nouveau \"http://www.myfonts.com/search?search%5Btext%5D=art+nouveau\")\n\nChrisL\n\n"
    },
    {
      "time": "6 Oct 2006 — 11:13am",
      "content": "So let me beat Chris to this...\n\nType has plenty of movements, usually after a high fiber diet and LOTS of water.\n\n"
    },
    {
      "time": "6 Oct 2006 — 12:12pm",
      "content": "[http://www.fontscape.com/explore?7CM](http://web.archive.org/web/20150416025635/http:/www.fontscape.com/explore?7CM \"http://www.fontscape.com/explore?7CM\")\n\n"
    },
    {
      "time": "6 Oct 2006 — 12:20pm",
      "content": "Type design is part of some wider movements, such as art nouveau, but that was only minor in the type world. It also has its own movements.\n\nFor instance, in the early 20th century, say from 1900 to 1930, Historicism was huge.  \nBy that is meant reviving centuries old typefaces, and creating page layouts and ads in comparable styles. While this started out as part of the arts and crafts movement, as did modernism, it went in the other direction.\n\nSome (eg Robin Kinross in Modern Typography) have called this \"New Traditionalism\", but that doesn't seem right, as it was actually a break with tradition, which had been evolutionary, not jumping all over the place.\n\nIn the design and typography histories that take their cue from art history, Historicism is generally downplayed, because there is no counterpart. But that's the difference between mass media culture, which is what type is part of, and elite art gallery culture.\n\n"
    },
    {
      "time": "6 Oct 2006 — 1:28pm",
      "content": "Thanks, Terry, you beat me to it.... ;-)\n\n"
    },
    {
      "time": "6 Oct 2006 — 1:45pm",
      "content": "The private press movement I can recall being from the end of the xix and the beginning of the xx century. Gruge type is an easy one, mid 90s.\n\nHéctor\n\n"
    },
    {
      "time": "6 Oct 2006 — 1:58pm",
      "content": "Maybe the movement Terry was talking about is the one that got the lead out :-)\n\nChrisL\n\n"
    },
    {
      "time": "6 Oct 2006 — 3:04pm",
      "content": "I've always felt that changes in font style have much more to do with technical changes than any art and architecture movements - it always seemed a bit silly to try to shoe-horn fonts into these movements.\n\n"
    },
    {
      "time": "6 Oct 2006 — 3:48pm",
      "content": "Movements like any catagorization system are always after the fact. It is the kind of thing people love to debate. Does it fall into this group or that? It is fun typegeek talk but doesn't really reveal much about the design.\n\nChrisL\n\n"
    },
    {
      "time": "6 Oct 2006 — 4:12pm",
      "content": "There was a movement, beginning in the early 1960s, and lasting for twenty years, when the trend was to set type tighter and tighter, both the space between letters, and leading. As Si suggests, this had much to do with the technology -- phototypositor, Letraset, and photosetting -- that made it possible. At the same time, type designers created faces with small x-heights, from Antique Olive thru a slew of ITC faces. I associate the tightness and the big x-height as a very coherent technical-aesthetic movement, but I don't believe it is widely identified as such, or has ever been given a name.\n\nI remember when it ended, in the mid 80s, when UK art directors started producing copy-heavy ads with text that was small and hugely tracked out.\n\n"
    },
    {
      "time": "6 Oct 2006 — 4:12pm",
      "content": "\\>much more to do with technical changes than any art and architecture movements\n\nI agree rather with Bringhurst that general movements in art and architecture are indeed very important. The general rule across all design fashions, whether furniture or clothes or houses or type, is that each movement is a reaction to the last. There is usually more than one reaction, but this principle enables you to understand a lot. For example, there are swings back and forth for more and less ornament, as people get fed up with too busy designs, and then get tired of too plain ones.\n\nThere was a different feel to blackletter and roman style type. The spread of roman over black letter, as documented by Harry Carter, was not due to any technical considerations, but religious battles and aesthetic tastes.\n\nBaskerville, if I remember correctly, developed his new inks that would print more cleanly in order to achieve the refined neo-classical feeling that he was aiming for--with its more circular, broad arches compared to Caslon. The aesthetic drove the technical here. And Baskerville's taste was very much of a piece with his times and with what was going on in architecture.\n\nSimilarly, people eventually got fed up with the ornate, busy designs of Victorian England, and this ushered in the clean all-sans look of modernists in the early 20th century. Political factors were also important in the Germanic championing of sans faces.\n\nOf course technology is a very important factor, but the history of type design I don't think can be written properly without a large reference to general cultural trends, especially in the visual arts.\n\n"
    },
    {
      "time": "6 Oct 2006 — 4:21pm",
      "content": "<cite>I’ve always felt that changes in font style have much more to do with technical changes than any art and architecture movements - it always seemed a bit silly to try to shoe-horn fonts into these movements.</cite>\n\nI think that it's a bit of both. The arts & crafts and art nouveau periods, have obvious connections to much of the type of those eras. But in a roundabout way Bauhaus typography also grew out of those movements without being directly related to them, but it wasn't using new technology, either. Renaissance type and art were deeply influenced by interests in science and the humanities, but the art and type were not necessarily influenced by each other. So there are a lot of different kinds of connections between movements in art and type, and a lot of subtle considerations have to be accounted for to make sense of it all.\n\n"
    },
    {
      "time": "6 Oct 2006 — 4:27pm",
      "content": "_Similarly, people eventually got fed up with the ornate, busy designs of Victorian England, and this ushered in the clean all-sans look of modernists in the early 20th century_\n\nThat's a myth. People got fed up with the messy typography of new media in the 1890s, and this ushered in the era of Historicism, with correct use of historical allusion. The clean all-sans look was only ever a high-end, minority phenomenon until the 1960s.\n\nThere is a similar movement now, if you compare the new media of the 1890s with DTP in the 1990s; after the crazy boom comes sober conservatism. Except in Newfoundland, of course.\n\n"
    },
    {
      "time": "6 Oct 2006 — 5:01pm",
      "content": "Nick, I'm sure your history is better, though the general point I was making is still valid: to understand the changes, look at what is happening in the day. Your account also does that comparison, more accurately. Thanks!\n\n"
    },
    {
      "time": "6 Oct 2006 — 7:30pm",
      "content": "\\>I think that it’s a bit of both.\n\nFor sure, look at certain fonts, and you think of an art movement, look at another and you're more likely to think of a technology. And trying to force a technological explanation for a design is sometimes just as silly as forcing an art movement explanation\n\n"
    },
    {
      "time": "6 Oct 2006 — 8:04pm",
      "content": "\\>you’re more likely to think of a technology\n\nWhen I was talking with Larry Oppenberg at the Museum of Printing, he pointed out that actually the typefaces have out-lived the technology. Gardner LePoer there explained that the technology has been changing rapidly and continually from 1850, when engines were put on presses; it's actually not only a thing of the past thirty years.\n\nOppenberg mentioned that Merg. Linotype had been focused on selling machines, and the typefaces were just a means. But in fact the thing that has outlasted the machines and the technology is the typefaces.\n\nGood design has a power to last and is a force in itself. Even with screen fonts, it seems to me it is a matter of designers seeing how best to adapt what they'd prefer to a limited technology--the low resolution screen. And when the screens change, new designs, influenced by the classics, will be done again.\n\nYes, the technology is extremely important. But the message I got from Larry is that in fact those concerned primarily with the technology have in the past underestimated the power of good visual design itself.\n\nType has its own visual logic, which dictates what makes beautiful words and works best for reading. And solving this logic well in a typeface is I suspect in the long run more important than either changes in publishing technology (screen or paper) or tastes in art.\n\n"
    },
    {
      "time": "6 Oct 2006 — 9:27pm",
      "content": "_Type has its own visual logic,_\n\nExactly. We don't have to borrow isms from art or technology to explain the sweep of its history.\n\nHere's another: In the early 19th century in the UK and France, a typographic movement began which:  \n1. Got rid of the long s  \n2. Got rid of c\\_t and s\\_t ligatures  \n3. Changed from \"transitional\" to Modern serifed typefaces  \n4. Invented many new genres, including the sans serif\n\nThis was a widespread, drastic movement which should, by rights, be named modernism.  \nNot a good fit with Romanticism or Neoclassicism, the major cultural movements of the time (or at least, as they have subsequently been termed), although Robert Bringhurst took a good shot at it. Much closer to modern poetry and Wordsworth, with his introduction of simple, vernacular language. It must have been quite a bracing experience to read [Lyrical Ballads](http://web.archive.org/web/20150416025635/http:/etc.dal.ca/cgi-bin/cgiwrap/etc/lballads/img_display.pl?http://etc.dal.ca/lballads/images/London98/98_i.JPG) in 1798, set in a modern type, with no long s's (although the ct is still used).\n\n"
    },
    {
      "time": "7 Oct 2006 — 12:19pm",
      "content": "hey all, pls keep it simple for me. im still at the beginning of typog and all. thanks\n\n"
    },
    {
      "time": "7 Oct 2006 — 3:55pm",
      "content": "\\>hey all, pls keep it simple for me. im still at the beginning of typog and all. thanks\n\nSorry, the answer to your original question is \"yes\".\n\nI think it's okay for other people to take the discussion further, no?\n\n"
    },
    {
      "time": "12 May 2014 — 7:26am",
      "content": "\\> hey all, pls keep it simple...\n\nTwinkle, Twinkle Allgiggles, U I do not intend to belittle  \nJust try to help U paddle, little by little  \n....  \nType is nothing but to Assemble, Compile and Shuffle  \nLetters on lines to make people bubble  \nTowards that end, fonts are handled and tackled  \nThe inspired by butterfly and Candle is [lovable](http://web.archive.org/web/20150416025635/http:/www.papress.com/thinkingwithtype/resources/images/eatFonts_final.html) and durable  \nBut the inspired by beetle's tentacles is terribly horrible  \nPlenty are the Samples but few are the Examples  \n...  \nThere, every movement is probable: scramble and scribble  \nLigatures and Kerning are the most Challenging variables  \nLigatures is to bundle couple, triple and Quadrable  \nKerning is the art of snuggle and nestle  \nIn these, Arabic has no [double](http://web.archive.org/web/20150416025635/http:/typophile.com/node/19609). For a distinguished one, see this [article](http://web.archive.org/web/20150416025635/http:/typophile.com/node/19348)  \n...  \nBefore I make it, I fondle from all sides and angles  \nMy fingers, I do wriggle and fiddle  \nFor \"o\" I go round in circle, like a spindle  \nI like the \"I\" to go as needle and the REST flexible  \nThen wrestle and wrestle to make it wonderfully single  \nAs Twins are not allowed, unless the new outlook is remarkable  \n...  \nEnding the riddle, one thing that U will puzzle and baffle  \nI dont even own a bicycle, and my bills I hardly settle  \nTo the middle class, I still struggle and wrangle  \n...  \nWith [Flowers](http://web.archive.org/web/20150416025635/http:/typophile.com/node/51401), hope I have kindled a candle\n\n"
    },
    {
      "time": "9 Oct 2006 — 9:26am",
      "content": "yes certainly, i like that but its sad for me not knowing what u guys are on about.i would just like it explained simply and not too complex thats all.i know where you coming from though :)\n\n"
    },
    {
      "time": "9 Oct 2006 — 1:30pm",
      "content": "Adrian Frutiguer supports as well the theory that technological changes impulsed stilystic break outs on his book \"Signos, símbolos, marcas y señales\".\n\nHéctor\n\n"
    },
    {
      "time": "9 Oct 2006 — 8:58pm",
      "content": "That's what I like about type, it sits in the middle of technology, literature, and art (with a little bit of physiology and linguistics thrown in for good measure), connecting with them all.\n\nSo on the physiology side of things, there was also a Legibility movement: in the early 20th century Morris Benton produced Clearface and Century Schoolbook; Cheltenham was also a \"legibility\" face, in the sense that its very short descenders and tall ascenders were Goodhue's interpretation of the knowledge that the upper parts of letters are more significant in reading. Then starting in 1926, Chauncey Griffiths did the Legibility Series of newspaper faces at Linotype.\n\nIt could also be argued that legibility is an aspect of functionalism, which would relate those serifed designs just mentioned to the development of the 20th century sans serif at the same time. But is it a requirement of the types in a movement that they have a similar stylistic look? And do the participants in a movement have to be aware that they're in one (and issuing manifestoes), or is it OK to just designate it as such from a later point in history?\n\n"
    },
    {
      "time": "25 Nov 2006 — 9:19am",
      "content": " ![](http://web.archive.org/web/20150416025635im_/http:/typophile.com/files/Salam_4098.gif)\n  \n\n ![](http://web.archive.org/web/20150416025635im_/http:/typophile.com/files/kampnet_4382.gif)\n\n"
    },
    {
      "time": "30 Nov 2006 — 7:34am",
      "content": "Then there's the \"myopic old guy\" movement.  \nWilliam Morris was in his sixties when he went into typography.  \nTheodore De Vinne was in his sixties when he worked with Linn Boyd Benton, then in his fifties, on Century.  \nThose people were very influential in beefing up type designs in the early 20th century -- perhaps because their eyesight wasn't quite as good as it used to be?\n\n"
    },
    {
      "time": "30 Nov 2006 — 7:43am",
      "content": "\"Then there’s the “myopic old guy” movement.  \nWilliam Morris was in his sixties when he went into typography.\"\n\nCan I join that movement now Nick? :-)\n\nChrisL\n\n"
    }
  ]
}
