{
  "id": "28648",
  "title": "@ Symbol",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am designing a business card that needs to include an email address, which leads me to the dreaded @ symbol. I despise this symbol, and have been toying with a substitution,  \n(AT ligatures) especially since designing in faces such as Garamond, Hoefler etc.  \nDo not go with such a modern symbol. What are your thoughts on this?\n\n",
  "author": "ThinkAGM",
  "time": "6 Oct 2006 — 8:20pm",
  "uid": "12556",
  "comments": [
    {
      "time": "6 Oct 2006 — 9:11pm",
      "content": "You can certainly replace it with the word 'at'. Of course, then, to avoid any inconsistency, you have to treat the dot sign the same way. Yourname at hotmail dot com, for instance.\n\nMy question is, do you have a good reason to do it?\n\nI, for one, wouldn't break the rule at the expense of clarity.\n\n"
    },
    {
      "time": "7 Oct 2006 — 12:19am",
      "content": "It's not as if the \"@\" is anything new. It has been around at least almost as long as there have been typewriters, if not longer. Only the usage is modern, and even that goes back to the late ’70s. I read some report on the history of the thing a while back. I wish I could recall the link.\n\nAnyway, if you don't like the way the character fits in with the typeface, redesign it, but make sure it will still be understood as what it is.\n\n"
    },
    {
      "time": "7 Oct 2006 — 1:42am",
      "content": "[http://www.herodios.com/atsign.htm](http://web.archive.org/web/20131015214756/http:/www.herodios.com/atsign.htm \"http://www.herodios.com/atsign.htm\")\n\n"
    },
    {
      "time": "7 Oct 2006 — 11:04am",
      "content": "In my designs, I've used a vertical 'at' ligature, as well as a lot of other ideas. One im nearly done with has a very low tail, extended-right tail extending into the next letter, another looks like an underlined 'a', a (c) or an (r) symbol. Since none of these have had any negative feedback whatsoever, I'd say theres a ton of freedom in what you want it to look like. The places were an @ is used are pretty well understood, and not normally inside of words, so you can get away with more.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20131015214756/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "7 Oct 2006 — 12:25pm",
      "content": "I designed a business card using {at} instead of the @ symbol for what sounds like similar reasons. It is all hypothetical until you actually try it. Maybe show us what you are considering?\n\n"
    },
    {
      "time": "9 Oct 2006 — 6:29am",
      "content": "From a design functionality standpoint, the @ serves a rather important role...it makes it easily to quickly identify the email address. I'd think hard before replacing it with anything else.\n\n"
    },
    {
      "time": "9 Oct 2006 — 6:44am",
      "content": "\\>important role…\n\nI think this is right on point. I think that with the symbols in general--# % + © and so on, the point of them is partly to \\*not\\* look like the other letters, so they stand out as markers of the text as different in the way indicated by the marker. When they are well designed they harmonize, but are different enough to be noticed as markers.\n\n"
    }
  ]
}
