{
  "id": "28646",
  "title": "Interstate",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Where can I get Interstate font family for free??\n\nThks!  \nS\n\n",
  "author": "susancita25",
  "time": "6 Oct 2006 — 4:29pm",
  "uid": "7169",
  "comments": [
    {
      "time": "6 Oct 2006 — 4:41pm",
      "content": "Ha. Not a good question to ask here. You see, That would be illegal. And there are people here that design type and they are VERY serious about it.\n\n"
    },
    {
      "time": "6 Oct 2006 — 5:06pm",
      "content": "Not so fast Eric.\n\nSusan, perhaps we can work out an arrangement?\n\n"
    },
    {
      "time": "6 Oct 2006 — 5:21pm",
      "content": "There are some fonts with a similar look that are available for free, such as Blue Highway by Ray Larabie.\n\n"
    },
    {
      "time": "6 Oct 2006 — 5:21pm",
      "content": "ER do you work for the Font Bureau? Don't give what ou don't own...\n\n"
    },
    {
      "time": "6 Oct 2006 — 5:39pm",
      "content": "cestmartin, that was a slightly deviant joke...\n\n"
    },
    {
      "time": "6 Oct 2006 — 5:54pm",
      "content": "At the nearest highway offramp...late at night...with a pair of pliers...\n\n"
    },
    {
      "time": "6 Oct 2006 — 6:03pm",
      "content": "[free fonts](http://web.archive.org/readme#free)\n\n"
    },
    {
      "time": "6 Oct 2006 — 6:18pm",
      "content": "\\> And there are people here that design type and they are VERY serious about it.\n\nAlso never use your real name, the Peruvian font mafia hang out here and may track you down. ;-)\n\n"
    },
    {
      "time": "6 Oct 2006 — 6:55pm",
      "content": "Maybe they'll force feed you some ceviche. That Peruvian font mafia, real thugs.\n\n"
    },
    {
      "time": "6 Oct 2006 — 8:18pm",
      "content": "I didn't mean for commercial use. It was for my own.\n\nER, I can prepare you some ceviche if you want, bet you have never ate, I'm sure you will not be forced to... Ha ha\n\nsorry guys you are so sensible. I didn't mean to hurt your feelings...  \nIt won't happen again...\n\n"
    },
    {
      "time": "6 Oct 2006 — 8:22pm",
      "content": "Susana, yo he comido ceviche y mucho, mucho más. Esta gente estan locos todos. Menos Paul Hunt, el habla español y va a estar muy enojado con migo. Hola Paul.\n\n"
    },
    {
      "time": "7 Oct 2006 — 12:03am",
      "content": "[Expressway Free](http://web.archive.org/web/20131015175952/http:/www.myfonts.com/fonts/typodermic/expressway/free/) at MyFonts.\n\n"
    },
    {
      "time": "7 Oct 2006 — 3:06am",
      "content": "I love interstate Italic versions. Looks really great.\n\n"
    },
    {
      "time": "7 Oct 2006 — 5:16am",
      "content": "Commercial or personal, the fact remains it would be stealing. These are definitely the wrong forums to be asking for something like this.\n\n"
    },
    {
      "time": "7 Oct 2006 — 2:15pm",
      "content": "Yes,  \nTiffany is correct, this is not the right place to ask about free fonts.\n\nAnybody know where I can get some free booze?\n\n"
    },
    {
      "time": "7 Oct 2006 — 3:00pm",
      "content": ":^P TypeCon next year in Seattle!\n\n"
    },
    {
      "time": "7 Oct 2006 — 3:35pm",
      "content": "LOL @ ER. my spanish is not that good, but i got the gist of what you were saying. i wouldn't say i speak it, but comprehend a bit. hola er! que tal?\n\n"
    },
    {
      "time": "7 Oct 2006 — 6:58pm",
      "content": "Muy graciosos!! jaja jajaa\n\n"
    },
    {
      "time": "7 Oct 2006 — 11:30pm",
      "content": "Hey Tiffany and Paul,  \nLong time no see. Everything Muy Bueno over here. I've come to the realization that I don't know crap about type and started up my illustration blog over at another place. If you are interested in seeing what happens when you mix some of the world's top illustrators, 155 proof rum, and NO SUPERVISION whatsoever, give it a whirl:\n\n[http://www.drawger.com/edel/](http://web.archive.org/web/20131015175952/http:/www.drawger.com/edel/ \"http://www.drawger.com/edel/\")\n\nSusana, si quieres 'bloguear' dame una visita mujer! Un placer conocerte, cuando estaré en Lima te dare una llamadita, no? Trajaré a Paul también, el es muy sexy!\n\nER\n\n"
    },
    {
      "time": "8 Oct 2006 — 8:43am",
      "content": "Susana, la verdad es que a veces uno no se imagina la cantidad de trabajo que hay detrás de una fuente tipográfica, una fuente como interstate lleva años de trabajo involucrando a muchas manos.\n\nCreo que es un pequeño éxito el que haya convencido al director de diseño de mi oficina de comprar la familia tipográfica que usaremos para la identidad de nuestra marca, todo mundo se sorprendió cuando se enteraron que se debían comprar las fuentes.\n\nHéctor\n\n"
    },
    {
      "time": "8 Oct 2006 — 9:52am",
      "content": "Hey, this person \"donsata\" just told Susan he would send her over the entire \"Interstate\" family! That's what he said! Spanish just takes a lot more words!\n\nAre you guys gonna put up with that??\n\n"
    },
    {
      "time": "8 Oct 2006 — 10:13am",
      "content": "Well, I don't speak Spanish, but here is was Babelfish says he said:\n\nSusana, the truth is that sometimes one does not imagine the amount of work that there is behind a typesetter source, a source as interstate has been years of work involving to many hands. I believe that the one is a small success that has convinced the director of design of my office to buy the typesetter family which we will use for the identity of our mark, all world was surprised when they found out that the sources were due to buy.\n\nDoesn't sound like he is going to be sending her the font.\n\n"
    },
    {
      "time": "8 Oct 2006 — 10:17am",
      "content": "Damn those translation programs! Damn them!\n\n"
    },
    {
      "time": "8 Oct 2006 — 10:40am",
      "content": "well, at least you didn't say \"…made you look, made you look!\"\n\n"
    },
    {
      "time": "8 Oct 2006 — 11:25am",
      "content": "ER is having too much fun here ;-) certainly a free pint at TypeCon is in order!\n\nCheers, Si\n\n"
    },
    {
      "time": "8 Oct 2006 — 12:23pm",
      "content": "Will there be a lot of typographers at this TypeCon I keep hearing about? I don't know, beer, x-heights, and serifs, sounds like a dangerous combination.\n\nI'd go, but all I really know about is the beer and I'd feel all left out and such. Do you guys need someone to do caricatures there? I could set up a booth. That would be so cool.\n\n"
    },
    {
      "time": "8 Oct 2006 — 9:47pm",
      "content": "\\>I could set up a booth. That would be so cool.\n\n20% to SOTA\n\n"
    },
    {
      "time": "9 Oct 2006 — 9:03am",
      "content": "Edel, I read your blog. It seems you are more tame than you want all of us to believe. ;^) Eheehhee.\n\n"
    },
    {
      "time": "9 Oct 2006 — 9:10am",
      "content": "Anyone know of any cool looking module or dot matrix ish typefaces free would be nice.\n\n"
    },
    {
      "time": "9 Oct 2006 — 10:04am",
      "content": "As much as I would love to provide the world with all of their typographic needs I fear not being financially able for such a task.\n\nMaybe the United Nations and Edel could create the United Nations Fund for the Typographic Relief (UNFTY).\n\n;)\n\nHéctor\n\n"
    },
    {
      "time": "9 Oct 2006 — 10:39am",
      "content": "thanks all the same, I bid you gooday.\n\n"
    },
    {
      "time": "9 Oct 2006 — 10:43am",
      "content": "Tiffany,  \nDon't believe that blog, I've been a wild man my entire life! It's been a crazy ride, I don't know how I'm still alive.\n\nHector,  \nYou must be the most moral person I've ever met. You are in the province of Queretaro, Mexico, and you're not stealing fonts?! Do you think anyone is going to go down there and apprehend you? Oh, no, I don't think so! :-)  \nYou are a very good person, señor, a very good person. And you're part of the Lucha Libre too! What's your 'luchador' name there? — \"El Typo!\" — tremendo tipo!\n\n"
    },
    {
      "time": "9 Oct 2006 — 1:14pm",
      "content": "Ok, if I have to confess I have stolen fonts for most of my career. From about two years ago I started trying to make my clients buy the fonts used on their identity with modest success. Since then I also have bought a few typefaces to work with but in many cases I work with fonts provided to me by clients, peers or out of my own stolen collection.\n\nHigh prices and a great lack of type culture are the problems to deal with.\n\nHéctor\n\n"
    },
    {
      "time": "9 Oct 2006 — 1:16pm",
      "content": "By the way, the mask is from Blue Demon, rival and friend of El Santo.\n\nHéctor\n\n"
    },
    {
      "time": "9 Oct 2006 — 1:48pm",
      "content": "That's what I thought. NOBODY buys fonts South of the Border. Hey, they stole your land, why can't you steal their fonts, right?  \nOopsy! too much ho-nes-tia always gets this kid in problemos. I kid, I kid, I luv America.  \n:-)\n\nEverybody! buy fonts, o.k.?\n\n"
    },
    {
      "time": "9 Oct 2006 — 2:59pm",
      "content": "\"Maybe the United Nations and Edel could create the United Nations Fund for the Typographic Relief (UNFTY).\"\n\nOr maybe Ellen Lupton could be the spokesperson?\n\nChrisL\n\n"
    },
    {
      "time": "9 Oct 2006 — 3:04pm",
      "content": "Edel must have changed what he originally wrote in Spanish to Susancita--now I can't Babelfish it and get the joke too! Caramba!\n\nPaul, fess up and tell me what he really said? :-)\n\nChrisL\n\n"
    },
    {
      "time": "9 Oct 2006 — 3:09pm",
      "content": "\\>NOBODY buys fonts South of the Border.\n\nThat's why Nick Shinn and John Hudson do so much work-for-hire custom work.\n\n"
    },
    {
      "time": "9 Oct 2006 — 3:10pm",
      "content": "Edel,  \nDon't let his mask fool you, Héctor is a very fine young man.\n\nChrisL\n\n"
    },
    {
      "time": "9 Oct 2006 — 3:11pm",
      "content": "\"That’s why Nick Shinn and John Hudson do so much work-for-hire custom work.\"\n\nLOL!!! Hysterical!\n\nChrisL\n\nPS: Nick and John don't buy any fonts from Greenland either :-)\n\n"
    },
    {
      "time": "9 Oct 2006 — 3:19pm",
      "content": "\\>\"Don’t let his mask fool you, Héctor is a very fine young man.\"\n\nHector, don't let this Chris guy destroy your well earned badass Lucha Libre reputation. You are a delinquent font stealer. Loud and Proud.\n\n\\>\"LOL!!! Hysterical!\"\n\nI soooooo don't get all these damn type jokes. I'm sure it's hilarious.\n\n"
    },
    {
      "time": "9 Oct 2006 — 3:44pm",
      "content": "[Nick Shinn](http://web.archive.org/web/20131015175952/http:/typophile.com/wiki/Nick%20Shinn) and [John Hudson](http://web.archive.org/web/20131015175952/http:/typophile.com/wiki/John%20Hudson) are both in [Canada](http://web.archive.org/web/20131015175952/http:/typophile.com/wiki/Canada), thus that makes the [EEUU](http://web.archive.org/web/20131015175952/http:/typophile.com/wiki/United%20States) \"south of the border\" to them.\n\n"
    },
    {
      "time": "9 Oct 2006 — 6:06pm",
      "content": "Oh I get it, they're Canadian! I've got a great one then:\n\n\\>\"NOBODY buys illustrations South of the Border.\"\n\nThat’s why Anita Kunz and Doug Fraser do so much work-for-hire custom work.\n\nOh, God, LOL!!!! Oh, lord. HA!!!!!!!\n\nHey friends, sorry about all the screwing around here. I was just SO amused by someone coming HERE and asking about free fonts. It's like showing up in a Nevada brothel and asking for free— Hmmm.... well, sorry, bad analogy again.\n\n"
    },
    {
      "time": "9 Oct 2006 — 6:09pm",
      "content": "That analogy is close but one difference. In Nevada, those \"ladies\" get paid to get screwed but type designers get screwed by NOT being paid ;^P\n\nChrisL\n\n"
    },
    {
      "time": "10 Oct 2006 — 8:06am",
      "content": "Thanks for the compliments. I'll try to use stolen fonts as least as possible but sometimes the work just has be done.\n\nThere are some obvious or even notable exceptions like some newspapers comisioning custom typefaces, in México I recall Grupo Reforma (Sinergia by FB some time ago, and now a special weight of Mercury ofr headlines), in Argentina El Clarin and so on.\n\nHéctor\n\n"
    },
    {
      "time": "10 Oct 2006 — 11:06am",
      "content": " **Cheech:** Somebody ripped off the thing I ripped off!\n\nHiro\n\n"
    },
    {
      "time": "10 Oct 2006 — 1:41pm",
      "content": "\\>There are some obvious or even notable exceptions like some newspapers\n\nThat comes back to my joke about custom work. Unlike type designers who primarily license their stuff at \"retail\", you rarely hear piracy concerns from those who mostly do custom work.\n\nIn fact if you look at DBerlow's arguments around unprotected font embedding for Web pages it's almost as if corporations and major publishers using unlicensed fonts are seen as a revenue opportunity rather than a problem.\n\n"
    },
    {
      "time": "29 Oct 2006 — 8:16pm",
      "content": "Edel? Look at his icon. Yeah, he's a pussycat. Mi perro que tiene doce años (hace 80 en años humanos) es mas loco que el. Remember his reaction when I offered him a police-taunting ride through the streets of LA, gratis? Daaaaaaaaang.\n\nhhp\n\n"
    },
    {
      "time": "29 Oct 2006 — 10:19pm",
      "content": "Hrant,  \nQue pasa? Mira para eso, Hrant habla Spanish tambien. Hrant, everytime the Empire does something I think of you man. It's like every day now! Hope all is well with your family.\n\nHey, have you guys ever hit 515 posts on anything again? I'm now hanging out at other places full of artists that don't know anything about type. Makes me feel extremely superior!\n\nER\n\n"
    },
    {
      "time": "30 Oct 2006 — 4:40am",
      "content": "515! Man, that was like Babe Ruth and Hank Araon! Edel, you are still the champ! The only thing that would get that many posts going again would be if Monica Luinski slept with George Bush and Prince Charles at the same time and then got ratted out by OJ and Michael Jackson during the Superbowl halftime! The whole thing would have been started by some guy trying to ID the typeface used to headline the story in the National Enquirer. :-)\n\nChrisL\n\nYo no hablo español\n\n"
    }
  ]
}
