{
  "id": "28656",
  "title": "what typeface would you...",
  "forum": "Design",
  "tags": [

  ],
  "content": "reckon suggested power yet democracy and was also modern? its for an educational based logo.\n\n [‹ Text figures](http://web.archive.org/web/20071010134150/http:/typophile.com/node/28655 \"Go to previous forum topic\") [re: type ›](http://web.archive.org/web/20071010134150/http:/typophile.com/node/28753 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071010134150/http://typophile.com/user/14600\" title=\"View user profile.\">missgiggles</a>",
  "time": "<br>",
  "uid": "14600",
  "comments": [
    {
      "time": " 7.Oct.2006 12.46pm",
      "content": "Would that it was so simple as picking a typeface. Letters in a typeface are what they are to be used in many combinations with all sorts of text. To make this possible, they are designed to be agreeable with many different neighbors. A logo has only one pair of neighbors and must send one message above all others. This means much more is involved. Start by playing with many fonts in the required letters and see what interactions take place with that finite set of letters.\n\nChrisL\n\n"
    },
    {
      "time": " 7.Oct.2006 2.49pm",
      "content": "OurBodoni.\n\n"
    },
    {
      "time": " 9.Oct.2006 8.55am",
      "content": "sorry dezcom. as u know i dont know much about it coz im just at trhe beginning of typog, could u please elaborate on what you said i.e. are there rules as i assume from ’they are designed to be agreeable with many different fonts’ that there may be. i bet people who are beginners are a pain in the bum for you guys. sorry :(\n\n"
    },
    {
      "time": " 9.Oct.2006 11.24am",
      "content": "Educational based Democracy Logo?! Type says it All?!\n\n ![](http://web.archive.org/web/20071010134150im_/http:/typophile.com/files/democry_6328.JPG)\n\n"
    },
    {
      "time": " 9.Oct.2006 12.29pm",
      "content": "“designed to be agreeable with many different neighbors”\n\nBy this I mean that each letter in a typeface must be able to be used next to every other letter. Some languages may have different combinations than others but generally, there must be allowance for all letters working together. In a logo, there are only a few letters. If you look at IBM, for example, there are only 3 and only one combination. Since that is true, I would not have to be concerned with how those letters work with anything other than I or B or M and therefore have more freedom with them but I aalso have less material to carry the message.\n\nChrisL\n\n"
    },
    {
      "time": " 9.Oct.2006 12.49pm",
      "content": "you mean ’one combination’ as in one typeface? sorry, i wont blame u if your not fed up with me by now.lol :D\n\n"
    },
    {
      "time": " 9.Oct.2006 12.53pm",
      "content": "I mean one combination of letters: “I” is only followed by “B” which is only folowwed by “M”  \nThere is no BMI or IMB in the logo, only IBM in that order.\n\nChrisL\n\n"
    },
    {
      "time": " 9.Oct.2006 1.08pm",
      "content": "In other words, if you’re designing a logo for the “AAA Company” you should choose a typeface that has good looking “A”s.\n\n"
    },
    {
      "time": " 9.Oct.2006 2.41pm",
      "content": "I was going more for the negative space between letters. This is the shape that the pairing makes and indicates how comfortable the pair of letters are with eachother.\n\nChrisL\n\n"
    },
    {
      "time": " 9.Oct.2006 6.29pm",
      "content": "Right Chris, sorry I misinterpreted, and a very good point.\n\n"
    },
    {
      "time": " 11.Oct.2006 1.42pm",
      "content": "thanks chris, makes more sense now. lol :D\n\n"
    },
    {
      "time": " 11.Oct.2006 2.04pm",
      "content": "well, im working with 3 letters too M, E, G in that order. good example thanks :D\n\n"
    }
  ]
}
