{
  "id": "2865",
  "title": "(x) \"The Californian\" retro script - hand lettered {Mark S}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I don't know what that is (I'll leave that to the script experts here), but in the meantime similar retro scripts can be found at [Font Diner](http://web.archive.org/web/20050516142350/http:/www.fontdiner.com/), [Letterhead Fonts](http://web.archive.org/web/20050516142350/http:/www.letterheadfonts.com/), [House Industries' Fabulous](http://web.archive.org/web/20050516142350/http:/houseind.com/house.php?kit=VEGAS-FO&sub=view), or generally searching MyFonts for [retro scripts](http://web.archive.org/web/20050516142350/http:/www.myfonts.com/Search?searchtext=retro%2Bscript&itemsperpage=31&resultcount=31&page=1).\n\n",
  "author": "cheshiredave",
  "time": "Tue, 2004-01-27 15:02",
  "uid": "1112",
  "comments": [
    {
      "time": " Fri, 2004-01-30 11:50",
      "content": "I'm almost positive it doesn't come from any of those foundries, because I think I own most of the scripts from all of them.   \n   \nI'm stumped. I want it.   \n   \nYou could take a day and look here: [http://bowfinprintworks.com/ScriptIDGuide.html](http://web.archive.org/web/20050516142350/http:/bowfinprintworks.com/ScriptIDGuide.html)   \n   \ncuz I ain't doing it with those tiny samples.\n\n"
    },
    {
      "time": " Fri, 2004-01-30 13:08",
      "content": "I don't recognize it either, although stylistically it reminds me of House Industries [Fabulous](http://web.archive.org/web/20050516142350/http:/bowfinprintworks.com/Script07Pg5.html) (bottom of the page).   \n   \nEric, if you do find out what it is, and get a copy maybe you could make me a nice big sample for my Script Font ID Guide (730 pixels max)? ;-)   \n   \n(You'll notice that most of my newer samples are larger, but the size was chosen to speed page loading and maximize the number of images. I thought it was a big enough size for ID purposes, but I can see the larger size is nicer for the details.)\n\n"
    },
    {
      "time": " Fri, 2004-01-30 13:11",
      "content": "I don't think it's a font. Looks like a lettering job to me.\n\n"
    },
    {
      "time": " Fri, 2004-01-30 13:11",
      "content": "Oh, I just realized Chesh already mentioned Fabulous. Sorry to step on that one again.\n\n"
    },
    {
      "time": " Fri, 2004-01-30 13:27",
      "content": "I thought of La Macchina, a font I received   \na couple of years ago when I joined the FM font club.   \n   \n [http://www.fontmesa.com/la\\_macchina.htm](http://web.archive.org/web/20050516142350/http:/www.fontmesa.com/la_macchina.htm)   \n   \nMike, email me if you'd like a sample for your   \nscript guide.\n\n"
    },
    {
      "time": " Fri, 2004-01-30 15:40",
      "content": "This is hand drawn. Why people just don't draw their logos instead of asking here and looking for typefaces? They would save a lot of time.\n\n"
    },
    {
      "time": " Fri, 2004-01-30 16:28",
      "content": "It wouldn't kill people to hire a lettering artist once in a while, either.\n\n"
    },
    {
      "time": " Fri, 2004-01-30 17:47",
      "content": "\\>\\>Why people just don't draw their logos instead of asking here and looking for typefaces?   \n   \nBecause not everyone is a lettering artist...   \n   \n\\>\\>It wouldn't kill people to hire a lettering artist once in a while, either   \n   \nTrue, but that can be expensive when the client comes back wanting all of their menu section names, or department titles or whatever in the same lettering. (Even when that is a really bad idea, its much quicker and cheaper to convince the client of that when you own a font).   \n   \nAlso, we like to support the hard work of all our favorite type designers!\n\n"
    },
    {
      "time": " Sat, 2004-01-31 10:32",
      "content": "What a lot of people don't seem to realize is that a script like the one posted above is not a trivial thing to turn into a font. The complexity of just those two words is beyond what you would normally find in a font. For example,   \n   \n\\* The two capital letters are not the same height.   \n\\* The trailing letters--the \"e\" and \"n\"--would not work in the middle of a word, and the internal letters would not necessarilly work at the end of a word.   \n\\* The way the \"C\" overhangs the \"a\" would not work next to a character with an ascender, like an \"h\" or \"l\".   \n\\* The connecting stroke between the \"o\" and \"r\" would probably have to be treated as a ligature. In any case, it is difficult to incorporate an \"r\" like that into a font.   \n\\* The connecting stroke between the \"i\" and \"f\" is wider than the others to make room for the crossbar on the \"f\".   \n   \nThis is not to say that some or all of these issues couldn't be resolved such as by adding alternate characters and ligatures. Unfortunately, users often don't know how to use such fonts.   \n   \nFor example, many of House Industry's script fonts have special characters and ligatures to overcome problematic situations. Yet, I often see these fonts used--even in design annuals--as if the designer had no idea these special characters existed.   \n   \nYou can also design a script font in such a way to avoid features that don't work with certain combinations, but at the sacrifice of many of the qualities that give hand-drawn lettering its appeal.   \n   \nOpenType promises to make such complex scripts easy to use, but, so far, support is uneven. Yet, even when there is full support for complex fonts that can emulate custom lettering, it won't change the fact that if you want something unique, you won't get it by simply typing on your computer keyboard.\n\n"
    },
    {
      "time": " Sat, 2004-01-31 10:37",
      "content": "Here's the image again so you don't have to scroll so much:   \n   \n ![californian2](http://web.archive.org/web/20050516142350im_/http:/www.typophile.com/forums/messages/83/25276.jpg)\n\n"
    },
    {
      "time": " Sat, 2004-01-31 10:46",
      "content": "\\>What a lot of people don't seem to realize is that a script like the one posted above is not a trivial thing to turn into a font.   \n   \nOr, more simply, a logo is not a thing you \\*should\\* or \\*would\\* turn into a font. Unless you want to design a font with almost endless letter variations.   \nClients are so hard to satisfy exactly because nowadays people present them so many variations, using different typefaces (and piracy here works at its best), they will never be educated in understanding the values of a hand-drawn logo (hand-drawn, no matter the media you use).   \n   \nI draw quite an amount of logos where I work, and often clients choose the most crappy one, done with a modified typeface, overlooking the ones I have drawn freehand.   \n   \nOf course, in Italy there's a lot more ignorance around the value of our work as letterers, compared to other places in Europe or in the US, I guess.\n\n"
    },
    {
      "time": " Sat, 2004-01-31 10:56",
      "content": "Take this one I attach, for example. I like it, but I did it quite quickly using skeletal forms over my pencil sketch in FreeHand, but the client discarded it (together with a few others), in favor of a re-design of the previous logo of this product, which was a badly rendered version of Laser from Letraset, designed by Martin Wait. So, I just had to make my boss buy Laser and I spent more time in reworking and adjusting it to make it more \"friendly-logo\" and less \"typeface\". ![Buona_logo](http://web.archive.org/web/20050516142350im_/http:/www.typophile.com/forums/messages/83/25279.gif)\n\n"
    },
    {
      "time": " Sat, 2004-01-31 11:41",
      "content": "Doyald Young, on his site ( [www.delphipress.com](http://web.archive.org/web/20050516142350/http:/www.delphipress.com/)) summed it up well.   \n   \nIf there are thousands of fonts, why handletter or modify a font to create a logotype? Because every company desires a distinct image for itself and its brands, which is unique and copyrightable, an important point. A custom logo is one of of a kind, precisely fashioned. One of the many design approaches, are logos that carry an identifying shape, or illustration. But the majority of commercial logos exist as name only and must rely on their letterforms to impart a distinctive image that the public will remember.   \n   \nCommonly used fonts such as Times Roman, Garamond, Baskerville, Helvetica, and Univers are available to everyone, and because they are seen everywhere, their distinctive qualities are diminished by the boredom of repetition. These same fonts though, may be gently modified to create a more coherent and distinctive logo that is reproduceable in a range of sizes, positive and negative, and on a wide variety of surfaces.   \n   \nA custom logo, handlettered or computer generated, must address only the letters that the name contains. Each letter can then be designed for maximum compatibility, a less daunting task than font design, where each letter of the font: caps, lowercase, figures, punctuation, and special characters, must be designed as a harmonious group.   \n   \nWhether the logo is drawn by hand, or is completely designed on the computer, a thorough understanding of letterforms is vital for the successful resolution of a logo that is eminently usable, with a lifespan of 15 to 20 years.   \n   \n   \nAt his AIGA presentation, he said that drawing letters on the computer isn't drawing,   \nit's clicking. ![:-)](http://web.archive.org/web/20050516142350im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": " Sat, 2004-01-31 13:29",
      "content": "_At his AIGA presentation, he said that drawing letters on the computer isn't drawing, it's clicking._   \n   \nRight, and I suppose writing on a computer is just pressing keys. :-)   \n   \nI agree with everything else you attributed to him, though.\n\n"
    },
    {
      "time": " Sat, 2004-01-31 15:52",
      "content": "This is just hallucinating, Yves.   \n   \n\\>At his AIGA presentation, he said that drawing letters on the computer isn't drawing, it's clicking.   \n   \nDoyald Young makes pretty stupid remarks for being a Great (which is, indeed).   \nOne for all: with a mouse you can refine a drawing, or illustration you have done in pencil endlessly, a thing you would have never been able to do by hand, unless employing a forest of paper. And people with handicaps (or just with a trembling hand) are able to draw with a mouse. I just hate this \"old school\" blindness. I always hated it.\n\n"
    },
    {
      "time": " Sun, 2004-02-01 05:45",
      "content": "When he made this comment, there was a smile on his part, and laughter among the audience. I know you can't see the context. Still, I don't see how this could evoke hate, my goodness.   \nThe comment, which is also in the book, was made as   \na means to inspire the digital-only folks into picking   \nup a pencil. In my opinion.   \n   \nI've found that combining Approach A and Approach B   \nis the strongest approach.   \n   \nbtw, Doyald uses Fontographer and he used InDesign for   \nhis new book.   \n   \nbj\n\n"
    },
    {
      "time": " Sun, 2004-02-01 07:58",
      "content": "It was difficult to tell out of context what Young exactly meant by the comment. Sometimes you have to be there. Thanks for clarifying that.   \n   \nIt just goes to show how sensitive we can be about our favorite tools. :-)\n\n"
    },
    {
      "time": " Sun, 2004-02-01 13:20",
      "content": "Apologies. Maybe I learned the \"taking things out of   \ncontext\" thing while working as a journalist?   \n   \n ![:-)](http://web.archive.org/web/20050516142350im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nbj\n\n"
    }
  ]
}
