{
  "id": "28652",
  "title": "Type Tester Tool",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I am looking for a simple Type Tester to put on my website.\n\nI have seen the threads here about the Bombsites \"Texter\", but are there any moore of these tools out there?\n\nOr are maybe all custom built for each specific Foundry that has one?\n\nAny info on this is most certainly welcome :)\n\nThanks / Göran\n\n",
  "author": "Goran Soderstrom",
  "time": "7 Oct 2006 — 8:23am",
  "uid": "11526",
  "comments": [
    {
      "time": "7 Oct 2006 — 10:30am",
      "content": "I think most type testing applications on websites are custom built using Flash and ActionScript\n\n"
    },
    {
      "time": "7 Oct 2006 — 12:33pm",
      "content": "Adobe's is custom built, and uses our own core type rasterizer.\n\nT\n\n"
    },
    {
      "time": "7 Oct 2006 — 1:23pm",
      "content": "The bad part thing about regular Flash testers is that it is very easy to convert the .swf to a .fla – and then you got a copy of all embedded letters. They are a little bit worse in the bezier curves of course, but still – it is rather easy to \"steal\" them, unfortunately.\n\nI would feel much better if the font was shown on the webpage using some other technique, like Thomas is mentioning. Some technique that produces gif’s or jpg’s instead.\n\nIf anyone know anything more about this, please drop a few lines :)\n\n"
    },
    {
      "time": "7 Oct 2006 — 1:46pm",
      "content": "goran, believe me, its easier for most people to get \"40'000 professional fonts\" including linotype gold and adobe fontfolio with some filesharing-application in an hour than rip (corrupted) vector data from an swf.. and everybody that will do that will never pay for your fonts anyway.\n\nif you want gifs though, there's a way via php. but as far as i know, kerning isnt possible with that.\n\n"
    },
    {
      "time": "7 Oct 2006 — 2:02pm",
      "content": "Well, you definately got a point there, Kesh ;-)  \nPlease, tell more about the php-way.\n\n"
    },
    {
      "time": "7 Oct 2006 — 2:10pm",
      "content": "i dont know much about php, i think its gdlib which does this or something similar. there have been threads about it here.\n\n"
    },
    {
      "time": "7 Oct 2006 — 8:00pm",
      "content": "[LetterSetter](http://web.archive.org/web/20131020232345/http:/www.letterror.com/lettersetter/index.html)\n\nAs for the PHP solution, AFAIK it's limited to TrueType fonts. Here's the function you'd have to use: [imagettftext](http://web.archive.org/web/20131020232345/http:/www.php.net/imagettftext)\n\n"
    },
    {
      "time": "11 Oct 2006 — 5:34am",
      "content": "I’ve stumbled upon the FreeType project, and by reading a little about, it seems like one could do a typesetter based on it somehow. Freetype 2 functions with both Opentype, postrcript and truetype as I read.\n\nThe hard part is of course to make it work together with PHP or CGI, and that is something that I wont even try to learn ;)\n\nThough this one is rather ugly, it works with FreeType v.1 – so i guess it could be built on FreeType 2 aswell? It’s exactly what I’m looking for, but need to get some help builiding it :)\n\n[http://mbox.troja.mff.cuni.cz/~peak/ftdemo/index.cgi](http://web.archive.org/web/20131020232345/http:/mbox.troja.mff.cuni.cz/~peak/ftdemo/index.cgi \"http://mbox.troja.mff.cuni.cz/~peak/ftdemo/index.cgi\")\n\n"
    },
    {
      "time": "11 Oct 2006 — 6:16am",
      "content": "Goran,\n\nI'm working on a type testing application using flash. It's XML based, so it's simlpe to update with new fonts. It might be the sort of thing your looking for ?\n\n[TypeTest](http://web.archive.org/web/20131020232345/http:/homepage.ntlworld.com/c.dickinson40/Testertype/)\n\n"
    },
    {
      "time": "11 Oct 2006 — 12:50pm",
      "content": "Simon, your Type Tester look great! Nice the way you did the size-changing tool. What does the XML part add to the tester?\n\n"
    },
    {
      "time": "11 Oct 2006 — 2:59pm",
      "content": "Well this is just a test type Tester to organize the code, but the XML will control the weight buttons and what font to load so I could use the same movie for different fonts. The XML will determine how many weights there are, and load the correct weight relating to that button. The XML could also be used to load predefined content, so you could have character set or phases like \"The quick brown fox jumps over the lazy dog \"\n\n"
    },
    {
      "time": "11 Oct 2006 — 10:42pm",
      "content": "Very interesting, Simon. Is it something you could consider sharing with the world?\n\n"
    },
    {
      "time": "11 Oct 2006 — 11:09pm",
      "content": "It's something I've just started working on, but if I get it working and packed correctly, then yes I could share it. I wouldn't want to let other poeple use it till it was fool proof.\n\n"
    },
    {
      "time": "11 Oct 2006 — 11:50pm",
      "content": "Great.\n\n"
    },
    {
      "time": "12 Oct 2006 — 12:02am",
      "content": "I'll keep you posted\n\n"
    },
    {
      "time": "12 Oct 2006 — 7:36am",
      "content": "Dear Thomas,\n\nIf your Online Typesetter uses your core type rasterizer, why does it not handle GSUB features such as ligatures and contextual alternates? Seeing all of Robert's wonderful work on GARAMOND PREMIER PRO without ligatures is a tragedy. You have the best engine in the business. Use it! Using CoolType in the way that you are is, as my father would say, \"like buying an Aston Martin and never driving it!\"\n\nSorry I missed your assorted lectures in Lisbon. Deadlines called!\n\nSincerely,  \nRandolph T. Burke\n\n"
    },
    {
      "time": "19 Oct 2006 — 12:00am",
      "content": "Try [http://www.glyphgate.com/](http://web.archive.org/web/20131020232345/http:/www.glyphgate.com/ \"http://www.glyphgate.com/\")\n\n"
    },
    {
      "time": "10 Dec 2010 — 6:41pm",
      "content": "did you ever get that typetest tool working, coop? are you selling it or offering it up?\n\n"
    }
  ]
}
