{
  "id": "28684",
  "title": "Building Letters",
  "forum": "Home",
  "tags": [
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Indices) : [Publications](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Publications) : The Building Letters Project**\n\nThe project Building Letters was launched in 2003 by [Jim Richardson](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Jim%20Richardson). The profits from the sales of 36-page magazine on African design were donated to the support of two African orphanages for children with AIDS. The success of the project was boosted by the CD with free fonts created, amongst others, by [Max Kisman](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Max%20Kisman) or [David Carson](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/David%20Carson). Second issue was dedicated to India, and the profits went to the aid of Indian children and of children from a Ugandan orphanage. Again, the issue contained a CD with fonts designed by [Donald Beekman](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Donald%20Beekman), [Bruno Maag](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Bruno%20Maag), Rian Hughes and others. Jim begun working on the third issue shortly after the deadly tsunami in 2004 on the impulse of Rathna Ramanathan from the University of Reading, who was at Sri Lanka when the tsunami came.\n\n**Building Letters 3**\n\nShort after the call for cooperation on the third issue was published, [Filip Blažek](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Filip%20Blazek) from Prague-based design studio [Designiq](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Designiq) offered to do free layout and typesetting of the whole issue, and Jim immediately accepted this offer. First version of the magazine was ready in February 2005, however, the work was delayed for more than a year and half by various obstacles. In the end, Blažek and Richardson agreed that the final steps of the production and distribution process would be left to Designiq. Shortly afterwards, at the Typo Berlin 2006, an international team met, helping the new magazine come into the world.\n\nDuring the first half of October, the third issue of Building Letters magazine will come out, being a means with which typographers and designers help those in need. By purchasing one of the 1000 copies (numbered by hand), you not only receive a CD with 25 fonts by renown typographers, you will also make a significant contribution to the aid of those whose lives aren't as lucky as yours or mine.\n\nThe third issue of Building Letters is dedicated to Sri Lanka and Thailand, and it features interesting articles by Tom de Gay, [Nick Shinn](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Nick%20Shinn), [Max Kisman](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Max%20Kisman), [Fiona Ross](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Fiona%20Ross) and [Donald Beekman](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Donald%20Beekman). As usual, it contains a CD with free fonts, this time donated by [Pieter van Rosmalen](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Pieter%20van%20Rosmalen), Seonil Yun, José Scaglione, David Březina, José Louis Coyotl Mixocatl, [Stefan Hattenbach](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Stefan%20Hattenbach), Bram Pitoyo, Tomáš Brousil, [Richard Kegler](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Richard%20Kegler), [Veronika Burian](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Veronika%20Burian), Jürgen Weltin a Ludmila Lorenz. All fonts are [OpenType](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/OpenType) and with one exception, they contain glyphs necessary for typesetting of all Latin-script European languages (complete [Unicode](http://web.archive.org/web/20131017054440/http:/typophile.com/wiki/Unicode) set Latin Extended A), so you can set Maltese, Welsh, or Esperanto in them; some faces contain special features, alternate glyphs, decorative glyphs, alternative numerals, ligatures, or small caps.\n\nAlthough the TV cameras are long gone from the places hit by the tsunami, aid is still needed. This is why all profit from the sales (after deduction of hard costs) will be donated to a respected charity Direct Relief International ( [http://www.directrelief.org](http://web.archive.org/web/20131017054440/http:/www.directrelief.org/ \"http://www.directrelief.org\")), which will use the money to help those hit by the 2004 tsunami.\n\n ![](http://web.archive.org/web/20131017054440im_/http:/typophile.com/files/building-letters-3-cover_4288.jpg)\n\nThe magazine size is A5, it has 64 full colour pages, it is published in a limited run of 1000 numbered copies, and it is **on sale now for 35 Euro** (aprox. $43) at [http://www.buildingletters.org](http://web.archive.org/web/20131017054440/http:/www.buildingletters.org/ \"http://www.buildingletters.org\"). Also, the site will publish information on how much money was collected, and finally, it will publish a report from Direct Relief on the use of the donation.\n\n",
  "author": "filip blazek",
  "time": "9 Oct 2006 — 7:58am",
  "uid": "1344",
  "comments": [

  ]
}
