{
  "id": "2868",
  "title": "(x) \"Letters of the Century\" book - HTF Requiem {Mark S}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi, Just to be clear, the title of this book refers to mail not to typography.   \n   \nI mentioned this typophile forum to a designer friend, and he asked me to post the following. He's always wanted to know the name of this beautiful serif font. Any info is appreciated. Thank you.   \n   \n ![Book type for ID](http://web.archive.org/web/20050516142403im_/http:/www.typophile.com/forums/messages/83/25060.gif)\n\n",
  "author": "alyce",
  "time": "Tue, 2004-01-27 19:50",
  "uid": "2966",
  "comments": [
    {
      "time": " Tue, 2004-01-27 20:18",
      "content": "the caps look trajan-ish...   \n   \nhttp://www.myfonts.com/fonts/linotype/trajan/regular/testdrive.html?s=LETTERS+CENTURY&p=48   \n   \nbut not quite.\n\n"
    },
    {
      "time": " Tue, 2004-01-27 21:01",
      "content": "Looks like Hoefler's [Requiem](http://web.archive.org/web/20050516142403/http:/www.typography.com/catalog/requiem/index.html). You can see it more clearly on [Amazon](http://web.archive.org/web/20050516142403/http:/www.amazon.com/gp/reader/0385315902/ref=sib_dp_pt/102-2383946-5488922#reader-link). (That includes the italic \"of the\" as well.)\n\n"
    },
    {
      "time": " Wed, 2004-01-28 00:02",
      "content": "Thank you both for your input.   \n   \nMark, Requiem it is. I had a (very) slight moment of doubt when I saw the \"Y\" at your link, but the character set also shows the \"Y\" used on the book. I'm sort of partial to that particular letter.   \n   \nJust curious: Is there a special name for the vertical serifs at the ends of the \"T\" crossbar?   \n   \nMy friend will be pleased, and I like it too. Thank you.\n\n"
    },
    {
      "time": " Wed, 2004-01-28 06:56",
      "content": "Requiem has several alternate characters which can make it a little tricky to identify sometimes. The roughness of your sample image threw me at first, too.   \n   \nI don't think there is a special name for those vertical serifs. As far as I know they are just called vertical serifs.\n\n"
    }
  ]
}
