{
  "id": "28696",
  "title": "writing from right to left and vice versa.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "how come all the earlier eras in typography from the Mesapotanians including hebrew script and egyptian heiroglyphs and arabic all wrote from right to left? was there a particular reason? there must be. who changed this habit and why and when (which century)?why do we write english left to right? how did all this change come about? chinese write from right to left too. where do they come into all this? i’d like to know if anyone has any answers. thanks.  \nPS how is French, Spanish, German etc written? what other languages still write right to left? i know Urdu (Pakistan) is still written right to left.\n\n [‹ Rococo letters](http://web.archive.org/web/20080110085057/http:/www.typophile.com/node/28804 \"Go to previous forum topic\") [Rare fonts ›](http://web.archive.org/web/20080110085057/http:/www.typophile.com/node/28712 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080110085057/http://www.typophile.com/user/14600\" title=\"View user profile.\">missgiggles</a>",
  "time": "<br>",
  "uid": "14600",
  "comments": [
    {
      "time": " 9.Oct.2006 10.12am",
      "content": "Well miss Giggles, at least all languages written with the latin, cirylic and greek alphabets are written from left to right. (This actually covers american and european continents as well as a significative amount of the african continent and oceania, also some places in asia).\n\nI can’t tell the reason for this but it makes sense if you write using your right hand because this way you don’t cover the las written words with your hand and you are not touching fresh ink.\n\nHéctor\n\n"
    },
    {
      "time": " 9.Oct.2006 11.19am",
      "content": "\\>all languages written with the latin, cirylic and greek\n\nNot true for Greek if this is accurate...\n\n[http://en.wikipedia.org/wiki/Bi-directional\\_text](http://web.archive.org/web/20080110085057/http:/en.wikipedia.org/wiki/Bi-directional_text \"http://en.wikipedia.org/wiki/Bi-directional\\_text\")\n\n"
    },
    {
      "time": " 9.Oct.2006 11.39am",
      "content": "Good remark but isn’t it arcane?\n\nHéctor\n\n"
    },
    {
      "time": " 9.Oct.2006 11.42am",
      "content": "Yes, early Greek was written right-to-left like Phoenician, “boustrophedon” (where the direction of writing changes every line) was an intermediate stage, and by the 5th century BC, left-to-right was the direction of writing.\n\nAndrew Robinson, The story of writing, Thames and Hudson, London 1995.\n\n"
    },
    {
      "time": " 9.Oct.2006 11.49am",
      "content": "\\>Good remark but isn’t it arcane?\n\nMaybe but it’s still all Greek to me. ;-)\n\nPerhaps “all living languages written using L, G, C...”\n\n"
    },
    {
      "time": " 9.Oct.2006 12.20pm",
      "content": "L, G, C? what does that stand for? thanks\n\n"
    },
    {
      "time": " 9.Oct.2006 12.28pm",
      "content": "teach me for being lazy... Latin, Greek, Cyrillic\n\n"
    },
    {
      "time": " 9.Oct.2006 12.34pm",
      "content": "Virtually All are spoon-fed that the first Man on earth was not able to speak any language, but he was able to draw.  \nIs this logical? If so, then what was the tongue created for?\n\nBiologically, there is no difference between your tongue and my tongue.  \nAll human tongue is the same?!  \nIf you were born where I was born, your tongue would have been twisted to Arabic.  \nAnd if I was born where you were born, mine would have been twisted to English.\n\nSo I can say, the First Man was able to communicate orally and in writing.  \nHowever there were 2 alternatives: left-to-right and right-to-left. (No more, no less). The proof is that who knows which leg goes first: Left or right?\n\nHere is the truth that shall set you free:  \nOf God’s signs is the creation of the heavens and earth and the variety (diversity) of our tongues and hues (Languages and Colors). Surely in that are signs for all living beings.\n\nNothing is more beneficial than Reason and nothing is more harmful than ignorance.\n\n"
    },
    {
      "time": " 9.Oct.2006 12.40pm",
      "content": "\\>However there were 2 alternatives: left-to-right and right-to-left. (No more, no less).\n\nWell that’s not really true, there’s up and down, down and up and curved in a sort of spiral.\n\nSee Prof. Twyman’s (1979) “schema for the study of graphic language”\n\n"
    },
    {
      "time": " 9.Oct.2006 12.44pm",
      "content": "thanks, thats better! :D\n\n"
    },
    {
      "time": " 9.Oct.2006 12.48pm",
      "content": "Did the Chinese write from up-to-down, didn’t they? I mean, sign after sign. Today they write from left to right...\n\n"
    },
    {
      "time": " 9.Oct.2006 12.53pm",
      "content": "Japanese too, I think. You’ll find handwriting, books and newspapers still using vertical layout, even though “the computer” has been blamed for a move to more and more horizontal layouts.\n\n"
    },
    {
      "time": " 9.Oct.2006 10.24pm",
      "content": "Sii, Vertical writing was developed only recently by the Japanese in spite of their horizontal eyes. But lines of text still go column by column form right-to-left and/or left-to-right of the Page.\n\nNevertheless, you will never find any Japanese or Chinese Crosswords where words go across and back, up and down and diagonaly in both directions. Or petalled in clockwise and counterclockwise directions as in my [Flowers](http://web.archive.org/web/20080110085057/http:/www.crauswords.com/flowers/WFlowers.htm)\n\n"
    },
    {
      "time": " 10.Oct.2006 6.20am",
      "content": "\\>Nevertheless, you will never find any Japanese or Chinese Crosswords where words go across and back, up and down and diagonaly in both directions.\n\nThat’s what makes the Rongorongo crosswords so difficult.\n\n[http://en.wikipedia.org/wiki/Rongorongo](http://web.archive.org/web/20080110085057/http:/en.wikipedia.org/wiki/Rongorongo \"http://en.wikipedia.org/wiki/Rongorongo\")\n\n"
    },
    {
      "time": " 10.Oct.2006 7.13am",
      "content": "Aziz, what are you talking about? Japanese has always been written vertically, with columns right-to-left, just like Chinese, for as long as records have existed. There is no “recently” or “and/or” about it. And, exactly as Sii says, recently horizontal left-to-right writing has become more common. (Right-to-left horizontal writing is also used, very occasionally.)\n\nBy the way, who does not have horizontal eyes? I certainly have never met anyone whose eyes were set one above the other.\n\n"
    },
    {
      "time": " 10.Oct.2006 7.34am",
      "content": "boustrophedon |ˌboōstrəˈfēdn| adjective & adverb (of written words) from right to left and from left to right in alternate lines. ORIGIN early 17th cent.: from Greek, literally ‘as an ox turns in plowing,’ from bous ‘ox’ + -strophos ‘turning.\n\nAs far as I remember ‘ox(plow)turning’ used to be the norm for Greek for a fairly long time. Me thinks that the advent of more democratic writing materials (like ink and pen) made going left to right handier (most of mankind being righthanded) AND of course a lot easier to read (if I’m not mistaken the ‘returnline’ was being written with mirrored characters).\n\n"
    },
    {
      "time": " 10.Oct.2006 7.39am",
      "content": "more... [http://en.wikipedia.org/wiki/Boustrophedon](http://web.archive.org/web/20080110085057/http:/en.wikipedia.org/wiki/Boustrophedon \"http://en.wikipedia.org/wiki/Boustrophedon\")\n\n"
    },
    {
      "time": " 10.Oct.2006 7.45am",
      "content": "I can’t imagine what a dyslexic person would do if they had to read in both directions at once!\n\nChrisL\n\n"
    },
    {
      "time": " 10.Oct.2006 7.57am",
      "content": "I once edited a thesis in English for a dyslexic guy whose first language was Hebrew — there were times I couldn’t figure out if his thought process was coming or going.\n\nLinda\n\n"
    },
    {
      "time": " 10.Oct.2006 8.32am",
      "content": "Perhaps he needed to be Reformed?\n\n:-)\n\nChrisL\n\n"
    },
    {
      "time": " 10.Oct.2006 9.43am",
      "content": "\\>Perhaps he needed to be Reformed?\n\nNo, Unorthadox\n\nConfidential to Chris, I’m sticking with the new Boz icon until the Hawk’s win a game. ;-)\n\n"
    },
    {
      "time": " 10.Oct.2006 9.49am",
      "content": "Perhaps he needed to be Reformed?\n\nNo, Unorthadox\n\nIt was, to be conservative, a struggle. ;-)\n\n(Oy!)\n\n"
    },
    {
      "time": " 10.Oct.2006 10.37am",
      "content": "\\> I can’t imagine what a dyslexic person would do if they had to read in both directions at once\n\nThat would be ambidyslexiterous.\n\n"
    },
    {
      "time": " 10.Oct.2006 1.50pm",
      "content": "Sii, Rongorongo, Or wrong on the go?  \nBottom to top is more enjoyable than Top to bottom?!\n\nHaeleth, Thank You for the correction.  \nPerhaps, I misunderstood my Japanese friend.  \nTo be more accurate, Japanese eyes are more towards - - than to o o\n\n"
    },
    {
      "time": " 10.Oct.2006 2.06pm",
      "content": "\\>Sii, Rongorongo, Or wrong on the go?\n\nNo, Rongorongo, did you look at the wiki?\n\n\\>Bottom to top is more enjoyable than Top to bottom?!\n\nWhat you do in the privacy of your own home is up to you, providing no fonts were modified and EULAs are observed.\n\n"
    },
    {
      "time": " 10.Oct.2006 2.12pm",
      "content": "_What you do in the privacy of your own home is up to you, providing no fonts were modified and EULAs are observed._\n\nAnd no children were involved.\n\n"
    },
    {
      "time": " 10.Oct.2006 2.22pm",
      "content": "or animals\n\n"
    },
    {
      "time": " 10.Oct.2006 2.25pm",
      "content": "What’s wrong with animals?\n\n"
    },
    {
      "time": " 10.Oct.2006 2.29pm",
      "content": "These are the rules\n\n...harm no child, animal or font.  \n...observe the EULA.\n\n"
    },
    {
      "time": " 10.Oct.2006 2.43pm",
      "content": "Or no pages were involved :-)\n\nChrisL\n\n"
    },
    {
      "time": " 10.Oct.2006 2.54pm",
      "content": "ROFL!\n\nOnly if you’re Mark Foley....\n\n"
    },
    {
      "time": " 10.Oct.2006 2.58pm",
      "content": "That would have to be a black mark on a Folio page :-)\n\nChrisL\n\n"
    },
    {
      "time": " 10.Oct.2006 3.00pm",
      "content": "Now don’t bring race into this!\n\n"
    },
    {
      "time": " 10.Oct.2006 3.02pm",
      "content": "Only the race for congress seats :-)\n\nChrisL\n\n"
    },
    {
      "time": " 10.Oct.2006 3.04pm",
      "content": "Or should I just have said:  \nNo marking on Foleo paiges or they’ll throw the book at you!\n\nChrisL\n\n"
    },
    {
      "time": " 10.Oct.2006 3.15pm",
      "content": "this is the one that made me laugh out loud:\n\n_That would be ambidyslexiterous._\n\nthanks for that!\n\n"
    },
    {
      "time": " 10.Oct.2006 3.17pm",
      "content": "How did I miss that one! It was freakin’ BRILLIANT!\n\nGood Show Don!\n\nChrisL\n\n"
    },
    {
      "time": " 11.Oct.2006 4.16am",
      "content": "Think we confused 2 points:  \n1. the direction of writing and the direction of Text flow.  \n2. picture-like characters and character-like pictures?!\n\nAll the 4, Latin, Arabic, Chinese and Japanese text does flow from top to bottom.  \nHowever, Arabic Words go right to left and Latin left to right.  \nBut how do Chinese and Japanese words go? Better Consult them?\n\nPeace with [Flowers](http://web.archive.org/web/20080110085057/http:/www.crauswords.com/flowers/WFlowers.htm)\n\n"
    },
    {
      "time": " 11.Oct.2006 10.09am",
      "content": "Well, the direction of writing naturally becomes the direction of text flow, no? Or do you mean the alignment of text – which is a completely different story?  \nI guess, when man began to write, he just had to decide for one direction, and one began to prevail for both practical reasons (as described above) and due to English (Latin script!) becoming the most “international” language, even other writing systems began to adopt or at least allow left-to-right as an alternative…\n\n"
    },
    {
      "time": " 11.Oct.2006 12.47pm",
      "content": "please all, can we just get back to my discussion. i need proper answers, thanks.\n\n"
    },
    {
      "time": " 11.Oct.2006 2.36pm",
      "content": "faz,\n\nWhat classes are you taking? I ask because you seem in a rush to demand answers, and eager to thank people for information they haven’t given. Your spelling, language and online name tell me you’re really young and really eager. Could you channel some of that eagerness into research? For instance, look in the wiki here for books about writing systems, type design, typography, etc. Get some of them. Look elsewhere for discussions of art movements. Research is essential to learning. If you want to learn, don’t skip the research step before asking opinions from other typophiles.\n\n"
    },
    {
      "time": " 13.Oct.2006 2.02am",
      "content": "Think we also confused hand-writing with Machine-writing.  \nVirtually, to handwrite any language, the pen goes in All directions to draw different letters and ligatures. But in machines, keys are built to juxtapose strokes one at a time: from left to right as in English or right to left as in Arabic.\n\nTypewriters were made with Return keys to make rows of words while some Japanese and Chinese typewriters were made with vertical Return Keys?!\n\n"
    },
    {
      "time": " 13.Oct.2006 1.04pm",
      "content": "I don’t know if anyone really answered the question posed regarding text direction, so here is what I learned:\n\nA long time ago, before pen and paper, people “wrote” using a hammer and a chisel (or spike). Just as now, most people then were right handed, they had to hammer using their dominant hand, holding the chisel or spike with the left hand. In this way, it is easier to etch or carve words, symbols, and hierogplyphs from the right to the left.\n\nThis right to left approach was almost universal; even the Latins and Greeks started at the right (this was a VERY long time ago). When pens and papyrus/vellum came along, the Greeks innovated by going in both directions within the same text; that is, they started from the right, got to the end of a line and then started going back toward the right, and then back again in a zig-zag. The Latins felt this was just too much and they settled on the left to right method.\n\nIn Asia, paper has been around for a very long time, as has ink; what came first, however, were turtle shells and bones upon which the ancient Chinese carved their earliest pictographs/ideograms. The nature of these materials (being thin) caused the writer to start carving at the top of the bone or shell and go to the bottom (this is a natural progression because of the height/width of Chinese characters).\n\nWhen the Chinese invented paper, they continued the practice of top to bottom writing; but why they started at the right of the page is beyond me. I suspect it was easier for them when using a bamboo brush and an inkstone. Other Asian nations, such as Japan and Korea, adopted Chinese characters long before they created their syllabaries, which is why they, too, wrote from top to bottom, right to left (though these practices are dying).\n\nI hope this explanation helps...\n\n"
    },
    {
      "time": " 13.Oct.2006 1.58pm",
      "content": "Zmizrachi, Just 2 Questions now. More later.  \n\\> A long time ago, before pen and paper, people “wrote” using a hammer and a chisel (or spike). Just as now, most people then were right handed, they had to hammer using their dominant hand, holding the chisel or spike with the left hand.\n\nOn what? On Rocks, trees, turtle shells, bones or something else?!\n\n\\> In Asia, paper has been around for a very long time, as has ink; what came first, however, were turtle shells and bones upon which the ancient Chinese carved their earliest pictographs/ideograms.\n\nUsing hammer and a chisel (or spike)?! Or something else?!\n\nThanx with [Flowers](http://web.archive.org/web/20080110085057/http:/www.crauswords.com/flowers/WFlowers.htm)\n\n"
    },
    {
      "time": " 14.Oct.2006 2.50am",
      "content": "Styluses (reed) and wet clay were used to write cuneiform which originated from pictograms inscribed vertically and became left to right cuneiform characters in the third millennium BC. For a permanent record the clay could be baked in a kiln.  \nTim\n\n"
    }
  ]
}
