{
  "id": "2870",
  "title": "The De Beers Diamond font ... The mystery continues ...",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello all,   \n   \nMy first post on this board dealt with a font I've been hunting for a long, long time. It was a serif italic with characteristic swooping serifs used in the televison and print ads for the De Beers company's \"Shadows\" campaign starting in 1996. Since then I've been trying to find out what it was. I even tried contacting the Ad agency that produced the ads, J. Walter Thompson in London, but ended up where I began. Read my original post here [here](http://web.archive.org/web/20120107043906/http:/www.typophile.com/forums/messages/83/10604.html)   \n   \n**A quick summary of the story until now:**   \n_It may be a Caslon!_   \nMy searched seemed futile until I came across Elsner and Flake's [Caslon Rough](http://web.archive.org/web/20120107043906/http:/www.myfonts.com/fonts/ef/caslon-rough/hef-regular-italic/testdrive.html?s=How%2Belse%2Bcould%2Btwo%2Bmonths%2Bsalary%2Blast%2Bforever&p=48%3E) which bears an unequivocal resemblance to my mystery font. If it weren't for the roughened appearance it would be almost perfect (The 'v' is different but that's inconsequential to me). It turns out that Elsner and Flake's Caslon Rough was based on a phototype Caslon from the 1980s of ATF origin, according to Ms. Elsner.   \n   \nSince we have some phototype experts here, I was hoping we could shed some new light on this mystery. Any help would be very greatly appreciated.   \n   \nSee [here](http://web.archive.org/web/20120107043906/http:/www.sugarbuzz.net/diamond.jpg) for a larger sample, a slightly smaller version of which is also attached to the bottom of this message.   \n ![Mystery Comparison](http://web.archive.org/web/20120107043906im_/http:/www.typophile.com/forums/messages/83/25072.jpg)   \n ![Enlargement of the 'd' showing the graceful swoop at the serif](http://web.archive.org/web/20120107043906im_/http:/www.typophile.com/forums/messages/83/25073.jpg)\n\n",
  "author": "<a href=\"/web/20120107043906/http://typophile.com/user/1797\" title=\"View user profile.\">James Gareth</a>",
  "time": "<br>",
  "uid": "1797",
  "comments": [
    {
      "time": "",
      "content": "I hope this doesn't duplicate something already being worked on by someone else, but I did a number of hunts. First, I looked the McGrew's 'American Metal Typefaces' for Caslons. There is only one that has a v even vaguely like the original DeBeers type and that is a Monotype version that no longer seems to exist. Caslon 540 seems the most like the sample. I used the MyFonts test drive and a couple of fonts I have on hand to build the follwoing sample sheet for comparison to the posted sample:   \n ![Caslon Italic Samples](http://web.archive.org/web/20120107043906im_/http:/www.typophile.com/forums/messages/83/25079.gif)   \nIt seems that none of these has the rounded serif you emphasized, and this suggests to me that the work was a customized version of Caslon 540. Someone with more skill than I have could even do something as crude as convert the font to outlines and round out the corners (I thought about trying it, but I have other things to do -- sorry). Probaly a heavier weight than the ones I used might also look closer to the original.   \n   \nMy question is a pragmatic one (heretical though it may be in this group) -- how much does the serif on the d matter to you? Do you think even one person out of 100 would notice if you reproduced the phrase with an existing Caslon Italic of the right weight and spacing? Without them being side-by-side, I doubt if I would notice the difference. (Can I keep coming here, even after uttering such an outrage?)   \n   \nBTW, I did look in my Photo-Lettering book and there are a raft of Caslon italics, but no complete enough samples to say that any of them might have been used. Most did not look very close. I think De Beers could afford to have a customized typeface designed for their ads.\n\n"
    },
    {
      "time": "",
      "content": "I agree with Mike. I also think the \"v\" is probably a modified Caslon \"y\".\n\n"
    },
    {
      "time": "",
      "content": "Thanks for your help guys!   \n   \nI heartily agree that the y was modified in the De Beers font, but this is likely the **only** modification that was made to the font. In my opinion it is definetly **not** a modification of Caslon 540 but rather it's own version of Caslon (see images below). The evidence is that Caslon Rough is 99% the De Beers font. They couldn't both be coincidently modified Caslon 540s and look that much alike.   \n   \nIf I find the source of Caslon Rough, I've found my diamond font. I dont' care about he curly 'v'. If J. Walter Thompson got hold of it and modified it, and Elsner and Flake got hold of it separately, and roughened it, it has to be around somewhere.   \n   \nAnd yes, Mike, this font is my white whale. I must have the swooping rounded serifs. It's become more than a font but rather a journey ![:-)](http://web.archive.org/web/20120107043906im_/http:/www.typophile.com/forums/clipart/happy.gif) I hope you will help me on it!   \n   \n ![](http://web.archive.org/web/20120107043906im_/http:/www.typophile.com/forums/messages/83/25130.jpg)\n\n"
    },
    {
      "time": "",
      "content": "It's very odd. I went to the EF site and examined Caslon Rough more closely. I'm unable to find any version of Caslon--metal, photo, digital, whatever--that resembles it. I also find it odd that they would have said it was based on a \"phototype Caslon from the 1980s of ATF origin.\" As far as I know very few phototype fonts were created in the 1980s--everything was going digital by then. ATFs Caslons are easy to find, but none that I looked at are even close to EF's. And I don't think ATF would be doing new designs in the 1980s (if that's what was meant).\n\n"
    },
    {
      "time": "",
      "content": "Not only that Mark, but ATF was out of business by 1933 (see [this Columbia University site](http://web.archive.org/web/20120107043906/http:/www.columbia.edu/cu/lweb/data/indiv/rare/type-exhibit/atf.htm) for history).   \n   \nThis would make more sense if the ATF origin was the 1890's, although I'm a bit surprised that you say there wasn't much photo type being developed in the 80's. I just bought a book from 1980 by the esteemed Allan Haley (now of Agfa-Monotype) called \"Phototypography\" in which there is no clue that the digital font era was anywhere in sight. I realize that might have quickly changed, but I would still expect something to have been going on at least into the mid 80's. That's around the time when Phil's Photo and Solotype were reaching their peaks, isn't it?\n\n"
    },
    {
      "time": "",
      "content": "I went back into my library and looked through the Caslon samples in my 1936 Linotype catalog. Caslon Old Face seems to have some of the characteristics that are closer to your Caslon Rough. The only digital version of it I could find was Bitstream's. The serifs angle upwards a bit more, although the corner is still not as rounded. These were done with Test Drive samples:   \n ![Caslon Rough vs Old Face](http://web.archive.org/web/20120107043906im_/http:/www.typophile.com/forums/messages/83/25160.gif)\n\n"
    },
    {
      "time": "",
      "content": "Yes, there was still phototype in the eighties. But digital was rapidly making inroads in the very early eighties. A publisher I was working for got a Linotron 202 system about 1981. It was CRT-based, but digital nonetheless. My recollection is that the systems for setting headline type--mainly the VGC Typositor--were being undermined by ever-higher-quality automatic typesetting systems, especially digital ones. I'd have to look at my back-issues of U&lc, but I think outfits like VGC were also losing touch with designers' sensibilities and releasing increasingly irrelevant faces.   \n   \nAnyway, I'm rambling here. I would love to know more about the source of EF's Caslon. Caslon, in all its various incarnations, is a longtime favorite of mine. Theirs is one of the more unusual ones I've seen.\n\n"
    },
    {
      "time": "",
      "content": "_ATF was out of business by 1933 (see this Columbia University site for history)._    \n   \nThat can't be right. ATF's released their last typeface, Americana, in 1965. I have ATF catalogs from 1941 and 1955.\n\n"
    },
    {
      "time": "",
      "content": "Ooops! Look what happens when you trust the first source you find information.   \n   \nThe MyFonts profile on ATF says they were acquired by Kinglsy in 1986 and that combination went defunct in 1993.   \n   \nNever mind... Sorry for the misiniformation. I will check multiple sources in the future.\n\n"
    },
    {
      "time": "",
      "content": "I just looked over my information from Ms. Elsner, and it seems that Caslon Rough was created in the 1980s (when exactly she didn't specify) for a German company who delivered the ATF phototype originals. I hope this clarifies things a bit. Rereading it now, my original message in this post doesn't make that clear. Sorry. That's about all the information I have.   \n   \nMike, Caslon Old Face looks terribly close. Thanks for that. I should probably place it on my wanted list.   \n   \nI only wish I knew what the name of that original phototype font was. Sigh. The road goes ever on ...\n\n"
    },
    {
      "time": "",
      "content": "The thing that confuses me is your phrase \"ATF phototype originals.\" As far as I know, ATF only did metal foundry type for hand setting. Nearly all of their fonts were done later as phototype and still later as digital type, but not by them (if you don't count the few that Kingsley issued in PostScript around 1990--I don't). You do mean ATF as in American Type Founders, right?\n\n"
    },
    {
      "time": "",
      "content": "I'm only working from the information Ms. Elsner gave me, which was brief, and perhaps the extent of her recollection since it happened a while ago. Yes, I assumed her ATF to mean American Type Founders. I know very little about phototype so this didn't strike me as strange.\n\n"
    }
  ]
}
