{
  "id": "28735",
  "title": "Is there a good manual for legal use of fonts for designers and their clients?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "What should you do about these things:\n\n1) Is it legal and within my rights to send fonts to the printer when the job goes to press?  \n2) If a client sends you fonts on a disk for a job that a previous studio created is it legal to use the fonts?  \n3a) If a designer buys a font to use for a particular client does that client have the right to use the font?  \n3B) If a designer buys a font to use for a particular client does the designer have the right to use the font for a different client?  \n4) How do most design studios manage their font licenses?\n\n",
  "author": "packagingdesign",
  "time": "10 Oct 2006 — 4:51pm",
  "uid": "14880",
  "comments": [
    {
      "time": "10 Oct 2006 — 5:09pm",
      "content": "[http://www.aiga.org/resources/Content/4/6/0/documents/AIGA\\_2Font.pdf](http://web.archive.org/web/20131015170746/http:/www.aiga.org/resources/Content/4/6/0/documents/AIGA_2Font.pdf \"http://www.aiga.org/resources/Content/4/6/0/documents/AIGA\\_2Font.pdf\")  \n [http://www.justasksam.co.uk/download/Eight\\_Golden\\_Rules.pdf](http://web.archive.org/web/20131015170746/http:/www.justasksam.co.uk/download/Eight_Golden_Rules.pdf \"http://www.justasksam.co.uk/download/Eight\\_Golden\\_Rules.pdf\")  \n [http://typophile.com/wiki/EULA](http://web.archive.org/web/20131015170746/http:/typophile.com/wiki/EULA \"http://typophile.com/wiki/EULA\")\n\n"
    },
    {
      "time": "10 Oct 2006 — 6:40pm",
      "content": "Doubtless Ms Wardle will be along shortly to address this series of questions; she is expert in this matter.\n\nThe answer to all questions is: check the EULA for the typeface(s) in question. Foundries' EULAs are a very mixed bag, and each foundry dis/allows different things.\n\nTo answer each question a little bit less globally...\n\n1) Check the EULA. Some foundries allow this. Some do not. Some will allow outlining of fonts to vector art, some will not. Some will allow embedding in PDF artwork, some will not...\n\n2) Check with the client and/or the foundry. The client may have arranged a license which allows them to sub-license the fonts to their vendors for specific uses or projects. (These sub-licenses are rarely made clear to the vendors.)\n\n3a) Check the EULA. Most licensing arrangements will be \"site-specific\" or \"company-specific\". Most foundries will ask either that the client licenses the typeface(s) separately, or if the designer wishes to send the typeface(s) to her client, that the designer has licensed the fonts in such a way that all end users are covered.\n\n3B) Check the EULA. However, it is pretty safe to say that if a designer licenses a retail typeface, the use of that typeface is not restricted to specific clients of projects, and is will not expire. If the typeface is a custom or bespoke creation, there will almost certainly be stipulations about use.\n\n4) This is a question for the ages, which has vexed man since the time of the Roman Empire. In my personal experience, (most) studios, regardless of size or budget, buy the smallest possible licensing for a typeface, and never think about it again. They proceed to include it in artwork releases to service bureaux, and will send it away to clients without a second thought. Most designers ignore EULAs, even though they have agreed to them in the course of a license purchase.\n\n"
    },
    {
      "time": "11 Oct 2006 — 8:28am",
      "content": "1) I can't imagine a graphic designer anywhere would abide by a license that would not allow outlining fonts as vector art when the work product is sent to the printer.\n\n4) That has been my experience as well. Most design firms have no idea where their fonts came from.\n\nSo, does anyone out there work for a design firm that ethically, legally manages their fonts? I'd sure like to hear about how they went about it. They must have had to do a review of what they had and make some kind of new policy. I have fonts that were purchased, sent to me by clients, etc. Most are not on an original disk and therefore do not have the original license. Some do, some don't have the license in the same folder as the font. What do you do about that? Burn it to the ground and start over? Re-buy them all? What do you do about fonts that were purchased from long defunct retailers like Eyewire if you can't find the license you must have received when you made the purchase?\n\n"
    },
    {
      "time": "11 Oct 2006 — 12:37pm",
      "content": "Hi. Ms. Wardle here. Mr. Village has answered as I would have done had I seen this thread earlier.\n\nThe first line of action is, as Village has stated, to read the EULA for the foundry. You might think it dampens your creativity, but it saves you headaches -- should you choose to be above board -- in the end.\n\nVery few EULAs disallow turning the type to outlines. At least those which I've read and am familiar with.\n\n_1) Is it legal and within my rights to send fonts to the printer when the job goes to press?_\n\nVery few foundries allow for this. Check the EULA for all foundries.\n\n_2) If a client sends you fonts on a disk for a job that a previous studio created is it legal to use the fonts?_\n\nI'd be willing to bet that 9.9 out of 10 times the company has not licensed the fonts to allow for distribution to other daughter companies. You need to check with the client. If they stare back at you with glazed over eyes proceed to the phone and call the foundries necessary and properly license the fonts to protect yourself. Foundries are watching who uses their fonts.\n\n_3a) If a designer buys a font to use for a particular client does that client have the right to use the font?_\n\nShort answer, no. Long answer, if you licensed a font to use on a client's project the best thing you could do is have the client also license the font so they can use it if need be. There are some foundries which have EULAs that allow for transferring of the license. (Transferring means you would have to give the clients the font, alert the foundry to the new address and user, and remove it from your computer. But you might know that.)\n\n_3B) If a designer buys a font to use for a particular client does the designer have the right to use the font for a different client?_\n\nYes. The license is in the designer's name with the designer's location and can be used until you are sick of the font.\n\n_4) How do most design studios manage their font licenses?_\n\nI manage mine with patience and a huge paper trail. If you really want to make sure you are kosher on all counts you could call the foundries from who you have fonts and double-check to make sure you are legal. If not I'm sure they'd be more than happy to work that out with you over the phone.\n\n"
    },
    {
      "time": "11 Oct 2006 — 12:38pm",
      "content": "Note: Just because you have the license in the same folder as the font, doesn't mean you are legally authorized to use the font.\n\n"
    },
    {
      "time": "11 Oct 2006 — 12:39pm",
      "content": "Burning it to the ground is drastic, but at least you'd know you are legal. ;^)\n\nSeriously, when ever I doubt something I call the foundry. That is your best line of defense.\n\n"
    },
    {
      "time": "11 Oct 2006 — 3:34pm",
      "content": "Goldarn EULAs!\n\nEven if you do call the foundry, you have to know when, and from whom, you made the purchase...different sources offer different terms, and the terms of some EULAs have been altered over the years. Which version was in force when you made your purchase? Did the agreement you made allow for after the fact changes to the agreement?\n\nA weird example:  \nIf you buy FB Californian from Font Bureau, you have to pay extra to make a PDF with it, but if you picked up the \"Greetings 2000\" CD (Microsoft, with a \"Hallmark connections\" label) a few years ago for 20 or 30 bucks, you own a TT version of FB Californian that has its font embedding settings set to \"editable embedding\"! FB presumably knew what it was doing when it set those bits. What \\_are\\_ you allowed to do with this version?\n\nSo the moral is, I guess, try to keep track of these things as you acquire fonts.\n\n"
    },
    {
      "time": "11 Oct 2006 — 4:01pm",
      "content": "John you speak the truth.\n\nLicensing type and keeping track of where you licensed it is a nasty but very necessary evil.\n\nThe sticky part being that EULAs have always been a part of the \"buying\" process. (buying=licensing) As such, it has always been the end-user's responsibility.\n\nIt isn't like the EULA is a new thing. So you can't blame the foundries for our lack of organization of our license. Right?\n\n"
    },
    {
      "time": "11 Oct 2006 — 4:15pm",
      "content": "\\>Burning it to the ground is drastic, but at least you’d know you are legal. ;^)\n\nBut burning it to a DVD (putting it in a drawer) and then scrubbing the fonts on the hard disk may be a more sensible policy. \"What DVD officer? I've never seen it before.\"\n\n\\>If you buy FB Californian from Font Bureau\n\nWe tend to license fonts with editable embedding permissions, we pay for that and pass the savings on to you.\n\n"
    },
    {
      "time": "12 Oct 2006 — 1:37pm",
      "content": "Anyone here work for a design firm of 15-100 employees that is managing their fonts in a legit way? I'm not talking about font designers or little mom-and-pop design shops of 2 or 3 artists. I feel like this discussion is a taking place in a hypothetical fantasy world where designers actually care about font licenses, etc. Lets face it--most don't. Not trying to be a smart ass but does anybody have real world experience how the big design firms do this?\n\nI am trying to develop a strategy and justification for design firms going legit.\n\nAlso, are most of you font designers, graphic designer or both? Most graphic designers I know would not know an EULA from a double-grande-nonfat-latte.\n\nThanks.\n\n"
    },
    {
      "time": "12 Oct 2006 — 1:39pm",
      "content": "Wow, you can't type the A-word for butt here. Cool. But SMART-BUTT does not work very well.\n\n"
    },
    {
      "time": "12 Oct 2006 — 1:39pm",
      "content": "I'm a graphic designer, and I'd guess that most of the people on Typophile, a majority let's say, are graphic designers. Everyone that comes to Typophile, sooner or later, learns about the EULA.\n\n"
    },
    {
      "time": "12 Oct 2006 — 1:49pm",
      "content": "\\>I feel like this discussion is a taking place in a hypothetical fantasy world where designers actually care about font licenses, etc. Lets face it—most don’t.\n\nYou're right - but many designers learn the hard way - they may pick a font for a client's branding project that can't be legally embedded in a PDF - oops, or that has a high-per-seat license fee for every user. Designers who don't get up to speed on font licensing issues don't progress very far within organizations such as the one you describe.\n\nHow about SMART-A$$? that works.\n\n"
    },
    {
      "time": "12 Oct 2006 — 2:03pm",
      "content": "\\>Designers who don’t get up to speed on font licensing issues don’t progress very far within organizations such as the one you describe.\n\nI have to strongly disagree with this statement. Design firms have little interest in designers being able read a EULA. Designers in big firms usually do not make such purchases. They tell someone to do it and its done. Designers progress in big shops because of design talent not purchasing decisions.\n\n"
    },
    {
      "time": "12 Oct 2006 — 2:07pm",
      "content": "\\>I have to strongly disagree with this statement.\n\nI've seen enough examples of designers and firms getting into hot water over these issues to know that it's the case.\n\n\\>Designers progress in big shops because of design talent\n\nNow who's living in fantasy land? ;-)\n\n"
    },
    {
      "time": "12 Oct 2006 — 2:10pm",
      "content": "Yes, you are right, designers aren't paid to understand EULAs. In a large company it isn't up to the designer to make sure all of the fonts are legal. It is up to those in charge to make sure the machines are clean. I don't argue this point.\n\nThe studio of which you are painting a picture, are you the one in charge of getting things legit? Can you say the designers won't take the fonts with them when they leave? Wouldn't a little education go a long way?\n\n"
    },
    {
      "time": "12 Oct 2006 — 2:15pm",
      "content": "OK. I guess your experience is different.\n\nDo you know of a good case study in which a large American graphic design firm made a transition to legit font licenses?\n\n"
    },
    {
      "time": "12 Oct 2006 — 2:19pm",
      "content": "Miss Tifanny,\n\nNo, yes, yes.  \nBut I am attempting to tackle this project.\n\n"
    },
    {
      "time": "12 Oct 2006 — 2:33pm",
      "content": "I don't know of any case studies. Perhaps Simon does. But I would think that the bean counters at your company would have kept receipts from the purchases. Or am I being to hopeful? That would be one place to start. If they have receipts then you can begin separating the legal from the not-legal.\n\n"
    },
    {
      "time": "12 Oct 2006 — 2:56pm",
      "content": "maybe JLT could comment?\n\n"
    },
    {
      "time": "12 Oct 2006 — 9:27pm",
      "content": "\\>Perhaps Simon does\n\nNo, but I'd start with Monotype UK - they've worked on font auditing solutions for many years.\n\nIP management solutions in general are in the dark ages - I have numerous licensed photos but I have no idea what the industry standard software for managing digital images is - where licensing terms are even more complex than fonts.\n\nI recall Laurence Penney talking about the problem with respect to map makers who have to use all kinds of IP in the maps they produce. He went to a conference on the subject and posted the parallels to the font world.\n\n"
    },
    {
      "time": "16 Oct 2006 — 11:31am",
      "content": "True to form Monotype UK weigh in on issue this for DIGIT magazine\n\n[http://www.digitmag.co.uk/features/index.cfm?FeatureID=1517](http://web.archive.org/web/20131015170746/http:/www.digitmag.co.uk/features/index.cfm?FeatureID=1517 \"http://www.digitmag.co.uk/features/index.cfm?FeatureID=1517\")\n\nscroll down to 'fonts'.\n\n"
    }
  ]
}
