{
  "id": "28746",
  "title": "Death of Cursive",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "<cite>“The computer keyboard helped kill shorthand, and now it’s threatening to finish off <a href=\"http://web.archive.org/web/20081015142228/http:/www.typophile.com/wiki/longhand\" class=\"wiki-create\">longhand</a>.</cite>\n\n<cite>When handwritten essays were introduced on the SAT exams for the class of 2006, just 15 percent of the almost 1.5 million students wrote their answers in <a href=\"http://web.archive.org/web/20081015142228/http:/www.typophile.com/wiki/cursive\" class=\"wiki\">cursive</a>. The rest? They printed. <a href=\"http://web.archive.org/web/20081015142228/http:/www.typophile.com/wiki/block%252Bletters\" class=\"wiki-create\">Block letters</a>.”</cite> - Wash Post\n\nThe rest of the article is here:\n\n[http://www.washingtonpost.com/wp-dyn/content/article/2006/10/10/AR200610...](http://web.archive.org/web/20081015142228/http:/www.washingtonpost.com/wp-dyn/content/article/2006/10/10/AR2006101001475.html \"http://www.washingtonpost.com/wp-dyn/content/article/2006/10/10/AR2006101001475.html\")\n\nIt’s interesting that this is happening even as scripts fonts are perhaps as popular as they have ever been. Maybe there is a connection even.\n\n [‹ Test your skills](http://web.archive.org/web/20081015142228/http:/www.typophile.com/node/28887 \"Go to previous forum topic\") [I love typophile ›](http://web.archive.org/web/20081015142228/http:/www.typophile.com/node/28861 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081015142228/http://www.typophile.com/user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": " 11.Oct.2006 8.30am",
      "content": "I think there is a definite correlation. Scripts are looked upon as an artform that is “new” to this young generation. With script fonts, they get to avoid actual handwriting, yet have the look of the perceived artform. Old fogies like me who had their wrists slapped for poor penmanship and never learned to type, have a different outlook:-)\n\nStudents now take notes on a laptop and “pass notes in class” using text messaging on cell phones. Handwriting today is mostly self-communication and rarely is intended for reading by others. When this generation becomes teachers, handwriting will become something to be studied by archeologists and historians instead of school children.\n\nChrisL\n\n"
    },
    {
      "time": " 11.Oct.2006 8.31am",
      "content": "Though I doubt that this is widely the case, my interest in type design and typography (aside from my background in art and design in general) grew out of the fact that handwriting has always been painful for me, both physically and psychologically. If penmanship instruction were treated as an art rather than a reinforcement of obsessive-compulsive behaviors from the earliest levels, I might have had a different attitude about it.\n\n"
    },
    {
      "time": " 11.Oct.2006 8.43am",
      "content": "I think their point about the SAT is only partially correct. Every single teacher I have ever had has told me to NEVER use cursive in an essay or on a test. In fact, I would get marked off points because of it. Teachers don’t want to have to decipher hieroglyphics just to grade a paper.\n\nNow, whether that is because of <cite>their</cite> lack of training, who knows?\n\n"
    },
    {
      "time": " 11.Oct.2006 9.24am",
      "content": "I’m not sure it’s lack of training, Dan. Teachers only have so much time to mark papers — they barely have enough time now to skim through them as it is to ensure the student has some sort of grasp of the topic. Throw in having to decipher poor handwriting, and you’d get even more of them quitting.\n\nLike Chris, I’m also in the “old fogey” category of having had cursive beaten into me at school: mine was pretty bad until I took a course in calligraphy as a teenager, and then it actually became legible.\n\nFor awhile, that is, until I started spending way too much time in front of a computer. ;-) I think the only reason it’s still as functional as it is could be because I still edit hard copies, by hand, with a red pencil, most of the time. And I’ve got an old friend who still has the most incredible cursive hand — a quick note from him looks like a fine engraved invitation. I’m jealous!\n\nPerhaps it’s come down to “those who can write beautiful cursives, do: those who can’t, use (insert name of favourite cursive font here).”\n\nSad....\n\nLinda\n\n"
    },
    {
      "time": " 11.Oct.2006 9.40am",
      "content": "<cite>Perhaps it’s come down to “those who can write beautiful cursives, do: those who can’t, use (insert name of favourite cursive font here).”</cite>\n\nIf only it had ever been as simple as “those who can do, those who can’t are just people who will always have crummy handwriting so let’s just accept it.” I’m a big believer that so many people hate cursive because they got sick of elementary school teachers complaining about every little loop not being perfect, so they just stopped using it as soon as they hit sixth grade. It’s kind of like Matisse and his drawings–he just stopped showing them to people, so nobody saw most of them until after he died.\n\n"
    },
    {
      "time": " 11.Oct.2006 9.47am",
      "content": "_I’m a big believer that so many people hate cursive because they got sick of elementary school teachers complaining about every little loop not being perfect, so they just stopped using it as soon as they hit sixth grade._\n\nMaybe that’s more of an indictment about how cursive is taught more than anything else. So long as my teachers could read it, they weren’t anal-retentive about exact forms. ;-)\n\nI was also lucky to have several teachers in high school who had unique (well, for the 60’s in Canada!) scripts and actually encouraged students to inject some individuality into their own handwriting: bet that doesn’t happen much anymore....\n\nL.\n\n"
    },
    {
      "time": " 11.Oct.2006 10.15am",
      "content": "And yet, there are many Graphic Designers who refuse to use script fonts because, well, they look like fonts. Not script.\n\nSince we’re in the same sort of field as lettering artists, we should be saying, “Yay Lettering Artists! Job security!”\n\nThe same could go for type-designers.\n\n"
    },
    {
      "time": " 11.Oct.2006 10.28am",
      "content": "Dan, by “they look like fonts. Not script.” do you mean that they are just too precise? That’s how I’m reading it, and I whole-heartedly agree with you from a designer perspective. When I wrote “those who can’t use (font name here)” I pretty much meant average users. :-)\n\n"
    },
    {
      "time": " 11.Oct.2006 10.55am",
      "content": "_Maybe there is a connection even._\n\nMcLuhan’s Third Law: Retrieval.\n\n"
    },
    {
      "time": " 11.Oct.2006 11.54am",
      "content": "Nice one Nick! Care to elucidate further?\n\n"
    },
    {
      "time": " 11.Oct.2006 11.55am",
      "content": "I recall that when Signature Software/VLetter were promoting their handwriting to TTF fonts they made the claim that the process would improve the author’s handwriting, via the process of regularization.\n\n\\>And yet, there are many Graphic Designers who refuse to use script fonts because, well, they look like fonts. Not script.\n\nBickham Script Pro has proven that with enough OT programming you can fool most of the people most of the time, even if you can’t fool professional designers all of the time.\n\nI agree with Dan’s other point. Calligraphers, type designers, font vendors and definitely OpenType engineers should see the death of cursive as a huge marketing opportunity. People and companies will always need “handwriting” and those that can provide it will be in high-demand.\n\n"
    },
    {
      "time": " 11.Oct.2006 12.10pm",
      "content": "For me, my handwriting is atrocious at best. Not that you can’t read it, but I mix cursive and plain lettering together. It’s also a little sloppy.\n\n"
    },
    {
      "time": " 11.Oct.2006 12.15pm",
      "content": "i never was comfortable writing cursive, except in russian. i don’t know why that is.\n\n"
    },
    {
      "time": " 11.Oct.2006 12.38pm",
      "content": "I’d heard someone say that Russian cursive is the most illegible written language in the northern-hemisphere - maybe that’s why it’s easy to do - everyone accepts that it cannot be read?\n\n"
    },
    {
      "time": " 11.Oct.2006 12.41pm",
      "content": "Previous article along these lines from the Guardian...\n\n[http://arts.guardian.co.uk/features/story/0,,1709225,00.html](http://web.archive.org/web/20081015142228/http:/arts.guardian.co.uk/features/story/0,,1709225,00.html \"http://arts.guardian.co.uk/features/story/0,,1709225,00.html\")\n\n"
    },
    {
      "time": " 11.Oct.2006 12.42pm",
      "content": "_I’d heard someone say that Russian cursive is the most illegible written language in the northern-hemisphere_\n\ninteresting, most native Russians that i’ve known have had beautiful handwriting (which was perfectly legible).\n\n"
    },
    {
      "time": " 11.Oct.2006 1.43pm",
      "content": "McLuhan’s Laws:\n\n[http://www.anthonyhempell.com/papers/tetrad/concept.html](http://web.archive.org/web/20081015142228/http:/www.anthonyhempell.com/papers/tetrad/concept.html \"http://www.anthonyhempell.com/papers/tetrad/concept.html\")\n\n"
    },
    {
      "time": " 11.Oct.2006 2.13pm",
      "content": "Of course this will also fly in the face of what Gerrit Noordzij wants as well - a resurgence of hand writing & a sort of taking of responsibility for it. Then again, perhaps ’retrival’ is possible for the hand writen form too.\n\n"
    },
    {
      "time": " 11.Oct.2006 2.22pm",
      "content": "Stylus or mouse?\n\n"
    },
    {
      "time": " 11.Oct.2006 2.25pm",
      "content": "Digital Typography may well be the retreval of handwriting in modern terms. Look at text messaging shorthand. We redifine handwriting into thumb writing: “hope ur ok ru”\n\nChrisL\n\n"
    },
    {
      "time": " 11.Oct.2006 2.40pm",
      "content": "Why is cursive only called “handwriting” and not printing, printing being viewed as some sort of drooling, in-bred cousin that no one wants to acknowledge? Both styles are written by hand, are they not?\n\nI prefer to print, but even then I connect letters in a very cursive-like way. So you could say I curint or pursive. Or not.\n\nIn today’s world, cursive and its close relative calligraphy, are pretty much relegated to vacation postcards, wedding and other invitations, and national constitutions. While cursive feels more personal, that personal feeling also hampers its legibility. After all, you can easily read your cursive writing because it’s written by you. Hand it to someone else, and they might have some difficulty (exhibit 1: doctor’s prescription notes).\n\nI wonder if Egyptian teachers 1900 years ago complained that only 15% of their SAT students knew how to write in hieroglyphics?\n\n"
    },
    {
      "time": " 11.Oct.2006 3.01pm",
      "content": "<cite>Digital Typography may well be the retreval of handwriting in modern terms. Look at text messaging shorthand. We redifine handwriting into thumb writing: “hope ur ok ru”</cite>\n\nThis would be a great time to start designing a handwriting face that renders legibly on small screens and has ligatures for 1337speak. It won’t be long before we’re all hauling around a PDA/phone/iPod device that could render it pretty well...\n\n"
    },
    {
      "time": " 11.Oct.2006 3.41pm",
      "content": "Does the education system have it backward? They start teaching kids to read printed letters and they follow that with learning to write the same block letters. Then when they’re 8 or so they start learning cursive.\n\nSpeaking as a parent, I’ve found myself thinking how disadvantaged my kids will be if they don’t learn to type. But I haven’t felt the same impetus to get them to have beautiful penmanship even though they are starting to learn cursive in school.\n\n"
    },
    {
      "time": " 11.Oct.2006 4.09pm",
      "content": "acutally, [the D’Nealian writing method](http://web.archive.org/web/20081015142228/http:/en.wikipedia.org/wiki/D%27Nealian), which is one of 2 popular writing methods taught in the US teaches a form of writing that builds up to cursive writing.\n\n"
    },
    {
      "time": " 11.Oct.2006 6.34pm",
      "content": "You grow up until about 3rd grade only knowing one way to write: Print. You always see Mom and Dad scribbling away with their cursive, which looks damn fun, but you have no I idea how to do that. Then in 2nd or 3rd grade they throw cursive at you, so now you know an “adult” alphabet of entirely different characters.\n\nYou use that for a while, until one day your school makes you take a shop/drafting/whatever class and then it’s back to the same letters you learned in Kindergarten.\n\nConfused the hell out of my handwriting, for sure.\n\nNo wonder the Modernists wanted to simplify our alphabet down to the very basics.\n\n"
    },
    {
      "time": " 11.Oct.2006 7.32pm",
      "content": "Yikes: if I had gone through that, I bet mine would have been a mess too.\n\nInstead, I got slapped down at kindergarten because I already had a rudimentary cursive hand: one of the benefits of home-schooling, I guess. My teachers made me print and go through all their silly drills anyway, but my handwriting didn’t really change much until high school, where I picked up the habit of writing Euro numbers (with the bar through the 7).\n\nOh yeah, and then my first serious job after university, when I had to hand-sign 40 letters. “Ruined” my signature ever since by making it hard to forge. ;-)\n\nLinda\n\n"
    },
    {
      "time": " 12.Oct.2006 1.33am",
      "content": "Computers didn’t kill cursive handwriting, superior pen technology did. It just took this long for the zombie to stop moving.\n\nFrom our perspective, it’s nice that it created more possible variants of letterforms. But from a practical perspective, what we’re looking at is a system derived from the artifacts of very messy writing, adapted over the years for the limitations of quills and nibs, and codified into bizarrely rigid rules for equally rigid schoolteachers. They drum these rules into modern kids who, with their graphite pencils and ball-point pens, have no idea what is so great about not lifting the pen from the paper that justifies suddenly making writing so complicated.\n\nI knew something was up in third grade, when the edict “NO LOOPS!” dominated our cursive exercises. Having been taught the previous year to write with looped ascenders by another teacher, I was already getting the idea that I was there to humor the whims of authority rather than to learn anything of real value.\n\nToday I have handwriting that comes in serif, semi-serif, sans, and italic. I can write in legible semi-serif faster than I could write in genuine cursive. I’m not even sure I remember off the top of my head exactly how all of those crazy-pretzel capitals are supposed to go.\n\n"
    },
    {
      "time": " 12.Oct.2006 7.28am",
      "content": "My parent’s generation (now in their 60’s) seems to be the last of the cursive writers. Even though we we were all taught cursive growing up, I don’t really see anyone using it at all.\n\n"
    },
    {
      "time": " 12.Oct.2006 8.06am",
      "content": "I remember watching the adults write & read cursive & I even went so far as to attempt it without instruction - of course I just got scibbles. Even though I sympathize with the reaction some people have had to arbitrairy rules set down by dogmatic teachers; I still think cursive is wonderful and expresive and ultimately worthy. Then again I had beautiful handwritting to look at as a kid. That probably has something to do with it. And I have to admit, mine is not so wonderful.\n\n"
    },
    {
      "time": " 12.Oct.2006 8.54am",
      "content": "Well Darrell, I guess that puits me inyour parents’ generation :-)\n\nGen “C” (for cursive)\n\nChrisL\n\n"
    },
    {
      "time": " 12.Oct.2006 9.21am",
      "content": "I was taught cursive (in 1960), but the only reason I still use it is that I took calligraphy classes around 1980, for professional development as a type designer/typographer.\n\n"
    },
    {
      "time": " 12.Oct.2006 9.50am",
      "content": "Doesn’t Steve Jobs bang on about the importance of calligraphy - maybe he’d be willing to sponsor a publictiy campaign...\n\nHello I’m Type  \nHello I’m Cursive\n\nCheers, Si\n\n"
    },
    {
      "time": " 12.Oct.2006 10.27am",
      "content": "Jobs likes cursive because of all the connectivity it comes with right out of the box :-)\n\nChrisL\n\n"
    },
    {
      "time": " 12.Oct.2006 10.32am",
      "content": "I can see the ads now.\n\nType: Look at all these little pieces I have! If I can find the magnetized sheet in another box, maybe I can actually do something useful.\n\nCursive: Wow. I’ve got the wind in my hair, the sun in my eyes, and I’ve just produced the entire works in Shakespeare in 127 different languages.\n\nLinda\n\n"
    },
    {
      "time": " 12.Oct.2006 10.46am",
      "content": "Business schools taught cursive script in the 19th century, because it was needed in bookkeeping, etc. Now there is no practical reason for the majority of the population to know it, which is also why art, music, and sport get such short shrift in high school.\n\nBut this is not to say that the present system condemns most students to be only consumers of culture, because there are new media, and who knows where “user generated content” will lead; blogging is a creative, interactive literary medium, then flickr, then youtube...\n\n"
    },
    {
      "time": " 13.Oct.2006 2.33am",
      "content": "It seems to me that this is mostly an American thing. I’ve grown up in Germany and now live in Denmark and at 22 I wouldn’t call myself old-school, but I and most people I know use cursive (at least to some extent) for everyday writing. In fact, neatly written block letters, with a bit of childish awkwardness because they aren’t as neat as “real” printing and not quite as fluid as handwriting, especially over longer passages are something I ultimately associate with the time when I was an exchange student at a High School near Philadelphia, PA.\n\n"
    },
    {
      "time": " 13.Oct.2006 6.41am",
      "content": "“which is also why art, music, and sport get such short shrift in high school.”\n\nSports has never suffered in the midwest of the US. Granted, the arts have. Alas, I don’t think that’s quite in the same camp as to why Cursive is falling out of favor...it’s just that people do not use it. My generation was taught it, but no one I know uses it. The computer hasn’t helped it survive either. It’s just time for it to go, it seems.\n\nAnd you bring up a good point, Nick. Perhaps gap in the system where cursive once fit in is now replaced with knowing HTML and smilies and LOL/OMG/WTF texting ’language’. ;o)\n\n"
    },
    {
      "time": " 13.Oct.2006 8.24am",
      "content": "-I’m teaching a bit of cursive as part of my Digital Lettering class. It’s different from how type works, and design students can learn from it without taking an entire semester of handlettering or calligraphy. It would be nice if cursive could live on outside of art school, though.\n\n-Many schoolteachers, even in past pre-computer decades, had poor handwriting instruction themselves. See comments on this by Rosemary Sassoon and others.\n\n-American handwriting advocates point out italic can learned without joining, and then made cursive later. Plus, no loops to get in the way.\n\n"
    },
    {
      "time": " 13.Oct.2006 9.00am",
      "content": "“Plus, no loops to get in the way.”  \nand might have saved me a few whacks across the knuckles with a ruler as a child :-)\n\nChrisL\n\n"
    },
    {
      "time": " 13.Oct.2006 9.10am",
      "content": "As well as picking up the nickname as “The Claw”? ;-)\n\n(One of my teachers did that to one kid so much that he had the clutched, bloody hand from time to time.)\n\nLinda\n\n"
    },
    {
      "time": " 13.Oct.2006 9.27am",
      "content": "Fully cursive speedball writing is the hardest thing to read, I figure.  \nIf you flip (mirror) all kinds of writing, it is the hardest to read, even for an accomplished reader. At least with a stressed (broad pen) nib, fully cursive, the stressing gives some cues as to which strokes are part of the letter and which are joins.\n\nIf software could be created to read cursive speedball script, that would be very useful in discovering much about the reading process. What is the state of the art on this? Is it true that OCR software only works for discrete letters?\n\nI wonder if being able to write cursively has an effect on how fluently one is able to read it — I mean, greater than for printed type. Have any studies been done on this?\n\n"
    },
    {
      "time": " 15.Oct.2006 8.58pm",
      "content": "_This would be a great time to start designing a handwriting face that renders legibly on small screens and has ligatures for 1337speak._\n\nHmmm. Can I borrow this idea?\n\nI’m not in Chris’s or Linda’s generation. Thank goodness. The last signifigant memory I have of Penmanship class, which was a tiny slot within Spelling, was of our Fourth grade teacher leacturing us on how we would all be getting whacked thouroughly for the forms of our script, if it had been an earlier time. She lamented that that avenue was lost. She then went on to point out that she would have been no less sparing on me, though ’that time’ would have had my functional hand tied behind my back.\n\nNo wonder its a lost art. So is bridenapping.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20081015142228/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": " 15.Oct.2006 9.59pm",
      "content": "\\>No wonder its a lost art. So is bridenapping.\n\nNot if you live in Salt Lake City...\n\n[http://www.comcast.net/news/national/index.jsp?cat=DOMESTIC&fn=/2006/10/...](http://web.archive.org/web/20081015142228/http:/www.comcast.net/news/national/index.jsp?cat=DOMESTIC&fn=/2006/10/03/491198.html&cvqh=itn_parentsbride \"http://www.comcast.net/news/national/index.jsp?cat=DOMESTIC&fn=/2006/10/03/491198.html&cvqh=itn\\_parentsbride\")\n\n"
    },
    {
      "time": " 16.Oct.2006 1.18am",
      "content": "Even when people use their finest “printing” hand, you can still see a bit of degeneration of letterforms. Is this the next evolution of the Roman alphabet?\n\n"
    },
    {
      "time": " 16.Oct.2006 5.19am",
      "content": "Si, I see the Boz is gone, the Seahawks obviously won :-)\n\nChrisL\n\n"
    },
    {
      "time": " 16.Oct.2006 10.24am",
      "content": "Yep, the Boz is gone, replaced with Deion Branch’s Neon Glove.\n\nTook a last second 54yd field goal to beat the Rams - I think our [field goal coach](http://web.archive.org/web/20081015142228/http:/images.nfl.com/u/photos/pl_704265.jpg) had something to do with it.\n\n"
    },
    {
      "time": " 16.Oct.2006 10.47am",
      "content": "Yeah, saw that play. I turned to my sweetie and said “well, at least Si will be happy....” ;-)\n\nChoz, you’re right about having your left hand tied behind you back in the old fart days. I was actually pretty good with both hands until I hit grade seven and had a doctrinairian who was strict, and that was the end of my days of writing well on both sides. (I do think it has helped my typing though!).\n\nLinda\n\n"
    },
    {
      "time": " 16.Oct.2006 7.09pm",
      "content": "Yeeeeee-e-e-sh. As I recalled that last night, I was somewhat hoping she had been pulling our legs, and we were just too scared then to get the joke. Nope, our fear of her was rightous.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20081015142228/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": " 16.Oct.2006 7.57pm",
      "content": "Well, at least I was discouraged and not sent into bondage. My parents would have been quite vocal in their displeasure had she gotten physical about enforcing her views.\n\nI’ve spent part of my day voraciously devouring Jessica Helfand’s “Reinventing the Wheel” (ISBN 1-56898-338-7, hardcover): if you want to see some amazing typography, this book is worth finding. Some utterly incredible photographs....\n\nLinda\n\n"
    },
    {
      "time": " 16.Oct.2006 8.14pm",
      "content": "Winterhouse books are beautiful. You just want to grab them and stare at the pages over and over.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20081015142228/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": " 17.Oct.2006 7.08am",
      "content": "It’s the first one of their’s that I’ve owned — I think I’m going to have to check out their website.... ;-)\n\nL.\n\n"
    }
  ]
}
