{
  "id": "28755",
  "title": "crit my logo please",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Its for a company called Mixed Economy Group (MEG) who helps universities get funding from the government to support colleges with both FE (further ed) and HE (higher education). So they are the core of it all if you know what i mean. these colleges would not get funded and would not run without them.  \nI want to give it a sense of belonging. I tried representing different coloured circles to represent different colleges but evolving round MEG because MEG is the foundation of it all. They are the core for those colleges/universities. how can i make it better? what typeface would be better suited for this. any ideas well come! thanks.  \nPS This is only the beginning of my logo. i am still in the process of making it work.i will keep updating it every now and then.\n\n ![](http://web.archive.org/web/20131023141648im_/http:/typophile.com/files/logo1_6588.png)\n\n",
  "author": "missgiggles",
  "time": "11 Oct 2006 — 1:59pm",
  "uid": "14600",
  "comments": [
    {
      "time": "11 Oct 2006 — 2:15pm",
      "content": "What's your current visual image? What do you want to achieve with your new logo? -- idea of the circles?\n\n"
    },
    {
      "time": "11 Oct 2006 — 2:32pm",
      "content": "sorry David, i have now expanded my comment.\n\n"
    },
    {
      "time": "11 Oct 2006 — 3:06pm",
      "content": "It's a nice looking design, although it doesn't work as well in black and white or on small sizes, so check and find out how it's most likely to appear. Regarding the text, I'd use Helvetica rounded to reinforce the circles and keep it contemporary.\n\n"
    },
    {
      "time": "11 Oct 2006 — 5:33pm",
      "content": "I'd like to see the circles interconnected instead of layed out one on top of the other...kind of like jumbled up olympic rings. That might reinforce the different colleges interrelating with each other around meg. Jpad's right about black and white though.\n\nGood luck,\n\nDavid\n\n"
    },
    {
      "time": "12 Oct 2006 — 9:25am",
      "content": "what if i had one colour but different opacity for each ring then it can work in black and white but then it wont represent the colleges on their own as an individual institution but i can turn the meaning around and say they are all under MEG and they on in thier catogory because there is another company like them (who are thier competitors) who only focus on HE and another company who focuses on only FE so i can say we are all of the same company by using opacity of same colour. what do you think? good or bad? thanks.\n\n"
    },
    {
      "time": "12 Oct 2006 — 11:02am",
      "content": "The big problem with it printing in B&W is that the values of the colors are so close-only the blue ring is distinct. Work up the values in percentages of gray, then reapply colors screened to match the gray values, or colors of similar value, and it should convert well to B&W.\n\n"
    },
    {
      "time": "15 Oct 2006 — 4:51am",
      "content": "im just wondering how the olympics logo got away with it not working in b/w because they too have different coloured rings? how did they go about it?\n\n"
    },
    {
      "time": "15 Oct 2006 — 4:54am",
      "content": "ive done a little more work to them. what do you think? should i have 5 rings like the olympics logo or leave it as 4? and do you think i should resemble the colours of the olympic logo or would that be a definately no no go area? thanks.  \nPS im trying to get my updated work on here and will not accept a pdf. how do i go about it? ive taken a screen shot and that wont work.\n\n"
    },
    {
      "time": "15 Oct 2006 — 6:34am",
      "content": "You can edit your first post to add another PDF to it. But you can't attach a PDF to a non-thread opening post. If you have the flash 8 plug-in installed in your browser, you should see a line of text underneath the comment window that says \"Insert image\". If you click on this, you can insert a JPG, GIF, or PNG in a comment post.\n\n"
    },
    {
      "time": "15 Oct 2006 — 7:15am",
      "content": "Hey Dan, i do have the 'Insert Image' under the comments window but it still won't attach. It keeps coming up as 'Could not copy image. Error' next to 'Insert Image'.\n\n"
    },
    {
      "time": "15 Oct 2006 — 9:27am",
      "content": "Try renaming the file to something unique, then redo the 'Insert Image'\n\n"
    },
    {
      "time": "15 Oct 2006 — 9:40am",
      "content": "David Jonathan Ross: when you said 'jumbled up olympic rings', did you meant like i have done or something else.\n\n ![](http://web.archive.org/web/20131023141648im_/http:/typophile.com/files/logos_b_5053.png)\n\n"
    },
    {
      "time": "15 Oct 2006 — 9:41am",
      "content": "these are the variations of the updated logo. thanks Mr Bailey :D\n\n ![](http://web.archive.org/web/20131023141648im_/http:/typophile.com/files/logos_4126.png)\n\n"
    },
    {
      "time": "15 Oct 2006 — 9:46am",
      "content": "Thanks, i have been trying to figure that out all day :D\n\n"
    },
    {
      "time": "15 Oct 2006 — 6:25pm",
      "content": "I kind of liked the concentrated arrangement of rings that you originally had. All I meant was that I'd like to see them go in front of and behind each other, linked together instead of being simply stacked. I think that interconnected rings would convey the overall shape better instead of existing as individual rings.\n\nI would have tried to simulate it with your logo, but the large version of the logo seems to be missing. So I'll try to illustrate what I mean in a poorly-rendered two second photoshop sketch:\n\n ![](http://web.archive.org/web/20131023141648im_/http:/typophile.com/files/rings_6593.png)\n\nThe left represents what you had, and the right represents what I meant...kind of. But now, seeing your logo at small sizes, I don't know if that will really make a difference. So take it or leave it.\n\nI like what you've been doing with the type, and prefer it within the rings instead of without. The all blue solutions do give you a better sense of the overall shape, and would definitely help with the black and white issue.\n\nHope this helps,  \nDavid\n\n"
    },
    {
      "time": "29 Oct 2006 — 5:09am",
      "content": "i;ve done more work to this logo and trying to make it work in b/w too so i went with one colour and done them in different gradients. what do you think? and i'm still wondering how the olympic logo would work in b/w when each ring is different colour and aren't logos suppose to be 2 colours excluding black and white? and do you think i should have the actual name of the company Mixed Economy Group under the logo like in this logo [http://typophile.com/node/29148](http://web.archive.org/web/20131023141648/http:/typophile.com/node/29148 \"http://typophile.com/node/29148\")\n\n ![](http://web.archive.org/web/20131023141648im_/http:/typophile.com/files/updated_logos_6087.png)\n\n"
    },
    {
      "time": "29 Oct 2006 — 6:10am",
      "content": "i was thinkingif i should add the actual name of the company with the initials in the logo too. i've done some more. please crit. thanks.\n\n ![](http://web.archive.org/web/20131023141648im_/http:/typophile.com/files/more_logos_5773.png)\n\n"
    },
    {
      "time": "29 Oct 2006 — 7:25am",
      "content": "Treat the mark and the logotype as two separate elements. Especially in this instance, as I think the logotype greatly detracts from the mark.\n\nYes, in school I was taught the same thing. If the logo/mark doesn't work in black and white only it can't be a very good logo. But, when you have the budget to control something, as the Olympics does, they never have to worry about there logo being in black and white. (ehe. Maybe they regret that sometimes.) The fact that you are going to great lengths to make sure your mark works in different ways is good. I think the single line weight as opposed to several is probably a safer bet. You might consider the line weight at different sizes. Are there fewer lines when it gets smaller?\n\n"
    },
    {
      "time": "29 Oct 2006 — 7:39am",
      "content": "I prefer this in a single colour with tints, the solid colour rings cancel each other out rather and give almost a spirograph impression, wheras the lighter colours in the other version are obscured and also draw comparisons with the Olympics as has been noted. I would, for most uses, include the full name, however that needs to work with the text in the circles, by which I mean that it should align to some aspect of the type. The bottom two on the left of your latest post especially would benefit from this, it will also make the circles more dynamic by emphasising the eccentric position of meg. You could also try ranged right text under the circles ranging on the right of meg.  \nTim\n\n"
    },
    {
      "time": "29 Oct 2006 — 9:22am",
      "content": "hi giggles,  \nI liked the colored circle ones, but i think you should explore little more. To me the combiation of these three letters(MEG/meg) seems very interesting...have two, three or four cup of coffee and do some doodeling in the notebook, ..am sure u'll come up with some interesting ideas.\n\nI'll show you the doodles of meg I did while reading your post. Can't scan them right now as I've my jury tomorrow :(\n\nAll the best  \nsatya\n\n"
    },
    {
      "time": "29 Oct 2006 — 12:36pm",
      "content": "'I think the single line weight as opposed to several is probably a safer bet. You might consider the line weight at different sizes. Are there fewer lines when it gets smaller?' sorry Tiffany, i didn't get that bit? are you talking about the logo in its self i.e. the circles? and when you said 'Treat the mark and the logotype as two separate elements. Especially in this instance, as I think the logotype greatly detracts from the mark', did you mean that the 'meg' in the logo is different to the type on the side (the other variations i have done on the right hand side). is that what you meant? do you think taht because its wrong and shouldn't be there. tehre should just be 1 thing saying Meg not twice. is taht wrong or no0t good? i'd like your thought on that please. do you think that the circles with the 'meg' in is itself a logo and does not need the type Mixed Economy Group. is that what you meant? thanks\n\n"
    },
    {
      "time": "29 Oct 2006 — 12:45pm",
      "content": "Did you mean that i should delete the 'meg' in the logo and stick with just the 'Mixed Economy Group' text or did you mean i should have both meg and Mixed Economy Group but have the full name alligned with the 'meg' in the circles so it looks better. did i understand that right?  \nWhen you said 'The bottom two', is it the 2 that i have applied with the actual logo?  \n'You could also try ranged right text under the circles ranging on the right of meg'. if i ranged text right under circles, doesn't that end up being on the left of meg? sorry but im confused by that. You could show me or explain if possible.\n\n"
    },
    {
      "time": "29 Oct 2006 — 12:46pm",
      "content": "ok, scan in whenever you have the time. thanks.\n\n"
    },
    {
      "time": "29 Oct 2006 — 4:48pm",
      "content": "This was the first idea came in my mind while seeing your solutions. I'll say explore a bit more, there are lots of possibilities in your identity. And yeah...must keep your concept in mind while playing (for whatever purpose you're making your logo..coz i didn't as i dunno much..what its all about)..\n\nRight now in both of my attempts, there lots of problems, like the second logotype will reads a 'mpg' and not meg...but these are challeges which makes things more interesting.\n\nG'Luck\n\n ![](http://web.archive.org/web/20131023141648im_/http:/typophile.com/files/logo%20crit_4815.jpg)\n\n"
    },
    {
      "time": "29 Oct 2006 — 5:09pm",
      "content": "I liked your this idea a lot...you can work on this further. because according to me its going with your concept and the company for you're making this logo. But these rings wouldn't look good in B/W or grayscale.\n\n ![](http://web.archive.org/web/20131023141648im_/http:/typophile.com/files/logo1_6588_6442.png)\n\n"
    },
    {
      "time": "30 Oct 2006 — 11:37am",
      "content": "The comment about multiple line weights -- When I first viewed the last logos you posted, Giggles, it looked as if some of the lines were different weights. I see now that it was simply the colors tricking the eye.\n\nI don't think the acronym **meg** should be touching the circles. I also question the use of lowercase and wonder if this wouldn't be a good time to use a unicase of some sort. Maybe?\n\n"
    },
    {
      "time": "9 Nov 2006 — 10:27am",
      "content": "Hello, i like this\n\n ![](http://web.archive.org/web/20131023141648im_/http:/typophile.com/files/logo1_6588_6442_4575.png)\n\n"
    }
  ]
}
