{
  "id": "28780",
  "title": "A Japanese version of a logo made of latin letters",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Next year will be the 100th year commemoration of composer Edvard Grieg’s death, and my agency has designed a logo and a visual profile. The logo consists of latin letters with the letter «I» turned into an exclamation mark symbolizing Grieg’s own voice; his musical and ideological message.\n\nThe logo will be used by Royal Norwegian Embassies worldwide. The Norwegian embassy of Japan has requested a Japanese version of the logo, but I am not sure how to make one.\n\nDo you think they mean a logo using Japanese letters? Is it possible to still use the exclamation mark as a part of the logo?\n\nI’m sure there are someone out there who can help me. I will be very grateful if somebody could give me some advices.\n\n[http://www.grieg07.com](http://web.archive.org/web/20080430223606/http:/www.grieg07.com/ \"http://www.grieg07.com\")\n\nThank you in advance.\n\nBest regards,  \nPer  \nBergen, Norway\n\n| Attachment | Size |\n| --- | --- |\n| [GRIEG07\\_RGB.gif](http://web.archive.org/web/20080430223606/http:/typophile.com/files/GRIEG07_RGB.gif) | 5 KB |\n\n [‹ Whats that dot](http://web.archive.org/web/20080430223606/http:/www.typophile.com/node/28757 \"Go to previous forum topic\") [I need to find this font ›](http://web.archive.org/web/20080430223606/http:/www.typophile.com/node/28775 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080430223606/http://www.typophile.com/user/14503\" title=\"View user profile.\">Perpixel</a>",
  "time": "<br>",
  "uid": "14503",
  "comments": [
    {
      "time": " 12.Oct.2006 2.45pm",
      "content": "The custom is to transliterate foreign words and names into Katakana, but due to the sound-poor nature of the Japanese syllabary, you will get something to the extent of “GU RI — GU”. The exclamation point is recognized but not standard Japanese punctuation. You can use it, but I don’t think it can be incorporated a sone of the letters. I could be mistaken, as I’m out of practice with Katakana.\n\n"
    },
    {
      "time": " 12.Oct.2006 3.42pm",
      "content": "It might be simplest to keep the existing logo and simply add the katakana reading (グリーグ) in smaller type. Perhaps above the name, to balance the 2007. The combination of Latin logo with subsidiary Japanese reading seems to be fairly common in Japanese design.\n\n(The exclamation mark is perfectly standard punctuation in modern Japanese, but there isn’t an obvious place to incorporate it in the kana. I doubt they want the logo completely redone in Japanese, though.)\n\n"
    },
    {
      "time": " 12.Oct.2006 3.52pm",
      "content": "I second Haeleth’s comment. Inserting the katakana would probably be enough, so that people would know how to pronounce it.\n\nPerhaps something like the attachment.\n\n ![](http://web.archive.org/web/20080430223606im_/http:/www.typophile.com/files/jGriegLogo_4159.gif)\n\n"
    }
  ]
}
