{
  "id": "2878",
  "title": "ITC Garamond Book and old-style figures",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I am typesetting new material for a book originally published in the 1960s and I have to match the font. So far, the closest match I have found is ITC Garamond Book . It has a similar weight on the page to the original.   \n   \nBut ITC Garamond Book doesn't have old-style figures and I need them! Does anyone have a suggestion?   \n   \nthanks, garet\n\n",
  "author": "garet",
  "time": "Wed, 2004-01-28 12:11",
  "uid": "2973",
  "comments": [
    {
      "time": " Wed, 2004-01-28 12:38",
      "content": "Whithout seeing samples of the type you are trying to match this would be a hard question to answer. The tempting answer is to suggest one of the several Garamonds that have either an expert set or SC/OSF font included in the family. Adobe's Garamond No. 3 is a rather close approximation in terms of letterforms in the Roman and Italic, although the x-height is not the same. You might at least use the figures from that font with the letters from ITC Garamond. That would have less of an impact on appearance unless your book was largely numerals.\n\n"
    },
    {
      "time": " Wed, 2004-01-28 13:22",
      "content": "Thanks for such a rapid response, Mike. Stupid me forgot to mention that I did try Garamond 3 SC and OSF but they are too thin in comparison to the Garamond Book. I'm afraid I can't upload a sample of the font right now b/c the book went back to the client along with my unsatisfactory sample setting. If I can get the book back, I will post a scan.   \n   \nthanks again, garet\n\n"
    },
    {
      "time": " Wed, 2004-01-28 14:05",
      "content": "Garet,   \n   \nThat is the reason I suggested just using the numerals from the other font. Keep all your text in ITC Garamond Book, but use the numerals from one of the other fonts that has OSF. Adobe Garamond has a semibold weight for the Expert set with OSF which might work.\n\n"
    }
  ]
}
