{
  "id": "28789",
  "title": "You never go to heaven with an elegant drop cap",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "<cite>\"You never go to heaven with an elegant drop cap.\"</cite>\n\nThis is a comment that my teacher just made today. His basic premise was that it never pays to waste any time on drop caps. They are good for giving your eye an entrance into a block of text, but not really that important in the grand scale of things.\n\nI happen to like an elegant looking drop cap. It lends a sense of class to whatever you are working on.\n\nDo you think he is correct? Or is he off the mark?\n\n",
  "author": "Dan Gayle",
  "time": "12 Oct 2006 — 4:38pm",
  "uid": "12948",
  "comments": [
    {
      "time": "12 Oct 2006 — 4:43pm",
      "content": "IMHO A drop cap can be a great way of starting something off or even of defining sections. They can be overdone, but I think you teacher is off the mark.\n\n"
    },
    {
      "time": "12 Oct 2006 — 6:30pm",
      "content": "That sounds exactly like people who poo-poo gradients for any and all uses. Elitist caveman.\n\n"
    },
    {
      "time": "12 Oct 2006 — 8:00pm",
      "content": "I hear a lot of oddball advice from design teachers, but not using drop caps to save time? If designers aren't getting paid to do pretty stuff like drop caps what exactly are we here for?\n\n"
    },
    {
      "time": "12 Oct 2006 — 8:47pm",
      "content": "Rules were made to be broken (not that I've ever heard that one before).\n\n"
    },
    {
      "time": "12 Oct 2006 — 9:37pm",
      "content": "Makes a change from \"God is in the details.\"\n\n"
    },
    {
      "time": "13 Oct 2006 — 8:16am",
      "content": "This is also the teacher that said you should almost <cite>never</cite> use justified text in any circumstances, ever.\n\nI give him the benefit of the doubt, since he also teaches multimedia and web design courses at my school. <cite>For web</cite> he might certainly have a case for both assertions, but for print?\n\n"
    },
    {
      "time": "13 Oct 2006 — 8:55am",
      "content": "Roger Black's blog successfully, I think, uses drop caps.\n\nI have a problem with justified text only because so many times it doesn't get the finessing it needs to look good. If it is massaged into a nice block of text then why not justify!?\n\n"
    },
    {
      "time": "13 Oct 2006 — 9:05am",
      "content": "Just make sure that you start buying rough sea salt and keep it handy during his lectures.\n\n"
    },
    {
      "time": "13 Oct 2006 — 9:08am",
      "content": "The guy is on an ego trip trying to clone his personal preferences into his students.  \nThat's not education.\n\n"
    },
    {
      "time": "13 Oct 2006 — 9:24am",
      "content": "What Nick said.\n\n"
    },
    {
      "time": "13 Oct 2006 — 10:16am",
      "content": "\\>His basic premise was that it never pays to waste any time on drop caps\n\nIf you are going to have drop caps, or any setting, it always pays to spend time on them. In fact it pays to spend time on anything, even if not in a monetary sense.  \nSin  \nTim\n\n"
    },
    {
      "time": "13 Oct 2006 — 10:36am",
      "content": "For the small amount of time it takes to make a drop-cap style sheet, his \"saves time\" reasoning is really lame. Whenever someone says \"always\" do this or \"never\" do that (in design circumstances at least) be very leary. There is no simple little checklist to great typography. It is work. Drop caps or any other device can both be used well and poorly. It is like golf. After you select the club to use, you still have to make the shot. Selecting items from menues and pallettes in InD is a snap, making the page look good and function well both takes work.\n\nChrisL\n\n"
    },
    {
      "time": "13 Oct 2006 — 11:39am",
      "content": "This is like an AD I once knew who chastised her typesetters for \"gilding the lily.\" Why was it you hired a bunch of anal-retentive, perfectionist typestters, again?\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20131020153429/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": "13 Oct 2006 — 1:37pm",
      "content": "As usual its about context. If you were starting a story about a fairy tale an ornimental drop cap could add to the reading experience. An annual report, probably not.\n\n"
    },
    {
      "time": "13 Oct 2006 — 3:08pm",
      "content": "Drop caps are especially useful in places like magazines, where easy navigation is crucial. Readers depend on visual clues to see where articles begin and end, since they're usually scanning fast in different directions. Now, I'm not trying to say drop caps are essential, but if they fit the style of the layout and are tastefully implemented, they can enhance things. They are a bit like the little bullets or icons that end an article. (Is there a name for those things?) They give the reader a little cue that says \"I am starting an article\" or \"I just finished an article\" -- and the little bit of extra satisfaction that comes with it.\n\nDoes that sound nuts?\n\n"
    },
    {
      "time": "13 Oct 2006 — 3:27pm",
      "content": "But you have to admit, there are some really crappy drop cap uses out there these days. One that is particularly annoying is the large square indent dropping twenty lines with a 36 pt cap floating in that see of white. Navagate this!\n\n"
    },
    {
      "time": "13 Oct 2006 — 3:36pm",
      "content": "As is always the case, the proof is in the pudding. Give me a 9 iron and I'll hack the turf to death with it, give it to Tiger Woods and it's a thing of beauty.\n\nChrisL\n\n"
    },
    {
      "time": "13 Oct 2006 — 4:05pm",
      "content": "<cite> But you have to admit, there are some really crappy drop cap uses out there these days. One that is particularly annoying is the large square indent dropping twenty lines with a 36 pt cap floating in that see of white.</cite>\n\nWell yeah, that's ridiculous!\n\n"
    },
    {
      "time": "13 Oct 2006 — 4:20pm",
      "content": "\\> “You never go to heaven with an elegant drop cap.”\n\nwhat about drop a line?\n\n"
    },
    {
      "time": "13 Oct 2006 — 11:24pm",
      "content": "<cite> &gt; “You never go to heaven with an elegant drop cap.”</cite>\n\nJudging from the countless, absolutely beautiful illuminated drop caps drawn by centuries of monks in scriptoria, I'd have to disagree strongly. ;-)\n\n"
    },
    {
      "time": "14 Oct 2006 — 9:21am",
      "content": "Would someone be kind enough to post an elegant (well done) drop cap for us to see? Maybe one in action in an actual text setting. I'm not well-versed in the use of drop caps, and I'd like to learn.\n\n"
    },
    {
      "time": "14 Oct 2006 — 9:34am",
      "content": "I'm trying to attach a pdf of a drop cap I did but I can't figure out how...\n\n"
    },
    {
      "time": "14 Oct 2006 — 12:16pm",
      "content": "You can't attach a PDF unless you are the original poster in a thread. You either have to convert it to PNG or post a link. Sorry Patty.\n\nChrisL\n\n"
    },
    {
      "time": "14 Oct 2006 — 12:21pm",
      "content": "One could argue that this is an initial and not a drop cap, but I'll be damned if it doesn't look gorgeous.\n\n ![](http://web.archive.org/web/20131020153429im_/http:/typophile.com/files/dropcap_3651.jpg)\n\n"
    },
    {
      "time": "15 Oct 2006 — 4:31am",
      "content": "Thank you, jpad. Lovely!\n\n"
    },
    {
      "time": "15 Oct 2006 — 9:50pm",
      "content": "Days of yore... a space was left in a printed book along with a very small indication for the actual letter for the owner to draw in their initial caps. Here's an example from a page by the printer Alexandro de Paganini 1527. Someone started to draw a P. The rest of the book is untouched. Alexandro de Paganini admired Manutius/Griffo's italics and developed his own designs.\n\n ![](http://web.archive.org/web/20131020153429im_/http:/typophile.com/files/Paganini_6039.jpg)\n\nHere is one of my favorite examples of an elevated cap. The page is taken from the Arion Press Moby Dick, designed by Andrew Hoym with illustrations by Barry Moser.\n\n ![](http://web.archive.org/web/20131020153429im_/http:/typophile.com/files/Moby_6224.jpg)\n\n"
    },
    {
      "time": "15 Oct 2006 — 11:42pm",
      "content": "Wow. That's one hell of a drop cap. Of course, it is the first page of Moby Dick, so it makes sense...\n\n"
    },
    {
      "time": "16 Oct 2006 — 4:49am",
      "content": "\\> “You never go to heaven with an elegant drop cap.”\n\nI'm pretty sure you will never go to heaven without one either.\n\n"
    },
    {
      "time": "16 Oct 2006 — 3:52pm",
      "content": "Again, not drop caps... but speaking of Heaven...\n\nDoves Press Bible\n\n ![](http://web.archive.org/web/20131020153429im_/http:/typophile.com/files/DovesBible_6098.jpg)\n\nMoser designed Bible\n\n ![](http://web.archive.org/web/20131020153429im_/http:/typophile.com/files/MoserGod_4447.jpg)\n\n"
    },
    {
      "time": "16 Oct 2006 — 6:33pm",
      "content": "Wow... you know what the worst part about being in design school is? Seeing all these amazing books and knowing that by the time I can afford them, the price will have doubled.\n\nTo hell with Amazon, this year's xmas list is going to be all Oak Knoll...\n\n"
    },
    {
      "time": "16 Oct 2006 — 7:41pm",
      "content": "Hmmm... wonder what they have to say about drop caps in the forthcoming Oak Knoll title [Book Typography: A Designer's Manual?](http://web.archive.org/web/20131020153429/http:/www.oakknoll.com/detail.php?d_booknr=92771) My head of department just forwarded me the info on it. Judging by the contents listing, Mitchell and Wightman give the topic about four pages.\n\nJames - the examples you posted are just great... really exemplary. Thanks for sharing.\n\nEither Dan's instructor is unaware of this kind of work, or wishes to keep it out of the purview of his classes. Or maybe it's all about being in a hurry and not having time to craft anything... Neither reason is good. Maybe Dan should come and attend our classes in New Zealand instead!\n\n"
    },
    {
      "time": "16 Oct 2006 — 9:21pm",
      "content": "Gimme a ticket for an airplane, I'll be right there.\n\nAs to my teacher, he just seems to think that we should focus on pleasing the 95% of the population that could care less about type and typography. Since the drop cap is immediately looked past, it stands to reason, for him at least, that you should use your time and energy on the parts of your design that will make a lasting impression on the common man.\n\nI dunno. As some of those exmples above show, a good cap can leave a very definite impression on someone's mind.\n\n"
    },
    {
      "time": "16 Oct 2006 — 9:56pm",
      "content": "To be fair, the examples I've provided are in book design. All of them from the fine press mind you.\n\nIt can be argued that a drop cap, or any initial capping style is excessive in a purely functional and informational context, and that it has no place in say a magazine, newspaper, or website. I was also indoctrinated not to use it by my instructors when I was in college.\n\nMaybe the disdain began with Modernist sensibilities. Herbert Bayer and many other typographers during this period sought to eliminate capital letters altogether. If that is the case, the initial cap would have been the first to be decapitated.\n\n"
    },
    {
      "time": "17 Oct 2006 — 5:45am",
      "content": "\"...you should use your time and energy on the parts of your design that will make a lasting impression on the common man.\"\n\nThat's a disgusting thought. There's a reason that the common man is considered common; and it's why so many people struggle to rise above the rabble. Even all the crazy communist designers of the early twentieth century were trying to create GOOD type for the masses, but doing lazy type for the masses is just vile.\n\nLately I've been reading “Atlas Shrugged” and contrasting the villains with people I've known who just want to center all the type, set it in Arial, and call it a day. I think I'm adding your instructor to the list of baddies.\n\n"
    },
    {
      "time": "17 Oct 2006 — 6:17am",
      "content": "I don't know your instructor nor have I ever been to one of his classes so I can't say for sure if his teaching method is a good one. If I only look at your comments on what he says in class, then I make some assumptions which may or may not be valid. So:  \nHow do you know what works best for 95% of the masses? You don't. You just make assumptions. If \"wasting your time\" is what typography is about to your instructor, he has chosen the wrong field of endeavor. If that is all it is about then just type the \"Place\" command in InD and let the text flow in whatever way it will. Don't format it. You are done and have \"wasted\" no time at all.\n\nChrisL\n\n"
    },
    {
      "time": "17 Oct 2006 — 9:02am",
      "content": "re: context of drop caps\n\nWe used coloured ones for the late Louis Rukeyser's monthly investment newsletter when I was production editor back in the early/mid 90s. They looked great -- we had programmed a whole swack of macros in Wordperfect and imported the tagged material straight into Quark. Took some time to program in the first place, but was anything but a timewaster.\n\nDan, your instructor is attempting to get bodily functions to climb a large floral structure.\n\nLinda\n\n"
    },
    {
      "time": "17 Oct 2006 — 9:58am",
      "content": "Linda,  \nwe used to call that pi\\*\\*\\*\\*\\* up a rope where I grew up :-)\n\nChrisL\n\n"
    },
    {
      "time": "17 Oct 2006 — 10:09am",
      "content": "Well, Chris, out here on the bald-headed prairie, the settlers wanted to keep their ropes dry. 'Course, they didn't have very many trees either.... ;-)\n\nL.\n\n"
    },
    {
      "time": "17 Oct 2006 — 10:16am",
      "content": "I was just speaking from up here on my bald-headed head (:-)\\> I grew up in inner city Pittsburgh, a good blue collar shot-and-a-beer town where people tended to call them like they saw them ;-)\n\nChrisL\n\n"
    },
    {
      "time": "17 Oct 2006 — 4:39pm",
      "content": "<cite>If “wasting your time” is what typography is about to your instructor, he has chosen the wrong field of endeavor.</cite>\n\nI don't think that he means to go that far. It is just that his hierarchy has drop caps/initial caps way down on the list. For example, he would rather have us spend our time on correct spacing.\n\n"
    },
    {
      "time": "19 Oct 2006 — 11:53am",
      "content": "Tell him to come on here and argue his case!!! WTSA - Welcome to the World Typographic Smackdown Association! In this corner...\n\n"
    },
    {
      "time": "21 Oct 2006 — 8:42am",
      "content": "Thanks to Solipsism I've just \"lost\" 31 Euros... I simply had to buy this Moby Dick edition!\n\nThis \"Call me Ishmael\"... Perfect!\n\n"
    },
    {
      "time": "21 Oct 2006 — 11:46am",
      "content": "_the worst part about being in design school_\n\nBut it's so much fun ferreting through junk stores, garage sales, fleamarkets etc.\n\n"
    }
  ]
}
