{
  "id": "28788",
  "title": "Chicago Olympic Bid 2016",
  "forum": "Design",
  "tags": [

  ],
  "content": "Has anyone seen the logo? Do we know who designed it?  \n(sorry for the potential misplaced query, but it wasn’t really a type id question)\n\n ![](http://web.archive.org/web/20080905055103im_/http:/www.typophile.com/files/Chicago_2016_6227_5912.jpg)\n\nPS, I love it.\n\n(edited: Oct 26, 2006)\n\n [‹ Typeface suggestions](http://web.archive.org/web/20080905055103/http:/www.typophile.com/node/28993 \"Go to previous forum topic\") [Stempel garamond ›](http://web.archive.org/web/20080905055103/http:/www.typophile.com/node/28971 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905055103/http://www.typophile.com/user/6255\" title=\"View user profile.\">giljimenez</a>",
  "time": "<br>",
  "uid": "6255",
  "comments": [
    {
      "time": " 12.Oct.2006 4.35pm",
      "content": "Hmm, I see the Chicago skyline on fire, sitting atop a giant spike made of ice.\n\nIs that really the image they want to project?\n\n"
    },
    {
      "time": " 12.Oct.2006 6.49pm",
      "content": "I agree, Gil. It’s wonderful.\n\n"
    },
    {
      "time": " 12.Oct.2006 8.48pm",
      "content": "I like it too.\n\n"
    },
    {
      "time": " 12.Oct.2006 9.20pm",
      "content": "the TM spoils it :-(\n\nSi\n\n"
    },
    {
      "time": " 12.Oct.2006 11.54pm",
      "content": "I see a torch......illusion\n\n"
    },
    {
      "time": " 13.Oct.2006 9.31am",
      "content": "I think it is really nice as well. For the scale, that TM could be much smaller.\n\n"
    },
    {
      "time": " 13.Oct.2006 10.01am",
      "content": "It doesn’t refer to the Olympics (a torch doesn’t seem specific enough), wonder if the rings will be introduced later. It is quite pretty I suppose, but is that the sole point?  \nTim\n\n"
    },
    {
      "time": " 13.Oct.2006 10.08am",
      "content": "The rings are a secondary element. The logo reflects the city in which the Olympics will take place.\n\n"
    },
    {
      "time": " 13.Oct.2006 10.33am",
      "content": "Yes, however it doesn’t reflect or even hint at the Olympics, could be worse though  \n [http://www.sccog.org/webapp/servlet/content/view/15/24/](http://web.archive.org/web/20080905055103/http:/www.sccog.org/webapp/servlet/content/view/15/24/ \"http://www.sccog.org/webapp/servlet/content/view/15/24/\")\n\nTim\n\n"
    },
    {
      "time": " 13.Oct.2006 10.46am",
      "content": "I think it does hint at the Olympics. The logo most definitely signifies the torch the runner/runners carry into the city.\n\n"
    },
    {
      "time": " 13.Oct.2006 11.37am",
      "content": "Yeah, when I saw the torch, I thought of the olympics even before I saw the Chicago skyline in the flame. I think the torch is just as recognizeable an Olympic motif as the rings. Perhaps the torch is even more recognizeable.\n\n—-\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20080905055103/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": " 13.Oct.2006 11.40am",
      "content": "The rings have been done to death - plus there is something very disturbing about the color scheme: green=Europe, blue=Australia, black=Africa (!), yellow=Asia (!), red=Americas (!) what were they thinking???\n\nI think the torch says Olympics quite clearly.\n\n"
    },
    {
      "time": " 13.Oct.2006 1.32pm",
      "content": "I would have liked to seen a simplier version with a hand holding the torch and just the city being the flame. I think it would be clearer to the public and it would say bringing the Olympics to Chicago\n\n"
    },
    {
      "time": " 13.Oct.2006 10.44pm",
      "content": "Oh, darn the IE that I’m forced to use at the moment. My lengthy comment went AWOL when I hit the preview button. Again in very short words:\n\n**1)** Skyline and Lake Michigan form the torch. Beautiful, simple, smart.\n\n**2)** I certainly associate the torch with the Olympic Games.\n\n**3)** Second hint to the Olympics: the color scheme of the logo (yellow, red, green, blue plus black and white) reflects the color of the Olympic rings emblem.\n\n**4)** As I see it, the TM could only be made smaller (onscreen) if you don’t want people to be able to decipher it.\n\n**5)** I can read _Chanel_ instead of _Chicago_ any time I want to. Beat that.\n\n**6)** The five colors reflect the five continents: might be a myth. Pierre de Coubertin, who studied arts, founded the IOC, revived the games and designed the Olympic emblem in 1913, said that while the rings reflect the continents, their colors reflect the entirety of the world’s national flags; at least one color of every ensign could be found in the Olympic flag.\n\n"
    },
    {
      "time": " 13.Oct.2006 11.08pm",
      "content": "<cite> &gt; wonder if the rings will be introduced later.</cite>\n\nThe bid cities aren’t allowed to use the Olympic rings until after the national Olympic committee has officially sanctioned the bid. (e.g.: See the [2014 Candidate City Guidelines](http://web.archive.org/web/20080905055103/http:/multimedia.olympic.org/pdf/en_report_1078.pdf) from the IOC site, p. 32). In the U.S., that won’t happen until March 2007, [if then](http://web.archive.org/web/20080905055103/http:/www.gamesbids.com/english/bids/2016.shtml).\n\nBTW, here’s a look at the [logos from the cities](http://web.archive.org/web/20080905055103/http:/38one.com/cleverblog/place-your-bid) bidding for the 2012 games.\n\n"
    },
    {
      "time": " 13.Oct.2006 11.16pm",
      "content": "Oh, and to answer the original question, Chicago-based [VSA Partners designed it](http://web.archive.org/web/20080905055103/http:/www.vsapartners.com/) pro-bono, and you’ll be happy to note that the “TM” gets smaller in the version on their site. Their explanation of the logo’s elements:\n\n<cite>The Chicago 2016 logo is styled in the shape of a torch and consists of three distinct visual components. The flame, in the shape of Chicago’s skyline, reflects the international significance of Chicago architecture and speaks to the vitality of a city that rose from the ashes. The body of the torch merges a color palette that represents the blue of Lake Michigan with the vibrant green of the city’s park system — further underscoring Chicago’s commitment to the environment and sustainability. Together, these visual elements evoke the spirit of the Olympic Games and its values. It also evokes Chicago’s Games concept, to host compact Games celebrated in the center of the city, along the Lake Front and in the city’s parks.</cite>\n\n"
    },
    {
      "time": " 14.Oct.2006 4.02pm",
      "content": "Out of the 2012 games, is it just me or is Moscow the best one there? London and Madrid have nothing to them, for me, NYC is kind of trite, it’s design that’s been used on every logo site out there and the Paris one is too close to what the Euro 2004 logo was.\n\n"
    },
    {
      "time": " 14.Oct.2006 6.43pm",
      "content": "Woo hoo. Here’s the official VSA announcement. [http://www.vsapartners.com/news.asp](http://web.archive.org/web/20080905055103/http:/www.vsapartners.com/news.asp \"http://www.vsapartners.com/news.asp\")\n\n"
    },
    {
      "time": " 14.Oct.2006 8.17pm",
      "content": "But considering that the Chicago skyline was set aflame once before, is it necessarily a good omen to show it happening again?\n\n"
    },
    {
      "time": " 14.Oct.2006 9.28pm",
      "content": "Jonathan - it’s you. I think the Moscow logo isn’t really a logo at all, but a mess. NY and Paris are kind of trite but effective for what they are. I like the liberty/athlete combo in NY. London is hideous and Madrid is absurdly subtle and looks like a bloody gash. None are as nice as the Chicago logo.\n\nMy info on the significance of the colors of the rings came from watching a broadcast of the opening ceremony some time ago. I was appalled.\n\nI am soooooo glad NY didn’t get the 2012 games, last thing we need.\n\n"
    },
    {
      "time": " 14.Oct.2006 10.50pm",
      "content": "This is a sweet looking logo. Makes me immediately think of the 30’s World’s Fair stuff and architectural renderings by [Hugh Ferriss.](http://web.archive.org/web/20080905055103/http:/thenonist.com/index.php/thenonist/permalink/hugh_ferriss_delineator_of_gotham/) I like it better than any of the logos for the cities bidding the 2012 games.\n\n"
    },
    {
      "time": " 15.Oct.2006 4.03pm",
      "content": "I think it’s kinda boring.\n\n"
    },
    {
      "time": " 15.Oct.2006 8.14pm",
      "content": "I like the logo. The colors are really nice and it says olympics to me.\n\nAnyone know the typeface?\n\n"
    },
    {
      "time": " 15.Oct.2006 9.45pm",
      "content": "The font is the lovely and ubiquitous Gotham.\n\n[http://www.typography.com/catalog/gotham/index.html](http://web.archive.org/web/20080905055103/http:/www.typography.com/catalog/gotham/index.html \"http://www.typography.com/catalog/gotham/index.html\")\n\n"
    },
    {
      "time": " 15.Oct.2006 9.58pm",
      "content": "The logo is a pretty elegant solution.\n\nI think we should declare Gotham the Helvetica of the 00’s.\n\n"
    },
    {
      "time": " 15.Oct.2006 11.18pm",
      "content": "Thanks Patty\n\n"
    },
    {
      "time": " 16.Oct.2006 1.52am",
      "content": "It is a very good logo. I like it!\n\n\\_\\_\\_\\_\\_\\_\\_  \nAL  \n [lenart.pl](http://web.archive.org/web/20080905055103/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": " 16.Oct.2006 4.57am",
      "content": "I can’t see the Chicago skyline; I haven’t been to chicago though.\n\n"
    },
    {
      "time": " 16.Oct.2006 7.06am",
      "content": "Maybe Gotham is the new Souvenir?\n\n"
    },
    {
      "time": " 16.Oct.2006 7.19am",
      "content": "Miles, the torch contains the silhouette of the Sears Tower which is the tallest building in the US and the most (only) recognizable feature of Chicago’s skyline. It’s subtle which is nice and of course far less familiar than NY’s skyline.\n\n"
    },
    {
      "time": " 16.Oct.2006 7.43am",
      "content": "It’s classy and while there’s a lot of secondary symbology in it, it doesn’t appear to be trying too hard (which a lot of olympic big logos seem to do).\n\nAnd if any design firm was chosen to do it, VSA seems like about the most obvious choice one could make for Chicago.\n\n"
    },
    {
      "time": " 16.Oct.2006 1.27pm",
      "content": "For anyone in Chicago, I think the Chicago Works tv channel filmed a segment on the logo last week. I don’t have any details right now but if you might be able to catch the feature nestled between segments about the CTA’s inept service and Daley’s official celebration of P.Diddy Day.\n\n"
    },
    {
      "time": " 16.Oct.2006 2.50pm",
      "content": "Diddy Day!  \n(as i hang head in embarassment)\n\n"
    },
    {
      "time": " 17.Oct.2006 5.35pm",
      "content": "definitely one of the nicest Olympics-related logos i’ve seen in a long, long time.\n\n"
    },
    {
      "time": " 21.Oct.2006 10.35pm",
      "content": "I just stumbled upon a bigger pic (finally).  \nGil might want to replace the smaller pic in his first post.\n\n ![](http://web.archive.org/web/20080905055103im_/http:/www.typophile.com/files/Chicago_2016_6227.jpg)\n\n.  \n(As expected: the bigger the logo, the smaller the TM.)\n\n"
    },
    {
      "time": " 22.Oct.2006 4.02pm",
      "content": "This is really nice and is growing on me. It has the feeling of old lithographic posters somehow. I’ll be interested to see how they use it across media and material.\n\n"
    },
    {
      "time": " 22.Oct.2006 6.45pm",
      "content": "I like this one. Know a few people involved with the 1988 Calgary XV Winter Olympics logo, which is still one of my favourites, and have seen few since that compare favourably. The Chicago colours are great (although it also needs to repro well in B/W, and I’m not sure this one will), and I do like the reference to Mrs. O’Leary’s cow.\n\nMoo!\n\nLinda\n\n"
    },
    {
      "time": " 23.Oct.2006 8.25am",
      "content": "I still have a softspot for Mex 1968\n\n[http://www.aldaver.com/Images/Os/lg1968sm.jpg](http://web.archive.org/web/20080905055103/http:/www.aldaver.com/Images/Os/lg1968sm.jpg \"http://www.aldaver.com/Images/Os/lg1968sm.jpg\")\n\nbtw, this is a very useful site for olympics logos!\n\n[http://www.aldaver.com/](http://web.archive.org/web/20080905055103/http:/www.aldaver.com/ \"http://www.aldaver.com/\")\n\n"
    }
  ]
}
