{
  "id": "28802",
  "title": "Looking for a font similar to Quaint Gothic",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi!  \nI am looking for a font that is close to Quant Gothic because we cannot afford to pay $35.... SORRY!  \nIs there anything that is more common?  \nThank you for your suggestions.\n\n ![](http://web.archive.org/web/20131221004432im_/http:/typophile.com/files/14c88cc266e22709dbb9f6a5bfe458fa_6011.png)\n\n",
  "author": "misalion",
  "time": "13 Oct 2006 — 10:07am",
  "uid": "1899",
  "comments": [
    {
      "time": "13 Oct 2006 — 1:10pm",
      "content": "_we cannot afford to pay $35_\n\nSo, I assume that you are posting this message at the public library (no DSL or cable connection, right?), and you don't have a cell phone or cable TV, never visit Starbucks or go to a movie, don't subscribe to any magazines, and don't have an iPod (or at least not any tunes for it), right?\n\n"
    },
    {
      "time": "13 Oct 2006 — 1:21pm",
      "content": "I am sorry, but I said SORRY. I should have explained my situation. But I didn't think it was necessary.  \nThe situation is that we are offering a proof for the prospective to buy our product, and at this point we really don't want to spend any money on it, because we might not get an P.O. It is just like a spot job situation.  \nAnd I do not own iPod nor go to Starbucks.  \nSorry if I upset you.\n\n"
    },
    {
      "time": "13 Oct 2006 — 2:01pm",
      "content": "So, what you want to do is to make a DUMMY, which is simple enough. Simply go [here](http://web.archive.org/web/20131221004432/http:/www.myfonts.com/fonts/spiecegraphics/quaint-gothic-sg/regular/), and type your copy into the type tester. You can then save the image or print the screen, and insert that image, properly cropped, into your presentation. Yes, the image will be only 72 or 96 dpi (depending on your OS), but you can advise your potential client that it is \"for position and general look\" only. If/when you get the job...BUY the font (or another version thereof).\n\n"
    },
    {
      "time": "13 Oct 2006 — 3:45pm",
      "content": "Misa - The original, predigital Quaint Gothic (AKA Desdemona Solid) didn't have a lowercase. Jim Spiece created those characters himself. So, you aren't going to find another version like that.\n\nNick's idea sounds good, no.\n\nThe only thing kind of close that comes to mind still isn't free, but it's cheaper. That would be Ray Larabie's revival from roughly the same period, [Silentina](http://web.archive.org/web/20131221004432/http:/www.myfonts.com/fonts/typodermic/silentina/).\n\n"
    },
    {
      "time": "14 Oct 2006 — 1:41pm",
      "content": "I always use the vendors' type tester function to whup up dummies and they always get the job done, no sweat. ;^)\n\n"
    }
  ]
}
