{
  "id": "28817",
  "title": "Irony Mark???",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": " **Update: The post has been altered to reflect a name change in the proposed ligature.**\n\nLatest posts discuss drafts of User's Guide and Design Recommendation document.\n\nFrom [another thread](http://web.archive.org/web/20150420040131/http:/typophile.com/node/28562):\n\nQ.  \nNigellaL: _What in the bloody hell is an ‘irony mark’????????_\n\nA.  \nThe Greatest Punctuation in the History of Mankind.~\n\nLong A.  \nI've been waiting for someone to bite on this. The Snark\\* (formerly 'irony mark') is a proposed sentence terminator designed to imply a second, often sarcastic, or otherwise verbally ironic, meaning to the preceding text. Intended use is where the intimation of the second meaning might otherwise be lost, because of missing vocal inflection, or other missing contextual hints. This means it is intended to be sparingly used, and normally in informal communications.\n\nThis is based on the 19th-21st century ideas of the \" **point d’ironie**\" (proposed by the French poet Alcanter de Brahm and, later, Hervé Bazin)and the \" **sarcasm mark**\" (proposed by Tara Liloia, Josh Greenman and many others). I suggest one marker for both contexts, and I consider the term \"Snark\" more inclusive.\n\nThe Snark, in this suggested format, looks something like an exclamation mark, laid on its side and bred with a tilde, modified to suit the typeface it is in.\n\n**The mark is in redesign status, discussed in thread below.**  \n---\n\n ![](http://web.archive.org/web/20150420040131im_/http:/typophile.com/files/ironymark_3799.jpg)\n  \n_Quick & dirty examples in two common faces_.  \n--\n\nPast suggestions from others have included a reversed question mark, an inverted exclamation, and braketing the statement with any/all rarely used ascii characters. My proposal offers several advantages other proposals have thus far lacked:\n\nIt is distinct, and the appearance may be suggestive of a wry, caustic, deadpan or mock-serious intonation. (An exclamation- \"knocked over\"?)\nIt is familiar to those who follow the convention of enclosing sarcastic remarks in tildes in text chat programs, one of many competing popular conventions.\nIt doesn't give away any note of sarcasm until the end of the passage, which may support more comedic timing.\nSimilar markings are not in use currently, in any Latin-alphabet writing system (as far as I know), so it is unlikely to be confused with other punctuation. The Ethiopian use of '¡' is unlikely to get mixed with Spanish text, but in U.S. English, this may get confused, in bilingual work, with a Spanish '¡' preceding the next sentence.\nDespite its distinctness, it is simple to draw and read, making it more adoptable.\nThe wavy stroke is reminiscent of the ':S' emoticon used sometimes to denote a glum or mixed emotion.\nIt is very easy to roughly emulate in any text by typing a period followed by a tilde. This glyph pair is also devoid of other meanings. I find this to be the nicest feature.\nAn OpenType aware application can catch the '.'+'~' pair and automatically substitute the (inherently) similar looking Snark, making it potentially _very_ simple to adopt. I predict OpenType features in non-typographic applications will become the norm. (Office 2015?)\n\nAt this time, I have included the character in all current !Exclamachine branded typefaces, and plan to continue to do so, as well as add it to old ones. A design guide is available at : [http://www.exclamachine.com/snark](http://web.archive.org/web/20150420040131/http:/www.exclamachine.com/snark \"http://www.exclamachine.com/snark\") showing how I have adopted it to several very different decorative faces, and what I would consider essential to making one. I will add the OT code I use for automatic replacement of the '.'+'~' string tomorrow. I encourage other designers, if they please, to consider this, and perhaps add it to their fonts. I envision someday requesting inclusion in the Unicode standard, as does Kevin Larson (for the French design). Why not? Interrobang made it, and that's just an ambiguous ligature.\n\nRelevant links (To make this look official & important.~):  \n [http://www.liloia.com/archives/000211.php](http://web.archive.org/web/20150420040131/http:/www.liloia.com/archives/000211.php \"http://www.liloia.com/archives/000211.php\")\n\n[http://en.wikipedia.org/wiki/Irony\\_mark](http://web.archive.org/web/20150420040131/http:/en.wikipedia.org/wiki/Irony_mark \"http://en.wikipedia.org/wiki/Irony\\_mark\")\n\n[http://en.wikipedia.org/wiki/Sarcasm\\_mark](http://web.archive.org/web/20150420040131/http:/en.wikipedia.org/wiki/Sarcasm_mark \"http://en.wikipedia.org/wiki/Sarcasm\\_mark\")\n\n[http://linusfurious.blogspot.com/2006/04/punctuational-proposal.html](http://web.archive.org/web/20150420040131/http:/linusfurious.blogspot.com/2006/04/punctuational-proposal.html \"http://linusfurious.blogspot.com/2006/04/punctuational-proposal.html\")\n\n[http://blogs.msdn.com/fontblog/archive/2006/01/04/509299.aspx](http://web.archive.org/web/20150420040131/http:/blogs.msdn.com/fontblog/archive/2006/01/04/509299.aspx \"http://blogs.msdn.com/fontblog/archive/2006/01/04/509299.aspx\")\n\n[http://www.pointdironie.com/](http://web.archive.org/web/20150420040131/http:/www.pointdironie.com/ \"http://www.pointdironie.com/\")\n\n[http://www.slate.com/id/2111172/fr/ifr](http://web.archive.org/web/20150420040131/http:/www.slate.com/id/2111172/fr/ifr \"http://www.slate.com/id/2111172/fr/ifr\")\n\n[http://blogs.msdn.com/fontblog/archive/2005/12/22/506936.aspx](http://web.archive.org/web/20150420040131/http:/blogs.msdn.com/fontblog/archive/2005/12/22/506936.aspx \"http://blogs.msdn.com/fontblog/archive/2005/12/22/506936.aspx\")\n\n[http://www.exclamachine.com/snark](http://web.archive.org/web/20150420040131/http:/www.exclamachine.com/snark \"http://www.exclamachine.com/snark\")\n\n_\\*name proposed by Geo Ben. All those in favor say 'aye.' Good. -Choz_\n\n",
  "author": "Choz Cunningham",
  "time": "14 Oct 2006 — 12:25pm",
  "uid": "13605",
  "comments": [
    {
      "time": "14 Oct 2006 — 12:50pm",
      "content": "I'm not sure if I like this or not. On one hand, if it becomes common, people will realize when I'm just writing above their level and not being snide. On the other hand I don't really give a damn about people too stupid to pick up on context clues in the first place.\n\n"
    },
    {
      "time": "14 Oct 2006 — 1:40pm",
      "content": "This is not a meant to be a replacement for the joys of subtlety in conversation. I use it myself, through the '.~' proxy, to add clarity in busy realtime chats. With close friends, one linear dialog may have several concurrent threads (because we both type simultaneously), and the timing of sarcasm may be inadvertantly lost. In a mixed online videogaming team, I may be speaking in a mixed group of long-time, new- and non-friends simultaneously, and it helps all understand more similarly what I am really saying.\n\nConversely, I stay in touch with my family via standalone IM and we have yet to have any need for it, even when my sister and I are comparing the finer points of our work in less than enthusiastic terms.\n\nSuffice to say, if we put it there, it can be used when it suits. And, still, some peole will abuse it.You know the sort: \"OMG.~ STFU! LOL!1!! Hi.~ I \\<3 U.~ Yer smart.~\"\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150420040131/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "14 Oct 2006 — 2:12pm",
      "content": "It kind of looks like an ellipsis to me,\n\nIt will be quite impressive if this takes off. The last new character to come into common use that I know if is the Euro currency mark, and that had more than a dozen governments pushing its use.\n\n"
    },
    {
      "time": "14 Oct 2006 — 2:18pm",
      "content": "I don't think that this will take off. Even the interrobang was never really successful. But that is way ahead of this mark. Didn't Mencken suggest this in the 30s? If it hasn't caught on in the mean time, I wouldn't hold my breath.\n\n"
    },
    {
      "time": "14 Oct 2006 — 2:53pm",
      "content": "I'm not holding my breath. I'm singing. Activism in type!\n\nI don't see the interrobang as being 'ahead' of this character. Its adoption stems from other issues. It offers no communicative value over !? and/or ?!, and is less clear than either of those, as it removes the inflection that ordering the marks offers, towards being rhetorical or actually a question. Additionally, there are unicode spaces for both, allowing individual glyphs, if a designer prefers. Those preceded the late inclusion of the interrobang. I find it mostly 'cute' but redundant. The comparisons are unfortunate, however, since the purpose of the irony mark isn't to be visually 'smart' (though I think it is), but to convey a new meaning to a sentence, that neither '.' or '~' does.\n\nThe irony mark (in one form) was first suggested in the late 19th cetury, according to the Wiki-p, and recirculated in the late `60s. The interrobang, Martin K. Speckter's 1962 invention, was, in my opinion, inspired by the comic and newspaper book use of '!?', since the 1920's. I think some of Menken's ideas were better than others. This one keeps popping up.\n\nRight now, people are beginning to use the tilde, along with lots of other hacks to convey this idea anyway. I'm suggesting standardizing, more than inventing, and inviting others to do so. By \"cheating\" with OpenType we might expedite adoption.\n\nIf it looks too similar to a point of ellipsis, that sounds important. Any suggestions on improving that? An up-sweep, more curve?\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150420040131/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "14 Oct 2006 — 3:14pm",
      "content": "I think that with time it could catch on. Like you pointed out, ordinary people have been picking up the tilde from math/programming nerds, so I think that if this eventually found its way into fonts used for personal communication, it could become common quickly.\n\n"
    },
    {
      "time": "14 Oct 2006 — 3:40pm",
      "content": "At display sizes or at the end of a line I don't think it would be easily mistaken, but in an extended body of text it would resemble an ellipsis in quick reading, as it presents similar color and spacing issues. Overemphasising the uptick of the baseline tilde could get the form interpreted as a sideways question mark instead of a sideways exclamation point. Keeping the whole assemblage longer than an ellipsis in the same font might limit the confusion, but present more spacing issues. Both seem to visually indicate a verbal hesitation or sustained fade, and that's not always intended in an ironic comment.\n\n"
    },
    {
      "time": "14 Oct 2006 — 3:43pm",
      "content": "As the new kid on the block, perhaps I would be better advised to avoid controversies, but.... irony is a pet subject of mine...\n\nI think that before coming up with \"ironic punctuation\", we might become better versed in irony, specifically it's tripartite persective. As a synonym for _sarcasm_, it loses much of it's power.... and it is a powerful rhetorical tool.\n\nsee: [DOHI](http://web.archive.org/web/20150420040131/http:/etext.virginia.edu/cgi-local/DHI/ot2www-dhi?specfile=/texts/english/dhi/dhi.o2w&act=text&offset=9554416&query=irony&tag=IRONY)\n\ngeo.\n\n"
    },
    {
      "time": "14 Oct 2006 — 3:50pm",
      "content": "Just a random thought:\n\nIn this age where communication has been dumbed down to chatting we depend so much on emoticons that I think we've lost some of our ability to use words. I'm completely guilty of this myself. I find myself feeling the urge to use emoticons when I write to people just to make sure they know what emotion I'm trying to betray.\n\nI wonder if we really need an irony mark?\n\n"
    },
    {
      "time": "14 Oct 2006 — 3:55pm",
      "content": "I think this is true of films too Tiff. Seem much great dialogue in movies made recently? Even pop stuff like Star Wars--look at the difference between the dialogue in the old original 3 films and the current 3 pretenders. the whole world has forgotten how to write or eventalk (unless theyre on a cell phone :-(. No wonder people need an \"Applause sign\" on TV audiences.\n\nChrisL\n\n"
    },
    {
      "time": "14 Oct 2006 — 4:03pm",
      "content": "To be fair, cued applause has been used ever since television programs were first performed before a live audience, and likely has its roots in Vaudeville or even earlier forms of theatre.  \nBut I'm not a theatre expert. Why do I feel compelled to spell it that way?!\n\n"
    },
    {
      "time": "14 Oct 2006 — 4:06pm",
      "content": "That is a wonderful link! The illustrated sarcastic examples in the orig. post were chosen for their inherent brevity. In this proposal, verbal contradiction as irony, as well as the surreal and tragic are all assumed to be identified with one mark, most likely used at the 'revelation', which may be the end of sentence or passage. This still leaves something for a clever reader or writer to play with, too.\n\nIt could be appropriately used, amongst other places, where one has concocted an entire hoax: Wells's \"War of the Worlds\", Menken's \"Bathtub Hoax\", Hendersen's \"The Gospel of the Flying Spaghetti Monster\", etc. At the very end, after taking in the audience for the entire duration, it could be something of a \"gotchya\", or escape clause (at the author's discretion, of course).\n\nPresumably, the most common uses might be in sarcasm's identification, or to denote false innuendo, but I feel there is no limitation to simply that.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150420040131/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "14 Oct 2006 — 4:18pm",
      "content": "I use emoticons because they work. I try not to do it too much, but it is an effective tool. I don't think any written system will every convey all that the spoken word offers, but writing has its own advantages. This just might be something that contributes to helping it do even more. And, it isn't as smarmy as a ;) or a 8-O\n\nKeep in mind we romaticize the past. Excellent literary works from the European nobles were written on the backs of an immense illiterate poor class. And while we remeber the genius of works like Star Wars (originals), we forget that 20 craptastic movies came out with glaring ly pointless pulp dialogue those same summers. Speaking of which, Pulp fiction and Memento are pretty recent examples of simplistic speech worked to high effectiveness.\n\nThe potential of the irony mark could be exploited in very creative ways by contemporary authors. I would be fascinated to see what Kurt Vonnegut or Mark Z. Danielewski could do with the idea, much the way the run circles around our minds with the poetic play of existing words and formatting.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150420040131/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "14 Oct 2006 — 4:32pm",
      "content": "Miss Tiffany -  \nI don't think we \"need\" it, but it would be nice. I don't need power tools to build a house, but dang it if I don't take advantage of them!\n\nSometimes, I feel the same way about 'U' and 'V'. The only word that justifies having both is 'Uvula'.~\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150420040131/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "14 Oct 2006 — 4:54pm",
      "content": ":-) .~\n\n"
    },
    {
      "time": "14 Oct 2006 — 5:21pm",
      "content": "This is a **really** good idea.~\n\n"
    },
    {
      "time": "14 Oct 2006 — 5:30pm",
      "content": "I think if anything we don't need _any_ more punctuation; an irony mark is an excuse for a weak vocabulary, poor grammar, and further complicates the lives of people who have no interest in ever consulting style guides to learn how punctuation should be used.\n\nBut I'm also not going to take it upon myself to convince the people of the world that they should be better writers. So anything that makes reading the gibberish that most people spew out these days is a big help. I recently used the word aegis in a sentence and was the only person in the room who knew what the word meant. If I have to keep communicating with people like that, I'll throw in the towel and accept whatever help comes my way.\n\n"
    },
    {
      "time": "14 Oct 2006 — 7:13pm",
      "content": "I wasn't making a call for all the world to improve their communication skills. It was a random thought brought about because of this new thread and the idea of an irony mark. I also wasn't romanticizing about the past. Unless, of course, we no longer consider good communication a part of our present, then I might have been.\n\nI use emoticons too. They are very useful in online communication.\n\nMy bad. I'll keep my thoughts to myself. As you were. :^P\n\n"
    },
    {
      "time": "14 Oct 2006 — 8:51pm",
      "content": "\"I’ll keep my thoughts to myself\"\n\nAS IF!!! (:^P\n\nChrisL\n\n"
    },
    {
      "time": "14 Oct 2006 — 9:39pm",
      "content": "<cite>Even pop stuff like Star Wars—look at the difference between the dialogue in the old original 3 films and the current 3 pretenders. the whole world has forgotten how to write or eventalk<br>\n</cite>  \nreminds me of [this comic](http://web.archive.org/web/20150420040131/http:/www.digitalpimponline.com/strips.php?title=movie&id=22)\n\n"
    },
    {
      "time": "14 Oct 2006 — 10:03pm",
      "content": "Jpad--  \nI doubt more punctuation will complicate their lives, if they never check style guides. Just ours.\n\nAnother thing to consider, there is a chance that that this time in the history of English that we have the exactly right amount of puctuation, but then, perhaps we have too many already. Hypothetically, what might you remove, to simplify things?\n\nMs. Tiffany--  \nI always look forward to your responses, they are always more coherent and more on-topic than, oh, say, mine. How would you say that chatting (meaning via live real-time text?) has dumbed down communication?\n\nWhether or not something assists communication seems to vary. It depends on what and how we are comunication. There are lots of different tools used for different documents: line numbers in pleadings, carets in editing, emoticons in chat, footnotes in theses, and so forth.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150420040131/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\nP.S. If we need to get rid of some crufty old punctuation to make room for the irony mark, my vote is on some of the plethora of quotation-like marks.\n\n"
    },
    {
      "time": "14 Oct 2006 — 11:12pm",
      "content": "At least for me, the criteria for good communication is how close the interpreted meaning come across relative to the speaker's/writer's intention.\n\nDoes the concerns of medium and tool still matter, then? Of course, but after clarity. My guideline is, if they help to clarify your message, then use it. If not, then don't.\n\nI admit that it's a sin that I still do so many times :)\n\nAnd let's not go into the whole \"the medium is the message\" philosophy, that's so PoMo .~\n\n"
    },
    {
      "time": "14 Oct 2006 — 11:23pm",
      "content": "Cuttle fish: _Both seem to visually indicate a verbal hesitation or sustained fade, and that’s not always intended in an ironic comment._\n\nYou've got the idea of exactly what I am going for. A touch of the verbal flavor, but not a caricature of it. Irony may be conveyed sometimes with nothing more that a natural tone and quick flick of a single eyebrow, and I would like to get that in there, too. Perhaps increasing the height of the right end, and keeping the left end of the stroke very narrow? Or squashing more? More of a sideways squat-exclamation than a dot-tilde look. Approximately N width, not M?\n\nHere is a better example of non-sarcastic use of the irony mark, as well as a study of design in body text:\n\n ![](http://web.archive.org/web/20150420040131im_/http:/typophile.com/files/sarc2_6387.jpg)\n\nHere, the mark is used once to imply that some subtext exists in the preceding sentence, and it is not as irreverent as first appears. Next, it suggests a wry smile or knowing smirk, recognizing the implicitly false nature of the statement. I feel it makes both declarations less banal.\n\nFrom a technical view, tiny Verdana is an extremely easy to manipulate screen font. The period (and the component dot of other punctuation) is 1x2 pixels @ 16 point size. In this case, I typed a double space after it, leaving an approximately N-width 'hole'. Then, I manually added a tilde just above the baseline, within the 2 pixel height of the period, and left 2 pixels between the stroke and the dot; that's an attempt to make it look less like an ellipsis. Here's the same example, starting with a very anti-aliased 64pt string:\n\n ![](http://web.archive.org/web/20150420040131im_/http:/typophile.com/files/sarc64_4998.jpg)\n In this case, a tilde was compressed to 40% vertial and 70% horizontal, then thickened and placed to mimic the above sample. However, at this scale, a little more polish should go into the design.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150420040131/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "15 Oct 2006 — 4:21am",
      "content": "A deflated exclamation mark lying in a gutter.\n\nTim\n\n"
    },
    {
      "time": "15 Oct 2006 — 4:29am",
      "content": "[\n ![](http://web.archive.org/web/20150420040131im_/http:/typophile.com/files/237150957_06621bfe50_6203.jpg)\n](http://web.archive.org/web/20150420040131/http:/www.flickr.com/photos/typeoff/237150957/)\n\nsince we are on the tangent of inflating and deflating marks…\n\n"
    },
    {
      "time": "15 Oct 2006 — 4:31am",
      "content": "I would imagine that we all could imagine a variety of 'stage direction' punctuation marks for the indiscerning reader, but implicit in their absence is that there are subtleties of language that empower it far more than the marks could.\n\nIf you have to explain a joke, the joke failed. Explaining that a hurtful comment was intended as humor only increases the hurt, not the humor. Advising the reader that you are be 'being ironic' is rather like removing the petals of the rose to reveal the source of its beauty.\n\ngeo.\n\n"
    },
    {
      "time": "15 Oct 2006 — 5:57am",
      "content": "_Advising the reader that you are be ‘being ironic’ is rather like removing the petals of the rose to reveal the source of its beauty._\n\nA dramatic, yet beautiful metaphor. However, this is about writing, not language. I wonder if Closed Captionists, mobile text messagers, poets concrete and all others subscribe to such an ideal.\n\nSimilarly, alarm or a desire for a response could be invoked through text and subtext, yet marks for each are somewhat popular.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150420040131/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "15 Oct 2006 — 6:49am",
      "content": "of course, M. Cunningham, you are right about the message versus the medium (though that was sidestepped sometime back), but as m. mcL suggested, the two cannot be separated, any more than cause and effect (form/content, space/time) can.\n\nre: the mark itself, it is rather charming actually (as opposed to the interrobang, which i think ugly as hell), but in use, at best superfluous and at worst, a disservice to the reader.\n\nBut, i suppose i have already sufficiently belabored that point.\n\ngeo.\n\n"
    },
    {
      "time": "15 Oct 2006 — 9:18am",
      "content": "i'm sorry I asked.\n\nAnd irony is not a synonym for sarcasm by the way. One could suppose that's the real irony here.\n\n"
    },
    {
      "time": "15 Oct 2006 — 9:45am",
      "content": "I think this is a great idea. I love when a common way of thinking is challenged.\n\nWhile I like the idea of this, I think there's one problem with it. In body copy, it's just plain ugly. This mark disturbs the flow of reading with a jarring break in a paragraph. Maybe the mark could go _under_ the last word of the sentence, or _above_ it?\n\nMr. Lozos and Ms. Wardle bring up good points about internet communication and using emoticons to describe sarcasm or irony. I find the :) or the :/ to be less jarring when typing a message. Internet emoticons have yet to find their way in \"printed\" written communication, however.\n\nShould we then be talking about emoticons as being adopted into written language? Just a thought...\n\nLet's hope that we'll still be capitalizing words and spelling them completely out. When was the last time anyone saw the word \"doughnut\" and not \"donut\" or \"drive-through\" for example?\n\n"
    },
    {
      "time": "15 Oct 2006 — 6:04pm",
      "content": "n ur nt jus kidn :-)\n\nChrisL\n\n"
    },
    {
      "time": "15 Oct 2006 — 7:22pm",
      "content": "Biddy: _In body copy, it’s just plain ugly. This mark disturbs the flow of reading with a jarring break in a paragraph._  \nIs this because it is simply unusual? Is jarring caused by the ugly or vice versa? Any suggestions on design to suit body text? I dunno if emoticons can be made to look good in type. I find them irksome, though unavoidably effective, in even screen-based messages (perhaps because there are so many variants that I have to decode the ideographic qualities of each).\n\nNigella: _... One could suppose that’s the real irony here._  \nWiki sez: \"Irony is a literary or rhetorical device in which there is a gap or incongruity between what a speaker or a writer says, and what is understood.\" I believe that \"incogruity\" encompasses the entirety of [sarcasm](http://web.archive.org/web/20150420040131/http:/en.wikipedia.org/wiki/Irony#Verbal_irony), which lives alongside many other types of paradoxical absurdist, and metastatic writing. And nothing in Alanis's song. (Someone had to mention it, but why me?)\n\n----\n\nThe Awesome & Convenient Power of Anecdotal Evidence (_this is not science, I know_)\n\nI mentioned the irony mark and discussion to someone typing away on a sidekick today. They were a generation older than what I might have assumed the average text messager's age , but they say they use it constantly with their spouse. During the several-second conversation, their eyes lit up, and they said it made total sense. So, I sum up the survey of 1 whole person as:\n\n1. they said they thought they would use the idea.  \n2. it was nice that the tilde be for something finally.  \n3. the best part was that it was simple to use and easy to explain.\n\nI couldn't have hoped for a better reaction.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150420040131/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "15 Oct 2006 — 8:38pm",
      "content": "Design activists should spend their time on great causes like the irony mark!~\n\n"
    },
    {
      "time": "15 Oct 2006 — 8:40pm",
      "content": "Alanis, nay the entire world, would really benefit from the irony mark.~\n\n"
    },
    {
      "time": "15 Oct 2006 — 9:13pm",
      "content": "LOL\n\n"
    },
    {
      "time": "16 Oct 2006 — 3:28am",
      "content": "Sarcasm is a crueller form of irony, intended to mock, wheras irony may be self-deprecating. As Geo. says indicating sarcasm merely increases the intended hurt. To avoid the jarring criticism perhaps you should look at a more vertical solution, most horizontal marks en, em dashes and ellipsis are pause marks.  \nTim\n\n"
    },
    {
      "time": "16 Oct 2006 — 5:14am",
      "content": "\"To avoid the jarring criticism perhaps you should look at a more vertical solution,\"\n\nWould that not be the height of ignorance?~\n\nChrisL\n\n"
    },
    {
      "time": "16 Oct 2006 — 6:52am",
      "content": "If we could get an agreed upon look for this mark, I'd put it in a character set in a heartbeat.\n\nChoz: I mentioned above another way of doing it...but let me elaborate. What if the tilde was below the baseline and curved upward to meet the period on the baseline? Or vice-versa, above cap or ascender height and curving downward. Just a quick idea, don't have time to do a mock-up to see whether that would work. Or, \"D\" but like a backwards \"G\" with a dot (A capital \"D\" with dotted \"i\" inside).\n\n"
    },
    {
      "time": "16 Oct 2006 — 7:45am",
      "content": "\"In this age where communication has been dumbed down to chatting we depend so much on emoticons that I think we’ve lost some of our ability to use words.\"\n\nIMHO, emoticons \\*are\\* punctuation. And have filled this need just fine in the medium that is the chat-based web.\n\n"
    },
    {
      "time": "16 Oct 2006 — 7:56am",
      "content": "So all we have to do is convince the grammar teachers to start teaching a new rule. Should be no problem. That is an extremely flexible group \\< insert sarcasm mark here\\>\n\n"
    },
    {
      "time": "16 Oct 2006 — 9:03am",
      "content": "Don, Watchout for the blue-haired lady in tweed! One of those grammar teachers' rulers is headed your way :-)\n\nChrisL\n\n"
    },
    {
      "time": "16 Oct 2006 — 9:39am",
      "content": "Better the ruler than Maxwell's Silver Hammer.... :-)\n\n(Note: emoticon-captioned for the humour-impaired.)\n\n"
    },
    {
      "time": "16 Oct 2006 — 9:47am",
      "content": "Geez Linda, was that sarcasm? I couldn't tell 'cause you used a smiley-face instead of a tilde-thingy-with-a-dot.\n\n"
    },
    {
      "time": "16 Oct 2006 — 10:15am",
      "content": "I'll work on some mock-ups of what you described, and a few other ideas. I'd really like to keep a relationship to the tilde in there somehow, as I see that as the distinct advantage over earlier proposed solutions, offering backwards compatability and ease of use.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150420040131/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "16 Oct 2006 — 11:13am",
      "content": "I plan to revise the Irony Mark guide on my site to reflect refinements based on this discussion, as well as update the fonts that already include it. At the _very least_, I will be shorting the recommended length, and improving white space. Anybody here who contributes will be credited, and I would be happy to begin a linked list of what fonts feature it.\n\n--\n\n ![](http://web.archive.org/web/20150420040131im_/http:/typophile.com/files/altironymarks_5191.jpg)\n\nVerdana unsmoothed 12 pt, TNR unsmoothed 14 pt.  \n1. Almost original proposal. Tilde scaled 85%w, dropped 2pts.  \n2. Colon-like. Tilde scaled 80%, left alignment with period  \n3. Dropper. To right of period, scaled 75% (both axes), then rotated right 90° and aligned with period top.  \n4. Floater. Full size period, moved into descender and aligned to period right.  \n5. Dropped G. Flipped with redraing to incorporate period.\n\nI am pretty sure I didn't do quite what Biddy was describing in most of these. I suspect that 6 is the most innacurate draft, but anything else I tried looked far too 'heavy' to not impede word flow.\n\nI like 2. I also like 4, but that might conflict with descending letters. What do the other designers here think?\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150420040131/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "16 Oct 2006 — 11:23am",
      "content": "Does it appease those confused about the place of sarcasm and hyperbole in the realm of irony if we refer to this as the ' [verbal irony](http://web.archive.org/) mark'? Then they can google it more readily before debating. My personal preference is that we not codify the use so sternly (or use such a long name), but just table the debate. Let's assume text and type relates to the verbose arts first.\n\nChoz Cunningham  \n!Exclamachine Type Foundry  \n [http://www.exclamachine.com](http://web.archive.org/web/20150420040131/http:/www.exclamachine.com/ \"http://www.exclamachine.com\")\n\n"
    },
    {
      "time": "16 Oct 2006 — 11:58am",
      "content": "This reminds me of the good ol' 1990s when people used to say \"NOT!\" after every sentence.\n\nI really love the irony mark. NOT!\n\n- Lex\n\n"
    },
    {
      "time": "16 Oct 2006 — 1:05pm",
      "content": "I agree with Terry, I think the tilda slows you down when you are reading. But I am not sure that's a bad effect if it's irony your after. Also, If I like it or not matters about as much as if I like or dislike emoticons. That is not at all. If it used enough then <cite>maybe</cite> it will merit it's own glyph. But like emoticons it is most likely to rise on the power of existing glyphs like the tilda. In which case no new glyph will be needed.\n\n"
    },
    {
      "time": "16 Oct 2006 — 1:42pm",
      "content": "Choz, I also like 2 and 4. Now that I see it, 4 might be difficult to execute depending on how long the descenders are in a typeface. Stylistically, this could be a beautiful mark in a really nice serif face.\n\n"
    },
    {
      "time": "16 Oct 2006 — 1:50pm",
      "content": "OK, M. Cunnngham, I will admit, you have me intrigued.\n\nso... a few hours taken away from the work I am supposed to be  \ngetting ready for critique here to play with your idea. I tried to post a sample (jpg) in this place, but.... they do not show. Dunno how to post images in here.\n\nsee :\n\n[http://img124.imageshack.us/img124/3110/snarkvx7.jpg](http://web.archive.org/web/20150420040131/http:/img124.imageshack.us/img124/3110/snarkvx7.jpg \"http://img124.imageshack.us/img124/3110/snarkvx7.jpg\")\n\nThere is a definite 'smirking' quality to the tilde that makes it work.\n\nA first difficulty is the horizontal orientation... takes up rather a lot of space for punctuation. Tilt it a tad? And perhaps join the two pieces by shortening the line and moving the dot into the newly avaiilable space? You will not that i inverted the original glyph (taken from Verdana), to keep it from being confused with the tilde.\n\nsee: [http://img123.imageshack.us/my.php?image=demoxf1.jpg](http://web.archive.org/web/20150420040131/http:/img123.imageshack.us/my.php?image=demoxf1.jpg \"http://img123.imageshack.us/my.php?image=demoxf1.jpg\")\n\nAs for the name, I would agree that you want something more succinct. May i suggest \"Snark\", as in \"snide/sardonic (re)mark\")? It has linguistic precedence in British slang [Snarky](http://web.archive.org/web/20150420040131/http:/www.urbandictionary.com/define.php?term=snarky), which seems to parallel the most common usage.\n\nit would appear that your idea is growing legs\n\n"
    }
  ]
}
