{
  "id": "28821",
  "title": "Type reputations",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello everybody,\n\nWell I'm new here, and I'm about to start a kind of poster project about type and the characteristics of it, I was thinking of having a school of type, where for instance, Helvetica would be the cool kid and Comic Sans would be the kid nobody liked.\n\nThats the basic idea, but what I was looking for, is what you guys think about typefaces and the reputation that suceeds them. A few questions...\n\nIs there a gay typeface?  \nIs there a typeface that would win Miss World?  \nMaybe the worlds strongest man?  \nWhat is the slag of all typefaces?\n\nI would really appreciate your comments, as I am aware that you are all much more experienced than me in this field...\n\nThanks guys,\n\nTom  \nGraphic Design student\n\n",
  "author": "<a href=\"/web/20110812183442/http://typophile.com/user/14955\" title=\"View user profile.\">tomhowe</a>",
  "time": "<br>",
  "uid": "14955",
  "comments": [
    {
      "time": "",
      "content": "Helvetica's probably not the cool kid. He's more like the kid who's got good grades, but not enough to be on the honour roll. He's got a lot of friends, but he's nobody's BEST friend.\n\nThe cool kid might be Gotham or Neutraface right now, although who knows who will be cool tomorrow.\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "The Cool Kid: Neutraface is a nice option, but so are a lot of other House Fonts.\n\nThe Gay Type: United from House Industries. See, Fox sports uses it, and trust me (I'm queer as a three-dollar bill) football is overflowing with gay guys, so use United.\n\nThe Miss World Face: The new Luxury family from House wins again. If you can't get that one, just use Mrs. Eaves\n\nThe World's Strongest: Akzidenz-Grotesk super wins here.\n\nThe Slag of all typefaces: Arial.\n\nAs for Helvetica... man, you're a design student. Use cool fonts now so that when you get stuck using Helvetica later you haven't already gotten sick of seeing it. Hell, unless you can do it at 200 picas or bigger, just don't use Helvetica at all.\n\n"
    },
    {
      "time": "",
      "content": "Tom,\n\nIs your \"chool of type\" located in England or the US, or somewhere else? I think the poster would have a very different feel if you were going for the UK instead of the US. from my observations in Dagenham Comic Sans and Gill would be the popular kids, in the US it would be other faces, maybe Franklin Gothic and Myriad.\n\n"
    },
    {
      "time": "",
      "content": "Din is the kid who's editor of the yearbook, valedictorian, star of the school play, and everybody tries to be just like him.\n\nComic sans is the kid who thinks he's funny but people are laughing at him, not with him.\n\nTimes Roman is the kid who does all the grunt work to please the teacher. You can't get rid of him.\n\nArial is the kid your mom makes you invite to your birthday party because you invited the rest of your class but nobody talks to him - he sits in the corner picking his nose and licking the frosting off the bottoms of the candles\n\nEclat is popular (at least on this site) as are the House Industries kids\n\nGotham - everybody likes gotham, nice to the dweebs as well as the cool kids\n\nPapyrus is the faux intellectual nobody listens to when he raises his hand in class\n\nMrs. Eaves is lovely and mysterious but kind of hard to get along with\n\nMyriad is really really boring but gets good grades. Hangs out with Verdana\n\nAvant Garde seems boring at first but has his own sense of style\n\nDax tries too hard to be cool\n\nGill isn't as interesting as he seems\n\nMatrix is the kid who was cool a few years ago and thinks he still is... but the joke's on him\n\n"
    },
    {
      "time": "",
      "content": "Funny stuff Patricia! :-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Thx! It was kinda late at night...\n\n"
    }
  ]
}
