{
  "id": "28820",
  "title": "new fonts releases newsletter",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all,\n\nI'm completing my research regarding corporate typography - especially custom creations [http://typophile.com/node/27315](http://web.archive.org/web/20131019013526/http:/typophile.com/node/27315 \"http://typophile.com/node/27315\") - and I was amazed that the same fonts come up all the time as branding tools.\n\nYou know them - Helvetica, Univers, Frutiger, Futura, Myriad and the classic gothics (Trade, News, Franklin, ...) - used in close to half the cases.\n\nI asked a few graphic designers who work in branding why these same choices for very different companies and markets. Here are the main reasons: “I don't know where to learn about new fonts” and “I don't have the time or the care to browse around the internet.”\n\nMy suggestion is that a newsletter - an email one that is - be created to advertise these new fonts. People could subscribe for free and font distributors would only pay a few dollars to show these new fonts. Simple technology, a name, a visual, a price and a where to buy. Better yet if it could be multilingual.\n\nWhat's your opinion on this?\n\n",
  "author": "Martin LAllier",
  "time": "14 Oct 2006 — 3:57pm",
  "uid": "7309",
  "comments": [
    {
      "time": "14 Oct 2006 — 4:20pm",
      "content": "Eh?\n\nHasn't almost every foundry (big and small alike) released a newsletter? If we could get an edition of those newsletters to specifically be about faces that are corp id-friendly, now that's different.\n\n"
    },
    {
      "time": "14 Oct 2006 — 4:38pm",
      "content": "Don't forget the Garamonds!\n\n"
    },
    {
      "time": "14 Oct 2006 — 5:05pm",
      "content": "If we choose to specialize in the corp id niche (catering to branding/account planning agencies), I'm sure it'll be a good idea.\n\nHeck, why don't we become type consultants of some sorts? A lot of designers talk about type selection, house style guides and the likes -- all the time. Then there's the problem of unifying it across the border (print, web, TV, outdoor, etc.), while deciding on a face that would fit \"just right\" without resorting to the safe alternatives is already hard enough for them.\n\nTypographic consultancy that extends beyond simply distributing web newsletters, I think that has some potential. Think Fontsmith, but without the foundry.\n\n"
    },
    {
      "time": "14 Oct 2006 — 5:34pm",
      "content": "This is why I get regular mailings from House Industries. And Fontshop. And Linotype, etc. Sometimes I even read the monthly column about new fonts in _Step_ magazine.\n\nThe problem is not that there isn't a newsletter, it's that there are just so damned many fonts out there that it's a pain in the butt to sift through them all, especially the endlessly growing heap heap of one-shot display faces.\n\n"
    },
    {
      "time": "14 Oct 2006 — 11:31pm",
      "content": "Exactly, Mr. Puckett,\n\nThat's why our targeted newsletter's criteria are, first and foremost, versatilility, then consistency (like the name of the font from FontFont that was especially designed to achieve balance on both negative and positive backlighting situation).\n\n"
    },
    {
      "time": "15 Oct 2006 — 2:56am",
      "content": "I think it sounds like a good idea. Some of my typefaces are suited for corporate purposes. But it would be great if they could show up in some sort of pointed nesletter. Please let us all know the progess of this. Good luck!\n\n"
    },
    {
      "time": "15 Oct 2006 — 3:27am",
      "content": "I think a newsletter of this sort would be difficult to put together, because it really has to be independent. But even the MyFonts.com newsletters, which try to represent the broadest possible sources, are edited selections of new fonts—not all new fonts are featured, and sales rank seems to have a lot to do with choice. Although Laurence does write great copy for it.\n\nTypeface selection, even for branding and corporate identity, is still a very subjective matter. How does one make an objective newsletter about it that treats all interested parties fairly? Who writes it, and what is the source that it comes from? A \"Typophile Newsletter\" would be brilliant, because this site has credibility.\n\n"
    },
    {
      "time": "15 Oct 2006 — 8:38am",
      "content": "Coincidence or not? I am in the process of establishing a typographic consultancy — and one of it’s purposes is advising on fonts for CI’s.\n\nI think that the enormous scope of available fonts makes it near impossible for designers and art directors to keep up to date. Ergo the anticipated need for a single source consultant.\n\nI have a name, I have most of the resources in place, financing, a lot of knowledge (I think), but what I think I still need is some help, mostly on a free–lance basis, with possibly the chance for these collaborators to take my concept to other (geographical) markets.\n\nIt’s an experiment in some ways, I know, but I am quite hopeful it’s gonna be a feasible concept.  \nI’ll keep you informed. (Please feel free to contact me about this.)\n\n"
    },
    {
      "time": "16 Oct 2006 — 11:02am",
      "content": "I agree, Mr. Reynolds, the issue of independence will probably be the biggest roadblock to this newsletter.\n\nBut, experimental in nature, maybe it's time to start one like Mr. VanderVeen in the US!\n\nMartin, where are you?\n\n"
    },
    {
      "time": "16 Oct 2006 — 11:29am",
      "content": "There's no need to call me \"Mr.\"… Dan is just fine.\n\nI guess that you have a point… the best thing would be for you to start your newsletter, and see where it goes from there.\n\nWould a blog be better than a newsletter, or less effective?\n\n"
    },
    {
      "time": "16 Oct 2006 — 11:34am",
      "content": "a blog focussed on new releases would probably have a hard time to find enough regular visitors..\n\n"
    },
    {
      "time": "16 Oct 2006 — 11:40am",
      "content": "Really?\n\n"
    },
    {
      "time": "16 Oct 2006 — 11:46am",
      "content": "not because people arent interested - because there arent enough reasons i imagine. but there are plenty of pretty unknown typefaces out there, so the blog could also show released typefaces.\n\n"
    },
    {
      "time": "16 Oct 2006 — 11:55am",
      "content": "One can subscribe to the MyFonts new releases feed. Then, one sees several new fonts per day. The difference would be, in a blog, you'd have to write content to each of the featured fonts, not just show/link to them. There is enough material out there… never mind the gold mine of great unknown font families from the past two decades or so.\n\n"
    },
    {
      "time": "16 Oct 2006 — 12:07pm",
      "content": "a newsletter you get in your mail without any effort and... for those less inclined.. is technologically simpler than subscribing to a RSS feed. And people don't discover the new fonts because they are too busy at the office, so making a blog where they would have to go to isn't a solution. but everybody checks their emails everyday.\n\nthe goal is to “make it easy”\n\nI would not limit the font selection to fonts that have a corporate potential\n\nmyfonts... yes but they only talk about what they distribute\n\n"
    },
    {
      "time": "16 Oct 2006 — 12:09pm",
      "content": "Brampitoyo: I'm in Montréal (Canada)... why?\n\n"
    },
    {
      "time": "17 Oct 2006 — 8:00am",
      "content": "Just wondering, Martin.\n\nAbout the blog – newsletter dichotomy, I'm wondering if we can be somewhere in the middle and have a \"face/family of the day\" kind of e-mail? Instead of doing a weekly letter where we pick 5-7 fonts, we'll pick one each day and do an in depth review (and show some real world usage, CI people love to see practices and examples).\n\nMaybe this is a great idea after all. Any collaborators want to do it, too :) ?\n\n"
    },
    {
      "time": "17 Oct 2006 — 8:07am",
      "content": "Personally, I like the idea of an independent newsletter that announces and/or displays new fonts from a wide variety of foundries. I cannot even remember how I found typophile.com, but am glad I did. I have learned so much from all of you, and have found new favorites that I am saving up to buy (some of Stefan's beautiful creations). While I do love Univers and those other standards, it is wonderful to see how other typographers are interpreting letterforms.\n\n"
    },
    {
      "time": "17 Oct 2006 — 2:20pm",
      "content": "I have been itching to re-launch TypeReview.com and was thinking about some of these very issues.\n\nWhat if one could go to a web site that had a database of fonts and view the data in a variety of ways including RSS feeds \\*and\\* email newsletters. For example, one could register on the site and specify what categories of fonts were of interest, then receive a daily or weekly email listing new releases in just those categories. The listings would include a link back to the site for more information (such as ratings/reviews) and a link directly to the foundry or other appropriate vendor for purchase.\n\nThe real trick would be populating such a database and making the effort to include as many foundries/designers as possible.\n\nAny thoughts on this approach?\n\nRegards,  \ntim\n\n"
    },
    {
      "time": "17 Oct 2006 — 2:31pm",
      "content": "Tim,\n\nI think doing both as you write would be the best option. And I think fairly easy to do.\n\n"
    },
    {
      "time": "18 Oct 2006 — 11:07am",
      "content": "The only problem I see is the time, and the money. Someone would have to pay for it (at least the hosting). And someone would have to put it together. Who's gonna step up to the plate? Hrant where are you? :)\n\n"
    },
    {
      "time": "18 Oct 2006 — 11:09am",
      "content": "Actually, I though Typographica was already doing a pretty good job of this. Most of the new type I've found has been through there. Thumbs up to Stewf and JLT.\n\n"
    },
    {
      "time": "18 Oct 2006 — 11:30am",
      "content": "\\>The only problem I see is the time, and the money.  \n\\>Someone would have to pay for it (at least the hosting).  \n\\>And someone would have to put it together.  \n\\>Who’s gonna step up to the plate? Hrant where are you? :)\n\nThis is why most of the font newsletters sent out each month are already coming from foundries. They have a direct desire—they want to promote their releases (not anyone else's…)—and they pay to do it, in terms of time and money, etc. It brings them positive returns.\n\nIf you make an independent newsletter, financing can get touchy, as people sometimes attach conditions to their advertising, etc.\n\n"
    },
    {
      "time": "18 Oct 2006 — 11:35am",
      "content": "getting foundries to pay for it would take away possible credit for me. i'd rather would try to include banners or similar ads which foundries pay for - that way content and advertising would be separated.\n\n"
    },
    {
      "time": "18 Oct 2006 — 3:18pm",
      "content": "What about if the positions are sold? For example, let's say about 10 new fonts per week - more if more, less if... - the first position at the top of the list costs more, than the second, and the rest is at the basic price.\n\nScreen realestate :) Many people have small browsing windows in their email software and being at the top is a clear advantage.\n\nGee, we're giving out a whole business model online here ;)\n\n"
    },
    {
      "time": "18 Oct 2006 — 4:35pm",
      "content": "I think weekly is a bit much. Once a month should be plenty. Many graphic design magazines don't even come out monthly.\n\n"
    },
    {
      "time": "18 Oct 2006 — 4:40pm",
      "content": "Right, but that would contradict on the very thing that the newsletter was founded upon. I'm thinking something along Ads via The Deck – if you know what I'm talking about. They got an elegant system, although it is still partisan, obviously.\n\nOn a wholly different note, what about _The Onion_ of the typographic scene. Fun stuff, that. And I'm sure Chris Lozos would very much like to join the team :)\n\n"
    },
    {
      "time": "18 Oct 2006 — 7:03pm",
      "content": "Well, you could certainly fund the site in the usual ways -- Google AdSense, apparel and such through Cafe Press, Amazon sales, etc. I would also have feature spots in the email, and they would cost; but I wouldn't want to charge anything for a basic listing.\n\nOf course, one would not get rich in this way, but that's not necessarily what it's all about. I suspect one could make enough to pay for the time and bother, as well as the basic expenses.\n\nI might be wrong, but I think I'm willing to take that chance (again).... ; )\n\nRegards,  \ntim\n\n"
    },
    {
      "time": "18 Oct 2006 — 8:58pm",
      "content": "<cite>What about if the positions are sold? For example, let’s say about 10 new fonts per week - more if more, less if… - the first position at the top of the list costs more, than the second, and the rest is at the basic price.</cite>\n\nWhat's the motivation for a designer to read a newsletter knowing that foundries can pay for top billing? We already see their ads in magazines, get their bulk mail, and their emails.\n\nIf I'm going to subscribe to a font mailing list, it needs to feature great fonts that are slipping through all the noise generated by advertising. Otherwise it just isn't going to offer anything new.\n\n"
    },
    {
      "time": "18 Oct 2006 — 11:24pm",
      "content": "remember jpad\n\nthe newsletter is not aimed primarily at type designers, but at graphic designers... most of which don't care as much as we typophiles do about letters!\n\nand if, let's say Process Type - a very creative outfit! - is in the newsletter, closer to the bottom for example, it's fonts will still be discovered\n\n"
    },
    {
      "time": "19 Oct 2006 — 1:33am",
      "content": "Hmm, since we're targeting the graphic designers, why not put ads that are graphic design related? That way, we can have our cake and eat it too.\n\nThat won't present a problem to the objectivity of the newsletter, but in terms of the ad pervasiveness, yes. And we don't like that too.\n\nThus the solution: we'll take ads just from typefoundries, but under one condition: they can't feature a font, only a site banner.\n\n"
    },
    {
      "time": "20 Oct 2006 — 11:19am",
      "content": "I still don't know why a newsletter has to be weekly. Why can't it be monthly? Or bi-weekly at the most? Making something like this takes time. It has to be designed. I don't many people willing to put that much work in for very little return. This is a full-time job, not a hobby on the side. I like the idea...but I think it needs to be looked at little more realistically.\n\n"
    },
    {
      "time": "20 Oct 2006 — 11:40am",
      "content": "One thing that I don't think people realize is the ability to make news releases here on Typophile. People do use Typophile RSS, why not just post it here and let all of us in on the action?\n\n"
    },
    {
      "time": "20 Oct 2006 — 11:46am",
      "content": "Word up, Tiff.\n\n"
    },
    {
      "time": "20 Oct 2006 — 12:06pm",
      "content": "Tiffany,\n\nWhere should news releases go?\n\nAnd BTW, IE7 does not like Typophile RSS -- doesn't support DTDs.\n\nRegards,  \ntim\n\n"
    },
    {
      "time": "20 Oct 2006 — 1:47pm",
      "content": "What happened to Paul's post?\n\n"
    },
    {
      "time": "20 Oct 2006 — 1:50pm",
      "content": "Use [**this link right here**](http://web.archive.org/web/20131019013526/http:/typophile.com/node/add/story) to create a new story. If it doesn't appear after you publish it, please e-mail me and I'll see that it is taken care of.\n\n"
    },
    {
      "time": "20 Oct 2006 — 3:24pm",
      "content": "i deleted my own post, Tiff. I logged in using my old account and saw that there were no options to \"Publish\" or take out of moderation. So I'm assuming that if someone besides a moderator posts a news item, they must then contact a moderator to \"Publish\" the News Item. (At least that's what I'm guessing needs to happen).\n\n"
    },
    {
      "time": "20 Oct 2006 — 3:46pm",
      "content": "Ah. I thought I was losing my mind. :^)\n\nOk so the rule is that when you post a news item (story) you need to e-mail (contact) a moderator so we can publish it. But still, this is a very easy way to let anyone who subscribes to the Typophile RSS know that you've released something new.\n\nJust a note, when you do post a story, the more you can write the better it will look and the more likely you will get people at least going to your site to see the typefaces.\n\n"
    },
    {
      "time": "23 Oct 2006 — 4:45am",
      "content": "[http://www.hiveminds.co.uk/node/3139](http://web.archive.org/web/20131019013526/http:/www.hiveminds.co.uk/node/3139 \"http://www.hiveminds.co.uk/node/3139\")\n\n"
    },
    {
      "time": "2 Nov 2006 — 11:52pm",
      "content": "So Mr Martin, I'm mighty interested in doing this thing. It's half experimentation at best, but the potential to be the first in the corp-id market is, in my opinion, quite substantial.\n\nLet's shell out some more concepts and define this newsletter specifically (format, distribution, etc.), I truly think that your idea has legs (and is growing one on me :)\n\nOr an alternative, we could go non-profit and make a Typophile-weekly-pick sort of thing. That's sweet as well.\n\n"
    }
  ]
}
