{
  "id": "28848",
  "title": "Complementing Caecilia",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm hoping someone out there can give me the answer to my quandary. I have selscted Caecilia (see the pic) as the main font for use in materials for my new business. I want a sans serif to complement it (for headings etc) and can't find anything I feel really works. I might just be being very choosy, but if anyone has any ideas I'd be happy to hear them.\n\nThanks\n\nRobert\n\n",
  "author": "flowersandchocolate",
  "time": "16 Oct 2006 — 8:41am",
  "uid": "14595",
  "comments": [
    {
      "time": "16 Oct 2006 — 9:10am",
      "content": "Have you considered working with the Thesis fonts instead? TheSerif is a dead ringer for Caecillia and The Sans works beautifully with it.\n\n"
    },
    {
      "time": "16 Oct 2006 — 9:25am",
      "content": "Exactly my thought, Patty. If you've already licensed Caecilia, [TheSans](http://web.archive.org/web/20150111194757/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=thesans) will work fine with Caecilia too. Other ideas:\n\n[Freight Sans](http://web.archive.org/web/20150111194757/http:/www.fontshop.com/showfont.cfm?fid=GF.118889.0.0)  \n [Fresco Sans](http://web.archive.org/web/20150111194757/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Fresco%20Sans)  \n [Vista Sans](http://web.archive.org/web/20150111194757/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Vista%20Sans)  \n [Locator](http://web.archive.org/web/20150111194757/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Locator)\n\n"
    },
    {
      "time": "16 Oct 2006 — 9:29am",
      "content": "i used theserif (text) together with akzidenz grotesk super (headlines) for a festival magazine, but the audience was 14-24, and thats probably not the same for you ;)\n\nAG super is a great counterpart to fine humanistic slabs imho because it takes them out of the \"nice and lovely\" corner. but hmm, thats just my opinion. plus its a rather unconventional mix, pairing a humanistic with a grotesque - but lets note too that AG isnt your everyday static grotesque due to its round shapes.  \non the safer side, any humanistic sans could work. whitney, the already named thesans, frutiger next, maybe even vista.\n\ndisclaimer: all content of this post was written because i like to help, not because i think too great of my typographic skills.\n\n"
    },
    {
      "time": "16 Oct 2006 — 9:33am",
      "content": "I agree with Patty as well. Thesis is a wonderful family. Not to take anything away from Caecilia. I'm using Caecilia on a project right now. I'm using it with Apolline Italic, which is a serif, so doesn't apply to your question.\n\n"
    },
    {
      "time": "16 Oct 2006 — 1:12pm",
      "content": "Thanks for the comments so far –&nbsp;I'll look into them. I realised too late that I had foolishly chosen a font that was the only one it's creator had designed so there wasn't the usual chance to dig out the \"follow ups\", I was obviously taken with it a little too much.\n\nThanks again and I'll keep you updated\n\n"
    },
    {
      "time": "16 Oct 2006 — 1:49pm",
      "content": "I've been working on a project recently that uses Caecilia as the main typeface (we don't own Thesis). I agree with statements here about choosing a round face. I have paired it recently with Avenir. I think a \"geometric\" are \"draftsman\" look would work the best with such a slabby face.\n\nTry Gotham, Avenir, Proxima Nova, or even Interstate to go along with it. Interstate actually works quite well with it, believe it or not.\n\n"
    },
    {
      "time": "16 Oct 2006 — 2:23pm",
      "content": "I had used FS Albert (fairly rounded and geometric) with it, but it fell to pieces on me from a techology point of view and I resent the prospect of paying for it again.\n\nI've used Avenir before and think it may be a little too geometric (mainly for my tastes) but I'll certainly give it a go.\n\n"
    }
  ]
}
