{
  "id": "28845",
  "title": "Everything from the wheel to the bra strap and two typefaces",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Helvetica rendered in straight lines  \n [http://www.peoplesdesignaward.org/detail\\_view.php?nomination\\_id=70](http://web.archive.org/web/20120917004934/http:/www.peoplesdesignaward.org/detail_view.php?nomination_id=70 \"http://www.peoplesdesignaward.org/detail\\_view.php?nomination\\_id=70\")\n\nMyriad doesn't come out too well either  \n [http://www.peoplesdesignaward.org/detail\\_view.php?result\\_set=0&q\\_conditi...](http://web.archive.org/web/20120917004934/http:/www.peoplesdesignaward.org/detail_view.php?result_set=0&q_condition=undefined&nomination_id=539 \"http://www.peoplesdesignaward.org/detail\\_view.php?result\\_set=0&q\\_condition=undefined&nomination\\_id=539\")\n\nTim\n\n",
  "author": "timd",
  "time": "16 Oct 2006 — 6:21am",
  "uid": "2289",
  "comments": [
    {
      "time": "16 Oct 2006 — 7:48am",
      "content": "Horrible! You'd think that on a site about design they would respect the work. The fonts are most likely installed on their machines. Why didn't they make their own specimen rather than upscaling a crappy low res web image?\n\n"
    },
    {
      "time": "16 Oct 2006 — 9:33am",
      "content": "What fogs me is the comments as to why people think Helvetica's so great: what do these people do for a living? It's obviously not something related to design....\n\nLinda\n\n"
    },
    {
      "time": "16 Oct 2006 — 10:09am",
      "content": "You can always report their comments as inappropriate:)  \nThe nominator works with type.  \nTim\n\n"
    },
    {
      "time": "16 Oct 2006 — 10:16am",
      "content": "Tim, please tell me the general levels, and knowledge, of design are higher there than it is here. Pretty please?\n\nL.\n\n"
    },
    {
      "time": "16 Oct 2006 — 10:23am",
      "content": "[http://www.telegraph.co.uk/arts/main.jhtml?xml=/arts/2006/02/13/badesign...](http://web.archive.org/web/20120917004934/http:/www.telegraph.co.uk/arts/main.jhtml?xml=/arts/2006/02/13/badesign13.xml \"http://www.telegraph.co.uk/arts/main.jhtml?xml=/arts/2006/02/13/badesign13.xml\")\n\n\"By what criteria would any sane person want to choose between Concorde, the World Wide Web and something most of us have barely noticed, the \"Verdana\" typeface?\"\n\nThe irony is that the page is set in Verdana (now if only there was some mark to indicate irony).\n\nSometimes I just have to shake my head in despair and add another name to my list.  \nTim\n\n"
    },
    {
      "time": "16 Oct 2006 — 10:29am",
      "content": "I kind of like the straight lined Helvetica, reminds me of the result from playing around with letrasets and when photocopying type. It looks generated in a way that a designer wouldn't create it.\n\nThat little square of Helvetica type is more interesting to me than 99% of all normal use of the typeface.\n\n-  \nMLVR\n\n"
    },
    {
      "time": "16 Oct 2006 — 10:38am",
      "content": "Thanks for posting that link, Tim: great article.\n\nLinda\n\n"
    },
    {
      "time": "17 Oct 2006 — 12:09am",
      "content": "I can't claim authorship of that link, it’s from Microsoft via the news page here at Typophile. I should also say I don't condemn Helvetica, it does take some thought and work for it to perform at its best, but one could say that of any typeface.  \nTim\n\n"
    },
    {
      "time": "17 Oct 2006 — 6:29am",
      "content": "\\>it’s from Microsoft via the news page here at Typophile.\n\nAnd as I put the wrong date on my post it's been at the top of the news page for months :-( sorry.\n\n"
    },
    {
      "time": "17 Oct 2006 — 7:00am",
      "content": "<cite>That little square of Helvetica type is more interesting to me than 99% of all normal use of the typeface.</cite>\n\nIsn't being uninteresting the point of Helvetica?\n\n"
    },
    {
      "time": "17 Oct 2006 — 7:37am",
      "content": "The font shown and known as \"Helvetica\" was designed by Max Miedinger in 1937. The first production of the types was done 1957 by Haas'sche Giesserei in Switzerland and they called it \"Haas-Grotesk\".  \nThey offered Haas-Grotesk mager (regular), halbfett (bold) and kursiv (italic). The link in the first posting does not show these informations.\n\n4 years later, in 1961, D.Stempel, Frankfurt am Main, Germany, bought Haas'sche Giesserei.\n\nAnd 1961, D.Stempel called this font \"Helvetica\".  \nAnd Stempel was it, who designed lots of other versions of Helvetica.  \nThis font was the No. 1 of Grotesk fonts in Germany (West Germany) for more than 20 years. Much more successful as e.g. Folio-Grotesk from Bauersche Giesserei or Akzidenz-Grotesk from H. Berthold. Every german printer who wanted to have a good position in his local market, used Helvetica. Because it is very easy to combine Helvetica with other fonts, which are no Grotesk.\n\nIf you are interested to see more of original Helvetica from Stempel, please visit:  \n [http://www.bleisetzer.de/index.php?target=shop/shop&b=0004](http://web.archive.org/web/20120917004934/http:/www.bleisetzer.de/index.php?target=shop/shop&b=0004 \"http://www.bleisetzer.de/index.php?target=shop/shop&b=0004\")\n\nMay be that pre-press professionals from today think Helvetica is boring. But Helvetica did a very good job in the past.\n\nGeorg\n\n ![](http://web.archive.org/web/20120917004934im_/http:/typophile.com/files/1_6230.jpg)\n  \nHelvetica light from 1965\n\n[Preußisches Bleisatz-Magazin](http://web.archive.org/)\n\n"
    },
    {
      "time": "17 Oct 2006 — 8:41am",
      "content": "I'm not saying that Helvetica and its predecessors are inherently bad faces: heaven knows how many projects I've used them in.\n\nThe problem I think many of us, myself included, have is that over its life, it has been (a) overused and (b) frequently set poorly by people who don't know any better. Even the best filet mignon tastes like shoe leather if you cook it improperly.\n\nLinda\n\n"
    },
    {
      "time": "17 Oct 2006 — 11:35am",
      "content": "I cannot think of any typeface being more interesting and involving than Helvetica. Teachers who prohibit their students from using it, designers condemning it, people making movies and books about it and so on...\n\nBut as I mentioned, most of the usage is quite dull...\n\n-  \nMLVR\n\n"
    },
    {
      "time": "17 Oct 2006 — 11:46am",
      "content": "@ Linda\n\nI understand what you mean.  \nAnd I for myself think the same about Folio-Grotesk and/or Lithographia. Because I used it too much for years. But this is my personal problem and it cannot mean that both fonts are overused.  \nA fact is: The Helvetica is a very harmonic font.\n\nAnd what I wanted to say is: The informations on this website about Helvetica are wrong or, better, not correct.\n\nGeorg\n\n[Preußisches Bleisatz-Magazin](http://web.archive.org/)\n\n"
    },
    {
      "time": "17 Oct 2006 — 11:47am",
      "content": "\\>Teachers who prohibit their students from using it, designers condemning it, people making movies and books about it and so on…\n\nSo if someone were to make a movie and write a book about Papyrus, Curlz or Comic Sans they would become \"interesting and involving\" too? ;-)\n\n"
    },
    {
      "time": "17 Oct 2006 — 12:02pm",
      "content": "People write books and make movies about Helvetica because it is interesting. Not to make it interesting. Comic Sans however is also in that cathegory there are yet to come a book or a movie about it though...\n\n"
    },
    {
      "time": "17 Oct 2006 — 12:04pm",
      "content": "_So if someone were to make a movie and write a book about Papyrus, Curlz or Comic Sans they would become “interesting and involving” too? ;-)_\n\nHey, it was the last project Tom Cruise was working on before his development deal with Paramount got hosed, with the book by John Travolta. ;-)\n\nL.\n\n"
    },
    {
      "time": "17 Oct 2006 — 6:20pm",
      "content": "Yikes! I have a lot of respect for Ellen Lupton (the nominee), but I'm suprised at the mundanity of her choice in this instance.\n\n_I kind of like the straight lined Helvetica_\n\nThis image reminds me of the old issue with Berthold's proprietary postscript fonts; back in the 80s, Berthold optimised their postscript library so their typefaces would only image smoothly on Berthold imagesetters – if you ran it out on a Linotronic it would look all 'crunchy' and straight-sided round the curves.\n\nI once saw this effect on a theatre poster and couldn't tell if it had been done intentionally or not... it did make the type look more interesting, in a postmodernist 'oh no! the technology's s\\*\\*ffed it up again' kind of a way.\n\nMaybe that's what design awards are now here to celebrate?\n\n"
    },
    {
      "time": "17 Oct 2006 — 7:52pm",
      "content": "You know, Tim, there is indeed a mark for irony (or at least it has been planned for in this forum). It's a dot-and-tilde (.~), which idea was proposed by Choz Cunningham.\n\nAside from that, while People's Design Award might not seem appropriate. Designer's Design Award might be a good award for it -- I mean, isn't that true?\n\n"
    },
    {
      "time": "18 Oct 2006 — 12:06am",
      "content": "I think Tim was being, uh, well, you know.~\n\n_So if someone were to make a movie and write a book about Papyrus, Curlz or Comic Sans they would become “interesting and involving” too? ;-)_\n\n\"What's your favorite scary movie?\"\n\n[Choz Cunningham](http://web.archive.org/web/20120917004934/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20120917004934/http:/www.exclamchine.com/)  \n [.~](http://web.archive.org/web/20120917004934/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "18 Oct 2006 — 3:30am",
      "content": "I was being .~ and §\n\nIn fact the whole post is ironic – considering Helvetica is (according to the nomination) a typeface for a cleaner, more equitable world, that it should be represented in such an unflattering light.\n\nTim\n\n"
    },
    {
      "time": "18 Oct 2006 — 5:23am",
      "content": "Fahrenheit 9/11 (2004)  \nFahrenheit 9/11 Directed by  \nMichael Moore\n\nor the 2012 movie 'the Presidency of George Walker Bush'\n\n ![](http://web.archive.org/web/20120917004934im_/http:/typophile.com/files/453px-George-W-Bush_3523.jpeg)\n\n"
    },
    {
      "time": "18 Oct 2006 — 9:06am",
      "content": "\"§\"?\n\nOh, dear, that mark suddenly looks a lot like a can, with worms crawling out of it.\n\n[Choz Cunningham](http://web.archive.org/web/20120917004934/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20120917004934/http:/www.exclamchine.com/)  \n [The Snark](http://web.archive.org/web/20120917004934/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "18 Oct 2006 — 12:11pm",
      "content": "Is this still a Helvetica discussion?\n\n[Preußisches Bleisatz-Magazin](http://web.archive.org/)\n\n"
    },
    {
      "time": "18 Oct 2006 — 1:22pm",
      "content": "Along with the crucifixion of Helvetica by its admirers, we're discussing a myriad of things.~\n\n[Choz Cunningham](http://web.archive.org/web/20120917004934/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20120917004934/http:/www.exclamchine.com/)  \n [The Snark](http://web.archive.org/web/20120917004934/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "18 Oct 2006 — 3:35pm",
      "content": "This time, i have to correct more than one mistake:\n\nAs Bleisetzer has already written. Miedinger is spelled thus, not Meidinger as on the website. And Helvetica is not the Latin name of the country, but Helvetia is. In fact, their car plates say CH, for Confederatio Helvetia.\n\nThe name was, indeed, coined by Stempel in Frankfurt – by one of their salesmen, Herr Eul (i attach his original letter with the proposal). He suggested Helvetia (sic), but that name was deemed unusable. The new Haas Grotesk was designed in 1957, not 1937. After the war, Swiss designers favoured Akzidenz Grotesk from Berthold in Germany, so Haas needed to fight back. The foundry commissioned Max Miedinger, also a salesman, to design a new Akzidenz Grotesk, but more neutral. Bingo.\n\n20 years later, Günter Gerhard Lange at Berthold undertook the same job: he redesigned AG and called the result Akzidenz Grotesk Buch, which looks like Helvetica with some AG features like oblique terminals.\n\n ![](http://web.archive.org/web/20120917004934im_/http:/typophile.com/files/helvetica_letter_3838.jpg)\n\n"
    },
    {
      "time": "18 Oct 2006 — 3:59pm",
      "content": "_People write books and make movies about Helvetica because it is interesting._\n\nThe opposite, actually. It's the celebrity typeface. If it weren't so vacuous, that would detract from its ability to be famous for being famous.\n\n"
    },
    {
      "time": "19 Oct 2006 — 1:15am",
      "content": "That's very cynical Nick.\n\nHelvetica is famous because it is interesting. (It's naive to belive that anything get famous if vacuous, ask any marketeer.)\n\nIt is interesting thanks to it's flexibility and legibility. It is also the result of a daring marketing strategy which however made it pretty much synonym with swiss design and also gained the status of being Swizerlands house type.\n\n"
    },
    {
      "time": "19 Oct 2006 — 1:28am",
      "content": "\"It is also the result of a daring marketing strategy which however made it pretty much synonym with swiss design and also gained the status of being Swizerlands house type.\"\n\nAnd all be done by a german foundry.  \nWhat a pretty nice additional detail :-)\n\nBleisetzer  \n [www.bleisetzer.de](http://web.archive.org/web/20120917004934/http:/www.bleisetzer.de/ \"www.bleisetzer.de\")\n\n"
    },
    {
      "time": "19 Oct 2006 — 1:39am",
      "content": "As in my situtation. Doing Sweden's best advertising - in the name of a German agency :-)\n\n"
    },
    {
      "time": "19 Oct 2006 — 2:11am",
      "content": "I never dreamt that I would ever be able to nitpick with Mr Spiekermann in even the most trivial detail, so this is a chance too good to miss: It's Helvetia but Confoederatio Helvetica (witness the official website of the Federal Swiss Authorities at [http://www.admin.ch/ch/index.en.html](http://web.archive.org/web/20120917004934/http:/www.admin.ch/ch/index.en.html \"http://www.admin.ch/ch/index.en.html\")). Helvetia is the Latin word for Switzerland, Helvetius -a -um and Helveticus -a -um are the corresponding adjectives (both versions of the adjective are found in Caesar).\n\n"
    },
    {
      "time": "19 Oct 2006 — 5:25am",
      "content": "In the letter, Eric posted, Mr. Eul, Marketing Manager of D.Stempel, told the general management about the current situation of Grotesk fonts in Germany. He says there was a kind of very famous fashion wave(?) of \"Swiss Typography\" (Schweizer Typographie). This does not mean only the fonts but the \"modern\" designs, realized by Grotesk fonts.\n\nSo he, Mr. Eul, wanted to find a name which the customers, the printers, associate with Switzerland, Swiss design. The general management thought \"Helvetia\" was is already used by Deutsche Bundesbahn (German Railway) for a special train. This \"Helvetica\" was the first one which connected Hamburg in the very north of Germany with Zurich (Switzerland) with only a few stops in between.\n\nSo they decided to call the font \"Helvetica\". And got no trouble with the german government (railway).\n\nGeorg\n\n[www.bleisetzer.de](http://web.archive.org/web/20120917004934/http:/www.bleisetzer.de/ \"www.bleisetzer.de\")\n\n"
    },
    {
      "time": "19 Oct 2006 — 9:45am",
      "content": "_(It’s naive to belive that anything get famous if vacuous, ask any marketeer.)_  \nReally?\n\n ![](http://web.archive.org/web/20120917004934im_/http:/typophile.com/files/rooneynike200606_600x354_4089.jpg)\n\n"
    },
    {
      "time": "19 Oct 2006 — 10:12am",
      "content": "please ellaborate...\n\n"
    },
    {
      "time": "19 Oct 2006 — 2:03pm",
      "content": "\\>It is also the result of a daring marketing strategy which however made it pretty much synonym with swiss design and also gained the status of being Swizerlands house type.\n\nI think you’re confusing Swiss design with design in the country (or more accurately confederation) known as Switzerland. Helv may be associated with “Swiss design”, but I think Frutiger’s types (Univers and Frutiger) are Switzerland’s signature types.\n\n"
    },
    {
      "time": "19 Oct 2006 — 2:50pm",
      "content": "With swiss design I mean swiss design as a movement.\n\nAnd with being a Swiss house type I have to refer to a quote from the book 'A hommage to a typeface': \"Helvetica is the typeface used on IRS forms. In Switzerland, it appears on everything from government papers to lingerie catalogues.\"\n\n"
    },
    {
      "time": "19 Oct 2006 — 3:04pm",
      "content": "\\>In Switzerland, it appears on everything from government papers to lingerie catalogues.\n\nYou could substitute any country name for Switzerland in that sentence.\n\n"
    },
    {
      "time": "19 Oct 2006 — 3:23pm",
      "content": "Does it really matter? Imo it still proves my point, being that a good and daring marketing strategy and not vacuousness turned Helvetica famous :-)\n\n"
    },
    {
      "time": "19 Oct 2006 — 3:26pm",
      "content": "And please Nick Shinn I am curious for you to ellaborate what you consider vacuous with that Nike ad?\n\n"
    },
    {
      "time": "19 Oct 2006 — 4:15pm",
      "content": "\\>And please Nick Shinn I am curious for you to ellaborate what you consider vacuous with that Nike ad?\n\nI think you're missing the point here. I think Nick is saying Mr Beckham, although the world's most famous man, has little substance - just like Helvetica.\n\n"
    },
    {
      "time": "19 Oct 2006 — 4:50pm",
      "content": "Erik, thanks a lot for posting this letter, that's great! One day this letter will be a document as important to future typographic historians as the Le Bé Memorandum  \n;)\n\nWas Helvetica modelled only on Akzidenz Grotesk, or did Miedinger use also the 'Breite Grotesk' by Schelter & Giesecke as a model? Are there any proofs for this claim, or are these only based on similarity?\n\nHere's the first appearance of the Breite Grotesk by Schelter & Giesecke  \n(the 'Magere' weight only) in  \nTypographische Mitteilungen, 3. Band 4. Heft 1890, p 673\n\n(In 'Handbuch der Schriftarten' you can read that the Breite Magere Grotesk dates from 1870, but this is clearly wrong)\n\n ![](http://web.archive.org/web/20120917004934im_/http:/typophile.com/files/Schelter_4528.jpg)\n\n"
    },
    {
      "time": "19 Oct 2006 — 5:16pm",
      "content": "Typographische Mitteilungen [typographic reports] was a magazine published by J. G. Schelter & Giesecke to promote their new typefaces and the efforts of the company to modernise their whole type production methods.\n\nIf anyone has more information about the Breite Grotesk, please let me know.\n\nFF Bau is is based on the ‘Breite Grotesk’.\n\n[http://www.myfonts.com/fonts/fontfont/bau/](http://web.archive.org/web/20120917004934/http:/www.myfonts.com/fonts/fontfont/bau/ \"http://www.myfonts.com/fonts/fontfont/bau/\")\n\n"
    },
    {
      "time": "20 Oct 2006 — 12:45am",
      "content": "\\>Mr Beckham, although the world’s most famous man, has little substance\n\nActually the spud-faced nipper is Wayne Rooney, and although I don't have much good to say about him in the way he conducts himself both on and off the pitch, he is well-known, in the UK at least, because he is a sportsman, he is not famous for being famous, I'm sure we can all imagine a better example of that level of vacuousness.\n\nBreite Grotesk looks too characterful to have been the source for Helvetica, but I suppose if one was trying to iron out any \"humanity\" it could be an inspiration.\n\nTim\n\n"
    },
    {
      "time": "20 Oct 2006 — 1:28am",
      "content": "In \"Seemann, Handbuch der Schriftarten\" from 1926 are more than one \"Breite Grotesk\" listed, e.g. from Bauersche Giesserei from \"before 1867\".\n\nGeorg\n\n[www.bleisetzer.de](http://web.archive.org/web/20120917004934/http:/www.bleisetzer.de/ \"www.bleisetzer.de\")\n\n"
    },
    {
      "time": "20 Oct 2006 — 1:54am",
      "content": "Sii, you seem eager to clear things out for me. And after clearing out that it was actually Wayne Rooney on the poster and not Becks as you suggested - perhaps you can explain to me in what way Helvetica has little substance?\n\n(Worth to mention might be that Helvetica is by far not my favourite typeface, I just find it hard with people always accussing it for lacking character etc.)\n\n"
    },
    {
      "time": "20 Oct 2006 — 2:23am",
      "content": "Surely the part of the point of Helvetica was the characterlessness in that Modernist way of making machines for living, sitting, reading etc.  \nTim\n\n"
    },
    {
      "time": "20 Oct 2006 — 2:58am",
      "content": "\"Surely the part of the point of Helvetica was the characterlessness in that Modernist way of making machines for living, sitting, reading etc.\"\n\nPeople buy letterpress fonts in my online shop.  \nMostly they are printers. All of them love the old letterpress stuff.  \nThey spend their money buying fonts from Group VII - Antiqua Varianten and Group VIII - Schreibschriften (DIN 16 518). But very often they forget to buy fonts like Helvetica, Akzidenz-Grotesk, Folio-Grotesk. After a year or so they start to ask for e.g. Helvetica. Because they learned that they need it.\n\nYou need fonts for the standard text. To make special fonts more important. If you only use special fonts, its confusing and does not look nice.\n\nHelvetica was a very good solution for all these standards.  \nThis was a well working font. The glamour was given to others. But Helvetica did the job.\n\nGeorg\n\n[www.bleisetzer.de](http://web.archive.org/web/20120917004934/http:/www.bleisetzer.de/ \"www.bleisetzer.de\")\n\n"
    },
    {
      "time": "20 Oct 2006 — 3:17am",
      "content": "\\>The glamour was given to others\n\nMy point was that _glamour_ was removed for Helvetica, and it does the job in its place (although given a choice I would use Univers) however its place is limited and **that** is not always appreciated by designers.\n\nTim\n\n"
    },
    {
      "time": "20 Oct 2006 — 9:13am",
      "content": "\\> perhaps you can explain to me in what way Helvetica has little substance?\n\nI didn't say that, I was offering a possible explanation for Nick's posting of the ad (Sorry Wayne and David for the mix-up). Personally I'm completely neutral on Helveti(c)a.\n\n"
    },
    {
      "time": "20 Oct 2006 — 9:38am",
      "content": "My point about the vacuousness of brand advertising has been made by the discussion of Rooney, not Nike. The actual merit of the product, or even what it is, is irrelevant, and that is the case with Helvetica's fame. People who are barely familiar with typoography and couldn't tell Helvetica from Comic Sans, and who are unaware that the sample has rendered in straight lines, have an awareness of \"Helvetica\".\n\nYesterday I heard the results of a focus group for a newspaper redesign, for which I am providing all-new fonts. Of the focus group, only one fellow mentioned the text type (so I must be doing ok!) -- \"Yes, it's Courier,\" he said, \"No,\" (quite categorically) \"It's Times.\" I suspect he would have identified any sans serif as Helvetica.\n\n"
    }
  ]
}
