{
  "id": "28847",
  "title": "I have found a font similar to the Gucci logo",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi, this post just concerning the requests to ID the Gucci Logo.\n\nID was usually dismissed because considered the Logo was considered custom designed, but I just fed the Logo in [www.myfonts.com](http://web.archive.org/web/20150302015356/http:/www.myfonts.com/ \"www.myfonts.com\") 'what the font' engine and it neatly outputed this typeface ... I'd say a 95% match of the logo.\n\n ![](http://web.archive.org/web/20150302015356im_/http:/typophile.com/files/Picture-1_5251.gif)\n\n",
  "author": "philippe@basede...",
  "time": "16 Oct 2006 — 7:41am",
  "uid": "13804",
  "comments": [
    {
      "time": "16 Oct 2006 — 7:50am",
      "content": "Are you going to tell us which font this is???\n\n"
    },
    {
      "time": "16 Oct 2006 — 8:17am",
      "content": "Ah yes ... completely forgot to actually MENTION it, sorry ... it is called 'Goldenbook' drawn by Mark Simonson\n\n"
    },
    {
      "time": "16 Oct 2006 — 10:05am",
      "content": "According to Mark's site, it was designed in 2003 based off the logo of The Golden Book Magazine from the 1920s. I don't know how old the Gucci logo is. Maybe Mark can shed some light on the subject.\n\n- Lex\n\n"
    },
    {
      "time": "17 Oct 2006 — 1:57am",
      "content": "I think it has certainly been revamped. Tom Ford presented his first Gucci Collection in 1995, also the Group went public that year and from there on the brand evolved as a global fashion brand. They certainly had some Art Director working on it to make it look more elegant and slicker. Here's a older logo.\n\n ![](http://web.archive.org/web/20150302015356im_/http:/typophile.com/files/Picture-4_6077.gif)\n\n"
    },
    {
      "time": "18 Oct 2006 — 6:35am",
      "content": "I'd like to add that I'm really happy to have found this font.\n\nWe once worked on a logo design for Yves Saint Laurent 'Cinema' perfume and lost the pitch to Art Director Thomas Lenthal who used Optima as proposed Logo. I fully understand why he had chosen Optima, it is very classical (so coherent with the clients brief who wanted to go for a 30's kind of glamour), slim and elegant, but only if seen from far, I think the Optima is dead ugly when you see it from close, it has those curvy lines which make it look kinda sloppy and of little formal value. Goldenbook would have delivered the same 30's galmour message but with much more typographic rigour.\n\n ![](http://web.archive.org/web/20150302015356im_/http:/typophile.com/files/Picture-3_4245.gif)\n\n"
    },
    {
      "time": "18 Oct 2006 — 7:20am",
      "content": "I totally agree. :^)\n\n"
    },
    {
      "time": "24 Oct 2007 — 2:00am",
      "content": "Could anyone send me this font or something as I am in need of it :(  \nand I'm not allowed to buy it :(.\n\n"
    },
    {
      "time": "24 Oct 2007 — 2:07am",
      "content": "No, we couldn't! If you want to use this font you'll have to buy it...\n\nBTW: Who is forbidding you to [pay $29 for this font](http://web.archive.org/web/20150302015356/http:/www.myfonts.com/fonts/marksimonson/goldenbook/) if I may ask?\n\n"
    },
    {
      "time": "3 Jan 2013 — 2:34am",
      "content": "Personally, I think they need to re model the [Gucci](http://web.archive.org/web/20150302015356/http:/www.topfashionshades.net/brands/gucci-sunglasses.html) logo, as many branded company name try to steal the Gucci rights.\n\n"
    }
  ]
}
