{
  "id": "28862",
  "title": "Agamemnon 27! Now with Greek, Cyrillic, and Cherokee",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "edit: For those of you joining the thread in progress, the most recent PDF files are at the bottom of the list of attached files in this starting post. They all have version numbers, in case you lose track. I'm keeping the earlier ones around for historical documentation of the project, but you should feel free to skip ahead to the most recent PDFs and come back to the old files at your leisure.  \n--JP, 4-18-07\n\nedit: This project has come a long way since I started sharing it with the community here. As it nears completion, at least in this weight and style, I need just a little more advice to turn that last corner. Eben Sorkin has been an immense help, far greater than I have a right to expect from any one person who I am not paying. The constructive advice of other experts (and I know you're hiding around here somewhere) would be greatly appreciated.  \n—JP, 2-14-07\n\n----------\n\nHere is yet another project I abandoned long ago. I'm trying to retrace my steps to how I created it and why I gave it that name. It looks more like a slightly circusy wood type with some modern attributes than anything Macedonian.\n\nIndeed, it needs a lot of work yet. My initial output is what Fontographer expells as an EPS of all characters, which for some reason breaks some of the points apart so I can't apply a fill without tediously fixing everything.\n\nI welcome any and all suggestions and comments, including on finding a new, more appropriately evocative name for the thing.\n\n| Attachment | Size |\n| --- | --- |\n| [Agamemnon-outl.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/Agamemnon-outl.pdf) | 53.92 KB |\n| [Agamemnon2-sample1.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/Agamemnon2-sample1.pdf) | 20.98 KB |\n| [agamemnon4-sample1.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon4-sample1.pdf) | 21.75 KB |\n| [agamemnon6-sample1.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon6-sample1.pdf) | 22.75 KB |\n| [agamemnon7-sample1.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon7-sample1.pdf) | 27.03 KB |\n| [agamemnon8-sample1.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon8-sample1.pdf) | 27.48 KB |\n| [agamemnon9-sample1.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon9-sample1.pdf) | 27.43 KB |\n| [agamemnon10-sample1.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon10-sample1.pdf) | 28.82 KB |\n| [Agamemnon10-layout test-c.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/Agamemnon10-layout%20test-c.pdf) | 78.54 KB |\n| [Agamemnon10-pangrams.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/Agamemnon10-pangrams.pdf) | 27.29 KB |\n| [agamemnon11-sample1.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon11-sample1.pdf) | 29.05 KB |\n| [Agamemnon11-pangrams.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/Agamemnon11-pangrams.pdf) | 28.68 KB |\n| [agamemnon12-allcharacters-2.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon12-allcharacters-2.pdf) | 41.38 KB |\n| [agamemnon12-pangrams2.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon12-pangrams2.pdf) | 28.38 KB |\n| [agamemnon13-allcharacters.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon13-allcharacters.pdf) | 41.75 KB |\n| [agamemnon13-pangrams.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon13-pangrams.pdf) | 28.76 KB |\n| [agamemnon13-randomtext.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon13-randomtext.pdf) | 18.02 KB |\n| [agamemnon14-allcharacters.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon14-allcharacters.pdf) | 41.88 KB |\n| [agamemnon14-pangrams.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon14-pangrams.pdf) | 28.76 KB |\n| [agamemnon14-randomtext.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon14-randomtext.pdf) | 17.91 KB |\n| [agamemnon15-pangrams.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon15-pangrams.pdf) | 29.01 KB |\n| [agamemnon15-allcharacters.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon15-allcharacters.pdf) | 42.01 KB |\n| [agamemnon15-randomtext.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon15-randomtext.pdf) | 18.07 KB |\n| [agamemnon16-allcharacters.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon16-allcharacters.pdf) | 43.18 KB |\n| [agamemnon16-pangrams.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon16-pangrams.pdf) | 29.9 KB |\n| [agamemnon16-randomtext.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon16-randomtext.pdf) | 18.01 KB |\n| [agamemnon20-newer.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/agamemnon20-newer.pdf) | 53.86 KB |\n| [pr-AgamemnonTwentyOne.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/pr-AgamemnonTwentyOne.pdf) | 131.4 KB |\n| [pr-AgamemnonTwentytwo-chrlst.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/pr-AgamemnonTwentytwo-chrlst.pdf) | 158.22 KB |\n| [pr-AgamemnonTwentytwo-12pt2.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/pr-AgamemnonTwentytwo-12pt2.pdf) | 151.61 KB |\n| [pr-AgamemnonTwentySeven-ffd1.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/pr-AgamemnonTwentySeven-ffd1.pdf) | 298.85 KB |\n| [pr-AgamemnonTwentySeven-dis1.pdf](http://web.archive.org/web/20150417085154/http:/typophile.com/files/pr-AgamemnonTwentySeven-dis1.pdf) | 348.33 KB |\n\n",
  "author": "cuttlefish",
  "time": "16 Oct 2006 — 4:16pm",
  "uid": "14556",
  "comments": [
    {
      "time": "17 Oct 2006 — 12:38pm",
      "content": "Here goes. I'll just give a running commentary as I scroll down the PDF.\n\n-The 'S' and 's' bug me. The contrast is really wonky.  \n-Why are some serifs flat, and others curved?  \n-'&' looks like an '8'  \n-I dig the ball terminal on the '4' and some other letters. I wonder if this could be incorporated into other characters.  \n-I think 'C' needs a spur.  \n-'G' doesn't really fit. The bottom is too thin, and it could use a spur also.  \n-'T' is off-putting. Maybe the curves on top should go the other way to better match the other characters.  \n-'k' looks very poorly constructed.  \n-The bottom of the 't' is cut off abruptly - it works though. Maybe introduce this into other letters as well.\n\nOverall, it's got a nice feel, but it's a little inconsistent. With some refinement and redrawing, this could be a very nice display face.\n\n- Lex\n\n"
    },
    {
      "time": "17 Oct 2006 — 2:39pm",
      "content": "Thank you much, Lex. I'll try using my more usual ways to display sam[les next time, and get right to work on your suggestions.  \nThat 'k' is quite wonky, I agree.\n\nHow do you envision these \"spurs\" on the 'C' and 'G'?\n\n"
    },
    {
      "time": "17 Oct 2006 — 9:17pm",
      "content": "Obsoive:\n\n ![](http://web.archive.org/web/20150417085154im_/http:/typophile.com/files/clarendonC_4357.png)\n\n- Lex\n\n"
    },
    {
      "time": "18 Oct 2006 — 3:02pm",
      "content": "I've addressed pretty much all the concerns you pointed out, and some others as well. The lc \"s\" still needs work, and I'm increasingly unhappy with the \"e\".\n\nLots of stuff left to do, but my progress is shown on the new PDF up top.\n\n"
    },
    {
      "time": "18 Oct 2006 — 3:36pm",
      "content": "Some observations:\n\nAX has wrong weight distribution (it's mirrored to usual ones).  \nB too big upper part.  \nCGOD bowls slightly to light compared to other stroke weight  \nJ strange  \nK upper arm too thick  \nS needs serifs  \nU not round enough\n\ne maybe 45° is too much for the bar  \nhmn uppermost parts of the bows are too much to the left. more tension!  \nr too wide, needs a foot serif  \ns too wide, needs serifs  \nx wrong weight distribution\n\n4 bar too high  \n69 no weight in the bowls?\n\nHave a look at other typefaces, don't copy them, but see why they work, how the weight is distributed, how the proportions are, etc.  \nAnd there's an error I tend to do as well: I do way too much special characters before the basic ones are settled. It multiplies the time needed for corrections...\n\nSebastian\n\n"
    },
    {
      "time": "18 Oct 2006 — 3:37pm",
      "content": "Wow, this posting sounds arrogant, I'm sorry for that... It's late and I have to go to bed, but I thought feedback in a few words is better than none.\n\n"
    },
    {
      "time": "19 Oct 2006 — 11:05am",
      "content": "Thanks, Sebastian. I'll get on to those fixes you suggest.  \n6 and 9 always give me trouble.\n\nThough sometimes I sketch out few letters, I tend to design my fonts in Fontographer from the beginning, usually starting with \"h\", \"V' and \"O\" then hashing out the basic forms by collaging components from them to the rest of the characters before fine tuning the shapes. This leads to all the mistakes you noted, but they'll eventually get worked out. It also makes it relatively easy to rapidly construct the special characters that, I agree, really would be better left for later.\n\nWhat do you think of my other projects here: Palormak and Cartmeign in this subforum, and Triangulor in the experimental section?\n\n"
    },
    {
      "time": "20 Oct 2006 — 3:25pm",
      "content": "I've made some more changes. There is still a lot of work to do, and a lot of little details even I notice are wrong. Still, this shows significant progress. New PDF up top and this here:\n\n ![](http://web.archive.org/web/20150417085154im_/http:/typophile.com/files/agamemnon4-sample2_4372.png)\n\n"
    },
    {
      "time": "20 Oct 2006 — 4:17pm",
      "content": "I don't think this face will ever be useful for setting text but as a display face it could be quite nice. I would encourage you to reconsider each character & see how you could make them differfently. I get the feeling that some of them were made based on others to a too great a degree. I think your 4 works well desite it's oddity. Your 5 and 2 as well. The two is a little unballanced. The 3 is struggling. Perhaps one arc should be bigger than the other or a historical form with an arbitary straight line should be used. The 8 too. It needs direction. Keep at it.\n\n"
    },
    {
      "time": "20 Oct 2006 — 7:27pm",
      "content": "The general feel I get from the caps reminds me of precast letters I used to use in customizing leather belts, actually -- the serifs have a real \"western\" zeitgeist to them, particularly the \"L\".\n\nI agree with Eben that it would make an interesting display face.\n\nLinda\n\n"
    },
    {
      "time": "25 Oct 2006 — 4:07pm",
      "content": "Damn, I just had a big long reply and I accidentally hit a bookmark and my browser ate it.\n\nI'll be back once I recover from the shock.\n\n"
    },
    {
      "time": "25 Oct 2006 — 5:14pm",
      "content": "Good.\n\n"
    },
    {
      "time": "30 Nov 2006 — 5:11pm",
      "content": " ![](http://web.archive.org/web/20150417085154im_/http:/typophile.com/files/agamemnon6-sample2_6599.png)\n\nOK, it's been a while, but here I am with another go at it (again with a PDF #6 for closer inspection).\n\nThere are a lot of changes here, some obvious, some subtle. Try and find them all!\n\nMaybe I'll change the name of the font to \"Corinthian Leather\" unless Chrysler still holds that trademark.\n\n"
    },
    {
      "time": "8 Dec 2006 — 10:46pm",
      "content": "It looks like it's gelling up better. Still here is what I am thinking:\n\n- The Cap X looks like it needs to pee.  \n- I think that if you look at some wood type you would find a model for putting the detail & charcater you have across without compromising the face quite so much. In particular, I am thinking that the serif wiggle you have in some glyphs like cap E seem just right whereas the lc m seems like a victim of imposed rules. I would start making some exceptions & let the m off. Some of the Serifs seem to be hiding out. They make their glyph look like a wall flower. wheras the 2 seems at ease with itself and the 5 is qite outgoing. The 4 is not keeping up. It's just too many excentric details in one glyph - 4 of them! Help that 9! Above all I would ask myself - what gets better with the wiggle? What gets worse?\n\nI hope you keep going! I still like the excentricity overall and I think it could become surprisingly readable. I really like the 'e'. Make the others play nice with it.\n\n"
    },
    {
      "time": "9 Dec 2006 — 1:10pm",
      "content": "The 9 does look like it belongs in another font entirely, doesn't it? I was experimenting with things and it just seemed to work for me like this. How would you suggest I change it? I don't want it to end up merely as a rotated 6 (I'm still not happy with the 6).\n\nI am working on something new for the 4. I've eliminated the curve on the diagonal and flattened the horizontal crossbar a bit. That will be up with the next installment\n\nAbout the wiggles, I find a certain amount of this enhances readability. I'm not sure it's having that effect here, but in my earlier font [Gohan](http://web.archive.org/web/20150417085154/http:/www.1001fonts.com/font_details.html?font_id=2205), the vertical wiggle almost makes it suitable as a microfont, in spite of its heavy weight and rounded shapes. Of course there are some details on that which need further refinement too. That font has a pretty odd 4 too.\n\n"
    },
    {
      "time": "9 Dec 2006 — 1:37pm",
      "content": "Definitely take my suggestion with a grain of salt ( or more ) my assumptions about what you want the font to do may not be correct. What if the overall shape of the 6 was more like the 9 ( digonal-ish) but it was tapered or had a small teardop.\n\nNot quite like this but\n\n[http://www.dwr.com/images/thumbnails/tn\\_9774.gif](http://web.archive.org/web/20150417085154/http:/www.dwr.com/images/thumbnails/tn_9774.gif \"http://www.dwr.com/images/thumbnails/tn\\_9774.gif\")\n\nActually. I am noticing now that you have an re-opening taper on the 2, A huge one on the Ampersand, a ball on the 4, r & g, x z, and then there is the finish on the s. Anyway. I don't think you shouyld be doctrinare about this but looking at finnishing strokes I am seeing more variety than is maybe ideal.\n\nAlso, looking at the xyz I seem to see 3 different ideas about how to manage diagonal widths. The y suggesdt that stroke variation will be low. The x suggests it will be high. The z is quite light. Looking at the e and g, both of which seem right for some reason, I think I see the weight I would have the xy&z adopt.\n\nI am looking foreward to seeing the new 4. I agree that the wiggles add to the face in general. Did what I was saying about woodtype make any sense to you?\n\n"
    },
    {
      "time": "9 Dec 2006 — 1:54pm",
      "content": "I'll have to do a bit more research on the woodtype, but I think I understand what you're getting at.\n\n"
    },
    {
      "time": "13 Dec 2006 — 10:22pm",
      "content": "I'm about ready to post another revision sample, but I'm becoming bored with my presentation. Should I keep it the same for the sake of consistency in comparison, or what, if any, other direction could I go in?\n\n"
    },
    {
      "time": "14 Dec 2006 — 3:00am",
      "content": "Keep the 1st page the same for the sake of continuity & then use 2nd 3rd (etc) pages to show us how you think the face might be used to best advantage or to exhibit new questions, problems, alternatives or features.\n\n"
    },
    {
      "time": "14 Dec 2006 — 4:30pm",
      "content": "OK. Here's what I've been promising:\n\n ![](http://web.archive.org/web/20150417085154im_/http:/typophile.com/files/agamemnon7-sample2_5560.png)\n\nLots of changes here, including a whole new teapot a, Q, accented characters, a new 4 and 6, a bunch of changes to misc. symbols, modified x, y, &,\\*, °, and more.\n\nMuch work still to do with the spacing.\n\nPDF 7 up top.\n\n"
    },
    {
      "time": "14 Dec 2006 — 10:05pm",
      "content": " ![](http://web.archive.org/web/20150417085154im_/http:/typophile.com/files/agamemnon7-hawkmoth_4266.jpg)\n\nQuick and dirty, just to see what it looks like in different colors.  \nWithout an idea in my head.\n\n"
    },
    {
      "time": "14 Dec 2006 — 10:20pm",
      "content": "Very Amusing!\n\nabout the changes - I like the increased consistancy but the stroke contrast in the digonals seems a bit harsh. Especially on the y & cap V. I like the new six but I wonder if it wouldn't be better flipped for a new 9. What if the 6 had a longer ascending arm? I think you need to give the Q's bottom stoke a bit more weight to carry it off. But it's a fun idea.The e has to gain some weight to match or the others have to loose a little.\n\n"
    },
    {
      "time": "15 Dec 2006 — 5:56pm",
      "content": "Yeah, it looks like I got the contrast on the y backwards too.\n\nIt occurs to me that many of the caps are too narrow. They look all condensed while the lc looks all fat, even though the stroke widths are nearly the same. Also the O isn't obviously different from the zero. Handling this problem would mean quite an overhaul, though. Any idea how I should go about that?\n\nThere is something about the 9 that I really like. I know you keep telling me to change it, and I agree it is a bit strange, but it works for me.\n\nWhat do you think of the new 4?\n\nThe 3 does have an odd finish, but that's meant to make for a good \\<3 emoticon.\n\n"
    },
    {
      "time": "16 Dec 2006 — 12:48pm",
      "content": "I love the italic <cite>g</cite> from Galliard, but I wouldn't put it in my Cyril. Just because a glyph is good doesn't mean it fits. The 9 is interesting, but I don't think it works here. I also question the motive behind the 3: to make a good emoticon? Which will people use more often: the 3 or the emoticon? If you really want to be able to have a good heart, just draw a picture of one and stick it somewhere in the font.  \nIf something looks wrong, don't hesitate to fix it, even if it does mean \"quite an overhaul\". In your case, it actually won't take a whole lot to just widen the caps that need widening, like OGHCDB. Make them all look consistent with each other. Giving them similar amounts of white space is a good place to start. (This feels a bit weird, because I can remember when I was on the other end of this exact same critique with [Cyril](http://web.archive.org/web/20150417085154/http:/typophile.com/node/12860). In my case, the font was totally not what I had meant to draw the first time, so I redrew it, but I don't think that's really necessary here.) The new 4 strikes me as better, but I think I prefer the old 6. The 1 needs more character.\n\n"
    },
    {
      "time": "19 Dec 2006 — 9:50am",
      "content": "So I've fixed most of the things that have been brought up so far. With all the things I've done to unify the font, it seems I've neglected the punctuation somewhat. It's all very square and seems undersized to me, but I could be wrong. Also my accents acute and grave are awfully steep. I don't use them extensively in my language, but does that bother anyone who does?\n\n"
    },
    {
      "time": "19 Dec 2006 — 11:27am",
      "content": "The font is on the whole juicy. It seems like the punctuation should be too. The dots on the i & j seem over weight to me ( slightly ). Also the Caps now that they are wide enough seem to need some air. Maybe add a bit to the sidebearings. Look at all those Es. Also I thought I should metion that something is going wrong with the encoding such that some glyphs don't display when I open the PDF. Like 3-4 I think... I can tell you which ones later. But in the meantime what encoding are you using & why?\n\n"
    },
    {
      "time": "19 Dec 2006 — 11:27am",
      "content": " ![](http://web.archive.org/web/20150417085154im_/http:/typophile.com/files/agamemnon8-sample2_4193.png)\n  \nHere is the next iteration. changes here to the 1, 3, 6, 9, \\*, µ, B, C, D, E, F, G, H, L, M, O, Ø, Œ, P, Q, R, S, U, V, x, y, and probably some others I've forgotten. Widening the vowels screwed up the spacing on their accented counterparts, so I'm working on repairing that now.\n\nI think I did a bad thing to the B. Back to the drawing board on that one.\n\nThis relates to PDF 8 in the first post.\n\n"
    },
    {
      "time": "19 Dec 2006 — 11:33am",
      "content": "BTW I like the new 3 6 & 9. I guess my comments about the caps were about the acccented caps! The others seem good I think.\n\n"
    },
    {
      "time": "19 Dec 2006 — 11:37am",
      "content": "I'm using default settings for Macintosh encoding in Mac TrueType format from Fontographer 4.1.5 NFPU.\n\nI did get a report of some sort of encoding error when I viewed the PDF, but I didn't notice anything missing from the displayed characters.\n\nedit: Upon further review I do notice a couple missing characters on the bottom line. I'm doing my PDF output with Canvas 8, if that makes any difference. Hey, I'm broke, and I got it for the cost of a magazine, and it does the job, more or less.\n\n"
    },
    {
      "time": "19 Dec 2006 — 4:31pm",
      "content": "I'm not trying to give you a hard time. Just letting you know what happens. Cheers!\n\n"
    },
    {
      "time": "19 Dec 2006 — 4:47pm",
      "content": "Oh, I know... Just hoping you knew how to fix it.\n\n"
    },
    {
      "time": "19 Dec 2006 — 5:12pm",
      "content": "Hmm I would post a new topic about the missing glyphs here on typophile. That will be the best way I think.\n\n"
    },
    {
      "time": "22 Dec 2006 — 6:13pm",
      "content": " ![](http://web.archive.org/web/20150417085154im_/http:/typophile.com/files/agamemnon9-sample2_6718.png)\n\nThe most significant changes this time around are the punctuation and accents. All that was square is round now.\n\nAlso, B, f, fi, fl, and Florin have changed.\n\nOhm and Delta are the characters not showing in the PDF, resulting in the error message. I haven't a clue why yet. Version 9 is up top, and it works but for those two. I just need to figure out how to get the rest of the characters in there. Canvas 8 doesn't have the character pallette to input them with.\n\n"
    },
    {
      "time": "31 Dec 2006 — 2:36pm",
      "content": "Since I have the file open right now, is there anything more I can do to improve this?\n\n"
    },
    {
      "time": "1 Jan 2007 — 2:57pm",
      "content": "Here are some ideas to keep you busy: Pull the nose of the 2 in slightly. ( Maybe) Give it more overshoot on top. The tops of the eights & nines seem to thick maybe. The left side of the 7 seems to light/weak. The curve on the lc k could be more weighty/exuberant. I can't find a way to love the flat r - why not lower the join of the n & m & make an r that matches? Why not throw in the p while your at it? ( it might be better like the b) What about a loop at the beginning of the Q's tail instead of a reverse. That might be more 'ballsy'. heh heh ( rolling of eyes obligatory ). But more meaninfully it would create a more 'even' feeling in the weights. The Q is too light now. In the case of your font I think a flat side to the inside of the O in OE might be better. Why does the l & t drop their bottom? I am not diggin' it. How does that go with the rest? I like the lc v but the lc w & y still don't quite sing to me. The left bottom of the lc z needs more weight somehow. It feels lopsided. The ae seems too wide & lumpy to me. The UC W could be wider. Why not? It's such an exumberant face in general why not give it some room? What about dropping the Join on the UC Y? It seems a bit cramped with those big serifs. I would add mnore weight back to the CAp S in the middle. I don't lknow if the UC T needs to be quite so wide. The N needs some air & width ( a bit ) - The C needs more space & a more gracelful left curve. The G too. Even more, actually. The serif on the UC M makes it look like it's sad. Your best glyphs have a a hardy readdy to do anything feeling about them. The UC A has it. TheB,R,g,s,o & V too. Get that spirit in the rest. The $ is not wide enogh at the bese especially the left side. British Pound sign - same thing.\n\n"
    },
    {
      "time": "2 Jan 2007 — 4:25pm",
      "content": "Eben, I agree with most of your suggestions, though I'm not sure how to efectively implement them all, with the exception of the lc r.\n\nI have a specific reason for not making the r similar to the m and n, which I go into [here.](http://web.archive.org/web/20150417085154/http:/typophile.com/node/28380/) I may still try lowering the joins on m and n, but we'll have to think a bit more before doing anything drastic with the r.\n\n"
    },
    {
      "time": "2 Jan 2007 — 7:32pm",
      "content": "Perhaps raise it slightly higher then. That has historical precedent actually. And in the end it's your eyes that count. Cheers!\n\n"
    },
    {
      "time": "2 Jan 2007 — 7:51pm",
      "content": "Nice looking font, very consistent shapes all through the design.  \nOnly things I see right now are:  \nThe indent on the leg of the cap R, it catches the eye, since only that char and the lc 'k' have it. Not that it looks bad, but it sticks out a bit maybe.  \nAnd the circumflex, which is a bit square / pointed and straight-lined, compared to the other characters. If you know what I mean.\n\n"
    },
    {
      "time": "2 Jan 2007 — 8:32pm",
      "content": "Do you mean the ASCII circumflex or the combining diacritical circumflex? They're very and deliberately different.\n\n"
    },
    {
      "time": "3 Jan 2007 — 4:09pm",
      "content": "Both, but mostly the ê, â, etc.  \nIf you deliberately made then different, you obviously thought about it, so then it's fine. :)\n\n"
    },
    {
      "time": "3 Jan 2007 — 7:48pm",
      "content": "Does the accent acute look all lumpy compared to the accent grave, or is it just my monitor? I saw some odd curves on the asterisk too. Anybody else catch anything?\n\n"
    },
    {
      "time": "4 Jan 2007 — 9:10am",
      "content": "Yes, checking pdf no.9 I see that too. The acute has a couple of 'corners' in it, on the left curve, not a smooth line. The asterisk as well.\n\n"
    },
    {
      "time": "4 Jan 2007 — 11:34am",
      "content": "I can't explain why that is happening. These flaws do not appear in Fontographer, but I see them in the PDF just as you do. The acute is a simple H-flip of the grave, and the asterisk points are rotated copies of the top one. I suspect some artifact crept in there when I added points at extrema and aligned points to grid, and possibly even in the output to TrueType, but I think it is more likely a flaw in Acrobat rendering. I'm also noticing a vertical stretch overall in the PDF compared to how the forms appear in my graphics programs.\n\n"
    },
    {
      "time": "4 Jan 2007 — 4:19pm",
      "content": "Florin isn't working, x still has reversed stress, counter of a should be more symmetrical I think, and W's usually have the thicker diagonal continued all the way to the top. Serifs of s have no relation to other letters (consider making them like c, ß, or S), and ß has wrong stress: on the bottom it should be like s, and on the top, the outward-facing curve should have it, not the in-pointing one (viz. [Sabon](http://web.archive.org/web/20150417085154/http:/www.myfonts.com/fonts/linotype/sabon/roman-oldstyle-figures/win-t1/19867/character/00DF/CP2/1)). Z too light, WwX too heavy. Corner at bottom of inner curve of J no good. M too wide. Cedilla not bold enough at parts. 9 needs a corner at the terminal, not curves. © way bolder than ®. \"<cite>n</cite>-ary product\" sign comes below baseline. Ah, revising: so much fun, no? Keep fighting the good fight.\n\n"
    },
    {
      "time": "4 Jan 2007 — 4:36pm",
      "content": "I have had similar weird glitches when I export to TrueType. I usually make and export it in otf. But I'm not too experienced as a type designer. But TTF-curves are weird, heh.  \nWhat program did you use to set the type in, and export to PDF?\n\n"
    },
    {
      "time": "4 Jan 2007 — 5:07pm",
      "content": "Both the PNG images and the PDF files are generated with Canvas 8. I suppose I could use my ancient copy of Illustrator in Classic mode, but that would mean installing the fonts in the old system folder, and well, now that i think of it it's not too big a bother, but I don't want to bother.\n\nFor some reason Fog's export to PS1 fonts is glitchy (which is why I'm making as TrueType. OTF isn't even an option), at least when i comes to installing them-- the space gets all stretched out, but returns to normal after purging caches with Linotype Font Explorer. I'm not sure exacly where the problem lies, apart from the fact that I need a new compuer and software updates and I can't afford any of it right now.\n\nOnce I get it done, I might try making a PS font from Fontographer then converting that to OTF with FontForge, but I don't want to geet ahead of myself just yet.\n\n"
    },
    {
      "time": "4 Jan 2007 — 6:35pm",
      "content": "Try renaming your font for the purposes of checking. I had Font Explorer seemingly cacheing some of my old data. It didn't go away util I changed the font's name. There is probably another work around but that's the one that worked for me. You should also be aware that FOG doesn't work in whole numbers. It uses fractions. So when you export to TT at 1000 UPM some numebers may round up or down on you producing results that may not be expected. You have come pretty far with this. Why not go the extra mile? Also, re-reading the thread I started to wonder what you meant by <cite>I’m not sure how to efectively implement them all.</cite> What upm are you working in?\n\n"
    },
    {
      "time": "4 Jan 2007 — 7:00pm",
      "content": "Just that it might take more than the moment I used to write the response to come up with solutions to the problems you pointed out. (And likewise for some of Nathanael's comments.)\n\n7, k, w, y, C, G, and M you made somewhat perplexing comments on. The words themselves are not but figuring out how to make them happen is. I've already made a bunch of changes and will try some more before I make another test image.\n\n"
    },
    {
      "time": "6 Jan 2007 — 12:36pm",
      "content": "My em square is 1024 UPM.\n\n"
    },
    {
      "time": "6 Jan 2007 — 12:44pm",
      "content": "<cite>“n-ary product” sign comes below baseline.</cite>\n\nUm... pardon my ignorance, but which character is that?\n\n"
    }
  ]
}
