{
  "id": "28889",
  "title": "Lupe Fiasco Fontstyle",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "So, I have been seeing more and more of Arabic style lettering to created western Roman characters. Here is one sample I found to be quite nice. I am wondering if this is a custom font, or one completely done custom?\n\n| Attachment | Size |\n| --- | --- |\n| [lupe.jpg](http://web.archive.org/web/20141008164158/http:/typophile.com/files/lupe.jpg) | 4.01 KB |\n\n",
  "author": "msalfiti",
  "time": "17 Oct 2006 — 5:59pm",
  "uid": "5542",
  "comments": [
    {
      "time": "18 Oct 2006 — 8:30am",
      "content": "There are some fonts that imitate Arabic, but so far I haven't found an exact match. [Catharsis Bedouin](http://web.archive.org/web/20141008164158/http:/www.dafont.com/catharsis-bedouin.font?nb_ppp=20&text=Lupe+Fiasco) is one that's free. Linotype has one called [Pide Nashi](http://web.archive.org/web/20141008164158/http:/www.myfonts.com/fonts/linotype/pide-nashi/) that also has a similar feel, and I think Scriptorium also has several faux Arabic fonts, with [Serendib](http://web.archive.org/web/20141008164158/http:/www.myfonts.com/fonts/scriptorium/serendib/) as the closest style in their collection to your sample.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "18 Oct 2006 — 10:35am",
      "content": "chuck (nopattern, the designer of the cover) has once posted on a closed forum that the type was given to him by the label, so the chance of it being custom is there i'd say. writing him an email would maybe give you more information than waiting for an answer here.\n\n"
    },
    {
      "time": "18 Oct 2006 — 12:15pm",
      "content": "Funny I just went thru an exhaustive search for a roman font with an arabic feel - ended up using ITC Braganza which is a little less kitsch than the samples above but still has a calligraphic flair.\n\n"
    },
    {
      "time": "18 Oct 2006 — 5:46pm",
      "content": "well apparently, when you go to the nopattern website... you will see that the cover art and type was created by rostarr... [http://www.rostarr.com/](http://web.archive.org/web/20141008164158/http:/www.rostarr.com/ \"http://www.rostarr.com/\") who is an amazing artist. He recently had a showing with the Black Market Gallery and much of his work is Asian/Arabic calligraphy infused... thanks for the head's up!\n\n"
    }
  ]
}
