{
  "id": "28886",
  "title": "NEW! Type ID Pop Quiz V2.1.1 - Entry Level",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "This is how it works:\n\n- A couple of words are published in the Type ID Pop Quiz, possibly — but not necessarily — providing a hint.\n- Try to identify the typeface. To win, you need to **e-mail me both the correct name and weight. Do not reply in the thread itself to allow other enthusiasts to participate.**\n- Show off your knowledge by casually mentioning additional trivia, like who designed it, when and by whom was it (first) published, and other cool stuff to impress your fellow Typophiles with.\n- Every week a new challenge will be posted.\n\nIn case of any disputes, I will act as judge, jury and avenging angel of wrath.\n\nIf you think this is too easy, maybe try the [Intermediary Level Type ID Pop Quiz](http://web.archive.org/web/20080906233431/http:/typophile.com/node/28884) or [Expert Level Type ID Pop Quiz](http://web.archive.org/web/20080906233431/http:/typophile.com/node/29031).\n\nGood luck everyone, and have fun. ;^)\n\n_With respectful thanks to the originator of this utterly useless but highly entertaining waste of time, the often imitated but never duplicated Cheshire Dave._\n\n [‹ (x) Vipp superellips sans - Vipp (custom face) {Marten Fischer}](http://web.archive.org/web/20080906233431/http:/www.typophile.com/node/31293 \"Go to previous forum topic\") [Font Help Please! ›](http://web.archive.org/web/20080906233431/http:/www.typophile.com/node/31412 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906233431/http://www.typophile.com/user/110\" title=\"View user profile.\">Bald Condensed</a>",
  "time": "<br>",
  "uid": "110",
  "comments": [
    {
      "time": " 17.Oct.2006 2.21pm",
      "content": "We’re back in action! New challenge. As usual, no replying within the thread, but e-mail me the solution through my profile.\n\n ![](http://web.archive.org/web/20080906233431im_/http:/www.typophile.com/files/International_Shipment_5493.png)\n\nPreviously on the Type ID Pop Quiz...  \n [NEW! Type ID Pop Quiz V2.1 - Entry Level](http://web.archive.org/web/20080906233431/http:/typophile.com/node/27995)\n\n"
    },
    {
      "time": " 18.Oct.2006 12.15am",
      "content": "Correct answers:\n\nDax Rowling | Kate McDonnell | Eric Buckley | Manlio Napoli | Thierry Blancpain | Elliot Merrony | Frank Schnappenberger\n\n"
    },
    {
      "time": " 23.Oct.2006 4.36am",
      "content": "Anybody still wants to play, now’s the time! New challenge coming up. ;^)\n\n"
    },
    {
      "time": " 23.Oct.2006 1.39pm",
      "content": "You will all notice that I changed back the name from the first person who identified the Type ID Pop Quiz. Winston is the alias of — ta-daaah — Dax Rowling! Coincidence? I think not. :^)\n\nThis is Elliot’s reply:  \n_“FF Dax Regular — the clue alluded to its use by UPS in modified form.”_\n\n"
    },
    {
      "time": " 23.Oct.2006 1.44pm",
      "content": "Lemmecheck if I have a new challenge lying about...\n\nWhat about this one? As usual, e-mail me the solution through my profile.\n\n ![](http://web.archive.org/web/20080906233431im_/http:/www.typophile.com/files/Uncharted_3472.png)\n\n"
    },
    {
      "time": " 26.Oct.2006 1.58am",
      "content": "I didn’t receive any answer yet. Is this one too difficult? If you want to I can give a hint.\n\n"
    },
    {
      "time": " 26.Oct.2006 2.35am",
      "content": "OK Here’s a hint:\n\nThis popular typeface, inspired by ancient maps, was released in early 2005 by an independent Swedish foundry and is also available through both Veer and FontShop.\n\nA striking feature of the italics are the four swash variations. Their names come from the Latin terms for the points of a compass, and indicate the general orientation of the swashes on the capitals.\n\n"
    },
    {
      "time": " 26.Oct.2006 4.32am",
      "content": "Correct answers:\n\nMili Carr | Frank Schnappenberger | Stuart Marks\n\n"
    },
    {
      "time": " 1.Nov.2006 10.54am",
      "content": "Is there a new challenge coming up? I need my weekly drug ;)\n\n"
    },
    {
      "time": " 2.Nov.2006 6.48am",
      "content": "Typophile has been behaving very strangely the past few days — “glacially slow” doesn’t even begin to describe the speed at which new pages appear in my browser.\n\nThe new challenge is ready but I need to be able to upload it. It doesn’t really matter that you’ll have less time as it’s a very easy one.\n\n"
    },
    {
      "time": " 2.Nov.2006 11.52am",
      "content": "OK Looks like things are a bit more reliable. Here’s the solution along with a great little story, courtesy of Stuart Marks:\n\n_“Here be dragons! This is Incognito Italic from Fountain Type. The U is from Incognito Occidens, the d is an alternate swash version, and the T is from Incognito Oriens. This was a tough one; I wouldn’t have gotten it without your massive hints._ [Actually nobody did; maybe this one was bit too difficult]\n\n_By the way, lore has it that “Here Be Dragons” (Latin, HC SVNT DRACONES) is printed at the edges of old maps. According to [this site](http://web.archive.org/web/20080906233431/http:/www.maphist.nl/extra/herebedragons.html) there is only one documented instance of this, on the Lenox Globe in the New York Public Library. For some reason, a lot of people (including me) think that “Here be dragons” is printed on lots of old maps, but apparently it’s just this one.”_\n\n"
    },
    {
      "time": " 2.Nov.2006 11.55am",
      "content": "Next challeeeeeeeenge!\n\nI want at least TEN submissions for this one, so _do NOT disappoint me!_ As usual, e-mail, no comments please. :^)\n\n ![](http://web.archive.org/web/20080906233431im_/http:/www.typophile.com/files/Maximum-Weight_6321.gif)\n\n"
    },
    {
      "time": " 2.Nov.2006 1.11pm",
      "content": "That’s more like it. :^) Correct answers so far:\n\nMili Carr | Stephen Lording | Frank Schnappenberger | Yussef Cole | Stuart Marks\n\n"
    },
    {
      "time": " 2.Nov.2006 2.35pm",
      "content": "\\> I want at least TEN submissions for this one...\n\nok. 10 — on the way :)\n\nBTW, this one too difficult.\n\n"
    },
    {
      "time": " 3.Nov.2006 12.13am",
      "content": "I meant correct answers, David. ;^)\n\n"
    },
    {
      "time": " 6.Nov.2006 2.58pm",
      "content": "3 correct answers is all I get? :^( It’s time for a new challenge soon, so don’t procrastinate!\n\n"
    },
    {
      "time": " 6.Nov.2006 6.17pm",
      "content": "I could send you a correct answer if it would make you feel better, Yves.\n\n- Lex\n\n"
    },
    {
      "time": " 7.Nov.2006 12.07am",
      "content": "I could send a correct answer too but I think I’m supposed to sit out this round.\n\n"
    },
    {
      "time": " 7.Nov.2006 12.33am",
      "content": "Oy!!! I forgot to remove the “The person who wins a game can’t win the next game.” rule! It only applies to the Expert and intermediate level quizes, not here. :^/\n\nARGH! Stoopid me!\n\n"
    },
    {
      "time": " 7.Nov.2006 8.16pm",
      "content": "OK, I’ll go ahead and submit an answer.\n\n"
    },
    {
      "time": " 13.Nov.2006 2.57pm",
      "content": "Oy!!! I’m really slipping here. :^/ Great answer from Stephen Lording, which mirrors my own sentiments:\n\n_“Oh yay! Eurostile! Extended #2, to be exact. The first typeface I ever learned the name of! (Other than those standard default fonts that EVERYONE (even my Mum) knows). I came across Eurostile as a first year design student, and I loved its big shapes, its rounded corners, and its stylish feel. As have many, many, many... many others, as I soon discovered, and gradually it came to feel too common and plain. Which is a shame, but which I guess is a phenomonen common to many wonderful type designs. We all love it, we all use it, we all get annoyed that we all use it, so we all dump it.  \nOh, and designed by Aldo Novarese (ITC Fenice, ITC Novarese), in 1962, as a more complete version of his earlier Microgramma (1952).”_\n\nI purchased a license for [House Gothic 23](http://web.archive.org/web/20080906233431/http:/www.houseind.com/index.php?page=showfont&id=15&subpage=viewfonts) to replace it, and I lamented the limited number of weights, because it is one - kickin’ - face, especially the text version. [Foundry Monoline](http://web.archive.org/web/20080906233431/http:/www.foundrytypes.co.uk/foundry_monoline/monoline.html) on the other hand is a rather spineless design.\n\n"
    },
    {
      "time": " 13.Nov.2006 2.58pm",
      "content": "New challenge! You know the drill. :^)\n\n ![](http://web.archive.org/web/20080906233431im_/http:/www.typophile.com/files/Machiavelli_4213.png)\n\nPeople keeping track of what is identified here will know the answer straight away.\n\n"
    },
    {
      "time": " 13.Nov.2006 4.10pm",
      "content": "Oh oh oh I know this one!! :^P (runs away laughing maniacally.)\n\n"
    },
    {
      "time": " 14.Nov.2006 5.17am",
      "content": "Correct answers so far:\n\nMili Carr | (and possibly Tiff, but we won’t know until the nurses manage to grab her and put that straightjacket back on :^P ) \\*\\*UPDATE\\*\\* Tiffany Wardle (who is now back in her padded cell, thankfully) | Elliot Merrony (did find it after all ;^) ) | Stephen Lording (again with a thoroughly researched answer) | Bert Vanderveen (who removed his answer from this thread _just in time_ or I would’ve had to whup his a$$ :^P ) | Karen Huang | Thierry Blancpain\n\n"
    },
    {
      "time": " 16.Nov.2006 8.32am",
      "content": "[just adding myself to this thread in order to track it]\n\nFrustratingly i know a near match, but it’s not quite right... oh hang on...\n\n"
    },
    {
      "time": " 20.Nov.2006 3.31am",
      "content": "(Sorry, didnt read the rules...)\n\n"
    },
    {
      "time": " 1.Feb.2007 5.09am",
      "content": "So what’s the outcome?\n\n"
    },
    {
      "time": " 2.Feb.2007 5.37am",
      "content": "Oy! Forgot all about the Type ID Pop Quizzes! :^[\n\nI’ll get to it this evening. Sorry’boutthat... :^(\n\n"
    },
    {
      "time": " 10.Feb.2007 9.24am",
      "content": "fiolosofia?\n\n"
    },
    {
      "time": " 11.Feb.2007 1.59pm",
      "content": "OK I’m restarting all three Type ID pop Quizzes. Brace yourselves. :^P\n\nFrom Karen Huang’s answer:  \n_(...) It’s Filosofia Unicase by Zuzana Licko (1996). What sets Filosofia apart from other cuts of Bodoni is the rounded endings on the otherwise straight serifs (probably visible only at larger points), which Licko says “often appeared in printed samples of Bodoni’s work and reflect Bodoni’s origins in letterpress technology.”_\n\nNew challenge in the new thread. ;^)\n\n"
    },
    {
      "time": " 14.Feb.2007 3.55am",
      "content": "In her [’Design Info’ for Filosofia](http://web.archive.org/web/20080906233431/http:/www.emigre.com/EFfeature.php?di=97) on the Emigre website, Licko includes this great quote from Bodoni from the preface of his “Manuale Tipografico”:\n\n<cite>“It is proper here to offer the four different heads under which it seems to me are derived the beauties of type, and the first to these is regularity - conformity without ambiguity, variety without dissonance, and equality and symmetry without confusion.”</cite>\n\nIt reminded me of a quote by Hermann Zapf where he describes looking over the first print sample for a new typeface:\n\n<cite>[the letterforms] seem either pure, graceful, true of image, quite as [I] conceived them; or knavishly grinning, awry, as if out of insolence ready to fall on their faces, or too gaily hop-dancing on the line, wilful, unregarding of their neighbours; still others are unduly fat or plump or again too spidery, too meagre and wretched in expression. Others on the contrary have bumps on their curves, lame arches, lack tension or expression on the line.</cite>\n\nAs someone still in the shallows of my love for type, I find these two quotes most helpful for understanding the way (a way?) by which you can appraise and appreciate the value of a typeface.\n\n"
    }
  ]
}
