{
  "id": "28882",
  "title": "Bike Rx logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I'm creating a logo for a bike shop named Bike Rx. I've been using various pharmaceutical images and have somewhat settled with the pill. I've used mostly Helvetica for the text because of its presence on many prescription bottles and medications. I plan to use the theme throughout the store with mock prescription forms for price tags and prescription bottles for business cards. The logo is what I'm having trouble with. Here are some examples.\n\nThanks for the feedback\n\n ![](http://web.archive.org/web/20131020055636im_/http:/typophile.com/files/Logospillvariations_6038.jpg)\n\n",
  "author": "pmd220",
  "time": "17 Oct 2006 — 1:23pm",
  "uid": "10586",
  "comments": [
    {
      "time": "17 Oct 2006 — 1:55pm",
      "content": "I like 12, but I would split the pill between \"bike\" and \"RX\", and increase the contrast between the 2 reds. The outline should probably be the darker red.\n\n"
    },
    {
      "time": "17 Oct 2006 — 2:28pm",
      "content": "I agree with splitting the pill between bike and Rx but it creates some spacing issues. the center of the pill has to be moved too much.\n\n ![](http://web.archive.org/web/20131020055636im_/http:/typophile.com/files/Splitpill_6455.jpg)\n\n"
    },
    {
      "time": "17 Oct 2006 — 9:14pm",
      "content": "You don't have to centre the text within the pill - try option 3 from your last post but make the right side of the pill a little wider (not too wide or else you get a sausage!) Even if the line isn't in the exact centre of the pill, it'll probably look OK optically. Or maybe not.\n\n- Lex\n\n"
    },
    {
      "time": "18 Oct 2006 — 10:28am",
      "content": "You can bring the right edge of the pill in, closer to \"RX\" on all these. There is too much air there. Also, maybe break the 2 reds with a white line as well? Of these 3, I think 1 is the closest.\n\n"
    },
    {
      "time": "18 Oct 2006 — 10:30am",
      "content": "I wonder if there's a way to incorporate a bike into the logo.\n\n- Lex\n\n"
    },
    {
      "time": "18 Oct 2006 — 10:42am",
      "content": "Brought the right side of the pill in and put in the white line as well. I'm thinking maybe of using a less vertical \"Rx\" in order to take up more space and balance out the spacing.\n\n ![](http://web.archive.org/web/20131020055636im_/http:/typophile.com/files/whiteline_4484.jpg)\n\n"
    },
    {
      "time": "18 Oct 2006 — 11:21am",
      "content": "Allright, I'm stripping this thing down to resolve the spacing issues. If I create a thicker outline of the pill I reduce the space for the \"Rx\" to occupy. What do you think? thanks for the help.\n\n ![](http://web.archive.org/web/20131020055636im_/http:/typophile.com/files/alternateoutline_5512.jpg)\n\n"
    },
    {
      "time": "18 Oct 2006 — 1:14pm",
      "content": "These are looking very nice. I like the first two better than the last two - the weight of the outline matches the weight of the text better.\n\nOther than the colour, what is the difference between the first two? Is there something subtle that I'm missing?\n\n- Lex\n\n"
    },
    {
      "time": "18 Oct 2006 — 1:16pm",
      "content": "Just the color is different. Would you stick with the same type for \"Rx\" or something with more width to it?\n\n"
    }
  ]
}
