{
  "id": "28890",
  "title": "The 212 Lounge",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Just wanted to post some computer designs of two directions for a Private Lounge being deeveloped. Its called “212 Lounge”. Upscale, wealthy bay area neighbourhood, modern yet classically touched.\n\nAnything goes :)\n\nCheers\n\n| Attachment | Size |\n| --- | --- |\n| [212\\_Comps.pdf](http://web.archive.org/web/20061127143644/http:/typophile.com/files/212_Comps.pdf) | 217.27 KB |\n\n",
  "author": "<a href=\"user/14360\" title=\"View user profile.\">JSDOCA</a>",
  "time": "<br>",
  "uid": "14360",
  "comments": [
    {
      "time": " 17 October, 2006 - 8:05pm",
      "content": "If you’re going to use type for the logo, it seems like it would be a good idea to not add an extra abbreviation. I don’t think most of these work very well, mostly because the type looks dated and more appropriate for something on the east coast. Unless this place is built into a Victorian, they just don’t work.\n\nThe idea of breaking up two one two with ninety degree rotations is nice, but you’re breaking it up into two twelve with the numeric versions.\n\nIf I was going to pick a favorite, it would be the middle-bottom. It’s not as dated as the serif designs, and it’s not as corny as the stepped design, but it isn’t especially compelling, either.\n\n"
    },
    {
      "time": " 17 October, 2006 - 8:33pm",
      "content": "I suppose I should of done a better job explaing myself. Your note of it hinting at an old East Coast bar is probably a good way of explaing the feel that I want to get. This is a makeshift Identity project for school. The establishment will be aged to fit like a high life New York (in opposition to its local San Francisco) esque bar, offering a taste of that sort of lifestlyle in a small eastbay community. This is one part of the logo, with various other marks as works in progress.\n\nI appreciate your comments, any new directions to venture would be great.\n\nThanks\n\n"
    },
    {
      "time": " 17 October, 2006 - 9:01pm",
      "content": "You obviously know how to make things look nice, but this falls into the trap common with design students (and design professionals) is that it doesn’t dig deep enough. Your decisions seem arbitrary and not rational.\n\nDig deeper.\n\nThe concept is there. A New York feel in the Bay area. Research. What makes New York, New York? What kind of typography is associated with New York?\n\nNew York is very different than San Francisco. Make us _believe_ we’re in New York.\n\n"
    },
    {
      "time": " 17 October, 2006 - 9:08pm",
      "content": "Thanks for the above comments, definetly taken into consideration… but prior to biddy’s comments, here are three other variations.\n\n ![](http://web.archive.org/files/212_Work_2_4370.jpg)\n\n"
    },
    {
      "time": " 18 October, 2006 - 12:44am",
      "content": "Good call on using an extended font for the word “lounge” in the first of your new samples. The compressed, upright letters of your earlier versions visually contradict a literal meaning of the word.  \nThe rotated “2” doesn’t really read in the negative form without being told it’s there. It’s a strong shape, but it isn’t communicating what it’s supposed to.\n\n"
    },
    {
      "time": " 18 October, 2006 - 5:18am",
      "content": "I wouldn’t over think this one, its just a bar. Go with an elegant 212 and if you have to use the word lounge make it small. This is a case where you aren’t really selling anything like food. Its just about atmosphere and that will be conveyed by the interior design more than any logo you could develope.\n\n"
    },
    {
      "time": " 18 October, 2006 - 6:10am",
      "content": "Your second set, #2 has much more of a ‘NY/Gotham’ vibe to it. Big city. A bit art deco.\n\nThe others, as stated, have more of an 1800’s victorian era vibe to them. Not quite sure if that’s what you want.\n\n"
    },
    {
      "time": " 18 October, 2006 - 6:35am",
      "content": "Thanks for the over thinking comment. I really found myself limited with the different directions to take the logo. The location and atmosphere speaks for itself as does the int. design. Despite the decoration, the teacher chose the flourished form. Ill post some more final versions soon. All much appreciated.\n\n"
    }
  ]
}
