{
  "id": "28904",
  "title": "The future of advertising is context sensitive",
  "forum": "Joe Pemberton's blog",
  "tags": [

  ],
  "content": "People are becoming really good at ignoring advertising, so advertisers are forced to become more creative about placement and context. As a designer with who loves creative advertising I applaud this stuff. But I'm torn. Of course it's more intrusive than a billboard you can ignore. But does the cleverness make it more acceptible? Is it actually less intrusive because they don't have to be huge billboards (that obstruct natural views or cityscapes).\n\nTake a look at about a dozen [creative ad placements from around the world](http://web.archive.org/web/20131102090241/http:/www.hemmy.net/2006/10/15/creative-advertisements-around-the-world/). What do you think?\n\n ![](http://web.archive.org/web/20131102090241im_/http:/typophile.com/files/creativeadvertisements17_4443.jpg)\n\nIn this example, a life-size Mini at the top of a subway entrance/exit in Zurich gives passersby the impression that an endless stream of people are emerging from (or entering) the car. It's creative genius, but does it go too far? I mean, as a citizen I think it would make me smile because it's so clever. But honestly, if the street becomes full of this kind of gimick I think I would begin to dislike advertising more than I already do.\n\n(Thanks Sarah for the link.)\n\n",
  "author": "Joe Pemberton",
  "time": "18 Oct 2006 — 10:26am",
  "uid": "1160",
  "comments": [
    {
      "time": "18 Oct 2006 — 10:54am",
      "content": "But we don't have a choice. Do we? Now that this clever ad placement has worked others will follow. Everytime something works, as it happens, others try to imitate and/or mimick. Social responsibility aside, of course. ;^)\n\n"
    },
    {
      "time": "18 Oct 2006 — 11:27am",
      "content": "I've become far more aware of waging integrated and innovative brand campaigns after just a couple of months of working at a large ad agency.\n\nFinding effective creative, clever, humorous and enlightening ways of promoting products, services and brands to the mass public or target audiences seem more prevalent than ever before.\n\nThe \"above-the-board\" approaches I'm basically fine with. It's these newer alternate/stealth methods that I fine intrusive, offensive and sometimes downright underhanded!\n\n(Edit-A-Bit: will update later. -_N.F._)\n\n"
    }
  ]
}
