{
  "id": "28900",
  "title": "Good typeface for small printed pricelists",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,\n\nI am looking for recommendations for a typeface to be used for a price list. The size will have to be very small (about 6pt or less).\n\nI am looking for a clean, modern, even slightly futuristic look for this pricelist.\n\nAny recommendations? Readability is important...\n\nCheers  \nHug\n\n",
  "author": "<a href=\"/web/20101204120451/http://www.typophile.com/user/7651\" title=\"View user profile.\">huggyGiraffe</a>",
  "time": "<br>",
  "uid": "7651",
  "comments": [
    {
      "time": "",
      "content": "Speaking from personal experience, [Amplitude](http://web.archive.org/web/20101204120451/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Amplitude) is very readable at small sizes.\n\n"
    },
    {
      "time": "",
      "content": "I am very small myself, and I can assure you that Amplitude is readablefor people of my size.\n\n"
    },
    {
      "time": "",
      "content": "I have had some success with [Vectora](http://web.archive.org/web/20101204120451/http:/www.myfonts.com/fonts/linotype/vectora/), due to its x-height it appears larger than many other alternatives. Too bad it might not be \"modern\" enough.\n\n(Amplitude looks very good too, no experience with it tho)\n\n"
    },
    {
      "time": "",
      "content": "I occasionally set Berthold Formata small, it looks pretty to me.\n\n"
    },
    {
      "time": "",
      "content": "Stefan Hattenbach's Stalemate font fits your criteria nicely.\n\n[http://www.macrhino.com/](http://web.archive.org/web/20101204120451/http:/www.macrhino.com/ \"http://www.macrhino.com/\")\n\n"
    },
    {
      "time": "",
      "content": "Freight Micro by Joshua Darden.  \n [http://www.joshuadarden.com/shop/freightmicro.php](http://web.archive.org/web/20101204120451/http:/www.joshuadarden.com/shop/freightmicro.php \"http://www.joshuadarden.com/shop/freightmicro.php\")\n\n"
    },
    {
      "time": "",
      "content": "Jesus, that Freight Micro is awesome——go for that, Herb Fassbinder.\n\n"
    },
    {
      "time": "",
      "content": "Retina.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Hrant - the dude can't buy or use Retina.\n\n"
    },
    {
      "time": "",
      "content": "I like Freight Micro and Bell Centennial quite a bit.\n\nPerhaps too much character for such a use, but also note that Carl Crossgrove's excellent new Beorcana has a micro cut in bold and regular for 3 point to 8 point settings.\n\nJLT\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20101204120451/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": "",
      "content": "Officina (sans or serif) holds up well at small sizes.  \nBell Centennial is great, especially with those wacky yet highly functional deep and wide ink traps in the bold, but it will make your price list look like a phone book.~\n\n"
    },
    {
      "time": "",
      "content": "\" (about 6pt or less).\"  \n\"I am looking for a clean, modern, even slightly futuristic look for this pricelist.\"\n\nI would definitely think about Agenda or a futurist pricelist at 6 pt.\n\n"
    },
    {
      "time": "",
      "content": "[FF Fago Office Sans](http://web.archive.org/web/20101204120451/http:/www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufacturer&displayfontid=FF.11195.0.0)\n\nI would also recommend Amplitude.\n\n"
    },
    {
      "time": "",
      "content": "This thread interests me, because I am interested in fonts suitable for statistical work. However, I don't recall seing any of the mentioned fonts being in my Windows equiped computer. Where can I find them on line?\n\nI am bugged by the 6, 8 and 9 of the font used by my bank (Chase) which have round tops, round bottoms and something across the middle.  \nArial, e.g., suffers from this too. I need a font for digits whose ascenders and desenders are not bent over -- even slightly.\n\nIt helps if recommendtations are accompanied by reasons. I see few above. Just liking something isn't as good as liking because...\n\nWhere can I find the resuls of font legibility comparisons? Who does it?\n\n===gm===\n\n"
    },
    {
      "time": "",
      "content": "\\>Where can I find them on line?\n\nThey are available for purchase for both Windows and Mac on line at the the founderies--Fontbureau, etc.--and omnibus sites fontshop.com, myfonts.com, veer.com, fonts.com.\n\nThough there are various claims out there, there are no scientific tests that I know of for legibility of small type. You just have to look and judge for yourself. Or talk to the knowledgeable folks at the founderies. Some of the sites have PDFs that you can print out at size. But be aware that laser printers in general are not as sharp and clear as offset.\n\n"
    },
    {
      "time": "",
      "content": "Linotype Cisalpin, which, by the way, indicated that the Type ID Quiz Expert Level needs to be rebooted :)\n\nOtherwise, FF Kievit. I've used and seen it used in small sizes (6 and 5 pt) with much success. To be able to be readable at 6 is great, but 5 is a whole another area.\n\n"
    },
    {
      "time": "",
      "content": "what typefaces will u guys recommend for less then 3pt text.  \nI saw micro text on some swiss made watch...I think that was 1 or 2 pt...I couldnt identify the font but/\n\n"
    },
    {
      "time": "",
      "content": "Stuff that small is intended to be read with a loupe (common  \nin the watch and jewelry business), so it doesn't count. :-)\n\nBut there's always Minuscule:  \n [http://www.typophile.com/node/14163](http://web.archive.org/web/20101204120451/http:/www.typophile.com/node/14163 \"http://www.typophile.com/node/14163\")\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "hrant....actually i always loved micro typography...I had a long debate with my teacher regarding using type in small sizes. I wanted to set a booklet in 4pt text..he simply said it will not be legible/and u cant get it printed. I told him that its fo me only..but he dint agreed..I dunno whats wrong in setting a publication is small ppts.\n\nAnd now am doing a publicatin in which Im using big-big typefaces..  \nso that he can read it;)\n\nhrant thanks for the info on Minuscule. its great.\n\n"
    },
    {
      "time": "",
      "content": "Thank you WB. I'll look.\n\nUniversity psychology departments study legibility and I have sent an enquiry to one of them, asking who else might be doing it and where they publish their findings. Some organizations have their own standards. The GPO has none. State Dept. has a special standard for things sent to the President. Newspapers have style books that specify font and size, etc. Its a big world out there, much to be explored.\n\n===gm===\n\n"
    },
    {
      "time": "",
      "content": "satya, you are not alone. I know a lady who does miniature books and has gone as far as the UK to attend meetings on them. ===gm===\n\n"
    },
    {
      "time": "",
      "content": "Stephan or Hrant, can you tell me more about the Minuscule font? And about why does Minuscule Deux looked not right on the provided sample (on the thread)? It certainly is legible, especially considering the 2/3pt size usage. But the shape still confound me.\n\n"
    },
    {
      "time": "",
      "content": "I suspect it \"doesn't look right\" for two reasons:  \n1) At that scale it can't look <cite>too</cite> right.  \n2) Some decisions were probably made in deference to Javal & Dreyfus's original. And those guys were not type designers a century ago, much less today. :-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "thanks everybody. I went with Amplitude!\n\n"
    }
  ]
}
