{
  "id": "28919",
  "title": "What is the connection between blackletter and violent / extreme culture",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Dear typophiles, I’m currently writing a university essay on the connection between [blackletter](http://web.archive.org/web/20150418114528/http:/www.typophile.com/wiki/blackletter) and violent and extreme subcultures. I know that there have been some discussions about the connection to Nazism, and the “The Bormann Decree” of 1941.  \nMy interest is in its general use as a style associated with danger and violence. I want to understand why it has become popular with other subcultures. I know for instance that it is popular among gang members in Los Angeles. (Someone told me that it is fact banned at LA-schools, is that true?)\n\nOn the other hand is the said connection to neo Nazism. Two subcultures that are very different, maybe even oppositions, but still equally violent.\n\nI am considering there to be three ways of understanding this:  \n1) An historic explanation, with its connections to the third reich and “the dark ages”.  \n2) An aesthetical explanation, in relation to the sharp edges and so on.  \n3) And finally a “functional” explanation, if you can call it that. Here I’m thinking of the legibility of these typefaces, which make them suitable for secret societies.\n\nPart of my interest in this theme is to maybe be able to say something more general about what makes up and comunicates the “meaning” of a typeface. And how big a part of it is its historical connotations. A huge field of research of course.\n\nAs often with social sciences I suspect the explanation to be a combination of the three, but I would very much like to get your opinion on the matter. Are there any aspects of this that I’m missing? I am still quite early in the process, so any suggestions would be of great value. Maybe any of you know of any similar research that could be of interest?\n\n",
  "author": "Thord",
  "time": "19 Oct 2006 — 3:42am",
  "uid": "12494",
  "comments": [
    {
      "time": "19 Oct 2006 — 4:54am",
      "content": "[http://www.eyemagazine.com/feature.php?id=98&fid=485](http://web.archive.org/web/20150418114528/http:/www.eyemagazine.com/feature.php?id=98&fid=485 \"http://www.eyemagazine.com/feature.php?id=98&fid=485\")\n\n[http://tinyurl.com/yafsph](http://web.archive.org/web/20150418114528/http:/tinyurl.com/yafsph \"http://tinyurl.com/yafsph\") (book)\n\n[http://www.svettisku.cz/buxus/generate\\_page.php?page\\_id=1014](http://web.archive.org/web/20150418114528/http:/www.svettisku.cz/buxus/generate_page.php?page_id=1014 \"http://www.svettisku.cz/buxus/generate\\_page.php?page\\_id=1014\")\n\n[http://www.moorstation.org/typoasis/blackletter/index.htm](http://web.archive.org/web/20150418114528/http:/www.moorstation.org/typoasis/blackletter/index.htm \"http://www.moorstation.org/typoasis/blackletter/index.htm\")\n\n[http://typophile.com/node/20252](http://web.archive.org/web/20150418114528/http:/typophile.com/node/20252 \"http://typophile.com/node/20252\")\n\n"
    },
    {
      "time": "19 Oct 2006 — 5:04am",
      "content": "Maybe that some people today associate blackletters with Nazism and violance. And your essay seams to insist there is a relationship \"essay on the connection between blackletter and violent and extreme subcultures\"\n\nBut there is'nt one.  \nIts not the fonts' guilty but the people ones.  \nTheir associations are wrong. Why don't you write an \"essay on wrong associations between blackletters and Nazism/violance.\"?\n\nHerewith I send you a Fruehling (spring) from Rudolf Koch out of 1917. Very dramatic, mh? Shortly before the World War I ended. A real sign of the \"Hunnen\" :-)\n\n ![](http://web.archive.org/web/20150418114528im_/http:/typophile.com/files/1_4039.jpg)\n\nGeorg\n\n[www.bleisetzer.de](http://web.archive.org/web/20150418114528/http:/www.bleisetzer.de/ \"www.bleisetzer.de\")\n\n"
    },
    {
      "time": "19 Oct 2006 — 5:41am",
      "content": "This is one of the latest contributions to this debate:\n\n[http://www.fontblog.de/fraktur-ist-auch-eine-nazi-schrift](http://web.archive.org/web/20150418114528/http:/www.fontblog.de/fraktur-ist-auch-eine-nazi-schrift \"http://www.fontblog.de/fraktur-ist-auch-eine-nazi-schrift\")\n\n\"Fraktur is (also) a Nazi typeface\"\n\nUnfortunately only in German, though. You may try babelfish.\n\n"
    },
    {
      "time": "19 Oct 2006 — 5:49am",
      "content": "To Alessandro: Thank you for your feedback. I had actually already ordered the book from Amazon, so I hope that will be helpful for my essay. And the previous discussion here at typophile has also been helpful. No to mention the Eye article which seems to be very in tune with what I am trying to say. They often are…\n\nAnd to Bleisetzer: I hope I have not offended you. I am as fond of blackletter as you seem to be. I am aware of the history of this style, at least to some degree, and that there is no relationship between the origins of blackletter and violence. But most people will not have that knowledge about the history of typography. As you point out I will need to explain why, and if, there is a conection between the two.\n\nIn my opinion it all comes down to the thing that is so frustrating and intriguing about type-design. That you are seldom able to control or predict what the type will be used for, and so the meaning of it evolves and changes through time. As it is pointed out in said Eye article.\n\n"
    },
    {
      "time": "19 Oct 2006 — 5:52am",
      "content": "Oh, and thank you Tim. Although I will need to dig up my Norwegian - German dictionary :-)\n\n"
    },
    {
      "time": "19 Oct 2006 — 6:23am",
      "content": "@ Thord\n\nOh no, I am not offended, why should I?\n\nWhat I see again and again in discussions like the one Tim Ahrens postet:  \n [http://www.fontblog.de/fraktur-ist-auch-eine-nazi-schrift](http://web.archive.org/web/20150418114528/http:/www.fontblog.de/fraktur-ist-auch-eine-nazi-schrift \"http://www.fontblog.de/fraktur-ist-auch-eine-nazi-schrift\")\n\nis that lots of the typography professionals in Germany (its a german forum discussion, what Tim listed above) are not familiar with their own history.\n\nExample:  \nJust the start of the discussion shows two pictures:  \nPicture two (right side) is showing a poster for a 1. Mai \"meeting\". Its from 1938, when the Nazi government was established since 5 years. So it was not a 1. Mai demonstration of the workers, it was a Nazi demonstration and to go there was a duty.\n\nThe left picture has nothing to do with the Nazi. \"Luftschutz\" means proctection against air attack. These organisations were organized in all european nations since approx. 1923. Of course there was a german army \"Reichswehr\" before 1933. But this was not a Nazi organisation.\n\nAnd of course the font for the word \"Luftschutz\" was a blackletter. Because this was the common font in the 20ies. I am sure no one of the discussion members know these details. But its typical. Exactly in this way the bridge from blackletter fonts to Nazism was built.\n\nBlackletters in Germany were used since 16th century - 400 years. But only 12 years from 1933 up to 1945 the Nazi dictatur was present.\n\nGeorg\n\n[www.bleisetzer.de](http://web.archive.org/web/20150418114528/http:/www.bleisetzer.de/ \"www.bleisetzer.de\")\n\n"
    },
    {
      "time": "19 Oct 2006 — 7:05am",
      "content": "The Nazis ruined everything. Jerks.\n\n"
    },
    {
      "time": "19 Oct 2006 — 7:18am",
      "content": "So what?\n\nTo agree with \"Blackletter is Nazi stuff\" means to let these fonts (and our freedom to use it) exactly these Nazis. Can this make sense? Why should we give up and let them occupy important and wonderful parts of our culture?\n\nTake these fonts and use them for your designs, if possible.  \nThis means to fight 'em.\n\nGeorg\n\n[www.bleisetzer.de](http://web.archive.org/web/20150418114528/http:/www.bleisetzer.de/ \"www.bleisetzer.de\")\n\n"
    },
    {
      "time": "19 Oct 2006 — 7:21am",
      "content": "I understand exactly what you saying Georg. Much of the associations to Nazism may be based on misunderstandings. But it does not change the fact that this association is common among many people.\n\nIn Norway, and I suppose other countries as well, people associate it with Satanism. Largely due to the fact that Norwegian black metal bands have used it on their cover art. This is somewhat peculiar, when you consider the origins of blackletter, and its use in bibles and such.\n\n"
    },
    {
      "time": "19 Oct 2006 — 7:24am",
      "content": "\\>But there is’nt one.  \n\\>Its not the fonts’ guilty but the people ones.\n\nOf course, the typeface is not 'guilty' or innocent for that matter. But the reality is that typefaces have emotional associations, deserved or not. In the US there are a number of associations of blackletter, one of them being with the Nazi party.\n\n1. Church uses. Here there is no association with violence.\n\n2. Newspaper Nameplates. Again no association.\n\n3. Beer names. Here the association is with Germany, but not with the Nazi party.\n\n4. Nazi party. Since, as Tim's link explains, the Nazis identified Fraktur in particular as the 'true German script' and used it in their propaganda until 1941--and post-war Germany largely abandoned black letter--this is one association.\n\n5. Heavy metal bands. Here perhaps starting with the AC/DC logo heavy metal bands have used blackletter. This music tends to be angry or despairing, so there may be some emotional link with Naziism. Not with the AC/DC logo itself, I should note. However, a sub-genre of heavy metal are the 'skinhead' or neo-Nazi bands, so there is an association with both Naziism and violence here.\n\nI'm sure there are other associations as well, but these are the first that come to mind.\n\n"
    },
    {
      "time": "19 Oct 2006 — 7:42am",
      "content": "To expand on Alessandro Segalini's recommendation of Paul Shaw and Peter Bain's book, the American Printing History Association (APHA) devoted a double issue of their Printing History journal (38/39) to all the information that was actually used in the exhibition, showing the various blackletter examples. It's a good companion.\n\n[http://www.printinghistory.org](http://web.archive.org/web/20150418114528/http:/www.printinghistory.org/ \"http://www.printinghistory.org\")\n\n"
    },
    {
      "time": "19 Oct 2006 — 7:58am",
      "content": "I haven't personally researched the topic, but a very erudite designer I know who has worked for the music industry for decades told me that blackletter came back because it was just something people hadn't seen for a long time outside of it's traditional contexts. So when huge tattoos, graffiti images, etc. written in blackletter started popping up, they really stood out and became trendy.\n\n"
    },
    {
      "time": "19 Oct 2006 — 8:00am",
      "content": "Dear Bleisetzer,  \nPlease tell me how a poster published by the Reichsluftschutzbund which was part of Hermann Göring's Reichsluftfahrtministerium can have „nothing to do with Nazis“ and not be a Nazi organization.  \nThe Reichsluftschutzbund was just one organization being part of the whole Nazi machinery (among lots of other organizations) to prepare Germany for World War II and hammer Nazi ideology in people's brains.\n\n"
    },
    {
      "time": "19 Oct 2006 — 8:20am",
      "content": "Dear Bleisetzer,  \ni forgot to add that i completely understand your argument and where you're coming from in regards of usage of fraktur today (Although my personal opinion is different). But I think you're factually wrong regarding the Luftschutz poster only.\n\n"
    },
    {
      "time": "19 Oct 2006 — 8:45am",
      "content": "Dear Franz Heidl,  \nyes, I understand what you mean.  \nOf course I accept your opinion as you do with mine.\n\n\"Luftschutz\":  \nI did not say that this organisation had nothing to do with the Nazi party. Of course they had from 1933, because all organisations were overtaken by them.\n\nWhat I said is:  \nAfter World War I, which ended 1918, it was forbidden for Germany to have an army with more than 100,000 men. They were not allowed to build up an air force. The so called \"Reichswehr\" re-organized the army in a more or less tricky way. It was and it is no question that a nation is allowed to have an army? So Germany had one after 1918. And one part of it was an organisation for flight bomb attacks. This was organized long before Hermann Göring became Flight Marshall in 1933. And long before Germany spend more and more for arming up.\n\nBack to the picture we speak about:  \nEvery german soldier after 1933 was wearing a Nazi symbol from any organisation. This is exakt what is ment by \"overtaking\" (or, in german: Gleichschaltung). This soldier on the poster does not. His helmet is a model M 18:\n\nFrom 1933 it was a model M 35:\n\n----- This was too much with the pictures. Its easy to find it by Google. ------------\n\nI know it is difficult, but this are the facts.  \nIt shows how easy it is to think in cliches - for everyone, including myself.  \nGeorg\n\n[www.bleisetzer.de](http://web.archive.org/web/20150418114528/http:/www.bleisetzer.de/ \"www.bleisetzer.de\")\n\n"
    },
    {
      "time": "19 Oct 2006 — 9:02am",
      "content": "Dude, where's my archives?\n\nhhp\n\n"
    },
    {
      "time": "19 Oct 2006 — 9:39am",
      "content": "Oh dear. This turned into a discussion about Nazism. I suppose its still a touchy subject. “Don’t mention the war” as John Cleese once urged.\n\nAnd to jpad: I think you’re right, many fashions seem to come in cycles. But I think there will always be a reason why some things come back and some things don’t. And in that respect I think that some of the allure of blackletter might be taboos associated with it. The whole blackletter revival of the recent years has been closely connected to youth culture. And youth culture often adopts taboos to appear more “edgy”.\n\n"
    },
    {
      "time": "19 Oct 2006 — 9:46am",
      "content": "Speaking of which:  \n [http://typophile.com/node/28921](http://web.archive.org/web/20150418114528/http:/typophile.com/node/28921 \"http://typophile.com/node/28921\")\n\nhhp\n\n"
    },
    {
      "time": "19 Oct 2006 — 10:30am",
      "content": "Well, Thord, you were the one who spoke about a \"connection between blackletter and Nazism\", remember your first entry?\n\nBut hrant may be right: Let's better talk about hyphen:  \n [http://typophile.com/node/28902](http://web.archive.org/web/20150418114528/http:/typophile.com/node/28902 \"http://typophile.com/node/28902\")\n\nGeorg\n\n[www.bleisetzer.de](http://web.archive.org/web/20150418114528/http:/www.bleisetzer.de/ \"www.bleisetzer.de\")\n\n"
    },
    {
      "time": "19 Oct 2006 — 10:48am",
      "content": "Was reading Typology buy Louis Fili and they have a bit about German Expressionism (Die Brucke in 1905 and Der Blaue Reiter in 1911).\n\nAnd that \"Expressionists found a graphic means to communicate their raw emotions.\" Maybe their use of blackletter with violent or political means helped develop the association?\n\nAlso, \"The Postwar Expressionists introduced rigid wood-cut lettering that gave the style its force. The letters grew out of the unforgiving wood medium.\"\n\n"
    },
    {
      "time": "19 Oct 2006 — 11:23am",
      "content": "I once heard it explained that, in the case of American gang culture, is that blackletter type has immediate associations of respect and authority. It's what they saw on newspaper mastheads, birth certficates, diplomas, and other official documents, bibles, and so forth, and therefore were adopted for those associations.\n\nI'll have to dig up a reference on that , but that's the gist of it. I don't think any thought was given to Nazi, or even generally Eurpoean connections.\n\n"
    },
    {
      "time": "19 Oct 2006 — 11:27am",
      "content": "Thanks. That sounds like a very plausible explaination.\n\n"
    },
    {
      "time": "19 Oct 2006 — 11:36am",
      "content": "\\>very plausible explaination\n\nBut wrong. Gangs are violent, and seek power through violence. The Nazi association is definitely there.\n\nI am not saying that black letter \\*should\\* be associated with the Nazis. It is quite unfortunate. Also as I said many contexts seem to have escaped the association--church, newspaper nameplates, diplomas, beer, etc.\n\nStill the association is there, and those who are drawn to power through violence do often use black letter to express their ideal of domination through brutality. I am saddened by the association. But it's a reality.\n\n"
    },
    {
      "time": "19 Oct 2006 — 11:52am",
      "content": "Of course american members understand more about american gang culture I do as a german.  \nBut as a fact: In Germany blackletters are not used by the youth gangs. They use fantasy fonts like in graffities. Hiphop musicians sometimes use blackletters, but not violance orientated gangs.\n\nWhat we have are motorcycle groups, just from their outfit close to the american Hell's Angels. They use blackletters, too.\n\nMay be this combination of blackletters and violance is only found in the street gangs in the US? Could it be that they do not look for german blackletters, but for anglo-american ones?\n\nA kind of natural combination of violance and blackletters, I do not believe that.\n\nTell me: Is this in your eyes close to violance?  \nIn my eyes its historical:\n\n ![](http://web.archive.org/web/20150418114528im_/http:/typophile.com/files/1_4135.jpg)\n\nAnd this is a joke. Once a week I am making internet radio:\n\n ![](http://web.archive.org/web/20150418114528im_/http:/typophile.com/files/2_5404.jpg)\n\nGeorg\n\n[www.bleisetzer.de](http://web.archive.org/web/20150418114528/http:/www.bleisetzer.de/ \"www.bleisetzer.de\")\n\n"
    },
    {
      "time": "19 Oct 2006 — 12:23pm",
      "content": "<cite>The whole blackletter revival of the recent years has been closely connected to youth culture. And youth culture often adopts taboos to appear more “edgy”.</cite>\n\nI've always thought that it was more likely that most younger people simply don't know about the Nazi-era association of Blackletter, and with many of the Americans who remember it retired or dead, there aren't a lot of people around to keep it taboo, and that this is why Blackletter moved from underground culture into the mainstream,. I'm think that twenty years ago B'nai Brith would have had a field day with a lot of the fraktur use we're seeing in mainstream advertising right now.\n\n"
    },
    {
      "time": "19 Oct 2006 — 12:33pm",
      "content": "\\>I’m think that twenty years ago B’nai Brith would have had a field day with a lot of the fraktur use we’re seeing in mainstream advertising right now.\n\nWhat you are talking about? So far as I know no Jewish organization has ever criticized blackletter. It is the neo-nazis etc who keep using it and who keep up the unfortunate association.\n\n"
    },
    {
      "time": "19 Oct 2006 — 2:00pm",
      "content": "I am trying to figure out what xactly an X-treme culture just might be... Are the Amish an eXtreme culture?\n\nThe Roman Empire was warmongering, imperialistic and violent. Do we get violence from looking at Trajan?\n\n"
    },
    {
      "time": "19 Oct 2006 — 2:04pm",
      "content": "And now for a heavy metal interlude...\n\n ![](http://web.archive.org/web/20150418114528im_/http:/typophile.com/files/perseverance_5849.jpg)\n\nOne of my favorite bands uses Fraktur for its logo. Blackletter is synonymous with \"bad a$$.\" I love Blackletter, but I think as Bill pointed out there are other associations as well. Linotext and lighter weight blackletter faces are more closely associated with Christianity and \"the church,\" at least to me they are.\n\n"
    },
    {
      "time": "19 Oct 2006 — 2:08pm",
      "content": "Everytime I see blackletter I have an irresistible urge to invade Poland.\n\n"
    },
    {
      "time": "19 Oct 2006 — 2:14pm",
      "content": "And on the heavy metal note, I'd like the wiki de-disinformationed. As been around metal for quite a LONG time now. I've probably seen a total of 3 or 4 bands with blackletter in their title. Is it Spinal Tap that makes everyone think that? Do a survey. Sharp spikey metal roman letters are the norm.\n\n"
    },
    {
      "time": "19 Oct 2006 — 2:16pm",
      "content": "Thord, I think it's very difficult to generalize, and that each instance of \"type specification\" has its own multiplex cultural determinants, the combination of which is often quite whimsical and serendipitous. For instance, consider this:\n\nBlackletter newspaper nameplates originated with the 1712 introduction of newspaper taxes in Britain, when the sudden increase in paper costs forced publishers to economize on the amount of space alloted to the title line, minimizing its type size and choosing the darkest type then available, which was blackletter. (John E . Allen, Newspaper Designing, Harper, 1947).\n\nQuite by coincidence, when newspapers became a mass phenomenon around 1900 (due to various factors, notably the Linotype), the trendy style in typography was Kelmscott-inspired (William Morris) mediaevalist Arts and Crafts. Many papers which had Roman mastheads switched to Blackletter at that time, for instance the Birmingham News (Alabama), and have stuck with it to this day.\n\n"
    },
    {
      "time": "19 Oct 2006 — 3:07pm",
      "content": "Nick, I think you’re right. I am starting to understand that my theme may be more complex than I had initially thought.\n\nThe university course I am taking is called visual rhetorics, and it deals mainly with pictures. Most of my fellow students are not that familiar with typography and the idea that a typeface communicates was quite new to them. This is partly why I chose this theme. When I presented samples of Fette Fraktur they all had different connotations to the style, and they had strong opinions about its use. I suspect that I would not have gotten the same reactions had I shown them a sample of for instance “Trajan capitals”, as Solipsism pointed out. Their interpretations may be based on prejudice and ignorance, but it is still the way they perceived it, and I suspect that many other perceive it in the same way. It seems like blackletter types have stronger emotional connotations than most.\n\nAs many of you have pointed out, there are a number of examples were the use of blackletter has nothing to do with violent or aggressive subcultures. But many of them seem to connect to a well-established custom. Beer labels, newspapers, churches and so on.\n\n"
    },
    {
      "time": "19 Oct 2006 — 4:35pm",
      "content": "NAZI!\n\n ![](http://web.archive.org/web/20150418114528im_/http:/typophile.com/files/vw_logo_6515.jpg)\n\n ![](http://web.archive.org/web/20150418114528im_/http:/typophile.com/files/HitlerPorscheVW1938-300pxw_5049.png)\n\n"
    },
    {
      "time": "19 Oct 2006 — 5:55pm",
      "content": "<cite>What you are talking about? So far as I know no Jewish organization has ever criticized blackletter. It is the neo-nazis etc who keep using it and who keep up the unfortunate association.</cite>\n\nI'm under the impression that until recently people had avoided using blackletter under the assumption that the Nazi associations would offend, and that as more of the generation that directly remembered Nazism have died or retired from design jobs, it became acceptable to use blackletter again. Which is why I think that twenty years ago, when more people still remembered the association, it would have gotten the attention of anti-Nazi groups.\n\n<cite>NAZI!</cite>\n\nDoes it ever seem odd to anyone else that VW uses type developed by a guy that the Nazis persecuted?\n\n"
    },
    {
      "time": "19 Oct 2006 — 8:38pm",
      "content": "ahh they also persecuted the bauhaus! That's a definite benefite methinks. Although i wouldn't shrug blackletter because of i'ts association.\n\nAt least I thought they were associated. Maybe someone will post the post from the German student asking about new ways to use blackletter to help rid it of the connotations?\n\n"
    },
    {
      "time": "19 Oct 2006 — 8:51pm",
      "content": "Best first step: set a book about Yiddish in blackletter.\n\nhhp\n\n"
    },
    {
      "time": "19 Oct 2006 — 10:25pm",
      "content": "Ignorant of the history of the face as a youth, I never missed the relation between lowercased blackletter and insuated violence. I think pointed bottoms are intentionally exploited to that end.\n\n ![](http://web.archive.org/web/20150418114528im_/http:/typophile.com/files/Megadeth_logo_chrome_5913.png)\n \n ![](http://web.archive.org/web/20150418114528im_/http:/typophile.com/files/unleashed_logo_4912.jpg)\n  \nThe same could be said of select grunge, theme or abstract fonts, or any where strong downward points will appear in some of the fonts. Curves, swirls and softly rounded edges appear peaceful, while barbed, jagged and pointy don't. In the relatively minor section of metal bands that do use blackletter in logos, they always pick the sharpest ones, like the hatebreed example up above.\n\nWhen I was designing and naming !The Black Bloc, I was specifically looking to create a softer, or more ambigous version of blackletter, to challenge its datedness and screw with its violent reputation.\n\nTurns out, it's been popular with 'tough girls'. Guess I didn't go far enough.~\n\nOn gangs, Cuttlefish nailed it. In America, today's youth are pretty far removed from the Nazi-era fashion (& not too apt to study type history. But the observation of the \"officialness\" of ornate blackletter caps has lent them a sense of melodrama that gangs, and other melodramatic teens/young adults enjoy.\n\n ![](http://web.archive.org/web/20150418114528im_/http:/typophile.com/files/sublime_4361.jpg)\n  \nI've observed tattooist and patrons mixing blackletter caps with latin lowercase, immediately after some newspapers began doing the same thing in the 1990's. And in those body-mod circles, it is referred to nearly exclusively as \"Old English\", even if it pulled directly from a German source.\n\n[Choz Cunningham](http://web.archive.org/web/20150418114528/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20150418114528/http:/www.exclamchine.com/)  \n [The Snark](http://web.archive.org/web/20150418114528/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "19 Oct 2006 — 11:34pm",
      "content": "Hi Thord,  \nyou say you're writing on blackletter and extreme cultures. There are some cultures which haven't been mentioned in this discussion, and those are the hardcore/vegan and skateboard/snowboard subcultures. Blackletter is widely used in these cultures, even though they're not \"violence based\" like satanism and nazism. Maybe these cultures sre drawing on the widespread association between violence and blackletter to communicate a somewhat aggressive or \"dangerous\" image. For some examples of violent aesthetics in the hardcore music scene, take a look at [http://en.wikipedia.org/wiki/Hardcore\\_dancing](http://web.archive.org/web/20150418114528/http:/en.wikipedia.org/wiki/Hardcore_dancing \"http://en.wikipedia.org/wiki/Hardcore\\_dancing\") . You'll find links to some hilarious dance clips here.\n\nvennlig hilsen alex\n\n"
    },
    {
      "time": "20 Oct 2006 — 12:35am",
      "content": "Please disabuse me, I am not knowledgeable about gang culture in America, does the extensive use of blackletter in Mexico have any bearing on its use among hispanic gangs?\n\n[http://typophile.com/node/17496?from=50&comments\\_per\\_page=50](http://web.archive.org/web/20150418114528/http:/typophile.com/node/17496?from=50&comments_per_page=50 \"http://typophile.com/node/17496?from=50&comments\\_per\\_page=50\")\n\nbtw came across this  \n [http://www.countrybookshop.co.uk/books/index.phtml?whatfor=0977282783](http://web.archive.org/web/20150418114528/http:/www.countrybookshop.co.uk/books/index.phtml?whatfor=0977282783 \"http://www.countrybookshop.co.uk/books/index.phtml?whatfor=0977282783\")\n\nTim\n\n"
    },
    {
      "time": "20 Oct 2006 — 12:36am",
      "content": "The title of Thord's threat is  \n\"What is the connection between...\"  \nand not  \n\"Is there a connection between...\"\n\nThis makes an open discussion difficult, does'nt it?  \nMay be the job is to find hints and facts for the violence, he needs, and that's it.\n\nGeorg\n\n[www.bleisetzer.de](http://web.archive.org/web/20150418114528/http:/www.bleisetzer.de/ \"www.bleisetzer.de\")\n\n"
    },
    {
      "time": "20 Oct 2006 — 12:56am",
      "content": "Georg,\n\nI would say there is a connection. Like it or not, a lot of people who have little knowledge on the history of type and/or aren't german (which happens to be a substantial part of the world's population) associate blackletter/old english/schwabacher or whatever name they pick with «das dritte reich», violence, extremism of different kinds and so on. So the question is \"why?\". I mean, could Frankfurter ever be the typeface of choice for an aspiring dictator?\n\nalex\n\n"
    },
    {
      "time": "20 Oct 2006 — 1:09am",
      "content": "Alex,  \ndo you know the earth is a flat plate?  \nLook out of the window and you'll see it.\n\nSome guys tell us this is'nt so? How silly they are.  \n\"Like it or not, a lot of people who have little knowledge on the geographic of the earth associate mother earth with «a flat plate».\"\n\nSo we should accept this and just try to find facts to take care not to go to close to this plate's end. Because we could fall into the big nothing.\n\nI prefer facts. And if the mass of people think in a wrong way there is no reason for me to give up my way of thinking.\n\nBest regards,  \nGeorg\n\n[www.bleisetzer.de](http://web.archive.org/web/20150418114528/http:/www.bleisetzer.de/ \"www.bleisetzer.de\")\n\n"
    },
    {
      "time": "20 Oct 2006 — 1:33am",
      "content": "Takk for tipset Alex. Thank you all for good suggestions.  \nMany of you have remarked that the Nazi-era associations have died out with the people who experienced WW2. I am not sure that I agree.  \nThe war may be long gone but its presence in popular culture is still strong, through countless movies, computer games, books, comics, TV-series and endless documentaries. Thus people are subjected to the symbols of this era all the time, and although the taboo of these may be fading, the knowledge is still present. If anything I suppose one could argue that the associations to the Third Reich has been affirmed by the use of it in popular culture.  \nThis does not mean that I see a connection between this and its use in gang culture. I too have far too little knowledge about American gang culture. And the extensive use of blackletter in Mexico seems like a very interesting and plausible connection.\n\n"
    },
    {
      "time": "20 Oct 2006 — 2:19am",
      "content": "Hypothesizing a little further spanish speaking gangs in LA may have adopted a style familiar to their environment and some other sub-cultures (like skateboarders, rappers) picked up from them associating the style with being outside the mainstream.  \nHowever the use of blackletter in heavy metal and particularly skinhead cultures may have come from _mistaken associations_ with Nazism. It seems pointless to deny that there are associations, whether they are correct or incorrect, Georg is doing a good job of defending blackletter, however for the majority of visitors to this forum he is preaching to the converted (or those that never needed to be converted).\n\nTim\n\n"
    },
    {
      "time": "20 Oct 2006 — 4:28am",
      "content": "\"And the extensive use of blackletter in Mexico seems like a very interesting and plausible connection.\"\n\n ![](http://web.archive.org/web/20150418114528im_/http:/typophile.com/files/1_5877.jpg)\n\nMaximilian von Habsburg, Kaiser von Mexiko\n\nHe ruled Mexiko for some years in the 1860ies.  \nHe was from Austria, a brother of Kaiser Franz Josef.\n\nMay be he brought these blackletters with him, full of violance.  \nBy the way: France supported him with money and soldiers.  \nAnd the United States of America followed their Monroe doktrin and forced all french troops to leave the country.\n\nThey (the americans) brought lots of new blackletters to Mexiko, each of it full of aggressive power. This mixture - austrian/german and north american blackletter influence may be the reason the mexican street gangs are so aggressive.\n\nSoon, in 2008 (if the Chinese do not give a veto) all blackletters in Mexico will be changed to flower-power fonts. Unicef said there will be a toll free exchange for all the sprayers of the gangs. They all geht orange, light blue and pink colours.\n\nLife can be so easy following the rules of the masses :-)\n\nGeorg  \n(This was a joke. May be not a good one for everybode but I like it).\n\n[www.bleisetzer.de](http://web.archive.org/web/20150418114528/http:/www.bleisetzer.de/ \"www.bleisetzer.de\")\n\n"
    },
    {
      "time": "20 Oct 2006 — 5:55am",
      "content": "Georg,  \nof course, that the average joe thinks that blackletter=nazi doesn't mean he's right. But it's still interesting why he thinks so.\n\nallet jute aus oslo\n\nalex\n\n"
    },
    {
      "time": "20 Oct 2006 — 6:48am",
      "content": "Along with jpad and others I believe this is where the association became to be. What was old is now new, and thus the world turns.\n\nJust think of it as anti-modernism if that makes any sense...\n\n"
    },
    {
      "time": "20 Oct 2006 — 7:38am",
      "content": "I've always assumed that the connection between gangs and blackletter stemmed from US motorcycle gangs post World War 2 who took on various military themes and insignia: iron cross, swastika, \"pickelhaube\" spiked helmets, the term \"Hells's Angels\" from the Howard Hughes film.\n\n"
    },
    {
      "time": "20 Oct 2006 — 7:52am",
      "content": "\\> This makes an open discussion difficult, does’nt it?\n\nDepends on you. Historically, Typophile thread titles have had little bearing on the actual aggregate contents of threads. :-)\n\nhhp\n\n"
    },
    {
      "time": "20 Oct 2006 — 8:02am",
      "content": "Here's what I know about the association between blackletter and Nazis in the US. Prior to WW2 blackletter was used regularly in specific contexts: newspaper nameplates, headings for church documents, headings in diplomas, beer names and anything trying to appear 'olde English' or German.\n\nThese connections remained after WWII, but for most people the additional Nazi connection was added. This is because outside these very specific traditional contexts blackletter was rare. And so the films from and about the Nazi era were the main place Americans saw blackletter, particularly used as text. Hence the new connection.\n\nThose who knew German--such as refugees, Jewish and non-Jewish--were of course aware that blackletter was far more general and historical. Hence Jewish organizations knew better than to have any bias against blackletter as a special Nazi invention.\n\nAs to inherent feel, I don't think blackletter is inherently agressive. It depends on how it is treated. Terminals can be made dagger-like, but so can roman fonts.\n\nI would be interested in the story of why within Germany itself they avoided blackletter after WWII. Was there any association by Germans of fraktur with the Nazi era? Was it a product of the occupation by the Allies? Was it an extension of the Nazi ban on blackletter? A combination?\n\n"
    }
  ]
}
