{
  "id": "28924",
  "title": "handmade balinese typography",
  "forum": "Design",
  "tags": [

  ],
  "content": "article about [handmade balinese typography](http://web.archive.org/web/20100502015222/http:/www.pingmag.jp/2006/09/27/handmade-balinese-typography/) on pingmag.jp.\n\n",
  "author": "<a href=\"/web/20100502015222/http://typophile.com/user/7345\" title=\"View user profile.\">thierry blancpain</a>",
  "time": "<br>",
  "uid": "7345",
  "comments": [
    {
      "time": "",
      "content": "Thierry, your link isn't working.  \nTim\n\n[http://www.pingmag.jp/2006/09/27/handmade-balinese-typography/](http://web.archive.org/web/20100502015222/http:/www.pingmag.jp/2006/09/27/handmade-balinese-typography/ \"http://www.pingmag.jp/2006/09/27/handmade-balinese-typography/\")\n\n"
    },
    {
      "time": "",
      "content": "thanks tim, it works now. forgot a \" after the link.\n\n"
    },
    {
      "time": "",
      "content": "Nice.  \nBTW, the article mentions \"Bali’s original Hindu alphabet.\"  \nI presume they switched to Latin at some time - in which case  \nI'd like to find out more about that. Does anybody know anything?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Here's a page on the [Balinese alphabet](http://web.archive.org/web/20100502015222/http:/www.omniglot.com/writing/balinese.htm) and it's history.\n\n"
    },
    {
      "time": "",
      "content": "Nope. It's Balinese script, an evolution of the \"original Hindu alphabet\" that you mentioned. The Sanskrit that we all know was brought to Indonesia at approximately 75 AD and eventually evolved to a more localized variant, the Palawa. This was the official alphabet of Indonesia's many Hindu kingdoms.\n\nHowever, not until the reign of Purnawarman (at approximately 4th century AD), did we have an official record of Hindu as a state religion in Java. Bali, for its comparatively small size, got its Hindu influence much earlier and was able to maintain Hindu's tradition to this day, even alongside Buddhism and then Islam.\n\nThe evolution from Palawa to its local variants -- like Balinese or Javanese script -- then, is a gradual one. Currently, we have an official record of the translation of the _Mahabarata_ from Palawa into Javanese script on the reign of Dharmawangsa (1000 AD). Thus, most historians believe that Palawa's many variants must've been used extensively much earlier than that, at approximately 600 AD.\n\nI'd be happy to get more facts into this topic if you're interested. I'm not from Bali, but I'm a native of East Java, so the island is just a 45-minute plane ride away (which is kind of nice, if you ask me :)\n\n"
    },
    {
      "time": "",
      "content": "A Javanese Typophiler - yay! :-) Thanks for the mini lesson.\n\nOne thing on that Omniglot page is confusing:  \n\"The Balinese alphabet ... is mainly used for religious works. Generally a version of the Latin alphabet known as Tulisan Bali is used instead... Although Tulisan Bali is a required subject in Balinese primary schools, most people promptly forget it afterwards.\"  \nThis seems to imply that Balinese are functionally illiterate!\n\nSo what do Balinese generally write in, and what's the real story with use of Latin?  \nAnd when did Tulisan Bali come about, and who sanctioned/promoted it?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "'Tulisan' in Bahasa Indonesia literally means 'writing'. I don't know if there are two variants of the Balinese scripts (one for religious works, one for casual uses). But what I do know is that, much like in Java, kids are required to study and be able to write traditionally. I used to be able to write in Javanese script fluently, back in elementary school.\n\nHowever, the standard language of choice remains Bahasa Indonesia, an Indo-Malayan language -- written in Latin alphabets -- that was a derivative of Sumatran, and which writing system was introduced during the Dutch colonization (1600's AD).\n\nIn the name of unity (and to overthrow the many oppressors of the country), the language was used as one of the tool of national pride. So it only made sense that the practicality of using a traditional script in 'real-world' situation soon became trivial. The regional variety of Bahasa, then, is what most people ended up speaking, especially because 'latinizing' and then assimilating the script into the mother language is quite easy.\n\nIn short, everyone writes in regular alphabet and speaks in Bahasa Indonesia in formal situations (and in informal ones, a fusion of Bahasa and localspeak). But for the sake of tradition (which is a good thing, really), regional scripts and traditional language continued to be taught in school.\n\nAnd believe me, that's only a small part of the story (now that you got me going :)\n\n"
    }
  ]
}
