{
  "id": "28937",
  "title": "LA to SF Bay Area",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey Folks,\n\nWe need some advice, I know a lot of you live in the bay area (jared, joe) and i need some advice on a good place/area/neighborhood to live for a small family of three. I will be working in Mountain View and will be commuting via bicycle or public transit. Also I need to have a garage to set up my letterpress studio. We will be renting.\n\nAny ideas? I hear San Mateo is a cool area... but I have never been there.\n\nIn short, graphic designer and family are looking for a good neighborhood in the bay area... we need help.\n\nBest,  \nJosh\n\n",
  "author": "Moore",
  "time": "19 Oct 2006 — 9:56pm",
  "uid": "1935",
  "comments": [
    {
      "time": "19 Oct 2006 — 10:10pm",
      "content": "My wife and I live in Mountain View, and we're looking to move to a new place. We've looked in a variety of towns nearby such as Redwood City, Sunnyvale, Campbell, and Milpitas. (We're priced out of places like Menlo Park, Palo Alto, and Los Altos.) For what it's worth, we've decided that we want to stay in Mountain View. We haven't found a place yet though.\n\nI used to live near San Mateo. Like many towns, there are areas that are nice and there are areas that are not so nice. You really need to visit a neighborhood to get a feel for what it's like. Of course, it also depends on what you're looking for.\n\nIf you end up living in San Mateo and commuting to Mountain View, there's a commuter train that you might be able to use. See\n\n[http://www.caltrain.com](http://web.archive.org/web/20131019015223/http:/www.caltrain.com/ \"http://www.caltrain.com\")\n\ns'marks\n\n"
    },
    {
      "time": "19 Oct 2006 — 11:39pm",
      "content": "In fact, if you're trying to commute into Mountain View, you also have the light rail system coming up from San Jose (not to mention the bus) at your disposal. I grew up around Mountain View/Los Altos and think it's a great place to live. As you might imagine, it depends a lot on how much money you have. There are really a lot of charming suburban neighborhood along the Hwy 101/Caltrain corridor, but I'm guessing prices and rental availability vary a lot. Maybe if you can give us some idea of the price range you're after, we might have more helpful suggestions. (There was just a news story tonight about how rents are spiking up here -- so hurry up!)\n\n"
    },
    {
      "time": "20 Oct 2006 — 5:50pm",
      "content": "i am not even sure what a reasonable rental would cost up there. something under 2000 would be great... what should i expect? i've looked on craigslist and have found some nice places, but you can't get a sense for the surrounding area.  \njosh\n\n"
    },
    {
      "time": "21 Oct 2006 — 7:33am",
      "content": "You might be interested in a project powered by Craigslist and Google called HousingMaps. Very useful I would think.\n\n[http://www.housingmaps.com/](http://web.archive.org/web/20131019015223/http:/www.housingmaps.com/ \"http://www.housingmaps.com/\")\n\n"
    }
  ]
}
