{
  "id": "28947",
  "title": "Natural Arabetic Input Method (NAIM)",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Our site, arabetics.com, was recently upgraded to introduce more options for Arabic and Arabetic scripts users. In addition to adding more fonts and the ability to edit and display extended Arabic scripts online, using any of our fonts, we have also introduced on the site a java applet demonstrating our new alternative Arabetic editing method: NAIM\n\nThis new input method option is a “shaping” free (or glyph substitutions free) natural Arabetic text input method. User sees no glyph changing prior to leaving a word. Additionally, we have added an option for users to force RtL only ordering to avoid bidi behavior when desired: [http://arabetics.com/java/NAIM.html](http://web.archive.org/web/20150415084621/http:/arabetics.com/java/NAIM.html \"http://arabetics.com/java/NAIM.html\")\n\nFurther discussion of this method and other related topics are included in our latest article in the upcoming issue (40.3) of Visible Language: “Typography behind the Arabetic Calligraphy Veil”.\n\nThanks.\n\n-Saad\n\n",
  "author": "Saad Abulhab",
  "time": "20 Oct 2006 — 8:27am",
  "uid": "8492",
  "comments": [
    {
      "time": "20 Oct 2006 — 8:32am",
      "content": "Na'eeeem. :-)\n\nhhp\n\n"
    },
    {
      "time": "20 Oct 2006 — 11:43pm",
      "content": "US Utility Patent Pending?! Congratulations!\n\nDoes NAIM virtual keyboard dispaly Initial or Standalone Arabic Glyphs?!  \nAre you going to market NAIM physical keyboards along with NAIM Software?!  \nOnly then, New learners would not quit the educational process early due to the 2 ‘confusing’ shapes needed to be memorized up front.\n\nThen, Arabic is a Digit Hopping System. Arabs read and write 2-digit numbers from right to left if the right digit is not zero, whereas 3-digit numbers are written from left to right but hop read from the left significant, right significant then middle...  \nSo how does NAIM solve the insolvable?\n\nCongratulations again with [Flowers](http://web.archive.org/web/20150415084621/http:/www.crauswords.com/flowers/WFlowers.htm)\n\n"
    },
    {
      "time": "21 Oct 2006 — 5:40am",
      "content": "Thanks Aziz\n\n\\>\\>Does NAIM virtual keyboard display Initial or Standalone Arabic Glyphs?!\n\nBoth, it is not dependent on that. I made sure to test it with 2-4 glyphs per letter too. It works with any font.\n\n\\>\\>Are you going to market NAIM physical keyboards along with NAIM Software?!\n\nFor now we created a java applet that serves fonts, keyboards, directionality, and input methods, over the web to demonstrate our project. But NAIM is just a method. It can be implemented within hardware or software, or even using OT features (with application software aware environment)\n\nIt's main goal to make a user and learner not overwhelmed by awkward glyph changing so he/she can concentrate on learning the shapes.\n\n\\>\\>Then, Arabic is a Digit Hopping System. Arabs read and write 2-digit numbers from right to left if the right digit is not zero, whereas 3-digit numbers are written from left to right but hop read from the left significant, right significant then middle…  \nSo how does NAIM solve the insolvable?\n\nFunny you say that Aziz. That is exactly what we have been saying for years: bidi did not solve the insolvable? It just made typing Arabic awkward, and added unneeded overhead.\n\n-Saad\n\n"
    },
    {
      "time": "21 Oct 2006 — 7:52am",
      "content": "Well Saad, with the current M$ windows environment, the new learner sees on the screen what he/she first hits on the keyboard, A stand-alone Letter on both?!  \nBut with NAIM he/she does not see what he expects by the first hit. Instead he/she will see a different shape — the initial form of the letter— unless of course he/she spaces it for example? Right? Or have I made more funny questions?!\n\nNumberwise, I do not see any awkwardness in the current Arabic System. Numbers go naturally and smoothly as long as you are in the right (to left) direction that has been made not to toggle by accident as before. Mistakes in numbers can be easily corrected as well.\n\nThanks with [Flowers](http://web.archive.org/web/20150415084621/http:/www.crauswords.com/flowers/WFlowers.htm)\n\n"
    },
    {
      "time": "21 Oct 2006 — 8:47am",
      "content": "I see your point.\n\nBut as a comparison, one sees \"Q\" but when typing sees \"q\" on the latin keyboard. I do not think this is too confusing.\n\n\\>\\>Number wise, I do not see any awkwardness in the current Arabic System.\n\nI have witnessed many confused Arabic numerals users. They type \"78\" but see \"87\". As you and I observed, it is an unsolvable problem because Arabic numbers are typed 50% RtL and LtR. So why complicate our life. Let’s type numbers like we did in the Arabic typewriters. But lets have bidi as an option \\*not default\\*\n\nI think bidi was injected \"as requirement\" for mixing Latin with Arabic not for the numbers.\n\n-Saad\n\n"
    },
    {
      "time": "21 Oct 2006 — 9:24am",
      "content": "\\>But as a comparison, one sees “Q” but when typing sees “q” on the latin keyboard. I do not think this is too confusing.\n\nOn most full size keyboards the UC letters are positioned at the top left part of the key designating they are accessed via the 'shift' state.\n\nCheers, Si\n\n"
    },
    {
      "time": "21 Oct 2006 — 9:47am",
      "content": "\\>\\>On most full size keyboards the UC letters are positioned at the top left part of the key designating they are accessed via the ‘shift’ state.\n\nToday, keyboards in the US show UC only. I ordered thousands since the eighties. Typewriters did show both as I remember.\n\nStill I am not objecting to using keyboards with non isolated shapes. In our virtual keyboards, [http://arabetics.com/java/NAIM.html](http://web.archive.org/web/20150415084621/http:/arabetics.com/java/NAIM.html \"http://arabetics.com/java/NAIM.html\") , we chose (to save time and for speed) not to use gifs for keys. Instead we are generating them via XML using system fonts. We could force non isolated shapes if font embedding on the web was decent. As you can see we had to choose Java to embed our fonts.\n\n-saad\n\n"
    },
    {
      "time": "21 Oct 2006 — 12:16pm",
      "content": "\\>Today, keyboards in the US show UC only.\n\nProbably beacause most 4+ year olds know the connection between the U & lc shapes of the letters - why add noise to the keyboard by adding the lc? However the connection between '\\*' and '8' is not so obvious hence the regular and the shift state both being printed ont he keys.\n\n\\>keyboards in the US\n\nWhich country shows the lc?\n\n"
    },
    {
      "time": "21 Oct 2006 — 12:42pm",
      "content": "Si wrote:\n\n\\>\\>Probably beacause most 4+ year olds know the connection between the U & lc shapes of the letters - why add noise to the keyboard by adding the lc? However the connection between ‘\\*’ and ‘8’ is not so obvious hence the regular and the shift state both being printed ont he keys.\n\nI think you have missed the point, Si. I replied to Aziz's post which stated that showing an isolated form Arabic letter on my virtual keyboards while displaying a different initial shape, was confusing. I said:\n\n\"But as a comparison, one sees “Q” but when typing sees “q” on the Latin keyboard. I do not think this is too confusing\"\n\nI am not proposing the addition of LC to current US keyboards. We are basically in agreement.\n\n-Saad\n\n"
    },
    {
      "time": "21 Oct 2006 — 8:48pm",
      "content": "At 5:40am, Saad Abulhab said:  \nIt’s MAIN GOAL to make a USER and LEARNER not overwhelmed by awkward glyph changing so he/she can concentrate on learning the shapes.\n\n3+ hours later, Saad Abulhab said:  \nBut as a comparison, one sees “Q” but when typing sees “q” on the latin keyboard. I do NOT think this is TOO CONFUSING.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nNow I come to understand how eye-opening NAIM is!  \nA must-to-have not only by the 4+year old but for the 40+year also.  \nUS-Utility-Patent-Pending.\n\n[Flowers](http://web.archive.org/web/20150415084621/http:/www.crauswords.com/flowers/WFlowers.htm) to All\n\n"
    },
    {
      "time": "21 Oct 2006 — 9:54pm",
      "content": "\\> I am not proposing the addition of LC to current US keyboards. We are basically in agreement.\n\nWasn't arguing just offering my explanation for Latin keyboard oddness. Still interested if any language prints lc (or equiv thereof) decals on their key caps.\n\n"
    },
    {
      "time": "21 Oct 2006 — 11:33pm",
      "content": "Sii, Arabic Keyboard shows English UC on the top left and Arabic Standalone letters on the bottom right part of the key.\n\nSo, by adding noise, I guess Saad means adding the initial forms of Arabic letters on the top right part of the key, as in old English-free Arabic Typewriters where most letters were represented by 2 forms save for 3'ain (and Ghain) 2 keys were used: one key for the initial and isolated final form and another key for the middle and connected final form.\n\n"
    },
    {
      "time": "22 Oct 2006 — 5:24am",
      "content": "Aziz wrote:\n\n\\>\\>Now I come to understand how eye-opening NAIM is!  \nA must-to-have not only by the 4+year old but for the 40+year also.\n\nNAIM is an input METHOD and OPTION. OPTION means it is not a MUST. Except for those who are unable to see more than one color. Our JAVA utility is a \\*prototype\\* demonstrating that method not proposing a new keyboard. It was you who complained that on our VK we had isolated forms and started the discussion about keyboards not the method. We explain to Si that we had to use the default commonly used Arabic keyboard shapes because XML was the least painful way to generate the keys via web. Our comments about \"q\" and \"Q\" do not contradict each other, they were in response to your complain.\n\n\\>\\>US-Utility-Patent-Pending.\n\nLet us add to your information that U.S. Patent 4,670,842 awarded years ago to Metwaly of IBM was for creating a method that does what NAIM does differently. If Giant IBM thinks it is worth patenting, why should I be bothered by your sarcastic noise? (if you would excuse our straight forwardness -:)\n\n-Saad\n\n"
    },
    {
      "time": "22 Oct 2006 — 8:52am",
      "content": "\\>If Giant IBM thinks it is worth patenting\n\nIBM holds more than 40,000 patents ( [see](http://web.archive.org/web/20150415084621/http:/www.infoworld.com/article/05/01/12/HNpatentreaction_1.html)) and generates a billion dollars a year licensing them - I'm sure they'd patent their own grandmother if they thought they'd get away with it. :-)\n\n"
    },
    {
      "time": "22 Oct 2006 — 9:02am",
      "content": "The way the patent office works (using the term very loosely indeed) they <cite>could</cite> get away with it. It's just that granny simply isn't a marketable product. Anymore.\n\nhhp\n\n"
    },
    {
      "time": "22 Oct 2006 — 9:05am",
      "content": "Saad, I loved your straightforwardness since our first communication to this point of time.  \nHow happy-go-lucky you are with the XT2XP-Screw and Throw G.I.A.N.T IBM.  \nPeace with [Flowers](http://web.archive.org/web/20150415084621/http:/www.crauswords.com/flowers/WFlowers.htm)\n\n"
    },
    {
      "time": "22 Oct 2006 — 11:06am",
      "content": "Saad, I tried the webpage with the latest Firefox (v1.5.0.6) on Mac, and it doesn't work. Is there any change you can fix this? Thanks.\n\n"
    },
    {
      "time": "22 Oct 2006 — 5:48pm",
      "content": "\\>\\>I’m sure they’d patent their own grandmother if they thought they’d get away with it. :-)\n\nIsn't that the same with the rest of them? Just take a look at the Adobe products, 100s of patents for each product -:)\n\n\\>\\>Saad, I tried the webpage with the latest Firefox (v1.5.0.6) on Mac, and it doesn’t work. Is there any change you can fix this? Thanks.\n\nMiguel, I am working as we speak on the Firefox on the Mac after wasting my time on Safari. This Java/swing project, which I have worked on since March, serves antialiased fonts to display and edit with, keyboards & keymaps, input and ordering methods, email text, and more. It was a challenge to make it work on two browsers on Windows!  \n [http://arabetica.com/applet\\_info.html](http://web.archive.org/web/20150415084621/http:/arabetica.com/applet_info.html \"http://arabetica.com/applet\\_info.html\")\n\n-Saad\n\n"
    },
    {
      "time": "22 Oct 2006 — 7:09pm",
      "content": "Saad, IIRC, Bitstream has/had something called Jet, which was Java code for typography. I actually licensed it once (it was free, at least at launch) but never got around to using it, but I remember it was Unicode and pretty savvy (including bidi I think).\n\nhhp\n\n"
    },
    {
      "time": "22 Oct 2006 — 7:42pm",
      "content": "I remember it years ago. I was hopeful to use it but I gave up because it was taking forever. The first similar applet was done by Xerox, then another by IBM, then an Israeli company, Slangsoft, out of business since 2000?, also had such applet.\n\nBut in my project I need more than bidi which is the default java behavior. We needed to undo the \\*anti option\\* limitations imposed on Arabic by current solutions. Our applet does plenty more.\n\n-Saad\n\n"
    },
    {
      "time": "24 Oct 2006 — 8:05am",
      "content": "Saad, with NAIM, I sincerely recommend marketing 2 kinds of Transparent Stickers: One kind with 2 letters per key for the English-only PK and another with initial letters for the English-Arabic PK.  \nHope I wont be accused of adding \"Sarcastic noise\" again.  \nHappy Marketing\n\n"
    },
    {
      "time": "24 Oct 2006 — 8:29am",
      "content": "Salam Aziz. Eid Mubarak\n\nI have noticed that you are Iraqi too, like me. You attended Univ of Basrah 76-79. I attended Univ of Baghdad 76-79 too. Another rare 58 survivor who quits in that pre disaster year, 1979!\n\nThanks for the advice. I work few hours a day for free just to serve the great Arabic script. Marketing? we can not afford making business of typography. That requires money and full time attention.\n\nIn sha'a aalah, in a next update I will make two version of the virtual keyboards.\n\n-Saad\n\n"
    },
    {
      "time": "24 Oct 2006 — 10:30am",
      "content": "May I extend the same sentiments to you also.  \nApologies with a [Postcard](http://web.archive.org/web/20150415084621/http:/typophile.com/node/28985)\n\n"
    }
  ]
}
