{
  "id": "2895",
  "title": "A1 under construction",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": " **Hi!**   \nI've been following the discussions on this forum for a while now - and it has been very inspiring to see the work in progress here.   \nI've been working on this font (working title: A1) for a couple of weeks and would like to have some critique. The missing glyphs of the l/c plus all of the u/c glyphs still need some (lots of) work, but I would like to hear your comments before I move along.   \nThe font is partly based on the _superellipse_ (thanx to _Herman Zapf_ and this discussion board for introducing me to the superellipse) and its stems and hairlines has the same width as _Helvetica Neue 55 Roman_ - so the uploaded image is an example of A1 roman (regular). Other weights will perhaps follow.   \n   \n**Tor**\n\n<center><table border=\"1\"><tr><td>\n<img src=\"http://web.archive.org/web/20150414172139im_/http:/www.typophile.com/forums/icons/mime_gif.gif\" align=\"LEFT\" alt=\"application/x-shockwave-flash\">Font A1.swf<br><a href=\"http://web.archive.org/web/20150414172139/http:/www.typophile.com/forums/messages/29/font_a1.swf\"><b>font_a1.swf</b></a> (4 k)</td></tr></table></center>!-/attachment-!\\>!-attachment:\\> \n",
  "author": "tor",
  "time": "2 Sep 2002 — 11:17am",
  "uid": "512",
  "comments": [
    {
      "time": "2 Sep 2002 — 11:47am",
      "content": "I think this is pretty cool.   \nReminds me a bit of FF Signa, although it's more \"free\".   \n   \nhhp\n\n"
    },
    {
      "time": "2 Sep 2002 — 2:10pm",
      "content": " **Hello Hrant**   \n   \nThank you for the kind words. What exactly do you mean by \"free\"?   \n   \nI'm wondering if there isn't a problem with the arm of the l/c \"e\" - because of being parallel to the baseline it seems to \"hang\" under it - especially if followed by a round shape (the bowl in g or q).   \n   \n ![A1.gif](http://web.archive.org/web/20150414172139im_/http:/www.typophile.com/forums/messages/29/2522.gif)   \n   \nAnd what about the \"a\" - it's the only glyph that has a terminal - that is maybe too exotic if its the only terminal in the whole face?   \n   \nBy the way: FF Signa is drawn by danish designer _Ole Soendergaard_ and I must admit that I admire that particular face quite a lot. This shouldn't be too obvious though ...   \n   \n**Tor**\n\n"
    },
    {
      "time": "2 Sep 2002 — 2:18pm",
      "content": "\\> What exactly do you mean by \"free\"?   \n   \nLess rigid.   \n   \nI think your \"e\" is fine - maybe a bit wide.   \nThe \"a\" has a terminal? Is it in white? :-/   \n   \nhhp\n\n"
    },
    {
      "time": "2 Sep 2002 — 3:26pm",
      "content": "- Oh I think I meant a spur ...   \n   \n**Tor**\n\n"
    }
  ]
}
