{
  "id": "28952",
  "title": "Output to Lino \"RC\" Paper and Velox: still kicking, and not too expensive!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "When it comes to producing typeface specimens, nothing beats direct lino or velox output to white paper. Crisssssp black-on-white. The problem is that these services have become extremely hard to find. Even if you manage to dig up pricing for those services on a website, chances are very high that when you contact them they'll say \"we don't do that any more\". However, after a couple of dozen calls and emails I have some good news!\n\nThe least expensive place I've found so far is this:  \n [http://www.dsbureau.com/cat03.php](http://web.archive.org/web/20110525062027/http:/www.dsbureau.com/cat03.php \"http://www.dsbureau.com/cat03.php\") \\_  \nIt's in Houston, Texas. I'm in the process of asking them how much  \nit would cost to mail the output within the US, and how they would  \npackage it to avoid damage.\n\nAnother place I found was in Madison, Wisconsin:  \n [http://www.porttoprint.com/imgsttng.html](http://web.archive.org/web/20110525062027/http:/www.porttoprint.com/imgsttng.html \"http://www.porttoprint.com/imgsttng.html\") \\_  \nThe guy is very friendly, and has already agreed to: lower the price for tabloid prints to $20, for the 2400dpi output; and mail the output within the US for less than $5, with proper protective packaging.\n\nIf you get in touch with one of those places please let them know I referred you.\n\nI also actually found a place in LA that does velox, but he charges $20 per letter-size output, and you have to have a film of the page made first, which costs around $15 ($20 at their place), plus that makes it second-generation. The only advantage of velox is that the paper is thicker (AFAIK), so it's probably not worth it.\n\nhhp\n\n",
  "author": "<a href=\"/web/20110525062027/http://typophile.com/user/1250\" title=\"View user profile.\">hrant</a>",
  "time": "<br>",
  "uid": "1250",
  "comments": [
    {
      "time": "",
      "content": "Thanks for doing the research. I'll keep those guys in mind.\n\nVelox can fade quickly too.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Ah, to bad I don’t live in Texas ;-)\n\n"
    },
    {
      "time": "",
      "content": "I know of someone who is trying to sell a Dolev Rip and Processor. (I believe). Why don't a bunch of you type guys buy it from him and then just figure out how to run it and keep it running. ;^)\n\n"
    },
    {
      "time": "",
      "content": "Or maybe he'll just keep it if we give him enough business. :-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "No. They are no longer in the business. Unfortunately, they have a bunch of equipment that needs to be sold.\n\n"
    },
    {
      "time": "",
      "content": "There will most likely be several \"attractive\" deals on film/paper output units as more and more printers migrate to CTP (computer-to-plate) technology. As handsome as RC apper output is, it comes with a knotty problem: the chemistry used to develop and fix the paper, which need to be disposed of properly. Fixer is normally processed to extract the silver it contains, and people who do this for a living often will take it off your hands for nothing. Exhausted developer, on the other hand, is really nasty stuff and has no commercial value.\n\n"
    },
    {
      "time": "",
      "content": "Some related news at the end of here:  \n [http://typophile.com/node/27813](http://web.archive.org/web/20110525062027/http:/typophile.com/node/27813 \"http://typophile.com/node/27813\")\n\nhhp\n\n"
    }
  ]
}
