{
  "id": "28962",
  "title": "Wat is er aan de hand, moeder?...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "(See the opening sentence of the second image)  \n..this means: “Mother! what’s happening? what’s going on?”  \nOr better: “What’s up” (literally)\n\nThe images were sent to me by a collegue.\n\n ![](http://web.archive.org/files/raffia_mhiip_1_6622.jpg)\n  \n\n ![](http://web.archive.org/files/raffia_mhiip_2_3666.jpg)\n\n",
  "author": "<a href=\"user/6083\" title=\"View user profile.\">enne_son</a>",
  "time": "<br>",
  "uid": "6083",
  "comments": [
    {
      "time": " 21 October, 2006 - 8:44am",
      "content": "Raffia initials from Lettergieterij Amsterdam. A rare ugly piece of Dutch type inventions. :-)\n\n— [astype.de](http://web.archive.org/web/20061114142332/http:/www.astype.de/)—\n\n"
    },
    {
      "time": " 21 October, 2006 - 9:49am",
      "content": "“Raffia initials from Lettergieterij Amsterdam”\n\nYes, but _what’s up_\n\n"
    },
    {
      "time": " 21 October, 2006 - 11:39am",
      "content": "Reminds me of the retail-strip signboards where they run out of Ms and flip the W.\n\n\\*\\*\\*\n\nLooking at the second page, and changing the subject, do you think that the combination [„W] needs kerning?\n\n"
    },
    {
      "time": " 21 October, 2006 - 12:55pm",
      "content": "\\> ugly\n\nPeter, you’re just going to ignore that?\n\nhhp\n\n"
    },
    {
      "time": " 21 October, 2006 - 1:55pm",
      "content": "Nice pages. I think I like Raffia in a 2nd color better. I have not seen enough examples of use to know for sure.\n\n"
    },
    {
      "time": " 21 October, 2006 - 2:36pm",
      "content": "Both are rotated, aren’t they? The W is a rotated M, and the M is a rotated W. Reminds me of Gill Sans, where they had to add notes to the side of the lead letters to distinguish uppercase I from lowercase l from numder 1. :^)\n\n"
    },
    {
      "time": " 21 October, 2006 - 3:02pm",
      "content": "Did Raffia have a W & they just did that for fun? Or is Raffia’s W meally the M turned over in fact?\n\n"
    },
    {
      "time": " 21 October, 2006 - 3:21pm",
      "content": "Yes Yves and Eben, they’re both rotated and Raffia has a W and an M. I suspect the compositor saw the M as a W and vice versa. So the inversion was not accidental or out of need.\n\nHrant, I decided to let the ‘ugly’ stand because the smiley made me think Andreas was trying to get a rise out of me.\n\nEben, here it is in colour.\n\n ![](http://web.archive.org/files/lucifer_actopener#1_6558.jpg)\n\nAndreas, still ugly?\n\nNick, it does seem like the ,,W needs kerning. Anyone know what was normative practice in settings with this style of open quote marks?\n\n"
    },
    {
      "time": " 21 October, 2006 - 3:33pm",
      "content": "I thought so. All the other letters I had seen up till now look well grounded. The spun letter does not.\n\nRE; Color: Ah, yes. Tasty.\n\n"
    },
    {
      "time": " 21 October, 2006 - 4:12pm",
      "content": "Than I reviewed the specimen from Lettergieterij Amsterdam, I was stunned about these initials and the gap between the rest of their type portfolio.\n\nYes, the second layout shows an tastefull usage. But overall, the design of the initials reminds me on barbwire, brambles or scratches. If you print them black, they have “dark” power like a strong sign or statement.\n\nI know nothing about the first book and its purpose, but the initials look out of place.\n\n— [astype.de](http://web.archive.org/web/20061114142332/http:/www.astype.de/)—\n\n"
    },
    {
      "time": " 21 October, 2006 - 5:30pm",
      "content": "Andreas, viewed as an entire alphabet on a specimen sheet at smaller sizes the letters don’t present themselves well. One by one with ample whitespace they are in my opinion quite stunning.\n\nMy presentation at ATypI in Vancouver 2003 should clarify what these initials should remind you of.\n\nThe book the upside-down samples come from is:\n\n ![](http://web.archive.org/files/naimeh_najafi_5076.jpg)\n\n_My Heart is in Persia_ by Naimeh Najafi (autobiography)\n\nI take it the Persian reference was the reason for the choice of Raffia Initial. The Raffia Initials share some stroke contrast and ‘role architectural’ characteristics with Arabic calligraphy. However, they are in my opinion not properly or custom fitted. I’ll ask the person who provided me with the scans to show me the fit on other chapters.\n\nThe other sample was for a bibliophile production, where the creator of the initials was also the typographer (and illustrator) of the book.\n\nJust noticing this: The Raffia upside-down W is in some ways more in tune with the swash M used on the dust jacket than the Raffia M is!\n\n"
    },
    {
      "time": " 21 October, 2006 - 9:17pm",
      "content": "You’re all waking a wountain out of a wolehill.\n\n"
    },
    {
      "time": " 21 October, 2006 - 9:21pm",
      "content": "nah, just milking some comic relief\n\n"
    }
  ]
}
