{
  "id": "28983",
  "title": "Good French and Dutch Fonts",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello,  \nI am doing a book on my recent travels to Europe. We went through Amsterdam and Paris, and I would like for the sans serif to be from one country and the serif to be from the other, but I am not sure where to start. The two fonts need to work with each other, but if possible, keep a characteristic from that region. If anyone knows any good fonts from these countries please let me know. THANKS.\n\n",
  "author": "<a href=\"user/9381\" title=\"View user profile.\">Joseph</a>",
  "time": "<br>",
  "uid": "9381",
  "comments": [
    {
      "time": " 22 October, 2006 - 5:48pm",
      "content": "  \n\n"
    },
    {
      "time": " 22 October, 2006 - 6:40pm",
      "content": "A wonderful sans from France is Peignot…..\n\nLinda\n\n"
    },
    {
      "time": " 22 October, 2006 - 7:00pm",
      "content": "For France and the Netherlands you’re spoilt for choice - what’s your budget?\n\n"
    },
    {
      "time": " 22 October, 2006 - 8:42pm",
      "content": "It’s hard to get more French than Mandel’s flare-serif, which he uses for the body text of his book. But I forget the name. :-/ ITC Mendoza has a similar flavor.\n\nDutch: too many great choices! I might actually go for one that’s not too mainstream. Do you want oldschool or newschool?\n\nBut yeah, what’s your budget? :-/\n\nhhp\n\n"
    },
    {
      "time": " 23 October, 2006 - 5:37pm",
      "content": "Being that this is a personal project my budge can increase with desire. I want to make a nice book so if I love a font and feel it as the right one, I will spend what I need. All within reason though.\n\nAs for oldschool or newschool, I feel as if my photography in the book is very modern and personal, so maybe a more oldschool font will help to bring a balance to the book?\n\ni looked at Mendoza and feel that it could be a good font for my use. So maybe if there is a good font from the Netherlands that would compliment it, I would love to know what it would be. The font has to work as a display size, and will be used more for short headlines that will included numerals.\n\nThanks so much for your expertise\n\n-Joe\n\n"
    },
    {
      "time": " 23 October, 2006 - 10:09pm",
      "content": "Would you use Mendoza for the text or for display? That would depend on things like the amount of text. In any case, I can’t immediately think of a Dutch face (old or new) that would nicely match Mendoza. Maybe FB Proforma\\*? Anyway, a very oldschool Dutch font is Fleischmann (even though the guy was actually German).\n\n\\* [http://www.fontbureau.com/fonts/Proforma](http://web.archive.org/web/20061116103930/http:/www.fontbureau.com/fonts/Proforma)\n\nhhp\n\n"
    }
  ]
}
