{
  "id": "28980",
  "title": "fonts and design for official documents",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello everyone,\n\nalthough I have a great passion for typography, and have read many books (including elements of typographic style of course) I am not a professional.\n\nI work in the public sector. Everyone uses Times New Roman + Windows. I am trying to change that. A recent official report was produced on my Powerbook using Baskerville and Word 2004.\n\nBut I would like a more coherent approach, so the question is: which font should I try to introduce - at least in my office (15 people) - that will work smoothly on Windows 2000/XP and that is good for short memos (2-5 pages), letters, papers (10+ pages)? the version of Baskerville I used does not work on Win (besides the licensing problem).\n\nDo you have any advice on the format of the documents?\n\nThanks and best regards\n\nCarlo\n\n",
  "author": "cviviani",
  "time": "22 Oct 2006 — 4:09pm",
  "uid": "3930",
  "comments": [
    {
      "time": "22 Oct 2006 — 6:05pm",
      "content": "Ciao Carlo, usa la font Palatino 11 o 12 punti ma stai attento all'interlinea  \n(aumentala un po') e ai margini (la giustezza non deve mai essere eccessiva);  \npuoi usare un corpo 9 per le note.  \n [http://www.kayskreations.net/fonts/fonttb.html](http://web.archive.org/web/20141031200738/http:/www.kayskreations.net/fonts/fonttb.html \"http://www.kayskreations.net/fonts/fonttb.html\")\n\n"
    },
    {
      "time": "22 Oct 2006 — 6:39pm",
      "content": "I need to improve my Italian before we visit the Cinque Terra, but I think I agree with Alessandro: Palatino at 11 or 12 pt, right? ;-) Personally, I like Palatino paired with Lucida Sans.\n\n(Although given a choice, I'd pair up Palatino with Optima....)\n\nLinda\n\n"
    },
    {
      "time": "22 Oct 2006 — 9:14pm",
      "content": "What's wrong with Georgia? Have you tried the 'ClearType' fonts? Why Baskerville? Who is your audience? What tone are your speaking to them in? Why? Is it more imoprtant that the documents work on screen or in print?\n\nIn general the trick will be geting a typeface you like in print & one which which is well hinted well for screen too. That reduces your number severely. PLUS and this is faustian part - the best typefaces in print are not going to match from screen to page all that well. In order to get type to go from screen to print and match well ( lines having the same # of characters - WYSIWYG etc.) all kinds of compromises were made. Those compromises mean less lovely faces in print in general.\n\nI guess that you could call fontfont and ask them if any of their faces have been extensevely hinting now...\n\nBut really, I can't suggest anything too seriously because I don't know nearly enough about your goal.\n\n"
    },
    {
      "time": "22 Oct 2006 — 9:54pm",
      "content": "I have a feeling that cviviani is trying to find alternatives to the mainstay typefaces that are installed on Microsoft Office. Unfortunately, in a business, office, and public sector environment, if you want your documents to be consistent, there's very little in the way of straying from that frustratingly narrow selection.\n\nThe typefaces we use for various projects that require this kind of compatibility include Verdana, Trebuchet for screen and Powerpoint presentations; and serifed Times New Roman or Georgia for print. I'm loathe to say this, but as much as I limit Arial's presence by substituting Helvetica (whose Helvetica is anyone's guess), there's no escaping it sometimes in such environments.\n\nI've always tried getting Garamond to work, but even though it is packaged in with many Office programs, I've had problems. If I can get it to work, I also try to replace Book Antiqua with Palatino.\n\nThe United States government offices made it official that all documents were to be printed in Times New Roman 14pts (proof that most of the elected officials here are blind) instead of the previous Courier 12pts. I'd love to know what they decided on official line spacing...\n\n"
    },
    {
      "time": "22 Oct 2006 — 11:49pm",
      "content": "Luc(as) de Groot had some very nice faces - and I think some of them were hinted quite a lot - but they are not serifs much less Baskerville.\n\n"
    },
    {
      "time": "23 Oct 2006 — 12:48am",
      "content": "Luc(as) de Groot does have some very nice typefaces. But you know what? I have a feeling none of his typefaces would be feasible in say a Powerpoint presentation 'template' that goes from office to office.\n\nI think in this situation, aesthetics takes a back seat to ugly utility.\n\nIf we are only confining the typeface for an office of 15, I would say, introduce the font. But if these documents, Word, Powerpoint, etc need to be moved frequently from one place to the next with no guarantee that all the offices have this font installed, I'd recommend staying with the 'basics'.\n\n"
    },
    {
      "time": "23 Oct 2006 — 1:22am",
      "content": "There is ALOT you can do with basic fonts if you take the time. And it's worthwhile.\n\n"
    },
    {
      "time": "23 Oct 2006 — 2:32am",
      "content": "Thank you everyone for your useful (and prompt) comments.\n\nI think the suggestion of staying with the \"basics\" is the most realistic - although I'm not very happy with it. I agree that the version of Garamond shipping with Word has problems, and most of all I don't like it.\n\nAudience - target of the documents vary, from the EU Commission to other Ministries, to my Minister. So the only ways to ensure consistency would be to use PDF or stick to the basic set. And PDF is not always suitable, unfortunately.\n\nI will give Georgia a try - anything to avoid TimesNewRoman! For sans, I will use Arial (but I would like Univers...).\n\nSo many beautiful fonts, and so little space to use them... what a pity!\n\nBest,\n\nCarlo\n\n"
    },
    {
      "time": "23 Oct 2006 — 6:05am",
      "content": "_I think the suggestion of staying with the “basics” is the most realistic - although I’m not very happy with it._\n\nHmmm. factors, factors, factors... If you have purchasing power, I would suggest licencing some type (what a novel idea!) that you like. Or, to find fonts that come bundled with your (Microsoft) software, visit this page: [http://www.microsoft.com/typography/fonts/default.aspx](http://web.archive.org/web/20141031200738/http:/www.microsoft.com/typography/fonts/default.aspx \"http://www.microsoft.com/typography/fonts/default.aspx\").\n\n"
    },
    {
      "time": "23 Oct 2006 — 7:16am",
      "content": "I completeley agree with the novelty history of Palatino and Paul d. Hunt !\n\n"
    },
    {
      "time": "23 Oct 2006 — 7:57am",
      "content": "<cite>Re: There is ALOT you can do with basic fonts if you take the time. And it’s worthwhile.</cite>\n\nBut of course. It can be argued that making Times New Roman sing is a much harder AND rewarding task.\n\nBut then again, I wasn't recommending TheSans was I?\n\n"
    },
    {
      "time": "23 Oct 2006 — 12:24pm",
      "content": "In regard to ensuring consistency without knowing what fonts other groups have available, you don't necessarily have to use PDF if you're willing to and can use TrueType fonts. They can be embedded in Word and PowerPoint so that people without the fonts on their computer can at least open and view the files. Given the right font permission level, they could even edit the files. There's more information about embedding, and font embedding permission levels, at [http://www.microsoft.com/typography/TrueTypeEmbedding.mspx](http://web.archive.org/web/20141031200738/http:/www.microsoft.com/typography/TrueTypeEmbedding.mspx \"http://www.microsoft.com/typography/TrueTypeEmbedding.mspx\"), with a link to the Microsoft Font Properties Extension. The extension works with any version of Windows from 95 to XP and lets you see the font's embedding permission, which can be hard to discover otherwise.\n\nIn Word or PowerPoint, you set the embedding option by going to Tools \\> Options \\> Save \\> Embed TrueType fonts. In Word, this stays in effect until changed back; in PowerPoint, it only affects the current document. You can also change Word's normal.dot template this way.\n\nNote that Word and PowerPoint will only embed TrueType fonts, not PostScript or OpenType fonts with an OTF extension. Embedding OpenType fonts with a TTF extension seems to work, though. We don't use Macs, so I can't speak to Mac--Windows compatibility of embedded fonts.\n\n"
    },
    {
      "time": "23 Oct 2006 — 2:18pm",
      "content": "Yeah, embedding is one way to go, but we've found it difficult to teach clients how to embed fonts on their own. Unless they've got people policing the standards and guidelines set, the rules and regulations ALWAYS get violated by someone in the company.\n\nI think somewhere along the line, and this was probably a breach of license and ethics, a client wanted to force the issue of using their fonts. We tried converting Postscript fonts to Truetype via Fontographer to embed into the documents and it didn't work. Any explanations why this might be the case?\n\nAnd Mac to PC Powerpoint compatibility is pretty troublesome.\n\n"
    },
    {
      "time": "23 Oct 2006 — 2:30pm",
      "content": "One other thing: in your admirable desire for typographic distinction, don't go overboard. Choose something different but modest and robust. For one thing, a Baskerville that looks good on office memos isn't a good Baskerville. I might consider Charter.\n\nhhp\n\n"
    },
    {
      "time": "23 Oct 2006 — 4:46pm",
      "content": "Sorry, no clue on the PostScript to TrueType conversion. I'd expect that as long as Windows recognizes it as a TrueType font and installs it, Word would accept it, too, unless the embedding permission was set to Restricted. Were you able to use the font at all, or just not embed it?\n\n"
    },
    {
      "time": "23 Oct 2006 — 5:39pm",
      "content": "We were able to use the font in the program, but couldn't embed it with any documents.\n\n"
    },
    {
      "time": "24 Oct 2006 — 3:09am",
      "content": "I agree - I try not to exceed in enthusiasm... I would also have liked Adobe Caslon but in word it's not easy to use, or Minion (same problem in Windows).\n\nBaskerville was a choice for this document in order to reduce the number of pages (which was a specific need) while mantaining readability. Baskerville 11 (MacosX version, I was not able to understand to which foundry it belongs) saved 10 pages with respect to TimesNR 12. I didn't know Charter, will explore.\n\nOh, and by the way: anyone knows why Filosofia doesn't work in Word?\n\nbest,\n\nC\n\n"
    },
    {
      "time": "24 Oct 2006 — 7:58am",
      "content": "Be very careful about quick conclusions concerning economy. Unless you have a mandated point size and you want to \"cheat\" by using a font that's unusually large or small on the body (which roughly translates to a font with a large or small x-height) most of any savings in space will come at the expense of readability. Times for example is actually very well honed to saving space, in \"normal\" typesetting situations. Baskerville tends to be more elegant but also less efficient in then end, once you facor in apparent size, which is strongly -although not completely- correlated to readability. Generally, the more elegant a font, the better it is for larger sizes.\n\n\\> anyone knows why Filosofia doesn’t work in Word?\n\nIt's because Filosofia doesn't work in any app, really. ;-)  \nYou don't want a Didone for text.\n\nhhp\n\n"
    },
    {
      "time": "24 Oct 2006 — 8:19am",
      "content": "\\>Audience - target of the documents vary, from the EU Commission to other Ministries, to my Minister.\n\nThis limits your options further as I assume you need to support all the EU languages and as the EU is expanding that includes a few characters that aren't even in the WGL4 glyph set.\n\n\\>Everyone uses Times New Roman + Windows. I am trying to change that.\n\nI'd leave that to Apple if I were you, they have a larger budget and can achieve this goal with some \"humorous\" TV advertisements and maybe some magazine ads. I’d be inclined to work in the same environment (same limitations, same printers, same fonts, same hardware) as your team, which means producing the templates and such using a Windows machine.\n\nCheers, Si\n\n"
    },
    {
      "time": "24 Oct 2006 — 10:43am",
      "content": "\"We tried converting Postscript fonts to Truetype via Fontographer to embed into the documents and it didn’t work.\"\n\nSolipsism, did you check the permission flags in the font itself (e.g. \"Restricted license embedding\" and \"Editable embedding\" and so forth)?\n\n"
    },
    {
      "time": "24 Oct 2006 — 12:24pm",
      "content": "Hmm... I don't think that crossed anyone's mind to check. This was a client from a couple years ago. Now-a-days, I try to avoid Powerpoint work if I can.\n\nBut I'll keep this in mind should this problem present itself again...\n\n"
    },
    {
      "time": "24 Oct 2006 — 2:07pm",
      "content": "I've been down a somewhat similar road, trying to find an alternative to TNR. I do mostly technical documentation and new business proposals with extensive engineering and scientific content. The problem I find is that a lot of the classical book fonts -- Bembo, Baskerville, Century -- just don't seem appropriate when used for our content. I can't say exactly why that is; maybe \"too bookish\" and \"not technical enough.\" I also tried a number of modern fonts from foundries like DTL, FontFont, H&FJ, and so on. There again, beautiful fonts that just don't seem appropriate. Or, more probably, I'm just too conservative. But if I am, then so is my audience.\n\nI'm also constrained by the absolute need to embed fonts in Word and PDF documents for delivery to customers. That means TrueType or OpenType in TTF format. It also lets out fonts like Mercury that I'd kill to use. Mercury is already expensive enough, and there's no way I could convince management to shell out the additional money for an embedding license when the Windows core fonts are \"free and just as good.\" For other fonts, there's no embedding possible at all.\n\nAnother part of the problem is that the customers often specify \"12 point TNR or equivalent.\" Many fonts -- Sabon, for example -- set a half point or more larger than TNR, so 11.5 point Sabon is about the same as 12 point TNR in terms of characters per line and page. So then I have the problem of convincing a government agency that 11.5 is really the same as 12.\n\nBottom line is that fonts like Granjon, Kis, and Janson Text seem to be the best compromise. Sometimes Caslon seems like it's OK, sometimes not. Times Ten is perhaps best of all for my situation, but there I have the 11.5 versus 12 problem.\n\n"
    },
    {
      "time": "24 Oct 2006 — 3:18pm",
      "content": "Winterbottom: Have you glanced at the technical and scientific typesetting that comes from the publishers Springer Wien? Some of it is quite tastefully done, some using TeX.\n\n"
    },
    {
      "time": "24 Oct 2006 — 4:25pm",
      "content": "or.....\n\navoid the entire mishigas and toss yer MS Office product and replace it with Open Office Suite, a complete office suite in a single package (no 'pro' version). Open Source, free, faster, simpler, completely compatible with MS word products. Comes with a nice selection of fonts including my own favorite for everyday serif roman... Gentium; also Open source, also Free (with apologies to all those that find the 'F' word offensive). No licensing crappola.\n\ngeo.\n\n"
    },
    {
      "time": "24 Oct 2006 — 7:05pm",
      "content": "Ben, not sure if your suggestion is serious, but as these guys have already licensed Office (with tax payers money), why would they ditch the product just to pick up Gentium and a bunch of Ray Larabie fonts they can download for free anyway? Also apart from Gentium how many of the Open Office fonts support a pan-european character set?\n\n"
    },
    {
      "time": "25 Oct 2006 — 3:50am",
      "content": "Specifically regarding font embedding in Powerpoint and Word, in my experience it works within Powerpoint but can be unreliable within Word.\n\nBut in short it isn't a great solution and raises as many problems as it solves.\n\nFor example, what happens when an external user copies text set in your embedded font from one document to another they've created themselves, also with embedding turned on? (Not a rhetorical question, I did a load of testing ages ago and can't remember!)\n\nAlso, given that you don't have a choice of which fonts you embed, you can easily end up with massive files (eg. full Arial Unicode font is 22Mb although there is some compression). This is compounded when documents have been edited by several parties with copying and pasting from various sources, you can end up with many redundant fonts included.\n\nThere also is a suspicious lack of documentation available on the nitty-gritty of how it actually works with regard to the different levels of embedding permissions, and it doesn't seem to have been updated for many years, which is why it doesn't work with OTF.\n\nMany large organisations have a two-tier font policy within their VI -- Frutiger for \"pro\" use, or if you can deliver as PDF; Arial for MS Office use, etc.\n\nI would expect MS have come up with something as part of XPS, their \"PDF-killer\", but haven't looked into it...\n\n"
    },
    {
      "time": "25 Oct 2006 — 12:53pm",
      "content": "Solipsism: Thank you for the suggestion. I hadn't specifically looked at Springer Wein before, but I will now.\n\nGeo Ben: I think your suggestion was intended for cviviani and not me, but switching to OpenOffice, in and of itself, wouldn't solve any of the issues I have. Plus, many customers specifically require Microsoft Word format.\n\nelliot100: I agree embedding isn't a panacea; I only mentioned it as a possibility. Most fonts aren't as big as Arial Unicode; when I have a 40 MB Word document, which mine run to, the additional overhead of 100K or so in fonts is hardly noticeable. Also, you don't have to embed the full font; there's an option to only embed the characters in use, but this does make it harder for someone downstream to edit. However, our customers don't touch documents after we deliver them, so this isn't an issue in my case. Re cutting and pasting, I'd have to experiment with fonts having Installable and Editable permissions, but I'm pretty sure that if the permission is Print and Preview, the pasted-in text loses its original font and assumes whatever font is in effect in the target document. In regard to having a lot of fonts that are only used for a few characters or lines of text, the solution would be to apply or reapply styles and make the unnecessary fonts go away, as Word only embeds fonts actually in use.\n\n(Later edit) I seem to have somewhat caused a hijack of the original thread, so perhaps any further technical discussion of embedding fonts in Word should be moved to a new topic.\n\n"
    }
  ]
}
