{
  "id": "28997",
  "title": "Clearview kudos",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I drove to Pennsylvania over the weekend and, as I had hoped, saw some road signage in [Clearview](http://web.archive.org/web/20140713204048/http:/clearviewhwy.com/). It's as good as advertised - much better than Highway Gothic. Some of the warning signs were done up in too light a face, but that was the signmaker's fault, not Terminal Design's. Anyone else see it regularly?\n\n",
  "author": "londontype",
  "time": "23 Oct 2006 — 5:55am",
  "uid": "11256",
  "comments": [
    {
      "time": "23 Oct 2006 — 8:15am",
      "content": "That doggonne James Montalbano might just have something there :-)\n\nChrisL\n\n"
    },
    {
      "time": "23 Oct 2006 — 10:07am",
      "content": "Except for the Shenandoah Valley in full fall splendor it was the highlight of my trip. Clearview has a great **M** and a lovely **l**.\n\n"
    },
    {
      "time": "23 Oct 2006 — 10:11am",
      "content": "I used to see it all the time driving htrough Pennsylvania from New York. No question its more legible than Highway Gothic. My girlfriend and I would play the spot Clearview game on roadtrips. (We're both graphic designers aka _nerds_.)\n\n"
    },
    {
      "time": "23 Oct 2006 — 10:38am",
      "content": "I believe it's not just more legible. It also has just that little bit of style allowable in a font of this type. It's actually attractive. It would be interesting to see if James would admit to this characterstic. Maybe it's just so well thought out and competently done that it can't help being attractive.\n\n"
    },
    {
      "time": "23 Oct 2006 — 11:00am",
      "content": "Well Brad, I'm gald you think it is attractive. When Clearview was discussed on Typographica a while back a lot of folks thought it not.\n\nAS to the too light warning signs, Black letters on light backgrounds (Negative Contrast) are a problem. We have designed a series of ClearviewHwy fonts specifically for Negative Contrast applications (they have a B in the name). All the fonts a a bit bolder and have tighter letterfit. As of this date the FHWA has not approved the negative contrast designs for use, but alot of copies are being licensed, so I think they may be making it onto the roadscape without the Fed approval.\n\nOn another note our ClearviewOne fonts (the general purpose version of the Highway fonts) are being updated to OpenType and should be on our website when our new site goes up in a few weeks.\n\nCyrillic versions are underway and we hope to add Greek this year as well.\n\nJames\n\n"
    },
    {
      "time": "23 Oct 2006 — 11:08am",
      "content": "[http://typographi.com/000931.php](http://web.archive.org/web/20140713204048/http:/typographi.com/000931.php \"http://typographi.com/000931.php\") \\_  \nAll the negative opinions there were a haul of claptrap on the interstate.\n\nStyle: if I remember correctly James had initially toyed with the idea of proposing they use Syntax! :-)\n\nBTW, will the non-Latins be promoted as highway signage in their respective countries?\n\nhhp\n\n"
    },
    {
      "time": "23 Oct 2006 — 11:21am",
      "content": "Maybe most of the Typographica crowd don't have cars! ;)\n\n"
    },
    {
      "time": "23 Oct 2006 — 2:04pm",
      "content": "Yeah, I responded to one of those negative comments on Typographica and got my post deleted!\n\n"
    },
    {
      "time": "23 Oct 2006 — 6:14pm",
      "content": "One of the things I like about Clearview is it basic form similarities to the father of most modern humanist sans faces - Johnston's Underground type. I know Clearview is nothing like a copy of Johnston, that Clearview is much more sophisticated, and that there are many important differences. But the fact that James arrived at his face after exhaustive research and it still resembles Johnston at so many points says something about the genius of Johnston's work, and James's too.\n\n"
    },
    {
      "time": "23 Oct 2006 — 7:17pm",
      "content": "Syntax was originally proposed for the National Park Service. We developed Rawlinson when they decided against it and any other sans solution.\n\nThe Cyrillic and eventually Greek are being created to potentially grow Clearview's use as a roadway signage solution. Who know how it will turn out.\n\nI don't really see the Johnson Underground influence. British Transport was more of an influence.\n\n"
    },
    {
      "time": "24 Oct 2006 — 6:16am",
      "content": "I certainly didn't mean Johnston was a direct influence. But Johnston probably has to be seen as part of Transport's lineage.\n\n"
    },
    {
      "time": "24 Oct 2006 — 10:33am",
      "content": "I don't see many similarities to Transport and Johnston stylistically. Jonhston is far more humanist in its construction than Transport. Transport is a little more draftsman and Akzidenz influenced than Johnston.\n\nI think a better comparison would be to Jock Kinneir's other design Rail Alphabet, which was one of the first sans serif signage faces (if not the first) to create both a negative and positive version of the design at different sizes to account for the optical trick of reversed out type looking larger.\n\n"
    },
    {
      "time": "24 Oct 2006 — 11:31am",
      "content": "Here in Pittsburgh, most signs are in [Interstate](http://web.archive.org/web/20140713204048/http:/www.myfonts.com/fonts/fontbureau/interstate/regular). Some are in Clearview. Makes for a funky highway experience. At least for me....I hope some of it rubs off on other people, too, like my wife, who focus more on driving than on the signs. :)\n\n-Jamie\n\n"
    },
    {
      "time": "24 Oct 2006 — 6:34pm",
      "content": "Jamie,\n\nNone of the signs you are looking at are set in Interstate. Those you identify as such are Federal Highway Standard Alphabet Series Emod, E, D, C or B, sometimes referred to as Highway Gothic.\n\nThe design you refer to as Interstate is a commercial font derived from this design. It has never been used on the roadscape.\n\nJames\n\n"
    },
    {
      "time": "24 Oct 2006 — 8:12pm",
      "content": "Terry - thanks for the reference to the Kinneir's Rail Alphabet. There doesn't seem to much info available about it. I suppose I see the Johnston similarities in the gross forms rather than the finer details.\n\n"
    },
    {
      "time": "25 Oct 2006 — 7:10pm",
      "content": "\"The design you refer to as Interstate is a commercial font derived from this design. It has never been used on the roadscape.\"\n\nThanks for clearing that up.\n\nAs an aside, I found an [online forum](http://web.archive.org/web/20140713204048/http:/knowledge.fhwa.dot.gov/cops/OpsPublic.nsf/discussionDisplay?Open&id=3CEDAEAD34165559852571330067AAE8&Group=signs&tab=DISCUSSION) on which some guys/gals talk about their font issues. Doesn't sound like there's a great system in place to ensure compliance. Makes me wonder if Interstate has slipped onto a sign here or there.\n\n-Jamie\n\n"
    },
    {
      "time": "25 Oct 2006 — 7:46pm",
      "content": "\"The differences aren't as huge as those between Helvetica and Arial\"\n\nWow, the laymen of our dreams!\n\n\\> Makes me wonder if Interstate has slipped onto a sign here or there.\n\nDefinitely possible, since people have even cut the forms by hand:\n\n ![](http://web.archive.org/web/20140713204048im_/http:/typophile.com/files/ca%C3%B1ada_hand_4737.jpg)\n\nhhp\n\n"
    },
    {
      "time": "25 Oct 2006 — 7:54pm",
      "content": "Ah,\n\nThere's your sculpted tilde. Even asymmetrical. Imagine if there were just a recommended alphabet that had to be interpreted by an unknown number of skilled signmakers. Sweet.\n\nThat C isn't regulation either. How old is that sign?\n\n"
    },
    {
      "time": "25 Oct 2006 — 9:38pm",
      "content": "Back when I first realized that all the smaller street signs in Glendale (and maybe further afield, and I do mean field :-) were handmade, an improbable mental image popped into my head, and I've never been able to get rid of it: a man gets a phone call at home from the city, turns to his wife and yells \"hun, thems be needin' a sign fer 'Wabasso' by noon-like Thursdee\", and the somewhat portly and very white woman in the other room whips out here scissors, pulls out the special black sticky paper stuff, and starts a'cuttin'. She used to REE-ly on this fancy maynooal with the pitchurz of how them city folk would rather have the letters on their signs be lookin' like if they had their druthers, but these days she just cuts 'em from her good ol' Germanic memory. Meanwhile, the husband goes to the shed in the back, pushes the goats aside, and PROH-seeds to cut some o' that white plastic or metal or whatever backing. He counts: W-a-b-a-s-s-o, makes 7, so 7 times 3, is 21, plus two inches on each side, makes 25, and WHAM, cuts the COH-rectly sized piece right up, and takes it back in to his old lady, god bless her steady hand.\n\nBTW, that sign is nothing: you should see how distinctly egg-shaped all the \"O/o\"s are around here - it makes you think there was indeed one person doing all of them, and maybe she ran a chicken coop on the side.\n\nI don't know how old they are. But when it comes to \"missing\"  \nshapes, like the tilde, anything can still happen to this day:\n\n ![](http://web.archive.org/web/20140713204048im_/http:/typophile.com/files/ca%C3%B1ada_1_4451.jpg)\n\n ![](http://web.archive.org/web/20140713204048im_/http:/typophile.com/files/ca%C3%B1ada_2_6359.jpg)\n\nAnd here's the cruncher:\n\n ![](http://web.archive.org/web/20140713204048im_/http:/typophile.com/files/ca%C3%B1ada_3_3919.jpg)\n  \n\"Goldangit, just put in a 'y' ya smartass!\"\n\nhhp\n\n"
    },
    {
      "time": "25 Oct 2006 — 11:16pm",
      "content": "God my sides hurt after laughing that hard.... Hrant. Did you take all those?\n\n"
    },
    {
      "time": "26 Oct 2006 — 6:15am",
      "content": "HELP WANTED - PART-TIME SIGNMAKER - Prefer very white woman, portly if possible. Germanic memory a must. Steady hand preferred. Goat ownership OK.\n\nMaybe we shouldn't always share our enduring mental images...\n\n"
    },
    {
      "time": "26 Oct 2006 — 8:20am",
      "content": "All four of those are walking distance from my house - in fact two  \nare visible from it. Who says Glendale doesn't have variety?!\n\nBrad, don't worry, I don't share the really good ones.\n\nhhp\n\n"
    },
    {
      "time": "26 Oct 2006 — 8:34am",
      "content": "We're in trouble if Lozos takes the bait.\n\n"
    },
    {
      "time": "26 Oct 2006 — 8:44am",
      "content": "Now you've done it for sure.\n\nhhp\n\n"
    },
    {
      "time": "26 Oct 2006 — 9:12am",
      "content": "_“Goldangit, just put in a ‘y’ ya smartass!”_  \nLOL. That is some funny sh!t!\n\n"
    },
    {
      "time": "26 Oct 2006 — 11:03am",
      "content": " ![](http://web.archive.org/web/20140713204048im_/http:/typophile.com/files/signer_6587.jpg)\n\nChrisL\n\n"
    },
    {
      "time": "26 Oct 2006 — 11:23am",
      "content": " ![](http://web.archive.org/web/20140713204048im_/http:/typophile.com/files/goats_3883.png)\n\nChrisL\n\n"
    },
    {
      "time": "26 Oct 2006 — 11:29am",
      "content": " ![](http://web.archive.org/web/20140713204048im_/http:/typophile.com/files/Ladyngoats_5813.png)\n\nChrisL\n\n"
    },
    {
      "time": "26 Oct 2006 — 11:43am",
      "content": "chris...I'M AT WORK! shhhhhhh... :)\n\n"
    },
    {
      "time": "26 Oct 2006 — 11:48am",
      "content": "Was that a LOUD guffaw that your boss heard from the above posts or the 2 emails I sent before which brought the heat on you?\n\nChrisL\n\n"
    },
    {
      "time": "26 Oct 2006 — 12:18pm",
      "content": "ROFL. Too funny.\n\nHrant: Up here north of Glendale we got rid of the tilde. Guess your signmakers got no cuzzins in the northern trailer parks. :)\n\n"
    },
    {
      "time": "26 Oct 2006 — 12:26pm",
      "content": " ![](http://web.archive.org/web/20140713204048im_/http:/typophile.com/files/redsign_6001.jpg)\n\nI like the M's though.\n\n"
    },
    {
      "time": "26 Oct 2006 — 12:37pm",
      "content": "You better like those M's or change your avatar :-)\n\nChrisL\n\n"
    },
    {
      "time": "26 Oct 2006 — 12:38pm",
      "content": "\"Where for art thou Patterson?\"\n\nChrisL\n\n"
    }
  ]
}
