{
  "id": "29002",
  "title": "Golf Logo Critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi Guys!\n\nI have been a long time reader and just joined the community so this is my first post!\n\nI am designing a logo for a golf tip website and am a little stuck on the font choice and overall design. I have attached a mockup of the different options I have at this point with the respective font choices I have narrowed it down to. I was hoping you guys could give me feedback on which design you like the most at this early stage.\n\nIf you have any suggestions for another font choice please let me know. I would like to use the same font for the logo as the headlines and navigation within the site itself.\n\nAlso, there are several alternate layouts which I included. Since the domain name is three words, I am struggling to create a logo to incorporate the three words while maintaining continuity. Thus, if you have any input on a better way to layout the logo please let me know.\n\nAlong those same lines, as you can see most if not all of the fonts were used in their black or extra black weight. If you have any other suggestions as to a font or a font weight please let me know.\n\nMoreover, since I have already expanded the scope of the inquiry, if you have any other suggestions on the color scheme of the logo or as well as the golfer logo itself please let me know. My goal was simplicity, and thus I did not add any gradients or the like to the golfer logo but if anyone thinks it would help it would me much appreciated.\n\nThanks for all your input and help in advance!\n\n| Attachment | Size |\n| --- | --- |\n| [typophile.jpg](http://web.archive.org/web/20071110000329/http:/typophile.com/files/typophile_4.jpg) | 72.11 KB |\n\n [‹ nurve - personal logo](http://web.archive.org/web/20071110000329/http:/www.typophile.com/node/29133 \"Go to previous forum topic\") [son logotype - updated ›](http://web.archive.org/web/20071110000329/http:/www.typophile.com/node/28620 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071110000329/http://www.typophile.com/user/15077\" title=\"View user profile.\">Subtrend</a>",
  "time": "<br>",
  "uid": "15077",
  "comments": [
    {
      "time": " 23.Oct.2006 10.16am",
      "content": "I think layout B2 is the most dynamic of the various options. Futura XBk Condensed or Glasgow Black are my favourites of the options you’ve given.\n\nI think that any of the variations you’ve created will work. The only thing I would suggest is that the kerning is a little off in some places. This could be due to the resolution of the .jpg, so I’d want to see a .pdf to give proper critique.\n\n- Lex\n\n"
    },
    {
      "time": " 23.Oct.2006 11.26am",
      "content": "Whatever you use, open up the spacing in the name, some of your characters are crashing. I think the little golfer is a little trite. The color is fine. Did you look at maybe making the name as if it was burned in grass with the o in Golf as the hole? It might make a nice splash graphic for your site.\n\n"
    },
    {
      "time": " 23.Oct.2006 3.22pm",
      "content": "Wow, I really appreciate all the help. I did tweak with the kerning alot on most of the examples, so I will keep that in mind. I also appreciate the observation that the golfer was trite. I was trying to keep things simple and was avoiding being trite, but in the end I guess that is where I may have ended up. Any additional observations would be very much appreciated. Thanks!\n\n"
    },
    {
      "time": " 24.Oct.2006 4.48am",
      "content": "LFT in uppercase is always going to present problems with kerning when it is so tight, have you considered lowercase? GolfTipsArchive, using the secondary colour for Tips, which would help reading it as three words while still being clear that they make up the url.  \nTim\n\n"
    },
    {
      "time": " 24.Oct.2006 8.09am",
      "content": "I have not toyed around with using lower case too much at all, but I definitely will give it a shot. Thanks!\n\n"
    }
  ]
}
