{
  "id": "29046",
  "title": "need info for dissertation about global branding.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all,\n\nI'm doing a dissertation about 'branding and advertising in the era of globalisation.'\n\nAt the moment I'm looking for different books and digital texts about the subject which is a bit hard to find. For the next meeting with my teacher I need to bring gather some visual source material that portray the growing interest for businesses to look further then the country boundries for their branding and advertising.\n\nI have been reading a lot on adbusters and some parts of books from google books, but I don't really know how to start looking for images, what keywords to use or what companies would be good examples.\n\nI kinda hoped that there would be some people around here that could help me out to get a start.\n\nYour help would be very much appreciated!!!\n\ndav2\n\n",
  "author": "skeetone",
  "time": "25 Oct 2006 — 5:25am",
  "uid": "11657",
  "comments": [
    {
      "time": "25 Oct 2006 — 5:28am",
      "content": "woops...something went wrong there...the post is posted twice...sorry about that!\n\n"
    },
    {
      "time": "25 Oct 2006 — 5:38am",
      "content": "You might want to look for books and articles which include anthropology as used in design and advertising. As society becomes more global, the need to understand what colors, words and symbols mean in different cultures becomes more important. One famous example is the Chevy Nova. to English speakers, a nova has to do with stars, but to a Spanish speaker, it means \"doesn't go,\" which is a terrible name for a car. Large corporations have been taking this very seriously for several years now.\n\n"
    },
    {
      "time": "25 Oct 2006 — 5:48am",
      "content": "At the risk of heading off on a tangent, seems Nova was an urban myth, in terms of actually being read as \"no va\" -- but I'm not a Spanish speaker.\n\n[http://en.wikipedia.org/wiki/Chevrolet\\_Nova#The\\_urban\\_legend](http://web.archive.org/web/20131014221658/http:/en.wikipedia.org/wiki/Chevrolet_Nova#The_urban_legend \"http://en.wikipedia.org/wiki/Chevrolet\\_Nova#The\\_urban\\_legend\")\n\nThe Toyota MR2 was renamed for France however, according to my brother who's owned two, and now works for them.\n\nThe usual explanation is that it sounds like \"merde\". Wikipedia has \"When said in French, the name MR2 ... sounds like est merdeux ... (fr: is filthy). Thus, the car was sold there only as the MR.\"\n\n[http://en.wikipedia.org/wiki/MR2](http://web.archive.org/web/20131014221658/http:/en.wikipedia.org/wiki/MR2 \"http://en.wikipedia.org/wiki/MR2\")\n\n"
    },
    {
      "time": "25 Oct 2006 — 6:19am",
      "content": "I guess one should investigate Marshall McLuhan. He did coin the term 'global village'. Understanding Media and The Medium is the Massage are two of his books.\n\nAside from Adbusters, which I always find too extreme and whiny, you can revisit old Tibor Kalman issues of Colors Magazine.\n\nAs for companies: Coca-Cola.\n\n"
    },
    {
      "time": "25 Oct 2006 — 6:26am",
      "content": "Coca-Cola might make a case study for various languages, or tobacco and oil giants, basically any corporations that have attracted (deserved) condemnation.  \n [Hebrew](http://web.archive.org/web/20131014221658/http:/images.google.com/images?svnum=10&hl=en&lr=&safe=off&client=safari&rls=en&q=coke+hebrew&btnG=Search)  \n [Arabic](http://web.archive.org/web/20131014221658/http:/images.google.com/images?client=safari&rls=en&q=coke%20arab&ie=UTF-8&oe=UTF-8&sa=N&tab=wi)  \n [Thai](http://web.archive.org/web/20131014221658/http:/images.google.com/images?hl=en&lr=&safe=off&client=safari&rls=en&q=coke%20thai&btnG=Search&ie=UTF-8&oe=UTF-8&sa=N&tab=wi)  \nDon't know if is apocryphal but doesn't Pinto mean something disparaging to the size of manhood in Spanish?\n\nTim\n\n"
    },
    {
      "time": "25 Oct 2006 — 6:29am",
      "content": "Or how about McDonald's in India.\n\n"
    },
    {
      "time": "25 Oct 2006 — 7:06am",
      "content": "Another snippet: Nike ran into controversy around 1997 when a flame-like treatment of the word \"Air\" on the heel was said to resemble \"Allah\" in Arabic.\n\n[http://web.cba.neu.edu/~hlane/footwear.html](http://web.archive.org/web/20131014221658/http:/web.cba.neu.edu/~hlane/footwear.html \"http://web.cba.neu.edu/~hlane/footwear.html\")\n\n"
    },
    {
      "time": "25 Oct 2006 — 8:13am",
      "content": "[http://www.designobserver.com/archives/cat\\_branding.html](http://web.archive.org/web/20131014221658/http:/www.designobserver.com/archives/cat_branding.html \"http://www.designobserver.com/archives/cat\\_branding.html\")\n\n"
    },
    {
      "time": "25 Oct 2006 — 8:55am",
      "content": "All the legends are fun, but are they really dissa material? Talk to brand managers in global companies and you'll run into interesting everyday real-world issues - such as finding approriate matched corporate-fonts for different languages, problems with layout apps not supporting certain complex script languages, encoding issues, local subs doing their own thing, etc., etc.,\n\nCheers, Si\n\n"
    },
    {
      "time": "25 Oct 2006 — 9:32am",
      "content": "I'm currently on a mission up here in Canada to de-geek chess (which I hope to advance world wide). And to accomplish this most noble task I studied the concepts and techniques of branding.\n\nAlthough I'm not yet 100% convinced - I think branding is old school. New school is to develope a _culture_, into which many different products can be presented.\n\nHere are two on-line articles which I hope will help your paper...\n\nThis first one is from Emigre 59: [http://www.emigre.com/Editorial.php?sect=1&id=26](http://web.archive.org/web/20131014221658/http:/www.emigre.com/Editorial.php?sect=1&id=26 \"http://www.emigre.com/Editorial.php?sect=1&id=26\")\n\nAnd this one is from a NY Times article that ran a while ago now. It's a great article on _culture_ and _subculture_: [http://www.murketing.com/journal/?p=119](http://web.archive.org/web/20131014221658/http:/www.murketing.com/journal/?p=119 \"http://www.murketing.com/journal/?p=119\")\n\nHiro\n\n"
    },
    {
      "time": "25 Oct 2006 — 9:52am",
      "content": "Hi\n\nThank you all so much for the feedback! got a lot of reading to do! =)  \nAlso just bought 'No Logo' by Naomi Klein which a friend of mine recomended which sounds quite interesting from the start.\n\nAs sii noticed that is also something I will need to read more on (type issues, colour issues, etc.). At the moment though I'm just asked to gather images to disect and to read about as a basis for the development towards the actual dissertation. But I do like to read and I will be having a couple of late nights reading all you guys posted since it will give me a better understanding of global branding.\n\nAgain thank you so much people! If I find any other recources I will also post them here on the forum, might anyone be interested then at least they will be able to find a lot about global branding on 1 page =)\n\nave,  \ndav2\n\n"
    }
  ]
}
