{
  "id": "29040",
  "title": "NEED HELP WITH TYPOGRAPHY PROJECT",
  "forum": "Design",
  "tags": [

  ],
  "content": "hi i am a freshman i college and i got an expressive word project. I need to select 4 of these words and use type in an expressive way to emphasize them. I just have no ideas at all. anyhing will help. here are the words:\n\n• moving • noise • dark • stolen  \n• stumble • whisper • bend • light • drop  \n• grow • lost • empty • scramble • reach\n\n",
  "author": "<a href=\"user/15105\" title=\"View user profile.\">thedark_master</a>",
  "time": "<br>",
  "uid": "15105",
  "comments": [
    {
      "time": " 24 October, 2006 - 8:48pm",
      "content": "Do your own homework.\n\nIf you need help, you should have asked or met with the professor. How much are you paying for college? The audacity of recently graduated high school children.\n\nG-d I’d immediately fail or drop a letter grade if one of my student were to come here and ask for solutions.\n\n"
    },
    {
      "time": " 24 October, 2006 - 8:49pm",
      "content": "So which set excites you? Makes you think? Claws at your soul?\n\nI can think of many permutations and combinations with all of these, but you need to choose which set of words gets your heart beating.\n\nLinda\n\n"
    },
    {
      "time": " 24 October, 2006 - 8:55pm",
      "content": "no ideas. hahaha! awesome. see you in the industry … probably as a CEO.\n\n—————  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20061116104144/http:/www.solid-creative.com/print.htm)  \n—————  \n [Little Mischief](http://web.archive.org/web/20061116104144/http:/www.littlemischief.com/)\n\n"
    },
    {
      "time": " 24 October, 2006 - 9:45pm",
      "content": "Set them all in Helvetica, 156.5pt at 75% gray at 4.75 degree clockwise rotation - then come up with an outlandish explanation as to why Helv is appropriate for each word - you could use your fave search engine to look for reasons why Helv is appropriate. You’ll get an ‘A’ for sure!\n\n"
    },
    {
      "time": " 24 October, 2006 - 11:28pm",
      "content": "<cite>hi i am a freshman i college and i got an expressive word project. I need to select 4 of these words and use type in an expressive way to emphasize them. I just have no ideas at all. anyhing will help. here are the words:<br>\n• moving • noise • dark • stolen<br>\n• stumble • whisper • bend • light • drop<br>\n• grow • lost • empty • scramble • reach</cite>\n\nFirst at least try do something yourself. On the basic of that people here can give you the feedback..wheather they are working or not.  \nI think you can easiely solve these words…they are very simple words.\n\nAm a student too and we had a same kind of exercise last year. I’ll show you my solutions..but first solve it yourself;)\n\nall the best.  \nsatya\n\n"
    },
    {
      "time": " 24 October, 2006 - 11:32pm",
      "content": "sii: Oh, come on. It should at least be in Arial, not Helvetica.\n\nSheesh, my six year old kid puts more serious thought into the fonts to use for the little sign we’re making reminding him of the reward he’ll get for brushing his teeth. Of course, his main criterion right now is to use fonts that I’ve designed. The kids really love the idea that they have a proprietary font for just their use, until I get around to finishing it, which at the rate I’m going will be a while. (It’s the [Christian Gothic](http://web.archive.org/web/20061116104144/http:/www.typophile.com/node/9245) I posted a year and a half ago).\n\n"
    },
    {
      "time": " 25 October, 2006 - 2:24am",
      "content": "group ROFL anyone?\n\n—————  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20061116104144/http:/www.solid-creative.com/print.htm)  \n—————  \n [Little Mischief](http://web.archive.org/web/20061116104144/http:/www.littlemischief.com/)\n\n"
    },
    {
      "time": " 25 October, 2006 - 2:31am",
      "content": "\\> moving • noise • dark • stolen  \n• stumble • whisper • bend • light • drop  \n• grow • lost • empty • scramble • reach\n\nYou have a whole erotic novel there.\n\nTim\n\n"
    },
    {
      "time": " 25 October, 2006 - 9:03am",
      "content": "Ivan, maybe we should restart this thread. What were the instructions given to you by your teacher? Did you ask for more instruction after the teacher gave you the assignment?\n\nMaybe I’m giving too much credit to the student and too little to the teacher, but it seems to me if a student feels a need to come to Typophile to ask a question like this there isn’t enough communication (and instruction) from the teacher.\n\nThis is a classic typography 101 assignment. I had it when I was a student. I did the word ECLIPSE and the typeface Trajan (gasp!). I took the C and reshaped it into a sliver of a moon. I still look at it as a breakthrough in my education as before that the teacher had made me cry and embarassed me in front of the entire class with my previous attempts. Instead of quitting something inside of me accepted the challenge and I went back to my sketchbook (ok I probably used the computer) and started playing with words, typefaces and shapes.\n\nThe assignment is to visually interpret a word. A typeface can help with the interpretation, but the letters also have to do some of the work. So, you should define each word as you know it and then turn that into something visual. Start sketching and see what happens. I’ll bet you’d be surprised.\n\n"
    },
    {
      "time": " 25 October, 2006 - 9:08am",
      "content": "This gets me about so many of the requests in the Design forum: here’s my project, what font should I use? And I wonder (not in this case of course) how much the designer is being paid… that they can’t at least start to come up with something on their own and then perhaps bring it here for feedback. I’ve been ignoring these requests unless they pay US for our time.\n\n"
    },
    {
      "time": " 25 October, 2006 - 9:09am",
      "content": "\\>The kids really love the idea that they have a proprietary font for just their use\n\nThis is true, my five year-old loves to type on my laptop using the Zune UI font.\n\n"
    },
    {
      "time": " 25 October, 2006 - 10:54am",
      "content": "_here’s my project, what font should I use?_\n\nI too love those threads, particularly since I get paid to do that for a living. If I had known I could get people to do my work for me I would’ve gotten an MBA. :)\n\n"
    },
    {
      "time": " 25 October, 2006 - 10:58am",
      "content": "I love those threads as much as you guys. But I think, in this instance, in many maybe, instead of shutting it down, why can’t we turn into something educational?\n\n"
    },
    {
      "time": " 25 October, 2006 - 11:06am",
      "content": "Agreed, Tiff, but it would be more productive for all concerned if we had a scamp, no matter how rough, to feedback on rather than a shortened version of a brief. That said I think your advice about sketching out ideas is probably the best that can be given at this stage (closely followed by an erotic novel:), oh and don’t do whisper as a 5% tint or a gradation, people will point and snigger.  \nTim\n\n"
    },
    {
      "time": " 25 October, 2006 - 11:11am",
      "content": "I too agree, Tiff. I just think with all things, you have to give a little to get something back. An attempt first, critique later.\n\n"
    },
    {
      "time": " 25 October, 2006 - 11:18am",
      "content": "\\>Agreed, Tiff, but it would be more productive for all concerned if we had a scamp, no matter how rough, to feedback on rather than a shortened version of a brief.\n\nBut could think of this as being sub-contracted to work on a project and only getting part of the brief - that happens in the real world, no?\n\n"
    },
    {
      "time": " 25 October, 2006 - 12:00pm",
      "content": "thank you for your help for those who actually decided to help out.  \nIsn’t it funny that my thread became a discussion about something else?\n\n"
    },
    {
      "time": " 25 October, 2006 - 12:13pm",
      "content": "“gimme answers i need it right away thanks”\n\nThere’s a whole set of “challenges” here and they have nothing to do with type or expression.\n\n"
    },
    {
      "time": " 25 October, 2006 - 12:20pm",
      "content": "<cite>Isn’t it funny that my thread became a discussion about something else?</cite>\n\ndear ivan, you have to wait for the proper replies/answers, U’re a member of typophile for hardly 16 hrs..and u dont know much abt the members, they all are very busy people, and have lots of work. u’re lucky that you got these much answers, and its totally depends on what you’re asking…and second thing you didnt showed anything yet..,Im still waiting:)\n\nplz dont mind.  \nsatya\n\n"
    },
    {
      "time": " 25 October, 2006 - 12:30pm",
      "content": "\\>Isn’t it funny that my thread became a discussion about something else?\n\nNo, not funny at all. That’s typophile - someone asks a rather dull, uninteresting or silly question and the community either ignores it or goes off on an interesting tangent. I assume most forums (not just on-line) are like that if there’s not a written agenda or moderator to keep people on-topic.\n\n"
    },
    {
      "time": " 25 October, 2006 - 12:35pm",
      "content": "I tried to take his original request and answer it with more questions instead of answers. Education is a two-way street. The teachers need to be as willing to communicate as the student.\n\nI’m glad you guys don’t think I’m being impossible. I was worried about that.\n\nTerry, I agree. You can’t get something for nothing. That is why I turned it around and asked for more.\n\nThe reason we are a community is because we do talk. Talking has tangents. You can’t help that. But I do hope that you, Ivan, will take the initiative so we can help you.\n\n"
    },
    {
      "time": " 25 October, 2006 - 12:44pm",
      "content": "Go to myfonts.com and look at type, use keyword searches. See what YOU think starts to “say” the words. There is no learning without struggle. Instead of begging for one fish, learn to fish.\n\nChrisL\n\n"
    },
    {
      "time": " 25 October, 2006 - 12:56pm",
      "content": "Tiff: you are very kind, just this side shy of too kind. Typophile would be a much less friendly place if it weren’t for the work you and the other moderators do holding it together.\n\n"
    },
    {
      "time": " 25 October, 2006 - 1:30pm",
      "content": "Thanks, Raph.\n\nA really fun little book which exemplifies this assignment, for me anyway, is [Watching Words Move](http://web.archive.org/web/20061116104144/http:/www.youworkforthem.com/product.php?sku=P0744) — [shown here too](http://web.archive.org/web/20061116104144/http:/www.amazon.com/gp/reader/0811852148/ref=sib_dp_pt/002-1712409-4536830#reader-link).\n\n"
    },
    {
      "time": " 25 October, 2006 - 2:07pm",
      "content": "hi,\n\nthe first thing you should do is pick four of the words. if you can’t decide, pick four out of a hat. however, be aware that should you decide to continue in design, your academic and professional life will contain millions of artistic, aesthetic, programmatic, and strategic decisions.\n\nsecond, write the four words out. then define them so that you have a clear idea of the concept each word represents.\n\nthird, define “expressive.” either from the dictionary, or for yourself, or better yet, in both ways.\n\nfourth, and this is the kicker, you absolutely must generate your own creative ideas. draw the words. draw them with different pens and pencils. paint them. type them on a computer. print them out small, print them out so each letter fits on an 11x17 (or A3) page. buy some blocks with letter on them and rearrange them. take pictures of type all around you for a whole day, print them, cut out the letters and make collages. these are just a few suggestions - the point is that you should open yourself up creatively. don’t be afraid.\n\nfifth, draw pictures of the words. by that i mean, images that express the ideas. find stock photography (gettyimages.com or istockphoto.com) that express the ideas. take your own pictures.\n\nsteps 4 and 5 will have to come together.\n\nDO, then think. then DO again. repeat as often as you can stand it, because it will probably help you improve.\n\nwhile you are THINKING, always keep in mind the concept of the word. look at the creative things you have done. try to imagine how steps 4 and 5 come together.\n\nfinally, i’ve suggested some steps. this is only to get your started - you can find your own process as well.\n\noh, and post some of the stuff here that you’ve done and you will get at least some constructive feedback.\n\ngood luck. have fun.\n\njarrod\n\n"
    },
    {
      "time": " 25 October, 2006 - 2:34pm",
      "content": "here are the few solutions from a similar kind of assignment i was given during my first typography course last year. Everything was hand done(cutting/pasting/xeroxing)…I know lots of them aren’t working at all..but thats was a part of learning:)\n\nIvan, these are not very great solutions but yeah you can get an idea.\n\n ![](files/FOR%20TYPOPHILE_4038.jpg)\n\ncutting/pasting was really a fun…..\n\n ![](files/cut%20paste_5847.jpg)\n\n"
    },
    {
      "time": " 25 October, 2006 - 11:03pm",
      "content": "at least he didn’t set the title in all caps…. oh wait.\n\nso how is the project going anyway?\n\n"
    },
    {
      "time": " 26 October, 2006 - 7:10am",
      "content": "“I just have no ideas at all.”\n\nAre you being lazy, or seriously have no ideas at all? If just being lazy, fine. But if you seroiusly have no ideas at all, it might be time to rethink your major.\n\n"
    },
    {
      "time": " 26 October, 2006 - 7:23am",
      "content": "OH come on! Cut him some slack! He knows how to key in a bullet!\n\n"
    },
    {
      "time": " 26 October, 2006 - 10:32am",
      "content": "Hey go to Borders, look at Stop Steeling Sheep and find out how type works. It has a little shpeel on matching type to like sneekers and things.\n\n"
    },
    {
      "time": " 27 October, 2006 - 11:19am",
      "content": "“if a student feels a need to come to Typophile to ask a question like this there isn’t enough communication (and instruction) from the teacher.”\n\nWhy not? In the UK we were encouraged to make the most of all resources, so even if we were assigned a tutor for a specific project we were encouraged to go see other tutors, read, talk to the professionals, look for inspiration and advice everywhere so I don’t see why not Typophile, after all he asked for ANY kind of help, not for solutions. Maybe he just wanted to see how YOU would approach this task (in general).  \nI find it silly to insinuate that because he’s paying for college, college should provide all the anwers. Is that the relationship we want students to have with their universities? One of a client that pays for a service?\n\n“why can’t we turn into something educational?”\n\nAgain: I don’t think he was asking for you guys to do the job on his behalf. Ivan is just interacting with professionals, trying to find out, outside the classroom, what are the different ways to approach this exercise. So if someone asks you for advice you want to be paid, but if it’s “educational support” you are willing to do it free of charge? Typophile is an educational tool as well so why all this arrogance? Generosity is what makes Typophile such a great place. I asked for help many times, it was never intended as “can you do it for me?”. It was always more of an attempt to interact with people and see how their mind work. Plus Ivan’s clearly a student, so what’s the fuss about a student asking for help. What’s so outrageous about it? Begging for a fish? Learn how to fish? Stop being lazy? Sorry but THAT was patronizing. Listen to yourselves… People seem to be too busy to give you a hand but are never too busy to give a little moral lesson, free of charge…..so what he has no ideas, it doesn’t mean he’s stupid. It happens to all students to panic a bit in front of a new task, big deal! Do your homework! What do you think he’s doing?? This is actually part of his homework!  \nIvan’s not being lazy, he’s doing what he’s supposed to do: he’s looking for advice outside college. Good for you, mate. Ivan, you have all my support. In fact, I’ll have a look into it and let you know as soon as I can if I come up with something original, free of charge of course.\n\nWelcome to Typophile, who recommended you to come here, by the way? Your tutor? Good for him.\n\n"
    },
    {
      "time": " 27 October, 2006 - 12:24pm",
      "content": "I tell you how I would start…(it’s just my personal way of dealing with this sort of thing): look up in a dictionary and try to find out all possible meanings of the same word. Moving for example could relate to motion but it could also refer to the act of producing emotions so you have more than one option and you can pick the one that inspires you most or the one that you think may surprise your tutor (maybe your fellow students will all use the word in relation to motion, so if you use the word as in “producing emotion” it’ll be less obvious and slightly more original). I know it’s just an idea but I hope it’ll give you something to think about before you proceed with the actual graphic representation.\n\nAs Tim said in realtion to the word whisper: stay away from the obvious, try to evoke an atmosphere rather than seek for a literal representation ( I think that was what Tim meant).  \nI had a quick look in my dictionary but I’m sure you can do a better job. Good luck. Oh and please make your cheque payable to…: )\n\nMoving:  \n1) in motion  \n2) producing strong emotion as in “a moving book”  \n3) relating to the process of changing one’s residence\n\nStumble:  \n1) trip por momentarily lose one’s balance; almost fall  \n2) trip repeatedly as one walks  \n3) make mistake or repated mistakes in speaking as in “he stumbled over the words”  \n4) find or encounter by chance\n\nWhisper:  \n1) speak very softly using one’s breath without one’s vocal cords, especially for the sake of privacy  \n2) poetic or literary: of leaves, wind or water , rustle or murmur softly  \n3) be whispered: be rumoured as in “ it was whispered that he would soon die”\n\n"
    },
    {
      "time": " 27 October, 2006 - 1:04pm",
      "content": "Lorenza,\n\nI think you completely mis-read what I wrote. Or at least partially. I never (meant to have) said that students shouldn’t be encouraged to use as many resources as possible. I agree with you and what you have said about “making the most of all resources.” He said he had no ideas and so I tried to respond in a way which would help, but without taking away from what he might learn should he explore\n\nI think I did give him suggestion as to how I would approach the project.\n\nThe reason I posted was to try to turn the conversation toward the right direction and help instead of insult.\n\nPlease re-read what I wrote. I only wished to help him and get the others to try to help as well.\n\n"
    },
    {
      "time": " 27 October, 2006 - 2:25pm",
      "content": "First of all, kudos to the kid for looking for professional resources. But, in the same breath, I do believe he can give it a whirl on his own first. I think it’s imperative for design students to explore their own thoughts and ideas - that is the point of a college education. Ideation developement is essential in the creative process. My advice as a design professional and educator is to research and seek ideas, yes, but think independently as well. If you learn that now, you’ll be more successful in your senior-level classes and beyond.\n\n"
    },
    {
      "time": " 27 October, 2006 - 2:43pm",
      "content": "I disagree lore. I HAVE NO IDEAS. Who considers themselves creative ( with an actual interest in their major) and couldn’t have ANY ideas while looking at those words? True, sometimes people get jumped on tp for nothing. This isn’t one of those times.\n\n"
    },
    {
      "time": " 27 October, 2006 - 2:45pm",
      "content": "Lorenza,  \nEither you missunderstood my post or we have completely different concepts of what “help” is. In my years of teaching and parenting, I have always struggled to find the best way to “teach” that individual at that moment in a way that befits that instance. I believe that what Ivan needed just then was a bit of a wake-up call that he must do “something” first even if it is wrong before he gives up saying he has no idea. I also gave him a way to get started. I firmly believe that the struggle in learning is imperitive and the best teacher of selfreliance. The young man is a college student now, not a child. He needs to push himself to action. He could then bring the results of his actions here for help. You learn far more from trying and being wrong than you do by doing nothing and hoping for divine intervention.  \nAs far as I am concerned, the most helpful post on this thread was by Satya, a young student himself. Satya said, “First at least try do something yourself. On the basic of that people here can give you the feedback..wheather they are working or not.”  \nHe later said, “I am still waiting” after getting no reply and offered to show his own work—still no reply. Satya may be young and inexperienced but was exactly right in his assesment.\n\nI stand by every word I said above without apology. I truly want Ivan to learn to fish. To do that, he must first go out and stick his line in the water. That works far better than waiting for a cooked fish to jump into your plate at home.\n\nChrisL\n\n"
    },
    {
      "time": " 27 October, 2006 - 3:32pm",
      "content": "Lorenza,\n\nI think you are projecting what Ivan thought and intended. His message isn’t articulate enough for all of that. Ivan himself hasn’t responded so defensively.\n\n"
    },
    {
      "time": " 27 October, 2006 - 5:06pm",
      "content": "I still think that, considering he’s new on typophile, you guys could have been a little bit more supportive and less condescendent. And yes, I re read the thread and I feel exactly the same. We don’t know if he’s a “young man”. I took a degree in graphic design when I was well over 30. I had another degree before that and I had travelled all over the world. Still, in front of my first brief I felt very insecure and I remember it was very important for me to look at other people’s work. Nothing wrong with that. I think it’s clear that Ivan was having difficulties getting started, maybe he’s a hell of a designer but it’s still insecure about his ideas and concepts. Maybe he came across Typophile and thought that this is what was all about: exchange of ideas and who knows maybe he would have helped YOU next time but he’ll probably think twice about coming back now. If that was the first reception, can you immagine how comfortable he feels about showing you guys his sketches? Can you blame him? And why all this sending him back to his tutor then? Why do you assume he doesn’t communicate with his tutors? Maybe he feels he needs the input from outside, that his tutor is not God and may not always be right. Plus at Typophile you have people from different backgrounds and culture, what beats that? Carl, I agree I don’t have enough information to determine that he had nothing but good intentions but we don’t have enough information to decide he’s a slacker either.\n\nSerious guys: if you don’t feel like giving a hand: fine. If you feel like you should be paid for that: fine, contact him by email or something and make an arrangement. It would not be the first time this happens at Typophile!  \nBut please think about before you call him lazy or before you suggest he should consider studying something else instead.\n\n"
    },
    {
      "time": " 27 October, 2006 - 5:30pm",
      "content": "Lorenza,  \nsorry but am not at all agree with what you’re saying. Dunno why, but you’ve just turned everything other way. Am a student too, and I never had any problem with any of the members here. I think everyone here is very very co-operative and helpful, specially for the students. And this is why its a great place.  \n.  \n.  \n.  \np  \n.  \ne  \n.  \na  \n.  \nc  \n.  \ne  \n.  \n.\n\n"
    },
    {
      "time": " 27 October, 2006 - 6:16pm",
      "content": "I, too, have just reread this thread, and I stand by my post despite the penetrating Freudian psychoanalysis of the student’s mind. You can detect an insincere undertone in his request for help: the help-me-do-the-problem-for-me kind of request.\n\n"
    },
    {
      "time": " 27 October, 2006 - 7:38pm",
      "content": "Satya: what I don’t understand is this urge to be so judgemental and patronising. People do ask for help. If you think they don’t deserve it, move on to the next thread.  \nWhat you said about people being busy doesn’t make much sense because it’s their choice to read the thread and reply. Nobody’s forcing anyone to be here!  \nIf it’s a question of payment, then let those who think they should be paid, work out a contract or a price table.  \nI don’t see the need to determine if the student is kosher or not, or if his/her request is legit or not. Simply, I didn’t “detect any undertone” (not even using my penetrating Freudian psychological analysis skills) and I happened to have the time to give a little encouragement. I didn’t see any diabolical-immoral-unethical-shameless-conspiracy-against-the-poor-typophile-member in Ivan’s few lines. So maybe it’s not me who’s turning things the other way (whatever that means).  \nIt doesn’t make any difference to me if Ivan presents or not a sketch, to be honest, but that’s me. I don’t feel the need to put rules in everything. I simply don’t feel offended and don’t feel the need to “scold” the “vile slacker”.  \nWhy put the guy on trial, you help if you feel like. If you don’t, just ignore the message and let those who don’t feel offended do what they think. He asked for ideas, which could also be suggesting a book (like someone did) or just share a similar experience. I don’t think it should be a rule that the guy/girl should first show a sketch. You may ask for it but you don’t have the right to “expect” this and feel betrayed and cheated because the person doesn’t comply with your request. He never promised anything.  \nHe said in his 2nd post that he was grateful to those who had decided to help him, what else do you need: the naughty naughty boy on his knees?\n\nSatya, I think some typophile members are simply awesome, and I have a great experience of typophile myself, which is why I’m surprised to suddenly see all this resentment and all this detecting-insincere-undertones between the lines. Oh well…\n\n"
    },
    {
      "time": " 27 October, 2006 - 7:47pm",
      "content": "I think I am going to put the word VERBOSE in the list of words I will be assigning to my students.\n\n"
    },
    {
      "time": " 27 October, 2006 - 8:04pm",
      "content": "Hear hear, James!\n\nI also agree with whoever said that if somebody has no ideas they don’t belong in graphic design. I mean even if your first stab is trite how can you not see anything at all for ‘grow’, ‘dark’, ‘drop’ or ‘scramble’? Being a designer is about being to visualize and conceptualize and I think we would NOT be doing Ivan any favor by handing him easy answers.\n\n"
    },
    {
      "time": " 27 October, 2006 - 8:09pm",
      "content": "<cite>“I think we would NOT be doing Ivan any favor by handing him easy answers.”</cite>  \nvery true,  \nand sometime not helping is itself a big help:)\n\n"
    },
    {
      "time": " 27 October, 2006 - 10:38pm",
      "content": "Well, what can I say? Maybe not everyone is as perfect as you are, James.\n\nEducation (assuming Ivan was actually looking for education…) is something you offer, not something you impose.  \nExactly: don’t help, isn’t it what I was saying all this time? If you don’t want to help Satya, don’t help!  \nSo Ivan doesn’t belong here or even in the industry. What are you going to do about that? Make a petition and send a letter to West Lafayette’s college of graphic design and have him removed? I don’t get it, Patricia, you are being incredibly harsh. I thought your issue was money, now it’s about education principles? Who talked about easy answers, did you read my post? I said it’s possible he was only looking for general advice.\n\nMonths ago some guy from a typographic magazine asked us to help him find a name for his e-newsletter or something (Satya you were not around yet). Anyone here remembers? He promised a prize ( I can’t remember what it was…). A huge amount of people contributed, some names were actually really good. What happened to the guy and the reward? Anyone knows? Anyone said anything?  \nThat was actually something to make a fuss about because:  \na) he was in the creative industry, why couldn’t he find a name for his magazine ?  \nb) he had the means to financially reward contributors  \nc) he actually promised he was going to reward the winner  \nd) he disappeared without saying a word. Nope, not even a thank you.\n\nHas anyone demonstrated outrage? I think not. That, in my opinion, was not a very honest attittute and it went completely unnoticed.  \nNow all this fuss because a first year student is not creative enough and needs a push, like this is something new…\n\n"
    },
    {
      "time": " 27 October, 2006 - 10:59pm",
      "content": " ![](http://web.archive.org/files/th_peacesymbol_6371.jpg)\n\n"
    },
    {
      "time": " 28 October, 2006 - 2:38am",
      "content": "\\>As Tim said in realtion to the word whisper: stay away from the obvious, try to evoke an atmosphere rather than seek for a literal representation ( I think that was what Tim meant)\n\nYes (although at least one student will do that).\n\nMany people get into graphics to specialise in different disciplines other than type, students often don’t appreciate the inter-connection of disciplines, but I don’t want to defend Ivan, if he feels the need he can do that. I expect now most of us would love a project with a brief as free as this, but in the dim and distant (in my case) it was daunting and I was _aware_ of type (or rather lettering), a situation that Tiffany acknowledged, although the purpose, I believe, of the exercise is multi-fold, one of which is the use of resources, the darkroom & studio, type department, library, print and model-making departments (the astute will guess it was before easy access to digital). For that reason I don’t condemn Ivan, although I wish he had shown some inclinations, on the other hand many students have asked questions here and demanded to be treated as children and received some barbed advice, that will, hopefully, reveal to them the difference between school and college education.\n\nThat’ll be ten quid, I’ll send an invoice.\n\nTim\n\n"
    },
    {
      "time": " 28 October, 2006 - 4:48am",
      "content": " ![](http://web.archive.org/files/scarecrow_oz_4222.gif)\n\nDid I say I was perfect?\n\nA straw man for a no brainer.\n\n"
    },
    {
      "time": " 28 October, 2006 - 5:05am",
      "content": "?\n\n"
    },
    {
      "time": " 28 October, 2006 - 5:07am",
      "content": "Not directed at you Tim.\n\n"
    }
  ]
}
