{
  "id": "29053",
  "title": "Most underrated type designers?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "There are a lot of great type designers out there. Some are getting the attention they deserve, while others still seem to be living the life of the \"undiscovered talent.\"\n\nI've come across a few recently who I hadn't heard about and I figured this could be a good way for others who scan the pages of Typophile to learn about designers they wouldn't otherwise know about. Who do you think is underrated?\n\n",
  "author": "<a href=\"/web/20110417123439/http://www.typophile.com/user/7475\" title=\"View user profile.\">TBiddy</a>",
  "time": "<br>",
  "uid": "7475",
  "comments": [
    {
      "time": "",
      "content": "No fair, Terry. You start. ;^)\n\n"
    },
    {
      "time": "",
      "content": "Apparently, Paul Barnes.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Good one, Hrant. I guess we should define \"underrated\" here. Are you looking for type designers unknown to graphic designers, unknown to other type designers, or unknown to Typophiles? Those are three levels of increasing knowledge.\n\nHere are those that first come to my mind:  \n [Hubert Jocham](http://web.archive.org/web/20110417123439/http:/www.typophile.com/wiki/Hubert%20Jocham), [Laura Meseguer](http://web.archive.org/web/20110417123439/http:/www.typophile.com/wiki/Laura%20Meseguer), [Xavier Dupré](http://web.archive.org/web/20110417123439/http:/www.typophile.com/wiki/Xavier%20Dupre), [Alan Greene](http://web.archive.org/web/20110417123439/http:/www.typophile.com/wiki/Alan%20Greene).\n\n"
    },
    {
      "time": "",
      "content": "Well, with this bunch there probably aren't many unknown to type designers. Why don't we go with unknown to graphic designers. Though I think everyone could potentially learn something new. :)\n\n"
    },
    {
      "time": "",
      "content": "Probably most graphic designers, who are not also type whackos like us, don't know who designed many of the faces they use. My guess is that they just know the big names. That leads me to say that underrated may not be the term. It may be \"under-the-radar\" instead :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I would actually shoot for under-rated by us. That would teach us the most.\n\nThen we can tell the graphic designers about them, and the under-rateds could leapfrog, which might make up for their low-key past. And if they don't like that, tough - they shouldn't do such great work. :-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "judging purely from lack of type recommendations in the design forum, i would say [Fred Smeijers](http://web.archive.org/web/20110417123439/http:/www.typophile.com/wiki/Fred%20Smeijers) and [Tomáš Brousil](http://web.archive.org/web/20110417123439/http:/www.typophile.com/wiki/Tomas%20Brousil).\n\n"
    },
    {
      "time": "",
      "content": "_It may be “under-the-radar” instead :-)_\n\nPerhaps. :)\n\n"
    },
    {
      "time": "",
      "content": "I'm sure Fred would say otherwise, but I've ready many articles on him. In fact, I think I just read one yesterday. Tomáš... [nice choice](http://web.archive.org/web/20110417123439/http:/www.suitcasetype.com/page.php?lmut=en). :)\n\n"
    },
    {
      "time": "",
      "content": "Terry,\n\nInteresting topic. When I think of it I wonder why it hasn't appeared earlier? Anyway, how do graphic designers or design oriented people define whether a type designer is underrated or not? By their appearance in articles etc or by having their typefaces used in work. It would be fun to have some questions like this in a survey done by some design magazine. I myself find it hard to pinpoint the word underrated... but I'm leaning toward the case where someone who makes quality products and is fairly known, but seldom used by graphic designers. On the other hand some type designers are having less time to make commercial faces because they work more with custom type.\n\n"
    },
    {
      "time": "",
      "content": "Also varies with location - MFBenton is apparently more underrated in Europe than he is in the US.\n\n"
    },
    {
      "time": "",
      "content": "For example: I think [Dino dos Santos](http://web.archive.org/web/20110417123439/http:/www.dstype.com/) has done some amazing work. But only recently have I discovered it.\n\nStefan, you have a good point...perhaps by how much press or use a type designer has gotten (by graphic designers)? Xavier Dupré and Joshua Darden were just recently in Print magazine for their annual young designers feature. Though they might disagree...I think they are pretty well known amongst designers and type designers alike.\n\n"
    },
    {
      "time": "",
      "content": "Chris Sowersby is well underrated if you ask me but how come he doesn't post his work on here anymore? I tried to buy fonts from his website once but there's no shopping cart.\n\n"
    },
    {
      "time": "",
      "content": "Oh right. Kris is great. [Klim,](http://web.archive.org/web/20110417123439/http:/www.vllg.com/KLIM/) right? He's at Village now.\n\n"
    },
    {
      "time": "",
      "content": "I'll add [Alejandro Lo Celso](http://web.archive.org/web/20110417123439/http:/www.typophile.com/wiki/Alejandro%20Lo%20Celso) of [Pampatype.](http://web.archive.org/web/20110417123439/http:/www.pampatype.com/)\n\nLaura Meseguer lists some others worth adding: [Eduardo Manso](http://web.archive.org/web/20110417123439/http:/www.typophile.com/wiki/Eduardo%20Manso) at [Emtype.](http://web.archive.org/web/20110417123439/http:/www.emtype.net/) [Iñigo Jerez](http://web.archive.org/web/20110417123439/http:/www.typophile.com/wiki/I%C3%B1igo%20Jerez) at [Textasis.](http://web.archive.org/web/20110417123439/http:/www.textaxis.com/) [Trine Rask](http://web.archive.org/web/20110417123439/http:/www.typophile.com/wiki/Trine%20Rask) at [TrineRask.](http://web.archive.org/web/20110417123439/http:/www.trinerask.dk/uk/uktype.html)\n\n"
    },
    {
      "time": "",
      "content": "can you really be underrated if you haven't released anything yet, or if you're new to the biz? Kris IS great, but nobody's had a chance to use his type yet, so I don't think he qualifies.\n\n"
    },
    {
      "time": "",
      "content": "Kris Sowersby isn't underrated, he's unrated. When he comes out with his first face for Village, he'll get rated. G? PG? R? Stay tuned :)\n\n"
    },
    {
      "time": "",
      "content": "And once you release something it has to be better than people expect.  \nOtherwise we're just talking about <cite>obscure</cite> type designers. :-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Give Kris a chance to finish. He will be on the market soon.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "William.  \nIs G Good  \nPG Pretty Good  \nand  \nR REALLY Good?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "R = The Pirates' rating.\n\n"
    },
    {
      "time": "",
      "content": "[Giovanni de Faccio](http://web.archive.org/web/20110417123439/http:/typophile.com/wiki/giovanni_de_faccio) and Lui Karner.  \nTheir Rialto is fantastic - but hardly anyone knows it.\n\n"
    },
    {
      "time": "",
      "content": "me;)\n\n"
    },
    {
      "time": "",
      "content": "_me;)_\n\nI was waiting for this response. :) Which means so far we have two rules:\n\n1) The designer must have released one design for commercial use _or_ created a custom face for a company or corporation\n\n2) You can't vote for yourself\n\nI'm sure we'll think of more. :)\n\n"
    },
    {
      "time": "",
      "content": "[Bud Kettler](http://web.archive.org/web/20110417123439/http:/www.typophile.com/wiki/Bud%20Kettler) get's my vote - he designed one of the most used typefaces of the past 50 years and most designers don't know who he is.\n\n[Courier](http://web.archive.org/web/20110417123439/http:/www.typophile.com/wiki/Courier), this Bud's for you!\n\n"
    },
    {
      "time": "",
      "content": "<cite> &gt;&gt;I was waiting for this response. :)</cite>\n\nhe he :)\n\n"
    },
    {
      "time": "",
      "content": "\"R = The Pirates’ rating.\"\n\nSeems like an R rating gets you off the list, in type design circles. Walk the plank, matey, this looks suspiciously like Meta!\n\n"
    },
    {
      "time": "",
      "content": "I reckon [this blokes](http://web.archive.org/web/20110417123439/http:/www.exclamachine.com/) pretty hot right now. Have you fellas seen [this](http://web.archive.org/web/20110417123439/http:/typophile.com/node/29043)—what a ripper!\n\nMuzz\n\n"
    },
    {
      "time": "",
      "content": ";-) nice try\n\n"
    },
    {
      "time": "",
      "content": "Not me. Dunno who, but it's not me. I notice they are a new account, but seems like a strange thing to make an account insincerely for. I think they just like my newest project's theme. Can't say I mind. :)\n\nI don't have a vote, it seems to me that most designers are underrated. Can't decide who to narrow it down to.\n\n[Choz Cunningham](http://web.archive.org/web/20110417123439/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20110417123439/http:/www.exclamchine.com/)  \n [The Snark](http://web.archive.org/web/20110417123439/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "",
      "content": "Welcome to typophile Murray!\n\nSorry I suspected you were Choz messing about :-)\n\n"
    },
    {
      "time": "",
      "content": "Murray, say hello to Rod Laver for me! He won't remember me of course but hey, it's worthy a shot!\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "The underrated designers are the guys and girls that the major players keep chained to workstations in their basements.\n\n"
    },
    {
      "time": "",
      "content": "I nominate the independents who designed the ClearType faces.  \nI'm sure they've done the math. \"500 million x 1% of MRSP? -- damn!\"\n\n"
    },
    {
      "time": "",
      "content": "This seems a bit odd - does anyone do royalties on custom font work? (if you have the clients name I have a few fonts I could license them) Imagine how much Erik would have raked in if he got a penny for every Nokia phone sold? But as it never happens in this industry why would the designers have \"done the math\" - it's kind of like me dreaming of winning the lottery when I never buy a ticket.\n\n"
    },
    {
      "time": "",
      "content": "Can you include links to visuals of the fonts or type designs the designers created as well as listing the designer? It would be easier to remember them if i could relate their name with their work.\n\n"
    },
    {
      "time": "",
      "content": "I agree. I've had trouble tracking down the work of a few of the names listed.\n\n"
    },
    {
      "time": "",
      "content": "_a penny for every Nokia phone sold?_\n\nThere is a difference between a bundled font and an OEM font.\n\n_does anyone do royalties on custom font work?_\n\nIt's not about royalties, but about fair value.  \nOne of the financial considerations made by corporations (and governments) that commission custom fonts is to compare the cost of licensing a retail font for their multiple workstations, with the cost of commissioning a proprietary design.\n\n_it’s kind of like me dreaming of winning the lottery when I never buy a ticket._\n\nSure, contracted talent doesn't get OEM \"points\" in this business, but that is the result of corporate concentration, nothing to do with gambling. One can still imagine how things might be without the virtual monopoly exercised by a handful of computer companies.\n\n"
    },
    {
      "time": "",
      "content": "Sorry dezcom mate but Ive never met Rod Laver.\n\nMuzz\n\n"
    },
    {
      "time": "",
      "content": "<cite>Giovanni de Faccio and Lui Karner. Their Rialto is fantastic -- but hardly anyone knows it.</cite>\n\nAnd other yet unfinished typefaces! Moreover, much passion and humor.\n\nKarsten\n\n"
    },
    {
      "time": "",
      "content": "That's ok Muzz, I didn't think you had. I just knew he was from Perth and was just having a bit of fun with you :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\"And other yet unfinished typefaces! Moreover, much passion and humor.\"\n\nSounds like a man after my own heart :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I don't think they have released commercially available fonts, but they did some custom typefaces.\n\n[http://www.asyl.co.jp/](http://web.archive.org/web/20110417123439/http:/www.asyl.co.jp/ \"http://www.asyl.co.jp/\")\n\n"
    },
    {
      "time": "",
      "content": "_Can you include links to visuals of the fonts or type designs the designers created as well as listing the designer?_\n\nI've added wiki entries for the links in my initial post.\n\n"
    },
    {
      "time": "",
      "content": "[Andrea Tinnes](http://web.archive.org/web/20110417123439/http:/www.typophile.com/wiki/Andrea%20Tinnes) at [TypeCuts](http://web.archive.org/web/20110417123439/http:/typecuts.com/fonts_start.php) seems to have something good going on.\n\n"
    },
    {
      "time": "",
      "content": "\\>It’s not about royalties, but about fair value.\n\nIsn't 'fair value' determined by the market? I think 98% of equally qualified type designers would have been more than happy with the rates paid for this work. And the remaining 2% might have asked for a bit more, but not that much more.\n\nIt's nice for type designers to think that say Gary Munch's contribution to Windows Vista /Office 2007 is equal to 1% of the retail price of these products, but that's incredibly naive - literally tens of thousands of people over many years contributed to these products.\n\n"
    },
    {
      "time": "",
      "content": "Rene Verkaart of Characters is not as well-known as he should be.\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "",
      "content": "Hermann Ihlenburg ( [http://typophile.com/node/12164](http://web.archive.org/web/20110417123439/http:/typophile.com/node/12164 \"http://typophile.com/node/12164\")) - though he may be more unknown/obscure than under-rated.\n\nBTW, if you're wondering why the italics stopped, it's because I started my post by closing the endlessly open \"cite\" tag.\n\nT\n\n"
    },
    {
      "time": "",
      "content": "_I think 98% of equally qualified type designers would have been more than happy with the rates paid for this work._\n\n\"Thankee massah.\"\n\n_but that’s incredibly naive_\n\nNonsense, it's just a different perspective.  \nThe MRSP I was referring to is retail font price, not the cost of Vista. The idea that people actually buy font licences may seem somewhat bizarre at MS, but indulge me please, it's the reality for most type designers.  \nSay an OpenType font family of four styles retails for $100.  \nWhen an independent foundry sells a licence for that, the type designer makes $30 - $90, depending on whether the sale is \"foundry direct\" or through a distributor.  \nHowever, when the same designer's OT family is bundled with Vista, the designer will end up making what, a couple of cents per installed family?  \nMunch et al are great philanthropists :-)\n\n"
    },
    {
      "time": "",
      "content": "Nick, we've read your rants about 'bundling' many times before. But to somehow claim that any type designer who does work-for-hire work that is bundled is some kind of traitor is taking things too far.\n\nThe leap that the designers who worked on the ClearType Collection fonts are \"underrated\" is also bizare. You picked the wrong thread to hang your crusade on - Matthew Carter, Luc(as), Jeremy Tankard, John Hudson etc., could hardly be described as underrated before working on this project and if anything being involved adds to their exposure.\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "Si, you're confusing the notion of \"underrated\", meaning not having a reputation, with the twist my post gave it, meaning \"undervalued\". It was a good-humoured jest, giving you the opportunity to wax lyrical about Microsoft's largesse--so please, lighten up!\n\n"
    },
    {
      "time": "",
      "content": "Simon, maybe Nick thinks you should've paid them [even] more? ;-)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>so please, lighten up!\n\nAh, it was a joke. Sorry for taking the jab too seriously.\n\nCheers, Si\n\n"
    }
  ]
}
