{
  "id": "29066",
  "title": "Please offer feedback on my logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello all,\n\nYou've been a great help in the past. Hopefully, you'll have a moment or two give me a little criticism this time around.\n\nI'm working on a new logo for myself. Hydrate is now the name for my freelance design site. I've been working in two directions so far. Please let me know if you think either of these directions is worth pursuing.\n\nFYI: I'm using the following definitions as inspiration for the logos\n\n1. to combine chemically with water  \n2. To supply water to in order to restore or maintain fluid balance\n\nDirection 1: Uses Sophisto. I like the feel of this font. It has a techno/scientific feel that I like. I tweeked the the \"r\" and the \"a\" a bit trying to get a better relationship between the two. I'm not sure if that is working out. And I've filled some of the characters with blue to indicate water.\n\nDirection 2: (I'm now staring at the typophile logo and thinking it looks very similar) Anyway the idea here is to indicate an \"H\" and a \"+\" symbol. The question is do you see the plus symbol? And in which one does it read the clearest? I'm using avenir below...not sure I want that.\n\nThank you for your help\n\nTamara\n\n| Attachment | Size |\n| --- | --- |\n| [hydrate.jpg](http://web.archive.org/web/20130515040931/http:/typophile.com/files/hydrate.jpg) | 91.57 KB |\n\n",
  "author": "starlux",
  "time": "25 Oct 2006 — 5:42pm",
  "uid": "4094",
  "comments": [
    {
      "time": "25 Oct 2006 — 5:57pm",
      "content": "My vote is for concept 1; it's a really interesting idea to fill the bowl with water. I like concept 2 visually, but the \"+\" only comes across in 2b, which I don't really like - too much blue. For concept 1, I much prefer b to a - the three filled bowls of a are overdoing it, I think. Maybe experiment with which letter should have the blue fill, as the d might work just as well. If you choose concept 2, I'd go with choice a, which is the best balanced in color.\n\nAs for the type, I like both your choices. Sophisto is pretty much what you want, something crisp and simple. There might be other sans-serifs that work just as well, but there's nothing wrong with it. Avenir fits concept 2 as well; it gives it a modern, pseudo-corporate feel, almost as if it were from a bottled water label. Overall, very nice job!\n\n"
    },
    {
      "time": "25 Oct 2006 — 6:08pm",
      "content": "I liked 1b.\n\n"
    },
    {
      "time": "25 Oct 2006 — 7:36pm",
      "content": "1b for me too. If you are really pushed for time 1b is decent/solid enough to live with.\n\nI do think Hydrate is a really fun name. It perhaps deserves more. If you do have time I imagine that water distortion, Sponge letters, water drops, not to mention hoses, watering cans, fire hydrants and I am sure 1000 other things could be investigated!\n\n"
    },
    {
      "time": "25 Oct 2006 — 8:07pm",
      "content": "Hey Satya nice photo, It's always good to put a face to the name,\n\nI'd go concept no. 1. yes I think no. 2 may be a touch close to typophile ;)\n\nMy humble advice is to go a bit further, you've got the concept of water interacting with letters, it's a good concept but it seems like there's more room to take it in different directions. filling the bowls/counters of the letters is a simple solution but perhaps isn't special enough for a logo.\n\nSomething I tell myself often is that I don't need to somehow remain faithful in a 1:1 relationship with a concept, but I rather need to recognise that a concept is a starting point and not a straitjacket. It is not necessary for a viewer to 'get' straight away what they are looking at, but rather to get a feel or a sensation that is relevant.\n\nFor example, what would happen if you deleted the black outlines around the blue bowls and treated the blue colour as a dynamic shape, where could you take that? etc etc etc. It's always worth spending a bit more time brainstorming ideas out on paper even when you think you've got something, don't be an editor at this point, that will kill it, just let the ideas come from that starting point\n\ntake it or leave it, it works as it currently is but maybe there's room to add more interest  \ncheers\n\n--N\n\n"
    },
    {
      "time": "25 Oct 2006 — 8:35pm",
      "content": "Yes, don't forget your friend the pencil.\n\n"
    },
    {
      "time": "25 Oct 2006 — 9:14pm",
      "content": "thanks, nicholas :)\n\ntamara, for easy reference always insert your photos on the screen. untill unless its too big or a different format like pdf.  \n:)\n\n ![](http://web.archive.org/web/20130515040931im_/http:/typophile.com/files/hydrate_6069.jpg)\n\n"
    },
    {
      "time": "25 Oct 2006 — 9:18pm",
      "content": "I prefer 2-C. Perhaps the \"+\" isn't as obvious as the other versions, but the overall balance of the design is very attractive and \"modern looking,\" (whatever that means?)---  \nDB~\n\n"
    },
    {
      "time": "26 Oct 2006 — 7:13am",
      "content": "series 1 is stronger, IMHO.\n\nThat said, I agree with others. Hydrate is a great name but I think you're limiting yourself a bit by going a tad too literal with the definition. Spend some time (if you can) playing with the concept some more.\n\n"
    },
    {
      "time": "26 Oct 2006 — 8:17am",
      "content": "Thanks for the comments and encouragement. You're right...I spent a long time trying to come up with a good name (finally came to me in the shower while looking at a bottle of shampoo). I should allow myself a little more time to play with this. I'll be out of the office all day so I'll bring my drawing pad along and sketch.\n\nI'll upload any new ideas I have as soon as I can. Satya...I see...I never noticed the insert image link below the comment box...I'll insert here next time.\n\n"
    },
    {
      "time": "2 Nov 2006 — 5:24pm",
      "content": "Hi all,\n\nI've finally had a moment to get back to this. Unfortunately, I need to settle on something before I get swamped again in a few days. As you can see I'm trying to keep the logo very clean. And I'm still enamored of the Sophisto. It just feels right to me. Series 5 is a bit of a departure. I treated the letters like a hose. Unfortunately, I don't think it's going to read at small sizes and probably needs a lot more tweeking to make it work.\n\nI'm looking forward to your comments.\n\n ![](http://web.archive.org/web/20130515040931im_/http:/typophile.com/files/hydrate2_4375.jpg)\n\n"
    },
    {
      "time": "2 Nov 2006 — 5:47pm",
      "content": "What if you had a mirror image of hydrate (white on blue ) below the green letters. Then you could have a stream of water comming from the 'r'. The water could be at the base of the y & be an oval. I would mock it up - i can see it so clearly - but that would spoil it for you I think. 4a gave me the idea. The 'r' looks like a sink faucet. Waddya think?\n\n"
    },
    {
      "time": "2 Nov 2006 — 6:44pm",
      "content": "Or, the 'r' could be filling the bowl of the 'a', similar to the first post.\n\n- Lex\n\n"
    },
    {
      "time": "2 Nov 2006 — 7:31pm",
      "content": "What if you simplify it even more? How about the type (Sophisto) with one drop clinging to the bottom of one of the letters?\n\n"
    },
    {
      "time": "2 Nov 2006 — 7:35pm",
      "content": "yeah really nice work,\n\nI like the hydrate with the drop and the plus sign best, very clean, strong and probably bit more timeless than the hose writing and the more cartoony/representational sploosh\n\nHose writing is however a great concept and reminds me of one of my favourite logos: [hopscotch](http://web.archive.org/web/20130515040931/http:/www.hopscotchfilms.com.au/flash.html) it's so cool.\n\nbut on the water-drop one, do you need the boxwork? s'not horrible but maybe the shapes of the letters and drop are strong enough on their lonesome  \nthoughts for what they're worth\n\n--N\n\n"
    },
    {
      "time": "2 Nov 2006 — 7:55pm",
      "content": "I like the idea of the lowercase r as a spigot. I can see it too now that it is mentioned.\n\n"
    },
    {
      "time": "3 Nov 2006 — 12:11pm",
      "content": "Thanks all. I also think the drop with the plus sign is closest to working. I'll trying losing the boxes and see how it holds up.\n\nAnd the r as a spigot...I see it...great idea! I'm definitely going to try it out. I'll post again this weekend.\n\n"
    },
    {
      "time": "4 Nov 2006 — 1:44am",
      "content": "I would also look at the shape of the drop the top left and right should (I think) be concave rather than convex and rounder at the bottom, you could (if you keep the box) increase the size of the drop so that it starts outside the box and increase it in size. I think the tight kerning is at odds to the space used in the box and the mark. I think you could make the hose idea but I think you have to bring in more movement, maybe with a bit of perspective, and as you say increase the weight of the stroke and find an alternative way of making the \"dra\" because there are a lot of verticals which are quite tight and heavy.  \nTim\n\n"
    },
    {
      "time": "11 Nov 2006 — 4:11pm",
      "content": "Tamara,\n\nSo far #3 is the best for me but it just seems to be the easiest solution. Play around with the sizing of it a bit and perhaps see what kind of counter shapes you can get.  \nIm giving you another quick arrangement but perhaps explore this more. Negative shapes can sometimes create interesting icons.\n\n ![](http://web.archive.org/web/20130515040931im_/http:/typophile.com/files/drop_5103.gif)\n\nThe hose writing could be a very beautiful but tricky and painful wordmark. BUt if you can pull it off could work. It also reminds me of this logo/typeface that [mucca design](http://web.archive.org/web/20130515040931/http:/www.muccadesign.com/) created. I dont think its available though but you get the idea. I would keep it connected.\n\n ![](http://web.archive.org/web/20130515040931im_/http:/typophile.com/files/balazs_6041.gif)\n\n ![](http://web.archive.org/web/20130515040931im_/http:/typophile.com/files/balazs2_5021.gif)\n\nI'd be careful in filling the counter shapes of your earlier versions. Depending on the media logos should work well in black and white and with color. So if this were to be in black the counter shapes would be lost. Now if its for web ONLY well I've seen all kinds of crazy logos with millions of colors etc. but in any case I would avoid that.  \nHope this helps.\n\nKco\n\n"
    },
    {
      "time": "17 Nov 2006 — 4:18pm",
      "content": "i was thinking of a drop of water too rather than what you had in mind before.\n\n"
    },
    {
      "time": "4 Dec 2006 — 12:50pm",
      "content": "I love the choice of colors from the first round. I think the font choice is strong but that a bit modification would be worth exploring, rounding it out a bit maybe, exchanging the counter in the lowercase \"a\" with a drop shape. Stick with simple, the old saying is true \"less is more\". Make sure it reproduces in very small sizes.\n\n"
    },
    {
      "time": "10 Jan 2007 — 12:45pm",
      "content": "Hi all,\n\nI've finally had a chance to get back to work on my logo. Now I'm definitely in a rush to get it done.\n\nAs you can see, I've gone in another direction. A couple of months ago I did some sketching. The strongest sketch was the ariel view of a bird on a fountain. I'm going for something fairly stylized. I'm pretty sure I'm happy with the image but I'm worried that the type may be taking a way from it.\n\nThat said...what do you think? I've looked at this for too long and need fresh eyes.\n\nThank you for your help.\n\n ![](http://web.archive.org/web/20130515040931im_/http:/typophile.com/files/hydratebird2_4752.jpg)\n\n"
    },
    {
      "time": "10 Jan 2007 — 2:38pm",
      "content": "There are several problems with this logo idea ( as presented) that I see:\n\n- Neither the bird nor the water thing ( bird bath fountain? how can we guess?) is shaped so that it is recognzeable instantly. And it's not thet you have an aha moment either. They are just not strong.\n\n- the color is essential to the logo making sense. This is not good. it may need to be in in B&W.\n\n- the blue when printed in B&W (unless you make special b&w version which might be accidentally NOT used) will print as dark obscuring the name\n\n- The letters are placed so closely to gether that they dont read very effectively especially the lowercase.\n\nMy advice. Make it work in B&w first so that color is a bonus but not required, Make your bird more birdlike. Conside a different angle. Find somebody who can draw if you cannot. Make the name bigger or clearer or both.\n\nAnd keep considering new ideas. What about a storm cloud with reversed white on grey type? You could use a photo or get a weather icon. What about a watering can? What about a melting ice cube - you could write the name out with your finger on glass so the meltwater spells it out. Or the reverse use a glass that has been sprayed and is beaded up with water. Then use your finger ( or whatever) to make the beads join and up flow away revealing your letters...\n\ngood luck!\n\n"
    },
    {
      "time": "10 Jan 2007 — 4:16pm",
      "content": "Eben,\n\nThanks for the comments. I was wondering if it was recognizable as a bird...I agree a stylized bird from this angle is a little more difficult read. And the text is crowded. I think I knew that when I got up this morning but kept trying to tweak it instead of backing away and trying something else\n\nThe storm cloud idea is interesting especially since I used a cloud in the logo I designed for my previous name...starlux (see attached). It may be nice way to transition to a the new name.\n\nI'll keep working and post again soon.\n\n ![](http://web.archive.org/web/20130515040931im_/http:/typophile.com/files/starlux_logo_4489.jpg)\n\n"
    },
    {
      "time": "10 Jan 2007 — 6:12pm",
      "content": "I quickly put this together to get feedback. Let me know what you think. \"r\" is used as a faucet in this series (except for 7a).\n\nUnfortunately, I'm considering just scrapping it all and going back to the first solution minus the fills, because I need to get this done quickly.\n\n ![](http://web.archive.org/web/20130515040931im_/http:/typophile.com/files/hydrate7_6342.jpg)\n\n"
    },
    {
      "time": "11 Jan 2007 — 12:36am",
      "content": "<cite> The storm cloud idea is interesting especially since I used a cloud in the logo I designed for my previous name…starlux (see attached). It may be nice way to transition to a the new name. </cite>\n\nGOOD POINT!\n\nIf you are hell bent on getting it done & I have to pick I would go with 7a but I would go over my letter spaces and think about a 50% grey for the drop (or 33%?), and find a way to make the 'a' seem more pefectly distorted.\n\nI do like the cloud idea though. What if the h & d ( maybe t) were made rom rainshower lines coming down from the cloud maybe at an angle?\n\nWhat if you took a laser printed page & put it under water & made the water wobble & took photos? Then took the image into illutrator & made new outlines using the watery distortion?\n\n"
    },
    {
      "time": "11 Jan 2007 — 6:55am",
      "content": "I don't see any images. Are you uploading CMYK JPGs?\n\n"
    },
    {
      "time": "11 Jan 2007 — 10:06am",
      "content": "I see the images. When I copy them into an image editing program they appear to be RGB. Unless it's switching it on the fly which I mostly doubt. What browser have you got?\n\n"
    },
    {
      "time": "11 Jan 2007 — 10:15am",
      "content": "Aluminum, I checked and the only image that is a CMYK JPG is the on the last post I made. I'm reattaching an RGB version. Eben, I like the last idea you suggested. I think I'll give that a shot and the cloud idea too.\n\n ![](http://web.archive.org/web/20130515040931im_/http:/typophile.com/files/hydrate7_5559.jpg)\n\n"
    },
    {
      "time": "11 Jan 2007 — 12:36pm",
      "content": "I would explore something like a bottle being filled.\n\n"
    },
    {
      "time": "11 Jan 2007 — 1:06pm",
      "content": "Ooh - 7e - you could do something subtle with the counter of the 'A'.\n\n- Lex\n\n"
    },
    {
      "time": "11 Jan 2007 — 2:27pm",
      "content": "now I see it!\n\nThese all seem a bit too literal.\n\nI like Lex's idea. Make it subtle.\n\n"
    },
    {
      "time": "14 Jan 2007 — 3:14pm",
      "content": "I lik 1b from the first concepts. The faucet one doesn't attract me as much.\n\n"
    },
    {
      "time": "15 Jan 2007 — 11:25am",
      "content": "I like Lex's idea as well. I just had a quick moment to try it out. I used Din this time and then rounded the corners. Is the space between the R and the A weird?\n\n ![](http://web.archive.org/web/20130515040931im_/http:/typophile.com/files/hydrate8_5271.jpg)\n\n"
    },
    {
      "time": "15 Jan 2007 — 1:08pm",
      "content": "Sorry about that. Looks like I uploaded another cmyk jpg on the last post. Try this.\n\n ![](http://web.archive.org/web/20130515040931im_/http:/typophile.com/files/hydrate8_5917.jpg)\n\n"
    },
    {
      "time": "15 Jan 2007 — 1:21pm",
      "content": "I like this one.\n\nAs for the kerning, I'm no expert, but I think since \"HYD\" can't be kerned any closer, and neither can \"RA\" or \"TE\", maybe \"DR\" and \"AT\" could be opened up a tiny bit. But again, I'm really bad with kerning, and someone else will probably come by and say the opposite of what I just said.\n\n- Lex\n\n"
    },
    {
      "time": "15 Jan 2007 — 2:27pm",
      "content": "It's a logo. You can modify the letterforms specially. You SHOULD even. I would open up the kerning & try it in a green box with white text & the blue droplet maybe.\n\n"
    },
    {
      "time": "30 Jan 2007 — 4:19pm",
      "content": "I'm back. I altered the \"R\" some. I didn't like the way the R and A worked together in the previous version. Eben, I tried your suggestion of reversing the type on green. I think it looks pretty nice. I also tried a slightly different approach with series 9.\n\nI think for now I'll stick with the 8 series.\n\n ![](http://web.archive.org/web/20130515040931im_/http:/typophile.com/files/hydratemore_3899.jpg)\n\n"
    },
    {
      "time": "30 Jan 2007 — 4:46pm",
      "content": "I like the droplet in the A. Simple, clever, and memorable without being dull.\n\nIf you're going to amputate the foot of the R, perhaps amputating the hands of the Y would make it seem ... well, a less random amputation? Right now, it feels a bit like a random act of violence :)\n\nAK\n\n"
    },
    {
      "time": "30 Jan 2007 — 5:10pm",
      "content": "Thanks Alaskan.\n\nI'll try that.\n\n"
    },
    {
      "time": "30 Jan 2007 — 6:59pm",
      "content": "You could also connect the R & A. Instead. I don't think I agree with Alaskan's eye-for-an-eye model of type violence...\n\nAlso - I like the 8c. The 'violence' catches my eye, makes me look at the droplet ( a tiny bit more saturated blue maybe ), then I read the name, I get it & I will remember the logo. Is it perfect? Not sure. You might want to try other things, but I would put 8c aside as something that might be a keeper. It works better in the box for sure. 8c is the 1st in the series I would be willing to wear on a tshirt. See what I mean?\n\n"
    },
    {
      "time": "31 Jan 2007 — 10:30am",
      "content": "I tried cutting off the hands of the Y but the spacing didn't work out so well.\n\nAs you can see I progressively altered the individual letters. In versions g-i, I added slab like pieces to the Y to try to balance things better. I'm wondering though if it is getting progressively noisier.\n\nRight now I'm thinking version 8e, 8f, 8g are closest to working.\n\n ![](http://web.archive.org/web/20130515040931im_/http:/typophile.com/files/hydrate_series8_5775.jpg)\n\n"
    },
    {
      "time": "31 Jan 2007 — 11:23am",
      "content": "Yeah, this is getting busy and loosing it's elegance and power. Except for 8d & 8e, either of which are nice and strong!\n\n"
    },
    {
      "time": "31 Jan 2007 — 11:38am",
      "content": "Thanks for your help Eben. I'm going to let it rest for a little bit but I think I'm going to go for 8d. We'll see. :)\n\n"
    },
    {
      "time": "31 Jan 2007 — 11:39am",
      "content": "Yeah, I would go 8d too. Have you locked up the domain name?\n\n"
    },
    {
      "time": "31 Jan 2007 — 11:42am",
      "content": "hydrate.com was taken. So I bought hydratecreative.com. I won't be using \"creative\" in the logo though.\n\n"
    },
    {
      "time": "31 Jan 2007 — 11:44am",
      "content": "I agree with Eben about too much going on, in many ways I think to go back to 8a and increase the kerning, specifically the DR and slightly the ATE, would be best. Let the drop be the stand-out item.\n\nTim\n\n"
    },
    {
      "time": "5 Feb 2007 — 5:35pm",
      "content": "hope you don't mind ... noticed an avenue you hadn't explored as far as I could tell ...\n\n ![](http://web.archive.org/web/20130515040931im_/http:/typophile.com/files/hydrate_concept_6310.gif)\n\n----------  \n**Paul Ducco**  \n [Design, Melbourne](http://web.archive.org/web/20130515040931/http:/www.solid-creative.com/print.htm)  \n----------  \n [Little Mischief](http://web.archive.org/web/20130515040931/http:/www.littlemischief.com/)\n\n"
    },
    {
      "time": "5 Feb 2007 — 5:48pm",
      "content": "Paul, I'd actually use the drop as the 'D' and rotate it about 30 degrees CC. I'm reading \"HYDROTE\" right now.\n\n- Lex\n\n"
    },
    {
      "time": "5 Feb 2007 — 7:00pm",
      "content": "yep. also considered that Lex. didn't want to spend too long on it eh. nor turn every stone over.\n\n... or a gradient in the A fading to transparent below the baseline\n\n:)\n\n----------  \n**Paul Ducco**  \n [Design, Melbourne](http://web.archive.org/web/20130515040931/http:/www.solid-creative.com/print.htm)  \n----------  \n [Little Mischief](http://web.archive.org/web/20130515040931/http:/www.littlemischief.com/)\n\n"
    }
  ]
}
