{
  "id": "29078",
  "title": "International Freelancers",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hi everyone !\n\nThis time, I've got 2 (super interesting, of course) questions for you guys :\n\n1rst \\> Is the \"Graphic Artists Guild Handbook\" really good? And do u think it applies to all designers in the world or is it just for freelancers in the US only?\n\n2nd \\> How much would you price for this ; logotype + stationery + brochure + website interface design  \nI know what I'm going to price for this but I'm really interested in what YOU would price according to where you're from (so if you could also specify which country you work from, that'd be great).\n\nThanks a lot ! Hope to get lots of answers !\n\nVirginie (from France)\n\n",
  "author": "drduckling",
  "time": "26 Oct 2006 — 7:28am",
  "uid": "14086",
  "comments": [
    {
      "time": "26 Oct 2006 — 8:27am",
      "content": "Are you going to commission a custom typeface?\n\nhhp\n\n"
    },
    {
      "time": "26 Oct 2006 — 9:15am",
      "content": "a mil.\n\n"
    },
    {
      "time": "26 Oct 2006 — 9:31am",
      "content": "Ah, just random while reading your post, I took it away.  \nI can't be of any help for you, sorry about that.\n\n"
    },
    {
      "time": "26 Oct 2006 — 10:04am",
      "content": "hrant, I'm talking about design fees only, no printing or font buying fees, etc.  \nAllessandro, what's with the URL?  \nMiles,\"a mil\"?\n\n"
    },
    {
      "time": "26 Oct 2006 — 10:12am",
      "content": "Virginie,\n\nI would think the book could provide you with some very useful information. The book is, however, directed at those practicing in the U.S. and so you would have to find a way to know your rights in comparison.\n\nThe topic of pricing for font design has been discussed here before. Let me see if I can't provide you with some threads.\n\n"
    },
    {
      "time": "26 Oct 2006 — 10:15am",
      "content": "[The High Price of Type](http://web.archive.org/web/20150122084318/http:/typophile.com/node/15647)  \n [Commercial & Custom Type](http://web.archive.org/web/20150122084318/http:/typophile.com/node/4320)  \n [Is there anyone out there with freelance experience... .](http://web.archive.org/web/20150122084318/http:/typophile.com/threadrss/27621)\n\nHope these help.\n\n"
    },
    {
      "time": "26 Oct 2006 — 10:17am",
      "content": "Fonts are designed too you know.  \nFWIW, my question was a variation on my usual \"Where's the type?\"\n\nhhp\n\n"
    },
    {
      "time": "26 Oct 2006 — 10:27am",
      "content": "No, I meant : what would u price to design a company's logotype, stationery and brochure (for example), of course that includes the work you do with fonts and eventually customizing them but I am talking about the whole thing. Let's say that I ask you to design all this for me, how much would you make me pay? Do u know what I'm talking about?\n\n"
    },
    {
      "time": "26 Oct 2006 — 10:31am",
      "content": "Thanks for that Tiffany, I missed those, ciao.\n\n"
    },
    {
      "time": "27 Oct 2006 — 3:01am",
      "content": "Nobody willing to help me on this ?\n\n"
    },
    {
      "time": "27 Oct 2006 — 3:26am",
      "content": "The cost of a design project rather depends on the general price level in your country, the size of the company you're designing for, on how famous and/or experienced the designer is, the size of the job etc, etc\n\nI just had an offer turned down, and I don't know for sure, if I was more expensive or a lot cheaper than the others in the race, but I suppose a bigger company with more name got it. I guess it's just one of those things you have to figure out yourself. In Finland cartels are illegal, so the local graphic designers' association has stopped giving any guidance on pricing. They had a kind of a price list after a query amongst the members in 1996, and it gives you some idea of the variation of the fees, when the price range for designing stationary for a local company was from 250 € to 2000 € then.\n\n"
    },
    {
      "time": "27 Oct 2006 — 5:48am",
      "content": "Pricing has always been a frail issue for designers. Everyone wants to know what others charge so they can guage their own price in the market place. You can find the \"Logo for $50 guy\" who spends 15 minutes slapping some clip art together. You can also go to a major marketing and adverting firm and pay $1,000,000 for a rebrand. Both prices are out of line. My advice would be to figure out how many hours you would spend doing a particular job and figure a fair hourly rate in your country to do the work. Add in materials and overhead costs. then add a reasonable profit margin. If you are new and inexperienced, you may need to charge less than whatever the going rate is in your area. As Tiffany says, the Guild book is based on survey responses in the USA. Whether the people who responded to the survey were either honest or accurate is your guess but it is a least a starting point. I have noticed that prices have seemed to go down recently. Perhaps there are plenty of hungry good designers who need work and perhaps there are now a bounty of wanna-be designers who charge minumum wage to do some almost design work. To quote our own James Montalbano, \"Graphic design is the new acting.\"\n\nChrisL\n\n"
    },
    {
      "time": "27 Oct 2006 — 9:04am",
      "content": "I've been trying to tell you, we're (almost) entirely a type joint here.\n\nhhp\n\n"
    },
    {
      "time": "30 Oct 2006 — 3:49am",
      "content": "Virginie you won't get a straight $ answer to your question #2 in this forum for the reasons cited above.\n\nYears ago (in New Zealand) I quoted on a job similar to yours; logo + stationery + brochure + website (the only difference being that it also included signwritten livery for a helicopter fleet – there's some type application for you, Hrant). The guy handling the commission told me I overpriced the bid by a factor of two. So they went with someone else who promptly blew the 'budget' out of the water and (naturally) delivered an inferior design...\n\nMy simplistic take on what Chris is quoting James as saying is \"will work for work...\" The popularity of graphic design as an activity turns it into a buyers market, usually to the detriment of the quality of work produced.\n\nA telling illustration of this was the free ads I noticed one night in my local supermarket lobby; on the pre-printed cards under the strip lighting were a couple of hand-written ads proclaiming 'Web designer' and 'Graphic designer' for hire – both with several years' experience and accompanying software skills and mobile numbers. Well it's one way to pay back the student loan I suppose.\n\n"
    },
    {
      "time": "30 Oct 2006 — 6:35pm",
      "content": "Greetings from Brazil. In 1998 ADG (the national association of graphic designers) developed (or at least made an attempt to develop) some sort of rice table. The table has been then reviewed and updated in 2002 and published in a book. In this book there's an explanation of how they came up with the prices.The reference table has been developed as a tool to give a notion for graphic design projects and was based on prices asked by members of ADG in Sao Paulo, which is the most developed part of Brazil in terms of graphic design market. However, socio-economic characteristics do change a lot within the country so even considering inflation etc. I think it's a very difficult job for them to keep this table up-to-date and consistent with the reality of the market. Plus the profession is not officially recognised here, which is crazy I know. I don't know if graphic design associations in other countries do publish this kind of tables of reference, maybe you should contact them. Hope this helps.\n\n"
    }
  ]
}
