{
  "id": "2907",
  "title": "\"Grand Hotell\" logo",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Does anyone know this font please.   \nSome Copperplate version maybe? ![](http://web.archive.org/web/20050516142453im_/http:/www.typophile.com/forums/messages/83/25207.gif)\n\n",
  "author": "kari",
  "time": "Fri, 2004-01-30 04:05",
  "uid": "2987",
  "comments": [
    {
      "time": " Fri, 2004-01-30 08:08",
      "content": "It's definitely no version of Copperplate Gothic. Can you give us any idea about the age of this sample? The typeface looks like something quite old (75-100 years old) would be my first guess, and quite possibly never made as a digital font.   \n   \nI am hunting my type books now, but it would help to know the era that this sample comes from.\n\n"
    },
    {
      "time": " Fri, 2004-01-30 14:18",
      "content": "To me it's clearly a handdrawn custom logo. Cantoria is very well designed. It would require a real pro to hack it to obtain such an ugly logo.\n\n"
    },
    {
      "time": " Fri, 2004-01-30 15:50",
      "content": "We still haven't heard that this comes from something new enough to have been done digitally. I agree Cantoria (or Della Robbia),or Flange, or Newtext, or other current fonts could be manhandled to look like this, but it may be that an old European metal type was exactly this face. I wish the poster Kari would give us a clue about the origin of this sample. The spelling of Hotell already suggest a continental European origin, and I for one have a very weak knowledge of Continental typefaces.\n\n"
    },
    {
      "time": " Mon, 2004-02-02 05:45",
      "content": "Hello, and thanks for all help.   \nThe hotel is build in the beginning of the 19th   \ncentury. I dont know mutch more about it.   \nSe theirs homepage at: [http://www.grandmarstrand.se/](http://web.archive.org/web/20050516142453/http:/www.grandmarstrand.se/)   \n   \nI think i can use Cantoria to make a new original logo for them. That will be a god start.   \n   \nThis is the first time i use this forum, i'm impressed for the fast support and help i got.   \n   \nI will be back, and help others if i can.\n\n"
    },
    {
      "time": " Mon, 2004-02-02 08:10",
      "content": "Looking at that web site, the lettering of \"MARSTRAND\" added an M and and S. I think [Della Robbia](http://web.archive.org/web/20050516142453/http:/www.myfonts.com/fonts/bitstream/della-robbia/bold/testdrive.html?s=GRAND%2BHOTELL%2BMARSTRAND&p=36) is a closer starting point, and it comes from a closer time period (designed in 1902). Note the crotch of the M is higher and the serifs on it have a closer look to the lettering on the site. Thomas Cleland made Della Robbia based on rubbings of stonecut letters he saw in Rome, so the letterforms are certainly old enough to perhaps have influenced the designer of this typeface too. (Of course, when the hotel was built does not prove when the typeface was designed, but I am assuming this typeface has been used by them for a long time.)\n\n"
    }
  ]
}
