{
  "id": "29071",
  "title": "Advice on logotype file production for print",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,\n\nI'm after some straight forward advice on what I need to look out for when producing finished art for a logo.\n\nI know that a logo will usually be supplied in various colour spaces (say Spot PMS and 4-colour process). Logo's are usually supplied at different sizes like tiny, regular, and super large. I'm guessing this is because special attention needs to be given to whitespace and kerning, particularly at smaller sizes.\n\nIs that it though, or are there other things I should be looking for?  \nI imagine that these different sizings are best tested on a laser printer and not just on screen?  \nIs there any standard dimensions or ball-park figures that designers will typically use for the different sizings?\n\nThanks,  \nJonny Schneider\n\n",
  "author": "JonnySchneider",
  "time": "25 Oct 2006 — 8:40pm",
  "uid": "11331",
  "comments": [
    {
      "time": "25 Oct 2006 — 9:28pm",
      "content": "Jonny, I dont think that there are any standard dimensions available for the sizing. Its totally depends on where we are using and what kind of logo it is.  \n:)\n\n"
    },
    {
      "time": "25 Oct 2006 — 10:09pm",
      "content": "Yep, I'm not looking for dimensions to the millimetre, i'm curious about roughly what sort of intervals I should be looking at. Like say, 20x20mm, 50x50mm, 150x150mm, 500x500mm?\n\nIt's a very simple logo. Symetrical vector shapes for the mark, simple text in Klavika for the words.\n\nIt will be used for a lot of applications. www, highspeed web offset, standard offset litho, substrate banners for exhibitions etc.\n\nI'm just curious, because so many times I get logo artwork from clients as giant .TIF files, when its intended application is a tiny thumbnail for web - and it gets pretty tricky make that sort of thing work.\n\n"
    },
    {
      "time": "25 Oct 2006 — 11:06pm",
      "content": "hmm, you might want to look up style guides companies post about their logos. They regulate the size they can be shown, the colours, the varations, etc. You can probably find a lot of pdf's by googling for them.\n\nWhat the client gets depends on what they pay for and what you percieve is worth the price. For instance you might not want to give the client vector editable files so they try to change it themselves. Other clients might ask you to put it in word so they can edit it themselves or some other rediculous request. Also if you give them the vector files then you give them more control over reproduction of your artwork, which depending on your agreement (or lack there of) could determine what end files they get.\n\nI think mainly it depends on the logo design and there is probably no really established standards for this. If for instance the logo usually includes the tagline, then when reproduced for smaller usage the tagline should be ommited if it becomes unreadable.\n\n"
    },
    {
      "time": "26 Oct 2006 — 4:09am",
      "content": "Jesse, I don't think giving the client vector files is a risky business. They can squeeze everything anyway ;)\n\nAs for the logo - you might be aware of dot gain and its influence on white space, limited colour palette when applying the logo with graphic marking film. Consider monochromatic version of the logo, vertical/horizontal version (when reproducing on pen or vertical flag), inverse version (when reproducing on bright/dark materials). Consider CMYK, RGB, Pantone (and maybe RAL/NCS etc.) colour specifications.\n\nIt's a good idea to look into some Corporate Identity Manuals.\n\n\\_\\_\\_\\_\\_\\_\\_  \nAL  \n [lenart.pl](http://web.archive.org/web/20131017054242/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": "26 Oct 2006 — 7:06am",
      "content": "In the situation where you are printing a logo onto a coloured background the logo will knockout the background colour, in order to avoid a white line showing when the plates are out of alignment, it is normal practise to add a hairline stroke to the outside of the logo with the overprint box checked. Because the stroke will scale up and eventually become noticeable a large, medium and small logo are normally required, added to this the kerning (think about closing up any graphic elements too) would usually be tighter for an exhibition graphic than a business card.  \nAs for sizes I would supply them so that for a simple logo the smallest it should ever be used is, for example, 20mm I would create the logo in Illustrator at 25mm with a 0.2pt overprinting stroke for use in most stationery applications, a medium one of say 80mm with a 0.2pt overprinting stroke and a large one of say 150mm, these sizes are merely guesses and depend on the ultimate usage and printing processes. Other things to bear in mind might be to provide a monocolour logo for use with spot UV, foil blocking or embossing and one for reversing out based on your three previous sizes although without the overprint. You may also provide an instruction to the user that the small one may not be used less than 100% or larger than 200%, when the medium one takes over at 50%.  \nApart from web use always use a vector based file as the overprint cannot be transferred to a photoshop file.  \nWeb use might need a slightly more open version and a larger minimum size.  \nAs for checking them the only real way is to print it using the process the logo is designed for, get a friendly printer to tag it onto the side of a live job.  \nTim\n\n"
    },
    {
      "time": "26 Oct 2006 — 7:07am",
      "content": "You make as many sizes as needed/wanted. There is no hard and fast rule about this. Some logos work great as-is at any size. Some need tweaking for various applications. I often tweeak GIF/JPG versions for on-screen use, for instance.\n\n"
    },
    {
      "time": "26 Oct 2006 — 9:46am",
      "content": "No matter how thorough you think you are being, the client will always appear later saying they lost the disk with all of the files and could you please re-create. So, I recommend covering the basics and letting them work with those. Pad the bill just enough to cover any future tweaks or let them know they can always come back to you for work later. Hopefully you've created an inviting situation and they will return to you for other work anyway.\n\n"
    },
    {
      "time": "26 Oct 2006 — 7:26pm",
      "content": "Thanks everyone,\n\nespecially timd, that was exactly the response I was after.  \nYour talking about trapping, and have perfectly explained why there is a need for different sizes. Great. I feel smarter now!\n\nDot gain will be an important consideration for this at small sizes, since it will be most often reproduced for newsprint, with significant dot gain, somewhere around 30% for this publication. This means I'll need to give generous kerning at small sizes right?\n\nReversed out versions were always on the cards, good suggestion for a monocolour though. With all these logos, I think a table of files and definitions will also be in order.\n\n<cite>No matter how thorough you think you are being, the client will always appear later saying they lost the disk with all of the files and could you please re-create.</cite>\n\nIndeed.\n\n<cite>Hopefully you’ve created an inviting situation and they will return to you for other work anyway.</cite>\n\nYes. This is exactly how I came to get this gig in the first place - I've done quite a bit of work with them and it has turned into a great professional relationship. I'm actually tedesigning (more like tidying up) their existing identity.\n\nThanks again... great advice.  \nJonny Schneider\n\n"
    },
    {
      "time": "26 Oct 2006 — 8:14pm",
      "content": "Also feel free to post the identity your working on so we can take a look!\n\n"
    },
    {
      "time": "30 Oct 2006 — 6:37pm",
      "content": "I've posted work in progress on this logo to the critique forum:  \n [http://typophile.com/node/29182](http://web.archive.org/web/20131017054242/http:/typophile.com/node/29182)\n\n"
    },
    {
      "time": "31 Oct 2006 — 8:01am",
      "content": "Does anyone still bother providing different sized logos? I've not seen any for a while. Isn't the trapping problem better dealt with at production or prepress rather than at the design stage?\n\nIt can be useful for your master logo to be 100mm across, then it's easier to scale to percentage values.\n\nNo-one ever seems to supply RGB vector artwork, very handy for screen/MS Office based work.\n\n"
    },
    {
      "time": "31 Oct 2006 — 8:27am",
      "content": "\\>It can be useful for your master logo to be 100mm across, then it’s easier to scale to percentage values.\n\nWhile that is useful I normally provide logos at the minimum intended size with an invisible box to indicate the exclusion area. While prepress should deal with trapping, clients are inclined to go with cheapest options where finished quality is not always the prime mover.\n\nTim\n\n"
    },
    {
      "time": "31 Oct 2006 — 10:52am",
      "content": "I provide different sizes depending on the logo. I have one logo with one main word and one tiny word. But when i reduce the logo size i need to make the tiny word bigger so people can read it. It just doesn't look as good so I provide two sizes for the logo.\n\n"
    }
  ]
}
