{
  "id": "29083",
  "title": "(x) Oxford University Press serif text face - Caslon {Mike Y}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi, I'm new here.  \nI have admired for a long time Oxford University Press books (not talking about World's Classics), particularly books published in the '60s and was wondering  \nif anyone here is familiar with them. It's a font I've seen in most of their books from that period, it is perhaps a version of garamond or janson.  \nI'll try and post some photos tomorrow if no one is familiar with the topic offhand.  \nCheers.\n\n",
  "author": "byronic",
  "time": "26 Oct 2006 — 8:31am",
  "uid": "15126",
  "comments": [
    {
      "time": "26 Oct 2006 — 10:18am",
      "content": "We have had this topic before, and the typeface in question was 'Pegasus' by Matthew Carter, based on a design by Berthold Wolpe. You can see a sample from the Serif Font ID Guide [here](http://web.archive.org/web/20150419063631/http:/bowfinprintworks.com/SerifGuide/serifsamples/serif_op/pegasus_full.gif). Is that the typeface you were interested in? (As far as I know it is not available to the general public)\n\n- Mike Yanega\n\n"
    },
    {
      "time": "26 Oct 2006 — 10:22am",
      "content": "I just looked at my information about Pegasus, and Carter's version of the 1937 Wolpe design was done in 1982, so if you really mean the 1960's, then I guess we'll need to see your sample to ID it.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "26 Oct 2006 — 1:00pm",
      "content": "Thanks for the reply, but no, the typeface I'm looking for is more slender and to my eyes, more conspicuosly antique.  \nI'll try to take some samples tomorrow.  \n(Many of the books I'm thinking of, are part of OUP's Oxford English Texts series.\n\n"
    },
    {
      "time": "27 Oct 2006 — 5:58am",
      "content": "Here are the samples. I'm pretty sure it is a version of garamond (could be wrong), but I'd like to know which precisely. That numeral 5 is slightly odd, and I think I've seen it in a font somewhere.  \nThe book is Jonathan Swift's 'A Tale of a Tub', a 1973 reprint of a 1958 edition.\n\n ![](http://web.archive.org/web/20150419063631im_/http:/typophile.com/files/Billede%20024_6634.jpg)\n\n ![](http://web.archive.org/web/20150419063631im_/http:/typophile.com/files/Billede%20025_5601.jpg)\n\n ![](http://web.archive.org/web/20150419063631im_/http:/typophile.com/files/italic_5762.jpg)\n\n"
    },
    {
      "time": "27 Oct 2006 — 8:52am",
      "content": "I think this is a Caslon, but I will need to look some more to try to decide which version.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "27 Oct 2006 — 9:05am",
      "content": "I think [Caslon Old Face](http://web.archive.org/web/20150419063631/http:/www.myfonts.com/fonts/bitstream/caslon-old-face/) looks very close. Notice the top of the A, and certain other earmarks, such as the Roman and italic 'g'. There is a Lanston version called Oldstyle 337, which may be closer, looking at the FontBook sample, but I couldn't immediately find it online. There is likely to be a disconnect between existing digital type and the metal type that was probably used for printing the books, but that is my pick so far, as the closest version of Caslon.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "27 Oct 2006 — 9:13am",
      "content": "Certain letters that I didn't see in your sample would make identifying it easier, such as C, Q, y, M, K, R and W. You could try using the [Serif Font ID Guide](http://web.archive.org/web/20150419063631/http:/bowfinprintworks.com/SerifGuide/serifsearch.php), if you have some of those letters, since they are shown in the key samples. You can select 'close' ones and compare them further against each other, including the italics for many of the fonts.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "27 Oct 2006 — 9:21am",
      "content": "Thanks guys, I think Caslon is the right direction, I don't know why I didn't see that. Probably because I don't have a great liking for Adobe's Caslon.\n\n"
    },
    {
      "time": "27 Oct 2006 — 9:30am",
      "content": "Have a look at the [Lanston version of Caslon](http://web.archive.org/web/20150419063631/http:/www.p22.com/lanston/products/caslon.html). You might like it more.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "27 Oct 2006 — 9:46am",
      "content": "From looking at your serif ID site, I think the Lanston 337 comes closest.  \nThanks again.\n\n"
    },
    {
      "time": "16 Oct 2013 — 4:07pm",
      "content": "I'm reading Trevelyan on _England Under Queen Anne_, Oxford U P 1930, and found this discussion after wondering about the typeface.\n\nThis book (see link below, I'm not grasping the HTML instructions below) suggests that the font may be a variant of Caslon called \"Imprint,\" designed in 1913 by Ernest Jackson and Edward Johnston; it \"later became the favorite typeface of Oxford University Press.\" The capital \"J\" in my book resembles Imprint more than it does the Caslon Old Face.\n\n[Fonts & Encodings](http://web.archive.org/web/20150419063631/http:/books.google.com/books?id=qrElYgVLDwYC&pg=PA389&lpg=PA389&dq=%22oxford+university+press%22+caslon+font&source=bl&ots=4hvBt_6XLO&sig=Dhp-t2e20WrcJsG-jO9s0vSWcWg&hl=en&sa=X&ei=vxlfUoD3HebQ2QW-moGYDw&ved=0CDoQ6AEwAg#v=onepage&q=%22oxford%20university%20press%22%20caslon%20font&f=false)\n\n"
    }
  ]
}
