{
  "id": "2908",
  "title": "A 5M pt banner",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "From the sublime to the ridiculous, we can go from Mark's Mostra to [Pacmania](http://web.archive.org/web/20050516142457/http:/simplythebest.net/fonts/fonts/pacmania.html) and perhaps find something with closer letterforms, but this sort of geometric work with landscape doesn't need a font (obviously).\n\n",
  "author": "bowfinpw",
  "time": "Fri, 2004-01-30 07:18",
  "uid": "2088",
  "comments": [
    {
      "time": " Fri, 2004-01-30 07:58",
      "content": "Milton Glaser's Baby Teeth would also work. I don't know of a good source for a digital version though.\n\n"
    },
    {
      "time": " Fri, 2004-01-30 12:43",
      "content": "It sure is an interesting way to design type, plant a forest.\n\n"
    },
    {
      "time": " Fri, 2004-01-30 15:45",
      "content": "Only an American could relate fascist lettering to the Pac-man logo or Milton Glaser's Baby Teeth. I've already told Mark his Mostra is very nice, but you have to be grown up in Italy to \\*feel\\* what the fascist aesthetic was about. The reworking of roman aesthetic was the basis of all this.   \nFor the same reason P22's Il Futurismo sucks big time.\n\n"
    },
    {
      "time": " Fri, 2004-01-30 15:48",
      "content": "BTW, the best example of typeface drawn after Pac-Man's logo is Ray Larabie's Crackman. Very good.\n\n"
    },
    {
      "time": " Fri, 2004-01-30 16:04",
      "content": "Claudio,   \n   \nMaybe we missed the poster's point, but politics aside, our job here is usually to try to help someone find a font that is (or resembles) their sample. It's fine for you to say it's Fascist, but they are still letterforms, and as stupid as it sounds the Pacman/Baby Teeth fonts use some very similar shapes. Larabie's imitation is a better Pac-Man simulation, but the shading was not present in the tree shapes, so I picked a Pac-Man font that was just geometric shapes. It's an exercise for fun, not a reason for polemics.\n\n"
    },
    {
      "time": " Fri, 2004-01-30 16:19",
      "content": "Sorry for the double post. I got a message that the connection failed. I guess it didn't really.\n\n"
    },
    {
      "time": " Sat, 2004-01-31 06:45",
      "content": "Mike when you get an error message, just go back then to topics and come back and like magic your post is posted. Works every time.\n\n"
    },
    {
      "time": " Sat, 2004-01-31 07:36",
      "content": "Thanks Dan. I think it's happened that way before, but I wanted to make sure (especially) that time.\n\n"
    }
  ]
}
