{
  "id": "29108",
  "title": "Studying Typography in Higher Education",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've been wondering for some time about this. I'm in high school right now and lately I've realy wanted to explore a carrer in typography, possiblely as a type designer, graphic design with a typography specialization, ect. I've been looking at universities, and I wanted to know 1. what degree would I pursue for a career like that and 2. what schools specialize in this field.\n\nI live in Los Angeles, California, so I've been looking at the Art Center College of Design and Laguna College of Design. I would rather go to school on the west coast, but I'm interested on what you all (as experts in the field) know.\n\n",
  "author": "alexhb",
  "time": "26 Oct 2006 — 9:41pm",
  "uid": "7571",
  "comments": [
    {
      "time": "26 Oct 2006 — 9:56pm",
      "content": "There are two full-time typeface design degree programs in the world: one at Reading University in the UK, the other at the KABK in the Netherlands. But I know the former is Masters level, and I suspect the latter has steep entry requirements as well.\n\nI myself teach a typeface design course at ArtCenter, Thursday nights.\\* One reason I would recommend trying that first is you need to make sure you really like the idea of designing type before committing to it, since it's really a strange, strange field... :-) BTW, you mention that you're in high school - I think ArtCenter has special deals for high schoolers.\n\n\\* [http://typophile.com/node/27672](http://web.archive.org/web/20120426200206/http:/typophile.com/node/27672 \"http://typophile.com/node/27672\")\n\nhhp\n\n"
    },
    {
      "time": "27 Oct 2006 — 2:58am",
      "content": "It's not a strange field, it is different from most of the design jobs considered under a survey, route and gaze perspective : mental representations of environmental spaces can be viewed in any three different ways (Tversky, 2004), most probably the same is true for the cognitive collage of the space of design research in typographic art and fontography.  \nNo other design discipline requires so much learning and training as fontography, and by no other aspect can amateurs be so easily distinguished from professionals.  \nYou might find useful what Sebastien Sanfilippo shared :  \n [http://typophile.com/node/17612](http://web.archive.org/web/20120426200206/http:/typophile.com/node/17612 \"http://typophile.com/node/17612\")\n\n"
    },
    {
      "time": "27 Oct 2006 — 7:07am",
      "content": "According to the KABK website their Type and Media program is a masters level course as well.\n\nedit: It's listed under the masters programs but is called a post-graduate program in the specific course description.\n\n"
    }
  ]
}
