{
  "id": "29126",
  "title": "Sans-serif face for a 'designer-tabloid'?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi all,\n\nI’ve recently taken on the job of redesigning a reputable student newspaper (print) here in the UK and am looking for a Impact-like sans-serif face to use as a foundation for the construction of the paper (to be used for article titles etc.)\n\nThe audience is university students from first to third year, typically 19-25 year olds. The stress in the brief is on accentuating the ’hard news’ aspect of the paper, but with a contemporary designer’s touch (not my words). Something with visual impact, but without being too clunky.\n\nAbsolutely any suggestions would be greatly appreciated! Do ask if you need any more information, too.\n\nThanks,  \nJez.\n\n [‹ Typography research for a magazine design project](http://web.archive.org/web/20071009143457/http:/typophile.com/node/29139 \"Go to previous forum topic\") [The Search: Part 3 — Serif For FUTURA (or) Sans For ADOBE GARAMOND ›](http://web.archive.org/web/20071009143457/http:/typophile.com/node/29106 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071009143457/http://typophile.com/user/12076\" title=\"View user profile.\">baskervillain</a>",
  "time": "<br>",
  "uid": "12076",
  "comments": [
    {
      "time": " 27.Oct.2006 1.29pm",
      "content": "FB Amplitude.\n\nhhp\n\n"
    },
    {
      "time": " 27.Oct.2006 1.31pm",
      "content": "As far as I have seen and heard. thin is in for titling. Think Helvetica Neue ultra light. Not sure if that helps, just my general impression of a “trend” for what it’s worth.\n\nDesign should not say “look at me.” It should say “look at this.”\n\n"
    },
    {
      "time": " 27.Oct.2006 1.42pm",
      "content": "I’ll second the vote for Amplitude. It is a gorgeous workhorse of a sans serif typeface.\n\n"
    },
    {
      "time": " 27.Oct.2006 2.29pm",
      "content": "Thanks everybody, Amplitude is a wonder but sadly out of the price range for the given task (as I expect many suggestions may be) - but thank you all the same! Any other suggestions would be greatly received.\n\n"
    },
    {
      "time": " 27.Oct.2006 2.42pm",
      "content": "Jeremy, you might find something useful digging through the links on our TypoWiki page all about [free fonts.](http://web.archive.org/web/20071009143457/http:/typophile.com/wiki/FAQ_Free)\n\n"
    },
    {
      "time": " 27.Oct.2006 5.55pm",
      "content": "What is your budget?\n\n"
    }
  ]
}
