{
  "id": "29138",
  "title": "Schmale Runde Grotesk by Bauer & Co",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "dear typophiles\n\nin a specimen book by Bauer & Co, Stuttgart (1600 pages - wonderful!) i found a font called \"Schmale runde Grotesk\" (Condensed round Grotesk). i digized some glyphs from a photo of a copy, some lines arent vertical and so on… its just a first test.\n\n ![](http://web.archive.org/web/20131013221726im_/http:/typophile.com/files/runde_grotesk_1_2_4149.png)\n\ni have two questions regarding this font.\n\n- the library wasnt able to date the book, but i'd like to know a circa date - so here the clues i have: on the bottom of each page, H. Berthold AG is noted beneath Bauer & Co - Bauer was bought 1897 by Berthold, as andreas mentions [here](http://web.archive.org/web/20131013221726/http:/typophile.com/node/17643). AG is shown beneath Royal-Grotesk, so i guess it was after 1908 (in the same post as linked above, andreas states that theinhardt was bought 1908). any idea?\n\n- is there a reason for the very thin connecting parts in a, d and n? this feature is found in a, b, d, h, n, m, p, q, u.\n\nthanks for your help!\n\n",
  "author": "thierry blancpain",
  "time": "28 Oct 2006 — 9:00am",
  "uid": "7345",
  "comments": [
    {
      "time": "28 Oct 2006 — 11:01am",
      "content": "What about the upper-case letters ?——those are indentations placed at the intersection of two strokes or a departure from the intended shape of a stroke near the intersection of two strokes of a glyph to provide compensation for ink bleeding or plugging during printing or overexposure from a photographic process.\n\n"
    },
    {
      "time": "28 Oct 2006 — 12:33pm",
      "content": "recent revival by Lineto  \n [http://www.lineto.com/The+Fonts/Categories/Text+Fonts/Number+Two/About+t...](http://web.archive.org/web/20131013221726/http:/www.lineto.com/The+Fonts/Categories/Text+Fonts/Number+Two/About+this+Font \"http://www.lineto.com/The+Fonts/Categories/Text+Fonts/Number+Two/About+this+Font\")\n\n"
    },
    {
      "time": "28 Oct 2006 — 12:58pm",
      "content": "Right there——quite cool.\n\n"
    },
    {
      "time": "28 Oct 2006 — 1:09pm",
      "content": "_What about the upper-case letters ?_\n\nRight. The principle is not applied consistently in the original design, or in the digital copies shown.  \nWhy don't you have a go at applying the ink-trap conceit to the upper case Thierry, rather than just parrot the past?  \nSome original digital faces with an \"ink trap feature\": Bradlo, Amplitude, Chunkfeeder.\n\n"
    },
    {
      "time": "28 Oct 2006 — 1:40pm",
      "content": "\\> Bradlo, Amplitude, Chunkfeeder.\n\nBut all of those use traps (actually the third uses thorns, not traps) in a decorative way, not for actually fighting gain.\n\nIn the case of Schmale Runde Grotesk, I have a feeling those weren't \"real\" traps either (not least because the caps don't have any trapping). One should look at a range of point sizes for clues.\n\nhhp\n\n"
    },
    {
      "time": "28 Oct 2006 — 8:40pm",
      "content": "thanks martin, i didnt know this font. i found this specimen at the libary of HGKZ (university of applied sciences and art, zürich), close enough to lineto. it seems like a direct digitalization of the font, so what i had planned doesnt make much sense anymore.\n\nso nick, yes, maybe your idea could be something innovative instead of repeating what martha strutteregger did with it. i'll think about it.\n\nalessandro, none of the UC-letters show inktraps. but, @hrant, as i found this specimen in a specimenbook (printed), i can be pretty sure that they were not intended as inktraps - because they're a feature of the design, not a necessity of the design itself. they're too extreme to be just inktraps. and they're featured in all sizes. as soon as i get a good scan of the original page, i'll post it. right now at home i only have copies of the book.\n\n"
    },
    {
      "time": "29 Oct 2006 — 6:10am",
      "content": "This is  \nSchmale runde Grotesk  \nA.-G. für Schriftgießerei und Messinglinien  \nOffenbach am Main  \nErstguß 1885/86  \nHausschnitt\n\nSource: Seemann, Handbuch der Schriftarten, 1926\n\nI am sure its the font you are looking for.\n\n ![](http://web.archive.org/web/20131013221726im_/http:/typophile.com/files/runde_6377.jpg)\n  \nGeorg \n"
    },
    {
      "time": "29 Oct 2006 — 8:21am",
      "content": "Re. Chunkfeeder -- my semantic slip, I was actually thinking of what Trapper (also by Jim Grieshaber) looks like, but gave it the wrong name. Which is strange, as the topic is trapping! -- I can only conclude that Chunkfeeder is a much more interesting name and got \"trapped\" in my memory, whereas the name Trapper makes me think of Davy Crockett, not type. Trappist would be a cool name too, and I would think of a monk ... reading in silence.\n\n"
    },
    {
      "time": "29 Oct 2006 — 8:25am",
      "content": "Trapper? There was a guy in M.A.S.H. called Trapper, was'nt it?\n\nGeorg\n\n"
    },
    {
      "time": "29 Oct 2006 — 8:59am",
      "content": "Germans looove old American TV. :-)  \nHasselhoff could become chancelor in five seconds.\n\nNick: trappist monks grow trapping flowers:  \n [http://www.themicrofoundry.com/ss\\_trapping1.html](http://web.archive.org/web/20131013221726/http:/www.themicrofoundry.com/ss_trapping1.html \"http://www.themicrofoundry.com/ss\\_trapping1.html\")\n\nhhp\n\n"
    },
    {
      "time": "29 Oct 2006 — 10:40am",
      "content": "\"Germans looove old American TV. :-)  \nHasselhoff could become chancelor in five seconds.\"\n\nWell, some of it.  \nAnd Americans looove old German movies :-)\n\n[http://search.ebay.com/search/search.dll?cgiurl=http%3A%2F%2Fcgi.ebay.co...](http://web.archive.org/web/20131013221726/http:/search.ebay.com/search/search.dll?cgiurl=http%3A%2F%2Fcgi.ebay.com%2Fws%2F&fkr=1&from=R8&satitle=leni+riefenstahl&category0= \"http://search.ebay.com/search/search.dll?cgiurl=http%3A%2F%2Fcgi.ebay.com%2Fws%2F&fkr=1&from=R8&satitle=leni+riefenstahl&category0=\")\n\nGeorg\n\n"
    }
  ]
}
