{
  "id": "29135",
  "title": "athletics logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "ok, so designing while half asleep isn't the greatest! But I need to show the client something in the morning. I know there's spacing things and kerning I need to fix up. But I'm just wanting some feed back on the general concept to start with, then we can get into the kerning :)\n\nThe Brief:\n\nClient is building a site to show video of different atheletes to industry type folks. I'm not completely sure on all the details. Basically they are thinking they need an identity mark something like the nike, adidas, puma style logo. The client is a fan of [this designer](http://web.archive.org/web/20131108204322/http:/www.31three.com/) as am I. The main thing about this of course is establishing their own identity. It's probably too big of a job for me to figure out in a couple nights, but here's start and I'm hoping that someone can help me as to which direction to go and possible enhancements I can make before handing in the first draft.\n\nThanks for the help and understanding!\n\n| Attachment | Size |\n| --- | --- |\n| [access-athletics-logo.jpg](http://web.archive.org/web/20131108204322/http:/typophile.com/files/access-athletics-logo.jpg) | 50.05 KB |\n\n",
  "author": "jeremydouglas",
  "time": "27 Oct 2006 — 9:33pm",
  "uid": "6500",
  "comments": [
    {
      "time": "27 Oct 2006 — 9:48pm",
      "content": "I think it would be a good idea to show the client more options in font choices for \"access athletics\".\n\nI think you have a couple interesting marks there, but none of them come off as being very ahtletic to me. It would be nice to see a bit more movement in the design. More energy.\n\n"
    },
    {
      "time": "28 Oct 2006 — 3:59am",
      "content": "I think you can reject the bottom three logos immediately. There are many questions that need to be answered, first is what does the client do, why do industry types (what industry?) want to see video of athletes, does he/she make videos or perhaps offer athletes for sponsorship or draw more people to athletics? I know you say you are unsure of the details but you need to find out some details, you seem to be implying you need an athletic-type logo but why would that appeal to industry types? Without answers you are left with type responses and geometric shapes, that being so I think the top left and middle left offer potential.  \nHope this is not too discouraging, but for your sake and your client's try and get some details.  \nTim\n\n"
    },
    {
      "time": "28 Oct 2006 — 5:24am",
      "content": "Thanks for the advice, I'm gonna try some different ideas and try the suggestions here and post back shortly. Thanks!\n\n"
    },
    {
      "time": "28 Oct 2006 — 5:56am",
      "content": "for Tim, I think what they do is give a way for talent scouts of teams a place on the web to view video footage of atheletes\n\n"
    },
    {
      "time": "28 Oct 2006 — 8:16am",
      "content": "some more development…\n\n ![](http://web.archive.org/web/20131108204322im_/http:/typophile.com/files/access-athletics-logo_3810.jpg)\n\n"
    },
    {
      "time": "28 Oct 2006 — 8:22am",
      "content": "just saw that #4 is pretty horrid... maybe this is better\n\n ![](http://web.archive.org/web/20131108204322im_/http:/typophile.com/files/access-athletics-logo3_5899.jpg)\n\n"
    },
    {
      "time": "28 Oct 2006 — 8:23am",
      "content": "#4 is still not one I like, but someone said they liked it except the swoosh was a little messed\n\n"
    },
    {
      "time": "28 Oct 2006 — 8:40am",
      "content": "What kind of image does the client want for themselves? Your ideas are all over the map, which isn't necessarily a bad thing for brainstorming, but it implies that you don't really have a strong direction to go with this logo.\n\nDoes the client wish to be perceived as fun or professional, well-established or up-and-coming, etc.?\n\nIf you haven't done so already, talk this kind of thing through with the client and post the results here. It will be more helpful for you, and for us to give you critique on the logos.\n\n- Lex\n\n"
    },
    {
      "time": "28 Oct 2006 — 12:15pm",
      "content": "I like the direction you're taking #5. It has the energy I was talking about. I think it still is type heavy though. The A and S in Athletics are not lining up with the edges of the A and the S in Access ...kind of looks like you just selected them all and hit center vertically. The type treatments still all look very similar. Maybe explore that area a little more.\n\nOn the plus side, you're giving the client a lot to choose from. I just spoke with someone the other day who sent ONE concept to a client. Can you believe that?\n\n"
    },
    {
      "time": "28 Oct 2006 — 7:34pm",
      "content": "but if it's the right one it's cool, I talked to the client today and have some further thoughts for different directions, sorry for posting all of these brainstorming concepts. I guess this forum doesn't suit that super well. I'll post up again when there's something more established. Thanks for all the help, was good!\n\n"
    },
    {
      "time": "29 Oct 2006 — 1:54pm",
      "content": "alright, got some better direction now. I'm just working on the icon right now, haven't got the text in there. Either of these 2 are probably where we'll end up. Any thoughts?\n\n ![](http://web.archive.org/web/20131108204322im_/http:/typophile.com/files/access-athletics-logo_4089.jpg)\n\n"
    },
    {
      "time": "29 Oct 2006 — 6:34pm",
      "content": "I like the first one of your more recent post, but I think the top part of the 'a' could move to the right more - visually, it's overhanging the bowl too much.\n\n- Lex\n\n"
    },
    {
      "time": "30 Oct 2006 — 12:37am",
      "content": "To me the two most recent are reminiscent of the European fire exit sign\n\n ![](http://web.archive.org/web/20131108204322im_/http:/typophile.com/files/signage_3_3869.gif)\n  \nAlthough that form might not be applicable to Canada, the figure also strikes me as too masculine. Have you thought of a double a mark, possibly one enclosed by the other or a reflected version?\n\nTim\n\n"
    }
  ]
}
