{
  "id": "29148",
  "title": "(x) The Center for Craft, Creativity and Design - Frutiger {Kate McDonnell}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "myriad? the letterspacing seems really easy on the eye. can anyone please explain what has been done to it, i know that it has had some tweaking but what kind? its not wholly justified is it? alligned i guess, but what kind. i’m a student and at the beginning of the typographic learning process so please be patient.\n\n ![](http://web.archive.org/files/logo_6709.png)\n\n",
  "author": "<a href=\"user/14600\" title=\"View user profile.\">missgiggles</a>",
  "time": "<br>",
  "uid": "14600",
  "comments": [
    {
      "time": " 29 October, 2006 - 6:29am",
      "content": "The process is called tracking, the alignment is known as forced justified, it works okay(ish) in the first three lines but by the fourth there are too few characters and the tracking has left it with way too much space. If I _had_ to do this I would look at taking the comma out of the measure so that RTY all aligned and slightly indenting the F to create a better vertical on the left and close up the bottom line and centre it under the others. For a clear reason to avoid it, compare the spaces in the first two lines. Unless you really want to upset your tutors I would avoid doing this altogether.  \nTim\n\n"
    },
    {
      "time": " 29 October, 2006 - 9:48am",
      "content": "I also think the leading is a little too tight given the generous tracking.\n\nI don’t think it’s Myriad but am drawing a blank.\n\n"
    },
    {
      "time": " 29 October, 2006 - 10:55am",
      "content": "Frutiger?\n\n"
    },
    {
      "time": " 29 October, 2006 - 11:03am",
      "content": "[Frutiger 55 Roman](http://web.archive.org/web/20061116104804/http:/www.myfonts.com/fonts/linotype/frutiger/55-roman/), to be precise.\n\n"
    },
    {
      "time": " 30 October, 2006 - 1:26am",
      "content": "Why does Frutiger Next have a different form of ampersand?  \nTim\n\n"
    },
    {
      "time": " 30 October, 2006 - 1:36am",
      "content": "That is the original ampersand if I’m not mistaken. Linotype used a more conventional shape when producing the first digital version, probably because they feared people might find the unusual shape too… errr… unusual.\n\n"
    },
    {
      "time": " 30 October, 2006 - 3:26am",
      "content": "Thanks Yves\n\n"
    }
  ]
}
