{
  "id": "29157",
  "title": "should a logo have only have 1 typeface or is it ok to have 2 aslong as it looks right",
  "forum": "Design",
  "tags": [

  ],
  "content": "what do you think? i have used helvitica neue in a pice of work in a logo and used century gothic too. is that wrong?\n\n [‹ What are some display fonts or type effects that elucidate a dashing, sharp, dapper, exclusive...](http://web.archive.org/web/20071119051121/http:/typophile.com/node/29254 \"Go to previous forum topic\") [DVD Menu!! ›](http://web.archive.org/web/20071119051121/http:/typophile.com/node/29224 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071119051121/http://typophile.com/user/14600\" title=\"View user profile.\">missgiggles</a>",
  "time": "<br>",
  "uid": "14600",
  "comments": [
    {
      "time": " 29.Oct.2006 1.24pm",
      "content": "A kid like you shouldn’t use those old faces.  \nThey are like stale old food that has lost all its nutrition.  \nIt’s like dressing up in your grandma’s clothes.  \nIt’s like riding a horse to the supermarket.  \nThe more you use those faces, the more your brain will turn to mush.\n\n"
    },
    {
      "time": " 29.Oct.2006 1.26pm",
      "content": "In German there is this nice expression, which sort of translates into “the answer is right in the middle of the question.” In other words, of course it is OK to mix fonts in a logo… as long as it looks right!\n\n"
    },
    {
      "time": " 29.Oct.2006 1.39pm",
      "content": "Old faces aren’t inherrently bad, the challenge lies in using them in a way that looks fresh. Many a good tune played on an old fiddle...\n\n"
    },
    {
      "time": " 29.Oct.2006 2.01pm",
      "content": "so does this logo of mine look bad too then? [http://typophile.com/node/28755](http://web.archive.org/web/20071119051121/http:/typophile.com/node/28755 \"http://typophile.com/node/28755\")  \ngo all the way down and see if it looks old. i thought it looked fresh but im having doubts now :D\n\n"
    },
    {
      "time": " 29.Oct.2006 2.08pm",
      "content": "You might want to check out the books by Yasaburo Kuwayama & Kashiwa Shobo.\n\n"
    },
    {
      "time": " 29.Oct.2006 2.19pm",
      "content": "[http://typophile.com/node/28755](http://web.archive.org/web/20071119051121/http:/typophile.com/node/28755 \"http://typophile.com/node/28755\")  \nok, so this looks old too then? why is this not coverted to a link? hmmmm, makes me wonder.\n\n"
    },
    {
      "time": " 29.Oct.2006 8.59pm",
      "content": "Generally IMHO it’s not a great idea to mix two sans serifs unless they’re really different from each other. Better to find one font that works for all your purposes. However a sans and a serif, or a sans and a script, or a display those could all work.\n\nBut why be shy - why not post the logo and we’ll be better able to answer your question.\n\n"
    },
    {
      "time": " 29.Oct.2006 10.18pm",
      "content": "<cite>In German there is this nice expression, which sort of translates into “the answer is right in the middle of the question.”</cite>  \nCan you post it in German? I like to take tasty little phrases like that and print them out for my wall for inspiration.\n\n"
    },
    {
      "time": " 29.Oct.2006 10.59pm",
      "content": "“In German there is this nice expression, which sort of translates into “the answer is right in the middle of the question.”\n\nIts not possible to translate it word by word.  \nWhat Dan means (and he’s right, that’s what we say in Germany):\n\n“Der klügste Weg ist der Goldene Mittelweg.”\n\nGeorg\n\n"
    },
    {
      "time": " 30.Oct.2006 8.05am",
      "content": "_Many a good tune played on an old fiddle…_\n\nRight, but if you’re getting an education it might be a good idea to work with some present day instruments.\n\n"
    },
    {
      "time": " 30.Oct.2006 8.27am",
      "content": "Georg, that isn’t what I meant, even though you’re expression is good advice, too.\n\nIt is exactly possible to translate what I was thinking about directly; I translated it directly from German into English myself ;-)\n\n_In der Frage liegt die Antwort._  \nLiterally, “the answer lies in the question.”\n\nBut “the answer is right in the middle of the question” sounds a bit more direct, at least in English. When I do translation work, I almost never translate the text directly. When you do that, you get German-sounding English. I knew a teacher once who would say, about bad translations, “why do you translate such good German into such poor English?”\n\nGeorg’s advice, _“Der klügste Weg ist der Goldene Mittelweg,”_ translates to “the best advice is the golden middle road.” Very different from what I said, actually… I said that missgiggles’s question had already been answered, namely by herself as she posed the question ;-)\n\n"
    },
    {
      "time": " 30.Oct.2006 8.44am",
      "content": "I agree it is OK to mix fonts, even old ones, if you have developed an idea of what looks right. But I agree with nick that you may want to look past the ’classics’. Except for Univers which I harbour an unreasonable affection for.\n\n"
    },
    {
      "time": " 30.Oct.2006 8.49am",
      "content": "_Right, but if you’re getting an education it might be a good idea to work with some present day instruments._\n\ntrue, but not everyone has access to new fonts, which is probably why there are so many requests for free font sites. some of the big collections (adobe, fontshop...) are quite easy to come by, but newer faces from smaller foundries are just too expensive.\n\n"
    },
    {
      "time": " 30.Oct.2006 8.55am",
      "content": "I’d really like the see the logo in question before we continue the debate on classic/old fashioned fonts vs the new kids in town. We don’t even know what this logo is for. Old fonts can still be put to very creative use.\n\n"
    },
    {
      "time": " 30.Oct.2006 9.05am",
      "content": "[http://typophile.com/node/28755](http://web.archive.org/web/20071119051121/http:/typophile.com/node/28755 \"http://typophile.com/node/28755\")\n\nThe link didn’t work properly above (twice) (hopefully this will).\n\nTim\n\n"
    },
    {
      "time": " 30.Oct.2006 10.54am",
      "content": "[http://typophile.com/node/28755](http://web.archive.org/web/20071119051121/http:/typophile.com/node/28755 \"http://typophile.com/node/28755\")  \nits the logo on this link.\n\n"
    },
    {
      "time": " 30.Oct.2006 10.57am",
      "content": "i agree with mb. too expensive for people like me who are students. we are in debt at this moment in time.\n\n"
    },
    {
      "time": " 30.Oct.2006 11.18am",
      "content": "<cite>some of the big collections (adobe, fontshop…) are quite easy to come by, but newer faces from smaller foundries are just too expensive.</cite>\n\nNot only are they easy to come by, but Adobe actually sells a [huge collection of fonts to students for $100](http://web.archive.org/web/20071119051121/http:/www.academicsuperstore.com/market/marketdisp.html?PartNo=606289) something I have yet to see any other foundries do. I think that the various small/indy foundries out there would be doing themselves a huge favor by getting together and releasing a large low-cost student package so that more designers come out of school with a knowledge of contemporary fonts that weren’t designed by Twombly, Warnock, or anybody at House Industries.\n\nI’ve also experienced design teachers limiting students to the simpler, classic fonts just to keep them from spending too much time messing around with crazy fonts instead of just designing; this semester I’m in a type class with an instructor who handed us all a disc with twenty fonts on it, and that’s what we have to work with all semester.\n\n"
    },
    {
      "time": " 30.Oct.2006 11.25am",
      "content": "I’m with Patty and the others who have said the two sans’ must compliment one another. Giggles, in the case of your logo, I think the two faces are not complimentary. It doesn’t matter if they are old or new, as long as they are appropriate to the message concerned.\n\n"
    },
    {
      "time": " 30.Oct.2006 1.07pm",
      "content": "Can we at least all agree that one should never use Century Gothic for anything?\n\n"
    },
    {
      "time": " 30.Oct.2006 1.10pm",
      "content": "Never say never. The second you do you might find yourself saying occasionally. ;^)\n\n"
    },
    {
      "time": " 30.Oct.2006 3.10pm",
      "content": "_i agree with mb. too expensive for people like me who are students. we are in debt at this moment in time._\n\nCome on. You get all kinds of free fonts at school, and you can get free fonts from all over the place, and why not, gasp, actually spend some money on fonts — surely you have bought software at some point in your education, why not fonts?\n\nAs for contemporary, many of the Adobe fonts that come with CS or the Adobe education pack that they probably have at your school have been freshly designed in the past 10 years, and don’t date from c.1900 like Century and Helvetica. Why not do a little investigation of the fonts available to you and find out what their provenance is?\n\n"
    },
    {
      "time": " 31.Oct.2006 1.07am",
      "content": "\\>…I’ve also experienced design teachers limiting students to the simpler, classic fonts just to keep them from spending too much time messing around with crazy fonts instead of just designing;…  \n—-  \nFor a try-out, you can surely stronger your muscles in creating a logo with the help of helvetica, why not?! You can check the actual campaign of BMW for inspiration.\n\n\\>this semester I’m in a type class with an instructor who handed us all a disc with twenty fonts on it, and that’s what we have to work with all semester.  \n—-  \nWhich twenty typefaces? I’m really interested!  \nWhat kind of classical sans-serif you have in school?  \nhelvetica (neue), univers, akzidenz grotesk, frutiger, avenir, futura, franklin gothic, trade gothic, gill sans, syntax, meta, today sans?\n\n"
    },
    {
      "time": " 31.Oct.2006 8.53am",
      "content": "Right.  \nAnd restrict students to Illustrator 88 and Quark 2 as well — that will really force them to be resourceful with the traditional basics of design. In fact, for the whole Zen, why not go completely unplugged?\n\n"
    },
    {
      "time": " 31.Oct.2006 9.04am",
      "content": "Jonathan - I’m with you completely on Century Gothic, almost said the same thing.\n\nRight Nick, have them go back to cut and paste, rubylith, scotch rules, waxers and T-squares. That’ll teach them.\n\nRe fonts tho, sometimes there is such a thing as too much choice. And an unfortunate tendency to try to solve a design problem by throwing another font at it rather than really figure out how to make it work in a simple and elegant fashion.\n\n"
    },
    {
      "time": " 31.Oct.2006 9.39am",
      "content": "My brother took a first year visual design course last semester. He was only allowed to use black ink, white paper, scissors, and a photocopier.\n\n- Lex\n\n"
    },
    {
      "time": " 31.Oct.2006 10.10am",
      "content": "_there is such a thing as too much choice._\n\nI couldn’t agree more. In fact I addressed this topic in 2001:  \n [The Perfect Set](http://web.archive.org/web/20071119051121/http:/www.shinntype.com/Assets/Depts/Essays/PerfcSet.pdf)\n\nThat article is time and date specific, but I still believe that educators should provide students with a carefully chosen selection of key fonts, taken from a variety of commercial sources, especially local foundries.\n\n"
    },
    {
      "time": " 31.Oct.2006 10.24am",
      "content": "Nick, yeah that is a little dated... Matrix??? LOL  \nAlso it’s a bit weighted in the masculine/tech direction for my taste. But I could easily come up with my own set of 22 fonts.\n\nIt’s a good idea in principle, at least for students, to learn effective design with fewer tools. And by the same token I think their projects should have the same types of constraints that professional designers face. Too often I saw portfolios with flashy die cut/hand bound/5 different kinds of paper/metallic ink work that would never fly in the real world. Design is an applied art after all.\n\nI’m also a painter and I tend to buy a small number of pigments and mix my own colors rather than have 30 or so tubes lying around getting old.\n\n"
    },
    {
      "time": " 31.Oct.2006 10.54am",
      "content": "_But I could easily come up with my own set of 22 fonts._\n\nWell that’s the idea. That was me walking my talk.  \nIt wasn’t easy to satisfy the criteria I began with, especially on a budget.  \nI think it would be a lot easier now, in some ways, because of OpenType.  \nI should also point out that Licko, Twombly and Fullard, whose types I included, are female designers.\n\nYou’re right, Matrix is dated. I’m sure your list wouldn’t include anything 20 years old.  \nBut seriously, it might be a good idea to teach the origins of digital culture — and why not use Matrix?\n\n"
    },
    {
      "time": " 31.Oct.2006 11.08am",
      "content": "I just can’t look at Matrix anymore.\n\nIt would be an interesting design course to have the students for one month design using only the ’antique’ tools of the trade, i.e. cut and paste, then for a month use only the fonts you could get for the Mac c.1990 such as copperplate gothic and palatino.\n\nI do think you learned to design differently when mistakes were costly and resources limited. It made you think about what you were doing before you started rather than sitting at the computer and messing around until you get something you like. I’m glad I learned ’old school’ and thrilled that I don’t have to do that anymore.\n\nMy list would be more likely to include fonts 100 years old than 20 yrs old.\n\n"
    },
    {
      "time": " 31.Oct.2006 11.35am",
      "content": "Matrix is dated, but I think it won’t be us old fogies that will use it in a fresh way. We can’t as it is stuck in an era for us and our own perceptions.\n\nI recently received a catalogue from [Zingerman’s](http://web.archive.org/web/20071119051121/http:/www.zingermans.com/Index.pasp) which used Matrix for the body text and I have to admit it suited the project very nicely. I don’t think I would have chosen the typeface if I’d been given the project, but honesty I think it really works with the illustrations and the other hand-lettering.\n\n(Warning: Don’t visit the site if you have a paltry sandwich for lunch or if you like food at all. It is evil and tempting.)\n\n"
    },
    {
      "time": " 31.Oct.2006 12.00pm",
      "content": "Giggles: Build contrast. It’s not that two sans are not allowed, but there needs to be enough difference and compatibility for the pairing to work.\n\nOn limiting choice of typography in class: I do advocate this, but there’s a side to me that rebels against it. There was a recent debate (and vote) within our program on teaching all the basics using only one typeface.\n\nOut of all the typefaces named, two were the front runners: Adobe Garamond, and Univers. Univers won out and, frankly, I was a bit horrified. One of my assignments involve setting a short story, and I just couldn’t bear the idea of extensive text setting in Univers. Nothing against Univers, but...\n\nI have since tried to find ways to restrict type usage to the two presecribed ones to teach certain core formal principles, and then with other projects, allow students to open up to the vast sea, but demanding coherent considered reasons for their choices.\n\nOne of the reasons why I ended up falling in love with typography as a student involved the seemingly endless permutations of letters.\n\n"
    },
    {
      "time": " 31.Oct.2006 12.09pm",
      "content": "faces like helvetica are old but look at how far they’ve outlasted faces like matrix. that’s the difference between high art and trend driven design. just an opinion.\n\n"
    },
    {
      "time": " 31.Oct.2006 1.27pm",
      "content": "I think you need a sans and a serif, you’re absolutely right that sans aren’t usually great for running text like a short story.\n\n"
    },
    {
      "time": " 31.Oct.2006 2.43pm",
      "content": "@all  \nwhat would be your “ideal” typefaces-set for grafic design students at the beginner level, if you were a teacher? Let it be just 10 typefaces.\n\n"
    },
    {
      "time": " 31.Oct.2006 5.47pm",
      "content": "_that’s the difference between high art and trend driven design._\n\nThat’s the difference between a trendy 1950/60s re-hash of a well-established genre, made digitally ubiquitous by being bundled first with the Laserwriter and then with Internet Explorer, and an original design. Just reality.\n\n"
    },
    {
      "time": " 31.Oct.2006 9.47pm",
      "content": "Thomas - I suggest you start a new thread with your question. It would be interesting to see what 10 fonts people come up with. I’m too tired to think about it now.\n\n"
    },
    {
      "time": " 1.Nov.2006 1.08pm",
      "content": "Do any foundries sell fonts at a student price, as some software companies do?\n\nI think that would be a good thing. There are a lot of expectations put on design students these days. A simple limited palette is good for learning design principles. However, most employers don’t look to recent graduates to be lead designers. They need work horses. That is, they want students that are proficient with many types of software. While in school i was proficient in. Quark, Freehand, Photoshop, Illustrator, InDesign, Pagemaker, Fontographer, Flash, Director, etc. Today, as a working designer, i have a more focused set of tools. But, as a student, i knew that i was graduating into a tough market. Anything I could put on my resume to make me attractive to that technophobic lead designer out there was a plus.And that strategy worked. Now i have that technophobic designers job and im scared of all the smart kids coming out of school :) But i digress—\n\nStudents are strapped for cash. For many it is a stretch to buy their first Mac. Purchasing many thousands of dollars of software and fonts just find out if one even wants to become a professional designer is a tough proposal. Most students steal software and fonts. Ill admit it - I did. In fact, i stole a lot. And today i buy a lot of fonts and software. Its just the way it is. I respect companies who make tools available to students at a cut rate. In addition, i think it is a masterstroke of marketing. Apple made it easy for me as a student to buy a laptop - Now i’m hooked for life. They converted a PC nut. Macromedia (at the time) made freehand accessible to students at about a 50% discount. Quark on the other hand cost me a fortune. Or what seemed like a fortune at the time. I think it cost about 3000 packages of Ramen noodles :)\n\nI started off stating that it would be good if fonts were sold at a cut rate to students. Now, after typing all this, im not so sure. Would that same marketing model that made a Mac user out of me work with fonts? Could it help foundries reach new customers? Build brand loyalty? Or would foundries just be giving their work away? Are any already exploring such options? Are fonts cheap enough already because of market forces that students should bite the bullet and starve for a week to try out a new font? Have I gone too far- should this be a new thread?\n\n"
    },
    {
      "time": " 3.Nov.2006 12.06am",
      "content": "Gene, actually [here](http://web.archive.org/web/20071119051121/http:/typophile.com/node/29178)’s the topic that would be relevant to you.\n\nMy opinion on that matter can also be found there. Alternatively, ask Chris Lozos if he wanted to share some of the ’croaks’ with you :)\n\nAbout mixing two sans, I would say that whatever will work best to get your message accross is the best option. Do have a reason for your type decision, though.\n\n"
    }
  ]
}
