{
  "id": "29164",
  "title": "logotype kerning tips?",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi, I'm designing a logo for a industrial maintenance company and would be thankful for any tips on getting a clean balanced look for the type. The logo needs to look good on huge surfaces like cars and signage, as well as web use.\n\n| Attachment | Size |\n| --- | --- |\n| [mp-grid.gif](http://web.archive.org/web/20110809062049/http:/typophile.com/files/mp-grid.gif) | 20.29 KB |\n| [MP-nogrid.gif](http://web.archive.org/web/20110809062049/http:/typophile.com/files/MP-nogrid.gif) | 6.29 KB |\n| [MP-var.gif](http://web.archive.org/web/20110809062049/http:/typophile.com/files/MP-var.gif) | 7.81 KB |\n\n",
  "author": "<a href=\"/web/20110809062049/http://typophile.com/user/15172\" title=\"View user profile.\">espen</a>",
  "time": "<br>",
  "uid": "15172",
  "comments": [
    {
      "time": "",
      "content": "HI there,\n\nA nice simple logo that I think could work quite nicely.\n\nA couple of little things, I dont know how you feel about it but I have never been a great fan of kerning letters to the extreme that they start to fall apart. I think the PARTNER on the MP-var version is a no go. The other two work a lot better, they work as one element.\n\nSecondly, it may just be my eyes but I think that the MAINT part of the logo is maybe kerned a little too tightly. Because the MAI are kerned to the extent where they are attached to each other the uprights start to create some strange negative spacing and shapes, I can almost see a 'W' and a 'V' in there, I think that maybe you should open up the kerning a little, and then see how the letters react to each other.\n\nIf you are as you say going to be using this on vehicles and signage, the logo does need to be a little clearer. It may blur into a shape rather than read as a word as you have it now.\n\nMatt\n\n"
    },
    {
      "time": "",
      "content": "1) Loosen the \"IN\".  \n2) Loosen the \"NE\".  \n3) Maybe ligate the \"NT\".  \n4) Remove the trapping - the slight bends in the \"crotches\" of the \"N\"s, the top-inside of the \"A\", etc.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "To my eyes the biggest issue is the the spacing in partner. The PA & AR are too loose compared to the rest of the text. I would loosen the rest of the text Instead of tightening the others however untill the they match the A & it's sidebearings. You could overcome some of the odd shapes in Maint by making a dot on the i.\n\nThis will sound a bit heavy I am affraid but do you have anything else? Why these types anyway? It looks okay to me but only okay. Do you have time to consider other options?\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the input, I've loosened the kerning a bit, and cleaned the letter shapes (trappings etc). I'm going with the larger 'partner' text, as it does make the logo look more like a whole. I'll post a pic when I get the chance.\n\n"
    }
  ]
}
