{
  "id": "29165",
  "title": "art deco style credits for 'Hotel Babylon' BBC drama [x] (skyfein)",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "Hi. Any one recognise this font from the BBC programme 'Hotel Babylon'?\n\nAny suggestions, greatly appreciated!  \nCheers\n\nTerry\n\n| Attachment | Size |\n| --- | --- |\n| [babylon.jpg](http://web.archive.org/web/20130131013321/http:/typophile.com/files/babylon.jpg) | 71.29 KB |\n\n",
  "author": "tscruby",
  "time": "30 Oct 2006 — 5:00am",
  "uid": "4157",
  "comments": [
    {
      "time": "30 Oct 2006 — 8:53am",
      "content": "I'm guessing nobody has stepped up to the plate on this one because it is so horrifying - is this really something the BBC is using? It looks squooshed and badly hand drawn to me.\n\n"
    },
    {
      "time": "30 Oct 2006 — 9:01am",
      "content": "Whew, thanks for the reply, was beginning to think no one was talking to me!\n\nYeah, sorry about the grab. After I posted it I realised it was still anamorphic and so will look a bit squashed in horizontally. I've attached another one.\n\nAny ideas anyone? Along Frank Lloyd Wright lines I guess...\n\nPlease?\n\n ![](http://web.archive.org/web/20130131013321im_/http:/typophile.com/files/babylon2_4007.jpg)\n\n"
    },
    {
      "time": "30 Oct 2006 — 9:53am",
      "content": "It's similar, but not identical, to [Gabardine](http://web.archive.org/web/20130131013321/http:/www.myfonts.com/fonts/agfa/gabardine/) from Panache. I usually like these Deco-ish faces, but this doesn't look too familiar. Still hunting.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "30 Oct 2006 — 10:18am",
      "content": "I'm still gonna bet it's custom for that series - it looks clumsy to me, especially those B's.\n\n"
    },
    {
      "time": "30 Oct 2006 — 11:21am",
      "content": "Yeah, Custom but not in a bespoke kind of way.\n\n"
    },
    {
      "time": "30 Oct 2006 — 12:28pm",
      "content": "Thanks Mike - garbardine is pretty close in places, though the G is very different (NB, rather helpfully I haven't posted a sample containing the G, stupid me!)\n\nIt's not vital I get it exact at the moment but it's really bugging me. There must be something quite close?!\n\nTrue, could be a custom, but just suprises me that they'd go to that much trouble. They've used the same font for all the credits so it isn't like they've just modded the letters for BABYLON.\n\nIf no one has any luck tonight, I'll post a better grab with bigger selection of letters tomorrow.\n\nCheers guys,\n\n- Terry\n\n"
    },
    {
      "time": "31 Oct 2006 — 3:13am",
      "content": "I've posted another grab taken from the credits in case it's any help - there's a few more letters on there.\n\nGuys - I've been loitering around here for the last few years and I'm really surprised this has got people stumped!\n\nPlease, anyone?!\n\n ![](http://web.archive.org/web/20130131013321im_/http:/typophile.com/files/babylon3_6132.jpg)\n\n"
    },
    {
      "time": "31 Oct 2006 — 7:35am",
      "content": "Oh God, I can't help myself -- [Interdimensional](http://web.archive.org/web/20130131013321/http:/www.dafont.com/interdimentional.font?nb_ppp=50&text=BABYLON).\n\n"
    },
    {
      "time": "31 Oct 2006 — 8:27am",
      "content": "That's the closest yet, but this one is making me nuts! There is something disturbingly familiar, but I don't know if it's because I've actually seen it somewhere, or it reminds me of other things, like [Rennie Mackintosh](http://web.archive.org/web/20130131013321/http:/www.myfonts.com/fonts/linotype/itc-rennie-mackintosh/).\n\nI started thinking that if this is a commercial font it has to be from somewhere relatively obscure, and so I look at FontHaus -- no joy-- , and then I hunted through the old Precision Type Catalog through the forgotten foundries they used to sell -- nothing there either.\n\nIt's not clear to me whether this high-waisted, draftsman lettering style, is supposed to be Art Nouveau, Craftsman, or Art Deco, but it's definitely old. The Frank Lloyd Wright fonts that P22 sells are sort of this vintage, but no matches.\n\nI have a feeling that this is an existing font, but maybe from a very old (defunct) digital source.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "6 Nov 2006 — 5:58pm",
      "content": "Hey Terry. I don't know if this comes too late, but there is an old Letraset face – Vienna Extended ©1989 Antony De Meester – which matches the structure of what you show above, although the B is different. The A is a dead ringer. Possibly there was a regular width Vienna that may come closer, or the job for the BBC was altered by hand as others are suggesting. Linotype have Vienna Extended at  \n [http://www.linotype.com/142843/viennaextended-font.html](http://web.archive.org/web/20130131013321/http:/www.linotype.com/142843/viennaextended-font.html \"http://www.linotype.com/142843/viennaextended-font.html\")\n\n"
    },
    {
      "time": "13 Nov 2006 — 4:41am",
      "content": "Cheers for that Ben. Pretty close - it seems to be the original font that [Interdimentional](http://web.archive.org/web/20130131013321/http:/www.dafont.com/interdimentional.font?nb_ppp=50&text=BABYLON) is based on over at Dafont.\n\nCheers for all your help on this guys. I was working on a pitch in connection with this project and ended up using Interdimentional - I just modified the letters that didn't match.\n\nThankfully you'll all be glad to hear the pitch was successful and on receiving the assets to start the project I can now announce the winner is....\n\na custom build (hats off to Patty and Tiffany)\n\nI'm sure I've seen it somewhere before but all the evidence in the font points to it being put together for this programme.\n\nOnce again, many thanks for your suggestions.  \nTerry\n\n"
    },
    {
      "time": "3 Sep 2009 — 4:10am",
      "content": "i know this is probably too late (it is now 2009!!) but i have a custom font created by myself that resembles the Hotel Babylon font called London Babylon, if you are still interested, email me:  \n [joss.astley@hotmail.co.uk](mailto:joss.astley@hotmail.co.uk)\n\n"
    },
    {
      "time": "2 Sep 2010 — 9:39pm",
      "content": "My God. [Here it is.](http://web.archive.org/web/20130131013321/http:/www.abstractfonts.com/font/14513)\n\n"
    },
    {
      "time": "28 Jan 2013 — 6:43am",
      "content": "Real, could be a customized, but just suprises me that they'd go to that much problems. They've used the same typeface for all the credit so it isn't like they've just modded the characters for BABYLON.\n\nIf no one has any fortune this evening, I'll publish a better pick up with larger choice of characters the next day. [all best serials](http://web.archive.org/web/20130131013321/http:/allbestserials.com/)\n\n"
    }
  ]
}
