{
  "id": "29189",
  "title": "Magazine Publisher Liars are Merchant Bankers",
  "forum": "vinceconnare's blog",
  "tags": [

  ],
  "content": "Does anyone else have problems with Magazines who request photographs for their articles that you shot or other imagery and promise since they ‘don’t have a budget’ that they will ‘definitely’ give proper credit to the photographer?\n\nOut of the dozen or so magazines in the last 2 years I’ve had photographs published, the ones that don’t pay often tell me that they will give credit, and so far only 20% have done so when the magazine is printed.\n\nAre they all just a bunch of merchant bankers?\n\nmagazine 'Helix' from Australia and the UK 'Design Week'.\n\n ![](http://web.archive.org/web/20131103093147im_/http:/typophile.com/files/merchantbankers_3721.jpg)\n\n",
  "author": "vinceconnare",
  "time": "31 Oct 2006 — 6:08am",
  "uid": "7029",
  "comments": [
    {
      "time": "1 Nov 2006 — 1:56am",
      "content": "To you Magazine workers: From now I will put my name across the photo and if you don't give me money then it will stay there!\n\n"
    },
    {
      "time": "2 Nov 2006 — 12:24pm",
      "content": "I'm now putting Digimarc [http://www.digimarc.com/](http://web.archive.org/web/20131103093147/http:/www.digimarc.com/ \"http://www.digimarc.com/\") copyrights to all my photos... so piss off you bastards. They probably steal fonts too and don't credit them.\n\n"
    },
    {
      "time": "2 Nov 2006 — 12:28pm",
      "content": "On a lighter note, I love your recent Flickr pix with the period lighting--great stuff!\n\nChrisL\n\n"
    },
    {
      "time": "2 Nov 2006 — 12:33pm",
      "content": "Always the lighter note. The guy's trying to make a (negative) point.\n\n\\> They probably steal fonts too\n\nBut Vince, they didn't steal your photo - you gave it to them... :-)\n\nhhp\n\n"
    },
    {
      "time": "2 Nov 2006 — 1:39pm",
      "content": "both magaines said they will put my credit, I even talked to the guy in person who wrote the article for Design Week and said they were great and will put a credit in there but again no. This happens alot. They say the will but don't.\n\np.s..Chris, I think Viviana is my best model. She was my girlfriend in NYC about 1983, shots mostly were taken in 1987 and she actually lives in London too now and I hope to do another shoot soon.\n\n"
    },
    {
      "time": "2 Nov 2006 — 1:56pm",
      "content": "Hope you two can connect for another shoot. Great stuff!\n\nChrisL\n\n"
    }
  ]
}
