{
  "id": "29182",
  "title": "Logo redesign - engineering, architecture, construction recruitment",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,\n\nI'm redesigning an existing corporate identity for a recruitment agency servicing construction, engineering and architecture in Australia. More accurately, I'm tidying up an existing corporate identity.\n\nThey've been doing business for a few years, and are reluctant to change their ID too much, and want it to remain easily recognisable. The original (that I didnt design) is a simple geometric mark using Bauhaus letters with Bauhaus also used for the company name.\n\nYou'll see, the original logo is a bit hard to look at. The whitespace seems quite odd, and the Bauhaus becomes unreadable at small sizes, the mark is also dirty at small sizes because of the gaps wear the bowls should terminate. I suspect they did it themselves.\n\nThe breif is to keep the same basic shape for the mark - but tidy it up so that it looks a little more solid and use a fresher, more readable typeface for the company name.\n\n ![](http://web.archive.org/web/20131106222323im_/http:/typophile.com/files/forComparison_6285.gif)\n\nObviously I dont have a lot of room to move - but any comments, critisism welcome.  \nKerning 'build' gave me some trouble.\n\n",
  "author": "JonnySchneider",
  "time": "30 Oct 2006 — 6:29pm",
  "uid": "11331",
  "comments": [
    {
      "time": "31 Oct 2006 — 8:25pm",
      "content": "Bauhaus definitely had to go. The new typelogo isn't too bad but it seems detached from the logo itself. The logo feels a little blocky, maybe more of a rounder curve? I like the more narrower spacing in the middle.\n\n"
    },
    {
      "time": "31 Oct 2006 — 11:13pm",
      "content": "I like the way it's heading; I think less curves would reflect the company better - heavy industrial, architectural and engineering don't really fit with the curves in my view. I like the heaviness of the weight of the 'db' marque, I would be tempted to square it up - still have some curves (on the corners) so it's not so austere, it kind of looks a bit too soft to me at the moment.\n\n"
    },
    {
      "time": "31 Oct 2006 — 11:31pm",
      "content": "This looks much better, I would have to agree with Duckworth and try to square off the db some. Maybe the bottom outside/inside of both letters?\n\n"
    },
    {
      "time": "2 Nov 2006 — 2:58pm",
      "content": "Thanks guys,\n\nGlad that others agree on squaring it up - definitely prefer that direction as opposed to a rounder look. I think it might work if square off the bottom outside edges, this should give some flow at 45degrees across the bowls.\n\nClient doesnt want it too blocky - in fact, they've accepted this logo and really like it, so probably best to just keep it as is, short of any critical shortcomings.\n\nThanks again,\n\nJonny\n\n"
    }
  ]
}
