{
  "id": "292",
  "title": "Kerning with FOG?",
  "forum": "Build",
  "tags": [

  ],
  "content": "I don't get how to get kerning done in Fontographer to stick, well when I made a postscript + bitmap it worked fine in OS9 with ATM, but now the Kerning doesn't hold in OSX, the letter are stuck together.   \n   \nCan anyone help a rookie out?   \n   \nThnks   \nNick\n\n",
  "author": "twitch",
  "time": "5 June, 2003 - 9:22am",
  "uid": "1907",
  "comments": [
    {
      "time": " 6 June, 2003 - 6:23am",
      "content": "If you're testing the font in TextEdit under OS X, I'm pretty sure that TextEdit doesn't support kerning unless the font is AAT. That means PostScript Type 1, OpenType, and TrueType will show no kerning in that application. Very lame. Is this how you're doing it?\n\n"
    },
    {
      "time": " 6 June, 2003 - 1:31pm",
      "content": "_Lame?_ That's a little harsh. I think it's rather a pleasant surprise that an application such as TextEdit supports kerning at all. I can't think of any non-graphics or non-DTP programs that do it in OS 9, even at such a rudimentary level.   \n   \nI would assume that Nick is having kerning problems with programs that would normally be _expected_ to support kerning (graphics or DTP programs).\n\n"
    },
    {
      "time": " 6 June, 2003 - 1:51pm",
      "content": "I am using the fonts in Adobe Illustrator   \n   \nDoes Kerning then only work with certain programs all together?   \n   \n'Cause I'd rather have a font specifically kerned with specific letter combinations\"   \n   \n   \nThanks   \nNick\n\n"
    },
    {
      "time": " 6 June, 2003 - 9:04pm",
      "content": "Make sure you are using the most up to date version of Illustrator with OS X. I recently had trouble with missing kerning in PostScript fonts with this combination because I forgot to update Illustrator 10 to the newest version (10.0.3) when I switched to a new machine running OS X 10.2.4. The same goes for InDesign.\n\n"
    },
    {
      "time": " 7 June, 2003 - 7:56pm",
      "content": "Ok, \"lame\" may be too harsh, but it is disappointing. You'd think with a \"modern\" OS, they could support kerning in more font formats. Then again, if we're talking type, the term \"modern\" could put us back in the 1800s!   \n   \nAlan\n\n"
    },
    {
      "time": " 11 June, 2003 - 1:31pm",
      "content": "None of my postscript fonts had kerning when I moved to OSX. Here's a crappy and inconvenient solution that should allow you to view kerning:   \n   \nDon't install your fonts in the library/fonts folder. Don't use font management software either. Illustrator does not read metrics info when the fonts are stored here. Instead you must put them here: hardDrive/library/application support/adobe/fonts.   \n   \nTry that and I bet you'll have kerning again. Newer versions of illustrator may have fixed this, I dunno.\n\n"
    },
    {
      "time": " 11 June, 2003 - 8:05pm",
      "content": "Karl--That will work. I know, because that's what I did at first. The updates _do_ fix the kerning problem. It seems to me to be a more sensible solution. Plus, they are free, so what's the problem?\n\n"
    }
  ]
}
