{
  "id": "29208",
  "title": "Ideal typefaces-set for grafic design students at beginner level?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nwhat would be your “ideal\\*” typefaces-set for grafic design students at the beginner level, if you were a teacher?  \nLet it be just 10 typefaces.  \nI'm interested to read different positions.\n\nT.\n\n\\*don't narrow your top-ten list because of high pricing... DTL, TEFF, etc. are welcome in this thread, if you think they have to be a part of it :)\n\n",
  "author": "poms",
  "time": "1 Nov 2006 — 1:53am",
  "uid": "10974",
  "comments": [
    {
      "time": "1 Nov 2006 — 3:42am",
      "content": "Your question reminds me of the ideas of Massimo Vingnelli ( [http://www.fontshop.be/details.php?entry=87](http://web.archive.org/web/20131014225733/http:/www.fontshop.be/details.php?entry=87 \"http://www.fontshop.be/details.php?entry=87\"))  \nHis 6 typefaces are: Helvetica, Times, Futura, New Century, Garamond and Bodoni. Add Caslon, Gill sans, ff Din and maybe plantin?\n\n"
    },
    {
      "time": "1 Nov 2006 — 4:49am",
      "content": "This is a very conservative list. It covers classes of type that it's useful to get familiarised with sooner rather than later, simply because of their ubiquity (Helvetica being a case in point - know your enemy).\n\n1. A Garamond  \n2. Bembo / Galliard  \n3. Palatino / Centaur  \n4. Univers / Frutiger  \n5. Futura  \n6. Gill Sans / Monotype grotesk  \n7. Helvetica (in all its many forms)  \n8. A Baskerville  \n9. A Bodoni  \n10. A Caslon\n\nNot very adventurous I know but once there's a framework on which to build your own tastes, this could then be applied to choosing less well known/more exotic fonts and keeping the independent type foundries going.\n\n\\*Sound of a can of worms being opened very sheepishly\\*\n\n"
    },
    {
      "time": "1 Nov 2006 — 6:51am",
      "content": "I'm in school right now and we just got a new director and I believe they are having 100-level students set in helvetica only. I've heard of other schools doing this as well.\n\n"
    },
    {
      "time": "1 Nov 2006 — 8:41am",
      "content": "_they are having 100-level students set in helvetica only_\n\nmaybe this is a good thing... an overdose by design student will create an aversion and we'll see it less! one can wish, right?\n\n"
    },
    {
      "time": "1 Nov 2006 — 8:53am",
      "content": "I think I posted this in the Indie fonts thread, but shouldn't a student just need the following?:\n\nA Venetian  \nAn Aldine  \nA transitional  \nA modern  \nA grotesque sans  \nA slab/clarendon  \nA geometric sans  \nA humanist sans\n\nThese are the categories that most books classify typefaces in. Pretty much what Chris said, just more general with some room for creativity and individual preference. And note, only 7 fonts. That leaves 3 spots for doubling up on the categories, 3 spots for some fancy display type, or three less fonts to drop dough on :)\n\n"
    },
    {
      "time": "1 Nov 2006 — 9:14am",
      "content": " **Adobe Garamond, Adobe Caslon** Can't get through life without these. If you're lazy just use Garamond, if you can't decide just use Caslon.  \n**Akzidenz-Grotesk** If one is going to learn about modern design, one might as well start with the original modern typeface. And it has the best super weight **ever**.  \n**Helvetica** Every designer needs to know how to use this one. Just not at less than 24 points.  \n**Univers** There probably isn't a better face for learning to use a big family.  \n**Neutraface** Futura's nice, but this updated derivative is a lot cooler. And it wasn't designed by a communist.  \n**Meta** Because designers should know how to use a font with a design that originated after 1960.  \n**Memphis** Because someone will want to you do something reminiscent of college football at some point.  \n**Minion Pro** Minion is great, it works so well in print and onscreen, and it saves paper.  \n**Walbaum** A high-contrast font that won't make you go blind. If designers keep staring at Baskerville and Bodoni on screen they'll all go blind and the world economy will collapse when the great unwashed start setting everything in Comic Sans and Times.\n\n"
    },
    {
      "time": "1 Nov 2006 — 9:49am",
      "content": "i agree with Dan, rather than recommending specific typefaces, i think it would be more useful to suggest important categories of faces that could be filled by any number of great NEW faces instead of the old, tired stand-bys.\n\nFor exmaple, MY picks for these categories\n\nA [Venetian](http://web.archive.org/web/20131014225733/http:/typophile.com/wiki/Venetian): [Eason](http://web.archive.org/web/20131014225733/http:/www.veer.com/products/typedetail.aspx?image=FOT0000085)  \nA [Garalde](http://web.archive.org/web/20131014225733/http:/typophile.com/wiki/Garalde): [Relato](http://web.archive.org/web/20131014225733/http:/www.myfonts.com/fonts/emtype/relato/)  \nA [Transitional](http://web.archive.org/web/20131014225733/http:/typophile.com/wiki/Transitional): [Farnham](http://web.archive.org/web/20131014225733/http:/fontbureau.com/fonts/Farnham)  \nA [Modern](http://web.archive.org/web/20131014225733/http:/typophile.com/wiki/Modern): [Paperback](http://web.archive.org/web/20131014225733/http:/houseind.com/index.php?page=showfont&id=171)  \nA [Grotesque Sans](http://web.archive.org/web/20131014225733/http:/typophile.com/wiki/Grotesque): [Maple](http://web.archive.org/web/20131014225733/http:/www.processtypefoundry.com/typefaces/maple/index.html)  \nA [Slab](http://web.archive.org/web/20131014225733/http:/typophile.com/wiki/Slab)/ [Clarendon](http://web.archive.org/web/20131014225733/http:/typophile.com/wiki/Clarendon): [Farao](http://web.archive.org/web/20131014225733/http:/www.stormtype.com/typefaces-fonts-shop/families-59-farao-complete)  \nA [Geometric Sans](http://web.archive.org/web/20131014225733/http:/typophile.com/wiki/Geometric): [Verlag](http://web.archive.org/web/20131014225733/http:/typography.com/catalog/verlag/index.html)  \nA [Humanist Sans](http://web.archive.org/web/20131014225733/http:/typophile.com/wiki/Humanist): [Mundo Sans](http://web.archive.org/web/20131014225733/http:/terrestrialdesign.com/mund01.html)\n\n"
    },
    {
      "time": "1 Nov 2006 — 11:10am",
      "content": "What's the difference between a Garalde and an Aldine?\n\n"
    },
    {
      "time": "1 Nov 2006 — 11:16am",
      "content": "Right on Paul.  \nA little history is essential, and I know the present day can be confusing, but no reason for educators to retreat to the safe shores of the distant past and stick their heads in the sand.\n\nStill, if you can only juggle with one ball, teaching novices how to use Helvetica is appropriate to your skill level.\n\nBut don't you think those genres are somewhat ancient?  \nMore pavane and gavotte than hip hop. Not to mention galliard.\n\nQuite frankly, for beginner level the distinction between Venetian, Garalde and Transitional may be elided, they're all old styles.\n\nSo what about a selection from:  \nGrunge  \nDistressed  \nPixel  \nPostmodern  \nIndustrial  \nMonospace  \nHand-drawn  \nScript\n\nThat would certainly capture their fancy a bit more.\n\n"
    },
    {
      "time": "1 Nov 2006 — 11:48am",
      "content": "well if we're going there, i'd think that a Type 101 class should have [The Elements of Typographic Style](http://web.archive.org/web/20131014225733/http:/typophile.com/wiki/Elements%20of%20Typographic%20Style) as required reading, and to not confuse the poor kids, students should probably follow his divisions which are:\n\nRenaissance (Venetian)  \nBaroque (Garalde)  \nNeoclassical (Transitional)  \nRomantic (Modern)  \nRealist (Grotesk/Clarendon/Pixel)  \nGeometric Modernist (Geometric Sans/Geometric Slab/Industrial)  \nLyrical Modernist (Humanist Sans/Neohumanist Serif)  \nPostmodernist (Monospace)  \nExpressionist (Grunge/Distressed/Hand drawn/Script)\n\nI think this covers all the classical bases as well as your categories you propose. The important part would be to find a good balance of Text and Display fonts. I was just going with Dan's categories to show that there are new faces that cover the old ground in a fresh way. I should have brought up your article [_The Perfect Set_](http://web.archive.org/web/20131014225733/http:/shinntype.com/Assets/Depts/Essays/PerfcSet.pdf). Wasn't this brought up recently in another thread?\n\n"
    },
    {
      "time": "1 Nov 2006 — 12:11pm",
      "content": "[A Handy Appendix for the Vox Typeface Classification](http://web.archive.org/web/20131014225733/http:/ellie.rit.edu:1213/pdf/appendixc.pdf) (PDF 268 Kb)  \n [Familles de caractères](http://web.archive.org/web/20131014225733/http:/www.affaire-esperluette.com/familles.htm) (French)  \n [British Standards](http://web.archive.org/web/20131014225733/http:/cg.scs.carleton.ca/~luc/britishstandards.html)  \n [A Handy Timeline](http://web.archive.org/web/20131014225733/http:/www.redsun.com/type/classification/) (Which I wonder if accurate enough to use. It seems good to me.)\n\n"
    },
    {
      "time": "1 Nov 2006 — 12:25pm",
      "content": "Having taught Type 101, I can tell you that all the elaborate, historical categories mentioned here, and Bringhurst, are way too much, especially for practical work.  \nHistory would be better taught as history, not in practice at the early stage.\n\nAlthough I scoffed at Helvetica, perhaps I was premature.  \nIf you're teaching basic stuff like leading, paragraph style, size and line length, the depth of type choice mentioned above is not a major consideration, in fact it is dysfunctional.\n\nSo I would say Helvetica, Futura, Bodoni and Garamond (for small caps, alternate figures) would do the job -- or, as Paul poiunts out, equivalent contemporary faces.\n\nAny \"Perfect Set\" would be for students in all years.\n\n"
    },
    {
      "time": "1 Nov 2006 — 12:40pm",
      "content": "_Having taught Type 101, I can tell you that all the elaborate, historical categories mentioned here, and Bringhurst, are way too much, especially for practical work.  \nHistory would be better taught as history, not in practice at the early stage._\n\ni was wondering if perhaps _Elements_ would be too advanced for intro-level classes.\n\n"
    },
    {
      "time": "3 Nov 2006 — 6:44am",
      "content": "@dan  \nyes, that's somehow similar to the vox-classification list the most teachers have.\n\n@paul  \nWhy not replace the \"oldies but goldies\" with new faces, okay… But someone will ask, why not taking the classical standard faces, maybe just because of their classical names (Futura is better known as Verlag). So what are the \"Killer Arguments\" for new faces in the \"vox-classification\" system?\n\n@nick  \n\\>So I would say Helvetica, Futura, Bodoni and Garamond (for small caps, alternate figures) would do the job — or, as Paul poiunts out, equivalent contemporary faces.\n\nHmm, yes that sounds quite realistic…\n\n---\n\nAside from Dans list, i would add these:\n\nTo learn about (historical) hierarchy, maybe just an Old Style with regular (book), italic, SC/OldStyleFigures – without (the \"modern\") semibold, bold, but with different optical sizes.\n\nTo learn about microtypography/layout/consitency/software maybe a super familiy like Thesis (TheSans, TheMix, TheAntiqua).\n\nComplete Univers for swiss style raster typography.\n\n"
    },
    {
      "time": "4 Nov 2006 — 5:34pm",
      "content": "Hi Thomas, it's an interesting question.\n\nLike Nick, having taught the local equivalent of Type 101 for some time now, I realise that my interests in teaching type history are at odds with a student requirement for the practicalities at beginner level. Although I recommend Bringhurst, Spiekermann _et al_ on reading lists, most of what these authors have to say goes straight over the students' heads, so I must reaffirm what Nick and Paul say on this.\n\nA far better text at this level, IMHO, is Colin Banks and John Miles [Pleasures of Design](http://web.archive.org/web/20131014225733/http:/www.linotype.com/2305/pleasuresofdesign.html?PHPSESSID=cdfbc6c620ce6c3729a847e0d7b8ecf0) which has been revised and is on the Linotype site in their Font Lounge area.\n\nAlthough they list 8 categories of type style;  \n– Old Face  \n– Transitional  \n– Modern, or Didone  \n– Slab serif  \n– Sans serif  \n– Decorative and Display  \n– Script and Brush  \n– Blackletter  \nwhich basically follow the Vox-based/conservative lists offered by the early respondents to your post, they don't subdivide the old face, sans serif or blackletter categories. Crucially, in the practical exercises they use only the simplest faces, a sans (possibly Univers), and a serif (possibly Melior) – anything else would be counterproductive.\n\nHowever I think it's important that the traditional Vox classification gets mentioned _before_ the more recent schemes suggested by either Nick above or the FontShop online that 'capture their (student) fancy' – the issue here is that everyone needs to know the standard terms of reference, before they reinvent the categories to their own satisfaction.\n\nThe assignment I teach requires students to research and come up with their own choices for showing examples of what these categories look like. And then layout the results in a 16 page booklet. Perhaps this is the 'killer reason' for using new, contemporary faces instead of the tired old standards, because (theoretically) it changes the learning mode to an active one.\n\nAs for Futura, it really is _not_ better known as Verlag, nor was it designed by a communist (not that that should be any reason to discriminate against the typeface anyway). Both of you should read Christopher Burke's excellent [Paul Renner: The Art of Typography.](http://web.archive.org/web/20131014225733/http:/www.amazon.com/Paul-Renner-Typography-Christopher-Burke/dp/1568981589/sr=1-1/qid=1162687678/ref=pd_bbs_sr_1/102-2755155-9326530?ie=UTF8&s=books)\n\n_What’s the difference between a Garalde and an Aldine?_\n\nIn case this hasn't become apparent from the other posts, loosely speaking an Aldine is a Venetian (or Humanist) type from the Aldine Press of Aldus Manutius. Therefore the older kind of Old Style faces, approximately pre-1520 and generally Italian. Garalde is a compound name belonging to Vox, formed from GARamond and ALDus and refers to the next historical development of the Old Style faces approximately post-1520 and generally French...\n\nThe redsun timeline that Tiffany refers to above is just _not_ accurate enough for me; I am fed up with students going there and then telling me they have found either a typeface or a category called 'gerald'! It also implies that the styles have discrete cut-off points in their development, which is patently untrue. Wish they'd update it.\n\n"
    },
    {
      "time": "4 Nov 2006 — 5:49pm",
      "content": "i've thought about this a bit more and i think that the reason Bringhurst's classification system resontates with me is that it puts type into a larger context of historical art periods. When studying humanities in college it was interesting to see how the architecture, art, music, literature, &c. all incorporated the same sensibilities, i can see in my mind how the teacher might have incorporated types into this scheme as well, but unfortunately this aspect of culture was left out! (what a travesty) Since my education is not in design, i've never had the privelage of sitting in any typography classes, but i can see that too many faces might overwhelm a young student trying to grasp the basics. Rather than Helvetica, I'll take Thomas' idea a bit further and say perhaps limit the students to 1 [superfamily](http://web.archive.org/web/20131014225733/http:/typophile.com/wiki/superfamily) such as [Thesis](http://web.archive.org/web/20131014225733/http:/typophile.com/wiki/Thesis). If it were me, i might choose [Fedra](http://web.archive.org/web/20131014225733/http:/typophile.com/wiki/Fedra), but maybe that's another sub-discussion we might have: Which superfamily might best serve students learning typography in an intro level class?\n\n"
    },
    {
      "time": "4 Nov 2006 — 6:10pm",
      "content": "Lucida?\n\n"
    },
    {
      "time": "4 Nov 2006 — 6:15pm",
      "content": "Does Lucida have smallcaps? If not, i'd say it's out.\n\n"
    },
    {
      "time": "4 Nov 2006 — 7:27pm",
      "content": "Er, no. And probably not OSF either, but it does have an exceedingly wide range of styles. In terms of what you're saying above Thesis makes sense, but then in Type 101 there are other considerations - that Banks & Miles text I mentioned didn't have any instruction on setting small caps and OSF either. I tend to leave that to more advanced classes.\n\n"
    },
    {
      "time": "5 Nov 2006 — 7:52pm",
      "content": "_Er, no. And probably not OSF either,_\n\nNot true: the Lucida family has both smallcaps and OSFs (at least in the incarnation sold by PCTeX and TUG (TeX Users Group)):  \n [http://www.tug.org/store/lucida/complete.html](http://web.archive.org/web/20131014225733/http:/www.tug.org/store/lucida/complete.html \"http://www.tug.org/store/lucida/complete.html\")\n\n"
    },
    {
      "time": "5 Nov 2006 — 8:02pm",
      "content": "Cool. I was looking elsewhere for my information...\n\n"
    }
  ]
}
