{
  "id": "29201",
  "title": "Screenprinting screen letters",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": " ![](http://web.archive.org/web/20140805050706im_/http:/typophile.com/files/ap_6302.jpg)\n\n ![](http://web.archive.org/web/20140805050706im_/http:/typophile.com/files/qz_4761.jpg)\n I partly post this to see if anybody can take a crack at what typeface this is based on, most likely hand done. But I was wondering if anyone can give me some insight about these screens. I bought them in a junk shop, apparently they had been there a long time. The ink is still on them. At first I had guessed it was used by sign painters, but it seems impractical for individual letters to have a screen that big. Why would someone need a complete alphabet like this?\n\n\\*Note the % and ! as well as the extra s,t,e. They are about 4.5 feet wide and 2 feet tall. The letters are approximately 10 inches high. Thanks\n\n",
  "author": "scott_reinhard",
  "time": "31 Oct 2006 — 5:30pm",
  "uid": "4368",
  "comments": [
    {
      "time": "31 Oct 2006 — 7:29pm",
      "content": "Good question. I bet you a pound to a bucket that this is a hand lettered set. Also there is no room to swing a squegee on these frames - barely room for a clean pull, if you know what I mean. Nice Q. Can't think of a practical application - I expect something will turn up.\n\n"
    },
    {
      "time": "31 Oct 2006 — 8:12pm",
      "content": "One possibility, suggested by the extra S, T and E: someone was making movable letters for a sign board. I have a few sets of these, along with a nifty backlit sign. The letters are a gothic style (something like yours), and they're printed on heavy, white plastic cards. You make up the words letter by letter, sliding the cards into a slot on the front of the sign. I got the whole deal for a few bucks at a yard sale. It even included a box of dingbats, arrows and punctuation. Couldn't afford NOT to get it! (Now guests in my living room amuse themselves by making absurd messages.) Just one possibility.\n\nSkylar\n\n"
    },
    {
      "time": "2 Nov 2006 — 3:35pm",
      "content": "Thanks for the feedback. Skyfein, I thought about the moveable letters before also, and that makes the most sense to me. Now that I think about it more, the inclusion of the ! and the % but not any other glyphs seems important. Stores advertising sales and other events would definitely use 50% off, and SALE! Although there aren't any numbers. Makes the most sense though. Thanks.\n\n"
    }
  ]
}
