{
  "id": "29223",
  "title": "John Baskerville",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi there, a few things really I am currently researching the typographist [John Baskerville](http://web.archive.org/web/20131022045310/http:/www.typophile.com/wiki/John%20Baskerville).\n\nDoes anybody know where I can find images of the original typeface\n\nWho or What were John Baserville's Influence's\n\nAny examples of Corparate Use's of his modernised fonts\n\nOr any good books about him?\n\nThanks Simon\n\n",
  "author": "spmcreative.co.uk",
  "time": "1 Nov 2006 — 7:04am",
  "uid": "15196",
  "comments": [
    {
      "time": "3 Nov 2006 — 4:52pm",
      "content": "Book:\n\nPardoe, F.E. : John Baskerville of Birmingham. Letter-Founder and Printer.  \nLondon: Muller 1975\n\n"
    },
    {
      "time": "3 Nov 2006 — 6:24pm",
      "content": "[John Baskerville](http://web.archive.org/web/20131022045310/http:/www.typophile.com/wiki/John%20Baskerville)\n\n"
    },
    {
      "time": "3 Nov 2006 — 6:26pm",
      "content": "AFAIK the Pardoe is the \"standard\", and another good reference is:  \n\"John Baskerville, type-founder and printer\", Josiah H. Benton, 1944 (also 1968).\n\n\\> Who or What were John Baserville’s Influence’s\n\nIn terms of letterforms: his own calligraphy, and letters engraved in metal and stone. But his contribution was \"total\", in that paper and ink were central to his effort, and in this broader aspect it seems that his japanning\\* business (where he made all the money that he would later spend on typography) had a distinct \"ideological\" influence.\n\n\\* [http://www.answers.com/japanning&r=67](http://web.archive.org/web/20131022045310/http:/www.answers.com/japanning&r=67 \"http://www.answers.com/japanning&r=67\")\n\nOne could also suspect that the Romain du Roi had an influence on him. But more interesting is to consider who was influenced by <cite>him</cite>, especially on the continent, where he was better esteemed than on his own island.\n\n\\> Any examples of Corparate Use’s of his modernised fonts\n\nTons. Habitat\\* uses the Fry's version for its logo. Christopher Perfect's \"The Complete Typographer: A Manual For Designing With Type\" has good -if now somewhat dated- examples of usage.\n\n\\* http://en.wikipedia.org/wiki/Habitat\\_(retailer)\n\n--\n\nHere's an image of his original character set, from Pardoe:\n\n ![](http://web.archive.org/web/20131022045310im_/http:/typophile.com/files/PardoeBask17_4245.gif)\n  \nBut it's not an exceptionally good sample.  \n(And you can see where Licko got her \"R\"...)  \n-  \nThe best samples are probably in Paul Bennett's \"Books and printing; a treasury for typophiles\". There's also a very good enlargement in an old article by Philip Gaskell in the APHA Journal. Unless of course you can get your hands on an original. :-) BTW, somewhat easier in this respect is getting one's hands on a volume of Beaumarchais's printing of Voltaire's complete works using his original type (if not his original paper/ink technologies).  \n-  \nhhp \n"
    },
    {
      "time": "3 Nov 2006 — 6:32pm",
      "content": "BTW, who wrote that Mrs Eaves is a \"technical tour the force\" in the wiki? Guy, spacing is the first technical thing that a font has to worry about, and Mrs Eaves is a crash & burn case of spacing. Somebody please fix that.\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2006 — 10:16am",
      "content": "@hrant  \nWhat is the best digital version of Baskerville in your opinion?\n\n"
    },
    {
      "time": "6 Nov 2006 — 10:26am",
      "content": "The next one... :-)\n\nI like Fountain's. For the \"g\". It's very important to me.\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2006 — 12:25pm",
      "content": "I've always liked the swash J, K, N, T and Y of the Italic.  \nIn hot metal, they were available as standard from Monotype, I believe, and as alternates from Linotype, but dropped by most phototype and digital manufacturers.\n\nGoudy used the same idea in some of his italics, and so have I.\n\n"
    },
    {
      "time": "6 Nov 2006 — 12:47pm",
      "content": "_The next one… :-)_\n\nBaskerville Next?  \n\\>^P\n\n"
    },
    {
      "time": "6 Nov 2006 — 1:04pm",
      "content": "\\> I’ve always liked the swash J, K, N, T and Y of the Italic.\n\nBut they're like a group of misfits in high school. The errant distribution of swashes in the original Baskerville italic seems to have been a result of a rush job; as in \"I spent seven years on the Roman, I'll be damned if I do that again!\" It's an example of a failure in moving from calligraphy to type. And every revival so far has either copied his bad decisions, or simply dumped all the swashes.\n\nBTW, the ATF Baskerville (which is actually the Fry version, especially at sizes above 12) had the best collection of alternates.\n\n ![](http://web.archive.org/web/20131022045310im_/http:/typophile.com/files/ATF_swash_4387.gif)\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2006 — 1:52pm",
      "content": "Those ATF swashes are, well, swashy, and a bit too slick. They belong more to Caslon than Baskerville. The great thing about JB's \"swash\" caps is that they don't stand out too much.\n\n_But they’re like a group of misfits in high school._\n\nYou could say the same about the typical roman lower case. \"g\" must have spent a lot of time in the principal's office.\n\nIMO, JB was considering the contrast between the angularity of the italic caps and round lower case forms, and wanted to lessen the contrast between them, so introduced a few softer characters.\n\n"
    },
    {
      "time": "6 Nov 2006 — 2:04pm",
      "content": "\\> The great thing about JB’s “swash” caps is that they don’t stand out too much.\n\n?\n\n ![](http://web.archive.org/web/20131022045310im_/http:/typophile.com/files/bv_4738.gif)\n\n--\n\nThe \"g\" is indeed a misfit. The smart one.\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2006 — 2:25pm",
      "content": "_they don’t stand out too much_\n\nThe gist of my post referred to upper and lower case, in which kind of a setting the swashes are quite at ease. However, even in an all cap setting--properly letterspaced--as I said, they don't stand out too much. Just enough.\n\n ![](http://web.archive.org/web/20131022045310im_/http:/typophile.com/files/mean_5958.png)\n\n"
    },
    {
      "time": "6 Nov 2006 — 4:45pm",
      "content": "I'm seeing an \"N\" yelling \"look at me\"! Very anti-font.\n\nhhp\n\n"
    },
    {
      "time": "6 Nov 2006 — 8:36pm",
      "content": "Its natural environment:\n\n ![](http://web.archive.org/web/20131022045310im_/http:/typophile.com/files/Bask_5363.jpg)\n\n"
    },
    {
      "time": "12 Nov 2006 — 2:56pm",
      "content": " ![](http://web.archive.org/web/20131022045310im_/http:/typophile.com/files/Baskerville_specimen_6533.gif)\n\n"
    }
  ]
}
