{
  "id": "29229",
  "title": "First typeface: a new rounded font",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "So... I’ve been perusing this site and others for some time and have finally made progress on my first font.\n\nI've been really amazed at what a supportive and collaborative environment there is. You might think it would be secretive and competitive, but people seem happy to spread the information and love for designing type.\n\nI’m nicknaming it Router, because it is based on a sign that I saw in the subway where the letters are drilled out of plastic.\n\nI drew the shapes as simple lines with a stroke so I could make lighter and heavier weights if I wanted. Then, I expanded the objects and started redrawing. I particularly like the hard angles that happen inside the m, h, n, u etc. But, I’m not sure it’s dramatic enough... Doesn’t really have an effect when it’s reduced to smaller sizes.\n\nPage 1 are the letters I’ve worked out the most (hamburgefonts), and page 2 shows an example of the sign (with levels adjusted for ease of tracing). Also, the number 8 which was my first love in this font.\n\nIt’s been a great learning experience. I can only imagine how much more I will discover as I go along.\n\nAll the best. And thanks for your willingness to take a look at this.\n\nJeremy\n\n| Attachment | Size |\n| --- | --- |\n| [router\\_103106.pdf](http://web.archive.org/web/20150123134234/http:/typophile.com/files/router_103106.pdf) | 387.97 KB |\n\n",
  "author": "jmickel",
  "time": "1 Nov 2006 — 8:21am",
  "uid": "11130",
  "comments": [
    {
      "time": "1 Nov 2006 — 10:38am",
      "content": "I guess I forgot to mention that I was open to (and hoping for) comments?\n\n: )\n\n"
    },
    {
      "time": "1 Nov 2006 — 11:19am",
      "content": "It does indeed look like it was cut with a router on an engraving jig.\n\nThe \"2\" seems a bit topheavy and leans to the left and I'm not sure what to make of the angle cut in the \"r\". The arches of the \"m\" and \"n\" transition into their uprights a bit too abruptly. Otherwise, this is looking very good.\n\n"
    }
  ]
}
