{
  "id": "29305",
  "title": "Wolfgang Weingart",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[Wolfgang Weingart](http://web.archive.org/web/20131010065646/http:/typophile.com/wiki/Wolfgang%20Weingart) is in NID today and am really happy that we will have a session with him tomorrow at 10 in the morning. I've heard a lot about him and thus quite excited to meet him. But really have no idea what to ask him :) Has anyone here had a chance to talk or work with him\\_?\n\nCheers!!\n\n",
  "author": "satya",
  "time": "5 Nov 2006 — 7:52am",
  "uid": "14032",
  "comments": [
    {
      "time": "5 Nov 2006 — 7:59am",
      "content": "Who is he? Any link to him? What Session?  \nSorry if he is well-known to he majority of Typophile.  \nThanks with [Flowers](http://web.archive.org/web/20131010065646/http:/www.crauswords.com/flowers/FL-smple.pdf)\n\n"
    },
    {
      "time": "5 Nov 2006 — 8:10am",
      "content": " ![](http://web.archive.org/web/20131010065646im_/http:/typophile.com/files/b4ff90fba3dc159c2e6046c4d2784945_5794.jpg)\n  \na great typographer/graphic designer and author of the the book called \"my way to typography\". \n"
    },
    {
      "time": "5 Nov 2006 — 8:18am",
      "content": "So Great to the East and West but still homepage is the best.  \nIs it hard to link to him? Or what?  \nPlease no Puzzles but [Flowers](http://web.archive.org/web/20131010065646/http:/www.crauswords.com/flowers/WFlowers.htm)\n\n"
    },
    {
      "time": "5 Nov 2006 — 8:29am",
      "content": "I don't think that he has a homepage, Aziz. But he is/was a great typography professor in Basel, Switzerland.\n\nSatya, I had the opportunity to spend an afternoon with him a few years ago. He has great stories to tell. Personally, I'd like to know what he thinks about the new avant garde in Swiss graphic design… it is very different from the movement he helped create back in the 1970s. I'm talking about teams like Lineto, Büro Destrukt, Optimo, Norm, and all these great students making new (but often illegible) grid- and system-based typefaces.\n\n"
    },
    {
      "time": "5 Nov 2006 — 8:34am",
      "content": "Ask him if he remembers this crazy Greek guy at Carnegie Mellon in about 1987 when he, Ken Hiebert, and Dan Boyarski taught a 2 week typography class :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Nov 2006 — 8:37am",
      "content": "What's strange about Weingart is that I really like much  \nof what he has to say, and the way he teaches, but then  \nwhen I saw his recent book, I thought: man this sucks.\n\nAsk him about... fonts!\n\nhhp\n\n"
    },
    {
      "time": "5 Nov 2006 — 8:38am",
      "content": "And Tell him to create a webpage for him, if possible.  \nOr on-the-fly blog at least.  \nDan\\_reynolds, Thanks with [Flowers](http://web.archive.org/web/20131010065646/http:/www.crauswords.com/flowers/WFlowers.htm)\n\n"
    },
    {
      "time": "5 Nov 2006 — 8:51am",
      "content": "I found him to be a very good teacher, and visually very perceptive. He was much more open than I thought he would be. He is also a lot of fun. Like any teacher, learn from him what you can in your short time together but don't be afraid to question what he says. He is open to that and the dialogue which follows is a very good thing for both of you.  \nHe is not a type designer, he is a skiiled and creative type user who pushes the boundries of visual syntax purely with type--and a very limited palette of it. Think of it like reducing the number of variables in a scientific experiment. It is easier to focus on the manipulated variables if you control as many of the others as possible.\n\nChrisL\n\n"
    },
    {
      "time": "5 Nov 2006 — 8:58am",
      "content": "\\> It is easier to focus on the manipulated variables  \n\\> if you control as many of the others as possible.\n\nWhich would be great except the point isn't to manipulate variables.\n\nTo achieve, you have to let go.\n\nhhp\n\n"
    },
    {
      "time": "5 Nov 2006 — 9:08am",
      "content": "Each person has their own reasons and methods. They may not be universally accepted or even appreciated by some others but that should not prevent them from choosing their own path. Weingart has spent his life as a teacher and has been successful at it with the methods he chose. Others may be successful teachers doing quite the opposite. That is the beauty of the human mind. It does not have to be confined by the opinions of others. There are plenty of things he has done which I might look at and say \"that is crazy\". I am still glad he did them, otherwise how would I know what would have been?\n\nChrisL\n\n"
    },
    {
      "time": "5 Nov 2006 — 9:09am",
      "content": "\\> It does not have to be confined by the opinions of others.\n\n\"But express a negative opinion about one of my idols,  \nand I will fight tooth and nail to get the last word.\"\n\nhhp\n\n"
    },
    {
      "time": "5 Nov 2006 — 10:03am",
      "content": "did he made any typefaces? i didnt find anything/\n\n"
    },
    {
      "time": "5 Nov 2006 — 10:21am",
      "content": "No, he isn't a typeface designer. He is a typographer, graphic designer, author, and teacher. And probably a few other things, too. Maybe you can ask him to fill in the list. Read his book before the lecture… the type is enormous, and interrupted by pictures, so it shouldn't take too long.\n\n"
    },
    {
      "time": "5 Nov 2006 — 10:51am",
      "content": "\\> And Tell him to create a webpage for him, if possible.\n\nI don't think everybody needs a homepage...  \nIt's still possible to be alive without one.\n\nWeingart was at our school a few years ago. Unfortunatly I was ill that week :(\n\n"
    },
    {
      "time": "5 Nov 2006 — 10:58am",
      "content": "\\>\\> And Tell him to create a webpage for him, if possible.  \n\\>I don’t think everybody needs a homepage…\n\nTrue, but Satya why not fill out the typo wiki with what you learn, maybe even start a wikepedia page on him.\n\nCheers, Si\n\n"
    },
    {
      "time": "5 Nov 2006 — 12:57pm",
      "content": "I had the unbeatable pleasure of studying with Weingart this summer—an amazing teacher and a very generous individual. And he loves being asked questions, is alarmed when students exhibit no curiosity, especially curiosity about the past, about history. So do pose questions. You could ask about his approach to teaching, the years with Armin Hoffman. Also, you could talk about what he sees as the difference between laying out by hand as opposed to laying out on a computer, about the disappearance of manual work in typography. If you really want to get him going, you could ask about his views on grids...\n\n"
    },
    {
      "time": "5 Nov 2006 — 12:59pm",
      "content": "And he does have a homepage:\n\n[http://www.weingartarchive.com/](http://web.archive.org/web/20131010065646/http:/www.weingartarchive.com/ \"http://www.weingartarchive.com/\")\n\n"
    },
    {
      "time": "5 Nov 2006 — 3:43pm",
      "content": "Ask him what he thinks about Helvetica ; )\n\n"
    },
    {
      "time": "5 Nov 2006 — 4:10pm",
      "content": "<cite>Ask him what he thinks about Helvetica ; )</cite>  \ny, any specific reason asking for that? :)\n\n"
    },
    {
      "time": "5 Nov 2006 — 5:03pm",
      "content": "Sorry Satya, I assumed you knew about his comments about helvetica in Lars Mueller's book \"Helvetica: homage to a typeface\". He feels (or used to feel) quite strongly about it and said helvetica was the epitome of ugliness and that anyone who uses helvetica knows nothing about typefaces...I thought you could tease him...  \nserious: after what Linda said I really envy you! I would organise something, show him around Ahmedabad and buy him a drink or two. Go on, ask him: you've got nothing to loose!\n\n"
    },
    {
      "time": "5 Nov 2006 — 5:06pm",
      "content": "He does enjoy his beer verymuch :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Nov 2006 — 5:17pm",
      "content": "I cant offer him beer in the class:)\n\n"
    },
    {
      "time": "5 Nov 2006 — 5:17pm",
      "content": "But definitely I'll tell him to join Typophile for sure.\n\n"
    },
    {
      "time": "5 Nov 2006 — 7:36pm",
      "content": "Satya, you won't go wrong with beer or red wine and Weingart. And outside of class would be more than acceptable. An evening out with enthusiatic students is his idea of heaven.\n\n"
    },
    {
      "time": "5 Nov 2006 — 10:05pm",
      "content": "Mate I'd just shut up and listen!!\n\nMuzz\n\n"
    },
    {
      "time": "6 Nov 2006 — 9:10am",
      "content": "the morning session was really great. ..I got a chance to had a dinner with him...he is really cool and funny. I'll post the session pictures and my experience of the day with him later tonite.\n\n"
    },
    {
      "time": "6 Nov 2006 — 9:23am",
      "content": "Good!  \nGlad you got to see him after class--in his element :-)\n\nChrisL\n\n"
    },
    {
      "time": "7 Nov 2006 — 6:47pm",
      "content": "sorry all. i was a bit busy in academic issues and thus couldnt reply.\n\nChris..weingart couldnt recall this crazy Greek guy's name but yeah he told me that he had a short two weeks typography class there.\n\nLinda, i told him abt you and yeah he knows you. he told me to say hi to you :)\n\nDan, I aslo spoken abt you. He said that he went there at Linotype office but i think it was not one which is in bad hamburger. where did you met him?\n\nWhile dinner he asked me that how do u I know a lot abt him..as I was the only one who asked maximum questions in the session. I told him that am a member of typophile and we've already discussed you there. and i think he knows abt this forum.\n\ni really liked him what said in the session. he said we dont need much typefaces now. As he said in his book that only four typefaces can address any typographic problem. He discussed his book..I asked him abt his round compositions.\n\nWhen I asked him abt his experience with hoffmann and ruder, he showed us a picture taken in NID when he, hoffmann and ruder visited NID in early 60s(sorry I couldn't recall the exact year of visit). he was around 20 at that time.\n\nHe made me shut by saying that its a different story when i asked what he thinks abt Helvetica. :)\n\nhe discussed hot metal, and he showed some of his works.\n\nFor now he has no plan to write any other book..But i told him that plz make it lighter this time( he laughed)..its too heavy to hold;)\n\n ![](http://web.archive.org/web/20131010065646im_/http:/typophile.com/files/DSC08634_4921.jpg)\n  \n\n ![](http://web.archive.org/web/20131010065646im_/http:/typophile.com/files/DSC08627_4715.jpg)\n  \n\n ![](http://web.archive.org/web/20131010065646im_/http:/typophile.com/files/DSC08624_4082.jpg)\n\n"
    },
    {
      "time": "7 Nov 2006 — 7:10pm",
      "content": "Thanks for sharing!\n\n\\> only four typefaces can address any typographic problem.\n\nAh, that explains the book then.\n\nhhp\n\n"
    },
    {
      "time": "7 Nov 2006 — 7:14pm",
      "content": "yeah but it was a answer of my question when I asked him that y his typefaces palette is so limited and y he thinks that only four typefaces can address all the typographic problems:) he didnt repeated it himself :)\n\n"
    },
    {
      "time": "7 Nov 2006 — 10:29pm",
      "content": "That B&W photo early in this thread is actually taken by me in Iceland.  \nWe had Weingart come and visit us for a day and I managed to trouble him for an interview.\n\nThe interview can be found here: (Don't mind the Icelandic introduction, the interview is in English.)  \n [http://www.loremipsum.is/?pid=2441](http://web.archive.org/web/20131010065646/http:/www.loremipsum.is/?pid=2441 \"http://www.loremipsum.is/?pid=2441\")\n\nRagnar Freyr  \n [www.ragnarfreyr.com](http://web.archive.org/web/20131010065646/http:/www.ragnarfreyr.com/ \"www.ragnarfreyr.com\")\n\n"
    },
    {
      "time": "7 Nov 2006 — 11:06pm",
      "content": "he he, i got that picture from the website you've mensioned only and I had read the interview also. Nice picture. But these are not so good photographs..I clicked without leting him know that am clicking him:)\n\n"
    },
    {
      "time": "8 Nov 2006 — 6:21am",
      "content": "<cite>I clicked without leting him know that am clicking him:)</cite>  \nSatya: you're such a groupie, aren't you? ; )  \nNice pics, only maybe you should consider asking permission...just a thought.  \nRagnar, great work and thanks for the link!\n\n"
    },
    {
      "time": "8 Nov 2006 — 6:24am",
      "content": "_I clicked without leting him know that am clicking him:)_\n\nSatya's bringing [Hinglish](http://web.archive.org/web/20131010065646/http:/typophile.com/node/29376) to Typophile. \\>^D\n\n"
    },
    {
      "time": "8 Nov 2006 — 7:01am",
      "content": "Nice photos, Satya. Did your fellow-students enjoy it as much as you did?\n\nAnd Ragnar, great interview—I'd not seen that one. Very interesting as it seems you got him to talk a bit beyond the usual topics. Thanks.\n\n"
    },
    {
      "time": "8 Nov 2006 — 7:47am",
      "content": "\\>  \n<cite>Satya: you’re such a groupie, aren’t you? ; )</cite>  \nyeah lorenza, i am:)\n\n\\>  \n<cite>Did your fellow-students enjoy it as much as you did?</cite>  \nI don't think so :(\n\n"
    },
    {
      "time": "9 Nov 2006 — 7:03pm",
      "content": "Hey Satya,\n\nYou are very lucky man. I am really want to meet Weingart so much.  \nthis is his website [http://www.weingartarchive.com/](http://web.archive.org/web/20131010065646/http:/www.weingartarchive.com/ \"http://www.weingartarchive.com/\")  \nhe does summer school in Basel. IT suppose to be good.\n\nhe had some book published too. If you can find in your libary  \nits called Projekte 1. Its very rare book but its so nice.  \nand its not thick at all :-)\n\nSomeone make a film abt swiss typography as well  \nyou can check this out [http://www.nyfilmvideo.com/2006/lamarch2006/typecast/index.htm](http://web.archive.org/web/20131010065646/http:/www.nyfilmvideo.com/2006/lamarch2006/typecast/index.htm \"http://www.nyfilmvideo.com/2006/lamarch2006/typecast/index.htm\")  \nits far far away from my expectation. :-(  \nI am crazy about swiss typography and I wont buy the film\n\n"
    }
  ]
}
