{
  "id": "29313",
  "title": "Military Intelligence? Poster",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "I did this drawing for an Op-Ed page in the New York Times a while back. I've now designed this poster with the drawing.  \nI'm trying to work on my design and communication skills, just wondering what you think of it. There is no client, it's just a statement. I may print some posters myself and submit it to a poster contest at some point, depends how badly it gets torn apart here...\n\n| Attachment | Size |\n| --- | --- |\n| [military intelligence poster2.jpg](http://web.archive.org/web/20131106080622/http:/typophile.com/files/military%20intelligence%20poster2.jpg) | 360.1 KB |\n\n",
  "author": "ER",
  "time": "5 Nov 2006 — 7:13pm",
  "uid": "13357",
  "comments": [
    {
      "time": "5 Nov 2006 — 7:28pm",
      "content": "Ahh the great oxymoron.\n\n"
    },
    {
      "time": "5 Nov 2006 — 8:18pm",
      "content": "How about a Black Puzzled Cat? With or Without Glasses?  \nQuestioning a Hoopoe or running after Mickey Mouse?  \nHappy Designing with [Flowers](http://web.archive.org/web/20131106080622/http:/www.crauswords.com/flowers/WFlowers.htm)\n\n"
    },
    {
      "time": "5 Nov 2006 — 8:44pm",
      "content": "ER: This is a beautiful editorial illustration, and I don't see any reason for it to be torn apart. I particularly like the strong line work in the face, the way you did the texture of the background, and the restraint you showed in the limited color palette. The composition is simple and strong; here is an artist who knows what she or he wants to say! Many posters are indecipherable at even a short distance. This one puts its meaning across. There's a history of this kind of social and political poster, and my guess is that the artist knows that tradition. There's a respect for the form in it. My gut tells me that this is someone who's going to continue to do great work.\n\nIf I had to choose one area for more experimentation, it would be the headline type. Get ready for my harshest criticism. Here it comes: at the moment, the type is not quite up to the level of the illo. Whew, that's it. (Of course the illo is very good, so you've set the bar high!) When I'm choosing type, there's always the temptation to make the choice \"overly literal.\" For example: an article on France gets an Art Nouveau typeface, a poster for Berlin gets a blackletter, and the African film festival gets Lithos -- you get the idea. When the subject is war, then, the first (and most literal) choice might be a stencil font. In fact, so many people have made that choice, that stencil lettering, when the subject is war, has become something of a visual cliche. So on the type, I'd keep pushing it, trying other kinds of typefaces, even some that are completely unexpected and \"wrong\" for the subject matter. It's in that strange, ever-so-slightly wrong arena that really memorable type happens.\n\nThat's my two cents (probably worth only one). Please keep up the great work!\n\nSkylar\n\nP.S. I'm a sign painter in New Orleans.\n\n"
    },
    {
      "time": "5 Nov 2006 — 9:16pm",
      "content": "I really like your use of colour, subtle green and black works really nice together. and the face is fantastically simply rendered. Agree with prev. comments about the font.\n\nIf I can ask one question: what does this poster say? Are you saying the military's intelligence amounts to thinking about tanks and bombs? And from that, that it's not really intelligence at all? My concern is that there is nothing in this poster to convince you that war/military is dumb unless you already think that war/military is dumb (and you only need to see the tools of war to reconfirm your already existing opinon).\n\nMy advice, for what it is worth, is to find a way to persuade, inform, argue, demonstrate some kind of point about war or the military or something...a question mark just isn't enough; it amounts to asking something like: \"Is the military really intelligent with its guns and tanks and helicopters?\" which to me just poses another question \"is it smart to fight?\", the reality is that many people think that sometimes it is smart to fight wars (I'm not necessarily saying this) so the question has to be, how will your poster convince this person to think again? what extra information will your poster provide to argue the point?  \nhope this helps, disregard any or all at your own discretion :)\n\nNick\n\n"
    },
    {
      "time": "6 Nov 2006 — 4:45am",
      "content": "I was kind of hoping the thinker down there on the medulla oblongata was a guy sitting on the crapper :-)\n\nChrisL\n\n"
    },
    {
      "time": "6 Nov 2006 — 5:02am",
      "content": "Dezcom, please translate into simple English.  \nIf not encrypted for Military Intelligence Purpose?!\n\n"
    },
    {
      "time": "6 Nov 2006 — 5:17am",
      "content": "The \"medulla oblongata\" is the anatomical name for that portion of the brain where ER has put the drawing of the Thinker. The ironic thing is that the medulla oblongata sends messages to the rest of the body (things like telling the lungs to breathe and the heart to pump) as opposed to doing any decision making. In other words, Edel has put the thinking as after the fact and too late to do any good! Quite clever actually!  \nAlso, \"crapper\" is a slang English term for a toilet. My joke was trying to say that military inteligence is like thinking like Sh\\*t.\n\nDoes that clarify it enough for you Aziz? :-)\n\nChrisL\n\n"
    },
    {
      "time": "6 Nov 2006 — 6:29am",
      "content": "As the illustration goes, it is fine. The guy might have a military hat or something to make him look more aggressive in outline.\n\nMy problem is with the concept. If it is a reference to the Iraq war, the idiocy and incompetence has mainly been on the civilian side--Rumsfeld, Bush and Cheney, the unholy trinity of horrors. They ignored and fired military until they got those who would do their bidding. The military are extremely bitter, as yesterday's editorial in the Army Times calling for Rumsfeld's resignation indicates.\n\n"
    },
    {
      "time": "6 Nov 2006 — 6:58am",
      "content": "I think the olive drab color and stencil letters say military perfectly well as is. Adding a hat would actually take away from the X-ray effect and focus it to much too an individual soldier rather than the term Military Intelligence.  \nI did not see this as an Iraq War thing only. I saw more the general term \"Military Intelligence\" and that the only actions possible from military Intelligenmce are military actions because that is all they have in their heads. Ask a butcher to bring home dinner and you get meat, ask Vegetarian and you will get vegetables. Ask Ghandi as opposed to Rumsfeld how to solve the Iraq problekm and you would have gotten far different solutions.\n\nChrisL\n\n"
    },
    {
      "time": "6 Nov 2006 — 7:32am",
      "content": "\\>take away from the X-ray effect\n\nGood point, Chris. I guess my problem is that that guy looks too nice. If you made his brow more prominent, nose more pointed, maybe he would look more militaristic. Now [this guy](http://web.archive.org/web/20131106080622/http:/www.fontblog.de/fraktur-ist-auch-eine-nazi-schrift) looks militaristic :)\n\n\\>Ask a butcher to bring home dinner and you get meat, ask Vegetarian and you will get vegetables.\n\nAbsolutely. My point is that you had the 'chicken hawks' Bush and Cheney doing the asking. And the civilian fool Rumsfeld as operational boss executing the request with supreme arrogance and amazing incompetence.\n\n"
    },
    {
      "time": "6 Nov 2006 — 1:25pm",
      "content": "<cite>The guy might have a military hat or something</cite>\n\nAnd maybe a moustache. Or a beard.\n\nJust kidding - I think the poster looks great - clean, but dirty in all the right ways. However, I don't understand the message. Are you saying that the military only thinks about war? Isn't that sort of the point of the military?\n\nIllustration-wise, it's very nice.\n\n- Lex\n\n"
    },
    {
      "time": "6 Nov 2006 — 2:50pm",
      "content": "One more thing - I would give the text the same subtle texture that the head has to make the two elements mesh a little better. Also, the '?' could be in white to bring some more white in, but I'd have to see it before deciding which works better.\n\n- Lex\n\n"
    },
    {
      "time": "15 Nov 2006 — 11:02am",
      "content": "Yeah, military intelligence – orthodoxy’s moron, hunh hunh hunh. But leaving the plop plop fizz fizz (cheap bromides, get it? hunh hunh hunh) aside….\n\nFirst, my creds: I was in the U.S. Army for eight years. I’ve done some unusual things, but I wouldn’t have to kill you if I told you. We have people for that. I’m a technical writer and editor, not a typographer or graphic designer. From the latter points of view, I’m an aesthetic naïf, and I’m sure the poster’s semiotics are giggling as they vault right over my head.\n\nHaving said that, the poster just doesn’t say ‘military’ to me. The green and black color scheme strikes me as invoking an “old school” that never was. The text is basically an Ishihara color blindness test, and the green is nowhere near real olive drab. Despite the SWAT crap you see on TV, real soldiers don’t wear black in combat; it’s too visible, even at night. Why not use a modern desert tan or urban camo or other break-up pattern? Overall, the poster seems flat, enervated, and simplisme, but perhaps that’s part of the in-joke.\n\nConsidering the wide variety of military weapons, why repeat the same few weapons over and over? Here again, the items are old school big iron: planes (yes, even the F-117), tanks, and are those submarines or blimps? Think what you will about military intelligence, the fact is that modern armed forces run on information. It’s called network-centric warfare. Why not use GPS or intel satellites, computers, UAVs, etc., etc., as design elements? And make the font something futuristic and high-tech, not tired old GI stenciling.\n\nInstead of the head, how about a helmet with night vision goggles? You could make the lenses purple or magenta or dichromatic, something that really pops and gets across the idea of surveillance and reconnaissance (black helicopters, if you prefer). Or go to the Natick website and see what’s up with body armor and exoskeletons.\n\nIf you simply can’t live without the visual “pun” (otherwise empty head with big boy toys floating around) on military intelligence, OK, I have a suggestion for that, too. I’m a fan of Polish posters. While I don’t like the specific subgenre, they sure do have a way with bloody, bruised, mangled, exploded, and otherwise abused human heads. Why not go to a site like [http://www.theartofposter.com](http://web.archive.org/web/20131106080622/http:/www.theartofposter.com/ \"http://www.theartofposter.com\") (my favorite) or [http://www.polish-poster.com](http://web.archive.org/web/20131106080622/http:/www.polish-poster.com/ \"http://www.polish-poster.com\") and check out the work of artists such as Jan Lenica, Wieslaw Walkuski, Waldemar Swierzy, Wiktor Sadowski, and Andrzej Pagowski?\n\n"
    }
  ]
}
