{
  "id": "2932",
  "title": "Sign of times. Our lives.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Today is a sad day for the company where I work. My supervisor had an heart attack and is on hospital with a very reserved coma status. He his 35 years old, and like many of us had a very stressed \"modern\" life. I come from a very small village and I've seen my family with no stress whatsoever. I usually spent 8 hours on work before a computer, go home eat something, and usually go and work freelancer more 4-5 hours a day... I wonder if it's necessary all of this. Modern life...\n\n",
  "author": "adriano",
  "time": "2 Feb 2004 — 4:43am",
  "uid": "1735",
  "comments": [
    {
      "time": "2 Feb 2004 — 4:56am",
      "content": "Yes life is too short to work, but unfortunately most of our economic situations mean we have to. Any suggestions aside from becoming a train robber?\n\n"
    },
    {
      "time": "2 Feb 2004 — 8:16am",
      "content": "Adriano, that's very sad.   \nThe one thing that I think helps a lot is this: don't buy any of the junk they want us to buy. Cut your debt, and they lose most of their power over you. If your social circle looks down on not buying crap, look for another social circle.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Feb 2004 — 9:00am",
      "content": "Boy, good advice, Hrant.   \n   \nDebt reduction and freedom from feeling like I just \\*have\\* to buy stuff has been the focus of my household the last few years.   \n   \nWe are not anti-stuff. We just feel like we want to be free of it - get rid of its hold on us. We still enjoy things.   \n   \nToo bad about the fellow struggling for his life now. It seems to be a roll of the dice. Genetics, environment, temperment ...etc.   \n   \nLive every day as if it is your last - love you family and friends. Sounds sappy, but it is true.\n\n"
    },
    {
      "time": "2 Feb 2004 — 10:50am",
      "content": "In the end it's exactly that. Live every day. And Hrant, I totally agree with you... altough I'm looking for a house and I'll soon make the big debt.   \n   \nLast news, he's out of danger, let's see what happens.\n\n"
    },
    {
      "time": "2 Feb 2004 — 10:52am",
      "content": "Well, I must be a success story. When I die I will take it all with me.   \n   \nI travel light.\n\n"
    },
    {
      "time": "2 Feb 2004 — 11:44am",
      "content": "I was at my eye doctor for a check up recently, and came across the \"20/20\" rule, a nice piece of health propaganda for digital drones:   \n   \n\"Every 20 minutes, look away from your work and spend 20 seconds focusing on something in the distance.\"   \n   \nSimilarlry, checking in on Typophile and maybe making a post also helps relieve the pressure. But every 20 minutes would be a bit excessive.\n\n"
    },
    {
      "time": "2 Feb 2004 — 12:16pm",
      "content": "My problem is that I love the work, and find it difficult to turn down an interesting sounding project, even if I already have too much on my plate. Recently, I started finding creative ways to deal with this, such as inviting colleagues to collaborate on projects, so I don't feel like I'm under a mountain of work that is only getting heavier, but this is only possible because I'm 100% my own boss. I feel really sorry for the people who are overworked through someone else's decision; at least I know I have only myself to blame.\n\n"
    },
    {
      "time": "2 Feb 2004 — 1:26pm",
      "content": "Coming from a family of Norwegians, I tend to enjoy work.   \nRecently I've found that having my dog with me while I   \nwork has made a world of difference. He forces me to take   \nit easy and have fun.\n\n"
    },
    {
      "time": "2 Feb 2004 — 2:33pm",
      "content": "It's not so good for your body to sit in front of a screen and press buttons.   \nthis man can take his work jogging: [http://www.flashenabled.com/nimages/portablegeekgymii.jpg](http://web.archive.org/web/20131106065557/http:/www.flashenabled.com/nimages/portablegeekgymii.jpg)   \n   \nYour company may not agree to set you physically free.   \n   \nadriano, thanks for opening the topic. Good health to your supervisor.\n\n"
    },
    {
      "time": "2 Feb 2004 — 3:27pm",
      "content": "I also think that the only reason why I sit again at home doing the \"same thing\" but with extra feeling and with more passion is because I LOVE WHAT I DO. This takes so much time and energy from my life that i have the same problem as you John H. I just can't turn off this design way of life. I don't know if this will change with time (kids & other extras ![:-)](http://web.archive.org/web/20131106065557im_/http:/www.typophile.com/forums/clipart/happy.gif)) but we'll see. On this last year I also got a pile of work that I've accepted (with no time at all to do a good job) and got my friends to work on these projects. On the first years I did everything and this is a serious mistake.   \n   \nThat 20/20 rule is a good idea!   \n   \nThanks for the good vibes and support.\n\n"
    }
  ]
}
