{
  "id": "29342",
  "title": "Whose work is it? Digitizing from a recognized designer's hand lettering...",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "For years now I've been a fan of a certain type designer's hand lettering, of which I have a small gathering of samples. Recently I designed a broadsheet using letters drawn from scans of these samples by tracing each individual letter and placing each vector outline into position, one at a time, in Illustrator. However, after years of making small adjustments to fonts, I've finally decided to try my hand at developing one, and am planning to do so based on the above mentioned hand lettered samples.\n\nMy plan is 2-fold:\n\n1. To scan and trace the hand-lettering samples in rough form (that is, \"keeping\" the rough edge of the calligraphic letterforms) and develop an OpenType version with various ligatures & auto-replacements. Additional glyphs would have to be created from scratch for missing letters, analphabetics, numerals, etc.\n2. Use the same scans again, but this time draw each letterform from scratch to create a smooth version of each. Again, additional glyphs would need to be created for missing letters, analphabetics, numerals, etc.\n\nThe two would be called something like \"DesignerNameHandLettered - Rough\" and \"DesignerNameHandLettered - Smooth.\" These are only throw-away name suggestions, but they may come into play in my queries below.\n\nTo begin with these would simply be an experiment for myself, to go through the process and see what I can put together. However, if they result in something useful, there might be the possibility of releasing them into the world.\n\nSo, my questions:\n\nWhat are the ethical/legal implications of developing the \"rough\" version, which would be more or less directly traced from the samples I have, along with the additional glyphs I would make to fill in the gaps.\n\nWhat are the ethical/legal implications of developing the \"smooth\" version, which would be all original outlines, loosely based on the samples, along with the additional glyphs I would make to fill in the gaps.\n\nAssuming that such endeavours are ethically/legally doable, what sort of naming protocol might I employ? That is, my \"Rough\" and \"Smooth\" name variations are awful, so I'm looking for some general input on this front.\n\nI've refrained from mentioning the designer by name as I'd like to deal with the general implications of such a project first. (For example, including the designer's name in the font names may pose an issue, but I'll address that down the road...)\n\nAny and all advise would be appreciated...\n\n",
  "author": "jason",
  "time": "6 Nov 2006 — 2:35pm",
  "uid": "3771",
  "comments": [
    {
      "time": "6 Nov 2006 — 3:00pm",
      "content": "The first thing I would suggest doing is to contact the designer or his estate to see if they would even allow such a thing.\n\n"
    },
    {
      "time": "6 Nov 2006 — 3:03pm",
      "content": "A great number of lettering artists in the Golden Age of same fully expected—and, in fact, encouraged (by way of how-to books—others to copy their work, so there are no ethical problems, especially since you state your intention to credit the original designer. Legal implications are another matter: if \"DesignerName\" is still living, or if his/her heirs administer an estate, or if another foundry has trademarked the name, then you may have problems (in the last instance, if a certain foundry has trademarked the name, you WILL have problems).\n\n"
    },
    {
      "time": "6 Nov 2006 — 3:06pm",
      "content": "Legally, you're probably okay if you don't use the designers name to promote either font. Ethically, I'm with Tiffany, you need permission from the designer even if you don't use their name and regardless of how much you modify or regularize the scans.\n\nAs an alternative produce the font and write a letter to the type designer using the font. Ask mundane questions about his/her inspiration from Latvian carved folk art inscriptions. If they reply without mentioning the font - you're in the clear!\n\n"
    },
    {
      "time": "6 Nov 2006 — 3:13pm",
      "content": "If you do this project with the firm, final conviction that you will never try to release it for sale or distribution, I see it as a valuable way for you to learn a lot of useful things about type design. I think the different treatments/interpretations could be interesting.\n\nHowever, there are definitely ethical problems doing this for future sale. For one, if the type designer is alive, have you considered asking them if you could digitize their handwriting, for any purpose? If this person is a type designer, I would be very hesitant to even propose making type from their handwriting unless you had entered an agreement with them that you would allow them to approve or edit what you produce. How could you be sure they are not planning to do their own handwriting face? Why choose the handwriting of a type designer and not a musician, parent, or other person who has no involvement in type design? This makes your situation more delicate.\n\nThe best approach is to ask the type designer about it and see what they would agree to. I suspect the designer would want to be involved with any typeface made from his/her handwriting. Contact the designer. Do not expect to release such a design without their involvement.\n\n"
    },
    {
      "time": "6 Nov 2006 — 3:17pm",
      "content": "I'll skip the legal and ethical parts. Wether or not you have the legal or ethical right to release, you are obviously a fan of the work, and should make it for yourself. Additionally, OpenType is a fascinating tool for communicating that that we've barely begun to dig into.\n\nAs far as names, I wouldn't use a \"BlahBlahHandLettered\" + \"rough\" and \"smooth\". It isn't exactly hand lettered, once you redesign it as a smooth crisp face. Perhaps \"Blah Blah\" and \"Blah Blah Hand\", instead? Even better, perhaps instead of using the designer's name,\"Blah Blah\" could be a word association from an aspect of their life, philosophy or influence on you? That idea is again, totally separate from any legal reasons.\n\n[Choz Cunningham](http://web.archive.org/web/20131013032405/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20131013032405/http:/www.exclamchine.com/)  \n [The Snark](http://web.archive.org/web/20131013032405/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "6 Nov 2006 — 7:25pm",
      "content": "Thanks for the feedback so far, much of which is what I expected, yet hoped against. Given the tendency of designers & foundries to issue multiple versions of classic faces (Garamond, Bembo, etc.), even utlizing the name of the original designer (and in such cases we're talking about designers who actually made the type [for print]), I had my fingers crossed for a unanymous green light. Of course, those faces are hundreds of years old and thus public domain, and, really, I'm not quite that foolish.\n\nTo add a bit of information, the designer in question is no longer alive (died last centry). The letterforms are not \"handwriting\" but carefully crafted caligraphic letterforms, in the shape of Roman capitals (some of you out there are probably getting close to figuring out who and what I'm talking about). I've also just discovered that the designer's surname is trademarked by the foundry that handles the designer's fonts (OK, now I'm sure there are a few who known who I'm talking about.)\n\nThere are a handful of fonts commercially available by this designer, but all of these were designed as type for print, as opposed to hand-drawn letterforms meant as calligraphy.\n\nSo, for the moment I'd like to see where this thread goes, to see if others might have different perspectives, or, better yet, first-hand experience with such a project. Once things flesh out a bit more here it looks like my next task will be contacting the designer's estate and or trademark-owner, which will likely, I'm afraid, squash the idea completely.\n\n"
    },
    {
      "time": "6 Nov 2006 — 8:21pm",
      "content": "I really don't know, but if it is someone who died 50 or more years ago, my hunch is that it would be OK legally and morally. For example, Christian Schwartz, Dennis Pasternak and George Ryan have all done typefaces based on the same piece of lettering by Oswald Cooper, who died in 1940. And the later two are even with the same foundry! As you will see, they are all different:\n\n[Fritz](http://web.archive.org/web/20131013032405/http:/fontbureau.com/fonts/Fritz)\n\n[Maiand](http://web.archive.org/web/20131013032405/http:/www.galapagosdesign.com/original/maiand.htm)\n\n[Robusto](http://web.archive.org/web/20131013032405/http:/www.galapagosdesign.com/original/robusto.htm)\n\nMy guess is that you will find that the distance between 'rough' and  \n'smooth' is way farther than one might think--as the diversity of these examples shows.\n\n"
    },
    {
      "time": "6 Nov 2006 — 8:31pm",
      "content": "was this designer... Eastern European?\n\n"
    },
    {
      "time": "6 Nov 2006 — 10:27pm",
      "content": "Yep. [I was wondering when the sleuthing would begin.]\n\nEdit: Eastern European born, but German by nationality, I believe. (Thanks, Hrant, for the clarification.)\n\n"
    },
    {
      "time": "6 Nov 2006 — 10:55pm",
      "content": "i had an idea. i'm not sure how many type designer/calligraphers there are. if i'm thinking who you're thinking, i would guess you're pretty safe. Definately a style worth making a type from, and (if i have the designer right) there's actually quite a bit of stuff to use as reference. i have a bit of a letter written in his casual hand, which is just gorgeous.\n\n"
    },
    {
      "time": "7 Nov 2006 — 10:13am",
      "content": "If the designer is no longer alive, maybe you can just say who it is. Other designers are likely to have information and ideas for you. Is it Menhart?\n\n"
    },
    {
      "time": "7 Nov 2006 — 10:31am",
      "content": "Or maybe we can kill him for you.  \nSo either way we have to know who he is. ;-)\n\nhhp\n\n"
    },
    {
      "time": "7 Nov 2006 — 10:42am",
      "content": "I'm not exactly sure why, but I'm somewhat reluctant to broadcast who it is just yet, but Carl is right, others may be able to point me in the direction of further research and assistance. So, for the moment I'm going to send instant messages to a couple of you to see if you have any advice...\n\n"
    },
    {
      "time": "7 Nov 2006 — 2:57pm",
      "content": "_\"not exactly sure why, but I’m somewhat reluctant to broadcast who it is\"_\n\n_\"Or maybe we can kill him for you.\"_\n\nI can't imagine why you'd be reluctant! Okay, upthread you mentioned that he died last century. Is that like 100 years ago, or 6?\n\nAnd are you thinking the making idea is squashed, or just the releasing?\n\n[Choz Cunningham](http://web.archive.org/web/20131013032405/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20131013032405/http:/www.exclamchine.com/)  \n [The Snark](http://web.archive.org/web/20131013032405/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "7 Nov 2006 — 3:20pm",
      "content": "Let's say in the last 50 years. I'll likely go ahead with at least the first part of the plan, simply as an experiement for myself. Clearly I need to do considerable research and outreach before pursuing anything further than that.\n\n"
    }
  ]
}
