{
  "id": "2936",
  "title": "Ten radical 21st century typefaces",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "A few months ago I asked Typophiles for suggestions for a magazine article I was writing for Graphic Exchange.   \n   \nThat article is now finished: [New Plastic Weapons.](http://web.archive.org/web/20130309225123/http:/www.shinntype.com/Assets/Depts/Essays/NewPlast.pdf) (1.5mb pdf)   \n   \n(The layout in the pdf here is pretty much a straight dump, and not that which the magazine art director came up with, which restricted the size of the type specimens.)\n\n",
  "author": "Nick Shinn",
  "time": "2 Feb 2004 — 12:14pm",
  "uid": "2021",
  "comments": [
    {
      "time": "2 Feb 2004 — 12:50pm",
      "content": "Nice article! Lingua rules. Two gripes:   \n1) Unibody's italic simply does not work for emphasis. Let's get over it - alltogethernow.   \n2) As much as I like Panoptica, I wouldn't have included it [if it was my design]. Dude.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Feb 2004 — 1:23pm",
      "content": "\\> I forgot   \n   \n [http://typographi.ca/000665.php#000665](http://web.archive.org/web/20130309225123/http:/typographi.ca/000665.php#000665)   \n   \nPanoptica: there's no question it would be a highly appropriate choice for inclusion in such an article... if it weren't the author's own creation.   \n   \nhhp\n\n"
    },
    {
      "time": "2 Feb 2004 — 4:20pm",
      "content": "Hrant, I promise to stop the flagrant self-promotion, after I'm featured in Eye or Graphis.\n\n"
    },
    {
      "time": "2 Feb 2004 — 5:13pm",
      "content": "\"Firstly\"? Wow.\n\n"
    },
    {
      "time": "2 Feb 2004 — 8:25pm",
      "content": "Maybe the question of etiquette in promotion should be raised in a thread of it's own.   \n   \nIn my view, Nick Shinn was totally in bounds in including one of his own fonts in this interesting article. It is relevant, above board, not overdone, and he is the author. It helps that the typeface is actually innovative and good!\n\n"
    },
    {
      "time": "2 Feb 2004 — 9:16pm",
      "content": "I think it is perfectly legitimate for Nick to have included Panoptica in the way that he did. I've seen much more egregious self-promotion by authors, often not only including their own work but waxing at length on just how good it is. Nick just describes Panoptica and explains what he tried to do with the typeface.\n\n"
    },
    {
      "time": "3 Feb 2004 — 8:37am",
      "content": "Sorry to do this, Yves has me looking at text in editor mode.   \n   \nYou've got a typo in the Perla section. In the copy you refer to the designer as Hughes not Hague. Don't know if it's too late.   \n   \nBTW. Agreed, that inclusion of Panotopica is above board and appropriate in its novelty.   \n   \nRandy\n\n"
    },
    {
      "time": "2 Feb 2004 — 1:12pm",
      "content": "Nick - Excellent picks. Nice piece.   \n   \nHrant -   \n1) Why? Sorry, I forgot.   \n2) I agree that maybe Nick shouldn't have included it, being   \nthe author, but I do believe Panoptica fits the article and is   \nworthy of the title's label. Tough call.\n\n"
    }
  ]
}
