{
  "id": "29377",
  "title": "creative CV ideas",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "i am currently designing my CV to send off to employers for a work placement (graphic design) but i want it to be creative and spark some humour into it because thats who i am but im having difficulties with ideas. I was going to do one online but aswell as that, i want to do one taht i can send off to them and add a little extra item thast creative and that they can have in their office. what could that item/object be? i was once sent a cd like cover that popped up and became a little box to put your cds in and was jsut kept intackt with 2 elastic bands inside that allowed it to become an actual cube. i'd like something creative and unusual. any ideas welcome.\n\n",
  "author": "missgiggles",
  "time": "8 Nov 2006 — 6:14am",
  "uid": "14600",
  "comments": [
    {
      "time": "8 Nov 2006 — 6:25am",
      "content": "I can't remember the title off hand, but Waterstone's and Borders stock a book all about this kind of thing. Plenty of examples of clever foldy stuff for promotional use, and even has a cd with eps templates. Could be just the ticket if you can get hold of a copy.\n\n"
    },
    {
      "time": "8 Nov 2006 — 6:28am",
      "content": "I send an origami inside every Christmas card for my customers, a different kind every year. I've seen them around after Christmas, so I suppose it works.  \nMight not be the thing for you, though.\n\n"
    },
    {
      "time": "8 Nov 2006 — 7:28am",
      "content": "[http://www.amazon.co.uk/exec/obidos/ASIN/0906212790/ref=pd\\_bxgy\\_img\\_2\\_cp...](http://web.archive.org/web/20121102080511/http:/www.amazon.co.uk/exec/obidos/ASIN/0906212790/ref=pd_bxgy_img_2_cp/026-9401314-3142032 \"http://www.amazon.co.uk/exec/obidos/ASIN/0906212790/ref=pd\\_bxgy\\_img\\_2\\_cp/026-9401314-3142032\")\n\nand some other ideas for books on there as well.\n\nTim\n\n"
    },
    {
      "time": "8 Nov 2006 — 9:03am",
      "content": "any other ideas for creative cv's? what do designers like to be sent? what do they like to receive in creative froms? something useful taht they can use for the office or something creative that forms into something useful? i opt for the 2nd one but what could it possibly be?\n\n"
    },
    {
      "time": "8 Nov 2006 — 11:35am",
      "content": "Here in Washington it's customary to have a plain resume and customize the design/text appropriate to the employer. A really wild design that might get you a job at a three-person design firm could end up right in the trash if it goes to the HR department of a big-firm looking for in-house people. Having something simple can also make it easier for you to use it for digital submission.\n\nConsider producing a really good-looking promotional piece that showcases your work and include a well-typeset traditional resume along with it. This way you get to show off your creative ability without having to worry about offending people who don't like creative resumes.\n\n"
    },
    {
      "time": "8 Nov 2006 — 12:21pm",
      "content": "hmmmmm, im not sure jpad. That might not be the case in Britain.\n\n"
    },
    {
      "time": "8 Nov 2006 — 4:05pm",
      "content": "Had a quick search, there are a number of promising looking options here:\n\n[http://www.waterstones.com/waterstonesweb/simpleSearch.do?simpleSearchSt...](http://web.archive.org/web/20121102080511/http:/www.waterstones.com/waterstonesweb/simpleSearch.do?simpleSearchString=packaging&searchType=3&Image1.x=14&Image1.y=9 \"http://www.waterstones.com/waterstonesweb/simpleSearch.do?simpleSearchString=packaging&searchType=3&Image1.x=14&Image1.y=9\")\n\nBest of luck with it\n\n"
    },
    {
      "time": "8 Nov 2006 — 5:17pm",
      "content": "I would be very careful with the idea of trying to \"add a little extra item thast creative and that they can have in their office.\" You would have to do something very, very clever to be able to pull this off. Otherwise it will be another really lame attempt. I got an 'interview' once for a senior position (I was a junior) only because I had used Quadraat on my well-typeset CV. I didn't get the job, but I got to spend 1 1/2 hours with a senior designer, talking about all sorts of things. Now that design firm is a client of mine for type-specific work. Funny how these things work out.\n\n—K\n\n"
    },
    {
      "time": "9 Nov 2006 — 12:54am",
      "content": "I agree with Kris.\n\nPlus, if we gave you a great idea, is it really yours?\n\n"
    },
    {
      "time": "11 Nov 2006 — 7:35am",
      "content": "If you want to look different (not always wise) without being showy or impractical, a subtle but memorable thing about your CV can really click. Like making it portrait format. But it has to make sense, not be gratuitous.\n\nhhp\n\n"
    },
    {
      "time": "11 Nov 2006 — 3:22pm",
      "content": "I remember my tutor saying that extravagant cv formats and ideas were soooooo last summer and that we should keep it clean and sober and blah blah blah but the same year some guy in our course sent a cv that was identical to a parking ticket (the English one, yellow and black) and put in on the car's windshield of the \"employer\". He did get the job and the whole story was also published on the local newspaper.\n\n"
    },
    {
      "time": "12 Nov 2006 — 5:34am",
      "content": "i guess what lore said makes sense but it probably wont work all the time i guess. depends how much humour the employer got. he could either love it or hate it all together.\n\n"
    },
    {
      "time": "12 Nov 2006 — 3:53pm",
      "content": "oh yeah, he was lucky. He thought it was a good idea and took the risk when everyone was telling him to play it safe. But it was an idea and when an idea is set in motion who knows where it will all end?\n\n"
    },
    {
      "time": "12 Nov 2006 — 6:33pm",
      "content": "<cite>But it was an idea and when an idea is set in motion who knows where it will all end?</cite>\n\nThat can be said about any resume, not just “creative” ones. And if I had a creative resume idea as good as that one, I'd definitely go for it. Hell, if the parking tickets here weren't the size of baseball cards and run off on thermal printers, I'd steal that idea in a heartbeat.\n\n"
    },
    {
      "time": "13 Nov 2006 — 5:03am",
      "content": "Lore, obliquely, brings up a good strategy, try to find out what you can about potential employers (this is useful when you have the classic interview question, \"why did you approach this agency?\"), if the Creative Director has a birthday soon, for example, you could create a cv around a birthday card or maybe base something around a recent project of theirs.  \nDo not stalk them or go through their bins though.\n\nTim\n\n"
    },
    {
      "time": "30 Apr 2007 — 9:30am",
      "content": "had a presentation from a design company today about cv's etc. Some examples they gave were shocking. One guy just sent them a paragraph which was poorly printed and fuzzy with lines across it becoz the ink must've been runnin out.\n\nsomeone said that somebody sent a cast of their foot which said on it \"well now that ive got my foot in the door.......\" Got him an interview.\n\nanother person said that they were required to send of three examples of their skills but the employers could only see two. They called the guy up and he said \"look a the envelope.\"  \n when they looked at it, he had hand-drawn the stamp and fooled everyone. even the royal mail. got him a job.\n\n"
    }
  ]
}
