{
  "id": "29392",
  "title": "minion pro problems InDesign CS2",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi,\n\nI sent my files to the printer with several swashy alternate characters in the headers.\n\nThe printer's blueprints have come back with those characters appearing as regular, superscript characters.\n\nHe is suggesting that my font file is corrupt. Yet it is the one that came with CS2. Please help! Any suggestions would be good....I've got to get something to him by 9:30 tomorrow morning. I'd like to use the swashy characters if possible, but might have to go with the plain ol' regular ones if I can't find a solution to this.\n\nPlease help!\n\nKristina\n\n",
  "author": "Kristina Drake",
  "time": "8 Nov 2006 — 1:18pm",
  "uid": "9151",
  "comments": [
    {
      "time": "8 Nov 2006 — 1:43pm",
      "content": "convert to outlines a possibility?\n\n"
    },
    {
      "time": "8 Nov 2006 — 2:48pm",
      "content": "Kristina — Did you send an ID package or did you generate PDFs? I strongly recommend to provide PDFs only. If the glyphs you mentioned still don't show up in the printer's proofings, using your press ready PDFs, I guess the printer has to upgrade to the most recent version of Acrobat. (Let him at least upgrade his Adobe Reader.) If his RIP is not compatible, there is nothing left but to convert \\*all\\* your type to outlines. Or even better: generate TIFFs from each page yourself at the output resolution of your printer's plate setter.\n\n"
    },
    {
      "time": "8 Nov 2006 — 3:19pm",
      "content": "And please don't say \"swashy.\"\n\n"
    },
    {
      "time": "8 Nov 2006 — 3:42pm",
      "content": "Jason - well, what are they called? I promise I won't say it again if you tell me the proper terminology -- What about \"fancy\" ;)\n\nIt's only certain alternate characters that I'm having difficulty with. The capitals, for example, are fine.\n\nHmmm.  \nThe printer doesn't want PDFs. The files were packaged. I also provided a PDF, but for viewing purposes only. I will give him a high quality print version tomorrow.\n\nThe thing is, the same thing happens when I open the files on my home computer. I used think it was my home computer that was wonky, but now I must conclude that there's something off about my work computer. I'd like to figure out how to fix the problem, not work around it.\n\nThanks!  \nK.\n\n"
    },
    {
      "time": "8 Nov 2006 — 6:23pm",
      "content": "Hi,\n\nI may have found the problem.\n\nThe version of Minion I have at work is older than the one I have at home. Is it possible that the version did not update when I went from CS to CS2? I'm betting the printer has the same version as on my home pc. Well, crossing my fingers that he does, anyway.\n\nbah.  \nK.\n\nswashy swashy swashy swashy. Poetic license, ok?\n\n"
    },
    {
      "time": "8 Nov 2006 — 9:19pm",
      "content": "Kristina, I had a similar issue with an ornament in Minion. I set the file up in CS and put my ornament in place. But when I opened the file in CS2 the ornament was replaced with the letter P. Each version of InDesign was calling on the font at a different location, and the two files were different; same bug as you: one was the newer, updated version.\n\nSo, the trick might be to scan your hard drive for multiple Minions and check the dates, then move the old ones somewhere safe (or get rid of them), so that your system is only calling on the newest version.\n\nAs for your printer, make them aware of the version issue, and tell/remind them tactfully that they should be installing YOUR fonts, not assuming their version of Minion is the same one you sent.\n\nps. Plain old \"swash characters\" does the job, no need for the pesky \"y\" -- but I'm a grouchy old man who severely punishes my students if I can even _remotely_ apply the word \"cute\" to anything they produce for class, so don't listen to me. Go ahead, swashy away.\n\n"
    },
    {
      "time": "9 Nov 2006 — 6:37am",
      "content": "Aha. That is precisely what's happening. Thank you for the help.\n\nI can't seem to find \\*any\\* minion files on my computer, but I will search some more. I also, oddly, still see CS folders and files. I thought uninstalling would completely remove them, but I guess not. will work on it some.\n\nFor the time being I think the printer has what he needs to do the job.\n\n--------------  \nMy excuse is that, having studied creative writing, I can (very tongue in cheek) claim that I am wildly cutting edge and working on ironic language-based experiments in constructing/deconstructing (as the case may be) new and misunderstood forms of creative expression. ;)\n\nBut don't worry; I have a stickler in me, too. And as for old... I believe I'm only a couple of steps behind.\n\n"
    }
  ]
}
