{
  "id": "29405",
  "title": "Process color swatches that are less conservative than Pantone?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Is there a good alternate color swatch vendor for process swatches? I’m constantly running into problems with Pantone’s swatches just not covering a lot of the Orange, Pink, Red, etc. colors that are possible in modern four-color printing but not represented in my Pantone swatches. Anyone have a recommendation?\n\n",
  "author": "<a href=\"user/14722\" title=\"View user profile.\">jpad</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 9 November, 2006 - 9:48am",
      "content": "There are a few books available, one is the “Process Color Manual” (from Chronicle Books), that show more combinations…\n\n"
    },
    {
      "time": " 10 November, 2006 - 6:54am",
      "content": "Just checking, but when you say “less conservative” are you sure you understand the difference between process and spot colour?\n\nThe Pantone process book I have here certainly doesn’t seem to have any gaps in the brighter colours.\n\n"
    },
    {
      "time": " 10 November, 2006 - 9:50am",
      "content": "Orange is a very difficult color to match in process. Even if you did find a book which had full-chroma Orange I would make a guess that it is because of the separate CMY inks which were used. This is part of the reason why the hexachrome process was developed, AFAIR, to enable richer process colors with the additional hits of color. Reds and Pinks suffer the same, just as blue does. They are only using 2 of the colors (mostly) to make the color and so aren’t as rich on the page. The best thing you can do is to continue to use Pantone but design around the shortcomings of the process. Get into bed, so to speak, with your printer and explain your concerns and see if they aren’t willing to help you find a solution. Perhaps, once you’ve asked, they will tell you of the process they recommend.\n\n"
    },
    {
      "time": " 10 November, 2006 - 10:40am",
      "content": "I understand all of the concepts at work here. It’s just that Pantone’s process swatches don’t display colors that, while difficult to produce, are by no means impossible to get in CMYK. So I’m looking for a set of swatches (or a book) that does.\n\n"
    },
    {
      "time": " 10 November, 2006 - 10:57am",
      "content": "Fair enough, but if it’s something that might need special CMYK ink or particular paper to achieve then isn’t it easiest to ask your printer to match against a Pantone anyway?\n\nAnd if you check the solid to process guide, you can determine which shades are likely to need attention.\n\n"
    },
    {
      "time": " 10 November, 2006 - 11:26am",
      "content": "Pantone are a commercial interest selling a comprehensive 4-colour book is probably against their best interests.  \nPrinters used to produce 4-colour sample books that they gave away to good customers, obviously not cheap to produce and not exhaustive (normally gradated on 10% changes). Ask your friendly neighbourhood printer they might produce one, some digital printers do as well, I have one on my desk. However, like Pantone books, the colours fade so a really old one will only have the cyan left. Double hitting can also improve your coverage – a spot colour might prove cheaper in the end. I think Hexachrome was mainly introduced to correct the purple and orange problems of cmyk.\n\nTim\n\n"
    },
    {
      "time": " 13 November, 2006 - 9:28am",
      "content": "“Pantone are a commercial interest selling a comprehensive 4-colour book is probably against their best interests.”\n\nTheir business is selling color swatches. I think they’re happy selling you whatever swatch book you want/need. ;o)\n\nI’ve never found Pantone’s process books to necessarily be ‘conservative’ anymore than any other process swatch book.\n\nOne thing to do is if you have a favorite printer: the next time you do four-color work with them, print a bunch of swatches on the signature outside of the trim area. Make your own swatch book. The bonus is that it’ll be tailored to your specific printer for you (plus, it’d be ‘free’)\n\n"
    }
  ]
}
