{
  "id": "29400",
  "title": "To buy or not to buy? (Adobe Type Library)",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I recently bought the Adobe Type Collection, OpenType Edition from Monotype Imaging [here](http://web.archive.org/web/20131018063631/http:/www.fonts.com/FindFonts/RecentReleases/2006/Adobe-Type-Coll-OT-Edition.htm) for $3999, when it was on sale for a limited time before it went back up to $4999. It did cut a big hole in my savings since I'm a starving student.\n\nI was wondering what other people's opinions are, since some like to build a small collection over time rather than buy a huge collection. Personally, I thought it was a steal for a graduating student, but nowadays, I'm drooling over some more newer typefaces from Hoefler + Frere-Jones, Emigre, Underware, and Storm that I could've used the $4000 on, though I'll end up with a small collection of families. In some ways, I feel a bit of regret, but in other ways, I feel like I'm taking the collection I have now for granted.\n\nDid I make a bad move by purchasing a large collection of classics but not so much on the fresh, distinctive, contemporary side? Or did I just start a typical library where future expansion is inevitable?\n\nThanks for your thoughts and opinions.\n\n",
  "author": "lapiak",
  "time": "8 Nov 2006 — 10:23pm",
  "uid": "14049",
  "comments": [
    {
      "time": "8 Nov 2006 — 10:49pm",
      "content": "$3999?! This is twice my annual income, Starving student?!  \nWhat a Crazy World!  \nA Font Bomb in one place and Car Bomb in another!\n\n"
    },
    {
      "time": "8 Nov 2006 — 11:01pm",
      "content": "\\> Did I make a bad move by purchasing a large collection of classics\n\nYou tell us, has the investment paid for itself yet? Are your clients happy? Are their customers happy? Would they be happier with fresher fonts? Tell us more about the type of work you're doing, and the type of clients you're doing it for?\n\n"
    },
    {
      "time": "8 Nov 2006 — 11:06pm",
      "content": "Personally, I -- after a thorough preliminary research, of course -- would pick a flexible family or a couple fonts from each category. I'm not saying that you should limit yourself, but, on the contrary, that limiting yourself would result in type usage mastery -- over time, of course.\n\nHmm, let me reword that. More choice is good, but only if you know what you're doing.\n\n"
    },
    {
      "time": "9 Nov 2006 — 12:37am",
      "content": "Brampitoyo is right,\n\nI am by no means an expert but I have been around a little while and I still limit myself to few typefaces, I have my favourites that I know how to use.\n\nI feel that what you have done is a bit of a waste of money, it is good to have a good selection of fonts but you may be digging yourself a big hole. You have given yourself so much choice that it may be more damaging rather than offering you more options.\n\nCliché but true, quality not quantity.\n\nM\n\n"
    },
    {
      "time": "9 Nov 2006 — 6:26am",
      "content": "I could understand buying Adobe's massive collection for use at a huge firm with enough clients that most of those fonts will inevitably be needed, but for a student to buy it for freelancing seems insane.\n\nYou could have bought Bitstream's Type odyssey for a lot less and then picked up a huge number of fonts from other foundries to round stuff out. But hey, at least you'll always be able to design with the most cliche fonts of the previous century. And Myriad.\n\n"
    },
    {
      "time": "9 Nov 2006 — 8:29am",
      "content": "sii: I'm interested in starting up my own small business after graduation, so after spending hours on Typophile, I thought that the Adobe collection offers some of the top classic and well designed fonts for the best bang for the buck. It would be more than enough for my clients, but I agree, a lot of the type, although well designed, are overused. I bought this CD 6 months ago, but this sudden feeling just came to me yesterday.\n\nI could've used the money to buy a couple families from H+FJ, Emigre, and Underware but I might end up with only 7 families, and a client may want something completely different from the 7 families that I have that wouldn't be a problem with the Adobe package.\n\nI don't know, there's pros and cons, but I even though I have a wide range of flexibility, I am going to limit myself to some families to master, while having additional type that can be used as display when the occasion rises. Even if it's overused, it still looks great.\n\n"
    },
    {
      "time": "9 Nov 2006 — 9:55am",
      "content": "Please come back in a year and tell us how it worked out. Maybe having all those options right at your fingers will end up being a big advantage in terms of time and flexibility.\n\n"
    },
    {
      "time": "9 Nov 2006 — 9:56am",
      "content": "With that $ , you could tour one of the Copywrong countries (the list on the rise) for 2 weeks with a fonty [Hinglish](http://web.archive.org/web/20131018063631/http:/news.bbc.co.uk/1/hi/magazine/6122072.stm)-speaking guide then go back home with that and more CD Collections!  \nThinking of setting up a tour company exclusively for some Typophiles?!  \nMore income-generating than designing [Fonts](http://web.archive.org/web/20131018063631/http:/typophile.com/node/19348) and making [Flowers](http://web.archive.org/web/20131018063631/http:/www.crauswords.com/flowers/WFlowers.htm)?\n\n"
    },
    {
      "time": "9 Nov 2006 — 10:10am",
      "content": "[Adobe Type Classics for Learning](http://web.archive.org/web/20131018063631/http:/www.adobe.com/education/products/typeclassics.html) (I think about $100) and Bitstream 's [Cambridge Collection](http://web.archive.org/web/20131018063631/http:/www.myfonts.com/products/bitstream/cambridge/) ($199) would give you a core of excellent fonts at less than a tenth the price. It wouldn't be as complete, but then you would be free to get more things from other foundries as the need arose.\n\n"
    },
    {
      "time": "9 Nov 2006 — 10:47am",
      "content": "I think, over time, the investment will pay off. Most large investments don't have instant returns. However, for future font licensing I would suggest focusing and paying attention to what your clients needs are and license accordingly. I'd guess you'll license more current designs and the pay-off will be instant as the client will love what you've done. :^)\n\n"
    },
    {
      "time": "9 Nov 2006 — 11:32am",
      "content": "I agree with Tiffany. If I had been in your position I would have spent the money on a combination of fewer fonts, a new laptop and top-shelf liquor. However, as you have spent the money (selling them would incur a substantial loss) you should put buyers remorse aside and look at the best way to make a return on the investment.\n\n"
    },
    {
      "time": "9 Nov 2006 — 12:54pm",
      "content": "i've never purchased a full library. i spec new type for most jobs and then have my clients buy me a license, and sometimes buy themselves a license.\n\nmy employer, however, has bought libraries but would never shell out that kind of cash (we bought the Adobe library several years ago when it was much less expensive, and a bit smaller).\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20131018063631/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": "9 Nov 2006 — 1:06pm",
      "content": "<cite>i spec new type for most jobs and then have my clients buy me a license, and sometimes buy themselves a license.</cite>\n\nIf you don't mind my asking, how well does that usually go (do you have to do a lot of convincing?) and what sort of clients do you have? I'm always interesting in finding out how designers are passing on the cost of type to clients.\n\n"
    },
    {
      "time": "9 Nov 2006 — 3:13pm",
      "content": "Miss Tiffany: I think that was my initial thought; that this is a lifetime investment. A big reason why I bought the collection was from the research that I've done, looking up what are \"the best\" serif and sans serif fonts, as well as referring to Bringhurst, I found that the type collection has most of the well known classics. It just dawned upon me the more I hung out here, the more I'm realizing that most of the well-known ones are overused. Even if they are beautiful, I should, as a young designer, go more contemporary.\n\nHaving the idea that it's an investment that will pay off is a little reassuring, since I will be charging the clients for typeface licensing. Considering that 3/4th of the payment I made toward this were from scholarships, I shouldn't feel too bad. I can always add Verlag to my collection one day ;)\n\n"
    },
    {
      "time": "9 Nov 2006 — 4:27pm",
      "content": "One sidenote. Although looking at what is considered as \"the best\" serif or sans is a great idea, you shouldn't base your buying decision off a review alone. This may be the web age, but looking at catalogues – and, perhaps more importantly, specimen prints – are no less important.\n\n"
    },
    {
      "time": "9 Nov 2006 — 6:54pm",
      "content": "I don't think it's a bad decision at all. As typophiles, some of us (myself especially) get a bit jaded about the classics, and addicted to the novelty of new releases. But the Adobe collection has a huge number of very usable and versatile faces, not all of them staid workhorses, either. You could put together a very contemporary publication using Warnock Pro and PMN Caecilia, both of which are part of the the collection.\n\nYou've got a solid base to build from; as the opportunity arises, build on it with newer releases from more adventurous foundries.\n\n"
    },
    {
      "time": "9 Nov 2006 — 8:21pm",
      "content": "Knowing that most of the money came from scholarships the purchase makes a lot more sense. My scholarships only make a small dent in tuition, but if I had an extra $3,000 laying around in scholarship funds, I'd be pretty tempted to spend a lot of it on fonts. Especially if I was planning to do freelance work later.\n\n"
    },
    {
      "time": "9 Nov 2006 — 8:47pm",
      "content": "Type Odyssey 2 from Bitstream at $1500 would have been a less expensive way to acquaint yourself with the \"canon\" of typefaces.\n\n"
    },
    {
      "time": "9 Nov 2006 — 9:34pm",
      "content": "Shoulda coulda woulda\n\nPeople, don't be gross. Joachim already has buyers' remorse.\n\nThat collection is very solid and substantial. Caslon, Minion, Jenson, Chaparral, Dante, Meridien, Perpetua, Galliard, Officina Sans, Joanna, Bickham Script Pro, Sava, Silentium, several Garamonds including the new Premier, etc. all in OT format isn't shabby at all.\n\nIts true there is a \"look\" to work done with only Adobe fonts. Avoid it by strategic purchases of other versatile families from other foundries. Adobe's OT library doesn't have anything like Dolly, Dalliance, Prensa, Neutraface, Quagmire, Luxury, or Neo Sans. As long as you're smart about how you use it, you're in good shape. Learning to expertly combine type will help you avoid that \"90's\" look.\n\nThe type you bought should last a long time. And no matter what collection you get, you'll still have to add to it. Just don't expect to never buy new typefaces again. That's something I'd say to any designer.\n\n"
    },
    {
      "time": "10 Nov 2006 — 2:58am",
      "content": "If you have to make a big investment, this one makes the most sense. Adobe OpenType versions give you access to old style figures (though, maddeningly, not in all cases), alternative weights, Central European accents, etc., that other issues do not. Your new collection deserves to be the center of any type library, and now you have it. It's certainly the center of mine.\n\nHaving said that, you can now move to gradual purchases averaging around $200 for complete families. The major exception is ITC Galliard Pro, issued only by ITC for $315, in which, at long last, Carter has authorized oldstyle figures for all the fonts/weights in Galliard, which the Adobe OpenType version does NOT offer! But after that, Storm's Regent II for $55, everything from JoshuaDarden.com or Hoefler-FJ, plus individual picks like Zingha from FontShop--these are your best future buys at more modest prices. And don't forget MyFonts.com sales: the Portguese family Esta for $12 per font now! Giddyup!\n\n"
    },
    {
      "time": "10 Nov 2006 — 7:49am",
      "content": "<cite>The type you bought should last a long time. And no matter what collection you get, you’ll still have to add to it. Just don’t expect to never buy new typefaces again.</cite>\n\nI agree with that. With too many amazing contemporary ones from other foundries, I just can't stop there. I'm sure with what I have now would benefit me a lot when it comes to book design, something I hope to do in the future.\n\n<cite>Having said that, you can now move to gradual purchases averaging around $200 for complete families.</cite>\n\nI don't know if it's just me, but it's hard to find complete families for $200. The Neutraface family seems like a really nice deal, but the ones I want from Hoefler+FJ are at least $500.\n\n"
    },
    {
      "time": "10 Nov 2006 — 8:04am",
      "content": "_Zingha from_ [Font Bureau](http://web.archive.org/web/20131018063631/http:/typophile.com/wiki/Font%20Bureau).\n\n"
    },
    {
      "time": "10 Nov 2006 — 8:12am",
      "content": "\\>That collection is very solid and substantial.\n\nWhile in your position, I probably would not have made the same choice, I absolutely agree with Carl. There are three great things about the Adobe Type library: 1. Adobe has set the standard as far as technical excellence. 2. Their own originals, with optical sizes and open type features are some of the most complete and flexible text faces around. 3. Slimbach, who has got to be one of the handful of best designers of text types in the world.\n\n"
    },
    {
      "time": "10 Nov 2006 — 9:41am",
      "content": "Quote: it’s hard to find complete families for $200.\n\n--At Hoefler-FJ: Requiem, Verlag, Gotham 1, Hoefler Titling, and Whitney Basic are $200 each family  \n--At joshuadarden.com, all families are around $200, and all are top values  \n--Via FontShop: Pocketype is $79 (5 fonts), Clifford 18 is two fonts for $40 each, Zingha family can be bought as four fonts for $40 each, ditto FF Maiola and Reminga; Richard Beatty's version of Kennerley, the best and most complete on the market, is $200 for the family  \n--Via MyFonts: Whitman family is $140 or $17.50 per font, plus a score of sale-priced items, like Esta at $12 for each of four marvelous fonts  \nand so on and so on...\n\nplenty of great buys out there if you spend the time surfing and shopping!\n\n"
    },
    {
      "time": "10 Nov 2006 — 11:37am",
      "content": "It depends what you mean by a complete family.  \n-Weight  \n-Scaling  \n-Optical sizes  \n-Small caps and OSF  \n-Monowidth  \n-CE, Greek, Cyrillic etc. language support\n\nGenerally speaking, sans faces have more weights and scaling variants, while serif faces will have stuff like optical sizes and SC&osf.\n\n"
    },
    {
      "time": "12 Nov 2006 — 9:50pm",
      "content": "Cyanide\n\nYou could have just gone to [yes, you are going to be censored by a moderator]. Oops. I'm going to be censored.\n\nI suppose one could wonder why every commercial type foundries library is available there for free for what, about a year now, but hush, let's not talk about that.\n\nAnd so it remains.\n\n"
    },
    {
      "time": "12 Nov 2006 — 10:36pm",
      "content": "Gerald, what are you doing? With acts like that I'd think you want people to illegally download fonts. Yes, before you say it, with a little googling things can be found. But people won't find them through Typophile, not on my watch.\n\n"
    },
    {
      "time": "13 Nov 2006 — 8:42am",
      "content": "Tiffany\n\nI'd think a better approach would be to point out that it is unethical and illegal to copy fonts in such a manner. In California, violators face a $10,000 fine and jail time. At least, that is my understanding of the law that is supposedly in place. Also, anyone using bit torrent technology is putting their computer at extreme risk. Maybe pointing out the dangers of copying will prevent copying. Places like Pirates aren't going to be found easily, as they move around quite a bit, they have to. This is poisoned water, better to point that out to folks than ignore that it exists.\n\n"
    },
    {
      "time": "13 Nov 2006 — 9:13am",
      "content": "The people to talk about it with are the type foundries. They'll be interested.\n\n"
    },
    {
      "time": "13 Nov 2006 — 9:44am",
      "content": "Gerald, I agree. Let's start a new thread and talk about it.\n\nHowever, I do not agree with posting links to sites which have software illegally made available for download to prove the point.\n\n"
    },
    {
      "time": "13 Nov 2006 — 9:47am",
      "content": "\"Just don’t expect to never buy new typefaces again.\"\n\nYou've already spent the money so don't worry about it. Concentrate new purchases on specific client and project needs and mark up your bills to cover the expense just like the rest of your overhead.\n\nChrisL\n\n"
    },
    {
      "time": "13 Nov 2006 — 10:36am",
      "content": "From a graphic design standpoint, you gotta start with the classics. I was just in charge of some major font purchases at my job and I opted to go with a full classics package, and a full modern family. The classics/originals package has really come in handy. There's always a need to have faces like Univers and Garamond lying around.\n\n"
    },
    {
      "time": "13 Nov 2006 — 10:52pm",
      "content": "Tiffany\n\nI did not post a link, nor would I have, nor do I know what that link would be. But I have seen how the technology works and on that site. The bit torrent technology itself is not in anyway illegal and it is a valid instrument for transferring massive quantities of information.\n\nI walked away from that demonstration with vivid thoughts. First, that the illegal activity seems a generational thing. The participants act under the guise of \"sharing\" and I suspect that is what they think they are doing. It is also very game-like, with massive amounts of statistics and graphs, along with denigration for those who do not readily share back and applauds for those who willing overshare. The concept of theft isn't a consideration for the participants, they are scoring points and gathering virtual rewards, whether it be a music library, a film library, a type library.\n\nSecond, it would seem apparent that folks like this DO NOT buy fonts. Thus, I suspect this is less a threat to the type market than folks make it out to be, or, here, refuse to talk about. Ethical responsibility and respect for intellectual property are not a part of this scene. I doubt anyone who has actually ever paid for a font collection would put it up in a bit torrent scheme, more likely they illegally copied it in the first place. Another consideration is, would you actually want to trust the integrity of a font gathered in this manner? You get what you pay for?\n\n"
    },
    {
      "time": "13 Nov 2006 — 11:24pm",
      "content": "Article 27.2, UN Declaration of Human Rights:\n\n\"Everyone has the right to the protection of the moral and material interests resulting from any scientific, literary or artistic production of which he is the author.\"\n\nBut the UN, and that document, don't carry much weight with governments East and West these days, on far more serious issues than software piracy, setting the tone for the general population. At least the Enron crooks got their just desserts.\n\n"
    },
    {
      "time": "14 Nov 2006 — 10:28am",
      "content": "Gerald\n\nI agree with you. The people, in general, on those forums aren't those who make up the customers of foundries. I suppose you could also say that the majority of Typophile readers aren't the sort to download fonts illegally either. But, that wasn't my point. My point was (and is) that people, anyone, should not be able to find even information about finding illegally shared fonts here on Typophile.\n\nNo, I wouldn't trust the integrity of those fonts, and yes, they get what they _don't_ pay for.\n\n"
    },
    {
      "time": "14 Nov 2006 — 10:41am",
      "content": "Treat it like carpentars do. You buy a tool when you need one. Then you have it.\n\nI think collections like the ATL are really targetted at huge design/ad firms and print shops.\n\nFor most designers, we ultimately end up with a nice set of 6-12 typefaces that we reliably use all the time, and augment it with the occasional new face for a specific project.\n\n"
    },
    {
      "time": "14 Nov 2006 — 11:48am",
      "content": "\\> In California, violators face a $10,000 fine and jail time.\n\nI don't support font piracy, but statements like this are misleading. Those are maximum fines. I was once charged with careless driving, and found out that in Ontario this could lead to a five year jail sentence. Found out later that almost never would anyone do a week in jail, it was only a fine (mine was about $100). If you killed someone, you might get jail time, but the charge was almost raised to dangerous driving.\n\nSo while you might be able to get a four digit fine and jail time for type piracy in Calif, what is the actual level of punishment that is handed out. I suspect it is probation, and probably loss of the computer.\n\n"
    },
    {
      "time": "14 Nov 2006 — 11:56am",
      "content": "\"Treat it like carpentars do. You buy a tool when you need one.\"\n\nIf only designers could ever break or lose their tools. Then they'd be compelled to get new ones. As it is, designers don't always realize it when their tools aren't useful anymore.\n\n"
    },
    {
      "time": "14 Nov 2006 — 1:49pm",
      "content": "<cite>So while you might be able to get a four digit fine and jail time for type piracy in Calif, what is the actual level of punishment that is handed out. I suspect it is probation, and probably loss of the computer.</cite>\n\nActually, I believe the punishment in California for font piracy is a mandatory 1 week solitary confinement where they are forced to listen to the audiobook version of <cite>The Elements of Typographic Style (unabridged)</cite> as read by Governor Schwarzenegger. By the time Arnold finishes the \"Golden Section\" chapter, most offenders are completely reformed.\n\n"
    },
    {
      "time": "14 Nov 2006 — 2:34pm",
      "content": "LOL!!!\n\nChrisL\n\n"
    },
    {
      "time": "16 Nov 2006 — 7:55am",
      "content": "Cyanide, as long as you are a graphic designer for years to come, having a solid type library is never a bad thing.\n\nIn my own case, I used the $$$ I had from jobs to get hardware and Adobe apps (which come with a little type library on their own), then licensed fonts on a job-b(u)y-job basis. I must admit though, people expect designers to have fonts, and if you're picking up work from someone who's already got a style guide, they would often rather hear \"yeah, I have Univers\" than \"so, I'm billing you for the fonts\". I've hit some snags that you won't with all the standards in your toolbox.\n\nDon't regret it. Everyone's got a cousin who knows a guy who can get X product for 50% less, or thinks that X product is a waste when you could get Y. All choices open and close doors. As long as you consider which are opening and closing, who cares? It's not what all of us would do, but I bet a lot of us would if we could...\n\n"
    },
    {
      "time": "16 Nov 2006 — 9:25am",
      "content": "I bought years ago the Adobe Type basics (65) set, for the reasons Chris Rugen mentioned, I can't always admit not owning a certain common(ish) font. I wouldn't have minded the whole library, but it was way too expensive for me.  \nI've been buying fonts as needed, and last month accepted a very good offer for a Linotype Essentials 1+2 packet, so I should be sorted in some basic level for the time being.\n\n"
    },
    {
      "time": "19 Nov 2006 — 7:50pm",
      "content": "jpad: i often ask for spec copies of the type from the designer or vendor, and once the clients are in love with the type and see the value added that the right typeface offers, i just make them understand that the cost of the type is part of the cost of doing business - it's not negotiable. but all of my clients are my clients because they understand that typography is what i do; i'm not an illustrator, or even a graphic designer; i'm a typographer.\n\nand gerald: where do you get the idea that bittorrent is dangerous? how so? there are lots and lots and lots of legitimate uses for it, and many software developers use it to make enormous files downloadable; open source projects like Democracy use it to take advantage of the hundreds of (legal) streaming media channels that are out there available without putting enormous strain on any one server.\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20131018063631/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    }
  ]
}
