{
  "id": "29407",
  "title": "High school newspaper typefaces",
  "forum": "Design",
  "tags": [

  ],
  "content": "I'm designing a high school newspaper. Right now we're using Helvetica oblique for headlines and Times for text. Most of the other fonts we have now aren't usable for either one. (We do have Minion, and that's about it.) I'm looking for headline and text fonts that are free or cheap for educational use and would be suitable for a newspaper.\n\n",
  "author": "<a href=\"/web/20100421030034/http://typophile.com/user/7144\" title=\"View user profile.\">samd</a>",
  "time": "<br>",
  "uid": "7144",
  "comments": [
    {
      "time": "",
      "content": "Free:  \n [faq\\_free](http://web.archive.org/web/20100421030034/http:/typophile.com/wiki/faq_free) and  \n [good libre fonts](http://web.archive.org/web/20100421030034/http:/typophile.com/wiki/good%2520libre%2520fonts)\n\ni'm assuming your paper is free and not-for-profit. Is that correct?\n\n"
    },
    {
      "time": "",
      "content": "I'd try a different tact \"go local\" - as you're in Vancouver BC, drop Jim Rimmer, Ross Mills, John Hudson, Kieth Tam (yes I know he's not there right now) and Veer a note saying what big fans you are of their work. Say you'd like to write an article about them and was also wondering if they could provide some fonts at a discount for such a good cause.\n\n"
    },
    {
      "time": "",
      "content": "If you have Minion, that likely means that you have a number of other Adobe Pro fonts installed. You might have Adobe Caslon Pro, Adobe Jenson Pro, Adobe Garamond Pro (or Garamond Premier Pro), Warnock Pro, Utopia Pro, or Kepler Pro - all of these can work as body text, with Utopia being the most commonly used. For headlines, you could use one of these, or consider Myriad Pro/Myriad Pro Condensed or Chaparral Pro - both are really great (I'm especially fond of Chaparral).\n\nI just redesigned _my_ high school's newspaper over the summer. I looked at typefaces for a very long time, and ultimately, I decided that buying them was worth the cost in adding typographical interest and in creating a brand identity. I went with Farnham from Font Bureau (by Christian Schwartz) for headlines and Mercury Text from Hoefler and Frere-Jones for body text. Since that cost about $1200 (U.S.) for licensing 7 computers, we went with Myriad Pro for captions and sidebars and Chaparral Pro for everything else - both of which we already had installed. The response has been extremely warm from our readers. So, I'd really recommend that you take a look around this forum, take a look on MyFonts and some smaller foundries and see what's out there. One special typeface just might be worth the price.\n\n"
    },
    {
      "time": "",
      "content": "paul d hunt: Yes, the paper is free and not for profit. We do have advertising, though.\n\nsii: Good idea, but our paper is extremely focused on school and local issues. I don't think I would be able to write an article about any of these people unless they're an alumnus. I will try to contact them and other foundries to see if they have an educational discount, though. (I've already found a few foundries that offer one.)\n\nauricfuzz: Of the fonts you've referenced, we have Adobe Caslon Pro, Adobe Garamond Pro, Myriad Pro, and Chapparal Pro. Chapparal looks good. I'm not sure if I would be able to spend $1200, but I'll check about that. It would certainly help if I could.\n\n"
    },
    {
      "time": "",
      "content": "I'm partial to Chaparral, too (as I am to any good slab-serif, especially less geometric ones). Of the three text fonts you seem to have, Minion, Garamond, and Caslon, I'd try each of them out (preferably on your printing press, or at least at actual size) to see which one is the most legible and matches the \"feeling\" you want to convey. I don't know, but Chaparral could be an interesting change of pace as your body text typeface. My point with buying a typeface or two of your own is that it's not guaranteed that any of these typefaces will match the spirit of the paper quite well enough. But one or two very well could.\n\nFor headlines, I'd either go with the same typeface you chose for body text or use a very different one. My point is, don't use something like Minion for body text and then Garamond for headlines, as they're too different to work but not dissimilar enough to harmoniously contrast. Again, just try out different combinations until you find one that works for you.\n\nIf you have any other questions about redesigning/high school newspaper issues, feel free to contact me privately by clicking on my name and choosing \"Contact.\"\n\n"
    },
    {
      "time": "",
      "content": "Whose idea was it to set all student newspapers originally in Helvetica/Times? When I redesigned my school's paper, that's exactly what it was. Ditto for just about every school redesign I've heard of.\n\nI used Myriad for things like photo credits and cutlines because it is very useable at small type sizes because of its open counters and the large x-height. I also decided to use Garamond Pro for the body copy and for certain headlines since I wanted our paper to feel classy. For the masthead and other various headlines I went a little crazy and chose Old Claude, a cool distressed Garamond. That really sent my design into the direction of early broadsides.\n\nCaslon is very readable. And very, very boring. Caslon, Helvetica, and Times have the market cornered on what my roomate calls \"that just looks like a regular font to me\" category. Regular=Boring.\n\nI'm undecided about Chapparal, but I believe that Bringhurst said he likes it. (That goes along with Sii's comment. I say go for the Vancouver connection.)\n\n"
    },
    {
      "time": "",
      "content": "\\>Whose idea was it to set all student newspapers originally in Helvetica/Times?\n\nIn 1992, when we redesigned the Reading University paper 'Spark' we stuck with Times and Helvetica mostly because of the performance advantages of using printer-resident fonts. Only moved away from these when we got beefier Macs and speedier printers.\n\n\\>I say go for the Vancouver connection\n\nYay! Rimmerfest is coming up.\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "Dan, that is odd about the Helvetica/Times/school newspaper connection. Conspiracy, anyone? Actually, my paper originally bucked the trend and was set in Goudy Old Style, then entirely in Helvetica, then in Times and Helvetica. Now we're using Farnham and Mercury, with splashes of Myriad and Chaparral. Much tastier.\n\nI'm not sure if I'd agree about Caslon being _that_ boring. In my opinion, just about all the typefaces we've been bandying about are heinously overused. I don't think that makes any of them bad or inherently uninteresting. As a high school student, Times and Helvetica bore me the most out of them because every essay is set in Times and much of the web seems to be in Arial. Minion, Garamond, and Caslon are each used enough that I'm not sure if one of them has a natural advantage over the other. Traditionally, Caslon has been the most common, but I actually see Minion much more often than Caslon in print nowadays. And to be frank, as much as I love, _love_ typography, I'm not sure if many readers will notice a large difference in design between the three; they largely didn't when we switched earlier this year. What I think should decide between them is how legible they are on the page. What my readers _did_ notice was the larger x-height of Mercury compared to Times, and that was something they liked.\n\nBringhurst does mention Chaparral in his list of types. And since he mentions so relatively few types, that means he gave it his seal of approval. So maybe it would be a good thing to see if it works as body text. I'm intrigued thinking about it.\n\n"
    }
  ]
}
