{
  "id": "29413",
  "title": "Flooring company logo crit",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi Typophiles,  \nI’m designing a logo for a flooring company. This is a starting business, very small for now. He has a license with the name “Imperial Flooring Solutions.” I notice there were other companies named similar so we came up with the “solutions” before he got the license. He was really sticking to the name because of a family tradition on a different kind of business.  \nIn doing my research I notice almost every flooring company uses either floor tiles or carpets on their logo so that was one thing we wanted to stay away from. Another thing I noticed is that companies named “Imperial” in other fields always use either shields with lions or crowns (for obvious reasons) so that was something we wanted to stay away from.\n\nServices: Laminated Floor, Vinyl, Carpet and installation of all these. No hardwood at all. Commercial meaning no small houses but big buildings. Big projects.\n\nAfter this brief background research I came up with some adjectives with my client.  \n• Direct (client focus in direct contract)  \n• Friendly (Client focus on consulting, advising client for best solution)  \n• Empowering (to give a sense of confidence to the client)  \n• Growth (self explanatory)  \n• Dominating (Imperial, Empire, dominion over areas)\n\nI came up with a set of concepts of which I selected four to explore. I’ve been sketching forever and vectorized another whole bunch but still feel some of them need help. As far as the type, its just my first draft combining icon with type so I haven’t locked up on any solution yet my only strong suggestion would be a slab serif for its rigidness compared to floors and buildings. He tends to like sans serif but serif seems to fit more for a trustable company especially in flooring business but again not locked up into it.\n\nAny type suggestions are more than welcome as I’ve been having a hard time matching a typeface with each logo’s look, e.g. hard edges w/slab pointy edges w/serif etc.\n\n1) Concept one takes on the consulting part as well as relating a pyramid with empire. The horizontal divisions represent floors in a building. The pyramid is formed by a number of arrows coming to an end point, meaning different solutions guided to the best.\n\n2) Concept two takes on the guidance part so like dancing lessons where they show foot steps to follow this idea leads to a center point. This on has been really hard to convey, it was selected only because I wanted at least three different directions. I thought the idea was clever but looks related to a shoe company.\n\n3) Concept three takes on the word Empire or Imperial, overtaking territory. It’s a globe getting covered by floor titles and it highlights an “i”. Legibility on this icon has been difficult.\n\n4) Concept four relates to the first one. This one combines Growth (as in a tree shape/arrow pointing up), Different directions (branches of the tree/arrows), and again the imperial pyramid/triangle shape. I started wit a geometric shape but then decided to try a hand made one to give it some human touch (friendly).\n\nI want to present all four or at least three so let me know what you think/suggest specially type suggestions.\n\nThanks!\n\n ![](http://web.archive.org/web/20130830192649im_/http:/typophile.com/files/IFS_variations_v1_5735.0.jpg)\n\n",
  "author": "kco",
  "time": "9 Nov 2006 — 3:39pm",
  "uid": "8116",
  "comments": [
    {
      "time": "9 Nov 2006 — 4:32pm",
      "content": "#1 - The \"im\" lig bothers me. I don't see \"flooring\" <cite>EDIT: or \"Imperial\"</cite> in any of the marks.\n\n#2 - This is my favourite of the bunch, both type-wise and mark-wise. 2B seems to work the best - the cuts in 2A seem mechanical and forced, as does the perspective on 2C. I think \"Flooring Solutions\" should be bigger, and justified with \"IMPERIAL\".\n\n#3 - Why would I buy flooring from a company whose mark is a bumpy floor? I want my floor to be nice and flat.\n\n#4 - This looks more like a tree than anything else. Since you said they don't do hardwood, it's probably not the best way to go. However, I do like the style of this mark. Maybe draw up 2B in this style.\n\nHope this helps.\n\n- Lex\n\n"
    },
    {
      "time": "9 Nov 2006 — 4:48pm",
      "content": "Sure it helps to hear the way you see things Lex,\n\nCouple things:\n\n\\> I don’t see “flooring” in any of the marks\n\nI think this was part of the agreement with the client of not doing what every other flooring company is doing. And I guess you dont have to see the product right away. e.g. do you see a computer in the apple logo? its more about the concept i think.\n\n\\> I want my floor to be nice and flat.\n\nTrue! hehe\n\n\\> 2B seems to work the best\n\nDoes it look too much like a shoe company? I'll try a couple other ideas I have for this.\n\nThanks again Lex!\n\nKco\n\n"
    },
    {
      "time": "9 Nov 2006 — 4:56pm",
      "content": "<cite>I think this was part of the agreement with the client of not doing what every other flooring company is doing. And I guess you dont have to see the product right away. e.g. do you see a computer in the apple logo? its more about the concept i think.</cite>\n\nI think I edited my post while you were composing yours :)\n\nThe word Imperial has many connotations. It could be the British Empire, Roman Empire, Japanese Empire, &c. Maybe you could find out what Empire Imperial refers to and work off of that.\n\n- Lex\n\n"
    },
    {
      "time": "9 Nov 2006 — 5:06pm",
      "content": "Just my two cents:\n\n#1 is your best option to explore further. I agree that the im ligature is very awkward. I would suggest a slab serif font for \"imperial\" and maybe a clean sans (frutiger, gotham, or helvetica) for the Flooring Solutions. I would say that the pyramid needs some refining. Right now I would think it would be a brick building industry, not flooring.\n\nWith the other three options, I just think your imagery is not clear. The abstract icon is not doing anything for the mark.\n\nHope this helps some.\n\n"
    },
    {
      "time": "9 Nov 2006 — 5:48pm",
      "content": "Just to clarify,\n\n\\> #3 - Why would I buy flooring from a company whose mark is a bumpy floor? I want my floor to be nice and flat.\n\nThe Idea was about Imperial taking over the world as a metaphor, not that they would but “Imperial” as a great extent of territory. So the floor is covering the world.\n\n\\> The word Imperial has many connotations. It could be the British Empire, Roman Empire, Japanese Empire, &c. Maybe you could find out what Empire Imperial refers to and work off of that.\n\nI did my research and showed that to the client, there’s also some history in the Mexican flag and symbol that has to do with the Mexican Imperial (Imperio Mexicano) and the Mayan Imperium etc since he’s Mexican, but again he doesn’t want any kind of political connotations. It’s a tricky one but I think a pyramid could be related to an empire in general, so does territory.\n\n\\> the im ligature is very awkward.\n\nAgree with it when I was doing it, I had to try it and will work on it or just erase it.\n\nThanks All this is already helping a lot!\n\nKco\n\n"
    },
    {
      "time": "10 Nov 2006 — 12:32am",
      "content": "how about looking at really classy floors? maybe there are some patterns you could get inspiration from. I also thought of light reflecting on a shiny floor.\n\n"
    },
    {
      "time": "10 Nov 2006 — 7:30am",
      "content": "I like your 2c concept although maybe not such an extreme perspective, I also wonder whether a pair (or more) of footprints might be better and going in more than one direction, I know I'm being literal, and it might prove difficult to realise at logo scale.  \nQuick reactions to the others  \nIt might just be me but I see option 3 as a bit British, hints of Union Jack. I like the idea of 4 multi directions but the handrawn one looks like a falling tree wheras the others look like Christmas trees. 1b laughing sinister robot? 1c is better for me although I'm not sure your concept is clear in the icon.  \nFor the type treatment 1 is my preference, with the same reservations about the im, the secondary line looks a bit small for some sizes though.  \nTim\n\n"
    },
    {
      "time": "10 Nov 2006 — 10:37pm",
      "content": "Some thoughts on my ideas. Apparently haven't been successful at my attempts.\n\nThe client rejected any kind of cliché like using a carpet, a floor tile, a shield or a crown. So then I thought of the many logos I see every day and not many of them tell me right away what it is, its the icon or the color or the type treatment that lets me identify it as a brand. Then you may learn what the logo is trying to say. I never knew there was an arrow on the Fedex logo until I studied the brand.  \nSome examples:  \napple, bp, chase, cingular, city bank and one case study i just read on a logo created by Christopher Simmons for a company called \"Paradox Media\" were he took a very conceptual metaphor:  \n [http://www.gdusa.com/feature/4\\_03/paradox.jpg](http://web.archive.org/web/20130830192649/http:/www.gdusa.com/feature/4_03/paradox.jpg \"http://www.gdusa.com/feature/4\\_03/paradox.jpg\")\n\n\"The classic Paradox. Which came first, the chicken or the egg? This solution takes a multi layer approach, representing the world and conveying a sense of ongoing success. The enigmatic egg--the nascent talent--both confounds and compels the nurturing hen\" (words from his book \"Logo:Lab\")\n\nNot that this is the best logo in the world, but my point is that there's no techy graphics saying is a media company. I see a pyramid in a couple of my logos that represent an empire in a way and force. I see a world getting covered showing power again empire etc...\n\nDoes someone agree?  \nby the way please I replaced the image and removed the first draft type treatments as they were done quickly just to get the idea.\n\nThanks\n\nKco\n\n"
    },
    {
      "time": "11 Nov 2006 — 1:41am",
      "content": "\\>not many of them tell me right away what it is\n\nI think that is why I liked the footprint option, especially the tilted version, after you have read the text it becomes clear that these are the tracks left by walking on the solutions\\* – the product is illustrated by its absence. The pyramid concept doesn't give me that revelation, it is a pyramid but I cannot link that with flooring so I am left wondering if the mark has a deeper meaning or no meaning, as Lex says the handrawn version appears to be a tree but the company doesn't do hardwood flooring so that also leaves me wondering. I think the world domination might be too ambitious a concept to represent in an icon while still remaining usable as a logo.  \nYou are trying a literal approach to the logo which for my taste is better than ending up with a meaningless swoosh or pattern, on the other hand the nature of the product does lend itself to a pattern. I think the problem you are facing is that you are trying to include Imperial as well as flooring solution, as you say, you don't want to emphasise the Imperial part of the name maybe you should concentrate on what flooring solution means and leave the type to announce the Imperial part. I can't offer an answer but I do like the idea of showing something that isn't there.  \nTim\n\n\\*a term btw which has become so hugely overused in the UK that its use parodied in a satirical magazine Private Eye\n\n"
    },
    {
      "time": "11 Nov 2006 — 10:15am",
      "content": "Thanks all for keeping this going!\n\nHere are some variations:  \nTim  \n\\>I like your 2c concept\n\nI tried to fix this but seems that the mores steps I put, the more it looks like a show or dancing company. So I tried another direction putting the same right foot in  \nopposite directions representing coming to an end point.\n\nFeldhouse  \n\\>#1 is your best option...Right now I would think it would be a brick building industry, not flooring.\n\nI tried removing some of the line interruptions to make it less brick looking, it still shows arrows, but I liked the idea of the corners pointing different directions. #2A could also be a stack of tiles.\n\n#4 Is a direction that got discarded in the sketching process. It was a wordmark that replaced the \"A\" with two arrows pointing at each other . It also looks like a pyramid with a shining tip.\n\nUnfortunately no time to try new ideas.\n\nHope one of this works better. I still want to present at least three directions to the client and let him decide. So I'll keep refining them.\n\nThanks\n\nKco\n\n ![](http://web.archive.org/web/20130830192649im_/http:/typophile.com/files/IFS_variations_v1_3702.1.gif)\n\n"
    },
    {
      "time": "11 Nov 2006 — 6:20pm",
      "content": "I really like 4A/4B - I'd make the pyramid a little taller in 4B to better match what the 'A' would look like, but otherwise, I think it's your best concept so far.\n\n- Lex\n\n"
    },
    {
      "time": "13 Nov 2006 — 8:40am",
      "content": "I'm voting for the arrow tree. Nice an abstract, but still retains a bit of a literal vibe to it (the houseware industry, for better or worse, tends to use literal identities). (d'oh! Just read that the company doesn't do hardwood...as such, this mark doesn't work.)\n\nI like the footprint concept a lot, but I agree, it's going to be hard to pull off without it feeling like a dance studio or, perhaps worse, dirty floors. Perhaps a 'shoeless' foot print might work? Pitch the idea of 'floors so nice people go barefoot'? (and to echo my d'oh comment above, I think the footprints are actually more applicable to industrial/commercial flooring...so I think this mark has the most potential...perhaps play off the 'commercial' aspect and really go overboard with the footprints...use a dozen or more of them to emphasis 'long wearing' or 'heavy traffic' or the like)\n\nThe pyramid is likely a 'safe' route to go. Doesn't carry much baggage. Nice and abstract.\n\nThe 'mound', to me, looks like a warped floor. Probably a bad connotation.\n\nI like your last mark, but I see a TeePee more so than a Pyramid.\n\n"
    },
    {
      "time": "20 Nov 2006 — 11:26pm",
      "content": "Here I am again,\n\nThis is where I am at right now. I gave it a shot to all your suggestions, some were very hard to accomplish and just ended up looking messy. For example the bare foot idea that aluminum suggested. It was just too little to see the details when it got small. I ended up spending more time than desirable but there's a few that might work and from here I'll take one of each variations and apply it to some business cards.\n\nI tried to choose subtle colors as I think most of the design was emphasized on the word empire to make it friendlier. Like blue that is a relaxing and approachable color. I did try some other colors but lets see what your reaction is.\n\nyour comments are much appreciated,\n\nkco\n\n ![](http://web.archive.org/web/20130830192649im_/http:/typophile.com/files/IFS_color_a_6139.jpg)\n\n ![](http://web.archive.org/web/20130830192649im_/http:/typophile.com/files/IFS_color_b_3871.jpg)\n\n ![](http://web.archive.org/web/20130830192649im_/http:/typophile.com/files/IFS_color_c_5485.jpg)\n\n ![](http://web.archive.org/web/20130830192649im_/http:/typophile.com/files/IFS_color_d_4847.jpg)\n\n"
    },
    {
      "time": "22 Nov 2006 — 11:13am",
      "content": "Of the A: group, any of those marks are viable. I really like the type in 4.\n\nGroup B: I really like 3. It clearly says FLOORING so I don't think you need to be as worried about the dance-studio connotation as much as I had thought before.\n\nGroup C: I still see warped floors. :(\n\nGroup D: nice. Very simple. That could work quite well. Type-wise, I like 1, though maybe tighten up 'IMPERIAL' a tad. In fact, I'd say D-1 is my favorite out of all the options.\n\n"
    }
  ]
}
