{
  "id": "29412",
  "title": "French Style Fonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hey guys, I'm designing a flyer for a screening of the french film 'Mouchette' and I'm having trouble finding the right font. I am looking for something that is sort of classically french, but I am open to anything you guys might think appropriate. I just know that I don't have anything that I think will work.\n\nThanks.\n\n",
  "author": "bigcitykent",
  "time": "9 Nov 2006 — 2:01pm",
  "uid": "15339",
  "comments": [
    {
      "time": "9 Nov 2006 — 2:11pm",
      "content": "_guys_\n\nAnd of course, women with balls :-)\n\n"
    },
    {
      "time": "9 Nov 2006 — 2:16pm",
      "content": "what about [Peignot](http://web.archive.org/web/20150313163246/http:/en.wikipedia.org/wiki/Peignot)? Pretty french. There's also [Didot](http://web.archive.org/web/20150313163246/http:/http/www.myfonts.com/fonts/linotype/didot/) and an old typophile topic [here](http://web.archive.org/web/20150313163246/http:/typophile.com/node/20141). Also I vaguely remember somone talking about irregular hand-drawn all cap sans from old french movies which look cool but maybe someone else can help out  \n--N\n\n"
    },
    {
      "time": "9 Nov 2006 — 2:25pm",
      "content": "What's the film about?  \nWhat does the film look/feel like?  \nWho's supposed to see it?  \nWhat does \"mouchette\" mean, small fly?\n\nhhp\n\n"
    },
    {
      "time": "9 Nov 2006 — 2:37pm",
      "content": "1)  \nMouchette is a young teenager living in the tough country. Her mother is going to die, and her father does not take care of her. Mouchette does not manage to express her rebellion against the humiliations she undergoes. One night, in the wood, she meets Arsene. Arsene is the poacher of the village. He thinks he has just killed Mathieu, the rural policeman. He tries to use Mouchette to build an alibi.\n\n2)  \nI haven't seen the film yet, I really should before I design this flyer, but we just locked the film the other day. But its a black and white film by french director Robert Bresson. [http://imdb.com/title/tt0061996/](http://web.archive.org/web/20150313163246/http:/imdb.com/title/tt0061996/ \"http://imdb.com/title/tt0061996/\") should tell you more.\n\n3)  \nI am one of the programmers for a film series in Austin. We show classic films in 35mm on the UT campus. Basically just students and cinophiles come to the movies.\n\n4)  \nMouchette is a young teenager living in the tough country.\n\n"
    },
    {
      "time": "9 Nov 2006 — 2:50pm",
      "content": "Thinking too literally here. The movie isn't about French identity.\n\n"
    },
    {
      "time": "9 Nov 2006 — 3:14pm",
      "content": "Well, I'm not looking for a french calligraphy font, but I like Pignot and Didot, I think a font like one of those will be good, unfortunately I don't have them yet.\n\n"
    },
    {
      "time": "9 Nov 2006 — 3:28pm",
      "content": "[Bodoni](http://web.archive.org/web/20150313163246/http:/www.linotype.com/170/bodoni-family.html?PHPSESSID=25d0798c0486e799029e2289738189eb&gclid=CNCfk_-Lu4gCFSc4TAodaAZF2Q)'s not too far away, I'm pretty sure you'd have something like this. But check out [this](http://web.archive.org/web/20150313163246/http:/www.mastersofcinema.org/bresson/Posters/index.html) it might give you some good ideas\n\n"
    },
    {
      "time": "9 Nov 2006 — 3:36pm",
      "content": "Ah, yeah, Bodoni is nice.\n\n"
    },
    {
      "time": "9 Nov 2006 — 3:39pm",
      "content": "Carl - that's \\*so\\* bang on.\n\nWhy don't you try to chanel Mouchette's emotions rather than the accident of her nationality?\n\n"
    },
    {
      "time": "9 Nov 2006 — 3:51pm",
      "content": "\\*chanel very nice :)\n\n"
    },
    {
      "time": "9 Nov 2006 — 4:35pm",
      "content": "I haven't seen the movie yet, and rather than ask for emotionally confused and distraught fonts I thought I would ask about some frenchy ones.\n\n"
    },
    {
      "time": "9 Nov 2006 — 4:52pm",
      "content": "[This](http://web.archive.org/web/20150313163246/http:/www.mastersofcinema.org/bresson/Posters/Mouchette/Mouchette_24x33_1967.jpg) seems to be the film's original poster. Maybe you could try something like [PL Modern Heavy Condensed](http://web.archive.org/web/20150313163246/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=C.106309.0.0&attributes.sampleSize=48&sampleText=MOUCHETTE&sampleSize=48).\n\n- Lex\n\n"
    },
    {
      "time": "9 Nov 2006 — 5:08pm",
      "content": "Really nice match on that original poster. I had found that, but none of my fonts matched.\n\n"
    },
    {
      "time": "9 Nov 2006 — 5:10pm",
      "content": "but gee bodoni's close, especially Bodoni Poster Compressed\n\n"
    },
    {
      "time": "9 Nov 2006 — 5:41pm",
      "content": "I agree with Carl that one shouldn't be too literal. On the other hand, I'm sure he agrees with me that typefaces do have associations, and it <cite>is</cite> a French movie (and the character isn't French by \"accident\") so it's a bonus if the font has something French about it. All this means that the French angle should be just another factor, and not anything central. But since there are so many fonts out there, it is a nice way to narrow things down.\n\nConsidering the movie seems to be a dark but human tale, I think Peignot is too playful (although the youth angle might make it click) and Didot/Bodoni is too cold. Just mentioning two things from the top of my head: Beorcana (one of its superb dark weights) or ITC Mendoza.\n\nhhp\n\n"
    },
    {
      "time": "9 Nov 2006 — 8:01pm",
      "content": "Kent, one more time, without the smiley emoticon: Typophile is a mixed forum (note presence of Miss Tiffany and Pattyfab in the frequent poster sidebar), so the use of the masculine \"guys\" is not appropriate.\n\n"
    },
    {
      "time": "9 Nov 2006 — 8:41pm",
      "content": "These days you can call girls \"guys\" (in the plural only) - I do on occasion - and some of them actually seem to prefer it.\n\nhhp\n\n"
    },
    {
      "time": "10 Nov 2006 — 12:04am",
      "content": "Yeah, uh, I by no means meant to imply that only males should answer my request for help.\n\ndefinition #2 from dictionary.com . Usually, guys. Informal. persons of either sex; people: Could one of you guys help me with this?\n\nSorry if you got some misogynistic vibe from it.\n\n"
    },
    {
      "time": "10 Nov 2006 — 2:42am",
      "content": "[http://www.myfonts.com/fonts/linotype/antique-olive/](http://web.archive.org/web/20150313163246/http:/www.myfonts.com/fonts/linotype/antique-olive/ \"http://www.myfonts.com/fonts/linotype/antique-olive/\")\n\nNearly contemporary and French maybe Nord weight?\n\nTim\n\n"
    },
    {
      "time": "10 Nov 2006 — 3:10am",
      "content": "Mouchette was released in 1967 at the peak of the French New Wave. For that period, your best text face is Vendome, used for heads in all the hot paperbacks the French read at the time. If you want an earlier French look, FF Acanthus or Andrade from MyFonts are very authentic. If you want late 19th century, ITC Bodoni Twelve serves very well. Peignot, however, is too specific, Parisian, and touristy, so avoid that choice. And Antique Olive is appropriate to nothing here--ugh! The original poster shows a crude block display face, which can be found at any of the free font sites, but you still need a proper text face, and for that, think of what would go with the world of cinema-going at that time--Vendome.\n\n"
    },
    {
      "time": "10 Nov 2006 — 3:31am",
      "content": "Paris?\n\nThe film is set in rural France, it is a grim, miserable and ugly life for a 14 year old girl – it isn't fashionable.\n\nTim\n\n_{Edit: A little judicious editing has rendered some of this a non-sequitur}_\n\n"
    },
    {
      "time": "10 Nov 2006 — 6:33am",
      "content": "And of course you can't go wrong [here](http://web.archive.org/web/20150313163246/http:/www.typofonderie.com/)\n\n"
    },
    {
      "time": "10 Nov 2006 — 7:32am",
      "content": "\\>And Antique Olive is appropriate to nothing here—ugh!\n\nShooting back ;)  \nEver seen \"dark\" 60s movies from France?  \nI can imagine using Antique Nord for the poster, much more than the typical vibrant fonts people connect with France, especially when they are located on other side of the ocean.\n\n"
    },
    {
      "time": "10 Nov 2006 — 8:36am",
      "content": "I am not offended when someone uses \"guys,\" to refer to a group which might include me. It is a non-issue and I'd hope not worth debating. Maybe I'm not feminine enough. :^/\n\n"
    },
    {
      "time": "10 Nov 2006 — 11:18am",
      "content": "Kent, I realize the use of \"guys\" as gender-neutral is becoming common practice, with no misogynist intent. Tiffany, it's a feminist issue, not about femininity. The use of \"guys\" is no different than the usage of \"he\" as a generic personal pronoun (as in, \"when the typographer buys a new typeface, he should read the EULA\") or the use of the suffix \"-man\" in words like chairman. It's a mark of the creeping masculinization of social space.\n\n"
    },
    {
      "time": "10 Nov 2006 — 11:35am",
      "content": "When my girls were teens they would address their girl friends as 'hey you guys.'\n\nBut so far 'dude' is safe :)\n\n"
    },
    {
      "time": "10 Nov 2006 — 11:43am",
      "content": "Nick, you're hallucinating. Try calling a group of females \"girls\", or \"women\", or \"ladies\" (or \"maams\"?) in a casual environment and see what reactions you get... Stick to feeling offended by <cite>real</cite> attacks, preferably on middle-aged Anglo males. If you don't happen to be exposed to enough of that in your environment to get your fill, try traveling.\n\nhhp\n\n"
    },
    {
      "time": "10 Nov 2006 — 11:52am",
      "content": "Right, I meant feminist, Nick. Is it really masculinization or neutralization? There are far worse ways for people to refer to a group which could insult me and other women. I guess I just try not to let the small things bother me.\n\n"
    },
    {
      "time": "10 Nov 2006 — 12:30pm",
      "content": "Well, I'm just one of those old-fashioned middle-aged Anglo-male feminists.  \nIf you dolls (Kent, Hrant, Bill, Tiff, etc.) are cool with everybody being a guy, so be it.\n\n"
    },
    {
      "time": "10 Nov 2006 — 12:45pm",
      "content": "Regardless guys and dolls, thanks for all the constructive suggestions about fonts.\n\nI'm more than likely using atleast one of the ones suggested here.\n\n"
    },
    {
      "time": "11 Nov 2006 — 5:17am",
      "content": "Depending on how dramatic the film is (I actually own a DVD of it but haven't got round to watching it yet), how about Excoffon's Banco or Choc? Just a French guy's opinion (who had to import this French film from the US!)\n\n"
    },
    {
      "time": "12 Nov 2006 — 6:02am",
      "content": "Hi  \nI think you should try Vendome (see [http://www.myfonts.com/fonts/urw/vendome/](http://web.archive.org/web/20150313163246/http:/www.myfonts.com/fonts/urw/vendome/ \"http://www.myfonts.com/fonts/urw/vendome/\")) : it's typically French, released roughly at the same time, and with a lot of literary connotations which are quite appropriate for Bresson's movies — \"Mouchette\" is from a novel by Bernanos, after all.\n\n"
    },
    {
      "time": "12 Nov 2006 — 6:47am",
      "content": "BTW, if you (ever) need a texty companion to Vendome, try Meridien.\n\nhhp\n\n"
    }
  ]
}
