{
  "id": "29435",
  "title": "will the serif ever die out in the future?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "why will it/ won't it?\n\n",
  "author": "missgiggles",
  "time": "11 Nov 2006 — 6:53am",
  "uid": "14600",
  "comments": [
    {
      "time": "11 Nov 2006 — 7:13am",
      "content": "I honestly can't think of a single reason why it would or should..\n\n"
    },
    {
      "time": "11 Nov 2006 — 7:17am",
      "content": "I agree. It won't, at least not in our lifetime.\n\nPhilosphically, I would think that use of the Roman alphabet will inevitably eventually die out, and be replaced with some other means of communication. This may take hundreds or thousands of more years, though.\n\n"
    },
    {
      "time": "11 Nov 2006 — 7:28am",
      "content": "Only organisms die out. Concepts just go dormant.\n\nhhp\n\n"
    },
    {
      "time": "11 Nov 2006 — 7:50am",
      "content": "We don't know exactly why, but for books and long magazine articles, the eye rebels at endless ribbons of sans serif type...it wants the contrasts and kinks of serif fonts, the more complex the better actually...a paradox, perhaps, but well established by many studies and, of course, our own personal experience reading. Remember the recent bio of Paul Renner set not in his creation Futura but in Celeste, and the better for it?\n\nPlus, how many bases are there for readable sans? All the new entrants derive from either Syntax, Gill, or Trade Gothic whereas serifs can derive from many more models with much more leeway for oddities to delight the eye. If anything's going to fade, it's the sans.\n\n"
    },
    {
      "time": "11 Nov 2006 — 8:42am",
      "content": "I'll second Hrant with this quote I've just heard from Play Classical UK :  \n\"Only paper flowers are afraid of the rain.\"\n\n"
    },
    {
      "time": "11 Nov 2006 — 8:56am",
      "content": "I have a somewhat crazy theory of why serifs are better for readability: it's because the perceived spacing between letters stays similar at different scales. For readability (as opposed to legibility), the importance of the appearance at different scales comes from the imaging of a fixation point (bouma if you will) onto different areas of the retina, especially the fovea and parafovea.\n\nIn sans serif type, the gap between two letters becomes larger in direct proportion to the scale. If it's .5mm at 12pt, it will be 3mm at 72pt. But for type with serifs, the situation is different. At 12pt, the eye sees primarily the space between the stems, say .5mm again. But as the scale goes up, the eye is drawn more to the gap between the ends of the serifs, which is much smaller.\n\nProving this theory right or wrong is not an easy task, but if it does hold up, it would strongly suggest that serifs help readability at the level of deep visual processes, and are not just an quaint artifact that should be abandoned in modern times.\n\nWouldn't it be shocking if high-tech research on readability were to determine that the most optimum letterforms are essentially those of [Nicholas Jenson](http://web.archive.org/web/20130620163014/http:/typophile.com/wiki/Nicholas%20Jenson) from over 500 years ago?\n\n"
    },
    {
      "time": "11 Nov 2006 — 9:39am",
      "content": "\\> it’s because the perceived spacing between letters stays similar at different scales.\n\nInteresting. But I don't get why consistency across sizes would be important. When we get immersed into a given text it's at one size - in fact most text we read immersively is about the same size.\n\n\\> Wouldn’t it be shocking if high-tech research on readability were  \n\\> to determine that the most optimum letterforms are essentially  \n\\> those of Nicholas Jenson from over 500 years ago?\n\nIt wouldn't be shocking to discover they're the most readable of what's already been designed. But considering how little progress we've made it's very unlikely to be true of what's possible in the future.\n\nhhp\n\n"
    },
    {
      "time": "11 Nov 2006 — 9:59am",
      "content": "Sweet; salty. People like variety on the menu.\n\n"
    },
    {
      "time": "11 Nov 2006 — 8:29pm",
      "content": "I'll second Raph's comment. I've thought about this many times and raph's theory is one of the most intriguing explanations I have read. Maybe we can consider the eye to be like a flying scanner which has the physiological ability to \"lock-on\" to objects - even moving objects. The serifs could subtly prevent (or reduce occurances of) the eye targeting system from slipping out of the gaps between the characters.\n\n"
    },
    {
      "time": "11 Nov 2006 — 10:26pm",
      "content": "\"We don’t know exactly why, but for books and long magazine articles, the eye rebels at endless ribbons of sans serif type\"\n\nJohn, we don't know it at all. Go find the research that proves this. It's just the latest gobbledygook to explain preferences.\n\n\"All the new entrants derive from either Syntax, Gill, or Trade Gothic whereas serifs can derive from many more models with much more leeway for oddities to delight the eye.\"\n\n?!?! The nicest way I can respond to this is to say it's simplistic. I'm sorry you imagine the history of type design to be so impoverished.\n\nCiting Burke's use of a serif font for a book about Renner ignores the fact that Celeste is by Burke, and that Renner never fully realized a serifed book face.\n\n"
    },
    {
      "time": "12 Nov 2006 — 7:44am",
      "content": "Carl, if you know of any new sans serifs intended for editorial use, not just display or novelty, that do \\*not\\* derive from Syntax, Gill Sans, or Trade Gothic, I would be very interested in seeing them. For a while the market was flooded with copycat Syntax-derived faces; now the pendulum has swung to Gill-derived. I suppose the next phase will be to revisit Trade Gothic, especially plugging in oldstyle figures, which now seem to be offered that way only by FF Bau. I would love to see any new text-use sans-serif that breaks out of this tight three-model box.\n\nAs for studies on sans vs serif for reading, I remember typesetting, in the annual journal of my client the National Center for Learning Disabilities, articles that surveyed such studies going back 30 years, so without being a reading specialist as they were, I know it's all out there. But the simplest answer is given by the marketplace: how many books, or magazines with long articles, are set in sans-serifs? Isn't it curious that a biography of its designer was not set in Futura?\n\n"
    },
    {
      "time": "12 Nov 2006 — 7:57am",
      "content": "There are many sans fonts that are (sufficiently) original.  \nTwo that spring to mind are Beorcana and Legato.\n\nI agree that a serif is nominally better for long text, but:\n\n\\> I know it’s all out there.\n\nNo, virtually all studies have been flawed.\n\n\\> the simplest answer is given by the marketplace\n\nNot the simplest, the most simplistic.\n\n\\> Isn’t it curious that a biography of its designer was not set in Futura?\n\nNot really. A book isn't typeset by humanity (certainly not by humanity's subconscious), it's typeset by a person, who necessarily has his personal views on the matter, and not necessarily good ones.\n\nhhp\n\n"
    },
    {
      "time": "12 Nov 2006 — 8:53am",
      "content": "_Isn’t it curious that a biography of its designer was not set in Futura?_\n\nwhat's worse is the Goudy biography set in Bodoni. Ick!\n\n"
    },
    {
      "time": "12 Nov 2006 — 8:55am",
      "content": "John,\n\nI can see that you have decided how you will see any typeface set before you, so I doubt I can convince you. However....\n\nGill and Syntax are both part of the same category. There are a lot of other new types that fit that category, and a lot that don't. Saying that various types derive from one or the other is ignorant of how typefaces are developed. Syntax is partially derived from Gill, but also derived from Garamond. Gill was partially derived from other faces not in the Humanist sans category. The categories themselves aren't that useful, as too many faces lie on the margins. New categories have to be invented to house them (as in music).\n\nHave you not noticed a new category of sans proliferating lately? It's not specifically \"derived\" from any of your three. It's a new category, and some of the entries are useful for text, some not. Try to guess what I mean.\n\nThen there's the category Frutiger invented with his eponymous design. It's related to Gill and Syntax but clearly different. And it's derived from a lot more than a single previous typeface.\n\nOh that reminds me, there are a bunch of new Geometric sans designs (also not one of your three) that are being used for editorial matter....\n\nJohn I fear you are taking things too much at face value. If you swallow whole reading studies done by groups that completely ignore all typographic factors in preparing their test materials, then you can conveniently believe the answers are all out there. They aren't; far from it. Don't confuse the result with the cause.\n\nI'm not curious that a bio of Renner isn't set in Futura; book typographers generally know better than that. When the book typographer is also a type designer there's more to the picture.\n\nI have to go back to your earlier comment: do you really think, at this juncture, the Sans is going to fade before the Serif?\n\n"
    },
    {
      "time": "12 Nov 2006 — 9:44am",
      "content": "It's not at all strange to set a book that includes showings of Futura in a face other than Futura. In fact, it would be strange to use Futura, because that would muddle the distinction between subject (illustrative specimens) and text.\n\n"
    },
    {
      "time": "12 Nov 2006 — 11:16am",
      "content": "_if you know of any new sans serifs intended for editorial use, not just display or novelty, that do \\*not\\* derive from Syntax, Gill Sans, or Trade Gothic, I would be very interested in seeing them_\n\nI think Carl covered this pretty well. As I see it, there tends to be more of a shift to explorations of the geometric sans as opposed to the humanist sans. I second the influence of Frutiger.\n\nAnd bringing the original thread question back...nope. The serif will never die out. That is until mankind discovers how to use mental telepathy, and that's when written language as we know it will die. But, we'll probably figure out a way to destroy each other long before either of those happens.\n\n"
    },
    {
      "time": "12 Nov 2006 — 2:49pm",
      "content": "Oh, nothing is in danger of fading--all typography exploded after Postscript like a Big Bang, but my designer friends and I inhabit this brave new world as type consumers, not type designers, and we have our own perceptions--perceptions with a shopping logic. For us, if new face A looks too much like classic B we already own and use, we don't buy. For us, typography breaks down into distinct looks which may have little to do with historical and technical categories. We are not being \"ignorant\" when we prefer our own shopping logic.\n\nWhen you use Syntax, Gill, and Trade Gothic regularly, you become acutely conscious of how many NEW issues orbit around each look without breaking free. Of course, I'm aware of exceptions because I'm testing them out myself. My current fav is Emigre's Cholla, which seems to be working in long texts in a way that FF DIN doesn't always. Since I own so many sans, my buying standard has drifted higher. For me the standard is Avenir, at once a familiar yet a totally fresh fusion of looks, and totally right everywhere from its first use. Let a thousand sans bloom, as long as I don't have to sniff them all!\n\n"
    },
    {
      "time": "12 Nov 2006 — 3:47pm",
      "content": "There is certainly room in the type market for those with conservative taste. But one can't see what advantages one design offers over others, however similar, until one actually uses them both. For instance, Univers and Helvetica seem nearly identical to some. If you have Helvetica, is there a point to having Univers? I think Univers is better, because it's more subtly drawn, has more contrast, is spaced better and successfully updates the Grotesk genre of types for the 20th century. The overall effect is actually quite different, and Univers works at more sizes than Helvetica. If I had to choose one family it would be Univers, but I wouldn't know that from a single online GIF file. However that leads me back to my point: it's 2006. I don't find as many uses for Univers as I used to in the 80's and 90's. Many designers want to take advantage not only of [types that do more](http://web.archive.org/web/20130620163014/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontpackage&displayfontid=C.113530.0.0) but also [types that are fresher.](http://web.archive.org/web/20130620163014/http:/typographi.com/001045.php)\n\n"
    },
    {
      "time": "13 Nov 2006 — 8:18am",
      "content": "\"why will it/ won’t it?\n\nThe only pressure on serifs is applied by low resolution. Otherwise, I think they are safe.\n\n"
    },
    {
      "time": "13 Nov 2006 — 10:50am",
      "content": "\"There is certainly room in the type market for those with conservative taste. \"\n\nWe're not conservative, thank you, just very picky and tough to please...your type, our wallets.\n\n"
    },
    {
      "time": "13 Nov 2006 — 11:25am",
      "content": "This could turn into another thread about who should pay for new fonts. Instead of that, could Tiff look up some of the existing threads on that topic?\n\nI realize, John, that you work for nonprofits, but in general, I think it should be the clients' wallets. By making budget allowances for new type, designers can help improve the general perception of the value of type, especially if designers appreciate good type as you seem to.\n\n"
    },
    {
      "time": "14 Nov 2006 — 5:55am",
      "content": "I don't even know what we're talking about anymore.\n\n"
    },
    {
      "time": "14 Nov 2006 — 7:55am",
      "content": "Best flavor of toothpick?\n\n"
    },
    {
      "time": "14 Nov 2006 — 10:00am",
      "content": "What did you want me to look for Carl?\n\n"
    },
    {
      "time": "14 Nov 2006 — 10:50am",
      "content": "Nevermind, Tiff, I was hoping to point John to some of the lengthy threads about who should pay for fonts. That may be a dead horse, and one we shouldn't kick on this thread anyway.\n\n"
    },
    {
      "time": "14 Nov 2006 — 3:33pm",
      "content": "Hard drives get bigger. Computers and connections get faster. Databases get more relational. Data trends towards openness and ubiquity. The world's media libraries grow vaster yet faster to cull. Nothing is getting forgotten. Sans aren't going anywhere. Neither are serifs. No ideas can die, they just move in and out of fashion. Until the next major fall of civilization, there will just be more and more and more.\n\n[C.](http://web.archive.org/web/20130620163014/http:/www.chozcunningham.com/)  \n [!ETF](http://web.archive.org/web/20130620163014/http:/www.exclamchine.com/)  \n [.~?](http://web.archive.org/web/20130620163014/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "16 Nov 2006 — 11:42pm",
      "content": "From Carl: I think it should be the clients’ wallets.\n\nIf only! Actually, Carl, I'm getting pretty cagey in my old age, especially with book publishers who profess to be typophiles: as soon as they say that, I include a new typeface from my hit list among their job font choices--fortunately, one can set relevant samples on-screen and then copy a screen snap to the client. If they're nuts about Galliard (they all own shelves of Bruce Campbell's Galliard-infested Library of America titles), I point out that oldstyle figures are now available, in an OpenType ITC family package for only $315 that they can also use in their systems. Even for nonprofits, that's not even a box of pencils. Nobody's bit yet, but hope springs eternal! I've read our threads about who should pay. As Dorothy Parker said: you can lead a ho to culture, but you can't make him buy type!\n\n"
    },
    {
      "time": "17 Nov 2006 — 1:55am",
      "content": "Serif glyphs are more recognizable than sans glyphs (especially geometric sans) because they provide the viewer/reader with more visual clues. Eg d, b and p are examples of that.\n\nDon't forget that the human brain is programmed to recognize shapes in any orientation. That's what's evolution is for… recognizing a dangerous snake whether it's hanging from a branch or slithering on the ground does make a difference ; ).\n\nIMO this whole existing (western?) tradition of using (lowercase!) sans for teaching kids to read is totally of the mark. It has even been suggested that starting with all caps would improve learning to read, because the glyphs are far more recognizabele than lc ones.\n\nAnother important feature is that serifs help the eye to follow the stream of letterforms. Some sans typefaces emulate this by a specific orientation of the contrast, eg FF Balance.\n\nAnd I think that the point made before, that serifs help to define the shape between glyphs, is really important too. And also one that hasn't been researched enough…\n\n"
    },
    {
      "time": "17 Nov 2006 — 2:19am",
      "content": "Bloody hell mondo there you go again.\n\nMuzz\n\n"
    },
    {
      "time": "17 Nov 2006 — 2:20am",
      "content": "And miss giggles I really think you get these threads cracking by pretending to be silly but you are actually clever.\n\nMuzz\n\n"
    },
    {
      "time": "17 Nov 2006 — 6:19am",
      "content": "\\> That’s what’s evolution is for…\n\nWell said.\n\nBut:  \n1) The reason to teach lc first/primarily is simple: it's 95% of text.  \n2) We don't \"follow\" letterforms, serifs or no.\n\nhhp\n\n"
    },
    {
      "time": "17 Nov 2006 — 8:32am",
      "content": "\\>\\>It wouldn’t be shocking to discover they’re the most readable of what’s already been designed.\n\n'twould be a lot more shocking to discover they're the most readable of what hasn't yet been designed.\n\ngeo.\n\n"
    },
    {
      "time": "17 Nov 2006 — 10:26am",
      "content": "You can read faster with serifs too cuz they're like little feet to carry your eyes along!! Its a fact! Sans doesn't have the feet.\n\n"
    },
    {
      "time": "17 Nov 2006 — 10:31am",
      "content": "Hence \"running text\". :)\n\n- Lex\n\n"
    },
    {
      "time": "17 Nov 2006 — 12:12pm",
      "content": "Silly, it's train tracks! Everybody knows that you're not reading  \nimmersively unless you hear CHOOOOOO-CHOOOOOO in your  \nhead at each linebreak.\n\nhhp\n\n"
    },
    {
      "time": "17 Nov 2006 — 1:48pm",
      "content": "Huh. That must be why it's so hard to remember what I read with serif fonts. You can't slow down between stations.\n\n"
    },
    {
      "time": "17 Nov 2006 — 7:05pm",
      "content": "Serifs die when <cite>Sus Domestica</cite> take to the air.\n\n\\><cite>For instance, Univers and Helvetica seem nearly identical to some. If you have Helvetica, is there a point to having Univers? I think Univers is better, because it’s more subtly drawn, has more contrast, is spaced better and successfully updates the Grotesk genre of types for the 20th century. The overall effect is actually quite different, and Univers works at more sizes than Helvetica.</cite>\n\nThanks! I was actually going to post this question. Plus, the condensed versions of Univers are awesome.\n\n"
    },
    {
      "time": "17 Nov 2006 — 11:46pm",
      "content": "\"Sans Serif\" won't die as long as it remains petting the never-changing eye.  \nLet a thousand Sans and [Flowers](http://web.archive.org/web/20130620163014/http:/www.crauswords.com/flowers/WFlowers.htm) bloom, I will sniff them all!\n\n"
    }
  ]
}
