{
  "id": "29434",
  "title": "which is easily read by dyslexic people: serif or san serif",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "what evidence is there? has it been researched before?\n\n",
  "author": "missgiggles",
  "time": "11 Nov 2006 — 6:51am",
  "uid": "14600",
  "comments": [
    {
      "time": "11 Nov 2006 — 7:15am",
      "content": "Evidence: as usual in matters typographic, nothing good. So we're left with thought, and it seems to indicate that serifs help because they provide more info, including directional info (think of the tops of \"b\" and \"d\" for example).\n\nhhp\n\n"
    },
    {
      "time": "11 Nov 2006 — 9:03am",
      "content": "You might get something from [http://www.readregular.com/english/intro.html](http://web.archive.org/web/20131019122940/http:/www.readregular.com/english/intro.html \"http://www.readregular.com/english/intro.html\") .  \nAlso, the HHRC might be able to help too. [http://www.hhrc.rca.ac.uk/programmes/ra/2003/natascha.html](http://web.archive.org/web/20131019122940/http:/www.hhrc.rca.ac.uk/programmes/ra/2003/natascha.html \"http://www.hhrc.rca.ac.uk/programmes/ra/2003/natascha.html\")\n\n"
    },
    {
      "time": "11 Nov 2006 — 9:22am",
      "content": "You might, but then... The thing to remember about dyslexia is it can't be \"solved\" by making a new typeface or by using a specific typeface in one place. I certainly have sympathy for people with extreme dyslexia, but you can't re-make the world, with all its magazines, fine print, illuminated signs, motion graphics, airport and city navigations, in a way that resolves the difficulty dyslexics have in reading.\n\nWhich is more useful to a dyslexic: a typeface used in 2 places, or new methods for reading they can apply everywhere?\n\n"
    },
    {
      "time": "11 Nov 2006 — 9:35am",
      "content": "\\> you can’t re-make the world, with all its magazines\n\nWhat about e-Ink? :-)\n\n\\> new methods for reading they can apply everywhere?\n\n?  \nWhat do you have in mind?\n\nhhp\n\n"
    },
    {
      "time": "11 Nov 2006 — 9:44am",
      "content": "It's probably a mistake to draw a line between them and us.  \nAll one can say is that there are varying kinds of reading ability, and varying degrees.\n\nGo to your local library or bookstore and look in the large print section, and see what kinds of typefaces are being used. This shows what people who have some difficulty reading prefer. Of course, being short-sighted and being dyslexic are different, but it can be argued that large print helps both -- in particular because large print is also used for another group of people who don't read fluently: children learning.\n\nFor young reader books, the practice changed from serif to sans serif during the second half of the 20th century. Has this had any effect on overall literacy? Probably not.\n\nAt the RNIB website, they don't have a preference between sans or serif.\n\n"
    },
    {
      "time": "11 Nov 2006 — 10:09am",
      "content": "For years I designed for the National Center for Learning Disabilities, and their counsel was: serif, large point size, and draw a vertical line between medium-wide columns (2-col format on 8.5x11\" pages). Challenged eyes don't like sans for long any more than other eyes.\n\n"
    },
    {
      "time": "11 Nov 2006 — 12:02pm",
      "content": "opps\n\n"
    },
    {
      "time": "11 Nov 2006 — 1:17pm",
      "content": "\\> It’s probably a mistake to draw a line between them and us.\n\nIn a way yes, but it's also probably a mistake to lump different groups together! The problems that dyslexics have are pretty specific, so it's different than people who simply have blurry vision, or children who have yet to move from deliberative to immersive reading.\n\n\\> Has this had any effect on overall literacy?\n\nEverything has an effect, all of the time, on everybody.\n\nhhp\n\n"
    },
    {
      "time": "11 Nov 2006 — 1:32pm",
      "content": "I was refering to the rate of literacy.  \nIn other words, people who learned with sans aren't any less or more literate than those who learned with serif -- if indeed there were any way to make a measurable connection between sans/serif and the literacy rate.\n\n"
    },
    {
      "time": "11 Nov 2006 — 1:45pm",
      "content": "Just because something hasn't been counted, or even if it can't be counted, doesn't mean it doesn't count. There's no reason to believe that \"people who learned with sans aren’t any less or more literate than those who learned with serif\", and there is in fact reason to believe the opposite. We can argue about which is better, sans or serif, but they could never be equally good/bad at everything, or really anything.\n\nEverything Matters™\n\nhhp\n\n"
    },
    {
      "time": "11 Nov 2006 — 8:21pm",
      "content": "Keep in mind that dyslexia is a term that encompasses multiple learning/reading disorders, so what improves readability for one dyslexic individual may be of no use, or even baneful, to another.\n\n"
    },
    {
      "time": "11 Nov 2006 — 10:34pm",
      "content": "\"What do you have in mind?\"\n\nI'm completely ignorant on the topic, but I imagine someone is focusing on aiding dyslexics to improve their reading performance. If nobody is studying this, yet there are untrained students developing special typefaces for dyslexics, then something's not working.\n\n\"This shows what people who have some difficulty reading prefer.\"\n\nWe've been over this already. This shows what designers or publishers **think** children or the elderly prefer. The jury's still out on what they actually prefer. And their stated preference isn't the same as what they read most easily.\n\n"
    },
    {
      "time": "11 Nov 2006 — 11:05pm",
      "content": "\\> something’s not working.\n\nNo sh\\*t sherlock. :-)\n\nhhp\n\n"
    },
    {
      "time": "12 Nov 2006 — 12:01am",
      "content": "_The jury’s still out on what they actually prefer._\n\nWell, let me rephrase \"readers' preference\": The type in large-print books shows what works in the marketplace, as with any publishing genre. I would imagine that publishers conduct focus groups from time to time, try out a sans serif, get negative feedback, and stick with the old workhorses.\n\n"
    },
    {
      "time": "12 Nov 2006 — 12:10am",
      "content": "[Double post]\n\n"
    },
    {
      "time": "12 Nov 2006 — 12:10am",
      "content": "_We can argue about which is better, sans or serif, but they could never be equally good/bad at everything, or really anything._\n\nI would say that in this case, as it's impossible to measure, the difference is meaningless.  \nAnd if it were possible to measure, I would guess that the differenece would be statistically negligible.\n\nBut I'm strangely attracted to your chaos-theory existentialism, Mr Everything Matters.\n\n"
    },
    {
      "time": "12 Nov 2006 — 12:10am",
      "content": "\\> <cite>I’m completely ignorant on the topic.</cite>\n\n'nuff said.\n\n"
    },
    {
      "time": "12 Nov 2006 — 6:42am",
      "content": "\\> .\n\nThink -\\> Type\n\n\\> as it’s impossible to measure, the difference is meaningless.\n\nNo, no, it wouldn't be impossible to measure because the difference is too small, but because not everything can be measured, or at least not everything will be.\n\nIt's ironic how apparently empiricism is good or bad depending on how well it guards the shores of Shinnistan.\n\nhhp\n\n"
    },
    {
      "time": "12 Nov 2006 — 7:09am",
      "content": "Note on large print books. These were developed to help adults with vision problems. Some people with limited vision can't get the visual information except from large print. This is a different matter from dyslexia, which is a matter of how visual information is processed.\n\n\\>shores of Shinnistan\n\n--located in a galaxy far, far away from Planethrant :)\n\n"
    },
    {
      "time": "12 Nov 2006 — 7:16am",
      "content": "I think it's in another dimension.\n\nhhp\n\n"
    },
    {
      "time": "12 Nov 2006 — 12:34pm",
      "content": "\"‘nuff said.\"\n\nMr./Mrs./Ms. T. Bones, definitely not. I was hoping someone here might chime in with information about what is being done to help dyslexics on the behavioral/practical side. Got anything?\n\n"
    },
    {
      "time": "12 Nov 2006 — 12:45pm",
      "content": "Mr. Carl Crossgrove,  \nBehavioural? In what context?  \nFor what it's worth, I posted links to those who are/were researching the topic in question. If your're really desperate for information perhaps you could email them and find out more about how they are sourcing and verifying their research.\n\n"
    },
    {
      "time": "12 Nov 2006 — 1:11pm",
      "content": "The Read Regular material is what I'm talking about. I'm too busy to look up dyslexia psychology today but I'm imagining, because Typophile is global, that someone would be curious enough to find out what else **besides this project** people are doing. By behavioral I mean: what is being done to assist retrain, adapt or otherwise interactively aid dyslexics in reading what's all around them. It seems to me that would be more helpful to them, than trying to have everything in the visual environment translated into Read Regular. That wouldn't help anyway. The a looks like an o, negating the entire thesis of the project.\n\n"
    },
    {
      "time": "12 Nov 2006 — 1:36pm",
      "content": "_it wouldn’t be impossible to measure because the difference is too small, but because not everything can be measured, or at least not everything will be._\n\nThat's what I said: It's impossible to measure whether learning to read with serif faces in the first half of the 20th century, or learning to read with sans serifs in the second half, would have had made any difference to the rate of literacy.\n\n"
    },
    {
      "time": "12 Nov 2006 — 1:44pm",
      "content": "I'm unsure whether or not Ms. Frensch's work is supported by hard evidence. I'm equally unsure if any fellow typophiles might know the answers to what is a very grey area. Particularly as the 'experts' are seemingly unable to agree upon, \"what it [dyslexia] is or how to treat it.\"\n\n[http://news.bbc.co.uk/1/hi/education/4205932.stm](http://web.archive.org/web/20131019122940/http:/news.bbc.co.uk/1/hi/education/4205932.stm \"http://news.bbc.co.uk/1/hi/education/4205932.stm\")\n\nNot that I see the BBC as providers of the absolute truth!\n\n"
    },
    {
      "time": "12 Nov 2006 — 1:52pm",
      "content": "\\>if any fellow typophiles might know the answers to what is a very grey area\n\nThis issue has come up regularly on Typophile. None of the claims to fonts that are better for those with reading difficulties have stood up to even mild scrutiny.\n\n"
    },
    {
      "time": "12 Nov 2006 — 2:09pm",
      "content": "If only English were more like [Italian.](http://web.archive.org/web/20131019122940/http:/www.4therapy.com/consumer/conditions/article/6487/500/Dyslexia+Poses+Bigger+Challenge+For+English+Speakers)\n\nThe assumption seems to be that English spelling and grammar is too tricky, but alphabetic distribution in Italian might also be a factor.\n\nLuc de Groot has figured out the most common character pairs for different languages. It would be interesting to compare English and Italian in that light, with regard to reading difficulty.\n\n"
    },
    {
      "time": "12 Nov 2006 — 4:02pm",
      "content": "\\> That’s what I said\n\nNo it's not - and you know it.\n\n\\> Luc de Groot has figured out the most common  \n\\> character pairs for different languages.\n\nThat's a mischaracterization of the situation.\n\nhhp\n\n"
    },
    {
      "time": "12 Nov 2006 — 6:37pm",
      "content": "_No it’s not - and you know it._\n\nI thought we were discussing the rate of literacy, i.e. what percentage of the population is considered literate.\n\n\\*\\*\\*\n\n_That’s a mischaracterization of the situation_\n\nWell, that's what he demonstrated in a talk in Montreal last month that I attended, so perhpas he was mischaracterizing himself? (As usual, you seem to know more about people than they do themselves, even when you weren't even there.)\n\nLuc has been looking into removing automatically generated kern pairs from font tables, where the characters don't appear in the same language, and has analyzed the frequency of character combinations in different languages, with software that trolls texts -- he takes a variety from newspapers, magazines and books -- to record that information. This is a subject which you, he, and I discussed (if my memory serves me) at the Boston AtypI conference many years ago, and he has followed through.\n\n"
    },
    {
      "time": "12 Nov 2006 — 7:34pm",
      "content": "\\> I thought we were discussing the rate of literacy\n\nI don't believe you.\n\n\\> perhpas he was mischaracterizing himself?\n\nPossibly, but my bets are on the skew coming from your end - sorry.\n\nAnd yes, it was in Boston (in 1999). Live and learn I guess.\n\nAnyway, here's something from my end:  \n [http://typophile.com/node/5097](http://web.archive.org/web/20131019122940/http:/typophile.com/node/5097 \"http://typophile.com/node/5097\") \\_  \n [http://typophile.com/node/5106](http://web.archive.org/web/20131019122940/http:/typophile.com/node/5106 \"http://typophile.com/node/5106\") \\_  \nNot remotely as significant as Luc[as]'s efforts, but still better than navel-gazing.\n\nhhp\n\n"
    },
    {
      "time": "12 Nov 2006 — 8:01pm",
      "content": "_I don’t believe you._\n\nHrant, all you have to do is read the thread again.  \nI said \"I was refering to the rate of literacy. In other words ,,,\"  \nYou then quoted my \"other words\" and debated them, \"No, no,\"  \nWhy do I have to engage in this nit-picking just to answer your accusations that I am lying and deceiving?\n\n_Possibly, but my bets are on the skew coming from your end - sorry._\n\nNot exactly an apology.  \nHow on Earth could \"Luc de Groot has figured out the most common character pairs for different languages\" be considered skewing? What in the Hrantiverse did you think he was doing?\n\n"
    },
    {
      "time": "12 Nov 2006 — 8:02pm",
      "content": "Wow: 2 parallel threads. I had thought we were discussing reading abilities of dyslexics.\n\n\"This is a different matter from dyslexia\": Thank you William, this is an important point ignored in the Read Regular project. Issues such as \"infant\" characters, mirroring, and a host of hopeful hyperbole are conflated in the thesis to support the results, which I find simply fail to satisfy basic criteria for type for even general readers. Since the [also presumed] advantage of infant characters is based on a developmental stage in learning to read, and dyslexics might just as easily not be at that developmental stage, it's of questionable use there. From the website:\n\n\"The characters have been stripped down from all unnecessary details –such as a two storey a and a two eyed g.\"\n\nBut what about those helpful feet on the bottom that carry the eye along like a wheelbarrow? ; )\n\n"
    },
    {
      "time": "12 Nov 2006 — 8:17pm",
      "content": "\\> all you have to do is read the thread again.\n\nI was thinking the same thing about you! But re-reading stuff  \nsomebody wrote still won't reveal what's really in his head.\n\n\\> Why do I have to engage in this nit-picking\n\nI think I know why.\n\nhhp\n\n"
    },
    {
      "time": "12 Nov 2006 — 10:25pm",
      "content": "Well, I guess if you want to stay at the top of the posting board it's easier to engage phantoms than deal with what people actually say.\n\n"
    },
    {
      "time": "13 Nov 2006 — 12:00pm",
      "content": "I'm a bit late to this party, but I just wanted to interject that I have a friend who is a designer and dyslexic, and according to him he reads almost entirely by wordshapes - he has a really difficult time reading all-caps, for instance. To me, this would seem to support the idea that serifs would be better, since they theoretically assist in linking letterforms into wordshapes.\n\n"
    },
    {
      "time": "13 Nov 2006 — 12:31pm",
      "content": "You could argue the opposite as well, thanks to the absence of real data.... And in fact, lots of people do. Now, you could actually get some useful data by testing your friend to see if he has a preference. Preparing your test materials is the crucial part. I have suggestions, if you're interested.\n\nI think everyone has more difficulty reading all caps. We all use word shapes to some degree.\n\nI hope your designer/dyslexic friend has someone to help with proofreading? ;)\n\n"
    },
    {
      "time": "13 Nov 2006 — 1:10pm",
      "content": "\\>he has a really difficult time reading all-caps\n\nNow I'm worried that maybe I'm dyslexic?\n\n"
    },
    {
      "time": "13 Nov 2006 — 1:21pm",
      "content": "I'd say that a graphic designer would make a poor candidate for such a test, actually, as he would be much more aware of the font than a layman.\n\nThere certainly is an absence of real data; all I know of is anecdotal evidence. It should be noted, too, that just because this one guy picks up on wordshapes doesn't mean that's how all dyslexic people operate.\n\nAs an aside, I've noticed that my dyslexic friends seem to be better at three-dimensional spatial tasks than two-dimensional. Again, purely anecdotal. Might the two ideas be interrelated though?\n\n"
    },
    {
      "time": "13 Nov 2006 — 1:32pm",
      "content": "\"Go to your local library or bookstore and look in the large print section, and see what kinds of typefaces are being used. This shows what people who have some difficulty reading prefer.\"\n\nI know it's been said, but I think it's worth repeating...what is in widespread use is simply indicative of what's in widespread use...not necessarily what people PREFER. We live in a society where user preferences are not necessarily a sign of market penetration.\n\nI think the only viable text-research I've heard was the statement 'we read best what we read most' implying that as humans, we're comfortable with what we're most familiar with. That rings true for pretty much anything...not just type design.\n\nOf course, the problem is that everyone is different, so it somewhat prevents us from making viable broad generalizations.\n\n"
    },
    {
      "time": "13 Nov 2006 — 1:48pm",
      "content": "\\> \"large print section ... shows what people who have some difficulty reading prefer.\"\n\n\\>I know it’s been said, but I think it’s worth repeating\n\nI don't, because it's not correct. As I noted above, large print editions are for people who have difficulty seeing, not difficulty reading. Vision impairment and dyslexia are two different things.\n\nIs it worth repeating again? :)\n\n"
    },
    {
      "time": "13 Nov 2006 — 2:00pm",
      "content": "\\> I think the only viable text-research I’ve heard  \n\\> was the statement ‘we read best what we read most’\n\nYou know, we can talk about that (like I could explain how  \nit's basically misleading) but let's not call some self-serving  \nrabble-rousing artsy mantra \"research\".\n\nhhp\n\n"
    },
    {
      "time": "13 Nov 2006 — 2:35pm",
      "content": "_Is it worth repeating again? :)_\n\nWell, if you're going to get all repetitious, may I draw your attention to a comment I made at the top of this thread:\n\n\"being short-sighted and being dyslexic are different, but it can be argued that large print helps both — in particular because large print is also used for another group of people who don’t read fluently: children learning.\"\n\nAnd also:\n\n\"there are varying kinds of reading ability, and varying degrees.\"\n\nIf you can read fluently, you can read \"normal\" or small text (say, 8 to 12 pt). If you can't, _for whatever reason,_ then you need something larger.\n\n"
    },
    {
      "time": "13 Nov 2006 — 2:53pm",
      "content": "\\>it can be argued that large print helps both\n\nYeah, you \"can argue\" anything whatsover. If there is any good evidence, please give us the reference and after confirming that it looks solid it I will gladly withdraw my comment.\n\nedit: I'm wrong. You're right, Nick. Here's an article with solid research:\n\n[http://www.pubmedcentral.nih.gov/articlerender.fcgi?artid=1427019](http://web.archive.org/web/20131019122940/http:/www.pubmedcentral.nih.gov/articlerender.fcgi?artid=1427019 \"http://www.pubmedcentral.nih.gov/articlerender.fcgi?artid=1427019\")\n\n"
    },
    {
      "time": "13 Nov 2006 — 3:12pm",
      "content": "Looking on the internet I also found this interesting article reporting on research on the link between rhythm and reading ability:\n\n[http://news.bbc.co.uk/2/hi/uk\\_news/education/2144790.stm](http://web.archive.org/web/20131019122940/http:/news.bbc.co.uk/2/hi/uk_news/education/2144790.stm \"http://news.bbc.co.uk/2/hi/uk\\_news/education/2144790.stm\")\n\n"
    },
    {
      "time": "13 Nov 2006 — 7:31pm",
      "content": "_I’m wrong. You’re right, Nick._\n\nThanks for the empirical corroboration, William. However, I can't claim any credit for divining that, as my hypothesis was based on assumptions about the marketplace. I just found it inconceivable that in a competitive segment of the publishing industry, that publishers would not conduct focus groups, or be aware of the reading issues, or not try different type treatments, in an attempt to sell more product. And so the standard that has become established -- as with news text -- may be considered to represent the kind of product that readers prefer, and is not just a style foisted on them by a monolithic industry. In that sense, it's similar to newspaper text type, extremely conservative in its adherence to certain sizes and styles, and woebetide any typographer who deviates too greatly from the norm.\n\nA scenario I'm familiar with is where a newspaper is redesigned and a focus group (or the readers in the letters page) say a particular type spec is too small. Of course, the type is not smaller, the readers just don't like it, or aren't prepared to make the adjustment to become familiar with it.\n\nOne interesting aspect of large print is book size: it seems that readers like a normal-sized book (although it will, of course, be thicker). I suspect this is for social and cultural reasons, or maybe even the size in their hands for ease of page turning. In the study you cite, participants were kept at a distance of 40 cm from the text -- so I wonder, what if they had used smaller text, but a closer distance?! In other words, the typographic factors -- numner of words per line and page -- may be quite significant.\n\n"
    },
    {
      "time": "13 Nov 2006 — 9:58pm",
      "content": "\\> If you can’t, for whatever reason, then you need something larger.\n\nFalse.\n\nhhp\n\n"
    },
    {
      "time": "13 Nov 2006 — 11:28pm",
      "content": "True.\n\nnws\n\n"
    },
    {
      "time": "14 Nov 2006 — 5:40am",
      "content": "As well as a deep connection of reading and rhythm, the research seems to indicate that tactile experience, such as writing and molding letters out of clay helps dyslexics to read.\n\n[http://www.dyslexia-parent.com/mag30.html](http://web.archive.org/web/20131019122940/http:/www.dyslexia-parent.com/mag30.html \"http://www.dyslexia-parent.com/mag30.html\")\n\nhere is a method used by teachers:\n\n[http://www.dyslexia-parent.com/VAKT.html](http://web.archive.org/web/20131019122940/http:/www.dyslexia-parent.com/VAKT.html \"http://www.dyslexia-parent.com/VAKT.html\")\n\nHrant, this research really casts doubt on your claims that rhythm and writing have nothing to do with good type design.\n\n"
    },
    {
      "time": "14 Nov 2006 — 7:50am",
      "content": "Only if you were already predisposed to that.\n\nhhp\n\n"
    },
    {
      "time": "14 Nov 2006 — 8:10am",
      "content": "\\>if you were already predisposed to that\n\nFrom the wikipedia:\n\n\"A (fallacious) ad hominem argument has the basic form:\n\n1. A makes claim X.  \n 2. There is something objectionable about A.  \n 3. Therefore claim X is false.\n\n\"The first statement is called a 'factual claim' and is the pivot point of much debate. The last statement is referred to as an 'inferential claim' and represents the reasoning process. There are two types of inferential claim, explicit and implicit.\n\n\"Ad hominem is one of the best-known of the logical fallacies usually enumerated in introductory logic and critical thinking textbooks. Both the fallacy itself, and accusations of having committed it, are often brandished in actual discourse (see also Argument from fallacy). As a technique of rhetoric, it is powerful and used often, despite its inherent incorrectness.\n\n\"In contrast, an argument that instead relies (fallaciously) on the positive aspects of the person arguing the case is known as appeal to authority.\"\n\nAnd also your personal accusation is untrue. As you can see from this very thread, I change my mind in response to new evidence. And, as you can see here, I do seek out evidence that might contradict my views--as my teacher Popper urged.\n\nIt's called being open minded.\n\n"
    }
  ]
}
