{
  "id": "29445",
  "title": "(x) Community - Neue Helvetica 43 Ext {Ben Archer}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I especially like the round C on this one, any idea what it is?\n\n ![](http://web.archive.org/web/20080906163157im_/http:/www.typophile.com/files/community_4089.gif)\n\n [‹ (x) 'Type for you' sans - Sun {Stephen}](http://web.archive.org/web/20080906163157/http:/www.typophile.com/node/29132 \"Go to previous forum topic\") [(x) Zaid Shlah \"Taqsim\" book cover serif - Adobe Jenson {Eric B, Lari} ›](http://web.archive.org/web/20080906163157/http:/www.typophile.com/node/29466 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080906163157/http://www.typophile.com/user/10127\" title=\"View user profile.\">lherrou</a>",
  "time": "<br>",
  "uid": "10127",
  "comments": [
    {
      "time": " 11.Nov.2006 8.20pm",
      "content": "I would have said ITC Avant Garde Gothic Book, but the U and the T are wider in this example. Maybe someone else here can tell you if there is a wide or extended cut of AG Gothic in this weight?\n\n"
    },
    {
      "time": " 11.Nov.2006 9.02pm",
      "content": "I believe this is [Folio SB Light](http://web.archive.org/web/20080906163157/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=SG.101981.0.1&attributes.sampleSize=48&sampleText=COMMUNITY&sampleSize=24).\n\nSkylar\n\n"
    },
    {
      "time": " 12.Nov.2006 5.21am",
      "content": "No, I don’t believe it’s Folio SB, the “O” is much more round in this example than in Folio. And, at least to my eye, the attachment point of the angles to the uprights on the “M”s and “N” look just a little different.\n\nTo whomever edited the title to show that the font was found, please don’t cut off discussion prematurely.\n\n"
    },
    {
      "time": " 12.Nov.2006 7.44am",
      "content": "How about [Chalet](http://web.archive.org/web/20080906163157/http:/www.houseind.com/index.php?page=showfont&id=4&subpage=viewfonts)? The 1960 or 1980 styles are a lot like Avant Garde, but the T and U are wider.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 12.Nov.2006 8.15am",
      "content": "\\> _To whomever edited the title to show that the font was found, please don’t cut off discussion prematurely._\n\nOh, terribly sorry, I apologise, profusely even, won’t happen again...\n\n"
    },
    {
      "time": " 12.Nov.2006 8.52am",
      "content": "Chalet looks pretty close. The “O” in my sample looks perfectly round to my eye, where the Chalet “O” is slightly more tall than it is wide.\n\nAny more thoughts?\n\nAside to Bald Condensed:  \n _\\>\\> To whomever edited the title to show that the font was found, please don’t cut off discussion prematurely._\n\n\\> Oh, terribly sorry, I apologise, profusely even, won’t happen again…\n\nNo problem, I guess we need some way to flag within thread when a ID is “solved” so that editing the title can be done by a moderator.\n\n"
    },
    {
      "time": " 12.Nov.2006 8.56am",
      "content": "LHerrou, you’re right — the O in Folio isn’t wide enough. Good eye!\n\nYves, you are a wonderful moderator. I like your spirit of playful competition, bonhomie and respect for all. In fact, all of the moderators here are excellent. (How many boards can you say that about?) They’re a big part of what makes Typophile so good.\n\nSkylar\n\n"
    },
    {
      "time": " 12.Nov.2006 9.06am",
      "content": "Skylar, do I know you from somewhere else? Not too many know to capitalize both the L and the H in my name. :)\n\nAnd I second your comment on moderators here. I don’t post a lot, but it’s a great board and anyone who’s spent much time on the internet knows that comes from a sense of community nurtured and nudged by good moderators.\n\n"
    },
    {
      "time": " 12.Nov.2006 9.46am",
      "content": "LHerrou: I speak French, and the capitalization was automatic. =)\n\nSkylar\n\n"
    },
    {
      "time": " 12.Nov.2006 10.34am",
      "content": "I completely agree about the great job Yves does, and have said so many times. We have given him a bad time about keeping solved threads open too long, but it’s hard to decide in many cases whether the thread is done.\n\nAs for the O roundness, remember there are many graphic artists who are fond of distorting the type by making it wider, higher, narrower, etc. A word like ’COMMUNITY’ gives very little ’traction’ for making an ID. The amount of closure of the C was really the most diagnostic feature that would not be easily altered by font tweaking.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 12.Nov.2006 1.47pm",
      "content": "I agree with what Mike says – both about what Yves does here, and the amount of closure on that C; Chalet is a good pick.\n\nThere again, I’ve just tried setting COMMUNITY in [Neue Helvetica 43 Extended Light](http://web.archive.org/web/20080906163157/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=LH.108076.0.39) and it’s not a million miles away from that either!\n\n"
    },
    {
      "time": " 13.Nov.2006 10.20am",
      "content": "Ben, I think you’ve hit it. Thanks for the help!\n\n"
    }
  ]
}
