{
  "id": "29455",
  "title": "Student looking for report software ideas etc",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Howdy!  \nI am a first year engineering student. I am looking for a recommendation on which software to use to write reports in.\n\nI write quite a few reports, at least one a week. They are typical lab style reports, not very long, but including several equations, figures, tables, appendices, and a more than trivial page numbering system.  \nI have licenses for Adobe creative suite 2 and Microsoft office (being a student makes for nice discounts).  \nI am on a Macintosh, which means that I would rather not use office which is not compiled for the intel processor in my macbook pro and is a bit slow.\n\nSo, my question is, what software should I use to do lab reports in? I have been using word, but the equation editor restricts me to using times or times new. I would much rather use a font a prefer, like a garamond or warnock.\n\nI have done layout in indesign, but I am not sure that it is well suited to this kind of work. I believe latex is just about perfect for what I am doing, but I am not sure if the hassle of it is worth the work.\n\nAnother question is about Word. Is there any way to get it to recognise my font families? I don't need a list of 30 adobe jenson fonts to know that I have them. And when I select bold it doesn't change to the bold font, it does the pseudo bold. Same thing for smallcaps. Interestingly enough, TextEdit does all the font things I need, including bold and italic font switching and auto-ligatures. Not smart enough to do caption -\\> caption bold, but pretty good.\n\nThanks,  \nSam\n\n",
  "author": "samadam",
  "time": "12 Nov 2006 — 8:26pm",
  "uid": "12791",
  "comments": [
    {
      "time": "12 Nov 2006 — 9:36pm",
      "content": "indesign will be a great idead if u're so curious abt design. otherwise i would have suggest you to use word only. because very few engineer students looks into the design and aesthetics.\n\n"
    },
    {
      "time": "12 Nov 2006 — 10:22pm",
      "content": "I think InDesign would work well if you take a bit of time to learn the basics (if you haven't already) and setup character and paragraph styles. Make yourself a template that you can use for future reports; will be quite efficient once you have styles defined for captions, headings, footnotes, etc. Also nice to see an engineering student (I don't know what your background is or mean to stereotype engineers) taking interest in better typography :)\n\n"
    },
    {
      "time": "12 Nov 2006 — 11:08pm",
      "content": "I have done a bit of work in indesign (newspaper format mostly). I haven't been able to figure out how to get it to do the normal work processing things, like just typing into the sheet and having it flow page to page. I am sure there is a way to get this to happen, but I haven't found it in the help files or online. Any help?\n\nI love the styles idea, they are just frustrating in word.\n\nI suppose it is strange that I am interested in typography, as I am not an artist or have any artistic inclinations. I have a hobby of discovering new hobbies, as I like to say, and typography was one of those hobbies. Most engineers don't care. Most people anyway don't care. I cry when I see people using comic sans. They say \"its fun!\"\n\n"
    },
    {
      "time": "12 Nov 2006 — 11:49pm",
      "content": "[http://typophile.com/node/17250](http://web.archive.org/web/20131020023714/http:/typophile.com/node/17250 \"http://typophile.com/node/17250\")\n\nAn earlier thread which has some plugins that might help.  \nTim\n\n"
    },
    {
      "time": "13 Nov 2006 — 12:06am",
      "content": "<cite>I am on a Macintosh, which means that I would rather not use office which is not compiled for the intel processor in my macbook pro and is a bit slow.</cite>  \nWhen was Office ever fast? :)\n\n<cite>Interestingly enough, TextEdit does all the font things I need, including bold and italic font switching and auto-ligatures. Not smart enough to do caption -&gt; caption bold, but pretty good.</cite>  \nI am absolutely convinced that TextEdit is the single most useful program for OS X. Ever so subtly Apple has been beefing that puppy up (like adding native .DOC capability, etc.) to the point that Word is superfluous in nearly every aspect.\n\n"
    },
    {
      "time": "13 Nov 2006 — 2:05am",
      "content": "LaTeX is really the ideal programme for any papers with equations but I found it a bit of a steep learning curve.  \nBut then InDesign isn't exactly easy if you're not used to it. The plug-in timd suggests would be useful if you have to include a lot of math.\n\nAs for your comment about <cite>just typing into the sheet and having it flow page to page</cite>  \nYou may find it quicker and easier to do the typing in TextEdit. It has the benefits of auto-spell-check and the system wide dictionary and thesaurus (select a word, hover the cursor over it and ctrl-cmd-D). It's also a much smaller application –&nbsp;quicker to open, less distractions.  \nFor me, Word has all the downsides of InDesign –&nbsp;resource hungry, complicated UI –&nbsp;with none of the power.\n\nSet up your layout (and maybe a style sheet) in InDesign and paste in the raw text from TextEdit.\n\nMost people I know do the typing in a basic text editor and use InDesign or Quark for layout and styling.\n\n"
    },
    {
      "time": "13 Nov 2006 — 7:18am",
      "content": "Probably not what you want to hear but I think Word 2007 on Windows XP (or Vista) might fit the bill - maybe it's boot camp time. It includes a Math engine comparable to TeX and along with the Cambria Math font. Also the new UI addresses the complexity complaints mentioned above.\n\nHowever, my question is, what are the other Mac-based engineering students in your class using for reports?\n\nCheers, Si\n\n"
    },
    {
      "time": "13 Nov 2006 — 11:06am",
      "content": "I think I will try a combination of textedit to do the writing, mathematica to do the equations, and indesign to do the styles and layout. Those plugins are all above the price range of a student.\n\nI may give word 2007 a try on parallels or bootcamp, but I would still rather stay away from the office defaults. I just really want to wow the professors, ligatures, small caps, lining numerals, the whole shebang.\n\nOther mac based engineering students are really non-existent, as one can guess based on the old mac stereotype. Everyone else uses word and equation editor, and writes in times new roman, 12 pt.\n\nThe class presentations are all done in arial. Big, bold, arial. It makes me so sad when I see them every day.\n\n"
    },
    {
      "time": "13 Nov 2006 — 11:06am",
      "content": "You can change the default font in Word's equation editor but only when editing an equation, otherwise the option to do this is inaccessible. Once you are editing an equation, use the drop-down menus in the main toolbar to change the default font/size.\n\nAs has been mentioned, Word 2007 is far more intuitive in its treatment of mathematical expressions.\n\nAnother option you might consider is [Publicon](http://web.archive.org/web/20131020023714/http:/www.wolfram.com/products/publicon/index.html) from Wolfram Research, makers of Mathematica. You can download a free trial to see if it meets your needs. It is available on the Mac.\n\n"
    },
    {
      "time": "13 Nov 2006 — 1:01pm",
      "content": "Do you know [Mellel](http://web.archive.org/web/20131020023714/http:/www.redlers.com/) ( [trial](http://web.archive.org/web/20131020023714/http:/www.redlers.com/download.html))? It supports OpenType (and OT kerning tables), ligatures &c and an interface which is much less cluttered than Word's. Apparently it can import equations from MathMagic (I've never tried this). It isn't free, but not that expensive either; and you'll get an education discount.\n\n"
    },
    {
      "time": "13 Nov 2006 — 1:07pm",
      "content": "\\>I may give word 2007 a try on parallels or bootcamp, but I would still rather stay away from the office defaults. I just really want to wow the professors, ligatures, small caps, lining numerals, the whole shebang.\n\nWell, that makes sense, the new Office fonts contain the \"shebang\" unfortunately Office doesn't let you get at them :-( Another Windows alternate that may appeal to engineers would be to write your reports in raw XAML markup ;-) which does support the advanced typographic OpenType features.\n\n"
    },
    {
      "time": "13 Nov 2006 — 1:38pm",
      "content": "<cite> the new Office fonts contain the “shebang” unfortunately Office doesn’t let you get at them :-(</cite>  \nIt is a sad, sad world. Sergei said that he had provided the option in the code, but the final decision wasn't his to make. What gives?\n\n"
    }
  ]
}
