{
  "id": "29470",
  "title": "Type on the Sony Reader",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Sergey has one of these devices so let me take a few pics of the type using my wife’s EOS 20D (which I have no idea how to use) but here goes...\n\n ![](http://web.archive.org/web/20090927093835im_/http:/www.typophile.com/files/TPa_5747.jpg)\n\nBitstream Swiss and Dutch and Freetype too. I wonder if hints are used? Probably not.\n\n ![](http://web.archive.org/web/20090927093835im_/http:/www.typophile.com/files/TPj_6744.jpg)\n\nHere’s the Swiss, used in the UI - looks a bit blotchy up close...\n\n ![](http://web.archive.org/web/20090927093835im_/http:/www.typophile.com/files/d1_4360.jpg)\n  \n\n ![](http://web.archive.org/web/20090927093835im_/http:/www.typophile.com/files/d2_4525.jpg)\n  \n\n ![](http://web.archive.org/web/20090927093835im_/http:/www.typophile.com/files/d3_5686.jpg)\n\nThese are not quite in focus, but it looks like the bold might be fake?\n\n ![](http://web.archive.org/web/20090927093835im_/http:/www.typophile.com/files/TPb_5458.jpg)\n\nMore UI\n\n ![](http://web.archive.org/web/20090927093835im_/http:/www.typophile.com/files/TPh_5041.jpg)\n\nAnd Dutch used for the eBook content. Stem ’color’ seems uneven.\n\n ![](http://web.archive.org/web/20090927093835im_/http:/www.typophile.com/files/TPc_6411.jpg)\n\nWould you like fake small caps with your fake italics? ;-)\n\n ![](http://web.archive.org/web/20090927093835im_/http:/www.typophile.com/files/TPi_4998.jpg)\n\nMore Dutch text up close.\n\n ![](http://web.archive.org/web/20090927093835im_/http:/www.typophile.com/files/TPd_4244.jpg)\n\nMore like it, Calibri embedded in a PDF - stems still inconsistent, spacing is whack (compared to Office 2007 and Adobe Reader 7). I had to generate the PDF at a small paper size (here 4 x 6) because the 11pt type was too small at A4. Device does not appear to have good zoomability. :-(\n\n ![](http://web.archive.org/web/20090927093835im_/http:/www.typophile.com/files/Capture_5950.JPG)\n\nWord 2007 and Adobe Reader 7 rendering as a comparison.\n\n ![](http://web.archive.org/web/20090927093835im_/http:/www.typophile.com/files/TPg_4242.jpg)\n\nClose up\n\n ![](http://web.archive.org/web/20090927093835im_/http:/www.typophile.com/files/TPe_5486.jpg)\n\nAnd Cambria.\n\n ![](http://web.archive.org/web/20090927093835im_/http:/www.typophile.com/files/Capture_5168.JPG)\n\nThe original in Word.\n\nOne other quirk, spotted by Sergey, (maybe specific to Word generated PDFs?) is that PDF pages that use fake bolds take a long time to render on the device. That will teach people for using fake bold! An electric shock would be good too.\n\n",
  "author": "<a href=\"/web/20090927093835/http://www.typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": " 13.Nov.2006 1.17pm",
      "content": "heheh.\n\nnice one sii ... nerd!\n\n:P\n\n—————  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20090927093835/http:/www.solid-creative.com/print.htm)  \n—————  \n [Little Mischief](http://web.archive.org/web/20090927093835/http:/www.littlemischief.com/)\n\n"
    },
    {
      "time": " 13.Nov.2006 2.19pm",
      "content": "I’d been pestering the local Sony Style store for months, asking when the thing would be coming in. I guess it’s out now - I’m going to try to see it in person on Thursday, and maybe take some macro photos myself.\n\nhhp\n\n"
    },
    {
      "time": " 13.Nov.2006 2.51pm",
      "content": "Take along some PDFs if they’ll let you upload them. Dutch isn’t such a treat. ;-)\n\nRather than the Sony Store, maybe head to your nearest Best Buy parking lot where the fanboys are camping in the rain for their shot at a PS3 - I’m sure one of them will have one of these to show you. ;-)\n\n"
    },
    {
      "time": " 13.Nov.2006 4.04pm",
      "content": "Looks promising. When a company that hires capable UI designers—that Sony UI is just...\\*shudder\\*—puts out a second gen product I’ll probably pick one up.\n\n"
    },
    {
      "time": " 13.Nov.2006 5.18pm",
      "content": "This one is the v2 - here’s the V1...\n\n[http://www.dottocomu.com/b/archives/002571.html](http://web.archive.org/web/20090927093835/http:/www.dottocomu.com/b/archives/002571.html \"http://www.dottocomu.com/b/archives/002571.html\")\n\nThe e-ink display definitely shows promise.\n\n"
    },
    {
      "time": " 13.Nov.2006 5.20pm",
      "content": "Take a PDF on a what to be able to copy it over?\n\nhhp\n\n"
    },
    {
      "time": " 13.Nov.2006 5.39pm",
      "content": "Memory stick and SD...\n\n[http://www.sonystyle.com/is-bin/INTERSHOP.enfinity/eCS/Store/en/-/USD/SY...](http://web.archive.org/web/20090927093835/http:/www.sonystyle.com/is-bin/INTERSHOP.enfinity/eCS/Store/en/-/USD/SY_DisplayProductInformation-Start?ProductSKU=PRS500U2 \"http://www.sonystyle.com/is-bin/INTERSHOP.enfinity/eCS/Store/en/-/USD/SY\\_DisplayProductInformation-Start?ProductSKU=PRS500U2\")\n\n"
    },
    {
      "time": " 13.Nov.2006 9.25pm",
      "content": "What about browsing to an online PDF?\n\nhhp\n\n"
    },
    {
      "time": " 13.Nov.2006 9.34pm",
      "content": "I don’t think it can do that (yet).\n\n"
    },
    {
      "time": " 14.Nov.2006 9.06am",
      "content": "\\>... head to your nearest Best Buy parking lot where the fanboys are camping in the rain for their shot at a PS3 - I’m sure one of them will have one of these to show you. ;-)\n\nScratch that idea - [http://www.engadget.com/2006/11/14/ps3-hopefuls-part-iii-best-buy-shoos-...](http://web.archive.org/web/20090927093835/http:/www.engadget.com/2006/11/14/ps3-hopefuls-part-iii-best-buy-shoos-away-burbank-campers/ \"http://www.engadget.com/2006/11/14/ps3-hopefuls-part-iii-best-buy-shoos-away-burbank-campers/\")\n\n"
    },
    {
      "time": " 14.Nov.2006 9.34am",
      "content": "There was another, older, thread on this, [found here](http://web.archive.org/web/20090927093835/http:/typophile.com/node/18944).\n\n[http://typophile.com/node/18944](http://web.archive.org/web/20090927093835/http:/typophile.com/node/18944 \"http://typophile.com/node/18944\")\n\nThanks for some updated information!\n\n"
    },
    {
      "time": " 14.Nov.2006 9.49am",
      "content": "Gary,\n\nThanks for pointing to that old thread. Back in April we were speculating about the type. To me I can understand subtle spacing issues (I’ve seen worse) but the lack of true italics (and maybe true bold) is just bizarre - seeing as Bitstream has them. I can’t believe no-one else identified this as a problem that needed to be fixed in the past six months.\n\n"
    },
    {
      "time": " 14.Nov.2006 9.59am",
      "content": "I would see that as good evidence that slant is 99% of what an italic is, and cursiveness is moot. Which is not to say we shouldn’t make true italics for fonts, but maybe: we should start by mechanically deriving it from the roman; and we should charge much more for a “true” italic.\n\nhhp\n\n"
    },
    {
      "time": " 16.Nov.2006 5.18pm",
      "content": "Si —\n\nIn a certain forest-and-trees exchange, you’ve focused on the letterforms and managed to say nary a word about the atrocious typography in that screen shot of “The American University of Paris proudly presents...” Even if the fonts were perfect, it’d still be lousy text typography, which is what ultimately matters.\n\nBy the way, when did “Dutch” and “Swiss” lose their Bitstream numbers and become typeface names? They were always intended as categories, not names; only with a number (e.g., Swiss 721) does it identify a particular type family. Not intuitive, perhaps, but at least logical.\n\nJohn\n\n"
    },
    {
      "time": " 16.Nov.2006 5.29pm",
      "content": "Guys, I didn’t make it to the Sony Style store today - maybe next week.\n\nJohn, I think the assumption is that the layout can be improved,  \nbut the text quality is probably pretty much at its maximum.  \n(BTW, nice to see you around here again.)\n\nhhp\n\n"
    },
    {
      "time": " 16.Nov.2006 8.37pm",
      "content": "<cite>I would see that as good evidence that slant is 99% of what an italic is, and cursiveness is moot. Which is not to say we shouldn’t make true italics for fonts, but maybe: we should start by mechanically deriving it from the roman; and we should charge much more for a “true” italic.</cite>\n\nI tend to agree here. The general public seem to have the impression that italics are just slanted type and I’ve seen no evidence that most readers are at all bothered by fake italics (fake bold is still awful to try and read, tho). Maybe the tradition of doing script-based italics is just, well, unnecessary in many cases.\n\nOf course, for the sake of the designers who have to stare at them for hours at a time, real italics are probably worth holding onto.\n\n"
    },
    {
      "time": " 16.Nov.2006 8.45pm",
      "content": "Most people can’t tell the difference between Arial and Helvetica. Most people don’t know much about type in general. This doesn’t mean that those who do should get lazy.\n\nThe same could be said for any art or profession. The “nobody will notice” mentality is becoming way too prevalent these days.\n\n- Lex\n\n"
    },
    {
      "time": " 16.Nov.2006 8.58pm",
      "content": "\\>In a certain forest-and-trees exchange, you’ve focused on the letterforms and managed to say nary a word about the atrocious typography in that screen\n\nTrue, probably a result of my job where I have little influence over how the type we produce gets used :-( If you’d like to do a fuller review (maybe for Creative Pro) then I’m sure Sergey wouldn’t object to you coming in to the office and using his Reader for an afternoon.\n\n\\>By the way, when did “Dutch” and “Swiss” lose their Bitstream numbers and become typeface names?\n\nWe could check with Bitstream but as I recall from my early days of doing tech support on Bitsream Facelift and other similar DOS products the generec sans and serif had these unnumbered designations. I could of course be wrong.\n\n"
    },
    {
      "time": " 16.Nov.2006 9.00pm",
      "content": "\\>I tend to agree here. The general public seem to have the impression that italics are just slanted type and I’ve seen no evidence that most readers are at all bothered by fake italics\n\nBut if it’s not acceptable in the cheapest paperback book then it shouldn’t be acceptable on a $300 device - no?\n\n"
    },
    {
      "time": " 16.Nov.2006 9.21pm",
      "content": "\\> This doesn’t mean that those who do should get lazy.\n\nThere’s laziness of action, then there’s laziness of spirit. Speedily making something that’s both ideologically and practically sound doesn’t have to be the former, and spending time making yet another overly-cursive italic can often be the latter.\n\nThat said, I agree that “nobody will notice” isn’t a good enough argument, especially since reading is essentially subconscious. But when you couple it with “we shouldn’t be doing it anyway” then it gets pretty convincing!\n\nEssentially, my own argument here involves a rejection of the conventional “italics must be more cursive” dogma, something that even leads to people making so-called “upright italics” and thinking they can get away with <cite>that</cite>.\n\n\\> But if it’s not acceptable in the cheapest paperback book  \n\\> then it shouldn’t be acceptable on a $300 device - no?\n\nYou don’t know that it’s not acceptable. It would be interesting here to check for any negative reader reactions around the turn of the 20th century, when ATF was churning out mechanically-slanted Romans in place of real Italics (“thanks” to the pantograph).\n\nhhp\n\n"
    },
    {
      "time": " 16.Nov.2006 9.47pm",
      "content": "I think that it’s up to the type designer to decide what the Roman and Italic (if any) look like.\n\nHowever, if a font is intended to be used with true “cursive” italics, then it should be set that way (unless, of course, there is reasoning behind the use of a slanted Roman). Artificially slanted and boldened(?) text should be used only in the absence of true italics or bolds.\n\n- Lex\n\n"
    },
    {
      "time": " 29.Nov.2006 8.32am",
      "content": "A new NYT review...\n\n[http://www.nytimes.com/2006/11/24/books/24eboo.html?bl&ex=1164603600&en=...](http://web.archive.org/web/20090927093835/http:/www.nytimes.com/2006/11/24/books/24eboo.html?bl&ex=1164603600&en=0bce207115becbac&ei=5087%0A \"http://www.nytimes.com/2006/11/24/books/24eboo.html?bl&ex=1164603600&en=0bce207115becbac&ei=5087%0A\")\n\n...sadly the fact-checkers were out to lunch...\n\n“The typeface is a computerized version of Courier and pleasingly readable”\n\n"
    },
    {
      "time": " 29.Nov.2006 10.12am",
      "content": "I played around with the Sony reader over the last weekend. It’s interesting, but definitely not ready for anyone who doesn’t buy $250+ gadgets for the hell of it.\n\nThe screen redraw is extremely irritating. It’s not the second it takes that’s the real problem, it’s the jarring experience of the screen flashing black and two pages of type overlaying each other and then settling on the new one. Also irritating is the interface; there are too many buttons and the layout makes little, if any, sense. It needs a manual page attached to the inside of the screen cover, like the little character drawing guides included with Palm OS devices.\n\nRegarding type rendering the reader is a winner. Characters are rendered crisply and pages are very easy on the eyes. Layouts, however, are gross. Poorly-placed page breaks, widows, and orphans abound. It’s not just bad in the sense a designer will understand, this thing churns out lines that look like early drafts of high-school term papers. The only book on the model I tested was _The Da Vinci Code_, and the reader managed to make Dan Brown’s deplorable prose even worse. This could be dealt with by just setting standards for books sold via the official store, or even a firmware update that sets some simple rules for displaying text on-screen, but Sony isn’t the sort of company that will make it happen.\n\nThe problems with the Sony reader make me expect it to flop just like the old LCD ebook readers did. It could have a future if it sold for less, and if books were sold at a massive discount to make up for having to read them in this dreadful state. But that not being the case, I cannot see why any serious reader would buy the Sony reader.\n\n"
    },
    {
      "time": " 9.Jan.2008 4.47am",
      "content": "PDFCropper is the application, designed to solve the problem with preparing for reading normal sized (A4-like) pdf’s on relative small (Sony Reader PRS500/PRS505, iRex Illiad etc.) devices.\n\nThe problem is that pdf is not reformatable by nature. Yes, there is reflow mode in Acrobat Reader, but at first Acrobat Reader is not available for most e-book readers (especially for e-ink devices),  \nand second even with reflow function reading of complex content (technical books, magazines etc.) is not comfortable. Bad formatted pdf’s and wide white spaces make the situation even worse.\n\nThe only way how this problem can be solved (at least based on my experience) to cut original pages into smaller pages with removing white spaces.  \nThis is exactly what program do. But comparing with similar software PDFCropper is much more flexible, that allows to prepare books with much better quality in a very short time.\n\nCurrently PDFCropper can produce text and image pdf’s. Later additional output formats (lrf, lrs, wolf etc.) will be added.\n\nPDFCropper web-site currently is under construction. But it is already available for downloading:\n\nPDFCropper v1.0 RC6 links:\n\n[http://rapidshare.com/files/82195677/PDFCropper1\\_0RC6Setup.exe.html](http://web.archive.org/web/20090927093835/http:/rapidshare.com/files/82195677/PDFCropper1_0RC6Setup.exe.html \"http://rapidshare.com/files/82195677/PDFCropper1\\_0RC6Setup.exe.html\")  \nor  \n [http://www.filefactory.com/file/c0a487/](http://web.archive.org/web/20090927093835/http:/www.filefactory.com/file/c0a487/ \"http://www.filefactory.com/file/c0a487/\")  \nor  \n [http://www.megaupload.com/?d=4HLHIL7G](http://web.archive.org/web/20090927093835/http:/www.megaupload.com/?d=4HLHIL7G \"http://www.megaupload.com/?d=4HLHIL7G\")\n\nTrial version of PDFCropper is fully functional, but output pages are shuffled and include watermark (which by the way displays registration code that you need for obtaining license).\n\nThere are no yet tutorial or help available. But I prepared “How To” demo-video:\n\n[http://rapidshare.com/files/79717770/PDFCropper\\_-\\_How\\_To.swf.html](http://web.archive.org/web/20090927093835/http:/rapidshare.com/files/79717770/PDFCropper_-_How_To.swf.html \"http://rapidshare.com/files/79717770/PDFCropper\\_-\\_How\\_To.swf.html\")\n\nAnd you can download and value an example of prepared (cropped) pdf:\n\nThis is original one - [http://java.sun.com/docs/books/jls/download/langspec-3.0.pdf](http://web.archive.org/web/20090927093835/http:/java.sun.com/docs/books/jls/download/langspec-3.0.pdf \"http://java.sun.com/docs/books/jls/download/langspec-3.0.pdf\")\n\nThese are links to cropped one:\n\n[http://rapidshare.com/files/80267677/The\\_Java\\_Language\\_Specification.pdf...](http://web.archive.org/web/20090927093835/http:/rapidshare.com/files/80267677/The_Java_Language_Specification.pdf.html \"http://rapidshare.com/files/80267677/The\\_Java\\_Language\\_Specification.pdf.html\")  \nor  \n [http://www.filefactory.com/file/bc2cb0/](http://web.archive.org/web/20090927093835/http:/www.filefactory.com/file/bc2cb0/ \"http://www.filefactory.com/file/bc2cb0/\")  \nor  \n [http://www.megaupload.com/?d=FCJJYHHB](http://web.archive.org/web/20090927093835/http:/www.megaupload.com/?d=FCJJYHHB \"http://www.megaupload.com/?d=FCJJYHHB\")\n\nAnd these are links to the one cropped as image pages (only some pages are there, due large file size):\n\n[http://rapidshare.com/files/80268186/The\\_Java\\_Language\\_Specification\\_\\_im...](http://web.archive.org/web/20090927093835/http:/rapidshare.com/files/80268186/The_Java_Language_Specification__image_pages_.pdf.html \"http://rapidshare.com/files/80268186/The\\_Java\\_Language\\_Specification\\_\\_image\\_pages\\_.pdf.html\")  \nor  \n [http://www.filefactory.com/file/e7a856/](http://web.archive.org/web/20090927093835/http:/www.filefactory.com/file/e7a856/ \"http://www.filefactory.com/file/e7a856/\")  \nor  \n [http://www.megaupload.com/?d=KKE7C1V3](http://web.archive.org/web/20090927093835/http:/www.megaupload.com/?d=KKE7C1V3 \"http://www.megaupload.com/?d=KKE7C1V3\")\n\nNote: Above documents are optimized for Sony Reader PRS500/505. Application can also optimize for iRex Illiad, as well as for other devices.\n\nAlso, anyone interesting in software, can send me example pdf, and I will send back resulted pdf prepared via application. Please, specify for which device to optimize resulted pdf.\n\nYou can ask any questions about using or installing software (and details about purchasing the license) via e-mail:  \n [vstefanyuk@gmail.com](mailto:vstefanyuk@gmail.com)\n\nLicense price - 20 euro.\n\nP.S. Application is implemented by using Java. You have to have installed Java environment version 1.5 or higher.  \nAlso Ghostscript has to be installed. In case if it is not, application will propose you to download.\n\n"
    },
    {
      "time": " 9.Jan.2008 7.15am",
      "content": "I’ve looked at two units at two different stores, and whatever else one might say about this, what strikes me most is how unacceptably low the display contrast is. If there’s a way to raise it, the store staff couldn’t help me.\n\nhhp\n\n"
    },
    {
      "time": " 9.Jan.2008 7.27am",
      "content": "(Hi, Hrant!)\n\nVolodymyr, is this your software to post links to?\n\n"
    },
    {
      "time": " 22.Jan.2008 5.10am",
      "content": "Yes, Tiffany\n\nThis is my software\n\n"
    }
  ]
}
