{
  "id": "29473",
  "title": "Type ID please (Old pharmacy bottles)",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi,\n\nI'm looking for a font used for old pharmacy bottles. I have two types of font, any one would be fine, though I would personally prefer the \"PHOSPHOR.\" font.\n\nThese fonts in the picture are hand-drawn, so no 100% match is possible (tried the What The Font website, no luck), but I'm sure very similar fonts must exist.\n\n ![](http://web.archive.org/web/20141228194133im_/http:/typophile.com/files/bottles-s_3434.jpg)\n\nAny suggestions? (Preferably free fonts)\n\nBest regards & TIA,  \nTillmann\n\n",
  "author": "Tillmann",
  "time": "13 Nov 2006 — 2:42pm",
  "uid": "15390",
  "comments": [
    {
      "time": "13 Nov 2006 — 3:11pm",
      "content": "Hi Tillmann\n\n(Question) If you want them for free, and you know they are hand drawn to begin with, what is stopping you from redrawing them yourself?\n\nThe Sol.Zinc.Sulfur lettering is a fat face – something like [Poster Bodoni Compressed](http://web.archive.org/)\n\nThe Phosphor.Sol lettering is some kind of mangled sans serif (of which there are many available as freebies on the web), but I don't know what it might be called. Probably someone else here knows what it is...\n\n"
    },
    {
      "time": "13 Nov 2006 — 6:23pm",
      "content": "Tillman: Check out the [Cape Arcona](http://web.archive.org/web/20141228194133/http:/cape.ths.nu/start.php?link=fonts) type foundry. There are several sans serif faces with the look and feel you're after, and a few of them are free. I'm thinking of Alternative Three, C.I.A., Ginger Mint (the lowercase is stupendous), Kiss Kiss Bang Bang, and Traktor.\n\nI'm a sign painter and a huge fan of naive typography. Hence, my enthusiasm! =)\n\nSkylar\n\n"
    },
    {
      "time": "14 Nov 2006 — 1:57am",
      "content": "Hi,\n\nthanks!\n\n@ ben\\_archer:\n\nThanks, Poster Bodoni Compressed matches quite well - knowing that, I also found the cheaper alternative \"Arsis\" where the uppercase characters seem to look pretty much identical (the lowercase ones don't).  \nWhy I am not redrawing it myself? Well, I'm an engineer not a graphics artist, I neither have the tools nor the skills to do it :)\n\n@skyfein:\n\nThanks also, I checked out these fonts but they don't really match. If you look at the S on the bottle - the outside of the letter is squarish, but the inside of the S is perfectly round, and the thickness varies across the letter. Haven't found a font with these characteristics. I think that's what gives the \"handmade\" feel.\n\nbye,  \nTillmann\n\n"
    },
    {
      "time": "22 Nov 2012 — 6:15pm",
      "content": "An approximately try to visit in [pharmacy technician training schools](http://web.archive.org/web/20141228194133/http:/www.pharmacytechniciantrainingschools.org/ \"pharmacy technician training schools\") if there's an old bottle they used on projects. Sometimes students have projects of that related to pharmacy equipments.\n\n"
    },
    {
      "time": "23 Nov 2012 — 1:48am",
      "content": "Correct link for Cape Arcona type foundry:\n\n[http://www.cape-arcona.com/news/](http://web.archive.org/web/20141228194133/http:/www.cape-arcona.com/news/ \"http://www.cape-arcona.com/news/\")\n\n"
    }
  ]
}
