{
  "id": "29478",
  "title": "FONT for Multi Language Support ??",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "hi  \nCan anyone suggest me a font that supports both European and Asian languages..  \ni.e., the font must support Arabic,Japanese,Chinese,English,Spanish etc  \nThanks and Regards  \nMahi\n\n",
  "author": "<a href=\"/web/20110427083627/http://www.typophile.com/user/15394\" title=\"View user profile.\">Mahi</a>",
  "time": "<br>",
  "uid": "15394",
  "comments": [
    {
      "time": "",
      "content": "[Arial Unicode](http://web.archive.org/web/20110427083627/http:/www.ascendercorp.com/msfonts/arial_unicode.html) is pretty comprehensive, Mahi. It'll certainly cover the languages you mention in your post.\n\n"
    },
    {
      "time": "",
      "content": "Does it support Arabic??  \nI tried displaying arabic..i could see only black box.  \nMahi\n\n"
    },
    {
      "time": "",
      "content": "Yup. According to the blurb it does:\n\nUnicode Ranges  \nBasic Latin, Latin-1 Supplement, Latin Extended-A, Latin Extended-B, IPA Extensions, Spacing Modifier Letters, Combining Diacritical Marks, Greek and Coptic, Reserved Bit 8, Cyrillic, Armenian, Hebrew, Reserved Bit 12, **Arabic** , Reserved Bit 14, Devanagari, Bengali, Gurmukhi, Gujarati, Oriya, Tamil, Telugu, Kannada, Malayalam, Thai, Lao, Georgian, Reserved Bit 27, Hangul Jamo, Latin Extended Additional, Greek Extended, General Punctuation, Superscripts And Subscripts, Currency Symbols, Combining Diacritical Marks For Symbols, Letterlike Symbols, Number Forms, Arrows, Mathematical Operators, Miscellaneous Technical, Control Pictures, Optical Character Recognition, Enclosed Alphanumerics, Box Drawing, Block Elements, Geometric Shapes, Miscellaneous Symbols, Dingbats, CJK Symbols And Punctuation, Hiragana, Katakana, Bopomofo, Hangul Compatibility Jamo, Reserved Bit 53, Enclosed CJK Letters And Months, CJK Compatibility, Hangul Syllables, CJK Unified Ideographs, CJK Compatibility Ideographs, Alphabetic Presentation Forms, Arabic Presentation Forms-A, Combining Half Marks, CJK Compatibility Forms, Small Form Variants, Arabic Presentation Forms-B, Halfwidth And Fullwidth Forms, Specials\n\n"
    },
    {
      "time": "",
      "content": "But typographically, Arial Unicode MS is rather poor. I wouldn’t recommend it for any serious work, especially not for print. It’s OK for screen use but for print, use a combination of Minion Pro, Adobe Hebrew, Adobe Arabic and Kozuka Mincho Pro (all of them are bundled with Adobe Acrobat or some Creative Suite apps).\n\nAdam\n\n"
    },
    {
      "time": "",
      "content": "\\> Arial Unicode MS is rather poor.\n\nMajor understatement.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "For multi-script typography, the mix-and-match approach is the way to go in most cases. I've found a number of Japanese fonts will cover all of the scripts you require (the Japanese scripts, Chinese characters, Latin, and Arabic) and more, but they are often so typographically poor as to be unusable outside of the Japanese and Chinese scripts. A one-stop font that will cover all your needs would be convenient, but I don't think there is anyone with the resources and the typographic knowledge to create a single font that works well for all scripts.\n\nAsk yourself what languages you need to support and which ones will be the most important to you. If for example you will deal a lot with Arabic and other languages that use the Arabic script, then find out what the good typefaces for Arabic are. Ask typographically-enlightened native users of the Arabic script. There are very few people who can judge the typographical merits of fonts for all the different scripts, but for single scripts you will get a lot of responses.\n\n"
    },
    {
      "time": "",
      "content": "Very good points.\n\n\\> For multi-script typography, the mix-and-match  \n\\> approach is the way to go in most cases.\n\nAnd the reasons are:  \n1) The importance of Nativity.  \n2) The disease of Modernism.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Jongseong, That's why I am still using my 32RAM/133MHZ PC to run PageMaker5.5ME on Arabic Windows 3.11... So far, so good.  \nFor me, Indesign and Windows Xp are no alternatives!\n\n"
    }
  ]
}
