{
  "id": "29493",
  "title": "The STENCIL approach",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "type designers allways trying to create new particularities in type face design!\n\nStencil font design offer great possibilty of creating new approaches. I think we can draw stencil letters without just cutting the letter forms or adapting them to the stencil technology. As stencil cuts add complexity to letterforms, offer new vast drawing possibilities.\n\nDon't you think?! :)\n\nI have been working on a stencil font called Forma, in wich the interruptions have a connection with the basic structure of the letters.\n\n ![](http://web.archive.org/web/20140715052715im_/http:/typophile.com/files/forma_5539.gif)\n\n| Attachment | Size |\n| --- | --- |\n| [formaSample.pdf](http://web.archive.org/web/20140715052715/http:/typophile.com/files/formaSample.pdf) | 137.91 KB |\n\n",
  "author": "rui abreu",
  "time": "14 Nov 2006 — 10:29am",
  "uid": "12433",
  "comments": [
    {
      "time": "14 Nov 2006 — 11:07am",
      "content": "The good news about stencil design is indeed that there's still much room for exploration. The bad news is that virtually all of the exploration is done for the sake of style, not function.\n\nOne of my type design students -a graffiti artist, appropriately- did a unicase stencil font. I tried to guide her as much as I could, and I think the results were interesting and useful, but I have to admit to having felt a little bit lost! More thought is needed, all around.\n\nhhp\n\n"
    },
    {
      "time": "14 Nov 2006 — 1:28pm",
      "content": "A pdf sample with a plethora of settings would be nice.\n\n"
    },
    {
      "time": "22 Nov 2006 — 12:47pm",
      "content": "If a stencil lettering design is not adapted with stencil printing technology in mind, is it really a stencil design? Yes, I suppose it is possible make a nifty broken-stroke font that is neither consisting of cut forms nor the technical requirements of stenciling, but at that point is it really right to call it a stencil anymore?\n\n"
    },
    {
      "time": "22 Nov 2006 — 2:04pm",
      "content": "Define \"stencil\" (in a versatile way).\n\nhhp\n\n"
    },
    {
      "time": "22 Nov 2006 — 3:06pm",
      "content": "stencil: a shield with shaped openings through which a marking medium is applied, for imprinting a design on a surface.\n\nstenciled lettering: 1) letters printed with a stencil, 2) the characteristic form of those letters.\n\n"
    },
    {
      "time": "22 Nov 2006 — 3:08pm",
      "content": "\\> through which paint is applied\n\nDon't like it - too material.  \nTry again. :-)\n\nhhp\n\n"
    },
    {
      "time": "22 Nov 2006 — 3:12pm",
      "content": "edited\n\n"
    },
    {
      "time": "22 Nov 2006 — 4:21pm",
      "content": "Make it \"real or virtual marking medium\" and I'm in... except:\n\nHold everything, I just realized this is all (or at least half) wrong. You're trying to define it based on how it's used, but I think it needs to be defined by how its use makes it be. What I mean is that the important thing about a stencil shape isn't [only] that you can mark through it, it's that you can hold it up and it won't fall apart.\n\nhhp\n\n"
    },
    {
      "time": "22 Nov 2006 — 5:24pm",
      "content": "Yes, the structural integrity of the stencil is vital. One doesn't want the floating and floppy bits falling out when you move it around.\n\nI'm not sure what you mean by \"virtual marking medium\" in this context, for when you pass light through a stencil, it becomes a gobo, and in computer graphics the terms vary as much as the programs.\n\n"
    },
    {
      "time": "22 Nov 2006 — 9:39pm",
      "content": "Gobo? (Looking it up...) Cool word, thanks.\n\nVirtual is important because I'd say most of what we do here is virtual.\n\nhhp\n\n"
    },
    {
      "time": "24 Nov 2006 — 1:00pm",
      "content": "\"I’d say most of what we do here is virtual\"\n\nI think that sentence defines something about typography nowadays. Much of the contemporary typographical work is made of digital stylistic exercises, wouldn't you agree.\n\nThe stencil aproach could be looked at, just as a esthetical choice in a stylistic exercise, or as a way to make real stencil letters with a new style.\n\n"
    },
    {
      "time": "24 Nov 2006 — 1:09pm",
      "content": "I have uploaded a pdf file on the top.\n\nwould you call it a real stencil font, or a stylistic exercise?\n\n"
    },
    {
      "time": "24 Nov 2006 — 4:30pm",
      "content": "Forma has very thin support bars, and many are positioned such that the counters could easily be torqued out and broken away, most obviously in the A, B, D, P, O, Q, and R. In the lower case, the a, b, d, e, g, o, p, and q have the same problem. The curved support bar of the A is unusual, but not prohibitive depending on the method and material of construction, but most ways I can think of it it only serves to further weaken the bar.\n\nA stencil made with this font would work, but it could be easily damaged and is therefore not suitable for repeated use. It would depend on the material and size of the stencil and the conditions under which it is used. The counters are attached, but in such a way that they're still floppy, and that is dangerous when designing a sturdy, functional stencil.\n\nI'll try to put together a little image of some other stencil fonts, like Freeform 721 and Glaser Stencil and whatever else I can find so we can further the discussion. It seems most if not all stencil fonts take some liberties with what I imagine stencil engineering to be.\n\n"
    },
    {
      "time": "24 Nov 2006 — 9:38pm",
      "content": "Stencils are stupid tools for lazy people. Nevertheless, I have developed a stencil with [my Font](http://web.archive.org/web/20140715052715/http:/typophile.com/node/19348) for Calligraphy-loving people. It is more functional than any stencil you think of. It needs no skill but knowing Arabic numbers?!  \nCan I call [my Font](http://web.archive.org/web/20140715052715/http:/typophile.com/node/19348) a Stencil Font?!\n\n"
    },
    {
      "time": "24 Nov 2006 — 10:31pm",
      "content": "If you make your definitions overly broad anything can be anything, and words lose all meaning. If you can't cut it out of sheet metal or a similarly semi-rigid material without the counters falling out, no your font can't be a stencil.\n\nWell, it could be, but there would be big solid blobs where you mean there to be elegant loops and such.\n\n"
    },
    {
      "time": "24 Nov 2006 — 10:41pm",
      "content": "One can adapt almost any font to be a stencil font, I suppose.  \nToo many font designers have looked at stencils as a stylistic exercize and fail to take into account the structural requirements. There is more to it than just keeping the counters attached to the outside, though that would be the minimum design criterion.\n\n[Traffic Stencils, inc.](http://web.archive.org/web/20140715052715/http:/www.trafficstencils.com/) sells some very practical and durable stencils. Hardly are they attractive, but they hold together.\n\nStencils are not stupid. They are practical tools for situations when other types of marking are, well, not practical.\n\n"
    },
    {
      "time": "25 Nov 2006 — 2:41am",
      "content": "Rui,\n\nIf we do want to distinguish between a design that can be translated into a reusable stencil, and a stylistic exercise, then I think your design is the latter. The locations of the 'interruptions\" as you call them are less than optimal if you consider making and using a stencil from it. Some letters might need to be completely redesigned if your real goal is reusable stencils.\n\nI have made stencils, and some were only intended to be used 2-4 times and then thrown away. In one case I made a house number, and held the small counters to the rest of it by taping long pieces of hair across the whole thing (my sister has very long hair). So you could even make a stencil that doesn't look like one. For that matter, silkscreen printing is essentially a stencil held together by a fine mesh of \"hairs\", or the thin threads of the screen.\n\nBut what is your goal, and what are your real constraints? If the design isn't meant to ever be translated into physical materials, then why bother? You could make a font with interruptions all over, or one with dents and bumps, or.... If the real constraints of making a functional stencil aren't there, then why are you doing it? If you want to play with that style, I say make it work for real. The big challenge is making it work and look good.\n\nFinally: To see if your design works as a stencil, print it on heavy card, take a knife and cut it out. Spray paint or sponge paint something with it. Does the card curl up? Do the links dissolve from the moisture in the paint? Are they too delicate to withstand blotting or brushing? Use plastic. Does the paint get under the counters? There are a number of other concerns with designing real stencils that might be more interesting than any of our theories. What about trapping?\n\n"
    },
    {
      "time": "25 Nov 2006 — 3:14am",
      "content": "I think your right about Forma not being suitable for real stencil application.\n\nI suppose my intention was to make a print font with style rather than a real stencil font, although when I was working on in it i was imagining it to be cuted on a iron plate.  \nAfter releasing it I started questioning my self whether thise characters were just nice drawings with a light stencil touch (i don't know if you agree), or if this font could be considered as a stencil font. That is why I wanted to bring to discussion \"the stencil aproach\" and it is making me want to add a new version to forma with real functional concerns.\n\n"
    },
    {
      "time": "25 Nov 2006 — 11:50am",
      "content": "\\> Forma has very thin support bars, and many are positioned such  \n\\> that the counters could easily be torqued out and broken away\n\nVirtual exactly means that there can be no such things as \"too thin\" and \"broken away\". There's a lot of fertile ground between making anything mean anything and being hopelessly draconian. The potential physical merit of a stencil font is completely pointless. So a given one might be unsuitable depending on the construction material, the type of paint, etc.? What else is new about fonts?! :-)\n\nhhp\n\n"
    },
    {
      "time": "25 Nov 2006 — 12:49pm",
      "content": "There's a lot of interesting work being done using stencils. Multi-colored graffiti, signage, tags and other applications that call for inventive letters and images cut from some material. Getting them to work is the fun part, then using them to mark or communicate is the purpose. I've seen elaborate murals made only with stencils, as well as political graffiti. Portable, quick, no need for tape.\n\nDigital outlines don't have the same constraints at all, so why bother thinking about \"stencil\" when it's just a stylistic choice? I don't know why there are so many monospaced fonts out there either.\n\nI'm attaching an idea from a typophile letter design challenge; I think the idea was design a stencil alphabet and use it. I didn't get around to using it, but this is a scan of the actual stencil.\n\nI can't seem to attach an image today....\n\n ![](http://web.archive.org/web/20140715052715im_/http:/typophile.com/files/ccstencilart2_6305.gif)\n\n"
    }
  ]
}
