{
  "id": "29510",
  "title": "Squash Federation Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20080705105725im_/http:/www.typophile.com/files/squashA_1_6514.jpg)\n  \nI’m designing a new logo for the Hungarian [Squash](http://web.archive.org/web/20080705105725/http:/en.wikipedia.org/wiki/Squash_%28sport%29) Federation, and i’m not sure if the mark of my mockup is recognizable enough. I was thinking i put here just the mark without any comment, but than i realized it would be a silly guessing game, and the logo will be used in a certain context where the recognition is easier...\n\nA few comments on my layout:\n\n- i still need to work on the colors, this just the first approach\n- the kerning of the the title is default kerning of the font. Will be finalised at the end.\n- _Magyar Fallabda Szövetség_ means Hungarian Squash Federation\n\nAny feedback is welcome, thanks,  \nPéter\n\n [‹ Logo for CD packaging](http://web.archive.org/web/20080705105725/http:/www.typophile.com/node/29537 \"Go to previous forum topic\") [Personal Wordmark ›](http://web.archive.org/web/20080705105725/http:/www.typophile.com/node/29421 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080705105725/http://www.typophile.com/user/14824\" title=\"View user profile.\">zwoelf</a>",
  "time": "<br>",
  "uid": "14824",
  "comments": [
    {
      "time": " 15.Nov.2006 5.30am",
      "content": "Sorry to say, but before reading your message the image reminded me of a bird with a thin long beak. Maybe the white line is too strong?\n\nI like the blue, some squash balls are that colour, aren’t they? (haven’t played for 15 years)\n\n"
    },
    {
      "time": " 15.Nov.2006 6.52am",
      "content": "I would be tempted to show the motion of the ball in a confined space without the racquet, except that there are other sports that use a similar court layout, if the mark was to appear without the text. Like Mili it is years since I played squash and the racquets have changed shape a lot since then.\n\nTim\n\n"
    },
    {
      "time": " 15.Nov.2006 7.08am",
      "content": "I see a bird, a lacrosse stick, and maybe a tennis racket. The racket is perhaps to generic or abstract. . . Im no Hungarian and its been a while since I embarressed myself on the Squash court, but is there some thing here that tells me its Hungarian?\n\nI also agree that the motion of the ball could be worked on. Ball seems a little small as well.\n\nCheers\n\n"
    },
    {
      "time": " 16.Nov.2006 1.17am",
      "content": "When i created the mark i saw the bird aswel... The client doest want it to be hungarian (tri-color or gulasch like :) more a strong corporate mark.\n\nI understand, that this is not working, i sketched a few variations on this, and also got some other ideas. Will sent it to this forum later on.\n\nThanks for your help.  \nPéter\n\n"
    },
    {
      "time": " 16.Nov.2006 1.28am",
      "content": "_“I would be tempted to show the motion of the ball in a confined space without the racquet, except that there are other sports that use a similar court layout,”_\n\nDo you thing that would be enough to recognize the mark/squash theme? I give it a try. Thanks, for the idea.\n\nPéter\n\n"
    },
    {
      "time": " 16.Nov.2006 3.49am",
      "content": "I think with the supporting text it should be apparent, without it will be too easily confused with other enclosed court games. I felt that your mark didn’t make enough of squash’s three dimensional quality where the ball could come from virtually any direction.\n\nTim\n\n"
    },
    {
      "time": " 16.Nov.2006 9.03pm",
      "content": "it’s a reasonable start.\n\nthough - as has been touched on already - with squash being such a fast paced and dynamic game, I’d expect to see that reflected in the mark.\n\n—————  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20080705105725/http:/www.solid-creative.com/print.htm)  \n—————  \n [Little Mischief](http://web.archive.org/web/20080705105725/http:/www.littlemischief.com/)\n\n"
    }
  ]
}
