{
  "id": "29538",
  "title": "Wide Screen Displays Galore",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello friends, I’ve come here to talk about a very tricky subject. Wide screen LCD displays.\n\nSince I don’t know all that many people with, or who know about current LCD displays, and the last post made here was in late 2005, I thought I would ask some advice from those who know a bit about the market today (my dell 17inch CRT excludes me from that category outright).\n\nI want atleast 20 inches, but would prefer 22+ (who wouldn’t), I’ll be gaming, doing design and editing video on it, and using it with both my PC and my powerbook.\n\nI would prefer dual DVI and at least some form of analog in if I feel like hooking my xbox to it (preferably componant, but svideo could work), but this isn’t a primary worry. I could always buy a monitor switching box if it became a hassle too.\n\nAnd it would be really nice to spend less than 500, but more like 400.\n\nBased on all of this I’ve narrowed it down to a few displays, but I would really like to hear about others that meet these criteria if you guys know of any.\n\n1st choice: Samsung SyncMaster 22” Widescreen Flat-Panel TFT-LCD Monitor (solid choice, but few imputs)\n\n2nd Choice: Gateway 22” Widescreen Flat-Panel TFT-LCD HD Monitor (great inputs, but not sure about the quality)\n\n3rd Choice: Dell 2007WFP Wide-Screen Black Flat Panel Monitor (I heard dells are pretty nice)\n\nAlso the dell 2407WFP 24inch looks pretty amazing, but can’t really be had for less than 650.\n\nAnyway, I’m fine with this thread becoming a topic for monitors in general, but I would love to hear suggestions for this lost soul.\n\nThanks alot-  \nKent.\n\n [‹ Reading Research: What is Needed?](http://web.archive.org/web/20080316192636/http:/www.typophile.com/node/29048 \"Go to previous forum topic\") [re-branding flags ›](http://web.archive.org/web/20080316192636/http:/www.typophile.com/node/29511 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080316192636/http://www.typophile.com/user/15339\" title=\"View user profile.\">bigcitykent</a>",
  "time": "<br>",
  "uid": "15339",
  "comments": [
    {
      "time": " 16.Nov.2006 2.58am",
      "content": "And I have done some reading about brightness/contrast and the 24inch dell sounds pretty impressive with 450 cd/m² and 1000:1 contrast ratio. But it seems like 1:700+ and above 250 cd/m² and you are doing ok, but I would love to hear thoughts on it.\n\n"
    }
  ]
}
