{
  "id": "29562",
  "title": "AVENIR",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "can anyone suggest a font that would go nicely with AVENIR?  \nthanks\n\n",
  "author": "morrisondesign",
  "time": "16 Nov 2006 — 7:02pm",
  "uid": "15440",
  "comments": [
    {
      "time": "16 Nov 2006 — 7:05pm",
      "content": "Serif? Sans? Script? Text? Display? Need input. [0\\_0]\n\n- Lex\n\n"
    },
    {
      "time": "16 Nov 2006 — 7:23pm",
      "content": "i would like to use AVENIR as a font in a magazine.. body text and headlines.. need a font to compliment it for subheads and one possilby as display font\n\n"
    },
    {
      "time": "16 Nov 2006 — 8:54pm",
      "content": "Avenir as body text in an entire magazine, eeek! I think your readers will get tired and/or suffer massive headaches ... would like to see how it goes though.\n\n----------  \n**Paul Ducco**  \n [Graphic Design, Melbourne](http://web.archive.org/web/20141013175716/http:/www.solid-creative.com/print.htm)  \n----------  \n [Little Mischief](http://web.archive.org/web/20141013175716/http:/www.littlemischief.com/)\n\n"
    },
    {
      "time": "16 Nov 2006 — 9:59pm",
      "content": "I'd say Avenir has too small of an x-height to work as text, but then again, I've never tried setting text in Avenir.\n\nAnyway, how about something like the bold weight of [Iridium](http://web.archive.org/web/20141013175716/http:/www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufacturer&displayfontid=LH.117505.0.0) also by Adrian Frutiger?\n\nIn the sans-serif category, [Mostra](http://web.archive.org/web/20141013175716/http:/www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufacturer&displayfontid=MSF.118749.0.0) by Mark Simonson or the Titling weight of [Neutraface](http://web.archive.org/web/20141013175716/http:/houseind.com/index.php?page=showfont&id=18&subpage=viewfonts) might work, depending on how bold your Avenir headings are.\n\n- Lex\n\n"
    },
    {
      "time": "16 Nov 2006 — 10:42pm",
      "content": "If your magazine has long articles, stick with a good serif family (Freight Text, among many other options) for text, and use Avenir instead for the sidebars, etc.\n\n"
    },
    {
      "time": "17 Nov 2006 — 2:11am",
      "content": "It's ok to use Avenir for longer text matter, I think. At least, I have done that a few times ; ). Mind that you use a fair amount of leading and that you check the basic kerning (the lighter faces need more than is built–in…).\n\nBTW You can't go wrong if you combine it with a Frutigerdesigned serif. There is something very consistent in Mr F's designs. That may have to do with his exeptional drawing skills and his great knowledge of signs (he wrote about signs — a fascinating book: Der Mensch und seine Zeichen).\n\n"
    },
    {
      "time": "17 Nov 2006 — 6:27am",
      "content": "In a magazine I laid out late in the Summer of 2005, I combined Avenir headlines with [Caecillia](http://web.archive.org/web/20141013175716/http:/www.linotype.com/1313/pmncaecilia-family.html) for text. On occasion, I would swap the two for variety, or use the sans (Avenir) for sidebar articles.\n\nLex -- I hadn't seen Iridium before. I like it!\n\n"
    },
    {
      "time": "17 Nov 2006 — 10:23am",
      "content": "I hadn't either, but I always look at fonts from the same designer first when finding complements. It looked like it would pair well.\n\nTo Steve (the original poster):  \nWhat is the subject matter of the magazine? We might be going in a completely wrong direction for what you need.\n\n- Lex\n\n"
    }
  ]
}
