{
  "id": "29565",
  "title": "pyramid angles [build a pyramid]?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Anyone good at math?\n\nI have wood thats 3/4 inch thick. if I'm cutting out four equilateral triangles, what angle do I cut the edge at to make sure the sides fit together?\n\nit isn't a 45 degree angle is it?\n\n",
  "author": "macman",
  "time": "16 Nov 2006 — 11:17pm",
  "uid": "13793",
  "comments": [
    {
      "time": "17 Nov 2006 — 2:02am",
      "content": "Are you building a 'classic' pyramid? The Great One has angles of 51.51 degrees.\n\n"
    },
    {
      "time": "17 Nov 2006 — 3:52am",
      "content": "Are you making a five-sided pyramid (with a square base) or a four-sided pyramid (triangular base)? I guess, since you mention 45º, that it is the former. The trouble you face is that compound angle cuts are required.  \nThe formula you need is here  \n [http://www.woodcentral.com/bparticles/miter\\_formula.shtml](http://web.archive.org/web/20141030072212/http:/www.woodcentral.com/bparticles/miter_formula.shtml \"http://www.woodcentral.com/bparticles/miter\\_formula.shtml\")\n\nbtw 45º is certainly not correct.\n\nTim\n\n"
    },
    {
      "time": "17 Nov 2006 — 6:07am",
      "content": "45% could be correct for the sides of a triangle-base pyramid (though not the base), but it all depends on the proportions of your cube.\n\n"
    },
    {
      "time": "17 Nov 2006 — 8:45am",
      "content": "square base - traditional pyramid\n\n"
    },
    {
      "time": "17 Nov 2006 — 10:19am",
      "content": "Thanks to you I now have a annotated pyramid on my desk. No solution yet and I should be in the pub.\n\n"
    },
    {
      "time": "17 Nov 2006 — 10:47am",
      "content": "The solution is in that formula, but beyond my poor brain, which as you say should be gently marinaded in beer by now.  \nTim\n\n"
    },
    {
      "time": "17 Nov 2006 — 5:34pm",
      "content": "i'm flexible.\n\nif I have sides of a pyramid that are three inches tall. whats the easiest way to make a three or four sided pyramid?\n\n"
    },
    {
      "time": "18 Nov 2006 — 3:29am",
      "content": "Depending on how flexible you are, I would take a piece of wood about 12 inches long\\* and 3 inches wide and deep, make a mark 2.6 inches from one end on each face and using an accurate table saw with a mitre guide set at 30º from right angles to the saw blade and make four cuts, one on each plane, finally cut at right angles to the blade to remove the excess.  \nThe efficacy of this is going to depend on the quality of the wood and saw (and your measurements [and my maths, so double check before you cut], in spite of your best efforts the saw might still remove the tip).  \nThe chances of creating a pyramid of such a small size with wood 3/4 inch thick accurately are slim. Why are you making one? ceremonial burial of a scarab beetle?  \nQuick illustration of what I mean\n\n ![](http://web.archive.org/web/20141030072212im_/http:/typophile.com/files/pyramid_6621.gif)\n\nTim  \n\\* long enough to be able to hold it firmly against the guide and not remove any fingers.\n\n"
    },
    {
      "time": "18 Nov 2006 — 8:18am",
      "content": "The side should form a 60º angle with the base.\n\nSuppose the length of an edge on such a pyramid is 2. Then each equilateral triangle has legth of side 2 and altitude sqrt(3). (Where sqrt is the square root.) If you were to slice the pyramid vertically along a plane containing the center and one edge, you would obtain a 2 by sqrt(3) by sqrt(3) isoceles triangle where the angle between the sides of length sqrt(3) is the angle you need. Applying the Law of Cosines to this triangle gives the angle as 60º.\n\nThis angle will be the same regardless of the size you choose.\n\nThis may be difficult to visualize but I'm not good enough in Illustrator to draw it out.\n\nSo to ensure that it fits together properly with the sides joining to form an edge of the pyramid, you will need to cut each side at 30º (the two together will form the 60º whole).\n\nD Riley\n\n"
    }
  ]
}
