{
  "id": "29622",
  "title": "Typography on the web",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Is anyone aware of a JavaScript library or a collection of JS/CSS code snippets that takes care of finer points of typography such as first line paragraph indents (as opposed to vertical spaces between paragraphs)?\n\nI have not been able to find any yet, although it \\*seems\\* do-able. If it does not yet exist, I would like to try and tackle that, or suggest that the experienced coders look into it. It could, for example, become a plug-in module to the JQuery [www.jquery.com] JavaScript library.\n\nI’m hoping we can get a list started. What sort of typographic conventions are we neglecting because they are not easily typeset on the web?\n\n [‹ Career changer from science to design. Where do I begin?](http://web.archive.org/web/20071219001408/http:/typophile.com/node/32383 \"Go to previous forum topic\") [[search] Perform dynamic searches in Google ›](http://web.archive.org/web/20071219001408/http:/typophile.com/node/32357 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071219001408/http://typophile.com/user/14945\" title=\"View user profile.\">mikefats</a>",
  "time": "<br>",
  "uid": "14945",
  "comments": [
    {
      "time": " 19.Nov.2006 12.12pm",
      "content": "The use of real Small Caps is one that comes to my mind but I am not expert in coding for the web, you might find these useful :\n\n[http://webtypography.net](http://web.archive.org/web/20071219001408/http:/webtypography.net/ \"http://webtypography.net\")\n\n[http://typophile.com/node/28496](http://web.archive.org/web/20071219001408/http:/typophile.com/node/28496 \"http://typophile.com/node/28496\")\n\n[http://typophile.com/node/18418](http://web.archive.org/web/20071219001408/http:/typophile.com/node/18418 \"http://typophile.com/node/18418\")\n\n"
    },
    {
      "time": " 19.Nov.2006 12.13pm",
      "content": "Given the scrolling nature of the Web I would imagine that space between paragraphs is preferable to indented paragraphs for most forms of text setting.\n\nIndented paragraphs, like fully justified setting, is easy with CSS but few use them becasue they are less than optimal than the HTML default.\n\nCheers, Si\n\n"
    },
    {
      "time": " 20.Nov.2006 6.50am",
      "content": "“Is anyone aware of a JavaScript library or a collection of JS/CSS code snippets that takes care of finer points of typography such as first line paragraph indents (as opposed to vertical spaces between paragraphs)?”\n\nCSS:\n\np {  \ntext-indent: 4em;  \n}\n\nAlso, the best way to approach web typography is to let go of the ’finer points’ of control that you would normally have on paper.\n\n“The use of real Small Caps is one that comes to my mind”\n\nAgain, CSS:\n\nyourTag {  \nfont-variant: small-caps  \n}\n\n“Given the scrolling nature of the Web I would imagine that space between paragraphs is preferable to indented paragraphs for most forms of text setting.”\n\nI agree (though other’s may not, of course). The web is often more of a ’pan and scan’ medium where people are looking for excerpts vs. sitting down and reading an article from start to finish. Having the visual breaks between paragraphs makes that task a bit easier.\n\nWhatever you do, don’t indent AND have spaces between paragraphs. Way too redundant for my tastes. ;o)\n\n"
    },
    {
      "time": " 20.Nov.2006 8.47am",
      "content": "Thanks for the resources, Alessandro. [www.webtypography.net](http://web.archive.org/web/20071219001408/http:/www.webtypography.net/ \"www.webtypography.net\") is particularly useful. It had a solution to my original question, too:\n\np + p {  \n text-indent: ...  \n}\n\n(“p + p” will intentionally ignore the first line)\n\n"
    },
    {
      "time": " 20.Nov.2006 8.48am",
      "content": "Simon, you don’t <cite>have</cite> to scroll <cite>vertically</cite> though. :-)\n\nhhp\n\n"
    },
    {
      "time": " 20.Nov.2006 9.25am",
      "content": "True, some sites required no scrolling, but now even the Trib has gone ’traditional’ :-( [http://www.iht.com/articles/2006/11/20/news/lego.php](http://web.archive.org/web/20071219001408/http:/www.iht.com/articles/2006/11/20/news/lego.php \"http://www.iht.com/articles/2006/11/20/news/lego.php\")\n\n"
    },
    {
      "time": " 20.Nov.2006 9.42am",
      "content": "This is one of those rare cases where, over time, web developers collectively came to their senses and realized the browser’s own simple vertical scrolling capabilities was infinitely more user friendly than any iframe/div/javascript/sideways scrolling widget could ever be. ;o)\n\n"
    },
    {
      "time": " 20.Nov.2006 10.21am",
      "content": "I meant horizontal. :-)  \nSuperior to vertical scrolling in a number of ways.\n\nhhp\n\n"
    },
    {
      "time": " 20.Nov.2006 11.21am",
      "content": "“Superior to vertical scrolling in a number of ways.”\n\nAnd, alas, inferior in many more... ;o)\n\n"
    },
    {
      "time": " 20.Nov.2006 11.28am",
      "content": "The inferiorities of horizontality come from lousy software: easy to fix.  \nIts superiorities come from our DNA; don’t try adjusting your retina.\n\nhhp\n\n"
    },
    {
      "time": " 20.Nov.2006 1.45pm",
      "content": "“The inferiorities of horizontality come from lousy software”\n\nThat and it comes from lousy hardware and what people are used to after 3+ decades of computer use.\n\nNot to mention print tradition well before that...\n\nI can’t think of any real benefits to horizontal scrolling on a web page off the top of my head for anything even partially text based. What did you have in mind?\n\n"
    },
    {
      "time": " 20.Nov.2006 2.32pm",
      "content": "3 decades? Yeah, 100 millennia pales in comparison. Print tradition? Ever seen a book spread? No scrolling, and at least two columns, often four. :-) Scrolling is for scrolls, and guess which way scrolls were held. Benefits on a web page? Hey, wild guess: is your screen wider than it is tall? Dude, the overall benefit is crushing.\n\nhhp\n\n"
    },
    {
      "time": " 20.Nov.2006 5.03pm",
      "content": "I’m with Hrant, this will turn the whole Web paradigm on it’s side. :-)\n\n"
    },
    {
      "time": " 21.Nov.2006 4.46am",
      "content": "After all your great help last week I’m now looking for articles (not images) relating to/commenting on, ’Is typography Art or craft?’  \nYour own opinions also wanted.  \nSecond question, how did you people get to be so knowledgeable ?\n\nThanks Stephen\n\n"
    },
    {
      "time": " 21.Nov.2006 5.46am",
      "content": "CSS Styling for Print and Other Media  \nby Ian Lloyd (in Articles)  \nNovember 20th, 2006\n\n[http://www.digital-web.com/articles/css\\_styling\\_for\\_print\\_and\\_other\\_medi...](http://web.archive.org/web/20071219001408/http:/www.digital-web.com/articles/css_styling_for_print_and_other_media/ \"http://www.digital-web.com/articles/css\\_styling\\_for\\_print\\_and\\_other\\_media/\")\n\n.\n\nFine Typography for the Web  \nPresented by Dave Shea  \nJune 15th, 2006\n\n[http://www.mezzoblue.com/presentations/2006/@media/](http://web.archive.org/web/20071219001408/http:/www.mezzoblue.com/presentations/2006/@media/ \"http://www.mezzoblue.com/presentations/2006/@media/\")\n\n"
    },
    {
      "time": " 21.Nov.2006 7.40am",
      "content": "Stephen, it’s bad form to hijack a thread like this - consider starting a new one.\n\n"
    },
    {
      "time": " 22.Nov.2006 11.04am",
      "content": "Dude, screen size/resolution/orientation is not indicitave of browser viewport size/resolution/orientation.\n\nColumns would be nice, but screens are such low resolution as it is, there’s little point in pushing for it until we have digital displays pushing closer to the resolution capabilities of good ol’ paper.\n\n"
    },
    {
      "time": " 22.Nov.2006 11.06am",
      "content": "“Second question, how did you people get to be so knowledgeable ?”\n\nWhy would you think we were knowledgeable? We’re opinionated. Big difference. ;o)\n\n"
    },
    {
      "time": " 22.Nov.2006 11.16am",
      "content": "\\> screen size/resolution/orientation is not indicitave  \n\\> of browser viewport size/resolution/orientation.\n\n?  \nI assume you also drive across lanes instead of down them?\n\n\\> Columns would be nice, but screens are such low resolution as it is\n\nWell, horizontal scrolling!\n\nhhp\n\n"
    },
    {
      "time": " 22.Nov.2006 1.45pm",
      "content": "“I assume you also drive across lanes instead of down them?”\n\nThe problem is that you are assuming. Again, you can’t assume anything about my web browser based on my screen (without standing here next to me).\n\nIt sounds like you have some preference to horizontal scrolling, which is fine and all, but most usability testing seems to indicate that people prefer vertical scrolling when it comes to web pages.\n\n"
    },
    {
      "time": " 22.Nov.2006 2.32pm",
      "content": "\\> you can’t assume anything about my web browser\n\nWe can -and need to- assume all kinds of things to be able to function. Like when we’re driving, we need to assume that the car next to us will NOT abruptly start driving across the lanes. But more to the point: we can <cite>confidently</cite> assume various things about the <cite>typical</cite> web browser. Like you know the DVD message that says “This movie has been modified to fit your screen”? I hate that, because they don’t know what my screen is. But if they said “modified to fit the typical screen” then I wouldn’t complain.\n\n\\> most usability testing seems to indicate that people prefer vertical scrolling\n\nCompared to horizontal, or compared to none?  \nWhat are the exact details of this testing?  \nMany tests suck.\n\nhhp\n\n"
    },
    {
      "time": " 22.Nov.2006 2.37pm",
      "content": "There might be something to the horizontal scrolling argument. Maybe the resistance to (discomfort with) scrolling this way has to do with the position of the scrollbar? It could well have to do with right handedness and the vertical scroll conveniently placed to the right of the content. With a horizontal scrollbar reaching over way to the left to advance to the next column just does not _feel right_. Do the usability studies have any insights into why people prefer vertical / dislike horizontal scrolling?\n\nJust a speculation, but as people get used to the trackpad and mouse wheel scrolling (I have the Apple’s Mighty Mouse - unidirectional ball in mind), our natural reading habits may resurface and “turn the web on its side.”\n\n"
    },
    {
      "time": " 22.Nov.2006 3.20pm",
      "content": "On the other hand - just reflecting on how I read on the web here - there isn’t as much effort required in reading a single column as there is with navigating multiple columns.\n\nWhen the text is all in one column, I read 10-15 lines, scroll down, repeat. The eye doesn’t move across great distances, as it would when jumping from the bottom of one column to the top of the next.\n\n"
    },
    {
      "time": " 22.Nov.2006 4.28pm",
      "content": "The “effort cost” of scrolling and recovering your location  \nis greater than for saccading to a new column.\n\nhhp\n\n"
    },
    {
      "time": " 19.Mar.2007 8.37pm",
      "content": "Ok, one more thing to add...\n\nI have come across a freeware application for OS X which lays out copied text into columns. No vertical scrolling - strictly horizontal.\n\nGive it a try and see if it makes on-screen reading more comfortable: [http://amarsagoo.info/tofu/index.shtml](http://web.archive.org/web/20071219001408/http:/amarsagoo.info/tofu/index.shtml \"http://amarsagoo.info/tofu/index.shtml\")\n\nMichael\n\n"
    }
  ]
}
