{
  "id": "29637",
  "title": "what is the name of the 1st ever serif font?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Times Roman? is it known who decided to have the serif for a neater, clear cut line in stone?\n\n",
  "author": "missgiggles",
  "time": "20 Nov 2006 — 3:52am",
  "uid": "14600",
  "comments": [
    {
      "time": "20 Nov 2006 — 4:17am",
      "content": "What??? Times New Roman was designed by Monotype in ca. 1930 for the Times of London. Times Roman is the Linotype version of this same face. Therefore, Times Roman cannot be the first serif typeface!\n\nThe first typeface with serifs on it would have been cut in Italy sometime after 1460. Remember, before Gutenberg invented printing in the west in ca. 1450, there were no typefaces or fonts in Europe! (In China and Korea, movable metal type seems to have been invented earlier; Gutenberg probably had no knowledge of these things, though).\n\nLettering and calligraphy predate typefaces by about several thousand years. But lettering or calligraphic styles are just that; they are styles, not typefaces.\n\nSo, now that we've got that straight, the first serif typefaces may have been cut by Conrad Sweynheim and Arnold Pannartz, two German printers who left Mainz for Italy, openning the first printing press there. But it is debatable whether their typefaces are really serifed. Nicholas Jenson's typefaces (ca. 1470 in Venice) are often considered the world's first serif types.\n\nBut these typefaces didn't really have names. Names became attached to typefaces later, when typefounders began marketing their fonts to other printers.\n\nThe first letters with serifs on them were probably carved into stone by the Romans. Again, these letters don't really have names either. There are sometimes refered to now as Capitalis Monumentalis, or just monumental Roman lettering. The stone-carved letters on the Trajan Column in Rome are probably the most famous examples of these.\n\nBut I have no idea what you are really asking!\n\n"
    },
    {
      "time": "20 Nov 2006 — 4:47am",
      "content": "Although names is what last after a person or a city dies, you should know that the invention of the typophile scroll bar is as old as the papyrus roll ; this because to form the long strip that a scroll required, a number of such sheets of papyrus were united, placed so that all the horizontal fibres parallel with the roll's length were on one side only. So, for your interest, one modern book you can flip the pages is \"The Nymph and the Grot\" by James Mosley (1999).\n\n"
    },
    {
      "time": "20 Nov 2006 — 6:55am",
      "content": "Duh, Times New Roman was invented by the Romans. ;o)\n\n"
    },
    {
      "time": "20 Nov 2006 — 8:15am",
      "content": "Is that squooshed ?\n\n[http://www.vannacalzature.it/Storia\\_italiano/romani.htm](http://web.archive.org/web/20131107123400/http:/www.vannacalzature.it/Storia_italiano/romani.htm \"http://www.vannacalzature.it/Storia\\_italiano/romani.htm\")\n\nJust learnt the acronym ROLF\n\n"
    },
    {
      "time": "20 Nov 2006 — 11:36am",
      "content": "Rolling On **L** inoleum **F** ainting?\n\nDan, why do you think those diamonds in Gutenberg's font don't count as serifs?\n\nhhp\n\n"
    },
    {
      "time": "20 Nov 2006 — 12:10pm",
      "content": "I think the question was asked when the first Roman typeface was made. I think the answer is that sometime just before it was used in 1470, Nicolas Jenson or someone working for him made one. Then, depending what you meant by serif, font and first, people can argue.\n\n"
    },
    {
      "time": "20 Nov 2006 — 12:18pm",
      "content": "That is opening up a whole new can of worms.\n\n"
    },
    {
      "time": "20 Nov 2006 — 12:30pm",
      "content": "I'd disagree with you on Nicholas Jensen ... if I had all my notes with me. But then again, this is interesting enough to make a point of looking through my notes.\n\n( Edit: Make that, I'd \"kindly\" disagree with you. )\n\n"
    },
    {
      "time": "20 Nov 2006 — 12:43pm",
      "content": "See, I told you that giggles is pulling our tits!\n\nMuzz\n\n"
    },
    {
      "time": "20 Nov 2006 — 12:54pm",
      "content": "Do you disagree with me because you don't think that Jensen's letters had serifs,\\* or because he wasn't the first? If he wasn't the first, were Sweynheim & Pannartz first, or did someone else do them first in the intervening seven years or so?\n\n\\* Do your reasons for Jensen's serifs not being serifs match any of the Jensen diamond ideas in The Stroke?\n\nP.S.: Hrant, if the Jensen cut-off diamonds aren't serifs, then the Textura diamonds, a la Gutenberg's letters, certainly aren't :-)\n\n"
    },
    {
      "time": "20 Nov 2006 — 12:54pm",
      "content": "\"See, I told you that giggles is pulling our tits!\"\n\nLOL!!! That must have a whole different meaning down under Muzz :-)\n\nChrisL\n\n"
    },
    {
      "time": "20 Nov 2006 — 12:55pm",
      "content": "\\> _See, I told you that giggles is pulling our tits!_\n\nHere, here. I agree!\n\n"
    },
    {
      "time": "20 Nov 2006 — 12:57pm",
      "content": "I was kindly disagreeing the David, not you Dan.\n\n"
    },
    {
      "time": "20 Nov 2006 — 1:01pm",
      "content": "Oh.\n\n"
    },
    {
      "time": "20 Nov 2006 — 1:13pm",
      "content": "\\*Laughing my head off and rolling on floor laughing so hard\\* i am not 'pulling tits' here and definately not pulling my own :D just shows how much i've learnt in my typography lessons at university and how hard the tutors work to get that knowledge to us :D i'm in my 2nd yr but not of a typographic course but graphics and please dont say 'how the hell did you pass your 1st yr?' i did even though i dont know what the 1st ever serif font to be designed is called let alone who even attempted the neat cuts, making them into serifs. sorry guys and thats why i'm on here to learn more than what my tutor gives. I AM interested in type and want to be as good as you all one day so can't i have a 2nd chance on here. please dont throw me out :D and NO, i'm not pulling my tits on this one ;)\n\n"
    },
    {
      "time": "20 Nov 2006 — 2:15pm",
      "content": "missgiggles,\n\nRead the book \"Origin of the Serif\" for a very good an readable explanation of the serif.\n\n[http://www.amazon.com/Origin-Serif-Edward-M-Catich/dp/0962974005/sr=1-1/...](http://web.archive.org/web/20131107123400/http:/www.amazon.com/Origin-Serif-Edward-M-Catich/dp/0962974005/sr=1-1/qid=1164060998/ref=sr_1_1/102-2875130-0673765?ie=UTF8&s=books \"http://www.amazon.com/Origin-Serif-Edward-M-Catich/dp/0962974005/sr=1-1/qid=1164060998/ref=sr\\_1\\_1/102-2875130-0673765?ie=UTF8&s=books\")\n\nChrisL\n\n"
    },
    {
      "time": "20 Nov 2006 — 2:27pm",
      "content": "You probably passed your first year because you're not afraid to  \nask questions. For a teacher, that is an increasingly rare delight.\n\nhhp\n\n"
    },
    {
      "time": "20 Nov 2006 — 7:45pm",
      "content": "I find the idea that Times Roman predated the printing press an amusing balance to the idea that Times Roman didn't exist before Microsoft Word (as Republican bloggers claimed in 2004).\n\n"
    },
    {
      "time": "20 Nov 2006 — 9:21pm",
      "content": "How about the Korean type used here\n\n[http://www.jikjiworld.net/content/english/jikji/index.jsp?top=01&sub=2&l...](http://web.archive.org/web/20131107123400/http:/www.jikjiworld.net/content/english/jikji/index.jsp?top=01&sub=2&left=01&url=mn010/mn010_030.jsp \"http://www.jikjiworld.net/content/english/jikji/index.jsp?top=01&sub=2&left=01&url=mn010/mn010\\_030.jsp\")\n\nit's a bit serify from 1337\n\n[http://en.wikipedia.org/wiki/Jikji](http://web.archive.org/web/20131107123400/http:/en.wikipedia.org/wiki/Jikji \"http://en.wikipedia.org/wiki/Jikji\")\n\n"
    },
    {
      "time": "21 Nov 2006 — 4:00am",
      "content": "[Cuneiform](http://web.archive.org/web/20131107123400/http:/www.wsu.edu/~dee/GLOSSARY/CUNEI.HTM) although cut in clay originally not stone.\n\nTim\n\n"
    },
    {
      "time": "21 Nov 2006 — 8:02am",
      "content": "Eve.\n\npeace\n\n"
    },
    {
      "time": "21 Nov 2006 — 8:08am",
      "content": "Some might say Adam had the serif:-)\n\nChrisL\n\n"
    },
    {
      "time": "21 Nov 2006 — 8:38am",
      "content": "When the Word was made flesh, was it originally serif or sans serif?\n\n"
    },
    {
      "time": "21 Nov 2006 — 8:45am",
      "content": "Aye, there is the rib :-)\n\nChrisL\n\n"
    },
    {
      "time": "22 Nov 2006 — 5:39pm",
      "content": "I thought Adam was a ligature - at least when he was in action…\n\npeace\n\n"
    },
    {
      "time": "22 Nov 2006 — 8:34pm",
      "content": "Though many historians attribute the development of serifs to the ancient Romans, it was in fact of Egyptian origin, particularly \"slabs\".\n\nThe association of the term \"feet\" as being synomonous with the typographic term \"serif\" was due to the fact that these terminals were originally depicted in hieroglyph (see below):\n\n ![](http://web.archive.org/web/20131107123400im_/http:/typophile.com/files/Hieroglyph2_5694.jpg)\n\nFrequently these \"feet\" were situated on a rendered baseline (especially on bird feet):\n\n ![](http://web.archive.org/web/20131107123400im_/http:/typophile.com/files/hieroglyph_birdfeet_5494.jpg)\n\nThe illustration below shows the direct correlation between bird feet and serifs used for the lowercase \"i\" --\n\n ![](http://web.archive.org/web/20131107123400im_/http:/typophile.com/files/turkey_diag_4257.jpg)\n\nIn addition to the development of formalized serifs, early hieroglyphs of birds suggest that the Egyptians invented the flared terminal and semi-sans as clearly shown below:\n\n ![](http://web.archive.org/web/20131107123400im_/http:/typophile.com/files/turkey_sans_6337.jpg)\n\nWhich is a long about way of wishing you all a Happy Thanksgiving!\n\n"
    },
    {
      "time": "22 Nov 2006 — 11:19pm",
      "content": " **speechless...**\n\nGod. It's 11 PM. I was trying to relax and wind down. Then I see this. Thanks. Now I'll never get to sleep.\n\n<cite>So here's a question:</cite>  \nEven though there were no \"typefaces\" proper, by the 15th century the alphabets were pretty much standardized, weren't they? I mean, the early puch cutters weren't really \"designing\" new types, they were copying standard types in use by the scribes of that era.\n\nIt's a technology thing. Would we say that typefaces were never designed before Postscript just because no one had done so yet?\n\n"
    },
    {
      "time": "23 Nov 2006 — 6:00am",
      "content": "\\>I mean, the early puch cutters weren’t really “designing” new types, they were copying standard types in use by the scribes of that era.\n\nJenson and Griffo based their types on existing letter forms from scribes. However, they figured out how to give the letters and words more even color than hand-written letters, and so made type more readable than hand writing. This sculpting of letters for even color was a huge advance--which we still arguably haven't improved upon significantly. Also each scribe to some extent would have their own hand--and type designer his own style.\n\n"
    },
    {
      "time": "24 Nov 2006 — 10:57am",
      "content": "\\> we still arguably haven’t improved upon significantly.\n\nExactly because we're stuck on the succubus that  \nis even color, and have yet to truly leverage notan.\n\nhhp\n\n"
    },
    {
      "time": "25 Nov 2006 — 6:21am",
      "content": "sorry Alessandro. i cant read that language on [http://www.vannacalzature.it/Storia\\_italiano/romani.htm](http://web.archive.org/web/20131107123400/http:/www.vannacalzature.it/Storia_italiano/romani.htm \"http://www.vannacalzature.it/Storia\\_italiano/romani.htm\")\n\n"
    },
    {
      "time": "25 Nov 2006 — 7:39am",
      "content": "thanks Dan for that info but i'm still confused over lowercase serif fonts. were they invented during the Capitalis Monumentalis? i mean, was it only uppercase during that time? what about small caps? whst is curvise and semi cursive lettering? please explain. Thanks for your time, very highly appreciated :)\n\n"
    },
    {
      "time": "25 Nov 2006 — 7:41am",
      "content": "OMG! wow, that is amazing Norbert Florendo! i shall keep that in mind :D\n\n"
    },
    {
      "time": "25 Nov 2006 — 8:00am",
      "content": "\\>but i’m still confused over lowercase serif fonts.  \n\\>were they invented during the Capitalis Monumentalis?\n\nYou still do not seem to understand! Before Gutenberg (or whoever else might have been first, perhaps someone in China or Korea) cast his first fonts, there weren't any typefaces and there weren't any fonts. Their were many different ways to write or carve the alphabet, but none of these were types or fonts. Fonts are means of mechanically reproducing a specific design over and over again.\n\nLowercase letters were codified centuries after the Romans settled on the forms of what we now call uppercase letters. An argument could be made that lowercase letters first appeared before 300 AD, but a good simple answer is that they didn't arise until the early middle ages.\n\n\\>i mean, was it only uppercase during that time?\n\nYep. Well, only sort of. You see, since there was no \"lower\"case, there could not be any \"upper\"case, now could there? There was only one case. It looked a lot like what we call uppercase today. But even when the first \"lowercase\" letters were written, they weren't quite seen as an addition to uppercase letters, but rather as a totally separate style, entity, or evolution. Some scribe wrote all in \"uppercase\", some all in \"lowercase\"—but they saw the two as different independent styles. The mixing of upper and lowercase letters together would only came later, probably in the high middle ages.\n\n\\>what about small caps?\n\nSmall Caps are really a typographic invention in my opinion. That is, they weren't invented until \"typography\" was already around, that is, after the invention of typefaces in 1450 and thereafter. If I recall correctly, Aldus Manutius (Venice, ca. 1500) made use of small caps in his books. But I can't verify that, nor do I know if other printers before him used them or not. So, no exact date here from me!\n\n\\>whst is curvise and semi cursive lettering? please explain.  \n\\>Thanks for your time, very highly appreciated :)\n\nThis is a bit too many questions ;-)  \nPerhaps someone else will step in and answer this one for. But if I were you (and I was in your situation once, not all that many years ago…) I would go to your University library and read some old books about the development of the alphabet, of writing, and of printing. Then you'll know the answers to these questions inside and out.\n\n"
    },
    {
      "time": "25 Nov 2006 — 8:14am",
      "content": "thankyou so much Dan. i have been reading too many books and so much information to take in and havent been able to digest anything because theres just too much to understand and i keep getting muddled up and cant remember things and order of it all but anyway thankyou for sharing your knowledge. i'm very greatful.\n\n"
    },
    {
      "time": "25 Nov 2006 — 8:37am",
      "content": "Great stuff Norbert!\n\nhhp\n\n"
    },
    {
      "time": "25 Nov 2006 — 1:05pm",
      "content": "Maybe it would help to define \"font\" or \"fount\" and exactly where the terms Upper and Lower <cite>case</cite> came from.\n\n"
    },
    {
      "time": "26 Nov 2006 — 9:11am",
      "content": "David Bolten of [Alembic Press](http://web.archive.org/) presents wonderfully in depth references to type job cases:\n\n ![](http://web.archive.org/web/20131107123400im_/http:/typophile.com/files/california_typecase_6492.jpg)\n  \n**Case (Typecase)**  \na wooden drawer partitioned into many small boxes, used to store the separate type characters. The cases are held in a frame or rack, often with a bracket on the top to allow two cases (eg an **upper** and **lower** ) to be held open one above the other, and in front of which the compositor stands whilst setting the job. Some cases have no internal partitions, and are used to store wood letter (or blocks, dingbats, etc.). Over 200 different styles of case are shown here, but there are many others. \n\n**[English Upper Case](http://web.archive.org/web/20131107123400/http:/members.aol.com/alembicprs/uppcase.htm)**\n\n**[Typecase Index](http://web.archive.org/web/20131107123400/http:/members.aol.com/alembicprs/selindx.htm)**\n\n"
    },
    {
      "time": "26 Nov 2006 — 9:36am",
      "content": "\\> _OMG! wow, that is amazing Norbert Florendo! i shall keep that in mind_ :D\n\nBTW -- Miss Giggles, I'm glad you enjoyed the humor, but I hope you understand I was just pulling the turkey's leg, lest you quote me as a reference. ;-)\n\n"
    },
    {
      "time": "26 Nov 2006 — 11:04am",
      "content": "Nice links on the cases, Norbert! Your graphic is of the California Job Case. This combined upper and lowers cases into one.\n\n"
    },
    {
      "time": "26 Nov 2006 — 11:26am",
      "content": "\\> combined\n\nCombine **s**. :-)\n\nhhp\n\n"
    },
    {
      "time": "26 Nov 2006 — 11:28am",
      "content": "Thanks, William,\n\nI couldn't find a graphic of the [English Upper Case](http://web.archive.org/web/20131107123400/http:/members.aol.com/alembicprs/uppcase.htm) since the linked illustration is actually constructed from html special characters placed over an \"empty case\" illustration. I hope Miss Giggles follows the link for a more detailed explanation and illustration.\n\n"
    },
    {
      "time": "27 Nov 2006 — 5:50am",
      "content": "Happy Gobble Day Norbert!\n\nChrisL\n\n"
    },
    {
      "time": "27 Nov 2006 — 12:45pm",
      "content": "&2u2, Chris.  \nI'm surprized you haven't made a reference to \"Happy Feet\" in response to my bird illustrations :-)\n\n"
    },
    {
      "time": "27 Nov 2006 — 6:28pm",
      "content": "I am not familiar with it so I just Googled it. A new movie eh, now I get it. I wasn't birdbrained enough topeck through the logic until now :-)\n\nChrisL\n\n"
    },
    {
      "time": "28 Nov 2006 — 10:51am",
      "content": "---------------------------------------------------------  \nWARNING!!!! THE \"EGYPTIAN TURKEY SERIFS\"  \nREFERENCES ABOVE WAS ONLY A \"JOKE\"!  \n---------------------------------------------------------\n\nMy examples of hieroglyphic \"feet\" being the origins of serifs had been taken seriously by some readers, and for that I apologize.  \nSince I am a strong supporter of typographic education, I will be more cautious when presenting information \"tongue-in-cheek\".\n\n-- Norbert Florendo\n\n"
    },
    {
      "time": "28 Nov 2006 — 4:00pm",
      "content": "OMG! i am soooo MAD at you Mr Norbert! students like me are really going to take your word. I think you need a spanking for being a naughty boy. bring back the cane lol :D only messing, WARNING! DON'T TAKE THIS SERIOUS! hahaha. but please dont do it again NF. it really confused me :D\n\n"
    },
    {
      "time": "28 Nov 2006 — 5:03pm",
      "content": "IIIIIII got it. IIIIIII'm a student.\n\nSo there.\n\n"
    },
    {
      "time": "18 Dec 2006 — 11:02am",
      "content": "Not to revive this dead thread, but you might want to look up Adolf Rusch, Miss Giggles. From what I've seen, his roman predates even Sweynheym and Pannartz's. Odd, since he printed in Germany.\n\n"
    },
    {
      "time": "19 Dec 2006 — 6:24am",
      "content": "Norbert, just found this thread and your comment about feet and serifs is the best! A hearty and belated thanks for the laugh!\n\n"
    },
    {
      "time": "22 Dec 2006 — 11:02pm",
      "content": "Not to exclude fraktur I hope (last time I looked they had \"serifs\"),I believe the first acknowledged typeface name (posthumous) is the DK-Type used prior to B42 (42-line Bible, aka the Gutenberg Bible) but also in the later B36 (36-line Bible).\n\nGerald\n\n"
    }
  ]
}
