{
  "id": "29649",
  "title": "Surfboard Company Logotype Critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi everyone,\n\nI did the logo below for this Nicaraguan/UK environmentally sustainable surfboard company a few years ago...\n\n ![](http://web.archive.org/web/20130817054737im_/http:/typophile.com/files/OGfrontLogo_5459.gif)\n\nNow they are getting ready to go global and a makeover seemed in order.\n\nThey produce a range of hand crafted hollow balsa and natural fibre surfboards that compete in both performance and price with the usual polychemical factory boards.\n\nKey words for the brand image include...\n\nEnvironmental  \nQuality / Craftsmanship  \nHigh Performance  \nClassic / Timeless  \nSlightly Retro  \nStylish / Cool\n\nSo is this new version better than the old...\n\n ![](http://web.archive.org/web/20130817054737im_/http:/typophile.com/files/OGLogoV2Proof01a_5364.jpg)\n\nHere's a simulated decal on a balsa and hemp board...\n\n ![](http://web.archive.org/web/20130817054737im_/http:/typophile.com/files/OGLogoV2Proof01b_4632.jpg)\n\nIs the design any good at all? Any feedback would be great. I feel a real responsibility for this one.\n\n",
  "author": "wormwood",
  "time": "20 Nov 2006 — 1:46pm",
  "uid": "14065",
  "comments": [
    {
      "time": "20 Nov 2006 — 3:18pm",
      "content": "The original face seems a bit trendy, but the current one seems, perhaps, generic. I like the wave and taking it down to one looks very strong, nice, and pretty cool, one gets to enjoy the details more in the singular form. Keeping it in the center creates a nicer timing to read the name, as well. However, the letters don't seem oceanic but do seem \"green\", As for your keywords, I am only feeling the \"Classic\" and the \"Environmental\".\n\nCan't wait to see where this thread goes. Product sounds awesome. [http://www.oceangreen.org/](http://web.archive.org/web/20130817054737/http:/www.oceangreen.org/ \"http://www.oceangreen.org/\")\n\n[Choz Cunningham](http://web.archive.org/web/20130817054737/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20130817054737/http:/www.exclamchine.com/)  \n [The Snark](http://web.archive.org/web/20130817054737/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "20 Nov 2006 — 3:58pm",
      "content": "I agree - the mark and the type do not match. I do prefer the new treatment with the mark in the centre though.\n\nWhat about going even more \"retro\" with the type - not quite Cooper Black, but in that direction. I can see something fat and just a little swashy working.\n\n- Lex\n\n"
    },
    {
      "time": "20 Nov 2006 — 5:47pm",
      "content": "The wave is far stronger in your newer incarnation. Removing the earlier drop shadow accentuates the form. Using it once rather than twice also makes it more dynamic and captures the power of a surfable wave.\n\nUnfortunately the type looks uptight and disconnected from the forward surge of the wave. The type lacks any sense of attitude, so keep investigating possibilities - I agree with Lex that it's worth considering something round or chunky a la Cooper Black. It could provide nice contrast for the angularity of the mark. The mark itself is exciting.\n\n"
    },
    {
      "time": "20 Nov 2006 — 6:26pm",
      "content": "OK, ok, not saying this is better, but I was just playing around with ideas. The font is Acorn Swash, from Ingrimayne Type / Robert Schenk. If I really were going to work in it, I would tweak it by replacing the swashes with something even more reminiscent of your circular wave.\n\n ![](http://web.archive.org/web/20130817054737im_/http:/typophile.com/files/OGLogoV2Acorn_6032.gif)\n\n"
    },
    {
      "time": "20 Nov 2006 — 11:07pm",
      "content": "Not sure if that one looks good in an all-caps setting.\n\nI would recommend something like Saracen from H&FJ. It's too bad that it's the only one of the Proteus Project types without an Italic, since I think you definitely need a slant to the type to match the mark.\n\n- Lex\n\n"
    },
    {
      "time": "21 Nov 2006 — 4:21am",
      "content": "Is it blasphemous here to suggest hand lettering? Perhaps something where 'Ocean' is curved to match its side of the image, and 'green' the other way? like: (((((0)))))\n\n[Choz Cunningham](http://web.archive.org/web/20130817054737/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20130817054737/http:/www.exclamchine.com/)  \n [The Snark](http://web.archive.org/web/20130817054737/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "22 Nov 2006 — 11:53am",
      "content": "Thanks guys for the feedback so far, and especially your enthusiasm Choz.\n\nDon't look at their website just yet. It's horrid and since that site was done the boards have improved 1000%. I'm in the process of giving the site a facelift too.\n\nThe original logo type was hand lettering. That was back when i thought that kind of style was cool. The 2 waves in the first design were trying to suggest an O and G.\n\nI considered Cooper Black for the new version (what with the old Beach Boys Pet Sounds connection) but i think that typeface is still too retro despite it's recent trendy resurgence. And i didn't think it's flabby rounded serifs complimented the waves tapered strokes.\n\nA classic / timeless vibe is more important than a retro one. But it also needs to appeal to a youth dominant market as well as the more mature surfer if possible.\n\nOne reason for the choice of font on the new version was to have an O which was perfectly circular (before slanting) both inside and out, so that it balanced with the negative circular space at the center of the wave. Therefore a typeface with a mono stroke width was needed.\n\nTodd, thanks for your visual, but i felt any swirliness in the font may detract from the impact of the wave.\n\nLex, i like your Saracen suggestion. It could inspire a hand lettering job with slightly more subtle and contemporary serifs, maybe a mono stroke width and definately italic.\n\nAnd thanks Bill, for your comment \"The mark itself is exciting\". That's the kind of reassurance i needed :)\n\nBelow is a pic of a leaflet i did for Ocean Green a little while ago which has a more up to date image of one of their boards than what's on the current website. The grungy style was to appeal to a particular surf comp/festival youth audience, but it's been decided to go with a slicker look since then.\n\n ![](http://web.archive.org/web/20130817054737im_/http:/typophile.com/files/OceanGreenEcoFoilThruster01_5018.jpg)\n\n"
    }
  ]
}
