{
  "id": "2964",
  "title": "Question about Serif Capital B",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I have been looking at the relationship between a serif capital B and a serif capital E. I noticed that in some faces, the waist of the B is higher than the central arm of the E. Why is this? It mostly happens in Venetian and Old Roman typefaces (i.e., Monotype Centaur, Adobe Garamond) that have an almost circular capital O and oldstyle proporations. Perhaps it's easier to keep the lobes of the B circular when differences between the top and bottom are a little more exagerrated.. but why not then just adjust the E as well? Does that make the bottom of the E too light? Or is it just a matter of personal preference?\n\n",
  "author": "anonymous",
  "time": "3 Feb 2004 — 4:53pm",
  "uid": "1203",
  "comments": [
    {
      "time": "4 Feb 2004 — 10:54am",
      "content": "\\>Geoffroy Tory's Champfleury   \n   \nIncidentally, you can view thumbnails of one of the volumes [here](http://web.archive.org/web/20131017144239/http:/www.octavo.com/collections/projects/trychf/index.html). _B_ is on page 48, _E_ is on 51.\n\n"
    },
    {
      "time": "4 Feb 2004 — 10:58am",
      "content": "Also, Dürers [here](http://web.archive.org/web/20131017144239/http:/www.octavo.com/collections/projects/duruwm/index.html). Check out pages 140 and 141.\n\n"
    },
    {
      "time": "4 Feb 2004 — 9:19am",
      "content": "It is a matter of classical proportions. You could look into things such as the inscription on Trajan's Column, Geoffroy Tory's Champfleury and the work of Albrecht Durer.\n\n"
    },
    {
      "time": "6 Feb 2004 — 3:46pm",
      "content": "Thanks very much for the response!   \nVery helpful.\n\n"
    },
    {
      "time": "4 Feb 2004 — 9:18am",
      "content": "I think it's mostly a matter of taste, or maybe in the degree of letterwise divergence desired.   \n   \nThere is a different \"dynamic\" in the two letters, though:   \nIn the \"B\" the width of the glyph is proportional to the lopsidedness of the two bowls: the smaller the top, the more the bottom can extend to the right (without looking stretched). And in the \"E\" the height of the waist is limited by the \"empty look\" you mention.   \n   \nhhp\n\n"
    }
  ]
}
