{
  "id": "29652",
  "title": "indesign indents",
  "forum": "Design",
  "tags": [

  ],
  "content": "Heya,\n\nI’m working on setting a (vaguely) diplomatic edition of one of Christine de Pisan’s lesser known works. The scribe uses a pied de mouche to start off what can only loosely be called paragraphs, and then indents all text that comes after. I found this article:\n\n[http://typophile.com/node/17478](http://web.archive.org/web/20070125112112/http:/typophile.com/node/17478)\n\nwhich sort of tackles what I’m going for, but I’m wondering if there’s a way to negatively indent the first line of a paragraph rather than indenting all following lines (which would be a pain because I used hard returns between every line to imitate the manuscript). I hope it’s something simple I’m just not getting.\n\n",
  "author": "<a href=\"user/8858\" title=\"View user profile.\">albrey</a>",
  "time": "<br>",
  "uid": "8858",
  "comments": [
    {
      "time": " 20 November, 2006 - 7:08pm",
      "content": "Do you mean have the first line hanging? Have to say not quite sure exactly what you mean but… To do this, you can indent the entire paragrph and just use equivalent negative values for the first line (so the paragraph might be 5mm while the first line is -5). Sorry if I’ve missed the point  \n—N\n\n"
    },
    {
      "time": " 20 November, 2006 - 7:10pm",
      "content": "I’m confused, if you hard returned each line then you need to treat each line as a separate paragraph. Therefore you can set the first line/paragraph with a left indent of 0 and subsequent lines with a left indent of, say 1 pica - or whatever you decide.\n\nI would have recommended soft returns instead. If you do it that way, then in the paragraph palette you set the first line at whatever your indent is, again let’s say 1 pica, then in the window below it you type in -1p. (In Quark this was a little more clear) This is called a hanging indent.\n\n ![](http://web.archive.org/files/hangingindent_4980.jpg)\n\nAs pointed out in that other thread you can also either do “indent to here” or command-backslash to set up your hanging indent. Lazy but easier if it’s a one off. If you want consistency throughout a longer text better to create the indents you want in the paragraph palette and make style sheets from them.\n\n"
    },
    {
      "time": " 20 November, 2006 - 7:15pm",
      "content": "I say get rid of those hard returns! it’s difficult to think of the advantage of using hard returns when your can use soft returns/leading/space before/after paragraphs, it might be half an hour’s work but I’m sure it would be more frustrating to work with every line as a separate paragraph, maybe I’m missing the point again  \n—N\n\n"
    },
    {
      "time": " 21 November, 2006 - 1:17am",
      "content": "They’re not really paragraphs, though. The scribe almost randomly adds a pied de mouche front of two or three lines a page, kind of like a bullet point (which is why the other discussion almost answered my questions).\n\nTo clarify, I just wanted to know if there is a way to set the indent to -1p without first setting the indent of the whole text to 1p to balance it out. But that’s easy enough.\n\n"
    }
  ]
}
