{
  "id": "29650",
  "title": "Some wishes",
  "forum": "Build",
  "tags": [

  ],
  "content": "When you guys make new fonts — or revisit older ones — can you remember to kern quotedblleft quoteleft, so “’He said’” doesn’t look so bad? And quotedblleft quoteright, for “’Tis of thee I mutter . . .” I suppose those in the UK would prefer the reverse, and it couldn’t hurt, along with the right/dblright.\n\nAnd for the two or three of us who still use type for book printing, kerning with superscript numbers would be very helpful. Footnote calls usually follow periods, commas, and quotemarks. If those could be kerned, we could struggle on & kern the other superscripts by hand.\n\nAnother wish would be a set of long descenders for type designs where they would be appropriate.\n\n [‹ Font dimensions - generate problem](http://web.archive.org/web/20071216073059/http:/typophile.com/node/29662 \"Go to previous forum topic\") [Building Pixel Fonts ›](http://web.archive.org/web/20071216073059/http:/typophile.com/node/28823 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071216073059/http://typophile.com/user/5094\" title=\"View user profile.\">charles_e</a>",
  "time": "<br>",
  "uid": "5094",
  "comments": [
    {
      "time": " 20.Nov.2006 3.09pm",
      "content": "How long are the long descenders you yearn for? On all fonts, or just those with regularly rather short ones?\n\n[Choz Cunningham](http://web.archive.org/web/20071216073059/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20071216073059/http:/www.exclamchine.com/)  \n [The Snark](http://web.archive.org/web/20071216073059/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": " 21.Nov.2006 6.29am",
      "content": "“Just how big was it, Johnny?”\n\nActually, if you look at some of the hot-metal fonts, they were offered with optional long descenders. Traditionally, “short” descenders were used by newspapers, so they could pack in more copy. Linotype wasn’t dumb, since more machines were bought by newspaper publishers than book printers, the short descenders became standard, and “long” descenders became an extra-cost option.\n\nAnd I can’t resist, what are usually termed “modern” figures came about to support advertising, which used a lot of full caps. “Old style” numbers are better termed “lower case” figures, as that would indicate their use rather than date of origin. There is always a problem with date-of-origin: “modern” figures, for example, are just as up-to-date as corsets. Not really a “build” issue, though . . .\n\n"
    },
    {
      "time": " 21.Nov.2006 6.43am",
      "content": "\\>a set of long descenders for type designs where they would be appropriate.\n\nI am coming to the conclusion that this is a matter of optical scaling, with small sizes calling for shorter extenders, normal for a bit longer, and headings still longer. I think Garamond Premier does this, though I don’t have it so I’m not sure.\n\nWith true display sizes, you can go either way, depending on the ’look’ you want.\n\nDoes this make sense to you from your work on books?\n\n"
    },
    {
      "time": " 21.Nov.2006 7.05am",
      "content": "[Goudy](http://web.archive.org/web/20071216073059/http:/typophile.com/wiki/Frederic_W_Goudy) felt that the shortening of the decenders on several of his faces marred the overal effect of the typefaces. i don’t think it’s an optical scaling thing, it’s a matter of what effect you’re shooting for: short for space-saving and long for text that breathes a bit more.\n\n"
    },
    {
      "time": " 21.Nov.2006 9.11am",
      "content": "In the mythical font format I’m designing, there will be a slider that interactively dials in the ascender and descender lengths desired. The capability actually exists in Knuth’s [Metafont](http://web.archive.org/web/20071216073059/http:/typophile.com/wiki/Metafont) system, but it’s all but impossible to use in practice.\n\nBut I’m more than a bit intrigued by the kerning suggestion above. I can see how it would help a lot in extended article and book setting, but it’s not exactly the sort of thing that would be obvious to a designer. I wonder if we could start a wiki page for “best practices” of basic, easy things to do that make the fonts that much more usable.\n\n"
    },
    {
      "time": " 21.Nov.2006 9.17am",
      "content": "\\> can you remember to kern quotedblleft quoteleft\n\nOr better yet, make both double quotes point up, and  \nboth single quotes (and the apostrophe) point down.\n\n ![](http://web.archive.org/web/20071216073059im_/http:/typophile.com/files/quotes_mine2_6568.gif)\n\n\\> I am coming to the conclusion that this is a matter of optical  \n\\> scaling, with small sizes calling for shorter extenders\n\nI assume it helped that <cite>this is in fact a long-established truth.</cite>\n\nSpecifically concerning the shortening of descenders more than the ascenders, it makes sense (up to a point of course) for a good reason: relative frequencies. When you give as much room to the descenders as the ascenders(see for example Ruse) you’re in effect wasting apparent size. In fact one indication of a good text font is the “g”: if it doesn’t look slightly cramped vertically, there’s something wrong. That said, aesthetics can of course be allowed to alter the course of efficiency, when it makes sense.\n\nhhp\n\n"
    },
    {
      "time": " 22.Nov.2006 2.02pm",
      "content": "Hrant, thats the ugliest thing I’ve seen since I got my fingers caught in the mangle. A “close quote” or an “apostrophe” is, historically, a raised comma. An “open quote” a turned comma. If you’re going to redesign them, feel free. If I have to use the font, I’ll just turn them over & kern them.\n\nAs to the long descenders, you’re right about the “g” — it & to some extent the “y” basically determine how long the descenders can be. I’m rather less convinced about the wasting of apparent size; you can’t be a book designer these days with out specifying type 10/15 or so.\n\nBill:\n\nNo, not a matter of optical scaling. Frequently footnotes look better with shorter descenders, but ultimately I think it depends on the leading. There are book designers today who use the text leading with footnotes. In fact, I just finished setting a small book where the footnotes were specified 8/14. Conversely, display type usually looks better (to my eye) with short descenders. But as always, much depends on the design of the letters, and the design of the book.\n\n"
    },
    {
      "time": " 22.Nov.2006 2.47pm",
      "content": "So it’s ugly because it’s ahistorical? And isn’t the conventional scheme “ugly” because it throws a wrench in reading? Formal beauty is for the catwalk.\n\n\\> you can’t be a book designer these days with out ...\n\nBut we’re talking about the type itself, not a possible usage preference. A bad font, or something bad about a font, can sometimes be used to good effect (like when people use Bell Centennial large). Also, to clarify my position: sometimes waste is exactly what’s needed.\n\n\\> not a matter of optical scaling.  \n\\> ... look better ...\n\nWe’re -still- not talking about looks.  \nNews fonts have short extenders not because that looks better.\n\nhhp\n\n"
    },
    {
      "time": " 22.Nov.2006 4.34pm",
      "content": "Hrant I can’t agree with your example less. What’s good about ink traps blown up that’s bad at the intended size?\n\n"
    },
    {
      "time": " 22.Nov.2006 4.57pm",
      "content": "OK, I was sloppy.  \n(But your question isn’t the tidiest thing on the planet either... :-)\n\nWhat I meant was that intent is not portable from font to usage (except in special cases). So if you make a font with wastefully long descenders it doesn’t totally preclude good typography with it.\n\nhhp\n\n"
    },
    {
      "time": " 22.Nov.2006 5.30pm",
      "content": "\\>No, not a matter of optical scaling. Frequently footnotes look better with shorter descenders, but ultimately I think it depends on the leading. There are book designers today who use the text leading with footnotes. In fact, I just finished setting a small book where the footnotes were specified 8/14.\n\nYou are of course right that shorter extenders are not a requirement. But the practical constraint here is that if you have longer descenders at small size then you are more or less required to do more leading, and so the publisher has to pay more for paper.\n\nIt seems like whenever economy is a prime consideration (eg newspapers), then publications both historically and now generally go for relatively small type sizes with large x-heights. That way you still get decent readability with economy.\n\nSo as a designer, if you are going to do optical sizes—which I think are a good idea for readability—you have the question of what demands to serve.\n\nI really wonder how much demand there is for 8 point type with a small x-height with 14 point leading. I must admit it sounds weird to me. I would think that it is going to be more readable with a larger x-height than is ideal for an 11 or 12 point font. And then if you want to make the 8 point type still more readable you can give it some more space between the lines.\n\nNow you could design with three different extenders, like Trinite, and combine that with optical sizes, like Minion. But the question becomes whether you are making a huge amount of pointless work for yourself.\n\nI guess what I am saying is that I can see that larger x-height at 8 point is an advantage for many uses, and I am having a hard time figuring out when a small x-height at 8 point would be an advantage.\n\nYou tell me: Is there a demand for such a creature?\n\nOn display sizes: I already acknowledged that all bets are off there. It is mainly an aesthetic choice, and would depend on the design. For example the much-maligned ITC Garamond, with its large x-height, actually works at display sizes.\n\n"
    },
    {
      "time": " 22.Nov.2006 6.02pm",
      "content": "“ITC Garamond, with its large x-height, actually works at display sizes.”\n\nI might even say: Works ONLY at display sizes. It’s odd, ITC Garamond is like Mrs. Eaves, in that its finish and details are at fatal odds with its proportions. Here are two examples of typefaces that don’t work quite right at any size; both derived from absolute pillars of the typographic establishment.\n\n"
    },
    {
      "time": " 22.Nov.2006 6.26pm",
      "content": "\\>finish and details are at fatal odds with its proportions\n\nNice insight, Carl.\n\n"
    },
    {
      "time": " 22.Nov.2006 6.29pm",
      "content": "\\> Nice insight, Carl.\n\nIndeed, Aziz!  \n(I’ve only been repeating the exact same thing for like 7 years.)\n\nhhp\n\n"
    },
    {
      "time": " 22.Nov.2006 6.33pm",
      "content": "\\>Indeed, Aziz!\n\nAziz is a fine name, but my mother gave me the name William. My friends call me Bill :)\n\n\\>(I’ve only been repeating the exact same thing for like 7 years.)\n\nGuess I missed it.\n\nOh Carl—or Hrant—could you expand on your analysis? What features do you think contradict the proportions?\n\n"
    },
    {
      "time": " 22.Nov.2006 7.59pm",
      "content": "Hrant,  \nI agree with you about a lot of things (ITC Garamond & Mrs. Eaves, for example). Maybe we’re having a terminological debate rather than one of substance, but I doubt it. I once heard a designer (book interior, not type) say something to the effect that it was the designer’s job to challange the reader. To which I replied, “NO. It is the author’s perogative to challenge the reader. If you want to challenge the reader, write a book.” The parallel is, unless you’re an advovate of grunge typography, of course looks matter. And an aesthetic is perforce cultural; a part of that means it is developed over time, that history counts. If a designer (of any sort) wants to be experiemental, feel free, but don’t think experiementation leads surely to acceptance. It fails far more often than it succeeds.\n\nBill,\n\nI’m a bit of a dinosaur, I still think in terms of the page, not an element like leading. But fashion changes, and paper has dropped in price relative to total (book) printing costs. And since (1) chapters usually begin a new page, and (2) book printing is purchased in terms of signatures, there really isn’t too much cost increase for a lot of leading, unless the book has over 1,000,000 characters. What usually suffers is the foot margin, due to a publisher’s requirement for, say, 2,800 characters per page, and a designer’s insistance on 14-15 points lead.\n\nIf anyone wants to take a serious look at long descenders, they have only to look at, say, Monotype metal Bembo versus Monotype PostScript Bembo. Same with Monotype metal Baskerville versus Monotype PostScript Baskerville. And you’re right, it is ascenders too. I allow that type for book texts isn’t a hot item, but one of the plusses of OpenType is that it doesn’t take that much more effort to address two markets; print where packing in the characters is important, and print where the look of the page (really, the spread) is still considered important.\n\nActually, the book I mentioned with 8/14 leading was a poor exaple, in that the leading works for this book. The book was a rememberance of Richard Eckersley, and the only piece with notes was by Richard’s son, Sam. There were only a few notes, and they were as important as the text. Would that more designers paid attention to just what is in the notes.\n\nAnd please kern the quotes. Changing the class kerning where “quoteleft” has another member in it’s class, namely “quotedblleft” is beyond me, since I don’t want to have a positive kern between two single quotes, & can’t figure out how to add the exception. I’m a comp, not a computer programmer.\n\n"
    },
    {
      "time": " 22.Nov.2006 8.35pm",
      "content": "\\>I still think in terms of the page\n\nNo doubt you’re right as a designer and compositor to think in terms of the page—or page spread.\n\nWhat I am thinking about in terms of x-height and descenders is readability and aesthetics, first and foremost. I need you and your colleagues to tell me what your needs are.\n\nRecently in one of the (interminable) threads on readablity, Kevin Larson quoted some research saying that 11 point type (I assume a relatively normal x-height, seriffed book face) is the most readable, and that bigger and smaller type people read more slowly. David Berlow cited research that newspaper readers prefer between 8 and 11 point.\n\nBooks and newspapers have different demands, and I don’t have the knowledge to give numbers on what works best. I just observe two things:\n\n1. Aesthetically, as well as for readability, a variation in the same design seems to work better with a bigger x-height at smaller sizes. Personally, I think a lot of type today goes too far in chopping the extenders, but some reduction is traditional. I know it is for Caslon, and I believe also for Garamond, and probably many others.\n\n2. Reducing descenders only, as was the rule in the early 20th century, is aesthetically a problem. The ascenders and descenders should have some balance. It seems like it works best with the descenders somewhat shorter, but not massively. For example, what the short descenders forced on Goudy were pretty bad—at least in some versions I have seen—and P22’s full extender version is a definite improvement, I think. However, MF Benton designed Goudy Catalogue, also with short descenders. But it is intended for small sizes, and much heavier, and I think Benton pulled off the design of the short descenders pretty well, for the purpose of the type.\n\nI’ll kern the “’\\_\\_\\_’” Message received, thanks.\n\n"
    },
    {
      "time": " 22.Nov.2006 8.55pm",
      "content": "Thank you for this thread, its nice to hear from some one who sets type, on such specific topics with firsthand details to illuminate.\n\n_unless you’re an advocate of grunge typography, of course looks matter_\n\nEven then, they matter. The goals are different, the tastes intentionally contrary, but looks always matter. I wouldn’t compare grunge type to experimental type anymore than I would compare Experimental Electronic to Madonna’s last electronic-influenced album.\n\n_Would that more designers paid attention to just what is in the notes._\n\nNext you’ll be wishing that the cover artist ever opened the book at all. Or read the title.~\n\n[Choz Cunningham](http://web.archive.org/web/20071216073059/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20071216073059/http:/www.exclamchine.com/)  \n [The Snark](http://web.archive.org/web/20071216073059/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": " 23.Nov.2006 2.31am",
      "content": "Please remember that you’re talking about the use of quotation marks in English, but practically every language uses a different set of quotation marks. In many European languages, the opening quotation mark is „ and the closing mark is ” or “. I recommend not to deviate from the commonly-accepted shapes of quotation marks too much as they may turn out unusable for languages other than English.\n\nAnd as usual, I recommend thinking of English just happening to be one particular language among many that use the Latin script.\n\nA.\n\n"
    },
    {
      "time": " 23.Nov.2006 6.15am",
      "content": "Cant the choice of glyph be tuned to the language in use?\n\n[Choz Cunningham](http://web.archive.org/web/20071216073059/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20071216073059/http:/www.exclamchine.com/)  \n [The Snark](http://web.archive.org/web/20071216073059/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": " 24.Nov.2006 12.13pm",
      "content": "Choz,\n\nit can, using the “locl” feature. But the default glyph shapes should be the ones usable universally, i.e. across all languages, in case that an application does not support “locl” (none of the currently shipping popular applications does, yet).\n\nA.\n\n"
    },
    {
      "time": " 24.Nov.2006 4.02pm",
      "content": "Adam, would you be interested in this? [http://typophile.com/node/29673](http://web.archive.org/web/20071216073059/http:/typophile.com/node/29673 \"http://typophile.com/node/29673\")\n\nYour knowledge on how applications support (or not) OpenType could really benefit us all.\n\n[Choz Cunningham](http://web.archive.org/web/20071216073059/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20071216073059/http:/www.exclamchine.com/)  \n [The Snark](http://web.archive.org/web/20071216073059/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": " 25.Nov.2006 2.05am",
      "content": "For Mrs. Eaves, it was someone else who pointed out how the serifs are so long and thick, and the contrast so low, they look geared to tiny sizes, but the x-height is tiny with long extenders, implying display, or at least larger-size use. It can’t decide what size it’s for. With ITC Garamond, the conventions that led to it developed in advertising; hand-lettered headlines tended to be based on the text type used in small sizes, but adapted for display, with tighter fit, more delicate serifs, more contrast. As the decades ticked by and standards dropped, all that was left of those conventions was the urge to space everything tightly and fuss over serif shapes, so ITC Garamond was essentially a display variant of Garamond 3, except that other inescapable trend in the 70s was to make x-heights gargantuan, so the result was a typeface with detailing appropriate for about 120 points and up, with x-height and other proportions suitable for about 5 point. And now we get to look at miles of it in 9 point on glossy paper in grey ink. Puke.\n\nThe original topic: Kern uncommon pairs, is a perpetual issue in designing type. Thanks for providing some real uses. That topic alone would be worth sticking to.... ;) Anyone have others they always look for?\n\n"
    },
    {
      "time": " 25.Nov.2006 2.13am",
      "content": "“intent is not portable from font to usage”\n\nNo kidding. Hence the recent term “font crime”.\n\n"
    },
    {
      "time": " 25.Nov.2006 6.04am",
      "content": "Carl, interesting analysis. I agree with you about using Mrs. Eaves or ITC Garamond at small sizes—that they don’t work for the reasons you say.\n\nBut at display sizes they do have a certain eye appeal. I think at display sizes there is no rule about extender lengths, and both typefaces both pull off their designs with a certain eye-appeal.\n\nMy problem is that both have a stylishness and glamour that turns to distaste after a while. They are like exaggerated styles in fashion that look great for two months and then you look back and think: why did we ever think that looked good?\n\nMaybe, though, both the appeal and the distaste is because of the incongruousness of detailing vs proportion that you point out. —So they work on one level, but the lack of balance makes them wear out their welcome.\n\n"
    },
    {
      "time": " 27.Nov.2006 8.39am",
      "content": "\\>The original topic: Kern uncommon pairs, is a perpetual issue in designing type. Thanks for providing some real uses. That topic alone would be worth sticking to…. ;) Anyone have others they always look for?\\>\n\nI’d be happy to discuss more on “real world kerning,” but wonder if it shouldn’t be a different thread, and maybe not in the “Build” forum?\n\n"
    }
  ]
}
