{
  "id": "29663",
  "title": "Pirate fonts.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "This may be old news, but since I’m rather fresh in this business I can’t stop getting upset everytime I see free copies of quality fonts. I mean it’s just to browse some of the free fonts sites, and it wont take any more than a minute until you find a lot of well known fonts with a new name!\n\nShouldn’t it be a good idea if there was an easy way to report these crimes to the right person who can take action immedietly?\n\nMaybe a list of names and e-mail adresses to the right person at the Foundry that have released the original font, or their legal department. Or some kind of organisation protecting \"our rights\". Well, I dont have the recipy for that but the whole thing bugs the hell out of me.\n\nI hate to see ony of my future fonts as a free download at one of these stupid website. And there a lot of them out there.\n\nCos, if actions are taken harder, maybe some of these free sites will shut down for good or at least keep a better control of what kind of fonts are submitted there by pirates.\n\nOr is it just a dream? Is it impossible to stop?\n\n",
  "author": "<a href=\"/web/20110709001910/http://typophile.com/user/11526\" title=\"View user profile.\">Goran Soderstrom</a>",
  "time": "<br>",
  "uid": "11526",
  "comments": [
    {
      "time": "",
      "content": "[http://typophile.com/node/12493](http://web.archive.org/web/20110709001910/http:/typophile.com/node/12493 \"http://typophile.com/node/12493\") -  \n [http://typophile.com/node/27711](http://web.archive.org/web/20110709001910/http:/typophile.com/node/27711 \"http://typophile.com/node/27711\") -  \n [http://typophile.com/node/16177](http://web.archive.org/web/20110709001910/http:/typophile.com/node/16177 \"http://typophile.com/node/16177\")\n\nas you can see, [piracy](http://web.archive.org/web/20110709001910/http:/typophile.com/wiki/piracy) is a real problem and no real clear-cut solution.\n\n"
    },
    {
      "time": "",
      "content": "There are plenty of easy ways to report copyright crimes. But unless the person being reported is selling large volumes of discs full of thousands of fonts, and unless the companies that made the fonts want to cooperate with law enforcement and criminal prosecutors, nothing is going to come of it. Of the criminal acts that occur in the world on a daily basis, font piracy is one of the least heinous, and law-enforcement types have bigger fish to fry.\n\n"
    },
    {
      "time": "",
      "content": "Although it's not worth getting too angry and not possible to do much legally, one thing that can work is bypassing the formal/legal system and leveraging human decency instead: alerting the people distributing the illegal font, and suggesting they please pull it. Often they have no idea, and sometimes they do but just need a little nudge (but not threats - that backfires pretty much every time). This is preferably done by the \"owner\" of the font (as long as they don't get too emotional) so I think the idea of having a list of specific people to contact at the various foundries/houses has merit.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\"Is it impossible to stop?\"\n\nYes.\n\nAlso, I don't know if I'd call this piracy. That typically involves an entity specifically profitting from your work. This is more akin to patent/copyright infringment.\n\nThe easiest way to stop that is to just whip off an email to the offending sites web hosting company.\n\n"
    },
    {
      "time": "",
      "content": "In many civilized countries, they are copyright violations rather than crimes. The penalties are civilian, not prosecution.\n\n"
    },
    {
      "time": "",
      "content": "[http://www.typeright.org/](http://web.archive.org/web/20110709001910/http:/www.typeright.org/ \"http://www.typeright.org/\")\n\n"
    },
    {
      "time": "",
      "content": "TypeRight is dead, and one of its founders on the run.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "[http://www.sanskritweb.net/forgers.htm](http://web.archive.org/web/20110709001910/http:/www.sanskritweb.net/forgers.htm)  \n [http://www.forgers.de/forgers/](http://web.archive.org/web/20110709001910/http:/www.forgers.de/forgers/ \"http://www.forgers.de/forgers/\")\n\n"
    },
    {
      "time": "",
      "content": "Ludwig: Although there is plenty of truth on those sites, there is also plenty of nonsense as well, and it would be hard for anybody not intimately familiar with the companies and histories to tell the difference.\n\nT\n\n"
    }
  ]
}
