{
  "id": "29673",
  "title": "An OpenType wiki",
  "forum": "Build",
  "tags": [

  ],
  "content": "I think something like [http://diacritics.typo.cz/](http://web.archive.org/web/20071112201011/http:/diacritics.typo.cz/ \"http://diacritics.typo.cz/\") but about the features (and use of scripts, languages, etc) of [OpenType](http://web.archive.org/web/20071112201011/http:/typophile.com/wiki/OpenType) might be very useful. It could explain which tags have current application support, discussions of implementation, all sorts of things.\n\n1) Is there one already?\n\n2) If not, is there interest in one?\n\n [‹ [kern] Subtable breaks in FL: right, wrong, abusive?](http://web.archive.org/web/20071112201011/http:/typophile.com/node/29664 \"Go to previous forum topic\") [FontLab: Quick Test doesn’t run. ›](http://web.archive.org/web/20071112201011/http:/typophile.com/node/29384 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071112201011/http://typophile.com/user/13605\" title=\"View user profile.\">Choz Cunningham</a>",
  "time": "<br>",
  "uid": "13605",
  "comments": [
    {
      "time": " 22.Nov.2006 1.39pm",
      "content": "Anything that would make OpenType easier to nderstand would be most helpful. If such a site exists already, I’d love to hear about it.\n\nNo, I haven’t looked very hard.\n\n"
    },
    {
      "time": " 22.Nov.2006 2.50pm",
      "content": "i’ve started a little bit in our [typowiki](http://web.archive.org/web/20071112201011/http:/typophile.com/wiki/typowiki) with [ot\\_how-to](http://web.archive.org/web/20071112201011/http:/typophile.com/wiki/ot_how-to). i’ve been wanting to expand on this, but haven’t had the time to yet. but i don’t see why we can’t use our own wiki for this.\n\n"
    },
    {
      "time": " 22.Nov.2006 3.58pm",
      "content": "also, not a wiki, but other resources include the [AFDKO](http://web.archive.org/web/20071112201011/http:/typophile.com/wiki/AFDKO) forum and the OpenType mail list.\n\n"
    },
    {
      "time": " 22.Nov.2006 7.21pm",
      "content": "The Typophile.com wiki could be the best place for a full-featured reference of OpenType mechanics. In its current shape it is a whos who of type and a really great area for primers on many fields.\n\nThe reasons why I think it might do well in its own space are somewhat complicated, but I’ll try and explain.\n\nWhat I would like to see is a highly-interactive technical manual, meaning that the searching, categorizations and general feel is optimized for finding out what I want on a particular facet of OT. The Typowiki has a much rounder, more narrative feel, and is fully integrated as an accessory to the forums. The wiki results are returned with topic threads.\n\nI would like the OT wiki to be a neutral place. Building it inside the Typowiki would possibly force any contributors to feel like they had to be a ’part of the scene’. Or it might.\n\nI would like to see the data as open and as accessible as a Wikimedia Foundation project. In fact, more so than some of those are. I would like no one to ’own’ the wiki, so to speak, and be able to fork it, archive it or whatever-they-like it.\n\nUptime. When Typophile is down is when I need the reference info the most, because I’m getting more work done! :)\n\nThere is some relational wiki technology that is not used here that I am considering, that would be particularly helpful to a spec-centric wiki, and I am intrigued by how that could help. In fact, most of it is still being developed, so I guess that is neither a pro or con.\n\n[Choz Cunningham](http://web.archive.org/web/20071112201011/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20071112201011/http:/www.exclamchine.com/)  \n [The Snark](http://web.archive.org/web/20071112201011/http:/www.exclamachine.com/snark)\n\n"
    }
  ]
}
