{
  "id": "29687",
  "title": "Bitmap and grid FL4",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi! Happy Thanks giving for all .\n\nI have posted a glyph with 3 images.\n\n1. Regular mode 2 hinting mode 3. Bitmap generated.  \nI try to show how the grid is shifting in Orange and bright green.  \nDose any body know why the glyph is shifting or the grid is shifting ?  \nAny help is appreciated .\n\n| Attachment | Size |\n| --- | --- |\n| [grid\\_3.gif](http://web.archive.org/web/20131020061631/http:/typophile.com/files/grid_3.gif) | 17.02 KB |\n\n",
  "author": "Aleme",
  "time": "23 Nov 2006 — 1:44am",
  "uid": "10950",
  "comments": [
    {
      "time": "23 Nov 2006 — 2:27am",
      "content": "I must admit that I don't understand what you mean.\n\n"
    },
    {
      "time": "24 Nov 2006 — 11:36am",
      "content": "The grid is sifting depending on the pt (PPEM) size. The grid is the pixels & where they can be on or off at a given point size. See how they shift when you are in hint mode & you pick different point sizes? If you want, you can pick a give pt size (8 maybe) and fit your outlines to the pixels available at that size. After that you have to compromise at all other sizes. The alternatives are to simply fit the pixels to your design as best you can ( an outline centric approach) or pick a middle path. Pick two sizes say 12 & 11 ( or whatever ) and make the outlines a compromise that works pretty well ( but not exactly) for both. Does that make sense to you?\n\n"
    },
    {
      "time": "24 Nov 2006 — 12:15pm",
      "content": "Thanks Adam , I will try again to explain my question.\n\nas you see below are 3 images : the first one regular glyph falls on the grid 75,600\n\nI have out line it in red .  \nwhen I click true type hinting (Crt+Sh+F7) (Image2) I see my glyph out line in the same place and it will give me the gray balls with gray back ground in diffrent position and grid (Which I outline in Green)\n\nI generate bitmap I can work only inside the green zone .\n\nMy question is is their any way to match the bitmap grid to the original outline of my Glyph? I have also picked simple form to understand how it doen .  \nBy the way current PPM is 12 for all 3 images  \nThank you so much Adam .\n\n ![](http://web.archive.org/web/20131020061631im_/http:/typophile.com/files/grid_3_3637.gif)\n\n ![](http://web.archive.org/web/20131020061631im_/http:/typophile.com/files/grid_2_4742.gif)\n\n ![](http://web.archive.org/web/20131020061631im_/http:/typophile.com/files/grid_1_6470.gif)\n\n"
    },
    {
      "time": "24 Nov 2006 — 12:58pm",
      "content": "Based on what you have written I think the answer is no. The grid of pixels at 12pt ( or any size) is fixed. You can either change your shape to match or accept the alteration. You can Hint a font too; but in bitmaps ( not anti-aliased rendering - that's a whole other thing ) a pixel is either on or off. A hint will be to turn that pixel on or off at a size in particular.\n\nAh I see I have an email from you!\n\n"
    }
  ]
}
