{
  "id": "29698",
  "title": "Need \"at\" Ligature",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Dear Friends\n\nI'm looking for a face along the lines of Adobe Garamond, Jenson, or Centaur that features an _at_ ligature. Would any of you know of such a face?\n\nSpecifically, I'm trying to do a masterful job in setting the name \"Beatrice,\" so I'm very interested in any ideas you may have for setting this name. The client is a marriage and family therapist.\n\nThanks to Christopher Lewis from myfonts.com for tuning me into this fontastic resource of typographic knowledge and exploration!\n\n—Jaddie\n\n",
  "author": "Jaddie",
  "time": "23 Nov 2006 — 6:41am",
  "uid": "15503",
  "comments": [
    {
      "time": "24 Nov 2006 — 10:48am",
      "content": "I looked at [Esta](http://web.archive.org/web/20131019105718/http:/www.myfonts.com/fonts/dstype/esta) and [Mrs Eaves](http://web.archive.org/web/20131019105718/http:/www.emigre.com/fontpage.php?PMEJLigR.html), two with lots of ligatures that I knew off the top of my head, but neither had it. Mrs Eaves is known as the \"ligature queen\" and it doesn't have one, so I'm not sure if you're going to have much luck. But I hope I'm wrong.\n\nIf you can't find one but are still wedded to the idea of an at ligature, you may need to do it yourself in Illustrator or FontLab. You could either take a ct ligature and move the join to the at, or take the tail of the a and attach it to the t. Actually, looking at the Mrs Eaves ligatures font, you could switch an e for a t in the ae ligature, but you'd probably either have to lower the crossbar of the t or raise the bowl of the a to make a straight horizontal connection.\n\n"
    },
    {
      "time": "24 Nov 2006 — 11:09am",
      "content": "At first I thought you meant something to do with '@'. Silly.\n\nNow that I get you, here's the thing: ligatures are there to solve typgraphic problems and the cobination 'at' isn't one of these classic problems. So I don't think you will find a face with that ligature already made.\n\nYou can make your own but unless you do it carefully it will jump out like a sore thumb.\n\nThis 'Beatrice', will it be in running text or is it a logo? If it's in running text it might be more 'masterful' to loose the ligature. ;-) If it's a logo or something else then that might make more sense.\n\nMaybe you should look at the ligatures that made for KPN by Pieter van Rosmalen. They walk the line between decoration/embelishment & success in semi-running text. Maybe he would make your ligature for you. Or you could ask around here.\n\nHere is a link [http://www.caketype.com/custom\\_kpn.html](http://web.archive.org/web/20131019105718/http:/www.caketype.com/custom_kpn.html \"http://www.caketype.com/custom\\_kpn.html\")\n\nMaybe you should sketch what you have in mind & post an image.\n\n"
    },
    {
      "time": "24 Nov 2006 — 11:39am",
      "content": "Though no _at_ is included, [Aspect](http://web.archive.org/web/20131019105718/http:/www.typography.net/info/fonts/Aspect2L_Sample.pdf) has a delicious range of ligs. Moving far away from your goal of Centaur and Jenson, though.\n\n"
    },
    {
      "time": "24 Nov 2006 — 12:38pm",
      "content": "Do you mean something like this :\n\n ![](http://web.archive.org/web/20131019105718im_/http:/typophile.com/files/be-at-rice_6705.gif)\n\n"
    },
    {
      "time": "24 Nov 2006 — 1:04pm",
      "content": "Now _there's_ an at lig! But my guess is that Jaddie means a lowercase at lig, not uppercase.\n\nAlessandro, is that from a Trajan-esque font, or did you just make that? I found an AT lig in [Imperium](http://web.archive.org/web/20131019105718/http:/www.myfonts.com/fonts/wiescherdesign/imperium), but it doesn't look to be the same.\n\n"
    },
    {
      "time": "24 Nov 2006 — 2:58pm",
      "content": "Forget about 'at' ligature in Renaissance, now, and in roman lowercase letters (yes, that shows a typeface I designed, not on the market yet). But you can have 'at' ligature here :\n\n ![](http://web.archive.org/web/20131019105718im_/http:/typophile.com/files/beatrice_hand_6329.gif)\n\n"
    },
    {
      "time": "24 Nov 2006 — 3:51pm",
      "content": "Alessandro, I see you are a subscriber to the broad definition of a ligature... ;-).\n\n"
    },
    {
      "time": "24 Nov 2006 — 3:58pm",
      "content": "Yes !\n\n"
    },
    {
      "time": "24 Nov 2006 — 5:22pm",
      "content": "LettError's \"Salmiak\" has some and as well Emigre's \"Brothers\",  \nalthough these font styles might be too playful for your intended use?  \nAlternatively you could google for \"catchwords\".\n\n"
    },
    {
      "time": "24 Nov 2006 — 6:46pm",
      "content": "Do you mean something like this? (I know, it's a hack job.)\n\n ![](http://web.archive.org/web/20131019105718im_/http:/typophile.com/files/Beatrice_3538.jpg)\n\n"
    },
    {
      "time": "24 Nov 2006 — 9:46pm",
      "content": "There is no REASON for an a-t lig.\n\n"
    },
    {
      "time": "25 Nov 2006 — 12:01am",
      "content": "<cite>REASON </cite>\n\nI agree. However I don't think that it CANNOT be done well. But it will be hard. Very hard.\n\nBrian, good for you for giving it a shot! Here's my crit. I think the crossbar on the t & the tail below need to be exagerated a bit more. You have lost half th 't' so you need to compensate for it a little to make sure it reads as immediately as possible. Also there are some spacing issues with the other letters but that's probably how the font came. Yes?\n\nI won't promise that you will ever get there. But I don't think it's a good idea to say 'never'.\n\n"
    },
    {
      "time": "25 Nov 2006 — 12:44am",
      "content": "I agree that there's no _reason_, and I've personally never used ligatures myself other than the 'standard' ones like fi, fl, and the like. In modern use, there is no real reason to use ligatures besides that of clashing shapes. I find the ct and st ligatures for example way too distracting and too culture-specific.\n\nBut it's fun to look at mediaeval texts using ligatures where adjacent letters share stems or bowls as space-savers and to try to decipher them. There's no clash between the a and the t, but I tried playing the mediaeval scribe for fun.\n\nEben, thanks for the crit. I actually drew the letters from scratch just to set 'Beatrice'; they don't come from an existing design. As you probably suspected, I drew the a and the t separately and just hacked and sewed them up. I have now modified the letters a bit following your suggestion.\n\n ![](http://web.archive.org/web/20131019105718im_/http:/typophile.com/files/Beatrice2_5180.jpg)\n  \nI think it does read better, although it still demonstrates how foreign the mediaeval conjoined-at-the-stem ligature is to the modern eye. \n"
    },
    {
      "time": "25 Nov 2006 — 4:08am",
      "content": "Brian, that's nice, bravo. Eben, I do agree, it’s not a good idea to say ‘never’, sometimes is good to be at rice —— I guess I've been too lazy to ask Jaddie Dodd about the concept of having it.\n\n"
    },
    {
      "time": "25 Nov 2006 — 5:21am",
      "content": "Only mildly off-topic -- I've always wanted to know: Why _are_ there ct and st ligs? It's always seemed to me that adding the loop connecting the two letters doesn't solve any problems, but maybe I'm wrong.\n\n"
    },
    {
      "time": "25 Nov 2006 — 8:04am",
      "content": "<cite>There is no REASON for an a-t lig.</cite>\n\nThen you should create one.\n\n"
    },
    {
      "time": "25 Nov 2006 — 11:14am",
      "content": "\\> ligatures are there to solve typgraphic problems\n\nOnly in the short-sighted view of type.  \nThere's no REASON to be chickenshit afraid of ligation.\n\nEric Olson and Thierry Puyfoulhoux make great ligs.\n\nhhp\n\n"
    },
    {
      "time": "25 Nov 2006 — 11:23am",
      "content": "Dear Alessandro\n\nThat's so very, very cool! Wow!\n\n—Jaddie\n\n"
    },
    {
      "time": "25 Nov 2006 — 11:38am",
      "content": "Dear Friends\n\nThank all of you for commenting and giving me suggestions about what I might be able to do.\n\nEben, it's going to be a logo that will appear on the person's business card and perhaps a future Web site.\n\nHere's Throhand Regular. I think I swiped the connector from an _st_ ligature.\n\n ![](http://web.archive.org/web/20131019105718im_/http:/typophile.com/files/at_ligature_4838.jpg)\n\nAgain, thank you all!\n\n—Jaddie\n\n"
    },
    {
      "time": "25 Nov 2006 — 12:32pm",
      "content": "any reason not to ligate from the tail of the a? It can just flow right into the t.\n\n"
    },
    {
      "time": "25 Nov 2006 — 12:38pm",
      "content": "\\>any reason not to ligate from the tail of the a? It can just flow right into the t.\n\nBut then the tail of the t should flow into the r as well!  \nSo maybe this top-side solution is good.\n\n"
    },
    {
      "time": "25 Nov 2006 — 5:49pm",
      "content": "<cite>Why are there ct and st ligs? </cite> As far as I can tell the long s used to need a connection. When the s sharnk to x height it kept it's connection in some cases. If you look in an old book with long s' you will see it's quite natural. I don't know about the ct ligature. But before you write it off go look at some good ones. You may find yourself changing your mind.\n\n<cite> any reason not to ligate from the tail of the a </cite>\n\nIndeed. That seems more natural. But they alook like Be AT rice to me that way.\n\nI had a quick go at it - but I actually like Allessandro's Caps best.\n\n ![](http://web.archive.org/web/20131019105718im_/http:/typophile.com/files/junk_3962.gif)\n\n<cite> There’s no REASON to be chickenshit afraid of ligation. </cite>\n\nExcept fear of abject failure. Doing it well is tough. If you have a deadline or some other reason that makes it impractical it maybe isn't the best plan. On the other hand if you have time to play in - you can't do anything well unless you do it alot. So I say ligate to your hearts' content. Upsetting the apple cart ( and then fixing it) is a good way of finding out how the apple cart works.\n\n"
    },
    {
      "time": "25 Nov 2006 — 5:50pm",
      "content": "Nice improvements Brian!\n\n"
    },
    {
      "time": "25 Nov 2006 — 6:11pm",
      "content": "That makes a lot of sense about the st lig; I never thought of that before. But looking at the ct lig (from Minion Pro, for example), it still doesn't make much sense to me (although it's not aesthetically unpleasing). For that matter, Minion has sp, ss, and ck ligs, too. I know some (like ij, fj, and ch) are for languages other than English, but these also strike me as odd.\n\n"
    },
    {
      "time": "25 Nov 2006 — 11:58pm",
      "content": "If you look back in time you may be able to discover the origin of the others as well. Also, not all ligatures are created equal. It may be that you need to find a good example to get the idea behind a given combination. One possible reason for a ss ligature would be to create an alternative way of writing the german 'double s' glyph.\n\n"
    },
    {
      "time": "26 Nov 2006 — 8:50am",
      "content": "Dear Eben\n\nI really love your first iteration.\n\nI think it'd be absolutely perfect if the _a_ had just a touch of a stem on it (just before the connector begins its ascent to the _t_.\n\nAlessandro, how much would you charge me for an EPS version of your script _Beatrice_? I don't think it'd work for a marriage therapist, but if my wife and I have a daughter, we're considering naming her Beatrice. For the main logo of my (perhaps future) daughter's photos (Web) pages, I cannot imagine her name being better expressed. That's real art there, fine sir!\n\nI see a \"dberlow\" online. Could that be _the_ David Berlow, the one who designed Throhand?\n\n—Jaddie\n\n"
    },
    {
      "time": "26 Nov 2006 — 9:00am",
      "content": "Hey guys, why not ligate from the top of the bowl of the \"a\"?\n\nAnd yes, it is the Berlow. (Although there's two of them you know.)\n\nhhp\n\n"
    },
    {
      "time": "26 Nov 2006 — 1:28pm",
      "content": "Hrant: Show us the bowl ligation!\n\nJaddie: I agree. But when you do 3 ideas in 3 minutes... :-) Feel free to muck about in that direction if you want.\n\n"
    },
    {
      "time": "26 Nov 2006 — 2:53pm",
      "content": "Something expected on the left, and something  \nless expected (with an ascending \"a\") on the right:\n\n ![](http://web.archive.org/web/20131019105718im_/http:/typophile.com/files/at-lig_4891.gif)\n\n(BTW, image upload has been acting funny lately...}\n\nhhp\n\n"
    },
    {
      "time": "26 Nov 2006 — 3:01pm",
      "content": "Hrant: Bravo! I like this solution because it changes both letters completely and unifies them utterly - so the ligature isn't just a 'pasted' on compromise. That's the way I would go if it were up to me.\n\n"
    },
    {
      "time": "26 Nov 2006 — 3:34pm",
      "content": "Dear Hrant & Friends\n\nWouldn't this design call for a tall x-height?\n\nIn Berlow's Throhand it'd take one heck of a steep connector to get from the top of the bowl of the _a_ to the _t_'s crossbar. (By the way, if _crossbar_ isn't the correct term, please enlighten me.)\n\nI want the base font on which this logo is based to have the Victorian discipline and prissiness of Adobe Garamond, Jenson, Centaur, or Throhand, none of which features a tall x-height.\n\n—Jaddie\n\n"
    },
    {
      "time": "26 Nov 2006 — 4:37pm",
      "content": "Well, nothing works all of the time.  \nBut I think more of an x-height issue it's a widths and bowl-proportion issue.\n\nhhp\n\n"
    },
    {
      "time": "26 Nov 2006 — 5:09pm",
      "content": "The problem with your critique is not that you are somehow 'wrong'. I just think one of the the assumptions you seem to be making may inhibit the optimal success of this kind of ligature: the assumption being that whole parts of the letters may be able to stay rigid or intact. in the process. In order to make my rough samples look even sorta kinda okay, I had to give the crossbar more weight so it could better compete for attention with the arcs, and I had to shorten the tail of the t. Better still to put all the elements in play! If you leave the bowl on the way to the t at an angle you may be able to straigten it out by the end. Or you might find an arc shape works better.\n\nBut if there is one thing I keep bumping into over & over again as I design type it's the reality that every part relates and has to be seen in the context of every other part, feature or aspect. So it stands to reason that you might have to rethink the whole thing. Who knows maybe the over shoot in the top of the a will look good if it's made a bit taller to make room for the arc <cite>in the context of the rest of it...</cite>\n\n"
    },
    {
      "time": "26 Nov 2006 — 6:46pm",
      "content": "That's really interesting, Eben, about how you made those tweaks to the sample aside from adding the arc. I didn't notice them before, but now I see them. That's something for me to keep in mind should I ever make a typeface of my own.\n\nOn a slightly unrelated note, Jaddie, I've been wondering why the tittle (I've never used that word before) of the i is so high. When I looked at the sample of Throhand of the Font Bureau site, the reason became clear: it's because the x-height is low, and the high tittle balances the i when it is near ascending letters. But in this sample, because the only ascending letter is the B, the high tittle seems out of place. I'd suggest lowering it to a less evident spot.\n\n"
    },
    {
      "time": "26 Nov 2006 — 6:55pm",
      "content": "A more general reason to make the tittle high is  \nthat it can thereby contribute more to readability.\n\nhhp\n\n"
    },
    {
      "time": "26 Nov 2006 — 7:02pm",
      "content": "But I would think that having it high in a typical typeface would make it be less associated with the i it floats above. As I said, in the case of Throhand, it is correct to have the high tittle to offset the low x-height, but I find it more distracting than helpful in the case of setting \"Beatrice.\"\n\n"
    },
    {
      "time": "26 Nov 2006 — 7:43pm",
      "content": "Paradoxically, it's when letters become less themselves and more parts of larger wholes (that are read faster than the compiling of the individual letters) that readability (as opposed to letterwise legibility) is promoted; and looking deliberatively at the individual letters does not reveal this necessity.\n\nFor example, I've tried to make the tittle in my Patria <cite>slightly</cite> too large. When a person tells me that it's slightly too large (and it's happened a few times already) I know (well, at lease I think) I've succeeded. :-\\>\n\nhhp\n\n"
    },
    {
      "time": "26 Nov 2006 — 7:58pm",
      "content": "I'm not knowledgeable enough to discuss readability, but what you said sounds right. Concerning Patria's tittle, though, it would seem to me that having someone comment on it when it's supposed to be a text face would be undesirable, that if the slightly larger tittle were useful in improving word recognition then it shouldn't be noticeable. But reading your post again, maybe you meant that it's only noticed when someone looks at the letters out of context.\n\nReturning to Jaddie's case, Hrant, wouldn't you agree that in this case, setting \"Beatrice,\" the tittle should be lowered? Visually, to me, it jumps out as distracting.\n\n"
    },
    {
      "time": "26 Nov 2006 — 8:12pm",
      "content": "\\> having someone comment on it when it’s  \n\\> supposed to be a text face would be undesirable\n\nYou're right - I was unclear: only other type designers are expected  \nto comment (and only they have actually commented). If a layman  \ncomments on it, then the tittle must be huge.\n\nYes, I think in this case (mostly because it's a single word, and in essence  \nno longer glyphs of a font) the tittle should be lower, and also larger.\n\nhhp\n\n"
    },
    {
      "time": "26 Nov 2006 — 8:32pm",
      "content": "Thinking about this more deeply:  \nI don't know if anybody has brought this up, but the important question is why have an \"at\" ligature? A question not based on a general dislike of ligatures, but one based on a like of focused purpose.\n\nI presume it's because of some sort of separation/joining between the two parts of the name, both in terms of syllabification as well as the fact that \"Bea\" is the common short form. So maybe a ligation is not the only way to mark this; maybe a flourished \"a\" would be better - something like this:\n\n ![](http://web.archive.org/web/20131019105718im_/http:/typophile.com/files/a_6255.gif)\n\nSort of like a subtle, engrained hyphen.  \nBTW, in such a scheme I might abridge the left part of the crossbar of the \"t\".\n\nhhp\n\n"
    },
    {
      "time": "27 Nov 2006 — 1:15am",
      "content": "Maybe. I have to admit to being more skeptical about this one. But then the devil is in the details.\n\n"
    },
    {
      "time": "28 Nov 2006 — 1:10am",
      "content": " ![](http://web.archive.org/web/20131019105718im_/http:/typophile.com/files/Beatrice_4494.gif)\n\nmaybe?\n\n\\_\\_\\_\\_\\_\\_\\_  \nAL  \n [lenart.pl](http://web.archive.org/web/20131019105718/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": "28 Nov 2006 — 1:16pm",
      "content": "NICE. this would be fabulous in a logo, but no good for immersive reading for the same reason: it really draws attention! For Jaddie's purpose it might be nearly perfect.\n\n"
    },
    {
      "time": "28 Nov 2006 — 1:58pm",
      "content": "That's a really great idea, Aleksander. I'm wondering if it is best to leave the part of the a created by the t's swash as similar to the actual a's stroke, or if it might be preferable to make the swash more \"swash-like.\" A concern would be hurting the legibility of the word, but maybe that's not a big deal since so much of the a remains unaltered by the edit.\n\n"
    },
    {
      "time": "29 Nov 2006 — 6:14pm",
      "content": "Dear Eben, hrant, auricfuzz, & aleksander\n\nThank you very much for your help! I'll experiment a bit more and do my best to incorporate your thoughts and ideas into a semi-final design. Beatrice herself might have some sort of idea that I haven't thought of.\n\naleksander, I really like your two suggestions and prefer the second because it seems to have a little bit more flow and looks a little more feminine.\n\nThanks, all! I can't believe I got into such a high-brow discussion with my first post in this forum.\n\nThanks again!\n\n—Jaddie\n\n"
    }
  ]
}
