{
  "id": "29704",
  "title": "(x) Antique cursive script - Cezanne {Jared}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "It's a cursive font that's on my French textbook (first two pics) that I've seen used in many other applications. That's a tea from President's Choice, one of their more image-focused products. I've also seen it used on TV for fade-facades on shows as subliminal text.\n\n| Attachment | Size |\n| --- | --- |\n| [helphelphelp.jpg](http://web.archive.org/web/20111124115637/http:/typophile.com/files/helphelphelp.jpg) | 72.69 KB |\n\n",
  "author": "<a href=\"/web/20111124115637/http://typophile.com/user/15512\" title=\"View user profile.\">chimere</a>",
  "time": "<br>",
  "uid": "15512",
  "comments": [
    {
      "time": "",
      "content": "P22's ubiquitous [Cezanne](http://web.archive.org/web/20111124115637/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=PY.120776.0.0&attributes.sampleSize=48&sampleText=le+bordelais&sampleSize=48)\n\nIf you're interested in a quality alternative, I suggest [DearSarah](http://web.archive.org/web/20111124115637/http:/www.veer.com/).\n\n"
    },
    {
      "time": "",
      "content": "thanks.. finally took that off my head, it was bugging me for awhile. too bad it's a commercial font. I had no ideas fonts could be copyrighted commercially to be sold for a profit (well I did, but I figured most of them were scams). If they aren't recognized by the gov't as intellectual property, then why are they not being distributed freely but rather sold?\n\n"
    },
    {
      "time": "",
      "content": "These FAQs might help you:\n\n[http://typophile.com/wiki/FAQ\\_Free](http://web.archive.org/web/20111124115637/http:/typophile.com/wiki/FAQ_Free \"http://typophile.com/wiki/FAQ\\_Free\")\n\n[http://typophile.com/wiki/FAQ\\_Font\\_Sharing](http://web.archive.org/web/20111124115637/http:/typophile.com/wiki/FAQ_Font_Sharing \"http://typophile.com/wiki/FAQ\\_Font\\_Sharing\")\n\n"
    },
    {
      "time": "",
      "content": "\\> _If they aren’t recognized by the gov’t as intellectual property, then why are they not being distributed freely but rather sold?_\n\nSince when can the government be trusted to be _right?_ :^D\n\n\\> _I had no ideas fonts could be copyrighted commercially to be sold for a profit (...)._\n\nWhy not? Designing a typeface is an artistic activity, just like composing music, painting or making a film. Why should it have any less rights than the others to be sold for profit? Type designers spend countless hours of hard work and a vast amount of skill and creativity in designing and producing a good working typeface. I can imagine they want to get paid for that.\n\nLife for a type designer is not free, contrary to popular belief. It's not like they haven't got bills to pay. \"Oh, you're a type designer? That's all right, you don't have to pay your mortgage.\" \"You say you're a type designer? No prob, the groceries are for free.\" \"Type designer, huh? Fill up your car, no need to pay.\"\n\n"
    },
    {
      "time": "",
      "content": "but I meant, what stops people from distributing a type designer's fonts for free (against the artist's will)? they can't lawfully be charged, so they can get away with it..\n\n"
    },
    {
      "time": "",
      "content": "I always thought fonts (and most software) were subject to use under their EULA. Since you do not actually buy the font itself, only a licence to use it, you must use it according to that licence. In most cases, that involves not distributing the fonts for free.\n\nBut you're right, there's nothing to stop you from doing it, just like there's nothing to stop you from slipping a candy bar into your pocket at the grocery store (to use a tired analogy). A lot of crimes are hard to enforce because they are very hard to detect. That doesn't mean they should be committed.\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "\\> _but I meant, what stops people from distributing a type designer’s fonts for free (against the artist’s will)?_\n\nSome obscure notion called \"ethics\" or \"moral values\", that very thing Republican politicians can't stop yapping about but appear to have _so_ little of.\n\n\\> _they can’t lawfully be charged, so they can get away with it._\n\nSince when does being able to \"get away with it\" dictate one's actions? What a sorry world would we live in...\n\n"
    },
    {
      "time": "",
      "content": "Yves, your statement implies that the Democrats do have ethics and moral values. I think if the words politics or politician are used you need to forgo giving any of them too much credit. ;^)\n\n"
    },
    {
      "time": "",
      "content": "Well, that's the problem with fake democracies, innit? If the only choice is between right-wing and _extreme_ right-wing, you quickly run out of options. :^D\n\n"
    },
    {
      "time": "",
      "content": "\\>they can’t lawfully be charged\n\nYes they can, at least in civil court. In Adobe vs SII, this was done successfully. Also a publisher recently had to pay tens of thousands of dollars for using pirated fonts. And there are other cases. Do you expect type designers--or anybody else--to work for nothing? How are they going to eat?\n\n\\>fake democracies\n\nYves, what is fake about US democracy?\n\nAdmittedly, the legislative process in the U.S. is to a degree corrupted by money. However, when voters are fed up with people or policies they do make their voices heard. This past election changed both houses of congress. So to me American democracy looks flawed, but not fake.\n\nYou may not like the choices that the American public makes--and I often don't--but that is a different matter from democracy.\n\n"
    },
    {
      "time": "",
      "content": "Oops. Maybe I was misinformed.\n\nDemocrats are right-wing and Republicans are extreme right-wing, isn't it? Then what are the extreme left-wing, left-wing and/or eco and central political parties in the USA?\n\n"
    },
    {
      "time": "",
      "content": "Personally, I wouldn't call Democrats right wing because they support the welfare state--now often called the 'safety net'.\n\nNader represented a more left-wing approach in his run as leader of the Green Party in the 2000 election. However, he received a less than 3% vote. Not enough to make him a factor for federal funds for the next election--his goal--but enough to elect George W. Bush over Albert Gore.\n\nThere is definitely a left wing within the Democratic party. In order to understand US politics, you need to understand that it is not a proportional representation system. The parties tend to have a much broader range of views within them, and the compromises on policy take place within a party, rather than by coalition of parties.\n\nThat being said, it is true that the US has never had a large socialist movement or party.\n\nIn my view the results of this difference, internally, have been policies in the past 50 years that have been in some respects better than Europe--leading to a more dynamic economy--and in some respects worse, in failing to implement a key feature of the welfare state, namely health security for all citizens.\n\nAfter the voting rights act of 1965, which empowered the African American vote, the South turned against the Democratic party. As a result, Republicans have been in the majority more often than not ever since. With the steadily increasing number of new immigrants (over 10% of US citizens are foreign born) this may change. My hope is that this past election represents the beginning of a new era, but time will tell.\n\n"
    },
    {
      "time": "",
      "content": "Well spoken, William.\n\n"
    }
  ]
}
