{
  "id": "29708",
  "title": "am i right in saying that we, as designers have a huge role to play in society.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "i mean in the way that we have a huge responsibily for all our actions may iit be ethical, political etc. designers in advertising etc influence people and have great impact on them? have you recently heard about the packaging dilemma and the fact that designers should be responsiblle in creating packaging from materials that can be recycled or are environment friendly because of all thye global warming and pollution and gree house gases we produce everyday but mind you, war and bombs tend to cause the most pollution and have the worst effects on green house gases. what are the government talking about? what else should a designer keep in mind in regards to helping the world and society in ethical, political, economical forms?\n\n",
  "author": "missgiggles",
  "time": "25 Nov 2006 — 6:03am",
  "uid": "14600",
  "comments": [
    {
      "time": "25 Nov 2006 — 6:22am",
      "content": "\"A series of different representations, using ultrasound scans and computer graphics, have been created for a documentary called Animals in the Womb that will be screened in the UK on Channel 4 over Christmas.\"  \n(Channel 4/PA)  \n [http://news.bbc.co.uk/2/shared/spl/hi/pop\\_ups/06/sci\\_nat\\_animals\\_in\\_the\\_...](http://web.archive.org/web/20131022133412/http:/news.bbc.co.uk/2/shared/spl/hi/pop_ups/06/sci_nat_animals_in_the_womb/html/1.stm \"http://news.bbc.co.uk/2/shared/spl/hi/pop\\_ups/06/sci\\_nat\\_animals\\_in\\_the\\_womb/html/1.stm\")\n\n"
    },
    {
      "time": "25 Nov 2006 — 7:41am",
      "content": "We have a HUGE roll to play in capitalism! I've never heard the 'war and bombs' slant.\n\n"
    },
    {
      "time": "25 Nov 2006 — 10:43am",
      "content": "The only people who play a big role in politics are politicians and  \nthe people who pay them. The rest of us are pretty much peons.\n\nPlease read my mail in Emigre issue... I forget what number. :-/\n\n\\> I’ve never heard the ‘war and bombs’ slant.\n\nYeah, but you probably haven't heard about this either:  \n [http://news.bbc.co.uk/2/hi/programmes/newsnight/6169006.stm](http://web.archive.org/web/20131022133412/http:/news.bbc.co.uk/2/hi/programmes/newsnight/6169006.stm \"http://news.bbc.co.uk/2/hi/programmes/newsnight/6169006.stm\")\n\nhhp\n\n"
    },
    {
      "time": "25 Nov 2006 — 11:26am",
      "content": "Deleted\n\n"
    },
    {
      "time": "25 Nov 2006 — 1:16pm",
      "content": "Come on guys...\n\nSeriously, I believe that designers, and AD REPS damn them! need to be more congizant of their actions. It comes as a part of being a human being. It takes half a second to spec more environmentally friendly papers, inks, etc.\n\nThe main drawback is quality and cost. But if you can beat it into the Money's head that saying \"environmentally friendly\" on the packaging helps improve their product's image, you might just get your point across.\n\nAs to the war aspect, consider this: The US government washes their tanks with GASOLINE. 'Nuff said.\n\n"
    },
    {
      "time": "25 Nov 2006 — 9:03pm",
      "content": "Re: Original question.\n\nNo.\n\nIf you want to be a concerned citizen, become a politician, and then please stay as far away as you can from me.\n\n"
    },
    {
      "time": "25 Nov 2006 — 10:24pm",
      "content": "Designers _can_ play a huge role in society; most don't. Those designing for products that have a massive impact on the lives of people around the world, or those who get into the world of politics—which they often don't now, as the 24-hour news cycle has wiped out the time needed to work good design into politics—have to be careful about the ethical lines they might be crossing; I believe that most designers are doing quite well when it comes to ethical decision making. I think that this is in large part due to the glaring examples of what happens when designers go bad that we have left over from the twentieth century: all the great designers who worked tirelessly designing propaganda for the Nazi and Communist parties which then committed unconscionable acts against humanity that overshadow all other great evils of history.\n\nSo as designers have to be vigilant, and be sure that none of us is designing the next _Mein Kampf_ or _Little Red Book_. Designers need to be well aware of the world around them; the last thing western civilization needs is a new crop of great propagandists working for groups like ANSWER/The World Workers Party, Hamas, the Muslim Brotherhood, etc. We must also learn from the mistakes of the past, from artists like Paul Renner and El Lizzitsky whose work on behalf of communism helped condemn hundreds of millions of people to tyranny and suffering, or worst of all, Leni Reifenstahl, whose Nazi propaganda work made her the the most influential filmmaker in history, in respect both to cinematic techniques and the millions her work condemned to gas chambers. By studying the ideologies of tyranny—fascism, communism, socialism, jihad, etc.—we can learn to recognize them and their methods, and ensure that we do not lend our efforts to their causes.\n\n"
    },
    {
      "time": "25 Nov 2006 — 10:29pm",
      "content": "\\> ... the last thing western civilization needs is a new crop of  \n\\> great propagandists working for groups like ANSWER/The World  \n\\> Workers Party, Hamas, the Muslim Brotherhood, etc. ...\n\nI don't know where to start explaining how misguided,  \nmisleading and just plain vile your viewpoint is. Sick.\n\nhhp\n\n"
    },
    {
      "time": "25 Nov 2006 — 10:43pm",
      "content": "I'm not exactly sure how it's sick to not want creative people aiding in more of Mao and Stalin's mass murders, Hitler's genocides, or Islamist terrorism in the world... but to avoid starting a flame war, I won't ask, either.\n\n"
    },
    {
      "time": "25 Nov 2006 — 11:38pm",
      "content": "Interesting this year: Haj, Christmas and Hanukkah all happen so close together.  \nWouldn't it be great if they could all be incorporated in some way into a combined festival?  \nIt might lead to a degree of understanding which is sorely lacking at the moment.  \nThanking All for Exchanging [Flowers](http://web.archive.org/web/20131022133412/http:/www.crauswords.com/flowers/WFlowers.htm), not flaming more wars.\n\n"
    },
    {
      "time": "26 Nov 2006 — 5:29am",
      "content": "Being high minded about advertising is hypocrisy.\n\nEverything is propaganda, including this post.\n\npeace\n\n"
    },
    {
      "time": "26 Nov 2006 — 5:48am",
      "content": "\\>Being high minded about advertising is hypocrisy.\n\n\\>Everything is propaganda, including this post.\n\nThese read like excuses for working for anybody, no matter how harmful they or their products are to others.\n\nI think that's probably not what you want do say. Can you clarify what you mean?\n\n"
    },
    {
      "time": "26 Nov 2006 — 6:55am",
      "content": "The Taoists state that making people want things they don't need is harmful.\n\npeace\n\n"
    },
    {
      "time": "26 Nov 2006 — 6:57am",
      "content": "Last week there was an interesting forum about this topic in London:  \neye magazine organised a panel discussion called ‘Burning Issues’.  \n [http://eyeburningissues1.typepad.com/forum/](http://web.archive.org/web/20131022133412/http:/eyeburningissues1.typepad.com/forum/ \"http://eyeburningissues1.typepad.com/forum/\")\n\nOne of the four participants in this panel, the designer Lucienne Roberts, said that of course she is thinking very carefully for which clients she is working for (and for which ones she certainly doesn’t), but she didn’t forget to add that she was in the fortunate position to choose.\n\nI think, this is a very important point she made – a lot of designers, especially if they are just out of college simply do not have the choice. They are lucky if they can get any work at all. But that doesn’t mean that it has to stay like this throughout one’s carrier. The more experience we gain, the more this enables us to make choices – some people choose to go with the stream, some don’t. It is a certain luxury to be able to make choices, and this doesn’t develop by chance – it is the result of a deliberate effort. Responsibility grows with the freedom of choice.\n\nDesign is taking place not in a vacuum or in an ivory tower, but in a certain social and economic environment, largely determined by politics.\n\nWhereas it would be very naïve to think that design can ‘change things’ and it is quite safe to say that the notion of the designer as some sort of self-declared saviour is undoubtedly the result of delusion nourished by vanity, it is also quite irresponsible if we designers prefer to think not about what the effects of our daily work are.\n\nThe designer has a responsibility – a professional one to one’s client (to deliver excellent, good or at least decent work in time and on the previously agreed terms) as well as an ethical one (do we think that the result of what we are doing is helping to promote ideas that we think are worth to be promoted or at least do not cause harm?) – in the same way as any other profession has. It is up to anyone of us to make decisions how we want to deal with this responsibility and how far we want to take this responsibility serious or not.\n\nThe best way to increase the effect of what we are doing is to work on our qualification, the best way to increase our judgement on ethical questions is trying to be informed about the political and economic framework in which we are working (which is easier said than done, especially if we live in states that are quite actively engaged in conflicts).\n\nBTW:  \nPaul Renner was never a communist, he never promoted revolutionary ideals (and therefore was harshly denounced by Tschichold – behind his back, which was probably not very fair by Tschichold, since it was Renner who invited Tschichold to teach at the Meisterschule in Munich). In fact, he was a conservative liberal who just cared about social issues.\n\n"
    },
    {
      "time": "26 Nov 2006 — 7:08am",
      "content": "\\> Whereas it would be very naïve to think that design can ‘change  \n\\> things’ and it is quite safe to say that the notion of the designer  \n\\> as some sort of self-declared saviour is undoubtedly the result of  \n\\> delusion nourished by vanity, it is also quite irresponsible if we  \n\\> designers prefer to think not about what the effects of our daily  \n\\> work are.\n\nSuperbly expressed.  \nAnd this really applies to everybody, not just designers.\n\nhhp\n\n"
    },
    {
      "time": "26 Nov 2006 — 7:26am",
      "content": "but hey wait guys, what about NIKE? they use slave labour in 3rd world countries and what about that? should designers support them? NO! why? becuase they arent humane enough for using poor little children for thier work and paying them hardly anything for thier efforts and making millions out of it. now is that humane? NO it isnt! they're off thier heads. why would anyone want to advertise thier products if MONEY is all they think about. what about issues surrounding it all? would you advertise for them? i certainly wouldnt!\n\n"
    },
    {
      "time": "26 Nov 2006 — 8:10am",
      "content": "Agreed Wolfgang. But I think I make a much bigger difference in my interpersonal relationships - which are my interface with society.\n\nMy career is by nature - flawed - since I would not be doing it given a choice.\n\npeace\n\n"
    },
    {
      "time": "26 Nov 2006 — 11:06am",
      "content": "I believe there's a position open at the CIA for a graphic designer:  \n [https://www.cia.gov/careers/jobs/graphic\\_designer.html](http://web.archive.org/web/20131022133412/https:/www.cia.gov/careers/jobs/graphic_designer.html \"https://www.cia.gov/careers/jobs/graphic\\_designer.html\")\n\n"
    },
    {
      "time": "26 Nov 2006 — 12:12pm",
      "content": "interesting discussion again.\n\n----------  \n**Paul Ducco**  \n [Design, Melbourne](http://web.archive.org/web/20131022133412/http:/www.solid-creative.com/print.htm)  \n----------  \n [Little Mischief](http://web.archive.org/web/20131022133412/http:/www.littlemischief.com/)\n\n"
    },
    {
      "time": "26 Nov 2006 — 12:27pm",
      "content": "<cite>but hey wait guys, what about NIKE? they use slave labour in 3rd world countries and what about that?</cite>\n\nThat's essentially the point of many previous posts: if a designer feels that a potential client's behavior is unethical, he or she should not take on the job. And when it comes to companies like Nike there are a lot of designers out there who don't take the work. There are design firms out there that do nothing but non-profit work for this reason.\n\n<cite>I think, this is a very important point she made – a lot of designers, especially if they are just out of college simply do not have the choice.</cite>\n\nThat sounds more like an excuse than a well-reasoned maxim. In free nations, if a designer runs into ethical complications, he has the option to just not do the work. That might mean not working in a great design job, or even not getting paid to work in design, but a designer still has the option of not doing work he finds reprehensible.\n\n<cite>Paul Renner was never a communist...</cite>  \nIn retrospect I should never have mentioned Renner. What I know of him is what's popped up in passing in survey texts, in which I have seen him painted as a socialist, communist, and other things.\n\n<cite>I believe there’s a position open at the CIA for a graphic designer...</cite>\n\nI've talked to people who had those jobs. The work is mostly internal document layout, although if you're really lucky, you get a job “designing” fake IDs.\n\n"
    },
    {
      "time": "26 Nov 2006 — 12:30pm",
      "content": "Miss Giggles (it'll be nice to know your real name one day) I strongly recommend a book called \"The Green Imperative\" by Victor Papanek. To start with.  \nIt might answer some of your questions. Enjoy.\n\n[http://www.co-design.co.uk/victor.htm](http://web.archive.org/web/20131022133412/http:/www.co-design.co.uk/victor.htm \"http://www.co-design.co.uk/victor.htm\")\n\n"
    },
    {
      "time": "26 Nov 2006 — 1:12pm",
      "content": "Prawns, let us fry!  \nWhy was I born and will die?  \nHow should I dive and fly?\n\nWinner if I know how and why?!  \nLoser If do not know how and why?!  \nExploited if I know how but not why?!\n\nWait! why I was given ear and eye?  \nGuided to the how only if I know why  \nTo make a hole in the dry  \nOr a ladder in the sky?!\n\n"
    },
    {
      "time": "26 Nov 2006 — 1:21pm",
      "content": "Renner was an interesting figure. One generation older than the modernists, he started as a traditionalist, but later he incorporated some of the views of the modernists into his work without sharing their political ideas. Nevertheless, the fact that he defended the ideas of the modernists against attacks from the Nazis made him loose his job as head of the Meisterschule in Munich.\n\nChristopher Burke: Paul Renner. The Art of Typography, published by Hyphen Press, is the best account of his life and work available in English.\n\n"
    },
    {
      "time": "26 Nov 2006 — 1:50pm",
      "content": "Here's some interesting environmentally friendly advertising:  \nThese guys in Vancouver have been cycling for over 4 days. The ad not only promotes the LED lights, but it also promotes the cycling team that is taking part. Everyone at the site is having fun, the campaign doesn't harm the environment, and everyone benefits.\n\n ![](http://web.archive.org/web/20131022133412im_/http:/typophile.com/files/IMGP9484_6367.jpg)\n  \nBut as to promoting hatred of any form, reasonable people aren't going to promote Nazism. People whose sense of reason is based on the almighty dollar might. \n\nSo the arguement boils down to \"what can we do individually, ethically and conscienciously?\"\n\n"
    },
    {
      "time": "26 Nov 2006 — 1:53pm",
      "content": "Dan, this is brilliant. It had to come from Vancouver.\n\n"
    },
    {
      "time": "26 Nov 2006 — 3:42pm",
      "content": "Thank you Wolfgang Homola, I enjoyed your writing.\n\nBecause of the circumstances in which they encounter it, children tend to misunderstand wealth. They confuse it with money. They think that there is a fixed amount of it. And they think of it as something that's distributed by authorities (and so should be distributed equally), rather than something that has to be created (and might be created unequally).\n\nThe difference between design and research seems to be a question of new versus good. Design doesn't have to be new, but it has to be good. Research doesn't have to be good, but it has to be new. I think these two paths converge at the top : the best design surpasses its predecessors by using new ideas, and the best research solves problems that are not only new, but actually worth solving. So ultimately we're aiming for the same destination, just approaching it from different directions.\n\nDesign begins by asking, who is this for and what do they need from it ?  \nA good architect, for example, does not begin by creating a design that he then imposes on the users, but by studying the intended users and figuring out what they need, not \"what they want.\" This may vary from field to field in the arts, but I don't think there is any field in which the best work is done by the people who just make exactly what the customers tell them to.\n\nIt's hard to design something for an unsophisticated user. It's hard to stay interested in something you don't like yourself. To make something good, you have to be thinking, \"wow, this is really great,\" not \"what a piece of sh\\*\\* ; those fools will love it.\"  \nDesign means making things for humans. But it's not just the user who's human. The designer is human too.\n\n"
    },
    {
      "time": "26 Nov 2006 — 6:09pm",
      "content": "_But as to promoting hatred of any form, reasonable people aren’t going to promote Nazism._\n\nMaybe not now, but in the 1920s and 1930s a lot of reasonable people jumped on to the Nazi bandwagon. That's why designers must be aware of happenings past and present at local, national, and international levels. We must be able to spot the evil in the world, and at a minimum, not become a part of it.\n\nPersonally I think that all accredited design education entities should be required to include instruction in ethical philosophy to ensure that students develop the mental faculties required make solid ethical decisions. Many business degrees now do so, and I feel that it's just as important for design professionals to understand ethics as it is for middle management to.\n\n"
    },
    {
      "time": "26 Nov 2006 — 7:01pm",
      "content": "Bad graphic design is to blame for most of the world's problems over the last 6 years - anybody remember the butterfly ballot? 3000 Jews in Palm Beach who voted (NOT) for Pat Buchanan...\n\n"
    },
    {
      "time": "26 Nov 2006 — 8:36pm",
      "content": "Hats off to Wolfgang and Alessandro for raising the level of this post! Thankyou gentlemen.\n\nAs for MissG's original question – \"what else should a designer keep in mind...\", I'd say that the chief requirement is to keep that mind _open_.\n\nI worked for a couple of non-profits when I was a student; in hindsight it was an absolute luxury, and one that I could afford at the time. Lots of people simply don't have the choice. These days I occasionally use Papanek's blistering condemnation of the design and advertising industries (Design for The Real World, Paladin, 1972) as the raw text for typesetting exercises.\n\nSome long-held convictions of mine about design and ethical conduct got recently overturned by reading both the article and ensuing comments on Michael Bierut's designobserver blog about how five American 'star' designers boycotted a national design awards function at the White House in July of this year. It's at\n\n[http://www.designobserver.com/archives/015742.html](http://web.archive.org/web/20131022133412/http:/www.designobserver.com/archives/015742.html \"http://www.designobserver.com/archives/015742.html\")\n\nand perhaps more importantly, James Victore's panelled discussion between Crye Associates and The 62, published by the AIGA, entitled [Fresh Dialogue 6: Friendly Fire](http://web.archive.org/) was a bold move to highlight some of these issues. It gave me the chance to reconsider what professionalism might really constitute in this context.\n\nIf this kind of stuff genuinely interests you, MissG, keep reading and keep questioning (yourself as much as anyone else).\n\nJames Puckett, you know I've told you before – on other threads here at typophile – to read the literature on Paul Renner before you go blackballing him as either a Nazi or a Communist. He wasn't either of those things. That other people on this thread are _still_ telling you to read Christopher Burke's book shouldn't suprise me, but it does disapoint me. Likewise to shrug off your bias as originating in uncited texts that 'popped up in passing' does you no favours either. Doubtless you think you're 'reasonable people' too; after all you're on talking terms with CIA employees.\n\n"
    },
    {
      "time": "26 Nov 2006 — 9:31pm",
      "content": "Thanks for sharing that info about the National Design Awards. I couldn't have attended an awards ceremony at the White House either (not that I was invited lol) and that makes me respect those designers and their ethics.\n\nPart of Buddhism's eight-fold path is \"right livelihood\". I could beat myself up for not being a doctor or teaching inner city youth or volunteering to rebuild villages destroyed in awar. We can't fool ourselves that design makes that kind of difference in the world. One reason I've chosen to work in book publishing rather than, say, advertising or branding is that I find it easier to live with myself - I think the world needs more books.\n\nTo quote Jimmy Ernst:  \nArtists and poets are the raw nerve ends of humanity.  \nBy themselves they can do little to save humanity.  \nWithout them there would be little worth saving.\n\n"
    },
    {
      "time": "26 Nov 2006 — 10:06pm",
      "content": "<cite>you know I’ve told you before – on other threads here at typophile – to read the literature on Paul Renner before you go blackballing him as either a Nazi or a Communist...</cite>\n\nHonestly, I believed Paul Renner was a communist (specifically a Bolshevist) because I actually spent some time reading about him last year after I had earlier read some poorly translated texts that tied the design of Futura to the Nazis. I'm not attempting to shrug off my mistake, it's just that I've read so many design texts that mention Renner that I can't keep track of them; his name pops up more often than Tschischold's in design books, and at this point I realize I'm quite confused about the man. Regardless, I'm happy to be proven wrong, so I've ordered the book and when it arrives I'll read it and get back to you.\n\n"
    },
    {
      "time": "26 Nov 2006 — 10:49pm",
      "content": "<cite>One reason I’ve chosen to work in book publishing rather than, say, advertising or branding is that I find it easier to live with myself - I think the world needs more books.</cite>\n\nI think that the world has too many books. At least, too many worthless piles of trash that pass themselves off as books. It's a shame that so many people can't tell the difference between something worthwile to read and something that atrophies their minds.\n\nOur real ethical challenge as Designers for Humanity™ is that there is so much STUFF bombarding people's eyes that it is hard to tell what is truly beautiful anymore. People hardly have any frames of reference to make sound judgements. Things are so muddy that there isn't a Yin or a Yang. There is only Gray chaos with a few bright spots here and there.\n\nThe least we can do is try to be those bright spots by being dedicated to the traditions of our craft and continuously trying to make it even more useful and beautiful.\n\n"
    },
    {
      "time": "26 Nov 2006 — 11:16pm",
      "content": "<cite>At least, too many worthless piles of trash that pass themselves off as books.</cite>\n\nHey, some of us need a rest from the serious stuff now and then, and even pulp is better for the mind than most television! I had to read a pile of crap from BL publishing to recover after I finished _House of Leaves._\n\n<cite>there is so much STUFF bombarding people’s eyes that it is hard to tell what is truly beautiful anymore. People hardly have any frames of reference to make sound judgements.</cite>\n\nI don't think so. I just spent a few days playing with my toddler niece and driving around in the desert, which is always a reminder that if smiling kids and rugged landscapes aren't great frames of reference, nothing is. When art or design contains barely a tiny shade of the beauty we can find in the undesigned world, the ugliness stands out just as much as it ever has, and we eventually learn to see through it all and appreciate the good stuff even more.\n\n"
    },
    {
      "time": "26 Nov 2006 — 11:47pm",
      "content": "So far, all are thinking within one or more systems!  \nIt is the Systems that have to be changed, not changing items!  \nNeed a system changed? Email the Designer of our systems?\n\n"
    },
    {
      "time": "27 Nov 2006 — 12:07am",
      "content": "Missgiggles\n\nStarting from your post and ignoring all the rest (though I like Paul Cutler's remarks), graphic designers do whatever they are paid to do. There is no ethics involved in this. If there were, some of them might starve. Never heard of that happening. Mainly, some of them just quit. Those are the good folk. But nobody knows who they were.\n\nGerald\n\n"
    },
    {
      "time": "27 Nov 2006 — 12:25am",
      "content": "<cite>even pulp is better for the mind than most television!</cite>  \nHere Here! I certainly agree. It's just so easy to get angry at the ignorant/lazy design flooding the senses perpetually.\n\n<cite>There is no ethics involved in this</cite>  \nWhat kind of a thing is that to say? There is ethics in every single action we make. Yes, we are paid as visual communicators, and yes, we mostly turn a blind eye on the banal. But when it comes to being socially and humanely responsible <cite>as it purtains to our limited scope of design</cite>, then we must do whatever is ethically correct, regardless of the compensation.\n\n"
    },
    {
      "time": "27 Nov 2006 — 4:00am",
      "content": "Ben Archer, thank you.  \nAziz, what ?\n\n… this vision is also described by Dante in the _Divina Commedia_. Resonantor sympathetic nets formed interconnections through the whole system so that no event occurred alone. In this cosmos significant coincidences were naturals.\n\nJust pay attention, the intellect has little to do with the road to discovery, so innovation does not require starting from scratch. This is good, because you can’t start from scratch : the universe has been here for a while.\n\nIn fact, successful innovation often happens simply because a curious person paid careful attention to how something in the world works. And once they really understood how people use that thing, they could see what was both good and bad about its value to those people. With that understanding, a creator can apply their imagination towards new ideas that eliminate the bad and expand on, or leap-frog, the good. Technical brilliance may be the only way to realize that imagination, but it’s the ability to generate or recognize those meaningful ideas that drives the best kinds of innovation.\n\nGerald Lange, it’s a pity you ignored the rest of the posts here, since you might have some good hints related to the hands-on nature of the creative typographic job for the book arts, I prefer to think you didn’t have got the time.\n\nIndeed time is fleeting, for the ambiguous, time is ambiguous ; for the hero the time is heroic ; for the whore, the time is just another game. If you are gentle, your time is gentle ; if you are in a hurry, time blows away ; time is a servant if you are his chief ; time is your god, if you are his dog. We are the creators of the time, the dupes of the time and the murderers of the time. Time is without time.\n\n"
    },
    {
      "time": "27 Nov 2006 — 4:15am",
      "content": "Which one what?  \nYour last posting is far away from what I mean in my 2 earlier postings.\n\n"
    },
    {
      "time": "27 Nov 2006 — 4:48am",
      "content": "Aziz, for example I didn't understand the \"systems\" issue.\n\n"
    },
    {
      "time": "27 Nov 2006 — 7:43am",
      "content": "Time is god.\n\nhhp\n\n"
    },
    {
      "time": "27 Nov 2006 — 10:53am",
      "content": "Alessandro Segalini, Systems mentioned in the earlier posting are respectively:  \n1 political 2. engineering (example for 1) 3. our ins+outs  \nElaborating:  \nTill when we allow Kapi+ Soci play their demo game.  \nFlipping and Rotating us with parties shame.  \nNeither has solutions 4 problems as they claim.  \nWhere, when, how and by who they came?  \nWho gave them the right to speak in my name?  \nHow do they know Man's ins+outs and aim.  \nSo be not a tool in either hands, they are same.  \nA role we have to play or people will blame.\n\n"
    },
    {
      "time": "27 Nov 2006 — 11:43am",
      "content": "Okay, okay... While topics like this bring up very good points, they can also border on being a bit too self-important.\n\nDo designers play a huge role in society? Sure. Let's back up a minute, because, so do custodial workers. Take a stroll through the streets of New York City on any given trash collection day to see just how big the role of custodial workers are on society as a whole.\n\n_That might mean not working in a great design job, or even not getting paid to work in design, but a designer still has the option of not doing work he finds reprehensible._\n\nThis comment can be made ONLY by a person who is not living in poverty. Too many people often forget that living in the United States, or even being a student affords you luxuries that other people around the world don't have the luxury of. Like eating daily for example.\n\nAs a side note, on the Nike issue. Let me paint for you two pictures that I think are very similar, though they don't appear to be on the outside. Taking on Nike as a client is a lifestyle choice. Much like people in ghettos who choose to sell drugs. While one obviously appears to be more reprehensible on the surface, everyone has their own state of normal. Both households have mouths to feed. Both have a desire to attain material possessions.\n\nDifferent people from different financial brackets are presented with different options in life. So, before we all start pointing fingers about what is right and wrong— realize that many of us have a CHOICE in sitting down to eat our vegan meals. Most of us in this thread don't have to sell illegal drugs to feed our families. I challenge anyone here to spend two weeks in Afghanistan without a dollar in your pocket. Let's see what you do then.\n\n"
    },
    {
      "time": "27 Nov 2006 — 12:34pm",
      "content": "Terry, right on.\n\nhhp\n\n"
    },
    {
      "time": "27 Nov 2006 — 1:03pm",
      "content": "What a coincidence, I just received this, check out : [http://www.worldonfire.ca/](http://web.archive.org/web/20131022133412/http:/www.worldonfire.ca/ \"http://www.worldonfire.ca/\")\n\n"
    },
    {
      "time": "27 Nov 2006 — 2:12pm",
      "content": "Miss Giggles, No. As _human beings_ we have a huge role to play in society. As designers, very few of us will possess an immense enough cultural impact to affect the world as designer. The beautiful advertising for the most vile corporations and causes shows that there is no shortage of capable designers willing to do dirty work.\n\nSome people are more bothered by working for and promoting Nikesque businesses than others are. Those of us most bothered will always try to find a way out. Unfortunately, its simply not easy. Even those who hold the most liberal beliefs in America are usually walking hypocritical nexuses, as they benefit from what they claim to despise, even indirectly. Want to free Tibet? Boycott China; good luck. Want organic foods? How do you think it arrived fresh at the Wal-mart that is bankrupting your home town?\n\nI am looking for the right charity to donate a portion of !Exclamachine sales to. To me, this is essential to the process of moving from just free toys to trying to make income from it. Interestingly, every person I've mentioned this to thinks it is a bad idea. I can't imagine it any other way. This is part of getting to be my own boss, no? It wont make a huge difference in big picture, but it will do something, I hope.\n\nThese sort of struggles have nothing to do with being a designer, but with being alive.\n\n[Choz Cunningham](http://web.archive.org/web/20131022133412/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20131022133412/http:/www.exclamchine.com/)  \n [The Snark](http://web.archive.org/web/20131022133412/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "27 Nov 2006 — 5:42pm",
      "content": "<cite>This comment can be made ONLY by a person who is not living in poverty. Too many people often forget that living in the United States, or even being a student affords you luxuries that other people around the world don’t have the luxury of. Like eating daily for example.</cite>\n\nOn the contrary, I know exactly how privileged Americans are. And I appreciate that I'm lucky enough to be among the tiny minority of people who live in free nations and have the option of living by principles should we choose to do so. That's why I consider ethical behavior to be of great importance to those of us who have the option.\n\n"
    },
    {
      "time": "27 Nov 2006 — 7:20pm",
      "content": "Except for some reason your freedom (which in effect is mostly a carefully  \ncrafted illusion) seems to result in extremely unethical aggregate behavior...\n\nhhp\n\n"
    },
    {
      "time": "27 Nov 2006 — 8:20pm",
      "content": "The freedom need only be enough that you don't know what to do with it, It is not about illusion, but that nobody wants absolute freedom for everyone, no matter who they quote, or what they claim.\n\nThe extremely unethical behavior I imagine you are referring to is likely that typical of any empowered group. Or, in my suspicions, any potentially empowered group. People corrupt, power illuminates.\n\n[Choz Cunningham](http://web.archive.org/web/20131022133412/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20131022133412/http:/www.exclamchine.com/)  \n [The Snark](http://web.archive.org/web/20131022133412/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "27 Nov 2006 — 8:28pm",
      "content": "People are peons, and the ones who don't know that are the most dangerous. It's not that some groups are Good and some are Evil, it's that some are more aware and others are more deluded. When somebody is sitting at the epicenter of world misery and thinks he's actually doing the world a favor, then that's a problem.\n\nhhp\n\n"
    },
    {
      "time": "27 Nov 2006 — 8:39pm",
      "content": "\\>_Whereas it would be very naïve to think that design can ‘change things’ and it is quite safe to say that the notion of the designer as some sort of self-declared saviour is undoubtedly the result of delusion nourished by vanity, it is also quite irresponsible if we designers prefer to think not about what the effects of our daily work are._\\<\n\nWith all due respect, you couldn't be more wrong if you tried.\n\nMissgiggles, when you use the word - designer - does that include the architect?\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    }
  ]
}
