{
  "id": "2971",
  "title": "Old Theatre Playbill Type & Typography",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I'm doing some prelim work/ research for a pro-bono client that's related to theatre. I'd like to draw some subtle inspiration from old playbills, broadsheets, etc. from the era of Shakespeare (which is around Gutenberg's time), but I'm willing to look at other pre-1900s eras that had interesting stylistic qualities. Everyone's so familiar with the strong graphic styles of the 20th century, but I want to see early work that did rely on graphics and colors as much.   \n   \nI'm looking for good resources (books or web) to peruse. I'd like to see the type itself, but how it was composed for the theatre and any decorative elements used to complement it are actually more of interest to me. I know this is vague, but the project's a little open-ended and I can't really get into it until we're close to completion.   \n   \nTo be honest, I'm not even sure there's much to be found in the earlier time periods I described, so I'm really just looking for a few good samples. I plan on hitting the stacks later this week, but any leads would do me a world of good.\n\n",
  "author": "Chris Rugen",
  "time": "3 February, 2004 - 11:28pm",
  "uid": "2172",
  "comments": [
    {
      "time": " 4 February, 2004 - 8:05am",
      "content": "You might poke around at [this site](http://web.archive.org/web/20051127115628/http:/www.rdg.ac.uk/globe/home.htm) about the Globe Theatre.   \n   \nAnd you can view some pages from the Shakespeare Folio text at [Octavo.](http://web.archive.org/web/20051127115628/http:/www.octavo.com/collections/projects/shaf1b/index.html)   \n   \nBTW, Shakespeare's dates are more than a century after Gutenberg's.\n\n"
    },
    {
      "time": " 4 February, 2004 - 10:12am",
      "content": "Yeah, it was late last night when I posted. I was conflating 1500's with 15th century to create a silly mistake. Too much work, too little time. ![:-)](http://web.archive.org/web/20051127115628im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nThanks for the links.\n\n"
    }
  ]
}
