{
  "id": "29729",
  "title": "Typophile \"To Do\" 2007",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "We're starting up a new \"To Do\" list for 2007 for Typophile, and want to make sure we've got your input. What improvements or enhancements would you like to see that would make Typophile a better experience?\n\n//jb\n\n",
  "author": "<a href=\"/web/20111225221138/http://typophile.com/user/3\" title=\"View user profile.\">Jared Benson</a>",
  "time": "<br>",
  "uid": "3",
  "comments": [
    {
      "time": "",
      "content": "Is there a way to prevent it from disappearing for days on end, on a regular basis?\n\n"
    },
    {
      "time": "",
      "content": "Gulp. Here's an easier one: include the names of posters in the RSS feeds.\n\n"
    },
    {
      "time": "",
      "content": "fundamental:  \n- reduce website downtime!\n\nnice to have:  \n- database of typeface pairings: eg \"what goes well with X\"\n\n"
    },
    {
      "time": "",
      "content": "Make Navigation easier by adding \"?from=00\" to the created node as explained [here](http://web.archive.org/web/20111225221138/http:/typophile.com/node/28383?from=24&comments_per_page=50)\n\n"
    },
    {
      "time": "",
      "content": "Put the 'next page' 'last page' navigation items on top of the page too. Now we always have to scroll to the very bottom of the page to access those.\n\nMight there be a possibility to add a button which allows you to switch from \"first post on top of the page\" to \"last post on top of the page\"?\n\n\\> _database of typeface pairings: eg “what goes well with X”_\n\nErrr... this hasn't got anything to do with website functionality. It's up to us users to provide this kind of content, not Typophile. Please stick to functionality issues or this thread is going to become _very_ messy.\n\n"
    },
    {
      "time": "",
      "content": "Oh, do you still have my list for the Type ID Board?\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20111225221138im_/http:/typophile.com/files/Picture-1_5051.gif)\n\nWhy does the critique section get the red-headed step-child treatment? Plus, there's a little section in there on \"Typography\" that has nothing to do with \"typefaces on the chopping block.\"\n\nJust a question...\n\n"
    },
    {
      "time": "",
      "content": "<cite> Put the ‘next page’ ‘last page’ navigation items on top of the page too. Now we always have to scroll to the very bottom of the page to access those. &amp; “first post on top of the page” to “last post on top of the page”?</cite>\n\nExactly!\n\nMore links around to each of the heavily used areas too. eg:\n\nUnder \"Home » forums » General Discussions\" we could have:  \n [Post a new topic | My topics | Active topics] and General Discussions, Design, Critique, Build, Release, Type ID Board, Special Interest Groups and to make it the BOMB you could have text links to the critique areas too. I know it seems like alot but it would cut the number of page loads I give the site by 1/2 to 2/3. And it would make me so happy!\n\nOh! And thank you very much for asking!\n\n"
    },
    {
      "time": "",
      "content": "Maybe stop using Flash for the 3 columns on the fontpage.  \nHottest, Newest, Handpicked.\n\nWould be grest to be able to Apple+Click links for us using browsertabs  \nNot to mention that the use of Flash here is pointless ;)\n\n---  \nOscar Bjarna  \n [http://analog.sys.is](http://web.archive.org/web/20111225221138/http:/analog.sys.is/ \"http://analog.sys.is\")\n\n"
    },
    {
      "time": "",
      "content": "<cite> &gt; Errr… this hasn’t got anything to do with website functionality. It’s up to us users to provide this kind of content, not Typophile. Please stick to functionality issues or this thread is going to become very messy.</cite>\n\nYes we are fully aware users provide this content. It is up to a website to provide functionality to manage this user knowledge- just like a wiki manages knowledge.\n\nI'm sorry, the original post did not and does not mention the word functionality, and appears to invite \"improvements and enhancements\". Why shoot down ideas in a thread which invites ideas? If the original thread is worded incorrectly, please moderate or ammend it.\n\n"
    },
    {
      "time": "",
      "content": " **Improve the Search feature** — I have the impression only the first page of a thread is searched after when searching at a given keyword or string.The Search function is the only way to access the Archives in a precise way and hence is of crucial importance.\n\n**Direct access to ongoing discussion** — It might be useful to give direct access to the latest post on Typophile, i.e. the post(s) that is (are) showing in the background of the homepage (behind the three columns).\n\n"
    },
    {
      "time": "",
      "content": "\\> _I’m sorry, the original post did not and does not mention the word functionality, and appears to invite “improvements and enhancements”. Why shoot down ideas in a thread which invites ideas? If the original thread is worded incorrectly, please moderate or ammend it._\n\nWe clearly understood the original question differently. Maybe start up a new thread in General Discussions with your request about typeface pairings, so we can follow up on that? :^)\n\n"
    },
    {
      "time": "",
      "content": "I still can't see any of the thread titles when viewing the actual thread. This can make navigating the site confusing when one uses tabs.\n\nI assume it's either a Flash or Firefox issue (or combination thereof).\n\nSmall bug, but when URLs are listed on multiple lines right after each other, only the last one is clickable.\n\n"
    },
    {
      "time": "",
      "content": "There are a number of suggestions not yet implemented that were in the 'bug' thread when Typophile 5 was in Beta.\n\nSome that I remember, in two categories:\n\nNAVIGATION TO NEW POSTS\n\n1. Have the page navigation at the top as well as the bottom. Many suggested this earlier including me; it is renewed above. I would think this would be easy to implement.\n\n2. Mark Simonson suggested to include in the 'all recent' results the categorization of posts by menu area. Addicts like me frequently use this as a button on our browser bar, and that category information would be helpful.\n\n3. Someone recently pointed out that clicking on the 'new' highlight on the right brings one to new posts--almost. It brings you to the last new post if there is only one page. Otherwise it brings you to the first page. If this were fully functional--bringing you to the first new posting in a thread--it would be a big improvement for the frequent visitor.\n\nMENU IMPROVEMENT\n\n1. Eliminate sub-menus, so the all menu items show updates. How to do this while keeping the same number of menu items:\n\n1A. Combine the Build and Release categories into one top-level. (Release is much less active than Build.)\n\n1B. Put all the Critiques into two categories: Type Design and Logo/Corporate ID. --The latter has many more postings than the other critique categories.  \nThis would put everything on one menu level, and then show updates.\n\n2. (New suggestion) The 'special interest' area seems to have little activity. A possible better use is to make it one category: 'Typographic Education: Teachers and Students.'\n\n2A This category could have a 'Frequently asked novice questions' with answers at the top. Eg: what are best books and web sites for beginners to learn about typography and type design.\n\n2B This category could also have at the top list of 'Resources for teachers' list, eg links to the sites of teacher Mark Jamra, James Craig, Ellen Lupton.\n\nOf course, it would be good to have a mechanism for updates of both the novice student and teacher lists. Edit: perhaps the Wiki would be a good device for both lists, and keeping them updated.\n\nI am not saying that all student questions should be shunted to this category, but those that are clearly asking for homework and term project help could be shifted to this category by moderators. They would still get help, but people could then choose whether they want to be involved in this--there have been complaints on this score before on a number of threads.\n\nCONTRAST\n\nOh, and one more. My pet peeve: put white or at least a lighter grey behind the text on the postings. Contrast (short of dazzle) increases readability.\n\nPS\n\nIf you have to prioritize to one or two improvements, in another week you might put up a survey question what changes people most want.\n\nOh, and Typophile is great. Yay hooray!\n\n"
    },
    {
      "time": "",
      "content": "<cite>but people could then chose whether they want to be involved in this</cite>  \nAre you saying that people don't have the choice now?\n\n"
    },
    {
      "time": "",
      "content": "\\>Are you saying that people don’t have the choice now?\n\nNo, of course they have a choice. I didn't put it well. What I meant is that people who don't even want to look at these novice questions--and several have written to this effect--would be free to ignore the whole category and spend not time on it. Those who want to help students could navigate there.\n\n"
    },
    {
      "time": "",
      "content": "First: thanks.\n\nThe big -and I mean BIG- two:  \n1) Please fix the search/archives. Please. It's very discouraging  \nto type gobs for years and then not be able to access any of it.  \n2) Revive emailing of posts. If you don't want to (liability issues? I understand  \nI guess) then please make the RSS work for real real. If you don't do that either,  \nthen in the Tracker please mark the section (like \"Type ID\") the thread is in.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> please make the RSS work for real real.\n\nCan you elaborate? It's doing fine for me, except for a few additions like the poster's name and an RSS feed for the user tracker page.\n\n"
    },
    {
      "time": "",
      "content": "Frankly I haven't fooled with it enough to be sure, but:  \nDo you get a RSS item\\* for every single post made?\n\n\\* I'm sure that's not the term, but you know what I mean.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "A couple of stickers for me:\n\n1) Regarding search, allow us to sort the results by recency. I often want to find the latest posts regarding an ongoing topic or theme.\n\n2) Nuke the on-page Instant Messenger. Unless the duplicated messages and post-back page loads can be eliminated. I think a site-wide shout box (private and/or public) is a much better implementation of this. Perhaps some AJAX-iness could be applied to this feature?\n\n"
    },
    {
      "time": "",
      "content": "_Do you get a RSS item\\* for every single post made?_\n\nif i understand correctly, you can if you subscribe to the rss feed to a particular thread. to do so, just click on the rss link at the bottom of the initial post.\n\n"
    },
    {
      "time": "",
      "content": "Also the input field for the Instant Messenger is way too small. The people demand a textfield!\n\n"
    },
    {
      "time": "",
      "content": "Include a proper `<link>` declaration for the RSS feed in the header of every page. This way you can easily navigate, view and bookmark the feed version of any thread in browsers that support integrated feed readers.\n\n`<link rel=\"alternate\" type=\"application/rss+xml\" title=\"RSS\" href=\"http://typophile.com/threadrss/29729\" />`\n\n"
    },
    {
      "time": "",
      "content": "Oh, I'd also like to echo the comments regarding 'bubbling up' the critique section to the top level.\n\n"
    },
    {
      "time": "",
      "content": "<cite>1B. Put all the Critiques into two categories: Type Design and Logo/Corporate ID. —The latter has many more postings than the other critique categories.<br>\nThis would put everything on one menu level, and then show updates.</cite>\n\nI think the \"typography\" section of Critiques would be used more if it were given more space. Currently, a lot of people post designs and things into `Forums>Design` for critique, rather than the `Forums > Critique > Typography / Composition` section.\n\nNow, if you were to break off an entire forum just for typographic education, that might be a place to put it. I personally think it should be integrated more into the Design Forum, but hey, whatever.\n\n"
    },
    {
      "time": "",
      "content": "\\> you can if you subscribe to the rss feed to a particular thread.\n\nToo much work/attention required.\n\nBTW, I've found the IM to be quite useful.  \nThe shoutbox can be (in fact was) pretty  \nuseful too, but in a totally different way.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\>Currently, a lot of people post designs and things into Forums\\>Design for critique, rather than the Forums \\> Critique \\> Typography / Composition section.\n\nYes, my proposal just reflects the reality of what is going on, and puts it upfront in the menu structure.\n\nThe basic thing is that the forum sub-menus should be eliminated--it seems from the low traffic that they are an extraneous layer--one layer too many for navigation.\n\n"
    },
    {
      "time": "",
      "content": "The RSS feed for all new threads in every category (as far as I know) is: [http://typophile.com/rss](http://web.archive.org/web/20111225221138/http:/typophile.com/rss \"http://typophile.com/rss\")\n\nThis, combined one's [User Tracking page](http://web.archive.org/web/20111225221138/http:/typophile.com/user/103/track) (which needs a feed, as I mentioned before), is all one needs to thoroughly stalk all Typophile activity.\n\nIf you'd like to track a thread to which you haven't contributed, you can subscribe to it's specific RSS feed at the bottom of the first post:\n\n ![](http://web.archive.org/web/20111225221138im_/http:/typophile.com/files/SafariScreenSnapz004_6048.png)\n\n"
    },
    {
      "time": "",
      "content": "\\> [http://typophile.com/rss](http://web.archive.org/web/20111225221138/http:/typophile.com/rss \"http://typophile.com/rss\")\n\nI tried to get RSS working in the past, and the net result was having to install new apps that I never used, something that annoys me no end, so allow me to make sure by asking: is that a \"master\" feed that I can subscribe to once and get everything \"delivered\"? But if so, why would I still need the tracking page?\n\nAlso: is there a way to exclude certain subfeeds (like Type ID) from the master feed?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\\> But if so, why would you then need the tracking page?\n\nThe general RSS only tracks new threads (that is: the first post in each new topic). RSS that tracks every post would be very hefty indeed, but I understand the desire for completeness.\n\n"
    },
    {
      "time": "",
      "content": "Some sort of RSS feed management tool within your profile setting might be a handy addition. For example, blending multiple feeds into a single aggregated feed. Or simply viewing at a glance which feeds you've subscribed to. Wish lists are for wishes, right?\n\n"
    },
    {
      "time": "",
      "content": "There you go. Basically it doesn't work.\n\nMore than completeness (I no longer read everything) it's a matter of efficiency: it's a pain to manually subscribe to things when all I need to do is gloss over a given post (with its section name and subject heading) and decide if it's worth enough. Since interesting digressions are the norm here, individual posts are worth more than where they are.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I apologize if this isn't what you are soliciting, but I belive it is an issue that will have to be addressed eventually: Typophile has become a major information hub for type-related topics (Bravo!). In that role, it has to evolve to continue providing so much to so many. It's clear from other posts that some topics or threads are buried, and some are too prominent. It's also clear that some topics or headings are trafficked much more heavily than others.\n\nMy suggestion is basically: re-organize the front page and \"Forums\" page to accomodate the changing uses we've discovered for Typophile. For example; I'd put Type ID, Free Fonts, Student Topics, Critiques, Designing Typefaces, and Using Type\\* at the top, most prominent, since they are the busiest areas that receive the most repeat questions. All critique areas should be handled the same, and it should be structurally clear that a critique posting should not go in any other area. Essentially I am saying: analyze how Typophile is used, and re-org it to make those pathways most intuitive, immediate, clear and distinguishable to everyone, not just lifer type nerds.\n\n\"Hottest\", \"Wettest\", \"Meanest\" \"Handpicked\" or whatever could be underneath those basic categories, since they represent digested versions of all the different areas. Right now, there's some opacity in those lists since the latest poster and time aren't shown, so I find them less crucial to show at the top.\n\nI wouldn't suggest this if I didn't think Typophile was worth the effort, and again, I think this kind of evolution is inescapable.\n\n\\*Notice my simpler, clearer laymens' terms. Though they aren't considered industry terms, they clarify distinctions that we've all noticed aren't intuitive to all users of Typophile. For additional clarity, the taglines under each section can be more informative, literal, specific:\n\nCRITIQUE  \nSubmit in-progress designs for feedback\n\nA chopping block might not mean the same thing in Romania, Greece, Venezuela and France. ;)\n\nThe one thing I would add In a prominent place: \"Type Selection Help\", which could be everything from our lists of condensed sans, Garamond versions, Book types, Superfamilies, or whatever comparison tools people need to help them select type. There is a steady stream of posts asking for type recommendations, and it deserves its own area, complete with some methods of showing or linking to samples.\n\n"
    },
    {
      "time": "",
      "content": "What if there were some sort of automated way to title posts? Perhaps it should be optional, but that could be a way to cut down on post-title-ambiguity.\n\nJust throwing the idea out there.\n\nDuncan\n\n"
    },
    {
      "time": "",
      "content": "My post above (9:29 am), also made suggestions like Carl's for reorganizing the menu list, with the same goal: reflect the actual use of typophile in the structure.\n\nIf others also like the idea of renovating the menu, and it is technically feasable and within the time Christian Robertson or whomever works on it is willing to put in, you could maybe solict brainstorming suggestions on the best items for the menu.\n\n"
    },
    {
      "time": "",
      "content": "Reflecting actual use is great.  \nPromoting certain uses might be even greater.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Like some others have mentioned, more links would be good. I would especially like some at the bottom of each page, as right now, to click \"Home,\" the forum that I'm in, or to check my account, I have to scroll all the way back to the top of the page. It actually wouldn't be bad if there were a few blocks of links at intervals right of the posts in a thread, so that the need to scroll to go somewhere else would be minimized. Hope I'm being more or less clear.\n\n"
    },
    {
      "time": "",
      "content": "Fix internal broken links in old threads (I'm asking too much, I know)\n\n"
    },
    {
      "time": "",
      "content": "Add a persistent menu for the forums on each page. Like this:\n\n ![](http://web.archive.org/web/20111225221138im_/http:/typophile.com/files/typophile_menu_5225.gif)\n\n(for those interested, I've written a [Greasemonkey](http://web.archive.org/web/20111225221138/http:/greasemonkey.mozdev.org/) for the Firefox browser that adds this menu. You can get it here: [typophile-menu.user.js](http://web.archive.org/web/20111225221138/http:/times-new-roman.com/dreamless/typophile-menu.user.js).)\n\n"
    },
    {
      "time": "",
      "content": "how about have a non-flash alternative to the frontpage for those who can't view flash. Like me on my 8525 phone trying to read posts :P\n\nOh and using a different method for flash to get rid of the click to activate.\n\nOh and changing the search filter for tracking my account so it doesn't take forever to come up with all of the results. Maybe it would only track like the latest 15 or something.\n\n\\*That's pretty sweet Brew. Too bad im on IE :S\n\n"
    },
    {
      "time": "",
      "content": "Agree with put navigation (for multiple pages) at the top. Furthermore, if you add a post to any page other than the first, it currently takes you back to the first page of the thread. I think you should be returned to where you left off.\n\nFor IM's - first of all there should be a way to reply to the IM without having to go to the bottom of the page. Second, they crop up 2, 3 or 4 times at the top of the page. Third, when you delete them it takes you to the Typophile homepage rather than the page you were on. Fourth, the space for typing is absurdly small.\n\nI also think the \"Logos/Corporate ID Design\" and \"Typography/Composition\" don't belong in Critique - at least not as it is currently described (typefaces on the chopping block). For years I thought that section was only for feedback on fonts. I had no idea until recently that there were designs up there as well. I think this needs to be at least clarified if not changed.\n\n"
    },
    {
      "time": "",
      "content": "Also: [http://typophile.com/node/20445](http://web.archive.org/web/20111225221138/http:/typophile.com/node/20445 \"http://typophile.com/node/20445\")\n\nI forgot about the italics one for instance.\n\n"
    },
    {
      "time": "",
      "content": "Make threads easy to print.\n\nLike a CSS spreadsheet just for paper. Remove the menubar/sponsor thing (or send it where it's not in the way)it's useless information. Also the text at print is **way** too small, and not wide enough. I know you'll say too wide hinders reading but it's not a book, and I don't wanna spend 10 pages where I could just use 5.\n\n"
    },
    {
      "time": "",
      "content": "I think that all that needed to be said has now been said by everyone above...I would just like to ask you people something that is kindof related to this perhaps..\n\nMy typophile widget shows errors most of the times when I want to check it....is that something with the code, or something with the link to the site?  \nCan I fix that myself somehow?\n\nJust curious, because I have a new iMac 20\" and was just wondering if it was a typophile error or my iMac not being able to properly handle the widget for some reason..\n\ndav.\n\n"
    },
    {
      "time": "",
      "content": "Dav.  \nThe Typophile widget keeps crashing or showing errors in my mac, too, so I suppose it's not a local problem with your iMac. My guess is, that the widget is somehow faulty, since it's the only one crashing.\n\n"
    },
    {
      "time": "",
      "content": "a couple suggestions/comments:  \nmaybe since navigation is an issue, the bar on the right can have a floating div so that it stays put even when the rest of the page is scrolled up or down.  \ni miss the old front page and how dynamic it was in terms of typography with the type gallery. I mean Mercury is REALLY nice, but i'd love to see something fresh each time i visit the home page. i also don't like that i can't right-click links on the front page so in my bookmarks i link right to the tracker page.  \nRe answers to Frequently Asked Questions: There is already a [FAQs](http://web.archive.org/web/20111225221138/http:/typophile.com/wiki/FAQs) section in the wiki, which i believe is a better place to house this type of information than a thread. There is no wiki page for [Typeface Pairings](http://web.archive.org/web/20111225221138/http:/typophile.com/wiki/Typeface%20Pairings) (yet), but I feel that the wiki format is best for massing this type of info in a concise manner instead of having to dig through multiple threads, or even one monster thread to find relavent info.\n\n"
    },
    {
      "time": "",
      "content": "It would be nice if the sub forum was visible on Recent Posts. Especially the id threads have strange subjects quite often. What if the left column read “Identification topic”, “Critique topic” or “General topic” instead of “Forum topic”?\n\nGenerally, navigating around Typophile takes too many clicks at the moment.\n\n"
    },
    {
      "time": "",
      "content": "Would it be possible to make the next forum topic option stay within the forum? Currently a topic that has been moved is still accessed by the next topic option so you jump to another forum, which can be interesting in a magical mystery tour kind of way but can be a little annoying.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Regarding the widget: I coded that myself, and I'm a designer, not a developer. If any savvy widget-mongers among us can isolate the bug and fix it, we'll happily post the new version for all to download. Thanks-\n\n"
    },
    {
      "time": "",
      "content": "About the widget, still. I haven't checked if the crashes occure only when Typophile is down. That could explane it, couldn't it?\n\n"
    }
  ]
}
