{
  "id": "29720",
  "title": "Metafont Editor (with Preview)",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi,  \nI'm looking for a (very) user-friendly Metafont editor for Windows. I know Miktex, WinEdit... but I'm wondering if there is something more 'immediate', with a more fast preview function, for example. Yes, I know I'm not very clear, but can you help me? Thanks a lot.  \nj\n\n",
  "author": "<a href=\"/web/20100427182448/http://typophile.com/user/11676\" title=\"View user profile.\">notjoe</a>",
  "time": "<br>",
  "uid": "11676",
  "comments": [
    {
      "time": "",
      "content": "notjoe — What are you precisely looking for? A code editor with syntax highlighting, a script to automate previews or a true WYSIWYG GUI? I'm afraid, syntax highlighting is the best you'll find.\n\nYou might want to contact the developers of [MetaType](http://web.archive.org/web/20100427182448/http:/en.wikipedia.org/wiki/METATYPE1).  \nAlso have a look at [this thread](http://web.archive.org/web/20100427182448/http:/typophile.com/node/29008).\n\n"
    },
    {
      "time": "",
      "content": "thanks for your reply.  \nI suppose I'm looking for a WYSIWYG GUI, but all the things you told me are really interesting. In particular, what do you mean for 'syntax highlighting'??  \nThanks again.  \nj\n\n"
    },
    {
      "time": "",
      "content": "\"syntax highlighting\" makes a text editor recognise the code of a particular programming language (i.c. METAFONT) while you're typing. This reduces the risk for typos and other mistakes that will have the interpreter misunderstand your program. Just look for a plug-in and add it to the editor of your choice: erroneous code will not be highlighted, whereas valid code will be hightlighted according to the syntax.\n\n"
    },
    {
      "time": "",
      "content": "Notjoe,\n\nare you really looking for an editor for Metafont, or for TeX in general? If you're looking for TeX, WinEdit is among the best you can get, but there is also LyX, which is more WYSIWYG but more limited functionality-wise.\n\nA.\n\n"
    }
  ]
}
