{
  "id": "2973",
  "title": "(x) Making Love in Public - Fairchild (Parade Script), Zephyr (Mistral) {gang}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I thought I was using generic MS True Type fonts that came with MS Window for this design done in early 2002. After my computer crashed, I find I don't have the fonts anymore, and I can't edit the graphic without having the fonts.   \n   \nI need the top font used for \"Making Love\" and the next font used for \"in Public, Engela, john, and john daniels, jr.\" (The other font \"hilarious romantic comedy\" luckily is Garamond, so I still have it.)   \n   \nI've have a font that looks somewhat similar to the \"in Public\" font. Mistral isn't it, but it is close enough that I could use it if I had to.   \n   \nDetective work:   \n   \nI haven't found anything even close to the \"Making Love\" font. This might be a clue, when I open the graphic a warning screen appears in Uleads PhotoImpact which says, \"Typeface Fairchild not found.\" But I can't find a font called Fairchild to find out if that could be it.   \n   \nOk, now I've now deleted everything from the graphic except \"in Public\" and when I open the file the warning screens says \"Typeface Zephyr not found.\"   \n   \nSo now I guess I don't really have a font identification problem, but I still have no clue where to obtain these fonts.   \n   \nAny help would be appreciated.   \n   \n ![2 fonts to ID](http://web.archive.org/web/20050516142558im_/http:/www.typophile.com/forums/messages/83/25514.gif)\n\n",
  "author": "easytheatre",
  "time": "Wed, 2004-02-04 01:08",
  "uid": "3006",
  "comments": [
    {
      "time": " Wed, 2004-02-04 07:58",
      "content": "Your font \"Zephyr\" is a badly drawn copy of [Mistral](http://web.archive.org/web/20050516142558/http:/www.myfonts.com/fonts/urw/mistral/d/testdrive.html?s=in%a0Public&p=48).\n\n"
    },
    {
      "time": " Wed, 2004-02-04 08:19",
      "content": "Indeed, Zephyr looks like Mistral's ugly sibling.   \n   \nThe \"Making Love\" font looks a lot like [Avon](http://web.archive.org/web/20050516142558/http:/www.myfonts.com/fonts/urw/avon/d-regular/testdrive.html?s=Making%2BLove&p=72), only thinner. I don't think there is a thinner cut of Avon though.. Another copy?\n\n"
    },
    {
      "time": " Wed, 2004-02-04 08:29",
      "content": "Making Love looks like Parade Script from Panache Typography (FontHaus) that has been stretched taller. This is one of a series of brush lettering scripts that were film type that were digitized. They have found their way into a variety of font packs of widely varying quality. Panache has some of the better digitizations of these, but you might have had a version in another package that was a renamed version of Parade that was taller (to make it look different). These things happen, especially when you buy bargain font packages.\n\n"
    },
    {
      "time": " Wed, 2004-02-04 09:10",
      "content": "Here are three simulations of 'Making Love'. The first is Parade Script from Panache (used to be available through Agfa when I got it).   \n   \nThe Second is 'Fairchild' from an Expresiv Fonts Brush Script Collection, which has at least half a dozen closely related styles that were digitizations of film types. In some cases the width/height/weight were varied and serifs were added or removed, round or straight, but with very similar letterforms underneath. (Page 92 in the Dover Solotype Catalog shows a flock of these phototypes, including 'Orlando', that I think resembles 'Fairchild'). The baselines also were shifted (called Bounce variations), and you can see some of that between Parade and Fairchild.   \n   \nThe third simulation is Parade Script with 'squooshing'. Using the special lenses with film type essentially gave many of the image manipulation capabilities we play with in our graphics programs, so you could have had any typeface squeezed or stretched to order.   \n   \nI know this diverts us from your question, but I thought the permutations of the lettering artists' work that will live on gives an interesting perspective to see this aspect of our digital 'culture'.   \n ![Making Love Font Simulations](http://web.archive.org/web/20050516142558im_/http:/www.typophile.com/forums/messages/83/25530.gif)\n\n"
    },
    {
      "time": " Wed, 2004-02-04 11:10",
      "content": "Mike, thank you.   \n   \nMike wrote: \"The Second is 'Fairchild' from an Expresiv Fonts Brush Script Collection, which has at least half a dozen closely related styles that were digitizations of film types.\"   \n   \nThe Fairchild I used was more condenced. But the example you showed with the drop down \"i\" in the baseline variation is right on.   \n   \nI don't remember ever having installed any font packages, so in the last few hours I've installed every graphic and word processing program I've ever used, thinking that the font came packaged with something I had installed at one point. This was to no avail.   \n   \nI've search the MS site to see if they ever distributed the font where I might have installed it with an update. Fairchild isn't mentioned.   \n   \nArmed with your info, I've done web searches on Expresiv Fonts. Nothing.   \n   \nDeadline looming...Any idea?\n\n"
    },
    {
      "time": " Wed, 2004-02-04 11:16",
      "content": "I see that Zephyr is Brendel Informatik's poorly disguised Mistral.   \nYou can pay them $19.95 USD at the [current front](http://web.archive.org/web/20050516142558/http:/www.qbf.de/english.htm) for Brendel (see   \nthe Serials Tyepcollection) or snag it [here](http://web.archive.org/web/20050516142558/http:/www.cyberman-online.de/fonts.htm) for the price that, IMO,   \n_ought_ to be paid.   \n   \nBetter yet, pay for a copy of Mistral and improve the look!\n\n"
    },
    {
      "time": " Wed, 2004-02-04 11:19",
      "content": "_The Fairchild I used was more condenced._   \n   \nThe type in your sample is not more condensed, it's just set tighter. Very tight, in fact.\n\n"
    },
    {
      "time": " Wed, 2004-02-04 11:27",
      "content": "Mike Feiman, thank you for the links! I own Mistral, and it would have been my backup choice if I coundn't find Zephyr. I want the open loop on the lower case \"j\" that Mistral doesn't have.   \n   \nThank again, Engela\n\n"
    },
    {
      "time": " Wed, 2004-02-04 12:01",
      "content": "Thank you, Mike Simonson. Sorry, I'm not as up on the terminology as I should be. Yes, it is very tight, (an aspect I want).   \n   \nI hate thinking that if I can even find Expresiv's Brush Script Fairchild, (which is the closest so far - ) that I will have to move each letter individual to approximate the letter spacing. I'm hoping whomever is selling the Fairchild font will also have a \"tighter\" version.   \n   \nSo tight, not condensed.   \n   \nHard lesson learned too late. Always save your fonts with the graphics that use them. Sigh.\n\n"
    },
    {
      "time": " Wed, 2004-02-04 12:30",
      "content": "Engela, you don't need a special version of a font to get tighter spacing. All graphics and layout programs allow you to change the spacing of any font using kerning. Check the manual for your program to find out how to do it. They also will allow you to shift characters up and down. Unless you are trying to do your graphics in a non-graphics program (Word, for instance) you should be able to get whatever effect you want.\n\n"
    },
    {
      "time": " Wed, 2004-02-04 13:14",
      "content": "Mark, thanks. Your right. Much better solution. Can you tell I've been working on this problem all night and, and I need sleep? I've upgraded my version of my graphics program. I hate learning new programs when I'm on a deadline, but now I can adjust kerning and baseline shift. Thanks.   \n   \nIf I can just find someone selling the 'Fairchild' font from the Expresiv Fonts Brush Script Collection, I'll be ready to go!   \n   \nThanks everyone.   \n   \nExpresiv doesn't exist anymore, does it?\n\n"
    },
    {
      "time": " Wed, 2004-02-04 14:21",
      "content": "As far as I know they don't. I got the collection from Tiger Direct about 1994. The point of my demonstration was that if you get 'Parade Script', which is still being sold by [FontHaus](http://web.archive.org/web/20050516142558/http:/www.fordesigners.com/), then you can 'fudge' it into almost identical form to \"Fairchild\", which I believe is a manipulated version of Parade Script anyway.\n\n"
    },
    {
      "time": " Wed, 2004-02-04 15:01",
      "content": "Mike, thanks for all the info! I'm going to do as you suggest.   \n   \nI was hoping this was one of the problems I could just throw money at, and it would go away; so I could get back to doing the things I enjoy. Ha.   \n   \nEngela   \nVolunteering: Doing for free what no one could pay you to do.\n\n"
    }
  ]
}
