{
  "id": "29754",
  "title": "Biz Card Review",
  "forum": "Design",
  "tags": [

  ],
  "content": " ![](files/Nov 27 biz_5330.jpg)\n\nHi my name is Glen and I’m looking for feedback on a Biz card I designed for my DJ biz…\n\nThanks for taking the time to review.  \nGlen\n\n| Attachment | Size |\n| --- | --- |\n| [Nov 27 biz.jpg](http://web.archive.org/web/20070402035932/http:/typophile.com/files/Nov%2027%20biz.jpg) | 178.82 KB |\n\n",
  "author": "<a href=\"user/15543\" title=\"View user profile.\">Gman22</a>",
  "time": "<br>",
  "uid": "15543",
  "comments": [
    {
      "time": " 27 November, 2006 - 9:04pm",
      "content": "Tried to take a look, but rec’d this instead: “The image “http://typophile.com/files/Nov%2027%20biz.jpg” cannot be displayed, because it contains errors.” Maybe someone else will have better luck.\n\n"
    },
    {
      "time": " 27 November, 2006 - 9:15pm",
      "content": "Sorry having trouble uploading my file…\n\n"
    },
    {
      "time": " 27 November, 2006 - 9:16pm",
      "content": "This isn’t meant to sound harsh, just honest:\n\nFirst, the logo is in need of something a little more elegant if you’re specializing in ‘upscale weddings.’ It’s trying a little too hard to be the superman S but is failing miserably, to put it kindly. I don’t think the mason typeface is what you want for the ‘productions’ part of this logo type. It doesn’t say ‘professional’. It’s context is more of the demonic use.\n\nYour tagline starts right under the ‘g’ and is just awkward looking underneath the logo.\n\nI would give more space between your phone number and your website. You might also want to differentiate the two with maybe having one as a sans font. I would also set your name in a sans typeface to make it stand out so people know who to talk to.\n\nAnd is it me or did you stretch yourself on the picture? It doesn’t look stretched by much, but just a little bit to throw it off. Maybe it’s just the size I’m viewing it at.\n\nHope this helps. Best luck with the redesign.\n\n"
    },
    {
      "time": " 27 November, 2006 - 9:53pm",
      "content": " ![](http://web.archive.org/files/Nov-27-biz_5544.jpg)\n\nHere it is…\n\nThanks  \nGlen\n\n"
    },
    {
      "time": " 28 November, 2006 - 2:51pm",
      "content": "Thanks for the feedback and I am working on the new design now…Style of fonts and such are all things I am learning about. I was not aware that the mason typeface font was used for more demonic purposes LOL…Thanks for pointing that out!\n\n"
    },
    {
      "time": " 28 November, 2006 - 3:20pm",
      "content": "Mate, you’d better get someone on your side who can design otherwise youll risk putting people off with a design like this!! Only dickheads put their pictures on business cards like real estate agents and cheap lawyers.\n\nMuzz\n\n"
    },
    {
      "time": " 28 November, 2006 - 3:27pm",
      "content": "Does anybody else feel like that, about putting your picture on your Biz card?\n\nThanks\n\n"
    },
    {
      "time": " 28 November, 2006 - 3:33pm",
      "content": "Totally… weird dude.\n\n"
    },
    {
      "time": " 28 November, 2006 - 3:35pm",
      "content": "Please excuse my ignorance, but what is a sans font?\n\n"
    },
    {
      "time": " 28 November, 2006 - 3:35pm",
      "content": "Sorry for the multy post, I’m having alot of trouble with the website, it’s uploading reaallllyyyy slow….and I accidently post multiple times…\n\n"
    },
    {
      "time": " 28 November, 2006 - 3:36pm",
      "content": "Please excuse my ignorance, but what is a sans font?\n\n"
    },
    {
      "time": " 28 November, 2006 - 4:35pm",
      "content": "New versions\n\n ![](files/Nov%2028A%20biz_4881.jpg)\n\n"
    },
    {
      "time": " 28 November, 2006 - 6:35pm",
      "content": "Check out this from the typowiki: [sans-serif](http://web.archive.org/web/20070402035932/http:/typophile.com/wiki/sans_serif) . Should be clear enough (although likely more than you want to know).\n\nBTW, I couldn’t figure out how to make the little “W” appear next to that hyperlink for the typopwiki. Could some sage person tell me how? Thanks.\n\n"
    },
    {
      "time": " 28 November, 2006 - 11:54pm",
      "content": "I agree about photos in business cards. The only people I’ve been forced to design a card with a photo for were estate agents. IMHO you should only put a photo in if your face is very important for the job, so I would understand a model having her/his photo in the card.\n\nIf you’re after upscale weddings, the card should look the part.\n\n"
    },
    {
      "time": " 29 November, 2006 - 8:05am",
      "content": "Yes, definitely lose the photo, it could be seen as arrogant, and it is robbing space from the relevant information.\n\nI’d bring the phone number in line with the job title and website (same type, size, style and right alignment), and lose the horizontal rule.\n\nThe logo could manage without the hyphen, and ‘Productions’ would look much more pleasant in letterspaced caps (or letterspaced small caps if they are available to you) in the same typeface as the other information.\n\nWith a bit of tweaking you could match the height of the ‘G’ to the rest of the logo and also make the horizontal rule line up perfectly with the serif of the ‘G’.\n\nOnce the picture was removed you would have the logo top left and details bottom right, with plenty of space (space implies quality), and nice tension across the card.\n\nAlso, could ‘Emcee’ be unfamiliar terminology to an upscale crowd? MC may be a safer choice.\n\nGood luck with everything\n\n"
    },
    {
      "time": " 29 November, 2006 - 11:35am",
      "content": "My advice: hire a real designer.\n\nYou would never hire a graphic designer to DJ a wedding, so why would you (a DJ) design a business card?\n\nIf you’re interested in learning more about design, take a look at the “Critique” forum and see what people say about others’ designs. Maybe even get some books on design or take a course at your local college. Right now, however, you clearly lack experience with this sort of thing (“what is a sans font”).\n\nSo, if you need this card right away, hire a pro designer. If it can wait, keep posting here for advice and suggestions. Good luck :)\n\n- Lex\n\n"
    },
    {
      "time": " 29 November, 2006 - 5:04pm",
      "content": "cut the photo. simply ask yourself: what does it add? will people be using it to identify you in a crowd? is it an id card? no to both - so why is it there?\n\ncut down to the minimum, then build up the necessary. you’ll be left with something visually interesting.\n\nthat, or hire a professional.\n\njlt\n\n—-\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20070402035932/http:/www.hewnandhammered.com/) : rnrmf!\n\n"
    },
    {
      "time": " 29 November, 2006 - 6:10pm",
      "content": "To Reed - to get the wiki link, you put double square brackets around the title of the wiki article - [[Sans\\_Serif] ] (without the spaces) gets you [Sans\\_Serif](http://web.archive.org/wiki/Sans_Serif).\n\n- Lex\n\nP.S. To the administrators - why doesn’t the \\<code\\> tag overrule the wiki brackets? I thought the whole point of code was that it stripped all formatting.\n\n"
    },
    {
      "time": " 30 November, 2006 - 12:38am",
      "content": "Lex, thanks a ton. That makes a lot of sense. If only that were in the formatting options link (unless I missed it)….\n\n"
    },
    {
      "time": " 30 November, 2006 - 6:56am",
      "content": "I agree about the use of photos. Unless you’re planning to run for senator or something and still I wouldn’t recommed it unless you’re Jude Law or Naomi Campbell (not saying you’re ugly) in which case it migh be a good thing for your business. Or not.  \nIn fact, photos in general on business cards are kind of weird, not only portraits.  \nAlso agree about hiring a pro. However, I guess it’s a cool thing you’re trying to figure out how things work sooooo: good luck.\n\n"
    }
  ]
}
