{
  "id": "2975",
  "title": "Typography dreams",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "ever have dreams about typography or type design?   \n   \ni had my first one last night; at least one i actually remembered.   \n   \nmost of my dreams are really short snippits, as was this one. i was looking through some book about typography, and came across an \"example\" paragraph set in clarendon. i remember having this discussion in my mind about how clarendon was some sort of breakthrough typeface of vast historical significance. then i woke up. pretty odd.   \n   \ni now have confirmation that i am a nerd.\n\n",
  "author": "tylerg",
  "time": "4 Feb 2004 — 6:02am",
  "uid": "1116",
  "comments": [
    {
      "time": "4 Feb 2004 — 6:38am",
      "content": "A friend once told me that he spent too many hours working in Quark one day. That night he had dreams he was trying to walk through his living room, but he had enabled the \"snap-to-guides\" function, so he kept slamming into furniture he wandered to close to.\n\n"
    },
    {
      "time": "4 Feb 2004 — 8:00am",
      "content": "One time I dreamt I had gone for a bike ride at the park, met my friend (also a designer) by the gates and asked her if she thought my serifs were too sharp.\n\n"
    },
    {
      "time": "4 Feb 2004 — 9:47am",
      "content": "Funny stuff.   \nWhen I was about 8 I used to have very frightening dreams about abstract shapes (actually , volumes) in conflict. More recently, I was at a bar and Licko committed suicide. I was sad.   \n   \nhhp\n\n"
    },
    {
      "time": "4 Feb 2004 — 9:53am",
      "content": "TrueType hinting produces strange dreams, but it also invades your waking hours. Laurence Penney described walking down the street after several days of hinting, and seeing a tree as a pixel pattern. Immediately his brain started working out the most efficient way to move one of the branches further away from another to improve the image.\n\n"
    },
    {
      "time": "4 Feb 2004 — 9:58am",
      "content": "Oh, and this A came to me in a dream:   \n ![...perchance to dream](http://web.archive.org/web/20131018053547im_/http:/www.typophile.com/forums/messages/30/25562.gif)   \nAfter a few months I gave up waiting for the B to appear, and designed the rest of the letters with my conscious mind.\n\n"
    },
    {
      "time": "4 Feb 2004 — 1:18pm",
      "content": "Kristin: Imagine how horrible that must be! oh my God...   \n   \nA few years ago I went to Blackpool with a couple of friends, we where tired from the trip and slightly drunk so we went to bed early, I woke up some time during the night, looked out the window of our B and B , saw Blackpool Tower with it's moving lights and concluded that someone had selected it. (In Photoshop.)\n\n"
    },
    {
      "time": "4 Feb 2004 — 3:38pm",
      "content": "During a six month long digitizing project, I began having regular dreams about tracing giant, ominously grey letterforms with B\n\n"
    },
    {
      "time": "4 Feb 2004 — 5:47pm",
      "content": "There is nothing worse than sitting in front of the computer all day, then going home at night and dreaming about sitting in front of the computer. I dreamt about pdf's and BBC's \"the office\" last night, it is so much worse than having nightmares!\n\n"
    },
    {
      "time": "4 Feb 2004 — 7:07pm",
      "content": "Yes, I'm also a type haunted... but a lot more of UNDO (CTRL+Z) thinking when I'm awake. And I love when I'm looking on an index of a book and mentaly press F3 or CTRL+F. Insane I tell you.\n\n"
    },
    {
      "time": "4 Feb 2004 — 7:35pm",
      "content": "I have incredibly vivid dreams and commonly remember the slightest of details, down to the size and specific color of objects in the distance.   \n   \nRecently, I have had many dreams about navigating through various applications, usually InDesign or Photoshop, consisting primarily of opening and closing windows or browsing seemingly infinite glyph windows (now, those I like).   \n   \nThe last one I had was trying to maneuver InDesign with only key strokes.\n\n"
    },
    {
      "time": "4 Feb 2004 — 7:36pm",
      "content": "wow - that wasn't supposed to happen!   \nI had a crash and it posted several times, SORRY!\n\n"
    },
    {
      "time": "4 Feb 2004 — 7:48pm",
      "content": "While working on the Bitstream BTN project over the course of 90 days of glyph drawing and font making, I went to bed at around 6:00am and awoke around 1:00pm from a frightening dream of a futuristic scorpion morphing in and out of one of two glyph shapes.   \n   \nFortunately I was lucid dreaming and awoke to recall the shapes exactly and penned them down. After some searching on the internet at symbols, the closest we could surmise was that the shapes are similar to the alchemy symbol for Mercury.   \n   \n ![Dream Shape](http://web.archive.org/web/20131018053547im_/http:/www.typophile.com/forums/messages/30/25594.gif)   \n   \nShould any symbol experts have a different take, I'd love to hear it. The dream is still without meaning to me.   \n   \nStuart :D\n\n"
    },
    {
      "time": "4 Feb 2004 — 9:21pm",
      "content": "stuart, i think you win my prize for most crazy/frightening dream. this stuff all makes me laugh out loud. keep it coming people.\n\n"
    },
    {
      "time": "5 Feb 2004 — 1:11am",
      "content": "\\>\\>When I was about 8 I used to have very frightening dreams about abstract shapes (actually , volumes) in conflict   \n   \nHave you read Flatland, by Edwin Abbot?   \nWritten, I think, around 1880, its about a 2D world populated by shapes, then a 3D volume appears from another dimension and shakes up the shapes' world.   \nIts heavy with Victorian social commentary. There's a strict hierarchy in Flatland (the more sides you have the higher up you are - but in a 2D world, the shapes can't see each other from above, so they have to judge the number of sides by finding a corner and checking the angles. Women are bottom of the pile, so they are, I think, just lines). I read it a very long time ago, for an undergrad essay I was writing, but I can't remember much of it (or even what f\\*cked up type of essay I was writing in which this wierd book could play a part).   \nIf you're interested, its around $2 at most online bookstores, or there's an online version here [http://www.alcyone.com/max/lit/flatland/](http://web.archive.org/web/20131018053547/http:/www.alcyone.com/max/lit/flatland/), or there's also a Project Gutenberg version available at their website.   \nI've only read the .txt version with ASCII illustrations, the originals are supposed to be very nice, but I never got round to searching them out. Maybe I'll do that now...\n\n"
    },
    {
      "time": "5 Feb 2004 — 7:53am",
      "content": "This is what happens when you read back issues of [Print](http://web.archive.org/web/20131018053547/http:/printmag.com/) before bedtime...   \n   \nLast night I dreamt that I was working in an office with [Peter Bilak](http://web.archive.org/web/20131018053547/http:/www.typotheque.com/). He kept sending me documents set in languages that required the text encoding to be changed every time I opened one of them. It was very frustrating because even after correcting the encoding, I couldn\n\n"
    },
    {
      "time": "5 Feb 2004 — 8:15am",
      "content": "Stuart, I checked Koch's \"Book of Signs\" but found nothing. Then I checked Liungman's comprehensive \"Dictionary of Symbols\" and saw that although your lefthand shape has parts of both Saturn and Antimony (a crucial component of metal type!), it's pretty much exactly the symbol (actually one of many) for Mercury (more the material than the planet). Your righthand shape didn't come up, but it looks a lot like a Courier rendition of the first... Were you working a lot on a sans/slab superfamily? :-)   \n   \nFlatland sounds very interesting - I'll check it out - thanks.   \n   \nGrant, funny!   \n   \nhhp\n\n"
    },
    {
      "time": "5 Feb 2004 — 10:39am",
      "content": "I had been working on three families the day before all of which were san-serif display families influenced by geometric forms and casual bouncing baselines.   \n   \nIn looking through the work from a few days before and the day of just to see where my mind was at, it did seem that I was going between sans text families, sans monospaced families, and a very playful serif version of the family I mentioned above.   \n   \nI'd be happy to do a screen grab of the previous days works to perhaps paint a visual timeline if anybody is interested . . .   \n   \nRegarding the Flatline story, I do recall a buddy mentioning that story to me in college as a quick anecdote and they way he described the ending really stuck with me although I hadn't read the story. I won't give it away but I should finally read it . . . Thanks for the reminder . . .   \n   \nStuart :D\n\n"
    },
    {
      "time": "5 Feb 2004 — 4:36pm",
      "content": "Flatland is a must-read, especially since it's such a thin book there's no excuse not to. Various modern authors have written sequels to it, with varying degrees of success. Sadly, typography is an unknown art to Flatlanders, whose written language is necessarily one-dimensional.\n\n"
    },
    {
      "time": "6 Feb 2004 — 11:51am",
      "content": "Lately I've been having dreams about type. I have a garamond typesetting assignment due next week and I was doing some visual research before bed last night. I remember dreaming of Rs and Qs with extremely long tails. something about ornaments and the various shapes of binoculor gs.\n\n"
    },
    {
      "time": "6 Feb 2004 — 12:55pm",
      "content": "Sounds like a typographic wet dream to me! ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "6 Feb 2004 — 2:22pm",
      "content": "The closest thing to a type/computer dream I've had was a nightmare. For what seemed like hours, I was trying to organize folders/files on my hard drive and could never get them organized. This was after a long day of moving icons and other files around on my HD. I had the same dream a couple of times, but haven't had anything like it recently.\n\n"
    },
    {
      "time": "7 Feb 2004 — 12:45am",
      "content": "Generally benevolence in not in my nature but this thread illustrates clearly the damage digital typography has done to your little souls. I have heard your screams for help.   \n   \nHere it is.   \n   \n [http://www.soulcenteredtherapy.com/textfiles/gestaltdreamwork.htm](http://web.archive.org/web/20131018053547/http:/www.soulcenteredtherapy.com/textfiles/gestaltdreamwork.htm)\n\n"
    },
    {
      "time": "7 Feb 2004 — 7:29pm",
      "content": "\\> Yes, I'm also a type haunted... but a lot more of UNDO (CTRL+Z) thinking when I'm awake. And I love when I'm looking on an index of a book and mentaly press F3 or CTRL+F. Insane I tell you.   \n   \nThat happens to me too! Both the Command Z and Command F! It's so wild.\n\n"
    },
    {
      "time": "8 Feb 2004 — 10:24am",
      "content": "I've done the Cmnd + Z thing while awake, but I don't think I've had a typography dream (yet).\n\n"
    },
    {
      "time": "9 Feb 2004 — 11:01am",
      "content": "Due to this thread I had a bona fide type dream last night:   \nI dreamt that I was going to a party and didn't have anything to wear until I looked in the closet that stored my fonts and went 'Oh, yeah, I'll wear this scripty outfit.' (In dreams I apparently store my fonts in closets, go ahead and analyze if you must, shouldn't be too hard.)\n\n"
    },
    {
      "time": "9 Feb 2004 — 11:06am",
      "content": "BTW, I just remembered that I've _been_ in somebody else's typo dream! Remember Armin's lavatorial adventures last year...   \n   \nhhp\n\n"
    },
    {
      "time": "9 Feb 2004 — 12:48pm",
      "content": "Thanks for the reimnder of Flantland. I recall my grandmother telling me about that book years ago.   \n   \nI had a design professor in College who told us he would have dreams about a particular version of Bodoni. I thought it was strange at the time, but I've since come to understand.   \n   \nHe also converted an alleyway into an office space for his studio and actually petitioned the city to let him have 666 as his address because he liked the graphic possibilities with three numbers being the same. He was wearing Mephistopheles brand shoes when he told us. Hmmm...\n\n"
    },
    {
      "time": "10 Feb 2004 — 8:57am",
      "content": "Since I've been designing on a computer every day for 14 years, my thinking has become irretrievably altered. Now my dreams \"scroll\" vertically, instead of moving left to right as I remember they used to do.   \n   \nLately, I was hand drawing a thumbnail on a piece of paper. Then off to the bottom left corner (as if it were the pasteboard), I drew a bit that I had every intention of moving over to the center. I actually stuck the pencil in the middle, held it down, and was momentarily surprised when my side scribble didn't click and drag.   \n   \nSimilarly, I've drawn thumbnails and gotten pissed that I couldn't \"send to the back.\"   \n   \nAs I age and move into perimenopause, there are ever increasing numbers of floating pallets to deal with. That's a deadly combo to my brain cells. I started noticing this 5 versions of Freehand ago. Now I'm convinced InDesign is going to land me in a nursing home.\n\n"
    },
    {
      "time": "10 Feb 2004 — 9:26am",
      "content": "Funny.   \n   \nIt's very interesting how particulars of software interfaces migrate to our physical interfaces - probably due to the amazing adaptability of the human brain.   \n   \n\\> was momentarily surprised when my side scribble didn't click and drag.   \n   \nOne time I was working on a scan of a photo laying to the left of the keyboard. I was trying to show a coworker some difference between the scan and the original - with the mouse I pointed to the area on the scan, then I proceeded to try to roll the pointer off the bottom-left of the screen to the physical photo on the table. I actually got angry for a second when it wasn't working.   \n   \nAnd it's not just software, but anything you spend a lot of time with. When I used to have a motorcycle, riding it more than I'd walk, I used to catch myself looking to my left (where the mirror would be) even when I was on foot, to see what's behind me.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Feb 2004 — 10:07am",
      "content": "i've had letter forms come to me in dreams or while i was praying.. first time this happened to me i was in prayer and a letter A came to me with the name \"Rivanna\" at the same time, i musta been spending too much time at Nick's fonts at that time.\n\n"
    },
    {
      "time": "10 Feb 2004 — 11:19am",
      "content": "Tyler Galloway, is that one and the same I won an ipod with at Cranbrook last summer?   \n   \ndhall\n\n"
    },
    {
      "time": "11 Feb 2004 — 11:02pm",
      "content": "why, yes deb, it is--your amazing water balloon throwing partner. awesome to hear from you. hope things are well for you...   \n   \nas a side note to hrant's and louann's mix-ups, donald norman refers to those mistakes as \"description errors\" in his book \"the design of everyday things\". he says it happens when \"the intended action has much in common with others that are possible...the more the wrong and right objects have in common, the more likely errors are to occur.\" his book has lots of interesting info like that.\n\n"
    },
    {
      "time": "4 Feb 2004 — 8:49am",
      "content": "A long time ago, I was editing (with the author's notes) a book in WordPerfect. It was a labor intensive project. I would go home at night, turn the tele on to unwind. I remember one night going home switching the tv on, laying down on the couch and relaxing my eyes. I opened them up only to see my monitor with thousands of edits that I missed. I kept reaching for the keyboard that would appear on my lap to correct these things, but the keyboard kept vanishing.\n\n"
    },
    {
      "time": "4 Feb 2004 — 1:44pm",
      "content": "\"Snap to Guides\" -- that wouln't be very much fun   \n   \n---   \n   \nIs it just me, or do the mountains (or any natural surroundings, clouds) sometimes look as if someone did too much \"unsharp masking\"?\n\n"
    }
  ]
}
