{
  "id": "29772",
  "title": "Berthold Akzidenz Grotesk \"2\"",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello,  \nI am a graphic design student, and I have a question for professionals in the field of typography. When, if ever, is it appropriate to change letterforms in an existing typeface? I love Berthold Akzidenz Grotesk, but the \"2\" drives me crazy. It just looks different than the rest of the face. I am attaching a picture of it (left) and my change to it (right). Please let me know if this is an acceptable practice whether in school, or in the professional world.\n\n-Thomas\n\n| Attachment | Size |\n| --- | --- |\n| [akzgrtk2.gif](http://web.archive.org/web/20120927043407/http:/typophile.com/files/akzgrtk2.gif) | 1.12 KB |\n\n",
  "author": "TGaskin",
  "time": "28 Nov 2006 — 10:55am",
  "uid": "7714",
  "comments": [
    {
      "time": "28 Nov 2006 — 11:57am",
      "content": "If you're having thoughts like this, it sounds like you're on  \nthe brink of a type design addiction - consider yourself warned! :-)\n\nIt's OK to modify a glyph whenever you think it's a good idea. Some people would say that you need to check the EULA (the licensing agreement) to make sure that's allowed, but in my book as long as the results don't leave your own hard drive you're always OK. Sometimes you're even OK if it leaves your drive, but then you really should check the EULA and probably contact the font house in question.\n\nSome others like to see fonts as works of art, and not open to tinkering. I think this attitude is very anti-design - but it does have proponents (like see some of the posts in the thread linked below).\n\nThe real problem is that it's quite hard to modify a good font and end up with something better. You need to be -almost- as good as the original designer. Almost, because everybody makes mistakes, and often it's easier for an outsider to see a problem and fix it (although the latter is qualitatively harder). In this case it seems like a very gentle change, and as a rule that's the most a novice can get away with.\n\nHere's an old thread that might be quite educational:  \n [http://typophile.com/node/14378](http://web.archive.org/web/20120927043407/http:/typophile.com/node/14378 \"http://typophile.com/node/14378\")\n\nhhp\n\n"
    },
    {
      "time": "28 Nov 2006 — 12:04pm",
      "content": "Mate, you just made it worse. But if you feel better then good on ya!\n\nMuzz\n\n"
    },
    {
      "time": "28 Nov 2006 — 2:37pm",
      "content": "Thank you Hrant for the helpful advice.\n\n"
    },
    {
      "time": "28 Nov 2006 — 2:38pm",
      "content": "muzzer, any constructive criticism? have you looked at the Berthold Akzidenz Grotesk \"3\" next to the \"2\"?\n\n"
    },
    {
      "time": "28 Nov 2006 — 2:57pm",
      "content": "Hrant, while your advice is sort of good, you really really really make me sad and want to scream. =(\n\nMaybe I'm becoming an extremist just like you after all. =D\n\nThomas, respect the EULA and you will never go wrong.\n\n"
    },
    {
      "time": "28 Nov 2006 — 4:07pm",
      "content": "What's extreme is expecting a human to abide 100% by something written not  \nfor his benefit. Only somebody with a slave mentality would behave like that.\n\nAny lucid person knows (which is not the same thing as admits)  \nthat a EULA is just another factor tugging at us - it is not Divine.\n\nhhp\n\n"
    },
    {
      "time": "28 Nov 2006 — 7:29pm",
      "content": "As Tiffany says, check the EULA to see whether it's OK.  \nThe EULA is a contract, and if you purchase the licence, you agree to the terms of the contract. if you don't like the licence, find one more to your liking -- there are plenty of foundries who allow mods to their fonts, such as mine; I don't know what the AG EULA stipulates.\n\nHowever, I think it's a shame to tinker with old faces. Drastic systematic fontwide action is cool, but you gotta figure that the original designer was totally in the zone, or else the typeface would be in the trash can of history by now, not a classic. So everything is in perfect balance, and if you move one jot or tittle, Jenga down.\n\n"
    },
    {
      "time": "28 Nov 2006 — 8:49pm",
      "content": "\\> if you don’t like the licence, find one more to your liking\n\nNah. If a font house has an unreasonable EULA, it will suffer the consequences of human behavior. If you don't like it, find a field unaffected by humans.\n\n\\> you gotta figure that the original designer was totally in the zone\n\nThere's really no reason to think that. Just look at Mrs Eaves: obviously flawed spacing, but a very very popular font. Perfect balance? No such thing, ever, especially not decades and certainly not centuries later. A font is not a painting inspired by the Muses; it's a worldly tool, with always room for improvement.\n\nhhp\n\n"
    },
    {
      "time": "29 Nov 2006 — 12:30am",
      "content": "_it’s a worldly tool_\n\nExactly. Any succesful type is successful in its world, tuned to the needs of that world. Its success proves its usability and its merit, but that does not make it faultless, as Henry Petroski argues in _The Evolution of Useful Things_. Failure is the mother of invention, he says, prompting inventors to try to better what they perceive as the defects of existing products, but, \"What constitutes failure and what improvement is not totally objective, for in the final analysis a considerable list of criteria, ranging from the functional to the aesthetic, from the economic to the moral, come into play.\"\n\nSo one might point to a type such as AG or Mrs Eaves and say, \"but look at its flaws\" -- but how can one be so sure that it is successful despite those features, rather than because of them? The only thing to do is to try and make a better tool, and see if it works. So enough already with the Eaves critique, let's see your Baskerville.\n\nI must admit, I've tinkered with faces, my own and others (where licencing permitted), producing custom versions for clients. But I would still argue that the originals of classic faces have acquired a state of grace through the passage of time, which puts a barrier between today's redesigner and the ability to perceive all the subtle interplay of design themes which created the balance of the face, enabling it to come into being and function smoothly within the ecology of its own time -- which is why I caution against tinkering with the old ones. (But a radical makeover is another matter.) At the very least, you can be sure that quite a few people have become accustomed to, and fond of what you may consider its annoying quirks, as Muzzer opines.\n\nSo I'm pretty much in agreement with the comments in your first post, Hrant.\n\nFrom my own experience, I think designers get in a zone when they're working. I've picked up a face I've put on hold for a while, and come across two files named A and B, and then I try and remember whether I was happy with the final round of changes I made or not. So I look at the fonts and I can't immediately see any difference, but obviously at the time I thought there was some very important fine tuning going on. Most disturbing of all was when I tried to do a condensed version of something I did 20 years earlier, and just couldn't get in the zone at all.\n\n"
    },
    {
      "time": "29 Nov 2006 — 1:47am",
      "content": "You said: muzzer, any constructive criticism? have you looked at the Berthold Akzidenz Grotesk “3” next to the “2”?\n\nCourse I have! Who hasnt?? Although I like it in metal better, the 2 doesn;t worry me at all. Think when it was designed mate, Nick is right when he says that the designer is in the zone. It was his choice to do it, and if you don't like it then don't use it. But just fiddling with a tiny little bit to fix everything is like airbrushing chicks to make the prettier. Or putting a spoiler on a holden to make it look cool like all those dickhead boyracers.\n\nHrant reckons there is always room for improvement. This is kinda true, but he also says there is no such thing as perfection so you'll end up going in ever diminishing circles.\n\nIf you want to 'fix it' then start from scratch and make your own typeface. I bet you'll learn heaps about the choices that were made!!\n\nGood on yer mate.\n\nMuzz.\n\n"
    },
    {
      "time": "29 Nov 2006 — 10:02am",
      "content": "\\> how can one be so sure that it is successful  \n\\> despite those features, rather than because of them?\n\nIt's never about being sure, but hopefully about thinking clearly. So for example claiming that Mrs Eaves's poor spacing makes it popular is much less likely than saying it's popular in spite of its poor spacing.\n\n\\> So enough already with the Eaves critique\n\nBTW, why do you only get riled about that when I say something?  \nOther people (like Carl) harp about it too but you don't seem to mind.\n\n\\> designers get in a zone when they’re working.\n\nI agree.  \nBut this does not entail any of that \"state of grace\" stuff,  \nand time can only defocus the original intent, not amplify it.\n\n\\> you’ll end up going in ever diminishing circles.\n\nOnly if you choose to.  \nThe other option is to accept the fact that perfection is a  \nsuccubus, and stay away from the mythical devious bitch.\n\nhhp\n\n"
    },
    {
      "time": "29 Nov 2006 — 10:56am",
      "content": "_Other people (like Carl) harp about it too but you don’t seem to mind._\n\nI haven't been keeping count, but I have the impression you've mentioned it a lot more than he has, and in a more combative tone. Also, I don't believe he's working on a Baskerville revival. While there's nothing wrong with making a good theoretical argument, at some point we'd like to see the rubber hit the road.\n\n_So for example claiming that Mrs Eaves’s poor spacing makes it popular is much less likely than saying it’s popular in spite of its poor spacing._\n\nI don't really mean that people like it just because of its spacing, but that the spacing contributes to its general effect, which is what's popular. So something which may be dysfunctional in one aspect of a type's functionality can be positive in some other respect. The principal is that the designer brings the work to a state of completion, a balanced wholeness. That's not to say that the work is perfect, merely that it's in a state of balance.\n\n"
    },
    {
      "time": "29 Nov 2006 — 11:19am",
      "content": "\\> you’ve mentioned it a lot more than he has\n\nYes, admitted. But I don't think quantity is your trigger.  \nYou just don't like me touching your -or your idol's- fonts.\n\nMy reason for focusing on Mrs Eaves is that it's such a landmark example of how popularity works: not based on qualities that the \"involved\" tend to worry about. Mrs Eaves has something important to teach, something still generally ignored, and something that Licko certainly did not intend.\n\n\\> at some point we’d like to see the rubber hit the road.\n\nWhere were you for Carl's 14 years? ;-)\n\n\\> the spacing contributes to its general effect, which is what’s popular.\n\nThis is in fact what I thought you were saying, and it's about as  \nludicrous as much of the stuff that comes out of the White House.\n\n\\> the designer brings the work to a state  \n\\> of completion, a balanced wholeness.\n\nMaybe if the designer is a sufi.  \nYou're making all this way to metaphysically convenient.\n\nhhp\n\n"
    },
    {
      "time": "29 Nov 2006 — 1:14pm",
      "content": "_You just don’t like me touching your -or your idol’s- fonts._\n\nI once responded to a somewhat banal interview question about who my favorite type designer was with the somewhat banal response that it was Zuzana Licko. Unfortunate, as you have now cast me as her perpetual worshipper. That interview was a long time ago and I am a fickle fan.  \nAnyway, it's not about her, it's about you.  \nYou're always banging away at another type designer's version of Baskerville, with your own in the works.  \nSo I say, put up or shut up.\n\n_Where were you for Carl’s 14 years? ;-)_\n\nI don't recall him perpetually dissing Optima.  \nSo can we expect HHP Baskerville in 2010? :-)\n\n_it’s about as ludicrous as much of the stuff that comes out of the White House._\n\nHe's your president, not mine.\n\n"
    },
    {
      "time": "30 Nov 2006 — 9:41am",
      "content": "(Sigh...) Hopeless case.\n\nhhp\n\n"
    },
    {
      "time": "30 Nov 2006 — 3:07pm",
      "content": "Thomas,\n\n[hey look, you're right there in SJ.]\n\nDepends what the mod is for: a custom logo or headline? If so, no worries. New version of font you can use at home without wincing? Fine, just don't share it. New version of typeface marketed as yours? Not cool. The licensing issues come up when you modify type and then go to sell or distribute it. If it's just an application of the type or a private use, it's generally ok. I'm sure the caveat here is \"Check your EULA for specific restrictions\" (in solemn bureaucrat voice.)\n\nIf you are in the market for something similar, you could look at the new Neuzeit Office from Linotype. Though, the '3' there might be a deal-killer. It's always somethin'!\n\n"
    },
    {
      "time": "30 Nov 2006 — 4:49pm",
      "content": "_Please let me know if this is an acceptable practice_\n\nApart from the EULA and other issues, just looking at your 2 makes me realize how good the original is. The problem with a 2 is always to get that middle curve to turn all the way back into the head, which points the other way. Your re-designed head is too short, lacks that sharp incision at the end and make the number lean to the right. Your design is timid, the original is daring.\n\nI redesigned only one AG number once, when i did the Old Style numbers for the Light weight, back in 1988 or so for Berthold’s stationery. That set of O/S figures was never supposed to be published, altough eventually it did. Having to fit those two curves into the small x-height was very difficult and made me appreciate the original even more. All the normal 2s are so safe and boring, with their reversed S-shape. That swan neck swoop is both daring and unique! I tried it with Meta, but i chickened out of it with Officina.\n\n"
    },
    {
      "time": "30 Nov 2006 — 8:31pm",
      "content": "Well TGaskin mate I think you have your constructive criticism right there with Erik's comment! He just said what I meant but said it a whole lot better. Im just not so good with writing these bloody words!! Good thing you're a student and you'll learn heaps from a top notch bloody designer like Erik so count yourself lucky!!\n\nMuzz\n\n"
    },
    {
      "time": "30 Nov 2006 — 9:45pm",
      "content": "The \"extra\" curve on 2 the harmonizes with the \"serif\" on the seven, and the foot serif on the 1.  \nThey would be termed \"folded\" curves, using Stanley Hess' terminology -- which he really conceived for \"unfolded\" curves, of which Futura has a few and Frutiger a lot.  \nSo if you are going to \"unfold\" the two a bit, perhaps you should also snip a bit off the 7's serif as well?\n\n"
    },
    {
      "time": "1 Dec 2006 — 8:28am",
      "content": "\\> if you are going to “unfold” the two a bit, perhaps  \n\\> you should also snip a bit off the 7’s serif as well?\n\nDude, what happened to Das Zöne?!\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2006 — 9:11am",
      "content": "Sorry, I forgot the irony mark.  \nTo continue the thought, at the risk of repeating myself: if you are going to tinker with the odd letter shape, and you look a bit harder, and gradually come to see the waves that little change will make throughout the face, it becomes a very tricky process to manage. Which is why I subscribe to theory that it's better to do a radical reworking or mash-up of an old face, rather than just \"fix\" a few characters you think the original designer got wrong.\n\n"
    },
    {
      "time": "1 Dec 2006 — 9:17am",
      "content": "Like I said.\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2006 — 12:51pm",
      "content": "I already acknowledged that:\n\n_So I’m pretty much in agreement with the comments in your first post, Hrant._\n\n"
    },
    {
      "time": "1 Dec 2006 — 1:44pm",
      "content": "Such a clever boy. The Queen would be proud.\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2006 — 2:04pm",
      "content": "Why do you feel it's necessary to engage in these childish insults?  \nMaybe I should get an avatar of a big macho guy like Muzzer - would that deter you?\n\n"
    },
    {
      "time": "1 Dec 2006 — 2:05pm",
      "content": "Yes, exactly.  \nI already acknowledged that.\n\nhhp\n\n"
    }
  ]
}
