{
  "id": "29777",
  "title": "Books on Magazine Design",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello everybody,\n\nwow, it has been a long time since my last post here.  \nI am back to you with quite an easy question for the ones, who do this. Just look over your shoulder: what books do you recommend for those, working on the concept, both visual and business, of a magazine?\n\nTo this moment I have purchased:  \n\"How Now to Start a Magazine\" by B.Ann Bell (already read)  \n\"Starting and Running a Successful Newsletter or Magazine\" by Cheryl Woodard (now reading)  \n\"Merz to Emigre and beyond\" by Steven Heller\n\nFrom me summer reading I will most probably re-read \"The Education of an Art Director\" by Steven Heller. \"Exercises in Style\" by Raymond Queneau will probably also be purchased on the nearest occasion.\n\nBut I guess, there are more, which are worth investing in. Or are there?\n\nThanks a lot!\n\nCheers,  \nAlexey\n\n",
  "author": "popovich",
  "time": "28 Nov 2006 — 1:10pm",
  "uid": "1788",
  "comments": [
    {
      "time": "28 Nov 2006 — 1:27pm",
      "content": "\"MagCulture: new magazine design\" by Jeremy Leslie is cool.\n\nhhp\n\n"
    },
    {
      "time": "28 Nov 2006 — 1:35pm",
      "content": "For some creative inspiration, check out \"Magazine Design That Works\" and \"Publication Design Workbook,\" both published by Rockport. Timothy Samara wrote \"Publication Desing Workbook\" and you seem to be a fan of his work (\"Making and Breaking the Grid\" was by him), so maybe that's a good fit.\n\nYes, I browsed your Web site. Very nice. I hope to look around more thoroughly when I'm not at work...\n\n"
    },
    {
      "time": "28 Nov 2006 — 1:53pm",
      "content": "thanks, hrant. already looking at it.\n\nsevety7, thanks for the warm words. :)  \nhowever, timothy samara is not my favourite author. that book on grids hasn't featured the best layout - my eyes get moist when I try to read that light gray text on glossy stock. But I'll still take a look at that book you've mentioned; hopefully his style got easier on reader. Thanks!\n\n"
    },
    {
      "time": "28 Nov 2006 — 1:56pm",
      "content": "No, it didn't.\n\nFrom a review @ amazon for \"PDW\":  \n\"My only gripe would be that... the type used for the main text is too light and hard to read! - which kind of contradicts the subject?\"\n\n:(\n\n"
    },
    {
      "time": "28 Nov 2006 — 3:30pm",
      "content": "Yes, the text is definitely a strain on the eyes.\n\nThe case studies and content make it worth the purchase IMHO.\n\n"
    },
    {
      "time": "28 Nov 2006 — 5:03pm",
      "content": "For a purely visual review of good magazine design, pick up a copy of the the Society of Publication Designers' annual.\n\n[http://www.amazon.com/Publication-Design-Annual-Society-Designers/dp/159...](http://web.archive.org/web/20131013200256/http:/www.amazon.com/Publication-Design-Annual-Society-Designers/dp/1592532659 \"http://www.amazon.com/Publication-Design-Annual-Society-Designers/dp/1592532659\")\n\n"
    }
  ]
}
