{
  "id": "29782",
  "title": "Not Ligatures : Digraphs - Lets talk about 'em.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I was going over a PDF of Fedra Mono to learn things for [my Mono project](http://web.archive.org/web/20131020171451/http:/typophile.com/node/29761)... When I noticed the [Digraphs](http://web.archive.org/web/20131020171451/http:/typophile.com/wiki/digraph). This was fascinating because it related so well & was yet different than the earlier Ligature thread. The digraph we all probably know best is 'IJ' used in Dutch. Whenever I have seen it it just looked 'right'. But apparently there is also 'ch' 'll' and 'rr' in Spanish, 'ch' in Czech, 'dz', 'ch', 'lj', and 'nj' in Croat, and many more. I will provide a full list later perhaps. Some of these seem like they would set less well in the same space. In a monospace they nearly all stick out like a sore thumb despite the consumate expertise of Peter Biľak. In a less constrained design they might be really lovely. But maybe not. Maybe their compression is part of their identity. My question is, how seriously does anybody take these anymore & why? Please enlighten me.\n\nBTW, this is what [Peter says](http://web.archive.org/web/20131020171451/http:/www.typotheque.com/site/font_features.php?family_id=5&id=58):\n\n<cite><strong>Digraphs</strong><br>\nSome languages (e.g. Czech, Croat, Dutch, Hungarian, Latvian, Lithuanian, Maltese, Slovak, or Spanish) use two characters to represent a single phoneme; those double characters (dz, ij, ch) are called digraphs.</cite>\n\n<cite>Digraphs are treated as single ‘letters’ on their own right. They influence hyphenation, abbreviation, and alphabetic order. Digraphs function as letters for the purposes of sorting e.g. in Czech, Slovak, Spanish and Welsh ‘ch’ serves as a single unit and words beginning with ‘ch’ have their own section in a dictionary.</cite>\n\n<cite>Digraphs should not be confused with ligatures which are graphically stylized combinations of two or more letters. Whilst some ligatures indicate that successive sounds are to be pronounced as one (æ,œ) most of them are just typographical letter-combination, trying to improve a appearance of the words and eliminate possibly conflicting characters pairs (ff, fi, fl, ffi, fl). Those ligatures have a practical significance only for typesetting, and do not represents a semantic difference.</cite>\n\n",
  "author": "ebensorkin",
  "time": "28 Nov 2006 — 3:57pm",
  "uid": "2942",
  "comments": [
    {
      "time": "28 Nov 2006 — 4:54pm",
      "content": "One thing you might look at is the rising prevalence  \nof the \"ch\" glyph in South American type design.\n\nhhp\n\n"
    },
    {
      "time": "28 Nov 2006 — 5:38pm",
      "content": "Just now I edited the initail post for clarity. Thanks Carl!\n\nHere is a sample too:\n\n ![](http://web.archive.org/web/20131020171451im_/http:/typophile.com/files/digraphs_4941.gif)\n\n"
    },
    {
      "time": "28 Nov 2006 — 7:12pm",
      "content": "_how seriously does anybody take these anymore & why?_\n\nIt's necessary to modify the standard \"ae\" and \"oe\" digraphs, to make them slightly narrower than just merging their components. And it's especially important to make a distinction between these characters in italic. Why? -- because that's the way the old guys did it, and because it's smart alec stuff. And of course, it improves readability by disambiguation and more harmonious proportions.\n\n ![](http://web.archive.org/web/20131020171451im_/http:/typophile.com/files/Caesar_4908.png)\n  \nBut monospaced -- think of it as lovable black sheep rather than sore thumb. \n"
    },
    {
      "time": "28 Nov 2006 — 8:00pm",
      "content": "<cite> black sheep <cite> </cite></cite>\n\nNicely put! And my apologies to Peter if that sounded harsh or something. The truth is I have a ton of respect for your work!\n\n"
    },
    {
      "time": "29 Nov 2006 — 2:19pm",
      "content": "\"æ\" is used as an ordinary letter in Danish, Faroese, Icelandic, Norwegian, among others and is a part of the alphabet. Therefore, it's a digraph, not a ligature (although it originates from a ligature, and still has a status of a ligature in Latin, English and French).\n\nA.\n\n"
    },
    {
      "time": "29 Nov 2006 — 4:50pm",
      "content": "These are interesting points.\n\nAllow me to sum up my understanding so far: speaking from the point of view of a text face or even directional signage point of view we have:\n\n- Digraphs which (maybe) should look obtrusively compressed like 'rr' 'ch' & 'dz' so that their status as a digraph is reinforced\n\n- Digraphs which (maybe) should not be obtrusively compressed like 'ij' and which a layperson would ideally not notice.\n\n- Ligature/Digraphs which inevitably seem to be compressed like 'ae' but which (maybe) aught to look as natural as possible despite certain inherent difficulties in acheiving this.\n\n- Ligatures which probably aught too look as 'natural' or unobstrusive as possible like 'ff' 'fi' 'fl' 'ct' & 'ffi' etc and which a layperson would ideally not notice.\n\nIs a structure like this accurate? If so, which digraphs fall into which camps?\n\nAdam, given what you said about the 'ae' and your notes about the polish vs. french 'acute' it strikes me that there might be cultural preference for the design of digraphs too. What do you think?\n\n"
    },
    {
      "time": "14 Jul 2011 — 1:38pm",
      "content": "bumping this thread to see if I can excavate more answers...\n\nFirst off, seems like by definition a glyph like \"æ\" can be defined as both a digraph AND a ligature.  \nBut for most digraphs: ij, ch, ß, its a matter of phonetics. An \"fl\" ligature is still two sounds in one breath while \"ij\" is simply \"ī\" (as far as one syllable). Sure \"fl\" is one syllable as well but it seems like its more a matter of aesthetic congestion of ascenders that the two letters compromise into one.  \n...I'm really just thinking this through rather than proving anything at all.\n\nSo then would diacritical glyphs be labeled as digraphs? Seems like most of them derived from two characters mashed into one and then simplified to a small mark above (or below) the original character. (see: aͤ)\n\nIs any of what I'm thinking wrong at all? Seems in line with whats already been said... just in other words.\n\n"
    },
    {
      "time": "14 Jul 2011 — 5:07pm",
      "content": "English uses \"th\", \"ch\", and \"ng\" to represent single phonemes, but they're not treated as digraphs, or indeed as anything special, in the sense outlined.\n\n"
    },
    {
      "time": "14 Jul 2011 — 5:23pm",
      "content": "Matt: _But for most digraphs ... its a matter of phonetics._\n\nYes, this is key to understanding the role of digraphs in orthography. Some languages treat some digraphs as distinct letters for sorting purposes, but that shouldn't be taken as a defining aspect of digraphs. English has many digraphs, but does not treat any of them as distinct letters (nor does it pronounce them consistenty).\n\nDon't forget trigraphs and tetragraphs, which are relatively common in some orthographies. Some Irish dialects pronounce up to six letters as a single phoneme.\n\nOther than those digraphs that have morphed into ligated forms, e.g. æ or fraktur ck, or that have a history of either ligation or other stylised treatment in display letters, e.g. Dutch ij, I don't think it is either possible or desirable to given special typographic treatment to digraphs, trigraphs, etc. There are simply too many variables of use in actual languages, such that the same combination of letters may constitute a digraph in some words but not in others.\n\n"
    },
    {
      "time": "28 Jul 2011 — 7:46am",
      "content": "Polish digraphs by Garamond:\n\n ![](http://web.archive.org/web/20131020171451im_/http:/typophile.com/files/40_4879.png)\n  \n(not present here: ch, and disputed: ni, ci, si, zi, dzi) Not in use since long. \n"
    },
    {
      "time": "28 Jul 2011 — 8:52am",
      "content": "John: _\"There are simply too many variables of use in actual languages...\"_\n\nI think that sums it up nicely. One standard is not universal.\n\n"
    }
  ]
}
