{
  "id": "29794",
  "title": "Cheaper Bookman Italic Swash",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "For my school's centennial, we're recreating the school newspaper's past nameplates, one in each new issue. The one we're up to (originally from around 1990, but I don't think we were digital at that point) uses [Bookman](http://web.archive.org/web/20130804043319/http:/typophile.com/wiki/Bookman) Italic (_not_ ITC Bookman) with some swash characters. In looking for a font online to approximate it, I've only been able to find Jukebox Type's [Bookman JF](http://web.archive.org/web/20130804043319/http:/www.veer.com/products/typedetail.aspx?image=JBT0000087), which does match it almost exactly. The problem is that the font family costs $119, which is out of my publication's price range (especially after buying Farnham and Mercury for our redesign). I was wondering if anyone knows of another digitization of Bookman that preserves the Th swash ligature and the R swashes present in the nameplate attached below. I haven't been able to find one after much searching, but maybe someone around here could help me out. Thanks very much in advance.\n\n| Attachment | Size |\n| --- | --- |\n| [RR Bookman Nameplate.jpg](http://web.archive.org/web/20130804043319/http:/typophile.com/files/RR%20Bookman%20Nameplate.jpg) | 71.39 KB |\n\n",
  "author": "Reed Reibstein",
  "time": "28 Nov 2006 — 7:24pm",
  "uid": "11702",
  "comments": [
    {
      "time": "28 Nov 2006 — 7:31pm",
      "content": "my suggestion is to roll up your sleaves and draw it yourself in illustrator.\n\n"
    },
    {
      "time": "28 Nov 2006 — 7:39pm",
      "content": "I was thinking about that (although I'm more likely to get a better photo and clean up an autotrace of it), but I'm concerned that the swashes won't match the weight of the letters of the ITC Bookmans out there. Ultimately, I bet that it would be okay, but I figured that maybe there is someone out there who knows something I don't about the many versions of Bookman.\n\n"
    },
    {
      "time": "28 Nov 2006 — 11:27pm",
      "content": "I believe you can find these in the OpenType version of [ITC Bookman Italic](http://web.archive.org/web/20130804043319/http:/www.fontshop.com/showfont.cfm?fid=M.125834.0.2) ($29). Contact FontShop for a sample.\n\n"
    },
    {
      "time": "29 Nov 2006 — 2:13am",
      "content": "Thanks for the tip, Stephen. I can't find any PDFs or samples online that show swashes in the ITC Bookman OT fonts, so I'll try to e-mail FontShop. Crossing my fingers.\n\n"
    },
    {
      "time": "29 Nov 2006 — 8:21am",
      "content": "You can find the Bookman Swash family here.  \n [http://www.fonts.com/findfonts/detail.htm?pid=415677](http://web.archive.org/web/20130804043319/http:/www.fonts.com/findfonts/detail.htm?pid=415677 \"http://www.fonts.com/findfonts/detail.htm?pid=415677\")\n\nI set it in ITC Bookman Light and it is very close with some tweaking. Unfortunately I do not have the swash version of ITC Bookman light\n\ngln\n\n"
    },
    {
      "time": "29 Nov 2006 — 1:30pm",
      "content": "You know, you're right. I think I will just get one of the ITC Bookman Swashes; I just frankly don't have the time or desire to invest this much time in making the nameplate as exact as possible. What I'll do is customize the swash R's by removing the lefthand swash, but I think I'll substitute ITC Bookman's Th lig for Bookman JF's lig (although I do prefer Bookman JF's). Thanks for all your suggestions.\n\n"
    }
  ]
}
