{
  "id": "298",
  "title": "Press Release: Speakers Announced For TypeCon2002 4/12/02",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": "FOR IMMEDIATE RELEASE   \n------------------   \nSOTA Names Speakers for TypeCon2002: The Medium and the Message.   \n   \nBUFFALO, NY, APRIL 12, 2002 - The Society of Typographic Aficionados (SOTA) has announced more than 20 speakers scheduled to present at TypeCon2002. To be held in Toronto, Ontario, Canada, July 12-14, the fourth annual event is presented by SOTA and The Type Club of Toronto.   \n   \nTypeCon2002 features presentations and panel discussions by some of the most respected and innovative names in the type, graphic design and new media fields. Traditional lettering techniques and history will be featured alongside explorations of the latest in digital interactive media.   \n   \nScheduled presenters and panelists include 2Rebels, The Chank Company, Michael Clark, Ray Cruz, Joshua Darden, John Downer, Dave Farey, Allan Haley, Ted Harrison, Patricia Lillie, Margery McAlpine, Rod McDonald, Boris Mahovac, Jan Middendorp, Gillian Mothersill, Joachim Müller-Lancé, Will Novosedlik, P22 Type Foundry, Thomas Phinney, Davin Risk, Nick Shinn, Brian Sooy and Laura Wills.   \n   \nProgramming also includes workshops given by Clark (Calligraphy) and Downer (Sign Painting). Seating for these workshops is limited. Conference attendees planning to attend either workshop should register as soon as possible to reserve a space.   \n   \nOther activities at TypeCon2002 include Friday's welcome address and gala opening night party; a type quiz featuring fabulous prizes for winning contestants; a new type and design gallery; vendor area featuring conference-only specials; and an auction of typographic treasures, software, rare books, posters and other sought-after items. Further information on programming, additional participants and social events will be announced before the conference.   \n   \nTypeCon2002 will take place at the Courtyard by Marriott in downtown Toronto. An early-bird discount on conference fees is available until May 1, 2002. Discounted hotel room rates are available to conference attendees. Please visit the TypeCon2002 website for details.   \n   \nTypeCon2002 is the annual event of the not-for-profit Society of Typographic Aficionados, an international organization dedicated to the promotion, study, and support of typography and related arts. Secure conference registration and further information is available at [http://www.typecon2002.com](http://web.archive.org/web/20131020040314/http:/www.typecon2002.com/), or by email at mailto: [info@typecon2002.com](mailto:info@typecon2002.com). For more information about SOTA, please visit the website at [http://www.typesociety.org](http://web.archive.org/web/20131020040314/http:/www.typesociety.org/), or email mailto: [info@typesociety.org](mailto:info@typesociety.org).\n\n",
  "author": "Jared Benson",
  "time": "12 Apr 2002 — 1:36pm",
  "uid": "3",
  "comments": [

  ]
}
