{
  "id": "29801",
  "title": "Examples of certain fonts in use",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello everybody\n\nI'm working on an illustrated reference resource drawn from the [TDC list of '100 Top Types of all Time?'](http://web.archive.org/web/20101114204833/http:/www.tdc.org/reviews/typelist.html) I am looking for foundry specimen sheets and covers, promotional material, scans, .jpeg files of examples in use of the following sixteen (in no particular order); these are the ones that have fallen through the cracks in my research to date...\n\nUnger Fraktur, Lucida, Bauer Bodoni, Fette Fraktur, ITC Garamond, OCR-A, Peter Jessenschrift, Bitstream Charter, Adobe Poetica, ITC Marconi, FF Thesis, Apollo, ITC Flora, Digi-Grotesk S, Compacta.\n\nAccompanying information about image provenances and copyright permissions, as applicable, would be most welcome. Thanks in advance.\n\n",
  "author": "<a href=\"/web/20101114204833/http://typophile.com/user/1337\" title=\"View user profile.\">ben_archer</a>",
  "time": "<br>",
  "uid": "1337",
  "comments": [
    {
      "time": "",
      "content": "Thesis is no longer a part of the FF library. You can find info at [LucasFonts](http://web.archive.org/web/20101114204833/http:/typophile.com/wiki/LucasFonts).\n\n"
    },
    {
      "time": "",
      "content": "Thanks Stephen. I got confused with the foundry appellation/abbreviation. 'Font Fabriek' is what I meant. Sorry.\n\n"
    },
    {
      "time": "",
      "content": "I'm pretty sure there's an Unger Fraktur sample in Peter Bain's \"Blackletter: Type and National Identity\". I could scan it for you, but Peter (who is even a TDC member I think) should be able to give you something better.\n\n\\> Bauer Bodoni\n\nYou mean the metal one?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Thanks Hrant. I know (and can access) the book you mention; you're right of course, there is an Unger Fraktur sample in it. And Peter Bain has kindly supplied some material for another face in the list, but I didn't think to ask him twice.\n\nMetal reference for Bauer Bodoni would be fantabulous!\n\nIf you have it...\n\nIn fact, the more I get into this, the more metal type ( and the specimens thereof) become paramount as the authoritative reference.\n\n"
    },
    {
      "time": "",
      "content": "A 150dpi version of the opening page from the supremely  \ntasteful recent Bauer specimen book produced by Neufville:\n\n ![](http://web.archive.org/web/20101114204833im_/http:/typophile.com/files/BauerBodoni_s_3643.gif)\n\n(Note: the point size numbers on the left are printed in red.)\n\nI will send you the 600dpi version if you give me your email.\n\nAnd yes, very often (but not always) it's the metal one you want (especially in the context of that TDC list). Like for Palatino, it's a must (although I do admire the new digital cut).\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Cheers Hrant. Most kind. I seem to recall you saying something about going to Neufville in person, so I assume this sample is not via a mailing list.\n\n"
    },
    {
      "time": "",
      "content": "Hey, you're paying attention! Yes, I was last in Barcelona in May of 2004, and visited Neufville to discuss Pascal. I was kindly given a tour of the foundry (and I do mean foundry - among other things I saw a casting machine spitting out sorts), was given a copy of that Bauer catalog, and even got to enjoy some seaside paella with Wolfgang Hartmann - a continental gentleman if there ever was one.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "OK it gets better. Thanks for the assistance so far. Now I'm only looking for examples of\n\nUnger Fraktur, Lucida, Fette Fraktur, OCR-A, Peter Jessenschrift, ITC Marconi, Apollo, ITC Flora, Digi-Grotesk S.\n\nC'mon guys and gals! Surely you have some (fabulously yellowed) reference for some of these? Or tell me where to look?\n\n"
    },
    {
      "time": "",
      "content": "Ben, it turns out that the glorious 1908 Enschede specimen book shows a large complement of fraktur fonts cut by Unger (I'm guessing all of them). I don't know which one the TDC list is about, but I've taken a macro photo of the second-largest size for you. Below is a 25% version - and I'll email you the full one in a minute. BTW, \"gros parangon\" is about 22pt.\n\n ![](http://web.archive.org/web/20101114204833im_/http:/typophile.com/files/UngerFraktur-s_4249.jpg)\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "BTW, aren't those superscript \"e\"s just da bomb?  \nIt's a damn shame Simplification got rid of them.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Thanks again Hrant. You really **have** saved me a lot of time rummaging through the library there.\n\nSuperscript characters that small and close would be for people who... er, pay attention.\n\nIn that the TDC list is talking about the typefaces that represent salient technical or artistic development, I think the Unger Fraktur referred to is the 1793 design that attempted to match fraktur for Didot's 'antiqua' proportions.\n\nSo the list of examples-to-be-sourced is now looking like\n\nLucida, Fette Fraktur, Peter Jessenschrift, ITC Marconi, Apollo, ITC Flora, Digi-Grotesk S.\n\nTIA for any contributions!\n\n"
    },
    {
      "time": "",
      "content": "The Enschede book indicates a date of 1795  \nfor the cutting of all the Unger frakturs.\n\nhhp\n\n"
    }
  ]
}
