{
  "id": "29814",
  "title": "Sem Hartz and the Making of Linotype Juliana: Now Available",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Inferno Press is please to announce -- after two years' work -- the publication of **Sem Hartz and the Making of Linotype Juliana**. This is the first book dealing exclusively with the design and development of one of the most elegant -- and overlooked -- typefaces of the twentieth century.\n\nFrustrated by the dearth of information about Hartz in English, Inferno Press commissioned Mathieu Lommen, a curator at the Special Collections Department at the Amsterdam University Library and friend of Hartz, to write the story of the design of Linotype Juliana. Lommen's text has been laser-printed on archival paper using a newly digitized version of Juliana. In fact, **this will be the inaugural appearance of this font**. Photographic reproductions of Hartz's early drawings for Juliana are tipped in, and the cover is letterpress-printed on a Nepalese Lotka paper (various colours). 8 1/4 by 5 inches. 15 pages. 100 copies. Stitched into soft covers. Price C$40. North American orders add C$5/copy. Elsewhere add $7/copy. Dealer discounts available. For more information, and an image of the cover, please visit Inferno Press's website at [http://infernopress.blogspot.com](http://web.archive.org/web/20150123105608/http:/infernopress.blogspot.com/ \"http://infernopress.blogspot.com\").\n\nBooks may be ordered directly from the Press by email or by calling 604 731 6365. We accept payment from PayPal accounts, international money orders or (in Canada) personal cheques. Cheques must be made out to Paul Razzell.\n\nOur address is\n\nINFERNO PRESS  \n1857 West 4th Avenue, No. 227  \nVancouver, B.C., V6J 1M4  \nCanada\n\n| Attachment | Size |\n| --- | --- |\n| [Hartz cover.jpg](http://web.archive.org/web/20150123105608/http:/typophile.com/files/Hartz%20cover.jpg) | 10.62 KB |\n\n",
  "author": "inferno",
  "time": "29 Nov 2006 — 10:20am",
  "uid": "12838",
  "comments": [
    {
      "time": "29 Nov 2006 — 10:57am",
      "content": "Interesting!  \nIs Linotype responsible for this version of Juliana?\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*  \nnew release at [www.ourtype.com](http://web.archive.org/web/20150123105608/http:/www.ourtype.com/ \"www.ourtype.com\") : Parry and Parry Grotesque\n\n"
    },
    {
      "time": "29 Nov 2006 — 3:43pm",
      "content": "The Juliana used in the book was digitized by David Berlow of the Font Bureau. Please contact the Font Bureau directly concerning their plans to release the font. I can tell you they have done a fine job, and I look forward to seeing it used by discriminating designers. In the meantime, you can see the font at work in the book: copies are still available.\n\nBest,\n\nPaul\n\n"
    },
    {
      "time": "29 Nov 2006 — 4:38pm",
      "content": "Paul,\n\nAny chance you could show more of the inside of the book? If we saw some photos of the new digital version used in text, and some peeks at the original drawings, it might be more enticing.\n\n"
    },
    {
      "time": "29 Nov 2006 — 8:15pm",
      "content": "I'm glad to see this come out. I have a copy of the tasteful small book in Dutch about Hartz, as well as a copy of Hartz's obituary in Quaerendo (IIRC), and waiting for more has been a tantalizing!\n\nI'm curious about Berlow/FB doing it, in terms of the rights acquisition, something usually tricky when the Dutch are involved! :-) Is there anything you -or possibly David- can share about the \"mechanics\" of what took place in that respect?\n\nhhp\n\n"
    },
    {
      "time": "30 Nov 2006 — 1:57pm",
      "content": "Dear Hrant and co.,\n\nI don't know anything about the permissions or rights arrangements; you will have to speak with David Berlow about that.\n\nAs for a peek inside, here is a low-rez jpg of the title page and Hartz's first drawing.\n\n ![](http://web.archive.org/web/20150123105608im_/http:/typophile.com/files/titlepage_3495.jpg)\n\n"
    }
  ]
}
