{
  "id": "29828",
  "title": "Typography School",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello all,\n\nForgive me if you’ve seen this already. Via Newstoday:\n\n[Typography School](http://web.archive.org/web/20080905101210/http:/www.youtube.com/watch?v=1Xg5O0l7ybY)\n\n [‹ Names for Fonts?](http://web.archive.org/web/20080905101210/http:/www.typophile.com/node/29883 \"Go to previous forum topic\") [Lost in translation? ›](http://web.archive.org/web/20080905101210/http:/www.typophile.com/node/29871 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905101210/http://www.typophile.com/user/10538\" title=\"View user profile.\">Hamilton</a>",
  "time": "<br>",
  "uid": "10538",
  "comments": [
    {
      "time": " 30.Nov.2006 5.21am",
      "content": "Thanks Steve!\n\nChrisL\n\n"
    },
    {
      "time": " 30.Nov.2006 5.51am",
      "content": "cool now I’d like to see a photography school one from maybe Parson’s since they had the best darkrooms in NYC in the 80’s. But I’m sure it would come out a lot different since Pro Digital cameras and giclee prints are sharper than the best analog film prints.\n\nI’m carrying my old Nikon FM2 (film 3200 Ilford) today and a little canon digi just for a bit of retro fun and it’s not as heavy as a Nikon D2X.\n\n"
    },
    {
      "time": " 30.Nov.2006 6.08am",
      "content": "Letterpress always seems like it would be so much fun; it’s a shame that my school ditched all its letterpress stuff. Fortunately it all ended up in a local printmaker’s studio, so maybe when I’m not taking five classes a semester I’ll get a chance to try using it.\n\n"
    },
    {
      "time": " 30.Nov.2006 7.12am",
      "content": "Vincent,  \nMy Nikon FM2 is my “new camera”. It replaced my FTN about 30 years ago. I bought the FTN in Japan in 1968 along with a Zenza Bronica :-)\n\nChrisL\n\n"
    },
    {
      "time": " 30.Nov.2006 10.39am",
      "content": "The film reminds me of my days in Junior High School when I took Print Shop every semester. My teacher always wore the traditional printer’s bow tie which, unlike a “normal” tie, could not get caught in the rollers of the press!  \nDB~\n\n"
    },
    {
      "time": " 1.Dec.2006 5.39pm",
      "content": "I’ve seen a few schools dump their little letterpress corner. One that did so about seven years ago announced to me that they were getting rid of the stuff because they felt it made the college appear “backward”. In my opinion offering a letterpress facility for even a little of a student’s early education is forward-thinking.\n\nI have had mature career designers attend sessions in my workshop, and most of them volunteered that they had learned more about type in those few days than they had over their entire careers.\n\nI don’t suggest that a person can’t get a grasp of typography without letterpress experience, but it does offer another way of thinking and makes clear the point and pica system in a tactile, real way.\n\nJim\n\n ![](http://web.archive.org/web/20080905101210im_/http:/www.typophile.com/files/%5D%5Bimg:)\n\n"
    },
    {
      "time": " 1.Dec.2006 6.17pm",
      "content": "\\> One that did so about seven years ago ...\n\n... is now kicking itself in the finial.\n\nhhp\n\n"
    },
    {
      "time": " 1.Dec.2006 7.17pm",
      "content": "Hey, SOTA folks or Joe/Jared — any chance of posting some of the films from the Typophile Film Festival to YouTube, for those of us who couldn’t make the event?\n\n"
    }
  ]
}
