{
  "id": "29831",
  "title": "Alternative Desktop Publishing Software",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Curious, does anyone have experience using any other desktop publishing software other than [InDesign](http://web.archive.org/web/20080314040935/http:/typophile.com/wiki/Adobe%252BInDesign) or [Quark](http://web.archive.org/web/20080314040935/http:/typophile.com/wiki/QuarkXPress)? Is there anything that might be stripped down version of these and could reside on a server for multiple users?\n\n [‹ Cursive NPR radio program tonight 7:00pm](http://web.archive.org/web/20080314040935/http:/typophile.com/node/29867 \"Go to previous forum topic\") [Choosing a Pen ›](http://web.archive.org/web/20080314040935/http:/typophile.com/node/29892 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080314040935/http://typophile.com/user/6496\" title=\"View user profile.\">Asvetic</a>",
  "time": "<br>",
  "uid": "6496",
  "comments": [
    {
      "time": " 30.Nov.2006 9.25am",
      "content": "I’ve heard that [Pages](http://web.archive.org/web/20080314040935/http:/www.apple.com/iwork/pages/) ( [see also](http://web.archive.org/web/20080314040935/http:/discussions.apple.com/forum.jspa?forumID=777)) from Apple is pretty darn powerful. I use it for internal business forms but know of people that use it for all sorts of publishing. I’d think the only drawback might be, for me anyway, the speed. But I’m on a granny old G4.\n\n"
    },
    {
      "time": " 30.Nov.2006 9.50am",
      "content": "[Xara Xtreme Pro](http://web.archive.org/web/20080314040935/http:/typophile.com/wiki/Xara%252BXtreme%252BPro) is the newest thing on the field:  \n [http://www.xara.com/products/xtreme/?v=pro&?t=](http://web.archive.org/web/20080314040935/http:/www.xara.com/products/xtreme/?v=pro&?t= \"http://www.xara.com/products/xtreme/?v=pro&?t=\")\n\nIt’s a very fast and compact application, here are some online tutorials and demos:  \n [http://www.xara.com/products/xtreme/demos/](http://web.archive.org/web/20080314040935/http:/www.xara.com/products/xtreme/demos/ \"http://www.xara.com/products/xtreme/demos/\")\n\nIt comes from the illustration end but they’ve just added multiple-page ability to it.\n\nA.\n\n"
    },
    {
      "time": " 30.Nov.2006 10.08am",
      "content": "You could always try LaTex with one of the various GUIs out there...but the end-user revolt might cost more than licenses for Quark/Indesign.\n\nMiss Tiffany is right about Pages—It’s a pretty awesome hybrid word processor/page layout app, altho IMHO Indesign is easier to use and it would probably be less expensive to buy indesign than to teach users how to get into Pages. My problem with doing layout in pages is that it’s a template-based word processor on steroids, so anything other than dumping text into templates or blank pages gets obtuse quickly.\n\n"
    },
    {
      "time": " 1.Dec.2006 9.51am",
      "content": "Interesting stuff, thanks for the suggestions so far. Sorry, I probably should have specified we’re a PC environment and most of the work that they’ll be doing is proposals and contracts... nothing visually stimulating _or I’d be out of a job_\n\nI think they’re looking for something MS Word but has a multiplage support and work flow similar to Indesign, just simplified.\n\nApparently, when you create multiple pages in Word and need to add images or more text to a previous page, it pushes all the contents down to create room. This puts kinks up the work flow. Since I rarely use Word, I wasn’t aware of this issue. I’m currently using InDesign for all my multiple page needs.\n\nTo recap:\n\n**• Desktop publishing with multiple page support and a per page work flow system that could run on a server in a PC environment.**\n\nThis might make finding an applicable application a bit more difficult.\n\n"
    },
    {
      "time": " 1.Dec.2006 10.09am",
      "content": "I found this —\\> [Top 10 Open Source Windows Apps](http://web.archive.org/web/20080314040935/http:/www.lifehacker.com/software/open-source/geek-to-live--top-10-open-source-windows-apps-208909.php), perhaps a start?\n\nYou might look for Open Office, I think that is what it is called. It is open source and would run on your machine. As you won’t be doing visually stimulating work I would think something like that might work?\n\n"
    },
    {
      "time": " 1.Dec.2006 10.39am",
      "content": "I wrote up a bit about the open source options for us graphic designers last year:\n\n[http://www.underconsideration.com/speakup/archives/002282.html](http://web.archive.org/web/20080314040935/http:/www.underconsideration.com/speakup/archives/002282.html \"http://www.underconsideration.com/speakup/archives/002282.html\")\n\nAlas, I didn’t actually review a page layout app. However, the open source option that is mentioned these days is Scribus:\n\n[http://www.scribus.net/](http://web.archive.org/web/20080314040935/http:/www.scribus.net/ \"http://www.scribus.net/\")\n\n"
    },
    {
      "time": " 1.Dec.2006 1.01pm",
      "content": "\\> Apparently, when you create multiple pages in Word and need to add images or more text to a previous page, it pushes all the contents down to create room. This puts kinks up the work flow.\n\nM$ Word is too clumsy and too windowy. Try Pagemaker!  \nIt —old and new— has One Control palette that changes according to  \nwhat (text and graphics) you need where you need and when you need  \nwithout changing tools or choosing commands.\n\n ![](http://web.archive.org/web/20080314040935im_/http:/typophile.com/files/PMCP_3559.GIF)\n\n"
    },
    {
      "time": " 1.Dec.2006 1.05pm",
      "content": "Pagemaker? Eww. ;o)\n\n"
    },
    {
      "time": " 1.Dec.2006 2.41pm",
      "content": "It’s better than Word! ;-)\n\nL.\n\n"
    },
    {
      "time": " 1.Dec.2006 3.06pm",
      "content": "[Canvas](http://web.archive.org/web/20080314040935/http:/www.acdamerica.com/default.html) is still around. Might be worth a look.\n\n"
    },
    {
      "time": " 1.Dec.2006 7.36pm",
      "content": "Um, well, I thought Asvetic was looking for something PC, and Canvas certainly is not.\n\n(I never thought it was worth using, FWIW.... And I used to use Ventura Publisher for Mac!)\n\nInDesign/Quark are pretty much the standard across the board: one would be hardpressed to find professionals using anything else.\n\n"
    },
    {
      "time": " 1.Dec.2006 8.25pm",
      "content": "What Linda? Canvas is too for the PC. It says so under the system requirements it will run on a Pentium III even.\n\n"
    },
    {
      "time": " 2.Dec.2006 9.24am",
      "content": "Wasn’t for PC the last time I looked at it, which probably dates me. ;-)\n\nIt certainly isn’t widely used, and I’ve never had a client come to me and request it, unlike PM/ID/Quark.\n\nL.\n\n"
    },
    {
      "time": " 3.Dec.2006 8.57am",
      "content": "What about Ragtime?  \n [http://www.ragtime-online.com/](http://web.archive.org/web/20080314040935/http:/www.ragtime-online.com/ \"http://www.ragtime-online.com/\")\n\n"
    },
    {
      "time": " 3.Dec.2006 1.45pm",
      "content": "Er, Ready Set Go! anyone? Just kidding ; ) Anything would be better than trying to layout stuff in MS Word. I didn’t know there were so many good alternatives.\n\n"
    },
    {
      "time": " 4.Dec.2006 1.19am",
      "content": "[Scribus](http://web.archive.org/web/20080314040935/http:/typophile.com/wiki/Scribus) is rather okay:  \n [http://www.scribus.net](http://web.archive.org/web/20080314040935/http:/www.scribus.net/ \"http://www.scribus.net\")\n\nEver thought about – hehe, \\*cough\\* – [Microsoft Publisher](http://web.archive.org/web/20080314040935/http:/typophile.com/wiki/Microsoft%252BPublisher)?  \noffice.microsoft.com/publisher/\n\n"
    },
    {
      "time": " 4.Dec.2006 1.45am",
      "content": "I wrote a fair amount on this and then managed to close the window, so will have to be a bit terse:\n\nWhen you mention the system being server-based, are you implying simultaneous editing/version control?\n\nIf so, requirement might come under the heading of Content Management systems rather than DTP, and I think you’ll struggle to find anything that could be decribed as cheap.\n\nIf not what’s the stress on being server based?\n\nWord is often used, particularly in house, for simple DTP and can produce professional results for certain kinds of docs, but you and your docs have to live with the single text stream approach, not worth trying to work round.\n\nIs the page-based workflow really required?\n\nCould you build single pages in Word and then collate (in Word or PDF)?\n\nPowerpoint is of course page based. Not suggesting it for anything that isn’t bullet points, but people do use it for all sorts of things, believe me - be ready with your arguments.\n\n"
    },
    {
      "time": " 4.Dec.2006 2.39am",
      "content": "Have a look at [iCalamus](http://web.archive.org/web/20080314040935/http:/www.icalamus.net/).  \nNever tried it myself, but it might be an option for you.\n\n"
    },
    {
      "time": " 4.Dec.2006 4.33am",
      "content": "You can try MiKTeX (a free LaTeX system for Windows)\n\n[http://www.miktex.org/](http://web.archive.org/web/20080314040935/http:/www.miktex.org/ \"http://www.miktex.org/\")\n\nand TeXnicCenter (a free LaTeX editor for Windows)\n\n[http://sourceforge.net/projects/texniccenter/](http://web.archive.org/web/20080314040935/http:/sourceforge.net/projects/texniccenter/ \"http://sourceforge.net/projects/texniccenter/\")\n\nso that you concentrate on content of the proposals and contracts.\n\n"
    },
    {
      "time": " 4.Dec.2006 10.18am",
      "content": " **elliot100 response:** Server based was what I was asked to look for, but I don’t believe it’s necessary, they just thought it be easier for the amount of collaboration some of the proposals require.\n\nWe currently use Microsoft Office 2003, it was expressed to me that they wanted something with a page-based work flow and realized that Word is NOT the solution.\n\n**filip response:** Have you used Ragtime? That looks like a solution suited to the users. Simplistic with just enough professional features to keep the end product professional.\n\n**Sebastian, Kon and Fransheidl response:** Not really looking for an Open-Source solution, but I appreciate your input. _ICalamus might be a bit too German(?) for our needs, plus it’s MacOS._ Thanks for the suggestion though.\n\nI’m going to push the Publisher angle until I come across something more efficient. I do like the looks of that Ragtime, and will play with the 30 day demo to see if it’s viable.\n\n"
    },
    {
      "time": " 4.Dec.2006 11.30am",
      "content": "iCalamus is pretty horrible. Microsoft Publisher is quite OK — and it is truly excellent for multilingual publishing (supports more writing systems than any other application I know). Ragtime is a reasonable alternative as well.\n\nA.\n\n"
    }
  ]
}
