{
  "id": "29862",
  "title": "(x) Boston, Massachusetts ornate serif face - Greco Deco {Patricia}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi  \nPlease identify this font.  \nThank you!\n\n ![](http://web.archive.org/web/20120101083142im_/http:/typophile.com/files/type_3769.jpg)\n\n",
  "author": "<a href=\"/web/20120101083142/http://typophile.com/user/1899\" title=\"View user profile.\">misalion</a>",
  "time": "<br>",
  "uid": "1899",
  "comments": [
    {
      "time": "",
      "content": "Bristol is quite close but caps only.\n\n[http://www.fonthaus.com/products/fonts/view.cfm/sku/GT0010114.cfm](http://web.archive.org/web/20120101083142/http:/www.fonthaus.com/products/fonts/view.cfm/sku/GT0010114.cfm \"http://www.fonthaus.com/products/fonts/view.cfm/sku/GT0010114.cfm\")\n\n"
    },
    {
      "time": "",
      "content": "Also the lovely [Celestia Antiqua Adornado](http://web.archive.org/web/20120101083142/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=MVB.118636.0.5&attributes.sampleSize=48&sampleText=Boston%2C+Massachusetts&sampleSize=24)\n\n"
    },
    {
      "time": "",
      "content": "Isn't that the old Greco Deco? I'll see if it's digitized.\n\n"
    },
    {
      "time": "",
      "content": "Patty: I have digital copies of this face as Grecco Deco -- copyright 1992, Lazy Dog Foundry. (I didn't post it because I couldn't see any current version available.)\n\nSkylar\n\n"
    },
    {
      "time": "",
      "content": "I have the same version, from Lazy Dog, but I can't find it either. They seem to have been acquired by Font Factory but I have not found Greco Deco on that site.\n\n"
    },
    {
      "time": "",
      "content": "I thought Greco Deco was caps only, like Greco Adornado. Both were shown from Franklin Typefounders in the old Precision Type catalog. The font 'Greco', also from Franklin, had a different lower case than the posted sample. 'Bristol' is apparently the new FontHaus name for this old Spanish typeface.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "So, is there any place I can buy Greco Deco? I really need to buy it.\n\n"
    },
    {
      "time": "",
      "content": "Awww. What's wrong with Celestia?\n\n"
    },
    {
      "time": "",
      "content": "It is very close, and I might just use it. But we have to charge the customer $50 for the font, and it is not the same... So I wanted to see if there is any way to buy Greco Deco, and that way what they are paying for is going to match what they want.  \nThank you!\n\n"
    },
    {
      "time": "",
      "content": "I hate to be hard selly, but the advantage of investing in a family like Celestia is you get complimentary styles. It's $49 for [Adornado, Bold, Inline, and Ornaments](http://web.archive.org/web/20120101083142/http:/www.fontshop.com/showfont.cfm?fid=MVB.118636.0.0). This means much more flexibility for the client down the line.\n\n"
    },
    {
      "time": "",
      "content": "I understand.... I didn't mean I don't want to pay $50. I meant I'd rather buy something that matches exactly to what they have been using. But at this point I think I need to tell them to switch to Celestina because this is the only one available, it seems.  \nThank you!\n\n"
    },
    {
      "time": "",
      "content": "You're better off with Celestina anyway because the Greco Deco I have is all caps only.\n\n"
    },
    {
      "time": "",
      "content": "I think this is the first time you've said that it was only caps. Doesn't that mean we have only found something with the same initials? Maybe if you mixed the Bristol initials with Celestia Adornado you would have the closest combination we can find offhand.\n\nIt would be interesting to try to find the Serif font that had the other letters of 'oston, assachusetts' without regard to the ornamented aspect. That 'c' and 't', and diagonally stressed 'o' are pretty distinctive.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I'd put my money on a Goudy for that one.\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "To me, it looks like some of the [Goudy typefaces](http://web.archive.org/web/20120101083142/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontpackage&startrow=1&records=&currpage=1&totalrecords=6&displayfontid=M.223.0.0&fontRendererText=oston+assachusetts), especially Goudy Catalog, are quite close to the lower case lettering of the sample. The only obvious 'disconnect' to me is the 's'. Notice the 'a', 'c', 't' and 'o', in particular.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Looks like we agree Lex.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Thank you all for your comment.  \nI realized I should have showed all I have, but I didn't want all information to appear.  \nBut at this point, I think I'd show everything. Numbers match with Bristo Adornado. I don't know about Greco Deco, but I'm sure they match with it too. As for them beeing all caps font, I am not sure what to do... I don't think it's worth it to draw the effect on all lower case letters from Goudy.\n\nThanks!\n\n ![](http://web.archive.org/web/20120101083142im_/http:/typophile.com/files/Boston_6680.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I'd just go with the Celestina. It's very close, just a little rougher. In fact the Greco Deco I have is also more 'filled in' than the sample, Bristol and Celestina are a little more open.\n\nFor the numerals, tho, the attempt at lining figs is very awkward, the 0, 1 and 2 really don't match the weight of the other numbers.\n\n"
    },
    {
      "time": "",
      "content": "This is a tardy post, but if you can find a copy of WSI's [Ramona](http://web.archive.org/web/20120101083142/http:/www.fontage.com/pages/ramona-h.html), it appears to be a perfect match. I've linked to a horrible showing of the font, but I have it and can assure you that it matches.\n\nWSI was a wholesaler of mostly knockoff clone fonts to companies that would then bundle the fonts with their products. I've never found an 'original' for their Ramona, though.\n\n"
    }
  ]
}
