{
  "id": "29871",
  "title": "Lost in translation?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Dear Typophiles,\n\nI’m reading the book ‘What is Typography?’ from David Jury, Rotovision.  \nIt says on page 52: ‘The sans-serif face was slightly more legible for the adult readers, but no measurable differences between the faces were observed with the children.’  \nAnd then comes the author’s comment: ‘[The sans serif used was Gill Sans, the serifed face was Jenson. The slight preference recorded by adults for the serifed face could be explained simply by the fact that most of their reading will have been of serifed faces.]’\n\nSince I’m not a native English speaker, I’m a bit confused, for me there seems to be a contradiction between the two sentences. The first says the sans-serif is more legible, but the second sentence says the serif face was it preferred by adults. Or does the author means that ‘if the serif face would have been preferred, that could be explained by the fact…, although the serif face was not preferred’?\n\nIs it a contradiction or am I missing something due to my English? If it’s a contradiction, which statement is right in your opinion? As far as I know serif faces are a tiny bit more legible.\n\nThank you,  \ntebalazs\n\n",
  "author": "<a href=\"user/11738\" title=\"View user profile.\">tebalazs</a>",
  "time": "<br>",
  "uid": "11738",
  "comments": [
    {
      "time": " 30 November, 2006 - 4:23pm",
      "content": "Perhaps the author is making a distinction between preference (what someone likes) and legibility (how easy it is to read)?\n\nPlease note that I haven’t read the book, this is just a suggestion about the possible language issue.\n\n"
    },
    {
      "time": " 30 November, 2006 - 4:24pm",
      "content": "Don’t make too much of an effort - frankly it sounds like some classic  \nwishful-thinking balderdash. I don’t know what you call that in Hungarian. :-)\n\nhhp\n\n"
    },
    {
      "time": " 30 November, 2006 - 7:47pm",
      "content": "Ask the author:  \nDavid.Jury \\_at\\_ colchester \\_dot\\_ ac \\_dot\\_ uk\n\n_Corrected by Admin_\n\n"
    },
    {
      "time": " 30 November, 2006 - 7:58pm",
      "content": "Erik, internet ‘bots can pick up standardly formatted email addresses and put them on spam lists - you might want to change that to something that requires a human reader, like “David.Jury\\_at\\_colchester\\_dot\\_ac\\_dot\\_uk”, to be safe.\n\nhhp\n\n"
    },
    {
      "time": " 30 November, 2006 - 8:23pm",
      "content": "It sounds to me like the writer has a bias for san serif being more legible, so wants to explain away an apparent contradiction.\n\nClaims about what is most readable are being made all the time, most often with little or no solid research basis. It is prudent to check into such claims thoroughly before accepting them, because there are so many unreliable ones.\n\n"
    },
    {
      "time": " 30 November, 2006 - 8:35pm",
      "content": "“because there are so many unreliable ones.”\n\nThen the problem comes in sorting out the wheat from the chaff. I am sure the conflicting parties would just point to eachother and say the other one was wrong.\n\nChrisL\n\n"
    },
    {
      "time": " 30 November, 2006 - 10:07pm",
      "content": "They are wrong; all of them. If they claim just about any superior performance, preference, whatever; either the sample is ridiculous or the interpretation is skewed, or the testing conditions are completely divorced from real reading situations, or some combination of these and any number of other flaws in methodology and design. The only accurate answer is to say that everyone has a different opinion and there’s no proof of any opinion as yet.\n\nThe author might not be contradicting himself; as an example of the meaninglessness of the various studies, the findings he cites could indeed say that adult readers preferred Jenson but found Gill more legible. What that’s saying is that nobody learned anything valuable.\n\n"
    },
    {
      "time": " 1 December, 2006 - 7:00am",
      "content": "Thanks Carl, That was the most refreshingly honest statement I have heard on the great readability debate in years.  \nThe giant leaps made in published studies between the actual stuff that they measured and the conclusions others have drawn from it is enormous.\n\nChrisL\n\n"
    },
    {
      "time": " 1 December, 2006 - 9:34am",
      "content": "Honest? You mean convenient - for your premeditated stance.\n\nThere’s a huge chasm between supporting the fallacy that familiarity is everything versus pointing out that the testing so far has simply not been good enough. Furthermore, even with flawed tests (or even with no tests at all) there’s no excuse for refusing to think. Liberation from thought is in fact slavery to whim.\n\nhhp\n\n"
    },
    {
      "time": " 1 December, 2006 - 9:44am",
      "content": "“for your premeditated stance”\n\nThat from the inventor of the premeditaded stance.\n\n“there’s no excuse for refusing to think.”\n\nYes, try it sometime instead of reaching into your biggoted bag of premeditated stances.\n\nChrisL\n\n"
    },
    {
      "time": " 1 December, 2006 - 10:26am",
      "content": "Thank you for your comments. I’m still in doubt, but it seems normal. : )\n\nOtherwise the quoted first sentence stating that the sans-serif was a bit more legible for the adults was one of the (less important) conclusions of an 1969 research on typography for vision impaired people. I’m sorry for not saying this earlier.\n\nThe author is also pointing out earlier that we have to be cautious and dubious accepting the results of testings on reading, e.g. due to uncommon circumstances and situation.\n\nI’m not a typographer and I don’t know as much about type as you do, but I believe testings are taking us closer to understand the reading process. I hope there is agreement in the basic questions already, if not in all detail.\n\nThanks,  \ntebalazs\n\n"
    },
    {
      "time": " 1 December, 2006 - 10:34am",
      "content": "\\> I believe testings are taking us closer to understand the reading process.\n\nI certainly think so. It’s just frustrating because so many of the studies are so poor and overall progress is very slow. Some of us are trying to help things along on the empirical testing front, but especially frustrating is that we face an “internal” battle as well - against designers (using the term loosely…) who consistently (and often covertly - which makes it much harder, and they know it) try to tear down any and all empiricism because it doesn’t suit their personal philosophies.\n\nhhp\n\n"
    },
    {
      "time": " 1 December, 2006 - 11:05am",
      "content": "“I hope there is agreement in the basic questions already,”\n\nActually some typophiles are much more interested in the mechanism of reading in general, others more interested in learning about preference, or specifics about type design that influence readability. If you go outside our bubble, you find others whose interest starts from their work with the vision-impaired, or even from government-mandated standards that resulted from some of this dubious research. So I wouldn’t call it agreement, so much, but it has certainly been stated repeatedly that research methods and materials need much more careful and informed design, before meaningful data on any of these areas can be had.\n\nSince this dialog is heating up, and previously disconnected points of view are interacting, there’s an improving outlook for meaningful testing, so we are making slow progress.\n\n"
    },
    {
      "time": " 1 December, 2006 - 11:10am",
      "content": "_There’s a huge chasm between supporting the fallacy that familiarity is everything versus pointing out that the testing so far has simply not been good enough._\n\nAnd it never will be. There is no controlled condition in this instance, that can produce accurate results across the board because all individual people are different. And with those differences come preferences, and with those preferences come perceptions, and with those perceptions come individual truths. If I prefer sans serif over serif, I will almost always “perceive” one to be more legible than the other regardless of whether or not its true. Find me an unbiased participant, in anything, anywhere…\n\n_against designers (using the term loosely…) who consistently (and often covertly - which makes it much harder, and they know it) try to tear down any and all empiricism because it doesn’t suit their personal philosophies._\n\nWhich shows you have a bias towards designers…\n\n"
    },
    {
      "time": " 1 December, 2006 - 11:23am",
      "content": "But Terry, it’s not impossible to design objective tests, it’s just difficult, and we haven’t had all the right ingredients together yet.\n\n"
    },
    {
      "time": " 1 December, 2006 - 11:27am",
      "content": "\\> And it never will be.\n\nIt never will be complete, or it never will be <cite>good enough</cite>? The latter being what I wrote, and in the way I meant it, something that certainly seems achievable. I’m one of the main people saying the testing lab -as it stands now- is not conducive to real understanding, but individual differences do not preclude sufficiently-safe general conclusions that can help us make real progress in the overall.\n\n\\> you have a bias towards designers…\n\nAdmitted - I prefer people who try to help others more  \nthan those who would rather simply express themselves.\n\nhhp\n\n"
    },
    {
      "time": " 1 December, 2006 - 11:33am",
      "content": "Nobody is trying to tear down “any and all empiiricism” “they” or at least I, am trying to ensure that there is true empiricism, not the phoney pretentious biggotted variety that uses the term only when it suits someones own inflated selfimage.\n\nYes, the testing so far is “not good enough” so why should we continue to abstract absolutes from it and thereby close our eyes to some yet unknown alternative which may be “good enough”?\n\nChrisL\n\n"
    },
    {
      "time": " 1 December, 2006 - 11:58am",
      "content": "_it’s not impossible to design objective tests, it’s just difficult, and we haven’t had all the right ingredients together yet._  \nThis pot of chili has been waiting to be made for years…the people are getting hungry.\n\nIn terms of determining reading legibilty tests, I DO think it is impossible. There are just too many factors to test, and too many rules to be defined. Until I see one solid agreed upon list of factors, controls and variables I’m never going to believe it can be done.\n\n_Admitted - I prefer people who try to help others more  \nthan those who would rather simply express themselves._\n\nYou’re a smart guy Hrant, but this speaks to your vast ignorance of what graphic design actually is.\n\n"
    },
    {
      "time": " 1 December, 2006 - 12:17pm",
      "content": "Terry, the goal isn’t one final answer we can toss at students to shut them up. It’s puzzle pieces, like with archeology. Right now we have tiny fragments, badly collected and interpreted. If well-rounded groups start forming and developing better tests, observing and reporting meaningful results, we’ll have much bigger pieces, in much better shape, that will help us immensely with the overall picture. There is a lot of potential for understanding reading and the functionality of type. Obviously there are a few people interested in it.\n\n"
    },
    {
      "time": " 1 December, 2006 - 12:28pm",
      "content": "There is an old joke about a guy who lost his car keys one night. He had been searching and searching for them under this street lamp several yards away from his car for hours. A passerby noticed and asked the guy if he was sure his keys were under the streetlamp. The key searcher answered, “No, I am not sure at all but the light is better here than over there by my car.”\n\nWe have been researching readability for years following the paths set by those before us. Perhaps we are just searching in the most lighted location rather than in the darkness where perhaps the answer more likely lurks?\n\nChrisL\n\n"
    },
    {
      "time": " 1 December, 2006 - 12:28pm",
      "content": "_Obviously there are a few people interested in it._  \nAgreed. I am one of those people. When I first started reading about legibilty I thought it was possible. But as I read the debates and the numerous threads and bar-fights on Typophile about it…I find it to be a much less tangible goal.\n\nBut again, what _exactly_ are we talking about studying? Because there are a lot of factors here to discuss in regards to reading and type. I always see the words “readability” or “legibility” that are endlessly debated without a clear definition of either term.\n\n"
    },
    {
      "time": " 1 December, 2006 - 1:00pm",
      "content": "Terry, please don’t think I believe graphic design is or should be devoid of expression. I’ve said this sort of thing before: nothing made by a human can be devoid of expression, and nothing made for a human should be. The difference between Art and Design however is the all-important Intent, which causes expression to be the objective in the former, while merely a subliminal force in the latter; in the former, Expression Is; in the latter, Expression Happens.\n\n\\> trying to ensure that there is true empiricism\n\nMaybe not the case with you, but there are people who’d like to ensure the opposite, because they’re afraid of what people will end up thinking. It’s not far-fetched to claim that many people don’t want to change, not their habits, and certainly not their philosophy. Age has a lot to do with this; some of them have weathered their storms, and don’t want any more storms. Others are not only not tired of storms, they can’t wait for the next one to come and clean the writing on the walls (to rephrase Dire Straights). Heck, some even enjoy <cite>causing</cite> storms! :-\\>\n\n\\> why should we continue to abstract absolutes from it and thereby close  \n\\> our eyes to some yet unknown alternative which may be “good enough”?\n\nWho said anything about absolutes? You arrive at conclusions, and hopefully you apply them, if never with total certainty. What else is new in life?\n\n\\> what exactly are we talking about studying?\n\nTo me, at the highest level, how the instances of notan are turned into thought. More modestly, how the instances of notan are turned into language. Even more modestly, how the instances of notan are turned into words.\n\nhhp\n\n"
    },
    {
      "time": " 1 December, 2006 - 1:19pm",
      "content": "_some yet unknown alternative_\n\nWhat frustrates me about reading research is that it seems, theoretically, stuck in the behavioralist past. Sure, it’s hard to measure, but I’d like to see more theories that reference more recent ideas like the quantum mechanics of consciousness, or perhaps this:\n\n[http://www.edge.org/3rd\\_culture/mandelbrot04/mandelbrot04\\_index.html](http://web.archive.org/web/20070127052638/http:/www.edge.org/3rd_culture/mandelbrot04/mandelbrot04_index.html)\n\nRaph Levien is a breath of fresh air in typog **raph** y (sorry) with his mathematical frequency analyses of Aldine pages.\n\n"
    },
    {
      "time": " 1 December, 2006 - 1:26pm",
      "content": "\\> I’d like to see more theories that reference more recent ideas\n\nAny theorizing is better than nothing, but ideally theories come from  \nsome hint of evidence, somewhere, not just out of the blue coolness.\n\nBTW, Raph deserves gobs of credit for bunches of things, but I’m pretty sure he got that particular idea from the Fourier transform guy - I forget his name, and Typophile’s search doesn’t work… Peter knows.\n\nhhp\n\n"
    },
    {
      "time": " 1 December, 2006 - 1:40pm",
      "content": "Fourier transform, that’s what I was trying to remember.\n\n_evidence_\n\nExactly. Use the printed (or screen) text as evidence, and look for mathematically-expressible patterns which may reveal something of the nature of reading. An alternative (not a replacement) to tracking eye movements.\n\n"
    },
    {
      "time": " 1 December, 2006 - 1:55pm",
      "content": "How would analyzing the stimuli mathematically reveal the processing of them? Maybe if you believe there’s some metaphysical connection… But one thing I think is NOT measurable is metaphysics!\n\nBTW, here’s that guy, thanks to Peter:  \n [http://www.malgil.com/esl/aldus-fft/](http://web.archive.org/web/20070127052638/http:/www.malgil.com/esl/aldus-fft/)\n\nhhp\n\n"
    },
    {
      "time": " 1 December, 2006 - 1:59pm",
      "content": "_The difference between Art and Design however is the all-important Intent, which causes expression to be the objective in the former, while merely a subliminal force in the latter; in the former, Expression Is; in the latter, Expression Happens._\n\nI stand corrected. You understand design better than I thought. :)\n\n"
    },
    {
      "time": " 1 December, 2006 - 2:27pm",
      "content": "_Maybe if you believe there’s some metaphysical connection_\n\nWhat makes you say that?  \nThat’s got nothing at all do with what I said.\n\nI was suggesting that analyzing the visual structure of text may be useful, in the way that analyzing its grammar is useful.\n\nSurely you don’t believe that grammar is metaphysical and has nothing to do with the mechanics of reading?!\n\n"
    },
    {
      "time": " 1 December, 2006 - 2:40pm",
      "content": "I think trying to derive the nature of usage of an object from a  \nmechanical processing of the object itself is self-fulfilling at best.\n\n(Terry, thanks.)\n\nhhp\n\n"
    }
  ]
}
