{
  "id": "29875",
  "title": "why is serif still used today?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "what purpose does it convey? is there specific reasons as to why they still around after so many centuries? what kept them alive? who kept them alive and for what purpose?\n\n",
  "author": "missgiggles",
  "time": "1 Dec 2006 — 3:43am",
  "uid": "14600",
  "comments": [
    {
      "time": "1 Dec 2006 — 5:29am",
      "content": "Is there any reason not to use it?\n\n"
    },
    {
      "time": "1 Dec 2006 — 5:42am",
      "content": "just wondering how and why its lasted so long? what kept it going?\n\n"
    },
    {
      "time": "1 Dec 2006 — 6:00am",
      "content": "The need of spreading old good books, for example, so that Giggles can read them ?\n\n"
    },
    {
      "time": "1 Dec 2006 — 6:38am",
      "content": "what have you got against the poor serif, miss g? it seems that you've got a vendetta against the poor thing!\n\n"
    },
    {
      "time": "1 Dec 2006 — 6:45am",
      "content": "Paul you read my mind. Miss G seems to be on a personal mission to do away with the serif. And didn't she already ask this question (in one way or another)\n\nEasier to read, more formal, classic. Reading a novel or a newspaper in sans would make your eyes hurt. No matter how beautiful the font.\n\n"
    },
    {
      "time": "1 Dec 2006 — 7:36am",
      "content": "Miss G, in addition to defending the serif which you seem so eager to consign to the dust heap of history, I'd also like to recommend you acquaint yourself with another archaic throwback to an earlier era, the Shift key. It's just to the left of the z on your keyboard. Like the serif, it can make your text more reader friendly.\n\n"
    },
    {
      "time": "1 Dec 2006 — 8:36am",
      "content": "missgiggles seems to suffer from [seriphobia](http://web.archive.org/web/20131022025343/http:/typophile.com/wiki/seriphobia).\n\n"
    },
    {
      "time": "1 Dec 2006 — 8:44am",
      "content": "I keep wondering why I still use my voice.\n\nI type much faster than I speak. There are excellent synthesizers out there with much better diction and volume than I manage. I'd be far more effective if I sounded like that \"in a world\" guy from the movie trailers. Why am I still using my voice?\n\n"
    },
    {
      "time": "1 Dec 2006 — 8:55am",
      "content": "\\> Easier to read, more formal, classic.\n\nTriple bingo.\n\nOn the other hand:  \n1) Some people use it out of pretension (although the same applies to sans).  \n2) We should find out as much as possible concerning why it helps reading.\n\nLong live the serif!\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2006 — 8:58am",
      "content": "Kristen,  \nJust keep singing instead of talking :-)\n\nChrisL\n\n"
    },
    {
      "time": "1 Dec 2006 — 9:00am",
      "content": "_Why am I still using my voice?_\n\nIt has the most unique personality?\n\n"
    },
    {
      "time": "1 Dec 2006 — 9:05am",
      "content": "On the other hand, clients and their users are not really interested in the designer's personality (at least not explicitly) which is fine because if they are I'd worry. We have enough problems with the cult of personality in the west without obsessing about it in the design of useful things.\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2006 — 9:27am",
      "content": "Why do we keep taking the bait?\n\n"
    },
    {
      "time": "1 Dec 2006 — 9:35am",
      "content": "Miss Giggles, if you could articulate all of your thoughts into one cohesive statement -- even if it is several paragraphs long -- we might understand where you are coming from.\n\nThe serif isn't a problem. Heaven forbid the day when we only have sans to choose from. I for one, as a graphic designer and typographer, would lash out and rebel should this happen. I relish have choice, even if it is a subtle choice between serif and sans.\n\n"
    },
    {
      "time": "1 Dec 2006 — 9:56am",
      "content": "_personality_\n\nSometimes a cigar is just a cigar, not a bare neck prompting axe grinding.\n\n"
    },
    {
      "time": "1 Dec 2006 — 10:12am",
      "content": "okay Tiffany, the whole point of asking thsi question was because i am trying to figure out the development of the serif from the Romans to the Runaissance and beyond to this day and trying to analyse the whole developing process ofit and how its been expanding etc. i have major events that i have pin pointed which are very important to the serif development like:  \n- Roman inscriptions,stone chiselled serif letters.  \n- Trajan column  \n-Roman numerals  \n-Tory Geoffory (student of Leonardo da Vinci and Durer) who designed serif with great precision.  \n-Classical fonts like Garamond, Bembo, Caslon, Didot, Baskerville, Times, Bodoni and trying to understand how they expanded into the type families they are today but i'm missing information beyond Renaissance so i'm wondering what happened between then and now? What major developments took place? and why and how the serif is used today. thats all. i guess i should have said all this in the first place rather than ask separate questions. sorry people.\n\n"
    },
    {
      "time": "1 Dec 2006 — 10:20am",
      "content": "I don't actually get from miss g. that she wants the serif gone. They are questions. It sounds like she wants to understand why the tradition is so strong.\n\nSo, Miss G, here are some clues: Tradition?, \"Who Kept Them Alive\", and \"For What Purpose\".... Those are your best questions to ask. Unfortunately none of us can rattle off textbook answers. It's easier to explain where they came from and how they changed over the centuries, but this question of \"why\" is kind of unanswerable.\n\nWorth noting: there were those in the early 20th century who predicted it would be the century of the sans serif. They were correct. Look at the type from 1900-2000. However, if they also said or implied that the serif would go away forever, they were wrong. Look at the type of 1950-2006.\n\nThe pluralism of graphic options could be seen as biodiversity; users of type tend to want a lot of variety once they realize they can have choices. Even if we can't explain the purpose of serifs, they seem to satisfy something very basic for us; you'd have a revolution on your hands if you tried to ban serifed type. Clearly they are not \"vestigial\" or unnecessary as some have proposed. If they are, then it's tradition keeping them alive.\n\nExpecting only the \"most functional\" type to survive is probably misguided.\n\n"
    },
    {
      "time": "1 Dec 2006 — 10:29am",
      "content": "\\> Runaissance\n\nAh, new satirical term: Renuisance Man. :-)\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2006 — 10:36am",
      "content": "crossgrove, i dont want a ban on serifs. why would i want that for? its probably the tone of voice that i have conveyed in my question that made you think that. is liek you said: who kept them alive and for what purpose is what i am really after. how come it is still living strong after so many centuries, tahst all. sorry for the misunderstanding.\n\n"
    },
    {
      "time": "1 Dec 2006 — 10:41am",
      "content": "No, **I** don't think that. Read the thread; **everyone else** seems to think that. I'm trying to answer your questions as you've asked them. Is there static on this line?\n\n"
    },
    {
      "time": "1 Dec 2006 — 10:45am",
      "content": "Miss Giggles that is such a broad question! Simple answer: the serif still alive because people like it and it's easy to read. And appropriate, visually, to a broad range of applications. Sometimes the sans is simply too hard edged, cold, or modern to work properly. Why overthink?\n\nNot to mention that design - like everything else - is cyclical. Things fall out of fashion, get revived and dusted off and have a new life. The trends that endure are those that are timeless and not too tied to a specific era or movement. Like the good pair of boots that you wear year after year because they are comfortable and durable and go with everything.\n\nBut of course there's also room for a pair of pink sparkly pumps to liven things up on occasion.\n\n"
    },
    {
      "time": "1 Dec 2006 — 11:00am",
      "content": "untested hypothesis: serifs produce better [boumas](http://web.archive.org/web/20131022025343/http:/typophile.com/wiki/bouma).\n\n"
    },
    {
      "time": "1 Dec 2006 — 11:04am",
      "content": "Designing anything that is meant to be read is necessarily conservative. The reading public has little tolerance for innovation, and besides historically most innovations have owed as much to changes in technology as to the desires of type designers to express their personality, if not more.\n\nDifferent type styles, different letterforms, or different writing systems altogether may be vastly superior in readability, but the reading public comes with a strongly built-in bias towards what it is accustomed to.\n\nSo if serif faces have been used in setting Roman text for centuries, the question to ask is not why is it still used today, but why innovations are introduced at all. The history of type for immersive reading really is about these little innovations that somehow defy the staticity and inertia of the reading public's preferences, whatever the reasons behind them might be.\n\nSo in short, it is not that people have worked hard to keep the serif alive all this time. It would have been much, much harder to force people to abandon the serif.\n\n"
    },
    {
      "time": "1 Dec 2006 — 11:57am",
      "content": "I think the conservativeness of the reading public is generally over-stated, and it's entirely possible to deploy innovation that \"flies under the radar\" of possible conscious layman rejection.\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2006 — 11:59am",
      "content": "_...type designers to express their personality..._\n\nWhat I meant was the personality of the typeface, eg its individuality.\n\nWith serifs, it's possible to also incorporate stroke variation in a type design, without getting excessive sparkle. Stroke variation, not necessarily for reading functionality, but as a means of providing variety of personality in at typeface.\n\nSo, serif faces have more personality than sans serifs, more options for variety -- which can be use by typographers to match the variety of uses, the different personalities of products, of typographers, and of different media.\n\nOf course, if you're a really good graphic designer, you can use Helvetica for everything and make it look brilliant all the time.~\n\n"
    },
    {
      "time": "1 Dec 2006 — 1:36pm",
      "content": "Miss Giggles, have you happened to read any of the suggested books yet?\n\n"
    },
    {
      "time": "1 Dec 2006 — 2:08pm",
      "content": "_Renuisance Man._  \nThanks hrant, that put me into ... helpless giggles.\n\n"
    },
    {
      "time": "1 Dec 2006 — 3:29pm",
      "content": "yes i have but origin of serif is on it's way but they all make me cinfused coz i'm reading too much and forgetting what goes where and i cant relate things together and link them coz there's just too much history to read. i'm trying my best though.i have 7 books im reading all on typography and history and they got different dates to somethings though so i dont know what it should be but i do my best. am i asking questions that are unreasonable? is that why u asking?\n\n"
    },
    {
      "time": "1 Dec 2006 — 4:12pm",
      "content": "<cite>Why do we keep taking the bait?</cite>\n\nBecause there's nothing good on TV, at least not until Inside Washington at 8:30. I can't decide what's funnier; Krauhammer's insanity, Totenberg's outfits, or Miss Giggles baiting people into a conversation about the worth of serifs.\n\n<cite>yes i have but origin of serif is on it’s way but they all make me cinfused coz i’m reading too much and forgetting what goes where and i cant relate things together and link them coz there’s just too much history to read</cite>\n\nThat's not hard to identify with. I find reading design books one at a time has become a necessity.\n\n<cite>am i asking questions that are unreasonable? is that why u asking?</cite>\n\nI don't think it's necessarily the questions you ask, but the way you ask them. They tend to be written like above-average text messages, which makes them rather offbeat for typophile, as well as a little confusing.\n\n"
    },
    {
      "time": "1 Dec 2006 — 4:22pm",
      "content": "Miss Giggles, when I have done historical writing and I needed to track a timeline I used small postcards and would write the date (year) at the top large, and then the event smaller underneath it. After a while I was able to see a timeline form because of these dates. You might try that. You can tape them to your wall, move them around, add more information as you find it. Very useful.\n\n"
    },
    {
      "time": "1 Dec 2006 — 4:25pm",
      "content": "Post-it-notes work well for me with convoluted project management timelines, why not type history too?\n\nChrisL\n\n"
    },
    {
      "time": "1 Dec 2006 — 5:33pm",
      "content": " ![](http://web.archive.org/web/20131022025343im_/http:/typophile.com/files/Chaplin-falling-for-it_5379.png)\n\n"
    },
    {
      "time": "1 Dec 2006 — 5:35pm",
      "content": "Good answer, Dez.\n\n"
    },
    {
      "time": "1 Dec 2006 — 7:47pm",
      "content": "_Why do we keep taking the bait?_\n\nBecause some people have a pathological need to respond to obviously stupid questions.\n\nGiggles is wasting time and bandwidth, folks. Do what most of have done: ignore her....\n\n"
    },
    {
      "time": "1 Dec 2006 — 8:46pm",
      "content": "LOL\n\n"
    },
    {
      "time": "1 Dec 2006 — 8:46pm",
      "content": "Is she really that bad?\n\nhhp\n\n"
    },
    {
      "time": "1 Dec 2006 — 9:56pm",
      "content": "Sure her questions are naive, but that can be refreshing. I found \"Are there movements...\" quite thought-provoking.\n\n"
    },
    {
      "time": "2 Dec 2006 — 3:57am",
      "content": "For your purpose question I would suggest that you try carving some characters in stone, explore in a physical way why serifs might be practical to a carver, you don't have to be skilled to reach some conclusions. You also can't discard the aesthetic, it needn't be entirely practical that a character is shaped the way it is, despite the base shape having an established form. Also don't assume that all Roman writing used serifs, stone is not indestructible but it has longevity advantages over other mediums.\n\nPerhaps you should look at your question from another direction, why did sans come about; what purpose did it serve; were there any technological advances that might have contributed to it; also why, if you have a choice, would you remove one of your options &c. &c.\n\nFor a timeline you could look here  \n [http://www.xs4all.nl/~knops/timetab.html](http://web.archive.org/web/20131022025343/http:/www.xs4all.nl/~knops/timetab.html \"http://www.xs4all.nl/~knops/timetab.html\")\n\nbtw Geofroy Tory are you sure he was a student of both da Vinci and Dürer or do you mean he studied their work?\n\nTim\n\n"
    },
    {
      "time": "2 Dec 2006 — 8:37am",
      "content": "\\>from the Romans to the Renaissance and beyond to this day\n\n\\>“Who Kept Them Alive”, and “For What Purpose”\n\nMaybe there is a textbook answer, if there can be such a thing outside of the existence of said textbook.\n\nIt's not just the \\*serifs\\*, but the forms of serif designs which bring a unique thing to type. This unique thing comes from the details of designs of the serif -ed type which allow the differentiation of features between characters more broadly than most sans serif designs are capable of, (without looking like you just cut serifs off;). And thus, it is thought by this uniqueness in detail that serif designs aid the reading process for some people in some documents.\n\nThe serifs in particular, and for the most part, are part of our familiarity with the rest of the serif forms they are attached to, so, for the most part, we \\*kept\\* them for reading purposes. But then, as time went by, broader uses of the serif style came along as signage and book work sought timeless and classical appearances.\n\n\\>Renaissance and beyond to this day  \nMy milestones are:  \n1. Design of Romans suited for letterpress.  \n2. Design of Romans for mass and personal mechanical composition.  \n3. Legibility Series by Linotype.  \n4. Democratization of the Romans by PostScript/Fontographer.\n\nEr@least that's what I think. Cheers!\n\n"
    },
    {
      "time": "2 Dec 2006 — 9:26am",
      "content": "_Giggles is wasting time and bandwidth, folks. Do what most of have done: ignore her…._\n\nOuch, Linda! :) But as James said, its not so much what questions she asks, as how she asks them. However thought provoking the questions are, many are not complete thoughts, or complete sentences. Asking questions is not a stream of consciousness writing exercise in a chat room. There have been way too many good, intelligent well formulated questions that have been asked on Typophile that have been virtually ignored.\n\nI don't understand why many of you are so patient with someone who doesn't even attempt to capitalize or punctuate sentences properly, while many great questions and good portions of the critique section get treated like a red-headed stepchild. There are too many people who come on Typohpile who work hard at finding the answers, before they ask them.\n\n"
    },
    {
      "time": "2 Dec 2006 — 11:24am",
      "content": "I think this is a terrific and fundamental topic. It’s incurious to dismiss it.\n\nI agree with others that the Catich’s The Origin of the Serif is a worthwhile book. He makes a compelling argument that serifs did not come from stone cutting. My two sentence summary is that serifs are a result of reed writing. The reeds were cut at a slant to allow a writer to have vertical stems that were thicker than horizontal stems (to compensate for a visual perception illusion). Serifs on the left side of a letter were necessary for even ink distribution across the reed while the right side serifs were needed to keep the ink from smudging.\n\nNo matter what the origin of the serif, I think it’s an interesting question to ask why it’s around today. Some propose that it improves word recognition, though I have not seen compelling evidence that serifs help or hinder word recognition. Some claim that the serifs help draw the reader’s eye across a line of text. I agree with Nick that the most plausible explanation is to convey personality differences.\n\nCheers, Kevin\n\n"
    },
    {
      "time": "2 Dec 2006 — 11:38am",
      "content": "\\>The reeds were cut at a slant to allow a writer to have vertical stems that were thicker than horizontal stems (to compensate for a visual perception illusion).\n\nI don't think this can be correct as the Aramaic script, now used for Hebrew, is very ancient, is pen written, and has thick horizontals and thin verticals, the opposite of latin script. It also has serifs, though they are generally vertical. I agree that serifs are a natural result of writing with a pen.\n\n"
    },
    {
      "time": "2 Dec 2006 — 12:57pm",
      "content": "\\>Some claim that the serifs help draw the reader’s eye across a line of text.\n\nI agree with this, an important point to me.\n\n\\>With serifs, it’s possible to also incorporate stroke variation in a type design, without getting excessive sparkle.\n\nYes! I never liked Optima that much…\n\nSerifs can reduce the \"gap\" between the letters or in other words, helping to connect the different letterforms and at the same time, helping to separate the letterforms from eachother – don't know if somebody can follow me – ok, i'm far from being a scientist or typedesigner. I just love antiquas and love to read it!\n\n"
    },
    {
      "time": "2 Dec 2006 — 1:07pm",
      "content": "\\>if somebody can follow me\n\nYes, I have argued a similar point here before. My argument is that serifs can achieve adequate space between letters while achieving even color. With a sans, you tend to have to tighten the spacing to get even color--to the point that it hurts readability, expecially in faces with wide counters, like Helvetica. (The ratio between the space within counters and between letters is important to readability.)\n\nI suspect that there are other benefits as well, such as defining the line of text clearly, and others.\n\nI\n\n"
    },
    {
      "time": "2 Dec 2006 — 2:24pm",
      "content": "\"Some claim that the serifs help draw the reader’s eye across a line of text.\"\n\nThis is what I'm calling logicalistic; It sounds like it's logical but it's only a convenient supposition that is generally accepted in place of an explanation. It isn't an explanation at all.\n\nHas it occurred to you that the line of text itself, the alignment of the typeface and its spacing draw your eye across? Look at a page of text. The letters aren't all in a jumble, equidistant from each other in every direction. They're in lines already. What about your lifetime habit of reading left to right? Could that help \"guide the eye\"? Or Notan, gelling letters into words? Could any of these obviously functional realities have any more bearing on reading than this fantasy rightward momentum? Finally, How about the fact (!!) that we read in saccades? If that's true, and we have space between lines of text, and the typeface is well-spaced, then why would we need serifs to \"guide\" our eyes?\n\nThis is too much like the persistent human tendency to anthropomorphize animal behavior, because it's convenient. Since an ostrich can't tell you their real motivations and impulses, you can conveniently project your own neuroses and blindnesses on it. Since there isn't a dazzling scientific factoid to replace it, we can continue to chant this silliness about serifs guiding the eye.\n\n\"With a sans, you tend to have to tighten the spacing to get even color—to the point that it hurts readability, expecially in faces with wide counters, like Helvetica.\"\n\nBill, Helvetica is badly spaced. Other grotesque sans designs are not. Then there are the other categories of sans. The lack of serifs doesn't compel a type designer to space a typeface tightly. This is more paralogic, something to say that fills the space where a real explanation should go. When you design a sans typeface you can revisit this idea.\n\n\"With serifs, it’s possible to also incorporate stroke variation in a type design, without getting excessive sparkle\"\n\nHogwash. Optima isn't the only sans with contrast. Another logicalistic leap.\n\nI am perfectly willing to believe that serifs have a function, but hearing people parrot the same, logicalistic idea is just more hot air at this point. Kevin, who is a reading scientist, has already pointed out that nothing supports these theories. If he's not convinced, why are you? I'm sorry if this sounds harsh, but people need to think harder about this.\n\n"
    },
    {
      "time": "2 Dec 2006 — 3:08pm",
      "content": "_Hogwash. Optima isn’t the only sans with contrast. Another logicalistic leap._\n\nNot at all. Perhaps I should have qualified \"incorporate\" by \"easily\", though.\n\nWhy there are so few sans faces with contrast, compared to the masses of serifed faces with contrast? The fact is, the combination of serifs with contrasted strokes provides a huge canvas for creating all kinds of stylistic variety.  \nSure, contrasted sans faces are possible, and can be effective (as you have demonstrated with Beorcana), but the genre is small because it is problematic. It is difficult to make an effective contrasted sans, but just add serifs, and it makes things a lot easier. There is nothing \"logicalistic\" about this line of reasoning, and it has nothing to do with reading science, as sparkle is a phenomenon which predates that considerably (going back at least to Ben Franklin's Caslon-Baskerville prank). My observation is \"practicalistic\" and based on typology and type culture.\n\nThe smallness of the slab serif genre also bears this out: there is not so much design room in the genre for stroke contrast between the main stems and the serifs, because the serifs are already substantial. So again, lack of stroke contrast = small genre.\n\n"
    },
    {
      "time": "2 Dec 2006 — 3:08pm",
      "content": "[Adrian Frutiger](http://web.archive.org/web/20131022025343/http:/typophile.com/wiki/Adrian%20Frutiger) makes some interesting associations regarding the development and acceptance of sans serif designs in his article, _[The History of Linear, Sans Serif Typefaces](http://web.archive.org/web/20131022025343/http:/www.linotype.com/2258-16893/thelosspart1.html)_:\n\n_It was not until the birth of modernism that architects ventured to introduce a naked column, made of concrete. The fear that a line without boundaries might flow on forever gave way to a worldview defined by rationality – heralding the beginning of widespread use of sans serif typefaces_\n\n ![](http://web.archive.org/web/20131022025343im_/http:/typophile.com/files/feet_serifs_6284.jpg)\n  \nBut for my part, I believe the sustained use (and further development) of serif and script designs have more to do about humanistic sensibilities much in the same way we relate to \"practical\" versus \"fashionable\" choices in clothing (or as Hrant would point out, shoe styles).  \n\n ![](http://web.archive.org/web/20131022025343im_/http:/typophile.com/files/fashion_faces_4926.jpg)\n\n"
    },
    {
      "time": "2 Dec 2006 — 3:28pm",
      "content": "@crossgrove\n\nIf something displays in a horizontal direction (serifs) on the same line (in vertical position) over and over again – to what effect can it lead to?\n\n- - - - - - - - - - - - - - - - is this a line?\n\n"
    },
    {
      "time": "2 Dec 2006 — 3:33pm",
      "content": "If something has a lot of horizontal direction, that doesn't make it type. Type is made of more than serifs. What are you talking about?\n\n"
    },
    {
      "time": "2 Dec 2006 — 3:34pm",
      "content": "\\>Some claim that the serifs help draw the reader’s eye across a line of text.  \nAbout this\n\n"
    }
  ]
}
