{
  "id": "29884",
  "title": "Woodtype sans",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hey people,\n\nI need some help identifying one of the woodtype faces I recently obtained. I’m in the process of organizing them, and printing specimen, either to trace or to use later on when I want to print something with it.\n\nAnyway, I have several typefaces, and traced only a couple of letters of one face, very quickly (of off hi-res photos of the woodtype itself) to post it here. When I have a proper print, I will scan it and post it, and the other faces too, when I have printed them.\n\nI only know the typefaces were bought from someone, I guess a printer, about 20 odd years ago, but the faces are obviously older than that. And I’m (and thus the faces too) situated in the Netherlands.\n\nHopefully there are some woodtype connaisseurs on this board.. ;)\n\n ![](http://web.archive.org/web/20080516050546im_/http:/www.typophile.com/files/woodtype_6672.jpg)\n\n [‹ (x) \"Imagine your possibilities\" delicate italic serif - Linotype Didot {Lari}](http://web.archive.org/web/20080516050546/http:/www.typophile.com/node/30191 \"Go to previous forum topic\") [(x) Morgan Stanley wordmark - custom designed (similar to Trade Gothic) {Jarrod Beglinger, (Marc O)} ›](http://web.archive.org/web/20080516050546/http:/www.typophile.com/node/30155 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080516050546/http://www.typophile.com/user/14604\" title=\"View user profile.\">Quincunx</a>",
  "time": "<br>",
  "uid": "14604",
  "comments": [
    {
      "time": " 1.Dec.2006 7.59pm",
      "content": "This reminds me of Heinz Hoffman stuff, especially [Block Extra Condensed](http://web.archive.org/web/20080516050546/http:/www.myfonts.com/fonts/berthold/block-be/extra-condensed/).\n\n- Lex\n\n"
    },
    {
      "time": " 1.Dec.2006 8.07pm",
      "content": "quick guess (a, e) Hermes Grotesque (Woellmer), Block Con (Berthold)\n\n"
    },
    {
      "time": " 2.Dec.2006 5.51am",
      "content": "Hey, those actually look very similar. Some characters look very much alike, others do not. I guess it’s not the same as Block and Hermes. But lots of thanks for the insight, since my face is probably from the same time, and maybe from germany too.\n\nMaybe someone has another suggestion? Although I do realise this is only a few characters, I will upload more asap.\n\n"
    },
    {
      "time": " 22.Dec.2006 11.10am",
      "content": "I’ve printed everything. And have an image of the whole alphabet.  \nMy itention was to digitize the typeface, mainly for myself as a first step into type-design, beziers/fontlab, etc.\n\nAnyone seen this face before, now there are more characters to see?\n\n ![](http://web.archive.org/web/20080516050546im_/http:/www.typophile.com/files/scans1vel_3693.jpg)\n\nI have another, smaller, version of this typeface in wood as well. All characters but the ’a’ are the same as this one, only a bit more extended, confirming the thought that the version I’m posting is condensed. Will scan that ’a’ as well when I have some more time.  \nI have not included the uppercase yet, I have to scan those first as well.\n\n"
    }
  ]
}
