{
  "id": "29890",
  "title": "Logo critique...",
  "forum": "Design",
  "tags": [

  ],
  "content": "I did some experimental moves and stuck… can’t go further.\n\nhelp guys and tell me what do you think of it so far.\n\nthanks!\n\n ![](http://web.archive.org/files/drugi-svijet_5880.jpg)\n\np.s it is for a rock, metal band, a gift for a friend :)\n\n",
  "author": "<a href=\"user/12816\" title=\"View user profile.\">garden</a>",
  "time": "<br>",
  "uid": "12816",
  "comments": [
    {
      "time": " 2 December, 2006 - 3:49pm",
      "content": "Just out of curiosity, may I ask you what the 2 words mean? I’ve been in Croatia many times and one of the words sounds familiar.  \nI like it when the 2 words join in more than one point (so the first is not my favourite) so that it looks like an image rather than 2 separate words (if it makes sense) but I leave it to the experts! oh, I also like the fact that it’s not very conventional for a metal band. I think.\n\n"
    },
    {
      "time": " 2 December, 2006 - 3:53pm",
      "content": "it is a more of a rock band than an metal ( for a paralelle, I listen electronic music :D :) . they wanted something out of boundryes…\n\nit says : drugi svijet = another world\n\n"
    },
    {
      "time": " 2 December, 2006 - 5:48pm",
      "content": "Hi Sandro. I guess this is much easier for native Croatian speakers to get their heads around. Please take what I say in the spirit of objective critique only:\n\nPersonally I have a problem with the loop of the ‘g’ doubling for the bowl of the ‘e’ on the lower line. In order to read the ‘g’ the ‘e’ has to become something else - so the arrangement compromises the readability of the second line anyway.\n\nWhy a lowercase ‘d’ to start the logo and an uppercase ‘S’ halfway through it? Does Croatian capitalise proper nouns?\n\nWhy the extended stroke of the finishing ‘t’? It doesn’t balance the ‘S’. The negative shape below the second line is awkward (it would be anyway with this letter combination, but…)\n\nThe dotless ‘i’ and ‘j’ in the second line appear to be dotless only because their baseline is with the ‘e’ (not enough vertical space). And the ‘e’ is only that high because you want it to be part of the ‘g’ above… this is maybe not a strong enough reason for compromising the ‘i’ and ‘j’ by removing their dots.\n\nAre they a ‘classical’ band? Why use a ‘classical’ type style?\n\nWhat aspect of the idea of ‘another world’ is being incorporated into the arrangement? Where is the design actually crossing boundaries?\n\nContrary to what Lore says above, I think it _should_ look like a rock band, in a conventional sense. There are many other ways to start exploring this name visually, so I advise you to return to the drawing board.\n\n"
    },
    {
      "time": " 2 December, 2006 - 6:04pm",
      "content": "You are probably right Ben, I’ve seen so many cliches (blackletter, satanic stuff etc.) recently that I thought Sandro’s approach was refreshing. I didn’t feel that the references to the name <cite>another world</cite> were necessary but Sandro: if I was you, I would listen to Ben!\n\n"
    },
    {
      "time": " 2 December, 2006 - 6:05pm",
      "content": "double post\n\n"
    },
    {
      "time": " 2 December, 2006 - 10:59pm",
      "content": "It’s very pleasing aesthetically, and I agree with Lore, it’s good that you’re doing a metal logo that doesn’t fall into the usual cliches, but I’m not sure that this is strong enough to attract attention on posters, CD covers, and t-shirts. If I was working on this I’d print it out on 11x17 in a couple colors, stick it up on a brick wall, and use that to decide if it’s really strong enough to do the job.\n\n"
    },
    {
      "time": " 3 December, 2006 - 2:57am",
      "content": "Uf where to start. Thank you all. Ben especially.  \njpad thanks for comments ( I like it aesthetically too :D :).\n\nLore thanks again for your comments ( I’ll do some more work, thank for your kindly comments).\n\nThey wanted it something more classical and yes they are more rock then metal band (they have only one metal song).\n\nThey wanted old classical look.\n\n**Do you have other type styles in mind** , and I also think that there are more problems with e and g, but everyone were able to read that so dunno, maybe it is wrong by the rules but they read it succesfully :D.\n\nAnd I just want it for T to be _different_ adding that “upper” extended stroke. I wanted capital S to balance with T. I failed…\n\nAnd at the end, I respect critiques so no problem Ben you helped me ( I had same thoughts, e and g and rest), btw any other another world ideas :D.\n\nI did something so check it out.(new logo applied on cd cover). Btw Ravens are element of logo:).\n\nAnd do you have any good suggestions for typewriter fonts styles?  \nThanks everybody\n\n ![](http://web.archive.org/files/drugi-svijet-novi_5598.jpg)\n\n"
    },
    {
      "time": " 3 December, 2006 - 3:19am",
      "content": "You are stuck because you’ve started at the wrong end. Get off the computer and sketch on paper. Since drawings are more flexible, you’ll find better ways of fitting the letters together. When you have a good composition, _then_ try to manipulate the type to match it.\n\n"
    },
    {
      "time": " 3 December, 2006 - 3:41am",
      "content": "What do you think of latest typesetting?\n\n"
    },
    {
      "time": " 3 December, 2006 - 2:17pm",
      "content": "Sandro it’s better than the first ones – I can actually read it, although that plant stem going into the second word compromises the ‘i’ and the ‘j’ of ‘Svijet’, and because it’s essentially an arbitrary element, why leave it (the plant stem) there?\n\nRavens huh? Are they ghost ravens? Is that why they’re outlined in white?\n\nClichés exist for a reason… including the cliché of so-called design educator suggesting that the essential communication issue in the composition is not being addressed, and that the design should be redrawn experimentally _by hand_ starting with a choice of coherent ideas as a basis. (So I think Kevin’s right about where you’re starting from – but then I do this sort of thing in my day job).\n\n"
    },
    {
      "time": " 4 December, 2006 - 6:05am",
      "content": "thanks. (i will reposition type again. This was randomly positioned on background).\n\nthanks again.\n\nand yes I drew the ravens by hand :D\n\n"
    },
    {
      "time": " 5 December, 2006 - 2:52am",
      "content": "I think the first ones better, the last one’s a bit too thin. also, it looks a bit dated with minuscles on cap height and vice versa, and the mixture of roman/cursive. A bit ten years old.\n\n"
    },
    {
      "time": " 5 December, 2006 - 6:25am",
      "content": "btw latest typeset is jeremy tankard’s disturbance.\n\n**Do you have any other types suggestions**\n\n"
    },
    {
      "time": " 5 December, 2006 - 7:46pm",
      "content": "garden-\n\ni don’t know how many variations you have tried, however, it looks like you’ve tried maybe 10 and are just stuck. don’t get caught up in the typeface selection.\n\nlike everyone’s said, try sketching a bunch of versions. sure, the computer is easier to manipulate but without a strong concept, your execution will fail.\n\nthere are lots of great typefaces out there. one of my new favorite foundries is [www.typetrust.com](http://web.archive.org/web/20070127053350/http:/www.typetrust.com/) you can find some great typefaces there that might fit what you are looking for.\n\ni would scratch your initial concepts due to the awkwardness and legibility issues. i am not opposed to the manipulation of the type, but if you’re going to do it, have purpose behind it and make it appear logical, even though it’s not. that’s the beauty of ligatures.\n\nbest of luck.\n\n"
    }
  ]
}
