{
  "id": "29892",
  "title": "Choosing a Pen",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I would like to learn how to letter by hand, the old fashioned way. I checked to see if there were any threads previously, and didn't have much luck with my search. My main question is what kind of pen I should choose. Things will start of real basic, and I would like to learn how to use both the broad nib and round hand styles. Any suggestions?\n\n",
  "author": "track and kern",
  "time": "2 Dec 2006 — 8:34pm",
  "uid": "11282",
  "comments": [
    {
      "time": "2 Dec 2006 — 9:54pm",
      "content": "Just buy a starter calligraphy set and enjoy the price break. You'll probably use all of the nibs eventually.\n\n"
    },
    {
      "time": "3 Dec 2006 — 5:06am",
      "content": "[http://www.blotspens.co.uk/acatalog/Calligraphy\\_Rotring\\_Art\\_Pens\\_22.html](http://web.archive.org/web/20150419143537/http:/www.blotspens.co.uk/acatalog/Calligraphy_Rotring_Art_Pens_22.html \"http://www.blotspens.co.uk/acatalog/Calligraphy\\_Rotring\\_Art\\_Pens\\_22.html\")\n\n[http://www.paperinkarts.com/en-us/dept\\_69.html](http://web.archive.org/web/20150419143537/http:/www.paperinkarts.com/en-us/dept_69.html \"http://www.paperinkarts.com/en-us/dept\\_69.html\")\n\nI wouldn't scrimp on the pen, it really can make a difference, however the best way to find one that is good for you is to try them –&nbsp;obviously expensive, my search led me to these two, Rotring sketch pens and Pilot parallel, I find they clog up less than any others and produce predictable consistent line widths, allowing one to concentrate on the lettering. On the other hand there is a lot to be said for the marks that dip pens and brushes make.\n\nTim\n\n"
    },
    {
      "time": "3 Dec 2006 — 5:25am",
      "content": "When I started learning calligraphy, my teachers made us buy German-made Brause broad-nib pens : we were told that they were stiffer than other brands, therefore they were easier to handle for beginners, since they move slower onto the paper. We used coarse papers for the same reason : to slow down our not-so-assured hand moves in order to control them better.\n\n"
    },
    {
      "time": "3 Dec 2006 — 10:27am",
      "content": "My calligraphy teacher instructed us to get a nib holder, some loose nibs and ink. We fed the nibs from the ink bottles and then wrote. Messy, for sure, but those nibs last for ever.\n\nBit like these dip pen nibs\n\n[http://www.calligraphy.co.uk/about\\_1.php](http://web.archive.org/web/20150419143537/http:/www.calligraphy.co.uk/about_1.php \"http://www.calligraphy.co.uk/about\\_1.php\")\n\n"
    },
    {
      "time": "3 Dec 2006 — 1:25pm",
      "content": "I'd contact nibmeister extraordinaire Richard Binder, he sells pens and you wont get a bad pen from him. Personally I like Pelikans.\n\n\"If the nib’s no good, it doesn’t matter how fancy the rest of the pen is — it’s not a good pen. Unless otherwise requested at the time of sale, I fill-test each new pen at no extra charge before shipment, adjusting as necessary to bring it up to my standards for smoothness and flow.\"\n\n[http://www.richardspens.com](http://web.archive.org/web/20150419143537/http:/www.richardspens.com/ \"http://www.richardspens.com\")\n\n"
    },
    {
      "time": "3 Dec 2006 — 3:09pm",
      "content": "Thanks for all the advice. There is a local shop here that literally has thousands of pens, so I might go in and try a few out, just to see how they feel in my hand. Generally, I like a heavier pen, something that makes me feel like I have something in my hand, and a nib which doesn't make it feel as though I am cutting into the paper. These are the problems I have often had with pens I have used in the past, but this could be due to poor technique, rather then poor equipment as well.\n\n"
    },
    {
      "time": "3 Dec 2006 — 9:39pm",
      "content": "If you would really like to learn the old-fashioned way, you certainly can't go wrong with some Brause or HB (Heintze & Blankertz if I am remembering the spelling) dip pens and a holder from someone like Koh-i-noor. Fit yourself out with a range from 3/4 mm up to 2mm or even 5mm and go to town. These pens work really well with ink, and you can also feed gouache into them by touching the tip of a loaded brush to the edge of the reservoir. In my experience, they are in a completely different class from the Speedball nibs sold widely in the U.S. (I forgot to look to see where you are located.)\n\nUse these nibs with some quadrille paper and you can have a great time. The quadrille paper saves the tedium of ruling guidelines and if you can find some ruled in metric, so much the better.\n\nThen pick up a nice used fountain pen with an edged nib, as long as it flows well. I struggled for years trying to get Platignum pens to work smoothly and flow-ily and never succeeded, but there are other (more expensive) brands that work very nicely. I had a Pelikan at one point with an edged nib that was pretty nice. You're right, though, about that feeling of the nib cutting into the paper. For this reason, i just use a fountain pen with a round nib and leave the edged-pen stuff to dip pens.\n\nIf you find a decent fountain pen you can carry around it in your pocket as you move through the world, and have the pleasure of making letters with it, but at home you have the ideal setup with your Brause nibs and some good black ink. Oh, and don't use India ink -- use good quality fountain pen ink (India almost always too thick!)\n\nIf you haven't picked on up already, a good book is a big plus. I recommend Edward Johnston's \"Writing and Illuminating and Lettering\" and Friedrich Neugebauer's \"The Mystic Art of Written Forms.\" I think Johnston is perpetually in print; Neugebauer is not in print but can be found used. (Important disclosure: I translated Friedrich's book from German into English back in 1980. Hope no one feels it is inappropriate for me to plug the book here -- my own involvement aside, I still feel it is the best calligraphy text ever written.)\n\nhth,\n\nBruce\n\n"
    },
    {
      "time": "4 Dec 2006 — 7:53am",
      "content": "[Your Favorite Disposable Pen?](http://web.archive.org/web/20150419143537/http:/typophile.com/node/28714)  \n [Weapon of Choice](http://web.archive.org/web/20150419143537/http:/typophile.com/node/4773)\n\n"
    }
  ]
}
