{
  "id": "29895",
  "title": "(x) clean sans serif - Berthold Akzidenz-Grotesk {Stephen}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "I would like to know what it is so I can use it for my resume.\n\nCan someone help me?\n\n| Attachment | Size |\n| --- | --- |\n| [bodytext.jpg](http://web.archive.org/web/20131020192422/http:/typophile.com/files/bodytext.jpg) | 12.59 KB |\n\n",
  "author": "newbie_chez",
  "time": "3 Dec 2006 — 1:56pm",
  "uid": "1477",
  "comments": [
    {
      "time": "3 Dec 2006 — 1:58pm",
      "content": "[Akzidenz Grotesk](http://web.archive.org/web/20131020192422/http:/www.myfonts.com/fonts/berthold/akzidenz-grotesk-bq/?refby=typographica) with improper apostrophes. Unless you're sending your resume to Berthold, you could get by with Helvetica instead.\n\n"
    },
    {
      "time": "3 Dec 2006 — 2:10pm",
      "content": "Thank you so much!\n\nOn the subject of Resumes, if you happen to know any examples of nice resume layouts, please let me know.\n\n"
    },
    {
      "time": "4 Dec 2006 — 2:17am",
      "content": "You're supposed to be a designer - create one yourself!\n\nNick Cooke\n\n"
    },
    {
      "time": "4 Dec 2006 — 9:22am",
      "content": "Are you telling me that as a designer you are too good to look for inspiration?\n\n"
    },
    {
      "time": "4 Dec 2006 — 9:38am",
      "content": "Nick! Come now.\n\n"
    },
    {
      "time": "5 Dec 2006 — 5:35am",
      "content": "Hell, I even design the typefaces to be used on my resume Cheryl! That's how good I am!\n\nBut seriously, I must admit I was pretty clueless for many years after I had left college, and it's only now that I'm no spring chicken any longer that I feel I know what I'm doing.\n\nYou should see some of the crap I churned out when working on Prima magazine (yes! knitting patterns, bake your own advent scene, etc – that Prima) Or maybe not.\n\nThe above comment was just a slight dig at people who use Typophile as a resource for 'I can't be bothered thinking of anything – I'll let some other sucker do it for me, and just copy what they do'.\n\nSorry if you were offended. It's not bad to seek inspiartion. Plagiarism is the bad thing.\n\nNick Cooke\n\n"
    }
  ]
}
