{
  "id": "29896",
  "title": "(x) Looking for the font Tuc Tuc - Cuca (T-26) {Hrant}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "What is it, and where is it available?\n\n ![](http://web.archive.org/files/tuctuc-4_4960.gif)\n\nSeen on:  \nhttp://www.petitcomite.net/index.php?/disseny/entry/tuctuc-typeface-tipo  \nBut I don’t speak the language of this site.\n\nMany thanks.\n\n",
  "author": "<a href=\"user/8202\" title=\"View user profile.\">spirelli</a>",
  "time": "<br>",
  "uid": "8202",
  "comments": [
    {
      "time": " 3 December, 2006 - 5:13pm",
      "content": "That’s strange - yesterday I got the monthly T26 email about new fonts,  \nand there’s one in there called Cuca that looks exactly like this one…\n\nhhp\n\n"
    },
    {
      "time": " 3 December, 2006 - 6:32pm",
      "content": "A deduction: [Tipos Reunidos](http://web.archive.org/web/20070127052946/http:/www.t26.com/fonts/browsebydesigner2.php?u_id=18095) is a new studio based in Spain. They have released a version of Tuc Tuc as [Cuca](http://web.archive.org/web/20070127052946/http:/www.t26.com/fonts/display.php?f_id=964) through T26.\n\n"
    },
    {
      "time": " 3 December, 2006 - 6:48pm",
      "content": "Man, I’m not sure what language that site’s in. Seems to SpanItaliaguese — some hybrid romance language that’s developed in a remote corner of the iberian peninsula.\n\nAnyway, the part that’s in Spanish says this is an exclusive font for the Tuc-Tuc company.\n\n"
    },
    {
      "time": " 3 December, 2006 - 6:59pm",
      "content": "Using [YubNub’s](http://web.archive.org/web/20070127052946/http:/yubnub.org/) guess command suggests that the “Spanitaliaguese” is Catalan. Sounds right to me. I’m no help on the actual font problem, I’m afraid.\n\n"
    },
    {
      "time": " 3 December, 2006 - 8:25pm",
      "content": "Catalan is indeed sort of funny - but it’s certainly not from a “remote  \ncorner” - it’s the language of the richest (in many ways) region of Spain  \nand arguably of the design capital of the world, Barcelona.\n\nStephen, the thing is that on Spirelli’s link it says TucTuc was an “exclusive”  \ndesign… If this is legit, either TucTuc was never actually picked up and/or paid  \nfor (happens a lot, even to people like Unger), or the exclusivity has expired.\n\nhhp\n\n"
    },
    {
      "time": " 3 December, 2006 - 8:36pm",
      "content": "I presume the exclusivity expired. Looks like it’s been about a year.\n\n"
    },
    {
      "time": " 4 December, 2006 - 2:48am",
      "content": "Hm, right. Great to have the light in Cuca, but shame that the Bold is not as black as in Tuc Tuc.\n\n"
    },
    {
      "time": " 4 December, 2006 - 10:40am",
      "content": "[Oz](http://web.archive.org/web/20070127052946/http:/vllg.com/Thirstype/Oz/mudTyper+Weights/) is a much better option in this realm anyway.\n\n"
    }
  ]
}
