{
  "id": "29903",
  "title": "What are the most popular fonts in your country?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "or city or state or street or region?\n\n",
  "author": "alexfjelldal",
  "time": "4 Dec 2006 — 12:07am",
  "uid": "5430",
  "comments": [
    {
      "time": "4 Dec 2006 — 12:49am",
      "content": "[Mambo Italiano del mondo](http://web.archive.org/web/20150401015145/http:/flickr.com/groups/comicsans/)\n\n"
    },
    {
      "time": "4 Dec 2006 — 2:00am",
      "content": "And what would you say is the most popular font in Norway at the moment?\n\n"
    },
    {
      "time": "4 Dec 2006 — 2:07am",
      "content": "in belgium: DIN & Rotis :-)\n\n"
    },
    {
      "time": "4 Dec 2006 — 2:45am",
      "content": "south-west germany\n\nHelvetica Neue, Meta, Frutiger, Rotis (hehe, the local traffic uses it in my city), FF Din (and Din 1451 \"unsere Autobahnschrift\"), i forgot TheSans\n\n"
    },
    {
      "time": "4 Dec 2006 — 2:51am",
      "content": "In Norway, theres a surge of [Klavika](http://web.archive.org/web/20150401015145/http:/www.processtypefoundry.com/typefaces/klavika/index.html) at the moment. I must admit having jumped the bandwagon.\n\ncouple of years ago, [Foundry Monoline](http://web.archive.org/web/20150401015145/http:/www.foundrytypes.co.uk/foundry_monoline/monoline.html) was quite popular.\n\nI think we managed to get rid of the rotis plague by now.\n\n"
    },
    {
      "time": "4 Dec 2006 — 3:12am",
      "content": "\"the rotis plague\"\n\n:-)\n\n"
    },
    {
      "time": "4 Dec 2006 — 5:49am",
      "content": "I fear it is still Times New Roman.\n\nChrisL\n\n"
    },
    {
      "time": "4 Dec 2006 — 6:31am",
      "content": "ok, i'll refine my question: What are the most popular fonts in your country, apart from windows system fonts?\n\n"
    },
    {
      "time": "4 Dec 2006 — 8:24am",
      "content": "Amongst designers in NYC (and presumably America), it seems to be Gotham. A lovely typeface to be sure, but fast becoming over prescribed for every design task.\n\nOtherwise, the mainstays are Helvetica, Adobe Garamond, and Times New Roman. The US government's official typographic standard requires that all official documents be in Times New Roman at 14 points. This was changed over from 12pt Courier New. No word on how this should all be line spaced.\n\nI personally use a lot of Adobe Garamond, Din, FF Bau, Today Sans, Thesis, and Scala.\n\n"
    },
    {
      "time": "4 Dec 2006 — 8:48am",
      "content": "Apart from the usual suspects (Meta, Thesis, Interstate) Scala Sans is all over the place in The Netherlands…\n\nAnd lately Gerard Unger has been gaining ground; one of our main papers (‘de Volkskrant’)started using Capitolium News last saturday, as part of a major overhaul (no images online, sorry).\n\n[http://www.gerardunger.com/allmytypedesigns/allmytypedesigns22.html](http://web.archive.org/web/20150401015145/http:/www.gerardunger.com/allmytypedesigns/allmytypedesigns22.html \"http://www.gerardunger.com/allmytypedesigns/allmytypedesigns22.html\")\n\n"
    },
    {
      "time": "4 Dec 2006 — 9:19am",
      "content": "Norway:\n\nApex Sans/New  \nNeo Sans  \nFF DIN\n\nare our top three sellers at the moment... (in addition to Frutiger & Helvetica ;-)  \nFor the full picture:  \n [http://www.bildesalg.no/fontdatabase/fontprisliste-topp20.htm](http://web.archive.org/web/20150401015145/http:/www.bildesalg.no/fontdatabase/fontprisliste-topp20.htm \"http://www.bildesalg.no/fontdatabase/fontprisliste-topp20.htm\")\n\nJacob\n\n"
    },
    {
      "time": "4 Dec 2006 — 10:38am",
      "content": "Comic Sans without a doubt. And worldwide too.\n\nhhp\n\n"
    },
    {
      "time": "4 Dec 2006 — 10:54am",
      "content": "I've talked on and off through the years with a guy that publishes a monthly email newsletter gathering the arts and cultural happenings in the neighborhood, rubbing shoulders and elbows at various cocktail functions, and every time he's expresed interest in my evaluation of his documents. And everytime I tell him, Not until you stop using Comic Sans will I begin a serious dialogue with you. I guess I should also talk to him about color. Grape colored Comic Sans to announce that Phillip Glass will be in town. Fun.\n\n"
    },
    {
      "time": "4 Dec 2006 — 11:09am",
      "content": "Dezcom, do you think Times is in such an overabundance because of the sad state of the aesthetic of half of the country, or because there's a lack of proper education? It's a sad thing, I preflighted a Prentic Hall book on desktop publishing a few weeks ago, and it recommended Times as a book font!\n\nIn my opinion, the most popular font is dependant of the medium. The TV/Movie industry doesn't make use of Times as much, but boy they love their Trajan. Drop by any movie rental place, and you could create a large section of the place with DVDs with some deviation of Trajan used for the titling font. My girlfriend is even sick of it, and she has no design/typography background whatsoever.\n\n"
    },
    {
      "time": "4 Dec 2006 — 11:44am",
      "content": "Yes, Trajan is quite prevalent in movie poster design. I am also tired, tired to death actually, of seeing those designers f\\*ck around with a capital R, namely by extending the leg.\n\n"
    },
    {
      "time": "4 Dec 2006 — 11:56am",
      "content": "In the U.S. lately, I'm seeing lots of Helvetica Neue, Meta, Frutiger, and Avenir.\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "4 Dec 2006 — 11:57am",
      "content": "Casey,  \nI think Times is so popular because it has been bundled with every Mac and Windows machine since the 80s and is the default face for MS Word (and numerous other non-decision reasons). Most people don't pay much attention to typefaces. They just go with the default.  \nTrajan might have started out as a correct choice for some Roman era spectacular film which ended up with big box office. Later, producers trying to promote their film as having \"Big Boxoffice\" wanted to use Trajan to give it that look of success. Even if the film had nothing to do with Ancient Rome and made no sense, it was a \"me too\" kinda thing. I can see \"The Robe\", Spartacus\", and the like, using Trajan but now it is down right silly to see it on anything and everything coming out of Hollywood. Times and Trajan are good typefaces but just because you own a nice tuxedo doesn't mean you wear it to wash your car. :-)\n\nChrisL\n\n"
    },
    {
      "time": "4 Dec 2006 — 12:09pm",
      "content": "I'd wear a tuxedo and instruct someone else to wash my car.\n\nI think I may have commented earlier in another post somewhere else here, but I've worked at a studio that exclusively did movie posters and advertisement for the entertainment industry. Trajan comes out whenever they want a Oscar/Acaemy Award feel. In fact that is exactly what they tell the movie execs.\n\n"
    },
    {
      "time": "4 Dec 2006 — 12:31pm",
      "content": "\"Trajan comes out whenever they want a Oscar/Acaemy Award feel.\"\n\nAfter a million uses, it doesn't work any more. Maybe the movie moguls still see \"Oscar\" but most people see nothing anymore. They may even see \"same old phoney crap\". I guess today's Hollywood producers are consistant at least, instead of coming up with new movies, they just go back and remake old successful ones. That may be why the independent films are so much better that the old studios, they actually try to make new films instead of resurecting old ones (and they are not run by committees of micromanagers). They are the same with type--just go back and use what succeeded 30 years ago.  \nChrisL\n\n"
    },
    {
      "time": "4 Dec 2006 — 12:37pm",
      "content": "Why make anything good when the bad stuff sells better?  \nDon't just blame Hollywood - look deeper.\n\nhhp\n\n"
    },
    {
      "time": "4 Dec 2006 — 12:46pm",
      "content": "A very Learning From Las Vegas comment, to be sure.\n\n"
    },
    {
      "time": "4 Dec 2006 — 1:57pm",
      "content": "It turned out great, didn't it?\n\nI'd add normal Scala to that list, and I've seen a lot of Janson in books lately.\n\n"
    },
    {
      "time": "4 Dec 2006 — 3:30pm",
      "content": "Papyrus is still too popular here in the USA. Zapfino seems to be enjoying a resurgence, mostly on rap and R&B album covers, as well as in a lot of low-end advertising, I think a lot of people are enjoying playing with OT Zapfino Extra. Helvetica is still popular, but oddly, I see Arial being used in a lot of places where I would expect to see Helvetica lately, perhaps it's just not taboo anymore. Fette Fraktur is everywhere. AG Rounded, VAG rounded, and Helvetica rounded are making slow, steady gains in popularity.\n\n"
    },
    {
      "time": "4 Dec 2006 — 3:33pm",
      "content": "Chris, I have to agree with you on that. I wonder how many desktop users really have a preference of what typeface they're using anyway. Hopefully Vista will have an influence on the amount of exposure for Times. I have to admit, when I started out in computer engineering I can't say I was going out of my way to choose a typeface in MS Word. If I had stayed that course, I don't suppose things would have changed. Maybe the typical high school spec sheet (12 pt. Times New Roman or points deducted) had some influence on that..\n\n"
    },
    {
      "time": "4 Dec 2006 — 7:16pm",
      "content": "\"And there's hamburger all over the highway in Mystic Connecticut.\"\n\n"
    },
    {
      "time": "4 Dec 2006 — 7:27pm",
      "content": "Australia? Seems to be Helvetica neue, meta and over the last two or so years the geometric DIN-like fonts, for a while you saw a bit of clarendon or similar (take our Government's [new work 'choices'](http://web.archive.org/web/20150401015145/https:/www.workchoices.gov.au/) legislation for eg) and also lately I've noticed a lot of slabby serifed fonts used in magazine layout. Any Aussies, correct me if I'm wrong\n\n--N\n\n"
    },
    {
      "time": "4 Dec 2006 — 8:12pm",
      "content": "Our local government (Calgary, AB Canada) uses Optima in the logo and many other places -- almost, unfortunately, to the point of oversaturation (personally I love Optima, but I'm starting to use it less and less because of this). The University of Calgary does as well....\n\nLately, I've been seeing a fair bit of Eras (another of my faves) in different places as well, and Futura (because it is one of the house fonts at the client I'm currently doing an in-house job for, but in other applications as well).\n\nI recently redesigned my business cards and cranked out a new logo -- the old one was in Papyrus (yes, I know), but the new one uses American Uncial in the logo and Albertus as the text font. Seems to be different enough to garner positive attention but not strange enough to weird folks out.\n\n"
    },
    {
      "time": "4 Dec 2006 — 8:47pm",
      "content": "Linda, it sounds like your local government is actually  \ndoing something for you... nurturing an aversion to Optima!\n\nhhp\n\n"
    },
    {
      "time": "5 Dec 2006 — 12:35am",
      "content": "Hi Alex\n\nMost popular with these thrifty people would be _any of the fonts that come free with the computer..._\n\nA colleague recently noted that they'd seen a lot of Gill Sans here in New Zealand; I replied that it now is in the 'bundled' category above, but the local University uses it (paired with Bodoni).\n\nThomas said _Rotis (hehe, the local traffic uses it in my city)_ – this is also true of Auckland City Council, who use it for a lot of municipal signage. NZ Telecom adopted Bliss a couple of years ago, and maybe set a small trend for it. Although one of the local freight companies uses Comic Sans on all of their big trucks, I don't see it so much anymore. The place where I work has just given up a 15-year relationship with Optima. Historically I always thought that both Australia and New Zealand favoured Goudy as a general-purpose jobbing face.\n\n"
    },
    {
      "time": "5 Dec 2006 — 8:45am",
      "content": "Latest movie sequel:\n\n ![](http://web.archive.org/web/20150401015145im_/http:/typophile.com/files/gandalf_Chris_3951.jpg)\n\n"
    },
    {
      "time": "5 Dec 2006 — 9:32am",
      "content": "On Rotis:  \n [http://www.manic.com.sg/blog/archives/000194.php](http://web.archive.org/web/20150401015145/http:/www.manic.com.sg/blog/archives/000194.php \"http://www.manic.com.sg/blog/archives/000194.php\")\n\nhhp\n\n"
    },
    {
      "time": "5 Dec 2006 — 9:41am",
      "content": "ROFL, Chris. Lemme guess: the theme music sounds a lot like \"Jaws\".... ;-)\n\n"
    },
    {
      "time": "5 Dec 2006 — 11:01am",
      "content": "I'm surprised to hear Rotis is used on signage. While I think its a nice typeface, I think it is a terrible typeface to use for signage. Its too high-contrast has too many features, and is so delicate (at least to me) in structure that I think it should only be used at smaller point sizes.\n\n"
    },
    {
      "time": "5 Dec 2006 — 11:05am",
      "content": "They can't mean street signs, I think they must mean something not in the way-finding category Terry--at least I hope so.\n\nChrisL\n\n"
    },
    {
      "time": "5 Dec 2006 — 11:07am",
      "content": "Check out Hrant's link, Chris.\n\n"
    },
    {
      "time": "5 Dec 2006 — 11:11am",
      "content": "Yikes, I stand corrected. Looks like they were shagging sheep there too;-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Dec 2006 — 11:11am",
      "content": "\\> Its too high-contrast\n\nWell the \"Sans\" set has no (or very low) contrast.\n\nBut yeah, I wouldn't use Rotis for street signs myself. Then again  \nI wouldn't use pretty much any of the other stuff people use either.\n\nhhp\n\n"
    },
    {
      "time": "5 Dec 2006 — 12:23pm",
      "content": "_re: Rotis signs_\n\nEeeew! People were actually paid for this? Real money? Damn, I'm in the wrong business....\n\n"
    },
    {
      "time": "5 Dec 2006 — 12:35pm",
      "content": "Those signs are pretty damn ugly.\n\nI have yet to find a project for Rotis. I've proposed it a couple times, and I actually want to use it in something. Almost like my quest to use a Didot...\n\n"
    },
    {
      "time": "5 Dec 2006 — 12:41pm",
      "content": "Give Vogue a call James :-)\n\nChrisL\n\n"
    },
    {
      "time": "5 Dec 2006 — 12:48pm",
      "content": "Chris, I am doneth with strutting my stuff with fashion advertising for the most part, and I don't think I would like an editorial project anytime soon. But thank you for the suggestion. :-)\n\n"
    },
    {
      "time": "5 Dec 2006 — 10:58pm",
      "content": "Haha! I had no idea about this thread. You guys should really visit! There's nothing like living and breathing these live-sized signs, getting lost, getting into accidents, and getting divorced\\* because of them.\n\n\\* Assuming the conventional arrangement of one spouse driving and the other navigating.\n\n"
    },
    {
      "time": "5 Dec 2006 — 11:59pm",
      "content": "oh, and Neutra(face) is all over the place. The charm of the lowered middle stroke of 'E' is sloooowly wearing off.\n\n"
    },
    {
      "time": "6 Dec 2006 — 2:47am",
      "content": "Czech Republic: Arial & Times New Roman. Everywhere. Time tables, road signs, logotypes, billboards, business cards, subway signs, books... And, of course, Comic Sans is as well very popular. The typographic environment in the Czech Republic is extremely poor. Czechs don't have sense for type:\n\n ![](http://web.archive.org/web/20150401015145im_/http:/typophile.com/files/DSCF0003_5834.jpg)\n\nBut if you look at stuff designed by professionals, Storm's and Brousil's typefaces are to be seen everywhere in Prague - from posters to books. This support of local type designers among Czech graphic design industry is an interesting phenomenon. There are obvious roots in the last years: Brousil and Storm both offers relatively cheap font packages and all of their typefaces support Central European languages. I used Brousil's _Atrament_ to design this Juggling poster:\n\n ![](http://web.archive.org/web/20150401015145im_/http:/typophile.com/files/DSC_0147b_6230.jpg)\n\n"
    },
    {
      "time": "6 Dec 2006 — 3:50am",
      "content": "I was in krakow, poland, this summer, and i noticed that they have a quite different taste for \"stock\" typography than us in norway. A lot of the cheap, \"non-professional\" signs and posters were made with jugend-style typefaces instead of bauhaus, arial etc.\n\n"
    },
    {
      "time": "6 Dec 2006 — 5:18am",
      "content": "Arial & Times? Say it isn't so Filip! I always had visions of beautiful typography all over the Czech Republic with its great history.  \nI am glad that at least the professional designers there are holding up their end of quality work.\n\nChrisL\n\n"
    },
    {
      "time": "6 Dec 2006 — 7:31am",
      "content": "Chris, take a look at this little beauty from Prague; I think it's trying to be University Roman, but can't be sure.\n\n ![](http://web.archive.org/web/20150401015145im_/http:/typophile.com/files/Cafe_6165.jpg)\n\nThis is better, though not exactly current.\n\n ![](http://web.archive.org/web/20150401015145im_/http:/typophile.com/files/Topic_3418.jpg)\n\nNick Cooke\n\n"
    },
    {
      "time": "7 Dec 2006 — 6:14am",
      "content": "Here it's Times New Roman and Arial.\n\n"
    },
    {
      "time": "7 Dec 2006 — 6:34am",
      "content": "Thanks Nick! I like the stained glass with the rest of the building.\n\nChrisL\n\n"
    },
    {
      "time": "7 Dec 2006 — 12:12pm",
      "content": "I was heading over to a meeting this morning and at one intersection, three of the four corners had signs in Benguiat. Talk about over-saturation!\n\n"
    }
  ]
}
