{
  "id": "2991",
  "title": "Type Design Strategies for a Beginner",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi Everybody,   \n   \nA little background before my questions...   \n   \n-------   \n   \nI am just starting down the path of type design. I am a graphic designer, but I've never taken any type design classes (nor can I seem to find any in the boston area).   \n   \nRight now I am at the point where I am reading an abundance of typography books (not too many just on face design out there), and trying to study and understand the history and relationships between different styles and movements. When I walk down the street, I don't even read any more -I just look at typefaces in signs and on newspapers, etc.   \n   \nI have made several attempts to design individual letters, but this has been pretty unsatisfying. I usually attempt one or two letters, and really am not pleased with what I am producing. I've tried handwriting forms, and using Illustrator. (I used to think I was pretty handy with the bezier curves - not any more).   \n   \nIt appears there are some very experienced type designers on these boards (apologies if that not your preferred nomenclature). I even see a lot of \"first time\" designs, and that is even more frustrating, because they have so many great details and ideas that feel out of reach. I feel like I can't even create adequate stem weight for the letter \"A\", much less create a whole typeface.   \n   \n-------   \n   \nOn to the questions...   \n   \nCould some of you suggest some strategies for trying to organize a truly first time attempt at creating an alphabet? Is handrawing the way to go? Playing with existing typefaces? Some kind of master chart for proportions? Picking apart the anatomy of serifs, bowls, ears, terminals, etc?   \n   \nI just don't know where to go from my current position (the very beginning).   \n   \nI'm definitely a neophyte, and any approaches or steps for creating some kind of structure to my effort would really be appreciated. Even a homework assignment or two would help.   \n   \nThanks very much,   \n   \nbgh\n\n",
  "author": "molaram",
  "time": "5 Feb 2004 — 9:21am",
  "uid": "2909",
  "comments": [
    {
      "time": "5 Feb 2004 — 9:37am",
      "content": "\\> I don't even read any more   \n   \nThen you're in! :-)   \n   \nBut don't start from individual glyphs and try to form a font, go the other way: develop a feeling (or if you have to, Rules) for the whole\\* and then try to figure out what the individual glyphs need to be - because a font (especially a text font) is only its parts out of necessity, not as a goal. On the other hand, it's also very common (I do it a lot) to start with some actual glyphs out of the blue (since their tangibility makes them so attractive), and get the feeling/rules from there, but only if you leave open the possibility (even probability) of changing or even dumping those initial seeds.   \n   \n\\* And absobing history and existing designs like you're doing is a great catalyst.   \n   \nHandwriting (or \"chirography\", in the realm of type) is a good start only if you want a quick and easy way of producing something mainstream. The best source is what's inside you as a person, not any physical tool.   \n   \nOne \"precedent\" you should definitely mind though is what readers expect. Don't let it be a straightjacket, but do factor it in, like when you decide what stems need to be thick and which ones thin - precedent will often dispell much of the arbitrariness in design.   \n   \nAnd don't push inspiration. When it comes naturally it will all just fall into place.   \n   \n\\> homework   \n   \nYou're in luck!   \n [http://typophile.com/articles/](http://web.archive.org/web/20131017143412/http:/typophile.com/articles/)   \n(Bottom-Right)   \n   \nhhp\n\n"
    },
    {
      "time": "5 Feb 2004 — 2:08pm",
      "content": "Brant, I've made one real attempt at designing a text face and I know _exactly_ how you feel. I made it through the LC and UC alphabet and had some experiences that may help you go further.   \n   \n1) Get a chisel-tip pen and some ink and a 'basic calligraphy' book. Start to write the alphabet, but also play around with the line quality and curves. If you're holding the pen at the proper angle, using the recommended strokes, and controlling proportions, a lot of the characters will start to seem intuitive (this requires a lot of repition, but as a scrutinizer of type, you have a leg up on the rest of the world). Now, I realize that this is a stylistically limited exercise, but it really helped me to see the glyphs for what they are. Using a tool that can modulate stroke-width on the fly is very illuminating.   \n   \n2) Trace the skeletons of some fonts. Don't focus on stroke-width or fillets of serifs, just draw the monoline structure of the characters. You'll start to see the commonalities and differences in periods and styles. I'm sure there's a book that can give you the 'accepted method' for determining this underlying structure. I would print out big ol' 12 pica alphabets (UC & LC) and lay tracing paper over them to do this.   \n   \nI'm not sure if either of these are Official Type Designing Methods, but they helped illuminate many of the subtlties of type and letters for me. I recommend avoiding beziers and the computer for learing to draw these forms. For me, I do my best bezier manipulating when it's over a strong drawing I've scanned in.\n\n"
    },
    {
      "time": "6 Feb 2004 — 8:14am",
      "content": "Brant,   \n   \nOne big thing that helped me understand letterforms was simply copying from specimen books. I'd take a pencil and paper and draw a complete alphabet -- Caslon, for instance. This made me pay attention to details that I normally wouldn't see. If my \"a\" didn't look like the specimen \"a\", I would study it further to understand why. This also helps you understand relationships among letterforms when you draw them together, all the same size, on one page.   \n   \nGet as many specimens as you can, and not just old ones. Some foundries will mail a free specimen of their types and others have PDF specimens you can download.   \n   \n [The Hoefler Foundry](http://web.archive.org/web/20131017143412/http:/www.typography.com/catalog/mailing_list.html)   \n   \n [The Enchede Font Foundry](http://web.archive.org/web/20131017143412/http:/www.teff.nl/fonts/samplesheets.html)   \n   \n [Storm Type Foundry](http://web.archive.org/web/20131017143412/http:/www.stormtype.com/free.html) (PDFs on the left)   \n   \n [Terminal Design](http://web.archive.org/web/20131017143412/http:/www.terminaldesign.com/retail_specimen.php?ID=1191&viewFam=1) (Each font has a PDF specimen)   \n   \n [Fountain Type](http://web.archive.org/web/20131017143412/http:/www.fountain.nu/catalogue/catalogue_index.asp) (Some have PDF specimens)   \n   \n [PsyOps](http://web.archive.org/web/20131017143412/http:/www.psyops.com/html/specimens.html) (The bottom of each showing has a PDF specimen)   \n   \nAnyway, I'm sure you're aware of all the online type foundries.   \n   \nHrant and Chris offer good advice as well -- I decided to draw letters because my writing sucks. Drawing letters digitally is a whole new ballgame, and I'm still struggling with that.   \n   \nThe Typophile courses Hrant pointed out are great, too. They're done by the great Mr. Hoefler.   \n   \nGood luck,   \nAddison\n\n"
    }
  ]
}
