{
  "id": "29928",
  "title": "Ascender Corporation News",
  "forum": "Home",
  "tags": [

  ],
  "content": "Submitted by [Miss Tiffany](http://web.archive.org/web/20120203184619/http:/typophile.com/user/108 \"View user profile.\") : 5.Dec.2006 12.52pm \n\n--\n\n**Ascender Personality Kit introduced for Windows Mobile 5.0 devices**\n\nELK GROVE VILLAGE, IL - December 5, 2006 - Ascender Corporation, a leading provider of fonts for hardware & software developers, today announced a new software product for Windows™ Mobile 5.0 devices that lets users change how their Smartphone looks and sounds. The Ascender® Personality Kit™ is the first product to combine ringtones, themes, background images and fonts in matched sets with software that lets users select and apply them to their mobile device.\n\n ![](http://web.archive.org/web/20120203184619im_/http:/typophile.com/files/ascenderbefore_6179.gif)\n  \nBEFORE: the default screen\n\n ![](http://web.archive.org/web/20120203184619im_/http:/typophile.com/files/ascenderafter_3528.gif)\n  \nAFTER: with a new personality!\n\nThe software runs on a Windows PC, and includes over 50 pre-defined sets of \"personalities\", ranging from animals and holidays to places and sports. Ascender developed its collection of ringtones and background images by working with a variety of artists, designers and licensed content sources. The software is the first Windows Mobile 5.0 software application that modifies the user interface fonts – each of Ascender's fonts were tuned for ClearType™ for the best quality display on screen.\n\n\"We designed the software to appeal to both novice users and road warriors who want to improve the user interface display and ringtone sounds, making their smartphone more personal, entertaining and attention-getting\" said Bill Davis, Vice President of Ascender Corporation responsible for new product development. \"There are options for users who want to personalize their phone, but none are as comprehensive, easy to use and impressive as our Personality Kit.\"\n\nThe Ascender Personality Kit software makes it easy to preview, select and install a new personality onto a phone. Each personality is pre-defined with a matching set of components that controls how a device looks and sounds: backgrounds, fonts, ringtones, and the colors of windows, controls, scrollbars, menus and dialogs. The user simply selects a category, then a personality, then applies it to the device. The software connects to the Smartphone via ActiveSync or Windows Mobile Device Center. At any time the user can change personalities or roll back to the original phone settings.\n\nThe software is available in three versions to support the three Windows Mobile 5.0 devices on the market today:\n\nPocket PC Phone  \nSmartphone with Portrait (240x320) display (Cingular 2125 & 3125, T-Mobile SDA, etc.)  \nSmartphone with Landscape (320x240) display (Cingular Blackjack, Motorola Q, T-Mobile Dash, etc.)  \nThe software retails for $19.99 and is available immediately as a software download from the Ascender website ( [http://www.ascendercorp.com/personalitykit.html](http://web.archive.org/web/20120203184619/http:/www.ascendercorp.com/personalitykit.html \"http://www.ascendercorp.com/personalitykit.html\")) and other Smartphone online resellers including Handango.com, pocketgear.com and smartphone.net. The software is a 23mb download file, which can take 5 minutes at 640Kbps or 2 minutes at 1.5Mbps to download.\n\nThe Ascender Smartphone Personality Kit requires a Windows Mobile 5.0 device with QVGA (320x240 or 240x320) resolution display and a PC with Windows 2000, XP, or Vista, a high speed Internet connection, 65 MB available hard disk space on the PC, 3MB available space on the device, and Microsoft Installer 3.0 and .NET Framework 2.0 on the PC.\n\nThe software supports Pocket PC Phone and Smartphone devices with Windows Mobile 5.0, including devices with portrait or landscape QVGA screens. Examples of supported devices include the Cingular Blackjack, 2125, 3125, 8125, i-mate JAQ, JAMin, Smartflip and SP3, Motorola Q, Samsung i320, T-Mobile Dash, SDA and MDA, Qtek 8310, Sprint IP-830W and PPC-6700, Vodafone v1240 and Verizon Wireless XV6700.\n\nIn addition to the retail software being offered for download to consumers, Ascender also has a version of the software available for licensing to handset manufacturers and wireless carriers. The OEM version of the software runs on the device and does not require a PC. This version can be customized for OEMs who want to enhance their Windows Mobile 5.0 devices in a very cost-effective manner. For more information on the OEM version, contact Ascender's sales team or visit Ascender's website at [http://www.ascendercorp.com/personalitykit.html](http://web.archive.org/web/20120203184619/http:/www.ascendercorp.com/personalitykit.html \"http://www.ascendercorp.com/personalitykit.html\")\n\nAbout Ascender  \nAscender® Corporation is a leading provider of advanced font products specializing in type design, font development and licensing. Ascender's founders are font industry experts and have been involved in developing some of the most important and influential fonts used in computers and mobile devices. Ascender provides multilingual, custom font development for a wide range of customers including creative professionals, enterprises and hardware & software developers. Ascender also provides fonts for download to graphic designers and consumers through the Ascender Font Store website.\n\nAscender Corporation | [www.ascendercorp.com](http://web.archive.org/web/20120203184619/http:/www.ascendercorp.com/ \"www.ascendercorp.com\")\n\n",
  "author": "<a href=\"http://web.archive.org/web/20120203184619/http:/typophile.com/user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": ": 5.Dec.2006 12.52pm",
  "uid": "108",
  "comments": [

  ]
}
