{
  "id": "29930",
  "title": "Bruce Rogers - World Bible Chapter Initials",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I’m in the process of digitizing this type (see attached). I know [Bruce Rogers](http://web.archive.org/wiki/Bruce%20Rogers) used these letters as chapter initials in the World Bible of 1949, but I also recently discovered that he used them on the title page of “The Wind in the Willows in 1940.” If he designed these letters, it was most certainly not for the World Bible as I previously thought. Also, this type could have been an available font that he simply used for these jobs.\n\nAnyone know anything about this?\n\n| Attachment | Size |\n| --- | --- |\n| [RogersInitials.jpg](http://web.archive.org/web/20070125111452/http:/typophile.com/files/RogersInitials.jpg) | 134.52 KB |\n\n",
  "author": "<a href=\"user/14140\" title=\"View user profile.\">Greg Stanton</a>",
  "time": "<br>",
  "uid": "14140",
  "comments": [
    {
      "time": " 5 December, 2006 - 8:12pm",
      "content": "I looked in three books I had that have information about Rogers’ career, and a set of initials like these was not mentioned or shown in any of the books. Some examples of initials he used were shown, and in one case they were Cloister Initials, by Frederic Goudy.\n\nThe type for the World Bible was a version of Goudy Newstyle that Rogers did in collaboration with Sol Hess.\n\nSince the World Bible was basically set in a version of one of Goudy’s typefaces, I looked in a book about Goudy’s works to see if these initials were also his, but they were not shown in the collection that was supposed to show all of Goudy’s type designs.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 5 December, 2006 - 8:46pm",
      "content": "For further digging, I went through the McGrew book of American Metal Typefaces, and the Jaspert Encyclopaedia of Type Faces. Also the Solotype Catalog, and several of the Dover books by Dan Solo. Couldn’t find this set of initials in any of them.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 5 December, 2006 - 11:21pm",
      "content": "Those are nice, if VERY application specific. I’ve never seen them either.\n\n"
    },
    {
      "time": " 6 December, 2006 - 8:57am",
      "content": "Thanks for your help. I went through the usual references and couldn’t find a thing. I suppose it shall forever remain a mystery.\n\nYou may pass through this life and never see them again, to be sure. I can’t imagine a modern application for these at all. I just wanted to digitize them to scratch an itch.\n\n"
    },
    {
      "time": " 9 January, 2007 - 4:56pm",
      "content": "Greg, how has this been going?\n\nhhp\n\n"
    }
  ]
}
