{
  "id": "29946",
  "title": "The best term for a typeface that combines elements of both serif and sans serif is:",
  "forum": "Home",
  "tags": [

  ],
  "content": "hybrid\n\n 14% (5 votes)\n\nhybrid serif\n\n 3% (1 vote)\n\nsemi-serif\n\n 67% (24 votes)\n\ndemi-serif\n\n 3% (1 vote)\n\nmix\n\n 8% (3 votes)\n\nmash-up\n\n 0% (0 votes)\n\nanother term (please list)\n\n 6% (2 votes)\n\n Total votes: 36 \n\n",
  "author": "paul d hunt",
  "time": "6 Dec 2006 — 9:11am",
  "uid": "7006",
  "comments": [
    {
      "time": "8 Dec 2006 — 10:33pm",
      "content": "Carl: Mélange! I like this one. It's more fun than the rest while acknowledging history.\n\nPaul: re; devout. Me too.\n\n"
    },
    {
      "time": "8 Dec 2006 — 11:00am",
      "content": "I don't like to talk about my flair.\n\n"
    },
    {
      "time": "8 Dec 2006 — 10:34am",
      "content": "_We know we can’t use Flare, because of the confusion with Flair._\n\nWhat confusion with Flair?\n\n"
    },
    {
      "time": "8 Dec 2006 — 10:26am",
      "content": "Mezzoserifo? Sorry.\n\nhhp\n\n"
    },
    {
      "time": "8 Dec 2006 — 10:20am",
      "content": "Synthetic? I bet that won't be popular.\n\nWe know we can't use Flare, because of the confusion with Flair.\n\nSurely there is an Italian word for this.\n\n"
    },
    {
      "time": "8 Dec 2006 — 7:07am",
      "content": "Symberif?\n\n"
    },
    {
      "time": "8 Dec 2006 — 5:46am",
      "content": "Serifticious\n\nChrisL\n\n"
    },
    {
      "time": "8 Dec 2006 — 5:30am",
      "content": "...and he rested on the seventh day from all his work which he had made.\n\nAnd on the eighth day humankind got up late, looked upon his work and thought it was all a bit mixed up and needed sorting out.\n\nAnd lo, it came to pass that those of great arrogance said all things shalt be classed and categorized, and that they were the ones for the job.\n\nSome declared their divisions as definitive, and pronounced themeselves an authority, and carved their classifications into stone for all time.\n\nBut time shifts all things and their words were worn blank unto dust.\n\n(You can probably tell i've not actually read the bible. Or lord of the rings ;)\n\n"
    },
    {
      "time": "7 Dec 2006 — 8:10pm",
      "content": "Should have called it \"Gusical\" :-)\n\nChrisL\n\n"
    },
    {
      "time": "7 Dec 2006 — 7:37pm",
      "content": "Yes! The words \"bingo\" and \"distressed\" in the same sentence!!!!!!!!\n\nAnd the numbers are mixed between OSF and line.....\n\nBrrrrr!!!!!!\n\n(!!!!) (Sorry, I'm still recovering from reading the \"Gutenberg! The Musical!!!\" review.)\n\nGee, 55\n\n"
    },
    {
      "time": "7 Dec 2006 — 6:46pm",
      "content": "Rock on, dude.\n\nhhp\n\n"
    },
    {
      "time": "7 Dec 2006 — 6:21pm",
      "content": "_What do i click on to vote?_\n\ni closed the polling early, so as to expose the other poll which is currently open. however, i think i'm giving up on terms altogether and becoming a devout deconstructionist (i had tendencies already, but these two threads confirm that terms are too slippery to have much more meaning that what each individual assigns to them).\n\n"
    },
    {
      "time": "7 Dec 2006 — 4:02pm",
      "content": "and the bingo cards are in distressed script capitals.\n\nChrisL\n\n"
    },
    {
      "time": "7 Dec 2006 — 3:00pm",
      "content": "\"Hell\" is a place where all the signs are in Papyrus, and the PowerPoint presentations of financials are in Comic Sans.\n\n"
    },
    {
      "time": "7 Dec 2006 — 2:03pm",
      "content": "Vince might be watching and waxing poetic about Comic Sans between shutter snaps :-)\n\nChrisL\n\n"
    },
    {
      "time": "7 Dec 2006 — 1:59pm",
      "content": "_Aaahh, Penumbra, i will always love you. Ahem, sorry about that._\n\nAin't no law against waxing poetic about a typeface here. ;-)\n\n(Unless it's Comic Sans....)\n\n"
    },
    {
      "time": "7 Dec 2006 — 12:57pm",
      "content": "What do i click on to vote? No secret ballots here then? Good.\n\nPenumbras naming makes sense to me, probably cos i'm so familiar with it...\n\nSans Serif / Flare Serif / Half Serif / Serif\n\nSo maybe have 2 intermediate categories. That way anythig under 45 degrees of the stem can fall into the Flare Serif category and anything over can go in the Half Serif category if it's not quite a full serif. I made that up as i went along. It may need more thought.\n\nI think semi-serif works anyway.\n\nAaahh, Penumbra, i will always love you. Ahem, sorry about that.\n\n"
    },
    {
      "time": "7 Dec 2006 — 10:24am",
      "content": "Semi serif translates better amongst languajes.\n\nHéctor\n\n"
    },
    {
      "time": "7 Dec 2006 — 10:16am",
      "content": "No love for the mash-up? Well then…\n\n"
    },
    {
      "time": "7 Dec 2006 — 7:51am",
      "content": "Bastarda v2\n\n"
    },
    {
      "time": "7 Dec 2006 — 7:03am",
      "content": "\"...terms currently useful, if imperfect, and expect them to be flawed, and outdated in 10 years.\"\n\nGroovy :-)\n\nChrisL\n\n"
    },
    {
      "time": "7 Dec 2006 — 6:50am",
      "content": "Because people have new ideas all the time, any classification is going to be problematic. Currently, I find semi-serif (that of Rotis and eg Froggy) and stressed sans (such as Optima and eg Beorcana) useful.\n\nBut Meta, for example has bent stems in places that act sort of like serifs. And Beorcana's heavier weights--which I really like--are such that you could argue that the ends act like serifs.\n\nSo I would say that for discussion just take terms currently useful, if imperfect, and expect them to be flawed, and outdated in 10 years.\n\n"
    },
    {
      "time": "7 Dec 2006 — 6:40am",
      "content": "Who is to say it is an offspring? Perhaps it is trans gender? Perhaps the name is \"Transerif\" or \"Transans\"?\n\nChrisL\n\n"
    },
    {
      "time": "6 Dec 2006 — 8:58pm",
      "content": "Maybe it's me, but \"semi-serif\" is something I always associate with Stone's eponymous Serif/Semi/Sans family, and intermediate incidents of MM Penumbra.\n\nIf you cross a donkey with a horse, it's a hybrid called \"mule.\" (I promise not to get into what you get when you cross a lion with a tiger, because it depends on which is the mother and which is the father.)\n\nAs defined in the dictionary, a hybrid is \"a thing made by combining two different elements; a mixture.\" If that's not what you'd call the offspring of a serif and a sans, I don't know what is.\n\n"
    },
    {
      "time": "6 Dec 2006 — 3:10pm",
      "content": "Mélange?\n\nUn Peu du Tout?\n\nGrotesqua?\n\nNeapolitan?\n\nChimera? (Idea from Gabriel Martinez Meave)\n\n"
    },
    {
      "time": "6 Dec 2006 — 1:30pm",
      "content": "We call sans that have some serifs, [some-serifs](http://web.archive.org/web/20131015171930/http:/typophile.com/wiki/some-serifs) fonts because only some of the charaters have serifs.\n\n"
    },
    {
      "time": "6 Dec 2006 — 1:25pm",
      "content": "\"Brindle\" is a colour. ;-)\n\nLike my god-puppy Zook ( [http://btca.com/Silverwood%20Natl%20Spec%202006%20Results/Futurity%20and...](http://web.archive.org/web/20131015171930/http:/btca.com/Silverwood%20Natl%20Spec%202006%20Results/Futurity%20and%20Sweeps.htm \"http://btca.com/Silverwood%20Natl%20Spec%202006%20Results/Futurity%20and%20Sweeps.htm\")).\n\n"
    },
    {
      "time": "6 Dec 2006 — 12:49pm",
      "content": "_Glyphic_ is more of a **Trajan** -esque (more serif really than sans-serif) stone-cut style typeface.\n\n"
    },
    {
      "time": "6 Dec 2006 — 1:42pm",
      "content": "like Lithos?\n\n"
    },
    {
      "time": "6 Dec 2006 — 11:40am",
      "content": "Spayed-serif :-)\n\nChrisL\n\n"
    },
    {
      "time": "6 Dec 2006 — 11:16am",
      "content": "Mongrel, Bastard, Pied, Mutt or Brindle? (That's for you Linda)\n\n"
    },
    {
      "time": "6 Dec 2006 — 10:51am",
      "content": "I suppose “hybrid” is more internationally understood (as it is Latin derivative) than “mix”.\n\nIt would certainly need a bit of warming to.\n\n"
    },
    {
      "time": "6 Dec 2006 — 10:49am",
      "content": "I tried for years to find a better term for those, but failed.\n\nhhp\n\n"
    },
    {
      "time": "6 Dec 2006 — 10:44am",
      "content": "including [hybrid figures](http://web.archive.org/web/20131015171930/http:/typophile.com/wiki/hybrid%20figures)???\n\n"
    },
    {
      "time": "6 Dec 2006 — 10:43am",
      "content": "I would avoid \"hybrid\" for anything as much as possible.\n\nhhp\n\n"
    },
    {
      "time": "6 Dec 2006 — 10:36am",
      "content": "Interesting -- I voted for \"hybrid\" before reading the discussion and I still think it's the best. As Paul and others have mentioned, it doesn't give any preference to serifs or sans, and in the dog-show world, any product of a mixed breeding produces a hybrid: something that isn't encouraged in the registered show-dog, make-big-bucks world, but \"hybrid vigour\" is a good thing in a pet.\n\nJust one type- and dog-lover's opinion.... ;-)\n\n"
    },
    {
      "time": "6 Dec 2006 — 10:25am",
      "content": "i'm not saying that there needs to be only one term that can apply in such situations, i'm just trying to come up with the best term for a wiki entry. whatever term is chosen for the main wiki entry should probably reference some of these other terms and pages for these terms should point to the main entry?\n\n"
    },
    {
      "time": "6 Dec 2006 — 10:19am",
      "content": "I have the same problem with mix and hybrid. They can be from any two variables. We may need the word serif in there just to identify the variable. To me, Optima is yet another breed where contrast is the variable. Semiserif still rings better than the rest bto me.\n\nChrisL\n\n"
    },
    {
      "time": "6 Dec 2006 — 10:15am",
      "content": "Nope. I didn't. I was thinking the same thing after I posted though. The second we want sub-categories, we're going to end up wanting sub-categories for those sub-categories.\n\n"
    },
    {
      "time": "6 Dec 2006 — 10:08am",
      "content": "tiff, i'm guessing you didn't see Carl's last post? :^p\n\n"
    },
    {
      "time": "6 Dec 2006 — 10:06am",
      "content": "Ah! Well, then I suppose Hybrid is best.\n\nWhat about Interpolative (sans) or (serif)?\n\n"
    },
    {
      "time": "6 Dec 2006 — 10:05am",
      "content": "well i don't think hybrid sounds sci-fi, just nice and clean and sterile and scientific. i don't like \"mix\" because it sounds too _mongrel_, which, might actually be the best term.\n\n"
    },
    {
      "time": "6 Dec 2006 — 10:04am",
      "content": "Depends which elements of the 2 genres it has. Is it serifs, contrast, some combination? Beorcana, Optima, Amira have no serifs at all, so they can't be called semi-serif. H. Zapf called Optima a \"serifless roman\", which I still think is awkward, and refers too much to a different category (although Sans Serif itself refers to serifs).\n\nIf there are partial serifs, half serifs or only a few, like with Areplos or Rotis Semi-Serif, then that term fits. If there are none, but there's contrast, I'd like to come up with a more graceful term than \"serifless roman\" or \"high-contrast sans\" or \"modulated sans\". Those are wordy, and though it's true we won't save trees shortening the name of this category, I predict the category will fill up, and then we'll want a snappier name to go alongside Serif, Sans, Grotesque, Fat Face, Script, etc. The reason I don't go for 'hybrid\" is that it could mean hybrid between any 2 (or more) styles or classes. That could mean modern/sans, or script/sans or script/typewriter, or brush/modern (it exists!).\n\nDoes anyone have a single word from any language that describes any of these categories gracefully?\n\n[edit] OOH serifette! Is that like Penumbra with those teeny serif-ettes?\n\n"
    },
    {
      "time": "6 Dec 2006 — 10:00am",
      "content": "I’d go for Mix, easily understood… Hybrid just sounds a bit too sci-fi.\n\n"
    },
    {
      "time": "6 Dec 2006 — 9:58am",
      "content": "serifette sounds like it has \"petit serifs,\" which is what i _think_ the other usage of semi-serif is.\n\n"
    },
    {
      "time": "6 Dec 2006 — 9:54am",
      "content": "I like mix. It sounds less 'short but tall'. On the other hand, Mix sounds a bit like a machine made halfway point. Semi-serif sounds more deliberate. Maybe we need a french word to be invented. Maybe faux french like 'serifette'? But I don't know that you can have (or would want ) a blanket term. In type world names for things only settle out ( if they do at all ) after the fact. And there are so many ways to make something which is inbetween a serif and a gothic! In the end I guess I think it depends on the forms themselves. So maybe we need all the descriptive terms we can get. And maybe the trick is to match the term with what's happening in your font. So a font with serif on one side of the stem would be one thing & a font with mini serifs another and one which almost suggests serifs like Beorcanna another & so on. Will you show us an example?\n\n"
    },
    {
      "time": "6 Dec 2006 — 9:54am",
      "content": "what i'm looking for here is a term that can describe \"semi-serif\" and \"semi-sans\" equally. Maybe \"hybrid\" is best at this but then i feel that the term is not that descriptive. you almost want to say \"hybrid-serif\" but that feels like you're giving the term \"serif\" deference. however, even the term \"sans serif\" privelages the term serif... ooooh, deconstruction!\n\n"
    },
    {
      "time": "6 Dec 2006 — 9:51am",
      "content": " **Scrotis** (Schizophrenic Rotis)  \n_noun_  \na long-term mental disorder of a type involving a breakdown in the relation between thought, emotion, and behavior, leading to faulty perception, inappropriate actions and feelings, withdrawal from reality and personal relationships into fantasy and delusion, and a sense of mental fragmentation.\n\n(in general use) a mentality or approach characterized by inconsistent or contradictory elements.\n\n"
    },
    {
      "time": "6 Dec 2006 — 9:47am",
      "content": "Thesis \"The Mix\" is more of a semi-sans.\n\nChrisL\n\n"
    },
    {
      "time": "6 Dec 2006 — 9:44am",
      "content": "I think some terms will have to have \"also known as\" referrals. It isn't like we're trying to save paper or something.\n\nThe first popular semi serif was Rotis, was it not? Perhaps the page should be \"Semi serif\" with a list of \"also known as\"?\n\n"
    }
  ]
}
