{
  "id": "29944",
  "title": "(x) DIN-like font, used on BetUS.com branding - Vibration {Wes (self)}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi guys\n\nBetUS.com uses this font in all of their branding. I was thinking this font was DIN at first, but then realized that the \"1\" was not right. Anybody know what this one is?\n\nSome examples:\n\n ![](http://web.archive.org/web/20120226065513im_/http:/typophile.com/files/1_3877.jpg)\n\n ![](http://web.archive.org/web/20120226065513im_/http:/typophile.com/files/3_6598.jpg)\n\n ![](http://web.archive.org/web/20120226065513im_/http:/typophile.com/files/bet_4290.jpg)\n\nthanks for any help!\n\n",
  "author": "<a href=\"/web/20120226065513/http://typophile.com/user/13429\" title=\"View user profile.\">wesmo</a>",
  "time": "<br>",
  "uid": "13429",
  "comments": [
    {
      "time": "",
      "content": "[Titling Gothic](http://web.archive.org/web/20120226065513/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=titling%20gothic)?\n\n"
    },
    {
      "time": "",
      "content": "[Almost](http://web.archive.org/web/20120226065513/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=FB.122841.0.5&attributes.sampleSize=48&sampleText=CHROME+%26+BBQ&sampleSize=32), but too American.\n\n"
    },
    {
      "time": "",
      "content": "Why do you see that as American, Stephen?\n\n"
    },
    {
      "time": "",
      "content": "Stephen, yep, getting close...looks a lot like it. But that \"1\" is not right yet. I went through their whole site looking for the \"1\" to help try to match, but no luck as of yet.\n\n"
    },
    {
      "time": "",
      "content": "Titling Gothic as American? Not as square as this. More warmth in glyphs like the ampersand. I guess I should say \"older\".\n\n"
    },
    {
      "time": "",
      "content": "There are several 'signature' elements in this font (duh!), but the closure of the C, oblong O, and the style of R are proving to be an elusive combination for me. We even see the G, M and Q, which you think would help nail it, but so far I have not found a match.\n\nThis site doesn't strike me as a place that would be getting custom font work done, so this is probably sitting out there somewhere, but so far my best (poor) match has been [Ketchupa](http://web.archive.org/web/20120226065513/http:/www.fountain.nu/catalogue/ketchupa_reg.asp) from Fountain. Most shapes are OK, but the R is wrong and the 1 isn't right. I like Ketchupa because the edges are softened, but that is also unlike the posted sample. I told you it was a poor match.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "After about a full hour researching this one, I'm _bet_ting on custom.\n\n"
    },
    {
      "time": "",
      "content": "Custom, but based on what typeface? I am not sure I buy it is original.\n\n"
    },
    {
      "time": "",
      "content": "If it's custom, I'm betting on Stephen's suggested Titling Gothic Narrow Medium. It seems to be the closest match.  \nDoing more research on this company, they are huge-huge, and I wouldnt doubt that as part of their all new re-brand they went this custom route. BUT...I am still checking around!\n\n"
    },
    {
      "time": "",
      "content": "EXTRA EXTRA READ ALL ABOUT IT =)\n\nComing 'round back to this.  \nAt last, recently I have discovered the ID of this font. I felt like a character in a Dan Brown novel unraveling the shrouded mysteries that cloak this font. Well I finally have my answer.  \nIt's called Vibration, and its a FontBureau font, originally created for VIBE Magazine. It's not available on the site, but they will sell it to you over the phone. I hope this info helps some of you, and for those that have helped along the way, I also thank you.\n\n"
    },
    {
      "time": "",
      "content": "Well done. Some might be suprised how many nearly faces FB have in their drawers just waiting to get put on the store shelves.\n\nWhere did you find the answer? Or did someone find you?\n\n"
    },
    {
      "time": "",
      "content": "Thanks for coming back with an answer. Turns out I had a sample of it in my Sans Serif Font ID Guide, but I must have gone right by it.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "I thought this was going to be released publicly soon. :^/ I also thought the custom area on the site was going to re-appear.\n\n"
    },
    {
      "time": "",
      "content": "The latest (3rd, hardcover) edition of the Font Bureau type catalog includes Vibration Gothic -- the book must have been printed during that brief period after the font was released from Vibe-sclusivity and before it was pulled from the FB site.\n\n"
    },
    {
      "time": "",
      "content": "<cite>I felt like a character in a Dan Brown novel</cite>\n\nYou poor, poor man.\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "Typophile, the right place for type identification and literary reviews. :^P\n\n"
    }
  ]
}
