{
  "id": "29954",
  "title": "Curiously persistant Franklin Gothic",
  "forum": "Build",
  "tags": [

  ],
  "content": "I can't remove Franklin Gothic Medium and Medium Italic from my PC.\n\nBecause of a new problem loading Photoshop 5 (it fails with a cooltype.dll error at \"Initializing Type Engine\") I've been trying to strip my fonts folder down to its bare minimum (it's my home machine, so there's not too much in there anyway)\n\nThese two ITC fonts framd.ttf and framdit.ttf show in my Windows font older with the Opentype icon, if I delete them, they seem to regenerate, after a couple of seconds and if I remove them using ATM 4 (with the remove files from disk option checked) they temporarily disappear from the Windows font folder, and then reappear with the TTF icon!\n\nI seriously doubt this behaviour has anything to do with my Photoshop problem (although it still isn't fixed), but it is starting to annoy me.\n\nNot that I have any particular aversion to ITC or Franklin Gothic, but I would like to feel that I'm in control of whether a font stays or not.\n\n",
  "author": "<a href=\"/web/20100714161007/http://typophile.com/user/2454\" title=\"View user profile.\">Richard Hards</a>",
  "time": "<br>",
  "uid": "2454",
  "comments": [
    {
      "time": "",
      "content": "Stab in the dark: Did you remove the fonts from the system folder which Adobe installs? Some of those are necessary to run the software.\n\n"
    },
    {
      "time": "",
      "content": "Good idea, however a search raises more questions than it solves ;)\n\nAnyway, I think I must to bed if I am to apply any logic to this, more later…\n\n"
    },
    {
      "time": "",
      "content": "Franklin Gothic is a system font in Windows XP, AFAIK.\n\n-- [omine.net](http://web.archive.org/web/20100714161007/http:/www.omine.net/)\n\n"
    },
    {
      "time": "",
      "content": "Those were TTFs, ergo not Adobe's versions. They are almost certainly MS fonts, and are probably getting \"healed\" by some app (MS Office?) or the OS.\n\nT\n\n"
    },
    {
      "time": "",
      "content": "MS is distributing ITC Franklin Gothic?\n\n"
    },
    {
      "time": "",
      "content": "The fonts are used in Windows XP's UI, so are 'system file protected' - same thing will happen if you try to delete Tahoma. We originally licensed outlines from URW, and licensed the trademark from ITC - the full set of fonts were used for corporate branding, but eventually ended up shipping with Publisher - two styles were shipped with Windows XP (and subsequently Vista).\n\nCheers, Si\n\n"
    }
  ]
}
