{
  "id": "29959",
  "title": "Type Design 101",
  "forum": "Design",
  "tags": [

  ],
  "content": "Im entering my last year of Design School and wanted to start working on typeface design and move it beyond just sketches and vector illustrations.\n\nIve purchased Fontlab Studio and am begining to learn the workings of the program. The advice I seek is an approach to designing whole alphabets … tips on consistency tips on everything. This may be a topic elsewhere, if so I will hopefully find it. Again any first timer tricks or tips would be greatly appreciated.\n\nCheers\n\n",
  "author": "<a href=\"user/14360\" title=\"View user profile.\">JSDOCA</a>",
  "time": "<br>",
  "uid": "14360",
  "comments": [
    {
      "time": " 6 December, 2006 - 11:41pm",
      "content": "My advice? Play around.\n\nYou’re not going to make an amazing font on your first try, but the more you play around with your tools (not just computer tools, but pencil, paper, etc. too) the more you will learn how they work. Since you say you’re in last year, you’ve probably done this a lot.\n\nYou should check out the [how-to](http://web.archive.org/wiki/how-to) wiki.\n\n- Lex\n\n"
    },
    {
      "time": " 7 December, 2006 - 12:14am",
      "content": "Leslie Cabarga’s Logo, Fonts & Lettering Bible is one place to start.\n\nT\n\n"
    },
    {
      "time": " 7 December, 2006 - 2:56am",
      "content": "Also Leslie Cabarga’s ‘Learn FontLab fast’.\n\nNick Cooke\n\n"
    },
    {
      "time": " 7 December, 2006 - 7:47am",
      "content": "another wiki entry that might help [FAQ\\_Design](http://web.archive.org/wiki/FAQ_Design)\n\n"
    },
    {
      "time": " 7 December, 2006 - 12:28pm",
      "content": "James, I teach a night-time typeface design class at ArtCenter in Pasadena.  \nThe next semester starts in January.\n\nhhp\n\n"
    },
    {
      "time": " 9 December, 2006 - 11:43pm",
      "content": "Hrant if I wasnt in the No Cal and moving to Lake Tahoe … I would be there in a second. Any other suggestions for classes that are centered specifically around type design… assuming or requiring the student or enrollee to have a solid typographic understanding? Im finishing my degree in the next year or so at the Academy of Art in Sf… the remainder online thus leaving me some room to work.\n\nCheers\n\n"
    },
    {
      "time": " 10 December, 2006 - 12:01am",
      "content": "Oh, sorry, Walnut Creek sounded very SoCal. :-) Moving to Lake Tahoe, eh? Just in time for winter fun. I’m actually going skiing (locally) tomorrow, or I might try snowboarding for the first time - wish me luck.\n\nIf I’m not mistaken Amy Conger has a type design class at CCSF.\n\nhhp\n\n"
    }
  ]
}
