{
  "id": "29988",
  "title": "InDesign CS2 install = laggy and glitchy computer and ...",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "unreliable printing.\n\nAnyone had any similar experiences? Our Dept is running g5 imacs, (pre-intel). After we installed, iDcs2 is super laggy and the screen redraw is worse than before. AND all but one of our printers work now. Paragraph styles acting buggy too.\n\nthx\n\n",
  "author": "Eric_West",
  "time": "8 Dec 2006 — 2:43pm",
  "uid": "6194",
  "comments": [
    {
      "time": "8 Dec 2006 — 3:12pm",
      "content": "Have you run all the available updates?\n\nFound in the meny Help \\> Updates\n\n"
    },
    {
      "time": "8 Dec 2006 — 8:22pm",
      "content": "Don't Know what the tech guy has tried. Will mention it to him. But seriously, right out of the box that crunchy?\n\n"
    },
    {
      "time": "9 Dec 2006 — 2:56am",
      "content": "Yeas, that seems strange. We had no such experiences when updating to InDesign CS2 some time ago.\n\nYou don‘t need no tech guy to do the updates, they are automatically done from InDesign, and these updates are always good to do, sometimes it helps a lot, since it could be small bug fixes etc.\n\nWhen I think of it, I always do these updates right away, maybe that’s why I didnt experience any problems...?\n\n"
    },
    {
      "time": "11 Dec 2006 — 6:17am",
      "content": "Everything is updated as far as I can tell. it's on version 4.0.4. Now were having books and files disappear.\n\n"
    },
    {
      "time": "11 Dec 2006 — 8:35am",
      "content": "More information needed: which OS X-version? How much memory on the machines? Networked? Off at night or not?\n\nIn general: after installing progs one should run Apples Disk Utility:First Aid (resetting privileges).  \nRegelar maintanace is built in, providing the machines are on at night; otherwise run a tool like Onyx, at least once a week.\n\nCommon way to test whether the slugginess is user– or machinerelated, is to set up a new user and try InDesign under that account.\n\n"
    },
    {
      "time": "11 Dec 2006 — 11:31am",
      "content": "Eric, I've had good success with using the [Adobe Forums (Indesign)](http://web.archive.org/web/20150415073637/http:/www.adobeforums.com/cgi-bin/webx/.ee6b330/?@697.j5NAgSfVRDu@) before. I am using an old G4 tower and InDesign CS2 had no problems here.\n\n"
    }
  ]
}
