{
  "id": "29989",
  "title": "Where does \"pica\" come from ?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello everyone  \nBeing French and for this reason very \"metric system-oriented\", I've always been fascinated by Anglo-American systems of measurement. I know roughly where the French term \"cicéro\" comes from but I'm wondering about the origin of the word \"pica\". Does anybody have a clue about this one ?\n\n",
  "author": "<a href=\"/web/20110130044908/http://www.typophile.com/user/11083\" title=\"View user profile.\">Celeste</a>",
  "time": "<br>",
  "uid": "11083",
  "comments": [
    {
      "time": "",
      "content": "The English “pica” comes from the Latin _pica_ (magpie) since the first printed book used clearly distinguished blacks and whites, like the plumage of the magpie bird.\n\n"
    },
    {
      "time": "",
      "content": "I found a dictionary entry that indicates that pica was a term in medieval Latin to describe a list of church services. Pica could have been a reference to the type used for those documents.\n\n"
    },
    {
      "time": "",
      "content": "Isn't there a game in which you are given a word and then asked to give a definition? (Not that this is a game, I was just reminded of it.)\n\n"
    },
    {
      "time": "",
      "content": "Alessandro is correct, at least according to this site:\n\n[http://www.etymonline.com/index.php?term=pica](http://web.archive.org/web/20110130044908/http:/www.etymonline.com/index.php?term=pica \"http://www.etymonline.com/index.php?term=pica\")\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "Céleste, I am charmed by your question, since (if I'm right -- I'm citing this from memory and don't have time to look it up right now) the really logical system of measurement that we all use was largely developed by the Didot family, eh ouai c'était bien une famille française ! Ou plutôt une dynastie. So although you may say cicéro and not pica, the supposedly Anglo-American system that you ask about is really built on work done in France. Or have I misunderstood your comments in the original question?\n\nBruce\n\n"
    },
    {
      "time": "",
      "content": "Tiffany, I think you're referring to [Call My Bluff](http://web.archive.org/web/20110130044908/http:/en.wikipedia.org/wiki/Call_My_Bluff).\n\nEssential viewing for anyone enjoying etymology.\n\n"
    },
    {
      "time": "",
      "content": "Bruce, I know the point measurement system was perfected by the Didot family from the experimentations led by the Romain du Roi committee and then Pierre-Simon Fournier \"le Jeune\". I knew as well about the list of church services and the type size used to print it (\"cicéro\" comes from the same kind of \"semantic stunt\" — the works of Marcus Tullius Cicero, obviously — when a type size was given the name of the kind of printing work it was primarily or most usually used for).  \nBut I never could be able to find what the original word \"pica\" meant exactly. Could there be a relationship between the Latin word for \"magpie\" and the heterogeneous nature (hymns, recitations, etc.) of a church service ? Or the fact that church services are very different according to the period of the liturgical year ?  \nOr could the \"church pica\" bear no relationship at all with the \"magpie pica\", being the result of an abbreviation or an acronym ?\n\n"
    },
    {
      "time": "",
      "content": "According to Oxford  \n\\>— ORIGIN Latin, literally ‘magpie’, commonly identified with a 15th-century book of rules about Church feasts, although there is no known copy of this book printed in pica type\n\nWheras Brewer refers to it as the initial letter of each order from litera picata\n\nAlthough I wonder if the Ecclesiastical references (which also call this type of book of feasts pie or pye) aren't related to the Latin _pius (& pietas)_ –&nbsp;dutiful, which makes more sense to me. Despite this fancy, many type size names are taken from church documents, brevier and primer are two more examples.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "Thank you very much, Tim.  \nI agree that a link with \"pius\" — which also means \"pious\" or \"devout\" in a religious context — is a very interesting lead ; this is the reason why I suggested that \"pica\" could have been an abbreviation. Which leaves us then with the problem to find out what \"-ca\" would stand for.\n\n"
    },
    {
      "time": "",
      "content": "\\> ORIGIN Latin, literally ‘magpie’,\n\nSurprised Vinnie doesn't make the connection here... [http://www.connare.com/type.htm](http://web.archive.org/web/20110130044908/http:/www.connare.com/type.htm \"http://www.connare.com/type.htm\")\n\n"
    },
    {
      "time": "",
      "content": "Was pica not at one time (before points came along) a size of type? Like agate, which also turned into a measurement.\n\n"
    },
    {
      "time": "",
      "content": "Yep, see section 6...\n\n[http://www.microsoft.com/typography/glossary/content.htm](http://web.archive.org/web/20110130044908/http:/www.microsoft.com/typography/glossary/content.htm \"http://www.microsoft.com/typography/glossary/content.htm\")\n\n"
    },
    {
      "time": "",
      "content": "Ruari McLean (in _The Thames and Hudson Manual of Typography_) also mentions that pica (along with terms like nonpareil and brevier) used to be a type size.\n\nHere are some definitions from the _Glossary of Typesetting Terms_ (Eckersley, Angstadt, Ellertson, Hendel, Pascal and Scott, University of Chicago Press, Chicago & London, 1994). No mention of word origins for pica, however.\n\n**Pica:** A standard typographic unit of measure equal to 12 Anglo-American points. Six picas equal 0.9936 inch, though personal computer systems round this off to an exact inch. This system of measurement is used primarily by typesetters, but also by many printers and binders. Historically pica was a type size, roughly equal to a 12-point setting.\n\n**Point:** The smallest whole unit in the Anglo-American measurement system used principally in typesetting and printing. The point is equal to 0.35136 millimeter or 0.0138 inch, making 12 points to a pica and approximately 72 points to an inch (actually, 72 points equals 0.9936 inch).\n\n**Cicero:** A unit of type measurement in the Didot point system, which originated in France and is now employed throughout Europe except in the United Kingdom and Ireland. One cicero equals 12 Didot points, equivalent to 12.839 points in the Anglo-American point system. Ciceros are used in Europe to describe the width and depth of a block of text, serving much the same purpose as the Anglo-American pica.\n\n**Didot point (d):** A typographic measurement introduced in 1775 by the French printer Francois-Ambroise Didot and used in continental Europe. The Didot point equals 0.375 mm or 0.015 inch, larger than the Anglo-American point; for example, 12 d is approximately the same as 14 points in the Anglo-American point system.\n\nAlso interesting: the point system was originally created by another French typefounder, Pierre Fournier le jeune, in 1737. He used 0.349 mm for his unit of measurement. \"Eventually a standard point of 0.013837 in. (0.3515 mm) was adopted by the American Type Founders' Association in 1886 and by the British in 1898...\" (Ruari McLean again).\n\n"
    }
  ]
}
