{
  "id": "29998",
  "title": "The Sloped Roman",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I read [Stanley Morison](http://web.archive.org/web/20131010192838/http:/www.typophile.com/wiki/Stanley%20Morison) article ‘Towards An Ideal Italic’, The [Fleuron](http://web.archive.org/web/20131010192838/http:/www.typophile.com/wiki/Fleuron) Number 5 (1926) pp. 93-129. He proposes the [sloped roman](http://web.archive.org/web/20131010192838/http:/www.typophile.com/wiki/sloped%20roman) as an alternative, because he wanted the 'ideal italic' to blend in better with its roman counter part. The reasons he gives in his article for an ideal italic are (in my opinion) reasonable. However the only example I know of and have seen of a design based on Morissons article is the 'Romulus schuine romein' designed by [Jan van Krimpen](http://web.archive.org/web/20131010192838/http:/www.typophile.com/wiki/Jan%20van%20Krimpen) and to my knowledge Morrisson never followed his own advice. I have seen the drawings of [Romulus](http://web.archive.org/web/20131010192838/http:/www.typophile.com/wiki/Romulus) (including his slanted roman) and I have read Van Kimpens own dislike for his experiment.\n\nI was wondering if any of you know of another design for a serif typeface with a sloped roman (except Romulus, [Perpetua](http://web.archive.org/web/20131010192838/http:/www.typophile.com/wiki/Perpetua) and Felicity) and could you explain the dislike or like you might have towards the sloped roman. I want to find an explanation why (for example) the Romulus sloped roman was never successful and an Italic had to be designed. (Readers couldn't keep the roman and sloped roman apart? But the reader can keep many more letters apart.)\n\nIf you by any chance know of a book or article about the subject (the sloped roman) I would be much obliged if you give me a title and or author.\n\nI found the following Typophile topic:\n\nSloped roman and italic in the same family [http://typophile.com/node/4088](http://web.archive.org/web/20131010192838/http:/typophile.com/node/4088 \"http://typophile.com/node/4088\")\n\nThanks, Terence\n\n",
  "author": "canus",
  "time": "9 Dec 2006 — 5:27am",
  "uid": "8433",
  "comments": [
    {
      "time": "9 Dec 2006 — 8:11am",
      "content": "IIRC Dwiggins's [Electra](http://web.archive.org/web/20131010192838/http:/www.typophile.com/wiki/Electra)\\* had a sloped roman first but the powers didn't think it would fly. I'd bet if you dug deep enough you'd find many designers trying there hand at a sloped roman in that day.\n\n\\*I'll go diggin later to see if I can find my notes on Electra.\n\n"
    },
    {
      "time": "9 Dec 2006 — 8:31am",
      "content": "Tiffany, I'll defer to your superior knowledge of Dwiggins any day, but I thought that Electra was originally released with a sloped roman!?\n\nThen, or later, a new type was made, which was true italic in nature, and this was named Cursive. The current digital incarnation of Electra just has the Cursive, and not the sloped Italic. [http://www.linotype.com/363/electra-family.html](http://web.archive.org/web/20131010192838/http:/www.linotype.com/363/electra-family.html \"http://www.linotype.com/363/electra-family.html\")\n\nDoes this ring any bells???\n\n"
    },
    {
      "time": "9 Dec 2006 — 9:26am",
      "content": "One impetus towards a \"sloped roman\" italic may have been Linotype duplexing, i.e. the need to have roman and italic fonts that were loaded at the same time, have the same character widths. This is perhaps why Optima had a sloped roman italic. Given his druthers Hermann Zapf, calligrapher that he is, would probably have opted for a \"true\" italic, as he has done fifty years later.\n\nHowever, despite the design logic of making your italic by sloping the roman, and not having to worry the widths are different, it's surprising there aren't more sloped roman italics from Linotype, just Bookman, Electra, and Memphis--and Bookman is a 19th century design.\n\n"
    },
    {
      "time": "9 Dec 2006 — 11:28am",
      "content": "Does anyone know what typographic manuals of the time taught about sloped-roman designs? I can't think of any book on type that I've read in the last few years that said much in favor of sloped-roman, if the same was true fifty and a hundred years ago, anyone with much knowledge on the subject may have already been too conditioned against the concept to accept it.\n\n"
    },
    {
      "time": "9 Dec 2006 — 1:01pm",
      "content": "You are right, Dan, and that is what I meant. When I said \"powers,\" I was referring to those who digitized it into what we have today.\n\n:^)\n\n"
    },
    {
      "time": "10 Dec 2006 — 8:14am",
      "content": "\"Stanley Morison [...] propose[d] the sloped roman as an alternative, because he wanted the ‘ideal italic’ to blend in better with its roman counter part\"\n\nIn his world, I'm not surprised. I'm surprised no one's suggested upright italics yet. ;)\n\nNick is right on; duplexing forced whole magazines of matrices, with each italic character twinned to the width of its Roman partner, on generations of designers. Pioneering designers proposed solutions, but when we see a past struggling with italic in technology and coming to the sloped conclusion, I do not think it should be taken as an opportunity missed. We are wired for a narrower, lighter, cursive italic in mixed use. The preference for this is ultimately shown in the design, or simple re-unitization of italic forms, taking over from all sloped attempts, no matter how bad, up to and beyond the time duplexing was even a requirement (See LaserWriter I, Times Roman, 1986). This wiring is also why we make most sans italic narrower, lighter and as cursive as we can without it appearing typographically Tourette-ish.\n\nWhen it comes to finding positive feedback from sloped Romans ((and I'm talking l.c. forms here — the rest being topologically more or less congruent), upright italics and sloped Romans should break our concentration in either the same way, or in opposite ways, but most sans italic, I think, are broken for the same reasons times two. Even if you narrow them considerably, and calligraphically shape them to the sweetest swells you can, those dead end stems on the baseline, and at the x-height make sans italic a chore.\n\nDwiggins! Had another problem with mechanical italics as well, that vexed us greatly when we went to de-mechanize them. Uppercase italic serifs want to cut through. They can't, so you can decide to cut them off, narrow the bodies or something else. Dwiggins chose to thicken and shorten, sometimes not and narrow the body instead, and sometimes to use combinations of modifications...and that's just Caledonia, which was a 12pt to 12pt re-mastering. I drew what I thought he wanted to do but couldn't and interpolated various versions in between, but in the end, the decision was that it wasn't Caledonia without abrupt differences in serif structures and I agreed. It got more complex, later in Eldorado, going from a mechanized 12pt design to a 60 pt digital design. But in a way it was easier, because the model I had by then was Dwiggins' hand drawn letters, which show his typographic ideals without mechanical limitation.\n\n"
    },
    {
      "time": "10 Dec 2006 — 8:49am",
      "content": "A couple of other examples of faces with more or less sloped romans for italics:\n\n[Vendôme](http://web.archive.org/web/20131010192838/http:/www.myfonts.com/fonts/urw/vendome/)\n\n[Trump Mediæval](http://web.archive.org/web/20131010192838/http:/www.myfonts.com/fonts/linotype/trump-mediaeval/)\n\n"
    },
    {
      "time": "10 Dec 2006 — 9:01am",
      "content": "\\>why (for example) the Romulus sloped roman was never successful and an Italic had to be designed.\n\nYou can read Walter Tracy's interesting survey and critique of Van Krimpen's work in his 'Letters of Credit'.\n\nThe sloped roman I think is too wide, and in any case neither Van Krimpen nor Morrison liked it. Maybe this experiment refuted the idea of sloped roman as superior, in the mind of Morrison.\n\nAn italic was never drawn. Instead, Van Krimpen went ahead with the plan, which was to have a formal script to match the roman, in addition to the sloped roman. This is the exquisite Cancelleresca Bastarda.\n\nIn the end, the script couldn't be easily set with the roman, and the sloped roman didn't look that good.\n\nSo I don't think Romulus--which also has a sans--was ever widely used. This is a pity, because the roman of Romulus is one of the most beautiful romans ever, and the script type is also beautiful. I have seen the types in books done by Van Krimpen and by Dreyfus, and they are just gorgeous. The original foundry metal has great optical sizing, done by the punch cutter.\n\nFrank Blokland at Dutch Type Library has been working on a Romulus for years. They have a showing at their web site, including optical sizes, but it doesn't seem to have been released, I don't know why. Personally I think that for Romulus to be a practical type for our times--and it thoroughly deserves to be--it needs a companion italic, which could be derived from the italic that Blokland has already done for Haarlemmer, plus the x-height characters in the script type.\n\nI don't know whether Romulus will be forever a rare and exquisite beauty, to be seen only rarely. I hope not.\n\nedit: comparing the Tracy showing with the one on the DTL web site, it seems that Blokland has narrowed the sloped Roman, and it is better than the original. Still, it would benefit from a proper italic IMHO.\n\n"
    },
    {
      "time": "10 Dec 2006 — 11:33am",
      "content": "_too conditioned against the concept_\n\nI think it's more practical than ideological. For the lower case of a serifed face, sloping the roman just doesn't provide enough opposition\\* with the roman.  \n\\*I would say \"contrast\", were it not for the specific typographic meaning of that word.\n\nThe problem is that in a serifed face, not all the strokes are vertical -- most of the serif strokes remain horizontal when the face is sloped, so something extra, in the way of alternate forms, is required. This situation doesn't exist in sans faces, which is why sloping is a viable form of \"opposition\".\n\nOld face and especially \"baroque\" styles (in Bringhurst's terminology), with their varied stem and stress angles, have the least consistent verticality of strokes, so require italics of most obviously different construction.\n\nThe modern genre (Didone) has the most consistently vertical stress in the roman, therefore slanting is quite clear as a means of opposing italic, so the letter forms don't need to be so different -- and neither does the width.\n\nThe same principle explains why italic capitals in serifed faces don't have a radically different form to roman caps -- more \"swashy\" as Adam would say -- because they don't need to; the linear horizontality which serifs provide the more rounded forms of the lower case is not a prominent feature of the capitals.\n\n"
    },
    {
      "time": "10 Dec 2006 — 2:26pm",
      "content": "Lovely analysis, Nick. Maybe the word you are looking for is 'differentiation' from the roman.\n\n"
    },
    {
      "time": "10 Dec 2006 — 8:28pm",
      "content": "Thanks Bill, differentiation it is.\n\n"
    },
    {
      "time": "11 Dec 2006 — 5:02am",
      "content": "If any of you can have a look at Oldrich Hlavsa'a \"A Book of Type and Design\" (very few published in English language, Tudor Publishing in NY, Peter Nevill in London, 1960) he has a couple of pages that look specifically at this concept of differentiation. Certainly a subject treated by many people, but I can't recall a better examination of the topic than Hlavsa's -- he takes a normal run of basal text and then creates the other mode with ital, sc, letterspacing, changes in weight, etc. A very instructive couple of pages.\n\nThis book is brimfull of great perceptions about design and the handling of type -- too bad it's so rare. Well worth the effort to find it in a local university library if you can.\n\n"
    },
    {
      "time": "11 Dec 2006 — 6:06am",
      "content": "Differentiation of italics within a block of text is the very telling test for normal usage. If we unbind the two and give italics a role of its own to play, would we still find the limits of sloped roman too restrictive and would the character of the more caligraphic true italic be the sought after quality anyway?  \nSome poetry feels better in all italic even though it may be easier to read in roman. Poetry is not meant for speed reading anyway. Italics in sidebars of magazines and in menus can give a less rigid almost spoken conotation--as do pulled quotes set in italics.\n\nChrisL\n\n"
    },
    {
      "time": "11 Dec 2006 — 12:59pm",
      "content": "Thank you for all your comments and your opinions on the subject of the sloped roman. I will try to find the different publications you have mentioned.\n\nMiss Tiffany if you will find find your notes on Electra I would be happy to read them.\n\nWiliam Berkson I didn't know the where digilising Romulus, so I will look at the DTL website (I went too there site once, but the price of the fonts scared me away until now).\n\n"
    },
    {
      "time": "11 Dec 2006 — 3:41pm",
      "content": "Miz Tiff is likely to have much more information on this than I, since my interests are more with aspects of WAD's life outside of type, but I can confirm what others have said above: Electra came out as standard issue in 1935 with roman and sloped roman, the sloped version called \"italic.\" Later, I think largely through the urgings of Griff, WAD developed the version that was named \"cursive.\"\n\nDwiggins certainly \\*wanted\\* the sloped roman to be the bee's knees, and when set on its own it does read really beautifully and more easily/fluidly than an equal passage set in cursive, but boy is it dreadful at distinguishing itself from the roman when they are set together in the same paragraph.\n\nSomeone mentioned above that Trump italic is another in this vein, but I would venture that the roman variant of Trump is enough darker in color than its companion italic, that those two are more easily distinguished from each other than are the two Electras. And the Trump italic has a different structure for the a. As is the case with the Electra italic, I think the Trump italic is gorgeous and find it can be read for long passages without fatigue -- unlike, say, Janson or Caslon Old Face which seem best at providing short blasts of alternative voice.\n\n"
    },
    {
      "time": "18 Aug 2010 — 10:33am",
      "content": "Anybody interested in this topic is welcome to attend my  \nTypeCon talk on Friday. And then proceed to beat me up.\n\nhhp\n\n"
    },
    {
      "time": "18 Aug 2010 — 1:56pm",
      "content": "Eventually, someone came up with the idea of casting italic type on a slanted body but, up until that time, italic type occupied the same rectilinear space as Roman. Thus, certain conventions arose in order to \"fill the square\": witness the Ibis Italic used in this thread's heading. The \"perky tail\" serifs effectively fill the square, allowing for a tight set. Conventions get ingrained; old habits are hard to kick.\n\n"
    },
    {
      "time": "20 Aug 2010 — 5:56pm",
      "content": "David Berlows' comments (and several others above) on the reasoning and attempts, in the past (hot metal days), for 'sloped romans' is absolutely correct. Typefaces were constructed to fit within the limitations and matrix of the printing press. All types of experiments and techniques were developed over time. Some successful, some not.\n\nI can tell you from experience, that working at Mergenthaler Linotype, back in the mid 70s, and trying to create beautiful typography was not an easy task. In 'photo lettering' days, we had an 18-unit grid system ( later increased to 54-units) to work within. And it was extremely restrictive. Especially for making beautiful cursive italics. If the letter form had a large overhang, or cut-through, the letter had to be redrawn (I call it distorted) to fit within the window of the device for printing. And if the overhang occurred on the left side, the entire font lost one whole unit on the right, restricting the width of letters even more. This placed awful limitations on the overall design of the typeface. And you would think that when the technology advanced and changed they would have gone back and reworked the design for the new device, but for the most part, the 'bad designs' were just brought over, as is, to laser, digital and finally Postscript.\n\nAs principal type designer, at Linotype-Hell, I tried to make a case for reworking the old designs, but was told that would never happen, because everyone in the business wanted backward compatibility. Unit widths had to remain the same. So, with the new developmental work everything looks good, but, unfortunately we are stuck with a lot of old stuff.\n\nAs an aside, I happen to like the idea of a sloped roman. Matthew Carter created the idea for a sloped roman which he called 'caption' for, I believe, some work that he did for National Geographic in the late 70s. I do not remember all the details.\n\nBut, I thought it was a clever idea, and incorporated a 'caption' style in the revised and expanded work that I did on Ruzicka's Fairfield font family series.\n\nThe reasoning was this... a true cursive italic is much too different in overall appearance (and color) from the roman to work well in certain situations. An example would be that if you wanted to use a slightly different style, under a caption (picture) in a magazine article, the italic would appear too visually disruptive in long lines of copy. But, a slanted roman, or caption, with less of an angle than the true italic, with body and stem proportions closer to the roman, would appear different enough to make one see that something was different and draw the eye to the copy, without appearing too different on the overall page.\n\nAnyway, this was the thinking. And I happen to agree that it does work well.\n\nI have seen Fairfield caption fonts used successfully, in many magazines, utilizing this technique.\n\nIn fact, I'm incorporating the 'caption' concept in a new font release shortly.\n\nI would be curious to hear other's point-of-view on this subject as well.\n\n"
    },
    {
      "time": "18 Dec 2011 — 10:58am",
      "content": "Related:  \n [http://typophile.com/node/60506](http://web.archive.org/web/20131010192838/http:/typophile.com/node/60506 \"http://typophile.com/node/60506\")\n\nhhp\n\n"
    }
  ]
}
