{
  "id": "29995",
  "title": "Testing fonts : Windows",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Please take pity on this poor Mac guy. I want to do a good job testing on Windows. What configurations are needed to do a good job? I am guessing that I need certain OS’ ( Vista+Xp no?) & certain apps ( Indesign, Quark Word no? ) to test in. What do you think? Obviously intended use plays a role too - screen fonts vs. those for print etc. For now I am thinking specifically of print. Extra points for:\n\n- testing models that may fall short of the ideal while still doing solid job!  \n- dealing with anything new & relevant resulting from the Vista OS  \n- Windows centric type utlities\n\n",
  "author": "<a href=\"user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": " 9 December, 2006 - 8:40am",
      "content": "I didn’t really read your earlier Linux thread, but testing platforms really depend on the type of fonts your making (any complex script fonts?) and the type of customer (regualr user, graphic designer, ISV, OEM…)\n\n"
    },
    {
      "time": " 9 December, 2006 - 11:50am",
      "content": "I thought that the FontLab presentation by Phinney and Twardoch at Typecon ‘06 was very interesting. They spent some time describing the process for naming font families so that they appear as expected in Windows applications. The reason I mention this, is because style-linking and family naming seem to be major causes of font defects on Windows. Even when fonts are functioning as intended some users may be confused/annoyed by style-linking. For example in Word, there is no easy way to tell if you’re using a real face or simply styling the text.\n\nThe easy solution, of course is to make sure you’re testing with applications customers use. Also, it is good to have an open chanel of communication back from customers. Many users will blame the application first. It may take several users before someone realizes that the font itself is defective.\n\n"
    }
  ]
}
