{
  "id": "29994",
  "title": "which wordmark works best?",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Please help me decide between these three versions. Any criticism would be greatly appreciated also.\n\nVersion #1 is the initial concept, with the wordmark letter shapes intending to resemble carabiners. The triangular shape proved a bit too awkward to work with however, and thus version #2 was conceived. To add a little humanist aesthetic and visual interest, the horizontals of the wordmark were slightly thinned for version #3.\n\nI am worried that the initial concept might have been lost throughout this process of refinement (was it even obvious in the first place?).\n\nMEC stands for Mountain Equipment Co-op. For those not in the know, they're Canada's largest outdoor gear retailer.\n\nThanks!\n\n ![](http://web.archive.org/web/20131021023433im_/http:/typophile.com/files/mec-typophile001_5416.png)\n\n",
  "author": "zalmoxe",
  "time": "8 Dec 2006 — 9:29pm",
  "uid": "9340",
  "comments": [
    {
      "time": "9 Dec 2006 — 1:16am",
      "content": "I prefer version 2, but I find the mountain icon a little ambiguous it could be mistaken for a hat, maybe having the peaks at different heights could help, the radius of the corners seems a bit too much, you could introduce the carabiner theme by using an open carabiner as a lowercase e, you needn't change the shape of the sides of the character. I also feel that with the counters being so closed your kerning could almost be equal spaces.  \nTim\n\n"
    },
    {
      "time": "9 Dec 2006 — 9:00am",
      "content": "I also vote for #2. #3 looks a little over designed; the letterforms have an overwrought technical feel that seems very 1999 while #2 takes itself less seriously which I find more appropriate for the subject.\n\nI think the problem in the mountains is the size of the curve in the middle—it disappears at small sizes and the concept is dead on, but at larger sizes there's something going on between the two peaks and that big negative space that doesn't work so well.\n\n"
    },
    {
      "time": "9 Dec 2006 — 7:04pm",
      "content": "Thanks for the feedback and suggestions, **timd** and **jpad**!\n\nI have incorporated **timd**'s suggestion regarding the E and you can see it in action below, next to a rendering of the original. What do you guys think? I've also made the kerning equal between the letters.\n\nI've also tried a few quick comps with the peaks at different heights, but that didn't go too well. I've also played around with the curves a bit, with similarly discouraging results.\n\nI'm not sure what else I can do about the peaks. I would like to keep them symmetrical, since they form the negative shape of the letter M (with stems slightly apart). At the same time, I feel the symmetry does look a bit static and boring and not exactly representative of the excitement of outdoor activities.\n\n ![](http://web.archive.org/web/20131021023433im_/http:/typophile.com/files/mec-typophile004_5934.png)\n\n"
    },
    {
      "time": "9 Dec 2006 — 9:40pm",
      "content": "The way you can make the type match the icon is make the ends round. That would help to lose the mechanical feel.\n\n ![](http://web.archive.org/web/20131021023433im_/http:/typophile.com/files/mec_6159.gif)\n\n"
    },
    {
      "time": "10 Dec 2006 — 6:45am",
      "content": " **cannon46-** Thank you for the suggestion and taking the time to mock it up.\n\nGood point about the endings. I had tried the rounded endings as well during my earlier process, but I wasn't entirely happy with the results. They made the counters too tight for my liking and made the letters a tad too predictable. I think I like the rectangular endings more as they create a little bit of variation between the rounded corners and the sharp edges.\n\nI would be happy to hear other opinions on **cannon46**'s suggestion, however.\n\n"
    },
    {
      "time": "11 Dec 2006 — 4:48am",
      "content": "I would agree with _cannon46_’s suggestion, yet I can see why you weren’t happy with the rounded ends interfering with the counters. I’m not going to mock it up, but could you just reduce the length of the smaller stems?\n\n"
    },
    {
      "time": "11 Dec 2006 — 7:00am",
      "content": "Or try rounding the corners rather than the whole terminal.\n\nTim\n\n"
    },
    {
      "time": "12 Dec 2006 — 5:46am",
      "content": "Here is another approach. Make the letters more bold and compressed. Be less obvious with your letterforms so it can be less distracting. The icon and the type shouldn't battle for supremacy.\n\n ![](http://web.archive.org/web/20131021023433im_/http:/typophile.com/files/mec_4069.gif)\n\n"
    },
    {
      "time": "12 Dec 2006 — 6:37am",
      "content": "I like the simplified 'M' of cannon's example and the more interesting 'e' from 2.2\n\nAs for the mark, it doesn't 'scream' mountains to me, but as an abstraction, I think it works fine.\n\nI think I also prefer the squared ends rather than the rounded ones, even though they contrast with the mark.\n\n"
    },
    {
      "time": "12 Dec 2006 — 9:15pm",
      "content": "2.3 with rounded ends\n\n----------  \n**Paul Ducco**  \n [Design, Melbourne](http://web.archive.org/web/20131021023433/http:/www.solid-creative.com/print.htm)  \n----------  \n [Little Mischief](http://web.archive.org/web/20131021023433/http:/www.littlemischief.com/)\n\n"
    },
    {
      "time": "13 Dec 2006 — 7:53am",
      "content": "<cite>2.3 with rounded ends</cite>\n\nAgreed.\n\n"
    },
    {
      "time": "13 Dec 2006 — 11:43am",
      "content": "Go for 2.2, the e looks like a climbing carabiner\n\nHéctor\n\n"
    },
    {
      "time": "14 Dec 2006 — 10:38am",
      "content": "Thank you all for the feedback so far, I really appreciate it.\n\nBased on the comments received, it seemed to be a tie between 2.2 and 2.3. I really like 2.2 because it does indeed resemble a climbing carabiner more than anything else, but in the end I think I'll end up going with 2.3 for legibility's sake (I've had a comment from a non-designer that the 'e' in 2.2 doesn't look like an 'e' because of its open counter).\n\nI've done some more renditions based on the comments received. 2.3.1 is a variation of 2.3 with rounded corners. I took **timd**'s suggestion into account and rounded just the corners rather than the whole terminals. 2.3.2 and 2.3.3 are based on **cannon46**'s suggestion to compress the text (I did keep the old shapes however).\n\nI'm not sure whether I find any of these new variations more effective than the old ones, but I'm always eager to hear what other people think.\n\n ![](http://web.archive.org/web/20131021023433im_/http:/typophile.com/files/mec-typophile005_4360.png)\n\n"
    },
    {
      "time": "14 Dec 2006 — 11:13am",
      "content": "Your logo reminded me of Nike-ACG brand. It uses a very simple abstract shape as the icon. I think their lettering has a similar look to what you are going for.\n\nThe reason I posted it is because they use clean type that has character, but it doesn't have the 80's robotic look. Angling your ends may be a good look.\n\n ![](http://web.archive.org/web/20131021023433im_/http:/typophile.com/files/brand_4808.gif)\n\n"
    },
    {
      "time": "14 Dec 2006 — 11:34am",
      "content": "Haha... does it really have an 80's robotic look? Definitely not what I was going for, though kinda interesting too, heh.\n\nThanks for posting that logo, the angled terminals might be something to try out.\n\n"
    },
    {
      "time": "14 Dec 2006 — 1:18pm",
      "content": "It definitely has an 80's robotic look. If you were building or fixing computers I would say you have struck gold.\n\nBelow is a font from t26 called Ambex ( [http://www.t26.com/fonts/display.php?f\\_id=819](http://web.archive.org/web/20131021023433/http:/www.t26.com/fonts/display.php?f_id=819 \"http://www.t26.com/fonts/display.php?f\\_id=819\")). I played with it in photoshop and rounded corners. It might be too thick, but you get what I am saying. It fits better with the icon and has an athletic, strong masculine feel.\n\n ![](http://web.archive.org/web/20131021023433im_/http:/typophile.com/files/mec_3733.gif)\n\n"
    }
  ]
}
