{
  "id": "29991",
  "title": "Font suggestions for newspapers",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m working on a cosmetic redesign of the Martlet, the student paper for the University of Victoria, and I’m having trouble coming up with a good font combo for headlines and body text.\n\nCurrently, we use ITC Slimbach for headlines and Warnock for body text. We’ve used Warnock for the last three years, but we’ve used Slimback, Baskerville, and Rotis Serif for headline fonts as well. Before that, we used Caslon Book for everything, and in the years before that it was Stone Sans for everything.\n\nMy main goal for choosing a new font is to replace Slimbach. I chose to use it when I started this year, but I’m no longer happy with it. I want something that is a bit stronger and a bit more modern, but that isn’t too forceful and bold. Any suggestions? So far, I’m considering Cronos, Goodchild (by Nick Shinn), Laurentian (by Rod Macdonald), and Chapparal. We are an alternative student paper, so I’d like a font that reflects that by being a bit different and having suble little touches.\n\nA secondary goal is to use Canadian type, since we are a Canadian newspaper. I’ve contacted Nick Shinn and Rod Macdonald through email, and they recommended me some fonts to use (Goodchild and Laurentian, for example). I looked at Canadian type foundaries such as 2Rebel and Canada Type, but I didn’t see anything there that I felt was suitable.\n\nThird goal is to find a new body type that both prints well on newsprint and goes with the new headline font. This can’t really be decided upon until the headline font is decided, though. Of course, I don’t want to fix something if it’s not broken. I’m not happy with Slimbach, but I don’t mind Warnock at all. If it’ll still work with the headline font then I don’t mind keeping it. Some of the body types I’ve considered are Laurentian, Minion, Mercury, Nobel, Parable, Lexicon and Linoletter.\n\n[Here’s a sample page](http://web.archive.org/web/20080921155741/http:/www.martlet.ca/special/martlet.pdf) so you can see what the Martlet looks like now.\n\nAll ideas/suggestions/critiques are welcome, of course.\n\n [‹ Seeking constructive input](http://web.archive.org/web/20080921155741/http:/typophile.com/node/29926 \"Go to previous forum topic\") [Type Design 101 ›](http://web.archive.org/web/20080921155741/http:/typophile.com/node/29959 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080921155741/http://typophile.com/user/15522\" title=\"View user profile.\">smasuch</a>",
  "time": "<br>",
  "uid": "15522",
  "comments": [
    {
      "time": " 8.Dec.2006 6.03pm",
      "content": "Why “cosmetic” ?  \nDoes that mean to have a custom typeface ?\n\n"
    },
    {
      "time": " 8.Dec.2006 6.22pm",
      "content": "I mean “cosmetic” as in I’m just changing the fonts and how the cover is laid out, there aren’t major changes planned for the editorial, the types of stories covered, the number of columns, etc. The structure will stay the same.\n\n"
    },
    {
      "time": " 8.Dec.2006 6.54pm",
      "content": "Just a few off the cuff thoughts...\n\nLinoletter and Minion don’t seem right to me for Martlett.\n\nI really like Mercury and have been eying it for quite a while. I’d suggest checking it out in action. I know the Spokesman Review in Spokane, Washington uses it.\n\nNot sure why you’d want to use Nobel for extended reading, but I’ve seen it work well in sidebars and glance boxes. Perhaps it could be incorporated as secondary text.\n\n"
    },
    {
      "time": " 8.Dec.2006 6.55pm",
      "content": "[Storm suggestions.](http://web.archive.org/web/20080921155741/http:/www.stormtype.com/typefaces-fonts-shop/comparator.php?config=48:645:659:662:343:346:590:591:595&txc=0,0,0&bgc=255,255,255&size=14&li=A+universal+typeface+for+books,+%0D%0Amagazines+and+newspapers+must+be+%0D%0Aeconomizing,+quiet,+strong+in+%0D%0Adrawing,+but+original+and+peaceful+at+%0D%0Athe+same+time.&id=52) Andulka, Comenia, and Lido (free) are worth considering. Not from Canada, but Czechoslovakia starts with a C at least.\n\n"
    },
    {
      "time": " 8.Dec.2006 6.55pm",
      "content": "Also, I really like your idea of going with Canadian type. I really like Nick Shinn’s work so I don’t think you could go wrong there.\n\n"
    },
    {
      "time": " 8.Dec.2006 7.23pm",
      "content": "Goodchild is nice, and it has a display weight.\n\nCartier is really handsome in display sizes.\n\n"
    },
    {
      "time": " 11.Dec.2006 11.01am",
      "content": "There is a definite hierarchy to the elements in a newspaper’s design. Be careful before changing things too much, because you threaten to undermine the stability of the entire works.\n\nThe body copy comprises the bulk of the paper and as such it forms the main identity of the paper. Even though most people can’t tell the difference between Warnock and Bodoni, they still <cite>feel</cite> the difference. Changing the body copy will completely change the feel of the paper to a huge extent, more so than changing the headlines. Because of its importance, changing the body copy to better complement a new headline typeface is backwards.\n\nBut as to headlines, here are a few things to think about:\n\nITC Slimbach is a slightly condensed serif, which is a very good thing for headlines. It’s hard to find a decent condensed serif that doesn’t look squished. If you are to replace it with another serif, keep an eye out for typefaces with a decent condensed weight.\n\nDo you use other typefaces for decks or sub-heads? I notice that you use Slimbach medium for all display use. Maybe slipping in a complementary sans for subheads and decks would add enough change? Your photo credits use Officina Sans. It has a much larger weight range than ITC Slimbach. Have you considered increasing its use, especially since you already have the license?\n\nThe reason I suggest subtle changes is that there was a reason you chose the use ITC Slimbach to begin with. What was that reason? My guess is that the reason is still valid, but you’re fighting for more options and diversity in the designs. Instead of replacing it altogether, sometimes just opening up the style guide a little makes huge difference. And it can also help organize the page hierarchy more clearly, a very nice bonus.\n\nFor good Canadian type that might work well in newsprint, check out RTF Dokument or RTF Credo.\n\n"
    },
    {
      "time": " 11.Dec.2006 1.03pm",
      "content": "Thanks for the feedback, everyone.\n\nseventy7: I mentioned Linoletter, Nobel, and Minion just because they had caught my eye when I was looking through type catalogues. When I tried them out, Linoletter didn’t fit, but Minion might work. I don’t have Mercury on hand, so I can’t try it out to find out for sure.\n\nlondontype: Thanks for the suggestions, but I don’t think Lido fits with what I’m going for since it looks so much like Times. I’ll download it and try it out, though.\n\nJohn: Goodchild is nice, but the version of Cartier I found ( [http://www.fonts.com/FindFonts/detail.htm?pid=203132](http://web.archive.org/web/20080921155741/http:/www.fonts.com/FindFonts/detail.htm?pid=203132 \"http://www.fonts.com/FindFonts/detail.htm?pid=203132\")) looks a bit too distressed for headlines.\n\nDanGayle: You have a very good point about the importance of body copy, and I guess I hadn’t considered the impact of possible changes enough. The headline font has changed every year, but Warnock has been the body copy typeface for over going on three years now. Like I said, I certainly don’t want to fix something that isn’t broken, and I don’t think Warnock really is broken. But I do really want to change away from Slimbach, and I was concerned that the new headline font I chose wouldn’t work with Warnock.\n\nI originally choose Slimbach based on just browsing through the Adobe FontFolio when I was preparing an example paper for my job application. I liked it then because it was bold, but not overpowering, and it had some personality to it with the calligraphic touches. But as I’ve been working with it over the past eight months, it’s started to look more dated and too weak. Maybe it’s just the same effect as looking at a single word for too long: you notice the letters gradually, exaggerate them, and eventually the word doesn’t even make sense anymore.\n\nI am fighting for more options and diversity, but I’d also like to bring more of a sense of strength and seriousness to the page, but not have it be overpowering. Also, I may just be overthinking things.\n\nAs for using Officina Sans for headlines, I think that at display sizes it starts looking too rounded and even a little bit like marker writing.\n\nRod McDonald sent me his new Slate Condensed typeface, and I think it’s pretty close to what I’m looking for. It’s solid without being overpowering, and it’s Canadian. I’ve only been able to get four staff to comment on it so far today, but they all seem to like it.\n\nHere’s links to versions of the pages with different font combinations. These are still tests, so any letterspacing or other fine adjustments aren’t final.\n\n[Chapparal & Warnock](http://web.archive.org/web/20080921155741/http:/martlet.ca/special/tests/chapparal&warnock.pdf)  \n [Cronos & Warnock](http://web.archive.org/web/20080921155741/http:/martlet.ca/special/tests/cronos&warnock.pdf)  \n [Goodchild & Warnock](http://web.archive.org/web/20080921155741/http:/martlet.ca/special/tests/goodchild-b&warnock.indd.pdf)  \n [Laurentian & Warnock](http://web.archive.org/web/20080921155741/http:/martlet.ca/special/tests/laurentian&warnock.pdf)  \n [Officina & Warnock](http://web.archive.org/web/20080921155741/http:/martlet.ca/special/tests/officina&warnock.pdf)  \n [Slate & Warnock](http://web.archive.org/web/20080921155741/http:/martlet.ca/special/tests/slate&warnock.pdf) (my current favorite)  \n [Slimback & Warnock](http://web.archive.org/web/20080921155741/http:/martlet.ca/special/tests/slimbach&warnock.pdf)  \n [Slimback & Goodchild](http://web.archive.org/web/20080921155741/http:/martlet.ca/special/tests/slimbach&goodchild.pdf)  \n [Slimback & Calisto](http://web.archive.org/web/20080921155741/http:/martlet.ca/special/tests/slimbach&calisto.pdf)  \n [Slimback & Minion](http://web.archive.org/web/20080921155741/http:/martlet.ca/special/tests/slimbach&minion.pdf)\n\n"
    },
    {
      "time": " 11.Dec.2006 2.06pm",
      "content": "Slate looks great for your page, but do all of your headlines require the same weight? And do your decks need to be the same typeface as the main headline?\n\nSince the page folio is set in ITC Slimbach I wouldn’t change it. That’s really tempting the fates when you get into messing with page navigation. You could also keep Slimbach for use in photo captions and sidebars and things just to keep some kind on continuity with previous designs of this year. Continuity is very important when trying to establish a publication’s identity.\n\n<cite>Also, I may just be overthinking things.</cite>  \nBingo. Just because you’ve been staring the typeface eye-to-eye daily for eight months doesn’t mean that everyone else has. Most readers are not in the same contact with it as the designer. That’s why I caution large or dramatic changes. If you do overhaul things, do it slowly, bit by bit. That way your redesign will be more transparent to your readers.\n\n"
    },
    {
      "time": " 11.Dec.2006 2.43pm",
      "content": "I was thinking of Cartier Book, MacDonald’s reworking.\n\nSee [here.](http://web.archive.org/web/20080921155741/http:/www.fonts.com/findfonts/_tryfont.htm?Pid=428162&ProductNo=OPP018285&SiteID=ODBS&SourceFoundry=Monotype+Imaging&productname=Cartier+Book+Pro+Regular)\n\n"
    },
    {
      "time": " 11.Dec.2006 3.01pm",
      "content": "Most of our headlines do differ, that’s just a bad example. [Here’s a version](http://web.archive.org/web/20080921155741/http:/martlet.ca/special/tests/slate-c-b&warnock.pdf) with different sizes, and with subheads set in Slate Condensed Regular instead of Bold.\n\nIf I’m not going to be using Slimbach for headlines, then I’d prefer to eliminate it entirely for consistency’s sake.\n\nYou also have a good point about continuity, which is making me more and more reluctant to change the body copy from Warnock. But the Martlet often undergoes a lot of changes; there’s usually a mostly-new staff each year, along with a new look, and a new group of students who have never seen the paper before. In four months, the whole thing might change again when the next production co-ordinator joins on. So the identity of the Martlet is often in a bit of flux, and depends more on the editorial purpose and goals.\n\nThis does give a good oppportunity for experimentation with design and layout, which is what I’d like to take advantage of. The past production co-ordinators have all, except for one, put in their end-of-year reports that they regret not experimenting more with the look of the paper. Of course, even if I don’t end up changing things in the final product, then at least I’ll have looked at the alternatives and learned stuff, which is the whole point.\n\n"
    },
    {
      "time": " 11.Dec.2006 3.46pm",
      "content": "Well, if there is a place where you can hack away at a newspaper’s design without recourse, it certainly is a college newspaper. You’d never get away with it at a large commercial paper, so why not experiment?\n\nThe cool thing for me was that by the end of working as the design director for my school paper I understood <cite>why</cite> certain things are the way they are in a paper. Things I never would have thought about had I not had the opportunity.\n\nSo have fun :)\n\n"
    },
    {
      "time": " 11.Dec.2006 7.40pm",
      "content": "[http://www.ms-studio.com/FontSales/proximasans.html](http://web.archive.org/web/20080921155741/http:/www.ms-studio.com/FontSales/proximasans.html \"http://www.ms-studio.com/FontSales/proximasans.html\")\n\ni’d recommend proxima sans for the body text. it’s larger x-height makes it ideal for newspapers. as far as a title text, i’d contrast with a nice serif maybe a garamond or adobe jenson.\n\nbest of luck.\n\n"
    },
    {
      "time": " 11.Dec.2006 7.43pm",
      "content": "oh, and [http://www.ms-studio.com/FontSales/proximanova.html](http://web.archive.org/web/20080921155741/http:/www.ms-studio.com/FontSales/proximanova.html \"http://www.ms-studio.com/FontSales/proximanova.html\")\n\neither one works.\n\n"
    }
  ]
}
