{
  "id": "300",
  "title": "How can i make my fonts \"embeddable\" ...?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "i am using some self-designed bitmap typefaces in   \na html-based website. my intention is to have the   \nfonts available in the site by using microsoft   \nweft (font embedding tool for web) technology.   \nit generates compressed font objects (.eot) from   \nthe original type-files and uploads them to the   \nserver with the website.   \n   \nbefore generating the font objects, weft makes a   \nlist of fonts used on the site, and shows some   \nattributes of these fonts. the fonts i designed   \nare classified as \"not-embeddable\", and the   \nsoftware can't make font objects out of them.   \n   \ni used fontographer 4.1 (pc) to generate the   \nfonts. i couldn\n\n",
  "author": "Gustavo Ferreira",
  "time": "6 Jun 2003 — 12:35pm",
  "uid": "1295",
  "comments": [
    {
      "time": "6 Jun 2003 — 12:47pm",
      "content": "Fontlab? :-)\n\n"
    },
    {
      "time": "6 Jun 2003 — 2:05pm",
      "content": "Fontographer has a long standing bug that incorrectly sets the fstype selection field bits. Different software interprets the mangled result in different ways, and it is possible that Weft prevents embedding of such fonts. Your best bet is to get a copy of [FontLab or TypeTool](http://web.archive.org/web/20131010233504/http:/www.fontlab.com/), but you may also be able to correctly set the fstype selection field using [FontCreator](http://web.archive.org/web/20131010233504/http:/www.high-logic.com/fcp.html).\n\n"
    },
    {
      "time": "6 Jun 2003 — 4:44pm",
      "content": "thanks eduardo and john,   \n   \ni found out that it is possible to generate   \nembeddable fonts in fontographer by altering the   \nparameter in the \"os/2 embedding\" field.   \n   \ni just tested it, and it worked fine with weft.   \n   \nbtw, has anybody in this forum ever used weft...?   \n   \ng\\*\n\n"
    },
    {
      "time": "8 Jun 2003 — 11:31am",
      "content": "If I recall correctly, WEFT will only work on Internet Explorer for Windows.\n\n"
    }
  ]
}
