{
  "id": "30003",
  "title": "Ampersand in small-caps: uppercase or small-cap?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi,\n\nI'm wondering: should the ampersand be considered as a lowercase or an uppercase letter/punctuation? I'm asking this because I'm not sure I should make this letter a c2sc or an automatic smcp from the original ampersand.\n\nI tried applying some kind of logic to it but there's always some conflict. How is it dealt with normally? Is there some kind of rule or whatever?\n\n",
  "author": "Pierre-Luc Auclair",
  "time": "9 Dec 2006 — 12:38pm",
  "uid": "8675",
  "comments": [
    {
      "time": "9 Dec 2006 — 12:43pm",
      "content": "As a user, I'd like the Small Caps button to make my ampersand align with the lowercase small caps. I can always disable it if I want it at uppercase cap height.\n\n"
    },
    {
      "time": "9 Dec 2006 — 12:50pm",
      "content": "[Etymology](http://web.archive.org/web/20131019194111/http:/www.etymonline.com/index.php?search=ampersand&searchmode=none) of the word _ampersand_.\n\nI would consider it lowercase as no sentence should begin with _and_.\n\n"
    },
    {
      "time": "9 Dec 2006 — 12:52pm",
      "content": "I would agree with Stephen.\n\n"
    },
    {
      "time": "9 Dec 2006 — 12:56pm",
      "content": "I usually use all small caps when I am using them. For this reason I agree with Stephen and Conor in that I wish the ampersand were aligned with the small caps. The same reasoning follows how I wish the figures and punctuation would align with small caps too.\n\n"
    },
    {
      "time": "9 Dec 2006 — 1:04pm",
      "content": "Makes sense indeed.\n\nHow about punctuation like @, $, %, £, ¥ and other that I've seen have small-cap variants in the Adobe Glyphlist?\n\nEdit: Seems Miss Tiffany answered my question before I asked it.\n\n"
    },
    {
      "time": "9 Dec 2006 — 1:05pm",
      "content": "I think you have to use your eyes & decide what you think is best. There is alot of variety of relevant detail between font designs. BTW - is this text setting or a heading? Or a logo? Still, I think I agree with Stephen in general. Perhaps you should post images showing the conflict.\n\n"
    },
    {
      "time": "9 Dec 2006 — 2:08pm",
      "content": "_I’m not sure I should make this letter a c2sc or an automatic smcp from the original ampersand._\n\nDon't include any ampersands in your smcp class. This will leave the default 0026 character as the \"(caps with) small caps\" glyph. Put the small-cap-height alternate in c2sc, which will activate it via the \"all small caps\" item in the OpenType menu.\n\n"
    },
    {
      "time": "9 Dec 2006 — 4:38pm",
      "content": "Another tasty tech tip! Thanks Nick!\n\n"
    },
    {
      "time": "9 Dec 2006 — 6:05pm",
      "content": "You're welcome. That strategy is the outcome of a recent thread here on which figure style to put in those two OpenType features, and if there is any clarity in my recommendation, we have Adam Twardoch to thank for it.\n\n"
    },
    {
      "time": "11 Dec 2006 — 8:51pm",
      "content": "\\> as no sentence should begin with and.\n\nDamn, and I thought God the Almighty at least knows English grammar. What’s with all those sentences that start with \"And\" in the Bible? (\"And the Spirit of God was hovering over the surface of the waters.\", \"And God saw that the light was good.\", \"And evening passed and morning came, marking the first day.\" etc.)\n\nA.\n\n"
    },
    {
      "time": "12 Dec 2006 — 1:00am",
      "content": "Fashion changes... We should stay flexible. And thats what I think.\n\n"
    },
    {
      "time": "12 Dec 2006 — 2:14am",
      "content": "\\> <cite>What’s with all those sentences that start with “And” in the Bible?</cite>  \nCapitalising “He” also pains me.\n\n\\> <cite>as no sentence should begin with and.</cite>  \nThat’s what I was taught in school.\n\n"
    },
    {
      "time": "12 Dec 2006 — 4:14am",
      "content": "\\>That's what I was taught in school.\n\nHere is what Fowler says in 'Modern English Usage':\n\n\"That it is a solicism to to begin a sentence with 'and' is a faintly lingering \\*superstition\\*. The OED gives examples ranging from the 10th to the 19th centuries; the Bible is full of them.\"\n\nThe superstition against beginning a sentence with 'and' is perpetuated by bad school teachers, who are as pedantic as they are ignorant. Ignore them.\n\n"
    },
    {
      "time": "12 Dec 2006 — 5:06am",
      "content": "Wow!\n\nInvestigated and got this [_link_](http://web.archive.org/web/20131019194111/http:/dictionary.reference.com/help/faq/language/g31.html) from **Dictionary.com**.\n\nI’ve been educated through Irish (Gaeilge) my whole life, if we spoke English in school we were punished. My education of the English language is quite “old school” rather than “bad school” — I sternly believe my teacher fits into the category described at the link above.\n\nWhile my education was more unusual than most in Ireland (i.e. through Irish), I’m pretty sure all Irish school children were taught English grammar in a similar way. Regardless of this, we have one of the top education systems in the world.\n\nPersonally, I find it disruptive, confusing and ugly when I see “And” beginning a sentence, however, I concede to its grammatical validity.\n\n"
    },
    {
      "time": "12 Dec 2006 — 5:59am",
      "content": "The dictionary.com statement contradicts every authoritative source I have seen on this issue. It is possible to find such wrong statements because this foolish idea is so common amongst poor teachers of English. I have already quoted an authoritative English source on this effort. Here is from an American one, the widely relied-upon 'Chicago Manual of Style':\n\n\"There is a widespread belief--one with no historical or grammatical foundation--that it is an error to begin a sentence with a conjunction such as 'and', 'but' or 'so'. In fact a substantial percentage (often as many as 10 percent) of the sentences in first-rate writing begin with conjunctions. It has been so for centuries, and even the most conservative grammarians have followed this practice.\"\n\nThey go on to quote a writer from 1938, whom they say \"fairly sums up the situation even today.\" He says, \"...no textbook supports it, but apparently about half of our teachers of English go out of their way to handicap their pupils by incalcating it. One cannot help wondering whether those who teach such a monstrous doctrine ever read any English themselves.\"\n\n"
    },
    {
      "time": "12 Dec 2006 — 8:22am",
      "content": "Let me emphasise again without, I hope, seeming brusque \\> _I concede to its grammatical validity._\n\nI am very grateful for the time you have spent illustrating your point _(the apparent truth)_, I can honestly say I have learnt something new and important. I spent most of my lunchtime convincing friends of the fact.\n\nTa.\n\nC\n\n"
    },
    {
      "time": "12 Dec 2006 — 9:38am",
      "content": "Thanks for your gracious reply, Conor.\n\nMy heat was, I hope you understand, directed not toward your entirely understandable belief, but toward teachers who mislead their students--and who often punish them for not doing the wrong thing. Writing well is difficult enough without artificial barriers being erected by those who should be helping.\n\n"
    },
    {
      "time": "12 Dec 2006 — 10:11am",
      "content": "I too was taught not to begin sentences with a conjunction, but it wasn't malevolent, ignorant, or short-sighted. They just wanted to teach one to use language with power and precision, and not be sloppy. Of course, teachers may come to see a beneficial practice as a universal obligation, and standards guardians are apt to become pedants -- but like many things one does in one's protected childhood, such as the range of substances deemed acceptable to ingest, there's more leeway for grown-ups with their sturdier constitutions.\n\nIt's an axiom of type design that If It's Possible They Will Do It, so we must be prepared for the collision of bands who decide their name should begin with an ampersand, and typographers who decide that editorial style will set band names in small caps. Strong stuff, indeed.\n\n"
    },
    {
      "time": "12 Dec 2006 — 10:40am",
      "content": "I'm of the camp that believes you **should not** begin a sentence with \"and.\" I was taught it this way: a sentence should be able to stand on its on as an individual thought or idea. When it begins with \"and\" the sentence is completing a previous thought or idea and therefore is not a complete sentence.\n\nAs has been pointed out, I think this rule can be broken when \"voice\" is taken into consideration. If a story is being written in first person, go nuts— but if I'm reading a corporate annual report written in third person it looks _wrong_.\n\nBack to ampersands...its best not to make people think too much about it. I'm not as much of a type scholar as many on this thread and I hadn't really thought of ampersands as anything but a \"caps\" thing. Crazy OpenType menus give me the willies. Keep it simple.\n\n"
    },
    {
      "time": "12 Dec 2006 — 11:01am",
      "content": "Type designers have the task of producing types that will be usable tools by those who purchase them. This does not mean that every user will use every glyph in a given font. It does not mean that type designers can stipulate which glyphs must be used and when. If we include a small caps ampersand or even the less used section glyph as small caps, we are just making something available for those who may need it. The user will decide and may decide badly in our eyes--none-the-less, it is their choice.\n\nChrisL\n\n"
    },
    {
      "time": "12 Dec 2006 — 11:48am",
      "content": "Nick, it's just not necessarily more precise or better. And Terry, even sentences that begin with 'And' can be and usually are gramatically complete sentences.\n\nI don't really want to argue this as every authority disagrees with you--I just checked two more.\n\nBut if you are so confident that it is always better to avoid an 'and' or 'but' try eliminating the beginning 'ands' and 'buts' in the following and by doing it improve them. If you improve them I will gladly concede your point.\n\nHere are those lame writers who worked for King James (reflecting the original Hebrew, which has all the 'ands' also):\n\n\"In the beginning God created the heaven and the earth. Now the earth was unformed and void, and darkness was upon the face of the deep; and the spirit of God hovered over the face of the waters. And God said: 'Let there be light.' And there was light. And God saw the light, that it was good; and God divided the light from the darkness. And God called the light Day, and the darkness He called Night. And there was evening and there was morning, one day.\"\n\nAnd here is that dabbler Lincoln starting with a 'but':\n\n\"Four score and seven years ago our fathers brought forth on this continent, a new nation, conceived in Liberty, and dedicated to the proposition that all men are created equal.\n\n\"Now we are engaged in a great civil war, testing whether that nation, or any nation so conceived and so dedicated, can long endure. We are met on a great battle-field of that war. We have come to dedicate a portion of that field, as a final resting place for those who here gave their lives that that nation might live. It is altogether fitting and proper that we should do this.\n\n\"But, in a larger sense, we can not dedicate -- we can not consecrate -- we can not hallow -- this ground. The brave men, living and dead, who struggled here, have consecrated it, far above our poor power to add or detract. ....\"\n\nAnd here is that fumbler Churchill, again starting with a 'but':\n\n\"I expect that the Battle of Britain is about to begin. Upon this battle depends the survival of Christian civilization. Upon it depends our own British life, and the long continuity of our institutions and our Empire. The whole fury and might of the enemy must very soon be turned on us. Hitler knows that he will have to break us in this Island or lose the war. If we can stand up to him, all Europe may be free and the life of the world may move forward into broad, sunlit uplands. But if we fail, then the whole world, including the United States, including all that we have known and cared for, will sink into the abyss of a new Dark Age made more sinister, and perhaps more protracted, by the lights of perverted science. Let us therefore brace ourselves to our duties, and so bear ourselves that, if the British Empire and its Commonwealth last for a thousand years, men will still say, 'This was their finest hour.'\"\n\nThese examples can be multiplied at will, both for the 'ands' and the 'buts', with every distinguished author you can name. But these three will keep you busy for quite a while trying to improve upon them ;)\n\nOh, and one more, a rather articulate fellow writing on type:\n\n\"Economics favor size, and digital culture has come to be dominated by a few companies--arbiters of taste--that rely on a handful of creatives for their content, which they spread worldwide at low margin. Individual purchasers are disinclined to commission local photographers or illustrators when they can get stock for far less. And why buy a contemporary typeface family when you can get Neue Helvetica, 51 fonts, for US$300? Not to mention all the free fonts that come with OS X.\"\n\nI would say that both the 'and' and the following incomplete sentence are excellent prose style. And maybe the writer, Nick Shinn, when he is not kissing the boots of his misguided teachers, would also agree :)\n\n"
    },
    {
      "time": "12 Dec 2006 — 12:23pm",
      "content": "I think the reason teachers ban 'and' at the start of the sentence is to prevent use of stub sentences: 'And we went to the beach' which really should be added to the prior sentence (or re-written entirely).\n\n"
    },
    {
      "time": "12 Dec 2006 — 12:36pm",
      "content": "And that's the name of that tune.\n\nChrisL\n\n"
    },
    {
      "time": "12 Dec 2006 — 12:47pm",
      "content": "I have presented this argument (without bias) to everyone I have encountered today, around fifteen people (I know it’s not a _huge_ amount), all Irish, ranging between 20 and 50 years old. All look scornfully at me and initially say it is _incorrect_ use of conjunctions. **But** when explained properly, using William’s well researched examples, they instantly observed that it _is correct_ in particular instances i.e. when making/resolving a point.\n\n"
    },
    {
      "time": "12 Dec 2006 — 12:48pm",
      "content": "Now back to the & everyone.\n\n"
    },
    {
      "time": "12 Dec 2006 — 12:49pm",
      "content": ";^)\n\n"
    },
    {
      "time": "12 Dec 2006 — 2:30pm",
      "content": "_And we went to the beach’ which really should be added to the prior sentence (or re-written entirely)._\n\nMy point exactly. I guess you missed the part where I said it depends on \"voice\" William, because you cited examples from speeches. As far as the Bible goes, you can change those in one of 3 ways:\n\n1) Simply delete the \"and\"s.  \n2) Make the \"and\"s part of the previous sentence using a semi-colon OR  \n3) Make the \"and\"s part of the previous sentence using an emdash.\n\nI don't like when we get into using the Bible or other holy texts as references in these matters, but it always seems to go there. As far as I'm concerned they should be off limits in these kinds of discussions, for many other reasons aside from typography and grammar.\n\nWilliam, I get your point— but sometimes I think you just like to read your own writing. Half a page to make your point? We get it.\n\n"
    },
    {
      "time": "12 Dec 2006 — 2:34pm",
      "content": "Bill, it's cool to be quoted alongside Churchill, Lincoln and the King James.  \nHowever, I still think that the teachers had it right.  \nThe word \"and\" at the beginning of a sentence has a number of different meanings compared to when used as a simple conjunction. \"Therefore\", \"consequently\", \"furthermore\", \"then (next),\" etc., as opposed to the simple \"in addition to\". Sure, it's not necessary to draw those distinctions if the meaning of the passage is clear to the reader, and the terse \"and\" makes for forceful expression. But doesn't it make sense to teach budding writers to shade their language and think more closely about how they're making their point, by using a variety of words with subtle distinctions of meaning, rather than a catch-all?\n\n"
    },
    {
      "time": "12 Dec 2006 — 2:48pm",
      "content": "Irrespective of what is 'correct' in my or anyone else's view I think it is supremely silly to try to enforce grammatical opinion through an Opentype feature because english is used in a huge variety of ways depending on education voice and intent. Why hamstring the writer?Which leads me to wonder - is it suffcient to say \"<cite> Don’t include any ampersands in your smcp class. This will leave the default 0026 character as the '(caps with) small caps' glyph. Put the small-cap-height alternate in c2sc, which will activate it via the “all small caps” item in the OpenType menu.</cite>\" and leave it at that? Or does this leave you on one side or the other vis a vis the gramarians? My reading is that this is safe. Anybody disagree?\n\n"
    },
    {
      "time": "12 Dec 2006 — 4:41pm",
      "content": "I would say put what the vast majority of users would expect in c2sc. Now, what is that? I would tend to think a small cap ampersand but am open to discussion. I don't think type designers should try to be grammar police. I think they should put the features in which make their type the most functional.\n\nChrisL\n\n"
    },
    {
      "time": "12 Dec 2006 — 5:25pm",
      "content": "Eben,\n\n\\> Irrespective of what is ‘correct’ in my or  \n\\> anyone else’s view I think it is supremely  \n\\> silly to try to enforce grammatical opinion  \n\\> through an Opentype feature because english  \n\\> is used in a huge variety of ways depending  \n\\> on education voice and intent.\n\nI agree with your point but I think there is a point that is far more important:\n\nIrrespective of what is ‘correct’ in someone’s view, I think it is supremely silly to try to enforce grammatical opinion in any language through an OpenType feature simply because fonts are used to set texts in dozens or even hundreds of languages (depending on the character set included in the font). Custom-tailoring a font to work only with German, French, Dutch, English, Czech or any other language is short-sighted.\n\nA.\n\n"
    },
    {
      "time": "12 Dec 2006 — 6:26pm",
      "content": "Excellent point! Although it's also true that you might better match a convention in another langauge - perhaps French for instance - because the conventions are stronger. But even then.... usage should be up the the user as long as it's doesn't go against the intent of your design. That why nearer to the top I was saying context will determine what looks best in the end no matter what a rule of thumb might (maybe) be.\n\n"
    },
    {
      "time": "12 Dec 2006 — 8:42pm",
      "content": "\\>I guess you missed the part where I said it depends on “voice” William\n\nNo, my Biblical example is not first person. And as the experts at Chicago Manual of Style note in my quote above, every kind of literature in English--including well-written reports (and Nick Shinn's writing)--has sentences beginning with conjunctions, as you can easily verify. (I won't bore you with more examples).\n\nYour suggestions as to how to improve the language of the opening of Genesis will all make it worse, IMHO. The use of the 'ands' here in a sequence of short sentences is key to the rhythm that gives the rhetoric its power.\n\nNick,\n\nI certainly think that teachers should teach different many different ways to make transitions between sentences. And they should explain how they can go wrong, what has better precision and power, etc. What you seemed to defend in your post of 2:11 is that it is advantageous to tell kids what is false--that you should never begin a sentence with a conjunction--and hold them to it as this false instruction is pedagogically good as a stepping stone to later adult practice. I don't agree. I think it is far better just to teach them how to do it right in the first place.\n\nIf teachers want to require various things as writing exercises, that is fine. But I don't see how teaching wrong rules as right ones is at all preferable.\n\n"
    },
    {
      "time": "12 Dec 2006 — 9:18pm",
      "content": "As with any language style question, here, the answer is simple: if you want to start a sentence with \"And\", do it wisely and consciously. Don't overuse it, since some people may feel that it does not fit into daily, practical use. But if you know what you're doing, do it.\n\nComputer programs that do automated grammar checking, spellchecking, hyphenation or typesetting should never try to be smarter than the user. A certain amount of aid and guidance is helpful, but software cannot assume that the user is mindless. And a type designer should not treat the font user as being a mindless ignorant.\n\nThe type designer may be the brick maker who creates the ingredients that shape the visible form of language but it is the writer who is the architect of the house, and it is the typographic designer who builds it.\n\nA.\n\n"
    },
    {
      "time": "13 Dec 2006 — 5:28am",
      "content": "\"The type designer may be the brick maker who creates the ingredients that shape the visible form of language but it is the writer who is the architect of the house, and it is the typographic designer who builds it.\"\n\nAbsolutely. And to the task at hand, we need only craft the best mould for our bricks.\n\nChrisL\n\n"
    },
    {
      "time": "13 Dec 2006 — 6:16am",
      "content": "\\>some people may feel that it does not fit into daily, practical use\n\nActually Adam, the bizarre thing is that nobody seems to mind or even notice the continual use of conjunctions at the beginning of sentences--including those who rail against it in theory. Some adults will passionately agree with this principle, but almost all ignore it in practice.\n\n"
    },
    {
      "time": "13 Dec 2006 — 8:13am",
      "content": "Bill, I don't really think we're disagreeing all that much. In fact, I would actually say we're largely in agreement. The term \"voice\" doesn't always have to refer to first person. You're waaaaaaay to literal sometimes. Again...not a fan of using the Bible as an example. I feel its a low blow. I wouldn't be so bold as to say what I wrote above was an improvement necessarily, just another way of writing it.\n\nRules can be broken...I wouldn't classifly the Bible as a dryly written annual report. Because of that IMHO, the two styles can't be fairly compared. When a document is rigidly written with little or no emotion or expression, beginning a sentence with \"and\" just _looks wrong_. This is more a matter of opinion than something that can be debated and supported with \"hard evidence.\"\n\nBill, I also find many of your arguments to be devoid of a crucial element. We're all human beings. We have emotions, we have feelings, and our actions are often visceral and come \"from the gut.\" Because you're a writer I'm often surprised by how much you seem to rely on others opinions in order to formulate your own. I'd like to know more about what \"Bill\" thinks.\n\n"
    },
    {
      "time": "13 Dec 2006 — 9:32am",
      "content": "\\>a dryly written annual report\n\nI agree that different styles call for different ways of handling transitions, but none that I know of call for a rule against starting a sentence with a conjunction.\n\nFor example here is an 'and' beginning a sentence in IBM's annual report of 2005:\n\n\"We’ve been seeing a transition in services over the past few years, a shift to smaller deals of shorter  \nduration. These are good opportunities—if you  \ncan recalibrate your sales model to capture them in  \naddition to the traditional “mega-deals.” And the  \nprofitability of these kinds of deals is very attractive,  \nif your global cost structure is competitive. We had  \nto address both our sales model and services cost  \nstructure last year, and we did so. ...\"\n\nNot the greatest writing, but it seems perfectly acceptable to me.\n\nAnd Terry, I won't take the bait on personal comments.\n\n"
    },
    {
      "time": "13 Dec 2006 — 10:13am",
      "content": "Unlike your posts in this thread (I think how you have used it looks and _feels_ appropriate) I think this example still looks and _feels_ wrong. Let's just agree to disagree. There can be no winner in an opinion based argument.\n\n_I won’t take the bait on personal comments._\n\nSome people perceive quoting the Bible or the Koran to claim something as \"correct\" to be personal as well. That's why I think they should be off limits— in that instance **I** shouldn't have taken the bait.\n\n"
    },
    {
      "time": "13 Dec 2006 — 10:27am",
      "content": "Terry, there was no bait and I wasn't quoting the beginning of Genesis with any reference to its content--true or false--but just for its rhetoric.\n\nThe King James Bible is recognized as an important landmark in and influence on English prose, and that's why I was quoting it--and I indicated so by refering to King James' translators when I introduced the quote.\n\n"
    },
    {
      "time": "13 Dec 2006 — 10:52am",
      "content": "..._And_ back to ampersands. Is there a \"most common\" or universally accepted way to access alternate ampersands in the OpenType features menu of InDesign or Quark?\n\n"
    },
    {
      "time": "13 Dec 2006 — 11:27am",
      "content": "In InD, you can use the glyph pallette or if a Stylistic set is involved, choose the set number. One of my pet peeves is that stylistic set numbers are all but worthless though so I am hoping some intelligeable substitute can be found. I posted a thread on this elsewhere so I won't bore you with it here.\n\nChrisL\n\n"
    },
    {
      "time": "13 Dec 2006 — 11:45am",
      "content": "The discussion on ampersands used with small caps which was going on (before the grammar digression) was about which ampersand to place with the selection of \"small caps\" as a style option. The differences of opinion came about when distinguishing between \"Caps to Small Caps\" (meaning all small caps) and simply \"Small Caps\" (meaning caps stay as caps and only lower case changes to small caps).\n\nChrisL\n\n"
    },
    {
      "time": "13 Dec 2006 — 3:19pm",
      "content": "[http://www.heliosmulti.com/images/sc-ampersand.png](http://web.archive.org/web/20131019194111/http:/www.heliosmulti.com/images/sc-ampersand.png \"http://www.heliosmulti.com/images/sc-ampersand.png\")\n\nPersonally I find #3 the \"nicest\", but I can see how putting it in the SMCP class makes it hard to use.\n\nBtw how do you make images show up? ![](http://web.archive.org/link) doesn't seem to work...\n\n"
    },
    {
      "time": "13 Dec 2006 — 3:29pm",
      "content": "Chris,\n\n“Caps to Small Caps” does not mean all small caps. Caps to Small Caps means caps to small caps :) \"All small caps\" is when both \"caps to small caps\" \\*and\\* \"lowercase to small caps\" are applied at the same time.\n\nAdam\n\n"
    },
    {
      "time": "13 Dec 2006 — 4:14pm",
      "content": "Right.  \nThe menu item \"all small caps\" in the InDesign OpenType menu actually applies two features at the same time.\n\n"
    },
    {
      "time": "13 Dec 2006 — 4:56pm",
      "content": "Sorry, my bad (at least the grammer thing is finally done though :-)\n\nChrisL\n\n"
    },
    {
      "time": "14 Dec 2006 — 10:22am",
      "content": "Since I botched the verbal description, I thought a visual woould be in order:\n\n ![](http://web.archive.org/web/20131019194111im_/http:/typophile.com/files/crateand_6500.png)\n\nWhich ampersand version for which setting? Not that all users would agree but the font should alow the user the choice.\n\nChrisL\n\n"
    },
    {
      "time": "14 Dec 2006 — 12:32pm",
      "content": "Perhaps there should also be a full cap-height ampersand for the first setting.\n\n"
    },
    {
      "time": "14 Dec 2006 — 4:01pm",
      "content": "Chris,\n\nthanks for your example, it very adequately illustrates that the standard \"uppercase\" ampersand should be replaced by a small-cap ampersand in the c2sc feature rather than smcp. This makes sense because ampersand has more of an \"uppercase\" nature than lowercase.\n\nA.\n\n"
    }
  ]
}
