{
  "id": "3000",
  "title": "Chromatic studio",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Typophiles, I need your assistance. I've decided to get a bit more serious about my freelance web design work, so I've decided dump the name and logo I was playing around with before. I'm looking for a distictive typeface to help develop an identity.   \n   \nI'm not planning on everything being married to the mark; I don't need a logo so much as a good typeface and consistent colors. Nevertheless, any critiques on positioning, size, etc. would be helpful.   \n   \nSo far, I've tried (in order) Morphica from Shinn Type, Luna Modern from PsyOps, and Reykjavik 2, D Weight from PsyOps. Tell me if they work, and feel free to recommend _any_ other typefaces.   \n   \n ![](http://web.archive.org/web/20141127072145im_/http:/www.typophile.com/forums/messages/29/25730.gif) ![](http://web.archive.org/web/20141127072145im_/http:/www.typophile.com/forums/messages/29/25731.gif) ![](http://web.archive.org/web/20141127072145im_/http:/www.typophile.com/forums/messages/29/25732.gif)\n\n",
  "author": "Daniel Poindexter",
  "time": "5 Feb 2004 — 5:17pm",
  "uid": "2619",
  "comments": [
    {
      "time": "5 Feb 2004 — 9:44pm",
      "content": "I like the first one.   \n   \nAnd please do your images vertically instead of horizontally, you have to scroll constantly that way.\n\n"
    },
    {
      "time": "6 Feb 2004 — 5:58am",
      "content": "i also like de first typeface, your image work i find it very confuze, it reminds me like heavymetals or anarchist bands isotype, like Sepultura or Mobid Angel. I think you should simplify it... ...your work is web design were simplicity is appreciate and complexity y avoided ;-)   \n   \nkeep on posting the changes   \n   \nCG\n\n"
    },
    {
      "time": "6 Feb 2004 — 8:27am",
      "content": "Sorry, I didn't realize the images wouldn't wrap naturally.   \n   \nI'm also leaning towards the first, but I'd still love to hear some suggestions for alternate faces. Which ones do you like? Which ones could you see attached to this sort of visual scheme? I've spent the last few days combing the internet, but I've only just scratched the surface.   \n   \nThe image: it's not supposed to be heavy metal, just abstract. I was hoping the vaguely floral colors and arrangement would contrast with the sharper edges to balance it out a little. Does anyone else have an opinion on this?\n\n"
    },
    {
      "time": "6 Feb 2004 — 9:38am",
      "content": "I like the complexity.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Feb 2004 — 9:54am",
      "content": "At the current size its interesting.   \n   \nWhats it look like at half-size?   \n   \nThat could be problematic. I'd simplify the shapes and keep the colors.   \n   \nI like 3 with simplified shapes.   \n   \nDo you do 3-d rendering, or animation? The complex mark is more appropriate for graphics-intensive fields.\n\n"
    },
    {
      "time": "6 Feb 2004 — 10:55am",
      "content": "The complexity of the mark is why I like the #1 typeface, however, the the mark is still a little more complex than the typeforms. Maybe use Morphica as your inspiration for the mark, rather than trying to find a font that works well with your mark. As you can see by the postings, thus far, Morphica seems to be a pretty good type selection, but there is a lot of concern about the mark.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "6 Feb 2004 — 4:58pm",
      "content": "\\<font class=\"dontLookLikeCrap\"\\>Not messing with the mark yet, but still narrowing down the type.   \n   \n1. Senator Bold, Emigre   \n ![](http://web.archive.org/web/20141127072145im_/http:/www.typophile.com/forums/messages/29/25876.gif)   \n2. Eunoia, Shinn Type   \n ![](http://web.archive.org/web/20141127072145im_/http:/www.typophile.com/forums/messages/29/25877.gif)   \n3. Preissig, Storm   \n ![](http://web.archive.org/web/20141127072145im_/http:/www.typophile.com/forums/messages/29/25878.gif)   \n4. Regula, Storm   \n ![](http://web.archive.org/web/20141127072145im_/http:/www.typophile.com/forums/messages/29/25879.gif)   \n5. Morphica AC, Shinn Type   \n ![](http://web.archive.org/web/20141127072145im_/http:/www.typophile.com/forums/messages/29/25880.gif)   \n6. Satisfaction, P-22   \n ![](http://web.archive.org/web/20141127072145im_/http:/www.typophile.com/forums/messages/29/25881.gif)\\</font\\>\n\n"
    },
    {
      "time": "6 Feb 2004 — 5:21pm",
      "content": "I think that Pressig matches the coloured mark almost perfectly. Satisfaction is next in the matching catagory. I reckon Pressig would be a good choice, because it seems to be rarely used for anything. I am willing to stand corrected if people know otherwise.   \n   \nkris.\n\n"
    },
    {
      "time": "6 Feb 2004 — 5:59pm",
      "content": "Eunoia and Morphica (lower case) work best I think.\n\n"
    },
    {
      "time": "6 Feb 2004 — 9:19pm",
      "content": "The Pressig is just ugly.   \n   \nSenator looks quite nice, however.\n\n"
    },
    {
      "time": "6 Feb 2004 — 11:25pm",
      "content": "i tend to like the softer forms of Reykjavik and   \nSatisfaction just because they stand in   \ncontrast to the more severe graphic elements   \nand give me a greater feeling of harmony when integrated with the design\n\n"
    },
    {
      "time": "6 Feb 2004 — 11:49pm",
      "content": "Loose the exploding violins.\n\n"
    },
    {
      "time": "8 Feb 2004 — 11:30am",
      "content": "Arg. For pretty much everything that's been said, someone else has said the exact opposite.   \n   \nAfter consideration, I've decided that the complexity of the mark isn't an issue. I don't have to worry about small size applications, because I'll simply remove it. Consistent colors and a strong typeface will work just as well in the identity department, and give me more flexibility in the long run. Thoughts on this?   \n   \nAs of now, I'm still leaning toward Morphica lowercase.\n\n"
    },
    {
      "time": "8 Feb 2004 — 11:49am",
      "content": "Did I type that?   \nlose\n\n"
    },
    {
      "time": "8 Feb 2004 — 12:09pm",
      "content": "I like Morphica lowercase too. I would decrease the tracking slightly.\n\n"
    },
    {
      "time": "8 Feb 2004 — 12:39pm",
      "content": "Sounds good. IMO, Morphica captures the character of the word, chromatic. It is also a typeface that has plenty of personality to stand alone, without the graphic. In fact, you don't need the graphic element to be part of the identity at all\n\n"
    },
    {
      "time": "10 Feb 2004 — 5:23am",
      "content": "Alright, I've purchased a license for Morphica, which gives me the ability to clean up tracking 'n stuff. Here's pretty close to final version:   \n   \n ![](http://web.archive.org/web/20141127072145im_/http:/www.typophile.com/forums/messages/29/26184.gif)   \n   \nI'm still open to new directions, but I'd also like a take on the kerning for this one.   \n   \nNote: the tagline on the bottom will pretty much only be on the business card.\n\n"
    },
    {
      "time": "10 Feb 2004 — 6:37am",
      "content": "Daniel I like your final version, but I liked it in the first place. I hope it brings you lots of work\n\n"
    },
    {
      "time": "10 Feb 2004 — 9:28am",
      "content": "I like it even better with the descriptive byline. At small scale the descriptor is likely to disappear in places, but for once I think that works really well. Morphica goes even better with the graphic element at this smaller scale because of its detail increases in complexity. The descriptor, combined with the bolder and simpler (at large scale) title, \"chromatic\" looks more like the graphic. The interior shapes of the graphic look a little more simple than the vibrant shapes that seem to be flaring out. In fact, I wonder what it would look like if the interior shapes and chromatic were the same color, while the outer, flaring shapes and the descriptor were similar varying colors\n\n"
    },
    {
      "time": "10 Feb 2004 — 12:47pm",
      "content": "Nice work. I love Morphica and I think your logo has alot of energy to it.\n\n"
    },
    {
      "time": "10 Feb 2004 — 10:41pm",
      "content": "I'm sorry, Daniel, but this doesn't work for me. The mark has a Leroy-Neiman-meets-'80s-bezier look\\*, and it looks really uncomfortable next to the postmodern Morphica.   \n   \nIf you're bent on using Morphica, pair it with a simple mark that uses color to play off of the company name. Use shapes, sizes or proportions that are sympathetic to the type. Or, as you mentioned, lose the mark altogether.   \n   \n(\\*Where some see exploding violins, I see salad tongs.)\n\n"
    },
    {
      "time": "11 Feb 2004 — 8:54am",
      "content": "I don't want to come off sounding offended, because I don't get offended, or angry, because I'm not. But it would help if you could qualify your statements a little more.   \n   \n_The mark has a Leroy-Neiman-meets-'80s-bezier look . . ._   \n   \nI really have no idea how to take this, because I don't know what it is. If you could explain yourself in a little more depth, then I would be able to take your critique into account. As it is, there's pretty much nothing I can use from that, especially given the amount of conflicting feedback I've received on this thread.\n\n"
    },
    {
      "time": "11 Feb 2004 — 9:31am",
      "content": "I think a very important factor to remember here, is that Daniel has said more than once in this thread that in most applications he will not be using the graphic and logotype together. He has implied that he will use consistency in color along with the logotype to identify his brand.   \n   \nDaniel, it may be helpful to share some of your application designs as you develop them. I think some of us are having difficulty catching your vision.   \n   \nAloha!   \nScott\n\n"
    },
    {
      "time": "11 Feb 2004 — 10:27am",
      "content": "Good advice, Scott. I'm currently working on a website layout and a business card design, although ironically both will probably feature the mark.\n\n"
    },
    {
      "time": "11 Feb 2004 — 8:31pm",
      "content": "Sorry, Daniel, those references \\*are\\* pretty obscure. Let me try to explain. Leroy Neiman is an artist who came to prominence in the '70s, and who, in my opinion, uses color in a garish way. Here's a link to some of his work:   \n   \n [http://www.leroyneiman.com/merchant.ihtml?pid=347&lastcatid=20&step=4](http://web.archive.org/web/20141127072145/http:/www.leroyneiman.com/merchant.ihtml?pid=347&lastcatid=20&step=4)   \n   \nYour mark reminds me of what would happen if his style of painting was combined with the hard-edged style I associate with the '80s, when digital illustration via Illustrator/Freehand became popular.   \n   \nSo when I look at your logo, I see visual nods to two decades, sitting next to type that's got a '90s deconstructionist feel. It just doesn't hang together for me.   \n   \nChromatica is a really cool name. I guess that's why I think you should explore more options.\n\n"
    },
    {
      "time": "11 Feb 2004 — 10:23pm",
      "content": "Wow, LeRoy Neiman's kind of terrible.   \n   \nAnyway, I see what you're saying, but it's still a bit hard for me to address, given that I was never able to aquire a cultural bias like yours.   \n   \nNow that I think about it, I didn't explore very much. I stumbled across something I liked and ran with it. I still like it, but I think you're right in suggesting I kick it around a little longer. Here's an updated version in which the shapes are smoother and a little better paired with Morphica. I know your problem is more with the concept, but let me know if this helps at all:   \n   \n ![](http://web.archive.org/web/20141127072145im_/http:/www.typophile.com/forums/messages/29/26389.gif)   \n   \nAlso, I notice you said \"Chromatica\". Was this a suggestion, or a typo? If the former, I've certainly considered that variant and haven't ruled it out yet.\n\n"
    },
    {
      "time": "12 Feb 2004 — 8:17am",
      "content": "_The image: it's not supposed to be heavy metal, just abstract. I was hoping the vaguely floral colors and arrangement would contrast with the sharper edges to balance it out a little. Does anyone else have an opinion on this?_   \n   \nI didn't say it before because I was waiting for an explanation for the icon - about what it is. But now I'll say it - and I hate myself for seeing it, and I'm sure Freud would have something to say - but....I'm being really honest.   \n   \nto me it looks like a bunch of penis's, penis's in a circle umm? splitting penis's? I donno - if the mark was smaller - maybe just a TM size'd mark or accent above the c and if it was a full flower? I do like the fall colours but I'm not sure what that has to do with chrome.   \n   \nI do like the idea though - of incorporating alot of colours with a name like chromatic - it reminds me of \"Technicolor\" except not. same with the typeface - I really like the type chosen here its old and new\n\n"
    },
    {
      "time": "12 Feb 2004 — 9:43am",
      "content": "Wow! I have to concentrate really hard to see penises. It sounds like a personal issue Tanya\n\n"
    },
    {
      "time": "12 Feb 2004 — 9:57am",
      "content": "haha - ok maybe its just me. but its not as if I walk around seeing penises in every logo...maybe if the colours in the graphic were reversed - skin colours on the leafy part and fall colours on the penises\n\n"
    },
    {
      "time": "12 Feb 2004 — 10:40am",
      "content": "\\> its not as if I walk around seeing penises in every logo   \n   \n\"Exactly how fghequently do you see penises in logos, Ms Shpghowl?\"   \n   \nhhp\n\n"
    },
    {
      "time": "12 Feb 2004 — 11:04am",
      "content": "probably 1 in 5\n\n"
    },
    {
      "time": "12 Feb 2004 — 11:34am",
      "content": "I think the mark is interesting   \nbut I'm not sure if it's really   \nthat solid. I don't see a connection   \nbetween the mark and type, either.   \n   \nFor the record, I thought they   \nwere burning staplers.\n\n"
    },
    {
      "time": "12 Feb 2004 — 1:20pm",
      "content": "Wow, Tanya\n\n"
    },
    {
      "time": "12 Feb 2004 — 1:31pm",
      "content": "The point is its a mark, or logo and would probably never be used the size its been posted here. See into it anything you want as long as you remember it. Like Mondonna says, \"say good things about me, say bad things about me, but just talk about me\"\n\n"
    },
    {
      "time": "12 Feb 2004 — 1:43pm",
      "content": "what would have happened if freud had become a grapic designer rather than a psycholigist?\n\n"
    },
    {
      "time": "12 Feb 2004 — 2:12pm",
      "content": "well here - let me enlighten you...Scott, Hrant - 1 in 5 easily.   \n   \n ![](http://web.archive.org/web/20141127072145im_/http:/www.typophile.com/forums/messages/29/26418.jpg)   \n   \nDaniel to your graphic - I'm sure I was seeing too much into it but that was my knee jerk reaction. I'm sure it'll be fine, I won't hijack this discussion with anymore talk of penises, promise.\n\n"
    },
    {
      "time": "12 Feb 2004 — 4:12pm",
      "content": "I saw the logo (initially) as a fiery flower, then I started to see salad tongs with leafy bits. But that's irrelevant, because my initial response was, \"cool.\"   \n   \nI'm glad you went with the Morphica, because most of the others gave me a very Op, late 80's, surf shirt graphic feel. Your logo could set the stage for a really kick  animation, too.\n\n"
    },
    {
      "time": "12 Feb 2004 — 4:39pm",
      "content": "\\> what would have happened if freud had become a grapic designer rather than a psycholigist?   \n   \nHe'd be working for Tanya. Or should I say _under_ Tanya... (Sorry ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "12 Feb 2004 — 5:23pm",
      "content": "I'm starting to feel uncomfortable. Does that constitute sexual harrassment?   \n   \nDaniel, I'm anxious to see some of your applications when you get there.\n\n"
    },
    {
      "time": "12 Feb 2004 — 5:38pm",
      "content": "I feel bad for Leroy....\n\n"
    },
    {
      "time": "12 Feb 2004 — 6:22pm",
      "content": "sexual harassment? me to freud (he wouldn't understand) or hrant to me? (no offense made or taken) or us to you (and your uncomfortable why?)   \n   \nor is it just fun and games until some girl says \"penis\"?   \n   \ndon't be so squimish guys. falic symbols are everywhere, one day you'll see one and wonder too.   \n   \nOf course I blew it a bit out of proportion after that . a little self-deprecation dosen't hurt now and then and freud can send me his resume anytime for review - its all cool\n\n"
    },
    {
      "time": "12 Feb 2004 — 10:39pm",
      "content": "Please\n\n"
    },
    {
      "time": "3 May 2004 — 8:39pm",
      "content": "Okay, I'm pulling a Frankenstein and resurrecting this. I still really like the illustrative quality, but it just isn't looking good to me at small sizes. I've been thinking about how I can make the type-only treatment distinctive, since the Morphica is strong by itself. I really kind of want to get away from the idea of a twee little image that is contractually obligated to appear with every use of the name.   \n   \nI was inspired by kris' recent Klim business cards to try a more illustrative approach. The type is the only \"logo\"\n\n"
    },
    {
      "time": "3 May 2004 — 9:24pm",
      "content": "Yeah. I think this is a much better approach. Especially   \nif the illustration varied from application to application.   \nThe \"graphic Design studio\" could match the colours   \nof every illustration. Looks like \"autumn\", very appriopriate   \nfor me, cos it is autumn here! Funny if you made a seasonal   \ncard! It might have cohesiveness like the CS branding, which   \nI happen to think is rather successful. Good work bro.   \n   \n-kris.\n\n"
    },
    {
      "time": "4 May 2004 — 4:50am",
      "content": "1 - your mark is fine, from the beginning. It does not look heavy metal to me, in fact that just confuses me.   \n   \nIf all logos were not busy, were would the busy people live?   \n   \n2 - I like the very first font you posted. Morphica lower case. Suits it perfectly.   \n   \n3 - The first thing I saw in the mark was a noisy flower. Energetic and fast. Swift!   \n   \n4 - That last business card, based on KLIM's inspiration, is the choice for me, yes precious.   \n   \n5 - I would be attracted to your studio with this design. The choice of colour is young and vibrant. Contemporary.   \n   \nGreat stuff!\n\n"
    },
    {
      "time": "4 May 2004 — 5:29am",
      "content": "Daniel, the beauty of the last design (leaves) is you can change the colors with the seasons, keeping it fresh all year long.\n\n"
    },
    {
      "time": "4 May 2004 — 12:13pm",
      "content": "The seasonal idea is great, but I doubt I'll be able to implement it just based on costs. I'll have to see.   \n   \nVery soon now, I'm going to be asking for some specific advice on the printing process, so please bear with me. Y'all have been amazing so far.\n\n"
    },
    {
      "time": "4 May 2004 — 2:02pm",
      "content": "Daniel my seasonal idea would be for your web site only. Not for your print work.\n\n"
    },
    {
      "time": "4 May 2004 — 4:48pm",
      "content": "Weaver, I like your idea of seasons\n\n"
    },
    {
      "time": "4 May 2004 — 6:18pm",
      "content": "hey daniel,   \n   \n i read a book about signs and symbols by adrian frutiger and he stated that \"pure abstratction can lead to unwanted similarities in logotypes.\"   \n   \nIt seems like the people on this thread dislike it because they cant figure out what it is. I think you should go with the season idea. looking forward to seeing your progress. keep up the great work.\n\n"
    }
  ]
}
