{
  "id": "30034",
  "title": "My own business card design",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I have designed a business card for myself and I would like some feedback. It is still in the sketch phase (everything could be changed). I like the typeface on the front and back. It has been made on a letterpress. The paper is not good to print on. Maybe it looks a bit old fashion, but I think it is suitable for a letterpress printer\n\nI am not sure if the ’CANUS’ should be more in the middle or more near the toward the upper-side of the card?\n\nDo you have difficulty understanding the e-mail and web-site address?\n\nI knowthat in the first line on the back-side the ’SS’ spacing in PRESS need to be changed and the ’l’ directly after the ’PRESS’ is not a good idea.\n\nThanks, Terence\n\n ![](http://web.archive.org/web/20080821143002im_/http:/www.typophile.com/files/back_5051.jpg)\n  \nback\n\n ![](http://web.archive.org/web/20080821143002im_/http:/www.typophile.com/files/front1_6691.jpg)\n  \nfront1\n\n ![](http://web.archive.org/web/20080821143002im_/http:/www.typophile.com/files/front2_6166.jpg)\n  \nfront2\n [‹ Please critique my logo](http://web.archive.org/web/20080821143002/http:/www.typophile.com/node/28269 \"Go to previous forum topic\") [\"La Brujula\" college magazine header ›](http://web.archive.org/web/20080821143002/http:/www.typophile.com/node/27505 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080821143002/http://www.typophile.com/user/8433\" title=\"View user profile.\">canus</a>",
  "time": "<br>",
  "uid": "8433",
  "comments": [
    {
      "time": " 11.Dec.2006 4.46pm",
      "content": "If, on the front of the card, you have only the word CANUS printed in caps, why not only capitalize CANUS in the first 2 lines across the back? That way you would avoid both the gap between the 2 currently capitalized words (which is drawing too much attention) and the issue with the Sl combination.\n\nI’m assuming you’re aware of the spacing issue after the (0) in the phone number.\n\nAnd why “dot” in the email & web addresses? Why not just use periods? You may be stuck with (at) if you’re setting metal, but there’s no reason not to use periods here (other than to be “different”).\n\nAlso, while this may simply be due to the blurry photographs, the inking on these looks a bit muddy; it looks like all of the “e”, “a” and “4” counters are filled in, etc.\n\n"
    },
    {
      "time": " 11.Dec.2006 5.28pm",
      "content": "\\> <cite>Do you have difficulty understanding the e-mail and web-site address?</cite>  \nThis is a particular peeve of mine. It’s a technique that is used online to avoid spam. Like Jason I can understand the (at) if it isn’t @ your disposal. ;^)\n\nI would register _canuspress.com_ and use that, registration and hosting are incredibly cheap these days.\n\nWhat weight is the paper?\n\nOn another note, if you’re setting up a printing press check [these guys](http://web.archive.org/web/20080821143002/http:/www.flickr.com/photos/tripprintpress/) out on Flickr. Their stuff would interest and inspire you.\n\n"
    },
    {
      "time": " 12.Dec.2006 12.09am",
      "content": "Thank you both for commenting\n\nJason: Your idea too only capitalise CANUS is a good point. I was aware of the spacing issue after (0) but have no idea why I didn’t write it in my notes to correct. The ’e’ ’a’ and ’4’ counters are filled in. I only had some left over etching paper with me when I printed this (I blame the paper) in combination with the pressure (but when I print them for real I can adjust both).\n\nJason and Conor: ’dot’ is in the e-mail address, because in another typophile topic there was a comment on letterpress printing and the ’@’ symbol and if you did test.test(a)test.com it would be inconsistent, because the ’.’ and ’@’.\n\nConor: I am beginning of setting up a small printing press and if it is successful and I get the rent out I will by a proper internet address.\n\nWhat weight is the paper? That is a good question. I only used it in the past too print etchings on. But I was planing to ask my teacher or go look at the KABK-shop. So when I know I will post it here. Thanks for the link.\n\nPS. On another note to Jason thank you for referring me too Wogibi press.\n\n"
    },
    {
      "time": " 12.Dec.2006 2.22am",
      "content": "_Coner_, _Conner_ \\> **Conor**\n\nGlad you liked the link. Best of luck. ;^)\n\n"
    },
    {
      "time": " 12.Dec.2006 2.40am",
      "content": "My apologies for misspelling your name. I shouldn’t have posted early in the morning.\n\n"
    },
    {
      "time": " 12.Dec.2006 2.56am",
      "content": "Ha! Geen probleem.\n\n"
    },
    {
      "time": " 12.Dec.2006 6.41am",
      "content": "I’m a fan of being clear and to-the-point on business cards, and the email and web address seems overly cute. It distracts from your logo above, IMHO.\n\n"
    },
    {
      "time": " 12.Dec.2006 9.02am",
      "content": "[Mine](http://web.archive.org/web/20080821143002/http:/www.flickr.com/photos/c_ono_r/140386091/in/set-72157594156470623/) à la foil block.\n\n"
    }
  ]
}
