{
  "id": "30048",
  "title": "\"Book Typography\" by Mitchell & Wightman: reviews?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've just gotten a prospectus for this book from Oak Knoll (who are distributors of the book). The authors' own press (Libanus Press) is the imprint. It appears to be a phenomenally complete manual on book typography. 448 pages, 1000 illustrations of concepts and principles, thorough coverage of all topics related to book design including image/text layout, type selection, variables in type specification, and much more. I admit I am very intrigued by this brochure. Has anyone seen the book firsthand?\n\n",
  "author": "crossgrove",
  "time": "12 Dec 2006 — 1:11pm",
  "uid": "2263",
  "comments": [
    {
      "time": "12 Dec 2006 — 2:06pm",
      "content": "Sounds juicy. I hope someone can help. I'm curious too.\n\n"
    },
    {
      "time": "12 Dec 2006 — 2:32pm",
      "content": "I picked up a copy directly from the publisher about 9 months ago and must admit it's a bit of an indulgence; there was something about the girth of the thing and the high production values that appealed to my vanity. The book really is nicely put together, and what it does it does very well; that is, it is ultimately pragmatic in its approach.\n\nThe \"problem\" is that if one has studied one's Bringhurst, with additional readings from, say, Dowdings' _Finer Points..._ and Tschichold's _The Art of the Book,_ with, say, a few dashes of Felici's _Complete Manual of Typography,_ (and every self-respecting book typographer should be reading these texts) then, really, _Book Typography_ won't be as full of useful info as it might be to someone coming in blank.\n\nThat said, the book has dedicated chapters on topics not touched by any of the above-mentioned books: basic halftone & 4-colour pre-press, technical details on setting up & designing soft-bound covers & dust jackets, etc. (see below for the TOC). The book also focuses more on the fine details of HOW to accomplish certain typographic principles. Thus, where Bringhurst is perhaps heavier on the theory side, this text is very focused on the practical application; not exactly an application-specific manual, but a fairly clear book typographer's handbook.\n\nOne small bug for North American readers is that the (format) dimensions tend to be in metric, rather than imperial (and this coming from a Canadian!); typographic dimensions are, for the most part, in points and picas, but dimensions relating to book/page/sheet size are all metric and/or European (that is, A2, A3, A4 rather than tabloid, legal, letter, etc.).\n\nAs I started, the book really is an indulgence, as much (I'm guessing) for the authors in producing the book as it is to own. It's lush, beautiful and well built, and it looks good on the shelf. However, when I'm looking to confirm a principle, it's still Bringhurst that I reach for.\n\n"
    },
    {
      "time": "12 Dec 2006 — 2:59pm",
      "content": "Thanks, Jason. I could see recommending this to students and graphic designers, then. I suppose I'll end up treating myself to a copy....\n\n"
    },
    {
      "time": "12 Dec 2006 — 3:16pm",
      "content": "Hi Carl. I saw the same prospectus;\n\n_...wonder what they have to say about drop caps in the forthcoming Oak Knoll title Book Typography: A Designer’s Manual? My head of department just forwarded me the info on it. Judging by the contents listing, Mitchell and Wightman give the topic about four pages._\n\nbut I still haven't seen the book itself... you could say that their prospectus is doing exactly what it it's intended to do; whip up a storm of pre-sales anticipation!\n\nThe book itself is at\n\n[http://www.oakknoll.com/detail.php?d\\_booknr=92771](http://web.archive.org/web/20131102163655/http:/www.oakknoll.com/detail.php?d_booknr=92771 \"http://www.oakknoll.com/detail.php?d\\_booknr=92771\")\n\nalthough I no longer see the downloadable .pdf prospectus there.\n\nJason's comment about it being more useful to a complete beginner is probably right on the money. Me, I have no problem with metric page dimensions, so it's good to know that much in advance. I guess I would want to see how it compares against Jost Hochuli & Robin Kinross's [Designing books: practice and theory](http://web.archive.org/web/20131102163655/http:/www.hyphenpress.co.uk/titles/designing_books/index.html), or even Ari Rafaeli's [Book Typography](http://web.archive.org/web/20131102163655/http:/www.oakknoll.com/detail.php?d_booknr=79445), also at Oak Knoll.\n\n"
    },
    {
      "time": "12 Dec 2006 — 3:48pm",
      "content": "Ben, I have Kinross' book as well, and Hendel's _On Book Design,_ both of which I might have mentioned above. Again, if one has either/both of those titles, the Mitchell and Wightman becomes even more unnecessary. Which isn't to say that it isn't a worthy acquisition.\n\nHere are scans of the TOC:\n\n ![](http://web.archive.org/web/20131102163655im_/http:/typophile.com/files/BT_TOC1_4683.gif)\n  \n\n ![](http://web.archive.org/web/20131102163655im_/http:/typophile.com/files/BT_TOC2_5885.gif)\n  \n\n ![](http://web.archive.org/web/20131102163655im_/http:/typophile.com/files/BT_TOC3_4927.gif)\n  \n\n ![](http://web.archive.org/web/20131102163655im_/http:/typophile.com/files/BT_TOC4_6659.gif)\n  \n\n ![](http://web.archive.org/web/20131102163655im_/http:/typophile.com/files/BT_TOC5_5483.gif)\n\n"
    },
    {
      "time": "12 Dec 2006 — 6:36pm",
      "content": "In case anyone's interested in seeing a review from a trade magazine, [Grafik](http://web.archive.org/web/20131102163655/http:/www.grafikmagazine.co.uk/) had an article about this book in their February 2006 issue (it's not online, sadly).\n\n"
    },
    {
      "time": "13 Dec 2006 — 1:18pm",
      "content": "Ah Jason I thought you might have those other titles; your scans are _so_ much nicer than the T.O.C. Oak Knoll have up on their website. On the basis of this, I'd say it's pretty reasonably priced.\n\n"
    },
    {
      "time": "13 Dec 2006 — 5:45pm",
      "content": "I got my copy directly from Libunus Press. Here's their page: [http://www.libanuspress.co.uk/](http://web.archive.org/web/20131102163655/http:/www.libanuspress.co.uk/)\n\n"
    },
    {
      "time": "13 Dec 2006 — 7:20pm",
      "content": "Thanks for posting the TOC, Jason.\n\nY'know, from that, it almost looks like _EOTS_ meets _CMS_ and/or (_Editing Canadian English, Second Edition_: really similar process in the TOC) meets IP's _Pocket Pal_....\n\nAn interesting mixture, but given the price, I'm not convinced it's a worthy purchase.\n\n"
    },
    {
      "time": "13 Dec 2006 — 9:16pm",
      "content": "All that for a mere 35 quid? Wow Linda you must be a tough customer...\n\nIt was very interesting for me to see how the Libanus Press have put their website together; clearly it's all about _control._\n\n"
    },
    {
      "time": "13 Dec 2006 — 9:26pm",
      "content": "Ben, that 35 quid plus trans-Atlantic shipping adds up to over $100 in Canada.\n\n"
    },
    {
      "time": "14 Dec 2006 — 2:47pm",
      "content": "I'm half-Scots: as Jason mentioned, for $100 here in Canada, I can get most of the books I listed and still have some change left over for a pint or three. :-)\n\n"
    },
    {
      "time": "15 Dec 2006 — 7:37am",
      "content": "From the TOC, it looks like what Mitchell and Wightman bring to the table is an integration into the discussion of book design of the nuts and bolts of bookmaking, like getting files and images ready for press, different kinds of bindings and covers, the economics of printing and how that affects book design, etc. (parts 11, 12, 14, 15, and 16).\n\nI don't remember seeing those things discussed in Felici, Bringhurst, Hochuli, or Tschichold, and a look at Hendel and Dowding's TOCs tells me they don't address those things in any systematic way, either. Am I missing something? Speaking as an autodidact in the world of book design, this seems like a superb book to have on the shelf.\n\n"
    },
    {
      "time": "15 Dec 2006 — 12:04pm",
      "content": "But they are discussed in things like International Press' _Pocket Pal_, which one can often get for free from commercial printers throughout North America, or pay around $20 US for. It's invaluable for the basics of how to get any sort of work off to press: my copy sits next to Bringhurst. ;-)\n\n"
    },
    {
      "time": "15 Dec 2006 — 7:35pm",
      "content": "OK Linda, yours for a pint or three whenever!\n\nMaurice makes a good point about the relevance and orderliness of what's integral to the book; although I'm delighted to see the (often overlooked) content of Part 16, it occurs to me that one could easily spend more than five pages talking about paper & press in this context in the preceeding Part 15.\n\nJason, (not a qualitative question I grant you) how many words are they putting on the average page here?\n\nSeriously folks, shipping is shipping; to blame the publisher for how expensive it is to get the goods to your door is to confuse the issue. What's to stop any of you ordering from Oak Knoll? Or did you want it discounted from amazon.com to begin with? If I placed an order tomorrow, I would do so knowing the air freight from the UK to NZ would be prohibitive. I hope this wouldn't interfere with my ability to evaluate the worth of the book itself.\n\n"
    },
    {
      "time": "16 Dec 2006 — 9:47am",
      "content": "As I think I've stressed above, the book is very well produced: the content is comprehensive, the writing clear and practical, the pages well illustrated & nicely composed, the book finely designed & beautifully printed. Perhaps it's notable that I ordered my copy only after seeing a copy first-hand, perhaps not. I certainly don't think this is simply a matter of being lazy or cheap. It's just that as folks invested & in love with typography & book design I assume that many of us have read extensively on the topic, have gathered a handsome collection of books on the topic along side a stack of others hoarded from the library. The result of this, at least on my part, is a certain disappointment when I shell out a good sum of money for the latest publication only to find that there isn't much in it I wasn't already familiar with. This isn't a complaint about the book, or any book, but about the fact that inevitably books on any given topic become repetitive and, at least to some extent, redundant.\n\nThere is also the position which places a certain emphasis on \"buying locally.\" This is a somewhat pointless argument in the age of Amazon, and in fact the opposite argument is likely more appropriate: that buying directly from Libanus (as I did) is the only way to get the money to the individual publisher. However, if the information found in a book produced in England can also be found in a book produced in Vancouver...\n\n"
    },
    {
      "time": "16 Dec 2006 — 1:29pm",
      "content": "Good points, Jason, particularly _the fact that inevitably books on any given topic become repetitive and, at least to some extent, redundant_.\n\nFor those of us with groaning bookshelves, it's hard to justify buying yet another book, particularly sight-unseen, that covers already tilled ground.\n\nBut if I was just starting out, it certainly covers a lot of ground in one book.\n\n(Ben, you're on for a pint if you're coming to TypeCon.)\n\n"
    }
  ]
}
