{
  "id": "30043",
  "title": "OTF Kerning Problems in Microsoft Office",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello,\n\nI’m working in a new typeface using the OpenType technology. The kerning feature works well in all applications except Microsoft Office (on Mac and Windows too). What is happening?\n\nP.S.: I’m working in Mac OSX using FontLab 5.02\n\n",
  "author": "rafaelneder",
  "time": "12 Dec 2006 — 10:49am",
  "uid": "813",
  "comments": [
    {
      "time": "12 Dec 2006 — 11:42am",
      "content": "you have to turn kerning on in MS Office Apps.  \nGo to Format\\>Font\\>Character Spacing and Check the box for \"Kerning for fonts:\" and set the point size as low as the lowest size you will be using (or lower).\n\n"
    },
    {
      "time": "12 Dec 2006 — 12:12pm",
      "content": "Office currently only uses old style kerning, not OpenType kerning.\n\n"
    },
    {
      "time": "12 Dec 2006 — 8:08pm",
      "content": "And it works!\n\n\\>\\>Office currently only uses old style kerning, not OpenType kerning.  \nYes, I converted the Class OT Kerning to Plain FL Kerning before generate the font files :) The real problem is the Word configuration! Thanks Paul for the hint!\n\n"
    },
    {
      "time": "15 Dec 2006 — 6:03pm",
      "content": "Simon,\n\ndo I understand this correctly?\n\nMicrosoft produced a new set of OpenType fonts (the ClearType collection: Cambria, Calibri, Candara, Constantia, Corbel etc.) which does not contain old-style but only OpenType kerning, Microsoft made these fonts the standard fonts for Office 2007 but at the same time Office 2007 does not support OpenType kerning but only old-style kerning, which the new standard fonts don't have? This would mean that with Office 2007 and the new fonts, it's not possible to get any kerning at all, while it's still possible to get kerning using the old fonts, like Arial or Times New Roman, since they use the old-style kerning.\n\nIs that right? I'm puzzled.\n\nAdam\n\n"
    }
  ]
}
