{
  "id": "30075",
  "title": "Celebrating the Holiday Season and Our 120th Anniversary",
  "forum": "Home",
  "tags": [
    "News"
  ],
  "content": " **Linotype’s LinoLetter for December 2006 – Celebrating the Holiday Season and Our 120th Anniversary**\n\nCheck out the full version of this month's newsletter at the Linotype website: [http://www.linotype.com/38-21233/issue200612.html](http://web.archive.org/web/20121128032913/http:/www.linotype.com/38-21233/issue200612.html \"http://www.linotype.com/38-21233/issue200612.html\")\n\n_Content Preview:_ Like presents tucked away under a tree, this month’s LinoLetter has a number of surprises in store for readers. First the fonts: This December, we are pleased to introduce a brand new type system! Called Generis, this system’s typefaces take on a rather generic appearance, allowing them to fit almost any design brief.\n\nSecond, we’d like to call your attention once more to Pirouette. We first featured this copperplate script face in 2004. Now two years later, we’ve upgraded it further so that it includes contextual features, making it easier than for Pirouette to look like handwriting. In terms of information, we have three treats set aside: Linotype.com now has a Font Feature page devoted to holiday fonts and type ornaments. Additionally, we’ve brought out another edition of our typographic advice column, “Akira Says …” And last but not least, 2006 represents Linotype’s 120th Anniversary! We’ve decided to celebrate by printing a book that is both humorous and full of historical tidbits. You can find more information about this book and all of December’s surprises below.\n\nDon’t forget: Customers who purchase an OpenType Bundle before the end of 2006 will receive a Mac mini – absolutely free!\n\n[Read the rest of the Linoletter at Linotype.com!](http://web.archive.org/web/20121128032913/http:/www.linotype.com/38-21233/issue200612.html)\n\nOr, [subscribe to the Linoletter](http://web.archive.org/web/20121128032913/https:/www.linotype.com/newsletter.html), and get the information delivered every month directly to your mailbox.\n\n",
  "author": "dan_reynolds",
  "time": "14 Dec 2006 — 12:58am",
  "uid": "1085",
  "comments": [

  ]
}
