{
  "id": "30080",
  "title": "When a typeface is no longer a typeface...",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Okay, either A) I've had a simplistic epiphany, B) I'm on to something, or C) I've lost it completely, but i've _just realized_ that [Bodoni](http://web.archive.org/web/20150123085459/http:/typophile.com/wiki/Bodoni), [Caslon](http://web.archive.org/web/20150123085459/http:/typophile.com/wiki/Caslon), [Garamond](http://web.archive.org/web/20150123085459/http:/typophile.com/wiki/Garamond), &c. are no longer typefaces (and possibly never were). I mean we don't really have access to the original typefaces that these names refer to and perhaps their creators never gave their own names to them. It gets even more confusing in the case of Garamond with typefaces based on models he didn't even create masquerading under the same name. But even with the case of Caslon, even [Caslon's Caslon](http://web.archive.org/web/20150123085459/http:/www.typophile.com/node/2816) is not the same as William Caslon's Caslon. In effect, these names that we say refer to typefaces no longer refer to the typefaces they were meant to (for the most part), but are in effect _categories_ that can refer to a whole group or typeface, for which the originals are simply prototypes or _prototypefaces_.  \nthis problem revealed itself to me as i've been working late at night on typeface entries for wikipedia, trying to structure [info boxes for typefaces](http://web.archive.org/web/20150123085459/http:/en.wikipedia.org/wiki/Template:Infobox_font) so that they can present information that is meaningful to the reader of said articles. My thought process went something like this:  \n_An image illustrating the typeface would be useful, but which version of Bodoni should be used for the illustration? Ideally, infobox should show the original typeface, but is there really even a definitive Bodoni typeface that Giambatista created? What if I just use a digital Bodoni, is there one that is \"truer\" to Bodoni than another? I can't say..._  \nThen in the same info box comes the listing of different versions of typefaces, as seen in the article for [Helvetica](http://web.archive.org/web/20150123085459/http:/en.wikipedia.org/wiki/Helvetica) that can be classified in different ways, as variations on the typeface, as knock-offs, &c. and the distinction begins to blur. Couldn't these all just be called \"variations\"? Is there a reason Nimbus Sans is more legitimate than Swiss 721 BT? Anyway, now i'm rambling. Feel free to enlighten me on anything I may or may not have touched on here.\n\n_Misc Reading:_  \n [A Garamond by Any Other Name](http://web.archive.org/web/20150123085459/http:/www.fonts.com/AboutFonts/Articles/fyti/09-01-2004.htm)  \n [\"Type 1987\" Revisited](http://web.archive.org/web/20150123085459/http:/www.metropolismag.com/cda/story.php?artid=1844)\n\n",
  "author": "paul d hunt",
  "time": "14 Dec 2006 — 7:06am",
  "uid": "7006",
  "comments": [
    {
      "time": "14 Dec 2006 — 8:06am",
      "content": "Well, one thing to remember is that to the average Wikipedia user, one Bodoni is pretty much identical to the other one, even though to most of us here they are extremely different. So unless an article is addressing the differences between Bodoni cuts, you can use any cut you have handy to illustrate. The importance is to show how Bodoni is different from a Garamond, or a Times.\n\n"
    },
    {
      "time": "14 Dec 2006 — 8:16am",
      "content": "maybe all this was more profound at 3 a.m. \\>^p\n\ni guess my reason in posting this is to hear others' ideas of how this infobox could be structured to make it more useful. [Have a look at the template](http://web.archive.org/) as it is, and let's critique it. The solution I came up with for the illustration dillema was to have a field for \"shown here\" that tells which version of the typeface is being used.\n\n"
    },
    {
      "time": "14 Dec 2006 — 8:19am",
      "content": "For a postmodern perspective on the issue of (literary) authorship:  \n [www.victorianweb.org/authors/wmt/pegasus/contents.html](http://web.archive.org/web/20150123085459/http:/www.victorianweb.org/authors/wmt/pegasus/contents.html \"www.victorianweb.org/authors/wmt/pegasus/contents.html\")  \n--especially the section \"The force of chosen contexts\".\n\n"
    },
    {
      "time": "14 Dec 2006 — 9:16am",
      "content": "To make it more useful? I think that for people who can tell the difference between Bodoni and Times a more complete comparison of the variations would be useful.\n\nFor instance, we all know that Filosofia and Mrs. Eaves are variations of Bodoni and Baskerville, but in what ways? What's the primary differences between them and their \"namesake\" cuts?\n\n"
    },
    {
      "time": "14 Dec 2006 — 9:20am",
      "content": "Dan that would make a great wiki entry. You could start out defining the simple nomenclature and then break it down even further.\n\n"
    },
    {
      "time": "14 Dec 2006 — 9:21am",
      "content": "\\>possibly never were\n\nI agree. As you may remember, at the talk I gave at TypeCon last summer I made the same point with regard to Caslon. And I said I had learned it from James Mosley, the historian of type and printing, and former long time head of St. Brides library in London.\n\nMosely made the point about revisions of the original Caslon by the Caslon foundry itself--beginning at the latest in the 1880s--in passing in his essay dedicated to Matthew Carter, in 'Typographically Speaking: the Art of Matthew Carter'. He also has extensive comments on the various sizes of the original Caslon in his facsimile reprint and notes on Caslon's 1766 specimen booklet (1980/81).\n\nJohn Hudson learned about this point of the revisions--which he mentions in the thread you link to--from Mosley's Carter essay. John doesn't mention this in the Typophile thread, but I asked him at Typotechnica in London, and he told me that's where he learned about it. I also met Mosley briefly in London, and spent an afternoon talking Caslon with him at University of Virginia in the summer of '05.\n\nIn that discussion, Moseley noted that Caslon isn't really a unified design--such as Fleishman was in fact cutting at about the same time in Holland. I can't remember who, but it may be Bringhurst, who noted that Caslon and other old faces are not 'typeface families' in the sense of being fully unified designs.\n\nIn fact Mosley indicates in the Carter essay that in a sense the 'Type Designer' didn't exist until after the invention of the pantographic punch cutter. Then the different sizes could be scaled, so there were three or four masters, and the rest was scaled using the machine. The designer really was then a drawer of type, and the process of production was more separate than with the punch cutter.\n\nOf course, there was a lot of production drawing for Monotype and Linotype, and it has been noted that today with digital type we are in some respects back to the punchcut days when the same hand finishes the type design as conceives it.\n\nAt any rate, I suspect your 'revelation' to a large extent reconstruction of what various people have mentioned, all of which traces back to Mosley. I just think credit should go where it's due--to Mosley.\n\nIn my work on Caslon I have found that the revisions are much more extensive even than Mosley noted, but that is just an extension of Mosley's point.\n\nI did argue in my talk that attempts to be 'authentic' are doomed to failure, and that in fact 'Founder's Caslon,' which is a fine typeface in many respects, fails to be authentic in several key aspects. I have a feeling that Mosley believes more in the virtue of authenticity than I do, but I can't speak for him, of course.\n\nAt any rate I will look at your template and comment further in another post.\n\n"
    },
    {
      "time": "14 Dec 2006 — 9:54am",
      "content": "_At any rate, I suspect your ‘revelation’ to a large extent reconstruction of what various people have mentioned, all of which traces back to Mosley. I just think credit should go where it’s due—to Mosley._\n\ni think my \"revelation\" was different. to me, it was realizing that terms we use as names of typefaces are in fact effectual categories of typefaces. i think this is something that we all realize is true in the back of our minds, but until last night, i hand't really thought about it.\n\n"
    },
    {
      "time": "14 Dec 2006 — 11:00am",
      "content": "Interesting Paul. I've actually been tossing this idea around recently as well. It kicked off when I got my hands on some old Deberny & Peignot and Stempel specimens of Garamond—not the same typefaces! Should foundries then not call their typefaces Garamond, or Bodoni or Caslon?\n\nAnd speaking of here's [Stormtype's Jannon](http://web.archive.org/web/20150123085459/http:/www.stormtype.com/typefaces-fonts-shop/families-21-jannon) that looks similar to the Deberny & Peignot cut. Scroll down and read on for further Garamond confusion. :)\n\n"
    },
    {
      "time": "14 Dec 2006 — 11:14am",
      "content": "\\>effectual categories of typefaces\n\nOh, I see what you mean now. I think it is somewhat arbitrary where you decide to call something a variation on a typeface and what a different face within the same category. I think you are running up against the impossibility of really sharp borders in the categories of type designs.\n\nFor example with Caslon, if you compare it to Van Dyke you can see the kind of thing Caslon was looking at--Eg., DTL Elzevir as a close modern derivative--and it is clear that he belongs to the 'Dutch' category, whether you want to call it Baroque or whatever as Bringhurst does. But within that Caslon has some personal characteristics that are specific to him. Some of these are revived in some Caslons, but not in others. But still I bet in most you can find stuff that is specific to the original, and not shared by other Dutch examples. There are some exceptions, like 'Antique Caslon', which has little to do with Caslon, and 'Caslon 224', which has a lot more to do with Benguiat than with Caslon.\n\nI guess the problem is one of 'family resemblence'. When does a cousin look more like one family than another? Families will discuss, with almost everyone having a different opinion!\n\n"
    },
    {
      "time": "14 Dec 2006 — 1:01pm",
      "content": "Paul — I have been collecting (entries) of typfaces/fonts for some time, trying to categorize them. The strategy I adopted is something like:\n\nCategory(\\*) \\> Typeface \\> Cut or Version \\> Font\n\nCategories in my case more or less follow a historical classification, quite similar to Vox'. They may adopt other parameters, though, such as use (body text, display, advertising, book or newspaper). A Typeface I consider to be a set of formal or stylistic traits with which the basic skeleton shapes of alphabets are interpreted (i.e. a typeface can cover several scripts), typically devised by one designer. The actual rendering of a Typeface (its visual realisation) results in a Cut or Version; several different punchcutters may have their own interpretation of a Typeface, all within the boundaries of its style. I also distinguish between a Revival and an Interpretation, the latter more freely following on original Typeface design. I think this distinction (between Typeface and Cut) is what bothers you. A last level I use is Font (or Fount); this involves the physical realisation of a Typeface (or Cut thereof). Different Vendors (or in the old days Type Foundries) may offer different releases of principally one and the same Cut, sometimes with a few visual differences, but primarily with technical distinctions (such as type height or file format).\n\nAn example (from my modest little database):\n\n`II FRENCH OLD STYLE (GARALDE)`\n\nII.1 Claude Garamond (italics: Robert Granjon)\n\nII.1.A — ORIGINAL\n\nII.1.B — REVIVALS  \nII.1.B.a Deberny & Peignot Garamond (George & Charles Peignot, 1912-28)  \nII.1.B.b Nebiolo Garaldus (Aldo Novarese, 1957)  \nII.1.B.c Linotype Granjon LT Std (George W. Jones, 1928-31; Linotype)  \nII.1.B.d Linotype Estienne (George W. Jones, 1930)  \nII.1.B.e Stempel Garamond (D. Stempel AG, 1925)  \nII.1.B.f Berthold Garamond  \nII.1.B.g Garamond 3 LT Std (Linotype)  \nII.1.B.h ITC Garamond Std Lt (Tony Stan, 1954)  \nII.1.B.i Adobe Garamond Pro  \nII.1.B.j Simoncini Garamond Std  \nII.1.B.k 1503 Garamond (Ross Mills, 1994; Tiro Typeworks)  \nII.1.B.l Amsterdammer Garamont (URW++)  \nII.1.B.m URW Garamond  \nII.1.B.n Augereau (George Abrams, 1989)  \nII.1.B.o Envoy (Tim Rolands, 2001)  \nII.1.B.p Adobe Garamond Premier Pro (Robert Slimbach)\n\nII.1.C — INTERPRETATIONS  \nII.1.C.a Sabon (Sabon-Antiqua) (Jan Tschichold, 1964/7; Stempel, Linotype, Monotype)  \nII.1.C.b Sabon Next (Porchez)\n\n(I grant that this is very incomplete and the classification model is not consequent. It's been a long time since I have been working on this.)\n\nYet another:\n\n`VII DIDONES`\n\nVII.1 Giambattista Bodoni (ca 1791)\n\nVII.1.A — ORIGINAL  \nVII.1.A.a Giambattista Bodoni, Manuale Tipografico)\n\nVII.1.B — METAL REVIVALS  \nVII.1.B.a Morris Fuller Benton (ATF, 1907)  \nVII.1.B.b Monotype, 1930s  \nVII.1.B.c Bauer Bodoni (Bauer, Heinrich Jost, 1926)  \nVII.1.B.d Berthold Bodoni Antiqua, 1930s  \nVII.1.B.e R.H. Middleton (American Ludlow foundry, 1930s)\n\nVII.1.C — PHOTO COMPOSITION  \nVII.1.C.a Berthold Bodoni (Gunter Gerhard Lange, 1970)  \nVII.1.C.b Berthold Bodoni Old Face (Gunter Gerhard Lange, 1983)  \nVII.1.C.c IBM corporate identity (Karl Gerstner, 1980s)\n\nVII.1.D — DIGITAL REVIVALS  \nVII.1.D.a Monotype 135 Bodoni (Monotype, 1921)  \nVII.1.D.b Bauer Bodoni Std (Heinrich Jost, 1926)  \nVII.1.D.c Monotype 357 Bodoni Std Book (Monotype, 1932)  \nVII.1.D.d Bodoni Std  \nVII.1.D.e WTC Our Bodoni (Massimo Vignelli, 1989)  \nVII.1.D.f Berthold Bodoni  \nVII.1.D.g Berthold Bodoni Old Face  \nVII.1.D.h Bodoni Old Fashion (URW++)  \nVII.1.D.i Bauer Bodoni URW  \nVII.1.D.j Bauer Bodoni BT (Bitstream)  \nVII.1.D.k EF Bodoni  \nVII.1.D.l EF Bauer Bodoni  \nVII.1.D.m FF Bodoni Classic [+ Swashes & Chancery] (Gert Wiescher, 1994)  \nVII.1.D.n ITC Bodoni (drie opticals: six, twelve & seventy-two; Sumner Stone e.a. 1994)  \nVII.1.D.o Linotype Bodoni Classico (Franko Luin, 1995)  \nVII.1.D.p Linotype Gianotten (Antonio Pace, 2000)  \nVII.1.D.q Filosofia (Zuzanna Licko, Emigre)\n\nVII.1.E — INTERPRETATIONS (“bodoniennes”)  \nVII.1.E.a Fenice (Aldo Novarese)  \nVII.1.E.b Iridium (Ardrian Frutiger, Stempel, 1972)  \nVII.1.E.a FF Acanthus (Akira Kobayashi, FontFont)\n\nMan, I see now there's lot to be updated. And this all should urgently be ported to an XML schema.\n\nAnyway, my two cents.\n\n"
    },
    {
      "time": "14 Dec 2006 — 2:34pm",
      "content": "Paul, I think you've just stumbled onto your first essay topic for Reading.\n\n"
    },
    {
      "time": "14 Dec 2006 — 2:50pm",
      "content": "well thanks for breaking the news for me, Dan! :^p\n\n"
    },
    {
      "time": "14 Dec 2006 — 2:58pm",
      "content": "Are you really going to Reading, Paul? Congratulations!\n\nThinking about the classificaton problem:\n\nAs in biology, I think--I don't know that much about it--I believe you can classify either by evolution--what came from what--or by structure. And these may be different. For example in Australia you have animals that have a different evolutionary history but similar structure--marsupial cognates to squirrels etc.\n\nIn type, you can often identify what influenced what, but structural changes might be another thing--there might be similarities in different periods and styles. ...Noordzij's observations on history of writing and type are interesting partly because he is able to unite both to a degree.\n\n"
    },
    {
      "time": "14 Dec 2006 — 3:50pm",
      "content": "I didn't actually know for sure yet, but thanks for confirming!\n\n"
    },
    {
      "time": "15 Dec 2006 — 11:04am",
      "content": "\\>ideas of how this infobox could be structured to make it more useful\n\nTo address your question specifically, Possibly separating the issue of provenance--what faces it was influenced by--and form might be a step forward. In other words you would have different slots for these two. Now people try to put the two together--baroque rotated the pen, modern has greater contrast etc.--but maybe going forward possibly it will be simpler and more informative to do both, and if need be comment on the interaction.\n\n"
    },
    {
      "time": "16 Dec 2006 — 12:49pm",
      "content": "What comes to mind is Lawson's book “Anatomy of a Typeface” where he discusses variants of the same design. I think you're caught between saying \"This is basically what Bodoni / Garamond / Caslon look like\" with a few examples versus full blown and lengthy essays showing the historical versions in their entirety and all succeeding variants. It would be great to have the second alternative available on line, but it would truly be an encyclopedia: every version Garmaond ever cut plus all the metal, photo, digital versions. So how many years did you intend to spend on this, huh?\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "16 Dec 2006 — 2:19pm",
      "content": "I hope you don't mind - I'd like to switch this back to one of the topics in the original post. The showing of Helvetica on the Wikipedia site. There seems to be a large segment left out that can truly give a person more of an insight to why there are so many different Helveticas in the world. (Perhaps this can be extended towards other font families...while we are there - find out why Monotype, etc. removed the diamond punctutation from Goudy!)\n\nAfter Helvetica was released for Hot Type (one of the last faces to do so, and perhaps the very last - not sure) the typesetters in the USA fell in love with it and wanted it. The European foundry was extremely slow in making up sets (and many typesetters were already figuring in their costs of becoming cold type shops) that there were foundries here in the States that made their own.\n\nAs far as cold type went - that only made matters worse. Each shop again redraw their own. We are talking before \"digitalization for home computers.\"\n\nBTW - The US judges had agreed that 3 characters changed and a new name meant a new typeface.\n\nBerthold had the original drawings to make their fonts from and called it Helvetica.  \nMergenthaler/Linotype also had Helvetica.  \nHarris called their's Vega  \nVarityper's was called Mergaron  \nAlphatype was Claro  \nCompugraphic Helios  \nDymo was Newton  \nand Graphic Systems was called London Roman.  \nItek was HE\n\nIt wasn't until we started using Macs and IBMs/IBM Compatibles that places like URW introduced us to Nimbus Sans and let's not get started on Arial.\n\nJust had to share.\n\nBTW - owning an Alphatype typeshop at that time and having both Claro (then Alphatype was bought out by Berthold) and the Helvetica. I'd like to share a small story with you. When we finally got the \"real\" Helvetica, the Claro was put to the side never to be seen again. Helvetica letters fit without tons of extra kerning. They had a crisp look that didn't exist in the Claro.\n\nA job was set for a front cover of a computer book at Bantam Books by us. At the time, Len Leone Sr. was \"The Art Director.\" It was just before the ABA and the whole art department didn't have a second to breath. Len saw the type from our shop and stopped everyone in the department. He invited them into his office where for 2 hours he proceeded in giving a lecture about true Helveticas. He had been very happy to see...\n\nSo yes, in the eyes of the layman - (and American judges) all typefaces look the same... to those who have studied, used, worked with -- they are familiar with the little nuances that give each font their personality.\n\nP.S. You could always give credit to whose Bodoni you used....\n\n"
    },
    {
      "time": "16 Dec 2006 — 2:40pm",
      "content": "Paul, I think what you are confronting is that in the course of typographical history _proprietory_ designations of formally distinctive instances--or groups of formally distinctive instances--of sets of items within the typographical domain become / became _generic specifiers_ or _distinctive names_ for a class of things having some common characteristics or an array of family resemblences--as Bill suggests--and a common ancestry.\n\nThe thing to figure out is whether the category has come to have a the specificity of a species name or the generic qualities of a genus name. My impression is that Bodoni has the characteristics of a species designator, with all the variants being local varients (eg Linotype or Monotype Bodoni) or subspecies (eg., Filosofia). The term Garamond on the other hand, seems to cover a broader variety of forms whose commonalities have the lesser specificity characteristic of a genus or sub-genus, and whose ancestry is of a different rank. I don't know about Caslon.\n\nA relevent info box system might have to reflect this.\n\n"
    },
    {
      "time": "16 Dec 2006 — 3:20pm",
      "content": "george, i love the idea of a true encyclopedia of typefaces that runs the gamut of hot metal to phototype to digital (and whatever else i left out). this would be nice online, but i can just picture a big set of encyclopedias with appropriate samples of each face: with samples of faces produced using their intended application. of course, something like this would only be bought up by the ultimate collector and typenerd. but an online version would be a good resource too.\n\npeter, i like the genus/species correlation. i think the best solution is to just show one of the variations of a \"Bodoni\" and then as i have already implemented and as has been backed up by suggestion here is to credit which Bodoni is shown in the sample.\n\nthe real problem i'm facing for the wikipedia infoboxes now is categorization info. right now the typefaces are classified into \"categories\" falling into:\n\n<dl>\n</dl>- Serif typefaces\n- Sans-serif typefaces\n- Script typefaces\n- Blackletter typefaces\n- Display typefaces\n- Monospaced typefaces\n- Symbol typefaces\n- Faux typefaces\n\nand then sometimes having a sub-\"classification\", which can be some descriptor such as \"Modern,\" \"Humanist,\" \"Grotesque,\" \"Slab serif,\" &c. I'm not sure if this is an effective system, or another system would be better.\n\n"
    },
    {
      "time": "16 Dec 2006 — 9:53pm",
      "content": "Hey Paul\n\nI find it fascinating that you're posting this now; I meant to respond to it earlier. This is the subject of a master's degree I'm working on at the moment – never mind a first essay at Reading! (if they're in order, congratulations, BTW)\n\nPractically and conceptually speaking I have found this topic a real struggle and I think what you're attempting with the wikipedia info boxes for typefaces is very ambitious (possibly overkill for 'typical' wikipedia audiences as Don McCahill says). There are so many variables, and if you mean to apply it to all typefaces, well, an infinite range of subjects. Of course if you succeed with it we'll all be very grateful!\n\nIn the course of my studies I was inspired by much of what was said in the old typophile thread from early 2005\n\n[http://www.typophile.com/node/9757](http://web.archive.org/web/20150123085459/http:/www.typophile.com/node/9757 \"http://www.typophile.com/node/9757\")\n\nThis and other experience led me to conclusions about classifications and categorisations _per se;_ in practice, they're often unworkable howevermuch good intention and clarity of thought gets put in at the beginning. I had tried doing a Vox-based scheme much earlier, in 2004, that had 9 major categories.\n\n ![](http://web.archive.org/web/20150123085459im_/http:/typophile.com/files/aclassification_3905.jpg)\n\nCategories such as '3b - 19thC Newspaper Face' and '9a - 20thC Sans&Serif Families' were my attempt to get around traditional limitations of Vox as documented by Catherine Dixon in her work. The problem still becomes either the validity or the ballooning number of subcategories, as you're suggesting above. The earlier typophile thread used Barbedor as an example, but Karen Cheng (in her book about designing typefaces), shows Palatino, Angie Sans, Matrix, Melior, Alega, PMN Caecilia, Bell Gothic and Chicago, all as candidates that defy easy pigeonholing.\n\nOn advice from my supervisors (appalled at the potential scope of what I was looking at), I settled for a smaller sample for my study and went to work on Paul Shaw's list of [‘100 Top Types of all Time?’](http://web.archive.org/www.tdc.org/reviews/typelist.html) on the TDC site – I'm sure you know of it.\n\nPaul Shaw himself suggested\n\n_If you want to work on a database I think the first key step is determining the information to be included. Here’s a shot:_\n\nTypeface Family Name  \n Principal or Original Design  \n Designer(s)  \n Year(s) of Design  \n Year of Release/Publication  \n Foundry (with location)  \n technology (eg. Linotype, digital, transfer)  \n size range if metal  \n limitation notes (eg. capitals only)  \n alphabetic system (eg. Hebrew—or this database could be limited to Latin fonts which might be a good idea)  \n Revivals (with same info re: dates, foundries, limitations, etc.)  \n Pirated versions (if relevant—names, foundries, dates)  \n Family Members  \n (with same information as above if different years, designers, etc.)\n\nPaul's approach, like yours, is very detailed and rigorous, and to do it properly like this may take forever; I have had to settle for what I know can be achieved within my remaining timeframe. The more I get into it, the more the metal originals – the prototypefaces – come to be seen as the unimpeachable source. So current prototypes for a 'typeface profile' page for a proposed website have come to look like this\n\n ![](http://web.archive.org/web/20150123085459im_/http:/typophile.com/files/profile1_3981.jpg)\n\n ![](http://web.archive.org/web/20150123085459im_/http:/typophile.com/files/profile2_4042.jpg)\n\nWhen I say 'current equivalent' on these screens I just can't be literal about it; the digital fonts don't (and never will) match their earlier counterparts, so all we can talk about is a near-likely equivalent.\n\nBut when you say _Couldn’t these all just be called “variations”? Is there a reason Nimbus Sans is more legitimate than Swiss 721 BT?_\n\nWell yes there is, but the wikipedia forums might not be the place to argue about legitimacy – that might, and probably does, happen here.\n\nOne of the things this exercise did throw up was how unwilling I now am to make distinction between 'legit' and 'knockoff' versions of what is essentially the same thing; it's one of the things that I used to be uptight about and now find less relevant. In the case of making the profiles above, I decided that saying 'see also' withholds moral judgement and might encourage further research.\n\nFinally, if there is one traditional book reference that I think does this well, it would be Bartram and Sutton's ['An Atlas of Typeforms';](http://web.archive.org/web/20150123085459/http:/www.amazon.com/Atlas-Typeforms-James-Sutton/dp/1555213405) I've only seen the hardbound 1968 edition, but it really does put that notion of prototypefaces under the microscope.\n\n(Edit) apologies for over-long post!\n\n"
    },
    {
      "time": "17 Dec 2006 — 6:55am",
      "content": "Paul, maybe the information in the infoboxes should be less standardized and more adaptable to specific cases. The Helvetica one looks al right. But scrutinizing the Bodoni I thought:\n\nWhere there is no prototype the info box should contain a representative version such as has been done. The _Typeface_ should be it's proper name ITC Bodoni Seventy Two, and the _designer_ should be the designer of the representative example shown. This could appear just under the Typeface name. The sample should be labelled \"Represemtative example,\" or something like it.\n\nThe _category_ is ok as well, or at least I'll leave it alone for now. It could be renamed: _kind_.\n\nThe _classification_ might be expanded to identify it's classification under different systems, eg:  \n Vox: Didoni  \n xxx: Modern  \n AtypI: yyy  \n Bringhurst: zzz\n\nYou could add a category:  \n_Contrast type_: expansion\n\nThen there could appear a category:  \n_Creator of the genus / species_: Giambattista Bodoni  \nIn the case of Garamond:  \n_Originator of the family, or class_: Claude Garamond (family might be confounding)\n\nThen:  \n_Versions_ (identifying different types with Bodoni in their name)  \nand / or  \n_Varients_: Filosofia  \nand / or  \n_Spinoffs_: (like Arial in the case of Helvetica)\n\nHope this is useful.\n\n"
    },
    {
      "time": "17 Dec 2006 — 7:02am",
      "content": "Additionally, all this could link to something as comprehensive a Ludwig Solzen's categorizations, or the old Mundie _Field Guide to the Faces_ on line years ago.\n\n"
    },
    {
      "time": "17 Dec 2006 — 7:11pm",
      "content": "_the real problem i’m facing for the wikipedia infoboxes now is categorization info. right now the typefaces are classified into “categories” falling into:_\n\nIt was the anthropologist Levi-Strauss who pointed out humans are the only inhabitants of the planet who insist on categorizing things.\n\nThings created by humans don't fall into easy categories so I suggest stick with the obvious ones and let the rest fall where they may. There is no solution that will work for all. It's even difficult to devise a system for espresso machines and chain saws, much less something as culture / history specific as typefaces.\n\nI'm wholly in favor of categorizing things so they can be discussed and analyzed, but it's not easy and it's not pretty.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": "17 Dec 2006 — 7:14pm",
      "content": "i liked peter's suggestion of listing how the different existing systems would categorize these typefaces, and it fits with the way the infoboxes are set up already.\n\n"
    },
    {
      "time": "17 Dec 2006 — 8:06pm",
      "content": "George, a categorization question:\n\nWhich are the obvious ones, and which \"the rest\"?\n\n"
    },
    {
      "time": "18 Dec 2006 — 1:48pm",
      "content": "Paul, if you like the comparison between different existing systems then don't forget to include the PANOSE system as well. That was an attempt to sort this out rationally, that had a lot of good intention and clarity of purpose upfront, but never went anywhere practically – largely as a result of it not being adopted. Call me a pessimist, but I think [type-expertise.com](http://web.archive.org/web/20150123085459/http:/www.type-expertise.com/) and the [type-index.org](http://web.archive.org/web/20150123085459/http:/www.typeindex.org/) are headed the same way. Dennis Ravizza has written to me in the past about his plan and while it sounds plausible, the idea that it's private revenue-generating enterprise dooms it. Is this the reason why you chose the wikipedia as a vehicle?\n\nAs for Peter's remarks, well, no offence meant, but anyone who can list\n\n_Versions (identifying different types with Bodoni in their name)  \nand / or  \nVarients: Filosofia  \nand / or  \nSpinoffs: (like Arial in the case of Helvetica)_\n\nand then go on to ask another contributor about the relative exactitude of _their_ terminology has really put their finger on the underlying issue as far as I'm concerned. The good people at Monotype will offer you valid reasons for why Arial should be considered a _version_ or a _variant_ of Helvetica, so where does that leave your classification?\n\n"
    },
    {
      "time": "18 Dec 2006 — 2:53pm",
      "content": "\"no offence meant\" / \"where does that leave your classification\"\n\nNo offence taken.\n\nWhere it leaves my classification: the categories _version_, _varient_, _spinoff_ might well prove workable, but the example for _spinoff_ might easily have been ill-conceived, or maybe the category _spinoff_ itself is ill-advised.\n\nMy response to George was directed at the anti-classificatory sentiment I thought his comment expressed. Perhaps I was wrong about this.\n\nTo my way of thinking classifications are informative. A classification like _didoni_, or _garalde_, or _lyrical modern_, or [type of contrast] _expansion_, might not be as obvious as _sans serif_, but why would we not want to be informed of the story these terms seek to tell us, or stimulate us to see?\n\nTruth be told, I'm very interested in efforts at classification, including yours. In my files are an entire series of papers with titles like \"Classifications in their Social Context,\" \"Basic Objects in Natural Categories,\" \"Principles of Categorization,\" \"Ethonobiological Classification.\" My ATypI Vancover presentation on Henk Krijger's Raffia Initials was to a large degree an effort in typographical categorization. The subtitle read: \"Quirk-Notes on an Ambiguously Affiliated Generic.\" Triple-stroked display type with an abundance of flourishes doesn't say enough.\n\nIn the quest to be rigorous and scientific, the ethno-social and the heuristic dimensions of categoriztion are often overlooked.\n\n"
    },
    {
      "time": "19 Dec 2006 — 3:08pm",
      "content": "Actually Peter, _Triple-stroked display type with an abundance of flourishes..._ tells me much more than your (mistyped?) subtitle for the presentation ; )\n\nI didn't detect anti-classificatory sentiment in George's post. On the contrary, I think he's just being realistic about the challenges involved. Like you and me, he's in favour of classifications _per se_ for the sake of analysis and discussion. I'm putting my project together with the absolute certainty that it will probably provoke hair-splitting disagreement (and perhaps pedagogically, that might be more useful than consensus).\n\nWhen I started the project I found myself quoting Walter Tracy:\n\n_The classification of type designs is an unresolved problem... The fact is, any classification is simply an aid to study, not an end in itself. Once the student has got the characteristics of the groups firmly in mind and can 'place' any typeface without difficulty the actual names of the groups, and their precision and logicality [or lack of it] cease to be important._  \nTracy, Walter. 1986, 'Letters of Credit' pp.19 - 21\n\nBut the key challenge appears to me to me to get free of the semantic shackles that attach value judgements to phrases like 'spinoff', 'version' and 'variant' – because the common reading of these terms would suggest that they are not all equally legitimate. And that, with the typefounding industry's historical attitude to offering new product curiously simlar to the competition's best sellers, raises considerable questions for anyone attempting type classification.\n\nI mentioned PANOSE because, like Mundie's [Field Guide to the Faces](http://web.archive.org/web/20150123085459/http:/www.anthus.com/Typography/Faces.html) (still online), it's a classic example of going rigorously scientific at the expense of (as you say) the ethno-social and heuristic dimensions of the enquiry. In other words they make good examples for contrasting approaches to classification.\n\n"
    },
    {
      "time": "19 Dec 2006 — 5:58pm",
      "content": "This topic reminds me of the Ship of Theseus paradox for some reason.\n\n[http://en.wikipedia.org/wiki/Ship\\_of\\_Theseus](http://web.archive.org/web/20150123085459/http:/en.wikipedia.org/wiki/Ship_of_Theseus \"http://en.wikipedia.org/wiki/Ship\\_of\\_Theseus\")\n\n"
    },
    {
      "time": "19 Dec 2006 — 7:49pm",
      "content": "[my mistyped subtitle]\n\nI've changed the 'and' to 'an'.\n\n\"…tells me much more than your […] subtitle…\"\n\nThen you need to step inside. From my introduction: \"[I]n my subtitle ‘quirk-notes’ is meant to evoke a descriptive protocol, and ‘ambiguously affiliated generic’ to suggest a way out of a taxonomical conundrum. The descriptive protocol draws from the language of description used by cognitive scientists Douglas Hofstadter, Gary McGraw and John Rehling in their attempts to model creativity in the letterform domain. The taxonomical conundrum has to do with the fact that in different contexts of description the initials seem affiliated with different forms.\" So that is what I tried to show.\n\n\"But the key challenge appears to me to me to get free of the semantic shackles that attach value judgements to phrases like ‘spinoff’, ‘version’ and ‘variant’ – because the common reading of these terms would suggest that they are not all equally legitimate. And that, with the typefounding industry’s historical attitude to offering new product curiously simlar to the competition’s best sellers, raises considerable questions for anyone attempting type classification.\"\n\nHow do you propose to deal with this?\n\nI did not feel that Filosofia simply follows on a line with the various Bodonis, at least not in intent. And it strikes me that the 'norm violations' of a 'version' are more sytematic and structural than the incidental or ad hoc changes of a \"spin-off.\" So, business ethics aside, there seem to me to be differences in relation to the prototype that bear tracking.\n\n"
    }
  ]
}
