{
  "id": "30087",
  "title": "Photoshop CS3 Beta Available",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "This is a bit off-topic, but since so many here use Adobe’s Creative Suite, I think it’s germane enough. Adobe today announced that sometime tomorrow, the Photoshop CS3 beta will be available from labs.adobe.com for owners with license keys of Photoshop CS2, the Creative Suite, and various Video and Web bundles.\n\nFor a quick taste of some new features, head to [Layers Magazine](http://web.archive.org/web/20081205061021/http:/layersmagazine.com/adobe-photoshop-cs3-public-beta-preview.html), which has a free series of video tutorials from Terry White. For subscribers, NAPP has a [CS3 learning center](http://web.archive.org/web/20081205061021/http:/www.photoshopuser.com/cs3/index.html).\n\nGleaned quickly from NAPP’s info, here are some of the biggest new features in PS CS3:\n\n1. a new user interface (now it’s more similar to that of the updated Adobe video products and Lightroom)\n2. a big evolution of Camera RAW\n3. the “quick select” tool\n4. improvements to Curves and the Print dialog\n5. a black-and-white conversion tool\n6. Auto Align and Auto Blend, which takes some of Photomerge’s tools and makes them available to single photos\n7. many changes to Adobe Bridge\n8. Smart Filters (similar to non-destructive effects in Illustrator)\n9. improvements to cloning and healing (there’s now a Clone Source palette)\n\nThis is just a cursory list. The single feature I’m most excited about is Smart Filters, as I’m all for a completely non-destructive workflow. I may chime in sometime tomorrow with my actual impressions of it, if I’m able to download it. I am incredibly excited by this news; I wasn’t thinking that I would find out about PS CS3’s new features until Spring next year!\n\nP.S. [InDesign Secrets](http://web.archive.org/web/20081205061021/http:/indesignsecrets.com/photoshop-cs3-beta-to-be-posted.php) has some info on the beta release (but no features). The interesting thing is why they say that an InDesign CS3 beta in unlikely.\n\n [‹ When a typeface is no longer a typeface...](http://web.archive.org/web/20081205061021/http:/typophile.com/node/30080 \"Go to previous forum topic\") [0 vs. O ›](http://web.archive.org/web/20081205061021/http:/typophile.com/node/4810 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081205061021/http://typophile.com/user/11702\" title=\"View user profile.\">auricfuzz</a>",
  "time": "<br>",
  "uid": "11702",
  "comments": [
    {
      "time": " 14.Dec.2006 6.46pm",
      "content": "BTW, this beta is available for Intel-based Macs and PCs; they didn’t want to leave the PC users out in the cold like the did with the Lightroom beta.\n\nEDIT: And a terrific FAQ here from photoshopnews.com.\n\n"
    },
    {
      "time": " 14.Dec.2006 8.14pm",
      "content": "Looks pretty cool, but what’s the deal with Intel only? I’m on a Mac at work and might give this a spin but I run a dual core AMD based system at home. And why won’t they release a linux version? There are plenty of creatives who are a little bit geeky and don’t like being locked. If I had creative suite on linux I’d never boot windows again.\n\n"
    },
    {
      "time": " 14.Dec.2006 8.23pm",
      "content": "<cite>And why won’t they release a linux version?</cite>\n\nBecause they know that BSD Unix is superior to Linux, so it makes more sense to just stick with OS X, which plenty of Linux users graduate to eventually.\n\n"
    },
    {
      "time": " 14.Dec.2006 8.47pm",
      "content": "\\> Looks pretty cool, but what’s the deal with Intel only?\n\nWho said it was Intel only? “Photoshop CS3 beta will also run on PowerPC Macintoshes” - InDesignSecrets.com\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 15.Dec.2006 2.26am",
      "content": "Thanks, Thomas, for correcting me. It’s 5:25 EST (2:25 PST), and the Beta still doesn’t appear to be available from labs.adobe.com yet (unless I’m missing the link).\n\nEDIT: BTW, Thomas, do you happen to know of any updates to Photoshop’s typographic features? I didn’t hear of any changes to type or vectors on any website nor in screenshots.\n\n"
    },
    {
      "time": " 15.Dec.2006 8.33am",
      "content": "I couldn’t find the CS3 beta on the labs.adobe.com front page, but some blog searching turned up [this link](http://web.archive.org/web/20081205061021/http:/www.adobe.com/cfusion/entitlement/index.cfm?e=labs%5Fphotoshop) that should, once you’ve logged in with or created your Adobe ID, allow you to download the beta. Mine’s downloading right now! Exciting times.\n\nThe news is that you can download and use the CS3 beta even without a license key, but then it’s only for two days. With a license key, it’s largely indefinite (like Lightroom has been).\n\n"
    },
    {
      "time": " 15.Dec.2006 10.00am",
      "content": "You can find more information and the actual download link : [http://typophile.com/node/30100](http://web.archive.org/web/20081205061021/http:/typophile.com/node/30100)\n\nEnjoy.\n\nEaster Egg: (PC version) if you press and hold Control and click the “About Photoshop” link under the Help Menu, you get the alternative about screen featuring the Codename : Adobe Red Pill.\n\n(MAC version) Command instead of Control.\n\n"
    },
    {
      "time": " 19.Dec.2006 9.45am",
      "content": "[Adobe Photoshop CS3 Beta Resource Center](http://web.archive.org/web/20081205061021/http:/www.peachpit.com/promotions/promotion.asp?promo=3996&rl=1)\n\n"
    },
    {
      "time": " 19.Dec.2006 3.09pm",
      "content": "Photoshop still rules! I used Capture One/Pro one and found it made for photographers with little computer knowledge or care. It was made for studio volume processing.\n\nI recieved an email today from Apple for a trial download of Aperture.. but it’s Intel/Mac only.... I bought my Mac G3 about 2 years ago just to carry around for photography and now all I use it for is checking websites while watching TV because the I-Photo thing is useless. And Nikon’s software while a bit better is about as useless too.\n\nPhotoshop it will be forever.\n\nand don’t even f... talk about that crap I-Footo that comes with the mac that’s for children.\n\nand the Lightroom is a bit light for me too. It seemed better than Capture One but I’ll keep Photoshop.\n\n"
    },
    {
      "time": " 19.Dec.2006 3.20pm",
      "content": "But the wonders you can do with just the built in camera and assorted distortion effects, i.e., fisheye lens, in Photo Booth!  \n**Dan the Toad**\n\n ![](http://web.archive.org/web/20081205061021im_/http:/typophile.com/files/me_4386.jpg)\n\n"
    },
    {
      "time": " 19.Dec.2006 4.32pm",
      "content": "That photobooth tool is really crazy. Check out this:\n\n ![](http://web.archive.org/web/20081205061021im_/http:/typophile.com/files/243477953_642b1b8aa4_4702.jpg)\n\nThis was taken by [what you know](http://web.archive.org/web/20081205061021/http:/www.flickr.com/photos/29035936@N00/243477953/) and is from the [Mac Photo Booth](http://web.archive.org/web/20081205061021/http:/www.flickr.com/groups/macphotobooth/pool/) Flickr group.\n\n"
    }
  ]
}
