{
  "id": "30098",
  "title": "Conundrum: Use InDesign CS2 or Quark 6?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "The question is, on the surface, really a no brainer. The answer is use InDesign CS2. But let me tell you my problem and then hopefully some of you can give me experienced opinions.\n\nI have a client for whom I am to typeset/design 2 books. Previous to this the publisher which my client uses only had Quark 4. But, miracles do happen and they upgraded. They now have InDesign CS1 and Quark 6. I have very little experience with the .INX file format as for all other clients I handle the printing and so don't need to save backwards.\n\nMy question is this. If I do the books in InDesign CS2 and then export them as Interchange (.INX) files will the formatting be safe? Or should I just use Quark 6 and call it a day?\n\nThanks!\n\n",
  "author": "Miss Tiffany",
  "time": "15 Dec 2006 — 8:47am",
  "uid": "108",
  "comments": [
    {
      "time": "15 Dec 2006 — 9:14am",
      "content": "[http://www.markzware.com](http://web.archive.org/web/20131109020209/http:/www.markzware.com/ \"http://www.markzware.com\")\n\np.s. Sorry not my experienced opinion on this.\n\n"
    },
    {
      "time": "15 Dec 2006 — 9:20am",
      "content": "I've never had a problem with .inx, but know some who have. If it's possible to try saving another project down with the .inx, give that to them, and have them make pdf's from the file as it opens in CS1 and send them to you so you can check everything. Shouldn't be that involved.\n\n"
    },
    {
      "time": "15 Dec 2006 — 9:26am",
      "content": "That is a good suggestion, Eric. I will try that.\n\n"
    },
    {
      "time": "15 Dec 2006 — 9:50am",
      "content": "It is ridiculous that a publisher does not stay current. Buying them an upgrade to CS2 (or yelling at them until they upgrade) is better than the hassle of using Quark.\n\n"
    },
    {
      "time": "15 Dec 2006 — 11:30am",
      "content": "I worked for a major publishing company in spring 2005 using Quark 5 on OS 9. (Not kidding.)\n\n**Edit:** My bad, it was actually Quark 4. :)\n\nTiff, I _have_ had interchange files not work. I think that's risky business, particualry for such large text oriented documents. My computer _freaked_ the funk out when I tried to keep both Adobe CS1 and 2 on my 'puter. I had to trash all previous versions from my system. I would try checking with Adobe about it to see if there are any fixes or patches for this issue.\n\n"
    },
    {
      "time": "15 Dec 2006 — 11:31am",
      "content": "Oh...and problem with Quark 6 is its lack of OT features (amongst other things). I would steer clear.\n\n"
    },
    {
      "time": "15 Dec 2006 — 11:54am",
      "content": "I have had some .inf issues in the past with Ind but none lately after reinstalling clean and patching. That said, I would take the chance on .inf before swallowing the bitter pill of Quark ever again. I used to be a real Quark champion and used their product from the very first version. After years of self destruction, Quark proved to me that they didn't give a tinker's damn about their customers so I drop-kicked their piece of crap into the toilet where it belongs and havn't looked back since.\n\nChrisL\n\nPS: I know that was a bit wishy-washy Tiff. I will try to be more direct next time :-)\n\n"
    },
    {
      "time": "15 Dec 2006 — 12:06pm",
      "content": "_It is ridiculous that a publisher does not stay current._\n\nPerhaps not from their perspective.  \nObsolescence is also an ideological issue.  \nI try not to upgrade immediately on principle, and also to give 'em time to work the bugs out.\n\n"
    },
    {
      "time": "15 Dec 2006 — 12:20pm",
      "content": "<cite>I try not to upgrade immediately on principle, and also to give ‘em time to work the bugs out.</cite>\n\nWaiting for bugs to be dealt with is one thing (Not that Adobe cares enough to patch non-security stuff anymore...), but still using Quark 6, or for that matter the CS 1 suite, at this point is just silly. If nothing else updating everything to the CS2 suite brings in enough new time saving features that it should pay for itself.\n\n"
    },
    {
      "time": "15 Dec 2006 — 12:26pm",
      "content": "I haven't had problems with .inx files. My big beef with InDy vs. Quark is that it doesn't let you view linked images unless you actually have them. With Quark you can at least see them, and even enlarge, reduce, crop, etc. even if you can't print. InDy just gives me big grey squares. Real pain in my a\\*\\* as it required the client to gather these files from farflung sources and we lost nearly a week.\n\n"
    },
    {
      "time": "15 Dec 2006 — 12:53pm",
      "content": "Thanks for all of your feedback!! **I just found out that they have one machine upgraded to CS2. Miracles do happen.**\n\nThe sucky part is I still can't use OT because it was already like a death-match to get these guys to license the fonts back when we were all using OS 9 and Quark 4. But this is a huge step in the right direction.\n\nThis community spirit is wonderful. I'm so happy I can come to you (all) and know I can get feedback.\n\n"
    },
    {
      "time": "15 Dec 2006 — 12:54pm",
      "content": "Patty, I'm confused by your post. I routinely open InD files, created by other people, whose images are unlinked. I can see/scale the image (which is preview that InD created when the file was created, I believe).\n\nTiffany, is it imperative that the files go back to the client? Could you supply the final files to the printer?\n\n"
    },
    {
      "time": "15 Dec 2006 — 1:04pm",
      "content": "It is imperative, unfortunately.\n\n"
    },
    {
      "time": "15 Dec 2006 — 1:08pm",
      "content": "Patty, are you sure your grey boxes aren't just a display performance issue? I just opened an InD file, broke the link to its graphics, and I can still see previews of all of them. It's just that the display performance setting has to be set to at least \"Typical Display.\"\n\n"
    },
    {
      "time": "15 Dec 2006 — 1:50pm",
      "content": "You have to keep in mind that most of the features that were added in CS2 do not convert well when going the .inx route to Indy CS1.\n\n[http://www.adobe.com/products/indesign/newfeatures.html](http://web.archive.org/web/20131109020209/http:/www.adobe.com/products/indesign/newfeatures.html \"http://www.adobe.com/products/indesign/newfeatures.html\")\n\nThat said — most of these new features dont show up in regular docs ; )\n\n"
    },
    {
      "time": "15 Dec 2006 — 4:43pm",
      "content": "MY job just upgraded to cs2,what, 4 months before cs3? We were having trouble because some authors were sending us files in cs2, so they had 1 cs2 station.\n\n"
    },
    {
      "time": "15 Dec 2006 — 8:01pm",
      "content": "_Or should I just use Quark 6 and call it a day?_\n\nWell I'm relieved that they offered you a middle road, Tiffany. My position would have been to ask the publisher either to upgrade or to relinquish control over the final file handoff – strikes me as pretty unreasonable to expect both.\n\nLike Terry, I've had experience of multiple versions of ID not playing happily together, and the QX-to-ID conversion is simply an unknown every time one does it. None of this translates as the basis for a deliverable project to me.\n\nY'know, I never thought I'd find myself saying this here, but even if the choice were between _current_ versions of ID and QX, it would still be a no-brainer; this is based on recent observation of massive industry indifference to (and absence from) the Quark 7 launches in Australasia. Has it been the same in the US?\n\n"
    },
    {
      "time": "15 Dec 2006 — 9:37pm",
      "content": "<cite>MY job just upgraded to cs2,what, 4 months before cs3?</cite>\n\nFrom what I've read CS3 is more like six months out, but I'll be smiling if it only takes four. I'm still surprised how many businesses are on CS1, but I guess if you're not doing a lot of Illustrator/Photoshop work, it probably isn't a big deal.\n\n<cite>this is based on recent observation of massive industry indifference to (and absence from) the Quark 7 launches in Australasia. Has it been the same in the US?</cite>\n\nPretty much. Young designers have never used it and don't want to bother, older designers are still pissed about years of Quark not really doing anything special. And it doesn't help that the only cost that can make Quark competitive to Indesign would be less than zero.\n\n"
    },
    {
      "time": "16 Dec 2006 — 1:22am",
      "content": "_I’m still surprised how many businesses are on CS1, but I guess if you’re not doing a lot of Illustrator/Photoshop work, it probably isn’t a big deal._\n\nThe point is, Tiff's associate is a _publisher_ and anyone in that realm who accepts work from contractors or clients should have the latest version of all major DTP apps. Thankfully, they do.\n\n"
    },
    {
      "time": "16 Dec 2006 — 9:54am",
      "content": "I'm in the same boat as Tiff, without the Quark side of it: one of my main clients (comprising about 30% of my workload), is still on CS1. I tend to mock-up in CS2, set the book in CS2, then convert to CS1 before shipping them a PDF for proofing. This allows me to use many of the new features during the intensive stages of design & setting, but also builds in a certain safety net as any bugs that get introduced during the conversion process will be found during proofing. It's frustrating, and I've done my share of \"encouraging\" them to upgrade, but it's really not that big a deal.\n\n"
    },
    {
      "time": "16 Dec 2006 — 10:58am",
      "content": "I have the Display Performance setting on Typical and I'm still getting grey boxes. These are .inx files (I only have CS 1) could that be the problem? It's very frustrating.\n\n"
    },
    {
      "time": "16 Dec 2006 — 12:06pm",
      "content": "I have to say I'm thankful that they do have CS2. I was this close to just using Quark 4 as I don't have Quark 6, and I wasn't sure how well the .INX file would work.\n\nDuring the production stage of the last book I did for my client using this publisher, I harassed them and told them to join us in the 21st century. We joked about it. I guess some other people teased them as well. I'm very thankful they have CS2.\n\n"
    },
    {
      "time": "17 Dec 2006 — 4:00am",
      "content": "I think the \"grey boxes\" are solved in the latest update of InDesign CS1. Are you sure you have all the updates available? I remember there was a special update covering this \"grey boxes\" issue.\n\n"
    },
    {
      "time": "17 Dec 2006 — 8:15am",
      "content": "I'm still running CS1 as well, Patty, but I don't have the grey boxes: I'm not using .inx files though....\n\n"
    },
    {
      "time": "17 Dec 2006 — 8:56am",
      "content": "It's definitely an .inx thing. There is a patch available - I checked the Adobe site, but haven't downloaded it yet. One support doc I found claimed it only affected cross-platform files but I know the files I'm dealing with were created on a mac.\n\n...and it didn't work. I downloaded the update and no diff, still the grey boxes.\n\n"
    },
    {
      "time": "17 Dec 2006 — 12:35pm",
      "content": "May be the application generating INX files must be updated to its newest version too.\n\n"
    },
    {
      "time": "18 Dec 2006 — 7:22am",
      "content": "Miss Tiffany, do I missed something, but why do you have to send your file to your client in the Xpress source format?\n\nI'd suggested to you to work with Indsign CS2 and export your file in pdf for your client.\n\nI've recently bought the Markzware plugin Q2ID (also existed for ID2Q) and it works really well when I transfert file form Xpress to Indesign CS2. Nothing is losted. I've encountered minor problem when I've printed the job I've transfered, but now it's solved. I've had to resave in an other format some image which one was'nt printed out at the final output.\n\n"
    },
    {
      "time": "18 Dec 2006 — 7:26am",
      "content": "My client was importing Quark files into InDesign 2 and then converting them to .inx files for me. So there were several stages where the problem could have arisen. She ended up sending me the original Quark files and I had to (laboriously) copy the images into the InDy files. Which meant I had to re-silhouette some of the images. I know I need to upgrade to CS 2 but it's gonna hurt and I thought this .inx work-around would help me postpone it a little longer.\n\n"
    },
    {
      "time": "18 Dec 2006 — 12:08pm",
      "content": "The publisher for my client DOES AFTER ALL have CS2. Thank the gods on Mount Olympus! So there will be no moments when the file could fall apart.\n\n"
    },
    {
      "time": "18 Dec 2006 — 12:49pm",
      "content": "not to further hi-jack this great thread, but...\n\nthe grey box thing is an .inx issue. the .inx file is just XML so when the file is opened, InD has to reconstruct everything, including the jpeg previews of all images. the fact that it doesn't retain the image info is actually a blessing because it's the only way to drastically reduce file size with an image-heavy doc.\n\n"
    },
    {
      "time": "19 Dec 2006 — 3:44am",
      "content": "Biddy - you must be at Berkley Books! LOL\n\nMeanwhile, just wanted to share that many times designers forget that they are working with outside suppliers. Many printers are scared of the \"next\" generation. When Quark 4 started working after the debugging (originally only page 1 would get screened and none of the other pages in the document would) and it worked well with Illustrator 5.5 and 6.0 and Photoshop 4 (or was that 5) the printers were celebrating. They had spent nearly 100 years getting their shops to perform efficiently -- and then technology showed up.\n\nI am on Quark 6 -- and with the printers I deal with, I would want no other program. I have InDesign here, and I have had to use it on occasion, but find it awkward. But that's me; after all, I was an original Beta and Gamma tester for Quark and have stayed loyal. I own Quark 7 -- but because my main printer doesn't own it yet - which means he does, but hasn't perfected it on his equipment yet -- there is no reason for me to move on at this point.\n\nI do know that one particular printer in Pennsylvania adores Indesign and has started insisting his customers all switch over. But it's odd. Most printers convert our files to .eps and onto .pdf -- and btw, Quark 7's pdf's are easily recognized by old equipment.\n\nJust my two cents worth.\n\n"
    },
    {
      "time": "19 Dec 2006 — 7:28am",
      "content": "I don't understand why InD (in CS2) can't come up with a better way to save the file down. Nearly every other program (even notoriously un-user-friendly Quark) gives you this option, even tho you know you may lose some of the features.\n\nI still use primarily Quark too - mostly because it is my \"first\" language, and when I use InD I still feel like I have to translate. I'm sure that over time I'll get more comfortable with it. More and more of my clients are switching over to it, so I gotta ride the wave.\n\n"
    },
    {
      "time": "19 Dec 2006 — 8:22am",
      "content": "Interesting. It's rare here to find anyone using Quark, although I did have an interview at a publisher a couple of weeks ago, and that's the only thing they use. (Heck, you can chart the changes companies I work for have gone through by leafing through my portfolio! ;-) )\n\nMostly everyone's switched to CS (although not necessarily 2): I need to upgrade my box to run Illustrator CS2, which is the only reason I'm still running CS1.\n\n"
    },
    {
      "time": "19 Dec 2006 — 10:13am",
      "content": "It's just this old dog not wanting to learn new tricks. I was late to switch to OS X too because I was so comfortable in OS 9 and of course once I did I couldn't believe I waited so long. I'm getting more and more used to InD but I still have clients (yes, publishers) who require Quark as well and it's still my default go-to software when I need to do something quickly.\n\nAnd (gulp) I'm gonna need to plunk down for CS 2 soon. Ouch.\n\n"
    },
    {
      "time": "19 Dec 2006 — 10:33am",
      "content": "Patty you might want to upgrade to CS2 before CS3 is released as I think the upgrade price from CS1 to CS3 will be even more to swallow.\n\n"
    },
    {
      "time": "19 Dec 2006 — 10:35am",
      "content": "Ah but two upgrades? It might be best to just purchase CS3 new. When is the release date?\n\n"
    },
    {
      "time": "19 Dec 2006 — 11:31am",
      "content": "I'd guess end of first quarter.\n\n"
    },
    {
      "time": "19 Dec 2006 — 2:43pm",
      "content": "Yeah, I was late to OS X too, but it's been worth it. I'll upgrade to a Mactel box when most of everything I want/need/desire runs native -- until then, my G3 with as much memory as I can cram into it will have to do.\n\nDespite the limitations....\n\n"
    },
    {
      "time": "19 Dec 2006 — 7:02pm",
      "content": "Dang, you're still on G3??? Wow. Here's my 2 cents: get an iMac from the Apple refurb dept. You can save up to 40% - I got a late model 20\" souped up pre-Intel for $1299. They must have Intels by now too.\n\n"
    },
    {
      "time": "19 Dec 2006 — 7:08pm",
      "content": "Heck, this is only my third box, and I bought the first one in 1988. ;-)\n\nI might bribe my brother-in-law with some cash for his 20\" G5 if he wants to upgrade when we visit in March. He has a much greater need for speed than I do....\n\n"
    },
    {
      "time": "19 Dec 2006 — 8:31pm",
      "content": "My third too... and each one cheaper than the last. My first was a Mac II CI for $3500 (just the CPU), greyscale monitor for about $2000 and laser printer for about $2000 as well. 8 MB RAM. But... I had it for years and years.\n\n"
    },
    {
      "time": "20 Dec 2006 — 5:01am",
      "content": "Patty, you sound just like me! Old dog -- comfy with System 9 -- Quark default go-to software. I live and work out in the boonies in complete isolation, and used to be able to take care of everything in system 9, trouble-shooting printing and the network, etc. Once I moved to X I lost all that ease, although I'm slowly learning X.\n\nInDesign? I bought the whole CS suite when I upgraded Photoshop (I do a lot of work as a photographer so that's an essential tool) so got ID and swore I would learn it. But every big project that came along, I would stay with Quark. Now I have upgraded to CS2 and am still in the same boat: I simply have to commit to using CS2 on a real project and jump in feet first. Meanwhile my largest client and I do everything in Quark 6.5. I've been using Quark since 1986 and despite all my complaints about customer service, company attitudes, etc. I find I can think more intuitively in it than anywhere else.\n\nI used to have a 21 inch SuperMac grayscale monitor and really miss it -- I found it to be so restful and neutral for working with lots of type on the page, but at some point, I think when I got my G3 back in 1993, I could no longer get it to sync up with newer computer.\n\nBruce\n\n"
    },
    {
      "time": "20 Dec 2006 — 11:23am",
      "content": "_but I guess if you’re not doing a lot of Illustrator/Photoshop work, it probably isn’t a big deal._\n\nAu contraire mon freire! Live Trace in Illustrator has saved me HOURS of work; time I'd waste converting vector art in Flash.\n\n_Biddy - you must be at Berkley Books! LOL_\n\nNope, one of the NY magazine publishers. They refused to switch to later versions of Quark because they were \"too buggy.\" :)\n\nBack on the InD Quark debate: the both have their moments. I curse them both. Quark handles images (wrap around text) much better than InDesign. It drives me to distraction making clipping paths in Photoshop only then having to draw a vector outline in InDesign for my text. Much easier in Quark.\n\nNo drop shadows in Quark (until v. 7). (BOO!) I like InD drop shadow feature, but they still have transparency issues when ripping to a printer of making a PDF. (DOUBLE BOO!) But the type...oh the type in InDesign makes all the headaches worth it. I've already gotten used to InD OpenType menu, and Quark JUST got one. Way to stay ahead of the curve. My evaluation: Quark for image based layout, InDesign for text based.\n\n"
    },
    {
      "time": "20 Dec 2006 — 12:26pm",
      "content": "\"It drives me to distraction making clipping paths in Photoshop only then having to draw a vector outline in InDesign for my text. Much easier in Quark.\"\n\nHuh? Using InD's text wrap palette, in the Countour drop down, select \"Photoshop Path\" or \"Same as Clipping.\"\n\n"
    },
    {
      "time": "20 Dec 2006 — 12:31pm",
      "content": "\"Quark for image based layout, InDesign for text based.\"\n\nYou're kidding, right Terry? You'd give up InD's easy back-n-forth with AI/PS, the ability to feather images, a robust bezier tool, PS layer control from within InD...?\n\n"
    },
    {
      "time": "20 Dec 2006 — 12:32pm",
      "content": "_Huh? Using InD’s text wrap palette, in the Countour drop down, select “Photoshop Path” or “Same as Clipping.”_\n\nDoesn't always work. Particularly on EPS files with white backgrounds. Trust me, I've tried that feature. Have yet to have it work properly.\n\n"
    },
    {
      "time": "20 Dec 2006 — 12:36pm",
      "content": "_You’re kidding, right Terry? You’d give up InD’s easy back-n-forth with AI/PS, the ability to feather images, a robust bezier tool, PS layer control from within InD…?_\n\nI'd give up nothing, they both have their flaws. I use InDesign exclusively. I used to use Quark exclusively. They both have a ways to go in terms of functionalty. In an ideal world I could buy both. But until that day comes I choose InDesign. I'm just waiting for the two programs to have a kid— that would be awesome.\n\n"
    },
    {
      "time": "20 Dec 2006 — 3:01pm",
      "content": "_I’m just waiting for the two programs to have a kid— that would be awesome._\n\nI always thought InDesign was supposed to be love child of Quark and PageMaker, but it seems still skewed towards PM's \"strengths.\"\n\nCertainly, CS 1 and 2 are a massive step-up from InDesign 1.5, which I used at one client's office for a project: now **that** was a clunker....\n\n"
    },
    {
      "time": "20 Dec 2006 — 4:35pm",
      "content": "I just want InD to be reborn without birth defects.\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2006 — 4:35pm",
      "content": "I thought Quark was still better for fine typesetting work, but I haven't used InD enuf to get to know kerning etc. Still getting used to different numeric values for tracking/kerning.\n\n"
    }
  ]
}
