{
  "id": "3009",
  "title": "Pablo Donoso",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I guys, i woukd like your feedback in this one.   \n   \nPablo Donoso is an 18 years old car driver, he has been very succesfull in all the categories he had drive, in 2003 he drove on his first year in europe in Vergani Racing in the World Series Light category, in 2004 he changed to GD Racing and was promoted to the World Series, with drivers older than them, and having Enrique Bernoldi (ex F1 driver) as a team mate. He is a very promising car driver in Chile, and we are beting that he will get to the F1.   \n   \nI've been working with a journalist, his manager and a marketing specialist on his identity since november, and on march we wil launch his new website.   \n   \nlook here!!!   \n [www.pablodonoso.com](http://web.archive.org/web/20150419104533/http:/www.pablodonoso.com/)   \n   \nI would love to have comments on the logo, any improvements we are still on time to do it.   \n   \nthanks   \n   \nCG\n\n",
  "author": "cgonzalez",
  "time": "6 Feb 2004 — 6:41am",
  "uid": "659",
  "comments": [
    {
      "time": "6 Feb 2004 — 8:45am",
      "content": "here is the logo   \n   \n   \n ![donoso](http://web.archive.org/web/20150419104533im_/http:/www.typophile.com/forums/messages/29/25783.gif)   \n   \n   \nCG\n\n"
    },
    {
      "time": "6 Feb 2004 — 9:16am",
      "content": "1) That greeen squiggle is trying to be read.   \n2) What about incorporating the guy's freckles (those spots on his face) subtly into the logo somehow? It IS a personal site.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Feb 2004 — 9:32am",
      "content": "I am enjoying this. Nice idea.\\   \n   \nSome observations:   \n   \nIt took me some time to see the car in the design, which doesn'nt bother me. I think I wanted the green stroke to be a word (zoom?)   \n   \nBut once I saw the car, I enjoyed it.   \n   \nThe car is driving downhill, could the weight of the mark become more stable if the car were leveled?   \n   \nThis idea may be ruinous, but put motion lines in the bottom of D for speed?   \n   \nAlso, concerning the weights of the letters, the D,O and O increasingly stick out to me more and more as I look at it. Reweight?\n\n"
    },
    {
      "time": "6 Feb 2004 — 1:12pm",
      "content": "Try making the nes either a tint of gray or make it the green or the car doesn't read as a car. Overall I love the loose feel, its like racing.\n\n"
    },
    {
      "time": "11 Feb 2004 — 12:10pm",
      "content": "Love it, but I too had a hard tiem seeing the car at first. I'm not sure what can be done to make it a touch more obvious (without being overt), but I'd explore it, if I were you. Keep it lose, keep it subtle, but maybe try to bring that car out just a \\*touch\\* more.\n\n"
    },
    {
      "time": "11 Feb 2004 — 12:34pm",
      "content": "This is unbelievable!   \nReally. Award winning, bravo.   \n   \nRandy\n\n"
    }
  ]
}
