{
  "id": "30096",
  "title": "Energy company logo design",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi,\n\nI designed some logos for an energy consultant and technical services provider.  \nThey are first round design. I din’t tune fonts and shapes and it’s only for showing first concepts.\n\n ![](http://web.archive.org/files/Energy_4222.Comapny.Logos.png)\n\nany comment, critique, suggestion are appropriated.  \nThank you\n\n",
  "author": "<a href=\"user/10503\" title=\"View user profile.\">Mamouri</a>",
  "time": "<br>",
  "uid": "10503",
  "comments": [
    {
      "time": " 15 December, 2006 - 6:58am",
      "content": "Hello Muhammed,\n\nWhat do the logos represent? I think you must not put a pattern in the typography, and use an other typeface than the ones you used.\n\nPieter\n\n"
    },
    {
      "time": " 15 December, 2006 - 9:14am",
      "content": "Hi Peiter\n\nThis logos want to represent energy and because energy actually is movement, all of them want somehow show move and movement. Choosing pattern in the first and forth logo want show this theme.  \nBut I think you are right. using pattern was not good way for showing this theme. I should think about another way.\n\nThank you\n\n"
    },
    {
      "time": " 15 December, 2006 - 12:20pm",
      "content": "My recommendation:  \nIf this is a serious company, choose better typefaces - less quirky, nice and neat, and easier to read.\n\nFor now, I’d stick to a neutral typeface until you can get exited about a solution for the logo. Ones this is clearer you can look for a typeface to match the character of the mark. But remember, if you want to portrait a serious and trustworthy company you may want to choose one of the classic corporate typefaces.\n\nLogos:  \n1) looks like computer/games/software company  \n2) looks like a sign for parking your car  \n3) does not look original  \n4) I’m not so keen on the overlap  \n5) To me this is the best result. I’m not so keen on the fill in the middle. I’d try to separate the 3 elements and try different positions. Try re-shaping these things.\n\n"
    },
    {
      "time": " 15 December, 2006 - 11:55pm",
      "content": "With fonts, you usually get what you pay for. These all **look** like free fonts, and they make the logos look cheap.\n\nDid you do any sketching by hand before coming up with these? My gut tells me you didn’t. I’d seriously recommend doing some doodling with good old pencil and paper before even sitting down in front of a computer.\n\nLogo 1: What does the ‘X’ represent? The mark is too simplistic. The typeface choice is absolutely horrendous, and definitely not suitable for a business that wants to be seen as professional.\n\nLogo 2: This has the least offensive type, but it still doesn’t convey a sense of professionalism. I think I see what you’re trying to do with the mark (a ‘P’ inside an ‘n’) but it doesn’t work - I had to really stare at it for a while, and I’m still not sure that it was intentional.\n\nLogo 3: The mark is reminiscent of the “Screen Gems” logo, but also something else I can’t put my finger on. The type is a poorly-drawn clone of a real typeface (Compacta), and it shows.\n\nLogo 4: Again, I don’t see the significance of the mark. The shapes overlap in an awkward manner, and you’re using the same horrible type from logo 1.\n\nLogo 5: Overall, this is the best of the bunch, but I could swear I’ve seen the mark before. The type is, again, poorly drawn, and the character widths are disproportionate.\n\nSorry to sound so harsh, but there’s really nothing in these logos that works very well. I’d suggest scrapping everything and starting from scratch using professionally designed fonts. If cost is an issue for you, go to [http://www.myfonts.com](http://web.archive.org/web/20070126142424/http:/www.myfonts.com/) or [http://www.fontshop.com](http://web.archive.org/web/20070126142424/http:/www.fontshop.com/) and use their previews to mock up a logo for the client. When it comes time to create the final logo, the client should pay for the font license.\n\nGood luck with this, and don’t let the criticism discourage you. Keep posting your progress :)\n\n- Lex\n\n"
    },
    {
      "time": " 16 December, 2006 - 4:25am",
      "content": "I ll just chime in with the posts above; i reckon that the last logo mark is the only one worth pursuing, loose the gradient in the middle, choose a more serious typeface that will translate well across all applications. Maybe try to color the different elements of the mark, showing diversity. Good luck with the project.\n\n"
    },
    {
      "time": " 16 December, 2006 - 4:56am",
      "content": "spirelli, Thank you for your saying your impression about each font.  \nLex, Thank you for your useful ciritque. Actually idea of logo 5 is not mine and I grabbed it from somewher I did’t remeber but it redesigned by me. In fact I’m not natively english spoken and I didn’t have enough information about typefaces.  \nSebastian, Thank you for your comment\n\nI will try to use your useful crtique and design a new logo from scratch.\n\nThank you\n\n"
    },
    {
      "time": " 18 December, 2006 - 1:05pm",
      "content": "Hi again!\n\nI make a new variation of logo 3 and 4. I like to know your idea about this one. How this look? does it look original? What is your idea about typeface.\n\n ![](http://web.archive.org/files/arm1-3_5425.jpg)\n\nAny comment is welcomed.\n\nThank you\n\n"
    },
    {
      "time": " 18 December, 2006 - 1:28pm",
      "content": "Generally does it make sense to use such curves for repressing energy? Does that work for you? Can you guess that this is a logo of energy consultant and technical services company without reading the name?\n\nPlease being frank. If you thought it’s crap already, please say it explicitly.\n\nThank you\n\n"
    },
    {
      "time": " 18 December, 2006 - 4:35pm",
      "content": "If you’re going to work a mark and words into a logo together, you need to make sure that the mark doesn’t overpower the words. The centered all-caps type looks like it was done in MS word.\n\n"
    },
    {
      "time": " 18 December, 2006 - 6:52pm",
      "content": "The mark is two Nike Swooshes. A [link](http://web.archive.org/web/20070126142424/http:/www.grupthink.com/topic/288) to one of numerous blogs/discussions/articles on the overuse of the “swoosh”.\n\n"
    },
    {
      "time": " 18 December, 2006 - 7:13pm",
      "content": "I’m not suggesting you cogged it but I’ve seen the fifth in [_Soak Wash Rinse_](http://web.archive.org/web/20070126142424/http:/www.amazon.co.uk/Soak-Wash-Rinse-Tolleson-Design/dp/1568981988/sr=8-1/qid=1166493530/ref=sr_1_1/202-7646297-5028630?ie=UTF8&s=books) by [Tolleson Design](http://web.archive.org/web/20070126142424/http:/www.tolleson.com/) on their mark research page for the Liz Claiborne project. They display a plethora of research marks, mostly generic symbols, that could be applied to myriad corporations.\n\nI would advise further research…\n\n"
    },
    {
      "time": " 19 December, 2006 - 4:56am",
      "content": "Question - Is Pooyesh Energy & Niroo a new company? If not, did they have a logo before? Were they happy with it? Did it just have to be brought into the 21st Century?\n\nI think you are getting a lot of good advice from the fellow-designers here, but I think we are lacking some of the basics. You say it’s an energy company - what kind of energy?\n\nIs it a young company with eyes on the future — is it an old steadfast company that has helped a country get to where it is today?\n\nIs there a way for you to think more about who and what this company is - and then form an idea of a logo?\n\nYes, time to go back with pen and paper and work this out. And yes, we all know how difficult it is - but try to design this from the heart - and I think you will get there.\n\nP.S. Though commercial fonts are fine - some aren’t. Just like not all free fonts are bad… also, remember, not all free fonts are free, when used commercially a fee must be paid.\n\n"
    },
    {
      "time": " 20 December, 2006 - 12:28am",
      "content": "Just some things to ponder, or explain to us.\n\nIs brown mandatory?\n\nIs brown and light brown the best pair to say “energy”?\n\nWhat is an “energy consultant and technical services provider”?\n\nDoes the graphic have to exist at all?\n\nCan the graphic be used in the place of a letter and be meaningful in that use?\n\nWhat word or words do you want to emphasize? All three? One in particular?\n\nIs a ‘&’ better than an ‘and’?\n\nWhat are you implying with each choice you make, like all caps, or all lower case, tight or loose spacing?\n\nWhat do you want the view to think/feel?\n\n[Choz Cunningham](http://web.archive.org/web/20070126142424/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20070126142424/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20070126142424/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": " 21 December, 2006 - 12:49am",
      "content": "\\>\\> Question - Is Pooyesh Energy & Niroo a new company? If not, did they  \n\\>\\> have a logo before? Were they happy with it? Did it just have to be  \n\\>\\> brought into the 21st Century?  \nIt’s new company and they did not have logo, yet\n\n\\>\\> You say it’s an energy company - what kind of energy?  \nAny kind. In fact any kind of energy (for example in powerhouse) is included.\n\n\\>\\>Is there a way for you to think more about who and what this  \n\\>\\> company is - and then form an idea of a logo?  \nActually this is young company owned by guys whom were working in the field in other companies and now want to have their own company.\n\n\\>\\>Yes, time to go back with pen and paper and work this out.  \n\\>\\>And yes, we all know how difficult it is - but try to design  \n\\>\\>this from the heart - and I think you will get there.  \nYou’r right. may be I have problem in basic. actually I have no idea about energy and how I can represent it. Also I’m not sure about creating a typeface only logo or a drawing.  \nAlso this is a local company in MiddleEast so I should think about creating a local in Arabic language for local industries. This is serious problem for me and I completely confused about that.\n\n\\>\\> Is brown mandatory?  \nActually, No. I thought maybe Yellow represent energy. Because always danger symbol that are placed in energy firms and powerhouses indicating there are dangerous electricity are in yellow:  \n [http://images.google.com/imgres?imgurl=http://www.wpclipart.com/signs\\_symbol/yellow/DangerElectrique.png&imgrefurl=http://www.wpclipart.com/signs\\_symbol/yellow/index.html&h=144&w=156&sz=9&hl=en&sig2=tx7Owq0nK64vuo2918csag&start=8&tbnid=YChuxnB6o5jeDM:&tbnh=90&tbnw=97&ei=tjqKRd3mEMX2wQGVs7zrDA&prev=/images%3Fq%3DDanger%2BSymbol%26svnum%3D10%26hl%3Den%26lr%3D%26client%3Dfirefox-a%26rls%3Dorg.mozilla:en-US:official%26hs%3DnZx%26sa%3DN](http://web.archive.org/web/20070126142424/http:/images.google.com/imgres?imgurl=http://www.wpclipart.com/signs_symbol/yellow/DangerElectrique.png&imgrefurl=http://www.wpclipart.com/signs_symbol/yellow/index.html&h=144&w=156&sz=9&hl=en&sig2=tx7Owq0nK64vuo2918csag&start=8&tbnid=YChuxnB6o5jeDM:&tbnh=90&tbnw=97&ei=tjqKRd3mEMX2wQGVs7zrDA&prev=/images%3Fq%3DDanger%2BSymbol%26svnum%3D10%26hl%3Den%26lr%3D%26client%3Dfirefox-a%26rls%3Dorg.mozilla:en-US:official%26hs%3DnZx%26sa%3DN)\n\nAlso special kind of hat that engineers wear always is yellow.  \nUnfortunately, Now I think this idea is not working.\n\n\\>\\> What is an “energy consultant and technical services provider”?  \nIn more technical word it’s and Engineering, Procurement and Construction (EPC) company:  \n [http://en.wikipedia.org/wiki/Engineering%2C\\_Procurement\\_and\\_Construction](http://web.archive.org/web/20070126142424/http:/en.wikipedia.org/wiki/Engineering%2C_Procurement_and_Construction)\n\n\\>\\> Does the graphic have to exist at all?  \nI should translate logo to arabic for use in middle east countries so I want to have a fixed graphic that exist in both english and arabic version.\n\n\\>\\>What word or words do you want to emphasize?  \n\\>\\>All three? One in particular?  \nPooyesh\n\n\\>\\>Is a ‘&’ better than an ‘and’?  \nI’m not sure. May be ‘and’ is better.\n\n\\>\\>What are you implying with each choice you make,  \n\\>\\>like all caps, or all lower case, tight or loose spacing?  \nAgain I’m not sure about that, too. What do you think? Can you suggest which one is better for this case?\n\n\\>\\>What do you want the view to think/feel?  \nAll I want is representing ENERGY concept in a graphic. Because I thought energy in fact is kind of MOVEMENT, all logos are representing somehow this cocenpt (movement)\n\nThank all folks here for helping me\n\n"
    },
    {
      "time": " 21 December, 2006 - 10:14am",
      "content": "When I think of energy in a visual sense, I think immediately of two things, lightening and potential. Lightning has a long tradition of use as a icon for power plants, power companies and such, and would have a rather dated look without a really innovative approach. Not that thats a bad thing. Potential, on the other hand, I visualize as somthing like a mechanical-looking turbine windmill or pinwheel. Or a battery, and it’s sub images of + and -.\n\nSwooshes, while they could be worked into any of those shapes, are overused, although I find them still appropriate in sport and exercise related works.\n\nIn energy related stuff, I think Black/Orange, Red/White, Black/Yellow  \n are safe choices, or at least a place to start.\n\nI also wonder, if you want to emphasize the ‘Pooyesh’, you might want to put it in caps on its own line, and Title-case the other words under it, trying the ‘&’ and the ‘and’ to adjust the scale.\n\nI would look for a more businessy or classic typeface, and let the artwork be the stimulating part.\n\nIf you feel overwhelmed, drop one aspect of the task for now. Maybe build the graphic first, then develop the nameplates for both languages simultaneously after you have a great image. Or, the reverse.\n\nYou might toy with the idea of building the title area to include both English and Arabic in one arrangement.\n\nGood luck, let us know where this ends up!\n\n[Choz Cunningham](http://web.archive.org/web/20070126142424/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20070126142424/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20070126142424/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": " 22 December, 2006 - 9:05am",
      "content": "I like the 3rd on down. The image dipicts a flame but in an abstract way and i like it but is this company supplying gas or electricity or both?\n\n"
    },
    {
      "time": " 22 December, 2006 - 11:22am",
      "content": "\\>\\>I like the 3rd on down.  \nWhich one do you refer? 3rd from up? it’s not looks like a flame. I think it the 4rd one that represent a flame. The 3rd one is likes two man that take each others hand.\n\n"
    },
    {
      "time": " 23 December, 2006 - 7:31am",
      "content": "Mamouri, 3rd one from top or bottom. It still points to the same one. I have seen something similar in the UK for an energy company. So to me, that represents energy because i understand it as an energy company here in the UK but maybe others wouldn’t relate to it as it does to me because probably they may have not seen any logo like this for that kind of industry. If you see what i mean. Common cliches but maybe not else where in the world.\n\n"
    },
    {
      "time": " 27 December, 2006 - 1:06pm",
      "content": "Can I suggest don’t use a graphic for energy, but make the type say power. Why, energy = power. A strong type logo without any graphics might be the way to go.\n\n"
    }
  ]
}
