{
  "id": "30108",
  "title": "Preventing shapes from snapping to baseline grid (indesign cs2)",
  "forum": "Build",
  "tags": [

  ],
  "content": "I'm running Indesign CS2 on a Mac, and I'm having problems with vector shapes snapping to the baseline grid when I move or resize them. It happens intermittently, and I can't find a setting that allows me to turn this on or off. Page grid snapping is disabled, and the baselines in question are often nowhere near my guides, so I'm sure that's what it's snapping to. Does anyone know how to turn this off?\n\n",
  "author": "<a href=\"/web/20111229202745/http://typophile.com/user/14722\" title=\"View user profile.\">Dunwich Type</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": "",
      "content": "On my Windows version of ID CS2, going to View\\>Grids and Guides and toggling \"Show Baseline Grid\" to \"Hide\" does the trick, although, of course, you can no longer see the baseline grid. But there's a quick keyboard shortcut (My guess is that it's Cmd-Option-' on Mac).\n\n"
    },
    {
      "time": "",
      "content": "Hiding it doesn't make it stop snapping to it. Oddly it only seems to start happening after I've configured the baseline grid and started aligning text to it. But I just can't see how or why it would try to align vector shapes to it...\n\nCome to think of it, I never ran into this problem on my G4 Powerbook. Maybe it just a Mactel issue, sort of like when all my 10-point type suddenly resets itself to 8.97893523...\n\n"
    },
    {
      "time": "",
      "content": "Maybe it is a Mactel issue, since on my PC, that's really all there is to it. But when I use baseline grids on Macs, both text and shapes snap to them, and I think that hiding it does the trick. Two suggestions: Does changing the spacing of the baseline grid in ID's preferences change where your vector shapes snap? Do you by any chance have grids or guides on any non-visible layers, hidden behind other objects, or with no or transparent strokes?\n\n"
    }
  ]
}
