{
  "id": "30101",
  "title": "Foundry/Retailer webiste most important features.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Just curious as to what typophile think is important, and is not? Big displays of type? ability to preview font using type testers? PDF specimens? Top sellers list? New releases? Ease of navigation? Explanations of OpenType features? You tell me!\n\n",
  "author": "paul d hunt",
  "time": "15 Dec 2006 — 10:09am",
  "uid": "7006",
  "comments": [
    {
      "time": "15 Dec 2006 — 10:50am",
      "content": "KEY WORD SEARCH!! That is the main reason I turn to myfonts over fontshop.\n\nType tester/preview is also v. important. I'm less interested in pdf specimens, top sellers, new releases, newsletters, etc.\n\nFree font giveaways/promos are nice too.\n\n"
    },
    {
      "time": "15 Dec 2006 — 11:11am",
      "content": "Ease of navigation. I have a problem with P22 for one, because the \"collection\" basis is not only unimportant to me but not the least bit helpful. I poke around in the \"sitemap\" page hoping to find something more friendly. Eventually, I find a page which has a listing of catagories such as style, art period, and year of design. This helps better than the collection thing so I think it should be on the homepage and part of the top nav throughout.  \nKeyword search is good too. I personally don't care much about top sellers. that does not help me find anything I want. New Releases is good though.\n\nChrisL\n\n"
    },
    {
      "time": "15 Dec 2006 — 12:56pm",
      "content": "I have a good source that states Fontshop will shortly have a wonderful keyword search. Woohoo!!\n\nIf I can't see the entire glyph-set, I do cry.  \nIf I can't test it at readable point-sizes, I do cry.\n\nAlso, Adobe's preview of what is under the hood, so to speak is a good thing. Those icons can save headaches.\n\n"
    },
    {
      "time": "15 Dec 2006 — 1:11pm",
      "content": "_If I can’t test it at readable point-sizes, I do cry._  \non screen or in print?\n\n"
    },
    {
      "time": "15 Dec 2006 — 1:12pm",
      "content": "I always look for PDFs.\n\n"
    },
    {
      "time": "15 Dec 2006 — 1:26pm",
      "content": "both.\n\n"
    },
    {
      "time": "15 Dec 2006 — 1:39pm",
      "content": "Sample PDFs are very important to me. But also use type tester.\n\n"
    },
    {
      "time": "15 Dec 2006 — 1:59pm",
      "content": "Take a look at a site that really works:\n\n[http://www.ourtype.be/](http://web.archive.org/web/20131108121301/http:/www.ourtype.be/ \"http://www.ourtype.be/\")\n\nJust MHO…\n\n"
    },
    {
      "time": "15 Dec 2006 — 3:26pm",
      "content": "I have to say the usability of MyFonts is top of all. Keyword search, live-testing is a must. And the WTF-engine is awesome. Thats one of the reasons many people go there ...\n\nAlso it would be nice to have a specialized system of categorizing if you are a logged-in-user. What does that mean? As a logged-in-member I would like to give the typefaces I am seeing special keywords. Just for me. For example, the ones I choose looking like Bauhaus-examples, I want to categorize like that. Just for me. Or if a see a typeface which looks like the one from the local bakerys, Iwant to categorize it like that: Let's say: \"Mayers Bäckerei Script\". MyFonts is having something like that, but it is pretty complicated. Dafont has it, too, but I would prefer Pulldown-menus instead of those \"go-to-the-next-site-and-choose-what-you-like-sites\". Speed is important.\n\nBTW: Fast-loading is a must. And re-direct is an absolute no-no! If you have to, redirect at the secure-paysites, but not at the fontchoosing ones. Good luck.\n\n"
    },
    {
      "time": "15 Dec 2006 — 5:16pm",
      "content": "_As a logged-in-member I would like to give the typefaces I am seeing special keywords._\n\nThe closest thing i can think of to this is MyFonts' album feature. It works pretty much as you describe here.\n\n"
    },
    {
      "time": "15 Dec 2006 — 5:31pm",
      "content": "Your list, sorted in my order of preference:\n\n1. Big displays of type  \n2. Ability to preview font using type testers  \n3. New releases  \n4. PDF specimens  \n5. Ease of navigation  \n6. Explanations of OpenType features  \n7. Top sellers list\n\n"
    },
    {
      "time": "16 Dec 2006 — 5:31am",
      "content": "Some sites have glyph-reduced testfonts (maybe without essential glyphs, you normally need for text, that nobody can work with them in real life), but with all different weights etc.  \nWith them you can layout, show the client why this font is eventually worth buying, get a \"feeling\" for the font yourself, see it's kerning etc.. Especially important when it is not a typical display font.  \nPDF are fine at first glance, but you can't show them to the client as an buying-argument. It's much too abstract.\n\n1. First the possibility to find, link etc. a certain content (ie typeface) – usability, accessibility topic  \n2. Starting with an appealing grafic, use of the typeface (hmm, this looks nice...)  \n3. A good typesetter (yes, this font could be something for my xxx-layout)  \n4. testfonts in all weights (layout with the typeface)  \n5. A pdf showing uses, glyphs, otf-features, etc.\n\nand\n\nWhat i'm feeling generally as a client –  \nSometimes i think the \"font-industry\" has to learn how to sell something - marketing. Where are the ideas to reduce the gap between possible users and the fontsellers. Where are the concepts that makes the customer proud of owning a typeface. Identification? OK, there are some good examples i know so far (like underware...), but…\n\n"
    },
    {
      "time": "16 Dec 2006 — 9:10pm",
      "content": "I like the Character Map/Pulldown Menu (Linotype) + PDFs.\n\n"
    },
    {
      "time": "17 Dec 2006 — 3:24am",
      "content": "1. Multiple ways of finding a typeface (authors, names, keywords, style...)  \n2. preview tester showing ALL characters in the font incl. kerning  \n3. detailed description of all opentype features  \n4. table showing ALL glyphs in a font\\*  \n5. pdf showing all styles, all glyphs and sample texts\n\n\\* This is very important, especialy for for multilingual typography. Many fonts could contain CE glyphs, but quite often these glyphs are so badly designed they can't be used at all. It is necessary to check glyphs like dcaron or eogonek before buying a typeface.\n\n"
    },
    {
      "time": "17 Dec 2006 — 11:43am",
      "content": "Does anyone have a type tester that would allow opentype features to be previewed and the ability to turn on and off certain features like liga, calt, etc? I'd imagine that you would need to license the technology from Adobe/Microsoft.\n\n"
    },
    {
      "time": "17 Dec 2006 — 1:15pm",
      "content": "For me, its PDF samples and examples of set text. Too many sites don't have PDF samples of their typefaces. I've also found too many text faces don't have extended samples of text in body copy! With heavy price tags, you're asking for your font to be passed over if you can't show the buyer how it performs.\n\nFontshop's site _looks_ nice. But as far as its functionality goes— abyssmal. Looking for fonts and buying them on that site is a chore. Its a deterrent.\n\n"
    },
    {
      "time": "17 Dec 2006 — 4:03pm",
      "content": "It is nice to see large displays, but pdf samples are important. I try to include them in almost all of my own work. For my money, myfonts is the best in most regards.\n\nJordan\n\n"
    },
    {
      "time": "17 Dec 2006 — 4:27pm",
      "content": "For text faces, PDFs are really needed.\n\nChrisL\n\n"
    },
    {
      "time": "18 Dec 2006 — 8:37am",
      "content": "I really like the ability to type test and PDF's. Eight characters don't tell me a lot about the whole face or family and I like the ability to see the whole thing if I want to. New releases are nice, top sellers don't mean a lot to me. I browse the Myfonts one sometimes; purely out of curiosity than actual function.\n\n"
    },
    {
      "time": "21 Dec 2006 — 11:22pm",
      "content": "biddy - We're not satisfied either, and many improvements are set to launch soon. Can you tell me more about what makes the buying process in particular such a chore?\n\n"
    },
    {
      "time": "21 Dec 2006 — 11:40pm",
      "content": "Just an FYI: If I worked for a type foundry - I would not put my faces out in PDF form - (unless they were photoshop - and no fonts attached).\n\nI've been watching the \"black market\" -- kids out there love to get PDF files so they can extract the font. They don't care about kerning. They don't care about stealing. They just don't care.\n\nI belong to several different type boards - and some are definitely easier than others. Some you learn their personality - and it works. One feature that makes a type board easiest - is a strong SEARCH feature. Also, I like see the Upper & lower cases - not a sentence... and I appreciate the ability to see the word in each of the typefaces I am browsing.\n\nBiddy - if you are interested in an expensive font - and need to see all the characters - I have found Veer.com's character sets flawless, especially when it comes to the OT fonts with their tons of characters...\n\nP.S. I just looked in on a site - and sure enough there was a new listing - and I'd like to share it with you:  \nAll experts of Pdf extractions  \nHello, I have a little question...  \nYes, I know that with the Mac is not possible extract characters from a pdf (I'm wrong?).  \nOk, but I would like to know how much time need for extract characters from a pdf like this and make a font?  \nPlease see: [http://www.mytempdir.com/1128315](http://web.archive.org/web/20131108121301/http:/www.mytempdir.com/1128315 \"http://www.mytempdir.com/1128315\")  \nLogically if somebody know how make extraction with Mac I'm here for learn!!! :-)))  \n\\*\\*\\*\\*\\*  \nAnd I am sure someone will help this person and extract the font... see what I mean?\n\n"
    },
    {
      "time": "22 Dec 2006 — 12:18am",
      "content": "I respectfully disagree with your PDF policy, Jackie. Hackers/collectors/pirates will always find ways to acquire fonts. The vast majority of these folks do not buy. Very few sales are lost on them. If a foundry limits the way paying customers can view their fonts (a printable PDF is vital) they are only shooting themselves in the foot.\n\n"
    },
    {
      "time": "22 Dec 2006 — 12:35am",
      "content": "Stephen -\n\nWhy make it so easy for people to get the fonts. You can have your pdfs - I only suggest at this point to \"flatten\" the file -- so that the font will not be embedded. When done properly, you will still see the crispness of each character.\n\nYou wrote that very few sales are lost to them. I am starting to disagree. It isn't one person going about their business... there seems to be a whole underground - whether its through a torrent or a rapid access type site -- the foundries are losing a fortune. Part of me wants to say I don't care -- I paid out plenty in the late 1980s and 1990s -- being a typographer in NY -- and the second one in the city to use Macs for \"real\" typesetting. But then it drives me crazy - I paid... and now someone can pluck a whole foundry's collection for their own use - and for free.\n\nIt also amazes me that the person at home, with a computer - can own more typefaces today -- than Photolettering owned in the 1990s -- and it doesn't have to cost them a cent.\n\nI'm rambling on here - but, I just wanted to add one thing about paying - I have a neighbor new to computers. She bought a Dell. She was amazed at my type library, and the price it cost me. Her attitude - \"I didn't know you had to pay for fonts.\" Unfortunately, that is the mentality of so many novices out there...\n\n"
    },
    {
      "time": "22 Dec 2006 — 8:39am",
      "content": "Your last point is very well taken. There is definitely a devaluation of fonts, but this is due more to fonts bunded with OS and software and and free font websites that are far more accessible than hacks and torrents.\n\n"
    },
    {
      "time": "22 Dec 2006 — 12:38pm",
      "content": "Stephen...one of the main things that I don't like about FontShop's site is that if I'm looking for say: [Scala](http://web.archive.org/web/20131108121301/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&font_categories=1&font_categories_search=font_name_search&searchstr=scala) when I type them in I get 40 fonts or items on a list, and have to dig to find the package that consists of what I want. The user has no way of knowing what the particular font package they are looking for is called, in order to find _exactly_ what they need. (Does that make any sense?)\n\nSometimes I've been digging only to find that there is no package for a family and I have to add each weight or style in order to build my own package. To me, [StormType's](http://web.archive.org/web/20131108121301/http:/www.stormtype.com/) site is near perfect in both how it displays its type, and providing PDF samples (though it also appears to be based a lot on [Font Bureau's](http://web.archive.org/web/20131108121301/http:/www.fontbureau.com/) site).\n\nOn a more positive note, FontShop's printed materials are _outstanding_.\n\n"
    },
    {
      "time": "23 Dec 2006 — 2:14am",
      "content": "Unfortunately we have no control over how foundries decide to package their fonts, but finding single weights will be easier in the near future.\n\n"
    },
    {
      "time": "23 Dec 2006 — 2:43pm",
      "content": "For my part I look for complete glyph showing and some evidence that it's accurate (not, \"our fonts include all the Macintosh standard characters\" for example, stuck next to a symbol or ornament font), and I often want to bookmark a page, or at least keep it open in a browser tab, and come back to it later, so a site like ourtype.be doesn't work well for me. And like others, I don't particularly want to have to buy a whole package, or to choose a \"collection\" to browse. On the other hand, I think I've more often bought fonts based on printed samples. It helps to see usage samples and notes on what makes the typeface design unusual.\n\nLiam\n\n--  \nWords and pictures from old books: [http://fromoldbooks.org/](http://web.archive.org/web/20131108121301/http:/fromoldbooks.org/ \"http://fromoldbooks.org/\")\n\n"
    },
    {
      "time": "23 Dec 2006 — 5:41pm",
      "content": "I for one am always quite pleased when I visit [www.ourtype.be](http://web.archive.org/web/20131108121301/http:/www.ourtype.be/ \"www.ourtype.be\")...  \nThe massive type on the right side is nice to start. And then the extensive font-tester, which allows a number of things to be changed, like the different weigts of a typeface, point size, leading, preset paragraphs, printed samples, sample-PDF, etc.  \nI hate the limited test-fields on sites like myfonts for example. Sample PDF's only are okay, but those also give you a limited impression of a typeface. Being able to set a bit of own text helps alot.\n\n"
    },
    {
      "time": "23 Dec 2006 — 7:20pm",
      "content": "I love OurType's site too. The unfortunate trade-off with a very interactive, flexible sampler is that it is built in Flash, which converts font outlines to quadratic curves, noticeably altering the letterforms, especially at small to mid sizes. Extremities are often cut off. PDF isn't interactive, but it's still the best method for previewing a face in its true form.\n\n"
    }
  ]
}
