{
  "id": "30119",
  "title": "Typography on the cigarette boxes",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello Typophiles,\n\nRight now we all are having our \"Package Design Course\" at the university. Its a total 4 weeks course including the research, surveys, problem finding and the final product. As a final product we have to redesign the complete package according to the problems we figured out in the existing packaging.\n\nI've taken the cigarette packaging for my research. Ive tried few concepts for the boxes but am planning to give a typographic treatment to the cigarette boxes and to the cigarettes. Generally they have very rich classic look but i wanted to try a bit different.\n\nNow the question is - Will it be a good idea to explore typography on cigarette packaging? Will it affect the buyer? Please tell me what you all think about this idea.\n\nSmoking typophiles can tell me what they would like to have on their cig-box, may be i can try that as well :)\n\nThanks for the time,  \nSatya\\_\n\n",
  "author": "<a href=\"/web/20111208235923/http://typophile.com/user/14032\" title=\"View user profile.\">satya</a>",
  "time": "<br>",
  "uid": "14032",
  "comments": [
    {
      "time": "",
      "content": "I would find more interesting to research for hand-roll cigarette packaging, also because  \nI find that type of smoking more related to tasting, \"a moment to enjoy.\"  \nI used to like \" [_The Rising Hope_](http://web.archive.org/web/20111208235923/http:/www.iisg.nl/collections/reclamearsenaal/e14-615.php)\" (this slogan also, still used) but I cannot find it in Turkey, I can find [Samson](http://web.archive.org/web/20111208235923/https:/www.lilbrown.com/prodpics/SAMSONT.jpg), tho. Last year a student of mine brought me some tobacco from the far East of Turkey, in a white bag, it was very blond but I could not keep it well and it got rotten.  \nBeside issues related to healt, I think you could reveal [_smoking_](http://web.archive.org/web/20111208235923/http:/www.princeton.edu/~ina/images/infographics/smoking_big.jpg) as you can reveal the difference between producing/drinking beer and producing/drinking wine.\n\n"
    },
    {
      "time": "",
      "content": "Some memorable cigarette brands for me include:  \n• Tigra  \n [http://houel.club.fr/pages/pict/04-royaltigraplein.jpg](http://web.archive.org/web/20111208235923/http:/houel.club.fr/pages/pict/04-royaltigraplein.jpg \"http://houel.club.fr/pages/pict/04-royaltigraplein.jpg\")  \n• Black death  \n [http://www.xs4all.nl/~dekei/sub/tabaksblad/cigarettesblackdeath1-c.jpg](http://web.archive.org/web/20111208235923/http:/www.xs4all.nl/~dekei/sub/tabaksblad/cigarettesblackdeath1-c.jpg \"http://www.xs4all.nl/~dekei/sub/tabaksblad/cigarettesblackdeath1-c.jpg\")  \n• Davidoff (because of the white filters)  \n [http://www.areasmoke.com/img/davidoff.gif](http://web.archive.org/web/20111208235923/http:/www.areasmoke.com/img/davidoff.gif \"http://www.areasmoke.com/img/davidoff.gif\")\n\n"
    },
    {
      "time": "",
      "content": "Thank You for No Smoking!\n\n"
    },
    {
      "time": "",
      "content": "Do you know this?  \n [http://www.shadowplaystudio.com/smoking.html](http://web.archive.org/web/20111208235923/http:/www.shadowplaystudio.com/smoking.html \"http://www.shadowplaystudio.com/smoking.html\")\n\nThe names of the typefaces can be found on Typographi.com\n\n"
    },
    {
      "time": "",
      "content": "I smoked briefly from age 16 to 19, and during that time my great passsion was for Player's Medium Navy Cut. This was long before I knew I would follow a career in graphic design, but certainly the appearance of the box was a major attraction.\n\n[http://www.moviecard.com/zgeneral/play-nav10.html](http://web.archive.org/web/20111208235923/http:/www.moviecard.com/zgeneral/play-nav10.html \"http://www.moviecard.com/zgeneral/play-nav10.html\")\n\nBruce\n\n"
    },
    {
      "time": "",
      "content": "\"NIL\" from Germany and Danish \"King's\" or \"King's favourites\" are both quite stylish, I think. King's were originally designed by Claus Achton Friis, one of the great Danish designers/ typographers.  \n(see image below, from Steen Ejler: Claus Achton Friis — Skrift og brugsgrafik, Arkitektens forlag , Copenhagen 1996)  \nThe picture shows the design from the 50's but they pretty much look the same nowadays, despite a redesign which added some new background colors for the different versions.\n\n ![](http://web.archive.org/web/20111208235923im_/http:/typophile.com/files/P1020176_6361.png)\n\nI also remember reading an article arguing that \"the smoking problem\" (no quote) could be helped by designing ugly packaging i.e. with clashing colors, misprints, overprints and hard-to read type that would make it difficult to differentiate the brands and to make cigarettes look less like a lifestyle product.\n\n"
    },
    {
      "time": "",
      "content": "I designed a book on this subject that I recommend you pick up\n\n[http://www.amazon.com/Smoke-Gets-Your-Eyes-Cigarette/dp/0789206404/sr=1-...](http://web.archive.org/web/20111208235923/http:/www.amazon.com/Smoke-Gets-Your-Eyes-Cigarette/dp/0789206404/sr=1-1/qid=1166369297/ref=sr_1_1/102-3713412-0612115?ie=UTF8&s=books \"http://www.amazon.com/Smoke-Gets-Your-Eyes-Cigarette/dp/0789206404/sr=1-1/qid=1166369297/ref=sr\\_1\\_1/102-3713412-0612115?ie=UTF8&s=books\")\n\nyou can see some additional images there too.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Will it affect the buyer?</cite>\n\nDesign is 99% of the reason people smoke. If it wasn't for all the great design and branding that goes into cigarette advertising and packaging, people wouldn't consider smoking cool. And if it isn't cool, why do it? Not for your health...\n\n"
    },
    {
      "time": "",
      "content": "here's NIL:\n\n ![](http://web.archive.org/web/20111208235923im_/http:/typophile.com/files/Nil_logo_4913.png)\n\nmy grandfather used to smoke these, me too, but the original oval orient NIL is out of production nowadays… sigh.\n\np.s. the word „REGIE“ is set in Futura Caps today… on the Filtered and Light, oops, i mean on the white ones.\n\n"
    },
    {
      "time": "",
      "content": "In the late 60s, I went to a small \"great books\" liberal arts school west of Chicago, called Shimer College. A wonderful place. One of the English professors there had worked in advertising and then subsequently was living out his dream of being a college professor, wearing a tweed jacket with suede elbow patches, smoking a pipe, and driving an antique Jaguar SS100. As he told the story, Marlboro had originally been positioned as a \"ladies' cigarette.\" Not a big seller. They then did a complete about face and turned it into the cowboy thing, and Andy was one of the first models to pose in the photographs. He was very glad of this, since the income from all his connections with the creative enabled him to leave the agency and go into teaching. He also was quick to point out how manipulative the whole thing was, and that it had everything to do with image and association, and almost nothing to do with the cigarette itself. Might the agency have been Burnett? Too long ago, can't remember. (And maybe this is covered in Patty's book.)\n\nMy two puffs worth,\n\nBruce\n\n"
    },
    {
      "time": "",
      "content": "Isn't it the guy with the erection in the Camel that makes people smoke?\n\n"
    },
    {
      "time": "",
      "content": "Well, I can say it is a fetish for my memory to me, but I am in the 1 % (if the \"design\"/making of the cigarette is not included), and I bet 99 % of the smokers like to see the smoke coming out of the mouth, I only met one blind smoker in my life, actually here in Turkey.  \nOn the other hand, I think James Puckett is right, for example Malboro is selling dreams not cigarettes, by the way ATF/Linotype Neo Contact is the typeface used by Malboro.\n\n"
    },
    {
      "time": "",
      "content": "<cite>...I only met one blind smoker in my life, actually here in Turkey.</cite>\n\nThat's a very interesting point.\n\n"
    },
    {
      "time": "",
      "content": "Yes but how many blind people do you know? I've never met a smoking midget but I don't think that signifies a correlation between smoking and height.\n\n"
    },
    {
      "time": "",
      "content": "Depends on when they started smoking -- there is a well-known correlation that smoking mothers (as opposed to \"smokin' mamas\" [grin]) have children that are frequently both smaller at birth and shorter at age 15....\n\n"
    },
    {
      "time": "",
      "content": "Not many, personally two, Patricia Fabricant, but in 2003 I was somehow involved in [Dialogue In The Dark](http://web.archive.org/web/20111208235923/http:/www.dialogo-nel-buio.it/) in Milan ( [venues.doc](http://web.archive.org/web/20111208235923/http:/www.dialogo-nel-buio.it/download/Dialogue_in_the_dark.doc)).\n\n"
    },
    {
      "time": "",
      "content": "Hi Satya\n\nMy friend Carl used to do the design and artwork for BJ Cunningham's [Death](http://web.archive.org/web/20111208235923/http:/en.wikipedia.org/wiki/Death_(cigarette)) cigarettes in the UK. A true cult brand, they got run out of business by the corporate cabal and the governments that do their bidding.\n\nThe typeface Carl originally used was Caslon Antique, which I don't think is in the example here. What there is in there is a lot of (hidden from the customer) quasi-masonic arcana...\n\nIn the days of PS Level 1 RIPS (very slow), the Caslon Antique used to make the bureau guys really howl with frustration. Visually, one could argue that the type made it look like the product would do something corrosive to you... this image doesn't show it (must be a later version) and is from the site of [Alistair McIntosh](http://web.archive.org/web/20111208235923/http:/www.alastairmcintosh.com/images/cigarettes.htm)\n\n ![](http://web.archive.org/web/20111208235923im_/http:/typophile.com/files/deathcigs_3782.gif)\n\n"
    },
    {
      "time": "",
      "content": "Lucky Strike by Raymond Loewy is a classic.  \nSatya, there's a recent film called \"Thank you for not Smoking\" (check on wikipedia) which may be helpful, the title are awesome. See if you can find the DVD. Good luck.\n\n"
    },
    {
      "time": "",
      "content": "I agree re Lucky Strike, it's perfect.\n\nLorenza, the link to the titles for Thank You for Smoking is in this thread - Thierry's post near the top.\n\nThe book I designed contained a chapter called the Anti-Packs which had, among other brands, Death, Cancer, Brand X and one just called ?.\n\n"
    },
    {
      "time": "",
      "content": "double oups! I didn't check the link and the film title is wrong on my post. Thanks!\n\n"
    },
    {
      "time": "",
      "content": "Take a look at Herb Lubalin's work for EVE:\n\n[http://www.misty120s.com/Ad\\_archive/albums/SmokePretty/Eve71\\_1.jpg](http://web.archive.org/web/20111208235923/http:/www.misty120s.com/Ad_archive/albums/SmokePretty/Eve71_1.jpg \"http://www.misty120s.com/Ad\\_archive/albums/SmokePretty/Eve71\\_1.jpg\")\n\n"
    },
    {
      "time": "",
      "content": "OK. Now that we've mentioned 'Thank You For Smoking' and Raymond Loewy's Lucky Strike pack in the same breath, it's time for\n\n ![](http://web.archive.org/web/20111208235923im_/http:/typophile.com/files/BA-packaging-example-04_5954.jpg)\n\n"
    }
  ]
}
