{
  "id": "30128",
  "title": "is the following statement true?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "The reason why the Renaissance went back to the Roman geometric type was because the Gothic style of Germany (Guttenburg's moveable type) conflicted with the printing methods in Italy because they believed in classical, elegant lettering. Or was it because of something else?\n\n",
  "author": "missgiggles",
  "time": "18 Dec 2006 — 5:11am",
  "uid": "14600",
  "comments": [
    {
      "time": "18 Dec 2006 — 5:56am",
      "content": "Gothic style didn't conflict with Italian printing methods (the same everywhere) but with cultural roots\n\n"
    },
    {
      "time": "18 Dec 2006 — 6:10am",
      "content": "The term “Gothic” was first used to describe this script in 15th century Italy, in the midst of the Renaissance, because Renaissance humanists believed it was a barbaric style of handwriting&nbsp;(“gothic” ads a synonym for “barbaric”). Flavio Biondo, in “Italia Illustrata” (1531) thought it was invented by the Lombards after their invasion of Italy in the 6th century.  \nThe name (term) was also affected by geographic locations and other scripts were labelled “Gothic”, in contrast to [Carolingian minuscule](http://web.archive.org/web/20121104222003/http:/typophile.com/node/30104).  \nAlso check out the calligraphic tradition in Aldus Manutius (Francesco Griffo).\n\n"
    },
    {
      "time": "18 Dec 2006 — 6:19am",
      "content": "I think it is a bit misleading to call Roman style 'geometric'; the main feature is its round arches, replaced with broken lines in the Fraktur styles. The preference for the Roman capitals and the carolingian miniscule, which was closer in look to Roman caps, has to do with the Humanist movement and the fact that they were publishing in Latin language. Harry Carter's 'A View of Early Typography' is one of the best works on this. Your university library should have it.\n\n"
    },
    {
      "time": "18 Dec 2006 — 6:53am",
      "content": "well, thats what i found in my research. see, tahts why i have to have it approved by you wonderful people out here because i've found this theory and another which claims that the Renaissance refused to accept the Gothic style because it clashed with their humanist ideology at the time and the other texts i have just read say that the printing methods in Italy clashed with those of the German printing methods. Oh my...i feel ill seeing all these different theories.\n\n"
    },
    {
      "time": "18 Dec 2006 — 7:11am",
      "content": "That's probably what they are, 'theories'?\n\n"
    },
    {
      "time": "18 Dec 2006 — 7:14am",
      "content": "\\>the printing methods in Italy clashed with those of the German printing methods\n\nWho says this? Do they say specifically how printing methods were different, and how this caused problems?\n\nI am puzzled by it because I don't see how it would be mechanically any different to cut punches, manufacture type and print the roman style as opposed to the Fraktur. Was there an issue of kerning?\n\n"
    },
    {
      "time": "18 Dec 2006 — 7:26am",
      "content": "No William, it doesn;t go into detail and i think it was Britannica Online library that gave me this information unfortunately. I thought they were suppose to be reliable :(\n\n"
    },
    {
      "time": "18 Dec 2006 — 7:33am",
      "content": "missgiggles... sometimes I wonder about you.\n\n"
    },
    {
      "time": "18 Dec 2006 — 8:23am",
      "content": "If you intend to quote these theories you will need to know precisely where they come from, so you can refer to them and to create a bibliography, btw it doesn't seem to be the Britannica entry on Renaissance book design\n\nTim\n\n"
    },
    {
      "time": "18 Dec 2006 — 8:34am",
      "content": "Hmmmm, then somewhere in my notes or books i have in front of me but it definately said that.\n\n"
    }
  ]
}
