{
  "id": "30130",
  "title": "Famous William Morris quote on the effects of Industrial Revolution on typography",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Anyone know it? I think it was to do with the fact that it was the first time that type was printed not only for ........ needs but specifically for social purposes for people. SOmething like that. Any ideas? Thanks.\n\n",
  "author": "missgiggles",
  "time": "18 Dec 2006 — 7:29am",
  "uid": "14600",
  "comments": [
    {
      "time": "18 Dec 2006 — 7:38am",
      "content": "missgiggles, I think you need to hunker down and do some serious research, i.e., getting yourself to a bricks and mortar library, looking up proper books, tracking down specialized literature with actual bibliography that will hopefully make you curious to look up even more books, and so on. Go to the source, i.e., actual books by or about William Morris, or whoever you need to study, before coming here and asking questions like this one.\n\n"
    },
    {
      "time": "18 Dec 2006 — 7:53am",
      "content": "—\n\n"
    },
    {
      "time": "18 Dec 2006 — 8:08am",
      "content": "Ahhhh. Edited. I'm learning to control myself.\n\n"
    },
    {
      "time": "18 Dec 2006 — 8:15am",
      "content": "Yeah, ok, I edited too. But it felt good to vent for a minute...\n\nSeriously, Missgiggles, the wise minds on this site have taken the time to answer your many many questions very thoughtfully. In the interest of mutual respect, it might be a good idea for you to take seriously the frequent suggestions that you spend some time in a library, do some real research, and try to organize your ideas before coming here with all these questions.\n\nAnd, if you want/expect to be taken seriously, working on your spelling and grammar would help...\n\n"
    },
    {
      "time": "18 Dec 2006 — 8:18am",
      "content": "whatever Pattyfab and Lore. Do whatever you want. it doesn't bother me.\n\n"
    },
    {
      "time": "18 Dec 2006 — 8:50am",
      "content": "Pat: my first message started with \"Seriously Miss Giggles\" too!  \nMiss Giggles:  \nIn my first (edited) post I was suggesting Nicholaus Pevsner and that you try to learn History BEFORE you approach type history (it makes a lot more sense to me). There is no need to be offended because people are trying to show you a more logical way to approach research. As Pat says, it's a question of respect. Everyone here is trying to keep the level high in the interest of the community. Even those that do not come from the UK like yourself are making an effort to check spelling/grammar before they post and also they post with their real name and surname, which is also a sign of trust and respect.  \nThe reason I changed my mind is because you are too bloody stubborn, girl.\n\n"
    },
    {
      "time": "18 Dec 2006 — 9:17am",
      "content": "It's no giggling matter. It's actually quite depressing.\n\n"
    },
    {
      "time": "18 Dec 2006 — 10:35am",
      "content": "_whatever Pattyfab and Lore. Do whatever you want. it doesn’t bother me._\n\nMiss Giggles, I think most people on Typophile deserve a pat on the back for being as patient as they have been. The bottom line for me is, if you don't think its important to organize your thoughts, capitalize words, and spell correctly you are _disrespecting_ people who give their time and effort to **you**.\n\nYour comment above makes you come off as a spoiled child, and in general you have been very disrespectful in both the way you ask questions and in the way you respond to them.\n\nI **implore** the community of Typophile to ignore Miss Giggles' posts until she starts showing the people of this community the respect they deserve.\n\n"
    },
    {
      "time": "18 Dec 2006 — 2:31pm",
      "content": "LOL!! Folks, come and spend a day in class with me sometime ; ) Er, on second thoughts, you might want to be shown a bit more respect...\n\nMissG, I suggest you try googling **Emery Walker** instead.\n\n"
    },
    {
      "time": "18 Dec 2006 — 2:47pm",
      "content": "You're wasting your time, Terry....\n\n"
    },
    {
      "time": "18 Dec 2006 — 3:54pm",
      "content": "I know, I know...but a boy can dream, can't he? ;)\n\n"
    },
    {
      "time": "18 Dec 2006 — 4:41pm",
      "content": "There are dreams, and then there is _le cauchemar_. ;-)\n\n"
    },
    {
      "time": "18 Dec 2006 — 5:06pm",
      "content": "Sorry but i really don't understand what i have done. Probably the age gap is doing the demons here. and in regards to the 'whatever Pattyfab and Lore. Do whatever you want. it doesn’t bother me.' Well, they have both been nasty to me on my other postsfor some time and so has Linda Cunningha. It has really upset me so i had to say something to them once and for all. Can a girl not even let some air out of her hair if people disrespect her? I do respect them but how they have treated me shows that if they can't treat me well, then why should i bother treating them well? It's simple enough isn't it? They don't want to give me respect, then why should i give them respect? Why do i respect everyone else except them 3? because they have been nasty to me on many of my posts before.\n\n"
    },
    {
      "time": "18 Dec 2006 — 5:11pm",
      "content": "PS i forgot to mention the fact that what Pattyfab and Lore had written before was not what's there now. They have edited it so since then, people are getting the wrong menaing of my 'whatever Pattyfab and Lore. Do whatever you want. it doesn’t bother me.' It is because they have added the actual details later on that people think i have commented on. Just getting it straight with all you ladies and gents out there. It's not what you think it is and btw i am not a spolied child and niether am i disrespectful. It's people like the above mentioned people that gets me going because tehy have done something to provoke it.\n\n"
    },
    {
      "time": "18 Dec 2006 — 5:33pm",
      "content": " **Do unto others...**\n\nIt's simple. This is a site for those who like to talk about type and typography without having other peoples eyes roll back into their heads. I can post the most arcane question about type here and somebody other than me will be interested in the conversation.\n\nIt is a great resource for those looking to understand the deeper things of type and typography, and to point people in the right directions when looking for answers.\n\nThat being said, while many of the people involved in the discussions on Typophile might be educators, many are not. Most have spent years learning their craft, whether it be on the job or at school. Most have worked very hard to gain the knowledge and understanding that they have.\n\nSome might feel a bit, shall we say <cite>used</cite>, when someone who obviously cares enough about type to even be here won't take the time to properly frame their questions using standard grammatical customs such as punctuation and proper case. Some others might feel that although there are no stupid questions, there <cite>are</cite> lazy ones.\n\nAs students, we have an obligation to respect the time and attention our teachers give us. Especially when they provide it for free. And as students, we have an obligation to apply the things we learn, even to things like questions posted to an online forum.\n\nNo one here WANTS to get into a Flame war. Although entertaining in their own way, they do not lend themselves to a discussion about the deeper things of type and typography.\n\n"
    },
    {
      "time": "18 Dec 2006 — 8:52pm",
      "content": "Well put, Dan. And Giggle's questions have led to some very provocative and interesting discussions which is the reason I revisit them from time to time. I am amazed at some of the information my fellow typophiles seem to have at the ready.\n\n"
    },
    {
      "time": "18 Dec 2006 — 9:43pm",
      "content": "missgiggles, it is a sign of disrespect to everyone here when you do not say why you are asking something. Are you a student? Have you been assigned to write on a certain aspect of type or design history? If so, what is the subject? It would be helpful, to say the least. Your questions tend to be vague. And confusing! More disrespect, both for the people here, their patience, and their time. Is the Typophile community here to attend your every whim? After seeing a few of your posts, one starts to feel that you have a lazy man's (woman's?) attitude towards learning -- that is, it seems as if you want to let others do your \"learning\" for you. If that is the case, then you are mainly cheating yourself. Do your homework before typing up the first question that comes to mind. _Then_ come here, if you still have doubts. I guarantee you will get better results, and discussions we can all benefit from, even enjoy.\n\n_Probably the age gap is doing the demons here._\n\nOh, really? What do you know about people's ages? And are you younger or older than the people you mention?\n\n_There are dreams, and then there is_ le cauchemar.\n\nHey, Linda, thanks for teaching me a new word! :-)\n\n"
    },
    {
      "time": "18 Dec 2006 — 11:52pm",
      "content": "My fellow typophiles. You don't have to answer. I think it's great that you do. But if want to move on & not attend to the vague questions Miss Giggles posts here you really can. If you choose to respond then you can only complain just so much I think. And Miss Giggles - you really might dig a bit before posting. It will serve you far better than you can guess - and extend your welcome here to boot.\n\n"
    },
    {
      "time": "19 Dec 2006 — 2:47am",
      "content": "—\n\n"
    },
    {
      "time": "19 Dec 2006 — 3:32am",
      "content": "Miss Giggles,\n\nFor some reason I think what is on your mind came from this thread:  \n [http://typophile.com/node/17322](http://web.archive.org/web/20121102080516/http:/typophile.com/node/17322 \"http://typophile.com/node/17322\") when Thierry Blancpain wanted to know if a certain quote about the Industrial Revolution and typography was correct.\n\n"
    },
    {
      "time": "19 Dec 2006 — 3:37am",
      "content": "Miss Cauchemar, don't put me in this position because I don't deserve it. I have NOT been disrespectful to you. In fact I think I only participated to two of the threads you started and once it was only because hrant made this joke about the Renuisance man and I can't thank him (and you) enough for that because I still laugh out loud when I think about it. Unforgettable. And then I wanted to help you and suggest Nicholaus Pevsner but then I changed my mind. Last thing I remember is that I was receiving offensive messages from you calling me bully, which illustrates incredibly well what typophile represents to you: a playground.\n\n"
    },
    {
      "time": "19 Dec 2006 — 5:01am",
      "content": "tHats th sTaNdard of edyucayshun and manners here in theuK. your al lucKY she not ritin in txt! Y bother bein polite.\n\nNick Cooke\n\n"
    },
    {
      "time": "19 Dec 2006 — 5:57am",
      "content": "\\>i really don’t understand what i have done\n\nMiss G, I think you would be making a serious mistake to attribute the annoyance simply to other peoples' personalities, and dismiss the possibility that you are doing something to provoke it.\n\nYou are getting the same reaction from people world wide--that should tell you something!\n\nYou have been told repeatedly that this particular community is irritated by your not bothering to use caps, and by not proofing your posts at all for typos. What part of that don't you understand? Why do you persist in posting as above, with all the 'i's lower case?\n\nAlso many evidently feel that you are asking them to do your homework. They want to see evidence that you have made an honest effort at research first--eg by referring to and quoting the sources you have consulted.\n\nYour curiousity and effort are very commendable. Push forward, but do learn--and not only about type.\n\n"
    },
    {
      "time": "19 Dec 2006 — 7:35am",
      "content": "<cite>Your questions tend to be vague. And confusing!</cite>\n\nand repetitive. It seemed as though when you didn't get the answer you were looking for you just rephrased the question and asked it again, rather than considering whether you were asking the right question.\n\nBut I think my comments (and I'm sorry if they veered into flame category, I tried not to... as the mature one) were mostly focused on spelling, punctuation, and grammar. We're a bunch of type-heads here, we notice these things!\n\n"
    },
    {
      "time": "19 Dec 2006 — 8:18am",
      "content": "Ricardo writes:\n\n_There are dreams, and then there is_ le cauchemar.\n\nHey, Linda, thanks for teaching me a new word! :-)\n\n;-) I learned it from \"Murder on the Orient Express.\"\n\n"
    },
    {
      "time": "19 Dec 2006 — 8:35am",
      "content": "missgiggles, check out:  \n [this archive](http://web.archive.org/web/20121102080516/http:/listserv.cddc.vt.edu/marxists/cd/cd1/Library/archive/morris/works/index.htm)  \nand  \n [this item](http://web.archive.org/web/20121102080516/http:/listserv.cddc.vt.edu/marxists/cd/cd1/Library/archive/morris/works/1893/printing.htm)  \nand tell us what you find.\n\nWhat you are looking for might also be in one of the other texts about the industrial revolution or art and society.\n\n"
    },
    {
      "time": "19 Dec 2006 — 12:53pm",
      "content": "i am not familiar with miss giggles' history, but i am reading with interest the sincere and pained comments regarding her lack of capitalization.\n\ni am well-educated and fairly competent with respect to grammar, and i prefer to write in all lowercase. indeed, i'm certain some of you must be aware of herbert bayer, a teacher at the bauhaus, who said:\n\n\"why should we write and print in two alphabets? both a large sign and a small sign are not necessary to identify a single sound. we do not speak in a capital a and a small a. a single alphabet gives us practically the same result as the mixture of upper and lower case letters, and at the same time is less of a burden on all who write.\" --herbert bayer from bauhaus 1919-1928\n\nthis concept has motivated the design of various new single-case alphabets as well.\n\napologies if both A) that was completely obvious, and B) the forums require only the most conventionally proper grammar and punctuation regardless.\n\njarrod\n\n"
    },
    {
      "time": "19 Dec 2006 — 12:56pm",
      "content": "[http://www.type.nu/bayer/univer.html](http://web.archive.org/web/20121102080516/http:/www.type.nu/bayer/univer.html \"http://www.type.nu/bayer/univer.html\")\n\nneat-o.\n\n=)\n\n"
    },
    {
      "time": "19 Dec 2006 — 1:08pm",
      "content": "Jarrod, this particular idea of Bayer was never taken up widely. Or to put it another way, it was almost universally rejected. People evidently find caps at the beginning of sentences a helpful marker. That is the answer to Bayer's question, and it is a very good answer, IMHO.\n\nIn any case, our eyes are trained to expect the the caps at the beginning of sentences, the word 'I' to be capitalized, etc., so that not having them is a distraction to the reader. You are making a decision to tax the reader by using all lc.\n\nI can see a point to dropping UC in instant messages, as the rush to get out the text is then paramount.\n\nBut generally it is novices who think that Bayer had a great idea. (Students regularly come on typophile typing this way, but generally stop or stop posting.) In my view and the view of publishers generally, it's a bad idea.\n\n"
    },
    {
      "time": "19 Dec 2006 — 1:20pm",
      "content": "Funny, when I think of someone in all lower case -- two thoughts come to mind. One is a Susan Hayward movie - where she played \"rae\" a wannabe clothing designer that succeeded -- but ended up in a tragic love affair. The other is e.e. cummings - a little rebellious shall we say?\n\n"
    },
    {
      "time": "19 Dec 2006 — 1:51pm",
      "content": "Wise people admit their mistakes easily. They know progress accelerates when they do.\n\nDaniel John Gayle, could you please elaborate the thought _“while many of the people involved in the discussions on Typophile might be educators, many are not.”_\n\nErik Spiekermann has been teaching me a lot just with a few spoken words in NYC, I realized it was because of a mistake I did, this also led me to write this little [page](http://web.archive.org/web/20121102080516/http:/homes.ieu.edu.tr/~asegalini/learning.html) for my students.\n\nI really think you can only learn from a mistake after you admit you’ve made it. As soon as you start blaming other people (or environment) you distance yourself from any possible lesson. But if you courageously stand up and honestly say “This is my mistake and I am responsible” the possibilities for learning will move towards you. Admission of a mistake, even if only privately to yourself, makes learning possible by moving the focus away from blame assignment and towards understanding.\n\nJohn Downer also kindly gave me a great piece of advice, and I have other people in Italy as well, my parents included, they actually don’t know what design is, but it happens in daily life that they do something good and positive for society. And sometimes a smile is enough.\n\nThese advices run counter to the cultural assumptions we have about mistakes and failure being shameful things. We’re taught in school (ah, my memory), in our families (not my case), or at work to feel guilty about failure and to do whatever we can to avoid mistakes. This sense of shame combined with the inevitability of setbacks when attempting difficult things explains why many people give up on their goals : they’re not prepared for the mistakes and failures they’ll face on their way to what they want.\n\nWhat’s missing in many people’s beliefs about success (yes, not “fame”) is the fact that the more challenging the goal, the more frequent and difficult setbacks will be. The larger your ambitions, the more dependent you will be on your ability to overcome and learn from your mistakes.\n\nBut for many reasons admitting mistakes is difficult, and the fact that our work represents us is an implied value in many cultures.\n\nFor anyone than never discovers a deeper self-identity, based not on lack of mistakes but on courage, compassionate intelligence, commitment and creativity, life is a scary place made safe only by never getting into trouble, never breaking rules and never taking the risks that their hearts tell them they need to take.  \nLearning from mistakes requires three things : putting yourself in situations where you can make interesting mistakes ; having the self-confidence to admit to them ; being courageous about making changes.\n\nMerry Christmas and Happy New Year,\n\nAlessandro Segalini\n\n"
    },
    {
      "time": "19 Dec 2006 — 3:04pm",
      "content": "<cite>Daniel John Gayle, could you please elaborate the thought “while many of the people involved in the discussions on Typophile might be educators, many are not.”</cite>\n\nI only meant that some are teachers by profession. Others are designers, etc. Some, like many artists, dabble in both.\n\nNot everyone has the patience and stamina to deal with questions from students. Not even all teachers are good at it. (I should know, because I tend to ask questions that put teachers on the spot. A very annoying habit, if you're a teacher who doesn't actually know what you're talking about...)\n\nBut that's the point, if a student takes responsibility and poses a well thought out, properly framed question, then the onus is on the teacher. You gotta knock the teacher back onto their heels and keep them off balance, or else you'll never learn. If you slack and give them an \"out\" by asking a poor question that they can brush off, then you've lost and have wasted your breath.\n\n"
    },
    {
      "time": "19 Dec 2006 — 3:23pm",
      "content": "The issue of spelling, and use of lower case are of minimal concern to me in this situation. Of more concern to me is tactics in learning and self-teaching. I think if we are asked by a student, \"What is 2 plus 2, and we answer 4, we have done a disservice. It would be more enlightening to explain the concept of addition and allow the student to come back with their own answer, even if it is wrong. In the first case, by saying 4, you have taught the student that the process for adding 2 numbers involves asking someone to give them the answer. In the second case, we are teaching them how to find an answer for themselves. We old farts will eventually die off and leave the next generation with nobody to ask :-)  \nI don't know if this kind of asking for \"the answer\" is an indication of education in the present or just a small example of a few of our youth today. Perhaps we need more of the Socratic method and less \"Ask Jeeves\" in our modern World?\n\nChrisL\n\n"
    },
    {
      "time": "19 Dec 2006 — 5:52pm",
      "content": "^ My sentiments exactly.\n\nI think google and wikipedia has destroyed the wonder and the beautiful process of learning for the next generation of students born with joysticks in their hands, drawing with bars of soap (commonly called the mouse).\n\nI sense a general laziness and lack of interest when it comes to research. It seems that people now like to be told about things, as opposed to experiencing them directly.\n\nIn the wider discussion, I'd even argue that we now live in the age of documentarians in the basest usage of the word, masquerading as artists and thinkers with their endless blogs and photo galleries, but I'll hold my tongue from releasing any more poison.\n\n"
    },
    {
      "time": "19 Dec 2006 — 6:31pm",
      "content": "\"but I’ll hold my tongue\"\n\nGiven your last name, that may be a problem :-)\n\nChrisL\n\n"
    },
    {
      "time": "19 Dec 2006 — 7:05pm",
      "content": "\"Given your last name, that may be a problem :-)\"\n\nGiven his user name, it shouldn't be an issue.\n\n"
    },
    {
      "time": "19 Dec 2006 — 10:07pm",
      "content": "_i am not familiar with miss giggles’ history_...\n\n[http://typophile.com/user/14600/track](http://web.archive.org/web/20121102080516/http:/typophile.com/user/14600/track \"http://typophile.com/user/14600/track\")\n\n"
    },
    {
      "time": "19 Dec 2006 — 11:14pm",
      "content": "Hmm. I think, speak and hear in both cases. Sentence casing, titling, all lowercase, mixed casing and all caps all sound different in my mind. Am I alone? Does anyone here ever \"speak/think\" in small caps?\n\n[Choz Cunningham](http://web.archive.org/web/20121102080516/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20121102080516/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20121102080516/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "19 Dec 2006 — 11:58pm",
      "content": "<cite i think google and wikipedia has destroyed the wonder beautiful process of learning for next generation students born with joysticks in their drawing bars soap commonly called cite></cite>\n\nI agree with you in part; I think that young people often simply ask questions instead of looking for answers, not entirely out of laziness or desire for instant gratification, but because right now can be an odd, challenging time to do research. When I was in grade school, I learned to use card catalogs. Middle school coincided with user-friendly electronic catalogs, along with magazine searches and access to the internet in the form of Usenet, Gopher, and IRC. High school brought along electronic encyclopedias, newspaper searches, and (the first time) I went to college the web started to be worthwhile. That's a hell of a lot to absorb, it still confuses the hell out of me, and younger college students (I'm 28) did not have the luxury of picking the technologies up one at a time like I did.\n\nIn my opinion, all these different sources of information have yet to congeal into anything that most people find especially useful. There's so much information to find that it can be overwhelming. The only people who seem to cope well are nerds (myself included) and researchers with assistants and bottomless Lexis-Nexis accounts. Until some of this stuff settles out, and we have new generations of computer-savvy teachers and librarians to go along with it, research will be an oddball thing for kids unsure how to make any sense of the options.\n\n"
    },
    {
      "time": "20 Dec 2006 — 4:34am",
      "content": "Ricardo, this is even more representative of MissGiggles I think.  \n [http://typophile.com/node/30128](http://web.archive.org/web/20121102080516/http:/typophile.com/node/30128 \"http://typophile.com/node/30128\")\n\nHonestly, that was a disgrace. People here doing their best to follow her train of thoughts and look how it all ends. That's sad.\n\nIronic that I always hated the hostility and the patronising tone towards students but I must say, Giggles is a very different case. New members asking weird/bad formulated questions it's a thing (I know something about it!). There's no need to humiliate people in public. Repeating the same mistakes over and over and over, <cite>now</cite> that's different.\n\n<cite>tHats th sTaNdard of edyucayshun and manners here in theuK. </cite>  \nYou think this is a British phenomena? You wish!\n\n<cite>Does anyone here ever “speak/think” in small caps?</cite>  \nNot only that but when I speak/think in Portuguese I have to stop to put all the little accents everywhere and it's such a drag ; )\n\n"
    },
    {
      "time": "20 Dec 2006 — 4:38am",
      "content": "Ok, you are all clear now. Let’s stop about this now and enjoy they days before Christmas!\n\nPieter\n\n"
    },
    {
      "time": "20 Dec 2006 — 9:57am",
      "content": "_I have to stop to put all the little accents everywhere and it’s such a drag_\n\nHeh. Accents; the emoticons of the literate world.\n\n_In my opinion, all these different sources of information have yet to congeal into anything that most people find especially useful._\n\nI have to say, I'm precisely that age where the two worldviews collide. When I cannot find something after a sincere search online, I sometimes wonder, \"Does it even exist?\" \"Or is it that unimportant that we haven't archived it?\" Things like a misremembered TV episode title, or a snip of trivia.\n\n[Choz Cunningham](http://web.archive.org/web/20121102080516/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20121102080516/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20121102080516/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "20 Dec 2006 — 10:17am",
      "content": "Imagine what it was like several years ago when you had to physically go to a library and look it up? Most \"trivia\" were not even available unless you had an \"Uncle Bob\" who remembered all the old TV or Radio shows. Today, you can find most things quite quickly. You even have the luxury of being disappointed if you can't find it right away. In decades past, you just did without.\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2006 — 10:39am",
      "content": "_...In decades past, you just did without._\n\nIt sounds so desolate.\n\nImagine what it was like before a global community of students, leading professionals, hacks, enthusiasts, and the merely curious could congregate to one place to exchange tips, history and philosophy in one industry. And now imagine that times every industry or endeavor ever. The times, they have changed. I look back and try to imagine what it must have been like for those a full generation before myself, and it seems sad at times. I understand there was a serenity and a calm in the slower-paced world, away from emails and microwaves, but interaction with the voice and memory of the entire world (or, a growing percent of it each day) is one of the few things I really adore about \\*right now\\*. That and mp3s.\n\nI suppose some future generation may say the same thing about our quaint little lifespans and suffering from disease and superstition.\n\n[Choz Cunningham](http://web.archive.org/web/20121102080516/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20121102080516/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20121102080516/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "20 Dec 2006 — 10:47am",
      "content": "I think James Puckett and I came up around the same era, on the cusp of some new technologies. I'm almost 29 and our era is old enough to remember old technologies (the REAL card catalog complete with REAL CARDS!!!) but young enough to embrace new ones. Its funny when I talk to my girlfriend (who is only a few years younger) because internet wasn't really up and running for me until I was a sophomore in college— she mentions having it in high school.\n\nI got my bachelor's degree in 2000 (in TV/Film), just missing the digital video revolution. Then I was shooting on Super8 and 16mm film, nowadays anyone with a handheld can post on You Tube. When I graduated, digital video wasn't remotely affordable or considered viable for the mainstream. Didn't take long for that to change. It was only 2001 when I started carrying a cell phone. Hell, Chris still doesn't even turn his on. ;)\n\nThis is a new generation folks. We're in an era where people can literally do nothing and skate by. I think the design field (including type design) needs to start taking notice of people who don't come from wealth, went to a top notch school, or studied under a rockstar...or we're going to continue to spawn a legion of Paris Hiltons. Where are the underdogs? Where are the rags to riches stories?\n\n_Hmmmm, then somewhere in my notes or books i have in front of me but it definately said that._\n\nLorenza, funny you linked to that thread because the statement above is where I officially lost it. I understand everyone's desire to help, but by responding to Miss Giggle's threads you are only **encouraging laziness**.\n\n"
    },
    {
      "time": "20 Dec 2006 — 11:06am",
      "content": "Choz, fact is, when it comes to history, there's no substitute for dealing with original artefacts. And vast areas of the past have yet to be \"digitized\".\n\nAll you have to do is pick up a publication from the mid 20th century and google though it. Most company names will draw a blank. So how can you find out anything online about their advertising, or the art directors or illustrators?\n\nAnd as for digitization, well, there was the debacle of microfiche.  \nWhat will scans tell us about letterpress?  \nOctavo's CD of Bodoni's Manuale doesn't have anywhere near enough resolution.\n\nThe first comprehensive history of graphic design was Meggs, 20 years ago. His modernist perspective is being questioned. Helen Mazur Thomson (The Origins of Graphic Design in America) has a quite different view. In type history, the bible (Updike, 1920s) doesn't show a single sans serif typeface (which we are so interested in the origins of, today) -- despite their having been in use for 100 years by then. No wonder Ms Giggles is confused -- the questions she is being asked, like about serifs on Carolignian scripts -- would make good PhD theses. You could read dozens of books before you come up with an answer as succint as Peter's. And she's supposed to put all this 500 years of Western history, technology, and culture together and make sense of it, and it's a sidebar to a practical design course?\n\nThere is a lot to be said for Miss Giggles \"legally blonde hive mind\" methodology. Getting your information from books is a narrow and passive way of inhaling the dominant narrative, why not ask the experts directly and see what the current POV is? It's a different awareness, and oh the serendipity.\n\n_future generation_\n\nLet's hope we're smart enough.\n\n"
    },
    {
      "time": "20 Dec 2006 — 11:27am",
      "content": "\"It sounds so desolate.\"\n\nIt wasn't really any more than today, it was just different. You couldn't get information out of a yet-to-be-invented electronic box, so you went and visited real living people and had long talks. You made things with your own hands instead of downloading something. When you left work, you just were gone and there was no Blackberry to fetch you back at any moment of the day or night. I am not saying it was better or worse, it was just different. As Terry says, my cell phone stays off 99% of the time not because I am against cell phones, I just don't need to be \"reachable\" 24/7 anymore now than 20 years ago. Solitude can be a cleansing thing sometimes. Seeing people face-to-face is a cherished experience too--far better than Blackberry-barrage bondage.\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2006 — 11:34am",
      "content": "_Seeing people face-to-face is a cherished experience too—far better than Blackberry-barrage bondage._  \nOh my God, yes. Preach! :)\n\n"
    },
    {
      "time": "20 Dec 2006 — 11:44am",
      "content": "\\>Getting your information from books is a narrow and passive way of inhaling the dominant narrative, why not ask the experts directly and see what the current POV is? It’s a different awareness, and oh the serendipity.\n\nIt's not a question of either-or, but both-and. Use the internet, use libraries, talk to librarians, go to book stores, talk to experts in the field, talk to other researchers, look at original artifacts. If you are serious about research in a subject you do all of them. I certainly have done all of these for my work on Caslon, and I think I learned something essential from each of them. And Nick, I'm sure you're doing all of them as well for your historical writing.\n\nIf you want 'information nuggets', the internet is fabulous. If you want 'knowledge' in the sense of understanding of a subject you have to go to print and talk to people. For example, the best single book on typography, Bringhurst's, is not on line. So you have to go to print--and of course it's a lot nicer to read on paper as well.\n\nLet me repeat how great a resource librarians are. They are not the resource people think of for research, but they can be amazingly helpful--especially those associated with specialized libraries and fields. I am very grateful to James Mosley, former librarian at St. Brides, and Larry Oppenberg, who organized the Linotype library at the Museum of Printing. For me, they held the keys to the kingdom.\n\n"
    },
    {
      "time": "20 Dec 2006 — 2:04pm",
      "content": "<cite>Lorenza, funny you linked to that thread because the statement above is where I officially lost it</cite>  \nNo! it's not funny, it's tragic! Her last sentence in that thread was exactly where I officially lost it too! And also where I began to understand the concerns of this community. Btw: I'm very impressed by this community's ability to change direction to a thread and turn it into a productive discussion.\n\n<cite>And she’s supposed to put all this 500 years of Western history, technology, and culture together and make sense of it, and it’s a sidebar to a practical design course?<br>\n</cite>  \nBut we don't know what she's doing with the information, is that part of her course? Which course? Where? Which level? Who's teaching her? And why isn't she getting assistance? What are her cultural references?\n\nI had to work with a girl at University once and she gave me a piece of info for our assignment, I asked her to give me the reference and she told me: [www.google.com](http://web.archive.org/web/20121102080516/http:/www.google.com/ \"www.google.com\"). I was almost in tears. Another girl, instead of writing \"bibliography\" at the end of her essay simply wrote: \"Books I took from the library\" (at least she didn't write liberry). The same girl went maaaaaad when the lecturer told her that she was supposed to read them too, not just take them off the shelves and she went immediately to the Head of the Department's office to complain that the lecturer had been rude to her.  \nThat was in the UK. But can you honestly say it's different in other countries? And Is she really English anyway? Is she really a young girl? Is she really blonde?  \nCheck her profile. There's not much in there.\n\n"
    }
  ]
}
