{
  "id": "30131",
  "title": "when is the Digital Age in typography believed to have started?",
  "forum": "Design",
  "tags": [

  ],
  "content": "which was the first type to be digiatlly reproduced? Did teh Digital Age begin after the invention of the Apple Mac in 1970's or the 1930's to 40's after Atanasoff-Berry Computer and ENIAC? So when do you think typeography was involved in digital screen based, output products. i know about anti allaising etc.\n\n",
  "author": "<a href=\"/web/20110509084658/http://typophile.com/user/14600\" title=\"View user profile.\">missgiggles</a>",
  "time": "<br>",
  "uid": "14600",
  "comments": [
    {
      "time": "",
      "content": "The first digital typesetter, the Digiset, was created by the Dr.-Ing Rudolf Hell GmbH company in Kiel/Germany in the late 1960s… either 1966 or 1968. The first digital typefaces were the ones that were designed for this machine, by Gerard Unger and Hermann Zapf, among others.\n\nSo digital typography began in the late 1960s and early 1970s. It really took off in the 1980s with the introduction of technologies that are now more common, like the PostScript page markup language by Adobe, the Macintosch computer by Apple, and Fontographer by Altsys (later by Macromedia, now by FontLab Ltd.). These inventions led to the design of fonts on personal computers, for use on other personal computers.\n\n"
    },
    {
      "time": "",
      "content": "\\> _Did teh Digital Age begin after the invention of the Apple Mac in 1970’s_\n\nBTW, the Apple Mac was first released in 1984. Apple released prior computers from 1977 onwards, but they weren't Macintoshes.\n\n"
    },
    {
      "time": "",
      "content": "Check this out - Compugraphic in early 1960s  \n [http://www.monotypeimaging.com/aboutus/AgfaComp.aspx](http://web.archive.org/web/20110509084658/http:/www.monotypeimaging.com/aboutus/AgfaComp.aspx \"http://www.monotypeimaging.com/aboutus/AgfaComp.aspx\")\n\n"
    },
    {
      "time": "",
      "content": "\\>when is the Digital Age in typography believed to have started?\n\n24 Jan 1984\n\nsee [http://www.youtube.com/watch?v=z9PQ16KVntQ](http://web.archive.org/web/20110509084658/http:/www.youtube.com/watch?v=z9PQ16KVntQ \"http://www.youtube.com/watch?v=z9PQ16KVntQ\")\n\n"
    },
    {
      "time": "",
      "content": "Digital type, or digital machines to produce type. The later was in the mid to late 1970s. Early Compugraphic and similar systems used some kind of photographic process to expose film. However digital fonts were available before 1985 and PostScript.\n\nIf you mean digital equipment, then the 1960s information from Dan is the right track.\n\n"
    },
    {
      "time": "",
      "content": "When applied to typography, digital really means that the fonts contain the shape of the letters not in analogue form (a piece of metal, or a photographic image), but numerically. And by implication, with an electronic computer.\n\nIn that sense, the crucial invention is PostScript, in the early 1980s, a programming language invented by Adobe, which was able to digitize complex letter shapes by describing letter outlines with vector paths.\n\nEarlier technologies had digitized part of the typographic process at some stage or other. For instance, the Monotype (early 20th century) transferred keyboarded text to the casting machine on punched paper tape. This technique was still used with phototype in the 1960s, before the paper tape was replaced by computer tape.\n\nAlso, I'm not sure how all the photo imagesetters of the 1960s and 1970s worked. I know that Diatronic exposed directly from a negative image (on a ground glass plate); but what about the Alphatype and similar video systems -- AFAIK, they worked by exposing single glyph images, displayed on the entire surface of a CRT screen. But were the images on the screen generated entirely from digital information?\n\n"
    },
    {
      "time": "",
      "content": "I agree with Nick's definition. In that sense, the first design \"stored\" on a numerical basis would be the Romain du roi, wouldn't it?\n\nThe first system with electronically stored shapes was probably Digiset, which was introduced in 1965.\n\n"
    },
    {
      "time": "",
      "content": "A fair amount of the history is in [Printer's Type in the Twentieth Century](http://web.archive.org/web/20110509084658/http:/www.amazon.com/Printers-Type-Twentieth-Century-Manufacturing/dp/0712348123/sr=8-1/qid=1166554196/ref=sr_1_1/002-2366700-8164814?ie=UTF8&s=books), by Richard Southall.\n\nIIRC the first outline fonts (with quadratic splines) were done by Peter Karnow and URW in the early 80s, but I may not have it right.\n\n"
    },
    {
      "time": "",
      "content": "<cite>IIRC the first outline fonts (with quadratic splines) were done by Peter Karnow and URW in the early 80s, but I may not have it right.</cite>\n\nDo you mean Ikarus? That was in 1974.\n\nOh, and another \"first\": Marconi (Hermann Zapf, 1975) was the first typeface designed for digital typesetting. I assume the font was also \"designed\" digitally, i.e. directly as bitmaps?\n\n"
    },
    {
      "time": "",
      "content": "\\>Ikarus ...1974\n\nThanks. By the way, why do the histories say that digital fonts only really took off with Post Script language and type 1 fonts? (around 1985?) Was Ikarus too weak a tool or was it something else?\n\n"
    },
    {
      "time": "",
      "content": "It was the concept of desktop publishing.  \nDTP = Mac + PostScript software + Laserwriter (with free quality fonts on floppy as part of the Laserwriter software package).\n\nAlso, PostScript was extensible into graphics (first vector) then bitmapped (Photoshop).\n\n"
    },
    {
      "time": "",
      "content": "\"why do the histories say that digital fonts only really took off with Post Script language and type 1 fonts? \"\n\nIt was not an issue with Ikarus, it was the desktop output that caused the boom. By removing the step of getting type set as galleys and pasted up, you saved countless hours and many dollars. You also brought the infinitely editable layout to be born allowing clients to rewrite anyting any time without the high cost of alterations in the old paste-up days. You also spawned the cottage indudtry of typeseeting at home. Ikurus was a very capable tool, but it could not do pagemakeup on the fly like the old Mac SE.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "IKARUS (Dr. Peter Karow/URW) was using spline data for font descriptions, but wasn't the system chiefly used for typeface development?\n\nThe first CRT digital imagesetters were available late 1970s and were using vector-based outline data for fonts, and were used for straight high-resolution typesetting.\n\nDon't confuse PostScript with digital fonts. There were several PDL (Page Description Language) formats being utilized prior to the development of PostScript. The main breakthrough with PDL/PostScript was that imagesetters could now manipulate and output BOTH type and images simultaneously and composed into a page layout.\n\nNo more paste-ups for graphic artists!!!!\n\n"
    },
    {
      "time": "",
      "content": "One major advantage of Desktop Publishing was the concept of WYSIWYG -- being able to see a scaled representation of one's layout on screen, and modify it interactively prior to printout.  \nAt first it was high-contrast B&W, type with jaggies, but then anti-aliasing arrived with TrueType and Adobe Type Manager, c.1988. When layout programs Pagemaker and Quark XPress introduced the zoom tool, that was huge too.\n\nAlso, I recall it was nice to get a large greyscale monitor. For a couple of years I worked on a black-and-white Mac Plus, and sh\\*t would happen like getting dropshadows (cool new digital effect!) on top of the type rather than behind, because it all looked the same on screen. So I'd bluff and say \"yeah, dropshadow at top left, pushing the design envelope...\"\n\n"
    }
  ]
}
