{
  "id": "30142",
  "title": "Fonts, FontExplorer X and Quark 6.5",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Has anyone had any problems with Quark 6.5 and Linotype's FontExplorer? I'm having an issue where only part of a set of fonts becomes active in Quark. The complete set is available in Illustrator and InDesign, but not Quark. What's up with that? And I'm using Quark because my client requires it, so I must figure this out.\n\nMany thanks.\n\n",
  "author": "jonsel",
  "time": "18 Dec 2006 — 3:34pm",
  "uid": "11497",
  "comments": [
    {
      "time": "20 Dec 2006 — 4:58am",
      "content": "If your problem is with a OpenType font — that issue has been covered before (and in other forums as well). Here's the gist of it: older versions of Quark do not support OpenType-faces. Only the first 256 or so glyphs are recognized. Solution: update to QXP 7 or go the Adobe route (InDesign rocks!).  \nPossible solution: do not use OTF but only PS (with Expert-sets).\n\n"
    },
    {
      "time": "20 Dec 2006 — 10:41am",
      "content": "The problem is occurring with both OT and PS fonts. What happens is I get the Light and the Medium weights to show up, and not the Bold and Regular weights. It doesn't make sense to me.\n\n"
    },
    {
      "time": "20 Dec 2006 — 8:00pm",
      "content": "\\> _I’m having an issue where only part of a set of fonts becomes active_\n\nAre these fonts something that you made or were they licensed?\n\n"
    },
    {
      "time": "21 Dec 2006 — 9:05am",
      "content": "I guess you're problem is related to the way font families were merged and linked into one suitcase in the OS 9 days.  \nTry this to hopefully solve the problem: find your original font files (with separate suitcase files for each variant) and use those.  \nOr else use Font/DAMover (a Classic app!) to split up the faulty font suitcase(s) into separate suitcases for each subfamily.\n\n"
    },
    {
      "time": "23 Dec 2006 — 4:35am",
      "content": "Or it can be FontExplorer's problem. I stopped using it completely. Another pile of junk on the OSX font manager heap. IMO.\n\n"
    }
  ]
}
