{
  "id": "3015",
  "title": "(x) Marie Fredriksson \"Het Vind\" - Palatino (pre-digital) {Mark S}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Still here's an other font which keeps puzzling me. (I only hope I'm not abusing with all the many fonts I ask about? It's kinda hard to help from feeling that I am...)   \n   \n ![](http://web.archive.org/web/20050516142628im_/http:/www.typophile.com/forums/messages/83/25826.gif)   \n   \nThis one had been identified as being [Galliard](http://web.archive.org/web/20050516142628/http:/www.myfonts.com/fonts/itc/galliard/). Yet, and even considering the uppercase letters to be Galliard Regular, and the lowercase ones Galliard Italic, still there are quite some evident differences, the \"k\" to point the most obvious...   \n   \nThen again, and myself, hum, the closer I got so far (if any close at all) was eventually [Aquinas](http://web.archive.org/web/20050516142628/http:/www.myfonts.com/fonts/letraset/aquinas/), yet not too close either (particularly the \"M\" and the \"F\", and also the \"t\", are definite non-matches, and as well the serif is rather different and the outline of the letters doesn't look as smooth... also, and accordingly to the info on MyFonts about it, this font is said to have been designed in 1989, whereas the sample I posted is from 1984)... :/   \n   \nSo, if anyone can give a hint on this one, again I'd be most grateful, thank you.\n\n",
  "author": "ssmm",
  "time": "Fri, 2004-02-06 13:39",
  "uid": "2985",
  "comments": [
    {
      "time": " Fri, 2004-02-06 14:18",
      "content": "It looks a lot like a Zapf design, like Aldus or Palatino, or even a bit like his wife's Nofret. I have a couple of those, and will try them out to see how close it looks.\n\n"
    },
    {
      "time": " Fri, 2004-02-06 14:24",
      "content": "I think it's the old display version of Palatino (caps) and Palatino Italic (lowercase). I don't know if there is a digital version of that available. (Seems like every time there's a change in typesetting technology, Mr. Zapf redesigns Palatino.)\n\n"
    },
    {
      "time": " Fri, 2004-02-06 14:32",
      "content": "Here are the orginal compared to Nofret (middle) and Palatino (bottom).   \n   \nClose, but no cigar.   \n ![Het Vind Simulations with Zapf](http://web.archive.org/web/20050516142628im_/http:/www.typophile.com/forums/messages/83/25843.gif)\n\n"
    },
    {
      "time": " Fri, 2004-02-06 14:33",
      "content": "Here's a scan of the old display version of Palatino from the old Phil's Photo catalog:   \n   \n ![palatino](http://web.archive.org/web/20050516142628im_/http:/www.typophile.com/forums/messages/83/25845.gif)   \n   \nThe one odd thing is that the H is narrower than it should be. It could easily have been modified (but why?). Otherwise it matches.\n\n"
    },
    {
      "time": " Fri, 2004-02-06 15:21",
      "content": "Mark, thanks for the posting very cool.\n\n"
    },
    {
      "time": " Fri, 2004-02-06 18:02",
      "content": "Yes, I had also tried (at MyFonts) with Palatino too. But had thought especially the \"s\" and the \"t\" to be not so close... But, taking this set which Mark Simonson posted, it does match! (Except for the \"H\" width, indeed, really curious...) And, as a matter of fact, I think this post of Mark's even just solved another _mystery_ for me. As there was an other font which I was wondering about, because of its _funny_ \"e\" and, there it is, right that one in that version of Palatino Regular! So here goes a double thank you to you, Mark Simonson, thank you indeed! :-) Thank you both for all help. :-)\n\n"
    }
  ]
}
