{
  "id": "30156",
  "title": "Sort of \"desert island books\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Few months ago I moved from Italy to Bosnia-Herzegovina and, since I could carry with myself only few design books and a Bible, I ended up reading Bringhurst and the Four Gospels from dawn till dusk.  \nNow I'm going to spend Christmas holidays in Italy so I can take some other book from my library and buy new ones. My suitcase isn't huge and I won't be back in Italy again before next summer so I must select carefully.  \nWhat would you choose?\n\n",
  "author": "Manlio Napoli",
  "time": "19 Dec 2006 — 3:36pm",
  "uid": "11530",
  "comments": [
    {
      "time": "19 Dec 2006 — 4:46pm",
      "content": "Without a doubt, Underworld by Don Delillo, I feel a strange kind of regret everytime I go to a bookshop and see it on the shelf because I've read it and own it and have no need to buy it.\n\nDostovesky's Crime and Punishment, possibly the greatest novel ever written, the writing is so good and immersive the divide between Raskolnikov's life and mine began to blur a little as i read it. I've heard the Borthers Karamoazov is as good if not better.\n\nContinuing the Biblical theme Pilgrim's progress by John Bunyan, Screwtape letters by CS Lewis for two very different, entertaining, helpful and wise takes on what it is to live as a Christian.\n\n"
    },
    {
      "time": "19 Dec 2006 — 4:55pm",
      "content": "Quite interesting, Manlio, good luck.  \nI’d choose [_Tales From Moominvalley_](http://web.archive.org/web/20121102080523/http:/www.amazon.com/gp/reader/0374474133/ref=sib_dp_pt/102-0332197-6838542#reader-link) and other Moomin stories published by [Salani](http://web.archive.org/web/20121102080523/http:/www.salani.it/ce_eng.html).\n\n"
    },
    {
      "time": "19 Dec 2006 — 5:07pm",
      "content": "_The Wind-up Bird Chronicles_ by Haruki Murakami  \n_Fury_ by Salman Rushdie  \n_Perfume_ by Patrick Süskind  \n_Foucault’s Pendulum_ by Umberto Eco\n\nAny issues of _[Dot Dot Dot](http://web.archive.org/web/20121102080523/http:/typophile.com/wiki/Dot%20Dot%20Dot)_ or _[Emigre](http://web.archive.org/web/20121102080523/http:/typophile.com/wiki/Emigre)_.\n\n"
    },
    {
      "time": "19 Dec 2006 — 6:49pm",
      "content": "Nothing to do with design or type at all!\n\nMaybe a case of wine instead.\n\n—K\n\n"
    },
    {
      "time": "19 Dec 2006 — 7:08pm",
      "content": "I couldn't get thru Underworld! I vastly preferred his Mao II. Loved The Wind-Up Bird Chronicles.\n\nManlio, can't you order books from Amazon to tide you over til next summer?\n\nAnyway, if not, go for long books! I'd take Possession by A.S. Byatt, A Suitable Boy by Vikram Seth, U.S.A. by John Dos Passos, Moby Dick.\n\n"
    },
    {
      "time": "19 Dec 2006 — 7:11pm",
      "content": "And for an oldie but goodie, Cervantes' _Don Quixote_.\n\nOr a collected Shakespeare.\n\n"
    },
    {
      "time": "19 Dec 2006 — 7:15pm",
      "content": "\\> What would you choose?\n\nThe DVD: Mediterraneo (1991, Directed by Gabriele Salvatores)\n\n"
    },
    {
      "time": "19 Dec 2006 — 7:19pm",
      "content": "Or Six Feet Under, all 5 seasons.\n\n"
    },
    {
      "time": "19 Dec 2006 — 7:20pm",
      "content": "Or all three seasons of Little Britain.\n\n"
    },
    {
      "time": "19 Dec 2006 — 9:17pm",
      "content": "Read _House of Leaves_ by Mark Danielewski. It's a great example of stories-within-stories, American gothic horror, hardcore erotica, erudite writing, and it's got great typography set by the author, with words that go forward, backward, into shapes, etc. Literary critics describe it with respectful comparisons to Nabokov and Borges; Poynor included it in _Graphic Design and Postmodernism_. And getting funny looks when you have to keep rotating a book when you're on a plane is always great.\n\nIf you want to read something tremendously fun, contemporary and erudite without delving into the design world, read _World War Z_ by Max Brooks. On the surface it looks like a kitschy zombie book, but it's just as engrossing as Harry Potter, and far more intelligent.\n\n"
    },
    {
      "time": "19 Dec 2006 — 9:48pm",
      "content": "Pattyfab,  \nyou got through USA but not through Underworld! Kudos i guess, I really liked Manhattan Transfer but I imagine I would probably need to organise some leave, or actually get stuck on a desert island to navigate USA. Haven't read Mao II but can't wait, loved Libra the 'ficitional' biography of Lee Harvey Oswald.\n\nAdditionally I'd recommend New York Trilogy and pretty much anything else by Paul Auster, off-kilter self-reflexive clue-puzzle whodunnits (sounds cerebral, is fun).\n\n"
    },
    {
      "time": "19 Dec 2006 — 10:15pm",
      "content": "I'm reading a great book by Max Frisch, called _I'm Not Stiller_ in the English translation but simply _Stiller_ in the original German. I am only halfway through it, but I highly recommend it. I also liked two of Peter Carey's books, _True History of the Kelly Gang_ and _My Life as a Fake_. One last suggestion: _The Archivist_, by Martha Cooley.\n\n"
    },
    {
      "time": "19 Dec 2006 — 11:20pm",
      "content": "<cite>The Ultimate Hitchhiker's Guide</cite> by Douglas Adams – No matter how many times you read Adams, it's still squirt-milk-out-of-your-nose funny.\n\n<cite>Musashi</cite> by Eiji Yoshikawa – The greatest and influential tale of Musashi Miyomoto, the Sword Saint, greatest samurai to ever live. Dozens of Japanese movies have been based on this novel, with Samurai I actually winning the Academy Award. This book is the best epic I have ever read.\n\n<cite>The Complete Poems of Edgar Allen Poe</cite> – For when you're alone at night :{\n\n"
    },
    {
      "time": "20 Dec 2006 — 1:45am",
      "content": "Thanks everybody for your suggestions.\n\nNicholas, Patricia:  \nI heard about Delillo but still didn't read anything by him, is him comparable to Thomas Pynchon? I was enticed by _Gravity's Rainbow_ but couldn't read it cover to cover although I tried more than once (I got lost somewhere).  \nDostoevsky and Melville will be in the list 100%.\n\nAlessandro:  \nThanks for good luck wishes, actually it's going better than what I expected.\n\nKris:  \nLOL! Herzegovian wine is pretty fine too. I complain just about the coffee.\n\nPatricia:  \nAmazon doesn't sell Italian books and unfortunately I don't speak English well enough to read novels smoothly. At a local bookstore I found _Black Lamb and Grey Falcon_ by Rebecca West (a must read about ex-Yugoslavia) but I stop at every sentence to counsult the dictionary.  \nAnyway I'll use Amazon for design books.\n\n"
    },
    {
      "time": "20 Dec 2006 — 3:23am",
      "content": "[The Master and Margarita](http://web.archive.org/web/20121102080523/http:/www.amazon.co.uk/Master-Margarita-Penguin-Modern-Classics/dp/0141187794/sr=1-1/qid=1166611226/ref=sr_1_1/026-1105165-7952435?ie=UTF8&s=books), by Mikhail Bulgakov  \n [Baghdad Burning](http://web.archive.org/web/20121102080523/http:/www.amazon.co.uk/Baghdad-Burning-Girl-Blog-Iraq/dp/0714531308/sr=1-1/qid=1166611431/ref=sr_1_1/026-1105165-7952435?ie=UTF8&s=books), by ‘Riverbend’, based on the blog, currently dramatised on BBC radio\n\nTim\n\n"
    },
    {
      "time": "20 Dec 2006 — 5:49am",
      "content": "Manilo,\n\nYeah you could compare Delillo to pynchon, perhaps in intent more in style; I think both are interested to capture and comment on American consumer culture/hyper-capitalism in all its manifestations, (especially Underworld and White noise) Delillo is much less scatty/absurd then pynchon, much more formal and dramatic, I've only read Vineland so that's what I'm going off. I own gravity's rainbow and have managed a total of about 6 pages; I know Patty would disagree, but I found Delillo much more accessible to read than Pynchon.\n\nI reckon the trick with Dellilo is to accept early on that the characters don't speak quite like people speak but, though you seem to lose a level of identification (and ability to suspend your disbelief), you gain so much insight into reality and relationships and people through the actual content of the dialogue that it doesn't matter. White noise is fun and a lot less intimidating in size than Underworld, I'd read that first and see if you dig what's going on,  \ncheers, have fun in BH\n\nNick\n\n"
    },
    {
      "time": "20 Dec 2006 — 9:42am",
      "content": "I just read the book, [Perfume](http://web.archive.org/web/20121102080523/http:/www.randomhouse.com/vintage/catalog/display.pperl?isbn=9780375725845&view=rg) by Patrick Suskind. It was so engrossing that I woke up each morning, before I finished it, thinking about it. I probably could have read it in its entirety had I had a longer flight. It is graphic and rich with detail. I recommend it entirely.\n\n"
    },
    {
      "time": "20 Dec 2006 — 10:21am",
      "content": "Ooh, another one, Michael Chabon's The Amazing Adventures of Kavalier and Clay.\n\nAlso - on a more populist note, Memoirs of a Geisha is a pretty compulsive read. Bet it's translated into Italian.\n\nNick: I totally agree re Delillo and Pynchon. I love Delillo, and have read a lot of his books. I just found Underworld bloated and un-engrossing. THe first 50 pages were great tho. All I've read of Pynchon were Crying of Lot 49 which is fun but kinda dated now, and Vineland which I liked but didn't love.\n\n100 Years of Solitude is another winner.\n\nThe Brothers K rocks.\n\nMiddlemarch by George Eliot, War & Peace, anything by Edith Wharton, Infinite Jest a few more weighty tomes.\n\n"
    },
    {
      "time": "20 Dec 2006 — 11:53am",
      "content": "[The Horrific Sufferings Of The Mind-Reading Monster Hercules Barefoot, his wonderful love and terrible hatred](http://web.archive.org/web/20121102080523/http:/www.amazon.co.uk/Horrific-Sufferings-Mind-Reading-Hercules-Wonderful/dp/009946439X/sr=1-1/qid=1166643990/ref=sr_1_1/026-1105165-7952435?ie=UTF8&s=books) Since Perfume has been mentioned twice, good choice too, I am currently reading this, which is blurbed as being the Perfume of the next generation, tricky charades title too:)  \n [Suite Française](http://web.archive.org/web/20121102080523/http:/www.amazon.co.uk/Suite-Francaise-Irene-Nemirovsky/dp/0701178965/sr=1-1/qid=1166643951/ref=sr_1_1/026-1105165-7952435?ie=UTF8&s=books) the mixed threads of several Parisian’s lives affected by the German invasion, rendered tragic by the final outcome for the author.\n\nTim\n\n{edit: sorry forgot to add the title for the second}\n\n"
    },
    {
      "time": "20 Dec 2006 — 4:08pm",
      "content": "Yeah, _Kavalier and Clay_ is a good one. I also liked _Wonder Boys_, by the same author.\n\n"
    },
    {
      "time": "20 Dec 2006 — 6:02pm",
      "content": "_Siddhartha_ by Hermann Hesse\n\n_For Esme - With Love and Squalor_ by J.D. Salinger\n\nBut with limited suitcase space then easily the most economical for size to content ratio has to be the haiku collection...\n\n_On Love and Barley_ by Basho\n\n...infinity in my pocket. I won't leave home without it :)\n\n"
    },
    {
      "time": "21 Dec 2006 — 6:47am",
      "content": "Very helpful and inspiring. Almost all the titles you suggested are translated into Italian and available as compact size paperbacks.  \nThank you and Merry Christmas.\n\n"
    },
    {
      "time": "21 Dec 2006 — 9:49am",
      "content": "House of Leaves, Mark Z. Danielewski. A good length read, thoughtful messages, and can be quite a conversation piece. Simultaneously gimmicky and substantial, ireverent and relavent; it is well worth rereading and dissection, making any copy a bargain. It's even panders to the typophile in you.\n\nI don't recommend many products. This is something exceptional.\n\n[Choz Cunningham](http://web.archive.org/web/20121102080523/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20121102080523/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20121102080523/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "21 Dec 2006 — 11:52am",
      "content": "I thoroughly enjoyed Auster's Book of Illusions. Also, a different and ribald book, Tom Robbins' Fierce Invalids Home from Hot Climates.  \nMargaret Elphinstone's Hy Brasil was an engrossing read, as was The Poisonwood Bible by Barbara Kingsolver. Mmmm, and Blindness by Jose Saramago.\n\nFor poetry, I'd get some kind of modern or postmodern anthology. And an anthology of short stories can be a wonderful thing, too.\n\nAbout Perfume, I have heard both rave and negative reviews. So I haven't read it yet, but probably will eventually.\n\nK.\n\n"
    },
    {
      "time": "21 Dec 2006 — 3:24pm",
      "content": "Happy holidays to all typophiles including Manlio.\n\n_I don’t recommend many products. This is something exceptional._\n\nAgreed. My unreserved recommendation is for [Cryptonomicon](http://web.archive.org/web/20121102080523/http:/www.amazon.com/Cryptonomicon-Neal-Stephenson/dp/0060512806/sr=1-1/qid=1166743022/ref=pd_bbs_sr_1/104-0486363-1791103?ie=UTF8&s=books) by Neal Stephenson.\n\n(and if the size of your suitcase increases or your holidays mysteriously lengthen you might consider taking all three volumes of his [Baroque Cycle...](http://web.archive.org/web/20121102080523/http:/www.amazon.com/Quicksilver-Baroque-Cycle-Vol-1/dp/0060593083/sr=1-3/qid=1166743022/ref=pd_bbs_sr_3/104-0486363-1791103?ie=UTF8&s=books))\n\n"
    },
    {
      "time": "21 Dec 2006 — 4:16pm",
      "content": "\\> _About Perfume… I haven’t read it yet, but probably will eventually._\n\nMake sure to read it before seeing the visual travesty on the big screen.\n\n"
    },
    {
      "time": "22 Dec 2006 — 2:27am",
      "content": "Conor, have you seen it? It would be a shame, although not unusual, if the film is so awful, because the book is great, but it is difficult to imagine a more difficult theme to render in film.  \nTim\n\n"
    },
    {
      "time": "22 Dec 2006 — 8:54am",
      "content": "yeah, they don't make movies scratch and sniff yet, do they?\n\nI usually read the book and then refuse to watch the movie!\n\nOne of the most disappointing movies from books (a book I would also add to my desert island list), and which I must admit I haven't seen, is Narnia. Not only did my daughter's English teacher read the abridged version to the class, she dragged them to see the movie. E's experience of the real Chronicles (when we get to them) will forever be marred by images of the movie.\n\nK.\n\n"
    },
    {
      "time": "22 Dec 2006 — 11:03am",
      "content": "Alice's Adventures in Wonderland and Through the Looking Glass.\n\nEvery five years or so…\n\nChinese Zen Poems - What Hold Has This Mountain?  \nCompiled and Translated by Larry Smith & Mei Hui Huang\n\nWonderful translations and immense power in a very slim volume.\n\npeace\n\n"
    },
    {
      "time": "22 Dec 2006 — 11:17am",
      "content": "well since it was the bible last time, how bout the _tao te ching_?\n\n"
    },
    {
      "time": "22 Dec 2006 — 11:34am",
      "content": "Although I am glad I have read the Tao Te Ching the exposition of belief systems is not nearly as interesting as the art.\n\nTaoist poetry - definitely…\n\nMass in B Minor interests me a lot more than what inspired it.\n\npeace\n\n"
    },
    {
      "time": "22 Dec 2006 — 11:47am",
      "content": "<cite>Not only did my daughter’s English teacher read the abridged version to the class...</cite>\n\nSomeone abridged those books? Good god, there wasn't much to them in the first place.\n\n"
    },
    {
      "time": "22 Dec 2006 — 1:02pm",
      "content": "_\"Although I am glad I have read the Tao Te Ching the exposition of belief systems is not nearly as interesting as the art. Taoist poetry - definitely…\"_\n\nI thought the Tao Te Ching is Taoist poetry... as long as you don't waste breath or thought on the usual scholar's introduction :)\n\n"
    },
    {
      "time": "22 Dec 2006 — 1:46pm",
      "content": "I discovered my sense of spirituality through art, primarily Chinese and Japanese poetry. More specifically Tao and Zen poets.\n\nIt's cloudier and that suits me…\n\npeace\n\n"
    },
    {
      "time": "23 Dec 2006 — 5:44am",
      "content": "<cite>Alice’s Adventures in Wonderland</cite>  \nAbsolutely. I even bought myself the pop-up book. A masterpiece by Robert Sabuda published by Simon & Schuster in the UK, quite expensive and you need to keep the kids at distance, which is sad because they go mad when they see it.\n\nI loved <cite>A Confederacy of Dunces</cite> (Pulitzer Prize) by J.K. Toole. Set in New Orleans, it has been translated but I'm afraid it only makes sense in English. Awesome.\n\nWhen I left England I took with me 3 books by Jonathan Coe: <cite>The Rotters Club</cite>, <cite>The Closed Circle</cite> (follow up) and <cite>What a Carve Up!</cite> (The title in the US changed to <cite>The Winshaw Family</cite> I think) and a few Private Eye editions to remember my wonderful years in the UK!\n\nHow could I forget: John Lanchester's <cite>The Debt to Pleasure</cite>. What a book: Eccentric, refined and voluptuous. And Manlio, the Italian translation is fine too (the title in Italian is <cite>Gola</cite>).\n\nItalian: anything by Calvino, Sciascia or Primo Levi, but I don't need to tell you that!\n\n<cite>Perfume</cite> I read it when it first came out (or a couple of years later) and everyone was talking about it. For some reason I wasn't that impressed but maybe I should have another go.\n\nWhen I was working on the poster for a campaign against Tessa Jowell's Gambling Bill a couple of years ago, <cite>The Gambler</cite> by Dostoyevsky was a great source of inspiration. His descriptions are so graphic it's amazing.\n\n"
    },
    {
      "time": "23 Dec 2006 — 6:55am",
      "content": "I have not read \"Perfume\" since the 1980s but it has stayed with me as few other books have. A powerful and sensual tale.\n\nAnother literary high point for me -- not sure if it was popular enough to be translated into Italian -- is a book called \"Le Mas Théotime\" by Henri Bosco. It's a wonderful mystery about rural life in Provence in the late 19th century. It was published only once in English, in the late 1940s, but perhaps with luck it was also published in Italian. In France it seems to be perennially in print.\n\nBruce\n\n"
    },
    {
      "time": "23 Dec 2006 — 9:33am",
      "content": "\\> Alice’s Adventures in Wonderland  \nAbsolutely. I even bought myself the pop-up book. A masterpiece by Robert Sabuda published by Simon & Schuster in the UK, quite expensive and you need to keep the kids at distance, which is sad because they go mad when they see it.\n\nSounds fabulous Lore - I will definitely check it out…\n\npeace\n\n"
    },
    {
      "time": "23 Dec 2006 — 9:57am",
      "content": "The pop-up Alice in Wonderland is indeed spectacular.\n\nAnd I agree re Confederacy of Dunces - it starts out a bit hard to get into but well worth the investment.\n\nAnother long and totally engrossing book: Lonesome Dove. Not highbrow but was so so sad to see it end, even after 1000+ pages.\n\nCormac McCarthy's Blood Meridian is BEAUTIFUL.\n\n"
    },
    {
      "time": "23 Dec 2006 — 2:15pm",
      "content": "No type, something else - \"Neo-Darwinism\" to clean up the brain...\n\nRichard Dawkins  \n\"The Selfish Gene\" or/and  \n\"The Extended Phenotype\"\n\nBoth books are brillant!\n\n"
    },
    {
      "time": "27 Dec 2006 — 2:15am",
      "content": "I found _Underworld_ at Rome's airport and _Perfume_ at my parent's home. I was so unpatient that I began to read both at the same time (not a good idea maybe).\n\n\\> _House of Leaves, Mark Z. Danielewski_  \nI will buy that.\n\n\\> _Neal Stephenson_  \nI already read _Cryptonomicon_ and the _Baroque Cycle_ and truly enjoyed.\n\n\\> _The Winshaw Family_  \nI read that many years ago and still recommend to all my friends.\n\n\\> _Calvino, Sciascia or Primo Levi_  \nYou read my mind!\n\n\\> _Cormac McCarthy’s Blood Meridian is BEAUTIFUL_  \nI agree.\n\nCiao a tutti a buone feste!\n\n"
    },
    {
      "time": "27 Dec 2006 — 5:28am",
      "content": "\"What would you choose?\"\n\nDear Manlio,  \nIf it's not too late, I'd take the 1912 \"American Typefounders Founders Book of Type Styles\". It's more than just a book, and a great Bible companion.\n\nCheers!\n\n"
    },
    {
      "time": "29 Dec 2006 — 9:23am",
      "content": "[This](http://web.archive.org/web/20121102080523/http:/www.lib.uiowa.edu/spec-coll/gifts/miller.htm)? Where can I find it?\n\n"
    },
    {
      "time": "9 Jan 2007 — 6:55am",
      "content": "\" Where can I find it?\"  \nDepends. What do you want to do with it after you find it?\n\n"
    },
    {
      "time": "10 Jan 2007 — 3:23am",
      "content": "Still don't know. Depends on weight and size of the book.\n\n"
    },
    {
      "time": "10 Jan 2007 — 4:48am",
      "content": "\"Depends on weight and size of the book.\" 12\" X 9\" X 5\", must be three to five pounds, but it's got a lot of ink.\n\n"
    },
    {
      "time": "10 Jan 2007 — 6:12am",
      "content": "I loved Confederacy of Dunces - very funny. Loved Perfume also.\n\nGhostwritten and Cloud Atlas by David Mitchell are both brilliant.\n\nAmsterdam by Ian McEwan.\n\nAnd if you fancy something obscene: Filth by Irvine Welsh\n\nNick Cooke\n\n"
    },
    {
      "time": "10 Jan 2007 — 6:25am",
      "content": "\\> _Amsterdam by Ian McEwan_  \nI just got _Saturday_ as Christmas present. Thank you.\n\n"
    },
    {
      "time": "10 Jan 2007 — 7:08am",
      "content": "Now that's funny. I've literally just finished <cite>Saturday</cite>. 15 minutes ago! Loved it, even the long and detailed descriptions of surgeries and squash games. Strange because I remember I wasn't very impressed by <cite>Atonement</cite> when I first read it but now maybe I should have another go. How do you find the Italian translation of <cite>Saturday</cite> Manlio? I read it in Brazilian Portuguese.\n\nI like Patrick McGrath too. Not sure if his is your cup of tea, it's very intriguing though, a bit E.A.Poe-ish maybe. Stay away fom <cite>Martha</cite> though, it's a very heavy book to carry around (I know the feeling, for years I had to choose my books by their size and weight because I was always moving around).\n\n"
    },
    {
      "time": "10 Jan 2007 — 7:24am",
      "content": "\\> _How do you find the Italian translation of Saturday Manlio?_  \nI still didn't begin to read it, so I can't tell you anything.  \nA friend of mine is literally mad about _Atonement_. He even reads pages from that book to every woman he's dating.\n\n"
    },
    {
      "time": "10 Jan 2007 — 8:16am",
      "content": "I second Cloud Atlas. It's challenging but a great book.\n\n"
    }
  ]
}
