{
  "id": "30167",
  "title": "Page Dimensions",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello,\n\nHow do you think page dimensions of a magazine affect the user?\n\nWhat else do you think about the subject?\n\nPeace, Tom\n\n [‹ A delicate Didone](http://web.archive.org/web/20071017181443/http:/typophile.com/node/30094 \"Go to previous forum topic\") [Consistent web text sizing using CSS ›](http://web.archive.org/web/20071017181443/http:/typophile.com/node/30117 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071017181443/http://typophile.com/user/14955\" title=\"View user profile.\">tomhowe</a>",
  "time": "<br>",
  "uid": "14955",
  "comments": [
    {
      "time": " 20.Dec.2006 7.11am",
      "content": "That’s a pretty general question and therefore hard to answer - for me it’s how the type sits on the page that matters, how it’s organized, how easy to read, and to follow. How they organize different bits of info. I get more bothered by magazines that don’t have a TOC right up front than by differing formats.\n\n"
    },
    {
      "time": " 20.Dec.2006 7.31am",
      "content": "“I get more bothered by magazines that don’t have a TOC right up front than by differing formats.”\n\nRIGHT ON SISTER! I hate having to dig through a bunch of ads to figure out where to find something. I know the ad guys love me doing it but it has the opposite effect on me. I will never buy stuff from those folks so put the damn TOC in the first spread and be done with it!\n\nSorry Patty, didn’t mean to go off on that but you are very right about it.\n\nChrisL\n\n"
    },
    {
      "time": " 20.Dec.2006 7.38am",
      "content": "Page sizes of magazines are affected by standard paper sizes and web widths. Typical point-of-purchase racks also follow suit. The user needs something portable fitting in a briefcase and storable on shelves and easily readable on a plane or subway car. The typical mag today seems about right for all this.  \nFor my tastes, most magazines could use some more white space, they just look too crammed to me.\n\nChrisL\n\n"
    },
    {
      "time": " 20.Dec.2006 8.16am",
      "content": "I have sort of preference for 9.6 by 12.8 inches.\n\n"
    },
    {
      "time": " 20.Dec.2006 8.33am",
      "content": "cheers guys, anymore suggestions will be appreciated\n\n"
    },
    {
      "time": " 20.Dec.2006 8.53am",
      "content": "I’m sorry but I’m still not that clear what you’re asking. Do you want to know what trim size we like? For me, something I can fit in my handbag without folding - therefore no bigger than about 9 x 12. Preferably even 8 1/2 x 11. I like stapled rather than perfect bound because it’s easier to fold backwards but I guess that depends on page count.\n\nWhat sort of magazine are you working on. If it’s an art/fashion/architecture/design/style you could get away with a larger trim, if it’s a literary/reading mag I’d stick with letter sized.\n\nIs this helpful?\n\n"
    },
    {
      "time": " 20.Dec.2006 11.08am",
      "content": "“How do you think page dimensions of a magazine affect the user?”\n\nIf it’s too big, it kind of flops over in the magazine holder in the bathroom, and then gets all warped and wrinkly.\n\nIf it’s too small, then the magazine gets too think, and can’t even fit in the magazine rack so ends up on the floor where people drip all over it after getting out of the shower.\n\nIt’s a fine balance.\n\n"
    },
    {
      "time": " 20.Dec.2006 11.28am",
      "content": "I feel that that the digest sizes are supposed to be more portable, but end up a PITA. They are too big for pockets, to small to keep track of. Any smaller than Nat’l Geo is too small. And I want bigger pics. (Nat’l Geo also the min. for that.) The mainstream approx. size suits me, because I can roll it up, or shove it in a notebook if i need to take it to go (since its thinner). Oversized, I personally love, except that they almost never choose thicker cover stock, so they end up to floppy, or extra-floppy if they go thin to keep the weight similar to the average size. Nevertheless, if the oversized ones would be a hair more rigid, Id prefer them becoming dominant, as they usually look better.\n\nHurried, ATM, but does that answer ya?\n\n[Choz Cunningham](http://web.archive.org/web/20071017181443/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20071017181443/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20071017181443/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": " 20.Dec.2006 11.44am",
      "content": "Anything smaller than Rolling Stone. I know its been around for years, but that size makes storing and transporting ANNOYING. Sort of like using ALL CAPS to make my point. ;)\n\n"
    }
  ]
}
