{
  "id": "30170",
  "title": "E U L A",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Is there anyplace to get a snap-together font [EULA](http://web.archive.org/web/20141006194100/http:/typophile.com/wiki/EULA)? I can't snip and paste from someone else's w/o permission. I have had trouble finding a lawyer with any interest in writing one (esp. within my budget). Said budget being comparable to picking up a common fill-in-the-blank legal agreement from Staples or Office Depot.\n\nIf there is such a thing, I am sure it would interest several here, even if it is disclaimed from any lawyer's endorsement.\n\n",
  "author": "Choz Cunningham",
  "time": "20 Dec 2006 — 11:37am",
  "uid": "13605",
  "comments": [
    {
      "time": "20 Dec 2006 — 11:52am",
      "content": "In the past Monotype talked about allowing others to use their EULA. Might want to cotnact them, or Bill Davis (now at Ascender). Alternately doesn't MyFonts have a standard EULA for clients to use?\n\n"
    },
    {
      "time": "20 Dec 2006 — 12:12pm",
      "content": "Choz, Chester posted Village's EULA for anyone to use as they will. FWIW a lot of EULAs are super similar.\n\n"
    },
    {
      "time": "20 Dec 2006 — 12:12pm",
      "content": "My fonts does indeed. There have been several threads here on Typophile regarding EULAs which also were helpful. You might try searching for them and check the wiki as well.\n\nChrisL\n\n"
    },
    {
      "time": "20 Dec 2006 — 12:15pm",
      "content": "You can use ours if you want:\n\n[http://www.fountain.nu/licenseagreement.asp](http://web.archive.org/web/20141006194100/http:/www.fountain.nu/licenseagreement.asp \"http://www.fountain.nu/licenseagreement.asp\")\n\n"
    },
    {
      "time": "20 Dec 2006 — 12:49pm",
      "content": "_You can use ours if you want:_\n\nAnd THAT is part of why Fountain is one of my favorite foundries.\n\n"
    },
    {
      "time": "20 Dec 2006 — 1:43pm",
      "content": "re Fountain's:\n\n\"When embedding fonts the document must not include more than 60%(percent) of the character set of any individual style of the font before any distribution is allowed to take place. Using Adobe Illustrator or any similar applications which convert the font characters into editable outlines is NOT an acceptable means of producing an electronic document for distribution.\"\n\nThat seems arbitrarily and overly restrictive to me.\n\nI never understood the fear of PDF embedding. It's like telling people that you can only use half of the characters for each individual you print.\n\nIt's one of those 'punish the paying customer for things other people do' it seems.\n\n\"You will secure embedded documents against unauthorized use by any third party\"\n\nThat's even worse. Sounds like if someone steals my car and robs a bank, I'm liable. (Maybe I am...these are odd times...)\n\n(ADDENDUM...I in no way mean to single Fountain out, as this seems to be a common issue with most foundries' EULAs.)\n\n"
    },
    {
      "time": "20 Dec 2006 — 1:55pm",
      "content": "<cite>That seems arbitrarily and overly restrictive to me.</cite>\n\nI never understood the fear of PDF embedding. It’s like telling people that you can only use half of the characters for each individual you print.\n\nWhat I find particularly odd is the restriction against even including _outlines_ of the font. Is there some reason other than simply preventing piracy? And if its just to prevent piracy isn't it a bit paranoid to think that someone would rip the outlines from a PDF instead of just downloading a pirate copy?\n\n"
    },
    {
      "time": "20 Dec 2006 — 1:55pm",
      "content": "And, since it was asked, here's my ideal (as a consumer) EULA that I'd like to see:\n\n----------------------\n\nYou may...\n\n...use this font on paper, online and in embedded documents.  \n...install this on the machines that you personally use for work.\n\nYou may not...\n\n...sell this font (unless you are selling the individual license you purchased and, subsequently, delete all copies that you own)  \n...give away this font  \n...install it on other people's machines (with the exception of coworkers machines provided you have a site license)  \n...sue us if your computer blows up because you installed our font.\n\n----------------------\n\n"
    },
    {
      "time": "20 Dec 2006 — 3:27pm",
      "content": "From what I've seen, [Type Trust](http://web.archive.org/web/20141006194100/http:/www.typetrust.com/info/eula.php) has the most reasonable EULA.\n\n"
    },
    {
      "time": "20 Dec 2006 — 3:49pm",
      "content": "I think point 2.6 is a little over-the-top:\n\n2.6) Use In Branding Systems\n\nYou may not incorporate any Glyph(s) the Font Software in the production of a Branding System without obtaining a Commercial License from Publisher authorizing you to do so.\n\n"
    },
    {
      "time": "20 Dec 2006 — 5:16pm",
      "content": "Interesting the closest thing I've seen to Darrel 's perfect EULA is the Microsoft Vista / Office 12 license... ;-)\n\nc. Font Components. While the software is running, you may use its fonts to display and print content. You may only  \n• embed fonts in content as permitted by the embedding restrictions in the fonts; and  \n• temporarily download them to a printer or other output device to help print content.\n\n"
    },
    {
      "time": "20 Dec 2006 — 10:12pm",
      "content": "Bunch of great info here. Thanks guys! MyFonts generic agreement was kind of ...generic. And not how I want to share my stuff.\n\nI have to say, the readability of Vllg's agreement is very nice. Specifically, I read [the 1.3 for the village branded Mavis](http://web.archive.org/web/20141006194100/http:/www.vllg.com/Village/Mavis/Licensing/). This is the open license? Thinking I can cobble something out of that with some snips of Fountain's details.\n\n---\n\nThe typetrust agreement seems to parallels an idea I was toying around with. Is there a market for (or an example anyone has an opinion on) having fonts purchasable under different licenses? Examples:\n\nA 'Designer license' might have unlimited machines that are used predominantly by a single person - I rarely use my antique laptop, but it would be nice to have the same fonts on that as the workstation and the server. A 'Corporate license' might have unlimited machines owned by 1 company, and several sub-licenses for giving to print services. A 'Learning license' might include support, A \"Custom Super Deluxe license Royale ' might include a finite number of custom glyph additions/modifications, etc.\n\nIf this was a viable route, shouldn't these be kept as separate products, with their own appropriate license embedded in them only? Is this even an interesting or good idea?\n\n[Choz Cunningham](http://web.archive.org/web/20141006194100/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20141006194100/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20141006194100/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "21 Dec 2006 — 6:38am",
      "content": "_I think point 2.6 is a little over-the-top:_\n\nI don't. I'm actually really surprised you do, Tiff. If you look at how reasonably priced Type Trust's fonts are, you must admit it is unfair for a giant corporation like P&G (for example) to only have to pay $200 when they plan to mass market and reap \"gi-normous\" profits using a typeface. It only seems fair that they share those profits.\n\n"
    },
    {
      "time": "21 Dec 2006 — 8:34am",
      "content": "I guess I'm a little bit more on the side of graphic designers on that point. It seems unfair for anyone to have to get additional licensing simply to use a few glyphs to make a logo. If they were illustrative glyphs then I'd understand, but to use the letters AT&T and have to get additional licensing seems, like I said, a little over-the-top.\n\nYes, yes, from the type designers point-of-view, it sucks that a gi-normous company could get branded with three letters, but what about the rest of us that don't do logos for gi-normous companies?\n\nAt the end of the day, they can do whatever they think is fair in their license. It is up to them. But, they are turning away some customers.\n\n"
    },
    {
      "time": "21 Dec 2006 — 8:53am",
      "content": "I tend to agree with Tiff, I have to support the foundry's right to put anything they like into their EULA, but these kind of non-standard terms, don't just send customers away, they can trap customers who don't read them properly - these tend to be small companies rather than the multinationals who have armies of lawyers and deep pockets to solve this type of problem.\n\nCheers, Si\n\n"
    },
    {
      "time": "21 Dec 2006 — 8:57am",
      "content": "What I think all those exclusions mean is that for commercial use (even if it is just a logotype) you have to get a commercial license, which they don't sell on their website. The only have an automated cart to sell a something-else license, whatever it may be called. That they offer multiple licenses, but only one type via web seems the biggest bummer. I assume they base the 'larger' license on the scale of the client, or something like that.\n\nThis makes me wonder, aside from the specific examples in the faq, what would not require a better license than the one they most readily sell. Booksetting, I suppose.\n\nThis method is the most like what I am proposing above, though I want to have them all accessible to the shopper to compare and pick. Is this too many choices, and confusing or senseless?\n\n[Choz Cunningham](http://web.archive.org/web/20141006194100/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20141006194100/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20141006194100/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "21 Dec 2006 — 9:04am",
      "content": "<cite>If you look at how reasonably priced Type Trust’s fonts are, you must admit it is unfair for a giant corporation like P&amp;G (for example) to only have to pay $200 when they plan to mass market and reap “gi-normous” profits using a typeface. It only seems fair that they share those profits.</cite>\n\nNot to mention that some designers who are charging five or ten-thousand dollars for simple logotypes are letting the foundries do a lot of work that used to be done by lettering artists who were paid a lot more than a font sells for now.\n\n"
    },
    {
      "time": "21 Dec 2006 — 9:19am",
      "content": "_but what about the rest of us that don’t do logos for gi-normous companies?_\n\nI agree with you and Simon here. I think branding is a \"gray area\" issue. Is it branding for a small fishing and tackle store in Anytown, USA? Or the new look of Tide detergent? Both are branding, but obviously there are different uses for each.\n\nHow about we introduce the idea that photo houses use with Rights Managed vs. Royalty-Free?\n\n"
    },
    {
      "time": "21 Dec 2006 — 9:38am",
      "content": "_How about we introduce the idea that photo houses use with Rights Managed vs. Royalty-Free?_\n\nExpand, please?\n\n[Choz Cunningham](http://web.archive.org/web/20141006194100/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20141006194100/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20141006194100/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "21 Dec 2006 — 9:55am",
      "content": "Rights-Managed photos charge the user a \"per usage\" fee. Depending on how the image is going to be used. Rights-Managed photography is usually more expensive. In many cases a contract can also grant the user exclusivity to the image.\n\nRoyalty-Free photography is generally cheaper (often in terms of quality as well), but there usually is no limit to how many times you can use the image.\n\nSee [Getty Images here](http://web.archive.org/web/20141006194100/http:/creative.gettyimages.com/source/home/license.aspx) for a better description.\n\n"
    },
    {
      "time": "21 Dec 2006 — 10:17am",
      "content": "All of this talk of snap together EULAs. I'll paraphrase Frank Martinez here in saying that a type designer's eula is a major component of their business plan, so one size (or pieces of one size) will not fit all.\n\n"
    },
    {
      "time": "21 Dec 2006 — 10:21am",
      "content": "Good point, also with respect to the seemingly odd clauses in EULA's Frank said that in most cases foundry's inserted these becuase they got burned or ripped off in that way in the past - which is worth thinking about.\n\n"
    },
    {
      "time": "21 Dec 2006 — 10:45am",
      "content": "Yes, that is a good point James. I certainly was not trying to say that one EULA fits all. That will never be the case.\n\nTerry, the idea of Rights Managed vs. Royalty-free fonts might eventually be something to consider. But first the masses must be educated--and for the record we geeks here on Typophile are not the masses--that there is value to deserve such licensing control.\n\nNot to be pessimistic, but I wonder how many people have honestly licensed fonts from The Type Trust in regards to their EULA. Or, more to the point, how many people have licensed from them and then realized what they have done. Ah EULAs. Gotta love them.\n\n"
    },
    {
      "time": "21 Dec 2006 — 11:12am",
      "content": "My EULA allows glyphs to be used in logos.  \nBut for more sensitive foundries, perhaps a clause along the lines of \"...only if the type has a dropshadow, hilite, and/or swoosh\" might be more practical than an outright ban.\n\n"
    },
    {
      "time": "21 Dec 2006 — 11:15am",
      "content": "“…only if the type has a dropshadow, hilite, and/or swoosh”\n\nNow your talkin', and an inner glow costs even more :-)\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2006 — 12:36pm",
      "content": "Fonts becoma a part of \"branding\" under different conditions anyway. A few glyphs in a logotype might be one thing, but many corporate style guides dictate things to the extent of: all corporate communications (or some subset, like a specific ad campaign) must use \"Font X\". A special corporate use license is certainly warranted in the latter situation, the fee for which could and should be based with regard to the size of the company and extent of use.\n\n"
    },
    {
      "time": "21 Dec 2006 — 12:46pm",
      "content": "\"all corporate communications (or some subset, like a specific ad campaign) must use “Font X”. A special corporate use license is certainly warranted in the latter situation, the fee for which could and should be based with regard to the size of the company and extent of use.\"\n\nYes, but that is covered under number of users or devices already.\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2006 — 12:55pm",
      "content": "_Yes, but that is covered under number of users or devices already._\n\nSort of. It depends on whether we're talking for \"internal\" use, or \"general\" use. If you're a magazine publisher for example, you're going to be printing an awful lot of type.\n\n"
    },
    {
      "time": "21 Dec 2006 — 2:05pm",
      "content": "I meant corporate branding as in the quote,\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2006 — 2:05pm",
      "content": "Most corporate licenses allow distribution to parties doing work for said corporation. Printers, agencies etc. So that would not be covered in the standard EULA under number of users or devices. Generally corporations want Worldwide/Enterprise licenses. These tend to rather expensive, and as it relates to the business of type design, a couple of those a year, are just what the doctor ordered.\n\n"
    },
    {
      "time": "21 Dec 2006 — 3:01pm",
      "content": "I would think that instead of worrying about people using a font in a logo they would concentrate on corporate licensing instead.\n\n"
    },
    {
      "time": "21 Dec 2006 — 4:28pm",
      "content": "That was what I meant too Tiff.\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2006 — 7:18pm",
      "content": "Yeah, but many smaller foundries don't have that luxury. You have to pay your dues before a foundry can command say Linotype or FontShop sized licensing.\n\nI think we're talking about different kinds of business models here, and no one EULA is going to satisfy everyone's needs.\n\n"
    },
    {
      "time": "21 Dec 2006 — 9:30pm",
      "content": "We frown upon the occasional user asking us to recommend a good free font. But a free EULA? Now that's a great idea :-)\n\n"
    },
    {
      "time": "22 Dec 2006 — 4:04am",
      "content": "Well, if I was at eulaphile.com, I imagine the situation would be different. :) There is still vital info here. And this was all after getting blank stares back from 3 lawyers, \"...you want to make a _what_?\n\n[Choz Cunningham](http://web.archive.org/web/20141006194100/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20141006194100/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20141006194100/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "22 Dec 2006 — 5:18am",
      "content": "\"And this was all after getting blank stares back from 3 lawyers, “…you want to make a what?\n\nFrank Martinez won't give you any blank stares. He is \"Da Man\" when it comes to EULAs.\n\nChrisL\n\n"
    },
    {
      "time": "22 Dec 2006 — 7:50am",
      "content": "\\>We frown upon the occasional user asking us to recommend a good free font. But a free EULA? Now that’s a great idea :-)\n\nGood point.\n\n"
    },
    {
      "time": "22 Dec 2006 — 8:20am",
      "content": "Terry,\n\nIf you have a font design that a corporation wants, you license it to them at the same rates as Lino or Mono. It could be even more! We have been fortunate enough to be involved in some of this and I know for a fact that in one project we were more expensive than Monotype. But the client eventually selected one of our designs.\n\nEric Olsen's Process Foundry has licensed some of their fonts for use on the Chevrolet account.\n\nThe problem, as I see it, is not the difference between large and small. It is that many small foundries under price their work. They haven't either looked for or gotten good advice as to current business practices as it relates to font license pricing.\n\nThere are some fairly consistent pricing models out there. You just have to do a bit of research. Speaking any more about pricing on a public forum could be construed as price fixing, so I'll leave it there.\n\n"
    },
    {
      "time": "4 Jan 2007 — 2:07pm",
      "content": "Busy with work and the holidays I missed this...\n\nJames, My comment wasn't so much about size as about experience. You and Eric Olsen I would say fall into the category of having \"paid your dues.\"\n\n"
    },
    {
      "time": "4 Jan 2007 — 3:46pm",
      "content": "I don't frown on users asking for a good free font. Typophile.com is not a hive mind. If they find a font that is legal, free and good, more power to them. They would be stupid to choose anything else, if that meets all their needs. So, I frown on those who overbuy type, and those who oversell it.\n\nSince a number of people here make a living making, productizing or selling it, the bias of the community might be towards recommending commercial products. Not out of direct greed, but out of an affinity to the rest of the industry, and a ingrained tendency to value all type.\n\nOr, since free fonts are widely available and can be sampled prior to use indefinitely, \"we\" frown on askers, because it is a bit obtuse, like asking what's the number for 911? Ok, maybe I frown a little, too. ;)\n\nI didn't go to a lawyer's forum looking for the info, and did some research first. I am aware of the difference between having your longtime estate lawyer draft a will and fill-in-the-blank will kits. Quality. But it is driving me crazy to write one-off agreements, and the examples above have been an immense help in drafting my own set, as have the responses to them from \"we\" type consumers. Some EULA is better than none, and I know I am getting what I pay for. Actually, I am getting an education, and it is a bargain.\n\n[Choz Cunningham](http://web.archive.org/web/20141006194100/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20141006194100/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20141006194100/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "4 Jan 2007 — 10:21pm",
      "content": "It’s not a common EULA but - from my point of view - a quite simple, efficient and interesting solution. - [The MOLOTRO Licence Agreement!](http://web.archive.org/web/20141006194100/http:/www.molotro.com/license.html)\n\nI hope it contributes to your requirements.\n\n/\\* Vertex \\*/\n\n"
    },
    {
      "time": "13 Jan 2007 — 4:14pm",
      "content": "<cite>I think point 2.6 is a little over-the-top...</cite>  \n<cite>... At the end of the day, they can do whatever they think is fair in their license. It is up to them. But, they are turning away some customers.</cite>\n\nI'm a little late coming into this thread, but I just wanted to add a few things that seem to be overlooked/assumed.\n\nTiff, you make it sound as though you expect a Commercial Use license to be completely unaffordable to the little guy. This is not the case and is not inteded to turn away customers, but rather to involve them in a real discussion/recognition of the value of type.\n\nThe TypeTrust position is that it's wholly reasonable for a graphic designer to sell a logo for a few grand and in turn recognize the value of the typefaces used. It's a matter of value, and always open to negotiation.\n\nA license does not always have to be assigned a monetary value either. There are other forms of exchange. Listing designer credits would be ideal in the case of a magazine or book. Other media such as billboards and broadcast would more likely be a matter of money.\n\nIf a potential customer reads any part of our EULA and decides not to license from us, then there is absolutley no harm done. We'd actually respect it as a genuine act of respect for the EULA. If someone is reading and comparing EULAs, we're already happy.\n\nWe're not in the retail font business to make a quick buck. We're in it to publish good type and protect our interests in doing so. We want to establish a clientbase rather than a customerbase... people who want to work with us, not just our fonts.\n\nIt's an optimistic view to expect the design community to someday understand the value and rights involved in creating and using digital type. Some might call it \"over-the-top\". (Over the top of what is my question.) But the greater design community's generally lax perception of the value of the type designer's work won't be heightened if we as type designers don't assert our positions and protect our interests. A very specific, strict EULA is the first step in setting the stage. Being open and available for comment and discussion is the next.\n\n"
    },
    {
      "time": "15 Jan 2007 — 3:43pm",
      "content": "Silas you're right. I have only had a few opportunities to discuss commercial licenses with a handful of foundries. My experience in that is limited. Also, I could've said something similar to you in that conversation should be the first step, not giving up.\n\n"
    },
    {
      "time": "18 Feb 2007 — 7:58am",
      "content": "I suppose I should connect the threads\n\n[EULA II](http://web.archive.org/web/20141006194100/http:/typophile.com/node/31527)\n\n"
    },
    {
      "time": "15 Feb 2009 — 2:59pm",
      "content": "Bumpalump!\n\nI've been looking for EULA writing info and figured to search instead of starting a new thread and asking the same things that have been asked all over again. Good thing I did, too.\n\n"
    }
  ]
}
