{
  "id": "30184",
  "title": "Gill Sans - How many versions available digitally?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I'm curious to know what versions of Gill Sans are available. (I don't mean all the wacky variations.) I'm curious because Gill Sans is such a ubiquitous face - are all the Gill Sans I'm seeing the same as available from Monotype, Linotype, Adobe, etc? Or do Gills Sans fonts vary from foundry to foundry?\n\n",
  "author": "<a href=\"/web/20120104164340/http://typophile.com/user/15485\" title=\"View user profile.\">Blue</a>",
  "time": "<br>",
  "uid": "15485",
  "comments": [
    {
      "time": "",
      "content": "\"Gill Sans\" is a Monotype Corp trademark. So any font (legally) using the trademark would be doing so under their authority/license.\n\nCheers, Si\n\n"
    },
    {
      "time": "",
      "content": "So you're saying that all normally available digital fonts called Gill Sans should conform to Monotype's digitized version?\n\n"
    },
    {
      "time": "",
      "content": "Yep, with 'normally available' being the catch - I'm sure over the years that have been various one-offs made for different technologies that diverge from the norm.\n\n"
    },
    {
      "time": "",
      "content": "Around the town, you may also be seeing clones which have names such as \"Gyll Sanz\" \"Gil\" or \"Grille\" or something like that. For every font you can recognize by sight, there always seems to be well-tolerated clones ad infinitum.\n\n[Choz Cunningham](http://web.archive.org/web/20120104164340/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20120104164340/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20120104164340/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "",
      "content": "Patrick, when you say _all the Gill Sans I’m seeing..._ which ones are you looking at?\n\nSimon's right about the creation of various one-offs, but this is not done just for technological reasons. There may be as many versions of Gill Sans as there are large-scale corporate customers who use it as a house face. For instance, Saab's corporate ID specifies Gill Sans just as the BBC does, but I'd be surprised if the agencies servicing those accounts haven't customised the fonts specifically, so there will be variations. It's not uncommon to open up a font folder in a commercial studio and see 'agency cuts' of very well-known fonts like this. Sometimes they include logos and marks specific to the client brands.\n\nIn addition to this, Monotype themselves used to make a (Postscript Type 3) version of GS that had an alternate numeral 1 that could be recognised apart from the uppercase I and the lowercase l. Back in the days of metal typesetting this version had a 'f' in front of the series number. I think this convention disappeared when the font got issued as a Postscript Type 1 from the Adobe/Linotype libraries, but you'd have to check with the foundries themselves about this.\n\n"
    },
    {
      "time": "",
      "content": "I seem to remember that there once was a PS1 Gill Sans by Berthold which was different from Monotype's version, but i don't think it is available any more.\n\n"
    },
    {
      "time": "",
      "content": "Gill Sans with the alternate 1  \n [http://www.fonts.com/FindFonts/detail.htm?pid=243246](http://web.archive.org/web/20120104164340/http:/www.fonts.com/FindFonts/detail.htm?pid=243246 \"http://www.fonts.com/FindFonts/detail.htm?pid=243246\")\n\nGill Sans OpenType  \n [http://www.monotypefonts.com/opentype/gill/](http://web.archive.org/web/20120104164340/http:/www.monotypefonts.com/opentype/gill/ \"http://www.monotypefonts.com/opentype/gill/\")\n\nHumanist 521, subtle differences, narrower A in the light weight, for example  \n [http://www.myfonts.com/fonts/bitstream/humanist-521/](http://web.archive.org/web/20120104164340/http:/www.myfonts.com/fonts/bitstream/humanist-521/ \"http://www.myfonts.com/fonts/bitstream/humanist-521/\")\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "I have my own Gill Sans pet-peeve that I felt I must share.\n\nWhen I first bought my Type 1 - directly from Monotype (back in the days when they were the only manufacturer who held the legal rights) I paid over $900 for the family. They promised me that they would never sell the family to Adobe for mass distribution.\n\nSeveral years later, not only did Adobe have the rights from them to produce it for all -- but they even packaged it with their Illustrator 5.5 as a bonus!\n\nI don't think I've ever forgave Monotype.\n\nBut then again, so many of the original typesetting equipment manufacturers felt the \"come around, go around\" --\n\nThank you.\n\n"
    },
    {
      "time": "",
      "content": "Franz – another Berliner once sent me this following image as an example of Gill Sans; it may be the Berthold 'cut' you are referring to.\n\n ![](http://web.archive.org/web/20120104164340im_/http:/typophile.com/files/notgillsans_6190.jpg)\n\nSo, to answer the original question, yes, here is a case of Gill Sans produced by a different foundry and appearing quite radically different as a result.\n\nTim's right to point out the difference of width in the Bitstream version of Gill Sans – but then there are major differences between Bitstream's interpretation of say, Futura, and everyone elses' versions of the 'same' Futura.\n\nTim – I thought that alternate one version had disappeared completely! So Monotype still have it eh? But not Adobe/Linotype? Thanks for the links.\n\nJackie – it's fair to say that the entire industry was in a state of flux back then – and not everyone honoured their promises about 'who would distribute what'. I worked for one of Monotype's resellers in the early 90s and there were a great many anguished phone calls...  \n(BTW, my avatar image is a handprint made by my daughter when she was aged about seven, the B is hand-drawn; I've never seen the Berkley Crime Books logo you refer to elsewhere.)\n\n"
    },
    {
      "time": "",
      "content": "Ben, that is a very unpleasant version, especially the s.  \nTim\n\n"
    },
    {
      "time": "",
      "content": "The Postscript Type 1 Gill Sans that I use -- and I use it daily for a major client -- is old enough that I bought it on floppies! Apart from the fact that it is not OT, would you say that my version (ca. 1987) is identical to what Monotype are now selling for Type 1?\n\nI'm thinking about the welcome change from the original (wasted away and anemic) digital Bembo to the new Bembo Book, but I don't remember seeing any references to Gill Sans being re-digitized. Am I right or am I left?\n\n"
    },
    {
      "time": "",
      "content": "That's on h\\*llish AND ugly rip off‚ evidently scanned and streamlined.\n\nThere was (maybe still is) a Berthold Gill, differing in (at least) the shape of the numeral 1 (with a 'flag' that is). Berthold published it as part of their BQ-series (Berthold Design Types) in 1994.\n\n"
    },
    {
      "time": "",
      "content": "It is likely that Monotype and/or Adobe did revisions to their Type 1 versions between 1987 and today. However, these would likely have been on the order of \"bug fixes\" rather than any noticeable design changes.\n\nRegards,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Ben, i don't think that's Gill Sans BQ. I don't have it, but i seem to remember too (as bert\\_vanderveen pointed out) that it had a “flagged” numeral One, but otherwise it was decent, but most likely different, as any BQ versions of faces available or originating from other foundries were different.\n\n"
    },
    {
      "time": "",
      "content": "If i remeber correctly, Berthold used to have their own versions of a few modern/sans serif faces, like Futura and Univers, and these seemed to be a bit more down-to-earth, a bit less polished, a little darker and robust than the respective versions of other foundries. I think it's quite a safe bet to say their version of Gill was like that, too, at least for a tendency.\n\n"
    }
  ]
}
