{
  "id": "30180",
  "title": "Thoughts on color and details",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "GO is a series of cultural events presented in themes on a bi-monthly basis.  \n\"Look East\" was the last series, and included events like sushi tasting, Ikebana/Bonsai displays, and sudoku competitions. Future themes are based on time, mystery, and family.\n\nI am the lone designer, so any feedback that would strengthen the mark I would appreciate.\n\nThanks.\n\nAndrew\n\n| Attachment | Size |\n| --- | --- |\n| [gologo.jpg](http://web.archive.org/web/20131022060518/http:/typophile.com/files/gologo.jpg) | 71.19 KB |\n\n",
  "author": "andrew_baker",
  "time": "21 Dec 2006 — 9:35am",
  "uid": "1864",
  "comments": [
    {
      "time": "21 Dec 2006 — 9:53am",
      "content": "Beautiful design that the eye lingers on. Contemporary and pleasant, but not too trendy. At some spots the orange and red seem to bleed together, deforming the 'g', though that may be an artifact of my monitors' issues.\n\n[Choz Cunningham](http://web.archive.org/web/20131022060518/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20131022060518/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20131022060518/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "21 Dec 2006 — 11:28am",
      "content": "Interesting, but all I see when I look at the two top \"heads,\" is a Mickey Mouse hat. Not being facetious... that's what I keep seeing.  \nDB~\n\n"
    },
    {
      "time": "21 Dec 2006 — 11:58am",
      "content": "The curves on the bottom left of the g are not resolved. There appears to be a dent in that spot.\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2006 — 12:39pm",
      "content": "Thank you for the responses. Let me work on some of your suggestions.\n\n"
    },
    {
      "time": "21 Dec 2006 — 1:56pm",
      "content": "improvement?\n\n ![](http://web.archive.org/web/20131022060518im_/http:/typophile.com/files/gologo2_4526.jpg)\n\n"
    },
    {
      "time": "21 Dec 2006 — 2:10pm",
      "content": "A little better but still not smooth.\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2006 — 2:25pm",
      "content": "I might remove the yellow entirely and leave the center figure as a negative space.\n\n"
    },
    {
      "time": "21 Dec 2006 — 2:33pm",
      "content": "here with the yellow out\n\n ![](http://web.archive.org/web/20131022060518im_/http:/typophile.com/files/noyelo_5361.jpg)\n\n"
    },
    {
      "time": "21 Dec 2006 — 2:53pm",
      "content": "Seems so much better without yellow and the first thing I noticed was the Mickey Mouse head too. Sorry but just trying to give feedback.\n\n"
    },
    {
      "time": "21 Dec 2006 — 3:04pm",
      "content": "I like the feedback. I think the 'bump' is a result of my red and orange shape meeting. I'm still not happy with the counter of the g, and the figure's bodies. No more time until after the holidays.\n\nHappy Holidays, folks\n\n"
    },
    {
      "time": "21 Dec 2006 — 4:27pm",
      "content": "I don't think the bump I see results from the orange shape. I think it is just a typical curve issue and just needs a little tender-lovin-care with quality time spent :-).\n\nChrisL\n\n"
    },
    {
      "time": "21 Dec 2006 — 5:04pm",
      "content": "Sniff. I miss the yellow. :)\n\n[Choz Cunningham](http://web.archive.org/web/20131022060518/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20131022060518/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20131022060518/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "21 Dec 2006 — 7:33pm",
      "content": "Improvement? YES!!! I like the Yellow, but I've always been a Pennzoil fan!  \nDB~\n\n"
    },
    {
      "time": "22 Dec 2006 — 2:22am",
      "content": "Hi,  \nI Like the letterforms as such, except for the curve ChrisL mentioned... It's what makes a 'good' logo 'great':-)... .. But overall i like the design... Whiteshape figure is definitely an improvement.  \nMarco\n\n"
    },
    {
      "time": "22 Dec 2006 — 4:44am",
      "content": "Hi andrew,\n\nAccording to me, something is really disturbing in your overall form.  \nmay be because of these things:\n\n\\>the relative proportion of the letters \"g\" and \"o\" is not correct to me. And your \"O\" neither looks caps, nor looks small.\n\n\\>three human figures looks they are not at their right place and there is no connectivity in the human figures and the letterforms you've used.\n\n\\> yes It does gives the feeling of a festival but its a bit unbalanced.\n\n\\>When the overall look of your logo is very humanistic and freehand, why the \"O\" is perfect circle?? As in the \"O' has a regular thickness whereas \"g\" does'nt.( Even the inner circle of 'g')\n\n\\>The stroke joining the \"g\" and \"O\" is forcefull to me.\n\n\\> It looks like you've made it directly on the computer..and thats without using any existing typeface.\n\nI liked the overall look of the logo..but still, there is a scope of further improvement.\n\n\\*\\*  \nAll these were based on my personal understanding..they may be wrong also..the final call must be taken by you.\n\nAll the best.\n\nsatya  \nstudent, graphic design  \nIndia\n\n"
    },
    {
      "time": "22 Dec 2006 — 5:47am",
      "content": "I can't quite say if I like it or not, but it's definitely very distinctive. Nice job making something different!\n\n"
    },
    {
      "time": "22 Dec 2006 — 6:43am",
      "content": "I agree the logo does suffer from inconstencies based on less time in preparatory sketch. But there is no reason to base it from existing type.\n\nThe counter of the O is a perfect circle. but so is the counter of the G. I think I may shrink the O's counter.\n\nI am not happy with the figures yet either. Connectivity to GO? It's family programming.\n\nI will work more after the holiday.\n\n"
    },
    {
      "time": "23 Dec 2006 — 9:27am",
      "content": "Hmm... I made a post yesterday, but it seems to have been lost into the aether. Basically my two points were this:\n\n1. I read \"gb\" not \"go\"  \n2. The orange is too close to the red. I'd make it more golden.\n\n- Lex\n\n"
    },
    {
      "time": "25 Dec 2006 — 2:58am",
      "content": "To me its a problem with the people on the top.  \nOn the first look I thought the two taller ones are symmetrical, but on a closer look they actually are not. I would try to change this by either making the figures symmetrical or make clear that they are not. You should decide on that. Could do this through changing the angle of the arms or playing around with the body heights a little bit.\n\nJo.\n\n"
    },
    {
      "time": "26 Dec 2006 — 9:21am",
      "content": " ![](http://web.archive.org/web/20131022060518im_/http:/typophile.com/files/gologo3_5806.jpg)\n\n"
    },
    {
      "time": "27 Dec 2006 — 9:01am",
      "content": "Satya,I tightened the G up, and made the O smaller.  \nI feel it is more consistent throughout\n\nChris, I am not sure how to get rid of the bump.\n\nThank you everyone for the feedback. I hope I have not ignored too much of it.\n\n ![](http://web.archive.org/web/20131022060518im_/http:/typophile.com/files/gologo4_6126.jpg)\n\n"
    },
    {
      "time": "27 Dec 2006 — 12:00pm",
      "content": "UNICEF\n\n"
    },
    {
      "time": "11 Jan 2007 — 10:13am",
      "content": "A set of banners to hang in library atrium. 6x20 feet.\n\n ![](http://web.archive.org/web/20131022060518im_/http:/typophile.com/files/bannseries_6256.jpg)\n\n"
    },
    {
      "time": "22 Jan 2007 — 10:03am",
      "content": "I really like the way it turned out in the banners. Communicated the message clearly, looks good. I like the white gradient under the logo in the first banner, very clean. The only thing I severely dislike in the banners are the \"Hear\", \"See\" and \"Do\" colored drop-shadows. I think either a stroke, or no effects would be a lot clearer and more in line with the rest of the design. Love the 'go' now, though, I'd really stick with it.\n\n"
    },
    {
      "time": "23 Jan 2007 — 1:11pm",
      "content": "Sebastiaan,the banners were sent for production, but I can rethink the Hear, See, Do type for other peices. Thanks for the feedback.\n\nAndrew\n\n"
    }
  ]
}
