{
  "id": "30194",
  "title": "Type on the Nintendo Wii",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "In the spirit of [Type on the Sony Reader](http://web.archive.org/web/20100806205822/http:/typophile.com/node/29470) readers may be interested in type on Wii, the device boasts web browsing functionality so type is used for more than the product UI. There's a gallery of images here...\n\n[http://www.engadget.com/2006/12/22/wii-browser-hands-on/](http://web.archive.org/web/20100806205822/http:/www.engadget.com/2006/12/22/wii-browser-hands-on/ \"http://www.engadget.com/2006/12/22/wii-browser-hands-on/\")\n\nDifficult to tell too much, except that the browser font seems to be the standard Wii UI font (note the quirky e) and that it doesn't seem to hold up too well at small sizes (well this is on a TV of course) - also can't tell if the bold and italic is true or faked. But still the shots are worth checking out and I'm sure better ones will be posted sooner or later.\n\nEnjoy, Si\n\n",
  "author": "<a href=\"/web/20100806205822/http://typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": "",
      "content": "This thread is just begging for some Chris Lozos puns! I can't wait!\n\n"
    },
    {
      "time": "",
      "content": "I know I had to hold back ;-)\n\n"
    },
    {
      "time": "",
      "content": "If anyone wants to come over and dissect the type on the Nintendo Wii over the holidays, mine is sitting around glowing blue. But I only have Wii Sports to play, because it was a gift and I'm too broke to buy games. Hell, I might have to get an internship next semester just to make use of an x-mas gift!\n\n"
    },
    {
      "time": "",
      "content": "So here's my review of type on the Wii browser: it sucks. This isn't so much a problem with the Wii as it is with the browser, which really isn't even finished enough to be called a beta. The zoom functionality needed to make type readable doesn't actually work, so it's pretty much useless.\n\nIt does, however, have the ability to render a lot of flash content, including Typophile.com. This could be a killer app for the Wii; if Google just adds a Wii Youtube portal we can sit on the couch and watch videos.\n\n"
    },
    {
      "time": "",
      "content": "I wonder if you could take some close-up pics - particualrly interested in spacing, small sized type, bold and italics. ;-)\n\nThanks, Si\n\n"
    },
    {
      "time": "",
      "content": "...and while your at it a test page of international support would be good too - if it's not asking too much ;-)\n\n"
    },
    {
      "time": "",
      "content": "Speaking of type on screen, for xmas I got a Pentax digital camera. I had wanted a new digital camera that didn't take proprietary batteries (as i was getting sick of buying those) and, apparently, Pentax is one of the few companies making cameras that take regular batteries (according to the store clerk, at least).\n\nAnyways, the camera seems nice enough but will likely have to return it simply because I can not stand the on-screen typography and iconography. I can usually tolerate bad UI as long as the product works, but the Pentax UI just really bugs me for some reason.\n\nMaybe I'll trade it for a WII. ;o)\n\nInteresting that the WII is using Opera. Nice to see that!\n\nsii...in case you missed it, there are some larger images on that site:\n\n[http://www.engadget.com/photos/wii-browser-hands-on/115476/](http://web.archive.org/web/20100806205822/http:/www.engadget.com/photos/wii-browser-hands-on/115476/ \"http://www.engadget.com/photos/wii-browser-hands-on/115476/\")\n\n"
    },
    {
      "time": "",
      "content": "It could be Rodin: [http://www.fontworks.co.jp/typography/family/rodin](http://web.archive.org/web/20100806205822/http:/www.fontworks.co.jp/typography/family/rodin \"http://www.fontworks.co.jp/typography/family/rodin\")\n\n"
    },
    {
      "time": "",
      "content": "Nunymare, you’re right. It’s Rodin, a Japanese font.\n\n"
    },
    {
      "time": "",
      "content": "It's Rodin by FontWorks. The PSP's UI font is NewRodin by FontWorks. :)\n\nKind regards,  \nMartijn van Berkel\n\n"
    }
  ]
}
