{
  "id": "30209",
  "title": "[music] James Brown, 1933-2006",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[http://www.sfgate.com/cgi-bin/article.cgi?f=/n/a/2006/12/25/entertainmen...](http://web.archive.org/web/20120627030411/http:/www.sfgate.com/cgi-bin/article.cgi?f=/n/a/2006/12/25/entertainment/e000345S34.DTL \"http://www.sfgate.com/cgi-bin/article.cgi?f=/n/a/2006/12/25/entertainment/e000345S34.DTL\")\n\n",
  "author": "Alessandro Segalini",
  "time": "25 Dec 2006 — 3:02pm",
  "uid": "9599",
  "comments": [
    {
      "time": "25 Dec 2006 — 3:03pm",
      "content": "I am Music, the most ancient of the arts. I am more than ancient: I am eternal. Before the earth began, I was already there, in the winds and in the waves. When the first trees, flowers and fields appeared, I was among them. And when man appeared I became immediately the most delicate, the lightest and the strongest way of expression of Man's emotions.\n\nWhen men were little more than beasts I had an influence for their good. In all the ages I inspired men with hope, set alight their love, gave voice to their joys, I made them happy for the courageous acts and comforted them in the desperate moments. I played an important part in the life drama that has for aim and goal the complete perfection of Man's nature. Through my influence, the human nature has been raised, mitigated and sharpened. With men's help I became an Art. I have a multiplicity of voices and instruments.\n\nI stand in the heart of all men and on their tongues in all the lands, among all the people; the ignorant and the illiterate know me as the rich and the scholar do because I speak to all men in a language they all understand. Even the deaf can hear me if he only listens the voice of his soul. I am the food of love. I taught men mildness and peace and I guided them towards heroic acts. I give comfort to the lonely and I harmonize the discord of the crowds. I am a necessary luxury for all men. I am Music.\n\n_Anonymous_\n\n"
    },
    {
      "time": "25 Dec 2006 — 4:30pm",
      "content": "It is a sad Christmas indeed. :(\n\n"
    },
    {
      "time": "25 Dec 2006 — 7:08pm",
      "content": "_I (don't) feel good.  \nI knew that I would (this day) now._\n\nCan you see the light?\n\n(And with the homage of Weird Al) Living with a hernia.\n\nPapa's got a brand new bag....\n\nUnfortunately.\n\n"
    },
    {
      "time": "25 Dec 2006 — 7:36pm",
      "content": "My son is going to be devistated. James Brown is his favorite performer of all time.\n\nChrisL\n\n"
    },
    {
      "time": "25 Dec 2006 — 7:41pm",
      "content": "Yeah, I know. My regular grocery store (the local equivalent of Giant Foods, Chris) ran a campaign a few years ago with the \"I Feel Good\" tag and music: it was great, and moved them into being the most popular shop here in town.\n\n"
    },
    {
      "time": "25 Dec 2006 — 8:07pm",
      "content": "My son is autistic. He will always be remembered at the Special Olympics for belting out his perfect imitation of JB from the medal platform after winning first place in the 200 meter freestyle, \"I Fe-e-e-e-e-l GOOD!\" He rocked the place!\n\nChrisL\n\n"
    },
    {
      "time": "25 Dec 2006 — 8:51pm",
      "content": "I bet. :-)\n\n"
    },
    {
      "time": "25 Dec 2006 — 8:58pm",
      "content": "For me (and my daughter) he will always be remembered as the highlight of Rocky IV.\n\nPeace, Si\n\n"
    },
    {
      "time": "26 Dec 2006 — 8:53am",
      "content": "Now THAT is funky…\n\nRIP JB\n\npeace\n\n"
    },
    {
      "time": "26 Dec 2006 — 9:08am",
      "content": "James Brown was a great innovator, and one of the greatest performers. I love him as a balladeer particularly.\n\nAs an innovator, he was particulary important in rhythm. Be-bop had changed jazz from a traditional blues rhythm, which breaks the 4 beats down further into doublets or triplets, to a 16th note feel. As I see it, James Brown did this in a different way in rock, and introduced a new rhythmic feel, which was hugely influential.\n\nJust as Charlie Parker kept a blues feel even while playing much faster, James Brown kept a blues feel even in his faster rhythms. But unfortunately the followers IMHO have not been able to do it so well. And as a result the sense of 'swing' in both Jazz and Rock have declined.\n\nAt least that's how one 'old school' guy feels.\n\n"
    },
    {
      "time": "26 Dec 2006 — 10:26am",
      "content": "Chris, tell me you've got some video footage of that! :)\n\nJames Brown: _he didn't know karate, but he knew ka-razy._ Still a staple in our iTunes music rotation. :)\n\n"
    },
    {
      "time": "26 Dec 2006 — 11:45am",
      "content": "Oh man, this sucks. Big time.  \nRIP\n\n"
    },
    {
      "time": "26 Dec 2006 — 12:09pm",
      "content": "Sorry Terry no video :-(\n\n ![](http://web.archive.org/web/20120627030411im_/http:/typophile.com/files/medal-stand_5571.jpg)\n\nChrisL\n\n"
    },
    {
      "time": "26 Dec 2006 — 12:33pm",
      "content": "Don't forget the work he did for civil rights for black people. A lot more than an entertainer.\n\n"
    },
    {
      "time": "26 Dec 2006 — 1:45pm",
      "content": "I saw him once on the street in front of the Plaza Hotel, at least 10 years ago. He was wearing a shiny green suit and his usual platform shoes. Made my day.\n\nThe hardest working man in show business.\n\nThe Godfather of Soul.\n\n"
    },
    {
      "time": "26 Dec 2006 — 2:01pm",
      "content": "Have any of you seen a video of the T.A.M.I. Show, ca. 1964? An eclectic assortment of pop stars including James Brown at his VERY BEST!!!! J.B. made Mick and the others seem like silly children! Well worth the effort to find a copy of this video!  \nDB~\n\n"
    },
    {
      "time": "26 Dec 2006 — 3:00pm",
      "content": "A Turkish friend now at Pordue reminded me Ahmet Ertegun's death as well, I post it with pleasure : [http://en.wikipedia.org/wiki/Ahmet\\_Ertegun](http://web.archive.org/web/20120627030411/http:/en.wikipedia.org/wiki/Ahmet_Ertegun \"http://en.wikipedia.org/wiki/Ahmet\\_Ertegun\")\n\n"
    },
    {
      "time": "26 Dec 2006 — 5:16pm",
      "content": "James Brown stands equal with other masters of Rhythm like Bach and Mozart et al! He was a refined force of rhythmic genius and well understood music's techniques such as syncopation.\n\nAnd from his pulpit of Funk/Soul he preached the gospel of Life, life as a black man in America, for America itself, and spoke for us all with songs like 'I got You', 'How do you stop', 'It's a man's man's man's world', 'I know you got Soul', etc., etc...  \nI think he will be viewed as one of the most influential men in American history - black, white or whatever.\n\nAnd man, am I ever going to miss him.\n\n\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "27 Dec 2006 — 8:06am",
      "content": " ![](http://web.archive.org/web/20120627030411im_/http:/typophile.com/files/JBgetup_5054.jpg)\n\nChrisL\n\n"
    },
    {
      "time": "27 Dec 2006 — 10:38am",
      "content": "The universe remains in balance:  \nJames Brown dies.  \nThe anti-James Brown, Gerald Ford dies.\n\nDB~\n\n"
    },
    {
      "time": "27 Dec 2006 — 2:07pm",
      "content": "What perfect rhythm he must have displayed when beating his wife...\n\n"
    },
    {
      "time": "27 Dec 2006 — 7:07pm",
      "content": "I agree. Let's not get carried away with his great character - great music yes, a shining example no…\n\npeace\n\n"
    },
    {
      "time": "27 Dec 2006 — 8:00pm",
      "content": "It will be interesting to see all the pomp they trot out for ex-prez Ford. Never elected, never respected, the only thing he did of note was to pardon Nixon. And to live a long time. His wife actually has made more of an impact.\n\n"
    },
    {
      "time": "27 Dec 2006 — 8:01pm",
      "content": "\\>I agree. Let’s not get carried away with his great character - great music yes, a shining example no…\n\nOf course the same could be said for Gill, Griffo and other people from the world of type...\n\n"
    },
    {
      "time": "28 Dec 2006 — 12:54am",
      "content": "The Vietnam War ended during Gerald Ford's watch. For that alone I will always respect him.\n\npeace\n\n"
    },
    {
      "time": "28 Dec 2006 — 8:16am",
      "content": "Paul -- The Vietnam War ended under Richard Nixon's watch. He was the president that called our troops home. I can remember the day clearly - I was a college student -- and was working in a restaurant at nights. The group of us at the restaurant and told the ceiling to let Johnson know the war he escalated was now over.\n\nGerald Ford was not a great leader - he was a good follower. At the time he was appointed President, I know personally, I was very upset. He was the first president we ever had that was not elected by the people. I felt this country should of had a special election -- but you know, it never really matters the political machine continues to churn.\n\nAs for James Brown. thank you Chris and Paul. He may have been loved by many for his music and his innovations in the music world - but not an example to show our children -- unless of course you want to show his time served in South Carolina to them - and let them know there is still hope after jail.\n\nSorry to sound so cynical this morning -- just we tend to honor many of the wrong people. Our children are in need of heroes and good-doers. We give them glitz and show them a way of life they will probably never have. I think I prefer living with people who have their dreams, but keep their feet on the ground.\n\n"
    },
    {
      "time": "28 Dec 2006 — 8:32am",
      "content": "Ford told NY to Drop Dead. For that alone I will always reject him.\n\n"
    },
    {
      "time": "28 Dec 2006 — 9:41am",
      "content": "\"Hero worship, in anyone save a child, is indissolubly linked to its obverse, which is despisal. Admiration, however, is a different, less morally questionable quality. Admiration is not born of sentimental irreason. It is occasioned by achievements rather than personality, by the work rather than the man. Demagogues depend upon the human capacity to be incited to adulation. Artists don’t.\"\n\n[Jonathan Meades](http://web.archive.org/web/20120627030411/http:/en.wikipedia.org/wiki/Jonathan_Meades) wrote this.\n\nThanks Chris for raising the issues of JB's backstage achievements, so to speak.\n\n"
    },
    {
      "time": "28 Dec 2006 — 9:49am",
      "content": "\\>Our children are in need of heroes and good-doers. We give them glitz\n\nYou don't have to give them glitz. If you give them your own example of being an honest, caring and responsible human being, you have a very good shot at counteracting the shallow and destructive messages in the popular culture. Parents are by far the most powerful influence on children--even though we have a lot of competition these days.\n\n"
    },
    {
      "time": "28 Dec 2006 — 10:34am",
      "content": "My lottery number for the draft was #2 so I was pretty interested in the Vietnam War.\n\nMy memory ranks a bit lower than that I suppose. Not surprising considering what I was up to in the early 70s. :)\n\nDidn't the draft end under President Ford or was it just before he took office? I know it was 1973 because that was going to be my year - to do whatever it took to get out of it…\n\npeace\n\n"
    },
    {
      "time": "28 Dec 2006 — 10:59am",
      "content": "Can you imagine what the Pollyanna/revisionists will say some day when George W.Bush dies?!?! God.... I hope I'm long gone before this happens!  \nDB~\n\n"
    },
    {
      "time": "28 Dec 2006 — 12:50pm",
      "content": "The draft ended in 1973.\n\nNixon resigned August 8, 1974. - That was also a summer I spent in London and realized that their newspapers and televisions were censored... they never heard the entire speech Nixon made live to the American public. Favorite comment that day was from an Englishman who looked me in the face and said, \"American has just hit puberty.\"\n\nAnd DaKine - I'm with you - I'm scared how these folks would rewrite it all - especially since we were there to experience it. (Is this like Iran not believing the holocaust took place?)\n\nAnd Patty - I'll hate Mayor Beame way before I'd take it out on Ford. Beame had been controller for the city and knew where all the money was. When he took office he decided we need a tax upping - I think we went from the 6 or 7 right to 8% (the .25 was added a year or so later) no vote on the matter - no going over the books to see if the city needed to do this -- and when it was done, he very nicely announced to the papers he found several \"city bank accounts\" and we didn't need the sales tax hike, but (and with a broad smile) said he was keeping it in place anyway... Our whole Federal government at that point told us to bug off...\n\n"
    },
    {
      "time": "28 Dec 2006 — 2:53pm",
      "content": "\\>”As for James Brown. thank you Chris ...  \nOur children are in need of heroes and good-doers. “\n\nSometimes someone can be a “good-doer” without even knowing it. I owe a special gratitude to James Brown, Little Richard, Aretha Franklin, Wilson Pickett and Tina Turner. My son is autistic and did not speak or understand language or even respond to his name until he was 4 years old. Part of the reason for his breakthrough to communication was his response to R&B music, mostly James Brown. While I was playing some of my old R&B recordings, I noticed that Michael was responding with body movement in sync with the music. His first attempts at speech were mouthing sounds in response to James Brown’s music. We found videos of JBs performances and showed Michael. This even made the effect stronger. A rare smile came to his face. In time, he was imitating both sound and movement. Eventually, he learned the complete “I feel Good” cut and it became part of the launch-pad for speech. Today he has full speech and understanding (to the point where he never stops talking).  \nI am sure James Brown did nothing on purpose to help Michael but, never-the-less, he has. Call me a Pollyanna/revisionist if you like but I can’t ever forget that moment when Michael first said “I feel good”.\n\nChrisL\n\n"
    },
    {
      "time": "28 Dec 2006 — 3:14pm",
      "content": "Thank you ChrisL for sharing this. Nice to for me to put one positive mark next to the man...\n\n"
    },
    {
      "time": "28 Dec 2006 — 3:40pm",
      "content": "Beautiful\n\nThanks, Chris\n\n"
    },
    {
      "time": "28 Dec 2006 — 6:57pm",
      "content": "The typo link, from...\n\n[http://www.guardian.co.uk/worldlatest/story/0,,-6305251,00.html](http://web.archive.org/web/20120627030411/http:/www.guardian.co.uk/worldlatest/story/0,,-6305251,00.html \"http://www.guardian.co.uk/worldlatest/story/0,,-6305251,00.html\")\n\n\"Brown, who lived in Beech Island, S.C., near the Georgia line, won a Grammy **font** in 1992,\"\n\n?\n\n"
    },
    {
      "time": "28 Dec 2006 — 7:12pm",
      "content": "Isn't there a James Brown font? :-)\n\nThanks for the story, Chris. Every hero is like duct tape: they have a dark side and a light side, and they hold our universe together.\n\nSo Patty, did you head up to the Apollo?\n\n"
    },
    {
      "time": "28 Dec 2006 — 9:02pm",
      "content": "Nah, I didn't go to the Apollo. I hate crowds. I did go to Central Park for the John Lennon memorial back in 1980 and remember that after the moment of silence they played Imagine and a light snow started to fall.\n\nDennis: I hope you are alive when George W Bush dies. In fact I hope he gets struck by lightning one day after he leaves office, just so Cheney can't ascend to the throne.\n\nChris - that is a great story. I have a friend with a mildly autistic son who responded as a little boy to Neil Young. Turns out Neil Young has an autistic son too... but we didn't know that at the time.\n\nAnd Jackie - yeah Beame was a weenie. But frankly I wish we could go back to the dark days of NY in the 70s when artists could afford to live in Manhattan and life was interesting. I can't stand the overpriced overhyped Disneyland that this city has become and the current mayor (who IS a republican) just wants to build more and more big buildings. Is that progress? I'm not sure.\n\n"
    },
    {
      "time": "28 Dec 2006 — 10:26pm",
      "content": "Wow Chris, you blow me away man - such a love!!\n\nTo all the sunday christians out there and in here... James Brown personally carried millions of Americans to a fresh clean bold place - a place of 'self' worth with his verse, \"Say It Loud - I'm Black and I'm Proud\", and in '68 racist America this was huge - and always will be.\n\nHey Mr. Sunday Christian, (Chris G., Heron 2001 et al.), how much have you contributed to raising up your oppressed? Tell me what you've done! I'm right here - waiting...\n\nRaw talent is never pretty, never will be. Furthermore Mr. Sunday Christian, it doesn't need your permission/approval to raise up the human spirit!\n\nStick to judging yourself Mr. Sunday Christian and leave it at that, you're not qualified to go any further.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "29 Dec 2006 — 4:35am",
      "content": "Hiroshige,\n\nI lived through and protested with the best of them to help shape this country. So please, get off your soapbox.\n\nI spent most of my adulthood helping people on a one-to-one. In the art world in NYC, I watched many talented designers lose their jobs because of Mac computers. I was the only typeshop that would take them in -- give them a 6 mos course (and buy them lunches almost everyday, etc.) and teach them the Mac. It became a joke around publishing, come to me and six months later -- you became an art director. I also watched many of these people spit on the rest of the world when they got there - so I didn't exactly feel like my job was complete.\n\nOh, yes, I owned a typeshop in New York and was the second one in NYC to put in MACs and proudly the first one that was actually producing work on it... (And again, helping another typeshop's workers try to keep their jobs - when MKP sold out to Harris -- MKP's workers were given 6 months to learn the Mac -- several of their day workers would come over to my shop to try and learn - but their hearts weren't in it. I remember one guy saw my old typositor and just wanted to come and set typositor words for me...)\n\nI have taken in strays (and I'm not talking animals) and made them feel human again and got them on their way into the world. And yes, some of them I am so very proud of. I'd love to give you one of the people I helped. He was a New Yorker who came back to NY as a homeless person. I took him in and well, made him feel like a human being. (BTW - a wonderful artist who have had many shows on the West coast.) He was able to get his act back together and well, I am really proud of him. He does his artwork at night, took a regular day job -- owns his own home.\n\nI did not grow up to be a \"tushy-washer\" but it is what I seem to have become. I now take care of a 90 year old woman and do my best to make her want to get out of bed and live everyday. Last week was extremely rough for me - it was the 26th anniversary of my own mother's death -- and here was Helen (the 90-year old) about to die that day. I couldn't let her. If you are interested she is doing much better this week -- but seems to have lost her short-term memory -- and wants to keep putting the stove on.\n\nI have no trumpets to blow and couldn't care less about most people's attitudes. (That tend to happen when you get older and no longer seek parental approval.) I just try to make the world a little bit better and believe in treating humans nicely. I've never faltered from my original learnings - and I've passed them on to others.\n\nI've been lucky in my life. There has always been a connection to people in the world for me. I've always had my own \"network\" even before the age of computers. That network extended to many cities throughout the world. Amazing, you have reminded me that when I had my own apartment in NY and was by myself -- I was never alone.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\n\nPatty,\n\nLife in Manhattan was always wonderful. I was born there, grew up there -- studied there. The 70s were great. Hiroshiga writes about the radical blacks of the '60s. I have to laugh - hey, I was in NY. We even protested against the New York Times in 1969 begging them to stop typesetting \"Negros\" and use the word Black. It was quite an achievement when they finally did. And NYC those years -- let's face it -- the hippy way of life was winning out and everyone was spreading the joys of love.\n\nI haven't lived in NY since February 14, 1999. I was happy I wasn't there for 9-11. I have watched many good friends of mine pass away -- and the city isn't the same for me. I returned two October's ago for my dearest friend's Irish Wake -- I was amazed at what I saw. Manhattan is a youngster's paradise. No senior citizens out there... I don't know how everyone affords to live there -the apartments are way over priced. (My friend's apartment cost him $37,000 in 1986 and today is worth $550,000.) I gave up a large (850 sq ft) one bedroom apartment that cost me - now don't cry -- $1000 per month in 1999. Located in what use to be the heart of the typesetting industry - 46th & 2nd.\n\nWell, thank you for letting me write this out during my peace time - before Helen arises...\n\nJackie\n\nP.S. So Hiroshige -- in the strands of life - who are you?\n\n"
    },
    {
      "time": "29 Dec 2006 — 6:14am",
      "content": "Back off topic… we also lost Wilson Picket this year, another great.\n\n"
    },
    {
      "time": "29 Dec 2006 — 7:02am",
      "content": "And we've lost so many more - and good ones too!\n\nI don't know if you are aware of\n\n[http://www.deadoraliveinfo.com](http://web.archive.org/web/20120627030411/http:/www.deadoraliveinfo.com/ \"http://www.deadoraliveinfo.com\")\n\nbut it is one of my favorite sites and I thought I'd share it with you, if you were not already familiar with it.\n\n"
    },
    {
      "time": "29 Dec 2006 — 6:12pm",
      "content": "And Lou Rawls.\n\n(And for us feminists, Betty Friedan.)\n\n"
    },
    {
      "time": "30 Dec 2006 — 7:34am",
      "content": "Hiroshige,\n\n<cite>Hey Mr. Sunday Christian, (Chris G., Heron 2001 et al.), how much have you contributed to raising up your oppressed? Tell me what you’ve done! I’m right here - waiting…<br>\nRaw talent is never pretty, never will be. Furthermore Mr. Sunday Christian, it doesn’t need your permission/approval to raise up the human spirit!</cite>\n\nYou've completely failed to recognise that I cast no doubt on the positive effects of the man's work, nor did I imply that raising the human spirit is dependent on my permission...\n\nYou are under the misaprehension that beating his wife can be safely overlooked because he did good things as well as bad, which is ridiculous. Whether the good deeds outweigh the bad does not change the fact that the bad deeds remain just that - bad.\n\nTo cast doubt on the validity of mine or others opinions based on how we've 'raised up our oppressed' is fallacious. By your reasoning a customer in a restaurant would be wrong in complaining about a bad meal simply because he is not a chef.\n\nHold the late Mr Brown in as much esteem as you wish, but don't get on your high horse when people present you with facts you don't want to acknowledge.\n\n"
    },
    {
      "time": "30 Dec 2006 — 11:37pm",
      "content": "Alessandro Segalini, yesterday, you said Time is god.  \nToday, you say Music is god.  \nNo wonder, some say Between Thighs!\n\n\\> Is this like Iran not believing the holocaust took place?  \nHeron2001, From where you got this bit of Information?  \nAre you prepared/allowed to discuss/investigate the Facts and Figures of Holocaust?  \nYou will find how faithful I am to Chris G's words:  \n\"but don’t get on your high horse when people present you with facts you don’t want to acknowledge.\"  \nAnd I also hope you will be at your words:  \n\\> I’ve never faltered from my original learnings - and I’ve passed them on to others.\n\n\\> In fact I hope he gets struck by lightning one day after he leaves office,  \n\\> just so Cheney can’t ascend to the throne.\n\nThat's against God's never-changing Wont:  \nArrogants taste Gradual Degradation in the present world  \nand (if you believe) a mighty chastisement in the world to come.  \nSaddam's end is just up-to-date lesson.\n\n"
    },
    {
      "time": "31 Dec 2006 — 5:46am",
      "content": "Dear AzizMostafa,\n\nSo many forget that 17 million persons perished in concentration camps. I was delighed recently when 60 Minutes did a segment on a WWII archive in Germany that is finally being allowed to be viewed by the general public. It has the complete records of all the concentration camps and all the lists the German's had insisted upon from the Ghettos. That is proof enough that the Holocaust happened.\n\nMeanwhile, you ask me about Iran. I received an email blast that originated from the Simon Weisenthal Center. I have found their information accurate.\n\nYou may view this article at  \n [http://www.wiesenthal.com/site/apps/nl/content2.asp?c=fwLYKnN8LzH&b=2454...](http://web.archive.org/web/20120627030411/http:/www.wiesenthal.com/site/apps/nl/content2.asp?c=fwLYKnN8LzH&b=245494&ct=3292771 \"http://www.wiesenthal.com/site/apps/nl/content2.asp?c=fwLYKnN8LzH&b=245494&ct=3292771\")  \nand decide for yourself.\n\nI studied European History from 1805-1945 for my BA in History. I tend to find these type of facts, and honestly, I am happy I do. I was very sad when in past years I visited Europe and found that the youth were not taught full history. In Austria, many facts have been covered up. One of my internet buddies was looking out at what he called the \"Blue Danube\" -- I wrote back and told him he meant the \"Red Danube\" - after explaining about the people who were forced into the Danube to drown and be shot out - his first reaction was he was tired of the propaganda -- I sent him to a site that had photos of a monument dedicated to all those who lost their lives by being killed in the Danube...\n\nWell, like I keep trying to say. I cannot change the world - but I do try to help one human at a time... Those who have helped me in my life always told me I was to pass it on. I've tried to live up to their expectations.\n\nP.S. Where have you been - just to a google or yahoo search for Iran denies the Holocaust - and have fun reading.  \n [http://search.yahoo.com/search?ei=utf-8&fr=slv8-msgr&p=iran%20denies%20h...](http://web.archive.org/web/20120627030411/http:/search.yahoo.com/search?ei=utf-8&fr=slv8-msgr&p=iran%20denies%20holocaust \"http://search.yahoo.com/search?ei=utf-8&fr=slv8-msgr&p=iran%20denies%20holocaust\")  \n [http://www.google.com/search?hl=en&q=iran+denies+the+holocaust](http://web.archive.org/web/20120627030411/http:/www.google.com/search?hl=en&q=iran+denies+the+holocaust \"http://www.google.com/search?hl=en&q=iran+denies+the+holocaust\")\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nTo all typophiles - I am sorry we have strayed so off topic -- but I wish each of you a Happy and Prosperous New Year.\n\n"
    },
    {
      "time": "31 Dec 2006 — 6:53am",
      "content": "\\>Are you prepared/allowed to discuss/investigate the Facts and Figures of Holocaust?\n\nI am allowed, I am prepared, and I know.\n\nThe holocaust is one of the best documented periods in history, and many survivors are still alive now to testify, and have done so and are still telling their stories. And there are 50,000 on film, thanks to Spielberg's project.\n\nIf you are interested you can see a few brief clips of personal testimony [here](http://web.archive.org/web/20120627030411/http:/en.wikipedia.org/wiki/USC_Shoah_Foundation_Institute_for_Visual_History_and_Education).\n\nYou have to understand that this is not past history because many people alive today remember it all too well.\n\nIf you are interested I can add a lot more. But you should understand that holocaust denial is simply a cynical and dishonest attempt to further a murderous political agenda. It has nothing at all to do with the search for truth, or acceptance of obvious historical truths.\n\nIf someone started a campaign to say that Saddam Hussein never existed, it would have as much credibility to you as holocaust denial does to me. You just know better, and so do I.\n\n"
    },
    {
      "time": "31 Dec 2006 — 7:43am",
      "content": "Hear hear William.\n\nHey happy new year everybody and what say we steer clear of anything controversial for the rest of the year?\n\n"
    },
    {
      "time": "31 Dec 2006 — 9:25am",
      "content": "Dear Friends, William Berkson and Heron2001\n\nThanks for the Info+Links!\n\n1. Do you agree that If someone wants to prove something against someone else, he/she has to refer to a link controlled by the accused for complete+accurate information?! Otherwise means otherwise?!  \nFor example, to get the full story, I have to dig out of this site:  \n [http://www.holocaustchronicle.org/](http://web.archive.org/web/20120627030411/http:/www.holocaustchronicle.org/ \"http://www.holocaustchronicle.org/\")\n\nSo, any pointer to any Official Iranian (not anti-Iranian) Site that denies the Holocaustchronicle?\n\n2. Since The holocaust is one of the best documented periods in history, I beg you to make sure of the accuracy of Facts+Figures you supply before replying. For example, if you say 50,000 were killed somewhere, then you can multiply that number or divide it by 2, not more?\n\nAll the Best with Flowers\n\n"
    },
    {
      "time": "31 Dec 2006 — 10:41am",
      "content": "Aziz, you should understand that Holocaust denial has nothing to do with truth or plausiblity. It is just those who are willing to engage in the 'big lie' to further their political goals.\n\nAhmadinejad has figured out that it is more plausible to say that 'there are two sides' to the argument over whether the holocaust happened, than to say it is a 'myth', as he originally did. But there are not two sides, any more than there are 'two sides' to an argument over whether Saddam Hussein ever existed. This 'two sides' stuff is just a more plausible version of a 'big lie' that is designed to serve a political agenda, an agenda of de-legitimizing and destroying Israel.\n\n\\>Do you agree that If someone wants to prove something against someone else, he/she has to refer to a link controlled by the accused for complete+accurate information?!\n\nI don't understand what you mean by 'accused'. Who is being accused, and by whom? And the link I gave is of a sample of personal testimony of people about their own lives. It is not a second-hand historical account.\n\nThose who were involved in the events on both sides, both Germans and Jews, agree on the history. The fact of the holocaust and the scale of it is not a matter of serious controversy in Europe, which is where it happened.\n\n\\>I beg you to make sure of the accuracy of Facts+Figures you supply before replying.\n\nWhat was inaccurate in what I said?\n\n\\>For example, if you say 50,000 were killed somewhere, then you can multiply that number or divide it by 2, not more?\n\nWhat are you talking about? I never said anything about numbers killed. I said that 50,000 survivors have told their stories on film. I didn't multiply anything by 2.\n\nThe bottom line is that almost everyone who actually has studied the history and talked to the people involved agrees on the reality of the holocaust, and the general scale of it.\n\nThe site you link to, so far as I can see skimming it quickly, gives a normal history of the holocaust. There are thousands of other similar histories many much more extensive.\n\n"
    }
  ]
}
