{
  "id": "30200",
  "title": "Coming to a store near you—instant book printing",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[CNN is reporting that on-demand book printing machines will be turning up in stores next year](http://web.archive.org/web/20110102155639/http:/money.cnn.com/magazines/fsb/fsb_archive/2006/12/01/8395114/index.htm?postversion=2006121409), and will be able to reprint books with no/expired copyrights in Google books and the Open Copyright Alliance.\n\nI'm pretty excited about this—think about all the classic, impossible-to-find type/bookmaking tomes that we'll be able to just order up and start reading!\n\n",
  "author": "<a href=\"/web/20110102155639/http://typophile.com/user/14722\" title=\"View user profile.\">Dunwich Type</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": "",
      "content": "Thanks James, more online readings on the preservation and persistence of the changing book at _reports_ at : [http://www.futureofthebook.com](http://web.archive.org/web/20110102155639/http:/www.futureofthebook.com/ \"http://www.futureofthebook.com\")\n\n"
    },
    {
      "time": "",
      "content": "I am excited about this idea for 15 years now and hope much that it will be a success.\n\nIt will turn into a really big thing if copyrighted books were made available that way, say scientific literature, and royalties instantly forwarded to publisher/author with each order.\n\nAlso, I am curious what a copy will look like! (Quality of printing and binding.) Or, in which data format books are provided -- as static layouts (PDF, scans), or can the purchaser select a different typeface, type size, margins? I think this technology will make it more clear that there needs to be a document format which serves both the screen and print -- i.e. as flexible as html (new text flow according to window size, or paper size) and typographically as sophisticated as PDF. The document would be the same, regardless of being presented on a small or big screen, or printed. But I bet this will remain a dream for the next 15 years to come.&nbsp;&nbsp;:)\n\n"
    },
    {
      "time": "",
      "content": "<cite>I am excited about this idea for 15 years now and hope much that it will be a success.</cite>\n\nI've been sharing your sentiments, albeit not for 15 years ;)\n\nI've also thought about future document formats and automated typesetting. It seems that with some (relatively) simple rules and limits; ie. a range of DIN page sizes, font size limits, and tagging words to prevent hyphenation, it won't be hard to pull this off. It's the sort of thing I think we can expect to come from Adobe over the next decade as Adobe enhances Flash and Flash replaces XHTML as the standard for web design. I expect that eventually Adobe will merge XML/XHTML, CSS, Flash, and PDF into some new uber-format. Maybe it's a bit much to expect this from Adobe, especially with Warnock and the other PARC guys on their way out the door, but the addition of new blood from Macromedia might light a fire under the collective butt over at Adobe HQ.\n\nHow cool would it be if we see a Google/Adobe merger, and get software that allows us to design for every format under the sun, and has instant access to nearly every piece of content in the universe? I'm really taking this offtopic fast...\n\n"
    },
    {
      "time": "",
      "content": "[&nbsp;&nbsp;(this is <cite>really</cite> off topic now, so I put it into brackets)\n\nOh please, no Flash stuff ...\n\n<cite>Maybe it’s a bit much to expect this from Adobe, especially with Warnock and the other PARC guys on their way out the door</cite>\n\nMaybe it would have been too much even with Mr Warnock on board.  \nIt is sad enough that advanced use of most applications requires expert users. I wonder where the InDesign is which allows merging design and content without much scripting abilities, by way of an interface which visualizes what is going on, so even designers who are afraid of anything technical want to use it. Take alone because it saves them time they need to populate, say, a voluminous book with texts and images. Design is highly conceptual (books, websites, both regarded as interfaces to what they convey), and this should be -- but is not -- reflected in the design tools. I don't ask for adding stuff on top of already huge apps; but for re-thinking the underlying conception, structure, and the interface which reflects them. (I used InDesign as an example since I work with it most of the time, but could have chosen any other application.)\n\n]\n\n"
    },
    {
      "time": "",
      "content": "Further evidence that I'm turning into an old grouch: there seems little or nothing positive about the \"potential\" for POD printing, and while others here have voiced a certain excited anticipation at the prospect, personally it finds me with a sense of impending doom. While the technology has, indeed, improved in the last few years, with POD we're talking toner, not ink, and even with the latest machines, simulated linescreen of any resolution still looks like a bunch of sloppy dots. Add to this the fact that any decent print requires super-smooth stock, yet most POD printers throw in the cheapest paper they can find, wrapped up with cheap glue in a poorly scored cover and physically the fate of the short-run book looks bleaker and bleaker.\n\nAdd to this the discussion above about on-the-fly font changes and now I'm feeling really queasy. Given the considerable time and skill required to flow a text smoothly, to balance the content and find the appropriate typographic voice, to carefully fit awkward line/word wraps, widows & orphans, images & captions, tables, etc., the thought of randomly picking a font and forcing it through a template to spit out a poorly printed, poorly bound, badly typeset bundle of cheap paper doesn't seem to me to present much to be excited about.\n\nToo many books are already designed and set by in-house staff who don't know anything about typography and don't have a clue how to utilize a decent page-layout application, who then hand the file off to an ever-growing print emporium that gives less and less attention to the product they're pumping out. And this will somehow be improved by trusting a glorified photocopier to typeset AND make the book?\n\nWhile the digitization of information is one thing (allowing access to 500 year old texts at the click of a button), I certainly wouldn't fool myself into thinking that a POD copy of such a thing is in any way a copy of that text; it would be, in fact, a shallow and lifeless clone. If what I want is to read a rare text, great, give me the text in a relatively neutral PDF, but please don't demean the thing by shoving it through a cookie-cutter and calling it a book.\n\n"
    },
    {
      "time": "",
      "content": "Jason, although I agree with much of what you are saying, I think there are examples of high production values in POD, just as there have been high and low values in traditional printing, typesetting, etc.\n\nMy first adventure with POD occurred last year. In 2004-2005 I developed a highly visual book with two authors who wanted to find the right publisher, but who did not want to submit a manuscript and a bunch of prints. They preferred to put the book into full design first and then shop that around to the publishers, because they felt it was the only way to ensure that their ideas would be properly understood. It is a complex subject, about the relationship between the built environment and our needs as humans. Authors are an architect and a psychiatric social worker. ( [http://www.amazon.com/People-Places-Connections-between-Landscape/dp/193...](http://web.archive.org/web/20110102155639/http:/www.amazon.com/People-Places-Connections-between-Landscape/dp/1931807450 \"http://www.amazon.com/People-Places-Connections-between-Landscape/dp/1931807450\"))\n\nThe solution was to design the book, and have 25 copies run off for them to send to prospective publishers. I had Acme Bookbinding (just outside Boston) do the work and although it was not as good as the final printed edition, it completely captured the feeling of the design. Syntax Antiqua type reproduced well and had the proper color. Photos were not super-sharp, but all the detail in them was perceptible and color balance quite good. The book was printed on Monadnock Astrolite alkaline pH uncoated paper, 100-lb basis, and all 25 copies were Smyth-sewn and bound in the same cloth that we would later use in the normal offset-printed edition. Jackets were also produced digitally and overlaminated. The result was very close in spirit to the final edition.\n\nSo I am not disagreeing with you on much of what you say, but I think in the hands of a designer who is willing to push hard for quality, and with staff and equipment who are dedicated to doing a really fine job, a lot is possible. (Acme's main work is very high quality edition binding, so their standards are already high.)\n\nIn a shop such as Staples or W. H. Smith's, it'll be an entirely different matter.\n\n"
    },
    {
      "time": "",
      "content": "[Friends of Don at LuLu.com](http://web.archive.org/web/20110102155639/http:/www.lulu.com/content/333763)\n\nI printed this photography book last year POD with LuLu.com and it came out awesome. At least, as awesome as a self published photography book with no up front costs can look. We ran a few test books just to tweak the photos, but in the end it came out great.\n\nAn amazing service for students. I plan on designing a ton of books to print, just to beef up my portfolio.\n\nIf anyone needs a cheap, nice portfolio, POD is the way to go.\n\n<cite>It seems that with some (relatively) simple rules and limits; ie. a range of DIN page sizes, font size limits, and tagging words to prevent hyphenation, it won’t be hard to pull this off.</cite>\n\nIt's even better than that. There are size limits and bleeds and stuff, but basically you just give them a .PDF of whatever you want printed. You can give them a .DOC file, but they convert it into .PDF on their end anyway. As long as there are no technical problems with your file it should print exactly the way you want it to, warts and all.\n\n"
    },
    {
      "time": "",
      "content": "How fast is LuLu.com? My only project for the holidays is to make a book from last semester's process and assignments, and since the teacher and I don't get along especially well, it might be fun to turn it in as a hardbound book.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for your insights and technical details, I feel pretty much to second Jason Dewinetz (I remember I did read some of the concernings about paper & binding also on the site I posted above, that is why I posted). Also, if we like high standards and we wish a lot to be possible for POD, with my understanding of politic, that sounds like it ought to be a monopoly capitalism —— not really tech-illuminism (I apologize for this \"neologism\" if it itches). I wonder what would be the smell of books in the future, or if interior designers will use them.\n\n"
    },
    {
      "time": "",
      "content": "Jason is far too optimistic and charitable in his posted outlook on POD. Perhaps it's because he's limited himself to just a few of its shortcomings.\n\n"
    },
    {
      "time": "",
      "content": "<cite>How fast is LuLu.com?</cite>  \nLess than two weeks? If I remember correctly. Altogether with the test proofs and revisions it took less than 6 weeks from scratch. Not bad at all.\n\nWe didn't do hardcover, so that's next on my list.\n\n"
    },
    {
      "time": "",
      "content": "Jeff, indeed, only a few as there's certainly no time or space to venture into the rationale behind real ink pressed into good paper, let alone the pointless argument for skill, convention & principle.\n\nNice to see another BC voice around these parts.\n\n"
    },
    {
      "time": "",
      "content": "Jason, do you really read my post as advocating low quality? To the contrary, my aim is to increase quality in a segment that normally produces crap.\n\n(a) What is html/css today? A document format that lacks any typographic quality. Yet html is used to provide long texts that require to be printed before reading. If I ask for a document format allowing for flexible typography, this implies that this document format (and/or the reader software) has some built-in \"typographic knowledge\", so it does care for widows, orphans, images, captions &c. What Tschichold calls \"good typography\", or many of the things you have learned from Mr Bringhurst's book, can be automated. Sorry that this didn't become clear in my earlier post.\n\n(b) It is a misreading if you think that from now on <cite>all</cite> books are to be produced that way.  \nIf you ever digged into scientific literature, down to dissertations, you many know that this is a huge segment where quality never really mattered: For both lack of typographic knowledge and finances, authors \"typeset\" books by themselves -- earlier on a typewriter which then was scaled down and reproduced, now in Word, neither margins nor leading and wrapped into a cover designed by the editor-professor's assistant or, yes, a printer's inhouse-staff. Reading that is pain.\n\n(c) If you lament about possibly missing printing quality, well, have a look into many paperbacks today which seem to be reproductions of reproductions of reproductions of ...\n\n<cite>If what I want is to read a rare text, great, give me the text in a relatively neutral PDF, but please don’t demean the thing by shoving it through a cookie-cutter and calling it a book.</cite>\n\n(d) If you ask for mere access to <cite>texts</cite>, then POD is neither better nor worse than a \"neutral PDF\" printed out at home. If you want a high quality reproduction to get a spirit of the original, then neither POD or your printer is a solution, and the high quality reproduction -- still a reproduction -- may cost you a fortune.\n\n(e) One should not mix up the idea of printing (books) on demand, the particular service of On Demand Books or technology they use, and the quality that <cite>could</cite> be achieved (please test the Kodak NexPress 2100 which even prints on rough papers, with offset-like matt printing of colors). As to Google's monopoly, I would feel more comfortable had all the university-based attempts at creating digital libraries been successful. Since universities are the institutions to produce and keep knowledge, it would have been their damned job. But then, in future they'll buy not only the e-learning platforms but also the content, I-don't-want-to-know-where.\n\nSo, printing books on demand is a solution for a special segment. I hope nobody considers printing fine or illustrated books that way. Neither will bestseller paperbacks be printed that way -- too slow, too expensive.\n\n(Yes, the smell of the book is important, but honestly, I am more interested in the <cite>text</cite>. If the typographic representation assists me with this and maybe pleases my eyes, I'm a happy man.)\n\n"
    },
    {
      "time": "",
      "content": "Well, not that I can/want to smell all I need/like to read —— good point mentioning that _special segment_, I am saying the text should be treated as UI, not content.\n\n"
    },
    {
      "time": "",
      "content": "<cite>I am saying the text should be treated as UI, not content.</cite>\n\nI agree.\n\n"
    },
    {
      "time": "",
      "content": "Karsten, I actually woke this morning feeling somewhat hypocritical and arrogant, determined to pop open Typophile to say that I am also often forced to rely on digital printing, due both to finances and short-run projects; I suppose my grouching here is more about aspiration. For years now I've produced very limited-edition chapbooks of poetry by Canadian writers, and from the first my intention has been to build well designed books by relatively unknown poets in a format and at a price that anyone can afford: it always seemed somewhat pointless to expect a reader to shell out a bunch of money for a handful of poems by someone they've never heard of. The idea was to make the book a sort of introduction for the reader & writer, and if that invitation could include the dignity of decent typography & book design, that has been my goal. However, as I don't own a press myself, and offset printing of 100 copies is impossible (ie: cost), I've tended to print the pages myself with a high-resolution laser printer, and the covers printed ink-jet on alum-treated paper to secure the colour. All of this has been a source of considerable irritation for me, because what I would like to be doing is printing these books by hand, with metal or polymer. Alas, for the time being that's not a possibility, so I have had to settle for what seems to me to be a sad compromise.\n\nThus, I don't mean to say digital printing has no place, just that it is, to my mind, a bitter yet often necessary evil. The real problem, and here's the part that concerns me, is that it is beginning to be seen not as a necessary evil, but a reasonable and, more, acceptible substitute for \"the real thing.\" The fact that I am running in to more and more freelance clients who are considering this option for edition printing is what worries me.\n\nAs for myself, much of what I'm doing now involves a compromise I'm uncomfortable with, but the goal is that this work will contribute to the plan of setting up a press so that I can some day (hopefully soon) be able to produce books that honestly deserve their name.\n\nps. Karsten, thanks for your off-list email & the doc you sent. I'll have a look & respond soon.\n\n"
    },
    {
      "time": "",
      "content": "What was it Tschichold said?\n\n'Standardization, not individualization.  \nCheap books instead of fine press editions.  \nActive literature, instead of passive leather bindings.'\n\nDon't get me wrong, the bibliophile in me will NEVER stop marveling and collecting fine printing.\n\nI've been following this area for the past couple years now (having ordered examples from a number of printers), and I've been meaning to take advantage of it for quite some time. I don't intend for the projects I have in mind (all personal) to imitate fine press or conventionally offset books. A lot of Jason's gripes, I agree with. Instead, I'd like to take advantage of the roughness of the medium, in much the same way that photocopied zines hit the scene a couple years ago.\n\nI've ordered a number of POD books, and they generally look like sh-t because they're obviously not designed by someone armed with book skills, or more often than not, the pages are simply reprinted scanned reproductions of the original pages. I understand the importance of democarcy of literature, butlet's ensure that the medium is as flavorful as the content.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThe major problem against POD and publishingall those wonderful outof print and obsucre books is copyright issues, especially the risky situation of accidentally infringing on an existing work without knowing it.\n\nThe following is from a website whose author is dealing with his own copyright battles with POD publisher Kessinger.\n\n[http://new.businesscommonsense.com/enews/fullStory.bsp?sid=32029&var=story](http://web.archive.org/web/20110102155639/http:/new.businesscommonsense.com/enews/fullStory.bsp?sid=32029&var=story \"http://new.businesscommonsense.com/enews/fullStory.bsp?sid=32029&var=story\")\n\nApril 9, 2006, Financial Times, Patti Waldmeier wrote an article titled, “Copyright is stifling US Culture.”\n\n'American universities, museums and libraries hold huge collections of material that they dare not post online because of the risk of massive liability if an unknown copyright owner later surfaces to sue them. Dealing with all these orphans is a hugely costly business: Cornell University, for example, says it spent $50,000 of staff time and several months calling publishers, authors and authors’ heirs, trying to get permission to digitise 343 monographs on 19th- and 20th-century agriculture—and still failed to identify 58 percent of the owners.'\n\n"
    },
    {
      "time": "",
      "content": "I've been really interested in self-publishing for a little while now. I looked into using Blurb's 'BookSmart' software, which was deliberately limited in terms of creating of layouts but let you choose the type of typefaces you would like to use which made me pretty happy.\n\nUnfortunately the postage to the U.K. was too pricey for a test run so I recently tried Lulu.com instead (they have helpfully set up a U.K. devison). Lulu.com is a great system for self publishers, particularly if you are a designer used to supplying files as PDFs and I love the way they have utilised the concept of Print on Demand to it's full extent... here comes the but...\n\nI thought the print quality was really disappointing. I had expected something similar to the look and feel of a decent quality offset job but the reality was more like a high quality Colour Laser Copier. In particular, the full bleed photographic images highlighted the jarring contrast between the thick, layers of glossy ink and the uncoated stock. I'm guessing this is where the whole Print on Demand idea starts fraying at the edges. Either colour laser printers need to get a lot better real soon or designers and the general public will have to come to expect a low standard of quality from publications using a POD system.\n\nIn terms of my self-publishing project, I haven't given up. I know what to expect now, I'm 'reshaping' the project to match the medium... I'm now thinking 'zine'. :)\n\n"
    }
  ]
}
