{
  "id": "30226",
  "title": "Generating fonts with the open contours",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello to all,\n\nI am working in a \"confidential\" project and I need to generate a font with the open contours.  \nFontLab closes the contours when generating the font (in any format)...\n\nthis is possible from FontLab?\n\nthanks in advance!\n\nEduardo Manso [[www.emtype.net](http://web.archive.org/web/20131017035404/http:/www.emtype.net/ \"www.emtype.net\") ]\n\n",
  "author": "emtype",
  "time": "28 Dec 2006 — 3:44am",
  "uid": "1289",
  "comments": [
    {
      "time": "28 Dec 2006 — 4:39am",
      "content": "Why do you need to generate a font with open contours?  \nSounds very interessting.\n\nPieter\n\n"
    },
    {
      "time": "28 Dec 2006 — 5:03am",
      "content": "Yes, is very interesting, but I cannot say nothing else :)  \n(I have signed a confidentiality contract )\n\nE.\n\n"
    },
    {
      "time": "29 Dec 2006 — 8:30am",
      "content": "A common application of such fonts is for stroke based font formats, still popular for EA languages where file size savings are important.\n\nIn addition such formats were used in the old days for pen plotter printing devices. Similar technology is used today in engraving and lazer etching devices.\n\nAnother obsolete use of this type of font was in coin-op arcade games such as Asteroids (the first game to use Atari's \"Quadra-Scan\" vector-refresh technology) and Tempest.\n\nAssuming you're producing some outlines for this type of work you might want to ask the people you're working for which tools they'd recommend.\n\n"
    },
    {
      "time": "2 Jan 2007 — 11:09am",
      "content": "Hi Sii,\n\nYes, is \"this type of work\".  \nMacromedia Fontographer 4 will generate fonts with open contours but I work in Mac-intel and OS9 and/or Macromedia Fontographer does not work, and I preferred to work in FontLab :)  \nI believe that it is not possible...\n\nthanks for your answer,\n\nEduardo.\n\n"
    }
  ]
}
