{
  "id": "3023",
  "title": "Dope",
  "forum": "Bitmap Display / Script",
  "tags": [
    "Bitmap Display / Script"
  ],
  "content": "This is another experiment I'm conducting with \"gray\" pixel font possibilities. The main objective here is to pull off the curves.   \n   \nThe letterforms are curious-looking to me. I like them, but they fall into an awkwardness that I'm not sure how to interpret.   \n   \nThe main thing here is to use the grays in ways other than simply filing out the empty pixels in one-pixel wide fonts. That looks good, of course, but is that all the gray pixel font has to offer?   \n   \nSeems like a point of beginning to me.   \n   \n ![](http://web.archive.org/web/20150317125856im_/http:/www.typophile.com/forums/messages/29/25936.gif)\n\n",
  "author": "tyleryoung",
  "time": "7 Feb 2004 — 4:33pm",
  "uid": "2139",
  "comments": [
    {
      "time": "7 Feb 2004 — 5:12pm",
      "content": "\\> The main thing here is to use the grays in ways other than simply filing out the   \n\\> empty pixels in one-pixel wide fonts. That looks good, of course, but is that all   \n\\> the gray pixel font has to offer?   \n   \nDamnright it isn't. I personally wouldn't bother with retrofitting a 1-bit (b&w) font with the circumstancial light gray around the corners. At the very least one should also use another gray to soften the black.   \n   \nThe good news with fonts that have stems of 2 pixels or more is that you have a lot of room for fidelity without getting too blurry. I have to say this effort here is too tentative. Here's an \"a\" for you:   \n   \n ![trythis](http://web.archive.org/web/20150317125856im_/http:/www.typophile.com/forums/messages/29/25940.gif)   \n   \nAnd check out Mana-16 on Ultrafonts.com - it's fanatically gray.   \n   \nhhp\n\n"
    },
    {
      "time": "7 Feb 2004 — 6:12pm",
      "content": "Yes Hrant, Mana is beautiful. Regular does show it grays proudly. But I really like the Bold. The font as a set is probably the most completely developed pixel font I've seen. Ultra Fonts is fortunate to have it.   \n   \nI see your point with the sample a. I definately agree I could put more work into smoothing out the letterforms for Dope, but what do you think of the curvature?   \n   \nWhat I mean to say is, the pixels (even with the grays) limit the curvature posibilities. The reason I've resisted trying to smooth things out so far, is to keep the playful oblong quality of the curves.   \n   \nI suppose it can be done though, I just haven't pushed it forward enough yet.   \n   \nThanks for the feedback!\n\n"
    },
    {
      "time": "7 Feb 2004 — 8:59pm",
      "content": "Glad you like Mana. In terms of \"completeness\" though, Unibody is much better\\*, and it's free. On the other hand, there will be a Mana-13 soon, with three weights\\*\\*. In fact Mana-13 might have two variants of the 2-pixel (middle) weight, one for emphasis in a body of Regular, another for body. I might make a Light Mana-16 too.   \n   \n\\* Just don't try to mark emphasis with its \"italic\"... In fact the only way to decently mark emphasis with Unibody is to use the Black in a body of Bold.   \n   \n\\*\\* One thing that'll be cool is that you'll be able to set nice smallcaps by using a weight of Mana-16 with a one-notch-darker weight of Mana-13.   \n   \nOne funny thing about Mana-16's Bold is its unusual crispness. It resulted from having counters that were 2 pixels wide, and I couldn't use two adacent light grays to model the inside - too fuzzy. So the Bold actually follows a somewhat different \"philosophy\". One thing this does is give the Bold an \"exagerated\" feel compared to the Roman, sort of like in Galliard's darker weights. This helps the less-than-50%-darker Bold stand out just the right amount from the Regular - alleviating the need for an Italic, btw.   \n   \n\\> the pixels (even with the grays) limit the curvature posibilities.   \n   \nYes, that's a very interesting truth. You could say that the less grays you use the more the pixel grid makes itself felt. If you use no grays for example things like to look very square (to avoid looking ragged). With more grays you can \"bend\" the grid to get higher-fidelity curves (plus better spacing and better bouma formation). But like you say there's a limit, not least due to the necessity for crispness: you can't just have a long, continuous stream of grays to model very subtle features, because that would create too much fuzz. You'll notice that my \"a\" is squarer than your original, and that's exactly because I couldn't make it rounder without adding too much fuzz. And in Mana for example you can still \"feel\" the grid - some people say it looks like a Windows system font. Some of the decisions I made in it have a surprisingly tight relationship with the grid/grayscale balance in fact. Like in an earlier version I'd tried to stick to 2 grays (to limit the bit depth to 2), and that actually caused the \"optimal\" form of the diagonals (\"v\", \"w\", etc.) to be bowed! _But_ this required two adjacent light grays at the outer edges, creating too much fuzz. When I decided to go for a wider spectrum of grays, I managed to get rid of the fuzz, but _only_ by dumping the bowing! Hard to believe, but I simply couldn't have both crispness and bowing in there... Spacing plays into all this too - it's really a precarious balancing act.   \n   \n--   \n   \nWhat's really fascinating about grayscale bitmapfont design is that it has its own \"zen\", beyond its parallels to both 1-bit and outline font design. I think it's because grayscaling relies on illusion to some extent: sometimes the most unexpected arrangement of certain grays will make a glyph click. Maybe in this way it compares with lo-fi outline fonts, like for phone directories.   \n   \nYour idea of using grays very selectively, and leaving in some aliasing on purpose is pretty interesting - I hadn't thought of it.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Feb 2004 — 1:17am",
      "content": ""
    },
    {
      "time": "9 Feb 2004 — 2:51am",
      "content": "I think I have succeeded in taking the s out of the realm of the iconic at last. At the very least, it carries the spirit of the rest of the set with more aplomb. The g now carries the same family resemblance as well. The set as a whole flows much better for me now.   \n   \nOn to the uppercase.   \n   \n ![](http://web.archive.org/web/20150317125856im_/http:/www.typophile.com/forums/messages/29/26038.gif)\n\n"
    },
    {
      "time": "9 Feb 2004 — 9:54am",
      "content": "\\> With attention spans that short, the spirit   \n\\> of typography is more important than the   \n\\> minute details of typography, no?   \n   \nWell, there are two problems with this:   \n1) I think the spirit comes in part from the details!   \n2) Sites with a lot of text will hopefully keep their readers much longer, to actually read the text!   \n   \nThere's a difference between display and text typography, even onscreen.   \n   \nAnd I actually think that the key to good onscreen type is put any \"emulation\" of an outline font on a second level. The \"allusion\" you speak of certainly matters less to the layman than to us font freaks!   \n   \n--   \n   \nI think this new evolution of Dope is on the money. Just the \"j\" needs a more docile tail.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Feb 2004 — 1:55pm",
      "content": "Here's where I start running into trouble. The uppers are difficult to shape into a cohesive set, let alone one that is cohesive with the lowers. The two look to be different weights to me as well.   \n   \nI know that uppers frequently have a slightly different feel to them than their lowers, but this doesn't feel right to me yet and I'm unsure which direction to try next.   \n   \n ![](http://web.archive.org/web/20150317125856im_/http:/www.typophile.com/forums/messages/29/26102.gif)\n\n"
    },
    {
      "time": "9 Feb 2004 — 11:51pm",
      "content": "Just for comparison's sake: dope in 1-bit.   \n   \n ![](http://web.archive.org/web/20150317125856im_/http:/www.typophile.com/forums/messages/29/26166.gif)\n\n"
    },
    {
      "time": "10 Feb 2004 — 6:27pm",
      "content": "Some variations: one pixel taller and rounded.   \n   \n ![](http://web.archive.org/web/20150317125856im_/http:/www.typophile.com/forums/messages/29/26242.gif)\n\n"
    },
    {
      "time": "13 Feb 2004 — 3:11am",
      "content": "Some more stuff.   \n   \n ![](http://web.archive.org/web/20150317125856im_/http:/www.typophile.com/forums/messages/29/26442.gif)   \n   \n ![](http://web.archive.org/web/20150317125856im_/http:/www.typophile.com/forums/messages/29/26443.gif)\n\n"
    }
  ]
}
