{
  "id": "30235",
  "title": "Client doesn't want hyphenation",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am a design student who does freelance work as well. I do work for a client quite often that just won’t let me hyphenate anything, even when the column length is fairly short, which creates an awful rag. She says it is too hard to read. Does anyone have a suggestion on how to explain to her the importance of a clean rag, or is there anyone who knows some proven statistic that hyphenated text isn’t hard to read? Newspapers hyphenate all the time. What would you do in this situation?\n\n-Thomas\n\n [‹ looking for a high energy/expressive feminine script....](http://web.archive.org/web/20081025042015/http:/www.typophile.com/node/30310 \"Go to previous forum topic\") [Font With Type: Pentagram redoes Saks ›](http://web.archive.org/web/20081025042015/http:/www.typophile.com/node/30278 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081025042015/http://www.typophile.com/user/7714\" title=\"View user profile.\">TGaskin</a>",
  "time": "<br>",
  "uid": "7714",
  "comments": [
    {
      "time": " 28.Dec.2006 6.01pm",
      "content": "Show her examples of anything with a narrow column. Is the text justified?\n\n"
    },
    {
      "time": " 28.Dec.2006 6.05pm",
      "content": "I have to admit this made me laugh. I would tell her with a high degree of confidence that an absolute no-hyphenation rule would be seen as extreme by typographic experts. There are many books with a variety of closely related by no means identical suggestions about how to handle when & how to hyphenate. What is seen as the desirable sweet spot is something that has moved over time. Still, why not show her two or three? Maybe you can agree to something if she has some postive examples to look at rather than just an idea to cling to. Also, to my (admittedly non-encyclopedic) knowlege there are no major publications use that rule either.\n\nThis said, I personally think rag fear is overstated. I like a left aligned text with a light rag very much. But this sort of thing enters the realm of taste. Without seeing a sample it really is hard to say what I think. What do you mean by ’fairly short’ BTW?\n\nWhat do my fellow typophiles think? Could any case whatever be made for an absolutely unhyphenated treatement? In either Justified or Unjustified mode?\n\nWait! I just though of one situation in which such a rule might make sense: A children’s book.\n\n"
    },
    {
      "time": " 28.Dec.2006 6.37pm",
      "content": "Rule 1: Avoid justified text. Everything will look and read better thereafter.\n\n"
    },
    {
      "time": " 28.Dec.2006 7.06pm",
      "content": "That’s my preference too.\n\n"
    },
    {
      "time": " 28.Dec.2006 7.24pm",
      "content": "As a general principle, I avoid hyphenation as well (I like setting full pages in bigger text), but it _is_ difficult in narrow columns.\n\nYou might want to trot out Bringhurst’s thoughts on appropriate type/column size — he does a great job of explaining the how’s and why’s — and see if you can’t reach some sort of middle ground.\n\nI’ve done this with many clients, and while not all of them sign up, many do, and most of the rest are willing to discuss it intelligently.\n\n(We won’t discuss those who won’t.... (haha) )\n\nJustification in narrow columns without hyphenation is a definite no-no....\n\n"
    },
    {
      "time": " 28.Dec.2006 7.40pm",
      "content": "It is impossible to change a client’s mind on something like this. Don’t try.\n\nUsually you can correct bad rag by selectively moving short words from the end of one line to the beginning of the next. If necessary, tighten the spacing of a line to pull a word up.\n\n"
    },
    {
      "time": " 28.Dec.2006 7.48pm",
      "content": "<cite>I am a design student who does freelance work as well.</cite>\n\n<cite>It is impossible to change a client’s mind on something like this. Don’t try.</cite>\n\nYou’re a college student. Your client probably thinks that she knows more than you, and regardless of whether or not she does, she’s probably not going to change her mind for you. So just be happy that you’re in college and you can actually find paid freelance work; here in DC the only students I know getting freelance work are either doing it for free or for so little money that they’re probably spending more running comps on their own inkjet printers than they’re making on the jobs.\n\n"
    },
    {
      "time": " 28.Dec.2006 8.56pm",
      "content": "I have a client who’s the same about hyphenatioin and it is VERY hard to change their minds. Maybe you can work on her to increase the column measure?\n\nI hate clients who are that rigid. I have another client who hates green. How do you hate green? But she probably “read something somewhere” that says hyphenation is hard to read and once they get that into their head it’s a losing battle.\n\n"
    },
    {
      "time": " 28.Dec.2006 9.16pm",
      "content": "“She probably “read something somewhere” that says hyphenation is hard to read and once they get that into their head it’s a losing battle.”\n\nThat’s why you need to gently suggest more reading.  \n:-P\n\nI usually pull out the Chicago Manual of Style and Bringhurst.\n\nI’ve had a couple of these clients before. They drive me nuts, and then I become downright hysterical when they ask for the double spaces after sentences to be put back in.\n\n"
    },
    {
      "time": " 28.Dec.2006 10.25pm",
      "content": "You have only one argument at your disposal: tell her that hyphenating saves money. If she doesn’t go for it, move on to thinking about something else.\n\n"
    },
    {
      "time": " 28.Dec.2006 11.46pm",
      "content": "Thanks for your suggestions, I like Thomas’, money is always the issue. I’ll show her a few examples of why hyphens help, and maybe bring in the Chicago Manual of Style and Bringhursts Elements of Typographic Style.\n\nThanks for your thoughts.\n\n-Thomas\n\n"
    },
    {
      "time": " 29.Dec.2006 6.53am",
      "content": "Huh. I always turn off automatic hyphenation. I just don’t like seeing little dashes litter the ends of lines of text. But I don’t use full justification either, and I always try to make the rag fairly even, putting in line breaks where appropriate.\n\nI’ve read Bringhurst several times, and the book is sitting within 18 inches of me, as usual.\n\nHave I been wrong all this time?\n\n"
    },
    {
      "time": " 29.Dec.2006 6.58am",
      "content": "“Also, to my (admittedly non-encyclopedic) knowlege there are no major publications use that rule either.”\n\nWell, every major online publication has to adhere to that by default. At least for now. ;o)\n\nAs for hyphenation, that seems mainly to be to reduce rivers and gaps in the column itself...not necessarily to fix the rag. I don’t mind a pronounced rag.\n\nIn the end, I wouldn’t dwell on this issue too much. If anything, produce a separate version with hyphenation for your portfolio if it really gets to you.\n\n"
    },
    {
      "time": " 29.Dec.2006 7.28am",
      "content": "\\>anything with a narrow column. Is the text justified?\n\nI just checked the front pages at newsdesigner.com, and almost all regular text in newspapers is set in justified, narrow columns—with hypenation, of course.\n\n"
    },
    {
      "time": " 29.Dec.2006 7.43am",
      "content": "I wouldn’t look to newspapers for elegant typesetting, I have seem some pretty appalling rivers, loose lines and widows even in the paper of record (the NY Times). Setting justified type in a narrow column does create problems - but so does ragging and in a multi-column design like most papers rag right could get ugly. I notice they use rag more for opinion pieces, reviews, commentary rather than reporting.\n\nI have noticed a bias on this site against justified type which I don’t think is quite fair - in many instances it is easier to read and cleaner than rag. I am leary of anybody - designer, teacher or client - who establishes absolute “rules” to govern design. The only rule should be what works best for that particular job, given its content, purpose, constraints.\n\nYou’re a student, you will learn as you continue to work that you need to pick your battles. Some things are worth going to the mat for, others not. Which is not to say that you shouldn’t want each job to look as good as it can. But not every job will end up in your portfolio and maybe your time is better spent looking for new clients than arguing hyphenation with the one you already have. Sometimes a client just wants to piss on a job too, and you have to let them. They feel like they aren’t getting their money’s worth if they don’t put you thru your paces. Decide what you can and will concede and what you will fight for.\n\n"
    },
    {
      "time": " 29.Dec.2006 7.44am",
      "content": "I would ask the client what newspapers or magazines they enjoy reading - then show them the level of hyphenation in those publications.\n\nCheers, Si\n\n"
    },
    {
      "time": " 29.Dec.2006 7.50am",
      "content": "Sometimes you just can’t change a clients mind. Some folks are just rigid and entrenched in their thinking. You can plead your case and site references in books and show good examples. If that doesn’t work, just set it her way and move on. Frustrating as it may be, it is her job and her money. You can’t please all of the people all of the time.\n\nChrisL\n\n"
    },
    {
      "time": " 29.Dec.2006 7.59am",
      "content": "Well put, Patty.\n\nSetting in narrow columns causes problems whatever rule you follow with respect to line endings. My point in citing newspaper practice is just to indicate that the burden of proof, given the overwhelming practice to the contrary, is on those who claim that justified text is inherently inferior. I could have cited also almost all extended text in books—which with the wider measures is easier to set well.\n\nThe perfectly even word spacing you can get by rags is a definite plus, but I agree with you that this advantage is often outweighed by the advantages of justified type.\n\n"
    },
    {
      "time": " 29.Dec.2006 9.19am",
      "content": "You may consider showing your client the same work with and without hypentation and a couple of arguments from Bringhurst once. Do it respectfully, you don’t want to damage your client’s pride.\n\nIf she doesn‘t accept the problem, then it’s an ego and control issue and you have to deal it with a different strategy.\n\nI’m planning to talk this topic with my own boss starting January, everybody is doing ragged texts without care of hypentation and short words being kicked out of the paragraph.\n\nRegarding rag vs hypentation we already had a lengthy discussion of the topic:\n\n[http://typophile.com/node/16395?from=0&comments\\_per\\_page=50](http://web.archive.org/web/20081025042015/http:/typophile.com/node/16395?from=0&comments_per_page=50 \"http://typophile.com/node/16395?from=0&comments\\_per\\_page=50\")\n\nHéctor\n\n"
    },
    {
      "time": " 29.Dec.2006 9.54am",
      "content": "Nothing like a server error when you’ve just typed a lengthy comment...\n\nAnyway, I don’t have time to read 4 pages of no-doubt interesting debate on the subject except to say that well set type is readable whether justified or ragged and which you choose is a matter both of personal aesthetics and function.\n\nJustified type gives a cleaner, more formal appearance. It looks better under centered heads. Ragged type is more friendly. To a student my advice is to try both where applicable and learn how they work for you. They can both be used in the same job: for example in book design I’ll often justify the main text and use ragged for sidebars or captions to set them apart.\n\n"
    },
    {
      "time": " 30.Dec.2006 10.40am",
      "content": "You could also try asking your client to do some editing to improve the rag. Since the problem with not hyphenating arrises when long words are used in narrow column widths, you may see if she would be willing to opt for a shorter word in place of one that creates a large gap in the rag. That is of course if the rag is worth it to her. It is hard to imagine that  \nif she is so bothered by a hyphen, she wouldn’t notice a really awkwardly shaped column created by a bad rag.\n\n"
    },
    {
      "time": " 30.Dec.2006 9.09pm",
      "content": "_Does anyone have a suggestion on how to explain to her the importance of a clean rag_\n\nShe’s not wrong.  \nShe just thinks that a hyphenation is more unsightly than a rough rag.  \nI agree.  \nEvenness of word-spacing is not the only reason for ragging — it also does away with hyphenation, and consequently any ragged copy that still has hyphenation looks wrong.\n\n"
    },
    {
      "time": " 30.Dec.2006 10.17pm",
      "content": "I will side in part with Nick here. I’ve worked with clients in the past where hyphenation was a strict no-no. All documents were bilingual and they had to look as much alike as possible and hyphenating French is tricky.\n\nI personally turn off auto hyphenation in whatever layout program I’m using for the job and work from there. I find if it bothers me that much a little minor adjustment to the kerning helps. Maybe that’s sacrilege to some here though.\n\n"
    },
    {
      "time": " 31.Dec.2006 7.30am",
      "content": "\\>Evenness of word-spacing is not the only reason for ragging — it also does away with hyphenation\n\nThat’s interesting. Personally I feel that hyphenation is much more of a disruption to reading than is slightly varying word space from line to line. So now I will pay attention to the difference between rag right without hyphenation vs justified with hyphenation, and see if it changes my ideas about this.\n\nStill, I think other variables—like measure and leading—have a bigger impact.\n\n[edit: I meant to write: \\*much\\* bigger impact.]\n\n"
    },
    {
      "time": " 31.Dec.2006 7.45am",
      "content": "And space between columns.\n\n"
    },
    {
      "time": " 31.Dec.2006 7.54am",
      "content": "is the final verdict for the “saviour” hyphen on asthetic design or information?  \nThe variables are immense but in the end it boils down to familiarity with the reader. Who’s reading it and are they used to hyphens, does the hyphen read confortably with the audience? of course it does. It’s everywhere and anywhere. Use it with the satisfaction of knowing that it will not hinder leagibility. What does become problamatic is extreme short lines with less than 30 characters, under 50 is scary in itself.\n\nIn my personal opinion, hyphens are removed when the copy is short, sweet and for advertising purposes only... a quick scan read if you must. ( outdoor, posters, magazine ads, etc) but when it comes to brochures or copy in which the audience will be dwelving into an informatic zone than I hyphen it!\n\n"
    },
    {
      "time": " 31.Dec.2006 11.59am",
      "content": "What an interesting topic. As a typesetter I use to have this dilemna all the time. The rule of thumb for our shop was — if it is advertising type - then no hyphens. This held true for all Headlines - and short blurbs on back of book covers, etc. We did our best making nice Coca-Cola shaped rags...\n\nBut when it came to justified type - we did use hyphens but no more than 1 in a row — and no rivers allowed.\n\nYes, it was time consuming, but our customers were use to having type set this way, and they were use to paying for the extra time it took to get it right...\n\n"
    },
    {
      "time": " 31.Dec.2006 3.31pm",
      "content": "I’d rather see a rag that looks like it was gouged into the page with a rusty knife than hyphenation of words with fewer than four syllables. The way I see it, a rough rag adds character to the page; just as justification once reminded the reader that someone spent hours tweaking the spacing on jobsticks to get justified type, a rough rag can be a reminder that just because the machine can make it (relatively) easy to perfectly justify type, one can turn that feature off.\n\n"
    },
    {
      "time": " 31.Dec.2006 5.53pm",
      "content": "Most of the times rough rags are a sign of careless typesetting, sometimes they’re a choice but I find very annoying there to be short words hanging out of the paragraph on long lines as much as notticeable short lines, it’s just random noise being trhowed into the page.\n\nI also prefer to have an hypentated verb, adverb or noun rather than an article, pronoun, conjunction or preposition on the end of the line because this disrupts sintactycal prediction when reading but verbs and nouns are easy to predict sintactically when hypentated.\n\nHypentation is harder english and french but in spanish hypentation is quite easy (since it’s syllabical).\n\nHéctor\n\n"
    },
    {
      "time": " 31.Dec.2006 6.34pm",
      "content": "Except in newspapers, hyphenating proper nouns in English is severely frowned upon (Chicago, APA, etc.) anyway: papers “get away” with it because of the narrow columns.\n\n_I also prefer to have an hypentated verb, adverb or noun rather than an article, pronoun, conjunction or preposition...._\n\nUm, well it’s hard enough to find to find an article, pronoun, conjunction or preposition in English or French that is even hyphenate-able. (“L-e”? “Sh-e”? “E-t”? “T-o”? C’mon!)\n\nThere are lots of reasons to have rough rags, but I wouldn’t say that the majority come from “careless typesetting.” “Ignorant typesetting,” maybe. :-P\n\nThere’s a difference....\n\n(This from someone who spends her weekends finding silly hyphenation in newspapers!)\n\n"
    },
    {
      "time": " 31.Dec.2006 7.15pm",
      "content": "\\> _I am a design student_\n\nTo my students interested in this subject I always recommend two nice pieces by John Berry, written for creativepro.com: [_The Justification for Hyphenation_](http://web.archive.org/web/20081025042015/http:/www.creativepro.com/story/feature/8656.html) and [_The Hyphenation of Justification_](http://web.archive.org/web/20081025042015/http:/www.creativepro.com/story/feature/8868.html?origin=story). Read them, they are pretty good. And try to make your client read them. Of course, I am not sure that reading those short essays could change her mind, but it never hurts to try, no?\n\nMy own take on this issue is fairly simple: hyphenation is beneficial for the readability of the body text (justified _and_ FLRR), and a no-no in display typography.\n\n"
    },
    {
      "time": " 31.Dec.2006 7.29pm",
      "content": "Linda I didn’t mean that I prefer hypentated nouns rather than an hypentated article.\n\nI tried to say that hypentated nouns, verbs, and adverbs (generally long words) are not disruptive when reading because they are easily predicted using syntactic information.\n\nOn the other hand pronouns, conjunctions or prepositions (mostly short words) can be more disruptive when reading if they are found at the end of a line because the sense of the text breaks.\n\nShort words at the end of the lines tend to appear much more in hard rags because of the attitude commonly assumed when setting them, mostly if you think that a rag doesn’t need to be tuned.\n\nOne of the most annoying things for me is to find a short word of the aforementioned kind at the end of a long line.\n\nShit, it’s hard to be coherent on a language you have never spoken.\n\nHéctor\n\n"
    },
    {
      "time": " 1.Jan.2007 9.07am",
      "content": "_it’s hard to be coherent on a language you have never spoken._\n\n:-) Héctor, that hasn’t stopped some of the clients I’ve had who have asked me to edit work originally written in a language other than English and who have “translated” it by looking up the words in a dictionary.\n\nAnd who’ve had the temerity to tell me I did a lousy job fixing it after!\n\n"
    },
    {
      "time": " 1.Jan.2007 11.30am",
      "content": "<cite>...that hasn’t stopped some of the clients I’ve had who have asked me to edit work originally written in a language other than English and who have “translated” it by looking up the words in a dictionary.</cite>\n\nLinda, I get the impression that you’re a very patient person.\n\n"
    },
    {
      "time": " 1.Jan.2007 12.01pm",
      "content": "_Linda, I get the impression that you’re a very patient person._\n\nROFLMAO! It’s more like I have a low tolerance for bad grammar and people are (usually, but not always) willing to pay to have me fix it.\n\n"
    },
    {
      "time": " 1.Jan.2007 4.13pm",
      "content": "Dwiggins Hyphenation Rules\n\n(or lack thereof) (or perhaps it was, whatever fits is what we want)\n\nThose of you who attended my talk at TypeCon this summer may remember this image, but I thought it sufficiently _à propos_ to post it in this hyphenation thread. This is the spine art from _The Bomb That Wouldn’t Go Off_ (Boston: Bruce Humphries, 1941).\n\n ![](http://web.archive.org/web/20081025042015im_/http:/www.typophile.com/files/shelfbackhyphenation_6158.jpg)\n\nPerhaps my first line should have been, **In Hyphenation, Dwiggins Rules!**\n\n"
    },
    {
      "time": " 1.Jan.2007 4.21pm",
      "content": "Uh... Bruce... where are the hyphens on that spine LOL?\n\nAnyone remember this “gem” of hyphenation courtesy of David Carson (and a previous thread)? Doesn’t get more egregious than this, and people worship him.\n\n ![](http://web.archive.org/web/20081025042015im_/http:/www.typophile.com/files/comparison-covers_3944_3664.jpg)\n\n"
    },
    {
      "time": " 1.Jan.2007 4.26pm",
      "content": "Ah, Patty, that’s because P.T. Barnum was right: _You can fool some of the people all of the time, and all of the people some of the time, but you can’t fool all of the people all of the time._\n\nSome serious folks got punk’d on this one....\n\n"
    },
    {
      "time": " 1.Jan.2007 5.21pm",
      "content": "\\>It is impossible to change a client’s mind on something like this. Don’t try.\n\nI do not agree that. As graphic designer we’ve to educate client or anybody else. Sometime it’s nice to do a job without hyphenation and sometime it’s not. At my opinion, the client pay for our knowledge, so he has to have confident in our hyphenation suggestion. Personally I do not accept the client come over my shoulder to direct my graphic design choice.\n\n"
    },
    {
      "time": " 1.Jan.2007 7.17pm",
      "content": " ![](http://web.archive.org/web/20081025042015im_/http:/www.typophile.com/files/picture-5264_3480.jpg)\n  \nAndre, have you met Hrant?  \n\n ![](http://web.archive.org/web/20081025042015im_/http:/www.typophile.com/files/picture-1250_3662.gif)\n\n"
    },
    {
      "time": " 1.Jan.2007 7.55pm",
      "content": "There’s two suitable eye icons for Photoshop CS3, right there... OK I am derailing. :P\n\nGetting back on track, I think both pattyfab and dezcom hit the nail on the head with their suggestions.\n\nSometimes you have to compromise what you’ve been taught in order to try to make a customer’s idea happen. Even when you know what the customer is asking for will not work, you have to show it- where your talents come in is making it look good. It’s not always easy. That’s just how it is sometimes.\n\n"
    },
    {
      "time": " 1.Jan.2007 8.43pm",
      "content": " ![](http://web.archive.org/web/20081025042015im_/http:/www.typophile.com/files/turk_4768.jpg)\n\nDetail of front page of Zaman newspaper (Turkey), Jan 1. 2007.\n\n"
    },
    {
      "time": " 1.Jan.2007 9.07pm",
      "content": "Dang that is the longest ladder I have ever seen.\n\nOf course I don’t usually have to deal with words like cumhurbaskanligi, anamuhalafet, izlediklerinin and vurgularken....\n\n"
    },
    {
      "time": " 1.Jan.2007 11.17pm",
      "content": "Yes, this is also a big problem in languages like German in which two words are often combined to make one big long wienerschnitzel.\n\n"
    },
    {
      "time": " 2.Jan.2007 6.57am",
      "content": "Holy shamoly, that is an amazing example Nick!  \nIs that normal in Turkey or just an example one bad job?\n\nChrisL\n\n"
    },
    {
      "time": " 2.Jan.2007 11.00am",
      "content": "I’ve no idea Chris, it suddenly occurred to me that browsing around the world at Newseum might be interesting, and when I came to Turkey’s sole posting, I noticed the profuse hyphenation.\n\nI’m sure that if that sort of thing became standard in English, readers would take it in stride. After all, the convention of spaces between words doesn’t bear much relationship to where people actually break words when they’re talking.\n\n"
    },
    {
      "time": " 2.Jan.2007 6.14pm",
      "content": "I am the author, typesetter, cover artist, and publisher of a book without added hyphenation. It is a reference book for medical transcriptionists. These are people who need to know whether a hyphen is part of a word or not. The book ... actually two books, it’s in the second edition now ... is set in two columns & admittedly has some ugly paragraphs, but I couldn’t do anything else under the circumstances. You can see what I’m talking about at [http://www.blowtorch-press.com/m06sampl.pdf](http://web.archive.org/web/20081025042015/http:/www.blowtorch-press.com/m06sampl.pdf \"http://www.blowtorch-press.com/m06sampl.pdf\") .\n\nElizabeth Dearborn  \nBlowtorch Press\n\n"
    },
    {
      "time": " 2.Jan.2007 9.55pm",
      "content": "That’s a very impressive piece of publishing and typography.  \nThe non-hyphenation seems perfectly logical and at home, as you’re getting a “rough” rag anyway from the short one-line entries, and because many entries are two- or three-line paragraphs that end in short lines.\n\nElizabeth, have you considered incorporating true italics and small caps?  \n(Sorry, you post an example on Typophile for one reason, and people immediately notice something else about it...)\n\n"
    },
    {
      "time": " 3.Jan.2007 5.52am",
      "content": "Zaman seems to use forced justification for the last line of the main story paragraphs, with as few paragraphs as possible, which seems to put unnecessary constraint on an already labour-intensive (in terms of time available) job.\n\nTim\n\n"
    },
    {
      "time": " 3.Jan.2007 7.08am",
      "content": "Thank you very much, Nick. The example is 30 pages out of a total of 728! The next edition will be even worse ...\n\nI typeset the book in TeX Computer Modern, which includes true small caps, slanted, and italic. I used italic for things like titles of books and movies, and slanted for things like the comments at the top of some of the pages, also for names of pathogens such as Cryptosporidium parvum. The contents page is in small caps.\n\n"
    },
    {
      "time": " 3.Jan.2007 9.56am",
      "content": "_true small caps_\n\nI was looking at the country abbreviations, where the small caps are set at a smaller size than the adjacent roman, and jumped to the conclusion that because they are thinner, they’re faux. My mistake.\n\nI note that you are using a double-f ligature, a very proper typographic nicety. If there’s one thing that looks out of place — even though with a specific hierarchical meaning — it’s the slanted roman. However, not an issue with your readers.\n\n"
    },
    {
      "time": " 3.Jan.2007 10.47am",
      "content": "I think you could also lose the widow in the first paragraph on page iv and therefore not have that lone line dangling at the top of the next page...\n\n"
    }
  ]
}
