{
  "id": "30248",
  "title": "First italic sans?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "This may be a simple question, but I can't find an answer anywhere, including at typophile.  \nDoes anybody have a clue of what was the first metal _italic_ (or in fact _slanted_ sans serif font?  \nMy guess from the material that I could look into would be something in a field where many different typefaces are needed in one composition: map printing or the like (on the other hand, maps were seldomly printed from lead letters apart from trials by Raffelsberger and others, but either engraved or later lithographically reproduced from ~1800 on).  \nSo any clues that could point into the right direction? Akzidenz Grotesk?\n\n",
  "author": "Stephan Kurz",
  "time": "30 Dec 2006 — 7:34am",
  "uid": "8415",
  "comments": [
    {
      "time": "30 Dec 2006 — 11:44am",
      "content": "Nice question.\n\n"
    },
    {
      "time": "30 Dec 2006 — 1:10pm",
      "content": "Whatever it was, it probably wasn't AG as AG was cobbled together from other grotesks purchased by H. Berthold A.G..\n\nThe Berthold specimens from the 1960s on [Uli's site](http://web.archive.org/web/20131106143233/http:/www.sanskritweb.net/forgers/#BERTHOLD) has italics (kursiv), these weights are not mentioned in the list of weights and releases up to 1958 published in _100 Jahre Berthold_, which suggests to me that either they were added by G.G. Lange when he redesigned AG in the late 1950s or that they existed previously and nobody cared enough to list them in what writings and specimen books survive. Either way Lange would probably know.\n\n"
    },
    {
      "time": "30 Dec 2006 — 8:48pm",
      "content": "I'm no expert on specimen books, but for what it's worth, here is the earliest lower case sans serif type I've come across in use, which also happens to be italic, and there is no instance of a matching roman lower case. It's from an advertising leaflet for the Liverpool & London & Globe Insurance Comapany, bound into The Sunday Magazine, Oct. 1874, printed in London by Virtue & Co.\n\n ![](http://web.archive.org/web/20131106143233im_/http:/typophile.com/files/Insurance_1874A_6230.jpg)\n  \n\n ![](http://web.archive.org/web/20131106143233im_/http:/typophile.com/files/Tontine_5396.jpg)\n\n"
    },
    {
      "time": "30 Dec 2006 — 9:10pm",
      "content": "I'm guessing that this is another question I could get answered if there was a copy of _The Nymph and the Grot_ in Washington. At least now I have two topics to look up when the UMBC library opens in a month. Or maybe I'll just mail a check to St. Bride on Tuesday morning.\n\nIf someone has a Fontzone login, Mosely's original article is [here](http://web.archive.org/web/20131106143233/http:/www.fontzone.com/?mode=article&id=586A866960983093), unfortunately I don't have a membership and since the passwords are sent via post, I won't be logging in any time soon.\n\n"
    },
    {
      "time": "30 Dec 2006 — 9:20pm",
      "content": "The Nymph and the Grot has quite a bit about the origins of the term Egyptian, and a reproduction of an 1834 Thorowgoood sans lower case, but no mention of italic sans serif.\n\n"
    },
    {
      "time": "31 Dec 2006 — 4:46am",
      "content": "Thanks everybody! Interesting sample that Nick Shinn posted – this is indeed an _italic_, not just a slanted variant as it seems to have become standard for \"prototypical\" sans serif or \"Grotesk\" fonts (i.e. not humanist sans). The uppercase looks more like a slanted roman as in \"LIFE DEPARTMENT\", though.  \nI will keep looking and post what I can find. If anybody only had some more ideas where to look…\n\n"
    },
    {
      "time": "31 Dec 2006 — 7:06am",
      "content": "later:  \nGill Sans Italic, Monotype: 1928-30  \nFutura Buchschrift schräg, Bauersche Gießerei: 1939\n\n"
    },
    {
      "time": "31 Dec 2006 — 7:08am",
      "content": "Thanks for the info, Nick.\n\nI wonder if italic sans characters used were in signs before the advent of sans type. Wasn't Caslon's Egyptian based on letters he saw in signs?\n\n"
    },
    {
      "time": "31 Dec 2006 — 3:20pm",
      "content": "James, in general the type founders were the last to get hold of a style, after signwriters, lettering artists, architects, stonemasons and calligraphers had had their way with it.\n\n\"Phantom\" was one of the few display styles that were \"type first\", from the 1830s, because type founders used engineering tools.\n\n ![](http://web.archive.org/web/20131106143233im_/http:/typophile.com/files/Phantom_5714.jpg)\n\nFor letter genres which originate with type, one should look to text type, although even here engraving played a strong role.\n\n"
    },
    {
      "time": "1 Jan 2007 — 10:22am",
      "content": "From my archives I've dug out a sample of a late 19th-century Cyrillic _Steinschrift Kursiv_ (most likely, H.Berthold's). It's a truly cursive grotesque sans. Interesting, huh?\n\n ![](http://web.archive.org/web/20131106143233im_/http:/typophile.com/files/Steinschrift%20Kursiv3_4439.png)\n\n"
    }
  ]
}
