{
  "id": "30243",
  "title": "Agara Black Italic",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "dear typophiles!\n\ni'd like to show you my new display type project:  \nit is bold, rough and vivid.  \ni've draw already all-slavic cyrillics and all-european latins.  \ni like it and please tell me what do you think about them.\n\nthank you!\n\npicture is here:  \n [http://type.org.ua/agara\\_show.gif](http://web.archive.org/web/20150417090429/http:/type.org.ua/agara_show.gif \"http://type.org.ua/agara\\_show.gif\")\n\n",
  "author": "andrijtype",
  "time": "29 Dec 2006 — 12:33pm",
  "uid": "7662",
  "comments": [
    {
      "time": "29 Dec 2006 — 12:57pm",
      "content": "andrij, as with all your work, i think this is great! the letters are indeed very lively. i think we'd need to see more text set to see if the latin portion really holds together. it looks a bit gappy in places, but it's hard to tell what's causing this without more to look at.\n\n"
    },
    {
      "time": "29 Dec 2006 — 1:10pm",
      "content": "paul, thank you!  \nplease look on sample with small text in 24 and 36pt here:  \n [http://type.org.ua/agara\\_gappytext.gif](http://web.archive.org/web/20150417090429/http:/type.org.ua/agara_gappytext.gif \"http://type.org.ua/agara\\_gappytext.gif\")\n\n"
    },
    {
      "time": "29 Dec 2006 — 1:22pm",
      "content": "i guess this font probably just needs some kerning (which i'm guessing is currently missing). the \"it\" combination was the only real troublesome gap i noticed in your set text. \"ij\" was also a problem in your initial image as were \"uv\". it seems like the serifs/strokes or whatever they are are a bit too large in places, but that is part of what gives this such great character. maybe the design needs to be regularized a bit to reduce this problem? contextual alternates might be another way to solve some of these spacing issues. or again, maybe it's just kerning...\n\n"
    },
    {
      "time": "29 Dec 2006 — 1:27pm",
      "content": "This is a great design that just seems to smile up at you! Where characters in Agara really fit together well it looks great; t followed by h, i followed by n.\n\nHere are my nitpicks:\n\nThere's a big gap showing up between l followed by a or d, and the space after the apostrophe is pretty distracting, especially with the spacing before the apostrophe being to tight. It seems like theres a much bigger gap following h and n than there is following m, it might just be an optical trick.\n\nI'm also not to hot on that z dipping under the baseline. It's a pretty letter, but I could see a lot of designers redrawing it just ao that it doesn't stand out. I wouldn't get rid of it, but it would probably be a good idea to have an alternate that fits better with everything else.\n\n"
    },
    {
      "time": "29 Dec 2006 — 2:17pm",
      "content": "top of main stem in \"d\" unfortunately seems cutted...\n\n"
    },
    {
      "time": "28 Apr 2007 — 2:03am",
      "content": "thank you paul,  \nthank you jpad,  \nthank you henyk!\n\ni add a bit of kerning, and make alternative -z-.  \ni think i'd like some gapping with this letters.  \nplease look here:  \n [http://type.org.ua/agara\\_new\\_z.gif](http://web.archive.org/web/20150417090429/http:/type.org.ua/agara_new_z.gif \"http://type.org.ua/agara\\_new\\_z.gif\")  \nand i am so sorry for big delay.\n\n"
    },
    {
      "time": "28 Apr 2007 — 7:35am",
      "content": "I hadn't seen this - very charming!  \nYou have a great touch.\n\nhhp\n\n"
    },
    {
      "time": "4 May 2007 — 2:28am",
      "content": "thanks hrant!  \nnow i've start to draw light face too\n\n"
    },
    {
      "time": "12 Jul 2007 — 7:37am",
      "content": "hurrah!  \nAgara released as 'Agarsky' at myFonts:  \n [http://www.myfonts.com/fonts/andrijtype/agarsky/](http://web.archive.org/web/20150417090429/http:/www.myfonts.com/fonts/andrijtype/agarsky/)  \ncyrillic & latin\n\n"
    }
  ]
}
