{
  "id": "30242",
  "title": "(x) Food and Wine Magazine script - Glenmoy (Mousse Script) {Stefan H}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Wondered if anyone could help identify this sample. I have tried What the Font and looked through the foundries and places I suspected, including the casual script section of the Bowfin site, but no luck. It is a subtitle font used by Food and Wine Magazine fairly extensively throughout their issues. I don't believe it was used by them until the last year or two.\n\nThanks for any help. It is my first post, couldn't seem to be able to get the image to show up inline as anyting except a question mark, sorry if I mess anything up.\n\nSteve\n\n| Attachment | Size |\n| --- | --- |\n| [F&WScript.jpg](http://web.archive.org/web/20110419190222/http:/typophile.com/files/F&WScript.jpg) | 29.74 KB |\n\n",
  "author": "<a href=\"/web/20110419190222/http://typophile.com/user/13528\" title=\"View user profile.\">steverle</a>",
  "time": "<br>",
  "uid": "13528",
  "comments": [
    {
      "time": "",
      "content": "Steve,\n\nThe name of the original typeface is Glenmoy. I haven't heard of any other digital version except for Mousse script by Alejandro Paul. His interpritation is to be found at Veer, [http://www.veer.com/products/typedetail.aspx?image=UMT0000162#specimen](http://web.archive.org/web/20110419190222/http:/www.veer.com/products/typedetail.aspx?image=UMT0000162#specimen \"http://www.veer.com/products/typedetail.aspx?image=UMT0000162#specimen\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks for your help. Thought I checked his stuff, but didn't think I saw the correct W. I was wrong, or it is an alternate because it is there. Happy Holidays!\n\nSteve\n\n"
    },
    {
      "time": "",
      "content": "As I said Alejandro's version is not 100% identical with the original Glenmoy. But still close enough. Judging from the showings at Veer. It seems that the uppercases do carry alternates. I see two \"W\" The rounded one is very close to the one from the magazine, except for angle on the side stroke to the left.\n\n"
    },
    {
      "time": "",
      "content": "Pretty font! WIsh it was cheaper tho. My personal rule of thumb is I don't spend more than about $20/weight for a new font unless I have a specific job in mind. Otherwise I'd go broke.\n\n"
    },
    {
      "time": "",
      "content": "As it happens, I am working on a revival of Stephenson Blake's Glenmoy at this very moment. If you can wait a month or so, a digital version, much more faithful to the original, will be available at myfonts.com. And it will be my usual price...$20.00.\n\n ![](http://web.archive.org/web/20110419190222im_/http:/typophile.com/files/glenmoy_4213.gif)\n\n"
    },
    {
      "time": "",
      "content": "Hehehe, yours was the first website I checked, Nick. Turns out I was only a tad early. ;^)\n\n"
    },
    {
      "time": "",
      "content": "Can't wait a month for this project Nick, but if you are releasing that font for $20 I will certainly purchase it when it is ready. Thanks again for everyone's help.\n\nSteve\n\n"
    }
  ]
}
