{
  "id": "30269",
  "title": "Specialty Shop Logo Design (Fly Fishing)",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Starting Fall semester (I'm in my senior year at college) we drew a specialty shop category out of a hat, I received \"Fly Fishing\".\n\nFrom there we were to think of a name - but the teacher pretty much vetoed all of our ideas, and named the stores herself, so I ended up with \"Fly Tie\".\n\nFrom there we had to decide what our specialty shop offered to make it so special. Obviously with such a name, I didn't have much room - so my shop offers a place for urban professionals to come learn how to tie flies in between their fly fishing trips. Think of it as a sewing club for men that like to fly fish, it's a place to chat and gossip and learn more about their favorite sport.\n\nFrom there we had to create a logo, it was hard to come up with something that represented fly fishing as a whole, and showed the community/group aspect of my store. I finally decided on the \"knot\" or line wrapping look. It's based on tying flies, how you wrap the line around the hook to get started, and continue to wrap the line to add materials to the hook. It also represents the \"Duncan loop\" probably the most common knot tied in fly fishing. Finally the knot presents the individuals wraps (the customers) coming together to form one solid piece (the store).\n\nSo I thought this idea covered, fly tying (what the shop offers), the actual fishing part (what the customer loves to do), and the community aspect very well (the essence of the store). Not to mention it had an upper class, sophisticated look to it (read more about the font in the communication plan below).\n\nCheck out my communication plan here for more info:\n\n[www.rosem.com/work/random/commPlan.pdf](http://web.archive.org/web/20130426012448/http:/www.rosem.com/work/random/commPlan.pdf \"www.rosem.com/work/random/commPlan.pdf\")\n\nLet me know what you guys think. I know the logo is no where near done as of now, that why I'm looking for comments. Next semester is starting soon and I want to get to see what other designers things of it as is.\n\nThanks,  \nMike\n\n",
  "author": "rosem",
  "time": "31 Dec 2006 — 7:55am",
  "uid": "14030",
  "comments": [
    {
      "time": "31 Dec 2006 — 9:36am",
      "content": "I'd have more contrast in the logo to pop the name out, but other than that, it's quite nice.\n\nWe have a lot of specialty fly-fishing shops here, and they are almost invariable \"woodsy\": more than one uses Papyrus as the font.... ;-) I like your take better, though: trendy withougt looking like a fashion victim.\n\n"
    },
    {
      "time": "1 Jan 2007 — 6:20pm",
      "content": "Thanks, that seems to be my biggest problem right now... People not being able to read it at first glance...\n\nI based the word mark off of Centennial and that font is very easy to read. Can you see what I lost in the transition from Centennial to my custom font/work mark?\n\nActually for the the Type makers out there, what can I do to make this easier to read in general...\n\nThanks,  \nMike\n\n"
    },
    {
      "time": "1 Jan 2007 — 6:49pm",
      "content": "_Can you see what I lost in the transition from Centennial to my custom font/work mark?_\n\nIt's those extra loops without sufficient contrast. Centennial is a nice, clean font, but those loops make it very muddy.\n\nI like your choice of colour palettes though: if you play around with them and have the name in one colour and the extra loops in another, I think it would work well.\n\nI didn't have a thorough read of your communication plan, but I did spot a number of missing hyphens, commas, and some awkward rivers of white space because of the justification. You probably already know you need to fix those up too, right? ;-)\n\n"
    },
    {
      "time": "2 Jan 2007 — 6:44am",
      "content": "Areas I would look at in the wordmark are the bottom loop of f and y, the f needs one to improve its recognisability and the y's is too cramped; does it really need the ligature between fly and tie? I would read it as flytie rather than two words; the e should have a small amount of overshoot on the top of the x height to avoid it appearing smaller than the other characters which have a flat serif, the tail seems to taper rather quickly. The feature where the ‘vertical’ translates into a curve works well on the l and t, I wonder if the inside of the f should do that, it currently creates a little notch.\n\nTim\n\n"
    },
    {
      "time": "3 Jan 2007 — 9:15am",
      "content": "Mike,\n\nFound your logo from the posting on the Chum. I like the logo but it was hard to read. I played with it a little using the crude tools in MS Paint. Offsetting the colors helped me see the name better and and all logo's have to have a hook ;-)\n\nThe Reel Pure gig is only natural. . .\n\nJohn\n\n ![](http://web.archive.org/web/20130426012448im_/http:/typophile.com/files/flytie%20logo_6654.JPG)\n\n"
    },
    {
      "time": "3 Jan 2007 — 9:35am",
      "content": "Thanks for the comments everyone, keep them coming :)\n\nAlso - I played with putting the hook in... Although it wasn't working for me, as the hook would have to be HUGE for it to make sense - as it's a very \"zoomed in\" on the knotting/tying.\n\nBut I'll keep looking into it.\n\n"
    },
    {
      "time": "3 Jan 2007 — 9:38am",
      "content": "Also, whats the chum... The main page I'm guessing? :)\n\n"
    },
    {
      "time": "3 Jan 2007 — 2:38pm",
      "content": "Its too busy. Think about the customer who will be using the store. Fly fishing isn't fussy, its straight forward. You have over designed this project. Think of the history of Fly Fishing (research) and you will be back on the right track for this shop.\n\n"
    },
    {
      "time": "3 Jan 2007 — 3:29pm",
      "content": "I can see what you mean by the design being to busy, I agree with that - and I think that leads into the legibility (or the lack of) of the logo design.\n\nHowever, I disagree with the strait forwardness of fly fishing. After doing my research, (which included many different sources, including a trip to a fly fishing shop in the Chicago area) my understanding that fly fishing was anything but basic/strait forward. It's an art that takes years and years to perfect, which might even be impossible with all the little things that can always be improved on. I think thats why makes most people go to fly fishing, and why they enjoy it (the challenge, and the detailing of everything).\n\nMost people I talked to compared it to chess, and regular fishing being checkers - which I think sums it up perfectly.\n\nAnyone agree/disagree?\n\n"
    },
    {
      "time": "3 Jan 2007 — 7:02pm",
      "content": "The Chum is \"Moldy Chum\", a very awesome one line one picture blog. That is how I found out about your logo. [http://www.moldychum.com/](http://web.archive.org/web/20130426012448/http:/www.moldychum.com/ \"http://www.moldychum.com/\")\n\n"
    },
    {
      "time": "3 Jan 2007 — 7:48pm",
      "content": "As a slogan, I thought \"tie your own\" had a few redeeming features.... ;-)\n\n"
    },
    {
      "time": "4 Jan 2007 — 5:41am",
      "content": "I like the version at:  \n [http://moldychum.typepad.com/moldy\\_chum/images/previewscreensnapz002\\_1.jpg](http://web.archive.org/web/20130426012448/http:/moldychum.typepad.com/moldy_chum/images/previewscreensnapz002_1.jpg \"http://moldychum.typepad.com/moldy\\_chum/images/previewscreensnapz002\\_1.jpg\")\n\nIMHO the logo is kind of confusing. I don't really know whats going on there, i do see Fly tie -something, but the upper part of the logo is confusing my eyes, what bothers me the most is that swoosh at the right part of the Y connecting to the T just doesn't seem to work that well. Maybe you might want to play around with it some more?\n\nAs for the logo as an insignia is nice, and strong, but than your going to find away to make people understand it, without having a typo expert explain it. Ask someone like a neighbor or a guy/girl from the street ask what they read. because people here are all visual lovers and most of us have a sense for type.\n\nGood luck!\n\n"
    },
    {
      "time": "4 Jan 2007 — 6:59am",
      "content": "I agree with jlejeune in that I think you need to put a bit more contrast between the type and the rest of the knot to make it more readable. Perhaps just screening it way back and opening up the gap a tad...\n\n ![](http://web.archive.org/web/20130426012448im_/http:/typophile.com/files/fly_3896.gif)\n\n"
    },
    {
      "time": "4 Jan 2007 — 1:57pm",
      "content": "It reads \"ayue\" to me. I would put more space between the areas where the letters meet. For example, where the top of the f and the l meet. I'd also make the t's crossbar not touch the i just as the f does not touch the l. That will help.\n\nThe round descender of the y also doesn't seem to match the round bottoms of the f, l, t, and i. I would make them all the same. I wonder what a thicker crossbar on the f and t would look like?\n\nVery nice design though!\n\n"
    }
  ]
}
