{
  "id": "30280",
  "title": "Looking for Mr Gill...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "7pm BBC2 tonight... [http://www.averyenglishvillage.com/](http://web.archive.org/web/20090604231030/http:/www.averyenglishvillage.com/ \"http://www.averyenglishvillage.com/\")\n\n",
  "author": "<a href=\"/web/20090604231030/http://typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": " 2.Jan.2007 10.08am",
      "content": "Who gave that scary kid an axe?\n\n_The Eric Gill story I am sure will raise a few hackles. When I embarked on the series I said that I wanted to use my camera to surprise myself and my neighbours. I think I was using my camera as an archaeologist might use a trowel - digging for memory, looking for hidden truths in the village. The Eric Gill film is a very personal journey. I make no claims to be an art historian or to have anything particularly original to say about Eric Gill, but for me it was a fascinating personal journey. In a sense I was thinking about my dad and his art history. The extraordinary thing is that Gill was in this village because of his relationship with Edward Johnston, the great calligrapher and font designer, and Johnston was my father’s tutor at the Royal College of Art in the 1920s. So it’s not just a film about art; it’s a film about community and personal history._ Luke Holland (director)\n\nTim\n\n"
    },
    {
      "time": " 2.Jan.2007 12.39pm",
      "content": "a reminder of how scary small-town england is.\n\nentracte.co.uk\n\n"
    },
    {
      "time": " 2.Jan.2007 2.34pm",
      "content": "<cite>a reminder of how scary small-town england is.</cite>\n\nAs if dog fondling, sister shagging paedophiles could ever live anywhere else!\n\n**[Small town Wales](http://web.archive.org/web/20090604231030/http:/www.bbc.co.uk/wales/historyhunters/locations/pages/6_3_eric.shtml)**\n\n"
    },
    {
      "time": " 2.Jan.2007 4.34pm",
      "content": "Somebody stick it on youtube!\n\n"
    },
    {
      "time": " 3.Jan.2007 12.35am",
      "content": "_Somebody stick it on youtube!_\n\nDoesn’t that equate to offering pirated fonts?\n\nEspecially since it is available for purchase.\n\nThe BBC is going to offer some programmes for free download, whether this will be covered I don’t know because it is made by a separate production company, and the offer might be restricted to the UK.\n\nTim\n\n"
    },
    {
      "time": " 3.Jan.2007 6.40am",
      "content": "“Doesn’t that equate to offering pirated fonts?”\n\nOnly if you are selling it for profit.\n\nOtherwise, it’s merely copyright infringement.\n\n"
    },
    {
      "time": " 3.Jan.2007 7.20am",
      "content": "_Only if you are selling it for profit._\n\nI don’t see that selling it or not makes any difference, taking a copy of somebody’s work and making it available to the public, thereby denying the author their due payment, is piracy, whether that work is a font, a piece of music or a film.\n\nTim\n\n"
    },
    {
      "time": " 3.Jan.2007 9.06am",
      "content": "Getting back to the actual programme…\n\n…I found it wonderfully sympathetic and insightful. I was slightly disturbed by the familial acceptance of his promiscuity, something the whole town, it seems, turned a blind eye to. His _flashing_ exploits I found humorous. I can’t remember the exact quote from one of his elderly neighbours – something about his balls being bigger than his brains?\n\n"
    },
    {
      "time": " 3.Jan.2007 9.11am",
      "content": "Can’t say I’m too intrigued by the rest of the series…\n\n– Saving the village pub  \n– Backstage at a Ditchling musical  \n– Four post-octogenarian ladies  \n– A farming and hunting moan\n\n"
    },
    {
      "time": " 3.Jan.2007 10.02am",
      "content": "I think that Gill and his twisted sister (and animals) would have had much in common with Edward and Tubbs, the inbred shopkeepers of [**Royston Vassey.**](http://web.archive.org/web/20090604231030/http:/www.bbc.co.uk/mediaselector/check/comedy/broadband/video/leagueofgentlemen_s2ep2?size=16x9&bgc=CC0000&nbwm=1&bbwm=1&nbram=1&bbram=1&checkedBandwidth=bb&checkedMedia=ram&subtitles=hide&alreadySeen=1)\n\n"
    },
    {
      "time": " 3.Jan.2007 10.10am",
      "content": "Ditchling, Capel-Y-Ffin and _Royston Vassey_…\n\n"
    },
    {
      "time": " 3.Jan.2007 10.17am",
      "content": "lol. He was a great artist and craftsman, but he was also one very sick puppy. Or should I say he made his puppy very sick!\n\n"
    },
    {
      "time": " 3.Jan.2007 10.42am",
      "content": "\\>– Four post-octogenarian ladies\n\nI thought the old dears in the film who remembered the community were actually far more honest than many of the others who tried to divorce the sensuality of Gill from his art.  \n_local carving for local people_\n\nTim\n\n"
    },
    {
      "time": " 3.Jan.2007 10.55am",
      "content": "tim,\n\nAbsolutely, but did you notice that some of the old dears drank some form of Pernod for almost any occasion/reason. I think that this helped loosen their tongues! Plus, in my experience I find that those English ladies of a certain era and social class always seem to tell it like it is.\n\n"
    },
    {
      "time": " 3.Jan.2007 10.59am",
      "content": "“I don’t see that selling it or not makes any difference, taking a copy of somebody’s work and making it available to the public, thereby denying the author their due payment, is piracy”\n\nThis is the definition the RIAA has been using, but is not the traditional term.\n\nPiracy refers to making fake product...be it physical or an illegal copy of an electronic medium and then selling it for profit. An illegal business.\n\nCopying something without the end-user’s permission is copyright infringement.\n\nI’m not ’for’ either one, of course. I just think it’s important we note the difference between the terms.\n\nBack to Gill:\n\n“As if dog fondling, sister shagging paedophiles could ever live anywhere else!”\n\nCan anyone expound on that? Is there more to Gill’s history than what (little) I know of? ;o)\n\n"
    },
    {
      "time": " 3.Jan.2007 11.04am",
      "content": "Some of his non-artistic diary extracts:  \n [http://www.traditioninaction.org/HotTopics/j006htGill\\_Morality2\\_Odou.htm](http://web.archive.org/web/20090604231030/http:/www.traditioninaction.org/HotTopics/j006htGill_Morality2_Odou.htm \"http://www.traditioninaction.org/HotTopics/j006htGill\\_Morality2\\_Odou.htm\")\n\n"
    },
    {
      "time": " 3.Jan.2007 11.15am",
      "content": "[http://www.amazon.co.uk/Eric-Gill-Fiona-MacCarthy/dp/0571143024/sr=8-2/q...](http://web.archive.org/web/20090604231030/http:/www.amazon.co.uk/Eric-Gill-Fiona-MacCarthy/dp/0571143024/sr=8-2/qid=1167844417/ref=pd_ka_2/203-0117419-5011112?ie=UTF8&s=books \"http://www.amazon.co.uk/Eric-Gill-Fiona-MacCarthy/dp/0571143024/sr=8-2/qid=1167844417/ref=pd\\_ka\\_2/203-0117419-5011112?ie=UTF8&s=books\")\n\nI recommend this biography of Gill to read about his private life (and his work), whether parts of it would be classed as paedophilia or just(!) incest is debatable.\n\nThanks for the definition of piracy.\n\nTim\n\n"
    },
    {
      "time": " 3.Jan.2007 5.15pm",
      "content": "The sad part is that the “little tinman” is actually a girl and “Ann of green gables” is a boy.\n\n"
    },
    {
      "time": " 3.Jan.2007 5.40pm",
      "content": "\\>The sad part is\n\nWhy is that sad? The age-old English tradition of cross-dressing (AKA Panto) is one on the country’s most noble exploits.\n\nDid the series run on Canadian TV?\n\n"
    },
    {
      "time": " 3.Jan.2007 9.19pm",
      "content": "I haven’t seen the program yet.  \nI kinda knew he was a free-love drop-out commie hippy artist.  \nDid it say anything about drugs?\n\n"
    },
    {
      "time": " 4.Jan.2007 6.40pm",
      "content": "OK, Eric Gill was a bit daffy in many ways, but he was a wonderful artist, a gifted type designer as well as a sculptor. Yes, the Fiona MacCarthy bio is a must read. The history of art is littered with artists who were not the purest of the pure, like Caravaggio for example, who is reputed to have murdered someone. (I didn’t Google this, just have a vague memory from old art history classes) Are artists or designers supposed to be saints? I mean I smoked dope and never inhaled either. Just kidding.  \nJordan\n\n"
    },
    {
      "time": " 4.Jan.2007 7.08pm",
      "content": "\\>a free-love drop-out commie hippy artist.\n\n\\>bit daffy in many ways ...not the purest of the pure\n\nFrom what I read in the links above, MacCarthy documents that Gill committed heinous crimes against his own children.\n\n"
    },
    {
      "time": " 4.Jan.2007 9.22pm",
      "content": "So, as they say, what do you plan to do about it? A silent protest, maybe refusing to use Gill Sans, or any humanist sans that was influenced by it? Maybe a boycott of Saab and the BBC?\n\n"
    },
    {
      "time": " 4.Jan.2007 9.32pm",
      "content": "\\>what do you plan to do about it?\n\nI just did it.\n\n"
    },
    {
      "time": " 4.Jan.2007 9.38pm",
      "content": "fair enough\n\n"
    },
    {
      "time": " 5.Jan.2007 2.50am",
      "content": "“Are artists or designers supposed to be saints?”\n\nNo, but neither does their occupation exempt them from behaving in ways that most sane people would doubtless agree are socially unacceptable and abhorrent. Child abuse is illegal for good reason, not simply because people are prudish or that they are moral pontificators. Gill, after all, was a man who claimed to be a devout catholic, working on carvings of the twelve Stations of the Cross at Westminster Cathedral, only to then come home to groom his children so that he could sodomise them. Caravaggio might well have murdered, we don’t know. Gill, however, explicitly documents his abuse in writing, and some of his unhealthier passions fed his work.\n\nI don’t know whether Gill was a hypocrite, mentally unwell or both, but for me personally, the edge is taken off from enjoying many of his (non lettering) works, knowing that much of his inspiration was generated by incestuous yearning and paedophilia. To me, the physical qualities of his work remain undiminished but when I was made aware that both his artistic and sinister personal life were deeply entwined, I found it quite difficult to view and engage with them in quite the same way that I did, prior to my knowledge of his abusive tendencies.\n\n"
    },
    {
      "time": " 5.Jan.2007 5.04am",
      "content": "Does anyone know if PBS is planning on buying the rights from the BBC to show it in America?\n\nOr do we, boohoo, miss out?\n\n"
    },
    {
      "time": " 5.Jan.2007 7.17am",
      "content": "\\> Does anyone know if PBS is planning on buying the rights from the BBC to show it in America?\n\nHow much have you donated to your PBS station in the past year. If it is more than a few dollars, they should be anxious to hear your opinions on programming, and might respond well to a request for the program.\n\nAnd if you haven’t donated: they will still probably listen to you, but you might feel a little less comfortable about asking them to spend the money that others have given.\n\n"
    },
    {
      "time": " 5.Jan.2007 11.14am",
      "content": "It’s problematic to pass moral judgement on those of another era, when values and laws were different than today.\n\nHypocrisy is however a charge that can be levelled at those of earlier times (if being true to one’s values is considered a virtue). In that case, Eric Gill was no hyopcrite; he genuinely believed that society was wrong to the core, across the board, and was radical in politics, morality, dress, religion, and of course typography.\n\n"
    },
    {
      "time": " 5.Jan.2007 11.20am",
      "content": "“It’s problematic to pass moral judgement on those of another era, when values and laws were different than today.”\n\nChild abuse was as equally wrong 70 years or more ago as it is today. I am sure most people in Gill’s era would have found his acts repulsive, regardless of moral stance.\n\n"
    },
    {
      "time": " 5.Jan.2007 11.43am",
      "content": "I’m not trying to start a debate. This conversation is good, but maybe we should all consider that each of us is welcome to have our own opinions.\n\nMy opinion: This might seem like a radical idea, but I believe in the idea of forgiveness and repentance, even with opportunity to do so after death. Therefore I have no idea if Eric Gill decided what he did was not such a good idea. None of us really do. Even his journal has proved to be full of stretched truth and poor memory for fact. I admire his work as an artist and typographer. I choose to ignore the rest and hope all has been made right. It isn’t my place to judge him.\n\n"
    },
    {
      "time": " 5.Jan.2007 11.47am",
      "content": "At the New York TypeCon 2 years ago, there was a speaker who made a presentation on Gill’s diaries and writings. Until that presentation, I knew nothing about Gill’s travesties. That was the only presentation that I walked out on. I just couldn’t stomach a man who would inflict his depravities on his own children. This was not religious or social radicalism, it was his way of justifying his raping of his own children. Whether he lived in the caveman days, the Dark Ages, or modern times Gill was a despicable piece of rat infested scum regardless of whatever artistic skills he may have posessed.  \nOJ was a great running back and Caligula was a skilled fidler.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Jan.2007 11.51am",
      "content": "Hmm. Maybe my rose color glasses are on a little too tight. :^/\n\nI should add, before someone jumps down my throat, that I DO NOT CONDONE THE THINGS WHICH PEOPLE HAVE SAID GILL DID. Not at all.\n\n"
    },
    {
      "time": " 5.Jan.2007 12.00pm",
      "content": "\\>being true to one’s values is considered a virtue\n\nSartre was willing to put authenticity above other virtues, but he was a rotten fellow (though not as bad as Gill). His ’ethics’ are poisonous. If a person’s values are rotten, then his sincere belief in them seems to me to be little compensation. Any day I’ll take a person who speaks hypocritically about liking everyone, and is actually kind, over someone who is sincere, vicious and cruel.\n\n\\>It’s problematic to pass moral judgement on those of another era, when values and laws were different than today.\n\nChild abuse was recognized as illegal and immoral then, as it is now, so what’s problematic? And being an authentic rebel does not, in my book, give you a free pass to selfish and cruel—as well as immoral and illegal.\n\nAdded: Just read Tiffany’s post. The thing is, Gill is beyond forgiveness or non-forgiveness, except by the Big Guy Upstairs. All we can do is, as Tiffany said, is to not condone in any way rotten behavior that severely hurts people.\n\n"
    },
    {
      "time": " 5.Jan.2007 12.00pm",
      "content": "Tiff,  \nNone of what I said was aimed at you or anyone else in this forum. You are entitled to your opinion without any worry. My reaction is purely to Gill. My children are the joy of my life. I just can’t bear the thought of a parent abusing his children.\n\nChrisL\n\n"
    },
    {
      "time": " 5.Jan.2007 12.01pm",
      "content": "AFAIK there was no age of consent (in law) in the early twentieth century in Britain, but in the mid-19th it was not unacceptable to have sex with a child of 10 to 13, however repugnant we might find that now. Gill’s family accepted his incest, although being unwilling to discuss it in public, his elder daughters did not condemn him either. Social mores change.\n\nTim\n\n"
    },
    {
      "time": " 5.Jan.2007 1.24pm",
      "content": "At least Gill left us with fabulous type. I’m not sure what L. Ron Hubbard has left us other than a bad movie and a really wacky group of hollywood actors. Jesus did leave us that book, but that has seemed to cause as many problems as it has solutions. Of course Hitler left us the VW. So, whether a person is a wacky prophet doesn’t seem to directly influence whether they leave a useful legacy or not...\n\n"
    },
    {
      "time": " 5.Jan.2007 1.28pm",
      "content": "Tim, age of consent for a non-incestuous relationship and incest of a parent with a child are two very different things. Parent and child incest is prohibited in Leviticus (18:7), so it is extremely ancient. I find it hard to believe that in 20th century Britain it was not against the law.\n\nI would like to know what his daughters thought of his behavior as adults, and what is their history. Lack of public condemnation is not indicative of anything, given the taboo on discussing such matters. On the basis of the literature in psychology, I doubt that the subsequent family history is a happy story.\n\nBy the way, on the subject of hypocrisy: Gill as well as being such a rebel also claimed to be a devout Catholic. I don’t know that much about Catholicism, but to me proclaiming you are a Catholic and practicing incest looks like the height of hyprocrisy.\n\n"
    },
    {
      "time": " 5.Jan.2007 1.32pm",
      "content": "_Child abuse was recognized as illegal and immoral then, as it is now, so what’s problematic?_\n\nI’m not condoning adult-child sex, merely pointing out that sexual mores and laws vary with time and place. Buggery was legalized in the UK in 1967. The legality of incest (familial proximity, age) varies with country and religion.\n\n"
    },
    {
      "time": " 5.Jan.2007 2.55pm",
      "content": "Well said, Chris.\n\n“Buggery was legalized in the UK in 1967.”\n\nYes, for adults, Nick. Young children who are conditioned to think it is right by people like Gill have no choice, that’s why laws are put in place to help defend them against predatory adults.\n\n“The legality of incest (familial proximity, age) varies with country and religion.”\n\nAsk any child of any culture, race, era, etc., if they would genuinely like to be buggered by thier dad and I think you’d find the answer would be a resounding NO.\n\n“Gill’s family accepted his incest, although being unwilling to discuss it in public, his elder daughters did not condemn him either.”\n\nOnce again, paedophiles are notorious for conditioning their victims to accept thier abuse as the norm. This is usually done by using threats that something bad will happen to them if they tell anyone or if they fail to comply with their abuser’s demands.\n\n"
    },
    {
      "time": " 5.Jan.2007 6.31pm",
      "content": "\\*\\*\\*\\* hell. I am never going to use any of Gills fonts again. “Artistic merit” be damned what he did is unforgiveable. Imagin trying to use joanna knowing who it is named after and what he did. I just can’t divorce a person from thier work no matter what.\n\nMuzz\n\n"
    },
    {
      "time": " 6.Jan.2007 3.17am",
      "content": "\\>two very different things  \nAnd two separate sentences.\n\nLike Nick has said in his posts, I am not trying to defend his practices, more trying to point out that history should take into account the social mores of the time (and many other contributory factors).\n\nA couple of articles written by Fiona MacCarthy  \n [http://books.guardian.co.uk/departments/biography/story/0,,1267659,00.ht...](http://web.archive.org/web/20090604231030/http:/books.guardian.co.uk/departments/biography/story/0,,1267659,00.html \"http://books.guardian.co.uk/departments/biography/story/0,,1267659,00.html\")\n\n[http://books.guardian.co.uk/review/story/0,,1825863,00.html](http://web.archive.org/web/20090604231030/http:/books.guardian.co.uk/review/story/0,,1825863,00.html \"http://books.guardian.co.uk/review/story/0,,1825863,00.html\")\n\nAnd, I believe, the slides that Chris was referring to  \n [http://www.nd.edu/~jsherman/gill/shermanPresentation.html](http://web.archive.org/web/20090604231030/http:/www.nd.edu/~jsherman/gill/shermanPresentation.html \"http://www.nd.edu/~jsherman/gill/shermanPresentation.html\")\n\nAnd, apparently Gill’s great grandaughter runs this business  \n [http://www.grangetrekking.co.uk/](http://web.archive.org/web/20090604231030/http:/www.grangetrekking.co.uk/ \"http://www.grangetrekking.co.uk/\")\n\nTim\n\n"
    },
    {
      "time": " 6.Jan.2007 5.28am",
      "content": "“history should take into account the social mores of the time”\n\nWas there a climate of general acceptance towards incest and paedophilia in 1920-30’s Britain that I am unaware of? This is not ancient history, and most cultures of all eras have realised that incest is genetically counter productive. I suspect that Gill’s incestuous activities were not driven by cultural or religious fervour/beliefs; simply a selfish lust.\n\nLike Chris said, “Whether he lived in the caveman days, the Dark Ages, or modern times Gill was a despicable piece of rat infested scum…”. Albeit a talented one.\n\n"
    },
    {
      "time": " 6.Jan.2007 11.25am",
      "content": "_Was there a climate of general acceptance towards incest and paedophilia in 1920-30’s Britain that I am unaware of?_\n\nYes, of course. There was more acceptance of paedophilia, the obvious example being the Catholic Church’s choirboy problem, which has been going on for many centuries, and only recently been brought out into the open in a few places, and prosecutions and dismissals made.\n\nAlso, sex in boys’ private schools was accepted as a fact of life. Younger pupils were made “\\*\\*\\*\\*” or servants of older pupils. Sex was not formally part of the arrangement, but the more common meaning of that word is not a coincidence.\n\nPeople were more reticent about their private lives then, and there were no sex researchers, so really, we have no idea how much incest was going on.\n\n"
    },
    {
      "time": " 6.Jan.2007 12.11pm",
      "content": "\\>There was more acceptance of paedophilia, the obvious example being the Catholic Church’s choirboy problem\n\n’Acceptance’ is highly misleading, as there was certainly no public acceptance of child abuse by priests, but rather public condemnation of such activities in the strongest terms.\n\nTo repeat, parent-child incest should not be muddled with other sexual issues. There was never acceptance of parent-child incest, so far as I know, in any culture, anywhere. Of course it has gone on, but that is not the same thing as moral acceptance. And as far as I know, according current psychological research, parent-child incest is one of the most psychologically damaging and burdensome things one can do to a child.\n\nSoft pedaling Gill’s heinous crimes does no one any favors.\n\n"
    },
    {
      "time": " 6.Jan.2007 12.36pm",
      "content": "I agree with William that ’acceptance’ is is misleading. The fact that there has been abuse within the Catholic Church, public schools and other closeted places, does in no way suggest that the wider society either wanted it or that they would tolerate it. Indeed, it was probably the emerging awareness of these goings on which led to schools, etc. to intentionally making it harder for these people to be with children.\n\n"
    },
    {
      "time": " 6.Jan.2007 3.01pm",
      "content": "_Of course it has gone on, but that is not the same thing as moral acceptance._\n\nI haven’t seen the doc, but Conor’s comment speaks to this:\n\n“I was slightly disturbed by the familial acceptance of his promiscuity, something the whole town, it seems, turned a blind eye to.”\n\nIf that’s not moral acceptance, what is?\n\n"
    },
    {
      "time": " 6.Jan.2007 4.34pm",
      "content": "I don’t there is any claim, or evidence, at least in the little I read, that the town knew he was having sex with his daughters.\n\nAnd I greatly doubt that they did know, since secrecy regularly accompanies incest, from what I have read and seen of victim testimony. He would have well known both the illegality and the official Catholic disapproval of incest, and hence his risk of public humiliation and jail. So the chances of he or his children being open about it are very remote.\n\nPromiscuity is one thing, and parent-child incest quite another, and much graver, matter.\n\n"
    },
    {
      "time": " 6.Jan.2007 7.58pm",
      "content": "100 years from now, or 200, when we have left behind our work or lack of same, who will possibly care whether or not a very beautiful type, Joanna, was designed by a pedophile? Long before I read the MacCarthy book and knew only the sanitized biography of Eric Gill I thought that Joanna in metal was a lovely type, especially in the italic. Do we all read the biographies of type designers before we use their types? God forbid what we might find out if we did. Can we, should we, separate the art a person creates from the private life of that person? I condemn the acts Gill committed as much as anyone but I cannot and will not condemn the work he made.\n\n"
    },
    {
      "time": " 6.Jan.2007 10.18pm",
      "content": "Jody,\n\nI would not hang these; [http://www.hitler.org/art/buildings/building5.jpg](http://web.archive.org/web/20090604231030/http:/www.hitler.org/art/buildings/building5.jpg \"http://www.hitler.org/art/buildings/building5.jpg\") [http://www.hitler.org/art/landscapes/landscape6.jpg](http://web.archive.org/web/20090604231030/http:/www.hitler.org/art/landscapes/landscape6.jpg \"http://www.hitler.org/art/landscapes/landscape6.jpg\") [http://www.hitler.org/art/doodles/doodle6.jpg](http://web.archive.org/web/20090604231030/http:/www.hitler.org/art/doodles/doodle6.jpg \"http://www.hitler.org/art/doodles/doodle6.jpg\") on my wall even if I liked them, would you? I knew a serial sex slayer who is an outstanding Maritime Historian, a subject of interest to me. Don’t hang with that fellow, or read his books, would you? Yes, he is on the streets.\n\nI have written off Gill as a result of his “perverse habits”. I would not buy his type any quicker than Hitler’s artwork. Sex with children is despicable. Also, “animals” can not give consent.\n\nGiampa\n\n"
    },
    {
      "time": " 6.Jan.2007 10.50pm",
      "content": "Myself, ignoring the fact that I know a bit about Gill and some of the rest of you, I’d say judge it on the work. My God, what does one’s personal life have to do with how their work is perceived? especially when, in Gill’s and others cases, we only come to understand this in retrospect.\n\nWhat exactly do social morals have to do with the practice of typography? How about other ethical behavior?\n\nGerald\n\n"
    },
    {
      "time": " 7.Jan.2007 3.04am",
      "content": "“I haven’t seen the doc, but Conor’s comment speaks to this:\n\n‘I was slightly disturbed by the familial acceptance of his promiscuity, something the whole town, it seems, turned a blind eye to.’\n\nIf that’s not moral acceptance, what is?”\n\nYou’ve not seen the documentary, but you are prepared to form your opinions on it based upon the second hand viewing information of one viewer! Regardless of what either Conor, I or anyone else says, you’d have to see it for yourself. The fact remains that he was an abuser, a point, it would seem that you want to sweep under the carpet and forget because it is a history of abuse which some members of past society have ignored, as indeed some will continue to do today. Yes, life moves on, but it does no harm to remember past and present victims of crimes which were never justifiable.\n\nFrom what I saw, I believe that villagers at the time did not know about his abusing; he was seen simply as an artistic wierdo but that was about it. What, do you think Gill advertised the fact that he was abusing his kids, perhaps popping into the pub or the post office to let the locals know that he was the local kiddy fiddler?\n\n“What exactly do social morals have to do with the practice of typography?”\n\nThat is dependent upon one’s purchasing ethics and consumer awareness (if the work is for sale). Some of Gill’s (non-lettering) artwork was inspired by his incestuous leanings. Like I said in a earlier post, I don’t doubt his technical ability (particularly as a lettercutter, designer, etc.) but I don’t have to like the man.\n\nI don’t think that it hurts to know a bit about the background of any artistic creation and/or the product’s creator when making purchasing decisions. I don’t want to digress too much, but people who by into a product, say Siemens for example, might not know (or may choose to ignore) that they manufactured the ovens to burn the bodies of Nazi concentration camp victims. (Perhaps you think we should ignore that event too, Nick, seeing that that too is history with a past cultural context). Yet still as **[recently as 2002](http://web.archive.org/web/20090604231030/http:/news.bbc.co.uk/1/hi/business/2233890.stm)** this company continued to show no respect for the murdered. It is a question of ethical awareness and consumer choice. If consumers know about a product or manufacturer’s history they might think twice about buying that product. We should not berate people for not buying into certain prouducts, including art (type), if their conscience dictates.\n\n“How about other ethical behavior?”  \nIn relation to what exactly?\n\n"
    },
    {
      "time": " 7.Jan.2007 11.16am",
      "content": "Gerald: what do we do with the Western tradition of typography, in which the Bembo typeface plays so strong a role — knowing that its creator was a murderer?\n\nFrom the other direction, I know that there are several potentially excellent type designers who have not published their work, because they are uncomfortable with the idea that it may be used to set text they would find objectionable.\n\n_Perhaps you think we should ignore that event too, Nick, seeing that that too is history with a past cultural context_\n\nT Bones, if you want to continue this discussion, I suggest you come out from behind your anonymous avatar (what guilty secrets do you have to hide?) and stop using the sleazy “if you disagree with me you must be a Nazi sympathiser” debating technique. And you might want to consider changing your avatar picture from one by Hergé, who some would consider a Nazi collaborator, before you play your Nazi card :-)\n\n"
    },
    {
      "time": " 7.Jan.2007 2.01pm",
      "content": "“And you might want to consider changing your avatar picture from one by Hergé, who some would consider a Nazi collaborator, before you play your Nazi card :-)”\n\nTo a picture of you in your snappy Hugo Boss schutzstaffel uniform instead perhaps? :-)\n\n“I suggest you come out from behind your anonymous avatar”  \nT. Bones is my real name, strange as it may be to you. What’s the problem with using my initial, eh? Why do you need to know exactly who I am, Nick? My private life is none of your business and neither am I answerable to you.\n\nPerhaps you have a problem with the concept of freedom of speech too. Or has this thread got way too close to exposing your guilty secrets? It certainly says a great deal about you.\n\nThere’s no need to get personal, Nick. I never said that you are a Nazi sympathiser, paedophile sympatiser, or whatever. (You might be, who knows). Anyway, to get firmly back on topic. I was making the point that you suggest that things were different in Gill’s era and were therefore acceptable to the wider society. I used the Siemens case to illustrate the point that you made about actions being viewed differently in past society as well as a point regardng the issue of informed consumer choice. I chose to disagree with your views and counter what I felt was a flawed and narrow minded argument. No need to throw your toys out of the pram because you don’t like my thoughts. If you want me to back off, agree to differ and leave the argument at this point, just say, but don’t accuse me of being sleazy as a cheap insult.\n\n"
    },
    {
      "time": " 7.Jan.2007 2.51pm",
      "content": "We are wrestling here with a problem of how to deal with the works of a great artist who did reprehensible things as a person.\n\nI think one part of the problem is relatively simple. In my view, we should clearly and uniquivocally reject what was morally reprehensible that the person did, and not soft pedal it because he (or she) was a great artist.\n\nFrom what I hear there are perpetrators of incest on the internet who try to reassure one another that it is ok. So I think we have a responsiblity to sustain a climate of moral disapproval of this extremely damaging behavior, and not give any excuse to the villains who perpetrate this stuff. They may find this thread by googling. I know it is not fashionable to moralize, but I don’t agree with the fashion: it is important to moralize to help sustain a decent society. And this is a case where the need is, in my opinion, very clear and unequivocal.\n\nThe question of how to deal with the works of a person whose actions we find reprehensible is more complicated.\n\nAlthough his concern is understandable, I don’t agree with Gerald Giampa that we should simply dismiss them. Historically, it seems that we don’t know whether the ’fabulous hands of Francesco da Bologna’ [Griffo], as Aldus put it, were in the end instruments of murder. Evidently Griffo was accused of murder for killing a relative in a fight. We don’t in fact know whether he was, for example, let off on account of self-defence, or was hung.\n\nBut let us assume that he was guilty of murder. Should we then not learn from this ’founding father’ of roman type design? Not use his type designs? I don’t see why. His designing type was an innocent activity, and not malicious. So why not accept the good that the man did, and lament the bad, if indeed it was there.\n\nSimilarly in the case of Gill, his type designs are fine, honest work. And so I don’t have a problem with people using them and learning from them. I also don’t have a problem if their association with Gill is too much, but that is a personal thing. I don’t think there is a moral case to be made against the type itself—as it might be with pirated type, for example—particularly long after his death.\n\nNow it is not simple because some artistic work is tainted by the corruption in the artist or designer. As I think some have mentioned, this is indeed the case with some of Gill’s drawings and sculpture. Actually before I knew about this stuff there was something I found weird and off-putting about his work, even the relatively innocent stuff on the BBC building at Porter Square, if I remember correctly. And his stuff of Catholic Saints having sex is just too bizarre for words.\n\nWhat of Gill’s work is over the line is I suppose for each person to decide. To me the type is pretty much the good side of Gill’s work, and the Saints the bad. We can accept the one and not the other.\n\n"
    },
    {
      "time": " 7.Jan.2007 4.25pm",
      "content": "Well said Bill.\n\n_T. Bones is my real name, strange as it may be to you_\n\nI made the assumption based on the fact that you list “T Bones”, with no period after the T, on your further information page as “Full name”.\n\n_Why do you need to know exactly who I am_\n\nI don’t. You are the one advancing the argument that the backround of designers has a bearing on whether one should use their products. So a lack of transparency seemed hypocritical to me, assuming that you were posting under an alias.\n\n_The fact remains that he was an abuser, a point, it would seem that you want to sweep under the carpet and forget because it is a history of abuse which some members of past society have ignored, as indeed some will continue to do today._\n\nThat’s not my point, actually, it’s yours. I’m more interested in the relativity of sexual ethics and laws in different times and places than being outraged about Gill’s sexual relations with his children. If this dispassionate attitude seems callous or “soft-pedalling” to anyone, I apologize, but it is a sincere reaction to the way in which Gill is so often mentioned on Typophile and out come the prurient comments sniggering or thundering about his sex life.\n\n_I never said that you are a Nazi sympathiser, paedophile sympatiser, or whatever. (You might be, who knows)._\n\nAnd so might you, who knows.\n\n"
    },
    {
      "time": " 7.Jan.2007 4.56pm",
      "content": "I too agree with Nick, your comments Bill are well put. The work or the art will stand on its own merits as you suggest. The benign work of type design can hardly be criticized on the basis of the lack of morals of its creator, or for that matter, on the moral goodness of that person. The work is the work. If Jesus had designed a crummy type font would we like it because of who He is?\n\n"
    },
    {
      "time": " 7.Jan.2007 8.25pm",
      "content": "Jordy,\n\n“If Jesus had designed a crummy type font would we like it because of who He is?”\n\nIf Hitler painted beautiful pictures would we dislike them because of who he was? Some would. How did Michael Jackson become “Wacko Jacko”? Some consider child molesters dismissible in spite of their past work.\n\nTo quote my good friend Chris, “OJ was a great running back and Caligula was a skilled fidler.”\n\nGiampa\n\n"
    },
    {
      "time": " 8.Jan.2007 12.38am",
      "content": "\\>Caligula was a skilled fiddler\n\nThat kind of illustrates the point I was making about proper research, because  \ni) It was Nero who “fiddled while Rome burned”, (and, of course, the fiddle wasn’t invented for another thousand years, so it was probably a lyre).  \nand  \nii) It wasn’t certainly true, Suetonius is the source for this and it has passed into folklore, however, Tacitus says that Nero returned to Rome as soon as he heard of the fire and started the relief effort from his own pocket, including feeding and sheltering the dispossessed in his palaces.\n\nTwo sources, each probably written with an agenda to favour a patron, although both sources agree that both Caligula and Nero were very unpleasant human beings.\n\nTim\n\n"
    },
    {
      "time": " 8.Jan.2007 6.46am",
      "content": "I am not equating Gill’s morals with his typefaces nor am I condemning his typographic work because of his perversions. To me, it is a matter of personal choice if you use his type. If an individual can use Gill’s type without feeling conflicted or in some way negative, that is fine. I certainly will make no judgement about that individual. It is their choice, not mine to make. If another individual cannot divorce Gill’s type from Gill and would be consumed by a moral dilemma, I would have no issue with that person avoiding the use of Gill’s type either. It is their choice not mine.  \nAs for me, I fall more into the second group. I had not been using any of Gill’s type for several years prior to finding out about his character anyway so I made no conscious choice to avoid his type. I chose other type for the usual typographic reasons based on the needs of the job. If I were forced to make a choice today, I don’t think I could now choose Gill’s type without it causing me sadness. If a client came to me who uses Gill Sans as a corporate face, I would most likely feel OK about using it because it was their stipulation for their own work. This has never happened so I don’t know for sure if I would be able to do it or feel I must decline the job. There have been times when clients have insisted on using certain typefaces which I felt were wrong for the job (again for typographic reasons). I pleaded my case to the client and sometimes could not sway them. Most often, I ended up doing the job using their type but there was a case where someone wanted to use all caps script. I declined the job politely. This again was not a moral issue but the thought of being associated with a really bad job just does not sit well with me.\n\nChrisL\n\nPS: Sorry about my error with Caligula/Nero.  \nand hello to my friend Gerald.\n\n"
    },
    {
      "time": " 8.Jan.2007 6.49am",
      "content": "“I would not hang these...on my wall even if I liked them, would you?”\n\nWould you drive a VW?\n\n"
    },
    {
      "time": " 9.Jan.2007 9.52pm",
      "content": "Aluminum,\n\nNo, nor a Ford.\n\nGiampa\n\n"
    },
    {
      "time": " 11.Jan.2007 5.14am",
      "content": "Just a thought: If one would eliminate all literature, art and music, whose creators have led a dubious or shady livestyle –&nbsp;what would remain? – I still love Polanski’s films and I’ll also use Gill Sans and Joanna if needed. Art doesn’t go together with political correctness –&nbsp;a fact hard to chew for some people.\n\n"
    },
    {
      "time": " 11.Jan.2007 10.13pm",
      "content": "FlorianCH\n\n“Art doesn’t go together with political correctness”\n\nGill’s work certainly “did not” go together with “political correctness”. That said, I don’t think anyone, unless someone is mislead by your conclusion, is suggesting buggering, maybe I should say sodomizing one’s own daughters is acceptable behavior. But are you saying that art is not art unless it is politically incorrect, that sodomizing ones daughters is acceptable in that name of art?\n\nI hope not.\n\nGiampa\n\n"
    },
    {
      "time": " 12.Jan.2007 1.14am",
      "content": "Giampa, my command of English apparantly didn’t allow me to write precisely what I meant. I would suggest to anyone interested in this thread and the topic to read Fiona MacCarthys brilliant book on Gill or another well-researched source and not just rely on some vague rumours. It’s so easy to pick up a scandalous fact on the internet and then cry for morals and censorship.  \nTo know about Gill’s background doesn’t excuse his behavior in any way – what he did has to be considered a crime, no doubt about that. But there emerges a picture of a patriarchal community –&nbsp;a sect –&nbsp;which was extremely creative and productive. So to me, it is an fascinating, if deeply problematic story about patriarchism and sectism, which makes Gill an important, but not unusual figure in the context of the early twentieth century. It is striking in how many artists’ and patriarchal communities, which have been extremely creative at times, the same issues of promiscuity and misleaded sexual freedom have arised.  \nThis is a tale about Britain in the twenties, about the status of the artist, about religion and patriarchism. I am speaking from a historian’s point of view – whether you want to distance you from his output, is your matter of choice. So what I suggest is research and historical awareness, not censorship (I think many of Gill’s sculptures and drawings are just horrid, by the way, but still I’m interested in them.)  \nI would like this thread to be continued, but not with cheap polemics à la «Would you put a drawing by Saddam Hussein above your bed?»\n\n"
    },
    {
      "time": " 12.Jan.2007 10.37pm",
      "content": "FlorianCH\n\n«Would you put a drawing by Saddam Hussein above your bed?\n\nI am surprised. I knew Hussein was a poet and gardener, but never knew he was a painter. Not wishing to purchase Gill’s type on account of his sins is mute in my case. I don’t care for his types, or subscribe to his failed semi-justified-ragged-right nonsense. Also, I was never a fan of his fashion statement which made him look like a bearded lady at the circus. Although, it suited him for reasons which are made obvious by his unmentionable predilections.\n\nAlso, margins on books were not meant so your thumbs could hold books while riding the train. So you see, underaged daughters were not the only things he was buggering up.\n\nGiampa\n\n"
    },
    {
      "time": " 13.Jan.2007 12.18am",
      "content": "OK, you apparently want to go on railing a bit on the «circus lady» –&nbsp;that’s not very helpful, but at least funny at times.\n\n"
    },
    {
      "time": " 13.Jan.2007 6.34am",
      "content": "If we’re going to write off everyone involved in the arts who did something morally reprehensible there’s going to be a pretty short list of remainders. Picasso was a misogynistic lech. Carravaggio was a rapist and murderer. Wagner was an anti-semite (as were plenty of other important people before World War II.). I could go on listing the flaws of famous dead people for hours. Given how many people around the world still find homosexuality morally offensive, it would be easy to write off most of the artists of the Italian Renaissance, and a tremendous amount of art in general.\n\nWhat’s important is that we learn from the past and not repeat the mistakes of our predecessors. But if we bury the artistic achievements of everyone whose behavior pisses somebody off, there’s not going to be much left.\n\n"
    },
    {
      "time": " 13.Jan.2007 7.34am",
      "content": "jpad,\n\nMany wrongs don’t make a right. Besides most artists are good people. Not much would be lost, especially with the likes of Carravaggio. What is lost in history could be found in the overlooked art of women in history. You think non of them painted? Start naming them.\n\nA little project of mine.\n\nGiampa\n\n"
    },
    {
      "time": " 13.Jan.2007 8.18am",
      "content": "«Most artist are good people.»\n\n… as well as all female artists, I suppose. That’s probably why they have always been suppressed&nbsp;… As if the whole question of creativity was so simple. Again: I think what is hard to accept is that «good people» do not necessarily produce great art, nor do «bad people» necessarily produce tasteless things. On the contrary, it is often disconcerting to see that talented artists push the limits in every possible way. And: Who defines what is a «good person» anyway? You?\n\n"
    },
    {
      "time": " 13.Jan.2007 3.11pm",
      "content": "FlorianCH\n\n“Who defines what is a «good person» anyway? You?”\n\nSleeping with non consenting underage daughters would make one bad. I am not sure what would make you good. But I am sure you are, or at least, I hope.\n\nI am not the most “goodest person” according to some. I am a non believer, if that is helpful.\n\nActually this thread is moving towards the “roots of inspiration” maybe we should move towards those goals. What inspires you?\n\nGiampa\n\n"
    },
    {
      "time": " 14.Jan.2007 1.41am",
      "content": ".\n\n"
    },
    {
      "time": " 14.Jan.2007 7.03am",
      "content": "What inspires me is after fighting with the form a typeface i am working on might take, then redoing it many times over, I finally pull a proof which starts to feel like I am headed in the right direction. It is as silly as that. I don’t think about grandios things or philosophy or even beauty. I just do stuff and then tinker with it forever (or so it seems). Not too inspiring I know but that is all I have.\n\nChrisL\n\n"
    },
    {
      "time": " 14.Jan.2007 7.58am",
      "content": "Neat article:  \n [http://www.traditioninaction.org/HotTopics/j005htGill\\_Distributism\\_Odou....](http://web.archive.org/web/20090604231030/http:/www.traditioninaction.org/HotTopics/j005htGill_Distributism_Odou.htm \"http://www.traditioninaction.org/HotTopics/j005htGill\\_Distributism\\_Odou.htm\")\n\n"
    },
    {
      "time": " 14.Jan.2007 10.37am",
      "content": "UK has always had strict laws against homosexuality, they may have forgotten about the rest.\n\nAs far as abuse in general—it was always swept under the rug. It is only in recent years that it is publicly spoken about. And you know, some of what is reported as abuse, I wonder about. (I’m one who laughed all the way through reading _Mommy, Dearest_. Didn’t you?)\n\nFavorite South Park to date — ADD and the video tape on how to stop it. However, corporal punishment has been banished....\n\n"
    },
    {
      "time": " 14.Jan.2007 1.03pm",
      "content": "You’re right Jackie, there are many forms of child abuse which are institutionalized, tolerated, and fashionable.  \n\\*\\*\\*\\* is less harmful to animals than killing and eating them, or performing chemical experiments on them, but it’s illegal. In the UK that’s a recent law, and the UK has a strong animal rights subculture, so perhaps it’s a step in that direction.  \nAlso, Green policy favours vegetarianism.\n\n"
    },
    {
      "time": " 14.Jan.2007 1.38pm",
      "content": "I am glad I have seen the Leni Riefenstahl films - I don’t care to look at Hitler’s artwork - I don’t have a problem with Mr. Gill’s fonts - I have a problem with WalMart.\n\nLife is not a tidy affair…\n\npeace\n\n"
    },
    {
      "time": " 15.Jan.2007 12.26am",
      "content": "\\>Neat article\n\nDan, that series of articles has such an obvious agenda that I truly doubt that they are, in terms of an accurate history, worth the reading.\n\nTim\n\n"
    },
    {
      "time": " 15.Jan.2007 12.38am",
      "content": "Oh, they are ridiculously biased. Yet I still found them a bit informative, when you cut out the clutter. Plus, the text is just a hoot!\n\n"
    }
  ]
}
