{
  "id": "30288",
  "title": "(x) Wired Magazine body type - Freight Micro {Tamye}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "In the most recent issue of Wired, I saw this sexy font used in most of the body copy ... and being in the process of designing a magazine myself, I’m trying to figure out what it is.\n\n ![](http://web.archive.org/web/20090826041921im_/http:/typophile.com/files/text_5764.jpg)\n\nThanks all !\n\n",
  "author": "<a href=\"/web/20090826041921/http://typophile.com/user/16019\" title=\"View user profile.\">ström</a>",
  "time": "<br>",
  "uid": "16019",
  "comments": [
    {
      "time": " 2.Jan.2007 7.28pm",
      "content": "The universe is doing a mindmeld thing... James “Jimmy G” Grieshaber and I were just talking about this very thing a couple of days ago.\n\nThat would be the lovely and talented Freight Micro by our pal Josh Darden.\n\n[www.joshuadarden.com](http://web.archive.org/web/20090826041921/http:/www.joshuadarden.com/ \"www.joshuadarden.com\")  \n [http://www.joshuadarden.com/shop/freightmicro.php](http://web.archive.org/web/20090826041921/http:/www.joshuadarden.com/shop/freightmicro.php \"http://www.joshuadarden.com/shop/freightmicro.php\")\n\nFreight has many weights/variants, and all make for yummy pub design.\n\n"
    },
    {
      "time": " 2.Jan.2007 8.15pm",
      "content": "Freight is nice, i especially like the sans.\n\nJust out of curiousity, why is the sample (on his website) set in Dutch?\n\n"
    },
    {
      "time": " 2.Jan.2007 8.54pm",
      "content": "Just for the fun of it, I suppose. Also, the Netherlands is widely considered a type design center of the world.\n\nCongrats to Joshua for another high profile use of Freight.\n\n"
    },
    {
      "time": " 3.Jan.2007 2.45am",
      "content": "I salute Joshua too. Freight is great for magazines, and I’m sure others will follow.\n\n"
    },
    {
      "time": " 3.Jan.2007 3.59am",
      "content": "Wired certainly used to include cover notes on the faces used along with the exact models of scanners and Macs – do they no longer do this?\n\n"
    },
    {
      "time": " 3.Jan.2007 9.38am",
      "content": "I don’t see any cover notes = / I would have felt right silly if there had been any .\n\nMy oh my, all of Freight’s faces are very nice. Too bad I’m broke, and without enough client work to get the 5-computer license. Anyone know how I could just pick up the individual weights ?\n\n"
    },
    {
      "time": " 3.Jan.2007 12.36pm",
      "content": "ström, the per-font pricing for Freight within the packages is a great deal, but I know sometimes it’s hard to swing a whole family... you could try contacting Josh and/or his Freight publisher, Ralph Smith at Phil’s Fonts/GarageFonts about your project specifics and needs. They are both super nice guys and great to work with.\n\nRalph \\> info [at] philsfonts [dot] com  \nJosh \\> use contact form at [https://www.joshuadarden.com/contact/](http://web.archive.org/web/20090826041921/https:/www.joshuadarden.com/contact/ \"https://www.joshuadarden.com/contact/\")\n\n"
    },
    {
      "time": " 3.Jan.2007 6.28pm",
      "content": "Oh, that is a nice face indeed. The sans version, especially.\n\nAnd for the specimen he used a very old style Dutch. Quite funny to see.\n\n"
    },
    {
      "time": " 3.Jan.2007 8.08pm",
      "content": "Can anyone suggest a header font for this?  \nAlso another option or a “close substitute” from linotype, monotype or bitstream for this font?\n\nthanks  \nIt’s a beauty:)\n\n"
    },
    {
      "time": " 3.Jan.2007 8.32pm",
      "content": "[Freight Display](http://web.archive.org/web/20090826041921/http:/www.joshuadarden.com/shop/freightdisplay.php?PHPSESSID=11e67e2bed16ad39ce8e096fb06da102) and [Big](http://web.archive.org/web/20090826041921/http:/www.joshuadarden.com/shop/freightbig.php) were designed specifically to sit atop Freight Text.\n\nThere are no close substitutes for the Freight serif fonts. It really is in a class of its own. I could drum up a few for the sans, though. I take it you own library CDs from those other foundries?\n\n"
    },
    {
      "time": " 6.Jan.2007 1.28am",
      "content": "Speaking of Wired’s typefaces... Whatever happened to Carter & Cone’s custom variation of Walbaum for Wired called “Wiredbaum”? The magazine stopped using it in a redesign years ago, but the typeface hasn’t turned up since, even though it still looks great.\n\n"
    }
  ]
}
