{
  "id": "30291",
  "title": "Please critique non-profit design group logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi Typophiles,  \n I’m building a design firm that caters exclusively to non-profits. I’ve had little time to develop a logo, but this is what I have so far. I’d really appreciate any critique or advice; or even feedback on the company name.  \nThanks!  \nAlaskan\n\n ![](http://web.archive.org/web/20080827234209im_/http:/www.typophile.com/files/zenapse_4447.jpg)\n\n [‹ Church Identity Starting Point](http://web.archive.org/web/20080827234209/http:/www.typophile.com/node/30295 \"Go to previous forum topic\") [A logot-type need a pro's advice/critques ›](http://web.archive.org/web/20080827234209/http:/www.typophile.com/node/30246 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080827234209/http://www.typophile.com/user/15843\" title=\"View user profile.\">Alaskan</a>",
  "time": "<br>",
  "uid": "15843",
  "comments": [
    {
      "time": " 2.Jan.2007 10.06pm",
      "content": "What is it about this design that’s supposed to relate to working with non-profits? Right now it looks like something I’d see on the cover of the menu at a very expensive restaurant.\n\nIt would definitely benefit from tighter spacing. Between the gaps and the wide counters this one looks so delicate that it could blow away in the wind.\n\n"
    },
    {
      "time": " 2.Jan.2007 11.14pm",
      "content": "First of all, what are you trying to convey with the design?\n\nDesign-wise, are you going to align the word “design” with “zenapse”? The letterspacing might still work (problem pairs like s–e do still exist, though), while the wordspace, definitely not.\n\n"
    },
    {
      "time": " 3.Jan.2007 8.30am",
      "content": "Good eye, brampityo. The alignment is off by mistake - a function of playing around too much. Thanks for noticing. I’ll fix it.\n\njpad - Thanks for your thoughts; perhaps I should elaborate on the company. I want to convey elegance and professionalism; not granola and tie dye. Too many non-profits present an image of unrefined, sophmoric disorganization, this is not a service I intend to provide. I’m thinking yoga culture, not music festival card table marketing. I want to make the little guys look grown up — to appeal to the corporations that they target for fundraising, ideally.\n\nAlaskan\n\n"
    },
    {
      "time": " 3.Jan.2007 2.43pm",
      "content": "Don’t make the logo do the work when the website and collateral should. Don’t make it so arty if you want to come across as a serious designer. Make it straight forward, strong, not weak and femine as it is now.\n\n"
    },
    {
      "time": " 3.Jan.2007 4.14pm",
      "content": "Thanks for the imput, and I was about to take it seriously ... until the last sentence. I deeply resent the implication that feminine is weak.\n\nI suggest you make your critique straight forward, strong and not weak and offensive as it is now.\n\nAlaskan\n\n"
    },
    {
      "time": " 3.Jan.2007 7.34pm",
      "content": "I see where you’re coming from, but I still don’t entirely understand the concept. Is the abstract icon a group of people? I can see how once the type is tweaked it will stand on it’s own just by being gorgeous, but I get a little lost when the icon comes into the picture.\n\nFWIW, I don’t think that the design comes across as feminine or weak.\n\n"
    },
    {
      "time": " 3.Jan.2007 9.25pm",
      "content": "Nicely put ’Alaskan’ (E). I can sympathize readily with your reading of what Dan was saying. It is deplorable and not helpful of descriptive to say weak & femenine at the same time. It’s an old trope that’s hard to get rid of.\n\nBut I would rephrase what I am guessing Dan probably meant. Somewhere in there he has a point. Your prospective logo is fairly complicated - it pulls in several different stylistic directions with the roccoco text and the techy tree things. It isn’t focused. Your cleints will want to see that you can offer focus. What with all the disorganization ( too right about that by the way - too right) of orgs this is not a small issue. This logo looks arty not organized. This logo looks individual not organizational. Looking at this design I would have thought that zenapse was a store that sold candles jewelry and so on. In other words neato-cool clutter. I would nver have guessed it was a design studio geared towards helping ’little guys grow up’ and develop a focused professional image and or message.\n\nAlso, the name is ideosyncratic and individual rather that accessable and results oriented. I don’t think Alaskans or anybody else will recall this name nearly so quickly as even something utterly rediculous such as ’pink poodle design’. Of course my point isn’t that you should name yourself ’pink poodle’ per se. You should choose something easy to recall and which resonates in the \\*right\\* way. The question is as Bram asks <cite> what are you trying to convey with the design? </cite>.\n\nI hope this doesn’t sound harsh. Re-reading the thread I see that my comments are similar in direction to what jpad & Bram were saying even if they were less direct or more polite. BTW I am an Alaskan too. Feel free to email me off Typophile to chat if you want.\n\n"
    },
    {
      "time": " 3.Jan.2007 9.27pm",
      "content": "I think the design does feel feme. Just my take. I think a gender neutral impression would be more effective.\n\n"
    },
    {
      "time": " 3.Jan.2007 9.33pm",
      "content": "Thanks, jpad, I appreciate the comments. The abstract icon was originally a group of trees. Perhaps I went too far on the abstraction, eh? I agree the type needs some tweaking (especially the s-e) and now I think I’ll rethink the icon altogether. I may just go with the logotype, sans icon.\n\nBTW, I’m ok with feminine - women are often the founders of non-profits - and I’m glad you don’t see “weak”. Neither do I.\n\nAlaskan\n\n"
    },
    {
      "time": " 3.Jan.2007 9.44pm",
      "content": "Well put, Eben, I get a lot of what you’re saying about the name. The name is a combination of Zen and Synapse ... but it’s not obvious. I meant to convey “we are one with intelligent design,” but since the phrase “intelligent design” has been hijacked by right-wing-evangelists, it’s NEVER a phrase I could use.\n\nI think I need to go back to the drawing board - ’cause if you guys don’t read what I’m writing, well, then I have a real problem.\n\nAlaskan\n\n"
    },
    {
      "time": " 3.Jan.2007 11.01pm",
      "content": "Before you go back to the drawing board, make sure to define your problem and intent well enough. If done properly, the visual will not be very hard to execute.\n\nFor instance:  \n<cite>I want to convey elegance and professionalism; not granola and tie dye.</cite>  \nThere are many kinds of elegance and professionalism. Elegance as in a graceful, refined taste? Or as in a pleasingly ingenious, often humble solution? Professional in a business/corporate sense, or in a masterfully executed project that can be done by everyone?\n\n<cite>I’m thinking yoga culture, not music festival card table marketing. I want to make the little guys look grown up — to appeal to the corporations that they target for fundraising, ideally.</cite>  \nI love these statements because you moved from the generals (x kind of marketing) to the specifics (yoga culture, not music festival). See if you can find more answers to the question: “Zenapse is x rather than y”. The more you have, the better, because it’ll eventually help you to see the agency and visualize its identity and personality.\n\nOf course, if you can justify the current design for Zenapse, I’ll have a listen. In my opinion, you got “fashionable/elegance” down. For “non-profit”, though, you have to explain it visually to me :-)\n\nThanks!\n\n"
    },
    {
      "time": " 4.Jan.2007 5.45am",
      "content": "post the logo again, black on white.\n\n"
    },
    {
      "time": " 4.Jan.2007 6.57am",
      "content": "Presently I feel there is a problem with the lettering the s seems too tall and the bottom stroke wanders a little too far; the counter of the p (compared to the a) seems too small, altering this will almost certainly mean altering the d; the n could be a little wider; the i is a bit insubstantial (this could be a result of the tracking) and the g’s ear is a little bit rigid.  \nThe trees look like they should be moved left a little to centre over the e and aligned better, although they are drawing attention to zen and leaving apse to its own devices.\n\nTim\n\n"
    },
    {
      "time": " 4.Jan.2007 8.34am",
      "content": "E, did you design those letters?\n\n"
    },
    {
      "time": " 4.Jan.2007 6.39pm",
      "content": "I’m attaching some comps in black and white, as requested. I tweaked the kerning somewhat, and I think (?) it helps the counters. Looking now, I think both the es’s need to go smaller - or the ee’s bigger?\n\nEben - I wish I’d designed the letters! The font is called Londonderry; but it’s a knock off of a font I can’t afford right now called Canterbury Old Style - one of my favorite fonts.\n\nBram - As far as defending the non-profit angle, I guess my thoughts are that I want to APPEAL to them - not BE a non-profit. I want the director of a women’s shelter to visit the website and think “wow, I never thought we could afford this design firm. I can’t believe they offer a sliding scale.” I don’t want to project religion, organic superiority, grassroot-iness, corporate slicksters or clip art hell. So what I see is arty elegance; it’s what can be done on a budget. Black and white infrared photos on taupe fibery paper with reserved text, as opposed to leaf and handshake clipart on high gloss with bullets and comic sans. Mostly, I don’t want that kind of clientel; I want to offer professional design to nonprofits that know they’ll benefit from it - not spend hours trying to convince some shmoe why NOT to use WordArt to warp their logo into a arch to fit in a rainbow. I want the logo to say arty, I guess, because that’s my target market. I guess I want WordArt rainbow guy to think it’s pretentious :)\n\nI seem to be rambling.\n\nAlaskan\n\n ![](http://web.archive.org/web/20080827234209im_/http:/www.typophile.com/files/zenapse_comp_4635.jpg)\n\n"
    },
    {
      "time": " 4.Jan.2007 7.21pm",
      "content": "If the ’p’ didn’t have the dots above, I would find #2 quite charming.\n\n[Choz Cunningham](http://web.archive.org/web/20080827234209/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20080827234209/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20080827234209/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": " 4.Jan.2007 8.53pm",
      "content": "Choz - I think you’re right. Anybody else like #2 ?\n\nAlaskan\n\n ![](http://web.archive.org/web/20080827234209im_/http:/www.typophile.com/files/zenapse_comp2_3983.jpg)\n\n"
    },
    {
      "time": " 5.Jan.2007 8.54am",
      "content": "Yeah, the new #2 seems to work well. Definitely my favourite so far.\n\n- Lex\n\n"
    },
    {
      "time": " 5.Jan.2007 9.22am",
      "content": "I still think the quality of the lettering is letting this down, the e and s in particular.\n\n ![](http://web.archive.org/web/20080827234209im_/http:/www.typophile.com/files/b49619770b7a179c3758ae5efd344fdf_3517.png)\n\nTim\n\n"
    },
    {
      "time": " 5.Jan.2007 11.39am",
      "content": "To define why I like the new version better, the phrase ’zen’ invokes a less-is-more approach in my mind, and when there is a made up word, it needs little else around it to make it distinct. There is probably some philosophical insight that can be read into using the 3 dots, one of which is natural to the ’i’, but I can’t quite come up with it. Overall, it looks light, in a goodness/uplifting way.\n\nIf you are using the Adobe apps, I would suggest playing with the inherent (metrics) and calculated (optical) settings, Tim has the right sense on the spacing. And with less graphic froo-froo, that becomes very important.\n\nLogo aside, about the face: Does anybody else here feel that the lower stroke of the ’g’ should flow more smoothly from the bottom left of the circle? Or, that the end of that stroke should point more towards the center again? I haven’t seen more of the face than this example, but it seems odd.\n\n[Choz Cunningham](http://web.archive.org/web/20080827234209/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20080827234209/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20080827234209/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": " 5.Jan.2007 12.03pm",
      "content": "I should have made it clear that the sample is set in Canterbury Old Style from myfonts.com, I feel it is a shame that the knock-off is of poor quality.\n\nTim\n\n"
    },
    {
      "time": " 5.Jan.2007 1.38pm",
      "content": "Thanks gang for all your imput; I truly needed more eyes on the design. I’m starting to explore a subtle Arts and Crafts/William Morris feel to the logo - I’ll post more comps soon.\n\ntimd ~ I think I’ll find a way to buy Canterbury Old Style and use that instead. It’s considerably better - especially the s and the e; but the g is so gorgeous it’s worth the budget stretch. The a and the p — and all the counters — are also much more balanced in Canterbury.\n\nAK\n\n"
    },
    {
      "time": " 5.Jan.2007 5.03pm",
      "content": "The thing about ORGs is that they are graphically naive as you have deduced. And that means that when they see your web page they are going to assume that you prefer that style to work in ALL the time. Which it sounds like you don’t. So I think it might behoove you to build your identity & web pages look around the graphic & editorial values you want to offer them. If it was an ad agency or some kind of other graphically saavy entity you wanted to communicate with you would be freer to represent yourself in a way seprate from the work you want to offer.\n\n"
    },
    {
      "time": " 5.Jan.2007 5.35pm",
      "content": "Love the tree dots on the **i**. It’s tongue-in-cheek but still project the image of high taste.\n\n"
    }
  ]
}
