{
  "id": "30295",
  "title": "Church Identity Starting Point",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I am the associate pastor at the First Presbyterian Church of Ukiah, CA and was brought on to work with youth and families and revitalize the congregation's aging population. Step #1 was get a website with a reasonable, simple design, and a logo to suit it.\n\nSo I have started with this design concept, but am wondering what would be some helpful directions I could take with it (including start over).\n\nAn explanation of the design:\n\nThe celtic cross is the centerpiece of the church's architecture.  \nThe five \"lines\" mimic the roofline of the church. They also represent the five values of our congregation taken from our purpose statement.  \nThe blue and green represent the natural landscape of Ukiah, which is an agricultural community in Mendocino County in Northern California.\n\nA tension I am also trying to convey:  \nThe piece is attempting to convey a sense of simplicity because many of the folks here resonate with traditional values.  \nI am also trying to communicate a slightly progressive tone, since Ukiah is also a young community located in wine country that values organic/sustainable living.\n\nPlease let me know what you think with frankness and forthrightness. I am an amateur but very teachable.\n\n| Attachment | Size |\n| --- | --- |\n| [fpcu logo.jpg](http://web.archive.org/web/20131023141001/http:/typophile.com/files/fpcu%20logo.jpg) | 13.52 KB |\n\n",
  "author": "nvhladek",
  "time": "2 Jan 2007 — 11:41pm",
  "uid": "16005",
  "comments": [
    {
      "time": "3 Jan 2007 — 12:50am",
      "content": "Hire a professional.\n\n"
    },
    {
      "time": "3 Jan 2007 — 2:24am",
      "content": "Seconded.  \nAlso, i'd rethink using the celtic cross as a starting point, as it has a strong association with racism, white power etc., and i don't think that's what you want to communicate in the first place?\n\n"
    },
    {
      "time": "3 Jan 2007 — 5:38am",
      "content": "G'day Nick,\n\nAnnoying, lost my long post due to my dial-up dropping out.\n\nAnyway, hey my name's Nick and I go to a presbyterian church and I am on typophile too, cool.\n\nI can't bear to write as I did the first time so I'll try and hit the high points: you said your MO was simplicity but unfortunately I have to say this logo looks quite abstract and convulted: you have sky + grass + cross + church pire + 5 steps + thick black lines.\n\nTry picking one of your concepts and just going with that, forget the rest, a logo doesn't need to symbolise all your church is, it is just a mark that identifies you, it is not necessary to try and put all your vision statement in there.\n\nUse your concept (for eg: cross) as a jumping off point, make associations, follow the creative process, try lots of variations, it doesn't need to have a 1:1 relationship with your concept (church:image of church)try formal/literal/symbolic/expressive approaches. Most important thing is keep it very strong and very simple. When your concept gets tired and you have nothing you like, try a different concept and start again. This is very frustrating but I think there's no easier way. One of the simplest things that I did was to buy a cheap pad and use lots of paper without worrying about how much I was wasting.\n\nOh also, someone else wisely said don't design logos in colour, it makes you rely on colour for meaning, distracting you from the more important issues of form and structure.\n\nIf the celtic cross symbolises white-power, perhaps this is a good reason to ditch it, but perhaps there may be a way of rendering it so these associations arn't made, I'm not sure, that was news to me, thanks Franzheidl for that info\n\nIt is time-consuming to produce a successful logo. It might be worth investigating hiring a professional; it probably won't cost as much as you think, you're not IBM wanting a corporate ID update, the designers won't (shouldn't) charge you as if you were.\n\nhope this help\n\nNick\n\n"
    },
    {
      "time": "3 Jan 2007 — 6:48am",
      "content": "You are asking the logo to represent way too much literally. It's really hard to pull something like that off.\n\nAs stated by others, simplify, simplify, simplify...\n\n"
    },
    {
      "time": "3 Jan 2007 — 9:11am",
      "content": "j\\_polo9: I would love to hire a professional, but my budget is exactly $0. I should have mentioned that.\n\n"
    },
    {
      "time": "3 Jan 2007 — 9:16am",
      "content": "franzheidl: No, I definitely do not want to communicate racism/white power with my logo, but I too am wondering where you are getting this white power association with the celtic cross.\n\n"
    },
    {
      "time": "3 Jan 2007 — 9:23am",
      "content": "nicholasgross: Thanks for your feedback. I will take your advice into account.\n\nWould be appropriate / in line with typophile etiquette to post some other concepts I have once I develop them?\n\nMuch appreciated.\n\n"
    },
    {
      "time": "3 Jan 2007 — 10:08am",
      "content": "Of course keep posting new concepts! Although having a zero doller budget for something as important as your churches identity is rather ill founded.\n\nEven if you had a small budget you might be able to get someone in your church who is practiced in graphic design to create something for you. Or even appeal to your highschool aged group and have any artistic ones among them come up with sketches...\n\nMy advice would still be to stop. Get a budget. Hire a professional. Your identity is extremely important. Even making a temporary logo for the moment and changing it later is a waste and shows lack of foundation. Unless you are going for the whole build your house on sand metaphore...\n\n"
    },
    {
      "time": "3 Jan 2007 — 10:45am",
      "content": "To some people the Cross represents the plague of humanity, others Salvation. I wouldn't change my design based on pseudo-intellectual banter. People will hate Christianity no matter what 'style' of Cross represents your fellowship.\n\n"
    },
    {
      "time": "3 Jan 2007 — 11:32am",
      "content": "[http://en.wikipedia.org/wiki/Celtic\\_cross](http://web.archive.org/web/20131023141001/http:/en.wikipedia.org/wiki/Celtic_cross \"http://en.wikipedia.org/wiki/Celtic\\_cross\")\n\nI was unaware of any far-right connotation too, wikipedia agrees with Franz though, especially as far as the simplified version goes, maybe it is a mainland European thing. You could look at a more traditional celtic cross shape with heavier strokes for the crossbars than the circle, maybe to the extent of including the circular cutouts on the horizontal and vertical.\n\nOn the other hand a simple wordmark could do the job, I would tend to avoid the rather obvious and ubiquitous script and look at something solid and reliable like Clarendon or Joanna combined with a colour can produce an attractive identity for your target demographic.\n\nTim\n\n"
    },
    {
      "time": "3 Jan 2007 — 12:34pm",
      "content": "Is there a graphic designer in your church? I've developed several identity systems for churches. If there is a designer in your church, he or she might love to do the work pro bono. Most creatives I know in churches would rather do it for the church pro bono than see it done badly by a non-professional.\n\n"
    },
    {
      "time": "3 Jan 2007 — 12:34pm",
      "content": "Yes, probably it's more of an european thing to associate the celtic cross with the far right, especially when used in it's basic form without any ornaments it is not only associated with, it literally means white power/supremacism over here – but i have also seen american nazis with celtic cross tattoos. I just wanted to point that out, as you might want to tread careful in that respect. If that association isn't a big issue in the US – fine.\n\nOn a completely different angle, using a cross (no matter if celtic or not) for a church identity just as it is seems a bit too obvious for me, as does the usage of iconicised architectural forms. That may well work for places like the Empire State Building, the Brandenburg Gate, etc. but in general it usually appears in institutional identities where, in the design process, nothing better could be agreed upon, especially when too many people where involved.  \nI'd recommend to rather try to have a go along the five values of your congregation, and derive a much simpler, more abstract solution. Probably even type only.  \nAnd forget about light blue and green, grass is green and the sky is blue – everywhere.\n\n"
    },
    {
      "time": "3 Jan 2007 — 1:51pm",
      "content": "The solution to this particular graphic problem is to hire a professional. How you find the money to do so constitutes a separate problem altogether.\n\n"
    },
    {
      "time": "3 Jan 2007 — 2:15pm",
      "content": "I really wonder if an identity is that important for a church, will having a recognisable individual presence improve its perception by a prospective congregation? It could be said that any money which is expended on creating an identity could be better spent, and since it has been said that there isn't a budget for it, maybe it would be more productive to offer Nick some advice that he can act on. The alternative might be that he decides to visit a Logos R Us website or worse buy a logo from e-bay like the guy creating a pizza site did.  \nTim\n\n"
    },
    {
      "time": "3 Jan 2007 — 2:25pm",
      "content": "<cite>People will hate Christianity no matter what ‘style’ of Cross represents your fellowship.</cite>\n\nTo some the stench of death, to others the scent of life.\n\nYou're absolutely right, but it's good to narrow the options down so people are hating the cross and what it represents rather than white-power. It isn't pseudo-intellectual to discard a symbol based on possible wrong connotations, in the same way I would never use the typically australian [Southern Cross flag](http://web.archive.org/web/20131023141001/http:/en.wikipedia.org/wiki/Eureka_Flag) image, strong and potent as it it is, because of what it has come to also be used for.\n\nI like the idea of hiring a graphic designer in the chuch; they're eveywhere and mostly love to do it for free, especially if they're young and wanting the experience,\n\n--N\n\n"
    },
    {
      "time": "3 Jan 2007 — 10:37pm",
      "content": "Hey nvhladek , okay I'll speak frankly...\n\nYour congregation should gather up a mercy collection and hire a graphic designer for their own self preservation, and keep you far away from any design software. Don't tell me they can't do that, all you have to do is be honest with them and tell them you'll be doing the church harm by producing the graphic representation of their concerns, ok?  \nBut having said that, and having studied your composition, you have given me an insight into how you personally understand 'the body of Christ' as represented in your graphic form, as it relates to society at large.\n\nLet's get past the obvious pleasant statements, that your effort is 'crude' or 'unrefined', and take a good look at the elements of your graphic understanding, ok?\n\nThose five black heavy segments drag the eye down, and therefore drag the spirit down. And although that central whatever it is, cuts/divides the canvas all by itself - those heavy black elements impose an overall dark downward force. I don't get that they are supposed to represent anything other than a deep heavy handed downward force, which by the way dominates the whole composition.\n\nAnd that central thing which divides the canvas in two, does not unite the canvas - it cuts the canvas complete with a blunt point. And it's heavy black outlines further represents an exclusion and not an 'inclusion'.\n\nThe gradients have two separate light sources which further enhances your confusion, although it is interesting to note that you tried to impart a lower right light source. Perhaps to balance off all that oppression? Which by the way, could be the most interesting (and natural) area of the entire effort.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "4 Jan 2007 — 12:58am",
      "content": "_Those five black heavy segments drag the eye down, and therefore drag the spirit down._\n\nDo you really believe that?  \nWould it therefore be uplifting if the steps/roof went in the opposite direction?\n\nAll this talk about hiring a graphic designer raises another question, how does one know that one has hired a 'good' designer? How can one make a choice when shown three options (I suspect the answer is that it would come down to familiarity, use of a favoured colour or some other way of breaking down a visual, looking for an element that one feels comfortable with approving and choosing that)? It is not as if there is an opportunity to form an in-depth relationship between client and designer for a short term project like this.\n\nWhich brings me back to my previous post, would a church be better served by a website that is well laid out without a logo than taking a chance on an under-developed appreciation? My opinion is that a poorly designed/chosen/executed logo is worse than no logo.\n\nTim\n\n"
    },
    {
      "time": "4 Jan 2007 — 3:14am",
      "content": "Budget: You could find a designer who is willing to donate his/her time. A lot of designers give their time to causes they can get behind. Having no budget doesn't mean you have to do it yourself. (Which, by the way Hiroshige, is what this thread has become... designers giving consultation for free. But you just might get what you pay for. =)\n\nDesign: Others have suggested simplifying... If there is something \"on brand\" about the Celtic cross as it relates to Presbyterianism then stick with it, but simplify the grass, sky, steps, border thing. (Is the Celtic cross similar to the the Lutheran cross w/ flame design is very recognizable?)\n\nAnyway, all that aside, you may want to just select a nice, classically rendered serif typeface as a logotype in lieu of a logo mark. (Which is similar to what Timd is suggesting.)\n\n"
    },
    {
      "time": "4 Jan 2007 — 7:02am",
      "content": "\"Your congregation should gather up a mercy collection and hire a graphic designer for their own self preservation, and keep you far away from any design software.\"\n\nOh please.\n\nIt's \\*JUST\\* a logo. We graphic designers take ourselves a tad too seriously at times...\n\n"
    },
    {
      "time": "4 Jan 2007 — 10:53am",
      "content": "Re the Celtic Cross - if it's part of the church's architecture, then go ahead and use it. Nobody will associate a Celtic Cross on a church with White Supremacy.\n\nAs for the logo itself, I agree that it is much too busy. Furthermore, constraining it in a square does not convey openness, which from your description is what you probably want. Another very important factor in this will be your use of type with the logo.\n\nMy suggestion: Take out the black square, the five black shapes, and the green and blue gradients. Work with just the central Cross shape and try different ideas (e.g. make the three vertical lines different lengths or play with negative space in the centre of the Cross). Do all of your sketching by hand, not on the computer.\n\n- Lex\n\n"
    },
    {
      "time": "4 Jan 2007 — 11:23am",
      "content": "_Do you really believe that?  \nWould it therefore be uplifting if the steps/roof went in the opposite direction?_\n\nComposition should move the eye throughout a work, and each element should lead to the next (same theory for sound type design?). A lot of religious compositions use a triangular scheme, but there are many many other schemes which have their own characters.  \nThe triangular theme is most common in regious art is because a firgure and it's subserviant elements thereof are for the most part centrally placed, which imparts a feeling of stability/solidity. But, if that central element is impacted by a heavy diagonal which cuts across the entire format (in this case a squarish format), then conflict is the result.\n\nSound composition is everything, without it the message is lost. And when the composition has been settled, rhythm has a chance. Rhythmic unity is a major part of any sound composition, but when a rhythm is heavy and uniform it is seen as repetitive to an extreme, like those five heavy black elements.\n\nThe celtic cross and the five elements which give your congregation their unique character are the starting elements of your composition - stop trying to tie them to crap architecture. They can stand on their own.\n\nJoe, you're so right...\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "4 Jan 2007 — 12:00pm",
      "content": "Hiro,  \nI understand and appreciate composition and I agree with you about the five steps, my real question was whether a composition that dragged the eye down would drag the spirit down and whether the opposite was true.  \nTim\n\n"
    },
    {
      "time": "4 Jan 2007 — 11:01pm",
      "content": "Graphic design can greatly enhance a church's ability to communicate but they do not need an identity to survive.\n\nIf you don't have a budget, how will you pay for web hosting, brochures, printing a 4 color logo, shipping, etc? That is like saying.. \"I need a car. Where can I find a free car? Maybe I will make one.\"\n\nAlso think of it this way: You don't have the budget to do it incorrectly.\n\nYou might try going online and finding a presbyterian congregation whose identity you like, and ask them for assistance.\n\n"
    },
    {
      "time": "4 Jan 2007 — 11:29pm",
      "content": "You could say that any company or organization does not need an identity to surive, that is not the point nor is it wise. Lack of an identity is still part of your identity, it just shows rather poorly for your organization.\n\nCertain social views hold aesthetics as useless and might condem the use of church funds where they might be spent with more \"meaning\" in other areas. But people forget that Aesthetics is the philisophical branch that is tied in with Ethics and should achieve many things to do good for the church that can only be done Aesthetically.\n\nWith so many religions and branches and competing branches of these churches the right identity can set apart this particular church with it's values and goals; it can create a road map for the success of the church and inspire new members to attend. It seems fairly odd that many churches would spend whatever it takes to build or rent the right building for their congregation but view their actual identity as superficial and not worth paying for when it is actually one of the most vital things it can have.\n\n"
    },
    {
      "time": "5 Jan 2007 — 12:44am",
      "content": "The funny part about this whole discussion, for me, is many of you tell this wellmeaning preist that he should find someone to do pro bono work for him, but nobody actually offers their help. And it seems to me that all the time you super experts use on this discussion and website shows me that you could easily find time do a better logo for the man...\n\nTo quote Milinium; \"It’s \\*JUST\\* a logo\"! And it is - just ONE logo...\n\nDear mr. nvhladek. If your not in TOO much of a hurry and don't mind working with designers overseas - write me an e-mail and we'll see if we can help you... pro bono - OFCOURSE! :o)\n\nWe love beautiful things  \n [mark@enterthemark.com](mailto:mark@enterthemark.com)\n\n"
    },
    {
      "time": "5 Jan 2007 — 3:38am",
      "content": "The curious thing I have found in doing work for free is that I always seem merely to be giving the mouse a cookie...\n\nAnd in most instances, if a person does not value the work enough to pay for it then what value will he find in it being done for free?\n\n"
    },
    {
      "time": "5 Jan 2007 — 4:16am",
      "content": "good point, **j\\_polo9**!\n\n"
    },
    {
      "time": "5 Jan 2007 — 6:09am",
      "content": "The value of helping people is for me, pretty valuable and if a person does not like my work..well I never take that personal - its all a matter of taste. But if I have some spare time I would rather help somebody than scrath my ego. Besides - it's all learning and getting better.\n\nOne can never make a 100% on each asignment and it's not the biggest payoffs that made me happy... It's the coolest job and the happiest of clients...\n\nBut lets not use this forum about a logo for this kind of discussion, huh?\n\n"
    },
    {
      "time": "5 Jan 2007 — 6:59am",
      "content": "As for offering help, it seems to me there is still a conceit that design is a ‘guild’ industry that a professional will necessarily achieve a _better_ result than an enthusiastic amateur, one will probably be quicker than the other and, hopefully, have avoided some of the pitfalls, however anyone who has access to even a basic computer can create. And, if someone has taken the trouble to come up with a concept and sought help or critiques, then I am happy to advise them.\n\nTim\n\n"
    },
    {
      "time": "5 Jan 2007 — 9:15am",
      "content": "\"Oh please.  \nIt’s \\*JUST\\* a logo. We graphic designers take ourselves a tad too seriously at times…\"\n\nI take it very seriously.  \nThe fact of the matter is computers have been put into the hands of everyone and it has become quite damaging to design.  \nI think everyone here can relate stories about clients who are \"empowered\" by their PC programs.\n\n"
    },
    {
      "time": "5 Jan 2007 — 10:12am",
      "content": "The difference that I see, after reading this thread, is that people see things differently and there is NOTHING wrong with that. I applaud Mark for his desire to help where he can. He didn't use the word free when he offered to help which makes me believe that he sees the value in helping. If someone does think they'd be doing it for free then they don't see the value that can be had in doing probono. BUT, that is OK. Not everyone can do everything, nor does everyone have TIME to do everything.\n\nIt isn't just a logo. Nick posted on Typophile seeking assistance and suggestions. He sees value in what Typophile has to offer. Why is that not enough to take it seriously?\n\n"
    },
    {
      "time": "5 Jan 2007 — 1:35pm",
      "content": "\"I take it very seriously.  \nThe fact of the matter is computers have been put into the hands of everyone and it has become quite damaging to design.\"\n\nIt hasn't damaged anything. People are designers. It's what makes us people. Everyone does it. Always have, always will. Some of us just happen to focus on it and make a living at it.\n\nNow, I'm not saying a logo isn't important, but in the grand scheme of things, there are often other much more important variables that come into play that effect the success or failure of the venture.\n\nIf nvhladek wants to make his own logo, that's not going to effect the motion of the planets or anything. If he wants advice on how to improve it, and we want to help him, we should.\n\nI just don't think we need to imply that he's committed some terrible sin by wanting to explore his own creativity.\n\n"
    },
    {
      "time": "6 Jan 2007 — 5:32am",
      "content": "What an interesting thread this has turned out to be!\n\n"
    },
    {
      "time": "6 Jan 2007 — 9:01am",
      "content": "<cite>I really wonder if an identity is that important for a church, will having a recognisable individual presence improve its perception by a prospective congregation? </cite>etc.\n\nSecond every single word, Tim.\n\nProbono and free are 2 different things as far as I know. Pro Bono Publico means \"for the public good\". Can a Presbiteryan Church (or any church for that matter) be considered a good cause? I confess the organic wine association is very tempting but I still think it doesn't qualify as a good cause. Not to me anyway.  \nBeing Italian I grew up very suspicious of churches, especially when they say they have no money. Hope this doesn't offend anyone.\n\n"
    },
    {
      "time": "6 Jan 2007 — 10:39am",
      "content": "The first thing I have to say, is WOW. I did not expect such a response to my posting of my (admittedly pokey) first attempt at designing a logo for this church.\n\nThe second thing I need to say is \"thank you!\" because your comments have been althogether helpful, even the most pointed and critical of them. I have \\*learned\\* about design through this discussion, and that is excellent. I have not been offended by anything I have seen posted here. I have benefited, in fact.\n\nThirdly, for those who have offered free advice, or follow-ups via e-mail addresses, I may contact you soon. It turns out that I have a graphic designer friend who has offered to consult with me as I blunder through the design steps, so I may be able to accomplish what I want with his assistance. But for others who offered, many thanks.\n\nTo tie up some other loose ends:  \nWhy do I not have any money to design a logo? Well, not to get too much into the nitty-gritty details of my congregation, but I am an associate pastor for a population in transition. The older congregants would not understand spending US$50 on designing an ID, nevermind that such costs could go into four digits. To ask the leaders in the church for hundreds, perhaps even thousands of dollars, for something as intangible as a logo ... I would be laughed out of the room.\n\nThe younger congregation, including our senior pastor, has the idea that you do it right the first time. But she and I have to hold in tension the fact that there are more pressing things we need to pay for in the church, such as new windows. So it's not that I don't value paying for good graphic design. It's just that I cannot wait five years to get to the point where I can ask for the money. At this point, we don't even have a WEBSITE. Not even a BAD website. So please understand where and how I am trying to lead this congregation.\n\nGoing back to the design, I know that my initial attempt did not \\*feel\\* right. I just didn't know \\*why\\*. So I figured if I were to post it in a place where people might take my design seriously enough even to say \"hire a professional,\" it just might be worth my while. And it certainly has been.\n\nI myself am in a profession where those who are the trained practitioners of the field can get the sense that they are the only ones who can properly administer their vocation. And in many senses, that's true. I know more about the Bible, about spirituality, about worship practices and about how to make Christianity practical than the average person in the pew. The whole philosophy of the Presbyterian \"flavor\" of Christianity, however, is that every member is a minister who has a place in the world to do some work for God. So my primary job, as my church understands it, is to help \"non-professionals,\" so to speak, do the work of ministry.\n\nNow the analogy will most likely break down here, but I hope you can understand how I am trying to put this principle into practice with graphic design. I am not a graphic designer by trade, but I fully will use people who are designers as guides to help my development in this area. Will I ever be a professional designer? Probably not. But could I produce a decent - not revolutionary - but decent product with the assistance of a community of designers? I would hope so. Now it may turn out that graphic design is not an egaltarian field such as my own. I leave that discussion to designers, however, since I have no desire to get involved in an \"in-house\" debate, so to speak.\n\nPeace to all of you who have lent your perspective.\n\n- Nick\n\n"
    },
    {
      "time": "6 Jan 2007 — 10:48am",
      "content": "Nick, just out of curiosity: how much would a job like this cost in your area? Just for the logo. Do you have an idea? Did you ask around in Ukiah? I'd be interested to know.\n\n<cite>It seems fairly odd that many churches would spend whatever it takes to build or rent the right building for their congregation but view their actual identity as superficial and not worth paying for when it is actually one of the most vital things it can have.</cite>\n\nNot odd at all. From the marketing point of view the logo is probably vital but having nice, comfortable, equipped premises for meetings and activities and a safe place to welcome families and young people is far more important to me.\n\n<cite>stop trying to tie them to crap architecture.</cite>  \nCrap architecture? Says who? Hiro, do you actually know what does the building represent for this particular community in that particular area? It might be historically important or it might have sentimental value. I don't think it's fair to dismiss it like that.\n\n"
    },
    {
      "time": "6 Jan 2007 — 11:03am",
      "content": "_I myself am in a profession where those who are the trained practitioners of the field can get the sense that they are the only ones who can properly administer their vocation. And in many senses, that’s true. I know more about the Bible, about spirituality, about worship practices and about how to make Christianity practical than the average person in the pew. The whole philosophy of the Presbyterian “flavor” of Christianity, however, is that every member is a minister who has a place in the world to do some work for God. So my primary job, as my church understands it, is to help “non-professionals,” so to speak, do the work of ministry._\n\nWith that paragraph you have already done the design.\n\nYou already know the major and minor elements of the design which give your congregation it's heart and unique character... and that above paragraph practically designs itself. And since I cannot teach you how to communicate with your church elders on the import of how you present yourselves within society - then I await your next half dozen rough drafts.\n\nGive a man a fish, and he will eat for a day - Teach a man to fish, and he will eat forever.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    }
  ]
}
