{
  "id": "30292",
  "title": "One colour sepia book examples?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "G'day Philers,\n\nI'm producing a short-run book based on personal correpondence which includes a lot of sepia-toned old photos. To keep costs down, we have (after much quoting and re-quoting) decided to go with a dark sepia colour for the entire book (something like: PMS 497) keeping the text the darkest tone and using the tonal variations for the photos, with an off-white/cream paper.\n\nI need to know what the job would look like done our way in one colour. I've just spoken with someone else who did a similar job and she was saying that photos she had in one colour ended up looking 'flat' and so she went with a duotone instead. Does anyone know of any exampes I could look at of this type of thing, or has anyone else done a similar thing and could tell me what the result was like?  \nAny help would be greatly appreciated  \nHappy New Year\n\n--N\n\n",
  "author": "nicholasgross",
  "time": "2 Jan 2007 — 9:02pm",
  "uid": "9500",
  "comments": [
    {
      "time": "2 Jan 2007 — 11:34pm",
      "content": "Is the paper uncoated, or coated? If uncoated (always my preference for anything with lots of text) the halftones will be a lot trickier to get right. Certainly a really high quality sheet would work -- here in the States I would spec something like Dulcet or Superfine to behave best on press, but even a lesser sheet such as Cougar Opaque has good enough formation to give you decent ink hold-out. I'd definitely work _with_ the printer on this one from beginning to end, to maximize the results you are after, and reduce chance for painful surprises.\n\nIf the photos are all old and have uneven dynamic range (and thus not a lot of detail in the three-quarter tones), I suppose you could try to have the pictures print a bit fuller down there in the dark end, risking plugging here and there in exchange for a bit more sheer weight and presence in the shadows. No doubt about it, though, a properly-done duotone is _always_ going to carry things off better than a single-strike halftone, simply because you have two passes of ink, one sealing up that sponge-y paper surface and allowing the other one to sit up on top.\n\nIf it is going on coated paper, my instinct tells me that there is even less chance of halftones looking okay, as they'll simply feel washed out. Even black halftones can look washed out. Weirdly enough, I'd venture that you stand a better chance of the pictures looking rich if printed on uncoated, by a really fine printer, than doing them with any printer on coated, just because the clay will let those tiny relief dots shine out in the shadow areas. If coated, and only one pass of ink, I'd plump for dull finish over silk or gloss (better for the reader reading the type anyway).\n\nUnless you are going with a really top-flight printer (here in the states it would be somebody like Stinehour), I'd also tend to use a slightly coarser screen ruling (maybe 150 lines per inch instead of 175 or 200) simply to gain the tiny bit of extra contrast in the pictures. (That would be 60 lines per cm instead of 70 or 80, yes?)\n\nAnd you say sepia: please look at the fanned sheets of your Pantone book and notice what happens to 497 as it pastels out (using the sheets is not a perfect means of predicting this, but it is a useful exercise). Basically you have 499 to which either K or transparent white has been added, and as you go toward pastel, you can see how very pinky-red the color goes. That is what your quarter tones are going to look like. I have often used 4625 for this kind of work, as it is almost as dark as an ink like 497, but its color feels more like what people _think of_ as sepia toning across the spectrum of darks to lights.\n\nDuotones would surely be safer if you could afford it, as they would give you more latitude on press, and more punch in your shadows and three-quarter tones.\n\nMy two cents anyway. With luck Patty and some of the other bookies will chime in with their instincts and experiences.\n\nAs for printed examples, visit your favorite paper merchant's sample room and see what you can dig up. Here in the States, in the old days you could have asked S. D. Warren's Idea Exchange for samples, but since they got bought out by Sappi I don't think that is running anymore. But there should be plenty of printed propaganda lying about from the usual suspects of paper mills to give you a sense of how it will look. (Do you guys get sheets imported from U. S. Mills such as Mohawk, Monadnock, Simpson/Fox River, or Weyerhauser?)\n\n"
    },
    {
      "time": "3 Jan 2007 — 4:49am",
      "content": "Wowee,\n\nThat is so comprehensive, you are very kind, thankyou.\n\nInteresting to see about coated and non-coated; from my scant experience I have noticed a propensity for coated halftones to look washed-out, I really want to avoid this if we go down the monotone path so uncoated seems the way to go.\n\nObviously I want to go duotone but the problem is that the photos are scattered tghroughout the book adding time and expense for using the second plate, also my printer gave me a bit of a scare saying that producing duotones is tricky getting the screen angles right etc, etc which would add more time/expense to my end of things. The price is getting up to the client's limit as it is, that's why I wanted to tie it down to one-colour, we thought it was a needless expense printing old sepia photos in 4-colour and perhaps slightly unnecessary/bit expensive to do the duos. Then again if the result are going to look cheapish we may need to re-consider (again... oh boy, there have been about 5 or 6 different quotes for this job and I've kind of tied the client down to the montone as being the best option for the money eeek! Who would ever work in print?).\n\nPoint taken about 497, I chose it quickly as an example for my post but I will definately look at 4625.\n\nI doubt we would import specialty papers from America for this kind of job, it really is a short-run job for an only \\*potentially\\* saleable personal book. We have a fairly big supplier here in Tasmania Spicer's Paper and they carry a \\*reasonably\\* extensive specialty line but again it just jacks the price up.\n\nThankyou again for such a well-considered and knowledgeable response, just the kind of thing I was after. Do you know of any books I could lay my hands on that demonstrate monotone/duotone only (not how-to books, just examples)?  \ncheers\n\nNick\n\n"
    },
    {
      "time": "3 Jan 2007 — 6:23am",
      "content": "_the photos are scattered throughout the book_  \nDepending on the binding and finishing, if you and the printer can work it out, you might be able to gang the images onto one or two folios and print them duotone, (btw and off-topic, a cmyk scan, desaturated, can produce a gorgeous sepia-like appearance).  \nPantone tint books show halftone representations (which are the same as a monotone) in a small scale, I don't know of a resource for duotones.  \nTim\n\n"
    },
    {
      "time": "3 Jan 2007 — 6:46am",
      "content": "A monotone print not in black will always have less contrast that if done in pure black. So chances are someone will see it as being a bit washed out.\n\nDuotones are preferable.\n\nAs Bruce points out, tinting any shade of red can be difficult as it all turns to pink fairly quickly (unless pink is what you are after, of course...)\n\nAs for samples, way back in the day (before I did all this web stuff) most of the paper companies had promos that included duotone samples. Maybe call around to some of the sample departments and see what they have.\n\n"
    },
    {
      "time": "3 Jan 2007 — 7:06pm",
      "content": "Hey thanks again peoples,\n\nTimd, by ganged together, do you mean that they will appear as a block in the finished piece or just printed together and then spaced out? We did think of that but then you still need to hand insert all the pages which adds time and money (it will be perfect-bound). Client doesn't want the images collected together in sections. Sorry if I've misunderstood.\n\nThanks aluminium, maybe i need to visit a paper merchants, i thought perhaps I could wander into a bookshop and find boks that exemplify the results of this process.\n\nthanks again for your advice\n\n--N\n\n"
    },
    {
      "time": "3 Jan 2007 — 7:46pm",
      "content": "Both Tim and Bruce have got some great points.\n\nThat being said, I did a project in 2000 that was done B/W on a coated stock with a varnish on the photos that made them both glow and have a sepia-like tone: we also had a varnish with knock-outs over the \"feature\" article that looked amazing. For the project (a museum catalogue of architecture from 1947-1967), it was perfect.\n\n"
    },
    {
      "time": "3 Jan 2007 — 9:39pm",
      "content": "Nick, there is indeed a strong possibility this job will look washed out and dull, however nicely it's done. Linda's idea of a spot varnish (which can have a subtle colour) sounds manageable, without the difficulty of optimizing duotones.\n\nAnyway, don't miss the press approval!\n\n"
    },
    {
      "time": "4 Jan 2007 — 4:22am",
      "content": "Thanks Nick/Linda,\n\nSpot varnish is roughly equivalent to having a second colour cost-wise isn't it? Nice idea, I can't say I ever recall seeing it done, it could add to that specialty look. I think I'm going to have to bite the bullet and ask my broker for another quote, he's just been on holidays, he's probably well rested what could possibly go wrong?\n\nNick thanks for your honest assessment, that's valuable. Also, just wondered if you follow the cricket over there in Toronto ;)  \nThanks for your time\n\n--N\n\n"
    },
    {
      "time": "4 Jan 2007 — 7:27am",
      "content": "Here's a way to emulate what the pictures will look like:\n\nIn PhotoShop RGB-mode — fill a small square with the Sepia colour. Convert to Grayscale. Use the pipet-tool to determine the gray value (eg 82%). That's what the darkest parts of your photo's are going to be.  \nOpen a few sample pictures in Grayscale. Using Adjustments:Curves pull the 100% input handle to the value you just determined. Now convert the image to Duotone (using a single PMS-colour of course — the one you are going to use to print the job).  \nThis will give you a fair aproximation…\n\n"
    },
    {
      "time": "4 Jan 2007 — 10:54am",
      "content": "Cricket?  \nThere was a small paragraph in the Toronto Star this morning about England's impending whitewash, duly noted, but I've been a baseball and hockey fan ever since I arrived in Canada in 1977. Actually, squash is my game, but it gets less press here than cricket, apart from the odd Jonathon Power profile by a journalist who's just discovered him. So it's a bit like typography -- underappreciated, shall we say.\n\nReturning to the topic, I've tried monocoloured halftones occasionally throughout my career as an art director/graphic designer, and have almost always been disappointed with the results. Some designers can pull it off, but IMHO it requires an exceptional and quite specific talent/skill that very few art directors have, and not every graphic designer, certainly not myself -- and it has nothing to do with typography. That's why I caution against it.\n\n"
    },
    {
      "time": "4 Jan 2007 — 12:29pm",
      "content": "Here's a thought, Nick. If you have already \"painted yourself into a corner\" with the pricing, and cannot afford duotones, what about making the pictures into line conversions? If the author is okay with it, and the content can bear up under the decidedly non-19th-century appearance, that might be a way to get a bit more dynamic range out of the images.\n\nThe trouble with halftones is that you can't flood the deep shadows with ink -- you have to leave a tiny relief dot in there or they look strange.\n\nWith a line conversion, you can let the deepest areas just go solid brown. Play around with coarseness, the fewer lines-per-cm giving you the most ink impact (with consequent loss of detail in the pictures) and the more lines-per-cm giving you more detail (but tending to look more washed out.)\n\nThe examples I've put in here are something I just wumped up in Photoshop using a quick-and-dirty filter routine. Usually I make line conversions in Quark, right in the document I'm designing. So the example here is very soft-looking compared to what it _could_ look like. Judge it for the indication of \"liney\" personality, not for quality of finish. I'll stick a line conversion of a product shot at the end, with sharply-defined lines, just so you see what I mean if this concept is new to you.\n\nIf one of the printers you've asked for pricing is one that feels really _simpatico,_ and you'd really like to work with them, why not take the problem to them, voice your concerns, and see what ideas they have to contribute.\n\n ![](http://web.archive.org/web/20130310062106im_/http:/typophile.com/files/MiddleSt_3575.jpg)\n\n ![](http://web.archive.org/web/20130310062106im_/http:/typophile.com/files/MiddleSt_line_6740.jpg)\n\n ![](http://web.archive.org/web/20130310062106im_/http:/typophile.com/files/RPL25_40_6485.jpg)\n\n"
    },
    {
      "time": "4 Jan 2007 — 3:37pm",
      "content": "Thanks so much everybody for your wisdom,\n\nBert, thanks for your technique although i think I need my hand held a bit more: when I change the input to 88% (which is my sepia/gray value) the picture seems to go darker, I thought perhaps it would go lighter, when I change both input and output; I lose \\*lots\\* of detail in the shadows. Can you possibly be more specific? Also why do I need to do this? won't the monotone replicate the look of my sepia colour?\n\nNick, squash huh? It may actually be a typographer's responsibility to pursue obscure and under-appreciated pursuits in every other area of their lives just for the sake of remaining consistent, so congratualtions, i guess ;) I thought with your english background you may have still had some cricket stirrings, alas... I think Cananda actually has a reasonable cricket scene, I vaguely remember Australia playing Cananda at some point, I may be mistaken.\n\nAbout images: Yes I think I'm heading for some disappointment in this area, the other variable I failed to mention was that the stock is half-way B/W cream and off-white, I think that will bring a bit of warmth into the pictures but perhaps not quite enough. The really irritating thing is that originally these photos were printed in one colour: sepia, but over time old photo paper turns very yellow so we always associate that warm yellow colour with the look of sepia. In reality monotones are probably fairly close to how sepia probably looked on the day it was produced.\n\nThanks Bruce for your idea, painted into a corner is definately a good description of how I feel ATM, I think the linesceen might be a wee bit drastic in this case, cool as it does look, I doubt the client would go for it. I'll remember that as a technique though, it may come in handy.\n\nthanks again for all your help\n\n--N\n\n"
    },
    {
      "time": "4 Jan 2007 — 6:11pm",
      "content": "Nick G.: yes, our spot varnish was charged out the same as a second colour, and was well worth the cost. And we had very high-end, drum-scanned .tifs for the photos, which also made a huge difference.\n\nThe curator of our show purchased 8 x 10 B/W photos from the museum archive, and received permission to scan and blow them up before mounting. And \"up\" was the operative word: I have one of the enlargements and it is 5' wide x 4' high with no noticeable grain.\n\nPress approval is imperative for such an operation: we had a very good experience with our printer, who had extensive experience in doing high-end museum catalogues, and it really showed.\n\n(Y'all may be whitewashing the English this time, but with gents like Shane and Justin retiring, you might be in trouble next Ashes!)\n\n"
    },
    {
      "time": "4 Jan 2007 — 8:53pm",
      "content": "Linda C\n\nFor every Warne and Langer retiring there's a McGill, Clarke and Hussey. Plenty more where that came from ;) And if it doesn't, we might actually get to watch a game of cricket.\n\nYeah the varnish is an option but very much the unknown as far as I'm concerned, If it's the same price I would probably go the second ink before I did the varnish. I'm looking forward to the day when I get to use a big budget on an art piece and do things like spot varnishes while drum scanning everything, perhaps though what ou gain in quality you lose in sleep and fingernails.\n\nAgree about the press approval; I did a press approval for the first time on a previous book-cover job, I had made the mistake of showing the client my progress on my computer screen and so of course, when the reddish cover was printed, he wanted the red he saw on screen, not the red reproduced from the actual tranny...\n\nThanks for yor help\n\n--N\n\n"
    },
    {
      "time": "5 Jan 2007 — 9:31am",
      "content": "[.]\n\n"
    },
    {
      "time": "5 Jan 2007 — 2:59pm",
      "content": "I don't have a working scanner at the moment, but would it help if I took some pix of our catalogue and posted them? Might just change your mind about the varnish.... ;-)\n\n"
    },
    {
      "time": "6 Jan 2007 — 8:16am",
      "content": "Maybe I wasnt clear enough ; ).  \nYou keep INPUT at 100% and change OUTPUT to 88% (in other words: pull the endpoint down — the image becoming lighter is what happens). Loosing detail in the shadows is a given (one could circumvent some of that by applying a custom curve, eg pushing up the midpoint).\n\n"
    },
    {
      "time": "8 Jan 2007 — 4:43pm",
      "content": "I bit the bullet and asked for the additional duotone quote, let's hope it's comparable.\n\nThanks everybody for your help, Linda if you're happy to post some pictures I'll be happy to see 'em, thanks. (is the 'L' on your picture friz quadrata?)\n\nBert, yes that works better, but I'm still unsure of why you need to do this to approximate the look of monotone, when you can just see it by applying a monotone in the duotone settings...\n\nthanks again\n\n--N\n\n"
    },
    {
      "time": "8 Jan 2007 — 4:48pm",
      "content": "I'll dig out the catalogue first thing in the morning and take some snaps then.\n\n(Nope, it's American Uncial Caps Bold.) :-)\n\n"
    },
    {
      "time": "8 Jan 2007 — 8:25pm",
      "content": "Gr,\n\nI'm just seeing friz quadrata everywhere at the moment and thought it was more of the same but not so. Thanks heaps for the photos, if you're busy don't bother, but it would be good to see 'em\n\n--N\n\n"
    },
    {
      "time": "9 Jan 2007 — 8:49am",
      "content": "No worries.... ;-) I know what you mean about Friz: I used to like it a lot before it was over-used....\n\nSorry the lighting's not better! Yes, we used a white stock....\n\nThis was the \"feature\" article -- we had the varnish run over most of the whole page (not bleed) with the little knock-outs. The same look was used on the cover, where, we used a second colour (can't remember the PMS, but it was avocado-ish).\n\n ![](http://web.archive.org/web/20130310062106im_/http:/typophile.com/files/calmod1_6152.jpg)\n\nThis was the \"standard\" page. Articles all started on the verso and finished recto....\n\n ![](http://web.archive.org/web/20130310062106im_/http:/typophile.com/files/calmod2_5156.jpg)\n\n"
    },
    {
      "time": "11 Jan 2007 — 9:09pm",
      "content": "Thanks Linda,\n\nThanks for taking the trouble to photograph these things, much appreciated and sorry for the delayed reply. Nice font, looks like futura but are the 't's different hm.\n\nThe pictures look good, the blacks seem like good blacks and there seems to be a good range of midtone, these are all good things (Happy gilmore) but to be honest I can't really get a feel for the unique effect of the varnish, this must be one of those things that it's a bit difficult to convey via the net.\n\nAlso what are the knockouts? are they the flecks of white on the first page? They look like little icons, a house for example, am I mistaken?\n\nI love that script on the 'House of modern', in the last weeks, I've been trying to produce a script-type logo with a brush, gee it's difficult, I have much more respect for those who can so wield,  \nthanks again\n\nNick\n\n"
    },
    {
      "time": "12 Jan 2007 — 7:22am",
      "content": "I didn't do the typography, only the project management and editing for this job. It's been a few years, but if memory serves, it was Avant Garde Bold for the titles and Goudy Old Style for the body: this looks like a case for the TypeID police. ;-)\n\nThe varnish thing is very subtle -- if you look on the second one, below the author line, and contrast that to the sky in the photo is probably the best place. Without the varnish, the sky would have disappeared into the paper. And the photo can't begin to reproduce the texture shift either -- it's an uncoated paper and a matte varnish.\n\nYes, those are small icons as knockouts: nice subtle way of connecting the feature article to the cover and very sympathetic with the entire exhibit.\n\n"
    }
  ]
}
