{
  "id": "30299",
  "title": "Same Font, Several Foundries",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Why is it possible to get a font that’s named the same from Linotype, Monotype, Adobe, Berthold and Bitstream; and why are those fonts sometimes different from foundry to foundry? If the designer is licensing the font to different foundries, why can’t the designer insist on product consistency from foundry to foundry to preserve the product’s good name, or at least to prevent me from getting a headache?\n\n",
  "author": "<a href=\"user/15738\" title=\"View user profile.\">pdxuser</a>",
  "time": "<br>",
  "uid": "15738",
  "comments": [
    {
      "time": " 3 January, 2007 - 6:34am",
      "content": "Many fonts are named after a famous designer, and are based on the fonts used by that person. For instance, Garamond, based on fonts used by Claude Garamond.\n\nThe problem is, everyone looks at the fonts a little differently, and as a result each revival is different. Some differences are huge. ITC cuts, for instance, always have larger x-heights because it was a corporate decision to do so.\n\nFonts from more recent sources usually are licensed, and with these there is some control. However, if you pay enough, you probably can get the right to modify the font.\n\n"
    },
    {
      "time": " 3 January, 2007 - 7:29am",
      "content": "Well, there are two issues here:\n\n1. As mentioned above, there are different cuts of similar style types which have the similar names, such as as Bodoni, Garamond, Caslon, etc. See this good article by Dave Farey: [http://www.fonthaus.com/xheight/bodoni.cfm](http://web.archive.org/web/20070403144206/http:/www.fonthaus.com/xheight/bodoni.cfm)\n\n2. Everyone sells each others fonts. Or should I say, all the large foundries are licensed to distribute each others fonts.\n\nThese fonts shouldn’t be different from foundry to foundry (reseller to reseller) unless they fall into category #1.\n\n"
    },
    {
      "time": " 3 January, 2007 - 10:36am",
      "content": "Some fonts predate modern intellectual property rights laws, and have trademarks which are difficult to enforce—not that companies aren’t trying. For example, many foundries have distributed cuts of Caslon, so it’s difficult for one company to take control of it. On the other hand, if another designer tried to distribute their own cut of say, Zapfino, they would probably not be able to do so.\n\nWhat’s amazing is that in some cases the name of a historical figure like Aldus can be trademarked as well. So, people designing fonts related to or inspired by his work have to use a different name. Of course, that’s not the only reason why a cut of a font may have a different name. For example, Jan Tschichold’s version of Garamond may have been named Sabon simply to distinguish it from others.\n\nIf this seems confusing it’s be cause it is confusing. The previous comments are also applicable. Companies do resell each others fonts. In some cases, a version of a font might be licensed to another company, while the original creator releases an updated version. Each face has it’s own little story…\n\n"
    }
  ]
}
