{
  "id": "30315",
  "title": "Initial cap (Drop cap)",
  "forum": "Design",
  "tags": [
    "Typography / Composition",
    "Design"
  ],
  "content": "Hi all, forgive me if this has been answered, but I couldn’t find it anywhere, I’m also new to Indesign.\n\nI’m just curious about the drop caps in Indesign, is it possible to do like the first example in my attachment without manually setting first line -10 indent and the rest of the paragraph +10 indent, and then forcing a hard linebreak to reset the indent for the rest of the text ?\n\nThe old typographer in me cringes when I see the default result Indesign gives me.\n\nHenning.\n\n ![](http://web.archive.org/web/20150317181119im_/http:/typophile.com/files/initial_6276.jpg)\n\n",
  "author": "hsannerh",
  "time": "3 Jan 2007 — 1:09pm",
  "uid": "16086",
  "comments": [
    {
      "time": "3 Jan 2007 — 2:10pm",
      "content": "Not that I know of, as I spent a good deal of time trying to find a solution to a drop cap \"A\" a few weeks ago. I'd be eager to find out about a \"real\" solution if there is one, too.\n\n"
    },
    {
      "time": "4 Jan 2007 — 7:32am",
      "content": "Maybe with Optical Margin Alignment?\n\nEdit: Sorry, didn't read the question properly. Could the solution be in Scripting?\n\n"
    },
    {
      "time": "4 Jan 2007 — 11:20am",
      "content": "Haven't found a way either. Other than adding half a dozen anchor points to the text box, and redrawing it. Which is what I usually spend my time doing.\n\nA friend of mine and I are working on a couple plug-ins right now -- one of which will hopefully fix this. If/when we ever get it finished, I'll post something here.\n\n"
    },
    {
      "time": "4 Jan 2007 — 11:55am",
      "content": "I've always (since Quark 2) used negative manual kerning, paragraph return (\"justify all lines\") for the first line, and tabs for the next (two) lines. The reason I like tabs is that you can drag the setting and position it \"by eye\".\n\nI don't think there can ever be a fully-automated way to do this, as the side-bearings of characters vary considerably within fonts. And between fonts, some have negative sidebearings for A, others positive -- and there is built in kerning in some fonts as well.\n\n"
    },
    {
      "time": "5 Jan 2007 — 8:25am",
      "content": "There's a section in Nigel French's book, InDesignType, that explains how to do this using text wrap without resorting to -spacing. I think you convert the initial cap to outline and then adjust the wrap to taste.\n\n"
    },
    {
      "time": "17 Sep 2013 — 3:37am",
      "content": "OK, this is an old thread, but one way to do this is inserting two hair spaces after the Drop Cap, then mark/select the second hair space, and give it a negative kerning of -700/-800 (depending on what letter).  \nIn Quark you can do this the same way by inserting two ordinary spaces (but that can´t be done in InDesign.)\n\n"
    },
    {
      "time": "8 Sep 2014 — 3:33am",
      "content": "Here's an article on drop caps that might be helpful: [http://theworldsgreatestbook.com/book-design-part-6/](http://web.archive.org/web/20150317181119/http:/theworldsgreatestbook.com/book-design-part-6/ \"http://theworldsgreatestbook.com/book-design-part-6/\")\n\n"
    }
  ]
}
