{
  "id": "30313",
  "title": "University of Reading... a little question",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Has anybody here attended, or has knowledge of, the MA courses at University of Reading? Especially Theory & History and Information Design.\n\n- Are these quality courses?  \n- Any particular positives or negatives?  \n- What kind of influence is present in the teachings (classic, modern, post-modern and such)?\n\nI hope someone can help!\n\n [‹ Advice please](http://web.archive.org/web/20071217232528/http:/www.typophile.com/node/30631 \"Go to previous forum topic\") [Art deco ornaments ›](http://web.archive.org/web/20071217232528/http:/www.typophile.com/node/30672 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071217232528/http://www.typophile.com/user/16084\" title=\"View user profile.\">petitepetite</a>",
  "time": "<br>",
  "uid": "16084",
  "comments": [
    {
      "time": " 3.Jan.2007 11.42am",
      "content": "I’ve been considering the same course. Some of your questions may be answered here: [Forum](http://web.archive.org/web/20071217232528/http:/typophile.com/node/12390)\n\nor here: [Forum](http://web.archive.org/web/20071217232528/http:/typophile.com/node/28588)\n\n"
    },
    {
      "time": " 3.Jan.2007 11.53am",
      "content": "There are two parts to the puzzle, the course and the student. Telling us a bit about yourself might help determine if you and the courses would be a good match.\n\n"
    },
    {
      "time": " 3.Jan.2007 12.05pm",
      "content": "Alright Sii. I am graduating with a Bachelor of Arts degree this spring. I have been attending a school which is kind of free thinking, conceptual and somewhat academic. This school doesn’t quite stress practical aspects of design - though, of course, we do learn it to a certain extent.\n\nThis was a good experience but I have always been mostly influenced by the modernistic view of design. Outside of school I have studied typography and information design immensely.\n\nSo, basically, what I am looking for is to learn more about good way to present information.\n\n"
    },
    {
      "time": " 3.Jan.2007 12.50pm",
      "content": "I graduated in 95 and at that time the undergrad theory & history of information design stuff was being taught by Prof. Twyman - he’d been teaching the subject for many years and the materials and examples were excellent.\n\nNot sure who teaches this now, Paul Stiff? But based on my dated experience I think you’d fit.\n\nOnly issue may be that if you’ve been independently studying ’immensely’ how much would you get out of it? For me ten lectures on the ’ [schema](http://web.archive.org/web/20071217232528/http:/www.cea.mdx.ac.uk/cea/CEA_shared/Staff_Stephen/lecture_visuals/GraphicSpace1/TextTwyman_120.html)’ was great, for you it might be dull. It was the case when I was there, not sure if it is now, that the postgrad courses were essentially the same as the undergrad components so perhaps were not best suited to design graduates.\n\n"
    },
    {
      "time": " 3.Jan.2007 1.48pm",
      "content": "Thanks for the informative answer.\n\nAccording to the schools website Paul Stiff is still there but Paul Luna is the programme director of Theory & History.\n\n"
    },
    {
      "time": " 3.Jan.2007 2.23pm",
      "content": "No problem. Paul joined the department after Michael, so I’d suggest trying to track down current students or more recent graduates.\n\nCheers, Si\n\n"
    },
    {
      "time": " 4.Jan.2007 1.10am",
      "content": "I attended Reading when completing a 4-year BA in Typography and Graphic communication, so I can’t comment directly about the MA courses. What I would say – having been fortunate to have studied under Michael Twyman, Paul Luna, Paul Stiff and Gerry Leonidas (and a wealth of other expert staff and visiting lecturers) – is that everyone there was very generous with their time and knowledge, and all students got a lot of contact with staff members both in small groups and one-to-one.\n\n"
    },
    {
      "time": " 4.Jan.2007 1.43am",
      "content": "Great to hear! I’m getting more interrested in Reading every day.\n\n"
    },
    {
      "time": " 4.Jan.2007 2.38am",
      "content": "I like what I’ve seen of the programmes so far. I’ve visited the department twice, and know several graduates from the MA Type Design course. Baring any sort of funding crisis, or total meltdown of the US dollar, I’ll be attending the type design programme beginning in the fall.\n\nI can’t say I know anything about the Info Design programme, but the Theory & History programme sounds like a thrilling opportunity. I don’t think that there is anything comparable in terms of design research to be done anywhere else, at the moment.\n\n"
    },
    {
      "time": " 5.Jan.2007 5.37am",
      "content": "The Theory & History and the Information Design programmes are quite different in approach . The MA InfoD is structured around the practical work the students do: a series of projects and assignments which culminate in a show of work in early summer; they later submit a dissertation of around 12,000 words. The MA T&H shares some sessions with the MA InfoD and the MA Printing & Book Design History, and does not engage explicitly with any practical assignments, but instead increases the focus on Research Methods and culminates in a substantial dissertation of around 20,000.\n\nIn day-to-day terms, the nature of the practice-oriented MAs is fairly directed, stemming from the responses to practical assignments, whereas the MA T&H is much more flexible in its direction: students can have have a greater contribution to the direction of their studies, depending on their particular interests. So, for example, one student may opt for an approach that will lead them to engage with the methodology of subject experimentation and results analysis, while another may direct their focus on, say, the practicalities of printing processes, and engage with different devices for rendering.\n\nNow, with regard to your questions:  \n<cite><br>\n- Are these quality courses?<br>\n- Any particular positives or negatives?<br>\n- What kind of influence is present in the teachings<br>\n</cite>\n\nDefining “quality in HE” is a pretty wide topic worthy of several threads in itself, but here’s an off-the-cuff shortlist of criteria for you to think about:\n\n- engagement with the discourse in the field of study\n- resources and original material available to work with\n- opportunity for contact with a range of staff members and visitors\n- support in the development of a range of skills\n- challenge and relevance represented by the assignments\n- quality of final student work\n- graduate destinations immediately following a programme\n- graduate careers in the mid- / long-term\n\nUnfortunately, the work produced especially by the MA InfoD students is not easy to show and explain online. More importantly, it is difficult to reflect the development process in the final deliverables without recourse to a workfile, so it is not at the moment possible to just point you to a link and say “here’s sample work from the MA InfoD”.\n\nHowever, if you’re seriously interested you should plan to visit the Department on its next Postgraduate Open Day, on Thursday 8 March. Contact Carolyn Davidson at c.d.davidson at reading.ac.uk for more information.\n\n"
    },
    {
      "time": " 7.Jan.2007 4.23am",
      "content": "Thank you so much for this outstanding answer!\n\n"
    },
    {
      "time": " 7.Jan.2007 8.59am",
      "content": "I attended Reading in 1999 and found it to be one of the most fulfilling years of my entire life. The education I received there is one year made me envious of the undergrads who were there four years.\n\nI did the MA in History and Theory, focussing on history of type design mostly.\n\nThe only negatives for me were the short days during the winter months and my choice to live in the halls.\n\nThe lecturers interests are far reaching and you won’t find yourself stuck in one era unless you choose that era for yourself.\n\n"
    },
    {
      "time": " 7.Jan.2007 1.08pm",
      "content": "As I mentioned above, I too am considering the MA InfoD and have also considered the MA H&T course. I have a BFA from Virginia Commonwealth University in Communication Design and two years experience in both publication design and infographics at a newspaper and magazine.\n\nI do have the desire to attend graduate school — to immerse myself in typography and design at a deeper level than offered at the undergraduate level. I love design and especially type, which is why I am drawn to Reading of course.\n\nHowever, I have been told by a dozen or so people that unless I want to teach, I do not need to go to graduate school. I would love to teach typgraphy and design to college students, but I am still deciding on this career path.\n\n**I have two questions:**\n\n- Do you agree that designers and/or typographers with a BFA from a good design program do not need a graduate-level education unless they want to teach?\n<dl>\n</dl>- What career paths do graduates of the MA InfoD program take?\n\nAt this point, I am really trying to make a practical decision. I am recently married to a supportive woman who craves as well, to live, work and study abroad. But let’s be honest, this isn’t the best time for an American to try to finance a UK-based education.\n\nGerry, your above response has me even more excited about the program. I appreciate the passion and involvement of the faculty. Perhaps you could answer some of my questions. I will certainly email Carolyn Davidson with further inquiries.\n\nThank you.\n\n-Roy Wilhelm\n\n"
    },
    {
      "time": " 7.Jan.2007 10.04pm",
      "content": "Dear Roy,\n\nI cannot answer you question as well as some others might be able to, but I have travelled abroad for post-undergraduate study once before. In 2003, two years after I finished my BFA in the US, I moved to Germany to study design further. In retrospect, this may not have been the best idea, school-wise, but it certainly helped my career path, and it made me happy. I’m still here, too.\n\nAnyway, to try to answer your first question on a very basic level: no one has to go to graduate school. While some companies may tend to favor job candidates with MA degrees, as designers, we more often place weight on personal knowledge, experience, portfolios, etc. Some people I know are even adverse to candidates with advanced degrees, for fear that they would command higher salaries.\n\nWhile the knowledge you might acquire at any graduate school would probably be acquirable by yourself elsewhere (through personal study, dedication, etc.), further study is a luxurious opportunity. Away from the daily grind of a job, you have the opportunity to focus your time on the subject at hand. Furthermore, you will be surrounded by like-minded people, both students and faculty, which will probably cause you to worker harder and discover more more quickly than you might otherwise.\n\nAs for your last point, that this isn’t the best time for an American to try to finance a UK-based education, you certainly bring up a good topic. However, on the flip side, one cannot predict the short term performance of global currencies. Who knows, it might never be a good time ever again to study in the UK; the dollar could deflate even further. In the year before I left the US for Germany, I watched the dollar loose 20% of its value against the Euro. This meant that the money I had been saving up for my education had lost 20% of its value, too. Since 2003, the dollar has dropped even further against the Euro, but there isn’t anything that I can do about that. Many of the top design-related programs in the US at private universities are still more expensive than the costs related with moving to the UK for a year. And, with apologies to MasterCard, there are some opportunities that really are priceless. These decisions are best left up to the buyer; I can only offer you my own opinion!\n\n"
    },
    {
      "time": " 9.Jan.2007 6.55am",
      "content": "<cite> Contact Carolyn Davidson at c.d.davidson at reading.ac.uk for more information</cite>  \noops — I got the email wrong: it is c.davidson at...\n\nNow on to Roy’s questions:  \n<cite>Do you agree that designers and/or typographers with a BFA from a good design program do not need a graduate-level education unless they want to teach?</cite>  \nFirstly, the teaching bit. Indeed it is increasingly a prerequisite to have an MA or MFA to teach, and I will not be surprised if in twenty years’ time this requirement has crept up to degrees that are explicitly research-based. The issue is closely linked with what each region assumes each level of higher education represents, both in terms of provision by the institution and teaching staff, and in terms of the students’ experience and outcomes. The range is wider that you would think considering the [im]maturity of the sector, but this I think is endemic in the humanities and applied arts.  \nIn my experience many designers get fed up at some point with the daily grind of a client-based career, and welcome the diversion that teaching may offer, taking advantage of the fact that design is very well suited to part-time or occasional teaching engagements. Your problem would be that it is more likely that you would feel the need for a career change sometime in your mid- or late thirties, when it is more difficult to take a year out to obtain the required qualification (I know, because we have students in this situation _every year_). So, you could say that, at minimum, getting another qualification may come in handy in the future in ways that you cannot predict now.  \nThere is another angle to this, however, unrelated to the formal qualifications for teaching. A good postgraduate programme will give you skills in self-directed learning and research, writing, preparing and presenting your work, and an altogether deeper understanding of your discipline that BAs and BFAs cannot accommodate. This is more so as the population of students in undergraduate programmes increases. There seems to be a gradual shift towards a model of BA/BFA for general grounding and professional competence, followed by an MA/MFA that can target learning better, and offers also a better framework for funding support of applicants. So, my second point is that postgraduate programmes are becoming the accepted culmination of one’s studies (outside the domain of pure research); I would argue that this is the case for some time now in many other fields, but some areas of the humanities and the applied arts in general lag behind, largely due to the degree to which the respective knowledge fields have been defined (or, have not, as the case may be).  \nFinally, with regard to the impact on careers: in the context of typographic design (i.e. a relatively narrow field with a good network for recognising reputation and professional contribution) my experience is that a good MA degree can be transformative for a person’s prospects and career. Whichever way you look at it, there is absolutely no way you could ever put yourself through the intensive intellectual environment and sheer workload that a proper MA programme represents.  \nAll this, remember, is just my opinion, therefore worthless as guidance for others; what seems reasonable to me may mean nothing to the next person. But because you are considering something that has the potential to direct your life in ways you cannot anticipate (see Dan’s comments, above) you must research all your options carefully, and then try to get some gut reaction to the environment and the people you may place yourself amongst.\n\nand:  \n<cite>What career paths do graduates of the MA InfoD program take?</cite>  \nA couple or three InfoD graduates work as teachers, but most are employed by larger companies that have an information design perspective on their work. A lot depends on where you intend to live after the programme: the UK, Australia, Canada, and to a lesser degree the US do have a functioning market for information design. In other countries the picture is patchier, and information design projects are farmed out to graphic design companies. The big opportunity (and, still, the big unknown) is interface design: a recognised _need_ for expertise, but which so far is mostly covered by experiential practitioners. (See all the “big names” in web design rediscovering principles of typographic design applying to design for the web that typographic designers have “owned” all along, but were poor at adapting in language and process for the new media.) So, I think that InfoD grads will slowly migrate from the more conventionally typographic design to occupy a position between the coders and the editors — if not out of preference for the material, out of necessity for the volume of work available.\n\n"
    },
    {
      "time": " 9.Jan.2007 8.34pm",
      "content": "Wow. Thanks so much for the very thoughtful responses. I think I will seek the answers to a few more questions I have. I’m really leaning towards applying to Reading. The Reading Web site isn’t clear about the deadline for international students. I’d like to know if I still have time to apply for this fall.\n\nBoth of you were very helpful. Thanks again.\n\n"
    },
    {
      "time": " 10.Jan.2007 6.32am",
      "content": "<cite> The Reading Web site isn’t clear about the deadline for international students. I’d like to know if I still have time to apply for this fall.</cite>\n\nWe are a small department, and can operate more flexibly than the general guidelines may suggest. There is still time.\n\nNote though that it is not the application process itself that takes long, but the “package” of obtaining a student visa if you need one, any financial arrangements, accommodation, and so on. Be mindful of a sort of critical path for your application: you need the references to apply (which take some time to obtain), you will not be able to apply for a visa before you have hardcopy confirmation of your acceptance to the university; and so on.\n\nAnd if (like petitepetite), you are not from an English-speaking country, or have studied for your first degree in an English-language institution, you will need a score of 7 in the IELTS language test before your acceptance is unconditional.\n\nGood luck!\n\n"
    },
    {
      "time": " 10.Jan.2007 7.28am",
      "content": "I am an old man who is envious of the young students who attend Reading. If it were possible, I would apply myself, not for the career path but just for the knowledge and interaction with collegues. If I were you, I would go. There will be no better time and there may be a worse time (like when you are in your 60s like me:-)  \nThere is no “requirement” for a Masters degree true, but that is not why you go to such a wonderful university. You go for the growth it will bring you and the passion for your chosen field. I am sure that your portfolio will be greatly enhanced for your journey there though. In this field, portfolio is a “requirement”.\n\nWishing I were there,\n\nChrisL\n\n"
    },
    {
      "time": " 10.Jan.2007 8.03am",
      "content": "I quit/retired from Microsoft to go to Reading!!!!\n\nSo there ! A well paid job and quit! Because it was just too good to pass up.\n\nGood fun year, lived in the dorm!!!! with all the ’foreigners’ in Bulmershe. Went to some Greek parties in Reading Town Centre and ended up a few times with the young ones in Purple Turtle.. Played ice hockey in Basingstoke and Baseball in Richmond London. Drove a Rover Metro!!! Drove and acted like a student.\n\nMet the wonderful Tiffany and many others.\n\nIt will change you forever. Most certainly.\n\n"
    },
    {
      "time": " 10.Jan.2007 8.32am",
      "content": "If you’re an American applying to Reading, it would be good to get going on the official paperwork, especially if you’re considering taking out any loans to finance your degree. Reading is one of the schools you can specify when you fill out your Free Application for Federal Student Aid ( [http://www.fafsa.ed.gov/](http://web.archive.org/web/20071217232528/http:/www.fafsa.ed.gov/ \"http://www.fafsa.ed.gov/\")), but you will probably need to keep after the university to make sure they know what to do with any info that comes from the U.S. Everyone’s extremely friendly and helpful, but they don’t deal with American loans often enough to realize when they’re supposed to take the ball and run with it. Once you’re approved for any Stafford loans, or if you get any private loans, you may need to shop around a little to find a lender who will let you take out a loan for an overseas school.\n\nIt’s actually not a hard process at all, just one that you need to nudge along now and then. When you apply for a student visa, though, you need to verify that you can cover a year’s fees and expenses, so you need to have a statement of your savings or a loan guarantee to go along with your visa application.\n\nIt’s really worth it. It’s pretty fantastic over here. There are so many good people and good resources at our disposal here that sometimes the biggest challenge seems to be deciding what to focus on.\n\n"
    },
    {
      "time": " 10.Jan.2007 10.12am",
      "content": "In regards to loans, I will second Dan’s emphasis on starting now. Also, I found a TERI private loan that working through Reading without any hitches.\n\n"
    },
    {
      "time": " 10.Jan.2007 1.04pm",
      "content": "Great responses. I value advice from my fellow typophiles and so I’m going to go for it.\n\nStay tuned as I’ll post the outcome of my application in the future.\n\n"
    },
    {
      "time": " 11.Jan.2007 4.28am",
      "content": "\\> _There will be no better time and there may be a worse time_\n\nThere’s definitely going to be a bad (not to confuse with “bed”) time at Reading: the time before the deadlines [wink].\n\nThe bottom line is, if the student works hard and is passionate about his project(s), every effort will be worth it. No question about it! But to fully enjoy Reading, you’ll have to look for the bigger picture. Reading is not just about studying and learning how to design a typeface. There’s a lot more beyond that. Reading might hold one of the best collections of type related documents, but its biggest asset is its staff; these people are not only highly knowledgeable but, above all, are great human beings. I had one of the best times of my life when studying at Reading.\n\n"
    },
    {
      "time": " 15.Jan.2007 1.24pm",
      "content": "As the only one doing the History & Theory program this year, I guess I should add my two cents to the discussion.\n\nFor me the main reason for coming to Reading was my personal passion for design and research. I already had a BA on media / graphic design, and I also had a promising career ahead of me. (Still do...probably... :D)\n\nSo, I didn’t want to study more about actually doing design. You can always hone your skills at work or at home. But you can’t really learn the academic side by yourself. Well, you might do it, but it would be difficult.\n\nAnd don’t get me wrong, I do understand and respect people who want to spend their postgrad studies on actual design. Especially if they are specialising on some rare area like type or information design. But that just isn’t my cup of tea at the moment.\n\nAfter researching the matter, I realised that Reading was just about the only place (at least in Europe) that offered what I wanted: a purely academic program in the field of typography & design. So, I quit my job at a newspaper and came here. Luckily I managed to get a grant to cover my tuition fees.\n\nOther reasons for coming were that I wanted to have some fun again (instead of just working), and that I really want to continue to Ph.D. some day. I’m seriously considering ending up more as a teacher than a designer... or then splitting my time between the two.\n\nIn practice, I share the courses with the other programs. I attend to all the possible history and information design lectures and seminars. I also attend type design lectures when I can. (That’s something that I’d like to do more, but it’s not always possible because of overlapping schedules.) I don’t take part in any of the projects the others are doing. Instead I’m doing more written works.\n\nI had a little slow start and was a bit confused until I realised just how independent my program really was. I guess I was waiting for a more structured program. And then there was the problem of choice, as ultrasparky said. So many interesting subjects to choose from! After some panicking I decided to concentrate on newspapers, as that’s my home field, but also because it’s such an unsexy area that its not really that much researched yet.\n\nNow, I’m just having a blast. I just regret that slow start. It made my essays pile up and overlap, and I hate turning in the mediocre papers. Although, I’m not too worried about my grades. The actual learning and having fun is much more important. And the brilliant people you get to meet!\n\nIn every department you will get some unsatisfied students. Reading has its pros and cons just like all the other places. And there will always be a limit on how much the teachers can give you or how many areas they can cover. In the end, your happiness and learning is much more up to how you use the resources the department gives you.\n\nIf you want to ask more specifics about the Theory & History program, just send me an email.\n\n"
    },
    {
      "time": " 15.Jan.2007 8.49pm",
      "content": "I and my Adobe colleagues have long been \\*very\\* impressed with the MA Typeface Design program at Reading, but that’s a different program.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": " 15.Jan.2007 10.28pm",
      "content": "I’d like to strike a cautionary note.  \nNot that I don’t have the highest opinion of Reading, having once even applied for a job there, but it can’t be all things to all people.\n\nI’m also not against the professionalization of graphic design, being an RGD member.\n\nHowever, the academicization of art and design within the education system is, in my view, problematic. These are practice-based disciplines, after all.\n\nWhen I was at art school, graduating in 1974, the qualification was a Dip.AD (Diploma in Art and Design). Now it’s a BA. More cred there, apparently, without the taint of marginalization. So this degree granting status, and the access to government and foundation money it provides, is something that many colleges go after. Gotta have their own postgraduate course. Gotta get some research fellows, with their grant money. To prosper, they’re compelled to keep up with the academic credentials game. There’s a term denoting a principle that keeps the education machine ticking, “measurable outcome”. But art and design education doesn’t have to be quite so subservient to the performance principle, to use Freud’s distinction, play is a good idea too.\n\nThe inflation of required qualifications makes it harder for designers without MAs to move to teaching after a professional career, which is a loss to everyone and a widening of the divide between the commercial world and the academic world. Commercial designers are not all self-taught “experiental practitioners”, to use Gerry’s term, many are older designers who would make valuable educators. They got their qualification years ago, but with degree inflation, they are less favoured by the system than career academics.\n\nSo it’s true, as Gerry says, that to maximize your options for later on, you should get a higher degree now. But does careerism belong in Academia? Or anywhere, for that matter.\n\nPlanning one’s career while at college may not be the best idea. If there’s one thing that’s constant in the graphic arts industry these past 150 years, it’s changing technologies creating massive roadkill, and who can predict what will come along next? An open-ended education will provide a more flexible means of having a long-term career to cope with these changes, than tailoring one’s education to a specific job or job sector. Careers have a habit of careering all over the place.\n\nThere are good reasons for a conservative, academically-driven education, if you’re conservative, or if you want to know the enemy (which was Neville Brody’s reason for attending the London College of Printing). But not every rebel has such resolve.\n\nPetitepetite, what alternatives have you considered for pursuing your passion for the theory and practice of typography and information design? It may well be that Reading is your best bet. But I would be interested to know what the options are.\n\n"
    },
    {
      "time": " 17.Jan.2007 9.18am",
      "content": "Nick, I’m sorry for the late response.\n\nIn Europe, I had also been considering KABK in The Hague and HFG of Main. In the end though, I decided not to apply for those. In USA I am applying for RISD, Cranbrook and Pratt (for the location).\n\nI still have left to decide what would be the right choice - but to me RISD and Reading seem to be the most interesting ones. RISD would be like a continuation to my present school (although at a higher level) while Reading seems to be a whole different chapter.\n\n"
    },
    {
      "time": " 17.Jan.2007 10.52am",
      "content": "Dan Reynolds is a RISD grad. Maybe he can give you some info.\n\nChrisL\n\n"
    },
    {
      "time": " 17.Jan.2007 11.09am",
      "content": "I loved RISD, but I was just there as an undergrad. I can try to answer specific questions if you e-mail me off-line! But I graduated six years ago, though, so it has been a while.\n\nYou mentioned, in Europe, the HFG of Main, by which I assume you mean the Hochschule für Gestaltung Offenbach am Main ( [http://www.hfg-offenbach.de](http://web.archive.org/web/20071217232528/http:/www.hfg-offenbach.de/ \"http://www.hfg-offenbach.de\"), [HfG Offenbach](http://web.archive.org/web/20071217232528/http:/www.typophile.com/wiki/HfG%252BOffenbach)). I studied at this fine institution for two years, from 2003 to 2005. It was great for my career path—and my personal life, too—but I found the school itself to be dreadful, especially as far as typography and graphic design were concerned.\\* I can answer questions about Offenbach, too, if you’d like. But that would be better offline as well.\n\n\\*This brings me to another piece of advice that would have helped me when I was in your situation: judge a school by the way it is now, not (just) by its reputation. Reputations are often based on the past. Schools are institutions, which change over time. Your image of a school might reflect a situation that was true 5 or 10 years ago, while the reality might be quite different today. Asking questions is good; so are personal visits. Try to get as much information as you can before you make a commitment.\n\n"
    },
    {
      "time": " 17.Jan.2007 11.34am",
      "content": "I totally agree - I have tried not to let reputation get in the way of my judgement.\n\nI actually visited RISD last november and I liked it quite a bit. I also fell in love with the setting (I can see myself studying in Providence). Instead of a visit to the University of Reading I came to this forum which has made me confident it could be a great choice.\n\nWhat you mention abou Offenbach confirms what I thought.\n\nIf I will have any questions I will definitely send you a message. Thanks for that!\n\n"
    },
    {
      "time": " 17.Jan.2007 1.01pm",
      "content": "I had a pretty disappointing experience studying MS Communications Design program at Pratt a few years back. After a year, I had the distinct impression that I was paying quite a bit of money without learning very much in exchange. It might be a different experience for someone who’s had less practical experience as a designer than I did, or it might have improved an awful lot in the last few years, but I’ve compared notes with quite a few others who’ve gone through the program and they seem to have felt the same way. New York is a great location, certainly, but aside from the MFA Design program at SVA its master’s-level design offerings seem pretty weak.\n\n"
    }
  ]
}
