{
  "id": "30326",
  "title": "FontExplorer, Quark, and the disappearing font",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Usually I don't have any problems with FontExplorer, but mysteriously when I use Kennerly in QuarkXPress, only the Roman version appears, not the Italic nor Bold, although all are activated. I tried to redo this layout in InDesign CS2 (in which I am rebuilding ALL of my layouts), but now Kennerly will not obey there either. Should I try and split the font suitcases apart, as was suggested in earlier forums? Anyone have a better font management utility?\n\nThanks.\n\n",
  "author": "martay",
  "time": "3 Jan 2007 — 6:10pm",
  "uid": "1196",
  "comments": [
    {
      "time": "3 Jan 2007 — 6:33pm",
      "content": "First step for determining the source of the problem: do the fonts load in TextEdit?\n\nIf so, it is probably the application that is the problem. Try placing the fonts in the Libary \\> Application Support \\> Adobe \\> Fonts folder and launching InDesign again.\n\nIf not, it is probably the font manager that is the problem. Try placing the fonts directly in your [user] \\> Library \\> Fonts folder.\n\n[More on font managers.](http://web.archive.org/web/20131222103909/http:/typophile.com/node/30240)\n\n"
    },
    {
      "time": "3 Jan 2007 — 6:44pm",
      "content": "I wonder if this is the old case of fonts. When some of the manufacturer did (Bold) (Italic) etc. and though only the Regular showed up - the rest were available by using the B for bold, I for Italic, etc.\n\nI remember when Fontographer 1.0 was first out - they had a special extension so you could do this with your typefaces -- happy to say, I didn't and wouldn't ever touch it.\n\n"
    },
    {
      "time": "3 Jan 2007 — 7:08pm",
      "content": "True, forgot about the style-linking issue. Does the font change to the proper italic when you hit the Italic button, Marty?\n\n"
    },
    {
      "time": "4 Jan 2007 — 8:52am",
      "content": "Brilliant! The fonts (all 4 variants) DID show up in TextEdit, but in InDesign bolding or italicizing the Regular did not work. So I copied the font family into InDesign's font folder and voila, there they are. Now, why don't they show up in Quark, even though the fonts are activated in FEx? Is there a workaround for that? And why does this happen with the rare font, most of them seeming to activate and deactivate properly, even in Dreaded QuarkXPress?\n\nThanks for the help guys.\n\n"
    },
    {
      "time": "4 Jan 2007 — 9:09am",
      "content": "Try placing them in your User \\> Library \\> Fonts folder.\n\nFEX is really great, but it's still young and there are kinks to be worked out.\n\n"
    },
    {
      "time": "4 Jan 2007 — 4:31pm",
      "content": "Had tried that, to no avail. So, working on transitioning the few remaining recurring Quark layouts into InDesign.\n\nThanks again for the tips.\n\n"
    },
    {
      "time": "4 Jan 2007 — 5:38pm",
      "content": "Transitioning from Quark to InD for any reason is good for your long-term sanity.\n\n"
    }
  ]
}
