{
  "id": "30336",
  "title": "$100 Computer OS-Sugar",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "After downloading the OLPC emulation software for the XO 'One Laptop Per Child' OS. I noticed in the emulation the icons don't have labels.\n\nWhen I was at Microsoft the UI team and the industry as a whole believe that people read both the icon and the IMAGE of the labels. Meaning they don't necessarily read the labels words but the words are helpful to the recall of the icon's task.\n\nI could prove that theory by knowing I have used Polish Windows and other languages that I do not know a single word from and found the icons were clear when you had been using one language consistently, but when changed or removed the labels they were not obvious.\n\nOther things I found obvious (in the emulation) was that the browser will have problems because it may not have plug-ins installed. This could be corrected but the computer and it's software are Open Source and the plug-ins are commercial software (ie. companies that want to get paid for their work). And there is no real system font even though I suspect there will be a few for writing or chats.. Hmmm what will those be?\n\nSo will this be one poor laptop for one poor child? I'm sure they could do better by showing people how to rebuild all those millions of computer cases into current barebones like computers.\n\n ![](http://web.archive.org/web/20131018055206im_/http:/typophile.com/files/littlesugar_4969.jpg)\n\n",
  "author": "vinceconnare",
  "time": "4 Jan 2007 — 5:44am",
  "uid": "7029",
  "comments": [
    {
      "time": "4 Jan 2007 — 6:14am",
      "content": "after a reboot of Sugar It works more. The Word processor is AbiWord and there are fonts in the dialogs. Some icons have popups so it will have words and fonts. But shareware I guess.\n\n"
    },
    {
      "time": "4 Jan 2007 — 6:39am",
      "content": "Going from having no technology to having a laptop, albeit sans icon labels, doesn't seem to be a huge issue in the grand scheme of things.\n\nAs for Windows, my desktop can't even show a label beyond 10 characters or so without cutting if off, making it fairly useless. OSX and the Windows quick launch bar don't use labels either, so it doesn't seem to be too radical of an idea.\n\n"
    },
    {
      "time": "4 Jan 2007 — 6:47am",
      "content": "I get 12 characters on icons in WinXP but QuickLaunch probably assumes you know what 'Quick' launches since you add or delete them. Like AOL,MSN,wireless connection but of course there are pop-up names in my WinXP.\n\n"
    },
    {
      "time": "4 Jan 2007 — 7:00am",
      "content": "to download it for a MAC...  \nfollow this link and read.\n\n[http://www.edgargonzalez.com/2006/11/21/emulating-the-olpc-xo-on-a-mac-osx/](http://web.archive.org/web/20131018055206/http:/www.edgargonzalez.com/2006/11/21/emulating-the-olpc-xo-on-a-mac-osx/ \"http://www.edgargonzalez.com/2006/11/21/emulating-the-olpc-xo-on-a-mac-osx/\")\n\nThis blog links to the files for a Mac OS that I ran.\n\nYou download the large 'zip that has all files and the 'olpc.vmx'\n\nThe 'olpc.vmx' you click AFTER you install the 'VMWare Fusion' vitual machine that runs the 'olpc.vmx'.\n\n"
    },
    {
      "time": "4 Jan 2007 — 9:25am",
      "content": "So tell us more about the type :-)\n\nWhat comes preinstalled, ie in the WP's font menu? How well do they render, what style of antialiasing does it use? True italics?\n\nCheers, Si\n\n"
    }
  ]
}
