{
  "id": "30343",
  "title": "Purpura Sans",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "HI there people from typophile.\n\nMany years ago i started a font called \"Serene Sans\" and i've posted here for appreciation. But i never finished.  \nSo here i'am again with a new version called \"Purpura sans\" and i would like to hear what do you think.\n\nMy best regards to u all\n\nLuis Gomes\n\n| Attachment | Size |\n| --- | --- |\n| [purpura sans.pdf](http://web.archive.org/web/20150123172005/http:/typophile.com/files/purpura%20sans.pdf) | 48.6 KB |\n| [purpura sans.jpg](http://web.archive.org/web/20150123172005/http:/typophile.com/files/purpura%20sans.jpg) | 126.04 KB |\n\n",
  "author": "1stfloor",
  "time": "4 Jan 2007 — 9:57am",
  "uid": "624",
  "comments": [
    {
      "time": "4 Jan 2007 — 11:30am",
      "content": "I think this has enough style in the finish that you don't need to get so wacky with the 'k', 'o', and 'x'. More standard forms there would make this a more flexible, usable face.\n\n"
    },
    {
      "time": "5 Jan 2007 — 8:19am",
      "content": "HI there Stephen  \nFirst i would like to thank your opinion, and u're right we changed the \"k\" and \"x\" to not give such distant forms from the rest of the caracthers, altought we have remain the form of the \"o\", by now.\n\nI also would like to show u the first sketches of the UpperCases and Numbers, to some appreciation.\n\nMany thanks\n\nLuis\n\n ![](http://web.archive.org/web/20150123172005im_/http:/typophile.com/files/purpura%20sans_6736.jpg)\n\n"
    },
    {
      "time": "8 Jan 2007 — 8:01am",
      "content": "Hi there\n\nBesides the lack of comments, i still continue to improve and work in our \"Purpura Sans\". :)  \nHere is our last update, any comment is very appreciated, thanks.\n\nLuis\n\n ![](http://web.archive.org/web/20150123172005im_/http:/typophile.com/files/purpura%20sans_6722.jpg)\n\n"
    },
    {
      "time": "8 Jan 2007 — 3:49pm",
      "content": "The fact that the lowercase is heavier than the uppercase may be troublesome.\n\n"
    },
    {
      "time": "31 Jan 2007 — 3:11pm",
      "content": "Um, \"purpura\"? Hemorraghic bruising? Perhaps purpure, the color purple...?\n\n(Later: I know \"púrpura\" means purple in Spanish; it's just that in English, that's not the primary meaning. Whether that matters or not, I don't know.)\n\n"
    },
    {
      "time": "31 Jan 2007 — 3:33pm",
      "content": "This reminds me of Nokia Sans, though it’s not very similar.\n\n"
    },
    {
      "time": "23 Mar 2007 — 6:29pm",
      "content": "I think a stencil version would look interesting!\n\n"
    },
    {
      "time": "24 Mar 2007 — 6:05am",
      "content": "You can find some reference in a book called «KAREN CHENG – Designing Type» about the Cap X and the round corners in various letters which feel a bit edgy to me.\n\n"
    }
  ]
}
