{
  "id": "30341",
  "title": "need help with a logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi Everyone,  \nThis is my first post so please excuse me if I post wrong. I need help with a logo that a committe has asked me to do.  \nThe problem is they gave me a sketch of what they want their logo to look like. It is basically (3) on the attached. Now i think it looks like the hazardous waste logo which I would hope nobody would want their logo to look like when trying to convey something positive.  \nThey said they wanted blue and gold colors and three circles. So i came up with (1) and (2a&b) to try to get them to shy away from (3). I would love critism and any suggestions you can give me on the logos.  \nAlso at what point to I say that I don’t want my name attached to something they are basically making me create. I am a new graduate and am not quite sure of the protocol in the design world.  \nThanks everyone for your time!\n\n ![](http://web.archive.org/web/20070824232324im_/http:/www.typophile.com/files/partnership_logo_5874.jpg)\n\n [‹ Integration](http://web.archive.org/web/20070824232324/http:/www.typophile.com/node/30443 \"Go to previous forum topic\") [New born! ›](http://web.archive.org/web/20070824232324/http:/www.typophile.com/node/30410 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070824232324/http://www.typophile.com/user/16102\" title=\"View user profile.\">Erin Higgins</a>",
  "time": "<br>",
  "uid": "16102",
  "comments": [
    {
      "time": " 4.Jan.2007 9.57am",
      "content": "You’re right, their idea is pretty hideous, and bears too much similarity to the biohazard symbol. I think that a side-by-side comparison or an overlay of the two would likely convince them.\n\nI would try keeping “Partnership Award” the same color instead of singling out “Partnership“ unless the word partnership is somehow significant to the client and not to the award.\n\nTry to find a way to work the linking rings from 1 in with the the intersecting axis and ragged left type in 2b and I think that you’ll have a winner.\n\n"
    },
    {
      "time": " 4.Jan.2007 10.11am",
      "content": "<cite>Also at what point to I say that I don’t want my name attached to something they are basically making me create. I am a new graduate and am not quite sure of the protocol in the design world.</cite>\n\nDon’t sacrifice integrity for the sake of one client. Remember that they’re hiring you because of your expertise in design. If they feel that they know more about designing a logo than you do, then maybe they should save themselves some cash and design it themselves.\n\nThat being said, logo design is always a collaborative process. I find that just telling the client that their ideas won’t work isn’t a very good solution. Try to come up with something that is similar to what they want, but doesn’t have the faults that their ideas have. This is why they’re paying you the big bucks.\n\n- Lex\n\n"
    },
    {
      "time": " 4.Jan.2007 10.14am",
      "content": "hey erin,\n\nit can be frustrating when a client has such a predetermined idea of what they want.\n\nbut i would encourage you to develop and present your own concepts as well. this is not a problem if you present your work to them in a professional manner. i.e., “This concept is based off the initial sketch you gave me, but as I continued to think about your organization and what the logo needs to communicate, I developed these other concepts as well, and here is why they are strong...”\n\nafter that, it typically depends on your confidence and relationship with the client how far you want to push your own work. that will also come with experience.\n\ngood luck!\n\njarrod\n\n"
    },
    {
      "time": " 4.Jan.2007 10.35am",
      "content": "Design/approval by committee – words to strike dread into any designer’s heart:)\n\nI am guessing, by their original logo and the strapline, that each ring or circle should link with both others, rather than hazard symbol think venn diagram, avoiding an obvious Olympic look, although option 1 does to some degree represent that. It does look less than impactful next to the biohazard symbol and I think you will have to consider the weight, on a business card or at small scale it could disappear. The ERS kerning needs to be sorted out. It also appears you are doing this in Photoshop, in order to maximise its usefulness you will need to create it in a vector-based software.\n\nAs for the protocol for disassociating yourself from the logo, I would never, in your position, turn down work, if you don’t like it you don’t need to include it in your portfolio but you will have to accept that there are some clients who like to have their mark on work.\n\nbtw. I don’t think the [Oxford comma](http://web.archive.org/web/20070824232324/http:/www.askoxford.com/asktheexperts/faq/aboutother/oxfordcomma?view=uk) is necessary after Education.\n\nTim\n\n"
    },
    {
      "time": " 4.Jan.2007 11.06am",
      "content": "jpad-thanks for your suggestions, i am working on different ideas now using your idea of combinations\n\nbegsini- i actually did present three different logos in the start, one of which i really like. they then showed me (3) and i think they had that in mind all along.\n\ntimd- i agree that as a recent graduate i am in no position to turn down work. the only reason i wanted to dissassociate my name from it was because when it is all done, the committee is presenting it to a board of directors saying that this is what i had come up with. i was just hoping that i could get more business from the board after.  \ni also have been playing around with them intersecting and it is really hard not to get the olympics feel.  \ni will work on the kerning as well. i didn’t do it in photoshop it is just when i originally posted my samples they came out on the message board so huge i tried shrinking the file size.\n\nthanks everyone for your comments, i will post an updated logo soon.\n\nerin\n\n"
    },
    {
      "time": " 5.Jan.2007 6.57am",
      "content": "I guess that the weight of the strokes contributes to the similarity to Olympic rings, using a much heavier stroke and reducing the proportion of rings to wordmark should help avoid that.  \nI think there is mileage in the overlapped rings and room to make sure that it resembles neither Olympic rings nor biohazard symbol, while still remaining true to the kernel of their original logo and their concept for change, if you feel they will be receptive Jarrod’s comment about developing your own concepts will show the board that you have considered their requirements and if you can include a short passage about your reasons, whether technical or aesthetic, on the presentation panels so much the better.  \nUltimately the client will have to live with the logo longer than you will and as I said in my previous post many feel like they have to make a contribution or give directions and it is very hard to dissuade them without a compelling argument (printing/technical concerns are usually quite good).  \nTim\n\n"
    },
    {
      "time": " 5.Jan.2007 6.59am",
      "content": "ok so i have really been struggling with this logo. i just can’t seem to come up with anything that wows. the following two are what I combined from jpads comments and the second one is trying to come up with something similiar to theirs but not so ugly, although i think the type is too hard to read around the circle.  \ni am just getting so frustrated because i really took to heart that as a designer i should be able to take what they want and make it great. and i am just coming up short.  \nany suggestions or comments would be awesome-thanks\n\n ![](http://web.archive.org/web/20070824232324im_/http:/www.typophile.com/files/partnership_logo_6033.jpg)\n\n"
    },
    {
      "time": " 5.Jan.2007 10.37am",
      "content": "In the second the strapline would be more readable the other way up and there is a problem with the T of THE, ideally your title should be larger than your strap at the moment, with the colour difference, the blue is dominating.\n\nLook at the shapes that are created by the overlapping circles, kind of reminiscent of the old [Ontario trillium](http://web.archive.org/web/20070824232324/http:/www.cbc.ca/canada/toronto/story/2006/06/23/to-trillium20060623.html) logo, a flower indicates growth/success. A more 3d approach could be a [trefoil knot](http://web.archive.org/web/20070824232324/http:/home.online.no/~t-o-k/POV-Ray/Trefoil_Knot.jpg), indicates an unbreakable link. Or for a more decorative Celtic approach, if appropriate, [triskeli](http://web.archive.org/web/20070824232324/http:/www.myfonts.com/fonts/dingbatcave/anns-speyerals/triskeli/charmap.html), a combination in which no side dominates, but each is balanced.\n\nHope something here is inspiring, if not walk away from the project for a while, go for a walk or visit a museum or gallery and approach it fresh.\n\nTim\n\n"
    },
    {
      "time": " 5.Jan.2007 12.37pm",
      "content": "thanks tim,  \nthis site is great, i love the idea of playing around with the triskeli idea. Thanks, I never would have thought of that.\n\n"
    },
    {
      "time": " 5.Jan.2007 1.03pm",
      "content": "My pleasure, let us see the next step, please.  \nTim\n\n"
    },
    {
      "time": " 9.Jan.2007 10.24am",
      "content": "Ok so this is what i have come up with for them to choose from, i am trying to appease them and myself. any more critiques before i submit them to the committee?\n\n ![](http://web.archive.org/web/20070824232324im_/http:/www.typophile.com/files/typo2_3957.jpg)\n\n"
    },
    {
      "time": " 9.Jan.2007 11.56am",
      "content": "I like the way 3 is going. 3b is too busy. I think it still needs something, but I’m not sure what.\n\nIn 3, the text is too close to the mark. Think of the mark as a word of its own, and kern accordingly.\n\nAnd when you bring it to committee, my suggestion is only to bring one logo, with a few typeface and colour variations, but don’t show them anything but your best work. In my experience, if you show a committee three different logos, their favourite will be your least favourite. If you only show them the one you like, and they don’t like it, they can always give suggestions on how to modify it, but they can’t pick the safe and easy (i.e. bland) logo.\n\n- Lex\n\n"
    },
    {
      "time": " 9.Jan.2007 1.40pm",
      "content": "<cite> “In my experience, if you show a committee three different logos, their favourite will be your least favourite.” </cite>\n\nGreat advice Lex, thanks.\n\n"
    }
  ]
}
