{
  "id": "30360",
  "title": "(x) Shopsin's General Store website - Alternate Gothic No. 1, Baskerville {Patricia}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I’m trying to ID a few typefaces from this website. It’s a very simple, functional layout—but completely inaccessible. I’m doing an accessible, standards compliant redesign but would like to leave the appearance intact as far as possible.\n\n[http://shopsinsgeneralstore.com/](http://web.archive.org/web/20070403192044/http:/shopsinsgeneralstore.com/)\n\nThe background image used to display most of the content is [http://shopsinsgeneralstore.com/media/generalnewlayoutb.gif](http://web.archive.org/web/20070403192044/http:/shopsinsgeneralstore.com/media/generalnewlayoutb.gif)\n\nSpecifically, I’d appreciate help identifying the headlines, e.g. Order Blank, and the primary text. To my (very untrained) eye, it looks like the entire page uses two typefaces.\n\nThank you for your time and assistance.\n\n",
  "author": "<a href=\"user/16107\" title=\"View user profile.\">weilawei</a>",
  "time": "<br>",
  "uid": "16107",
  "comments": [
    {
      "time": " 4 January, 2007 - 2:42pm",
      "content": "The Header looks like Alternate Gothic No. 1 - will check.\n\nThe main serif font could be Baskerville but it’s a bit small to tell.\n\nThere is a third font - the script.\n\nI hate that restaurant, sorry.\n\n"
    },
    {
      "time": " 4 January, 2007 - 2:45pm",
      "content": "And the text is probably Baskerville.\n\nEdit: I need an eye surgery if there read Baskerville in your post, Patricia, when I was writing mine. :^)\n\n"
    },
    {
      "time": " 4 January, 2007 - 2:53pm",
      "content": "No - I went back in and added it, probably right when you were posting your ID. Your eyes are fine.\n\n"
    },
    {
      "time": " 4 January, 2007 - 3:05pm",
      "content": "What a relief…\n\nRob,  \nyou might have some trouble making the text look like that and keeping the site accessible. SIFR might not work properly with that much text to be replaced. You might have go with Georgia or Times New Roman.\n\nWhat a strange web page, one image and text fields on top of it.\n\n"
    },
    {
      "time": " 4 January, 2007 - 3:29pm",
      "content": "Accessibility is more important to my redesign than pixel-perfect accuracy. I planned to use sIFR for the headlines and find as similar a font as possible for the body text.\n\nThanks for the IDs so far. Hopefully, the rest of this project will go smoothly.\n\n"
    },
    {
      "time": " 5 January, 2007 - 12:25pm",
      "content": "Judging from the italic p, I would rule out Monotype Baskerville, or URW’s Baskerville, which doesn’t even have a true italic. The W rules out any of the Old Style,or Fry’s Baskerville’s, that have a middle serif. It’s a little hard to see the details clearly enough but I would guess either ITC New Baskerville, or Baskerville No.2 from Bitstream.\n\n- Mike Yanega\n\n"
    }
  ]
}
