{
  "id": "30377",
  "title": "Airing punctuation marks",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "The standard practice in French and most European typography is to insert spaces (or a thin space and then a word space) around punctuation marks, except for full stops and commas.\n\nThus:\n\n\"&nbsp;Est-ce que monsieur veut voir M. Duval ? \" reprit le jardinier.\n\nBy contrast, current practices in contemporary English (UK and US) typography do not 'air' punctuation marks.\n\nIt has long been my contention that the European practice should be followed since it makes for much finer typography. Then, reading an old Penguin set in 1961, I noticed that it does 'air' the punctuation marks. This prompted me to conduct a mini survey amongst the books in my library and I saw that many older books from highly respectable publishers were generally set in this 'airy' manner, both in the UK and the US.\n\nIs it time to bring this custom back to English typesetting, or at least to offer it as viable alternative?\n\nI say yes! ( or should I say, \"&nbsp;I say yes ! \" )\n\n ![](http://web.archive.org/web/20140607030904im_/http:/typophile.com/files/05_01_3735.jpg)\n\n",
  "author": "poliphilus",
  "time": "5 Jan 2007 — 7:03am",
  "uid": "15762",
  "comments": [
    {
      "time": "5 Jan 2007 — 7:42am",
      "content": "<cite>The standard practice in French and most European typography is to insert spaces (or a thin space and then a word space) around punctuation marks, except for full stops and commas.</cite>\n\nI've never heard of anything like that, i don't know about french typography, but in Germany it surely isn't a standard to “air” punctuation marks, especially not quotes! Plus i can't say i find your example convincing. Of course there's adjustments to be made, depending on the typeface etc., but there surely isn't a rule to space these. The only exception i can think of are en/em-dashes, which generally are spaced with roundabout 1/8th of an em, and i personally think it looks better/more even than the american practice of not spacing these. But quotation marks? Surely not…  \nAll in my humble opinion of course.\n\n"
    },
    {
      "time": "5 Jan 2007 — 8:29am",
      "content": "Perhaps the older books were all set in metal type with little kerning posible? Using OpenType, you can create an alternate set of punctuation with more generous side bearings as a stylistic set. This might give the user the option to use more open spacing on punctuation.  \nYour sample looks odd and uncomfortable to me though. This may be do to being American and not accustomed to seeing all those holes. Many publishers today like to get a great deal of text on a page to save money so I don't know if youwould have many takers on your idea where it is not already seen as normal.\n\nChrisL\n\n"
    },
    {
      "time": "5 Jan 2007 — 9:11am",
      "content": "French is the only language I know of where this is done. Certainly not \"most European typography\" although there might be further languages where this is done.  \nBy the way, Word typically recognises the laguage automatically and also inserts the spaces accordingly if it detects french.\n\nFrom the MS sharacter design standards:\n\n<cite><br>\nGuillemets</cite>\n\nThese quotation marks commonly called 'French quotes' or 'duck's feet' are said to have been named after a French typecutter Guillaume (William) Le Bé. Guillemets is the French word for quotation marks. The similarly named Guillemot is a narrow billed, sea auk with duck like feet found in cold northern regions of the world.\n\nThese pointing quotation marks are used in many languages and point differently dependent on the language. The German language uses these quotation marks with the right pointing guillemets as the open quotation marks and the left pointing guillemts as the close quotation marks. In French typography the left pointing quillemets are used as the open quotation marks and the right pointing quillemets are the closing quotation marks.\n\nTraditionally in French typography the left pointing guillemets are followed by a non-breaking word space or thin space of 1/8 the em and the right proceeded by a non-breaking word space or thin space of 1/8 the em.\n\n[http://www.microsoft.com/typography/developers/fdsspec/punc.aspx#guill](http://web.archive.org/web/20140607030904/http:/www.microsoft.com/typography/developers/fdsspec/punc.aspx#guill \"http://www.microsoft.com/typography/developers/fdsspec/punc.aspx#guill\")\n\n"
    },
    {
      "time": "5 Jan 2007 — 9:11am",
      "content": "Since the quotation marks are supposed to be connected to the text they contain, it seems odd and superfluous to set them apart. Some fonts kern the quote marks too tightly but that can be adjusted in kerning tables and not require a space.\n\n"
    },
    {
      "time": "5 Jan 2007 — 9:26am",
      "content": "I live in The Netherlands, and I dont think it is standard procedure here to do that. However, it might be that older Dutch books have this, I would have to check that out.\n\nI'm not a big fan of adding even _more_ white space around quotes and such, since they already have so much negative space around them.\n\n"
    },
    {
      "time": "5 Jan 2007 — 9:55am",
      "content": "Too much air, it would seem to me, would make for spots on the page. With the attention being paid to good spacing these days in type design I find I rarely if ever add spaces around punctuation.\n\n"
    },
    {
      "time": "5 Jan 2007 — 10:03am",
      "content": "...just to clarify a few moot points:\n\n1. The French custom is not limited to typographers but standard typing practice.\n\n2. The English examples dated from period that entertained both procedures. It is not kerning, but thin spaces and these have always been around.\n\n4. The custom itself is very ancient, going back to the Renaissance.\n\n5. Attached are few live examples from England and the US.\n\n ![](http://web.archive.org/web/20140607030904im_/http:/typophile.com/files/amercian_1975_4144.jpg)\n\n ![](http://web.archive.org/web/20140607030904im_/http:/typophile.com/files/penguin_1962_4347.jpg)\n\n"
    },
    {
      "time": "5 Jan 2007 — 10:09am",
      "content": "another one...\n\n ![](http://web.archive.org/web/20140607030904im_/http:/typophile.com/files/05_01_5209.jpg)\n\n"
    },
    {
      "time": "5 Jan 2007 — 10:15am",
      "content": "The example you cite as American says UK at the bottom. We use the double quotation mark, not the single mark, for dialogue. No space between the mark and the enclosed text.\n\n"
    },
    {
      "time": "5 Jan 2007 — 10:36am",
      "content": "The first example is, nevertheless, American and maybe emphasizes that the question isn’t about national boundaries at all but about good typography. The practice I am looking at just happens to abound in France and older European typography. I think there is little doubt that in modern times default settings in software dictate to a large degree our typographical practices and tastes.\n\nIt seems to me that there is something inherently right about considering the space between letters and certain punctuation marks. In terms of nuance, this is akin to kerning and should not be done heavy-handedly; when carefully executed I think that the text has a better flow on the page. All I am saying is that we can make our own judgements and allow ourselves, if we think it is right, to be influenced by older or foreign customs.\n\n"
    },
    {
      "time": "5 Jan 2007 — 10:53am",
      "content": "I work with a woman from Quebec, a native French speaker, and when this came up recently, she said airing might be true of the French French, but not Canadian French.\n\n"
    },
    {
      "time": "5 Jan 2007 — 10:54am",
      "content": "We have these debates on this forum all the time. There are discrepancies between typesetting conventions in the US, the UK, and Europe. There are also people who are more inclined to stick with the conventions than others. This came up in a discussion of em vs. en dashes sometime back.\n\nOf course you can \"make your own judgments\" it's a free country (or world) but you have to be conscious of the conventions as well, lest you risk looking like you just don't know how to typeset. If you like that extra space & want to add it, then be my guest, go ahead and add it, but don't look here for justification. It certainly ain't done on this side of the pond.\n\nThe \"American\" sample you cite was probably a reprint of a UK edition. It's highly unusual for Americans to use the single quote around dialogue.\n\n"
    },
    {
      "time": "5 Jan 2007 — 11:49am",
      "content": "As much of an antiquarian I like to think myself, I know it isn't good to follow what was done during the days of the incunabula and after unless that is the specific look I'm going for because it isn't how we do things now.\n\nI agree with what Patty says 100%.\n\n"
    },
    {
      "time": "5 Jan 2007 — 1:00pm",
      "content": "In the one labelled American 1975, I do like the consideration taken when closing a quote that ends with a question mark as opposed to a comma or stop, although I do wonder if there had been a option to close up the space between comma and end quote, and so be able to close up the start quote and text, it might not have been taken. It is not always working well either, compare the ‘W and ‘A.  \nThe double word spacing is jarring, and probably not due a comeback.  \nTim\n\n"
    },
    {
      "time": "5 Jan 2007 — 2:57pm",
      "content": "I've always wondered why the Brits and everyone-else-who-uses-standard-quotes differ -- there's a trend in academia I've seen here in Canada that uses strict British style (and spellings, including things like _artefact_, which is unusual for here), but it does seem to be rather thought of by the great unwashed as effete.\n\nIn the good/bad old days, we typed and put two spaces after periods -- only people who still think they are on a typewriter do that anymore.\n\n(Thankfully!)\n\n"
    },
    {
      "time": "5 Jan 2007 — 3:38pm",
      "content": "Linda, what are \"standard quotes\"?  \nThere are guillemets, singel, double, 66-style, 99-style, high, low - I have seen these in almost every thinkable combination for opening and closing quotes as standards for various languages.\n\n"
    },
    {
      "time": "5 Jan 2007 — 3:57pm",
      "content": "Just a brief comment to Tim's statement: Note that the German speaking part of Switzerland always used and still uses the French way of setting the Guillemets in Swiss (standard) German typography, i.e. «...»\n\n"
    },
    {
      "time": "5 Jan 2007 — 4:48pm",
      "content": "Here’s an older thread, where quotes were also discussed.\n\n[http://typophile.com/node/21213](http://web.archive.org/web/20140607030904/http:/typophile.com/node/21213 \"http://typophile.com/node/21213\")\n\nMore on Tim’s comment:  \nIn finnish it’s okay to use a wide variety of quote marks. ”…”, ’…’, »…» and I think there used to be this old germanish style, not sure which way these should point: „…”.\n\nMost of this applies to swedish and perhaps norwegian and danish, too.\n\n"
    },
    {
      "time": "5 Jan 2007 — 5:27pm",
      "content": "Tim, I'm referring to the basic \" and ': what you might label as sixes and nines (no smart\\*ss remarks please!), as in:\n\n\"Oh, look!\" and \"I once referred to the revolutionary army in Columbia known as 'FARC' but someone thought I had said 'f\\*rt'. \"\n\nThat's the western-side-of-the-pond style -- the eastern side would have reversed them, and put the period at the very end. Note also that I did leave a space between the period and the closed double quote: that's also fairly common in American and most Canadian style books when one has enclosed something in single quotes at the end of the sentence, not as a general practice.\n\n"
    },
    {
      "time": "5 Jan 2007 — 5:39pm",
      "content": "(Standard _english_ quotes?)\n\nI don’t mean to smarten my ass here but isn’t the end double quote wrong in your example, Linda? We’re talking about quotes here, after all. :^)\n\nAlso, what do you mean by “the eastern side would have reversed them”?\n\n"
    },
    {
      "time": "5 Jan 2007 — 7:58pm",
      "content": "Nope, I've got doubles at each end, and use singles within to show _soi-disant_ quoted material. In the UK, the reverse would be standard practice. For example, TimD and his colleagues would have written\n\n'Oh, look!' and 'I once referred to the revolutionary army in Columbia know as \"FARC\" but someone thought I had said \"f\\*rt\"'. (Note the order of the double, single, and then period and compare to my previous example.)\n\nIs there one way to punctuate English? Um, well, I guess it depends on where you live.... If it didn't, editors like me would be out of work pretty quick. ;-)\n\n"
    },
    {
      "time": "6 Jan 2007 — 3:29am",
      "content": "Your last double points to right in my eyes (which Patricia has checked just this week ;^\\>), it’s 66, not 99.\n\nYeah, but the quotes are the same, some just use singles as primary. (Standard english…)\n\nReversing was about reversing the order? I somehow thought you meant we or the britons flip them around or something… All clear now.\n\n"
    },
    {
      "time": "6 Jan 2007 — 3:38am",
      "content": "\\>For example, TimD and his colleagues would have written\n\nI would never write something so vulgar – how's that for effete? :)\n\nTim\n\n"
    },
    {
      "time": "6 Jan 2007 — 7:24am",
      "content": "Some more examples [here](http://web.archive.org/web/20140607030904/http:/www.kltf.de/downloads/SpacingIssues-kltf.pdf).  \nIt seems it was only recently\\* that Americans, Britains, Germans stopped spacing punctuation marks; my assumption is that this was caused by technical limitations in the first place (photo typesetting, then digital typesetting).\n\n\\* I.e. beginning to midth of the 20th century.\n\n"
    },
    {
      "time": "6 Jan 2007 — 7:57am",
      "content": "Thanks for the interesting topic and examples.\n\nLooking at the examples, spacing out the question mark and exclamation so much doesn't make sense to me, and doesn't look so good, as it functions just like a period and comma. These are visually heavier than the comma and period, and so maybe could have a little more air around them, I think, and that is a good idea. But the spacing around them in the examples I think is excessive.\n\nThe semi-colon and colon could be given a bit more space in theory, as they function somewhat differently: they break the middle of a sentence more than a comma does. Also they again are a bit heavier than the period and comma. Still to my eyes, which are used to the tight style, the hair space looks a bit disruptive.\n\nThe quotes to my eyes do look better spaced a bit more widely than the other punctuation. And I think there is some logic to it: they come in pairs, and by spacing more, the pair is more evident.\n\nAlso I think Patty's observation that some typefaces have the quotes too tight lends weight to this. For example Minion's quotes are quite tight.\n\nSo my conclusion is personally to look again at the punctuation in the typeface I am working on. I will check that the heaviness of the question and exclamation have enough 'air' to balance. And I will experiment with adding just bit more space to the the colon and semi colon, and quotes--not necessarily to the same amounts. Then I'll see how it looks in settings.\n\nThe weight of a dot and its spacing can indeed affect the look of a whole page, so I think this is worth working on as a type designer.\n\nAs a typographer, I would look at whether adding a hair space, eg. to Minion's quotes, would help.\n\nedit: now that I think of it, there is a problem with single right quotes, as these are used also as apostrophes. So maybe the better solution will lie in kerning or substitution.\n\n"
    },
    {
      "time": "6 Jan 2007 — 8:02am",
      "content": "pattyfab\\* wrote:  \n<cite>Of course you can \"make your own judgments\" it's a free country (or world) but you have to be conscious of the conventions as well, lest you risk looking like you just don't know how to typeset. If you like that extra space &amp; want to add it, then be my guest, go ahead and add it, but don't look here for justification. It certainly ain't done on this side of the pond.</cite>\n\n!? -- Obviously not that free, as your last sentence indicates.\n\nIf you write 'lest you risk looking like you just don't know how to typeset' you may be right, unfortunately. But typographic knowledge may be a bit more than having learned a handful of rules at school. If it's possible to look into o.o.p. American books on my side of the pond, on your side it should be even easier.\n\nBtw, when using German/British/American quotation marks, too much spacing looks strange indeed. And even though I appreciate spaced punctuation marks, this cannot be done as generously today as it was done in previous times.\n\n\\* Not Linda Cunningham as I wrote!\n\n"
    },
    {
      "time": "6 Jan 2007 — 8:12am",
      "content": "Karsten brings up an interesting point related to a personal project I've been working on over the past ten years. And ever since Tiffany mentioned that\n\n_As much of an antiquarian I like to think myself, I know it isn’t good to follow what was done during the days of the incunabula and after unless that is the specific look I’m going for because it isn’t how we do things now._\n\nI have been chewing on this for the past couple of years. I'd love to get some feedback from you guys about it. (And Tiffany, I realize you are talking about incunabula but you also say \"and after\" so that certainly would include the 19th century.)\n\nMy project is an English translation of Alphonse Daudet's _Letters from my Mill,_ illustrated with my own black-and-white photographs of the places in Provence that Daudet describes. The book is a classic of French literature set in Provence in the late 19th century, at that time considered by Parisians to be very much a \"foreign place.\" Daudet wrote a series of letters published in the Paris papers, and these were later gathered to make the book. Provence, with its own language and customs, was being quickly eclipsed by the northern industrial energies of France (for example, it was against the law to speak Provençal in public). In a sense, Daudet did for the Provençal culture what photographer Edward Curtis did for the North American Indians, trying to preserve the spirit of something that was changing rapidly. It is a beautiful set of small observations about human nature, and I believe it deserves to be better-known in the Anglophone world.\n\nAnyhoo, the very best translation of this work that I could find is from England, 1893. Although it does not have guillemets, and handles dialogue differently from Daudet's original French, it _does_ employ the spacing that Karsten is talking about. Because the book is so firmly rooted in the 19th century, some part of me wants to preserve those subtle cadences in the typography -- although I hasten to add that I have made my own choice of printing type (Adobe Garamond) different from the spidery and contrasty type used in the book and much smoother in tone.\n\nThe example below follows modern typographic conventions, although I did keep the em-dashes closed up (rather than my more typical practice of en-dashes with mild amounts of space both sides). The book is planned for black-and-gray duotones, with gray printer used to set stick-up caps and footnotes, black printer for regular text. The footnotes are my own addition, wanting to illuminate for the reader some of the references in Daudet's text that will be unfamiliar to most anglophones.\n\nBut lately I've been thinking that in addition to the em-dashes, I'd like to retain the spaces before question marks, semi-colons, and so forth. If I choose to keep the typographic details intact -- to provide something of the experience that a reader would have picking up the actual 1893 book -- will that be confusing, or will it help to take the reader back in time?\n\nThanks for any comments.\n\nAlso, I've been getting very mixed reviews of the footnotes as I pass the page proofs around to a wide variety of people. Some adore them and say that they add lots of value to the reading experience; others say \"It reminds me of stuff I had to read in college with [note of horror creeps into voice] _footnotes._ Yuck!\" Thoughts?\n\nBruce\n\n ![](http://web.archive.org/web/20140607030904im_/http:/typophile.com/files/8-9spread_5915.jpg)\n\n"
    },
    {
      "time": "6 Jan 2007 — 8:27am",
      "content": "Very nice. Side notes are usually more attractive than foot notes, but won't go with your layout.\n\nI personally don't have a problem with your footnotes, though. I think the small size you have given them is appropriate. You might consider using a slightly tapered or other slightly more decorative rule. That may give a pleasant 19th century feel, I think, and may work if sufficiently unobtrusive.\n\nThe other option is to have them as end-notes. The question is, I guess, how often you think the reader will need to refer to them. If not so often, or later, then end-notes will do.\n\nHaving both a comma and an em dash (second column) looks like a mistake.\n\n"
    },
    {
      "time": "6 Jan 2007 — 8:37am",
      "content": "Thanks for your thumb up on the footnotes. I will not do them as end notes for the very reason you cite -- my thought was, if they are small and gray, and you want to ignore them, you can, and if you want to consult them, there they are. End notes require walking to the next county and human nature simply doesn't want to do that.\n\nGreat suggestion about belly rules.\n\nComma and em dash as set here is me following the 1893 edition out the window. I didn't feel that I could change that, hence my leaning toward perhaps preserving even more of the feeling of the 1893 book.\n\n"
    },
    {
      "time": "6 Jan 2007 — 8:42am",
      "content": "Actually, Karsten, I didn't say that -- Patty did. (We're usually not easy to confuse, however: I'm the old Canuck, she's the young Noo Yawka....)\n\nSorry TimD ;-) I'm positive that you would have made a much more refined cultural reference -- I was just listening to a report on South American politics at the time.\n\nLove the picture, type, and use of footnotes, Bruce: what prompted you to take on this project? I've been considering something similar, using a friend's poem and creating a small chapbook....\n\n"
    },
    {
      "time": "6 Jan 2007 — 9:00am",
      "content": "<cite>Actually, Karsten, I didn’t say that — Patty did.</cite>\n\nI'll correct it!\n\n"
    },
    {
      "time": "6 Jan 2007 — 9:28am",
      "content": "Yes, the footnotes are unobtrusive enough that they don't disturb. I like the idea to setting them in grey, so show that they are of less importance than the text itself.\n\nComma and emdash, colon and emdash, semicolon and emdash, comma and emdash and opening parenthesis -- I particularly remember both a book by B.H. Smart of 1842 and reviews of it (in \"Literary Examiner\", text by John Stuart Mill, or \"The Monthly Review\") where all these appear frequently; same in the USA, for example F.A. Rauch's \"Psychology\", NY: Dodd, 1841; G. Boole's \"Laws of Thought\", NY: Macmillan, 1854.\n\nAnother funny thing: The way we today quote in emails, by preceding lines like this  \n\\> This is  \n\\> a quote!  \nwas at some time used to indicate speach and quotes, like this  \n\" This is  \n\" a quote!  \n(But the 66 version.)\n\n"
    },
    {
      "time": "6 Jan 2007 — 9:36am",
      "content": "_Love the picture, type, and use of footnotes, Bruce: what prompted you to take on this project?_\n\nI lived in Grenoble in 1968-69 for a year and it was a life-changing experience (I was 18-19). A particularly interesting time to be there as it was right after «les événements de mai» (for those not familiar with this, it was a unified uprising of workers and students against the de Gaulle government in May 1968). I also took to the language and luckily became pretty fluent. Ever since I have generally kept a French book by my bedside as well as something in English (right now Voltaire's _Candide_ is bunking with Barbara Kingsolver's _Poisonwood Bible_ -- which makes for rather marked contrasts in venue! -- but it could just as easily be poetry or a _roman policier_.\n\nAt one point in my thirties I was visiting my parents and noticed a small Nelson edition of Daudet (in French). I had always heard of this book but had never encountered it in school, so I picked it up and as I read through it, I was deeply moved by it. For better than a century the book was always on booklists in the _lycée_ and therefore a real cultural anchor, but I think now it may be less widely read. I get the impression that Daudet's star is fading in modern French culture, as is Anatole France's, perhaps because they don't do enough with plot and inner psychological stuff in characters -- rather they remain as more naturalistic observers, interested but in a way neutral.\n\nGiven my affection for Provence, and for the stories in Daudet's book, I began to think of this illustrated edition. In the past, any illustrated editions in France were always done by well-known childrens' illustrators. My thought was that a lot of anglo readers had been introduced to Provence by the often amusing (but to my heart definiely l-i-t-e) writing of Peter Mayle, and wasn't it time they encountered a _real_ Provençal writer? I felt that the tone and content of Daudet would be better-suited to a modern anglo audience than Giono or Pagnol or Bosco, all very worthy writers, but the great thing about Daudet is that he is describing Provence for a foreign audience (Parisians) and the book gives a vivid sense of what life was like in those days. The best-selling edition of _Letters_ here in the States was issued by Little Brown and was quite a cold translation. Eventually I found the one I'm using, by Frank Hunter Potter, and it manages to preserve the same twinkle-in-the-eye light touches of Daudet's original in French.\n\nI have all the pictures taken, from various trips I made over the past ten years, and the book is all designed -- it's really just a matter of figuring out how to get it into print. I shopped it around to various main-line publishers and they all made complimentary noises but said no. I think they are all terrified of visual books in general, and of this book because it doesn't fit into a neatly-defined pigeonhole that someone like Barnes and Noble can use. They say it's too expensive to go in literature, and has too much text to go in travel or photography! My intention all along was that it would go to independent bookstores (Hey, people who actually think! and who make personalized recommendations to their customers. Sorry, that is probably unfair) rather than chains, but it still has to be published by someone. A few years ago a very distinguished literary press was interested and I actually signed a prelim contract with them, but I was afraid I'd lose control of the production and design, and decided to back out, preferring that it not be published at all rather than issued in a compromised state. So for the moment it sits. It's planned as a 7.25 x 10.75 (18 x 27 cm) upright, 160 pages. Hope I can do something with it someday, even if ultimately I just \"give it to the world\" as a PDF.\n\n_I’ve been considering something similar, using a friend’s poem and creating a small chapbook…._\n\nWell worth doing, as long as you can figure out distribution. I recently did a lovely book with a friend who is a poet and restoration bookbinder. We printed all the sheets on acid-free paper on my laserwriter (did it all in 4s) and then she gathered them and bound them in a small edition. Worked great. The trouble with my book is the pictures, which requires a very high price of admission. Given all the shifts in the market, perhaps I can convince one of my good book-printer friends to go in with me and I'll end up marketing it myself, but no time for that right now.\n\nSpeaking of things Canuck, another fantastic book I discovered as an adult is _Maria Chapdelaine._ I would adore to make a photographic edition of that, but perhaps it's already been done. (I wonder if it's even been translated into English?)\n\nOkay, back to work.\n\n"
    },
    {
      "time": "6 Jan 2007 — 9:58am",
      "content": "Karsten: I was careful to say \"convention\" instead of \"rule\". There is a difference—at least IMO. And as is clear on this thread as well as several others, the conventions are open to question and evolve over time. There are authors who don't even use quotation marks.\n\nMy background is in book publishing where Chicago is the lingua franca. Even a slight deviation from the standards will be red-penciled; you can't just decide you want to use a spaced en where an em is called for in the manuscript.\n\nI do find it frustrating when people decide to reinvent punctuation as it suits them. These conventions have a purpose, they let us understand where there is a break in a thought; where a snippet of dialogue ends; where one thought connects with another. But I realize that those who want to bend or break the \"rules\" don't want to be convinced otherwise—to them the rules are a tool of the establishment.\n\nTo them I say: Vive la revolution! But like I said, don't expect me to pat you on the back.\n\n"
    },
    {
      "time": "6 Jan 2007 — 11:11am",
      "content": "Thank you Karsten for you learned remarks on well-spaced punctuation and for its historical contextualization. The examples you supply (in the PDF) are also extremely illuminating and confirm that technology, or its limitations, dictates typographical practice that in turn become ‘rules’. However, we seem to be in a fortunate position that allows us to re-apply some finer points, careful spacing of punctuation being one of them – providing we are not enthralled by the dictates of mega-corporations (e.g. Chicago). We are simply reclaiming and rediscovering the world of hairline spaces, thin spaces, word spaces, em spaces etc. (the fact that some traditions have a longer memory is completly immaterial).\n\nTwo important issues seem to arise: the first is that regardless of the tradition we subscribe to, punctuation marks require extra-special care in fine typography and secondly, that by broadening our typographical catchment area we can be expressive. Consider how Bringhurst set in English Tschichold’s ‘The Form of the Book’ – with guillemets!\n\nI can only reiterate your eloquent and finely set final words:\n\n<cite><br>\nIt would appear that with the advent of digital typesetting, typographic knowledge got<br>\nlost. At first, technology had imposed its limitations. Succeeding generations then<br>\nwere raised with typographic standards that were not set by typographers any more but by office applications and their 'users'. Now educational efforts are necessary to make aware of the need for proper spacing - just like oldstyle figures had to be re-introduced to typographic consciousness.</cite>\n\n"
    },
    {
      "time": "6 Jan 2007 — 11:25am",
      "content": "Bruce writes:  \n_Speaking of things Canuck, another fantastic book I discovered as an adult is_ Maria Chapdelaine. _I would adore to make a photographic edition of that, but perhaps it’s already been done. (I wonder if it’s even been translated into English?)_\n\nGoodness, yes -- I remember reading it years ago. I also work hard to keep up my French: our local uni runs immersion weekends out in the mountains with good food but, unfortunately, no wine. Bummer! ;-(\n\nThe project I'm thinking of doing would likely be a one-off -- when Jan first published that collection, she set the type and bound off a few copies for friends before it was picked up by a \"mainstream\" house (and then went on to get the Governor-General's prize for English poetry), so I certainly wouldn't want to compete with that. ;-)\n\n"
    },
    {
      "time": "6 Jan 2007 — 12:41pm",
      "content": "In fact, Bruce, there are several translations available free online: one at [http://etext.virginia.edu/toc/modeng/public/HemMari.html](http://web.archive.org/web/20140607030904/http:/etext.virginia.edu/toc/modeng/public/HemMari.html \"http://etext.virginia.edu/toc/modeng/public/HemMari.html\") and another through Project Gutenberg....\n\n"
    },
    {
      "time": "6 Jan 2007 — 3:35pm",
      "content": "Bruce, I find the Garamond too generic, and inappropriate for the era.  \nI'd say take the reader back with full 19th century style, using a Scotch modern and the punctuation spacing that intrigues you so. A little bit of kerning and not such a large word space as was used then, would keep it from being too strange, and those are details taken care of by today's fonts. If the footnotes are a bit much on the page, group them at chapter end, or book end.\n\n"
    },
    {
      "time": "6 Jan 2007 — 3:44pm",
      "content": "I can't quite understand what the _purpose_ of this thread's suggestion might be; that is, if the suggestion is to add space inside quotation marks, to what end? What is the purpose of doing so? How would it benefit the reader? How would it improve the typography?\n\nForgive me, but this looks, on the surface, like an attempt to show one's typographic astuteness, but is in fact just a snipe hunt.\n\nAs a few have here commented, \"airing out\" quotes would simply introduce gaps and dots to the text block, massively increasing the likelihood of visible \"rivers.\"\n\nLet alone the issue of indented paragraphs beginning with quotes, or, god forbid, large drop-cap/initials with quotes (how far out into the margin do you want to hang that quote?).\n\nThe ongoing dilemma about spacing em- & en-dashes seems to me grounded in this problem: spacing them \"looks\" better close up, but creates gaps from a distance. This dilemma continues to keep many of us up at night.\n\nThe argument for convention has it's benefits, but perhaps, at different periods, there is/was a convention for both (\"aired\"/not \"aired\"). The current convention seems to lean towards the not \"aired\" variety. Conventions are useful, of course, but they should, indeed, be challenged if there is _good reason_ to challenge them.\n\nSo, my question: Is there really any _good_ reason to introduce space inside quotation marks (other than to impress others with an historical anomoly)?\n\n"
    },
    {
      "time": "7 Jan 2007 — 1:28am",
      "content": "If exclamation marks, question marks, colons, semicolons, guillemets glue at the word, they are hard to recognize. ('Welll' or 'Well!') With a little space between word and mark, one can <cite>see</cite> the structure of a sentence more easily.\n\nEn- and em-dashes: in a German text it is quite clear if an en-dash is used as a 'gedankenstrich' (giving thought a break) because there is a space to its left/right, or if it indicates distances because there is no space ('Hamburg--Berlin'). A useful distinction.  \nBut it matters whether an en- or em-dash is used, how long it actually is (depends on the typeface), and <cite>how much</cite> space is added. Of course it is nonsense to add much space around a long em-dash, and produce an even larger white space in the text.\n\nSpacing quotation marks really produce holes, as I said above.\n\nSpacing punctuation marks depends much on the overall spacing of a typeface. Some type designers give punctuation marks very little space, other give them a bit more by default. Like Verdana.&nbsp;&nbsp;:)  \nAs Nick indicated when he mentioned the too wide word spaces of earlier typography -- it would be nonsense to merely imitate earlier typographic habits. But I see no problem in picking out things that makes sense, typographically.\n\n"
    },
    {
      "time": "7 Jan 2007 — 2:01am",
      "content": "The ‘good reason’ is because ‘Perfect typography depends on perfect harmony between all of its elements [and] harmony is determined by relationships or proportions [that] are hidden everywhere’ (Jan Tschichold, <cite> The Form of the Book </cite>), most notably between the basic units of typography. Punctuation marks are no different in this respect from letters, and anyone who cares about kerning, should, by the same token, care about how the thin-space preceding a colon.\n\nIf anything, the ‘historical anomaly’ is not to thin space punctuation marks, but **not** to do so.\n\n"
    },
    {
      "time": "7 Jan 2007 — 11:28am",
      "content": "Ornan, while to my mind quoting Tschichold is, again, simply stating one opinion (albeit one I tend to give large credence), and thus I don't think any reference or quotation makes something \"true,\" I do agree with the sentiment of your last post. But it seems to me this thread has not been specifically about harmony or balance, let alone \"perfect\" anything; what I've read here is a proposed protocol for inserting a set amount of space inside various punctuation characters. This kind of prescription appears to be rooted in digital typesetting as it has become so simple to automate typographic behaviour by simply scripting-in various replacements and insertions. While some here have drawn attention to the differences in metrics & kerning from one font to another, largely the issue has not been about kerning (which, I think, is the issue at hand), but about inserting spacial characters which are themselves relative and thus imposible to use as any sort of \"standard.\"\n\nTo my mind what Tschichold is talking about is attention to detail, something I think we're all clearly interested in, and by that I mean an attention to each project as distinct, each typeface as requiring its own treatment, each typographic instance as worthy of attention. When setting metal each double-quote may set differently than the last, thus spacing it requires the typesetter's attention, just as setting a closing double-quote after a comma often requires special attention digitally. But I suppose what I was responding to above was what seemed to be a one-size-fits-all approach that would introduce far more spacing problems than it would solve.\n\n"
    },
    {
      "time": "7 Jan 2007 — 12:00pm",
      "content": "Right Jason.  \nThere's no point in a blanket approach to one's spacing, because the built-in spacing of fonts has to be considered, and that varies hugely.  \nRobert Slimbach has probably paid more attention to spacing than most type designers, going so far as to insert negative kerning between letters and the space character, but even his approach is not consistent (nor should it be) amongst his types. For instance, he kerns \"space-Y\" in Myriad, but not Minion, while he kerns \"period-doublequoteright\" in both.  \nSlimbach is the fine typographer's friend, but his philosophy is the opposite of airyness.\n\nPoliphilus, your airy style has its merits, and there is nothing to stop you remixing Slimbach's metrics, or anyone else's, to fabulous effect. But I wouldn't hold it out as a general best practice.\n\n"
    },
    {
      "time": "7 Jan 2007 — 1:47pm",
      "content": "Jason, your point is well taken. You and Nick are right that one has to judge evey typeface according to its own merit and that there are certain risks in applying a blanket 'one-size-fits-all' approach. Karsten has convincingly demonstrated the rational behind airy punctuation (in his PDF) and explained its evolvement. I suppose that the only point I was trying to make is that within the confines of good taste and the quest for fine typography there is room for a greater tolerance with regard to spaces around punctuation marks. Moreover, this airiness is not only the current standard practice in France but also, until not too long ago, in most European countries.\n\n"
    },
    {
      "time": "8 Jan 2007 — 5:44am",
      "content": "\\>Slimbach is the fine typographer’s friend, but his philosophy is the opposite of airyness.\n\nI don't think anyone is doing better work than Slimbach on text types, but I don't like the very tight punctuation. It is more economical, which is what he was aiming for in Minion, I guess, but I think it compromises readability a bit.\n\nReflecting further on 'Poliphilus' and Karsten's examples, I think that punctuation on the loose and large side is a good idea for readability, but that the hair space style is unnecessary, and is distracting to eyes used to the tight style. Now my thinking is just to have punctuation a bit looser, compared to the current style.\n\nOf course, it should reflect the style of the font also.\n\n"
    },
    {
      "time": "8 Jan 2007 — 6:53am",
      "content": "I think the user has the option of adjusting such things on a per-job basis and that the type designer can not forsee all users intentions and only need make it possible for the user to make their own accomodations. This has always been done but it is very much easier with today's tools.\n\nChrisL\n\n"
    },
    {
      "time": "24 Jan 2007 — 11:56am",
      "content": "I noticed something while reading the scriptures the other day. The punctuation except for comma and stop did have a thin space (or a little more perhaps) before them. As I scanned the page, completely forgetting what I was really doing (!), I noticed that in some ways it helped the page. For instance. If you have a sentence ending in a question mark. I actually could see a little argument for it. But only a little space nothing even near a full-space.\n\n"
    }
  ]
}
