{
  "id": "30372",
  "title": "en dash at start or end of line?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "My first post – slightly nervous, hope it's not a stupid question.\n\nShould an en dash go at the end or the beginning of a line of text (I'm setting a heading so it's especially important).\n\nOr is it a matter of personal taste?\n\n",
  "author": "wordsfailme",
  "time": "5 Jan 2007 — 2:49am",
  "uid": "15625",
  "comments": [
    {
      "time": "5 Jan 2007 — 3:05am",
      "content": "Does it replace the word “to” or is it marking a pause?\n\nIf it’s “4 – 6” I’d put the whole thing one the same line.\n\nIf it’s a pause, it doesn’t matter that much. I’d probably put it on the next line, especially if it would “drop down” (like the “a” in your post) otherwise. The main thing is that the dash conveys the pause, which it will do in both cases, I think.\n\nI understand you asking this, since I don’t think the dash looks particularly good either way.\n\n"
    },
    {
      "time": "5 Jan 2007 — 3:15am",
      "content": "It's marking a pause. I always think it looks better on the next line but having never formally studied typography (sorry, I know that's dreadful) I'm often not sure –&nbsp;or confident –&nbsp;what the \"correct\" way to do things is.\n\n"
    },
    {
      "time": "5 Jan 2007 — 3:27am",
      "content": "I take it back. Here’s what I would do. Sometimes the gap the dash creates is too big. Do what looks best to you.\n\nHelsinki –  \nLondon\n\nRecovery takes at least  \n4 – 6 weeks\n\nI’m often not sure –  \nor confident\n\nI’m often not sure  \n– or confident  \n(Here the gap doesn’t matter as much it would in the first example.)\n\nMan, it’s been a while…\n\n"
    },
    {
      "time": "5 Jan 2007 — 3:37am",
      "content": "Okay –&nbsp;here it is. A very exciting topic, as you will see.\n\n ![](http://web.archive.org/web/20141022114918im_/http:/typophile.com/files/Page-8_5855.jpg)\n\n"
    },
    {
      "time": "5 Jan 2007 — 3:45am",
      "content": "I have always gone by the notion that written words are a way of capturing speech and making it live again in the brain of the reader. If the dash is supposed to convey a sense of pause, then it seems to me to be more effective at the end of the first line. This way the reader encounters the pause indicator, then takes a brief moment to move back over to the next line, and the elapsed time is slightly longer. Encountering it at the beginning of the next line comes as more of a surprise. Therefore, in my style book the dash is always best located at the end of the first line, but if spacing conditions make that ungraceful or impratical, then it goes at the beginning of the next line. The tiniest of subtleties, this, but fun to think about!\n\nIn your example, it's too bad that \"performance\" is such a long word, since it will make the \"meeting\" line even shorter when it loses the dash. Could you use a colon after \"performance\" instead of a dash?\n\n"
    },
    {
      "time": "5 Jan 2007 — 3:56am",
      "content": "Interesting.\n\nI like the colon idea, but it it still makes the \"meeting\" line short.\n\nA tricky one, but I'm glad it wasn't a totally stupid question.\n\n"
    },
    {
      "time": "5 Jan 2007 — 4:33am",
      "content": "What about changing the copy -- can you make that suggestion?\n\nCLADDING  \nPERFORMANCE:  \nMEETING THE  \nDEMANDS OF  \nSUSTAINABILITY\n\nCLADDING  \nPERFORMANCE:  \nCOMPLYING WITH  \nSUSTAINABILITY  \nDEMANDS\n\nHeads are so !@#$%^& tricky!\n\n"
    },
    {
      "time": "5 Jan 2007 — 4:50am",
      "content": "Since Meeting Sustainability Demands is almost a subtitle to Cladding Performance, I would be inclined to put the en dash at the end of the line, you could also use a lighter weight or an italic.  \nFor example\n\nCladding  \nPerformance  \n_Meeting  \nSustainability  \nDemands_\n\nor\n\n**Cladding  \nPerformance**    \nMeeting  \nSustainability  \nDemands\n\nTim\n\n"
    },
    {
      "time": "5 Jan 2007 — 5:11am",
      "content": "Interesting topic once again...\n\nAmerican Typesetting.  \nIn typesetting there is never a spaceband before or after a N-dash, M-dash or hyphen.  \nAn N-dash is used for \"through\" or as one above said \"to.\" Such as in dates, numbers. The Chicago Manual had one exception to this, and to this day, I still don't know why. It's \"award–winning.\" For some reason, that gets an N-dash.\n\nWhen you are pausing, it is a 1 M-dash. It was not widely used among the great writers of the 20th century. It was used by advertising copywriters abundently. Many New York City Art Directors in the late 1980s-early 1990s would tell the typeshops that if there must be a break near the M-dash, please leave it on the top line.\n\nPlease note: I did say this was American typesetting. Over the years, I've realized many differences in how the English typeset. Example: When in America you have a quote and end it, the period is tucked inside of the quote, \"Like this.\" However, in English-speaking Canada and the UK it is outside the quote, \"Like this\".\n\nGo figure!\n\nAnd in today's \"anyone can set type\" is anyone except those of us in the know, paying any attention? I don't think so. Not with the _New York Times_ prints full page ads with inch marks and not quote marks!\n\nThank you for letting me have my 2 cents this morning.\n\n"
    },
    {
      "time": "5 Jan 2007 — 6:46am",
      "content": "I love these types of topics. Where the answers spur forth more information than was requested and rarely is any of it useless filler.\n\nAs a designer, I've realized that commanding the written English language has become very important to communicating efficiently. I've never been very proficient at writing. So, every time I come across topics about grammar and punctuation, I make sure to pay especial attention to the details listed. I've learned a lot about the less obvious ornamental punctuation that I had seldom used before. And now try to make a conscious effort to inject it into my writing in hopes of making things even more clear.\n\nSo, I don't actually have anything important to add, I wanted to thank you guys for keeping me in the know. Continue making me wiser!\n\n"
    },
    {
      "time": "5 Jan 2007 — 6:50am",
      "content": "I second the \"make it a colon instead\" suggestion. Or using two fonts, or ulc for \"meeting sustainability demands\". I'm not sure a dash (en or em) is appropriate here, and a dash starting a line looks weird to me.\n\nI realize the Brits use en dashes for pauses—with spaces around—but it still looks funny to my American eyes.\n\nFurther 2 cents: can you come up with more elegant word than sustainability? That's a LOT of syllables. Doesn't exactly trip off the tongue.\n\n"
    },
    {
      "time": "5 Jan 2007 — 7:09am",
      "content": "Sadly as a designer it's \"not my place\" to offer forth some of the solutions generously given here.\n\nHad I a copy editor sitting next to me, whole days to craft the spread to look absolutely beautiful, and a little more autonomy, I would be a happy girl.\n\nThe reality is that I have six other jobs demanding my time, have inherited the style sheets from a designer who is no longer here, and I wasn't part of the initial design process anyway.\n\nHo hum.\n\nBut yes, I'm enjoying the discussion, and feel like I'm learning lots. Thank you.\n\nOh, and by the way, I think we sometimes put the full stop outside the quotation marks, but only when the quotation makes up the whole sentence. i.e \"To be, or not to be: that is the question.\" If the quotation is part of a longer sentnce then we do put the full stop last.\n\n"
    },
    {
      "time": "5 Jan 2007 — 7:40am",
      "content": "\\> However, in English-speaking Canada and the UK it is outside the quote, “Like this”.\n\nNope. Most Canadian use today will have the punctuation within the quotes.\n\nAnd I also dispute the assumption that there are never spaces around an en-dash. It is quite common to use a spaced en dash in replace of an em-dash, which often makes a visually distracting hole in the color of a page. The spaced en is less distracting, I feel.\n\n"
    },
    {
      "time": "5 Jan 2007 — 9:11am",
      "content": "<cite>And I also dispute the assumption that there are never spaces around an en-dash. It is quite common to use a spaced en dash in replace of an em-dash, which often makes a visually distracting hole in the color of a page. The spaced en is less distracting, I feel.</cite>\n\nMy sentiments exactly. I think this is the european way.\n\nI also think it would be best to set the stuff after the dash in different style or size. Could you at least just get rid of the dash?\n\n"
    },
    {
      "time": "5 Jan 2007 — 8:03pm",
      "content": "I like a thin-spaced em, but not a spaced en -- to my eye, it looks lazy, but then, I'm an old f\\*rt.\n\nIn this case, a colon works just fine....\n\n"
    },
    {
      "time": "6 Jan 2007 — 3:22am",
      "content": "I once had to design a newspaper page with 4 different story headlines that all had colons and subheads. Awful. Should have killed the editor.\n\nAnyway, I resorted to all of these options:\n\nHeadline: Subhead\n**Headline**  \nSUBHEAD\nHEADLINE <cite>Subhead</cite>\nHeadline –  \n<cite>Subhead</cite>\n\nI think a dash to represent a pause makes much more sense at the end of the first section than at the beginning of the second. Like was said before, it more accurately depicts human speech and phrasing.\n\n"
    },
    {
      "time": "6 Jan 2007 — 3:35am",
      "content": "Given that you are stuck with the basic forms you posted I would say the en dash should go after performance. For two reasons, first aesthetic, since you are going to have a jagged right rag, pursuing a smooth left rag is more attractive; and second, I read it that there are various sub-sectors in which Cladding Performance has to meet demands and the en signals the subordination of the following copy.\n\nCLADDING  \nPERFORMANCE –  \nMEETING  \nSUSTAINABILITY  \nDEMANDS\n\nTim\n\n"
    },
    {
      "time": "6 Jan 2007 — 5:05am",
      "content": "_Oh, and by the way, I think we sometimes put the full stop outside the quotation marks, but only when the quotation makes up the whole sentence. i.e “To be, or not to be: that is the question.” If the quotation is part of a longer sentnce then we do put the full stop last._\n\nWordsfailme - if you had a copyeditor next to right now - they'd take the colon out of the \"To be or not be, that is the question.\" Colons are are used to separate the sentence from the list. A more appropriate punctuation for that may be the semi-colon \"To be or not to be; that is the question.\" —also the comma after the first to be is unnecessary. If you were writing this for cue cards, you might consider writing it \"To be, (to show actor to pause) or not—(to show actor longer exaggerated pause) that is the question.\n\nI did remember on exception to a space for the 1-M dash. That would be in a quote. If you were \"giving credit to someone for saying this.\" —Anon there were always be a space between the end quote and the m-dash.\n\nAnd I'm with you. I miss the old days when we had professionals doing the work. Your type was delivered at 9am to your drawing board...and the new day over the rubber cement odors began.\n\n\\*\\*\\*\n\nDon McCahill  \nCould you please let Alex Trebek know they changed this. One thing I've never cared for on Jeopardy was the fact that the punction remained outside the quote—and their response over the years was \"it's the Canadian way.\"'\n\nCurious - when did it change? I've been out of a type shop since 1991, and they were still following the Queen's English when I left.\n\n\\*\\*\\*\\*\n\nTruthfully, I prefer some \"air\" around the m-dash and n-dash -- but as a typesetter, I had to go by the book. It just didn't exist and wasn't to be set.\n\nAn interesting type misadventure I once had was with St. Martin Books. I was re-setting the interior of one of their books and M-dashes were called for. The font they were setting it in had a very narrow M, therefore the M-dashes appeared to be about the size of anothr fonts hyphen or N-dash. To give them the visual effect they needed, we went to 3-M dash. Sorry, just had to share.\n\n"
    },
    {
      "time": "6 Jan 2007 — 6:22am",
      "content": "The second closest thing to a manuscript of Hamlet that exists quotes\n\nTo be, or not to be, that is the question,\n\n(the closest thing is regarded as the “bad” quarto)  \n [http://www.bl.uk/treasures/shakespeare/basics.html](http://web.archive.org/web/20141022114918/http:/www.bl.uk/treasures/shakespeare/basics.html \"http://www.bl.uk/treasures/shakespeare/basics.html\")\n\nand\n\n[http://www.bl.uk/treasures/shakespeare/hamlet.html](http://web.archive.org/web/20141022114918/http:/www.bl.uk/treasures/shakespeare/hamlet.html \"http://www.bl.uk/treasures/shakespeare/hamlet.html\")\n\nHowever, many online resources use the colons and a comma, as this is not a book to be read silently, it is a speech to be made on stage which does make a difference as you note.\n\nTim\n\n"
    },
    {
      "time": "6 Jan 2007 — 7:22am",
      "content": "One of the most moving performances I have ever experienced was in the late 1980s, when Shakespearian actor Brian Bedford appeared in a small lecture hall in Portland, Maine (US). Perhaps 200 seats, set on a steeply sloped floor, small and simple stage, quite an intimate setting. The entire set consisted of one stoll, set in the center of the stage. Mr. Bedford came out, sat on the stool, and gave two extended groups of soliloquies with a break in between. Sometimes he cried out in room-filling dramatic passion, sometimes in barely a whisper, but even then audible to all in the room. Completely, utterly magical. It is certainly true that Shakespeare was meant to be heard if at all possible, and not simply read.\n\n"
    },
    {
      "time": "6 Jan 2007 — 1:52pm",
      "content": "Firstly, I always space around my en dashes, but never when hyphenating words. I also prefer to keep them on the top line, as opposed to starting a line with a dash, it bothers me that the first character is not a letter.\n\n_Could you please let Alex Trebek know they changed this. One thing I’ve never cared for on Jeopardy was the fact that the punction remained outside the quote—and their response over the years was “it’s the Canadian way.”’_\n\nWhen I went through school, and granted it was part US and part Canadian education, I was taught that punctuation goes on the inside the quotes if it's the proper end to the sentence; otherwise it falls on the outside.\n\nEx. In the case of Jeopardy it's probably \"correct\". Where, were we to quote Alex saying, \"It's how punctuation is taught in Canada.\"\n\nMaybe that's a bad example, and most likely lacking proper grammar, but I'm no copywriter.\n\n"
    },
    {
      "time": "6 Jan 2007 — 5:03pm",
      "content": "Most of the places where I've worked would leave the dash at the end of the line, never at the beginning of the next line.\n\n"
    },
    {
      "time": "8 Jan 2007 — 1:52pm",
      "content": "Fortunately this isn't Hollywood Squares, for it seems that my blue-collar approach is not popular. In the variety of treatment given to hyphens, endashes and emdashes from various faces, eras, locales, and publishers of varying competency, my eyes have developed a habit of assuming that any line ending in a dash is supposed to be a hyphen. This simplistic approach is not high typography, but the functional opposite. From an aesthetic standpoint, I think this also works well as a convention, leaving the \"weak\" ending of a line created by the lightness of a dash as a marker to quickly jump to the next line and continue, as if there were really on line, and self-editing the hiccup as my brain proccesses the text.\n\nMuch more pause is created by putting it on the second line, and there is less ambiguity to the untrained (in local customs of the 'setter) eye. Unfortunately, an endash at the start of a line is not pretty, and an emdash seems like it would give a better rhythm, but better not pretty than ambiguous and not pretty.\n\n[Choz Cunningham](http://web.archive.org/web/20141022114918/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20141022114918/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20141022114918/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": "9 Jan 2007 — 8:19am",
      "content": "My guess is that you have already made the decision—the 3 am post time gives this a sence of urgency, but\n\nit all depends on what it is that you mean to say.\n\nIf you want to differentiate between the two parts of the headline you may use:  \nshapes, including punctuation, uppercase v lowercase, small caps, italic, etc.  \nattributes, including weight, color, texture  \ncontexts, including scale, position (space)\n\nWhether you use the dash or not remember, to paraphrase Duke Ellington, \"If it looks good, it is good.\"\n\n"
    },
    {
      "time": "9 Jan 2007 — 8:35am",
      "content": "Great advice, Charles. :^)\n\nI think the time below the name tells the time on your time zone, not the poster’s.\n\n"
    },
    {
      "time": "21 Jan 2007 — 6:48am",
      "content": " **The Left Margin Highlights Paragraph Structure**\n\nI agree with what seems the majority opinion on Wordsfailme's original question: If the dash can't be avoided, it should be placed at the end of the upper line.\n\nI do the same in any standard paragraph of Roman text because the left margin structures the contents. A gap at the beginning of a line is most often created by an indent and thus signals the beginning of a new paragraph; and a dash at the beginning of a line is often used to highlight the topics of a list. Because of these conventions, the smooth line of the left margin should be broken only where this gap coincides with some kind of paragraph break. A dash gap at the right margin, on the other hand, doesn't matter that much, because punctuation and hyphenation often make even a justified right margin look slightly ragged anyway.\n\n**Arguments against American Convention – Dashes and Spacing**\n\nAs was already pointed out in another thread (which I'm unable to find right now), there is much to commend the German (or more generally European) use of the en dash – including the disuse of the em dash – to the typographer: To indicate a break in the flow of thought or speech, use an en dash with word spaces before and after; when abbreviating 'from A to B' (Hamburg–München, 12–16 hrs), use an en dash with no spaces (or very thin spaces to compensate for deficient automatic kerning).\n\nFrom a graphic point of view (turn the page upside down), the American unspaced em dash is a long line that _connects_ two objects, i.e. the words on either side of it. That is, it produces a large hole in the texture of the page – while failing to divide the sentence. Where this discrepancy between content and design becomes most painful is a justified line in which all words are divided by plenty of white space, except those at a logical break in the sentence marked by a dash, which are tied together in one black cluster.\n\nTo rephrase and conclude: The American convention uses _connecting_ lines (dashes) between both logically divided and logically connected words or numbers. The European convention, in contrast, uses _connecting_ lines (dahes) where words or numbers are logically _connected_, and _dividing_ white spaces, enlarged and classified as such by a freestanding dash, where words and phrases are logically _divided_. And since the two uses are differentiated by the presence or absence of spaces, the lanky em dash can be dispensed with.\n\nI suggest American typographers change their habits.\n\n"
    },
    {
      "time": "21 Jan 2007 — 7:20am",
      "content": "Philipp\n\nAn American typographer worth their salt - always left a hairline crack between a last letter, the M dash, and the first letter...\n\nAnd one American saying we all live by is, \"If it ain't broke, don't fix it.\"\n\n"
    },
    {
      "time": "21 Jan 2007 — 9:16am",
      "content": "<cite>always left a hairline crack between a last letter, the M dash, and the first letter</cite>\n\nThe problem with justified text remains. I also don’t think _connecting_ is about whether the dash physically touches the letter or not but is it closer than regular words.\n\n"
    }
  ]
}
