{
  "id": "30392",
  "title": "Fonthelp for identity needed",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi, and Happy New Year to all of you!\n\nI’m working on a visual identity for a furniture manufacturer.  \nAt this moment we (the customer and I) has agreed on a “concept” for the logo. (Attachment)  \nA “tag”-based concept, which are to be used further in a variety of angles, positions and so on. All good, I like that, and the customer loves it. The goal is to create a profile which is playful, but at the same time has references to the industry. Hope you understand.\n\nThen. The customer loves the logo set in Helvetica Neue, and I hate to admit, but I kind of think it works in capitals.\n\nAnyways, if this is to be used. I want to present a complete manual for font use, sizes and weights. Headings, body etc.\n\nSo, now im kind of in the dark with all of this.  \nWhat’s recommended? Find a sans similar to Helvetica Neue (but better, more readable for smaller body copys). Or, leave Helvetica Neue for logo only. And maybe use something completely different for the rest of the profile? A nice modern serif or something?\n\nAnswers and tips are much appreciated!\n\nThanks alot,\n\nMathias\n\n| Attachment | Size |\n| --- | --- |\n| [mokasser\\_logo.jpg](http://web.archive.org/web/20080919140614/http:/typophile.com/files/mokasser_logo.jpg) | 57.62 KB |\n\n [‹ Neon sign Gotham font](http://web.archive.org/web/20080919140614/http:/www.typophile.com/node/30467 \"Go to previous forum topic\") [Has this Cooper face been revived? ›](http://web.archive.org/web/20080919140614/http:/www.typophile.com/node/30393 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080919140614/http://www.typophile.com/user/15321\" title=\"View user profile.\">Mathias</a>",
  "time": "<br>",
  "uid": "15321",
  "comments": [
    {
      "time": " 5.Jan.2007 11.38pm",
      "content": "Hi Mathias,\n\nI really liked the logo and its simplicity. though I also know that whatever you write in helvetica neue, will always look good ;-)\n\nKeep helvetica on the logo as well as you can use it in headings, but I think u should look for some other non serif typeface which can be paired with helvetica. Because helvetica doesnt look good in body text as i feel.\n\nsatya -  \nIndia\n\n"
    },
    {
      "time": " 6.Jan.2007 4.59am",
      "content": "\\>Or, leave Helvetica Neue for logo only. And maybe use something completely different for the rest of the profile? A nice modern serif or something?\n\nYes, i think this is a good way to keep the \\*”Alleinstellungsmerkmal” (unique characteristics) of the logo. I don’t like the concept to use the font used in the logo anywhere else in the corporate design. It weakens the logo in my opinion.\n\n\\* it’s german, sorry, i tried to translate it – unique characteristics – came out. I don’t know if it really gets the meaning…\n\nPS I like the logo, too.\n\n"
    },
    {
      "time": " 6.Jan.2007 5.39am",
      "content": "satya & poms: Thanks a lot for your answers and kind feedback! I think i’m more into the idea of not using helvetica neue further in the profile again. But I really need some tips on fonts or pairings that could “help” the logo and vice versa.\n\n"
    },
    {
      "time": " 10.Jan.2007 3.41am",
      "content": "Hmmm A rule that kinda has worked for me in pairing sans serifs and serifs is to try fonts from the same designer. Examples of fonts that work well together are (not suggestions in this case) ITC Avant Garde & Lubalin but this is overused by many designers (Grafik Magazine is a good example of the harmony between these 2 fonts) Another example is Univers and Serifa (both from Frutiger). In your case since Max didn’t design any exciting serifs how about using some of Tobias Frere-Jones’s typefaces like Gotham in the logo and a serif like Mercury. I have not tried this but I think it might work (all found on Typography.com) You could also try a font that has both serifs and sans weights) One that I recently used is Andrea Tinnes’s Skopex but this is in a different style than you already sketched for the client.\n\nBTW I also like the logo but think it is an easy way out for you. Anything looks good in Helvetica and it is the reason why it is so overused by designers today. Check out [www.the-letterbox.com.au](http://web.archive.org/web/20080919140614/http:/www.the-letterbox.com.au/ \"www.the-letterbox.com.au\") for funny comments on the topic (The book/publication Grand)\n\nDeath to Helvetica and long live creativity;-)\n\n"
    }
  ]
}
