{
  "id": "30410",
  "title": "New born!",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi! My name is Vinu Chaitanya and I am a graphic design student from India. I am new here... and 18 hrs old typophile.  \nThis is my first post. I thougt I would start off by getting some feedback on this letter integration attempt of mine. The letters I have used are the intitial of my name... 'V' and 'C' ( for Vinu Chaitanya). I would be grateful if you would spend a couple of minutes to tell me what you think I need to do to improve it in any way. I found the integration of V and C to be challenging because of the structures of these two letters... one being round and curved while the other having slanting lines with a pointed end. Waiting for feedback.\n\nVinu Chaitanya  \nGraphic design student  \nIndia\n\n ![](http://web.archive.org/web/20150223160009im_/http:/typophile.com/files/vc_4668.jpg)\n\n",
  "author": "vinu",
  "time": "7 Jan 2007 — 7:52am",
  "uid": "16124",
  "comments": [
    {
      "time": "7 Jan 2007 — 8:54am",
      "content": "Welcome, Vinu.\n\nThere is something very lovely about this. I've always been fond of the play of black and white, using gestalt to define or create space. I think this is successful.\n\n"
    },
    {
      "time": "7 Jan 2007 — 9:17am",
      "content": "Well done Vinu!  \nand welcome to our community!\n\nChrisL\n\n"
    },
    {
      "time": "7 Jan 2007 — 9:20am",
      "content": "I'm with Tiffany and Chris in liking the integration very much as well. It looks like you spent a lot of time on it. The only parts I don't love are the V's serifs. They remind me of [Copperplate Gothic's](http://web.archive.org/web/20150223160009/http:/www.myfonts.com/fonts/linotype/copperplate-gothic), which I find jarring here. I'd suggest either extending and refining them, making them more traditional in appearance, or removing them altogether. At the least, the righthand serif on the left stroke of the V needs to be smoothly bracketed; right now, the transition between the stroke and the serif is too abrupt.\n\nEDIT: I better chime in with a \"welcome!\" as well.\n\n"
    },
    {
      "time": "7 Jan 2007 — 3:10pm",
      "content": "Elegant! Before reading Reed's comment I also thought about the V's serifs, see if you can find an alternative, if you don't like it you can always stick with the original, which is lovely.\n\n"
    },
    {
      "time": "7 Jan 2007 — 3:41pm",
      "content": "Did I see a **y** in there? Now that is cool!\n\n"
    },
    {
      "time": "7 Jan 2007 — 5:23pm",
      "content": "Your combination is elegant. I would question your decision to crop it so closely on the sides. The tension created where the V's serifs touch the edges of the white rectangle is . It creates some strong figure-ground relationships that don't enhance your nice combination. How would it affect your design to center it in a square with space all around?\n\nWelcome to typophile.\n\nBill\n\n"
    },
    {
      "time": "8 Jan 2007 — 9:17am",
      "content": "india is in good hands.  \ngood luck in your future endeavors...\n\n"
    },
    {
      "time": "8 Jan 2007 — 10:09am",
      "content": "Thank you so much for all your feedback. I agree... the serifs of V are jarring. Here are a couple of alternate options...or should I work on the serifs of the first one itself???  \nVinu Chaitanya  \nGraphic design sutdent  \nIndia\n\n ![](http://web.archive.org/web/20150223160009im_/http:/typophile.com/files/option1_5013.jpg)\n\n ![](http://web.archive.org/web/20150223160009im_/http:/typophile.com/files/option2_5441.jpg)\n\n"
    },
    {
      "time": "8 Jan 2007 — 10:51am",
      "content": "Between the two revisions, I prefer the serifed V, as the unserifed one feels a bit plain, as well as oddly proportioned for a sans serif letter. The V's new serifs are impeccably executed. My only concern is that the serifs place emphasis on the white space in between the V's strokes, distracting from the white space shape of the C. You might try removing one of the serifs to see if that de-emphasizes the center white space as it should be. But, again, I really like your design -- it feels fresh, but is easily \"read.\"\n\n"
    }
  ]
}
