{
  "id": "30424",
  "title": "computer tablets?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "i was looking for a tablet, becuase i think it’d be a useful tool, but was surprised to see they were like $200-$400.\n\nI also have trouble finding them in stores too.\n\nanyone got any helpful tips?\n\n",
  "author": "<a href=\"user/8034\" title=\"View user profile.\">evilfansanfran</a>",
  "time": "<br>",
  "uid": "8034",
  "comments": [
    {
      "time": " 8 January, 2007 - 4:09am",
      "content": "[http://eshop.macsales.com/shop/ModBook](http://web.archive.org/web/20070308154934/http:/eshop.macsales.com/shop/ModBook)\n\nI don’t know what this is, and I don’t think it is inexpensive?  \nBut it just might be worth a look?\n\nKTKM\n\n"
    },
    {
      "time": " 8 January, 2007 - 4:19am",
      "content": "Try one for a while before you splash out too much, some people don’t get on with them, like those horrid ice-pucks that Apple used to have.  \nTim\n\n"
    },
    {
      "time": " 8 January, 2007 - 4:31am",
      "content": "I agree with Tim - find one to try somewhere before you buy - to start out a 4x5 is fine - I have one but use my mouse more, it is just more comfortable after years of use. see  \n [http://www.wacom.com/productinfo/](http://web.archive.org/web/20070308154934/http:/www.wacom.com/productinfo/)\n\n"
    },
    {
      "time": " 8 January, 2007 - 4:31am",
      "content": "<cite>“like those horrid ice-pucks that Apple used to have”</cite>\n\nThat was ten years ago (more or less). :^)\n\nKTKM\n\n"
    },
    {
      "time": " 8 January, 2007 - 4:38am",
      "content": "Sorry about the Mac propaganda.  \nI think Wacom is great! I can even recommend Intuos3 A5 – I use it at home, and I have never used a mouse since.\n\nKTKM\n\n"
    },
    {
      "time": " 8 January, 2007 - 5:18am",
      "content": "I haven’t used tablets much but I’m always told that Wacoms are the only option.\n\n"
    },
    {
      "time": " 9 January, 2007 - 10:20pm",
      "content": "Did you mean computer tablet (input device) or tablet computer (type of portable computer)?\n\nIf you can get used to absolute positioning, and take the time to exploit pressure sensitivity in the applications that can understand it, it will totally change your digital art.\n\nI’ve used Wacoms before. I bought a 6x8 generic labeled US Logic pad, and it works fantastically (when I can find my stylus). It cost 43 dollars with shipping on eBay [Something like this](http://web.archive.org/web/20070308154934/http:/cgi.ebay.com/Graphic-Tablet-New_W0QQitemZ150078388543QQihZ005QQcategoryZ3680QQrdZ1QQcmdZViewItem).  \nPros - It’s huge, sensitive and drivers were stable.  \nCons - theres a AAA battery in the pen, (lasts forever), only one input end (no “eraser”) and it only affects the primary monitor.\n\nA same-sized Wacom is nicer, but I don’t know if it is 10x better. Supposedly they are multimonitor friendly. Perhaps if it recognized pen twists much more clearly it would be a more obvious winner.\n\n[Choz Cunningham](http://web.archive.org/web/20070308154934/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20070308154934/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20070308154934/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": " 6 March, 2007 - 2:12am",
      "content": "input device. Does anyone know of a really cheap good one online? I know thats asking a lot.\n\n"
    },
    {
      "time": " 6 March, 2007 - 11:52am",
      "content": "“The ebay” is the way.\n\n[Take this preloaded search, then fiddle with the options](http://web.archive.org/web/20070308154934/http:/search.ebay.com/search/search.dll?sofocus=so&sbrftog=1&catref=C6&fcl=3&from=R10&satitle=-wacom+-chinese+-graphire+-intuos+-digitizer&sacat=3680%26catref%3DC6&sargn=-1%26saslc%3D2&sadis=200&fpos=37207&sascs=2&fasi=1&ftrt=1&ftrv=1&price=1&saprclo=&saprchi=40&fsop=3&fsoo=1)\n\n"
    },
    {
      "time": " 6 March, 2007 - 2:10pm",
      "content": "I have two tablets, a 4x5 Grapphire for general use and portability, along with a 9x12 intuos 3 that I use for serious photo retouching and other things that come along. When I really get serious about it I actually clamp one of my LCDs to my drawing table and lay the big tablet on there, it’s a very sweet setup.\n\nWacom does sell fully-functional tablets at a pretty nice academic discount if you’re eligible (or just feel like comping up a fake course schedule) Academicsuperstore.com and sprysoft.com both sell the discounted tablets.\n\nKeep in mind that Wacom’s intuos tablets cost so much because they come with a lifetime warranty, driver updates that last as long as the OS can support the hardware (Wacom eventually dropped the old hardware because of hardware support problems Apple created in OS X, but otherwise provides great support for old models), and because Adobe designs its apps to work with Wacom tablets. Not to mention that they’re super-sensitive and a dream to use.\n\n"
    },
    {
      "time": " 6 March, 2007 - 9:40pm",
      "content": "James’ link led to this. A cool $50 refurb 4x5 w/ 1 yr warranty. If it isn’t the end-all tablet you want, it would make a very wise “cheap now, back up later”. If you need a tablet, you need a backup.\n\n[http://www.academicsuperstore.com/market/marketdisp.html?PartNo=789617&qk\\_srch=wacom](http://web.archive.org/web/20070308154934/http:/www.academicsuperstore.com/market/marketdisp.html?PartNo=789617&qk_srch=wacom)\n\n"
    }
  ]
}
