{
  "id": "30430",
  "title": "Frutiger - Different Versions",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Dear Typophiles,\n\nI am going to see a client in London next week to discuss their use of the Frutiger typeface. They contacted me a few weeks ago asking for some help in standardising their versions. Now, I do not have any idea what version of the font they are using, but I want to prepare myself properly for the meeting and show to them that I actually have some idea of what is going on!\n\nNow, as I understand it, the original Frutiger typeface is owned by Linotype, but other font foundry's have also created the 14 weight family. i.e. Monotype (Frutiger MT) and Bitstream (Humanist 777). Please correct me if this is inaccurate.\n\nThe main reason that they want to meet with me is that their marketing, design, and print departments seem to be using conflicting versions of the font, and they want to standardise on one version so that their brand is consistent.\n\nI am going to ask the respective font foundry's for some sample settings to take to the client, but is there any other information, i.e. good/bad points about all three that should be considered. I know that most of you will say to me that the original Frutiger should be used, and I agree with this, but I would like to give the client some options and a bit of history.\n\nLook forward to any responses.\n\nKind regards  \nNeil\n\n",
  "author": "schaffs",
  "time": "8 Jan 2007 — 7:05am",
  "uid": "1502",
  "comments": [
    {
      "time": "8 Jan 2007 — 7:17am",
      "content": "Please factor into your discussion that Adrian Frutiger re-drew his homonymous font with true italic characters and optically adjusted weights a few years ago.\n\nThis \"new\" family was released in 2000 and is known as Frutiger Next.\n\n"
    },
    {
      "time": "8 Jan 2007 — 10:06am",
      "content": "I agree with John, unless they're in-love with the original oblique italics, suggesting they standardize on Frutiger Next might be the way to go. If they want to modernize the look I'd disuade them from using Myriad (as it's a bit over-used) and maybe suggest they look at Luc's Corpid.\n\n"
    },
    {
      "time": "8 Jan 2007 — 10:18am",
      "content": "Also check out Segoe, Microsoft's _homage_ to the Frutiger typeface -- your client will probably be running it on their PCs internally, so that should be figured in to the mix.\n\n"
    },
    {
      "time": "8 Jan 2007 — 10:22am",
      "content": "Other issues aside, lack of availability on the Mac may make that a bad choice.\n\n"
    },
    {
      "time": "8 Jan 2007 — 10:55am",
      "content": "If they're OpenType it _shouldn't_ be an issue, which brings me to this question...\n\nSii, what's up with Microsoft taking so long with OpenType compatibility? I had all my Office programs crap out on me after installing the Linotype Originals (OT) library on my computer. Had to have an IT guy come straighten it out. I would think Microsoft as a partner on OT would be actively integrating it into their software. Whazzup wit dat?\n\n"
    },
    {
      "time": "8 Jan 2007 — 11:22am",
      "content": "Should have been clearer - copying them from Windows to the Mac would break the EULA.\n\nI’ve not heard of the problem described with either Office on the Mac or Windows. The Windows Vista text services devs and testers have access to many Linotype OTF’s (especially the slightly quirky mega-families) under license and I don’t recall any reported problems.\n\nAnyway I’ll check with the Linotype folks - I’m sure if this is a common occurrence they’ll have the details.\n\n"
    },
    {
      "time": "8 Jan 2007 — 12:32pm",
      "content": "And then to really throw you a curve ball - I've been finding folks using Myriad - and thinking it's Frutiger....\n\n"
    },
    {
      "time": "8 Jan 2007 — 12:41pm",
      "content": "That would be a leg spinner, mate.\n\n"
    },
    {
      "time": "8 Jan 2007 — 4:09pm",
      "content": "Neil Schaffer, I've read your quote in your profile, it's quite reversible.\n\n"
    },
    {
      "time": "9 Jan 2007 — 3:26am",
      "content": "Thankyou to all that responded, very very helpful, and I will mention Frutuger Next as an option to the client.\n\nThanks again\n\nNeil\n\n"
    },
    {
      "time": "5 Dec 2011 — 10:04am",
      "content": "I don't mean to bump an old thread or derail the O.P.'s discussion, but I want to ask a question about Segoe.\n\n_Also check out Segoe, Microsoft's homage to the Frutiger typeface -- your client will probably be running it on their PCs internally, so that should be figured in to the mix._\n\nNick,\n\nDo you know if Segoe, Segoe WP specifically, can be licensed to a non-Microsoft affiliated company who wants to use it as their new corporate house font? I'd imagine not and I haven't found a place where one can buy it off the shelf to use however they please, either.\n\n"
    },
    {
      "time": "5 Dec 2011 — 10:39am",
      "content": "I didn't mean to call on just Nick, if anyone else knows anything about my above post, feel free to chime in.\n\n"
    },
    {
      "time": "6 Dec 2011 — 2:52am",
      "content": "[This](http://web.archive.org/web/20131020082302/http:/www.ascendercorp.com/font/segoe-tv/) might be a good starting point.\n\n"
    }
  ]
}
