{
  "id": "30452",
  "title": "New Letterhead Fonts antipiracy font lockdown scheme",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Has anyone else dealt yet with the new LetterheadFonts.com method for installing/using fonts? I recently bought one of their new fonts since they converted their entire library over to OpenType in late December. And aside from the very nice font I must say I am quite dismayed. Here is what they've done:\n\n1. You no longer receive an actual font file, at least not that you can see.\n\n2. Instead what you download is an installer that installs an application called \"Letterhead Fonts\" (at least on Macintosh which is what I use).\n\n3. The fonts are either embedded in this \"Letterhead Fonts\" application or somewhere else unknown/hidden from the user. No fonts are installed in the traditional Font folder locations.\n\n4. Once installed, the \"Letterhead Fonts\" application activates the fonts permanently, at least as far as I can tell, like a font manager. You see them only in the font menus of your other applications, nowhere else. It also doesn't currently allow fonts to be seen or managed in font manager applications like Suitcase, Font Agent, etc., though LHF apparently plans to add this capability.\n\nAside from the obvious antipiracy objective, here are the biggest ramifications and problems I see for the user (myself, for one):\n\n- You are completely prohibited from organizing the fonts like you want on your hard drive, such as for classification or other purposes. All your flexibility is taken away including any system or method that you might have had in place to manage fonts for your own needs.\n\n- As mentioned, the LHF fonts can't be activated individually. It's an all or nothing proposition. (Unless/until they enable font managers to \"see\" the fonts perhaps, but maybe not even then, I haven't seen them say.)\n\n- It means you can't add kerning pairs to a font, for example, or otherwise tweak the font yourself if problems are found or you have special needs.\n\n- And of course, you can't really back up the fonts themselves. Your only recourse if something were to happen is a reinstall from the various installers you may have accumulated over time, or else go back to their site for the installers there. (They do make provision for downloading previous font orders you have made with their new shopping cart system.)\n\nA real shame since this will probably make a lot of people think twice about buying additional fonts once they see how it works the first time. I know it has me, despite LHF's unique fonts. Lots of other good independent foundries around these days as alternatives. What do the rest of you think about where LHF has gone with this?\n\n",
  "author": "zebrasystem",
  "time": "8 Jan 2007 — 5:52pm",
  "uid": "14442",
  "comments": [
    {
      "time": "8 Jan 2007 — 6:23pm",
      "content": "Do they make any provisions for sending jobs to print including their fonts? That seems like another rather large issue.\n\nDo you have InDesign? What happens if you try to package a job that uses their fonts? Just curious.\n\nLike you, I find this offputting.\n\n"
    },
    {
      "time": "8 Jan 2007 — 6:32pm",
      "content": "It's problematic for the legit user, but if Apple and Adobe can load their fonts onto your menus so that you can't get rid of the damn things, all power to an Indie foundry for strutting its stuff.\n\nI don't think they're the first to use installers, Tankard and Hoefler have gone done this route, haven't they?\n\n"
    },
    {
      "time": "8 Jan 2007 — 6:53pm",
      "content": "I have no idea how the Mac works with respect to this but it would seem that its totally possible for an 'installer' to enumerate fonts from memory or from a hidden file every time the machine is booted. After all this is how font managers work. I can't help but think that this, like most protection schemes, causes headaches for legitimate users, but would be quite easy to crack. But providing they're up-front about the unconventional nature of their product, then best of luck to them.\n\n"
    },
    {
      "time": "8 Jan 2007 — 6:55pm",
      "content": "Can't say I blame them for trying. It doesn't keep their fonts off the internet, but it's probably good at keeping one design teacher from passing them on to a hundred students who will use them in commercial work for a decade after graduation. And it probably wipes out intra-office piracy in companies without technically adept designers.\n\n"
    },
    {
      "time": "8 Jan 2007 — 7:30pm",
      "content": "I'm all for doing everything we can to prevent theft, and I can certainly understand why LHF would impose such a scheme. It's a real shame, though. I was about to make a sizable purchase of their fonts and the new policy has turned me off completely. It's unworkable for the creative professional. Maybe for the signmakers that use their site it doesn't matter, but for designers such as myself it's yet one more technology hassle that puts severe restrictions on my capabilities and workflow. I am praying they ditch it sooner rather than later. Are you reading LHF??? Pleeeeeease!\n\n"
    },
    {
      "time": "8 Jan 2007 — 7:56pm",
      "content": "You could contact them directly, you never know they may be willing to bend the rules for a \"sizable purchase\" esp. if they feel you're trustworthy - can't hurt to ask.\n\n"
    },
    {
      "time": "8 Jan 2007 — 9:43pm",
      "content": "Regarding the question about packaging an InDesign job with one of the new LHF fonts: No, InDesign's font packaging didn't work for me, nor does imbedding them in PDFs. LHF's suggested solution for PDFs is to convert the fonts to outlines first. Of course, without Adobe Reader's \"Smooth line art\" preference checkbox turned on, fonts turned to outlines in PDFs look quite cruddy except at very large point sizes. I don't know what the default setting is these days, but I remember a few years ago that was not set by default, and clients usually do not know or bother to change it. If this is still the case, previewing jobs for clients via PDF would be a problem.\n\nAbout the comment whether LHF is \"up-front about the unconventional nature of their product\": I would say partially but not completely. They do say in their FAQ about the new OpenType fonts, and I quote:\n\n\"Q. My Letterhead Fonts aren't in the regular font folder!  \n A. Letterhead Fonts work a bit differently than normal fonts in that they aren't installed in the Fonts folder. But you will see them in your applications.\"\n\n\"Q. The fonts are not displaying in FontBook or Suitcase.  \nA. While you may see your Letterhead Fonts in font management programs such as FontBook or Suitcase, you won't be able to turn them on or off. And of course you won't be able to install Letterhead Fonts using your font management program since they must be installed using the Letterhead Fonts Installer. This has no effect on how the fonts function in your design applications however.\"\n\nThe FAQ does mention the fonts won't embed in PDFs and to convert to outlines first. However, despite the mention that fonts are not installed in the regular Fonts folder(s), it wasn't clear, at least to me, that you don't get a font file you can deal with at least \\*somewhere\\* on your hard drive as you wish, that activating any LHF font means all of them get activated, and that you can't turn a font off without completely uninstalling it. I mean, after years of dealing with fonts and being able to do all these things, your assumption is most likely going to be that you still will in \\*some\\* fashion, unless explicitly told you can't.\n\nThey also do not mention you can't package a job in InDesign for a service bureau, though someone knowledgeable could probably assume that from the statement fonts aren't embeddable in PDFs. And while they say converting fonts to outlines for PDFs \"may add a bit to the file size, the end result is visually the same as if you had embedded the fonts,\" this will be true if Adobe Reader's preference for \"Smooth line art\" is set, but otherwise not. (Which it may or may not be by default. Someone else will have to weigh in on that.) All in all, less than full disclosure in my view.\n\nAlso, I went to LHF's online forums to see if others were commenting or complaining and found their forums are now gone. I don't know how long that's been the case or if it's a permanent thing or not. It does make one wonder whether the disappearance was intentional so they wouldn't have deal with public criticism on their site. Then again, perhaps they are busy now dealing with the new system in place and just wanted space.\n\n"
    },
    {
      "time": "8 Jan 2007 — 10:03pm",
      "content": "Thanks for the further details. Maybe they'll comment here?\n\n"
    },
    {
      "time": "8 Jan 2007 — 10:53pm",
      "content": "So does the Letterhead DRM system require an internet connection to use the fonts? I'm trying to figure out what's to keep someone from just redistributing the executables, aside from some watermarks and lawyers.\n\n"
    },
    {
      "time": "9 Jan 2007 — 1:49am",
      "content": "These fonts have to be \\*somewhere\\*… and if they are, they are extractable. OR there is some encrypting added, which would make the process of extracting the font files somewhat harder.  \nMy guess: they are inside the application (control click on the icon and choose Show package contents).\n\n"
    },
    {
      "time": "9 Jan 2007 — 4:01am",
      "content": "While I realise that LHF fonts are (all?) display fonts, so quite not as much of an issue as if you were dealing with pages of text, converting fonts to outlines adds a considerable amount of effort to a PDF workflow from your DTP app.\n\nUnless there's a way anyone's heard of to convert fonts to outlines 'on the fly' while printing to PDF, it means embedding all your text as graphics rather than being able to edit in the DTP app, and if there any changes, going back to an editable text version and saving a new outline copy.\n\n"
    },
    {
      "time": "9 Jan 2007 — 7:17am",
      "content": "'Anti-Piracy' is just a way to say 'anti-consumer'. Blech.\n\nBut I agree with Bert, open the package itself and see if you can grab the files.\n\nThe 'can't embed in a PDF' would be a show stopper for me, though. That's absurd.\n\n"
    },
    {
      "time": "9 Jan 2007 — 7:39am",
      "content": "\\>But I agree with Bert, open the package itself and see if you can grab the files.\n\nI disagree. If you don't like the protection scheme just don't license the product. Someone might get their jollies cracking the product for 'fun' in the privacy of their own home, and although this is quite sad, providing they don't publicize the hack then no harm is done.\n\n"
    },
    {
      "time": "9 Jan 2007 — 7:40am",
      "content": "I had looked inside the application package cursorily earlier but not too closely, and didn't see anything that easily stood out indicating a font anywhere. Also had done a drive-wide search for any file containing the five core characters of the main font name without finding anything. This morning I dug a little deeper and first performed a drive-wide global search for invisible items. When that didn't turn anything up, I went back and did a \"show package contents\" on the LHF application package again to look closer.\n\nNot counting the usual tiny little incidental files, there's just three files of any size there. In the \"MacOS\" folder of the package there's a file named \"FontInstaller\" at 316 KB in size. Then inside the \"Resources\" folder of the package there are two more, one named \"FontInstallation.icns\" at 56 KB and \"FontInstaller.icns\" also at 56 KB. Making copies of either file, then changing the file extension to .otf and opening with FontLab just to see what might happen gives nothing other than a blank new font.\n\nP.S. (edit) Sii, I didn't know the font was going to be protected like this when I bought it. It was not clear to me from LHF's FAQ, and I feel like I was taken for a bit of a ride here. Glad it was just one font I purchased so I'm not out much money.\n\n"
    },
    {
      "time": "9 Jan 2007 — 7:44am",
      "content": "I hope we get more information.  \nI wonder if other manufacturers are going this route?\n\nFor someone like myself having every font opened would mean my system would slow down drastically and I'd never get any work out.\n\nAlso, the printer I use, who still won't get Quark 7, doesn't do Open Type - so to hand my work over to a professional - would be difficult. Would Letterhead expect my printer to buy everyone of their fonts so my work could be printed out professionally? Do they have anything in their guidelines (like URW) about being able to send the \"font\" with the job to the printer?\n\nIsn't this what killed QuarkXPress?\n\n"
    },
    {
      "time": "9 Jan 2007 — 8:19am",
      "content": "Okay, it turns out I overlooked something and did end up finding the font on the drive, but I suppose it would be best if I do not say how or where. In the end, at least for a user at my level, it doesn't matter because the font is still not recognized by either FontLab or Suitcase, both of which I tried. I assume that must mean some type of compression or encryption (attempted expansion with UnStuffIt did not work, though), so we are still where we were before with the consequences of all this.\n\n"
    },
    {
      "time": "9 Jan 2007 — 8:46am",
      "content": "Zebra, thanks for the notification. I certainly won’t be buying anything from them now. I’m glad there are House Industries, Veer, Sudtipos and others… I think this is disrespecting towards almost all of the paying customers and not likely to stop pirating of their fonts. (If that’s been a problem, I don’t know.)\n\nIt would be nice to hear some of the reasoning behind this.\n\n"
    },
    {
      "time": "9 Jan 2007 — 8:56am",
      "content": "Chuck has expressed continued despair the few times I've e-mailed him in regards font piracy. His actions are his choice and I hope this becomes something he is happy with. However, just like a overly restrictive EULA, this will surely keep some people from licensing from him. People such as myself, for instance, (and others above) who really do prefer to control their fonts. He has some gorgeous stuff for license, but surely this is a sad day.\n\nHoefler and House both had installers, but you could still manage the fonts.\n\n"
    },
    {
      "time": "9 Jan 2007 — 8:59am",
      "content": "\\>Sii, I didn’t know the font was going to be protected like this when I bought it. It was not clear to me from LHF’s FAQ, and I feel like I was taken for a bit of a ride here.\n\nFair enough, but I'd suggest you talk to them. Also glad to see you support not turning Typophile into Typo-H@X0RZ-forum. ;-)\n\n"
    },
    {
      "time": "9 Jan 2007 — 9:02am",
      "content": "_The ‘can’t embed in a PDF’ would be a show stopper for me, though. That’s absurd._\n\nAnd, ultimately, bad business. If we can't show clients a pdf proof, or publish the document like that for the web, then I won't buy their fonts.\n\nTalk about cutting off your nose to spite your face....\n\n"
    },
    {
      "time": "9 Jan 2007 — 9:08am",
      "content": "_These fonts have to be \\*somewhere\\*… and if they are, they are extractable._\n\nNot necessarily. My guess is that the LHF app loads the font set into memory (RAM), in much the same way that \"opening\" an OT font file by clicking loads an individual font on-disk into memory.\n\nFor as long as the fonts are loaded into RAM they show up in DTP apps and can be used. When the LHF app is closed down the fonts would be unloaded from RAM and no longer available in DTP apps.\n\n_OR there is some encrypting added, which would make the process of extracting the font files somewhat harder._\n\nIn a way, probably, the LHF fonts are \"encrypted\" as code compiled as part of the LHF app's .EXE file (or whatever file(s) comprise the app). Extracting them would be implausible unless the user happens to have decompiler software capable of decompiling the LHF app files into constituant components.\n\nExtracting the fonts from RAM while they're loaded is even more implausible.\n\n_What do the rest of you think about where LHF has gone with this?_\n\nThey appear to have taken serious measures to prevent further piracy of their products, since illegitemate users are very keen on stealing LHF fonts. In that sense it's a measure of how desirable their fonts are, and a rebuttal to the immoral, cynical, interminably immature mindset of those who insist on stealing them.\n\nLHF's hand has been tipped.\n\nThe user-end compromises entailed by the solution they've adopted seem impractical to me too, but the people who baulk at it should ask Chuck Davis or Richard Kegler what it's like and how it feels having to clean up the mess every time their fonts are ripped off and posted on the web for free. It's constant, ongoing, and a pain in the arse.\n\nAnd all because their fonts are popular. The \"reward\" for making excellent artistically-crafted fonts is a heartache\n\nPut yourselves in Chuck's shoes and see it from his point of view.\n\nThis also illustrates the basic fallacy inherent in the digital \"media revolution\". The bright new future of digital audio, video and graphic arts is open to wholesale abuse.\n\nj a m e s\n\n"
    },
    {
      "time": "9 Jan 2007 — 9:11am",
      "content": "It is frustrating, indeed. But I fear Letterhead will see a decrease in sales, not the number of pirated fonts. The right anti-piracy method has not yet been developed, and until then, legitimate customers will suffer. It's best to continue to create and promote great type. Most of the pirates wouldn't buy the fonts anyway.\n\n"
    },
    {
      "time": "9 Jan 2007 — 9:12am",
      "content": "jpad, about an internet connection being required to use the LHF fonts. I reinstalled the font earlier today, and during the process Little Snitch did pop up an alert that the installer was phoning home, which I okayed as a one-time event only. The installation progress dialog box also put up a brief mention it was \"checking license\" or something to that effect during the process. Little Snitch hasn't indicated any further phoning home during use since then.\n\nI have a question: Would it be possible in theory as an alternate antipiracy solution to have some sort of product activation process (like for Adobe's CS2 products) that ties fonts to a particular machine, but still lets you move them around and work with them on your hard drive as you see fit? (Even make backup copies, but your product activation would have to be transferred to another machine or drive if you decided you needed to use them there?) Something like that I could live with. Or does product activation depend on an installation's files remaining stationery on the drive where things were originally installed?\n\n"
    },
    {
      "time": "9 Jan 2007 — 10:05am",
      "content": "\\>I’m glad there are House Industries, Veer, Sudtipos and others…\n\n\\>If we can’t show clients a pdf proof, or publish the document like that for the web, then I won’t buy their fonts.\n\nWell, that counts out the standard House Industries license - where anything other than PDF to the bureau costs extra. What's better a software solution that stops you from doing things against the EULA, or the EULA you don't read and end up breaking?\n\n"
    },
    {
      "time": "9 Jan 2007 — 10:14am",
      "content": "<cite>...does product activation depend on an installation’s files remaining stationery on the drive where things were originally installed?</cite>\n\nAFAIK, Adobe's activation scheme is tied to the hardware, and as long as you don't swap out the relevant hardware components you can move the software all over the place on a Mac. I've never tried moving software around under Windows (or any non-Mac \\*NIX OS) because complex Windows apps prefer staying put after being installed. Adobe's protection does, however, refuse to work if you screw around with the license management daemons, which are kept separate from the rest of the Adobe software. I once moved the management daemon library out of a directory when diagnosing a problem, and after moving it back I was unable to run _any_ Adobe apps, even after reinstalling the entire suite. It's been a while, but IIRC I had to reinstall the OS to fix the problem.\n\n"
    },
    {
      "time": "9 Jan 2007 — 10:23am",
      "content": "\"I disagree. If you don’t like the protection scheme just don’t license the product. Someone might get their jollies cracking the product for ‘fun’ in the privacy of their own home, and although this is quite sad, providing they don’t publicize the hack then no harm is done.\"\n\nNothing sad about a consumer actually wanting to posses what they purchase. I dislike the whole 'it's just a license...not a purchase' guise the media industries hide behind.\n\nTRUST your customers. Be NICE to them. Give them a REASON to keep giving you money in the future.\n\nLook at this thread here. They've already tainted their image through just one PAYING customer being annoyed.\n\n\"What’s better a software solution that stops you from doing things against the EULA, or the EULA you don’t read and end up breaking?\"\n\nIt's better to not bother. Consumers don't read EULAs.\n\n"
    },
    {
      "time": "9 Jan 2007 — 10:30am",
      "content": "Darrel, consumers that care do read EULAs.\n\n"
    },
    {
      "time": "9 Jan 2007 — 10:37am",
      "content": "The font components are downloaded by the LHF Service and placed in:\n\n/Applications/Letterhead Fonts/Contents/Resources/LHFService/Contents/Resources/fonts/\n\nThese files are still not generally functional. They might be modifying the data slightly just before making the ATS call to activate the font. It's not entirely clear what problems this might pose for FontExplorer or Suitcase users. Running two font managers at once has been problematic in the past. When a font is activated by ATS it is not entirely possible to hide it's location. The complete font may only exist temporarily, but it is possible to find it's location.\n\nI think the other stated reasons are more important for avoiding these fonts. Really this is not flexible enough for professional design work. In most cases, a very similar font will be available from a major vendor without the potential headaches.\n\n"
    },
    {
      "time": "9 Jan 2007 — 10:41am",
      "content": "\\>Look at this thread here. They’ve already tainted their image through just one PAYING customer being annoyed.\n\nIf the paying customer had said \"I spoke to the vendor and they said - tough luck, and sent me packing\" then there may be some validitiy to this. So far no one has indicated that they've even spoken to the vendor.\n\n\\>It’s better to not bother. Consumers don’t read EULAs.\n\nThat'll change, esp. once they get sent the invoice a few months after they've posted a PDF containing the fonts on their blog.\n\n"
    },
    {
      "time": "9 Jan 2007 — 10:53am",
      "content": "--<cite>Consumers don’t read EULAs.</cite>\n\n--<cite>consumers that care do read EULAs.</cite>\n\n[Do you adhere to EULAs for typefaces that you purchase?](http://web.archive.org/web/20150227204230/http:/typophile.com/node/16239)\n\n"
    },
    {
      "time": "3 Apr 2008 — 9:40pm",
      "content": "Going in a different direction here from the previous comments. Just out of curiosity, and maybe this is a naive question, but I'm wondering... How does LHF's new scheme of embedding a purchaser's font file with their account number and other identifying info work so as not to cause functional problems with the operation of the font?\n\n"
    },
    {
      "time": "9 Jan 2007 — 11:26am",
      "content": "I will say this about Quark and EULAs - if you Collect for Output in Quark it point blank asks you if you have read the license and are complying with its restrictions. Of course then it lets you go ahead and collect anyway, but I think it's cool they ask.\n\nThat said, I rarely read EULAs. Sorry. Doesn't mean I'm not aware of font piracy issues.\n\nI would NEVER buy a font I couldn't turn on and off at will.\n\n"
    },
    {
      "time": "9 Jan 2007 — 11:48am",
      "content": "\\>Sii, I posted this here instead of talking to the vendor first because I did not want my complaint possibly being kept private.\n\nIt's unlikely they would have said \"we'll provide unlocked fonts providing you don't publicize the fact\" but you never know. Anyway thanks for providing us with the detailed explanation.\n\nCheers, Si\n\n"
    },
    {
      "time": "9 Jan 2007 — 11:56am",
      "content": "It's interesting that they're willing to bet their brand on this. If I were going to try to implement font DRM I would create a new brand. The reason is that the print/design community is very \"sticky\" with regard to their opinion of specific companies. If people who support Macs in education and publishing put up \"No Letterhead Fonts!\" policies, this sentiment could get stuck in consumers' minds. They may become affaid to use any LH fonts.\n\nAlso, I'm not sure it's been mentioned, but if LH decides to not to update their application to support new versions of Mac and Windows, font users could potentially lose their ability to use their fonts!\n\n"
    },
    {
      "time": "9 Jan 2007 — 11:57am",
      "content": "I am a consumer that reads the EULA, but cares less about it than consumer protection legislation. It's a contract? So what? A contract could be invalid, unconscionable, or unenforceable. And intellectual property rights are not natural law, but exist only to the extent that they are recognized by the state. So I respect a EULA only to the extent that it deserves respect.\n\n"
    },
    {
      "time": "9 Jan 2007 — 12:02pm",
      "content": "\\>It’s interesting that they’re willing to bet their brand on this. If I were going to try to implement font DRM I would create a new brand. The reason is that the print/design community is very “sticky” with regard to their opinion of specific companies.\n\nDo you think? People were quick to forgive Adobe when they tried and abandoned protection schemes. I don't think these guys have much if anything to lose by giving this technology a college try.\n\n"
    },
    {
      "time": "9 Jan 2007 — 12:45pm",
      "content": "<cite>People were quick to forgive Adobe when they tried and abandoned protection schemes.</cite>\n\nI think it's easier for companies who make multiple products, like Microsoft, Apple and Adobe. Just because I think the Zune's DRM makes it useless, doesn't mean I dislike SQL Server 2005.\n\nAlso, if it is something Adobe abandoned, then it is easier to forgive.\n\n"
    },
    {
      "time": "9 Jan 2007 — 12:49pm",
      "content": "Who do the makers think they are kidding? If it's possible to outline it before making a PDF, the font can be \"re-engineered\", right?\n\n"
    },
    {
      "time": "22 Aug 2007 — 1:53am",
      "content": "&nbsp;\n\n"
    },
    {
      "time": "9 Jan 2007 — 1:06pm",
      "content": "Thanks for commenting Chuck.  \nAs I said, all power to an indie foundry that wants to do things its way.\n\n"
    },
    {
      "time": "9 Jan 2007 — 1:06pm",
      "content": "its fonts.\n\n\"Why would you want to rekern any font? If the font you purchased is so lousy that you have to rekern it, I would suggest you ask for your money back.\" See Bringhurst v3.0 at 203-06.\n\n"
    },
    {
      "time": "9 Jan 2007 — 1:22pm",
      "content": "I wrote Chuck about this and he responded very courteously in a matter of minutes. I feel his pain. I absolutely hate the new protection scheme, but I for one will do everything in my power to try to work within it because I want to support Chuck. It's a good thing he has such wonderful fonts and such an obvious love for the craft or many of us might just decide it's not worth it.\n\n"
    },
    {
      "time": "9 Jan 2007 — 1:35pm",
      "content": "I have purchased many LHF types over the years and have long been a big fan of their products and their customer support. Whenever I have encountered any sort of difficulty they have been helpful, prompt, and gracious. Unfailingly. And I have always been scrupulously diligent about not allowing my LHF files out into the wild, out of respect for the designers and for LHF. Plus, they're mine!  \nI'm such a big fan that I've even purchased types from them that I don't even need. To satisfy my collector's impulse, or some other irrational motive. Abject affection, maybe.\n\nBut I will not buy anything from them as long as they employ this contrivance. No way.\n\n"
    },
    {
      "time": "9 Jan 2007 — 1:56pm",
      "content": "Chuck, I too want to thank you for your comments even though I am obviously unhappy with the new system. I do hope the increased sales continue to stay up. I don't know about others, but in my case buying one of the recent LH fonts was due to a feeling of pent-up demand for a choice new release from LHF because of the 2-year drought in font releases till your new system went live just recently. I would have bought more than a single font, but being unsure of what the new font installation system might entail, decided to play it safe.\n\nI've wondered for some time what the reason was for the lengthy absence of new releases, and tended to assume LHF must have been busy converting the entire preexisting catalog over to OpenType, which had to have been a huge task. In any event, my feeling at this point is I will probably end up buying a few more LH fonts in the future on occasion but at a significantly reduced level compared to the past because of the impact of the new scheme on our workflow. (I.e., \"must haves\" but not the \"like to haves\" like before.)\n\nAs the previous poster said, however, I continue to have great affection for LHF's fonts, and I hope fortune smiles on you and your business.\n\n"
    },
    {
      "time": "9 Jan 2007 — 2:04pm",
      "content": "Dear Chuck,\n\nI have dropped out of buying fonts for a few years. I purchase to rarely, a client has to give me a pretty good reason to spend the extra money.\n\nHowever, as a typesetter in New York City, when the Mac became the way, I plunked down more than $25,000 on a font library. Owning Letraset, Bitstream (Type 3, which they were kind enough to update to a Type 1 a year later), Monotype, Linotype, URW, Adobe (originally library was a mere $15,000 and talk about errors in fonts.), and many fine fonts from FontFont, FontHaus, etc. (BTW, do you have any idea how many Garamonds a typographer during 1989-1991 in New York had to buy to be legit?)\n\nIn my typeshop, I had a disgruntled worker. He made a copy of my entire library (including some original handtailored fonts) and gave it to his friend, a photographer, down the street. The friend decided to become a design shop, and you could imagine my face when I received a flyer from the \"other\" shop, letting my customers know that \"his\" library contained exclusives, and he could set the job better than who you are using today...\n\nI contacted Adobe immediately. Yes, I called in the Font Police. I learned pretty quickly that one person stealing a library wasn't worth their time and energy in legal fees. They referred me to a person at QuarkXPress. That was an interesting story. Quark found a consultant in New York who bought 25 copies of Quark. He placed them in one of the companies he was consulting for. Then he placed them repeatedly in other companies -- all using the same serial numbers. He did it so many times, that eventually companies started to contact Quark on their own to get the upgrades -- all using the same serial numbers. I still wonder how that lawsuit worked out -- that is what Adobe wanted me to know, you have to go after the big fish.\n\nIt isn't like you've lost a customer in me, I do like your fonts, and maybe one day, I'll be able to have a customer who appreciates them and is willing to pay the price. I no longer am. But the fonts I own, all licensed and legit -- I do need to pass on to my printer when I am doing book, advertising and magazine work.\n\nI am just sharing this. Maybe some would call it rambling. I do want you to know, I do know what it is like when one is stressed out in a business that is going nowhere, where your assets are being stolen - and worse, advertised against you. Sometimes you have to realize it is okay to move on.\n\nMeanwhile, I am curious, if someone did want to give a printer a pdf or have the font to give their absolutely, legitimate printer so their job looks exactly like they expect it to -- is the new licensing of Letterhead Fonts opposed to this? Or must we make a PDF in Photoshop, flatten it like a graphic, and have no fonts -- which means, oh no, more time on making type corrections down the road...\n\nAnd by the way -- I keep repeating myself lately, but I am amazed that a \"newbie\" can go on line, pick up tons of illegal fonts -- and have a better typography library than Photolettering did in 1989! Probably every typographer I knew, is rolling over in their graves... and most likely, laughing.\n\n"
    },
    {
      "time": "9 Jan 2007 — 3:09pm",
      "content": "Heron you only have to turn the typefaces to outlines, you don't need to rasterize them. All of Letterhead's fonts are display. I suppose turning the headings to outlines isn't that bad. It is just a nuisance.\n\nBeing involved with information sharing in between foundries, I've seen a disgusting amount of font piracy. I don't want anyone to think I'm against a foundry doing what they feel they must to protect there work. It is a business decision and like any business decision there is an upside and a downside. It sounds to me like you, Chuck, did what you felt you needed to do.\n\n"
    },
    {
      "time": "9 Jan 2007 — 3:20pm",
      "content": "\"Darrel, consumers that care do read EULAs.\"\n\nCare about what?\n\nConsumers want a simple transaction: Here's my money, give me my product.\n\nEULAs are only used to restrict the default assumptions of that transaction. They're bad, bad, bad. IMHO, of course. ;o)\n\n\"I am a consumer that reads the EULA, but cares less about it than consumer protection legislation.\"\n\nWell said.\n\n\"For those that say that protection is a slap in the face to the consumer or even hint that we are less friendly to our customers now— You obviously have never purchased anything from us or called us.\"\n\nIt is a slap in the face. I love Apple. I think they are a great company. But DRM on their songs is a slap in the face. Period.\n\nPiracy...the damaging kind...the ones where people are selling your goods...these aren't stupid people. They know how to get around DRM. There's a monetary reward for doing so.\n\nThe ones that aren't as damaging...the paying customer sending a font to the printer with the file or just wanting to make a PDF to send to a client...this just annoys them.\n\nChuck, good luck with it all. I hope that your protection scheme actually works as you intended. I have a strong hunch it won't, but would love to be proven wrong. Keep us posted. In the end, only you know your user base and perhaps this is the ideal solution for your target audience.\n\n"
    },
    {
      "time": "9 Jan 2007 — 3:47pm",
      "content": "Thanks for the response, Chuck. It's rare for any vendor to speak out candidly about piracy; I'm used to just hearing the same old statistics spewing out of lobbying organizations. Sometimes I think that there would be a lot less IP theft out there if businesses tried a little harder to put a face on things. Good luck to you, and sink or swim, please let us know how it works out.\n\n"
    },
    {
      "time": "9 Jan 2007 — 4:38pm",
      "content": "Chuck, I certainly feel your pain, but essentially breaking your customers' final product can't be the best way to do this. I wish I knew a better one, though ...\n\nConverting to curves means that the content of your files cannot be searched/indexed/aggregated/copied&pasted, and essentially breaks the whole metadata point of a PDF. It also means that my entire proof process - which is 100% PDF based, now - would have to be abandoned on any jobs I used LHF fonts on. I doubt any art department that uses PDF workflow from proofing onwards can afford to completely re-engineer their procedures just to accomodate your type, no matter how well made and attractive it is.\n\nMy 2¢. Good luck,\n\nJLT\n\n---\n\njlt : [http://www.hewnandhammered.com](http://web.archive.org/web/20150227204230/http:/www.hewnandhammered.com/ \"http://www.hewnandhammered.com\") : rnrmf!\n\n"
    },
    {
      "time": "9 Jan 2007 — 4:55pm",
      "content": "Thanks for your side of the story, Chuck. I appreciate the effort you made to explain your point of view at Typophile.\n\n_\\> From that point forward we began noticing increased cases of piracy._\n\nDid you also notice any affect on sales?\n\n"
    }
  ]
}
