{
  "id": "30468",
  "title": "San Serif Title & San Serif Body Text VS San Serif Title & Serif Body Text",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,\n\nI'm designing a corporate marketing book. The company currently uses Neuzeit S in their logos and titles. I need to pair it with a pertinent body text font. The previous design firm chose Times New Roman due to accessibility and availability in word documents, website default, etc. I want to change it, so I'm just wondering what you guys think about the use of a serif VS a san serif font. Also, any suggestions on what might go well with Neuzeit S.\n\nThanks.\n\n",
  "author": "<a href=\"/web/20120203231936/http://typophile.com/user/11314\" title=\"View user profile.\">daiukun</a>",
  "time": "<br>",
  "uid": "11314",
  "comments": [
    {
      "time": "",
      "content": "Charles Leonard just quoted Duke Elligton earlier. “If it looks good, it is good.” You need enough difference between the grotesques and it’s all good.\n\nFor serif, almost anything goes. Since it’s a book, I don’t think the geometry of Neuzeit is very good (for body text I mean). But whatever you choose, please no ITC Garamond, Stone or Rotis. I’ve had enough of those in marketing books. ;^)\n\n"
    },
    {
      "time": "",
      "content": "Modern/Romantic fonts like Bodoni, Didot, Walbaum, et al, are traditional companions for geometric sans-serifs. Many designers find these to be straining on the eye when used in long texts, however.\n\nNeuzeit S has the small aperture and similar body structure to Realist types like Clarendon, Century, Century Schoolbook, and the like, so these might be possibilities as well.\n\nDavid Thometz\n\n"
    },
    {
      "time": "",
      "content": "A \"Slimbach\" like Utopia, ITC Slimbach?  \nOr… if Times, better use Times Ten, much better read.\n\n"
    },
    {
      "time": "",
      "content": "thanks for the help guys. i'm going to look through these font suggestions. i want to find an ideal balance between how the font signifies the company ideals (they want to spin themselves as the \"new\" architects, progressive) and its utility.\n\n"
    }
  ]
}
