{
  "id": "30490",
  "title": "Any suggestions for Golf logo.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Good afternoon Ladies and Gentleman,\n\nI work on a Golf magazine here in the UK, imaginatively entitled ’Golf Pages’, and we are currently redesigning the Logo (and most of the magazine).\n\nThe old logo was in ITC esprit, and a little tired. However, the new logo suggested by the creative director is in Alba, and looks a little too-cool-for-school.\n\nWe’re trying not to alienate the traditionally older audience (or the PGA who officially sponsor the magazine) but also to give the logo a bit of life to it and make it a little less stuffy. I was thinking of a modern looking serif rather than sans, as i feel it suits golf a little more.\n\nHowever...the company wants to use a font we already own (in other words they’re tight) and I don’t think any of those we own are right, so I might buy one myself if its about £20-30.\n\nanyway here are the old and prospective new logos.\n\nAny advice or suggestions would be most welcome.\n\n ![](http://web.archive.org/web/20070911195517im_/http:/typophile.com/files/GOLFpages_LogoOld_4554.png)\n\n ![](http://web.archive.org/web/20070911195517im_/http:/typophile.com/files/GOLFPAGESLOGO_5353.png)\n\nMany thanks,\n\nGraham\n\n [‹ Ethiopic font (Feedel)](http://web.archive.org/web/20070911195517/http:/typophile.com/node/30086 \"Go to previous forum topic\") [Getting a bang out of Interrobang 4 ›](http://web.archive.org/web/20070911195517/http:/typophile.com/node/30228 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911195517/http://typophile.com/user/11280\" title=\"View user profile.\">G T</a>",
  "time": "<br>",
  "uid": "11280",
  "comments": [
    {
      "time": " 10.Jan.2007 7.17am",
      "content": "Hehe, ever i think of Golfsports Rotis Semi-Serif comes in my mind – why that?\n\n ![](http://web.archive.org/web/20070911195517im_/http:/typophile.com/files/golf_3462.png)\n\n"
    },
    {
      "time": " 10.Jan.2007 7.43am",
      "content": "Ta, although not quite what i was looking for.\n\nGraham\n\n"
    },
    {
      "time": " 10.Jan.2007 8.03am",
      "content": "I agree that you should go with a fresher-feeling logo to alleviate the potential for stuffiness. However, I’m not crazy with the current revision. It does seem a bit self-consciously modern, which I’m not sure is ideal for your magazine. Also, the combination of the L and F seems awkward, as if the L is stunted, and it creates an odd shape that looks like a U with a big top serif that distracts.\n\nMy suggestion would be some sort of slab serif — different from the norm, and the big serifs remind me mildly of clubs. I’d go with a modern interpretation, along the lines of PMN Caecilia. My favorite after a quick search is Freight Micro, but it’s out of your price range. For a logo, though, most would recommend that you do something custom, or at least tweak a font significantly.\n\n"
    },
    {
      "time": " 10.Jan.2007 8.09am",
      "content": "On HIlton Head Island there is a Golf magazine called Links  \nIt is as non-offensive as you can get.  \nMaybe it will give you an idea...  \nTheir website is:  \n [http://www.linksmagazine.com/ME2/default.asp](http://web.archive.org/web/20070911195517/http:/www.linksmagazine.com/ME2/default.asp \"http://www.linksmagazine.com/ME2/default.asp\")\n\n ![](http://web.archive.org/web/20070911195517im_/http:/typophile.com/files/links_6163.gif)\n\n"
    },
    {
      "time": " 10.Jan.2007 11.53am",
      "content": "Reed - Thanks, I’m not fond of the latest version either. I did try and tell my creative director about the ’LF’problem, but I was a bit new then, and he kinda didn’t really listen.\n\nJackie - Thankyou also, I’ve not come across this mag before, although It’s not quite what i was thinking of with our logo. I don’t mind offending the readers, I just don’t want to alienate them (only joking)The photography is much better than ours however as our guy is a mate o the editor I believe and none too hot.\n\nI did have a go with Minion Pro, in bold small caps, but my A.D wants something chunkier. I’ll post the few ideas i’ve come up with tomorrow when i’m back at work if you’d all be so kind as to comment.\n\nMuch appreciation,\n\nG\n\n"
    },
    {
      "time": " 10.Jan.2007 1.28pm",
      "content": "Graham,\n\nOne major difference is here on Hilton Head we have beautiful weather all year round - and therefore, golf all year round.\n\nYou cannot say that about the UK - which may explain some of the “grey” shots... LOL\n\nSunshine for all!\n\n"
    },
    {
      "time": " 11.Jan.2007 5.49am",
      "content": "London weather update: grey, extremely windy and raining.\n\ntomorrows forecast... oh dear.\n\n"
    }
  ]
}
