{
  "id": "30519",
  "title": "text face from \"Jeremias\" by Stefan Zweig, German book published by Insel-Verlag in 1919",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi,  \nI found this german book from 1919, which was printed in Leipzig and I am trying to find out which type it is. Its quite narrow , I like the proportions, especially of the capital letters. Has anyone an idea what it could be? The title of the books \"Jeremias\" by Stefan Zweig and was published by Insel-Verlag.  \nludwig\n\n| Attachment | Size |\n| --- | --- |\n| [Typeexample.jpg](http://web.archive.org/web/20130819091350/http:/typophile.com/files/Typeexample.jpg) | 159.31 KB |\n\n",
  "author": "ludwiguebele",
  "time": "11 Jan 2007 — 4:27am",
  "uid": "16198",
  "comments": [
    {
      "time": "11 Jan 2007 — 4:29am",
      "content": "Oh yeah, that one... erm, it's on the tip of my tongue.\n\nedit. in case anybody thinks I was being facetious, (I was), there was no pic when I replied.\n\nNick Cooke\n\n"
    },
    {
      "time": "11 Jan 2007 — 4:36am",
      "content": "could it be NixRift ? although that would not fit the 1919 timeline would it.\n\n"
    },
    {
      "time": "11 Jan 2007 — 5:17am",
      "content": "I don't know, but some forms remind me somehow of a (condensed) Janson(-Antiqua), especially of the ß-form. Maybe this leads you in the right direction.  \nPS Do you like the font? Me not.\n\n"
    },
    {
      "time": "11 Jan 2007 — 6:44am",
      "content": "It has elements of Plantin, but is more condensed. It could be a version of Plantin.\n\nNick Cooke\n\n"
    },
    {
      "time": "11 Jan 2007 — 7:36am",
      "content": "The W seems wrong for most versions of Plantin, except heavy weights. I think this looks more like Granjon.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "11 Jan 2007 — 7:41am",
      "content": ".. however, that P doesn't fit Granjon at all. Still searching...\n\n- Mike Yanega\n\n"
    },
    {
      "time": "11 Jan 2007 — 8:18am",
      "content": "Well, my best hope was the Jaspert 'Encyclopaedia of Type Faces' and I struck out there. The closed P seems popular in some Dutch types, but even some American types in the early 20th century had it. We may not get this one unless someone has some good old German type books.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "11 Jan 2007 — 7:00pm",
      "content": "_We may not get this one unless someone has some good old German type books._  \nI am in San Francisco right now, without my German type books. But it just looks like Stempel Garamond to me, pure and simple.\n\n"
    },
    {
      "time": "11 Jan 2007 — 7:08pm",
      "content": "_Stempel Garamond_  \nTrouble is, while it looks like a heavy print of Stempel Garamond (that square bottom on the a), that face was only published around 1924/25. If the book is, indeed, from 1919, then I spoke too quickly. As always.\n\n"
    },
    {
      "time": "12 Jan 2007 — 8:52am",
      "content": "yes, i had already the same idea, garamond, platin, janson, granjon, van dijck, then garamond again or at least a garamonish type, but somehow there is always something different or the time does not fit. at the moment I think its a revival from an 17th century typeface, or end 16th century. garamond or dutch leads the right way, I think, but I am not sure. Thanks for your help anyway.  \nLudwig\n\n"
    },
    {
      "time": "14 Jan 2007 — 12:52pm",
      "content": "Ludwig, I own a couple of «Insel»-books of that time. In some of them, as well as in the mighty tome «Deutsche Buchkunst 1890 bis 1960», the type is simply referred to as **Janson Antiqua**. I’d imagine that it’s an otherwise unknown (and in my opinion quite ugly) version from the late 19th century. Have you already asked the [Bleisetzer](http://web.archive.org/web/20130819091350/http:/www.bleisetzer.de/) Georg Kraus? He might give you further advise.\n\n"
    },
    {
      "time": "15 Jan 2007 — 2:28am",
      "content": "Florian, I think the typeface has indeed some similarity to the Janson Antiqua, but then some letterforms look more close to forms of the renaissance, like the capitel R or the M. Unfortunately I don't have a comprehensive specimen of the Janson. I will contact the Bleisetzer. Thanks for your help.\n\n"
    },
    {
      "time": "15 Jan 2007 — 3:14am",
      "content": "The typeface seems to be the Elzevir-Antiqua from Genzsch & Heyse in Hamburg. Georg Kraus mentioned in [typoforum](http://web.archive.org/web/20130819091350/http:/www.typografie.info/typoforum/viewtopic.php?t=2123&start=0&postdays=0&postorder=asc&highlight=&sid=b549565c9fca8949b181fb864f76fa1a) that the typeface came originally from Deberny & Cie.\n\n ![](http://web.archive.org/web/20130819091350im_/http:/typophile.com/files/Elzevir-Antiqua_5335.jpg)\n\n"
    }
  ]
}
