{
  "id": "30542",
  "title": "(x) Text face in old German book \"Kurzes Lehrbuch der Physik\" - (similar to) Monotype Modern Extended {Erik S}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello,\n\nWe are working on a book project and our research led us to this font:\n\n ![](http://web.archive.org/web/20080113144433im_/http:/www.typophile.com/files/Springer01_6324.jpg)\n  \n\n ![](http://web.archive.org/web/20080113144433im_/http:/www.typophile.com/files/Springer02_5495.jpg)\n\nUnfortunately we were not able to identify the font by ourselves  \nand are seeking your help.If you might be able to suggest some  \nsimilar versions we would also be more than happy.\n\nThanks\n\n [‹ Narrow Egyptienne in promotional material NFL](http://web.archive.org/web/20080113144433/http:/www.typophile.com/node/30630 \"Go to previous forum topic\") [NIKE SB logo ›](http://web.archive.org/web/20080113144433/http:/www.typophile.com/node/30563 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080113144433/http://www.typophile.com/user/14872\" title=\"View user profile.\">Kriznikovski</a>",
  "time": "<br>",
  "uid": "14872",
  "comments": [
    {
      "time": " 11.Jan.2007 2.56pm",
      "content": "Quite similar to [Linotype Modern Extended](http://web.archive.org/web/20080113144433/http:/www.linotype.com/89997/modernextended-family.html?CMP=NjR8Mjkz). All bar the lowercase **f**.\n\n"
    },
    {
      "time": " 11.Jan.2007 3.05pm",
      "content": "Also see Devinne Text\n\n[http://www.myfonts.com/fonts/bitstream/de-vinne/devinne-text/](http://web.archive.org/web/20080113144433/http:/www.myfonts.com/fonts/bitstream/de-vinne/devinne-text/ \"http://www.myfonts.com/fonts/bitstream/de-vinne/devinne-text/\")\n\n"
    },
    {
      "time": " 11.Jan.2007 3.15pm",
      "content": "Might be the old Alt Latein by Schelter & Giesecke. Don’t know if its been digitised though mate.\n\nMuzz\n\n"
    },
    {
      "time": " 11.Jan.2007 3.34pm",
      "content": "I’m with Patty, I think it’s DeVinne. The ’a’ is not like the Alt Latein sample I find in Jaspert, and neither is the G.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 11.Jan.2007 3.52pm",
      "content": "The **ß** and **f** in _DeVinne_ aren’t the same as Kriz’s sample.\n\n"
    },
    {
      "time": " 11.Jan.2007 4.09pm",
      "content": "Unfortunately i have no Jaspert, but its definetly neither DeVinne nor Modern, i have already checked that.  \nDeVinne seems to be pretty close, but I can’t go for it cause there is no bold version, and it looks quite quirky if you set a bigger amount of text.  \nAlt Latin sounds interesting but I couldn’t find any sample of it.\n\n"
    },
    {
      "time": " 11.Jan.2007 4.10pm",
      "content": "For digital, try ATF Century Expanded; the Berthold version. Or you could use Bitstream’s Century 725, which, in turn, is Bitstream’s version of Berthold’s Madison, which, in turn was Berthold’s version of ATF Century... Check the figures: they are always a little different (look at the 2), and the f: it has no overhang.\n\n"
    },
    {
      "time": " 11.Jan.2007 4.45pm",
      "content": "Or for a modern interpretation of the above, try Hercules:\n\n[http://www.stormtype.com/typefaces-fonts-shop/families-19-hercules](http://web.archive.org/web/20080113144433/http:/www.stormtype.com/typefaces-fonts-shop/families-19-hercules \"http://www.stormtype.com/typefaces-fonts-shop/families-19-hercules\")\n\nCentury-like forms with Storm’s typical idiosyncratic charm.\n\n"
    },
    {
      "time": " 11.Jan.2007 5.02pm",
      "content": "I’m seeing differences in all of these Erik, with either the g, t or f. They are all close, including DeVinne, which was what Century was based upon, but I haven’t seen any that are exactly the same. We don’t know if the sample we are shown are metal, or digital, or how old they are. Both of these families have been produced in a host of versions, but using the sc, italics and the numerals hasn’t helped to isolate one from the sources I can find. If this is from a European foundry that none of us has information about we can look until we go blind, and never exactly match it.\n\nYou may just have to pick the closest digital font you can find. We have given you some suggestions.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 11.Jan.2007 6.30pm",
      "content": "_We don’t know if the sample we are shown are metal, or digital, or how old they are_  \nYes, we do. Or at least I can guess from both the language and the printing that this book is from the beginning of the previous century, i.e. between 1900 and 1930. Max Planck published his first major paper in 1900, and the text refers to one of Planck’s discoveries concerning radiation. That’s why _Alt Latein_ is a good guess. German scientific publishers were very conservative typographically.\n\nEvery foundry had a face like that, even before ATF Century (1904). As they were all more or less copies of each other, you’d have to look at a lot of old specimens to find the exact font. The book was probably set in Linotype or Intertype, but it could have been Monotype because of the amount of formulars involved. Mono wasn’t very widespread in Germany, but when it came to that type of setting, no other system was as flexible.\n\nFinding the exact face wouldn’t do you any good, as you’d want to set the book today, and presumably not in hot metal.\n\n"
    },
    {
      "time": " 11.Jan.2007 6.55pm",
      "content": "Modern Extended from Monotype, 1902. The digital version has a different f, but everything else is spot on.\n\n"
    },
    {
      "time": " 11.Jan.2007 8.29pm",
      "content": "Not quite spot on. The ’e’ in the sample has a bit of an underbite which is not present in Modern Extended.\n\n"
    },
    {
      "time": " 12.Jan.2007 12.29am",
      "content": "_Not quite spot on_\n\nOf course not. We’re looking at a letterpress sample from 100 years ago. Fonts then often were size-specific, and digital versions will never be 100% identical. These people are looking to create a similar feel, not produce an exact clone, with bad spacing, no kerning et al.\n\n"
    },
    {
      "time": " 12.Jan.2007 2.12am",
      "content": "Thanks a lot everybody.  \nThere seems to be a common understanding that there is  \nno digital version of this particular font.  \nAll your suggestions are fonts we have already considered.  \nDoes anyone have some experience with setting a bigger  \nproject in a stormtype font?  \nWe are thinking about commissioning someone to digitalize  \nthe font, anyboby interested?\n\n"
    },
    {
      "time": " 12.Jan.2007 3.38am",
      "content": "This looks like Monotype hot metal typesetting. If my memory serves me more or less well, this specimen is Modern 189. Conor’s call is a good one because the Linotype version it really quite similar. Hopefully no need to digitise :)\n\n"
    },
    {
      "time": " 12.Jan.2007 12.11pm",
      "content": "Euclid is also quite close, and seemingly ubiquitous in science and maths publishing:\n\n[http://www.myfonts.com/fonts/mathtype/euclid/](http://web.archive.org/web/20080113144433/http:/www.myfonts.com/fonts/mathtype/euclid/ \"http://www.myfonts.com/fonts/mathtype/euclid/\")\n\n"
    },
    {
      "time": " 14.Jan.2007 2.57am",
      "content": "Purple by NORM and Aurèle Sack seems a revival of the same metal type, altought the interpretation is somewhat different. distributed by [www.lineto.com](http://web.archive.org/web/20080113144433/http:/www.lineto.com/ \"www.lineto.com\")\n\n"
    },
    {
      "time": " 14.Jan.2007 3.01am",
      "content": "This might imply that the original typeface is Normande which was NORM found in a type-specimen by the Haassche Schrftgiesserei AG. Münchenstein.\n\ntaken from the lineto website:  \nCalled «Normande Halbfett» or «Antiqua Halbfett», its origins are a little unclear. «Normande» was published through the swiss-based Haas foundry, while the «Antiqua Halbfett» or «Gewöhnliche Antiqua» has its roots in Scotland and was published through Monotype in England at the beginning of the 19th century. The design is reminiscent of classical Antiqua faces like Didot or Bodoni, but is more accentuated.\n\n"
    },
    {
      "time": " 14.Jan.2007 8.40am",
      "content": "It looks quite a bit like the LaTeX-standard font, Computer Modern. This font is freely available (I think) at this url:\n\n[http://www.ctan.org/tex-archive/fonts/cm/ps-type1/bakoma/ttf/](http://web.archive.org/web/20080113144433/http:/www.ctan.org/tex-archive/fonts/cm/ps-type1/bakoma/ttf/ \"http://www.ctan.org/tex-archive/fonts/cm/ps-type1/bakoma/ttf/\")\n\n"
    },
    {
      "time": " 15.Jan.2007 3.49pm",
      "content": "Looks most like Monotype Modern Extended (as suggested by Erik), of which it seems there were several iterations and lots of size variants (again see Erik above). I have had a look at _Book Types from Clowes_ and it seems identical to Monotype Modern Extended No 1 except for the unique letter ’f’.\n\nHere’s a theory (maybe nonsense):\n\nIs it possible that German type needs a narrower ’f’ because the next letter is very often ’u umlaut’ (in the word ’für’ which I would guess is the most common word that uses the letter ’f’ in German and would give a rather unpleasant yet very common ’fü’ pair—see illustration below—with a standard English ’f’). Hence a ’German’ Modern (if well-crafted) will be slightly different (i.e. narrower) in the ’f’ department? Anyone ever thought about an fudiesesis ligature for the word ’für’?\n\n ![](http://web.archive.org/web/20080113144433im_/http:/www.typophile.com/files/fur_5339.gif)\n\nFinally, what about the pointy italic ’v’, that’s got to be a ’nu’ hasn’t it? Every Modern I can find has curvy italic ’v’.\n\nGreat type though. Whatever it is.\n\n"
    },
    {
      "time": " 16.Jan.2007 9.01am",
      "content": "Its not Alt-Latein, but its:  \nAntiqua XIII  \nJ. John Söhne, Hamburg  \nShortly after 1885\n\nSource:  \nSeemann “Handbuch der Schriften”, 1926\n\n ![](http://web.archive.org/web/20080113144433im_/http:/www.typophile.com/files/2_3704.jpg)\n\n ![](http://web.archive.org/web/20080113144433im_/http:/www.typophile.com/files/1_4985.jpg)\n\nBut Erik is right:  \nDoes this information really help?  \nI’ld recommand a Madison  \n(although known as “Amts-Antiqua”)  \nfrom Heinrich Hoffmeister, 1909  \nBut I’m not sure if there is a digitalized version.\n\n ![](http://web.archive.org/web/20080113144433im_/http:/www.typophile.com/files/3_4918.jpg)\n\nGeorg\n\n"
    }
  ]
}
