{
  "id": "30544",
  "title": "Temporary Identity for myself...",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I desperately need a new identity for myself, so i made this real quick. Any thoughts or sugguestions before I goto print?\n\n\\*The cards are a bit thinner than most business cards to give a high end feel and so it is easier to put in wallets.  \n\\*I am planning on using an extremely thick gsm and want a really smooth mate card. Any sugguestions?  \n\\*All the type on the contact side of the card in the background will be UV coated.\n\n ![](http://web.archive.org/web/20080118115459im_/http:/www.typophile.com/files/norcal_buisCard_5949.jpg)\n\n [‹ Thoughts on color and details](http://web.archive.org/web/20080118115459/http:/www.typophile.com/node/30180 \"Go to previous forum topic\") [A good pairing, despite being Web 2.0 ›](http://web.archive.org/web/20080118115459/http:/www.typophile.com/node/30585 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080118115459/http://www.typophile.com/user/13221\" title=\"View user profile.\">j_polo9</a>",
  "time": "<br>",
  "uid": "13221",
  "comments": [
    {
      "time": " 11.Jan.2007 6.23pm",
      "content": "I am kind of torn between just printing this or hiring someone to make a new logo for me first. I don’t mind paying for a good logo at all but I am extremely picky when it comes to design and don’t want to waste my money or someone elses time.\n\nAlso I’ve tried to make my own logo for years but I am never satisfied with the results. If anyone has any sugguestions or ideas let me know.\n\n"
    },
    {
      "time": " 11.Jan.2007 7.29pm",
      "content": "Difficult to see on my monitor, but the drop shadows on the large cross on the front of the card make it look like a religious symbol. (Of course, that may have been your intent?)—- My feeling is that without the shadows it would look more “secular.”  \nDB~\n\n"
    },
    {
      "time": " 11.Jan.2007 8.03pm",
      "content": "Not a big fan of the vertical card. They don’t sit very well in holders and wallets. The type treatment doesn’t really gel with the symbol for me. Upping it’s weight would help.\n\n"
    },
    {
      "time": " 11.Jan.2007 9.35pm",
      "content": "Are the opposite corners going to be cut, like the above draft?\n\nDo you have an immediate event, like a trade show the new ID must be ready for? If not, hold off if you have doubts. When the product is you, the branding has to feel just right, or you won’t push it confidently.\n\nUregent event aside, whatever you do with the card, sync it with your site, and roll them both out at once. It seems to be exclusively a webdev company, so I’d recommend something loosely tech related, even if it is subtle.\n\n[Choz Cunningham](http://web.archive.org/web/20080118115459/http:/www.chozcunningham.com/)  \n [!Exclamachine Type Foundry](http://web.archive.org/web/20080118115459/http:/www.exclamachine.com/)  \n [The Snark](http://web.archive.org/web/20080118115459/http:/www.exclamachine.com/snark)\n\n"
    },
    {
      "time": " 11.Jan.2007 9.37pm",
      "content": "And, if you are going thin on the card, which sounds good, will it be stiffer stock to compensate? Thin is cool, floppy is not.\n\n—\n\nIf you want to sell logos for a living, make sure your ID has one you made.\n\n"
    },
    {
      "time": " 12.Jan.2007 1.38am",
      "content": "Ahh does anyone else feel it is religious? That is not my intent and i wouldn’t care if it does, unless it seems as if it is supposed to serve some religious purpose.\n\nThe card is not longer than normal just narrower so that it will fit better in wallets. LOL I would love a more weighty type, only it is the platinum face of the luxury collection and there are no other weights...\n\nThe opposites will be cut like in the draft. I need to pass out cards fairly immediately so i will make these even if it is only a temporary identity.\n\nUnfortunately my site is circa 2 years ago and very out of date. I don’t do mostly web design anymore but it is still a large part as I do a lot of identity design and marketing.\n\nYes i love really thick GSM cards so the stock will be thick ;) But I don’t agree that if you sell logos for a living you need your own...\n\n"
    },
    {
      "time": " 12.Jan.2007 6.48am",
      "content": "I do—otherwise it’s awkward; “I design corporate identities, but I haven’t designed my own”.\n\nBut I agree with that the sign looks a bit like a religious symbol.  \nI do like the color combination. I presume the black is going to be uncoated, or matte? Since you want to UV coat the type. I think that will look pretty good.\n\n"
    },
    {
      "time": " 12.Jan.2007 6.55am",
      "content": "“Also I’ve tried to make my own logo for years but I am never satisfied with the results.”\n\nTo make your own logo, as a designer, strive for ’sufficiently adequate’ as it really is impossible to design your own logo to a level of perfection that suits you.\n\nSo, that said, I find this logo just fine. Nice, simple. Leave it!\n\nOther comments:\n\nThe front of the card seems off-center vertically. Raise the type and mark up some.\n\nI agree that the type could be a little heavier. I’d maybe put the cross-bar back in for the A. Seems to distract from the mark a bit.\n\nI don’t see it as being religious, but it does have a bit of a historic vibe to it.\n\n"
    },
    {
      "time": " 12.Jan.2007 9.43am",
      "content": "It does look religious to me.\n\n"
    },
    {
      "time": " 12.Jan.2007 11.13am",
      "content": "try rotating it 45 degress if you want to get rid of the cross symbol.\n\n"
    },
    {
      "time": " 12.Jan.2007 12.00pm",
      "content": "Yea definately matte and really smooth on super thick gsm!\n\nCool thanks Aluminum. Unfortunately I can’t make it heavier as there are no other weights. Rotating it makes it look too much like an X for me, like don’t use my services or maybe that I’m a pirate... I might try to tweek it a bit though so it looks less religious.\n\nCan anyone guess what the mark is made of?\n\n"
    },
    {
      "time": " 12.Jan.2007 6.37pm",
      "content": "Looking like a pirate is not a bad thing! ;)\n\nAnd no, I can’t see what the mark is made of. Does it resemble something? Or was it inspired by something?\n\n"
    },
    {
      "time": " 12.Jan.2007 9.11pm",
      "content": "It is simply made of 4 rotated Daggers from the same Platinum type. I did it on accident but liked the way it looked so sort of left it as a happy mistake.\n\nBut i do like the feel that there is some kind of history to the mark and that it is fairly non representatinal. Except that to me it sort of reminds me of the North Star which a lot of people here associate norcal to.\n\n"
    },
    {
      "time": " 13.Jan.2007 2.28am",
      "content": "The tight kerning is making a light patch out of the CAL of NORCAL, have you tried adding a stroke to the platinum to see if that helps you increase the weight (a method that doesn’t always work on lighter weights), if it doesn’t lead anywhere you might consider just having the mark on the contact side. Your spot UV seems to be gradated, I’ve never done this but it seems to me that it won’t work as a gradation, perhaps you have seen this, if not I would ask your printer if it seems workable.\n\nTim\n\n"
    },
    {
      "time": " 13.Jan.2007 5.38pm",
      "content": "Even if the type is to be spot varnish I would still keep a ghost around the letter shapes of your mark as it could affect readability of it.\n\nI’m not a big fan of black, it looks dirty around white type to me and it’s overpowering. Your brand needs to stand out more than the background color of it. Color is a very important thing in branding but the relation of logo and branding has to work together as one and to me now it’s breaking it apart.\n\nThose changes in shapes on your corners reminds me of such bad reviews the first redesign of Quark’s logo got. That shape is an on-going trend that I believe comes from that “web 2.0” look of making everything with round corners and gradients. Be very careful if this is not your goal.\n\nHere’s a sample of business card I go. It’s not of my personal taste, to me the black background in this case, makes the color more important than the actual content of the card. Some may disagree but I just post it so you can see what a black BC looks like.\n\n ![](http://web.archive.org/web/20080118115459im_/http:/www.typophile.com/files/felt_bc_5304.jpg)\n\nFor different business card sizes also read this:  \n [http://typophile.com/node/21340](http://web.archive.org/web/20080118115459/http:/typophile.com/node/21340 \"http://typophile.com/node/21340\")\n\nJust my two cents.\n\nKco\n\n"
    },
    {
      "time": " 14.Jan.2007 6.08pm",
      "content": "tim, what do you mean by a light patch? Also I thought just adding a stroke to the letters to give them more weight would detract from their form?\n\nThere’s no gradiation for the Spot UV but i might keep the ghost there as Kco sugguested.\n\nI agree there are a lot of setbacks to black cards, especially how easily they get dirty, But I want my identity to feel a bit edgy with a marked distinction. I think that the thick GSM, narrow cards, opposite rounded corners, UV/Matte combo and black stock works well for that.\n\nI have been collecting well printed material and I love black book covers like “The Elements of Typographic Style” and I love the 7 Diamonds black clothing labels (this is almost the exact matte/smooth feel with UV that I am looking for).\n\nGradients and web 2.0 are definately not my goal, though it is a shame how much gets lumped into web 2.0 category, “To define is to limit” as says Oscar Wilde. I think there is a place for gradients and rounded corners and rounded type, etc. in graphic design if used well. I am more a fan of bauhaus design myself so i tend to use gradients more sparingly.\n\n"
    },
    {
      "time": " 14.Jan.2007 9.19pm",
      "content": "There’s definitely room for round corners, if it fits. As far as black covers on books such as “The Elements of Typographic Style”, they have a very thick coating, which is to take into account.\n\nAlso what about bringing your services such as: print, web, etc much bigger so they don’t repeat as much not to hit them in the heat over and over but to be clear about it? Its only going to be a spot so it might work, although it can overpower the identity. You can try it maybe not so big so it doesn’t repeat as much\n\nKco\n\n"
    },
    {
      "time": " 15.Jan.2007 12.00am",
      "content": "\\>light patch\n\nBecause the letters are tightly kerned it doesn’t allow adjustment to allow for the wide open counters of CAL, looser overall kerning should allow the characters to be better spaced.\n\n\\>adding a stroke\n\nOne would have to be careful to avoid detracting from the original design, at the moment it seems too light to me.\n\n\\>gradation on the UV\n\nI wondered whether it was the change of monitors because it certainly looks gradated on my Powerbook but not on my monitor at work.\n\nTim\n\n"
    },
    {
      "time": " 15.Jan.2007 3.55pm",
      "content": "do you know what kind of coating they put on book covers? I love the smooth feel of Elements and I think that feel would be perfect for my card.\n\nNot sure what you mean about the services. I don’t really care about legibility as much as i just want the variation from smooth matte to UV. If anyone has any ideas besides having my services in the background let me know.\n\nAhh thanks, I will try to loosen up the kerning a bit. Isn’t adding a stroke kind of like Faux bold in programs like word? I’ve always thought this was bad. I may try to manually edit it or contact Christopher again.\n\nStrange about the monitors. I am now trying to decide if i want to get a mac laptop or a dell with the new Vista on it. How is the monitor on your powerbook overall?\n\n"
    },
    {
      "time": " 16.Jan.2007 12.39am",
      "content": "\\> coating  \nMatte laminate, discuss it with your printer, some stocks are less receptive than others.\n\n\\>adding a stroke  \nIt can be “bad”, however well handled it can work, at least it can give you a guide to work to. In this case you are not trying to design a font but letter a logo, a subtle difference, which really means that you only have to work up a limited number of characters and that those characters are only going to interact with those on either side of it. However, if you are unconfident it might be best to enlarge the characters in proportion to the mark.\n\nMy taste would be to drop the services and UV the logotype, restrained use makes it more “special”.\n\nAs for the monitor I am Mac-biased, (having only rarely used pcs and generally concentrating on the different software and OS) so I am probably not the best person to give a recommendation, I do prefer my work Diamondtron to my powerbook but with different sizes and requirements it is not a fair comparison.\n\nTim\n\n"
    }
  ]
}
