{
  "id": "30540",
  "title": "new font Nomada",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hi everyone,\n\nI'm working working on a new font called Nomada. It is a monoline slab serif font. I would really appreciate some professional comments. Thanks.\n\n ![](http://web.archive.org/web/20150418231721im_/http:/typophile.com/files/nomoda2_5511.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [nomada.jpg](http://web.archive.org/web/20150418231721/http:/typophile.com/files/nomada.jpg) | 113.86 KB |\n\n",
  "author": "rui abreu",
  "time": "11 Jan 2007 — 2:23pm",
  "uid": "12433",
  "comments": [
    {
      "time": "11 Jan 2007 — 3:05pm",
      "content": "Hey rui,\n\nIts really lovely.  \nI liked your Tirana family also.\n\n- satya\n\n-------------------------------  \nLove Type . Live type\n\n"
    },
    {
      "time": "11 Jan 2007 — 3:14pm",
      "content": "The descender of the oblique 'f' is quite clever.\n\n"
    },
    {
      "time": "12 Jan 2007 — 5:15am",
      "content": "I really like it — there are some very creative glyphs happening too, I just \\*love\\* the ‘@’, which in it's ‘round’ form I find just plain ugly in print. The oblique version is very eye-catching, and as a whole, I really like the font. I think there's a lot of use for it. However, there are some curves that just feel a bit stressed to me.\n\nThe 'ct' discretionary seems to be a bit heavy on the top curve that runs from the top of the lc 'c' to the 't'. In the attached jpg, it's also a bit pixely. Perhaps it's just an akward anti-alias by the program you used to set it in, but it seems a bit off. I expirience the same with 'st'. Perhaps the curve should be a bit more straight. Also, the '@' in the oblique version could use some edge on the leftmost curve, like you can see on the left side of the capital 'A'. It's unusually slanted when compared to the rest of the letterforms. And as a side note, once again, it could be me, but your lc 'x' feels like it is leaning a bit to the left.\n\n"
    },
    {
      "time": "12 Jan 2007 — 6:19pm",
      "content": "I think it's looking crisp. Only thing coming to mind right now is, that it looks like the right side strokes on the italic 'k' is a bit thin, when compared to the other strokes. But it seems that you might have done that on purpose. :)  \nI agree with Sebastiaan on the 'x', although the leaning might also be caused by the serifs of the 'x' and the 'w' almost touching in your specimen. But it isn't really that bad, imo.\n\n"
    },
    {
      "time": "14 Jan 2007 — 7:15am",
      "content": "Thank your for your help, You have been most helpful, I'm going to work on it. Sorry about the delay of my answers but right now i'm a really busy with this font and I hardly get online.\n\nAbout the weights of the strokes thats what i'm working right now cheking all cahracters.\n\nPlease come back to this discussion the next days, I would like to show you more the weight of the font.\n\nThanks\n\n"
    }
  ]
}
