{
  "id": "30550",
  "title": "Personal requests to Yves Peters (Bald Condensed, Head Moderator Type ID Board)",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Moderating this board is lots of work — mostly behind the scenes — and eats up large amounts of my own time. Remember this is a voluntary job. I don’t get paid for this, and time spent here is time I can’t devote to my family, writing for Unzipped or Typographer.org or other websites, designing for my personal clients, rehearsing and gigging with my band Troubleman or — hey — _relaxing_.\n\nI don’t mind doing this, make no mistake. Fact is, I even like it. But if you want a typeface identified or need advice or information, _please don’t send me a personal e-mail._ Post it here, that’s what this board is all about.\n\nThank you. ;^)\n\n [‹ (x) Ministry Of Sound logo - custom designed by Dalton Maag {Vince C}](http://web.archive.org/web/20081012174014/http:/typophile.com/node/30551 \"Go to previous forum topic\") [(x) Edgar Allan Poe \"The Conqueror Worm\" fine print - Monotype Baskerville {Yves} ›](http://web.archive.org/web/20081012174014/http:/typophile.com/node/30552 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081012174014/http://typophile.com/user/110\" title=\"View user profile.\">Bald Condensed</a>",
  "time": "<br>",
  "uid": "110",
  "comments": [
    {
      "time": " 12.Jan.2007 5.15am",
      "content": "Oh, to avoid any misunderstandings: although I’d rather have you don’t e-mail me personally, I _will_ help you in person if and when I can. But on this board.\n\n"
    },
    {
      "time": " 12.Jan.2007 6.46am",
      "content": "Yves, you might want to put a note in the How to Post or FAQ to this effect: not contacting moderators directly with questions about type IDs, but posting them to the list. Thanks for your generous efforts!\n\n"
    },
    {
      "time": " 12.Jan.2007 6.59am",
      "content": "I’m planning to make a “10 tips how to survive the Type ID Board” mini-FAQ soon. ;^)\n\n"
    },
    {
      "time": " 12.Jan.2007 7.06am",
      "content": "By the way. :) Thank you, Yves, for making all this _(The Type ID Board)_ even happen, work and run smoothly. This place would be nothing as close to what it is, without your effort and passion.\n\nDav\n\n"
    },
    {
      "time": " 12.Jan.2007 7.25am",
      "content": "All those birthday emails?  \nCongratulations :-)\n\nR\n\n"
    },
    {
      "time": " 12.Jan.2007 7.25am",
      "content": "I second that emotion, Yves. Go have five minutes with your family every month or so. ;-)\n\n"
    },
    {
      "time": " 12.Jan.2007 7.27am",
      "content": "Ah Yves, still optimistic that people actually read the FAQ...\n\nand yet still so many threads entitled: “help identifying a font”\n\nthanks from me too.\n\n"
    }
  ]
}
