{
  "id": "30558",
  "title": "InDesign CS2 Font Problem",
  "forum": "Build",
  "tags": [

  ],
  "content": "We are seeing missing font errors in files that have Type 1 fonts as well as Open Type fonts in the file. We are moving to an Open Type environment and have been converting the stylesheets to now reference the Open Type version of the font. We are using Font Book 2.0 in OS 10.4.8 as our font management tool and have found that even when the fonts are active and being used correctly in the file (stylesheet applied) the typeface is subsetting from Regular to Medium. It throws a ’Missing Font’ error and we don’t know how to get around it. The font is accurate (InDesign substitutes the font with the correct one but sees the typeface as different) behind the pink text (our designers and QC staff would know what the font looks like but our Editors don’t) but because there’s pink highlight, it is assumed the font is missing.\n\nHas anyone else seen this? Is there a way around it?\n\n [‹ Advanced FontLab Features?](http://web.archive.org/web/20080110085112/http:/typophile.com/node/31169 \"Go to previous forum topic\") [Ldot ›](http://web.archive.org/web/20080110085112/http:/typophile.com/node/31294 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080110085112/http://typophile.com/user/16236\" title=\"View user profile.\">growland</a>",
  "time": "<br>",
  "uid": "16236",
  "comments": [
    {
      "time": " 12.Jan.2007 10.22am",
      "content": "So, you have a single family that has both “Regular” and “Medium”? If so, InDesign tends to treat these as the same thing, and may get confused. What’s the type family in question?\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 12.Jan.2007 11.28am",
      "content": "We are currently seeing it in Helvetica and Frutiger but the stylesheets reference the Open Type font yet it’s picking up a stray font or something with a ’Medium’ typeface. At least, that’s what we think it is. Any thoughts?\n\n~Saritza\n\n"
    },
    {
      "time": " 16.Jan.2007 5.59pm",
      "content": "I noticed you are using Font Book for font management. Have you considered switching to a third party font management application? I personally have never had a smooth sailing experience with Font Book. I’ve tried many different 3rd party programs and currently am quite pleased with Font Explorer X (which is free). Give it a try, it might magically work better than the prebundled Font Book.\n\nr a j a\n\n"
    },
    {
      "time": " 16.Jan.2007 6.53pm",
      "content": "erg8t, this is a very specific question regarding the substitution of an OpenType version of a font for deprecated PostScript version. In this case, it is assumed that the user knows which fonts are active. I’m a big fan of 3rd party font managers, but this is a case where basic testing of the font installed the system is appropriate. It may be the case that not all versions of Adobe’s PostScript fonts map perfectly to the OpenType versions. Thomas Phinney probably has the best information available though...\n\n"
    },
    {
      "time": " 21.Jan.2007 7.49pm",
      "content": "Adobe’s OpenType releases have been carefully renamed to avoid conflicts with the prior Type 1 versions. Are you dealing with a case in which you have OpenType versions from some other source, which might have some of the same names as the original Type 1 versions?\n\nRegards,\n\nT\n\n"
    },
    {
      "time": " 22.Jan.2007 1.17am",
      "content": "@growland: Is that particular stylesheet in any way connected with another one, eg changed and renamed, or a ’based on’ one? Is the strange behaviour persistent with a new stylesheet using the same font and style? Do you have OT ánd PS varieties of the same font installed on the machine and did you clear the font caches after changing the stylesheets to the OT-font?  \nDid you test with the OT-fonts loaded by putting them in InDesigns font folder (located in the program folder)?\n\n"
    },
    {
      "time": " 9.Feb.2007 10.18am",
      "content": "We have cleared the font caches and made sure the user did not have the Type1. Since our files move from user to user if a user opened up a file on a machine with type 1 Helvetica the next user would get the font missing message even though the font isn’t used. It could be Stone Sans or Frutiger...it doesn’t matter. We have learned that if it says”medium” it is related to that error. It seems to have only become an issue with CS2.\n\n"
    }
  ]
}
