{
  "id": "3056",
  "title": "Evergreen Farm",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I am working on a logo for Evergreen Farm. Basically they buy horses, train them, and sell them. They want a logo for their website, signage, etc. It is still in black and white and line form. I will probably add something to the bar on the E (because it feels bare).   \n   \nI am using Runic MT for the font, and Caslon 540 for the secondary font. I chose Runic because I feel it is sharp and classy. I was looking at Layfeyette (Font Bureau) and Acolyte (Altered Ego) as possibilities, but I don't own either. Before I make a purchase I want to hear opinions on the font choice.   \n   \n ![](http://web.archive.org/web/20131021001734im_/http:/www.typophile.com/forums/messages/29/26136.gif)\n\n",
  "author": "Tom Cannon",
  "time": "9 Feb 2004 — 5:34pm",
  "uid": "1739",
  "comments": [
    {
      "time": "9 Feb 2004 — 7:23pm",
      "content": "I like it. It'll look nice on a sign.   \n   \nYou will be using evergreen, and gold as colors possibly?\n\n"
    },
    {
      "time": "9 Feb 2004 — 8:46pm",
      "content": "That E is just too cool, don't change it!   \n   \nRunic is a nice choice, but maybe show us some others? It doesn't feel exactly right.\n\n"
    },
    {
      "time": "9 Feb 2004 — 9:47pm",
      "content": "I might use forest green / evergreen and gold, but I am always against doing the obvious. This might be a case where it wouldn't be bad to use a color that is in the name. I hope to post progress tomorrow.\n\n"
    },
    {
      "time": "10 Feb 2004 — 6:30am",
      "content": "_I might use forest green / evergreen and gold, but I am always against doing the obvious._   \n   \nTom, maybe it's obvious, but don't discount it as the best choice because it seems so.\n\n"
    },
    {
      "time": "10 Feb 2004 — 6:32am",
      "content": "Put the cross bar back and have the horses leg going over it like a jump. That would reinforce the training aspect. Just my two cents\n\n"
    },
    {
      "time": "10 Feb 2004 — 9:01am",
      "content": "I, too, think it needs the cross bar. Right now, I don't see an 'E'. Otherwise, I think it's quite nice. 'Farm' might be a bit too small in comparison to Evergreen when reproduced at small sizes.\n\n"
    },
    {
      "time": "10 Feb 2004 — 11:20am",
      "content": "I like the E; the horse looks strong.   \n   \nI agree with Daniel and Darrel that it would be worth it to try it with the cross bar. What does it look like small? Some of those lighter lines inside the horse may disappear in small or low rez situations.   \n   \nRunic is a good choice. Can't wait to see it in color.\n\n"
    },
    {
      "time": "10 Feb 2004 — 12:14pm",
      "content": "This image is at 350 pixels. I can't imagine it needing to go any smaller. some lines at 350 definitely get lost but I don't think it hurts it too bad.   \n   \n ![](http://web.archive.org/web/20131021001734im_/http:/www.typophile.com/forums/messages/29/26209.gif)   \n   \nSomeone suggested when I started that I add a bar. I believe that adding any sort of bar hurts the cleanness of the overall image and adds confusion. Unless a second bar is added perpendicular to the horizontal bar, the bar is floating. If a vertical and horizontal bar is added it is alot of straight lines to take away from the \"E\". In a way, I was hoping it almost looks like the horse is jumping over the bottom beak (of the E). That may be a stretch considering he is so far from it. It may be the right thing to add a jumping bar. I will toy with it and see if I can't make it work.   \n   \nWhen I straighten the leg anymore than it is it takes away from the momentum of the horse jumping. Most associate that pose with the horse jumping.   \n   \n ![](http://web.archive.org/web/20131021001734im_/http:/www.typophile.com/forums/messages/29/26210.gif)   \n ![](http://web.archive.org/web/20131021001734im_/http:/www.typophile.com/forums/messages/29/26211.gif)   \n   \nAlso, I adjusted the shadow on the leg so it could adapt better when the logo is smaller.   \n   \n ![](http://web.archive.org/web/20131021001734im_/http:/www.typophile.com/forums/messages/29/26212.gif)\n\n"
    },
    {
      "time": "10 Feb 2004 — 12:32pm",
      "content": "The thin lines will get you not when they disappear, but then they _clot together_. You'll need a lo-fi version.   \n   \nI wouldn't add the middle bar - I think it's enough of an \"E\".   \n   \nDo remove the trapping from the Runic (like in the armpits of the \"N\").   \n   \nI don't think the \"FARM\" font is working with the Runic. Try something like Bank, or Blair, and at a darker weight.   \n   \nhhp\n\n"
    },
    {
      "time": "10 Feb 2004 — 8:38pm",
      "content": "I have adjusted the logo so it can go smaller by adding more white space inside the outer edge and simplified the shading. I also changed the font for \"farm\" and adjusted the traps in \"evergreen\".   \n   \n ![](http://web.archive.org/web/20131021001734im_/http:/www.typophile.com/forums/messages/29/26251.gif)   \n ![](http://web.archive.org/web/20131021001734im_/http:/www.typophile.com/forums/messages/29/26252.gif)\n\n"
    },
    {
      "time": "11 Feb 2004 — 5:56am",
      "content": "Tom, try moving the horse up and making it smaller, extend its leg and have it over lap the cross bar of the E covering most of it up. These are just suggestions for you to look at, maybe you already have.\n\n"
    },
    {
      "time": "15 Feb 2004 — 1:04pm",
      "content": "Here is the logo with some color. I am still playing with it. I decided to not try and make the horse leg more obvious that it is the bar on the \"E\". Because the type will always be with it people getting the association doesn't make or break the logo. I usually don't like things to be obvious anyways.   \n   \n ![](http://web.archive.org/web/20131021001734im_/http:/www.typophile.com/forums/messages/29/26579.gif)\n\n"
    },
    {
      "time": "15 Feb 2004 — 1:09pm",
      "content": "![](http://web.archive.org/web/20131021001734im_/http:/www.typophile.com/forums/messages/29/26582.gif)\n\n"
    },
    {
      "time": "15 Feb 2004 — 3:05pm",
      "content": "Very nice!   \nNow you need a lo-fi version.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Feb 2004 — 3:43pm",
      "content": "Thanks Hrant! I do need a lo-fi version for an upcoming website. What do you think of the colors?\n\n"
    },
    {
      "time": "15 Feb 2004 — 4:00pm",
      "content": "Looking at my display I'd prefer a slightly more saturated green, but that means virtually nothing (and I don't have a Pantone book).   \n   \nIn the lo-fi version do try to keep that nice parallel between the mane and the spikes in the stem - probably just by making them fewer and larger. You might also make the whole thing a bit wider.   \n   \nBTW, I just looked at the spacing for real: your \"EVE\" needs to be closed up a hair.   \n   \nhhp\n\n"
    },
    {
      "time": "15 Feb 2004 — 4:12pm",
      "content": "_keep that nice parallel between the mane and the spikes in the stem_   \n   \nI agree   \n   \nHere is the logo with more color kick. After I posted I realized how desaturated it was. I am using Pantone 371 for the green and 1205 for the light gold. Also, is the spacing better between the EVE?   \n   \n ![](http://web.archive.org/web/20131021001734im_/http:/www.typophile.com/forums/messages/29/26601.gif)\n\n"
    },
    {
      "time": "15 Feb 2004 — 8:00pm",
      "content": "Looks great from here - just tighten the \"VE\" some more.   \n   \nBTW, I'd be interested in the development of the lo-fi version.   \nIt won't be easy doing it really well.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Feb 2004 — 11:40am",
      "content": "Tom:   \n   \nThe revised illustration is wonderful!   \nNice work! I'm warming up to it not   \nhaving a cross-bar. I still don't think   \nit reads as an 'E' but the mark, itself   \nis strong and perhaps that is all that   \nmatters.   \n   \nStill, I couldn't leave well enough   \nalone and had to try one idea. What if   \nyou added an element that hinted at a   \ncrossbar without it being an obtrusive   \nelement competing with the horse:   \n   \n ![evergreen](http://web.archive.org/web/20131021001734im_/http:/www.typophile.com/forums/messages/29/26704.gif)\n\n"
    },
    {
      "time": "17 Feb 2004 — 8:24pm",
      "content": "I think Tom did a fine job on it.   \nNo crossbar is needed.\n\n"
    }
  ]
}
