{
  "id": "30567",
  "title": "Problems with class kerning",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Dear List.\n\nI am trying to kern throw class kerning and i get this line:\n\n\"Start of new pair positioning subtable; some pairs may never be accessed: [f ff] [dotlessi i iacute icircumflex idieresis igrave]\"\n\nfor sure i had made some kind of mistake, can anybody help me with this?  \ni am thinking about wrong positioning in the classes panel, am i right?\n\nthanks in advance.\n\n",
  "author": "Dario Muhafara",
  "time": "12 Jan 2007 — 2:15pm",
  "uid": "8223",
  "comments": [
    {
      "time": "12 Jan 2007 — 3:08pm",
      "content": "Hello! Maybe the first thing to check is whether any glyph appears in more than one leftside class or more than one rightside class.\n\n"
    },
    {
      "time": "12 Jan 2007 — 3:33pm",
      "content": "There is a button with a yin-yang sign in the Kerning Assistance dialogue that helps you detect such kind of mistakes in the class definitions.\n\n"
    },
    {
      "time": "13 Jan 2007 — 7:02am",
      "content": "hi Tim, hi Karsten!\n\nI checked both things already and seems to be fine. there is no duplicate within the class kern. I have this [f ff] in both kern and metric classes, but should work fine anyway I believe...\n\n"
    },
    {
      "time": "15 Jan 2007 — 11:32am",
      "content": "Dario, did your problem get resolved?\n\n"
    },
    {
      "time": "16 Jan 2007 — 12:36pm",
      "content": "yes, with K.L.help. i copy his solution to keep it here for anybody else:\n\nYou need to do two things --  \n(1)  \nGo to the OpenType Panel (which contains the feature code)  \nand delete all the class definitions from the bottom-right  \npart.  \n(2)  \nGo to FontLab Options/Preferences (depends on whether you  \nuse Windows or Mac),  \nclick through the submenus \"General Options\" and \"Unicode  \nand OpenType\" -- and therein activate both options:  \n\"Add all glyph classes [...]\"  \nand  \n\"Do not add metrics classes\"\n\nNow go to the OpenType Panel again and compile. Over  \nhere this worked well without error message.\n\n"
    }
  ]
}
