{
  "id": "30568",
  "title": "Origo Narrow",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hey people,\n\nI've been working on the digitization of a wooden typeface for a while now.  \nI got the woodtype from my father, who in turn bought it some 15 odd years ago from a printer that was closing it's shop.  \nThe woodtype is not complete; so I had to design some of the characters from scratch. I first set and printed the type, and then scanned and traced the characters by hand in Illustrator and Fontlab.\n\nI would like to have some critique and suggestions. Although, since I have tried to stay mostly true to the woodtype, I don't want to change a great deal of the character shapes themselves.\n\nThe following characters were available in wood;  \n- The whole lowercase alphabet,  \n- The uppercase alphabet, except D and Q (made those),  \n- The question mark (although I did change it a bit),  \n- The numerals, except for 2 and 4, which were available in a less narrow, smaller pointsize version of the woodtype I also have. Working on digitization of that one as well. I changed those numerals to match size, narrowness and weight.\n\nI designed and added the rest, like the diacritics, interpunction, monetary signs, ligatures, the @, plus/minus, etc.  \nThese characters are open to suggestion. I'm still working on the ampersand.  \nThere are still some bézier-curve inconsistencies here and there, I'm going to smoothen everything out later. Kerning is also on it's way, I have about 550 pairs already.\n\nI own more woodtype, which I also plan to digitize, if they do not already exist.  \nPlease keep in mind this is the first step into digital typeface design I've made.\n\nThanks!\n\n| Attachment | Size |\n| --- | --- |\n| [Origo-specimen.pdf](http://web.archive.org/web/20150124022307/http:/typophile.com/files/Origo-specimen.pdf) | 107.17 KB |\n\n",
  "author": "Quincunx",
  "time": "12 Jan 2007 — 3:01pm",
  "uid": "14604",
  "comments": [
    {
      "time": "12 Jan 2007 — 3:05pm",
      "content": "I have already seen it, so I am also very interested in the following comments / critique.\n\n"
    },
    {
      "time": "15 Jan 2007 — 8:51am",
      "content": "Hello?\n\n"
    },
    {
      "time": "15 Jan 2007 — 11:08am",
      "content": "This is nice. I don't follow the wood type trend, but this did remind me of [Garage Gothic](http://web.archive.org/web/20150124022307/http:/www.fontbureau.com/fonts/sans/GarageGothic) from Font Bureau. Your font, obviously, has much more character in so far as the style goes. Some of the figures seem to have less character than the alphabet itself does. I'm looking at the lc\\_f wondering if more of that couldn't be put into the figures. Fewer points, rounder corners.\n\n"
    },
    {
      "time": "15 Jan 2007 — 12:36pm",
      "content": "It would be nice to see a picture of the original woodtype\n\n"
    },
    {
      "time": "15 Jan 2007 — 4:42pm",
      "content": "Tiffany:  \nThanks. Especially the rounder corners sounds as good advice, I see what you mean. I will try that out when I have some time to work on it again.\n\nSteven Wulf:  \nYes, [here is a picture](http://web.archive.org/web/20150124022307/http:/p-chez.endoria.net/woodtype/woodtypescan.jpg). It's a scan of the lowercase only. I've placed together the figures with photoshop, since the print itself is too large to scan in one piece, obviously. I don't have the uppercase composed in one file at the moment.\n\n"
    },
    {
      "time": "26 Feb 2007 — 5:53pm",
      "content": "I only just now realise I probably should have posted this in the Display forum? :)\n\n"
    },
    {
      "time": "20 Aug 2007 — 7:22am",
      "content": "I like this a lot.\n\n"
    },
    {
      "time": "20 Aug 2007 — 9:53am",
      "content": "Thanks. I still have to finish it, maybe add some more glyphs. :)\n\n"
    },
    {
      "time": "20 Aug 2007 — 3:41pm",
      "content": "Hello\n\nI like it, its comming relly well\n\nI just have one critique, the \"a\" doesn't seem to fit with the other letters, the curve is radically diferent from the rest. And the horizontal part of the \"a\" seems to overpass the curve. You could try making the \"a\" more like an upsidedown \"e\"\n\nPS: sorry for my bad english  \ni dont know if i expressed well hehe (I speak spanish)\n\nGreetings  \nFerch\n\n"
    },
    {
      "time": "20 Aug 2007 — 3:58pm",
      "content": "If you haven’t had the chance to see it, Jelmar posted [a complete specimen of Origo](http://web.archive.org/web/20150124022307/http:/www.typehigh.nl/origospecimen.pdf) on his website and it looks stunning, both the typeface and the graphic design of the specimen. Good job!\n\n"
    },
    {
      "time": "20 Aug 2007 — 7:14pm",
      "content": "Fernando: your English is good enough. It's not my native tongue either.  \nAnyway, to reply to your comment; I agree, the 'a' is quite different, although that curve is also in the 'g' and in a couple of other characters. I thought about changing it when I was digitizing it, but I decided I wanted to stay true to the woodtype I had printed. But maybe I might give it a try, and add it as an alternate.\n\nAntonio: Thanks for the compliment. Photos of the printed version of that specimen (which is 29x29 cm by the way) are on my site as well. But since I have a flash-site, I can't specify a direct link (which is why I sort of hate flash sites, eventhough I made it myself). But it's in the 'Print' section, on the top. I say this because in the PDF you can't see the embossed and spot-varnished parts of the physical specimen. Which were the most fun to make, with photopolymer plates and such. :)\n\n"
    }
  ]
}
