{
  "id": "30598",
  "title": "Glyphs that Gall",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Does anyone else get annoyed with certain letter shapes in fonts? For example, I can't stand the foot of the R in Gill Sans stretching out well beyond its bowl above. It's as though it's taunting, \"Don't even think about auto-kern.\" The cockeyed serifs of Garamond's T also niggle me. I want to nudge them like I would an oil painting hung askew on a wall. In fact, I don't know if I've ever used Garamond or Gill Sans in any project, probably because I see them as flawed. Are there others who get vexed by a P or peeved by an X?\n\n",
  "author": "<a href=\"/web/20110812151831/http://typophile.com/user/15738\" title=\"View user profile.\">pdxuser</a>",
  "time": "<br>",
  "uid": "15738",
  "comments": [
    {
      "time": "",
      "content": "I hate the counters of the R and P in Palatino; that little angle in the curve becomes visible at around 13 points and irritates the hell out of me.\n\nOf course, at 10 points it's a gorgeous book face, so I can live with it.\n\n"
    },
    {
      "time": "",
      "content": "The question mark in Futura has made a couple of my clients stop in their tracks. Also, I know it detracts from the purity of the thing, but Futura's 'j' just cries out for the slightest curve to finish off the descender.\n\n"
    },
    {
      "time": "",
      "content": "OK, this verges on the neurotic, but I have never liked the «J» in Ehrhardt and the like –&nbsp;I know that it is one of its hallmarks, but that doesn’t help.\n\n"
    },
    {
      "time": "",
      "content": "The e in Times New Roman is very awkward to my eyes. (Of all the glyphs to be irked by, why did mine have to be such a common one!)\n\n"
    },
    {
      "time": "",
      "content": "The \"I\" and \"J\" in Present frustrate me no end: the former looks like a \"J\" and the latter is just plain ugly.\n\n"
    },
    {
      "time": "",
      "content": "It's funny, I fixed the awkward bits of Futura that you are all talking about for a magazine recently. The \"?\" the \"j\" and many other bits. I wish I could use that finished product on my own projects!\n\nI dislike any lowercase g with a squished lower bowl, like Century Oldstyle. I also can't stand a lowercase a where the bowl connects too high i.e. Neuropol.\n\nThere are so many letter forms I could hate on, many including my own previous efforts. Someone should start a thread about what parts of letters you love...\n\n"
    },
    {
      "time": "",
      "content": "Stempel Schneidler has the worst question mark out there - it's bloody upside down. Don't like Weiss's much either.\n\nToday Sans has an unusable ampersand with no alternate.\n\nBut Emigre is IMHO the worst offender. I hate that squared off lowercase 'a' that so many of their fonts (Priori, Vista) have. Dalliance has that awful k.\n\nI also don't like Gill's R. I prefer an R with a straight leg that comes out of the bowl, as in Gotham, Avenir, Trade Gothic and so many others. Frutiger's R is also a deal-breaker.\n\nBut I'm with Matthew, it would be nice to praise our favorite glyphs, like Caslon Italic's exquisite ampersand!\n\n"
    },
    {
      "time": "",
      "content": ":'^( I love that wacky little 'k' in Dalliance.\n\n"
    },
    {
      "time": "",
      "content": "I love 'em all.  \nHowever, I come from a culture that didn't believe in orthodonty.\n\n"
    },
    {
      "time": "",
      "content": "I've mentioned this somewhere before, but I hate it when the pair \"rn\" comes up and the letters are too closely spaced, overinked, or slightly blurry and the result is difficult to distinguish from an \"m\". Some fonts are better about this than others, but it happens to me all too often when I'm reading.\n\n"
    },
    {
      "time": "",
      "content": "Right, but you can't put all the blame on the r.\n\n"
    },
    {
      "time": "",
      "content": "Rotis “e” is a bit irritating.\n\n"
    },
    {
      "time": "",
      "content": "How about the e of Serif Gothic, which becomes increasingly awkward as the weights become heavier?\n\n"
    },
    {
      "time": "",
      "content": "I can't stand serifs on Is and Js in a sans serif font. Do me a favour.\n\n"
    },
    {
      "time": "",
      "content": "And while I'm on the subject of upper case, why do Q and J think that they can just ignore the baseline in some fonts. I know they're worth a lot in Scrabble but that's no excuse to do what they feel like.\n\n"
    },
    {
      "time": "",
      "content": "I just looove Serif Gothic -- all of it!\n\nBut, OK: for me, the ampersand in Franklin Gothic -- Adobe's version, at least -- has a very awkward stroke on the way down. It just looks _wrong_.\n\n"
    },
    {
      "time": "",
      "content": "Gill Sans lowercase a. The upper terminal is too thick.\n\n"
    },
    {
      "time": "",
      "content": "\"Rotis “e” is a bit irritating.\"\n\nOnly a bit? Bugs the hell outta me!\n\n"
    },
    {
      "time": "",
      "content": ":^)  \nI just had to read a whole book set in Rotis Sans & Serif. But I’m getting over it. Day by day.\n\n"
    },
    {
      "time": "",
      "content": "Helvetica R.\n\n ![](http://web.archive.org/web/20110812151831im_/http:/typophile.com/files/revolt_6697.jpg)\n\n"
    },
    {
      "time": "",
      "content": "On that note, Arial 'R'.\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "Hear, hear. Arial R just makes me wanna puke, the way it tries to rip off Frutiger.\n\n"
    },
    {
      "time": "",
      "content": "The @ symbol in (FF) DIN. WTF?\n\n"
    },
    {
      "time": "",
      "content": "All of Arial is just wrong.\n\nI don't like most of the lowercase sans by Hoefler and Frere... personality of capitals do not 'match' lowercase...like Gotham and Verlag. I'm gonna get chewed out for that one.\n\nHelevtica Captial R needs to get shot(I love still Helvetica though). Chalet R looks right to me.\n\nAlso the funky/unconventional way all the Didot OSF range. 99.999999999999% of all the fonts in the world that ship with OSF numerals range a certain way. But the Didots just have to be different... very maddening.\n\nI love minion to death but I keep looking at the lowercase 'a' and I wonder if its too small. I'm not sure, so that bugs me.\n\nMikey\n\n"
    },
    {
      "time": "",
      "content": "<cite>All of Arial is just wrong.</cite>\n\nI don't agree. It' s just not designed to look cool. In small sizes it works better than many others, that is why you can find it being used in dicionaries, for example. And those who design dictionaries are certainly not careless when choosing the fonts.\n\nOh, and the s in Avant Garde just sucks.\n\n"
    },
    {
      "time": "",
      "content": "I really dislike the a and the e in gill.  \n.........................................................  \n [Bison Design](http://web.archive.org/web/20110812151831/http:/www.bisondesign.no/)  \n [Spön](http://web.archive.org/web/20110812151831/http:/www.myspace.com/sponnorway)\n\n"
    },
    {
      "time": "",
      "content": "<cite>\"I can’t stand serifs on Is and Js in a sans serif font. Do me a favour.\"</cite>\n\nYes, I agree on that one. I've seen so many sans faces that have nice uppercase chars, just to stumble upon a I or J with a silly serif on it. Horrible.\n\n"
    },
    {
      "time": "",
      "content": "_And those who design dictionaries are certainly not careless when choosing the fonts._\n\nYeah, but they can be cheap can't they? :) I don't recall ever having to pay for Arial, yet its on every computer I think I've ever used. I agree its not as bad as many people say, but I can't imagine anyone choosing it over...actually...ANY OTHER...sans serif typeface if money isn't an object.\n\n"
    },
    {
      "time": "",
      "content": "Never ever ever!\n\n"
    },
    {
      "time": "",
      "content": "\\>In small sizes it works better than many others\n\nI certainly do not agree with this. Because Helvetica/Arial has a large x-height and wide characters, it will appear large at small nominal sizes. But that is not sufficient reason to use it, because IMHO works very poorly as a text font for print. This is not just my opinion, but shared by many, including on typophile.\n\nIt works as a display font, though I personally am sick of it.\n\n\\>And those who design dictionaries are certainly not careless when choosing the fonts.\n\nAssuming high competence is a dangerous assumption in any field. I have lots of reference books and frankly can't remember even a single one from a major publisher having text in Helvetica/Arial. What publisher  \npublished this dictionary? Can you post a scan?\n\n"
    },
    {
      "time": "",
      "content": "Akzidenz-Grotesk — **2** _(Lining)_\n\n"
    },
    {
      "time": "",
      "content": "Mate, I like serifs on Sans serif J, it helps to fill the space left!\n\nMuzz\n\n"
    },
    {
      "time": "",
      "content": "\\>\\>And those who design dictionaries are certainly not careless when choosing the fonts.\n\n\\>Yeah, but they can be cheap can’t they? :)\n\nI think this a reference to a Paul Luna thread on the ATypI list where Paul defends his use of Arial Black in some dictionary project he was involved in. Of course Arial on it's original widths rather than on Helvetica widths is a better design.\n\nAs for use at small sizes - Arial's critics always look at the font at display sizes and all fail to credit the ground-breaking hinting and engineering work that went into it as a screen font. I think the proof here is in the rendering and my guess is that you'll find more Web pages that specify \"Arial, Helvetica\" than \"Helvetica, Arial\".\n\nCheers, Si\n\nPS I'm biased ;-)\n\n"
    },
    {
      "time": "",
      "content": "\\>the ground-breaking hinting and engineering work that went into it as a screen font\n\nYou'll note that above I said \"as a text font for print\". It is a completely different animal as a screen font, I think, as the hinting quite changes it for the screen. I still like other MS fonts better for the screen, namely Verdana and Georgia. And I look forward to using the new clear type fonts.\n\nI would be interested to see the Paul Luna design. If there are short lines and paragraphs, and adequate leading he might pull it off--not that there wouldn't be better alternatives. The more there is continuous text, the worse Arial & Helvetica performs, IMHO.\n\n"
    },
    {
      "time": "",
      "content": "_I think the proof here is in the rendering and my guess is that you’ll find more Web pages that specify “Arial, Helvetica” than “Helvetica, Arial”.... PS I’m biased ;-)_\n\nWell, duh. And your employer is grateful, I'm sure.... ;-)\n\n"
    },
    {
      "time": "",
      "content": "\\>Well, duh. And your employer is grateful, I’m sure…. ;-)\n\nFor sure, it kind of shows that web designers will specify the best font for the job and consider Arial the superior screen font.\n\n\\>You’ll note that above I said “as a text font for print”.\n\nSorry, Bill, 'twas a reference to critics in general not your comment.\n\nThe thread would be in the AtypI list archive I believe. It would be maybe two or three years ago.\n\n"
    },
    {
      "time": "",
      "content": "Every font that uses the same form for l and I.\n\n"
    },
    {
      "time": "",
      "content": "Are you including numerals that are wrongly weighted in this galling gallery of glyphic grotesqueness? Then perhaps you'll find the original Fat Face 8 below pretty bothersome...\n\n ![](http://web.archive.org/web/20110812151831im_/http:/typophile.com/files/Thorne-Fat-Face-numerals_6502.jpg)\n\nOr numerals that are simply drawn wrongly? Like the hideous 3 _(the left hand one)_ and 7 of the early prototype of Gill Sans...\n\n ![](http://web.archive.org/web/20110812151831im_/http:/typophile.com/files/Gill-Sans-Numerals_4125.jpg)\n\n"
    }
  ]
}
