{
  "id": "30591",
  "title": "(x) Comic like script font - Damn Noisy Kids {Lari}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Looks like free download... Anyone?\n\n| Attachment | Size |\n| --- | --- |\n| [Bild-1.gif](http://web.archive.org/web/20071021124127/http:/typophile.com/files/Bild-1_0.gif) | 2.8 KB |\n\n [‹ (x) narrow sans text face - ITC Officina Sans {Stephen}](http://web.archive.org/web/20071021124127/http:/typophile.com/node/30605 \"Go to previous forum topic\") [(x) \"Region Midt Jylland\" straight-sided sans - FTN Morgan {Marc O} ›](http://web.archive.org/web/20071021124127/http:/typophile.com/node/30610 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071021124127/http://typophile.com/user/10154\" title=\"View user profile.\">Brown Fox</a>",
  "time": "<br>",
  "uid": "10154",
  "comments": [
    {
      "time": " 14.Jan.2007 3.36pm",
      "content": "Damn Noisy Kids, blambot.com\n\n"
    },
    {
      "time": " 15.Jan.2007 11.24am",
      "content": "I hate to be a killjoy, but the fonts on Blambot are not FREE. Check the license. I’m sure it still says non-commercial work.\n\n(A few minutes later.)\n\nHere is the license downloaded with one of the downloadable fonts:\n\n<cite>These fonts are freeware for independent comic book creation and non-profit use ONLY. ( This excludes use by “mainstream” publishers, (Marvel, DC, Dark Horse, Oni, Image, SLG, Top Cow, Wildstorm, Crossgen and their subsidiaries) without a license fee. Use by a “mainstream” publisher (or it’s employee), and use for mainstream comics, or non-comic for-profit endeavors incurs a license fee be paid to Blambot. In Essence, this means:<br>\n—— Anyone may use these fonts for non-profit projects.<br>\n—— If you are a self-publisher/creator you may use these fonts for any independently published project, for profit or non profit.<br>\n—— If you are an independent publishing comics through a mainstream company (see above) there is a license fee.<br>\n—— If you are not an independent comic creator and you intend to use these fonts in a commercial project, there is a license fee.<br>\nE-mail Blambot for specific fonts’ license fees, and for an invoice for your records.<br>\n</cite>\n\n"
    }
  ]
}
