{
  "id": "30604",
  "title": "Advice needed: font for poems",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hello, I'm a first time poster and ultra-newbie when it comes to typeface.\n\nI'm looking for a font to use in sending my poems out to journals/mentors. In looking around @ serif fonts, I tend to look for fonts that \"disappear\" when you look at them. I have a few books of poems that I'm using as models. The two closest one's I've found - Garamond and MInion - are vaguely similar to what I'm trying to match; but when I compare them closely they are much heavier. What would be perfect is a Minion \"Light,\" if you know what I mean. Is minion pro different and how so? Thanks for the very interesting forum. Cheers, ~d\n\n",
  "author": "katzenjammer",
  "time": "14 Jan 2007 — 9:29pm",
  "uid": "16268",
  "comments": [
    {
      "time": "14 Jan 2007 — 9:48pm",
      "content": "Define \"dissapear\". I would think that your definition would match the [crystal goblet](http://web.archive.org/web/20150325212525/http:/gmunch.home.pipeline.com/typo-L/misc/ward.htm) sort of context, but then you also refered to \"light\" in a font-weight term.\n\n"
    },
    {
      "time": "14 Jan 2007 — 9:59pm",
      "content": "Thanks for the article - and sorry if I'm being vague; I'm trying to learn my way around the terminology!\n\nOn the Crystal Goblet piece: yes, that's what I mean: for my purposes at least, too many fonts seem to draw attention to themselves (too much thick/thin, too much angularity) so that my eye catches on the font, not the words.\n\nMinion seems ideal in this respect - I was hoping someone might have suggestions along this line. The only problem with Minion is that I'd like to use something a little lighter in terms of font weight.\n\n"
    },
    {
      "time": "14 Jan 2007 — 10:11pm",
      "content": "If you buy Minion Pro Opticals, you can use the Medium optical size, or or even Subhead if you want something really delicate (Display would be overkill, I think). Of course, this all depends on the quality of printing and the point size you'll be setting your poems at: If the letters are too fine, the thins won't come out when printed, and that's not the kind of \"disappearing\" you want.\n\n[http://www.adobe.com/type/browser/P/P\\_1721.html](http://web.archive.org/web/20150325212525/http:/www.adobe.com/type/browser/P/P_1721.html \"http://www.adobe.com/type/browser/P/P\\_1721.html\")\n\nOtherwise it might be useful to look for a font that is less condensed, and will create a lighter color on the page. It's too late to think of an appropriate example; hopefully someone else can come up with one.\n\nHope that helps.\n\nDavid\n\n"
    },
    {
      "time": "14 Jan 2007 — 10:13pm",
      "content": "Don't worry. Now that you've defined it, we sort of know what you wanted to do. Light oldstyle serif are tricky beasts because they can look anemic. At the moment, Jenson Pro Light, Centaur and Bembo is all I can think of.\n\n"
    },
    {
      "time": "14 Jan 2007 — 10:28pm",
      "content": "Thanks to the both of you for your expertise; I'll play with these (all of which look promising!) and see where they lead me. I don't suppose there's a way to try fonts before buying? After all, it's rather hard to know how they'll look on paper :-)\n\n"
    },
    {
      "time": "14 Jan 2007 — 10:34pm",
      "content": "Jenson should be included in your Creative Suite installation. So if you got Minion and Adobe Garamond, I'm sure you'll get Jenson, too.\n\n"
    },
    {
      "time": "15 Jan 2007 — 4:53am",
      "content": "Spectrum is a (very) light \"garamondish\" typeface, too.  \n [http://www.linotype.com/1491/spectrum-family.html](http://web.archive.org/web/20150325212525/http:/www.linotype.com/1491/spectrum-family.html \"http://www.linotype.com/1491/spectrum-family.html\")\n\n"
    },
    {
      "time": "15 Jan 2007 — 5:13am",
      "content": "I know, you want to go for the crystal goblet. However, it would be useful to know roughly what kind of poetry you write. Depending on the subject you treat and the form you use, a font like Centaur for example can look terribly misplaced. It depends also on the content whether a type face «disappears». Have you ever considered using a monospaced font like Screenplay-Remington? Many editors like that: It reminds of typewriter-scripts and it doesn’t look like you have tried to do their job.\n\n"
    },
    {
      "time": "15 Jan 2007 — 5:56am",
      "content": "I don't know if this will help you at all.\n\nWhen I design and layout poetry books, I like knowing the contents so I can pick an appropriate font.\n\nIn a recent poetry book - it was very \"mushy.\" My choice for titles was Bible Script and for the poem itself, Berkeley Old Style. They worked well together, and the client was so delighted we've done 2 more for him that same way.\n\nI've worked with many art directors over the years - and they always loved to remind me -- there is always a marriage between the type and the art. And in this case, it would be between the type and the poetry.\n\nBest of luck. Let us know what you selected, and please show us a sample.\n\n"
    },
    {
      "time": "15 Jan 2007 — 6:14am",
      "content": "I agree with heron2001 what concerns the relationship between content and type. However, here it is not so much the question of designing and layouting poetry, but the question of how a journal editor might want to read a typoscript. And from my experience I can tell you: neat and clean, but not much «designed» at all.\n\n"
    },
    {
      "time": "15 Jan 2007 — 8:55am",
      "content": "Thanks all :-)\n\nI suppose the best way to characterize my poetry is to list my poetry heroes: Middle English anons., John Skelton, Chaucer, John Clare, Emily Dickinson, Thomas Hardy, Robert Graves, Robert Frost, and Richard Wilbur. That is, I am or try to be rooted in traditional verse. As for subject matter, I'm with Hardy: \"What made for poetry 2000 years ago makes for poetry now.\" Hopefully, all this \"places\" me for you without \"catagorizing\" (ahhhh!) me.\n\nAs to editors, yes I respect what they do very much and am not trying to do their job. When I send poems to an editor in hopes of publishing I merely send it in standard garamond.\n\nHowever, I also have editors & mentors to whom I send poems (either previously published or not) to introduce myself, keep them updated as to my work, etc. And I want it to look really good; I know I am preaching to the choir when I say that the typeface/layout makes all the difference between something that is pleasurable to read and something that is emphatically not! We all have certain books that we return to merely because they are so well designed: the meanings/contents/words almost shimmer.\n\nIf I scan a page of what I'm trying to replicate, would someone be able to identify the typeface and so on? thanks again.\n\n"
    },
    {
      "time": "15 Jan 2007 — 9:31am",
      "content": "<cite>I tend to look for fonts that “disappear” when you look at them</cite>\n\nHow about invisible ink?\n\n"
    },
    {
      "time": "15 Jan 2007 — 11:13am",
      "content": "If you use well-known types, they will remind readers of other works they have read in the same fonts .\n\nHowever, there are new faces in the traditional humanist genre, such as the solid and unpretentious [Verdigris](http://web.archive.org/web/20150325212525/http:/www.mvbfonts.com/html/fonts/verdigris/pk_verdigris.htm) (but what a poetic name!).\n\n"
    },
    {
      "time": "15 Jan 2007 — 1:50pm",
      "content": "Okay, I'm hoping the following examples will clarify what I'm looking for; even better, if anyone can identify the typefaces they get a free bottle of scotch.\\*\n\nI apologize if these typefaces/layouts are laughable to the practiced eye; to me, as a poet, I like the way they look and never tire of the clean and \"invisible\" look discussed (and poked fun at, Ha!) above.\n\n1. The first is from a poem book of Robert Graves. It's my absolute favorite of the three. I don't know why I like it so, but I do. It's from a ratty old Doubleday Anchor Book, 1966.\n\n ![](http://web.archive.org/web/20150325212525im_/http:/typophile.com/files/Graves_4638.jpg)\n\n2. The second is from a Philip Larkin by the Marvell Press (Faber & Faber). It's more modern than 1, a little lighter. I like it very much.\n\n ![](http://web.archive.org/web/20150325212525im_/http:/typophile.com/files/Larkin_4951.jpg)\n\n3. The third is from a Richard Wilbur book (2000), also a beauty:\n\n ![](http://web.archive.org/web/20150325212525im_/http:/typophile.com/files/Wilbur_4226.jpg)\n\nCan anyone identify these fonts - they are not indentified in the books anywhere; or, based on my examples, advise me on what sort of font I might want to use for my own poems?\n\nThanks so much for your help. Cheers, ~david\n\n\\*just kidding!\n\n"
    },
    {
      "time": "15 Jan 2007 — 2:03pm",
      "content": "The first one looks like Electra, the second Palatino.\n\nOh, digital Electra is much lighter--too light in the view of many. Still, it might be fine from a laser printer, as they tend to thicken.\n\nThe last one is Granjon, I think.\n\n"
    },
    {
      "time": "15 Jan 2007 — 2:39pm",
      "content": "Thanks William - you're right on (!) with all of them actually. I've downloaded PDF examples from linotype and compared them.\n\nYou mentioned that a laser printer \"thickens\" them - is that why when I bring my Palatino (the one that comes installed on my Mac) down to 10 point to match the Larkin, it's quite a bit thicker than the example above (#2) - or is that a Palatino font pack would include lighter palatino designs?\n\nThanks!\n\n"
    },
    {
      "time": "15 Jan 2007 — 4:38pm",
      "content": "Well, Palatino was originally designed as a display font. Aldus is its mate for text sizes.\n\nThere is a problem with Palatino looking too heavy in text--but it can look fine also. It is a matter of how it is handled--all the other features of type layout, as well as the printer.\n\nIn general, how attractive your print-outs will be will depend as much on the typography as the typeface you choose. The two go together. If you haven't already, I recommend getting a copy of Bringhurst's 'Elements of Typographic Style.' He is a prominent poet as well as typographer, and the book will I think just blow you away by its eloquence and insight.\n\n"
    },
    {
      "time": "15 Jan 2007 — 5:52pm",
      "content": "Thank you so much William - I see what you mean about typeface choice being in dynamic relation to typography/layout; I'd love to learn about this; seems incredibly complex and interesting; I'm placing my order for the book you mention right away. Thank you so much for your thoughtful replies. Cheers!\n\nps. I can't help thinking that buying this book is a plunge into something I'll never step back out of; there's something very alluring about all this. :-0\n\n"
    },
    {
      "time": "15 Jan 2007 — 11:54pm",
      "content": "Let me be the first to welcome you into the club, David. Yes, even before you received the book :-)\n\n"
    },
    {
      "time": "16 Jan 2007 — 2:31am",
      "content": "Oh wow - a convert.\n\nFinally, it's been so many years...\n\nCongratulations William Berkson - you've still got it...\n\nand David Smith -- it's in the blood, you cannot get away from it -- and I'm so happy it finally woke up within you. Meanwhile, David Smith is an excellent name to use in the type/art world - in New York City in the 1980s - we had three art directors all named David Smith. My favorite worked in promotion for Pinnacle Books. Just had one of those corny typographer sense of humors.\n\nWelcome.\n\nP.S. Have you thoroughly checked the front matter of any of the poetry books you like? Normally on the copyright page in about 7 or 8 point, way down below, they let you know what type faces were used. Not everyone did it, but when a book was well set, it was always a pleasure to see it there. Some publishers use to even go so far to name the typeshop that set it (but that was very rare).\n\n"
    },
    {
      "time": "16 Jan 2007 — 7:35am",
      "content": "Hows about...\n\n[Perpetua](http://web.archive.org/web/20150325212525/http:/www.myfonts.com/fonts/linotype/perpetua-2/perpetua/) ...elegant, subtle and light.\n\n[Galliard](http://web.archive.org/web/20150325212525/http:/www.myfonts.com/fonts/linotype/itc-galliard/roman/) ...if you like Garamond then you will probably like this.\n\n[Poetica](http://web.archive.org/web/20150325212525/http:/www.myfonts.com/fonts/linotype/poetica/chancery-i/) ...appropriately named at least. Mostly an italic family and maybe a little too classical and not transparent enough. It has many alternates and swashes.\n\n"
    },
    {
      "time": "16 Jan 2007 — 1:39pm",
      "content": "----P.S. Have you thoroughly checked the front matter of any of the poetry books you like? Normally on the copyright page in about 7 or 8 point, way down below, they let you know what type faces were used----\n\n@heron2001: I did check the above books before posting and found nothing; since then I've gone through a lot of my other \"top shelf\" poetry books and...lo and behold!....most of them are set in Electra. Now that I've looked into Electra's history, I can see why I like it so much; the designer had some extremely interesting things to say about typeface, IMHO; and I feel I know exactly what he means, intuitively at least.\n\nUnfortunately, digital Electra - as William pointed out - isn't nearly as shimmering (doesn't quite \"sing\" as someone beautifully put it) as the examples I have on my shelves. Of course, this took me to inquiring about letterpress printing and so on, until I saw how expensive that would be (ummm..specially considering how much I've spent fiddling with fonts); my apartment floor is littered with examples/prints.... \\*sigh\\* I'm having fun though. \\*grin\\*\n\nThanks for the welcome everyone :-)\n\n"
    }
  ]
}
