{
  "id": "30621",
  "title": "Times for new 'experts'...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://www.newvision.co.ug/D/8/12/543397](http://web.archive.org/web/20081208141008/http:/www.newvision.co.ug/D/8/12/543397 \"http://www.newvision.co.ug/D/8/12/543397\")\n\n<cite>They also point out that the printing technology and the type font used were not in existence in 1987 when the Scotland Yard report was written.<br>\n“The type font used, Times New Roman, was first supplied as a computer version with the final Windows 95 update in 1998, more than ten years after the date on the report (May 7, 1987),” experts commented. </cite>\n\n [‹ Adobe - A little mad](http://web.archive.org/web/20081208141008/http:/typophile.com/node/30579 \"Go to previous forum topic\") [EULA Data Collection: Which allow modifications and which do not. ›](http://web.archive.org/web/20081208141008/http:/typophile.com/node/30528 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081208141008/http://typophile.com/user/1049\" title=\"View user profile.\">sii</a>",
  "time": "<br>",
  "uid": "1049",
  "comments": [
    {
      "time": " 16.Jan.2007 3.10am",
      "content": "This brings up another issue: why does it seem laymen often use the term “type font” when you’ll never hear it among typographers and type designers?\n\n"
    },
    {
      "time": " 16.Jan.2007 8.35am",
      "content": "So readers don’t confuse it with a baptismal font, used in a different kind of printing technology.\n\nAnother frequent piece of dumbass journalism is the use of “typeface” as a generic noun, as in “his love of typeface began at an early age”.\n\n"
    },
    {
      "time": " 16.Jan.2007 8.40am",
      "content": "Maybe because they can’t separate the action from what is being acted upon? Ergo, I am typing with this font. Ah a stretch. Oh well.\n\n"
    },
    {
      "time": " 16.Jan.2007 8.49am",
      "content": "Is anyone else confused about that date? I seem to remember TNR on my good ol’ 386, which was long before 1998... Unless of course there were certain distinctive characters used in the report that were not released until 1998.\n\n- Lex\n\n"
    },
    {
      "time": " 16.Jan.2007 8.56am",
      "content": "Windows 3.1 shipped in 1992 with TNR, but the laserwriter included Times outlines in 1985, and the font was of course popular in daisywheel and golf-ball impact printers and typewriters before that.\n\n"
    },
    {
      "time": " 16.Jan.2007 9.35am",
      "content": "Actually, the use of “type font” may make sense here, to distinguish “font”, as physical or digital instance, from “type face”, which is a design capable of being expressed in various media by various hands. The idea being wrestled with, is that a particular font is a dateable iteration of a typeface design.\n\nThe problem is that in popular usage, “font” has come to mean the same as “typeface”, losing the distinction between the two. So while we may think “type” is a redundant prefix to “font”, that’s not so for the writer here, who may be attempting to re-establish the distinction.\n\n"
    }
  ]
}
