{
  "id": "30620",
  "title": "Happy Hangul Day!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Happy [Korean Alphabet Day](http://web.archive.org/web/20071109073914/http:/en.wikipedia.org/wiki/Hangul_Day), everyone!\n\n [‹ does anyone have a swedish identity (three crowns)](http://web.archive.org/web/20071109073914/http:/www.typophile.com/node/31440 \"Go to previous forum topic\") [Obama '08? ›](http://web.archive.org/web/20071109073914/http:/www.typophile.com/node/31338 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071109073914/http://www.typophile.com/user/553\" title=\"View user profile.\">matthew_desmond</a>",
  "time": "<br>",
  "uid": "553",
  "comments": [
    {
      "time": " 13.Feb.2007 1.48pm",
      "content": "Long live by far the best writing system Mankind has ever seen!\n\nhhp\n\n"
    },
    {
      "time": " 13.Feb.2007 3.41pm",
      "content": "I was initially confused, because Hangul Day for me is 9 October, but it seems in North Korea it’s 15 January. I should have remembered that North Korea has a different date for it... Well, I guess it’s an excuse to celebrate twice a year.\n\n"
    },
    {
      "time": " 13.Feb.2007 4.13pm",
      "content": "Early October (the exact date varies each year) is also the “birthday” of Armenian.\n\nhhp\n\n"
    },
    {
      "time": " 13.Feb.2007 9.29pm",
      "content": "Happy Hangual+Armennian Days\n\n"
    },
    {
      "time": " 14.Feb.2007 9.26am",
      "content": "BTW, I’m very interested in “progressive” fonts in scripts I don’t have nativity in (which is, like, all of them except three) and the Glendale area happens to have a huge Korean community, with their video rental stores exhibiting a dazzling spectrum of liberated letterforms. The other day I saw a pretty amazing rendition of Hangul - it almost looked like a totally different script - and I went back to take a photo... Well, that poster is gone, but I took the following four photos, and would be very interested in learning of how a native sees the type.\n\nSeeing as what day it is...\n\n ![](http://web.archive.org/web/20071109073914im_/http:/www.typophile.com/files/HangulPoster1_5651.jpg)\n\n—\n\nTibetanized? Or just Euro-medieval?\n\n ![](http://web.archive.org/web/20071109073914im_/http:/www.typophile.com/files/HangulPoster2_5408.jpg)\n\n—\n\nCouldn’t bear to chop off that pretty scalp.\n\n ![](http://web.archive.org/web/20071109073914im_/http:/www.typophile.com/files/HangulPoster3_4251.jpg)\n\n—\n\n ![](http://web.archive.org/web/20071109073914im_/http:/www.typophile.com/files/HangulPoster4_3873.jpg)\n  \nIs this last one easily readable? That would a pleasant shock.\n\nhhp\n\n"
    },
    {
      "time": " 14.Feb.2007 9.59am",
      "content": "Hrant, that last one is indeed easily readable. (It says, literally, “salt doll”. I was intrigued by this title, which I haven’t seen before, and a quick bit of googling tells me it’s the name of a TV drama series.) Informal lettering written with a brush is all the rage these days in South Korea, appearing on everything from food packaging, signs on restaurants, and TV titles.\n\nIt’s fascinating for me to imagine how Korean lettering and fonts must look to those who don’t read Korean. Being a native reader, it’s not something I have had a chance to think about very often. I wouldn’t have stopped to think that yes, it makes sense that someone who doesn’t read Korean would wonder whether an example like the one above would be easily readable. I can’t be completely objective in judging how my own familiarity affects how I read different scripts, but I think it’s a credit to Hangul (and good news for Korean lettering artists) that the glyphs can be so playful and informal without hurting readability.\n\nBy the way, ugh on that first example with all the pink and all the hearts. Though I just possibly may be bitter about having to do an all-night shift on St. Valentine’s Day.\n\n"
    }
  ]
}
