{
  "id": "30644",
  "title": "Extensis announces new Suitcase version for Windows",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I thought I would post this, since there have been a few lively threads about font management for Windows.\n\n[http://www.extensis.com/en/about/press\\_release\\_content.jsp?releaseId=600...](http://web.archive.org/web/20131017095615/http:/www.extensis.com/en/about/press_release_content.jsp?releaseId=6000020 \"http://www.extensis.com/en/about/press\\_release\\_content.jsp?releaseId=6000020\")\n\nBasically, the new version adds features that Suitcase customers have been wanting for some time. Most importantly, it will use FontSense powered, plug-in based auto-activation for InDesign, Illustrator and Quark. It also has a Vault system like Suitcase Fusion which will allow users to backup their database and fonts. It will be compatible with Windows 2000, XP and Vista. Disclaimer: I work for Extensis.\n\n",
  "author": "canderson",
  "time": "16 Jan 2007 — 9:46am",
  "uid": "9913",
  "comments": [
    {
      "time": "16 Jan 2007 — 1:03pm",
      "content": "Looks pretty interesting!\n\nI'd love to see Suitcase Fusion for Windows, but unless it's horribly buggy, this will doubtless be the best available product for us pathetic\\* Windows users.\n\n\\* Pathetic in that we haven't had any decent font management applications in years.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "16 Jan 2007 — 6:00pm",
      "content": "There are a couple of slightly confusing things about this release. It's actual name will be \"Windows Client for Suitcase Server X1\" because it connects to Suitcase X1 Server. So within the Suitcase line there is Suitcase X1 Client now for both Mac OS and Windows. Suitcase Fusion is the current standalone version for Mac. However, this new release does have a Vault and FontSense powered plug-ins, so in some ways it would have made sense to call it \"Suitcase Fusion for Windows\". The product is definitely a move towards cross-platform feature parity.\n\nThe good news is that this release adds features that customers have been asking for, regardless of what it says on the box. When Suitcase 9.2 was designed, it was more or less intended for single-user systems where the user was a local admin. For many current business customers this was a problem. The new release keeps user-specific settings where they should be, and can accomodate situations where the user is not an administrator.\n\nThe broad support for windows versions is also aimed at business customers. On the Mac, a huge percentage of customers are using 10.4, with almost no one using 10.3 or 10.2. On Windows I'm expecting corporate customers to stick with XP or even 2000 for quite a while. Standalone customers are going to be getting Vista with their new systems. So, there will probably be a need for compatabiltiy on both ends.\n\n"
    },
    {
      "time": "22 Jan 2007 — 11:11am",
      "content": "I'm looking forward to taking a closer look, but for the moment and as another option to consider, I've been using Proxima's FontExpert 8 since it came out last year and have been quite pleased with it. Not only does it have a nicely customizable interface (my layout is split between font groups, a visual listing of each group's contents (in the fonts themselves), a full character map pane, a file properties pane, and a customizable specimen pane). FontExpert has a plug-in for auto-activation in InD CS2, but it does have a fairly significant lag in opening an InD file where activation is called up (due to the fact that the FontExpert is not running in the background but must be \"started\" each time a font is called-up).\n\nIn the last version of Suitcase I found a variety of fonts would de-activate on their own (primarily semibold Adobe fonts), so I'll be curious to see if this bug has been fixed, and to see how smoothly the auto-activation works.\n\n"
    },
    {
      "time": "23 Jan 2007 — 10:05am",
      "content": "It is my understanding that the font activation engine has been significantly redesigned. This may have an overall effect on the way in which applications recognize active fonts, although I only have a fairly shallow understanding of how the technology works.\n\nIt's been a while since I tried FontExpert, but my impression is that Suitcase's UI will continue, for good or bad, to be less complex. Suitcase 11 will look basically the same, with most of the differences related to functionality. I think the reasoning is that an average graphic designer should be able to manage fonts without reading a manual.\n\nIf you try it out, let us know what you think. I think it should be out in a month or so.\n\n"
    },
    {
      "time": "23 Jan 2007 — 10:29am",
      "content": "I hope it works better on Windows than it did on my Mac. It was okay for graphic design stuff but was not deadly enough at removal to be usefull when designing type and constantly replacing font versions.\n\nChrisL\n\n"
    },
    {
      "time": "25 Jan 2007 — 10:29pm",
      "content": "I use Suitcase 9.2 for Windows. What I would love is a character map like Font Expert or Main Type have. However, I like the way Suitcase activates fonts and I find it easy to organize my fonts into sets in Suitcase better than the other programs. And Suitcase has caused very few problems on my system. Thanks for the heads up on this release. I'll definitely try it out.\n\nSharon\n\n"
    },
    {
      "time": "22 Feb 2007 — 12:58pm",
      "content": "_~I missed this topic when it was posted and had started a new post, but don't worry I redirected everyone to this post as soon as I found it. ( [http://typophile.com/node/31697](http://web.archive.org/web/20131017095615/http:/typophile.com/node/31697 \"http://typophile.com/node/31697\"))~_\n\nMy set up is a \"single-user system where I am the local administrator\" and I don't expect that to change anytime in the future. Why would I need to upgrade to a server-based solution? Are there any other MAJOR additions other than Font Sense and support for multiple/server-based users?\n\nBluntly, is there any reason to drop $50 on the upgrade?\n\n"
    },
    {
      "time": "22 Feb 2007 — 2:47pm",
      "content": "I'm going to give the 30-trial a shot, but one of the main irritations I forsee is that there doesn't seem to be a way to preview a font's entire character set in Suitcase 11, and this is more or less possible in FontExpert.\n\n"
    },
    {
      "time": "22 Feb 2007 — 3:44pm",
      "content": "I have Suitcase 9.2 and am trying 11 on an XP machine. It is totally superior to the 9.2 version. Wicked fast. I wish it had a character map also. That's its one drawback to me. I'm going to try the new Font Expert version when it comes out.\n\nI am impressed with this new Suitcase version.\n\nSharon\n\n"
    },
    {
      "time": "23 Feb 2007 — 6:02am",
      "content": "<cite> I forsee is that there doesn’t seem to be a way to preview a font’s entire character set </cite>\n\nJust installed the demo, if you look under the preferences, you can change the preview text for Waterfall, ABC 123 and Paragraph, I guess technically you could put all the characters you want there for previewing.\n\nWhat I don't see is an Attributes feature, like in Suitcase Fusion. That would have been a nice additive.\n\n"
    },
    {
      "time": "23 Feb 2007 — 12:01pm",
      "content": "I suppose you're right, but for a face like, say, Fedra Pro, it would be a royal pain to compile a glyph list (over 2,000 glyphs), and even then other fonts might include additional ornaments, alternates, etc., and thus creating a full character set list for any and all fonts would be mind-numbing. Having said that, I can see the work it would take to implement such a preview option into the font manager, but that's no reason not to expect/request such a feature.\n\nFontExpert has a long list of available character set preview options, but even here there is no option for seeing everything at once. Depending on how the font was encoded, for example, you may or may not see the small caps when you select \"All Defined Characters\" from the top of the Character Table viewing list.\n\n"
    },
    {
      "time": "23 Feb 2007 — 1:14pm",
      "content": "Currently Suitcase has four ways of previewing a font: Waterfall, ABC 123, Paragraph and Quicktype. Quicktype is what I use the most because I often have a word or phrase that I want to see displayed in the font I'm going to use.\n\nThat said, for type designers or other power users, it would be very useful to see the full contents of the font enumerated. What would be different about this sort of view is that, for performance reasons, it would probably be better to view only once face at a time. Rather than scrolling through several selected fonts, the view pane would have to allow the user to scroll through one selected font. It would be nice to quickly compare say, Helvetica and Helvetica World, for example.\n\nType designers would benefit from a feature like this because it would make it easier for font users to access advanced features. If end users have an easy way to use ornaments and alternates, they are more likely to see the value in purchasing high-quality fonts.\n\n"
    },
    {
      "time": "23 Feb 2007 — 3:01pm",
      "content": "Exactly. That's the one feature that's missing. Otherwise, I think this version is outstanding. I wouldn't mind a good standalone font viewer to use just for that purpose. To use in conjunction with Suitcase.\n\nSharon\n\n"
    },
    {
      "time": "23 Feb 2007 — 5:52pm",
      "content": "I'm keen on Suitcase, it has a strong history. But, I'm still not seeing the benefits of the newest version. What am I spending $50 bucks on? I don't use Vista, being able to print samples out isn't a huge necessity, I don't have a server-client font set-up and I'm not exactly sure what FontSense actually does or it's plug-ins (I've always let Adobe tell me what fonts were missing, and then I'd activate them manually.)\n\nWhere's the Attributes feature? I like Sets, but I'd like it even more if I could add Tags too them. Where's the Character Maps? This seems to be the biggest missing piece for a lot of us PC-based font fiends.\n\nIt just feels like Extensis doesn't really value the needs of us PC designers as much as they do the MAC designers.\n\n"
    },
    {
      "time": "23 Feb 2007 — 6:24pm",
      "content": "I too am not sure whether Suitcase V11 is worth the upgrade price. Especially since I just bought V9.2 (Windowz) the first of the month. I work mainly on technical documentation and use FrameMaker so the auto-sense is of no use. Also, since I'm the lone writer on this project right now there's little reason to put much value in the clinet capabilities.\n\n"
    },
    {
      "time": "24 Feb 2007 — 6:25pm",
      "content": "I've said it before and I'll say it again, Proxima's FontExpert is a very viable option. The auto-activation (InDesign CS2 only) is a bit clunky, and there's a lag in opening the program, but the organizational options and, in particular, the preview options (various encodings) are really quite good. I don't mean to sound like a salesman, but I've been curious to watch the odd loyalty to Suitcase (I felt it too for some strange reason) despite the fact that many of us were never all that impressed by it to begin with.\n\nAlso, as for Vista, Proxima just released (today, Feb 24) a [new version](http://web.archive.org/web/20131017095615/http:/www.proximasoftware.com/fontexpert/releasenotes.htm) (8.4) which appears to be fully Vista-ready.\n\n"
    },
    {
      "time": "24 Feb 2007 — 7:06pm",
      "content": "Ah, I've been waiting for the new version. I liked FontExpert 2006 that I demoed alot. I'm just trying the new Suitcase and I like how fast it runs but not much else. Thanks for the news on the the latest Font Expert, Jason.\n\n"
    },
    {
      "time": "4 Mar 2007 — 6:19am",
      "content": "(this being a continuation of the question I axed at TypeCon....last year....)\n\nDoes anybody yet make a VIsta font management tool that allows the user to delete the fonts they and their script (will) never use?, regardless of the Vista permissions and the soon to be famous \"Try Again\" buttton? which make such manual managment difficult...Or is it intended that the average user be gurggling in type?\n\n"
    },
    {
      "time": "14 May 2010 — 1:22am",
      "content": "High-Logic's MainType is really nice. I have trialled all the other Windows options and MainType is by far the best. It's fast and easy to use, but very powerful.  \nThe main thing I like about it is that it doesn't try to 'organise' your fonts for you. If your fonts are already organised how you like, it will work with this.  \nYou can browse your active fonts or fonts in folders elsewhere on your computer. You get to see a sample preview which you can easily type over or revert to a number of presets, plus a full character map. You also get a choice between activating and permanently installing fonts.  \nHope this helps.  \nbtw I don't work for them, just seems that people have a lot of trouble finding decent, stable font managers for Windows!\n\n"
    }
  ]
}
