{
  "id": "30649",
  "title": "Tax logo from 1968 needs revamp",
  "forum": "Design",
  "tags": [

  ],
  "content": " ![](http://web.archive.org/web/20091217075000im_/http:/typophile.com/files/20070116_0001_5450.jpg)\n\nThis, my friends, is the loverly logo designed for my Grandma’s Tax company back in 1968. She would like to update it, but still retain a sense of the longevity of the company and the logo.\n\nHer new typeface for correspondence, etc., is Garamond Premier Pro.\n\nAny suggestions?\n\n",
  "author": "<a href=\"/web/20091217075000/http://typophile.com/user/12948\" title=\"View user profile.\">DanGayle</a>",
  "time": "<br>",
  "uid": "12948",
  "comments": [
    {
      "time": " 16.Jan.2007 11.10am",
      "content": "Headline MT Bold\n\nGothic RR\n\n"
    },
    {
      "time": " 16.Jan.2007 12.08pm",
      "content": "What about [Optima](http://web.archive.org/web/20091217075000/http:/www.adobe.com/type/browser/P/P_1245.html?newsample=Quality+Tax+Service&=View)\n\n"
    },
    {
      "time": " 16.Jan.2007 2.07pm",
      "content": "[x] check here to donate $1.25 to the redesign of Dan-Ma’s logo.\n\n"
    },
    {
      "time": " 16.Jan.2007 5.09pm",
      "content": "Hmm. US$1.25 for Dan’s gran, or 30 quid for St. Luke’s.\n\nUmmm, sorry Dan! ;-)\n\n"
    },
    {
      "time": " 17.Jan.2007 1.58am",
      "content": "A buck and a quarter would get me on the bus to my grandma’s office! That would be so sweet.\n\n"
    },
    {
      "time": " 17.Jan.2007 2.04am",
      "content": "I’m thinking of scrapping the whole thing. (The old design.)  \nI’d like to keep the Univers or whatever, but it just don’t jive with Garamond like I want it to.\n\nDo you think that creating initial caps and re-setting the text in the same format with Garamond would work? I’ll pop it into Illustrator to check it out...\n\n"
    },
    {
      "time": " 17.Jan.2007 9.32am",
      "content": "I guess I’m totally in the minority, but I think the old logo is kind of cool in a major retro way. I would see if I could go with that, ignoring the Garamond completely to start with.\n\nOf course, it needs to be reworked a bit. :-)\n\nSharon\n\n"
    },
    {
      "time": " 17.Jan.2007 6.21pm",
      "content": "We all know that accountants work with numbers ... consider using whatever you think numbers live best in – serif or sans, and go from there. Also consider that this logo is, in my opinion, next to timeless; don’t disregard that. And maybe that is what should dictate everything else, thus all faces should be modern/sans.\n\n"
    },
    {
      "time": " 17.Jan.2007 11.41pm",
      "content": "How’s this? Her current bidness card uses Pantone 185, but is some gawd awful piece of poo. The old logo was only on envelopes and some stationary.\n\n ![](http://web.archive.org/web/20091217075000im_/http:/typophile.com/files/qualtax_3841.gif)\n\nI’m thinking of Egyptienne F for body copy in her correspondence because of its obvious link to Univers.\n\n"
    },
    {
      "time": " 18.Jan.2007 2.38am",
      "content": "Tax needs to move to the right and Quality to the left, only slightly in both cases.\n\nTim\n\n"
    },
    {
      "time": " 19.Jan.2007 10.26pm",
      "content": "Yes, the stem of the “T” should be centered with the aperature of the “Q”  \nI agree with pearlstreet and grayson that the logo isn’t really so bad. You should scan the thing, move some of the letterforms around a bit to get a solid alignment, make the boxes a little smaller on the x axis and ad color to the “QTS” characters.\n\nTyler  \nCIRCE house DESIGN\n\n"
    },
    {
      "time": " 19.Jan.2007 10.34pm",
      "content": "I’m still partial to the original ... by quite a bit.\n\n"
    },
    {
      "time": " 20.Jan.2007 12.33am",
      "content": "Wasn’t paying attention to the alignment there. Thanks for catching that. I want to open things up by removing the boxes, but it seems that you guys think they’re ok?\n\n ![](http://web.archive.org/web/20091217075000im_/http:/typophile.com/files/qualtax_5223.png)\n\n"
    },
    {
      "time": " 20.Jan.2007 2.29pm",
      "content": "Does your grandmother use QTS or Quality Tax Service?\n\nI think the boxes are interesting in a tax-form kind of way but there’s nothing wrong with letting go of the old design. It just appealed to me. I thought the boxes helped align the letters. Here’s a version using Ketchupa which I recently licensed.\n\n ![](http://web.archive.org/web/20091217075000im_/http:/typophile.com/files/qts_5948.jpg)\n\nI rarely post here, mostly just read, but the old logo really appealed to me. Thanks for posting it. It may not work anymore for your grandmother but I enjoyed seeing it.\n\nSharon\n\n"
    },
    {
      "time": " 20.Jan.2007 4.11pm",
      "content": "I like both the boxes and your choice of font and colour — would look great with the Garamond as well for text.\n\n"
    },
    {
      "time": " 20.Jan.2007 6.43pm",
      "content": "Thanks, Linda!\n\n"
    },
    {
      "time": " 31.Jan.2007 1.19pm",
      "content": "Thanks for all of your help guys. Here’s the stuff that I finished.  \n [Quality Tax Service Identification Materials](http://web.archive.org/web/20091217075000/http:/www.geocities.com/nearborn/qts/qualtax.html)\n\nLet me know what you think. It hasn’t yet gone to the printer, so I might be able to make last minute changes.\n\nThanks!\n\n"
    },
    {
      "time": " 31.Jan.2007 2.02pm",
      "content": "Nice, consistent feel, Dan. Your gran should be proud. ;-)\n\n"
    }
  ]
}
