{
  "id": "30659",
  "title": "(x) \"Masculin Feminin\" French film (Jean Luc Godard) - Neuzeit Grotesk {Erik S}",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "There was a post by 'ktz' back in October I found in the archives about this font. I watched the film the other night and loved the typeface too. The sample ktz found did look hand drawn - but I think there must be a mechanical version, check out the attached sample I came accross. Can anyone have another go at identifying this for us?\n\ncheers,\n\nDom\n\n",
  "author": "Dominic Forde",
  "time": "16 Jan 2007 — 4:26pm",
  "uid": "8711",
  "comments": [
    {
      "time": "16 Jan 2007 — 4:27pm",
      "content": "I don't see the sample.\n\n- Lex\n\n"
    },
    {
      "time": "16 Jan 2007 — 4:28pm",
      "content": "Here is the attachment\n\n ![](http://web.archive.org/web/20150302160329im_/http:/typophile.com/files/Godard_5463.jpg)\n\n"
    },
    {
      "time": "16 Jan 2007 — 4:35pm",
      "content": "Upon first glance, I'd say it's a custom Futura (based on the A, U, L, N, F, E, T, and R) but the S is closer to a grotesk than a geometric, and the M just looks strange.\n\n- Lex\n\n"
    },
    {
      "time": "16 Jan 2007 — 4:42pm",
      "content": "Thanks Lex. The M is my favourite character. Not so sure about the dot on the letter i mind you. I still think it might be a font as opposed to a basterdised version of Futura since it was probably made in the 60's and I wouldn't have thought they'd muck about with existing fonts in those days as much as people to today.\n\n"
    },
    {
      "time": "16 Jan 2007 — 5:04pm",
      "content": "The [Bande à part](http://web.archive.org/web/20150302160329/http:/www.flickr.com/photos/stewf/244827394/in/set-72157594286837940/) titles are also interesting.\n\n"
    },
    {
      "time": "16 Jan 2007 — 5:04pm",
      "content": "No, I dig the wilfulness of the I and the wrongness of the M, I love this.\n\nI really doubt it is futura, to me the L and the E look too condensed, the S is different, the C is different, the numerals don't work either, I wonder why you'd change a font this much when it wouldn't seem like too much trouble to produce your own.\n\nI really like this, did I say that already?\n\n--N\n\n"
    },
    {
      "time": "16 Jan 2007 — 5:24pm",
      "content": "Yeah, the numerals really stood out in the film as being pretty special. Thanks for link to Bande à part Stephen. Maybe he collaborated consistently with a specific typographer, they kind of feel like they were designed by the same person?\n\nDom\n\n"
    },
    {
      "time": "16 Jan 2007 — 6:45pm",
      "content": "That is a slightly customized (the M) [Neuzeit Grotesk](http://web.archive.org/web/20150302160329/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=UR.116135.0.0&attributes.sampleSize=48&sampleText=MASCULIN+FEMININ&sampleSize=32), probably the Black weight from URW.  \nThere used to be a Berthold BQ version, but that doesn’t seem to be available anymore, not even from _you know who_.\n\n"
    },
    {
      "time": "16 Jan 2007 — 7:11pm",
      "content": "I think the Mann got it. It's just right, down to the numerals. All you need to do is snip the 'M' and add a dot to the cap 'I's.\n\n"
    },
    {
      "time": "16 Jan 2007 — 7:29pm",
      "content": "Wow thanks guys, Love yer work Erik!\n\nDom\n\n"
    },
    {
      "time": "16 Jan 2007 — 11:01pm",
      "content": "\\<Wayne\\>We're not worthy. We're not worthy.\\</Wayne\\>\n\n- Lex\n\n"
    },
    {
      "time": "22 Nov 2009 — 8:00am",
      "content": "what about the Q guys?\n\n[http://typophile.com/node/64578](http://web.archive.org/web/20150302160329/http:/typophile.com/node/64578 \"http://typophile.com/node/64578\")\n\n///\n\n"
    },
    {
      "time": "22 Nov 2009 — 8:42am",
      "content": "What have they done to one of my favourite faces.\n\nThat M and dotted upper case I is just strange as Lex puts it.\n\n"
    },
    {
      "time": "30 Nov 2011 — 7:53am",
      "content": "jeez, talk about WAY late to this conversation — wish I had known earlier!\n\nThis typeface was actually completely hand-drawn, though, may have been based off of another typeface from the era. That being said, I haven't been able to find any evidence that it was nor have I been able to find any evidence as to who actually did draw this typeface for the film. Going out on a limb, thus far my guess is that it was either Godard's editor Agnes Guillemot, some random, uncredited genius, or Godard himself (which I'm not discounting).\n\nI'm actually in the midst of creating a typeface inspired by the these titles in masculin-feminin (in my free time, so it is taking a while). During my research, I found out that Godard was actually the nephew of Maximilien Vox—who was still alive during the production of these films, so perhaps he played a role as well. I got in touch with Godard's production company in search of the truth, but have yet to hear back....but will keep trying.\n\nAttached an images from my typeface that is in the works...hopefully coming sooner rather than later!\n\n ![](http://web.archive.org/web/20150302160329im_/http:/typophile.com/files/agnes_5_4626.gif)\n\n"
    },
    {
      "time": "30 Nov 2011 — 10:35am",
      "content": "See also: [Jean-Luc Typeface](http://web.archive.org/web/20150302160329/http:/www.carvalho-bernau.com/retailfonts/jean-luc/) by Carvalho and Bernau.\n\n"
    },
    {
      "time": "30 Nov 2011 — 10:44am",
      "content": "yeah, I saw that when it was released—heartbroken of course that someone had completed it before I (it is a great typeface though!). Lucky for me, they were inspired by a different film!\n\n"
    },
    {
      "time": "1 Dec 2011 — 4:23am",
      "content": "Oh yeah, don't let it stop you. Still a very different design.\n\n"
    }
  ]
}
