{
  "id": "30661",
  "title": "HELP! Legal Commercial font usage, design and redisign is so COMPLICATED!",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello there everybody! This is my first post - EVER - on any forum. I am so confused by this issue that I have finally reached out to the forum audience for your knowledge.  \nMy questions are these and the explanations are found below.\n\n1. How does a graphic designer know they are fully legal in creating, manipulating, changing fonts for commercial use (by both the client and the designer)?\n\n2. Where does a budding graphic designer begin in regards to fonts and typefaces?\n\n3. Do you buy a font library and also expect the client to purchase the licenses to the manipulated fonts (in the case of font or type face manipulation- if that is indeed somehow fully legal)?\n\n4. Are the fonts on my computer off limits for commercial usage? (they come from everywhere, from adobe through teh internet and pre-installed- yes I do know they all have some sort of license but please explain them).\n\n5. Is the only 100% safe way to get use a font for commercial products is to design one yourself from scratch using a font editor program like Fontlab, Type tool or Fontographer?\n\n6. What does it take to be legal in regards to fonts? Like to make a simple type only business card using non-manipulated stock fonts. Do I need the license, do both the client and I need the license?\n\n7. Some font licenses say that the font can be used commercial but they want the credit...how do you give them credit on a business card or letterhead etc? Do you have to give them credit on the objects, or is it shelved in a drawer somewhere just for legal sake and no one ever asks to see it?\n\n8. I understand that there is much debate about font legality issues in the US. These designs might go international...do I have any additional worries?\n\n9. Can a person use \"found images\" in their font design? Like what if I scanned in an illuminated antique book from 200 years ago...is that typeface still protected and I can't legally use it after I scan it, streamline it and pop it into an editor?\n\nHere is my dilemma.\n\nI have my first two commercial clients that are requesting logo design. Before I start working on the projects, I want to know the legal issues regarding fonts and type faces. All the information I read seems very complex and convoluted.\n\nIt seems that if I manipulate a font using any of my software, that somewhere in the sceme of commercial usage (whether that is me making money by selling the design, or the client using the logo and it becomes popular and the original font creator goe after them and they both go after me).\n\nI want to be legal and have nothing to worry about. I have the idea for both designs, I have all the information I need to proceed - but the legal end of fonts and typefaces is the scary part. Now that I am going beyond term papers and school projects- are the fonts on my computer\n\n",
  "author": "IP",
  "time": "16 Jan 2007 — 6:35pm",
  "uid": "16311",
  "comments": [
    {
      "time": "16 Jan 2007 — 6:36pm",
      "content": "Oops I didn't finish my sentence. It should read:\n\nAre the fonts on my computer off limits for commercial usage?\n\n"
    },
    {
      "time": "16 Jan 2007 — 8:27pm",
      "content": "Welcome! I don't know nearly as much as others on the forum about licensing issues, but I'll start you off. Generally, the best way to know what you can and can't do with a font is to read the EULA (End User License Agreement) for it. They vary considerably, but there are several commonalities. First, they tend to be for a certain number of licenses, which are often defined either as one license per computer or one license per user. Some type foundries sell their fonts in groups of licensed users, such as 1-5, 6-10, and 11-25 licenses.\n\nMy understanding is that a license should be bought by every user using the fonts involved; so if, for example, you were branding a company and suggesting that they use Gotham on all their corporate communications, each person (or computer) using Gotham would need a license. But, if you are designing a logo using Gotham and by doing so, each person using the logo (to create a website, stationary, etc.) does not need to have the font installed to employ your design, then only you need a license for it. So, for example, Google, which uses Berthold Catull for its logo, needed to buy one license at least of the font to design the logo, but each person in the company using the logo did not need a license.\n\nHowever, certain foundries do have restrictions on how their fonts can be used. An unfortunate restriction may be that the fonts may not be embedded (say, in a PDF) or must be displayed below a certain resolution. However, in print, all fonts should be fair game for use. Again, this varies significantly depending on the foundry.\n\nThe best single advice you can be given regarding this issue is when in doubt, contact the foundry. Most are quite prompt in responding, and they will be more than happy to clue you in to the exact details of the license agreement.\n\nNow, I'll try to answer a few of your specific questions.\n\n1. Read the EULA of any font you buy to see what you can and can't do.\n\n2. Check out the [Triumvirate](http://web.archive.org/web/20150223075747/http:/typophile.com/wiki/Triumvirate) for a terrific intro to the world of typography.\n\n3. You need to buy the fonts that you are using the create the design. But the client only needs to buy them if they are still \"live,\" that is, if the client needs the fonts installed on their computer to use the design.\n\n4. The fonts on your computer are all correctly licensed to you, but again, the licenses vary. For the most part, my understanding is that the fonts that come with your operating system can be used largely with impunity. Adobe's fonts are supposed to be able to be used in any appplication, but I'm not sure of that. This does _not_ mean that you can give someone the fonts you already have on your computer; they must buy a license if they want to use them \"live,\" as previously mentioned.\n\n5. Designing a font yourself is 100% safe -- you decide how licensing works, if you create any. But following EULAs should keep you out of trouble with other people's fonts (and it's a lot easier).\n\n6. For a business card, only you need the fonts.\n\n7. I'm not quite sure about the giving credit thing -- sounds like it depends on the particular request of the foundry. I'd think that saying the fonts' names and sources on your or the client's website would do the trick. I probably would find fonts that wouldn't require it.\n\n8. I think that EULAs are largely international. Font design copyrights and their existence are not, but that's a whole 'nother matter.\n\n9. A typeface used in print, according to U.S. law, is not copyrightable. Anyone can scan in any design and trace it in FontLab and sell it as their own. But digital fonts, as software made up of Bezier curves and code, are copyrightable, so you cannot resell a digitized font.\n\nI'm sure that I got several things wrong, but I hope that I get you started on the right foot. Generally, try to relax -- type foundries aren't out there to get you. As long as you try to respect their license agreements, not doing things like giving your client free copies of fonts, you should be fine. Hopefully once you understand the licensing process well enough, you can get into the addictive fun that is good typography.\n\n"
    }
  ]
}
