{
  "id": "30700",
  "title": "Best fonts of 2006 for MyFonts",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "\"With each new year, we reflect on the great fonts that appeared on MyFonts during the previous year. In this newsletter we present to you the best fonts from the top ten font design styles of 2006: best text font, retro font, ornament font, techno, Roman, formal script, handwriting, brush script, grunge, and calligraphic fonts. To keep things fair, we let you—the customer—be the ultimate judge of results by using sales numbers to decide each winner. Thank you for putting together such a nice list!\"\n\n[http://www.myfonts.com/newsletters/sp/200701.html](http://web.archive.org/web/20120927043448/http:/www.myfonts.com/newsletters/sp/200701.html \"http://www.myfonts.com/newsletters/sp/200701.html\")\n\n",
  "author": "dstype",
  "time": "18 Jan 2007 — 3:06am",
  "uid": "9946",
  "comments": [
    {
      "time": "18 Jan 2007 — 5:44am",
      "content": "Is it typophile heresy to say that I didn't really like any of those ten fonts that well, and that some of them struck me as just plain ugly?\n\n"
    },
    {
      "time": "18 Jan 2007 — 6:20am",
      "content": "No, is not heresy!  \nI post this because I believe that we can discuss everything related to type, and I just want to know what everybody thinks of choosing the best typefaces using the sales numbers.\n\nDino\n\n"
    },
    {
      "time": "18 Jan 2007 — 6:37am",
      "content": "I am amazed there are enough people buying grunge fonts for myfonts to bother including it as a category, but I suppose the same could be said of techno fonts. Still, congratulations to you Dino (and Paul), sales figures seem as fair as any statistical analysis (most viewed or most linked to or whatever) could be.  \nAlex, which ones do you find ugly?\n\nTim\n\n"
    },
    {
      "time": "18 Jan 2007 — 7:30am",
      "content": "Not a single workhorse text font in the bunch with the possible exception of Camingo, a sans (and the ONLY one I'd buy). I guess script fonts must sell well, but Swansong...???\n\nI have a \"grunge\" category in FontExplorer but rarely open it.\n\n"
    },
    {
      "time": "18 Jan 2007 — 7:50am",
      "content": "That also amazed me! Not even one single serif typeface, suitable for text, with great italics, and so on. But if you check MyFonts best sellers you won't see many of them. I think the designers only buy typefaces for display use and they maybe still use Garamond or Times to set text.\n\n"
    },
    {
      "time": "18 Jan 2007 — 7:57am",
      "content": "Times for text? I don't think so. I think the script etc fonts sell better because they're cheaper, one-offs usually, and often bought by non-designers for special projects. Text fonts are an investment so less frequently purchased perhaps.\n\n"
    },
    {
      "time": "18 Jan 2007 — 7:58am",
      "content": "This is like any list based on stats, it shows what's popular, not really what's \"Best,\" (even though the title states differently). Look at what's popular in music, a lot of garbage, and the real gems get discovered only by those in the know. I designed Zaner 1) because I loved the style and thought it deserved reviving in digital format and 2) because I thought it would sell well, as the masses buy scripts. I don't think the masses care as much about workhorse text faces, unfortunately. Welcome to the market economy.  \nAll said, it's an honor to be included in this list, even if it is a bit of a popularity contest, and thank you, Tim, for the congrats.\n\n"
    },
    {
      "time": "18 Jan 2007 — 8:04am",
      "content": "Right in the spot Paul, and congrats.\n\n"
    },
    {
      "time": "18 Jan 2007 — 8:33am",
      "content": "Paul - Zaner is lovely.\n\n"
    },
    {
      "time": "18 Jan 2007 — 8:41am",
      "content": "Paul: Congrats to you (and P22) for being part of the list!\n\nPatty: Zaner is crazy gorgeous and I'd love to see it letterpress printed because I think it would really shine.\n\n"
    },
    {
      "time": "18 Jan 2007 — 8:50am",
      "content": "Great job, Paul; congratulations on your success--and many happy returns!\n\n"
    },
    {
      "time": "18 Jan 2007 — 9:45am",
      "content": "I like a lot of them -- but grunge? Isn't that a bit dated anymore?\n\n"
    },
    {
      "time": "18 Jan 2007 — 9:52am",
      "content": "_grunge? Isn’t that a bit dated anymore?_\n\nYou can find grunge fonts on many Best Seller lists. Currently 4 (you could consider more grunge) on Myfonts top 50 and 1 in Veer's listing of what's hot.\n\n"
    },
    {
      "time": "18 Jan 2007 — 10:12am",
      "content": "I think this is a reflection of MyFonts' market position. It's the populist type site, presenting itself more to casual users than learned designers. Anyone not well versed in typography is going to take more to the overt uniqueness of a display face than the subtleties in design and craftsmanship of a great text face. (Just went through this advising my old college newspaper on their redesign... tried to explain why Adobe Jenson is not the best choice for a newspaper.) Plus, non-designers tend to think more in terms of individual elements than the whole picture, meaning they may see more conservative text fonts as boring, while designers visualize the same font in context as rich and expressive. I'm sure that if you looked at other resellers, they'd have totally different bestsellers.\n\n"
    },
    {
      "time": "18 Jan 2007 — 10:37am",
      "content": "Congrats to the folk at Myfonts for another banner year.  \nBut best-seller = best?  \nTreat yourselves to a Big Mac :-)\n\n"
    },
    {
      "time": "18 Jan 2007 — 10:47am",
      "content": "Colin, Myfonts has a multiple personality. As part of being e-populist, it is an exemplary Long Tail company, meaning that most of its sales come from most of its products, not the few best sellers. So on the one hand, it hypes its big hits in the de rigueur dumbarse manner, but at the same time it makes a huge quantity of fonts from hundreds of foundries available. There's quality there, of all kinds, to satisfy typographers with the most exquisitely recondite taste.\n\nMyfonts also has some of the best (and no doubt most used) font info and font previewing mechanisms around, for its savvy clientelle.\n\n"
    },
    {
      "time": "18 Jan 2007 — 10:50am",
      "content": "Because Tim asked...\n\nUgly: Korataki, DearJoe4, Boycott. (In general I'm not that keen on Larabie's work, ubiquitous as it may be, so Korataki is maybe a victim of my bias. Dear Joe just does nothing for me. Boycott is just...well, let's say I'll boycott it.)\n\nThe others I'm not keen on, but to each their own, I suppose. Camingo and Cyan are nice enough, and Estilo Script is well done, but totally not my style. Zaner is a little too swooshy for me.\n\n(And remember I'm not a professional type designer or graphic artist so my opinions may be woefully uninformed! My opinions plus $1.25 will get you a small coffee at Tim Hortons...)\n\n"
    },
    {
      "time": "18 Jan 2007 — 10:52am",
      "content": "Here's the list from Fontshop. This is the current list, not the 2006 list but yeah, it does show a different emphasis. Only one script, no grunge, but lots of \"tech\"\n\n01 FF Maiola  \nby FontFont  \n02 Adobe Wood Type 3  \nby Creative Alliance  \n03 Neo Sans  \nby Creative Alliance  \n04 Zingha  \nby Font Bureau  \n05 Freight Micro  \nby GarageFonts  \n06 Freight Sans  \nby GarageFonts  \n07 Freight Text  \nby GarageFonts  \n08 Vista Sans Package One  \nby Emigre  \n09 Cezanne Pro OT  \nby P22 type foundry  \n10 FF Cocon  \nby FontFont\n\n"
    },
    {
      "time": "18 Jan 2007 — 11:06am",
      "content": "I'm sort of amazed that anybody still pays for grunge fonts. If the whole point of the font is to look like crap, why pay for a “good” one? Buying Badhouse would at least make a little sense if you're in TV/Movies and just riding the trend, but are the commercial grunge faces really better?\n\n"
    },
    {
      "time": "18 Jan 2007 — 11:18am",
      "content": "I was thinking that grunge is used a lot on \"extreme' sports and branding etc. The stuff that all the kids with their 80's gothpunk retro shit clothes are in to to!\n\nMuzz\n\n"
    },
    {
      "time": "18 Jan 2007 — 1:35pm",
      "content": "Dear MyFonts: What about a Monospaced category for 2007?\n\nThanks!\n\n"
    },
    {
      "time": "18 Jan 2007 — 1:41pm",
      "content": "Patty - That list is slightly \"massaged\" every few weeks to indicate the recently popular products. If we showed true bestsellers, the list would rarely change, perpetually showing the Helveticas and FF Metas.\n\nTo Colin's point, I can confirm that our regular bestsellers are more often workhorse text faces than scripts and display.\n\n"
    },
    {
      "time": "18 Jan 2007 — 5:44pm",
      "content": "_Helveticas and FF Metas_  \nEven if you don’t read German, you should check out the list of the 10 best typefaces on [www.fontblog.de](http://web.archive.org/web/20120927043448/http:/www.fontblog.de/ \"www.fontblog.de\"). FF Meta is not among the top ten, just the top twenty. But Officina came in at 8.\n\n"
    },
    {
      "time": "18 Jan 2007 — 6:48pm",
      "content": "Best fonts of 2006 -- in Russia? anyone?\n\n"
    },
    {
      "time": "18 Jan 2007 — 6:54pm",
      "content": "Just for reference:  \n [FAQ Best Selling Fonts](http://web.archive.org/web/20120927043448/http:/typophile.com/wiki/FAQ%20Best%20Selling%20Fonts)\n\n"
    },
    {
      "time": "18 Jan 2007 — 8:25pm",
      "content": "_If the whole point of the font is to look like crap..._\n\nBut that doesn't mean they have to be _made_ like crap, i.e. designed or drawn badly. Also, isn't it more accurate to say that many \"grunge\" faces look rough, or weatherbeaten, or distressed? IMO there are good and bad ways of doing this, as with any other type style.\n\nAlso, speaking of grunge fonts, Rian Hughes of Device recently unveiled [a whole mess of new grunge fonts](http://web.archive.org/web/20120927043448/http:/67.59.169.170/cgi-bin/device2.cgi?action=fonts&section=browse&font=0&filter=new)... and he's on MyFonts, too.\n\n[Insert graffiti tag that says \"Grunge Not Dead!\" here.] ;-D\n\n"
    },
    {
      "time": "18 Jan 2007 — 9:12pm",
      "content": "I had thought for some time that grunge is a bit of a misnomer because it's a little too all-inclusive. I have an \"Antiquated & Distressed\" category in FontExplorer that is quite different from most grunge fonts. One font I use from time to time is Caslon Antique, it looks slightly weathered/distressed to my eyes, but it doesn't strike me as grunge at all.\n\nI think part of why grunge fonts are so popular is that they are a quick means of getting some personality/attitude in a project for those not having the talent or time to do it by hand (or mouse).\n\nNot that I'm always thrilled to use them, but some customers of mine are really hot on them so I can't avoid them entirely. Most of the time I can take an existing \"normal\" font and add my own \"grunge\" to it, generally the results are better, I have more control, it's a compromise I can live with.\n\n"
    },
    {
      "time": "19 Jan 2007 — 8:28am",
      "content": "interesting, if you DO consider Caslon Antique, Pabst, Powell, Plymouth,and a whole slew of other \"antiqued\" designs that originated in METAL to be grunge, the genre has been around for a long time, and i'm sure will continue to exist as long as there is type.\n\n"
    },
    {
      "time": "19 Jan 2007 — 8:46am",
      "content": "I have separate categories in FontExplorer for Antiqued/Distressed and Grunge. To me those are fairly distinct in terms of how I'd use them. I rarely use the Grunge fonts.\n\n"
    },
    {
      "time": "19 Jan 2007 — 9:01am",
      "content": "I think that there are obvious differences between distressed type, type that looks like it was printed hundreds of years ago, and grunge. I can really dig the first two, but to me grunge still just looks gross, no matter how much thought and craft went into designing it. I think of grunge type as the type that came out of the 1990s rock music scene, stuff that's really been manipulated to just look dirty and ugly. It was certainly appropriate for that context—most of the music was commercial crap that sounded dirty and ugly, as was much of the music journalism—but now I just wish that grunge type would disappear like the bands of that era did.\n\n<cite>I think part of why grunge fonts are so popular is that they are a quick means of getting some personality/attitude in a project for those not having the talent or time to do it by hand (or mouse).</cite>\n\nI see a lot of that. A designer hasn't got a good idea, or doesn't want to put time into something, so she just slaps a nice photo on a page and sets the type in Guilty at a precarious angle. Two hours later she's trying to pass the design the design off as dynamic and edgy.\n\n"
    },
    {
      "time": "19 Jan 2007 — 10:27am",
      "content": "For some truly egregious grunge check out the new New School logo...\n\n[http://www.businessweek.com/innovate/content/aug2005/id20050830\\_313230.htm](http://web.archive.org/web/20120927043448/http:/www.businessweek.com/innovate/content/aug2005/id20050830_313230.htm \"http://www.businessweek.com/innovate/content/aug2005/id20050830\\_313230.htm\")\n\n"
    },
    {
      "time": "19 Jan 2007 — 11:27am",
      "content": "Wow, that is one crappy logo. It can't be that easy to come up with a logo that can contain the phrase “The New School: A University” and not look stupid, but combining tired corporate branding ideas with grunge type is pretty high up on the list of worst possible solutions. It's worse than that embarrassingly inauthentic graffiti campaign that just embarrassed Sony, but not as bad as McDonald's trying to appropriate hip-hop slang.\n\n"
    },
    {
      "time": "19 Jan 2007 — 12:08pm",
      "content": "\\> Just for reference:\n\nThanks.\n\nI know that Officina Cyrillic is one of the most popular sans.\n\n"
    },
    {
      "time": "19 Jan 2007 — 12:13pm",
      "content": "_I know that Officina Cyrillic is one of the most popular sans_  \nYes, according to my license reports, there have been twelve sales since 1996.\n\n"
    },
    {
      "time": "19 Jan 2007 — 12:19pm",
      "content": "\\> Yes, according to my license reports....\n\nJust fired my source :^)\n\n"
    },
    {
      "time": "19 Jan 2007 — 12:20pm",
      "content": "Paratype chart may be your best bet for Russian best sellers - [http://www.paratype.com/store/bestsellers.asp](http://web.archive.org/web/20120927043448/http:/www.paratype.com/store/bestsellers.asp \"http://www.paratype.com/store/bestsellers.asp\")\n\nThey don't break down sales by script, but I'd guess they are selling more Cyrillic type than most. Having said that Officina is #9.\n\n"
    },
    {
      "time": "19 Jan 2007 — 3:55pm",
      "content": "Ouch.\n\n"
    },
    {
      "time": "19 Jan 2007 — 6:07pm",
      "content": "<cite>interesting, if you DO consider Caslon Antique, Pabst, Powell, Plymouth,and a whole slew of other “antiqued” designs that originated in METAL to be grunge, the genre has been around for a long time, and i’m sure will continue to exist as long as there is type</cite>\n\nI don't consider it grunge, no. Unfortunately there are some who do, which can make keyword searches frustrating when you get returns that don't belong in the results (look at the bottom keyword descriptions):\n\n[http://www.myfonts.com/fonts/grouptype/caslon-antique/](http://web.archive.org/web/20120927043448/http:/www.myfonts.com/fonts/grouptype/caslon-antique/ \"http://www.myfonts.com/fonts/grouptype/caslon-antique/\")\n\nAs far as its age, I was not aware it was quite that old, no, but I knew well enough it was around long before what is (or should be) considered grunge came into being.\n\n"
    },
    {
      "time": "19 Jan 2007 — 6:26pm",
      "content": "_Just fired my source_\n\nThat was supposed to be ironic. The amount of legal licenses in certain markets is not an indicator for its popular usage. In countries that have some awareness of IP, there are probably ten illegitimate copies to one legal one. In other places, that relationship is probably exponential rather than a multiplication.\n\n"
    },
    {
      "time": "19 Jan 2007 — 7:29pm",
      "content": "<cite>In countries that have some awareness of IP, there are probably ten illegitimate copies to one legal one. In other places, that relationship is probably exponential rather than a multiplication.</cite>\n\nHave you noticed any trends among designers to stop creating fonts for these markets as a result of the rampant piracy?\n\n"
    },
    {
      "time": "20 Jan 2007 — 5:53pm",
      "content": "_Have you noticed any trends among designers to stop creating fonts for these markets as a result of the rampant piracy?_  \nNobody is too keen to design Cyrillic versions, but with full-scale Open Type becoming more popular, we’ll have to complete character sets on at least the text families.\n\n"
    },
    {
      "time": "20 Jan 2007 — 9:22pm",
      "content": "\\>Nobody is too keen to design Cyrillic versions,\n\nWith EU expansion Cyrillic will become more important. Arabic will soon follow.\n\n"
    },
    {
      "time": "20 Jan 2007 — 9:47pm",
      "content": "_In countries that have some awareness of IP, there are probably ten illegitimate copies to one legal one. In other places, that relationship is probably exponential rather than a multiplication._\n\nSo, in these other places, for every legitimate copy there are 1^10 illegitimate ones? :^)\n\n"
    },
    {
      "time": "20 Jan 2007 — 11:13pm",
      "content": "_1^10 illegitimate ones?_  \nExponential also includes power of 2 or 3. At any rate, what i am trying to say is that the amount of illegal use of fonts is higher in some countries than others, and not by a small amount.\n\n"
    },
    {
      "time": "25 Jan 2007 — 6:38am",
      "content": "1^10 = 1\n\n"
    }
  ]
}
