{
  "id": "30706",
  "title": "Apple's Pages",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Does anyone have experience using Pages for layout? I only need to work in small relatively simple documents, poems that are 1-3 pages.\n\nIn comparing Pages to InDesign, I am interested in knowing if the algorithms for typesetting would be nearly indentical (at least, for my purposes.) For example, is tracking in either program equally sophisticated?\n\nI gather InDesign's optical spacing would be one major difference between the two programs. Are there any other differences I should know about?\n\nthanks & cheers to all!\n\n",
  "author": "katzenjammer",
  "time": "18 Jan 2007 — 7:18am",
  "uid": "16268",
  "comments": [
    {
      "time": "18 Jan 2007 — 8:12am",
      "content": "\\>I am interested in knowing if the algorithms for typesetting would be nearly indentical (at least, for my purposes.)\n\nwhy not buying an old indesign version {2.0] cheap?\n\n"
    },
    {
      "time": "18 Jan 2007 — 8:23am",
      "content": "InDesign is a more complete solution if you are going to hire a commercial printer to publish your documents.\n\nPages supports most of the things you might want to do in a page layout program, but it is missing certain things. For instance, I don't think it supports bleeds. You could work around this by using a larger page size and setting up your \"real\" page inside that, complete with crop marks and bleeds, but it would mean extra work.\n\nPages supports many of the typographic controls that InDesign does, but it's less robust and some things are somewhat hidden. For instance, to use OpenType features, you have to choose Format \\> Font \\> Show Fonts... and then choose Typography... from the tiny pop-up menu with the gear on it in the lower part of the Font panel.\n\nInDesign has complete \"pre-flighting\" features, can work with spot colors, has more sophisticated typographic controls, etc., etc. It's designed for professionals working with commercial printers and can handle practically anything you can think of. Pages can do a lot, but it's definitely more limited. That's not to say it wouldn't work for you, it just depends on what you need to do.\n\nFinally, if you do use Pages, I would recommend exporting to PDF and send the PDF to the printer. I very much doubt that a commercial printer or service bureau will accept Pages documents.\n\n"
    },
    {
      "time": "18 Jan 2007 — 12:15pm",
      "content": "If all that you're printing at short poems Pages will do nicely.\n\n"
    },
    {
      "time": "28 Jan 2007 — 1:06pm",
      "content": "<cite>In comparing Pages to InDesign, I am interested in knowing if the algorithms for typesetting would be nearly indentical (at least, for my purposes.) For example, is tracking in either program equally sophisticated?</cite>\n\nAFAIK, Pages doesn't have any equivalent to InDesign's paragraph composer, so the algorithms for typesetting differ greatly in terms of line break choices.\n\nCheers,\n\nT\n\n"
    }
  ]
}
