{
  "id": "30717",
  "title": "How do I access the stroked version of Hoefler text?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hoefler text that ships with OS X includes great stroked variants—maybe the engraved version was built-in?—but I'm not sure how to use them without pecking around the glyphs palette. Is there some Opentype feature that lets me use these conveniently?\n\n",
  "author": "blank",
  "time": "18 Jan 2007 — 12:24pm",
  "uid": "14722",
  "comments": [
    {
      "time": "18 Jan 2007 — 8:18pm",
      "content": "hi there:\n\nIn the application that you are working in: press \"apple t\" (that is, the apple button on the keyboard and the letter t at the same time). The window that appears is called the font panel. In the botton left portion of this window is a pulldown menu (it has star looking thingy with a triangle pointed down). Click it and select the typography panel.\n\nThis will open up a seperate window. You now have access to all the typographic features of Hoefler text. This happens to be one of my personal favs so I use it quite a bit. But this is not just the regular version of hoefler text that you can buy...nope... this a special truetype version exclusive to apple. When you type words that require ligatures such as: fig, waffle, affinities etec, the ligatures are automatically put in place.\n\nAnd yes apple did licence the engraved style. I think you have to choose any of the non italic styles and then in the typography panel select engraved text.\n\n[http://www.veer.com/download/pdf/using\\_fonts\\_osx\\_tiger.pdf](http://web.archive.org/web/20150405123409/http:/www.veer.com/download/pdf/using_fonts_osx_tiger.pdf \"http://www.veer.com/download/pdf/using\\_fonts\\_osx\\_tiger.pdf\")\n\nThis document will tell you more about Apples stance on typography (languishing if you ask me). It also shows you an overview of the fonts included with your system.\n\nWhen I first started working with my mac I thought all fonts do these nifty automatic features. Only some of the fonts that come with OSX do this. If you want to buy fonts that do these things look for opentype or even better opentype pro fonts. (standard) Truetype and Postscript fonts don't do anything automatically- even if they do have ligatures or other styles.\n\nhave fun and post back if have more questions,\n\nMikey\n\n"
    },
    {
      "time": "18 Jan 2007 — 9:17pm",
      "content": "All of the above is true - \\*if\\* you're using an AAT application, such as Apple's Pages or Keynote.\n\nHowever, the system version of Hoefler Text is an AAT font, and has no OpenType features, so you can't simply turn on those alternates in OpenType applications such as InDesign, Illustrator, Photoshop and QuarkXPress - you'd have to use the Glyph Palette (in InDesign, Illustrator or QuarkXPress).\n\nSorry,\n\nT\n\n"
    },
    {
      "time": "18 Jan 2007 — 9:44pm",
      "content": "Sigh...AAT.\n\nGuess I'll just have to buy a version of the typeface that's actually useful for typesetting.\n\n"
    }
  ]
}
