{
  "id": "30718",
  "title": "Support your local AIGA office",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "",
  "author": "sativo",
  "time": "18 Jan 2007 — 12:28pm",
  "uid": "2230",
  "comments": [
    {
      "time": "18 Jan 2007 — 12:43pm",
      "content": "Edit: The original title of this thread was something along the lines of  \n_“Does anyone know how to find a good production designer?”_ and started off with:\n\n_“Check this out, I put up a contest, so t speak, on sitepoint.com to find someone to help with banner ad creation for a site that I do some frelance art direction for. Desipite the fairly detailed instructions and feedback that I leave for them, not one comes up with anything that resembles professional work.”_\n\nThe originator of this thread has removed this information for reasons that will be obvious to anyone who reads the responses.\n\n_My original reply starts below._\n\nIf you want great design, hire a great design firm and be willing to pay for great design. Expecting great design from a $300 spec job in the form of an online contest is stupid, cheap, arrogant, and insulting to many professional and student designers.\n\n"
    },
    {
      "time": "18 Jan 2007 — 1:30pm",
      "content": "James is right. You get what you pay for.\n\n"
    },
    {
      "time": "18 Jan 2007 — 1:33pm",
      "content": "Easy.  \nIf you know exactly what to do. Do it yourself.\n\n"
    },
    {
      "time": "18 Jan 2007 — 2:01pm",
      "content": "It's not hard at all to find a good production designer. You're just looking in the wrong place.\n\n"
    },
    {
      "time": "18 Jan 2007 — 2:08pm",
      "content": "you cheap bugger. You get what you pay for. Do you run around town demanding free entrees at restaurants in order to decide where to eat the main? Christ.\n\nMuzz\n\n"
    },
    {
      "time": "18 Jan 2007 — 4:46pm",
      "content": "Consider yourself lucky.\n\nThe kiddies who are participating in your contest haven't seen this site...\n\n[http://www.no-spec.com](http://web.archive.org/web/20131018053521/http:/www.no-spec.com/ \"http://www.no-spec.com\")\n\n"
    },
    {
      "time": "18 Jan 2007 — 7:01pm",
      "content": "ROFL! That's almost as funny as [this job](http://web.archive.org/web/20131018053521/http:/jobbank.gc.ca/ShowJob_en.aspx?OrderNum=2565677&Source=JobPosting&TimeFrame=E7Days&CommGrouping=GAB002&Keyword=progressive&Sources=JobBank&Student=No): scroll to the bottom of the description and check out in \"Other Information\" what you need to include in the cover letter with your resume.\n\n;-)\n\n"
    },
    {
      "time": "18 Jan 2007 — 8:53pm",
      "content": "Hey, Linda, that IS funny -- never seen something like that! But on the other hand maybe they are trying to see if one follows instructions.\n\n"
    },
    {
      "time": "18 Jan 2007 — 9:44pm",
      "content": "I would fail as I can't comprehend the meaning of this...\n\nLanguages: Speak English, Read English, Write English, Not required\n\n"
    },
    {
      "time": "18 Jan 2007 — 10:06pm",
      "content": "Use these guys next time, [www.crapinabox.net](http://web.archive.org/web/20131018053521/http:/www.crapinabox.net/ \"www.crapinabox.net\"), and you'll be able to get three templates for that price!\n\n"
    },
    {
      "time": "18 Jan 2007 — 11:22pm",
      "content": "Oh jeez! Sorry to offend your delicate design sensibilities guys! But get over yourselves. I'm a designer too.. I know that places like this can give real designers a bad rap. But I also know that I've had experiences not too dissimilar from this online contest where I contracted a designer with a relatively decent portfolio who banged out some crap work in a fraction of the time required and demanded market rate for 3x as many hours as he put in.\n\nFYI - I'm willing to pay market, but for production design. I'm not hiring an art director. The direction of the design has already been set. Now I'm looking for someone to bang out some banner ads. Should I pay $60 an hour for that?\n\nAnyway, I can't believe you guys can't relate with this experience. Perhaps you've never needed to hire a designer to assist you on a project. But if that's the case, just do me a favor and skip this thread -- go cry to someone else. I'm looking for someone who has hired production designers and could give me some pointers on where to look, what to expect, and how much to pay.\n\n"
    },
    {
      "time": "19 Jan 2007 — 8:59am",
      "content": "Ricardo: I think they want someone who can accurately produce an idot manual, actually. Friend of mine sent me this for my \"really stupid writing\" collection. ;-)\n\nSi: The gummint of Canada has some strange ideas about how to construct employment templates and their selections don't always work. Standard is a question about one's comprehension level in the two official languages: I suspect almost everyone would pass, since functionality isn't required. (I know, and some of us laugh at your gummint...)\n\nSativo: Most (although not all) of us have had a similar experience, but have handled it in a more professional manner. If you want to hire a beginner with no experience to do mindless banner ads and pay them crap, that's your business -- it's just not ours.\n\n"
    },
    {
      "time": "19 Jan 2007 — 9:15am",
      "content": "\"Anyway, I can’t believe you guys can’t relate with this experience. \"\n\nWe don't use 'contests' to hire people. It's absurd.\n\nWhat did you expect to get when you are asking people to work for free?\n\n\"I’m looking for someone who has hired production designers and could give me some pointers on where to look, what to expect, and how much to pay.\"\n\nWell, DON'T look in online design contest forums.\n\nOptions:\n\n- ask local designers in your area for recommendations  \n - get a college intern  \n - AIGA\n\nHow much should you expect to pay? I dunno. I'd say $50 - $150 but there are so many 'it depends' that it's impossible to say. I would say expect to pay what they are worth.\n\n"
    },
    {
      "time": "19 Jan 2007 — 9:41am",
      "content": "sativo, let me try to be constructive.\n\nif i were you i'd use my professional contacts, being an art director and all, or failing that, speak to an agency and get them to shortlist some people who'd done work for similar clients, take a look at their portfolios and pay up front for a batch of work, spend the $300.\n\nthat should be obvious. after all, by your own admission, you've failed at least twice to get the results you need for your graphics through this kind of contest. your costs may be zero, but \\*you\\* have wasted your time. the designers haven't wasted yours - they're not paid and under no obligation, remember?\n\nyou're clearly looking for design rather than just knocking out banner ads: \"show one or two screen layouts that present your best vision for our store ... This contest is an excercise in showing us your ability to work with photos, typography, copywriting / marketing.\"\n\nAlthough...\n\n\"Though I'd like to see a type that's more elegant, less heavy. Check out www.gumps.com\" ... \"Once again, take a look at www.gumps.com\" ... \"Try to make it look exactly like [www.gumps.com](http://web.archive.org/web/20131018053521/http:/www.gumps.com/ \"www.gumps.com\") but with my photos.\" \"Again, check out gumps.\" -- all comments made by you in response to one entry.\n\nI wonder who's the amateur here?\n\n"
    },
    {
      "time": "19 Jan 2007 — 10:27am",
      "content": "sativo,\n\ni think you're kidding yourself if you think your motive is to try and help younger designers. your motive seems to be to try and get work done for cheap. if you were really interested in helping younger designers why not contact your alma mater and take on a design student to work for you as a PAID intern. internships are a great way for students to get experience and learn from a \"professional\".\n\n"
    },
    {
      "time": "19 Jan 2007 — 10:35am",
      "content": "Sativo, let me add one more constructive comment to elliot100's...\n\nIf **you** were a work- and money-starved young designer right now, **would you enter your own contest?**\n\n"
    },
    {
      "time": "19 Jan 2007 — 10:52am",
      "content": "It's called market economics, look into it. If there's a supply, who am I (or who are you) to criticize? No one is holding a gun to their heads. They participate in the contest on their own free will.\n\nUnlike you guys, I don't have the luxury of lamenting and pontificating about the drudgery of business and design. I design and I business... and the business side of me looks for value.\n\nFor any of you that haven't ever picked up an economics book, value is at or below the price I'm willing to pay.\n\nIn this case, I have not seen value yet. I'm willing to pay zero.\n\nHowever, if there was a designer on their that was reasonably competent, I'd pay $300 + whatever terms we would agree as fair for future work.\n\nI'm not saying it isn't appropriate to pay someone up-front. It certainly is, given the right circumstances. But get off your high-horses about this contest thing! If it turned out to produce appropriate design, you yourselves would venture to find resources there.\n\nBut the mob is fickle. I get it. You would rather take pot-shots here 'cause you're all so much better than me. Haha! What a joke.\n\nAluminum:\n\n\"How much should you expect to pay? I dunno. I’d say $50 - $150 but there are so many ‘it depends’ that it’s impossible to say. I would say expect to pay what they are worth.\"\n\nWhat they are worth to whom?\n\nIf the answer is to me.. then I'd be happy to. But prove that you are worth what you ask.\n\nelliot100:\n\n\"you’re clearly looking for design rather than just knocking out banner ads:\"\n\nI think you've hit the nail on the head. Was hoping to find someone that could think on their own, but I guess none of those guys can.\n\nRicardo Cordoba:\n\n\"If you were a work- and money-starved young designer right now, would you enter your own contest?\"\n\nWho cares? I do my thing, they do theirs. Like I said, no one is holding a gun to their heads.\n\n"
    },
    {
      "time": "19 Jan 2007 — 11:22am",
      "content": "_No one is holding a gun to their heads. They participate in the contest on their own free will._\n\nIt's more like a carrot that you're holding in front of their eyes -- there's some steady work in store, if you're the lucky winner of my \"contest\", in which I get lots of free work sent to me and then choose the one I like best.\n\nYou call that **free will** , or is it more like **free market will**?\n\n"
    },
    {
      "time": "19 Jan 2007 — 12:00pm",
      "content": "the point is, sativo \\*hasn't\\* found a supplier through a contest, let alone value, and has realised he needs to try something else and/or raise his offer.\n\nthis is also market forces.\n\n"
    },
    {
      "time": "19 Jan 2007 — 12:30pm",
      "content": "\"and the business side of me looks for value.\"\n\nIf you value your own time, then you'd realize design contests are rather poor value for you.\n\n\"In this case, I have not seen value yet. I’m willing to pay zero.\"\n\nI'm no economics guru. I'm just a lowly web designer. But I the model is at least partially based on 'give me incentive, I give you product'.\n\nI've tried to get a couple roofers to redo my roof telling them I'd pay whoever did the best job, but I haven't been able to find anyone to take me up on that yet. ;o)\n\n\"If the answer is to me.. then I’d be happy to. But prove that you are worth what you ask.\"\n\nIt's called a portfolio.\n\nYou're using an online contest to recruit random folks. You're scraping the bottom by default with the online contests. I can't see how you can get worked up about the (lack of) quality you are finding in this situation.\n\n"
    },
    {
      "time": "19 Jan 2007 — 1:29pm",
      "content": "I would never work for you sativo, you sound like a fool.\n\nMuzz\n\n"
    },
    {
      "time": "19 Jan 2007 — 1:58pm",
      "content": "_get off your high-horses about this contest thing!_\n\nThere is a reason why professional organizations (AIGA, RGD, GDC, etc.) forbid spec work in their codes of ethics, and have stipulations regarding what kind of competitions members are allowed to enter. It's because independent designers are exploited by corporate market forces unless they group together.\n\nIn that context, doing the right thing is not high-horse, it's solidarity.\n\nOf course, it's not mandatory for designers to be registered professionals in order to practise, as it is with doctors, lawyers, etc. So \"non-ethical\" mavericks can benefit financially from the status which those professional organizations bring to the work. On the other hand, they miss out on some of the benefits, such as the respect of their peers.\n\n"
    },
    {
      "time": "19 Jan 2007 — 2:26pm",
      "content": "It's pretty obvious to me that while I was looking for feedback from art directors who've had experience with finding \"talent\" on limited budgets, I've instead come upon a forum filled with designers.\n\nI can't expect for any of you to give me unbiased advice on this topic.\n\nHowever, while I can understand that this type of thing is frustrating in that it affects the market perception of designers and your market rate, I have to say that your choice to engage in all the teeth gnashing and name calling (i.e. muzzer) in favor of a calm and simple explanation no doubt adds to the very perception you're all trying so hard to dispel.\n\n"
    },
    {
      "time": "19 Jan 2007 — 2:33pm",
      "content": "_I’ve tried to get a couple roofers to redo my roof telling them I’d pay whoever did the best job, but I haven’t been able to find anyone to take me up on that yet._\n\nDarrel, that is the funniest thing I've read on Typophile in a long time--perhaps because it's true.\n\nLet me suggest an alternative explanation to yours for why the work submitted to sativo's contest was so poor: Perhaps it's because it was all submitted by poor recent d-school grads who pulled something quick out of their \\*ss on the vanishingly small chance they could get rent money for February from some cheap carrot twirler.\n\n"
    },
    {
      "time": "19 Jan 2007 — 3:02pm",
      "content": "Wow. This is an amazing flashback. This sounds exactly why I left graphic design.\n\nSativo, you are free to offer $300 for someone to develop a custom portfolio exclusively useful to you. You can even demand that they publicly compete with others, for an open critiquing, regardless of their taste for that. And they they impress with fonts, despite those being a resource you've alloted no budget to. You can even, in this free market, demand revisions over and over. I imagine you can even proclaim finally that none are worthy of the prize, or the alleged future work that goes with it.\n\nFor $0 laid out so far, you can also analyze the color levels, arrangements and typographic choices of your favorite contenders, before assembling them all into your own rip, then deem all of them non-winners and forfeit ever paying anything. Gotta love that supply and demand.\n\nHey, its a free market. For you it is very free, and it seems you are getting what you pay for. Be grateful. Don't approach a bunch of strangers and expect any sympathy; this isn't about the elitism of designers. It is about the elitism of smug ... clients.You came for sympathy and directions for finding an alternate path to your problem. You received the latter and bemoaned it.\n\nNo, now I remember why I left, it was because people want an image that is distinct and different, but looks **exactly** like [this](http://web.archive.org/web/20131018053521/http:/www.kohls.com/main/home.jsp), [this](http://web.archive.org/web/20131018053521/http:/www.gumps.com/) and [this](http://web.archive.org/web/20131018053521/http:/www.bluefly.com/), simultaneously. Cheap.\n\nGoodbye.\n\n"
    },
    {
      "time": "19 Jan 2007 — 3:43pm",
      "content": "You're boring me. Go ahead and continue crying on this thread if you want. I'm moving on.\n\n"
    },
    {
      "time": "19 Jan 2007 — 3:48pm",
      "content": "Don't let the door hit you on the way out.\n\n"
    },
    {
      "time": "19 Jan 2007 — 4:52pm",
      "content": "Wow. As a student designer nearing graduation, I'm finding this discussion to be quite interesting. After thumbing through those submissions, I have to agree with most of the feedback in this thread; you get what you pay for.\n\nWhy not come to these forums, where competent young designers like myself ( [http://www.aigadesignjobs.org/individual/edit\\_portfolio.asp?preview=true&t=](http://web.archive.org/web/20131018053521/http:/www.aigadesignjobs.org/individual/edit_portfolio.asp?preview=true&t= \"http://www.aigadesignjobs.org/individual/edit\\_portfolio.asp?preview=true&t=\")) would be more than eager to pursue such an opportunity?\n\nEven though my professional career has been somewhat brief, I have already developed a strong aversion to these so-called clients...\n\n"
    },
    {
      "time": "19 Jan 2007 — 6:19pm",
      "content": "Quote from Jspass: _ **\"Even though my professional career has been somewhat brief, I have a strong aversion to these so-called clients…\"** _\n\nCarefully cultivating that aversion will save you a great deal of wasted time and effort. Potential clients who are more trouble than they're worth are often easy to identify if you recognize the symptoms.\n\nAs demonstrated by this whole thread, one category to avoid are clients with visions of exactly what they want and who expect it at bargain rates. These clients are usually too heavily invested to relinquish enough control to enable a designer to succeed at any price. They expect designers to climb inside their heads and give birth to their brainchild (which is usually a rehash of something they've seen somewhere else). When the project fails, as it usually does, they will always blame the designer, refuse to pay, and feel perfectly justified in doing so.\n\nThese clients are sincere, but usually leave a string of frustrated and unpaid designers in their wake. They often tell stories of the \"untalented\" and \"lazy\" designers they've hired in the past. They're usually extremely picky about specific and largely unimportant details. They expect endless revisions with no additional compensation and seem oblivious that they're wasting your time. If you bring up the time factor, they'll go on the offensive and accuse you of wasting _their_ time by not giving them what they wanted in the first place.\n\nWhat they never admit to are their own shortcomings as clients. They view designers as hired pairs of hands who are mostly just supposed to implement and enhance their pre-existing visions. They hire \"production artists,\" and expect them to flesh out their impractical or unworkable ideas. They never realize that their micromanagement and flawed expectations are usually to blame for their bad luck in working with artists. They rarely even realize that they are micromanagers.\n\nThis, however, makes it easy for you, the designer, to spot them in advance. The warning signs, without exception, are always there and will become obvious during your initial visit if you ask the right questions. When you see the warning signs, it's time to say, \"Thanks, but I'm not interested.\" Leave on good terms, but don't look back. Fooling yourself by thinking that you can work with them will only result in frustration, wasted time and too little compensation.\n\n"
    },
    {
      "time": "19 Jan 2007 — 9:45pm",
      "content": "Jspass, I agree with everything Thylacine said above. In addition, my experience has been not only \"you get what you pay for\" but \"you VALUE what you pay for\" - don't make the mistake of thinking that working for cheap will endear you to your clients. The fact is, people are conditioned to value things partly by the price that is asked.\n\nIf you ask too little for your services, unfortunately, some clients will associate your low price with low value - and they won't be as respectful of your time as they would if it were costing them more dearly. Obviously, clients have different budgets and if you're just starting out you'll probably have to be a little cheaper for a while - but don't give it away!\n\nI have never and will never work on spec.\n\n"
    },
    {
      "time": "19 Jan 2007 — 10:20pm",
      "content": "Here's another bit of advice, Jspass: when working with a new, unknown client, always make clear that you charge one-third of the total cost upfront, before making even one sketch. It makes both sides, client and designer, be committed. And it will save you countless trouble.\n\n"
    },
    {
      "time": "20 Jan 2007 — 6:25am",
      "content": "100% on the money advice from Thylacine there. Print it out and hang it on your wall!\n\nIf you have no choice but to work for a client of this kind (say it's been passed onto you by someone else, or you've already committed yourself and noticed the warning signs too late) in my experience the only way of dealing with it is to grit your teeth, forget about it ending up in your portfolio, cancel everything else for a few days, tell them you charge per hour for rush (it will always be) exclusive/on call/evening production work, and double your rate.\n\n"
    },
    {
      "time": "21 Jan 2007 — 4:49am",
      "content": "Cory, you should write a manual! I could help you and send you some examples to illustrate your points. I had a meeting with a client once and when we started discussing money he said: well, it's good for you to have a company like mine on your portfolio, you know. Eeeeeeekkkkk...[sound of tyres skidding]  \nIf the client says: \"we have been trying to develop our visual identity for 10 years now but never found the right person\", RUN. There's a reason the client can't find the right person.\n\n"
    },
    {
      "time": "21 Jan 2007 — 6:37am",
      "content": "You can thank the many who brought in the electronic age and it's side effect of ruining what used to run very smoothly.\n\nIn the \"olden\" days - we had Art Directors who paid their dues to get to the spot they were in. We had Production Directors, who even when they had their job, they continued to be educated in the latest papers, printing presses, inks, etc. We had bullpens, where the young, bright and best from art schools would work together, helping each other with design thoughts. There were many checkpoints along the way. A basic comp, approval, execution. Ah, execution - is what happened to it. These persons working had outside suppliers - folks who very seriously took their careers. Many started as apprentices and worked their way up to journeymen. The artists and production people relied on the professionals.\n\nIn fact, the whole industry relied on professionals. Literally hundreds of years of experience (from those who had the experience) went into every design piece.\n\nYou, Sativo, are now seeing the new end product. Anyone who has made an investment in a computer can be a designer... Good luck.\n\nAND P.S. Give those folks a reason why you cancelled - select one winner, pay them the $300 PROMISED -- and say the contest is over. You don't have to use their work - but god damn - be a person of your word and fork over the funds and name the winner on your site.\n\nNew question - Are you stale? Are you really a designer? You look as if you want new ideas to help you design. I remember your first \"contest\" select a name for the site - did anyone ever win that one?\n\nCome to think of it - have you ever really helped a young designer? All of this looks like you are more of a user of young designers...\n\n"
    },
    {
      "time": "21 Jan 2007 — 7:56am",
      "content": "<cite>If the client says: “we have been trying to develop our visual identity for 10 years now but never found the right person”, RUN. There’s a reason the client can’t find the right person.</cite>\n\nSpot on! I had a client once who couldn't even come up with a name for his business and that was a huge warning flag to me. Quoted triple my fee, that was the end of him.\n\n(oh yeah, Sativo couldn't come up with a name either... funny that)\n\nI also had a client who was on the second redesign (third design in all) of her product packaging. Was she indecisive or did she just have terrible judgment? Hard to know; we parted ways when she couldn't articulate her ideas, just that vague \"It's still not there yet\" thing. But I got the 1/3 up front.\n\n"
    },
    {
      "time": "21 Jan 2007 — 9:08am",
      "content": "Patty -\n\nDesigners are taught not to work on spec. They do however, work on reject fees. A price is set for the job - you don't like the work you've hired to do - depending on the arrangement or the year, it's 30% to 40% of that price to pay for the work you've asked for.\n\n1/3 upfront - most likely constitutes that reject fee if they don't use the work you've submitted, and takes them off any further financial responsibility.\n\nAnd yes, I don't know about you - but when you work with a pain in the butt - a reject fee is as good as KY.\n\n"
    },
    {
      "time": "21 Jan 2007 — 1:08pm",
      "content": "As a design student, I am offended by such \"contests\". It is not a contest, it is a poor excuse to get something for free. At my school, we are discouraged from taking part in these types of activities. I hope you are not part of AIGA as I belive they do not allow designers to do this type of \"spec work\". You should be ashamed of yourself.\n\n"
    },
    {
      "time": "21 Jan 2007 — 6:30pm",
      "content": "Yes, Jackie, I know. I never work on spec. It's important to have a contract or agreement in writing and also to get an initial \"upfront\" payment just to start. Sometimes a working relationship has to be dissolved mutually and if there's been a minimal payment nobody feels ripped off. I'm very specific in my contracts and break down the work as much as possible so that the client is not freaked by a big number but understands exactly what the job involves.\n\n"
    },
    {
      "time": "21 Jan 2007 — 7:05pm",
      "content": "Sativo—you asked a question, and got an answer. In fact it looks like it's largely a collectively agreed upon answer and one you don't agree with. What did you expect? If you can't take the critique, than don't ask stupid questions. You're the one with the problem. We're explaining WHY it's a problem. Regardless, the problem is yours. If you don't want to solve it and would rather compain and vent, start a blog. Nobody here wants to bicker about something you are clearly and stubbornly refusing to come to terms with.\n\n"
    },
    {
      "time": "21 Jan 2007 — 7:24pm",
      "content": "So who won your \"name the company\" contest Sativo?\n\nChrisL\n\n"
    },
    {
      "time": "21 Jan 2007 — 7:58pm",
      "content": "Great question Chris - anyone see the $250 bucks promised?\n\n[http://typophile.com/node/29587](http://web.archive.org/web/20131018053521/http:/typophile.com/node/29587 \"http://typophile.com/node/29587\")\n\nChris did you ever hear from him about all the names you proposed for it?\n\nAnyone?\n\n"
    },
    {
      "time": "21 Jan 2007 — 8:47pm",
      "content": "Update from sitepoint.com:\n\n\"Contest Cancelled  \nThis contest has been cancelled. Entries are no longer being accepted.  \nPlease see the comments for more information, or... \"\n\n"
    },
    {
      "time": "21 Jan 2007 — 8:55pm",
      "content": "<cite>I hope you are not part of AIGA as I belive they do not allow designers to do this type of “spec work”.</cite>\n\nWhile the AIGA does actively discourage working on spec, it does not demand that members do not.\n\n"
    },
    {
      "time": "21 Jan 2007 — 9:09pm",
      "content": "_anyone see the $250 bucks promised?_\n\nTypophile \"resolution\" apparently non-binding :-)\n\n"
    },
    {
      "time": "22 Jan 2007 — 5:51am",
      "content": "Jackie,  \nI never heard a peep about the list of names I suggested. Seems to me it must have been a bogus contest. Perhaps Sative should just divvy up the $250 evenly between all who submitted.\n\nBTW, my furnace croaked last night during the coldest day of the year. I am having a contest to see who can come fix it the fastest. The winner will get my share of Sativo's $250 name contest. Any takers? Step right up.\n\nChrisL\n\n"
    },
    {
      "time": "22 Jan 2007 — 6:06am",
      "content": "\\>my furnace croaked\n\nChris, the whole frog thing is out of control. Frog typeface, brilliant. Frog mascot, OK. But the idea of using frogs to blow hot air through your house--just too much :)\n\n"
    },
    {
      "time": "22 Jan 2007 — 6:10am",
      "content": "LOL!!!  \nI should just invite Sativo over to my house. I am sure he can blow much more hot air than any frog or other life form for that matter :-)\n\nChrisL\n\n"
    },
    {
      "time": "22 Jan 2007 — 7:11am",
      "content": "I havn't heard anything about the company name contest either :(\n\nand my suggestions were clearly the best ;)\n\nMaybe that 'contest' was cancelled too, but the rules stated...\n\n_\"All submissions must be made prior to Jan 30, 2007!\"_\n\n...so maybe it's still running.\n\nCome on then everyone, let's all make one last big effort to see if we can come up with that name shall we? You know it's worth it.\n\n"
    },
    {
      "time": "22 Jan 2007 — 7:15am",
      "content": "Chris,\n\nI must ask what it is with you and frogs. (I lost my dearest friend two years ago - and art director and avid frog collector...)\n\nMeanwhile, I can sympathize. I'm in the South. My A/C Heating unit died a few nights back. I called my guy - 20 minutes later he was here (and no, he isn't a New Yorker at all), the next day they sent 2 guys over to install a new compressor - and hey, only 1/10 the cost of a new unit... trick is... o/~ you have to have a contract if you want to stay ahead... you can bump, you can.... lol\n\nMeanwhile for the Russian Market name contest how about  \nCHEAP GUYS...?\n\n"
    },
    {
      "time": "22 Jan 2007 — 7:20am",
      "content": "The company name should be \"Hot Air\" or \"Beau Gus\"\n\nChrisL\n\nPS: Wormwood's bio is an absolute scream. I highly recomend it for a an uplifting moment in your day :-) Well done Jon!\n\n"
    }
  ]
}
