{
  "id": "30729",
  "title": "Convincing the non designer Peons of Corporate America",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "So ive started on two major identity projects. (major on my scale, which is probably small). . .\n\nIm well versed on the design process, etc. But my real question comes to typeface choice. Ive built a good collection of fonts purchased from various vendors, however there are cases when I just dont have something that fits. My clients know nothing of fonts, or the importance of them. I have tried to explain liscensing and the general design and language of typefaces all to no avail. Both client have simply said why not make my design out of TNR or Arial because they are \"free.\"\n\nI sample various fonts from vendors and the clients are displeased with the quality and leave the conversation with an \"I dont know\" show me something high quality. . . Pain.\n\nAny tips on how to convince a client about selecting a nicely fitting and desinged face?  \nAm I barking up the wrong tree and should I bite the bullet in the name of good design, and hope that Ill have a client willing to explore next time?\n\nMy final question is regarding the purchase of a face for an identity.\n\nWould I purchase a simple liscense to use a face for a logo? And then have to purchase multiple liscenses for each respective employee to use for the designed stationary, etc.?\n\nCheers\n\nJames\n\n",
  "author": "James Scriven",
  "time": "19 Jan 2007 — 9:01am",
  "uid": "14360",
  "comments": [
    {
      "time": "19 Jan 2007 — 9:09am",
      "content": "\"why not make my design out of TNR or Arial because they are “free.”?\n\nIt's a valid question.\n\nIn the end, the typeface is an integral part of their visual identity. If they value that, then they should be able to accept the typeface as part of the overall package.\n\n\"Would I purchase a simple liscense to use a face for a logo? And then have to purchase multiple liscenses for each respective employee to use for the designed stationary, etc.?\"\n\nYou'd have your own license to create the logo. Once created, however, the logo is then just a piece of art that anyone in the company should be able to use.\n\nIf you are using a specific typeface for the stationery other than the logo, then yes, whoever is in charge of creating and updating the stationery would also need a license of the typeface.\n\n"
    },
    {
      "time": "19 Jan 2007 — 9:57am",
      "content": "TNR and Arial are not just favored because they come pre-installed on every Windows and Mac PC, they also perform well on screen at small sizes, and have huge international character sets. Replicating the hinting quality and char set in a commercial or even custom font is difficult and expensive. I've heard stories of several very large international companies balking at the cost of extending their shiny new corporate fonts to the required char set and level of hinting required by their \"peons\".\n\nSo rather than fight the system work with it. Look at the commonly installed fonts say the Web fonts - Georgia is nice ;-) - or maybe Palatino Linotype, and build a logo and identity that works with them.\n\n"
    },
    {
      "time": "19 Jan 2007 — 10:06am",
      "content": "“why not make my design out of TNR or Arial because they are “free.”?\n\nbecause they are completely generic.\n\n"
    },
    {
      "time": "19 Jan 2007 — 11:09am",
      "content": "_“why not make my design out of TNR or Arial because they are “free.”?_\n\nBecause it will makt them look like this...\n\n ![](http://web.archive.org/web/20121102080551im_/http:/typophile.com/files/cheap_6732.gif)\n\n"
    },
    {
      "time": "19 Jan 2007 — 11:13am",
      "content": "_TNR and Arial are not just favored because they come pre-installed on every Windows and Mac PC, they also perform well on screen at small sizes, and have huge international character sets._\n\nSimon, I know you're biased, but let's get real here. There is _nothing_ unique about system fonts. When a font becomes a system font, it becomes the very opposite of the word, because **everyone** has it. This has nothing to do with the care, skill or design that has gone into it. The above examples also have the honor of being overused in the corporate world.\n\nJames, one way to convice them is to design your logo with whatever typeface you want and then show it to them using Comic Sans, Sand (or any other typeface that is completely different) and see how they react. They'll probably realize they notice type more than they thought.\n\n"
    },
    {
      "time": "19 Jan 2007 — 11:13am",
      "content": "Nick, I like it!\n\nHave you been keeping up with this thread? [http://typophile.com/node/30718](http://web.archive.org/web/20121102080551/http:/typophile.com/node/30718 \"http://typophile.com/node/30718\")\n\n"
    },
    {
      "time": "19 Jan 2007 — 11:17am",
      "content": "Try pointing out, in the most diplomatic way possible, that they hired you to give their corporation a distinct identity and that, as Patty has pointed out, there is nothing distinct about TNR or Arial. If this doesn't work you can follow up with something along the lines of “Well, since you clearly have concluded that you don't want an identity, there's nothing more I can do for you, so I'll be keeping my deposit and ceasing work on this contract.” At least you can if your contract allows for that and if you got a deposit.\n\nAlso, have you tried putting together a Paul Rand style book that shows the type, the logo, and the colors, all with a flowing written explanation? You'll have a lot more luck that way, because then they'll feel like they're reading this stuff, learning, and coming to a conclusion on their own, as opposed to just being told what to think. I just got a copy of the book Rand did for NEXT, if you want I'll scan it for you.\n\n"
    },
    {
      "time": "19 Jan 2007 — 11:28am",
      "content": "\\>Simon, I know you’re biased, but let’s get real here. There is nothing unique about system fonts.\n\nNo, really let’s get really real. How can you fault a company for ranking legibility and international support over uniqueness?\n\nI think you also missed this part \"and build a logo and identity that works with them.\" - I wasn't suggesting that they use a core font for the logo. Look at Typophile, a great logo, identity and heading font that works well with Georgia ;-)\n\n"
    },
    {
      "time": "19 Jan 2007 — 12:28pm",
      "content": "I'm not. In fact I can't freakin' wait to use the Cleartype fonts. I don't think we're just discussing functionality. The question being asked is partly a \"creative\" question. Its very limiting as a creative person to only have two options that are commonly used.\n\nThere are many well designed system fonts, but TNR and Arial are ubiquitous. I'm answering the question as a graphic designer, and as a graphic designer...it limits my creativity and ultimately my enjoyment in a project. To a lot of creative people (but not all) uniqueness _is_ a top priority.\n\nDidn't mean to sound so snarky there, the tone would have been a lot different had it been delivered after a round of brews instead of typing on a keyboard. :)\n\n"
    },
    {
      "time": "19 Jan 2007 — 12:37pm",
      "content": "I would make the process in parts. First establish the design with an existing font. Get approval. Then propose alternate fonts and give justification. Make sure you have a reason for the font (potiential client, demographic, range of the font like real small caps).\n\n"
    },
    {
      "time": "19 Jan 2007 — 12:41pm",
      "content": "Terry, I was being a bit snarky too - sorry. It comes from having experiences from the other end when trying to use some unhinted custom fonts, with small character sets in Word and in presentations (most recently with the Xbox 360 fonts) - the experience made me value the core fonts. On top of that I often have to explain to customers (internal and external) why certain fonts have had less investment (hinting and char-set) than others, and that's hard too. Maybe I need a few of those brews. TGIF! ;-)\n\n"
    },
    {
      "time": "19 Jan 2007 — 12:51pm",
      "content": "Now, now, here's how you do it.\n\nFirst, you do _exactly_ what the client wanted.\n\nSecond, do a second design: your take on it. Go the extra mile. Make it amazing.\n\nWhen presentation time comes, present the former design first, then the latter. Finally, compare and contrast the two, in which you'll present a persusive reasoning on how the second design will work better for the client than the first.\n\nMost of the times, it takes a bad design to make the good one shine.\n\nGood luck!\n\n"
    },
    {
      "time": "19 Jan 2007 — 12:54pm",
      "content": "JSDOCA,\n\nOne of the best things you can do is make comps from sites that let you see what words look like. If the client okays them - buy the font - then add it to the bill.\n\nIt's all part of the design service. If you cannot add a separate line for font - add the price to the extra time you took finding the font for the design.\n\nAnd btw - headache charges are permitted.\n\nHope that helps.\n\n"
    },
    {
      "time": "19 Jan 2007 — 12:54pm",
      "content": "\\>Most of the times, it takes a bad design to make the good one shine.\n\nSounds a bit dangerous, how many times out of ten does the client pick the bad design? ;-)\n\n"
    },
    {
      "time": "19 Jan 2007 — 1:02pm",
      "content": "I agree with Sii, you have to be careful with the \"bad\" design. It should be good enough for you to live with in case it's chosen.\n\nToday I had a message from a client who wanted to change a design quite a lot, and not to a good direction. I did what was asked, but also suggested a third alternative, something between the two (closer to the first ;^) ). The third one was chosen, after the client's suggestion was proven not suitable.\n\n"
    },
    {
      "time": "19 Jan 2007 — 1:06pm",
      "content": "_how many times out of ten does the client pick the bad design? ;-)_\n\nMore than 0.00 but less than 1.00, in my experience.\n\nOf course, in cases like that, you nod, cash the cheque, and the next time they call with work, you tell them you're busy. ;-)\n\n"
    },
    {
      "time": "19 Jan 2007 — 1:28pm",
      "content": "Actually, it's about the presentation too, and making the bad design look and feel _bad_ enough. The key is to not actually make them feel remorseful over their past decision, but to have them think \"Oh, now there's an idea.\"\n\nWe're getting psychological here. I digress :)\n\nSii, at least in my past cases, most of the clients agreed. But then again, we're talking Portland-style small to mid business here :)\n\n"
    },
    {
      "time": "20 Jan 2007 — 9:47am",
      "content": "_Sounds a bit dangerous, how many times out of ten does the client pick the bad design? ;-)_\n\nMan, oh man you ain't kiddin'! I heard a designer once say if you hate one of the options— don't show it to the client, because they will invariably pick that version as the final! :)\n\n"
    },
    {
      "time": "20 Jan 2007 — 10:10am",
      "content": "<cite>Of course, in cases like that, you nod, cash the cheque, and the next time they call with work, you tell them you’re busy. ;-)</cite>\n\nThe next time they call you quote them an absolutely outrageous price and if they go for it, take the money and run! Not everything you do will end up in your portfolio but if it won't, it should at least end up in your bank account.\n\n"
    },
    {
      "time": "20 Jan 2007 — 7:06pm",
      "content": "Not everything you do will end up in your portfolio but if it won’t, it should at least end up in your bank account.\n\nThat will be my credo from now on.\n\nOr you can always say \"Here's the stuff that you requested/commisioned, and, oh, by the way...\"\n\n"
    },
    {
      "time": "20 Jan 2007 — 7:30pm",
      "content": "_The next time they call you quote them an absolutely outrageous price and if they go for it, take the money and run!_\n\nMaybe I'm just a grumpy old fart, but I gave up on dealing with DFI\\* clients awhile ago.\n\n(There's an old, probably apocryphal, story told about George Bernard Shaw visiting in the U.S., who asked a woman if she would go to bed with him for $1,000,000. She responded \"why, of course sir!\"\n\n\"But would you go to bed with me for $10?\" said GBS.\n\n\"Of course not, what kind of woman do you think I am?\" she retorted, and was much offended.\n\n\"I know that already, I'm just trying to establish the price.\")\n\nSome of us don't have a price....\n\n\\*DFI = Dumb F\\*\\*\\*ing Idiot\n\n"
    },
    {
      "time": "20 Jan 2007 — 8:50pm",
      "content": "<cite>Not everything you do will end up in your portfolio but if it won’t, it should at least end up in your bank account.</cite>\n\nIf I've ever seen sage advice, that's it.\n\n"
    },
    {
      "time": "20 Jan 2007 — 11:30pm",
      "content": "_show it to them using Comic Sans, Sand (or any other typeface that is completely different) and see how they react_\n\nI think this is dangerous, Terry... the client might like it! :-D\n\n_I heard a designer once say if you hate one of the options —- don’t show it to the client, because they will invariably pick that version as the final!_\n\nI've heard of cases where this actually happens...\n\n"
    },
    {
      "time": "23 Jan 2007 — 4:11am",
      "content": "<cite>I heard a designer once say if you hate one of the options —- don’t show it to the client, because they will invariably pick that version as the final!</cite>\n\nI also can't agree on designers showing options they don't like. It's like harming yourself (and others).\n\nFor me the only time when designer can show more than one option is the initial stage when he shows rough ideas and possibilities rather than completed work. If a client pays for one design he gets the best one you can do. Only one.\n\nAs for the corporate typeface it seems your client is not keen to spend money on fonts. BTW isn't it the letterhead the only document client would fill with Arial? You should then consider it as an option. I agree you can try talking about his 'uniqeness', but, to be honest, I think he won't buy licenses for his 40 offices :)\n\n\\_\\_\\_\\_\\_\\_\\_  \n AL  \n [lenart.pl](http://web.archive.org/web/20121102080551/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": "23 Jan 2007 — 5:25am",
      "content": "I used to work for a so-called 'design' company, and the idiot in charge always insisted we do about ten different options to show the client they were getting good value for money.\n\nInvariably, the client would say 'Oh great! we'll have a bit of that one, a bit of that one, a touch of this...etc' So the whole idea would be a complete compromise.\n\nEven worse if you're showing to a committee.\n\nTosser! It's pretty disheartening. I'm so glad I work for myself now.\n\nNick Cooke\n\n"
    },
    {
      "time": "23 Jan 2007 — 7:06am",
      "content": "The goal is to hire someone that really knows how to sell if you can. The success of small (and even large) firms centers on the sales/account exec team.\n\nI've worked with sales people that can completely convince the client to pick whichever design we felt was the best option. The beauty was that when done, the client completely believed that it was entirely their decision.\n\nIf you are like me, though, and not the greatest with the sales pitch, defintely to NOT show them any options you do not feel are appropriate as inevitably, that'll be the one the client leans towards.\n\n"
    },
    {
      "time": "23 Jan 2007 — 10:38am",
      "content": "_don’t show it to the client, because they will invariably pick that version as the final!_\n\nSo, it seems virtually unanimous!\n\n_I think this is dangerous, Terry… the client might like it! :-D_\n\nPerhaps. But perhaps, not. :)\n\n ![](http://web.archive.org/web/20121102080551im_/http:/typophile.com/files/Chevron_logo_Comic_4743.jpg)\n\n"
    },
    {
      "time": "23 Jan 2007 — 10:55am",
      "content": "Forgot to mention...\n\n_\\*DFI = Dumb F\\*\\*\\*ing Idiot_\n\nLOL! Classic. That needs to be a technical term!\n\n"
    },
    {
      "time": "23 Jan 2007 — 11:14am",
      "content": "The purpose in using either type or a logo to establish identity is (say it with me now) to establish identity! Establishing an identity is not making yourself look plain vanila and just like everything else on earth no matter how well it is hinted. Identity/branding Clients are trying to distinguish themselves from the masses, not get absorbed into the masses. They are trying to position themselves in the marketplace visibly, not hide in plain site. What is the point of having a corporate face if it is lost in the crowd?\n\nChrisL\n\n"
    },
    {
      "time": "23 Jan 2007 — 11:36am",
      "content": "Terry, DFI is almost as classic as AMF... ;-)\n\n"
    },
    {
      "time": "23 Jan 2007 — 11:43am",
      "content": "Even though I feel like Bud Abbot, I'll bite Linda, what is AMF?\n\nChrisL\n\n"
    },
    {
      "time": "23 Jan 2007 — 11:47am",
      "content": "Chris, if a corporation is big enough, or wants to be perceived as playing in that league, then massive blandness may be a feature, not a fault.\n\nPerhaps identity is only required for niche products, and blandness is better for mass products that are bought on price, convenience, or celebrity tie-ins.\n\n"
    },
    {
      "time": "23 Jan 2007 — 11:48am",
      "content": "(If you bite me, you better make sure you've had your shots.)\n\n\"Adios Mother-....\"\n\nOne of the better exit lines I've run across. ;-)\n\n"
    },
    {
      "time": "23 Jan 2007 — 11:53am",
      "content": "\"...and blandness is better for mass products that are bought on price, convenience, or celebrity tie-ins.\"\n\nOr else it was the only thing a large boardroom full of egocentric decide-by-committee VPs could agree on :-)\n\nChrisL\n\n"
    },
    {
      "time": "23 Jan 2007 — 12:01pm",
      "content": "The Finnish VPs seem to use two trusted methods when it comes to choosing designs: mutu and vatu  \nmutu = musta tuntuu (me thinks)  \nvatu = vaimosta tuntuu (my wife thinks)  \nVatu is especially bad method from the designer's point of view. If the VP's wife doesn't like, let's say green, or her favourite colour is blue, that has a huge affect on the final design.\n\n"
    },
    {
      "time": "23 Jan 2007 — 12:07pm",
      "content": "I think I must have come accross some \"vatu\" in my caree in America, perhaps it was imported from Finland ;-)\n\nChrisL\n\n"
    },
    {
      "time": "23 Jan 2007 — 12:17pm",
      "content": "All the big strategic decisions are based on vatu, too.  \n“Should we…  \n• expand abroad?  \n• launch this new product?  \n• buy this other company we don’t know that much about for ten years’ turnover?  \n– I’ll have to ask me wife tonight…”\n\nYou can always affect mutu but never vatu, that’s what makes it so dangerous.\n\nIt seems there’s a weekly learn a word of Finnish going on here. Great.\n\n"
    },
    {
      "time": "23 Jan 2007 — 12:25pm",
      "content": "We are always ready for Finnish product :-)\n\nChrisL\n\n"
    },
    {
      "time": "23 Jan 2007 — 12:43pm",
      "content": "Okay, Chris. I’ve got a nice little assignment for you. With the Easter coming, I dare you to try some mämmi. Mämmi is traditional finnish easter food. You’ve a couple of moths to find a store that sells finnish food. Swedish one might do, I’m not sure if they have this.\n\nDon’t google this and spoil the fun. Just go to store where they have it and say you want some mämmi.\n\n"
    },
    {
      "time": "23 Jan 2007 — 12:49pm",
      "content": "Oh boy, do I really want my mommy? :-)\n\nChrisL\n\n"
    },
    {
      "time": "23 Jan 2007 — 12:51pm",
      "content": "You could start by not calling them peons. (We've been asked to remove posts from designers who's clients didn't like what was being said about them.)\n\nInstead of groaning and moaning just remember that you're part designer and part salesman (salesman of your ideas). The design process is work, no matter who your client is. Design savvy clients require just as much, if not a lot more, work than unsophisticated clients. The end result with a savvy client usually ends up being a lot better work, however.\n\nPortfolio counts, especially when you're starting out, but what will reward you in the long run is happy clients. So, you've got to gently educate them, without belittling them. Explain that you're upgrading them from Men's Wearhouse to Macy's or from Hyundai to Honda, or whatever anology works. And if you must go with a \\*free font, don't give in to TNR, Arial or Comic Sans.\n\n\\* These fonts aren't free, they're just licensed, subsidized, by the big OS makers.\n\n"
    },
    {
      "time": "23 Jan 2007 — 1:05pm",
      "content": "James,\n\nI'm with Joe. But I feel your pain, particularly since it's hard to spec fonts when you don't own them. Sometimes it's a matter of having a sit-down with them and explaining the reason for using a non-typical font. It's hard to make someone care about the finer points of fonts, so know your battle before you go into it and be armed with a solid reason. Make it matter to them. Don't explain historical models, explain direct benefits: saving space, market disctinction, legibility, reader impact.\n\nMaybe this is all repetition of stuff you know. I find that large samples printed from the font testers that most foundries offer work the best. Select three, create a compelling 20-second explanation of the benefits of each, get their reaction. Then, repeat with a more narrowly selected bunch. You have the power to control what fonts they see and the power to shape their understanding. Don't worry about showing them extensive text settings. Sell them on what YOU know, not what THEY see. If need be, try to find a PDF with a high-res sample to supplement.\n\nAt least, this is how I go about it.\n\nOh, also consider differentiating between internal memos and external communications. Sometimes only the marketing group/designers need the unique font, allowing them to use a font from the default set for the majority of their users.\n\n"
    },
    {
      "time": "23 Jan 2007 — 5:26pm",
      "content": "Joe great comment, the client, wanting a web 2.0 look . . . went with Helvetica Round and Neue (sp?) I was pushing the new Gotham Rounded.\n\nMy biggest question spanning out of this is the liscensing. . . I understood all of the EULA's however I have no idea where the line gets drawn on the web ( I know that most require pixel format, an a certain percentage of the characters alphabet not to be exceeded). What I dont understand is when the client say wants to use a system font, such as Helvetica. . .for the reason being that they think its free. It still has to be licensed right? Its exceeding beyond personal use and into public showcase in the matter of using say Helvtica for a logo????\n\nThanks for the insight.\n\n"
    },
    {
      "time": "23 Jan 2007 — 5:32pm",
      "content": "I copied Dezcom's comment about Vanilla, etc. Seemed to make sense to them, but it came down to them claiming that there is no obvious difference between say Helvetica and Meta for example. . . (that shocked me)\n\nI didn't really think about it as so much of a selling point but it really is. (still just getting my feet wet). I showed them way to many, and of course they said they all look the same, and they still wanted to go with their \"free fonts.\"\n\nNo such thing as a free font if you want to give credit to such designers correct? Say they have Helvetica on their system Mac, if they want it used as a logo, they should purchase a license? Or is that license included in the fact that its bundled with the program or system?\n\n"
    },
    {
      "time": "24 Jan 2007 — 6:32am",
      "content": "\"Say they have Helvetica on their system Mac, if they want it used as a logo, they should purchase a license?\"\n\nIf it came with their system, then they have a license by virtue of the OS they purchased.\n\n"
    },
    {
      "time": "24 Jan 2007 — 7:39am",
      "content": "Cheers aluminum, so in the case here for my client they don't in fact own a mac, but they have Studio 8 which I'm sure includes helvetica. I'm using my laptop there until they get me a mac (I'm their in house). I would have to purchase a license for the companies use. correct?\n\nThanks\n\n"
    },
    {
      "time": "24 Jan 2007 — 11:07am",
      "content": "So here's some advice that may sound weird and not so fun. I think you might need to lay low. A creative person stepping into a lion's den with business executives is almost always going to have the chips stacked against them. You should think about playing their game— print a memo with a well crafted explanation and/or examples to illustrate your point. If you try to rock the boat too early, you may come off like a newbie who is not realistic and doesn't understand the game.\n\nI'm guessing you're still a little green because presenting \"too may options\" is a rookie mistake. :) Lord knows I've made it. Don't overplay your hand.\n\nLastly, piggybacking off Joe's comment. I **highly** recommend changing the name of this thread. All your employers have to do is Google your name and they can find this thread.\n\n"
    },
    {
      "time": "24 Jan 2007 — 11:48am",
      "content": "In regards to renaming a thread: Sadly with the amount of traffic we get here it might already be in the wayback archives. :^/\n\n"
    },
    {
      "time": "24 Jan 2007 — 11:56am",
      "content": "There's always the option of starting with Helvetica and tweaking it a little to add personality; that's what Vignelli Associates did for Knoll.\n\n"
    },
    {
      "time": "24 Jan 2007 — 1:12pm",
      "content": "\\>changing the name\n\nTerry is right. Name-calling is generally a losing tactic. Just ask George Allen :)\n\n"
    }
  ]
}
