{
  "id": "30722",
  "title": "Logo Design- is it necessary to create a font from scratch?",
  "forum": "Design",
  "tags": [

  ],
  "content": "This question is as straight forward as they come.\n\nLogo Design- is it necessary to create a font from scratch?\n\nWhat do you recommend?\n\n",
  "author": "<a href=\"/web/20110617100356/http://www.typophile.com/user/16311\" title=\"View user profile.\">IP</a>",
  "time": "<br>",
  "uid": "16311",
  "comments": [
    {
      "time": "",
      "content": "Why would it be necessary to create a font from scratch for a logo design?  \nYou could, which can be nice. But it isn't necessary?\n\n"
    },
    {
      "time": "",
      "content": "the wheel doesn't need to be reinvented.\n\n"
    },
    {
      "time": "",
      "content": "No, it isn't.\n\nA new font is almost never needed for the creation of one, single logo. If an existing font does not meet your or your client's needs, it is usually better in terms of time and budget to just create a vector art logo. A fount entails so much more work and investment that the few letters or symbols found in a logo.\n\n"
    },
    {
      "time": "",
      "content": "If you're talking about incorporating letter shapes into a logo design, most font licences specifically allow it, and with those that don't it could be argued that you can since this is a customary fair use of fonts. (Be careful who you argue with, though.)\n\nNotable exceptions include most dingbat and picture fonts, since the glyphs in those fonts are essentially logos already.\n\nIf you have the time and your client has the budget, by all means create a new custom font for the project.\n\n"
    },
    {
      "time": "",
      "content": "Logo design is not typesetting (It is necessary to create several letters from scratch)\n\n"
    },
    {
      "time": "",
      "content": "I would say yes, depending on what exactly you are asking! If you mean an entire typeface, then no. But if you mean drawing only the necessary letters from scratch, then I say yes. It is what I always try to do do anyway.\n\n—K\n\n"
    },
    {
      "time": "",
      "content": "Interesting answers!\n\nLet's take a simple word and do a test. Say you are creating a logo, which will be used first and foremost on stationary and eventually a website.Use the word below.\n\nFruit!  \nTagline- It's good for you.\n\nWould you design those five letter plus punctuation and the tag line by scratch?\n\nWould you take another font and pop it into a program and change it? (Still confused whether that is legal in regards to the EULA- please hlep me on this...that is my ultimate question).\n\nIf you had an existing font, would you just polish it up and pop it into a snazzy illustrative design?\n\n"
    },
    {
      "time": "",
      "content": "Type your word FRUIT! in a bunch of different fonts. You can even do this in your font browser. Certain characters and combinations will start to emerge. Then customize as necessary. You might decide, for example, to turn the I into a banana (I'm going for the obvious here) Wait to tackle the tagline until you know where you're going with the logo.\n\nYou have a lot of questions, have you ever studied design? Might be worth taking some classses.\n\n"
    },
    {
      "time": "",
      "content": "I would start drawing the letters to get the feel & flavour right. Perhaps I already have a typeface in progress that is suitable, perhaps not. I might even start straight into FLS, as Illustrator is harder to work the curves. It all depends on the budget & client! For instance, [Kaweka](http://web.archive.org/web/20110617100356/http:/www.klim.co.nz/content/lettering/kaweka.html), [conveyIT](http://web.archive.org/web/20110617100356/http:/www.klim.co.nz/content/lettering/conveyIT.html) and [Fiend](http://web.archive.org/web/20110617100356/http:/www.klim.co.nz/content/lettering/fiend.html) all started as sketches. Pen and paper are still the easiest ways to nail the idea for me!\n\n—K\n\n"
    }
  ]
}
