{
  "id": "30728",
  "title": "Typesetting fee question",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello everyone. I am brand new to this forum and hope you can help me. I am a book designer/typesetter from the Midwest who just recently moved to NYC. I am a freelancer and I need to update my prices. Does anyone have a recommendation of how much to charge for an interior book design? How about for typesetting? By the character count or by the page? I want to have competitive pricing, but I don't want to give it away! NYC is expensive, after all. !\n\nAny suggestions would be welcome. Thanks! Janet\n\n",
  "author": "janet_wilson",
  "time": "19 Jan 2007 — 8:38am",
  "uid": "16364",
  "comments": [
    {
      "time": "19 Jan 2007 — 8:44am",
      "content": "Actually the going rate for typesetting in NYC these days is by the word, approx 7 cents a word.\n\nFor interior book design I charge $25/page for text only and between $40 and $50/page for illustrated books. This fee includes the cover design, typesetting and one round of layout correx. Additional correx billable hourly at $50/hour.\n\n"
    },
    {
      "time": "19 Jan 2007 — 11:17am",
      "content": "thanks!\n\n"
    },
    {
      "time": "19 Jan 2007 — 11:58am",
      "content": "Also - scanning, retouching, photo research, production (by this I mean print production - pricing, etc) - all extra and billable as such.\n\n"
    },
    {
      "time": "19 Jan 2007 — 12:58pm",
      "content": "Patty, you sound like you are giving out prices for design/layout - which depending on the publisher does yield about $15 to $100 per page, depending on book, budget, etc.\n\nHowever, in just good old typesetting of a page - it use to average out to about $2.50 per page.\n\nJanet - the very best of luck - I use to typeset (and design) book interiors for Berkley, Simon & Schuster, Avon, etc. I am no longer in the city -- and none of the major publishers seem to care for freelancers to do it anymore. One of the publishers now has a dept within the production dept -- and they are happy in a few typefaces with the same basic design for each book. When it came to the complex books that need thought, design, sense of layout, etc. -- they decided only to buy packaged goods.\n\nGood luck - it's a tough world, and yes, New York is very expensive.\n\n"
    }
  ]
}
