{
  "id": "30758",
  "title": "The perfect LaserPrint for Typedesign",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello to every one.\n\nI need to purchase a good b/w Laser print for test my first humanist sans design (texts for magazines and newspapers, 8-12 pts) so im looking for successful testimonial history.\n\nThe closer offset emulation, the better...  \nI supose that \"print tests\" are an esential part for type design courses, so any information about this is welcome.\n\nBest Regards,\n\nmh.\n\n",
  "author": "Miguel Hernandez",
  "time": "20 Jan 2007 — 6:22pm",
  "uid": "1109",
  "comments": [
    {
      "time": "20 Jan 2007 — 6:56pm",
      "content": "Miguel,  \nThere have been a couple of threads here that have addressed this in more detail but I would have to say that theXante 2400 dpi is the best tool for the job but it is quite pricey.\n\n[http://www.superwarehouse.com/p.cfm?p=363184&CMP=KAC-NexTag](http://web.archive.org/web/20150414233908/http:/www.superwarehouse.com/p.cfm?p=363184&CMP=KAC-NexTag \"http://www.superwarehouse.com/p.cfm?p=363184&CMP=KAC-NexTag\")\n\nChrisL\n\n"
    },
    {
      "time": "20 Jan 2007 — 7:16pm",
      "content": "Thank you Dezcom.  \nThe technology from Xanté looks really pro. But it´s unnafordable for starting. I am looking for a US$500 price, any typedesigner or typedesign student/teacher got some info?\n\nmh.\n\n"
    },
    {
      "time": "20 Jan 2007 — 10:07pm",
      "content": "B/W laser printers are not going to \"emulate\" offset printing very well. Toner, which is how laser printers create images, is made of a fine, opaque plastic powder that is melted onto the paper. It tends to have a slight shine, and reflects light depending on how you tilt the page. Offset printing uses ink, which ranges from semi-opaque to translucent, and depending on the stock will be absorbed by the paper to a greater or lesser degree, resulting a duller, matte type appearance.\n\nThe printer's halftoning method can also create a look which is quite different from offset. Postscript devices typically use a circular halftone dot which can be adjusted via tint density and LPI. This is the same method RIPs on film and platemakers use. Essentially, you must have a postscript capable printer in order to print proofs that will be representative of what a common pre-press device will output. Postscript printers under $500.00 are few and far between.\n\nNon-postscript printers are less expensive, but generally have a fixed halftoning routine which won't look like the traditional \"round-dot\" you see in most printing. The ability to adjust a non-postscript printers halftone is usually limited to whatever features the manufacturer builds into the printer software. Otherwise, most any 600 dpi or better laserprinter will produce a decent b/w representation of offset printing.\n\nImagesetters and platemakers output at very high dpi (2400 to 4800) and are capable of 150-300 line screens. Laserprinters, ever very high end ones, can't create accurate halftone screens above 150 lpi or so, because the nature of toner is to \"splash\" when it is deposited on the paper. Above about 150 lpi, the gray just gets muddy or darker.\n\nI'd say your best bet would be to go with the entry-level HP Lasehjet 5200. It's around $1400.00. You'll get HP's postscript emulation (not true postscript, but close enough) and full bleed 11.0\" x 17.0\". Plus the HPs are workhorses. They just print well for a long time. I've been using mine for six years with no trouble.\n\nI've bought many things from Provantage over the years, and they are always the best on price & speed.\n\n[http://www.provantage.com/hewlett-packard-hp-q7543a-aba~7HEWD0K3.htm](http://web.archive.org/web/20150414233908/http:/www.provantage.com/hewlett-packard-hp-q7543a-aba~7HEWD0K3.htm \"http://www.provantage.com/hewlett-packard-hp-q7543a-aba~7HEWD0K3.htm\")\n\n"
    }
  ]
}
