{
  "id": "30773",
  "title": "Bringhurst / Serif magazine",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[Serif](http://web.archive.org/web/20080905140849/http:/www.typophile.com/wiki/Serif) magazine published a series of essays by [Robert Bringhurst](http://web.archive.org/web/20080905140849/http:/www.typophile.com/wiki/Robert%252BBringhurst) on typefaces and type styles. I had thought there was one more essay to be published when the magazine ceased publication. Can anyone confirm this? If so, was the essay ever published anywhere else?\n\nAnd have the essays ever been published in another form, book perhaps? I keep recommending them to students, but they seem to be unavailable.\n\nQuixote appears to be gone and none of the old email addresses work, though the web pages for Serif are still up.\n\nGeorge\n\n [‹ Hunt for a wiki demon :-)](http://web.archive.org/web/20080905140849/http:/www.typophile.com/node/30825 \"Go to previous forum topic\") [Myriad Tilt in a footnote? ›](http://web.archive.org/web/20080905140849/http:/www.typophile.com/node/1803 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905140849/http://www.typophile.com/user/4883\" title=\"View user profile.\">gthompson</a>",
  "time": "<br>",
  "uid": "4883",
  "comments": [
    {
      "time": " 21.Jan.2007 9.15pm",
      "content": "You could email Don Hosek.\n\n"
    },
    {
      "time": " 22.Jan.2007 7.04pm",
      "content": "None of the email addresses on the site work and I can’t locate any others. Quixote appears to be gone. If someone has a working email address for Hosek I would appreciate it.\n\nGeorge  \nI felt bad because I had no shoes, until I met a man who had no Bodoni\n\n"
    },
    {
      "time": " 24.Jan.2007 5.04am",
      "content": "George, there was one more essay to come, but I don’t believe the final one was submitted or written. I asked Bringhurst about it when I was working on my Raffia Intitals presentation for ATypI Vancouver. A completed set _would_ make a great book.\n\nI have occassional contact with Bringhurst and will confirm.\n\n"
    },
    {
      "time": " 24.Jan.2007 5.26am",
      "content": "George, I tracked down a site that appears to belong to the right Don Hosek. This page talks about his former editorship of Serif and his typographic expertise.\n\n[http://don.dream-in-color.net/books/archive.php4?iSubject=10](http://web.archive.org/web/20080905140849/http:/don.dream-in-color.net/books/archive.php4?iSubject=10 \"http://don.dream-in-color.net/books/archive.php4?iSubject=10\")\n\nThere is no email address, but there is a link to a contact form in the right nav... You can find links to some of his other sites, one of which includes a phone number. I won’t publish it here, but it’s on the site having to do with his academic career.\n\n"
    }
  ]
}
