{
  "id": "3077",
  "title": "Californian FB vs Berkley Oldstyle",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Posted on Wednesday, February 11, 2004 - 3:44 am:\n\n",
  "author": "vern9ine",
  "time": "11 Feb 2004 — 3:50am",
  "uid": "3043",
  "comments": [
    {
      "time": "11 Feb 2004 — 4:43am",
      "content": "Californian FB would be a definite step up from Berkley, while similar enough to keep your mag's look.   \n   \nIt's been carefully developed by Font Bureau for magazines, and has lots of different cuts for you to play with.   \n   \nI haven't tried it, but Benton Sans seems like it would work.   \n   \nYou could also look at [Amplitude](http://web.archive.org/web/20150123175004/http:/www.fontbureau.com/fonts/font_frames.tpl?cart=10765032092390155&fontname=Amplitude), and Storm's [Sebastian.](http://web.archive.org/web/20150123175004/http:/www.stormtype.com/sebastian.html)\n\n"
    },
    {
      "time": "11 Feb 2004 — 6:03am",
      "content": "The _source_ for our \"California Oldstyle\n\n"
    },
    {
      "time": "11 Feb 2004 — 7:23am",
      "content": "Fredrik,   \n   \nTo be honest, I have not seen it. Any links you know of? One would think they would follow slavishly the original. They were a customer of both Goudy and Lanston. They had us (before my time) cut 24 pt. Hadriano for Monotype Composition. The source for our Digital Hadriano came from that cutting.   \n [http://lanstontype.com/Goudy-Hadriano-Title.html](http://web.archive.org/web/20150123175004/http:/lanstontype.com/Goudy-Hadriano-Title.html)  \n   \n_Freight train pt. size for Monotype Composition._ Very rare. They were tired of hand-setting names on diplomas.   \n   \nRevivals are like Scotch, best served _on the rocks._\n\n"
    },
    {
      "time": "11 Feb 2004 — 8:56am",
      "content": "Berkeley Old Style is soother and less mannered than Goudy's original and the Font Bureau version, which is closer to the original. (Bringhurst compares the two in his 'Elements'). I think Berkeley Old Style is very well done, and in being less mannered may be of wider usability than the original. It really depdends on how mannered you want the look of your magazine to be.   \n   \nWhen I tried FB Californian on my laser printer, I found the spacing (or something) a bit odd, but I don't know if it's just my set-up.\n\n"
    },
    {
      "time": "11 Feb 2004 — 9:39am",
      "content": "Tiffany,   \n   \nYou will get it when finished. I value your opinion about product.\n\n"
    },
    {
      "time": "11 Feb 2004 — 9:53am",
      "content": "It seems like a good sans to match Berkeley/Californian would be one of Storm's designs.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Feb 2004 — 10:09am",
      "content": "I would also look at Goudy Sans, though this might be an overdose of Goudy for you. I personally love the warmth and expressiveness of his work, though I find it at times too quirky.\n\n"
    },
    {
      "time": "11 Feb 2004 — 11:21am",
      "content": "\\>Goudy sans doesn't feel very contemporary   \n   \nThis is true, though it might not be a problem, depending on the nature of the publication. Meta is, as Bringhurst points out, a modern version of Goudy Sans, and might work well with any of the versions of Californian.\n\n"
    },
    {
      "time": "11 Feb 2004 — 12:36pm",
      "content": "I am amazed at how quickly this many messages accumulated.   \n   \nThank you so much for all your input. I agree with many of the points made here. I find the Berkley more mild mannered than the Californian as well. Californian is very beautiful though and I would love to use it.   \n   \nHowever, the other quite dominant font in the magazine (though for select display size purposes) is a Didot, so I also have to consider what will work with that. I find I like the Meta but don't have a condensed form, if there is one. Benton Sans seems to give me lots of options, but it may not be much of a departure from Helvetica Neue. What do you think?   \n   \nWhat is hardest for me is that I want to bring a different feel to the publication but I can't be radical. Berkeley is viewed favorably, text fit and size work well as it is, and the rest sort of needs to harmonize.   \n   \nSometimes it is is easier to throw everything out and start from scratch, grid and all, but unfortunately I am challenged with small changes. It is difficult though to make font decisions when you don't have them yet to try out the changes, so all this is very insightful in making my choices.   \n   \nThe Goudy Sans again doesn't have a condensed which is very helpful in small column copy, which we do have as well.   \n   \nThanks, Vern\n\n"
    },
    {
      "time": "11 Feb 2004 — 12:50pm",
      "content": "There is a Meta condensed, though it is already on the narrow side to start with, like Goudy Sans. Benton regular is also in inherently narrower form than Helvetica, which is why I think it sets better, when at any length. Also Myriad Condensed is nice, and with its softness would probably go with Berkeley, if you stick with that. I don't see how Didot, which is wide like Helvetica, is a good match for the Goudy faces, but I am not looking at it, so I may be way off base.\n\n"
    },
    {
      "time": "11 Feb 2004 — 1:30pm",
      "content": "Gerald,   \njust want to tell you that I've spent a most enjoyable time visiting your site. The work is absolutely beautiful. Facinating to read and explore.   \nI didn't know about Lanston. I am learning ;-)   \nThanks for pointing me to it.   \nVern\n\n"
    },
    {
      "time": "11 Feb 2004 — 2:14pm",
      "content": "Vern, look at FB Agenda, it has a lot of condensed versions.\n\n"
    },
    {
      "time": "11 Feb 2004 — 6:14pm",
      "content": "This isn't really adding to the conversation here, but I just have to say it. After seeing the the original University of California Old Style in \"The Alphabet\", it became my favorite book face ever. I just had to share that since we're on the topic. FWG, wherever you are, damn fine work man!!!\n\n"
    },
    {
      "time": "11 Feb 2004 — 11:48pm",
      "content": "Matthew,   \nwhere is it that you saw the original. What is the \"Alphabet\"\n\n"
    },
    {
      "time": "11 Feb 2004 — 11:51pm",
      "content": "William,   \njust to clarify, Didot is used mainly for large dept heads and in the masthead, Berkley is main body text, and the Sans Serif is used throughout for various other tasks such as subheads, lists, captions, running heads, dept heads, etc... the various widths from one family come in very handy for that because it gives me enough variety to offer distinctive looks without using another font.\n\n"
    },
    {
      "time": "12 Feb 2004 — 3:42am",
      "content": "Vern,   \n   \n_The work is absolutely beautiful._\n\n"
    },
    {
      "time": "12 Feb 2004 — 9:34am",
      "content": "Vern   \n   \nI mentioned The Alphabet in a post about ten days ago, in response to a thread about books on type design. The Alphabet and elements of Lettering were produced very close together. I have elements in front of me, so I can tell you the date was 1922. I believe that elements of Lettering was around 1911 or 1912. The publisher is Mitchell Kennerley. Both titles were printed by Marchbanks Press.   \n   \nI also have a copy of The Alphabet, but it's buried somewhere in the printshop.   \n   \nBoth books have been composed by Fred and Bertha Goudy in 18 point Kennerley No 1. The other 18 point made was later with long descenders, designated as No 2.   \n   \nI have read that Goudy named the type for Mitchell Kennerley, with the agreement that Kennerley would pay to have the matrices engraved and supplied to Goudy for his further use at his foundry.   \n   \nA little more than a dozen years ago, Dover published the two titles as one book in perfect bound format. It shouldn't be too difficult to find a copy.   \n   \nBoth books are slim volumes, topping out at 48 pages or so. I found it amusing and human that in the final six pages or so of The Alphabet, goudy apparently ran out of letters in the cases of Kennerley, and these pages are peppered with wrong fonts (p's and H's I think). I believe he substituted with Garamont or Kennerley No 2. It's been along time since I have come across this book, so I can't recall. Of all the things Goudy detractors could have latched onto this is one that I have never noticed him being taken to task for.   \n   \nPersonally I find the imperfection charming and completely understandable. I can imagine that he was under pressure to supply the pages of type to the printer and had no time to turn on the caster pot to make the necessary sorts.   \n   \nAnyone have a theory?   \n   \nJim Rimmer\n\n"
    },
    {
      "time": "12 Feb 2004 — 9:40am",
      "content": "Gerald   \n   \nI want those patterns. Let's talk.   \n   \nJim\n\n"
    },
    {
      "time": "12 Feb 2004 — 9:48am",
      "content": "Jim   \n   \nI will be in Vancouver March 21.\n\n"
    },
    {
      "time": "12 Feb 2004 — 11:25am",
      "content": "Daniel,   \nthanks for pointing me to FB Agenda. I'll explore further.\n\n"
    },
    {
      "time": "12 Feb 2004 — 11:27am",
      "content": "Thanks Jim for the explanation. I might have to go looking for it ;-)\n\n"
    },
    {
      "time": "12 Feb 2004 — 2:13pm",
      "content": "Since this thread is primarily concerned with \"Californian\", I thought I would mention, if it has not already been done, that Goudy's \"Typologia\" is a master work worth reading.   \n   \nIt was written by him as a kind of magnum opus on his method of cutting type, and at the same time concerned with how he went about designing the face for the University. Goudy went through a lot of discussion with the institution, wherein he wished to name the type simply \"University Oldstyle\". The director of the Press thought the name to be too generic, so they settled on \"University of California Oldstyle. It was a bit of a mouthful, but the school wanted to have their name on it. Lanston Monotype did the production work on the type, making matrices for the use of the University. Some years later the type was licensed to Lanston, and they sold it under the name \"Californian\".   \n   \nThe patterns that Gerald Giampa has in his possession are of the lead \"boilerplate\" type, devised by Goudy, and were made by Goudy himself at Deepdene. These are the only full suite of patterns to survive the fire at Deepdene, simply because they were in use by lanston at the time of the fire.   \n   \nThe book is well worth having for more than one good reason. It shows Goudy's approach to a design, his method of rendering the design in metal, and his philosophy of type and design.   \n   \nThere are more than one page of large showings of the type. All-round this book has a lot to tell the new OR experienced designer, in that it gives an instance where a design is a surprising disappointment.   \n   \nSpeaking of disappointments: I lent my signed original copy to a journalist (didn't really know him) about 15 years ago, and haven't seen the bugger or the book since. Goodbye to a fine book and $300. Oh well . . .   \n   \nJim\n\n"
    },
    {
      "time": "12 Feb 2004 — 5:01pm",
      "content": "I only lend books to people who _make_ books - they're the only ones who really care enough.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Feb 2004 — 4:34am",
      "content": "I think Californian is excellent. I used it in a poetry annual and   \nthe results were lovely. You would not be disappointed with the switch.\n\n"
    },
    {
      "time": "11 Feb 2004 — 8:57am",
      "content": "Maybe I should have waited on licensing type from you, Gerald, ;) until you finished California Oldstyle.\n\n"
    },
    {
      "time": "11 Feb 2004 — 10:17am",
      "content": "I used Goudy Sans year ago for a client and simply became sick of seeing it. However, recently I was at a friend's printshop (for letterpress) and he showed me an invitation he had printed using it. It was as if a light came on ... Goudy Sans was warm and inviting again.\n\n"
    }
  ]
}
