{
  "id": "30796",
  "title": "Church Identity Take 2",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "I am the associate pastor at the First Presbyterian Church of Ukiah, CA and was brought on to work with youth and families and revitalize the congregation’s aging population. Step #1 was get a website with a reasonable, simple design, and a logo to suit it.\n\nMy first attempt was posted and critiqued here:  \n [http://www.typophile.com/node/30295](http://web.archive.org/web/20131106194846/http:/www.typophile.com/node/30295 \"http://www.typophile.com/node/30295\")\n\nTherefore, you may want to take a minute to look over some of the conversation from before if you are new to it. Needless to say, \"Hire a professional\" is a recommendation that I have already considered.\n\nHere is my second attempt at a church logo. Here I chose two main images: a cross and a grape vine. The cross is included for obvious reasons. The grape vine is both a scriptural allusion (Jesus likens himself to a grape vine, and his followers are the branches who bear fruit), and a reference to the agricultural industry of the area, in which there are a lot of vineyards.\n\n(Side note: I don't think that one necessarily needs a cross to convey Christianity, but I have had that discussion with my boss and others in the church, and a church logo without a cross is too outside the box right now).\n\nAs I said before, please let me know what you think with frankness and forthrightness. I am not a professional designer, but I am very teachable.\n\n| Attachment | Size |\n| --- | --- |\n| [fpcu logo 22 jan 2007.jpg](http://web.archive.org/web/20131106194846/http:/typophile.com/files/fpcu%20logo%2022%20jan%202007.jpg) | 101.17 KB |\n\n",
  "author": "nvhladek",
  "time": "22 Jan 2007 — 2:32pm",
  "uid": "16005",
  "comments": [
    {
      "time": "22 Jan 2007 — 3:15pm",
      "content": "I only have a second, but I generally like it (much, much better than your last attempt). My two suggestions are to work on the curves of the curling top of the grape vine (I assume you're using a vector illustration program like Illustrator or Freehand), as they're a bit abrupt now, not as smooth as they should be, and to get rid of that thick black stroke around everything. You might try putting a white stroke around the grape vine to break apart the cross appropriately, but it may work fine without one.\n\n"
    },
    {
      "time": "22 Jan 2007 — 4:33pm",
      "content": "Check out this book \"The Cross as Symbol & Ornament\" by Johannes Troyer, Westminster Press, 1961 - if you can not find it a Library try Booksold.com (add all). Your cross is in need of better proportions and needs to be less stiff - the stroke must go on your grape vine, it is just too heavy.\n\n"
    },
    {
      "time": "22 Jan 2007 — 5:35pm",
      "content": "Hm, it looks a bit 'clip-arty', if you know what I mean. It could be the black stroke or the general style of drawing, but it's a bit too cartoonish for my taste.  \nI think a logo should be a bit more to the point, without too much confusion. A bit more iconic, so to speak.  \nHave you--for example--considered what will happen if the logo is printed in black&white/greyscale or with a raster (will the difference in colors still be visible), or what happens when it's drastically reduced in size, etc.?\n\n"
    },
    {
      "time": "22 Jan 2007 — 9:53pm",
      "content": "Yes, it looks much better without the lines. Do you think it makes it look less cartoonish? Also, I had the vine interact a little bit more. And I ordered the book. Finally, these images scale better than the horrid black lines. Any new thoughts?\n\n ![](http://web.archive.org/web/20131106194846im_/http:/typophile.com/files/fpcu%20logo%2022%20jan%202007%20no%20lines_5472.jpg)\n\n"
    },
    {
      "time": "22 Jan 2007 — 9:54pm",
      "content": "Here it is in greyscale. Working on black & white.\n\n ![](http://web.archive.org/web/20131106194846im_/http:/typophile.com/files/fpcu%20logo%2022%20jan%202007%20no%20lines%20b&w_4024.jpg)\n\n"
    },
    {
      "time": "22 Jan 2007 — 10:16pm",
      "content": "I think the \"cartoony\" effect you're seeing is caused by the scale issues. Whole bunches of grapes are typically not the same size as a single grape leaf -- except, of course, unless they're champagne grapes :)\n\n"
    },
    {
      "time": "23 Jan 2007 — 2:54am",
      "content": "Yeah, without the black lines it's better.  \nI think you forgot to attach the greyscale image? :)\n\n"
    },
    {
      "time": "23 Jan 2007 — 6:47am",
      "content": "I think the black lines added a hint of stained glass, although a touch too heavy, interweaving the vine and cross pulls together the elements. The cross-bar, to my eye, is a bit too high on the vertical. Do you intend to use type with the image?\n\nTim\n\n"
    },
    {
      "time": "23 Jan 2007 — 8:36am",
      "content": "I think the clip art effect is caused by the fact that there are too many colours, and too many bright colours. Pick one item you want to stand out (the vine, the grapes, the leaves, the cross) and make the colour of it contrast with the rest. At the moment, all elements are competing for my attention. Also, watch your curves. They're looking lumpy.\n\nI actually liked the direction of your original logo (from the previous thread) better than the vine, but of course, it's up to you.\n\n- Lex\n\n"
    },
    {
      "time": "23 Jan 2007 — 8:38am",
      "content": "All your leaves are the same pattern, so make them different to add more interest. The vine feels loose and floppy. I like the darker green,but not the electric green. Consider making the cross thicker and short.\n\nSketch vines and crosses until you get a reasonable balance between the two.\n\ngenerally, you should start off in black and white so you can focus on composition.\n\n"
    },
    {
      "time": "23 Jan 2007 — 5:04pm",
      "content": "<cite>generally, you should start off in black and white so you can focus on composition.</cite>\n\nThat's actually good advice, which I should have added to my post.  \nI usually start logos in completely black and white as well, and focus on the colors later. Colors are a distraction, when you need to establish good contrast and composition. :)\n\n"
    },
    {
      "time": "24 Jan 2007 — 9:48pm",
      "content": "Perhaps the vine and grape theme works more elegantly with some abstraction? I did a sketch to illustrate what I mean; what do the typophiles think?\n\n ![](http://web.archive.org/web/20131106194846im_/http:/typophile.com/files/cross_4609.jpg)\n\n"
    },
    {
      "time": "25 Jan 2007 — 11:59am",
      "content": "If you weigh the use of the mark verses a commercial logo, then its fine the way it is. It doesn't need to be accurate or realistic. It just has to convey the point and I feel it does.\n\n"
    },
    {
      "time": "26 Jan 2007 — 10:33am",
      "content": "I really like Alaska's solution. I'm in that demographic that you're trying to target and the logo that you made reminds me of those horrible textbooks we had to read in Sunday school.  \nNot only is Alaskan's idea beautifully simple and elegant, it's also very easy to use in a variety of applications. I can just picture it etched into glass somewhere.  \nIt's also the opposite of what I would expect from a church logo. It looks high-end without being too designer or stuffy.\n\n-Scott\n\n"
    },
    {
      "time": "26 Jan 2007 — 12:44pm",
      "content": "Thanks, Scott -- I appreciate the compliments. If the church would like to use it, that's fine - I'll consider it my volunteer work for the week. I believe in karma.\n\nAlaskan\n\n"
    },
    {
      "time": "31 Jan 2007 — 3:28pm",
      "content": "I really like Alaskan's solution as well. I used it as an inspiration for my own simplified form, but with a more complex leaf. I'm not giving up on using Alaskan's design ... it's brilliant, and I'm very grateful for it.\n\nFor your consideration, however, here is my Alaskan-inspired design:\n\n ![](http://web.archive.org/web/20131106194846im_/http:/typophile.com/files/fpcu%20logo%2030%20jan%202007_4894.jpg)\n\n"
    },
    {
      "time": "31 Jan 2007 — 3:28pm",
      "content": "Dang it ... it's not uploading ... let's try again.\n\n ![](http://web.archive.org/web/20131106194846im_/http:/typophile.com/files/fpcu%20logo%2030%20jan%202007_5631.jpg)\n\n"
    },
    {
      "time": "31 Jan 2007 — 3:29pm",
      "content": "OK. Nevermind ... I'll try later.\n\n"
    },
    {
      "time": "31 Jan 2007 — 3:38pm",
      "content": "I'm glad you like it - email me (click my name, then \"contact\") if you'd like to discuss it further.\n\nAlaskan\n\n"
    },
    {
      "time": "9 Feb 2007 — 3:31pm",
      "content": "nvhladek emailed me this file -- what do you guys think of his newest version?\n\n ![](http://web.archive.org/web/20131106194846im_/http:/typophile.com/files/fpculogo_3665.png)\n\n"
    },
    {
      "time": "9 Feb 2007 — 3:36pm",
      "content": "I think it needs to lose the serration. The perfect symmetry of the leaf bothers me as well.\n\n"
    },
    {
      "time": "10 Feb 2007 — 4:22pm",
      "content": "I agree completely with Spire. With the outline, the leaf is too harsh compared to the organic lines of the vine. The serrated edges on the leaf will definitely not look good at small sizes either.\n\n"
    },
    {
      "time": "11 Feb 2007 — 3:06pm",
      "content": "I'm reading the leaf as a maple leaf. It looks like it's some sort of Canadian denomination of Christianity.\n\nThe drawing style of the leaf doesn't match the drawing style of the vines. The outline is the reason for this. Maybe extend the black under the vines outside the cross, sort of as a shadow. It's kind of hard to explain, but if you've ever seen Mike Mignola's (Hellboy) comics, take a look at what he does when a detail is on the border between light and shadow.\n\n- Lex\n\n"
    }
  ]
}
