{
  "id": "30795",
  "title": "Blender 3D is brilliant.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "If, like me, you have wished you could add 3D to your design repertoire, but thought the financial expense and, moreover, the investment in learning time was too high to make it worthwhile for the few occasions it would be of use, then may I suggest...\n\n**[Blender](http://web.archive.org/web/20131010080822/http:/www.blender3d.org/cms/Home.2.0.html)**\n\nBlender is _\"open source software for 3D modeling, animation, rendering, post-production, interactive creation and playback. Available for all major operating systems under the GNU General Public License.\"_\n\nI thought I didn't have the time or skills to get involved with 3D, but discovering the impressive Blender gallery by accident, and then seeing the software's relatively small download size, I thought I would take a quick look.\n\nTo my surprise, after a little while fiddling about I had created something that wasn't complete crap. Each time I have got stuck on something either a search of Blender's comprehensive wiki, a thread on one of the QA forums or a look at one of the video tutorials has solved the problem. There are lots of resources, objects, materials, textures etc for dowloading too. Obviously, I still have loads to learn, but it's very rewarding and nowhere near as hardgoing as I had first feared.\n\nI'm excited about this potential new string to my bow. If I get good enough to use it for a design job I will definately donate toward further development.\n\nHere's some related links...\n\n**[Blender Gallery December 2006](http://web.archive.org/web/20131010080822/http:/www.blender3d.org/cms/Gallery.55.0.html)**\n\n**[Elephants Dream](http://web.archive.org/web/20131010080822/http:/www.elephantsdream.org/)**was created mostly with Blender and is the first ever open source movie.\n\n**[Blender Nation](http://web.archive.org/web/20131010080822/http:/www.blendernation.com/)**is a blog with Blender news, tutorials and links...\n\nSome easy entry **[Blender Video Tutorials](http://web.archive.org/web/20131010080822/http:/showmedo.com/videos/Blender)**to get you started. There are many more on other websites.\n\n(Sorry, moderators, if this is not an appropraite post for Typohile, or should have been posted in another location or in the wiki.)\n\n",
  "author": "wormwood",
  "time": "22 Jan 2007 — 1:39pm",
  "uid": "14065",
  "comments": [
    {
      "time": "22 Jan 2007 — 2:06pm",
      "content": "My son Tristan, 13 years old, has been using Blender for about 1 year, and, with very little help, certainly not from me, has done many very great things with it, as well as helping me to learn it a bit. It is an amazing program, but for some the menus and submenus etc. might be a bit daunting. There is a learning curve here. However, Tristan has done some truly amazing things, to me, like a fluid simulation, a car design, etc. The high school he will be attending will probably use Blender in conjunction with Maya and 3D Studio Max. At least they will use Blender and point the students in that direction while at the same time using the other stuff. Seeing Maya in the downloadable learner version I notice many similarities between the two programs. My son had the links you've posted but not all. Thanks. He is a fast learner. There is certainly a way to use type with this program but I'm still learning the basics. The program, while available for Macs and PCs definitely requires a fast processor and very good video card. My old G3 works but I have to cut the colors from millions to thousands and reduce the resolution. Have fun everyone!\n\n"
    },
    {
      "time": "22 Jan 2007 — 5:25pm",
      "content": "Actually, there are some people who combine type and 3D-animation quite effectively already. For example, see [Renascent.nl](http://web.archive.org/web/20131010080822/http:/www.renascent.nl/motion.htm). For example check 'World of Poetry', 'Offf BCN 06' or 'Devil's Drug' on that site. Or the rest, most of it is very beautiful. This is animation, but the same can apply for static images, of course.\n\n"
    },
    {
      "time": "22 Jan 2007 — 6:29pm",
      "content": "C'mon Typophiles, are you sure I can't tempt you with this luscious chrome glyph?\n\n ![](http://web.archive.org/web/20131010080822im_/http:/typophile.com/files/Infinity01_5602.jpg)\n\nA bit tacky? Mmm, maybe. But the possibilities are infinite.\n\nAnd it rendered in under a minute.\n\n"
    },
    {
      "time": "22 Jan 2007 — 9:27pm",
      "content": "I've used 3D Studio Max, and I've tried Blender. 3DSMAX has a very intuitive interface - I figured out the basics in less than an hour by just playing around. Blender has practically no interface by comparison. It's very tricky to use - the sheer number of keyboard shortcuts one must learn is overwhelming. Yes, there are lots of resources to help you learn it, but in my opinion if I can't figure it out on my own, it's not worth my time.\n\n- Lex\n\nNote: I haven't looked at Blender in about a year - maybe there have been some improvements - let me know if this is the case.\n\n"
    },
    {
      "time": "23 Jan 2007 — 4:15am",
      "content": "Lex, I've only been using Blender in the last 2 weeks. I don't know what the interface was like when you tried it a year ago so I can't say how it may have improved . It does appear to get frequent updates though.\n\nI've not used 3ds Max, but I have watched a friend using it. I thought Max's interface looked rather daunting, with lots of cryptic icons, whereas Blender mostly has text buttons. I guess it comes down to personal preference.\n\nYes, Blender was designed to be used with one hand on the keyboard for all the shortcuts, but you certainly don't have to know them. Just hit W and you get a contextual menu with all the relevent options, or hit the Space Bar and you get a menu which has all the keyboard shortcut tasks anyway. If you can't figure something out then the option will normally be in one of those 2 menus.\n\nI havn't found Blender's learning curve to be that much steeper than other graphics software.\n\nThere is another reason Blender may be worth your time. A new copy of 3ds Max is $3,495 whereas Blender is free. If your design rate is $50 an hour then that's 70 hours work you don't have to do to pay for it. Max's last upgrade was $795, but obviously Blender upgrades are free too.\n\n ![](http://web.archive.org/web/20131010080822im_/http:/typophile.com/files/Infinity01b_3956.jpg)\n\n"
    }
  ]
}
