{
  "id": "30811",
  "title": "How should \"sans\" be pronounced?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm sure this will have been covered before, but can't seem to find anything.\n\nIs the correct pronounciation the French, or to rhyme with \"man's\", or both?\n\nI've always used the latter for typefaces, but I think I tend to use the French the rest of the time (this may just make me a snob, though).\n\nBut sometimes I hear \"san-serif\" said quickly with a long \"a\" -- \"saanserif\".\n\nWhat's the definitive answer?\n\n",
  "author": "elliot100",
  "time": "23 Jan 2007 — 4:05am",
  "uid": "7181",
  "comments": [
    {
      "time": "23 Jan 2007 — 4:49am",
      "content": "Just say:\n\nSerifenlose Linear-Antiqua  \nThat's correct. ;-)\n\nGeorg  \nPS: To be serious - its very honest of an anglo-american to try to pronounce the lots of german or, here, french words, correctly.  \nFor german font names and german designers I already offered in this forum to build up a downloadable .wav file on my website.  \nBut I guess the guys thought I was joking and I got no response.\n\n"
    },
    {
      "time": "23 Jan 2007 — 5:12am",
      "content": "I think \"correct\" depends upon where you are. In America, you will most often hear sans as in mans and this is the accepted way. In France, you will surely hear the correct French pronunciation. As the saying goes, \"When in Rome...\"\n\nChrisL\n\n"
    },
    {
      "time": "23 Jan 2007 — 5:47am",
      "content": "Ah, but sans is not derived from the French, but the Latin. So we should be pronouncing it as the Romans did. (Don't ask me what that is, though.)\n\n"
    },
    {
      "time": "23 Jan 2007 — 5:49am",
      "content": "I meant in English speaking countries - wondered if it fell into the category of words originally borrowed from a foreign language but now considered part of English and pronounced according to English rules. eg theatre, restaurant, garage, hotel, Paris. In the UK it would generally be considered pretentious to pronounce these as French.\n\nEdit: If it is direct from Latin then I guess to rhyme with mans is the one.\n\n"
    },
    {
      "time": "23 Jan 2007 — 6:16am",
      "content": "The standard throughout my education and career thus far is to say \"sans\" like \"man's\" and \"san-serif\" either like \"man\" or \"mahn\" according to preference.\n\nI prefer the latter. Then again, I say \"you-nee-vair\" rather than \"universe\", so I tend towards that type of pronunciation.\n\n"
    },
    {
      "time": "23 Jan 2007 — 6:40am",
      "content": "If you read at the end of James Mosley's [update on his history of the sanserif](http://web.archive.org/web/20150218044434/http:/typefoundry.blogspot.com/2007/01/nymph-and-grot-update.html), you will see that the term Sans-serif or 'sanserif' is not French but a neologism by the English typefounder Vincent Figgins. He also says that the French tended to call 'antique', as in 'Antique Olive', what the English call 'sanserif'.\n\nSince 'sanserif' is an English neologism mixing French and (apparently) a mispronounced Dutch word, the correct pronounciation in English rhymes sans and man's. This is the way both the Concise Oxford and the Webster's Collegiate dictionaries have it. So unlike a huge number of typeface names, here there is actually an authoritative answer on correct pronounciation.\n\nIt is often something of a quandry in English whether to try to pronounce a foreign word as in the original language, or Anglicize it. In this case 'sanserif' is an English word, so go with it as English and be happy :)\n\nps. I've read that in inventing neologisms, it is recommended to stick within one foreign language, if part of the word is foreign. So, for example, 'television', which mixes Greek and Latin, is bad practice. 'Sanserif' is like that, but at least it resolves the question of how to pronounce it: not French, not Dutch.\n\nSince English is in fact a 'Creole', a product of colonials who couldn't quite manage the language of their French masters (William the Conquerer) this kind of mixed-up word fits very happily into our language :)\n\npps. Bringhurst, evidently uncomfortable with the bastard word 'sanserif', uses his own neologism \"unserifed\" typefaces. To me this is a rare false note in Bringhurst's beautiful use of language. I think it is better to embrace the wild multicultual mix that is English, and not prissily 'correct' a perfectly serviceable and well established word of dubious origins.\n\n"
    },
    {
      "time": "23 Jan 2007 — 6:42am",
      "content": "I think the people from out of anglo-american countries know the pronounciation of you guys. And they understand the language-problem. Its the same situation with you reading articles from people like me or other germans/french/spanish e.g.: I bet it smells funny for you. But its very rare to see people in US forums laughing about it or critiziing it.\n\nPronounce it how you want - and be sure, everyone in our countries know what you mean.\n\nGeorg\n\n"
    },
    {
      "time": "23 Jan 2007 — 7:12am",
      "content": "Thanks guys - that about covers it!\n\n"
    },
    {
      "time": "23 Jan 2007 — 12:32pm",
      "content": "Not quite.  \nSans is a good ol' Middle English word that hung around.  \nShakespeare used it in \"As You Like It,\"\n\n...Last scene of all,  \nThat ends this strange eventful history,  \nIs second childishness and mere oblivion,  \nSans teeth, sans eyes, sans taste, sans everything.\n\nElvis didn't get quite that far for his monologue in \"Are You Lonesome Tonight\" :-)\n\n"
    },
    {
      "time": "23 Jan 2007 — 12:37pm",
      "content": "A PSALM OF LIFE by Henry Wadsworth Longfellow  \nWhat The Heart of the Young Man Said to the Psalmist\n\n“And, departing, leave behind us  \n Footprints on the sans of time;”\n\nChrisL\n\n"
    },
    {
      "time": "23 Jan 2007 — 1:20pm",
      "content": "In Sans Souci (1952), Peggy Lee sang, \"Sans souci, they got no room for someone like me,\" (her lyrics).  \nIt's a French phrase meaning carefree. Miss Lee pronounced \"souci\" in the French manner, but dropped the \"s\" on \"sans,\" more like Spanish.\n\n"
    },
    {
      "time": "24 Jan 2007 — 8:15am",
      "content": "In French, when saying \"sans\" you also drop the S. It's pronounced with a close \"a\", just like the words \"blood\" (sang) and \"one hundred\" (cent). The s is only pronounced when connecting it with some words that begin with vowels, in which case they join and the s has a z sound.\n\nIn Brazilian Portuguese most people say \"Sans\" as \"sãs\" (a nasal a), sort of like english \"suns\", but with a \"weaker\" n.\n\nI'm all for each language to use its \"own\" pronunciation, especially for words that come up all the time in conversations (like sans) -- it usually keeps both speaker and listener more relaxed.\n\n"
    },
    {
      "time": "24 Jan 2007 — 8:29am",
      "content": "@ Nick: \\< Sans is a good ol’ Middle English word that hung around.\\>\n\nWasn't it borrowed from the French in the 13th/14th centuries? My sense is that it was used rarely, and even then only to show one's \"continental\" learning, which is why ol' William had Jaques (with wordly/learned pretensions) use it so ostentatiously. I think its appeal was precisely that it was so consciously non-english.\n\n"
    },
    {
      "time": "24 Jan 2007 — 9:32am",
      "content": "To bring things back to type, William Caslon junior (the Caslon who cast the ‘Egyptian’ type) advertised ‘Sanspareil’ (or maybe ‘Sans Pareil’) types, that is big types cast in a new kind of matrix, in 1810.\n\n‘Sanspareil’ means the same as ‘Nonesuch’, or indeed ‘Nonpareil’. (Someone ordered a little italic called ‘la Non Pareille’ from Robert Granjon in 1551.) The French 80-gun ship _Sanspareil_ was captured on 1 June 1794, and became a ship of the same name in the Royal Navy. The Sanspareil Theatre opened in the Strand in London in 1806 and kept the name until 1819, when it changed to the Adelphi. And the _Sans Pareil_ steam locomotive was the runner up to Stephenson’s _Rocket_ in the Rainhill trials of 1829 which introduced the railway age.\n\nI suspect that this was how the Sans of Sans-Serif got into the language.\n\n"
    },
    {
      "time": "24 Jan 2007 — 9:51am",
      "content": "OED puts sans (as a preposition) first use at c.1320.\n\nTim\n\n"
    },
    {
      "time": "24 Jan 2007 — 10:36am",
      "content": "\\>_I suspect that this was how the Sans of Sans-Serif got into the language_\n\nOr rather, how Sans got into Sans-Serif. The 'sans eyes' etc. of _As you like it_ must have helped to keep the word around.\n\n"
    },
    {
      "time": "24 Jan 2007 — 11:23am",
      "content": "The thing about all the questions about the correct way to say nearly any of the typo-terms is that there are not enough of us & we are too diverse culturally to form a definable or solid lump of spoken culture. There are lots of ways of saying things now and if we look back it has been this way since the beginning. Maybe in the electronic/webospheric age that will change, but I don't think so. Frankly, I like the diversity. It's a kind of richness even if it is confusing.\n\n"
    },
    {
      "time": "24 Jan 2007 — 11:28am",
      "content": "I'm convinced, James.\n\n\\*\\*\\*\n\nAll this talk about sans begs the question of \"serif\".\n\nIf \"sans\" was a trendy French word in the early 1800s, did English speakers think that \"serif\" was a French or Oriental word, and pronounce both with long vowels in proper \"foreign\" manner (rhymes with Omar Sharif) --or with short vowels as is the norm (in my experience) today?\n\nIf \"serif\" was derived from the Dutch schreef (line), pronounced laboriously in two syllables as it is read, then the original pronunciation of sans serif was probably with long \"a\" and \"i\", in an impressively erudite manner -- maybe with the tongue slightly in cheek.\n\nHence, such a magnificent term for so lowly an artefact is a Euphemism, and, through its preposterous pedantry, an in-joke -- a parody of the pretension with which merchants dress up their most humble wares.\n\n"
    },
    {
      "time": "24 Jan 2007 — 11:49am",
      "content": "\\>begs the question\n\nI prefer \"raises the question\". Almost everybody now says 'begs the question' instead of 'raises the question'. Still, as a one-time teacher of logic I regret the loss of the original meaning of 'begging the question': the logical fallacy in which you simply re-assert, in a disguised form, the claim that is in dispute.\n\n"
    },
    {
      "time": "24 Jan 2007 — 11:52am",
      "content": "With apologies to the Clash - schreef don't like it...\n\n"
    },
    {
      "time": "24 Jan 2007 — 12:20pm",
      "content": "_I prefer “raises the question”._\n\nThat would have been somewhat prosaic, as I was in fact discussing question-begging.\n\nMy point was that the question of the correct pronunciation of \"serif\" is not answered (nor even asked) by determining the pronunciation of \"sans\". Therefore, there is a logical fallacy in assuming, for no proven reason, that \"serif\" will be pronounced in a certain way, dependent on the pronunciation of \"sans\".\n\n(That's the long version of _All this talk about sans begs the question of “serif”._)\n\nI then established a logical relationship between the pronunciation of the two halves of the term sans serif.\n\n"
    },
    {
      "time": "24 Jan 2007 — 12:42pm",
      "content": "\\>I was in fact discussing question-begging.\n\nHa! Think you can out-pedant me, Nick? I'll show you what useless, annoying pedantry is all about!\n\nEliot's original question was about how to pronounce the 'sans' part of 'sanserif', not about how to pronounce the 'serif' part of 'sanserif'. There was no possibility of begging of the question about 'serif' since that question had never been mooted.\n\nAlso changing the meaning of the question under discussion is another logical fallacy: equivocation :)\n\nFor some reason, perhaps because French was once the mark of an educated person, we in English are tempted to Frenchify some words of French origin--which ones is capricious, as over half of English comes from French. The same thing never happens with Dutch words, which we have even less clue how to pronounce.\n\n"
    },
    {
      "time": "24 Jan 2007 — 12:48pm",
      "content": "Just when you thought you couldn't take the tick out of a pedant, you find that gnawing itch that can only come from a tick feasting on your outer-membrain :-)\n\nChrisL\n\n"
    },
    {
      "time": "24 Jan 2007 — 1:11pm",
      "content": "_Ha! Think you can out-pedant me, Nick?_\n\nI concede. You the Man, Bill.\n\n"
    },
    {
      "time": "24 Jan 2007 — 1:14pm",
      "content": "Yeah, I'm much more annoying :)\n\n"
    },
    {
      "time": "24 Jan 2007 — 1:16pm",
      "content": "\\> For some reason, perhaps because French was once the mark of an educated person, we in English are tempted to Frenchify some words of French origin\n\n**Homer:** Hmm. I wonder why he’s so eager to go to the garage?  \n**Moe:** The “garage”? Hey fellas, the “garage”! Well, ooh la di da, Mr. French Man.  \n**Homer:** Well what do _you_ call it?  \n**Moe:** A car hole!\n\n"
    },
    {
      "time": "24 Jan 2007 — 1:33pm",
      "content": "James, I thought \"nonpareil\" meant \"without peer,\" but it has been ages since my high school French.\n\n"
    },
    {
      "time": "24 Jan 2007 — 2:33pm",
      "content": "Craig!\n\nTotally! Groovy! Boss! Bitchin! or whatever is hip today for well done :-)\n\nChrisL\n\n"
    },
    {
      "time": "24 Jan 2007 — 2:46pm",
      "content": "I pronounce it no\n\n"
    },
    {
      "time": "24 Jan 2007 — 2:52pm",
      "content": "LOL Dan!\n\nChrisL\n\n"
    },
    {
      "time": "24 Jan 2007 — 3:00pm",
      "content": "Was that simpsons quote pronounced by stressing the first or second syllable?  \nI think of this as quite french: /gəˈɹɑːʒ/ (unused)  \nThis as something of a hybrid: /ˈgæɹɑːʤ/ (repair/upgrade facility)  \nAnd this as english: /ˈgæɹɪʤ/ (outhouse to park in, dealership)\n\np.s. The forums need to use a better typeface! How about Gentium?\n\n"
    },
    {
      "time": "24 Jan 2007 — 3:06pm",
      "content": "Nick how about Helvetica\n\n"
    },
    {
      "time": "24 Jan 2007 — 3:54pm",
      "content": "Dan: Helvetica as supplied on my OS doesn't support IPA so it would be just as useless (Lucida Grande is the only one that does, but I expect everyone here has Gentium too). But the font size here is small indeed, too small to use a serif.  \nIt also overrides my browser's default text size (20px) for 12pt Georgia which I can't read past sunset unless I sit forward and squint at the screen.\n\n"
    },
    {
      "time": "25 Jan 2007 — 5:43am",
      "content": "Nick, your pronunciations of \"garage\" are English English. The one you describe as \"quite French (unused)\" is how it is always said in America.\n\n"
    },
    {
      "time": "25 Jan 2007 — 6:15am",
      "content": "The Simpsons quote reminded me of my younger years, when I usually pronounced car brand names such as Corvette, Peugeot etc like they should be pronounced only to be ridiculed by my friends for trying to be too fine. Finns (especially young ones) tend to pronounce foreign words like Finnish, just the way it's written.\n\n"
    },
    {
      "time": "25 Jan 2007 — 6:17am",
      "content": "I can't see the pronounciation markup there for some reason, but I pronounce it a equally stressed \"garaaje\" -- and often get mocked for doing so. I blame my Francophile parents.\n\nHowever, even I know that it's definitely \"garridge\" techno.\n\n"
    },
    {
      "time": "27 Jan 2007 — 5:46pm",
      "content": "_Since English is in fact a ‘Creole’, a product of colonials who couldn’t quite manage the language of their French masters (William the Conquerer) this kind of mixed-up word fits very happily into our language_\n\nBut let us not forget that William the Bastard (the name he was known by before the spin doctors rewrote history) spoke Norman (Norseman) French.\n\n"
    },
    {
      "time": "27 Jan 2007 — 8:34pm",
      "content": "_Since English is in fact a ‘Creole’,_\n\nIt's true that English absorbed a few foreign words and mannerisms between William I and Henry IV (the first English-speaking King since before William I), but its basic vocabulary and grammar remained the same -- Germanic. A Creole or pidgin language is a different kettle of fish.\n\n"
    },
    {
      "time": "28 Jan 2007 — 3:40am",
      "content": "The creolization debate in regard to Middle English depends largely on how latitudinarian one's theory of creolization is, and thus how little change one requires to consider something to be a creole language. The proponents tend to take the view that any structural change that happens in a contact situation can be seen as the result of creolization, while the opponents tend to take the view that a change shouldn't be seen as creolization unless it is part of a package of total structural change.\n\nMiddle English has been argued to be a result of creolization of Old English with either Old Norse (Vikings) or Norman Old French (Normans), or in the most extreme (Bailey and Maroldt) version of the hypothesis, both (plus Ile-de-France French due to later medieval contact) in successive stages. The strongest case can be made for Old Norse, which had much more effect on grammar and core vocabulary than French did. But it's highly debatable among linguists whether that effect should be considered creolization, particularly since Old English and Old Norse were so closely related.\n\n"
    },
    {
      "time": "28 Jan 2007 — 8:08am",
      "content": "David, thanks for your interesting window to the history of the evolution of English. I didn't know the history, and I wrote that English is a Creole partly in jest. I see from you there is in fact a serious scholarly debate about it.\n\nMy wife speaks a real Creole, and I've visited the place where she grew up, so I've been exposed a bit to the real thing. There are some striking differences between the structure of English and the kind of Creole my wife speaks, but also striking similarities. The Creole she speaks is much more dominantly French in origin. As Nick notes, the dominant source of the most commonly used words in English is Germanic. However there is huge amount of French, with estimates on the internet ranging from 30% to 60%. For example, the previous two sentences are about half/half Germanic and French origin, I am guessing.\n\nThe similarity of my wife's Creole and English is that a lot of the conjugation of French is wiped out. English is much less inflected than German. In this [interesting review article](http://web.archive.org/web/20150218044434/http:/www.chass.utoronto.ca/~cpercy/courses/6361ryan.htm) on the debate over English as a Creole, the author notes that a defining characteristic of a Creole is that it started as a 'pidgin' language, a language of underlings trying to speak the language of foreign overlords, and acquiring their vocabulary with a radically simplified grammar, based on their own language of origin.\n\nAccording to the wikipedia article on [Inflection](http://web.archive.org/web/20150218044434/http:/en.wikipedia.org/wiki/Inflection), Old English was inflected to a similar extent as German, but lost inflection in the transition to Middle English. This makes me suspect that a 'pidgin' French created by Old English speakers trying to speak French was indeed a factor. However, the article on inflection also notes that the current Scandinavian languages also lost their inflection, which Old Norse had. So there may be another process at work.\n\nI would be interested to know the theories of why English and Scandinavian languages became less inflected. I see the references in the Wikipedia article, but won't be going to them. I have this font to finish :)\n\n"
    },
    {
      "time": "28 Jan 2007 — 11:49am",
      "content": "<cite>I would be interested to know the theories of why English and Scandinavian languages became less inflected.</cite>\n\nThere's a general tendency over time for languages to add new features and simplify old ones all the time; for example in English over the past several generations the number of derivational affixes in colloquial use has increased through borrowing from Latin and Greek (e.g., _hyper-_), while subjunctives seem to be dying out in colloquial speech. How likely something is to resist the tendency to simplify depends on things like how much it's used and whether it's supported by clear sound patterns or parallel grammatical structures within the language. In the Germanic languages, accent tends to be toward the start of the word but the inflections are mostly at the end, and unstressed parts of the word are more likely to simplify, other things being equal. In this respect German and especially Icelandic are the odd ones in retaining their inflection systems.\n\nFor English, you can take your pick of two possibilities: either creolization or this normal simplification process. The simplification of Middle English seems to have occurred earliest and most thoroughly in northern England, where the most Viking settlement had occurred, but it has also been pointed out that the sound system in northern Old English seems already to have been changing in ways that gave less support to the inflection system. I'm sure the question will still be wide open when you get your font done :)\n\n<cite>For example, the previous two sentences are about half/half Germanic and French origin, I am guessing.</cite>\n\nThere's a lot of Latin in modern English too (meaning words that came into English directly from Latin rather than via Old French). In those two sentences, I get the following (omitting Nick's name, which comes from Greek):  \nfrom Old English: as, the, of, most, -ly, in, English, is, however, there, French, with, on, net, from, thirty, to, sixty  \nfrom French: note, source, common, use, huge, amount, range  \nfrom Latin: Germanic, estimate, inter-, percent  \nfrom either Latin or French: dominant\n\nBut your general point is quite right - the Latin words tend to be \"educated\" terminology, while the French words are basic functional vocabulary and quite pervasive in the language.\n\nPart of the question that's debated among linguists, as far as I can tell as an outsider, is whether you see a creole language as a new creation or creolization as a process that happens to existing languages. The thing that makes English different from classic creole languages like those of the West Indies is that there's quite a lot of continuity in the grammar as well as in core vocabulary from Old English. Some things were simplified, like noun inflections (from four cases to one and a half) and person-marking in verbs (from four categories to two), but a lot of the other grammatical features survived, more than usual in a pidgin-\\>creole situation. There's enough continuity that the \"new creation\" model doesn't apply, but a process of simplification through widespread imperfect bilingualism might.\n\n"
    },
    {
      "time": "28 Jan 2007 — 1:01pm",
      "content": "David, thanks again for the interesting information.\n\nIt sounds like English has a rather unique history, with many different changes happening at once. Fascinating.\n\n"
    },
    {
      "time": "28 Jan 2007 — 1:55pm",
      "content": "Language is an ever-evolving beast. As we see more international communications, I am sure all languages borrow from each other.\n\nChrisL\n\n"
    },
    {
      "time": "29 Jan 2007 — 1:43am",
      "content": "The linguistic history is fascinating (you learn so much around here) and it’s probably tactless to come crashing in and bring this discussion back down to the practicalities of the shop floor. But that is at the heart of the question with which this thread started – how do you, or how should you, say _sans_? Compositors had founts of nonpareil (pronounced nom **prull** ), brevier (bre **veer** ) and bourgeois (bur **joyce** ) in their type cases. When a British army found itself at Ypres in 1915 it sensibly called the place Wipers. People who had been to France or who fancied themselves on their posh pronunciation could show off with _Sansouci_ or _Madame Sans-Gêne_, the success by Sardou (1893) that kept its original name on the London stage. If there were founts of sanserif (or sans-serif) types in the printing shop, which in practice were mostly called just sans for short (as in Gill Sans), it stood to reason that you said sans to rhyme with man’s, whatever other people did outside. Still does.\n\nAs for the word serif, I have tried to get the Oxford English Dictionary to improve its entry. For its first use of _sanserif_ it cites the same Figgins type specimen of 1830 twice, wrongly in each case: first as _San-Serif_ (‘8 Lines Pica San-Serif’) and then, under the headword _ceriph_, as _Sans-cerif_. In the Figgins specimen it is in fact SANS-SERIF. For _serif_ by itself OED has nothing earlier than Savage’s _Dictionary of printing_ (1841), which spells it _ceriph_. But there are several earlier uses of _serif_ (variously spelt) than 1841 or even 1830. I know one of 1813 (‘surripses, more usually pronounced surriphs’) and there is another in 1827 (‘syrifs, or cerefs’). Justin Howes (of course) found _ceriph_ used in 1785. I’ll have another go at OED.\n\n"
    },
    {
      "time": "29 Jan 2007 — 4:28am",
      "content": "<cite>If there were founts of sanserif (or sans-serif) types in the printing shop, which in practice were mostly called just sans for short (as in Gill Sans), it stood to reason that you said sans to rhyme with man’s, whatever other people did outside.</cite>\n\nThis actually connects up nicely with all that linguistic history :) Because so much French got so thoroughly integrated into medieval English, the pronunciations got thoroughly anglicized, and it remained normal until much later to anglicize the pronunciation of French words coming into English (putting stress on first syllable, omitting nasalization, retaining consonants that were becoming silent in French, etc.). Since _sans_ was already naturalized in Middle English, it would definitely have had an anglicized pronunciation. Unlike today, it would probably have been familiar to English speakers in Figgins' day as much from its use by Shakespeare as from contemporary French, so I would expect that it was usually pronounced to rhyme with either _man's_ or _dance_ outside printer's shops as well.\n\n"
    },
    {
      "time": "29 Jan 2007 — 6:39am",
      "content": "Thanks. As I rather suspected. Good to know I was right. And I think Nomprull should have had the stress on the first syllable, not the second. You don't hear it quite so often these days, of course, but when you want get someone to insert a line space that is less than a whole Pica, it's quite a useful term.\n\n"
    }
  ]
}
