{
  "id": "30846",
  "title": "Backslash in Sentence",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "After following the En-Em Dash debates ( [http://typophile.com/node/30372](http://web.archive.org/web/20150126052806/http:/typophile.com/node/30372 \"http://typophile.com/node/30372\")) I have a question of my own.\n\n**When using the backslash in a sentence, what is the acceptable (English) usage?**\n\nThis is a problem that has plagued me for sometime now, but never enough to illicit proper research. Hopefully you fine folks can help.\n\n1. No spacing:  \nThe work around utilized by eRMS operators was to **Reverse/Cancel** Shipping Document…\n\n2. Spacing on both sides of the backslash:  \nThe work around utilized by eRMS operators was to **Reverse / Cancel** Shipping Document…\n\n3. Spacing after the backslash:  \nThe work around utilized by eRMS operators was to **Reverse/ Cancel** Shipping Document…\n\n_I apologize for my boring example, it's from a document I'm currently working on._\n\n",
  "author": "AndrewSipe",
  "time": "24 Jan 2007 — 7:33am",
  "uid": "6496",
  "comments": [
    {
      "time": "24 Jan 2007 — 7:41am",
      "content": "I was always taught that you don't put any spaces around the slash unless it's separating poetry lines or song lyrics, but I don't have any style manuals handy at the moment.\n\nBTW, this: / - is a slash and this: \\ - is a backslash.\n\n- Lex\n\n"
    },
    {
      "time": "24 Jan 2007 — 7:43am",
      "content": "To my eyes, at least, number 1 looks best. Also, I think it may be a forward slash your using??\n\nlater: woops, Lex beat me to it!\n\n"
    },
    {
      "time": "24 Jan 2007 — 7:47am",
      "content": "<cite>BTW, this: / - is a slash and this: \\ - is a backslash</cite>\n\nNot often I get to be completely anal twice in a week. But this: / - is a _virgule_\n\n;^)\n\nAs a personal rule of thumb, I’d use it without the spaces either side.\n\n"
    },
    {
      "time": "24 Jan 2007 — 7:47am",
      "content": "_Chicago_ refers to it as the solidus (also known as the slash, slant, or virgule) and suggests the same spacing rules apply to it as to the em- and en-dash, i.e., no spacing.\n\nI've been known to bend that one on rare occasions, depending on the font -- setting something in italic with a slash might want one (thin, actually, in retrospect) space after, but it's not usual. Spacing on both sides cancels out the whole purpose of putting the slash there in the first place, because it indicates an alternative choice. My copy of _Chicago_ has several such examples, all set tight.\n\nAt least here in North America: elsewhere, mileage/kilometrage varies.... ;-)\n\n_seconds later: Ah, great minds think alike!_\n\n"
    },
    {
      "time": "24 Jan 2007 — 7:50am",
      "content": "Ah! Linda. Out of nowhere! ;^)\n\n"
    },
    {
      "time": "24 Jan 2007 — 7:53am",
      "content": "_Solidus_ is used for fractions.\n\n"
    },
    {
      "time": "24 Jan 2007 — 7:54am",
      "content": "A punctuation mark by any other name would do the job as well. ;-)\n\n"
    },
    {
      "time": "24 Jan 2007 — 8:17am",
      "content": "(Gawd, I love questions like this!)\n\nInterestingly enough, _APA_ (The American Psychological Association) _Manual_ calls it a \"slash, also called a virgule, solidus, or shill\" but has some considerable differences in use from _Chicago_.\n\n_APA_ warns against use in _and/or_ constructions (they want a phrase instead), simple comparisons (they want a hyphen), or \"more than once to express compound units\" (where they want centered dots and parens).\n\n_The New York Public Library of Style_ has even more names for \"slash\" -- virgule, cancel, shilling, diagonal, slant bar, stroke, solidus, and (my personal favourite) separatrix.\n\n_Words Into Type_ says that separatrix is used in bibliographical matter to indicate where one line ends and another begins (this is also a function in setting poetry continuously).\n\nAnd last, but not least, the second edition of _Editing Canadian English_ lists it in the index as \"solidus.\"\n\nWhew! ;-)\n\n"
    },
    {
      "time": "24 Jan 2007 — 8:20am",
      "content": "No space  \nThe workaround utilized by eRMS operators was to Reverse/Cancel Shipping Document…\n\nunless it affects the rag, in which case I leave it with the previous word.  \nThe workaround utilized by  \neRMS operators was to Reverse/  \nCancel Shipping Document…\n\nbtw I would use workaround as one word.\n\nTim\n\n"
    },
    {
      "time": "24 Jan 2007 — 8:24am",
      "content": "Just had a gander at _The Elements of Typographic Style_, which refers to it simply as a _virgule_. The _solidus_ is refered to as being used in fractions and appears slightly more tilted to the right than the _virgule_, as you would for fractions.\n\n"
    },
    {
      "time": "24 Jan 2007 — 8:28am",
      "content": "Is there _any_ proper use in English (or any other language) for the backslash (\\) in a sentence?\n\n"
    },
    {
      "time": "24 Jan 2007 — 8:29am",
      "content": "\\> <cite>Is there any proper use in English (or any other language) for the backslash (\\) in a sentence?</cite>\n\nTo refer to _The Elements of Typographic Style_ once more, it’s useless, with no recognised use in typography. Superfluous. Purely a cosmetic addition.\n\n"
    },
    {
      "time": "24 Jan 2007 — 8:33am",
      "content": "MSDOS commands :-P\n\nChrisL\n\n"
    },
    {
      "time": "24 Jan 2007 — 8:39am",
      "content": "\\> <cite>MSDOS</cite>\n\nA _programming_ language… mmm! ;^)\n\n"
    },
    {
      "time": "24 Jan 2007 — 8:50am",
      "content": "The solidus and virgule are totally different characters. The former has a steeper angle, and I believe the baseline is also different.\n\n"
    },
    {
      "time": "24 Jan 2007 — 9:08am",
      "content": "There’s a clever rule in Finnish. If the slash is between two words, no spaces at all. If it’s between two sets of words, then put spaces on both sides.\n\ntypos edited\n\nExample  \nand/or\n\nwhite hat / grey pants\n\n"
    },
    {
      "time": "24 Jan 2007 — 9:09am",
      "content": "Finally, I'm at peace. Thank you all very much.\n\nNot only has my question been answered, but I have been corrected in what type of slash it was _(Lex and Conor)_ also, I thought it was called a backslash because it was tilted towards the rear.\n\nThis prompts another query… maybe we should have a Grammarwiki to go with the [typowiki](http://web.archive.org/wiki/start)\n\n"
    },
    {
      "time": "24 Jan 2007 — 9:26am",
      "content": "The COPYEDITING-L list ( [https://listserv.indiana.edu/cgi-bin/wa-iub.exe?A0=COPYEDITING-L](http://web.archive.org/web/20150126052806/https:/listserv.indiana.edu/cgi-bin/wa-iub.exe?A0=COPYEDITING-L \"https://listserv.indiana.edu/cgi-bin/wa-iub.exe?A0=COPYEDITING-L\")) put together a \"definitive\" style guide ten or so years ago, which I assume is being kept up.\n\nYou need to be a member to download it, and I left because it was just too busy. With permission, it might be a good start to a grammarwiki here....\n\n"
    },
    {
      "time": "24 Jan 2007 — 9:41am",
      "content": "It would be a grammarwiki with the typographer in mind. With entries that show examples of where the rules could be \"bent\" for to facilitate proper (visually aesthetic?) typesetting.\n\nThere does seem to be a lot of grammar-centric questions on Typophile. Where you have type, you have text…\n\n"
    },
    {
      "time": "24 Jan 2007 — 9:48am",
      "content": "_It would be a grammarwiki with the typographer in mind. With entries that show examples of where the rules could be “bent” for to facilitate proper (visually aesthetic?) typesetting._\n\nAbsolutely, but using that group's accumulated knowledge would at least solve some of the \"well, in this country we do A, but in that country, we do B\" arguments straight out: we can always fill in all the typographic quirks ourselves. ;-)\n\n"
    },
    {
      "time": "24 Jan 2007 — 10:02am",
      "content": "I can’t resist…\n\n\\> <cite>There does seem to be a lot of grammar-centric questions on Typophile.</cite>\n\nThere **_do_** seem to be a lot of grammar-centric questions on Typophile.\n\nI hope I’m right. ;^)\n\n"
    },
    {
      "time": "24 Jan 2007 — 10:15am",
      "content": "Is that a Hat-trick for you today?\n\n_There does seem to be a lot of grammar-centric questions on Typophile._\n\nThere do seem to be a lot of grammar-centric questions on Typophile.\n\nThere seems to be a lot of grammar-centric questions on Typophile.\n\nMaybe we're both right?\n\n"
    },
    {
      "time": "24 Jan 2007 — 10:26am",
      "content": "If you substitute \"lot of grammar-centric questions\" for something singular: say, O I don't know, \"silliness\"? - then you would have to use \"does,\" which implies that \"do\" is correct?\n\nI'm always wrong with these things, but ummm, maybe? :-)\n\n"
    },
    {
      "time": "24 Jan 2007 — 11:02am",
      "content": "There _does_ seem to be _a lot_ of grammar-centric questions on Typophile.  \nThere _do_ seem to be _lots_ of grammar-centric questions on Typophile.\n\n???\n\nIs one of those wrong? Are they both wrong?\n\n"
    },
    {
      "time": "24 Jan 2007 — 11:02am",
      "content": "Well, it's true that some Typophiles ask many questions relating to grammar.\n\n:-)\n\n"
    },
    {
      "time": "24 Jan 2007 — 11:48am",
      "content": "I think understanding grammar is integral to being a good type-setter.\n\n"
    },
    {
      "time": "24 Jan 2007 — 11:51am",
      "content": "<cite>I think understanding grammar is integral to being a good type-setter.</cite>\n\nI'm screwed.\n\n"
    },
    {
      "time": "24 Jan 2007 — 11:53am",
      "content": "I should add that while I think it is intergral I struggle just as much as the next typographer. ;^)\n\n"
    },
    {
      "time": "24 Jan 2007 — 12:16pm",
      "content": "Andrew, I don't know if you have any editorial say in this, but Bryan Garner--a very condensed version of whose _Modern American Usage_ appears in _CMS_ 15/e--would say that if you really mean \"or,\" write \"or,\" or pick one or the other: \"reverse\" or \"cancel.\" Hence, your virgule/separatrix/etc. problem goes away.\n\nGarner would probably also say that the verb for \"to draw out\" or \"provoke\" is _elicit_, but I recognize the gratuity of my pointing that out.\n\nAlso--to make my post even more gratuitous--when people mean \"use,\" why can't they _write_ \"use,\" and not \"utilize,\" a three-syllable word than means nothing more or less than \"use\"?\n\n"
    },
    {
      "time": "24 Jan 2007 — 12:17pm",
      "content": "_There does seem to be a lot of grammar-centric questions on Typophile.  \nThere do seem to be lots of grammar-centric questions on Typophile.  \n???  \nIs one of those wrong? Are they both wrong?_\n\n(putting on my editor hat)\n\nThe former is my pick of the two.\n\nThat being said, it is awkward to see it written, and is phrased more as a rhetorical question (I keep expecting to see \"doesn't there?\" at the end). IMHO, it should be rewritten as\n\n\"There are many grammar-centric questions on Typophile.\"\n\nOTOH, I don't have a problem in people writing here as they talk, and certainly the rhetorical question format is much more conversational and colloquial.\n\nAnd thus endeth the grammar lesson for today.... ;-)\n\n(taking off my editor hat)\n\nThere are days when it's useful to have one foot in the typography/design camp and the other in the anal-retentive editor camp, I guess.\n\n"
    },
    {
      "time": "24 Jan 2007 — 12:29pm",
      "content": "Does grammar-centric mean grammatical?\n\n"
    },
    {
      "time": "24 Jan 2007 — 12:37pm",
      "content": "Lari, I think I'd define grammar-centric more as \"centred around grammar\": grammatical means \"conforming to the rules of grammar.\"\n\nI'd like to think we're doing the former while discussing the latter. ;-)\n\n"
    },
    {
      "time": "24 Jan 2007 — 12:42pm",
      "content": "_…the more I read, the less confident I feel about what I've written…_\n\nI'm elated that I've sparked such an interest in \"proper\" grammar; please stop dissecting my sentences. It's starting to give me a complex.\n\n"
    },
    {
      "time": "24 Jan 2007 — 12:59pm",
      "content": "Andrew: sorry. I can see about three things I'd change in my last post, anyway, if that's any consolation. Self-consciousness is good, so long as it doesn't paralyze you.\n\n"
    },
    {
      "time": "24 Jan 2007 — 1:15pm",
      "content": "_I’m elated that I’ve sparked such an interest in “proper” grammar; please stop dissecting me sentences. It’s starting to give me a complex._\n\nJust so long as it's not one like Oedipus.... ;-)\n\nThe practices of \"grammar\" and \"typography\" have almost too many similarities: I've always thought of them as being opposite sides of the same street, to skew Tiff's analogy a bit.\n\n(Probably the two most important is that they both require an eagle-eye for detail, and it's essential to know the rules so you can break them when a situation calls for it.)\n\nIn the thirty-plus years I've spent working with both, I've often been asked which one I prefer, and the answer's always been \"I can't pick just one.\" I consider myself very lucky that I've always been able to make a (relatively) good living by doing them at the same time.\n\n(And for my next philosophical discourse, we'll look at the jokes of Ludwig Wittgenstein....) ;-)\n\n"
    },
    {
      "time": "24 Jan 2007 — 3:37pm",
      "content": "<cite>There does seem to be a lot of grammar-centric questions on Typophile.<br>\nThere do seem to be a lot of grammar-centric questions on Typophile.</cite>\n\nSpeaking as an editor, each of those sentences could be correct for a particular meaning: if the \"lot\" were an actual thing, like in the sense of \"the items on sale in the auction were grouped into twenty lots\", the singular verb would be correct, but if \"a lot of\" were used as a synonym for \"many\" without any implication of the existence of actual lots, then the plural verb would be preferable. I think the latter is what is meant here.\n\n"
    },
    {
      "time": "24 Jan 2007 — 6:38pm",
      "content": "I agree with Grot Esqué on this one, and I suppose it is similar to my views on the en-dash as well. No spaces if you are contrasting two words (yes/no) but spaces if you are contrasting phrases (not today / no comment).\n\nWhere I tend to use it most is for event listings:  \nMon/Tue/Thu  \nor  \n4 February / 5 March\n\nAnd if a grammarwiki was started it would be my number 1 bookmark.\n\n"
    },
    {
      "time": "24 Jan 2007 — 6:49pm",
      "content": "<cite> If the slash is between two words, no spaces at all. If it’s between two sets of words, then put spaces on both sides.</cite>\n\nWhat if it's proper nouns?\n\nWould it be: North America/South America\n\nor would it be: North America / South America\n\n"
    },
    {
      "time": "24 Jan 2007 — 10:51pm",
      "content": "So, if the backslash is on all our keyboards, is there something useful we might do with it? The backslash is slowly losing it's role in file management, and it would be a shame for it to just atrophy. The \"|\" has some decorative use, I've started on getting the ascii tilde some play, but I'm totally open to getting to 'own' another key on my 'board!\n\n[Choz](http://web.archive.org/web/20150126052806/http:/www.chozcunningham.com/)\n\n"
    },
    {
      "time": "24 Jan 2007 — 11:35pm",
      "content": "Late to the party... I just have to comment on\n\n_(my personal favourite) separatrix_\n\nThat is awesome, Linda. I have a new favorite word! It sounds like a grammar disciplinarian, i.e., \"You **will** stay apart!\"\n\n;-D\n\n"
    },
    {
      "time": "25 Jan 2007 — 1:28am",
      "content": "I’m going to North America/South America.  \n_I’m going to North America America. / I’m going to North South America._\n\nI’m going to North America / South America.  \n_I’m going to North America. / I’m going to South America._\n\n"
    },
    {
      "time": "25 Jan 2007 — 5:52am",
      "content": "<cite>I’m going to North America / South America.<br>\nI’m going to North America. / I’m going to South America.</cite>\n\nLari, thank you for clearing that up.\n\nChoz: That's an interesting question.\n\n"
    },
    {
      "time": "25 Jan 2007 — 6:53am",
      "content": "I like that Finnish rule. Wish it could become usage in English. It adds clarity, as Grot shows in his last post. Clarity is a good thing in grammar (and in typography).\n\n"
    },
    {
      "time": "25 Jan 2007 — 7:14am",
      "content": "_separatrix_\n\nThat is awesome, Linda. I have a new favorite word! It sounds like a grammar disciplinarian, i.e., “You will stay apart!”\n\n;-D\n\nRicardo, any editor worth their salt carries a range of whips, uh, red pencils, with them for just such a purpose. ;-)\n\nLari, in a situation like that, and assuming I was visiting both, I'd write _I'm going to North America and South America._ Sometimes, using a conjunction is a better solution to using a punctuation mark.... ;-)\n\n"
    },
    {
      "time": "25 Jan 2007 — 8:15am",
      "content": "Yes, I personally always write “or”. (Can “/” ever mean “and”?)\n\n"
    },
    {
      "time": "25 Jan 2007 — 8:19am",
      "content": "The general consensus (at least in the style guides I have) is that something like _apples/oranges_ means _apples and/or oranges_ anyway.\n\n"
    },
    {
      "time": "25 Jan 2007 — 8:38am",
      "content": "Yeah, that’s what I thought. “And/or” or “or”.\n\n"
    },
    {
      "time": "27 Jan 2007 — 12:53pm",
      "content": "To me, \"or\" means the same thing as \"and/or\", but maybe that's because I've done so much computer programming and logic stuff.\n\n- Lex\n\n"
    },
    {
      "time": "27 Jan 2007 — 1:10pm",
      "content": "In the absense of \"either\", \"or\" can be taken to imply the inclusive sense, but \"and/or\" makes that intent less ambiguous. The exclusive \"or\", however your preferred programming language puts it, is analogous to a phrase like \"either _x_ or _y_\".\n\nI think I know what I'm talking about, but I'm not sure...\n\n"
    },
    {
      "time": "27 Jan 2007 — 2:18pm",
      "content": "Lex, didn’t your logic teacher tell you about the real world?\n\n100 US $ is 77 € or 118 CAD. Either 77 € or 118 CAD, not 77 €, 118 CAD or 77 € + 118 CAD.\n\nMine had this lousy joke about dessert being coffee or ice cream. He had many lousy jokes.\n\n"
    }
  ]
}
