{
  "id": "30856",
  "title": "Chennai. Rounded, simplified sans serif.",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "I welcome any comments. I have just the basic letterforms so far. Some background:\n\nChennai will be slightly wider than most sans serif faces, but not too much. What is unique about Chennai, as it is tentatively titled, is by using the OpenType stylistic alternates you can change how the face looks. I have always incorporated stylistic alternates in my typefaces, but they work especially well for this typeface. You can see an example above. For example, you could use the more simplified version for headings, but the alternate for text. To be honest, I haven’t decided which version will be dominant.\n\n ![](http://web.archive.org/web/20150414164742im_/http:/typophile.com/files/Chennai_5365.gif)\n\n[www.insignedesign.com](http://web.archive.org/web/20150414164742/http:/www.insignedesign.com/ \"www.insignedesign.com\")\n\n",
  "author": "Jeremy Dooley",
  "time": "24 Jan 2007 — 12:50pm",
  "uid": "8555",
  "comments": [
    {
      "time": "24 Jan 2007 — 1:51pm",
      "content": "Hate to complain, but your site is busted under Firefox. Works great with IE though. (At least on my system!)\n\nHaving said that, your font design is a clever idea, IMO.\n\n"
    },
    {
      "time": "24 Jan 2007 — 3:32pm",
      "content": "I hope this doesn't come off the wrong way, but it looks like just the thing to use when Comic Sans just doesn't cut it and VAG Rounded is too formal. By that, I mean the style looks to be right on the edge between hand lettering and a more formal typeface. Mostly the curves of the horizontal bars of the uc, and the way the g and e are drawn contribute to the hand-lettered aesthetic, but the G and O appear to be nearly circular, lending a more formal, mechanical quality. Do you want to walk the line, or go to one side or the other with it?\n\n"
    },
    {
      "time": "24 Jan 2007 — 6:27pm",
      "content": "The S seems to be falling backward (to the left) and the overshoot at the baseline for letters with bowls (b, g, and especially e) seems too much, as they all seem to be floating slightly above the baseline. Other than those two comments, I really like it. I agree with Jason completely; it also seems to echo the handdrawn architectural feel of [Gotham Rounded](http://web.archive.org/web/20150414164742/http:/typography.com/catalog/gothamrounded/index.html), although yours is very different. Being a sucker for alternate glyphs, I'd love to see nearly all of your capitals have more simplified versions, but the ones you show here are terrific!\n\n"
    },
    {
      "time": "26 Jan 2007 — 12:03pm",
      "content": " ![](http://web.archive.org/web/20150414164742im_/http:/typophile.com/files/chennairound2_5495.gif)\n\nThanks for the comments; I found them very useful, and appreciate all who took the time to do some critiquing.\n\nMetalfoot, thanks for the heads up about the site on Firefox. I have made the site so it is \"useable\" but not pretty under Firefox. Does anyone with Safari want to give it a try? I would greatly appreciate it.\n\nCuttlefish, great comments about the direction. I hadn't really thought about Comic Sans, but I can see your points. I think that there IS a place somewhere between comic sans and VAG rounded. One influence is Futura, which probably gives it a slightly \"childlike\" quality. I also see your point about the e. I did some experimentation with it, but I still think it works as is. Does anyone think the e sticks out to much?\n\nAuric, I fixed the S: missed a chunk of vector from illustrator. I think I have the baseline float worked out better.\n\nI made a decision that the more simplified forms will be the dominant ones. To get to the more traditional forms you will have to turn OpenType swash on. How does everyone feel about that? Please ignore the temporary spacing. I'm primarily looking for letterform comments.\n\nJeremy Dooley  \n [www.insignedesign.com](http://web.archive.org/web/20150414164742/http:/www.insignedesign.com/ \"www.insignedesign.com\")\n\n"
    },
    {
      "time": "27 Jan 2007 — 6:35pm",
      "content": "I really do like it, especially the ability to swap some of the characters for more traditional ones. Sometimes I'm in a mood for techno/futuristic, sometimes for just a soft typeface. But, as I mentioned before, I'd like alternates for even more glyphs (and a better name than \"swash,\" which isn't quite appropriate here).\n\nSome particulars: I was just about to say that the bowled letters seemed still floaty, but now that I'm looking at it again, it's not as apparent. I think the amount of overshoot you used is still not enough; it's especially apparent in the e, which seems to be _slightly_ above the baseline even though it probably touches it.\n\na (both swash and not): I love both of them!  \nB: Needs to overshoot! Also seems to be tilting slightly forward.  \nb: I'd suggest a swash version, like you did with the d.  \nf: Terrific. I haven't seen too many descending f's in non-italic fonts.  \ng swash: The ear seems to big and obtrusive. Maybe make it horizontal or curl it.  \nK and k: Like the curved leg, but maybe you want to make that the alternate version?  \nQ: I'd like to see an alternate with an especially swoopy tail.  \nR: Same comment as the Q.  \nr no swash: Feels like it thins out at the curve, but maybe it's just the pixelization.  \nT: Not so crazy about it; the top feels like it curves awkwardly. Try a flat top?  \nt: I really like the short crossbars on the f and t.  \ny: Can you make an alternate like the straight-sided alternate capital?\n\nHope that helps. Really nice work so far.\n\n"
    },
    {
      "time": "30 Jan 2007 — 7:51pm",
      "content": "Auric,\n\nI greatly appreciate your input throughout this process.\n\nI think I was having difficulty with the overshoot because of the rounded forms. There was a slight overshoot, and I though it was enough (it looked ok visually), but I took a look at VAG rounded’s overshoot and decided to extend mine.\n\nI tried a swash b, but it didn’t look right.\n\nI made the leg on the k and K uniform with the other ears and stems.\n\nI tried a really swoopy tail on the Q. It didn’t work because you couldn’t taper the tail and have it be unified with the face. However, I did do an alternate, and ultimately ended up with a better looking Q. Did the same with the R.\n\nDid a flat top for the traditional alternate.\n\nGood call on the y. Did an alternate for it.\n\nThe font is available [here](http://web.archive.org/web/20150414164742/http:/www.insignedesign.com/Typeface.aspx?FamilyName=Chennai).\n\n ![](http://web.archive.org/web/20150414164742im_/http:/typophile.com/files/Chennai-Final_6583.gif)\n\n"
    },
    {
      "time": "31 Jan 2007 — 4:14pm",
      "content": "You're very welcome, Jeremy. I'm very excited to have made (apparently) valuable suggestions -- gives me more impetus to get started on my own creative endeavors. I really like how Chennai turned out, and I really like your suggestion about using alternates for body text. I think that the overshoot is now just about perfect, with the bowled characters sitting right where they should. That new Q is also terrific. I hope that I'll have a project that calls for me to buy it sometime soon!\n\n"
    },
    {
      "time": "28 Oct 2009 — 11:24am",
      "content": " ![](http://web.archive.org/web/20150414164742im_/http:/typophile.com/files/Chennai-Sample-Page-Source3_4182.png)\n\nChennai has been updated with general tweaks and three new weights: [Chennai](http://web.archive.org/web/20150414164742/http:/www.insignedesign.com/Typeface.aspx?FamilyName=Chennai)\n\nJeremy Dooley  \n [www.insignedesign.com](http://web.archive.org/web/20150414164742/http:/www.insignedesign.com/ \"www.insignedesign.com\")\n\n"
    },
    {
      "time": "1 Dec 2009 — 4:51am",
      "content": "Is the thinning of the cross stroke in medium lowercase e needed  \nIf you look at en in Vendors the beginning of the arch in n  \nis thicker. It may be that you want to avoid congestion  \nin e but it's one character that stands out a bit IMVHO  \nThe bolder and light weights look much better\n\n"
    }
  ]
}
