{
  "id": "30859",
  "title": "Got Questions for Andre Gurtler?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does anybody have any questions the want to ask Andre Gurtler? I managed to find him & he has agreed to let me call him with questions. Already I have been asking him about Opentype & contextual alteration (as you might have guessed) but no doubt there are things I will forget to ask him if I am not prompted.\n\n",
  "author": "ebensorkin",
  "time": "24 Jan 2007 — 3:18pm",
  "uid": "2942",
  "comments": [
    {
      "time": "24 Jan 2007 — 3:32pm",
      "content": "Now I am having a brain freeze Eben. I'll try to think on it awhile.\n\nChrisL\n\n"
    },
    {
      "time": "24 Jan 2007 — 4:02pm",
      "content": "Just as a reminder: He is the Haas Unica Guy and worked with Ruder & Frutiger. He also wrote the book 'Experiments with Letterform and Calligraphy'. Egyptian 505, and Lino Letter\\* are his. And Basilia.\n\nSee also: [Linotype's page](http://web.archive.org/web/20150311183534/http:/www.linotype.com/411/andreguertler.html?PHPSESSID=239a012999ab33a5442b08ff93318cff)\n\n\\* André Gürtler, Reinhard Haus\n\n"
    },
    {
      "time": "24 Jan 2007 — 8:02pm",
      "content": "Eben,\n\nI always want to know every detail about a designer's process from start to completion, what tools they use, what inspiration they draw from, the amount of time they take, how they agonise. I find this quite instructional and encouraging.  \ncheers\n\nNick\n\n"
    },
    {
      "time": "25 Jan 2007 — 5:23am",
      "content": "Nick, I can't tell you about any other type designer, but having studied under Ron Arnholm (Legacy, Legacy Sans), I can tell you he takes years to develop a face. He's a perfectionist, and it shows.\n\n"
    },
    {
      "time": "25 Jan 2007 — 12:14pm",
      "content": "I have maybe a dozen questions for him, but it might  \nonly be appropriate to ask a smaller one in this case:\n\nHow does he address the not uncommon opinion (which  \nI don't share myself) that Unica was too \"rationalized\"?\n\nhhp\n\n"
    },
    {
      "time": "25 Jan 2007 — 5:19pm",
      "content": "Why 'appropriate'? I could ask him if it's okay to give you his # too if you prefer. I just figured it would be interesting to know what questions, issues, points of fact or even contrversies it might be useful to present to him as topics for discussion. I have searched online to better understand his history which has been useful up to a point but many many things are not on the internet in much detail or in some cases at all. Things which occured in the mid 20th century fall into that category a lot I think.\n\n"
    },
    {
      "time": "25 Jan 2007 — 5:21pm",
      "content": "But I will ask him that question about Unica. I am not sure I understand it. Can you frame the opinion & let me know if you agree with it? I suspect that you do not but...\n\n"
    },
    {
      "time": "26 Jan 2007 — 10:55am",
      "content": "There is a class of type designer that doesn't like to see thought go beyond a certain level of detail when it comes to forming glyphs. Unica is an extreme case of \"rationalized\" design, as detailed so well in the document by Team77. I'm wondering how Gurtler might be inclined to elaborate on that conflict, how he might defend (or possibly recant) the way in which Unica was designed.\n\nhhp\n\n"
    },
    {
      "time": "26 Jan 2007 — 11:32am",
      "content": "Hrant, talking to him today ( 5 min ago ) I asked him about Hass Unica being 'rationalized' and he said that all the sans serifs from Univers to Helvetica have a certain stylistic tendency towards 'rationality'; so of course Haas Unica fits into that too by virtue of the style in the question, but that where Haas Unica is different is that it is the most fluid and warm of the many kinds of Helveticas and so it is the most agreeable. I am paraphrasing to a certain extent here. But I think that was the gist of it. By rationalized maybe you are refering to what he called unity - having not seen the face properly perhaps this could be a 'regularity' of forms?\n\nI asked him about Working in Mexico today and he said he felt that the students were more enthusiastic there and he enjoyed that.\n\nI also asked him about Basilia and the constraits of making type for photo process. I asked this because thinking about the faces that have been made for specific optical sizes Basilia looked to me like it would be optimal at maybe 24-40pt or something. It didn't look to me like it would hold up at 9pt at all. So I asked him if he had in mind a text face, a display face or something inbetween making reference to the constraints of designing for optical systems. He said that it was tricky to design for optical and that the one of hardest parts was getting the spacing between gyphs to be okay at multiple sizes. This makes TONS of sense if you think about it. But he said that he had intended Basilia to be for text unreservedly. And if it could be used for display that was a bonus. Agian some paraphrasing there. Looking at Basilia more I am really struck by how much I like it.\n\nNicholas, in this case I think it's better to ask a question relevant to the specific designer's carreer. You can ask general questions here on typophile and get very good answers from many people.\n\nI will ring him again in a few days so if anybody thinks of something they would like to ask let me know.\n\n"
    },
    {
      "time": "26 Jan 2007 — 11:33am",
      "content": "Tell us more about this 'document by Team77', won't you?\n\n"
    },
    {
      "time": "26 Jan 2007 — 11:58am",
      "content": "Eben, thanks.\n\nThe Unica document: it's really one-of-a-kind - 14 pages  \nof hyper-rationalization. Here's a couple of detail photos:\n\n ![](http://web.archive.org/web/20150311183534im_/http:/typophile.com/files/UnicaDoc1_6197.gif)\n\n ![](http://web.archive.org/web/20150311183534im_/http:/typophile.com/files/UnicaDoc2_5726.gif)\n\nBasilia: I see some interesting details in it - it's clearly the work of an expert, and the \"R\" is memorable, but my general disdain for the Didone genre prevents me from taking it seriously for text.\n\nhhp\n\n"
    },
    {
      "time": "26 Jan 2007 — 2:27pm",
      "content": "Your welcome & Thanks too! Wow, that set of examples is great!! But to me this doc doesn't seem like hyper-rationalism any more than any promo document that says this font is a step foreward because of X-factor/s. Then again the text that goes with the comparisons could be telling.\n\nI think that with the modernist urge alive & well in them & in their buyers they might have thought - perhaps correctly - that all the precise measurements would make it seem like they were the Helvetica masters.\n\nI do remember ham-handed promotion of all kinds of things; stereos for instance, where the specifications were trotted out with a great deal of fanfare. This much 'wow & flutter' on a tape deck. etc. Know what I mean? It think what your getting at may have been generalizable to the decade/period rather than to these folks' actual approach to making type.\n\nBut perhaps your right. I need more context to know.\n\nTalking to him I get the sense that his approach is strongly pragmatist like the majority of type makers. It might have been different then too. Hard to know for sure.\n\n"
    },
    {
      "time": "26 Jan 2007 — 5:18pm",
      "content": "Corey Holms wrote an article on Unica for _Grafik_. Should have appeared sometime last summer. But they don't have any archives online, so I'll ask Corey if he can post some of it here.\n\n"
    },
    {
      "time": "26 Jan 2007 — 5:26pm",
      "content": "That would be great!\n\n"
    },
    {
      "time": "26 Jan 2007 — 5:27pm",
      "content": "I'd be happy to post it - I need to get the document from my drive at home though. It'll take a couple hours before I finish up at work. I'll post it then.\n\n"
    },
    {
      "time": "26 Jan 2007 — 5:28pm",
      "content": "Stephen, in your experience who else here would be interested in Andre's work do you think?\n\n"
    },
    {
      "time": "26 Jan 2007 — 5:29pm",
      "content": "Thanks Corey!\n\n"
    },
    {
      "time": "26 Jan 2007 — 5:36pm",
      "content": "Well, I have the emails of about 45 FontShop customers who requested (and were denied) Unica in the last 2 years, but beyond that, I think we have the meat of the Gürtler geeks in this thread.\n\n_I always want to know every detail about a designer’s process from start to completion_\n\nYou might be interested in \" [Made with FontFont](http://web.archive.org/web/20150311183534/http:/www.fontshop.com/virtual/newsletters/Dec2006_a)\", which includes a bunch of this stuff, including the [story of FF Clifford, told by Akira Kobayashi](http://web.archive.org/web/20150311183534/http:/www.fontshop.com/fontfeed/archives/kobayashi_and_clifford.cfm).\n\n"
    },
    {
      "time": "26 Jan 2007 — 8:39pm",
      "content": "[EDIT] - I just posted this as the finished article, I forgot to mention that it was written for Grafik Magazine and I'm sure there are some legal protections that I should disclose, but don't know.\n\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\nIt’s funny how a typeface that has disappeared from standard usage for so long has re-emerged into popular interest due to several factors including something as simple as a mere mention in the book “8vo: On the Outside.” There is a culture of obsessive designers, such as myself, that feel the need to track down new and forgotten faces as they become known. The search for hard-to-find typefaces has become a topic of interest on many design forums and blogs, with many trying to ascertain where the typefaces are available. Interestingly enough, as I began to delve into the mystery that is Haas Unica, I came across a tale of intrigue that continues to this day.\n\nLet’s start at the beginning, as we attempt to recreate the set of circumstances that has led to the shelving of this typeface. Swiss national André Gürtler designed Haas Unica along with a group titled Team’77 (comprised of Erich Gschwind and Christian Mengelt) in 1980. It is a grotesk typeface that follows in the tradition of Helvetica, but with several changes. According to the Team’77 promotional publication titled “From Helvetica to Haas Unica,” the face was created after close examination of Helvetica and similar grotesk typefaces in the attempt to correct optical and rhythmical irregularities. Although the group’s professed interest in the readability of the typeface and their intent to create a face that meshed with current typesetting technology does seem to be genuine, there do seem to be a few other possibilities as to why Haas decided to pursue this re-issue.\n\nAs I discussed this missing typeface with type historians and aficionados, I found that Helvetica was originally a Haas type foundry project titled Neue Grotesk designed by Max Miedinger. Stempel, the parent company of the foundry decided to change the name to Helvetica to market it to German businesses, re-issuing it through Linotype. All grotesks up to this period had been designed to be used as metal type that took up a specific amount of space when typeset. Because of the technological advances available through the use of photo-typesetting, innovative and experimental type composition and even plain misuse became rampant. This wave of irreverence to the original faces led many traditional typographers and publications to start campaigns against Helvetica, the controversy further increasing the popularity of the face. Some of those I discussed the face with hinted at some slightly less altruistic reasons for the emergence of Haas Unica. Possibilities include Haas attempting to reclaim the mantle of the most popular grotesk typeface, down to the most basic of motives, that of taking advantage of the increase in popularity of this type of face.\n\nRegardless of the reasons behind the creation of Haas Unica, there is no doubt that it is an improvement over Helvetica, and Team’77’s stated aims seem to have been met.\n\nAlthough at one time, Haas Unica was available as a PostScript font (by two separate type foundries, no less), sadly it is no longer commercially available. At the time of its creation, Germany was a hotbed of innovation in type technology, and typefaces were being scanned and redrawn digitally. Scangraphic Imagesetters possessed an internal drum imaging system whose precision was unrivalled in the industry, and were the first company to make high-resolution phototype scans available to the PostScript market. At the same time URW owned the Ikarus system designed by Peter Karrow which was the first program to convert raster images to outlines, and allowed them to create fonts that were available for computer use. Because there were thousands of typefaces that people wanted to have converted from phototype to PostScript, Scangraphic and URW began a collaboration that created the original conversion of Haas Unica to computer-ready type. This explains why two digital versions of the face were available, one through Scangraphic, and the other through Font Company, whose fonts were manufactured by URW. Although some believe that these two sets were created separately, it seems most likely that they were created from the same Ikarus data, and are therefore identical – especially considering Karrow was able to retain the reselling rights to all typefaces he digitized.\n\nScangraphic’s Digital Type Collection (which included Haas Unica) was purchased by Elsner + Flake in 2003, to which they added font-specific Euro and @ symbols in 2004. The revamped typeface was set to be sold by Scangraphic and its distributors, but Linotype is currently preventing the release, citing trademark violations. Although similarities to other typefaces often occur between foundries, it is rare that one finds typefaces that have been shelved indefinitely due to such resemblances. In truth, the real problem lies within a dispute over who owns the name Haas Unica, rather than any resemblance infringment.\n\nIn any case, it is truly a shame that this wonderful typeface has been boxed up with scores of other forgotten phototype into a warehouse, not unlike the Ark of the Covenant at the conclusion of “Raiders of the Lost Ark,” never to be seen again.\n\n"
    },
    {
      "time": "27 Jan 2007 — 12:05am",
      "content": "Thanks very much for that post!\n\n"
    },
    {
      "time": "27 Jan 2007 — 11:17am",
      "content": "Glad to contribute.\n\n"
    },
    {
      "time": "16 Feb 2007 — 6:41am",
      "content": "Long time lurker, first time poster here.\n\nI wonder if Bono is available to petition the world leaders for the liberation of Haas Unica?\n\nWould anyone have a nice-sized image of the full lower-case and upper-case of the Bold and Black weights? I would love to ogle that for a while!\n\nThanks for posting the article, Corey ... It's a great read.\n\n"
    },
    {
      "time": "16 Feb 2007 — 7:27am",
      "content": "At your service...  \nFrom the now-fabled booklet:\n\n ![](http://web.archive.org/web/20150311183534im_/http:/typophile.com/files/UnicaBoBl_4082.gif)\n\n(BTW, Typophile apparently doesn't like ampersands,  \nand what else I wonder, in uploaded image filenames.)\n\nhhp\n\n"
    },
    {
      "time": "16 Feb 2007 — 7:42am",
      "content": "THANK YOU Hrant. This is great.\n\nWho knew Typophile would be an anti-ampersandite. I knew how it felt about the schwa, but this....\n\nJoe\n\n"
    },
    {
      "time": "16 Feb 2007 — 10:09pm",
      "content": "Thanks for that Hrant!\n\nJoe (anybody), got questions for Andre? I will probably talk to him in another week or two.\n\n"
    },
    {
      "time": "20 Dec 2008 — 2:35am",
      "content": "2 years later ... how was that chat, Eben?\n\n"
    },
    {
      "time": "21 Dec 2008 — 12:07pm",
      "content": "It was very interesting. Other than things mentioned above I asked ( of course ) about fitting letters together for text with Custom varient (CALT). He said that of course you could theoretically do something like that but that the proof would be in the doing of it. Setting the context to talk about the CALT idea took a little building up to at the time. I must say he certainly was very patient and kind.\n\n"
    }
  ]
}
