{
  "id": "30881",
  "title": "\"Reasonable Agreement\": the Anti-EULA",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Saw this on boingboing.net today, and thought some folks here might find it interesting. The article in full follows the link.\n\n[http://www.boingboing.net/2007/01/25/reasonableagreemento.html](http://web.archive.org/web/20131018063907/http:/www.boingboing.net/2007/01/25/reasonableagreemento.html \"http://www.boingboing.net/2007/01/25/reasonableagreemento.html\")\n\nWelcome to ReasonableAgreement.org -- where we make mincemeat of End User License Agreements. As you move through space, as you look at the Web, when you buy things, when you travel, it's increasingly the case that you end up making \"agreements\" to give up your rights. For example, by installing software, you might give up the right to sue the company that made it if it didn't work. Or by subscribing to an online music service, you might give up your right to loan the songs you buy to a friend. When you install a game like World of Warcraft, you agree to install spyware on your computer. When you sign your credit-card slip at Best Buy or Fry's, you waive all kinds of rights you get under consumer protection law.\n\nWho knows if this stuff is enforceable? The case law is all over the place. What if you're under-age? Drunk? Using someone else's computer -- do you agree on your parents' behalf when you install software at their place over the holidays?\n\nFrankly, it's all bullshit. The way the system should work is, you buy something, you own it. The law of the land governs your interactions with the seller. What's the point of having a consumer-protection law if all it takes to get around it is to announce that you've agreed to waive your rights by buying something? If consumer protection laws don't protect people who buy stuff, whom do they protect?\n\nThat's not to say that we can't have reasonable agreements -- like when you and your boss sit down and draw up your employment contract, negotiating the terms on which you'll work. But the idea that an agreement can be made by shouting, \"By standing there doing nothing, you agree to let me stab you in the eye!\" is just dumb.\n\nEnter the anti-EULA. Here's the text of it:\n\nREAD CAREFULLY. By [accepting this material|accepting this payment|accepting this business-card|viewing this t-shirt|reading this sticker] you agree, on behalf of your employer, to release me from all obligations and waivers arising from any and all NON-NEGOTIATED agreements, licenses, terms-of-service, shrinkwrap, clickwrap, browsewrap, confidentiality, non-disclosure, non-compete and acceptable use policies (\"BOGUS AGREEMENTS\") that I have entered into with your employer, its partners, licensors, agents and assigns, in perpetuity, without prejudice to my ongoing rights and privileges. You further represent that you have the authority to release me from any BOGUS AGREEMENTS on behalf of your employer.\n\n",
  "author": "jlt",
  "time": "25 Jan 2007 — 1:12pm",
  "uid": "1706",
  "comments": [
    {
      "time": "25 Jan 2007 — 4:13pm",
      "content": "With respect to fonts, I don't think anyone would disagree with this principle...\n\n\"The way the system should work is, you buy something, you own it.\"\n\nBut in most cases font EULAs don't take anything away from this, they add rights you wouldn't normally get if you purchased a CD or a book - for example the right to distribute an infinite number of copies of the font, providing they are embedded in a document file or PDF, the right to modify the font and commercially exploit that modified font, the right to make five copies and install them on different devices, the right to download the font to a laser printer to improve printing performace, the right to use the font as the basis of a logo for a billion dollar corporation, etc., etc.,\n\n"
    },
    {
      "time": "25 Jan 2007 — 5:42pm",
      "content": "When it is 'you buy something, you own it', no other 'rights' need to be added? All those things wouldn't need to be mentioned, because the product (font in this case) is yours, and yours to do what you want with ? A EULA would basically cease being usefull.\n\n"
    },
    {
      "time": "25 Jan 2007 — 6:03pm",
      "content": "Since when did \"ownership\" equal \"do anything you like with it\" - I can't think of **anything** in the _real world_ for which this is the case, guns and cars being obvious examples. There's a huge diffeence between 'any use' and 'fair use', no?\n\n"
    },
    {
      "time": "26 Jan 2007 — 8:45am",
      "content": "Can't there be a middle ground between \"I own this therefore am free to do whatever I want with it, give it away to all my friends, resell it, make oodles of money off it\" and \"I am leasing this for personal use only on my computer network and if I try to actually use it in a job I'm forced to cough up a small fortune for the right to embed it in a pdf or give the font along with the job to my client\"?\n\nI know this ground has been trod before, but as a freelance designer who wants to obey the EULA but feels like my hands are frequently tied, hired by clients who don't have deep corporate clients, I find myself all too often in EULA violation. While I understand and respect intellectual property rights I do feel like the EULAs don't really serve the End User much at all.\n\n"
    },
    {
      "time": "26 Jan 2007 — 9:42am",
      "content": "_I’m forced to cough up a small fortune for the right to embed it in a pdf or give the font along with the job to my client”?_\n\nThose are two different issues.  \nFor the first, many foundries (such as mine) allow embedding in pdfs. So you should use their fonts.  \nFor the second, if your client wants to do typesetting using a non-bundled font that you spec, s/he should licence it as well. Sure, you may balk at having to use common fonts, but the difficulty is with you or your client, not the foundry.\n\n"
    },
    {
      "time": "26 Jan 2007 — 9:44am",
      "content": "I feel for this situation. It seems to me the anti-EULA is similar to what you get at the corner used car lot. You bought it, you break it, you fix it...if you follow me. When I license type I appreciate things such as being able to ask for fixes if I find a problem (this happened recently and I had a fixed version of the font within 1 day).\n\nWhat Patty says is true, I wish there was more middle ground. However, for the most part, I think we are in middle ground. Sure, there are foundries that seem to ask the impossible, but just don't license from them.\n\n"
    },
    {
      "time": "26 Jan 2007 — 10:38am",
      "content": "A LOT of foundries require an additional fee to embed the font into a pdf.\n\nWhile I'll agree that the client should buy their own license if they intend to continue to use the font (hard to enforce I know) I feel that it's excessive have to purchase an additional license in order to send the font to a printer along with a specific job.\n\nAs I've said before, overly restrictive EULAs IMHO just encourage piracy. Or discourage designers from purchasing fonts, which serves no one.\n\nThe fact is that there will always be people trying to get around the rules no matter how loose or tight they are. I'm sure most of the users of this forum have, at some time, used a font they didn't license. There will always be clients who balk at an additional fee (which is why I build it in beforehand). But for most of us, it seems there should be a set of rules that are simple, clear, fair, and mutually beneficial to the designer and the foundry.\n\n"
    },
    {
      "time": "26 Jan 2007 — 10:39am",
      "content": "\\> you buy something, you own it.\n\nSure. If you want to buy a font, most of the developers will sell you one for $25,000 or so for a nice family (size negotiable). You can do whatever you want with it after you buy it.\n\nCan't afford that? Well maybe you would like to license one instead. There are a few limitations in that case ...\n\n"
    },
    {
      "time": "26 Jan 2007 — 12:35pm",
      "content": "From both sides of the aisle, I feel a EULA should allow for a job to be printed by the client. (I don't mean any printimng of any thing using that font. I mean the job the designer sent them.)  \nEmbedding a font in a PDF for the purpose of sending it to your client or offset printer is the best solution and should always be allowed without an extra fee. What the client bought from the designer was that document and they should be able to print it. If they choose to make a new document ontheir own inhouse, then they should license their own copy. Embedding is far more preferable to me than sending a copy of the font to the printing firm along with the InD files.\n\nChrisL\n\n"
    },
    {
      "time": "26 Jan 2007 — 12:52pm",
      "content": "Yes Chris but sometimes the client/printer want the original native files in case there are problems or last minute changes. I always tell them that they are not allowed to keep the fonts after the job is completed but who knows what they do. Some of my clients have a policy to license the fonts themselves, some don't. Budgets are small in publishing.\n\n"
    },
    {
      "time": "26 Jan 2007 — 12:55pm",
      "content": "I understand Patty. I have had the same problem myself. I think we need a set of \"Mission Impossible\" fonts that self destruct 20 seconds after your job is succesfully off press :-)\n\nChrisL\n\n"
    },
    {
      "time": "26 Jan 2007 — 1:08pm",
      "content": "\\>I think we need a set of “Mission Impossible” fonts that self destruct 20 seconds after your job is succesfully off press :-)\n\nIf printing-lore is to be believed TrueType fonts would qualify - only if you replace 'after' with 'before' ;-)\n\n"
    },
    {
      "time": "26 Jan 2007 — 1:53pm",
      "content": "LOL!!!\n\nChrisL\n\n"
    },
    {
      "time": "26 Jan 2007 — 2:03pm",
      "content": "Our EULA allows pdf embedding for output and also allows fonts to be supplied to the printer for output as well. But if you mean embedding in a pdf for something value added like a publication distributed in pdf to subscribers, then there would be extra fees involved.\n\nJames\n\n"
    },
    {
      "time": "26 Jan 2007 — 2:51pm",
      "content": "<cite>Since when did “ownership” equal “do anything you like with it” - I can’t think of anything in the real world for which this is the case, guns and cars being obvious examples. There’s a huge diffeence between ‘any use’ and ‘fair use’, no?</cite>\n\nGuns and fonts, yes, that's a very good comparison.\n\n"
    },
    {
      "time": "26 Jan 2007 — 3:09pm",
      "content": "Fonts don't kill people, people do.\n\n"
    },
    {
      "time": "26 Jan 2007 — 3:20pm",
      "content": "\\>Guns and fonts, yes, that’s a very good comparison.\n\nThanks. As they say the pen is mightier than the sword.\n\n"
    },
    {
      "time": "26 Jan 2007 — 3:48pm",
      "content": "Patty, that is your absolute best ever post!  \nMy sides still hurt LOL!\n\nChrisL\n\n"
    },
    {
      "time": "29 Jan 2007 — 2:00am",
      "content": "Hi guys:\n\nThe disdain I have for PDF font licensing is the same disdain I have for buying a home in 'sub-division', condo, etc. You buy a house then you are forced to pay a monthly Home Owners Association (HOA)- for what- a mowed lawn?\n\nI challenge any foundry to tell me how often a 'joe-blow' kinda guy buys a one-time license for sending PDF to a friend or co-worker.\n\nAs in: \"Hey font company guy, yah its me again, I need another license, because when I used that first license to send my resume to my homegurl- (she's like smart 'n stuff with the graphics)- she said it kinda sucks and I needed to change some stuff around again, so heres another $12 or $19 bucks\" (MIMBO version)\n\nNOT!!!\n\nI think the PDF fee is mainly targeted at the corporate, periodical, publishing users. They can afford to pay those fees and (maybe) if I was a type designer I would justify it because of the large scale of transmissions. But really, small frys like myself cannot be the target user. I just can't see it. Most EULA's don't make that distinction between big guys and you and me. If they did this topic would not exist.  \nSo when I see that clause in the license (WINK WINK) I know who there really talking to!\n\nHere are some things I will and will not do.\n\n1. I never ever lend fonts.  \n2. I don't steal fonts, or mp3's for that matter.  \n3. But If I had a laptop I would put it on the laptop even if the EULA said only one machine- but not many foundries do.  \n4. Fonts from old computers I take to the new computer as in all cheesy win 3.1 fonts from my i386, I have copy on my mac- WIDE LATIN ANYONE?\n\nIn the words of Judge Hatchett: \"Don't get me testifying up in here\",\n\nMikey\n\nAs of right now I don't know how I feel about the EULA's that compel you to pay extra to make flash animations for the web\n\n"
    },
    {
      "time": "30 Jan 2007 — 8:21am",
      "content": "Pattyfab,\n\nYou use the words \"violation\" and \"piracy\" -- but they are only appropriate if the EULA is enforceable or effectively creates new property rights. That's a big if.\n\n"
    },
    {
      "time": "30 Jan 2007 — 9:17am",
      "content": "How do we define enforceable? Nothing is 100% enforceable. There are plenty of unsolved murders for example and illegal drugs are sold daily. We have to at least make the case that it is wrong, frowned upon, and a violation of some law. We cannot also be the font police. There will always be criminals but that does not mean we should stop having laws against crimes or notifications that font piracy is a crime.\n\nChrisL\n\n"
    },
    {
      "time": "30 Jan 2007 — 8:02pm",
      "content": "Well, I'm surprised at the comparison: disobeying the EULA vs. drugs and murder. You certainly made your position clear!\n\nMy point was legal. A EULA is a standard contract, and not everything that it is says is legally binding (enforceable). By this I don't mean to deprive anyone of the fruit of their labour. I am simply saying that the rights of providers and consumers are determined by the entirety of the legal system, of which the EULA is only a part. Mystical reverence of the EULA is naive and inappropriate.\n\nI also object to the term piracy and similar terms invented by pharmas, motion picture associations etc. These terms serve only to delegitimize a healthy debate surrounding the scope of the rights in intellectual property. The society that created IP rights has the right to define them. Just because someone has an economic interest does not mean they have a legal right.\n\nBest,\n\n"
    }
  ]
}
