{
  "id": "30885",
  "title": "Wondering if freelance community / networking websites are worth the money?",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Has anybody ever had any real success by joining one of these types of websites?\n\n[http://www.mediabistro.com](http://web.archive.org/web/20131014061551/http:/www.mediabistro.com/ \"http://www.mediabistro.com\")\n\nIf so, which ones are worth the time and money? It's so hard to trust the slick marketing -- especially when you're the one who designs it :)\n\nAK\n\n",
  "author": "<li class=\"taxonomy_term_7 first last\"><a href=\"/web/20131014061551/http://typophile.com/forum/7\" rel=\"tag\" title=\"Licensing, royalties, and the fine art of self-promotion\">Release</a></li>",
  "time": "25 Jan 2007 — 4:03pm",
  "uid": null,
  "comments": [
    {
      "time": "25 Jan 2007 — 7:21pm",
      "content": "I have never used a system like this.\n\n"
    },
    {
      "time": "31 Jan 2007 — 12:45pm",
      "content": "looks like something no client i'd like to work with would read.. nor would I care too lol.\n\n"
    },
    {
      "time": "14 Mar 2008 — 10:06pm",
      "content": "What I've heard from everyone who ever posted on those sites, especially Craig's List, is that you never hear back from anybody ever--a waste of time. Face to face networking is what works.\n\n"
    },
    {
      "time": "15 Mar 2008 — 10:56am",
      "content": "What about LinkedIn?\n\n"
    },
    {
      "time": "31 Mar 2008 — 10:37am",
      "content": "another one for the perspective dot ring collection !\n\n[http://typophile.com/node/42203](http://web.archive.org/web/20131014061551/http:/typophile.com/node/42203 \"http://typophile.com/node/42203\")\n\n ![](http://web.archive.org/web/20131014061551im_/http:/typophile.com/files/dotslogos_4594.png)\n\n"
    },
    {
      "time": "31 Mar 2008 — 11:15am",
      "content": "LinkedIn, IMHO, is more of a 'hey, I know you in person, let's stay in contact' type of service.\n\n"
    },
    {
      "time": "31 Mar 2008 — 11:30am",
      "content": "I use LinkedIn for my resume and to generally keep my address book up to date. Facebook I use to keep in touch with people and find out which famous designer is using a bunny on a magazine cover (which absolutely made me smile!). Both are useful. I've started using Plaxo, but wonder if I'm going a bit OTT.\n\n"
    },
    {
      "time": "16 Jan 2010 — 2:47pm",
      "content": "LinkedIn has been useful for me -- I would echo what aluminum said, that it's more about staying in touch with your work-related network, and I could directly relate using it to a couple projects I've had. I could see using this site if you were looking for a job, but it seems too overwhelming for any meaningful networking -- \"media\" is an enormous pool to swim in, something like Typophile would probably be more useful if you were looking to make type design contacts, for example.\n\n"
    },
    {
      "time": "19 Jan 2010 — 6:45am",
      "content": "Media Bistro is very big in the publishing world. It is read by a lot of book people, editors publishers, agents.\n\nI think you have to pass a clever test in order to post there. And if you post too many boring posts you are banned.\n\nNot a bad idea actually.\n\n"
    }
  ]
}
