{
  "id": "30880",
  "title": "Pottery Parable",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Not sure how many of you are familiar with [LifeClever](http://web.archive.org/web/20081007180201/http:/www.lifeclever.com/), recently Chanpory Rith posted a nice parable that I thought some of you might enjoy.\n\nThe ceramics teacher announced on opening day that he was dividing the class into two groups. All those on the left side of the studio, he said, would be graded solely on the quantity of work they produced, all those on the right solely on its quality.\n\nHis procedure was simple: on the final day of class he would bring in his bathroom scales and weigh the work of the “quantity” group: fifty pound of pots rated an “A”, forty pounds a “B”, and so on. Those being graded on “quality”, however, needed to produce only one pot—albeit a perfect one—to get an “A”.\n\nWell, came grading time and a curious fact emerged: the works of highest quality were all produced by the group being graded for quantity. It seems that while the “quantity” group was busily churning out piles of work—and learning from their mistakes—the “quality” group had sat theorizing about perfection, and in the end had little more to show for their efforts than grandiose theories and a pile of dead clay.\n\nThe original post: [http://www.lifeclever.com/2007/01/23/what-50-pounds-of-clay-can-teach-yo...](http://web.archive.org/web/20081007180201/http:/www.lifeclever.com/2007/01/23/what-50-pounds-of-clay-can-teach-you-about-design/ \"http://www.lifeclever.com/2007/01/23/what-50-pounds-of-clay-can-teach-you-about-design/\")\n\nAnyone have any thoughts to add, or maybe other parables?\n\n [‹ Egyptian slab serif](http://web.archive.org/web/20081007180201/http:/www.typophile.com/node/30127 \"Go to previous forum topic\") [Resource for contemporary type usage statistics? ›](http://web.archive.org/web/20081007180201/http:/www.typophile.com/node/30877 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007180201/http://www.typophile.com/user/6496\" title=\"View user profile.\">Asvetic</a>",
  "time": "<br>",
  "uid": "6496",
  "comments": [
    {
      "time": " 25.Jan.2007 12.51pm",
      "content": "The “quantity” group became graphic designers and the “quality” group became architects, right? ;-)\n\n"
    },
    {
      "time": " 25.Jan.2007 1.33pm",
      "content": "I thought the “quality” group became marketers…\n\npeace\n\n"
    },
    {
      "time": " 25.Jan.2007 5.42pm",
      "content": "It’s a useful idea; the more you do something the better you get, but there’s a missing corollary; some people really do only think about quantity, they never improve, and they never consider quality. Fred Goudy could really have stood to throw away a bunch of his designs. He crowed about the number of designs he had put out, but many came out unusable. Was the universe doing him a favor by burning his studio down twice?\n\nConversely, there are people who put quality first, and they probably **release** less work, but it isn’t necessarily true that they don’t explore, learn, or derive experience in the process. The message is really that you need both: spend substantial time learning by doing, discarding the early results, and eventually you will come up with something good.\n\nPottery is a good analogy; generally the first 100 pots anyone throws are crap. Some teachers of pottery won’t allow a student to fire a piece until they’ve thrown for years. It’s a good way to keep the student focused on the techniques of throwing without getting dazzled by glazes and other effects. It’s a focus on structure, which I think is very important.\n\nI’ve often said: throw away your first type design (or 3). Veronika Burian and Bram de Does are exceptions to this, of course.\n\n"
    },
    {
      "time": " 25.Jan.2007 6.05pm",
      "content": "This is only a little discouraging to me as I work on my first typeface... what it means is that it’ll likely be crap. Oh well. Still have to do it. And I’m learning a lot from this forum. Sadly, my full-time job only leaves me about 4-6 hours a week to work on font stuff.\n\n"
    },
    {
      "time": " 25.Jan.2007 6.43pm",
      "content": "With type design, the time away from the project is valuable too. Fresh eyes help you see what needs fixing.\n\n"
    },
    {
      "time": " 25.Jan.2007 6.49pm",
      "content": "Ha! It sounds like typophile through and through!\n\nMuzz\n\n"
    },
    {
      "time": " 25.Jan.2007 9.05pm",
      "content": "I feel your pain, metalfoot. I was in the same situation for quite a while. Now that I am freelancing I have a little more time for type work, but it never seems like enough. :-)\n\nAnyway, don’t be discouraged. I made (still make!) lots and lots of mistakes on my first font projects, but I’ve learned that making mistakes is good — as long as you learn from them and use that knowledge on your next project.\n\n"
    }
  ]
}
