{
  "id": "30891",
  "title": "New member Needs ideas for Web Content Type and Logo design type.",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m going on 24 hours of no sleep and I don’t even have any more Diet-Pepsi to drink - so please bear with me if I don’t make much sense.\n\nI have a new website under development - through a contract company that I found on eLance (based out of the UK and India) - and we’ve just completed the ’framework’ or phase one. Now I have to provide detailed content, graphic images, color choices as well as a logo and a type face choices.\n\nThe business is a (niche real estate/referral service) and I want the website to give potential clients (seller’s and agents - basically) the sense that they’ve come to the right place - that the company is capable of handling their problems - nationwide and that we are in some way - different (unique) in a way that makes us their obvious choice.\n\nI know that’s a lot to ask for a type face - but I thought I’d throw it our here to the community anyhow.\n\nI’ve attached an example of the ’template’ we are going to use as a basis and tweak until satisfied.\n\nThere will be various content on the home pages, including Articles, Announcements, Images, etc, as well as Larger Single Word Typefaces which may be located on top of a graphic image, which may be used as a link (one for each prospect type)inviting agents and sellers into their own special sub-sites.\n\nShould the content inside the frames (articles, about us, etc) have a different typeface then the links and menu items and other verbiage around the edges of the site - like here in Typohile?\n\nShould the typeface be consistent across all subsites - even if one prospect does not have access to another prospects ’registered’ subsite?\n\nRegarding the Logo - There are 3 Short Words of almost equal length XXXX XXXXX XXXXX - but the last two words are codependent and cannot/should not stand alone, whereas the first word can.\n\nI’d reveal the actual name - but I think I’d be in violation of a non-disclosure agreement I signed - so for now I’ll just say the predominant letters are S’s & O’s (see next: Oxxx SxOxx SxxxS).\n\nI’ve looked into RayTracing and PaintProgram Type modication - to make the logo look more interesting than standard lettering and some flat ’clip-art’ image (which is what the web development company came up with so far.)\n\nIs it true that not all typefaces are good in websites because not all browsers can read them?\n\nDoes this apply to a typeface that’s been turned into a graphic image such as a logo or a menu item?\n\nThis is really hard. Sorry for so many questions.\n\nAny advice would be greatly appreciated.\n\nHeidi\n\n| Attachment | Size |\n| --- | --- |\n| [swish template.jpg](http://web.archive.org/web/20081007181211/http:/typophile.com/files/swish%20template.jpg) | 61.14 KB |\n\n [‹ Joke Font Something Awful page](http://web.archive.org/web/20081007181211/http:/www.typophile.com/node/30804 \"Go to previous forum topic\") [Egyptian slab serif ›](http://web.archive.org/web/20081007181211/http:/www.typophile.com/node/30127 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081007181211/http://www.typophile.com/user/16467\" title=\"View user profile.\">hwhite</a>",
  "time": "<br>",
  "uid": "16467",
  "comments": [
    {
      "time": " 26.Jan.2007 7.42am",
      "content": "Body text is limited to what is installed on the end-user’s computer. Common installed fonts:\n\n[http://www.ampsoft.net/webdesign-l/WindowsMacFonts.html](http://web.archive.org/web/20081007181211/http:/www.ampsoft.net/webdesign-l/WindowsMacFonts.html \"http://www.ampsoft.net/webdesign-l/WindowsMacFonts.html\")\n\nText in an image is an image...not text...so you can render it in any typeface you wished.\n\n"
    }
  ]
}
