{
  "id": "30918",
  "title": "Logo for a fancy classy French restaurant - critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Fellow Typophiles,\n\nI was commissioned to design a new logotype for a fancy, chique restaurant in The Netherlands. The main design is an RC monogram (for Restaurant Claudius), but the client wanted a really detailed design to sandblast (is that right?) on the window, and for big prints like the banners they have in front of their restaurant.\n\nCheck the attachments for my design. I'm quite pleased with the decorative logo, I'm not too sure about the type treatment though. It's set in Perpetua Titling MT.\n\nAny thoughts and comments?\n\n| Attachment | Size |\n| --- | --- |\n| [logo voorbeeld groot.pdf](http://web.archive.org/web/20131020154058/http:/typophile.com/files/logo%20voorbeeld%20groot.pdf) | 684.91 KB |\n| [logoset complete.pdf](http://web.archive.org/web/20131020154058/http:/typophile.com/files/logoset%20complete.pdf) | 569.34 KB |\n\n",
  "author": "Wouter Spaak",
  "time": "27 Jan 2007 — 6:03am",
  "uid": "7344",
  "comments": [
    {
      "time": "27 Jan 2007 — 6:46am",
      "content": "what is the name of that RC sans? can't recognize it.\n\nbtw it looks very good. Like the serif treatment.  \ngood job.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n-  \ngolden ratio of passion. sansogno.coastaldisturbance.com\n\n"
    },
    {
      "time": "27 Jan 2007 — 7:33am",
      "content": "It's one of the weights of Neutra Text.\n\nThanks for the kind words!\n\n"
    },
    {
      "time": "27 Jan 2007 — 7:58am",
      "content": "Hi,\n\ni think you need (much) more vertical space between RESTAURANT and …  \nto separate the words and give them \"air\". So, it looks kind of unsettled.\n\ngreetings\n\n"
    },
    {
      "time": "27 Jan 2007 — 9:02am",
      "content": "I agree with poms - a touch more air would help th elegant feel. I also agree with garden - it looks very good. I love the ornamental logo; it's just gorgeous. I worry about scaling it down, but I see you have simpler versions that will scale endlessly. Nice work -- and it goes perfect with foie gras and Sauternes.\n\n"
    },
    {
      "time": "27 Jan 2007 — 1:00pm",
      "content": "My thoughts are the \"U's\" are awkward in the type treatment. If you don't like Perpetua then I'd recommend Requiem. It's a gorgeous font:\n\n[http://www.typography.com/catalog/requiem/testdriver/fineroman.html](http://web.archive.org/web/20131020154058/http:/www.typography.com/catalog/requiem/testdriver/fineroman.html \"http://www.typography.com/catalog/requiem/testdriver/fineroman.html\")\n\nMight fit more in line with what you're looking for. Great job thus far!\n\n"
    },
    {
      "time": "27 Jan 2007 — 1:24pm",
      "content": "Is the floral ornament in the background your own design, or is it stock?\n\n"
    },
    {
      "time": "27 Jan 2007 — 1:58pm",
      "content": "I agree with your concern about how well the Perpetua goes with the logo--which is strong.\n\nHave you tried different weights & italics of the Neutraface itself?\n\nAn interesting alternative with a classic feel is [Garda](http://web.archive.org/web/20131020154058/http:/vllg.com/Feliciano/Garda/mudTyper+Weights/).\n\nI'm also feeling that the black square in the middle of the ornament is too stark a transition. A one way to go would be to have an art deco style ornament, instead of the neoclassical leaves, so as to match with your nice logo in style.\n\n"
    },
    {
      "time": "28 Jan 2007 — 4:28pm",
      "content": "I actually like the transition from the leaves to the black square.\n\n"
    },
    {
      "time": "30 Jan 2007 — 1:28pm",
      "content": "I love the ornamental logo. It looks like something I'd buy at an antique store and hang it above my mantle (if I had a fireplace of course).\n\nedit: and i forgot to mention that i'm not sure if it's just my monitor, but i love the dark brown of the logo against the peachy pink background\n\n"
    },
    {
      "time": "7 Feb 2007 — 9:34am",
      "content": "I think it's your monitor, because I think it's supposed to be black on pink-ish. ;)\n\n"
    },
    {
      "time": "7 Feb 2007 — 10:04am",
      "content": "Yeah, I can see that now that I'm on my work computer. But I still like dark brown on peach!\n\n"
    },
    {
      "time": "18 Feb 2007 — 1:21pm",
      "content": "Beautiful!\n\n"
    },
    {
      "time": "19 Feb 2007 — 1:31pm",
      "content": "Hmmm, maybe it's just cause it's early morning here.\n\nThe RC and the Restaurant Claudius text seem REALLY disjointed to me. I like the floral ornament too, but again the integration of the RC doesn't fit. You're mixing retro (the RC) with classic, which could work, but IMO isn't just yet.\n\nPlease don't let this discourage you.\n\n----------  \n**Paul Ducco**  \n [Design, Melbourne](http://web.archive.org/web/20131020154058/http:/www.solid-creative.com/print.htm)  \n----------  \n [Little Mischief](http://web.archive.org/web/20131020154058/http:/www.littlemischief.com/)\n\n"
    },
    {
      "time": "21 Feb 2007 — 4:27pm",
      "content": "I don't like the \"lowercase\" \"u\" along with the capital letters, gives it a funny look. I think all-caps would look much better.\n\n"
    },
    {
      "time": "21 Feb 2007 — 10:38pm",
      "content": "Fernando, that's not a lowercase 'U', it's a cap 'U' with a stem, which has been part of the Perpetua typeface for over 80 years. I actually prefer stemmed 'U's, since no other letter (save 'Z' maybe) has such wonky contrast as an unstemmed 'U' (to my eyes anyway).\n\n- Lex\n\n"
    },
    {
      "time": "24 Feb 2007 — 5:34am",
      "content": "Hello all,\n\nthank you so much for the kindness. I really like the Garda typeface, I think Garda No. 2 or No. 3 will look extremely good with the monogram, because of the small serifs in 2 or the 'sans serifness' of 3.\n\n"
    },
    {
      "time": "13 Mar 2007 — 10:41am",
      "content": "I have to disagree with Ratbaggy - I think the victorian/opulent feel of the ornament and the clean, deco style of the text compliment eachother beautifully.\n\nWouter, do you know when this project will be finished? And if you can, possibly post some photos of it implemented?\n\n"
    },
    {
      "time": "23 Mar 2007 — 6:16pm",
      "content": "19 and 70 should be at the bottom of the RC Logo. It annoys me in the center.\n\n"
    },
    {
      "time": "26 Mar 2007 — 3:12am",
      "content": "The project is pretty much complete, the logo is anyway. The client was happy with Perpetua, and wouldn't fork over the $150 for Garda. Right now I'm working on the menus, business cards and stationary, and I'm in talks with a sandblaster to see what can be done with the front window.\n\nAlso, I've been having meetings with a silversmith to produce custom cutlery and an embroidery factory to get custom napkins.\n\nAnother factory I'm talking to creates wine glasses, coffee cups, dinner plates, side plates, champagne flutes et cetera. They'll be creating all the restaurant's dishes.\n\nAll of this should be finished somewhere in mid to late April, I'll be posting photos then.\n\n"
    },
    {
      "time": "27 Mar 2007 — 12:48am",
      "content": "nice one Wouter. Post pics when you got em.\n\n:)\n\n----------  \n**Paul Ducco**  \n [Web Design Wellington](http://web.archive.org/web/20131020154058/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "27 Mar 2007 — 7:40am",
      "content": "I can't wait to see the finished product in action. Now I want to take a trip to The Netherlands just to see it. ;)\n\nWhen I first saw your logo, I could easy picture it on all of the applications you just mentioned.\n\nCongratulations!\n\n"
    },
    {
      "time": "28 Mar 2007 — 5:52pm",
      "content": "Keep us informed, indeed.\n\n"
    },
    {
      "time": "15 Oct 2008 — 12:23pm",
      "content": "I'm a fan for sure! I actually like the space between Restaurant and Claudius. wow it's been a while since everyone posted on this logo haha. i missed the boat!\n\n"
    },
    {
      "time": "15 Oct 2008 — 2:28pm",
      "content": "Looking at the dates this project is probably long ago finished, but I want to add a technical note.:\n\nFor safety reasons I would suggest against sandblasting directly into exterior window glass, as it will weaken the glass and make it more prone to breakage. This method is better suited to small decorative pieces set in frames, or as part of a soldered glass arrangement as with stained glass. You can hang such framed pieces inside behind the exterior windows, and mount them in other locations as room dividers and such.\n\nIf it must go directly on an exterior window, there are vinyl products that simulate the sandblasted effect quite well, barring close tactile inspection.\n\n"
    },
    {
      "time": "22 Oct 2008 — 11:41pm",
      "content": "Elegant .\n\n"
    }
  ]
}
