{
  "id": "3091",
  "title": "Flathead",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "This one's kinda different. I was toying with the fact that we read partially by recognizing the tops of letterforms and what would happen if they were mostly the same shape. It also has some characters that allow you to build custom ligatures from just about any 2 or more characters. Any words, kind or otherwise? ;-)\n\n<!--attachment: flathead_show-26369.pdf*mime_pdf.gif*application/pdf*11.5*flathead*flathead_show%2epdf --><!--attachment: flathead_show-26369.pdf*mime_pdf.gif*application/pdf*11.5*flathead*flathead_show%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131020203157im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">flathead<br><a href=\"http://web.archive.org/web/20131020203157/http:/www.typophile.com/forums/messages/29/flathead_show-26369.pdf\" target=\"_blank\"><b>flathead_show.pdf</b></a> (11.5 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "matt_desmond",
  "time": "11 Feb 2004 — 3:14pm",
  "uid": "2919",
  "comments": [
    {
      "time": "11 Feb 2004 — 8:39pm",
      "content": "Pour your effort into this font. It is innovative and excellent.   \nIMHO.   \n   \nRandy\n\n"
    },
    {
      "time": "11 Feb 2004 — 9:11pm",
      "content": "I agree with Randy . This is a nice unique design worth completion and release. Touches on the transliteration style of type design. Nice work. Reminds me slightly of work from   \nMatius Gerardo Grieck- only less techno (which is a good thing)\n\n"
    },
    {
      "time": "11 Feb 2004 — 9:32pm",
      "content": "Very cool, this is an encouraging start. :-)   \n   \nI actually had the idea for the connectors way back and made a font called BeltLine that I'm sure no one remembers. It stemmed from MC's walker typeface (that sported all kinds of detachable serifs) of which I have a rare booklet on.   \n   \nAnyways, here's beltline circa 1997 (embarrasing):   \n   \n ![](http://web.archive.org/web/20131020203157im_/http:/www.typophile.com/forums/messages/29/26386.gif)\n\n"
    },
    {
      "time": "12 Feb 2004 — 12:18am",
      "content": "Connectors are great, I love them, I can't help making them, stuffing them into fonts, dingbats, whatever.   \nFlathead is good, I didn't like the w so much, I think it could be sharper, like some of the other characters.\n\n"
    },
    {
      "time": "12 Feb 2004 — 5:13am",
      "content": "I wanted to comment in addition on your attendtion to adjusting the horizontal/vertical for optical monoline. It looks ideal. I'm not put off by the w. I think it fits the round bottom flat top rythm you have working.   \n   \nAreas that you might look at:   \nk: problematic. your form may be the best, but it is odd. You won't be able to make this glyph fit the pattern anyways, what if you used the angle off the a for the top arm before hooking up? Also, the bottom arm would be more consistent if it bowed out right then stright down (thin the join like the a)   \n   \nt: Cheat the curve on the bottom. Make it start a little later so the t will sit down a little better. Not so much that you loose the roundness, but just a little sharper curve.   \n   \ncomma: wonkey   \n   \napostrophe: interesting   \n   \nKeep it up. I think you'll be able to do a nice upper set and a light and dark weight.\n\n"
    },
    {
      "time": "12 Feb 2004 — 9:34am",
      "content": "this is nice ... would especially love to see how   \nthe darker weights turn out.\n\n"
    },
    {
      "time": "12 Feb 2004 — 11:11am",
      "content": "Matthew, this is really nothing short of amazing. Looking at some individual glyphs one might be tempted to dismiss it as just another constructed font, but I first saw the texture of the setting, and it immediately hit me: this is the true Egyptian style! :-\\> One the other hand, your heavily ligated\\* settings look a lot like the Indian Devanagari script! Really huge potential there, in terms of a display face to accompany Indian text, or just Latinate text about Indian stuff. You've really shifted the nature of the Latin alphabet, but with practical subtlety - bravo.   \n   \n\\* I'd concentrate very heavily on this; and do look at Process's linguistically-aware (sorry, John - \"orthographic\" means something else to me) Lingua design -and its development- when deciding what pairs to provide.   \n   \nThe glyphs that don't work are the \"k\" and \"x\". For the former you need a simpler shape, or you could try the structure with a loop on top and a short arm on the bottom - or maybe an open loop with an arm. For the \"x\" try making the top a semi-circle and the bottom two distinct arms, like the \"H\" in PsyOps's inimitable Spanner.   \n   \nOther problematic glyphs are the \"t\" (not sure what to do about it) and the \"w\" (I'd make it like two \"v\"s).   \n   \nAnd yes, do make heavier weights (with no stroke modulation).   \n   \nThis font also has potential for much more decorative treatments, like nipples\\* at the bottom of the bowls.   \n   \n\\* I squarely blame Tanya for starting me off on that foot today.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Feb 2004 — 11:25am",
      "content": "what and have saggy breasts? nipples smack dab in the middle of your counter sure but not on the bottom. hmm maybe not - might be too mason-y.   \n   \nI especially like the k, and think its smart how the a has a diagonal and the e dosen't.\n\n"
    },
    {
      "time": "12 Feb 2004 — 8:58pm",
      "content": "Good suggestions everyone. Thanks for noticing the monoline adjustments, Randy.   \n   \nRE: the apostrophe, that was just one of the connectors used in the place of an apostrophe because one does not exist yet. :-)   \n   \nI was on the road all day today, but had a chance to update a few of the characters tonight:   \n   \n ![](http://web.archive.org/web/20131020203157im_/http:/www.typophile.com/forums/messages/29/26434.gif)   \n   \nI made the \"e\", \"c\", and \"s\" a little skinnier. I curved the bottom of most letters that terminated flat before. I also changed the curve on the \"t\" and \"j\".   \n   \nI like the curved \"x\" but don't know if it fits the grid right.   \n   \nI'm thinking about slanting the \"e\" and \"s\" like how the \"a\" is. Any comments on that?   \n   \nI also can't wait to see how the bold and light versions come out, not to mention the XXX version that will have nipples and more supple curves. ;-)\n\n"
    },
    {
      "time": "12 Feb 2004 — 9:19pm",
      "content": "What's different in the \"a\"?   \n   \nI like the new \"c\", \"j\" and \"s\", but I think you should revert to the old \"e\" and \"g\" - don't worry about having some formal divergence - I think this face needs it, actually.   \n   \nI'm unsure about the \"k\", \"t\" and \"x\" - could we see some text/words?   \n   \nhhp\n\n"
    },
    {
      "time": "12 Feb 2004 — 9:31pm",
      "content": "leave the e and a as is I'd say - it would be too obvious if both slanted and - in text you only need those slight subtleties right? - sides slanting the e would screw up the ligature deal\n\n"
    },
    {
      "time": "13 Feb 2004 — 7:01am",
      "content": "Here are some words and text:\n\n<!--attachment: flathead_words-26449.pdf*mime_pdf.gif*application/pdf*12.1 **flathead_words%2epdf --><!--attachment: flathead_words-26449.pdf*mime_pdf.gif*application/pdf*12.1** flathead_words%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131020203157im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131020203157/http:/www.typophile.com/forums/messages/29/flathead_words-26449.pdf\" target=\"_blank\"><b>flathead_words.pdf</b></a> (12.1 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\nThe a was not changed at all. I'm not sure why I put it in the lineup.\n\n"
    },
    {
      "time": "13 Feb 2004 — 9:22am",
      "content": "The uppercase:\n\n<!--attachment: flathead_uppercase-26467.pdf*mime_pdf.gif*application/pdf*13.5 **flathead_uppercase%2epdf --><!--attachment: flathead_uppercase-26467.pdf*mime_pdf.gif*application/pdf*13.5** flathead_uppercase%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131020203157im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131020203157/http:/www.typophile.com/forums/messages/29/flathead_uppercase-26467.pdf\" target=\"_blank\"><b>flathead_uppercase.pdf</b></a> (13.5 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\nOn the lowercase, I like the bottom curves too much on the e and g. I think they bring some harmony to the bottoms of the letters.\n\n"
    },
    {
      "time": "13 Feb 2004 — 9:38am",
      "content": "\"k\": Try removing the short lower bar between the stem and the rest.   \n\"t\": I'd make it wider, and extend the bar relatively more.   \n\"x\": Not sure, it seems a bit extreme. Try flipping it vertically, or maybe moving the legs apart a bit.   \n   \nCaps: Your relative size/weight is right on. Some of them (like the \"B\") are very nice. Others (like the \"A\") seem too square. The \"J\" is wide. I like the difference between the \"M\" and \"N\". I'd make the head of the \"P\" bigger. I'd give the \"Q\" a straight vertical tail. Try a wider \"W\".   \n   \nBTW, for the caps you might actually try flipping the verticaly flat/round orientation to see how it looks. Some letters (like the \"D\") will be happier, although it might backfire in the overall.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Feb 2004 — 10:13am",
      "content": "This is really beautiful! I like the way the color font looks like certain early arabic scripts & of course as Hrant said Indian ones as well. It was hard to see if the changes you made made the text easier to read or not. Maybe they made the letterforms too homogenous. My inexperience at evaluation greeking is probably to blame... Would you post something in English?   \n   \nBTW - Is the intent of this face that it be good at long text settings or is it meant to be mostly a display face? I think it has real potential as a text face actually! It is remarkably pleasant to roll your eyes over.   \n   \nI like the idea of the 'x' but what about two rounded bowls ( like the one on top) instead of the hybrid? For some reason the hybrid is catching & holding my eye for too long.   \n   \nThe y is doing the same thing but to a much lesser extent. I think it's decender looks unrelated to the rest of the font.   \n   \nHave you looked at the forms from early arabic Kufic Script [http://www.arabiccalligraphy.com/resources\\_detail.php?resId=1](http://web.archive.org/web/20131020203157/http:/www.arabiccalligraphy.com/resources_detail.php?resId=1) or indian ( hindi + lots of others ) scripts? The hindi example is the best one for me in terms of showing the effect of the running horizontal line with shapes seeming to hang off it. Hindi is more extreme but the simulatity of effect is striking to me!   \n   \nI am excited to own this one.\n\n"
    },
    {
      "time": "13 Feb 2004 — 10:20am",
      "content": "\\> Maybe they made the letterforms too homogenous.   \n   \nI think so.   \nIt's tempting to see this as a display face, and I think it would SELL better as such. But i think Matthew has an opportunity to reward people brave enough to use this for text by keeping more of the divergence, and thus produce something truly progressive.   \n   \nMaybe there should be two weights: this one for text, and a much darker and more homogenous one for titling. But then you do need another weight (a semi) for emphasis - I think italics can be safely avoided here.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Feb 2004 — 4:43pm",
      "content": "I originally figured this would be a display face, which is why I added the connectors, although they could be useful for some tricky text setting also. I do think it could work as a very untraditional text font, maybe for video game ads or something. I highly doubt you'd want to use it for a book, though.   \n   \nThe hybrid \"x\" is messing with me also, I think the solution is to either do a full diagonal or the double round shape.   \n   \nH: i took your advice and widened the \"t\" and made the \"J\" not quite so wide. Your idea for the \"k\" was cool and may work for an alternate char. I think.   \n   \nHere are some more characters and english paragraphs, the numerals are lining and look pretty funky:\n\n<!--attachment: flathead_more-26492.pdf*mime_pdf.gif*application/pdf*14.3 **flathead_more%2epdf --><!--attachment: flathead_more-26492.pdf*mime_pdf.gif*application/pdf*14.3** flathead_more%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131020203157im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131020203157/http:/www.typophile.com/forums/messages/29/flathead_more-26492.pdf\" target=\"_blank\"><b>flathead_more.pdf</b></a> (14.3 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "14 Feb 2004 — 1:26am",
      "content": "Making it really really work for a book would be tricky but I bet it could be done judging by the way the latest pdf flows. Still, you must do as you think best! If I can encourage you to consider both seriously I would be pretty happy.   \n   \nIt isn't often that a radical looking face reads this well IMHO. The version with the full on Hindi style lines could be the display...   \n   \nSpecific things: I really like the new X it works really well as you encounter 'nextel' The new open lowercase k is really great too. The 2 is perplexing. The 3 less so but a bit. Could the 3 be made from two curves?   \n   \nThis is perhaps a bit cheeky, but - What do you think of increasing the height of the caps a bit? Right now The lowercase L seemingly kisses the capital C on the head but they could act more like a ligature.\n\n"
    },
    {
      "time": "14 Feb 2004 — 8:24am",
      "content": "I am definitely going to take care in designing the punctuation and extra characters so that they will not prohibit text setting.   \n   \nThe only thing that I wory about is that if I try to make this font both a text and display face, one or the other is going to suffer in the end. I'm a believer in doing one thing and doing it well. Maybe this font will be able to transcend that.   \n   \nI'm either going to increase the cap height or take the arm off of the \"l\". Whenever I see the double \"l\" I get distracted.   \n   \nI may have to cheat on the numbers to make them more recognizable.\n\n"
    },
    {
      "time": "14 Feb 2004 — 10:02am",
      "content": "What do you mean by cheat? It seems clear that there are some rules you are applying in order to create the look & distict structure you have - you mean deviation from those no? But think of regular roman characters. They follow rules too & yet even there you have characters with distinct personalities - the M is really wide etc so - it seems like you could have judicious exceptions in several places & end up with a face with increased interest & readability.   \n   \nDid you cheat with the open LC k?   \n   \nOf course you are right that in general it is silly to try to make a face that is both solid in text & display but I think you have a shot.   \n   \nI am thinking of J Hoefler's Didot where display was accounted for in the details at large sizes rather than in the basic appraoch. Those faces can be really nice in display. It's not a completely parrallel example - especially since some folks hate it when a didone font is set in book texts - but the basic idea being that display quality & text quality could be addressed in seperate cuts of the same family with happy results. That is a really classic approach after all.\n\n"
    },
    {
      "time": "14 Feb 2004 — 10:30am",
      "content": "I guess it's not so much cheating as bending the rules of construction a little and deviating from the grid somewhat, which will be ok.   \n   \nI think making an alternate to use for display will allow me to make this version more text-friendly. That way each version will be specialized.\n\n"
    },
    {
      "time": "14 Feb 2004 — 12:42pm",
      "content": "\\> if I try to make this font both a text and display face   \n   \nNo, I agree that a given single font shouldn't try to do that - I was talking about having different cuts of the design for different uses. But sure, you have to do one first anyway, so yeah, choose one.   \n   \nBTW, make sure the Rules remain merely a means and don't become an end to themselves!   \n   \nhhp\n\n"
    },
    {
      "time": "14 Feb 2004 — 12:52pm",
      "content": "Ok, I've been trying to specialize this thing into two cuts: One face for text that has more serif/roman tendencies, and one for display with sans-style simplified construction.   \n   \nIt's almost beginning to be a complete solution for text and titles.   \n   \nThe numerals have been vastly improved in my opinion.   \n   \nIt feels like it's going in the right direction...\n\n<!--attachment: flathead_book_display-26536.pdf*mime_pdf.gif*application/pdf*19.6 **flathead_book_display%2epdf --><!--attachment: flathead_book_display-26536.pdf*mime_pdf.gif*application/pdf*19.6** flathead_book_display%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131020203157im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131020203157/http:/www.typophile.com/forums/messages/29/flathead_book_display-26536.pdf\" target=\"_blank\"><b>flathead_book_display.pdf</b></a> (19.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "14 Feb 2004 — 1:07pm",
      "content": "Huh, so you'd already started! :-)   \n   \nI think this is right on. The Display is looking positively Nordic, btw. Some things: Why the serif on the Display \"el\"? Maybe the Text \"Q\" should have a curly tail after all (like the leg of the \"R\"). Try making the top of the Display \"K\" a circle quadrant.   \n   \nBTW, I had an idea: it hit me that Flathead has a certain Avant Garde feel to it, so what you might do with the display cut (or a version of it) is match the weight/proportions/etc. of AG, so people can intermix them in funky ways.   \n   \nhhp\n\n"
    },
    {
      "time": "14 Feb 2004 — 1:45pm",
      "content": "I think my nordic heritage may be coming into play subconsciously. ;-)   \n   \nI put the serif on the display \"l\" because I didn't like it on the text version and it makes the display version just that little bit more different. I may get rid of it because you can make that same shape with one of the connectors.   \n   \nI think I will revert to the curved tail on the \"Q\" on the serif version, good idea.   \n   \nMixing with Avant Garde, that's an awesome and crazy idea. I'll have to look into it.   \n   \nAfter printing this thing out, I have to say that it's making me excited for the readability factor. It's funny that in the beginning the idea was to lose some of the readbility in favor of the display properties. Actually what happened, I think, was that the strong horizontal line actually created a path for the eye to follow.\n\n"
    },
    {
      "time": "14 Feb 2004 — 9:42pm",
      "content": "I got a few more things done, hopefully for the better...   \n   \n-Updated the numerals (I know the lining ones need to be heavier)   \n-Changed some of the uppercase characters on the book version (E, Q, G, L)   \n-Updated misc spacing and some other things.\n\n<!--attachment: flathead_book_display2-26555.pdf*mime_pdf.gif*application/pdf*22.6 **flathead_book_display2%2epdf --><!--attachment: flathead_book_display2-26555.pdf*mime_pdf.gif*application/pdf*22.6** flathead_book_display2%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131020203157im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131020203157/http:/www.typophile.com/forums/messages/29/flathead_book_display2-26555.pdf\" target=\"_blank\"><b>flathead_book_display2.pdf</b></a> (22.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "15 Feb 2004 — 5:51pm",
      "content": "I like Flathead too, and have projects I'd like to use it on. :-) One possible, minor quibble: I can think of cases where the similarities in the five and the \"S\" can cause confusion. Do you think that this is something that should be addressed?\n\n"
    },
    {
      "time": "15 Feb 2004 — 9:19pm",
      "content": "Ah, the joys of tweaking characters and making decisions. :-)   \nI've been trying to weed out the unusually odd characters in both versions and think that I'm almost there.   \n   \nThe following were changed on the book version: uppercase B, G, and the numerals.   \n   \nOn the display version I got rid of the weird K and used the same new B from the book version.   \n   \nI fixed the S5 issue, thanks for pointing that out Malyce.   \n   \nI can't decide whether to make the book version's \"b\" and \"d\" like the \"a\" and \"u\" where the bowl hits the vertical at the base of the character.\n\n<!--attachment: flathead_book_display3-26608.pdf*mime_pdf.gif*application/pdf*24.0 **flathead_book_display3%2epdf --><!--attachment: flathead_book_display3-26608.pdf*mime_pdf.gif*application/pdf*24.0** flathead_book_display3%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131020203157im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131020203157/http:/www.typophile.com/forums/messages/29/flathead_book_display3-26608.pdf\" target=\"_blank\"><b>flathead_book_display3.pdf</b></a> (24.0 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "16 Feb 2004 — 2:27pm",
      "content": "The \"d\", yes, make the stem reach the baseline - but the \"b\", no.   \n   \nhhp\n\n"
    },
    {
      "time": "14 Feb 2004 — 1:50pm",
      "content": "I share the enthusiasm for this fine oddity.   \n   \nIf you want the Book version to be considered for use in text I   \nwould remove more of the eccentricities. This doesn't mean you   \nhave to abandon the overall concept and form, but try to take on   \nsome more standard forms for some of the wackier characters.\n\n"
    }
  ]
}
