{
  "id": "30929",
  "title": "a pair for bodoni",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "does anyone know of a typeface that goes well with bodoni?\n\n",
  "author": "ALJ",
  "time": "27 Jan 2007 — 6:34pm",
  "uid": "16372",
  "comments": [
    {
      "time": "27 Jan 2007 — 7:32pm",
      "content": "Anything!\n\n\\> Really?\n\nYes. What matters most is your subject matter and audience.  \nTell us more about your project.\n\n"
    },
    {
      "time": "27 Jan 2007 — 7:35pm",
      "content": "it's for the graduation invitation + program for my college. I'm using bodoni for the big type but I'm looking for another face (or faces) to set the small information in. it has to be super legible for all the parents & grandparents. any ideas?\n\n"
    },
    {
      "time": "27 Jan 2007 — 8:27pm",
      "content": "What is your subject of studies? How much information is there? Would you consider your design classical or contemporary? Formal or casual?\n\n"
    },
    {
      "time": "27 Jan 2007 — 8:33pm",
      "content": "it's for a fine art & design program. it has to be classic/formal/serious but also a little bit wacky since it's an art school. there is a lot of information: lists of names, times of exhibitions, receptions, hotels, restaurants, etc. legibility is really important, which is why I don't want to use bodoni for the small stuff...\n\n"
    },
    {
      "time": "27 Jan 2007 — 8:51pm",
      "content": "Great. Are you limited to what's available in your school's type library?\n\n"
    },
    {
      "time": "27 Jan 2007 — 11:32pm",
      "content": "If Bodoni is your display type, and you are looking for a legible body type, consider a Neoclassical type like Baskerville, or a Scotch Roman like Georgia or Bell. These would also be very scholarly choices in terms of their appearance, and they are very readable as well.\n\nBulmer is another good choice that sort of straddles the boundary between the Neoclassical types like Baskerville and the Romantic types like Bodoni.\n\nI would steer clear of anything humanist (like Hoefler Text, any Garamond or Adobe Caslon) as they might clash with the high contrast and geometry of Bodoni.\n\nIf you want to use a Bodoni for the body copy, ITC Bodoni or Berthold Bodoni Old Face would be good choices.\n\nDavid Thometz\n\n"
    },
    {
      "time": "28 Jan 2007 — 7:22am",
      "content": "Stephen, no I am not limited to my school's type library.  \nDavid, thanks for the ideas!\n\n"
    },
    {
      "time": "28 Jan 2007 — 8:39am",
      "content": "ITC Bodoni Six is my favorite typeface. It's totally funky, yet classical and elegant. It's a chunky typeface, optimized for small point sizes, but even at 12 pts it's still pretty cool. It totally fits the <cite>classic/formal/serious but also a little bit wacky</cite> requirement.\n\nAnd because it is an authentic Bodoni, no one can call your bluff if you use it with a display Bodoni.\n\n"
    },
    {
      "time": "28 Jan 2007 — 11:59am",
      "content": "I third the ITC Bodoni. Also, [Farnham](http://web.archive.org/web/20150226170517/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=farnham), [FF Clifford](http://web.archive.org/web/20150226170517/http:/www.fontshop.com/showfont.cfm?fid=FF.11069.0.0), [FF Acanthus](http://web.archive.org/web/20150226170517/http:/www.fontshop.com/showfont.cfm?fid=FF.11157.0.0), and even more funky, [FF Danubia](http://web.archive.org/web/20150226170517/http:/www.fontshop.com/showfont.cfm?fid=FF.11341.0.0).\n\n"
    },
    {
      "time": "28 Jan 2007 — 12:01pm",
      "content": "great ideas. thank you!\n\n"
    },
    {
      "time": "31 Jan 2007 — 3:37am",
      "content": "Futura? Or is that too radical?\n\n"
    },
    {
      "time": "31 Jan 2007 — 6:00am",
      "content": "Goergia? - i think Georgia was optimised for electronic (display) use, i wouldnt use it for print. Or am i wrong?\n\n"
    },
    {
      "time": "31 Jan 2007 — 6:14am",
      "content": "Our Bodoni was specifically designed to pair with Helvetica.\n\n"
    },
    {
      "time": "31 Jan 2007 — 6:28am",
      "content": "great! thank you so much.\n\n"
    }
  ]
}
