{
  "id": "3092",
  "title": "How to Explain",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was talking to a friend the other night, and they inquired about [Kilbirnie Sans](http://web.archive.org/web/20050516050713/http:/www.typophile.com/forums/messages/29/22308.html?1071296773). I said it was coming along just fine. They asked whether I had finished it yet, as it has already been a couple of months. I replied that designing a typeface generally takes longer than a couple of months, especially if you are new to the game. \"Why can't you just get 'stuck in' and finish it?\"   \n   \nI find it is quite hard to answer this, as I butt up against the Kiwi \"She'll be right\" attitude and a general lack of understanding about what I am doing, which I suppose I should blame myself for not explaining properly.   \n   \nHow does everyone else explain to their friends/family what they are doing (in regards to typography/type design) ? What is the best way to explain that these things take time, without just saying \"These things take time?\"   \n   \nkris.\n\n",
  "author": "kris",
  "time": "Wed, 2004-02-11 16:38",
  "uid": "1519",
  "comments": [
    {
      "time": " Wed, 2004-02-11 17:22",
      "content": "What I like to do is open up fontographer and size the window so you can see all of the characters. I then show the person how many characters there are to design.   \n   \nOr I just tell them it will be ready when it's ready. :-)   \n   \nType design is like painting 256 complex paintings that all must work together and be of similar design while having individual balance and harmony throughout.\n\n"
    },
    {
      "time": " Wed, 2004-02-11 17:44",
      "content": "i told my dad one night that fontography is todays equivalent of working on one's penmanship.\n\n"
    },
    {
      "time": " Fri, 2004-02-13 17:43",
      "content": "A lot of people see the world in terms of quantifiable tasks. If you paint a tenth of a fence in an hour, you can say with reasonable certainty how long it should take you to finish if you just keep working. People who aren't familar with creative work think that the only reason artists and engineers can't just say how long something will take is that they must be lazy and stubborn, and that they just need more carrots and/or sticks to make them spend more of their time working and less time goofing off.   \n   \nHere's a good analogy that most people will be familiar with:   \n   \nCreative work is like driving lost. There is no mathematical correlation between how far you've driven and how close you are to your goal, and driving faster will not necessarily get you there faster, because you don't know if you're pointed in the right direction. You have to make choices about where to turn based on what looks right, and some may be misleading and lead you astray. When you ask for directions, you can't be sure that the people you ask know any more than you do. In fact, let us say that you are not trying to find your way home or to a specific destination, but trying to find a good place to eat in an unfamiliar area. How good? What are you in the mood for? What is open? Hey, here's a diner. Should you stop at this diner, or do you want to risk spending more time trying to find someplace better? Do you even know if this diner might not serve the best food in the area? Oops, you've passed the diner already. Maybe there's nothing else in this direction. Maybe there is if you just keep going a little farther. Do you think you should turn around? There's a lot of traffic, will it take longer to turn around than to find someplace else? Maybe you should pull over somewhere to decide before you go too far. Maybe this side street will lead to a parking lot where you can stop and think. Oh, hey, there's an interesting restaurant down here! What luck. Uh oh, looks like there's a wait. Yeah, 45 minutes for a table. Should we wait, or get back in the car?   \n   \nNo solution is right or wrong, just better or worse, and only subjectively so. Some people are fine with eating McDonald's every day, and it's easier for them to make those decisions. You could probably drop them in a different county in America every day, and they could learn to estimate how long it will take to be finished looking for a nearby McDonald's. Other people always want to go somewhere different, somewhere they've never been before, and every choice is an adventure. They could live in the same place for years, and every time they set out to get dinner they would still have difficulty telling you what time they'd be back.\n\n"
    },
    {
      "time": " Fri, 2004-02-13 19:29",
      "content": "_Creative work is like driving lost. There is no mathematical correlation between how far you've driven and how close you are to your goal, and driving faster will not necessarily get you there faster, because you don't know if you're pointed in the right direction._   \n   \nIf you want to make anything like a living from designing type you have to know where you're going and how long it is going to take you to get there. If a potential client asks 'Can you do this? How long will it take? What will it cost?', you'd better be able to answer those questions.\n\n"
    },
    {
      "time": " Sat, 2004-02-14 15:56",
      "content": "When I agree to work for someone else, I do answer those questions. When I am creating a product on my own, I will take the time I need to meet my own standards, and then put it up for sale when I see fit. I would like to think I made a very insightful and above all _relevant_ post given the topic. I am all of 32 years old, and while I may be rather idealistic as an artist, I am sick and tired of being given \"fatherly advice from a real live professional\" everywhere I go.\n\n"
    },
    {
      "time": " Sat, 2004-02-14 16:37",
      "content": "\\> you'd better be able to answer those questions.   \n   \nBut only in the context of the client's expectations, not the   \nreality of how much time it will actually end up taking. :-)   \nPadding isn't just for bras.   \n   \nhhp\n\n"
    },
    {
      "time": " Sat, 2004-02-14 16:45",
      "content": "\"Padding isn't just for bras\"   \n   \nI'm gonna' remember this next time I 'contract' you for some work. :P   \n   \nHildebrant.\n\n"
    },
    {
      "time": " Sat, 2004-02-14 16:59",
      "content": "Hey, look at the price, and the quality, and THEN decide if I'm worth it. ;-)   \nHow? I work fast.   \n   \nWhat I was trying to say in the context of this thread is that padding isn't   \nnecessarily for swindling clients - it can be very useful to counteract the   \nunpredictability of creative work, something difficult for \"bottom-line\"-type   \nclients to accept.   \n   \nhhp\n\n"
    },
    {
      "time": " Sat, 2004-02-14 17:06",
      "content": "\"it can be very useful to counteract the   \nunpredictability of creative work, something difficult for \"bottom-line\"-type   \nclients to accept.\"   \n   \nI could not agree more. I'm just giving you a hard time.\n\n"
    },
    {
      "time": " Sat, 2004-02-14 17:53",
      "content": "\\>how long it is going to take you to get there   \n   \nR.G. Collingwood in his book 'What is Art?' says that one of the marks of craft, as opposed to art, is that the craftsman has a clear idea of his goal. By contrast, the artist, who strives for a kind of self-expression, may not know the goal until the finish. The goal as well as the means involve a problem-solving process.   \n   \nI do think it is the mark of a professional craftsman that he or she can tell you how long it will take to produce a particular product at given level of quality.   \n   \nBut from my view as an outsider, there is often a mix of art and craft in creating typefaces, no? If so, for some projects, and maybe the most satisfying, the time they take may not be so predictable.\n\n"
    },
    {
      "time": " Sat, 2004-02-14 20:08",
      "content": "\\>I am sick and tired of being given \"fatherly advice from a real live professional\" everywhere I go.\\<   \n   \nYou have made yourself very clear, and I doubt any \"real live professional\" will ever give you any advice, \"fatherly\" or otherwise, ever again.   \n   \nGood luck learning on your own.\n\n"
    },
    {
      "time": " Sat, 2004-02-14 22:49",
      "content": "All advice I have gotten from artists who assume I am their inferior falls into one or both of two categories: false generalizations of well-worn paths to success, and things I long ago learned myself. Usually framed in such a way as to gently discourage the wide-eyed neophyte from believing he can make it.   \n   \nAll the valuable advice I've ever gotten has come from people who are willing to treat me like a fellow creative person, no more, no less.   \n   \n\"Communication is only possible between equals.\"   \n--Hagbard Celine in _Illuminatus_   \n   \nI am sorry to have been so snippy but Valentine's Day makes me irritable. Correct me if I am wrong to have assumed that I am being talked down to.\n\n"
    },
    {
      "time": " Sat, 2004-02-14 22:52",
      "content": "\\> Valentine's Day makes me irritable.   \n   \nTry chocolate! :-)   \n   \nhhp\n\n"
    },
    {
      "time": " Sat, 2004-02-14 23:26",
      "content": "_All advice I have gotten from artists who assume I am their inferior falls into one or both of two categories..._   \n   \nWell don't consider that I was giving you advice, and certainly don't consider me an artist, or as someone talking down to you. I'm a jobbing type designer, and I was expressing the reality of making a living from designing type. Your assertion that 'creative work is like driving lost' implies that the work of someone who knows where he's going is relatively uncreative, which is more than a little insulting to those of us who work quickly and assuredly. Creative work is not one thing -- not always wandering in the dark, not always turning on the proverbial lightbulb --, but takes many forms. Some people work slowly, some people work quickly, and that's as true of painters, sculptors, writers and composers as it is of type designers. Unsurprisingly, the quick ones tend to make more money and are better able to live off their art or craft.   \n   \n_Usually framed in such a way as to gently discourage the wide-eyed neophyte from believing he can make it._   \n   \nI certainly wouldn't seek to discourage you or anyone else. If I _were_ to offer advice to anyone, it would be this: if you would like to be able to make a living doing nothing but designing type, get fast. If you only want to design type on the side, while doing something else as your day job, take all the time you want. I don't think either approach is in itself more or less creative than the other: the creativity is in the result, not the time it takes.\n\n"
    },
    {
      "time": " Sun, 2004-02-15 01:15",
      "content": "Thank you for clearing that up. I hope you understand why I took your words the way I did and not how you meant them; absolutes like \"if you want to make money you _have to_ etc.\" don't have the same nice open tone as \"creative work takes many forms.\" Sadly, I don't think I misread Mr. Montalbano's dismissive smack-down, which put me further on the defensive.   \n   \nBut I see that the problem is that I was not the first to feel under attack. Let us discuss this more. All work has two parts, the art and the craft. Having a boss adds more craft to the equation, which is the equivalent of having a map, because some decisions have been made for you. If you know _exactly_ what you want your finished work to look like, you are already done with the art and the rest is craft.   \n   \nI submit that if you are blessed with the gift of speed, your ability to estimate completion time may be proportionally as good as a slower worker, but will seem more accurate and concrete because your \"padding\" is negligible. Let's say it takes you an hour and me a day to solve the same problem, and then we are presented with another comparable but bigger challenge. If I think to myself, \"gosh, it could take as little as two days, or as much as four,\" that's exactly what I have to say aloud (or, more wisely, \"it will take me four days\"). If you think to yourself, \"gosh, it could take as little as two hours, or as much as four,\" you can say, \"I'll have it this afternoon, no sweat!\" and if you get caught up in the details and it takes you twice as long as usual, nobody notices. When doing really creative work, we _are_ both still wandering and exploring, you are just wandering and exploring much faster. And perhaps you have better intuition that makes you more likely to choose the best path where others would try a dead end, but that's not the same as truly knowing beforehand.\n\n"
    }
  ]
}
