{
  "id": "30928",
  "title": "Readability and Legibility",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Can someone tell me the proper definitions for:\n\nReadability\n\nLegibility\n\nAs time goes on, I continue to find the two used interchangably. Can anyone relate this to semiotics?\n\n",
  "author": "Chris Dean",
  "time": "27 Jan 2007 — 5:49pm",
  "uid": "/web/20130620170115/http://typophile.com/readthetype",
  "comments": [
    {
      "time": "27 Jan 2007 — 5:54pm",
      "content": "[http://typophile.com/wiki/Readability](http://web.archive.org/web/20130620170115/http:/typophile.com/wiki/Readability \"http://typophile.com/wiki/Readability\") (covers both).\n\n"
    },
    {
      "time": "29 Jan 2007 — 11:25am",
      "content": "I would say that legibility is more to do with handwriting (doctors' prescriptions are the archetypical item in the field) whereas readability is concerned with texts that are set in type. The latter term entails the relative ease or difficulty we have in reading a column of text. Eye comfort could be an equivalent expression. Variants such as the width of the column in relation to type size and interlinear space (leading) are essential factors that determine the degree of readability of a text. Type size alone is also a factor but this is usually less important than leading and column width. The design of the type is another factor: some types (Utopia or for example) require considerable leading in most settings because of an unusually large x-height. Other more classical romans (like most of the digital ones named Garamond) usually look good and can be read easily even in fairly wide columns because of the small x-height which naturally provides space between the lines which are only occasionally occupied by the relatively long descenders and ascenders. Readability also has to do with the designs of type that we are familiar with reading in books or other publications. We have difficulty with reading texts of more than a few words in uppercase simply because we have been brought up on lowercase for continuous texts. Likewise most of us would have some difficulty reading any text set in a gothic type (or Blackletter type if you are American).  \nNevertheless, there are occasions when illegibility is also a problem which concerns type. Two examples that one frequently sees are: a) texts that have been set in light types or delicate neo-classical types such as Bauer Bodoni or Didot and have been printed white or in a light colour on a dark ground: the ink-spread (which will happen to some degree even in offset printing) tends to fill in the delicate strokes and the hairlines – especially in small sizes of type; b) when type (headline or text) runs over a photogaphic background which disturbs immediate perception of words.\n\n"
    },
    {
      "time": "29 Jan 2007 — 12:58pm",
      "content": "Legibility used to mean the ability to decifer symbols as in identify glyphs or alphanumeric characters. Readability was initially intended to distinguish the comfort level in reading running text. It was assumed that you could identify the glyphs but all the other reading factors also came into play including line length and leading, etc..  \nToday, there is confusion among the masses and it seems only scientists and typophiles differentiate any more :-)\n\nChrisL\n\n"
    }
  ]
}
