{
  "id": "30947",
  "title": "kerning help please",
  "forum": "Typography / Composition",
  "tags": [
    "Typography / Composition"
  ],
  "content": "hi there.\n\ni'm working a new logo for Tricific, a linen manufacturer and wholesaler. the company has been around for about 40 years and they wanted a new identity to show their history and success.\n\ni've come up with a simple logo that resembles a corner of a piece of fabric. the company sells a wide range of table cloths, napkins, bedsheets, and aprons, among other products, and i wanted to hint at the textile/linen nature of all these items without going into the details of stitching, threads, etc.\n\nfor the wordmark i've used minion bold and i'm trying to finalize the character spacing and logo size and position right now. any comments will be much appreciated. thanks a lot.\n\n[edit]\n\nok i've tried kerning the logo, but i'm not very good at it. could someone please give some pointers? please refer to logo3.jpg. thanks.\n\n| Attachment | Size |\n| --- | --- |\n| [tricific\\_logo1.jpg](http://web.archive.org/web/20131108120100/http:/typophile.com/files/tricific_logo1.jpg) | 91.42 KB |\n| [logo3.jpg](http://web.archive.org/web/20131108120100/http:/typophile.com/files/logo3_0.jpg) | 156.66 KB |\n\n",
  "author": "derekc88",
  "time": "28 Jan 2007 — 5:30pm",
  "uid": "16115",
  "comments": [
    {
      "time": "29 Jan 2007 — 2:02pm",
      "content": "I like the second option the best, but the spacing still needs a little work. My eye is drawn to the IFI combo, as it seems spaced differently than the rest of the letters.\n\n"
    },
    {
      "time": "29 Jan 2007 — 2:50pm",
      "content": "How does one pronounce the company name? Try Siffic? Trissiffick?\n\nThe second seems to work best for me as well. Perhaps try a smallcaps version?\n\nAlso, check your spacing between the 'R' and the 'I'. In fact, it looks as though the letterspacing is all the same...\n\n"
    },
    {
      "time": "29 Jan 2007 — 5:59pm",
      "content": "all right i'll work on the second one. i haven't kerned it yet. that's next.\n\nthe name is pronounced tri-si'-fik or \"try siffic\".\n\n"
    },
    {
      "time": "29 Jan 2007 — 6:07pm",
      "content": "I think #1 or #2 are better than #3. That one is too spaced out. I've always found the best way to kern a logotype is to take it in 3 letter groupings at a time. Get the TRI worked out, then do RIC, then ICI, CIF, IFI and finally FIC. That helps ensure an evenness. Then you can go back and optically tweak everything to perfection.\n\nFor clarification, Tricific isn't a consumer brand, is it? If so, the whole thing seems a bit cold. If it's just a manufacturer and supplier (i.e. B2B), then you're fine.\n\n"
    },
    {
      "time": "7 Feb 2007 — 6:01pm",
      "content": "can somebody please give me some kerning advice for logo3.jpg up there? thanks.\n\n"
    },
    {
      "time": "8 Feb 2007 — 3:55am",
      "content": "For kerning I would suggest printing it out and squinting at it from the top of the page (the characters are upside down, so you are not concentrating on the characters in a familiar setting, squinting reduces the amount of light that your eyes register so it should appear almost as a grey blur), the squinting should reveal any particularly dark or light patches, the aim is to reduce these areas.  \nHowever, a small logo should have looser kerning than a big one (letterhead compared to side of a van) so you need to do this at approximately the correct size.  \nAs a start get the RI correct (I think that is going to be the crucial pair) and then work the other characters until the squint technique shows that there aren’t any significantly lighter or darker areas. Ultimately you don’t want to reduce the readability, especially important with an unfamiliar word, so you might have to sacrifice some kerning.  \nTim\n\n"
    },
    {
      "time": "26 Jun 2007 — 9:03pm",
      "content": "I was taught to scan through the middle of the line of type and even up the negatives. My mentor was Peter Dom who was a master with the exacto knife.\n\n"
    }
  ]
}
