{
  "id": "30941",
  "title": "Caslon Old Face",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I found a 2001 thread written by Justin Howe's about the release of his Caslon Old Face\n\n[http://palimpsest.stanford.edu/byform/mailing-lists/bookarts/2001/08/msg...](http://web.archive.org/web/20131221004548/http:/palimpsest.stanford.edu/byform/mailing-lists/bookarts/2001/08/msg00002.html \"http://palimpsest.stanford.edu/byform/mailing-lists/bookarts/2001/08/msg00002.html\")\n\nIn it he describes how he created his digital faces to match each metal/wood point he could find, including 8 and 10 point, etc. ITC's Founder's Caslon, however, only has calson digital fonts based on the original 12 point, 30 point and 42 point metal/wood type.\n\nDoes anyone know where I can purchase the fonts as desribed in the above thread?\n\n",
  "author": "katzenjammer",
  "time": "28 Jan 2007 — 2:41pm",
  "uid": "16268",
  "comments": [
    {
      "time": "28 Jan 2007 — 4:33pm",
      "content": "David, I assume you know that Justin Howes is no longer with us and that the online foundry site he set up – [www.hwcaslon.com](http://web.archive.org/web/20131221004548/http:/www.hwcaslon.com/ \"www.hwcaslon.com\") is defunct.\n\nOther than writing to the executors of his estate, other people here may have better and more recent advice about those point size designs not included with the commercial release of ITC Founders Caslon, but you could try approaching ITC directly and asking them about what they haven't said at [http://www.itcfonts.com/Ulc/2532/Caslon.htm](http://web.archive.org/web/20131221004548/http:/www.itcfonts.com/Ulc/2532/Caslon.htm \"http://www.itcfonts.com/Ulc/2532/Caslon.htm\")\n\n"
    },
    {
      "time": "28 Jan 2007 — 4:56pm",
      "content": "Thanks Ben, yes, I saw his obituary. Unless someone has any information here, I suppose I'll write ITC. Cheers!\n\n"
    },
    {
      "time": "28 Jan 2007 — 6:04pm",
      "content": "David, Founders Caslon was a wonderful achievement, and many people have used it successfully, and will in the future. I think there will never be a more authentic revival of Caslon.\n\nHowever, as I have worked on Caslon, I have become aware that it does have limitations even considered as the 'authentic revival' which, as Justin Howes said in your link, was the goal of his immense labors.\n\nFirst, as he says in the link you have given, he printed samples anew from metal with light inking, and then scanned these. The scans, no doubt cleaned up to some extent, became the typeface, along with some added characters he drew.\n\nThis lightly inked look is not the authentic look of either the original 18th century Caslon, nor of the metal revivals well into the 20th century. As I understand it, in the 18th century, the technology did not give a consistent height-to-paper of metal types. To compensate for this, and get all the types to print, the types were heavily inked, and printed into dampened paper. If you look at 18th century examples, or the facsimile version of Caslon's 1766 specimen book, annotated by James Mosley (Journal of the Printing Historical Society 1981/82) you will see that they are far blacker than Founders' Caslon. Furthermore, the way Caslon was used in metal revival is that it was often heavily inked, or was printed on rough paper precisely to get the ink spread.\n\nIn other words, many people felt that the 'ink gain' of the old type was part of the distinctive, attractive look of Caslon. Printing of the revivals generally had less ink gain than the original, but still had substantial gain when printed on rough paper or heavily inked. Whatever inking you prefer, the fact is that Founder's Caslon printed by offset is not going to have the look and feel of either the original 18th century Caslon, or even metal revivals, printed on rough paper.\n\nThere is a second problem I will go into in another post.\n\n"
    },
    {
      "time": "28 Jan 2007 — 7:46pm",
      "content": "But if you were to print via polymer plates, that would theoretically fix the lightweight problem, yes? In that case, you would have a more authentic print.\n\n"
    },
    {
      "time": "28 Jan 2007 — 8:16pm",
      "content": "Dan, yes, if you print letter press of course when you get ink gain it will look more like the original, especially if you print on rough paper. So that will indeed approximate the old printing a lot more.\n\nHowever, there is another problem with authenticity in Founder's Caslon, and this is recut and damaged characters. For example, in the 19th century Caslon's Pica 2 italic evidently was recut with the slopes of the ascenders regularized. (James Mosley first pointed out the existence of recut characters.) Howes uses the 19th or 20th century types, which are not the originals.\n\nAlso there are damaged characters. The ascender of the roman 'h' in the Founders Caslon 12 looks like it has a broken back and broken serif. The same broken-back ascender is found in Linotype Caslon Old Face of 1923, so it probably came from the model of the same hunk of metal--which meanwhile seems to have gotten its serif broken also. In the 1766 specimen book, the ascender does slant forward, but it doesn't look 'broken'; and no broken serif.\n\nPersonally, what I take from all this is that authenticity is an impossible goal, unless you have original type or recast from original, undamaged matrices and then use the same printing methods.\n\nBut then the result is going to look extremely 'antique', and not acceptable for most modern uses.\n\nSo my personal conclusion is that historical 'interpretations,' trying to capture what you find best in an old typeface, are more worth while to put effort into, rather than striving for the probably unreachable goal of 'authenticity'--which may not be the most desirable even if you closely approximately it.\n\n"
    },
    {
      "time": "29 Jan 2007 — 5:49am",
      "content": "Thanks so much William! What you say about the \"h\" - and founder's caslon generallly - is very true.\n\n\\>So my personal conclusion is that historical ‘interpretations,’ trying to capture what you find best in an old typeface, are more worth while to put effort into, rather than striving for the probably unreachable goal of ‘authenticity’—which may not be the most desirable even if you closely approximately it.\\<\n\nYes, the more I think about it, this whole revival thing gets \"curioser and curioser\"... It's relatively easy to try to (re)create the past exactly & nostagically - (Frost: \"we lack the courage to be ourselves\") - or arrogantly to dismiss it.\n\nWhat's supremely difficult is to pursue the subtle interpretive path you describe; I'd be willing to bet that this is how the best type designers always proceeded.\n\nCheers & thank you so much for your sharing your insight & knowledge.\n\n"
    },
    {
      "time": "29 Jan 2007 — 6:29am",
      "content": "Historical interpretations are I hope are not 'supremely difficult' but I'm finding it a huge challenge. Going through the struggle myself really makes me appreciate and admire still more great historical interpretations, such as Adobe Garamond and Miller.\n\n"
    },
    {
      "time": "29 Jan 2007 — 6:37am",
      "content": "By \"supremely difficult\" I mean in the way that, say, composing a sonnet is \"supremely difficult,\" in that one is never satisified and there is always this retreating mirage of what you had in mind in the first place. It can drive you mad.\n\nBtw, I hope you don't mind my asking: what are you working on?\n\n"
    },
    {
      "time": "29 Jan 2007 — 6:51am",
      "content": "\\>what are you working on?\n\nCaslon. I'm not quite so nuts--yet--to know that amount of detail about any other font :)\n\n"
    },
    {
      "time": "29 Jan 2007 — 10:49am",
      "content": "@ William, Caslon! Hah! Great, can't wait to see your work!\n\n@ DanGayle, photopolymer plates will produce as much ink spread as lead type in a letterpress?\n\nThanks all!\n\n"
    },
    {
      "time": "30 Jan 2007 — 12:01am",
      "content": "<cite>@ DanGayle, photopolymer plates will produce as much ink spread as lead type in a letterpress?</cite>  \nDarned if I know. I'm only aware of the technology. Haven't had the honor of being able to do letterpress at all, yet. But soon.\n\n"
    },
    {
      "time": "30 Jan 2007 — 6:12am",
      "content": "Your question about ink spread with photopolymer is interesting--I hadn't thought of it.\n\nGerald Lang, 'Bieler,' is a printer using photopolymer and sometimes posts here, so perhaps he will come on and tell us. He has said in the past that there is ink gain, and he takes this into account in choosing typefaces. But I don't know if the gain is the same as with metal.\n\nA metal piece of type has beveled sides leading down from the face to the body of the type. My assumption has been that ink gets on these sides, and then is picked up by the paper when the metal is pressed into it, and this is a big part of ink spread--not simply the ink squeezing out from under the face. (We are talking about thousandths of an inch, but still quite noticeable on the page.) I don't know if photopolymer has the beveled sides.\n\n"
    },
    {
      "time": "30 Jan 2007 — 4:57pm",
      "content": "I haven't done all that much letterpress printing, but I have printed with both metal and PP; my experience is that PP usually produces a bit _more_ gain, because the metal type was cut with letterpress in mind, and photopolymer plates are made from digital files - since the vast majority of digital typefaces are optimized for offset rather than letterpress, it seems to me that the effect is often more gain.\n\nAs far as the shape, the way that the plate material washes away from the printing surface on a plate does tend to produce a pretty pronounced beveled effect.\n\n"
    },
    {
      "time": "1 Feb 2007 — 4:35am",
      "content": "_I assume you know that Justin Howes is no longer with us and that the online foundry site he set up – [www.hwcaslon.com](http://web.archive.org/web/20131221004548/http:/www.hwcaslon.com/ \"www.hwcaslon.com\") is defunct._\n\nBrian Howes, Justin's father tells me that although they have lost the domain name, there are active plans to bring the site back quite soon, for the sale of all Justin's special fonts. Watch this space.\n\n"
    },
    {
      "time": "1 Feb 2007 — 8:22am",
      "content": "Thanks James! Ummm...are we talking hours, weeks, months, or years? :)\n\n"
    },
    {
      "time": "1 Feb 2007 — 8:24am",
      "content": "Weeks rather than months. At least that's what I understand.\n\n"
    },
    {
      "time": "1 Feb 2007 — 11:47pm",
      "content": "William\n\nI haven't been watching the list that much lately but was just now reading through this thread.\n\nYes, there is ink gain in letterpress, whether it is metal or engraving or photopolymer. Justin came up with a uniform percentage gain at one point and posted his table of findings on the PPLetterpress list. One of the very early entries. He suggested I start the list for the \"investigative printer\" and early on, contributed some very significant information. Hrant later looked at the data and, as I recall, concurred. Technical reports from the printing industry indicate 5% in regard to photopolymer (digital-to-analog).\n\nSo, yes, digital fonts should be reduced by that degree or more when using digital-to-analog. Most of the early digital fonts were reproduced from photofilm, not metal patterns, and were thus a bit weightier in the first place. And that has not changed.\n\nJustin did indicate to me at one point that he was thinking of producing a letterpress version of the Caslon as he thought it looked best printed on handmade paper. The letterpress configured digital font Rialto had just appeared on the scene. Founders Caslon, as it stands, is not useful for letterpress printing as it carries a bit too much residue. While I am fond of faux letterpress digital fonts (for some odd reason) they are extremely difficult to work with using the letterpress process. This is not to demerit the work, it is one of the most valid historical studies we will probably ever bear witness to.\n\nBasically, the more anemic looking the face, the better it is going to work digital-to-analog. The only alternative is to alter the weight of fonts in FOG or FL and to hell with the EULA nonsense.\n\nThe relief pattern of photopolymer is not the same as it was in metal type and this can be a problem. The closer the surface proximity of imaging the shallower the subsurface relief (that is just the way photopolymer works) and often digital fonts are outfitted with kerning pairs that cause problems in this regard, which can cause \"bridging.\"\n\nGerald  \n [http://BielerPress.blogspot.com](http://web.archive.org/web/20131221004548/http:/bielerpress.blogspot.com/ \"http://BielerPress.blogspot.com\")\n\n"
    },
    {
      "time": "2 Feb 2007 — 3:29pm",
      "content": "\\>The letterpress configured digital font Rialto had just appeared on the scene.\n\nGerald, interesting post, thank you. The \"letterpress configered digital font Rialto\" - where might I find this? I've seen it referenced a number of times on this forum. Cheers to you!\n\n"
    },
    {
      "time": "2 Feb 2007 — 4:49pm",
      "content": "katzenjammer\n\nThere is a PDF of the Rialto specimen book in the Files\\>Reference section of\n\n[http://groups.yahoo.com/group/PPLetterpress/](http://web.archive.org/web/20131221004548/http:/groups.yahoo.com/group/PPLetterpress/ \"http://groups.yahoo.com/group/PPLetterpress/\")\n\ndfTYPE does not seem to have a web presence.\n\nThe letterpress version is Rialto Pressa. While the entirety of Rialto is somewhat size optimized, Pressa is mainly for small text size. The italic has some interesting instances of ink trapping.\n\nGerald  \n [http://BielerPress.Blogspot.com](http://web.archive.org/web/20131221004548/http:/bielerpress.blogspot.com/ \"http://BielerPress.Blogspot.com\")\n\n"
    },
    {
      "time": "2 Feb 2007 — 6:19pm",
      "content": "thanks Gerald, I'll keep checking back at that link. It doesn't seem to download anything at the moment. Cheers, ~david\n\n"
    },
    {
      "time": "2 Feb 2007 — 7:29pm",
      "content": "David\n\nI can't put the PDF up here as Typophile doesn't recognize the format.\n\nIf you joined PPLetterpress and can't download it might be because it takes Yahoo! a while to back up the list and might not immediately recognize new memberships.\n\nIf you have not joined, join, download (when applicable), and then quit if you please.\n\nGerald  \n [http://BielerPress.blogspot.com](http://web.archive.org/web/20131221004548/http:/bielerpress.blogspot.com/ \"http://BielerPress.blogspot.com\")\n\n"
    },
    {
      "time": "4 Dec 2007 — 4:51am",
      "content": "Mr Berkson,\n\nI'm very curious to hear how your Caslon project is going? I hope all is well! (I tried pm-ing you, but there's something wrong with the link.) Cheers, ~Katz\n\n"
    },
    {
      "time": "4 Dec 2007 — 12:23pm",
      "content": "Thanks for your interest. It's going very well and some of it will be out \"very soon.\" :)\n\nIf you e-mail me at Berkson (the at symbol) mentsh dot com I can give you more info.\n\n"
    },
    {
      "time": "5 Dec 2007 — 1:48am",
      "content": "please can someone give me some examples of caslon font in use????  \nplease because I dont now wheare to found it.  \nmy english is not gud I now. but please help me\n\n"
    }
  ]
}
