{
  "id": "30950",
  "title": "GDC membership",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "This is mostly for my fellow Canadians – are any of you part of the GDC? Is the cost worth the benefits? Thoughts and opinions on it in general?\n\nWhen I was working in New Brunswick nobody really cared about it. My boss and 2 of my colleagues were members but no one talked about it and outside of the plaques there wasn’t much sign they even belonged to it. Where I’m at now, several people are members including the art directors. They’re trying to convince me to join but I really don’t know what the draw would be to it.\n\nHelp shine some light on this if you please.\n\n [‹ Readability and Legibility](http://web.archive.org/web/20080430115731/http:/www.typophile.com/node/30928 \"Go to previous forum topic\") ['Typography as art' ›](http://web.archive.org/web/20080430115731/http:/www.typophile.com/node/29416 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080430115731/http://www.typophile.com/user/12112\" title=\"View user profile.\">jselig</a>",
  "time": "<br>",
  "uid": "12112",
  "comments": [
    {
      "time": " 29.Jan.2007 9.41am",
      "content": "I know a couple of people here in Calgary who are, but I’ve never felt the need.\n\nInteresting that you’re asking that question now: GDC’s Southern Alberta chapter, Alberta College of Art and Design alumni, and local members of Alberta Craft Council are currently being polled as part of a survey (presumably paid for by ACAD, since that was the focus of the questions) to look at educational and employment opportunities for people involved in “art, craft, and/or design” — given the scope and type of queries, they didn’t seem terribly applicable to folks who are strictly GDs....\n\n"
    },
    {
      "time": " 29.Jan.2007 10.26am",
      "content": "I too have toyed with the idea of becoming part of the GDC chapter here in British Columbia on several occaisons, but have been unimpressed with what they have to offer for their inflated fee.\n\nI truly believe our industry has a great deal to offer, but lacks the vision (in some circles) to effect change, make a difference and put standards in place to influence and educate the business industry. I have been to several guest series lectures, as well as other events, and while these were helpful, did not leave me more inspired.\n\nAny experienced designer in this industry will know that it can be a daily challenge to inform, educate, convince and foster good design for our clients, and our professional networking group should really focus on the weaknesses at hand, as well as promote the exciting and new artists within our field.\n\nToo often these events are not as open as they need to be, due to the competitive nature of our industry, or the environment to where we practise (too small or too large)....\n\nSo, I would say NO, these chapters are not overly helpful. As one who knows former GDC presidents personally, etc. and have seen the new 2010 Olympic logo being awarded to a designer like the country fair, we have a great deal more work to accomplish.\n\n"
    },
    {
      "time": " 29.Jan.2007 11.05am",
      "content": "Ask not...\n\n"
    }
  ]
}
