{
  "id": "30978",
  "title": "renedi sans",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "So what do you think shoot!\n\nCritique welcome and advices. Is it legal and ok too use and to make this alternation for personal use or even commercial???\n\nRenedi sans (inspired by didot).\n\nonly few letters.\n\n| Attachment | Size |\n| --- | --- |\n| [EFACADE2.jpg](http://web.archive.org/web/20150419055524/http:/typophile.com/files/EFACADE2.jpg) | 16.99 KB |\n\n",
  "author": "garden",
  "time": "29 Jan 2007 — 1:27pm",
  "uid": "12816",
  "comments": [
    {
      "time": "29 Jan 2007 — 1:51pm",
      "content": "So did you open a Didot typeface in FontLab and take off the serifs? Because I think that the specific EULA (End-User License Agreement) for that Didot will govern whether you can use this personally. I'd really doubt that any EULA would let you modify a font and then sell it commercially. But if you made this from scratch (not by opening up a Didot font) _based_ on Didot, then that should be perfectly fine for personal or commercial use.\n\n"
    },
    {
      "time": "29 Jan 2007 — 1:57pm",
      "content": "then it comes just to personal display use. i opened it in illustrator!, playing along a little.\n\nbut where could I find didot sketches to start vectoring them?\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n-  \ngolden ratio of passion. sansogno.coastaldisturbance.com\n\n"
    },
    {
      "time": "29 Jan 2007 — 3:08pm",
      "content": "Even for personal use you could be stepping on someone's toes. Some people will say you shouldn't worry about it, but if you respect the type designer and his work perhaps you will keep this in your box of tricks and only use it for a logo or something. If this is Hoefler's Didot I'm pretty sure you aren't supposed to be reverse engineering it. However, I do think it is kosher to use in Illustrator for logos and such.\n\n"
    },
    {
      "time": "29 Jan 2007 — 6:03pm",
      "content": "Sandro, I meant that you could digitize Didot based on an old printed specimen, which is where all the current Didots began -- to my knowledge, to base it off a printed version and then modify it to suit your needs should be perectly fine. As Miss Tiffany said, the key is to respect the type designers.\n\n"
    },
    {
      "time": "30 Jan 2007 — 5:21am",
      "content": "Yes, I have respec, that is why I ask someone to explain. Where could I get that old printed specimens? Or sketches?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n-  \ngolden ratio of passion. sansogno.coastaldisturbance.com\n\n"
    },
    {
      "time": "30 Jan 2007 — 5:34am",
      "content": "I do not believe that there are any Didot family sketches of letters to find. But you could find very old books printed with types cut by the Didot family. These would probably all be in French. Aside from France, tehre may be copies of some of these works in rare books libraries. I suggest contacting the nearest rare books libraries in your area. Some large University libraries collect rare books.\n\nOtherwise, you could look at old printer specimen books, like ATF catalogs, old Monotype or Linotype catalogs, etc., and try to get a feel from those how [Didone](http://web.archive.org/web/20150419055524/http:/typophile.com/wiki/Didone)-style letters looked in various point sizes. Maybe some of the Photo Lettering Inc. catalogs could help?\n\nLastly, quite a lot of gravestones and engravings and other prints from the first half of the 19th century were made using vaguely Didone letters. You could look at these for visual reference as well.\n\n"
    }
  ]
}
