{
  "id": "30979",
  "title": "mid-brain design - up for critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "First off, let me just say that I just discovered this site, and am quite impressed. Not enough active design forums out there.\n\nAnyways, I'd love everyone's feedback on the logo I created for my company, mid-brain design.\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 4.png](http://web.archive.org/web/20131018110029/http:/typophile.com/files/Picture%204_8.png) | 52.31 KB |\n\n",
  "author": "midbrain",
  "time": "29 Jan 2007 — 1:31pm",
  "uid": "16520",
  "comments": [
    {
      "time": "29 Jan 2007 — 2:00pm",
      "content": "Here are a few things that I'd suggest looking at:\n\n1. Let's start off with the big one: do you really need a symbol for this? A symbol is best used when augmenting a slightly abstract name or concept. Here, you're just explaining the name, which is unnecessary. Plus, I don't think it's really distinctive enough as a symbol. I get it –&nbsp;the mid-brain. If there were something else hidden within, like a great monogram or something, that might help. But still, I think it's superfluous.\n\n2. If you are going to use this symbol, then the typeface for \"mid-brain design\" is competing visually with it. The serifs, the open 'a' counter, and the ligatured \"gn\" are all distracting from the symbol. I think the type should be simpler, with a little bit more modernity to meld better.\n\n3. I get web and print. What is \"photo\" ? Is that another service you offer? So you're a photographer too? Great. Should be a separate business, I think.\n\n4. The layout of the various type elements are all over the place, also contributing to a visual mess. The symbol on the left, the \"web, print...\" modifier on the right, and the tagline too-tightly stuck underneath the name. Kill the \"web, print, photo\" bit. It's not necessary. By saying you do web and print, that says you do pretty much anything, so it's not needed. Find a better way to place the tagline that balances better with your main typeface. Balancing form with function is a decent tag, but the type lockup is all unbalanced.\n\n"
    },
    {
      "time": "29 Jan 2007 — 2:18pm",
      "content": "Good points.\n\nDo I need a symbol? Hmm, perhaps not, but it does work well. The logo as you see it is really the master logo. Components can be removed (and often are).\n\nI don't want the main type to be too simple (I want people to know that I'm not just selecting a typeface and running with it).\n\nre: photo - yes I am a photographer as well, and yes its a bit muddled. I don't lead with it, and its really just support for the other things I do. Separate business idea is good, perhaps in the future. I agree that the web, print, photo part isn't entirely necessary (think of it as a separate graphic element, not necessarily the logo proper).\n\n"
    },
    {
      "time": "29 Jan 2007 — 2:24pm",
      "content": "Agree with Jonsel : too complicated, too much things and symbols.\n\nA suggestion. I think you have a design opportunity with your Company name : the \"d\" and the \"b\" can represent the two parts of a brain.  \nAs this, you put your symbol inside your name by a typographic way. It can work with a geometric font. Look at this quick draft for exemple with the font Neophyte.  \nHope it could help you.\n\n ![](http://web.archive.org/web/20131018110029im_/http:/typophile.com/files/midbrain_6173.jpg)\n\n"
    },
    {
      "time": "29 Jan 2007 — 2:32pm",
      "content": "When I first saw your logo, I dis not see a BRAIN, but rather a WOMB. Maybe I've been watching too much of National Geographic's \"Inside the Womb\" series on TV?  \nDB~\n\n"
    },
    {
      "time": "29 Jan 2007 — 2:47pm",
      "content": "Yeah, I considered using the db relation as a symbol... Didn't work for me however, primarily because I need the dash in there (since the url is mid-brain.com).\n\nPeople do tend to see what they want in my symbol... Fruit, walnut, womb etc. Not sure if thats all part of the fun of it, or if thats distracting. I think with the name next to it, it becomes self-explanatory.\n\n"
    },
    {
      "time": "29 Jan 2007 — 3:15pm",
      "content": "_I want people to know that I’m not just selecting a typeface and running with it_\n\nIsn't your logotype just a typeface, or did you draw it from scratch? Nobody who sees that will think, \"Oh, he does type design particularly well.\" I consider myself to be a type fanatic and love to modify type for my own needs, but I'm still quite happy to select a typeface and run with it when it works. I think you're overanalyzing this. But if you want to stick with type of a similar vein, kill the symbol. Or, use the symbol as an extra graphic element on your stationery or website, but not locked up with the type.\n\n"
    },
    {
      "time": "29 Jan 2007 — 7:19pm",
      "content": "@zouzouwizman: [http://www.b3ta.com/features/phalliclogoawards/](http://web.archive.org/web/20131018110029/http:/www.b3ta.com/features/phalliclogoawards/ \"http://www.b3ta.com/features/phalliclogoawards/\")?  \n?\n\n"
    }
  ]
}
