{
  "id": "3097",
  "title": "LETTERS in ART",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "[http://www.clementine-gallery.com/white.html](http://web.archive.org/web/20150417034808/http:/www.clementine-gallery.com/white.html)   \n   \nvia k10k\n\n",
  "author": "beejay",
  "time": "4 Sep 2002 — 10:32pm",
  "uid": "1014",
  "comments": [
    {
      "time": "5 Sep 2002 — 8:41am",
      "content": "Awful. (Not the link, BJ, just the art!)   \n   \nPaintings that strain for significance and/or rely on cute juxtapositions just don't do it for me. And let's not get started on the artist's choice of typefaces...\n\n"
    },
    {
      "time": "5 Sep 2002 — 10:03am",
      "content": "that's bizarre. its just very strange, defacing paintings with 3D character monoliths? perhaps its a new form of surrealism, but there's better ways of manipulating found art to create a statement I'm sure.\n\n"
    },
    {
      "time": "5 Sep 2002 — 10:15am",
      "content": "Tanya, it's Art, where things like \"better way\" have no place. And defacing has value too, especially when it's other art.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2002 — 10:34am",
      "content": "I think it's kinda cool, I'd hang it in my house. It has a nice paint by numbers feel but with some type.   \n   \nStuart :D\n\n"
    },
    {
      "time": "5 Sep 2002 — 10:48am",
      "content": "I'm with the Stu.\n\n"
    },
    {
      "time": "5 Sep 2002 — 11:40am",
      "content": "Paintings?! Stuart \\*is\\* Elvis, maaan.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2002 — 2:36pm",
      "content": "I guess what I mean by 'better way' is that it seems the artist didn't explore many options and his 'statement' well...its written right there in english. deep thought went into that one! I'd say its a cop-out for an idea he couldn't explain. In this case why bother making the typography match (not that it does really) the painting, why bother following the paintings perspectives. - its mega kitch.   \n   \nhe could have used spray paint and tagged it like everyone else and acheived the same 'statement'\n\n"
    },
    {
      "time": "5 Sep 2002 — 3:12pm",
      "content": "\\> I'd say its a cop-out for an idea he couldn't explain   \n   \nYeah. \\*Art\\*.   \n   \n\\> he could have used spray paint and tagged it like everyone else and acheived the same 'statement'   \n   \nBut he didn't, because he didn't \\*want\\* to. Art is inherently selfish. Don't get me wrong, as an integral part of Life, Art has its relevance, hence beauty. But the money it generates is preposterous, and in a way harmful to Art itself.   \n   \nhhp\n\n"
    },
    {
      "time": "5 Sep 2002 — 7:22pm",
      "content": "If I had the bread, I'd buy every peice of [this](http://web.archive.org/web/20150417034808/http:/www.shag-art.com/) guy's artwork!   \n   \nStuart :D\n\n"
    },
    {
      "time": "5 Sep 2002 — 7:35pm",
      "content": "I like them. I think they're very funny, both the concept and the execution. The idea of mass-produced junk paintings being displayed in museums I imagine is part of the joke. Makes me think of DuChamp and Wegman a bit (not to say that White is in the same league necessarilly). Personally, I like art with a sense of humor. I wonder what he would do with a Kincaid...\n\n"
    },
    {
      "time": "6 Sep 2002 — 2:07am",
      "content": "Agree to a degree with Hrant. The money that the big names can command in art is definitely anti-progress. You can buy very good work for a tiny fraction of the work of others. However, are we not slightly biased as a group here, a group which has tended away from the abstract, preferring to stick with what is aesthetic. In that we must acknowledge our slight contempt for a medium that trades on ideas and not necessarily on polished output.\n\n"
    },
    {
      "time": "6 Sep 2002 — 6:26am",
      "content": "sure Hrant, calling it \"Art\" is an easy justification, and belittles any and all discussion, theory or critics opinion, but one must be deemed an \"Artist\" before you get that title. Before that your merely a painter, sculptor, ect.   \n   \nThat is why society has people like Clement Greenberg, Rosenberg, The Guggenheims. By your judgement, anything they've ever had to say is worthless when they could have sumed it up with your words. \"its art\"   \n   \nSo then, critical as I may be I'm saying its not Art, its nieve.\n\n"
    },
    {
      "time": "6 Sep 2002 — 9:08am",
      "content": "\\> but one must be deemed an \"Artist\" before you get that title.   \n   \nTo me, there is no \"deemed\" in Art, because any tangible expression of human emotion is Art. Any other definition falls apart within a minute of critical analysis.   \n   \nBTW, when did snow come into this discussion? ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "6 Sep 2002 — 9:50am",
      "content": "problems with your definition:   \n   \n1) performance isin't art then. its not tangible ![:)](http://web.archive.org/web/20150417034808im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n2)whitepapers, datasheets, form letters, anything with any tone of voice at all in the writting be it dry or instructional show the emotion of the person who wrote it under the corporate attitude of the company. so that's art too.   \n3)terrorists and their acts are really artists creating. the result is art.   \n4)me replying here expressing my view on your comments, is 'art'   \n   \nyou really can't leave the doors that open. though I'm sure you don't mean to. point is I value what we have in society and how we do have views and limits, and critics who do categorize what art is.   \n   \nso then, my critical opinion being its not art, yours that it is. and that's fine. but you can't tell me it is art, if I decide the result of this guy's work wasn't. its futile.\n\n"
    },
    {
      "time": "6 Sep 2002 — 9:51am",
      "content": "I have to agree with Hrant. Or maybe when I'm finished I'll have agreed with Tanya. :$   \n   \nArt in general, and in my opinion (key phrase), is only the artists until it leaves their studio. Once it is on display the work (whether Cot or Kitsch) becomes that of the viewer. Those who view the work, everyone, will \"see\" the work through their own life's experiences. And because of this will like it or not like it based on this.   \n   \nSure there are so-called and so-entitled critics of art who have a following of people that have happened to agree with their (critic) opinions on what is and what is not good art. And that is also not to say that some art isn't--more or less--obviously \"better\" art. Some artists do have (and have had) a better understanding of the human figure or how to mix their paints or how to use composition. But those are all technical issues.   \n   \nBut again it is all a matter of opinion. One person's kitsch is another persons prized possession.\n\n"
    },
    {
      "time": "6 Sep 2002 — 10:03am",
      "content": "right, I'm not saying the famous critics categorize for us. I'm saying we have the right to be critics, critical ourselves of what is art. otherwise we'd all be drones, and everything would be 'art' and we wouldn't be debating anything because all art is given the excuse that its 'art' - don't question it...\"its art\". It dosen't need explanation, because \"its art\", advancement or a reason for its creation, don't worry about it...\"its art\"   \n   \nwhether we like it or not, we understand that there's a certain amount of respect given to pieces of art. otherwise we might as well hang my dirty landry at the Walker\n\n"
    },
    {
      "time": "6 Sep 2002 — 11:23am",
      "content": "Art is the process, not the result. The only (conceptual) value in the result is in evoking the process.   \n   \n\\> you really can't leave the doors that open.   \n\\> though I'm sure you don't mean to.   \n   \nI can, and I do.   \n   \n\\> you can't tell me it is art   \n   \nVery true.   \nNothing is relevant outside of our individual context.   \n   \n\\> everything would be 'art'   \n   \nEverything is everything to some extent. No attribute is exclusionary, not even opposites. In fact, opposites are the same thing.   \n   \n\\> we might as well hang my dirty landry at the Walker   \n   \nIf your laundry is dirty from working in a sweat shop and you torn it up in a fit of rage at the world, then I would very much like to see it in a museum.   \n   \n----   \n   \n\\> :$   \n   \nHuh, this is one powerful emoticon: it might mean \"I'm keeping my mouth shut for money.\" Not that you used it that way.   \n   \n\\> But again it is all a matter of opinion.   \n   \nYes.   \nAnd that's one important thing that makes type design for example not nearly as artistic as some people might like to imagine.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Sep 2002 — 11:30am",
      "content": "in general i stick with hrant on this topic. but being a blabber mouth i'd like to add a point:   \n   \nthere is no real danger in leaving the doors open and letting the meaning of 'art' run around our houses, living its stench on everything. Because being easy on this definition will only mean we'll accept evrything around as a possible oppurtunity for inspiration (or - 'Art'). It does not mean we have to be apathic about everything and let dull and mind-modular objects be excused as art. Each of us has his and hers own free will to see what is insipiring and beautiful, and what is not, so that however we define an object, we could see if its qualities. By opening the meaning of art to the public, instead of closing it in the metal zoo of the critics, we are obligated to see more in everything. Since everything might have artish qualities in it.   \n   \nThe discussion if something is art or not seems alltogether meaningless to me. 'art' is just stuff with concetrated inspiration. if you want, you can discuss those painting as objects and share with people the feelings they evoke in you.\n\n"
    },
    {
      "time": "9 Jan 2003 — 8:31am",
      "content": "OUCH!\n\n"
    },
    {
      "time": "9 Jan 2003 — 5:22pm",
      "content": "to paraphrase pythagoras: all is art.   \n   \nand just because everything is art (or isn't. whatever.) doesn't mean it has a free pass.\n\n"
    },
    {
      "time": "5 Sep 2002 — 11:10am",
      "content": "My fav: \"Painting that Came to Life Only to be   \nMocked-Forgotten.\" A fitting title as this re-   \nwork itself will be soon forgotten.   \n   \nStuart, do you by chance have those rare velvet   \nElvis \"paintings\" in your house too?\n\n"
    }
  ]
}
