{
  "id": "30985",
  "title": "Stationery self identity logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I’m making a personal identity system, with stationery, my name is Troy Ruprecht. It’s for a class, and it’s due tomorrow. I’ve been developing this monogram for my initials TR, and I’ve sketched and sketched my ideas for that, and I’ve come up with these variations so far.\n\nI wanted to have a geometric sort of design, and balanced, and I’ve done that with these, but the readability is still really bad. I used a lower-case t and an upper case R to create a sort of mirrored image, square in shape, and with 4 sections inside to give it even more balance. I like the way #7 balances both sides exactly, but the t is always the tough part to get it to be easier to read without making it unbalanced.\n\nRight now I’m thinking I’ll have to add the left part of the cross on the t, even though it would take away from the balance, but I can’t think of any other way to get this thing easier to read without doing something like that.\n\nDoes anyone have any ideas on how to get it to read easier, and be relatively balanced on each side?\n\nBy the way, I’d rather go more balanced than more readable, since I would always include my name next to the logo, but I think it needs a lot of help with reading it still.\n\n-Thanks\n\n-Troy Ruprecht\n\n| Attachment | Size |\n| --- | --- |\n| [sketches8.jpg](http://web.archive.org/web/20071119051155/http:/typophile.com/files/sketches8.jpg) | 167.62 KB |\n\n [‹ New logo of Preussisches Bleisatz-Magazin](http://web.archive.org/web/20071119051155/http:/typophile.com/node/30667 \"Go to previous forum topic\") [Kong pet toys logo series ›](http://web.archive.org/web/20071119051155/http:/typophile.com/node/30594 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071119051155/http://typophile.com/user/16363\" title=\"View user profile.\">Ruprecht</a>",
  "time": "<br>",
  "uid": "16363",
  "comments": [
    {
      "time": " 29.Jan.2007 4.38pm",
      "content": "Why so stuck on symmetry? Balance isn’t necessarily symmetrical. Try working in black and white to work out the relationship between the two letters, then add color later.\n\nGood luck!\n\n ![](http://web.archive.org/web/20071119051155im_/http:/typophile.com/files/sketches8_4039.jpg)\n\n"
    },
    {
      "time": " 29.Jan.2007 5.59pm",
      "content": "Troy,\n\nHalf the fun of school is experimenting with things you couldn’t usually do in a professional environment. The only possible setback is a grade, but don’t worry about that. What really matters in school is how you explore things.\n\nYour sketches look very limiting. If you try doing what Alaskan mentioned, you will start expanding your linear thought process. Keep pushing that further. You’ll develop a lot more styles, more sketches that are different, and ultimately find something unexpected you might not have been able to predict. I can see this mark go off into a number of ways beyond this style. What might be lacking is how you’re going to place your name within the mark. Make sure each sketch is a full sketch and has everything in it that you need (ie: main mark, secondary mark, maybe even a third mark, colors, shapes, etc. etc.)\n\nIf you keep yourself limited to this thought of “more balanced than more readable” you’re only going to hurt yourself in the end.\n\nBest of luck,  \nJohn\n\n"
    },
    {
      "time": " 29.Jan.2007 6.00pm",
      "content": "I really like #7. Why do anything more to it?\n\nI agree with Alaskan that you should look at it in black and white first, though. I’m not a fan of the rounded/sharp corner shape your using. It only creates a less memorable overall outline of the symbol. Your line weights are heavy enough, and the two forms are balanced enough, that they shouldn’t need it.\n\n"
    },
    {
      "time": " 30.Jan.2007 6.35am",
      "content": "I saw ER before reading your post. After reading it I still see ER... This is because we believe every part of the logo is consistent - uppercase and part cut in your example.\n\n\\_\\_\\_\\_\\_\\_\\_  \n AL  \n [lenart.pl](http://web.archive.org/web/20071119051155/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": " 30.Jan.2007 7.23am",
      "content": "I read all of your logos as “RR”. I’d rethink it, although if it’s due tomorrow (today?), you might not have time.\n\n- Lex\n\n"
    },
    {
      "time": " 31.Jan.2007 11.50am",
      "content": "Thanks for all the input, I reworked and reworked it, but I still couldn’t get it to look right, so I didn’t even use it on my stationery. I will rework another design in the future, if not based on this one, something related possibly.\n\n-Troy\n\n"
    }
  ]
}
