{
  "id": "30986",
  "title": "Online design schools? Sessions vs others?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "My wife's 19-year-old cousin is looking at taking online training in graphic design and multimedia. She lives in a smallish city (Regina, Saskatchewan, Canada), and works days, so she and her dad are thinking that would be the best option for her.\n\nThey're looking at Sessions ( [http://www.sessions.edu/](http://web.archive.org/web/20110623043531/http:/www.sessions.edu/ \"http://www.sessions.edu/\")) which is an accredited online-only institution, and looks okay. Any other options they should seriously consider? Any good/bad opinions on Sessions?\n\nNote that Sessions has a \"tuition sale\" for which tomorrow is the last day, so they're trying to make a decision quickly....\n\nThanks,\n\nT\n\n",
  "author": "<a href=\"/web/20110623043531/http://typophile.com/user/909\" title=\"View user profile.\">Thomas Phinney</a>",
  "time": "<br>",
  "uid": "909",
  "comments": [
    {
      "time": "",
      "content": "Thomas I am finishing my degree online with the Academy of Art University. . . I love to online program, they take very good care of their students and its an esay yet challenging curriculum.\n\nIf cost is an issue however this school may be a bit on the pricey side.\n\nCheers\n\nJames\n\n"
    },
    {
      "time": "",
      "content": "Heh, Regina may be smallish but it's still the capital of SK...\n\n(and it's about 15x the size of the 'city' in which I live...!)\n\n"
    },
    {
      "time": "",
      "content": "Thanks, James.\n\nAlex: Winkler, Manitoba? Wow, I hadn't even heard of that one until today. But then again, there's always another small town....\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "Manitoba's kind of funny that way. We have Winnipeg (700 000), Brandon (50 000) and then the list drops off... (there's only just over a million in the entire province). Winkler's about 8500 which qualifies it for city status in Manitoba, but I still don't think it's a city.\n\nIf she weren't working days, I'm sure there'd be a halfway decent visual arts/graphic design program somewhere in either the college or university in Regina.\n\n"
    }
  ]
}
