{
  "id": "3098",
  "title": "Asociation logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "well. i'm not a branding /corporate image designer, i just design website but i had the chance to join to a contest for a logo for a new technologies bussines association. this is my start and i'd like to know your opinion ;)   \n   \nthanks in advance ![logos](http://web.archive.org/web/20131021001521im_/http:/www.typophile.com/forums/messages/29/26401.gif)\n\n",
  "author": "eplastiq",
  "time": "12 Feb 2004 — 9:56am",
  "uid": "3057",
  "comments": [
    {
      "time": "12 Feb 2004 — 10:05am",
      "content": "ack.   \nno gradients.   \n   \nthat's all I can say.   \nwhats the association about.\n\n"
    },
    {
      "time": "12 Feb 2004 — 10:13am",
      "content": "new technologies bussines. hardware, software, comunications....\n\n"
    },
    {
      "time": "12 Feb 2004 — 11:50am",
      "content": "Spec work? Don't do it!\n\n"
    },
    {
      "time": "12 Feb 2004 — 12:36pm",
      "content": "Whether or not you choose to do spec work or whether this can be considered such (and I would suggest that you seriously think about this - many here have talked about it before: [http://www.typophile.com/forums/messages/30/16481.html](http://web.archive.org/web/20131021001521/http:/www.typophile.com/forums/messages/30/16481.html) as well as participating in the Typophile contests too), Tanya has an excellent point:   \n   \n**Stay away from gradients.**   \n   \nSure they look cool, but gradients make things harder to see, read and reproduce. Especially letters. Gradients can cause problems when going to print. Gradients are hard to control in terms of colour matching.   \n   \nChoose one colour. The blue at the right hand side of the logo looks kind of neat...   \n   \nSpeaking strictly about the work you are showing here:   \n   \n- What are you trying to show? Do you just want to make the letters look 'technical'? Is it a requirement that the letters be used? Is there already a symbol?   \n   \n- The gaps in the letterforms, while not totally objectionable don't really seem to look consistent. Is there a rule that you could invent and follow about the gaps?   \n   \n- The logo seems to scale okay, which is one of the virtues of using sans-serifs if you need to go small.   \n   \nAdditionally I can say from experience: you don't need to participate in a contest to get into the graphic design field. If you start designing things, even in a small way and study as much as you can you will find conversation and word of mouth can go a long way to establishing your reputation.   \n   \nJon\n\n"
    },
    {
      "time": "13 Feb 2004 — 12:43am",
      "content": "hmm i will try more colors. i will post later.   \n   \nthe contest issue. well there are some cash for the winner. but i do this for learn and for fun. this is not my job, i could be a farmer and take part on the contest ;)   \n   \nthe logo is for a group of bussines new technologies related. they have an old logo and they want to change it.\n\n"
    }
  ]
}
