{
  "id": "30999",
  "title": "Inflections--what evil lies within?",
  "forum": "Build",
  "tags": [

  ],
  "content": "FontLab’s Font Auditor supposedly flags “inflections”. The manual says that “it is better to replace such curves with two curves.” The accompanying picture shows an ’s’ curve like this:\n\n ![](http://web.archive.org/web/20080420111449im_/http:/www.typophile.com/files/S%20curve_4013.gif)\n\nI wrote “supposedly flags” because I don’t really see them flagged by Font Audit, though that option is checked in the ’options’ window. (Extrema without points are flagged, but that it seems is another matter.)\n\nNow it is convenient to use ’S’ curves since that is what you can do with a Bezier curve that you can’t do with a quadratic spline.\n\nWhat harm is done by inflections? Is it a question of functioning of the font? Of aesthetics? What is the issue here, if any?\n\n [‹ UPM value of 1000 set in stone?](http://web.archive.org/web/20080420111449/http:/www.typophile.com/node/30913 \"Go to previous forum topic\") [bluescreen from opening my fresh new font ›](http://web.archive.org/web/20080420111449/http:/www.typophile.com/node/30967 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080420111449/http://www.typophile.com/user/1551\" title=\"View user profile.\">William Berkson</a>",
  "time": "<br>",
  "uid": "1551",
  "comments": [
    {
      "time": " 30.Jan.2007 8.25am",
      "content": "From the dusty bowels of my memory, I seem to recall that it is only a hinting issue and that it may be difficult to hint such curves properly. Once again my warning—the deepest dark corners of Chris’s mind may not recall as acurately as they should :-)\n\nThat being said. I am surprised that FontAudit did not flag the above curve for missing extremma. If you draw such a curve rotated so that there are no missing extremma points, you have the normal middle section of an “s” situation. I often use this technique when drawing an s. I may later tweek it a tad by adiing a midpoint for more control but generally get as close as I can without the midpoint.\n\nChrisL\n\n"
    },
    {
      "time": " 30.Jan.2007 8.41am",
      "content": "Font audit did flag extrema in my graphic—before I switched it off—but did not flag the inflection. Even if points were at both extrema, the inflection would still be there. This problem, if it is one, doesn’t seem to be mentioned elsewhere...\n\n"
    },
    {
      "time": " 30.Jan.2007 8.58am",
      "content": "If it is what I think it is, there is no problem at all.\n\nChrisL\n\n"
    }
  ]
}
