{
  "id": "31004",
  "title": "Seasoning Salt Shop Typography/Logo",
  "forum": "Design",
  "tags": [

  ],
  "content": "I am working on an identity for a seasoning salt shop. The idea is that people can come and mix their seasonings to suit their tastes (at the seasoning bar). It is important to stress the SALT part of the identity. I've come up with a lot of directions, but can't seem to symbolize salt without being extremely literal. How do I make seasoning look appetizing? I have an earth tone palette, but that is all I have going for me. I've ventured into the direcetion of meat (that changes with each use) + seasoning specks on it, but it might be too literal. Any help would be much appreciated.\n\nThanks  \nVictoria\n\n",
  "author": "<a href=\"/web/20101022180642/http://typophile.com/user/16282\" title=\"View user profile.\">ms. pater</a>",
  "time": "<br>",
  "uid": "16282",
  "comments": [
    {
      "time": "",
      "content": "Given that a salt is the Ph neutral output of the chemical reaction of and acid and an alkaloid, why not just go with something neutral but gorgeous? I think that Neutra is pretty appetizing.\n\n ![](http://web.archive.org/web/20101022180642im_/http:/typophile.com/files/salt_4377.gif)\n\n"
    },
    {
      "time": "",
      "content": "oh yeah, the name of the shop is: Flavorit  \ntagline: customized seasoning salts\n\n"
    },
    {
      "time": "",
      "content": "I dont think this can be solved by type alone. Given the health concerns and popularity of low-sodium diets, I'd say you have a large task here. The name of the business should be your starting point - it's fun and unpretentious. You need to come up with something visually appetizing, think delicious food, not necessarily just salt. You need to post some designs if you want better feedback.\n\n"
    },
    {
      "time": "",
      "content": "I actually used salt as a medium in my \"quick creative ways to make a font\" demo (part of the type design course I was teaching): just write/pour it on black paper, quick photo, then play with contrast and blur controls in photoshop, import, autotrace, and bingo!\n\n"
    },
    {
      "time": "",
      "content": "Use salt as the medium, fill a paper cone with salt and cut off the tip and draw with it on black paper (or photographic paper if you have access to a darkroom), single line illustrations/flowing script. Might be literal on one level but it could lead somewhere.\n\nTim\n\n_Edit: see what happens when you type in a comment_\n\n"
    },
    {
      "time": "",
      "content": "hmm, a lot of my concepts never made it to the computer, so I will post an updated list of directions and what I've done on the computer after I get it all together.  \nThanks for ideas\n\n"
    },
    {
      "time": "",
      "content": "That is a great idea.\n\n"
    },
    {
      "time": "",
      "content": "it should show the coming together of spices, salt and herbs...\n\nI've tried:  \n• salt shakers  \n• mixing bowls  \n• the aroma coming out of bowls, shakers, meals  \n• combo of leaves + salt chrystal + spice  \n• top of salt shaker (s) or (f) for Flavorit  \n• meat/veggie icons with seasoning  \n• salt as a texture - granuals become letter forms  \n• combo of texture (one representing each: salt+spice+herb)  \n• mixing spoon/measuring spoon + salt  \n• changing the letter \"o\" in Flavorit to the top of a shaker (slot for each ingredient)  \n• sprinkling action of pinching/spreading salt (with/without hands)  \n• element chart  \n• molecular make up  \n• seasoning on plate/bowl/fork/spoon  \n• cubed salt  \n• ingredients stacking (with/without + signs)  \n• combining a leaf+salt grain+ spice icon  \n• lips/tongue  \n• turning the \"i\" into a shaker  \n• stamp like approach to resemble crates of salt  \n• swirl action of combining ingredients/topping off food\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20101022180642im_/http:/typophile.com/files/logothumbs_3553.jpg)\n\n"
    },
    {
      "time": "",
      "content": " ![](http://web.archive.org/web/20101022180642im_/http:/typophile.com/files/Salty_f_5821.gif)\n\nI love this idea, very clever. The type below could use some spicing up.\n\n"
    },
    {
      "time": "",
      "content": "I doubt it will be a popular choice, but I like the one on the lower left. It reminds me of the label on old spice jars.\n\n"
    },
    {
      "time": "",
      "content": "Yes, the f-dots is brilliant!  \nBetter trademark that pronto :-)\n\n"
    },
    {
      "time": "",
      "content": "F-dots, deffo!\n\n"
    },
    {
      "time": "",
      "content": "One more ENTHUSIASTIC vote for F-dots!!!!!!!!!!!!!!!!!!!!  \nDB~\n\n"
    },
    {
      "time": "",
      "content": "And another. Tinker a bit with the typography, and you've got a winner.\n\n"
    },
    {
      "time": "",
      "content": "Thanks, I will work on it some more.  \nIt was one of my first ideas, so I was a little hesitant.\n\n"
    },
    {
      "time": "",
      "content": "Sometimes the first idea is the best.  \nAnother vote for the dotted f!\n\n"
    },
    {
      "time": "",
      "content": "Also have a look at an ﬁ (or ﬂ) ligature for dotted f.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Oooo, I like the f-dots, too. Elegant solution. But your type will have to be larger in relation to the mark in order for it to be read when it is small, as on a business card.\n\n"
    },
    {
      "time": "",
      "content": "I like the f-dots too, but maybe try it with a fewer dots.\n\n"
    },
    {
      "time": "",
      "content": "The Dots are a nice direction but its not done well enough.\n\n"
    },
    {
      "time": "",
      "content": "Yeah, it needs to be refined A LOT, that was just a rough to see if it would portray salt. Type is just thrown in there as well. I will post my revisions tonight.\n\nTHANKS for all the suggestions.\n\n"
    },
    {
      "time": "",
      "content": "Here is some exploration with the F.  \nLet me know what you think.  \nSimple or more realistic?  \n(#1 is the original)  \nFeel free to leave your vote!  \nThanks\n\n ![](http://web.archive.org/web/20101022180642im_/http:/typophile.com/files/flogo_5445.jpg)\n\n"
    },
    {
      "time": "",
      "content": "number 5 is about right.  \nmaybe with a sprinkle of Futura or something even more basic.  \nMost of the other examples give me the golfball idea IMHO.\n\n"
    },
    {
      "time": "",
      "content": "I'm chiming in late on this, so to go back a few posts, I love the salt shaker idea, and like the hand pinching salt next best. My immediate reaction to the subsequent 9 schemes is that the \"f-ness\" of the letter is best preserved in 1, even if it is less bold. I think it carries the concept best if you can immediately read the letter. My reaction to the sketches with bolder or fewer dots is that they don't work as well. Also, 2 and 5 have a heavy border: to my eye that steals thunder from the f. The ones with holes in outline don't seem graphically strong enough. It's an interesting direction to take with the crescent-shaped shadows in the last two, but I like the flat scheme best, as it reminds me of a large shaker with a handle whose top is flatter and not domed. What if the disc acquired some light tone? or what if the gray tone were actually a photograph of the wonderful off-white texture of the salt? Reall, though, it seems best to keep it very simple and clean, allowing it to appear in small ads in the local paper, etc.\n\nFinally, as you refine this, might you consider shifting the axis of the vertical stroke just wee bit to the left? I know it is geometrically centered on the disc now, but since most of the \"action\" and dynamism in the glyph is happening on the right, it doesn't feel _quite_ centered. I'm talking a very subtle move here, mind you.\n\nWhat an inspired idea!\n\nWill you have any influence on the interior design of the shop? I once attended a brown-bag lunch at the Alliance Française and the speaker that day was an (American) architect who had lived for a time near Guérande in France where all the sea salt production takes place. Her friend owned an airplane so she went up with him many times and photographed the big evaporation areas from above -- it was like seeing the most amazing and beautiful abstract paintings! I'm sure such images are available through stock agencies and they could make a wonderful impression in the shop.\n\n"
    },
    {
      "time": "",
      "content": "I was thinking about moving the 'f' to the left as well.  \nSubtle or not, just look and place it so that it is optically in the middle of the circle. Especially when the strokes get thicker.\n\nI like the 'f' of 6 the best. But over-all I think 4 is the nicest. But on 4 the 'f' also needs to go up a bit.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the advice, I've been trying to get it look centered by off centering it a tad.\n\n"
    },
    {
      "time": "",
      "content": "Here is where I am at:\n\n(the 1st is Universe + Sabon)  \n(the 2nd is Helvetica Nue + Esprit)\n\n ![](http://web.archive.org/web/20101022180642im_/http:/typophile.com/files/1logo_4577.jpg)\n\n"
    },
    {
      "time": "",
      "content": "(3rd is Avant Garde + Sabon)  \n(4th is Futura + Esprit)\n\n ![](http://web.archive.org/web/20101022180642im_/http:/typophile.com/files/2logo_5227.jpg)\n\n"
    },
    {
      "time": "",
      "content": "As I noted above, I love the shaker idea. My only problem is the name of the company. When I see \"flavorit,\" I do not see two words, \"flavor\" and \"it.\" I read the company name as one word... something like \"fla-vor'it.\" (Sounds like the name of a toothpaste)--- If this is a problem, you might considering a different font color for \"flavor\" and \"it.\" God, I love being picky!  \nDB~\n\n"
    },
    {
      "time": "",
      "content": "As I noted above, I love the shaker idea. My only problem is the name of the company. When I see \"flavorit,\" I do not see two words, \"flavor\" and \"it.\" I read the company name as one word... something like \"fla-vor'it.\" (Sounds like the name of a toothpaste)--- If this is a problem, you might consider a different font color for \"flavor\" and \"it.\" God, I love being picky!  \nDB~\n\n"
    },
    {
      "time": "",
      "content": "On the graphic showing 9 concepts, I really liked #8 because it had the subtle shading on the lower left to give it slight dimension, and helps tell people what it is. The shaker holes I would keep solid though, not outline.\n\nOn the follow-ups, namely the 3rd showing Avant Garde + Sabon, I would give the f and l a little more room to breathe. I think the 4th has the most personality of the four. I would still try some more faces because you have such a great idea going here. Nice work.\n\n"
    },
    {
      "time": "",
      "content": "A capital F would work better in that shape and help make a stronger link to a shaker. Also you might need to look at the balance between the icon and the type, they're not looking comfy with each other right now.\n\nCheers\n\n"
    },
    {
      "time": "",
      "content": "I think the proportions of the \"f\" in flavorit should match those of the f-dots symbol.  \nThat's why I liked Futura, because the crossbar is low. You could tinker with the Futura \"f\", just for the wordmark--extend the crossbar to the left, and curl the top over a bit. Avoid anything resembling a ligature. The tag line would be good in Futura too, to stick with the modernist uniformity -- because your logo is a conceptual metaphor and hence modernist. The logo is also geometric modernist: the f-dots are perfect circles. Therefore grot types and those with square i-dots don't match. The principle here is to get everything to harmonize and reduce compexity at the same time. That all stems from the logo.\n\n"
    },
    {
      "time": "",
      "content": "If the company name needs to be _flavor it_ what about using a bullet between the words? this would allow you to keep a relatively continuous stream of marks in that horizontal stripe, and it would even be an echo of the salt shaker dots above. I'll do it here but of course it'll be in serif type. **flavor** • **it**\n\nI keep looking at the overall spareness and modernity of the shaker top and large word(s) in things like futura, and the following line in serif type. These traditional serif designs feel too \"other\", not clean and modern enough. what if you make the upper line sans lc in a big size, and then the lower line sans U/lc ital in smaller size?\n\n"
    },
    {
      "time": "",
      "content": "I thought about the bullet, but it reminded me too much of fla•vor•ice popsicles.\n\nI will work on the type more, but I know my professor thinks future is too 1920's for my shop. Any other suggestions for the sans serif? I will have to change my F to match the typeface I go with.\n\n"
    },
    {
      "time": "",
      "content": "Futura's x-height puts the f crossbar low, and that is necessary for the f-dots symbol to work effectively. So a more recent small x-height geometric sans would seem appropriate. But perhaps the small x-height is not crucial, which opens up the field. I'm sure you can find something in the FontBook.\n\n"
    },
    {
      "time": "",
      "content": "This looks really good\n\nThe use of Futura is very sympathetic to the mark, especially if you visually match up the thickness of the shaker's outline with the stroke weight of the type. Your mark is clean, simple and clever which is complemented by Futura's monoline appearance.\n\nThis treatment won't look 'too 1920s' to the vast majority of viewers. Your tutor's viewpoint and that of other design-centric observers on type is coloured by their own expertise and shouldn't be taken as gospel.\n\nNitpicking:\n\n– The type needs to be slightly bigger in relation to the mark, so it's slightly narrower than the width of the mark itself. If the lower line could be 'Customised seasoning blends' it could be set to match the width of 'flavorit' and by not explicitly mentioning salt you avoid the potential health stigma already noted.\n\n– The three dots that make up the top curve of the 'f' might look better if the lower two are aligned. The one that makes the very end of the curve looks like it has popped out of line whereas the other dots are very regularly placed.\n\n– Slightly open up the kerning betwwen 'f' and 'l' to balance the word up\n\nGood luck\n\n"
    },
    {
      "time": "",
      "content": "+1 on the Futura.\n\nStill not digging the text under the name, reads too long, I could never picture all that on signage. There's a scale problem with relation to the name. Can you shorten this line? What about simply \"custom season salts\", or something like that?\n\n"
    },
    {
      "time": "",
      "content": "_This treatment won’t look ‘too 1920s’ to the vast majority of viewers._\n\nTrue, but that's not the point.  \nA good design should satisy the more discerning as well.\n\n"
    },
    {
      "time": "",
      "content": "Nick,\n\nideally yes. It's admirable to try and please all the people all of the time, but is it necessary in this case to look for another typeface that does everything that Futura is doing in the logo currently, solely to avoid a small number of people raising an eyebrow over the date of the type?\n\nFor a moment let's assume we want to do just that. The shop is contemporary, the product is not, so what timescale is appropriate?\n\nWe can't pigeonhole salt in a particular time period so we're out of luck there.\n\nThe shop however is new so do we say contemporary typeaces only? Confine ourselves to this decade? Should we choose a Futura-like geometric sans released as close as possible to the opening date of the new shop in order to be as chronologically synchronised as possible?\n\nI'm not for a moment saying that designers should indulge in glaring typographic howlers, but should Futura be reserved solely for works on 1920s functionalism? An extreme example I know, but where does one draw the line?\n\n"
    },
    {
      "time": "",
      "content": "Is the Salt shoppe next to the Tape store?\n\n"
    },
    {
      "time": "",
      "content": "On the last examples (with the names) the 'f' still is off-centre optically. It needs to go up and to the left quite a bit. :)\n\nTo be honest, I don't really like either of the typefaces used for the name. If I _had_ to choose, I would go for the Univers one. But I think none of them is right on spot.\n\n"
    },
    {
      "time": "",
      "content": "_where does one draw the line?_\n\nChris, there are several arguments for using contemporary typefaces for contemporary work, rather than old types.\n\nOne would be to preserve the integrity of historical allusion, which is the frame of reference which you mention.  \nAnother would be to differentiate the product/service, so that it doesn't look like part of other corporations that use the same classic face.\n\nThe best argument for old faces is their \"neutrality\".\n\nHowever, transcending reasons related to the job in question is a general professional consideration, which is that it's important for creatives to express their own time and place, and support their peers, such as photographers, illustrators, and type designers. (Self-interest declared, although I have yet to publish an old-school geometric sans.)\n\n"
    },
    {
      "time": "",
      "content": "I like the idea of a \"dated\" face. Futura's a great face, I can't think immediately of a better contemporary face. And it is dated, but that's ok by me. I'm not burnt out on retro-chic done well. It reads nostalgia, \"think back when food was made in the kitchen, and we had giant salt shakers instead of microwaves and single-use salt packets.\"\n\nBy the way, I think a '50's font would take that too far, into trite kitsch.\n\n"
    },
    {
      "time": "",
      "content": "I vote for the version with Univers and Sabon. Also, in the second pair of proposals, the text below \"flavorit\" has become too tiny, I think.\n\nI also like the idea that \"flavor\" and \"it\" could be two different colors, or two shades of the same color (\"flavor\" could be the stronger percentage, get it?).\n\n"
    },
    {
      "time": "",
      "content": "Victoria,\n\nIt is never too late some say...\n\nI honestly think the salt shaker Idea is a very good reference, both visual and conceptual. However, I feel the symbol is a little too obvious and literal.\n\nHave you tried the negative version of the symbol?, I think it would give it more presence.\n\nWhat about, instead of having such an essential lowercase \"f\" in the symbol, you use a much more elaborate one? or an Uppercase?  \nSomething like giving the actual \"f\" some more flavor!\n\nAlso, With a symbol with such personality I would keep the logotype clean, with a type without too much character.\n\nHope it helps.\n\n"
    },
    {
      "time": "",
      "content": "and one little thing - I agree with 72p about the \"F\" - I would like to see you try it in an italic face - to \"emphasize\" it... giving it a shape and even a feeling of motion (shake)\n\nJust my opinion and hope it helps too.\n\n"
    },
    {
      "time": "",
      "content": "How are these looking?  \nI like the reversed out f/F compared to the previous designs I was working with.  \nI also tried to find a typeface that had some character (similar to futura)?  \nI'm not sure about the script fonts, I like them for their handmade/loose feel, but I could be crazy. Feel free to disagree.  \nCapital F or lc? Should Flavorit be the same as the dotted f as far as CAPS go?\n\nThanks!\n\n ![](http://web.archive.org/web/20101022180642im_/http:/typophile.com/files/f1_5516.jpg)\n  \n\n ![](http://web.archive.org/web/20101022180642im_/http:/typophile.com/files/f2_6039.jpg)\n  \n\n ![](http://web.archive.org/web/20101022180642im_/http:/typophile.com/files/f3_4084.jpg)\n  \n\n ![](http://web.archive.org/web/20101022180642im_/http:/typophile.com/files/f4_4898.jpg)\n\n"
    },
    {
      "time": "",
      "content": "should my type stick our further than the icon?\n\n"
    },
    {
      "time": "",
      "content": "I really like numbers 1 and 2, Victoria. What if you combined icon #2 with text #1? And if you made the \"flavor it\" from #1 bolder?\n\nAlso, I think that the text should be as wide as the icon, to unite both elements visually.\n\n"
    },
    {
      "time": "",
      "content": "How do the dots look as far as a grid?  \nShould I change the dotted f to be like the one used in \"flavorit\"  \nAnd the typefaces chosen?\n\n ![](http://web.archive.org/web/20101022180642im_/http:/typophile.com/files/logo_4962.jpg)\n\n"
    },
    {
      "time": "",
      "content": "At this point, it may be a good idea to try some mock ups.  \nPackaging, ads, biz cards, etc.\n\n"
    },
    {
      "time": "",
      "content": "NIck has the right idea – try putting it to use and see how it works.\n\nI'm wondering why you are justifying the logotype with the symbol. The symbol might work best smaller and elevated away from the type a bit. Also, stop with the scripts. It gets too busy and detracts from the great symbol.\n\n"
    },
    {
      "time": "",
      "content": "Please don't use Freestyle Script.\n\nEdit: Whoops, jonsel beat me to it.\n\n"
    },
    {
      "time": "",
      "content": "I personally like this \"f\" better.  \n [http://www.dafont.com/only-when-i-do-font.font?text=f](http://web.archive.org/web/20101022180642/http:/www.dafont.com/only-when-i-do-font.font?text=f \"http://www.dafont.com/only-when-i-do-font.font?text=f\").\n\n"
    },
    {
      "time": "",
      "content": "Thanks for all your comments/suggestions.\n\nI don't mind the symbol being so geometric, but how can I make the type look more organic? Is it possible to mix the two? The shop allows you to mix custom flavors and seasoning salt is usually applied with the hands, any way to give that feel without the script type?\n\nThis looks too clean:\n\n ![](http://web.archive.org/web/20101022180642im_/http:/typophile.com/files/flavorit_5577.jpg)\n\n"
    },
    {
      "time": "",
      "content": "In my oppinion there is no such thing as too clean. But maybe something as simple as italics or, stretching your font, would give you the feel you are looking for. A hand writen font might even do the trick.\n\n-GP  \n----  \nSans Serif is Grotesque.\n\n"
    }
  ]
}
