{
  "id": "31003",
  "title": "OCR for Scripty Fonts?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I think I already know the answer to this, but here it goes ...\n\nI understand the basic technology behind OCR and it's limitations. What I'm trying to do is somewhat out of the ordinary ... I need to capture text off of printed pieces of stationery. Fonts, colors and background colors vary across the board. Ie. There could be a scripty, blue font on a green background.\n\nDoes anyone know of ANY OCR software out there that would serve my purposes?\n\nAny help is much appreciated ...\n\n",
  "author": "gdzyn",
  "time": "30 Jan 2007 — 10:42am",
  "uid": "11822",
  "comments": [
    {
      "time": "30 Jan 2007 — 12:14pm",
      "content": "Why don't you put a small barcode to the bottom of any piece?\n\n"
    },
    {
      "time": "30 Jan 2007 — 12:34pm",
      "content": "I need to pull the text from each card into some kind of text editor to refer back to at a later date.\n\n"
    },
    {
      "time": "30 Jan 2007 — 12:55pm",
      "content": "not sure what your purposes are. . . easier steps. . . post the fonts here, some typophile will ID them at light speed, then either purchase or comp the fonts respectively from their sources. . . ?\n\n"
    },
    {
      "time": "30 Jan 2007 — 1:16pm",
      "content": "I need to clarify:\n\nI don't need to identify the font. All I need to do is capture the actual text on the cards into a text editor to archive. The amount of text on each card will vary from 1 line up to 30 lines of text.\n\n"
    },
    {
      "time": "31 Jan 2007 — 12:34am",
      "content": "I haven't recently used OCR\\*, but when I did it was, at best, hit and miss on anything but the most basic text. Scripts, I would guess, are the least likely to successfully translate. For the time spent scanning, cleaning up etc. and then proof-reading and correcting it would probably be better to employ a copy typist to retype the items.\n\nTim\n\n\\* things might have (must have) improved.\n\n"
    },
    {
      "time": "31 Jan 2007 — 4:11am",
      "content": "Or use speech-to-text Converter if you are English-Speaking, not [Hinglish Speaking](http://web.archive.org/web/20150126024155/http:/news.bbc.co.uk/1/hi/magazine/6122072.stm) like me.\n\n"
    },
    {
      "time": "31 Jan 2007 — 6:24am",
      "content": "It's often cheaper to get an intern/temp to manually input the text manually rather than OCR it all and have to go back and fix all the typos.\n\n"
    },
    {
      "time": "31 Jan 2007 — 2:30pm",
      "content": "If you go to\n\n[http://en.wikipedia.org/wiki/Optical\\_character\\_recognition](http://web.archive.org/web/20150126024155/http:/en.wikipedia.org/wiki/Optical_character_recognition \"http://en.wikipedia.org/wiki/Optical\\_character\\_recognition\")\n\nand scroll down to near the bottom to \"proprietary software,\" there are a number of packages that claim to OCR handwriting and non-Latin fonts (for example, Arabic, Hebrew, and Asian). One of these might work on script fonts. Also, IIRC, software like OmniPage can be \"trained\" to recognize specific symbols, so you might be able to train it on your script fonts, although that would be mighty tedious.\n\nBTW, if you scan in black and white or grey scale instead of full color, color won't matter too much unless something drops out.\n\n"
    },
    {
      "time": "31 Jan 2007 — 6:06pm",
      "content": "As someone with a lot of experience with OCR (it used to be my job to scan and OCR full books) I would recommend typing the text out manually, depending on the number of cards you have.\n\nOCR generally only works on 1-bit images (some OCR programs can accept other formats, but they're converted to 1-bit internally). For best results, you'd have to photoshop each card to make sure the text comes through properly in a 1-bit setting. If you're doing a book, you can just run a batch on the pages since they will all be quite similar, but it sounds as if your cards each have a different design with different colours.\n\nAlso, script fonts are generally harder to OCR, depending on a number of factors including how connected they are, etc. A good OCR program should be able to recognize script fonts, but that can get expensive.\n\nFinally, OCR will always produce typos. Sometimes it's just an extra period or semicolon if there is dust on the page, sometimes 1 becomes l, but I have yet to see a perfect OCR, especially from a colour image. If accuracy is important to you, you'll have to proofread all of your text.\n\nSo, if you still want to go with OCR, go for it, but I'd recommend a fast typist instead.\n\n- Lex\n\n"
    }
  ]
}
