{
  "id": "31014",
  "title": "(x) \"Archives of Scotland\" Capitolium lookalike - Perpetua {William B}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "hello everyone,  \nwonder if anyone can identify this one here & help me solve one mystery?  \nits taken by my phone so the image might be a bit unclear. i only got as far as gerard unger’s capitolium, but its not quite, is it (the caps). or is it a cut i couldn’t find? thanks, zooey\n\n| Attachment | Size |\n| --- | --- |\n| [Image023.jpg](http://web.archive.org/web/20070716091214/http:/typophile.com/files/Image023.jpg) | 151.06 KB |\n\n [‹ (x) Crane's Crest from GF Smith nice serif face - ITC New Baskerville {T Bones}](http://web.archive.org/web/20070716091214/http:/typophile.com/node/31022 \"Go to previous forum topic\") [(x) Alfred Hitchcock's Rear Window vintage poster - hand drawn {Stephen} ›](http://web.archive.org/web/20070716091214/http:/typophile.com/node/31005 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070716091214/http://typophile.com/user/16547\" title=\"View user profile.\">zooey_h</a>",
  "time": "<br>",
  "uid": "16547",
  "comments": [
    {
      "time": " 30.Jan.2007 3.17pm",
      "content": "That’s [Perpetua](http://web.archive.org/web/20070716091214/http:/www.myfonts.com/fonts/linotype/perpetua-2/perpetua/).\n\n"
    },
    {
      "time": " 30.Jan.2007 3.26pm",
      "content": "yup!\n\n"
    },
    {
      "time": " 30.Jan.2007 4.52pm",
      "content": "hi, thanks for your reply, and shame on me should it be so :) but i wonder if this really is perpetua? i’ve been comparing some of the features, and it seems that the “A” in my pic has a pointed apex & is wider, whereas Perpetua’s is flat, the x-height seems to be different, “G” feels heavier in Perpetua & less round, Perpetua’s “l” ascender terminal is less gradual, etc., etc.? z\n\n"
    },
    {
      "time": " 30.Jan.2007 8.38pm",
      "content": "It’s definitely a Gill face or the copy of one, but I can’t explain the differences from Perpetua. It has all the earmarks, such as the f and d. It’s also not Golden Cockerel.\n\nWhere does this come from? Is it an engraving, or copy of an engraving? Could it be something somebody did following Gill, or an engraving that he himself did?\n\nThis specimen seems like it has bits from different sources slapped together—the sans at the top left, the different typeface at the top right...\n\n"
    },
    {
      "time": " 31.Jan.2007 5.42am",
      "content": "definitely looks like a fusion of more than one characteristic features, that’s why i found this face rather intriguing. i do not know who was this caption designed by, nor there is any other clue... i only know i took this picture in an exhibition at glasgow school of art, a while ago...\n\n"
    }
  ]
}
