{
  "id": "3103",
  "title": "Helvetica 45 Light Problem",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hello,   \nI\n\n",
  "author": "ferbone",
  "time": "12 Feb 2004 — 11:39am",
  "uid": "3059",
  "comments": [
    {
      "time": "12 Feb 2004 — 11:53am",
      "content": "Do you have ClearType enabled on the newer machine?   \n   \nhhp\n\n"
    },
    {
      "time": "12 Feb 2004 — 12:46pm",
      "content": "I sure do, but that didn\n\n"
    },
    {
      "time": "12 Feb 2004 — 1:18pm",
      "content": "I'm thinking you might need to have it OFF.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Feb 2004 — 1:26pm",
      "content": "Thanks, but I have had it OFF, that didn't help, if anything, it made it worst.\n\n"
    },
    {
      "time": "17 Feb 2004 — 2:10pm",
      "content": "Are you using the same file on both computers? Maybe you have a file version with bad bmps in one computer and one with good bmps on the other.   \n   \nTry to use the file that looks ok on both computers.\n\n"
    },
    {
      "time": "17 Feb 2004 — 2:14pm",
      "content": "I don't think that BMPs matter on a PC with W2K or WP, Hector. Do the letters look like garbage in every application under XP, Jason? Or is it only a particular few?\n\n"
    },
    {
      "time": "23 Feb 2004 — 1:30pm",
      "content": "Hector,   \nI started out with the, I started using a PS font. I then bought a new TrueType font to see if that made a difference, and that made it worst. So I know the file is good.   \n   \nNathan,   \nThey look bad on MS Word, and Excel. I have not tried switching to Helvetica 45 on the XP menus and message boxes, is that\n\n"
    },
    {
      "time": "23 Feb 2004 — 1:36pm",
      "content": "Can you show us some screen grabs?   \n   \nhhp\n\n"
    },
    {
      "time": "24 Feb 2004 — 10:02am",
      "content": "I'm echoing Hrant's suggestion: screen grabs would help a lot.   \n   \nIt also might be interesting to see how Helvetica looks as the text on your desktop (icons, menus, etc.) - although I'd assume you'd have the same problems you're having in Microsoft applications.   \n   \nAlso, is your Office package the same version on both machines? E.e., are you running Office XP on both? Or Office 2000 on one, and Office XP on the other.\n\n"
    },
    {
      "time": "24 Feb 2004 — 8:54am",
      "content": "Fernando I moved this thread to the BUILD section. Maybe others that can help will see this here.\n\n"
    }
  ]
}
