{
  "id": "31044",
  "title": "Nicolete Gray references",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi kids  \nWhile I was researching post-war reconstruction in the British magazine Architectural Review I’ve found the following articles by [Nicolete Gray](http://web.archive.org/web/20130914021554/http:/typophile.com/wiki/Nicolete%20Gray).  \nI thought I post the references (and the first lines) here in case someone is looking for them but has no time to go through all editions like I did. I hope you find it both useful and enjoyable. Gorgeous photos accompany the articles and I think it’s worth having a look if this is your cup of tea. I could only take photocopies ( no scans) but let me know if you need further details and I shall oblige.\n\n<cite>1953 November / vol.114 / number 683</cite>  \nTHEORY OF CLASSICAL: Much of that heritage comes to us from the last century, when sign-writers and publicists, driven forward by the inexorable pressures of Victorian commerce, broke into new fields and devised new and original forms.\n\n<cite>1954 April </cite>  \nNot found yet.\n\n<cite>1954 June / vol.115 / number 690</cite>  \nEGYPTIANS: Their suitability to contemporary architecture. Undoubtedly, the Egyptian is the best architectural letter that has so far been invented. And, indeed, it was probably invented as an architectural letter. J.Callingham, the author of some of the first signwriters’ manuals, writing in 1871, mentions it originated by signwriters at the end of the 18th century, and later copied by typographers.\n\n<cite>1954 August</cite>  \nNot found yet.\n\n<cite>1954 October</cite>  \nNot found yet.\n\n<cite>1955 April / vol.117 / number 700</cite>  \nMODERN FACE AND FAT FACE [sorry didn’t find the article yet]\n\n<cite>1955 December / vol.118/ number 708</cite>  \nLETTERING: MINUSCULE. Lower case, little letters or minuscule-what shall we call them? For undoubtedly they are important in public lettering, not for monumental purposes, but as a possible and suitable alternative for a multitude of ephemeral and unpretentious uses.\n\n<cite>1956 August / vol. 120 / number 715</cite>  \nALPHABET: If we have rejected the theory that an alphabet based on the Trajan column lettering is the end-all of monumental lettering, if beyond that we have decided that the theory of classical lettering formulated at the Renaissance covers a part only of the possibilities of lettering as an art, what then is the nature of that art? By what criteria can we judge it? How can we tell what is good and what bad, what legitimate and what, if anything, illegitimate, or when indeed a letter is a letter?\n\n<cite>1957 April / vol.121 / number 725</cite>  \nSTREET LETTERING: Without doubt the first consideration in the designing of street lettering should be to insure that it fulfils its purpose; that it should be immediately legible. But, since it is a necessary adjunct to every town street-and indeed most streets are insufficiently labelled-it is also of importance that it should be an ornament to its locality, a pleasure to the inhabitant as well as a convenience to strangers.\n\n<cite>1957 October </cite>  \nNot found yet.\n\n<cite>1958 July / vol.124 / number 738 </cite>  \nMATERIAL AND DESIGN: Until the invention of printing, the dominating factors in letter-design were the tool employed and the surface on which it worked. The trail of brush on papyrus, the slant of the quill on vellum, the bite of stylus or chisel in wax or stone, these circumscribed the forms and indicated the directions of experiment. Lead type and paper extended the range, but the manual skill of the punch cutter was limited by the slowly-improving quality of type-metal, and cultural snobbery, however high-minded its motivation, retained the forms of humanistic minuscule, Trajanic capitals, Fraktur and chancery script in the alien materials of print.\n\n<cite>1959 April / vol.125/ number 747</cite>  \nEXPRESSIONISM IN LETTERING: A piece of lettering is not just an abstract design. The design is conditioned not only by the material from which it is made, and the purpose for which it is made, but also by the idea in the mind of the designer, which can never be purely formal because he must be aware at least of the meaning of the words which he is inscribing.\n\n<cite>1959 May /vol.125/ number 748</cite>  \nTHE MODERN MOVEMENT: We have in previous articles surveyed many different sorts of lettering, different types and different ideas and uses, but the problem which arose in the very beginning still remains to be answered; which of the traditional styles of lettering are best adapted to the modern style in architecture or does it demand a new or exclusive letter of its own?\n\n",
  "author": "lore",
  "time": "31 Jan 2007 — 12:47pm",
  "uid": "11958",
  "comments": [
    {
      "time": "31 Jan 2007 — 1:03pm",
      "content": "Thanks Lore! You are a gentlewomen and a scholar :-)\n\nChrisL\n\n"
    },
    {
      "time": "31 Jan 2007 — 2:04pm",
      "content": "Indeed! Thank you very much!\n\nI was just re-reading some Nicolette Gray in 'Letter Letter' and then in 'A history of Lettering' and was hoping she was still around to talk to. So I went to look her up online. Sadly she died in 1997. Apparently she is one of the first people to specifically shoot photos of letters while on vacation.\n\nWhich of these articles was most interesting to you?\n\n"
    },
    {
      "time": "31 Jan 2007 — 2:18pm",
      "content": "If I remember rightly, in his 'Lettering Tour' of Manhattan Paul Shaw mentioned that some of the best books on the history of lettering on buildings are by Nicholette Gray. If you do a search on these in the catalogue at a research library, you will see what they are. I assume some of them collect these articles. I haven't seen them myself.\n\n"
    },
    {
      "time": "31 Jan 2007 — 2:54pm",
      "content": "<cite>Which of these articles was most interesting to you?</cite>  \nStreet Lettering is mind blowing as it is so in tune with the spirit of the magazine and the Townscape methodology (the art of juxtapositions in the built environment) so fashionable in the mid 50s/60s in England. She describes how certain name plates add something to the character of the place, giving it continuity, unity and individuality. She provides wonderful examples (Bath, Cambridge, Venice) and analyses the differences and…boy, she can write. Nothing is left out, legibility, proportions, purpose, contrasts, material, lighting. Modern Movement is brilliant; I love Macintosh lettering and you can really see how it was integrated in the building. I could go on forever but if you are interested in the relationship between lettering and architecture, this is a must. I have to thank Prof. Morley for introducing me to N.Gray, I admit I was in the dark. Far from being a scholar Chris! Lol! Now, gentlewoman…I like that!\n\n"
    },
    {
      "time": "31 Jan 2007 — 3:19pm",
      "content": "There was a tour given in Lisbon at the tail end of ATypI by Cynthia Nixon and Phil Baines which focussed entirely, IIRC, upon locations at which Nicolette took pictures. If you would like to see pictures from that walk I'm sure there are plenty in the [ATypI Lisbon Flickr Group](http://web.archive.org/web/20130914021554/http:/www.flickr.com/groups/76828707@N00/).\n\n"
    },
    {
      "time": "31 Jan 2007 — 4:33pm",
      "content": "Lore,  \nYou may also be interested in Armando Petrucci's book, \"Public Lettering\". You can, I am sure, read it in the original Italian. I have the English translation from the University of Chicago.\n\nChrisL\n\n"
    },
    {
      "time": "31 Jan 2007 — 10:53pm",
      "content": "Thanks for this list, Lore. A gentlewoman indeed! I am currently reading _XIX Century Ornamented Types and Title Pages_, which I miraculously found at my local public library. Nicolete Gray's refreshing admiration for the slab serifs and fat faces of the Industrial Revolution is a great corrective to the view that only book types are to be admired and considered \"good\".\n\nIf you haven't yet seen it, the book Eben mentions, _[A History of Lettering](http://web.archive.org/web/20130914021554/http:/www.amazon.com/History-Lettering-Creative-Experiment-Identity/dp/0879236124/sr=1-1/qid=1170312571/ref=sr_1_1/104-9672182-5386346?ie=UTF8&s=books)_, is chock full of great photographs.\n\nAnd the latest issue of [Typography Papers](http://web.archive.org/web/20130914021554/http:/www.hyphenpress.co.uk/titles/typo_papers6/contents.html) has an article by her, too.\n\n"
    },
    {
      "time": "1 Feb 2007 — 8:19am",
      "content": "\\>Cynthia Nixon\n\nwould that be Catherine Dixon's pseudonym?\n\n"
    },
    {
      "time": "1 Feb 2007 — 8:45am",
      "content": "Gah! Thank you Miles. I always get Peter Bain and Phil Baines confused. Yesterday someon asked me about Cynthia Batty and so now I have Cynthia and Catherine confused.\n\n"
    },
    {
      "time": "2 Feb 2007 — 7:28am",
      "content": "Cynthia Nixon indeed! Someone's been watching a bit of Sex in the City, have they?\n\n"
    },
    {
      "time": "2 Feb 2007 — 10:41am",
      "content": "O:^D\n\n"
    },
    {
      "time": "3 Feb 2007 — 2:54pm",
      "content": "Thanks for the above references. I'm glad we put this all together, it might become handy to someone one day. I'll probably be able to complete my Architectural Review references on NG soon.\n\nWhy's that I can't find the N.Gray's entry on typowiki anymore? Last time I looked at it it was empty and I made a mess because I wanted to correct the spelling of her first name and ended up adding a new entry or doing something equally silly. Maybe we should add to typowiki all the above info. Or not. Just an idea.\n\n"
    },
    {
      "time": "3 Feb 2007 — 6:24pm",
      "content": "Is that a halo over your head there Miss Tiffany? :-)\n\nChrisL\n\n"
    },
    {
      "time": "3 Feb 2007 — 11:48pm",
      "content": "_I always get Peter Bain and Phil Baines confused._\n\nYou're not the only one, Miss Tiffany. I once ran into Peter Bain and said, \"Hi, Phil.\" Argh!\n\n"
    },
    {
      "time": "3 Feb 2007 — 11:58pm",
      "content": "_Why’s that I can’t find the N. Gray’s entry on typowiki anymore?_\n\nI couldn't find it either. There's a \"Designers\" category but not a \"Writers\" category; maybe that's why?\n\n"
    },
    {
      "time": "14 Feb 2007 — 5:57pm",
      "content": "Excellent suggestion, Ricardo. Created [Nicolete Gray](http://web.archive.org/web/20130914021554/http:/typophile.com/wiki/Nicolete%20Gray) wiki entry (needs additions) and [Writers](http://web.archive.org/web/20130914021554/http:/typophile.com/wiki/Writers) wiki index.\n\n"
    },
    {
      "time": "14 Feb 2007 — 6:25pm",
      "content": "Lore . . .\n\nCiao cara e Happy Valentine's Day: I have right here in my hand April, August, and October 1954, and April 1955! The articles look wonderful and are rich in photographic examples.\n\nOctober 1957 is missing, so can't help you there -- it looks as if my father subscribed up to December 1955 and then left off until January 1960.\n\nThe bindings are quite fragile, as you no doubt discovered when you were making your photocopies, but I think I may be able to lay one page of the spread down on my flatbed and allow the rest of the mag to hang in space vertically so as not to break anything.\n\nNow the bad news: I am leaving tomorrow morning for 10 days. So in late Feb or early March I can scan these and send them to you. I can also upgrade your current photocopied examples of June 1954, and April and December 1955 since I have those as well.\n\nA more general question: since this is post-1927 material (at least 1927 is the magic number in the U.S.) then does copyright prevent me from making these available for public reading, say on Typophile site somewhere? I'm never sure about these things.\n\n"
    },
    {
      "time": "14 Feb 2007 — 6:57pm",
      "content": "Cool job Stephen. Nicolete is definetely the correct spelling according to extremely reliable sources ( [J.Mosley](http://web.archive.org/web/20130914021554/http:/typophile.com/wiki/James%20Mosley) strikes again)\n\nNo worries Bruce, there's no hurry. Every day I discover more material even here in Brazil. The main library at the FAU USP (architecture and Urbanism university of S. Paulo) is excellent, it's just a matter of time. Don't do anything that will damage the magazines and always wear gloves!\n\nYesterday I received an authorization by email from the AR editorial staff to reproduce part of an article on the SP university's periodical. They say they only need me to print a credit line line \"First published in AR month/year and reproduced courtesy of The Architectural Review\" because it's for academic purposes, maybe for Typophile is the same? I don't know. Probably. In any case they asked me to confirm that I would do that and I have the email printed just in case.  \nAnd Happy Valentine to us all, of course!\n\n"
    }
  ]
}
