{
  "id": "31055",
  "title": "How small should I set a logo to test legibility and usefulness?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "G'day folks,\n\nI am testing a logo to see how it performs at very small sizes. I'm wondering if there was a minimum size that people use to test logos, for example, if it's still readable at 10mm wide it will be fine. What do other people do?  \nI hope this makes sense, it does in my head but then...  \nthankyou\n\nNick\n\n",
  "author": "nicholasgross",
  "time": "31 Jan 2007 — 6:53pm",
  "uid": "9500",
  "comments": [
    {
      "time": "31 Jan 2007 — 7:01pm",
      "content": "I don't know specifics, but I always hear people say that a logo should work at sizes between a business card and a billboard. I honestly can't imagine a logo being much smaller than 1 cm (or even often being seen at that size), as you described; I'd think that if it's readable that small, that's incredibly good.\n\n"
    },
    {
      "time": "31 Jan 2007 — 7:14pm",
      "content": "Thanks Reed,\n\nMy worst-case scenario I have in mind is the cluster of sponsor logos you often see at the bottom of a brochure or flier or program, in your experience do these get smaller than say 15mm?\n\nNick\n\n"
    },
    {
      "time": "31 Jan 2007 — 7:18pm",
      "content": "How small will it need to get, and where will it be seen? This is really relative, so as much as possible we test logos in their final environments and worst case scenarios. For a film production company we tested movement at small reversed sizes at screen res (ie as seen at the end of film credits), for an electrical engineer we tested etched in metal at around 10mm across.\n\n"
    },
    {
      "time": "31 Jan 2007 — 7:20pm",
      "content": "Oops, sorry Nick, posted too quick.\n\n"
    },
    {
      "time": "31 Jan 2007 — 7:37pm",
      "content": "Unfortunately, Nicholas, I don't have very much experience to speak of. My gut feeling is that if you're thinking this much about clarity, it shouldn't be much of a problem in the end. The things I know you need to watch out for are little details that could get blurry or filled up when scaled down. If your logo has a lot of fine details, then it might be a good idea to make a simplified version for use in these difficult circumstances. Hope this is helpful; maybe someone else has more concrete knowledge.\n\n"
    },
    {
      "time": "31 Jan 2007 — 9:22pm",
      "content": "I regularly have to put logos in designs as small as 1/2 inch in the largest dimension. Even a bit smaller sometimes.\n\npeace\n\n"
    },
    {
      "time": "31 Jan 2007 — 9:34pm",
      "content": "I was taught to go as small as it's likely to appear when the client orders it painted onto the side of a disposable pen.\n\n"
    },
    {
      "time": "1 Feb 2007 — 3:33am",
      "content": "Good rule of thumb on the pen -- but I think you have to consider resolution/quality/colour issues as well.\n\nBusiness cards are generally the smallest full colour litho application, but very high print resolution so rarely any problems.\n\nPens the smallest print application, generally screen printed in 1 or 2 solid colours, potential for ink spread.\n\nYou should check how it prints at likely sizes on low resolution devices - colour and b/w laser prints. Fax, although dying out, should be at least considered.\n\nThen there are web graphics and perhaps application icons. I remember having to make a logo work on an early WAP phone - tiny screen, no greyscale let alone colour.\n\n"
    },
    {
      "time": "1 Feb 2007 — 5:04pm",
      "content": "Cool thanks,\n\nThis has all been very useful. My logo has quite a few fine details (points) that might present some problems at \\*very\\* small sizes. I'm thinkng the best thing is to make another version for very small sizes with simplified detail and heavier text or something. The disposable pen thing scares me frankly ;)  \nthanks so much for all your help  \ncheers\n\n--N\n\n"
    }
  ]
}
