{
  "id": "31056",
  "title": "Aviano Titling",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Aviano is an extended all caps face inspired by Trajan. I wanted the face to have extended letterforms for a more “formal” look, and also more geometric and consistent letterforms. This is some early experimentation. I welcome any comments.\n\n ![](http://web.archive.org/web/20150422205036im_/http:/typophile.com/files/Aviano-R1_5692.gif)\n\n",
  "author": "Jeremy Dooley",
  "time": "31 Jan 2007 — 7:37pm",
  "uid": "8555",
  "comments": [
    {
      "time": "31 Jan 2007 — 10:25pm",
      "content": "i like some of the features of the letterforms, however, the contrast seems a bit off. It actually reminds me of a Goth type font as opposed to Trajan. Good luck with your experiments. Repost when you have another version.\n\n"
    },
    {
      "time": "1 Feb 2007 — 2:10pm",
      "content": "When you first drew this, was it thinner than what you've posted? It looks as if it's been mechanically extended, rather than just drawn wide. Maybe it's in the brackets on your serifs--I think maybe they should start higher up on the stems. However, that might not be what I'm seeing at all. I also think your serifs are some too fine. Can you post a PDF?\n\n"
    },
    {
      "time": "1 Feb 2007 — 3:07pm",
      "content": "I agree with Nathanael it also feels like it's been mechanically pulled wide from another state rather than drawn wide in the 1st place. I don't like that feeling. Also, watch that kerning with the AV! I think you might want to draw this again. Maybe in Ink with a brush to get the relationships right.\n\n"
    },
    {
      "time": "1 Feb 2007 — 3:07pm",
      "content": "Or use water at first to get the hang of it. Water is cheap!\n\n"
    },
    {
      "time": "1 Feb 2007 — 3:13pm",
      "content": "I was also having troubles with how it looks mechanically pulled. Just so you know, it isn't. I wonder if the problem is that the extenstion isn't quite enough- it's sort of in limbo. Anyone have experience drawing extended typefaces? This is my first real attempt at it. The \"extension effect\" isn't as pronounced when you print it out.\n\nExcuse the kerning/spacing for now, I'm still working out the letterforms at this stage. I completed A-Z, and here is a .pdf, as requested. There could be some \"crunchies\" from the illustrator import still.\n\n[http://www.insignedesign.com/files/avianosample.pdf](http://web.archive.org/web/20150422205036/http:/www.insignedesign.com/files/avianosample.pdf \"http://www.insignedesign.com/files/avianosample.pdf\")\n\n"
    },
    {
      "time": "2 Feb 2007 — 2:22am",
      "content": "Hi\n\nNice, though I agree with the above posts on the wideness looking unnatural. It looks like a wide font that has been stretched even wider. See the G for example. Its left side looks almost pointy to me.\n\nI also think there are some problems with the balance of certain letters. Here I am talking about the S for instance. It looks top heavy. Make the top part a bit narrower maybe. The Z is leaning backwards (to the right, that is to me). The X is also unbalanced. The top and bottom part are probably equal in size but this makes it look unbalanced optically. Make less whitespace in the top part and it will start to balance.\n\nMagnus\n\n"
    },
    {
      "time": "2 Feb 2007 — 2:51am",
      "content": "You could also look at these\n\n[http://typophile.com/courses/type101](http://web.archive.org/web/20150422205036/http:/typophile.com/courses/type101 \"http://typophile.com/courses/type101\")  \n [http://typophile.com/courses/type110](http://web.archive.org/web/20150422205036/http:/typophile.com/courses/type110 \"http://typophile.com/courses/type110\")\n\nand\n\n[http://www.logofontandlettering.com/](http://web.archive.org/web/20150422205036/http:/www.logofontandlettering.com/ \"http://www.logofontandlettering.com/\")\n\nBut really to get a feeling for why the letters should have one sort of shape rather than other when extending the Trajanic model you might really try using a brush. It's probably the only way to get the insight you need to do it & not make it look 'funny' or odd somehow.\n\n[http://www.tomkemp.com/book/index.html](http://web.archive.org/web/20150422205036/http:/www.tomkemp.com/book/index.html \"http://www.tomkemp.com/book/index.html\")\n\n"
    },
    {
      "time": "2 Feb 2007 — 2:13pm",
      "content": "I think what it wants is some squaring of the round. This is just a theory, but I--hold on. I'm not going to be able to use words well enough to say this.\n\n ![](http://web.archive.org/web/20150422205036im_/http:/typophile.com/files/allpurposetemp_3770.PNG)\n  \nOkay, my idea is that a font looks awkward if it has curves that are shallower than those in a circle. Curve a is shallower than a circle. Curve b is just as wide, but the curves aren't as shallow, so it looks sturdier. I think that's why your font looks artificially extended. Now, there may be a font or a person out there that contradicts my theory, but this is what my gut tells me is the solution. \n"
    },
    {
      "time": "2 Feb 2007 — 5:17pm",
      "content": "Maybe, but then is a Trajanesque or something new? I think the best answer is related to but not the same as your suggestion. Of course if that something new feels nice then: Hooray. But it's a matter of intent.\n\n"
    },
    {
      "time": "2 Feb 2007 — 10:07pm",
      "content": "To all that have commented,\n\nI greatly appreciate your help and the time you have spent assisting me with this project. You all have some great points, and I am still working on addressing them.\n\nI have worked on eliminating the extended feel. I feel I have that pretty much worked out, but maybe I've been looking at it too long.\n\nNumber3Pencils, I pretty much came to the same conclusion that you did, when I was inking out the forms. After examining my strokes, I found the rounded forms had some unusual kinks. I've reworked those characters.\n\nI have attached a new .PDF file with some markings noting some areas I need to touch up and underlined characters that are so hideous they need reworking. I am primarily looking for areas that I missed, and your comments regarding the \"extension\" effect at this point. The numbers in particular have some balance issues.\n\nOnce again, thanks for your assistance both with the design and motivating me to create a better typeface.\n\n[http://www.insignedesign.com/files/avianor2.pdf](http://web.archive.org/web/20150422205036/http:/www.insignedesign.com/files/avianor2.pdf \"http://www.insignedesign.com/files/avianor2.pdf\")\n\nJDooley\n\n"
    },
    {
      "time": "3 Feb 2007 — 11:01pm",
      "content": " ![](http://web.archive.org/web/20150422205036im_/http:/typophile.com/files/AvianoR3_4196.gif)\n\nSome revisions today.\n\nPDF: [http://www.insignedesign.com/files/avianor3.pdf](http://web.archive.org/web/20150422205036/http:/www.insignedesign.com/files/avianor3.pdf \"http://www.insignedesign.com/files/avianor3.pdf\")\n\nJeremy Dooley  \n [www.insignedesign.com](http://web.archive.org/web/20150422205036/http:/www.insignedesign.com/ \"www.insignedesign.com\")\n\n"
    },
    {
      "time": "3 Feb 2007 — 11:18pm",
      "content": "How about dropping the lower join on he P? Extend the straights on the D it still looks 'pulled'. Your Z looks like it wants to leave the group. The C&G are much improved but still look a bit pulled. I think the H does not need to be that wide. The O seems a bit too heavy.\n\nBut I think the best thing would be to find a really good model to look at. I have a bunch of phtos I took in Rome that might be helpful too. But Flickr is down so maybe later.\n\n"
    },
    {
      "time": "4 Feb 2007 — 12:50pm",
      "content": "Flickr is back.\n\nI hope these can be helpful.\n\n[http://www.flickr.com/photos/ebensorkin/sets/72157594336113040/](http://web.archive.org/web/20150422205036/http:/www.flickr.com/photos/ebensorkin/sets/72157594336113040/ \"http://www.flickr.com/photos/ebensorkin/sets/72157594336113040/\")\n\n"
    },
    {
      "time": "4 Feb 2007 — 4:05pm",
      "content": "I think the base of the E should be longer.\n\n"
    },
    {
      "time": "4 Feb 2007 — 10:36pm",
      "content": "Eben,\n\nThose are some really great photos. Thanks for sharing those.\n\nI think I should be clear about my objective. I am not necessarily trying to do “Trajan Extended.” I want to provide an alternative to someone that might be doing a job that would normally scream “Trajan!” My objectives were to have the typeface exhibit regular and even geometric styling, but with a heavy influence from the power and timeless beauty of Trajan.\n\nI agree with your comment about the O and Q, and have corrected the problem. For the P, I have added it as an OpenType alternate so it is available if desired. I’ve corrected the group. I was having problems balancing it and got distorted to the point it was almost obliqued. I think the C and G are ok, and I have reduced the size of the H.  \nI have also extended the base of the E.\n\nOnce again, thanks to all for the assistance so far.\n\nPDF: [http://www.insignedesign.com/files/avianor4.pdf](http://web.archive.org/web/20150422205036/http:/www.insignedesign.com/files/avianor4.pdf \"http://www.insignedesign.com/files/avianor4.pdf\")\n\nJeremy Dooley  \n [www.insignedesign.com](http://web.archive.org/web/20150422205036/http:/www.insignedesign.com/ \"www.insignedesign.com\")\n\n"
    },
    {
      "time": "5 Feb 2007 — 11:17pm",
      "content": " ![](http://web.archive.org/web/20150422205036im_/http:/typophile.com/files/avianosamplepagethumb_5792.gif)\n\nAdded the lower case today. I am planning to add a bold weight tommorrow. Any comments?\n\nPDF: [http://www.insignedesign.com/files/avianosamplepage.pdf](http://web.archive.org/web/20150422205036/http:/www.insignedesign.com/files/avianosamplepage.pdf \"http://www.insignedesign.com/files/avianosamplepage.pdf\")\n\nJeremy Dooley  \n [www.insignedesign.com](http://web.archive.org/web/20150422205036/http:/www.insignedesign.com/ \"www.insignedesign.com\")\n\n"
    },
    {
      "time": "6 Feb 2007 — 12:29am",
      "content": "Beautiful! It reminds of of Goudy's work a bit.\n\nI'd suggest making the bowls of the U and u much more round. They are too pointy at the moment, and feel forced.\n\nYour serifs also all feel like they've been stretched out, rather than drawn out. Perhaps you could make them a little more \"slab\" like? Obviously, I don't mean that you should make them real slabs, or even wedge slabs… but the curves could have more meat to them!\n\n"
    },
    {
      "time": "6 Feb 2007 — 11:31pm",
      "content": "Dan,\n\nThanks for the comment. I rounded off the U and the u.\n\nOne of my objectives before beginning this project was to do a titling with \"power.\" I thought that sharper serifs would help achieve this. I can certainly see how my choice of sharper serifs contributed to the extension problem I was having, but since this was one of my original objectives, I don't want to abandon it.\n\nAll,\n\nThanks for your assistance with this project. I ended up with a much better typeface, thanks to your help.\n\nwww.insignedesign.com\n\n ![](http://web.archive.org/web/20150422205036im_/http:/typophile.com/files/avianoflag_4765.gif)\n\nThe typeface and additional information is available [here](http://web.archive.org/web/20150422205036/http:/www.insignedesign.com/Typeface.aspx?FamilyName=Aviano).\n\nJeremy Dooley\n\n"
    }
  ]
}
