{
  "id": "31052",
  "title": "Hitchcock font by Matt Terich",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi, does anyone have this font that they could mail me? saulbass.net is now gone.  \nGP\n\n",
  "author": "goldenpalomino",
  "time": "31 Jan 2007 — 3:03pm",
  "uid": "16580",
  "comments": [
    {
      "time": "31 Jan 2007 — 3:38pm",
      "content": "[Typographica](http://web.archive.org/web/20150406024847/http:/www.typographica.org/) has made arrangements with Matt to host the font soon. In the meantime, consider yourself emailed (as soon as you provide some sort of contact information).\n\n"
    },
    {
      "time": "1 Feb 2007 — 4:50am",
      "content": "fantastic, thank you, i've edited my profile to allow emails,(set it up quickly late last night) hopefully it'll be possible now.\n\n"
    },
    {
      "time": "17 Feb 2007 — 12:37pm",
      "content": "Hi, I was also looking for this font, as I need it for a project. If you could email it to me asap as well you would be a life saver. Thank you tons in advance!\n\n"
    },
    {
      "time": "12 Jun 2007 — 2:33am",
      "content": "Cough cough.\n\nI'd like that font too if you could email it?\n\nThanks!\n\n"
    },
    {
      "time": "12 Jun 2007 — 3:43am",
      "content": "The whiny author of [Uncredited – Graphic Design and Opening Titles](http://web.archive.org/web/20150406024847/http:/www.amazon.co.uk/Uncredited-Graphic-Deisgn-Opening-Titles/dp/8496309525/ref=sr_1_1/203-6978437-4151127?ie=UTF8&s=books&qid=1181644686&sr=8-1) mentioned that typeface as an example of cinematic cluelessness as the letters are actually based on an Otto Preminger film. Oh, _ **shut up** _ I thought as I read.\n\nƒ\n\n"
    },
    {
      "time": "12 Jun 2007 — 11:03am",
      "content": "I have also been looking for this font. If anyone would be so kind as to e-mail it to me also.\n\nThank you.\n\n"
    },
    {
      "time": "12 Jun 2007 — 1:10pm",
      "content": "Hello.\n\nI need that font too. I've lost in the last drive format.\n\nCould anybody send it to me?\n\nThanks.\n\n"
    },
    {
      "time": "12 Jun 2007 — 1:38pm",
      "content": "At the risk of being considered whiny (by someone other than hhp), be it noted that Saul Bass didn't do the lettering for his movie titles/posters -- he was the designer. Without seeing the roughs he gave to his lettering artists, it's hard to know how much credit to give him. Was it a scribble on a napkin, or a slick comp? At any rate, it could be misleading to call a derived font \"Hitchcock\" -- as recently emerged when a senior executive at Adobe thought that John Warnock had designed the font named after him.\n\nMovie: This is Goggle  \nClient: Otto Preminger  \nDesigner (poster); Saul Bass  \nLettering: Art Goodman\n\nMovie: Vertigo  \nDesigner (poster); Saul Bass  \nLettering: Dave Nagata\n\nMovie: Love in the Afternoon  \nDesigner (poster); Saul Bass  \nLettering: Art Goodman\n\n"
    },
    {
      "time": "13 Jun 2007 — 5:28am",
      "content": "Your boldness will not go unnoticed.\n\nThe reference to the typeface just didn't have anything to do with anything in the book. Very useless You see. The book could be a masterpiece in every other aspect. Haven't finished it yet.\n\nAnd don't forget Spartacus. Art Goodman did excellent work there. That is what I have learnt from the book so far.\n\nƒ\n\n"
    },
    {
      "time": "13 Jun 2007 — 11:46am",
      "content": "_thought that John Warnock had designed the font_\n\nPardon me, that should have been \"was quoted as having thought that John Warnock had designed the font...\"\n\n"
    },
    {
      "time": "30 Aug 2007 — 9:54am",
      "content": "I have desperately been searching for this font as well- someone could email, I would appreciate it very much!\n\n"
    },
    {
      "time": "31 Aug 2007 — 7:58pm",
      "content": "I worked with Saul Bass for 2 1/2 and also with Art Goodman and his assistant Dave Nagata. Dave Nagata was a master lettering artist and most of the comps were done by him while Art Goodman cracked the whip. When the comps were presented to Saul Bass and the actual font that matched the layout was chosen for the credits. I did the type on Mad, Mad, Mad, World. Main title were usually hand lettered. In the movie Man With the Golden Arm, Art Goodman's crippled arm was the model. Well, that's enough history for now.\n\n"
    },
    {
      "time": "4 Sep 2007 — 2:48pm",
      "content": "Thanks for the backgound, Robert. It's great to get the facts from a man who was there. Can you tell us more about what influence Saul Bass had on the actual style of the lettering? Did he ask for a general feeling and leave the actual forms to Goodman and Nagata, or were his directions more specific and detailed?\n\nThe [Hitchcock font](http://web.archive.org/web/20150406024847/http:/typographica.org/2007/on-typography/saul-bass-website-and-hitchcock-font-are-back/) and some background info are now live at Typographica.\n\n"
    },
    {
      "time": "4 Sep 2007 — 3:02pm",
      "content": "Here is what the PC .ttf link tries to link to: [http://typographica.org/art/articles/2007/hitchcock/Hitchcock-MacPS.zip%22](http://web.archive.org/web/20150406024847/http:/typographica.org/art/articles/2007/hitchcock/Hitchcock-MacPS.zip%22 \"http://typographica.org/art/articles/2007/hitchcock/Hitchcock-MacPS.zip%22\")\n\n"
    },
    {
      "time": "4 Sep 2007 — 3:06pm",
      "content": "Whoops. Fixed. Thank you, Dennis.\n\n"
    },
    {
      "time": "13 Mar 2010 — 7:13am",
      "content": "Hi!\n\nCould someone send me the font too?  \nThanks a lot!\n\n"
    },
    {
      "time": "13 Mar 2010 — 11:02pm",
      "content": "Ancient link fixed yet again! Sorry.\n\n"
    }
  ]
}
