{
  "id": "31065",
  "title": "Type face history database site type thing erm...",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello all, or at least those who’re interested.\n\nI’m interested in finding at least a little history on many random fonts i come across, but short of buying many individual books, does someone know of a website that is a database of type history information.\n\nI know a bit about the more famous and well known types, but for example today i have come across ’Egyptian505SH’ which i know nothing about but wondered if it had a particular historical antecedant (is that the correct use of that word?) other than just being a slab serif?\n\nSorry if this seems a little confused and disjunct, but i’m eating thai curry and trying to do work at the same time.\n\nThanks in advance for any help.\n\nG\n\n [‹ Helvetica's Birthday](http://web.archive.org/web/20071112201047/http:/typophile.com/node/30890 \"Go to previous forum topic\") [Advice needed - is there hope for the comic sans lovers? ›](http://web.archive.org/web/20071112201047/http:/typophile.com/node/31020 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071112201047/http://typophile.com/user/11280\" title=\"View user profile.\">G T</a>",
  "time": "<br>",
  "uid": "11280",
  "comments": [
    {
      "time": " 1.Feb.2007 8.42am",
      "content": "I swear that exact typeface was just talked about. 505 was a room number. I think Dan Reynolds posted about it.\n\n"
    },
    {
      "time": " 1.Feb.2007 11.31am",
      "content": "that’s right. have a look at the bottom of the page at myfonts.com:\n\n[http://www.myfonts.com/fonts/vgc/egyptian-505/](http://web.archive.org/web/20071112201047/http:/www.myfonts.com/fonts/vgc/egyptian-505/ \"http://www.myfonts.com/fonts/vgc/egyptian-505/\")\n\ni don’t know a bigger typeface database than myfonts.com. however, there is not always an info available. sometimes, you can find some more detailed background information on the specific foundry’s homepage.\n\n// alex\n\n"
    },
    {
      "time": " 1.Feb.2007 11.46am",
      "content": "Tiffany knows!\n\nText from – [http://www.linotype.com/43348/egyptian505-family.html](http://web.archive.org/web/20071112201047/http:/www.linotype.com/43348/egyptian505-family.html)  \n_André Gürtler created the typeface family Egyptian 505 in 1967, together with his lettering class at the Kunstgewerbeschule in Basel. In fact, the number “505” in the typeface family’s name refers to the school’s classroom number 505, where the work was done._\n\nEgyptian 505 is a slab serif style family; during the 19th Century, slab serif types were commonly referred to as “Egyptian”-style faces. Gürtler designed Egyptian 505 in the strain of Adrian Frutiger’s famous Egyptienne typeface; Gürtler and Frutiger worked together on many occasions during their careers.\n\nThe type family is well suited for many uses, including magazines, brochures, text composition, business cards, newspaper advertising, book jackets, slides, menus, slides, posters, manuals and catalogues.\n\nEgyptian 505 won the first Visual Graphics Corporation (VGC) type competition.\n\n"
    },
    {
      "time": " 1.Feb.2007 12.19pm",
      "content": "Dan,  \nIs there any particular reason that the $ sign seems so huge on the 505 face? Compared to the euro or any digit, the dollar jumps out at you. Maybe it was a subtle political statement :-)\n\nChrisL\n\n"
    },
    {
      "time": " 1.Feb.2007 12.43pm",
      "content": "Maybe Eben can ask him.\n\n"
    },
    {
      "time": " 1.Feb.2007 12.45pm",
      "content": "Actually, I think that the dollar sign looks just fine. It is the euro glyph next to it that feels to small, now that I think about it. Of course, while the dollar sign probably came from Gürtler and Team ’77, the euro symbol was added much, much later, and by someone else.\n\n"
    },
    {
      "time": " 2.Feb.2007 9.10am",
      "content": "Ta very much.\n\nMaybe i should just hit all you lot up for info in future - that is if you don’t mind.  \nBut perhaps that just being a little too lazy i think. Maybe i’ll start a type database site myself.\n\nAnyway thanks once again\n\nGraham\n\n"
    }
  ]
}
