{
  "id": "31068",
  "title": "Branding a town - in Armenia",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I've been asked to help a town with a logo and some other design work. The problem is that its in Armenia (its actually pro-bono work I am doing with my sister who is there in the Peace Corps). The name of the town is STEPANAVAN (Ստեփանավան in Armenian if that comes through)\n\nAnyways, the logo has to be in both English and Armenian, and the brochure/web site have to be in English, French and Armenian. The big challenge is that Armenia has its own unique alphabet that I have barely seen, no less actually have a grasp on. [It looks like this...](http://web.archive.org/web/20131018112020/http:/indoeuro.bizland.com/project/script/armen.gif)\n\nSo why am I posting? Well I need some help in selecting some good typefaces to start the logo. I have two main ideas for it:\n\n1) The Armenian alphabet is very vertical in its orientation and contains letters that are quite similar (even Armenians have a hard time reading it). So I was thinking that the english version should reflect that - Vertical lettering, similar letters (especially in the anavan section, which is repetitive anyways), perhaps with some vertical serifs (closest I have found to a solution is Modern)\n\n2) Reference their communist past. Unlike most former Soviet countries, Armenia was better off under communism. They suffered a massive earthquake in 1988 and have yet to recover. So soviet/communist references are acceptable. The town was named for a communist revolutionary. So if anyone has any suggestions for appropriate faces that have communist/constructivist references/qualities, I would appreciate it.\n\nAlso, has anyone dealt with a logo that is bi-lingual (especially with multiple alphabets)? How do I keep them balanced without being awkward (stepanavan is long enough already).\n\n",
  "author": "midbrain",
  "time": "1 Feb 2007 — 6:13am",
  "uid": "16520",
  "comments": [
    {
      "time": "1 Feb 2007 — 6:21am",
      "content": "[http://themicrofoundry.com/](http://web.archive.org/web/20131018112020/http:/themicrofoundry.com/ \"http://themicrofoundry.com/\")\n\nHrant is your man when it comes to Armenian type\n\nTim\n\n"
    },
    {
      "time": "1 Feb 2007 — 6:28am",
      "content": "[Miguel Sousa](http://web.archive.org/web/20131018112020/http:/typophile.com/wiki/Miguel%20Sousa) has also done some [Armenian](http://web.archive.org/web/20131018112020/http:/typophile.com/wiki/Armenian) type, which, if i remember correctly, has received good reviews.\n\n{edit}  \nin fact, it was his [Calouste](http://web.archive.org/web/20131018112020/http:/typophile.com/wiki/Calouste) family that received the TDC award. Check it out here: [http://www.tdc.org/news/2006Results/Calouste.html](http://web.archive.org/web/20131018112020/http:/www.tdc.org/news/2006Results/Calouste.html \"http://www.tdc.org/news/2006Results/Calouste.html\").\n\n"
    },
    {
      "time": "1 Feb 2007 — 7:17am",
      "content": "I guess I am less concerned with tracking down Armenian faces, than with getting faces in latin that are the right style.\n\n"
    },
    {
      "time": "1 Feb 2007 — 7:34am",
      "content": "but that's the thing, which Roman font is right depends on what Armenian font you're using and vice versa. Finding a typeface that has both alphabets designed to harmonize together is the best and easiest solution.\n\n"
    },
    {
      "time": "1 Feb 2007 — 8:17am",
      "content": "True, but expect that I will be modifying a roman font for use in Armenian. I also have zero budget for this thing, so using fonts that I already have would be best!\n\n"
    },
    {
      "time": "1 Feb 2007 — 8:21am",
      "content": "What actual purpose does this branding have? You have to be clear about that to choose your type well. Is it for tourism? Local pride? What?\n\n"
    },
    {
      "time": "1 Feb 2007 — 8:34am",
      "content": "It would seem that finding an appropriate Armenian type would be the best beginning. Appropriate for both locals and your non-local target audience.\n\nAnother starting point: Armenian type designers  \nManvel Shmavonyan & Henrik Mnatsankanyan (deceased)  \nTypes from both should be available.\n\nI've used some from the second, which one North American critic felt was \"too Soviet\". So this is a genuine issue.\n\n"
    },
    {
      "time": "1 Feb 2007 — 11:10am",
      "content": "Oh yeah, purpose - it's primarily for tourism. But of course, being Armenia, it's not targeted at the Disney Worldesque tourist, but rather the self guided adventure tourist.\n\nMy role is designing the logo, and providing guidance for a booklet, brochure, map and web site. The logo will also be on the information center.\n\nHere is what I have so far:\n\n ![](http://web.archive.org/web/20131018112020im_/http:/typophile.com/files/stepanavan_concept_3880.gif)\n\n"
    }
  ]
}
