{
  "id": "31073",
  "title": "Terminal Design New Website and Font Releases",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "We would like to announce that [Terminal Design](http://web.archive.org/web/20131014105459/http:/www.terminaldesign.com/) has launched its new website featuring a number of new font releases and updates to old favorites.\n\n[Tangent](http://web.archive.org/web/20131014105459/http:/www.terminaldesign.com/fonts/sets/?CID=10) A new geometric sans in eight weights with obliques and small caps.\n\n[Enclave](http://web.archive.org/web/20131014105459/http:/www.terminaldesign.com/fonts/sets/?CID=6) A contemporary condensed slab serif also in eight weights with small caps and lovely italics.\n\n[Now Playing](http://web.archive.org/web/20131014105459/http:/www.terminaldesign.com/fonts/sets/?CID=9) A marquee font designed for use on the new plasma screen marquee for the reopening of the Apollo Theater in Harlem.\n\n[ClearviewADA](http://web.archive.org/web/20131014105459/http:/www.terminaldesign.com/fonts/sets/?CID=4) A family of Clearview fonts that conform to the letterform specifications for signage outlined in the Americans with Disabilities Act legislation\n\n[ClearviewText](http://web.archive.org/web/20131014105459/http:/www.terminaldesign.com/fonts/sets/?CID=5) Is the OpenType update of our popular ClearviewOne family.\n\n[Giacomo 2.0](http://web.archive.org/web/20131014105459/http:/www.terminaldesign.com/fonts/sets/?CID=7) Is updated to include small caps and Cyrillic.\n\n[Rawlinson 2.0](http://web.archive.org/web/20131014105459/http:/www.terminaldesign.com/fonts/sets/?CID=8) Also updated to include small caps.\n\n",
  "author": ".00",
  "time": "1 Feb 2007 — 9:55am",
  "uid": "1947",
  "comments": [
    {
      "time": "1 Feb 2007 — 11:06am",
      "content": "Congratulations on the new site, it's really tops! Is Now Playing part of the Clearview family as well? It looks like it's related but perhaps its just that you always have to use the same clever tricks to make signage type very legible? I usually love your work but I must admit that Tangent is an exception. The agency I work at has already got Avenir and Verlag and it's hard to tell how yours is better. I wish your font previewer could set the type even bigger so I could really appreciate all the lovely details especially in Enclave! It would be nice to see the fonts in other colours as well but I understand that the programming for that must be really hard.\n\n"
    },
    {
      "time": "1 Feb 2007 — 12:46pm",
      "content": "I'll second the congratulations. I must be out of it as I haven't seen Enclave yet. Very beautiful little slab serif. I suppose my only wish would be for PDFs so I can really look at it.\n\n"
    },
    {
      "time": "1 Feb 2007 — 1:00pm",
      "content": "Except for a few magazine ads, this is the first time Enclave is being shown.\n\nNow Playing is its own design, not related to Clearview at all.\n\nTangent is different than the geometrics Nigella mentions, I have to think that what makes it better is that I did it.\n\nHow big should a type previewer set? If you navigate down to the individual font it will set to 60 pt.\n\nWe are forgoing PDF's for the moment, but are in the final stages of developing a nice print promo. If you would like to get one when it is ready sign up on the home page.\n\n"
    },
    {
      "time": "1 Feb 2007 — 1:14pm",
      "content": "Colour. Motion. Typetester.  \nDude!\n\n"
    },
    {
      "time": "1 Feb 2007 — 2:21pm",
      "content": "\" have to think that what makes it better is that I did it.\"\n\nnot really a good enough reason eh!\n\nMuzz\n\n"
    },
    {
      "time": "1 Feb 2007 — 2:40pm",
      "content": "Actually it is the only good reason to keep designing type.\n\n"
    },
    {
      "time": "1 Feb 2007 — 3:04pm",
      "content": "\"Actually it is the only good reason to keep designing type\"\n\nWorks for me! :-)\n\nWell done site James!\n\nChrisL\n\n"
    },
    {
      "time": "1 Feb 2007 — 3:09pm",
      "content": "Congradulations James!\n\n"
    },
    {
      "time": "2 Feb 2007 — 7:26am",
      "content": "\"Tangent is different than the geometrics Nigella mentions, I have to think that what makes it better is that I did it.\"\n\nSo much for the famous humility of type designers that I always hear about! Maybe that doesn't apply to yanks. I didn't realize you considered yourself such a better designer than Zapf or Hoeffler! This attitude is a bit of a turnoff really.\n\n"
    },
    {
      "time": "2 Feb 2007 — 7:36am",
      "content": "Congratulations, James! Great new site. I'm excited to see you're starting to add Cyrillics to some type families. Keep up the good work!\n\n"
    },
    {
      "time": "2 Feb 2007 — 8:10am",
      "content": "Oh lighten up Nigella. Clearly you have never been to Brooklyn.\n\n"
    },
    {
      "time": "2 Feb 2007 — 2:08pm",
      "content": "Nigella, James is a great guy actually. And I suspect his comments merely amounted to healthy self respect as far as he was concerned. I know cultural differences can be hard to grip in general, we all fumble there I think. And all the more so in email and by text.\n\nAlso, think of it this way: if you don't ever hope in some corner of your heart to be better than your hero, how can you ever try? Perhaps you'll fail - yes. But giving it your best shot is important. And if some us carry that sentiment on our sleeve & others don't then so bit it. I am not sure there is much harm in being forthright. And lastly this myth of self effacement in type designers is just that. Sure Dwiggins was a sweetie from what we can tell. But not everybody was. Some designers have been pretty severe! And I would not like to be without their designs I can tell you!\n\nI'll be signing up for that promo.\n\n"
    },
    {
      "time": "2 Feb 2007 — 2:31pm",
      "content": "Congrats James. Nice redo. Gotta admit I miss the PDFs though, that was one of my favorite features of your old site.\n\nAs to this comment: _I have to think that what makes it better is that I did it._\n\nJames didn't mean it the way some of you may think. If a type designer (or any creative person) doesn't on some level think they're doing something with their own personal touch...then really what is the point? It wasn't a statement of being better than anyone else.\n\nI'm also a former Brooklynite so perhaps I understand the language. :)\n\n"
    },
    {
      "time": "2 Feb 2007 — 6:54pm",
      "content": "The PDFs will be back. I'm just trying to figure out the best way of managing them.\n\nI think the promo we have planned will be interesting. Not the normal sort of type catalog, but a sort of cookbook. For lack of a better term.\n\nNigella, both Eben and Terry have got the point.\n\nAlso, in the future maybe it would be better to ask how a design is different, or in what way appropriate, rather than which is better.\n\nThank you all for your comments.\n\n"
    },
    {
      "time": "3 Feb 2007 — 7:26am",
      "content": "Dear Terminal Design,\n\nI've just noticed the website. Alot of very interesting things.\n\nI was interested in your versions of PERPETUA and GILL SANS. Several years ago I was approached about reviving the same faces for a large French governmental agency. Following standard protocol, I approached Monotype for their approval. They wanted a large sum of money for a license even though I wasn't going to start with their outlines. That is their right of course, but the agency could not afford the license plus the custom development fees.&nbsp;Did you find such a problem? Or do Conde Nast deal with this problem? Will these fonts eventually be released to the general public? Why did Conde Nast commision another hairline Gill Sans when they had commisioned one already for British Vogue? Si Neuhouse must have more sense than money! And yes, I too thought it was odd that a French organization wanted revivals of classic British typefaces!\n\nI also enjoyed your comments about your clients for Miller. Is this the same agency that I am thinking of? I did some work for them many years ago with similar results. I must applaud your insult of them!&nbsp;I wish I had so many clients and enough money to be able to insult them like you have. Brooklyn attitude indeed! Bravo!\n\nDid we meet at the 1989 AIGA conference in San Antonio? I met a fellow type designer from Brooklyn at that conference but my memory has faded. Old age strikes again!\n\nSincerely,  \nRandolph T. Burke\n\n"
    },
    {
      "time": "3 Feb 2007 — 8:06am",
      "content": "Randolph,\n\nConde Nast handles all of these sort of things. The British and the American versions of Vogue are completely separate entities and do not share resources, as far as I have been told. The fonts are the property of Conde Nast and will never be released to the general public.\n\nThe agency and the art directors are to remain nameless. The ADs are all off doing other things these days. I didn't say anything on my website that I did not say to them when the logo was published.\n\nUnfortunately this poaching of developmental drawings goes on all the time. A colleague of mine has a clause in his contracts that forbids this sort of thing. I am thinking of incorporating such a clause in my future agreements.\n\nI have never been to an AIGA conference so you must have me confused with another person.\n\nJames\n\n"
    },
    {
      "time": "4 Feb 2007 — 2:29pm",
      "content": "Dear James\n\nThank you for this information. Did Monotype supply you with any digital data or even better, drawings? Or did you have a chance to examine drawings at St Bride or the Malin punches at Cambridge University Press. Conde Nast must have paid a large amount of money to Monotype for the priviledge. Did you have a chance to work with Robin Nicholas? I ve heard he is a very friendly gentleman. Its a shame your Perpetua will not be released. Perhaps you can post a PDF for everyone to see your fine work.\n\nSincerely,  \nRandolph T. Burke\n\n"
    },
    {
      "time": "4 Feb 2007 — 4:15pm",
      "content": "Monotype supplied no data and I looked at no drawings at St Brides. While the work is modeled on Perpetua it is not \"Perpetua\". It was done in about three or four weeks and I used some old reference I had here at the studio. The art director didn't even know what they were asking for was called Perpetua, since they were using a Bitstream version of the design (with a different name)for their text composition.  \nMy agreements with Conde Nast limit me from providing many samples. The ones on my website will have to do. I don't think the typographic world will miss not having access to it.\n\nJames\n\n"
    },
    {
      "time": "5 Feb 2007 — 1:43pm",
      "content": "'Also, in the future maybe it would be better to ask how a design is different, or in what way appropriate, rather than which is better.'\n\nClearly you haven't worked in a design bureau for quite some time. The pennypinchers upstairs don't care about 'different' when I ask them to spend over 200 quid. They want to know why it's better!! Surely you understand what I mean. It's not important anyway because I don't like the family very much.\n\nThanks for previewing in even larger sizes! This will do wonders for talking my mates at work into Enclave for our next project! Now I can show off all the little details. I didn't realize it had rounded corners and this makes me like it even more because they're so trendy right now! Come to think of it I'd love a rounded Clearview too.\n\nCheers!\n\n"
    },
    {
      "time": "5 Feb 2007 — 5:23pm",
      "content": "Congratulations James. Lovely work.\n\n_The art director didn’t even know what they were asking for was called Perpetua..._ – sounds familiar!\n\n"
    }
  ]
}
