{
  "id": "31096",
  "title": "Kerning Help / Advice",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Just wondering if you’d share your thoughts on the kerning of this. I feel like that no matter what I do to the word “Karma” it looks ’off’. My wife says I should connect or bridge the r and m, but I’m not ready to do that yet.\n\n| Attachment | Size |\n| --- | --- |\n| [kern.gif](http://web.archive.org/web/20090909163403/http:/typophile.com/files/kern.gif) | 3.73 KB |\n\n",
  "author": "<a href=\"/web/20090909163403/http://www.typophile.com/user/5684\" title=\"View user profile.\">wyndom</a>",
  "time": "<br>",
  "uid": "5684",
  "comments": [
    {
      "time": " 2.Feb.2007 10.18am",
      "content": "You have space the whole around the pair. I’d try leaving the KA pair alone and loosening up the rest to appear more balanced. Did you make the small caps a little smaller?\n\n"
    },
    {
      "time": " 2.Feb.2007 11.13am",
      "content": "thank you, I’ll give that a shot. The small caps were not modified at all.\n\n"
    },
    {
      "time": " 2.Feb.2007 1.02pm",
      "content": " ![](http://web.archive.org/web/20090909163403im_/http:/www.typophile.com/files/kern_4496.gif)\n  \nThis feels a little better, I would def. appreciate any additional comments/feedback\n"
    },
    {
      "time": " 3.Feb.2007 2.14am",
      "content": "The DH could be a gnat’s tighter I think.\n\nTim\n\n"
    },
    {
      "time": " 3.Feb.2007 11.58am",
      "content": "Speaking as the new kid, this is more a question than a critique - I’m looking at “Karma,” and noticing there’s a pretty distinct difference between AR/MA and RM. Would you say that’s good kerning? This is an area of weakness for me, and I seek to learn, sensei.\n\n"
    },
    {
      "time": " 4.Feb.2007 2.31am",
      "content": "The aim of kerning is to create a similar area between characters, but not at the expense of making it difficult to read. It looks good to me.\n\nTim\n\n"
    },
    {
      "time": " 4.Feb.2007 8.40pm",
      "content": "Now see there? I learned something. I feel better about myself. Thanks, Tim!\n\n"
    },
    {
      "time": " 6.Feb.2007 2.18pm",
      "content": "I don’t have as much a problem with the kerning as the weight differences of the B and K with the other characters. They feel heavier and might be creating a color shift you don’t like. Over all everything is looser than I would like, buts thats me.\n\n"
    }
  ]
}
