{
  "id": "31093",
  "title": "New face up for the crit.",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hello Typophiles,\n\nThis is a minimalistic typeface am working at the moment.  \nIt would be really helpful if you can drop me some valuable feedback on the same.\n\nThank you so much  \nSatya\\_  \n\\\n\n ![](http://web.archive.org/web/20150419054040im_/http:/typophile.com/files/target%20france_ty_4807.jpg)\n  \n\n ![](http://web.archive.org/web/20150419054040im_/http:/typophile.com/files/Target%20France_4853_4048_4811.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [Target France.pdf](http://web.archive.org/web/20150419054040/http:/typophile.com/files/Target%20France.pdf) | 696.77 KB |\n| [TF\\_SN RAJPUROHIT.jpg](http://web.archive.org/web/20150419054040/http:/typophile.com/files/TF_SN%20RAJPUROHIT.jpg) | 109.9 KB |\n\n",
  "author": "satya",
  "time": "2 Feb 2007 — 8:39am",
  "uid": "14032",
  "comments": [
    {
      "time": "2 Feb 2007 — 8:54am",
      "content": "Are you intending for it to be an 'omni' alphabet? Because at the moment, you are using for example, the 't' in it's uppercase form, which makes it a bit less legible; the t bears resemblance to the 'r' right now. I also think the cutting of the 'u' doesn't really serve a purpose, while the cut on the 'n' is nice.\n\nNevertheless, I think it's an interesting display font, especially if you add some weights to it. I really like the consistence in curves in 'a', 'e', 'n' and 'g'. I really like the quirkyness of letters like the bdqp, and the 'v' is amazing.\n\nedit; oh, and those numerals are very appealing!\n\n"
    },
    {
      "time": "2 Feb 2007 — 10:10am",
      "content": "it's a good face to show that you read words and not letters since you might not be able to understand the individual letters sometimes but in words it's easy to read.\n\n"
    },
    {
      "time": "2 Feb 2007 — 10:40am",
      "content": "I agree with Sebastiaan's comment on the ‘t'. Most of the face is readable despite the overly stylized form, but the ‘t' feels like it needs an ascender. In your title, you seem to have an uppercase version? While that almost comes across as an ‘f', I think that's a good place to start.\n\nOn an æsthetic note, i love it. Particularly drawn to the ‘f', ‘g', ‘k' and ‘v'.\n\n"
    },
    {
      "time": "2 Feb 2007 — 12:49pm",
      "content": "This is a keeper. It will need some pushing but keep the guts in it. More later!\n\n ![](http://web.archive.org/web/20150419054040im_/http:/typophile.com/files/kungfu_1_4370.jpg)\n\n"
    }
  ]
}
