{
  "id": "3110",
  "title": "Font Suggestions",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "What would be some fitting font choices for a wine bottle?\n\n",
  "author": "zolli",
  "time": "12 Feb 2004 — 7:02pm",
  "uid": "3035",
  "comments": [
    {
      "time": "12 Feb 2004 — 7:24pm",
      "content": "What kind of wine?   \nBut in general I find Octavian very suitable, especially the italic.   \n   \nhhp\n\n"
    },
    {
      "time": "13 Feb 2004 — 4:14am",
      "content": "What is the name of the wine or winery. There is a South American wine named Gato. Blanco and Negro, so the main theme is a Cat. So type doesn't necessarly drive the theme of a label.\n\n"
    },
    {
      "time": "12 Mar 2004 — 4:06pm",
      "content": "I'd also add that it would worth some time to look elsewhere for inspiration. You might be surprised at what you would find at, say, an auto parts store that could inform type selection on a wine bottle.\n\n"
    },
    {
      "time": "21 Apr 2004 — 5:55pm",
      "content": "I recently bought a bottle of Brothers In Arms No. 6 [[http://brothersinarms.com.au/wine/Number6/index.asp](http://web.archive.org/web/20131016200154/http:/brothersinarms.com.au/wine/Number6/index.asp)] and I'd say my trigger was the unusual use of typography on the label. I've also found myself buying other unfamiliar wines because of this.   \n   \nbtw - the No. 6 was deelish...\n\n"
    },
    {
      "time": "27 Apr 2004 — 10:32am",
      "content": "Just my case!   \nI bought a bottle by the winemaker Telmo Rodr\n\n"
    },
    {
      "time": "27 Apr 2004 — 11:14am",
      "content": "They should've just used a Goudy \"g\" - he made them horny.   \nAnd wassup with that Helvetica at the bottom?!   \n   \nhhp\n\n"
    },
    {
      "time": "28 Apr 2004 — 7:40am",
      "content": "Well, i think is a nice logo anyway. And the fact that it is a redrawn letter makes you pay attention to the detail. I'm sure nobody would have thought that a Goudy \"g\" was used because of the DO of the wine.   \nRespect to the helv\n\n"
    }
  ]
}
