{
  "id": "31101",
  "title": "Old-school type \"piracy\"",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello font-fellows,\n\nLong time no visit. Hope everybody is well.\n\nI'm in the process of writing an academic paper about software piracy and I have come to a roadblock. I need your expertise.\n\nI'm fairly certain that at some point in the past, while reading about the history of type design I have come across examples of typefaces that were \"pirated\" centuries ago by competing printers. For example, Caslon may have cut a typeface and his letters were then blatantly counterfeited by those who could get their hands on a specimen. I know that this happened, but I need to find some sources that discuss it in more detail. Does anybody know of any sources that I could reference for this topic?\n\nMy overall intent is to show that \"software piracy\" is by no means a new thing, and that unscrupulous folks have been stealing more than tangible property for centuries.\n\nAny help would be greatly appreciated. Thank you so much!\n\n- Josh Korwin  \n [http://www.threestepsahead.com/](http://web.archive.org/web/20150416074538/http:/www.threestepsahead.com/ \"http://www.threestepsahead.com/\")\n\n",
  "author": "jaykay109",
  "time": "2 Feb 2007 — 11:35am",
  "uid": "11474",
  "comments": [
    {
      "time": "2 Feb 2007 — 11:46am",
      "content": "Hi:\n\nhahaha.... (not laughing at you) umm there is this one typophiler that has very very strong feelings about anybody making even the remotest 'copy' of someone else's work... This person has a website too. Search for 'Bitstream forgeries' in google and you should find the page... i want to say sanskrit dot something.\n\nThat would be a modern source for 'information'.\n\nMikey\n\n"
    },
    {
      "time": "2 Feb 2007 — 12:07pm",
      "content": "_Boy, cheap copies of already exitsing typefaces… in 1710! Some things really do seem to stay the same!_  \n [http://www.typeoff.de/?p=120](http://web.archive.org/web/20150416074538/http:/www.typeoff.de/?p=120 \"http://www.typeoff.de/?p=120\")\n\n"
    },
    {
      "time": "2 Feb 2007 — 12:09pm",
      "content": "You read about it in the Clarendon thread. It was an image posted by James Mosley. Perhaps ping him via that thread, James might join us over here too.\n\n"
    },
    {
      "time": "2 Feb 2007 — 12:10pm",
      "content": "Benjamin Franklin made his living via intellectual property theft. I know that he used Caslon's types in his presses, so if anyone was knocking of Caslon's types, it was Franklin.\n\n"
    },
    {
      "time": "2 Feb 2007 — 1:04pm",
      "content": "\"My overall intent is to show that “software piracy” is by no means a new thing\"\n\nThe concept of software piracty required two key elements:\n\n- the invention of software  \n - the writing of copyright laws.\n\nSo, in the grand scheme of things, it actually is a relatively new concept.\n\n\"Benjamin Franklin made his living via intellectual property theft.\"\n\nMost companies do, really. A few innovate. Many copy. 'tis the way it's always been and always likely will be. (and that's not to say that is a bad or good thing, either)\n\n"
    },
    {
      "time": "2 Feb 2007 — 1:35pm",
      "content": "\\>Benjamin Franklin made his living via intellectual property theft.\n\nJames, how do you know that Franklin's Caslon types or matrices weren't bought legitimately from Caslon?\n\nI've never heard this allegation.\n\n"
    },
    {
      "time": "2 Feb 2007 — 1:56pm",
      "content": "aluminum,\n\nHere I use \"software\" not in the computerized sense, but in the sense of information that can be removed and duplicated outside of the boundaries of its tangible medium. Fonts, for example, are the computerized version of tangible punches, but also the computerized version of the letterforms that those punches were cut to embody. For my purposes, the typeface design is the software, and the punches used to set the printed page, along with the press, are the hardware. In that sense, things haven't really changed that much over the course of a few centuries; it's just easier to make perfect or near-perfect copies of original works.\n\nThink about it in the Platonic sense; I think of \"software\" as the \"pure forms.\" One can break into a letterpress house and steal their entire heavy case of type, or one can lift the designs through diligent counterfeiting.\n\nWith regards to copyright laws, what would you consider to be \"relatively new?\" Even the idea of \"relatively new\" is relative. (Har har.) To be exact, \"copyright\" laws and the doctrines that inspired them have existed for centuries. Read more here:\n\n[http://en.wikipedia.org/wiki/History\\_of\\_copyright\\_law](http://web.archive.org/web/20150416074538/http:/en.wikipedia.org/wiki/History_of_copyright_law \"http://en.wikipedia.org/wiki/History\\_of\\_copyright\\_law\")\n\n— Josh\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "2 Feb 2007 — 2:05pm",
      "content": "I recall a book on Fournier I read at Reading that has some interesting stuff on this - much of the promotional material made by type founders would extol the virtues of their types over their competitors, who were often portrayed as imitators.\n\n"
    },
    {
      "time": "2 Feb 2007 — 2:55pm",
      "content": "_A few innovate. Many copy. ‘tis the way it’s always been and always likely will be._\n\nThat obscures many important distinctions.  \nReferral must be made to John Downer's excellent classification system, [Call It What It Is.](http://web.archive.org/web/20150416074538/http:/www.emigre.com/Editorial.php?sect=2&id=1)\n\n"
    },
    {
      "time": "2 Feb 2007 — 3:35pm",
      "content": "\"Here I use “software” not in the computerized sense, but in the sense of information that can be removed and duplicated outside of the boundaries of its tangible medium. Fonts, for example, are the computerized version of tangible punches, but also the computerized version of the letterforms that those punches were cut to embody.\"\n\nSimply put, you're talking about intellectual property.\n\nAnd, yes, copyright laws have been around for some time. However, the creation, sharing, borrowing and stealing of ideas (I'm guessing) has been around since the beginning of human existance. ;o)\n\n"
    },
    {
      "time": "2 Feb 2007 — 3:58pm",
      "content": "<cite>James, how do you know that Franklin’s Caslon types or matrices weren’t bought legitimately from Caslon?</cite>\n\nI’ve never heard this allegation.\n\nI didn't say that I know he did, I suggested that it's likely based on Franklin's other activities. After the founding of the United States, Franklin made much of his money by reprinting European books, which had no copyright protection in the USA at that time. So if anyone was ripping off Caslon's ideas, Ben Franklin seems like a very likely candidate.\n\n"
    },
    {
      "time": "2 Feb 2007 — 4:02pm",
      "content": "JayKay, your web site and your MyFonts information says that Goudy designed 'Goudy Fancy' in the 1970s. Goudy died in 1947. So with all due respect, I get the feeling that your first step in writing your paper would to spend some more time with type history books.\n\n"
    },
    {
      "time": "2 Feb 2007 — 5:07pm",
      "content": "James\n\nThe thing about Franklin is not accurate. The American printer Christopher Sower began importing matrices from the Luther foundry in 1770 and he established the first foundry here in 1772.\n\nCaslon was the more popular of British typefaces at the time, thus it appeared in most American publications. It probably survived, through successive recuttings, longer in the States than in England, until the revival in mid 19th century.\n\nWhile foundries certainly did copy the popular typefaces of other foundries this was in no way \"pure theft\" as there was no way to get accurate copy prior to the development of photography and the camera.\n\nGerald  \n [http://BielerPress.blogspot.com](http://web.archive.org/web/20150416074538/http:/bielerpress.blogspot.com/ \"http://BielerPress.blogspot.com\")\n\n"
    },
    {
      "time": "2 Feb 2007 — 6:46pm",
      "content": "Monsieur Berkson,\n\nGood point! Hrm. I honestly do not know where I got that information, but I promise that it did not come out of my rear end. Googling \"Goudy Fancy\" does not give many tasty results, though. So, besides your skill in criticizing my apparent ignorance, would you (or anybody more knowledgeable) be able to provide me with _accurate_ information about the original \"Goudy Fancy?\" With that, I'll be able to update my site and my MyFonts profile to match. The last thing I would like to do is to disseminate incorrect information, so I'd appreciate any help I can get.\n\nAnd as an aside, the paper itself isn't primarily concerned with type; I'm using the concept of design stealing to illustrate a larger point.\n\n— Josh\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "2 Feb 2007 — 6:48pm",
      "content": "aluminum,\n\nTrue, and true.\n\nAre we agreeing or disagreeing?\n\n— Josh\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "2 Feb 2007 — 7:25pm",
      "content": "_I suggested that it’s likely based on Franklin’s other activities_\n\nThat's not a very responsible thing to be saying. It's what dictionaries and lawyers call an **allegation**. Now, if you back yourself with some sort of information from reliable sources, then you would have something known as a **fact**.\n\nThe quoted text below is taken from _Benjamin Franklin, An American Life_, by Walter Isaacson (2003, Simon & Schuster):\n\n\"Because there was no foundry in America for casting type, Franklin contrived one of his own by using Keimer's letters [Keimer was the printer he worked for at the time] to make lead molds. He thus became the first person in America to manufacture type.\"\n\nLater, when Franklin decides to leave Keimer's shop and set up one of his own with one of Keimer's apprentices, Hugh Meredith, Meredith's father \"agreed to provide the funding necessary (200 pounds) for the two young men to set up a partnership... They sent to London for equipment\\*, which arrived early in 1728...\"\n\n\"\\*The fonts that Franklin ordered were those created in the early 1720s by the famed London type-maker William Caslon...\"\n\n"
    },
    {
      "time": "2 Feb 2007 — 7:33pm",
      "content": "Hi Josh.\n\nOnline, you could look here:  \n [http://learning.north.londonmet.ac.uk/epoc/typhis.htm](http://web.archive.org/web/20150416074538/http:/learning.north.londonmet.ac.uk/epoc/typhis.htm \"http://learning.north.londonmet.ac.uk/epoc/typhis.htm\")\n\nJust search for the word \"piracy\".\n\n"
    },
    {
      "time": "2 Feb 2007 — 8:46pm",
      "content": "Forget google, wikipedia etc. Do you have access to an academic library?\n\n"
    },
    {
      "time": "3 Feb 2007 — 12:43am",
      "content": "By the way, thanks VERY much to everybody providing specific resources, I really appreciate it, and once I've had time to go through everything, I'll probably be posting with more questions or commentary.\n\ntypequake,\n\nYes, but not a design-related library at the university I attend. Do you have a specific resource in mind? I'm not ready to dismiss the Internet altogether, because for me, it's always the best and quickest place to start a search, at least.\n\n— Josh\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "3 Feb 2007 — 7:39am",
      "content": "Josh, I should have pointed out the mistake in your history of Goudy Fancy privately via IM. My apologies.\n\nMy point, in any case, was that the internet is quite poor when it comes to type history.\n\nAfter you read some surveys of type history in books, you can find useful, though limited, information on the internet. However the internet will not give you a good basic framework. I would start with Bringhurst's historical chapter in his Elements of Typographic Style, and then you can follow up with others.\n\nAs to Goudy Fancy itself, if you put in that phrase as key word in MyFonts.com you will find another digital version of it which gives a history of it in the photo type era. I don't know if it's correct, but it's plausible, and you could follow up on her references.\n\nOn your thesis: \"My overall intent is to show that “software piracy” is by no means a new thing, and that unscrupulous folks have been stealing more than tangible property for centuries.\" As Gerald indicates above, this viewpoint is a bit off target.\n\nIn the days of punch cutting every glyph by hand, exact copies were not really practical possibilities. During this era--till the invention of the pantographic punch cutter in 1880s--people did take design ideas from others, but didn't do exact copies. However, it is important to note that ideas are not copyrightable.\n\nHere you get to the difficulty of your topic. When does inspiration from the ideas in another design turn into unethical or illegal theft? This is not simple to determine, which is what makes protecting designs of all kinds difficult.\n\nSome cases are pretty clear on either end. For example the South Portico of the White House was designed by Thomas Jefferson, inspired by a similar portico in a building in Paris (where he had been posted). I believe he credited the source, and in any case it was one element in the design, and the effect was quite different. And there is no law against copying one element of a building in another, so far as I know. So there is no problem in what Jefferson did.\n\nOn the other hand, some people just do an electronic copy of a digital font and resell them without permission or benefit to the original designer or foundery. That is a clear case of piracy, and is so recognized in law.\n\nYou can find some interesting information on the internet about the history of copyright law that will give you further insight on this issue.\n\nBut basically the story is that literal font copying didn't happen until about 1890, with the use of photographic enlargements and the pantographic punch cutter. I don't know the history of the law and practices on this issue, but getting it will require a lot of library work or talking to knowledgeable people or both. Copying of designs became still easier in the photo type era, and a snap in the digital era.\n\nIn sum, both the question of what has happened and what was ethical in each era is not so easy to find out and say with precision. And the internet will not give you the answers.\n\n"
    },
    {
      "time": "3 Feb 2007 — 10:18am",
      "content": "_untill the invention of the pantographic punch cutter in 1880s—people did take design ideas from others, but didn’t do exact copies._\n\nThe electrotype process was a bit earlier.\n\n"
    },
    {
      "time": "3 Feb 2007 — 10:29am",
      "content": "NOW we're getting somewhere. Thank you for the thoughtful insight, Mr. Berkson.\n\nThat's an excellent point. I suppose if there really was direct copying of ideas in the days before technology were strong enough to make two copies indistinguishable, it would be difficult to prove that an exact duplication had taken place, and even the slightest variation would be something of an \"evolution\" of the design.\n\nPerhaps then typography isn't really the point. I'd probably have more luck discussing the direct duplication of the _content_ of books; even though the typesetting may have differed, there was definite bootlegging of books at the time.\n\nAs a side note, I do have quite a few books on type (and I've read through _The Elements_ a few times, but I don't think I've come across any mention of Goudy Fancy in any volume. I only originally learned of the typeface, and subsequently digitized it, after a scan of an old Letraset catalogue was posted on a newsgroup a few years ago. I'll keep searching, but if anyone does have any specific information about it, that'd be grand.\n\nThanks again to all!\n\n—Josh\n\n—æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ——æ—  \n**\"Wishers and woulders be small householders.\"**  \n_—Wynkyn de Worde_\n\n"
    },
    {
      "time": "3 Feb 2007 — 10:31am",
      "content": "\\>a bit earlier\n\nThanks for the correction.\n\nNow I remember that in Mac McGrew's history of Caslon (In American Metal Typefaces of the 20th Century), he says that a Laurence Johnson in 1858 arranged with the Caslon foundry to reproduce Caslon, and that this may have been done by electroplating.\n\nBut this seems to have been paid for, or had some royalty arrangement. Were there unauthorized copies of typefaces done in a similar way in the mid-19th century?\n\nedit: Just saw Joshua's post. The history of protection of intellectual property is an important and ongoing story. An inital search in the internet says that the current idea of copyright goes back to 1710, the \"statue of Anne\", and that the whole history evolved out of the existence of the printing press, which allowed exact copies of a text.\n\n"
    },
    {
      "time": "3 Feb 2007 — 12:57pm",
      "content": "Bill, the US government institutionalized \"software\" piracy from the get-go.  \nIt ignored European copyright, and this acted as a form of subsidy to local content producers.  \nSo when Morris refused Phinney permission to reproduce the Golden Type, he went ahead anyway, naming it \"Jenson Oldstyle\".\n\nThere were major changes in British copyright in the late 18th century, going from perpetual to a time-limit, which boosted the UK book industry, opening up the reprinting of cheap classics. That's in St Clair's brilliant \"The Reading Nation in the Romantic Period\".\n\n"
    },
    {
      "time": "3 Feb 2007 — 7:41pm",
      "content": "Josh,\n\nIf your topic is about what you call software \"piracy\", then I recommend a good book on the history of intellectual property rights, which you should be able to find in a law library.\n\n"
    },
    {
      "time": "3 Feb 2007 — 8:57pm",
      "content": "Date of first electrotype matrix: 1845.  \nAs well as making piracy extremely easy, it made it much easier to make detailed type, by working indirectly in softer metal.\n\n"
    },
    {
      "time": "6 Feb 2007 — 5:12am",
      "content": "LaPolice is the first revival of an exceptional font produced in exceptional circumstances. Forget copyrights, trademarks: LaPolice is he first hacking of importance in the history of typography! It is the immediate copy of one of the largest typography innovations of the celebrated Romain du Roi created in 1705, which was used as the typeface for the court of Louis the XIV. What did the police do? Nothing.\n\nThe creator of this type, Mathieu Malherbe Des Portes, the sole hallmark punch cutter of all of Paris proper, himself had trained Phillippe Granjean, the engraver of the font Romain du Roi. His version carries all of the unique characteristics of the Romain du Roi, such as the new horizontal serifs, sometimes doubled and the secant L. LaPolice is rounder and more dynamic than its original model - it is also more modern and 'organic'. LaPolice is named after a document named \"Traité de la Police\".\n\nyou can have a look at this typeface on bpfoundry.com  \na interpretation of Romain du Roi design by Ian Party will be release on bpfoundry in April 07\n\n"
    },
    {
      "time": "6 Feb 2007 — 12:25pm",
      "content": "Based upon what you've said, perhaps Claude Garamond should be tried for stealing Antoine Augereau's roman. ;^) Seriously, interesting information.\n\n"
    },
    {
      "time": "6 Feb 2007 — 3:45pm",
      "content": "I m not sur that we can compare Antoine Augereau and Claude Garamond with Phillippe Granjean and Malherbe Des Portes. The \"Garamond\" style was \"creat\" by different engraver in 1530 in Paris (maybe Simon de Colines and Augereau) Guillaume II Le Bé (1604) (son of Guillaume Le Bé who was the associate of Claude Garamond since 1550) talked about this in two different text. When Garmond creat his first typeface in 1540 he was only inspired by the style of the period, the pupils follow the steps of his (dead) master. The \"Romain du Roi\" is a custom typeface it had shapes who were supposed to be private for the \"Imprimerie Royal\" like the secant l, it was like a trademark, Malherbe Des Portes used in his typeface a lot of those shapes. We don t know why the \"Imprimerie Royal\" said nothing... it s even more strange when we know that at the end of the 18 century, the director of the \"Imprimerie Royal\" made a lawsuit to Didot typefoundry because they used the horizontal serif, he said that they copy the trademark of the French kingdom's typeface... Didot won the lawsuit...\n\n"
    }
  ]
}
