{
  "id": "31113",
  "title": "LEET speak: 7|-|3 [,]|\\_|1(|",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": " **LEET**  \n7|-|3 [,]|\\_|1(| \\> |3|20\\/\\/|\\| |=0 \\< \\> ]|\\_|/\\/\\|?5 0\\/3|2 7|-|3 |\\_42`/ [)09.\n\n**Translation?**\n\n**The** 7|-|3  \n**quick** [,]|\\_|1(| \\>  \n**brown** |3|20\\/\\/|\\|  \n**fox** |=0 \\< \\>  \n**jumped** ]|\\_|/\\/\\|?5  \n**over** 0\\/3|2  \n**the** 7|-|3  \n**lazy** |\\_42`/  \n**dog.** [)09.\n\n[Leet](http://web.archive.org/web/20140722050315/http:/en.wikipedia.org/wiki/Leet) entry at Wikipedia.\n\nIs this the sickest, most disgusting aspect of the internet generation?\n\n",
  "author": "Dan Gayle",
  "time": "2 Feb 2007 — 5:33pm",
  "uid": "12948",
  "comments": [
    {
      "time": "2 Feb 2007 — 6:03pm",
      "content": "Do you know anything about the parents ?  \n_l o l_\n\n"
    },
    {
      "time": "2 Feb 2007 — 6:46pm",
      "content": "Dude, you should see what the scribal generations did to the Bible.  \nCan't be bothered to write out \"domini\"? -- just do dñi.  \nEtc., etc.\n\n"
    },
    {
      "time": "2 Feb 2007 — 7:02pm",
      "content": "I don't understand what's so sick and disgusting about this, unless you fear that it will one day replace ALL writing.\n\nWhat about rebuses, or pictograms, or ideograms? Have you ever seen those charts that show the development of Western characters like A, which starts with the drawing of an ox's head and gradually becomes more triangular and abstracted? What about pig latin, or slang?\n\nC U L8ter. ;-)\n\n"
    },
    {
      "time": "2 Feb 2007 — 7:06pm",
      "content": "Typing like that is actually quite old. Very 1992. ;)  \nAnd it was only done by semi-toughlooking .. retards.\n\n"
    },
    {
      "time": "2 Feb 2007 — 7:22pm",
      "content": "WTF is that all about?  \nStrike 2 for me being clueless in the 21 Century.\n\nChrisL\n\nPS: sometimes I get spam that looks like that. Are you saying it isn't random crap, it means something?\n\n"
    },
    {
      "time": "2 Feb 2007 — 7:23pm",
      "content": "<cite>Dude, you should see what the scribal generations did to the Bible.<br>\nCan’t be bothered to write out “domini”? — just do dñi.</cite>\n\nHow about !?&  \nOur common punctuation came out of the same scribal laziness.\n\n<cite>I don’t understand what’s so sick and disgusting about this, unless you fear that it will one day replace ALL writing.</cite>\n\nI'm sure it never will, but LEET, as well as SMS texting, has started to influence communication outside of the gaming community. Dropping common grammar and punctuation is an early precurser to this kind of writing. Remember MissGiggles getting vehemently abused for that?\n\nI'm opposed to it on a formal level, I suppose. Our educational systems have already gone backrupt since I was in primary school, and probably much before that. People understand best what they see or use most, and vice-versa.\n\n"
    },
    {
      "time": "2 Feb 2007 — 9:20pm",
      "content": " ![](http://web.archive.org/web/20140722050315im_/http:/typophile.com/files/30_3625.jpg)\n\nsometimes it's awesome\n\n"
    },
    {
      "time": "3 Feb 2007 — 10:01am",
      "content": "_LEET, as well as SMS texting, has started to influence communication outside of the gaming community. Dropping common grammar and punctuation is an early precurser to this kind of writing. Remember MissGiggles getting vehemently abused for that?_\n\nBad grammar and punctuation have been around for a long, long time. Can't blame computer geeks for that. That is quite different from playfully replacing certain letters with numbers, which was my point in mentioning rebuses and the like. As for giggles, she did not get flak only on account of her poor grammar -- she received other criticisms too, which she chose to ignore in her replies.\n\n"
    },
    {
      "time": "3 Feb 2007 — 10:14am",
      "content": "Apart from Faz, Typophilers have to contend with the occasionally impenetrable prose of Enneson, Berlow, Aziz, etc. The more the merrier, I say, bring it on!\n\n"
    },
    {
      "time": "3 Feb 2007 — 11:15am",
      "content": "<cite> Apart from Faz, Typophilers have to contend with the occasionally impenetrable prose of Enneson, Berlow, Aziz, etc. The more the merrier, I say, bring it on! </cite>\n\nBang on!\n\n"
    },
    {
      "time": "3 Feb 2007 — 1:06pm",
      "content": "And not to forget the Muzzer's charming colloquialisms, which no doubt lead to quite a few puzzled brows. [Glossary,](http://web.archive.org/web/20140722050315/http:/www.koalanet.com.au/australian-slang.html) dude?!\n\n"
    },
    {
      "time": "3 Feb 2007 — 1:41pm",
      "content": "Muzzer's posts are by far my favorites, not only for the enjoyable downunder expressions but for the straight-at-you answers.\n\nChrisL\n\n"
    },
    {
      "time": "3 Feb 2007 — 1:47pm",
      "content": "I suppose that there's always a side of someone who feels like he's not part of the group and might be missing out. I'm not a gamer, and yet I see that there is a whole world right there with it's own language, culture and social structures. You don't know what you don't know.\n\nSo I'll concede a few points:  \n1) I wish I could 1337 with fluidity and grace, just to annoy people like me. I often don't like people like me, so annoying them with something that annoys me appeals to me.\n\n2) Diversity in all its forms is great. Except for things I don't understand. Then it is evil and must be destroyed.~\n\n3) Languages evolve because of a general ignorance of the \"rules\" as set down institutionally. War is Peace. Freedom is Slavery. Ignorance is Strength.\n\n"
    },
    {
      "time": "3 Feb 2007 — 2:25pm",
      "content": "Careful with the irony marks!\n\n"
    },
    {
      "time": "4 Feb 2007 — 12:08am",
      "content": "_the occasionally impenetrable prose of... Berlow_\n\nBeg pardon, Nick, but... wha...? David Berlow, impenetrable? When? Where?\n\n_Diversity in all its forms is great. Except for things I don’t understand. Then it is evil and must be destroyed._\n\n_Languages evolve because of a general ignorance of the “rules” as set down institutionally. War is Peace. Freedom is Slavery. Ignorance is Strength._\n\nDan, you have a sense of humor! Cheerio, chap. See you in Room 101. ;-)\n\n"
    },
    {
      "time": "4 Feb 2007 — 12:28am",
      "content": "Am I the only one to have noticed the typo in the original quote?\n\n"
    },
    {
      "time": "5 Feb 2007 — 7:30am",
      "content": "\"Is this the sickest, most disgusting aspect of the internet generation?\"\n\nDamn punk kids and their leet speek and texting and rock 'n' roll and HEY STAY OFF THE DAMN LAWN YOU TEENY BOPPERS!\n\n"
    }
  ]
}
