{
  "id": "3112",
  "title": "Chinese Fonts in an English Win XP/2000 Environment??",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I want to use a number of TTF Chinses fonts in Photoshop as graphic elements. Unfortunately, Windows can install non-english fonts, but cannot recognize them. I hear that you can go to the \"Regions\" area in Control Panel, and add Chinese functionality, but naturally, I don't want to set my WHOLE PC to display nothing but Chinese! Can anyone assist me in enabling the Chinese fonts so that Photoshop can use them to make vector font shapes in images, while retaining my english core WIndows funcationality??? I don't want to start fiddling with the core display attributes of Windows without knowing what I'm doing, of course. Thanks in advance!!!\n\n",
  "author": "imagox",
  "time": "5 Sep 2002 — 11:41am",
  "uid": "1096",
  "comments": [
    {
      "time": "5 Sep 2002 — 11:52am",
      "content": "Sorry, that's \"Chinese\" obviously... I was not allowed to edit the message after 5 minutes had passed. ![:(](http://web.archive.org/web/20150420061555im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": "2 Feb 2003 — 3:59am",
      "content": "I wish I had seen your post sooner.   \n [Chinese Star](http://web.archive.org/web/20150420061555/http:/www.chinese-software.com/chinesestar.html) works very well with Photoshop and Flash too. And you don't need to do any of that Regions thingy at all. You can email me if you need more help.   \n   \nWhatever you do, don't get [NJStar](http://web.archive.org/web/20150420061555/http:/www.njstar.com/). It doesn't work well with Photoshop.   \n   \nAlternatively, you could borrow someone's Mac, the Chinese support is pretty good even for OS9.\n\n"
    },
    {
      "time": "2 Feb 2003 — 4:12pm",
      "content": "Thank you for replying! I've been trying to use the Regional Support thing but am having no luck at all... The Chinese Star app- does it use a standard keyboard to input characters? Sorry for my ignorance, but I know that Chinese has MANY more ideograms than English has letters... I'll email you if I don't hear back from you- THANK YOU again for posting!\n\n"
    },
    {
      "time": "2 Feb 2003 — 4:18pm",
      "content": "\\> Karen, I don't see your email address in the reply I received from you. \\>Can you please email me at: [bombshelter@hotmail.com](mailto:bombshelter@hotmail.com) directly? I tried \\>installing the Regional Support but I still think I'm doing something \\>wrong, because I don't have access to the Chinese fonts I've been \\>downloading- I suspect it's my misuse of the Regions thing. Any help is \\>GREATLY appreciated- thanks!!\n\n"
    },
    {
      "time": "2 Feb 2003 — 5:24pm",
      "content": "I don't know all that much about the nitty gritty behind Windows 2000 & XP, but it's been my impression that if you don't chose foreign language support when you _first_ install your OS, it's virtually impossible to enable it later. In a pinch, you could move some of the glyphs in the font onto the Windows Latin 1252 codepage/Unicode range...   \n   \nNate\n\n"
    },
    {
      "time": "3 Feb 2003 — 12:32pm",
      "content": "You can indeed install Chinese language support on any Windows XP machine: all you do is go to 'Control Panel / Regional and Language Options' and check 'Install files for East Asian languages' on the Languages tab and then click 'Details' to view and edit language and keyboard support. Note that this will not change your operating environment to Chinese: it will just add fonts and IME for the language you select. (Note that you will need to have your XP install CD handy.) In the 'Text Services and Input Languages' window that opens when you click 'Details', click 'Add...' and then select the language and 'Keyboard layout/IME' for the language you want. Note that you will have several different options for Chinese depending on locale (Hong Kong, Macau, PRC, etc.) and then you will have several different options for IME. There are lots of different ways to input Chinese text, used by different communities across Asia.   \n   \nEast Asian IME's work from a standard keyboard, but are generally based on a phonetic input method, which means you need to be able to speak Chinese in order to be able to use them. You start typing, e.g. using Pinyin transliteration, and the IME presents you with possible hanza characters that correspond to the sounds that you type. You then select the character you want, and then proceed. As I say, you really need to know what you are doing, and be proficient in one of the phonetic systems for transcribing Chinese.   \n   \nI've tested Chinese IMEs in PhotoShop 7 on Windows XP, and they work remarkably well.   \n   \nIf you can't type Chinese in this way, and only need to use a few characters, another solution is to select your hanza characters by Unicode value, enter them in Wordpad, and then copy and paste into Photoshop. If you know the Unicode value of the characters you want to use, you can type the hexadecimal value in Wordpad, e.g. 7C73, and then hit alt+x immediately after the code value; this will convert the code value into the corresponding Chinese character. You can then select the character and copy and paste into Photoshop.   \n   \nIMPORTANT NOTE: I believe these suggestions may only work in Photoshop 7. Possibly in 6, but definitely not in 5.\n\n"
    },
    {
      "time": "4 Feb 2003 — 6:20am",
      "content": "Oy vey...It sounds as if I've been led astray. Is it true then, John, that I can uninstall the myriad languages that my Windows 2000 is currently supporting, and then just reinstall support for them when I need it?\n\n"
    },
    {
      "time": "4 Feb 2003 — 6:33am",
      "content": "And does having these languages installed affect the PC in any way performance-wise? In other words, is there a benefit to keeping them UNinstalled until you need them?\n\n"
    },
    {
      "time": "4 Feb 2003 — 9:24am",
      "content": "I've never noticed a decrease in performance, myself. I just hate alt-tabbing through all those languages I'm not currently using (and really don't plan on using for a while), until I get back to English. Maybe I'm just lazy...\n\n"
    },
    {
      "time": "4 Feb 2003 — 11:19pm",
      "content": "Wow, if there is a way to input Chinese without using any third party software, you should definitely try John's method first.   \n   \nAnyway I have here a screenshot of what Chinese Star looks like with Photoshop.   \n ![Screenshot](http://web.archive.org/web/20150420061555im_/http:/www.typophile.com/forums/messages/4101/6270.jpg)   \n   \nContrary to what I said earlier about NJ Star - you can download a free 30-day trial of NJStar, another chinese software, but it doesn't work 100% with PShop. Havent tried it on XP though, so I'm not sure abt that.\n\n"
    },
    {
      "time": "4 Feb 2003 — 11:46pm",
      "content": "I currently have eleven different keyboard drivers installed: there's a little box in my taskbar that tells me which one is currently active and lets me switch between them. I have not noticed any performance hits from having these installed. Obviously installed Asian language support requires some disk space to store the huge fonts, but there seems to be very little impact on processing power or time.   \n   \nYes, it is perfectly possible to install and uninstall language support at will without affecting your computer.\n\n"
    },
    {
      "time": "4 Feb 2003 — 11:56pm",
      "content": "Here is a screenshot of Photoshop 7 using the Windows Chinese (PRC) input method editor on Windows XP. As you can see, it is basically the same sort of thing as shown in Karen's example.   \n   \n ![PS 7, Win XP, Chinese (PRC)](http://web.archive.org/web/20150420061555im_/http:/www.typophile.com/forums/messages/4101/6274.gif)   \n   \nAt this stage I have typed in the Pinyin syllable 'zei' and accepted the form shown. Then I have typed the syllable 'hao' and am being presented with nine different character options. I've no idea what these characters mean ![:-)](http://web.archive.org/web/20150420061555im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "5 Feb 2003 — 7:44am",
      "content": "So Chinese Star basically functions as a plug-in for Photoshop then when used this way? I wish I could preview the app for what it costs... I'd hate to mail order it only to find it does not work for what I need it to. ![:-(](http://web.archive.org/web/20150420061555im_/http:/www.typophile.com/forums/clipart/sad.gif)\n\n"
    },
    {
      "time": "8 Feb 2003 — 10:43pm",
      "content": "Bernard, download the free NJStar trial and see if you like it. ChineseStar is better, that's all.\n\n"
    },
    {
      "time": "20 Jun 2007 — 5:48am",
      "content": "Hi all, sorry to bring this old topic back up, but I am pulling my hair out over this Chinese font issue with my Photoshop on PC.  \nI have installed several Chinese fonts (with chinese file names), I also figured out how to type Chiense through Windows' own input system. But, I can't see any of these fonts listed in the fonts dropdown menu in my Photoshop! I can see them all in Word and other applications. What gives??\n\n"
    },
    {
      "time": "20 Jun 2007 — 10:14am",
      "content": "_(with chinese file names)_\n\nThis may be the problem. Photoshop might not recognise the Chinese font names.\n\n"
    }
  ]
}
