{
  "id": "31124",
  "title": "RB Interviews DB on CT",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://www.rogerblack.com/](http://web.archive.org/web/20080705150810/http:/www.rogerblack.com/ \"http://www.rogerblack.com/\")\n\nMight be of interest\n\nMike\n\n [‹ Monotype Van Dijk](http://web.archive.org/web/20080705150810/http:/www.typophile.com/node/30938 \"Go to previous forum topic\") [Handwriting ›](http://web.archive.org/web/20080705150810/http:/www.typophile.com/node/31136 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080705150810/http://www.typophile.com/user/5882\" title=\"View user profile.\">mike_duggan</a>",
  "time": "<br>",
  "uid": "5882",
  "comments": [
    {
      "time": " 3.Feb.2007 9.14am",
      "content": "After reading the article I’ve concluded that regardless of rendering technology black text on white background is easier to read than white on red. ;-)\n\nCheers, Si\n\n"
    },
    {
      "time": " 3.Feb.2007 2.53pm",
      "content": "Shocking, considering the subject. But I posted a comment on it. Lots of food for thought though, a kind of retro fix.\n\nMike thanks for posting it. Think it would help the discussion to explain the accronyms. Maybe I am just old fashioned.\n\nSi, what do you really think about it?\n\n"
    },
    {
      "time": " 3.Feb.2007 8.05pm",
      "content": "\\>Si, what do you really think about it?\n\nI posted a note on the blog, but the formatting got screweeeee - so repost here...\n\nSome Corrections\n\nSigh, the dates are posted here… [http://www.microsoft.com/typography/ClearTypeInfo.mspx](http://web.archive.org/web/20080705150810/http:/www.microsoft.com/typography/ClearTypeInfo.mspx \"http://www.microsoft.com/typography/ClearTypeInfo.mspx\")\n\n\\>Microsoft announced its own anti-aliased type rendering in 1999,\n\nA reference to ClearType? That was November 1998. Apple, Adobe, Bitstream and others worked out the basics of how it worked and various people took similar techniques to market ahead of the Microsoft’s first productization of the technology in the Microsoft Reader (eBook reader) which shipped in April 2000.\n\n\\>then included various anti-aliasing options in Windows starting in 2002,\n\nWindows XP? No that was October 2001. However, Windows 95 supported traditional anti-aliasing - the feature known as ’font smoothing’ which, much like Mac OS, kicks in at larger sizes, or smaller sizes when the font asks for it.\n\nAlthough an accurate timeline might show Microsoft as the innovator here, you could always throw in a reference to Acorn, the obscure UK based computer maker that had a completely fuzzy rendering model as early as 1976 (by some accounts). ;-)\n\nAnyway, apart from that – a great article!\n\nThe interview was much more entertaining, with fewer factual errors, and I can’t wait to see the idea in action.\n\n"
    },
    {
      "time": " 4.Feb.2007 7.47am",
      "content": "For this to be realized do DB and MS have to cooperate with one another? Here’s hoping so we can read the GD screen fonts without getting a headache!\n\nSide note: I don’t understand why increasing screen resolution, which is I suspect is actually the only really satisfactory solution, is not more of a priority with manufacturers. But then I also don’t understand why for a century we’ve had to put up with terrible audio from telephones when good audio exists. I recently started talking on Skype, and it was such a pleasure to get decent audio in a phone conversation.\n\n"
    },
    {
      "time": " 4.Feb.2007 12.11pm",
      "content": "<cite> I recently started talking on Skype, and it was such a pleasure to get decent audio in a phone conversation. </cite>\n\nDude. TOTALY! Plus you can see a kid you love wiggle her loose tooth for you on the video phone which is totally what the 21st century was supposed to be like. No jet packs. No Moon base. But we do have that.\n\nI agree will Bill ( actually is that how you prefer to be refered to or not? I have seen other people do it & I am apeing them I suppose but I would prefer to know how you feel about it... ) that increasing screen rez & the current font tech is pretty acceptable \\*if\\* we were going to have it across devices.\n\nHowever, I think low rez may last a long time and regardless of how long low rez will or won’t last there is a great deal to be said for creating an OS architecture on MS, OSX, Linux and portable OS’ that is aware of and can switch to font data which is size specific. It would be amazing if that kind of tagging could be added to OpenType. Size specific design is the ideal in print obviously and I think it aught to be clear that it is definitely the ideal on screen too. If that font in question is pixel matched as DB suggests or not is to my mind a secondary issue. That is not to say it’s not a worthwhile or unimportant one. Not at all. But it assumes a stability of rez or a specificity of device which may or may not always be relevant. That said It is probably possible to make good looking fonts that are pixel matched at a given PPEM which also look good when not pixel matched on devices with higher PPEMs. But no matter the strategy the best looking font is always going to be the one which matches it’s context the best. That it might be robust outside of that context it is a great secondary gain. The great thing about DB model as opposed to TT+hinting or Hrant’s favorite pixel centric model is that it has far more room for that secondary gain to occur in.\n\n"
    },
    {
      "time": " 4.Feb.2007 1.14pm",
      "content": "Yes, Eben, call me Bill.\n\nHowever, when you need to point out that what I’m saying is full of sh\\*t, then begin “Dr. Berkson,” :)\n\nI’m sure that as you say for cost reasons the increase in screen resolution will come slowly, and small devices like phones may always have lower resolution. So certainly any advance in low resolution fonts will be a blessing to the poor reader.\n\n"
    }
  ]
}
