{
  "id": "31132",
  "title": "The Best Hundred",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[The Best Hundred of All Time](http://web.archive.org/web/20150303172202/http:/www.100besteschriften.de/)\n\n• Helvetica  \n• Garamond  \n• Frutiger  \n• Bodoni  \n• Futura  \n• Times  \n• Akzidenz Grotesk  \n• Officina  \n• Gill Sans  \n• Univers  \n• Optima  \n• Franklin Gothic  \n• Bembo  \n• Interstate  \n• Thesis  \n• Rockwell  \n• Walbaum  \n• Meta  \n• Trinité  \n• DIN  \n• Matrix  \n• OCR A und B  \n• Avant Garde  \n• Lucida  \n• Sabon  \n• Zapfino  \n• Letter Gothic  \n• Stone  \n• Arnhem  \n• Minion  \n• Myriad  \n• Rotis  \n• Eurostile  \n• Scala  \n• Syntax  \n• Joanna  \n• Fleischmann  \n• Palatino  \n• Baskerville  \n• Fedra  \n• Gotham  \n• Lexicon  \n• Hands  \n• Metro  \n• Didot  \n• Formata  \n• Caslon  \n• Cooper Black  \n• Peignot  \n• Bell Gothic  \n• Antique Olive  \n• Wilhelm Klingspor Gotisch  \n• Info  \n• Dax  \n• Proforma  \n• Today Sans  \n• Prokyon  \n• Trade Gothic  \n• Swift  \n• Copperplate Gothic  \n• Blur  \n• Base  \n• Bell Centennial  \n• News Gothic  \n• Avenir  \n• Bernhard Modern  \n• Amplitude  \n• Trixie  \n• Quadraat  \n• Neutraface  \n• Nobel  \n• Industria, Insignia, Arcadia  \n• Bickham Script  \n• Bank Gothic  \n• Corporate ASE  \n• Fago  \n• Trajan  \n• Kabel  \n• House Gothic 23  \n• Kosmik  \n• Caecilia  \n• Mrs Eaves  \n• Corpid  \n• Miller  \n• Souvenir  \n• Instant Types  \n• Clarendon  \n• Triplex  \n• Benguiat  \n• Zapf Renaissance  \n• Filosofia  \n• Chalet  \n• Quay Sans  \n• Cézanne  \n• Reporter  \n• Legacy  \n• Agenda  \n• Bello  \n• Dalliance  \n• Mistral\n\n",
  "author": "satya",
  "time": "4 Feb 2007 — 1:10am",
  "uid": "14032",
  "comments": [
    {
      "time": "4 Feb 2007 — 1:36am",
      "content": "… as exhaustively seen and discussed on every single German blog …\n\n"
    },
    {
      "time": "4 Feb 2007 — 3:54am",
      "content": "… but not on the English ones!\n\n"
    },
    {
      "time": "4 Feb 2007 — 4:02am",
      "content": "… agreed, Dan. And what a clever piece of promotion it is …\n\n"
    },
    {
      "time": "4 Feb 2007 — 4:02am",
      "content": "Out of the 100, which one is the most space-saving and easiest on-the-eyes for papers and which one for Screen?  \nThanks\n\n"
    },
    {
      "time": "4 Feb 2007 — 4:55am",
      "content": "Florian: It is great promotion. I admire FS Berlin for the excellent work that clearly went in behind this project.\n\nAziz: Off-hand, I can't say which are the most space-spacing there for print. Maybe ITC Officina or Swift? Also, I'd have to look at the list again, but I think that all of the typefaces were originally intended more for use in print than on-screen. This is sort of a traditional typography thing.\n\nAnd for the eyes? I think that that is very subjective. I can't give you an answer :-( The famous grotesks, however, probably are not the ones that are best for your eyes. Maybe something more humanist?\n\n"
    },
    {
      "time": "4 Feb 2007 — 6:56am",
      "content": "\\>easiest on-the-eyes for papers\n\nSatya, this is so influenced by size, measure, leading, paper and press that you can't give a simple answer. For example, not to pick on your country, but my wife is struggling with a book printed India because it has such poor readability.\n\nIt is cleanly printed in Adobe Garamond 10.5/12 at a measure of 24 picas on paper with a huge amount of show-through. If it were Adobe Garamond 12/14 at a comparable measure for that size and on more opaque paper, you would find it hard to beat that for readability. But as it is, it is a headache-inducing horror.\n\nThis poor readability is because of a combination of things. First, Adobe Garamond has a small x-height and so 10.5, which would be fine in many other types, is a bit of a problem. More than that, the show-through is so bad that any type could be a problem. Moreover, it is exacerbated by the fact that the design doesn't keep a consistent baseline grid. This makes the show-through appear irregularly between lines, and gives an 'out of focus' look to the type, in spite of the fact that it is cleanly printed.\n\nThis is an extreme case, but it shows the difficulty of giving a definitive answer on readability. There are somewhat similar problems on what type is most economical. A the lower case alphabet of one face may be shorter at 10 point than another, but that doesn't mean it is necessarily more economical. The wider font, set at a smaller size, with equal line spacing, may be more readabile. And since readability is probably influenced by how dark the type looks, which is in turn influenced by leading, everything gets rather complicated.\n\nFor exploration of all this see The Complete Manual of Typography by James Felici, or Book Typography by Mitchell & Wightman. I am finding the latter particularly informative. It is rather expensive so you might ask your university to get it, if they don't already have it.\n\nAll that being said, there are types which have problems as text types. For example my pet hate is Helvetica/Arial used as text type (small size, extended text) for print. While it is fine as far as readability used as a display type, I think it is horrible to read as text type. But many of the great text types, like Garamond, Times, Baskerville, Caslon, etc. work extremely well at text sizes, though each ideally is handled a bit differently, according to its distinctive characteristics.\n\n"
    },
    {
      "time": "4 Feb 2007 — 10:20am",
      "content": "Does anyone know if there's a chance of this being translated into English?\n\n"
    },
    {
      "time": "4 Feb 2007 — 3:32pm",
      "content": "Satya, thank you so much for posting this; I was unaware FontShop.de had done this and I must admit it is _very_ much more elegant than [my attempt](http://web.archive.org/web/20150303172202/http:/www.100types.com/100types.com.intro.html) at a very similar thing.\n\nChris, FWIW, my version is in English; however only some of the information overlaps because\n\na) it's based on the [\"The Top 100 Types of All Time?\"](http://web.archive.org/web/20150303172202/http:/www.tdc.org/reviews/typelist.html) list at the TDC site, rather than best seller lists compiled by the FontShop from their sales/search data.\n\nb) I did all the research for my site by myself (with a lot of help, admittedly) but I don't have the resources for either research or website production that the FontShop does.\n\nAziz, the the most space-saving one out of the 100 listed (at my site) would probably be [Compacta](http://web.archive.org/web/20150303172202/http:/www.100types.com/100types.com.96compacta.html) for display work, or [Bell Gothic](http://web.archive.org/web/20150303172202/http:/www.100types.com/100types.com.41bellgothic.html) – but both of these evolved for very specific purposes (good condensed types for general text setting are now quite plentiful among the large hybrid families). Or check out [Minion](http://web.archive.org/web/20150303172202/http:/www.100types.com/100types.com.27minion.html). The 'easy-on-the-eyes' thing is as William says, quite subjective, but for on-screen work there is [Base Nine & Twelve](http://web.archive.org/web/20150303172202/http:/www.100types.com/100types.com.68base9and12.html) in that list.\n\nWilliam _...my pet hate is Helvetica/Arial used as text type (small size, extended text)_ Berkson, please be aware that this 100types site is only in beta testing stage so far!! Feedback to date includes the comment that, yep, the text is too small : 0\n\n"
    },
    {
      "time": "4 Feb 2007 — 6:47pm",
      "content": "Ben - I think you're off to a good start with this. Pretty interesting. The thing that interested me most was the timeline, which would be terrific if you can find a more elegant way to present it.\n\nIt's obviously a labor of love - cool…\n\npeace\n\n"
    },
    {
      "time": "4 Feb 2007 — 6:54pm",
      "content": "I don't get it. What makes Optima, for example, \"better\" or \"greater\" than, say, Dante, Albertina, Trump, or Galliard?\n\n"
    },
    {
      "time": "4 Feb 2007 — 6:55pm",
      "content": "Thanks Paul. Very kind of you.\n\nmail k? Feel free to make your own list. In doing so you'd likely realise that all such lists are necessarily compromised by their very nature. I'll confess it's also my kneejerk reaction whenever I see 'the 100 all time best _whatever_'... usually with restaurants, hotels, movies, books and cds. That's why Paul Shaw put a question mark in the title of the original list. But specifically, Optima was judged to be more innovative as a design than the other types you mention by the people (TDC members) that he asked; you could say it broke the mould of what a sans serif could be at that time.\n\n"
    },
    {
      "time": "4 Feb 2007 — 9:38pm",
      "content": "Optima also has had more commercial success. This is a subjective \"better,\" but it is a measure that can be taken into account when trying to create a ranking (which is kind of silly for typefaces anyway, even though I love lists like that ;-D ). Sales data was once of three factors that FontShop used when compiling their list.\n\n"
    },
    {
      "time": "4 Feb 2007 — 11:29pm",
      "content": "\\>Does anyone know if there’s a chance of this being translated into English?\n\nI've posted the wish at fontblog.de. We will see…\n\n"
    },
    {
      "time": "5 Feb 2007 — 1:11am",
      "content": "@ Aziz: I believe that Erik Spiekermanns FF Info is both ... space saving and made for paper & displays per definition. See: [http://www.100besteschriften.de/53\\_Info.html#a53](http://web.archive.org/web/20150303172202/http:/www.100besteschriften.de/53_Info.html#a53 \"http://www.100besteschriften.de/53\\_Info.html#a53\")  \nInfo was made for Düsseldorf airport orientation system first, and later the family was extended with a text-version for printed matter.\n\n"
    },
    {
      "time": "5 Feb 2007 — 4:10am",
      "content": "Thanks. I picked Optima at random: I'd be equally perplexed if it were the one left out. I was just trying to understand the criteria.\n\n"
    },
    {
      "time": "5 Feb 2007 — 7:12am",
      "content": "\\>Does anyone know if there’s a chance of this being translated into English?  \nJürgen Siebert from fontblog.de has answered – fontshop.com will do an english version of it.\n\n"
    },
    {
      "time": "5 Feb 2007 — 8:24am",
      "content": "When I first saw this there was a translation (admittedly in babelfish English).\n\nTim\n\n"
    },
    {
      "time": "5 Feb 2007 — 10:04am",
      "content": "_fontshop.com will do an english version of it._\n\nHopefully with tabular figures properly tabbed.\n\n"
    },
    {
      "time": "5 Feb 2007 — 5:02pm",
      "content": "_fontshop.com will do an english version of it._\n\nHooray!\n\nDan thanks for confirming the sales data as one of the criteria. I really like the fontshop list – for a start it has many more tasty contemporary faces in it ; D\n\nmail k, you happened to pick Optima, but in my case I couldn't believe the absence (from the TDC list) of News Gothic or Trade Gothic... everyone makes their own list sooner or later.\n\n"
    },
    {
      "time": "5 Feb 2007 — 5:30pm",
      "content": "I'm not a fan of Top 100 lists (or Best 100), but I do agree with the majority of what's listed here. I'm sure there are some omissions and inclusions some would argue over, but I think it's still a pretty good list.\n\n"
    },
    {
      "time": "5 Feb 2007 — 7:14pm",
      "content": "Problems: Which Garamond does the list refer to? The \"real\" Garamond or the Jannon Garamond? Adobe? And which Caslon?\n\n"
    },
    {
      "time": "5 Feb 2007 — 9:38pm",
      "content": "Ben, I love your list!  \n [http://www.typeoff.de/?p=129](http://web.archive.org/web/20150303172202/http:/www.typeoff.de/?p=129 \"http://www.typeoff.de/?p=129\")\n\n"
    },
    {
      "time": "5 Feb 2007 — 9:42pm",
      "content": "\\>Problems: Which Garamond does the list refer to? The “real” Garamond  \n\\>or the Jannon Garamond?\n\nFrom the text on the website, it seems to refer to the real Garamond.  \n [http://www.100besteschriften.de/2\\_Garamond.html#a2](http://web.archive.org/web/20150303172202/http:/www.100besteschriften.de/2_Garamond.html#a2 \"http://www.100besteschriften.de/2\\_Garamond.html#a2\")\n\nThe first revival mentioned there is Stempel Garamond, which was based on a specimen of letters cut in part by Claude Garamond. ITC Garamond and Adobe Garamond are also mentioned.\n\n"
    },
    {
      "time": "6 Feb 2007 — 12:24am",
      "content": "We are indeed working very hard to bring the 100 Best Typefaces to English-speaking folk.\n\n"
    },
    {
      "time": "6 Feb 2007 — 1:00am",
      "content": "_everyone makes their own list sooner or later._\n\nNot me.\n\n\\*\\*\n\nThis is a good excuse for a marketing promotion, like they say by referencing Rolling Stone, type can be just as massive as music or movies.\n\nHowever, they may have shot their bolt by mixing up sales, panel preferences and historical import into one big \"best\" category -- separately, the 100 list could have been rolled out for a couple more years. After all, you only get one shot at the 100 best of all time.\n\n"
    },
    {
      "time": "6 Feb 2007 — 4:37am",
      "content": "Dan thanks very much for that; but it's really not _my_ list, and as I said above it's a lot less graceful than the FontShop.de effort. I just saw something already out there that I thought could be expanded upon. Apparently Paul was spoofing all those millenium lists that were around in 1999 – which might also explain why it's unranked.\n\nBrad's question about the 'real' Garamond reminds me of Paul Hunt's post here at [http://typophile.com/node/30080](http://web.archive.org/web/20150303172202/http:/typophile.com/node/30080 \"http://typophile.com/node/30080\")\n\n"
    },
    {
      "time": "6 Feb 2007 — 9:28am",
      "content": ":) More stuff to discuss\n\nI just played around a bit with the list, because i was bored :)\n\nWhen you count the placment of the types by one designer over the sum of his types listed in the Fontshop-list you gain following result.\n\nEric Gill = (9+36):2 = 22,5  \nAdrian Frutiger = (3+10+65):3 = 26  \nErik Spiekermann = (8+18+53):3 = 26,3  \nTobias Frere-Jones = (14+41):2 = 27,5  \nHermann Zapf = (11+26+38+90):4 = 41,25  \nMorris Fuller Benton = (12+64+74+85):4 = 58,75\n\nSo in my list Eric Gill is the best typedsigner of all time.\n\n(it was a stupid idea... I know) :)\n\n"
    },
    {
      "time": "6 Feb 2007 — 10:22am",
      "content": "On a similar note: being fed up with the overall presence of Times in Polish publications, some four years ago I made a subjective list of 60 \"Times replacements\" for a Polish website:  \n [http://dtp.art.pl/nietylkotimes.html](http://web.archive.org/web/20150303172202/http:/dtp.art.pl/nietylkotimes.html \"http://dtp.art.pl/nietylkotimes.html\")\n\nI've only considered font collections widely popular in Poland (Bitstream, Linotype, URW, Adobe), so the list only includes classics. Obviously, many excellent typefaces from smaller foundries are missing, so are many newer typefaces as well as such that were missing Polish diacritics. Because the list was supposed to gather \"Times replacements\", it's obviously lacking sanserifs, scripts etc.\n\nI categorized the potential use of those typefaces into popular literature (beletrystyka), magazines (czasopisma), high-profile editions (wyd. eleganckie), daily newspapers (prasa codzienna). I must admit that I'm still a great fan of the Linotype legibility series, hence the inclusion of Aurora, Textype, Ionic 5, Impressum, Gazette, Corona and Olympian in my list.\n\nA.\n\n"
    },
    {
      "time": "6 Feb 2007 — 10:55am",
      "content": "Steven: Actually your list indicates that Hermann Zapf is the best type designer ever, with 4 in the top 100 and 3 in the top 40. Much better than conceding it to Gill with a lousy 2 in the top 100.\n\n"
    },
    {
      "time": "6 Feb 2007 — 10:59am",
      "content": "However, this list should be merged and purged with the 100 WORST list.  \nAlso, Gill wouldn't make the Hall of Fame, under the Rose\\* exclusion principle.\n\n\\*Peter Edward Rose, baseballspieler.\n\n"
    },
    {
      "time": "6 Feb 2007 — 11:11am",
      "content": "The best type designer ever is Francesco (Griffo) da Bologna. His genius defined the printed lower case as we know it, so he is the innovative and most influential. He would need an asterisk to Alcuin, the scribe, though, who codified the Carolingian miniscule. I recently saw the exhibition of oldest Bible manuscripts at the Smithsonian, and you could really see what the historians' shouting is all about, so to speak. The Irish monks introducing the word space into latin script was one huge step in readability. And when I saw Alcuin's actual work, I was blown away: there it was, the lower case, strong, open, humanist, contemporary to today. No doubt at all why Jenson and Griffo took it as their model.\n\nps. Maybe you could make a case for Jenson, but the debate would be between those two, nobody else. The question of what is the best design is different. And there Garamond and others would come in.\n\n"
    },
    {
      "time": "6 Feb 2007 — 11:18am",
      "content": "I wonder what the honorable mentions were... they had to have some difficulty leaving a few faces off, I'm sure.\n\n"
    },
    {
      "time": "6 Feb 2007 — 11:23am",
      "content": "Have a look at the individual jury lists for honorable mentions.\n\n"
    },
    {
      "time": "6 Feb 2007 — 12:20pm",
      "content": "Bill, I would opt for Jenson as definitive, on the basis of alphabet shapes, for AFAIK, it was his influence which standardized the \"h\" to be like the \"n\", i.e. with a straight right leg.\n\nA nod must be given to G.G. Trissino, for promoting v and j. That was in the 16th century.  \nAlso, props to those who dismissed the long s, and introduced lining figures (around 1800).\n\nThese constitute alphabetic design, therefore more significant than mere typeface design.  \nBy that logic, Tzar Peter the great is The Man. However, he wouldn't make it to the Hall of Fame either, having tortured and killed his son.\n\n"
    },
    {
      "time": "6 Feb 2007 — 12:26pm",
      "content": ":) No.1  \nBefore the people buying too much Helvetica Neue at linotype…  \n [A Newsletter](http://web.archive.org/web/20150303172202/http:/www.fontshop.com/fontfeed/archives/helvetica_alternatives.cfm)\n\n:) No.2  \nSimilar faces to Helvetica, like Akkurat are not mentioned. Ok, i understand, Akkurat is not available at fontshop.\n\nResume – don't take that stuff to seriously.\n\nPS  \nI enjoyed the \"100 beste Schriften\" really!\n\n"
    },
    {
      "time": "6 Feb 2007 — 1:07pm",
      "content": "Nick, I was choosing Jenson and Griffo not because of alphabet reform, but because of their getting the concept that by departing from the hand written form, and sculpting the letters to have more even color than hand writing, one could create a more readable script. To me that was the key breakthrough in type design, as opposed to hand written alphabets.\n\n"
    },
    {
      "time": "6 Feb 2007 — 1:59pm",
      "content": "Bill, surely by that criterion, Sweynham & Pannartz made the decisive move.\n\nI wasn't talking about alphabet reform per se, but about definitive \"topological\" designs which fixed the standard latin alphabet shapes. That's somewhere between alphabet reform and proportional design.\n\nBy topology I mean the number and kind of bezier points which define a minimal (skeletal) alphabetic form.\n\n"
    },
    {
      "time": "6 Feb 2007 — 2:24pm",
      "content": "Wasn't there someone from Subiaco that even predates Sweyn & Pann?\n\n"
    },
    {
      "time": "6 Feb 2007 — 2:41pm",
      "content": "I'm not so concerned here with final fixing of latin shapes but of a new sense of the possibilities of sculpted type as opposed to hand writing. Looking at the examples of Sweynham & Mannartz in Harry Carter's book, they don't cut the mustard. They are more calligraphic, and clumsy to boot. Jenson and Griffo are way more typographic, and more elegant, and that is why they are continually revived.\n\n"
    },
    {
      "time": "6 Feb 2007 — 2:42pm",
      "content": "I'd agree with you William. When I was reasearching the history of the roman letterform I decided that Swey&Pann as well as Sobiaco hadn't reached a final form.\n\n"
    },
    {
      "time": "6 Feb 2007 — 4:00pm",
      "content": "Not the Subiaco, which was S&P's first Italian type, but their second, the Rome type.  \nThat was the first \"humanist+sculpted\" typeface.\n\n"
    },
    {
      "time": "18 Dec 2007 — 4:27pm",
      "content": "Trying to address several people's questions, here, so bear with me.\n\nI have several favorites, but readability has a lot to do with the medium. On screen readability is not the same as printed by any means. For printed media in large blocks of text, I suggest Baskerville or Garamond. Large bodies of text should be in a serif font.\n\nI would rank the top 10 fonts for printed text (large bodies of text) this way (favorite to least favorite).  \n1. Garamond (take your pick - I like JG Garamond, though it is only currently in True Type and hard to find. I would also say try Adobe Garamond or Garamond Premier Pro)  \n2. Baskerville (In particular MBaskerville, Berthold Baskerville, Baskerville Win95 BT, Baskerville Bookprint or New Baskerville).  \n3. Book Antiqua  \n4. Georgia  \n5. Goudy Old Style  \n6. Acanthus  \n7. Caslon  \n8. Atlantix  \n9. Bauer Bodni  \n10. Century Schoolbook\n\nAs for a top 100, I do not agree with the list above at all for some, but that is sort of the point. I think everyone with have their own list of top 100 fonts. Doubtless many people would very much differ with my top 100 list and I am sure there are many that will differ with my top 10 list above. Thus, give the ones mentioned a try and pick your own.\n\nBut in the category of more unsolicited suggestions...\n\nFor titles or fancy text I would say go with:  \n1. Bernhard Modern  \n2. DeVinne  \n3. Tiffany\n\nFor a sans serif you can't go wrong with Arial, but Swiss is also really nice.\n\nIn a pinch, for a serif font, Dutch is also good. I tend to avoid CG Times, Times and Times New Roman if I can, because it is just WAY over used (my opinion), plus I do not find it that easy to read. I have much less eye fatigue reading Garamond or Baskerville.\n\nOn screen I find that Helvetica, Swiss, Sans Serif, Arial or Verdanda to be easily readable. If you are using an old picture tube monitor, these will be better for you. For those of you that have a flat panel or high definition flat panel monitor, try the open type (in windows they render better on the screen than true type fonts for most people) Dutch, Goudy Old Style or Georgia.\n\nRegarding the space saving fonts. The space saving fonts generally are relegated to the condensed fonts, such as some condensed Garamond font or something like that. Times New Roman is one of the most space saving fonts around without being a condensed font, but I dislike the Times family. Recently, but unfortunately still very hard to find, there has been a Baskerville developed with the same rough width as Times New Roman. The result is a font that is more readable than Times but saves space like times. The font is called (brace yourselves for the imaginative genius of the name) Baskerville Times. In my opinion it is the most space saving font for the level of readability out there.\n\n"
    },
    {
      "time": "18 Dec 2007 — 8:36pm",
      "content": "Some of the entries on Paul Shaw's TDC list make more sense to me. Some of them, not the whole list. At least it includes Memphis, Neuland and Fette Fraktur. Neuland and Fette Fraktur alone are arguably two of the all-time greats. The Fontshop list has a number of pointless double entries in the form of revivals. Why leave out Memphis and venerate Rockwell when that face owes so much to Memphis? Mrs. Eaves is sweet, but it too is indebted to John Baskerville's original roman face. The Fontshop list includes too many recent successes. Cézanne---gimme a break. It's a very trendy hand-written script face but not great type design and vastly overrated. DIN, Interstate---no, sorry, they're just very trendy. Don't confuse fashionable with great design.\n\nThe \"many more tasty contemporary faces\" on the Fontshop list is a pleasant touch for short-sighted typographers and the easily-persuaded, much like the NME reader polls that rate Radiohead and Queens of the Stoneage along with the Beatles amongst the \"greatest bands of all time\".\n\n_...they may have shot their bolt by mixing up sales, panel preferences and historical import into one big “best” category_\n\nYep-yep-tep. More useful and meaningful top 100 font lists could be compiled based on sales alone, aesthete panel ratings alone, historical value alone, and so on.\n\nI get the impression this is a marketing exercise rather than an objective and meaningful list.\n\nj a m e s\n\n"
    },
    {
      "time": "20 Dec 2007 — 12:08am",
      "content": "Some of the typefaces on admmoon's list are clones of much better-known original works. (In the case of the SSI fonts Acanthus and Atlantix, at least some versions were illegal knock-offs that were withdrawn from the market.)\n\nBook Antiqua \\> Palatino  \nAcanthus \\> Galliard  \nAtlantix \\> Minion\n\nCheers,\n\nT\n\n"
    }
  ]
}
