{
  "id": "31137",
  "title": "FF Clifford",
  "forum": "Home",
  "tags": [
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20140107154514/http:/typophile.com/wiki/Indices) : [Typefaces](http://web.archive.org/web/20140107154514/http:/typophile.com/wiki/Typefaces) : FF Clifford**\n\n[Akira Kobayashi](http://web.archive.org/web/20140107154514/http:/typophile.com/wiki/Akira%20Kobayashi), 1994-1999\n\nThe first drawings of Clifford date back to 1994 and were inspired by Alexander Wilson's Long Primer Roman type, which was used to typeset an edition of Pliny the Younger's \"Opera\", printed by the Foulis brothers in 1751. The italic is roughly based on Joseph Fry and Sons' Pica Italic No. 3 in their type specimen dated 1785. The Roman and Italic were combined to create FF Clifford Nine. Though based on hot-metal type, the face was not intended to be a faithful reproduction; in fact, designer Akira Kobayashi designed the font specifically for digital use. At the same time he wanted to maintain the optically corrected size variations commonly used for lead type so that the design would function as a text face in a variety of sizes. So he added two more versions, called Clifford Eighteen and Clifford Six. The former has more contrast in stroke, narrower letter forms and a tighter fit; while the latter is bolder and wider with sturdier hairlines and serifs and a looser fit. The three Clifford variations were drawn separately (rather than scaled) and some characters were changed to function better in the intended size. Overall the characters of Clifford Eighteen are more lyrical, and the characters of Clifford Six simpler than those of Clifford Nine. But the size indication is merely a recommendation; FF Clifford can and should be used as the user wishes, or as printing techniques dictate.\n\nFF Clifford's extensive character sets are sure to appeal to the typographically intrepid. The normal Roman and Italic weights, for example, include oldstyle figures. The Caps weights contain uppercase letters and small caps. The numerals align with the small caps as do the ampersand, monetary symbols, parentheses, brackets and some of the punctuation signs. The FF Clifford Experts include a wide variety of ligatures such as: ct, st, ff, fj, ft, ffi, ffl, gy (italic only), and a \"publish\" character. FF Clifford LF contains lining figures. FF Clifford Italic Alternates LF includes full character sets with plain J, Q, T, Y and h, replacing the swash letters; as well as lining figures. FF Clifford Borders is a collection of 18th century borders and ornaments that complement the typeface.\n\nIn the spring of 1998 the Clifford family won first prize in the text font category as well as Best of Show at the First U&lc Type Design Competition in New York.\n\n**External Links**  \n [FF Clifford](http://web.archive.org/web/20140107154514/http:/www.fontshop.com/fonts/downloads/fontfont/ff_clifford/) at FontShop  \n [Akira Kobayashi on FF Clifford](http://web.archive.org/web/20140107154514/http:/www.fontshop.com/fontfeed/archives/akira-kobayashi-on-ff-clifford/)\n\n",
  "author": "Stephen Coles",
  "time": "4 Feb 2007 — 9:59am",
  "uid": "103",
  "comments": [

  ]
}
