{
  "id": "31131",
  "title": "Companion font for Futura",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello,\n\nI am trying to find a typeface that can be used to accompany our Futura based logo and wordmark.\n\nI have constantly read not to use two sans fonts together. However, I would really like to use Helvetica as a companion font for a few different reasons listed below, and I was wondering is this something that is seen as a very bad thing?\n\n1. Using Helvetica for proposals and correspondance for word docs so that it is easily available on clients computers regardless of PC or Mac.\n\n2. It seems to look more modern and cleaner than a serif in these applications.\n\nAny feedback and or alternative suggestions.\n\nThanks!  \nDemetre\n\n",
  "author": "wonderfulunion",
  "time": "3 Feb 2007 — 11:33pm",
  "uid": "16350",
  "comments": [
    {
      "time": "4 Feb 2007 — 12:16am",
      "content": "Please don't use Helvetica for extended body text. Bleah!\n\nIf you must use a sans serif for proposals and correspondence, at least make it something more humanist. Gill Sans, Syntax, Stone Sans, and the like are all much better choices.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "4 Feb 2007 — 12:52am",
      "content": "Also, most PCs don't have Helvetica anyway.\n\n"
    },
    {
      "time": "4 Feb 2007 — 3:18am",
      "content": "What's wrong with helvetica? If you set it properly it will be very thankful. Helvetica and it's history speak for itself.\n\nBtw you are setting e-mails or what?  \nIf not, I suggest avenir - the better futura :)  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n-  \ngolden ratio of passion. sansogno.coastaldisturbance.com\n\n"
    },
    {
      "time": "4 Feb 2007 — 3:43am",
      "content": "Whats wrong with staying in the Futura family?  \nThere are so many varieties, weights, etc. Even a display face...\n\nIf you are going to use a different face for body (text) then why not move toward a serif face for easy readability? If you are concerned about using something that folks have on their PCs already - why not, ugh, the ever-popular and overused Times Roman?\n\n"
    },
    {
      "time": "4 Feb 2007 — 8:47am",
      "content": "<cite>What’s wrong with helvetica? If you set it properly it will be very thankful. Helvetica and it’s history speak for itself.</cite>\n\nThere's a big difference between Helvetica set well by a capable designer and Helvetica that's used by everyone in an organization.\n\n"
    },
    {
      "time": "4 Feb 2007 — 1:18pm",
      "content": "Thanks everyone for your comments. I guess this thread is another great example of why I feel confused quite oftenly when I'm trying to choose the correct typeface to accompany a typeface. I realize that there isn't alway just one good answer. Such as, when using Futura ALWAYS use Gill Sans as a supporting typeface in all cases.\n\nI personally feel that using Futura for all of the text begins to look a bit monotone, drab and yet somehow over designed in some way. I also lean towards the sans typefaces as I feel they feel more modern and for the amount of text we use in real world applications from emails, proposals, contracts, etc. At the same time this I realize this is a personal preference and perhaps I am making typographical mistakes by choosing a sans to accompany the Futura family. However, I sometimes wonder if someone saying not to use Helvetica for body copy and someone else saying there is nothing wrong with Helvetica turns into a PC vs Mac debate in a way.\n\nAny more fuel you can add to the fire is greatly appreciated. In fact any resources anyone has related to typeface pairings would be a great help as well.\n\nThanks.  \nDemetre\n\n"
    },
    {
      "time": "4 Feb 2007 — 3:05pm",
      "content": "Well, the Helvetica argument could seem a bit fanboyish, with neither side seeming to have a more valid claim, but to my understanding, there's some definite validity to the argument against using it for body text. The reason comes down to stroke contrast. If you look at typical serif text, the line that makes up each character changes in width (for example, look at an \"o\": the stroke will usually be thinner at the upper-left and lower-right or at the top and bottom). The problem with sans-serifs is that they are often monoline, meaning that they have very little stroke contrast. The lack of stroke contrast, plus the loss of serifs, which some consider to be useful for guiding the eye from letter to letter, is why many would recommend against using sans-serifs for extended text. You may see it a bit yourself if you print out an essay in a sans versus in a serif -- I find that the sans version will tire me out more quickly.\n\nThat said, as James said, Helvetica can be terrific if used by someone who knows what they're doing (see the upcoming Helvetica movie for it's popularity). But when used by most, it runs the risk of seeming like it was just the default choice.\n\nSo, my suggestion: Don't use Helvetica, since it has little in common with Futura to suggest it as a strong companion and it is _not_ on most PCs (they would have to use Arial -- blech!). If you're absolutely committed to using a sans other than Futura (which, I agree with Jackie, would be fine to use) try something more humanistic as Thomas suggested -- it will make for easier extended reading and will contrast with Futura (mechanical geometry vs. humanism). But to say that sans-serifs are simply more modern is not quite right, as there are tons upon tons of serifs that can feel incredibly contemporary. The problem is in finding something common to just about every PC: the only ones that are just about everywhere that I would use are Verdana, Georgia, and Trebuchet. Check them out, especially Georgia.\n\n"
    },
    {
      "time": "4 Feb 2007 — 4:23pm",
      "content": "Hey Demetre, I agree with the other respondents here; Helvetica is a rotten accompaniment to Futura. If your second criteria is about 'more modern and cleaner' then why not keep it simple and use Futura for the whole lot, as Jackie says?\n\n_...any resources anyone has related to typeface pairings would be a great help as well_  \nThere are a [number of reference pages about type pairings](http://web.archive.org/web/20150310071702/http:/www.will-harris.com/fontpair-d-i.htm) that Daniel Will-Harris put together years ago at his site [www.will-harris.com](http://web.archive.org/web/20150310071702/http:/www.will-harris.com/ \"www.will-harris.com\"). In that schema, the first suggested pairing for Futura is... Futura.\n\n"
    },
    {
      "time": "4 Feb 2007 — 6:11pm",
      "content": "Ben - I wanted to email you - but your website doesn't offer a way to communicate with you. I found the font I made - the printer end was dated August of 1993. I think you'd get a kick out of it... It is the one I describe to you once before - for Berkley's Prime Crime imprint. (I don't think if fair of me to post it here for you :-)\n\nAnd wonderfulunion - may I suggest you take a closer look at Futura. Type is only bland, boring when not put together correctly. Futura has many weights and counterparts and various widths. It also, like Gill has a collection of \"Display\" fonts.\n\nI don't really think Gill is a grand alternative to Futura. If you are really looking for a counterpart - then why another san serif face? Soon onto Avant Garde, or make me smile with 20th Century - which is very futura-ish but in only 3 weights -- LOL\n\nWell, best of luck selecting - there are so many great ones out there to choose from.\n\n"
    },
    {
      "time": "4 Feb 2007 — 7:22pm",
      "content": "Hey Jackie. My email address was viciously attacked by the spambots last year and I've been paranoid ever since... apologies for the extra effort but the website says 'you will need to **type** this address into your mail program' for exactly that reason.\n\n"
    },
    {
      "time": "4 Feb 2007 — 7:54pm",
      "content": "Demetre, the reasons you list for using Helvética don't relate with Futura at all.\n\nIs Futura only going to be used in the logo or is it going to be used as a headline face or only to set advertisings or what?\n\nIt would help a lot to give you suggestions if you show us the actual logo, talk us a little about how are you going to use futura and about the mood you want to transmit in the written communications of this company.\n\nHéctor\n\n"
    },
    {
      "time": "4 Feb 2007 — 10:49pm",
      "content": "Lubalin Graph is a block serif of Avant Garde, although very chunky (I always think of it as a taxi cab font). Egyptienne F is a serifed version of Univers, and much more elegant.\n\nSo, is there a such thing as a serif-ed Futura? And if not, why?\n\n"
    },
    {
      "time": "4 Feb 2007 — 10:53pm",
      "content": "<cite>So, is there a such thing as a serif-ed Futura? And if not, why?</cite>\n\nThere are plenty of geometric slab faces that fit the bill, although Serifa seems closer as it's a mostly geometric design with the same sort of traditional stroke weight tapering that was added to Futura to keep it readable. Putting smaller traditional serifs on a geometric font wouldn't work, they'd look too small and seem out of place.\n\n"
    },
    {
      "time": "5 Feb 2007 — 1:05am",
      "content": "What about Avenir as a more readable alternative?\n\n[Avenir](http://web.archive.org/web/20150310071702/http:/www.linotype.com/72/avenir-family.html)  \n [About Avenir](http://web.archive.org/web/20150310071702/http:/www.linotype.com/294-13421/interviewwithafrutiger.html)\n\n[Avenir Next](http://web.archive.org/web/20150310071702/http:/www.linotype.com/90672/avenirnext-family.html)  \n [About Avenir Next](http://web.archive.org/web/20150310071702/http:/www.linotype.com/2090/avenirnext.html)\n\n[ITC Lubalin Graph](http://web.archive.org/web/20150310071702/http:/www.linotype.com/724/itclubalingraph-family.html) could almost be a serif version of Futura… it _is_ a serif version of ITC Avant Garde Gothic…\n\n"
    },
    {
      "time": "5 Feb 2007 — 4:26am",
      "content": "Oh there are those guys from the back room of Photolettering again.\n\nThe handletterers that were on staff there would be given full size drawn characters of a font (that typositor master would eventually be made from) -- and when there wasn't anything for them to do - they would \"invent\" new faces based on the old ones. That is how Ed Benguiat got ITC Benguiat. He had the \"guys\" play with Souviner... I'm sure the same thing happened with many other... original ... faces\n\n"
    },
    {
      "time": "5 Feb 2007 — 4:39am",
      "content": "\\>Oh there are those guys from the back room of Photolettering again.  \n???\n\nAvenir is from Adrian Frutiger.\n\n"
    },
    {
      "time": "5 Feb 2007 — 12:15pm",
      "content": "try ITC Lubalin Dan - it was created in the backroom...  \nas were so many ITC now classics...\n\n"
    },
    {
      "time": "5 Feb 2007 — 12:20pm",
      "content": "is that a good thing or a bad thing?\n\n"
    },
    {
      "time": "5 Feb 2007 — 12:24pm",
      "content": "Well it was a funny thing. There are some type designers who take credit for the typeface - when many of them were to keep the grunt workers busy...\n\nEd Benguiat would pull out (best example) Souvenir - and we are talking each letter on a 5\" x 8\" placard -- and give direction -- next thing you know Benguiat was born. According to the hands - Ed never touched the font - just gave verbal direction as to what he wanted to see. A few were pretty miffed when ITC put it out with the Benguiat name on it...\n\nBut this was all backroom stuff!\n\n"
    },
    {
      "time": "5 Feb 2007 — 1:16pm",
      "content": "Someone should do a book about those Photolettering artists before they're all gone (assuming that they aren't already).\n\n"
    },
    {
      "time": "5 Feb 2007 — 2:08pm",
      "content": "Dear Wonderful Union\n\nChristopher Bürke, the world’s leading authority on Futura, tells me that the slab equivalent of FUTURA would be BETON designed by Henrich Jost. I believe Linotype sell it, though I think without the single storey a.\n\nYours sincerely\n\nRandolph T. Burke\n\n"
    },
    {
      "time": "5 Feb 2007 — 4:45pm",
      "content": "Hey Randolph. Christopher Burke is an Englishman – so no need for that umlaut ; ) his name is spelt just like yours. Personally I thought Rudolf Wolf's [Memphis](http://web.archive.org/web/20150310071702/http:/www.linotype.com/1224/memphis-family.html) to be closer to Futura – if only for the single storey 'a', the range of weights and the near-contemporary date and place of its creation.\n\n_is that a good thing or a bad thing?_\n\nThe purists' argument here would be that if you can use Futura (as it's already defined by Demetre as part of the house style) why would you choose Avant Garde instead? In other words, go to the original source, not the derivative.\n\nAccording to Bringhurst, not only can Futura work for extended text setting, but one should (6.5.1) Start with a single typographic family and (6.2.3) Use what there is to best advantage.\n\n"
    },
    {
      "time": "6 Feb 2007 — 10:15am",
      "content": "If you are looking for a good companion for Futura, look to the structure of the letters.\n\nFutura is a highly geometric, Bauhaus-inspired and Art Deco-style letterform.\n\nBodoni is a serifed letter with a highly geometric form, and makes a good companion for Futura. I recommend ITC Bodoni, Berthold Bodoni Old Face or URW European Bodoni. Didot or Walbaum (Monotype Walbaum or Storm's Walbaum are the best choices here) are also good choices.\n\nAnother option is to choose a slab-serifed geometric font, such as Memphis, Beton or Rockwell.\n\nOther fonts from the Bauhaus and Art Deco eras are good options too, such as Erbar's Candida (an underrated and underused font) and Koch's Marathon (also highly underused and quite elegant).\n\nI hope these suggestions give you some good ideas.\n\nDavid Thometz\n\n"
    },
    {
      "time": "6 Feb 2007 — 11:21am",
      "content": "If you check back through Comm arts, about eight months ago Jon Hoefler wrote a pretty great piece on type pairings. I can't say for certain, but i think he addressed futura specifically and recommended using a Bodoni as well.\n\n"
    },
    {
      "time": "7 Feb 2007 — 2:33pm",
      "content": "Bringhurst also recommended Bodoni and Futura paired together.\n\n"
    },
    {
      "time": "7 Mar 2007 — 7:18am",
      "content": "The Face magazine used to run bodoni headlines with futura body (this being about 12 years ago. Worked well.\n\n"
    }
  ]
}
