{
  "id": "31130",
  "title": "Typophile anti-pixel badge",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m assembling a few badges to put on my blog, and I wanted a Typophile badge. Couldn’t find one, so I made one.\n\nThis uses the silkscreen typeface available at [Kottke.org](http://web.archive.org/), a widely used typeface for this use. I had to recreate the logo for 15 pixels because the favicon is 16 pixels and looks like poop when squooshed.\n\nAnyone else have a badge variation? Also, feel free to use this one if you want to represent.\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/typophilebadge_6112.png)\n\n [‹ Zune Logo](http://web.archive.org/web/20070911195043/http:/typophile.com/node/31213 \"Go to previous forum topic\") [What typeface is this? ›](http://web.archive.org/web/20070911195043/http:/typophile.com/node/31253 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911195043/http://typophile.com/user/12948\" title=\"View user profile.\">DanGayle</a>",
  "time": "<br>",
  "uid": "12948",
  "comments": [
    {
      "time": " 3.Feb.2007 11.34pm",
      "content": "Apparently on a white page it would do to have a black border... I’ll work on that.\n\n"
    },
    {
      "time": " 3.Feb.2007 11.38pm",
      "content": " ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/typophilebadge2_6204.png)\n\n"
    },
    {
      "time": " 4.Feb.2007 12.26am",
      "content": "I made some too. Based on yours.\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/typobadge1_5034.gif)\n  \n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/typobadge2_6188.gif)\n  \n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/typobadge3_5789.gif)\n  \n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/typobagde4_5318.gif)\n  \n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/typobadge5_4517.gif)\n  \n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/typobadge6_5479.gif)\n  \n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/typobadge7_4662.gif)\n  \n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/typobadge8_4469.gif)\n  \n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/typobadge9_5200.gif)\n\nDo Joe and Jared want these sort of things floating about? Does the PH need a pixel?\n\n"
    },
    {
      "time": " 4.Feb.2007 1.32am",
      "content": "Shouldn’t you ask J&J before posting these? The badges are sort of “floating about” already by virtue of introducing them here.\n\nHaving said that, I prefer Eben’s versions. I’m betting that in the Typophile® Brand Guidelines that reside in Joe/Jared’s heads, the T logo needs more space around it.\n\n"
    },
    {
      "time": " 4.Feb.2007 1.40am",
      "content": "It was a fight between 2px and 3px. I guess mine was a little too large-ish. Ah well.\n\nAnyway, since I know a ton of us have and use blogs, it would be nice, hint hint, to have an official badge. Hint hint.\n\n"
    },
    {
      "time": " 4.Feb.2007 8.07am",
      "content": "I am happy to wipe these out if j&j want. Or a moderator can. Either way. I used to work in pixel based art dept for video games so the temptation was too strong... And I think Dan has a point.\n\n"
    },
    {
      "time": " 4.Feb.2007 9.19am",
      "content": "Show us your blog!\n\n"
    },
    {
      "time": " 4.Feb.2007 10.25am",
      "content": "Hey, bring it on. If nothing else, we're open to the request for a badge and to your proposed designs.\n\nThe T is always intended to vary in the materials we've produced. It just happens that the block T works really well for the browser icon and has now taken over the page header. So, it's natural that the badge use the same T at this size.\n\nI think I prefer the solid red or solid gray rectangle (with subtle border) that Eben posted. It does look like the PH could use another pixel.\n\nAs an aside, this building in Boston took it upon themselves to remix the Typophile brand:   \n  \n [![](http://web.archive.org/web/20070911195043im_/http:/farm1.static.flickr.com/57/214133040_46dc5d5a38.jpg?v=0)](http://web.archive.org/web/20070911195043/http:/www.flickr.com/photos/zara/214133040/in/pool-typecon/)  \nCourtesy of Zara's flickr.\n\n"
    },
    {
      "time": " 4.Feb.2007 10.27am",
      "content": "And yes, give us a link to your bloggage.\n\n"
    },
    {
      "time": " 4.Feb.2007 12.47pm",
      "content": "Fixed the spacing, messed with the versions...\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/001_3816.gif)\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/002_5599.gif)\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/003_3992.gif)\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/004_3420.gif)\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/005_4644.gif)\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/006_3622.gif)\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/007_3791.gif)\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/008_4731.gif)\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/009_6426.gif)\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/010_3794.gif)\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/011_6185.gif)\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/012_3552.gif)\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/013_4077.gif)\n\n"
    },
    {
      "time": " 4.Feb.2007 1.34pm",
      "content": "Those updated ones look great! I still like the red box on grey version, but they all look stellar. Thanks!\n\nI gotta ask, how do you get that sleek almost 3d feeling with stuff so small? In fact, since you said you worked with pixels before, is there some kind of rules or guidelines for working with stuff so small?\n\nSince Thunderbird doesn’t have an official badge, but Firefox does, I tried to make to match it. It’s hard! Trying to get the logo to condense was the worst. At first I just shrank it down, but it looked like crap. Then I progressively shrank it in increments of 50% with bicubic sharper. That helped a lot. But how to get the _feel_ of the original, or of yours, is beyond me.\n\nAny suggestions?\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/ff2b80x15_3696.gif)\n\n ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/tbadge_4116.png)\n\n"
    },
    {
      "time": " 4.Feb.2007 2.00pm",
      "content": "My new blog is at\n\n[blog.dangayle.com](http://web.archive.org/web/20070911195043/http:/blog.dangayle.com/)\n\nUntil I can get the time to do up a theme for WordPress properly, I’m using a theme called BTNRB just to bee cheeky. Can you guess what BTNRB stands for?\n\n"
    },
    {
      "time": " 4.Feb.2007 3.14pm",
      "content": "Hmmm\n\nI don’t know. Do you mean the text or the shading? One way to suss out what happeing in a micro pixel thing you like is to zoom in close & check out what happening on a pixel by pixel basis. The gradient on some is just a gradient but made quite faint or subtle. The edge is just a sigle pixel line on the top & left 100% white dialed back to 45% or so and the bottom is 100% black dialed back to 20% or so. #6 has a trick hard pixel shadow. It’s on a dark red so it doesn’t read as what it is which is just hard black pixels. The last 3 are just 2 color... Having a pixel friendly logo helps as well of course. And you gave me a head start with those letters. I think if I was doing it for cash I might have done some subvisible pixel shading for the Y.\n\nThere used to be really intense pixel centered tools available in the game industry. They were insanely cool. Photoshop is great but it’s not pixel centered. Sometimes when I see the best pixel art I think ” I bet they have an old mac running studio 8 or studio 32...”.\n\nBTW You are right to work in steps of 50% exactly to maintain as much sharpness as possble. It will still suck - but less...\n\nSometimes you just have to start editing over the mush you make. Having a way to see what you are doing up close & at 100% very fast or at once is a huge help as well. Having vector art to scale can help too. The macromdia fireworks was allways more pixel aware than the Adobe tools were. Not sure why.\n\nWhat don’t you like about your thundrbird badge anyway?\n\nIt does seem like you don’t want to have both logos is such as small space perhaps. It makes it too hard I think. Or maybe have the logos side by side on the left & then let the words be unbroken on the right? Or is that two badges?\n\nIf so, the issue might just be that thunderbird’s logo doesn’t shrink well which is hardly your fault. Perhaps just keep the head, and then you can let the text be on one line? Then the head is bigger.\n\nActually I just went to your blog & I think your thunderbird bage looks quite good there! I am tempted to takle it all back!\n\n"
    },
    {
      "time": " 4.Feb.2007 9.39pm",
      "content": "Thanks! Did you figure out the BTNRB theme? It’s staring you right in your face. Bring Times New Roman Back. It obviously is in need of saving, so I thought it was a tad humorous to choose as a temporary theme.\n\n"
    },
    {
      "time": " 4.Feb.2007 11.19pm",
      "content": "That \\*is\\* funny. I actually laughed. I don’t understand the sentiment per se. But beauty is in the eye of the beholder... Cool.\n\nWhat’s the story with your icon? I keep thinking it’s teeth. Of a .... cloud? But then I think it’s a purple potato. And then I think it’s a jelly bean.\n\n"
    },
    {
      "time": " 4.Feb.2007 11.56pm",
      "content": "The theme’s creator was bemoaning the fact that people only use Georgia nowadays.\n\nAs to my avatar, I painted it a few years ago. It’s cropped down, but originally it was a flower. I normally paint non-objective art using the same watercolor technique. My old roomate asked me, “Why can’t you just paint something that people like. Like a flower or something?” And thus it was born.\n\nYour’s looks like a shrimp head or something.\n\n"
    },
    {
      "time": " 7.Feb.2007 6.14am",
      "content": "_Your’s looks like a shrimp head or something._\n\nThat’s what I thought it was...but I see you’ve changed it, Eben.\n\n"
    },
    {
      "time": " 7.Feb.2007 8.05am",
      "content": "Yeah, I thought I would use my square to show my latest - the monospace I am trying to finish ( was ’finnish’) off now.\n\n"
    },
    {
      "time": " 7.Feb.2007 3.49pm",
      "content": " ![](http://web.archive.org/web/20070911195043im_/http:/typophile.com/files/typoophile_6638.png)\n\n"
    },
    {
      "time": " 7.Feb.2007 4.29pm",
      "content": "Nice “typo”. ;^)\n\n"
    },
    {
      "time": " 7.Feb.2007 10.04pm",
      "content": "Eric’s cat fires more slowly now.\n\n"
    },
    {
      "time": " 8.Feb.2007 12.09am",
      "content": "ha! nice\n\n—————  \n**Paul Ducco**  \n [Design, Melbourne](http://web.archive.org/web/20070911195043/http:/www.solid-creative.com/motion.htm)  \n—————  \n [Little Mischief](http://web.archive.org/web/20070911195043/http:/www.littlemischief.com/)\n\n"
    }
  ]
}
