{
  "id": "31145",
  "title": "FEED-Mono",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hi\n\nHere's a monospace I'm working on. I wanted this face to be wider than most the monospace I'm used to work with. I expect this font to have UC, numerals, accents and punctuation. At the moment, only the UC are designed.\n\nComments and suggestions are welcome.\n\nThanks  \nRaphael\n\n ![](http://web.archive.org/web/20150123215428im_/http:/typophile.com/files/FEED-Mono_5784.jpg)\n\n| Attachment | Size |\n| --- | --- |\n| [FEED-Mono\\_020407.pdf](http://web.archive.org/web/20150123215428/http:/typophile.com/files/FEED-Mono_020407.pdf) | 7.25 KB |\n\n",
  "author": "Raphael Daudelin",
  "time": "4 Feb 2007 — 11:58pm",
  "uid": "16659",
  "comments": [
    {
      "time": "5 Feb 2007 — 1:45am",
      "content": "Cool. Reminds me of Eurostile, but less cold.\n\nHave you considered making the stems of the _M_ perfectly vertical?\n\nAlso, I think the lower bowl of the _B_, as well as the bowls of the _P_ and _R_, could stand to be a bit bigger.\n\n"
    },
    {
      "time": "5 Feb 2007 — 8:33am",
      "content": "I should try the vertical stems on the M.\n\nThough I really like the proportions of the R, I guess having a bigger lower bowl (B, P,and R) would help some spacing issues especially when P is next to A.\n\nI was also thinking of an alternate version that would have more personality, which is something I wanted to avoid at the very beginning. Here's A,K, and Q, alternate version. I guess the angular aspect of the A, and Q should be in V, X and Y too.\n\nThanks\n\n ![](http://web.archive.org/web/20150123215428im_/http:/typophile.com/files/FEED-Mono-Alt_3671.jpg)\n\n"
    },
    {
      "time": "6 Feb 2007 — 12:05am",
      "content": "This is really nice. I think the straights on the 'W' really help that usually troubled monospaced character.\n\n"
    },
    {
      "time": "7 Feb 2007 — 4:16pm",
      "content": "Something was bugging me in the S, here's the improved version.\n\n<cite>Have you considered making the stems of the M perfectly vertical?<cite></cite></cite>\n\nI thought of it but I won't do it. Since it's a monospace and that M is already wider than H the angle makes the spacing a lot better.\n\n ![](http://web.archive.org/web/20150123215428im_/http:/typophile.com/files/FEEDMono-S_4806.jpg)\n\n"
    },
    {
      "time": "7 Feb 2007 — 4:27pm",
      "content": "Much more even, good call.\n\n"
    },
    {
      "time": "7 Feb 2007 — 7:36pm",
      "content": "Your new S has a stronger and longer diagonal than the original S. Why is this better? Does it match the other letters in a better way? Not that I disagree, but I want to better understand what makes a good S. I find it a very difficult letter to design.\n\nI think the rest of the letters look quite nice.\n\n"
    },
    {
      "time": "7 Feb 2007 — 11:17pm",
      "content": "I like it. It feels like text from a tray on a boeing 727. Here are some ideas. What about dropping the cross bar of the A just slightly lower? What you have done to the S give it more charisma than the other glyphs have. Particularly the M & W. I am not sure how but perhaps you can spead some of that goodness around. I like the Alt Glyphs too.\n\n"
    },
    {
      "time": "7 Feb 2007 — 11:19pm",
      "content": "Dear sgh\n\nI'm not able to explain it in a rational way. To me type design has something really intuitive. I think that I tried to make the curves of the first S almost the same, probably thinking the result would be more coherent to all the other characters. What happened is that the first S was too rigid. In the new S, curve 1 is related to curve 4, while curve 2 is related to curve 3: the result is more fluent.\n\nI don't have the recipe of what makes a good S. Usually, my first sketches are always rolling forward or backward. But, what's important is: trust your eyes. If you're lost because your working at it for too long, put it aside and come back later or ask someone.\n\nI hope this comment helped.\n\n ![](http://web.archive.org/web/20150123215428im_/http:/typophile.com/files/FEEDMono-S2_6399.jpg)\n\n"
    },
    {
      "time": "7 Feb 2007 — 11:46pm",
      "content": "Thanks Eben\n\nYou were wright! I just dropped the cross bar of the A, makes it more open which is better, it will also help at smaller size. But I'm a little embarassed with your comment about the S. Though it's flattering, I wonder how this could spread to the M and the W. I'll keep it in mind.\n\nBTW, really appreciate your analogy to the tray on a boeing 727.\n\n ![](http://web.archive.org/web/20150123215428im_/http:/typophile.com/files/FEEDMono-A_6689.jpg)\n\n"
    },
    {
      "time": "8 Feb 2007 — 8:47am",
      "content": "Nice diagram!\n\nThe dropped bar is more typical of those boeing letters - or at least as I recall them.\n\nWhat you did with the S in part was to add tension I think. It could be that by adding a subtle curve to the M & W's straight lines you could add some tension there too. Did you adjust the B & C too in the example above? They look less heavy slightly & seem to have more tension. Or am I seeing things just because of the dropped bar?\n\nI don't know if anything I have done in the monospace I am aming can be of help or not. It's here:\n\n[http://typophile.com/node/29761](http://web.archive.org/web/20150123215428/http:/typophile.com/node/29761 \"http://typophile.com/node/29761\")\n\nAnd actually; I would love to have a critique from you as well.\n\n"
    },
    {
      "time": "8 Feb 2007 — 11:46am",
      "content": "<cite>Did you adjust the B &amp; C too in the example above?<cite></cite></cite>\n\nOnly the cross bar has been dropped.\n\n"
    },
    {
      "time": "8 Feb 2007 — 11:58am",
      "content": "Cool. That shows me how every detail in a type design effect every other one. Probably the slight difference in the rendering crispness confused me too.\n\n"
    }
  ]
}
