{
  "id": "31156",
  "title": "origins of question mark/exclamation mark/interrobang",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m doing a project at university about the development of the [interrobang](http://web.archive.org/web/20100108184656/http:/www.typophile.com/wiki/interrobang). So far I have found out who designed it etc, and that it is made up of a ? and !. Now I am trying to find out how the ! and ? came about. So far I have found that the ! developed from the latin ’io’, meaning ’joy’, but I can’t find any specific information about the question mark. I have found a couple of theories, one that says it developed from a ’Q’, and another that says it developed from a ’Q’ and an ’o’. Can anyone help me verify this? Or have I got my informatiuon completly wrong??!\n\nI would also like to find out how these letters (the i, o and q) developed and arrived in the alphabet, so if anyone knows any good sites for information that would be good! Although I am more stuck on the development of the ! and ?, so any information anyone has on those would be great please! (i have checked wikipedia btw! :) )\n\n",
  "author": "<a href=\"/web/20100108184656/http://www.typophile.com/user/16664\" title=\"View user profile.\">Hanr</a>",
  "time": "<br>",
  "uid": "16664",
  "comments": [
    {
      "time": " 5.Feb.2007 9.20am",
      "content": "Hello Hannah, you might find some of what you are looking for in [one of these threads](http://web.archive.org/web/20100108184656/http:/www.google.com/search?q=site:typophile.com%20interrobang). I’m sure this has been discussed before. Luck!\n\n"
    },
    {
      "time": " 5.Feb.2007 9.32am",
      "content": "thank u!!\n\n"
    },
    {
      "time": " 5.Feb.2007 10.26am",
      "content": "According to [_Why Cats Paint_](http://web.archive.org/web/20100108184656/http:/www.amazon.com/Why-Cats-Paint-Theory-Aesthetics/dp/1580087930/sr=8-1/qid=1170699810/ref=pd_bbs_sr_1/104-9205381-2838349?ie=UTF8&s=books), the question mark has its origins in Egypt, in a heiroglyph depicting the southern view of a northbound cat.\n\n(But keep in mind this book is a work of satire and not a scholarly text, no matter how hard it tries.)\n\n"
    },
    {
      "time": " 5.Feb.2007 10.28am",
      "content": "The usual theory on the question mark is that it evolved from a Q, latin for Questio... If you look at a swash Q, like Caslon, you will get the idea. I don’t know about the exclamation.\n\n"
    },
    {
      "time": " 5.Feb.2007 12.08pm",
      "content": "I did some research on this topic some years ago for my typography book. In the end I didn’t include any of these vague theories. So far there seems to be no bulletproof theory about the origin of question mark and exclamation mark. Which is of course surprising, since these signs are rather young compared to period, colon and so on.  \nThe origin in Questio and Io sounds reasonable, but I never saw any handwritten document from that time, that would support this theory. You can find some very old examples of the question mark in »Pause and Effect: Punctuation in the West«. The shapes are really remarkable and very different from our upright form today.\n\nRalf\n\n"
    },
    {
      "time": " 5.Aug.2007 9.09am",
      "content": "I’m convinced that interiectio is the word which was abbreviated into the modern exclamation point:  \n [http://textwrap.wordpress.com/](http://web.archive.org/web/20100108184656/http:/textwrap.wordpress.com/ \"http://textwrap.wordpress.com/\")\n\nIt makes more sense than io, which means something more like “hey!” in Latin.\n\nI remain unconvinced that the interrobang has legs. It was a nice idea, but it has hobbled along for years, unrecognized and unadopted by the public.\n\n"
    },
    {
      "time": " 6.Aug.2007 8.26pm",
      "content": "It’s been a while since I’ve looked at it, but doesn’t [Pause and Effect](http://web.archive.org/web/20100108184656/http:/www.amazon.com/Pause-Effect-Punctuation-M-Parkes/dp/0520079418/) (M.B. Parkes) cover both of these?\n\n"
    },
    {
      "time": " 23.Nov.2008 3.53pm",
      "content": "Pause and Effect may indeed cover this topic, and I’d love to read it and see, but I can’t spare 400+ dollars.\n\n"
    },
    {
      "time": " 27.Jan.2009 5.30am",
      "content": "The slanting of the stem as practiced in [Beneventan](http://web.archive.org/web/20100108184656/http:/en.wikipedia.org/wiki/Beneventan_script) writing (southern Italian hand, cultivated in the mother house of the Benedictine order at Monte Cassino) most probably contributed to the origin of the question mark.\n\n"
    },
    {
      "time": " 27.Jan.2009 10.30am",
      "content": "\\<\\< but I can’t spare 400+ dollars. \\>\\>\n\nLook around a bit.\n\nThere’s a copy on e-bay with a Buy It Now price of £66.75. Is that about $95 US? OOOPS, I see it says ten available.\n\nLook at AbeBooks.\n\nHeck: you can have mine for a c-note. send me a check.\n\npowers\n\n"
    },
    {
      "time": " 27.Jan.2009 11.42am",
      "content": "As I recall Doctor Evil’s father claimed that he invented the question mark...\n\n[http://en.wikipedia.org/wiki/Doctor\\_Evil](http://web.archive.org/web/20100108184656/http:/en.wikipedia.org/wiki/Doctor_Evil \"http://en.wikipedia.org/wiki/Doctor\\_Evil\")\n\n"
    },
    {
      "time": " 27.Jan.2009 12.11pm",
      "content": "Alessandro: _The slanting of the stem as practiced in Beneventan writing (southern Italian hand, cultivated in the mother house of the Benedictine order at Monte Cassino) most probably contributed to the origin of the question mark._\n\nThis slant was, in turn, derived from Greek writing. The influence of the Byzantine tradition in southern Italian Christianity persisted long after the schism. I recently heard a recoding of Beneventan liturgical chant, and more of it was in Greek than in Latin. And of course the Beneventan letter a is indistinguishable from a Greek alpha.\n\n"
    },
    {
      "time": " 27.Jan.2009 2.44pm",
      "content": "Thank you, John.\n\n"
    },
    {
      "time": " 27.Jan.2009 3.25pm",
      "content": "Actually Malcolm Parkes’ book was reprinted last September. You can get it directly from Ashgate for £67.50 (still not very cheap) [here](http://web.archive.org/web/20100108184656/http:/www.ashgate.com/default.aspx?page=637&calcTitle=1&title_id=10972&edition_id=3772).\n\nThe ? has been around in various forms ever since c. AD 800. It was also used as an exclamation mark before something different, more like ! first appeared in Italy in the late 14th c. None of these marks have anything to do with abbreviations, or the Beneventan script, to the best of my knowledge (I believe the slant mentioned above only refers to the stem of d, and there is nothing specifically Greek about that).\n\n"
    },
    {
      "time": " 27.Jan.2009 4.37pm",
      "content": "Marc: _I believe the slant mentioned above only refers to the stem of d, and there is nothing specifically Greek about that_\n\nAlessandro and I were not referring to the angled stem of the Beneventan d but to the angle at which the broad nib is held relative to the horizontal. In most western scripts, the angle is fairly close to 45 degrees, but in eastern scripts, including the Byzantine cursive Greek, it is steeper and, in some cases, may even rotate past the vertical. The Beneventan script is a kind of hybrid.\n\nI don’t know whether Alessandro is accurate in saying that the distinctive arrangement of thicks and thins in some question marks is derived directly from the Beneventan script. But I am confident that many of the characteristics of the Beneventan script are derived from those of Greek scripts with which the scribes of Monte Cassino were certainly familiar.\n\n"
    },
    {
      "time": " 28.Jan.2009 4.33am",
      "content": "John, sorry I got you wrong (I still think Alessandro meant what he said, i.e. angled stems, an idea he got from the Wikipedia article he links to). Still, Beneventan has a normal Latin pen angle and its letterforms are based on later Roman cursive. Bits & pieces of Greek occur within Latin texts in Beneventan manuscripts (F. Newton, The scriptorium and library at Monte Cassino 1058-1105, Cambridge 1999, p.198) but I can’t see Greek writing having any influence on the Beneventan script itself. Anyway, to move back to punctuation, Beneventan mss were rather late (11th c.) in adopting question marks at the end of sentences: before that they used special intonation marks on single words within the question. Of course medieval punctuation on the whole is about intonation rather than syntax. And it wasn’t done with the full breadth of the nib (apart from dots), rather with a light touch, hairlines from the corner of the nib and so on.\n\n"
    },
    {
      "time": " 28.Jan.2009 11.11am",
      "content": "Marc, I do not know who wrote the Wikipedia page mentioned, do you, I got my idea from Gerrit Noordzij’s “Letterletter.”\n\n"
    },
    {
      "time": " 28.Jan.2009 12.58pm",
      "content": "Interesting, I’ll have to read Letterletter over again, I love everything Noordzij writes, however far-fetched it can be on occasions. (But the WP page, apparently by a historian called Adam Bishop, is quite correct about the slanting stem — on d).\n\n"
    }
  ]
}
