{
  "id": "31150",
  "title": "Choosing the right weight: Text vs. Regular",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi guys:\n\nAssumptions: regular/normal [weight](http://web.archive.org/web/20150101203856/http:/typophile.com/wiki/weight) is slightly (but noticeably) lighter that text/book weight fonts. Regular/normal weight tends to look anemic and high contrast at text sizes.\n\nI assume that the text weight is suitable for longer passages of text, as in body text, and probably optimized for sizes 8-12 points.\n\nThen when is it appropriate to use the normal/regular weight in design work. What's it for?\n\nI ask this because of the way some FontFont packages are divided. Examples are Kievit 1 & 2, Milo 1 & 2, Max 1 & 2 and others. In these packages book/text and regular/normal are separated.\n\nSo what choice does the designer who may not have the money nor want the overhead of having both packages do?  \nIts not as simple as roman, italic, bold and bold italic.\n\nAnd then to make matters more interesting take a look a Emigre Vista. In the \"Love Letters\" catalog the sample texts are set in the regular weight. The book weight is actually lighter than the regular weight. Go figure.\n\nSo what is the intended function of regular/normal weight? And is the book/text weight really important?\n\nThanks for helping ( I need it ),\n\nMike Diaz\n\n",
  "author": "SuperUltraFabulous",
  "time": "5 Feb 2007 — 4:26am",
  "uid": "12479",
  "comments": [
    {
      "time": "5 Feb 2007 — 5:47am",
      "content": "I usually find \"book\" weights to be lighter than \"regular\" or \"normal\".\n\nI think normal is a stupid name for a weight anyway.\n\nIMHO there is so much variety in font styles/weights that you should go with what intuitively looks best, and the only way to figure that out is to print it on a high dpi printer. Clearly when a font has a \"display\" weight that is designed for larger sizes and headlines. I am frequently frustrated by the (seemingly) arbitrary way fonts are packaged, usually I want to mix and match but that's sometimes more expensive. As in, I'd rather have book and regular but maybe not light and bold.\n\n"
    },
    {
      "time": "5 Feb 2007 — 6:43am",
      "content": "This is also a question I wrestle with as a type designer. As far as things already on the market, there is no definitive answer. Frutiger has the best idea with his numbering system. You at least know which weight is bolder just from the number.  \nThe terms Regular, Normal, text, book, light are sometimes used interchageably and sometimes have a clear meaning. I have also seen book look lighter than regular in some families. Patty is right, you really have to look at samples set as text blocks to be able to make up your mind. Designers who have created cuts for specific uses are giving you the most help in chosing. Many of the larger superfamilies have a cut for text, subhead, caption, and display. The cuts are optically sized to fit the intended job. Often, it is not just lightness that changes, it is usually contrast, xheight, and width as well. A caption cut will be a bit bolder, more extended, higher xheight, and have a bit less contrast than a text weight.  \nAnother consideration is printing and paper stock. A more absorbent text paper may print a bit darker than a coated stock. Looking at a typical phone book page will give you the extreme.\n\nI wonder what the typical Typophiler would say about text vs. book weight? Maybe it is poll time?\n\nChrisL\n\n"
    },
    {
      "time": "5 Feb 2007 — 9:13am",
      "content": "One thing to keep in mind whenever you see _regular, text, book,_ and _normal_ suffix type weights is that **NOT ALL** type families or expanded weight families were conceived or developed as a whole package.\n\nMany revival families with book or text weights, as well as expansions to initial releases of digitized font families were added _afterwards_, sometimes years or decades later, often to correct or enhance design of _regular_ weight specifically for book/magazine publishing. The necessity to have additional weights often came as responses to market requirements.\n\nSince there are no standards associated with weight naming and actual type densitiy (not all text, book or regular weights are comparable to each other from type family to type family), you really have no way of determining what looks or works best for your projects other than testing the actual output. So follow what Patty and Chris suggest above and use your own judgement.\n\n"
    },
    {
      "time": "6 Feb 2007 — 9:44pm",
      "content": "Thank you all for your responses. I have been thinking of buying FF Milo- which is not on the cheaply priced side of the market. Its then necessary for me, as pointed out, to generate test prints to determine the suitable package.\n\nMikey :-)\n\n"
    },
    {
      "time": "6 Feb 2007 — 10:26pm",
      "content": "<cite>I wonder what the typical Typophiler would say about text vs. book weight? Maybe it is poll time?</cite>\n\nMy $.02  \nRegular is the roman weight of a font that just can't bring itself to be called Roman, often in a Sans that was never meant for body copy. Text is for setting long blocks of text as opposed to ad copy. Book often seems to mean that some foundry is milking a cash cow and churning out more weights of a font than are really necessary, ie. AG Buch.\n\n"
    }
  ]
}
