{
  "id": "31152",
  "title": "Compressed Didone serif, sort of…",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Back in May, a neat titling design showed up on the Type ID Board ( [http://typophile.com/node/20245](http://web.archive.org/web/20150419055345/http:/typophile.com/node/20245 \"http://typophile.com/node/20245\")). Not being a digital face, I drew some letterforms, and posted them there in June.\n\nNow I've come back to this. Here is a sample of some more of the letters; a PDF is also available below. (see also [http://www.typeoff.de/?p=125](http://web.archive.org/web/20150419055345/http:/www.typeoff.de/?p=125 \"http://www.typeoff.de/?p=125\"))\n\n[\n ![](http://web.archive.org/web/20150419055345im_/http:/typophile.com/files/v-test-web-001-big_6652.gif)\n](http://web.archive.org/web/20150419055345/http:/www.typeoff.de/?p=125)\n\n| Attachment | Size |\n| --- | --- |\n| [test 2 20070202.pdf](http://web.archive.org/web/20150419055345/http:/typophile.com/files/test%202%2020070202.pdf) | 33.92 KB |\n| [test 3 20070206.pdf](http://web.archive.org/web/20150419055345/http:/typophile.com/files/test%203%2020070206.pdf) | 25.61 KB |\n| [test 4 20070210.pdf](http://web.archive.org/web/20150419055345/http:/typophile.com/files/test%204%2020070210.pdf) | 15.59 KB |\n\n",
  "author": "dan_reynolds",
  "time": "5 Feb 2007 — 5:01am",
  "uid": "1085",
  "comments": [
    {
      "time": "5 Feb 2007 — 5:15am",
      "content": "Well done, Dan, that looks very promising!\n\n"
    },
    {
      "time": "5 Feb 2007 — 6:06am",
      "content": "Very promising!\n\nJust looking at the upper case now, I notice that the curve at the bottom of the B has a smaller radius than the others in the B. It might look better matching. Does the E need to be a hair narrower? The crossbar on the F slightly shorter? The bottom serifs on the C, J look a bit fat; they might be better matching the weight of the ELZ bottom spikes. Is the J a little too wide?\n\nThis is well on its way to being a very nice and useful display face.\n\n"
    },
    {
      "time": "5 Feb 2007 — 8:54am",
      "content": "This is a very interesting hybrid design - I'm seeing Didone, Eastern Europe, the RdR (love the nick on the \"el\") and Fenice. The \"a\" is a brave attempt, but the beak and the tail are fighting; that would give it a cool PoMo flavor, but no other glyph has such an attribute... I'd look at ITC Veljovic\\* and Sylfaen\\*\\* for ideas on the \"a\". Or maybe remove the beak entirely - yeah, I think that would pump up the elegance even more; although I might still make the tail a wedge.\n\n\\* [http://www.myfonts.com/fonts/linotype/itc-veljovic/medium/win-t1/190426/...](http://web.archive.org/web/20150419055345/http:/www.myfonts.com/fonts/linotype/itc-veljovic/medium/win-t1/190426/character/0061/CP2/1/ \"http://www.myfonts.com/fonts/linotype/itc-veljovic/medium/win-t1/190426/character/0061/CP2/1/\")\n\n\\*\\* [http://typophile.com/node/29571](http://web.archive.org/web/20150419055345/http:/typophile.com/node/29571 \"http://typophile.com/node/29571\")\n\nOther things:  \n- Love the caret.  \n- The \"J\" is too wide.  \n- Try harder with the \"Q\" (but keep it non-descending).\n\nhhp\n\n"
    },
    {
      "time": "6 Feb 2007 — 12:21am",
      "content": "Thanks for the feedback so far! I've attached a new PDF up top (test 3 20070206.pdf). Here are the changes inside:\n\n1. There are now two different a glyphs. The treatment of the lower-right portion differs slightly between them. There is also an alternate d for better comparison.\n\n2. Narrower J\n\n3. Lowercase s added\n\n4. The C has been lighted up a little bit (comparison – CJE)\n\n5. F – slightly shorter crossbar, which I have also moved down a notch\n\n6. Lowercase y added\n\n7. Two lowercase k variants added, each with different widths\n\n\\> _Try harder with the “Q” (but keep it non-descending)_  \nNot sure what I'm going to do here yet…\n\n"
    },
    {
      "time": "6 Feb 2007 — 9:26am",
      "content": "a/d: I'd go for the slightly upslanted tail (the second one). But if you go for the totally flat one on the \"d\", make the one on the \"a\" identical, not a wedge. And I assume the \"u\" will follow suit.\n\ns: I'm in love.\n\nE/F: Are you going for an apparent alignment of the bars? If so, the one on the \"F\" looks slightly lower. Personally I might \"break\" it and make the bar of the \"F\" noticeably lower (and probably a bit [more] shorter too).\n\nFlourished K/R: not working for me (especially the \"K\"). The \"J\" and single-flourish \"N\" seem passable, but only the double-flourish \"N\" is really singing I think. On the \"K\" and \"R\" maybe try loosening things up.\n\n2/3: charming. A bit too much tail on the \"2\" though.\n\ny: seems to be working, but let's see it in \"wyvern\".\n\nk: the narrow one seems better.\n\nQ: start the tail from the inside; maybe try splicing in one of those long serifs, like from the \"J\".\n\nJust noticed something bad in the \"r\": don't thicken the arch at the beak - make it like the \"a\".\n\nI'm not sure about the oval period.\n\nBTW the texture is very nice - just make the blank space smaller.\n\nhhp\n\n"
    },
    {
      "time": "6 Feb 2007 — 11:20pm",
      "content": "I keep reading the 'l' as 'ł'.\n\n- Lex\n\n"
    },
    {
      "time": "7 Feb 2007 — 5:47am",
      "content": "notes on the lower case:\n\nI think the bottom of the d looks best with the flat serif as it matchs the top of the ascender. And then the tail of the a would best match the d, as Hrant wrote.\n\nTo me the spur on the l is needlessly distracting. I think it might hurt the reception of an otherwise useful display face.\n\nThe r isn't working. Normally the join with the stem is lower on the r than the m and n, and the same weight at the junction. Here the high and heavy join is disharmonious. I don't know about the beak on the r, but I think the connection needs to be fixed first.\n\nThe g is going to be a challenge--maybe a one story will be the way out.\n\n"
    },
    {
      "time": "7 Feb 2007 — 8:15am",
      "content": "I don’t like the lowered diaresis.\n\n"
    },
    {
      "time": "7 Feb 2007 — 10:33am",
      "content": "The spike on the \"el\" is a mark of royalty (it was partly a -failed- copy protection scheme restricted to fonts produced under Louis XIV). Admittedly such historical sensitivity is essentially moot, and a good functional reason to have the spike (to disambiguate with the UC \"I\" in designs with double-serif tops on the ascenders, as in the RdR) is absent here\\*. But the spike is still: elegant; distinctive; and a great talking point, as Spiekermann has observed concerning the \"g\" in Meta. This sort of thing is pure gold in a display face - and it's not like we have a shortage of conventional Didones out there...\n\n\\* Although that didn't stop the Imprimerie Nationale from putting it in anyway:\n\n ![](http://web.archive.org/web/20150419055345im_/http:/typophile.com/files/CharlesX_3978.gif)\n\nBTW, concerning the \"el\" spike I saw something pretty shocking recently: it was actually present in some <cite>manuscript</cite> documents, from way before the RdR, possibly even before the invention of printing (in Europe). I have no idea why.\n\nI do have an idea about the \"y\" though: try a form that's a \"v\" with a descender going straight down (and curling) - like a \"j\". They used to do that back when, and not only does it looks classy and rarified but it helps spacing too.\n\nThe \"g\": especially if you keep the \"u\"-based \"y\" it might be smart to have a monocular form, but not making a binocular \"g\" also seems like a lost opportunity, even a cop-out. I would look to the funky \"g\"s in the old Didot fonts, like the ones JFP has revived.\n\nhhp\n\n"
    },
    {
      "time": "10 Feb 2007 — 11:06am",
      "content": "I've posted a new two-page file above, named \"test 4 20070210.pdf\"\n\n ![](http://web.archive.org/web/20150419055345im_/http:/typophile.com/files/test-20070210-u-and-lc_3420.jpg)\n\nI just love the l-spike. I know that it isn't necessarily appropriate, but this is a remix of styles anyway, and maybe it'll be able to add something. In the font's newest version, I have two l-glyphs… a \"normal\" l and the spike l.\n\nThis version has a draft at a complete lowercase. There are currently two g glyph test: a single and double-storey g.\n\nHrant, my first go at a lowercase y was a v with a tail, just like you recommend. It didn't work. But I will try again anyway.\n\nThe period is now round.\n\nBill: there the lowercase r is new in this version.\n\nLari: _I don’t like the lowered diaresis._  \nDon't worry. It will just be an alternate in the end. Otherwise, it wouldn't match all the other diacritics. But old German metal type almost always had cap umlauts differently than the dieresis is now positioned. This alternate lowered version will have uses.\n\n"
    },
    {
      "time": "10 Feb 2007 — 11:43am",
      "content": "Nice improvements, like in the r. (Could it be just a bit narrower?) I do think your single story g works better with this design. To me the only thing that doesn't work is the y. With the j and the g the same, particularly, it doesn't look 'y' enough. Does a diagonal version with a horizontal serif at the bottom not work? I don't have any bright ideas if that doesn't work, but to me its the only bit that doesn't work. Everything else works, though I think further tweaking can make it smoother.\n\n"
    },
    {
      "time": "10 Feb 2007 — 2:54pm",
      "content": "The binocular \"g\" is completely out of character; it's from a different century and a different continent. But I still think you can make a fitting one. The monocular \"g\" is balanced and stylistically harmonious, but it's a missed opportunity. One place to start looking for a good binocular \"g\" is the \"a\"; another is the \"s\".\n\nSeeing the conventional \"el\", I can think of another reason to keep the spiked one: the \"el\" is the poorest letter of the Latin alphabet, needing by far the most help in contributing something useful and memorable to text.\n\nI agree with William that the \"r\" should be narrower.\n\nMore on lc:  \n- I'd make the eye of the \"e\" smaller.  \n- The \"f\" is not very attractive, but maybe a good form in context.  \n- Why not make the left foot serif of the \"k\" double-sided?  \n- In the \"k\", the join is looking neither here not there: there's too much going on for this type of design. I might make the top arm continue to the stem, and have the leg come out of it, or come out of the join, one or the other, clearly.  \n- The bar of the \"t\" could be shorter on the right.  \n- In the \"x\", the thin arms are flared differently to distraction.  \n- There seem to be some funny decisions about foot serif lengths: a longer right side makes sense in the \"f\" and \"r\", but it clearly doesn't in the \"el\", and in this design probably not the \"p\" and [left side of] the \"q\" either. In this last pair if you do keep one side longer, I'd make the left head serif of the \"d\" longer as well.\n\nMore on UC:  \n- The vertical stem in the \"G\" should be taller, possibly even reaching the bars of the \"E\"/\"F\".  \n- The \"T\" should be wider.  \n- In terms of cap widths, there's something unsettling about the decisions of what to make narrow and what to make wide; I can't entirely put my finger on it, but for example looking at the sequence \"HAMB\" I'm seeing a lot of confusion.\n\nhhp\n\n"
    }
  ]
}
