{
  "id": "31172",
  "title": "Sackers Heavy Roman for logo? - companion fonts?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi all;\n\nI'm a product designer going for another degree in graphic/communication design. Forgive me if I'm slightly behind the curve -- I'm trying to learn a lot at once and am taking it all very seriously. Although I've been working with type/graphics for years I am now trying to be more rigorous about my choices.\n\nI'm working on a logo and graphic standards for a small NYC branding firm who does projects from very hip to very square (art to corporate). I keep coming back to Sackers Roman as a foundation for their logo/ID work. I think it's a beautiful typeface and the company does have a sort of eclectic/vintage-meets-modern/cool vibe about them.\n\nMy question is whether there are other typefaces which are not quite so 'old fashioned' as Sackers -- perhaps a newer typeface that would be more appropriate for titling and larger text/words/logo. Or are people of the opinion (and I know there are many) that there's a basic elegance to the old faces that trancends the vintage signifiers. Bottom line is that I just don't want to be too 'costumey' if you know what I mean.\n\nSecond question, is if I do use Sackers Heavy Roman, what is a good companion face for body text? I am imagining something like Trade, although again, I wonder if the Sackers/Trade thing is going to make everything feel to 'vintage'?  \nAny thoughts would be appreciated. And please be gentle, I've been beaten to a pulp over on DPReview forums for posting as a novice.\n\nMany thanks.  \nRem.\n\n",
  "author": "remy",
  "time": "5 Feb 2007 — 7:07pm",
  "uid": "16677",
  "comments": [
    {
      "time": "6 Feb 2007 — 8:48am",
      "content": "I love Sackers Gothic too. I might consider a serif font as an accompaniment. I've actually recently paired it with Mrs. Eaves and that is a beautiful combo.\n\nBeaten to a pulp? That isn't right.\n\n"
    },
    {
      "time": "6 Feb 2007 — 9:12am",
      "content": "Thanks so much - I love that idea - I love Mrs. Eaves - in fact it was one of the faces I have on my list. I love the Priori family too, although I think it might be a bit much to do a Priori Serif / San Serif combo.\n\nJust incidentally, can someone articulate what makes Mrs. Eaves such a lovely face?\n\n"
    },
    {
      "time": "6 Feb 2007 — 9:35am",
      "content": "Ah you'll never get a consensus here. I love the letterforms, and especially the italic, but also recognize it's limitations as a text font, due to it's small x-height and general width. You'll find a lot more info and opinions in these threads.\n\n[http://typophile.com/node/687](http://web.archive.org/web/20141016185544/http:/typophile.com/node/687 \"http://typophile.com/node/687\")  \n [http://typophile.com/node/20391](http://web.archive.org/web/20141016185544/http:/typophile.com/node/20391 \"http://typophile.com/node/20391\")  \n [http://typophile.com/wiki/Mrs%20Eaves](http://web.archive.org/web/20141016185544/http:/typophile.com/wiki/Mrs%20Eaves \"http://typophile.com/wiki/Mrs%20Eaves\")\n\n"
    },
    {
      "time": "6 Feb 2007 — 11:07am",
      "content": "Sackers heavy roman as headline text (ie, as in the title of a paragraph - set 20pt)-- is it bad form to use another serif font on the same page as body copy or a smaller headline? In other words, is Sackers Roman so distinctive that it sort of ruins the chance for any other serifs to live on the same page?\n\n"
    }
  ]
}
