{
  "id": "31194",
  "title": "Help! I received this inquiry...",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "This isn't the first time somebody has asked to redistribute one of my free fonts, but something struck me as a little bit different here. Might anyone have suggestions on how I should deal with it? I've granted generous licences for minimal compensation before to a couple small game developers (since the fonts are free already I just asked for some copies of the games) but this outfit seems in a different sort of position. I'm not sure what it is exactly, but it feels different.  \nThis inquiry is specifically about my font [Bolonewt](http://web.archive.org/web/20131015181607/http:/www.1001fonts.com/font_details.html?font_id=2585).\n\n<cite>Hello from good old germany ;)</cite>\n\nWe are developers of a photobook solution, that we license to digital  \nprinting houses.  \nOur photobook client is installed more than 100.000 times in germany,  \nand  \neven in Israel.  \nWe want to include some new fonts in the next version of our client, so  \nwe  \nare searching  \naround for some public domain or freeware fonts we can include in our  \nsetup.\n\nWe found your webpage and find some of your fonts very useful for our  \nphotobook client.  \nWould it be possible, that we can include some of your fonts in our  \nphotobook client and  \nredistribute them with the setup?  \nThe photobook software is always freeware for the end user. We do not  \nmake  \nany money  \nwith the the download or installation of the photobook client.\n\nIt would give us great pleasure if we can use some of your fonts. Of  \ncourse  \nwe will credit  \nyour fonts/webpage in the help file of the software.\n\nBest regards  \nThomas Bauer\n\n\\_\\_PRINTAHEAD - digital print  \nsolutions\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n[www.minibits.de](http://web.archive.org/web/20131015181607/http:/www.minibits.de/ \"www.minibits.de\")  \n- softwareentwicklung - webengineering - consulting -\n\n",
  "author": "cuttlefish",
  "time": "6 Feb 2007 — 9:26am",
  "uid": "14556",
  "comments": [
    {
      "time": "6 Feb 2007 — 12:12pm",
      "content": "But do they make money from the other end? Once installed is it like iPhoto where you can make calendars and booklets which you must purchase? I'm being skeptical, but it seems to me what your fonts will be used for are probably where they make there money. Am I wrong?\n\n"
    },
    {
      "time": "6 Feb 2007 — 6:00pm",
      "content": "I'd ask for a pointer to a demo, where you can see what value your fonts might add to their application. Maybe ask for names of other freeware designers who have given up their fonts, and contact them for their thoughts.\n\nCheers, Si\n\n"
    },
    {
      "time": "6 Feb 2007 — 10:44pm",
      "content": "I'd ask for a little more than minimal compensation. It sounds like it's a moneymaking proposition for them, and I don't get the sense they're being completely upfront when they say they make no money on the client. While technically true, no doubt they're counting on the \"atttach rate\" to sell printing and/or services.\n\nBest of luck!\n\n"
    }
  ]
}
