{
  "id": "31193",
  "title": "Martin Majoor",
  "forum": "Home",
  "tags": [
    "Type Designer",
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20131018040444/http:/typophile.com/wiki/Indices) : [Designers](http://web.archive.org/web/20131018040444/http:/typophile.com/wiki/Designers) : Martin Majoor**\n\nMartin Majoor has been designing type since the mid-1980s. After a student placement at URW in Hamburg, he started in 1986 as a typographic designer in the Research & Development department at Océ-Netherlands. There he carried out research into screen typography and worked on the production of digital typefaces for laser printers.\n\nIn 1988 he started working as a graphic designer for the Vredenburg Music Centre in Utrecht, for whom he designed the typeface Scala for use in their printed matter. Two years later FSI FontShop International published [FF Scala](http://web.archive.org/web/20131018040444/http:/typophile.com/wiki/FF%20Scala)™ as the first serious text face in the then-new FontFont-Library. In 1993 FF Scala was augmented with a sans-serif version, FF Scala Sans, which was also released by FSI. In the eyes of the designer the sans and the serif versions complement each other admirably. They follow the same principle of form but are two distinct designs. The second largest newspaper in Holland (Algemeen Dagblad) used both FF Scala and FF Scala Sans for text and headlines and is a good example of how the two families can work together.\n\nIn 1994 Majoor started working on the design of the Dutch telephone directory, for which he did both the typography and, more importantly, created a new typeface. The face is called Telefont and comes in two weights: Telefont List and Telefont Text. The Dutch phone company PTT Telecom holds exclusive rights to both fonts.  \nPerhaps as a reaction to the very formal work on the phone books, Majoor designed FF Scala Jewels in 1997, a quartet of classic decorative typefaces based on the capitals of FF Scala Bold.\n\nMajoor’s third major typefamily, [FF Seria](http://web.archive.org/web/20131018040444/http:/typophile.com/wiki/FF%20Seria)™ was released in 2000. It consists of a serif version and a sanserif versions. In 2001 it was awarded a \"Certificate of Excellence\" from the ISTD International TypoGraphic Awards 2001 in London and a \"Certificate of Excellence in Type Design\" from the ATypI Type Design Competition \"Bukva:raz!\" in Moscow. In 2006/2007 Majoor worked together with Pascal Zoghbi, who designed Sada, the Arabic counterpart for Seria. It was published in the book ‘Typographic Matchmaking’\n\nThe [FF Nexus](http://web.archive.org/web/20131018040444/http:/typophile.com/wiki/FF%20Nexus)™ family (2004) has three versions (a serif, a sanserif and a slabserif), that are all 'connected'. There is also a typewriter versions and two sets of elegantly drawn swash capitals. It was one of FontShops first OpenType® fonts and two years later it won the first prize at the Creative Review Type Design Awards 2006, in the catagory Text Families.\n\nMajoor taught typography at several Schools of Arts and since 1992 he gave lectures at conferences in Budapest, Antwerp, Paris, San Francisco, Barcelona, The Hague, Berlin, Prague, Warsaw and Stockholm. His work was exhibited in Rotterdam, New York, Paris, London, Berlin, Capetown, Helsinki, Barcelona, Bologna and Ontario. He wrote articles for magazines like Items, 2+3D and Eye. He works as a graphic designer and type designer in both The Netherlands and Poland.\n\n**Typefaces**  \n [FF Scala](http://web.archive.org/web/20131018040444/http:/typophile.com/wiki/FF%20Scala)  \n [Telefont](http://web.archive.org/web/20131018040444/http:/typophile.com/wiki/Telefont)  \n [FF Seria](http://web.archive.org/web/20131018040444/http:/typophile.com/wiki/FF%20Seria)  \n [FF Nexus](http://web.archive.org/web/20131018040444/http:/typophile.com/wiki/FF%20Nexus)\n\n**External Links**\n\n[http://www.martinmajoor.com/](http://web.archive.org/web/20131018040444/http:/www.martinmajoor.com/ \"http://www.martinmajoor.com/\")  \n [http://www.typotheque.com/articles/my\\_type\\_design\\_philosophy.html](http://web.archive.org/web/20131018040444/http:/www.typotheque.com/articles/my_type_design_philosophy.html \"http://www.typotheque.com/articles/my\\_type\\_design\\_philosophy.html\")\n\n",
  "author": "Stephen Coles",
  "time": "6 Feb 2007 — 9:20am",
  "uid": "103",
  "comments": [

  ]
}
