{
  "id": "312",
  "title": "20 typefaces to start a designers career",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am in the process of purchasing a number of type licences for a London University. The idea is to limit the number of typefaces available for design students enabling them to be familiar with around 20 families.   \nRather than pick them myself I would like to have a broad input into the final pickings.   \nPlease could you post typefaces that you personally feel are indispensable to the modern designer.Ideally you could list your top 20. i will be posting a chart of deigners top 20 typerfaces on [www.fatears.co.uk](http://web.archive.org/web/20150403154148/http:/www.fatears.co.uk/) in the near future. Andy wall\n\n",
  "author": "andywall",
  "time": "9 Jun 2003 — 9:29am",
  "uid": "1914",
  "comments": [
    {
      "time": "9 Jun 2003 — 1:17pm",
      "content": "MetaPlus (FontShop)   \nHelvetica Neue (Adobe)   \nMrs. Eaves (Emigre)   \nGotham (Hoefler Type Foundry)   \n20th Century (Monotype)   \nBase (Emigre)   \nAgency (Font Bureau)   \nSimian (House Industries)   \nAgenda (Font Bureau)   \nOCR-B (Adobe)   \nFormata (Adobe)   \nCaxton (Adobe)   \nScala Sans (FontShop)   \n   \nThese are my favorite \"useful\" fonts. A mix of display and text fonts. There are far more that I use regularly, but mostly because of specific client requests.\n\n"
    },
    {
      "time": "9 Jun 2003 — 3:29pm",
      "content": "since you said _starting_ a design career, I would first   \nprocure the classics. a collection including full families of   \nstrong old style, transitional, modern (though I never   \nuse them), grotesk, egyptian, and humanist typefaces   \nwould provide you with a lot of possibilities. for the   \nsake of contemporaneity, you might throw in a few   \nrecent designs such as the aforementioned Gotham or   \nScala Sans/Serif (or Seria for more delicate work).   \nexpand any of the catagories according to taste and   \nyou have a highly versatile library.\n\n"
    },
    {
      "time": "9 Jun 2003 — 9:32pm",
      "content": "Just 20 families? Heartless.   \n   \nThese are always loaded:   \n   \nAdobe Garamond   \nGoudy   \nthe aforementioned Helvetica Neue   \nUnivers   \nFutura   \n   \nFrutiger, Bodoni, Cheltenham, Meta, Caslon and Clarendon I return to often enough to qualify as can't-live-without's. Obviously we haven't updated the library in a while but still, I can't see how anyone can not have these guys.   \n   \nOut of curiosity, are there any worthwhile scripts out there?\n\n"
    },
    {
      "time": "10 Jun 2003 — 2:04am",
      "content": "hmmm, this is what I should consider:   \n   \nAkzidenz Grotesk BQ   \nUnivers   \nFrutiger Next (or Avenir?)   \nToday Sans (or Syntax / Gill Sans?)   \nThe Sans   \nTrade Gothic (or News Gothic/Vectora?)   \nFutura   \nMinion   \nPalatino   \nBerthold Baskerville (or Storm's John Baskerville / Monotype Bulmer)   \nFilosofia   \nLexicon nr2 ($$$)   \nOfficina Sans & Serif (or the FF Info series)   \nAdobe Caslon   \nBembo (or HTF Requiem)   \nStempel Garamond   \nJoanna (or Scala?)   \nClarendon (or Giza?)   \n   \nand another two...   \n   \nI'm sure I forgot some important ones, and maybe some that are more contemporary...   \nThere's a whole lot of choice out there... ![:-)](http://web.archive.org/web/20150403154148im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "10 Jun 2003 — 6:09am",
      "content": "Funny, nobody's mentioned Comic Sans yet.   \n   \n;)\n\n"
    },
    {
      "time": "10 Jun 2003 — 6:25am",
      "content": "I was waiting for that!   \n   \nFont Diner's Sparkly (which I love, incidentally) seems to have crept into an awful lot of arsenals... I guess it would be wise to include some retro stuff.\n\n"
    },
    {
      "time": "10 Jun 2003 — 6:59am",
      "content": "Just don't take Frutiger Next, take the original Frutiger or Myriad. The Next version is so bad.\n\n"
    },
    {
      "time": "10 Jun 2003 — 8:33am",
      "content": "Hmm, what's so bad about Frutiger Next, J-F?   \nThe new italics look too much like Myriad, but   \nis it enough to say that it is such a bad thing?\n\n"
    },
    {
      "time": "10 Jun 2003 — 8:48am",
      "content": "_Out of curiosity, are there any worthwhile scripts out   \nthere?_      \n   \nAdobe's Bickham is an elegant design, and well   \naccompanied by beginnings, endings, and flourishes.   \n   \nJFP, I would also be interested in your thoughts on   \nFrutiger Next. I haven't had the opportunity to look it   \nover, but I was hoping it would be a well executed   \nupdate to the family. this might constitute a new   \nthread, but it is certainly relevant to basic type library   \nconcerns.\n\n"
    },
    {
      "time": "10 Jun 2003 — 8:56am",
      "content": "start a new topic to explain more! in two words: bad widths, bad spacing, strange letterforms, etc.\n\n"
    },
    {
      "time": "10 Jun 2003 — 11:24am",
      "content": "Personally, I prefer Monotype's 20th Century to Futura in every respect. I'd recommend that over Futura any day.\n\n"
    },
    {
      "time": "10 Jun 2003 — 12:21pm",
      "content": "20th Century is _so_ last millennium, don't you know?   \n   \n(Sorry.)\n\n"
    },
    {
      "time": "10 Jun 2003 — 4:55pm",
      "content": "You know, I'm not sure I can think of 20 typefaces that I would recommend as a beginning library. Once you get beyond a small number of solid text faces and a couple of good titling and sans serif designs, you quickly get into that area in which the right typeface to have is the right typeface for a particular project. Take script faces, for example: I can suggest a number of good ones, _i.e._ types that are well designed and executed, in a variety of different styles, but I don't think any of them necessarily belong in a beginner library because each tends to be particularly suited to such a narrow range of work.   \n   \nOn the seriffed text typeface front, I would suggest selecting one example from each of the major historical styles: one Venetian, one French renaissance, one Dutch oldstyle, one neo-classical, one romantic, etc. I would try to avoid the more obvious choices, _e.g._ Mardersteig's Dante instead of Bembo, Monotype Bullmer instead of Baskerville.\n\n"
    },
    {
      "time": "11 Jun 2003 — 10:23am",
      "content": "i think 20 type faces is perfect. this is what i tell my class to begin with. the idea that you need hundreds of typefaces is ridiculous. when i was in school i had thousands upon thousands of bad typefaces. i hoarded anything i could get. this only helped confuse me when it came to choosing an appropriate face. it was a breath of fresh air to just delete them all off my hard drive. i only use about 10 or so at any moment in my career. type can be tricky and hard to deal with. it is best to have fewer faces and understand the ins and outs of each one. this is the only way one can expect to master a typeface and type in general.   \n   \ni think it is also important to avoid display faces. these can be made individual depending on the project and current aesthetic. i make all of my own display faces or i am at least very picky about a display face made by someone else. no matter how trendy and cool the display face is you will look back in 10 years and think to your self \"what the hell was i thinking\"   \n   \nanyway here is the list of classics i use.   \n   \nakzidenz grotesk bq   \nhelvetica neue   \navenir (or futura, both are geometric sans, i prefer avenir)   \nfrutiger   \ntrade gothic   \nfranklin gothic   \noptima   \nbodoni (or didot but not filosofia)   \nadobe garamond   \nadobe caslon   \nminion   \nhoefler   \ndante   \nsabon   \nperpetua   \nrequiem (or bembo)   \ncentaur   \nclarendon   \nshelly (or snell roundhand)   \nfette fraktur (or goudy text)\n\n"
    },
    {
      "time": "11 Jun 2003 — 10:54am",
      "content": "In no particular order   \n   \n01 \\> Neue Helvetical   \n(it's a classic and still modern)   \n   \n02 \\> FF DIN   \n(I really really really love the facelessness of this font, sorry)   \n   \n03 \\> Clarendon   \n(It's so brutal and primitive, I love it -- Belizio is nice as well)   \n   \n04 \\> Thesis Sans   \n(THE perfect Corporate Font, a must have. I love Luc(as) work)   \n   \n05 \\> Garamond Pro OTF or NeueSabon   \n(Best for setting text. GaramondPro is such a nice redesign, and NeueSabon, although not a Sabon, imo, is a verrrrry nice Garamondesque typeface as well, wish I had the $$$ to buy it.)   \n   \n06 \\> Myriad Pro OTF   \n(Great alternative to all those Frutigers, Helveticas and Akzidenz... and the OTF multilangual functionality is beautiful. Great font.)   \n   \n08 \\> Mrs Eaves OTF   \n(Sooooo cute. So cute. Sooooooooo cute)   \n   \n09 \\> FF OCR or FF Letter Gothic   \n(For those cool and mechanical designs. Not as cold as the originals, but more versatile)   \n   \n10 \\> Rotis Sans or SemiSans   \n(Jeez, I hat the Rotis, but when learning typography there is no way around it -- and it still looks nice for many designs that try to be clean and efficient.)   \n   \n11 \\> Futura   \n(Overused, yeah, but you gotta have it. Lovelovelove the Caps. Instant Warmth, somehow.)   \n   \n12 \\> Scala   \n(Very nice font - legible yet different. Quadraat would be solid as well. The Scala Sans is a nice alternative to the ThesisSans, more quirky yet not as monstrously complete...)   \n   \n13 \\> TAZ III OTF   \n(De Groot is a monster, this font rocks. Again, wish I had the money right now. Great stuff.)   \n   \n14 \\> Univers   \n(Classic. And nice to play with. Look at Emil Ruders work with that single font -- amazing).   \n   \n15 \\> Bauer Bodoni   \n(Must-have-classicism for your students. And great to play with in Display-size)   \n   \n16 \\> Franklin Gothic or Bureau Grotesque   \nThe strong and strudy workhorses. Also, you can use Franklin to let your students do a bit Brodyism.   \n   \n17 \\> Bell Gothic or Interstate   \nLooking modern yet not too modern. Nice for Corporate stuff, although lacking in some departments (Caps, Ligaturs, OSFs). Both nice because of their not-too-cold-coldness. Used ALL-CAPS-Bell for a CD just some months ago, it just was perfect.   \n   \n   \n18 \\> Jenson Pro OTF or Warnock Pro or Kepler   \nMore older-looking quirky text-fonts. OTF rocks.   \n   \n19 \\> Thesis Serif or Thesis Mono   \nThe serif is just beautiful for short texts, the Mono has a more lively approach to the coldness of OCR and Letter Gothic.   \n   \n20 \\> Zapfino CD   \nwonderful Toy. Next best thing to being a calligraphic genius yourself :-D. (Which, alas, I ain't)   \n   \nAnd a whole buch of those endless TTF-Freefonts available on the net, just to have some plain fun with (which is why some\n\n"
    },
    {
      "time": "11 Jun 2003 — 11:03am",
      "content": "Here's my list of 20:   \n   \nMinion Pro   \nMyriad Pro   \nSabon Next   \nMonotype Baskerville (or Berthold)   \nHTF Didot   \nPerpetua   \nMonotype Gill Sans   \nBerthold Akizidentz Grotesk   \nThesis Sans   \nSwift   \nITC Charter   \nFF Meta   \nPMN Caecilia   \nAdobe Caslon Pro   \nFB Miller   \nAdobe Syntax   \nITC Franklin Gothic   \nBitstream Futura   \nMonotype Bembo   \nSnell Rounhand   \n   \nMaybe this is my wish list... I only have five of these myself. I tried to be as unbiased as possible. These are mostly text typefaces, except Snell Roundand (which I think is the best copperplate script ever created!). It's difficult to include display typefaces in a list of just 20.\n\n"
    },
    {
      "time": "11 Jun 2003 — 11:14am",
      "content": "Incidentally, Andrew, you should look into Adobe's Type Classics for Learning. It has most of the OpenType Pro fonts in it: Caslon, Garamond, Jenson, Minion, Myriad, Warnock, Utopia... plus other extremely useful fonts from Adobe. Very good value. I bought it just before I graduated! It's only a 1 computer license though, but I think you could get site licenses for the school.   \n   \nURL:   \n [http://www.adobe.com/education/ed\\_products/typeclassics.html](http://web.archive.org/web/20150403154148/http:/www.adobe.com/education/ed_products/typeclassics.html)\n\n"
    },
    {
      "time": "11 Jun 2003 — 11:31am",
      "content": "get a hold of the 1000 crazy truetype typefaces CD or anything free you can find on the net. almost anything with the precursor 100% fun and free would be great for teaching students the real value of type. when it comes right down to it the only typefaces worth buying are minstrel, brush script or comic sans. \\<joke\\>\n\n"
    },
    {
      "time": "11 Jun 2003 — 11:42am",
      "content": "I don't feel comfortable with the idea of students downloading free fonts off the 'net for their projects. More often than not they end up using something really badly made without even realizing that it is not a 'professional quality' font. It's dangerous. It's such a bad influence for them because they'll end up thinking that fonts are free and anyone can make fonts. Not a good idea. Though I think it's also a typography instructor's duty to teach their students how to discern the differences between well and badly made typefaces, and about the legalities of typeface licensing.\n\n"
    },
    {
      "time": "11 Jun 2003 — 11:44am",
      "content": "Sorry, Jay, I guess you were being sarcastic about it!\n\n"
    },
    {
      "time": "11 Jun 2003 — 1:04pm",
      "content": "yeah, i was kidding... sorry, i just could resist\n\n"
    },
    {
      "time": "11 Jun 2003 — 2:24pm",
      "content": "\\> Once you get beyond a small number of solid text faces and a couple of good titling and sans serif designs, you quickly get into that area in which the right typeface to have is the right typeface for a particular project.   \n   \nSmart analysis.   \n   \n--   \n   \n\\> this is what i tell my class   \n   \nYou have a _class_?!   \nI'm not sure if I'm encouraged, or scared. ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "11 Jun 2003 — 11:47pm",
      "content": "if you are speaking to me hrant. the answer is yes in fact i do teach a class. and i have taught for a while now. fear for them.\n\n"
    },
    {
      "time": "12 Jun 2003 — 1:32am",
      "content": "I think everyones comments are very helpful. i think the one point I have to clarify is that we are talking about 20 typefaces that a designer should know as part of their job. Many graduate designers have not yet came to grips with more than, say,5 typefaces. The idea here is to push students into using a limited number of type designs, during certain projects, and see how their typographic awareness increases along with their knowledge of the '20 typefaces'. Ive already included comic sans, minstrel and brush script so there is no need to include them in future post! ;) On leaving university they should be able to identify each of the designs, and be able to adjust their use according to the project. Its OK to have a favourite type design, but worrying when they try to use it for the wrong job!\n\n"
    },
    {
      "time": "12 Jun 2003 — 2:02am",
      "content": "Hmm...   \n   \nBembo   \nCentaur   \nStempel Garamond   \nCaslon 540   \nPalatino   \nElectra   \nMinion   \nBauer Bodoni   \nClarendon   \nOptima   \nFutura   \nAvenir   \nFranklin Gothic   \nAkzidenz Grotesk   \nUnivers   \nDIN 1451 / Mittelschrift   \nScala   \nOfficina   \nShelley Script   \nWilhelm Klingspor\n\n"
    },
    {
      "time": "13 Jun 2003 — 10:26am",
      "content": "We are talking families, yes? Not just faces? This is impossible. So I would think of this as my \"first\" twenty as a student. I didn't even get a \"real\" scotch or transitional! The tragedy!!   \n   \n ![:-)](http://web.archive.org/web/20150403154148im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nSERIF Sabon Next ITC Bodoni (et al, 6, 12, 72) HTF Didot Gulliver Le Monde Courrier Tyfa Le Monde Livre Classic Walbaum Text Quadraat   \n   \nSANS Neutraface Parisine Futura Serie BQ Vesta Akzidenz-Grotesk BQ DTL Nobel DynaGrotesk Teuton Critter   \n   \nSCRIPT Sloop Edwardian Script\n\n"
    },
    {
      "time": "13 Jun 2003 — 12:27pm",
      "content": "Lars book said all a designer needs is this:   \n   \n [http://www.lars-mueller-publishers.com/e/katalog/ausgaben\\_detail/081/081\\_helvetica.php](http://web.archive.org/web/20150403154148/http:/www.lars-mueller-publishers.com/e/katalog/ausgaben_detail/081/081_helvetica.php)   \n   \nHELVETICA\n\n"
    },
    {
      "time": "13 Jun 2003 — 2:52pm",
      "content": "ARIAL is really better and already on Mac and PC.\n\n"
    },
    {
      "time": "13 Jun 2003 — 4:01pm",
      "content": "just to clarify... i was joking\n\n"
    },
    {
      "time": "13 Jun 2003 — 10:06pm",
      "content": "Ah, the reference to Helveeta reminded me...   \n   \nAnyone know of a source for those tee-shirts that say Helvetica but are set in Garamond?\n\n"
    },
    {
      "time": "14 Jun 2003 — 5:02am",
      "content": "Gerald --   \n   \nI don't know anything about any t-shirts.   \n   \nIn 1979, Jack Summerford got the assignment to design a poster for the largest type house in Dallas to promote then-new ITC Garamond. He set just one word, large, in red, spanning the width: \"Helvetica\" . . . set in ITC Garamond.   \n   \nIt's a classic. I've always loved it.   \n   \n-- K.\n\n"
    },
    {
      "time": "14 Jun 2003 — 5:19am",
      "content": "This poster was quite notorious in its day. I believe it's still widely cited in design histories. But for any youngsters who might not know it, here's an image.   \n   \n ![Summerford Helvetica](http://web.archive.org/web/20150403154148im_/http:/www.typophile.com/forums/messages/30/11709.gif)\n\n"
    },
    {
      "time": "14 Jun 2003 — 7:01am",
      "content": "Kent   \n   \nNever looked finer. I recall a book on this very same topic. Best and worse typefaces as submitted by various typographers. Somewhere in the collection. Don't want to wake my wife up by rummaging around in the collection. But I recall there is a photo of someone wearing the tee-shirt. Though I don't know that it was the ITC version of Garamond.\n\n"
    },
    {
      "time": "14 Jun 2003 — 9:56am",
      "content": "There is another two Tshirts if I recall correctly:   \n   \n1 done by FontFont with Helevtica in a Fraktur type or so. I'm sure Yves Peters can describe it better, as he worked at FontShop for a while.   \n   \n2 and another one done by Linotype in answer: Helvetica white on Black Tshirt whith the baseline: Its not an Adobe font (who refer to the fact that most of Adobe collection are in fact Linotype faces...)\n\n"
    },
    {
      "time": "14 Jun 2003 — 10:30am",
      "content": "_Helvetica white on Black Tshirt whith the baseline: Its not an Adobe font_   \n   \nYou can get that from [FontHaus](http://web.archive.org/web/20150403154148/http:/www.fonthaus.com/).\n\n"
    },
    {
      "time": "14 Jun 2003 — 11:08am",
      "content": "I think that ITC Garamond campaign was such a brilliant idea. Simple and powerful and its a hilarious inside joke. Just love it. I want one of those tee-shirts! I would happily use ITC Garamond instead of Helvetica any day :-) It's so 80s! (I hate Helvetica, by the way ;-)   \n   \nI know I lot of typographers/type designers can't stand ITC Garamond. Apart from the enormous x-height, the rounded treatment on absolutely everything is a bit much. I don't mind it as a display face for certain things. I wonder what you guys think of it? And why do you think Apple dropped their Apple Garamond Narrow (they redrew from the ITC condensed version which I think was a much more plausible type)? I think it was a stupid decision because it was such a strong element in their corporate identity. They were desperate to be more 'modern' I guess. But Myriad?! That's someone else's corporate type!\n\n"
    },
    {
      "time": "14 Jun 2003 — 1:29pm",
      "content": "I'm not so sure I-Totally-Conked-Garamond isn't worse than Helvomita. I mean, the latter is certainly the village idiot (and one who persists in thinking he's a studmuffin), but the former is the insidious town charlatan. And can you really like the way \"Macintosh\" rendered out in it, with that domestic-abused \"t\" and such?   \n   \nThere are many depths to which one can disdain ITC Garamond. Some poeple only mind that it was called a Garamond, since its spirit is so distorted from the original. But that's too forgiving. You would want to go deeper and hate what it does to French culture: according to some people (like Mandel), a small x-height is a _requirement_ of being a French font, and Garamond is the Frenchest of them all. And you might go deeper, into functionality, and hate the fact that it combines such gaudy proportions with features only fitting in a serious text face.   \n   \nOn the other hand, in terms of corporate indentity, I agree that shifting to Myriad was a horrible idea.   \n   \nHave a good day! ;-)   \n   \nhhp\n\n"
    },
    {
      "time": "14 Jun 2003 — 2:55pm",
      "content": "The problem of ITC Garamond is not its big xheight and all others stuff but is model who is Jannon and jannon is not a Garamond.   \n   \nITC Garamond seems interpreted from the Monotype Garamond (from Jannon too), many details show that such the caps.\n\n"
    },
    {
      "time": "14 Jun 2003 — 3:54pm",
      "content": "Some detailed history:   \n [http://www.myfonts.com/fonts/itc/garamond/](http://web.archive.org/web/20150403154148/http:/www.myfonts.com/fonts/itc/garamond/)   \n   \nI think the ITC comes from Linotype:   \n [http://www.myfonts.com/fonts/linotype/itc-garamond/](http://web.archive.org/web/20150403154148/http:/www.myfonts.com/fonts/linotype/itc-garamond/)   \nBut I also seem to remember a connection to Garamond #3, which is basically a reincarnation of the ATF cut.   \n   \n--   \n   \nAs to the Jannon issue, of course you're right in terms of history, but it's interesting to consider what people actually _think_ when they hear/see \"Garamond\". I suspect it's safe to say that when a person chooses a \"Garamond\" from the font menu, chances are better than 50% he'll get a Jannon - and of course not even realize what the hell that even means. Even among type people, Jannon-denial is alive and well. Check out this:   \n [http://www.itcfonts.com/fonts/detail.asp?sku=ITC6214&AID=5671704&PID=939805](http://web.archive.org/web/20150403154148/http:/www.itcfonts.com/fonts/detail.asp?sku=ITC6214&AID=5671704&PID=939805)   \nas well as the awkward ambivalence here:   \n [http://www.myfonts.com/fonts/linotype/simoncini-garamond/](http://web.archive.org/web/20150403154148/http:/www.myfonts.com/fonts/linotype/simoncini-garamond/)   \n   \nhhp\n\n"
    },
    {
      "time": "14 Jun 2003 — 4:55pm",
      "content": "Yes, Jean. It's not a Garamond at all. As a student, I was quite confused by the different versions of the supposedly 'Garamond'. At one point I was naive enough to think that ITC's version was THE Garamond! How silly was I? Yes, it does look more like a redrawing of Monotype's version. And now my favourite 'Garamond' is your Sabon Next!   \n   \nHrant, nice reference from MyFont. I always wondered about the Apple Garamond. You know what? I still have the TrueType Apple Garamond Narrow on my computer. It was bundled with my old Color StyleWriter printer. Bitstream did a nice job, I think. Much nicer than the original ITC. Quite a few other fonts were bundled with that printer, including Lucida Bright, Lubalin Graph, etc.\n\n"
    },
    {
      "time": "15 Jun 2003 — 11:56am",
      "content": "Compare: Apple's (Bitstream's) 80% condensed redrawing of ITC's Garamond and ITC's own 64% compressed Garamond Light Condensed... quite different, eh?   \n   \n/image{Garamonds}   \n   \nOf couse neither of these should be called 'Garamond'!\n\n"
    },
    {
      "time": "15 Jun 2003 — 12:00pm",
      "content": "Sorry. Here's the image:   \n   \n ![Garamonds](http://web.archive.org/web/20150403154148im_/http:/www.typophile.com/forums/messages/30/11724.gif)\n\n"
    },
    {
      "time": "16 Jun 2003 — 7:52am",
      "content": "Sooo. Hope I am not being blasphemous by brining this up, but how come there are no bitmap fonts mentioned here?   \n   \nBeing a designer today invariably means that there is a rather huge potential you will have to design something for screen. Hence the need for a bitmap.   \n   \nEven as a write this, I am hesitant since we are dealing with only 20. But I think adding Miniml's 'Standard' or Thirstype's 'Pixella' might be highly useful.\n\n"
    },
    {
      "time": "10 Jun 2003 — 3:03pm",
      "content": "Andrew, this is really an interesting premise. Is the limit 20   \nbecause of budget? I think if you hand-picked 100 typefaces   \nyou'd have a great start.   \n   \nIn my school we had the entire Bitstream library and some   \nbasics form Adobe. The result was first-year students all   \ncrowding around the bitstream poster looking for a cool,   \ndifferent font and ending up with Copperplate (gasp!) or   \nBank Gothic (egads!) or worse; Mistral, Hobo, Handel or   \nBalloon gothics (pow! biff! splat! oof!).   \n   \nIn those early years, design students are so caught up   \ntrying to find what's cool, that they don't learn what works.   \n(I know there are always exceptions...)   \n   \nMy school has since purchased the entire HTF library,   \nkudos to them.\n\n"
    },
    {
      "time": "11 Jun 2003 — 10:27am",
      "content": "I think that limiting the list to 20 faces is an excellent idea. It is a good way to teach typography. With a limited selection students can see how principles work in all of the typefaces you select. It is an excellent way to have them compare and contract the strengths of each face.   \n   \nBecuase of that I would make my list from historic sources. Students would see the evolution of type, and see how that evolution happened as they used the faces.   \n   \nWithout putting a ton of time considering the faces I'll throw up a list.   \n   \nBlackletter   \nCentaur   \nJanson   \nHTF Requiem   \nBembo   \nCaslon   \nGaramond   \nBaskerville   \nPalantino   \nHTF Didot   \nPerpetua   \nElectra   \nClarendon   \nAkzidenz Grotesque   \nHelvetica Neue   \nFutura   \nFranklin Gothic   \nTrade Gothic   \nPoetica   \nShelly   \n   \nOK, its a rough list, but it has some solid faces that would be good to learn principles with.\n\n"
    },
    {
      "time": "5 Jul 2003 — 3:18am",
      "content": "hmmm, i remeber the shirt it was printet with:   \n\\*H e l l v e t i c a\\* in a fraktur type. black letters on a screaming-yellow shirt . fantastic! i think it was from fontshop\n\n"
    },
    {
      "time": "14 Jun 2008 — 5:13pm",
      "content": "\\*\\*\\*\n\n"
    },
    {
      "time": "14 Jun 2008 — 10:55pm",
      "content": "~~~\n\n"
    },
    {
      "time": "15 Jun 2008 — 6:30am",
      "content": "\" The idea is to limit the number of typefaces available for design students enabling them to be familiar with around 20 families.\"\n\nGoto: freshly installed operating system.  \nOpen: design application of choice  \nFind: font menu  \nPull down:See list?\n\nYou are done.\n\nThis is not a trivial recommendation as otherwise the students will have all these bundled families (the school will not be able to delete them), PLUS the 20 families you give them, and thus you will be defeated by such a plan.;) How? Wind blows, fire burns, students rebel. Tell them they can only use \"these 20\" and you'll see!\n\nCheers!\n\n"
    },
    {
      "time": "15 Jun 2008 — 10:53am",
      "content": "<cite>Tell them they can only use “these 20” and you’ll see!</cite>\n\nI had a professor limit us to ten without any problems.\n\n"
    }
  ]
}
