{
  "id": "31206",
  "title": "Art Nouveau",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi\n\nIm designing a food menu for an art nouveau restaurant. But Im not sure which typeface to use in headlines and text to make it look authentic/genuine. Suggestions anyone?\n\nTanks\n\n",
  "author": "P_P",
  "time": "6 Feb 2007 — 12:30pm",
  "uid": "5167",
  "comments": [
    {
      "time": "6 Feb 2007 — 1:16pm",
      "content": "go to myfonts.com and type in \"nouveau\" or \"art nouveau\" in the window at the top right, you'll see lots of choices.\n\n"
    },
    {
      "time": "6 Feb 2007 — 1:36pm",
      "content": "You need more than a font to make it work. Look for a Dover book on Art Nouveau for borders and other marks and search the web\n\n"
    },
    {
      "time": "6 Feb 2007 — 3:39pm",
      "content": "Look up Alphonse Mucha, the king of Art Nouveau, for colors, styles, etc. Lots of flowery stuff and colors that came back into vogue in the 1970s. Also look up Vienna Secession and Jugendstil.\n\nA couple of \"art nouveau\" fonts I can think of: Auriol, Desdemona, etc...\n\nDon't confuse Art Nouveau with Art Deco.\n\n"
    },
    {
      "time": "7 Feb 2007 — 6:49am",
      "content": "Tanks everyone! Ive found an ok headline font now. But still looking for the text font, the serif. Does anyone have a clue which typeface they use on the front of \"The Yellow Book\"? Or a similar face, used in the same period. Would realy appreciate your help.\n\n ![](http://web.archive.org/web/20120506075914im_/http:/typophile.com/files/yellowbook_4235.jpg)\n\n"
    },
    {
      "time": "7 Feb 2007 — 1:26pm",
      "content": "Petter, if you could show us the typeface you have decided upon for the display I think we'd know which direction on a match for the text. I'm not sure using something like this as on THE YELLOW BOOK is art nouveau enough.\n\n"
    },
    {
      "time": "7 Feb 2007 — 4:01pm",
      "content": "I found a font called KOLO LP, which has a clean nouveau look. It feels a bit hand drawn. The text side of the menu will have a frame, similar to the one in the picture that I have uploaded. The other side of the menu will be decorated with an rather typical nouveau illustration (inspired by Alphonse Mucha).\n\nIs KOLO LP a good choice? If so, what would be a nice typface match? Should go with a face like BELWE or perhaps JENSON, SOUVENIR, LTC FORUM TITLE or ELPHINSTONE. Hmm, I´ll think I need some guidance.\n\n ![](http://web.archive.org/web/20120506075914im_/http:/typophile.com/files/kolo_lp_5090.jpg)\n\n ![](http://web.archive.org/web/20120506075914im_/http:/typophile.com/files/frame_6223.jpg)\n\n"
    },
    {
      "time": "7 Feb 2007 — 4:38pm",
      "content": "Perhaps you could do some exploration with all of your ideas and post those. Once you have worked with all combination you might have new thoughts.\n\n"
    },
    {
      "time": "7 Feb 2007 — 5:35pm",
      "content": "I think KOLO is more Arts-and-Crafts than Art Nouveau. To me, it's not organic enough to be Art Nouveau. It feels more C.R. Mackintosh/ craftsman than Mucha/Studio/Paris.\n\nELPHINSTONE is too ... too ... calligraphy.\n\nBELWE has potential for content, and **[arnold-boecklin](http://web.archive.org/web/20120506075914/http:/www.myfonts.com/fonts/linotype/arnold-boecklin/)** may work for display?\n\nBut -- I don't think anyone does it better than **[P22 Art Nouveau](http://web.archive.org/web/20120506075914/http:/www.myfonts.com/fonts/p22/art-nouveau/)**\n\n"
    },
    {
      "time": "7 Feb 2007 — 5:39pm",
      "content": "Gee, I see Kolo and all I can think of is Benguiat Sans -- that cap A does it every time....\n\n"
    },
    {
      "time": "7 Feb 2007 — 8:32pm",
      "content": "Have you checked out [Auriol](http://web.archive.org/web/20120506075914/http:/www.itcfonts.com/fonts/detail.htm?pid=242712), as suggested by BradB, above? It's from 1901, very authentic! :-)\n\nThere is also [Absinthe](http://web.archive.org/web/20120506075914/http:/www.itcfonts.com/fonts/detail.htm?pid=426408), a more recent typeface inspired by that movement.\n\n"
    },
    {
      "time": "7 Feb 2007 — 9:09pm",
      "content": "I'm liking Auriol too.  \nHowever, I think that for a menu, ya gotta have some of those lovely borders as in the sample you show, so it's really a question of integrating the type with the style of the border.\n\nWindsor (Light is very classy), Korinna, and Souvenir have that \"triangulating the circle\" art nouveau shape.\n\nFor another tack, Advertiser's Gothic.\n\n"
    },
    {
      "time": "8 Feb 2007 — 8:51am",
      "content": "Auriol is gorgeous, especially if you have the complete family. It works amazingly well at small sizes too. Great suggestion.\n\n"
    }
  ]
}
