{
  "id": "31219",
  "title": "History of Galliard",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "hello  \nfirst time poster, been poking my nose around here for a while tho.\n\nim looking for a little background on the typeface ’ [Galliard](http://web.archive.org/web/20080302012510/http:/www.typophile.com/wiki/Galliard)’, ie designer, time period, etc. any info at all is appriciated.\n\n-j\n\n [‹ Fontographer beginner](http://web.archive.org/web/20080302012510/http:/www.typophile.com/node/35446 \"Go to previous forum topic\") [2 Helvetica based events from Candy... ›](http://web.archive.org/web/20080302012510/http:/www.typophile.com/node/34466 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080302012510/http://www.typophile.com/user/14300\" title=\"View user profile.\">jdwelk</a>",
  "time": "<br>",
  "uid": "14300",
  "comments": [
    {
      "time": " 6.Feb.2007 6.25pm",
      "content": "[ITC Galliard CC](http://web.archive.org/web/20080302012510/http:/flickr.com/photos/stewf/376726776/in/pool-type_specimen/)\n\n"
    },
    {
      "time": " 6.Feb.2007 7.11pm",
      "content": "[ITC Classics: ITC Galliard - ITCFonts.com](http://web.archive.org/web/20080302012510/http:/www.itcfonts.com/Fonts/Classics/Galliard.htm)\n\n"
    },
    {
      "time": " 6.Feb.2007 7.13pm",
      "content": "“Chuck” [Charles Bigelow](http://web.archive.org/web/20080302012510/http:/www.typophile.com/wiki/Charles%252BBigelow) wrote one of the definitive articles on Galliard in [_Fine Print_](http://web.archive.org/web/20080302012510/http:/www.amazon.com/Fine-Print-Type-Magazine-Typography/dp/096072902X) magazine, January 1979.\n\nOf particular note, it was [Mike Parker](http://web.archive.org/web/20080302012510/http:/www.typophile.com/wiki/Mike%252BParker), then director of typographic development for Mergenthaler, who made an extensive study of punches and matrices of [Robert Granjon](http://web.archive.org/web/20080302012510/http:/www.typophile.com/wiki/Robert%252BGranjon)’s (1513—89) types found at the [Plantin-Moretus Museum](http://web.archive.org/web/20080302012510/http:/museum.antwerpen.be/plantin_Moretus/index_eng.html).\n\nTogether, Parker and [Carter](http://web.archive.org/web/20080302012510/http:/www.typophile.com/wiki/Matthew%252BCarter) sought the “best” of Granjon’s faces suitable for contemporary typography, making Galliard more of an anthology than a revival of any particular type family.\n\n"
    },
    {
      "time": " 6.Feb.2007 7.25pm",
      "content": "This is working off the top of my head, so some of the early stuff could be in error. The later information is likely correct, as I was a bit involved.\n\nMatthew Carter cut the original Galliard while still at Linotype. I imagine the font was licensed to ITC through Linotype. When he & Mike Parker started Bitstream, it was likely re-licensed back from ITC (Something similar happened to Sumner Stone with the “Stone clan”). Or maybe Carter held onto some rights.\n\nThere was a third incarnation when Carter started Carter & Cone. though the Carter & Cone fonts are not called “ITC.” At some point, a “Swedish” version was made, which had a slightly different “f” so as to fit with vowels with an umlaut better. A bit later, Richard Eckersley & I got with Carter to work out tabular old-style figures, and I believe a few other glyphs.\n\nWhile too much a gentleman to say so, I believe Matthew is a bit tired of working on Galliard. It’s sparkle comes from the contrast of the letters; the relation of the fine strokes with the heavier ones. Galliard fared better when printed repro-negative-plate than direct-to-plate. To date, there has been no reissue of Galliard. I did make a slighter more robust version in OpenType —with some extra characters such as f-vowel-grave ligatures, and put the nut fractions into a stylistic set. This was for our own use, but I did send a copy of the font files to Matthew Carter. (We were on a panel at some meeting, & he tacitly agreed that direct-to-plate printing was a little hard on the font.) Never did hear back from him on this one though, so maybe he disapproved of the changes.\n\nIt may be that the Type 1 Carter & Cone Galliard is to be the final form. For the heavier weights, the Bitstream was the final form (to date).\n\nHope this helps,\n\nCharles\n\n"
    },
    {
      "time": " 6.Feb.2007 7.28pm",
      "content": "Just an addition of little know information about the development of Galliard—\n\nThe _drawing_ and refinement of the Galliard family was no small task, but it is interesting to note that the [Ikarus](http://web.archive.org/web/20080302012510/http:/www.typophile.com/wiki/Ikarus) System was used to interpolate the Roman Bold weight, and the Ultra was extrapolated from the Roman and Black weights.\n\nThe italics, on the other hand, were drawn by hand and were based primarily on Granjon’s Ascendonica Cursive, cut for Plantin in 1570.  \n(_Reference— article by Chuck Bigelow on Galliard mentioned in my post above._)\n\n"
    },
    {
      "time": " 6.Feb.2007 9.41pm",
      "content": "Charles, ITC released an OpenType version of ITC Galliard last year –\n\n[http://www.itcfonts.com/Fonts/NewFonts/2006/May2006.htm](http://web.archive.org/web/20080302012510/http:/www.itcfonts.com/Fonts/NewFonts/2006/May2006.htm \"http://www.itcfonts.com/Fonts/NewFonts/2006/May2006.htm\")\n\n"
    },
    {
      "time": " 6.Feb.2007 11.05pm",
      "content": "Matthew Carter, ‘Galliard: a modern revival of the types of Robert Granjon’, _Visible language_, vol. 19, no. 1 (Winter 1985), pp. 77–97.\n\n"
    },
    {
      "time": " 7.Feb.2007 9.23am",
      "content": "Too bad Galliard wasn’t considered worthy of the “Best Hundred”.\n\n"
    },
    {
      "time": " 25.Jul.2007 2.42am",
      "content": "I’m curious whether there is a difference between [ITC Galliard CC](http://web.archive.org/web/20080302012510/http:/www.fontshop.com/fonts/singles/carter_cone/itc_galliard_italic_cc/) and [ITC Galliard Pro](http://web.archive.org/web/20080302012510/http:/www.itcfonts.com/fonts/mondosearchresults.htm?st=12&kid=galliard%20pro) (the one Dan mentioned above)—apart from format and vendor, of course.  \nThat is, as I want to purchase a good Galliard Italic including [those Alternates & Ligatures](http://web.archive.org/web/20080302012510/http:/www.fontshop.com/fonts/singles/carter_cone/itc_galliard_roman_italic_alternates_cc/) (also [brought up here](http://web.archive.org/web/20080302012510/http:/www.typophile.com/node/19756)), I’d be better off with the ITC Galliard Pro OT, no?  \nThanks for your help.\n\n"
    },
    {
      "time": " 25.Jul.2007 5.50pm",
      "content": "As far as I know, only the Carter&Cone version has all the alts. I would contact ITC to be sure. Unfortunately there isn’t really an ITC anymore, so you’ll be contacting Monotype.\n\n"
    },
    {
      "time": " 26.Jul.2007 2.56am",
      "content": "Stephen, thanks for your reply. Unfortunately, the ITC site doesn’t feature full character maps—but I found this one at Linotype: [ITC Galliard™ Pro Italic](http://web.archive.org/web/20080302012510/http:/www.linotype.com/16783100/itcgalliardproitalic-charactermap.html) (should be the same font, no?), so I took a closer look.\n\nAs far as I can judge from that, you’re perfectly right. Just for the record: Most ligatures and swash alternatives were incorporated in the OT Pro version, others are missing (among them: alternative ampersand, 2-storey g, long-tailed Q, fj/fr/us/as/is-Lig, end swash forms for d, m, e) or look different (ij-Lig). Ornaments also only with ITC Galliard CC, I suppose.  \nThen, with ITC Galliard Pro you’d get _one_ font with all the extra stuff comfortably accessible, not to mention all the foreign language diacritics.  \nGrrr, how I hate those decisions …\n\n"
    },
    {
      "time": " 26.Jul.2007 5.40am",
      "content": "This is an odd case because I believe Carter added the undigitized extra glyphs to his own version after the ITC was released. That’s why only the C&C is different.\n\n"
    }
  ]
}
