{
  "id": "31210",
  "title": "Dairy Farm Logo Critique",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hey, I'm a complete newbie to typophile, so bear with me.  \nI have completed a design education recently  \n(not graphic, but industrial, so I'm not going to claim that I am a graphic designer)\n\nanyways, my family has a dairy farm, and thus as typical, a sign stands at the end of the lane with the farm name etc.\n\nthe sign was old, needing a repaint (at the bare minimum)i of course volunteered to give it something of a freshen up\n\nposted first is the sign before hand (very typical or cliché for the scenario)\n\nso i felt like giving it a change, giving the farm something of a brand identity kinda thing,\n\ni searched the net for some inspiration, and posted is a pic for a horse farm that i kinda used as the basis for the design  \nthus comes the design i came up with and the after picture of the sign\n\nplease critique or comment as you see fit\n\nthanks\n\n| Attachment | Size |\n| --- | --- |\n| [before.jpg](http://web.archive.org/web/20131020035625/http:/typophile.com/files/before.jpg) | 18.16 KB |\n| [horse logo.jpg](http://web.archive.org/web/20131020035625/http:/typophile.com/files/horse%20logo.jpg) | 11.97 KB |\n| [sign-logo.jpg](http://web.archive.org/web/20131020035625/http:/typophile.com/files/sign-logo.jpg) | 24.57 KB |\n| [after.jpg](http://web.archive.org/web/20131020035625/http:/typophile.com/files/after.jpg) | 122.87 KB |\n\n",
  "author": "wvbeek",
  "time": "6 Feb 2007 — 1:40pm",
  "uid": "16618",
  "comments": [
    {
      "time": "6 Feb 2007 — 1:42pm",
      "content": "ok, adding to this, the graphic that i made up, based on pictures of 'show cows', where part of the ideal is to have the straight as a ruler back or 'top-line', so just a bit on the reasoning of the graphic\n\n"
    },
    {
      "time": "6 Feb 2007 — 1:45pm",
      "content": "something of a small farm magazine publication was also made, where my parents asked me to produce an advert for the farm, to be based on the sign, thus the 'branding' begins, the idea of farm business cards has also been tossed around\n\nanyways,  \n2 groups of images, in the first group, the third one is what we went with, the second group of images is what i did later\n\nagain, comments welcome, feedback is always useful\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/variations_6326.jpg)\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/variations-part-2_6114.jpg)\n\n"
    },
    {
      "time": "6 Feb 2007 — 1:46pm",
      "content": "reasoning for the use of orange is because of the dutch family name/heritage, just a quick point on that\n\n"
    },
    {
      "time": "6 Feb 2007 — 1:51pm",
      "content": "Alright, I know that this was a string of posts, back to back, but this is the end of the story, or where things stand currently.\n\nA few months ago, in an instance of local mailbox bashings, the sign was also destroyed (plywood construction defeated with drunken force and golf clubs).\n\nAnyways, so now the sign frame stands empty, and my family wanting a new sign. Of course it would be nice to make something a little bit more vandalism proof. Anyways, I see this as an opportunity for a complete revamp on the sign, change up the framing/format and everything, meaning that the orientation and layout of the whole kinda graphic could change.\n\nSo this is where I would really appreciate feedback on what I have posted thus far, in terms of orientation/layout for how you feel that this might be successful.\n\n-go feedback!!-\n\nthanks\n\n"
    },
    {
      "time": "6 Feb 2007 — 1:58pm",
      "content": "In terms of production don't have bleeds on both the top and the bottom. You push the cost of printing up, that is if you are going to print.\n\nI would review your design based on what the industry is doing. Your design is light and airy like a boutique selling clothing but is that the image you want to present to your target audience. Do they want arty design or bold, productive, safe qualities. Its not a bad design but maybe not the right one for your industry.\n\n"
    },
    {
      "time": "6 Feb 2007 — 4:23pm",
      "content": "Thanks for the input Dan, I can see what you mean on the font. (I assume you meant the font was \"light and airy like a boutique...\"\n\n(hopefully the graphic was good)\n\nanyways, so thinking about the target audience, its not the finished product (milk) we are selling, its really more of the farm image kinda thing, (versus other farms), with animal genetics and pedigree being part of the image, the past year, we had many farm tours in to look at a few animals that were drawing attention, (bus tours, people from Australia, Germany, Denmark, U.S., as well as some from other regions of Canada.\n\n"
    },
    {
      "time": "6 Feb 2007 — 4:28pm",
      "content": "Perusing the web, I found this pic/graphic that I thought to be kinda nice, maybe a bit of a point of inspiration.\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/22506875_d96b81b6d6_3699.jpg)\n\n"
    },
    {
      "time": "6 Feb 2007 — 4:29pm",
      "content": "Also, some examples of other farm signs I found on the net\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/wf_6744.jpg)\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/farmsign_5428.JPG)\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/farm%20sign_5512.jpg)\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/Glade-Creek_6090.jpg)\n\n"
    },
    {
      "time": "6 Feb 2007 — 8:25pm",
      "content": "ok, taking Dan's comments into consideration  \n(taking them as focusing on the font),  \nI've played around with all the different fonts I've got/downloaded  \n(hurrah [www.dafont.com](http://web.archive.org/web/20131020035625/http:/www.dafont.com/ \"www.dafont.com\"))\n\nanyways, here are some of the alternative looks\n\nplease, as always, feel free to comment, tell me what you think works/doesn't, what might suit the situation/audience etc.\n\nthanks\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/trajan_4022.jpg)\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/sans_6131.jpg)\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/serif1_6447.jpg)\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/serif2_5351.jpg)\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/garamond_3465.jpg)\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/other1_5163.jpg)\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/script1_4686.jpg)\n\n"
    },
    {
      "time": "7 Feb 2007 — 8:28am",
      "content": "You're doing well to look into bolder faces, as it would improve readability, I think. Why not hand-draw the name in a very clear legible script?\n\n"
    },
    {
      "time": "7 Feb 2007 — 9:43am",
      "content": "You need to beef up (haha, get it...'beef'...ah, nevermind...) the weight of the type a bit, IMHO. As such you might want to try making th strokes of the cow a bit bolder too.\n\n"
    },
    {
      "time": "7 Feb 2007 — 9:55am",
      "content": "Dear god, please don't use Trajan or Marcelle. Some of the scripts are looking good with the cow (particularly Heather, for me) but I agree, beef up whatever you use. Make sure to check your kerning with the cap W and H for the final.\n\n[Some roman ideas,](http://web.archive.org/web/20131020035625/http:/www.myfonts.com/fonts/linotype/koch-antiqua/morelikethis.html) going off Koch Antiqua (which I think Lillith is ripped off of).\n\n"
    },
    {
      "time": "7 Feb 2007 — 10:30am",
      "content": "William, from the top of the head to the the tip of the tail, the line weight never changes. I'd suggest getting more line weight variances to add flow and break up that \"stiff\" back. This will help relate it better to your choice of script fonts.\n\n"
    },
    {
      "time": "7 Feb 2007 — 10:54am",
      "content": "You're welcome to use my Typophile logo you see at the left of this post!!!!!  \nDB~\n\n"
    },
    {
      "time": "7 Feb 2007 — 12:07pm",
      "content": "If we're showing off our own cow logos now, here the one I've done:\n\n[http://www.herd-pro.com/assets/topbanner/topbanner\\_left.gif](http://web.archive.org/web/20131020035625/http:/www.herd-pro.com/assets/topbanner/topbanner_left.gif \"http://www.herd-pro.com/assets/topbanner/topbanner\\_left.gif\")\n\nYou have to love cows.\n\n"
    },
    {
      "time": "7 Feb 2007 — 4:08pm",
      "content": "Trajan is far from the right type, but that particular setup, with the tight leading bringing the word \"Holsteins\" off of the cow's back, helps with the balance. Right now the composition is far too heavy on the right. In other words, if you set this logo down on the ground, everything would tip over and fall back on the cow's hindquarters. Perhaps if the apex/fulcrum of the tail curled up rather than dow, or if the type set in some way to bring physical weight back over to the left.\n\n"
    },
    {
      "time": "7 Feb 2007 — 7:47pm",
      "content": "Hey, thanks everyone for the feedback so far.  \nIn terms of the 'layout', well, the placement of the text and everything of course in these samples isn't really considered too much, at this stage I was still really playing around trying to find the font that worked best, and as per the logo critiques, I'm going to try tweaking it a bit.\n\n"
    },
    {
      "time": "7 Feb 2007 — 7:54pm",
      "content": "aluminum-  \nI agree completely!  \nAs Will Rogers' obscure brother Vinnie said,  \n\"I never met a cow I didn't like.\"  \nDB~\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/cow_4346.gif)\n\n"
    },
    {
      "time": "8 Feb 2007 — 7:22am",
      "content": "And of course, as for type choices, you have to at least consider this one:\n\n[http://fonthead.com/font-sampler.php?l=1&font=holstein](http://web.archive.org/web/20131020035625/http:/fonthead.com/font-sampler.php?l=1&font=holstein \"http://fonthead.com/font-sampler.php?l=1&font=holstein\")\n\n"
    },
    {
      "time": "9 Feb 2007 — 12:09pm",
      "content": "My only suggestion is to maybe \"beef\" it up a little (damn, I'm to clever :P)\n\nIt looks pretty thin at such a large size, I think it could be a little thicker, especially if it's going on a sign.\n\n"
    },
    {
      "time": "27 May 2007 — 2:16pm",
      "content": "Hi again, it's been a while since I posted, was busy with things, so not a whole lot of progress since the last feedback.  \nJust a refresher, what the sign used to look like:\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/old_5072.jpg)\n\n"
    },
    {
      "time": "27 May 2007 — 2:17pm",
      "content": "What the newer sign looked like (past tense as it was destroyed by vandalism):\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/newer_4976.jpg)\n\n"
    },
    {
      "time": "27 May 2007 — 2:26pm",
      "content": "So, since the old one was destroyed, we are going to have the new one done with vinyl cut letters on a white acrylic board, hopefully helping it last longer and not having to worry about repainting.  \nAlso, since, the farm no longer has exclusively Holstein cows, but now Brown Swiss too, so I have been told that the sign should only read the farm name: Wellsfarm\n\nThis reduction from “Wellsfarm Holsteins” to “Wellsfarm” has left me not sure how I feel about the balance of the look, so help and ideas are welcome.  \nAlso, since the sign is going to be done on a white acrylic board, I think colour matching to the frame and posts might be difficult, so I’m thinking that they would be better in black, and would help to punch the sign out better.  \nThoughts???\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/option1_4794.gif)\n  \n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/option2_4133.gif)\n\nBased on earlier critiques, I have ‘beefed’ ah ha ha… up the logo a bit, and my preference of fonts has lead me to go with “Lilith Regular” (from daFont), which someone said is a ripoff of Koch Antiqua.\n\n"
    },
    {
      "time": "27 May 2007 — 2:34pm",
      "content": "I realize that those images are a bit on the small side to evaluate the type/logo part, here is the main focus:\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/focus_5479.gif)\n\n"
    },
    {
      "time": "27 May 2007 — 5:22pm",
      "content": "I find the back of the cow too long and too straight, and looks more like the rear of a car.  \nIs this intentional?\n\n"
    },
    {
      "time": "27 May 2007 — 6:09pm",
      "content": "The back of the cow this way IS intentional, within the dairy industry, where cow \"type\" is pushed, a level (like a ruler) back is pushed as ideal, regardless of how unrealistic this might seem. I did use a picture of a 'show cow' for guidelines when doing the logo, I think I actually used a picture for an underlay to get it going. I believe that I might have actually shortened the back to make it fit better with the sign.  \n [http://www.comestar.qc.ca/lautamie.html](http://web.archive.org/web/20131020035625/http:/www.comestar.qc.ca/lautamie.html \"http://www.comestar.qc.ca/lautamie.html\")  \nThis link shows an example of what you see typically in photographed show cows. So there you can see, flat back, and long proportions lend to the 'Dairy' character of the cow.\n\n"
    },
    {
      "time": "28 May 2007 — 3:00am",
      "content": "You need to kern the We and fa tighter and sf looser, I would also move the image to the left to centre it better; the weight of the line for the tail seems a bit heavy and exaggerated compared to the detail in the head. I am not convinced that the typeface is the best choice for signage, the x-height is extremely low.\n\nTim\n\n"
    },
    {
      "time": "28 May 2007 — 6:56am",
      "content": "You could fix your kerning problems by buying a licence for a real version of [Koch Antiqua](http://web.archive.org/web/20131020035625/http:/www.fontshop.com/fonts/downloads/linotype/koch_antiqua_virtual/&sample_text=Wellsfarm&sample_size=36) instead of using a rip-off version, although I agree with Tim that it's not a good face for signage.\n\n- Lex\n\n"
    },
    {
      "time": "29 May 2007 — 7:28am",
      "content": "Now who would go and vandalize a family Dairy Farm's sign? Sad.\n\nI have to agree with the others...the type and the illustration are way to thin for signage applications. If the sign needs to be functional (ie, easily read from the road) then consider using a beefier face.\n\n"
    },
    {
      "time": "29 May 2007 — 3:50pm",
      "content": "Who would vandalize a family Dairy Farm's sign, well, people who were mad when they didn't manage to bash in the metal mailbox.\n\nAnyways, since no-one seems to be a fan of the font there, (and I am growing less fond of it), time for some new ones.  \nI think I've pretty much decided that a nice simple serif font would suit the application the best, in my mind at least. Gives the look of something well established I think.  \nAnyways, here are some ideas (no names just lettered), and I know that they are not perfectly aligned right now, I am still trying to figure out what font suits best.\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/a_6543.gif)\n  \n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/b_6564.gif)\n  \n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/c_3880.gif)\n  \n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/d_6225.gif)\n  \n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/e_4865.gif)\n  \n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/f_3861.gif)\n  \n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/g_5903.gif)\n  \n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/h_5152.gif)\n  \n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/i_4334.gif)\n\n"
    },
    {
      "time": "29 May 2007 — 3:51pm",
      "content": "Another thing I was considering with layout, is blowing up the image a bit bigger, and shrinking the text down and dropping it in the image.  \n(This is also one of the fonts that I was liking more)\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/2_3426.gif)\n  \nAny further thoughts or ideas are always welcome. \n"
    },
    {
      "time": "29 May 2007 — 9:23pm",
      "content": "I like the placement inside the cow - it makes the logo seem more unified. Although I'd go with a heavier font and give the text just a touch more breathing room.\n\n- Lex\n\n"
    },
    {
      "time": "30 May 2007 — 8:07am",
      "content": "Alright, on that last note then, 4 versions with the text inside, I do kind of like that myself, it does tie together a bit more I think, but on the other hand, I'm also afraid the text is getting lost.\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/inside1_4793.gif)\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/inside2_5505.gif)\n  \n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/inside3_6565.gif)\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/inside4_4772.gif)\n\nWith these ones, I do like how the W in 1, 3, and 4 seem to match well with the lower stroke on the cows neck.\n\n"
    },
    {
      "time": "30 May 2007 — 8:25am",
      "content": "IMHO, consider #4 with all small-caps (don't uppercase the first letter). Then tweak the hell out of the kerning.\n\n"
    },
    {
      "time": "30 May 2007 — 10:00am",
      "content": "I love number 4! Yes, try it with all small-caps.\n\nWith the text inside of the cow, it would make for a cool cutout sign.\n\nVery nice!\n\n"
    },
    {
      "time": "30 May 2007 — 10:22am",
      "content": "OK, thanks for the last bit.  \nThis is where I am at now.  \nOverall, I think it's fairly good, but I do find it to be kinda empty looking.  \nAnyone have any thoughts on that?\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/wellsfarm_6315.gif)\n\n"
    },
    {
      "time": "31 May 2007 — 4:44am",
      "content": "Maybe try giving the cow some facial features to make it seem less empty?\n\n"
    },
    {
      "time": "31 May 2007 — 7:57am",
      "content": "Maybe add a sun to the top corner of the diamond? Grass to the bottom?\n\nI don't think the logo is empty, but rather it's crammed into an akqard shape.\n\nIf anything, maybe just shrink the logo by 20% so it has some breathing room within the diamond.\n\n"
    },
    {
      "time": "31 May 2007 — 8:34am",
      "content": "Do you have to keep it in a diamond?\n\nI don't think it's too empty at all - but rather beautifully simple.\n\n"
    },
    {
      "time": "31 May 2007 — 12:21pm",
      "content": "I would move the type to the left, it is rather cramped by the tail. My opinion is that the uppercase is very difficult to kern satisfactorily with the WE, LLS and ARM and that an upper and lower version might be better.\n\nTim\n\n"
    },
    {
      "time": "7 Jun 2007 — 3:23pm",
      "content": "I agree, you still have lots of room to work with on the left. I think once you have it kerned properly, it'll look gorgeous. Very charming. And way ahead of the industry compared to all the competitor's farms you displayed. Why don't you add a simple little eyelid to combat that \"emptiness\" you feel. Maybe something like this:\n\n ![](http://web.archive.org/web/20131020035625im_/http:/typophile.com/files/cow_5909.jpg)\n\n"
    },
    {
      "time": "7 Jun 2007 — 3:24pm",
      "content": "Now scroll up. The cow with no eye is almost scary now. Poor cow!\n\n"
    }
  ]
}
