{
  "id": "31222",
  "title": "Who are the relevant people to contact at the various Linux distros re: fonts",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Who are the relevant people to contact at the various Linux distros re: fonts?\n\n",
  "author": "<a href=\"user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": " 6 February, 2007 - 11:39pm",
      "content": "Nicolas Spalinger is the person for Debian and (I think) Ubuntu by extension. He has an email address at sil.org. Jim Gettys was one of the people responsible for getting the Bitstream Vera fonts into Gnome, and is now at OLPC. Between the two of them, I think they’d have a pretty good sense of who to go to next.\n\nYou can tell them I sent you - they both know me, and I doubt my introduction would hurt your chances _too_ badly.\n\n"
    },
    {
      "time": " 8 February, 2007 - 8:28am",
      "content": "Don’t know if it’s helpful, but I’ve had brief communication with Craig Drummond, who has an email address with kde.org. He’s been working on the font installer/viewer in KDE. The only reason he might remember me, however, was that I was evidently one of the only person who wrote in to tell him that I missed the “font hiding” feature when it was removed from the font installer.\n\nScott Thatcher\n\n"
    },
    {
      "time": " 8 February, 2007 - 8:37am",
      "content": "What is the font hiding feature? What does it do?\n\n"
    },
    {
      "time": " 8 February, 2007 - 11:50am",
      "content": "Font hiding was just a relatively straight-forward means to turn fonts on and off in a user’s local .fonts directory. Clicking the hide button would change font.ttf to .font.ttf (and vice versa) so that the fontconfig system would no longer list it in the available fonts. The only font management feature that I’ve heard of in the Linux environment. Nothing as feature-full as a font-management program on a Mac, but combined with creating folders with special-purpose fonts, it made my life easier.\n\nBelow is a message (in response to the wish-list item I created) concerning font handling in the soon-to-be-released KDE 4:\n\n“KDE4’s installer features font hiding, and font grouping.”\n\nI’ll be very interested to see how extensive these features are.\n\nScott Thatcher\n\n"
    },
    {
      "time": " 8 February, 2007 - 1:10pm",
      "content": "Cool! That makes me curious : What do you do using Linux & these font groups? Your web site suggest to me that you were making fonts and you were using the management as part of testing them. Is that right?\n\n"
    },
    {
      "time": " 8 February, 2007 - 6:59pm",
      "content": "Most everything I’ve done that’s related to typography has been of the extremely amatuerish nature. That smallcaps font for Palladio is the only font I’ve ever tried to make. It was a good learning experience, even though I was only trying to modify an existing typeface. Just after I made that font, small caps for Palladio were introduced into the standard LaTeX distribution by someone else who’d done a better job.\n\nActually, the reason I wanted a little font management had to do with the fact that I was the newsletter editor for my church newsleter for several years. It was a nice excuse to learn about design and play with typefaces, but I didn’t want all of the one-use-only display faces installed all the time (the food-of-the-month always had its own typeface). I had a folder for each month’s newsletter that I could enable or disable.\n\nI’m always interested in posts on typophile that mention Linux. Can I ask what motivated your initial question?\n\n"
    },
    {
      "time": " 8 February, 2007 - 8:36pm",
      "content": "I see now.\n\nMy initail question is because I have a monospace for programmers. And I would like to talk to the folks who would be my the end user/customer. Also I am interested to know if they have different priorities/opinions than windows or other programmers.\n\nBut I am not finding it easy to find the right person people to talk to or the right way to make contact. It could also be that fonts are just not a priority & so I won’t be getting alot of info.\n\nOriginally it seemed to me like soldiers should care about boots - they do. Chefs should care about knives - they do. And progarmmmers should care about their monospace. Do they? Pehaps I am caught in spam filters. Or maybe I am too impatient. We’ll see I suppose.\n\n"
    },
    {
      "time": " 8 February, 2007 - 8:45pm",
      "content": "\\>And progarmmmers should care about their monospace. Do they?\n\nI’ve always thought that programmers are one of the few groups that really get to choose how their work, and the work of others, is displayed. They do seem to care about fonts, rendering modes, and un-ambiguous letter shapes. Not sure if that translates to them paying for new fonts though. :-(\n\nCheers, Si\n\n"
    },
    {
      "time": " 8 February, 2007 - 9:24pm",
      "content": "They might feel that something that affects their productivity should be subsidized by the boss. They might be right. ;-) After all they don’t buy the machines they work on either. They might also feel it was something outside their expertise or… 100 other things. That’s why I want to chat. My own programming pals have been generous with me. They have definitely shaped what I have so far. But my sample size is too small.\n\nCare to send me some MS insight? Have you tracked ( or observed ) at what rate the in-house staff are using Consolas? Or other fonts? As I say, my sample size is small but they all seem to like their fonts without smoothing. What about at MS? Are my pals odd or typical?\n\n"
    },
    {
      "time": " 8 February, 2007 - 9:35pm",
      "content": "Visual Studio was the first product to supply Consolas, and the CT team did some research that showed developers could spot more bugs (typos in code) with Consolas (CT enabled) vs Courier New (CT off).\n\nI don’t know how many internal folks use Consolas, but anecdotally initially many developers didn’t like ClearType, but also they were amongst the most vocal complainers when CT was broken in Windows XP builds.\n\nMike Duggan may have some more info.\n\n"
    },
    {
      "time": " 8 February, 2007 - 11:30pm",
      "content": "That is complicated. And interesting. If Mike has more info that would be great.\n\n"
    }
  ]
}
