{
  "id": "31226",
  "title": "Ethical Design",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hello all,\n\nI have just been assigned to produce an essay on ethical design for college and i would be interested to know your views for my research. I would be very grateful if you could assist me by answering the following questions or by giving me any opinions that you have:\n\nWhether you are prepared to design for charities for free or if you would demand a fee?\n\nWould you design for a firm that goes against your own personal beliefs? Or is money more important to you than your beliefs?\n\nAny response would be much appreciated! Thanks\n\n",
  "author": "<a href=\"/web/20110209170410/http://typophile.com/user/16683\" title=\"View user profile.\">Dr MOON</a>",
  "time": "<br>",
  "uid": "16683",
  "comments": [
    {
      "time": "",
      "content": "Sam,\n\nQ1. I have, and still do some reduced rate and free design for charities, particularly those within my community, some of which are close to me personally.\n\nQ2. I suppose it depends how far the project/company goes against my beliefs. I have never knowingly been involved in unethical design.\n\nAlso, many of us get involved in group efforts like [Fleurons of Hope](http://web.archive.org/web/20110209170410/http:/www.myfonts.com/fonts/fontaid/fleurons-of-hope/) and [Building Letters](http://web.archive.org/web/20110209170410/http:/www.buildingletters.org/about.html), in this case as a reaction to the 2004 tsunami.\n\n"
    },
    {
      "time": "",
      "content": "Q1. I too do a lot of volunteer work for charities and create for them. However, some are prosperous and wouldn't allow me to design for free (thank you!!!) but I charge them flat rates and much less than I would one of my not-for-profit customers.\n\nQ2. I once designed for a small company in NY - they wanted a rip-off Nike logo. I felt so bad that day, I couldn't sleep -- and when they came in the next day to pick up the work - I asked them to leave. I remember one guy pulling out dollar bills - and I told him it wasn't about the money. I felt that I had sunk so low. I just couldn't live with myself. I do remember I had my office door open when I asked them to leave, and the business next door heard my pleas -- and came in to \"help\" out. We were a very friendly building on E. 44th St. But that's off-topic.\n\nWhat is difficult about your question - is most won't know until they are in that situation. Mine came when the end of typesetting shops was near -- I had payroll, bluecross and so many other expenses to consider, it is why I even talked to those jokers. But in the end, I just couldn't do it.\n\n"
    },
    {
      "time": "",
      "content": "I have done and will continue to do work for charities that I believe in. I get leary when solicited by strangers though. It is sad that there are con-men out there who scam people by pretending to be charities.  \nI would not do any work for shady outfits. I am not clear on what is meant by \"against my beliefs\". It would be a case by case thing. If it bothered me, I would not do it. I do not believe in any religion but would not turn down work for a religious group. I don't believe in suntan shops and think they are silly but I would not turn down work for them. I would certainly turn down work for racist or hate groups and for gun lobby groups like the NRA. Certainly forget any criminal or sleezy work.\n\nThe litmus test is, would I be willing to show my kids the work.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\"Whether you are prepared to design for charities for free or if you would demand a fee?\"\n\nNot sure what the ethical slant on that question is. Doesn't seem to be an ethical-centric question to me.\n\nBut, the answer, of course, is 'it depends'. ;0)\n\n\"Would you design for a firm that goes against your own personal beliefs? Or is money more important to you than your beliefs?\"\n\nI think there's two angles to take:\n\n- pick and choose your work and only work for companies you feel meet your moral and ethical standards\n\n- accept the fact that we are a commercial service provider and that the goal is to give the customer the best of what they ask for independant of any moral and ethical standards of the company.\n\nThe latter is more akin to law. A lawyer is committed to representing the client regardless of their moral and ethical views of the person.\n\nI don't think either one is more wrong/right than the other.\n\n"
    },
    {
      "time": "",
      "content": "another angle on these very good questions is the overall issue of what we are a part of: consumerism and disposability, the commodification of desire, the impact of the products and services we help to promote, the creation and maintenance of identity-based illusions: coolness, hipness, cleanly drawn facades, etc. i feel there may be no clear answer to these questions; only debate, controversy, survival issues, the inevitable politics of the free market, and the infinite complexities of culture itself.\n\nbut the extent to which we participate, select, and respond might make a difference.\n\nrecommended reading: \"captains of consciousness\" by stuart ewen. \"commodify your dissent\" and \"the conquest of cool\" by thomas frank. \"no logo\" by naomi klein. \"emotional branding\" by marc gobe.\n\ni am not endorsing the opinions in any of these books. i recommend them as food for thought.\n\n"
    },
    {
      "time": "",
      "content": "<cite>The latter is more akin to law. A lawyer is committed to representing the client regardless of their moral and ethical views of the person</cite>.\n\nThat's not a good analogy. Lawyers often represent people who appear to be just this side of pure evil, only to be exonerated through something the lawyer turns up, sometimes after a conviction. Designers are in a very different position; designers don't defend people accused of committing unethical acts, designers _become complicit_ in said acts. The designers behind Joe Camel and the Kool penguin made a lot more effort to sell cigarettes to kids than the tobacco executives, whom simply provided the funding and collected the profits. The law firms that represented the tobacco companies only got involved after the fact.\n\n"
    },
    {
      "time": "",
      "content": "Q1. Depends: if I've approached them because I'm already a supporter and I'd like to help, I look at it as my volunteer contribution. If they approach me out of the blue like any other client, I might do it for a reduced fee if I sympathize with their cause. If I don't sympathize with their cause, I would either say no or refer them to someone else if I thought they might want to get involved.\n\nQ2. I don't take money for work/causes that violate my sense of ethics. Had to once when I was young and desperately poor, and was sucked into something that morphed into a situation that was borderline illegal and spent a lot of money getting my name off it. Never again.\n\n"
    },
    {
      "time": "",
      "content": "1. My last design job was working for next to nothing a nonprofit whose ideas I supported passionately. It's one of the shining starts of the nonprofit world, and dozens of people work there, for free, year round. They took advantage of me, treated me like crap, and from here on out I'm following Sagmeister's idea: nonprofits I like get a discount, but nothing free, because if they're not paying they have little reason to care about a designer or his/her work.\n\n2. It all depends on the client. Clients that really do shirk their responsibilities, such as Exxon refusing to pay for cleaning up oil spills, are definitely out. Work that's just blatantly wrong, like tobacco advertising, is also out. But I would happily do work for Kraft foods, even though it is part of Altria, because there's a big difference in selling food and selling addictive carcinogens. To paraphrase Chris, I wouldn't do anything that I won't be proud to show to my potential kids.\n\n"
    },
    {
      "time": "",
      "content": "_But I would happily do work for Kraft foods, even though it is part of Altria, because there’s a big difference in selling food and selling addictive carcinogens._\n\nI'm not sure that's the example I'd use -- Kraft makes some \"food\" that's of questionable nutritive value, like Velveeta.... :-P\n\n"
    },
    {
      "time": "",
      "content": "Is Velveeta actually food or is it just sqeezable yellow plastic?\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Commodify Your Dissent is terrific Ch. Love it! But it's not by one author. It's a series of essays from The Baffler, a magazine out of Chicago. Great book.\n\nAt one time I viewed it as the next logical step after Situationalism.\n\npeace\n\n"
    },
    {
      "time": "",
      "content": "_Is Velveeta actually food or is it just sq(u)eezable yellow plastic?_\n\nIt's got some minimal percentage of a milk-derived product in it, but I suspect it's less than the [casein-based knitting needles](http://web.archive.org/web/20110209170410/http:/www.arnos.com.au/swallow/) I own.\n\n"
    },
    {
      "time": "",
      "content": "1. I am a student. I am poor. BUT! I need to build up my portfolio, and helping out a good cause is much better than working for spec or not designing anything at all.\n\nAs to when the good money starts rolling in from all of the Apple ads that I'll be commissioned to create? I dunno. Certainly if it were a cause that I felt passionately about.\n\n2. Situational morality is the bane of western civilization.\n\n"
    },
    {
      "time": "",
      "content": "\"another angle on these very good questions is the overall issue of what we are a part of: consumerism and disposabilility...\"\n\nI think that's a very good point.\n\nIn the end, as 'commercial artists' we're really an essential part of the consumerist machine. That, alone, has it's own set of ethics to consider.\n\nI once did a web site for a national bank's Political Action Committee. I didn't agree with supporting their cause politically, but I got a lot out of providing them with a web site that met there needs that they were thrilled with. Depending on how wide/narrow you focus your 'ethics lens' on a project can make a huge difference in how you perceive the project.\n\nWould I do another web site for a corporate PAC? I don't know.\n\n\"Altria\"\n\nA great example of Point of View.\n\nIs Altria the ultimate American company? Giving the masses what they truly want: Tobacco, beer and processed cheese? Or are they pure evil? ;o)\n\n\"Situational morality is the bane of western civilization.\"\n\nIt's what our civilization was built upon! ;o)\n\n"
    },
    {
      "time": "",
      "content": "<cite>Whether you are prepared to design for charities for free or if you would demand a fee?</cite>\n\nI'll go with \"it depends.\" How poor am I, what's the charity, and how much work is involved?\n\n<cite>Would you design for a firm that goes against your own personal beliefs?</cite>\n\nIf the firm went far enough against my personal beliefs, I wouldn't work for them. Even in a full-time job situation, I have discovered that there are things I could be asked to do that I would say \"no\" to, for ethical reasons. If that means risking getting fired, or (in some extreme case) quitting, I'd be willing to do that.\n\nOf course, I speak from the comfortable position of having a good income and some savings and so on. I am not about to judge people who take work for clients they are less comfortable with because they feel that's what they need to do just to make a living. I'm just grateful that I don't have to make those kinds of choices.\n\nThe parallel to the legal system doesn't do much for me, btw. The legal system is predicated on lawyers taking cases for people who are or may be guilty. I don't think the universe of design and typography would fall apart if designers and typographers followed their conscience in accepting clients.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "thanks to paul cutler for the correction: \"commodify your dissent\" is an anthology edited by thomas frank and matt weiland.\n\nas for charity work, my own guidelines are as follows: i never work for free. i think it's a bad precedent. but in certain cases i have exchanged services for specific things: a membership, the right to stipulate a specific and visible credit, or enough creative freedom to assure a portfolio piece for me (which can be worth more than a fee), but even then i work at cost.\n\nif a charity or not-for-profit can't meet me there i try to refer them to someone else, usually younger and hungrier...\n\n"
    },
    {
      "time": "",
      "content": "Ch - Since I enjoyed that book so much I will look for the other one you mentioned.\n\non topic:\n\nLike I stated in another thread - I'll work for free for my Mom or if it's just a bunch of creatives having fun - like the type challenges here.\n\nCharities are well funded and in most of them the money goes into administration. Non-profits are the same. If a charity that I believed in could show me the numbers indicating that almost all of the monies collected went to the cause - I would consider it.\n\n#2 All firms of any size go against my beliefs somewhere so the answer is yes.\n\n#3 If money was more important to me than my beliefs then my belief is I would be rich. So no.\n\nLife is not black and white. I take things on a case by case basis…\n\npeace\n\n"
    },
    {
      "time": "",
      "content": "1. I have and would continue to work pro-bono for the right charity. In general I prefer to make donations in money than time but they are interchangeable on some level. I admire those who spend time working at soup kitchens, rebuilding tsunami or hurricane damaged regions, volunteering at schools and orphanages. I don't really do that but don't mind donating my time or design skills - again for the right cause.\n\n2. I have never knowingly worked for a company that violated my ethics. Although I can't say for sure when I don't always know who the corporate parent is. But I design books and \\*in general\\* I would say that books do more good than harm in the world - except perhaps to the trees. I have steered clear of advertising/branding for some of these reasons.\n\n"
    },
    {
      "time": "",
      "content": "It's interesting that \"ethical design\" only ever seems to be discussed in connection with the choices a designer makes in serving (or not) the extremely good, eg. a charity, or extremely evil, eg. \"Googexxonoburton\", client. It's almost as if a designer can only be evil/unethical if the client is evil/unethical. How about designers that are evil/unethical regardless of clients - the type that blag ideas and fonts, or charge the client for hrs spent playing Gears of War?\n\n"
    },
    {
      "time": "",
      "content": "You mean like the ones who set up bogus contests? ;-P I think we've all had enough of that discussion for awhile.\n\n"
    },
    {
      "time": "",
      "content": "And to follow up - when I do pro-bono or reduced rate work for a charity or nonprofit I am very clear about the limits as to how far I'm willing to extend myself.\n\nThe worst case scenario was a client I had (yes, Ch you know the one) who believed that his personal pet project was so noble in purpose that I should be honored to work for him. It was NOT a charity, NOT a non-profit, the money was going straight into his pocket (I'm not even aware of a percentage going to charity) yet he had all the high-minded pretensions that it was and that therefore I should work for him out of the goodness of my heart.\n\n"
    },
    {
      "time": "",
      "content": "Yeah, I've had one of those too. B\\*st\\*rd almost drove me into bankruptcy....\n\n"
    },
    {
      "time": "",
      "content": "<cite>It’s interesting that “ethical design” only ever seems to be discussed in connection with the choices a designer makes in serving (or not) the extremely good, eg. a charity, or extremely evil, eg. “Googexxonoburton”, client.</cite>\n\nI think it's a symptom of the times. Economic populism is seeing a resurgence both from politicians looking for easy votes (John Edwards, Hugo Chavez) and media outlets looking for quick ratings (CNN). This leads back to the old altruism is good, everything else is profiteering mindset, under which nonprofits are saintly and anyone actually trying to _earn_ money is, at best, suspect. Given how badly America has been screwed by phoney economic conservatives in the last six years, it isn't entirely surprising or unwarranted.\n\n"
    },
    {
      "time": "",
      "content": "I am always amazed how many people out there believe that someone that is gifted with talent to design should - give their work away.\n\nThe starving artist is over - we are all part of the commercial graphic arts stage now...\n\nThat same person wouldn't ask their plumber, doctor, dentist, etc. to give it to them for free -- or would they?\n\nI know a lot of very wealthy people - that now that I think about it - would! It is how they have kept their money.\n\n"
    },
    {
      "time": "",
      "content": "<cite>Whether you are prepared to design for charities for free or if you would demand a fee?</cite>\n\nFor free only if it's something I not only believe in, but have total creative control over. The charities must agree on a a quick thumbnail sketch I do on-site. No revisions allowed afterwards unless it's something critical (such as the date for a flyer changing). They are allowed to request what details they want in the beginning, but not after I start the job.\n\nExample: I designed flyers for the local firemen who had a fundraising event to buy new equipment. This was immediately following 9-11. They gave me full creative control and lots of respect and appreciation, and they got a great flyer. The only changes made were adding some program times.\n\nWhat was only intended to be an overnight illustration freebie wound up becoming one of the most talked-about portfolio pieces I've ever had, and it actually helped me get work at one point (the employer had friends at NYFD).\n\n<cite>Would you design for a firm that goes against your own personal beliefs? Or is money more important to you than your beliefs?</cite>\n\nThat depends on how much it goes against your beliefs and how much you are willing to compromise to make a living. If it's something I wouldn't be proud to show to anyone, there's no use doing it.\n\nI turned down an offer to design a web site selling pornographic materials. I did not seek out the work. I had done completely unrelated artwork for one of the company's investors, and that apparently led him to ask me if I'd be interested in doing the job. The money offered for the work was awful hard to ignore, but I just couldn't do something like that.\n\n"
    },
    {
      "time": "",
      "content": "<cite>I am always amazed how many people out there believe that someone that is gifted with talent to design should - give their work away.</cite>\n\nWhat really irks me is that this is so much more of a problem with the visual arts than with many other fields. Why is it that so many people who can see the importance of art and design don't want to pay for it, but those same people don't even think about asking a plumber or electrician to work for free? It seems that the idea that artist don't need money is rooted in the leftist fine art world and its cult of genius, but given how little interest in, or respect for contemporary fine art people appear to have, why are they still carrying around the notion of the starving artist who only deserves a payoff after a lifetime of privation?\n\n"
    },
    {
      "time": "",
      "content": "i'm not sure what jpad means by \"leftist fine art world and its cult of genius\" - you'd have to show me a survey of collectors' politics before i'll buy that one. i think the problem is rooted more in the mysterious process we specialize in. the bulk of our efforts is unseen or misunderstood. the hours spent in sketching, deliberation, revision, and pixel surgery.  \nour commitment to a personal quality standard is hard to quantify, and often what we end up with looks \"easy\". perhaps people don't see graphics the way they hear music. generally they don't see the same level of expertise and practice behind the product.\n\ni work mainly in motion graphics and broadcast design. almost every piece i produce requires music. it has amazed me for years that composers usually get (small) royalties everytime the piece goes on the air - on top of their original composition fee - but my payment is one shot, end of story. or is it because they have a union ?\n\n"
    },
    {
      "time": "",
      "content": "It's how it gets licenced -- shades of EULA -- more than anything else.\n\n"
    },
    {
      "time": "",
      "content": "Everyone is a designer/artist. It defines us as humans. Some of us took the time to hone those skills and turn it into a career.\n\nSo, the scrapbooker, kitchen decorator, quilter, woodworker, etc...these are all design skills that people have.\n\nFurthermore, bad design typically doesn't have an immediately noticable side effect. If I screw up the plumbing, I have wet floors. If I screw up the wiring, I get electrocuted. If I screw up the taxes, I go to jail. Screw up the logo on the brochure? Meh. Life goes on. ;o)\n\n"
    },
    {
      "time": "",
      "content": "My daughter is a composer of music, they get shafted too. The folks with the money make the rules and surprisingly enough, the rules seem to favor them. ;-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Used to drive me crazy in publishing that everyone from the president of the company to the receptionist had an opinion on the design but god forbid I tell the marketing department how to sell. Not that I have the first idea how to sell a book, but I don't think they knew the first thing about design either and that didn't stop them from weighing in on my job.\n\nThat combined with the fact that anybody with a computer and Comic Sans thinks they can put together a newsletter.\n\nAnother pet peeve is a client telling me \"this should be pretty easy for you, no? Shouldn't take very long.\" As Ch says, how do they know?\n\n"
    },
    {
      "time": "",
      "content": "“this should be pretty easy for you, no? Shouldn’t take very long.”\n\nThat is client code for \"you are a real bozo if you can't knock this out fast and very cheap!\"\n\nBetter known as the guilt squeeze.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "<cite>i’m not sure what jpad means by “leftist fine art world and its cult of genius”</cite>\n\nI was referring to the leftist side of fine arts that perpetuates on the belief that artists are better off spending their lives in poverty while trying to generate some wild new concept than they are just making work that people actually want to buy. These are the old hippies in schools and museums who scowl every time an artist who makes a good living from commercial work walks by.\n\nRegarding musicians, isn't part of the reason that they don't get paid well that there are more of them out there then there are jobs? Musicians are like comic book artists—only the famous ones can make much money, because there are hundreds of people begging to get those jobs.\n\n"
    },
    {
      "time": "",
      "content": "The trick, if you're an artist, is to do innovative stuff, not necessarily \"commercial,\" _and_ make a living.\n\nOne of the sad parts is that part of the oppression of artists comes from people like gallery owners, who tell artists that they can't make their work too expensive or \"no one will buy it.\"\n\nA gallery owner who's selling some of my work suggested that I price my items at one level, whether it's in his window or I'm selling directly to clients. Well, if I charge $40, there's a big difference between getting that directly or paying him 40% off the top.\n\nOTOH, if I don't price my work so that I can at least break even on supplies and pay myself something reasonable as an hourly wage, why would I bother even trying to sell it in the first place?\n\n"
    },
    {
      "time": "",
      "content": "\\> These are the old hippies in schools and museums who scowl  \n\\> every time an artist who makes a good living from commercial  \n\\> work walks by.\n\nwell, i get your idea but i don't think this generalization is really accurate. most of the art students i know want to be rich and famous art stars. the market is driven by rich collectors who i suspect are not exactly \"lefty hippies\". i think the conflict is more theoretical: the pretense of \"fine art\" vs. commercial art, but it's not strictly about money or poverty.  \ni've also noticed more and more gallery artists contributing (selling) their work to pop cultural design - especially CD covers. i'll try and collect some examples. later. gotta work.\n\n"
    },
    {
      "time": "",
      "content": "Beck uses fine artists - Marcel Dzama, Tim Hawkinson to name a few - for his CD covers.\n\n"
    },
    {
      "time": "",
      "content": "_Whether you are prepared to design for charities for free or if you would demand a fee?_\n\nI have done work gratis, for green groups.  \nCharity starts at home: SOTA (organizer of Typecon) is a non-profit organization which would not be possible without volunteers. The same is true of many industry organizations. However, there is \"payback\" in non-monetary ways -- but the same is true of all pro bono work.\n\n_Would you design for a firm that goes against your own personal beliefs? Or is money more important to you than your beliefs?_\n\nI once declined to work on a campaign for Litton, which manufactured the guidance system in cruise missiles. However, designing a logo for a \"green\" warship is a much tougher ethical dilemma. [http://typophile.com/node/31243](http://web.archive.org/web/20110209170410/http:/typophile.com/node/31243 \"http://typophile.com/node/31243\")\n\n"
    },
    {
      "time": "",
      "content": "_Whether you are prepared to design for charities for free or if you would demand a fee?_\n\nPart a), nope - never! Part b), I understand a 'fee' can be paid in many forms, ie. an exchange of goods. I always demand something in return for my work.\n\n_Would you design for a firm that goes against your own personal beliefs? Or is money more important to you than your beliefs?_\n\nPart a), hell no! Part b), hell no!\n\n@ Thomas _The legal system is predicated on lawyers taking cases for people who are or may be guilty._\n\nIn my time I have retained Corporate lawyers, IP lawyers, and Real Estate lawyers. All of which were hired to protect my ideas and designs. And yes I think an 'idea' is the soul of an Individual, and the very seat of democracy - something we should protect and not let be run over nor given away for free.  \n\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "",
      "content": "jpad, I don't think you know any real hippies. The art business is a business like any other. There are both wolves and lambs and wolves in sheep’s clothing. Like any other field, there are pretentious people, nay-sayers, and phonies. You have to take people one at a time for who they are. That is a lot tougher than generalizing but it is at least more fair. Yes, there are some Ivory Tower types at universities who get paid to teach art and be critical of others, but this is not the majority (but they tend to be the noisiest ones).\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Not to mention the way the art world has changed in the last 30-40 years. It's a lot less friendly to \"idealists\". New York in 2007, where it is virtually impossible to find an affordable apartment anywhere you'd want to live and the overhyped art world is dominated by vast international fairs, white box galleries and collectors, is a wildly different place than NY of the 70s and 80s when artists lived in subsidized lofts in SoHo and there was an energetic and experimental cross pollination between the various art disciplines. And you could visit all the major galleries in an afternoon! Today's art stars seem unfortunately, to be the gallerists and guest curators, not the artists themselves.\n\nIMHO it'll take a major economic downturn and the wallstreeters moving onto the next big thing before the art scene in NY recaptures it's vibrance. I'm glad I was young & idealistic (and broke) in a different era!\n\n"
    },
    {
      "time": "",
      "content": "1) Yes. Or, No, but I'll make exceptions.\n\n2) I work 2 ways. As a graphic designer, I do as I please, higgledy-piggledy. I choose projects and clients on the very limited knowledge I have of their ethics, and warm rapidly to like minds, as a relationship matures. I tend to give people the benefit of doubt, as I am aware that my own opinions and ethics change over time. And being repellent is, well, repellent. I try to be a moderate fanatic.\n\nAs !Exclamachine, I am not normally targeting individual clients. I put something out there, and it sinks or swims. I have limited control of the use of my faces. Nevertheless, I can affect my ethics regardless of the source of any funds, and make the purchasers aware of that. In order ensure !Exclamachine's agenda is funded, 5% off the top goes to Sabre International, and more goes to supporting Typosium and another non-profit project, along with a considerable amount of time.\n\nIf AcmeWorldCorp Inc. wants what I offer, they can buy my world view with it.\n\n⁂\n\nAmerica is good for the advancements of the arts only through strength in numbers. I know too many proud citizens who have never been to any show but SFMOMA's \"The Art of Star Wars\". The general tendency of many Americans only to respect financial success, to shun elitism, and to choose casual individuation paired with from-the-hip analysis makes it a poor spawning ground of high culture. But dang if there aren't enough of us to have an impact anyway.\n\n"
    },
    {
      "time": "",
      "content": "I like fine art and the process of creating it, but it's not as fun for me as designing commercial art for the masses. I'm sure that sounds shallow/dull/uninspired, but in truth I actually thrive working under the corporate umbrella. My heart is in that kind of work and the fun part for me is seeing how far I can push the limitations I'm given... yes, I am a silent design rebel in starched clothing. :-) And that is the statement that I wish to make, and I make it almost every time.\n\nOne lady I did design work with had spent some time illustrating shoes and furniture for store catalogs (I believe Sears Roebuck, IIRC). She was one of the best fine artists I'd ever worked with, and of course with the abilities she had, drawing shoes was a very narrow scope of her talents. I never considered her as some kind of corporate sell-out or someone who compromised her beliefs for cash. She was simply making a living and it certainly didn't affect her ideals or her talents. She taught me so much.\n\n"
    },
    {
      "time": "",
      "content": "Sam\n\nIt's great that you've been assigned this as a subject (judging from the clouds of ethical dust this post has stirred up); I don't know when you have to have it done by, but my tuppence worth on this subject would include [Fresh Dialogue 6: Friendly Fire,](http://web.archive.org/web/20110209170410/http:/www.papress.com/bookpage.tpl?isbn=1568985827&cart=117101787221725) convened by James Victore for the AIGA and published by Princeton Architectural Press. A very interesting read.\n\nTo answer your questions  \n1. I did work for free and/or volunteer assignments for the charities and non-profits I supported when I was a student in London. It was a privilege (I also worked for some of them on a salaried basis, but not as a designer. That was just work). These days I would charge a fee – if only to avoid the faffing-around factor.  \n2. To do something you don't believe in for the sake of money is to relegate yourself to the point of prostitution, whatever your line of work is. Having said that, I've done commercial work that was 'less than noble' because the noble thing to do at the time was pay my bills and feed my family. But I've never put myself in the position of having to fire a client outright on ethical grounds.\n\n"
    },
    {
      "time": "",
      "content": "1. I've donated time to charities for work, and write it off at the end of the year. My mom runs one, so it's kind of expected that I do something for her when asked. I never mind. I've also done work for a few no-profits while working in a studio and some of them really take everything to the nth degree and it's torture.\n\n2. What I find morally unacceptable and the work I do have not crossed paths. I've come up against unethical and that's enough for me to walk away from a project, however.\n\nI'm sure you already know, but professional organizations like AIGA and GDC provide ethical guidelines for designers as well, which is worth checking out, if only to have another view of 'ethics'.\n\n"
    }
  ]
}
