{
  "id": "31238",
  "title": "trilled \"r\" keystroke/display",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Looking to find the correct keystroke/image of reference for a trilled \"r\" commonly seen in Spanish. For example the word for red in spanish is rojo. The \"r\" is rolled. How would this appear in an American dictionary in pronunciation context.\n\nI am trying to sound out my name... Rajeswaran Shanmugasundaram\n\n",
  "author": "erg8t",
  "time": "7 Feb 2007 — 10:08am",
  "uid": "16192",
  "comments": [
    {
      "time": "7 Feb 2007 — 10:38am",
      "content": "It’s just a plain **r** … as far as I’m aware. It’s called an **alveolar trill**.\n\nThe _r_ in “rojo” isn’t rolled, it’s the _rr_ sound in “perro” you’re after.\n\n"
    },
    {
      "time": "7 Feb 2007 — 5:44pm",
      "content": "Not a uvular trill?\n\nThere must be some special way to indicate it in pronounciation keys. It isn't a natural American English sound, so I wouldn't expect to find it in American dictionaries, but what about Spanish dictionaries?\n\n"
    },
    {
      "time": "7 Feb 2007 — 8:46pm",
      "content": "I think he is talking about the second r (I can't remember how to type it - it has a symbol like the ñ above it). It is the rolled r. It would not appear in an American Dictionary.\n\nHere's a link to IPA (International Phonetic Alphabet) fonts. Maybe that will help you.\n\n[http://scripts.sil.org/cms/scripts/page.php?site\\_id=nrsi&id=IPAhome](http://web.archive.org/web/20131010192510/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&id=IPAhome \"http://scripts.sil.org/cms/scripts/page.php?site\\_id=nrsi&id=IPAhome\")\n\npeace\n\n"
    },
    {
      "time": "8 Feb 2007 — 3:17am",
      "content": "Various phonetic realisations of **r** on Wikipedia.\n\n[http://en.wikipedia.org/wiki/R#Various\\_phonetic\\_realizations\\_of\\_R](http://web.archive.org/web/20131010192510/http:/en.wikipedia.org/wiki/R#Various_phonetic_realizations_of_R)\n\n"
    },
    {
      "time": "8 Feb 2007 — 4:43pm",
      "content": "I finally found this again -- I was fascinated to find that some Latin American type designers have taken it upon themselves to create ch, rr, and ll ligatures to reflect the fact that these are considered separate letters in Spanish (although, to my understanding, ch is now two letters according to the RAE). Cristian Gonzalez's Origen uses all of these, plus a ck ligature (image from a \"seleccion\\_typecon\" PDF I have on my computer, maybe from the Letras Latinas website). I'd find it difficult to read the rr ligature in text, but maybe this is a mildly common thing in Spanish writing to do. Just thought this was a cool thing to bring up -- I don't have much to say about phonetics.\n\n ![](http://web.archive.org/web/20131010192510im_/http:/typophile.com/files/OrigenLigs_5660.jpg)\n\n"
    },
    {
      "time": "8 Feb 2007 — 5:01pm",
      "content": "Interesting thread, and a great example Reed. Kind of makes me wonder about certain English letter combinations and irregularities. Speaking of which...\n\n_I am trying to sound out my name… Rajeswaran Shanmugasundaram_\n\nI'm surprised someone here in the U.S. hasn't tried to call you Ral **ph** Smith yet. :)\n\n"
    },
    {
      "time": "9 Feb 2007 — 12:03pm",
      "content": "Conor,  \n<cite>The r in “rojo” isn’t rolled, it’s the rr sound in “perro” you’re after.</cite>\n\nThanks for the correction. It's been a long while since my Spanish classes. Those were the days. I simplified my name to Raja and got called everything but that: \"Raha, Haja\" and sadly even, \"Haha\"\n\nauricfuzz,  \nThanks for the posting that image, I was thinking that a stacked \"rr\" would be the best way to represent it.\n\nbiddy,  \nI like prefer and like to go by \"Raja\" but some people feel that they can go ahead and call me \"Raj\" — which I can't stand — when I've already done them enough of a favor.\n\n"
    },
    {
      "time": "9 Feb 2007 — 12:19pm",
      "content": "What about the digraph rr where the two r's fit together like the digraphs ae & oe? I have been meaning to double check if it exists in the unicode yet. It may just be a Catalan thing not a spanish thing. I don't know. I think it corresponds with the Alveolar flap.\n\n"
    },
    {
      "time": "9 Feb 2007 — 9:25pm",
      "content": "_I like prefer and like to go by “Raja” but some people feel that they can go ahead and call me “Raj” — which I can’t stand — when I’ve already done them enough of a favor._\n\nLOL! Raj! I knew someone would have tried to call you that! Us Amori-cans love nicknames! Like \"Scooter\" Libby. What grown man doesn't like to be called Scooter? ;)\n\n"
    },
    {
      "time": "9 May 2007 — 12:48pm",
      "content": "I came across this thread from Eben's link on another thread. The LL ligature is something I've seen a little more often, but haven't really seen anything standard for the ll. Ch and ch seems to be getting a little more usage in Spanish typography. The rr ligature I've never seen before, and certainly isn't used in handwriting (but then again, neither is the Ch or ll).\n\nThe symbol commonly used in American dictionaries for a alveolar trill is either r-acute or r-macron, depending on style. In IPA, an alveolar trill is a standard r, whilst an alveolar flap is an r without a full termination on the loop.\n\nAlso, rojo is pronounced with a full alveolar trill. All _r_'s at the beginning or end of a word, or following certain phonemes are realised as trills. Incidentally, with the exception of Indian or Scottish English, an phonetic transcription of English would never have either types of r (words like, well, _word_ actually have a an alveolar or retroflex approximates, which are represented by an r-turned or an r-turned-hooked.\n\nAnd cuttlefish, in some dialects of Spanish (Rioplatense) it can be realised as a uvular trill (just as in some Caribbean or Mexican dialects it can be realised as in English). But the so-called \"standard Spanish\" it's an alveolar trill.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos». (La Luz Oscura, por Javier Guerrero)_\n\n"
    }
  ]
}
