{
  "id": "31239",
  "title": "Type design internships in/around DC",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m starting to hunt for summer internships, and I have two questions. First, are there designers or design firms in or around Washington, DC that do a lot of type design and might need interns?\n\nSecond, and this is the tough part, my school has NO type design or lettering classes. Custom lettering is actually frowned on by some instructors. So as I update my portfolio, I’ll end up with a mishmash of video, web, flash, and print pieces, none of which will include much, if any, custom lettering. My work load at school is pretty heavy, so my experiments with type design are often limited to playing with calligraphy here and there, and I’m starting on some letter designs, but I don’t expect to have a single finished font before summer. Should I even be looking for a type design internship with my tiny amount of related experience, or should I stick with a more general design firm, keep learning type design on the side, and try to land a type design internship after I graduate next year?\n\n",
  "author": "<a href=\"/web/20091205091622/http://typophile.com/user/14722\" title=\"View user profile.\">James Puckett</a>",
  "time": "<br>",
  "uid": "14722",
  "comments": [
    {
      "time": " 7.Feb.2007 10.45am",
      "content": "James,  \nWhere are you going to school? Must your internship be in the DC area?\n\nI don’t think DC is a hotbead of type design and the only people I know in the area are one-person shops operating out of their own homes. I would be surprised if you could find a type design internship around here and think looking elsewhere might be a better bet.\n\nChrisL\n\n"
    },
    {
      "time": " 7.Feb.2007 10.55am",
      "content": "Philsfonts.com, the sales site, and the related foundry, Garagefonts.com is in suburban Maryland. I don’t know anything about either.\n\n"
    },
    {
      "time": " 7.Feb.2007 11.06am",
      "content": "A friend of mine worked for Rowman and Littlefield Publishing designing book covers, might be worth an investigation...\n\n[http://www.rowmanlittlefield.com/](http://web.archive.org/web/20091205091622/http:/www.rowmanlittlefield.com/ \"http://www.rowmanlittlefield.com/\")\n\n"
    },
    {
      "time": " 7.Feb.2007 12.19pm",
      "content": "Phil’s Fonts is a distributor, not a design shop.\n\nChrisL\n\n"
    },
    {
      "time": " 7.Feb.2007 12.22pm",
      "content": "Chris, don’t you need some help getting your typefaces out the door? :P\n\n"
    },
    {
      "time": " 7.Feb.2007 12.47pm",
      "content": "Paul, I need help getting my feet out the door! :-P\n\nChrisL\n\n"
    },
    {
      "time": " 7.Feb.2007 1.34pm",
      "content": "<cite>Where are you going to school? Must your internship be in the DC area?</cite>\n\nI’m a junior at the [Corcoran](http://web.archive.org/web/20091205091622/http:/www.corcoran.edu/) and I live in DC year-round. I’m 28 and pretty settled here with two dogs and a significant other, so packing up and heading to another city for three months is not an easy option. After I graduate we might be able to swing a summer in New York because my SO’s law firm has a big office there, but we have enough going on here this summer that leaving town is not an option.\n\n"
    },
    {
      "time": " 7.Feb.2007 2.07pm",
      "content": "It has been years since I visited the Corcoran. What is it like as a design school? Can’t they help you get internships?\n\nMost of the people I know who design type are self-taught. Some lucky few go to Reading.\n\nChrisL\n\n"
    },
    {
      "time": " 7.Feb.2007 3.19pm",
      "content": "_the only people I know in the area are one-person shops operating out of their own homes_\n\nYup: I’m one of them. Not much room for anyone else with four computers and about 300 reference books in a 10x13 room...\n\n_Phil’s Fonts is a distributor, not a design shop_\n\nPhil’s (owned by a guy named Ralph—go figure), located in Sandy Spring, actually DOES do some font development. If you read their blurb on submitting fonts, they even accept drawings and convert them to digital format; however, whether or not they do a lot of this and/or could use some help, I do not know.\n\n"
    },
    {
      "time": " 7.Feb.2007 4.15pm",
      "content": "<cite>It has been years since I visited the Corcoran. What is it like as a design school? Can’t they help you get internships?</cite>\n\nOverall the Corcoran is pretty impressive. I could nitpick about things that I don’t like, but compared to some horror stories I’ve heard about other schools, I’m amazed at the quality of education that I get for the money. Classes are tiny—most studio classes never have more ten students and lectures rarely get past twelve. The quality of instruction is generally exceptional and the majority of the professors are local design leaders and incredibly enthusiastic. If you’re familiar with Bauhaus curriculum you’ll know how the program works; it’s all rooted in what Johan Severtson set up when he ran the program, and he was trained at Yale when the great modernists were teaching there. If you want to stop by some time let me know and I’ll put you in contact with the head of the design department.\n\nAnyway, the Corcoran does have an internship program, but it’s not perfect. I don’t need the credits to graduate, so it’s not necessary for me to jump through the hoops of college bureaucracy when it’s probably easier for me to just find something on my own.\n\n<cite>Most of the people I know who design type are self-taught. Some lucky few go to Reading.</cite>\n\nI’ve pretty much got the impression that learning type in school is a graduate level thing. Fortunately there are some great law and design jobs in San Francisco/Palo Alto, so after I’m done at the Corcoran I think that I’ll try to get in to the design program at Stanford to study type there. Or at least I will if they’ll let me in with my crappy 3.7 GPA...\n\n"
    },
    {
      "time": " 8.Feb.2007 11.40pm",
      "content": "You should give Ralph Smith at Phil’s Fonts/GarageFonts a call. I used to work there, and we had several design interns. Phil’s Photo, which preceded the digital foundry/distributorship, was one of the best phototype houses in the country. There really was a Phil back in the day, but Ralph took over the business after working there for many years. Ralph gracefully made the transition to digital as an early adopter.\n\nI’m not saying you’d be drawing type all day (or all that much), but you would learn a great deal about the type business from all different angles. Ralph is also a big supporter of independent designers and foundries, and he knows a lot about type. Internships with type businesses are rare, so it’s worth exploring since you’re in the area.\n\n"
    },
    {
      "time": " 11.Feb.2007 6.52am",
      "content": "Thanks for pointing me at Phil’s. Some of my instructors used to order their Photolettering from him (I’ve seen his old specimens shown in class as examples of type history!) so one of them should be able to help!\n\n"
    }
  ]
}
