{
  "id": "31258",
  "title": "(x) Diário de Coimbra nameplate - Ambroise {dojr7}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello,\n\nI’ve been trying to ID this didot/bodoni typeface used on our local newspapper, which I use a lot, so I need this in vectors.\n\nThe closest I could get was Bodoni Campanile or Bitstream Modern 725. Can anyone Id this?\n\nThanks in advance  \nAdriano\n\n| Attachment | Size |\n| --- | --- |\n| [logodc.jpg](http://web.archive.org/web/20080905092537/http:/typophile.com/files/logodc.jpg) | 24.01 KB |\n\n [‹ Mermaid Melody Pichi anime font](http://web.archive.org/web/20080905092537/http:/www.typophile.com/node/31262 \"Go to previous forum topic\") [(x) Drammen logo - ITC Serif Gothic (customised) {Martin L'Allier} ›](http://web.archive.org/web/20080905092537/http:/www.typophile.com/node/31261 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080905092537/http://www.typophile.com/user/1735\" title=\"View user profile.\">adriano</a>",
  "time": "<br>",
  "uid": "1735",
  "comments": [
    {
      "time": " 8.Feb.2007 7.33am",
      "content": "It’s one of the version of Porchez’s Ambroise  \n [http://www.typofonderie.com/alphabets/use/Ambroise](http://web.archive.org/web/20080905092537/http:/www.typofonderie.com/alphabets/use/Ambroise \"http://www.typofonderie.com/alphabets/use/Ambroise\")\n\nIt is a rather fine font.  \nYet, I believe that to a large extent it misses the point of Didot fonts. Their beauty is in their dryness, some would say their haughtiness. They should look grand, not pretty. The curves introduced in the K and k don’t really work, I think: they bring the characters back to calligraphy when the greatness of Didot fonts is that they go one step further than the Bodonis by departing even more from writing.  \nAt least, this is what I like about them and I believe is their specificity.\n\n"
    },
    {
      "time": " 8.Feb.2007 7.38am",
      "content": "On the page I quoted, have a look at the Idéologie Marketing book: they don’t use Ambroise for the word Marketing, and I wonder whether it is because they share my dislike for the k.\n\n"
    },
    {
      "time": " 8.Feb.2007 7.41am",
      "content": "On the other hand, the page saying spirito folk uses the k...\n\n"
    },
    {
      "time": " 8.Feb.2007 7.43am",
      "content": "I also have to say that I totally approve of the g, even though the design from the second set of Marcellin-Legrand character from the Imprimerie Nationale is perhaps more convincing.\n\n"
    },
    {
      "time": " 8.Feb.2007 7.44am",
      "content": "I also approve undeservedly the s with finial that appears on the word lumières, and which is much better thatn the s with serifs that appears in spirito folk.\n\n"
    },
    {
      "time": " 8.Feb.2007 7.47am",
      "content": "The y is also rather fine. Not the version based on the u that appears on type design today but the version based on the v, which appears on the main page on Ambroise.\n\n"
    },
    {
      "time": " 8.Feb.2007 8.55am",
      "content": "Thanks :)\n\n"
    }
  ]
}
