{
  "id": "31259",
  "title": "Justification advice in InDesign.",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello, this web site seems like a really good place.\n\nI would appreciate your advice on setting type in InDesign. I have only just started using this software, I have previously only used Photoshop for typography because I have not had such specific requirements until now. So I am trying to learn the software and this is my first problem. Hopefully you can help.\n\nI print an art magazine. It is a very simple little thing, I normally print 100 or 200 copies and it is all screenprinted, letterpressed, rubber stamps et cetera. I do not call it a 'zine' because it is not, though it does have a 'cheap' aesthetic.\n\nThe next issue is going to be printed on a sheet of oversize A2 paper. One side will be screenprinted and the other side will be some kind of lithographic process. Hmmm... I am probably explaining too much but it does say to provide as much information as possible in the forum guide and I am enjoying talking about the magazine, so sorry...\n\nOriginally I was going to letterpress the other side (the non screenprinted side) but having decided to make 500 copies and realizing that I will probably not be able to find enough type I have switched over to using a computer and plate print.\n\nThe layout of this side will be similar to a traditional newspaper. I am going to have a header with the title and then eight columns running the full length of the page. Each column will be two inches (12 ems) wide and the gutters will be 1/8th of an inch. The full width of the print area will be 16 7/8 inches. I am probably going to be using 10pt Baskerville (which might raise another question later on). The page will be full of type, closely packed together and printed as black as possible; I want the columns to appear as eight black drips of tar or oil running down the page.\n\nAnyway, my apologies again, here is my question, almost:\n\nI want the type to be justified in the columns but not in a typical sense. I will have to put an image here to show you a vague example of what I mean:\n\n ![](http://web.archive.org/web/20130901044354im_/http:/typophile.com/files/type_5318.gif)\n\n-\n\nDoes this help? Basically the idea is that I am going to be using InDesign in the same way that I would be if I were using letterpress, rather then evening out the spacing between each word to justify the type I am just going to put all of the space before the last word in each line. I am not sure how this is going to look but the intention is for it to appear like a crack running down the column, it does not work particularly well in the code example above but the idea is there.\n\nI know that you can 'Insert White Space' in InDesign; em spaces, en spaces, thin space et cetera so that is useful. But I want to know if it is possible to calculate the width of each line so that I can work out exactly how much space I need to insert before the last word so that the columns are justified perfectly. (?)\n\nDo you know how to do that?\n\nThank you for your help.\n\n",
  "author": "adamburton",
  "time": "8 Feb 2007 — 6:47am",
  "uid": "16727",
  "comments": [
    {
      "time": "8 Feb 2007 — 6:59am",
      "content": "If you don't mind dealing with every line manually, you could perhaps use tabulator before the last word to flush it right?  \nThat's just the first idea that comes to my mind, there might be a better solution to this.\n\n"
    },
    {
      "time": "8 Feb 2007 — 7:04am",
      "content": "So fast! Thank you but... Um... What is tabulator?\n\n"
    },
    {
      "time": "8 Feb 2007 — 7:06am",
      "content": "The solution I'd use would be to put in a ghost polygon, tinker the size of it so that the text flows around it, and ensure that hyphenation isn't turned on.\n\nPerhaps the question I would ask you is \"why do you want to space it this way?\" It's a real pain to read!\n\n"
    },
    {
      "time": "8 Feb 2007 — 7:08am",
      "content": "Thank you Linda, but unfortunately again I have to ask...  \nWhat is a 'ghost polygon.'?\n\nTo answer your question, I just want it to look strange, legibility is not my first concern.\n\n"
    },
    {
      "time": "8 Feb 2007 — 7:12am",
      "content": "I would do the following:\n\nOpen up your tabs window (type \\> tabs).\n\nPick the little arrow third along and then simply tab the last word so it justifies to the right.\n\nIt could be that simple, unless I've misunderstood your query...\n\n ![](http://web.archive.org/web/20130901044354im_/http:/typophile.com/files/tabs_3626.jpg)\n\n"
    },
    {
      "time": "8 Feb 2007 — 7:18am",
      "content": "Adam, InDesign lets you create shapes somewhat (although nearly not as sophisticated) as Illustrator. You create one (in this case, I'd use a very tall and narrow rectangle), ensure that it has a text wrap put around it, and then go crazy adding points on the text wrap bit to nudge words over to fill spaces as necessary.\n\nWhen you're done, you ensure the rectangle is \"invisible\" by making sure that \"none\" is checked for both line and fill. You still have to tinker a lot by hand, but it's easier than mili's solution, particularly if you end up changing some of the text you're setting.\n\nRead InDesign's help stuff on text wrap, and it should be pretty self-evident.\n\n"
    },
    {
      "time": "8 Feb 2007 — 7:33am",
      "content": "Nice one, Linda! I knew someone would have a more flexible way of doing this.\n\nMiss c explaned my solution more clearly. The tab key is the one below § (arrow and /)\n\n"
    },
    {
      "time": "8 Feb 2007 — 7:36am",
      "content": "Thanks, Mili -- I've had to do so many text wraps over the years, I could probably do it in my sleep.... ;-)\n\n"
    },
    {
      "time": "8 Feb 2007 — 7:58am",
      "content": "Both Fay and Linda's methods should work, but I thought I'd add my own preferred method. If you turn on \"justify all lines\" (_not_ \"justify with last line aligned left\"), you can add what's called a flush space (Type\\>Insert White Space\\>Flush Space) before the last word on each line. The cool thing is that the flush space will grow to whatever size is necessary to completely justify the line, without adding space between your other words. I think that would be quickest of all these methods, although it's still a manual process.\n\nTo make it work best, you should decide before adding the flush spaces exactly which words you want per line, then add forced line breaks (shift-return) at the end of each to ensure that no words change position. I also deleted the final space on each line to make it all behave in an orderly fashion. Hope this helps.\n\n"
    },
    {
      "time": "8 Feb 2007 — 8:01am",
      "content": "I used to use that one, but found that, invariably, silly people wanted to muck around with the words and then I had to go back and mess around with fixing the spaces again. Discovered that using the text wrap thing was much faster when changes were made. ;-)\n\n"
    },
    {
      "time": "8 Feb 2007 — 10:05am",
      "content": "Sounds familiar, Linda. It would be so nice if the text sent for a layout was the final version (pigs might fly). I do a fair bit of packaging design, and am always baffeled by the changes in the ingredients or nutritional values at such a late stage.\n\n"
    },
    {
      "time": "8 Feb 2007 — 10:10am",
      "content": ";-) You mean like \"oops, salt should be at the top of the list of ingredients\"?\n\nBeen down that road: it's amazing how many clients think that the proof stage is when they should be making changes....\n\n"
    },
    {
      "time": "8 Feb 2007 — 10:20am",
      "content": "In my experience there's a big pyschological factor in this, and very much human nature rather than technical: Somehow in manuscript or in galley proofs, the clients don't notice it as much, even if they _want_ to. (I find it's true for myself in these situations, too.) There is a powerful aura of formality about the page proofs (or whatever the final stage is, depending on project) that has the extraordinary ability to make things jump off the page. Seems to me there's an extra antenna that runs up out of the top of everyone's head, that has been retracted and unused in earlier proof stages. Maybe on a subconscious level we realize that this is \"speak now or forever hold your peace\"??\n\n"
    },
    {
      "time": "8 Feb 2007 — 10:25am",
      "content": "\\>the extraordinary ability to make things jump off the page\n\nRight on, Bruce. This is the magic of well set type. ...as well as the last bit of the apple thing.\n\nLinda, say three times: I am serving the author, I am serving the author, I am serving author. {ducks flying egg} And should be paid well for it! {the egg missed by an inch}\n\n"
    },
    {
      "time": "8 Feb 2007 — 10:39am",
      "content": "Bruce, you're absolutely right, of course, and I'll readily admit to being guilty of this one myself. ;-)\n\nBill, the only problem with that is I am the author some of the time and can't resist the opportunity to tweak just one more thing. (And thanks, I needed a good laugh! But I'm not a thrower....)\n\n"
    },
    {
      "time": "8 Feb 2007 — 11:57am",
      "content": "The real answer is to design the type Flush Left Rag Right. InDesign will make the rag as good as it could get. Justifing small columns is just a disaster waiting to happen. The only way around it is to have a writer making edits of your copy to make it look right.\n\n"
    },
    {
      "time": "9 Feb 2007 — 3:29am",
      "content": "Adam, do you know of Phil Baines' early work? Seems to ring a bell with what you're intending.\n\n_I am probably going to be using 10pt Baskerville (which might raise another question later on)._\n\nWhich was...?\n\nAs for  \n_There is a powerful aura of formality about the page proofs_  \n – I hear that CTP plates are now referred to as 'metal proofs' in the printing trade!\n\n"
    },
    {
      "time": "9 Feb 2007 — 5:04am",
      "content": "Hello everyone, thank you very much for your help, it is interesting to see how a discussion splits off in different ways.  \nI am a beginner with InDesign and also with the rules of typographical layout in general so you will have to excuse me because I do not understand everything that you have told me and so I am going to have to ask a few questions to figure out which is the 'real answer'.\n\nmili:  \nWhat do you mean by using a tabulator?\n\nmiss c:  \nThank you but I could not get this to work, none of the four tabs seemed to affect the words at, except on the line below. I am probably doing it wrong so if you think that there might be a different way of explaining how to do it then I would appreciate it.\n\nLinda:  \nI had a try with your 'ghost polygon' but it did not work. However I need to find out if the cellpadding (I can only talk in html) is adjustableable because that appeared to be the problem. The computer that I am at now does not have InDesign on it so I cannot work on it at the moment. I will let you know how it goes.\n\nauricfuzz:  \nThis seems like a sensible suggestion but as above I have not been able to try it yet. I had seen the 'flush' space option in the Insert White Space menu and wondered what it was for, so thank you for revealing it to me; the help files that come with InDesign (on a Mac) do not give away much detail on the purpose of the tools available in the program, which has been a major part of my not being able to use it. I will give it a try.\n\nDan Weaver:  \nI like the way you just swooped in like that with the 'real answer'. Earlier on today I had a couple of minutes to see if I could find anything to do with 'Flush Left Rag Right' in InDesign but I did not get very far. Would you mind Dan, if you have the time, explaining to me how I go about designing the type Flush Left Rag Right, I mean, what buttons I have to press... like I said, this whole process: software, vocabulary, way of working, is new to me, and although I have worked with letterpresses I usually cheat my way out of the problem and ignore (due to my ignorance) most of the rules. So an explanation would be very useful. Thank you.\n\nben\\_archer:  \nI have not heard of Phil Baines but having looked him up on the web I see that he designed the typeface for the cover of Raw Creation, which is a book that I was looking at recently and enjoyed very much. Do you think that you could point me towards some kind of online resource where I might be able to find some of his early work, I am genuinely interested.  \nMy other question, to do with Baskerville, well maybe I will start another thread for that because I do not want this thread to become too confused, so when I have done that I will put a link to it right here:\n\n[Black / Dark Typefaces, Um... Old Style (?).](http://web.archive.org/web/20130901044354/http:/typophile.com/node/31300)\n\nThank you all again for your suggestions. I will keep messing about with it.\n\n"
    },
    {
      "time": "9 Feb 2007 — 11:47am",
      "content": "Adam my email is [dgweaver53m@mac.com](mailto:dgweaver53m@mac.com)\n\ngive me your email address and I will give you a visual lesson about justification vs rag right.\n\n"
    },
    {
      "time": "11 Feb 2007 — 8:29am",
      "content": "Well having messed about with this for a while I am thinking about following auricfuzz's advice because I cannot figure out how to get ghost polygons or tabs or anything else to work.\n\nI have only just emailed Dan though and I am sure that he will have some useful advice.\n\nNow I just need to figure out how to force a line break and insert a flush space with one click of a button.  \nDoes InDesign have Actions?\n\n"
    },
    {
      "time": "11 Feb 2007 — 10:31am",
      "content": "Yes, the auricfuzz’s version seems like a good one.  \nUnder edit there is keyboard shortcuts, where you could allocate a preferred shotcut (say apple+1) for the flush space. The forced line break needs to go after the last word on the line, so an action might be a little difficult to build. Mind you, some script wizard is bound to figure that out.\n\n"
    },
    {
      "time": "12 Feb 2007 — 12:46am",
      "content": "Adam, online resource-wise I think you'll only see Phil Baines’ more recent work and books (which have only a rather vestigal relationship to what you're attempting).\n\nThe early work which I was referring to was profiled in baseline magazine #11, the Bradbury Thompson issue, which was published by Esselte Letraset in 1989. According to the current [baseline website](http://web.archive.org/web/20130901044354/http:/www.baselinemagazine.com/) it is available but, as a very rare back issue, they'll want to charge you £50 for it.\n\nI've just tried out Reed's (auricfuzz) method for the flush space/forced justification and it will do what you want, but when he said _...it’s still a manual process_ he meant exactly that (Indesign does have scripting but I can't think of a way to automate this).\n\n"
    },
    {
      "time": "12 Feb 2007 — 11:57am",
      "content": "Hello Ben,\n\nsomehow, when you mentioned Phil Baines before I managed to completely forget that I work part time as a security guard in the library of an art and design university (where I am a student and) where I am at work right now.\n\nI just had a look for some Phil Baines books and it turns out I have actually read, or partially read, one of his books, Type & Typography. Also we have back issues of Baseline magazine in the office, which is where I am right now, and I just went to have a look, very excitedly, thinking that I would save myself fifty pounds but they only go back to Number 18! So no luck. Tomorrow, when the librarians are here, I will ask them if they have the older issues in the store downstairs or if I can get an inter library loan from another college so not to worry.\n\nRegarding Reed's (auricfuzz) method, I had a feeling it would be repetitive. I like those kind of tasks though because I feel as though I am doing something that the program was not designed to do and therefore it might look slightly interesting.\n\nIf you have any suggestions for a dark typeface that would suit this project (more details in the post) please have a look at my other question posted [here](http://web.archive.org/web/20130901044354/http:/typophile.com/node/31300).\n\nThank you everyone for your advice, it has been a useful and interesting experience.\n\n"
    },
    {
      "time": "12 Feb 2007 — 2:33pm",
      "content": "Yes Adam, I'd be very excited too if I thought I could save myself 50 quid (especially for something I already owned), but Type & Typography is very good – well worth the money.\n\nI looked at the question and responses in the other post about a dark text face; it seems like you've painted yourself into a corner there.\n\nFor some reason I get the impression that you're looking for something more archaic, so I would have suggested [Cloister](http://web.archive.org/web/20130901044354/http:/www.myfonts.com/fonts/lanston/ltc-cloister/). LTC is not the only foundry to put out a version of this, but theirs is probably the best contemporary cut.\n\n"
    },
    {
      "time": "12 Feb 2007 — 2:44pm",
      "content": "I haven't tested this, but what if you replaced all spaces but the last one in each line with fixed-width spaces; i.e., one of the Unicode code points in the U+2000 to U+200A range? (Pick the one that most closely matches the width of a \"real\" space, U+0020, in your selected font.)\n\nWhether this will work or not depends on how InDesign deals with those special space characters.\n\n"
    },
    {
      "time": "13 Feb 2007 — 1:10pm",
      "content": "Adam send your address again since my email blocker knocked you out\n\n"
    },
    {
      "time": "10 Mar 2008 — 9:53pm",
      "content": "I believe this is a job for the right-indent character:\n\n[http://www.creativetechs.com/iq/the\\_magic\\_rightindent\\_tab.html](http://web.archive.org/web/20130901044354/http:/www.creativetechs.com/iq/the_magic_rightindent_tab.html \"http://www.creativetechs.com/iq/the\\_magic\\_rightindent\\_tab.html\")\n\n"
    },
    {
      "time": "18 Jun 2009 — 2:30am",
      "content": "What you need to do is draw the shape you want the tear to look like, with either the straight line tool, or shape, and if you're using the straight line tool, you need to select all the lines you have created (but do not group, or you'll end up with a rectangle block!) once you've selected the drawn lines or the shape, use the text wrapping tool to the tightest wrap, and then justify the text and make sure 'hyphenate' is not selected (in the paragraph options box) and that should wrap your text around the shape just nicely! I hope this helps.. :)\n\n"
    },
    {
      "time": "18 Jun 2009 — 12:32pm",
      "content": "Personally, I wouldn't bother with crappy justification (which most letterpress printers frown upon anyway) and explore other \"traditional\" difficulties of handset type.\n\nHere's a quick test:\n\n ![](http://web.archive.org/web/20130901044354im_/http:/typophile.com/files/fake_4989.jpg)\n\n1.I raised/lowered some letters a hairpiece away from the line.  \n2. Rotated individual lines by a few degrees to simulate uneven leading and bad lockup in the chase.  \n3. Added a tiny outline to some overprinted, and distorted some worn sorts.\n\nNaturally, this sort of thing is easier to do in Illustrator than ID.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20130901044354/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n\n"
    },
    {
      "time": "18 Jun 2009 — 1:10pm",
      "content": "You can also combine the above tricks with that awesome Shift+Tab trick!\n\n ![](http://web.archive.org/web/20130901044354im_/http:/typophile.com/files/fake2_4046.png)\n  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPersonal Art and Design Portal of Ivan Gulkov  \n [www.ivangdesign.com](http://web.archive.org/web/20130901044354/http:/www.ivangdesign.com/ \"www.ivangdesign.com\")\n"
    }
  ]
}
