{
  "id": "31250",
  "title": "Steve Jobs on DRM",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://www.apple.com/hotnews/thoughtsonmusic/](http://web.archive.org/web/20070404143846/http:/www.apple.com/hotnews/thoughtsonmusic/)\n\nGiven the topic of DRM and how it might—hopefully-freaking-NOT—affect fonts, I thought this was interesting.\n\n[link via MacFixit]\n\n",
  "author": "<a href=\"user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": "<br>",
  "uid": "108",
  "comments": [
    {
      "time": " 7 February, 2007 - 5:46pm",
      "content": "It’s about time. If Apple ditched their screwball DRM system I might start buying music online again—right now I’ve given up on the iTunes store because the DRM is bugger.\n\n"
    },
    {
      "time": " 7 February, 2007 - 6:19pm",
      "content": "I just wrote an [article](http://web.archive.org/web/20070404143846/http:/dangayle.com/blog/2007/02/07/everyone-is-entitled-to-my-opinion/) for my school’s newspaper concerning file sharing. Jobs is absolutely correct. DRM has failed, and will continue to fail as long as it exists.\n\nIt basically boils down to this: If I want the latest CD, font, program, etc., DRM is not going to stop me from having it. Everything and everything that can be put into a computer can/will be/has been on a file sharing network, and there’s nothing that Jobs or iTunes can do to stop it.\n\nThe only thing that will stop someone from downloading illegally is that old-fashioned thing called a conscience. And unfortunately, a conscience requires morals, which our society has basically done away with.\n\n"
    },
    {
      "time": " 7 February, 2007 - 10:00pm",
      "content": "DanGayle\\> “And unfortunately, a conscience requires morals, which our society has basically done away with.”\n\nYou are so right. Its very sad. Mikey\n\n"
    },
    {
      "time": " 8 February, 2007 - 8:18am",
      "content": "“It’s about time. If Apple ditched their screwball DRM system “\n\nThe point of Jobs article is that this is NOT Apple’s decision. It’s the RIAA’s decision. It’s out of his hands to a large extent.\n\nAnd he’s getting pinched…by countries like Norway which is trying to ban Fairplay, and up-and-coming DRM-free options like eMusic.\n\nHe’s in a bind, and (rightfully so, IMHO) pointing the spotlight at the RIAAs rather illogical hang-up on DRM.\n\n“I might start buying music online again—right now I’ve given up on the iTunes store because the DRM is bugger.”\n\nCheck out eMusic!\n\n“The only thing that will stop someone from downloading illegally is that old-fashioned thing called a conscience.”\n\nI completely disagree on numerous counts. First of all, I don’t think sharing music you like is necessarily ‘immoral’. It’s something kids have been doing for decades. Mix tapes are a staple of our pop culture. Burning more than a handful of CDs and selling them at $5 a pop? That’s crossing the line.\n\nSecondly, not everyone downloads ‘illegally’ because they just want it for free…it’s often because it’s the more convenient option.\n\nThe reason iTunes (IMHO) succeeded early on is that it is a VERY easy system to use. They had a large library, and a single double-click gets it to your HD in a few minutes. At the time, this was actually a LOT easier than hitting bitTorrent or Napster.\n\nFinally, if we do want to shine a light on consumer ‘immorality’ then we need to shine a brighter light on corporate ‘immorality’. The RIAA hasn’t exactly been an innocent ‘victim’ in all of this despite what their PR machine has told us.\n\nMy recent rant on a fight with DRM:\n\n[http://mnteractive.com/archive/fischer-price-fp3-player-headaches-for-dad/](http://web.archive.org/web/20070404143846/http:/mnteractive.com/archive/fischer-price-fp3-player-headaches-for-dad/)\n\n"
    },
    {
      "time": " 8 February, 2007 - 8:53am",
      "content": "\\>First of all, I don’t think sharing music you like is necessarily ‘immoral’. It’s something kids have been doing for decades.\n\nIt was pretty hard to copy LPs until cassetes came along. So don’t act like this has always been the case. And just because people have been doing it for a long time doesn’t make it right.\n\nI get royalty checks every quarter and know that I have missed out on a lot of money due to copying.\n\nBut - I am also against DRMs. It is not stopping anyone so what’s the point?\n\npeace\n\n"
    }
  ]
}
