{
  "id": "31284",
  "title": "\"Titanic\" movie titles compact sans w/ tiny serifs",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "Hello all,\n\nThis is a deceptively simple font to identify -- for me at least. I've searched the web extensively, gone to [www.whatthefont.com](http://web.archive.org/web/20120508010328/http:/www.whatthefont.com/ \"www.whatthefont.com\"), and have obtained no concrete results. This font looks so familiar...but subtly different.\n\nThe font I'm talking about is the font (or, what I'm assuming is a font) used in the logo for the movie \"Titanic\" : not Trajan, but the Impact-esque font used in the logo (with the rivets in the text). First glances make this seem like Impact, but the font doesn't quite match up to the logo. (For instance, the \"T\" is different...it has slight points on each end of the horizontal line.)\n\nAny suggestions as to what this font might be would be greatly appreciated. Examples are included below. (Some are taken from promotional material for the film; others are taken from the film's movie trailers. These fonts seem to be roughly the same.)\n\n| Attachment | Size |\n| --- | --- |\n| [titanic.jpg](http://web.archive.org/web/20120508010328/http:/typophile.com/files/titanic.jpg) | 5.36 KB |\n\n",
  "author": "BandTrumpet7",
  "time": "8 Feb 2007 — 5:09pm",
  "uid": "15878",
  "comments": [
    {
      "time": "8 Feb 2007 — 5:14pm",
      "content": "I apologize -- apparently I hit the wrong button?\n\nHere are more images.\n\n ![](http://web.archive.org/web/20120508010328im_/http:/typophile.com/files/jcfilm_4681.jpg)\n\n ![](http://web.archive.org/web/20120508010328im_/http:/typophile.com/files/kwinslet_3709.jpg)\n\n ![](http://web.archive.org/web/20120508010328im_/http:/typophile.com/files/ldicaprio_4045.jpg)\n\n ![](http://web.archive.org/web/20120508010328im_/http:/typophile.com/files/titaniclogo_6586.jpg)\n\n"
    },
    {
      "time": "8 Feb 2007 — 5:20pm",
      "content": "I could be wrong here, but a highly-condensed Helvetica (I'm mostly going by the R)?\n\n"
    },
    {
      "time": "8 Feb 2007 — 6:29pm",
      "content": "The closest \"Helvetica\" I could find was \"Helvetica Inserat,\" which is an almost exact duplicate of \"Impact.\" :( The thing to notice is that there is a slight sharpness on the bottom and top edges of the letters, most noticeably in the bottom example (one with the rivets). Notice how the T and I have a sort of spread-out at the bottom ... it's subtle, but noticeable. Helvetica Inserat (and Impact) don't have this. Also, for some reason, I think that the bar in the \"A\" character is a bit too high in Helvetica Inserat (and Impact)...I'm not sure why I say this, but it doesn't look right to me. One of the closest fonts I've found thusfar is Agency FB Black Compressed; however, the C doesn't match up on this, and it's still very not close.\n\nAny other suggestions?\n\n"
    },
    {
      "time": "8 Feb 2007 — 10:39pm",
      "content": "i would bet it's custom. i've done work for films here and there; seems to be more of an awareness of the value of a custom typeface in that industry than in most.\n\n"
    },
    {
      "time": "9 Feb 2007 — 10:20am",
      "content": "Boo...was hoping this one wouldn't be custom. I've asked quite a few questions about film fonts on another forum (which, sadly, is now defunct) and the answer was usually a customized typeface or else one made from scratch.\n\nThe S makes me think Univers or something like that ... although it's way too compressed.\n\nWho knows. :-\\\n\nThanks for the help, and keep your eyes open if anything pops up!\n\n"
    },
    {
      "time": "9 Feb 2007 — 10:58am",
      "content": " ![](http://web.archive.org/web/20120508010328im_/http:/typophile.com/files/helv_ultracompressed_5157.png)\n  \nThat is Helvetica ultracompressed … i think it's custom. \n"
    },
    {
      "time": "10 Feb 2007 — 12:09pm",
      "content": "Definite similarities...but also definite differences. I suppose it probably is custom. :( Oh well...maybe one day a font will appear that's really close!!\n\n"
    },
    {
      "time": "10 Feb 2007 — 12:36pm",
      "content": "The TITANIC letters have small serifs. It's not exact, but [Coliseum](http://web.archive.org/web/20120508010328/http:/www.myfonts.com/fonts/redrooster/coliseum-rr/) is pretty close.\n\n- Mike Yanega\n\n"
    },
    {
      "time": "10 Feb 2007 — 9:10pm",
      "content": "It might be a mix of Helvetica and AgencyFB Black Compressed ... Coliseum has its similarities too...\n\nThe thing I see is that the R is almost certainly a Helvetica rip-off of some sort, and AgencyFB would work if certain parts were extended (i.e. if the \"C\" was dropped down a bit more and the \"M\" was as well).\n\nHere are some more pictures, in case anyone needs them.\n\n ![](http://web.archive.org/web/20120508010328im_/http:/typophile.com/files/d_4659.jpg)\n  \n\n ![](http://web.archive.org/web/20120508010328im_/http:/typophile.com/files/c1_3429.jpg)\n  \n\n ![](http://web.archive.org/web/20120508010328im_/http:/typophile.com/files/c2_4820.jpg)\n\nIn case anyone needs it.\n\n"
    },
    {
      "time": "11 Feb 2007 — 6:57am",
      "content": "Those show two different fonts. The blue letters are more rounded. The white on black letters look like [Compacta](http://web.archive.org/web/20120508010328/http:/www.myfonts.com/fonts/efscangraphic/compacta-sh/).\n\n- Mike Yanega\n\n"
    }
  ]
}
