{
  "id": "31294",
  "title": "Ldot",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Hi all,\n\nI'm not too sure if it's the proper name but what keyboard do I need too use on mac OS X to get the Ldot character. It's called Ldot in Fontlab, it's and L with a dot just inside it.\n\nc.\n\n",
  "author": "coop",
  "time": "9 Feb 2007 — 1:56am",
  "uid": "5642",
  "comments": [
    {
      "time": "9 Feb 2007 — 2:49am",
      "content": "Ok so I found out it's the catalan middot, and I've changed the keyboard to Catalan, but what keys do I use to get the character.\n\nc.\n\n"
    },
    {
      "time": "9 Feb 2007 — 3:00am",
      "content": "Have you looked at the Art director's toolkit, it tells you where to find glyphs? With Minion Pro it actually only says glyph 771, and doesn't give any unicode results.  \nIf your font has the glyph, you can access it via glyph pallette in InDesign and Illustrator  \nIf you're designing a font I can't help, sorry.\n\n"
    },
    {
      "time": "9 Feb 2007 — 3:08am",
      "content": "Keep the keyboard the same. Go to the edit menu\\>special characters\\> Type in 013f where I have typed catalan. Drag and drop the character into your software.\n\nSorry for the large screen. Mikey\n\n ![](http://web.archive.org/web/20131013053305im_/http:/typophile.com/files/window1_4259.gif)\n\n"
    },
    {
      "time": "9 Feb 2007 — 3:13am",
      "content": "Also, System Preferences – International – Input Menu – Keyboard Viewer & Show input menu in menu bar. That’s more helpful than character palette if you have to access the glyphs frequently and can change the keyboard layout.\n\n"
    },
    {
      "time": "9 Feb 2007 — 3:13am",
      "content": "ŀl is “ela geminada”… for the record.\n\n;^)\n\n"
    },
    {
      "time": "9 Feb 2007 — 3:17am",
      "content": "Thanks for all the input everyone - thats great.\n\n"
    },
    {
      "time": "9 Feb 2007 — 8:35am",
      "content": "Coop,\n\nkeep in mind to design the ldot/Ldot so that:\n\n\\* When ldot is immediately followed by the normal l, and when Ldot is immediately followed by the normal L, the dot in ldot/Ldot appears visually centered between the two l/L's.\n\n\\* There should be no implied wordspace between ŀ and l, so a word like \"coŀlecció\" should look like one word, the space between the two \"l\"s should not be visibly larger than between other letters.  \nThis is a similar recommendation to what you should do with the \"apostrophic caron\" for Czech and Slovak: the word \"ďábel\" should have no implied wordspace, very much unlike the English \"don’t\", where the apostrophe can have some space on its own. For this reason, the dot in ldot, and the apostrophic caron in dcaron, tcaron, lcaron should be designed very \"sparsely\".\n\n"
    }
  ]
}
