{
  "id": "31291",
  "title": "OFL Release",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": " ![](http://web.archive.org/web/20131014095002im_/http:/typophile.com/files/!CR-OFLspec_4920.png)\n\n!CRASS ROOTS OFL\n\n\"Manly? Yes, but androids like it too.\"\n\nA descenderless, anti-kern stencil font that you could actually make stencils from. Still best with a razor, not quite scissor friendly. A license you could make most anything from. Inspired by 'mechs, intended for streetart/craft/physical use.\n\nOpenType (TT-flavor), hinted, approx 190 glyphs. Includes fi, fl, Et, .~ and +/- ligs. Component of upcoming !CRASS ROOTS Display Family, and the new Signature font of !Exclamachine Type Foundry.\n\nI particularly like how the brackets and the f\\* ligs came out.\n\nAvailable here or here:  \n [http://www.abstractfonts.com/font/12093](http://web.archive.org/web/20131014095002/http:/www.abstractfonts.com/font/12093 \"http://www.abstractfonts.com/font/12093\")\n\n[http://openfontlibrary.org/?ccm=/media/files/ChozCunningham/30](http://web.archive.org/web/20131014095002/http:/openfontlibrary.org/?ccm=/media/files/ChozCunningham/30 \"http://openfontlibrary.org/?ccm=/media/files/ChozCunningham/30\")\n\n",
  "author": "Choz Cunningham",
  "time": "8 Feb 2007 — 8:33pm",
  "uid": "13605",
  "comments": [
    {
      "time": "14 Feb 2007 — 11:37am",
      "content": "Hey! Great job! Very industrial. Your hard work is now available for the world to plunder!.~\n\nNow if only Georgia had those nice watchamacallits ligs.\n\n"
    },
    {
      "time": "14 Feb 2007 — 11:48am",
      "content": "Choz, I really like this!!! I've been toying around with something vaguely similar. I just have this picture lying around:\n\n ![](http://web.archive.org/web/20131014095002im_/http:/typophile.com/files/durchblick_5904.jpg)\n\nIf you keep tabs on [my website](http://web.archive.org/web/20131014095002/http:/www.typeoff.de/), or grab the RSS-Feed, you might get more info about it, too… at least eventually :-P\n\n"
    },
    {
      "time": "14 Feb 2007 — 5:02pm",
      "content": "_Your hard work is now available for the world to plunder!.~_\n\nI have 6 other versions x 3(=?) weights already, and another 18 alternate cuttings planned. Additionally, small caps, alternate characters, superiors and more ligs are almost done. This is just the free sample to ge the world hooked on my crack.\n\nActually I really like the stencil-ligs a lot. I think they came out quite well.\n\nIf you keep throwing that snark around, I'm going feature your picture on the Snark supporters roster page.~\n\n"
    },
    {
      "time": "14 Feb 2007 — 5:27pm",
      "content": "Thank you very much Dan, that makes my day. My main goal was to make a design that would look consistent, yet physically hold up as a carboard or other cutout. Without making a dot-matrixy-thing. This required an approach that I suppose borders on the mysterious notanic arts that pop up here now and again. Actually, I just cut out the most fragile looking ones, then toyed with them. Some broke, and were redrawn.\n\nI've got your feed in my bookmarks now. I've been a fan/user of your blackletter resources page for a while but hadn't noticed who's tools I was perusing. Thanks for the head up, theres lots of other stuff there for me to go chew on!\n\nI like your letters a lot. I am fond of real stencil art and miss all the great graffiti from my hometown. Good stencil letters evoke such gravity, and pull the background up to the plane of the letters themselves. The DURCH BLICK feels both fast-moving and yet dense. Looking forward to seeing more.\n\nJust for fun, I'm going to mimic that with my face to see how vastly different it comes out, even though I might categorize both in the \"industrial\" subtype:\n\n ![](http://web.archive.org/web/20131014095002im_/http:/typophile.com/files/crassblick_5855.jpg)\n\n(Faux-bliqued on-the-fly.) My data per pixel wins! :) But it doesn't look as inarguable. :(\n\n"
    },
    {
      "time": "14 Feb 2007 — 9:41pm",
      "content": ":-)\n\n"
    }
  ]
}
