{
  "id": "31300",
  "title": "Black / Dark Typefaces, Um... Old Style (?).",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello,\n\nI am discussing [somewhere else](http://web.archive.org/web/20080109182928/http:/typophile.com/node/31259) in this forum the justifying of some columns of type in InDesign. It is for a magazine that I make which will be printed on a sheet of oversize A2 paper using a lithographic printing process about which I am as yet uneducated and so cannot describe to you.\n\nThe design will be similar to a traditional newspaper with a header and then eight columns of type, each two inches wide, running down the full length of the paper. The gutters will be 1/8 of an inch wide and the spacing and leading will be tight. I am trying to achieve several things:\n\n1. I want the columns to appear as 8 drips of oil or tar, eight black lines flowing down the paper.\n\n2. I want the columns justified in a particular way so that it looks as though there are cracks in the black lines (see [other](http://web.archive.org/web/20080109182928/http:/typophile.com/node/31259) post).\n\n3. I want the layout and density of the type to be reminiscent of a newspaper during wartime, closely packed together so that as much information can be printed on the page. Economical with time, paper, space and copy.\n\n4. I am interested in the type design of William Morris and the the idea of making the type thick and black so that the printed area of the page is very dark. I like the way that he did not like to use paragraph breaks and when he had to he put symbols into the gap to fill it up, he wanted the page to contain a black rectangles and I want my layout and most importantly my typeface to reference that aesthetic.\n\n5. Finally and again linked with William Morris, I want to use an old typeface which is suitable for newspaper columns/legibility and appears very black on the page but without being too bold or heavy. It has to be a genuinely old typeface and not an imitation.\n\nI hope that this does not come across as a list of demands, that is not my intention, I would just appreciate your advice and discussion on the topic. Having done some reading into it the two typefaces that seem most appropriate are Baskerville and Caslon. I believe that William Morris’ own newsletter, The Commonweal, ( [the only image I could find](http://web.archive.org/web/20080109182928/http:/www.philsp.com/data/images/c/commonweal_18920716.jpg)) was set in Caslon (but please correct me if I am wrong) and I have read, though cannot find a reference now, that he was fond of Baskerville.  \nIt would also be worth mentioning Morris’ bookface Golden Type, which can be seen [here](http://web.archive.org/web/20080109182928/http:/www.papress.com/thinkingwithtype/teachers/type_lecture/history_morris.htm) and was influenced by [Nicholaus Jenson](http://web.archive.org/web/20080109182928/http:/en.wikipedia.org/wiki/Nicolaus_Jenson).\n\nAnyway, I look forward to reading your advice.\n\nThank you, Adam.\n\n [‹ Initials (names)](http://web.archive.org/web/20080109182928/http:/www.typophile.com/node/31376 \"Go to previous forum topic\") [Old 1800's font ›](http://web.archive.org/web/20080109182928/http:/www.typophile.com/node/30949 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080109182928/http://www.typophile.com/user/16727\" title=\"View user profile.\">adamburton</a>",
  "time": "<br>",
  "uid": "16727",
  "comments": [
    {
      "time": " 9.Feb.2007 3.38pm",
      "content": "ITC Bookman Medium, 8/8.\n\n"
    },
    {
      "time": " 10.Feb.2007 8.44am",
      "content": "Thank you Nick.  \nBookman, although I am not overly familiar with it, is a font that has always annoyed me for some reason. I think that it is because I always associate it with all those swashes.\n\nI do not think that it will look right for what I want to do, thank you though.\n\nAny other suggestions or advice anyone?\n\n"
    },
    {
      "time": " 10.Feb.2007 8.14pm",
      "content": "Adam, Bookman meets your criteria.  \nTry and get over your bad experience with the swashes and approach the problem logically. Accept the face for what it can do, rather than dismiss it on the basis of prejudice.  \nBookman Medium is a medium weight slab-serif face, which is necessary to get the blackness you specify. Digital versions of most types from the era you reference are too light, and look like they are under-inked.  \nIt’s a horizontally extended face with a large x-height. The extension will give you the rivers (cracks) in justification you want, and the large x-height will maintain density.\n\nSo to repeat, based on your criteria, you need a face which is:  \n1. Medium weight  \n2. Slab serif  \n3. Extended  \n4. Large x-height  \n5. Arts & Crafts Vintage\n\nI doubt that any face other than Bookman Medium fits the bill.\n\n"
    },
    {
      "time": " 11.Feb.2007 7.54am",
      "content": "Thanks again for the advice Nick, I appreciate what you are saying about this typeface, it is very useful information and worth considering.\n\nI am hoping that there might be some other suggestions from anyone else in the forum.\n\nAnyone, please?\n\n"
    },
    {
      "time": " 11.Feb.2007 8.03am",
      "content": "Bookman was used extensively and now lives in our subconcious as \\_that\\_ font of which we are now sick. However, for me anyway, it is from seeing it large so often that I have my sickness. It might be really nice to use it in this instance at a book size and see if it breathes new life into it.\n\n"
    },
    {
      "time": " 11.Feb.2007 11.41am",
      "content": "Adam, I don’t think it’s a question of typeface choice per se.  \nYou stipulated quite specific parameters and the effect you’d like to achieve.  \nSo the question should first be, what physical type of face can do what you want?\n\nHave you experimented with condensed, regular, and extended scaling to see what works best? (For the experiments, you can use mechanical scaling.)  \nHave you tested high-contrast faces against slab serifs?  \nSmall x-height against large?  \nCrisp finish against distressed?  \nWhat H&J settings work best, what tracking?\n\nI’d be interested to see the results — could you post a PDF of such experiments?\n\n"
    },
    {
      "time": " 12.Feb.2007 11.06am",
      "content": "Thanks again Nick. I do have quite specific requirements for how I want this type to look but they are based on my non technical (naive), aesthetic sensibilities concerning typography. Luckily I have no idea what condensed scaling, regular scaling, extended scaling, mechanical scaling, high-contrast faces, slab serifs, x-height, H&J settings or tracking are and so when looking for a typeface I can think about it based simply on a few requirements, the main one being that I think it looks right.\n\nI really appreciate the effort that you have gone to to educate me on these matters.\n\nDoes anyone else have any suggestions for a dark typeface?\n\n"
    },
    {
      "time": " 13.Feb.2007 2.49am",
      "content": "I assume you have rejected Golden Type  \n [http://www.itcfonts.com/fonts/detail.htm?pid=425755](http://web.archive.org/web/20080109182928/http:/www.itcfonts.com/fonts/detail.htm?pid=425755 \"http://www.itcfonts.com/fonts/detail.htm?pid=425755\")\n\nor  \n [http://www.myfonts.com/fonts/scriptorium/true-golden/](http://web.archive.org/web/20080109182928/http:/www.myfonts.com/fonts/scriptorium/true-golden/ \"http://www.myfonts.com/fonts/scriptorium/true-golden/\")\n\nHave you considered Joanna Semi, not of the period, but partially informed by Morris.  \n [http://www.myfonts.com/fonts/linotype/joanna/](http://web.archive.org/web/20080109182928/http:/www.myfonts.com/fonts/linotype/joanna/ \"http://www.myfonts.com/fonts/linotype/joanna/\")\n\nTim\n\n"
    }
  ]
}
