{
  "id": "31324",
  "title": "Sans serif to use with TEFF Collis?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hey everyone,\n\nI'm just wondering if you could give me some suggestions for a sans serif typeface that would work well with TEFF Collis. I've provided a link to TEFF Collis below. Thanks in advance for any suggestions you could provide me.\n\nCheers,  \nSopwith\n\n[http://www.teff.nl/fonts/collis/collis.html](http://web.archive.org/web/20150416032012/http:/www.teff.nl/fonts/collis/collis.html \"http://www.teff.nl/fonts/collis/collis.html\")\n\n",
  "author": "Sopwith",
  "time": "9 Feb 2007 — 5:32pm",
  "uid": "11012",
  "comments": [
    {
      "time": "10 Feb 2007 — 1:08am",
      "content": "Many sans serifs will work. To help narrow it down, tell us more about the type of content you'll be typesetting and the audience who shall read it.\n\n"
    },
    {
      "time": "10 Feb 2007 — 6:15am",
      "content": "You're going the expensive way :) – maybe a sans from Gerard Unger, Vesta? [http://www.gerardunger.com/fontstore/store-capitolium.html](http://web.archive.org/web/20150416032012/http:/www.gerardunger.com/fontstore/store-capitolium.html \"http://www.gerardunger.com/fontstore/store-capitolium.html\")\n\nPS  \nAah TEFF, i love their typefaces, i dream about them at night, hehe.\n\n"
    },
    {
      "time": "10 Feb 2007 — 11:06am",
      "content": "I'll be designing and box-set of contemporary poetry books, each with a poetics essay also included. I've used this typeface specifically for my small press poetry books for a few years, but have never used a different font with it for titling, only the Collis small caps for titles. I like that, but thought that updating how I use it for this project specifically, which also has a website attached to it (hence my desire for a sans serif), would make sense.\n\nAnyway, that's my rambling rationale behind my wanting sans serif titling font suggestions. Thanks for giving me something to check out, but other suggestions would be cool too. Cheers, Sopwith.\n\n"
    },
    {
      "time": "10 Feb 2007 — 10:26pm",
      "content": "Understood. These would match well with the Collis forms I think:\n\n[FF Profile](http://web.archive.org/web/20150416032012/https:/www.fontfont.com/fonts/profile?aid=2)  \n [FF Strada](http://web.archive.org/web/20150416032012/https:/www.fontfont.com/fonts/strada?aid=2)\n\n"
    },
    {
      "time": "9 Mar 2014 — 4:24pm",
      "content": "I basically have the same question, but my content won't be poetry but rather a scientific readership (biology students and scientists). I'm using TEFF Collis and am looking for a matching sans serif. What is currently on my mind is:\n\nFF DIN (Alternate; with round i-dots),  \nFF Fago,  \nDTL Argo.\n\n"
    },
    {
      "time": "9 Mar 2014 — 7:25pm",
      "content": "I made an overview of the current ideas. Which combination would you prefer?\n\n ![](http://web.archive.org/web/20150416032012im_/http:/typophile.com/files/overview_5684.png)\n  \nTwo more ideas are FF Zwo and FF Kievit:  \n\n ![](http://web.archive.org/web/20150416032012im_/http:/typophile.com/files/zwokievit_6204.png)\n\n"
    },
    {
      "time": "9 Mar 2014 — 9:07pm",
      "content": "I would go for Profile, Strada or Kievit.\n\n"
    },
    {
      "time": "10 Mar 2014 — 6:55am",
      "content": "Thanks for your opinion! Can you argue a bit on it – is it more an overall impression, or are there specific details which are for these and against the other typefaces?\n\nWhat i'm not sure about is: Profile, if the x-height is matched to Collis, still has quite small capitial letters. And Kieviet comes with its own serif typeface, which – as could be argued – should be preferred to the foreign Collis.\n\n"
    },
    {
      "time": "10 Mar 2014 — 10:05am",
      "content": "Certainly. I think the overal design of Profile matches well with Collis; the bowls and shoulders are quite a perfect match. Indeed the x-height is smaller, but depending on how you use the typeface that shouldn't matter. I could be wrong, but I think it only matters if you use both typefaces at the same point size, which would make Profile look optically smaller. If you're going to use Profile for titles it shouldn't be a problem.\n\nStrada is a lot rounder which contrasts nicely with Collis. The details however are quite similar. It's probably not necessary, but I like how the typefaces contrast while the details of both faces are quite consistent with each other.\n\nKievit's details are a bit more different, but the proportions match quite well and both Collis and Kievit look modern.\n\nAs for Kievit's serif, I don't agree the best choice is always to take typefaces from the same super family. The reason for this is because the proportions and details don't necessarily need to match. I believe Hoefler & Frere-Jones put tips on their websites on the different options you have of pairing typefaces.\n\n"
    },
    {
      "time": "10 Mar 2014 — 12:03pm",
      "content": "Indeed, Profile is in nice harmony with Collis from the point of view of shapes. The capital letters are, however, much smaller. In fact, they are the smallest of all suggested fonts: the following overview is sorted with respect to the difference of capital letter height (blue bar):\n\n ![](http://web.archive.org/web/20150416032012im_/http:/typophile.com/files/comparison_5737.png)\n  \nand Argo (forgot that):  \n\n ![](http://web.archive.org/web/20150416032012im_/http:/typophile.com/files/argo_4018.png)\n\nProfile is therefore – unfortunately – not a good choice for me, since I also have paragraphs with an inline header.\n\nKievit, Argo, Zwo and Fago have acceptable height, DIN has perfect height. Since you like Kievit, what speeks against Argo, Zwo, Fago and DIN?\n\n"
    },
    {
      "time": "11 Mar 2014 — 10:39am",
      "content": "Instead of using 2 fonts that looks the same, try a completely different style.  \nContrast can be great.\n\n"
    },
    {
      "time": "11 Mar 2014 — 12:29pm",
      "content": "DIN is way too technical. It just contrasts in a bad way I think.\n\nFago just seems too random of a choice. I just don't see the logic behind pairing these two. They're so different that using both in text application will probably make the details too obtrusive. As I said, it seems too random of a choice.\n\nArgo is actually a very acceptable typeface to pair with Collis. It's just that I personally preferred how the weight distribution in the other typefaces match Collis' somewhat. But, if you want a typeface which matches Collis pretty well in the general shape but contrasts in the weight distribution I think it's a good choice. Since you're using it for inline paragraphs it might actually be the better choice since the other typefaces might not contrast enough, but you would have to test that.\n\nZwo is actually the same story as Argo.\n\n"
    }
  ]
}
