{
  "id": "31347",
  "title": "How do you deal with rolling eyes?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "We've all been through it. We're out at dinner. We're ordering our food. Looking at the menu you notice, _Hey, they used Triplex Serif for the design. Cool._\n\nThey say _What?_ You look up and reply, _You know, the font. They used Triplex Serif for the font. It's from Emigre._\n\nAnd then the eyes start rolling.\n\n ![](http://web.archive.org/web/20121108031216im_/http:/typophile.com/files/images_6744.jpg)\n\nYour date/friends/waitress think you're a massive dork, and you hang your head in shame. The end.\n\nHappens to me just about every day, and I'm used to it. My friends are used to it also. They've accepted the fact that I'm a font nerd and sometimes, SOMETIMES, they even ask me to I.D. one for them.\n\nSo, how do you deal with the rolling eyes? And what is your typical response?\n\n",
  "author": "Dan Gayle",
  "time": "10 Feb 2007 — 5:42pm",
  "uid": "12948",
  "comments": [
    {
      "time": "10 Feb 2007 — 5:50pm",
      "content": "i laugh at myself ! (as often as possible)\n\nsometimes, if i know them well, i try to find a comparable obsession in the present company: \"y'know.... you notice handbags, i notice dingbats\" ...but usually i just laugh at myself. :-o\n\n"
    },
    {
      "time": "10 Feb 2007 — 5:57pm",
      "content": "Thats the advantage of dating a fellow designer!\n\n"
    },
    {
      "time": "10 Feb 2007 — 6:57pm",
      "content": "I like Chris's take -- my sweetie can hear a helicopter miles away and remark \"Oh it's a whatever: they're great but the ends of the rotor blades are way too sharp.\"\n\nHe thinks there's absolutely nothing strange with my \"hmm, that's really neat, but I wonder they used Rotis Sans on the album cover....\"\n\n:-)\n\n"
    },
    {
      "time": "10 Feb 2007 — 7:28pm",
      "content": "When I was first really falling in love with type in the early 70s, I was living in Boston with a roommate. I worked at an art supply store (Charrette) and Jeff operated a typositor in a local composing room, so we talked about type all the time. For evening meals we often went to a Greek resto around the corner called Ann's Lunch, and as the food was outstanding and reasonably priced, it was also a hangout for cops.\n\nAt that time the Boston police must have decided they needed an advertising agency or something, because overnight all the cruisers went from saying BOSTON POLICE in Helvetica Light a/c, to very large **boston police** in Futura Black lc. Not exactly what any of us would call a subtle change.\n\nOkay, Jeff and I walk into Ann's and I see a table with four cops. I approach them with all the excitement and zeal of age 22 and say, \"Wow!! What do you guys think of the lettering on your cars?\" They all look at me like I'm from Mars (or more likely, _on_ something) and say, \"What?!\" I explain, with just a bit of impatience, \"You know, the writing on your cruiser doors.\" They look at me deadpan, then at each other, then back at me and say, \"I dunno, Mac. It still says 'Boston Police,' don't it?\"\n\nIt was in that moment that I realized the world was divided into two distinct groups . . .\n\n"
    },
    {
      "time": "10 Feb 2007 — 7:35pm",
      "content": "Bruce, it would be unprofessional of a big tough cop to admit they notice somethink as artsy as a typeface\\*. But they do, deep down, get that Futura Black vibe. They're only human.\n\n\\*Unless forensic typography was integral to the solving of a murder on CSI -- comic book reality.\n\n"
    },
    {
      "time": "10 Feb 2007 — 7:46pm",
      "content": "My sisterinlaw calls me Font Goy.  \nenough said :-)\n\nChrisL\n\n"
    },
    {
      "time": "10 Feb 2007 — 9:44pm",
      "content": "I don't get a lot of rolling eyes. If I see something I like I might comment on it or take a picture. Most people that know me realize that's just what I do. That covers more than just fonts, also logos, layouts and illustrations. I pay attention to colors used the most.\n\nI try to take it easy on my friends that aren't designers. I wouldn't want to go to lunch with an accountant to hear her cooingly hype how great the latest money managing software is.\n\n"
    },
    {
      "time": "10 Feb 2007 — 9:57pm",
      "content": "You've just got to keep trying to educate the masses about good typography. My friend now can spot fake small caps a mile away. But there's no one I know who can understand walking down the street and being unable to refrain from identifying the fonts on storefronts and signs. Then again, I have don't really follow when another friend tries to tell me the differences between hard and metal rock.\n\n"
    },
    {
      "time": "10 Feb 2007 — 10:34pm",
      "content": "I love that photograph, Dan! :-) Perfect.\n\nBut like mjpatrick, I don't get a lot of rolling eyes. One manager I had a few years ago was pretty impressed when I identified ITC Benguiat without blinking. Back in high school most of my classmates thought it was pretty cool when I would draw band logos that approximated the real thing. My friends know that I'm a graphic design/type geek and don't give me any trouble, for the most part.\n\n"
    },
    {
      "time": "10 Feb 2007 — 11:56pm",
      "content": "Dan. You're dating _her?_\n\nI think it's time you re-read Leslie Carbarga's dedication and introduction to his [\"Logo, Font & Lettering Bible\".](http://web.archive.org/web/20121108031216/http:/www.logofontandlettering.com/) What you call dorkiness is something the rest of us recognise as budding discernment. Indispensible for all that you can (and can't) eat on the menu.\n\n"
    },
    {
      "time": "11 Feb 2007 — 6:45am",
      "content": "Anything on a menu set in all caps script surely should never be eaten :-)\n\nChrisL\n\n"
    },
    {
      "time": "11 Feb 2007 — 7:05am",
      "content": "wow ! linda, your beau can identify helicopters by sound ? i'm seriously impressed.  \nthat could be a real survival skill when armageddon kicks in...\n\ni can imagine a scenario: crouched in the smoke, they wait for rescue. suddenly the sound of chopper blades emerges from the chaos. the sergeant tilts his head... \"it's one of ours... but the blades sound a little dull... let's move !!\" they rush toward the sound when the corporal sees something odd about the serial number on the tail... suddenly he screams:  \n\"it's a trap !!! they used a counterfeit stencil gothic !! nnnoooooooo.........\"\n\n"
    },
    {
      "time": "11 Feb 2007 — 7:47am",
      "content": "It happens to me as well. Not so much rolling eyes but the \"he's a dork look\". Most of the times it has to do with me pointing out to wife and friends that the there is a big company ad, or movie titles that use free typefaces that I can refer to by name or designer. And don't get me started about menus. Yesterday I saw a wine list at a reputable local hotel bar, all set in Avant Gard -forced itals- with every single line crashing onto the next. I pointed this out to people around me and was called a dork once again.\n\n"
    },
    {
      "time": "11 Feb 2007 — 8:52am",
      "content": "I hang around with (and tend to date) a LOT of graphic designers/artists so this is not such a problem... but I'm glad the Knitting Factory in NY redesigned their logo, you used to be able to drive a truck between the F and the a in Factory and I had trouble enjoying the music as a result.\n\n"
    },
    {
      "time": "11 Feb 2007 — 8:59am",
      "content": "There are two really nice places to eat where I hang out. One is a fancy Japanese pastry/coffee shop, and the other a Greek themed brew pub.\n\nBoth use Papyrus.\n\nAnd the scary thing is, NO ONE ELSE NOTICES. (Or cares.)\n\nBut anyway, is that the turning point in someone becoming a Typophile? The moment you turned to the Dark Side? The moment when you can no longer look at something and _just read it_ without analyzing the presentation?\n\n"
    },
    {
      "time": "11 Feb 2007 — 9:14am",
      "content": "A restaurant I love uses Zapf Chancery CAPS on its menu. One of these days I'll offer a quickie redesign as a barter for free food just to spare my eyes the abomination.\n\n"
    },
    {
      "time": "11 Feb 2007 — 9:22am",
      "content": "I find it interesting that you won't get the eye roll if you talk about architecture, and probably not even product design.\n\nThere must be a good way to introduce a mention of typography and type design--like a particularly good or bad menu--that gets across the whole 'normally invisible but powerful impact' idea, and that it is an important field of design with a long history.\n\nObviously I don't know a brief way to put people at ease with the subject either :)\n\nAny suggestions?\n\nps my impression is that people are more aware of logos as something designed, so maybe that is a way...\n\n"
    },
    {
      "time": "11 Feb 2007 — 9:29am",
      "content": "<cite>Both use Papyrus.</cite>\n\nAnd the scary thing is, NO ONE ELSE NOTICES. (Or cares.)\n\nMy friends and family think I'm crazy because I always gripe about Papyrus being everywhere. It astounds me that they don't even notice, while I hallucinate and see every letter around turn into Papyrus if I go too long without sleeping.\n\n"
    },
    {
      "time": "11 Feb 2007 — 10:20am",
      "content": "I have a very tolearant husband, who suffers my type-related rants pretty well. It must be annoying to produce a carefully selected bottle of wine just to hear a lecture about kerning (or lack of it) and how I read on Typophile about Trajan, which is used on this label, being the favourite of the film industry, etc, etc... (true story from last night)  \nHe's quite used to me taking photos of interesting signs, and when I had promised to post some Berlin Hauptbahnhof pictures here, he was very supportive and flexible about it on our weekend break. I think I'll turn him into a Typophile one of these days ;^)  \nI try to keep my mouth shut in less undestanding company.\n\n"
    },
    {
      "time": "11 Feb 2007 — 12:51pm",
      "content": "Here's another true restaurant anecdote: Peter Bain and I once went to a sushi place close to my workplace, and the first thing he noticed was that the entire menu was set in Comic Sans! That got a good chuckle from us, but I'm sure people at neighboring tables were rolling their eyes. :-D\n\n"
    },
    {
      "time": "11 Feb 2007 — 1:13pm",
      "content": "<cite>the entire menu was set in Comic Sans!</cite>\n\nHo my god !!!!\n\n"
    },
    {
      "time": "11 Feb 2007 — 1:18pm",
      "content": "I like when people rolled their eyes about me, all my friend loved me because I'am weird.\n\n(I dont think I'am so weird, ah !! anyway !)\n\n"
    },
    {
      "time": "11 Feb 2007 — 1:56pm",
      "content": "Ricardo, I once bought a Comic book and it was all set in Sushi! :-P\n\n[http://www.myfonts.com/fonts/t26/sushi/](http://web.archive.org/web/20121108031216/http:/www.myfonts.com/fonts/t26/sushi/ \"http://www.myfonts.com/fonts/t26/sushi/\")\n\nChrisL\n\n"
    },
    {
      "time": "11 Feb 2007 — 3:31pm",
      "content": "Repeat after me, Chris: \"No more silly bad jokes.\"\n\nEven though I know you did it for the halibut, it smelt.... ;-)\n\n"
    },
    {
      "time": "11 Feb 2007 — 3:43pm",
      "content": "\\>You’ve just got to keep trying to educate the masses about good typography.\n\nWhy? If they don't care about it it is not important.\n\nI hang out with a bunch of film people and one of the worst parts of that is their myopic take on life since it is completely informed by film. They are intelligent, nice people who can bore you to death if you let them.\n\nFilm is the most important thing in the world to them and I understand. But they should understand that I only like film for enjoyment and couldn't care less about their adroit analysis.\n\nSocial situations that don't involve your colleagues are not the time to start talking about design. They very simply don't care nor should they.\n\npeace\n\n"
    },
    {
      "time": "11 Feb 2007 — 4:09pm",
      "content": "DanGayle - I think you need to find some friends who appreciate fine type with their fine wine.\n\nBruce - I love the Boston Police story.\n\nPattyfab - where I am living now, some of the restaurants have found a program for Windows - that designs and makes menus. I'm pretty proud of one of the restaurants, they had ITC Anna and Caslon in their computer - and it did a very nice job. There was one steak house here that insisted on Old English in all caps - I redid the menu for them - they paid for it -- and unfortunately, they soon went out of business. Not their fault - odd landlords....\n\nNow to share my own story. Some of you may remember Marvin Kommel. He owned MKP Type aka Type Emporium. He was mostly a typesetter's typesetter. If Photolettering, Cardinal, Haber, etc. didn't have the typositor face and needed the job overnight- they went to Marvin. Marvin, btw, was not only a competitor of mine, he too, was an Alphatype shop.\n\nMarvin and I would met every Monday for lunch. He would give me all the details of which typesetter's funeral he went to that weekend. (Those last few years 1992-1996 was very rough on typesetters...) After a lovely lunch (boy, did he know how to eat well) we would walk around bookstores. Not only did we play guess which font in used on the title of the book - we expanded it to -- guess which typeshop set it\\*, who designed it and which publisher. We were always loud and enjoyed ourselves, especially if others were around the bookstore. So many really didn't (and still don't) understand how much work went into something that looked so simple, or how many of us truly took pride and care in our work.\n\nThanks for my memory. Marvin passed away three Januarys ago. RIP Marvin.\n\n• Ttrick question most of the time with Marvin -- it may have been billed by another typehouse, but so many times it was an MKP font that produced it...\n\n"
    },
    {
      "time": "11 Feb 2007 — 4:28pm",
      "content": "Linda is fishing for more than California roles but I won't take the bait and switch the topic :-P\n\nGreat story Jackie! You two really knew how to have fun in a book store! BTW, was Marvin your frog loving friend?\n\nChrisL\n\n"
    },
    {
      "time": "11 Feb 2007 — 4:50pm",
      "content": "<cite>they very simply don’t care nor should they.</cite>\n\nI'm not sure I agree Paul. Isn't it nice when you manage to get someone's attention about something they had never thought much before? Last Friday I went to my stretching and after class I had a chat with the instructor, the last person you'd think would be interested in typography or architecture. She asked me what I was doing so I proceeded to explain and I guess at some point she started to see how fascinating the subject was and she asked me more and more questions and I could tell I had really planted a seed or something. The same with my partner, when I start telling him about the amazing experience of turning the pages of an old book, the smell, texture, typography, layout...he stops whatever he's doing and listen. I promise you. I guess it's the twinkle in my eyes, people notice when something REALLY revs my (little) engine.  \nBut if you think you're going to grab someone's attention to typography by dissing a menu because is set in Comic Sans (and you're right to do it, of course), well, I think you're going to get only rolling eyes, which is a pity.  \nI think it's important you draw attention not only to typography but to many other subjects that people tend to find irrelevant. People have lost their ability to \\*see\\* and it's the most amazing (and rewarding) experience when you make them see again.\n\n"
    },
    {
      "time": "11 Feb 2007 — 4:53pm",
      "content": "Hey Jackie, how much did you cross paths with my buddy Charlie Toor, who had a shop on (I think it was) E 45th, Charles Toor Tradegraphics or something like that. I believe he had Alphatype as well. He moved up to NH around 1970 to establish a mom and pop printing business and I ran his darkroom, made plates (ah, the old days of high craft -- and I do mean high -- hand-rubbing that red lacquer onto the R plates and having to use exactly the right touch and pressure so that halftones would come out even and not streaky), and occasionally ran a press. He taught me to set display on his Typositor and many other things about type . . . and music.\n\nHe's a fantastic jazz pianist (studied with Jaki Byard for many years) and plays out and sings around here in the White Mountains of NH. When he was a teen he used to sneak over from Brooklyn to hang out at the Royal Roost. One night Bud Powell was in the room but he was so messed up he couldn't play, so Max Roach and Diz and I'm not sure who else plucked Charlie out of the audience and had him play piano!! He claims that he managed to hold his own despite much challenge from the rest of the players.\n\n"
    },
    {
      "time": "11 Feb 2007 — 5:53pm",
      "content": "I guess I did come off a bit superior there. That wasn't my intention at all, Paul. I don't somehow make it my duty to lecture everyone I see on their typographic mistakes or subject them to hearing about my recent favorite type discoveries. But I've found that for every person that never noticed type and has no interest in it, there's someone who never noticed it but is excited to learn. Somehow typography came up while talking to a classmate in my Shakespaere class. He asked me why type interests me, and I told him that it's learning about the history of each typeface and being able to see the intricacies of letterforms that give a font its character. The next day, he told me that he spent an hour-and-a-half the previous night in Word going through each of his installed fonts at a big point size. He was honestly excited to have learned about type, and I was genuinely happy to have given someone some typographic appreciation.\n\nIt is tempting to point out to someone that their sign is an exemplar for how not to kern, but I don't -- I save my comments for those who want them.\n\nOne other thing that my year-old passion for type has made me think about is what other passions there are that I've never given a second thought to. I know that people have forgotten more about music, painting, ancient history, etc. than I'll ever know, but are there people who feel passionate about things like wood? Tiling? Globes? Cell phones? I've always entertained the thought of some day writing about all these passions and what people find so fascinating about them.\n\n"
    },
    {
      "time": "11 Feb 2007 — 8:26pm",
      "content": "_Ricardo, I once bought a Comic book and it was all set in Sushi! :-P_\n\nHar har har, was it a Manga comic? ;-)\n\n"
    },
    {
      "time": "12 Feb 2007 — 4:40am",
      "content": "\"So, how do you deal with the rolling eyes? And what is your typical response?\"\n\nFirst off, recognition of menu fonts is hardly annoncement worthy, so I'd say you were asking for the label by being a... (whatever they call you). If someone asks, you tell, otherwise shhh.\n\nTo discuss the details of what's supposed to be a subliminal experience, you might as well be a farmer, read through the menu and then describe the details of cattle or chicken slaughter.\n\nWhat are you thinking?\n\n"
    },
    {
      "time": "12 Feb 2007 — 5:49am",
      "content": "<cite>Anything on a menu set in all caps script surely should never be eaten :-)</cite>\n\nHahahaha. So true!\n\nI'm glad I date a designer. But I rarely comment that stuff out loud. I usually wait till he does :-P\n\n"
    },
    {
      "time": "12 Feb 2007 — 5:51am",
      "content": "Family is driving downtown..\n\n\"The font of the company's name at the wall is a...\"\n\n\"Okay, don't tell us - please!\" (My wife - starts rolling)\n\n\"What is it, Dad?\" (My daughter)\n\n\"Mh.. but your Mom said..\"\n\n\"Come on, tell us. Otherwise you start talking about Preußen and why Germany has to become more national again. So.. which font is it, Dad? Explain us the world - again and again..\" (My son)\n\nHarr, harr..  \n\"Its a Tannenberg. Some call it a 'Nazi' font, but \" ... followed by dozends of arguments.  \nThey all love me of course and they know exactly where to set small new questions or remarks. Their eyes are not rolling anymore, but rotating. It looks very funny and I know by heart: I love them, too :-)\n\nGeorg\n\n"
    },
    {
      "time": "12 Feb 2007 — 6:24am",
      "content": " ![](http://web.archive.org/web/20121108031216im_/http:/typophile.com/files/mangasans_5118.png)\n\nChrisL\n\n"
    },
    {
      "time": "12 Feb 2007 — 6:41am",
      "content": "LOL!!!!!\n\n"
    },
    {
      "time": "12 Feb 2007 — 7:36am",
      "content": "Chris, you promised never to publish that picture of me! ;-)\n\n"
    },
    {
      "time": "12 Feb 2007 — 7:38am",
      "content": "<cite>To discuss the details of what’s supposed to be a subliminal experience, you might as well be a farmer, read through the menu and then describe the details of cattle or chicken slaughter.</cite>\n\nYou know, I never thought of it that way. A subliminal experience. I don't think I've ever heard anyone ever describe design in that way. I guess that good typography is supposed to be invisible. Something to catch your eye, but also to let go so you actually read it.\n\nBut what is wrong in cracking the illusion?\n\n"
    },
    {
      "time": "12 Feb 2007 — 7:53am",
      "content": "Don't worry Linda, I am holding on to the really \"good\" pictures :-)\n\nChrisL\n\n"
    },
    {
      "time": "12 Feb 2007 — 8:11am",
      "content": "\\>I’ve always entertained the thought of some day writing about all these passions and what people find so fascinating about them.\n\nWell said auricfuzz. It just always scares me when peoples passions take over to the point of feeling that it should be everyone's passion. It's boring, as my film friends have demonstrated to me over and over.\n\nSome of my reaction stems from living in Los Angeles, where I have seen many people slowly lose touch with the rest of the world and start to believe that the people here are the only ones who are clued in. I have reminded folks so many times that if you drive 50 miles in any direction people are different - not more stupid, just different.\n\nNothing makes this more apparent than presidential elections.\n\nAs long as we don't forget that there's a lot of people out there who LOVE Comic Sans (one of the favorite whipping boys here) and their opinion is no less valid. It's just different.\n\nI guess for my film friends it would be Pirates of the Caribbean - the Comic Sans of movies. Loved by the masses, hated by those \"in the know\".\n\n\\>But what is wrong in cracking the illusion?\n\nNothing as long as you don't mind having a long conversation about the right way to butcher an animal.\n\npeace\n\n"
    },
    {
      "time": "12 Feb 2007 — 8:56am",
      "content": "Good lord.. we're all officially smitten with the same problem... I still dont like going to places like malls and nyc because of information overload with typography... Whats worse is when you start being like thats such a shitty logo and everyone around you thinks you're being negative when infact your just thinking about work! lol..\n\nJoseph\n\n"
    },
    {
      "time": "12 Feb 2007 — 8:58am",
      "content": "I've no need to worry (if one day I am able to ID fonts like all of youse) about rolling eyes.\n\nMy partner is a motorcycle enthusiast (that's too mild a term, actually). Usually the response to design and type-related stuff is more of a glazed look than eyeball-rolling. I think he really is trying to listen and get it, but he just doesn't. And I know behind the glazed look are thoughts of his ST and how many more weeks until he can set her free again.\n\nSo usually I'm the one rolling my eyes and tuning out when the motorcycle talk starts. He identifies bikes by sound or light signature, quotes torque, HP, dry weight and ccs. Makes my head spin. Winter has been pretty quiet, but he'll start up again in a couple of weeks after the motorcycle show. ;)\n\nK.\n\n"
    },
    {
      "time": "12 Feb 2007 — 9:15am",
      "content": "What rolling eyes?!\n\n"
    },
    {
      "time": "12 Feb 2007 — 9:15am",
      "content": "Well Kristina, you could compromise by talking about motercycle type.\n\n ![](http://web.archive.org/web/20121108031216im_/http:/typophile.com/files/ft0110_6206.jpg)\n\nChrisL\n\n"
    },
    {
      "time": "12 Feb 2007 — 9:35am",
      "content": "Actually, I haven't really received any rolling eyes yet, when talking about type. But then again, I usually try to type-rant only to people who know what I'm talking about, and rant about it themselves aswell. ;)  \nLuckily one of my friends is a type-head too, so I can talk about type with him without rolleyes.  \nWhen I (try) to identify typefaces I see, when being with people that are not really into type, they usually are more amazed then confused. \"how the hell do you know that?\"\n\n"
    },
    {
      "time": "12 Feb 2007 — 9:54am",
      "content": "I used to get it all the time, so I stopped brining it up as much when we're out with friends unless it's horrendous, or really funny.\n\nI saw a student handbook the other day that was set in Base 12. I shook my head. It was from a Canadian university I do believe.\n\n"
    },
    {
      "time": "12 Feb 2007 — 10:03am",
      "content": "@ChrisL: hahahahaha! It would definitely have to not be Harley-related type. And most certainly \\*not\\* on my body.\n\nBut I do like the happy-go-lucky smiling Triumph [logo](http://web.archive.org/). It's not quite as wide the grin I get from riding, though.\n\nAt the risk of taking this thread wildly off topic, the-man-who-says-ARRR did verge on the design-related when he expressed his wish to adorn the blue lady (aka the ST1300) with a pin-up bomber girl decal like [these](http://web.archive.org/). I thought that was pretty cool, but she has yet to materialize. Guess that's why I'm (still) on the backseat. ;)\n\n"
    },
    {
      "time": "12 Feb 2007 — 10:23am",
      "content": "Kristina, Perhaps you would become the \"Blue Lady\" while riding his motercycle in this cold Winter weather? :-)\n\nChrisL\n\n"
    },
    {
      "time": "12 Feb 2007 — 10:29am",
      "content": "It's not so much rolling eyes, as I find that most people are quite interested in what others do for a living. It's more the incredulity that all possible typefaces haven't already been designed. That's led to a lot of interesting conversations.\n\n"
    },
    {
      "time": "12 Feb 2007 — 11:08am",
      "content": "Nice going, Chris! I will never make cracks in front of that waitress ever again! Hmm, on second thought, maybe I will. ;-D\n\n_Don’t worry Linda, I am holding on to the really “good” pictures :-)_\n\nLike [Lauren Bacall](http://web.archive.org/web/20121108031216/http:/typophile.com/node/29951)?\n\n;-)\n\nThanks for making me laugh... I needed it!\n\nR.\n\n"
    }
  ]
}
