{
  "id": "31368",
  "title": "Obituary: Town's Sole Stonecutter, Apparently",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "[http://www.rootsweb.com/~scberkel/Cemeteries/Wass\\_Pics/shula\\_law.jpg](http://web.archive.org/web/20141117234546/http:/www.rootsweb.com/~scberkel/Cemeteries/Wass_Pics/shula_law.jpg \"http://www.rootsweb.com/~scberkel/Cemeteries/Wass\\_Pics/shula\\_law.jpg\")\n\nI never knew Vincent's grandma cut headstones!\n\nhhp\n\n",
  "author": "hrant",
  "time": "11 Feb 2007 — 4:34pm",
  "uid": "1250",
  "comments": [
    {
      "time": "11 Feb 2007 — 11:46pm",
      "content": "By the way, here is how a headstone is done in our cemeteries:  \nAfter the burial of the deceased, the grave is sealed with a stone placed horizontally (not vertically) then the electric stone-cutter is driven from LTR inscribing the RTL wh+how info in fascinating Calligraphy, without prior outlining. More surprisingly, the inscription takes place only after fixing the stone leaving no room for errors. Incredible!\n\n"
    },
    {
      "time": "12 Feb 2007 — 12:01am",
      "content": "I spat the coffee at my mac two times. Hrant, a little warning sign would be appropriate. If done properly, of course.\n\n"
    },
    {
      "time": "12 Feb 2007 — 11:34am",
      "content": "Typographic comedy gold. Bravo.\n\n"
    },
    {
      "time": "12 Feb 2007 — 11:52am",
      "content": "A cut above the rest!\n\nChrisL\n\n"
    },
    {
      "time": "12 Feb 2007 — 1:08pm",
      "content": "What's the joke?  \nShula was 19.  \nHer folks spent all their money on the coffin, and couldn't afford a professional marker?\n\nWE.SAW.YOU.SUFFER  \nWE.SAW.YOU.GO.IT  \nCRUSHED.OUR.HARTS.  \nWE.LOVE.YOU.SO.BUT  \nIT.WAS.GOD.WHO.LOVED  \nYOU.BEST.WHO.TOOK  \nYOU.HOME.AND.GAVE  \nYOU.REST\n\nThe Ancient Roman style of periods-for-spaces is very cool\n\n"
    },
    {
      "time": "12 Feb 2007 — 1:37pm",
      "content": "I believe Hrant saw the lettering as kin to Comic Sans.\n\nChrisL\n\n"
    },
    {
      "time": "12 Feb 2007 — 2:17pm",
      "content": "Well for money they could've just sold those  \ndeer carcasses to the local sausage factory.\n\nhhp\n\n"
    },
    {
      "time": "12 Feb 2007 — 2:25pm",
      "content": "Is that a _pun_ishment?\n\n"
    },
    {
      "time": "12 Feb 2007 — 2:44pm",
      "content": "OK, that raised a groan.\n\n"
    },
    {
      "time": "12 Feb 2007 — 3:14pm",
      "content": "I'd much rather have raised Shula, to ask  \nher exactly how her parents were related.\n\n--\n\n\"After a'carvin' S-H-U-L-A-dot-dot-L-A, pappy got dumb gab dizzy from standin' up so long, so maama took a shot at the dubya... So weez give her the job of holdin' up pappy 'nstead, seein' as how good she reeplaced them poor deer fer pullin' the cart.\"\n\nhhp\n\n"
    },
    {
      "time": "12 Feb 2007 — 3:24pm",
      "content": "If it weren't so entirely inappropriate right now, photos of calligraphy carved into Iraqi tombstones would make for a gorgeous coffee-table book. \\*sigh\\* maybe in fifty years...\n\n"
    },
    {
      "time": "12 Feb 2007 — 4:43pm",
      "content": "Hey Hrant, maybe for your next post you can make fun of the handwriting of kids with dyslexia.\n\n"
    },
    {
      "time": "12 Feb 2007 — 5:45pm",
      "content": "James, engraved calligraphy is never gorgeous.\n\nDan, I make fun of mediocrity anywhere. But being dyslexic for example does not necessarily qualify. To qualify you need to not care. You certainly don't need to be rich to care. Heck, you don't even need arms to care:  \n [http://news.bbc.co.uk/2/hi/south\\_asia/3253168.stm](http://web.archive.org/web/20141117234546/http:/news.bbc.co.uk/2/hi/south_asia/3253168.stm \"http://news.bbc.co.uk/2/hi/south\\_asia/3253168.stm\")\n\nhhp\n\n"
    },
    {
      "time": "12 Feb 2007 — 8:33pm",
      "content": "Sooner or later, the one of us will be in such a palace.  \nOffending nobody, what do you like the headstone on your palace reads?  \nWill you mention that in your will?\n\n"
    },
    {
      "time": "13 Feb 2007 — 6:16am",
      "content": "To me this gravemarker only becomes mediocre if it's viewed out of context. It's a beautiful piece of folk art to me and there are thousands more out there just like it. There would be more except since stone wasn't available to many, they were made of wood and are long gone. In this case I think the inscription mentioned at the bottom of the page says it all...\n\n[Sticks and Stones](http://web.archive.org/web/20141117234546/http:/uncpress.unc.edu/chapters/little_sticks.html)\n\n"
    },
    {
      "time": "13 Feb 2007 — 6:39am",
      "content": "That is a terrific link you posted Bluestreak. I hope everyone reads it.\n\nChrisL\n\n"
    },
    {
      "time": "13 Feb 2007 — 6:58am",
      "content": "You want context? Check out the other headstones in that cemetery.\n\nOh, and next time you see Comic Sans used by a secretary to set  \nthe company financial report, just think of it as folk typography.\n\nI guess \"everybody was a designer\" way before computers.\n\nhhp\n\n"
    },
    {
      "time": "13 Feb 2007 — 8:00am",
      "content": "Here's a link for anyone else that wants to look at them all:  \n [http://www.rootsweb.com/~scberkel/Cemeteries/Wassamassaw.html](http://web.archive.org/web/20141117234546/http:/www.rootsweb.com/~scberkel/Cemeteries/Wassamassaw.html)\n\nSome are now just rotting pieces of wood.\n\n"
    },
    {
      "time": "13 Feb 2007 — 8:13am",
      "content": "Great links BlueStreak - thanks…\n\npeace\n\n"
    },
    {
      "time": "13 Feb 2007 — 9:18am",
      "content": "Laughing at the illiterate is a bit high handed maybe?\n\nOn the plus side, good links BlueStreak.\n\n"
    },
    {
      "time": "13 Feb 2007 — 9:51am",
      "content": "Look at the last three, and note what kind of people they were for.  \nShula's headstone makes it look like her family was Village Idiot Central.  \nA rotting piece of wood has much more dignity than that mess immortalized.\n\nWhat kind of literacy are we talking about? I'm talking about the literacy of caring. We, collectively here, have a problem with people who think font selection is unimportant. Same difference in this case. Just like when you design a good font or logo but then see a case of mediocre design (including by large corporations), put yourself in the position of the stonecutter who was not hired to do it right.\n\nhhp\n\n"
    },
    {
      "time": "15 Feb 2007 — 7:36am",
      "content": "I think it's tragically beautiful. And I'm not just adopting the compassionate smug git position.\n\nWe have no idea of the context in which it was made. Either someone without ability (and possibly of low intellect) did the best they could in what was probably difficult circumstances, or maybe Hrant is right and whoever engraved it didn't care, which suggests an even sadder story.\n\nEither way, I think it's equally unworthy of designer criticism.\n\nIf you think this memorial lacks dignity, just beacause it is relatively cheap and not expertly engraved, then that is your failing.\n\n"
    },
    {
      "time": "15 Feb 2007 — 9:01am",
      "content": "You have some good points, but I do need to repeat: it's not about expertise, it's about caring. They seem to have cared about the deceased, but seem not to have cared about what we here on Typophile (as opposed to Folkpoetryphile) make it our serious business to care about.\n\nhhp\n\n"
    },
    {
      "time": "15 Feb 2007 — 9:02am",
      "content": "My take on it is that the family had no money but still plenty of love and did as best they could with the means available to them.\n\nChrisL\n\n"
    },
    {
      "time": "15 Feb 2007 — 9:09am",
      "content": "Using the money for the stone to pay a woodcarver instead would have been much better. If you can't do it well, know that, and at least don't immortalize your deficiency. Have the humility to fade into the [back]ground with dignity. This way many generations will look at that headstone and feel -even more- sorry for Shula.\n\nMaybe the father was arrogant, or dirt cheap, or had a family feud with the town stonecutter? As Jon hints, we can't know enough to be sure - but of course that can't and shouldn't prevent people from thinking and opining.\n\nhhp\n\n"
    },
    {
      "time": "15 Feb 2007 — 9:20am",
      "content": "Wait, that doesn't look like stone, it looks like cement! Maybe the father was a cement guy? So I'm guessing they poored the cement into the typical wood frame on the ground, then figured to just use a branch or something while it was still wet. I'm certainly a fan of heartfelt spontaneity, but: Had they never seen a headstone before? And when they were finished, didn't they realize it was too cruddy? They could have made a second, better one - or even just resurfaced it with a bit more cement and tried again. I think it's pretty safe to say they didn't care.\n\nhhp\n\n"
    },
    {
      "time": "15 Feb 2007 — 9:34am",
      "content": "Look, I agree with Hrant completely. Craftsmanship is important; it can say a lot.\n\n"
    },
    {
      "time": "15 Feb 2007 — 9:35am",
      "content": "Thinking about this thread, I have a feeling that the resistance to what I'm saying might be in large part a knee-jerk reaction based on the \"death complex\": the fear of our own death causes us to avoid -and even combat- any criticism of expressions of mourning. In this respect I think much can be learned from Mexican and Hindu cultures.\n\nhhp\n\n"
    },
    {
      "time": "15 Feb 2007 — 9:46am",
      "content": "To a naive person, crafsmanship may have a different meaning. People of little means have always felt the only option was to use their own hands--that the sweat and toil of their own hands had more to say than the perfection of craft by someone else's. I think of it as well like the crude, hard to read, crayoned, get well wishes from my kids several years ago when I was getting heart bypass surgurey. Their own hands may have been poor at the lettering craft, but the meaning was far more powerful than any of Zapf's finest work.\n\nChrisL\n\n"
    },
    {
      "time": "28 Jul 2012 — 7:29am",
      "content": "[Edit]\n\n"
    },
    {
      "time": "15 Feb 2007 — 9:49am",
      "content": "I agree that craft is important.\n\nBUT...\n\nIf my niece makes a card for me and it has errors or backwards letters I don't ask her to make a new card.\n\nUnless we know the entire history it isn't up to us to judge this.\n\nYes, ok, we get it.\n\nI still think it is nicer to see the positive and view this tombstone as a family of people who couldn't afford any better but still cared enough to make a tombstone which shares there sentiments with others to view.\n\n"
    },
    {
      "time": "15 Feb 2007 — 9:51am",
      "content": "... and another thing. If I couldn't afford to make a tombstone and had to do it by hand and was not a craftsman after this thread I'd hesitate sharing my sentiments with others because they'd be harshly judged.\n\n"
    },
    {
      "time": "15 Feb 2007 — 10:09am",
      "content": "\\>_Is that C for craftsman? ;)_\n\nNo.\n\n"
    },
    {
      "time": "15 Feb 2007 — 10:49am",
      "content": "Thanks to Hrant for giving us something to think about and talk about.\n\nWormwood said,  \n\"We have no idea of the context in which it was made.\"\n\nYes we do know some context. Just based on the picture Hrant posted we know it marks a grave from 1905. I extrapolated more context from the link that contained the picture. It is a grave at the Wassamssaw Baptist Church in Berkeley County, South Carolina. The closest stonecutters at that time were a hundred miles away in Charleston — cars, expressways and freight forwarding weren't around at that time BTW. The stone is more than likely limestone, the cheapest stone available and it's very soft. There is plenty more context that I gathered.\n\nI think Miss Tiffany and dezcom get it right. When my time comes I couldn't care less. Gravemarkers are for the living, not the dead. But my living thoughts are that I would prefer mine be made by someone without skills that cares rather than a hired hand. The key that Shula's marker was made by someone that cared is the poem.\n\nHrant, just saying that they could've sold some deer carcasses to cover the expense is being flippant. I am, nevertheless, glad you're giving your honest thoughts.\n\n"
    },
    {
      "time": "15 Feb 2007 — 12:22pm",
      "content": "I've written the specifications of my grave marker, and yes, it is a \"designer's\" piece. My family approves, and think it is surprisingly tasteful. I told them, I'd rather show my good side, if I have to pick one for forever. Should I care? Who cares?\n\nShould I outlive Hrant, I'll try to remember to critique his marker, and I think I am not being a jerk when I say it better be damn good, reflecting the layers of context he strives for in his work.\n\n"
    },
    {
      "time": "15 Feb 2007 — 12:39pm",
      "content": "Said:  \n1. No one cares how much you know until they know how much you care.  \n2. Change the way you look at things and things you look at change.\n\n"
    },
    {
      "time": "15 Feb 2007 — 2:12pm",
      "content": "My reaction wasn't a knee-jerk resistance to the \"death complex\". I'm as fond of Shiva as the next hombre.\n\nI should have said 'We have no idea of the _ **human** _ context in which it was made.'\n\nLike BlueStreak, I've now managed to extrapolate a lot more from the picture...\n\nShula's parents had already died from the same plague that finished her off. Only her 8 year old twin brothers remained, who were now homeless as the family shack had been reposessed by a merciless landlord. Winter came early in 1905 and it was amidst a bitter snow storm on the edge of the cemetary that the two crippled and pox ridden boys, Walta and Hecta, struggled to fulfill their dead mother's wishes by creating a lasting memorial to her beloved daughter. If they lifted even a stick from the ground the sheriff would shoot them for stealing firewood, so Walta made do and used the rotten stumps of Hecta's diseased fingers to scratch the words into the freezing cement. Or maybe not.\n\nCraftsmanship can say a lot, but mainly only about the craftsman. Hrant's probably right. If it walks like sh¡te and talks like sh¡te then...\n\n"
    },
    {
      "time": "15 Feb 2007 — 2:34pm",
      "content": "Since I agree that \"gravemarkers are for the living\", should we not leave the task to our survivors? Designing one's own seems problematic in so many ways.\n\nJon, your story is nicely lyrical, and not entirely unbelievable.  \n(And I'll have to remember that opening-exclamation trick!)\n\nhhp\n\n"
    },
    {
      "time": "15 Feb 2007 — 3:20pm",
      "content": "_If it walks like sh¡te and talks like sh¡te then…_\n\nBut some of us are coprophages:  \n [http://typophile.com/node/31458](http://web.archive.org/web/20141117234546/http:/typophile.com/node/31458 \"http://typophile.com/node/31458\")\n\nOr maybe they don't really like that stuff, they just want to use it for educational purposes :-)\n\n"
    },
    {
      "time": "15 Feb 2007 — 3:47pm",
      "content": "Hrant said...  \n\"should we not leave the task to our survivors?\"\n\nThe adage says that if you want something done right...\n\n"
    },
    {
      "time": "15 Feb 2007 — 3:48pm",
      "content": "Agree with whom? I only agree insofar as I am living and I care. And my family will presumably be living, and they cared, so they contracted the task to me, being the design guy. While I am skeptical that I will care after it is relevant, it is more comforting to think that my epitaph will be a mirror of some aspect of my life, than anything like either of the stones in that picture. What are the many problematic ways?\n\n"
    },
    {
      "time": "15 Feb 2007 — 3:52pm",
      "content": "!Jon, are you stealing my opening exclamation? Don't make me go invent more marks...\n\n"
    },
    {
      "time": "15 Feb 2007 — 4:51pm",
      "content": "Personally I would like sky burial but the Death Machine is not going to allow it so I'll leave it up to those who survive me…\n\npeace\n\n"
    },
    {
      "time": "15 Feb 2007 — 6:24pm",
      "content": "Good lord, has anyone walked through a cemetery lately? I'd certainly rest much more peacefully knowing that something this modest and sincere was planted above me rather than most of schlock that's etched in stone these days. The meaning and memorial is in the words, not the shape of the letters.\n\n"
    },
    {
      "time": "15 Feb 2007 — 9:01pm",
      "content": "I think that if all gravestone typography looked like that,  \nit would be terrible.  \nBut since only that one looks like that,  \nisn't it ingenious?\n\nmade beautiful by the fact that it is also sincere.\n\nBut I still think hrant's original joke was funny.\n\n"
    },
    {
      "time": "15 Feb 2007 — 9:20pm",
      "content": "\\>The meaning and memorial is in the words, not the shape of the letters.\n\nGosh, I guess I'm just silly, because I feel the total opposite :(  \nI really couldn't care what my memorial says. And if I ever commission any, their text with be sparse. No need to spill so many words, I think. The most important element of a marker, in my opinion, is the dash! You, know \"1925–1993.\" The year of birth and death really don't mean all that much compared with the dash… the dash is someone's entire life, boiled down into just one little mark!\n\n"
    },
    {
      "time": "15 Feb 2007 — 10:43pm",
      "content": "This here's Typophile. It's all about the shapes of the letters (or actually,  \nthe notan of text). The content is not unimportant, but beside the point.\n\nhhp\n\n"
    },
    {
      "time": "16 Feb 2007 — 8:56am",
      "content": "Hrant has pointed out that male deer are called harts. I had no idea and retract my comment about his deer carcass comment.\n\nWhen I looked at all of the other stones in that cemetary, I guessed that some were replacements. This morning I wondered if Shula's should be replaced with one using better cut letterforms. And I truly don't know. Would Shula and her family be pleased or pissed if this stone was replaced?\n\n"
    },
    {
      "time": "16 Feb 2007 — 11:11am",
      "content": "\\> The meaning and memorial is in the words, not the shape of the letters.  \nHeroist, what about the shape of the grave? Pyramids for example?\n\n\\> Personally I would like sky burial ....  \nPaul Cutler, Up the mountain like the Men of the Cave?\n\n"
    },
    {
      "time": "16 Feb 2007 — 11:30am",
      "content": "Aziz - Indeed upon the mountain - to become birds…\n\npeace\n\n"
    }
  ]
}
