{
  "id": "31363",
  "title": "\\>\\>\\> Type ID Pop Quiz V2.2 - Intermediate Level",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "This is how it works:\n\n- A complete glyph is published in the Type ID Pop Quiz.\n- Try to identify the typeface. To win, you need to name both the typeface and the weight.\n- Show off your knowledge by casually mentioning additional trivia, like who designed it, when and by whom was it (first) published, and other cool stuff to impress your fellow Typophiles with.\n- The winner produces a new challenge -- a complete glyph, black on white background, presented in a 288 x 288 pixel square, including a R204G000B00 1 pixel border.\n- The person who posts a challenge can't win the next game.\n\nIn case of any disputes, I will act as judge, jury and avenging angel of wrath.\n\nIf you think this is a little too difficult, maybe try the [Entry Level Type ID Pop Quiz](http://web.archive.org/web/20111214113153/http:/typophile.com/node/31362) first. Too easy? Go to the [Expert Level Type ID Pop Quiz](http://web.archive.org/web/20111214113153/http:/typophile.com/node/31364).\n\nGood luck everyone, and have fun. ;^)\n\n_With respectful thanks to the originator of this utterly useless but highly entertaining waste of time, the often imitated but never duplicated Cheshire Dave._\n\n",
  "author": "<a href=\"/web/20111214113153/http://typophile.com/user/110\" title=\"View user profile.\">Bald Condensed</a>",
  "time": "<br>",
  "uid": "110",
  "comments": [
    {
      "time": "",
      "content": "Here's the new challenge. Not too hard, so experienced type IDers please stay away from this one and go to the Expert Level where you belong, you bunch of hotshots. ;^)\n\n ![](http://web.archive.org/web/20111214113153im_/http:/typophile.com/files/TypeID_IntermediaryLevel_3867.gif)\n\n"
    },
    {
      "time": "",
      "content": "I dont know\n\n"
    },
    {
      "time": "",
      "content": "Say Marc, you can't post a new challenge before you solved mine. Please read the rules, dude. ;^)\n\n"
    },
    {
      "time": "",
      "content": "Sorry Bald, It's was a little Joke\n\nIt wont happen\n\n"
    },
    {
      "time": "",
      "content": "almost Apex…\n\nmaybe Clan? That new one with no italic?\n\nMuzz\n\n"
    },
    {
      "time": "",
      "content": "Hah, no sweat, I didn't get it was a joke. :^)\n\n"
    },
    {
      "time": "",
      "content": "Is it?\n\n"
    },
    {
      "time": "",
      "content": "Oy, Murray, I don't know what happened but I didn't notice your post when I posted my last comment. Yes, you are right, it is [FF Clan Wide News](http://web.archive.org/web/20111214113153/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=FF.11750.0.3&attributes.sampleSize=144&sampleText=g&sampleSize=288) by [Lukasz Dziedzic](http://web.archive.org/web/20111214113153/http:/typophile.com/wiki/Lukasz%20Dziedzic).\n\nGood one, you're up. :^)\n\n"
    },
    {
      "time": "",
      "content": "good luck kids!\n\n ![](http://web.archive.org/web/20111214113153im_/http:/typophile.com/files/a_3701.gif)\n\n"
    },
    {
      "time": "",
      "content": "That's certainly a perky little tail. I can't remember seeing anything of this type with a terminal (or lack thereof) like that. Anxious for someone to get it right.\n\n"
    },
    {
      "time": "",
      "content": "I think I have an idea who designed this glyph... B^)\n\n"
    },
    {
      "time": "",
      "content": "Go on mates! Czech it out…\n\nMuzz\n\n"
    },
    {
      "time": "",
      "content": "ITC Tyfa? I should know my Czech designers better. I've heard nothing but good things about Praha in the last year or so. On that note, I'm anxiously awaiting the day that Škoda starts exporting to the U.S... I'll be the first one in line.\n\n"
    },
    {
      "time": "",
      "content": "Yes v-6! That one is the Tyfa 1959 GRafotechna version! Your turn......\n\nMuzz\n\n"
    },
    {
      "time": "",
      "content": "This is my miserable failure moment. I read the directions on posting an image, and had no luck. The black bar with the edit button is evading me. Anyway, until I get it figured out (sorry), here's a link to the image. It's an easy one to get things moving in here.\n\n ![](http://web.archive.org/web/20111214113153im_/http:/typophile.com/files/quizzie0214_5051.gif)\n\n"
    },
    {
      "time": "",
      "content": "I helped you out. :^)\n\n"
    },
    {
      "time": "",
      "content": "Thank you! X^)\n\n"
    },
    {
      "time": "",
      "content": "Is \\*that\\* a cent-symbol?\n\n"
    },
    {
      "time": "",
      "content": "No, not a cent symbol. Unless you mean my avatar, but that's for another day!\n\n"
    },
    {
      "time": "",
      "content": "If/when hints are needed, let me know, but this one should be in the bag... it's an obscure reference.\n\n"
    },
    {
      "time": "",
      "content": "It's a variation on the paragraph symbol, yes? Jenson? Or perhaps some derivative of Jenson like the Doves or Golden Type?\n\n"
    },
    {
      "time": "",
      "content": "Thats look like an a on the side\n\n"
    },
    {
      "time": "",
      "content": "Where did v-six go?\n\n"
    },
    {
      "time": "",
      "content": "Jason got it.\n\nIt's the capitulum from Adobe Jenson Pro.  \nYou're up.\n\n(p.s. I was at work trying to find something in our limited font library that would go well with ITC Berkeley).\n\n"
    },
    {
      "time": "",
      "content": "Jason, you're up! Good one BTW, I would never have found that one.\n\nPeople, please keep in mind this is the Intermediate Level. If you feel like going really obscure on the glyphe choice, maybe head over to the Expert Level. ;^)\n\n"
    },
    {
      "time": "",
      "content": "Sorry 'bout that, I figured that would stand out like a sore thumb, it's one of the few of its kind without a descender... but I guess it was so different that it wasn't clear what the glyph was. Also, any alphabetic character from Jenson Pro would've almost gone in the beginner category, except that maybe it'd be confused with Centaur. Anyway, if I end up posting another I'll stay away from the analphabetic stuff.\n\nRegards  \nCasey\n\n"
    },
    {
      "time": "",
      "content": "Casey, also don't name your uploaded image what the typeface is ... ;^) I had to bow out of this round because I knew the name of it. (Don't worry, I've done it before too.)\n\n"
    },
    {
      "time": "",
      "content": "I named the image capitulum, that only hinted at the character, which apparently would've helped anyway.. but yes, I am absent minded enough that I certainly _could_ have done that. You had no need to duck out, maybe the second you saw the image your sub-conscious replaced _capitulum_ with _Jenson_. That's when you know you're good :)\n\n"
    },
    {
      "time": "",
      "content": "This might be a piece of cake; basically if you've used this font even once this is going to jump right out at you, but I used it recently so it's what came to mind. Have fun...\n\n ![](http://web.archive.org/web/20111214113153im_/http:/typophile.com/files/amp_4585.gif)\n\n"
    },
    {
      "time": "",
      "content": "Reminds me of Maiola ... but it isn't.\n\n"
    },
    {
      "time": "",
      "content": "Now _that_ is one typical ampersand -- I know who designed it, but I'm not sure which of his typefaces it is. I think (chronologically speaking) the middle one.\n\n"
    },
    {
      "time": "",
      "content": "Nope, it's his first design, the one that made him _really_ famous and popular.\n\nBTW In reply to an e-mail Casey sent me -- it's very hard to define what's too difficult for the Intermediate Level Quiz, and I think I spoke too soon. So no worries about posting something like an ampersand, just don't start posting periods or en-dashes, OK? ;^)\n\n"
    },
    {
      "time": "",
      "content": "Oh, er, that'd be the ampersand in Martin Majoor's FF Scala Italic from 1990. (Tiff, Casey, Muzz – surely you're holding back? I guess it must be nighttime elsewhere in the world...)\n\n"
    },
    {
      "time": "",
      "content": "Yep, you've got it Ben, you're up. (I figured it was a bit too distinctive to be difficult, but it's just such a great ampersand.)\n\n"
    },
    {
      "time": "",
      "content": "OK. Should be easy as\n\n ![](http://web.archive.org/web/20111214113153im_/http:/typophile.com/files/mystery-character_5047.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Ben, good choice, this one probably doesn't hang out around typophile too much.\n\n"
    },
    {
      "time": "",
      "content": "It's Giddyup, Yee-haw!\n\n"
    },
    {
      "time": "",
      "content": "Don't know if I have to wait for confirmation, but in the meantime, here's a royal new challenge, wonder\n\n ![](http://web.archive.org/web/20111214113153im_/http:/typophile.com/files/y_5035.gif)\n\n"
    },
    {
      "time": "",
      "content": "Sorry Bart. Yes you're up; it was the Q from Adobe Giddyup Std. I was attempting to move from the sublime to the ridiculous. Nice new challenge there.\n\n"
    },
    {
      "time": "",
      "content": "Ooooh, this should be either an italic lowercase r or uppercase Y. Quite beautiful.\n\n"
    },
    {
      "time": "",
      "content": "It's an italic uppercase Y.\n\nIf hints are needed btw, I will be glad to meat demand.\n\n"
    },
    {
      "time": "",
      "content": "Is it [DTL Fleischmann Regular Italic](http://web.archive.org/web/20111214113153/http:/www.dutchtypelibrary.nl/DTLFleischmann.html) by [Erhard Kaiser](http://web.archive.org/web/20111214113153/http:/www.dutchtypelibrary.nl/Kaiser.html)?\n\nGr.\n\nT.\n\n"
    },
    {
      "time": "",
      "content": "Without any clue, it is really impressive.\n\n"
    },
    {
      "time": "",
      "content": "Good one, T. Your turn. :^)\n\n"
    },
    {
      "time": "",
      "content": "oh no. i KNEW i know that Y, i knew it. i've been looking at fleischmann like 2 hours a day lately, thats why! i could've won! ;)\n\n"
    },
    {
      "time": "",
      "content": "Yes, it's DTL Fleischmann, also known as _Kaisers Königliche Fleischmann_. (I gave two very tiny clues, but I don't think they were very helpful, so well done!) You're up. :)\n\n"
    },
    {
      "time": "",
      "content": "Ok, nice, i post a knew one in a couple of minutes.\n\nT.\n\n"
    },
    {
      "time": "",
      "content": "Ok, here we go:  \nGood luck\n\n ![](http://web.archive.org/web/20111214113153im_/http:/typophile.com/files/02_3733.gif)\n\nT.\n\n"
    },
    {
      "time": "",
      "content": "If hints are needed...\n\n"
    },
    {
      "time": "",
      "content": "Good one T, I'm out in the dark on this one. I remember recently seeing a similar italic with a similar slope (or relative lack of slope) but can't for the life of me what it was.. Almost seems like something Jan van Krimpen would've done with a few small tweaks. The sharp edge on the bottom serif will haunt me until someone ID's this.\n\n"
    }
  ]
}
