{
  "id": "31362",
  "title": "\\>\\>\\> Type ID Pop Quiz V2.2 - Entry Level",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "This is how it works:\n\n- A couple of words are published in the Type ID Pop Quiz, possibly -- but not necessarily -- providing a hint.\n- Try to identify the typeface. To win, you need to **e-mail me both the correct name and weight. Do not reply in the thread itself to allow other enthusiasts to participate.**\n- Show off your knowledge by casually mentioning additional trivia, like who designed it, when and by whom was it (first) published, and other cool stuff to impress your fellow Typophiles with.\n- Every week a new challenge will be posted.\n\nIn case of any disputes, I will act as judge, jury and avenging angel of wrath.\n\nIf you think this is too easy, maybe try the [Intermediary Level Type ID Pop Quiz](http://web.archive.org/web/20120130032456/http:/typophile.com/node/31363) or [Expert Level Type ID Pop Quiz](http://web.archive.org/web/20120130032456/http:/typophile.com/node/31364).\n\nGood luck everyone, and have fun. ;^)\n\n_With respectful thanks to the originator of this utterly useless but highly entertaining waste of time, the often imitated but never duplicated Cheshire Dave._\n\n",
  "author": "<a href=\"/web/20120130032456/http://typophile.com/user/110\" title=\"View user profile.\">Bald Condensed</a>",
  "time": "<br>",
  "uid": "110",
  "comments": [
    {
      "time": "",
      "content": "We're back in action! New challenge. As usual, no replying within the thread, but e-mail me the solution through my profile.\n\n ![](http://web.archive.org/web/20120130032456im_/http:/typophile.com/files/TypeID_EntryLevel_4842.gif)\n  \nPreviously on the Type ID Pop Quiz...  \n [NEW! Type ID Pop Quiz V2.1 - Entry Level](http://web.archive.org/web/20120130032456/http:/typophile.com/node/27995)  \n [NEW! Type ID Pop Quiz V2.1.1 - Entry Level](http://web.archive.org/web/20120130032456/http:/typophile.com/node/28886)\n"
    },
    {
      "time": "",
      "content": "Correct answers so far:\n\nMili Carr | Rani Begley | Ties Linders | Elliot Merrony | Stephen Lording | Thierry Blancpain | Satya Nrajpurohit | brand spanking new member Felix | Vincent Grouls\n\n"
    },
    {
      "time": "",
      "content": "As usual, Stephen Lording's answer was very complete:\n\n\\> _It's Trebuchet, designed in 1996 for [Microsoft](http://web.archive.org/web/20120130032456/http:/typophile.com/wiki/Microsoft) by Typophile's own [Vincent Connare](http://web.archive.org/web/20120130032456/http:/typophile.com/wiki/Vincent%20Connare). Designed for easy screen readability, it comes bundled with Windows and is apparently the default font for title bars in Windows XP. (Not being a Windows person I'm unable to verify this bit of trivia.)_\n\n[Connare says](http://web.archive.org/web/20120130032456/http:/www.microsoft.com/typography/web/fonts/trebuche/default.htm) that the name came out of a discussion he was having with some colleagues about trebuchets. As a trebuchet launches missiles, he thought it would be \"a great name for a font that launches words across the Internet.\"\n\nThnaks to everyone for participating. New challenge coming up. ;^)\n\n"
    },
    {
      "time": "",
      "content": "ahh trebuchet, the thinking mans Comic Sans\n\nMuzz\n\n"
    },
    {
      "time": "",
      "content": "ROFL! I'm actually using it for a web-based project, since it's less objectionable than the other choices I was given....\n\n"
    },
    {
      "time": "",
      "content": "Hehehe, I could say some choice words about MS Trebuchet, but I agree with Linda that it has its use for screen-based typography.\n\nNew challenge! As usual, no replying within the thread, but e-mail me the solution through my profile.\n\n ![](http://web.archive.org/web/20120130032456im_/http:/typophile.com/files/Entry_Level_5327.gif)\n\n"
    },
    {
      "time": "",
      "content": "Errr... Is this one too difficult? It's a _very_ common face (at least to Mac users, I don't know about MS Windows). The only way for you to _not_ have it is that you would have removed it on purpose.\n\n"
    },
    {
      "time": "",
      "content": "i dont think is a windows system font, have never seen it on my system. dont know it either.\n\n"
    },
    {
      "time": "",
      "content": "Ah, but us Windows types have Comic Sans so don't need to look further afield for our handwriting style needs ;-)\n\n"
    },
    {
      "time": "",
      "content": "Correct answers so far:\n\nMili Carr | Elliot Merrony | Stephen Lording\n\n"
    },
    {
      "time": "",
      "content": "And indeed, it's Bradley Hand! Explanation by Stephen lording:\n\n_(...) Designed in 1995 by Englishman Richard Bradley, it's based upon his own (right-handed) handwriting. Hmm, I wonder what percentage of scripts out there are based on the left hand? Another area in which we poor lefties are under-represented. :)_\n\n"
    },
    {
      "time": "",
      "content": "Let's see if this one is too difficult as well. It's a classic.\n\nNew challenge! As usual, no replying within the thread, but e-mail me the solution through my profile.\n\n ![](http://web.archive.org/web/20120130032456im_/http:/typophile.com/files/Entry-Level_20070303_5953.gif)\n\n"
    },
    {
      "time": "",
      "content": "Look, Yves, I appreciate the time you put into putting these samples together, but is a little kerning too much to ask? :)\n\n"
    },
    {
      "time": "",
      "content": "The fw and tw combo would make for great ligatures :-). But I agree with Stephen; just because we're beginners doesn't mean we don't know anything about kerning :-P\n\n"
    },
    {
      "time": "",
      "content": "Note to self -- disqualify Stephen and Vincent for the remainder of their natural lives (and then some) for being such smartasses. :^P\n\nAnd now you'll all come whining: \"Oh, but we couldn't possibly identify this sample because of the horrible kerning. It's not because we can't ID type; the character shapes were nearly indecipherable.\" _You aint foolin' no-one!_ :^D\n\n"
    },
    {
      "time": "",
      "content": "Correct answers so far:\n\nLinda Cunningham | Bart Hakvoort | Vincent Grouls | Ties Linders | Elliot Merrony Mili Carr | Brian Jongseong Park | Bert Vanderveen\n\n"
    },
    {
      "time": "",
      "content": "Woo hoo! :-)\n\n"
    },
    {
      "time": "",
      "content": "Does that mean I'm only exempt from Entry level, or from all levels? Can't believe you would do that to a fellow Fleming (although I _did_ emigrate a few years ago, abandoning the fatherland he he).\n\nLinda, I thought you were Intermediate or higher? :P\n\n"
    },
    {
      "time": "",
      "content": "I've lurked severely: mostly I'd find the \"new\" Entry quiz after it had been up for awhile and had already been identified. So I moved on to the Intermediate and Expert, but I never looked at the right place/time (and put doing business ahead of silly things like type ID) to get it right. Silly moi.\n\nThis one let me be in the right place at the right time.\n\nFor a change.... ;-)\n\n_Linda, I thought you were Intermediate or higher? :P_\n\nI try to restrict getting higher in crowds. ;-) (You're now in Aberdeen, though: my MIL is from Dufftown.)\n\n"
    },
    {
      "time": "",
      "content": "I hope you can understand what she says ha ha. The dialects here are so broad... In Belgium one Flemish side of the country have difficulties understanding what the other side is saying, but around here you can hardly understand someone living only 20 miles away.\n\n"
    },
    {
      "time": "",
      "content": "She's been in Canada for more than 50 years, so it's mellowed out, but every once in awhile, she'll let loose with something almost incomprehensible to most people (like calling my brother-in-law's new abode \"a wee housie\"). Luckily, my dad was born in Glasgow, so I don't need subtitles for a good Scots brogue. ;-)\n\n"
    },
    {
      "time": "",
      "content": "One of my work mates is also from the Glasgow area but he's been living in Aberdeen for over 10 years. It's funny when he drops a line in Glaswegian; that totally different tongue makes a great change\n\nI usually speak proper English but I do know how to say \"Put yer tuurie on coz it's caul' ootside\" :-).\n\n"
    },
    {
      "time": "",
      "content": "Yves, I don't think banning me will make any difference this round as I don't have an answer for you anyway. I can get close, but I'm still not there. That lc 'a' is staring me dead in the eye and laughing! It's so familiar. I'm going to kick myself, aren't I?\n\n"
    },
    {
      "time": "",
      "content": "Yes. ;-)\n\n"
    },
    {
      "time": "",
      "content": "Aaaaah, sweet revenge... :^P\n\n"
    },
    {
      "time": "",
      "content": "Ha ha ha Stephen! Shoulda tried to solve the puzzle before complaining ;-).  \nUnless obviously you cannot find the answer due to Yves' poor kerning...\n\n"
    },
    {
      "time": "",
      "content": "_Aaaaah, sweet revenge… :^P_\n\nROFL! Some days, if I hadn't had bad luck, I wouldn't have had any luck at all....\n\n"
    },
    {
      "time": "",
      "content": "So Yves, when are we getting a new one? ;-)\n\n"
    },
    {
      "time": "",
      "content": "Yeah Yves, we need to get this one squared away, right?\n\n"
    },
    {
      "time": "",
      "content": "I was waiting for your e-mail, Bert! :^D\n\nVincent had something funny to say:\n\n_\"The answer is [FF Quadraat](http://web.archive.org/web/20120130032456/http:/www.fontshop.com/showfont.cfm?fid=FF.11674.0.0), a typeface by [Fred Smeijers](http://web.archive.org/web/20120130032456/http:/typophile.com/wiki/Fred%20Smeijers), a Dutchman now living and working in Belgium. I hope no one will shoot me if I say Quadraat is a great alternative if you don't know which version of Garamond you would like to set in your publication :-).\"_\n\nWell, I guess it all depends who you'd say that to. ;^)\n\nHey, what's that? I think I hear the sound of someone kicking himself from afar. How peculiar... :^P\n\n"
    },
    {
      "time": "",
      "content": "New challenge! As usual, no replying within the thread, but e-mail me the solution through my profile.\n\n ![](http://web.archive.org/web/20120130032456im_/http:/typophile.com/files/EntryLevel070311_5020.gif)\n\n"
    },
    {
      "time": "",
      "content": "Ha ha Yves, if you're talking about me... Well I can still make an arse of myself; I mean, I'm only a beginner :P. I'm not really into kicking myself; I prefer other to do that he he.\n\n"
    },
    {
      "time": "",
      "content": "\\> _Ha ha Yves, if you’re talking about me…_\n\nNo I'm not. Check what Stephen had to say 10 comments upwards:\n\n\\> _\"(...) That lc ‘a’ is staring me dead in the eye and laughing! It’s so familiar. I’m going to kick myself, aren’t I?\"_\n\n;^)\n\n"
    },
    {
      "time": "",
      "content": "Correct answers so far:\n\nVincent Grouls | Stephen Lording | Linda Cunningham | Mili Carr | Bert Vanderveen | Elliot Merrony\n\n"
    },
    {
      "time": "",
      "content": "Ow! (Rubs bruised shin.)\n\nI'm familiar with FF Quadraat, but obviously not familiar enough! I was so sure (initially) that it was Garamond, Bembo or Sabon, but no. I recently used Bembo for an Annual Report, so it must have been its 'a' that was laughing at me... although maybe after work down the pub it was sharing a chuckle with Quadraat too?\n\nOh, and as footnote, I wasn't <cite>complaining</cite>; just holding Typohile to the exceptionally high standard I've come to expect! :)\n\n"
    },
    {
      "time": "",
      "content": "Stephen -- go for the kerning excuse. ;-)\n\n"
    },
    {
      "time": "",
      "content": "[I dare you! I _double dare_ you!](http://web.archive.org/web/20120130032456/http:/4.upload.dailymotion.com/video/x1a6sk_intonation) :^D\n\n"
    },
    {
      "time": "",
      "content": "I considered you to be a Vincent Vega person, Yves.\n\n"
    },
    {
      "time": "",
      "content": "Ha, ha! That's so good! I love it.\n\nNo, no excuses needed. There's no shame in dropping the odd ball, surely? Even in the Entry Level Quiz. And I certainly know Quadraat now! I can't wait for a sample to pop up on the Type ID Board because I am going to whack it down!\\*\n\nActually, I'd be interested to know how the successful IDers reached an answer. Did you know Quadraat already, and if not, what path did you take to the answer? Cheers.\n\n\\*That's assuming Mr Peters and the rest of the fine team let me get to it first...\n\n"
    },
    {
      "time": "",
      "content": "I've been lurking the fora for several weeks now, looking to learn more about the plethora of fonts available.\n\nQuadraat is being mentioned quite regularly, and whenever I look at the previews, that P always jumps right out at me. I was 99% sure, since the Q sits 'halfway between Plantin and Times'. Then I just checked it on fontshop.com to be completely sure...\n\n"
    },
    {
      "time": "",
      "content": "Depends. Sometimes, like the current challenge, it's something I've used a lot in the past and I have an \"aaah\" moment, but for others (the newer ones in particular), it's a little deductive reasoning like Vince mentioned, combined with a perusal of various font catalogues and/or Identifont.\n\n"
    },
    {
      "time": "",
      "content": "I use similar techniques to Linda, added with MyFonts search tool (not the WhatTheFont, that wouldn't be right) and FontExplorer.  \nThe latest one was totally new to me.\n\n"
    },
    {
      "time": "",
      "content": "Given the Quadraat, unlike those before, had no clue to the name (I looked for ages for something called Demi...) I started with MyFonts search. Then when I didn't get anywhere I used Identifont, which I would regard as a last resort along with Fontshop's visual search.\n\n"
    },
    {
      "time": "",
      "content": "Mili, I think that's a matter of what we're interested in outside of type -- I've done a lot of work in architecture and design history, and tend to link some faces with their appropriate era (as Yves did in his clue for the current challenge). For me, the designer was obvious and it was simply a matter of choosing which face was the correct one. ;-)\n\n(That being said, I'm pretty useless at IDing grunge faces -- dates me, I guess!)\n\n"
    },
    {
      "time": "",
      "content": "I had totally forgotten where I used to ID my fonts!!! A few years back I used it when I was doing a lot of re-designs... Used identifont quite a lot, but I couldn't find the site when back I was looking for it a few weeks back. That'll teach me for not bookmarking every single site I visit lol.\n\nNow added to my bookmarks, and my tools to use whenever trying to ID a font :-). Have always found it an awesome way. The questions they pose there even helps you recognise a font in the future I find.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for that. That's all cool. Pretty much how I go about it as well. Just got stuck on Quadraat, and wasn't sure what terms to search for. Um, \"serif?\" Um, \"not plantin?\" Um, \"cap P with little bit that doesn't join up with the stem\"? Ah c'mon Google! 0 Results?\n\n"
    },
    {
      "time": "",
      "content": ":-) So, Yves, are we getting a new one?\n\n"
    },
    {
      "time": "",
      "content": "Whoops, has this much time passed already!? Must be time for a new challenge I reckon! :^P\n\nLinda, as you're the one so eager for a new quiz, I'll use your reply:\n\n_Ah, this is one of my faves: Bernhard Fashion, from Lucian Bernhard. Released right before the big crash of 1929, it's a great Art Deco font. Makes me want to do the Charleston and really miss climbing into the elevators of the Chrysler Building.... ;-)_\n\nFWIW, one of the Bernhard Gothics was recently used in a publication called \"Corporate Knights\" here in Canada, but the tail in the Q was so detached, and the leading so tight, that it was just a disaster. Gee, I hate people who do that, don't you? Feh!\n\n"
    },
    {
      "time": "",
      "content": "A couple of you \"complained\" that I gave away too much with the previous challenge, so let's see what you can make of this:\n\n ![](http://web.archive.org/web/20120130032456im_/http:/typophile.com/files/EntryLevel_070321_3626.jpg)\n\n"
    },
    {
      "time": "",
      "content": "<cite>A couple of you “complained”...</cite>\n\nIt wasn't me! I've learned my lesson.\n\n"
    }
  ]
}
