{
  "id": "31377",
  "title": "Air Fire Telephone & Data logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hi,\n\nI’ve been tasked with creating an identity for an IT company called Air Fire Telephone and Data. The provide various products such as Digital Telephone, Internet Access, Server Co-Location, Web Hosting, Data Backup, E-mail/Spam Control, Domains, and Network Consulting. Their clientele are business's who rely on the internet. They are not after the low end customers. They are after people who loss money when the internet is not working for them. The client wants to reinforce that they are the most relieable IT company. Any thoughts would be very helpful.\n\nThanks\n\n ![](http://web.archive.org/web/20131108211134im_/http:/typophile.com/files/air-fire-logos_5000.gif)\n\n",
  "author": "ldredden",
  "time": "12 Feb 2007 — 6:56am",
  "uid": "13156",
  "comments": [
    {
      "time": "12 Feb 2007 — 9:57am",
      "content": "I prefer the top one, but maybe use the heavy bold throughout the name \"airfire\".\n\n"
    },
    {
      "time": "12 Feb 2007 — 11:34am",
      "content": "Maybe I'm wrong, but these seem like your first sketches. I would expand your range of concepts. Right now the bottom one says communications to me more than the others, but it's very clichéd. The flame, while relating to the \"fire\" part of the name, doesn't really add anything new and memorable to stand as an identity. The name is interesting and strong. It may not need an additional symbol, just a really strong and well-set logotype.\n\nFocus on what they want to be known for: the reliability of their technology.\n\nFinally, remove \"INC.\" from the descriptor. That's part of their legal business name, but doesn't need to be included in the logo.\n\n"
    },
    {
      "time": "18 Feb 2007 — 1:25pm",
      "content": "I prefer the third. The element between air and fire looks like it could be both.\n\nI'd love to see more of what you come up with in that direction.\n\n"
    },
    {
      "time": "19 Feb 2007 — 1:27pm",
      "content": "I'm going to go out on a wing and say you didn't use a pen and paper when brainstorming. Am I right?\n\n----------  \n**Paul Ducco**  \n [Design, Melbourne](http://web.archive.org/web/20131108211134/http:/www.solid-creative.com/print.htm)  \n----------  \n [Little Mischief](http://web.archive.org/web/20131108211134/http:/www.littlemischief.com/)\n\n"
    },
    {
      "time": "21 Feb 2007 — 4:29pm",
      "content": "I prefer the third one, but the flame looks a bit too simple. Maybe try adding more \"strokes\" to it?\n\n"
    }
  ]
}
