{
  "id": "3139",
  "title": "A versitile Sans Face",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Ok, so I have come about some credit at FontFont.   \nSome of you may know how.   \n   \nIm looking to pickup a versitile sans face.   \nI want something that I can make good use of.   \nIt needs to be something with chracter, but not overly mannered. Something that would work well for a text face. Hopefully with a 'pro' set. SC OSF and the such.   \n   \nI've been wanting to pick up Scala Sans for some time now. Is this the time?   \n   \nHildebrant.\n\n",
  "author": "hildebrant",
  "time": "Sat, 2004-02-14 16:57",
  "uid": "1286",
  "comments": [
    {
      "time": " Sat, 2004-02-14 17:24",
      "content": "\\> Is this the time?   \n   \nFor Scala Sans? No time like the present!   \n   \nBTW, How is \"Scala\" pronounded, Skay-la or Ska-la?\n\n"
    },
    {
      "time": " Sat, 2004-02-14 18:08",
      "content": "Funny thing you ask, I just asked the same question last night, in conversation with a friend.\n\n"
    },
    {
      "time": " Sat, 2004-02-14 20:56",
      "content": "I think it rhymes with \"gala.\" ;-)\n\n"
    },
    {
      "time": " Sat, 2004-02-14 22:29",
      "content": "But some people pronounce that \"gay-lah\". :-/   \n   \nSince the name comes from an opera house in Milan, I'd pronounce it \"SCAH-lah\". On the other hand, I pronounce Officina with a \"tch\" (since it's [also] of Italian origin), but its creator (Spiekermann) pronounces it with an \"s\"!   \n   \nKyle, Scala is certainly versatile, of character, and texty. But it's also too ubiquitous. I'd go for something less used, like Eureka Sans, Profile, Quadraat Sans, or maybe even Karbid.   \n   \nhhp\n\n"
    },
    {
      "time": " Sun, 2004-02-15 21:57",
      "content": "Quadraat Sans, Mmm, goos sugestion. I had admired the Serif, but had nevered really paid much attention to the Sans. Reminds me a bit of Unger's work.   \n   \nHildebrant.\n\n"
    },
    {
      "time": " Sun, 2004-02-15 21:59",
      "content": "How about favorite San-erif faces in FontFolio 9 (or 8)??   \n   \nHildebrant.\n\n"
    },
    {
      "time": " Mon, 2004-02-16 09:58",
      "content": "_But some people pronounce that \"gay-lah\". :-/_    \n   \nI know. It was a joke.\n\n"
    }
  ]
}
