{
  "id": "31408",
  "title": "Your Favorite Design Systems",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I'm working on a project that has be coming up with a system, of sorts, that depends a lot upon color for differentiation and is to be used across different media. (For instance workbook covers and Keynote presentations.)\n\nThis got me thinking what are some of your favorite ways color has been used in systems?\n\n",
  "author": "Miss Tiffany",
  "time": "13 Feb 2007 — 10:17am",
  "uid": "108",
  "comments": [
    {
      "time": "13 Feb 2007 — 11:24am",
      "content": "I've always liked duotones, especially when there's some selective masking or done with unusual spot colours.\n\nI'm impressed by the full-page, full-colour newspaper ads for Gwen Stefani's new tour, with the platinum and gold colour scheme, subtle bling -- like many tinted effects you can get with \"full-colour\" photoshop files it reminds me of those old duotone effects.\n\nI guess what I'm saying is that there are graphic possibilities in the way pictures can be integrated into a colour system.\n\n"
    },
    {
      "time": "13 Feb 2007 — 11:45am",
      "content": "There was a book I saw once (and I'll NEVER remember the name) where the footnotes were color coded (bars behind the text) and then placed - in their color - in the margins. It wasn't ideal for readability necessarily but it looked fantastic and was very easy to use once you got used to it. And this was not a reading book.\n\nI'd also check out children's textbooks - they do more with color than adult stuff.\n\n"
    },
    {
      "time": "13 Feb 2007 — 12:45pm",
      "content": "I would suggest a heirecy of colors, dominate, secondary and maybe a third level. I will be working on a website in the near future that the dominate color is a dark gray. I have four complimentary colors already selected and another gray as a third level of color. Its not a system but tailored to the client.\n\n"
    },
    {
      "time": "13 Feb 2007 — 1:19pm",
      "content": "The dominant color is black in my scheme.\n\nI wasn't necessarily asking for suggestions. I thought it would be interesting to see if others have noticed systems, for instance in book design, that can be linked here. Penguin books, for instance had a strong system.\n\n"
    },
    {
      "time": "13 Feb 2007 — 1:26pm",
      "content": "any pics to go along with those posts?\n\n----------  \n**Paul Ducco**  \n [Design, Melbourne](http://web.archive.org/web/20131015145105/http:/www.solid-creative.com/print.htm)  \n----------  \n [Little Mischief](http://web.archive.org/web/20131015145105/http:/www.littlemischief.com/)\n\n"
    },
    {
      "time": "13 Feb 2007 — 1:34pm",
      "content": "For instance, what Adobe is doing with their new identity as written about by [John Nack](http://web.archive.org/web/20131015145105/http:/blogs.adobe.com/jnack/2006/12/the_other_cs3_icons.html). ( [Direct link to the diagram](http://web.archive.org/web/20131015145105/http:/blogs.adobe.com/jnack/images/wheel-o%27-icons.html).)\n\n"
    },
    {
      "time": "13 Feb 2007 — 2:21pm",
      "content": "The way the entire Magic The Gathering trading card game revolves around colors that defined the concepts behind the game is great. It's one of the most obvious parts of the whole rule system, but it quickly becomes subtle and makes way for gameplay mechanics which include a huge collection of type and symbols.\n\n"
    }
  ]
}
