{
  "id": "31403",
  "title": "Micropolis",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "First of all, I wasn't sure whether to post this font here, in the Display forum or the Experimental forum.  \nI've tried to make a legible (and I use that term broadly) font with a 10 pixel limit for each glyph while respecing each character's characteristics (ascenders/descenders). I'm not sure if I succeeded at this, after all, I knòw what it's supposed to be, but I do like the outcome of it.\n\n| Attachment | Size |\n| --- | --- |\n| [Micro.gif](http://web.archive.org/web/20150414143810/http:/typophile.com/files/Micro.gif) | 28.88 KB |\n| [Micro2.gif](http://web.archive.org/web/20150414143810/http:/typophile.com/files/Micro2.gif) | 3.6 KB |\n| [Micro3.gif](http://web.archive.org/web/20150414143810/http:/typophile.com/files/Micro3.gif) | 2.39 KB |\n\n",
  "author": "ill sans",
  "time": "13 Feb 2007 — 4:59am",
  "uid": "13099",
  "comments": [
    {
      "time": "13 Feb 2007 — 5:18am",
      "content": "dude, that is awesome, I also like the outcome of it. It's great to see when formalism like that really pays off with something nice to look at  \nnice\n\n"
    },
    {
      "time": "13 Feb 2007 — 6:43am",
      "content": "excellent\n\n"
    },
    {
      "time": "13 Feb 2007 — 10:27am",
      "content": "I've updated the font with uppercase characters & slight changes to the lowercase l, m & w. I also made new numbers.\n\n"
    },
    {
      "time": "14 Feb 2007 — 12:38am",
      "content": "Check out my Fourmat, further down the Bitmap Text page. It's interesting how we were able to achieve significantly different styles with these parameters.\n\n"
    },
    {
      "time": "14 Feb 2007 — 2:38am",
      "content": "Interesting indeed, but what might explain a lot is that I didn't want to make diagonal corners with \"wandering pixels\" which obviously makes a look a lot heavier.\n\n"
    },
    {
      "time": "14 Feb 2007 — 4:55am",
      "content": "Hey cerulean, I considered your comment as a challenge & made a pixel font (see Micro3) according to your parameters (also using \"wandering pixels\" this time) just for comparison & -obviously- this one is a lot more like your Fourmat (nice name BTW)... Even the capital B which I found quite a challenge turned out pretty much the same, but then again, there's only so many ways to make a letter using a limited amount of pixels.\n\n"
    },
    {
      "time": "14 Feb 2007 — 1:07pm",
      "content": "The new z there is nifty. And I was indeed impressed with the contiguous-area aspect of Micropolis.\n\n"
    }
  ]
}
