{
  "id": "31432",
  "title": "Non-Latin ligatures",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Somehow I have a feeling that of the European scripts, the Latin and Armenian scripts can't be the only one with a typographical history of [ligatures](http://web.archive.org/web/20141031100941/http:/typophile.com/wiki/ligature). Are there any common ligatures in Cyrillic/Georgian/Greek scripts? Or any common ligatures in Latin/Armenian other than the standard ones defined in the [Unicode](http://web.archive.org/web/20141031100941/http:/typophile.com/wiki/Unicode) spec (in addition to other semi-common ligatures like fj, ct, ck, it, ip)?\n\n",
  "author": "guifa",
  "time": "14 Feb 2007 — 2:09am",
  "uid": "16708",
  "comments": [
    {
      "time": "14 Feb 2007 — 2:46am",
      "content": "Greek, as written by mediaeval scribes, used to have lots of ligatures that make it really difficult for me to read Greek manuscripts from that era. Adaptation to the typographic age must have had something to do with the fact that we don't see them so much anymore.\n\nNowadays in Greek typography, I think ligatures serve mainly an aesthetic function rather than arising from scribal shorthand; some ligatures I see are for double lambda or double gamma and the like.\n\n"
    },
    {
      "time": "14 Feb 2007 — 6:03am",
      "content": "In Polish double \"ł\" ligature could be considered.\n\nFrom [Adam Twardoch's](http://web.archive.org/web/20141031100941/http:/www.twardoch.com/download/polishhowto/index.html) manual:\n\n ![](http://web.archive.org/web/20141031100941im_/http:/typophile.com/files/lslash_script_liga_3522.gif)\n\n\\_\\_\\_\\_\\_\\_\\_  \n AL  \n [lenart.pl](http://web.archive.org/web/20141031100941/http:/www.lenart.pl/)\n\n"
    },
    {
      "time": "14 Feb 2007 — 9:21am",
      "content": "What would a double lambda or double gamma look like? The only Greek ligature I can find info on (for modern-day Greek typefaces) is the OU.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos.» (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "14 Feb 2007 — 10:44am",
      "content": "[http://www.backpacker.gr/](http://web.archive.org/web/20141031100941/http:/www.backpacker.gr/ \"http://www.backpacker.gr/\")\n\n\\> Projects \\>shop lettering\n\nPics by George Trianta (Backpacker) show several Greek ligs.\n\n"
    },
    {
      "time": "14 Feb 2007 — 11:11am",
      "content": "Greek used to be the king of ligation. No, the god of ligation.\n\n ![](http://web.archive.org/web/20141031100941im_/http:/typophile.com/files/12_fell_100_4454.gif)\n  \nBut then they became infested with Modernism.  \n\n ![](http://web.archive.org/web/20141031100941im_/http:/typophile.com/files/13_porson_3982.gif)\n\nhhp\n\n"
    },
    {
      "time": "14 Feb 2007 — 12:39pm",
      "content": "An interesting comparison would be Garamond's Greek with Granjon's Civilité.\n\n_infested with Modernism_\n\nHowever, the printers (in the 16th C?) who kicked out all the ligatures probably thought dealing with them on a daily basis was too much nit-picking :-)\n\n"
    },
    {
      "time": "21 Apr 2007 — 3:15pm",
      "content": "The guy who started the kicking was actually English.  \nIn fact native Greeks actually had very little general  \ninfluence on the evolution of their script at that time.  \nThis was due largely to the Ottoman Empire.\n\nhhp\n\n"
    },
    {
      "time": "21 Apr 2007 — 5:23pm",
      "content": "The double lamda and double gamma are perhaps the most prevalent of Greek ligatures.\n\nHere is a sample from Arno Pro:\n\n ![](http://web.archive.org/web/20141031100941im_/http:/typophile.com/files/double-lamda_6461.gif)\n\nChrisL\n\n"
    },
    {
      "time": "21 Apr 2007 — 5:33pm",
      "content": "Nick, sorry, somehow I read \"Greek printers\" where you'd simply written \"printers\"! So I would instead say: yes that must have had something to do with it, on the other hand the difficulty of setting ligated Greek was no easier in the age of Granjon, but those guys simply hadn't fallen for the charms of Simplification. Over-simplification, in my book. Difficult things (like making fonts!) are quite often worth the effort. And Complexity is sometimes just the ticket.\n\nhhp\n\n"
    },
    {
      "time": "21 Apr 2007 — 6:44pm",
      "content": "ChrisL: <cite>The double lamda and double gamma are perhaps the most prevalent of Greek ligatures.</cite>\n\nRight. But should they be stowed under \"standard\" ligatures? Probably not. They occur in medial positions only in Greek and can often appear at hyphenation break points. Depending on character design, other commonly doubled consonants that are candidates for ligation include: double mu, double sigma, double pi, double rho, and double nu. However, since none of these doubled consonants are found in initial occurrence in Greek (except, perhaps, in some transliterated \"loan words\" from foreign languages — though even that seems a stretch too far), the same hyphenation caveat would appear to apply. The upshot, then? At best, these all seem candidates for \"discretionary\" ligatures, not \"standard\" alongside fi, ff, ffl, and so on.\n\nRegards,  \nErnie\n\n"
    },
    {
      "time": "21 Apr 2007 — 6:59pm",
      "content": "Opentype allows breaking of ligatures for hyphenation on the fly in Adobe Suite apps.  \nBy the same token, if you are setting Greek, the fi, fl, ffl, ffi ligs are also never used unless you have out of script words in the text.\n\nChrisL\n\n"
    },
    {
      "time": "21 Apr 2007 — 7:15pm",
      "content": "<cite>... hyphenation on the fly in Adobe Suite apps</cite>\n\nReally? Well, good for Adobe and their users. What about QuarkXPress/Passport and other apps? What's the status there?\n\nIn any case, do you feel such Greek ligatures merit inclusion under \"standard\" (liga) or \"discretionary\" (dlig) or perhaps as contextual alternates (calt)? I'd opt for \"discretionary\" unless wiser counsel chimes in (e.g., John Hudson, Adam Twardoch, Gerry Leonidas).\n\nRegards,  \nErnie\n\n"
    },
    {
      "time": "21 Apr 2007 — 7:21pm",
      "content": "My vote would be for standard for the two I mentioned but I think the type designer should make that decision case-by-case.\n\n ![](http://web.archive.org/web/20141031100941im_/http:/typophile.com/files/Gorilla-Suiters_4151.png)\n\nChrisL\n\n"
    }
  ]
}
