{
  "id": "31446",
  "title": "Advice please for a newsletter copy font",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "hello all,  \nWorking by myself I find I'm lacking in the \"bouncing of ideas\" off a workmate, so I would appreciate any advice.\n\nI am redesigning my local County Councils Child Care newsletter aimed both at parents and child care professionals.\n\nI have managed to convince the committiee that Futura would be a good display font for use in the headlines ect, but I am at a quandry as to what to use for the body copy. Setting it all in Futura doesn't sit well, Univers is easy to ready, and Frutiger looks good as well. Their prefered font is Arial. I have convinced them that Helvetica is better so thier prefered font is Heltvetica now.\n\nWhat I would like is suggestions for fttns that have a bent towards art neuveu, due to the councils location in the UK, and are legible at 11-13 point. I will be printed on Arjowiggins Iniut paper at 130 gsm\n\nAny sugestions gratefull recieved  \nCheers  \nMartin  \nPS I have a budget of up to £100 for the font family I need at least a italic, bold and reg version.\n\n",
  "author": "barkeep",
  "time": "14 Feb 2007 — 9:47am",
  "uid": "10517",
  "comments": [
    {
      "time": "14 Feb 2007 — 11:40am",
      "content": "Finding a companion to Futura just recently came up on Typophile [here](http://web.archive.org/web/20131022054103/http:/typophile.com/node/31131). The person was looking for a companion for a Futura logo to be used for short passages of text. The consensus as to what to use for text appeared to be Futura (again), Bodoni (what [Robert Bringhurst](http://web.archive.org/web/20131022054103/http:/typophile.com/wiki/Robert%20Bringhurst) suggests because of the two typefaces similar mechanical feel), a humanist sans like Syntax or Gill, or a slab serif like Beton, Memphis, or Lubalin Graph. You should note that the person looking for help was adamant about using another sans serif; most would suggest using a serif for extended body text.\n\nIn the thread, it came up that Futura came out of the Bauhaus and Art Deco movements, so I question your interest in using an Art Nouveau typeface, especially since Art Nouveau, to my knowledge, is most associated with France, not the UK.\n\nSome suggestions: [Avenir Next](http://web.archive.org/web/20131022054103/http:/www.linotype.com/90672/avenirnext-family.html), [Neutraface](http://web.archive.org/web/20131022054103/http:/www.houseind.com/index.php?page=showfont&id=18), and [Relay](http://web.archive.org/web/20131022054103/http:/fontbureau.com/fonts/Relay) could be good choices for sans-serifs that evoke both the geometric and Art Deco flavors of Futura. I'd, however, recommend a serif for body text, although other than Bodoni, no other one comes immediately to mind. The other thread I mentioned largely came to the conclusion that using sans-serifs for extended texts is not a great idea, so I'd really look into serifs.\n\nI'm not so up on my Art Nouveau typefaces, so I can't make any suggestions there.\n\n"
    },
    {
      "time": "15 Feb 2007 — 1:24am",
      "content": "Hello Cheers for your reply, the reason fo rthe interest in using the art neaveau is that the particluar area that the newsletter is being used in is historitcally associated with this movement, hence the reason for trying to find a suitable a art nouveau influenced font. Its not critical it was just a request by the client.  \nUnfortunalty I have benn told that I must use a sans serif type to comply with the legibility guidlines the organisations has.\n\n"
    },
    {
      "time": "15 Feb 2007 — 6:13pm",
      "content": "Well, I disagree with your organization's legibility guidelines -- I think that using a sans here would hinder it if anything. The only Art Nouveau, readable sans-serif I could find is [Benguiat Gothic](http://web.archive.org/web/20131022054103/http:/www.myfonts.com/fonts/linotype/itc-benguiat-gothic). It's by far the most readable Art Nouveau sans I could find, but I still wouldn't consider it a terrific choice for body text -- the letterforms are ornate enough to distract your readers. If you're committed to Art Nouveau, use this, but if you're not, look for a humanist sans-serif. May I recommend the newly released [Beorcana](http://web.archive.org/web/20131022054103/http:/beorcana.com/specs3.html) by Carl Crossgrove, a fellow Typophile? It's specifically designed to be extremely legible, although I'm not positive if I would want to combine it with Futura. Might the Display sizes of it work for headlines too?\n\n"
    },
    {
      "time": "19 Feb 2007 — 8:22am",
      "content": "Hello Auricfuzz,  \nthanks for the suggestions I'll look into them Beorcana looks iinteresting..  \nOne point, as I stated **we have been** told that we must use a sans serif.  \nOne of the disadvantage we have found form working with local authorities is that those people who are in charge of commissioning do not always have a clue and often don't even want to hear your suggestions. It can be very frustrating as I too would have preferred to use a serif for this particular brief.\n\n"
    }
  ]
}
