{
  "id": "31468",
  "title": "Grouping of character widths",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hello Typophile  \nI search on Typophile didn’t give me anything on this problem:\n\nI’m currently designing a sans serif and during conversation with a fellow typedesigner he posed the question if I should group the characters by likeness and then harmonize the width of those characters by group, in order to achieve a better or more harmonious rhythm? Something rang a bell, and in Walter Tracy’s ‘Letters of Credit’ p.72 I did find a system that does exactly that, but only for adjusting the sidebearings, not the total character width, nor the width of the character sans sidebearings.\n\nThen I took a look within Univers and Frutiger to see if there was a system, and indeed there was. There was a clear set of different groups of character widths (incl. sidebearings). Univers’ a e v x y all had a width of 556 units, while b d h n o p q u had a width of 611, and so on. Same deal with Frutiger. Other faces has the same pattern visible to a lesser or greater extent.\n\nAnother thing is of course how such a width adjustment would change the shape of the individual character.\n\nMy question is whether fewer groups with more characters grouped together and adjusted to the same total character width are better than more groups with fewer characters? My intuition tells me that there probably is a sweet spot somewhere in between the extremes, but where, and are there some pointer on where to go other than trail and error?\n\nClaus Eggers Sørensen\n\nPS: I hope I’m making sense here, as it is getting rather late.\n\n [‹ Southern/Country typefaces](http://web.archive.org/web/20081008042010/http:/www.typophile.com/node/32237 \"Go to previous forum topic\") [Font Title Meaning? ›](http://web.archive.org/web/20081008042010/http:/www.typophile.com/node/32233 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081008042010/http://www.typophile.com/user/16321\" title=\"View user profile.\">clauses</a>",
  "time": "<br>",
  "uid": "16321",
  "comments": [
    {
      "time": " 15.Feb.2007 7.51am",
      "content": "I think it would be helpful someone could point me to some sans serif faces that have great rhythm. Which typefaces would that be?\n\n"
    },
    {
      "time": " 12.Mar.2007 9.28am",
      "content": "I am not sure what the reasons were for Univers & Frutiger having standardized sidebearings. There are potentially many reasons. One reason is that making a type design rationalized saves time. Another reason might be that doing that would accord with the deisgn spirit of the time in which they were designed. Also, design for linotype machines was far stricter than digital design is and it may have been an approach that was habitual. A type historian can nail this down better than I can.\n\nBut you asked ’I should group the characters by likeness and then harmonize the width of those characters by group, in order to achieve a better or more harmonious rhythm?’ And the answer can only be ’maybe’. Because in depends on intent. Ceratinly that is not the only way to do it. But it is one way. There are so many variables in type that nailing down a few of them so you don’t go crazy does have an appeal. ;-) But the final aribiter is your own eye.\n\n<cite> Another thing is of course how such a width adjustment would change the shape of the individual character.</cite>\n\nYour right, everything impacts everything else. It might be that you find designing in a Fruigter mode is too constraining. Cetainly there are ways of making a pleasing face in terms of optical balance without doing that.\n\nWhat I think you will not find is that there is a single sweet spot. The reasons that standards are there have more to do with expediency and philosophy and specific purpose, and aesthetic intent than because there is a single ideal. Less still that a single technique can be ideal in all cases.\n\nOpen more faces and analyze them. What do you find?\n\nWhat might be interesting too is to look at different kinds of blackletter. Look at examples of Bastarde. Look at Textur, Schwabacher etc. Look at how they vary in terms of their regularity. Textur is really regular for instance - that was the visual ideal the scribes had in mind. How ideal do you think it is? I mention blackletter in part because I have been looking at them alot recently & in part because it’s relative unfamiliarity ( at least to me ) makes it a great vehicle for recognizing & comparing differing approaches to letter/word making.\n\nIn terms of the face you are working on, have you posted it here for review?\n\n"
    },
    {
      "time": " 13.Mar.2007 11.07am",
      "content": "The groups are not necessary. The identical widths could be an artifact of a previous type manufacturing technology that required a “unit system”. Those unit systems typically forced designers to distort their designs. It wasn’t preferred, it was a manufacturing constraint. Keeping sidebearings of similar features makes sense, and keeping similar letters at similar widths is good (n and u, d and q), but that is a visual thing, and not reqired. Excessive regularity and identical character shapes don’t bring anything of great value to a typeface unless it is a very modular display design. If it’s something like Impact, where the counters should be twice the sidebearings, in order to achieve even regimented spacing, then that’s visually evident. The overarching proportional relationships between all the letters is a more important issue for most typefaces.\n\n"
    },
    {
      "time": " 13.Mar.2007 12.23pm",
      "content": "You have already read Tracy’s view of spacing, which seems to be the most generally accepted. According to him the side bearings of the control characters H and n should be slightly less than the width of the counters, and the other letters matched to these.\n\nFrutiger [says here](http://web.archive.org/web/20081008042010/http:/www.linotype.com/793-12659/walterkaechs.html) that in a seriffed face, the width between the counters and the total of the side bearings should be equal in a seriffed face—wider than what Tracy recommends. I haven’t read Frutiger’s books, but he may state there his theory about sans faces—I’m sure he has such a theory, given how deliberate he is about his designs.\n\nOther theories about spacing have been put forward by David Kindersley. His starting point was different, as his basis was the blacks of the letter, not the whites.\n\nHermann Zapf developed an automatic spacing system based roughly on the same approach of Tracy—looking at counters of control letters. He also took into account nearest proximity in letters like r, etc. The program he and others developed was bought by Adobe and became the basis of its ’optical spacing’.\n\nThere is also an Italian engineer who has developed an automatic system called [IKern](http://web.archive.org/web/20081008042010/http:/www.iginomarini.com/ikern.html). I don’t know how that works.\n\nIn spite of a lot being known about spacing, I think there is still a lot that is mysterious, and just has to be done by trial and error, with your eye and other faces you admire as guides.\n\n"
    },
    {
      "time": " 13.Mar.2007 12.32pm",
      "content": "It is the eye that reads it, it is the eye that should judge the spacing. Don’t go overboard with exacting schemes. You have to optically compensate for so much anyway, there is not much value in it.\n\nChrisL\n\n"
    },
    {
      "time": " 13.Mar.2007 12.38pm",
      "content": "I should add that in designing a face you don’t have the characters in a finished form first, and then space afterwards. There is, as Tracy notes, an interactive process where you adapt the characters so that they will space well. So you are looking at rhythm, evenness of color, the relationship between blacks and whites, and so on. And you adjust both the character and spacing to make these work, within your brief and design ideas.\n\nSo although the guidelines are very helpful, it ends up like everything else in type design, as Carl and Chris say, with the eye as final arbiter.\n\n"
    },
    {
      "time": " 14.Mar.2007 1.33am",
      "content": "Thank you for the tips everybody. Eben: What I’m working on has a thread here: [http://typophile.com/node/31969](http://web.archive.org/web/20081008042010/http:/typophile.com/node/31969 \"http://typophile.com/node/31969\")  \nCurrently I’m doing the heavier weights. The step after that is condensed and expanded cuts.\n\n"
    },
    {
      "time": " 14.Mar.2007 9.30am",
      "content": "It was good to see what everybody had to say. Claus, I will check it out!\n\n"
    }
  ]
}
