{
  "id": "31484",
  "title": "Hey! Look what Danno has gone and done!",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Check this out at:\n\n[http://www.typeoff.de/?p=135](http://web.archive.org/web/20131015145746/http:/www.typeoff.de/?p=135 \"http://www.typeoff.de/?p=135\")\n\n\"Morris Sans released\n\nMorris Sans, two of the weights  \nDesigned by Dan Reynolds for Linotype GmbH.\n\nFrom the Linotype website: Morris Sans™ is a newly revised and extended version of a small geometric family of typefaces originally produced by Morris Fuller Benton in 1930 for ATF. His initial design consisted of an alphabet of squared capital letters with a unique twist that characterized its appearance: corners with rounded exteriors and right-angle interiors. The types were intended for use in the fine print found on business cards, banking or financial forms, and contracts. But over the ensuing decades, this design became a popular element in all sorts of design environments, and several foundries revived the typeface in digital form. Since digital fonts are bicameral, with slots for both upper and lowercase letters, new cuts of the type opted filled the lowercase slots with small caps.\"\n\n ![](http://web.archive.org/web/20131015145746im_/http:/typophile.com/files/Danno-Morris_6317.png)\n\n",
  "author": "dezcom",
  "time": "15 Feb 2007 — 8:26am",
  "uid": "3135",
  "comments": [
    {
      "time": "15 Feb 2007 — 8:30am",
      "content": "Also [here](http://web.archive.org/web/20131015145746/http:/www.linotype.com/184368/morrissans-family.html) and [here](http://web.archive.org/web/20131015145746/http:/www.flickr.com/photos/typeoff/sets/72157594537424932/).\n\n"
    },
    {
      "time": "15 Feb 2007 — 8:50am",
      "content": "Very nice, Dan: I particularly like the sample at the bottom of the page Chris pointed to. ;-)\n\n"
    },
    {
      "time": "15 Feb 2007 — 9:25am",
      "content": "Thanks, Linda! It is from the Typophile Wiki: [Pangram](http://web.archive.org/web/20131015145746/http:/typophile.com/wiki/Pangram)\n\n"
    },
    {
      "time": "15 Feb 2007 — 9:37am",
      "content": ":-) Had a good friend in Ottawa whose idea of \"fun at the bar on a Friday night\" was to take the tiles from Scrabble and challenge people to construct pangrams. Of course, after, um, several fermented beverages, the \"creations\" were quite, ah, interesting and frequently obscene.\n\n(And no, I don't remember any of them!)\n\n"
    },
    {
      "time": "15 Feb 2007 — 10:33am",
      "content": "Can you believe I found out about this via Flickr?  \nThis boxer is definitely losing it.\n\nDan, I think you've done it right - the lc is brilliant.  \nIt would've been great to have had this <cite>years</cite> ago!\n\nhhp\n\n"
    },
    {
      "time": "15 Feb 2007 — 1:15pm",
      "content": "\\>It would’ve been great to have had this _years_ ago!\n\nWell, better late than never! Let's see if anybody uses it :-\\\n\n"
    },
    {
      "time": "15 Feb 2007 — 4:50pm",
      "content": "Interesting that they don't mention the original name, Bank Gothic.\n\nA long time ago I flirted with the idea of doing an MM version of Bank Gothic - I think I still have my tests. I had considered adding a lower case, but I didn't do any actual experiments there. I think that what I had in my head was very different from what Dan has done, so it's very interesting to see his treatment.\n\nCongratulations, Dan!\n\nT\n\n"
    },
    {
      "time": "15 Feb 2007 — 5:01pm",
      "content": "\"Well, better late than never! Let’s see if anybody uses it :-\\\"\n\nI'll use it Dan!\n\nChrisL\n\n"
    },
    {
      "time": "15 Feb 2007 — 5:05pm",
      "content": "<cite>A long time ago I flirted with the idea of doing an MM version of Bank Gothic - I think I still have my tests. I had considered adding a lower case, but I didn’t do any actual experiments there.</cite>\n\nI always wanted to see an MM design that had a \"case\" axis.\n\n"
    },
    {
      "time": "16 Feb 2007 — 8:56am",
      "content": "BTW, I think I can guess, but what's the rationale  \nfor making the caps visibly darker than the lc?\n\nhhp\n\n"
    },
    {
      "time": "20 Feb 2007 — 7:03am",
      "content": "Hrant: you mentioned this question about the weight in another post today, and I just typed in an answere there. Here is a link to it on that thread (the one about x-heights) — [http://typophile.com/node/31427#comment-186105](http://web.archive.org/web/20131015145746/http:/typophile.com/node/31427#comment-186105 \"http://typophile.com/node/31427#comment-186105\")\n\n"
    },
    {
      "time": "20 Feb 2007 — 7:05am",
      "content": "Thomas: I made a MM font in FontLab after the design process had ended, mostly because my ideal version of this typeface's design would have a weigt between the light and the regular, and a width between the regular (which is quite extended) and the condensed!\n\nHow would you have drawn the lowercase? Questions, questions!\n\n"
    },
    {
      "time": "20 Feb 2007 — 7:08am",
      "content": "Spire: I've been tinkering with a [Unicase](http://web.archive.org/web/20131015145746/http:/typophile.com/wiki/Unicase) version of some of the fonts. In their case, you could sort of have a case axis, because the upper and lowercase forms are more similar. This isn't what you had in mind, I guess, since it eliminates any wierdly-morphed middle stages.\n\n"
    },
    {
      "time": "20 Feb 2007 — 9:11am",
      "content": "Unicase is generally a waste of valuable time.\n\nhhp\n\n"
    },
    {
      "time": "20 Feb 2007 — 9:31am",
      "content": "…but it can be so fun fun as a display diversion.\n\nOf course it isn't serious. If it were serious, it would have been built into the fonts as a stylistic alternate already. But everybody day-dreams and tinkers now and again.\n\n"
    },
    {
      "time": "20 Feb 2007 — 9:34am",
      "content": "Dan, in that other thread you say that the caps look \"right\" when they're darker. Concerning this, I have a theory that larger things look aesthetically more appealing when darker. Or lighter, depending on your taste\\*... The point is they look boring at the \"normal\" weight, if you know what I mean.\n\n\\* Which seems to be the case more often if you're a baby-boomer.\n\nIn the case of Morris Sans I was actually suspecting that the original weight in Bank Gothic determined the weight in the new fonts (but the lc would look too dark if it matched that weight). And maybe it's this familiarity with the original that makes the darker weight look \"right\".\n\nhhp\n\n"
    },
    {
      "time": "20 Feb 2007 — 9:36am",
      "content": "Unicase might be fun for the artist in you, but not fun for the users who are missing out on something more useful you could make instead. There's yippeeee fun, then there's serious fun. But if yippeeee fun helps a type designer stay sane, then that's certainly useful. Yippeeee for its own sake however is not something the world needs more of right now, I feel.\n\nhhp\n\n"
    },
    {
      "time": "20 Feb 2007 — 9:38am",
      "content": "\"Unicase is generally a waste of valuable time...\" when designing text typefaces.\n\n;^)\n\nI think in some designs unicase is a nice addition for those who might use it in display settings.\n\n"
    },
    {
      "time": "20 Feb 2007 — 9:53am",
      "content": "\\> In the case of Morris Sans I was actually suspecting that the original weight in Bank  \n\\> Gothic determined the weight in the new fonts (but the lc would look too dark if it  \n\\> matched that weight). And maybe it’s this familiarity with the original that makes  \n\\> the darker weight look “right”.\n\nYes. Linotype had old Ikarus data for the caps of the medium weight, normal width font. I cleaned this up and used it. The rest of the letters that I drew for the Medium were designed to optically match these, so of course they are lighter than the caps themselves.\n\nThe other five fonts in the family were designed this one. So, the Medium cap glyphs are more or less \"historic,\" and everything else is bult to harmonize around them. So I guess we agree! The caps had to maintain their weight. If the non-cap glyphs were any darker, they'd be too happy.\n\nIn an ideal face, designed for legibility, one would start with the lowercase letters, and then draw the capital letters.\n\n"
    },
    {
      "time": "20 Feb 2007 — 9:58am",
      "content": "Tiffany:  \n\\> I think in some designs unicase is a nice addition for those who might  \n\\> use it in display settings.\n\nHowever, there are not that many suitable unicase fonts for them to choose from.\n\nHrant:  \n\\>Yippeeee for its own sake however is not something the world needs more of right now\n\nThis is also a point of view I can understand. But people tend to think that they have enough time to complete everything they want to accomplish, no?\n\n"
    },
    {
      "time": "20 Feb 2007 — 10:00am",
      "content": "\\> If the non-cap glyphs were any darker, they’d be too happy.\n\n:-\\>\n\n\\> people tend to think that they have enough time to  \n\\> complete everything they want to accomplish, no?\n\nAre you being serious dude?\n\nhhp\n\n"
    },
    {
      "time": "20 Feb 2007 — 10:54am",
      "content": "Dan, for once I'm going to agree with Hrant: I never have enough time to complete everything I want to accomplish. :-(\n\n"
    },
    {
      "time": "20 Feb 2007 — 11:25am",
      "content": "But sometimes, you delay your real work with a diversion don't you? We call this rationalized procrastination. :-)\n\nChrisL\n\n"
    },
    {
      "time": "20 Feb 2007 — 11:26am",
      "content": "\"All work and no play makes Jack a dull boy\"\n\nChrisL\n\n"
    },
    {
      "time": "20 Feb 2007 — 11:30am",
      "content": "_But sometimes, you delay your real work with a diversion don’t you? We call this rationalized procrastination. :-)_\n\nWho, me? ;-)\n\n(she said, waiting for better light before proceeding on a rush job....)\n\n"
    },
    {
      "time": "20 Feb 2007 — 11:34am",
      "content": "\"If you always do something that interests you, at least one person will be pleased.\"\n\n--Katharine Hepburn\n\nNot that being a hard head is a good idea, but she had a point.\n\n"
    },
    {
      "time": "20 Feb 2007 — 12:07pm",
      "content": "\\>\\> If the non-cap glyphs were any darker, they’d be too happy.  \n\\> :-\\>\n\nI meant heavy, of course. Me and my typos :( But this is just as good, actually.\n\n\\>\\> people tend to think that they have enough time to  \n\\>\\> complete everything they want to accomplish, no?  \n\\>Are you being serious dude?\n\nI am being serious in writing that people often \\*think\\* they will accomplish everything they have in their plans. Of course, they never will. But no one wants to admit this to themselves, I think.\n\n"
    },
    {
      "time": "20 Feb 2007 — 12:23pm",
      "content": "I would say that realizing and admitting one's limitations (which are  \nessentially those of being a human being) is part of becoming an adult.\n\nhhp\n\n"
    },
    {
      "time": "20 Feb 2007 — 12:25pm",
      "content": "\"...that people often \\*think\\* they will accomplish everything they have in their plans. Of course, they never will. But no one wants to admit this to themselves, I think.\"\n\nGuilty as charged your honor!  \nI am sure I will complete 250 super families of type and 500 display fonts before I die even though I have yet to complete one--given that I probably will only live 10 more years to boot :-)\n\nChrisL\n\n"
    },
    {
      "time": "20 Feb 2007 — 1:47pm",
      "content": "As Dirty Harry Callahan was wont to say:\n\n_A man's got to know his limitations._\n\n"
    }
  ]
}
