{
  "id": "31486",
  "title": "political/cultural aesthetics of type",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm interested in any input on this topic. I'm thinking there are two kinds of relationships between political/cultural matters and the formal features of a typeface:\n\nRelationship 1: the formal features emerge directly as a result of political or cultural shifts. I.e., somebody says, \"Strip all the ornament, for such matter reflects bourgeois culture.\" And the typefaces that are designed in response to this call are thus stripped of ornament. Seems to be most common to post- WWI modernism and after. But I know there's more to the story-- going all the way back to Carolingian minuscule you see something like political and cultural imperatives pushing into the world of script design (any \"state\" mandate to standardize a script would seem to apply here, but also any other kind of cultural call for some new or different formal features).\n\nRelationship 2: People attribute political or cultural perspectives to the type design after or outside the material context in which the design originated. I.e., somebody says, \"Let's use this blackletter for our heavy metal band's name, because it looks dark and pointy and scary.\" These attributions can be made pretty much at random by anyone, with or without connection to historical contexts (see Eva Brumberger's research on \"typeface personality\"-- neat stuff, but it's all about psychological impressions in the here-and-now).\n\nAny thoughts? Interesting cases? The nationalism/blackletter thing is one obvious example. And I believe Hrant has written some very thoughtful stuff about the problems of Latinization, which is great example of how political/cultural forces have shaped the actual formal features of a script/typeface.\n\nThanks!\n\n- Jay\n\n",
  "author": "jlg4104",
  "time": "15 Feb 2007 — 9:20am",
  "uid": "11098",
  "comments": [
    {
      "time": "15 Feb 2007 — 9:34am",
      "content": "Early Greek letterforms were simple sans serif with little or no decorative features. Later, letters were adorned and formed more to some asthetic bent or another. The balance swings both ways and is rarely just a political thing. People in the arts and crafts have a history of being a bit eccentric and not big rote-step followers of political establishments. It is as much the case that letterform designers just did stuff then the politicians pronounced it theirs rather than the other way around.\n\nChrisL\n\n"
    },
    {
      "time": "15 Feb 2007 — 9:51am",
      "content": "[http://typophile.com/node/8856](http://web.archive.org/web/20131014113707/http:/typophile.com/node/8856 \"http://typophile.com/node/8856\")\n\n"
    },
    {
      "time": "15 Feb 2007 — 10:07am",
      "content": "Interesting stuff. Thanks. I should mention I'm open to any suggestions, ideas, references, etc. I don't presume there's always a direct causal connection between Political Idea X and Formal Feature Y, but I am interested in the connections when they do exist (and that's a point well-taken, dezcom, that designers are also individuals who create things-- it's not all about a visual design being produced by social or political forces, as there has to be an individual artist in the equation somewhere, even if you're talking about the one who programs the AI system that generates \"new\" typefaces).\n\n"
    },
    {
      "time": "15 Feb 2007 — 2:02pm",
      "content": "Well, one of the aspects you could look at is the decline of the Fraktur face and the accompany Kurrentschriften in light of politics from WWII. It's a shame too, I rather like both of them but now hardly anyone can read either.\n\nYou can also see some of it within the American university system's greek system (and even outside) where they will attempt to designate a sigma as an E, simply to draw connexion to their organisation, which in turn can cause repudiation for independent students when they see Greek letters being used for anything else other than actually written Greek.\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos.» (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "15 Feb 2007 — 3:05pm",
      "content": "Is 'Kurrentschriften' a kind of handwriting or cursive? I don't read German, but I found it on the .de version of Wikipedia and tried to guess... Is there an adequate English translation? Just curious. Thanks!\n\n"
    },
    {
      "time": "15 Feb 2007 — 4:09pm",
      "content": "Kurrentschriften = scrolling texts\n\nThe origin-- Latin: Currere (cure-rare-aye), run, run the course etc etc\n\n"
    },
    {
      "time": "15 Feb 2007 — 5:29pm",
      "content": "So it's equivalent to Cursive writing: that script for scrawling profanities?\n\n"
    },
    {
      "time": "15 Feb 2007 — 8:27pm",
      "content": "Yeah, it's a type of cursive, it's very connected, it looks beautiful but just like cursive when you're still getting used to it, very hard to read. The primary feature of interest in it for modern day folks is that its e, like in Fraktur, was basically two lines, like //. That's why even today some people (_generally_ older IME, YMMV) will still write the umlauts as if they were double acutes. With the younger crowd it might be either a hold over from seeing parents write, or simply a stylistic difference (like Spanish-speakers using a macron instead of a tilde for ñ).\n\n_«El futuro es una línea tan fina que apenas nos damos cuenta de pintarla nosotros mismos.» (La Luz Oscura, por Javier Guerrero)_\n\n"
    },
    {
      "time": "16 Feb 2007 — 4:23am",
      "content": "Interesting that when you get to the nuts and bolts of specific cultural practices, you have to count handwriting practices, not just printing and type. My grandfather, for example, took some mechanical drawing classes in his youth, and his handwriting always retained what they taught-- quick, straight strokes, a boxy kind of highly readable \"font,\" etc. And speaking of cursive, I don't even know if they teach that in the U.S. any more. I learned it in 4th grade, I think. I never use it-- I print, but maybe with some messy connectors here and there that are vestiges of the cursive.\n\n"
    },
    {
      "time": "16 Feb 2007 — 9:13pm",
      "content": "The Middle East/Islamic world offers some illuminating examples of the association between religion and script (and then in modernity, religion and type).\n\nA primary tenet of Islam is that the Koran is the word of God, written in the language of God. As a consequence, the Arabic language and script became valued in ways that are specific to the religion of Islam and its civilization. Note that the Arabic script spread along with Islam from the central Middle East beyond the limits of the spread of the Arabic language itself. Thus Persian and Urdu, among other languages of Muslim countries, are written in Arabic script. The association of religion with script was so clearly identified in the Middle Ages that Jews, writing in Arabic, used the Hebrew alphabet. Through this, we see Jews identified fully as Arabic speakers/writers, but who preserve the marker of the religious association of identity and script (called Judeo-Arabic).\n\nAnother example is interesting. In 1928 Turkey, Atatürk initiated a massive language reform initiative that required the adoption of Latin script to the exclusion of the Arabic script. Arabic script had been used to write Turkish for a millennium, but in the context of language reform it was criticized for its complexity and unsuitability for the Turkish language. From the perspective of Turkish nationalism, Arabic script was also perceived to be \"foreign,\" and therefore inappropriate. And, from the perspective of the secular nation-state, Arabic script was associated with Islam and the failures of the Ottoman Empire.\n\nIn Central Asia, Turkic languages began to be written in the Latin alphabet in the late 1920s, but by 1940 Russian hegemony moved these societies to the adoption of the Cyrillic alphabet. Flash forward to the fall of the Soviet Union and we witness competition between the three scripts/type that could be used for writing Turkic languages. Sometimes called the \"war of the typewriters,\" this cultural struggle was played out in part through the competing efforts of Russia, Turkey, and Islamic countries (esp. Saudi Arabia), each trying to get the newly-independent states to adopt a script/type which represented the larger cultural world to which they would be attached. The question was whether these countries would be aligned with the old imperial power of Russia, the larger transnational world of Turkish identity, or to the even larger world of Islamic civilization.\n\nThe association of Arabic script to religion is not necessary by virtue of the script's form, but is a religious/ideological construct that remains a significant cultural artifact to this day.\n\n"
    },
    {
      "time": "16 Feb 2007 — 10:35pm",
      "content": "That's interesting Fred, but the association of aesthetics with an alphabetic script is a different matter than with type, where it's generally understood to be design style-- something that is created by individuals, whereas alphabets are more of a social contract.\n\nHowever, there have been quite a few alphabet (re)designers who created \"conscripts\" (constructed scripts).  \n [http://en.wikipedia.org/wiki/Artificial\\_script](http://web.archive.org/web/20131014113707/http:/en.wikipedia.org/wiki/Artificial_script \"http://en.wikipedia.org/wiki/Artificial\\_script\")\n\nPeter the Great (Cyrillic, early 18th century)  \nIsaac Pitman (Shorthand, 1840s)  \nJan Tschicold, Herbert Bayer (Unicase, early 20th C)  \nHenry Eveleigh (calligraphic-phonetic, 1950)  \nJames Pitman (Initial teaching Alphabet, 1960)  \nKingsley Read (Shaw alphabet, 1960)  \nAnthony I. Rozak (Phonetic alphabet, 1970)  \nPhillip Stamm (Phonograms, 1997)\n\nAnd many, many others.  \nMost of these were not primarily aesthetically driven, but were designs attempting to improve the basic functionality of the phonetic coding of speech into script. For pedagogic reasons, or to help those with reading difficulty. Shorthand has a particular focus of functionality, which is transcribing speech in real time -- to do more with writing than reading.\n\nHowever, there is always a political/cultural/social/aesthetic dimension to any design, and it is ironically perhaps more tangible in conscripts than in type design where, as Jay notes in his second point, the broader cultural connections are by association, which can be quite arbitrary.\n\nGraphology is an aspect of writing which is not given much credence as a science, but I suspect it has some connection with the sociology of type forms. As social understanding, it has been most developed by graphic designers and art directors, working with targeted demographics, in an intuitive way. Typography!\n\n"
    },
    {
      "time": "16 Feb 2007 — 10:41pm",
      "content": "I hope I am not going too far off topic to add the example of the latinization campaign in the Soviet Union described in Terry Martin's excellent _The Affirmative Action Empire: Nations and Nationalism in the Soviet Union, 1923-1939_ (Cornell UP, 2001). Soviet language planning in the 1920s and 1930s is a fascinating topic. Driven by the internationalist rhetoric of Communism, to overcome the non-Russians' mistrust of rule from Moscow, and other such complex reasons, Soviet authorities promoted national culture and opposed assimilation in this period.\n\nAmong the symbolic markers of identity was the national alphabet. The latinization campaign \"involved either changing the alphabet of a language from a script such as Arabic or Cyrillic to the Latin script or creating a new written language using the Latin script for previously exclusively oral languages\" (185). Part of the reason was that \"the Cyrillic alphabet was strongly associated with Orthodox missionary activity and Russian colonialsm\". The Yakut in 1920 and the Ossetines in 1923 abandoned their Cyrillic scripts for Latin spontaneously for this reason, before any central policy was implemented.\n\nFor the Islamic peoples who had traditionally used the Arabic script, the strong identification of that script to Islam and the conservative elites as well as the already-mentioned reasons for rejecting Cyrillic led to the choice of the more neutral Latin. A pan-Turkic campaign led by Azerbaijanis brought about the Latin-based Turkic alphabet, which celebrated a major triumph outside the Soviet Union in 1928 when the Turkish Republic adopted the Latin script.\n\nThe latinization campaign expanded throughout the Soviet Union, its anti-Russian character became more transparent, and even the latinization of Russian itself was discussed: after all, \"only the latinists were true internationalists\". (Of particular interest to me is the campaign for the latinization of Korean. Plans for a Latin Korean alphabet \"were approved but apparently not actualized\" (200).)\n\nBy 1932, 66 languages had been latinized and seven more languages were in the process of being latinized. However, the ideological atmosphere had shifted by 1933, with the political crises in Ukraine and Belorussia where local nationalists were charged with treasonous irredentism. The question was now about reversing latinization; this shift in the entire Soviet national policy would culminate in the deportations of 1935-1938, when \"at least nine Soviet nationalities--Poles, Germans, Finns, Estonians, Latvians, Koreans, Chinese, Kurds, Iranians--were all subjected to ethnic cleansing\" (311).\n\nReading about the \"war of the typewriters\" is fascinating in that historical context.\n\n"
    },
    {
      "time": "17 Feb 2007 — 12:49am",
      "content": "Nick, Most interesting!\n\nOne could argue that the Turkish adoption of the Latin alphabet was a conscript project, in that basic Latin letters were altered with diacritical marks. Although such diacritics are fundamental features of such languages as French and German, the Turkish adoption was in fact an adaptation which was explicitly rationalized as an effort \"to improve the basic functionality of the phonetic coding of speech into script.\" The Turkish conscript argument was that the reforms would permit the language to be read more easily, and hence learned more easily, and that the new script would be amenable to modern printing.\n\nAs a footnote, I should acknowledge the fact that there was an Ottoman Turkish (that is, in Arabic script) printing tradition which began in the early eighteenth century.\n\nI am trying to speak to Jay's second point, above. My point of departure is his reference to Carolingian miniscule.\n\nAnd thanks to Brian for expanding on Soviet attitudes toward national identity and scripts.\n\n"
    },
    {
      "time": "17 Feb 2007 — 6:11am",
      "content": "Wealth of knowledge by all! This is becoming quite a thread!\n\nChrisL\n\n"
    },
    {
      "time": "17 Feb 2007 — 3:36pm",
      "content": "Jay, FWIW, I tend to argue that blackletter is now being rehabilitated\\* by way of fashionable subcultures that mimic other earlier subcultural adoptions of blackletter for its shock value/association with WW2-era Germany. I believe that blackletter was pretty much 'typographically unspeakable' in western Europe until it had been culturally transformed by association with youth music cultures in the 70s and 80s (hence your ref. to the heavy metal bands, although now you can have thrash/speed/death metal as well!).\n\n\\*or should that be recycled?\n\nI see you're a college professor, so I perceive your question as running straight back into a conversation about design education at large.\n\nWhat gets left out of a wider picture of the cultural/political aesthetics of type and lettering systems – as other writers here are already pointing out – is clearly a major consideration.\n\nI recently read of a case in which a country in the Persian Gulf went to a well known American University and bought a graphic design degree programme 'off the shelf' – buildings, faculty, administration, syllabus, curricula – the whole lot. Only after the programme had completed an academic audit after three (or maybe five?) years of operation, did it become apparent that there was _no provision_ on the course to teach, or even recognise, the importance of Arabic calligraphy within the context of this 'degree' programme.\n\nWhile I'm fascinated to hear of the earlier Latinization of vast parts of the globe by both Attaturk and Stalin, I feel it's necessary to be aware of how this process continues by other means. Cultural imperialism at this level means that entire generations, not just individual typefaces, get divorced from the cultural traditions of which they should be the rightful inheritants.\n\nI now live and work on the far side of the Pacific, and these are interesting times; a number of Chinese universities are already set to repeat similar mistakes as the one above, while conversely, a number of Pacific Island languages are being committed to written/typographic systems for the the first time ever – but I'm not aware of many P.I type designers, so who is making the decisions about what these 'new' languages look like on the page?\n\n"
    },
    {
      "time": "17 Feb 2007 — 8:31pm",
      "content": "Not quite cultural imperialism, but closer to home: design chauvinism towards advertising typography.\n\nUpdike \"Printing Types\": no sans serifs -- too \"trade\"  \nWarren Chappell \"Short History\": no advertisements shown  \nRobin Kinross \"Modern Typography\": 25 visual examples, none are magazines or advertisements.  \nBlackwell \"20th Century Type\": concentrates on the avante garde, ignoring the \"living tradition\".  \nMeggs \"History\": a couple of pages on \"the new advertising\", but nothing on the old.\n\nThe standard notion of what constitutes our typographic culture is derived from collections of art posters, design awards annuals, and specimen books. Institutions do not collect or study the low art of their own culture.\n\nIn the cultural picture, advertising typography is caught between the rock of \"proper\" book typography with its centuries of tradition, and the hard place of the modernist narrative that centres on the Bauhaus. Advertising is further dissed by the marxist tack of academia, where aesthetics is all about sexism and consumerism. No wonder the idea of advertising art and typography as a subject of aesthetic discourse sounds improbable.\n\nIt has taken feminist historians to write an alternate narrative -- such as Bogart in \"Advertising, Art Direction, and the Borders of Art\", and Thomson in \"The Origins of Graphic Design in America\", treating the aesthetics of advertising art as worthy of serious cultural study.\n\nThere does exist a popular design interest in advertising history, but it has gotten channelled into kitsch and nostalgia.\n\n\\*\\*\\*\n\nOn the subject of cultural lacunae, mention must be made of Nicholson Baker, the anti-microfiche campaigner. Now this fellow is a novelist and writer, but he has recently rescued the single remaining whole archive of The World newspaper (published by Joseph Pulitzer from the 1890s), which would otherwise have been broken up. And he has published reproductions of its pages in a book \"The World on Sunday\", which are absolutely astonishing, literally, seeing these pages is like discovering a world you never knew existed. The irony is that The World had a circulation of over half a million, and yet it is less represented in libraries than the short runs which Aldus printed.\n\n\\*\\*\\*\n\nSo this is the politics of type: what a sizeable percentage of typographers do for a living is ignored by their culture, and it has been written out of the history which design students are taught at college.\n\n"
    },
    {
      "time": "18 Feb 2007 — 12:56am",
      "content": "Design chauvinism is a handy term that could also be applied to a theme that I am currently doing my best to rework. A very long time ago I wrote about what I named, half-seriously, ‘English vernacular’, a tradition of signwriting and incised lettering that was in current use in the 18th and 19th centuries. but was almost annhilated by the highminded authorities who discovered from Edward Johnston that the use of the broad pen was the exclusive basis of all good letters and that copperplate script was the work of Mammon if not the Devil himself. Among types Scotch Roman and M. F. Benton’s Century Schoolbook preserved something of the qualities of the tradition. Here is an example of signwriting of about 1880 (I guess) to remind us of what we lost in the name of good taste: letters that (in this case) are vulgar, clumsy – and generous and full of life. The image was made in the 1960s in a country pub in Suffolk, by Desmond Jeffery – a friend, and a superb typographer and printer.\n\n ![](http://web.archive.org/web/20131014113707im_/http:/typophile.com/files/Sign%20-%20Meet%20friendly_4806...%20aaa%20bw%20-%20600.jpg)\n\n"
    },
    {
      "time": "18 Feb 2007 — 1:20am",
      "content": "I'm sorry – that image must have been too vulgar to load. This one is older (1870s) and more mainstream. A sign on a 16th century building that had become a pub. The front of the building was saved and placed in the Victoria & Albert Museum. Of course the sign was destroyed.\n\n ![](http://web.archive.org/web/20131014113707im_/http:/typophile.com/files/Sign%20-%20Sir%20Paul%20Pindar%206%20a%20-%20600_5030.jpg)\n\n"
    },
    {
      "time": "18 Feb 2007 — 7:01am",
      "content": "Nick and James, I'm really looking forward to your books on this subject :)\n\n"
    },
    {
      "time": "18 Feb 2007 — 10:00am",
      "content": "The Cherokee syllabary makes an interesting case also. Apart from the politics of whether to use romanization or the syllabary (on which I've heard opposing opinions from the two Tsalagi speakers I've discussed it with), the formal qualities of the glyphs in the syllabary are also an issue. As a product of the 1820s, it was created in a context where modern faces, mainly scotch, were the norm. Serifs are functionally necessary in it, and if a typeface doesn't have a vertical axis with very strong contrast, it is apparently perceived as \"not Cherokee enough\" in appearance.\n\n"
    },
    {
      "time": "18 Feb 2007 — 4:11pm",
      "content": "<cite> Nick and James, I’m really looking forward to your books on this subject :) </cite>\n\nMe too. Or even an article or typecon presentation. This means that I have suggested 2 topics to Nick by now for typecon. Which may be annoying. If so, my apologies.\n\n"
    },
    {
      "time": "18 Feb 2007 — 7:20pm",
      "content": "I spoke on the topic, as \"The Triumph of Historicism: The Typography of American Mass Market Magazines 1889-1930\" at TypeCon and ATypI in 2001, and have written a few articles about it. A book is in the works, which is a a good excuse for acquiring research material.\n\n"
    },
    {
      "time": "20 Feb 2007 — 8:44am",
      "content": "_the highminded authorities who discovered from Edward Johnston that the use of the broad pen was the exclusive basis of all good letters and that copperplate script was the work of Mammon if not the Devil himself._\n\nI have always thought Johnston's calligraphy was over-rated. I refer to his \"Book of Sample Scripts\", which I have in facsimile. It is considered his \"outstanding work\" in the preface, perhaps understandably, as this was written by LP Harthan, former Keeper of the V&A Library, which houses the document.\n\n ![](http://web.archive.org/web/20131014113707im_/http:/typophile.com/files/johnston_6102.jpg)\n\nJohnston's rhythm varies a lot in the long biblical extract from David and Goliath, becoming quite cramped in places. His work lacks the slick professionalism of traditional calligraphy of similar vintage, such as one may find in numerous church registers listing those fallen in the Great War. The amateurism of his technique may well be part of his appeal, with an Arts & Crafts authenticity of rough \"honest\" labour. He certainly made calligraphy accessible to many people, by giving legitimacy to a more rough-hewn finish than the traditional, official calligraphy associated with the heraldic tradition, both secular and ecclesiastic, which would be considered the despicable \"trade\".\n\nJohnston was a man on a mission, who publicized his theories. An adage, \"There is hope in honest error; None in the icy perfections of the mere stylist\" by CR Mackintosh sums up the attitude.\n\n"
    },
    {
      "time": "20 Feb 2007 — 9:22am",
      "content": "If that sample is Johnston’s finest calligraphy, then I don't feel at all bad about mine anymore :-)\n\nChrisL\n\n"
    },
    {
      "time": "20 Feb 2007 — 9:29am",
      "content": "Wasn't Johnston one to never correct or redo something?\n\n"
    },
    {
      "time": "20 Feb 2007 — 10:30am",
      "content": "Hard to believe a type designer who is not a perfectionist :-)\n\nChrisL\n\n"
    },
    {
      "time": "20 Feb 2007 — 12:15pm",
      "content": "He wasn't at type designer. He was a calligrapher who made some lettering instructions for the London Underground's draftsmen. This doesn't diminish his contributions to 20th century art, design, craft, and culture. But type design is something more specific, which he did not really do.\n\nAlthough of course, I have a feeling he probably was a perfectionist. He probably even saw some perfection in his errors.\n\n"
    },
    {
      "time": "20 Feb 2007 — 12:19pm",
      "content": "So being that he was English, he was not an Erroronimous Bosch :-)\n\nChrisL\n\n"
    },
    {
      "time": "20 Feb 2007 — 12:39pm",
      "content": "On Nick's mention of \"design chauvinism\": I see that a forthcoming thematic issue of the Journal of Design History is on\n\nThe Ghosts of the Profession: Amateur, Vernacular and Dilettante Practices and Modern Design.\n\nCall for papers is [here](http://web.archive.org/web/20131014113707/http:/www.oxfordjournals.org/our_journals/design/jdh_call_for_papers_06.pdf) (but deadline for submission is already past). It will be interesting to see if the issue has anything on type/lettering.\n\n"
    },
    {
      "time": "20 Feb 2007 — 1:17pm",
      "content": "That's weird -- it differentiates between commercial/industrial vernacular and professional practice.\n\nI can see how that would apply to a long-standing accredited profession such as architecture, but not to graphic design, where the majority of the \"despicable\" trade practice is both vernacular AND professional (meaning that not just AIGA/GDC members are professionals, but anyone who makes a living in the trade). But perhaps some submissions will address this.\n\nAn example of how design chauvinism works: the 1960s DDB VW ads are in all the history books, and won many awards. Therefore they are professional. However, concurrrent ads by GM, Ford, Chrysler and AMC weren't so \"creative\" (yo, car porn spreads!) and thus constitute the vernacular, ie. the unwritten history\\*. But in socio-economic terms, there is no difference, they're all products of Madison Avenue.\n\nAnd they all used sans serif fonts.\n\n\\*Except for vernacular history, now on the internet. Brilliant! --  \n [http://www.oldcarbrochures.com/](http://web.archive.org/web/20131014113707/http:/www.oldcarbrochures.com/ \"http://www.oldcarbrochures.com/\")\n\n"
    },
    {
      "time": "25 Feb 2007 — 9:22am",
      "content": "Wow, this thread came back with a vengeance, just when I thought it had fizzled. Thank you all for the useful material. As I'd mentioned in the original post, I am interested in any clear connections between cultural/political initiatives and formal features of type (or print). Overt movements, like nationalistic campaigns that identify a particular design feature as somehow \"representing\" or embodying some feature of national culture, are particularly intriguing to me. But other kinds of connections are interesting, too-- I just was reading about a Czech typographer who wanted to get \"Czechness\" into his designs.\n\nThanks again for all the input.\n\n"
    },
    {
      "time": "26 Feb 2007 — 2:57pm",
      "content": "Jay\n\nThe graduate seminar organizing the exhibition I mentioned in [this thread](http://web.archive.org/web/20131014113707/http:/typophile.com/node/19244) is underway: I imagine our findings may be of interest to you when they are complete. I've also been thinking lately of how the well-established conversation in art history about _style_ might be leveraged to sort out some of the theoretical problems in design history that you're spotlighting.\n\nI'm glad to hear that others out there are asking some of the same questions I have.\n\n"
    }
  ]
}
