{
  "id": "31513",
  "title": "modular geometric decorative \"GO\" in GO Transit logo",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "I'm looking for the [  \n(very '60's) typeface used in this logo](http://web.archive.org/web/20120415124714/http:/www.gotransit.com/publicroot/images/bottom_left_go2.gif). What I know about it is that it was availble in Lettraset in the late sixties and that it is extremely geometric. All the letters are basically made up of squares and arcs subdivided vertically and/or horizonatlly in the middle.\n\nI remember seeing this typeface in an old Lettraset catalogue - which incidentally was exactly how the logo was created. GO Transit was started in 1967 by the government of Ontario (Government of Ontario Transit - get it? :) ) with a few used trains and a few stations. During the planning & start-up period the Ministry of Transportation's art department \"donated\" cabinets full of old lettraset - probably all the stuff they had no intention of ever using. A secretary was given the task of coming up with a logo and... voila. Not bad for a company that obviously placed so little value in design at the time. :o).\n\nany clues would be much appreciated.\n\nThanks\n\n(link should be fixed - & I added an attached image)\n\n(Edit, 02, 19. 07 - attached image - my attemt at reconstructing the font.)  \nRuss\n\n| Attachment | Size |\n| --- | --- |\n| [go\\_1\\_20.jpg](http://web.archive.org/web/20120415124714/http:/typophile.com/files/go_1_20.jpg) | 5.31 KB |\n| [go\\_trans2.jpg](http://web.archive.org/web/20120415124714/http:/typophile.com/files/go_trans2.jpg) | 5.49 KB |\n| [chars.jpg](http://web.archive.org/web/20120415124714/http:/typophile.com/files/chars.jpg) | 24.56 KB |\n\n",
  "author": "russellm",
  "time": "16 Feb 2007 — 6:12am",
  "uid": "13076",
  "comments": [
    {
      "time": "16 Feb 2007 — 6:22am",
      "content": "Getting an error, check the hyperlink.\n\n"
    },
    {
      "time": "16 Feb 2007 — 6:37am",
      "content": "[http://www.rdharch.com/transportation\\_industrial/go\\_transit\\_union/go\\_tra...](http://web.archive.org/web/20120415124714/http:/www.rdharch.com/transportation_industrial/go_transit_union/go_transit_union_02.jpg \"http://www.rdharch.com/transportation\\_industrial/go\\_transit\\_union/go\\_transit\\_union\\_02.jpg\")\n\n"
    },
    {
      "time": "16 Feb 2007 — 6:49am",
      "content": "Nice, but, that's actually who I work for. I'm looking for the actual typeface - even just a name, a sample sheet, or other images with examples of it.\n\nThanks\n\n"
    },
    {
      "time": "16 Feb 2007 — 6:54am",
      "content": "i couldn't get your image to work so posted another for reference. i have looked through some my letraset books from the 70's but haven't found it im afraid\n\n"
    },
    {
      "time": "16 Feb 2007 — 6:58am",
      "content": "I don’t think its a typeface – it’s two circles, and a square that covers 1/4th of the first circle – and then three lines cutting the pieces ;-)\n\nOr... three halfcircles, one 1/4th circle and a square.\n\n"
    },
    {
      "time": "16 Feb 2007 — 7:02am",
      "content": "Are [Stock](http://web.archive.org/web/20120415124714/http:/www.myfonts.com/fonts/canadatype/stock/) close enough?\n\n"
    },
    {
      "time": "16 Feb 2007 — 7:11am",
      "content": "Thanks, Edward.\n\nyes, Goran - it's just five easy shapes, but you'd be surprized how many ways there are for sign companies to screw it up. :o)\n\nIt is a typeface. The original logo included the word \"TRANSIT\" in the same style.\n\n"
    },
    {
      "time": "16 Feb 2007 — 7:33am",
      "content": "All you need to do is rotate the \"O\" 90 deg. on Stock and you've got it.\n\n"
    },
    {
      "time": "16 Feb 2007 — 9:36am",
      "content": "I added The word Transit to the attachments above. I had to redraw it. Essentially, it's an alphabet made from the minimum number of most geometrically basic possible shapes that will fit into a perfect square. It's easy to replicate, but I want to see how letters like Y, W, X, Z and numerals were handled within the rules the rest of the alphabet follow.\n\nStock is very close in some letters, but not quite a cigar...\n\n"
    },
    {
      "time": "16 Feb 2007 — 10:31am",
      "content": "I found this in a solotype catalogue, its still not quite right but perhaps a little closer:\n\n ![](http://web.archive.org/web/20120415124714im_/http:/typophile.com/files/billboard_4589.jpg)\n\n"
    },
    {
      "time": "18 Feb 2007 — 6:01pm",
      "content": "The O is rotated 90°, but [this](http://web.archive.org/web/20120415124714/http:/www.myfonts.com/fonts/bogusky2/geo/) is very close.\n\n"
    },
    {
      "time": "18 Feb 2007 — 7:24pm",
      "content": "Thanks, everyone for all the help.\n\nI used to keep all my old Lettraset catalogs - Then one day I cleaned up. **Never again!!!** :0)\n\nSome of the fonts posted have given me clues as to how the other characters should be constructed.\n\nThanks again.\n\nI will post what I have so far on Monday, in case anyone's interested.\n\n"
    },
    {
      "time": "19 Feb 2007 — 9:53am",
      "content": "Thanks to the moderator(s) for editing my title to conform so perfectly to the more useful format described in the FAQs (Which I have now read). I Don't think I could have been more vague with my originnal title if I tried.\n\nas promised, (or threatened) I've posted my reconstruction of the font in the first post in the thread.\n\nR\n\n"
    }
  ]
}
