{
  "id": "31522",
  "title": "Classic Proportions",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Can anyone out there tell me if there is someplace (website, book, etc.) that I can find a clear definition and explanation of what Classic Proportions in type are?\n\nI have a few books that discuss it, but in them the information seems to be spread out in small pieces. I would really like to find a document that explains Classic Proportions visually, verbally and totally.\n\nThank you for any help you can provide,\n\nDuncan\n\n",
  "author": "duncan",
  "time": "16 Feb 2007 — 8:56am",
  "uid": "10219",
  "comments": [
    {
      "time": "16 Feb 2007 — 9:57am",
      "content": "_The Form of the Book: Essays on the Morality of Good Design_ by Jan Tschichold has a chapter on exactly the subject that you're looking for.\n\nThere's also light coverage in Robert Bringhurst's _Elements of Typographical Style_.\n\nBringhurst's is not as in-depth as the former, but easier to find. For the Tschichold one, find a good library. I actually talked the library at SUNY New Paltz into aquiring one while I was a student there. I know of a link to the text of the specific chapter that I'm referring to, but I'm not sure if it would be outside of the typophile rules so I won't be posting it. I can imagine that making such content available is against copyright regulations, even if the book is out of print.\n\nI'm sure you'll get some great recommendations from others as well, these are just two that I've read myself.\n\n"
    },
    {
      "time": "16 Feb 2007 — 11:10am",
      "content": "_clear definition_\n\n1.618, the golden mean.\n\nI don't know if there are any analytical treatises on this in type design.  \nHowever, I just did some measurements on the cap and lower case \"O\" in Adobe Garamond, and the relationship between the height of the two is golden, within 1%.\n\nClaude Garamond would most certainly have used this ratio, but did he calculate it? Probably not, IMHO, as if you're living in a culture where everything of merit follows those proportions, they would be second nature.\n\n"
    },
    {
      "time": "16 Feb 2007 — 11:23am",
      "content": "After Nick's post, I see that I misunderstood what you were asking for, but if you are ever interested in classical _book_ proportions, you can read my first post. Anyway, I surrender the thread to Nick, who actually knows what he's talking about.\n\n"
    },
    {
      "time": "16 Feb 2007 — 11:33am",
      "content": "Casey, I generally make it up as I go along.  \nThanks for the tip-off -- it was the mental image of Bringhurst's page diagrams that prompted thoughts of the golden mean.\n\n"
    },
    {
      "time": "16 Feb 2007 — 11:38am",
      "content": "\\>the cap and lower case “O” in Adobe Garamond\n\nOne of the difficulties in thinking about 'ideal' proportions is that you can compare the h-ascender to the x-height, the overshoot heights of the O and o, the h ascender to the o overshoot height. So if one of the ratios hits 'golden' exactly,the others won't.\n\nSo in the end, as I suppose Nick would agree, you just have to look and see what you find pleasing in the given design.\n\nYou get a similar issues with text and page blocks.\n\n"
    },
    {
      "time": "16 Feb 2007 — 11:57am",
      "content": "When it comes to proportions and measures, to me, [Mathematische Grundlagen zur Satzherstellung](http://web.archive.org/web/20150306061424/http:/www.amazon.de/Mathematische-Grundlagen-Satzherstellung-Hans-Bosshard/dp/3855840113/sr=1-5/qid=1171655639/ref=sr_1_5/028-6930701-5619725?ie=UTF8&s=books), a book by the Swiss typographer (and outstanding teacher) Rudolf Bosshard, is my Bible. Unfortunately, it is only available in German; you can see some of Bosshard’s principles in use in his [Typographic Grid](http://web.archive.org/web/20150306061424/http:/www.amazon.com/Typographic-Grid-Hans-Rudolf-Bosshard/dp/3721203402).\n\n"
    },
    {
      "time": "16 Feb 2007 — 1:21pm",
      "content": "[.] because of \"Mathematische Grundlagen zur …\", danke für den Tipp, Florian\n\n"
    },
    {
      "time": "16 Feb 2007 — 1:44pm",
      "content": "…&nbsp;not to forget its (rather dated) brother [Technische Grundlagen zur Satzherstellung](http://web.archive.org/web/20150306061424/http:/www.amazon.de/Technische-Grundlagen-Satzherstellung-Hans-Bosshard/dp/3721210107/sr=1-5/qid=1171662199/ref=sr_1_5/028-6930701-5619725?ie=UTF8&s=books).\n\n"
    },
    {
      "time": "16 Feb 2007 — 2:46pm",
      "content": "Thank you all for your answers.\n\nWhat I am looking for is more information so I can understand better why for example in [Designing Type](http://web.archive.org/web/20150306061424/http:/www.amazon.com/Designing-Type-Karen-Cheng/dp/0300111509) Karen Cheng says:\n\nAkzidenz Grotesk and Helvetica Neue have modern proportions while Frutiger and Futura have **oldstyle proportions**. (paraphrased)\n\n\"Garalde typefaces have flowing forms, medium to high contrast and variable widths (the capital letters hae wide and narrow **oldstyle proportions** ).\"\n\n\"The Didone style exaggerates key features of the earlier Transitionals: letters are drawn with vertical stress, uniform widths ( **modern proportions** ) and extreme contrast.\"\n\n"
    },
    {
      "time": "16 Feb 2007 — 4:45pm",
      "content": "Hi Duncan. The explanatory diagram you are searching for does exist (it's just that at the moment it's in my office on a bookshelf and I can't remember which book it's in...)\n\nSomeone else on typophile is likely to give you an improvement on what I set out here, but briefly; it's all about the respective widths of key characters in the uppercase.\n\nClassic proportions for typeface designs are those based on Roman inscriptional lettering (eg. [Trajan](http://web.archive.org/web/20150306061424/http:/www.linotype.com/8565/trajanregular-font.html))where the uppercase O is oval, the M is slightly wider than the square of its height, and the uppercase N is approximately half of this M width. The 'narrow' letters of the uppercase alphabet E,F,L and S etc. all follow the width of the N.\n\nThe renaissance designers followed this model for proportion in their various Oldstyle/Garalde designs. The proportions were overhauled and rationalised about three centuries later with the arrival of the Modern/Didone proportions in which uppercase O is circular (wider than its predecessors), M is narrower and N is square – having a significant roll-on effect on the proportions of the rest of the uppercase (E,F,L and S all becoming much wider). Its effect was to regularise the widths of the letters.\n\nIn sans serif designs, the early (19thc) grotesques (eg. [Monotype Grotesque](http://web.archive.org/web/20150306061424/http:/www.linotype.com/13428/monotypegrotesqueroman-font.html)) often vestigally followed Oldstyle proportions, while the later 20thc rationalisations of this style – the neo grotesques (eg. Helvetica, Univers _at al_) were drawn up to modern proportions.\n\nHope this helps.\n\n"
    },
    {
      "time": "16 Feb 2007 — 7:02pm",
      "content": "Ben is right in general that some of the Classic cap proportions are based on the square, and others on a half square--roughly. However, the O and N tend to fill the square--the O is circular. See Trajan for the Classic proportions.\n\n"
    },
    {
      "time": "17 Feb 2007 — 12:51am",
      "content": "Sorry, seems that I’ve misunderstood your question—nevertheless, Bosshard’s books are a must for every typographer&nbsp;…\n\n"
    },
    {
      "time": "17 Feb 2007 — 3:10am",
      "content": "Thanks William for the necessary correction there. Apologies Duncan – with the Os I got it arse about elbow; so that **should** be _... Roman inscriptional lettering where the uppercase O is circular_ and _...Modern/Didone proportions in which uppercase O is oval (narrower than its predecessors)..._\n\nFutura (which has alledgedly perfectly circular uppercase O) is known for being based on classic Roman proportions – and therefore cannot be referred to as a grotesque in the English-speaking world.\n\n"
    },
    {
      "time": "17 Feb 2007 — 7:13am",
      "content": "_So if one of the ratios hits ‘golden’ exactly,the others won’t._\n\nDo not underestimate the power of the Fibonacci.\n\n"
    },
    {
      "time": "17 Feb 2007 — 1:56pm",
      "content": "Nick I presume you already know about [this animated demonstration](http://web.archive.org/web/20150306061424/http:/www.textism.com/bucket/fib.html)?\n\n"
    },
    {
      "time": "17 Feb 2007 — 2:06pm",
      "content": "You can always count on that Fibonacci to be Series's stuff :-)\n\nChrisL\n\n"
    },
    {
      "time": "17 Feb 2007 — 2:48pm",
      "content": "The proportions of the classic Roman capitals fall into groups. My memory fails me but generally, I believe it is that there are groupings that most letters fall into (but there was always optical compensation). There were the circular letters or O group. Circular is not meant exactly, much compensation was made. While the D, C, and G, were in the group with the O and Q, they were actually a stroke width narrower (as becomes quite obvious when drawing them). The middle width was the N, H, A, V, and T (later U). The so-called half-width group was the, S, R, P, E, and F--keep in mind that they were neither exactly half nor exactly the same width as the eye was the final arbiter. The wide letter M and W were wider than O but not twice as wide as N. Overlapping two Vs a bit gives you the W and a V with arms gave you the M. Again, this is not micrometer exact measurement. Just as we today optically adjust, so did they--I wonder what the Roman word for overshoot was :-) The capitals I and J were clearly odd balls and pieced from the strokes and partial curves of the rest. The Trajan column letters are not exactly the same width even with the repeated letters. You must admit that those old codgers did one hell of a fine job anyway though!  \nThe classical proportions (being clear groups of widths) are more often used to describe the difference between early times and more modern times when the width of letters became closer to the same optical width. Modern letters are still not perfect measures since this would make for some ugly type. Even the Bauhaus could not make the crazy things exactly geometrically and god knows they tried.\n\nChrisL\n\n"
    },
    {
      "time": "17 Feb 2007 — 3:04pm",
      "content": "\\> I have a few books that discuss it\n\nand this one?\n\n ![](http://web.archive.org/web/20150306061424im_/http:/typophile.com/files/book1_5011.png)\n\n"
    },
    {
      "time": "17 Feb 2007 — 3:11pm",
      "content": "I haven't played with the Fibonacci series--which is different from the Golden mean, though there are connections.\n\nBecause of all the numerous optical effects with type, I suspect they are interesting but of limited use. I will play with them now, though, because I'm a sucker for this kind of stuff, and haven't tried them out.\n\n"
    },
    {
      "time": "19 Feb 2007 — 7:56am",
      "content": "While I was reading Chris' post I started to realize that the books that I have read and have been reading do explain these proportions, after all. I probably lost the connection due to my reading in small chunks when I can find the time. Really this is why I hope to either find or create some sort of chart that explains these concepts. That way I could refer back to it and have all the information in one place.\n\nSo far I understand:\n\nThat the groupings are general and that optical adjustments by the designers mean that there are/were not so hard and fast that for example one could say, \"In all Classic proportioned typefaces the O is a perfect circle.\"\n\nClassic Type Proportions generally fall into set groups of widths that are more or less designed around a square.\n\nModern Type Proportions are generally designed around a similar optical width.\n\nThe best books I have read so far that have helped my understanding on these styles and proportions are:\n\n[Designing Type](http://web.archive.org/web/20150306061424/http:/www.amazon.com/Designing-Type-Karen-Cheng/dp/0300111509/sr=8-1/qid=1171899789/ref=pd_bbs_sr_1/104-0796813-5734315?ie=UTF8&s=books)  \nby Karen Cheng\n\nand\n\n[Elements of Typographic Style](http://web.archive.org/web/20150306061424/http:/www.amazon.com/Elements-Typographic-Style-Robert-Bringhurst/dp/0881792063/sr=1-1/qid=1171900026/ref=pd_bbs_1/104-0796813-5734315?ie=UTF8&s=books)  \nby Robert Bringhurst\n\nI am really interested in David Hamuel's suggestion of \"A Constructed Roman Alphabet.\"\n\nWhile I realize that no great typeface rigorously follows hard lines of geometry I still keep coming back to the ideas of how geometry and type design interact.\n\n"
    },
    {
      "time": "19 Feb 2007 — 6:41pm",
      "content": "I'm constantly surprised to find myself drawn to objects that appear built on the golden section (hence the avatar), from type with ascender-to-x ratios of roughly 1|1.618, to cars, to household items, to people; but perhaps it's just that I've spent too much time with books and thus everything else has been infected. As Bringhurst has suggested, Peter S. Stevens' book _Patterns in Nature_ is an interesting text to have a look at on this front.\n\n"
    },
    {
      "time": "19 Feb 2007 — 7:07pm",
      "content": "\\>ideas of how geometry and type design interact\n\nBecause no letter in a great typeface strictly follows simple geometrical shapes, such as circles and squares, I think there is more likely something to be learned from the Fibbonacci series, from ovals and spirals, and so on.\n\n"
    },
    {
      "time": "19 Feb 2007 — 10:30pm",
      "content": "Hello again. The explanatory diagram I mentioned earlier? I've no idea where it is – I may even have been referring to something I saw in Karen Cheng's book (in which case, you will know it already Duncan). But I did come across this on p.154 of Leslie Carbarga's [Logo Font and Lettering Bible.](http://web.archive.org/web/20150306061424/http:/www.logofontandlettering.com/)\n\n ![](http://web.archive.org/web/20150306061424im_/http:/typophile.com/files/Koch-_capitals_3735.jpg)\n\nRudolf Koch's system for determining proportions, based on quartering a square, for Kabel, c.1926. Maybe not a _great_ typeface, William, but certainly much better than many that came after it.\n\nThere is of course also [Geofroy Tory's Champ Fleury](http://web.archive.org/web/20150306061424/http:/www.octavo.com/editions/trychf/) which really goes to show that this is an idea that just won't go away. Book Two is where he describes classical letter proportions one by one. I hear there are misgivings about the digital format material that Octavo is putting out, so I would advise you to get hold of the 1967 Dover facsimile of the original Grolier Club edition of 1927.\n\n"
    },
    {
      "time": "19 Feb 2007 — 11:32pm",
      "content": "Hey, the Carbarga examples closely resemble the cover of Tracy's _Letters of Credit_! Would there be any talk on this subject on that book? I haven't touched it in quite a while.\n\n"
    },
    {
      "time": "20 Feb 2007 — 12:14am",
      "content": "Yes, Walter Tracy talks about five of Rudolf Koch's typefaces in Letters of Credit. One of them is Kabel. Very nice chapter.\n\n"
    },
    {
      "time": "20 Feb 2007 — 6:07am",
      "content": "_based on quartering a square_\n\nI don't buy that.\n\nThe diagrams are more of a post-facto rationalization (i.e. BS) for something which has simple geometry: circular curves and lots of symmetry.\n\n"
    },
    {
      "time": "20 Feb 2007 — 6:14am",
      "content": "Ben, Koch was a great designer, and those caps are wonderful. However, they are not based on a square. They are projected on the quartered square, which is a different thing. Only four of the 26 letters fill the square: OQ AV. The others have different complex relationships to the square.\n\n"
    },
    {
      "time": "20 Feb 2007 — 6:27am",
      "content": "I agree with Nick and William. In fact, I believe that those images were just graphics created fro the Klingspor foundry's sales brochure. I doubt that they are working drawings, in the sense that people think them to be. As Nick implies, Koch may have drawn them after the facet to help illustrate the idea behind his design.\n\n"
    },
    {
      "time": "20 Feb 2007 — 7:26am",
      "content": "If you notice, not a single letter hits the grid square. The four-unit grid functions more like a map legend showing relative scale. I am also siding with Dan on this that the grid drawing was after-the-fact and not what Koch based his types proportions on.\n\nChrisL\n\n"
    },
    {
      "time": "20 Feb 2007 — 7:39am",
      "content": "Exactly! I mean, anything is possible. But that drawing is in the first brochure produced to market the typeface. All Klingsport brochures were meticulously designed and set. The samples, including that drawing, seem like things that were made as show off elements.\n\nAlso, if Koch had made overlapping diagram things while he was working, I bet they would have been sketched out quickly with a broad-nibbed pen,\\* and not looked like these.\n\n\\*Sort of like diagrams Johnson made.\n\n"
    }
  ]
}
