{
  "id": "31539",
  "title": "SF Bay Area Typophiles - Calligraphy & Antiquarian Book Fair",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Sorry for the last minute posting! It turns out I will be in in town (SF) to go to a combination Calligraphy, Library & Aniquarian Book Fair this Sat. The dealers atending look pretty stupendous. Typophile luminary Carl Crossgrove will be there at these events too. How about you?\n\nThis is the info for the event/s:\n\nhttp://www.sfbookfair.com/  \n [http://sfbay.craigslist.org/eve/268371078.html](http://web.archive.org/web/20070225010915/http:/sfbay.craigslist.org/eve/268371078.html)\n\nSome times that might be relevant are:\n\n[1pm-2pm] A program dscussing Calligraphy with Georgiana Greenwood, Thomas Ingmire, and Arne Wolf titled: ‘State of the Art, State of the Craft’.\n\n[2:30-3:30] There is a reception for the Library’s display called Calligraphy in the world of books. I am not sure what conditions ( if any ) there on on going to this. You might call 415.626.7500 to ask.\n\nAfter these I will be gong to the bookfair itself to see what I can see.\n\nIf anybody has aniquarian book advice ( or manuscipt advice ) for me lay it on me quick!\n\n",
  "author": "<a href=\"user/2942\" title=\"View user profile.\">Eben Sorkin</a>",
  "time": "<br>",
  "uid": "2942",
  "comments": [
    {
      "time": " 17 February, 2007 - 12:35pm",
      "content": "I am off to this in a few minutes. Here’s hoping I see ya today. Cheers!\n\n"
    },
    {
      "time": " 18 February, 2007 - 11:40am",
      "content": "That was amazing. I will not be there but there is one day left to go see original elsevier (sp?) editions and Zaph books, leaves of vellum written on in the 13th 14th & 15th centuries, and much much more.\n\nCheers!\n\n"
    },
    {
      "time": " 20 February, 2007 - 12:42am",
      "content": "A great fair! One dealer permitted me to take snapshots of the well-known Hamburg Koran of 1694, but I had to promise not to circulate them.\n\n"
    }
  ]
}
