{
  "id": "31608",
  "title": "Treacyfaces TFForever",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "A client of ours is completely in love with TFForver by [Treacyfaces](http://web.archive.org/web/20110809062258/http:/www.treacyfaces.com/). I've never heard of that foundry before and would love to check before we actually buy/use it. I also see a few problematic issues with it, so i'd be very interested to hear of any alternatives in the same vein…  \nso here goes my questions:\n\n1) Does anybody have any experiences with fonts by this foundry? Are they ok in a technical sense/production-proof?\n\n2) Does anybody know wheter TFForever was inspired by something else, as I'd like to have the option of offering the \"real deal\" to our client, onyl in case there is any of course…\n\nHere's the issues i have with it, all IMO of course:\n\n– too tightly spaced\n\n– lc r shape does make for big white holes when followed by a rounded character or touches next character.\n\n– Capitals too heavy for my liking compared with lowercase, esp in the heavier weights.\n\n– overall a bit too quirky for my liking\n\nSo if anybody could suggest some alternatives that avoid these issues and come across a bit more serious/less quirky in the details, i'd be grateful, as i feel this face isn't 100% up to the standard we'd want to supply, no offence intended.  \nHere's a test setting from their site (Regular and Demi):\n\n| Attachment | Size |\n| --- | --- |\n| [3254796026.jpg](http://web.archive.org/web/20110809062258/http:/typophile.com/files/3254796026.jpg) | 13.41 KB |\n| [3254796001.jpg](http://web.archive.org/web/20110809062258/http:/typophile.com/files/3254796001.jpg) | 14.72 KB |\n\n",
  "author": "<a href=\"/web/20110809062258/http://www.typophile.com/user/11360\" title=\"View user profile.\">franzheidl</a>",
  "time": "<br>",
  "uid": "11360",
  "comments": [
    {
      "time": "",
      "content": "Joe Treacy has been around for a good long time producing interesting type faces. I even have a Chartpak flyer from back in the 1980s rub-on letter days that has a Treacy face. They are professional fonts and I would see no technical problems with his work. As to your other comments I have never worked with that font so have no opinion but I know designers who have used his fonts and like them.\n\n"
    },
    {
      "time": "",
      "content": "Hello Bob,  \nmany thanks for your remarks. To clear this up: I didn't mean to have a go at the foundry/designer nor to imply anything bad about it. I just want to make sure we or the client don't run into problems later on (if we actually use it, that is) and had never heard of the foundry, that's why i was asking.  \nThe only actual issue i see is that it spaces rather unevenly in longer text settings, which – in my opinion – is due not to bad spacing/kerning at all, but more to the character shapes themselves, and that's why i am still interested in hearing about alternative candidates. The font might work just fine for headlines, logos, etc.  \nThe other issues i mentioned (quirkyness) probably are down to my personal taste, for my liking the face just tries a bit too hard to be original/deliver it's character. All in my humble opinion of course, others might just love it as it is and that's fine.\n\n"
    },
    {
      "time": "",
      "content": "As with many faces developed during that time period, tight spacing was the norm for the day. I have purchased a face from Joe Treacy and found him easy to work with. I purchased TF Arrow, which is also tightly spaced. I just track it out to my liking depending on the size. I use only for display though. Treacy has been around since the early 1990s in the digital arena but has done work in the older technology as well. Give him a call.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Joe was one of the pioneers of digital fonts. Forever was used to set the heads in the Fontographer manual in the early 90s.\n\n"
    },
    {
      "time": "",
      "content": "Many thanks for your input. Again, i didn't mean to question anybody in person, their work or competence at all.\n\nMy problem right now is that this is a dedicated Display font, and probably a good one at that, even if not 100% to my taste.  \nThe client loves it, but it will have to be used for body copy, not novels, but still (longer) texts in smaller sizes. And again, i don't think TFForever works well for this as it is a display face.\n\nI could suggest Camingo, Corpid, taz, even Sanuk, etc. to the client, which would serve the purpose much better, are remotely in the same ballpark stylistically, but without the sharp edges and details that add up to that certain quirkyness in text settings that i mentioned, but i thought i'd ask if somebody might have a suggestion that is a bit more down to earth than TFF, but probably with just a slight (i mean slight:-) bit of that \"american display type quirkyness\" as i allow myself to call it rather unadequately…\n\n"
    },
    {
      "time": "",
      "content": "I think you'll be OK if you just open up the tracking, as Chris suggested.  \nThe tight fit is really all that makes it seem to be a display face.  \nForever 2 has a single-bowl g which may be more to your liking.\n\n"
    },
    {
      "time": "",
      "content": "Many thanks for your suggestion, Nick.  \n(Can you read thoughts re single-storey g? :-)  \nOpening up the tracking would of course solve my problem with the tight spacing (obviously), but the gap between lc r and e.g. lc a would increase even more, and the problem of the too heavy Caps wouldn't be adressed at all. Furthermore, as the work will be set in German with every noun beginning with a cap, this might become more prominent as when setting English.\n\nI've just done my homework myself (as i should have done in the first place admittingly) and there's quite a few alternatives, depending on what route to go with A, B, C denoting overall preference:\n\nA)  \nAmplitude  \nFresco Sans  \nKievit  \nPlus  \nStrada Condensed  \nVersa Sans  \nVista Sans  \n(Auto – completely different, but could work)\n\nB)  \nFago  \nPTL Manual  \nSun  \n(Sanuk's not really a candidate)\n\nC)\\*  \nLegato  \nGeometric 212  \nQuay Sans/Foundry Journal\n\n\\*these would probably catch that quirkyness more than i'd want to.\n\nI also apologize for calling it \"american display type quirkyness\", the treatment of the edges and shapes in Forever remotely reminded me of Antique Olive as i just realized, and probably that was what didn't make me like it, esp. not for body copy :-)\n\nThanks to all who replied for taking the time and effort.\n\n"
    },
    {
      "time": "",
      "content": "Just wanted to chime in on this topic: we use TF Forever for the in-room magazine of a luxury hotel chain with excellent results. No long copy, however, strictly display.\n\nWe've had no technical problems with the font, and its tight spacing is well-suited to heads, decks, etc.\n\n"
    },
    {
      "time": "",
      "content": "I can personally recommend any of your (A) options as I've used them myself. And I would get more samples of [FF Legato](http://web.archive.org/web/20110809062258/http:/www.typophile.com/wiki/FF%20Legato) before relegating it to (C). :)\n\n"
    },
    {
      "time": "",
      "content": "I think Strada (not condensed), Vista, Fago and Amplitude seem to me to be most related to TF Forever. Fago and Amplitude seem to be likeliest to sustain longer passages at small sizes (though I haven't tested this).\n\nWhatever it was inspired by, Forever has the unmistakeable post-ITC ultra-high x-height, a hallmark of a lot of Treacy's designs. Given that, I'm very surprised to hear the caps appear dark. Not sure how much you would like that in text (even if you track Forever out as is suggested above). For the various reasons mentioned, maybe you want something with a smaller x-height. Is there any German text?\n\n"
    },
    {
      "time": "",
      "content": "Hello, franzheidl —\n\nRest assured that my TFForever was created from scratch, originally, by me.\n\nAs such, it is \"the real deal\".\n\nIt started from my spontaneous sketches, but most was actually designed by me right on the monitor. And then, naturally, tested extensively.\n\nThe monitor-resolution samples at the point size you sampled them don't appear to me to tell you enough of the story. (In my humble opinion.)\n\nTreacyfaces, Inc. incorporated in 1984 with the royalties earned on the sales of my TFBrynMawr series through Linotype, commissioned by their innovative type director and all around very nice person, Steve Byers. That series was developed starting in 1978.\n\nMy Star Light and Star Bright designs appeared in the Chartpak competition winners catalogue in the Chartpak Velvet Touch Winning Faces competition in 1985, and they debuted in the 1986 catalogue. That started with ink on paper sketches, and sure was interesting to execute. The outlined stars were actually cut in amberlith (and rubylith, if rolls of that happened to be on sale that week) using a double-bladed X-Acto knife and french curves. A little while before vector art really came into its own on the desktop.\n\nI can tell you that we have by now hundreds of thousands of customers of just my TFForever, world wide. And would you believe that not one customer has ever complained about the spacing, or wanted to return it for an exchange or refund? It's true.\n\nAn interesting sidebar: My tests show that our built-in letterspacing and kerning produces noticeably better and more consistent results than optical spacing turned on in InDesign (as a point of comparison). Customers that I've talked with about this wholeheartedly agree.\n\nContrary to what you are seeing in that smallish JPG, the r design with its flared terminal does not open up any more of a gap than other sans do. In fact, in all sizes but especially in display sizes, the terminal design is advantageous in the way it both saves space and helps to maintain a distinction in shape recognition between the r and the character to follow it. Even often problematic follow-on characters like v w x y. The terminal itself was specifically designed to be less wide than other sans' r terminals, to solve the problem that many others have historically had with that part being (in my opinion) overstated.\n\nWe have lots of customers setting German and other Western languages, and setting Eastern European languages with no problems. (No fonts have 'no problems', but we literally have no complaints and no returns.)\n\nCustomers do have the freedom to track it more openly if needed. As long as you have enabled kerning, you will still benefit from that which we build into it. Last time I checked opening up tracking in all the major apps takes about a second. In any event, less time than it takes to write about it.\n\nAnd of course, point size range, surprinting, reproduction method, and paper are all considerations for setting any fonts more openly. Or, as it more often the case, more tightly. And with much additional hand-kerning adjustments.\n\nI spent many years in the quagmire of hand kerning set material before I started making my own faces. And I was determined that I'd fix that problem so that I would never have to face it again. And, so that art directors and other type users would be able to avoid it, too. That's why, as I introduced TFForever, I did so with 1700 kerning pairs per weight, far more than the 0 to 90 kerning pairs built in then, and more than the 500 that came later from competitors who were finally forced to 'add value' by doing something, anything, about their paltry or nonexistant kerning.\n\nIt has been debated for decades whether a given font needs 1700 or more kerning pairs, if the font has been drawn and fitted properly to begin with. All I can tell you is that I make sure that our faces are drawn and fitted properly to begin with. And they still benefit from the added care.\n\nWhat I find most interesting about observations like this is the immediate need to classify TFForever as a display face. I look at it as more of a hybrid whose design allows the user quite a lot of utility to range between display, mid-size and text sizes rather effortlessly.\n\nI guess I would ask: What kind of point size(s) are you using? How extensive is your text?\n\nDid you know that one of the benefits of TFForever's size on the body and its x-height (which, by the way, is not outrageous) is that in text sizes, it looks about 2 point sizes larger than it actually is. And yet, it saves quite a lot of depth in long text. Which is exceedingly helpful to magazines and catalogues, among others. And a big reason why they buy it and use it extensively.\n\nJust thought you might find that to be interesting reassurance and contrast, in light of your observations.\n\nGood luck with your search.\n\nThanks very much.\n\n(Joe)\n\nJoseph D. Treacy  \nPresident & Director of Typography  \nTreacyfaces, Inc. / treacyfaces.com\n\n"
    },
    {
      "time": "",
      "content": "Many thanks to anybody who invested their time and effort to answer my query, esp. Mr. Joe Treacey himself.\n\n@Stephen Coles:  \nyou're right about Legato, in big sizes it looked a bit too lively for what i'd want, in smaller sizes it might just work as well as anyhting in A). My categorization was in reference to that particular project, not to the quality of the faces per se. I'd never question a groundbreaking design like Legato as an achievement in itself.\n\n@crossgrove:  \nIn fact, i do like the big x-height, as it, as Mr. Treacey rightly states, does let the setting appear bigger than it actually is. Nonetheless, as often as i look at it, the caps do appear a bit too dark to me. And yes, since the project does incorporate almost 100% german text, this might be a problem.\n\n@ Joe Treacey  \nFirst of all, thanks for getting back.  \nAgain, i didn't mean to question your work, competence and experience at all. I just had never heard of Treacyfaces before. And like you'd do before investing in a product or make your client invest in one, i wanted to check back about it's background. I frankly admit that i should have put my initial query more thoughtfully, and i do apologize if it implied any offence.  \nI just wanted to discuss this typeface as a practicing typographer on a factual level, you can of course ignore everything i stated that may be down to (my) taste and personal preference, i just wanted to illustrate the issues i was/still am on about:\n\nI still do find Forever does establish a rather uneven grey value when set in smaller sizes, no matter if tracked more loosely or by default.\n\nAs stated above, i don't find the rather large x-height to be a problem, in fact i even find it (potentially) beneficial.\n\nAnd i still think the Caps are a bit too heavy for text settings, esp. in german setting they somewhat seem to jump at you.\n\nI didn't even mean to imply that these are design flaws, the way Forever behaves in settings, it's a 100% display face at least to my eyes, and probably an excellent one at that, it's just that we apparently need a rather dedicated text face to avoid the issues mentioned above (which may be actual issues at text sizes only).\n\nAgain, no offence meant or implied. It's just what my eyes see and they're almost all that is there for a typographer to work with. And i usually trust mine.  \nCurrently, we're thinking about using Forever in Headlines and the like and combining it with something else (see above), we have yet to test this option/combinations though.  \nAgain – in case i came across offensive in any respect, i sincerely do apologize. Thank you for your input and the discussion.\n\n"
    },
    {
      "time": "",
      "content": "After all of this I had to look more at the font in question. I think I agree the caps look heavy - at least - from the try out feature at Treacyfaces.\n\n ![](http://web.archive.org/web/20110809062258im_/http:/typophile.com/files/screenshot_01_6660.jpg)\n\n"
    }
  ]
}
