{
  "id": "31601",
  "title": "Avari - critique, please",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "I think as a designer I’ve always done symbols and graphics in my logos out of timidness. This is the first logo I’ve done which was solely typographical work, as I decided that was really the only way to go. So, I’m new to this, but please rip it to shreds! I need guidance in this new arena! :)\n\nSo - The company is Avari, jewelry wholesalers and retailers. They gave me free reign on the design, and originally I started with something way different, with color, and graphic symbol... Then I decided to do some research.\n\nI noticed the biggest names in the jewelry business (like debeers, scott kay, tiffany, etc.) Had no graphic symbols - what they are selling is not jewelry, it’s their own name! So they use an authoritative serif typeface, as a general rule.\n\nI wanted to create something authoritative, to command respect, yet keep a level of elegance - they do sell jewelry, after all! So, I used a modified LYNN typeface, with caps, spaced pretty wide apart, and for the cross-through on the “A” I used a calligraphic brush and did it freehand. I did about 60 versions of this general style, 85 versions in all for the logo. I kept it pure white-on-black to keep it real formal, like black-tie.\n\nComments?? Is the cross-through on the “A” too unoriginal? I had other versions which were more interesting, but I felt were too busy... Looking at it now, I think the letters might not be spaced evenly apart... what is a good process to do good kerning?\n\nThanks! :)\n\n| Attachment | Size |\n| --- | --- |\n| [logo71.jpg](http://web.archive.org/web/20071217131002/http:/typophile.com/files/logo71.jpg) | 47.5 KB |\n\n [‹ Whitfield Publications LLC](http://web.archive.org/web/20071217131002/http:/www.typophile.com/node/32177 \"Go to previous forum topic\") [New Identity ›](http://web.archive.org/web/20071217131002/http:/www.typophile.com/node/32151 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071217131002/http://www.typophile.com/user/14737\" title=\"View user profile.\">tevih</a>",
  "time": "<br>",
  "uid": "14737",
  "comments": [
    {
      "time": " 19.Feb.2007 8.03pm",
      "content": "My main issue with your logo is that it’s not incredibly memorable (although the logos you mentioned are not especially distinctive either, except by their constant and consistent use by their companies). The curved A crossbar, as you said, isn’t very original, but it especially doesn’t say much to me about Avari. What do they see as distinguishing them from their competition, if anything? What makes the name “Avari” something that consumers should want in their jewelry collections?\n\nRegarding kerning, it’s largely subjective, based on trying to create an even balance of black and white across the type. With that in mind, I’d definitely tighten up the space between the V and second A and maybe a bit between the second A and R.\n\nSomething that I and others on Typophile usually aren’t fans of is using fake small caps, as you appear to have done here. By this I mean shrinking down capital letters to serve as small caps instead of using an actual small caps font. The problem that appears when you do this is that the artificial small caps end up being less thick and thus “lighter” than the regular capital letters — check out the weight difference between the strokes of your big and small A’s. My recommendation is not to do this small cap business at all: either make your logo all full-height capitals or use lowercase letters. If you’re committed to the small caps look (which some feel conveys a sophistication, but I feel generally looks a bit phony), you should look for a typeface that has a small caps font.\n\nAs to your choice of typeface, I’m not crazy about Lynn — I don’t find it especially memorable, as you would want for a typographic logo. It’s impossible not to mention Christian Schwartz’s [Luxury Collection](http://web.archive.org/web/20071217131002/http:/www.houseind.com/index.php?page=showfont&id=536&subpage=viewfonts), which he created based on examining fashion and jewelry advertisements. I think that Luxury Diamond might work very nicely.\n\nThe typical ones to use for luxury logos are “modernes” (EDIT: I think I meant “didones”) like Bodoni and Didot. Some alternatives might be [Walburn](http://web.archive.org/web/20071217131002/http:/www.veer.com/products/typedetail.aspx?image=SHT0000010#flont) or [Filosofia](http://web.archive.org/web/20071217131002/http:/emigre.com/EF.php?fid=97). I would love to see you use [Filosofia Unicase](http://web.archive.org/web/20071217131002/http:/www.emigre.com/fontpage.php?PFilU.html) to differentiate yourself. Generally, I’d like to see a jewelry logo that evoked the others in the field but at the same time was obviously unique. Two quick ideas that came to me (I don’t know if they’re good, but ...) are using [Fournier and Fournier Le Jeune](http://web.archive.org/web/20071217131002/http:/www.veer.com/search/results.aspx?keyword=fournier&producttype=TYP&pricemodel=RM%2CRF) together, with a Le Jeune capital A and Fournier “VARI.” Fournier is the epitome of extravagance and ornament, so that could be a nice way to send out that message. My other suggestion is [Zaner](http://web.archive.org/web/20071217131002/http:/www.veer.com/products/typedetail.aspx?image=IHT0000138#flont), which has really terrific thick and thin strokes that could suggest elegance, well, elegantly. (On a side note, I guess I’m really promoting other Typophiles’ fonts in this post. It wasn’t especially intentional — I must just have seen them recently).\n\n"
    },
    {
      "time": " 19.Feb.2007 8.12pm",
      "content": "[Aviano](http://web.archive.org/web/20071217131002/http:/www.myfonts.com/fonts/dooleytype/aviano/) from Insigne Design has sort of a luxurious feel to it. It’s a bit easier to get the feel of it [here](http://web.archive.org/web/20071217131002/http:/www.myfonts.com/images/library/source/Aviano%20Sample%20Page.pdf).\n\n"
    },
    {
      "time": " 20.Feb.2007 1.35am",
      "content": "You’re gonna have major inkfill issues on the pointy ends of the crossbar. You’ll need to open it up a bit.\n\n"
    },
    {
      "time": " 20.Feb.2007 8.35pm",
      "content": "Thank you everyone for your comments!\n\nI thought it would be worth showing a couple other variations of the A cross-through, attached.\n\nI think you’re right about the kerning, I will tighten up those places.\n\nI think all of those typefaces are beautiful, but the only ones I think that could work with this is “Diamond” and “Aviano”.\n\nI did use “fake” caps... I think I see what you mean about weighting. Thank you for that pointer.\n\nWhat is it you don’t like about Lynn? I ask because this is a very new area for me. I’d like to hear a solid critique of the typeface.\n\nThanks so much guys! :)\n\n ![](http://web.archive.org/web/20071217131002im_/http:/www.typophile.com/files/logo65_5898.jpg)\n  \n\n ![](http://web.archive.org/web/20071217131002im_/http:/www.typophile.com/files/logo26_5826.jpg)\n  \n\n ![](http://web.archive.org/web/20071217131002im_/http:/www.typophile.com/files/logo75_4752.jpg)\n\n"
    },
    {
      "time": " 21.Feb.2007 4.06am",
      "content": "Numbers 1 and 3 are more interesting. However, I still have the problem of not learning much from the logos about the company. Maybe I could get a sense of refinement, but nothing to differentiate Avari from its competitors. Unfortunately, being that these are done freehand, they look a bit _too_ freehand. For a logo, the most prominent part of an identity, you want it to be perfectly executed, and the crossbar swashes you’ve made aren’t quite there. For example, the one in the third example above looks very shaky. If you want to continue with this concept, you should edit the curves of your crossbars in Illustrator to make it smoother and more uniform (like the outlines of a nice typeface).\n\nOthers may feel differently (type is often subjective), but for me, Lynn just isn’t memorable. I am reasonably accomplished at identifying typefaces, but I would have trouble picking it out of a hypothetical lineup. Even if you’re not crazy about the ones I suggested, take a close look at them, as well as some of the Adobe ones you probably have on your computer (Adobe Garamond Pro, Adobe Jenson Pro, Myriad Pro, Chaparral Pro, etc.). Try to get a sense of the little differences that make each unique. Maybe then you’ll see what I mean: Lynn just isn’t an especially interesting design, which is exactly what you need for a typographic logo. Possibly others can explain what I’m trying to say by agreeing or disagreeing with me.\n\n"
    },
    {
      "time": " 21.Feb.2007 6.45am",
      "content": "“I still have the problem of not learning much from the logos about the company.” I think sometimes, the logo doesn’t have to give away too much. It might just give off a sense of something e.g elegance, sophistication etc, and not much else. If you want to convey something authoritative, then going down the simplistic route i.e typographic, is a good way to go. Unfortunately, this then leads to the problem mentioned above that it can be difficult to differentiate it from other identities, making it not particularly memorable.\n\nMaybe you could alter the font in someway to subtly (as auricfuzz is saying) communicate more. For example, you could try altering the counter of the ’R’ or the ’A’ into the shape of a diamond or jewel. I’m not saying this is the correct way to go, but offers the viewing public an extra dimension to aid with communication.\n\nI too don’t particularly love or hate the chosen font, and in my opinion having the caps all the same height would look better.\n\nHope this is of some use?\n\nDave\n\n"
    },
    {
      "time": " 21.Feb.2007 8.27am",
      "content": "Thanks guys, I really appreciate the feedback! I will look more carefully at some more typefaces to use. Re: the freehanded strokes - these are just concepts and I will clean up the “winner”. :)\n\nWhitePepper hit the nail on the head for what I was getting at. I am not trying to say anything at all about what the company \\*does\\*, hence the lack of any symbols. The big names (Tiffany, DeBeers) don’t say anything, either. The name is what they sell, and the name is who they are. If DeBeers dcided to get into fragrances and dump diamonds, the transition would work fine, and it would be the New Hot Stuff, I bet. It’s all the name.\n\nBut then, I am told the typeface is not memorable, so I need to work on that, if I’m trying to sell the name. :p\n\nThe other designs I showed, I was afraid their strike-throughs were \\*too\\* interesting, to the point that they were distracting and not clean enough.\n\nDoes anybody have comments on why DeBeers’ and Tiffany’s typefaces work? (and by contrast, mine doesn’t?)\n\np.s. - why Avari would be better than the other jewelers? No clue. The owner didn’t have a real answer. Without disclosing confidential information, he just has a different business plan.\n\n"
    },
    {
      "time": " 21.Feb.2007 8.39am",
      "content": "De Beers and Tiffany & Co. have millions (billions?) of dollars to pour into making sure you associate their names with jewellery. I don’t think we’re going to see “Breakfast at Avari’s” coming to theatres anytime soon, so you might want to consider creating a simple mark to go along with the logotype. Maybe something as simple as using a small diamond shape (i.e. a lozenge, not a cut diamond) in place of the ’A’ crossbar could work.\n\n- Lex\n\n"
    },
    {
      "time": " 21.Feb.2007 8.39am",
      "content": "I looked at those other fonts you suggested, and I looked at Lynn. I think I see what you mean by “memorable” - or what might make a font memorable.\n\nI don’t think those other fonts are good choices for this company, as I don’t think they are serious enough - I want something serious. Austere, almost. Something so rich and so wealthy, they don’t have the strength to smile anymore. :p\n\nBut I think what makes them more memorable, or interesting, is they seem to make more use of contrasting hard lines and curved edges. Lynn seems to be very straight-forward. I think Lynn has the correct feel, in the sens of severity and seriousness, all business, but now I think i’m growing to dislike, because of what you said... :)\n\nWhat do you think I can do about the cross-through on the A? I don’t want to distract too much, but I want to keep it interesting.\n\nAlso, what do you think of Trajan? I think aviano is a little bit wide, though maybe that gives a stronger look.\n\n"
    },
    {
      "time": " 21.Feb.2007 11.41am",
      "content": "Some problems with the strokes:\n\n3’s curve tapers severely.  \n2 feels knocked to the left of A’s center  \n1 is very long,irregular and has no logical ending.\n\nWhen you change one letter, adapt the other letters to relate.\n\nDoyald Young’s work may provide some idea’s for you.\n\n"
    },
    {
      "time": " 22.Feb.2007 7.34am",
      "content": "So I decided to go with aviano as the typeface of this logo... Attached are three versions of the logo and my attempts to make it original.\n\nc&c please! :)\n\n ![](http://web.archive.org/web/20071217131002im_/http:/www.typophile.com/files/notFinal-04_6723.jpg)\n  \n\n ![](http://web.archive.org/web/20071217131002im_/http:/www.typophile.com/files/notFinal-05_6367.jpg)\n  \n\n ![](http://web.archive.org/web/20071217131002im_/http:/www.typophile.com/files/notFinal-06_4304.jpg)\n\nthanks!\n\n"
    },
    {
      "time": " 22.Feb.2007 4.48pm",
      "content": "I find the As distracting.\n\nAlso not sure if you really require a large cap with the small.\n\nIn this word the flourish on the R seems a little out of place against the rigidity of the other letterforms - that’s not to say it can’t work.\n\n—————  \n**Paul Ducco**  \n [Design, Melbourne](http://web.archive.org/web/20071217131002/http:/www.solid-creative.com/print.htm)  \n—————  \n [Little Mischief](http://web.archive.org/web/20071217131002/http:/www.littlemischief.com/)\n\n"
    },
    {
      "time": " 22.Feb.2007 5.44pm",
      "content": "I have to be honest — I wasn’t so sure that Aviano would work for your logo, but you’ve won me over. I like these _much_ more than your previous attempts. I like 2 and 3 better than 1 — and maybe 3 slightly more than 2.\n\nI would suggest two things. First, even though Aviano seems better balanced than when you were using faux small caps, I’d still prefer if you made all the letters the same height. I think that having all capitals instead of small caps makes the design look classier and more timeless. Second, I can’t be sure, but it looks like the diamond crossbar of the second A is slightly smaller than that of the first. I’d suggest you make them both the same size, even if you decide to keep the first A capital and the second A small cap.\n\nAlso, to clarify my earlier statements — I wasn’t necessarily suggesting that the logo needed to tell a whole story and be overwhelming in its symbolism. My problem was that looking at the previous logo, I didn’t really “get” anything about the company, which to me suggests that the logos weren’t distinctive or memorable enough. The flat diamond crossbars and the crossbar-less R just seem to work to make the new logo something I could associate with the company.\n\n"
    },
    {
      "time": " 22.Feb.2007 6.39pm",
      "content": "@auricfuzz: thank you for clearing that up! That makes much more sense, and I do agree with you!\n\nAlso, I think the issue now with small caps is that it is too distracting. Given the diamond shape in the “A” letterforms, and the R, the different size letters just becomes too much. Thanks for the suggestion!\n\nAttached are three new versions - I also adjusted the height somewhat, and changed the R a little bit.\n\n ![](http://web.archive.org/web/20071217131002im_/http:/www.typophile.com/files/notFinal-07_5604.jpg)\n  \n\n ![](http://web.archive.org/web/20071217131002im_/http:/www.typophile.com/files/notFinal-08_5489.jpg)\n  \n\n ![](http://web.archive.org/web/20071217131002im_/http:/www.typophile.com/files/notFinal-09_4031.jpg)\n\nthanks so much for all the critique and feedback! Keep it coming! :)\n\n"
    },
    {
      "time": " 22.Feb.2007 7.23pm",
      "content": "Even better, I think! I can’t actually see what the difference is between 1 and 2, but I like both of them better than 3; re-adding part of the R’s bowl ruins the smoothness of the character and makes it seem like you somehow grafted the leg onto it.\n\nOnly thing I can see now is that maybe there’s too much space between the A’s and the V. The “AV” combination is always tricky, but to me it seems like there’s a bit too much space there. But that’s for you to tweak and figure out what looks best.\n\n"
    },
    {
      "time": " 23.Feb.2007 1.07am",
      "content": "Yep, the same size cap height works - this is much nicer!\n\n"
    },
    {
      "time": " 23.Feb.2007 11.26am",
      "content": "the diff between 1 and 2 is I scaled #2 up a bit - I thought aviano was a little bit squished.\n\n"
    },
    {
      "time": " 23.Feb.2007 6.20pm",
      "content": "Now that you mention it, I do see what you did, and I like your mild vertical stretching.\n\nIn case you’re interested, [this](http://web.archive.org/web/20071217131002/http:/typophile.com/node/31056) is the thread in which the rough version of Aviano was first posted and critiqued. Others also weren’t huge fans of its wide extension.\n\n"
    },
    {
      "time": " 24.Feb.2007 8.23pm",
      "content": "Well, I’ve decided I don’t like the aviano typeface. At least, not for the purposes of this logo. I think it’s too “busy’ - too many things sticking out. I like certain aspects of it, and I like LYNN, as well, in certain regards. I think I’m going to go all out and make something from scratch...\n\nthanks for your comments and critiques, everyone! I really appreciate! I hope to update you all soon on the new logo! :)\n\n"
    },
    {
      "time": " 12.Mar.2007 1.34pm",
      "content": "Are you aware of a font collection by House Industries that fits perfectly in your research?\n\n[House Industries Luxury Fonts](http://web.archive.org/web/20071217131002/http:/www.houseind.com/index.php?page=showfont&id=536)\n\n"
    }
  ]
}
