{
  "id": "31602",
  "title": "Jury announced for 2007 Contemporary Letterpress Exhibition",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "With the deadline little over a week away, Gallery 51 is pleased to introduce you to our jury for the 2007 Contemporary Letterpress Exhibition.\n\nDeborah Rothschild  \nDr. Rothschild is senior curator for modern and contemporary art at the Williams College Museum of Art in Williamstown, Massachusetts. She earned her Ph.D. and MA. at the Institute of Fine Arts, New York University. She also received a certificate in museum studies from the Metropolitan Museum of Art.  \nA specialist in early 20th century and contemporary art, Dr. Rothschild has overseen more than 50 exhibitions, organizing shows of work by James Turrell, David Hammons, Adrian Piper, Tony Oursler and many other living artists as well as numerous historical exhibitions. She has contributed articles and reviews to The Metropolitan Museum Journal, The Art Journal, The Virginia Quarterly Review, Arts Magazine, and Gastronomica.  \nDr. Rothschild co-organized the exhibition and catalogue, Graphic Design in the Mechanical Age: Selections from the Merrill C. Berman Collection (New Haven, Yale University Press, 1998) which toured nationally and internationally. The catalogue was translated into Spanish and Japanese and was honored with a number of awards including the I.D. Annual Design Review Award\n\nNato Thompson  \nMr. Thompson is Curator at the Massachusetts Museum of Contemporary Art. There he has organized five large-scale exhibitions, “Training Ground for Democracy.”(currently on view),“Ahistoric Occasion” (2006), “Becoming Animal: Contemporary Art in the Animal Kingdom” (2005), “The Interventionists: Art in the Social Sphere” (2004), and “Fantastic” (2003).  \nHis writings appear in numerous contemporary art journals including Tema Celeste, Parkett, Art Journal, and the Journal of Aesthetics and Protest. His 2004 essay “Strategic Visuality: A Project by Four Artist/Researchers” won the prestigious Art Journal award.&nbsp; With Gregory Sholette, he is co-editor of The Interventionists: A Users Manual to the Creative Disruption of Everyday Life and edited the exhibition catalog Becoming Animal, both published by the MIT Press. Nato Thompson holds a Master in Art Administration from the School of the Art Institute of Chicago.\n\nAnthony Gengarelly  \nDr. Gengarelly currently chair of the Fine & Performing Arts department at the Massachusetts College of Liberal Arts. He holds master’s degrees from Yale and Williams College, and a doctorate from Boston University. He has curated art exhibits and created published essays focusing on the Prendergasts, American landscape painting, the image of women in the 19th century, the works of Leonardo da Vinci, Winslow Homer, civil rights, and Navajo art. Dr. Gengarelly teaches a wide array of art history and museum studies courses at the college.\n\nDan Wallis (organizer)  \nMr. Wallis is design director at Orbit Visual Communications. He studied graphic design at the Massachusetts College of Art and museum studies at Harvard University. He works extensively with arts, cultural and educational institutions through-out the United States and abroad.\n\nThe deadline for submitting work to the Contemporary Letterpress exhibition is February 28, 2007. Entry forms in PDF format may be downloaded directly from [www.contemporaryletterpress.com](http://web.archive.org/web/20070225010926/http:/www.contemporaryletterpress.com/).\n\nShould you have any questions please feel free to contact us. We look forward to seeing your very best work.\n\nWith regards,  \nDan Wallis  \nDesign Director  \nOrbit Visual Communications  \n413-662-2742 xt.113\n\n",
  "author": "<a href=\"user/16766\" title=\"View user profile.\">d wallis</a>",
  "time": "<br>",
  "uid": "16766",
  "comments": [

  ]
}
