{
  "id": "3161",
  "title": "Type For Book on David Hockney",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I am doing a book on david hockney and am in the process of selecting a text face. What faces would help me compliment his art and at the same time be readable? Thanks.   \n   \nSo far im playing with proforma, eldeticneo, serifa, and scala sans.\n\n",
  "author": "vwcruisn",
  "time": "16 Feb 2004 — 6:40pm",
  "uid": "1938",
  "comments": [
    {
      "time": "16 Feb 2004 — 8:54pm",
      "content": "What is David Hockney about?   \nWhat is the target demographic/usage of the book?   \nWhat's the format? Length, page size, paper stock, illustration ratio, etc.   \nHow important is readability versus aesthetic expression?   \n   \nBTW, of those four Serifa and Scala Sans have inadequate readability (for book-length work); Proforma could work if the point size is big enough or the paper a bit rough; and Eidetic is mannered but functional.   \n   \nhhp\n\n"
    },
    {
      "time": "16 Feb 2004 — 11:54pm",
      "content": "the book is basically a retrospective on the work of hockney... one of the most famous pop artists. the book will be square.. 8.75\" in each direction. About 64 pages and the illustraion to text ratio will be about 30% tops favoring text.   \n   \nwell i originally wanted to go sans serif.. but maybe serif will be better in the long run and allow me to match it up with a nice sans for the headers etc. this is a school project that i will probably be putting in my portfolio and will be output on an inkjet so the face will have to be a bit forgiving. Would proforma do well for this book as a text face? So far it is the face I am leaning to. It will be used at 8, maybe 9 point. Also, what would you recommend for a face that will work well with it for headers?\n\n"
    },
    {
      "time": "17 Feb 2004 — 3:29am",
      "content": "Jason, I would lean towards a serif face to contrast with the pop art. Try to go at least 9pt and please have good leading and lots of white space. Art books are for looking at the art, not the art of the type.\n\n"
    },
    {
      "time": "17 Feb 2004 — 10:52am",
      "content": "Daniel.. i agree.. the only thing is... this is for a class called \"book typography\" so I chose to make the book less about his art and more about his life so that I would have a little more wiggle room with type, thats why im pushing really hard to select some really good faces that might not be as well known as what the other kids are using (garamond, univers, gill sans etc.)   \n   \nI'm thinking I should crack open my Indie Fonts books and find something to use for chapter openings/headers.\n\n"
    },
    {
      "time": "17 Feb 2004 — 11:30am",
      "content": "Jason, look at Font Diner for some fun headline fonts. I love Stuart's work.\n\n"
    },
    {
      "time": "17 Feb 2004 — 1:35pm",
      "content": "It seems there isn't a huge amount of text. This means you have more leeway in terms of sacrificing a bit of readability. So a sans -a good one- might be fine, although it's not easy to find a texty sans with enough character to \"carry\" a book about a pop artist. Look at Quadraat Sans, or maybe some of Storm's fonts.   \n   \nProforma will not be very happy when set small, since it's a bit narrow and has a modest x-height. But it's actually the kind of font that can support a 5% width increase, and if you choose a darkish weight and track it looser it might work out very well. For a companion, look at FB's Amplitude.   \n   \nhhp\n\n"
    },
    {
      "time": "17 Feb 2004 — 1:41pm",
      "content": "sorry, i meant that the book will be 30% image and 70% text... i will check out storms fonts in a minute.. thanks for all the suggestions ![:-)](http://web.archive.org/web/20131017130659im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "18 Feb 2004 — 1:40am",
      "content": "ahh quadraat sans sets quite nicely... i just ran some tests with it. I'm having a bit of a problem pairing it with a display face... would amplitude work with this one? Any other alternatives? Maybe just a bolder version of the font? or the serif version? I think I am overwhelming myself with possibilities, I have a hard time narrowing down my decisions. I love this site, Ive been spending waaaay too much time here ![:-)](http://web.archive.org/web/20131017130659im_/http:/www.typophile.com/forums/clipart/happy.gif)\n\n"
    },
    {
      "time": "18 Feb 2004 — 2:52pm",
      "content": "I don't think Amplitude would work with Quadraat - you need something more \"lyrical\".   \nWhat about Quadraat Headliner? Its gargantuan x-height gives it a unique look.   \n   \nhhp\n\n"
    }
  ]
}
