{
  "id": "31617",
  "title": "(x) Saudek book serif faces - Sabon Next {Stephen (via Mike Y)}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello,\n\nI’ve been wondering for a while which typeface(s) was used in a book about Saudek by Taschen.  \nI have two images, one of the cover, with an italic. And one (unfortunately small) image from two pages, with a swashed-serif.  \nIdentifications would be appreciated a lot. :)\n\nThanks.\n\n| Attachment | Size |\n| --- | --- |\n| [fo\\_saudek\\_new\\_04.jpg](http://web.archive.org/web/20070911195008/http:/typophile.com/files/fo_saudek_new_04.jpg) | 23.04 KB |\n| [saudek.jpg](http://web.archive.org/web/20070911195008/http:/typophile.com/files/saudek.jpg) | 30.73 KB |\n\n [‹ Bumble typeface](http://web.archive.org/web/20070911195008/http:/typophile.com/node/31980 \"Go to previous forum topic\") [(x) Will Hill \"Le langage de la typographie\" typographic book cover type - Agenda {Niall Moran} ›](http://web.archive.org/web/20070911195008/http:/typophile.com/node/31979 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911195008/http://typophile.com/user/14604\" title=\"View user profile.\">Quincunx</a>",
  "time": "<br>",
  "uid": "14604",
  "comments": [
    {
      "time": " 20.Feb.2007 9.48am",
      "content": "Hoefler\n\n"
    },
    {
      "time": " 20.Feb.2007 10.04am",
      "content": "Hm, it doesn’t seem to be Hoefler. If you mean Hoefler Text. The ’k’ is very different on the cover.\n\n"
    },
    {
      "time": " 20.Feb.2007 10.36am",
      "content": "Yes, I see what you mean, although the other letters are uncannily similar... maybe a bit of tweaking went on in illustrator/freehand?\n\nthe inside text is almost certainly adobe garamond regular alternate\n\n[http://www.linotype.com/8508/adobegaramondregularalternate-font.html](http://web.archive.org/web/20070911195008/http:/www.linotype.com/8508/adobegaramondregularalternate-font.html \"http://www.linotype.com/8508/adobegaramondregularalternate-font.html\")\n\n"
    },
    {
      "time": " 20.Feb.2007 11.04am",
      "content": "The inside text does indeed seem to be garamond alt. Already thought it would be a ’doh’ experience, although I didnt really had the chance to look at the inside too well.\n\nNow only the cover face... if it really is an altered Hoefler Text ’k’, then they did a good job..\n\n"
    },
    {
      "time": " 20.Feb.2007 3.08pm",
      "content": "No one? ;)\n\n"
    },
    {
      "time": " 20.Feb.2007 6.09pm",
      "content": "The swashed ’e’ reminds me of [Galliard](http://web.archive.org/web/20070911195008/http:/www.flickr.com/photos/stewf/376726776/).\n\n"
    },
    {
      "time": " 21.Feb.2007 5.57am",
      "content": "Ah, a friend of mine also thought it looked more like Galliard then Garamond alt.\n\nThough the cover italic seems to be a different typeface.\n\n"
    },
    {
      "time": " 21.Feb.2007 7.18am",
      "content": "The most obvious problem with the Galliard theory is that it doesn’t match except for a similarity in the alternate characters. Look at the J and W, for example.\n\nI think the answer is [Adobe Garamond](http://web.archive.org/web/20070911195008/http:/www.myfonts.com/fonts/linotype/adobe-garamond/), which has the right alternate characters, like the a, e, n and ct ligature, as well as the same J and W.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 21.Feb.2007 7.20am",
      "content": "In other words, Brett was right.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 21.Feb.2007 7.33am",
      "content": "I think ’Saudek’ on the cover is _almost_ Garamond, but the Garamond S doesn’t have those serifs. I think it may be [Sabon Bold Italic](http://web.archive.org/web/20070911195008/http:/www.myfonts.com/fonts/linotype/sabon/) that has been bolded further, with extra stroke thickness.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 21.Feb.2007 9.55am",
      "content": "The Sabon ’k’ looks more like the bookcover. But it indeed must have been bolded futher.\n\nI went to the bookstore today, and looked at the inside a bit better, and the texts are indeed Adobe Garamond, with swashed alternates. Funny thing about it, they set _all_ texts with the swashes...  \nI would have known it was Garamond if I had looked better, but I was more after the cover, really. And that ’k’ just didn’t look like Garamond.\n\n"
    },
    {
      "time": " 22.Feb.2007 9.15am",
      "content": "OK, i’m going to have to stop wrestling with this one... it really does look like some kind of variation on Hoefler black italic, but the S and the k are different... sigh...\n\n"
    },
    {
      "time": " 22.Feb.2007 3.25pm",
      "content": "Hehe, well I made a (bad) photo with phone. Cut and edited in ps.  \nSo maybe someone will recognise the face someday. :)  \nSomehow the background doesn’t look like it comes from an art-photography book anymore with this crop, but okay.\n\n ![](http://web.archive.org/web/20070911195008im_/http:/typophile.com/files/saudek-artbookcover_4488.jpg)\n\n"
    },
    {
      "time": " 23.Feb.2007 5.47am",
      "content": "Here is a simulation of Saudek made using Monotype Sabon Semibold Italic. I added 2.5 pts of stroke thickness and tightened the tracking for the last 4 letters so that they touched. I think the serifs would not have been as blunted if the Bold weight was used, but apparently that’s not in the Monotype version of Sabon. I also expect the letterform variation would be less if the proper starting weight was used.\n\nI think this makes a case that ’Saudek’ on the cover is made from Sabon with some graphic manipulation.\n\n- Mike Yanega\n\n ![](http://web.archive.org/web/20070911195008im_/http:/typophile.com/files/SAudekSim_4876.gif)\n\n"
    },
    {
      "time": " 23.Feb.2007 6.54am",
      "content": "Yes, it does look very close. It may indeed be a manipulation. And if so, a very good one at that.\n\nI might contact the publisher about it sometime. Because now I really want to know.\n\n"
    },
    {
      "time": " 23.Feb.2007 8.16am",
      "content": "I was playing with it some more, and it looks even closer with 5 degrees of added slant. I would have to restart my computer to post the revised image, but maybe you will accept my word. I feel quite convinced that this is created from Sabon.\n\n- Mike Yanega\n\n"
    },
    {
      "time": " 23.Feb.2007 8.32am",
      "content": "It’s [Sabon Next](http://web.archive.org/web/20070911195008/http:/www.linotype.com/53159/sabonnext-family.html) Extra Bold Italic. Thank you, Mike, for doing the research that led me to check Sabon Next. Usually, if a sample is this close to a typeface, but with this many modifications, it’s more likely that it’s a similar typeface rather than something custom because of the work required to do it right.\n\nI wouldn’t be surprised to see the rest of the book is also set in Sabon Next — it’s got swash ’e’s.\n\n ![](http://web.archive.org/web/20070911195008im_/http:/typophile.com/files/mls-2_5308.png)\n\n"
    },
    {
      "time": " 23.Feb.2007 9.10am",
      "content": "That’s it, Stephen. Thanks very much.\n\nThe inside might very well be Sabon Next as well, I wouldn’t be able to tell, because I don’t really know the distinctive differences between the two.  \nBut this face defenitely looks better then Adobe Garamond (the italics anyway, imo of course), when inspected closely like this.\n\nAnother mystery solved! ;)\n\n"
    },
    {
      "time": " 5.Mar.2007 5.08am",
      "content": "Sorry for upping the thread,  \nbut I wanted to say that just before Stephen identified the face,  \nI e-mailed the designer of the book.  \nI just got an answer today (after a week or so), and the typeface is indeed, as we already know now, Sabon Next, Extra Bold Italic.\n\nJust wanted to post, for good measure.\n\n"
    }
  ]
}
