{
  "id": "31636",
  "title": "Doing things to Text in Illustrator.",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hey all im trying to find a tutorial that can allow me to curve the baseline but leave the X-height alone kind of thing in Illustrator. I feel that this should be pretty simple in illustrator, but its one of those things I have never had to do. A link to a tutorial would rule. I will make you coffee next time your jantzen beach. Thanks Casey.\n\nI provided a link to show what Im talking about. Mainly with “Rose Festival”.\n\n| Attachment | Size |\n| --- | --- |\n| [rosefestival4.jpg](http://web.archive.org/web/20071201005747/http:/typophile.com/files/rosefestival4.jpg) | 57.32 KB |\n\n [‹ history of u.s. highway fonts?](http://web.archive.org/web/20071201005747/http:/www.typophile.com/node/31663 \"Go to previous forum topic\") [Sanskrit guitar inlay ›](http://web.archive.org/web/20071201005747/http:/www.typophile.com/node/31676 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071201005747/http://www.typophile.com/user/10896\" title=\"View user profile.\">Marseille</a>",
  "time": "<br>",
  "uid": "10896",
  "comments": [
    {
      "time": " 21.Feb.2007 2.11am",
      "content": "Good mornin,\n\nI don’t know about a tutorial, but may i suggest messing around with the envelope distort option in the object menu. You have the option to make with warp, or to make with mesh. The warp gives you some basic shapes that it’ll distort to, which you can then mess with afterwards by using the white arrow to pull individual points on the mesh. However make sure you choose the colour of the text first as you’ll be unable to do so afterwaards without expanding the object.\n\nGood luck.\n\nGraham\n\n"
    },
    {
      "time": " 21.Feb.2007 8.56pm",
      "content": "Thanks!\n\nI could kiss you!\n\n"
    },
    {
      "time": " 24.Feb.2007 12.30pm",
      "content": "Leslie Cabarga’s book <cite>Logo, Font, and Lettering Bible</cite> has a whole slew of lessons on how to do this very thing in illustrator and look like a pro. The book is super, amazingly highly rated by me and others here on Typophile. Check it out.\n\n"
    }
  ]
}
