{
  "id": "31638",
  "title": "Preferred tool for digital art work",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": " **I’m afraid I’ll get chronic pain in my arm if I don’t change from working with a mouse soon. Intense – and monotonous – typographic design work _&c_ tend to really be a killer. I do switch from right to left from time to time if i’m not too stressed, but I’d like to make a leap from mouse to some kind of stylus tablet.**\n\nWhat is your experience and recommendations?\n\nYours\n\nƒ\n\n [‹ Hirakaku Pro W3 - Japanese Font](http://web.archive.org/web/20080615181214/http:/www.typophile.com/node/31640 \"Go to previous forum topic\") [Really, what's the point? ›](http://web.archive.org/web/20080615181214/http:/www.typophile.com/node/31621 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080615181214/http://www.typophile.com/user/7230\" title=\"View user profile.\">fredo</a>",
  "time": "<br>",
  "uid": "7230",
  "comments": [
    {
      "time": " 21.Feb.2007 3.36am",
      "content": "I love my mouse... it’s not necessarily about a mouse per se but a holistic combo of what sort of mouse it is, how you use it, click speeds, movement speeds across the screen, how high you are relative to your desk, how straight/bent your arm is, how far you are form your screen etc. I’m left-handed but still use right handed button settings - works for me. Sorry, not very helpful.\n\n"
    },
    {
      "time": " 21.Feb.2007 3.37am",
      "content": "First off you may have a serious medical condition that may need to be checked by physician- Carpal Tunnel Syndrome, Tendonitis, or something worse.\n\nI would suggest to relax your grip on what ever tool you are using- mouse or otherwise. Soft click as opposed to hard ones. Make hard fists every so often. Wiggle your fingers and take stretch breaks too.\n\n[http://en.wikipedia.org/wiki/Repetitive\\_strain\\_injury](http://web.archive.org/web/20080615181214/http:/en.wikipedia.org/wiki/Repetitive_strain_injury \"http://en.wikipedia.org/wiki/Repetitive\\_strain\\_injury\")\n\nAlso you may consider consulting with an expert in office ergonomics... its a tax write off for sure and these people can help you situate your office in way that will be more productive and healthy for you..\n\nI live with chronic pain too ( not from computers ) so I can relate to how you feel. I hope you find a way to ease your symptoms.\n\nMikey\n\n"
    },
    {
      "time": " 21.Feb.2007 4.24am",
      "content": " **Our office masseuse will be here this friday, she knows a lot about ergonomics. Last time she recommended me some kind of wacom tablet, but for the specifics I rely on You. I don’t want to get Tendonitis!**\n\nƒ\n\n"
    },
    {
      "time": " 21.Feb.2007 6.00am",
      "content": "I have a little optical track ball. I’ve been on the ball for a very long time and find it better all around. I do use the software to tune it, so slight motions are slowed down even more and quick motions cover lots of area.\n\n"
    }
  ]
}
