{
  "id": "31663",
  "title": "history of u.s. highway fonts?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "hello, i am a journalist/grad student in new york working on an article about typography on the highway. am trying to track development of highway fonts, specifically the creation of fhwa series fonts (also known as highway gothic). all i have been able to determine is that highway gothic seems to have come out of caltrans research in 1940s and 50s, but nothing beyond that. but information on any of the different fonts that have been used on the highway would be great.\n\ni have contacted caltrans library, other transportation research centers, done all the database searches, etc. and can't seem to find exact inventor or any insight into the creative process behind the highway fonts we use today. the creators of clearview -- don meeker and james montalbano -- also don't know too many specifics. but maybe someone out there does? or has an idea of where to look? would be happy to talk in more detail with anyone who's interested. thanks in advance for any help.\n\njoshua\n\n",
  "author": "joshua_yaffa",
  "time": "21 Feb 2007 — 1:30pm",
  "uid": "16993",
  "comments": [
    {
      "time": "21 Feb 2007 — 1:43pm",
      "content": "There's this but it's meant as a replacement and I'm not sure it has anything to do with the current national highway signage\n\n[http://www.clearviewhwy.com/](http://web.archive.org/web/20140919041455/http:/www.clearviewhwy.com/ \"http://www.clearviewhwy.com/\")\n\n"
    },
    {
      "time": "21 Feb 2007 — 2:24pm",
      "content": "[http://typographi.com/000931.php](http://web.archive.org/web/20140919041455/http:/typographi.com/000931.php \"http://typographi.com/000931.php\")\n\n"
    },
    {
      "time": "24 Feb 2007 — 1:39pm",
      "content": "thanks for the links, i know the clearview story pretty well, that's what my article is essentially about.\n\ni'm afraid that the words of one highway engineer in texas with whom i spoke recently will prove true, \"you are asking questions that don't have any answers.\"\n\nthat said, i have spoken with the librarian at the uc berkeley transportation library, she is sending me some caltrans studies done in 30s and 40s, sounds somewhat promising from what i've heard so far. but i think it's safe to say that whomever created the fhwa fonts, it was a highway engineer and not a type designer. will let the board know what i find.\n\n"
    },
    {
      "time": "24 Feb 2007 — 3:35pm",
      "content": "At the risk of stating really obvious things you probably already found for yourself, you might want to look into published articles about Clearview, as they might contain information on the older U.S. highway signage systems.\n\nHere's a [2005 article](http://web.archive.org/web/20140919041455/http:/query.nytimes.com/gst/fullpage.html?sec=travel&res=9E0DE5D81038F932A15752C0A9639C8B63) from The New York Times, in case you haven't seen it. (I also remember that one of the design magazines ran an article on Clearview a couple of years ago -- if I can find it, I'll let you know which magazine and issue! Again, I apologize in advance if you've been down that road already -- no pun intended!)\n\n"
    }
  ]
}
