{
  "id": "31661",
  "title": "Kapitza Releases 'POP', a Pattern Font in 4 Weights",
  "forum": "Home",
  "tags": [

  ],
  "content": "FOR IMMEDIATE RELEASE  \n…………………………………………………………………………………………………….\n\nLondon 21 February 2007 – Kapitza Shop, a new online shop specialising in picture fonts and illustrations, releases the highly versatile graphic elements font Pop, designed for creating unlimited numbers of graphic patterns.\n\nPop contains 320 graphic elements in 4 weights (Pop10, Pop20, Pop30, Pop40). Each Pop element of one weight fits on top of the other weights to create new variations. In addition to this all Pop elements can be combined with each other to create an unlimited number of patterns.\n\nPetra Kapitza, one half of the Kapitza partnership talks about the inspiration for Pop: ‘We have always been fascinated by patterns. Pop was inspired by the bold and colourful fashion textiles of the sixties and seventies, particularly by their graphic simplicity, bold colours and shapes. The result is nonetheless a very modern font which makes it easy to create an endless variety of patterns of all styles, both retro and contemporary.’\n\nPOP PATTERNS  \n…………………………………………………………………………………………………….\n\nPop is also available in a variety of ready made repeat patterns in vector eps format. These patterns can be opened by any major graphics software like Illustrator and Photoshop. They can be re-sized and coloured without any loss of quality.\n\nABOUT KAPITZA SHOP  \n…………………………………………………………………………………………………….\n\nKapitza Shop ( [http://kapitza.com/shop](http://web.archive.org/web/20070302232009/http:/kapitza.com/shop)) is a new online store specialising in picture fonts and illustrations created by design partnership Kapitza [http://www.kapitza.com](http://web.archive.org/web/20070302232009/http:/www.kapitza.com/).\n\nNicole Kapitza, one half of the partnership, gives her thoughts on Kapitza Shop: ‘Our objective for the shop is to create a source of inspiration for people as well as building up a continuously growing resource of high resolution picture fonts and illustrations for designers to use in their work.’\n\nPetra Kapitza continues: ‘We are really excited about how the Shop is beginning to grow. We only publish work that we think is of the highest quality and the feedback we have been getting from our customers has been really encouraging.’\n\nHOW TO ORDER  \n…………………………………………………………………………………………………….\n\nOpenType font for Mac and PC  \nDigital download  \n4 weights £49  \n [http://kapitza.com/shop/fonts/pop](http://web.archive.org/web/20070302232009/http:/kapitza.com/shop/fonts/pop)\n\n ![](http://web.archive.org/files/pop_combinations_kapitza_6247.gif)\n\n ![](http://web.archive.org/files/pop_font_kapitza_4766.gif)\n\n ![](http://web.archive.org/files/pop_patterns_kapitza_4030.gif)\n\n",
  "author": "<a href=\"user/108\" title=\"View user profile.\">Miss Tiffany</a>",
  "time": "",
  "uid": null,
  "comments": [

  ]
}
