{
  "id": "31662",
  "title": "NEW FONT \"HELENA\"",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I created the new typo model, she calls himself \" Helena \".  \nI want that all say on the drawing of that typo.  \nHugs.\n\nMARCIO HIROSSE  \n [mhirosse@uol.com.br](mailto:mhirosse@uol.com.br)  \n [www.fabrikadetypos.com.br](http://web.archive.org/web/20150416051622/http:/www.fabrikadetypos.com.br/ \"www.fabrikadetypos.com.br\")\n\n| Attachment | Size |\n| --- | --- |\n| [Helena.jpg](http://web.archive.org/web/20150416051622/http:/typophile.com/files/Helena.jpg) | 980.52 KB |\n\n",
  "author": "mhirosse",
  "time": "21 Feb 2007 — 1:24pm",
  "uid": "3412",
  "comments": [
    {
      "time": "21 Feb 2007 — 2:36pm",
      "content": "Hello Marcio,\n\nThis strikes me as something more along the lines of custom lettering than something I would create a typeface out of. The idea of growth from the letter is fun, but the letters themselves seem very stiff. Is that Akzidenz Grotesk? I can't quite tell. You might consider having the skeleton be more humanist and letter geometric.\n\nI've also taken the liberty to re-attach the image here.\n\n ![](http://web.archive.org/web/20150416051622im_/http:/typophile.com/files/Helena_4869.gif)\n\n"
    },
    {
      "time": "26 Feb 2007 — 3:16am",
      "content": "Interesting concept, although I think that the base letters could have a more 'organic' look themselves. (Of course, I'm rather new here, so this is my first time doing a type critique...)\n\n- Richard\n\n"
    },
    {
      "time": "6 Apr 2007 — 9:30pm",
      "content": "I really like it. (Thanks, Miss Tiffany for re-attaching the image, as I got an error msg when trying to view the original.) Personally, I like the contrast between the simple letterforms and the more organic outgrowths; sort of like the letters were man-made and left out in the woods for a long time and all these things started growing out of them. Wish I could see it more clearly, and would really like to see it in color(s). What I like most about this face is that it seems you really enjoyed creating it!\n\n"
    },
    {
      "time": "8 Apr 2007 — 4:25am",
      "content": "The ornaments are really great, but I'm afraid I'm going to have to agree with the others on the used font.  \nDid you design all the ornaments yourself or just took bits & pieces from existing ornamental dingbats? I did a few \"collages\" of dingbats about 2 years ago & I wanted it to look more ornamental, but I haven't really found any nice ornamental dingbats. I used a lot of pieces from Ardenwood ( [http://www.myfonts.com/search?search%5Btext%5D=ardenwood](http://web.archive.org/web/20150416051622/http:/www.myfonts.com/search?search%5Btext%5D=ardenwood \"http://www.myfonts.com/search?search%5Btext%5D=ardenwood\")) which has an original look to it.\n\n"
    },
    {
      "time": "11 Apr 2007 — 5:05pm",
      "content": "Thank you for the praises.  \nI really had a lot of satisfaction in creating the font HELENA.  \nI made a collage of several ornaments (dingbats) with a more geometric font.  \nTo do the download (DEMO) of the font HELENA, access the site:  \n [http://www.elifont.com/font.php?font=11606](http://web.archive.org/web/20150416051622/http:/www.elifont.com/font.php?font=11606 \"http://www.elifont.com/font.php?font=11606\")  \nHugs and thank you\n\nMARCIO HIROSSE  \nFABRIKA DE TYPOS  \n [www.fabrikadetypos.com.br](http://web.archive.org/web/20150416051622/http:/www.fabrikadetypos.com.br/ \"www.fabrikadetypos.com.br\")\n\n"
    },
    {
      "time": "21 Jul 2012 — 10:40am",
      "content": "@mhirosse Just stumbled across your post while searching the forum.\n\nBeautiful ornamentation on the typeface HELENA. I'd love to see you revisit the connection points where the Terminals flow out into dingbats. The transition is a little abrupt in the image above.\n\nVery nice work.\n\n- Rusty\n\n"
    }
  ]
}
