{
  "id": "31676",
  "title": "Hindi guitar inlay",
  "forum": "Design",
  "tags": [

  ],
  "content": "_02-24-07 So now it's been determined this is Hindi_\n\nSo this is the first time I've been asked to do design work in Arabic. This is to be inlaid in mother of pearl on the ebony fingerboard at the first fret position. I'm told this translates to \"beloved.\" The final size is rather small, an area about 1.5\" x 1.0\"\n\n ![](http://web.archive.org/web/20110120033510im_/http:/typophile.com/files/JL_inlay_4671.jpg)\n\nWhat I'm looking for is font suggestions to start off the design, and once I've got it adapted for shell cutting, I'd appreciate a review to make sure I don't wind up chaging the meaning or making something that isn't even a word.\n\nA while back I received some great advice for another [inlay project](http://web.archive.org/web/20110120033510/http:/www.alembic.com/info/fc_kay.html), which I really appreciated.\n\n",
  "author": "<a href=\"/web/20110120033510/http://typophile.com/user/2127\" title=\"View user profile.\">mica</a>",
  "time": "<br>",
  "uid": "2127",
  "comments": [
    {
      "time": "",
      "content": "Why a font for a single or a couple of words?!  \n [Novelty items](http://web.archive.org/web/20110120033510/http:/typophile.com/node/29951?from=19&comments_per_page=02) need Arabic Calligraphy?\n\n"
    },
    {
      "time": "",
      "content": "The reason is that I am not familiar with these calligraphic forms, I have no experience with Arabic calligraphy. I also anticipate more requests once this work is finished.\n\nA guitar is a very personal object. The person we build it for will be touching it to express their emotions, and some of our customers decide that they want an embellishment of a personal nature. In this case, the guitar is devoted to his beloved son.\n\n"
    },
    {
      "time": "",
      "content": "[Beloved?](http://web.archive.org/web/20110120033510/http:/typophile.com/node/29951?from=19&comments_per_page=02)\n\n ![](http://web.archive.org/web/20110120033510im_/http:/typophile.com/files/Beloved_6670.jpg)\n\n"
    },
    {
      "time": "",
      "content": "I teach at a university in the middle east, and I asked one of my students if this was Arabic. It is not Arabic or Farsi. We think it might be Hindi or Urdu.\n\n"
    },
    {
      "time": "",
      "content": "It is readable to Arabs, Persians, Urdu-Speaking and most [Malays](http://web.archive.org/web/20110120033510/http:/senikhat.ejawi.net/forum/index.php)  \nI am sure your student does understand [A](http://web.archive.org/web/20110120033510/http:/typophile.com/node/19609), [B](http://web.archive.org/web/20110120033510/http:/typophile.com/node/19348), [+ C](http://web.archive.org/web/20110120033510/http:/typophile.com/node/30023)?!  \nbut may be too fonty to say it — Mahboob=Beloved — loud?!\n\n"
    },
    {
      "time": "",
      "content": "I wouldn't ever dream of designing an Arabic (or any other non-Latin/Greek script) logo myself. [This site](http://web.archive.org/web/20110120033510/http:/www.hanzismatter.com/) isn't about Arabic, but it points out the difficulties in trying to design for a language you don't speak (with unintentionally funny results).\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "i believe the original sample you posted is Sanskrit.  \ni have studied Sanskrit and i recognize the forms but i am no authority.\n\ni suggest you post it to The American Sanskrit Institute for translation.\n\n[http://www.americansanskrit.com/](http://web.archive.org/web/20110120033510/http:/www.americansanskrit.com/ \"http://www.americansanskrit.com/\")\n\n"
    },
    {
      "time": "",
      "content": "Thanks all for the help - indeed, this is Sanskrit! I had confused some of the several samples I was supplied.\n\nIt is daunting to prepare artwork in a language I am unfamiliar with, and you can tell from my first post on this thread that I certainly don't want to wind up with some unintentional design.\n\n"
    },
    {
      "time": "",
      "content": "\\* Jonathon, Sorry for misunderstanding your comments.  \n\\* Mica, I thought that you were after the translation+Inscription of the word in Arabic. If otherwise, please do not forget to change the title into \"Sanskrit Guitar inlay\"?!  \nThanking+Apologizing to All Typophiles\n\n"
    },
    {
      "time": "",
      "content": "Thanks, Aziz. In the olden days of Typophile, only a moderator could change the title. If this project gets the go-ahead, I'll start another thread with the design details.\n\n"
    },
    {
      "time": "",
      "content": "check out American Sanskrit Institute anyway - they could guide you on some of the precise nuances of the forms. the sample you posted is rather worn. in india i was fascinated by the font variations in a language i can barely read (hindi, which is based on sanskrit).\n\nthere are peculiar curves to some of the letters which distinguish them from very similar ones, sort of like our: i and j or: a and d.\n\n"
    },
    {
      "time": "",
      "content": "The intaglio word in the picture shown above is spelled \"bhakti\" and does not exactly mean \"beloved\", but more precisely \"love\" (or devotion etc.) in Hindi.\n\nIf it were Sanskrit, the word would have a so-called visarga (which looks like a colon or two dots) at the end of the word and would look this way\n\n[http://www.sanskritweb.net/temporary/bhakti.pdf](http://web.archive.org/web/20110120033510/http:/www.sanskritweb.net/temporary/bhakti.pdf \"http://www.sanskritweb.net/temporary/bhakti.pdf\")\n\nAs regards fonts, you can start at my website with Itranslator 2003 software which can also be used with any other Devanagari Unicode fonts. Such other fonts are listed in my documentation\n\n[http://www.sanskritweb.net/itrans/itmanual2003.pdf](http://web.archive.org/web/20110120033510/http:/www.sanskritweb.net/itrans/itmanual2003.pdf \"http://www.sanskritweb.net/itrans/itmanual2003.pdf\") (page 44 seq.)\n\n"
    }
  ]
}
