{
  "id": "31682",
  "title": "straight-sided compact sans used on Spice Girls logo and record labels",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "After years looking for the name of this typeface, I've diceded to beg help for some people here. I'm looking for the name (only the name) of this typeface: [http://lonestarspice.com/singles/suyluscd.JPG](http://web.archive.org/web/20110622195439/http:/lonestarspice.com/singles/suyluscd.JPG \"http://lonestarspice.com/singles/suyluscd.JPG\")\n\nIt has a particular and peculiar kind of \"S\" that we cannot find in many typefaces. I know it is not a custom design because I often find it in some posters or book covers, but none of these sourcers tells the name of this type.\n\nThis typeface was used many times as the Spice Girls logo on their first and second CD's and, if I'm not wrong, it is used in the Panini Comics logo [http://www.paninicomics.co.uk/Home.jsp]  \nLower case sample here: [http://lonestarspice.com/albums/spicemd2.jpg](http://web.archive.org/web/20110622195439/http:/lonestarspice.com/albums/spicemd2.jpg \"http://lonestarspice.com/albums/spicemd2.jpg\")\n\nCan anyone help me solve this mistery? I'll be glad to have opinions that leads me to an answer.\n\nThanks for the attention.\n\n",
  "author": "<a href=\"/web/20110622195439/http://typophile.com/user/17014\" title=\"View user profile.\">neri856</a>",
  "time": "<br>",
  "uid": "17014",
  "comments": [
    {
      "time": "",
      "content": "It's similar to [Europa Grotesque](http://web.archive.org/web/20110622195439/http:/www.myfonts.com/fonts/redrooster/europa-grotesque-rr/).\n\n- Mike Yanega\n\n"
    },
    {
      "time": "",
      "content": "Actually it's similar to many kinds of typefaces, but the one I'm looking for has a peculiar kind of \"S\" that I just cannot find...\n\n"
    },
    {
      "time": "",
      "content": "Jay Gothic is close as well but its not it\n\n"
    },
    {
      "time": "",
      "content": "I assume that the SPICE logo is what you are really after? I ask because none of that other text appears to use the same typeface (just compare those S's, for one thing).\n\nDoes anyone have a showing of a predigital typeface called Tempor? The Solotype Catalog has only a very limited showing, but what it does show makes it a possibility.\n\n"
    },
    {
      "time": "",
      "content": "I have almost all the alphabet for this typeface, I'll try to post it real soon.\n\n"
    },
    {
      "time": "",
      "content": "Hi Adriano,\n\nI am also trying to identify the typeface used on most of the Spice Girls album covers and merchandise. I have searched everywhere trying to find this font but have had no luck. I was just wondering if you happened to figure out what typeface it is? If so, could you please tell me the name of it and where you found it? If not, perhaps we could compare notes and hopefully figure out what font it is. Feel free to contact me (just click on my name.) Any help you could give me would be greatly appreciated. I look forward to hearing from you.\n\n"
    },
    {
      "time": "",
      "content": "Hi people i'm searching too the typeface used on the spice girls albums and all the merchandising without any results. I'm totally agree with all of u. And all i've found until now it's an a video on facebook with that font all wrote in spanish and a album of a spanish singer called \"el junco\" and there's that font too. If u know o find anything about that font please tell me.\n\nAnother thing, do you know what is the font used on the Spiceworld album (SPICE characters)\n\nThank you for all your references you're really good!!\n\n"
    }
  ]
}
