{
  "id": "31685",
  "title": "Addison Hall Design self-identity",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is something I've been driving myself insane over for the past few months -- I'm simply looking for guidance and advice, or whether or not I should even pursue this direction...\n\nI started my freelance business close to two years ago. At the time I wasn't too concerned with my identity (big mistake) so I quickly created something that I've had trouble living with lately. I've already [questioned it once here on typophile](http://web.archive.org/web/20131019062724/http:/typophile.com/node/15365). Since then, I've constantly tinkered and doodled trying to come up with something new, and I've finally come up with a mark that I'm happy with -- at least I think so.\n\nMy business has migrated almost entirely into website design and development, and I'm one of those standards-based nuts. I want to give a feeling of pride and craftsmanship about my work -- you know, the little guy who sits in his shop and creates handmade goodness -- but I want to avoid the web 2.0 look.\n\nAny and all comments are most appreciated.\n\nThanks,  \nAddison\n\n| Attachment | Size |\n| --- | --- |\n| [old-new-comparison.gif](http://web.archive.org/web/20131019062724/http:/typophile.com/files/old-new-comparison.gif) | 7.08 KB |\n| [new-with-revisions.gif](http://web.archive.org/web/20131019062724/http:/typophile.com/files/new-with-revisions.gif) | 7.38 KB |\n| [new-with-revisions.pdf](http://web.archive.org/web/20131019062724/http:/typophile.com/files/new-with-revisions.pdf) | 563.41 KB |\n| [new-with-revisions-2.gif](http://web.archive.org/web/20131019062724/http:/typophile.com/files/new-with-revisions-2.gif) | 6.53 KB |\n| [business-card-v1.gif](http://web.archive.org/web/20131019062724/http:/typophile.com/files/business-card-v1.gif) | 16.24 KB |\n| [business-card-v2.gif](http://web.archive.org/web/20131019062724/http:/typophile.com/files/business-card-v2.gif) | 37.99 KB |\n| [new-logo-and-card-v7.gif](http://web.archive.org/web/20131019062724/http:/typophile.com/files/new-logo-and-card-v7.gif) | 28.17 KB |\n| [final\\_bcards\\_labels.gif](http://web.archive.org/web/20131019062724/http:/typophile.com/files/final_bcards_labels.gif) | 32.64 KB |\n\n",
  "author": "Addison Hall",
  "time": "22 Feb 2007 — 7:43am",
  "uid": "8005",
  "comments": [
    {
      "time": "22 Feb 2007 — 9:46am",
      "content": "I really do like the new design, very simple, precise and looks well considered.\n\nHowever, when I look at it, I can't help thinking that it's missing some text, like \"Addison Hall Design\". Having said this, I'm not really sure where you'd put it!\n\nI realise that the initials are already there, but I see them as more of a pictoral icon rather than typographical. Perhaps there could be a logo with the 'Addison Hall Design' text, and one without?\n\nI don't know, and maybe people will disagree, just my initial reaction!\n\n"
    },
    {
      "time": "22 Feb 2007 — 10:49am",
      "content": "You're absolutely right, it is missing the type -- it needs refinement and more thought overall. I haven't even fully considered applications, so I still have miles to go before it's fully usable. I'm glad, however, to hear a positive response.\n\nI'll try to think through some type treatments and post them.\n\n"
    },
    {
      "time": "22 Feb 2007 — 1:20pm",
      "content": "Well, both are nice and clean, but as for the new identity, I would increase the line weight a bit. For instance, if your text is set in Light, up it to Book. Redraw the H to match the weight of the A and D.\n\nKinda reminds me of the Wolfgang Puck rebranding that Landor did.\n\n"
    },
    {
      "time": "22 Feb 2007 — 4:31pm",
      "content": "Has a rather high-end design partnership feel to it. And judging from your well crafted work, I reckon you've nailed it.\n\ngood one ;)\n\nagree with points made about adjusting the weight of the letter forms. Also, not sure if it's just the size or perhaps may be rectified with the weight solution, the A & D seem uncomfortable in the H at the moment - they seem to be being squashed out of the buckets the H provides. I hope this makes sense.\n\n----------  \n**Paul Ducco**  \n [Design, Melbourne](http://web.archive.org/web/20131019062724/http:/www.solid-creative.com/print.htm)  \n----------  \n [Little Mischief](http://web.archive.org/web/20131019062724/http:/www.littlemischief.com/)\n\n"
    },
    {
      "time": "22 Feb 2007 — 7:48pm",
      "content": "Great feedback guys -- thank you! I've posted a new image and PDF (to get a closer look) after making modifications per your comments. I beefed up the lines a little, but I still want to retain a sort of engraved look if possible. The letterforms are based on [Bryant](http://web.archive.org/web/20131019062724/http:/www.processtypefoundry.com/typefaces/bryant2/index.html), so naturally I also used it for the type treatment. I think I'm getting closer with the mark, but the type still needs some work.\n\nRegarding my attempts to even out the weight of the strokes, the screen is playing tricks on me. Things appear much better zoomed in than they do small. I'll have to print it out at the office tomorrow and take a closer look.\n\nThanks again.\n\n"
    },
    {
      "time": "23 Feb 2007 — 6:11am",
      "content": "Addison, using a blow up of a type-based design to determine whether the type needs adjusting is very hard. The way I go about is by using a magnifying glass upside-down, effectively reducing the image.\n\nDon't laugh, consider that you this way you multiply the resolution of the print AND can see what the design looks like in RL.\n\nAnother good trick is holding your print upside down and looking thru your lashes. Inner spaces and letterspacing become cleare that way.\n\nJust my 2 bits.\n\n"
    },
    {
      "time": "23 Feb 2007 — 11:23am",
      "content": "You don't need to have LLC in your logo. Save that for fine print on your website and contracts.\n\n"
    },
    {
      "time": "24 Feb 2007 — 8:59am",
      "content": "Thanks for the tips, Bert. In all of my web nerdery, I had forgotten some of the basics! No laughing here -- those are great techniques.\n\nRegarding the LLC, different people have told me different things. My accountant had told me that it was important to have it everywhere, but I'd certainly rather keep it in the fine print if possible.\n\nI've fine-tuned things a little more and posted another image. I'm also beginning to consider how it can actually be used, and I like the idea of the logotype (someone correct me if I'm mislabeling it) appearing separately from the mark in some occasions. The long name isn't very compact, but if I'm controlling everything, that shouldn't give me too much grief.\n\nI'd also like to hear opinions on printing techniques -- if I decide to live with this, I'll need some new business cards.\n\nThanks,  \nAddison\n\n"
    },
    {
      "time": "28 Feb 2007 — 8:18am",
      "content": "I figured the best way to approach actually using the logo would be to design new business cards, so here we go. (See the attachment in the first post.)\n\nVersion A is the typical front and back, with the logo presented on a clean field on one side and all of my info on the other. Version B is a one sided card, but I subdued the logo a bit thinking that I might even blind emboss it. I've avoided color altogether for now until I resolve the layout.\n\nThe long email address bugs me (but I'm stuck with it) especially on version B. Version A gives it room to breathe, and possibly grow since my wife might be joining me soon and I have no idea what her email will be. Perhaps I'm a little too obsessive about that.\n\nPlease provide some guidance!\n\nThanks,  \nAddison\n\n"
    },
    {
      "time": "28 Feb 2007 — 4:10pm",
      "content": "I like Version A a lot - it's classic and interesting. Nice work!\n\nI see why the long email address bugs you -- why not create an email address with only 2 letters? Like \"ah@addisonhalldesign.com\" ? It's not a lot, but it would help some.\n\nAK\n\n"
    },
    {
      "time": "5 Mar 2007 — 3:48pm",
      "content": "Thanks, Alaskan -- saving two letters is better than nothing...\n\nWell, I've called my buddy at the printer to come talk to me about business cards, and possibly some labels for letterhead, envelopes, and other miscellaneous uses (who knows), but for now I've posted my last round of ideas. It's more business cards, but this time they're all on one side -- for some reason I just felt I needed to resolve it this way. I like the front and back as well, so we'll see.\n\nAs I said, I've also come up with a label idea for various applications -- mainly letterhead and envelopes. I thought this could be an inexpensive way to treat my stationery while providing a way to create proposal covers and such, too. Has anyone done anything like this? Again, I've avoided color, but I'm assuming that I'll use a 1 color flood of something.\n\nOne other question, and maybe this is another topic: when is it appropriate to use your business' legal name? This came up earlier in the thread, but I'm curious as to when it's supposed to be used and when it's unnecessary. Does anyone know?\n\nThanks,  \nAddison\n\n"
    },
    {
      "time": "5 Mar 2007 — 4:07pm",
      "content": "Addison,\n\nThis is looking very strong. I think the centered version is better for those instances when you find yourself wanting to use them together. Unless you add more space as I find myself want the H to somehow read with the line of text.\n\nI think B of the cards is best. There is something odd about having the tagline with the address information.\n\nAs for the label. I might move the address information further to the right, creating symmetric spacing on the right, top and bottom of the block of text. I also might toy with the idea of having the label perforated to help with even folds. This would make you use the label on the same side, but I think you might really appreciate not having to worry if it is square or not.\n\n ![](http://web.archive.org/web/20131019062724im_/http:/typophile.com/files/perfsomethinglikethis_5377.png)\n\n"
    },
    {
      "time": "6 Mar 2007 — 12:49pm",
      "content": "Thanks, Tiffany. You're probably right about the horizontal version -- I'll have to add more space between the mark and the type. I'd really like a version that is more compact overall, but nothing looks nearly as nice as the centered version.\n\nThe perforation is a good idea so I'll talk to my printer about that. I did want the flexibility of placing the label on either side of something, but maybe that isn't much of an issue (I need to commit!).\n\nCost is also a concern, especially since I'd possibly like to have the mark on the cards blind embossed, or something else special. So that may affect what I decide to do with the labels.\n\n"
    },
    {
      "time": "6 Mar 2007 — 4:58pm",
      "content": "Addison, BTW, I'd like to compliment your parents for providing you with such an elegant name. It sounds very creative, yet platinum and trustworthy.\n\nI agree with Tiffany that card B is the strongest, but perhaps I'd give a little more room between \"Hall\" and \"info@\" ?\n\nToo nitpicky?\n\nAK\n\n"
    },
    {
      "time": "15 Mar 2007 — 7:08am",
      "content": "BUSINESS CARD:  \nThe rule,T,E,W are added elements. If you removed them, would the viewer still know what the information was? The titling-characters are useful when there are several items of similar nature. I bet someone knows what sequence of numbers containing the @ means much more easily than a stand-alone (E). They would know what a sequence ending with (.com) means. If you had only one sequence numbers seperated with (.) and in the 3.3.4 combination, someone has been exposed to this enough to deduct that it is most-likely not your fascimile. I say this, because the mark is so beautifully simple everything else should follow suit or deviate for a reason.\n\nMONOGRAM:  \nVery interesting. Looks great reversed and normal. Did you try to create it out of pixels(squares).\n\nTYPE:  \nThe numerals are too large. They do not flow. I would suggest reducing them a 1/4 point. It looks like you spent much more time on your mark than you did on type-setting and any other graphic elements.\n\nCOLOR:  \nColour is such an important element in user-interaction within electronic medium. Why was it ruled out?\n\nTAGLINE:  \nI know what you are trying to say. It is true, but it worries me. Some will see it as craftsmanship. Others will see it as \"She's so crafty\". You're at the mercy of the left-brainer's employ and the word craft may mean \"artsy, creative, tinkering\". Probably not your intent. This very word may prove to have a negative impact on trying to convince someone the worth of your consultation, knowledge, etc.. You may lump yourself into the category (kid-nextdoor), regardless of your age.\n\nYou must consider the visualization of each individual word. What will your audience see when they read \"crafting\"? Crafting works well in this forum, but how would it be perceived by someone reading the Harvard Business Journal. That person may have 150k allocated for their corporate site. Wouldn't you want to be on their short-list?\n\n"
    },
    {
      "time": "15 Mar 2007 — 7:29am",
      "content": "This is really nice.\n\n"
    },
    {
      "time": "15 Mar 2007 — 11:09am",
      "content": "Herbert, the \"T\" and \"E\" and such are unecessary -- I'll admit to being tempted by decoration (if you could call it that), but I've removed them and, honestly, I don't really miss them.\n\nI haven't tried the monogram in pixels yet, but that certainly seems to be a possibility\n\nRegarding the type -- while I love Bryant, I eventually found it to be, well, not exactly what I was looking for. Instead I'm currently trying FTF Stella which is much more neutral as a text font, and it just feels better (at least for now).\n\nColor was something I wanted to address once I was happy with the mark and it's basic use within applications. The most recent attachment in the first post now shows the colors I'm playing with, although I'm not sure I like how they've translated on screen. While I'll have to tinker with this for onscreen use, I've included PMS numbers for anyone who actually wants to know the exact colors.\n\nI had not anticipated anyone interpreting \"crafting\" in that fashion. I'll have to reconsider that -- point taken.\n\nAluminum -- thanks.\n\n"
    },
    {
      "time": "15 Mar 2007 — 12:26pm",
      "content": "I think it's coming along nicely. The type you switched to is very nice. I really like the italics.\n\nI like the colors, too. Your mark looks great in 159 sitting in white space. Have you tried a darker brown?\n\nHave you chosen paper for the cards yet?\n\n\"Crafting\"  \nI'm not sure there's a real problem here. Non-designers use \"crafting\" to talk about everything from cars to cabinetry. It's just another way of talking about build-quality. Still, might want to ask a few unsuspecting strangers how they'd take it. That way you can get really paranoid mulling over the responses and maybe even start all over!\n\nJus' playin.\n\n"
    },
    {
      "time": "18 Mar 2007 — 10:38pm",
      "content": "Reminds me of the old Hovis logo on it's baking tins..which leaves an imprint on the baked loaf of bread\n\n ![](http://web.archive.org/web/20131019062724im_/http:/typophile.com/files/hovis_6714.JPG)\n\n"
    },
    {
      "time": "5 Apr 2007 — 9:45pm",
      "content": "I've posted my final art before going to press (see the attachments in the first post: final\\_bcards\\_labels.gif), but I have one last question...\n\nI always like to get my wife's opinion on work -- mainly to see how things look to a non-designer. Her only remark was that the address and city, as well as the phone and website, needed some sort of separator. I tried to find some other examples and ultimately referred to Bringhurst's Elements. If I understand correctly, he seems to recommend a middot or a virgule (forward slash) as a \"sign of separation\". In my last attachment, you'll see that I've tried both of these approaches. I'd love to hear some other thoughts on this before I shoot this off to the printer.\n\nWhatever treatment I use on the business card will carry over to the label.\n\nI've also managed to get [my website redesigned](http://web.archive.org/web/20131019062724/http:/addisonhalldesign.com/) with the new look. I redrew the logo in pixels and am fairly pleased with the results.\n\nThanks,  \nAddison\n\nBTW, those bread tins are awesome!\n\n"
    },
    {
      "time": "6 Apr 2007 — 4:08am",
      "content": "I agree you need a separator you could also look at | the vertical | it sometimes needs vertical scaling depending on the typeface. I have to chime in on the crafting issue, it can be read as websites for crafting, you could think of _crafting websites and interactive media since 1998_ or similar, or manufacturing or engineering although they are a bit cold and ambiguous.\n\nTim\n\n"
    },
    {
      "time": "6 Apr 2007 — 6:18am",
      "content": "I think Tim's vertical separators would look nice. And I didn't read it as \"websites for crafting\" until he mentioned it. I wouldn't be too too worried about it being misread.\n\nI really like your color scheme, the blue/brown combination is hot right now and the orange gives it a nice kick. The website looks nice too - very clean and easy to use.\n\nNice work! :)\n\n"
    },
    {
      "time": "6 Apr 2007 — 8:56am",
      "content": "I like the forward slash. The dots don't work for me. Your new website design is great! I'm a fan of your work.\n\nSharon\n\n"
    },
    {
      "time": "6 Apr 2007 — 8:57am",
      "content": "Vertical separators are great in a single line of type, but if used in multiple lines of type they start to take on an appearance of a stretched lc-l (ell). I've used the period before, raising it on the baseline. I used to use bullets but now they always appear too heavy. There is something nice about the slash, but as you have it now there are some spacing issues.\n\nCongrats on getting so close to being done!!\n\n"
    },
    {
      "time": "6 Apr 2007 — 10:19am",
      "content": "Thanks for all of the positive feedback -- it certainly puts my mind at ease (it's so hard doing work for yourself!). I was leaning toward the forward slash anyway, so this confirms it. And I'll fix those spacing issues, Tiffany.\n\nThanks again everyone,  \nAddison\n\n"
    },
    {
      "time": "6 Apr 2007 — 6:01pm",
      "content": "great christmas idea, those bread tins.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Wellington](http://web.archive.org/web/20131019062724/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": "6 Apr 2007 — 6:05pm",
      "content": "site and stuff looks great Adds\n\n----------  \n**Paul Ducco**  \n [Graphic Design Wellington](http://web.archive.org/web/20131019062724/http:/www.solid-creative.com/design.htm)\n\n"
    }
  ]
}
