{
  "id": "31694",
  "title": "Typeface construction (lines to outlines), x-/cap/ascender/decender heights & overshoot",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Possibly the longest thread name in the World, ever.\n\nOK, so I've been lazy with the new redraw of my typeface 'Magnitude'. I started the redraw by creating each character as a single outline in Illustrator, with the intention of outlining the paths, resizing and tweaking later, once a base character set had been drawn.\n\n'Magnitude' Typophile critique thread here: [http://typophile.com/node/31634](http://web.archive.org/web/20131018212328/http:/typophile.com/node/31634 \"http://typophile.com/node/31634\")\n\nI started the outlining and resizing and noticed a flaw with my technique. When I resize each different weight the x-/cap/ascender/descender height changes, depending on whether I resize according to x- or cap height. The PDF attached kind of illustrates the point.\n\nWhat I wanted to know was...\n\n1. Is there a preferred method for resizing a typeface designed in this way, or is it just not recommended to do it with this technique?\n\n2. Is it better to design a regular weight and then completely draw from scratch a light and bold weight (or start with a light then do regular and bold)? Are there any standard techniques for up and downscaling type weights?\n\n3. I've noticed some typefaces where each different weight has different x-height and overshoot. Do you think these should be the same throughout a font family or should they vary between weight?\n\n4. Even in a monoline typeface, it it advisable to have at least a small difference in thickness between horizontal and vertical stems? I've had conflicting viewpoints on this one so far. If it's advisable, home much less (as a percentage) should the horizontals be to be optically the same width as the verticals?\n\n| Attachment | Size |\n| --- | --- |\n| [magnitude\\_resize.pdf](http://web.archive.org/web/20131018212328/http:/typophile.com/files/magnitude_resize.pdf) | 193.74 KB |\n\n",
  "author": "stimuli",
  "time": "22 Feb 2007 — 10:31am",
  "uid": "896",
  "comments": [
    {
      "time": "25 Feb 2007 — 10:42am",
      "content": "Asking too many questions at once, eh? Well I started a redraw anyway, I wasn't happy with Illustrators' handling of points and handles when converting from strokes.\n\n// Thanks for nothing, hehehehe :P\n\n"
    },
    {
      "time": "25 Feb 2007 — 12:16pm",
      "content": "1. I would recommend drawing in FontLab.\n\n2. For a sans serif, a good method is to draw the extra bold and ultra thin, and interpolate the rest. The ultra thin is relatively easy, as it can be handled as a stroked path (\"Make Parallel Path\" in Fontlab).\n\n3. It depends on how the type may be used. If printed body copy of contrasting weights is anticipated, then the bold should have a larger x-height, so that, for instance, bold subheads don't look smaller than the following regular text. However, if display combo (eg in the same word) are anticipated, then x-height should be the same. When it comes to low-res screen display, it is better to standardize x-height hinting/alignment zones/overshoots.\n\n4. Verticals should be thicker than horizontals (except in ultra thin, see above), otherwise your maximum weight is constrained to be no more than the thickness of E's horizontal stems in your boldest weight.\n\nYou should start right now on the ultra-bold of this typeface. There are so many \"techno\" faces that have a limited weight range; they lack personality and usability. In fact, all types show more personality in the extreme variants -- consider Frutiger and Myriad for instance -- Myriad is more distinctive in its bolder and condensed styles.\n\n"
    },
    {
      "time": "25 Feb 2007 — 10:04pm",
      "content": "Thanks for the feedback, Nick :)\n\nI've always considered Fontlab's drawing tools vastly inferior to Illustrator's... is there any obvious reason why it's better to use FontLab over Illustrator? What's the difference between the Fontlab interpolation method nd the blend tool (+ tweaks) in Illustrator?\n\nI intend the family to be used for display purposes only, each weight with alternates, small caps/unicase and stencil version. I'm considering extending it to five weights (and trying to shake off the 'techno' tag too).\n\n"
    }
  ]
}
