{
  "id": "31702",
  "title": "nice animated type",
  "forum": "Design",
  "tags": [

  ],
  "content": "(audio from pulp fiction, NOT SAFE FOR WORK)\n\nQuote by Motionographer:  \n<cite>SCAD student Jarratt Moody is in Time-based Typography I here at SCAD (a course for which I’m currently the teaching assistant), and he recently finished up a really nice piece for the first project in the class. The basic idea of the project is to take a piece of audio from wherever (movie, song, poetry reading, answering machine) and then represent that audio on screen using only typography.</cite>\n\nJarratt chose a famous bit of dialogue from Pulp Fiction as his subject matter. (Okay, what dialogue from Pulp Fiction isn’t famous?) The resulting piece is full of whimsy and style. Jarratt does some great things with scale and simple but effective camera movements. Get those headphones on and prepare yourself for several lashings of Samuel L. Jackson’s naughty tongue.\n\n[http://www.motionographermedia.com/jarrattmoody/intonation.mov](http://web.archive.org/web/20080113203123/http:/www.motionographermedia.com/jarrattmoody/intonation.mov \"http://www.motionographermedia.com/jarrattmoody/intonation.mov\")\n\n [‹ Help with lettering (updated)](http://web.archive.org/web/20080113203123/http:/www.typophile.com/node/31733 \"Go to previous forum topic\") [UN radiation danger sign... ›](http://web.archive.org/web/20080113203123/http:/www.typophile.com/node/31566 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080113203123/http://www.typophile.com/user/7345\" title=\"View user profile.\">thierry blancpain</a>",
  "time": "<br>",
  "uid": "7345",
  "comments": [
    {
      "time": " 22.Feb.2007 3.03pm",
      "content": "Ok, this sucks! :p  \nI actually just got a similar assignment, and I wanted to do a piece of Pulp Fiction as well (a different piece, but ok.), becuase I practically always use Pulp Fiction quotes in my type specimen. I’m somewhat of a Pulp Fiction-freak. ;)  \nI got the assignment this morning, speaking of coincidence...\n\nIt’s looking really good, and I doubt I would have done better.\n\nI guess I will use a piece from another masterpiece movie, then. :)\n\n"
    },
    {
      "time": " 22.Feb.2007 3.11pm",
      "content": "Big fun Thierry, thanks for sharing.\n\nOn another note, Jelmar I don’t see it being a problem as you were going to use another piece of dialogue anyway – and as we all know, there are plenty to choose from. Just do it differently.\n\n"
    },
    {
      "time": " 22.Feb.2007 3.58pm",
      "content": "I agree.\n\n"
    },
    {
      "time": " 22.Feb.2007 4.53pm",
      "content": "looks good! I like it. I wish my school had a motion type class.\n\n"
    },
    {
      "time": " 22.Feb.2007 7.10pm",
      "content": "Oh, good, I’m glad someone posted it. (:\n\nI love it, especially the scale of the words @ the very end broken by the rule. Hehe.\n\n"
    },
    {
      "time": " 23.Feb.2007 7.20am",
      "content": "Cool! Good one :)\n\n\\_\\_\\_\\_\\_\\_\\_  \n AL  \n [lenart.pl](http://web.archive.org/web/20080113203123/http:/www.lenart.pl/)\n\n"
    }
  ]
}
