{
  "id": "31710",
  "title": "Introduction",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I'm Matthew Heinrich from Chicago.\n\n- I'm a long time lurker via the RSS feeds.\n- I'm 25 years old and an Art+Design BA student at DePaul University. Stifle your chortles, please. My school might not be reputable as an art school, but I'm passionate and hard-working (and something of an autodidact).\n- I work three part time jobs: As a/the (it's complicated) lab admin for the department's computer labs, as the department's in-house designer/webmaster, and as an intern building websites for a design firm.\n- I formerly studied psycholinguistics and cognitive neuroscience at the University of Chicago. It ended three years into my degree with a nervous breakdown.\n- I'm a student member of aTypI and AIGA.\n- I'm interested in:\n  - Contemporary (not modern) applications of Bauhaus and Swiss Modernism\n  - Web typography (and its discontents)\n  - Software and hardware as it applies to design\n  - Letterpress and serigraphy (though I haven't tried my hand at either yet)\n  - Anywhere that design overlaps with psychology (which is just about everyhwere)\n  - Hermetic knowledge\n  - Parenthetical statements (obviously)\n- Fun facts:\n  - I'm ambidextrous (or more accurately, ambisinistral).\n  - I don't follow sports, so don't ask about the bears, bulls, cubs, sox, fire, &c.\n  - I live in Lincoln Square.\n  - I'm a lapsed Catholic.\n  - I'm really hoping all these nested lists work out.\n\n",
  "author": "heinous",
  "time": "22 Feb 2007 — 9:40pm",
  "uid": "15533",
  "comments": [
    {
      "time": "25 Nov 2012 — 12:09am",
      "content": "[Edit]\n\n"
    },
    {
      "time": "23 Feb 2007 — 12:33am",
      "content": "ambisinistral\\>\\>\\> you are versatile with your left side???.... Ohh and welcome to typophile :-)\n\nMikey\n\n"
    },
    {
      "time": "23 Feb 2007 — 1:37am",
      "content": "Nice introduction, check this out, Matthew : [http://www.philinthecircle.com/influence.html](http://web.archive.org/web/20131017083615/http:/www.philinthecircle.com/influence.html \"http://www.philinthecircle.com/influence.html\")\n\n"
    },
    {
      "time": "23 Feb 2007 — 6:08am",
      "content": "Ambisinistral would likely mean he's a lefty who has learned full capability with his right hand (like my dad).\n\n"
    },
    {
      "time": "23 Feb 2007 — 6:48am",
      "content": "I must say I have a soft spot for people who properly craft nested HTML lists.\n\n"
    },
    {
      "time": "24 Feb 2007 — 1:27am",
      "content": "You are correct, Metalfoot. Give your dad a left-handed handshake followed by a left-handed look for me.\n\n"
    },
    {
      "time": "24 Feb 2007 — 1:28am",
      "content": "Thanks! They are ever so useful, don't you think? I could prattle on endlessly about the glories of the unordered list.\n\n"
    },
    {
      "time": "2 Mar 2007 — 9:21am",
      "content": "Matt?!?\n\nIt's me... Erin Anderson... your ENG 104 prof. Funny meeting you here! Welcome to the forums and I hope all's going well.\n\nFYI- Columbia Univ. Center for Book & Paper Arts offers letterpress classes. I've been flirting with enrolling myself (taking a screenprinting course now instead). It might be worth a look.\n\nAlso, you might check briarpress.org for letterpress information and resources.\n\nerin  \npaperina inc.\n\n"
    }
  ]
}
