{
  "id": "31734",
  "title": "Reverse Font Spacebar Blues",
  "forum": "Build",
  "tags": [

  ],
  "content": "Hello,\n\nI’m a Win 2000/FontLab 4.6 user. Several years ago, I worked with a mac-only type designer to convert his commercial mac PS fonts to PS and TT for win. Font technology has changed drastically since then!\n\nSome of these fonts are based on reverse images [solid-rectangle background with transparent glyphs].\n\nWin fully supports a solid-rectangle glyph in the spacebar cell—a very cool, intuitive feature to be preserved if possible.\n\nWhen these fonts were first developed c1997, the mac OS in use at the time did not support a spacebar glyph. Experiments crashed the designer’s machine.\n\nNow that OSX [theoretically?] supports win-generated TTFs, I’m concerned about spacebar glyphs after reading this info:\n\n[http://typophile.com/node/30303](http://web.archive.org/web/20071018175927/http:/typophile.com/node/30303 \"http://typophile.com/node/30303\")  \n [http://developer.apple.com/textfonts/TTRefMan/RM07/appendixB.html](http://web.archive.org/web/20071018175927/http:/developer.apple.com/textfonts/TTRefMan/RM07/appendixB.html \"http://developer.apple.com/textfonts/TTRefMan/RM07/appendixB.html\")\n\n1) Is there a danger that a win-generated TT font with a glyph assigned to the spacebar cell would crash an OSX system?\n\n2) Would PS-favor OT do a better job of supporting this glyph than TT?\n\n3) Is there a FontLab setting, default character or CodePage combo for a win/mac solution with spacebar glyph support?\n\n4) Is it likely that win support for spacebar glyphs will continue in the foreseeable future?\n\n5) In FontLab’s Naming dialog, there is an option in the More Styles list labeled “negative.” This term is not defined in the manual. If I chose it, it does not stay selected.\n\nIs it relevant to this kind of font? If so, how can I use it?\n\nMany thanks for your help, Anna  \n—  \nThe Type Heritage Project  \nHonoring the Genius of Type Designers  \nfrom Ancient Scribes to Digital Wizards\n\n [‹ Testing opentype (TTF) and (OTF) on a PC](http://web.archive.org/web/20071018175927/http:/typophile.com/node/31715 \"Go to previous forum topic\") [Monowidth characters in a font ›](http://web.archive.org/web/20071018175927/http:/typophile.com/node/31700 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071018175927/http://typophile.com/user/9743\" title=\"View user profile.\">Type Historian</a>",
  "time": "<br>",
  "uid": "9743",
  "comments": [
    {
      "time": " 23.Feb.2007 5.32pm",
      "content": "I just tested this on my OSX 10.3 system. I made a font with a X-shaped contour in the space glyph in TTF format, and then installed the font on OSX. Using TextEdit (the simple text-editor that comes with OSX), I wrote out some text and then set it to use the font I’d just made. It showed the contour that I’d put in the space glyph as you would expect, everywhere there was a space character.\n\n"
    },
    {
      "time": " 23.Feb.2007 6.11pm",
      "content": "WOW! Thanks for your instant response, Glyphobet!\n\nThis news is even better than I expected in my Wildest Dreams—seems too good to be true. Thank you for your courage in testing your hypothesis.\n\nDid you used FontLab to make this test font? If so, what encoding options did you choose?\n\nThanks again for your generous input, Anna\n\n"
    },
    {
      "time": " 24.Feb.2007 2.57pm",
      "content": "What can I say... I was curious. :) I used [FontForge](http://web.archive.org/web/20071018175927/http:/typophile.com/wiki/FontForge) to make a Unicode-encoded font.\n\n"
    },
    {
      "time": " 24.Feb.2007 4.04pm",
      "content": "Now I’m wondering whether you tried to print your test text or embed the font in a PDF?\n\nThanks again, Anna  \n\\_\\_\\_\\_\n\nHonoring the Genius of Type Designers  \nFrom Ancient Scribes to Digital Wizards\n\n"
    }
  ]
}
