{
  "id": "31759",
  "title": "OT <hlig>, <hist> (historical ligatures &amp; forms in OpenType)</hist></hlig>",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "Which applications do people know of that support these features?\n\n\\<hlig\\>\n\n\\<hist\\>\n\n",
  "author": "Choz Cunningham",
  "time": "24 Feb 2007 — 9:21pm",
  "uid": "13605",
  "comments": [
    {
      "time": "25 Feb 2007 — 5:40pm",
      "content": "Found an answer here: [http://www.typotheque.com/fonts/opentype\\_feature\\_support/](http://web.archive.org/web/20150317210138/http:/www.typotheque.com/fonts/opentype_feature_support/ \"http://www.typotheque.com/fonts/opentype\\_feature\\_support/\")\n\nThat, with some Googling of Typophile (since the search here choked) explains it a bit.\n\nIf anyone else is reading this, some Adobe CS programs seems to support -hlig-, but only by binding control to the UI element for -dlig-.\n\n-hist- on the other hand, is supported by Quark.\n\nWhat a bummer, as that leaves the choice of the user a bit bound up.\n\n"
    },
    {
      "time": "25 Feb 2007 — 6:36pm",
      "content": "Actually, InDesign supports the 'hist' feature. However, it can only by accessed through scripting, not through the UI. The property is called 'otfHistorical'.\n\nThe last page of the [OpenType User Guide for Adobe Fonts](http://web.archive.org/web/20150317210138/http:/www.adobe.com/type/browser/pdfs/OTGuide.pdf) (PDF file) shows you a list of which features are supported by Adobe's applications.\n\n"
    },
    {
      "time": "25 Feb 2007 — 7:10pm",
      "content": "Thank you that link! I have seen that doc before, but not read it fully. Doing so now...\n\n"
    },
    {
      "time": "26 Feb 2007 — 2:04am",
      "content": "<cite>-hist- on the other hand, is supported by Quark.</cite>\n\nAt least as regards the earlier XPress7 beta, some features are listed as \"supported\", but e.g. for 'hist' and 'zero' this means that you have to select the according glyphs via the glyph palette.\n\n"
    },
    {
      "time": "26 Feb 2007 — 7:14am",
      "content": "I am trying to decide the scheme for accessing ligatures in my upcoming faces. Today, I think am going to mostly ignore the eccentricities of application support, and arrange things as I feel suits the specification descriptions.\n\nDo others feel that OpenType is \"young enough\" that conventions, compatibilities and methods of access are still in progress? I know there are features I could include that aren't yet supported by any major application.\n\n"
    },
    {
      "time": "26 Feb 2007 — 8:09am",
      "content": "Oh, liga and clig (for standard and contextual standard ligatures) for ligatures, and dlig (for special ligatures), should be your first choices. If an application supports OT features, then these two are most likely supported.  \nFor additional things, maybe one of the Stylistic Set features might do. But these were not intended for ligatures and are available in InDesign CS2 only. (And in some recent Apple applications, but here, one can only select one Stylistic Set feature at the same time. Which is why I mention it only in parentheses.)\n\n"
    },
    {
      "time": "27 Feb 2007 — 9:46am",
      "content": "Thanks for the info on what Apple is doing.\n\nI will likely put everything in the proper places, and let applications deal with it. There aren't going to be that many OT features in !Lestatic, anyhow.\n\n"
    },
    {
      "time": "12 Feb 2015 — 9:21am",
      "content": "sorry for srewing up this one again …  \nwhy is the **hist** feature not accessible in InDesign (CS5)? What am I missing this time?\n\n"
    },
    {
      "time": "14 Feb 2015 — 1:30pm",
      "content": "It's only accessible through the glyph panel and scripting, not a simple UI toggle (and not in styles).\n\nAs for why, because not enough people care. There has been some movement in this area recently, TBD whether it will result in any changes. Of course, if you're still on a five-year-old version of the app, you won't see any changes.\n\n"
    }
  ]
}
