{
  "id": "31769",
  "title": "Number of fonts in the world",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "HI all,\n\nAccording to you how many fonts does exist ?\n\n",
  "author": "Marc C",
  "time": "25 Feb 2007 — 6:10am",
  "uid": "16734",
  "comments": [
    {
      "time": "25 Feb 2007 — 6:49am",
      "content": "1+2+3+4+5......................................995+996+997+998+999?  \nMathematically Speaking with Flowers\n\n"
    },
    {
      "time": "25 Feb 2007 — 7:46am",
      "content": "I've heard others estimate between 150,000 and 200,000. Myfonts offers 52,000 today, AF has another 10,000, so I suspect that those are very conservative estimates. I'd say at least an order of magnitude shy, to make up a number with no scientific backing.\n\n"
    },
    {
      "time": "25 Feb 2007 — 8:01am",
      "content": "lots of :)\n\n"
    },
    {
      "time": "25 Feb 2007 — 8:07am",
      "content": "256 factorial\n\nChrisL\n\n"
    },
    {
      "time": "25 Feb 2007 — 8:08am",
      "content": "How many will fit on the head of a pin?\n\n"
    },
    {
      "time": "25 Feb 2007 — 8:18am",
      "content": "Yves has an article in the current Indiefonts3 addressing how many fonts the world needs. It is a fun read and I agree with him--ofcourse I am biased though :-)\n\nChrisL\n\n"
    },
    {
      "time": "25 Feb 2007 — 9:25am",
      "content": "Thanks guy's,\n\nHi hears often my fonts or emigre but never read something (here) about Fonts fonts ?\n\n"
    },
    {
      "time": "25 Feb 2007 — 9:59am",
      "content": "Fonts Fonts = [FontFont](http://web.archive.org/web/20130125075441/http:/typophile.com/wiki/FontFont)s?\n\nAre you asking how many _typefaces_ exist or how many _fonts_ exist? I hesitate to get into a longwinded discussion here about nomenclature (again!) but for the sake of your question:\n\n- A [typeface](http://web.archive.org/web/20130125075441/http:/typophile.com/wiki/typeface) is a specific design of an alphabet. It usually refers to an entire typeface family, such as Palatino or Helvetica.\n- A [font](http://web.archive.org/web/20130125075441/http:/typophile.com/wiki/font) refers to the actual files which enable the typeface to be set _or_ to an individual weight, width, or style of the typeface.\n\nThe number of digital typefaces in existence is difficult to estimate, but it's probably less than 50,000. The number of digital fonts is certainly greater than 100,000. (FontShop's database alone contains more than a hundred grand).\n\nThen, of course, you'd also have to specify whether you wish to count _all_ typefaces or digital typefaces only. At this point you'll start to realize it's really too difficult a thing to count.\n\n"
    },
    {
      "time": "25 Feb 2007 — 10:37am",
      "content": "The exact number is, of course, irrelevant.\n\nThe sobering thought is that most typographers own thousands of typefaces, and use only a fraction of them the majority of the time.\n\nThe important thing to remember is that, like wine, while you probably only NEED a few varieties, there will always be new and vibrant examples created.\n\n"
    },
    {
      "time": "25 Feb 2007 — 1:10pm",
      "content": "Satya, my lawyers will be contacting you :-)\n\nYou got the size right, though.\n\n"
    },
    {
      "time": "25 Feb 2007 — 1:39pm",
      "content": "<cite> * A typeface is a specific design of an alphabet. It usually refers to an entire typeface family, such as Palatino or Helvetica.<br>\n    * A font refers to the actual files which enable the typeface to be set or to an individual weight, width, or style of the typeface.<br>\n</cite>\n\nStephen you should told me that last week, I know I was incorrect in english, but I made a search about that (last week), but I appreciated !\n\nYes I was talking about Fontfont's\n\n"
    },
    {
      "time": "25 Feb 2007 — 2:27pm",
      "content": "<cite>Satya, my lawyers will be contacting you :-)<br>\nYou got the size right, though.,</cite>\n\nNick, this new icon really suits me a lot, actually more than you.:)  \nNow you may start creating yet another one or can use mine as well :)\n\n ![](http://web.archive.org/web/20130125075441im_/http:/typophile.com/files/sn%20final_4416.jpg)\n\n"
    }
  ]
}
