{
  "id": "3176",
  "title": "Pressure Washers Identity",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This is the identity for Pressure Washers Inc. a company that specializes in pressure washing for the trucking industry.   \nWhat makes PW stand out from competition (besides the nice new logo) is that they have better containment of debris and chemicals (a special wet n' dry vacuum system)-which translates to environmentally conscious.   \nClients of PW are mostly men, truckers and corporate clients that own fthe fleets. In this field there is no clear leader. My client and I are trying to establish his company PW as that leader of that industry. The usual identities related to this industry are amateur jobs.I am guesing other cmpanies in the field do not consider truckers critical in choosing companies to clean their vehicles. I agree they are properly less picky that someone shopping for a $3000 watch. We still think a slick identity will help getting new clients.   \nBTW this job came with a 48hr. deadline as the Yellow pages ad   \nneeded to be ready in 2 days. I think it is pretty good considering the time frame. I cam upload older version if anyone is interested. ![PWinc.-Identity-with-custom.jpg](http://web.archive.org/web/20131019185003im_/http:/www.typophile.com/cgibin/board-post.pl?action=posting_upload_form&what=show&img=26718)\n\n",
  "author": "designalchemy",
  "time": "17 Feb 2004 — 8:49pm",
  "uid": "804",
  "comments": [
    {
      "time": "17 Feb 2004 — 10:06pm",
      "content": "here is a few more newer versions. Client thought last version looked like it was for a shampoo brand. I can see that so where do I take it from here with no time left. ![new PWinc identity](http://web.archive.org/web/20131019185003im_/http:/www.typophile.com/forums/messages/29/26724.jpg)\n\n"
    },
    {
      "time": "18 Feb 2004 — 4:23am",
      "content": "Ole, the swoosh doesn't say pressure to me, it says ocean wave. I like the type but make the INC as small as possible. Try Italic with some force graphic making it italic. For your deadline use just the type and then explore the mark for future uses with the graphic.\n\n"
    },
    {
      "time": "18 Feb 2004 — 9:48am",
      "content": "The swoosh doesn't really bother me. Does it say pressure? No, but the word pressure is present, so I think the water representation is enough. If anything, I agree with your client, in that it reminds me of hair for a cosmetic/shampoo logo\n\n"
    },
    {
      "time": "18 Feb 2004 — 1:40pm",
      "content": "I like the swoosh the only thing that's bothering me is the E it seems large and out of place.\n\n"
    },
    {
      "time": "18 Feb 2004 — 1:43pm",
      "content": "Client requested that we try rounded corners so here it is. This was the final version choosen. ![final logo](http://web.archive.org/web/20131019185003im_/http:/www.typophile.com/forums/messages/29/26768.jpg)\n\n"
    },
    {
      "time": "11 Mar 2005 — 3:50am",
      "content": "The first set of designs reminded me of the grease show (theater that is) logo,   \n   \n   \n ![](http://web.archive.org/web/20131019185003im_/http:/www.typophile.com/forums/messages/29/67163.jpg)   \n   \nI prefer the last version but why not try a few splashes on one of the letters.   \n   \ngood luck!\n\n"
    },
    {
      "time": "11 Mar 2005 — 8:27am",
      "content": "Company was renamed in the fall so I did new identity . ![fleet](http://web.archive.org/web/20131019185003im_/http:/www.typophile.com/forums/messages/29/67170.jpg)   \n   \nMy type design was designed to match Henrik Kubel's Klampenborg.\n\n"
    },
    {
      "time": "11 Mar 2005 — 10:11am",
      "content": "You sure you want the traps in there?   \nPlus I think you have some spacing and width issues.   \n   \nhhp\n\n"
    },
    {
      "time": "11 Mar 2005 — 12:23pm",
      "content": "some curves in the icon are a bit off - like the inside one\n\n"
    },
    {
      "time": "12 Mar 2005 — 6:55pm",
      "content": "When I saw the last logo, this jumped to mind:   \n   \n ![Airbus Logo](http://web.archive.org/web/20131019185003im_/http:/www.typophile.com/forums/messages/29/67258.jpg)   \n   \nI really like the symmetry and balance in the Airbus version - I feel like these aspects are missing in your version, which gives it an unprecise feeling.   \n   \nJust some thoughts...\n\n"
    },
    {
      "time": "13 Mar 2005 — 7:46am",
      "content": "Hi Ole,   \n   \nhere are 3 ideas:   \n   \n- Use the same direction of the curve with the A cross bar and the ilustration wave.   \n   \n- Use the wave but add pressure to it. You can use a presion point in the wave, fro example in the middle of the wave, so that way youve got a different icon instead of the wave.   \n   \n-Use Blue with some calid color combination, to show a pressure energy on this..you can use violet or some red color near to the blue.   \n   \n   \nI think the Ying and Yang does not fit at all.   \n   \nBTW, please gimme your opinion of my Ma\n\n"
    },
    {
      "time": "13 Mar 2005 — 9:34am",
      "content": "The Fleet Services work has already gone through 2 print cycles   \n(4 color process + silver foil logo). Client was very happy with results. The critique got started again because there was comments on the Pressure Washers work that was posted 13 months ago. I should have mentioned that the Fleet work was   \nalready printed/delivered/used. I agree with Tanya there was a few tweeks needed on the curves.\n\n"
    }
  ]
}
