{
  "id": "31772",
  "title": "Need some help choosing a font.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi everyone. I joined Typophile awhile back, but I've been inactive lately. I apologize for that. I have a project that I'm having a little trouble deciding on a font.\n\nMy brother needs a business card. It's not much. Says we will do something nicer with a bigger budget down the line, but it's looking like this will be a 1 or 2 color, 1 sided card. He is not a business. Just himself. And since he doesnt have a logo I was going to do strictly typography. No time for a logo. He wants to send this to the printer MONDAY! (Yeah, I know.)\n\nSo, really I just want to choose the right font. His work: home repair, remodeling, and maintenance. Carpentry. Flooring (wood, tile, laminate), Handyman services, appliance installation and repair (my dad is his sub on that end of the work).\n\nHe has been doing work like this for years. Mostly on through word of mouth. He wants a card to bring in new business.\n\nSome keywords he has mentioned to me: trust, loyalty, craftsmanship, customer satisfaction, professionalism.\n\nAny ideas? Sans, Serif, Demi? I can justify most of the choices. But I have minimal fonts to use here at home. I'll have to purchase a fairly affordable one or find a free one that could work.\n\n",
  "author": "typographia",
  "time": "25 Feb 2007 — 9:23am",
  "uid": "14608",
  "comments": [
    {
      "time": "25 Feb 2007 — 10:40am",
      "content": "Day Roman is free, classic and legible\n\n[http://x1brettstuff.blogspot.com/2006/10/more-free-typefaces.html](http://web.archive.org/web/20120415231816/http:/x1brettstuff.blogspot.com/2006/10/more-free-typefaces.html \"http://x1brettstuff.blogspot.com/2006/10/more-free-typefaces.html\")\n\n"
    },
    {
      "time": "25 Feb 2007 — 1:52pm",
      "content": "I've been in this situation many of times too...\n\nGentium is probably the best free font in the world (won a TDC award). Its good for text and very beautiful. Looks a little like ITC Gamma too just with the eccentricities. The PDF's on the Sil website prove that Gentium is not generic free 'stuff'.\n\n[http://scripts.sil.org/cms/scripts/page.php?site\\_id=nrsi&item\\_id=Gentium](http://web.archive.org/web/20120415231816/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&item_id=Gentium \"http://scripts.sil.org/cms/scripts/page.php?site\\_id=nrsi&item\\_id=Gentium\")\n\nAlso fontshop offers a free font of the month (or when ever new type is available). You can actually build a little library out of these fonts.\n\n[http://www.fontshop.com/features/free.cfm](http://web.archive.org/web/20120415231816/http:/www.fontshop.com/features/free.cfm \"http://www.fontshop.com/features/free.cfm\")\n\nBut I must tell you need to invest in commercial type.\n\nNow if you want a mind blowing value that no one can beat- Font Diner! Just about all of these fonts are for display but they work well with each other and with neutral classics like Futura and or Franklin Gothic that maybe installed on your machine.  \nThe collections are only 28 dollars each!!! Sometimes you can't even buy ONE font for that price! Downside- not opentype.\n\n[http://www.fontdiner.com/main.html](http://web.archive.org/web/20120415231816/http:/www.fontdiner.com/main.html \"http://www.fontdiner.com/main.html\")\n\nAlso have a look at Fonts.com  \nZapfino Extra Pro and Forte Pro could be had for only 35.00 and these come loaded with every feature in the book.  \nPNM Caecilia has integrated the small caps, ligatures, old style figures in one font file- actually saving you money when you buy as OpenType 29.00- not bad. And a range weights that you are looking for.\n\nAnd Ascendercorp.com has a fabulous collection of original fonts (oft under-appreciated)  \nAscender does lots of business with Microsoft and other OEMs hence these are expertly hinted- you have to pay big bucks for fonts that are hinted- and price are still very good.\n\n[http://www.ascendercorp.com/Ascender\\_fonts.html](http://web.archive.org/web/20120415231816/http:/www.ascendercorp.com/Ascender_fonts.html \"http://www.ascendercorp.com/Ascender\\_fonts.html\")\n\n[http://www.ascendercorp.com/pdf/Ascender\\_WPF\\_fonts.pdf](http://web.archive.org/web/20120415231816/http:/www.ascendercorp.com/pdf/Ascender_WPF_fonts.pdf \"http://www.ascendercorp.com/pdf/Ascender\\_WPF\\_fonts.pdf\")\n\nEndurnace Pro, Kootenay Pro, Lindsey Pro, Massif Pro (has a similiar stroke modulation of the expensive Font Bureau Amira), etc. Pescadero is very special- no italic though.\n\nYou might also want to consider font collections:\n\nFB Eagle, Coquette, and Columbus make the whole $19.00 collection worth it.\n\n[http://ascenderfonts.com/Merchant2/merchant.mvc?Screen=PROD&Product\\_Code...](http://web.archive.org/web/20120415231816/http:/ascenderfonts.com/Merchant2/merchant.mvc?Screen=PROD&Product_Code=CFP01-80-01-05&Category_Code=Font_Pack \"http://ascenderfonts.com/Merchant2/merchant.mvc?Screen=PROD&Product\\_Code=CFP01-80-01-05&Category\\_Code=Font\\_Pack\")\n\nAdobe collections are really the ultimate though. They cost more but this is really the creme de la creme!\n\n[http://www.adobe.com/type/collections.html](http://web.archive.org/web/20120415231816/http:/www.adobe.com/type/collections.html \"http://www.adobe.com/type/collections.html\")\n\nHope I have helped you. Don't forget to ask about student discounts if you are one.\n\nMike Diaz :-)\n\n"
    },
    {
      "time": "25 Feb 2007 — 8:54pm",
      "content": "Mike,\n\nThanks so much for all the information. This is going to help quite a bit. I know I need to build my commercial font library, but the catch is that I want to purchase fonts I can use for a mac instead of PC which happens to be the only system I have for freelance at home right now. Which is part of the reason I am not doing much freelance on my own yet. I'm not a student so that student discount might not help, except my boyfriend is still a student...hmmm.\n\nSo, yeah. The plan is to buy a mac soon, then get CS2 up and running from home. I use the new versions at work, so I am up-to-date, just not at home. I didn't want to upgrade on my PC because I know I'm getting a mac and will have to purchase the software then.\n\nBut, again. Thanks for all the links.I'm going to look into all these and see if any will work for this project.\n\n"
    },
    {
      "time": "25 Feb 2007 — 11:14pm",
      "content": "typographia\\>\\>\\> OpenType fonts work on the mac and the PC. They have special features such as glyph substitution ( such as f-ligatures ff, fi, fj, ffl, fl) Just about all the fonts I suggested with the exception of the Font Diner choices are OpenType.\n\nOpenType is cross-platform. If all that is available to you is a windows machine- go right ahead- then when you get your mac you can use those same fonts and they will function just as well if not better (on the mac its very easy to work with OpenType and all it features)\n\n[http://www.adobe.com/type/opentype/](http://web.archive.org/web/20120415231816/http:/www.adobe.com/type/opentype/ \"http://www.adobe.com/type/opentype/\")\n\nBut just remember the fonts on your boyfriends machine have to be uninstalled if he does not live you... I know that's dumb but that's how font licenses go.\n\nAll the success to you,\n\nMike Diaz :-)\n\n"
    }
  ]
}
