{
  "id": "31784",
  "title": "Visual distrotions in typeface, help needed",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "In some fonts I have noticed a problem I can not correct. I have drawn all the characters in the lower case properly, but when generated into a font some of the characters display in a rather distorted way, dependant on character size displaying.  \nIt usually happens to the lower r, n, h. sometimes the a or the s.\n\nLarger displayed sized the problem goes away, but it also seemt to happen in documents.  \nEven though my explanation is confusing, does anyone have an idea what is wrong.\n\nI have attached an image someone has supplied me with to illustrate the problem\n\n| Attachment | Size |\n| --- | --- |\n| [umerica.jpg](http://web.archive.org/web/20150417170304/http:/typophile.com/files/umerica.jpg) | 148.49 KB |\n\n",
  "author": "typotheticals",
  "time": "25 Feb 2007 — 6:17pm",
  "uid": "10671",
  "comments": [
    {
      "time": "25 Feb 2007 — 6:31pm",
      "content": "It looks like a [hinting](http://web.archive.org/web/20150417170304/http:/typophile.com/wiki/hinting) problem. Are you using FontLab? Did you try Auto Hinting?\n\n"
    },
    {
      "time": "25 Feb 2007 — 6:42pm",
      "content": "Not hinting, just went back and autohinted the thing, same problem still there. Was going to attach the font itself, but this doesnt seem possible (zip file)\n\nHave sent a demo of the font to alt.binaries font (NOTE : this is NOT alt.binaries fonts, this newsgroup is not used by anyone other than junk posts) if anyone wants to see the problem firsthand\n\n"
    },
    {
      "time": "25 Feb 2007 — 6:53pm",
      "content": "Check the [Alignment Zones](http://web.archive.org/web/20150417170304/http:/typophile.com/wiki/Alignment%20Zones). The tops of the letters need to be within or at the border of the zone.\n\n ![](http://web.archive.org/web/20150417170304im_/http:/typophile.com/files/n_align_zones_4666.png)\n\n"
    },
    {
      "time": "25 Feb 2007 — 10:01pm",
      "content": "Thanks for the hints on hinting Miguel! Auto-hinting is not perfect even if it's a nice start. Any additions?\n\n"
    },
    {
      "time": "27 Feb 2007 — 2:28pm",
      "content": "Mr Coles, thanks for some advice.\n\nIt seems to have been a hinting problem, but funnily the autohint in Fontlab didnt correct it, but the autohint in Fontographer did. Weird.\n\n"
    },
    {
      "time": "27 Feb 2007 — 3:23pm",
      "content": "Paging Dr. Twardoch ...\n\n"
    },
    {
      "time": "28 Feb 2007 — 1:24am",
      "content": "Typotheticals,\n\nwhat you need to do in FontLab Studio is (1) Autohint all glyphs, (2) Automatically calculate alignment zones in Font Info, (3) Automatically calculate standard stems in Font Info. Just autohinting won't correct the problem.\n\nA.\n\n"
    },
    {
      "time": "28 Feb 2007 — 1:39am",
      "content": "Postscript Autohinting is far away from perfect. If you take a look at some other fonts you notice that these kind of problems are almost always there, more or less anyway.\n\nI’ve experimented a lot with this lately and found out that if you only autohint the vertical stems, it can sometimes can work very good – you get sharper appearance on screen but this typical horizontal distorsion is not there (when letters jump up and down).\n\nTake a look at this thread for more hinting stuff.\n\n[http://typophile.com/node/31448](http://web.archive.org/web/20150417170304/http:/typophile.com/node/31448 \"http://typophile.com/node/31448\")\n\n/ Göran\n\nPS. <cite>Just to give you more examples:</cite> I also spotted the same issue on another thread lately that don’t really speaks about hints, but as an example – look at the \"t\", \"u\" and \"e\" on Freight Micro Bold on this thread:\n\n[http://typophile.com/node/31816](http://web.archive.org/web/20150417170304/http:/typophile.com/node/31816 \"http://typophile.com/node/31816\")\n\n"
    },
    {
      "time": "28 Feb 2007 — 1:57am",
      "content": "Mr Twardoch  \nThanks for your observations and suggestions. I got home and went to fix up the original font file here with your suggestions, and got absolutely nowhere. I followed your steps four times and the problem persisted every time.  \nWhipped out Fontographer and autohinted. Problem still slightly there so started over with Fontographer. 1. automated vert align zones then 2 . Autohinted. Problem cleared up. Could be just this font of mine, but confused an out of date program fixed the problem while Fontlab seems to stutter on it.\n\nOut of pure stubborness, took the corrected font and in Fontlab, followed your steps again. It recreated all the visual problems in the corrected font.\n\n?\n\n"
    },
    {
      "time": "28 Feb 2007 — 4:43am",
      "content": "Please kindly submit a problem report ticket:  \n [http://www.fontlab.com/Support/Support/FontLab-Problem-Report/](http://web.archive.org/web/20150417170304/http:/www.fontlab.com/Support/Support/FontLab-Problem-Report/ \"http://www.fontlab.com/Support/Support/FontLab-Problem-Report/\")\n\nA.\n\n"
    }
  ]
}
