{
  "id": "31799",
  "title": "(x) \"de Sede of Switzerland\" store at Zurich airport - Palatino, Gill Sans {Patricia}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Can someone identify the fonts used on this logo?\n\nThanks\n\nPatty\n\n| Attachment | Size |\n| --- | --- |\n| [desede.gif](http://web.archive.org/web/20081025052241/http:/typophile.com/files/desede.gif) | 61.63 KB |\n\n [‹ Harvard head font](http://web.archive.org/web/20081025052241/http:/www.typophile.com/node/32065 \"Go to previous forum topic\") [Brand New masthead ›](http://web.archive.org/web/20081025052241/http:/www.typophile.com/node/32059 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081025052241/http://www.typophile.com/user/4467\" title=\"View user profile.\">patty</a>",
  "time": "<br>",
  "uid": "4467",
  "comments": [
    {
      "time": " 26.Feb.2007 11.46am",
      "content": "Looks like Palatino and Gill Sans\n\n"
    },
    {
      "time": " 26.Feb.2007 1.18pm",
      "content": "yes to palatino, but the sans is more like a cross between kabel and futura, the sloped finishes to the L, and the straight stroke on the upper case R says no to Gill Sans\n\n"
    },
    {
      "time": " 26.Feb.2007 1.24pm",
      "content": "Need a better pic to verify the sans.\n\n"
    },
    {
      "time": " 26.Feb.2007 1.29pm",
      "content": "Given that they used Palatino for the logotype I’d say Gill is a good match.\n\n[EDIT: And by match I meant educated guess.]\n\nIt can’t be Kabel because the W in this weight has its legs crossed. And the R has just enough of a bump in the leg and the Z has sharp joins to make me say Gill as well.\n\n"
    },
    {
      "time": " 26.Feb.2007 2.19pm",
      "content": "just to clarify, i didn’t say it was either kabel or futura, just that it was nearer to them than gill, it can’t be gill, the ’S’ is wrong, and there are definitely ’kabel-style’ slants to the ends of some of the letters\n\n"
    },
    {
      "time": " 26.Feb.2007 2.25pm",
      "content": "but, a visit to their site reveals that it is MEANT to be gill sans\n\n[http://www.desede.ch/desede/pdf/deSede\\_logo.tif](http://web.archive.org/web/20081025052241/http:/www.desede.ch/desede/pdf/deSede_logo.tif \"http://www.desede.ch/desede/pdf/deSede\\_logo.tif\")\n\n\\*brett shuffles off into the distance, a victim of light-trickery and/or poor sign-cutting\\*\n\n"
    },
    {
      "time": " 26.Feb.2007 9.45pm",
      "content": "Thanks, I think that logo looks so nice.  \nDo you think it looks good because is a classic, even though  \nit was designed a long time ago?  \nDoes it look “fresh” according to you or not?\n\npatty\n\n"
    },
    {
      "time": " 27.Feb.2007 5.21am",
      "content": "No offense - but I’m not sure Palatino is capable of looking “fresh”. Nor Gill Sans. It’s not a bad logo but I don’t see anything distinctive about it at all. I’m not sure I’d even call it a logo...\n\n"
    },
    {
      "time": " 27.Feb.2007 6.01am",
      "content": "The Palatino “S” looks as if it is falling backwards. This does not look like a logo to me. It seems more like just a simple sign on a store.\n\nChrisL\n\n"
    },
    {
      "time": " 27.Feb.2007 7.11am",
      "content": "i agree with pattyfab and dezcom... they make some lovely furniture though :-)\n\n"
    },
    {
      "time": " 7.Mar.2007 7.59pm",
      "content": "Thanks so much, is good to hear other opinions (the s really looks like falling backwards, like the e in Rotis looks like is falling also). I guess is looking at the details that help to sharpen the typographic eye.\n\nThanks\n\npatty\n\n"
    }
  ]
}
