{
  "id": "31826",
  "title": "Selling a font",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "hi,\n\ni've designed my own typeface and was hoping someone will have some advice on how i would go about selling it on the web for people to use.\n\nis there an established service i can use that would make the font available for download and take care of the payments? do linotype [or similar site] take fonts submitted by any old person?\n\nalso, what about protecting intellectual property [???] and preventing people from copying the design of the font?\n\ncheers,\n\ndave.\n\n",
  "author": "david hunter",
  "time": "27 Feb 2007 — 12:07pm",
  "uid": "10218",
  "comments": [
    {
      "time": "27 Feb 2007 — 12:49pm",
      "content": "Others who have actually done this are much more capable of discussing this with you, but it seems to me that you can ask most large foundries to distribute your fonts. MyFonts [here](http://web.archive.org/web/20131015152949/http:/www.myfonts.com/info/prospectus) lays out the terms pretty clearly. It seems like they do take fonts from \"any old person\" as long as that pe rson has the rights to them. MyFonts is probably the most popular foundry for small type designers to sell with, maybe because the creator receives 65% of all sales. Other possibilites I found are [Linotype](http://web.archive.org/web/20131015152949/http:/www.linotype.com/2064/submitfonts.html) and [The Font Bureau](http://web.archive.org/web/20131015152949/http:/fontbureau.com/submissions). However, they frankly seem much more discerning about which fonts they will add to their libraries, which means they'll probably take longer to vet your typeface for sale and might want changes made.\n\nAs to protecting your rights to your typeface, that's what the [EULA](http://web.archive.org/web/20131015152949/http:/typophile.com/wiki/EULA) (End-User License Agreement) is for. But I don't know if there's any way to make sure that no one rips you off illegally by just opening it in FontLab or Illustrator. But a thorough EULA should make sure that this is kept to a minimum and that you're as protected as possible.\n\n"
    },
    {
      "time": "27 Feb 2007 — 1:05pm",
      "content": "What does the typeface in question look like?\n\n"
    },
    {
      "time": "27 Feb 2007 — 1:26pm",
      "content": "Kris asks the all-important question. The style of typeface might work in some libraries and not in others. There's a nice thread here about distribution options but I don't have the time at the moment to find it.\n\n"
    },
    {
      "time": "27 Feb 2007 — 1:35pm",
      "content": "Yes, do post a sample for us to see.\n\n"
    },
    {
      "time": "27 Feb 2007 — 2:21pm",
      "content": "ha ha- i was hoping no-one would ask that!\n\ncheers for the tips. it still needs a bit of work and some extra characters. i'll look into myfonts and linotype and see what criteria i will have to meet.\n\ndon't have it on this computer but i should be able to post a sample tomorrow, so you'll just have to watch this space...\n\ndave.\n\n"
    },
    {
      "time": "27 Feb 2007 — 2:57pm",
      "content": "I'm interested in selling my fonts too, so I'll be watching to see what other comments people have about the process.\n\nThis thread, although a bit old, is probaly worth reading:\n\n[http://typophile.com/node/8695](http://web.archive.org/web/20131015152949/http:/typophile.com/node/8695 \"http://typophile.com/node/8695\")\n\n"
    },
    {
      "time": "27 Feb 2007 — 3:22pm",
      "content": "Hmm, hopefully I sound a little more intelligent in the other thread I recall.\n\n"
    },
    {
      "time": "27 Feb 2007 — 5:01pm",
      "content": "It wasn't [this one](http://web.archive.org/web/20131015152949/http:/typophile.com/node/19952) was it, Stephen?\n\n"
    },
    {
      "time": "27 Feb 2007 — 5:36pm",
      "content": "Nope, but some good thoughts in there.\n\n"
    },
    {
      "time": "27 Feb 2007 — 6:13pm",
      "content": "Maybe a few questions will be answered (or raised) by [my over-caffeinated rambling](http://web.archive.org/web/20131015152949/http:/blog.extensis.com/?p=206) at the Extensis Macworld panel. Skip to \"Audience Question #1\".\n\n"
    },
    {
      "time": "28 Feb 2007 — 9:00am",
      "content": "[Several threads with \"sell\" and \"fonts\" found within.](http://web.archive.org/web/20131015152949/http:/www.google.com/search?q=site:typophile.com%20sell%20fonts)\n\n"
    },
    {
      "time": "28 Feb 2007 — 12:18pm",
      "content": "OK-\n\nhere are two samples of the font. the first is the font typed which i just knocked up, the second [scaled down from A1 size] in a similar way for which it was designed- for a birthday card, hence the name Happy 1st Birthday. perhaps the next version would be Happy 2nd Birthday!\n\nits my first font so its pretty cruddy & clunky. the monospaced and blockiness are inherent to the design of the birthday card, the sole purpose and conception of the typeface and its form. it only exists in capitals although i've done the numbers and some punctuation. i doubt i'll do a lowercase version.\n\nthere are a few improvements to be made, for example i need to set a height value [i'm not sure which] so that when the leading is set 'solid' the top of the letterform butts up against the bottom of the letterform in the line above- that is how it was originally designed to be. i might also change the 'I' so it has a serif and fills the space better. it was designed to be big [and have only ever used it for titles] but i'm surprised at how legible it is at 10pt despite the letterforms often melting into one- think thats less to do with my design and more the nature of the roman alphabet!\n\nanyway, i really enjoyed making it, its nice to have a second outcome evolve from a first, especially one you can keep re-using. all constructive feedback welcome, nothing too harsh though please! maybe i'll even try and sell it...\n\ncheers,\n\ndave.\n\n ![](http://web.archive.org/web/20131015152949im_/http:/typophile.com/files/happy1stbirthdaysample01_6309.jpg)\n\n ![](http://web.archive.org/web/20131015152949im_/http:/typophile.com/files/happy1stbirthdaysample02_3627.jpg)\n\n"
    },
    {
      "time": "28 Feb 2007 — 12:50pm",
      "content": "Better to start with the \"usual suspects\" (not that there's no room for that style, but better the \"usual\")\n\n"
    },
    {
      "time": "28 Feb 2007 — 2:28pm",
      "content": "I don't think a major foundry will accept this as is. I would put some more work into it (post it in the Critique forum!) or release at MyFonts.\n\n"
    },
    {
      "time": "28 Feb 2007 — 3:50pm",
      "content": "i'm not too precious about it. its very ugly, i'm sure its not everyones cup of tea and it certainly isn't at the finer end of typography! however it served its purpose well [my mate loved the card] and the underlying basis of the design is sound and interesting enough to stimulate a few ideas.\n\ncheers stephen, posting it on the critique forum would be good [although i never started this post with the idea of having it critiqued!!!] so maybe i'll post it up there when its ready-er.\n\ndavid hamuel, what are the \"usual suspects\"?\n\ncheers,\n\ndave.\n\n"
    }
  ]
}
