{
  "id": "31838",
  "title": "Browns Design's \"87\"",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Was browsing the wonderful work of Browns Design today and came across what must either be a silly joke or designer masturbation at its finest.\n\nCan someone explain to me how Johnathan Ellery’s book [“87”](http://web.archive.org/web/20071128121318/http:/www.brownsdesign.com/work/?id=23&subcat=&cat=41&i=118) is not simply a gallery of numerals designed by other artists (type designers)? I find the [copyright page](http://web.archive.org/web/20071128121318/http:/www.brownsdesign.com/work/?id=23&subcat=&cat=41&i=110) particularly amusing, given that it seems none of the content is original. Please tell me I’m missing something.\n\n [‹ Terms and Conditions?](http://web.archive.org/web/20071128121318/http:/www.typophile.com/node/31815 \"Go to previous forum topic\") [Sabon Open Type - Adobe vs Monotype ›](http://web.archive.org/web/20071128121318/http:/www.typophile.com/node/21252 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071128121318/http://www.typophile.com/user/103\" title=\"View user profile.\">Stephen Coles</a>",
  "time": "<br>",
  "uid": "103",
  "comments": [
    {
      "time": " 27.Feb.2007 8.18pm",
      "content": "Must be one of those “artsy” things where Ellery wants us to contemplate the meanings of “87” and perhaps it’s metaphysical ramifications on our lives.\n\nI don’t think your missing anything Stephen...this book appears to be exactly what you said. A gallery of numbers from different typefaces.\n\nLook for the exciting sequel to Johnathan Ellery’s “87” entitled “69” due out this summer.\n\n"
    },
    {
      "time": " 27.Feb.2007 10.16pm",
      "content": "I haven’t seen the book. I did visit the link.\n\nPerhaps there is some meaning in the choice and sequencing of type? (If the choice of type used for a book communicates something, cannot multiple such choices say something?) Perhaps this ties in with the arrangement and choice of numbers?\n\nIn crude terms, there is about 10-20 bits of information content per font choice and a similar amount for the layout and choice of numbers. Not a huge amount of explicit information content for a book, but perhaps it’s simply well-compressed with a wealth of implicit information lying in wait for those who choose to seek it out.\n\n"
    },
    {
      "time": " 28.Feb.2007 2.42am",
      "content": "Be that as it may, it still looks great to me ;-)\n\n"
    },
    {
      "time": " 28.Feb.2007 8.14am",
      "content": "A nice antidote to over-designed type specimens.\n\n"
    }
  ]
}
