{
  "id": "31851",
  "title": "Font pet peeve",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "For all you type designers - I often shortcut to a font by starting to type its name into the “character” window and letting the computer fill in the rest, rather than scrolling down the list of activated fonts. I’m currently using Klavika for a project and the computer jumps to fill in “Arrows” rather than Plain or Plain OSF or something I might actually be using. I mean... does anyone actually use those arrows? But Klavika isn’t the only font that does this. Mrs. Eaves jumps to Fractions for example. Is there a way, when constructing a font, for you to take into account the weight or style that the average user would be most likely to want (the plain) and then name the font or its weights in such a way that it becomes the default? And then if we want the caps or fractions or the... arrows... we can scroll to it manually.\n\nOr is this a font management software question? I should add that the same thing happens in both Quark and InDesign. It’s a small annoyance of course but the time spent scrolling needlessly through font menus does add up.\n\n [‹ New journal on letterpress](http://web.archive.org/web/20081204115511/http:/www.typophile.com/node/31878 \"Go to previous forum topic\") [commercial font starter pack? ›](http://web.archive.org/web/20081204115511/http:/www.typophile.com/node/31659 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081204115511/http://www.typophile.com/user/3275\" title=\"View user profile.\">pattyfab</a>",
  "time": "<br>",
  "uid": "3275",
  "comments": [
    {
      "time": " 28.Feb.2007 8.22am",
      "content": "Have you considered using a font manager to disable the fonts that you rarely use?\n\n"
    },
    {
      "time": " 28.Feb.2007 8.33am",
      "content": "Yes, I do that. That’s not the problem, it’s just that I find it quicker to start typing in the font name to the Character window and it would be nice if the default would come up as Plain rather than the obscure Arrows or Fractions. I was wondering if this was something font designers could take into account as they name their fonts. It takes more time to scroll thru a list - and since I work on several projects at a time the list of active fonts can get long.\n\n"
    },
    {
      "time": " 28.Feb.2007 8.38am",
      "content": "This is not something foundries can address, unless they name their odd fonts, eg “Z Arrows”. The problem is that whiile application menus sort family members according to weight, irrespective of actual font style name, they sort “non-weight” names literally by alphabetic order.\n\n"
    },
    {
      "time": " 28.Feb.2007 8.39am",
      "content": "Patty, you might also put this question to the guys that hang out in the BUILD area. Sometimes they don’t notice the threads here.\n\n"
    },
    {
      "time": " 28.Feb.2007 8.41am",
      "content": "I have encountered the same problem when working on a Mac, but not on a PC...\n\n"
    },
    {
      "time": " 28.Feb.2007 9.35am",
      "content": "When we create altered fonts for our weekly circular, we give them font names with numbers in the front of them so that we can call them up faster. Our naming system goes something like this:\n\n1CircularPricePoint  \n2CircularLeadin  \n3CircularCopy  \n4CircularDisclaimer\n\nWhen we change fonts in Quark, we do the keyboard shortcut to get to the font menu, type one number and hit return and we’re there: (shift,option,command M + 1 + return = 1CircularPricePoint)\n\nWe’re all about speed!\n\n"
    },
    {
      "time": " 28.Feb.2007 9.52am",
      "content": "Patty, is it possible for you to use the Opentype version? This would solve the problem...\n\n"
    },
    {
      "time": " 28.Feb.2007 9.55am",
      "content": "If I have it, and am using InDesign, then yes. I don’t have Quark 7 yet.\n\n"
    },
    {
      "time": " 28.Feb.2007 9.57am",
      "content": "This is annoying, but I usually just turn off stuff like arrows and fractions.\n\nWhat really kills me are font foundries that name their font one thing, but have it display a different name so that it appears elsewhere in the font listing. Wittenberger Fraktur, for example, is just Fraktur when I’m trying to go through my font listings, so if it’s active and I try to get an Fr face I end up in the W part of the list. Grrrr....\n\n"
    },
    {
      "time": " 28.Feb.2007 10.33am",
      "content": "Oh yeah, or the foundries that stick their names at the front of it, like FontBureau. I want to search for Agency but it’s Bureau Agency. Or Berthold Akzidenz Grotesk. I can’t be bothered to remember the foundry name for every font!\n\nOr they put their name there and then remove them. I still absent-mindedly look for FF Meta.\n\n"
    },
    {
      "time": " 28.Feb.2007 11.34am",
      "content": "I don’t think even concerted ’good behavior’ ( what ever that might be ) by all the world’s foundries over even 5 years can solve this problem. The only good work-around I see is to let users name their fonts themselves a la iTunes in their font utility. The other option is to simply make ’working’ groups of fonts rather than a giant list. That can save time too.\n\n"
    },
    {
      "time": " 28.Feb.2007 12.31pm",
      "content": "<cite>The only good work-around I see is to let users name their fonts themselves a la iTunes in their font utility.</cite>\n\nOh man, the printers would just _love_ getting those files. And I can just see designers forcing interns to rename all the ugly fonts that ended up with nasty names before giving the files to a client...\n\n"
    },
    {
      "time": " 28.Feb.2007 1.19pm",
      "content": "No no - silly. Not the font files temselves - just the link to the font files. It’s non-destructive titling. And renaming the actual font files would break the fonts.\n\n"
    },
    {
      "time": " 28.Feb.2007 1.43pm",
      "content": "Ahhhhh. Maybe I’ll submit a feature request to Linotype for that. It can go right up there with my desire for software that blocks all system fonts from appearing in font lists.\n\n"
    },
    {
      "time": " 28.Feb.2007 1.49pm",
      "content": "James, use ALL CAPS when you make the latter suggestion. I’d love that!\n\n"
    },
    {
      "time": " 1.Mar.2007 3.18am",
      "content": "But Patty if you’ve defined style sheets for the project you’re working on, why would you need to trawl through the font menu? Often I find myself copying and pasting a word or a line that’s already correctly formatted (style sheet or no) and overtyping the relevant text.\n\nI like Kristin’s solution though – now that’s what I call an industrial strength technique.\n\n"
    }
  ]
}
