{
  "id": "31879",
  "title": "A full set of supercript glyphs",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi all.\n\nDoes anyone know of a font that has a full compliment of superscripted characters in it's glyph set?\n\nMost (including all the Adobe Pro fonts I've looked at) only seem to have a, b, d, e, i, l, m, n, o, r, s, t.\n\nThanks!\n\n",
  "author": "Jordan Harper",
  "time": "1 Mar 2007 — 4:31am",
  "uid": "2278",
  "comments": [
    {
      "time": "1 Mar 2007 — 5:07am",
      "content": "I don't have a clue what kind of style you are looking for? My Sophisto family carry three expert weights, which all have a-z as superscript. Have a look yourself if it fit your purposes?\n\n[Http://www.macrhino.com](http://www.macrhino.com \"Http://www.macrhino.com\")\n\n"
    },
    {
      "time": "1 Mar 2007 — 6:21am",
      "content": "Thanks Stefan, the request is for a friend, he didn't mention what style he wanted, but has since gotten back to me and said Sophisto looks perfect.\n\nHe needs it for embedding into a flash file (something to do with superscript not working natively in flash so he needs to use a font with superscript characters as part of the regular character set).\n\nI'm a bit ignorant when it comes to flash, and he's just asked me:\n\n\"_I need to test that it'll work with standard unicode in XML_\"\n\nI guess he's talking about the characters being part of the standard unicode set rather than 'extras' stuck in to spare unicode slots, so he should be alright I think...?\n\n"
    },
    {
      "time": "1 Mar 2007 — 8:03am",
      "content": "He is more than likely going to need an OpenType font. Type 1 Postscript fonts had to \"lie\" about the character name for anything not in the standard encoding vector, and of course, used glyph names rather than Unicode. TrueType fonts are a bit different, but older ones may not have the correct Unicode for superscripts in the font. I mention this because when someone has characters in a separate \"expert\" font, they usually did so to get around the hard-wired encoding of Quark & older Macs & PCs.\n\nIf Sophisto is not now an OpenType font, I'm sure Mr. Hattenbach could make up a release to do what is needed.\n\nI believe the later issue of Palatino TT (Linotype) has all the lowercase alpha characters as superiors. I don't know of any font that has uppercase superiors. One could be made, of course.\n\nHope this helps\n\n"
    },
    {
      "time": "3 Mar 2007 — 7:56am",
      "content": "Sophisto is OTF ready though not 100% official yet. Just contact my friend and distributor Rodrigo Cavazos at Psy/Ops and he will help you out.\n\n[http://www.psyops.com](http://web.archive.org/web/20150415073844/http:/www.psyops.com/ \"http://www.psyops.com\")\n\nCheers\n\n"
    },
    {
      "time": "3 Mar 2007 — 8:09pm",
      "content": "A couple of (sans serif) fonts on vllg.com feature complete superscript alphabets:  \n [Apex New](http://web.archive.org/web/20150415073844/http:/vllg.com/Thirstype/ApexNew/mudTyper+Weights/) & [Galaxie Polaris](http://web.archive.org/web/20150415073844/http:/vllg.com/Village/GalaxiePolaris/mudTyper+Weights/)\n\n"
    },
    {
      "time": "3 Mar 2007 — 8:45pm",
      "content": "I'll just point out that most superscript letters don't have a standard encoding in Unicode. They may have PUA assignment, if you're lucky.\n\nRegards,\n\nT\n\n"
    }
  ]
}
