{
  "id": "3190",
  "title": "TheSans vs. Frutiger",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Though TheSans and Frutiger are quite similar, I find they have a quite different feel. Does anyone have any background on de Groot's method or whether or not he was inspired by Frutiger (the man or the face)? Any thoughts on the application of either?   \n   \nAttached is a pdf I (quickly) made comparing them.\n\n<!--attachment: thesansfrutiger-26776.pdf*mime_pdf.gif*application/pdf*560.4*TheSans+Frutiger*thesansfrutiger%2epdf --><!--attachment: thesansfrutiger-26776.pdf*mime_pdf.gif*application/pdf*560.4*TheSans+Frutiger*thesansfrutiger%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20130310061826im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\">TheSans Frutiger<br><a href=\"http://web.archive.org/web/20130310061826/http:/www.typophile.com/forums/messages/30/thesansfrutiger-26776.pdf\" target=\"_blank\"><b>thesansfrutiger.pdf</b></a> (560.4 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "whoisdan",
  "time": "18 Feb 2004 — 4:53pm",
  "uid": "2739",
  "comments": [
    {
      "time": "19 Feb 2004 — 6:02am",
      "content": "I suspect that Frutiger has been the single most influential typeface in the past thirty years. It established a pattern of opening the counters of the round letters c, e, etc., which has been widely followed, including by de Groot's Thesis. You can see it in many, many other sans, including Myriad - which is more humanist than Frutiger, though. [Helvetica etc are the most closed by comparison, and the tide has been running against them.]   \n   \nI recently ran across [Adsans](http://web.archive.org/web/20130310061826/http:/www.myfonts.com/Search?searchtext=adsans) of Walter Tracy, which opens the counters in a similar way, and is a decade older. I don't think it is artistically as successful, but it is a similar idea. I would be interested in the history of this opening of counters - which is a theme in Bringhurst - if anyone knows more about it.   \n   \nThesis TheSans, compared to Frutiger, not only opens up the c and e more, but straightens the arms, and alters the shapes of the pdq to match; the hmn look narrower, it has a binocular g, etc. I don't think it is that close to Frutiger, compared to many others who also show Frutiger's (or is it Adsans?) heritage.\n\n"
    },
    {
      "time": "19 Feb 2004 — 6:27am",
      "content": "\\>has been the single most influential typeface in the past thirty years. It established a pattern of opening the counters   \n   \nDidn't someone here make the suggestion that Frutiger could be considered the beginning of a whole new family of sans faces. Along the geometric/grotesk/humanist classification. I don't have time to hunt for the post right now, but I don't think I'd disagree with that idea.   \n   \n\\>I don't think it is that close to Frutiger   \n   \nI'd agree with William. I think faces like Prima & Myriad are much closer in spirit to Frutiger. IMHO, TheSans is much closer to a 'humanist' sans. Cf. the p, q, b, g, and the italics. Freakin' love that bloody Q.\n\n"
    },
    {
      "time": "19 Feb 2004 — 8:07am",
      "content": "Wasn't Gill Sans/London Underground one of the first to claim these features? Gill was designed in the 20's-30's and the other was made in 1916.\n\n"
    },
    {
      "time": "19 Feb 2004 — 8:32am",
      "content": "Frutiger has indeed been hugely influentiable, but de Groot's stuff is of a different school.   \n   \nAs for Adsans, it's not supposed to be \"pretty\" - and technically it's many notches above Frutiger.   \n   \nhhp\n\n"
    },
    {
      "time": "19 Feb 2004 — 8:54am",
      "content": "Any comments on TheSans vs Corpid?   \nBoth by deGroot and the latter based upon Frutiger\n\n"
    },
    {
      "time": "19 Feb 2004 — 9:14am",
      "content": "Matthew, I think you're right. ITC Johnston Underground is not as open as Gill, and I think Frutiger still more open, but the humanist proportions are what does it, and Johnston and Gill I believe started this. As Bringhurst explains, it seems that Frutiger's idea was to bring some humanist features to a more geometrical face. The openness (compared to his 'Universe') also was probably influenced by his task of making very legible signage that could be seen at a distance a Charles DeGaulle Airport.\n\n"
    },
    {
      "time": "19 Feb 2004 — 9:37am",
      "content": "Yeah, myriad is very close to frutiger, but still, a lot of the plain letters of TheSans resemble frutiger. TheSans's italics are fantastic and blow frutiger out of the water.   \n   \nI'm not defending frutiger at all, in fact, I quite dislike it. But though there are a lot of glyphs that don't follow frutiger, I think there are some that do. I'm actually debating my former professor on this. He thinks TheSans is a frutiger knock-off, I think he's crazy. I'm trying to play his side (though it's a weak leg to stand on).   \n   \nThis is awesome input for me. I appreciate it.   \n   \nHrant, how is de Groot's stuff of a different school? As in, it's more fluid, post-modern, rounded, etc? I'm just an observer. Tell me how you _feel_.\n\n"
    },
    {
      "time": "19 Feb 2004 — 9:56am",
      "content": "The prototype for Eras came out in the early 60s (I recall seeing it in some Paris Matchs of that era). There was also Antique Olive. Is the \"unfolded humanist\" a Gallic phenom?\n\n"
    },
    {
      "time": "19 Feb 2004 — 9:56am",
      "content": "I agree, he's crazy. But I am a Frutiger fan. It requires some occasional special considerations, but I've made good use of it. I like its friendly, but not goofy or overly-casual feel.   \n   \nThough, I admit that TheSans's italics are much more interesting than Frutiger's obliques.\n\n"
    },
    {
      "time": "19 Feb 2004 — 10:27am",
      "content": "He's probably not crazy, just not sensitive enough to type.   \n   \n\"School\" probably makes de Groot sound more conformist than he is - he's certainly not a slave to the Noordzij school for example, although my point was exactly that his stuff is more humanist than Frutiger, which is like a not-humanist-enough derivation of Univers (the latter being a neo-grotesk).   \n   \nhhp\n\n"
    },
    {
      "time": "19 Feb 2004 — 10:39am",
      "content": "Eras is very open indeed, but identifont says it's 1986. Is this incorrect?   \n   \nHrant, in what way do you think Adsans is 'technically superior'?\n\n"
    },
    {
      "time": "19 Feb 2004 — 10:43am",
      "content": "Adsans was designed for tiny sizes on lousy paper. Making even a passable lo-fi font is harder than making a great \"normal\" font. Just look at the [intentional mis]alignment in the \"g\".   \n   \nhhp\n\n"
    },
    {
      "time": "19 Feb 2004 — 12:39pm",
      "content": "Don't forget Syntax.   \nIt was released in 1968.   \nSeeing as Linotype released   \nit, I'm guessing Frutiger was   \nvery aware of it and in turn   \nat least a little influenced   \nby it. Just a guess.\n\n"
    },
    {
      "time": "19 Feb 2004 — 2:56pm",
      "content": "Five points to anyone who can give the original (pre-commercial release) name of Frutiger (the typeface, not the man).\n\n"
    },
    {
      "time": "19 Feb 2004 — 3:08pm",
      "content": "Concorde ...\n\n"
    },
    {
      "time": "19 Feb 2004 — 3:34pm",
      "content": "No and no.   \n   \nThis may be a trick question because I guess I'm referring to the prototype from which Frutiger was developed.\n\n"
    },
    {
      "time": "19 Feb 2004 — 4:32pm",
      "content": "Roissy\n\n"
    },
    {
      "time": "19 Feb 2004 — 4:42pm",
      "content": "James cooly snatches the five points off the table! Nicely done.   \n   \n [http://www.linotype.com/13222/frutigerfrutiger-doc.html](http://web.archive.org/web/20130310061826/http:/www.linotype.com/13222/frutigerfrutiger-doc.html)\n\n"
    },
    {
      "time": "19 Feb 2004 — 4:42pm",
      "content": "Dang. James beat me to the five points.   \n   \nRoissy was the village where the Charles de Gaulle airport was actually built (the type having been designed originally for signage at the de Gaulle airport).   \n   \n-- K.\n\n"
    },
    {
      "time": "19 Feb 2004 — 4:47pm",
      "content": "Close enough. In my copy of Frutiger's _Type Sign Symbol_ he refers to it as \"Alphabet Roissy.\" Don't spend those points all in one place, James.\n\n"
    },
    {
      "time": "19 Feb 2004 — 3:10pm",
      "content": "or was it europe?\n\n"
    }
  ]
}
