{
  "id": "31902",
  "title": "Falling into the Vista trap",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "[http://news.bbc.co.uk/1/hi/business/6407419.stm](http://web.archive.org/web/20081016013715/http:/news.bbc.co.uk/1/hi/business/6407419.stm \"http://news.bbc.co.uk/1/hi/business/6407419.stm\")\n\nThe BBC reports the same graphics driver and wireless card issues. So beware.\n\nI somewhat agree but i have solved my Alienware graphics driver issue myself (no f’n help from Nvidia or Alienware). I found a webiste that let’s me download a .ini file that let’s the updated Nvidia Vista graphics driver recognize my graphics card and install.\n\nfull story:  \n [http://vinceconnare.wordpress.com](http://web.archive.org/web/20081016013715/http:/vinceconnare.wordpress.com/ \"http://vinceconnare.wordpress.com\")\n\nUpgrade if you dare. It is good fun though.\n\n [‹ Metal typeface, need help](http://web.archive.org/web/20081016013715/http:/typophile.com/node/31950 \"Go to previous forum topic\") [A full set of supercript glyphs ›](http://web.archive.org/web/20081016013715/http:/typophile.com/node/31879 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081016013715/http://typophile.com/user/7029\" title=\"View user profile.\">vinceconnare</a>",
  "time": "<br>",
  "uid": "7029",
  "comments": [
    {
      "time": " 2.Mar.2007 5.51am",
      "content": "Why not just sidestep the problem and switch to Mac?\n\n"
    },
    {
      "time": " 2.Mar.2007 6.04am",
      "content": "I already have 3 Macs (one is running Windows XP) and 2 Ipods, and a very useless bunch of custom cables and soon to be power cords.\n\nand I don’t want to be an American idiot.\n\n"
    },
    {
      "time": " 2.Mar.2007 7.29am",
      "content": "\\>Why not just sidestep the problem and switch to Mac?\n\nI think Vinnie and the article’s authors problems relate to upgrades. Buying a new machine would seem to be cheating. But if you want a new machine to run Vista then a Mac would likely be a good choice.\n\n"
    },
    {
      "time": " 2.Mar.2007 7.35am",
      "content": "“and I don’t want to be an American idiot.”\n\nBut you’re upgrading to Vista? ;o)\n\n"
    },
    {
      "time": " 2.Mar.2007 8.54am",
      "content": "Si, the new MacBook Pro and Bootcamp don’t support Vista the drivers are for XP and the sound, bluetooth, ControlPanel/startup disk and iSight Camera don’t work with Vista.\n\nVirtualization software also isn’t really supported by Vista,  \n [http://edition.cnn.com/2007/TECH/ptech/02/23/virtual.vista.ap/index.html](http://web.archive.org/web/20081016013715/http:/edition.cnn.com/2007/TECH/ptech/02/23/virtual.vista.ap/index.html \"http://edition.cnn.com/2007/TECH/ptech/02/23/virtual.vista.ap/index.html\")\n\nXP works fine.\n\nMy Vista machine is now a TV and games machine.\n\np.s. I have more than one computer and more than one operating system. I need all these systems for testing and other requirements. Machines they all are.\n\n"
    },
    {
      "time": " 2.Mar.2007 10.24am",
      "content": "I was just venting. Even PC Magazine said that you shouldn’t upgrade to Vista if you want to keep your hair. They recommended that you wait until the hardware catches up with the graphics-intensive ui.\n\nI have a Mac and a PC at home and all PCs at work. I’m the IT guy for 12 person operation. We will not be upgrading any time soon.\n\nLong live Mac...\n\n"
    },
    {
      "time": " 2.Mar.2007 10.52am",
      "content": "\\>We will not be upgrading any time soon.\n\nWhy not? Why wouldn’t moving to Macs work for your company? or are the PCs adequate for the 12 souls who have to use them every day?\n\n"
    },
    {
      "time": " 2.Mar.2007 10.53am",
      "content": "Quick, name a Microsoft “upgrade” that went smoothly.\n\nWait for the hardware; wait for the service pack.\n\n"
    },
    {
      "time": " 2.Mar.2007 10.59am",
      "content": "\\>Quick, name a Microsoft “upgrade” that went smoothly.\n\nAlmost every font update my team has produced. I can actually only think of three or four (out of hundreds) that didn’t go smoothly.\n\n"
    },
    {
      "time": " 2.Mar.2007 11.00am",
      "content": "I suppose I should follow my own advice... Sidestep Microsoft and just get Macintosh. The Boss just can’t see fixing something that (to him) is “not broken.”\n\nSigh, what can you do?\n\n"
    },
    {
      "time": " 2.Mar.2007 11.04am",
      "content": "\\>Sigh, what can you do?\n\nIf you were in Europe you and the other 11 people could form a union and go on strike.\n\n"
    },
    {
      "time": " 2.Mar.2007 11.04am",
      "content": "<cite>Almost every font update my team has produced.</cite>\n\nYou are in charge of a Font Update Team at Microsoft? If you are, why can’t we organize our fonts into sets, why must we live in a linear world?\n\n"
    },
    {
      "time": " 2.Mar.2007 11.07am",
      "content": "\\>why can’t we organize our fonts into sets\n\nI thought you were an IT guy? You could try [this](http://web.archive.org/web/20081016013715/http:/www.extensis.com/en/products/font_management/product_information.jsp?id=1055) or competing products.\n\n"
    },
    {
      "time": " 2.Mar.2007 11.19am",
      "content": " ![](http://web.archive.org/web/20081016013715im_/http:/typophile.com/files/Untitled-6_4268.gif)\n\nNow this is really off topic, but since you question my software knowledge, I must clarify.\n\nThe above image is currently what Photoshop CS 2 spits out on my PC. It looks similar for Microsoft products. Here’s the challenge / question: Why can’t this list, within any program using common user-interface elements, have an organizable folder-font list?\n\nBack on subject, it seems Vista also spits out a linear list of fonts.\n\n"
    },
    {
      "time": " 2.Mar.2007 11.23am",
      "content": "I’m certain Adobe apps use custom controls on Mac and Windows. But that’s a question for Adobe.\n\nCheers, Si\n\n"
    },
    {
      "time": " 3.Mar.2007 10.50pm",
      "content": "Oh, look, more nonsense about Macs...\n\n"
    }
  ]
}
