{
  "id": "31928",
  "title": "Typography poster critique",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "Hi guys! Here's a poster that I did for my typography class. Please let me know on what you like about it, don't like about it and what I can improve on. Thanks!\n\n| Attachment | Size |\n| --- | --- |\n| [dcnposter.jpg](http://web.archive.org/web/20110429004843/http:/typophile.com/files/dcnposter.jpg) | 673.85 KB |\n\n",
  "author": "<a href=\"/web/20110429004843/http://typophile.com/user/17164\" title=\"View user profile.\">c2dawut</a>",
  "time": "<br>",
  "uid": "17164",
  "comments": [
    {
      "time": "",
      "content": "The arrangement of the dates/names/tags is off. Dates are too tight to names compared to the names|tags spacing (partially due to the optical shift from thick to thin). Also, the date numbers and names are not optically aligned on the left; for example, look at the \"10\" above \"Julie.\" These two bits of text might be _metrically_ aligned, but they look out of whack. To make them jive I think you need to hang the arm of the \"1\" ever so slightly to the left (same goes for the bottom 2 dates).\n\nAnd watch that accent over MENDÉZ.\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the comments. What would you recommend on what I could do with the accent over MENDÉZ because if I increase the leading between the dates and the name then it wouldn't look as cohesive.\n\n"
    },
    {
      "time": "",
      "content": "a few quick details: i agree with jason - dates are tight to names compared with other leading.\n\nalso: bullet between dates for michael gabellini is not centered as in all others.\n\nkerning in julie b a rgman is inconsistent -  \n-other minor kerning tweaks needed in all names.\n\ncomma after cooper-hewitt on far left hits lower line - similar to accent problem in mendez. my self taught work around for those problems is to kern and letterspace like a madman until the offending commas or accents find comfortable homes.\n\nfun poster.\n\n"
    },
    {
      "time": "",
      "content": "Watch the comma growing out of the 'S' in \"STREET\" (on the left).\n\n- Lex\n\n"
    },
    {
      "time": "",
      "content": "Here's an updated version of the poster. I changed all the stuff that you guys mentioned and I also changed a couple of things. Tell me what you guys think.\n\n ![](http://web.archive.org/web/20110429004843im_/http:/typophile.com/files/dcnposter2_4679.jpg)\n\n"
    },
    {
      "time": "",
      "content": "Those dates are still a problem, perhaps worse now as they're floating away from the names, mainly due to the fact that you're trying to make room for that accent in Rebeca's last name. I'd suggest bringing the size of the dates down a bit so that the accent can fit under \"PM\" and then you can tighten up the leading between the dates & names.\n\nThe left-alignment of the dates & names still looks off as well. To totally solve this problem you might sheer the beaks off of the \"1\"s, although that's rather drastic.\n\nFinally, make sure that \"PM\" is top aligned with the numbers; at the moment they're super-scripted a bit too high for your purposes.\n\n"
    },
    {
      "time": "",
      "content": "I'd do some more concepts.\n\n"
    }
  ]
}
