{
  "id": "31936",
  "title": "Type ideas",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hey Guys,\n\nI have been given the pleasure of creating an identity for an alternative energy company. In short their value proposition is to provide cost effective ways to convert waste into useful energy, hopefully resulting in energy independence for the US. The communication needs are a real challenge due to the following objectives:\n\nKey Words & Emotive Phrases  \n• Urgency ~ These technologies are needed, now.  \n• Savvy  \n• Progressive ~ They mentioned Apple as a brand and philosophy they admired. Non-traditional  \n• Recycle, renew ~ The underlying concept. However slightly different than the traditional recycling model.  \n• Heart ~ Passion for what they do and how they can help.  \n• Green  \n• Simple  \n• Clean\n\nThe Must Nots  \n• Must not be associated with the traditional Environmentalist crazies.  \n• Must not appear to be a “tree hugger” company.\n\nSo the challenge is to be professional enough to be taken seriously while leaving an element of environmental purity. I’m not so much asking for ideas on the mark (unless you feel like dropping an idea) although I would greatly appreciate any typefaces that would communicate or closely communicate the objectives at hand. You guys are the best so please let the links roll :)\n\n [‹ Tattoo/Tribal Vector Art](http://web.archive.org/web/20071115033745/http:/www.typophile.com/node/31853 \"Go to previous forum topic\") [CANDY & VEER present SweetTalkNYC with Michael C. Place, Elisabeth Arkhipoff & more... ›](http://web.archive.org/web/20071115033745/http:/www.typophile.com/node/31843 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071115033745/http://www.typophile.com/user/14051\" title=\"View user profile.\">shanebo</a>",
  "time": "<br>",
  "uid": "14051",
  "comments": [
    {
      "time": " 2.Mar.2007 5.28pm",
      "content": "Progressive type makes me think of the [Process Type Foundry](http://web.archive.org/web/20071115033745/http:/www.processtypefoundry.com/).\n\n"
    },
    {
      "time": " 2.Mar.2007 7.39pm",
      "content": "A little bit of thought led me to [Beorcana](http://web.archive.org/web/20071115033745/http:/beorcana.com/specs2.html), brand new from [Carl Crossgrove](http://web.archive.org/web/20071115033745/http:/www.typophile.com/wiki/Carl%252BCrossgrove) and much discussed on Typophile. It’s non-traditional, but in a different way than Apple’s (I think now over-imitated) ultra-clean, sleek identity. It has a real warm and human feel to it, which is right up your company’s alley. A concern might be that the strong humanistic element would lead a bit to the “tree-hugger” feel, but I think that it’s clean and refined enough that it wouldn’t be a problem if handled correctly. I think, ultimately, its utility rests in your hands; I shudder at the poor uses of Optima I see floating about, but I believe that smart, considerate use of Beorcana for the company might be an interesting move.\n\n"
    },
    {
      "time": " 2.Mar.2007 8.29pm",
      "content": "[anthony sheret](http://web.archive.org/web/20071115033745/http:/www.mynteer.co.uk/lunch/projects/2004/Councill/index.htm) has what you need ;) just as an inspiration..\n\nhis full website is under [www.workbylunch.com](http://web.archive.org/web/20071115033745/http:/www.workbylunch.com/ \"www.workbylunch.com\")\n\n"
    },
    {
      "time": " 3.Mar.2007 10.54am",
      "content": "Great ideas guys, thanks for the examples and links... I was thinking of using Neue Sans from [http://www.ourtype.be/](http://web.archive.org/web/20071115033745/http:/www.ourtype.be/ \"http://www.ourtype.be/\")?\n\n"
    }
  ]
}
