{
  "id": "31938",
  "title": "Most overused typeface",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Quick one,\n\nIf you were picking one typeface that you thought was played out, overused, or too easy, what would you pick?\n\nHelvetica, Times New Roman, Comic Sans, Cooper Black?\n\nWhat?\n\n",
  "author": "<a href=\"user/8034\" title=\"View user profile.\">evilfansanfran</a>",
  "time": "<br>",
  "uid": "8034",
  "comments": [
    {
      "time": " 2 March, 2007 - 6:17pm",
      "content": "Souvenir.\n\n"
    },
    {
      "time": " 2 March, 2007 - 6:40pm",
      "content": "This is one of those questions that tells people how old you are, right?\n\n"
    },
    {
      "time": " 2 March, 2007 - 7:18pm",
      "content": "Benguiat.\n\nAnd all of the above.\n\n_This is one of those questions that tells people how old you are, right?_\n\nI think it’s more a factor of where one lives….\n\n"
    },
    {
      "time": " 2 March, 2007 - 7:18pm",
      "content": "There are so many that I come to think of as ‘played out’, but do take this as humorous provocation:  \nMeta, Bliss, Dax and Thesis The Sans. Everything ‘funny’ from Emigre. Times Roman and Helvetica, especially when Helvetica is used in a Swiss-style design. Bodoni is too easy. Palatino is too easy as well. Verdana. Adobe Garamond and Rotis Sans. Any kind of DIN, come free or at € 100. All Gill Sans cuts except the ultra bold. Ariel of course. Interstate. Kabel and Lithos are rarely seen, but never the less always inappropriate.\n\nThat’s all for now I guess. It felt good to just get it out.\n\n"
    },
    {
      "time": " 2 March, 2007 - 8:47pm",
      "content": "Trajan, in Hollywood\n\nBickham on wedding invitations\n\nAvant Garde\n\nIt’s not really fair to include the fonts that come with your system - Helvetica, Verdana, Palatino, Times, Comic Sans, etc since the non-designers that lurk among us will use those by default.\n\n"
    },
    {
      "time": " 2 March, 2007 - 8:50pm",
      "content": "In that case, it’s gotta be Papyrus.\n\n"
    },
    {
      "time": " 2 March, 2007 - 9:42pm",
      "content": "As much as I like it, I’m going to have to say Avenir is getting played out pretty bad. I’m sick of all the Myriad variations, too.\n\n"
    },
    {
      "time": " 2 March, 2007 - 9:45pm",
      "content": "Papyrus, although it seems to be fading now.\n\nI see Arial used in print way too often. Why the hell am I even going to design school if I’m just going to end up working for people who won’t pay for non-screen fonts?\n\nAll grunge fonts.\n\n"
    },
    {
      "time": " 3 March, 2007 - 1:05am",
      "content": "Ugly Arial.\n\n"
    },
    {
      "time": " 3 March, 2007 - 1:14am",
      "content": "Re: _I’m sick of all the Myriad variations, too._\n\nDon’t you mean all the Frutiger variations.\n\n"
    },
    {
      "time": " 3 March, 2007 - 3:39am",
      "content": "Chuck\\> I think the link is closer now towards Myriad. That face really got the ball rolling again with ‘informational’ (ultra readable, ultra-ledgible) san serif design. (almost industrial in nature. Maybe Thomas Phinney can chime in on this one.\n\nI can’t get tired of Myriad. I think its better than other humanist sans that have that soft geometric feel. I’ll take Myriad over Bliss, Fruitiger, and even Kievit (which is very good but no cigar next to Myriad- in some ways).\n\nOthers that are played out: University Roman, Footlight, Decotura\n\n"
    },
    {
      "time": " 3 March, 2007 - 4:09am",
      "content": "<cite>I think it’s more a factor of where one lives….</cite>\n\nI guess most of you people don’t remember the time when designers looked at what fonts a printer had before selecting the typefaces. Back in the late ’50s/early ’60s, a <cite>full</cite> font family cost about half as much as a new Ford or Chevy. I can remember one designer asking if using bold meant a magazine change (in which case, he’d do something different). And a lot of designers were real tired of Times long before it was a “system font” — which didn’t make it overused. I think it not right to equate “designer boredom” with “overuse.”\n\n"
    },
    {
      "time": " 3 March, 2007 - 4:23am",
      "content": "Chuck - you are right - my thoughts exactly. Many don’t know or realize the beauty of Frutiger…\n\nThis question really does depend on the era you are in. In the 1980s it was Benguiat. In the 1990s we called Copperplate - the Helvetica for the 90s (see how quickly we forgot how overused it was…)\n\nAs the 21st Century approached we were inundated with Papyrus and Bodega. Hollywood reallly did take advantage of Trajan - and Trajan-type titling fonts.\n\nAnd Charles - I couldn’t have said it better about type shops sick of Times Roman. And the cost of a family for Alphatype/Berthold was $30 per font PLUS if it was an ITC, TS, BE add an additional $30 per font - so the complete set of ITC Lubalin - 4 weights, 4 italic counterparts was 8 x $60 or $480. Not quite the price of a Ford or Chevy — unless, you are talking about hot type — now how much was a family in metal?\n\nBTW - as typesetters we were also sick of using Radiant Bold for headlines….\n\nP.S. For 2006 in the freebie world - many of us that ID fonts are tired of ID’ing Scriptina and Black Chancery. Doesn’t anyone pick anything original anymore? Especially since the average Joe at home can obtain more fonts than the largest typeshop in all of Manhattan during their most viable times…\n\n"
    },
    {
      "time": " 3 March, 2007 - 5:14am",
      "content": "<cite>Not quite the price of a Ford or Chevy — unless, you are talking about hot type — now how much was a family in metal?</cite>\n\nI was talking metal — Linotype — and I admit I was loading the deck for drama — several sizes (8, 9, 10, 11, 12 plus a display or two) …\n\nI dunno what system you used, but a Linotron 202 font was around $200 — five or 10 bucks more for ITC licensed font.\n\n"
    },
    {
      "time": " 4 March, 2007 - 2:26am",
      "content": "Yes – Letraset was never cheap, either; wot, a whopping £4 a sheet and you never got to re-use the characters?\n\nTo answer Eddies original question, and to affirm Claus’ earlier reply, whenever anyone says ‘played out or overused font’ to me, Barry Deck’s [Template Gothic](http://web.archive.org/web/20070308154853/http:/redesign.emigre.com/EFfeature.php?di=125) always comes to mind.\n\n"
    },
    {
      "time": " 4 March, 2007 - 10:15am",
      "content": "I spotted two really horrific uses of Papyrus yesterday — one is the titling for the “documentary” about the burial site of Jesus, the other in a rather pricey “art” book. aaaarrrrggggghhhhhhhh\n\n"
    },
    {
      "time": " 4 March, 2007 - 1:23pm",
      "content": "My “favorite” use of Papyrus is in the US edition of the board game [<cite>Tigris &amp; Euphrates</cite>](http://web.archive.org/web/20070308154853/http:/www.boardgamegeek.com/game/42), published by [Mayfair Games](http://web.archive.org/web/20070308154853/http:/www.mayfairgames.com/).\n\nPapyrus is used, in ALL CAPS and in varying degrees of squooshedness, on both the [box](http://web.archive.org/web/20070308154853/http:/s3.amazonaws.com/boardgamegeek/images/pic116608.jpg) and the [game board](http://web.archive.org/web/20070308154853/http:/s3.amazonaws.com/boardgamegeek/images/pic149759.jpg) itself.\n\n<cite>Tigris &amp; Euphrates</cite> is an absolutely wonderful game; it’s currently ranked #2 out of the thousands of games listed on [BoardGameGeek](http://web.archive.org/web/20070308154853/http:/www.boardgamegeek.com/) (which is like the [IMDb](http://web.archive.org/web/20070308154853/http:/www.imdb.com/) of board games). But man, is it painful to look at. (The [box art](http://web.archive.org/web/20070308154853/http:/s3.amazonaws.com/boardgamegeek/images/pic1164.jpg) and [game board](http://web.archive.org/web/20070308154853/http:/s3.amazonaws.com/boardgamegeek/images/pic15.jpg) in the original German edition were both far superior.)\n\nThe Mayfair edition is so painful to look at that a guy named [Mike Doyle](http://web.archive.org/web/20070308154853/http:/mdoyle2.blogspot.com/) decided to create his own [replacement design](http://web.archive.org/web/20070308154853/http:/mdoyle2.blogspot.com/2006/07/euphrat-tigris.html) of the game as a personal project.\n\nHe chose not to use Papyrus.\n\n"
    },
    {
      "time": " 4 March, 2007 - 2:50pm",
      "content": "Nothing beats the crummy “French“ restaurant that opened around the corner using Papyrus for its logo. Fortunately the food ended up being just as bad as the design, and its replacement uses a nice heavy Didot.\n\n"
    },
    {
      "time": " 4 March, 2007 - 3:57pm",
      "content": "For me, Myriad was new and interesting when Apple really popularized it a few years ago, but now that quite a few companies (e.g. Northwest Airlines) use it, its novelty (at least for me) has worn off. That said, it is still an amazing font and one of my favorites.\n\n"
    },
    {
      "time": " 4 March, 2007 - 11:00pm",
      "content": "All my books are written in Garamond. I do enjoy how it looks :)\n\n"
    },
    {
      "time": " 5 March, 2007 - 9:54am",
      "content": "I have spotted Cezanne quite a bit recently … mainly in restaurants and on book jackets.\n\n"
    },
    {
      "time": " 5 March, 2007 - 10:14am",
      "content": "Arial, Helvetica, Time New Roman, Garamond and all the script one who are unreadable.\n\n"
    },
    {
      "time": " 5 March, 2007 - 10:28am",
      "content": "<cite>Tigris &amp; Euphrates is an absolutely wonderful game</cite>\n\nYes, the US army seems to be enjoying this game a lot.\n\n"
    },
    {
      "time": " 5 March, 2007 - 11:29am",
      "content": "I think the idea of this and similar threads is somewhat misconceived. True, we simply get tired of some typefaces from seeing them constantly.\n\nHowever, in the case of good typefaces like Times New Roman, I think the distaste comes more from seeing them widely used badly. For example Helvetica, which I really have a distaste for, is constantly used for text, where it never works well, IMHO. But it does work for display, and can still succeed in a design if used well. I personally won’t like it, but then I spend way more than normal time looking at type.\n\nEven the much-reviled Comic Sans can work beautifully in the right setting. Here is an example of Comic Sans used beautifully:\n\n ![](http://web.archive.org/files/goodcomicsans_4230.gif)\n  \n. \n\nThe use, a school for children, is suitable for the faux childishness of Comic Sans, and its ‘ductus’ perfectly matches the ‘seal script’ style of Chinese writing used on the sides of the sign. The Seal Script style comes from routing out lines in material. Then the bright colors reinforce the ‘happy school’ image. This is from Manhattan’s China Town.\n\nBy the way, I am not of the school that “there are no bad typefaces, only bad use of typefaces”. The first time University Roman was used it was too much already. :)\n\nMy point here is rather there is an important difference between extensive inappropriate use of a good typeface, such as Times New Roman, and the use of a bad one, like University Roman.\n\n"
    },
    {
      "time": " 5 March, 2007 - 11:42am",
      "content": "The first thing I thought of when reading the thread title was Cezanne. As already mentioned I’ve been seeing this pop up everywhere from menus to apartment signs.\n\nAnd I completely agree with the overuse of Papyrus (cringe).\n\n"
    },
    {
      "time": " 5 March, 2007 - 11:50am",
      "content": "And I’m cringing at the Benguiat in the reflection under the Comic Sans sign. There’s another font that was overused from the word go.\n\n"
    },
    {
      "time": " 5 March, 2007 - 11:57am",
      "content": "Even a \\*reflection\\* of Benguiat in window glass bothers you?\n\nWow, I am awstruck.\n\nAs a typoholic I bow to the master: I’m not worthy, I’m not worthy :)\n\n"
    },
    {
      "time": " 5 March, 2007 - 1:05pm",
      "content": "Trajan, if you are designing movie posters.\n\n"
    },
    {
      "time": " 5 March, 2007 - 3:13pm",
      "content": "_Even a \\*reflection\\* of Benguiat in window glass bothers you?_\n\nYes. If I see that cap A one more time, I’m going to scream…. :-P\n\n(And then there’s an Italian restaurant near us that has their sign in Park Avenue — green lettering on a white background — and I swear the Uc letters are two feet tall. In wedding invites is bad enough, but this sign is enough to drive any Typophile nuts.)\n\n(P.S. And their food’s awful too!)\n\n"
    },
    {
      "time": " 5 March, 2007 - 7:51pm",
      "content": "Mistral seems to be the font of choice for hair salons throughout northern NJ.\n\n"
    },
    {
      "time": " 5 March, 2007 - 10:59pm",
      "content": "There’s nothing wrong with Myriad. It might eventually be overused to the point that Helvetica was once overused, but just like Helvetica, it will still be a beautifully designed typeface.\n\nAs already mentioned, my choice of an undeservingly overused font is Papyrus, followed by Zapfino. My nomination for the most widely misused font is probably Verdana — great font at text sizes on a monitor, but far from ideal for print or display use.\n\nGood, bad, ugly or beautiful, any font that comes with a popular operating system or ubiquitous software suite will be overused and misused.\n\nOh yeah, I almost forgot — newspapers (since most newspaper designs are mostly hacks of other newspaper designs), worship Interstate. Seems there’s scarcely a newspaper left in the U.S. that hasn’t used Interstate.\n\n"
    },
    {
      "time": " 6 March, 2007 - 12:12am",
      "content": "I would like to second **William** ’s comment, and share another example of Comic Sans—one of my least favorite types—brilliantly employed:\n\n ![](http://web.archive.org/files/bargain-bank_4771.jpg)\n\nThe real bank was there first (gold stately letters on black marble), but then a dollar store moved into the space (the “Bargain Bank” at top). So perfect I had to [write about it](http://web.archive.org/web/20070308154853/http:/foundtype.alignedleft.com/2007/01/you-cant-bank-on-it/).\n\n"
    },
    {
      "time": " 6 March, 2007 - 12:42am",
      "content": "now bargain bank look like a place i’d shop!\n\n"
    },
    {
      "time": " 6 March, 2007 - 9:08pm",
      "content": " ![](http://web.archive.org/files/comic_4353.jpg)\n\nmust have been a happy buriel?!?!\n\n:)\n\n"
    },
    {
      "time": " 6 March, 2007 - 10:45pm",
      "content": "Total digression, but during the dot com bust I lived 2 blocks from the Bargain Bank, and there were some amazing deals on high-end cosmetics there as a bunch of the boom-era online cosmetics retailers went belly-up… I miss buying my Zia half price, sigh…\n\n"
    },
    {
      "time": " 7 March, 2007 - 11:17am",
      "content": "Like many others have said, Papyrus looks like the clear winner for now.\n\nGotham is inescapable, too—particularly on the web and TV. It’s becoming near-impossible to go a commercial break without seeing it.\n\n(But, because I like the font, it’s more bothersome in the way you don’t want your favorite band to become too famous—as opposed to wondering how a crappy band got famous in the first place.)\n\n"
    }
  ]
}
