{
  "id": "31949",
  "title": "Bitstream Pageflex anyone?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I've been offered some work with a system called Pageflex, made by Bitstream. Has anyone any experience with this package, or any like it? I'm giving it some thought and wondered if anyone here is uses it or any similar systems (e.g. Quark Server). I'm trying to weigh up whether this system is likely to be in demand or if it will simply vanish whenever Adobe decide to incorporate it into InDesign.\n\n[http://www.bitstream.com/publishing/](http://web.archive.org/web/20150420194341/http:/www.bitstream.com/publishing/ \"http://www.bitstream.com/publishing/\")\n\nAlso I'd also be interested to hear some opinions on how this kind of server technology impacts on font licencing. For example, a font is likely to only be installed on one computer but used by 100s of users to create documents via a web browser. In theory this will eventually lead to the end of large multi-user licences that companies must buy at the moment. Any idea how Bitstream licence their fonts for this?\n\nBy the way, for anyone who can't be bothered to read through Bitstream's rather dull webpage, Pageflex is a server based application whereby all layout files, images, EPSs and fonts are stored on the server and users are able to make low level changes themselves (edit text and images) via a web browser. It can be used for everything from mail merge type usage for letters and business cards at one end of the scale (which currently doesn't require multi-user licencing) to being used by whole marketing departments for the upkeep of corporate literature at the other (currently requiring a multi-user or site licence).\n\nAt the minute its looking like font companies are going to have to change from one-licence-per-CPU to one-licence-per-user licencing.\n\nAny thoughts?\n\n",
  "author": "selfbuildtype",
  "time": "3 Mar 2007 — 5:21am",
  "uid": "863",
  "comments": [
    {
      "time": "3 Mar 2007 — 6:11am",
      "content": "If these systems catch on, we'll probably see designers creating special licensing terms for them, similar to what has happened with firms requiring a special license to embed fonts into PDFs.\n\n"
    },
    {
      "time": "1 Aug 2007 — 11:10am",
      "content": "I have been working with Pageflex for a few years now. The draw back to the system is it's price tag and the fact that you need to create a web application around it if you do not have PageFlex Storefront. Training from PageFlex is minimal and most companies that have even purchased Storefront do not know how to use it and end up shelving the software. So, most companies who have a license and have the knowledge on how to use it are setting up applications to offer a solution to other companies to be able to utilize the capabilitites PF offers without having to purchase their own licenses which can range $100,000 upwards once you add in the additional software and hardware needed for it. I have my own company and we have an online application which does just this. We can set up multiple Accounts with multiple users to be able to utilize the power of Pageflex for variable data and also manage documents, inventory items, Promotional items, PURLs, Landing Pages, etc. We have found that there are other types of softwares that do similar data merging but are more limited than PageFlex. One is XMPie and this works with Adobe's InDesign.\n\nAs companies have become more informed on variable data and marketing techniques utilizing more personalization the need for this type of a software has grown. Most companies realize now more than ever that consumers are getting harder to reach and that their messages need to stand out more to catch the attention of the consumer. Companies want control over their brand marketing and reduce costs. An application set up utilizing PageFlex gives companies an a way to control brand marketing, increase their ROI, and reduce costs, one template can service many users with text, images and even design aspects easily changed on the fly inaccordance to rules set up either based on user profiles or databases.\n\nI can't tell you much about how Bitstream manages the font licensing or how I think this will effect licensing. Fonts are stored on the Pageflex server which is Windows based. Fonts do need be be able to be embedded into PDFs since this is one of the print output formats. If you think about it, don't companies provide their fonts to vendors every time they package pieces for print now and wouldn't this effect licensing also?\n\n"
    },
    {
      "time": "1 Aug 2007 — 11:45am",
      "content": "Thanks for the update Kim. I must have missed this thread when it first surfaced, and only looked into it when your thread bumped it up to the top of the list.\n\nNice to know the rough price of the software ... I was looking through the brochures at bitstream, and was thinking this might be a nice tool to let users muck around and make changes to their project, without messing up the entire Quark or ID file. Of course, with that kind of price, this is not something the average business will buy for proofing work.\n\n\\> If you think about it, don’t companies provide their fonts to vendors every time they package pieces for print now and wouldn’t this effect licensing also?\n\nIf they do, they are violating the majority of foundary licenses.\n\n"
    },
    {
      "time": "2 Aug 2007 — 8:01am",
      "content": "_was thinking this might be a nice tool to let users muck around and make changes to their project, without messing up the entire Quark or ID file._\n\nDon, have you looked into InCopy for InDesign? It lets users change their text without running amok as well. I did a couple of projects with it, and liked not being bothered with \"replace this word with that word\" requests. Unfortunately, they can still do some silliness that might not be wanted in the document.\n\nFrom my brief look at the Bitstream site, I can see similar pros and cons....\n\n"
    },
    {
      "time": "2 Aug 2007 — 8:16am",
      "content": "Linda\n\nI am aware of InCopy, although I haven't used it. I was thinking of the BT app as an alternative to this ... until I saw the price.\n\n"
    },
    {
      "time": "2 Aug 2007 — 3:01pm",
      "content": "Indeed.\n\nI think products like this can (and \"can\" is the operative word) be very useful in the right circumstance, but I'm not sure I'd recommend using InCopy as-is out of the box.\n\nPart of that stems from the defaults, I think: my experience is that unless the InDesign person sets things up so that when the InCopy folks change files, they don't automatically update the InDesign one. I'd set them up to proof the InCopy files the same way I do with Track Changes in Word, so I can see what exactly they've done. Would be nice if that was the default, but it isn't, and you need a fair bit of knowledge up front to do it.\n\n(Had one client that insisted on making style changes in a document that they weren't supposed to tinker with, and every time I got the file back from them, I had to reset the styles. This went on for months....)\n\n"
    }
  ]
}
