{
  "id": "31957",
  "title": "FontLab Frustrations: Metrics Classes Dissapear",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "I'm using FontLab Studio 5 for Windows XP and I keep running into some very frustrating behavior.\n\nAfter importing all of my glyphs, I've created metrics classes and assigned metrics to my font. I then begin creating classes for kerning and, a few minutes into the process, will flip back to my metrics classes to find them all suddenly gone.\n\nAt the very least, thank god, the metrics are still there for each character, so the work isn't 100% lost, but the class-based organization of all that work appears to be gone.\n\nThis is just one of many, many frustrations I have with this program, and while it's functionality in the basic sense is impressive, the interface and general finesse of the program is mind-bogglingly incomplete and unstable. That, combined with the fact that it doesn't appear to come with any help or documentation whatsoever aside from a superficial, semi-incomplete and poorly written manual, is really making me wonder if the price tag is totally justified.\n\nPhew. Just had to vent about that a little.\n\nBut back to the issue at hand, has anyone else have this problem? I admit I could just be doing something wrong or missing something obvious, but the shoddy documentation isn't helping me zero in on the cause.\n\nThanks!\n\n",
  "author": "msa",
  "time": "3 Mar 2007 — 7:04pm",
  "uid": "17100",
  "comments": [
    {
      "time": "4 Mar 2007 — 8:11am",
      "content": "Have you tried saving your metrics/kerning?  \nThen when something disappears, you can just load the saved file back in.\n\n"
    },
    {
      "time": "4 Mar 2007 — 8:30am",
      "content": "Hi MSA,\n\nI am using FL5 with a Mac with OSX and I had the same \"vanished classes\" problem.  \nI think it happened to me specially whe I selected the pull menu to see only kerning or metric classes. When I tried to switch back again to the other classes, they were gone.\n\nNow I keep all the classes visible and of course I save them everytime I do something new.\n\n"
    },
    {
      "time": "5 Mar 2007 — 8:16am",
      "content": "It is a confirmed bug in FontLab Studio 5.0.2 which will be fixed in an upcoming release (though we don't have a specific release date to announce yet).\n\nAdam Twardoch  \nFontlab Ltd.\n\n"
    }
  ]
}
