{
  "id": "31958",
  "title": "Not Obeying the 'Times' Requirement",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Practically all of the paper assignments I get in school say that the font the paper is done in must be \"12 point Times\". Personally, I'm not a huge fan of Times; I respect it because of its widespread use but that's precisely the reason I'm not a huge fan of it. So I've almost always shirked this rule, without being reprimanded (well, not yet). I replace Times with Adobe Garamond; I find this font well-suited for papers.\n\nSo, does anyone else get this same requirement at all? Do you ignore it like I do? If so, what do you replace Times with?\n\n",
  "author": "copperfont",
  "time": "3 Mar 2007 — 7:09pm",
  "uid": "5918",
  "comments": [
    {
      "time": "3 Mar 2007 — 7:42pm",
      "content": "LOL - I once had to typeset the interior of a book for a publishing house - they LOVED Times Roman and didn't want to use it. So we set it in \"Berling\" -- LOL\n\n"
    },
    {
      "time": "3 Mar 2007 — 7:55pm",
      "content": "I used to replace Times New Roman with Minion MM. Never got a complaint.\n\n"
    },
    {
      "time": "3 Mar 2007 — 8:15pm",
      "content": "I'm too scared to do it for my strictly regulated papers, but I cringe every time I turn them in. I have a bit of typographic fun with the title page (Poetica anyone?), but that's about it for my essays. I might decide to use Lido STF now that I'm thinking about it; I can't imagine anyone noticing the change.\n\n"
    },
    {
      "time": "3 Mar 2007 — 8:36pm",
      "content": "You guys are total rebels! I bet you drive 4 miles over the speed limit too!\n\n"
    },
    {
      "time": "3 Mar 2007 — 9:20pm",
      "content": "No more than two , Si.\n\nWell, three if I'm in a crazy mood.\n\n"
    },
    {
      "time": "3 Mar 2007 — 10:08pm",
      "content": "[http://fadtastic.net/2006/03/12/the-secret-lives-of-fonts/](http://web.archive.org/web/20131012022330/http:/fadtastic.net/2006/03/12/the-secret-lives-of-fonts/ \"http://fadtastic.net/2006/03/12/the-secret-lives-of-fonts/\")\n\n"
    },
    {
      "time": "3 Mar 2007 — 10:09pm",
      "content": "I teach design and the reason I require 12 pt Times for papers is page length requirements. You are actually writing a longer paper when you set in it Garamond rather than Times because of the x height. If you are going to replace a font for a paper of required length, choose one that has a larger x height than Times that you can still get away with. And I would notice the change :)\n\n"
    },
    {
      "time": "3 Mar 2007 — 10:09pm",
      "content": "I think the school \"authorities\" are trying to forestall papers submitted in Comic Sans, now can you blame them?\n\n"
    },
    {
      "time": "3 Mar 2007 — 10:14pm",
      "content": "I was really bad. I turned in papers set in Arial because the X-height is huge.\n\nMikey :-)\n\n"
    },
    {
      "time": "4 Mar 2007 — 7:03am",
      "content": "Jonathon, I know that that's the reason why some of my courses require 12 pt Times (as well as double spacing, .5 in. bottom and right margins, and 1 in. top and left margins), but it pains me to have to spoil my (hopefully) beautiful words with subpar design. I've resolved that if I ever teach, I'll let people send in their essays formatted however they want (extra points for proper leading) -- I'll just do a word count on the electronic versions.\n\n"
    },
    {
      "time": "4 Mar 2007 — 7:15am",
      "content": "I remember a metal Times that was quite beautiful. Maybe 12-point Monotype? 14-point Monotype? It did require substantial leading. Long descenders were used.\n\nMoral. Get FontLab, or something simliar, & see what you can do. Lengthen the descenders, and maybe the ascenders a bit. Look at the contrast in the letterforms themselves, & adjust as needed. Maybe expand it just a touch. There use to be a Times Wide, but it was a bit too wide.\n\nBe sure you start with a font where the EULA permits this, of course.\n\n"
    },
    {
      "time": "4 Mar 2007 — 7:26am",
      "content": "I know I am getting to be a broken record on this, but here goes again:\n\nThe main problem with Times on letter sized paper is that the measure is too long. And if you make it big, Times is too black. So it never looks quite right in a single column on letter sized paper.\n\nIt can work very well in small sizes and shorter measures, which is what it was originally designed for.\n\nTo make a single column setting look good on letter sized paper you need a wider font than Times and bigger than usual margins, so that you bring the measure down to near the recommended 2 1/2 lc alphabet lengths.\n\n"
    },
    {
      "time": "4 Mar 2007 — 9:12am",
      "content": "At least Times is a proportional font: when a friend of mine was doing his Ph.D just five years ago, the requirement for his dissertation was that it be set in 12 pt. Courier. No bold allowed, underlining was encouraged, and only sparing use of italics was permitted. (I set up a suite of Word styles for him to use so he's got it right the first time.)\n\nI'm surprised they didn't make him do it on an old typewriter and produce the machine as proof that it hadn't been done on a computer. :-(\n\n"
    },
    {
      "time": "4 Mar 2007 — 11:51am",
      "content": "Lido--and perhaps something like Plantin as well--are similar enough to Times to satisfy both the demand for Times, and your own desire for something different. Taking a little bit of the leading and the margins will only improve it as well without upsetting anyone. However, keep in mind that few teachers actually look at the design of the paper, so your arguments, evidence and use of language are perhaps more worthy of your time in this case.\n\nFrom my own teaching and grading experience, the Times & double spacing rule is still a lot better than what most students (not design) come up with on their own. I think few teachers would actually mind typography that's an improvement over the standard rules, but what many students come up with just makes for even worse reading. Arial is not meant for 15 page-essays, and a sufficiently poor printer will make a poorly readable mess out of MT Garamond any day.\n\n"
    },
    {
      "time": "4 Mar 2007 — 12:07pm",
      "content": "<cite>and a sufficiently poor printer will make a poorly readable mess out of MT Garamond any day.</cite>\n\n. . . as will an offset press running 2400 dpi with a direct-to-plate plate. Monotype made other compromises with it's Garamond in the digital version. The ascenders & descenders are too short; the italic needs some absent ligatures (gy, zy, etc.) All fixable (if you bought it long enough ago to have an old EULA). Maybe that's part of the \"Times\" requirement.\n\n"
    },
    {
      "time": "4 Mar 2007 — 1:57pm",
      "content": "Back to the original question. Is there any evidence that choosing a non-conformist font will result in better grades? I'm sure someone must have researched this? If not, my advice would be to use whichever font you find easiset to read and more importantly proof your work (maybe a well hinted screen-optimised font like Verdana or Arial), then print two copies, one in you favorite print font for your own records and one reformatted in Times.\n\n"
    },
    {
      "time": "4 Mar 2007 — 2:53pm",
      "content": "I also had a suspicion that using a non-Times font (but also not Comic Sans) would result in improved grades, so it's nice to see that some other people think the same way. Like the linked article in reply 6 said, I think it's all a matter of novelty: a teacher/professor reading a hundred papers in Times New Roman will be pleased to see a paper written in a \"similar\" font. Of course, not Comic Sans, even though one of my teachers now favors Arial Narrow and allows us to submit papers in that font.\n\n"
    },
    {
      "time": "4 Mar 2007 — 3:32pm",
      "content": "Arial Narrow??? At what size? Makes my head hurt just to think of trying to read text in it.\n\nCourier was actually well designed to the spec of being a monospaced font that would fill a single column on letter sized paper with a good letter count at 1\" - 1 1/2\" margins.\n\nThere are certainly many more readable ways to go, but you can also do a lot worse.\n\n"
    },
    {
      "time": "4 Mar 2007 — 5:51pm",
      "content": "_Courier was actually well designed to the spec of being a monospaced font that would fill a single column on letter sized paper with a good letter count at 1” - 1 1/2” margins._\n\nBut that was a regulation dating back to the 50s, Bill -- one might think that after the turn of the century that they could update it a little. I mean, geez, no bold but with underlining? :-( \"Retro\" is one thing, but that's a little much....\n\n"
    },
    {
      "time": "4 Mar 2007 — 6:26pm",
      "content": "<cite>Is there any evidence that choosing a non-conformist font will result in better grades?</cite>\n\nThat depends on how you define non-conformist. If a student turned in a paper in Zapf Chancery - or frankly, even Arial - I'd probably send them back to reprint it in a more eye-friendly font. I don't think you want to distract the prof from your writing by using a funky font or \"non-conformist\" design. If they notice the font at all, you probably have a problem.\n\n"
    },
    {
      "time": "4 Mar 2007 — 11:14pm",
      "content": "Thomas, LOL! All I can say is that it could be much much much worse... if you were studying with me at my institution, you would have already come across the requirement to submit postgraduate essays as MS Word .doc files (with default page sizes and margins) in nothing other than 10pt Arial.\n\n"
    },
    {
      "time": "5 Mar 2007 — 12:54am",
      "content": "Goodness. I just realized that if this question comes up here, it is likely for a design major.I like TNR more than most folks on the forum, but I think if I got such an uninspired layout from someone, I'd dock points just for using defaults.\n\nSeveral years ago, \"Someone I know\" wrote three essays on an identical subject, with approximately the same length, similar citations, and equal time and effort put into the mildly different outlines, drafts and finals. To complete the appearance of multiple authors, each was set differently. There was no printed style guidelines. One was TNR, one was Garamond, and the last was Verdana.\n\nThe deceit was never noticed by the teacher. The grades and comments were as follows:\n\nTimes New Roman: A \"Excellent notes\"  \nGaramond(?): A \"Excellent\"  \nVerdana: B+ \"Hard 2 read - use a regular font.\"\n\nWhen I read that fadtastic.net article last week, it reminded me of those results back in Intro to Ethics.  \n:)\n\n"
    },
    {
      "time": "5 Mar 2007 — 1:53am",
      "content": "I just sent my roomate a link to this page and the above mentioned secret lives of fonts page.\n\nHe's two weeks away from graduating and is busting his butt finishing his final term papers, and I figure I owe him a favor. You see, I accidentally deleted Times New Roman off of his PC.\n\nI swear on all that is holy that it was an accident. Honest. But apparently he needs that font, because testing out the \"Can I use something other than TNR?\" theory doesn't pass muster when all you want to do is get it done with and pass.\n\n"
    },
    {
      "time": "5 Mar 2007 — 2:14am",
      "content": "<cite>I remember a metal Times that was quite beautiful.</cite>\n\nAmid all the offset-printed (and even laser-printed) digital Times, I actually love to see letterpress-printed metal Times these days. Especially the Monotype (?) version, without the silly nonkerning \"f\" of the Linotype.\n\n<cite>Moral. Get FontLab, or something simliar, &amp; see what you can do.</cite>\n\nIn principle, I fully support this approach (because I see font \"tuning\" as part of the typographer's job). But wouldn't there be the danger of losing the presumably good hinting of Times New Roman? This might really matter in laser-printed school papers. Or does it only make a difference on-screen? And is just the TrueType version of Times New Roman that has really good hinting? Anyone? I know very little about hinting.\n\n<cite>All fixable (if you bought it long enough ago to have an old EULA).</cite>\n\nCharles, do you have any idea how long ago that might be?\n\n<cite>To make a single column setting look good on letter sized paper you need a wider font than Times</cite>\n\nSome universities here in Finland prescribe Palatino, which would be better in this sense (though, for some reason, I've never been a big fan of it).\n\n<cite>One was TNR, one was Garamond, and the last was Verdana.</cite>\n\nChoz, what kind of Garamond?\n\nOlli\n\n"
    },
    {
      "time": "5 Mar 2007 — 6:06am",
      "content": "Olli,\n\nAs to how old -- a number of our Monotype fonts were issued as PostScript Type 3 fonts. I don't really remember how long ago that was, but I don't think MGaramond was one of those. Still, we got it about that time. We also have a bunch of fonts issued on 5-inch floppys . . .\n\nAs to hinting . . . Well, FontLab auto hint seems to work pretty well. Back when the only decent program font editing program was Fontographer, we found it messed up the hinting, so I always generated fonts without any hinting at all. Worked fine for bookwork, where the output was 1,000dpi or higher on repro paper. We did notice that if anybody put a snippet of the book on the web, it looked pretty bad. When I started working in FontLab, the snippets that wound up on the web looked a lot better.\n\nFontLab is an expensive program for a student, but if you're a <cite>design</cite> student, I don't see how you can get along without it. I don't mean just font designers, but anyone having to design using type.\n\n"
    },
    {
      "time": "5 Mar 2007 — 6:51am",
      "content": "My professors always wanted TNR with 1 inch margins simply because it was easy to ensure everyone wrote within the length guidelines.\n\nHowever, once, in my \"Technical Writing Class\" (aka the cure for insomnia) I turned in the first draft of my formal report project -- which was all about improving the design of one of our major publications, and dumping the Arial currently used -- and for the report, I used the font (Parable) I was proposing for the redesign. The professor snarkily remarked that I shouldn't try to be \"original\" I should be using something \"normal\" like TNR. Bah.\n\nI received my lowest grade all year from that dude.\n\n(I admit to driving even 10 km over the speed limit \\*blush\\*)\n\nK.\n\n"
    },
    {
      "time": "5 Mar 2007 — 6:54am",
      "content": "Charles,\n\nI do have FontLab (and Fontographer). I am a beginner, but so far, I haven't really noticed any difference between the original and FontLab-modified (autohinted) OpenType PS fonts, when printed on my not-so-good Brother laser. (But I haven't really done a systematic comparison.) I just sort of assumed that it might be different with really good hand-edited TT hinting.\n\nAs to the MT EULA: so they have changed it, disallowing modification, at some point? If so, I could envision trying to buy the old versions off someone, in case the EULA allows the licence to be transferred ...\n\nOll\n\n"
    },
    {
      "time": "5 Mar 2007 — 8:09am",
      "content": "Kristina,  \nI am sure your class was taught by a lifelong technical editor. Some of those guys are notorious for sticking by anything resembling a rule. I think the worst of them dissallow anything unless you can you prove you have a printed rule which specifially says what you are doing is correct in the eyes of all things holy and secular in the world. I am surprised they did not mandate 10 pitch typewriter double spaced on 25% rag content watermarked bond.\n\nChrisL\n\n"
    },
    {
      "time": "5 Mar 2007 — 8:11am",
      "content": "Speaking as someone who sets paper assignments himself, I'm pretty sure that--as Thomas (above) may have been thinking--most instructors who specify fonts in the directions are trying to avoid students using Comic Sans or Copperplate Gothic to write a 10-page paper, and that most of those instructors in turn don't care if they ask for TNR and get Garamond, or Palatino/Bookman Antiqua, or Georgia. (This may be a holdover from the early days of desktop publishing, when too many people were stoked that they didn't have to settle for typewriter fonts, and instructors felt they needed to say something to prevent 10 pages of Monotype Corsiva.)\n\nThings may be different in design courses, though.\n\n"
    },
    {
      "time": "5 Mar 2007 — 8:39am",
      "content": "On the issue of comparable length, there is a similar, and more hard-and -fast rule on screenplays: they must be in 12 pt Courier, with a standard formatting.\n\nThe format has stubbornly and rigidly persisted because then one page equals approximately one minute of screen time, which is an important measure for everybody.\n\n"
    },
    {
      "time": "5 Mar 2007 — 8:51am",
      "content": "_Choz, what kind of Garamond?_\n\nI really tried to recall last night when posting, but could not. This was around 1998-1999, If there was a TrueType pack-in in any of Photoshop, Office or CorelDraw (5?), that would have been what was used.\n\nI wold have to say that Maurice has described the status quo rather well. Unfortunately, there are more than a few overly-anal teachers out there, who will dock for non-TNR, but this is countered by the fact that they can't tell it from Georgia. Which is probably what I would use to compromise these days.\n\nAnd there are some lay-folk who just hate sans. No joke.\n\n"
    },
    {
      "time": "6 Mar 2007 — 9:35am",
      "content": "Luckily I don't have, and never had, teachers that are so strict about the typeface. Last time I wrote a paper, I set it in FF Legato (with some bits and pieces in a serif, but can't remember which atm).\n\nThe teacher actually commented that he liked the typography. :)\n\n"
    },
    {
      "time": "6 Mar 2007 — 9:49am",
      "content": "Haven't read the whole thread maybe someone else is as guilty as I am.\n\nI'm one of those teachers that required my students to use a specific typeface for their papers. At first it was a point size requirement -- when I was still a student. But then the students found typefaces which were huge at 12 pt -- I'm even guilty of this. So when I became a teacher -- as mean as this sounds -- I gave the students margins, point size, typeface and linespacing requirements.\n\n"
    },
    {
      "time": "6 Mar 2007 — 10:11am",
      "content": "When my mother was finishing her degree, she had a professor that would mark up the page with a template he had cut out and anything that fell outside of the template counted for automatic deductions. He was very strict in how your page was set up, and this was for a sociology degree, nothing to do with design.\n\nMy wife is working on her second degree in the medical field and she last year handed a paper in twice because it wasn't printed in the right font, that was more out of her own fear, but the teacher never commented either way, she actually lost the correct one and handed back the 'incorrect' one.\n\nBut speaking of TNR use at 12pts. This past month we've been dealing with a client that insists their annual report be set like that. They actually complained about it not being set in TNR to begin with. Some people have no sense for aesthetics.\n\n"
    },
    {
      "time": "6 Mar 2007 — 10:17am",
      "content": "in HS i had page requirements, but i only remember word count requirements in college.\n\n"
    },
    {
      "time": "6 Mar 2007 — 10:17am",
      "content": "BTW I dislike Times New Roman as much as the next person. For me it wasn't for design reasons but to make sure the students were writing an honest amount. But, I wonder if some teachers might be guilty of being pedantic.\n\n"
    },
    {
      "time": "6 Mar 2007 — 10:18am",
      "content": "I had word count requirements for my students also.\n\n"
    },
    {
      "time": "6 Mar 2007 — 10:33am",
      "content": "Wordcount software is easy to find and comes with Word. It makes more sense than some pointsize and font rule. I taught before there was wordprocessing so I simply requested papers be typewritten but gave no strict margin regulation. I was more interested in the quality of the writing and the clarity of communication than formatting--this from a graphic designer. The papers I assigned were most often problem briefs and proposals for design solutions. I also had students write constructive critiques of eachother's work.\n\nChrisL\n\n"
    },
    {
      "time": "6 Mar 2007 — 10:33am",
      "content": "For me, it was always word count, because some people would be guilty of changing margin sizes to get it to fit on the acceptable number of pages.\n\n"
    },
    {
      "time": "6 Mar 2007 — 10:51am",
      "content": "Yes, he was quite the teacher. Hours upon hours of going over whether or not to bold second level headers. I think that rather than try to teach us to think for ourselves about the logical progression across the different levels of headers, he was attempting to give us a fool-proof template, which would have been fine if he'd actually given us something...\n\nHowever, what it boiled down to was us taking copious notes on which point size, aligned where, caps or not, bold or not, all hastily sketched on the blackboard... If you deviated, it was \\*wrong\\* but then, he graded \"holistically\", so nothing was ever actually wrong, it was just not the way \"people often do it\" -- which was code for do it this way or die an ugly, painful death. It was near impossible to figure out how he arrived at a grade, because the answer was invariably \"I grade based on the whole of the work\", but he could never point to specific examples of error, only cases of \"it can be done this way, but I prefer the other\".\n\nApologies for the rant. Guess I'm still bitter... Folks like him shouldn't be teaching. He could have drawn up a sample document, labelled with all of the pertinent info, and handed that out to us--and I would have gotten \\*something\\* useful out of the course. Bah humbug.\n\nBut back on topic, I've also had profs who specify 12 point TNR with 1 inch margins, a certain word length, page length and line spacing, and after I dutifully follow instructions and count my words with the software's feature, I discover that the specified word and page lengths don't jive! Bah humbug again.\n\nK.\n\n"
    },
    {
      "time": "6 Mar 2007 — 12:07pm",
      "content": "<cite>But back on topic, I’ve also had profs who specify 12 point TNR with 1 inch margins, a certain word length, page length and line spacing, and after I dutifully follow instructions and count my words with the software’s feature, I discover that the specified word and page lengths don’t jive!</cite>\n\nTimes New Roman is known to be insufficiently groovy to jive.\n\n"
    },
    {
      "time": "6 Mar 2007 — 1:47pm",
      "content": "As a designer, teacher, and publisher from a primarily English Lit background (I teach publication design, Creative Writing and English Lit), my scholarly experience (both as an undergrad and graduate student) and literary experience (as a writer, editor, publisher & teacher) have brought the default 12pt/TNR/double-spaced into play on a variety of fronts.\n\nAs has been discussed here, word-count is a factor primarily because it is asking too much of general Arts students (non-designers) to understand things such as x-height and metrics, and in the end it becomes too much trouble for the instructor to explain for the 1000th time why this font or that isn't appropriate, or how to use the word-count feature in Word, etc., so many instructors simply default to the 12pt/TNR/double-spaced \"standard\" for the sake of their own sanity.\n\nTechnical font issues are another factor that general Arts students can not be expected to grasp; that is, explaining that setting an essay in Adobe Garamond doesn't mean anything if the paper is being submitted electronically and the recipient doesn't have Adobe Garamond installed on their system. PDF is the obvious solution, but unless the student is on a fairly current Mac, it's unlikely they're going to have Acrobat Pro installed.\n\nPerhaps more important, from the reader's position (teacher/editor/etc.), is the attempt at visual annonymity and \"fair play.\" We all know, as designers, that what the text looks like will influence how it is received, but this depends on the aesthetics and training of the writer, or lack thereof. As someone who is to judge the success of a text (essay, etc.), attempts by students at visual style simply tend to create an uneven playing field (uneven in the sense that it almost always hurts the student more than it helps).\n\nRelating to publishing, many editors I know absolutely insist on the 12pt/TNR/double-spaced default not only because it fits into their formula for estimating extent (should they chose to publish a given manuscript), but also because they want and need to focus on the content exclusively. If the text is accepted, the typescript will be handed off to a designer (hopefully), so design (at the evaluation stage) simply distracts.\n\nAs an editor of a small press myself, however, I encourage submitting writers to format their manuscripts how they think fitting, because I'm looking for writers who are aware of the effect typography/design has on the reception of texts. Most of the time this results in horrendous looking submissions, but, frankly, this makes my job easier as an editor when evaluating submissions: if the thing is mired in visual and typographic cliche, then I can be fairly certain that the writer hasn't had enough exposure to well made books to know what makes a well made book. Which means they don't read enough. And if they don't read enough, I seriously doubt their writing is going to appeal to me or stand up to editorial scrutiny.\n\nOn the other hand, as a teacher of English Lit, I need to keep the field as level as possible, because it is not part of the equation to judge first and second year students on their lack of aesthetic sophistication. Attempts at visual style, even the _option_ to make such attempts, at this level, generally puts the student in a position of weakness which they have little chance of overcoming. The technical requirements alone are beyond most undergraduate students, let alone any real awareness of typographic convention or principle. Thus, what results are painful attempts at novelty as a desperate grasp for attention, and in such cases what tends to happen is that the essay not only _looks_ weak, but this influence infects the content as well.\n\nThat said, I always hope for, and from time to time receive, papers from students who are in-tune (and brave) enough to format their papers in a different font that is well-suited both technically (x-height, characters-per-line, etc.) and visually (tone), and, to my mind, such students are to be rewarded, just as students who go beyond expectations in terms of research should be rewarded. Such considerations should not be built into the assignment guidelines, for the reasons above, but students who take the initiative (and risk) to stand out (by actually improving the quality of their essay/paper/submission) deserve, I think, recongition and thus a higher mark.\n\n"
    },
    {
      "time": "6 Mar 2007 — 6:11pm",
      "content": "My company just finished publishing a set of DVDs, one of which covered this exact issue:  \n [http://www.videoaidedinstruction.com/199X.html](http://web.archive.org/web/20131012022330/http:/www.videoaidedinstruction.com/199X.html \"http://www.videoaidedinstruction.com/199X.html\")\n\n(The free study guide for this program included some general recommendations for non-TNR choices...)  \n [http://www.videoaidedinstruction.com/sg/80909/VAI-S199X.pdf](http://web.archive.org/web/20131012022330/http:/www.videoaidedinstruction.com/sg/80909/VAI-S199X.pdf \"http://www.videoaidedinstruction.com/sg/80909/VAI-S199X.pdf\")\n\nLet me know what you think,  \n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "7 Mar 2007 — 9:54am",
      "content": "\"So I’ve almost always shirked this rule\"  \n:) good idea. but you really are not a shirker. The teachers are teaching we hope.\n\nWhat you couldn't do is use 14 pt, or 6 pt. of anything. The idea is that non-typographically inclined students will use Times@12 and typographically inclined students, like for example, yourself, will choose a \"suitable alternative of approximately the same size and length\" but more \"stylistically to your liking/peronality. Then the teachers know who's who by the font, or they don't. For any teacher who doesn't understand what's being taught there, for example, punishing a good font selection of approximately the same size and length for not being Times@12, please don't.\n\n"
    },
    {
      "time": "8 Mar 2007 — 8:28am",
      "content": "What do you all think of the following recommendations:  \nSet your paper _temporarily_ in TNR@12. Note the page (and place on the page) where the last word of your paper appears. Now, set the paper in your preferred typeface (any reasonable alternative to TNR -- Georgia, Minion, Book Antiqua, etc.) and set the point size of the font such that your paper ends in almost exactly the same place.\n\n--Michael.\n\n------------------------------------------------------  \n// love what you do or do something else. //  \nMichael Ebert -- graphic designer, jazz saxophonist, horror movie devotee  \n------------------------------------------------------\n\n"
    },
    {
      "time": "9 Jan 2011 — 11:45pm",
      "content": "An other alternative for TNR is PT Serif, posted as well here: [http://typophile.com/node/54614](http://web.archive.org/web/20131012022330/http:/typophile.com/node/54614 \"http://typophile.com/node/54614\") (\"Alternatives to Times New Roman\" thread).\n\n"
    },
    {
      "time": "10 Jan 2011 — 5:39pm",
      "content": "Although I think that rules are usually best obeyed, it also seems obvious to me that a rule requiring people to set their theses in Times Roman probably got written in order to tell people the old rule about using Courier or another typewriter face is now repealed, and proportional spacing, as is easily done on a laser printer, is now sought.\n\nThus, I think it's unfortunate that the rule is so specific. If someone finds the needs of his thesis are better served by Modern Series 7, or Caslon, or even Helvetica, it should be possible.\n\n"
    },
    {
      "time": "10 Jan 2011 — 5:46pm",
      "content": "As a frequent thesis advisor, I think it should be left up to the thesis advisor. :-)  \n(We are the ones that actually have to read these things!)\n\n"
    },
    {
      "time": "10 Jan 2011 — 6:49pm",
      "content": "Given that alternatives to Times for general typography are being discussed here too, I happened to come across [Rawlinson](http://web.archive.org/web/20131012022330/http:/new.myfonts.com/fonts/terminaldesign/rawlinson/) from Terminal Design.\n\n"
    },
    {
      "time": "11 Jan 2011 — 12:53am",
      "content": "> I happened to come across Rawlinson from Terminal Design.\n\nYour link to MyFonts shows a lovely typeface, but in a single weight and style.  \nA better link should be this:  \n [http://www.terminaldesign.com/order/Rawlinson2/](http://web.archive.org/web/20131012022330/http:/www.terminaldesign.com/order/Rawlinson2/ \"http://www.terminaldesign.com/order/Rawlinson2/\")\n\n"
    }
  ]
}
