{
  "id": "31962",
  "title": "Examples of Serifa?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hey Everyone,\n\nI have a new project I’m starting (school related) and it’s to be set in Serifa.\n\nDoes anyone have some image and/or links to some project that were done in Serifa - I’m looking for everything really new or old.\n\nOf course any great links/information related to Serifa would be greatly appreciated, along with the correct pronunciation of it... :)\n\nThanks,  \nMike\n\n**\\*\\*\\* EDIT \\*\\*\\***\n\nI should add that I have already looked over the Wiki information on Adrian Frutiger, and printed out the Glyph Charts from Adobe (as of right now I only have Serifa Std from Adobe). Does anyone know of a better version of Serifa (maybe with more weights & glyphs) than what Adobe offers?\n\nThanks again,  \nMike\n\n",
  "author": "<a href=\"/web/20091107124019/http://typophile.com/user/14030\" title=\"View user profile.\">rosem</a>",
  "time": "<br>",
  "uid": "14030",
  "comments": [
    {
      "time": " 4.Mar.2007 9.19am",
      "content": "You might like to take a look at Glypha too. Design characteristics make it seem very likely that they are related to Serifa.\n\nGood luck!\n\n"
    },
    {
      "time": " 4.Mar.2007 10.00am",
      "content": "Rumour has it that every graphic designer craves for a new bedmate on every Friday evening and craves for a new typeface on every Monday morning.\n\nI am different: I am the one-type-per-life type.\n\nAlthough I have studied more than 50,000 fonts, I usually only use one font, namely Serifa, which is (in my view) the best slab serif typeface ever made.\n\nMost PDF documents at my website ( [http://www.sanskritweb.net](http://web.archive.org/web/20091107124019/http:/www.sanskritweb.net/ \"http://www.sanskritweb.net\")) are typeset in Serifa, and e.g. my printed textbook of the Sanskrit language is also typeset in Serifa (as far as the Latin script text is concerned):\n\nsee [http://www.sanskritweb.net/deutsch/leseprobe.pdf](http://web.archive.org/web/20091107124019/http:/www.sanskritweb.net/deutsch/leseprobe.pdf \"http://www.sanskritweb.net/deutsch/leseprobe.pdf\")\n\nI have examined various Serifa font versions by Berthold, Compugraphic, URW etc. etc., but I always use the first PostScript version made by Adobe in the late 1980s, and here I only use two cuts, namely Serifa 55 (Serifa normal) and Serifa 75 (Serifa black). I never use the other cuts (Serifa Italic etc.).\n\nThe Adobe Serifa PS font features the original set-width system of the original photocomposition Serifa based on the original Monotype set-width system:\n\nsee [http://www.sanskritweb.net/fontdocs/dickten.pdf](http://web.archive.org/web/20091107124019/http:/www.sanskritweb.net/fontdocs/dickten.pdf \"http://www.sanskritweb.net/fontdocs/dickten.pdf\")\n\n(This is an instructive tutorial on set-widths for schools)\n\nAs stated by Frutiger in his book “Buch der Schriften”, Wiesbaden 2005, page 218-222, all cuts of Serifa were planned and designed entirely simultaneously. That is why Serifa is a perfect slab serif font. The principles of design applied to Serifa are described on page 219 in Frutiger’s book just mentioned.\n\nPS: In the Adobe OpenType Serifa, the left outward curve of the Euro sign between the two cross bars is faulty. I guess, Frutiger never saw and never approved of the Euro sign of the Adobe OT font version.\n\n"
    },
    {
      "time": " 4.Mar.2007 6.51pm",
      "content": "[Tone](http://web.archive.org/web/20091107124019/http:/www.tonedesign.co.uk/)\n\n"
    },
    {
      "time": " 4.Dec.2007 6.35am",
      "content": "<cite>Tone</cite> Is this an example of a use of Serifa? Because I too would like to see some usage examples of this font.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nI know I am in my own little world, but its ok. They know me here\n\n"
    },
    {
      "time": " 4.Dec.2007 7.30am",
      "content": "<cite>Tone Is this an example of a use of Serifa</cite>  \nYep! Just have a look at it.\n\n"
    },
    {
      "time": " 5.Dec.2007 12.59am",
      "content": "LOOOOVE this topic :-) I am a huge Serifa and Glypha fan. They are both by Frutiger and both match up with Univers. Glypha has a larger x-height and sets better for extended text passages (IMO).\n\nGlypha and Serifa Blacks, with manual kerning and tighter tracking, makes for an EXCELLENT titling font. Scangraphics has a “headline” (SH) version of Serifa that accomplishes the same purpose. I have no problem using either Glypha or Serifa (in various weights) as the EXCLUSIVE typeface for a project, with the caveat that documents usually benefit from more leading, and white space in general, than your typical sans/serif typeface combo.\n\nI will admit to being a Clarendon man, and I get giddy over FB Giza for display purposes. But good-old Glypha and Serifa are the everyday slab champs, they are part of my core design fonts.\n\nI cringe when someone chooses Rockwell over these two. Seriously, it gives me the creeps.\n\n"
    },
    {
      "time": " 5.Dec.2007 3.51pm",
      "content": "Anybody ever worked with [Calvert](http://web.archive.org/web/20091107124019/http:/www.myfonts.com/fonts/agfa/calvert-mt/familytree.html)?\n\n"
    },
    {
      "time": " 7.Dec.2007 8.33am",
      "content": "Why all the love for Serifa and Glypha, but no love for Egyptienne F, their good old grand-daddy?\n\n"
    },
    {
      "time": " 7.Dec.2007 1.46pm",
      "content": "I’ve never had any love for [Egyptienne F](http://web.archive.org/web/20091107124019/http:/www.fontshop.com/fonts/downloads/linotype/egyptienne_f_std_ot_virtual/), but a recent conversation with Erik Spiekermann made me rethink it. (His studio recently used it for a major project.) This is another case of needing a proper printed sample at 10 pt. to see its performance as a text face. Online samples don’t do.\n\n"
    },
    {
      "time": " 9.Dec.2007 1.03am",
      "content": "It definitely has a sturdy feel to it. It’s as if Univers were a minimalist feat of structural modernist engineering, and Egyptienne F decided to add a brick facade to the building. And an outhouse.\n\nI like it for a text face, but not for all applications.\n\n"
    },
    {
      "time": " 9.Dec.2007 7.11am",
      "content": "<cite>Egyptienne F, their good old grand-daddy?</cite>\n\nTo me, Egyptienne F feels only like a distant relative of Serifa & Glypha. It rather is the grampa of Caecilia, Silica and especially Chaparral, no?\n\n"
    },
    {
      "time": " 13.Dec.2007 9.03pm",
      "content": "URW Egyptienne is a humongous version of Serifa with 50 variants. But here’s the question, if Frutiger only designed 6 cuts of it, as available from Linotype, how accurate can the extended ranges be?\n\nWas is MM interpolation, or did some poor schmoe actually have to create each cut?\n\n"
    },
    {
      "time": " 14.Dec.2007 11.50am",
      "content": "<cite>Was is MM interpolation, or did some poor schmoe actually have to create each cut?</cite>\n\nAlbert-Jan Pool probably knows … URW Egyptienne has a copyright notice from 1994, and “from 1991 to 1994 he was the manager of Type Design and Production at URW in Hamburg”, according to [MyFonts](http://web.archive.org/web/20091107124019/http:/www.myfonts.com/person/pool/albert-jan/).\n\n"
    },
    {
      "time": " 15.Dec.2007 2.23pm",
      "content": "there’s a new car magazine called 0-60 that i worked on. uses serifa heavily.\n\n"
    },
    {
      "time": " 16.Dec.2007 8.41am",
      "content": "Adrian Frutiger designed Glypha as a metrically identical companion to Serifa so that you could switch from Serifa to Glypha in small point sizes (5, 6, 7, 8 point etc.) **without reflow** of the typeset text. However someone at Adobe tampered with the Glypha metrics with the consequence that Glypha is now only 98%, but no longer 100% identical with Serifa as regards metrics. In short paragraphs of text, reflow may not take place,\n\nsee [http://www.sanskritweb.net/temporary/glypha.pdf](http://web.archive.org/web/20091107124019/http:/www.sanskritweb.net/temporary/glypha.pdf \"http://www.sanskritweb.net/temporary/glypha.pdf\"), page 1\n\nbut in longer text passages, reflow is unavoidable due to stupid metrics tampering done at Adobe. For example, the Glypha-i is now **wider** than the Glypha-j (296 vs. 278 units), while in Frutiger’s original fonts, both Serifa-i/j and Glypha-i/j had been metrically identical.\n\nsee [http://www.sanskritweb.net/temporary/glypha.pdf](http://web.archive.org/web/20091107124019/http:/www.sanskritweb.net/temporary/glypha.pdf \"http://www.sanskritweb.net/temporary/glypha.pdf\"), page 2\n\nTampering is particularly conspicuous concerning punctuation marks (e.g. =, \\>, \\<, \\, ~, |, etc.)\n\n"
    },
    {
      "time": " 16.Dec.2007 10.53am",
      "content": "That’s an interesting observation, Uli. I wonder if that’s the first time that was done before. We’re talking about filmset type, correct?\n\nI’ve seen how you’ve felt about other companies’ “versions” of typefaces, but how do you feel about the _design_ of URW Egyptienne? It does satisfy the original poster’s desire to have “a better version of Serifa (maybe with more weights & glyphs) than what Adobe offers.”\n\nAfter all, if you’re going to use Adobe’s “version,” you might as well use URW++’s.\n\n"
    },
    {
      "time": " 16.Dec.2007 11.31am",
      "content": "\\> We’re talking about filmset type, correct?\n\nLinotype photocomposition also made use of the old Monotype-invented 18-units-per-em-quad set-width system, on which the set-widths of Serifa and Glypha were based.\n\n\\> how do you feel about the design of URW Egyptienne\n\nIn my view, the “URW Egyptienne” fonts are mechanically created multitudes of weights of Serifa. And the “URW Typewriter” fonts are mechanically modified versions of the “URW Egyptienne” fonts: The terminals of stems and serifs and all other sharp angles have been automatically rounded here.\n\n"
    },
    {
      "time": " 20.Dec.2007 8.02am",
      "content": "Just for testing purposes, I back-converted the wrong metrics of Adobe’s Glypha to the original values with the consequence that texts typeset in Serifa and Glypha are again entirely interchangeable. As originally intended by Adrian Frutiger, this is a great advantage especially in very small print, and if Adobe were interested in originality, they would convert Glypha’s metrics back to its original values.\n\nFor comparison see [http://www.sanskritweb.net/temporary/glypha2.pdf](http://web.archive.org/web/20091107124019/http:/www.sanskritweb.net/temporary/glypha2.pdf \"http://www.sanskritweb.net/temporary/glypha2.pdf\")\n\n"
    },
    {
      "time": " 20.Dec.2007 10.27am",
      "content": "Great info, Uli. I love it when you contribute this kind of stuff.\n\n"
    },
    {
      "time": " 20.Dec.2007 11.08am",
      "content": "I don’t see an enormous benefit in metrically compatible designs with different names. For starters, why did Frutiger give them different names, if the one is a small version of another? I also don’t see the benefit of identical metrics and kerning between display fonts and text fonts. I’m sure Uli has an ideologically pure rationale for this, but the fact is that display spacing and kerning is not at all appropriate for small sizes. Unless thre are major differences between Serifa and Glypha shapes and spacing (and I don’t see that), I would hardly expect perfection in small text setting, even from Frutiger. In other words, it’s an interesting trick given the technology of the time, but currently less beneficial to readers than size-specific designs.\n\nMetric compatibility is overrated. It has specific uses, but for very specific uses, we have specialized typefaces like the agates H+F-J did for the Wall Street Journal.\n\nMike, if you are in the market for a larger family of type, then there’s no reason to fixate on Serifa (or Glypha). See the thread:\n\n[http://www.typophile.com/node/40004](http://web.archive.org/web/20091107124019/http:/www.typophile.com/node/40004 \"http://www.typophile.com/node/40004\")\n\n"
    },
    {
      "time": " 20.Dec.2007 11.55pm",
      "content": "\\> I don’t see an enormous benefit in metrically compatible designs\n\nI think the decisive question here is quite another question:\n\nGiven that Adrian Frutiger himself designed Glypha as a metrically identical companion to Serifa, is Adobe allowed to mutilate the original metrics of Glypha?\n\nThere is no doubt that Adobe’s Glypha digitizations GlyphaLTStd.otf, GlyphaLTStd-Black.otf etc. are mutilated reproductions of Frutiger’s original Glypha fonts.\n\nIf you check the metrics of Adobe’s digitization of Glypha, you will find numerous wrong metrics (as compared with the original Glypha).\n\nWhat is more, you will discover that Adobe also “forgot” to defined the side bearings of several glyphs.\n\nsee [http://www.sanskritweb.net/temporary/glypha3.gif](http://web.archive.org/web/20091107124019/http:/www.sanskritweb.net/temporary/glypha3.gif \"http://www.sanskritweb.net/temporary/glypha3.gif\")\n\nSo, the decisive question here is not whether there is “an enormous benefit” by Frutiger’s metrically companion to Serifa, but the crucial question is whether Adobe was allowed to mutilate the metrics of Frutiger’s Glypha.\n\nBy the way, Adobe also did shoddy hinting here. For example, if you start Adobe’s FDK autohint on GlyphaLTStd.otf, you will get this message:\n\n’Error: font has neither StemSnapH nor StdHW!’\n\nAdobe “forgot” to define these values required for proper hinting.\n\n"
    },
    {
      "time": " 21.Dec.2007 12.35am",
      "content": "Now before you go off and start attacking Adobe for something like “mutilating” someone’s typeface, you might want to find out who exactly did the original outlines. Was it an Adobe digitization of the original photofilm outlines, or did someone else do it? Adobe only licenses the typeface, so shouldn’t the real owners be held responsible for making sure the metrics add up properly?\n\nI can see that Uli might have a point about the metrics not fitting up as an answer to Crossgrove’s point. Because they DON’T fit now, we’ll never really get a chance to see the benefit, dubious it may be, of a matching Serifa/Glypha set.\n\n"
    },
    {
      "time": " 21.Dec.2007 9.39am",
      "content": "Mike,\n\nWould you say that “the crucial question is whether Adobe was allowed to mutilate the metrics of Frutiger’s Glypha.”?\n\nPlease check in and let us know your progress.\n\n"
    },
    {
      "time": " 8.Jan.2008 8.55am",
      "content": "Would serifa be suitable for the 25-34 age group for sports apparel?  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nI know I am in my own little world, but its ok. They know me here\n\n"
    },
    {
      "time": " 8.Jan.2008 11.11am",
      "content": "What do YOU think?\n\nThis:\n\n ![](http://web.archive.org/web/20091107124019im_/http:/typophile.com/files/FlemishScript-BT_4788.gif)\n\nOr this (URW Egyptienne = Serifa):\n\n ![](http://web.archive.org/web/20091107124019im_/http:/typophile.com/files/ne-T-Extra-Light_6253.gif)\n  \n\n ![](http://web.archive.org/web/20091107124019im_/http:/typophile.com/files/URW-Egyptienne-T-Bold_4280.gif)\n\n"
    },
    {
      "time": " 8.Jan.2008 11.17am",
      "content": "I thought it would look excellent, but I was seeking some confirmation and your examples clearly solidfy what I was thinking. :)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nI know I am in my own little world, but its ok. They know me here\n\n"
    },
    {
      "time": " 9.Jan.2008 12.35am",
      "content": "[CollegeBoard’s](http://web.archive.org/web/20091107124019/http:/www.collegeboard.com/) identity is built around Serifa.\n\n"
    }
  ]
}
