{
  "id": "31969",
  "title": "Kulby",
  "forum": "Sans Serif",
  "tags": [
    "Sans Serif"
  ],
  "content": "Hello dear Typophiles  \nKulby is a humanist sans I'm currently working on. It's purpose is to be legible at small sizes, yet still be harmonic and not disturbing at larger sizes. Therefore I have avoided ink-traps and other more or less extreme compensations for setting small.\n\nIt's is my first attempt at making a 'real' typeface, but please give it all you got, I want it to become good ;-)\n\nThe two things that are the most difficult for me to spot now after working with it, are the widths of the characters and the character colour (stroke weight).\n\nMany thanks  \nClaus Eggers Sørensen\n\n| Attachment | Size |\n| --- | --- |\n| [Kulby-Medium A4 specimen 0.008.64.pdf](http://web.archive.org/web/20131011231805/http:/typophile.com/files/Kulby-Medium%20A4%20specimen%200.008.64.pdf) | 485.89 KB |\n| [Kulby-Medium A4 specimen 0.009.73.pdf](http://web.archive.org/web/20131011231805/http:/typophile.com/files/Kulby-Medium%20A4%20specimen%200.009.73.pdf) | 486.5 KB |\n| [Spec 14.03.07.pdf](http://web.archive.org/web/20131011231805/http:/typophile.com/files/Spec%2014.03.07.pdf) | 451.23 KB |\n\n",
  "author": "clauses",
  "time": "4 Mar 2007 — 10:59am",
  "uid": "16321",
  "comments": [
    {
      "time": "4 Mar 2007 — 11:26am",
      "content": "Surfing your .pdf : 'X', 't' and diacritics (too light too small) are out of key——cool.\n\n"
    },
    {
      "time": "4 Mar 2007 — 11:34am",
      "content": "The \"g\" is distracting to me. There is a fine line between doing something different or unique, and doing something that will be functional. It is also be a matter of preference, but it sounds like you want to do something that will be readable for lenths of text. If so, I would reconsider that glyph. Overall the face seems to be very well drawn...\n\n"
    },
    {
      "time": "4 Mar 2007 — 12:22pm",
      "content": "i like it... clean and legible\n\nthe lower case g is distracting at first, but makes a nice 'signature'... rian hughes often uses the lower case g in a similar way...\n\nit might just be the pdf, but it all seems a little 'heavy' for 'medium'... are you planning other weights?\n\n"
    },
    {
      "time": "4 Mar 2007 — 1:00pm",
      "content": "Thank you all for you comments.\n\nAlessandro: Out of key? I don't understand. You say the diacritics should be stronger and bigger and I can see what you mean there. Wider 't', yes, but a more heavy 'X' - really? Would others care to comment on that?\n\nChris: The shape of the 'g' is part due to my danish heritage, where that shape has become somewhat of a Danish trait in typedesign, and partly because the decender lenght is so short that any other shape is hard to squeese in - but I'll try again :-)\n\nBrett: Thanks. Perhaps it IS too fat to be called medium, I will compare to others... And yes I'm planning to do a super-family out of it, but I'm taking one step at a time, even though I have started a black weight just to see what happens.\n\n"
    },
    {
      "time": "4 Mar 2007 — 1:08pm",
      "content": "No, \"too light too small\" was referred to the diacritic marks only——I might be wrong but from what I remember (sorry about the time) the 't' seems short and the 'X' having strange diagonals.\n\n"
    },
    {
      "time": "4 Mar 2007 — 1:15pm",
      "content": "Okay thanks, I'll look into that. The X is rather quirky as it stands.\n\n"
    },
    {
      "time": "4 Mar 2007 — 1:16pm",
      "content": "Kulby is very nice--well-balanced and legible. I like the g and think it fits in well with the other characters, but to me it creates an impression that the bottom stroke has been cut off (as if the line below is overwriting the g).\n\nI have two suggestions: First, the top right stroke of the S and s seem to be pointing too much downward. Second, there appears to be an optical illusion in the \"notch\" of the u: because of the curved stroke, the point B seems to be to the left of the point A. This can also be seen in the d and a. It seems to be less prevalent in the n,m,p,etc---maybe because the curved stroke is just starting there and doesn't have as much \"motion\"?\n\n ![](http://web.archive.org/web/20131011231805im_/http:/typophile.com/files/Kulby_u_6398.png)\n\n"
    },
    {
      "time": "4 Mar 2007 — 4:27pm",
      "content": "I'm liking it.  \nI also noticed the optical shift in points on the 'u' (and other similar glyphs), as sgh describes. But this can easily be fixed, by making it optically aligned.  \nI like the 'g', but I can also imagine that for some people it might be distracting. You could always create two g's, as an alternate or something. Or just ignore it. ;)  \nThe horizontal join of the 'k' works well, but I usually like that a lot. Reminiscent of Smijers, which is a good thing.  \nI am not really bothered by the 'X'. The 'z' might be a bit wide, but that is probably a matter of taste.\n\n"
    },
    {
      "time": "4 Mar 2007 — 5:32pm",
      "content": "I love the g. I believe someone reading copy set in the face would probably get used to the g almost immediately. What I find distracting are the wide notches; that is to say, I think the stem-ends are too strongly tapered.\n\n"
    },
    {
      "time": "6 Mar 2007 — 8:28am",
      "content": "Hi there  \nI have made some modifications to the face per your comments. S, s, C and c have been opened up slightly. The way the curve meets the stem in n and related characters have been optically corrected. And finally the diacritics have been beefed up considerably. There is still a problem in getting room for the lower comma-accents, and I not quite sure what to do there. The X have been changed, and the g is now a two storey shape, let me know what you think about that one compared to the previous shape.\n\n"
    },
    {
      "time": "6 Mar 2007 — 3:26pm",
      "content": "Don't completely abandon that first 'g'!  \nI only just realised yesterday where I saw such a 'g' before, in an article somewhere; The typeface for the Danish Railway, at some point anyway. Or still today, I don't know.\n\nNice to see that it's obviously indeed a Danish trait, and that you implemented it in your typeface. I like it.  \nThe double-story is also fine, but I think then you should at least put in both versions. :)\n\n"
    },
    {
      "time": "7 Mar 2007 — 9:12pm",
      "content": "Please don't change the g. I like the face very much, and the the g is quite likely my favorite character in the font. Yes, it's distinctive and stands out a bit, but if necessary (and possible), change some of the other decenders to better match the g. And I'm not even sure that's needed — when seen together the short, abreviated decenders work quite well together, I think.\n\n"
    },
    {
      "time": "8 Mar 2007 — 2:40am",
      "content": "I prefer the first g myself, so it's staying. I did some more work on the widths of f and t since the last pdf. Right now I'm working on a thin version, and if the gods will have it, I should be interpolating weights before the weekend.\n\n"
    }
  ]
}
