{
  "id": "31977",
  "title": "German Type Foundry (GTF) releases Phoenica",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "German Type Foundry releases Phoenica, a legible contemporary humanist sans serifs font family\n\nPhoenica and Phoenica Condensed is offering six weights for both font families, all with true italics. Three extra thin hairline versions are developed additionally to match the challenges for photo and magazine design needs.\n\n_For a limited time Phoenica Std Regular will be available free of charge._  \n [http://www.germantype.com/freetype.htm](http://web.archive.org/web/20131015170844/http:/www.germantype.com/freetype.htm \"http://www.germantype.com/freetype.htm\")\n\nThe fonts coming in two flavors, Pro (Phoenica) and Standard (Phoenica Std), all in OpenType format only. The pro version is covering all bells and whistles you can expect from a high quality type face. Central European, Cyrillic and Greek language support, small caps and all common kinds of numerals are available throughout each font with a bunch of additional symbols and signs. Each Phoenica (Pro) font is covering more than 1000 gylphs.\n\nThe Pro version will be available form the new founded German Type Foundry: [http://www.germantype.com](http://web.archive.org/web/20131015170844/http:/www.germantype.com/ \"http://www.germantype.com\")\n\nPDF Specimen:  \n [http://www.germantype.com/pdf\\_phoen.htm](http://web.archive.org/web/20131015170844/http:/www.germantype.com/pdf_phoen.htm \"http://www.germantype.com/pdf\\_phoen.htm\")\n\nCharacter Set and OpenType Features:  \n [http://www.germantype.com/tech\\_phoen.htm](http://web.archive.org/web/20131015170844/http:/www.germantype.com/tech_phoen.htm \"http://www.germantype.com/tech\\_phoen.htm\")\n\nPhoenica Std is the entry level version of this big font family covering the Latin 1 Western European (ISO-8859-1) character set. The standard version is available from preussTYPE and MyFonts.\n\n[http://www.preusstype.com/fam-phoenica.php](http://web.archive.org/web/20131015170844/http:/www.preusstype.com/fam-phoenica.php \"http://www.preusstype.com/fam-phoenica.php\") -  \n [http://www.myfonts.com/fonts/preusstype/phoenica/](http://web.archive.org/web/20131015170844/http:/www.myfonts.com/fonts/preusstype/phoenica/ \"http://www.myfonts.com/fonts/preusstype/phoenica/\")\n\n ![](http://web.archive.org/web/20131015170844im_/http:/typophile.com/files/Phoenica4_5706.gif)\n\n",
  "author": "andreas",
  "time": "5 Mar 2007 — 2:44am",
  "uid": "655",
  "comments": [
    {
      "time": "5 Mar 2007 — 6:24am",
      "content": "Congratulations, Andreas, this is beautifully balanced, and achieves its own look subtly. Can you tell us some of design ideas that guided you, and differentiates this from other humanist sans?\n\n"
    },
    {
      "time": "5 Mar 2007 — 7:00am",
      "content": "Hello William,\n\nThe typeface is from my friend and colleague Ingo Preuß. Since I know him, he is working on it. The real world specimen - a printed one in German and English is in the works and will hopefully available in a month or two, saying more about the concept behind the typeface.\n\nFor the monent a very short German text is available only.  \n [http://www.germantype.com/cms/info\\_phoen.htm](http://web.archive.org/web/20131015170844/http:/www.germantype.com/cms/info_phoen.htm \"http://www.germantype.com/cms/info\\_phoen.htm\")\n\nWe are busy in making the GTF site usable in English too.\n\n-- [astype.de](http://web.archive.org/web/20131015170844/http:/www.astype.de/)--\n\n"
    },
    {
      "time": "5 Mar 2007 — 8:08am",
      "content": "Oh, congratulations then to Ingo. What I get from the German text is just that this is a development of ideas from Bernard Gothic, which evidently was the first to remove the stems from the mn etc.\n\nIt is interesting to compare this with Daxline, which is also an optically monoline, stemless sans. I prefer Phoenica.\n\n"
    }
  ]
}
