{
  "id": "3198",
  "title": "What did I do wrong? (I messed up my OTF)",
  "forum": "Build",
  "tags": [

  ],
  "content": "Okay so i was converting a TTF to a postscript flavoured OTF on my PC using FontLab. I installed it on my Mac this morning, but none of my applications would find the font file. What did i do wrong? Any ideas?\n\n",
  "author": "pablohoney77",
  "time": "Thu, 2004-02-19 09:51",
  "uid": "2910",
  "comments": [
    {
      "time": " Fri, 2004-02-20 06:33",
      "content": "Paul -   \n   \nThis could be any number of things.   \nThe most unlikely of which could be programs that   \ndon't recognize the file (illustrator 8) or more   \nlikely a naming problem.   \nAdam Twardoch has a nice tutorial here:   \n [http://groups.msn.com/FontLab/tipsandtricks.msnw?action=get\\_message&mview=0&ID\\_Message=2843&LastModified=4675459961277512599](http://web.archive.org/web/20050526121213/http:/groups.msn.com/FontLab/tipsandtricks.msnw?action=get_message&mview=0&ID_Message=2843&LastModified=4675459961277512599)\n\n"
    },
    {
      "time": " Fri, 2004-02-20 11:29",
      "content": "i figgered there were a host of problems that could be possibilities and that i had just asked a stupid question and so no one wanted to acknowledge it. But thanks for your help Eric... hopefully i can figger this out!\n\n"
    },
    {
      "time": " Fri, 2004-02-20 12:19",
      "content": "Also, it would help to know:   \n   \nWhat Mac OS version you're using   \nWhat version of ATM (if any)   \nHow you installed the fonts   \nWhat applications you tried it in   \n   \nT\n\n"
    },
    {
      "time": " Fri, 2004-02-20 12:51",
      "content": "I'm Running OS 9.2.1 and ATM 4.6   \nI installed the font simply by dragging it onto the system folder and dropping it there, and then clicked 'OK' when i was prompeted to place the file in the fonts folder.   \nI then tried to use the font in Photoshop 6, InDesign 2, Illustrator 9, and MultiAd 2 v1.6.2, oh and Word for Mac and the font didn't show up in the font list in any of these programs.   \nI tried just doubleclicking on the OTF icon and got the message i usually get when i do the same to a PC TTF - \"The font cannot be opened because there is no sample provided\" but i don't know whether this is unusual for OTF fonts or not.   \nI'm afraid i need to walk through the exporting process from start to finish, but the problem is i don't know where the start is!!! any helpful ideas/information on this would be much appreciated. thanks again for listening.\n\n"
    },
    {
      "time": " Sat, 2004-02-21 01:44",
      "content": "okay, i'm reading now on my fonts ( [http://www.myfonts.com/info/opentype-support-in-applications/](http://web.archive.org/web/20050526121213/http:/www.myfonts.com/info/opentype-support-in-applications/)) that I need ATM 4.6.2 to have open type PS support, maybe that's my problem, eh? i'll give it a whirl...   \noh wait, but those House Industries OTF fonts worked just fine on my workstation... so maybe it's still something else...\n\n"
    },
    {
      "time": " Sun, 2004-02-22 19:28",
      "content": "Okay, so i followed Adam's naming conventions and that solved all my problems, Thnx Eric! Thnx Thom! Maybe the fact that i completely skipped over the OT naming before was my problem, haha. Anyway thnx again!\n\n"
    }
  ]
}
