{
  "id": "31991",
  "title": "Looking at Charis SIL",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "I am considering using Charis SIL, an open source version of Charter, for a web site. The semi-slabbed serifs look nice and the Character set and OT features are very rich. As importantly, Charis SIL is one of very few Open Font License text fonts to come in the four major styles.\n\nI installed it into my fonts, and set it to default in my browser, as an easy \"test drive\" of a variety of text.\n\nIs it a technical problem on my part, or is the font very poorly hinted? I find that not only the x-heights, but also stem widths oscillate wildly as it scales from the 10-18 pt range.\n\nFace's background:  \nhttp://en.wikipedia.org/wiki/Charis\\_(SIL)\n\nAvailable here for those who want to look:  \n [http://scripts.sil.org/cms/scripts/page.php?site\\_id=nrsi&item\\_id=CharisS...](http://web.archive.org/web/20150418231526/http:/scripts.sil.org/cms/scripts/page.php?site_id=nrsi&item_id=CharisSIL_download \"http://scripts.sil.org/cms/scripts/page.php?site\\_id=nrsi&item\\_id=CharisSIL\\_download\")\n\nSince it is an OFL release, I should be able to simply edit the hinting and rename it. But trying to open it directly in FL causes a crash. Opening and resaving in other editors fixes this, but probably introduce their own artifacts. The FL autohinting after that still creates a rather poor result.\n\n",
  "author": "Choz Cunningham",
  "time": "5 Mar 2007 — 9:25am",
  "uid": "13605",
  "comments": [
    {
      "time": "5 Mar 2007 — 10:12am",
      "content": "Choz,\n\nYou have to take it into account that SIL is not a type foundry; its primary objectives are quite different (see [http://www.sil.org/sil/](http://web.archive.org/web/20150418231526/http:/www.sil.org/sil/ \"http://www.sil.org/sil/\")). However, as a former student of phonetics I have used their free fonts and been very grateful for their existence.\n\nOlli\n\n"
    },
    {
      "time": "5 Mar 2007 — 11:45am",
      "content": "I just quickly tested the font--the basic Latin characters--in Word, and it looked OK to me. But as I've said elsewhere, I know very little about hinting.\n\nAlso, I've seen what I suppose to have been Charis used for the pronunciations in some offset-printed dictionaries, and as far as I remember, it looked pretty good there (hinting presumably being irrelevant).\n\nOlli\n\n"
    },
    {
      "time": "5 Mar 2007 — 12:43pm",
      "content": "SIL describes Charis as \"one of the first fonts designed specifically for laser printers.\"  \nIf it was intended for laser printers, not screen display, then the hinting should not be expected to be up to the quality of something \"hand-hinted\", as Verdana, for example. Even on a 300 dpi laser printer, 11pt is 46 ppm, large enough to not worry about exacting manual hinting.\n\nI briefly looked at the hint quality (regular weight only) and the overall color is pretty good, but there will be some problems in screen display use. The verical stems are controlled fairly well, but many of the horizontal stems and features are left unhinted, which is why you'll see some problems with Cap heights and x heights. (e.g., bottom of Cap \"F\", top of cap \"H\".) There are other individual issues, \"f\", \"h\" are particularly bad, and the combination characters (DZ, Lj, Nj, etc,) show the left character hinted, the right char not hinted.\n\nOverall though, this appears to function as I'd expect for a font designed for printing, I'd expect the print results should be pretty good overall.\n\nJason C\n\n"
    },
    {
      "time": "5 Mar 2007 — 8:48pm",
      "content": "Jasonb, you caught the same things I did, so I am glad to know it isn't a local display problem.The way some characters are fully hinted and some are completely ignored was what made me think it might have been a problem on my end, messing with it.\n\nThe issue is certainly irrelevant for print use. The font shines there, if you care for it, and I do. The only bummer for me personally is that it doesn't shine in screen format. While all fonts have their limits in display at small sizes, I would really like to see it up to par with other rich families.\n\nI imagine that SIL has focused on breadth of use while developing their improvements, and they claim openly that it is still intended for simple typesetting, only now in a wide variety of scripts and languages. Noble goals.\n\nIt is the only exceptionally full font family with a free license. Thanks to this, I can go and roll my own version with different hinting, to use or release. Pretty neat stuff. If there weren't several thousand glyphs it might not be so intimidating a goal. Unfortunately, my hinting skills may never rival the major foundries, as that has been less important in my line of type interest. Perhaps I can improve it some, and attract others to do likewise.\n\nAt this point, I think I will still use it as the example font for creating images and such where I can anti-alias the output in one-off situations. With the OFL license, other site contributors can access the font as needed to make their own contributions with a consistent look. (I'm working on a wiki.)\n\nHopefully, some day, an updated version would make a great candidate for showcasing the (hypothetical) CSS @font-face embedding in web pages. Any year, now.\n\n"
    },
    {
      "time": "6 Mar 2007 — 4:17pm",
      "content": "I've been looking at Charis SIL myself too. Rather closely:\n\n[http://www.samiam.org/Chortle](http://web.archive.org/web/20150418231526/http:/www.samiam.org/Chortle \"http://www.samiam.org/Chortle\")\n\nIt's a very good font. The reason why the hinting isn't is because font hinting is patented by Apple. There is more information about the patent problems with hinting here:\n\n[http://freetype.sourceforge.net/patents.html](http://web.archive.org/web/20150418231526/http:/freetype.sourceforge.net/patents.html \"http://freetype.sourceforge.net/patents.html\")\n\nThe way I'm working around this patent is by making low-resolution bitmap versions of the font by hand using Fontforge.\n\nThe reason why Charis can be a derivitive of Bitstream Charter is that Bitstream Charter (in the basic Roman/Bold/Italic/BoldItalic fonts) is a free typeface. Basically, Bitstream donated Charter to X (a windowing system for Unix and Linux) back in 1992 with a copyright that allows free redistribution and modification. In fact, Bitstream Charter is, to the extent of my knowledge, the only truly open source font by Matt Carter.\n\nYou may notice, when compared to Charter, that Charis has slightly thicker strokes; it's a little more bold (Charter slightly-semi-bold). Also, the accents are more rounded at the top than the accents in Charter proper.\n\nAlso, Charis isn't the only open-source (free to download, modify, and re-distribute) font with Regular/Bold/Italic/BoldItalic fonts. There are a few other attractive open-source typeface with R/G/B/BI support:\n\n[http://www.bitstream.com/font\\_rendering/products/dev\\_fonts/vera.html](http://web.archive.org/web/20150418231526/http:/www.bitstream.com/font_rendering/products/dev_fonts/vera.html \"http://www.bitstream.com/font\\_rendering/products/dev\\_fonts/vera.html\")\n\n[http://dejavu.sourceforge.net/](http://web.archive.org/web/20150418231526/http:/dejavu.sourceforge.net/ \"http://dejavu.sourceforge.net/\") Vera derivitive with good Unicode support and an oblique version of Vera serif\n\n[http://canopus.iacp.dvo.ru/~panov/cm-unicode/](http://web.archive.org/web/20150418231526/http:/canopus.iacp.dvo.ru/~panov/cm-unicode/ \"http://canopus.iacp.dvo.ru/~panov/cm-unicode/\") TTF/OTF conversions of the fonts that comes with TeX\n\n[http://www.ellak.gr/fonts/mgopen/index.en.html](http://web.archive.org/web/20150418231526/http:/www.ellak.gr/fonts/mgopen/index.en.html \"http://www.ellak.gr/fonts/mgopen/index.en.html\") Some greek fonts with English (but, alas, usually not accented letter) support.\n\nAnd some maybe open-source fonts:\n\n[http://www.greekfontsociety.org/pages/en\\_typefaces20th.html](http://web.archive.org/web/20150418231526/http:/www.greekfontsociety.org/pages/en_typefaces20th.html \"http://www.greekfontsociety.org/pages/en\\_typefaces20th.html\")\n\nThe GFS claims that DidotOT is an OFL font. However, the actual zipfile doesn't have an OFL license in it.\n\n[ftp://ftp.io.com/pub/usr/hmiller/fonts/Thryomanes11.zip](ftp://ftp.io.com/pub/usr/hmiller/fonts/Thryomanes11.zip \"ftp://ftp.io.com/pub/usr/hmiller/fonts/Thryomanes11.zip\")\n\nThis font is supposibly GPL, which is a great license for software but a lousy license for fonts. The GPL doesn't answer questions like \"Can I embed parts of the font in a non-GPL compatible PDF file\" or \"Can I use the program with a non-GPL compatible program like Microsoft Word\", and the source code requirement is a non-issue when just about any font can be opened by just about any font editor.\n\n- Sam\n\n"
    },
    {
      "time": "7 Mar 2007 — 7:30am",
      "content": "Thanks so much for all the info and links, samboy! I coudn't find this thread yesterday and thought it had been removed for some reason, or had at least died.\n\nHaving sort of \"found\" Charter again, I was very excited when I first discoved Charis last fall--but then disappointed when it didn't have small caps or old-style numerals. But I guess that's understandable, too, given the primary goals of the font (or is there some other reason, perhaps?).\n\nInterestingly, Matthew Carter himself didn't know anything about this \"phonetic version of Charter\" that I had seen in some Oxford University Press dictionaries, when I asked him about it at ATypI Helsinki.\n\nOlli\n\n"
    },
    {
      "time": "7 Mar 2007 — 4:33pm",
      "content": "You know, I wonder if Matthew Carter is OK with people making these derivitives of Charter. I understand that Matthew/Bitstream donated Charter to the X project all those years ago, but I wonder if Matthew was aware he was donating the font with a license that allow derivitives like Charis to pop up years later.\n\nInfact, it's legal to make a straight up true type version of the bitstream Charter font and put it (or even sell it) on a web page. This may not be what Bitstream had in mind when giving Bitstream to X, especially since Bitstream still sells the Charter font.\n\nIf you want small caps and old style numbers, you can buy the latest update of Charter here:\n\n[http://www.myfonts.com/fonts/bitstream/charter/](http://web.archive.org/web/20150418231526/http:/www.myfonts.com/fonts/bitstream/charter/ \"http://www.myfonts.com/fonts/bitstream/charter/\")\n\nThey recently updated Charter in 2004.\n\n- Sam\n\n"
    },
    {
      "time": "8 Mar 2007 — 11:52am",
      "content": "<cite>If you want small caps and old style numbers, you can buy the latest update of Charter</cite>\n\nYeah, but these would presumably be too light to be used with Charis--in case you need (some of) the special glyphgs included in the latter. Oh well, more use for FontLab (and one more EULA to check) ...\n\nOlli\n\n"
    },
    {
      "time": "12 Mar 2007 — 12:44pm",
      "content": "\"It’s a very good font. The reason why the hinting isn’t is because font hinting is patented by Apple.\"\n\nThis isn't entirely true. Apple's patent has to do with using delta hints, and as far as I know, it restricts rendering systems from processing delta hints, not fonts from containing them.\n\nIn any case, though, it's not the lack of delta hints that make this font render less than ideally at display sizes. I can see many instances where features and strokes are left completely uncontrolled, instead of applying bsaic TrueType instructions. These instructions are part of the base TT instruction set, are not patented, and do not rely on delta hints.  \nThe font doesn't display well at small size simply because it wasn't intended to. If you wanted the font to perform better at display sizes, you could improve it's display quite a bit, even without using delta hints.\n\nJason C\n\n"
    }
  ]
}
