{
  "id": "31995",
  "title": "Apperson rebranding",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi All,\n\nAttached is a couple halfway polished concepts we’re giving to the client, who is a printing and related services company. Client wants to have the divisions represented, and so far prefer the stacked version on page 3 — since they are not wanting to shorten the division names. (Here is [the original logo](http://web.archive.org/web/20081205192840/http:/appersonprint.com/assets/body/body_01.gif).)\n\nAll comments accepted and respected, of course!\n\n| Attachment | Size |\n| --- | --- |\n| [Apperson rebranding concepts.pdf](http://web.archive.org/web/20081205192840/http:/typophile.com/files/Apperson%20rebranding%20concepts.pdf) | 78.03 KB |\n\n [‹ Architect's logo](http://web.archive.org/web/20081205192840/http:/typophile.com/node/32953 \"Go to previous forum topic\") [Eritrean youth organisation ›](http://web.archive.org/web/20081205192840/http:/typophile.com/node/32879 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081205192840/http://typophile.com/user/16696\" title=\"View user profile.\">utt73</a>",
  "time": "<br>",
  "uid": "16696",
  "comments": [
    {
      "time": " 5.Mar.2007 12.05pm",
      "content": "I like the second idea best (the serif font) but I’d watch the thin end of the swoosh on the ’A’. Try making it more like the leg of the ’R’.\n\n- Lex\n\n"
    },
    {
      "time": " 5.Mar.2007 4.29pm",
      "content": "Reminds me of the logo for this company...\n\n[http://www.eschergroup.com/](http://web.archive.org/web/20081205192840/http:/www.eschergroup.com/ \"http://www.eschergroup.com/\")\n\n"
    },
    {
      "time": " 6.Mar.2007 11.18am",
      "content": "Serif one is the best, I think that type Apperson looks like the old one so is kinda boring.\n\nBtw how did you manage to make such nice thin solid line ( 1px) that you use as divisor ( second version) ? Illustrator?  \nCould you please answer how? Because I always get blurrer or too light lines.\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \n-  \ngolden ratio of passion. sansogno.coastaldisturbance.com\n\n"
    },
    {
      "time": " 7.Mar.2007 11.39am",
      "content": "@ All: Thanks for the comments. I posted it here because I’m not totally content with the direction (and am fishing for ideas), and it might be time to go back to the drawing board because it’s “ho-hum”. Two are just subtle changes, and we’re fans of the classy serif’d version as well; but as you all know — it’s hard to get some clients to accept change.\n\n@ Lex Kominek: Good catch! We’ll fix the swoosh on the “A” for the next version.\n\n@ garden: The PDF was generated from Illustrator as direct print to PDF, so the vector art was conserved. It’s just a line with a stroke of 0.6pt. Photoshop is a raster program at heart, and is probably what causes the blurring on your lines if you’re exporting from there.\n\n"
    },
    {
      "time": " 9.Mar.2007 9.17pm",
      "content": "probably need a little more info/background on how Apperson want to position themselves. What do they do, who are their audience?\n\n—————  \n**Paul Ducco**  \n [Design, Melbourne](http://web.archive.org/web/20081205192840/http:/www.solid-creative.com/print.htm)  \n—————  \n [Little Mischief](http://web.archive.org/web/20081205192840/http:/www.littlemischief.com/)\n\n"
    },
    {
      "time": " 12.Mar.2007 3.41pm",
      "content": "Apperson’s audience is big corporate down to a single K-12 and higher ed teacher.\n\n“The industries that we are strong in for printing are: International Trade; Education; Finance (Credit Unions, Mortgage Companies, Pawn Brokers, etc). For Data Collection (DTS): Hospitality; Medical; Education”\n\nIf any of you are still awake... they want a “newer feeling”, but didn’t like the serifed options we had shown them.\n\nWhat exactly do they do? Good question — they print forms and create the data capturing equipment and software to go with the forms. They also do fulfillment and logistics ~ they store a company’s forms offsite at Apperson’s warehouses and build a custom ordering site for each client.\n\n"
    },
    {
      "time": " 10.Apr.2007 3.48pm",
      "content": "I promised you all an update, and here’s what they approved. It’s not a big departure from the original, but the client LOVES it (yes, loves it in all caps) and didn’t want any of the other options we came up with.\n\nAnyone want to go surfing?\n\n ![](http://web.archive.org/web/20081205192840im_/http:/typophile.com/files/apperson_4960.gif)\n\n"
    },
    {
      "time": " 10.Apr.2007 4.54pm",
      "content": "the cross bar of the A is uncomfortable. Not totally sure about the ark underneath either.  \n:)\n\n—————  \n**Paul Ducco**  \n [Graphic Design Wellington](http://web.archive.org/web/20081205192840/http:/www.solid-creative.com/about.htm)\n\n"
    },
    {
      "time": " 10.Apr.2007 6.35pm",
      "content": "I would see if you can pull the letters out of the wave a little more maybe - but it’s probably too late. Another idea would be to make the wave taper more & sooner to allow the text a chance to be read. The O N will take care of themseves but the P&R suffer from the ’immersion’ in the wave. Still this would be mitigation rather than fixing. I would also look at move the word trade & division just a litle to the left because the space between the L & T is optically too wide even if it is digitally ’correct’. Or give the E & D betwen Trade & Division more space.\n\n"
    },
    {
      "time": " 11.Apr.2007 11.12am",
      "content": "I think this is one of those examples of why you never give clients the option you’re not 100% sure on ~ because they’ll pick it every time, guaranteed. Although, they asked for a logo with an arc in it, and got what they wanted and love it - so that’s good.\n\nThanks Paul & Eben. I’ve updated a bit to get the middle letters to float more, and refined the waves & division kerning with your suggestions. It definitely improved:\n\n ![](http://web.archive.org/web/20081205192840im_/http:/typophile.com/files/apperson2_6339.gif)\n\n"
    },
    {
      "time": " 11.Apr.2007 11.50am",
      "content": "That does look better. Cool.\n\nOn the off chance that more can be done and you feel like it:\n\n- maybe pull the swash on the A slightly more to the left? Or reduce the amount it sticks out slightly. Either thing might help the A compete less with the under arc and improve coherence.  \n- maybe pull the cut where the leg of the R meets the bowl in further to let the R read better  \n- maybe tweak the ends of the S so they come slightly less close - again to make the Letter read better & faster.\n\n"
    },
    {
      "time": " 13.Apr.2007 7.02pm",
      "content": "agreed, it does look better.\n\n—————  \n**Paul Ducco**  \n [Graphic Design Melbourne](http://web.archive.org/web/20081205192840/http:/www.solid-creative.com/design.htm)\n\n"
    }
  ]
}
