{
  "id": "32007",
  "title": "typeface tango: how to decide who can/should dance with whom",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "i have always a problem choosing typefaces that work well together. this is sad.\n\nany recommendations on how to go about doing this? vauge question of sorts, but anything would help. thanks!\n\n",
  "author": "TypophileGirl",
  "time": "5 Mar 2007 — 7:53pm",
  "uid": "17237",
  "comments": [
    {
      "time": "5 Mar 2007 — 8:05pm",
      "content": "One way to get around racking your brain is by picking typefaces from the same designer can help. Its the easiest way for me.\n\nAlso from the same period/style/source can help but that's not a guarantee. For example Mantinia and Galliard go very well... by the same author.\n\nMikey :0)\n\n"
    },
    {
      "time": "5 Mar 2007 — 8:16pm",
      "content": "Or Univers with Egyptienne F by Adrian Fruitger, or Gill Sans and Joanna by Eric Gill, etc..\n\nA lot of designers build their letterforms upon the same skeletal structure, even if not on purpose. So I'd say that is a good direction to start for sure. Even Bringhurst recommends that approach.\n\n"
    },
    {
      "time": "5 Mar 2007 — 8:35pm",
      "content": "Here is another way... find printed literature- magazines, books, manuals, etc. and see how others combine different type. I keep a note pad at all times with me when I'm out and about.\n\nSoaking yourself into issues of How, STEP & Print will have raring to go.\n\nThe Font Shop virtual newletters combine type nicely too.\n\n[http://www.fontshop.com/fontfeed/](http://web.archive.org/web/20150307230616/http:/www.fontshop.com/fontfeed/ \"http://www.fontshop.com/fontfeed/\")\n\nbrowse all the past months with the pull down menu at the right\n\nMike Diaz :-)\n\n"
    },
    {
      "time": "5 Mar 2007 — 8:36pm",
      "content": "Looking at the structure of the typefaces is another (related) method of choosing typefaces. For instance, Bodoni is very geometric and has a very vertical stress that matches well with the grotesques and neo-grotesques like Helvetica.\n\nBut neither of them match something like Galliard because of it's diagonal stress and humanist shape.\n\nThat's one reason to look at the period in which a typeface was designed, because the era greatly influenced the methods and/or structures on which the letters were built.\n\n"
    },
    {
      "time": "5 Mar 2007 — 9:33pm",
      "content": "The best advice, in my opinion, it that of SUF, which is to say, find examples you like. Take them apart and see how they work. For instance, if you think Frutiger is a perfect marriage for Caslon, then you know you can always invite them together to the party. But try to understand for yourself WHY you think they belong together, and you can apply this to other faces.\n\nI would avoid any advice that says,\"This face and that must never be used together,\" or \"These two faces are perfect together,\" or even \"Just combine faces by that designer.\"  \nDesigning with type has to be a reflection of your own tastes, not prescribed rules.\n\n"
    },
    {
      "time": "5 Mar 2007 — 10:00pm",
      "content": "Sure, but that taste has to come from somewhere. Rules can help quite a bit and as long as you can step outside of those rules I don't think there is much harm in them.\n\nI agree to avoid the advice that says never do this or always do that...\n\n"
    },
    {
      "time": "5 Mar 2007 — 10:20pm",
      "content": "This question often arises and I hope I don't sound like a robot as my answer is always the same: don't worry so match about compatible typefaces. Nearly any two types can work together. Pick typefaces that fit your subject and audience. If they are right for the project, they are right for each other.\n\nAn exception: when using two distinct typefaces within a single line or paragraph, try to match general proportions (asc/descender length and x-height). Or, pick a [font suite](http://web.archive.org/web/20150307230616/http:/www.fontshop.com/virtual/newsletters/jun2006_b/).\n\n"
    },
    {
      "time": "5 Mar 2007 — 11:15pm",
      "content": "thanks for the great responses!\n\nthe reason i ask is that i was working on a project- a dialoge book, with 4 simultaneous conversations going on.\n\nin some conversations, the opinions contrast so i was thinking of working with the type in that sense but didn't know if the fact that they are completely different to begin with was enough of a difference.\n\n"
    },
    {
      "time": "7 Mar 2007 — 5:44am",
      "content": "If you're creating the impression of simultaneous conversations, then I would suggest choosing faces that represent, at least in your own mind, the different characters of the quadralogue.\n\nkostal: certainly. I wasn't saying that no training or understanding of type is necessary. I guess I was suggesting to get the training and the understanding and then let your own vision be the guide. So often, \"Never\" and \"Always\" guides are offered as help, when I think that kind of view can be detrimental to good design.\n\n"
    },
    {
      "time": "7 Mar 2007 — 9:09am",
      "content": "I'll add my voice to those who recommend considering the structure of the font, as Robert Bringhurst advocates in _The Elements of Typographic Style._\n\nConsideration of the structure involves looking at such characteristics as:  \n**art/design movement** (renaissance humanist and neohumanist/lyrical modernist forms [Venetian, Garalde, etc.], baroque/rococo form, neoclassical/\"transitional\" form, romantic/\"modern\" form, realist form [Victorian, clarendon & Swiss gothic forms], geometric modernist form [such as Futura, Memphis and the like], various postmodernist forms, etc.)  \n**aperture** (degree of openness or closedness of forms such as \"c\", \"e\", \"a\", \"s\", etc.)  \n**direction of axis** (humanist [oblique], rationalist [vertical] or variable),\n\nOther characteristics less relevant to structure, but still worth considering when choosing compatible fonts, include:  \n**stroke** (modulated or monolinear),  \n**terminal shape** (pen-formed, modeled, lachrymal [teardrop-shaped], round [ball-shaped]\n\nA great place to start in choosing compatible typefaces is to choose serifed and sans-serifed fonts with basic structural characteristics in common, such as:\n\n_Geometric modernist fonts:_ Beton, Candida, Marathon, Memphis, Rockwell or Stymie, etc.  \n_or romantic/\"modern\" fonts:_ Bodoni, Bulmer, Didot or Walbaum, etc.  \n_paired with:_ Avenir, Futura, or Kabel, etc.\n\nOr, _Realist-structured fonts:_ Belizio, Clarendon, Glypha, Serifa, Volta, etc.  \n_paired with:_ Akzidenz-Grotesk, Folio, Helvetica, Imago, Univers, etc.\n\nOr, Renaissance-based _humanist and neohumanist fonts:_ Albertina, Aldus, Bembo, Berling, PMN Caecilia, Chaparral, Dante, Garamond, Golden Cockerel, Joanna, Minion, Palatino, Plantin, Poppl-Pontifex, Scala, or many others,  \n_paired with:_ Frutiger, Gill Sans, Myriad, Linotype Projekt, Scala Sans, Syntax, etc.\n\nAs has been said already, these cannot be hard-and-fast rules. Even within similar structures, some pairings will work better than others, so use your own creative and critical judgement. However, once you have a good grasp of _similarly-structured_ font pairings, you will be better-equipped to try your hand at effectively pairing fonts with _contrasting_ structures.\n\nDavid Thometz\n\n"
    },
    {
      "time": "7 Mar 2007 — 10:46am",
      "content": "A few \"rules\" of things not to do.\n\na) don't choose faces that are \"too similar\" like Helvetica and Univers, for instance.\n\nb) don't choose faces that are \"too different\" like a very fine body text (sans) with a super heavy fatface heading -- basically, you don't want the fonts to fight each other. Different slants on the italics can also do this, if there will be a lot of italics happening.\n\nc) Don't mix your focus ... using a grunge heading with a formal script body, for instance. (Unless this is the statement you are trying to make)\n\nSet your samples with the options you like ... then put them away for 48 hours. Come back to them and the bad ones will probably stand out and say \"Ick\".\n\n"
    },
    {
      "time": "7 Mar 2007 — 11:33am",
      "content": "Advertisement vs. book typography  \nWhat can work in one field does not automatically work in another.\n\n"
    },
    {
      "time": "7 Mar 2007 — 11:59am",
      "content": "Some types which don't seem to work together at similar sizes may work fine when one is much larger than the other.\n\nChrisL\n\n"
    },
    {
      "time": "7 Mar 2007 — 12:23pm",
      "content": "Just remembered: Jonathan Hoefler wrote a pretty good article on this in CA. Forgot which issue.\n\n"
    },
    {
      "time": "7 Mar 2007 — 12:37pm",
      "content": "\"Some types which don’t seem to work together at similar sizes may work fine when one is much larger than the other.\"\n\nYes. Often, you will be able to nudge one font up or down several points in size to compensate for different apparent sizes or x-heights/body sizes.\n\nYou can also find surprising compatibilities between otherwise dissimilar types. For example, Joanna (a neohumanist slab-serifed font) looks beautiful when set with Fournier Italic (a neoclassical/transitional font). And the expressionist Post Mediaeval Italic makes a nice companion for Marathon, a more geometrically structured expressionist roman. And Centaur Roman (or Jenson) works beautifully with the blackletter San Marco used as a contrasting type for emphasis. The pen script El Greco, with adjustments made for size, makes an interesting italic companion for Raleigh, and so forth.\n\nExperiment and try new and unexpected combinations, but do it as knowledgeably as you can for the best results.\n\nDavid Thometz\n\n"
    },
    {
      "time": "7 Mar 2007 — 1:14pm",
      "content": "This topic recently came up with a colleague of mine who was trying to find a good supplementary face to work with Bembo. At the same time I was designing a new edition in a series, and the publisher had supplied me with a PDF of a previous edition in that series, which I thought was problematic. Here's what I responded with, which may be useful here:\n\n_General typographic principle is that serifs don't mix well with other serifs. (For instance, my \"problem\" with the supplied PDF sample was the combination of Warnock [for body copy] and a clearly Modern type [used for display] -- mixing Renaissance and Romantic proportions = bad news)._\n\n_Such a combination is like mixing a contemporary rendition of classical Italian architecture with some Victorian gothic furniture. Some might call this \"eclectic,\" but to my mind it's just a mess. Thus, in looking for a secondary face for a serif, my instinct (based on the typographic theory that I've read and absorbed) is to go for a sans face (which is what I normally do for supplementary copy [notes, etc.])._\n\n_But, it can't just be any sans, of course. In my redesign of the series I've stuck with Warnock for the body copy, and selected Quadraat Sans as the second face, because both share similar proporations and also make use of some unconventional hooks and beaks. For instance, here's a comparison of a few glyphs from each where you can see the distinctive \"hooks\" in a few letters. (The fact that Quadraat will be used at a smaller size [for notes, etc.] will balance the fact that it is quite a bit darker than Warnock.)_\n\n ![](http://web.archive.org/web/20150307230616im_/http:/typophile.com/files/Warnock-Quadraat_6621.gif)\n\n_In [my colleague's] case, you're working with Bembo, another classic Renaissance font, yet one that has become somewhat faceless due to over use. That said, it does have some distinctive shapes to it, and is based on classical proportions, so what you want is a sans that has the same. For my money, if I want to find a partner for something like Bembo (or Garamond or Jenson, etc.) I head straight to Legacy Sans. Here's a glance at Bembo & Legacy:_\n\n ![](http://web.archive.org/web/20150307230616im_/http:/typophile.com/files/Bembo-Legacy_5126.gif)\n\n&nbsp;  \n_Note some if their similarities, such as a connector of the \"g,\" the bracketed crossbar and curled tail of \"t,\" the understated \"J\" and \"Q\". These are just a few glyphs scrutinized, but from here you can see that the two have enough in common to likely work well together._\n\n_Now, you may not be a fan of Legacy, but this sort of process tends to help for me. I just make a sample (like above) and plunk in a few possibilities to go with my body type, then look to see if they have anything in common both in terms of proportions and quirks._\n\n"
    },
    {
      "time": "7 Mar 2007 — 1:51pm",
      "content": "Nice mixes, made nicer still since we can know and see WHY they were chosen, and WHY they work so well together. It wasn't an arbitrary process, or a case of, \"Ah -- these look okay together.\" That's what non-designers do.\n\nDavid Thometz\n\n"
    },
    {
      "time": "7 Mar 2007 — 4:15pm",
      "content": "I often look at sans and serif faces from the same designer - there's usually some sort of unconscious similarity in the letterforms between two faces.\n\n- Lex\n\n"
    },
    {
      "time": "7 Mar 2007 — 5:43pm",
      "content": "Picking agreeable typefaces isn't all that different from choosing wines -- there are some basic rules (\"red with beef, white with everything else\" and \"pick a simpler meal with a complex wine, and vice versa\") and the experience to know when you should just pick what you like and tinker a little with each. ;-)\n\n"
    },
    {
      "time": "8 Mar 2007 — 10:13am",
      "content": "I'm with Linda (and others). It is nice to sit down and find similarities in fonts and match them in that way. The sample above is good and those faces do work together. But, if you stick to such a strict way of doing it you will miss out on so many others pairings. A lot of it is experience, as Linda mentions. Until you actually work with the fonts, and play with them, you won't find your own sense of style.\n\n"
    },
    {
      "time": "3 May 2008 — 10:43am",
      "content": "Another good technique, if you want to get your eyes dirty, is to pair typefaces side by side using:\n\nGabocse escobaG\n\n ![](http://web.archive.org/web/20150307230616im_/http:/typophile.com/files/Picture-10_4781.jpg)\n\n(Trade Gothic with Filosofia and Gotham with Didot)\n\nYou can get a good sense for how letters look side by side and how the x-heights, widths, etc. match up.\n\n"
    },
    {
      "time": "4 May 2008 — 10:35am",
      "content": "Wow! nice suggestions here!  \nRecently I have been designing a website for a silkscreen studio in Milan and I wanted to merge the two spirits of the city: the slick, commercial fashion-oriented one and the traditional old spirit of Milanesi craftmanship.  \nSo I came up with a choice of these two fonts:\n\n ![](http://web.archive.org/web/20150307230616im_/http:/typophile.com/files/belwetica_4733.jpg)\n\nMaybe for some will be a punch in the eye, but I found the coupling quite agreeable.\n\n"
    },
    {
      "time": "16 Aug 2009 — 9:27am",
      "content": "SCHOOL PROJECT SELL ATYPEFACE AND TELL THE BLA BLA BLA ABOUT IT THE ONLY THING i CAN'T GET ANSWERED FOR MY DESIGN PROJECT IS WHAT OTHER TYPEFACES OR FONTS IT WORKS WITH EXAMPLE IS IT GOOD WITH TAHOMA OR ARIEL i WANTED TO USE ADOBE PRO GARAMOND PUT i CANT FIND WHAT WORKS WITH IT . oh caps sorry= and by the way i can't find the page it was on dut some one wanted the adobe pro garamond for free and you guys jumped on him ! I got it for free on a frre fonts site. Two shool students only want them so they can fininsh projects and are not making a profit and thrree My teacher gave us a project with the optio n of only six type familiys which he had to assume we as non profesionals would have on our computers -I had only two of them and one of them I got from the free down load so i would of been stuck with one font choice which i think i used any ways arieal was boring font. I had helvetica on my computer at my old job I do not know how it got on ther but it is not on my home computer nor optima, and many other that many seem to have and i don't have a bunch of money to buy bunch of fonts . its not stealing when you are not making money of it or are you going to tell me you never lent a book to a friend or gave it to them when you were done or a music cd so they could listen to it or how about a food reciepe that you liked and gave some one -did you make that person go out and by the book or did you write down the recipe. I hope whoever was asking for that font sees this so he knows he has someone on his side the professionals that are making big bucks should willing pay for non free fonts because they can afford it and are using profesional sets. but let us minors learn some stuff withuot giong broke trying to go to school and are laid off and can barely feed ourselfs. get of your fracking high horses. I bet you guys down loaded (which I did not) all that free music when you could before they changed the law Oh but thatwas just file sharing..\n\n"
    },
    {
      "time": "16 Aug 2009 — 9:04pm",
      "content": "How about we send Adobe your info and tell them you ripped of one their fonts:\n\nFull name  \nRene Doyle  \nCity  \nPunta Gorda  \nState/Province  \nFlorida  \nCountry  \nCharlotte county  \nHome Page  \nnone  \nOccupation  \nstudent\n\n"
    },
    {
      "time": "19 Aug 2009 — 7:09am",
      "content": "Rene's post reminds me of [this](http://web.archive.org/web/20150307230616/http:/en.wikipedia.org/wiki/Michael_Heath_%28cartoonist%29#Great_Bores_of_Today). (Shame I can't find the typical image that would go with it.)\n\nEver since I chose to block pop-ups, my toaster's stopped working.\n\n"
    },
    {
      "time": "19 Aug 2009 — 8:06am",
      "content": "Good rant, though. And the passion of the misspellings, but then _oh caps sorry=_, that sort of lets it down, ain't it?\n\n"
    },
    {
      "time": "21 Aug 2009 — 1:00pm",
      "content": "this is surely old news to the vets here but for those who need help:\n\nthe font finder on linotype looks like a great resource and tool.\n\ni particularly liked the find fonts by inspiration, and the form finder seems like the perfect thing to help you (but obviously they're not going to be showing fonts from other foundries, and i wish you could narrow the search more by things for text, display, and exclude certain things, like italics)\n\n"
    },
    {
      "time": "21 Aug 2009 — 9:46pm",
      "content": "One feature of super-families that contain both sans and serif, quite apart from any stylistic matching, is that they will generally have matched vertical metrics--which means that if you insert, say, a couple of words of Bold Sans into a phrase of Regular Serif, there will be a nice alignment.\n\n"
    },
    {
      "time": "21 Aug 2009 — 10:51pm",
      "content": "Agree with Stephen Coles about not worrying about matching type, to a point. Experiment, yes, but really look at the results. Are they to your liking - or not?  \nWe get paid to have opinions.\n\npbc\n\n"
    },
    {
      "time": "21 Aug 2009 — 11:03pm",
      "content": "Paul you are right. If you look at that example with Belwe and Helvetica; you’ll those two are pretty ugly together (Well, Belwe is permanently ugly)\n\nMikey :-)\n\n"
    },
    {
      "time": "27 Aug 2009 — 1:33pm",
      "content": "There was a time when I would have called Belwe ugly too -- back when it was so overused as to make a designer cringe at the very sight of it. But now I see it as it is -- a very late Arts-&-Crafts-era (1926) type that was designed as a creative interpretation of Jenson, and revived in the 1970s when such styles were popular again. As such, it can be a useful choice for period work.\n\nIt may not be fashionable right now, but I wouldn't call it ugly, any more than I would call other Arts & Crafts or Art Nouveau styles ugly. It's all in how they're used in a design.\n\nBelieve it or not, young designers, there will come a time when many of today's stylish types will be derided by a new generation. :)\n\nHaving said that, however, I wouldn't have thought of pairing Belwe with Helvetica. The two have some definite structural incompatibilities, although the x-heights and proportions work together better than I would have guessed.\n\nInstead of the Swiss neo-grotesque Helvetica, I might look to other Arts-&-Crafts-era grotesques, such as Monotype Grotesque, Venus, AG Old Face, or Akzidenz Grotesk. Or, since Belwe has a relatively open, somewhat geometric structure, look to other geometric sanserifs like Kabel or even Peter Bruhn's Mercury to pair with with Belwe (those stylized lower-case \"g\"s look like they were made for each other). Barmeno, Legacy Sans or other Jenson-derived sanserifs might be other options.\n\nDavid Thometz\n\n"
    },
    {
      "time": "11 Jun 2010 — 1:27pm",
      "content": "I thought I'd pass this along:\n\n[http://bonfx.com/19-top-fonts-in-19-top-combinations/](http://web.archive.org/web/20150307230616/http:/bonfx.com/19-top-fonts-in-19-top-combinations/ \"http://bonfx.com/19-top-fonts-in-19-top-combinations/\")\n\nI created a set of combinations as a launching point from only in wide use, so that it would be helpful.\n\nI have a resource book about about 300 combinations coming out in 2010, as well as an iPhone app called \"Font Combos\".\n\nVisit the above link for more info on the book or the app. I hope it's helpful!\n\n"
    },
    {
      "time": "13 Jun 2010 — 12:04pm",
      "content": "Doug, your recommendations in \"19 top fonts\" are safe, easy and boring.  \nThe typefaces you recommend were almost all designed long ago, (none this century) and are published by corporations.\n\nI declare my bias: I am alive, design original typefaces, and own the foundry that publishes them.\n\nGet with the tour!\n\n"
    },
    {
      "time": "13 Jun 2010 — 2:12pm",
      "content": "Amen!\n\n"
    },
    {
      "time": "24 May 2011 — 7:43am",
      "content": "Just out of curiosity; what about typefaces that are not the same, but have the same ancestors?\n\nLike:  \n- Sabon (Body) and Garamond Premiere Pro (Display/Headline)  \n- Baskerville (Body) and Mrs. Eaves (Display/Headline)\n\n"
    }
  ]
}
