{
  "id": "32031",
  "title": "History of type fonts 1940's",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I am a Visual Communications student, and i am trying to find what fonts were popular for the 1940's. More specific, fonts and styles used in advertising during this period and the history behind them. i have not had much luck web searching for this info. Is there no web sites with this info? Any help, especially free sites for a student budget, would be greatly appreciated. Thank You\n\n",
  "author": "Reggie Holly",
  "time": "6 Mar 2007 — 7:30pm",
  "uid": "17253",
  "comments": [
    {
      "time": "6 Mar 2007 — 7:45pm",
      "content": "Would it really kill you to just go to a library and flip through a book about design history?\n\n"
    },
    {
      "time": "6 Mar 2007 — 8:05pm",
      "content": "\\>i am trying to find what fonts were popular for the 1940’s.\n\nReggie man, there was a war on! We had more important things to think about than font choice.\n\n"
    },
    {
      "time": "7 Mar 2007 — 12:08am",
      "content": "Resource for some printed material in the UK  \n [http://www.iwmcollections.org.uk/](http://web.archive.org/web/20150218043331/http:/www.iwmcollections.org.uk/ \"http://www.iwmcollections.org.uk/\")\n\nTim\n\n"
    },
    {
      "time": "7 Mar 2007 — 3:11am",
      "content": "All you seek: A History of Graphic Design by Phil Meggs\n\n"
    },
    {
      "time": "7 Mar 2007 — 6:04am",
      "content": "In Megg's book there's only 2 pages that span the 1940's time period and it's mostly propaganda literature. Pages 308-309, there's not much mention of typefaces. You might want to do research on Newspaper design from the early twentieth century, there's probably more information on that.\n\nNot sure if this'll help or not: [Google News Search](http://web.archive.org/web/20150218043331/http:/news.google.com/archivesearch?hl=en&q=of+Typography+from&as_ldate=1940&as_hdate=1950&um=1&scoring=t&sa=X&oi=archive&ct=title)\n\n"
    },
    {
      "time": "7 Mar 2007 — 6:12am",
      "content": "For the same reason that new car design was suspended during WWII, new typeface design was not the primary thought going then. The type in use was from prior decades and what was available. The Library of Congress and the National Archives have collections of material printed during that time. I am sure there must be comparable collections in European libraries as well.\n\nChrisL\n\n"
    },
    {
      "time": "7 Mar 2007 — 9:24am",
      "content": "So Chris, it looks like the Swiss decided to develop \"Helvetica\", rather than fighting in WW2...\n\n"
    },
    {
      "time": "7 Mar 2007 — 9:32am",
      "content": "But Nick, it was developed in the 1950s. The Swiss were busy being the World's bankers though.  \nIn fairness, font development at that time, was a long complicated process involving machinery and factories. These things were in use making things that go bang.\n\nChrisL\n\n"
    },
    {
      "time": "7 Mar 2007 — 10:06am",
      "content": "I believe the Allies printed fake ration books and distributed them in occupied Europe. Rotating the use of custom types would have disrupted these forgery efforts - but maybe the Germans didn't think of that or had other priorities. However depending on the sophistication of your professors you could make up an intertesting story about a group of fictitious Nazi type designers.\n\n"
    },
    {
      "time": "7 Mar 2007 — 10:45am",
      "content": "_But Nick, it was developed in the 1950s._\n\nI'm floating the idea that Helvetica emerged from a design culture that became established in Switzerland during the war years.\n\n"
    },
    {
      "time": "7 Mar 2007 — 12:57pm",
      "content": "<cite>I believe the Allies printed fake ration books and distributed them in occupied Europe. Rotating the use of custom types would have disrupted these forgery efforts - but maybe the Germans didn’t think of that or had other priorities. However depending on the sophistication of your professors you could make up an intertesting story about a group of fictitious Nazi type designers.</cite>\n\nThat might be an option too; looking up Nazi propaganda and reporting on it's typography. It might be the only thing they did well, market themselves. Course, that'll be a hard sell these days.\n\n"
    },
    {
      "time": "7 Mar 2007 — 5:20pm",
      "content": "Reggie – James is right about this; type-related design history on the web is in its infancy and there isn't much of it around, so you need to _physically_ relocate yourself to a real bricks n'mortar library. Two books that have the same '20th-century-decade-by-decade' structure are 20th century type:remix by Lewis Blackwell (1998, Laurence King Publishing, London UK) and the earlier Graphic Design Sourcebook by Liz McQuiston and Barry Kitts (1987, Quarto Publishing, London UK). Both of them have a chapter devoted to the 1940s.\n\n"
    },
    {
      "time": "7 Mar 2007 — 8:50pm",
      "content": "I suggest you look for \"old paper\" shops in your area.  \nThere is a subculture of people who collect and deal old paper ephemera -- comic books, posters, postcards, timetables, maps, stamps, money, certificates, (car) manuals, programs as well as magazines and newspapers.\n\nAlternatively, on the internet, search for well-known magazines.  \nScientific American, National Geographic, Vogue, Mademoiselle.  \nJust enter \"Fortune magazine 1945\" - I just did and it's $4 on ebay. That magazine will have a sh!t-load of ads which will tell you much of what you need to know.\n\nCheck out these pages (scroll down)  \n [http://www.americanartarchives.com/dohanos.htm](http://web.archive.org/web/20150218043331/http:/www.americanartarchives.com/dohanos.htm \"http://www.americanartarchives.com/dohanos.htm\")\n\nTo identify and date the fonts in ads, use Matt McGrew's \"American Metal Typefaces of the Twentieth Century\" (Oak Knoll), which is remarkably comprehensive. If an ad \"type\" isn't in there, it's probably hand lettering.\n\n"
    },
    {
      "time": "7 Mar 2007 — 9:34pm",
      "content": "Reggie\n\nAn incident that has not been mentioned but one that had an enormous impact on the release of typeface designs (and a great many other things) from the very late 1920s through the War and into the late 1940s was this thing called the Great Depression, a succession of lengthly back to back recessions that essentially crippled world trade and economics, and basically led to World War as a solution. In this case, statistics don't lie, as much as they reveal.\n\nGerald\n\n"
    },
    {
      "time": "7 Mar 2007 — 11:36pm",
      "content": "sii -- <cite>I believe the Allies printed fake ration books and distributed them in occupied Europe. [...] Rotating the use of custom types would have disrupted these forgery efforts</cite>\n\nIndeed the British had a better sense for typographic identity. In a little exhibition of WWII leaflets which I saw one could at once tell which were British: Gill Sans.&nbsp;&nbsp;:)\n\nAs to your first remark, a book shows such a leaflet which bears the handwritten note \"distributed together with ration cards\".\n\n"
    },
    {
      "time": "8 Mar 2007 — 6:53am",
      "content": "Here's a discussion started early on the Typography During WWII: [Node 12177](http://web.archive.org/web/20150218043331/http:/typophile.com/node/12177)\n\n"
    },
    {
      "time": "8 Mar 2007 — 8:17am",
      "content": "Further to Nicks idea about buying a magazine on eBay: You might well be able to find a library that will have the actual magazines for Time, Life, Look, etc. for the entire period in their stacks. University libraries as well as major metropolitan libraries would be where I would look.\n\n"
    },
    {
      "time": "8 Mar 2007 — 9:58pm",
      "content": "\"PM magazine began publication in 1934 and ceased in 1942 when the United States entered World War II. The publication began as a monthly journal to provide information about printing to production managers and other interested people in the field and featured articles on printing processes, typesetting and other production specific topics.\"\n\n[http://www.drleslie.com/PMADMagazines/Magazines.shtml](http://web.archive.org/web/20150218043331/http:/www.drleslie.com/PMADMagazines/Magazines.shtml \"http://www.drleslie.com/PMADMagazines/Magazines.shtml\")\n\n[http://www.drleslie.com/PMADMagazines/magazineslist.shtml](http://web.archive.org/web/20150218043331/http:/www.drleslie.com/PMADMagazines/magazineslist.shtml \"http://www.drleslie.com/PMADMagazines/magazineslist.shtml\")\n\n[Herbert Bayer](http://web.archive.org/web/20150218043331/http:/typophile.com/wiki/Herbert%20Bayer) emigrated to the United States in 1938 and set up practice in New York and with the PM Magazine December-January 1939-40 he wrote \"Towards a Universal Type\"...\n\n[http://www.drleslie.com/PMADMagazines/Spreads/bayer18\\_large.shtml](http://web.archive.org/web/20150218043331/http:/www.drleslie.com/PMADMagazines/Spreads/bayer18_large.shtml \"http://www.drleslie.com/PMADMagazines/Spreads/bayer18\\_large.shtml\")\n\n[http://www.drleslie.com/PMADMagazines/Spreads/bayer19\\_large.shtml](http://web.archive.org/web/20150218043331/http:/www.drleslie.com/PMADMagazines/Spreads/bayer19_large.shtml \"http://www.drleslie.com/PMADMagazines/Spreads/bayer19\\_large.shtml\")\n\n[http://www.drleslie.com/PMADMagazines/Spreads/bayer20\\_large.shtml](http://web.archive.org/web/20150218043331/http:/www.drleslie.com/PMADMagazines/Spreads/bayer20_large.shtml \"http://www.drleslie.com/PMADMagazines/Spreads/bayer20\\_large.shtml\")\n\nIf I ever get the chance I'm going to pick-up the entire run of PM Magazine, it's a fine look at very dynamic period in time.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "9 Mar 2007 — 5:31am",
      "content": "Great stuff Hiro!\n\nChrisL\n\n"
    },
    {
      "time": "9 Mar 2007 — 10:08am",
      "content": "PM is about the opposite of what's popular.\n\nBut that's \"design history\" isn't it?\n\n"
    },
    {
      "time": "9 Mar 2007 — 10:20am",
      "content": "Reggie's question was about what fonts were popular in 1940's advertising, not about type development during that period.\n\nAn obvious place to start would be magazines from that decade. Your local library probably has bound collections of '40s periodicals. And a little digging will yield online collections like this one:\n\n[http://www.cyber-heritage.co.uk/women/](http://web.archive.org/web/20150218043331/http:/www.cyber-heritage.co.uk/women/ \"http://www.cyber-heritage.co.uk/women/\")\n\nScroll down to the '40s to see ads for Palmolive, Nestles, Eve, Ovaltine, Snowfire, Mum, Solidex...\n\n"
    }
  ]
}
