{
  "id": "32049",
  "title": "Help Wanted, font modification",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "I work for a small publishing company, and we would like to hire someone to add 20 characters to Adobe Garamond Premier Pro (6 faces). All of them involve simply adding an underdot or an overdot to an existing letter.\n\nThe letters are d, D, h, H, l, L, m, M, n, N, r, R, s, S, t, T for dotunder, and m, M, n, N for dotover.\n\nThe face is used in several of our series, and we don't have a Unicode compliant version of it that can produce these characters, which we use often.\n\nMany thanks,  \nDavid\n\n",
  "author": "kittelsd",
  "time": "7 Mar 2007 — 9:05am",
  "uid": "17105",
  "comments": [
    {
      "time": "7 Mar 2007 — 9:59am",
      "content": "Design-wise that's not a hard job as you say, but creating versions where it's actually still easy to enter those characters with a keyboard (without stripping out other characters you might need later) is a little more difficult. Simple if you want to create a separate version (ie called 'GaramondOverdot') that you use alongside the original, but less so if you want to include all these characters in the existing cut of the font. Can you expand a bit on the needs/reason for the typeface edits so it's clearer what would be a good way ahead?\n\n"
    },
    {
      "time": "8 Mar 2007 — 8:33am",
      "content": "I thought the whole point of Unicode fonts was that there was a slot for every known character--a unique coding for each one, which expressly does not strip out other characters in the process.\n\nWe already have a postscript version of this font that does as you say--supplants some of the existing 256 ascii characters with the diacritical characters that we need. We need an Adobe Garamond with these same characters, but in an Opentype Unicode format.\n\nThanks  \nDavid\n\n"
    },
    {
      "time": "8 Mar 2007 — 9:35am",
      "content": "David,  \nAs long as there is actually an opentype codepoint for each of the glyphs you see, you are correct. Premier Pro is a huge character set, hard to imagine some are missing. What language do these glyphs appear in?\n\nChrisL\n\n"
    },
    {
      "time": "8 Mar 2007 — 9:44am",
      "content": "We need them for transliterating Sanskrit into Roman characters. Our focus is Buddhism, so we do this a lot. The Premier Pro has many of the ones we need already, but not the underdots, at least not for the characters we want. Its \"floating accents\" include an underdot, but it only seems to work with certain characters.\n\nThe glyphs are definitely part of the Unicode mapping--I can produce them easily with other Unicode fonts.\n\nDavid\n\n"
    },
    {
      "time": "8 Mar 2007 — 9:46am",
      "content": "Garamond Premier pro does have UC & lc o with dot underneath. But no h or d with dot underneath it. I just checked to be sure.\n\nI could build a font like that ( I just built a custom financial font yesterday for a firm in Chicago) or you could ask someone else here or evebn ask Adobe.\n\n<cite> simply adding an underdot or an overdot to an existing letter. </cite>\n\nI would like to suggest that the size & placement of the dot aught to be made in the thouful & careful way - ideally speaking.\n\nThe main question unanswered in the thread is do you know how to access the Unicode Glyph in your OS? I can explain how to do it in OSX on the Mac. I am not sure how to do it on Windows boxes - but I could figure it out. Probably by searching here on Typophile.\n\nOr maybe the texts come to you in Unicode & you just have to be able to set them.\n\nIs that it?\n\nWhat language is being set?\n\n"
    },
    {
      "time": "8 Mar 2007 — 9:53am",
      "content": "My previous comment answers some of these questions.\n\nI understand the metrics are somewhat tricky and can be more or less elegantly implemented. But for this kind of job, I think it should be relatively straightforward.\n\nI have no problem entering the Unicode characters on a Mac. Most of the manuscripts come in with the diacritics already entered, and the cross-platform convenience of a Unicode font will help our workflow greatly.\n\nDavid\n\n"
    },
    {
      "time": "8 Mar 2007 — 10:00am",
      "content": "I hadn't seen your most recent post when I wrote that. Sorry.\n\n<cite> relatively straightforward </cite>\n\nThat's a characterization I could beter agree with. Since it's going into print I just thought some degree of care, craft, and knowledge of typographic precedent was probably called for.\n\n"
    },
    {
      "time": "8 Mar 2007 — 10:06am",
      "content": "But then again, this IS a type board. So you would have to expect that kind of attitude here. After all we like type. ;-)\n\nIf I can help please let me know.\n\n"
    },
    {
      "time": "8 Mar 2007 — 2:05pm",
      "content": "It is relatively easy to add the characters. Including them in the features & class files takes a little more time -- you should probably also have them in small capitals as well, and include all in the kerning work; this font does use class-based kerning.\n\nI have done the underdots in Adobe Garamond Pro (not Premier) for roman & italic; as I remember, it took me a couple of hours each font. Getting everything up to snuff for six fonts would likely take a day or so. BTW, I'm not offering to do the work -- we are a typesetting firm & don't do font work for anyone else -- just offering some personal experience.\n\nIt isn't hard, just involved.\n\n"
    },
    {
      "time": "8 Mar 2007 — 3:20pm",
      "content": "Thanks, Charles, for these clarifications--especially for the reminder about the small caps. Someone has contacted me directly about doing the job, so hopefully we are on our way.\n\nDavid\n\n"
    }
  ]
}
