{
  "id": "32050",
  "title": "em Caps M",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi everybody,\n\nI am presently reading a book call Le langage de la typographie (The complete typographer), I really like this book !\n\nBut there's something I dont understand about the em, they said you take the caps M and the width (la chasse) is suppose to be the same as the height. I maked the test with Myriad, Garamond etc and there's nothing liked that. Did I misunderstanding someting ?\n\nThanks\n\nM\n\n",
  "author": "Marc C",
  "time": "7 Mar 2007 — 9:11am",
  "uid": "16734",
  "comments": [
    {
      "time": "7 Mar 2007 — 10:36am",
      "content": "The cap M is only 1 em width in a very few fonts. Even fewer will have the cap N exactly 1 en in width.\n\nThe em is a horizontal dimension that varies with typesize. It is defined as being the same size as the pointsize of the face. Thus a em is 12 points wide in a 12 point font, but 24 points wide in a 24 point font. This makes it especially good for specifying paragraph indents, among other things.\n\n(Also, when you are measuring a font, remember that you must measure the ascender, body, and descender space, and even then there might be a small additional amount of \"side-bearing\" white space around the characters.)\n\n"
    },
    {
      "time": "7 Mar 2007 — 12:53pm",
      "content": "Perhaps History. I remember asking the owner of a shop that used Linotype Linecaster's -- which don't use an em system -- how wide an em-space was. \"Why,\" he said, \"the width of a capital 'M'\".\n\nPersonally, I just don't remember just what got put in the magazines . . . We've all been working with em-based systems for so long.\n\n"
    },
    {
      "time": "7 Mar 2007 — 2:39pm",
      "content": "I agree – it's not going anywhere. Ironically, the em is also widely used as a unit of type for CSS.\n\n"
    },
    {
      "time": "7 Mar 2007 — 3:26pm",
      "content": "Marc, that's a very old-fashioned concept.  \nAnd quite possibly it was <cite>never</cite> really true.\n\nBTW, I have that book... in Spanish! :-)  \nIt's a very useful work I think.\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2007 — 8:49am",
      "content": "Thank's a lot guy's !!!\n\n"
    },
    {
      "time": "8 Mar 2007 — 9:52am",
      "content": "Marc, with 1000 units per em, Adobe Garamond's M is 912 units wide, and Adobe Caslon's M is 981 wide.\n\nTraditional seriffed M's did have approximately square bodies, hence the name for a body width space, which is square, is an 'em quad', and we continue to talk about the 'em' in digital type. For more than you ever wanted to know, see this thread: [http://typophile.com/node/27742](http://web.archive.org/web/20131021031601/http:/typophile.com/node/27742 \"http://typophile.com/node/27742\")\n\n"
    },
    {
      "time": "9 Mar 2007 — 9:13am",
      "content": "Thanks William,\n\nBTW, I would like to read the EULA in french, do you know where a can find it ?\n\n"
    },
    {
      "time": "9 Mar 2007 — 9:36am",
      "content": "\\>the EULA\n\nThere are as many EULAs--End User License Agreements--as there are software publishers, I think. Among other places, you will certainly find French language EULAs at the sites of French type founderies, such as [this one](http://web.archive.org/web/20131021031601/http:/www.typofonderie.com/alphabets/order/LeMondeSans/?lang=fr) from the Typofonderie of J-F Porchez.\n\n"
    }
  ]
}
