{
  "id": "32058",
  "title": "Pls help ID - Not quite PTL Qugard, Frutiger.. image included",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I’m new here and want to say Hi as well as upping a little mystery font - at least to me. I’ve spent almost a day on this one and cannot come up with a close match, so it could be a tweaked font. The R and M are the keys - R has a rounded leg and the M looks, well, wrong somehow.\n\nThanks for trying !\n\nregards Peter\n\n| Attachment | Size |\n| --- | --- |\n| [in form.jpg](http://web.archive.org/web/20070309184124/http:/typophile.com/files/in%20form.jpg) | 54.86 KB |\n\n",
  "author": "<a href=\"user/17276\" title=\"View user profile.\">petzolino</a>",
  "time": "<br>",
  "uid": "17276",
  "comments": [
    {
      "time": " 7 March, 2007 - 1:14pm",
      "content": "The source of the sample might help.\n\n"
    },
    {
      "time": " 7 March, 2007 - 2:26pm",
      "content": "Hello Stephen. The font is part of a company logo, the original designer is not around anymore. I took up from there and need to find out what the font is in order to do integrate it further in their CI. The other problem is that the logo is only available as a small .tiff and needs to be vectorized.  \nDo you have any pointers as what the font may be? I´m pretty clueless but I´m thinking that that M is a mirrored W… just a wild guess though - I´m sure people have a better eye here. Thanks for the interest !\n\nPeter\n\n"
    },
    {
      "time": " 8 March, 2007 - 7:17am",
      "content": "It’s some sort of bastardised frutiger, with, as you say, the M being an inverted W… the W looks as if it might even have been taken from another typeface… not nice, not nice at all!\n\n"
    },
    {
      "time": " 8 March, 2007 - 1:04pm",
      "content": "Hi Brett - yep, it’s a mix of all sorts - there is a Quay Sans and one from The Foundry, Form Sans in it. I recognized the latter because it’s one of my all time favourites and yes, it’s an inverted W.\n\nOh man. I’ll fix this mess up - stuff like this gives me knots in my brain… At least I have the pleasure of undoing the damage. Ever tried inverting a Comic Sans? Now _that_ is nice…\n\n"
    }
  ]
}
