{
  "id": "32066",
  "title": "Which version of this font is the most legible",
  "forum": "Bitmap Text",
  "tags": [
    "Bitmap Text"
  ],
  "content": "OK, guys, I need some real quick feedback from someone who hasn't been spending a week looking at the same letters. Some quick background: I'm making a pixel version of a derivitive of the Bitstream Charter font (with IPA letters) called Charis SIL. My version is called \"Chortle\". The goal of this font is to have a font that is very easy to read on a computer screen, without using kerning (this font is being designed for older \\*NIX systems withour kerning in screen fonts) and preserving, as much as possible, the metrics of the printing font.\n\nThis font is a free font , available here:\n\n[http://www.samiam.org/Chortle](http://web.archive.org/web/20150414063602/http:/www.samiam.org/Chortle \"http://www.samiam.org/Chortle\")\n\nI have three basic ideas for the pixmap letters. In the attached file, you will see one paragraph in the first style, one paragraph in the second style, and finally one paragraph in the third style. This cycle is repeated for the next three paragraphs.\n\nThe text is public domain text from the Voice of America.\n\nWhich of the three styles is the most readable style?\n\n- Sam\n\n| Attachment | Size |\n| --- | --- |\n| [wc.png](http://web.archive.org/web/20150414063602/http:/typophile.com/files/wc.png) | 8.88 KB |\n\n",
  "author": "samboy",
  "time": "7 Mar 2007 — 4:43pm",
  "uid": "17256",
  "comments": [
    {
      "time": "7 Mar 2007 — 6:49pm",
      "content": "IMO, the first/fourth one is the best\n\n-m\n\n"
    },
    {
      "time": "7 Mar 2007 — 6:59pm",
      "content": "I agree. The others are far too awkward.\n\n"
    },
    {
      "time": "7 Mar 2007 — 9:58pm",
      "content": "None of them are good enough.\n\nhhp\n\n"
    },
    {
      "time": "8 Mar 2007 — 7:13am",
      "content": "none\n\n"
    },
    {
      "time": "9 Mar 2007 — 5:10pm",
      "content": "OK, just making sure you guys agree with what I found in my testing. My reading tests did find these typefaces hard on the eyes after half an hour of reading, so I made some improvments to them by removing most serifs (serifs just don't work at low resolutions)\n\nhrant and Cuttin Shapes: Thank you for your comments. The correct way to criticize something is to say **why** it doesn't work. For example \"none of them are good enough\" doesn't help (and, yes, I agree with you, and have made improvments). It's better to say \"These fonts don't work because the letters have too many serifs that are hard on the eyes\". Oh well...ever since the days of Usenet, internet forums have had problems with having a low signal to noise ratio. Please don't take this as a personal insult...that's the other problem with internet forums, when people take things too personally.\n\nAgain, I'd like to thank everyone for their help and will continue testing these fonts by reading large amounts of text with them. I'm right now reading books that you can download for free here with this font:\n\n[http://www.baen.com/](http://web.archive.org/web/20150414063602/http:/www.baen.com/ \"http://www.baen.com/\")\n\nThe best way to test the readability is to read a lot of text with a given font.\n\n[Edit: Finished the last sentence]\n\n"
    },
    {
      "time": "9 Mar 2007 — 5:47pm",
      "content": "\\> say why it doesn’t work.\n\nThat's not a thread, that's a seminar.\n\nSeriously, I agree that I could've been more helpful, but consider this: out of one to two thousand readers at a given moment, how many said <cite>anything</cite>? My feedback was minimal, but I'm hoping more useful than silence.\n\nhhp\n\n"
    }
  ]
}
