{
  "id": "3206",
  "title": "IBeam typographic arts research project",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Hi everyone   \n   \nThis is my first post to typophile. I wanted to introduce you to a project I am involved in called IBeam.   \n   \nBasically last year we started this project as part of Architecture Week here in the uk. We essentially worked with some leading architects to see how they think about type and created a series of fonts based on their concepts. Here are some images of the typefaces..   \n   \n ![Alsop](http://web.archive.org/web/20050526221617im_/http:/www.typophile.com/forums/messages/30/26833.gif)   \n   \n ![dRMM](http://web.archive.org/web/20050526221617im_/http:/www.typophile.com/forums/messages/30/26834.gif)   \n   \n ![feilden](http://web.archive.org/web/20050526221617im_/http:/www.typophile.com/forums/messages/30/26835.gif)   \n   \n ![formdesign](http://web.archive.org/web/20050526221617im_/http:/www.typophile.com/forums/messages/30/26836.gif)   \n   \n ![futuresystems](http://web.archive.org/web/20050526221617im_/http:/www.typophile.com/forums/messages/30/26837.gif)   \n   \n ![hemingway](http://web.archive.org/web/20050526221617im_/http:/www.typophile.com/forums/messages/30/26838.gif)   \n   \n ![nealhuston](http://web.archive.org/web/20050526221617im_/http:/www.typophile.com/forums/messages/30/26839.gif)   \n   \n ![perrella](http://web.archive.org/web/20050526221617im_/http:/www.typophile.com/forums/messages/30/26840.gif)\n\n",
  "author": "pixelsumo",
  "time": "Thu, 2004-02-19 17:28",
  "uid": "3103",
  "comments": [
    {
      "time": " Thu, 2004-02-19 17:34",
      "content": "oops, just figured out how to upload images.   \n   \nAnyway, the website is currently down at the moment as they are moving servers, so I have uploaded the site to my webspace.   \n [http://www.pixelsumo.com/ibeam/](http://web.archive.org/web/20050526221617/http:/www.pixelsumo.com/ibeam/)   \n   \nThere you can download the fonts and look at the photos of the exhibition from last year. We have just begun work on this years IBeam, working with dancers to concept and create fonts. There will be an exhibition around May in Plymouth if anyone is interested.   \n   \nHere are a couple of photos from last year...   \n   \n ![exhibition 1](http://web.archive.org/web/20050526221617im_/http:/www.typophile.com/forums/messages/30/26842.jpg)   \n   \n ![exhibition 2](http://web.archive.org/web/20050526221617im_/http:/www.typophile.com/forums/messages/30/26843.jpg)   \n   \n ![exhibition 3](http://web.archive.org/web/20050526221617im_/http:/www.typophile.com/forums/messages/30/26844.jpg)   \n   \n ![exhibition 4](http://web.archive.org/web/20050526221617im_/http:/www.typophile.com/forums/messages/30/26845.jpg)   \n   \n(more on the website)   \n   \nWhat do you think to the project?\n\n"
    },
    {
      "time": " Thu, 2004-02-19 17:44",
      "content": "I should probably mention which architects were involved (you may have heard of them):   \nWill Alsop, Wayne Hemingway, Form Design Group, Future Systems, dRMM, Feilden Clegg Bradley, Stephen Perrella & Neal Huston.\n\n"
    },
    {
      "time": " Mon, 2004-02-23 13:16",
      "content": "the url has moved now to...   \n [http://www.i-dat.org/projects/ibeam/](http://web.archive.org/web/20050526221617/http:/www.i-dat.org/projects/ibeam/)   \n   \nStrange to only have one reply. Is the general discussion the best place for this thread?\n\n"
    },
    {
      "time": " Mon, 2004-02-23 15:32",
      "content": "Hi Chris,   \n   \nIt seems like an interesting project, but it seems a bit removed from typography. Looking at the process the artists are asked to go through, they seem to be designing 36 bits of square clip-art, which someone else then arranges in visually interesting way. The clip-art may be mapped to a particular letter, but there doesn't seem to be a link between a letter and the particular image it's mapped to.   \n   \nYou could draw comparisons to the FUSE project, but in that project practicing type designers (mostly) were given a theme, and they designed a font around that theme. With your project you've asked people with regular jobs (architect or dancer) to design a font somehow related to their job. Your project is interesting; it's just somewhat less typographic than FUSE, which kind of ran it's course anyway.   \n   \nWith FUSE most of the fonts had some typographic qualities, an A was supposed to be an A (eve when it didn't look like an A) - this doesn't seem to be the case with your project - you refer to your template as a 'landscape' not a character map, you only allow one case and no punctuation. The person drawing the glyphs has to be reminded not to use color - seems like art is being forced into a font file.   \n   \nThat's not a bad thing, but perhaps it explains the lack of discussion.   \n   \nCheers, Si\n\n"
    }
  ]
}
