{
  "id": "32064",
  "title": "Nixie up for a Crit",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "I've just complete my first typeface, I began drawing it in 1998. It's based on the aesthetic of nixie vacuum tubes. Nixie tubes you ask? They are the predecessor to LED displays, they were used extensively by NASA during the space race of the 40's, and 50's. The typeface is a matrix style face and the design was in part a study in creating something that allows others to use it and at the same time 'redesign' it.\n\nI would really like to hear what other typographers think Nixie.\n\nYou can find more examples and download the mac or PC fonts from my website: [http://www.meld.com/ken](http://web.archive.org/web/20150419060756/http:/www.meld.com/ken \"http://www.meld.com/ken\")\n\nThanks,  \nKen\n\n| Attachment | Size |\n| --- | --- |\n| [nixie\\_a.gif](http://web.archive.org/web/20150419060756/http:/typophile.com/files/nixie_a.gif) | 11.82 KB |\n| [nixie\\_characters.gif](http://web.archive.org/web/20150419060756/http:/typophile.com/files/nixie_characters.gif) | 35.57 KB |\n\n",
  "author": "kenblaue",
  "time": "7 Mar 2007 — 3:10pm",
  "uid": "17279",
  "comments": [
    {
      "time": "7 Mar 2007 — 8:15pm",
      "content": "It's a cool concept but the implementation may be a bit more eccentric than could be ideal. Take you lower case c. Is that really the friendliest way to display it? Still, I am sympathtic towards the project. It's NEAT-O.\n\n"
    },
    {
      "time": "8 Mar 2007 — 12:12am",
      "content": "Thanks for the comments. Yeah, it's eccentric (bordering on geeky). For me the wonder of typography has always been that a designer might create a typeface but the use of that typeface is well beyond his/her control or vision.  \nIn part I wanted to take the actual form of the typeface a step farther. The lowercase c I create was a decision based on my vision of the letterforms, but the matrix allows you create a lowercase c in your vision and it might be more effective than mine. The design has then grown beyond my vision and into something I did not imagine, I find this the most compelling idea behind Nixie.\n\nken\n\n"
    },
    {
      "time": "8 Mar 2007 — 9:19am",
      "content": "<cite> The design has then grown beyond my vision and into something I did not imagine, I find this the most compelling idea behind Nixie. </cite>\n\nWould you expand on that? I am not sure what you mean.\n\n-e.\n\n"
    },
    {
      "time": "8 Mar 2007 — 10:28am",
      "content": "Well, it's odd. You've used a LED/LCD system to try to portray a Nixie-tube aesthetic, and the result looks like neither. It seems like the large number of segments hasn't brought a proportionate gain in legibility or flexibility.\n\n"
    },
    {
      "time": "8 Mar 2007 — 12:51pm",
      "content": "\\> The design has then grown beyond my vision and into something I  \n\\> did not imagine, I find this the most compelling idea behind Nixie.\n\nI find it to be the most compelling idea behind <cite>design</cite>. :-)\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2007 — 1:21am",
      "content": "Thanks for the feedback, I'll try to elaborate a bit more.\n\n_The design has then grown beyond my vision and into something I did not imagine, I find this the most compelling idea behind Nixie._\n\nThis idea came about after talking with a few friends that are typographers. One of them had the good fortune designing a typeface that quickly because world famous (in the design industry). One of the results of that was he saw his typeface used on everything from Hollywood movie posters to the Bible, to German gay porn magazine covers. Initially his (and all of our) reaction was \"it should only be use for what it was designed for\". But then after thinking about it, I really came to like the idea of others 'misusing' something I made.\n\nFor 100 years graphic/prodcut design has been built on the idea of a benevolent visionary. A person with a vision of the (better) future and they will dispense this through form and color to their audience. From Alexy Brodovitch and Max Braun to Paul Rand and Morphosis their wondrous visions (and they are great, I not knocking these people!) were created and sent down to the common man.\n\nTypography struck me as different. You design a typeface that fulfills a basic set of requirements; readable, and special feel, some vernacular etc. But then you put it out into the world. From that point on you have no control over it, or what people do with it. And there are many tools out there to do something with type. So even if you intended to make a highly readable typeface some designer out there will grunge it up and put in on a poster you can't read. If you make a typeface inspired by the soul groups from the 50's, someone will use it for the cover of an annual report. All these uses are well beyond the vision of the original author. I find that one of the strong points of typography, a typeface always becomes more than what it started out as.\n\nI want to explore going even farther with this idea, not just put a design object out for _use_ but design something that redesign is inherent in. Something that is easy to change into your own.\n\nOf course you can go into illustrator and change Frutiger outlines. But it's not inherent in the the design, it's not part of Frutigers vision of what the typeface what supposed to do.\n\nken\n\n"
    }
  ]
}
