{
  "id": "32068",
  "title": "How do I add DIACRITIC MARKS",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I wanted to know how to add diacritic marks when typing arabic words using the english alphabet. For example a dot needs to be placed under various letters like H and T to indicate that they are guttural sounds. I've been trying to figure this out for months and have been unable to. Any help would be GREATLY APPRECIATED.\n\nThanx\n\n\"Non-pure abjads (such as Hebrew and Arabic script) and abugidas use diacritics for denoting vowels. Hebrew and Arabic also indicate consonant doubling and change with diacritics; Hebrew and Devanagari use them for foreign sounds. Devanagari and related abugidas also use a diacritical mark called a virama to mark the absence of a vowel.\" - WIKIPEDIA\n\n",
  "author": "faraz",
  "time": "7 Mar 2007 — 5:38pm",
  "uid": "17282",
  "comments": [
    {
      "time": "7 Mar 2007 — 5:46pm",
      "content": "In Word (2007 version on previous version with service packs) use a font that either has these characters pre-composed or supports combining diacritics, such as the latest version of Times New Roman, or one of the fonts from SIL. Use the insert symbol dialog to insert pre-composed characters or combine the \"dot accents\" as needed.\n\n"
    },
    {
      "time": "7 Mar 2007 — 5:51pm",
      "content": "I was actually designing in Indesign CS2 and I cant seem to find a way to do it. There are other symbols as well such as lines above certain letters along with dots underneath letters. How is it done in InDesign?\n\n"
    },
    {
      "time": "7 Mar 2007 — 6:18pm",
      "content": "Best way is to make up the characters in a program like FontLab. Most of what you want already has a Unicode number -- see the Latin Extended Additional code sheet. For characters that are not precomposed in Unicode, you need to make up the character and give it a glyph NAME (it will not have a Unicode index) of its Unicode components. Take a look at Adam's writeup on this method at the MSN FontLab site, he also covers how to write the feature in the font that will allow them to be more easily entered in a program like InDesign.\n\nMost existing commercial fonts I know of do not have these characters. Probably your best bet is Gentium, available from the SIL site -- but Google \"gentium\" for the download info. Alas, Gentium does not have ligatures or kerning -- which takes you back into making your own characters in the fonts you want -- where the EULA allows, as with all Adobe fonts.\n\nI believe Adobe has some plans to revisit some of their fonts and add these characters, but that will be for the future. Maybe the people who frequent this forum know of fonts where they already exist, but a lot of our work involves setting texts where such characters are needed, but not available, so I know a good bit about what is not available in traditional fonts. Linotype Palatino (TT) may have the underdots for transliterated Arabic, but not, I think, the underlines (not used in Arabic are they?) -- but used in Sanskrit.\n\nAs far as entering them in InDesign, you can use the glyph pallet (the worst way), or enter them directly by using the Unicode number. You can also have them in the text you import, and they will work fine.\n\nGood luck.\n\n"
    },
    {
      "time": "7 Mar 2007 — 6:41pm",
      "content": "\\>I was actually designing in Indesign CS2 and I cant seem to find a way to do it.\n\nMiggy will likely flame me again for saying this, given inDesign's complete and full Unicode support, but hackery like Charles suggests would probably be your best bet until Adobe gets around to supporting combining diacritics. But there are many fonts (Arabic Typesetting being another) that have many of these characters pre-composed and I can't imagine that InDesign would not let you insert them via the glyph palette\n\n"
    },
    {
      "time": "8 Mar 2007 — 5:38am",
      "content": "Actually, there is a way to typeset these marks. The same way we had to use in the old days of photocomp. Set your \"d\", then set a period, kern it back, lower it, make it smaller if you need to. Now, when you set your next letter, it will likely collide with the \"d\", so you will have to kern it forward. And so on. With the macron over an \"r\", same technique. And again the same for an \"r\" with both a macron & underdot.\n\nA lot of work, and one reason why the older editions of the Chicago <cite>Manual</cite> recommended not using the underdots in transliterated Arabic.\n\nSimon, I doubt the fonts that have Arabic include the characters for <cite>transliterated</cite> Arabic. Why transliterate when you can have the real thing? And finally, I take exception to \"hack.\" I think of myself as a little Norse gnome, going into fonts & fixing all the little things the creative genius's got wrong.\n\n"
    },
    {
      "time": "8 Mar 2007 — 5:55am",
      "content": "The font in need is a transliterating tool in deed? Elaborating:  \nArabic transliteration needs dots below d,h,s,t+z and dashs above a,e+o, but it needs no c,i,g,p,u,v nor x. So 7 gained opposite (8-3) in need ?!  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nRules of Transliteration:\n\n1. Sokôn — the a vowel-less sign — is transliterated into (-), making the consonant stationary as there is no vowel after it, as n is gun + d in bad\n\n2. Shadda is transliterated by doubling the letter it hovers above.  \nWhen Shadda appears over any consonant, that consonant is voiced twice, as n in run-ner. But in Arabic , the letter is voiced separately, run-ner, fod-der, the first is stationary.\n\n3. [a and â], [e and ê], [o and ô]  \nFatha that sounds like u in cut or but is transliterated into (a).  \nFatha+Alif that sounds slightly longer as in far is transliterated into (â)  \nFatha+Alif+Mad that sounds like extra long aa is transliterated into (ââ)\n\nKasra that sounds like i in pin or sin is transliterated into (e) .  \nKasra+ya that sounds slightly longer as ee in seen is transliterated into (ê)  \nKasra+ya+Mad that sounds like extra long ee is transliterated into (êê)\n\nZamma that sounds like u in put is transliterated into (o) .  \nZamma+Waw that sounds slightly longer oo as in soon is transliterated into (ô)  \nZamma+Waw+Mad that extra long oo is transliterated into (ôô)\n\nIn the beginning of a word or syllable (after a dash), a, e and o are consonants. But, if they appear after a consonant they are vowels.\n\n4. 3ain — voiced from middle throat — is transliterated into (‘). Thus  \n(‘a) and ‘â], [‘e and ‘ê], [o and ‘ô] are consonants wherever they appear.  \n(‘a) sounds like aa  \n(‘e) sounds like ee  \n(‘o) sounds like oo  \n(‘-) Consonant only  \n(‘â) sounds like ‘a+a  \n(’ê) sounds like ‘e+e  \n(‘ô) sounds like ‘o+o  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nPeace with Flowers\n\n"
    },
    {
      "time": "8 Mar 2007 — 6:41am",
      "content": "I needed the underdot h and H (regular, bold, italic, bold italic and small caps) for Hebrew transliteration. I asked John Hudson the best way to do it. He recommended doing a separate font with the characters. The font, Adobe Jenson, already has a dot accent over some letters, and that (not the dot over the i) matches the glyphs as an underdot also, so using FontLab I just copied these to the right spot. It works fine.\n\n"
    },
    {
      "time": "8 Mar 2007 — 6:45am",
      "content": "Just got into the office & checked. Palatino (TT) does <cite>not</cite> have the needed diacritics. Gentium does, including the ones for transliterated Indic Scripts (Devanagari). Gentium is fine for casual use, but as mentioned, not quite up to the task of typesetting books. In pasing, I have seen translitertated Arabic that also uses a dot below the \"D\" as well as H S T and Z. Lower case and small caps also needed.\n\nThe \"lines\" over \"a\" \"e\" and \"o\" can be handled routinely with the macron over the Latin vowels, included in many OpenType fonts in upper & lower case, though often not with small capitals.\n\nI haven't seen any commercial fonts that include hamzas and ayns; the usual convention is to use an apostrophe (/quoteright) & single open quote (/quoteleft); special sorts can be made up, but of course, once you get into making up your own characters for a font, you can pretty much make anything you need.\n\n"
    },
    {
      "time": "8 Mar 2007 — 7:52am",
      "content": "\\>Simon, I doubt the fonts that have Arabic include the characters for transliterated Arabic.\n\nThe Arabic Typesetting font was designed with the needs of scholars in mind, so combines these. Arial, TNR and Courier New have been extended to support all encoded Latin characters and combining diacritics.\n\n\\>And finally, I take exception to “hack.”\n\nSorry, just calling it what it is...\n\n\\>I think of myself as a little Norse gnome\n\nWhat you do in the privacy of your own home is up to you.\n\n"
    },
    {
      "time": "8 Mar 2007 — 8:03am",
      "content": "\\> _I was actually designing in Indesign CS2 and I cant seem to find a way to do it._\n\nI believe you'll need the ME (Middle East) version to be able to do this.\n\n"
    },
    {
      "time": "8 Mar 2007 — 8:06am",
      "content": "\\> _Miggy will likely flame me again for saying this [...]_\n\nYes, I'm an evil-evil man... (wink)\n\n"
    },
    {
      "time": "8 Mar 2007 — 8:15am",
      "content": "\\>I believe you’ll need the ME (Middle East) version\n\nIf you are doing transliteration into latin characters, rather than a right-to-left language, you should be able to insert these characters, if they are in the font, via the glyph pallet in regular CS applications, no?\n\n"
    },
    {
      "time": "8 Mar 2007 — 9:40am",
      "content": " ![](http://web.archive.org/web/20150205050739im_/http:/typophile.com/files/Mary_4551.jpg)\n  \nPage 541 of 1100+pages I typeset 4-years ago with Arabic Word-6.  \nShows my never-released Arabic Font that I designed with Fontgraph 3.5  \nand the transliteration carried out with a Dos-Command I wrote in Assembly language.  \nNeedless to say, the whole project was handled on Arabic Windows 3.11. \n"
    },
    {
      "time": "8 Mar 2007 — 10:03am",
      "content": "<cite>I needed the underdot h and H (regular, bold, italic, bold italic and small caps) for Hebrew transliteration. I asked John Hudson the best way to do it. He recommended doing a separate font with the characters. </cite>\n\nBill, was this back in the days of FontLab 4.2 or so? As I remember, the older versions of FontLab had trouble with preserving an existing features file, esp. where the \"line length\" of an item was long. FontLab 5.X doesn't seem to have this problem.\n\nI think it is as much work to make a separate font as to add to the existing font. While an \"h\" usually doesn't need much kerning if the sidebearings are correct, adding the small-cap glyphs to the c2sc and smcp features is a plus. So too is having only one font with everything in it.\n\nAzizMostafa\n\nNice. You can do the transliterations easily with TeX, though I'm far less sure about setting the Arabic script. TeX allows the user to write macros & not in assembly language!\n\n"
    },
    {
      "time": "8 Mar 2007 — 5:08pm",
      "content": "TeX can handle the Arabic nicely.\n\nFor example, see [http://www.ucam.ac.ma/fssm/rydarab/](http://web.archive.org/web/20150205050739/http:/www.ucam.ac.ma/fssm/rydarab/ \"http://www.ucam.ac.ma/fssm/rydarab/\")\n\n"
    },
    {
      "time": "8 Mar 2007 — 9:54pm",
      "content": "Speter, that link has spoilt my Sp(eedom)eter?!  \nMathematics is international Language, so I see no point in transliterating letters while maitaining symbols?!  \n [http://www.ucam.ac.ma/fssm/rydarab/doc/present/transtece.pdf](http://web.archive.org/web/20150205050739/http:/www.ucam.ac.ma/fssm/rydarab/doc/present/transtece.pdf \"http://www.ucam.ac.ma/fssm/rydarab/doc/present/transtece.pdf\")  \nThanks with Flowers\n\n"
    }
  ]
}
