{
  "id": "32088",
  "title": "Type in the Round",
  "forum": "Design",
  "tags": [

  ],
  "content": "I’m looking at the Leslie Carbarga book, “Logo, Fonts, and Lettering Bible” which has a great feature on tweaking text on a curve.\n\nI’m curious if anyone has any other insight into the process of text on a curve. I’m working on a packaging label that will be set in a circle and could use some tips. Leslie of course is a master so, some of his steps seem to miss that extra novice detail.\n\n [‹ Alternative to DIN](http://web.archive.org/web/20080829233654/http:/typophile.com/node/32979 \"Go to previous forum topic\") [Not liking the 1's and $'s on Galaxie Polaris ›](http://web.archive.org/web/20080829233654/http:/typophile.com/node/32981 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080829233654/http://typophile.com/user/6496\" title=\"View user profile.\">Asvetic</a>",
  "time": "<br>",
  "uid": "6496",
  "comments": [
    {
      "time": " 8.Mar.2007 1.45pm",
      "content": "I’m looking at those pages (p. 190-195)in my copy, and it looks pretty clear to me.\n\nI think the thing you have to watch out for is making sure the baseline curves properly. It may be tricky depending on the letters and typeface you’re working with.\n\nDoes that help or is there something more specific you’re having a problem with?\n\n"
    },
    {
      "time": " 8.Mar.2007 3.00pm",
      "content": "Andrew, my copy of LFLB is at the office, so excuse me if I duplicate advice already offered therein. Putting text on a curve messes royally with the inter-character spacing, so you’ll _always_ need to kern and respace to achieve even typographic colour right around the curve. Word spacing should almost always be closed up for the same reason.\n\nI always found it safer to a) do this on a copy of the setting in case I mess it up and have to revert to the original, and quicker to b) get the spacing done satisfactorily before any ’convert to paths’ operation.\n\nIn a lot of cases where the text runs around a complete circle in an ’over and under’ fashion, it can help to place punctuating dingbats, flowers or bullets symmetrically (say at at 9 o’clock and 3 o’clock) – again to fill gaps and achieve even colour.\n\nPrinting a proof and examining it upside down from a distance is a quick way to check for spottiness and bad spacing.\n\nLeslie talks quite a lot about making the baselines and foot serifs of the type follow the curve, which is easily done after the ’convert to paths’ operation. You’ll need to work with duplicates of the original circle (in the original position relative to the type outlines) and the pathfinder function.\n\n"
    },
    {
      "time": " 8.Mar.2007 3.31pm",
      "content": "Another tip for the ’over and under’ style is to make sure both parts of the type are ’aligned to path centre’ in the options.\n\n"
    },
    {
      "time": " 8.Mar.2007 3.46pm",
      "content": "Excellent. I think the most difficult part is the kerning and spacing, because the baseline gets crowded really fast.\n\nLeslie’s explanation for masking and clipping the edges doesn’t explain if I should extend the tops of letters and then clip them like I would have done for the baseline and foot serifs.\n\nI’m using Freight Sans because it seems to be the most forgiving without losing much character. The Text is: **CERTIFIED** along the top curve and **PEST FREE** along the bottom curve, inverted of course. Do I need to worry about the center arms of the E and F?\n\n"
    },
    {
      "time": " 8.Mar.2007 4.27pm",
      "content": "Don’t feel squeamish about changing the lettershapes. This situation of yours is a classic reason for custom ’lettering’. One way to escape from the font’s forms would be to print out & hand draw over the forms to get them to sit nicely together. Or make outlines & do it digitally. Whichever gives you the freedom you need. Or indeed both. You might want to look at Mark Simonson’s lettering too.\n\n[http://www.ms-studio.com/letteringdesign.html](http://web.archive.org/web/20080829233654/http:/www.ms-studio.com/letteringdesign.html \"http://www.ms-studio.com/letteringdesign.html\")\n\n"
    },
    {
      "time": " 28.Mar.2007 11.11am",
      "content": "I meant to post this awhile ago and just got caught up. I appreciate all the comments and tips on what to do.\n\nHere’s the end result:\n\nTop is the original, bottom is the new version I did.\n\n ![](http://web.archive.org/web/20080829233654im_/http:/typophile.com/files/curve-type_3909.gif)\n\n"
    },
    {
      "time": " 28.Mar.2007 8.40pm",
      "content": "Yaaay! Well done.\n\n"
    },
    {
      "time": " 31.Mar.2007 2.55pm",
      "content": "Nice! Do you want kibbutzing at this point?\n\n"
    },
    {
      "time": " 1.Apr.2007 10.36am",
      "content": "<cite>Nice! Do you want kibbutzing at this point?</cite>\n\nBefore I answer, you’ll have to explain what kibbutzing is, it sounds interesting.\n\n"
    },
    {
      "time": " 1.Apr.2007 3.57pm",
      "content": "Kibbitzing = nit-picking. ;-)\n\n"
    },
    {
      "time": " 1.Apr.2007 5.14pm",
      "content": "Well in that case... No.\n\nI know it’s not perfect, and at this point it’s pretty much out of my hands. I do appreciate the help you guys have given me though. I imagine the next time I have to do this I’ll be even better at it.\n\n"
    },
    {
      "time": " 10.Apr.2007 6.22pm",
      "content": "Fair enough.\n\nLinda- thanks for catching that misspelling!\n\n"
    },
    {
      "time": " 10.Apr.2007 9.06pm",
      "content": "The original is malformed, but the remake is sterile.\n\nhhp\n\n"
    },
    {
      "time": " 10.Apr.2007 10.28pm",
      "content": "The old one was quite FUNKY. The new one is looks less like a rave flyer. AND sterile is what it promises. Pest-Free. No?\n\n"
    },
    {
      "time": " 11.Apr.2007 5.55am",
      "content": "Now I feel compelled to justify the redesign. It’s a stamp for wood packaging material,used only to indicate that the wood has passed necessary certification requirements including a pest-free environment (the wood has a moisture content that is too low to harbor a positive breeding ground for mites.) Other than indicating it’s passed this requirement it hold no other function so I felt it necessary to create a stamp that was more legible and easier to read. So sterile sounds like a good thing to me.\n\n"
    },
    {
      "time": " 11.Apr.2007 6.03am",
      "content": "If pure legibility was the goal why set it in a circle? It should be in straight lines. Pure legibility is never the issue, and there’s always room for character (just at different levels depending on purpose). Not that the effect in the original is necessarily pertinent to the content, but it seems to me that something good was lost in the remake, and what was gained in exchange was not worth it.\n\nhhp\n\n"
    },
    {
      "time": " 11.Apr.2007 7.12am",
      "content": "If I had creative freedom to change the layout; I would have done away entirely with the text and created an icon instead. Charm was never a factor in the redesign. In the environment this will be used, sterile simplicity is better. The recognizable circular layout has been maintained.\n\nYou’re entitled to your opinions, some of which I find positive and some I find not to be.\n\n"
    },
    {
      "time": " 11.Apr.2007 7.27am",
      "content": "I think you’re being: too Modernist; and too sensitive to criticism.\n\nhhp\n\n"
    },
    {
      "time": " 11.Apr.2007 7.56am",
      "content": "I’m seldom sensitive to creative feedback.\n\nIn this instance, I don’t see a necessity to change the design again, not that I could. The client signed off. If they come back again, I’ll keep your input in mind and will try to infuse charm back into my lifeless design.\n\n"
    },
    {
      "time": " 11.Apr.2007 9.23am",
      "content": "Hrant, personally I am glad that you explained what you meant more fully. It’s always interesting to hear what you think. And I agree with you that the old one was probably more eye catching - but the new one is marginally easier to read. Since Andrew said this project is behind him & he didn’t want a further crit I won’t get into what I might think about doing differently. I think that’s his perogative even if it wouldn’t be my own choice.\n\n"
    },
    {
      "time": " 11.Apr.2007 9.29am",
      "content": "Why do we discuss fonts that are already released?  \n(Certainly not because we expect the designer to go back and change things.)\n\nhhp\n\n"
    },
    {
      "time": " 11.Apr.2007 9.41am",
      "content": "Oh, I agree!\n\nAnd up to this point the thread was ( to my mind ) meant for Andrew’s benefit. Since Andrew said he didn’t want to hear more ( and I was late to the party) I was willing to keep quiet. I try to be easy going like that.\n\nBut Hrant, - if YOU want my opinion I am happy to share it with you here. If Andrew doesn’t want to hear/read it here - I suppose he doesn’t have to look. And I would certainly like to know what you think in more detail.\n\nAndrew - feel free to object. Maybe you can change my mind. Is there any reason that Hrant & I should not discuss your choices between ourselves in this place?\n\n"
    },
    {
      "time": " 11.Apr.2007 9.54am",
      "content": "Certainly consideration for Andrew’s feelings and wishes should be part of the decision of whether to curtail what could be a useful learning exercise (for Andrew, myself, and who knows who else). But I feel there’s [still] too much sterilization going on in the world of design in general, and it seems fruitful to explore middle grounds here between the clumsy charm of the original and the neutered functionality of the remake. And really it’s not just about “charm”: I might suggest that the original’s textural difference between the circular text and the “DoD” in the middle is a highly functional form of contrast.\n\nSpeaking up against stuff like this is... educational! Sure, helping people  \nwith specific tasks is great, but Typophile isn’t some production intranet.\n\nMaybe a new thread would be better, using this merely as an example (if that).\n\nhhp\n\n"
    },
    {
      "time": " 11.Apr.2007 10.42am",
      "content": "I’m not one to stifle dialogue for the maturity of design. If you’d like to use my example as a spring board into a deeper discussion about Hrant’s views of the ever growing sterilization of design, please do.\n\nI won’t be offended, I know that my solution wasn’t the ultimate solution to the problem I just wasn’t interested in hearing more about it. My primary reason for starting the thread was to get information on designing text in a circular path and what should be taken into consideration.\n\nPlus, it’s a public forum feel free to create a subtopic here.\n\n"
    },
    {
      "time": " 11.Apr.2007 10.50am",
      "content": "Okay cool.\n\nMy suggstion would be to take fuctionality further by making the type in a circle smaller to let you soften the problems in the interletter spaceing that persist in both designs. And raise the Dod to make it optically balance better.\n\nI am not sure what to say about the DoDAAC. Without knowing what the stuff on the right means & how important or unimportant it is I am at a loss.\n\nI have an idea that the design might be better without the square boxes or with some other strcuture instead. And as I said - it would be good ( probably) if it were slightly more eye catching in the way that the ’fragile symbol’ or the ’keep out of damp ( umbrella) symbol’ on boxes is. Not hugely - but enough.\n\nHrant?\n\n"
    },
    {
      "time": " 11.Apr.2007 10.57am",
      "content": "Very gracious Andrew - thanks.\n\nWell, my angle would be to preserve (but redo) that “centrifuge” distortion! :-)\n\nhhp\n\n"
    },
    {
      "time": " 11.Apr.2007 11.42am",
      "content": "Eben, the DODAAC is a filler, it’ll be replace with a registration number corresponding to the location that the last certification was performed. It consists of 5 numbers and a letter such as 12345A.\n\nUnlike the Fragile or “umbrella” symbol that would be placed predominently on a cardboard box (probably atleast on 4 if not all sides), this Pest free stand would be used to indicate any and all wood used in a wood container (or any container using wood material such as a palette). So proliferation of the stamp could be as much as 1 stamp or a 100 stamps on a single container. The boxed layout was predetermined by an international committee not a designer.\n\nThis stamp is used in conjunction with several stamps... which might give you an understanding of why I didn’t kill myself redesigning this stamp. Honestly, I’m not really sure why I did other than I wasn’t as impressed with the “charm” that Hrant sees in the original.\n\nHrant, I might have considered reattempting the “centrifuge” distortion if I knew how it was achieved in the first place. Like the original topic suggests, I wasn’t as proficient in creating text on a circular path, let alone manipulating it beyond a certain point.\n\n"
    },
    {
      "time": " 11.Apr.2007 11.46am",
      "content": "I’m not even close to being an Illustrator expert, so I don’t know if there’s some kind of “envelope” feature that can do the centrifuge effect. If there isn’t, they might have done it with some CAD software.\n\nhhp\n\n"
    },
    {
      "time": " 11.Apr.2007 11.57am",
      "content": "I would have guessed Powerpoint.\n\n"
    },
    {
      "time": " 11.Apr.2007 11.58am",
      "content": "There are lots of ways of getting that effect up to & including drawing it by hand. I suspect the origianl was done in ’type styler’ in the Early 90’s. That sign painter never had a chance. The digital methods of doing this stuff mostly look like poop to me. I think it’s kind of charming that Hrant likes the old one though. To me it just feels like a bad old 80’s t-shirt. So hokey. Still, one man’s food is another man’s poison. And I can understand somebody being interested in making a serile DoD label into something hokey but human looking - warts & all.\n\n"
    },
    {
      "time": " 11.Apr.2007 12.02pm",
      "content": "I’m not a grunger. What I think is <cite>useful</cite> is the interest and contrast the centrifuge effect seems to be providing. Which is not to say I think it should be done mechanically; things like the “P” for example need special attention.\n\nhhp\n\n"
    },
    {
      "time": " 11.Apr.2007 12.03pm",
      "content": "Hrant, if that’s true, I’ll send you the original Vector and you can make an iron-on.\n\n"
    },
    {
      "time": " 11.Apr.2007 1.20pm",
      "content": ":-\\>\n\nhhp\n\n"
    },
    {
      "time": " 11.Apr.2007 10.03pm",
      "content": "contrast with the other side.\n\n:-)\n\n"
    }
  ]
}
