{
  "id": "32106",
  "title": "Is there a way to export Suitcase Font Sets (PC)?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Is there a way to export Suitcase Font Sets (PC)? I know it works on a Suitcase Mac Version(Fusion?). I'm about to buy a new Computer and I don't want to start rearranging all my fonts.\n\nThanks FLo\n\n",
  "author": "<a href=\"/web/20110218134531/http://typophile.com/user/17304\" title=\"View user profile.\">brids78</a>",
  "time": "<br>",
  "uid": "17304",
  "comments": [
    {
      "time": "",
      "content": "I use Suitcase for Windows and there isn't a feature that lets you export/import sets currently. I'm supposing that is because you'd have to remap all the fonts associated with the sets and Suitcase does not do this automatically.\n\nThis might be a stretch, and I'm not saying it'll work, but you can try this...\n\nInstall Suitcase to your new machine, don't start it up yet. Then duplicate your fonts onto your new machine making sure that the directory paths are exactly the same. ex: **C:\\Files\\Font Directory\\...**. Then copy the content of your Extensis Suitcase directory from your old machine to your new machine. With Suitcase 9.2 it was everything in the Data folder, with Suitcase 11 it's much more and I'm not exactly sure so copy it all. Finally, start up Suitcase and see if it sets have been duplicated.\n\nIf it doesn't work, I'd suggest uninstalling and reinstalling Suitcase to start with a clean slate then get to work doing all that wonderful Font Management that Suitcase neglects to do.\n\n"
    },
    {
      "time": "",
      "content": "This is quite easy to do with FontExpert; you just back-up the Font Sets folder that FE creates when you first create your sets, and move it to the newly installed program directory. One caveat: if you've specified \"shortcuts\" when installing fonts/sets (rather than actually copying the fonts to the Font Sets folder), as above, you need to be sure that the font files are in the same location that they were when the sets were created.\n\nAs for Suitcase, when I was using 9 I used the method above and it worked fine, but it irritated me that I had to make sure Suitcase wasn't running in the background (which it normally is), and then clone the program files. Yet another seemingly obvious feature that Suitcase either doesn't include or is tricky to make happen.\n\n"
    },
    {
      "time": "",
      "content": "This would be easy if Extensis took the iTunes approach and installed all the fonts into a Master file and actually \"managed\" the fonts for you.\n\nI can easily equate a font's family as if it were an music album, then each of the weights are tracks in that album. The foundry would be equal to the musician's label and it's style would be equal to the music's genre. All are sortable if you drag and drop your music files into iTunes and let iTunes manage your music folder. Why hasn't any font software made a similarly featured solution is beyond me. Even in the most basic of senses it's a solid foundation for font management.\n\nSuitcase cuts the management corner and makes a shortcut to the folder where the font resides, if that font is removed or the file directory is changed, that shortcut is useless. And you'll have to reconnect the files, imagine if that was your music, how can you enjoy your music if you're so busy keeping it organized?\n\n"
    }
  ]
}
