{
  "id": "32111",
  "title": "(x) Cooper Looser - Midas {Mark S}",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "I saw this font at ArcheType recently, and last night took a photo of it:\n\n ![](http://web.archive.org/web/20131106081203im_/http:/typophile.com/files/Funky_4615.jpg)\n\nI really like the \"bravado\" - to me this is a more charming Cooper Black. I'd like to find out what it's called and who made it (the pinmark was no help: it's just a thin straight vertical line in a circle) but most of all I just wanted to share it. The label on the drawer says \"Old Style Grotesque\", which is of course completely uniformative and probably incorrect.\n\nhhp\n\n",
  "author": "hrant",
  "time": "9 Mar 2007 — 9:51am",
  "uid": "1250",
  "comments": [
    {
      "time": "9 Mar 2007 — 10:37am",
      "content": "It's beautiful in an odd sort of way.\n\n"
    },
    {
      "time": "9 Mar 2007 — 10:41am",
      "content": "ymmy!\n\n"
    },
    {
      "time": "9 Mar 2007 — 10:45am",
      "content": "love the r\n\n"
    },
    {
      "time": "9 Mar 2007 — 11:09am",
      "content": "My favorite is the \"k\". And the kidney-bean dots on the ?/! of course!\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2007 — 11:53am",
      "content": "This looks like it is borrowed from Cyrillic types with the flaming tongue E and ball terminal r.\n\nChrisL\n\n"
    },
    {
      "time": "9 Mar 2007 — 12:14pm",
      "content": "I don't get it. If it is printers type shouldn't it all be a mirror image of what it is? Only the E might be a mirror image, but it is upside down compared to the AE. Was this from a sign?\n\n"
    },
    {
      "time": "9 Mar 2007 — 12:17pm",
      "content": "I assume hrant flipped the image.\n\n"
    },
    {
      "time": "9 Mar 2007 — 12:21pm",
      "content": "Chris, you just reminded me of something I drew  \nduring my Siberian splash-and-dash of 9/2004:\n\n ![](http://web.archive.org/web/20131106081203im_/http:/typophile.com/files/AKE_3939.gif)\n  \nNow I just have a find a company with those initials... :-)  \n--  \nYes, the photo has been h-flipped, for easier human processing.\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2007 — 1:17pm",
      "content": "Cuttlefish ( Jason ) needs to see this.\n\n"
    },
    {
      "time": "9 Mar 2007 — 2:45pm",
      "content": "Oh, I do see it. I think I know what you mean, Eben. There are some elements here that have a relation to the [project I'm working on.](http://web.archive.org/web/20131106081203/http:/typophile.com/node/28862) I wouldn't necessarily solve all its problems the way this font does, but this example does offer some great inspiration.\n\n"
    },
    {
      "time": "9 Mar 2007 — 2:48pm",
      "content": "The link isn't working.\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2007 — 2:51pm",
      "content": "It would have worked but for the lack of a \". The link is now fixed.\n\n"
    },
    {
      "time": "9 Mar 2007 — 3:11pm",
      "content": "I found a match in an old film font catalog: Midas. Hard to say if this was the name of the metal font.\n\n"
    },
    {
      "time": "9 Mar 2007 — 3:20pm",
      "content": "Solid gold! And imagine if the alchemists could turn that fat lead into it. ;-)\n\nAny more info? Who made it? Scan?  \nNo pressure though - only if you  \nhave the time and inclination.\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2007 — 3:47pm",
      "content": "Here's all there is:\n\n ![](http://web.archive.org/web/20131106081203im_/http:/typophile.com/files/midas_5394.gif)\n\nIt was in the 1970 edition of the Lettergraphics catalog. The Lettergraphics library was kind of dodgy--many off-name fonts.\n\n"
    },
    {
      "time": "9 Mar 2007 — 3:52pm",
      "content": "I looked in all my metal catalogs, too. No luck.\n\n"
    },
    {
      "time": "9 Mar 2007 — 3:58pm",
      "content": "That's definitely it - thanks much.  \nIt's funny how a font always looks better as metal sorts...\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2007 — 4:05pm",
      "content": "Not only is it very vaguely similar in style to my font, it too is also named for a legendary Greek king? Will coincidences ever cease?\n\n"
    },
    {
      "time": "9 Mar 2007 — 4:38pm",
      "content": " ![](http://web.archive.org/web/20131106081203im_/http:/typophile.com/files/samfont_3927.png)\n\n"
    },
    {
      "time": "9 Mar 2007 — 4:50pm",
      "content": "David, is yours called Midas too, or something else?\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2007 — 5:36pm",
      "content": "Romany.\n\nsince this is art nouveau font, and kinda 'similar' to Pretorian -- I'll start my hunt with the type foundry P.M. Shanks & Sons\\*, London.\n\n\\*and if there's a luck -- the cut is by Edward Prince.\n\n"
    },
    {
      "time": "9 Mar 2007 — 6:47pm",
      "content": "The pin mark as described indicates the font may have been produced by the Bresnan Type Foundry of New York.\n\nBut, I too found a complete showing of the font under the name Romany, although considering the source (photolettering catalog) I don't know if that's the true name or not.\n\nIf it turns out that Romany is not correct, if someone has the time to do so they might check the Bresnan specimen books in the Butler Library collection. They have the only complete set (5 books, 1856-1896).\n\n"
    },
    {
      "time": "9 Mar 2007 — 9:05pm",
      "content": "Hrant\n\nAmerican Type Founders commonly used a pinmark of a circle with a \"horizontal\" line running through it. The ancient astronomical symbol for earth. I guess one could assume this typeface was originally an issue by one of the foundries ATF gobbled up with the consolidation. And then later dropped from the line, likely by the 1920s.\n\nGerald\n\n"
    },
    {
      "time": "9 Mar 2007 — 9:09pm",
      "content": "This thing is friggin awesome.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "9 Mar 2007 — 9:45pm",
      "content": "\\> Pretorian\n\nAh yes, I see the resemblance.  \nBut strangely the Romany on MyFonts is a 1930s light script face, by ATF.\n\nAnd let me see if I can double-check that pinmark.\n\nhhp\n\n"
    },
    {
      "time": "9 Mar 2007 — 10:45pm",
      "content": "Looking some more, the lc s is pretty sweet. r & h too. A is not to bad. C is on the fence. Most of the caps are sweet. I especially like the E & J. The lc glyphs with counters seem to be ones with the most problems. check out eb & p. Monsterous!\n\n"
    },
    {
      "time": "10 Mar 2007 — 11:13am",
      "content": "\\> But strangely the Romany on MyFonts is a 1930s light script face\n\nYes, the script by Bosco.\n\nBut based on other fonts (around that time) -- Apolo, Cleopatra, Olympian, Petrarka, Pretorian -- maybe Romany is the original name.\n\nHowever, you can find different fonts with the same name (again, around that time): Venezia -- decorative/display font by Brendler & Sons (Vienna), and the text font -- George Jones/ Edward Prince (London)\n\n"
    },
    {
      "time": "10 Mar 2007 — 1:10pm",
      "content": "I have seen this typeface in use, and I also think I've seen it in one of the old ATF catalogues (1912 or 1923). No idea what it is offhand, however.\n\nT\n\n"
    },
    {
      "time": "10 Mar 2007 — 2:41pm",
      "content": "I did a quick check of both the 1912 and 1923 catalogs and, if it's in an ATF catalog, it's an older edition than the 1912...\n\n"
    },
    {
      "time": "10 Mar 2007 — 2:54pm",
      "content": "I think I know what font Thomas is thinking of, which is not this one, except I don't know what it's called - something with a \"p\". I can tell you the \"g\" has a massive, vertical, curling ear.\n\nhhp\n\n"
    },
    {
      "time": "10 Mar 2007 — 3:06pm",
      "content": "This looked vaguely familiar to me also. So I, too, did a quick check of my 1923 ATF and didn't find it. Neither was it in my Barnhart Brothers & Spindler, ca. 1925.\n\nBut . . . I did find it in my 1926 Stephenson, Blake & Co. specimen. It's titled _Lining Romany_. (Many of the SB fonts from this period are hyped as \"lining,\" meaning they are cast on the American Point Line system -- still a fairly new concept over there at that time, I think.)\n\nIt's offered in 60, 36, 30, 24 18, 12, 10, and 8 point.\n\nI've noticed that there are several SB designs that seem to have come over from the States and acquired new names (for instance, Chippendale = Pencraft), but there are also a few that may have traveled the other direction (Munder Roman = Verona?). So, it's hard to say whether this particular design originated with Stephenson Blake or not, and whether there might be an American equivalent, or even a predecessor.\n\n-- K.\n\n"
    },
    {
      "time": "10 Mar 2007 — 3:11pm",
      "content": "Kent, you're alive!! ;-)\n\nGreat, so it's Romany. It looks very American, doesn't it?  \nSo maybe it did have another name on these shores.\n\nhhp\n\n"
    },
    {
      "time": "10 Mar 2007 — 3:40pm",
      "content": "Olympian by Stephenson, Blake & Co. -- you can see similar features:\n\n ![](http://web.archive.org/web/20131106081203im_/http:/typophile.com/files/olym_5470.png)\n\n"
    },
    {
      "time": "10 Mar 2007 — 6:01pm",
      "content": "Hrant\n\nI have the original Vernon Simpson type specimen catalogs. A goodly portion of his holdings were given over to Archetype. A full specimen is shown in the catalogs as Romany [foundry indicated as S&B]. He only had the 36-pt.\n\nGerald\n\n"
    },
    {
      "time": "10 Mar 2007 — 6:17pm",
      "content": "Issue solved, no?\n\n"
    },
    {
      "time": "10 Mar 2007 — 8:39pm",
      "content": "I didn't realize I had an issue! :-\\>  \nNonetheless all the effort and info is highly valued. Typophile is  \na great rarity in its combination of competence and camaraderie.\n\n\\> I have the original Vernon Simpson type specimen catalogs.\n\nDoes Gloria know this? :-)\n\n\\> goodly portion\n\nI thought it was the whole thing. Where did the rest end up?\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2007 — 1:43am",
      "content": "It’s funny how a font always looks better as metal sorts…\n\nMaybe just because of the ink spreading when it hits paper, making the letter lose definition?\n\n"
    },
    {
      "time": "11 Mar 2007 — 8:53am",
      "content": "Possibly, although high-quality offset printing still doesn't look as good; plus when you look at physical pieces of type there's paralax distortion. Also, I feel that letterpress (which btw can now be done with plates made from digital files) does have some subtle advantage, and actually I think it might be from the avoidance of extreme crispness! I have an idea of how to replicate that in offset, but it's sort of far-fetched. I also wonder whether at the tail end of photosetting (where presumably the blur had become tamed if not eradicated) this subtle softness was also present (except digital was already making photosetting practically obsolete).\n\nAnother reason metal sorts seem to look better might be that they don't form actual readable words, hence leave our imagination to embelish the abstract; sort of how a person generally looks more attractive from a distance! :-)\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2007 — 9:38am",
      "content": "I get the same feeling from old well-made machinery. There is something about metal cut and fitted exactly to a form that is at once sturdy yet not the least bit pretentious. The gears of an oldfashioned lathe with all the precision yet knowing it was crafted by human hands.\n\nChrisL\n\n"
    },
    {
      "time": "11 Mar 2007 — 10:19am",
      "content": "To me letter press printing looks blacker. Does more ink go on the paper than with offset, or is the ink blacker or am I just hallucinating? (Also a strong possibility :)\n\n"
    },
    {
      "time": "11 Mar 2007 — 10:36am",
      "content": "The ink film in letterpress is physically thicker on the paper and impresses more into the paper fibers. Offset has a wash cleansing of extra residue from the plate and a second transfer from plate to blanket which further thins the ink that hits the paper. This allows for finer detail and less need for trapping but the thickness of ink is less. The effect is greater on noncoated paper which is more typical of books than slick mags. Web presses can get overly washed sometimes too so even coated stock impressions can be a bit anemic. As usual, a good pressman is required no matter what method is used.\n\nChrisL\n\n"
    },
    {
      "time": "11 Mar 2007 — 10:48am",
      "content": "However in letterpress the degree of black tends to be proportional to the degree of letterform distortion - over-inking is the sad norm (not least because you can always add ink, but you can only reduce ink by starting over). Few printers are willing and able to produce a good black without making the type something the type designer never intended (ergo: worse, in general).\n\nBTW, it's tempting -and probably intuitive- to think that the blacker the  \nbetter, but I think there's definitely such a thing as too much contrast.\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2007 — 10:51am",
      "content": "That's interesting Chris. So it seems I'm right about this. I was trying to agrue this with Gardner Lepoer at the Museum of Printing, but he wasn't buying.\n\nI'd like to hear more from press men (or women) with experience of both kinds of printing to corroborate your view, Chris.\n\nTo me, the deep velvety black of letter press is the main gorgeous thing about it, even more than the 'sock' into the paper. The contrast of that flat almost shiny black against rougher, matte paper that disperses light, rather than reflecting also contributes to readability, I think.\n\n"
    },
    {
      "time": "11 Mar 2007 — 11:52am",
      "content": "I don't know that I would characterize it as \"my view.\" I was just making an observation on the differences between the two methods which might corroborate your view. In terms of \"blacker\", I could not say without some sort of densitometer reading. The effect of blacker on the page is often, as Hrant mentions above, due to overinking and the inkspread that it causes. Too much packing is another culprit. It forces deeper impression and even rounding of type.  \nThe other issue is that often text faces that started in metal and later were made for photo or digital, didn't adjust for weight difference in inkspread when the transition was made and therefore seem lighter on the page.\n\nChrisL\n\n"
    },
    {
      "time": "11 Mar 2007 — 12:55pm",
      "content": "\\> the deep velvety black of letter press\n\nLike I said though usually this means it's over-inked. Can you point to many  \nexamples of letterpress where <cite>both</cite> the density of the black and the integrity  \nof letterforms are better than in offset?\n\nhhp\n\n"
    },
    {
      "time": "11 Mar 2007 — 1:36pm",
      "content": "I have a copy of the 1844 revival of Caslon, 'Lady Willoughby's Diary'. It was not only celebrated at the time, and led to the wider revival of Caslon, but also much later shown in exhibitions as an example of superb printing. It has more consistency and less distortion of the letters than in Caslon's own 1766 sample book--no doubt because of superior inks and printing technology of time. Its text is in a beautiful black against the woven matt paper, which incidentally looks not aged at all over 150 years later.\n\nI am not a printer, but I have printed letter press and was taught about over inking, and I do not agree that a deep black indicates over-inking. I think it is a feature of good, properly inked letter press. But as I say, I want to learn more about the differences on between offset and letter press from knowledgeable printers.\n\nAs of now I find Chris's analysis plausible.\n\n"
    },
    {
      "time": "11 Mar 2007 — 1:39pm",
      "content": "A darker lithographic print should be possible with multiple hits. The effects of registration error and ink spread could be reduced by choking one of the plates. This sort of thing is done to boost weak colours; I don't see why it couldn't be applied to black. Of course, it would increase printing costs.\n\n"
    },
    {
      "time": "11 Mar 2007 — 2:07pm",
      "content": "<cite> hence leave our imagination to embelish the abstract; sort of how a person generally looks more attractive from a distance! </cite>\n\nI would go for this. And further, I think the act of imagining is enjoyable. And also what mystery still left is enjoyable & pleasant too as long as it seem promising.\n\nI have a theory about letterpress ink which is that it may have less ( because it needs less) lacquer or other shiny binders. A smooth paper has less 'tooth' and is less spongy. Offset tends to use a smoother paper. A paper like that would shed ink morer easily and need more binder + plus we expect more technical perfection/performance from offest which would make you use more binder maybe. Binders will tend to shine, so the less binder, laquer/glue/whatever; the blacker the ink can look. The more matte the black the darker it can look. It could also be that the paper used in offset sucks more the binder deeper into the paper leaving a more matte result even when the same ink is used. What do you think?\n\nNice thread guys!\n\n"
    },
    {
      "time": "11 Mar 2007 — 3:45pm",
      "content": "Todays high-speed presses also require quicker drying inks. The chemical makeup of the dryer could also have an affect. I don't know which way though. You used to see gas dryers on older web presses even. This was fun to watch if the web quickly jammed and the paper right over the dryers burst into flame. That was a fun press check as I recall from 20 years or so back.\n\nChrisL\n\n"
    },
    {
      "time": "12 Mar 2007 — 9:50am",
      "content": "\\> It has more consistency and less distortion of the letters than  \n\\> in Caslon’s own 1766 sample book—no doubt because of superior  \n\\> inks and printing technology of time.\n\nI'm curious, what about consistency of letterform? When you say it was a \"revival\", do you mean just of printing with Caslon, or of the fonts themselves? I ask because Caslon's forms exhibit a lot of inconsistency (which doesn't necessarily bother me within a font, but definitely bothers me across sizes - unless it's something like Neuland, where I feel it's actually a plus).\n\n\\> I do not agree that a deep black indicates over-inking.\n\nI didn't say it was unavoidable or inherent. But when you printed letterpress yourself, did you manage to get that great black while maintaining letterform integrity? Unlikely, and not necessarily because you were -I'm presuming- just dabbling: it's very hard; even qualified people who want to do it (which is sadly rare) have trouble.\n\nMy point wasn't that it's not possible, it was that it's very rare. On average, in practice on the ground, offset tends to arrive at a better balance of blackness and letterform integrity; it's simply a lot harder to mess it up.\n\nSpeaking of which, you must have seen some offset printed with \"rich black\" (black that's made with some C, M and Y, not just K) on thick coated paper: it's pure lustre. Which is not to say I admire it.\n\n\\> ... as long as it seem promising.\n\nWith the elaboration that I guess it depends on whether you're a positivist or a cynic. When the crow gets the grapes instead of you, do you think \"damn it\", or do you think \"they were probably sour anyway\"? :-) You guys should hear all the variants on that Æsop fable that my brother and I once came up with!\n\n\\> we expect more technical perfection/performance from offest\n\nYes, and I think this extends beyond tangible things like binder; we expect letterpress to be imperfect in some ways, so we ignore that, or even turn it into something commendable.\n\nhhp\n\n"
    }
  ]
}
