{
  "id": "32120",
  "title": "Punchcut Needs a Design Intern!",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "Punchcut is looking for a Design Intern with strong interests in Interactive Design for a variety of experiences including next generation rich media for both Web-Based and Mobile User Interfaces. This opportunity will provide you with the crucial experience needed once the time comes to hit the pavement with your portfolio.\n\n//YOU:\n\n• Young design student or aficionado who is passionate about design and interactivity, and completely obsessive over the details. You probably enjoy discussions involving keyframes and anti-aliasing, and can typically be found staring at the letter spacing in that obscure, local rag. Favorite colors include, #FFCCFF, #99FF33, and R 67 G 59 B 255.\n\n• Proficient on Mac OSX and the following applications:  \n – Photoshop CS  \n – Illustrator CS  \n – InDesign CS (Not required)  \n – Fireworks (Not required)  \n – Flash (Not required)  \n – XBox 360 (Also not required, but useful)\n\n//PUNCHCUT:\n\n• Punchcut is a user interface design and development company that specializes in improving mobile UI experiences. With a solid understanding of the new contexts of mobile life, we design and develop next generation user interfaces that engage customers, streamline transactions and enhance mobile user experiences. Punchcut is also known for our passions in typography. In 2000, founding partner Jared Benson created Typophile, enabling students and novices to easily interact and communicate with the world’s greatest type design professionals. Today, Punchcut remains active in nurturing this community and is currently engaged in the design and development of our own typefaces optimized for mobile usage.\n\n• With a client list designed to impress, we will provide you with the necessary skills and experience to expand your portfolio and prepare you for a career in design.\n\nThe position is available immediately, with a duration of 3 to 6 months. If you are a student that is currently enrolled in school, we are willing to make adjustments in the timeline based on class schedules. Punchcut is located in San Francisco and prefers to hire someone locally. However, we are willing to consider applications from any location.\n\n//SUBMISSION REQUIREMENTS:\n\n• Please submit a resume and a letter of intent. Explain to us why you believe you are right for the position.\n\n• Portfolio containing 5-10 pieces that demonstrates a solid understanding of design, typography, color theory, attention to detail and most important, your personal design sensibilities.\n\n• Submission formats we will accept are: PDF, SWF or a provide a URL pointing to a site online. Please keep it under 10mb.\n\n• Send all submissions and inquiries via email to: [zara@punchcut.com](mailto:zara@punchcut.com)\n\nWe look forward to hearing from you and can’t wait to review your work! If you have any questions, please don’t hesitate to email us at the email address listed above. Thanks!\n\n",
  "author": "<a href=\"user/111\" title=\"View user profile.\">Zara Evens</a>",
  "time": "<br>",
  "uid": "111",
  "comments": [
    {
      "time": " 14 March, 2007 - 7:46am",
      "content": "Zara, would you mind posting this in the HOW Forums, or would you mind if I copied and pasted it there? There are some young folks there interested in type design.\n\n—Bruce\n\n"
    },
    {
      "time": " 14 March, 2007 - 10:52am",
      "content": "I would be happy to post this in the HOW forums, thanks for the tip Bruce.\n\nI do think I need to clarify that this position is not for designing type. We are looking for an Interactive Designer with interests in UI design for mobile and web-based environments.\n\nZ\n\n"
    },
    {
      "time": " 14 March, 2007 - 12:48pm",
      "content": "There would probably be even more interest from the HOW site in that case.\n\n"
    }
  ]
}
