{
  "id": "32128",
  "title": "Font Dax",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Help me please!!!, I need to get the dax font family for a job I have to do today!! The designer sent me in the file in Illustrator without creating outlines, and I don't have it, any ideas where I might get a copy of it online for free or anyone kind enough to email it to me, for PC, thanks.\n\n",
  "author": "peter dax",
  "time": "10 Mar 2007 — 4:13am",
  "uid": "17318",
  "comments": [
    {
      "time": "10 Mar 2007 — 4:23am",
      "content": "\\>The designer sent me in the file in Illustrator without creating outlines  \nCall him\n\nYou won't get free copies @ typophile, i'm sure.\n\n"
    },
    {
      "time": "10 Mar 2007 — 4:24am",
      "content": "cheers, any idea where i could??\n\n"
    },
    {
      "time": "10 Mar 2007 — 4:40am",
      "content": "[http://www.fontshop.com](http://web.archive.org/web/20120623043929/http:/www.fontshop.com/) -- I think you can download immediately after ordering.  \nFonts are software which must be licensed. Period.\n\nAlternatively, ask the designer to prepare a new Illustrator file with fonts converted to outlines.\n\n"
    },
    {
      "time": "10 Mar 2007 — 9:18am",
      "content": "I think people like to get paid for a job they have done today or any day. I assume you do not work for free. Ask your designer for a PDF to get the job printed or buy the font so the type designer can get paid too. You will then have the use of it for hundreds of jobs.\n\nChrisL\n\n"
    },
    {
      "time": "10 Mar 2007 — 9:27am",
      "content": "Seriously...are people really this stupid? Do you honestly think that a site that is obviously _designed this well and maintained_ is going to give you something for free? Hey, I work in a mine shaft...why don't I just give you that diamond I found there yesterday?\n\nMaybe someone can put a disclaimer on Typophile on the mainpage that says \"not for free fonts\" or something?\n\n"
    },
    {
      "time": "10 Mar 2007 — 10:03am",
      "content": "Maybe this will help you (it's set in Dax):\n\n ![](http://web.archive.org/web/20120623043929im_/http:/typophile.com/files/googleit_4136.gif)\n\nIf those are the letters you're looking for then you can just grab this gif…:)\n\npeace\n\n"
    },
    {
      "time": "10 Mar 2007 — 6:24pm",
      "content": "lol, this is actually quite funny. Asking such a question on this site.\n\n"
    },
    {
      "time": "11 Mar 2007 — 7:10am",
      "content": "Jelmar,  \nPerhapd this person also might walk in to a police station and ask where he can score some Crack. :-)\n\nChrisL\n\n"
    },
    {
      "time": "11 Mar 2007 — 9:27am",
      "content": "In LA that just might work… :)\n\nI like the story of the guy here who was going to court on drug charges and when he emptied his pockets at the security check in he dumped a crack pipe and some crack into the container for his keys and such. Brilliant!\n\npeace\n\n"
    },
    {
      "time": "11 Mar 2007 — 5:31pm",
      "content": "_...and ask where he can score some Crack._\n\nHaha, yes, exactly. Very good. :D\n\n"
    },
    {
      "time": "11 Mar 2007 — 8:43pm",
      "content": "Maybe just direct questions like this to the posting guidelines...\n\n[http://typophile.com/readme](http://web.archive.org/web/20120623043929/http:/typophile.com/readme \"http://typophile.com/readme\")\n\nwhich says...\n\nAbout Free Fonts:  \nIf you’re looking for free fonts, please see our article called FAQ: where to find “cool” free fonts. **Do not ask members to send you copies of retail fonts.** Such behavior is not looked upon kindly by those of us who make a living designing type or those of us who support the work of talented type designers. By the same token, please do not post links to sites with commercial fonts for download. If you do wish to report a site with this activity, please contact a moderator.\n\n"
    },
    {
      "time": "12 Mar 2007 — 2:25am",
      "content": "_The designer sent me in the file in Illustrator without creating outlines_\n\nThere's just no excuse for that kind of sloppiness in todays world; back in the day, the prepress people would make a phone call, send a bike and expect the missing font or a replacement .ai file by return – and they'd charge for the intervening time. Which rock has this 'designer' been living under for the last decade?\n\n"
    },
    {
      "time": "12 Mar 2007 — 10:48am",
      "content": "If anyone does google for it and does find a link please email me with that link so I can report them.\n\n"
    },
    {
      "time": "12 Mar 2007 — 12:11pm",
      "content": "As for posting guidelines about asking for free fonts: all those comments assume that the poster can/will read them. Most won't.\n\n"
    },
    {
      "time": "12 Mar 2007 — 12:55pm",
      "content": "True.\n\n"
    },
    {
      "time": "13 Mar 2007 — 5:55am",
      "content": "That's rich.\n\nIt brings up another question. What do we do with spammers? I found one the other day.\n\n"
    },
    {
      "time": "13 Mar 2007 — 6:03am",
      "content": "I often find spammers and report them to one of the Typophile SWAT team if they are online (Paul, Yves, Tiffany, or any of the Punchcut Power Rangers). Send them the thread link and the username of the Spamflammer. Paul Hunt is the deadliest Spam nixer. He can zap one quicker than you can say Ghostbusters.\n\nChrisL\n\n"
    },
    {
      "time": "13 Mar 2007 — 6:15am",
      "content": "Thanks Chris... That's good info to know!\n\n"
    },
    {
      "time": "25 Mar 2007 — 3:17pm",
      "content": "\\> _What do we do with spammers?_\n\nReport them to any of the people mentioned by Chris. We delete the account and all comments posted by that account disappear with it. That's why we never delete accounts from genuine people leaving us, because that would falsify a whole bunch of threads. And sometimes we just want the festering bile to stay on the board, just as a reminder. :^P\n\nBTW I can nix spammers just as quickly as Paul. Try me. Make - my - day! :^P ;^)\n\n"
    },
    {
      "time": "25 Mar 2007 — 4:43pm",
      "content": "OK Yves, git yur shootin' iron a ready fur the next varmit I catch a spammin' these here parts :-)\n\nChrisL\n\n"
    }
  ]
}
