{
  "id": "3213",
  "title": "Seybold SF, 2002",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Anybody attending Seybold SF this year?   \nIt's this week and [Expo tickets](http://web.archive.org/web/20131107164922/http:/www.seyboldseminars.com/sf2002/email/live_demos_EMC9.html) are free.\n\n",
  "author": "Joe Pemberton",
  "time": "9 Sep 2002 — 10:49am",
  "uid": "1160",
  "comments": [
    {
      "time": "12 Sep 2002 — 3:33pm",
      "content": "So I don't get it: if van Bronkhorst made himself a bestseller that has a mechanical oblique, plus the money is tight these days (especially in type design), why in hell are we making \"true\" italics? Is it some kind of coping mechanism or something?   \n   \nhhp\n\n"
    },
    {
      "time": "12 Sep 2002 — 1:25pm",
      "content": "Things were lighter this year than last. Chalk it up to   \ntrimmed marketing budgets or perhaps people's   \nhesitancy to travel on the anniversary of 11 Sept.   \n   \nSome highlights.   \n   \n **[STEP](http://web.archive.org/web/20131107164922/http:/www.dgusa.com/)**   \nGot a free copy of their September/October issue. A   \ngreat magazine. They've moved away from their former   \ndumbed-down, plug-in tips and software tricks into a   \nmuch more intelligent read. There's also a good piece   \non [Mark van Bronkhorst's](http://web.archive.org/web/20131107164922/http:/www.mvbfonts.com/) [ITC Conduit](http://web.archive.org/web/20131107164922/http:/www.fontshop.com/shop/view_main.cfm?fuseaction=listitems&searchby=package&searchterm=&searchfor=&searchletter=A&view=package&id=C.100316.0.0&designerid=0).   \n   \n **[Quark](http://web.archive.org/web/20131107164922/http:/www.quark.com/)**   \nQuark was there, sort of. If you count one guy   \noccupying a bar stool and laptop stand. \"We don't do   \ntrade shows\" was the rep's explanation of Quark's new   \npolicy.   \n   \nAsking about the upcoming Quark release, he said I'd   \nbe blown away by all the nifty features coming in Quark   \n6, due Q1, 2003. He quickly added that he'd have to kill   \nme if he told me all of them. I think he was bluffing.   \nRegarding OpenType support for the new version: of   \ncourse. But don't look for full access to all OT features   \nuntil 7.0. Where does that put us, 2006?   \n   \nHow could I not feel bad for this guy? He's representing   \nthe market leader in layout software, sitting in the   \nshadow of the buzzing Adobe pavillion across the aisle.   \nWhat these guys need is a serious cash infusion (for   \nproduct development and marketing).   \n   \n **[Font Reserve](http://web.archive.org/web/20131107164922/http:/www.fontreserve.com/)**   \nThis app looks much cooler than I expected. I've never   \ntried it, but I'm downloading the [free trial](http://web.archive.org/web/20131107164922/http:/www.fontreserve.com/products/trial_mac.html) as I write this.   \nThere are the usual features, like creating sets and   \ncreating type sample books--stuff you could print for   \nreference. But there are some handy features I wasn't   \nfamiliar with, like searching or sorting fonts by genre   \nand foundry.   \n   \nWhat I really miss (now that I'm using OS X) is the ATM   \nDeluxe feature that auto-activates fonts from the   \nbackground, even if ATM itself is not open, and   \nregardless of whether you have a set 'active.' That's   \ntechnology you can use.\n\n"
    },
    {
      "time": "9 Sep 2002 — 10:39pm",
      "content": "Too darn busy getting ready for ATypI to go up the peninsula to SF! Gotta get my talks ready....\n\n"
    }
  ]
}
