{
  "id": "32130",
  "title": "Coeliakie",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "No accents, numbers, uppercase characters or symbols as of yet, but I'm very pleased with it and anxious for some critique.\n\n| Attachment | Size |\n| --- | --- |\n| [Coeliakie.gif](http://web.archive.org/web/20150416144906/http:/typophile.com/files/Coeliakie.gif) | 6.89 KB |\n\n",
  "author": "ill sans",
  "time": "10 Mar 2007 — 8:16am",
  "uid": "13099",
  "comments": [
    {
      "time": "15 Mar 2007 — 8:37am",
      "content": "Your lc o's look like a's\n\n\"the quick brawn fax jumps over the lazy dag\"\n\n"
    },
    {
      "time": "20 Mar 2007 — 7:29am",
      "content": "Yes, the 'o' is indeed practically the same as the 'a'.  \nThe connector of the 'o' should probably be on the top?\n\n"
    },
    {
      "time": "23 Mar 2007 — 2:55am",
      "content": "I've thought about putting the connector on top, but I think I'll try to make it a little more distinguishable by maybe making the o a little rounder (I kind of like how it resembles that \"handwriting on a ruler\" thing). I haven't worked on it for a while now, but I'll keep your comments in mind when I get back to it. Thanks!\n\n"
    },
    {
      "time": "23 Mar 2007 — 4:18pm",
      "content": "i think the lower case \"o\" is fine, the lower case \"j\" is my personal problem. i feel that it should take the first part of the lower case \"z\" so that it's not so clustered and tight at that one point, if that makes sense? otherwise i really like it - very vintage thunderbird badass but cute.\n\n"
    },
    {
      "time": "24 Mar 2007 — 3:57am",
      "content": "I'm afraid that will start looking funny when it follows an i (which is a very common combination in Dutch, my mother tongue), but it's worth a shot. I did shorten the x shortly after I posted the font here, but until now nobody mentioned it might be too wide in this example, but maybe that's because it's at the end of the word?  \nI have already made a few numbers & symbols, but I can't seem to make a nice ampersand that fits the style properly. I might work on it some more this weekend & post the results.\n\n"
    },
    {
      "time": "18 Jul 2007 — 8:41am",
      "content": "I think the last stroke on the W has too much, um, flair.\n\n"
    },
    {
      "time": "18 Jul 2007 — 12:35pm",
      "content": "Actually, this one's been put on the shelf for a while... I've been working on a lot of other stuff lately, but I'm unable to post anything since Typophile upgraded (that's what you get for still working with OS 9.1 in this century ;-p ). I'm collecting everything on a USB-stick & as soon as I get the chance I'll post my new things here on Typophile. Maybe by then, I'll have picked up on this one as well. If so, I'll make sure to keep your comments in mind.  \nI still need to post some new progress of my work in 2 different threads & I've been busy with quite a big project lately which I'm very pleased with & to which I have gotten great responses from friends & family, so I'm very anxious to hear what you guys think about it. I still need to get some \"paperwork\" done concearning a copyright issue as well, but that's a whole different thread again. I'm really starting to slack on some projects, but there are just not enough hours in a day for me ;-) And I propably lose interest in things to quickly when they're replaced with new ideas. I have an enormous amount of \"half starts\" & \"sketched ideas\" & a lot of them will probably never get executed. Does this sound familiar to anyone?\n\n"
    },
    {
      "time": "18 Jul 2007 — 4:19pm",
      "content": "\\> _I have an enormous amount of “half starts” & “sketched ideas” & a lot of them will probably never get executed. Does this sound familiar to anyone?_\n\nYes, very familiar. I have lots of those on my hard drives as well, and in sketchbooks. :)\n\n"
    },
    {
      "time": "19 Jul 2007 — 3:53am",
      "content": "Another thing that's very common in my work is that I have about 30 variations (usually tiny details & colour variations) of every single drawing & usually paste the final one in a new document still saving the \"sketches\" in case I should change my mind or want to alter a few things without having to do the whole thing over again.\n\n"
    },
    {
      "time": "7 Aug 2007 — 10:04pm",
      "content": "If you pull the connection through the o ( see cursive copperplate scripts) I bet that will help.\n\n"
    }
  ]
}
