{
  "id": "32140",
  "title": "Font-InDesign",
  "forum": "Design",
  "tags": [

  ],
  "content": "Learning InDesign. We are supposed to pick a font to study. I narrowed it down to 3 Caslon, Baskerville, Bodoni. I was looking at Gordy because I wanted a 1930s type and earlier Jenson and Rockwell. What’s a good one that’s used but not heavily used?\n\n [‹ Logo Font Help](http://web.archive.org/web/20081204120041/http:/www.typophile.com/node/32157 \"Go to previous forum topic\") [please help!...type topics ›](http://web.archive.org/web/20081204120041/http:/www.typophile.com/node/32137 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20081204120041/http://www.typophile.com/user/15181\" title=\"View user profile.\">zzi</a>",
  "time": "<br>",
  "uid": "15181",
  "comments": [
    {
      "time": " 10.Mar.2007 6.35pm",
      "content": "To study what about the font ?  \nWhy InDesign ?  \n“Appropriate (was ’good’) fonts” are tools designed/used for their function (write words) and art is included.\n\n"
    },
    {
      "time": " 10.Mar.2007 6.43pm",
      "content": "Pick a font. Make a Poster in **InDesign.**  \nWhy InDesign? Because it’s not a class in Illustrator or Quark. I’m sure the instructor assigns the same project in the other software classes. I wanted a font that wasn’t heavily used and looked nice.\n\n"
    },
    {
      "time": " 11.Mar.2007 1.11am",
      "content": "What’s the subject of the poster, or does that stem from the font choice?\n\nSurely the choice is part of the assignment, what caused you to narrow down to those three? Heavily used is a nebulous term, but of those three I would guess that Caslon is the least used.\n\nTim\n\n"
    },
    {
      "time": " 11.Mar.2007 1.15am",
      "content": "Dear Bob Cummings, it seems you are cool with the info you have.  \nThe things that students need to do are not necessarily [user friendly](http://web.archive.org/web/20081204120041/http:/homes.ieu.edu.tr/~asegalini/0607/dtp-workshop4.pdf), they require work and should present a challenge.\n\n"
    },
    {
      "time": " 11.Mar.2007 3.24am",
      "content": "Fine reply Alessandro.\n\nBob what level are you studying at? This assignment is the same as one set for my (pre-graduate) certificate students from about 2 years back; we changed the assignment because making posters in InDesign doesn’t necessarily allow for people to learn about multipage document layout.\n\nAs I recall, the subject matter for the poster _is_ the typeface; so if I was the instructor, I’d be expecting to see the name of the typeface, its (approximate) date of release/manufacture, the full name and biographical dates of the type designer, a complete character set and a brief paragraph explaining the types place in history. Easy.\n\nOut of the six typefaces Bob mentions, I’d say they’re all pretty heavily used, but either good or beautiful in their own way... my own experience suggests that of the six, Rockwell might be the least widely used. (Advertisement!) having said that, I think there is more available information on the [Caslon](http://web.archive.org/web/20081204120041/http:/www.100types.com/100types.com.12caslon.html), [Bodoni](http://web.archive.org/web/20081204120041/http:/www.100types.com/100types.com.24bodoni.html) and [Baskerville](http://web.archive.org/web/20081204120041/http:/www.100types.com/100types.com.29baskerville.html).\n\n"
    },
    {
      "time": " 11.Mar.2007 4.49pm",
      "content": "Thank you. I have the subject matter down. I just wanted to pick a typeface that was interesting to me and commercial enough not to drive off the hordes. Just by making a list (there were more than six) and whittling it down made the project a success for me. Thanks again and don’t worry I won’t pick [Helvetica](http://web.archive.org/web/20081204120041/http:/typographi.com/001071.php) or Gil Sans.\n\n"
    }
  ]
}
