{
  "id": "32141",
  "title": "font suggestions for production company logo?",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi there,\n\nI've been tasked with finding a new typeface to use in this company logo; for better or worse the client has decided to go with the red, halftone drop shadow version, and I'm worried about the legibility of the current text, particularly at small sizes.\n\nIt's for a local production company, the rest of their branding has a pop-art/Lichtenstein-esque kind of theme. This logo will be reproduced at a number of sizes, the smallest probably being on their business card, and it will also be reproduced on screen in a motion graphics context -- so needs to scale reasonably well for TV.\n\nAnyone have any suggestions for a font (or a better way of resolving the white/black layering)?\n\n(edit - for some reason can't get Insert Image to work, so jpg is attached)\n\n| Attachment | Size |\n| --- | --- |\n| [superduper.jpg](http://web.archive.org/web/20101204134952/http:/typophile.com/files/superduper.jpg) | 510.22 KB |\n\n",
  "author": "<a href=\"/web/20101204134952/http://www.typophile.com/user/17135\" title=\"View user profile.\">superhiro</a>",
  "time": "<br>",
  "uid": "17135",
  "comments": [
    {
      "time": "",
      "content": "Use the red version wherever it can be reproduced accurately, then use an extremely simplified version (i.e. no drop shadows, highlights, etc.) wherever the other one would lose those details.\n\nAs for typeface, I'd suggest hand-lettering at a small size, using comic books as a reference, then scanning and tracing as a vector.\n\n- Lex\n\nP.S. If you didn't want the client to go with the halftoned version, why did you show it to them? :-P\n\n"
    },
    {
      "time": "",
      "content": "Thanks for the advice, I'll give it a go and post what I come up with.\n\nRE: your P.S. -- live and learn! I'm a final year design student just starting out doing my own freelance jobs on the side.\n\n"
    },
    {
      "time": "",
      "content": "Also, there are some soilid comic faces here:\n\n[http://www.comicbookfonts.com/](http://web.archive.org/web/20101204134952/http:/www.comicbookfonts.com/ \"http://www.comicbookfonts.com/\")  \n [http://www.blambot.com/](http://web.archive.org/web/20101204134952/http:/www.blambot.com/ \"http://www.blambot.com/\")\n\n"
    },
    {
      "time": "",
      "content": "Is it possible to use two lines for the name at small sizes?  \nSUPER  \nDUPER  \nPTY LTD\n\nEven in the one line version it might make it easier to read if the D had as much differentiation as the S.\n\nI would also make the stroke go to a point at the mouth end of the speech bubble.\n\nTim\n\n"
    }
  ]
}
