{
  "id": "32164",
  "title": "A Signage encoding initiative?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I wonder if we don’t have Unicode-points for symbols, such as most frequently occuring PUBLIC ORIENTATION SIGNS. Last year I forwarded an initial proposal to get some 80 signs in the UCS, yet this takes ages to get along – to what end, nobody knows. (The proposal is downloadable at [http://www.signographie.de/cms/standard.htm](http://web.archive.org/web/20090809180308/http:/www.signographie.de/cms/standard.htm \"http://www.signographie.de/cms/standard.htm\") .) – – I think that public signage becomes a kind of “world script” steadily and therefore should be encoded. Both font producers and users alike would benefit from this. The usage of standard-based symbol fonts would be more stable, safer and faster. – – However, as long as the official encoding seems hardly to be achieved I should suggest a workaround: let’s capture the PRIVAT USE AREA and collaborate towards an agreement upon which codepoint should host which sign. A kind of semi-standard might arise by this, if we than offer fonts on grounds of a synchronized encoding. – – Who is working on symbols/fonts and may be willing to contribute to an INITIATIVE to encode public orientation signs? – – suggestions welcome, contributions most welcome! A:S\n\n| Attachment | Size |\n| --- | --- |\n| [Publix.jpg](http://web.archive.org/web/20090809180308/http:/typophile.com/files/Publix.jpg) | 159.1 KB |\n\n",
  "author": "<a href=\"/web/20090809180308/http://typophile.com/user/17347\" title=\"View user profile.\">Andreas Stötzner</a>",
  "time": "<br>",
  "uid": "17347",
  "comments": [
    {
      "time": " 12.Mar.2007 9.26am",
      "content": "Sorry, but none of the serious players (MS, Adobe, Apple, IBM, Linux, John Hudson etc.,) are going to come within ten miles of a PUA “land-grab” like this, especially considering the grief they’ve been given for their PUA actions in the past. I think efforts would be better directed to a universal symbol description language that might use glyph names or a new OpenType table to define the design of each symbol, then the actual symbols could live anywhere in the PUA.\n\n"
    },
    {
      "time": " 12.Mar.2007 10.48am",
      "content": "I’m afraid Si’s right about this one.\n\nI like the idea of an OT table to manage the design. This would allow each design to be composed of a single glyph, or multiple glyphs, and allow for re-use of componeents. That would allow fonts to be desinged for printing small, for printing large, for vinyl sign machines, etc, where the ideal solutions might vary.\n\n"
    }
  ]
}
