{
  "id": "32177",
  "title": "Whitfield Publications LLC",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "Hi all\n\nThis is already an aproved logo, because the client turns out to be extremely accepting and approved this version after the first round. My question is : what do you like (or not ) and which version you prefer.\n\nThank you very much.\n\n| Attachment | Size |\n| --- | --- |\n| [whitfield.gif](http://web.archive.org/web/20071116153018/http:/typophile.com/files/whitfield.gif) | 11.1 KB |\n\n [‹ Meinert Corporation](http://web.archive.org/web/20071116153018/http:/www.typophile.com/node/32178 \"Go to previous forum topic\") [Avari - critique, please ›](http://web.archive.org/web/20071116153018/http:/www.typophile.com/node/31601 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071116153018/http://www.typophile.com/user/17354\" title=\"View user profile.\">neogrey</a>",
  "time": "<br>",
  "uid": "17354",
  "comments": [
    {
      "time": " 12.Mar.2007 12.27pm",
      "content": "In my opinion the top version gives me the impression of children’s schoolbook material. I could see this on Scholastics mailers and the such. I’m not sure what Whitfield publishes mostly.\n\nThe second has a more modern feel, but only slightly. I’d reduce the size of PUBLICATIONS slightly to have a reverse pyramid feel and should give better balance to the twin books. The spacing is fine. The books don’t look centered (visually you might have to move them to the right more.) Is that Bliss Pro? What’s the serif?\n\n"
    },
    {
      "time": " 12.Mar.2007 12.48pm",
      "content": "Yes....sometimes someone should point a finger, so I can clearly see the weak sides of my works. All your suggestions are great and I will surely follow them. Thank you.\n\nYes, that’s Bliss. The serif is **[StormType Hercules](http://web.archive.org/web/20071116153018/http:/www.myfonts.com/fonts/storm/hercules/)**\n\n"
    },
    {
      "time": " 12.Mar.2007 12.53pm",
      "content": "suggestions followed:\n\n ![](http://web.archive.org/web/20071116153018im_/http:/www.typophile.com/files/whitfield_3659.gif)\n\n"
    },
    {
      "time": " 12.Mar.2007 1.00pm",
      "content": "Hercules, what a whippy serif, very elegant, but not overly garish.\n\n<cite>Yes….sometimes someone should point a finger, so I can clearly see the weak sides of my works. </cite>\n\nGlad I could help. I know it’s easy to miss the little things and a fresh pair of eyes usually helps.\n\n"
    },
    {
      "time": " 12.Mar.2007 2.03pm",
      "content": "Whitfield is not centered, if i take the books-icon as an orientation.  \nSecond, can you show an example without the fi-ligature.  \nAnd you need a different logo for small sizes.\n\nFirst i thought, why two books and not one or three of them. After some passing time, i’m quite ok with the two – hehe :)\n\n"
    },
    {
      "time": " 12.Mar.2007 3.09pm",
      "content": "The two books make the “W” with the covers... right? And the pages make a field of grasses-like looking icon? (Or at least, that’s what I see) I like it.\n\n“Publications” is a heck of a long word, and looks good smaller & tucked like in your third post. Concur with Asvetic!\n\n"
    },
    {
      "time": " 12.Mar.2007 3.31pm",
      "content": "Yes, the two books covers should resemble the “W”? As for the “Field of grasses-like looking icon” - do you think that book covers are enough as a metaphor for a book? I tried that, but it wasn’t convincing, at least to me. As for the ligature - I actually never had the chance to do a lettering logo with ligatures and I have been tempted by this one. Maybe I should also try a non-ligature version, although I doubt that the client will notice the difference.\n\nSheesh, it’s already 01:00 AM in here...more to come in the morning.\n\n"
    },
    {
      "time": " 12.Mar.2007 6.35pm",
      "content": "Maybe a version where the “pages” are implied, the “W” of the 2 books is lost a little with the overactive look of the “pages”. Maybe show a few pages, or maybe just 2 lines best described as the “bird on the horizon” like in this illustration:\n\n ![](http://web.archive.org/web/20071116153018im_/http:/www.typophile.com/files/ist2_548832_tropical_sunset_4974.jpg)\n\n"
    }
  ]
}
