{
  "id": "32176",
  "title": "Is Avenir an appropriate typeface for wayshowing signage?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "A question.  \nIs Avenir an appropriate typeface for wayshowing signage?\n\nMy feeling is due to its open and organic letter shapes, long ascenders and descenders, a more contained and regular typeface would be better suited. If I could recommend a font for signage, it would be the likes of Univers, Frutiger, Meta, even Argo.\n\nAm I wrong?\n\n[http://en.wikipedia.org/wiki/Image:AvenirSP.png](http://web.archive.org/web/20120121081532/http:/en.wikipedia.org/wiki/Image:AvenirSP.png \"http://en.wikipedia.org/wiki/Image:AvenirSP.png\")\n\n",
  "author": "<a href=\"/web/20120121081532/http://typophile.com/user/1636\" title=\"View user profile.\">Jem</a>",
  "time": "<br>",
  "uid": "1636",
  "comments": [
    {
      "time": "",
      "content": "I think that Avenir could be used well, but it's not ideal. The best typefaces for this purpose have big apertures, low contrast, and easily distinguishable letterforms. Frutiger and Meta, as you mentioned, would work well, but Univers is not ideal, owing to its tighter letterforms. This is the thinking behind [the new Clearview Highway typeface](http://web.archive.org/web/20120121081532/http:/www.clearviewhwy.com/).\n\n"
    },
    {
      "time": "",
      "content": "I would recommend [Arrival](http://web.archive.org/web/20120121081532/http:/www.vllg.com/TypeInitiative/Arrival/Example+About/)\n\n"
    },
    {
      "time": "",
      "content": "Thank you Auricfuzz.\n\nWhen you say 'big apertures' do you mean more open, less enclosed.  \nOr just a larger negative space?\n\n"
    },
    {
      "time": "",
      "content": "For me, aperture means the opening between the counter and the outside of the letter, such as the 'a', 'e', 'c', 's'. Unless there's a better word for that. This crucial piece never seems to be on any of the typeface anatomy diagrams.\n\nNotice how Arrival is generally more open thanks to this wide aperture, especially in the 'e' and 's'.\n\n ![](http://web.archive.org/web/20120121081532im_/http:/typophile.com/files/get_Font_Image_3921.png)\n  \nAvenir\n\n ![](http://web.archive.org/web/20120121081532im_/http:/typophile.com/files/41f1ba8923341fed09cf23bb375245b0_3760.png)\n  \nArrival\n\nBesides those you mentioned, another good example is [Versa Sans](http://web.archive.org/web/20120121081532/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=Versa%20Sans):\n\n ![](http://web.archive.org/web/20120121081532im_/http:/typophile.com/files/get_Font_Image-1_3537.png)\n\n"
    },
    {
      "time": "",
      "content": "Very informative--thank you!\n\n"
    },
    {
      "time": "",
      "content": "Also made especially for signage: [FF Info](http://web.archive.org/web/20120121081532/http:/typophile.com/wiki/FF%20Info) and [FF Transit](http://web.archive.org/web/20120121081532/http:/typophile.com/wiki/FF%20Transit)\n\n"
    },
    {
      "time": "",
      "content": "Don't forget [ClearviewADA](http://web.archive.org/web/20120121081532/http:/www.terminaldesign.com/fonts/set/?ID=88) which was designed to conform with the typeface guidelines specified in the Americans with Disabilities Act legislation.\n\n"
    },
    {
      "time": "",
      "content": "Yes very informative, thank you all.\n\nAnother typeface mentioned earlier, Gerard Ungers's Argo. Not specifically designed for wayshowing, though I think would work well when a slightly more expressive font is desired.  \n(eg. Shopping centre signage vs. Road signs - which ideally should be more neutral)\n\n ![](http://web.archive.org/web/20120121081532im_/http:/typophile.com/files/Argo_5562.gif)\n\n"
    },
    {
      "time": "",
      "content": "[Tiresias](http://web.archive.org/web/20120121081532/http:/www.myfonts.com/fonts/bitstream/tiresias/) was developed especially for persons with visual impairments (although not totally blind).\n\n"
    },
    {
      "time": "",
      "content": "More questions.\n\nSo an open aperture (counter) increases legibility by reducing stroke convergence?  \nI can understand this being an important consideration for illuminated signs, but is it still a factor for standard signage?\n\nDoes stroke convergence cause the individual letters to be less distinguishable at a glance, or from a distance?\n\n"
    },
    {
      "time": "",
      "content": "Interestingly Mr Unger states on his website that Argo:  \n\"is pronounced and contrasty. As a result, it is not used for applications like wayfinding (where neutrality is apparently a virtue), being seen instead mainly in house styles, periodicals and newspapers.\"\n\nThough I do think he is being slightly sarcastic, as his Capitolium is certainly not 'neutral'  \n [http://www.gerardunger.com/allmytypedesigns/allmytypedesigns16.html](http://web.archive.org/web/20120121081532/http:/www.gerardunger.com/allmytypedesigns/allmytypedesigns16.html \"http://www.gerardunger.com/allmytypedesigns/allmytypedesigns16.html\")\n\n"
    },
    {
      "time": "",
      "content": "A small aperture (as in Helvetica) can cause e's and c's to look like o's. Generally, it's more familiar and thus easier to read type with a wide aperture. It all goes toward making each letterform as easily distinguishable from a distance as possible, although ultimately most type should be okay enough for typical signage.\n\nEDIT: Carl, you're right; it's not typical of me to surrender so easily when it comes to type. I was just trying to assure Jem that most of the typefaces mentioned in this thread should work well; there's no single incredibly legible type.\n\n"
    },
    {
      "time": "",
      "content": "\"most type should be okay enough for typical signage.\"\n\nI'm doing a signage system in Swank for an airport! ;)\n\nI think Unger is probably pointing out how conservative most people are in choosing these things. It has to look like other airports, it has to not be too interesting, it has to be \"neutral\" etc. The typical committee attitude. In spite of this, I think one of the best (meaning clearest, most differentiated, strongest) suggestions so far is Versa Sans. But try to find anyone in the US who would dare use such a wild and unruly face for wayfinding. That's crazy talk! ;)\n\n[Here's more about Tiresias.](http://web.archive.org/web/20120121081532/http:/screenfont.ca/fonts/today/Tiresias/)\n\n"
    },
    {
      "time": "",
      "content": "IIRC Gerard Unger stated in a lecture, in regards to Capitolium, that it can work as a wayfinding font in Rome because it was to be used, largely, in the tourist areas where all you can do is walk, or at best, ride your Vespa slowly. (Wish I could find my notes.)\n\n"
    },
    {
      "time": "",
      "content": "_Here’s more about Tiresias._\n\nYes, I've seen this before, Carl: what concerns me is that it doesn't seem to do anything other than scream a lot without much substantive comment. In fact, I used one of the versions to test my subjects wrt to signage (as opposed to just screen fonts), and the overwhelming majority thought it was a great improvement: they don't cite my work as being pro-Tiresias.\n\nI notice they didn't bother looking very far for citations to support their own position either: that lack of academic rigour on both fronts doesn't encourage them to be taken seriously from either side.\n\nGranted, the existing signage I used was acknowledged as not being sufficient, and the client was looking for something \"better\" -- they ended up using a mix of Minion and Myriad, which was an improvement, mainly because they didn't want to spend \\*any\\* money on something new.\n\n(And gee, that rant reminds me far too much of [_Design Observer_](http://web.archive.org/web/20120121081532/http:/www.designobserver.com/) lately....)\n\n"
    },
    {
      "time": "",
      "content": "_Edit: repeating Linda’s comment_\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Tiresias was designed by a vision researcher, not by a type designer. No type designers were involved in declaring it the perfect font to \"improve legibility for all\". For starters, the way captioning is done requires more than one style; Tiresias doesn't even have an Italic. Here's my favorite quote from John Gill:\n\n“Within the time available, thorough testing to determine the optimal design of the typeface was not possible. However[,] limited testing was done with patients in a low-vision clinic to identify the features of a typeface which they found helpful.”\n\nAccessibility issues are different for people with low or impaired vision (John Gill's main concern), and for people with normal or average vision who are deaf, and who require captioning to access media content. Those issues were ignored in the Tiresias research, such as it was. And we're talking about type for wayfinding, which is yet a different challenge. Tiresias has a few merits for those with low vision, but it's far from ideal for general wayfinding.\n\n"
    },
    {
      "time": "",
      "content": "_Accessibility issues are different for people with low or impaired vision (John Gill’s main concern), and for people with normal or average vision who are deaf, and who require captioning to access media content. Those issues were ignored in the Tiresias research, such as it was. And we’re talking about type for wayfinding, which is yet a different challenge._\n\nWhile Dr. Gill and his team may not have done that work, others have -- I'm one of them -- and I know for a fact that my work has been referenced by others.\n\nAt the risk of pointing out the obvious, why is our subsequent work being ignored here? And why is there no supporting evidence -- that's real facts in peer-reviewed academic literature, not specious, unsupported, and blanket statements like \"it wasn't done by a type designer\" -- being presented?\n\nJust curious....\n\n"
    },
    {
      "time": "",
      "content": "Where can we read about your subsequent work, Linda? I'm fixating on Tiresias because you brought it up. It's not specious or uninformed to say John Gill isn't a type designer; he isn't.\n\n"
    },
    {
      "time": "",
      "content": "Carl, all I'm asking for is some concrete, academic proof about the flaws of Tiresias -- is this the only defence you can offer? Put something up or move on....\n\n(And if you've got access to all the wonderful academic databases, you can look up articles that cite my thesis yourself.)\n\n"
    },
    {
      "time": "",
      "content": "For what it's worth… I think that wayfinding type choices are way too conservative. Any font with enough contrast should do the trick, IF it's applied with finesse.\n\nEg imagine my wonder when I met FF Scala Sans as main font for the signage along Chicago's waterfront. It was just wonderful, because the design was done really well.\n\nBTW: I had a look at Tiresias and I think it's main feature is blandness — as if it has been designed by a committee.\n\n"
    },
    {
      "time": "",
      "content": "\\>\"For what it’s worth… I think that wayfinding type choices are way too conservative. Any font with enough contrast should do the trick, IF it’s applied with finesse.\"\n\nWhy choose any old font, when you can choose one that best serves it's function?\n\n"
    },
    {
      "time": "",
      "content": "\\>Tiresias was designed by a vision researcher, not by a type designer.  \nEven Joe Clark allows that it was designed by a _team_ led by Dr Gill  \n [http://www.laker-sharville.com/lettering.html](http://web.archive.org/web/20120121081532/http:/www.laker-sharville.com/lettering.html \"http://www.laker-sharville.com/lettering.html\")\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "\\>choose one that best serves it’s function?\n\nThat's an excellent idea. However, roads, captioning on TV screens, and signage in buildings seem to me significantly different.\n\nClearview is so far as I know the only font demonstrated to be superior to existing US signage. As I remember you can read it 2 seconds sooner at 60 mph, compared to the existing standard.\n\nWayfinding within a building would seem to me to have much more latitude as far as the issue of legibility. There I would think aesthetics become much more important--enhancing the mood and spirit of the organization or purpose of the building. Outdoor signage for pedestrians would seem to me to be somewhere in between...\n\n"
    },
    {
      "time": "",
      "content": "Agreed William, and sorry to Jem for the derailment, what is the use for the wayfinding system or is it a general query? Another thought  \n [http://www.stormtype.com/typefaces-fonts-shop/families-15-etelka](http://web.archive.org/web/20120121081532/http:/www.stormtype.com/typefaces-fonts-shop/families-15-etelka \"http://www.stormtype.com/typefaces-fonts-shop/families-15-etelka\")\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "_Wayfinding within a building would seem to me to have much more latitude as far as the issue of legibility. There I would think aesthetics become much more important—enhancing the mood and spirit of the organization or purpose of the building._\n\nWell, in the sense that it doesn't have to be read and comprehended while consistently travelling at high speed, you're correct. That being said, architects and designers (type and interior) also need to take into account emergency situations, where it's absolutely necessary that the right information be communicated to all the people as quickly as possible. In these crazy days of litigation, that's becoming very much a front-of-mind issue.\n\n(And I doubt that anyone needs to be told that \"design\" is suffering in the process.)\n\nIt's a very fine line to walk -- what might be an acceptable sign in a well-lit area with few people is likely utterly useless when there's a power outage and a panicked crowd.\n\n"
    },
    {
      "time": "",
      "content": "Perhaps implementation of signage is the most overlooked aspect. Typeface is talked about and reviewed because it is involved in the whole process. It is rare that much real anylitical thought goes into the wording and placement of individual signs. An example is the Washington Metro developed in the mid 70s. Yes, the type is your basic Helvetica vinyls sign letters but that is another story. The sadder part is the number of handwritten signs placed by local Metro staff or frustrated passengers in order to rectify the poor implementation of the designed signage. Things magic markered on paper that say \"This way to Virginia\" or \"Airport this way\" indicate that after 30 years, the signage still does not do the job.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "I've seen way worse signage than in Metro though, Chris, OTOH just finding one's way anywhere in DC is a huge challenge at best. Heck, for the first four years I lived there, I went nowhere without my ADC pocket atlas of inside the beltway, and heaven help me if I was going elsewhere.\n\nOne would think, for all the tourist traffic that The Mall gets, that wayfinding would be a snap, but it's anything but.\n\n"
    },
    {
      "time": "",
      "content": "The panhandlers make a fortune on the Mall \"giving\" tourists directions and maps which they stole from the Smithsonian free box.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\>choose one that best serves it’s function?  \n\\>That’s an excellent idea. However, roads, captioning on TV screens, and signage in buildings seem to me significantly different.\n\nTotally agree, that is what I was inferring. Every sign has its own set of functional requirements, the first being; to be seen, read and undersood.\n\n"
    },
    {
      "time": "",
      "content": "_every sign has its own set of functional requirements._\n\nWell, there is an awful lot of overlap. ;-) Signage for public building A will have pretty similar requirements for public building B, no matter their size, location, or function (i.e., large bank in a major urban area vs. country grocery store vs. isolated nature retreat).\n\nIt's the implementation that differs....\n\n"
    },
    {
      "time": "",
      "content": "Not the most legible typeface from a distance, though still an interesting mix of branding requirements and wayshowing requirements.\n\n ![](http://web.archive.org/web/20120121081532im_/http:/typophile.com/files/250px-Mickey_ears_on_sign_6528.jpg)\n\n"
    },
    {
      "time": "",
      "content": "The blue and white is one of the better combinations that you can use, however, and that contributes a lot to the visibility. Compare that with \"Next Left,\" for example.\n\nWhich is why blanket statements like \"Font A is better than Font B for signage/wayfinding\" are pretty useless -- when you mix in size, colour combinations, lighting, and a swack of other factors, lots of fonts can fill the bill.\n\n"
    },
    {
      "time": "",
      "content": "Imagine that orange on red at night! It is bad enough during daylight.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "A common mistake made by wayfinding designers is to evaluate their typographic decisions solely on their computer screen or maybe in a letter or tab sized printout. Rarely do they make full scale mock-ups and evaluate them in situ. This leads to many wayfinding legends that are too tightly letterspaced for their intended purpose.\n\n"
    },
    {
      "time": "",
      "content": "Absolutely.\n\nUnfortunately, a common mistake made by designers is that anyone who does a sign thinks they are an \"expert\" at wayfinding -- the overwhelming amount of bad signage and wayfinding choices is ample proof that it's both a science and an art.\n\n"
    },
    {
      "time": "",
      "content": "Yes, but my original post was about type choice.\n\nColors aside, the font shown on the Disney sign (anyone?) is not as legible from a distance as a font with open apertures. Sure the most legible font in the world is not going to be readable if there is not enough contrast between the letters and the background, or if the size is too small, that is a given.\n\n"
    },
    {
      "time": "",
      "content": "\\> Unfortunately, a common mistake made by designers is that anyone who does a sign thinks they are an “expert” at wayfinding — the overwhelming amount of bad signage and wayfinding choices is ample proof that it’s both a science and an art.\n\nThere are many excellent signage systems (by designers) as well:\n\n ![](http://web.archive.org/web/20120121081532im_/http:/typophile.com/files/charles_de_gaulle_d15573i55_4371.jpg)\n\n ![](http://web.archive.org/web/20120121081532im_/http:/typophile.com/files/BVG_leitsystem_r_3890.jpg)\n\n ![](http://web.archive.org/web/20120121081532im_/http:/typophile.com/files/keio1_4919.jpg)\n\n"
    },
    {
      "time": "",
      "content": "_There are many excellent signage systems (by designers) as well_\n\nThere are, in fact, very few, and the fact that you've posted the three best is evidence of that.\n\n"
    },
    {
      "time": "",
      "content": "Disney – Univers(?) or do they have a similar corporate sans?\n\nSurely the leading (set solid?) is way too tight to be effective, especially compared with the word space, but the arrow is totally useless up in the ear and why bother with a stem that fine.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "No Linda, the reason I have only posted three is they are examples only,  \nI don't really have the time to try and convice you otherwise.\n\n"
    },
    {
      "time": "",
      "content": "Jem, wanting to concentrate about type (especially here) is admirable, but to emphasize it beyond other elements isn't really useful if you want to discuss \"wayfinding\" as a broader concept, simply because there is no one best solution.\n\nEvery font that keeps getting pushed out as being the \"be-all and end-all\" for signage has its faults -- blandness is certainly one, but when you consider all the requirements that need to be met, it's not hard to simply devolve to the lowest common denominator.\n\n_Sure the most legible font in the world is not going to be readable if there is not enough contrast between the letters and the background, or if the size is too small, that is a given._\n\nYou personally might think that colour and size considerations are a given, but expecting every other designer (or client!) to know, implement, or approve those ideas is awfully unrealistic. Unfortunately, stupidity and ignorance aren't crimes.... :-(\n\n"
    },
    {
      "time": "",
      "content": "_I don’t really have the time to try and convice you otherwise._\n\nProbably because you couldn't anyway. ;-)\n\nSome, maybe even many -- I wouldn't go as far as \"most\" -- designers can make great standalone signage.\n\nA handful of designers, or architects, or planners, are capable, on their own, to do great wayfinding systems: it takes a broad-based multidisciplinary approach to do it well, a \"checking of egos at the door,\" and a client (individual or company) to have the intelligence, time, and money to want to do what is best for the end-users.\n\n"
    },
    {
      "time": "",
      "content": "\\> Jem, wanting to concentrate about type (especially here) is admirable, but to emphasize it beyond other elements isn’t really useful if you want to discuss “wayfinding” as a broader concept, simply because there is no one best solution.\n\nLinda I didn't emphasize typography above other signage elements, that is your assumption.\n\nAs I mentioned my original post was about typeface legibity for signage. Linda this is Typophile.com\n\n"
    },
    {
      "time": "",
      "content": "\\> Probably because you couldn’t anyway. ;-)\n\nLinda, to get you started ;-)\n\nPer Mollerup  \nGerard Unger: Type design for Dutch road signs (1997) ANWB + Capitolium  \nMetadesign/Erik Spiekermann: BVG  \nFrutiger: Charles de gaulle  \nGottschalk +Ash: Calgary International Airport  \nRoger Pfund: International Red Cross and Red Crescent Museum  \nCato design: Sydney International airport  \nWolf Olins: Tate / Lisbon Metro / Heathrow Express  \nBeat Keusch  \nKen Miki & Associates  \nPentagram  \nIntegral Ruedi-Baur  \nJosef Muller Brockmann  \nOtl Aicher  \nStockholm design lab  \nGary Emery Studio  \nVignelli Associates  \netc.\n\nAnyone else care to add?\n\n"
    },
    {
      "time": "",
      "content": "Sigh... I also have spent a great deal of time on this subject. I started chatting on Typophile when I was working on my thesis a couple of years ago. Linda and I have in common working on wayfinding for a Master's thesis. (Mine was on New York City's signage system.)\n\nAnyway. What Linda speaks of is true...there are too many people, designers included— who think there is one end-all-be-all solution for signage. I can't tell you how many fights I've gotten into about Helvetica for signage (some here and on Typographica).\n\nI also think that Frutiger, Arrival and Clearview are among the best designed for the genre and Clearview as far as I know (as Bill mentioned) is the only one that has been backed up with field testing...(though Keith Tam and Gerry Leonidas might be able to prove me wrong.) :)\n\nThe other point thing is, some of us here have done a LOT of research on the subject (Linda, James and to a lesser extent myself) so opinions and viewpoints will differ greatly. Bottom line, what we as designers _think_ looks good has nothing to do with what testing and research can ultimately reveal.\n\n"
    },
    {
      "time": "",
      "content": "_Anyone else care to add?_\n\nWhere do I begin? Most of the samples you cited LOOK nice. But if we're talking about true field testing for legibility and wayfinding— they don't all stand up to the test.\n\n"
    },
    {
      "time": "",
      "content": "Which test?\n\n"
    },
    {
      "time": "",
      "content": "Adrian Frutiger  \nJosef Muller Brockmann  \nErik Spiekermann  \nPer Mollerup  \nGerard Unger  \n...Biddy?\n\na little respect please.\n\n"
    },
    {
      "time": "",
      "content": "Like Terry said, your first list members look nice but they mostly don't stand up to any kind of POE\\* test. Your second list gets closer to the sort of people I was referring to as the \"handful.\"\n\n\\*POE = Post-occupancy evaluation\n\n_Which test?_\n\nIn POE, there's not just one-size-fits-all test you pull off a shelf. To develop a test, a set of variables is defined as being specific for the venue to be examined, a range of objective values is determined for each variable, a statistical weighting is assigned for each variable to ensure that variables are ranked and prioritized, a sample of people is selected to subjectively evaluate the subject area, and then you crunch a lot of math.\n\nSomeone who knows what they are doing can construct and develop a test that will result in a statistically acceptable variance when all is said and done, assuming there is a fairly homogeneous sample to perform the evaluation to start with.\n\nBut things can get much more \"interesting\" (i..e., complex) when the inquiry starts to cover multiple venues, diverse evaluating sample (wide range of ages and abilities, in particular), or a poorly selected set of variables and inappropriate weighting to start with.\n\nAs I said above, very few designers, architects, and planners have this sort of expertise, and feel that they \"know best\" when it comes to wayfinding.\n\nWith rare exception, they don't.\n\n"
    }
  ]
}
