{
  "id": "32180",
  "title": "FF Info",
  "forum": "Home",
  "tags": [
    "Typeface",
    "wiki"
  ],
  "content": "**[Indices](http://web.archive.org/web/20150330022620/http:/typophile.com/wiki/Indices) : [Typefaces](http://web.archive.org/web/20150330022620/http:/typophile.com/wiki/Typefaces) : FF Info**\n\n[Ole Schäfer](http://web.archive.org/web/20150330022620/http:/typophile.com/wiki/Ole%20Sch%C3%A4fer), [Erik Spiekermann](http://web.archive.org/web/20150330022620/http:/typophile.com/wiki/Erik%20Spiekermann)\n\n**About FF Info Text**\n\nA complete revision of the original FF Info Text Family. Regular and Caps now work better with the new Italic weights and they all now have standard Adobe encoding and integrated Euro symbols. Some letterforms have been corrected and the widths and kerning have been re-tooled. In addition, there are now two sets of figures (old style and table figures) and Expert Sets with arrows, mathematical symbols, and fractions. Notice: type set in FF Info Text (Update) will flow differently than the same text set in the old FF Info Text.\n\nFF Info Text Italic and Caps Italic are brand new designs by Ole Schäfer as extensions to the Text family.\n\n**About FF Info Office**\n\nSince every PC owner can now print out his or her correspondence with Times New Roman or Helvetica/Arial, real typefaces are no longer a novelty. At the same time, no-one would like to go back to the old typewriter characters: They don't have different weights, but need a lot of space. Equal widths for all characters meant that an m had to cramp into the same space as a narrow i. Esthetically that has never been satisfying, but still exists in everybodys imagination as the epitome of office communication. FF Info Office™ combines the advantages of a typesetting face with the merits of a typewriter face. The character widths show less variations than the typesetting version FF Info Text™. The letter forms are designed to withstand printing on simple printers and to be legible on screen. Three weights plus italics as well as various figures in circles or squares give scope for adventurous layouts of letters and faxes. The expert sets contain figures with kerned widths rather than lining figures in the normal weights. The crossed out Zero in the expert sets distinguishes itself from the capital O. European special characters, real fractions, Greek characters, the Euro sign and several symbols in circles complete these sets. Naturally, the FF Info Office goes best with the other two typefaces of the Info family, FF Info Display and FF Info Text. The robustness and affinity to a typewriter face, however, make it a good companion to any other typesetting face when preprinted text and correspondence copy are to be distinguishable frome each other.\n\n**About FF Info Display**\n\nA complete revision of the original FF Info Family. Made to work better in combination with the new italic weights, the new FF Info Display also has standard Adobe encoding and integrated Euro symbols. Some letterforms have been corrected and the widths and kerning have been re-tooled. In addition, there are now two sets of figures (old style and table figures) and Expert Sets with arrows, mathematical symbols, and fractions. Notice: type set in FF Info Display (Update) will flow differently than the same text set in the old FF Info Display. FF Info Display Italic is a brand new design by Ole Schäfer as an extension to the Display family.\n\n**External Links**  \n [FF Info](http://web.archive.org/web/20150330022620/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&searchstr=ff%20info) at FontShop  \n [FF Info fonts](http://web.archive.org/web/20150330022620/http:/www.fontfont.com/fonts/info) at FontFont\n\n",
  "author": "Stephen Coles",
  "time": "12 Mar 2007 — 1:09pm",
  "uid": "103",
  "comments": [

  ]
}
