{
  "id": "32199",
  "title": "Font suggestion for huge visualization",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi,\n\nSo I run the site [http://thebudgetgraph.com/index.php](http://web.archive.org/web/20131107123533/http:/thebudgetgraph.com/index.php \"http://thebudgetgraph.com/index.php\") where every year I create a huge graphic guide to the federal budget. You can see it here,\n\n[http://thebudgetgraph.com/view/](http://web.archive.org/web/20131107123533/http:/thebudgetgraph.com/view/ \"http://thebudgetgraph.com/view/\")\n\nas you can see there is a lot of type, infact its the limiting factor interms of how much data i can put into the project. Well this year I have a larger data set so I will need smaller more compact type. Before I was using Helvetica Neue medium condensed at mostly 10point and 12point for headers. But this isn't cutting it this time.\n\nSo im looking for suggestions for a new font. It needs to be condensed more than anything since the length of each line is what limits the design and data. But it also has to be readable and breathable. It also has to be sans serif.\n\nI was considering Gil Sans MT Condensed at 11point but any other suggestions would be great.\n\nThanks\n\n",
  "author": "mibi",
  "time": "13 Mar 2007 — 7:01am",
  "uid": "17370",
  "comments": [
    {
      "time": "13 Mar 2007 — 7:03am",
      "content": "Oh I should mention that the poster is offset.\n\n"
    },
    {
      "time": "13 Mar 2007 — 7:11am",
      "content": "What about Frutiger™ Next Condensed or FF Meta Condensed Normal?\n\n"
    },
    {
      "time": "13 Mar 2007 — 7:26am",
      "content": "Trade Gothic condensed? Unless the Gill comes with an alternate 1, which I couldn’t find, I would reconsider that when used with numerals. Impressive piece of work.\n\nTim\n\n"
    },
    {
      "time": "13 Mar 2007 — 7:33am",
      "content": "Frutiger condensed isn't any more condensed that helvetica neue, im looking for some serious condensity\n\n"
    },
    {
      "time": "13 Mar 2007 — 7:41am",
      "content": "Trade Gothic is ok, about 10% more condensed than Helvetica condensed, any other suggestions?\n\n"
    },
    {
      "time": "13 Mar 2007 — 8:16am",
      "content": "You might wanna take a look at [Linotype Univers 49](http://web.archive.org/web/20131107123533/http:/www.linotype.com/13235/univers49lightultracondensedno2-font.html) (or 39, 59).\n\n"
    },
    {
      "time": "13 Mar 2007 — 8:30am",
      "content": "There is more to economy (pun?) than character width. Allow me to suggest something that can be set smaller and still be at least as legible as a condensed Helvetica or Univers:  \n [http://www.gerardunger.com/allmytypedesigns/allmytypedesigns20.html](http://web.archive.org/web/20131107123533/http:/www.gerardunger.com/allmytypedesigns/allmytypedesigns20.html \"http://www.gerardunger.com/allmytypedesigns/allmytypedesigns20.html\")\n\n"
    },
    {
      "time": "13 Mar 2007 — 10:09am",
      "content": "[The Font Bureau](http://web.archive.org/web/20131107123533/http:/www.fontbureau.com/) has a number of really complete sans-serif type families that could be useful. Antenna, Agenda, and Relay appear to have four widths, and Amplitude has an incredible five. Amplitude could be particularly good, as its pronounced ink traps could be useful in small sizes. Check out the many sans-serifs to be had over there -- many could be appropriate.\n\n"
    },
    {
      "time": "13 Mar 2007 — 12:06pm",
      "content": "Font Bureau aside it's interesting that all the suggestions for a United States Budget poster have been for European designed types! How appropriate is that? mibi, show some patriotism and pick a Chinese font for crying out loud! ;-)\n\n"
    },
    {
      "time": "13 Mar 2007 — 12:25pm",
      "content": "Damn Si, us Merkins dono nutin' but dezinin no type :-P\n\nChrisL\n\n"
    },
    {
      "time": "13 Mar 2007 — 12:41pm",
      "content": "True, but when it comes to fighting wars and racing cars...\n\n"
    },
    {
      "time": "13 Mar 2007 — 12:45pm",
      "content": "Don't get me started on that war stuff.\n\nChrisL\n\n"
    },
    {
      "time": "13 Mar 2007 — 12:47pm",
      "content": "I am going to recommend Hoefler & Frere-Jones Knockout. Got some serious condensed forms, as well as some super fatty's. Best of luck.\n\n[http://typography.com/catalog/knockout/index.html](http://web.archive.org/web/20131107123533/http:/typography.com/catalog/knockout/index.html \"http://typography.com/catalog/knockout/index.html\")\n\n"
    },
    {
      "time": "13 Mar 2007 — 1:40pm",
      "content": "Wasn't Trade Gothic designed by an American? Although a smaller use typeface might be an alternative way to go (like Bell Centennial).\n\nTim\n\n"
    },
    {
      "time": "13 Mar 2007 — 6:17pm",
      "content": "yeah i think I am going to have to reduce the size a bit, any ideas for an open, legible font at around 8pt?\n\n"
    },
    {
      "time": "14 Mar 2007 — 4:44am",
      "content": "There has just come out a new font by Cyrus Highsmith that is pretty much condensed: [http://www.fontbureau.com/pdf/Antenna.pdf](http://web.archive.org/web/20131107123533/http:/www.fontbureau.com/pdf/Antenna.pdf \"http://www.fontbureau.com/pdf/Antenna.pdf\")\n\n"
    },
    {
      "time": "14 Mar 2007 — 10:33am",
      "content": "You may try Myriad pro,it's super ok even if u use it much smaller then 11p\n\n"
    },
    {
      "time": "14 Mar 2007 — 11:00am",
      "content": "I've tried Myriad, is there much a difference in the Pro?\n\n"
    },
    {
      "time": "14 Mar 2007 — 2:19pm",
      "content": "Which variant of Myriad standard did you try? Myriad Pro has more variants in the family.\n\n"
    },
    {
      "time": "14 Mar 2007 — 2:35pm",
      "content": "Ok, after running a few test prints I am going to run with Frutiger Condensed at 8pt. Thanks for the suggest carlos. It seems very open which is good when there is so much data and text hitting the viewer in the face. at 8pt it still maintains good clarity and contrast. Bell Centennial and trade gothic seemed a bit too emaciated at 8pt when its white on black.\n\nAmplitude condensed regular 9pt was also a contender as it will save me an extra 2mm on average. I might switch if I need those milimeters. Myriad Condensed at 10pt I might use aswell as it saves as much space as Frutiger with a little extra height. Anyone know how Myriad differs from Myriad Pro?\n\n"
    },
    {
      "time": "14 Mar 2007 — 5:25pm",
      "content": "_Allow me to suggest something that can be set smaller and still be at least as legible as a condensed Helvetica or Univers:  \nhttp://www.gerardunger.com/allmytypedesigns/allmytypedesigns20.html_\n\nI also wanted to suggest Unger. He designs alot of newspaper type, which as you know are usually specifically crafted for economy, while keeping legibility at a maximum. And, most of them are also very beautiful.  \nIf you really need economical faces, I would look at something like that, instead of a condensed version of a 'normal' typeface, which in my eyes usually are less legible.\n\n"
    },
    {
      "time": "15 Mar 2007 — 2:37am",
      "content": "MYRIAD  \nregular  \nitalic  \nbold  \nbold italic\n\nMYRIAD PRO  \nlight condesed  \nlight condesed italic  \ncondensed  \ncondenst italic  \nsemibold condensed  \nsemibold condensed italic  \nbold condensed  \nbold condensed italic  \nblack condensed  \nblack condensed italic  \nlight  \nlight italic  \nregular  \nitalic  \nsemibold  \nsemibold italic  \nbold  \nbold italic  \nblack italic\n\n"
    },
    {
      "time": "15 Mar 2007 — 3:29am",
      "content": "I agree at 8pt reversed out Trade Gothic is too fine, have you tried bold (or sub caption for Bell Centennial)? Obviously space, lack of weights becomes an issue here. Amplitude looks promising, never had the opportunity to use it though.\n\nTim\n\n"
    },
    {
      "time": "16 Mar 2007 — 1:52pm",
      "content": "While you are listing the members of the Myriad Pro family, don't forget [Myriad Pro Semi-Extended](http://web.archive.org/web/20131107123533/http:/www.adobe.com/type/browser/P/P_1708.html)\n\n"
    }
  ]
}
