{
  "id": "3219",
  "title": "Arnhem",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "First off: I like Smeijers's work, especially Quadraat; plus he's a dedicated craftsman, so I'm tempted to like him as a person too.   \n   \nBut there's something in the Arnhem piece on new-series.org that bugged me immediately, even though it's pretty subtle. It might be nitpicking on my part, but I think it's significant, and could actually reflect an issue broader than just Smiejers's own design philosophy.   \n   \nFirst, I'm putting aside two things:   \n1. That I think the bulb on the \"a\" actually reduces readability, because the identity of the \"a\" lies in its bottom bowl, and making the top full creates a non-descript gray blob in a bouma (word shape).   \n2. That too much harmony is sacrificed between the Display and Text cuts of the font, largely because of the variance in applying bulbs.   \n   \nIgnoring those two notable issues, there remains the main deal: a contradition within the logic of leaving the bulb off the \"a\" but making the color unusually dark.   \n   \nHere's how I see it:   \nHe says that the bulb on the \"a\" should be there in a text font because people expect it. Maybe. But this falls apart when he comes to the part about Arnhem's very dark color, defending it with the logic that \"designers are not 'the people'\" and that readers benefit from the dark color. The inconsistency becomes obvious: if a font should have a relatively minor thing like the bulb of the \"a\" because the reader is used to it, then they should also see a much lighter color, because they're used to that too. (Did I explain that well?)   \n   \nAnother attempt?   \nIn the part about the color of the face, he says that most designers would think it's too dark (implying that most readers see -and thus \\*expect\\*- a lighter color), but the designers don't matter, and the readers in fact benefit from the dark color (even though they expect a lighter color). Actually, this is tenable of itself. But he had previously said that the reader expects the bulb on the 'a', and that's why it has to be there. Since color is clearly a bigger factor than the lone bulb in a single glyph, he's treating \"expectation\" inconsistently. So there is a flaw in his logic if he thinks that the bulb helps reading (because it's expected), but so does the dark color (even though it's not)!   \n   \nOK, one more angle, a concise one... :-/   \nHis rationale for \\*actively adding\\* the bulb of the 'a' is \"they expect it\", while his -admittedly indirect- rationale for the unusually dark color is \"it doesn't matter that they don't expect it\".   \n   \n(Now I'm confused... Which of these three should I use from now on? :-)   \n   \nNow, Smiejers could very well have been making aesthetic decisions in putting the bulb on the \"a\" and making the color dark - and there's nothing necessarily wrong with that. But he shouldn't use \"rationalisations\" (that are in fact flawed) to justify those features.   \n   \nhhp\n\n",
  "author": "hrant",
  "time": "9 Sep 2002 — 7:36pm",
  "uid": "1250",
  "comments": [
    {
      "time": "9 Sep 2002 — 10:41pm",
      "content": "Good lord, I agreed with Hrant \\*again\\*, the second time in only a few weeks. Will wonders never cease?   \n   \nT\n\n"
    },
    {
      "time": "10 Sep 2002 — 5:23am",
      "content": "Hrant --   \n   \nI understood your point all three times. But. . . I don't agree with your interpretation. I have a different reading of Smeijers.   \n   \nFirst, I think you place too much weight on his _\"we simply expect a bulb\"_ and not enough on his _\"it simply works better.\"_ Granted, I understand that you don't agree with Smeijers's assessment that it works better; but it seems to me that his rationale is as much that to his eye it works better as it is that readers expect it.   \n   \nSecond, I don't see how you get from _\"designers might object [to the darker color], but designers are not 'the people'\"_ to the assumption that readers expect lighter color. The statement in your second \"angle\" -- that Smeijers's explanation implies _\"that readers see -and thus \\*expect\\*- a lighter color\"_ -- is unfounded. I see no such implication. Instead I take Smeijers's statement to mean that designers are critical of color and prefer lighter type (probably because they don't usually read, but just look) whereas readers have no such expectation and don't seem to notice or object to darker color.   \n   \nIt seems to me that Smeijers believes -- well, okay, \\*I\\* believe -- that readers don't have the same sensitivity to overall color as they do to overall shapes. And, if anything, a reader is likely to think a font is too light than too dark (usually Moderns with too much contrast). I think that readers do have certain general, subconscious expectations about overall letter shapes (which is why the acceptable range of variation is so much narrower for text types -- despite what some proclaim), but I think they have no such expectations, subconscious or otherwise, about overall color. Within the realm of text types, the common norms for shape to which readers are constantly exposed (which is how Smeijers seems to derive the readers' expectations) are fairly consistent -- Sabon, Bembo, Times, Garamond, the usual suspects. Whereas, there is not the same consistent, narrow range of norms for overall color. The reader is exposed to a much broader variation in densities and overall color, whether by design or through variations in inking and paper. Thus, less expectation, if any, has developed.   \n   \nSo, I sum up my interpretation of Smeijers's rationale as this: With regard to the bulb on the 'a' in text, but not in display -- _It works better, logical consistency be damned._ With regard to the darker color -- _It works better, designers' preferences be damned._   \n   \nYou may disagree with his assessment of What Works Better, but I'm afraid I don't see the rationalizations as being as contradictory and \"flawed\" as you do. And I certainly don't think this _\"reflects an issue broader than just Smeijers's own design philosophy;\"_ but I can imagine that this struck you as another example of the \"artistique\" masquerading as logic.   \n   \n-- K.\n\n"
    },
    {
      "time": "10 Sep 2002 — 10:36am",
      "content": "Thomas, I'm a licensed exorcist, and I'll do you this one time pro bono, OK?   \n   \nKent, I see what you mean. Can Smeijers really believe that one bulb on one glyph is so \"expected\" that it \\*has\\* to be there even if it coflicts with the display cut\\*, but an unusually dark color has no \"expectation\" problem? If so, then it reminds me a bit of this model of the universe that this guy dreamed up, where the surface of the earth was the \\*inside\\* of a hollow sphere, eveything was inside (getting smaller with proximity to the center), and nothing was outside; plus he made special contorted versions of all the laws of physics to make it make sense. Basically, you can't prove he's wrong. But I exagerate.   \n   \n\\* Maybe he should have just added the bulb(s) to the display cut?   \n   \n\\> his rationale is as much that to his eye it   \n\\> works better as it is that readers expect it.   \n   \nI have no problem with the first part - intuition has a lot of merit in design. But mixing it up with rationalization doesn't cut it.   \n   \n\\> The statement in your second \"angle\" -- that   \n\\> Smeijers's explanation implies \"that readers   \n\\> see -and thus \\*expect\\*- a lighter color\" --   \n\\> is unfounded.   \n   \nHow so?   \nPeople expect the bulb because most designers use it, and they expect a lighter color for the same reason. (Not that expectation is the only factor, but that's beside the point.)   \n   \n\\> there is not the same consistent, narrow   \n\\> range of norms for overall color.   \n   \nYou don't think so? Arnhem is way off the scale, come on. My own Patria's regular weight is somewhat dark for most people, and Arnhem's Regular is darker than my demi!   \n   \n\\> logical consistency be damned.   \n   \nSure, fine. In same way that most people who design text faces put serifs in there because they believe that helps readability, but they have no idea how. Again, my problem is with the shaky rationalization.   \n   \n\\> I can imagine that this struck you as another   \n\\> example of the \"artistique\" masquerading as logic.   \n   \nYes. Or a dysfunctional marriage between the two. The question might be: which is worse, a designer pretending logic is unimportant, or a designer -with good artistic instincts- using logic as a front?   \n   \nhhp\n\n"
    },
    {
      "time": "10 Sep 2002 — 11:34am",
      "content": "But you know what? I should really be grateful: Smeijers has gone on record with two \"fringe\" opinions that I happen to agree with, and now I can point to a Famous Type Designer when people disagree with me!   \n   \n1. Darkish color is good for you.   \n2. Designer opinions about font functionality don't (or at least shouldn't) matter - at least not more than a tiny little bit.   \n   \nhhp\n\n"
    }
  ]
}
