{
  "id": "32202",
  "title": "Alphabet Carving",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Sometimes they're called alphabet carvings, alphabet tablets, or alphabet stones. I saw one once, about a dozen years ago.\n\nDoes anyone know where I can purchase one that won't cost an arm and a leg? It's not terribly important if it's wood or stone, or if it's carved, sandblasted, laser cut, engraved, etched, or whatever, as long as it's both correct and aesthetic. The sample is from England; everything else being equal, which it never is, it would probably cost less in the USA if for no other reason than shipping.\n\nAny ideas?\n\n| Attachment | Size |\n| --- | --- |\n| [Alpha.jpg](http://web.archive.org/web/20120730174543/http:/typophile.com/files/Alpha.jpg) | 23.39 KB |\n\n",
  "author": "Renaissance Man",
  "time": "13 Mar 2007 — 8:16am",
  "uid": "15371",
  "comments": [
    {
      "time": "13 Mar 2007 — 9:29am",
      "content": "This might be an idea...\n\nSearch the local phone book for a headstone/memorial carver or Metal Shop that uses a water jet. You'd probably have to supply the design, but the final piece would be pretty intricate.\n\nIf you want that hand-hewn look, again, a headstone carver could probably offer those services. It might be per letter.\n\n"
    },
    {
      "time": "13 Mar 2007 — 9:35am",
      "content": "Lol—great—who are you if I am not too nosy ?\n\n"
    },
    {
      "time": "13 Mar 2007 — 9:35am",
      "content": "England? The US? You've got to be kidding. Unless you're looking for celebrity art, what you want is the \"Vernissage\" flea market in Yerevan, Armenia. Two pertinents things I've purchased from there are a painting of the Armenian alphabet\\* for $40 last Fall, and a full-size hand-carved backgammon board\\*\\* (cherry or pear wood, I forget) with various motifs on one face and \"Papazian\" set in Armenian in my Maral font (I gave Roubik a printout) nicely carved on the other face, for $25 (although that was in 2000).\n\n\\* [http://www.flickr.com/photos/48413419@N00/267395186/](http://web.archive.org/web/20120730174543/http:/www.flickr.com/photos/48413419@N00/267395186/ \"http://www.flickr.com/photos/48413419@N00/267395186/\")\n\n\\*\\* Wait time: two days.\n\nhhp\n\n"
    },
    {
      "time": "13 Mar 2007 — 1:56pm",
      "content": "You could try contacting the [Cardozo Kindersley](http://web.archive.org/) website. They got some teatowels at the shop.\n\n"
    },
    {
      "time": "13 Mar 2007 — 1:58pm",
      "content": "In actual fact, the alphabet you have shown is by Lida Lopes Cardozo and is on the gallery at the Cardozo Kindersley website above.\n\n"
    },
    {
      "time": "13 Mar 2007 — 2:06pm",
      "content": "He said \"won't cost an arm and a leg\". :-)\n\nhhp\n\n"
    },
    {
      "time": "13 Mar 2007 — 2:08pm",
      "content": "Tea towel would be less than a tenner!\n\n"
    },
    {
      "time": "14 Mar 2007 — 1:02am",
      "content": "Better Ask the Men of the Cave.  \n [http://www.sacred-destinations.com/turkey/ephesus-cave-of-the-seven-slee...](http://web.archive.org/web/20120730174543/http:/www.sacred-destinations.com/turkey/ephesus-cave-of-the-seven-sleepers.htm \"http://www.sacred-destinations.com/turkey/ephesus-cave-of-the-seven-sleepers.htm\")\n\n"
    },
    {
      "time": "14 Mar 2007 — 1:20am",
      "content": "My local health food store has a bunch of faux carved things - souless nonsense. Have somebody carve one for you. You will really enjoy it then.\n\n"
    },
    {
      "time": "9 Jul 2010 — 2:44pm",
      "content": "You could always mediablast it thru a vinyl cut.\n\n"
    }
  ]
}
