{
  "id": "32220",
  "title": "Swiss Stylleeee",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Producing a book on Global Warming and want to study swiss design a little more. I live in BFE and have no library, etc. So I have to for the most part rely on purchasing books and the web. Any good sites out there with some classic swiss style?\n\nDesign archives for AIGA are a little to modern, im looking for the ol' shite.\n\nCheers\n\nJames\n\n",
  "author": "James Scriven",
  "time": "13 Mar 2007 — 7:40pm",
  "uid": "14360",
  "comments": [
    {
      "time": "14 Mar 2007 — 2:10am",
      "content": "Hi James,  \nFor posters “inna Swiss Stylleeee” best is the archive of the Swiss national Library. Type in Emil Ruder, Carlo Vivarelli or whatever into the Search box.  \n [http://posters.nb.admin.ch/cgi-bin/gw/chameleon?lng=en&skin=posters](http://web.archive.org/web/20130917110338/http:/posters.nb.admin.ch/cgi-bin/gw/chameleon?lng=en&skin=posters \"http://posters.nb.admin.ch/cgi-bin/gw/chameleon?lng=en&skin=posters\")\n\nFor book design ask the Arts Council of Switzerland if they can send you “Book Design in Switzerland” by Jost Hochuli  \n [http://www.prohelvetia.ch/](http://web.archive.org/web/20130917110338/http:/www.prohelvetia.ch/ \"http://www.prohelvetia.ch/\")\n\nOrder “Designing Books, Practice and theory” by Jost Hochuli and Robin Kinross from Hyphen books.  \n [http://www.hyphenpress.co.uk/titles/index.html](http://web.archive.org/web/20130917110338/http:/www.hyphenpress.co.uk/titles/index.html \"http://www.hyphenpress.co.uk/titles/index.html\")\n\nIf you want to splash out a bit more for some eye-poppingly beautiful coffee table books on the subject go for “The Typographic Grid” by Hans Rudolf Bosshard and “Printed matter, mainly books” by Jost Hochuli (yup, him again) from the Arthur Niggli publishing company.  \n [http://www.niggli.ch/](http://web.archive.org/web/20130917110338/http:/www.niggli.ch/ \"http://www.niggli.ch/\")\n\nBest wishes,  \nSimon H.\n\n"
    },
    {
      "time": "14 Mar 2007 — 7:49am",
      "content": "Simon, Cheers!\n\nI've got most of the books you mentioned, but I'll look into contacting the Swiss Arts Council.\n\nThanks again.\n\nIm using Univers at the moment for the primary face. . .any other ideas (I might try a version set in Hel(l)vetica.) but am willing to look elsewhere.\n\n"
    },
    {
      "time": "14 Mar 2007 — 7:49am",
      "content": "[http://www.slanted.de/874](http://web.archive.org/web/20130917110338/http:/www.slanted.de/874 \"http://www.slanted.de/874\") (a few examples of the link below)  \n [http://swissposters.library.cmu.edu/Swiss/Home.html](http://web.archive.org/web/20130917110338/http:/swissposters.library.cmu.edu/Swiss/Home.html \"http://swissposters.library.cmu.edu/Swiss/Home.html\")\n\n"
    },
    {
      "time": "14 Mar 2007 — 7:59am",
      "content": "Univers is the perfect choice for Swiss design of that era. They also were not too adventursome with mixing types in those days.\n\nChrisL\n\n"
    },
    {
      "time": "14 Mar 2007 — 8:19am",
      "content": "univers? imho akzidenz grotesk, all the posters (opera-poster by brockmann with the big m for example) and so on.. speaks way more swissness (for me). really, in my everyday life, i see like 90% helvetica (mixed with arial), 5% akzidenz, 5% univers here in switzerland - only the grotesques counted.\n\n"
    },
    {
      "time": "14 Mar 2007 — 8:45am",
      "content": "Thierry,  \nHe said he already bought Univers (Ruder used it far more than 5% of the time back then in the 1960s). I didn't see the need to have him also purchase AG and Helvetica. My point was that you would not see the mixing of Univers and Helvetica on one piece. You would choose one.\n\nChrisL\n\n"
    },
    {
      "time": "14 Mar 2007 — 9:11am",
      "content": "oh, i overread that part, excuse me. im quite in a hury these days.\n\n"
    },
    {
      "time": "14 Mar 2007 — 1:04pm",
      "content": "I figured they might already be sitting on your bookshelf – but unfortunately a few minutes after I had pressed the “Post comment” button :)\n\nRe: fonts from Swiss books,  \nThe interesting thing is that when you look closely at Swiss Typography/objective Typography/International Style you can actually distinguish between the graphic design coming out of Basel and Zurich. The differences seem to have origins in the surprisingly angry 1946 slagging match between Max Bill and Jan Tschichold in the pages of the Schweizer Graphische Mitteilungen, (more in the University of Reading Typography Papers 4, 2000) or a general long-term rivalry between the two cities. Using Univers in a book would be more associated with Basel - Emil Ruder used it a lot (and I believe he and Adrian Frutiger were good friends). For reproductions of Ruder’s book (and children’s book) designs in Univers (and one in Baskerville) check out the excellent article “Emil Ruder, Typography from the inside” by Helmut Schmidt in Baseline 36, 2002. In Zurich Max Bill and the people editing Neue Grafik magazine (Lohse, Müller-Brockmann, Neuburg, Vivarelli) seem to have been concerned with making graphic design that was actually modern (concrete) art for whome Univers was a bit too stylish and flashy and seem to only use AkzGrot and Helvetica in their attempt at ‘zero degrees’ typography that was pure communication with no style (which of course quickly became a style). This is mostly true for book design of the style and the period you are referring to but strangely enough my copy of “Graphic Design Manual” by Armin Hofmann is Univers 55 on the front cover and spine but the rest is Akzidenz which I’ve never really understood at all.\n\nUn grand “tout d’bon” helvétique,  \nSimon H.\n\nP.S. There’s a heavyweight study on this subject by Zurich-based academic Christoph Bignens called “Swiss Style 1914-1964”, but I’m not sure if it has come out in English yet.\n\n"
    },
    {
      "time": "14 Mar 2007 — 1:44pm",
      "content": "dear simon, wonderful information - hoping to begin my studies in zurich this autmn its interesting to get some even more in-depth info about the old days.\n\ni guess i have to get bignens book in the library because of my limited budget, but it sounds very promising - you destroy my savings of this month! ;)\n\n"
    },
    {
      "time": "14 Mar 2007 — 2:33pm",
      "content": "My family used to be good friends to the Ruders, and I litteraly grew up surrounded by Swiss style graphics and typography (I don’t think, however, that Emil Ruder—an excellent musician, by the way—was that close to Adrian Frutiger&nbsp;…). I’ve never thought about it, but I think what Simon wrote is perfectly true: There are considerable differences between a Basle version and a Zürich version of Swiss style. It undoubtedly has something to do with the respective protagonists—Ruder, Tschichold and Basel Gewerbeschule vs. Bill and Zürich Kunstgewerbeschule. Add to that a traditional rivalry between the two cities and the different styles of the respective publishers. Ironically, a lot of what is called \"Swiss style\" today (especially in American publications), Ruder and other Basel teachers would never have approved of. One easily forgets that many Swiss—or Basel—designers of the time had a rather different idea of \"Swiss style\", including many not-so-sober styles like the ones of Leupin or GGK agency.\n\nTout d’ bon to all the Swiss typophiles  \nFlorian\n\n"
    },
    {
      "time": "14 Mar 2007 — 2:34pm",
      "content": "Simon,  \nI studied design and typography with Basle graduates. Ken Hiebert was my typography teacher and a Basle grad. He was a student of Ruder and Hofmann. We used Univers exclusively in those classes in the 60s. Two years later, I met Peter Megert while working at the Westinghouse design Center. He is from Bern and apprenticed with Müller-Brockmann. He ALWAYS used Helvetica. It was clear to him that the Basle people were from a different planet. He would qualify anything about a Basle designer with, \"But he is from Basle.\" said in such a way as if to excuse his failing do to an affliction :-) It would be like saying, \"That man just walked into a wall, but then again he is blind.\" Peter is still a friend and was always a big joker so you have to understand his dry sense of humor. He made many jokes about his Swiss homeland, complaining how boring it was to see nothing but cheese and watches all day--he then would smile and say, \"But the chocolate is good.\"\n\nChrisL\n\nPS: The helvetica in the text of \"Graphic Design Manual\" may have been a Reinhold idea. Publishers have their workflows you know :-)\n\n"
    },
    {
      "time": "14 Mar 2007 — 6:42pm",
      "content": "Florian & Chris,  \nThank you both for the very interesting info.  \nI’d really like to know if Florian remembers the Ruders being interested in Japanese art/eastern philosophy at all, as it seems to be a link between the two schools/currents. Emil Ruder wrote an article called “On drinking tea, typography, historicism, symmetry and asymmetry” for the Typographische Monatsblätter in 1952 (v.2 p.83) which links the relationship between printed and unprinted areas on a page to ideas of ‘empty’ and ‘full’ from Taoism. JM-B was a student of zen for many years and married a Japanese artist (Shizuko Yoshikawa) who studied at Ulm – which must have something to do with him going down to one point size and one weight for the “musica viva” posters in the late 50s and the famous “Akari” poster which is basically a big coloured ‘enso’.  \nRe: GKK, Good point, concrete art wasn’t just from Zurich as Basle has it’s own ‘graphic designer and concrete artist’ in GKK’s Karl Gerstner (who did the Swissair corporate identity as well as loads of geometric abstract art).\n\nThierry,  \nHa, Ha, very sorry. I somehow don’t think you are the only person on this website who spends too much money on typography books, though.  \nBest wishes.  \nSimon H.\n\n"
    },
    {
      "time": "15 Mar 2007 — 1:46am",
      "content": "Simon, I don’t know any particulars, but it is very well possible that Ruder had some interest in Eastern graphics and/or philosophy (I was born after Ruder died, so I cannot speak from memory). However, this is a penchant—should I say a hobby—that many of the designers of the time shared. The view of Japanese and Chinese graphics being the ideal of printing and visual culture was extremely widespread. Not all designers had the insight and zeal of Tschichold, who did really some research on the topics. Others’ knowledge never got beyond Eugen Herrigel’s Zen-books.\n\nWhat strikes me is another thing: When I browse to new publications on \"Swiss design\", I sometimes find that one aspect is undervalued: the fact that almost all of the leading figures of Swiss design were teachers and saw themselves formost as teachers. This ›tradition‹ extends to living designers such as Hochuli and Bosshardt. It is also interesting to see that some of the designers of international fame were happy to live for thirty or forty years in one and the same Swiss city, almost without travelling further than their holiday home in the Swiss Alps once a year! If you compare that to hectic schedule of todays ›stars‹, you might find another reason for the quite and concentrated look of Swiss style of the time. And indeed, I sometimes wonder whether today’s extensive travelling and ›congressing‹ is that helpful for design itself.\n\nNow I really have to do my work  \nF\n\n"
    },
    {
      "time": "17 Mar 2007 — 12:19am",
      "content": "Eye candy:\n\n[http://www.flickr.com/search/?q=swiss+graphic+design](http://web.archive.org/web/20130917110338/http:/www.flickr.com/search/?q=swiss+graphic+design \"http://www.flickr.com/search/?q=swiss+graphic+design\")  \n [http://www.flickr.com/photos/rumberodesign/sets/72157594514514723/](http://web.archive.org/web/20130917110338/http:/www.flickr.com/photos/rumberodesign/sets/72157594514514723/ \"http://www.flickr.com/photos/rumberodesign/sets/72157594514514723/\")\n\n ![](http://web.archive.org/web/20130917110338im_/http:/typophile.com/files/40_1_5273.JPG.jpg)\n\n"
    },
    {
      "time": "17 Mar 2007 — 12:26am",
      "content": "+  \n [http://www.schmidtoday.com/](http://web.archive.org/web/20130917110338/http:/www.schmidtoday.com/ \"http://www.schmidtoday.com/\")  \n [http://www.lutz.to/](http://web.archive.org/web/20130917110338/http:/www.lutz.to/ \"http://www.lutz.to/\")\n\n"
    }
  ]
}
