{
  "id": "3224",
  "title": "Deep Purple 1974 font - help needed!",
  "forum": "Type ID Board",
  "tags": [
    "Type ID Board"
  ],
  "content": "Hi People; I'm working on a CD reissue of Deep Purple's EMI UK album Burn, issued in 1974. That year someone used a commercial typeface for a band logo for posters, tour prog etc. (though it didn't appear on the LP). The logo was then used on the next album Stormbringer (1974) and a live album Made In Europe (1976) - which also used the font extensively for the credits etc.   \nI thought it was a Letragraphica font (yes I'm old enough to remember them!) but enquiries there have drawn a blank (though whether anyone there now was there 30 years ago is unlikely!). I'll add a copy of the logo but I've seen it used in body copy without the outline, so this may have been added by the ad agency responsible. I appreciate any help anyone can give me. Simon\n\n<!--attachment: typeface-26903.unk*attachment_icon.gif*image/tiff*114.6*Deep+Purple+font*typeface%2etif --><!--attachment: typeface-26903.unk*attachment_icon.gif*image/tiff*114.6*Deep+Purple+font*typeface%2etif -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20120625103447im_/http:/www.typophile.com/forums/icons/attachment_icon.gif\" align=\"left\" alt=\"image/tiff\">Deep Purple font<br><a href=\"http://web.archive.org/web/20120625103447/http:/www.typophile.com/forums/messages/83/typeface-26903.unk\" target=\"_blank\"><b>typeface.tif</b></a> (114.6 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "fireball",
  "time": "20 Feb 2004 — 8:05am",
  "uid": "3108",
  "comments": [
    {
      "time": "20 Feb 2004 — 8:10am",
      "content": "I don't know the font, but if all you want is the logo, an EPS can be found [here](http://web.archive.org/web/20120625103447/http:/web.brandsoftheworld.com/?id=112&query_id=991683&page=1&brand_id=29864).\n\n"
    },
    {
      "time": "20 Feb 2004 — 8:21am",
      "content": "Actually, don't bother with the EPS, I just noticed it's an awful auto-trace.\n\n"
    },
    {
      "time": "20 Feb 2004 — 8:23am",
      "content": "I'm old enough to remember Letragraphica, too, but I've never seen this typeface before (if it is a typeface). The caps are similar to the old Letraset face [Plaza](http://web.archive.org/web/20120625103447/http:/www.myfonts.com/fonts/linotype/plaza-ef/), but it has no lowercase and it was released in 1975, a year later than the album. Perhaps Plaza was inspired by the typeface from the album?   \n   \nOne other thing. In your sample, there are inconsistencies among some of the characters which suggests it may have been done by hand (and not very well). This doesn't rule out the existence of a font, though.\n\n"
    }
  ]
}
