{
  "id": "32244",
  "title": "Type Designer's Work Ethic",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I was just reading the Myfonts.com March 2007 Rising Stars newslettter, and I happened to see the following quote from Rebecca Alaccari of Canada Type:\n\n<cite>Both Patrick and I put in an average of 10 to 12 work hours a day, 6 days of most weeks.</cite>\n\nDamn. I also saw a recent post where someone mentioned if you couldn't sit in front of a computer for more than 3 hours at a time you probably aren't cut out for the type design business.\n\nSo what's the scale? What's reasonable? I understand that it takes a long time to create a typeface, but there's got to be a line somewhere. All work and no sleep or play makes Dan Gayle a grumpy mean person with bad hair and no girlfriend.\n\nWhat do you think is typical for the industry?\n\n",
  "author": "<a href=\"/web/20100926045031/http://typophile.com/user/12948\" title=\"View user profile.\">DanGayle</a>",
  "time": "<br>",
  "uid": "12948",
  "comments": [
    {
      "time": "",
      "content": "I don't know.  \nBut I usually work about 10 hours per day and only sometimes I take the weekends off.\n\nI think that type design is more a passion than a profession.  \nAnyway, if we look to Hermann Zapf we can say that type design must be a healthy exercise ;^)\n\nDino\n\n"
    },
    {
      "time": "",
      "content": "A recent study looked at the careers of successful people in many walks of life, and compared them with those \"most likely to\" from school days. Did the ones who did best at school do best in later life? Maybe. But in whatever field, it was found that you have to work crazy hours for ten years to get to the top.\n\n"
    },
    {
      "time": "",
      "content": "I think the life of a mendicant monk sounds attractive right now.\n\n"
    },
    {
      "time": "",
      "content": "Leslie Cabarga's Logo and Lettering book has a nice albeit brief summary about the hours many of the font designers including me invest in working. Page 235 - I, Designaholic section . . .\n\nPersonally I have 3 full workdays when the kiddos are in school and they run from 8:30 till 5:00 with a 20 minute lunch. On the other days, I'm checking and replying to e-mail about every 2-3 hours or so and making or taking phone calls throughout the day else I'm pre-planning my workload for my full workdays. Some evenings for 2-3 hours after the kids go to bed are spent working as well if the mood strikes me.\n\nIt's not optimal in terms of my desired output of work or the required focus of fontmaking when you're in the groove so to speak but I've lowered my expectations of the quantity I'm able to produce a bit and am pleased with what I am able to produce. I've also spent time delegating work that I feel doesn't require my expertise which explains all the phone calls.\n\nOverall, the family thing is a much bigger deal for me so it deserves my primary focus and everything else can fall out of the time not spent with my family.\n\nStuart :D\n\n"
    },
    {
      "time": "",
      "content": "My full-time job and commute subtracts 11 hours from my day (for the timebeing anyway). I have a wife and 2 kids but they are not young and all-consuming like they used to be :-)  \nThis leaves me some amount of time for sleeping, eating, etc. I play tennis a couple of times a week and take voice lessons. All the rest is spent designing type, not because I have to but because I want to. I would love to be able to spend 12 hours a day designing type. I enjoy the time I do get to now. Since I am retiring in June, I will have more time to give it a go. Dino is right, as is James Montalbano of your 12 hour quote, designing type is a passion, not a job. Those who are not passionate about it probably won't do it for very long.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Nice writing, thank you.\n\n"
    },
    {
      "time": "",
      "content": "The life of a mendicant monk is GREAT!\n\nDino\n\n"
    },
    {
      "time": "",
      "content": "I'm not good at calculating averages, but I can tell you my record  \nis 16 hours. Obviously, I didn't get out of my pyjamas. And just as  \nobviously, I was younger then.\n\n\\> you have to work crazy hours for ten years to get to the top.\n\nIt can't be that simple.  \nPlus \"the top\" is an illusion anyway.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "\"Talent? Anyone can have that. I don't believe in talent; I believe in work.\"\n\n– Mies van der Rohe to Philip Johnson\n\n"
    },
    {
      "time": "",
      "content": "How protestant. Which -I just realized- you can't spell without \"ant\".\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_\"It's amazing that the amount of news that happens in the world every day always just exactly fits the newspaper.\"_  \nJerry Seinfeld\n\n"
    },
    {
      "time": "",
      "content": "I believe it was Dave Farey who said, and I am paraphrasing, \"Type design requires a fair amount of talent, but an enormous about of stamina.\"\n\n"
    },
    {
      "time": "",
      "content": "I find it's different when I'm working on commissioned work vs. my own retail work. I think to some degree, having a commercial project \"forces\" me to be creative and meet deadlines, generally working 10+ hour days during daylight hours.\n\nOn the other hand, with my personal projects, it's only the creativity that is tough to come by. I can sit at the computer day and night only stopping for brief periods of sustenance when the creativity is there.\n\nJoe Kral is a man who can work in fontographer with the stamina of a marathon runner.\n\nIn my opinion the quality of a type design is equal to the time put into it.\n\n"
    },
    {
      "time": "",
      "content": "\\> “forces” me to be creative\n\nDoes that actually work?\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "No but it's a necessary belief when you have deadlines. At least for me…\n\npeace\n\n"
    },
    {
      "time": "",
      "content": "It helps when you're putting in all that long work, if it actually improves the product.\n\nWe're all subject to diminishing returns, as the rate plateaus, but the trick is to keep working and squeezing out incremental improvements, keeping going rather than just spinning wheels.\n\n"
    },
    {
      "time": "",
      "content": "sometimes when i meet people, they ask what i do for work. i tell them that i draw letters. they ask what i do for fun, and i tell them that i draw letters. it does kind of consume you, if you let it.\n\n"
    },
    {
      "time": "",
      "content": "\"sometimes when i meet people, they ask what i do for work. i tell them that i draw letters. \"\n\nWhen I say stuff like that, I get answers like, \"You mean people actually do that?\"  \n:-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\> the trick is to keep working and squeezing out incremental improvements\n\nAnd/or gush out quantum leaps, which allows a large savings in years. :-)\n\nA while back a friend of my wife glimpsed me drawing letters. When she asked and I explained, she said \"Oh, that's cute\", which of course made me want to slap her. Her husband once had a high-flying real estate business, and she was a shopaholic. Now he's in jail, and she's disappeared...\\* Which reminds me of a recent ref by M Carter to a fictional story about a criminal type designer; it's in a book of short stories by Ron Carlson entitled \"Hotel Eden\" - the other stories are interesting as well (and they're the first fiction I've read in quite a long time - another symptom of designing type).\n\n\\* Major schadenfreude - mea culpa.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_She said “Oh, that’s cute”, which of course made me want to slap her._\n\nI think that's the main problem with type being undervalued, at least in the states. The masses tend to think of type as merely an aesthetic option and don't realize more goes into it than that (in text faces at least).\n\n"
    },
    {
      "time": "",
      "content": "The other problem, is that those of us who sit to do the type within 10-12 hours a day, make it appear so easy. We have lost the respect of the outside world who will step on/spit on - and don't understand the talent or hours that are spent on each job. (In this case type design, in others, just design itself.)\n\nYes, not only do we spend so many hours in front of a screen and a keyboard - we suffer for it with lack of exercise and fresh air.\n\nAddition: or give up valuable downtime - because someone needs it NOW -- and our rest periods do not count toward our healths - ever notice how everyone else's priority is more important than your own?\n\n"
    },
    {
      "time": "",
      "content": "Get kids (or at least a dog) and your health will improve greatly! Well, not counting the first few months (apparently sometimes going well past a year, dammit) of not getting any sleep...\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "<cite>She said “Oh, that’s cute”, which of course made me want to slap her</cite>\n\nI have never had that reaction! People are generally really interested & respectful when I tell them.\n\n<cite>“forces” me to be creative</cite>\n\nI understand this. Nothing like a deadline to get the juices flowing! It is just really hard to impose a deadline onto yourself, especially for type design, as it could just go on forever…\n\n& for the record, I think I average 10hrs/day designing type.\n\n—K\n\n"
    },
    {
      "time": "",
      "content": "Get to the top? I am reminded of a hilariously profane debate on The Wire about the genius that designed the Chicken McNugget:  \n [http://www.youtube.com/watch?v=kGknlEWjxZc](http://web.archive.org/web/20100926045031/http:/www.youtube.com/watch?v=kGknlEWjxZc \"http://www.youtube.com/watch?v=kGknlEWjxZc\")\n\nLong hours or not, design is no way to get rich. Believe.\n\n"
    },
    {
      "time": "",
      "content": "_I have never had that reaction! People are generally really interested & respectful when I tell them._\n\nI smiled when I read this because I knew you didn't live in America. Paul's right about being undervalued here in the states...I would go as far as saying design in general is. Just compare design Ph.D programs in the states with that of Europe.\n\n"
    },
    {
      "time": "",
      "content": "This is very encouraging to hobbyists like myself who would like to design and produce one or two typefaces in their lives. At this rate, I'll be ready to show my work in about 40 years. Crud. By then we won't even be using TT/OT/whatever.\n\n"
    },
    {
      "time": "",
      "content": "\"(apparently sometimes going well past a year, dammit) of not getting any sleep…\"\n\nLOL every time I consider the possibility of having another baby, it's not the thought of going through labour that changes my mind, it's remembering that I get to be sleep deprived for over a year. And then I think, nah, I'm too old for that.\n\nAs for work ethics, if deadlines didn't exist I would never get anything done. I do my best work under pressure--but not so much that I can't see straight. Just enough to add some adrenaline.\n\nK.\n\n"
    },
    {
      "time": "",
      "content": "Having 2 kids is 4 times as consuming as having just one. Kids have a way of timing things so that a moments rest is never to be had. Those so precious moments when they are snuggled in your arms are worth it though. One gummy grin can melt away a weeks worth of exhaustian :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "It's definitely exponential and not linear, but one way we're lucky is that our older one superbly entertains the little one. Often when we need some \"off time\" to do something or when we're simply at wit's end, we'll bark: \"Hrad, do something or other with Goryune!\"\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": ":) Yes, and then the older one figures out quickly enough that \"go do something with Zach\" can become, if well-orchestrated, a chance to torment and torture him while mom is busy.\n\nBut yes, it is all worth it. They melt hearts, only I'd have to get a mini van. I doubt three car seats would fit in the back of my little silver bullet. ;)\n\nK.\n\n"
    },
    {
      "time": "",
      "content": "\\> I’d have to get a mini van.\n\nThe horror.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "I think those Canadians are just wack. Don't cut my nuts off for saying this but the design of Type just ain't worth it.\n\nIt's all been done before hasn't it? We already have lots of great typefaces. What I mean to say is, what's the use of one more friggin font? It's not like Type can temper our nature - _or can it_?\n\nBut if you want to build a successful business selling your own designs then you're being driven not by Type - but by having a sustainable business. And building your own business can consume 24/7.\n\nIn fact, it can put you in an early grave.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "",
      "content": "There's plenty to explore in type. If you don't feel driven to do that, or even worse, try to turn something you enjoy into a business, you will likely get a lot more sleep.\n\nOr, you can do what I did. Ditch the hair. Saves shampoo, too.\n\n"
    },
    {
      "time": "",
      "content": "<cite>I think those Canadians are just wack. Don’t cut my nuts off for saying this but the design of Type just ain’t worth it…It’s all been done before hasn’t it</cite>\n\nAre you being deliberately ignorant? Have you tried applying hat same train of thought to every other art?\n\n—K\n\n"
    },
    {
      "time": "",
      "content": "<cite>It’s all been done before hasn’t it? We already have lots of great typefaces. What I mean to say is, what’s the use of one more friggin font? It’s not like Type can temper our nature - or can it?</cite>\n\nDo you like to eat the same food every week? And listen to the same ten records you got, over and over again?\n\n"
    },
    {
      "time": "",
      "content": "<cite> She said “Oh, that’s cute”, which of course made me want to slap her</cite>\n\nThats make me remenbering two weeks ago, I had to choose which one (about my two letters) is the best, and I saw my neightbor outside so I went outside and asked Kim about my letters, whitout hesitation she gaved me a answers (I like when people can tell whitout hesitation) but on a other hands, she was looking at me like, you spent your week-end drawing L E T T E R ' S !!!!!!\n\nShame on me -LOL-\n\n"
    },
    {
      "time": "",
      "content": "Hiro may have been putting us on.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\> It’s all been done before hasn’t it?\n\nThat's never true in any field.  \nIn type, Legato for one proves that's wrong.\n\n\\> But if you want to build a successful business selling your own  \n\\> designs then you’re being driven not by Type - but by having  \n\\> a sustainable business.\n\nIt's never one thing. I would say that one's career path depends most on:  \ncircumstance; financial necessity; moral/social responsabilty; and passion.  \nFor example prostitution arises most strongly from the first two, while type  \ndesign arises mostly from the first and last.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_It’s all been done before hasn’t it?_\n\nYou must have missed the \"Softmachine Launched\" thread.\n\n_But if you want to build a successful business selling your own designs then you’re being driven not by Type -- but by having a sustainable business._\n\nI don't think the two are incompatible. I've found that at least part of the time, being my own boss enables me to design whatever the f\\*ck I want, \"driven by type\", and there's usually someone somewhere who considers it useful and worth licensing. The tail is long.\n\n"
    },
    {
      "time": "",
      "content": "Dez, yeah hence my italicized \" _- or can it?_\"\n\nIn the right context and when Type is done well - it has had, and will continue to have, an enormous impact. And what's the worth of that? I for one believe you reap what you sow, and Type is well worth a life's devotion.\n\nNick, try selling complete sh\\*t - and you'll quickly get to the truth of _\"...being my own boss enables me to design whatever the f\\*ck I want,\"_ . Nice rhetoric, but that dog won't hunt.  \nAnd I didn't see anything important/original with your Softmachine - sorry bro, it's a commercial bastardization of great work done way back. And we're now getting to the truth of 'The business of Type'.\n\nI can imagine that soon there'll be computer programs which will be able to create typefaces from taking characteristics from any of the thousands and thousands of typefaces already in exsistance. The program will be able to cough-up another face simply by combining features and the user will be able to tweak the 'design' at their will.\n\nIf you want to design an important/original typeface, then design of our time. Show something of ourselves never seen before. And that will involve putting Type ahead of business.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "",
      "content": "Softmachine is interesting (although Advert Rough is prototypical of its core concept) and it's certainly conceptually, if not stylistically, more original than most fonts, which is saying a lot. Nick is taking -and generally takes- too much credit for originality, which is typical of the artistically inclined, but that's not nearly as bad as not being original at all. Nick and his Softmachine are ahead of the pack. Pick on the real bores instead.\n\n\\> putting Type ahead of business.\n\nIndeed, culture and materialsim are opposed - anybody who says otherwise is a deluded apologist for materialism. This however does not mean that each one of us stikes -indeed cannot avoid striking- some balance between the two - very often a precarious one, in one direction or the other. Balance is hard, not least because it's dynamic - if you ever stop vying for it, things are guaranteed to tip over. And this is why an eternal student is the only way to be.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_Nick, try selling complete sh\\*t - and you’ll quickly get to the truth of “…being my own boss enables me to design whatever the f\\*ck I want,” . Nice rhetoric, but that dog won’t hunt._\n\nWhile I wouldn't categorize any of my work as complete sh\\*t, things don't always turn out as expected, and following an idea for a typeface to its conclusion doesn't always result in what I would consider great usability. However, I'm not the one who ultimately decides on usability, and the classic example of that is the art directors who take micro type (Bell, Freight Micro) and use it in completely the \"wrong\" way, huge.\n\nAs a business model, I subscribe to the notion that I should make many fonts, and have many distributors. Potentially, my market is over half a billion computer users, and the internet reaches worldwide. So, according to the \"long tail\" theory, there is always someone somewhere who will see something in the obscure end of a product line, and the outcome is that the big sellers don't account for the majority of sales. Surely the Long Tail theory is borne out by the proliferation of foundries at Myfonts?\n\n_And I didn’t see anything important/original with your Softmachine - sorry bro, it’s a commercial bastardization of great work done way back. And we’re now getting to the truth of ‘The business of Type’._\n\nI'm sorry you are so jaded that you fail to recognize genuine originality. As far as I am aware, nobody has previously made a font specifically for digital outlining, despite that effect having been around twenty years; and no type designer has used contextual alternates to optimize the appearance of stroking. These features may not be a big deal, but they are original. Yes, it's \"commercial\", but aren't all published fonts (except freeware) -- so that's not much of diss. And bastardization? Well sure, I didn't invent rounded type! -- but I drew Softmachine from scratch, not based on any particular model. Would you care to mention the sources which you think I ripped off?\n\n_If you want to design an important/original typeface, then design of our time. Show something of ourselves never seen before. And that will involve putting Type ahead of business._\n\n ![](http://web.archive.org/web/20100926045031im_/http:/typophile.com/files/soft462b_3915.png)\n\n"
    },
    {
      "time": "",
      "content": "_i tell them that i draw letters. they ask what i do for fun, and i tell them that i draw letters. it does kind of consume you, if you let it._\n\nIt's like anything where passion is a large part of one's _raison d'être_ -- I get that sometimes when I'm asked about making books.\n\n\"You mean you write Harlequin Romances?\"\n\nAh, no....\n\n"
    },
    {
      "time": "",
      "content": "In the neighborhood where I grew up, making books would have been considered a respected profession; \"Hey den, hah baut yinz puttin' 10 bucks on dat nag Phillie Fiend in dah 4th den whud'ya?\"\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\> Surely the Long Tail theory is borne out by  \n\\> the proliferation of foundries at Myfonts?\n\nMaybe. But that phenomenon could also be explained by the coupling of the recent so-called \"democratization\" of type design with the long-standing \"ennuie of the affluent\" in the West.\n\n\\> nobody has previously made a font specifically for digital outlining\n\nTo repeat from the Softmachine thread: it seems like this is not true, since the layering of purposefully-spaced weights is effectively the same as outlining.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_In the neighborhood where I grew up, making books would have been considered a respected profession_\n\nBe grateful you're not a person who does rugs with a latch tool.\n\nBetter to be a bookie than a hooker.... ;-)\n\n"
    },
    {
      "time": "",
      "content": "_it seems like this is not true, since the layering of purposefully-spaced weights is effectively the same as outlining._\n\nBut it is true, because layering is a quite different process than outlining, requiring overlpapping text boxes or layers, which are much more of a hassle to work with than creating an outline by applying a stroke value. For instance, if you decide to edit the text, or adjust the size, or kerning or tracking in a layered setting, you have to do so in each and every layer, and that multiplies the confusion between stroke and fill button choices. There may also be problems with layer alignment, caused by the layout application's interpretation of character placement. Furthermore, layering is not infinitely adjustable, whereas stroke width is. These are significant practical differences.\n\nAnd finally, the lower case character shapes and general proportions of Softmachine were designed specifically to accomodate an outline stroke of precise thickness.\n\n"
    },
    {
      "time": "",
      "content": "Hiroshige who the \\*\\*\\*\\* do you think you are coming into a placve like this and slagging type design? Prick.\n\n"
    },
    {
      "time": "",
      "content": "keep in mind Nick said **part of the time** he gets to do what he wants. Which is better than some jobs...\n\n\"Yeah, boss, I think after lunch I'm gunna take a few hours to dig a ditch over there instead of here like you said. I just have a feeling that it would be good. Whahdya mean 'fired'?\"\n\n"
    },
    {
      "time": "",
      "content": "This is getting too off-topic, but...\n\n\\> layering is a quite different process than outlining\n\nMechanically they're different, but the result is pretty much the same; a graphic designer is simply given a different way to do a very similar thing (and what else is new?). The advantage of outlining is indeed convenience, but: layering isn't as complex as you describe - all you need is to copy-paste the text box in place and change the font (assuming a set-up like Advert Rough where the fonts are spaced with that purpose); multiple weights allow the designer to design the outline, not leave it to a dumb algorithm; and the different weights provided in a layered scheme are: more fool-proof, in that a user is much less likely to apply tracking to a fatter version (since in layering the fonts are canned while in outlining they're sort of made by the end-user anyway) thus ruining your careful spacing; and being available as different weights, are more... convenient!\n\n\\> layering is not infinitely adjustable, whereas stroke width is.\n\nTrue, but:  \n1) It's not hard to provide a finely gradated weight range.  \nAnd hey, people will think they're getting more for the money. :-)  \n2) There's an upper limit to how much outlining one would use: beyond a certain point there's no whitespace left between the letters, so your scheme becomes moot.\n\n\\> the lower case character shapes and general proportions  \n\\> of Softmachine were designed specifically to accomodate  \n\\> an outline stroke of precise thickness.\n\n?  \nHow does that jive with your \"infinitely adjustable\"? And how does a user know what that precise thickness should be? Don't tell me you expect graphic designers to pay attention... and then actually follow advice to boot! :-/\n\nAnyway, don't get me wrong, outlining is probably a more cost-effective way of getting typically-desired results, but it does seem to be more brittle (opposite of robust) and less powerful than layering.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Getting back on topic, I agree the main key here is having the passion as so many others mentioned earlier. If you really love what you do and allow that creative force driving you, you don't think much about the time invested.\n\n"
    },
    {
      "time": "",
      "content": "Too put this into context, does any of this make it more efficient, so that a designer doesn't have to work into the middle of the night?\n\n"
    },
    {
      "time": "",
      "content": "Dan I think you're referring to something called the 'work/life balance' here, and it's something that artisans and craftspeople of all stripes generally have a difficulty with. It might sound awful, but there are any number of 'personal lifestyle coaches' out there who will take your money in return for telling you not to work so late into the night...\n\nI used to work very hard all day, every day, when I was a freelance designer; I still work hard, but nowadays I'm more interested in having a workload that's compatible with my life. Having said that, a particular project like a typeface deserves to be worked on intensively.\n\nIf you've set yourself a personal deadline about finishing or releasing your type design, whilst meeting your other commitments, then pulling a string of all nighters is probably the only way it's going to get done.\n\n"
    },
    {
      "time": "",
      "content": "\"So what’s the scale? What’s reasonable? I understand that it takes a long time to create a typeface, but there’s got to be a line somewhere...\"\n\nOh? the only lines I've ever drawn on time and effort end up on my face. The hours per day, I see as more related to the physical state, the mental state is an hours per career thing, as far as I know. e.g. I finished some fonts last year that I started in 1997. This year, I will finish some fonts I started in 1999 and I'm starting fonts now that might not be finished until 2011, or so.\n\nThe big thing is to get over hump between rolling eyes, and knowing nods, for support on these long typographic trips.\n\n"
    },
    {
      "time": "",
      "content": "Greetings everyone!!!\n\nThis is my first post on this cool website!!!\n\nI work 10 hour days in central London, try not to work weekends but it happens esp if there's a deadline looming...!\n\n"
    },
    {
      "time": "",
      "content": "Dan, sometimes it is fun to be drawn in to long nights and obsessive sessions, other times it is not. If the passion of type is in you, I tihnk you should indulge them occasionally. Just like excess, moderation is only healthy in moderation.\n\nSome nights, I am up until 4:30 am, when I've got to bright-eyed and bushy-tailed at work in 3 1/2 hours. If I am enjoying AND productive AND have the mental acuity to make that time worthwhile, I think thats good. But I can't do or recommend it everyday. Everyone has their limits.\n\nKeep in mind, this is supposed to be largely for fun for me.The dry work and the file wrangling is a side affect of trying to make something impressive enough to appear as viable product to others. IT isn't the type design at all.\n\nIf I am kerning accents for a language I don't speak, or tediously working round a clumsy part of a software-work flow by manually repeating an action, I tend to call it quits earlier. I can usually do that stuff far faster when I start my work period, and my mood will be better, too.\n\nIf you have a girlfriend, make time for her. If you don't want to, and you'd rather do type, why are you (hypothetically) dating? If you are certain about type, think about what you want to get out of it. \"Name in lights\", a paycheck, the respect of peers, mad experiments, a teaching job, some cultural impact, what? Each of those requires a different level of commitment. Or, more precisely, different commitments.\n\nAs far as the earlier comments about creativity under deadlines: A deadline helps to separate the wheat from the chaff asap, when a goalless creative exercise might otherwise drag on, hindering following ideas. Additionally, creative solutions often come from the limits in place from a client. \"Deadline\" creativity's productiveness compliments abstract creativity's loftiness.\n\n"
    },
    {
      "time": "",
      "content": "_And bastardization? Well sure, I didn’t invent rounded type!_\n\nYeah!, that's exactly what I'm talking about Nick. Like in every other field of design there are those who break new ground and then those who follow (or worse). It's the authorship of the rounded type which is at one end of designing type and then there is your Softmachine which is at the other end. You know what I mean?\n\nThe guy who created rounded type poured his whole being into breaking new ground in the design of type (and I imagin also that his designs spoke of his time, ie Bayer and the school of Bauhaus). So when you came up with your Softmachine your design effort was far less than his, no offense ok? And from the description you gave of vector stroking, can't that be applied to any class of type?\n\nNick, I hold many copyright designs and several industrial design patents. I was given my first architectural award when I was twenty-seven and was then labelled avant-garde and a visionary. I know first hand (as did my father before me) the price one pays to give their life to design/art. And from what I've been able to find out about the masters in the design of Type - so did they. They would rather design than eat.  \nAnd since I have just recently been involved in the design of Type I have done a couple of font designs (which are no big deal) and I'm currently working a bold new method of script type, which I think is a big deal - although somewhat unusual.\n\nDan's question of commitment is not so black and white, because as I mentioned before to tweek someone elses work is one level of design commitment - and to come up with new forms is an entirely different level of commitment to the design of Type.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_  \nHiro\n\n"
    },
    {
      "time": "",
      "content": "Oh, you're an architect...\n\n\\> from the description you gave of vector stroking,  \n\\> can’t that be applied to any class of type?\n\nYou're not paying attention.  \nRead the Softmachine thread/PDF first.\n\n\\> I hold many copyright designs and several industrial design patents.  \n\\> I was given my first architectural award when I was twenty-seven\n\nIf you're so proud, please use your real and full name in your profile.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "Christ. Another hack architect trying to make 'fonts'. I bet it will be rubbish.\n\nMuzz\n\n"
    },
    {
      "time": "",
      "content": "_does that jive with your \"infinitely adjustable\"?_\n\nIt's true that there is a \"benchmark\" outlining weight for Softmachine, which corresponds to the closest distance between characters, carried through for internal counters -- and this stroke weight has to be set by eye for a specific type size (not without its benefits, for instance making it easy to give the type outline exactly the same stroke weight as rules). Nonetheless, the typographer has the option to choose absolutely any stroke width, for whatever reason, and there are other thicknesses which might suggest themselves, such as the distance between vertical strokes in the letters h,m,n and u. Ultimately, for whatever reason a typographer is outlining some type, such as to get it to stand out against a disruptive backround, the way of working is to adjust the stroke weight till it looks right, and that's why stroking is the best way to handle outlining, not layered weights.\n\nI might also add that the kind of gradient filter effects (bevel, dropshadow) in the garish \"gel\" specimen I posted above work on plain, not layered type -- and while this was not my initial anticipation of the type's use, its suitability was obvious early on.\n\nLayout application-generated outlining was behind this type from day one, because I've always considered that to be a much better way to apply special effects to type, rather than layering differnt fonts -- in fact this \"best practice\", initially developed as a faux feature of WP programs in the 1980s, was then introduced as a formatting utility via Quark Xtensions (Xtensis etc.) and add-on Photoshop filters (eg Alien Skin) in the early '90s, before it was \"hard formatted\" into the default menus of Quark, Photoshop, Fireworks, InDesign, etc. So that's what I'm playing to, not layers, which is a sort of do-it-yourself technique from the late '80s.\n\n_the authorship of the rounded type_\n\nRounded letterforms are not a typographic invention, but an imitation of other media.  \nThis could be said of a lot of typographic features, but it's important to distinguish the metrical-system dimension of type as being uniquely typographic, and that's the design space Softmachine addresses.\n\n ![](http://web.archive.org/web/20100926045031im_/http:/typophile.com/files/Round_6107.png)\n\nThis is the first rounded type I am aware of, from an 1830s specimen of Caslon & Livermore, presumably derived from brush lettering. Other non-typographic inspirations of rounded lettering are the \"Speedball\" nib, quite literally a rounded shape on the end of a pen nib, in the late 19th century. There is also neon signage, and Breuer's tubular-framed armchair, both introduced in the 1920s. And the ball-point pen (Biro, 1940s) and Rotring + template (1950s).\n\nIn criticizing my use of rounded letter shapes and terminals as unoriginal, you may be confusing form with function, which sets the bar impossibly high for originality, as everything looks like a bit like something else. The purpose of Softmachine's rounded terminals is to facilitate outlining -- by allowing an even stroke between characters, and by minimizing the opportunity for pointy artefacts that occur when corners are algorithmically enlarged: this is my claim for originality.\n\nSurely this principle -- function not form -- is something you can understand from your experience with design patents?\n\n_your design effort was far less than his, no offense ok?_\n\nNone taken. I'm in two minds about the \"design effort\" of the person who produced that Caslon example. Sure, it was swiped from the signwriters, but the type designer had his own problems in making the concept work typographically, in terms of fit and colour -- things which signwriters, working large and custom, could easily fudge. At any rate, the concept of a rounded type must have been quite outrageous at the time, _highly_ original, shall we say. But how does that discount the lesser, though quite specific, originality of my repurposing of roundedness?\n\n"
    },
    {
      "time": "",
      "content": "I want to take assertiveness lessons from Muzzer :)\n\n"
    },
    {
      "time": "",
      "content": "I do not know anyone (and am not sure I've ever known anyone) who works harder or longer than Robert Slimbach, over the long run. It's just scary.\n\nRecently I've been working maybe 13-14 hours a day in the last days of trying to finish the upright fonts for Hypatia Sans, but I think Miguel has been putting in even more hours than that. You know it's bad when somebody works until they just can't stay awake, then takes a nap, and gets up and works some more.\n\nI don't know that all this is at all necessary for the general task of making high quality typefaces. But I do think that being able to have at least some bursts of a minimum of 3-4 hours at a stretch is necessary for most kinds of high-quality typefaces.\n\nCheers,\n\nT\n\n"
    },
    {
      "time": "",
      "content": "\\> this is my claim for originality.\n\nIt's one of two such claims.  \nThe other is the less tenable.\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "So is that hard work, or just a lot hours of work? When I think of hard work, I think of breaking out a sweat throwing bales of hay on my farm when I was a kid. My dad works hard, 8 hours a day, and has the bad back and aching joints to show for it.\n\nI'm not saying that to undermine the skill needed to design type, but it seems that it's one of those things that the more you throw your time into it, the more you get out of it. Not that it's particularly \"hard,\" per se, but that it takes an incredible amount of time to produce anything worth showing.\n\nAm I totally off base?\n\n"
    },
    {
      "time": "",
      "content": "Hiroshige,\n\nReading over your comments makes me shake my head in wonder and pity. Your take is quite superficial I am afraid. The good news is that the world of type is a big amazing place and worth spending some time in. Here's hoping you take the trip.\n\n"
    },
    {
      "time": "",
      "content": "Dan, you are still completely on-base with this question IMO; on a good day I can break a sweat teaching, but producing a typeface is just really really time-consuming ; )\n\n_Hiro – And from the description you gave of vector stroking, can’t that be applied to any class of type?_\n\n_Nick S – ...initially developed as a faux feature of WP programs in the 1980s, was then introduced as a formatting utility via Quark Xtensions (Xtensis etc.) and add-on Photoshop filters (eg Alien Skin) in the early ’90s..._\n\nI was so appalled by seeing badly outlined versions of Futura in the early '90s that I went and drew up my own version of Futura Inline (– a face that had existed in metal, but had not been digitised or included in any of the standard foundry libraries of the time).\n\nI agree wholeheartedly with Nick for attempting to save people from the visible end results of their own ignorance, viz. _minimizing the opportunity for pointy artefacts that occur when corners are algorithmically enlarged_ and so forth. In that my little effort (a single weight of display caps, neither infinite nor adjustable) was not as intelligent or as elegant as Nicks, means that it was a labour of love rather than a commercial effort. No harm in that; I did it for the sake of the thing itself. All it meant was that for a while I would rather have seen it finished than sleep or eat.\n\nIt doesn't suprise me at all to hear that Robert Slimbach works as hard as Thomas says he does; may his stamina continue unabated (and yours, Thomas, and yours, Miguel)!\n\n"
    },
    {
      "time": "",
      "content": "You do have to work long hours and sometimes it takes a few hours to get a flow going. The time flies though! It is not hard work like bailing hay, it is tedious work and can be quite frustrating when things are not working but it has its own reward. I doubt if most people would feel it was rewarding but those who are meant to do it, will surely feel it--maybe after a good nights sleep though :-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "\\> attempting to save people from the visible  \n\\> end results of their own ignorance\n\nIf you really want to do that, you go further down the effort/robustness axis: layering. You provide a fine gradation of weights that are spaced to layer well, and you force the user to spend the time. More effort, yes, but more robust, since it results in something you've designed. And remember, apps can one day change some detail of the way they outline type!\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "_the effort/robustness axis: layering._\n\nIf a variety of weights were provided for layering, people would use them with the outline tool, as that's far simpler.\n\nThe beauty of using the outline tool is that experimenting with different stroke weights and tracking is so simple. This file took me a couple of minutes (and that includes experiments not shown), whereas with layering it would have been a pain.\n\n ![](http://web.archive.org/web/20100926045031im_/http:/typophile.com/files/Outlines_4031.png)\n\nHere, the top four vary the stroke weight against one tracking value, the bottom three vary the tracking against one stroke value.\n\nThe second example is the benchmark stroke thickness (note how the line continues into the counters of \"s\").\n\nThe stroke thickness of the third example is not that great, but there are nonetheless still many good ways to stroke and space the face.\n\nI had considered providing more weights of Softmachine, optimized for different stroke thicknesses, but a single font didn't seem like such a bad idea for starters. I put the \"extra\" work into providing an alternate stylistic set, and full Latin script support, rather than more weights. To return to the thread topic, it was enough work making one font -- it's unlikely I'll do any more extensions of this typeface (famous last words) unless they're commissioned, or it becomes wildly successful.\n\nBTW, I just noticed that InD turned off contextual alternates in the bottom example (reverting to the default \"l\"), which is tracked at +70. InD made the change between +21 and +22.\n\n"
    },
    {
      "time": "",
      "content": "\\> If a variety of weights were provided for layering, people  \n\\> would use them with the outline tool, as that’s far simpler.\n\nBut at least they'd have a choice, and in fact would be much less likely  \nto use outlining since the weight they'd want would already be on hand.\n\nAnyway, I'm sure you'll keep an eye on how people end up actually  \nusing Softmachine, and will implement the weight scheme if needed.\n\n\\> experimenting with different stroke weights and tracking is so simple.\n\nUsing Comic Sans instead of Softmachine is simpler too.\n\n\\> InD made the change ...\n\nBTW, what would be great (although not in the case of Softmachine - I'm thinking more for running text) is if Indy's \"optical scaling\" applied its algorithm <cite>after</cite> any manual tracking settings; this would make things like \"r\" space well even with tracking. Heck, that might even make Helvetica usable for a moderate amount of text! Well, a demi weight at a small size at least. :-/\n\nhhp\n\n"
    },
    {
      "time": "",
      "content": "You've started a great thread, Dan!\n\nI am not as experienced as most of the people posting here, but I agree with the comments that mention passion and stamina -- when you get into \"the zone\" time just flies, but you need stamina for the rote tasks and for all of the times that something isn't quite working. But when things do work, then it's very satisfying.\n\n"
    },
    {
      "time": "",
      "content": "\"...and for all of the times that something isn’t quite working. \"\n\nRemember, frustration is your teacher, not your enemy.\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "The flip side, what's the fastest an entire _quality_ typeface (Latin character set) can be created from scratch? None of this Scanfont baloney, but the real Bezier editing/kerning/formatting of an actual start-to-finish font. Or, what's the fastest design that you've heard of?\n\nSay, for instance, that [Robert Slimbach](http://web.archive.org/web/20100926045031/http:/typophile.com/wiki/Robert%2520Slimbach) takes 15 years to create an  \n\"instant\" masterpiece. That's one end of the spectrum. What's the other end?\n\n"
    },
    {
      "time": "",
      "content": "I recently finished two sans serif typefaces in 7 weights each, roman and italic, plus a serifed text face -- basic four styles -- all original from scratch, for a newspaper, in four months. Launching in May (so no jury decision on quality yet). Sixty-hour weeks, but it was winter, and a once-in-a-lifetime opportunity. My \"Guardian\", as it were.\n\nNext step is to extend them for general release in OpenType with CE, Greek, Cyrillic, small caps etc., which will take much longer -- especially as it's not commissioned, paying work.\n\nSo that's the context. Adobe first, and now Microsoft with the CT fonts, have raised the bar for character count and OT features, and what constitutes a \"quality\" typeface that's ready for market. And then there's hinting... It's harder and harder to do it all yourself.\n\n"
    },
    {
      "time": "",
      "content": "In the words of John Dunne, nothing focuses the mind like being hung at dawn. Unfortunately, I adhere a little too tightly to this homily at the peril of personal work (homily... not sure gallow clinkers would think it so insipirational -- maybe gallow humorists). Tangent\\\n\n"
    },
    {
      "time": "",
      "content": "Maybe with a slight edit, the gallows humorists would surely find it inspirational:\n\n\"Unfortunately, I feel [so strung up with this homily]...\"\n\n:-)\n\nChrisL\n\n"
    },
    {
      "time": "",
      "content": "Surely Samuel Johnson said that (or similar).\n\nTim\n\n"
    }
  ]
}
