{
  "id": "32258",
  "title": "Need help with MetaBook font(s)--way confusing",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I'm on a project in FrameMaker, and the client wants MetaBook-Roman for all the text. I paid for two separate downloads: a TrueType/OpenType version, and a second purchase of the Type1/Postscript version (for Macintosh). The second one almost works, but not quite.\n\nPROBLEM: MetaBookLF-Roman is a plain, sans serif font. No Bold or Oblique style options. MetaBoldLF-Roman is always bold, no oblique available. I cannot select specific words or phrases and emphasize their importance by styling them as bold or italic. I can choose the Underscore style, but that's not the emphasis I prefer.\n\nSOLUTION: Buy a third version of the font for $229 and hope it provides the style options I'm accustomed to.\n\nQuestions: Does anyone know where I can buy the $229 version? Can anyone report that the $229 version does allow styling to be imposed manually?\n\nI really don't understand the trimmed version of my post. Hope it all gets through. Thanks, and if this is the wrong question for this audience, never mind..... --Scottie\n\n",
  "author": "<a href=\"/web/20120107040931/http://typophile.com/user/17419\" title=\"View user profile.\">Scottie Zimmerman</a>",
  "time": "<br>",
  "uid": "17419",
  "comments": [
    {
      "time": "",
      "content": "What you probably want is [FF Meta 1](http://web.archive.org/web/20120107040931/http:/www.fontshop.com/showfont.cfm?fid=FF.11025.0.0) which includes Book, Italic, Bold, and Bold Italic fonts. Click the \"Add Package to Cart\" button.\n\n"
    },
    {
      "time": "",
      "content": "I really hesitate to answer, because I don't know FrameMaker at all. I thought it was a pretty sophisticated program, and would support OpenType. But whatever.\n\nWhat is confusing is the statement that the client wants only ROMAN. You mean they won't accept italic, but would accept a sloped roman? If that is true, and if FrameMaker won't allow you to slope the roman (even as a PostScript command), I'd think you are out of luck, as FontFont doesn't make a \"sloped roman\" Meta, just an italic.\n\nThere are other ways to emphasize words, of course -- letterspaced small caps being one, but all have their downside.\n\n"
    },
    {
      "time": "",
      "content": "Not sure why you bought a Postscript version for Mac when the Opentype version works on both Windows and Mac.\n\nMeta is available at fontshop.com. All you purchased is one weight, the roman. The Bold and Italic are separate weights because the designer(s) have to redraw all the characters for each weight, requiring extra work and thus justifying charging separate prices for each weight.\n\nThe $229 price is for a package of weights, typically between 4-8 weights. Usually the package is cheaper than buying all the weights separately (buying in bulk if you will). I would recommend the Opentype version because you will have a huge amount of characters in one font (oldstyle characters, lining figures, smallcaps). Even if Framemaker doesn't support all the Opentype features that Adobe CS2 programs do, it still makes sense for when you eventually upgrade.\n\nAs for the client specifying \"Meta Roman,\" I think they just mean Meta and that most of the text be set in Roman.\n\nMeta Opentype version at $235  \n [http://www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufac...](http://web.archive.org/web/20120107040931/http:/www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufacturer&displayfontid=FF.11560.0.0 \"http://www.fontshop.com/?fuseaction=catalog.fontpackage&searchby=manufacturer&displayfontid=FF.11560.0.0\")\n\n"
    },
    {
      "time": "",
      "content": "Your answer is helpful. One factor in all this is that Adobe has stopped developing FrameMaker for the Macintosh. The Mac version I have is 7.0, and there's a Windows version 7.2. I don't know whether the fact that I'm on a Mac platform makes a difference. I have tried the OpenType version of MetaBook, and it does work in Frame, EXCEPT for the apostrophe and quotation mark characters. Perhaps because I have smart/curly turned on?\n\nI see now that the only way to get what I want is to spend the $229.\n\nThanks for your response to my question. --Scottie\n\n"
    }
  ]
}
