{
  "id": "32277",
  "title": "Bitmapped sans \"Your IP Address\"",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "I need help identifying the font in the attached image. Please & Thank you.\n\n| Attachment | Size |\n| --- | --- |\n| [what-font.gif](http://web.archive.org/web/20110303004831/http:/typophile.com/files/what-font.gif) | 1.06 KB |\n\n",
  "author": "<a href=\"/web/20110303004831/http://typophile.com/user/17433\" title=\"View user profile.\">bones</a>",
  "time": "<br>",
  "uid": "17433",
  "comments": [
    {
      "time": "",
      "content": "Nevermind, the 'A' doesn't match, for starters...\n\n"
    },
    {
      "time": "",
      "content": "Nevermind what? The \"A\" doesn't match what? What wasa the point of your post?\n\n"
    },
    {
      "time": "",
      "content": "Nevermind what? The \"A\" doesn't match what? What was the point of your post?\n\n"
    },
    {
      "time": "",
      "content": "Wow... sorry about that. I was putting forward a suggestion but you blow it out of proportion...\n\nI had said it was BitStream Vera Sans Mono, and I'm afraid that will be your best bet. The font in your sample is included in the GD package and I've been searching for an hour for a download but nothing comes up. Too bad it was all in vain and that your attitude is a bit lacking.\n\n"
    },
    {
      "time": "",
      "content": "I blew what out of proportion?\n\nYou posted, \"Nevermind, the ‘A’ doesn’t match, for starters…\"\n\nThat is all you posted. What am I and the other readers of this thread supposed to think about \"Nevermind, the ‘A’ doesn’t match, for starters…\"\n\nYes, I have a bad attitude when mindless dolts type meaningless & pointless posts.\n\nToo bad you're lame and this site is a bit lacking...\n\nDelete my account with typophile.\n\nI have that font by the way & that is NOT it..\n\n"
    },
    {
      "time": "",
      "content": "I'm sorry. The problem is this forum doesn't include a message when you edit a post... As I said, I had initially suggest Vera Sans, but then realised that the 'A' doesn't match for starters.\n\nI still continued looking for an hour and, as I mentioned above, it is a default font included in the GD package. Tried looking for a download, as it is one of the XFonts for \\*nix but nothing came up I'm afraid. If you know how to compile the fonts from the C source code, you could download the GD library and take it from there.\n\nI would have preferred it if you hadn't called me mindless, as my post was an indication that I was trying to help you.\n\n"
    },
    {
      "time": "",
      "content": "Dear Bones, I'm quite surprised at how you made a pretty harmless misunderstanding explode in a mere two posts. I think it is pretty clear that Vincent thought he recognised the typeface you wanted identified, but realised he was wrong. Your double-post made Vincent suppose your reaction was overblown. Clearing up that misunderstanding would've been far more constructive than starting to insult him. We're a very civilised forum, and I really don't like how you handled this situation.\n\n"
    },
    {
      "time": "",
      "content": "And Vincent, maybe next time add an [edit] to your post to avoid any misunderstandings. ;^)\n\nBTW The fact that both his comments are registered at the exact same time should've told you this was an unintentional double-post, not a aggressive one.\n\n"
    },
    {
      "time": "",
      "content": "I know Yves. I only realised it too late; after realising I'd ID'd it wrong I went to look for a match. I knew where to start (GD) but I didn't know when to stop :-). Got a bit caught up in the moment lol.\n\n"
    }
  ]
}
