{
  "id": "3229",
  "title": "Typeface suggestion for a thesis and other written material",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello!   \n   \nI'm an undergrad design student about to enter my final year of university, and I was wondering if I could get a few suggestions on a serif and sans-serif combination that could be applied consistently to the written work I'll produce this year. I've been using FF Scala and Scala Sans for the past few years to set my formal texts, and while they have served me well, I'm looking for something different.   \n   \nSome basic criteria:   \n\\* Work well in shortish texts (\\<1000 words) and longer texts (~3000 words up to a 10,000 word thesis).   \n\\* Combine well together, but also able to stand on their own. On occasion, I might want to set a short document entirely in the sans-serif face.   \n\\* Versatile enough to be used in a standard-sized document, the occasional large-format poster, and the very-occasional slideware presentation.   \n\\* Combine well with the images I'll be using this year: namely, interface mockups and screen grabs, various diagrams, and maps and photos of urban environments.   \n   \nAs way of additional reference, the project I'm working on this year is technology-based, utilizing a mobile computing device hooked up to a GPS unit and connected to the internet. The written material will draw quite heavily on such areas as: urban and spatial practices, architecture, the city in art, design and literature, new media theory, anthropology/sociology, Deleuzian philosophy, interaction design/human-computer interaction, information visualization, mapping/cartography.   \n   \nAny help very much appreciated!\n\n",
  "author": "ben",
  "time": "20 Feb 2004 — 9:16am",
  "uid": "3109",
  "comments": [
    {
      "time": "21 Feb 2004 — 8:46pm",
      "content": "You might consider Sabon for the sans serif. It doesn't require ligatures,   \nwon't give your readers eyestrain at low resolution, and would probably   \nlook okay with the Scala Sans you have been using. It will seem vaguely   \nFrench to the Deleuze crowd. I don't think your fonts should show off --   \nyou want something that won't get in the way of the content of your writing.\n\n"
    },
    {
      "time": "21 Feb 2004 — 8:49pm",
      "content": "Oops, I meant Sabon for the serif of course.\n\n"
    },
    {
      "time": "21 Feb 2004 — 9:02pm",
      "content": "I'm a fan of Eric Gill, so I've been wanting to see Gill Sans and Joanna paired together, but I always feel that both of these faces are a little more on the display side and am not sure about how legible either would be for long blocks of text. Anyone wanna weigh in on this suggestion? i'd like to hear yer thoughts on whether this'd work (i hope this doesn't derail your thread, Ben!)   \nP.S. I just checked out Scala&Scala Sans (I wasn't familiar with the faces befor I posted, sorry) and it seems to me that Scala&Scala Sans have a lot in common with Joanna and Gill Sans (but i could be wrong) so if you're looking for something of a different look, I guess my suggestion wouldn't work that well.\n\n"
    },
    {
      "time": "22 Feb 2004 — 2:21am",
      "content": "How about [Fedra Serif](http://web.archive.org/web/20131019044444/http:/www.typotheque.com/fedra_serif/index.html) and [Fedra Sans](http://web.archive.org/web/20131019044444/http:/www.typotheque.com/fedra_sans/index.html) by Peter Bilak?\n\n"
    },
    {
      "time": "22 Feb 2004 — 4:39am",
      "content": "Thanks Nicolai! Fedra Serif A and Fedra Sans (leaning slightly to Alt) look near perfect for my needs: versatile, fresh and contemporary, yet unobtrusive and readable. A bit pricey for my student budget, but I think I'll manage. Tops my shortlist, for the moment at least.   \n   \n//   \n   \nThanks t christensen! I was considering Sabon, I'm just a little unsure if it fits the character of my thesis completely.   \n   \n//   \n   \nPaul:   \nI like Eric Gill too! I'll have to rule Gill Sans out though – it's bundled with OS X and its ubiquity is steadily increasing. I personally don't like Gill Sans used in anything longer than a short single page document. And I couldn't use it without thinking of Edward Tufte ( [http://www.edwardtufte.com/](http://web.archive.org/web/20131019044444/http:/www.edwardtufte.com/)) or the London Underground. :-)   \n   \n//   \n   \nOn a related note, I was browsing though a few related theses, and these are the typefaces used in a few of them (at least, the theses which bothered to pay attention to type):   \n   \nScala Sans   \nInterstate   \nAkzidenz Grotesk   \nMeta   \nFrutiger   \n   \nTheMix   \nRotis SemiSans (used in body text, urgh... difficult to read!)   \n   \nScala   \nSabon   \nPlantin   \nVendetta   \nMelior\n\n"
    },
    {
      "time": "22 Feb 2004 — 6:09am",
      "content": "_\\>I'm a fan of Eric Gill, so I've been wanting to see Gill Sans and Joanna paired together, but I always feel that both of these faces are a little more on the display side and am not sure about how legible either would be for long blocks of text._   \n   \nPaul, I might (somewhat immodestly) suggest Whitman in place of Joanna for any long text. (Whitman PDF specimen available at [www.kentlew.com/Type](http://web.archive.org/web/20131019044444/http:/www.kentlew.com/Type/).)   \n   \n_The Virginia Quarterly Review_ was just recently redesigned by Percolator and now uses Whitman and Jeremy Tankard's [Bliss](http://web.archive.org/web/20131019044444/http:/www.typography.net/) paired together. The combination is reminiscent of what you suggest, but (to my eye) much less idiosyncratic, more readable.   \n   \nBen, I don't know that these would necessarily suit your needs. I'm mostly just responding to Paul.   \n   \n-- K.\n\n"
    },
    {
      "time": "22 Feb 2004 — 7:32pm",
      "content": "Great idea - I love both typefaces. Can we see a sample anywhere on line of them together?\n\n"
    },
    {
      "time": "23 Feb 2004 — 4:55am",
      "content": "William --   \n   \nThe _VQR_ website is at [www.virginia.edu/vqr](http://web.archive.org/web/20131019044444/http:/www.virginia.edu/vqr). But there are no samples of the print journal online. (The website still seems to use Gill Sans for text gifs.)   \n   \nBesides, online could not do justice to the wonderful production of the _VQR_ -- the proportions, the finish and color of the paper stock. It's not just about typeface pairing; the whole thing works together to make all its parts more beautiful.   \n   \n-- K.\n\n"
    },
    {
      "time": "23 Feb 2004 — 6:08pm",
      "content": "So you have taken a look at Thesis Sans and Thesis Serif?   \n   \nFor serif, maybe Dolly?   \n [http://underware.thirstype.com/fonts/dolly/](http://web.archive.org/web/20131019044444/http:/underware.thirstype.com/fonts/dolly/)\n\n"
    },
    {
      "time": "5 Dec 2005 — 9:45pm",
      "content": "Nice font, [nasty EULA](http://web.archive.org/web/20131019044444/http:/www.typotheque.com/site/static_pages.php?id=14).\n\n_6. You agree that any derivative works created by you from the Typotheque Font Software, including, but not limited to, software, EPS files, or other electronic works, are considered derivative works under the Law of the Netherlands and use of the derivative work is subject to the terms and conditions of this License Agreement. Derivative works may not be sublicensed, sold, leased, rented, lent, or given away without written permission from Typotheque. Typotheque shall not be responsible for unauthorized, modified and/or regenerated software or derivative works. Embedding of the Typotheque Fonts Software in any form is strictly prohibited without an additional license._\n\nSo any document or electronic image that you produce with typefaces from Typotheque belongs to them. This EULA is one of most egregious I've seen.\n\n"
    },
    {
      "time": "6 Dec 2005 — 10:41am",
      "content": "\\>So any document or electronic image that you produce with typefaces from Typotheque belongs to them.\n\nNo. They just don't want their fonts distributed via embedding, which is mainly MS Word and PDFs. Documents and images created in inDesign, Photoshop, etc. don't embed fonts, so they're not an issue.\n\nMS Word is very problematic, because a document with an embedded font can be distributed to a corporate network, thereby installing the font on all terminals of that system, which may not be licensed for the font.\n\nIt would be like if you download an image file made by Photoshop, and bingo, the Photoshop application is installed on your computer!\n\n"
    },
    {
      "time": "6 Dec 2005 — 12:10pm",
      "content": "So you can't distribute a .doc or .pdf file (two ubiquitous formats) if those files contain the font for which this EULA is written?\n\nNot too good for corprorate clients (or really any, for that matter.)  \nIt's basically cutting off your nose to spite your face.\n\nOr is there a way to \"lock in\" these fonts to the file in order to prevent distribution? Perhaps I'm misundersatnding.\n\n"
    },
    {
      "time": "13 Dec 2005 — 11:05am",
      "content": "\\> They just don’t want their fonts distributed via  \n\\> embedding, which is mainly MS Word and PDFs.\n\nDid you miss the EPS bit? Since a font cannot be embedded in an EPS, it implies you can't even do a convert-to-outlines! The Emigre EULA has that problem too (in fact it's much more explicit about it). This is of course ludicrous, to the point of fascism.\n\nClaire, talk to Peter about it.  \nI can assure you he's much much nicer than his EULA.\n\nUnfortunately a EULA is a necessary evil.  \nBut sometimes it can make a person evil.\n\nhhp\n\n"
    }
  ]
}
