{
  "id": "32335",
  "title": "Comments about Anchorage, Alaska logo design contest?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m curious what the typophiles think of the idea to have a design contest for a new logo to represent the city of Anchorage, AK. The logo they paid thousands for (I think 200k!) is a [big brown splat,](http://web.archive.org/web/20070329121523/http:/www.bigwildlife.com/) and people just HATE it. I can’t tell if the pixelation is intentional or not?\n\nRestrictions? Must be a resident of Anchorage to submit work.  \nThe prize? “An unspecified package of Alaskan items worth $3000.”\n\nIMHO, and in the name of good design, we should pepper the forum with our take on such contests … [http://community.adn.com/?q=adn/node/100260](http://web.archive.org/web/20070329121523/http:/community.adn.com/?q=adn/node/100260)\n\nAK\n\n",
  "author": "<a href=\"user/15843\" title=\"View user profile.\">Alaskan</a>",
  "time": "<br>",
  "uid": "15843",
  "comments": [
    {
      "time": " 17 March, 2007 - 6:43pm",
      "content": "Given how well hiring qualified and expensive designers worked out, I really don’t think that giving them flak about running a contest is appropriate. If I spent $200,000 and got a logo that looked like a random ornament clipped out of a threadless shirt I wouldn’t hire another professional designer either.\n\n"
    },
    {
      "time": " 17 March, 2007 - 6:55pm",
      "content": "I agree … but it’s NOT the city of Anchorage that’s sponsoring the contest - it’s the design firm that failed! Yes, that’s right, they took the 200k (from taxpayers), drooled out a scribble the client hates, gave up on the project, and then decided to run a contest to do the work they are getting paid for.\n\n"
    },
    {
      "time": " 18 March, 2007 - 8:19am",
      "content": "Ohhhh. Ok, that’s pretty crappy.\n\n"
    },
    {
      "time": " 18 March, 2007 - 10:15am",
      "content": "Contest are always suspect.\n\nI’m sure there are viable ones but none are viable enough for me to lift my Wacom pen…\n\npeace\n\n"
    },
    {
      "time": " 19 March, 2007 - 6:34am",
      "content": "I like the splat! But, if they hate it, power to the people, i guess…contests are usually a bad idea, but if the people want it, and it’s for the benefit of the people themselves, I guess it’s harder to fault it.\n\n“Yes, that’s right, they took the 200k (from taxpayers), drooled out a scribble the client hates,”\n\nI don’t know that. You don’t know that. Designers aren’t paid for the file on a disk. They’re paid for the entire process of getting to the point of a file on a disk.\n\n"
    },
    {
      "time": " 19 March, 2007 - 8:43pm",
      "content": "A fine point, aluminum. A designer _“is paid for the entire process of getting to the point of a file on a disk.”_ All the more reason I find this contest insulting.\n\nI strongly resent the notion that designing a logo is anything less than a professional endeavor, requiring education, skill, experience, and the ability to cultivate productive client/designer communications. Would any serious company (or city) EVER hold a contest to outsource _other_ professional services to any willing volunteer?\n\nImagine - City of Anchorage holds contest to …. Repair schoolbuses! Plow city streets! Manage the statewide DMV! Provide health insurance to city workers! Invest the Permanent Fund (ok, I know that’s obscure to the lower 48, but it’s important to Alaskans. Ask google.)\n\nPerhaps I take myself too seriously, but I’ve spent a lifetime learning and loving this craft. To see design belittled in such a public way saddens me.\n\nAK\n\n"
    },
    {
      "time": " 20 March, 2007 - 12:57am",
      "content": "RE the reaction\n\nReading the ADN blog the feeling I get is that Anchoragites just don’t like the idea of being ‘brandable’. I am somewhat sympathetic to that but I doubt they mean it. They don’t complain about the branding of their sports teams… Keep in mind these are folks who were ‘too Texas as for Texas’ for the most part. I think what they really feel is that the design doesn’t refelect their taste. And about that they are right. If the logo had flames on it they would be far happier. Or sharp teeth. Or faux chrome. Or all three. So instead of admiting that their macho self image is under threat by the campaign - they resort to arguements they don’t mean, certainly don’t understand and at maximum volume.\n\nRE: the cash\n\nIf somebody was paid that much to build a house nobody would blink. I don’t think 200k is too much for the job they were given to do. Double that would be fine too - I say ‘look reality in the face & LICK IT’\\*.\n\nRE: success or failure\n\nThe campaign’s success can’t be judged by residents alone - they are not the folks the message is geared towards. But, and it’s a big but, no camapaign can really be sustained without the support of common folk. Nerland’s hubris in this regard is their undoing here. I like the site they built even if it comes directly out of the ‘seattle style design’ handbook.\n\nRE: The ‘shape’\n\nI think the mashup of shapes we call the splat is being focused on simply because it looks ‘odd’. In the designer’s mind they were thinking ‘brown is very in just now’. In the local person’s mind brown is the color of breakup when the snow melts & everything is infinitely muddy for a month. Our least favorite time of year. Seattlities wouldn’t so much as blink at it. It’s a flexible theme element like a light motif - only more flexible & more ‘wild’ - at least in the sense that it looks unkempt ;-) . It’s actually a clever idea in some ways; but just not made as well as it might be; and unfortunately ready-made to freak out people whose graphic sensibility is just entering the early 90’s.\n\n<cite> Designers aren’t paid for the file on a disk. They’re paid for the entire process of getting to the point of a file on a disk. </cite>\n\nToo right. Exactly. But they are also hired to get a business result. That’s the measure the City aught to & almost certainly does care about. That business result can be affected by local attitude though. We have been losing fising spots to the folks this stuff is geared to for years. So local folks are feeling somehow sensitive. Well actually it’s been to those Texans who live here now but we are too polite or brainwashed to admit that. Still, for folks who are really serious about the fishing thing - a successful campaign is the last thing they would hope for. And a dismal one is fodder for jokes.\n\nRE: the contest\n\nI think it’s a faux populist PR move meant to help the whole thing blow over. And if nobody will does anything wothwhile they have a ready made excuse. And if they do something great they are of the hook then too. Ceratinly an ‘adventure’ ‘valued at 3k’ is too cheap to lure me in.\n\nIn any event I think none of this is actually so serious. Except for the Nerland folks perhaps. I say why not treat it like sports. It’s only 200k, & there is always next year.\n\n\\* One of my favorite lines from ‘The Mighty Boosh’ a british comedy that references Alaska with surprising regularity.\n\n"
    },
    {
      "time": " 20 March, 2007 - 8:21am",
      "content": "_Imagine - City of Anchorage holds contest to …. Repair schoolbuses! Plow city streets! Manage the statewide DMV! Provide health insurance to city workers! Invest the Permanent Fund (ok, I know that’s obscure to the lower 48, but it’s important to Alaskans. Ask google.)_\n\nWhy not? Here in Alberta, that’s how our provincial government’s been run for years, including handing out the $400 RalphBucks cheques last year instead of investing in the Heritage Trust Fund (our equivalent of your Permanent Fund).\n\nOf course, what happens is you get a lot of “privatized” provincial services, where licenced “registries” are busted for selling fake drivers’ licences, liquor stores with no products because they can’t get deliveries, and a government that touts “arts spending” as everyone having a plasma TV …. ;-(\n\n"
    },
    {
      "time": " 20 March, 2007 - 11:11am",
      "content": "“Would any serious company (or city) EVER hold a contest to outsource other professional services to any willing volunteer?”\n\nThey often do. Architects and Developers constantly perform spec work to get .gov projects. Should they? Probably not. But they do.\n\n"
    },
    {
      "time": " 21 March, 2007 - 3:07pm",
      "content": "I’m well up for competitions like this, a real shame some of them are limited to residents only - their loss.\n\n"
    }
  ]
}
