{
  "id": "32348",
  "title": "Need help, logo design for book series",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi im new to this forum, i was hoping someone could help me out with a logo i am working on for a book series project in my GD class. It’s gonna be for a series of books on photography in the baltics (latvia, lithuania, and estonia). I’m going with a typographic solution because the cover will feature photographs. I want the books to feel very contemporary and elegant. However i have been struggling with finding an appropriate font and also with placement. Here’s what i have so far, note that the logo will be placed on semi-transparent vellum, revealing the photography below.\n\n| Attachment | Size |\n| --- | --- |\n| [riga\\_cover\\_web.jpg](http://web.archive.org/web/20070323023517/http:/typophile.com/files/riga_cover_web.jpg) | 25.37 KB |\n\n",
  "author": "<a href=\"user/17485\" title=\"View user profile.\">brokedesigner</a>",
  "time": "<br>",
  "uid": "17485",
  "comments": [
    {
      "time": " 18 March, 2007 - 2:50pm",
      "content": "Are you trying to create a logo or a book title design?\n\n1. Use true small caps. Notice how the strokes in “P” and “L” are thicker than in the rest of the letters. A true small caps typeface will offer proportionate strokes.\n\n2. The “f” is impeding the readability of “Photography” and “Latvia.” The words are <cite>legible</cite>, but less readable because the ascender and descender in that “f” interrupt the words.\n\n3. I’m not sure what the red marks are. They look like brush strokes which is confusing.\n\n"
    },
    {
      "time": " 18 March, 2007 - 2:54pm",
      "content": "i guess this is more of a book title design. the brush strokes are a stylized take on the flag of latvia. I’m not sure about them though, i just wanted an element that would tie all 3 books together. Also does anyone have any other alternate font suggestions.\n\n"
    },
    {
      "time": " 21 March, 2007 - 4:08pm",
      "content": "Since its about photography, the photos should be seen more, don’t let “design” get in the way.  \nThe typography is bad. keep it real simple, one typeface, put everything on a grid, make it titlecase.\n\nLoose the brush strokes.\n\n"
    },
    {
      "time": " 22 March, 2007 - 11:29am",
      "content": "Yeah, the brush strokes look a little gory to me. Among other thing, the “of” needs to be scaled down a bit.\n\n"
    }
  ]
}
