{
  "id": "32340",
  "title": "Looking for fonts similar to video and DVD player read-outs and mobile phone screens",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "What is the typeface used on a dvd player or video player?\n\nThank you.\n\n [‹ (x) \"Bunny\" square sans - Bank Gothic {Mike Y}](http://web.archive.org/web/20070911194404/http:/typophile.com/node/32654 \"Go to previous forum topic\") [(x) \"Zermatt\" serif face simular to Adobe Garamond - Friz Quadrata {Mark S} ›](http://web.archive.org/web/20070911194404/http:/typophile.com/node/32673 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20070911194404/http://typophile.com/user/14600\" title=\"View user profile.\">missgiggles</a>",
  "time": "<br>",
  "uid": "14600",
  "comments": [
    {
      "time": " 18.Mar.2007 3.02am",
      "content": "That’s a very non-specific request Miss G.\n\nNick Cooke\n\n"
    },
    {
      "time": " 18.Mar.2007 3.46am",
      "content": "i meant what kind of typeface resembles that type? Are they all different? I’m not sure. Sorry.\n\n"
    },
    {
      "time": " 18.Mar.2007 6.56am",
      "content": "You don’t have to be sorry, finish your studies and buy a camera.\n\n"
    },
    {
      "time": " 18.Mar.2007 7.48am",
      "content": "You mean something [like this?](http://web.archive.org/web/20070911194404/http:/www.3dnews.ru/documents/9961/dvd-logo-v.jpg)\n\n"
    },
    {
      "time": " 18.Mar.2007 8.59am",
      "content": "Do you mean the typeface for subtitles?\n\n"
    },
    {
      "time": " 18.Mar.2007 9.59am",
      "content": "I have a camera but not a DVD player so i wouldn’t know :(\n\n"
    },
    {
      "time": " 18.Mar.2007 10.06am",
      "content": "erm...is there digitised type where it may say PLAY or something. i.e.  \n [http://www.germes-online.com/direct/dbimage/50356740/DVD\\_Player.jpg](http://web.archive.org/web/20070911194404/http:/www.germes-online.com/direct/dbimage/50356740/DVD_Player.jpg \"http://www.germes-online.com/direct/dbimage/50356740/DVD\\_Player.jpg\")\n\nor  \n [http://www.currys.co.uk:80/martprd/store/cur\\_page.jsp?BV\\_SessionID=@@@@1...](http://web.archive.org/web/20070911194404/http:/www.currys.co.uk/martprd/store/cur_page.jsp?BV_SessionID=@@@@1672948935.1174240928@@@@&BV_EngineID=cccjaddkhdfmdjdcflgceggdhhmdfhm.0&page=Product&fm=11&sm=1&tm=0&sku=893177&category_oid= \"http://www.currys.co.uk:80/martprd/store/cur\\_page.jsp?BV\\_SessionID=@@@@1672948935.1174240928@@@@&BV\\_EngineID=cccjaddkhdfmdjdcflgceggdhhmdfhm.0&page=Product&fm=11&sm=1&tm=0&sku=893177&category\\_oid=\")\n\nEnlarge image and you will see green or blue type on the information part. Sorry, am i being too open here? I thought someone would have an idea. Surely someone has a DVD player. I don’t unfortunately.\n\n"
    },
    {
      "time": " 18.Mar.2007 10.07am",
      "content": "So what kind of typefaces do they generally use for mobile phones for texting etc?\n\n"
    },
    {
      "time": " 18.Mar.2007 10.14am",
      "content": "You’re definitely being too open. Each DVD player manufacturer will choose whatever typeface they want for their players. Generally it will be a Grotesk like Helvetica, though I’ve seen Arial and Futura used too.\n\nAs for mobile phone OS fonts - they will usually be proprietary to the phone company, e.g. Nokia Sans and its bitmap counterpart designed by Erik Spiekermann.\n\n- Lex\n\n"
    },
    {
      "time": " 18.Mar.2007 10.35am",
      "content": "Thanks, Lex. i shall see what i can find. Sorry people for being too open.\n\n"
    },
    {
      "time": " 18.Mar.2007 10.46am",
      "content": "I meant something like this but nevermind. [http://www.dafont.com/theme.php?cat=302](http://web.archive.org/web/20070911194404/http:/www.dafont.com/theme.php?cat=302 \"http://www.dafont.com/theme.php?cat=302\")\n\n"
    },
    {
      "time": " 18.Mar.2007 10.52am",
      "content": "For other LCD readout fonts, you can do a search for [LCD at Myfonts.](http://web.archive.org/web/20070911194404/http:/www.myfonts.com/search?search%5Btext%5D=lcd&itemsperpage=50&sourceid=Mozilla-search)\n\n- Lex\n\n"
    },
    {
      "time": " 19.Mar.2007 2.17pm",
      "content": "I was wondering why this particular forum of mine has a red asteric next to it? Have I done something wrong?\n\n"
    },
    {
      "time": " 19.Mar.2007 2.23pm",
      "content": "Well, actually, now that you mention it, I don’t even know why and I’m friggin’ head moderator of this forum! :^)\n\nPlease bear with me while I ask the powers that be.\n\n"
    },
    {
      "time": " 19.Mar.2007 2.29pm",
      "content": "The red asterisk means a thread which you, the reader, has not read or has new content.\n\n"
    },
    {
      "time": " 19.Mar.2007 2.40pm",
      "content": "Scratch that. The red asterisk signifies a new thread which you, the reader, hasn’t viewed yet.\n\n"
    },
    {
      "time": " 19.Mar.2007 2.53pm",
      "content": "That’s why I don’t see any asterisks anymore! I did a full check up to a couple of days back. :^D\n\nMystery solved.\n\n"
    },
    {
      "time": " 19.Mar.2007 3.52pm",
      "content": "haha :D\n\n"
    },
    {
      "time": " 21.Mar.2007 7.17am",
      "content": "In the future you should indicate ( using your original post as a starting point ) if you mean the type used printed on the buttons, for the logo, or for the parts that light up - or whatever. Be as specific & thoughtful as possible. AND it would be a good idea to post an image if you want a type to be identified.\n\nWhen I first read the title of your question I was keen to read the rest & to help but after I read how unspecfic the question was I thought to myself. ’Why can’t she be asked to think this question through a bit better?’ And then I thought ’If she can’t be asked - then neither can I’.\n\nIf you ask lazy unspecific questions in future I wil ignore them. If you ask careful specific questions I will try to help.\n\n"
    },
    {
      "time": " 21.Mar.2007 10.54am",
      "content": "Eben,  \nWhen you write:  \n<cite>“Why can’t she be asked to think this question through a bit better?”</cite>  \nI think you mean:  \n“Why can’t she be ARSED to think this question through a bit better?”\n\nI have heard a few non-English people mistake the UK term “arsed” for the southern English pronunciation of “asked”. It was first brought to my attention when I lived with a Greek man who tried to pick up local expressions.\n\nSo, If she can’t be ARSED - then neither can you, right?\n\nArsed is from arse (ass, bottom, buttocks, posterior - whatever)\n\n“I can’t be arsed” doesn’t actually make much sense but that’s the correct term. It means “I can’t be bothered”, I once heard that it comes from “I can’t be bothered to get up off my arse to ... [whatever]” but I don’t really know and I can’t be arsed to Google it.\n\n"
    },
    {
      "time": " 21.Mar.2007 10.57am",
      "content": "“Arse” gets through the profanity filter but the US version does not ... interesting.\n\nAll the UK and Irish people can talk mild filth without censorship.\n\n"
    },
    {
      "time": " 21.Mar.2007 12.18pm",
      "content": "<cite> All the UK and Irish people can talk mild filth without censorship. </cite>\n\nI think that’s great. Somebody should be able to!\n\nBTW RE: Arsed. I first heard the expression on a BBC radio show called Absolute Power\n\n[http://en.wikipedia.org/wiki/Absolute\\_Power\\_%28comedy%29](http://web.archive.org/web/20070911194404/http:/en.wikipedia.org/wiki/Absolute_Power_%28comedy%29 \"http://en.wikipedia.org/wiki/Absolute\\_Power\\_%28comedy%29\")\n\nAlso\n\n[http://www.bbc.co.uk/comedy/guide/articles/a/absolutepower\\_999031110.sht...](http://web.archive.org/web/20070911194404/http:/www.bbc.co.uk/comedy/guide/articles/a/absolutepower_999031110.shtml \"http://www.bbc.co.uk/comedy/guide/articles/a/absolutepower\\_999031110.shtml\")\n\nMartin Martin McCabe (John Bird) is always saying ’I couldn’t be asked’. Or at least that how it sounded... Is it possible that the modification is a joke about his character being upper class, public school etc? Probably not. Probably I just mis-heard it.\n\n"
    },
    {
      "time": " 21.Mar.2007 2.23pm",
      "content": "We’ve had a [thread on creative cursing](http://web.archive.org/web/20070911194404/http:/typophile.com/node/933) before. It was truckloads of fun. Never knew “felching” was such a repulsive sexual activity.\n\n"
    },
    {
      "time": " 21.Mar.2007 2.25pm",
      "content": "Felching? Sounds like belching to me.\n\n"
    },
    {
      "time": " 21.Mar.2007 2.29pm",
      "content": "Tiff, trust me, you don’t want to know. Please resist the temptation to Google that one. You - don’t - want - to - know. ;^)\n\n"
    },
    {
      "time": " 21.Mar.2007 2.35pm",
      "content": "And Miss Giggles — I’d like to add to Eben’s comment that some people messaged me offboard that they are not exactly happy with your behaviour on these boards. Maybe it’s time to take a long hard look at _what_ you ask for, _how_ you ask for it, and how you _react_ to some of the replies. Everybody here does this for free, to help people, so it’s understandable if they’re not very pleased when they feel like they’re been taken advantage of. Always be careful with what you’re getting for free.\n\n"
    },
    {
      "time": " 21.Mar.2007 2.37pm",
      "content": "Ha! Well the thought hadn’t occurred to me to google. But thanks for the warning. I’ll resist the tempation. ;^)\n\n"
    },
    {
      "time": " 21.Mar.2007 4.45pm",
      "content": "I felt like some clarification might help but I am probably just reiterating the comments of others. Still I had worried I was being too mean & now I don’t. Yves, Thanks.\n\n"
    },
    {
      "time": " 21.Mar.2007 5.24pm",
      "content": "I had a contract gig a couple of years ago, and one of the nastier people on the team I worked with had the same last name as a synonym for “felching.” In her case, it was appropriate....\n\n(Yves is right, Tiff: you don’t want to know....)\n\n"
    },
    {
      "time": " 29.Mar.2007 5.10pm",
      "content": "Better yet, rent “The Aristocrats”\n\n"
    }
  ]
}
