{
  "id": "32346",
  "title": "Type Designer looking for detailed developer",
  "forum": "Build",
  "tags": [

  ],
  "content": "I have 6 fonts that I have designed. One of the fonts is almost completely developed in FontLab. The others are part developed in Illustrator.\n\nI am looking to develop a famous foundry by producing the highest quality fonts. I want to partner with a developer that holds high standards for themselves and their work and has the highest attention to detail.\n\nI own and run a design company and do not have enough time to design and develop the fonts. I have found the development of fonts a steep learning curve and can appreciate the skill needed to develop fonts. I have good experience in business and marketing and have high ambitions for the foundry I want to build.\n\nI look forward to any serious inquiries, comments or advice.\n\nJames\n\n[www.jamestrump.com](http://web.archive.org/web/20080314123402/http:/www.jamestrump.com/ \"www.jamestrump.com\")\n\n [‹ Photoshop CSx not recognizing calt feature](http://web.archive.org/web/20080314123402/http:/www.typophile.com/node/32458 \"Go to previous forum topic\") [AFDK 2.0 Fix Startpoints ›](http://web.archive.org/web/20080314123402/http:/www.typophile.com/node/32331 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080314123402/http://www.typophile.com/user/11006\" title=\"View user profile.\">James Trump</a>",
  "time": "<br>",
  "uid": "11006",
  "comments": [
    {
      "time": " 18.Mar.2007 3.33pm",
      "content": "can we see the typefacves?\n\nMuzz\n\n"
    },
    {
      "time": " 19.Mar.2007 3.13am",
      "content": "I’d change the name of Neutra if I were you, to avoid any confusion or possible lawsuits:\n\n[http://www.houseind.com/index.php?page=showfont&id=18](http://web.archive.org/web/20080314123402/http:/www.houseind.com/index.php?page=showfont&id=18 \"http://www.houseind.com/index.php?page=showfont&id=18\")\n\nNick Cooke\n\n"
    },
    {
      "time": " 19.Mar.2007 3.24pm",
      "content": "I have tweeked the font since, but to give you an idea of the first I have developed:\n\n[http://i85.photobucket.com/albums/k59/jamesbluesky/Neutra.jpg](http://web.archive.org/web/20080314123402/http:/i85.photobucket.com/albums/k59/jamesbluesky/Neutra.jpg \"http://i85.photobucket.com/albums/k59/jamesbluesky/Neutra.jpg\")\n\n"
    },
    {
      "time": " 19.Mar.2007 3.26pm",
      "content": "Thanks for the great advice Nick!\n\nI think i will have to change it. Any suggestions for the rename will be greatly received.\n\nMany thanks\n\nJames\n\n ![](http://web.archive.org/web/20080314123402im_/http:/www.typophile.com/files/Neutra_5743.jpg)\n\n"
    },
    {
      "time": " 19.Mar.2007 3.36pm",
      "content": " ![](http://web.archive.org/web/20080314123402im_/http:/www.typophile.com/files/RG_4605.jpg)\n  \n\n ![](http://web.archive.org/web/20080314123402im_/http:/www.typophile.com/files/Wendy_Syred_6204.png)\n\n"
    },
    {
      "time": " 19.Mar.2007 5.08pm",
      "content": "Isn’t “Rhona Gillmore” just Peignot Light extended slightly?\n\n"
    },
    {
      "time": " 20.Mar.2007 1.14pm",
      "content": "In the same way Gotham is just Avenir with slight changes?\n\n"
    },
    {
      "time": " 20.Mar.2007 1.22pm",
      "content": "No, Gotham and Avenir are not anywhere near this similar. “Rhona Gillmore” could be recreated in any program that can horizontally scale type, starting with Peignot Light.\n\n"
    },
    {
      "time": " 20.Mar.2007 2.27pm",
      "content": "Yes I agree. With these characters it does look like an extended Peignot Light.  \nAlthough, when you see the other characters it starts to look very different.\n\nIn my opinion Peignot is almost a very nice typeface. It has some very elegant characters, others look ugly. I intend to create a new font simular to Peignot but elegant throughout.\n\n"
    },
    {
      "time": " 20.Mar.2007 2.38pm",
      "content": "“I am looking to develop a famous foundry by producing the highest quality fonts.”\n\nJames, you seem to have the ambition of your uncle Donald. I wish you the best of luck in your enterprise.\n\n"
    },
    {
      "time": " 20.Mar.2007 3.06pm",
      "content": "mate your better off doing iy yourdself, no one will really want to be your production monkey!\n\nMuzz\n\n"
    },
    {
      "time": " 21.Mar.2007 6.19am",
      "content": "James there are production guns for hire. You should google it. I have ran into several of them, so they excist. The cost of developing a small family could be very high though. Designing, producing and testing is a very time consuming full-time job. We’re talking months here. Best of luck.\n\n"
    },
    {
      "time": " 21.Mar.2007 8.49am",
      "content": "Are you willing to pay somebody up-front to “manufacture” the fonts for you? If not, this is only likely to work out if the fonts are exceptional (tough call) and you settle on some profit-sharing scheme. There are too many fonts out there, at low prices, for it to be otherwise.\n\n\\> I intend to create a new font simular to Peignot but elegant throughout.\n\nThere are possibly legal, and certainly ethical, complications when doing something like this. Excoffon, a contemporary of Cassandre once did the same sort of thing to Peignot early on (by some accounts even before Peignot was officially released) and the uproar was a trigger for the creation of ATypI.\n\nFurthermore, concerning Peignot in particular, it’s important to note that it was much more than just another font - in essence it was actually an attempt to reform the Latin script. As a result, any “taming” of it (presuming that’s what you’ve done - maybe not) involves complications beyond merely the formal.\n\nNot trying to be confrontational, just trying to help.\n\nhhp\n\n"
    }
  ]
}
