{
  "id": "32349",
  "title": "Sans to complement Warnock?",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hi\n\nI'm setting the body copy of a sunday supplement type magazine with Warnock pro, and would like a clean, fresh, understated sans serif to complement it. Ideally from the adobe opentype library??\n\n",
  "author": "dendicott",
  "time": "18 Mar 2007 — 4:00pm",
  "uid": "12413",
  "comments": [
    {
      "time": "18 Mar 2007 — 4:14pm",
      "content": "What about using [Cronos Pro Opticals](http://web.archive.org/web/20150217121334/http:/www.adobe.com/type/browser/P/P_1734.html)?\n\n"
    },
    {
      "time": "18 Mar 2007 — 5:31pm",
      "content": "Think I prefer Frutiger. Cronos feels a bit cheap?\n\n"
    },
    {
      "time": "18 Mar 2007 — 5:45pm",
      "content": "Cheap? Cronos? Perhaps you just like rigidity over fluidity?\n\n"
    },
    {
      "time": "18 Mar 2007 — 5:48pm",
      "content": "Perhaps... I'm not sure about the softer edge to it. My version is Cronos Pro - no opticals after it. Is is the same?\n\n"
    },
    {
      "time": "19 Mar 2007 — 2:48pm",
      "content": "Cronos Pro Opticals has got more types (Caption, Subhead, Display); other than that Cronos Pro is the same.\n\n"
    },
    {
      "time": "19 Mar 2007 — 2:56pm",
      "content": "Cronos Pro Opticals addresses [Optical Sizing](http://web.archive.org/web/20150217121334/http:/typophile.com/wiki/Optical%20Sizing) in the font design. If you notice, some of the details have been removed in the captions sizes.\n\n"
    },
    {
      "time": "19 Mar 2007 — 11:06pm",
      "content": "Can you suggest somew examples of this face in use? still can't quite see it, but it's growing on me\n\n"
    },
    {
      "time": "20 Mar 2007 — 11:29am",
      "content": "[http://dallasmuseumofart.org/Dallas\\_Museum\\_of\\_Art/View/VanGogh/index.htm](http://web.archive.org/web/20150217121334/http:/dallasmuseumofart.org/Dallas_Museum_of_Art/View/VanGogh/index.htm \"http://dallasmuseumofart.org/Dallas\\_Museum\\_of\\_Art/View/VanGogh/index.htm\")\n\nBook Title\n\n"
    },
    {
      "time": "20 Mar 2007 — 10:43pm",
      "content": "I love Warnock and have used Franklin Gothic with it several times. I feel it is a clean look with nice contrasts, and since both fonts have many weights, it is very flexible.\n\n-M\n\n"
    },
    {
      "time": "12 Jun 2010 — 1:15am",
      "content": "If you use Warnock as the body and are looking for a header, here are some working options:\n\nUnivers  \nTrade Gothic  \nNews Gothic  \nMyriad  \nFrutiger  \nFranklin Gothic  \nAvenir  \nAkzidenz Grotesk\n\nI wrote an app for the iPhone to help speed up the generation of font combination ideas so you can see the typefaces in context:\n\n[http://bonfx.com/font-combinations-app/](http://web.archive.org/web/20150217121334/http:/bonfx.com/font-combinations-app/ \"http://bonfx.com/font-combinations-app/\")\n\nThere is a book coming out too, with hundreds of working examples:\n\n[http://bonfx.com/the-big-book-of-font-combinations/](http://web.archive.org/web/20150217121334/http:/bonfx.com/the-big-book-of-font-combinations/ \"http://bonfx.com/the-big-book-of-font-combinations/\")\n\n"
    },
    {
      "time": "12 Jun 2010 — 2:59am",
      "content": "Hi Douglas,\n\nI see you have posted your message on a number of threads related to the pairing of typefaces now.  \nAll of these threads are years old, hence your comment probably won’t help the original posters. Bumping such old threads with the same old self-promotion can be perceived as spamming. My advice for you: start a new thread where you can explain your app and have it discussed by others, and then give it a rest.\n\nFlorian\n\n"
    },
    {
      "time": "12 Jun 2010 — 2:12pm",
      "content": "Thanks, Florian. It needed to be said.\n\n"
    },
    {
      "time": "12 Jun 2010 — 6:16pm",
      "content": "Wow. I had no idea the threads would be bumped like that. I thought the original posters would get a message, but that's it. Sorry! Intentionally bumping is always bad manners. Thanks for the heads up - won't happen again!\n\nI guess it's a credit to typophile.com that the forum sub-pages look like blog entries and not like a forum at all - not even remotely. Since I came in through google directly to these pages, I never saw the forum listing.\n\n"
    }
  ]
}
