{
  "id": "32368",
  "title": "Philadelphia Fury soccer team logo",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hello,\n\nCan anyone identify the font used in Philadelphia Fury logo?  \nIt may be a custom one, but I think I saw something similar.\n\nThanks in advance.\n\n| Attachment | Size |\n| --- | --- |\n| [Philadelphia Font.gif](http://web.archive.org/web/20070329121031/http:/typophile.com/files/Philadelphia%20Font.gif) | 10.1 KB |\n\n",
  "author": "<a href=\"user/16403\" title=\"View user profile.\">Varelse</a>",
  "time": "<br>",
  "uid": "16403",
  "comments": [
    {
      "time": " 19 March, 2007 - 10:22am",
      "content": "And a link to Wikipedia Philadelphia Fury page:  \n [http://en.wikipedia.org/wiki/Philadelphia\\_Fury](http://web.archive.org/web/20070329121031/http:/en.wikipedia.org/wiki/Philadelphia_Fury)\n\n"
    },
    {
      "time": " 20 March, 2007 - 1:29am",
      "content": "From the [FAQ](http://web.archive.org/) page:\n\n[**And logos of sports teams?**](http://web.archive.org/forums/typeid/faq/#Q_16)  \n_There you have to keep in mind that sports merchandising — everything from baseball caps to soccer jerseys — is big business, so the popular sports teams have every reason to make their logo as difficult to imitate as possible. Most of them are custom designed or use heavily customized existing fonts._\n\nThis logo strikes me as a typical example of a custom designed logo. The team was active from 1978 to 1980, so they probably either used some flair typeface that was popular at that time as a basis, or designed the logo from scratch. Only very few of this type of ornamented typefaces made the transition to digital, most of these thanks to [Jason Walcott](http://web.archive.org/wiki/Jason%20Walcott).\n\n"
    },
    {
      "time": " 20 March, 2007 - 7:13am",
      "content": "There are a lot of things about it that look like Souvenir, but really heavily messed around with….\n\n"
    },
    {
      "time": " 20 March, 2007 - 7:55am",
      "content": "Thank you. Souvenir seems to be close enough to go with this one.  \n(I’ve read the FAQ part about sport logos. I was just sure I saw a similar font, so I decided to try)\n\n"
    },
    {
      "time": " 20 March, 2007 - 2:58pm",
      "content": "Sure, no problem — I just copy-pasted to make my life easier. ;^)\n\n"
    }
  ]
}
