{
  "id": "32376",
  "title": "Please can I have some feedback. Thank you.",
  "forum": "Typography / Composition",
  "tags": [

  ],
  "content": "Which type do you think suits the target audience of 16-24 yrs olds? This is a magazine advert and I would like feedback. I have other advertising mediums too but would like feedback on this first so I can develop the others in the similar manner. Thank you.\n\n| Attachment | Size |\n| --- | --- |\n| [Picture 5 eurostyle mag ad.png](http://web.archive.org/web/20100909222526/http:/typophile.com/files/Picture%205%20eurostyle%20mag%20ad.png) | 59.14 KB |\n| [Picture 9 gill sans mag ad.png](http://web.archive.org/web/20100909222526/http:/typophile.com/files/Picture%209%20gill%20sans%20mag%20ad.png) | 66.02 KB |\n| [Picture 13 chlorine mag ad.png](http://web.archive.org/web/20100909222526/http:/typophile.com/files/Picture%2013%20chlorine%20mag%20ad.png) | 67.27 KB |\n\n",
  "author": "<a href=\"/web/20100909222526/http://typophile.com/user/14600\" title=\"View user profile.\">missgiggles</a>",
  "time": "<br>",
  "uid": "14600",
  "comments": [
    {
      "time": "",
      "content": "Probably Chlorine.\n\n"
    },
    {
      "time": "",
      "content": "Agree with Miss Tiffany although it reads bog instead of bag…\n\npeace\n\n"
    },
    {
      "time": "",
      "content": "Really? So should i still keep Chlorine on the following advertising mediums. I have a feeling my layouts are not still right at the moment for the others. Would you like to see them? :)  \nPS Can you think of any other typefaces that could be used? I'm definately going for san serif. Any ideas? Thanks in advance.\n\n"
    },
    {
      "time": "",
      "content": "hmmmmmm, so what would be your solution to that? Should I enlarge the pt size? or should I change typeface completely? If so, what typeface would you recommend? I'd like to know your views. Thanks.\n\n"
    },
    {
      "time": "",
      "content": "I think Eurostyle works well, except that \"PLAY ON\" doesn't look great in that particular face at that size. Perhaps you could use a different face for \"PLAY ON\" and Eurostyle elsewhere?\n\n"
    },
    {
      "time": "",
      "content": "hmmmm, now that's the confusing part. Am I allowed to use 2 faces on one particular piece? If so, what are the rules? Should the typeface be in contrast with the focal typeface or not? Please educate me :)\n\n"
    },
    {
      "time": "",
      "content": "To change the Chlorine \"a\" you could redraw the \"serif\" to angle it away from the letter or turn it at a right angle, making it more prominent. I would use more leading than you have and for the longest truth turn over \"what\" so \"what kind\" is on one line and centre on the height of the lozenge, and draw up an apostrophe.\n\nFrom a technical point of view you should create a lefthand and righthand version of the advertisement, currently your layout would almost work for a recto (righthand page) but if used as a verso the dares, logo and pictures would be partially obscured by the binding, (I say almost because most magazines will specify a safe type area which will be approximately 20mm less than the printed dimensions to take into account of trimming).\n\nThe various elements are somewhat disconnected, I would be tempted to move the headline and arrow element up and make the body copy more prominent and larger and to the same measure as the headline and turn over the lines to represent the meaning better.\n\nAs for mixing up typefaces there are no rules, essentially you can easily use two or three typefaces in this instance, for example, a display face for the headings, a text face for the body copy and another for the dares – I wouldn’t mix similar typefaces, say, a pair of humanist sans or a pair of venetian serifs (although it can be done), it really is down to looking at combinations and making your own judgement. In this case however I think you are better off using one and making that work well.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Do you think that the Chlorine typeface is good enough to communicate 'Play'? Is it playful enough? Do you think that the typeface works for the bodycopy because i have had to increase the leading? Is it right? I have hardly ever played with the leading but I would like to know what you think. Could you recommend another 'playful, energetic' face appropriate to this particular theme? What about:\n\n[http://www.dafont.com/rhino.font?text=PLAY+ON%21+where+ever+you+are](http://web.archive.org/web/20100909222526/http:/www.dafont.com/rhino.font?text=PLAY+ON%21+where+ever+you+are \"http://www.dafont.com/rhino.font?text=PLAY+ON%21+where+ever+you+are\")\n\n[http://www.dafont.com/thickhead.font?text=PLAY+ON%21+where+ever+you+are](http://web.archive.org/web/20100909222526/http:/www.dafont.com/thickhead.font?text=PLAY+ON%21+where+ever+you+are \"http://www.dafont.com/thickhead.font?text=PLAY+ON%21+where+ever+you+are\")\n\n[http://www.dafont.com/heartbreaker.font?text=PLAY+ON%21+where+ever+you+are](http://web.archive.org/web/20100909222526/http:/www.dafont.com/heartbreaker.font?text=PLAY+ON%21+where+ever+you+are \"http://www.dafont.com/heartbreaker.font?text=PLAY+ON%21+where+ever+you+are\")\n\nor should I stick to Chlorine?  \nPS I'm trying to hyperlink them but it doesn't seem to work.\n\n"
    },
    {
      "time": "",
      "content": "Chlorine works on a level (because it has no uppercase, extended body copy will not be the best but in this limited situation it should be fine) it is a mixture of fun and techno and fits my appreciation of the demographic and your triangle.\n\nLeading is crucial in all situations, the default 20% of Quark and, I believe, InDesign is sufficient for many typefaces in most text settings but when working with a free font and all that brings with it in terms of kerning and spacing, you should apply your own leading and kerning because at the moment the leading is way too tight, I cannot see the kerning clearly enough to comment. As for the turn overs in the body copy I would make the last three sentences of your body single lines (or paragraphs) and break the first sentence to suit the line length you create. btw I think you are missing an \"are\" in the second last sentence.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "I noticed that the leading was too tight although my tutor said it was OK. I don't and can not stand for OK because I tend to like it perfect. In regards to the turn overs in the body copy, was this what you meant?  \nThe original is:\n\nWherever you are, whatever you're doing, at home  \nor out, Doritos will make sure you are entertained  \nwith our fun packed cards inside every pack.10 to  \ncollect! So go on, what \\*are\\* you waiting for? Snack on  \nand let the fun begin!\n\nDo you mean: A)\n\nWherever you are, whatever you're doing, at home  \nor out, Doritos will make sure you are entertained  \nwith our fun packed cards inside every pack.  \n10 to collect!  \nSo go on, what are you waiting for?  \nSnack on and let the fun begin!\n\nOR B)\n\nWherever you are, whatever you're doing, at home  \nor out, Doritos will make sure you are entertained  \nwith our fun packed cards inside every pack.  \n10 to collect! So go on, what are you waiting for?  \nSnack on and let the fun begin!\n\nOR C)\n\nWherever you are, whatever you're doing, at home  \nor out, Doritos will make sure you are entertained  \nwith our fun packed cards inside every pack.  \n10 to collect! So go on,  \nwhat are you waiting for?  \nSnack on and let the fun begin!\n\n"
    },
    {
      "time": "",
      "content": "I was thinking of this\n\nwherever you are,  \nwhatever you’re doing,  \nat home or out,  \ndoritos will make sure  \nyou are entertained  \nwith our fun packed cards  \ninside every pack.  \n10 to collect!  \nso go on, what are you waiting for?  \nsnack on and let the fun begin!\n\nOr this, (you may find it will work better by using two sizes with the lines \"doritos… …pack\" smaller)\n\nwherever you are,  \nwhatever you’re doing,  \nat home or out,  \ndoritos will make sure you are entertained  \nwith our fun packed cards inside every pack.  \n10 to collect!  \nso go on, what are you waiting for?  \nsnack on and let the fun begin!\n\nYou are right to stick to your aim of perfection, although opinions will differ as to a perfect setting, now is the time to experiment and gain an appreciation of how type _should_ look and work.\n\nTim\n\n"
    },
    {
      "time": "",
      "content": "Thank you for all your help. I really appreciate it.\n\n"
    }
  ]
}
