{
  "id": "32371",
  "title": "Beautiful font similar to URW Grotesk or Avenir",
  "forum": "Type ID Board [OLD]",
  "tags": [
    "Type ID Board [OLD]"
  ],
  "content": "Hi, Can someone please help me identify this beautiful font? I love almost everything about it - the y's, the g's. It's wider than URW Grotesk. The a's are not Avenir's. Have searched everywhere. Custom? Thanks.\n\n| Attachment | Size |\n| --- | --- |\n| [breakfast menu.jpg](http://web.archive.org/web/20150106212429/http:/typophile.com/files/breakfast%20menu.jpg) | 60.35 KB |\n| [breakfast menu2.jpg](http://web.archive.org/web/20150106212429/http:/typophile.com/files/breakfast%20menu2.jpg) | 49.37 KB |\n\n",
  "author": "remy",
  "time": "19 Mar 2007 — 11:46am",
  "uid": "16677",
  "comments": [
    {
      "time": "19 Mar 2007 — 12:19pm",
      "content": "Not an exact match, but you can get a similar look, down to the one-story a and monocle g, with the Alt weights of Ezzo:\n\n[http://www.typetrust.com/fonts/font.php?id=MjYw&fontview=weights](http://web.archive.org/web/20150106212429/http:/www.typetrust.com/fonts/font.php?id=MjYw&fontview=weights \"http://www.typetrust.com/fonts/font.php?id=MjYw&fontview=weights\")\n\n"
    },
    {
      "time": "19 Mar 2007 — 12:22pm",
      "content": "That is a great discovery, remy!\n\nI have no clue as to what it is, however... Where did you find this specimen?\n\n"
    },
    {
      "time": "19 Mar 2007 — 12:42pm",
      "content": "This is apparently half a menu from a hotel I believe. I found it at a friend's house with a phone number on the back - but it was ripped in half (with the top half missing!) so I have no idea where it's from. I've become obsessed with finding this face - can't seem to find anything exactly like it anywhere -- I've searched thousands of fonts -- so I'm assuming it's custom.\n\n"
    },
    {
      "time": "19 Mar 2007 — 12:51pm",
      "content": "Well remy, I think it's time you set your so-called \"friend\" in a dark room with a bright light directed on them... and find out exactly WHERE they were when said ripped menu was given to them. Rhythmic water droplets on their forehead and bamboo under the fingernails are optional, I suppose.\n\nWhatever the case, the type is great... I will let you know if I make any discoveries!\n\n"
    },
    {
      "time": "19 Mar 2007 — 1:12pm",
      "content": "reminds me of something bertholdy\n\n"
    },
    {
      "time": "19 Mar 2007 — 1:33pm",
      "content": "It does resemble AG's Schoolbook a lot ... This type's uniform stroke thickness sets it apart, though.\n\n"
    },
    {
      "time": "19 Mar 2007 — 1:33pm",
      "content": "It actually reminds me of a single-line font that comes with a CAD system. Doubtful, though, considering the headline \"Breakfast\" is a standard outline font.\n\nJason C\n\n"
    },
    {
      "time": "19 Mar 2007 — 2:07pm",
      "content": "I just added some more text to my original link that I managed to salvage from this menu. The 'G' is what makes it different from AG or some of my other guesses. None of those 'fontfinder' thingies online are any help either.\n\nAlso, this font seems fairly compact height-wise. AG, etc. are taller... stumped!\n\n"
    },
    {
      "time": "19 Mar 2007 — 2:44pm",
      "content": "Hmm, thought it might be one of the NuGrots® from Lineto (Akkurat) or Village (Galaxie Polaris), but no dice.\n\nGalaxie Polaris is not a bad alternative, though. Similar G/g, and it offers the one-story a as an alternate character.\n\n[http://vllg.com/Village/GalaxiePolaris/mudTyper+Weights/](http://web.archive.org/web/20150106212429/http:/vllg.com/Village/GalaxiePolaris/mudTyper+Weights/ \"http://vllg.com/Village/GalaxiePolaris/mudTyper+Weights/\")\n\n[http://lineto.com/The+Fonts/Font+Categories/Text+Fonts/Akkurat/](http://web.archive.org/web/20150106212429/http:/lineto.com/The+Fonts/Font+Categories/Text+Fonts/Akkurat/ \"http://lineto.com/The+Fonts/Font+Categories/Text+Fonts/Akkurat/\")\n\n"
    },
    {
      "time": "20 Mar 2007 — 8:44am",
      "content": "Seems to be a consensus in my studio that this is the ever-elusive 'General' face. There's a thread on this site with a discussion around a face which looks pretty similar. The good ones are always unavailable :-)\n\n"
    },
    {
      "time": "20 Mar 2007 — 9:37am",
      "content": "Nah, General is more Arial-like. I don't think it had a single-storey alternative lowercase 'a'.\n\n"
    },
    {
      "time": "20 Mar 2007 — 9:41am",
      "content": "Pulled this out of the search on this site.. could this be the reason for the single storey 'a'?\n\n\"General had an alternate schoolbook form of ‘a’, accessed via the contextual alternates OpenType feature. (In retrospect, not the best choice, but at the time one of the only features one could trust.)\"\n\n"
    }
  ]
}
