{
  "id": "3238",
  "title": "Olduvai",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hello Typophiles.   \n   \nAttached is a fun side project I've had going. It a handlettered serif with gravy on top. The glyphs were drawn at 1cm high and digitized. There are some color issues with the smallcaps, but overall I was pleasantly surprised by the nice texture. If you can think of other fun addition to the set I'd love to extend it. It kinda reminds me of emigre's journal with a bit more tooth.   \n   \nEnjoy,   \nRandy   \n ![](http://web.archive.org/web/20131019190448im_/http:/www.typophile.com/forums/messages/29/26963.gif)\n\n<!--attachment: Olduvai-26964.pdf*mime_pdf.gif*application/pdf*327.4 **Olduvai%2epdf --><!--attachment: Olduvai-26964.pdf*mime_pdf.gif*application/pdf*327.4** Olduvai%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131019190448im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131019190448/http:/www.typophile.com/forums/messages/29/Olduvai-26964.pdf\" target=\"_blank\"><b>Olduvai.pdf</b></a> (327.4 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n",
  "author": "aquatoad",
  "time": "21 Feb 2004 — 6:05am",
  "uid": "618",
  "comments": [
    {
      "time": "21 Feb 2004 — 7:00am",
      "content": "Nice Gravy, the italic especially, reminds me of Ealing Studios titling work and the pith helmet!   \n [http://www.britmovie.co.uk/studios/ealing/filmography/71i.html](http://web.archive.org/web/20131019190448/http:/www.britmovie.co.uk/studios/ealing/filmography/71i.html)\n\n"
    },
    {
      "time": "21 Feb 2004 — 11:10am",
      "content": "Delicious. Is the backward slant in the regular intentional? I would be tempted to rotate and/or skew most of the glyphs slightly to make it more upright.\n\n"
    },
    {
      "time": "21 Feb 2004 — 11:47am",
      "content": "_Delicious. Is the backward slant in the regular intentional?_   \nMany people have accused me of being left handed after looking at my handrawn work. I'm not sure where the backslanting comes from. I will go through and rework the regular lc. There are also baseline/x-height issues in the italic to be addressed.   \n   \nI was thinking a bit about doing a clean version (digitally remastered) keeping the funky quality, but with smooth curves. It would be included in the set. Thoughts on that? Or other comments?   \n   \nThanks   \nRandy\n\n"
    },
    {
      "time": "21 Feb 2004 — 1:00pm",
      "content": "I love it, it's such a great face. The lowercase italics especially are quite nice!   \n   \nI also think that it would be great with a rough version and a smooth one.\n\n"
    },
    {
      "time": "21 Feb 2004 — 1:18pm",
      "content": "It\n\n"
    },
    {
      "time": "21 Feb 2004 — 9:23pm",
      "content": "I didn't notice the PDF until now.   \n   \nThis needs old style numbers!\n\n"
    },
    {
      "time": "22 Feb 2004 — 2:45am",
      "content": "This is beautiful work. So much character!\n\n"
    },
    {
      "time": "22 Feb 2004 — 3:17am",
      "content": "Beautiful, it reminds me of Letterror's [Salmiak](http://web.archive.org/web/20131019190448/http:/www.letterror.com/foundry/salmiak/index.html)\n\n"
    },
    {
      "time": "22 Feb 2004 — 10:11am",
      "content": "We loves it! the backslant doesn't bother me, i think it adds more character. but i would add a pineapple. [http://www.typophile.com/forums/messages/83/26899.html?1077441434](http://web.archive.org/web/20131019190448/http:/www.typophile.com/forums/messages/83/26899.html?1077441434) (just messin)   \nOkay, on closer reading, the backslant is somewhat distracting in text but i still think it adds character if used strictly as a display face.\n\n"
    },
    {
      "time": "22 Feb 2004 — 12:54pm",
      "content": "I too just noticed the PDF. Seeing it in a text setting, I don't think the backslant needs fixing at all, at least not in the lc. I think it would only look off when someone insists on setting it in allcaps.\n\n"
    },
    {
      "time": "22 Feb 2004 — 6:42pm",
      "content": "LOL, it seems that Kevin and I are of diametrically opposed opinions. I would tend to fix the backslant for a text version and keep it for a titling version. But hey, it's yer baby!\n\n"
    },
    {
      "time": "23 Feb 2004 — 2:27am",
      "content": "There should be more projects like yours! Keep on the good work.   \n   \n--Jacques\n\n"
    },
    {
      "time": "23 Feb 2004 — 12:31pm",
      "content": "Randy,   \n   \nGood stuff. I think a digitally remastered 'clean' version would be great. I would be interested to see how you handle 'keeping the funky quality'.   \n   \ncr\n\n"
    },
    {
      "time": "23 Feb 2004 — 4:01pm",
      "content": "_I think a digitally remastered 'clean' version would be great. I would be interested to see how you handle 'keeping the funky quality'._   \n   \nThat has me a bit worried, but I think it can be funky in the way that [Biblon](http://web.archive.org/web/20131019190448/http:/www.stormtype.com/bibl.html) is funky. Even, yet uneven. BTW that font is Storm's most innovative (best?) in my opinion.   \n   \nStephen, if I saw your list before embarking I probably wouldn't have. :-) But thanks for the vote of confidence.   \n   \nI will be adding a pineapple.\n\n"
    },
    {
      "time": "23 Feb 2004 — 6:15pm",
      "content": "hooray for the pinapple! i think it should be a standard dingbat or ornament. I think this face is great, can't wait for it to be released. keep up the good work!\n\n"
    },
    {
      "time": "23 Feb 2004 — 9:48pm",
      "content": "Randy, this may be an obvious question, but... are your typefaces available commercially anywhere? Google has failed me, and I can't seem to track down a source.\n\n"
    },
    {
      "time": "24 Feb 2004 — 6:59am",
      "content": "Stephen, is that any way to talk in mixed company?   \nGrant, google ain't broke you diplomat. At this time my fonts are ultra exclusive, meaning they are sitting on my hardrive in various states of completion. If you're interested let's chat off post (I think people are only allowed to have their pineapples picked publicly in Amsterdam.)   \n   \nRandy\n\n"
    },
    {
      "time": "24 Feb 2004 — 8:01am",
      "content": "so maybe we'll see Olduvai soon on veer huh? well hopefully it's not too long!\n\n"
    },
    {
      "time": "24 Feb 2004 — 9:07am",
      "content": "\\> _'m pretty sure Randy's pineapple is ripe for the picking._   \n   \nTwitch. Twitch.   \n   \n\\> _so maybe we'll see Olduvai soon on Veer huh?_   \n   \nLet's just say that the volley and banter has begun.\n\n"
    },
    {
      "time": "24 Feb 2004 — 10:55am",
      "content": "The following is the start of the remastered version. I'm not sure what to make of it. Right now it is looking very close to the original. Probably too close. Anyways, thought I'd post it.   \n   \nRandy   \n ![](http://web.archive.org/web/20131019190448im_/http:/www.typophile.com/forums/messages/29/27154.gif)\n\n<!--attachment: remastered-27155.pdf*mime_pdf.gif*application/pdf*31.2 **remastered%2epdf --><!--attachment: remastered-27155.pdf*mime_pdf.gif*application/pdf*31.2** remastered%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131019190448im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131019190448/http:/www.typophile.com/forums/messages/29/remastered-27155.pdf\" target=\"_blank\"><b>remastered.pdf</b></a> (31.2 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n"
    },
    {
      "time": "24 Feb 2004 — 11:19am",
      "content": "Way too regular. I don't think you should go for the weathered look, but I think this really needs a lot of the bounce preserved. Or you could have two styles: Docile and Wild - and no italics?   \n   \nhhp\n\n"
    },
    {
      "time": "25 Feb 2004 — 6:00am",
      "content": "Very nice, both versions (and I think the backslant should be fixed too).   \n   \nMinor observation regarding the 'regular' version: the lowercase outlines are too rough (they even have tiny spikes)... I'd just soften them a little.   \n   \nAbout the 'remastered' one: there are some color issues... like the 'i' looking darker than the 'el'.\n\n"
    },
    {
      "time": "6 Mar 2004 — 11:29am",
      "content": "Hi all.   \n   \nI've taken another look at the regular:   \nBackslant corrected, and some outline cleaning.   \n   \nI've also filled out the initial cap and ornaments.   \nVery excited about those borders. More coming.   \n   \nRandy\n\n<!--attachment: olduvai_revised-28025.pdf*mime_pdf.gif*application/pdf*467.7 **olduvai_revised%2epdf --><!--attachment: olduvai_revised-28025.pdf*mime_pdf.gif*application/pdf*467.7** olduvai_revised%2epdf -->\n\n<center>\n<br>\n<table border=\"1\">\n<tr>\n<td>\n<img src=\"http://web.archive.org/web/20131019190448im_/http:/www.typophile.com/forums/icons/mime_pdf.gif\" align=\"left\" alt=\"application/pdf\"><br><a href=\"http://web.archive.org/web/20131019190448/http:/www.typophile.com/forums/messages/29/olduvai_revised-28025.pdf\" target=\"_blank\"><b>olduvai_revised.pdf</b></a> (467.7 k)</td>\n</tr>\n</table>\n<p></p>\n</center><!--/attachment--><!--/attachment-->\n\n![](http://web.archive.org/web/20131019190448im_/http:/www.typophile.com/forums/messages/29/28026.gif)\n\n"
    },
    {
      "time": "6 Mar 2004 — 12:17pm",
      "content": "Great stuff, man. But I do think you've gone a hair too far correcting the backslant - to me this face seems to want no apparent slant at all.   \n   \nBTW, love them hybrid nums.   \n   \nhhp\n\n"
    },
    {
      "time": "6 Mar 2004 — 11:42pm",
      "content": "I would buy it.\n\n"
    },
    {
      "time": "7 Mar 2004 — 12:10am",
      "content": "Me too. I want to buy it! I love the color on a page. Really inviting.   \n   \nOne quibble- I miss the old Q now. I see how you have put some characters in boxes & that version needs a shorter tail - but does the Regular 'Q'?   \n   \nThere is something Edward Gorey -ish about this font too. It's as if He was doing a book on being in India rather than Edwardian England.   \n   \nI don't mean to take away from your originality at all. I love the lighthearted cheek put into the old forms with his writing & with your font. It makes a page it warm & human.   \n   \nToo cool.   \n   \nCould there be a font of alternates too?\n\n"
    },
    {
      "time": "8 Mar 2004 — 5:22am",
      "content": "The Initial Caps and Ornaments set is what is shown at right above. The boxed initials occupy the cap spots and the regular initials occupy the lowercase spots. Both were intended to be used as drop caps it the beginning of a text (hence fitting them in a square). The un-boxed versions might do better as a swash cap set with a totally wild Q. I'll think about it. The regular Q is unchanged, not to worry.   \n   \n_I do think you've gone a hair too far correcting the backslant - to me this face seems to want no apparent slant at all._   \nI agree that it wants no slant at all. Was your observation based on looking at the paragraphs or at the detail at the bottom, or both? It was looking right to me.   \n   \n_BTW, love them hybrid nums._    \nMe too! Hybrids are in general, totally practical. They work in text, do fine tabular, great on a business card (where osf often struggle), and typographically caloused clients don't freak out the way the sometimes do over osf.   \n   \nI think the new [Australopithecus](http://web.archive.org/web/20131019190448/http:/www.evolutionnyc.com/IBS/SimpleCat/Product/asp/product-id/442121.html) ornament lends an especially Edward Gorey element.   \n   \nAs a side note, the name Olduvai has less to do with any evolutionary interests, but more the crusty nature of the font combined with intesive immersion in [The Far Side](http://web.archive.org/web/20131019190448/http:/home.thegrid.net/~lllove/otherpaleo.htm).   \n   \nCheers,   \nRandy\n\n"
    },
    {
      "time": "8 Mar 2004 — 9:30am",
      "content": "\\> Was your observation based on ....   \n   \nIt was based on taking a \"broad\" look at a paragraph, where it \"feels\" slanted.   \n   \nhhp\n\n"
    },
    {
      "time": "8 Mar 2004 — 8:01pm",
      "content": "Odd. I don't see it. Value you opinion though, so will take a further look. As I made the change there were some characters that were more backslanted than others, some just felt that way because the right leg was lifted (m,n). Are there any glyphs, word combinations or lines that particularly seem overly forward slanting now?   \n   \nThanks for taking the time.   \n   \nRandy   \nBTW, here is a new border that will be included in the ornament set. It is based on some amazing Hmung textiles. Not much to do with the Olduvai/Archeology theme, but still it's fun to work on these. I'd like to add some handrawn cartouches and lettering scrolls.   \n   \n ![](http://web.archive.org/web/20131019190448im_/http:/www.typophile.com/forums/messages/29/28192.gif)\n\n"
    },
    {
      "time": "8 Mar 2004 — 8:56pm",
      "content": "\\> Are there any glyphs, word combinations or lines that   \n\\> particularly seem overly forward slanting now?   \n   \nI don't think so - at least I haven't looked closely enough to pinpoint any \"problem glyphs\". Since this is an inherently irregular design I don't think that would be very relevant anyway. I'd say that the overall forward slant is about 1/2 a degree (like Syntax).   \n   \nBTW, that border reminds me of the background on Karen Huang's blog (which makes some sense).   \n   \nhhp\n\n"
    },
    {
      "time": "9 Mar 2004 — 12:16am",
      "content": "Hello Randy   \nI love the font you made.   \nThe borders and Initials are fabulous.   \n   \nNicolien\n\n"
    },
    {
      "time": "9 Mar 2004 — 9:43am",
      "content": "Here are some scrolls to add to the mix.   \nNicolien, thanks and welcome to typophile.\n\n"
    },
    {
      "time": "9 Mar 2004 — 10:04am",
      "content": "These are too good.   \n   \nhhp\n\n"
    },
    {
      "time": "9 Mar 2004 — 11:18am",
      "content": "Oh, yes. Very nice!   \n   \nBTW, there's something odd with those boxed initials.   \nMaybe if you had the regular caps inside the boxes...?\n\n"
    },
    {
      "time": "9 Mar 2004 — 11:30am",
      "content": "Maybe I'll add some twigs and a pheasant to the ones that have too much black (L, I, J,T,V,C) :-)   \nLovely plumage!\n\n"
    },
    {
      "time": "16 Mar 2004 — 8:47pm",
      "content": "OMG! I LOVE IT!! This is totally something I wish I had designed.\n\n"
    },
    {
      "time": "19 Mar 2004 — 3:28am",
      "content": "Wonderful work. The scrolls are too good to give away in a typeface ;-)   \n   \nI was surprised by how good it looks in a text setting, very even, but uneven, if you know what I mean. Someone around here once said something about the deviations from an even colour being the most interesting thing about a typeface; and this deviates beautifully.   \n   \nGreat, inspiring work; congratulations.   \n   \nJordan\n\n"
    },
    {
      "time": "18 Apr 2004 — 5:37am",
      "content": "Whatever this turns out to be. Do not keep it to yourself. I just finished a One-off commerative album/diary for the past president of CPA Australia and this font would have been the perfect one to use.   \n   \nIf this font ever makes the light of day please email me - I'll definitely be interested in purchasing!   \n   \nThis is one of those times where I wish I wasn't one of those half-arsed mac generation designers who knows what he would like to draw or letter but can't use a pencil. (Actually I probably could if I had the time to keep a pencil sharp and use it)\n\n"
    },
    {
      "time": "18 Apr 2004 — 3:23pm",
      "content": "\\> _If this font ever makes the light of day please email_   \n\\> _me - I'll definitely be interested in purchasing!_   \n   \nNever fear. Olduvai will be released through Veer's [Umbrella](http://web.archive.org/web/20131019190448/http:/www.veer.com/products/type/umt/) collection in June. More information will follow. I promise.\n\n"
    },
    {
      "time": "18 Apr 2004 — 6:49pm",
      "content": "Grant, you should think about picking up Chagrin and Eason, too, if that would make Randy finish them. ;)\n\n"
    },
    {
      "time": "18 Apr 2004 — 6:59pm",
      "content": "i might akshully hafta break down and acutally purchase something from veer instead of just drooling over them nice glossy mags once this one hits the shelves. congrats randy! keep up the good work!\n\n"
    },
    {
      "time": "18 Apr 2004 — 8:20pm",
      "content": "\\> _Grant, you should think about picking up Chagrin_   \n\\> _and Eason, too, if that would make Randy finish them._   \n   \nI whole-heartedly agree.   \n   \nOf course, there's [Cuillere](http://web.archive.org/web/20131019190448/http:/www.typophile.com/forums/messages/29/4379.html), [Prodigal](http://web.archive.org/web/20131019190448/http:/www.typophile.com/forums/messages/29/13704.html), [Extra Wide Sans](http://web.archive.org/web/20131019190448/http:/www.typophile.com/forums/messages/29/3071.html), and [this lovely untitled piece of work](http://web.archive.org/web/20131019190448/http:/www.typophile.com/forums/messages/29/8933.html) as well. Randy and I have had discussions about many of his other works in progress. Olduvai is coming out first because - to be honest - it was the design which was the furthest along. I can't speak to what may be released next. I think that is something still kept under Randy's cap.\n\n"
    },
    {
      "time": "18 Apr 2004 — 8:31pm",
      "content": "Hmmm. Adding Eason and Prodigal could be very good for the Umbrella collection, as it seems a bit display heavy. Particularly with script faces. Cool.\n\n"
    },
    {
      "time": "19 Apr 2004 — 6:22pm",
      "content": "\\> _Adding Eason and Prodigal could be very good for the_   \n\\> _Umbrella collection, as it seems a bit display heavy._   \n   \nWhile this thread isn't really the proper forum for this topic, I will mention that we are adding more text faces to balance out the collection as we speak. For instance, a full blown OpenType version of Christian Robertson's long anticipated [Pill Gothic](http://web.archive.org/web/20131019190448/http:/www.typophile.com/forums/messages/29/156.html) will be coming out as part of Umbrella next month.\n\n"
    },
    {
      "time": "19 Apr 2004 — 7:12pm",
      "content": "This is all good news. I'm going to think long and hard about buying some of these releases. That's a big deal for me, since I am too po' to afford an \"or\".\n\n"
    },
    {
      "time": "20 Apr 2004 — 5:55pm",
      "content": "hey grant, does veer do advance orders for us impatient types who want the product as soon as it becomes available? ;^)\n\n"
    },
    {
      "time": "20 Apr 2004 — 6:34pm",
      "content": "![:-)](http://web.archive.org/web/20131019190448im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \nI'll let everyone know as soon as it's available in our system. Which will probably be before the end of May. The fact is... Randy's little disc of golden master love only dropped onto my desk yesterday. We still need to run the typeface through the [Veer Supa Product Machine](http://web.archive.org/web/20131019190448/http:/www.veer.com/)\n\n"
    },
    {
      "time": "20 Apr 2004 — 6:45pm",
      "content": "congrats on yer work getting \"published,\" randy! is this yer first?\n\n"
    },
    {
      "time": "20 Apr 2004 — 7:06pm",
      "content": "Paul: Yup.   \n   \nGrant: I recommend a safety monacle and some earl grey when operating The Machine\n\n"
    },
    {
      "time": "20 Apr 2004 — 7:09pm",
      "content": "... and always floss between kern pairs.\n\n"
    }
  ]
}
