{
  "id": "32388",
  "title": "Please, comment on my typeface!",
  "forum": "Display",
  "tags": [
    "Display"
  ],
  "content": "Hello, my name is Joshua and I am a student. This is my first type attempt at designing a typeface.\n\nI would really appreciate any comments on what is working and what's not.\n\nAlso, to test the font I have been generating the font file in Fontographer, importing into Font explorer to activate and test in Illustrator. Does anyone have a better way of testing the font? Every time I update I have to delete the old file or rename the new one to see the updated version.\n\nThank you,\n\nJ\n\n| Attachment | Size |\n| --- | --- |\n| [v1font.pdf](http://web.archive.org/web/20150423163115/http:/typophile.com/files/v1font.pdf) | 59.39 KB |\n\n",
  "author": "tourists",
  "time": "20 Mar 2007 — 12:18am",
  "uid": "14185",
  "comments": [
    {
      "time": "20 Mar 2007 — 1:38am",
      "content": "Your face is pretty nice. I like your y & k. the distict un flipped p & q are nice too even if the square looking holes or counters worry me slightly. The work reminds me Of Rudolph Koch woodcut blackletter\n\n& this: [http://www.itcfonts.com/Fonts/Detail.htm?pid=204549](http://web.archive.org/web/20150423163115/http:/www.itcfonts.com/Fonts/Detail.htm?pid=204549 \"http://www.itcfonts.com/Fonts/Detail.htm?pid=204549\")\n\nIn some cases you are letting the 'rules' that are helping you build your style & the letters get in the way of more ideal forms. the s & a look that way to me. The f seems to need the most help. Do you see what I mean? Congradulations on a very good 1st draft!\n\n"
    },
    {
      "time": "20 Mar 2007 — 8:52am",
      "content": "I agree with your comment about the square looking holes and counters Big E. I also noticed a trend of inside left edges were kept perpendicular and very straight, where the inside right edge was broken up or curved. I'd suggest trying keep that trend going with all your letters. Adding a slight curve to the holes and counters, even on one side would make them appear thought-about, currently they look as if you weren't quite sure what you wanted to do.\n\nI do like the look. It has a calligraphic/nib quality while maintaining the solid ridged forms of a sans-serif.\n\nAre you going to try and expand the weights and add an italicized version? What's name do you have in mind for it?\n\n"
    },
    {
      "time": "20 Mar 2007 — 9:47am",
      "content": "The carved or cut-out look is distinctive and has a nice, agreeable feeling about it. To me the tail of the g looks drawn backwards.\n\nOverall it needs more consistency and polish to really work together as an alphabet.\n\nYou need to test it in words extensively to see what works on this.\n\nOn the versions, if you give them different names, 1, 2, 3, or a, b, c, then they should install ok and keep the old version. There may be a better way to do this, but that works.\n\n"
    },
    {
      "time": "20 Mar 2007 — 10:57am",
      "content": "This has great promise. Very 21st century.\n\nhhp\n\n"
    },
    {
      "time": "20 Mar 2007 — 8:41pm",
      "content": "Thank you all for your specific comments they were exactly what I needed. You addressed many of the issues that I was questioning like the square counters.  \nAndrew, I have no idea on names yet I'm hoping a name will come to me in the process. I do plan on playing around with some other weights pretty soon to see how they work.\n\nThanks again for your time,\n\nJoshua\n\n"
    },
    {
      "time": "27 Mar 2007 — 1:01am",
      "content": "<cite>Does anyone have a better way of testing the font?</cite>\n\nI believe the smoothest way of testing fonts is to generate the fonts in the directory of InDesigns own Font folder. When doing this you don’t have to do anything special for the fonts to work – as soon as a new font is in this folder – it gets updated directly in InDesign. Without having to restart anything or go via some font handling application.\n\n"
    },
    {
      "time": "27 Mar 2007 — 7:36am",
      "content": "In Windows this tends to happen automatically when you install  \nin the Fonts directory, although I know it depends on the app.\n\nhhp\n\n"
    }
  ]
}
