{
  "id": "32381",
  "title": "Old-school type ID: somewhere between Futura & Univers",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Hi All,  \nThis one is escaping me at the moment. It shares many characteristics of Univers—the only differences I’m noticing off hand are the condensation of certain letters (like the E), the legs of the K not meeting at a point, and an overall more roundedness. The source of this scan is from 1972:\n\n ![](http://web.archive.org/files/pharaohs-label_5568.jpg)\n\n",
  "author": "<a href=\"user/7765\" title=\"View user profile.\">dcastillo</a>",
  "time": "<br>",
  "uid": "7765",
  "comments": [
    {
      "time": " 19 March, 2007 - 5:39pm",
      "content": "Not sure you’ll find a digital typeface to match this exactly. Futura Bold will get close except for that G. Gotham is also a nice geometric sans but doesn’t have the condensed E or similar K.\n\n"
    },
    {
      "time": " 19 March, 2007 - 5:57pm",
      "content": "Thanks—I was scared that that was going to be the sad truth.  \nIt’s so unfortunate how many good-looking typefaces got lost or changed drastically when design went digital. I would think there would be enough demand for some true-to-form digitization of these old school letterpress / letraset / etc. typefaces and variations for a foundry to take on the task.\n\nThere’s another font on here I would’ve sworn is Futura at first glance, yet it has a 1 and a more similar to Avenir.\n\n ![](http://web.archive.org/files/pharaohs-label2_4638.jpg)\n\n"
    },
    {
      "time": " 19 March, 2007 - 10:39pm",
      "content": "A lot of the classic sans faces had their ‘equivalents’ — produced by competing foundries. Slight variations, sometimes requested by a specific market, were introduced during this process of ‘adaptation’, eg different lc a and numeral 1.\n\n"
    },
    {
      "time": " 20 March, 2007 - 12:01am",
      "content": "This has a lot of [Metro](http://web.archive.org/web/20070329121334/http:/www.fontshop.com/index.cfm?fuseaction=verity.search&startrow=1&records=20&currpage=1&totalrecords=3&searchby=&searchID=&searchletter=&searchstr=no.+2%E2%84%A2&font_categories_checkbox=font_name_search&fontRendererText=Great+House+Prod) in it.\n\n"
    }
  ]
}
