{
  "id": "32398",
  "title": "FF Blur and other contemporary fonts.",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hi...I am doing a research on contemporary fonts, Brody's Blur in particular. We are suposed to research on the characteristics of the font selected and then apply it to the classification it comes under (here contemporary)..So it'd be great if you could help out...coz all I'm getting is links to download the font...  \nThanks  \nMerryn\n\n",
  "author": "Merryn",
  "time": "20 Mar 2007 — 9:12am",
  "uid": "17310",
  "comments": [
    {
      "time": "20 Mar 2007 — 9:24am",
      "content": "hey merryn, do you have access to brody's books \"the graphic language of neville brody\"? there are two of them. they may have more specific info about that family.\n\n"
    },
    {
      "time": "20 Mar 2007 — 9:51am",
      "content": "I wouldn't call Blur contemporary.  \nThe Blur typeface was released in the early days of digital type, pre-internet. What, 15 years ago? Type culture was hugely different then.\n\nBlur derives from photographic processes NB used for making type in the early 1980s, in Face magazine. Remember, he was traditionally educated/trained at the London College of Prining. I could be wrong, but I believe the technique involved making a negative-film-to-positive-paper contact print -- but with a layer of clear acetate between -- which will throw the image out of focus. Interestingly, Photoshop filters can produce a similar effect. But I don't know what technique he used to make the digital outlines of the FontFonts.\n\n"
    },
    {
      "time": "20 Mar 2007 — 9:53am",
      "content": "[A snip can be found on this page at Apple.](http://web.archive.org/web/20150421234907/http:/www.apple.com/pro/profiles/brody/index2.html)  \n [Google Books which mention the book \"The Graphic Language of Neville Brody\".](http://web.archive.org/web/20150421234907/http:/books.google.com/books?q=the+graphic+language+of+neville+brody&spell=1&lr=&sa=N&start=30)  \n [Google Books which mention \"Neville Brody Typeface Blur\".](http://web.archive.org/neville%20brody%20typeface%20blur)\n\n"
    },
    {
      "time": "20 Mar 2007 — 10:29am",
      "content": "hi Tyler,  \nwe have The graphic language of Neville Brody book 1 in our college library but we dont have the second book..and since Blur was released in '91-92 it doesnt say anything about it. Would there be an online version of the second book available?  \ncheers  \nMerryn\n\n"
    },
    {
      "time": "20 Mar 2007 — 10:46am",
      "content": "hi Tiffany  \nthe apple page was helpful...the other two links dint yield much...thanks a lot :)  \ncheers  \nMerryn\n\n"
    },
    {
      "time": "20 Mar 2007 — 10:49am",
      "content": "Hi Nick,  \nI dunno how different this clip of info is from what you said above but im pasting it.. \"Brody’s first digital typeface, Blur, is one of the first examples of a new language emerging from the Mac. An analog-digital collision, Blur is inherently soft-edged; at the time, other faces with soft edges were created by shooting traditional typeface deliberately out of focus.\" ...I read that Blur is usually categorised as \"amorphous typeface\" ...could you explain how contemporary and amorphous typefaces differ?  \ncheers  \nMerryn\n\n"
    },
    {
      "time": "20 Mar 2007 — 11:33am",
      "content": "Playing with effects on the PMT and copy cameras was encouraged at LCP, another effect that might have been used is to put tracing over the original to get a glow, photographed onto lith film.\n\nTim\n\n"
    },
    {
      "time": "20 Mar 2007 — 12:22pm",
      "content": "_one of the first examples of a new language emerging from the Mac._\n\nThat's rubbish. The \"language\" was already there. Check out The Face from 1983/4/5.  \nNote that another definitive face of early DTP era was Industria -- originally created with pen. ink, and ruler.\n\nHowever, digitization did allow an outsider to get into the game, and NB was one of the founders of FontShop, which published Blur. (Although Industria came out early from Monotype I believe.)\n\n"
    },
    {
      "time": "20 Mar 2007 — 12:27pm",
      "content": "_could you explain how contemporary and amorphous typefaces differ?_\n\nContemporary means either \"at the same time as\", or \"at the same time as ... the present day.\"\n\nThere is no such thing as an amorphous typeface, as long as the alphabet is decipherable.\n\n"
    },
    {
      "time": "20 Mar 2007 — 10:00pm",
      "content": "Hi, Merryn,\n\nBlur indeed appears and is mentioned in the second Brody monograph, so that would be a good starting point for your research. And yes, in the book it is called an \"analogue-digital collision\". :-)\n\nNick, I believe that by \"amorphous\" they are referring to the difficulty of categorizing a typeface such as Blur... not to its being readable or not. The FontShop catalog has a whole section called Amorphous, for fonts with wacky shapes that defy traditional categories like Serif or Sans Serif.\n\n"
    },
    {
      "time": "20 Mar 2007 — 11:07pm",
      "content": "Ah yes, the quirky FontFont catalogue scheme.  \nHistoric -- Amorphous -- Handwritten -- Ironic -- Typographic.  \nI wouldn't take that too seriously Merryn; as a typological system it's somewhat amorphous, not to mention ironic. But very contemporary :-)\n\n"
    },
    {
      "time": "21 Mar 2007 — 1:26am",
      "content": "Hi Nick  \nthanks again...as for the typographical system..yes i know wot u mean...and it isnt helping me get a proper grasp of things either...any idea where i can get a detailed analysis on the classification of type as such? coz im still a lil confused about where Blur would fit in...or whether it does at all...\n\n-Cheers  \n Merryn\n\n"
    },
    {
      "time": "21 Mar 2007 — 1:26am",
      "content": "Hi Ricardo  \nthanks for the info..but now the problem is getting hold of Brody's second book...dont have access to that one...and another query..since amorphous generally refers to fonts that cant be classified in terms of traditional categories, would studying one font belonging to that \"category\" and applying its characterists to that particular category help? especially since they dont seem to follow any set rules...does this also come under the 'grunge' set of typefaces...sorry if im getting the technical terms wrong...im still learning...\n\n-Cheers  \n Merryn\n\n"
    },
    {
      "time": "21 Mar 2007 — 3:28am",
      "content": "First of all I'd say that Blur is a display typeface. Display typefaces tend to follow trends and fashion and may be contemporary in their time but grow old fast.  \nBrody initiated the Fuse series of experimental typefaces around the same time as Blur came out. That would be the other category I'd think of. Fuse was a platform for type designers to question the relation between form and funcion of type and to experiment with what type could communicate other than the text it displayed.\n\n"
    },
    {
      "time": "21 Mar 2007 — 4:24am",
      "content": "Hi Jan...  \ni did read that Blur was primarily developed as a display typeface...are there many logos or display panels that use Blur? cz the google serach tunred nothing solid..or may be my search criteria was wrong, but id really appreciate the help...\n\n-Cheers  \n Merryn\n\n"
    },
    {
      "time": "21 Mar 2007 — 4:48am",
      "content": "Blur was published in 1994 and EVERYBODY used it to look up to date like with the earlier typefaces Brody did. It wore out pretty fast. I can't remember anything remarkable using that typeface other than Brody's posters. Any logo with a wordmark set in Blur would have said \"Blur\" instead of what it was supposed to say. I consider Blur more to be an idea published as a typeface than a typeface being designed to serve a certain purpose. This would probably describe Brody's philosophy as well. Look at amazon for \"The Graphic Language of Neville Brody 2\". The title uses Blur.\n\n"
    },
    {
      "time": "21 Mar 2007 — 7:46am",
      "content": "hey Jan  \nthanks a lot...while lookin for the d book in amazon came across another site that featured both the books page by page :) ...and since i dint have access to book 2, it helped a lot. And on another note why exactly were the destressed fonts developed??? the ones that usually went with a lil tweaking of 'normal' typefaces?? Any idea???\n\n-Cheers  \n Merryn\n\n"
    },
    {
      "time": "21 Mar 2007 — 8:20am",
      "content": "Like Blur being a blurred Helvetica (or similar)?  \nWhy?  \nWell, we are talking experimental typography here.  \nExperiments are done to see what happens (if I do this or that) and to come to unexpected results. It's about breaking rules and overcoming tradition.  \nIn the case of Blur Brody wanted the look of the typeface to show the process of its technical production (like woodcut type does). The typeface was supposed to have a human touch this way. It says all this in the book. As I said, there's an idea behind the whole thing. There has been a lot of experimenting with type back then - like combining Futura and Bodoni in a font called Fudoni for example. It's tweaking known typefaces but with a different idea.\n\n"
    },
    {
      "time": "21 Mar 2007 — 8:41am",
      "content": "hey Jan...  \nyeah, ive heard of the Fudoni :)  \nComing back to the experimental typefaces, is there like a certain specific area that they feature in, like say display or text (i doubt)...i mean considering compromising wid a bit of legibility and breaking away from the norm, ultimately, where do these typefaces get used? I mite be screaming aloud my ignorance here, but i gotta start somewhere :)\n\n-Cheers  \n Merryn\n\n"
    },
    {
      "time": "21 Mar 2007 — 9:08am",
      "content": "You have to get your hands dirty if you want to understand this more deeply.  \nOne way would be to take the typeface for a spin and see what it can do.  \nAnother would be to go digging for original documents. Sure, NB is (much to his chagrin) a well-documented celebrity and examples of Blur in use can be found in design literature, but one should be wary of second-hand information. To whet your appetite, here's part of a page from _The Face,_ Oct. 1983.\n\n ![](http://web.archive.org/web/20150421234907im_/http:/typophile.com/files/Blur_6410.jpg)\n\n"
    },
    {
      "time": "21 Mar 2007 — 9:16am",
      "content": "You really want to find that drawer that you can stick the Blur into, don't you?\n\nConsidering the fact that something like Blur is hard to read at small sizes it's gonna be used for headlines (display).\n\nThe designers chooses a typeface depending on the project (client's briefing, content, context) and/or his personal taste. Period.\n\nI think my favourite example for choice of typeface is David Carson setting an article about Brian Ferry in Zapf Dingbats (in Raygun that was) resulting in columns and lines full of ...eh... triangles, squares and circles.\n\n"
    },
    {
      "time": "21 Mar 2007 — 2:49pm",
      "content": "Blur spawned at least one imitator, which was used in 1997-98 for advertising by ABC, a television network in the U.S.\n\n[http://remogeneralstore.com/presentation/presentation.cfm?ss\\_uid=067B4E3...](http://web.archive.org/web/20150421234907/http:/remogeneralstore.com/presentation/presentation.cfm?ss_uid=067B4E3EE4A544FAAD1A2BF0D23463C5&pk_frame=382 \"http://remogeneralstore.com/presentation/presentation.cfm?ss\\_uid=067B4E3EE4A544FAAD1A2BF0D23463C5&pk\\_frame=382\")\n\n"
    },
    {
      "time": "21 Mar 2007 — 7:18pm",
      "content": "Here's a link to some articles on \"contemporary\" type. One of them is about Industria which also mentions Blur.\n\n[http://www.shinntype.com/Assets/Depts/Essays/Contents.html](http://web.archive.org/web/20150421234907/http:/www.shinntype.com/Assets/Depts/Essays/Contents.html \"http://www.shinntype.com/Assets/Depts/Essays/Contents.html\")\n\n"
    },
    {
      "time": "21 Mar 2007 — 10:46pm",
      "content": "@ Nick - yup...ready to get my hands n knees dirty..been playing around with Blur... as for original documents and design journals, dont have access to many, except for may be the eye magazine and how mag..and couple of other ones.. thanks a lot for the image from The Face...also came across some of your articles on Typographica and Shinntype ..thanks again..\n\n@ Jan - yes! i really am hoping to find the drawer to stick Blur and probably all the other typefaces into... atleast, for a beginner like me, it makes it easier to get the hand of it... like i said my interest and exposure to typography is newfound and i guess classifying things is one of the ways im trying to get a grasp of things...been hunting for images and more info... thanks a lot.. :)\n\n@ Marcox - thanks for the link to the abc network ... speaking of 'imitations' i did come across some very similar looking types... mistook it for Blur, but looked like it was extended or something..\n\n@ Chuck - Thanks for the link...was really helpful... the article on industria and the 21st century typefaces was helpful...\n\n-Cheers  \n Merryn\n\n"
    },
    {
      "time": "22 Mar 2007 — 10:16am",
      "content": "I expect it is difficult to find original artefacts such as 25-year old copies of The Face in Gujarat, (it's probably easier to pick them up in an antique/flea-market in the UK) but thanks to the internet:  \n [http://books.search.ebay.co.uk/the-face\\_Entertainment\\_W0QQloglZ0QQsacatZ...](http://web.archive.org/web/20150421234907/http:/books.search.ebay.co.uk/the-face_Entertainment_W0QQloglZ0QQsacatZ64789 \"http://books.search.ebay.co.uk/the-face\\_Entertainment\\_W0QQloglZ0QQsacatZ64789\")\n\n"
    },
    {
      "time": "22 Mar 2007 — 11:14am",
      "content": "@ Nick - You are seriously turning out to be a life saver :). Thanks..and playing around with the typeface turned out to be useful, because stage 2 of the project is to create a wallpaper (the desktop variety) using the typeface as an image and the research data found on the type as text...so trying hard not to get influenced by the stuff done by Brody himself...\n\n-Cheers  \n Merryn\n\n"
    },
    {
      "time": "23 Mar 2007 — 7:40pm",
      "content": "Hey Nick! You just saved my life too with your ebay link, because my 25-year-old copies of The Face went missing in class; some student nicked 'em (and the NB interview in The Guardian at the time of the V&A retrospective of his work...) so now I can replace said missing mags.\n\nIt sounds like a good project Merryn.\n\n"
    }
  ]
}
