{
  "id": "32393",
  "title": "Coalition Logo",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "This logo is for a new association of safety net clinics which are banding together to pool resources and talent. The goals are to create a strong, unifying branding element that can be used for communicating with government, private, educational, and charitable organizations in health care.\n\nThe hand is certainly cliché, but they really like the idea it conveys. It's automatically humanistic. To the client, it represents caring. In this logo, it's also catching those who are falling through the cracks.\n\nThe name is very long and it really can't be abbreviated. I am trying to give the type enough visual interest that it could stand on its own without the logo.\n\nI respect all your opinions, so I'd love to hear feedback. What do you think of the type choice (Chianti)? The logo? Does the positive shape register more strongly than the negative shape? (I don't want the negative shape to pop at all... it doesn't represent anything.)\n\nThanks for your critiques!\n\n ![](http://web.archive.org/web/20131019102341im_/http:/typophile.com/files/WCSN_4188.jpg)\n\n",
  "author": "tenor",
  "time": "20 Mar 2007 — 5:17am",
  "uid": "4225",
  "comments": [
    {
      "time": "20 Mar 2007 — 5:44am",
      "content": "I think the hand can work in that level of abstraction. The problem I have is with the negative shape creating a fish or a biting shark. Safetynet and trapped fish or shark seem to go against ehat you are trying to say. You may want to try taking away most of the top black line which completes the circle and letting it be open.  \nThe star sizes and shapes are less successful. Try some other ways of drawing them.\n\nChrisL\n\n"
    },
    {
      "time": "20 Mar 2007 — 7:24am",
      "content": "First thing that came to mind without reading your post, was that the positive shape looks like a wave.  \nWhen you say it's a hand, I can see that now, but at first glance the hand is not too visible.\n\n"
    },
    {
      "time": "20 Mar 2007 — 8:16am",
      "content": "I see a night time seascape scene. Perhaps with a tsunami approaching.\n\nThat said, I agree with dezcom...it works as an abstract shape just fine. Maybe some see a hand, maybe some see a wave. Your challenge is to put some spin on the hand/wave thing when you pitch it to the client \"wave of the future in helping hand services...\" or something like that. ;0)\n\nIf you do want it to literally be a hand, then be a bit more literal. I agree with Quincunx...try removing the top portion of the circle and refine the hand shape.\n\nI don't know if you HAVE to do that, though...I like what I see right now.\n\n"
    },
    {
      "time": "20 Mar 2007 — 9:43am",
      "content": "I didn't see the \"hand\" until I read your introduction. I saw a silly muppet face in the positive, where the stars were eyes and the thumb was a mouth agape.\n\nI'd recommend maybe adding more detail to the hand, maybe indicate more of a thumb by adding an upward bend towards the tip (this'll help create a look as if the hand was cradling a ball.) Also you might want to add another curve to indicate the first fingertip, nothing elaborate, but enough to break up the immediate transition into the circle.\n\nAnother suggestion would be to flip the stars to break up the pattern, thus reducing the appears of \"eyes\". I think I see it because the largest star is closest to me, giving perspective to the \"face\".\n\nI do like your type choice, though it does feel a bit tight. It's approachable.\n\n"
    },
    {
      "time": "20 Mar 2007 — 12:27pm",
      "content": "I saw the hand immediately, but it could be clearer, possibly by defining the fingertips better. I'd have to see both options to see what works better. The logo also reminds me of a marble.\n\nAs for the type, try setting the bolder type in the darker colour to mirror the dark area of the logo. This may unify them better.\n\nAlso, try aligning the stars along an arc from the wrist to the palm, to convey a bigger sense of motion. Pick either a point or the space between two points to be the leading edge of the stars. I hope this makes sense.\n\n- Lex\n\n"
    },
    {
      "time": "20 Mar 2007 — 1:27pm",
      "content": "All these comments are extremely helpful. I feel like I am on track with this design. I'll post back soon with an improved iteration (or two!)\n\n"
    },
    {
      "time": "20 Mar 2007 — 9:20pm",
      "content": "Here's a second iteration. Hopefully HR Pufnstuf isn't as visible as before.\n\n ![](http://web.archive.org/web/20131019102341im_/http:/typophile.com/files/WCSNC(2)_4466.jpg)\n\n"
    },
    {
      "time": "21 Mar 2007 — 6:49am",
      "content": "Liking where 2a is going. The hand imagery is definitely more prevalent. Remember your proportions... the thumb looks stubby when the fingers extend that far and high.\n\nI'm curious what the stars represent and if there might be a different solution instead of using stars?\n\nlooking better. I see no muppets today.\n\n"
    },
    {
      "time": "21 Mar 2007 — 7:33am",
      "content": "I find the combination of colour, swirled star and net in the text is a bit nautical, starfish washed up on the shore, the text makes a good shape with the form of 2a’s illustration, the other two makes the circle shape too obvious and enclosing, rather than acting as a safety net the hand has caught a ball.\n\nTim\n\n"
    },
    {
      "time": "22 Mar 2007 — 12:02pm",
      "content": "I don't like 2c. I like 2a the best, but the negative space looks like a speech bubble; although it's not a bad thing.\n\n"
    },
    {
      "time": "22 Mar 2007 — 9:02pm",
      "content": "One more dip into the font of wisdom.... After some more feedback, I tweaked the design to arrive at this logo:\n\n ![](http://web.archive.org/web/20131019102341im_/http:/typophile.com/files/WCSNC(3)_4402.jpg)\n\n- The kerning has been stabilized. Several of you mentioned the type was fairly tight, so I opened it up just a bit (especially the heavy text.) _If you see any glaring imbalances, let me know!_\n- Nodes have been checked and made orthogonal as much as possible.\n- The golden ratio was used to help refine the objects' positions in the lockup.\n- I made a horizontal lockup too, but it's not shown here.\n\nFeedback I got today from the client (a very small subset of the decision-making committee) suggested adding more detail to the hand, but I disagree with that. The design is intended to be fairly abstract. With more detail, it would look too much like the United Way logo. For me, the abstraction permits at least a bit of uniqueness to an otherwise very cliché concept.\n\nI also don't want to disrupt the smooth flow out of and back into the circle. I really like the pleasing and simple geometry. I might have to work to sell them on that concept, but I feel pretty strongly that the hand has just enough detail... especially after incorporating suggestions mentioned here which helped me clarify the finger and thumb shapes. (I really wanted to keep the finger transition I had originally, but I agree that it may have been too subtle and abstract to be seen as an open hand.)\n\nOthers have asked whether stars are the right choice. In my first draft sketches, the \"hand\" concept was just one of four. It had a star hovering above it for purely arbitrary reasons. It was just a sketch. I sent them a list of questions (inspired by the writings of [Tony Spaeth](http://web.archive.org/web/20131019102341/http:/www.identityworks.com/)) and asked them to \"justify\" the star and hand. I wanted them to explain to me why they liked those icons and what they meant within the context of their organization and mission so I could refine them. I didn't get much input!\n\nThis is MY interpretation of what it could mean for them. These stars are experiencing difficulty. They are patients being caught by the safety net. It hints obliquely at the Kansas motto, \"Ad astera per aspera.\" After reading Gardner's [\"2005 Trends\"](http://web.archive.org/web/20131019102341/http:/www.logolounge.com/articles/default.asp?Archive=True&ArticleID=414) article, I felt less guilty about relying on such simple iconography.\n\nAlso, pink hearts, yellow moons, green clovers, blue diamonds and purple horseshoes didn't work as well. :-)\n\n"
    },
    {
      "time": "23 Mar 2007 — 5:52am",
      "content": "<cite>Nodes have been checked and made orthogonal as much as possible.</cite>\n\nThis sounds impressively technical... what does it mean? And I love that you threw in use of the Golden Ratio to refine positioning. Lockup is also great.\n\n"
    },
    {
      "time": "23 Mar 2007 — 6:04am",
      "content": "It just means that the node handles defining curves are at 90º angles where possible. For example, the outer circle is composed of 4 nodes and the bezier handles are symmetrical at each node, and they extend horizontally or vertically from the node.\n\nIt just means that I cleaned up the curves as much as possible.\n\n"
    },
    {
      "time": "23 Mar 2007 — 7:03am",
      "content": "Duh, I wasn't even thinking that.\n\n"
    },
    {
      "time": "23 Mar 2007 — 7:29am",
      "content": "I like it, but I think the hand is still in purgatory...it's neither literally a hand, nor abstract enough to just stand alone as an abstract shape. Right now, it just seems like a deformed hand.\n\nNot that it's not a great logo--just that I can see where the client was looking for more details in the hand.\n\n"
    },
    {
      "time": "23 Mar 2007 — 8:06am",
      "content": "Darrel you thinking something more along these lines:\n\n ![](http://web.archive.org/web/20131019102341im_/http:/typophile.com/files/Detailed-Hand_6382.gif)\n\n"
    },
    {
      "time": "23 Mar 2007 — 8:39am",
      "content": "Minor tweak. The \"finger\" was starting to appear too long to me, so I shortened it.\n\n ![](http://web.archive.org/web/20131019102341im_/http:/typophile.com/files/WCSNC(3x)_3551.jpg)\n\n"
    },
    {
      "time": "23 Mar 2007 — 9:21am",
      "content": "Still looks like a dazed fish to me (seeing stars). Your older 2a was better.\n\nChrisL\n\n"
    },
    {
      "time": "23 Mar 2007 — 9:22am",
      "content": "I hope I wasn't stepping on any fingers with my \"suggested logo\".\n\n"
    },
    {
      "time": "23 Mar 2007 — 9:30am",
      "content": "Of course not! This is what critique is all about! In fact, the fingers in my \"final\" post looked too long to me AFTER I looked at your rendering. The proportions now are closer to the sketch you posted. So... thanks!\n\n"
    },
    {
      "time": "23 Mar 2007 — 10:17am",
      "content": "It’s the thumb, or rather where the thumb meets the palm, that is non-hand-like, the angle that Andrew shows is closer, I think if you nail (no pun intended Chris) that it will be less “dazed fish”, although I agree with Chris that the version that wasn’t enclosed is better, less Web 2.0 3d effect.\n\nTim\n\n"
    },
    {
      "time": "23 Mar 2007 — 5:36pm",
      "content": "ALWAYS less web2.0 look as a general rule.\n\nI agree it is rather clichéd, I also don't get the 'catching stars' connection - it seems a bit chance like i.e, they just stick out their hands and hope for the best.\n\nI wonder if there might be a more unique message you could convey with the logo. \\*shrug\\*\n\n----------  \n**Paul Ducco**  \n [Web Design Wellington](http://web.archive.org/web/20131019102341/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "23 Mar 2007 — 6:08pm",
      "content": "Hi  \nSomehow does the hand look to much like melted wax on a candle, it needs more details.\n\n ![](http://web.archive.org/web/20131019102341im_/http:/typophile.com/files/earth%20in%20hand_4287.jpg)\n\n"
    },
    {
      "time": "24 Mar 2007 — 7:53am",
      "content": "There's a hand? I see a comic book word balloon with stars in it.\n\nI like the slight detail that Asvetic added. I think that is what your client meant. It is less ambiguous than your current icon.\n\nLike the type, nice choice.\n\n"
    },
    {
      "time": "8 Apr 2007 — 7:12am",
      "content": "I see a paint palette. It may be my background though..\n\nConcerning the nodes, you can do that in Illustrator? :^O\n\n"
    },
    {
      "time": "8 Apr 2007 — 2:40pm",
      "content": "I am meeting with them next week to hash out design changes. In the mean time I thought I would share this redraw of the hand, which I think addresses a lot of concerns. I still like the idea of the fingers blending smoothly into the circle, so I am stubbornly clinging to that for now.\n\n ![](http://web.archive.org/web/20131019102341im_/http:/typophile.com/files/WCSNC4_3624.jpg)\n\n"
    },
    {
      "time": "9 Apr 2007 — 4:51am",
      "content": "I'm no expert but to me the thumb looks a little small compared to the rest of the hand. I'm also in favor of making the hand more detailed, like you've done now.\n\nHave you tried placing the stars in a more random order aboove the hand? Instead of haveing them in a sort of curvy line, maybe a random placement would enforce the feeling of falling and catching.\n\nI really like the way you placed the text though.\n\n"
    },
    {
      "time": "9 Apr 2007 — 7:15am",
      "content": "Yeah, in the latest iteration, you lose the hand. For some reason, it looks like a whale and reminds me of the old SeaWorld logo from when I was younger.\n\n ![](http://web.archive.org/web/20131019102341im_/http:/typophile.com/files/sw_logo_5108.jpg)\n\n"
    },
    {
      "time": "7 Oct 2007 — 6:04pm",
      "content": "Well, after many months I've finally revisited this logo and hopefully addressed the concerns mentioned in this thread... and those of my \"client\" as well. I'd love any additional feedback you'd care to share. All the comments here were incredibly helpful to me, and I really appreciated everyone's input.\n\n ![](http://web.archive.org/web/20131019102341im_/http:/typophile.com/files/Final%20Iteration_6201.jpg)\n\n"
    },
    {
      "time": "11 Oct 2007 — 12:48am",
      "content": "The lengths of the four fingers suggest you're depicting a right hand, but the position of the thumb suggest it's a left hand. What gives?\n\nBTW, \"dazed fish\" association still not cleared, I'd say.\n\n"
    },
    {
      "time": "11 Oct 2007 — 10:19am",
      "content": "Yes, I see what you mean. I'll see if I can address that. It is meant to be a right hand and the thumb should appear to be closest of all the fingers. It now has sort of a simeon stretch to it. I'll tweak it more later. Thanks for that feedback. I was blind to it before you mentioned it.\n\nOf note, I am trying VERY hard to avoid looking too much like the United Way hand.\n\n"
    },
    {
      "time": "11 Oct 2007 — 6:37pm",
      "content": "the thumb is deffo on the left it appears.\n\nwhy not take it from a photograph and trace over it? this way the scale and proportion would look perfect.\n\n"
    },
    {
      "time": "16 Oct 2007 — 12:08pm",
      "content": "Isn't it when something is closer it's larger and when it's further it's smaller.\n\nI'd go with a left hand instead of a right hand and just change the middle/ring finger lengths, that would be a more appealing solution than a giant thumb.\n\n"
    }
  ]
}
