{
  "id": "32405",
  "title": "\"Helvetika\": surprising story from designer of Star Wars logo",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "While Googling the name of Helvetica's designer, Max Miedinger, I came upon [this startling account](http://web.archive.org/web/20131021232432/http:/suzyriceimage.com/AUTOBIOGRAPHY_2.html) by Susan Elizabeth (Suzy) Rice, creator of the Star Wars logo.\n\nIf her words are to be taken literally, then Joseph Goebbels designed a typeface! I'm thinking that perhaps he gave the order to start using sans serif faces, but as far as designing a face himself... Sheesh. Does anyone have information on this, or any idea what book about German type design Ms. Rice might be referring to? (And Gary Hustwit, do you have any thoughts on this?)\n\n",
  "author": "Ricardo Cordoba",
  "time": "20 Mar 2007 — 12:29pm",
  "uid": "7716",
  "comments": [
    {
      "time": "20 Mar 2007 — 12:45pm",
      "content": "I think she must have got that info from \"2002 Honest Fonts\" -- now sadly offline.\n\n"
    },
    {
      "time": "20 Mar 2007 — 1:00pm",
      "content": "I have read most of that (rambling…) post by Ms Rice & there are a lot of inaccuracies in there. Especially about the Nazi's having designed the forerunner of Helvetica. (BTW The german spelling of Helvetica is Helvetica and NOT Helvetika).  \nAnother miss: the alleged authorship of the early Disney-cartoons. It is widely accepted nowadays that Mr Disney's collaborators had a greater part that they got credited for, especially Ub Iwerks who gave life to Mickey Mouse.  \nMy conclusion: it's a lot of b\\*llsh\\*t.\n\n"
    },
    {
      "time": "20 Mar 2007 — 1:09pm",
      "content": "Suzy also took part in a discussion a couple of years ago on Typographica that touched on this:\n\n[http://typographi.com/001002.php](http://web.archive.org/web/20131021232432/http:/typographi.com/001002.php \"http://typographi.com/001002.php\")\n\n"
    },
    {
      "time": "20 Mar 2007 — 1:18pm",
      "content": "Thanks for that link, Mark.\n\nBert, I feel like there are many inaccuracies in that account, too.\n\nNick, can you tell a bit more about \"2002 Honest Fonts\"? What it was about, who created it? I don't think I ever had the pleasure.\n\n"
    },
    {
      "time": "20 Mar 2007 — 2:11pm",
      "content": "2002 honest fonts... [http://web.archive.org/web/\\*/http://www.somethingawful.com/fake/fontsite...](http://web.archive.org/web/20131021232432/http:/web.archive.org/web/*/http:/www.somethingawful.com/fake/fontsite/index.htm \"http://web.archive.org/web/\\*/http://www.somethingawful.com/fake/fontsite/index.htm\")\n\ngone but not forgotten.\n\n\\>I came upon this startling account\n\n\"Facts. Accuracy. A Jedi craves not these things.\"\n\n"
    },
    {
      "time": "20 Mar 2007 — 2:12pm",
      "content": "I added quotation marks around \"Helvetika\" in the title of this post. Thanks, Mr. Vanderveen!\n\n"
    },
    {
      "time": "20 Mar 2007 — 2:17pm",
      "content": "Thanks, Si... good ole Way Back Machine!\n\nNow I understand Nick's subtle comment. ;-D\n\n"
    },
    {
      "time": "20 Mar 2007 — 3:26pm",
      "content": "Thanks SI.  \nI was thinking of this ad from the site:\n\n ![](http://web.archive.org/web/20131021232432im_/http:/typophile.com/files/Gramps_5228.jpg)\n\n"
    },
    {
      "time": "20 Mar 2007 — 4:06pm",
      "content": "Helvetica: as American as pizza and apple pie! ;-)\n\nThanks for the laugh, Nick!\n\n"
    },
    {
      "time": "20 Mar 2007 — 9:09pm",
      "content": "<cite>it is Goebbels' type design that is regarded as being the origination<br>\nof what was later (re)designed by Miedinger and named as Helvetica</cite>\n\nWhat a bunch of nonsense.\n\n"
    },
    {
      "time": "20 Mar 2007 — 9:45pm",
      "content": "Danke, Gary. :-)\n\n"
    },
    {
      "time": "20 Mar 2007 — 10:01pm",
      "content": "[Erik Spiekermann has identified Schelter Grotesk as being the original model for Akzidenz](http://web.archive.org/web/20131021232432/http:/typophile.com/node/27912), although without much elaboration. Definitely not the work of Goebbels.\n\nAnd I would love to find some more information on the Helvetica/Schelter Grotesque connection, because in Meggs claimed Akzidenz to be the predecessor in _History of Graphic Design_, and that has been reprinted as fact in other books on type.\n\n"
    },
    {
      "time": "20 Mar 2007 — 10:19pm",
      "content": "If she thinks her logo even remotely resembles Helvetica, then this German proto-Helvetica she refers to could be any Grotesk, even Futura.\n\n"
    },
    {
      "time": "20 Mar 2007 — 10:19pm",
      "content": "Thanks for the link, jpad -- very useful information from Herr Spiekermann. I can't find any index entries for Schelter Grotesque in the books I have at home... Maybe this would require visiting a public library.\n\n"
    },
    {
      "time": "21 Mar 2007 — 3:45am",
      "content": "im not really sure how much this scheltersche-helvetica-link is a PR-story to sell FF Bau and how much it is really worth. when looking at the german specimen book that is available to me (a fat one by bauersche schriftgiesserei around 1900), many grotesks at that time (or earlier, in the 1880ies) could've been a precedessor to helvetica, altough they're wackier than scheltersche. but then again, why look 70 years from the starting point of helvetica, why not a bit less and look at AG?\n\nbut im by no way an expert myself, so this is all speculation and i would be very interested in hearing eriks extended view of this issue, and why exactly he thinks scheltersche grotesk is the father of helvetica.\n\nfor german readers: [http://www.fontblog.de/C420185419/E430231085/index.html](http://web.archive.org/web/20131021232432/http:/www.fontblog.de/C420185419/E430231085/index.html \"http://www.fontblog.de/C420185419/E430231085/index.html\")\n\n"
    },
    {
      "time": "21 Mar 2007 — 4:47am",
      "content": "As they say, a picture is worth...\n\n ![](http://web.archive.org/web/20131021232432im_/http:/typophile.com/files/haas1_6117.jpg)\n\nHere's a still from the film, of Haas' original trials of Neue Haas Grotesk. Akzidenz Grotesk one line, Neue Haas Grotesk the next. I've seen a fair amount of the materials associated with the creation of Helvetica, and AG was the only other typeface I saw in this context.\n\nImage courtesy of Alfred Hoffmann.\n\nCheers,\n\n-Gary\n\n"
    },
    {
      "time": "21 Mar 2007 — 8:49am",
      "content": "Hmm. Looks like Arial is every bit as original as Helvetica.  \nAnd one has to admire the irony with which Robin and Patricia straightened out the R leg that Max had bent.~\n\n"
    },
    {
      "time": "21 Mar 2007 — 9:51am",
      "content": "What was that quote again, bad artists steal, great artists appropriate?\n\n"
    },
    {
      "time": "21 Mar 2007 — 9:59am",
      "content": "Hey, if thinking Goebbels made Helv would reduce its use, I'm all for it! :-)\n\nhhp\n\n"
    },
    {
      "time": "21 Mar 2007 — 10:05am",
      "content": "\"Speaking of earlier types, Goudy says: The old fellows stole all of our best ideas.\"  \n--Frederic Goudy\n\n"
    },
    {
      "time": "21 Mar 2007 — 10:36am",
      "content": "\"Talent borrows, genius steals.\"  \n-Oscar Wilde\n\n"
    },
    {
      "time": "21 Mar 2007 — 1:59pm",
      "content": "I'm working on a theory that could hang Helvetica on a white southern (USA) male of Scotch-Irish extraction. That should kill it.\n\n"
    },
    {
      "time": "21 Mar 2007 — 3:35pm",
      "content": "_why look 70 years from the starting point of helvetica, why not a bit less and look at AG?_\n\nRight on, Thierry. And it's what most published accounts on the origins of Helvetica state.\n\nGary, great picture. Is there some way to send it to Suzy Rice? ;-D  \nCan't wait to see your film, even if I have to go to Rochester or Seattle to see it. :-)\n\n"
    },
    {
      "time": "21 Mar 2007 — 8:12pm",
      "content": "What's that Seattle biz? I haven't seen anything mentioning it coming here. Typecon? If it's being screened beforehand, count me in!\n\n"
    },
    {
      "time": "21 Mar 2007 — 9:54pm",
      "content": "Yup. [August 1st.](http://web.archive.org/web/20131021232432/http:/helveticafilm.com/screenings.html) (Scroll all the way to the bottom to see the TypeCon date.) See ya there, Dan! :-)\n\n"
    },
    {
      "time": "21 Mar 2007 — 10:13pm",
      "content": "As to the Star Wars thing, a student at my school had to do a mock \"type specimen\" with a history and example of a typeface. He grabbed the crap shareware \"Star Wars\" typeface off of God-knows-where and used it for his piece. The history he showed mentioned that it was a variation of Helvetica Black.\n\nI thought to myself, you've got to be kidding. NOT EVEN REMOTELY SIMILAR, and yet you parade your ignorance before the whole world? Sheesh.\n\n"
    },
    {
      "time": "22 Mar 2007 — 7:09am",
      "content": "They're all wrong. Al Gore created Helvetica.\n\n"
    },
    {
      "time": "22 Mar 2007 — 7:11am",
      "content": "This thread reminded me of an illustration from Milton Glaser's [Design of Dissent](http://web.archive.org/web/20131021232432/http:/www.amazon.com/Design-Dissent-Socially-Politically-Graphics/dp/1592533078/ref=pd_bbs_sr_1/104-9825562-5367963?ie=UTF8&s=books&qid=1174572452&sr=8-1) showing an Arial alphabet in which swastikas had been grafted onto [dots](http://web.archive.org/web/20131021232432/http:/lsdspace.com/tipo/tipo.html#atypi), punctuation, etc.\n\n"
    },
    {
      "time": "22 Mar 2007 — 7:52am",
      "content": "\\>Arial alphabet in which\n\nThe designer of that piece, a Spanish designer I believe, gave a talk at ATypI Helsinki in which the joke was explained.\n\nBack on topic, clearly Suzy drank a bit too much Romulan Ale when she wrote that article, or relied on \"the force\" instead of doing real research.\n\n"
    },
    {
      "time": "22 Mar 2007 — 8:07am",
      "content": "_Romulan Ale_\n\nWrong universe. :-)\n\nHarking back to that Typographica discussion, I too was skeptical of her explanation. But I have the Star Wars DVD set with all the extras and, sure enough, they did use an outlined Helvetica Black in the early ads, not the famous logo. I think she really did start with that, redrawing it by eye, taking some liberties with the forms, stylizing this and that, and ended up with something quite different.\n\n"
    },
    {
      "time": "22 Mar 2007 — 10:56am",
      "content": " ![](http://web.archive.org/web/20131021232432im_/http:/typophile.com/files/bbs_6715.jpg)\n  \nBarnhart Brothers & Spindler: _Modern Gothic,_ from their _Preferred Type Faces_ (Specimen Book No. 10), Chicago, 1913. Apologies for my temperamental scanner, but it's kinda cool ennit. \n"
    },
    {
      "time": "22 Mar 2007 — 11:35am",
      "content": "Romulan Ale  \nWrong universe. :-)  \n...\n\nYes, I think she drank too much blue milk.\n\nJason c\n\n"
    },
    {
      "time": "23 Mar 2007 — 2:32pm",
      "content": "Can someone please explain to me the graphics gallery on Suzy's website? I'm trying to understand how someone who created the Star Wars logo went on to produce the stuff displayed on her site.\n\n"
    },
    {
      "time": "23 Mar 2007 — 3:52pm",
      "content": "She was seduced by the dark side?\n\n"
    },
    {
      "time": "23 Mar 2007 — 3:57pm",
      "content": "Star Wars was intentionally cheesy; maybe George purposely hired someone who was likely to churn out a cheesy logo reminiscent of space operas.\n\n"
    },
    {
      "time": "24 Mar 2007 — 3:42am",
      "content": "Hell yes, helvetica was developed during the Civil War. :D  \nCatastrophic\n\n"
    },
    {
      "time": "24 Mar 2007 — 8:45am",
      "content": "There are a lot of parallels between fonts and Star Wars... clone wars, good, evil, droids, trade federation (ATypI), odd-ball characters etc., etc.,\n\n"
    },
    {
      "time": "24 Mar 2007 — 9:17am",
      "content": "PostScript syntax Yoda's speech mannerisms reads like.\n\n"
    },
    {
      "time": "24 Mar 2007 — 10:41pm",
      "content": "The Force = notan?\n\n"
    },
    {
      "time": "25 Mar 2007 — 8:05am",
      "content": "Well, there's certainly a lot of orientalism in Star Wars.  \nWhich is most definitely not cheesy.\n\nhhp\n\n"
    },
    {
      "time": "25 Mar 2007 — 10:52am",
      "content": "The plot of Star Wars always struck me as being straight out of a medieval romance, so a sort of high-tech blackletter would have been cool.  \nBut thank the Force it was before the Trajan invasion.  \nThe block sans mod (especially version 2 with the ligatures), owes something to Ed Benguiat's Planet of the Apes logo.\n\n ![](http://web.archive.org/web/20131021232432im_/http:/typophile.com/files/B00004W21Q_5438.01.LZZZZZZZ.jpg)\n  \n\n ![](http://web.archive.org/web/20131021232432im_/http:/typophile.com/files/003_STARWARCRP~Star-Wars-Posters_6536.jpg)\n  \n\n ![](http://web.archive.org/web/20131021232432im_/http:/typophile.com/files/SW_6118.jpg)\n\nOn a related note, The Lord of the Rings logo was a real disappointment, especially as JRR Tolkein created his own runic alphabet and language (how cooly metaversal is that). Roman lettering is completely wrong -- uncials would have been more acceptable.\n\n"
    },
    {
      "time": "25 Mar 2007 — 4:55pm",
      "content": "Geez, I had no idea the DVD cover for \"Planet of the Apes\" gives away the ending of the movie. That's just D-U-M-B. Or mean. :-D\n\nAs for \"Lord of the Rings\", Ralph Bakshi's 1978 feature had just that: uncials!\n\n ![](http://web.archive.org/web/20131021232432im_/http:/typophile.com/files/The_Lord_of_the_Rings_(1978)_3986.jpg)\n\n"
    },
    {
      "time": "25 Mar 2007 — 7:26pm",
      "content": "\\> On a related note, The Lord of the Rings logo was a real disappointment,\n\nThat would be the 'localized' version of the logo, the original hand drawn on parchment flyers distributed around the Shire where much better.\n\n"
    },
    {
      "time": "24 May 2009 — 8:05pm",
      "content": "A Very old thread, but still relevant.  \nIt seems many have questioned Suzi Rice's claim to the authorship of the star wars logo...  \nThere are strong questions concerning her grasp, or mastery of type and it's derivations.  \nThere is an absolute disconnect of the present, pridefully posted, yet disastrous work, and that of 1977's star wars logo.  \nIt is incongruous for the artistic direction behind a successful design to have to argue for pages with such indirect, and circumstantial references.  \nHer need for credit is clear, but her claims amount to hearsay. She lacks the ease or control of a confident designer, as exhibited by her choice of arguments.  \nShe is making a desperate claim to an artistry obviously just beyond her own graphic ability.  \nHer on-line portfolio proves her inability to differentiate quality.  \nLooking back into her bio page... I noticed that her husband of that era was Tony Lane. The plot thickens...He might've known something about type?\n\n"
    },
    {
      "time": "25 May 2009 — 9:56am",
      "content": "_It seems many have questioned Suzi Rice’s claim to the authorship of the star wars logo_\n\nCan you cite any examples, Aaron? Your comment has more assumptions than facts. Also, her website is [under reconstruction as of May 18](http://web.archive.org/web/20131021232432/http:/suzyriceimage.com/).\n\n"
    },
    {
      "time": "31 Aug 2010 — 11:22pm",
      "content": "It's worth noting that the Star Wars logo's typeface-style borrowing from Planet of the Apes's typeface style may not be serendipitous. Star Wars was perhaps the most thoroughly marketed science-fiction film up until the time of its release. The previous record holder was Planet of the Apes. The folks marketing Star Wars studied Planet of the Apes's marketing campaign when they were designing their own campaign, so they would have been heavily exposed to that logo.\n\n"
    },
    {
      "time": "23 Sep 2010 — 12:25am",
      "content": "Please read the \"UPDATE, September 23, 2010\" at the footer of my post at this page:\n\n[http://suzyriceimage.com/gallery/about/](http://web.archive.org/web/20131021232432/http:/suzyriceimage.com/gallery/about/ \"http://suzyriceimage.com/gallery/about/\")\n\nScroll to the bottom for the UPDATE.\n\nTo this site's owner, the remarks I make on that UPDATE are not for purposes of derogating your site, which is nice. I'm addressing the remarks in my UPDATE to the immature few making such foolish remarks here.\n\n[http://suzyriceimage.com/gallery/about/](http://web.archive.org/web/20131021232432/http:/suzyriceimage.com/gallery/about/ \"http://suzyriceimage.com/gallery/about/\")  \nScroll to bottom, read \"UPDATE, September 23, 2010\"\n\n"
    },
    {
      "time": "23 Sep 2010 — 12:27am",
      "content": "@ jennings and a few of the rest of you:\n\nMy site is composed with actual events that I lived through and experienced in my lifetime. There are always people such as yourself who can't fathom the achievements of others, but I assure you, the STAR WARS logo was one I drew, by hand, and in the presence of other people. Your suggestions to the contrary are bizarre, to say the least.\n\n"
    },
    {
      "time": "23 Sep 2010 — 12:38am",
      "content": "@ Nick Shinn - 25.Mar.2007 10.52am\n\nThat \"receding perspective\" Star Wars logo on that poster you've displayed there (second from top) was the logo that was drawn by Dan Perri.\n\nThe logo I drew is presented in that additional poster you presented, third from the top (or, the last one presented at the bottom of your stack of images).\n\nDan Perri was contracted to design the titles(\\*) for the film (\"Star Wars\" later titled \"Star Wars, Episode IV...\"). Thus, that receding perspective logo he drew; which, however, didn't work visually for George when he applied it to the screen, in the title treatment.\n\nThus, the logo (last poster in your stack there) I drew for the Exhibitor's Bid Brochure (\"STAR WARS\" stacked on two lines), which George liked, he used to replace Perri's logo. That's how my logo ended up being the main title treatment and, of course, trademarked in use for the entire film episodes, all, as also marketing of the film, etc.\n\nI also designed a poster for John Williams and touring symphony performance of the soundtrack, which George liked and used as Christmas cards for Lucasfilm later, as also some marketing elements I designed later once the logo I designed/drew was just about everywhere used for everything.\n\n(\\*) titles for a film, or, a \"title treatment\" is the visual stream of typed information that is embedded in a motion picture to present a film's credits;\n\nWhereas, a \"logo\" is the name or title of a film only.\n\nThus, a title treatment INCLUDES a logo or title-in-type but also includes the full array of credit information, and is a \"treatment\" or type of animation-of-sorts that is embedded in a film (how the typed information is designed to show visually, etc., a \"treatment\" of \"title\").\n\n"
    },
    {
      "time": "23 Sep 2010 — 6:49am",
      "content": "According to MyFonts, Schelter Grotesk was originally called Breite Grotesk, and appeared \"in the 1886 specimen book of the Schelter & Giesecke foundry\". The specimen there does look more like Helvetica than Akzidenz Grotesk does.\n\nHowever, the original Breite Grotesk seems not to have been identical to the the Schelter Grotesk specimen on MyFonts:\n\n[http://www.flickr.com/photos/20994543@N04/4552638955/](http://web.archive.org/web/20131021232432/http:/www.flickr.com/photos/20994543@N04/4552638955/)\n\nInstead, that looks simply like many of the other sans-serif faces of the same period, without much that suggests, at least to my untrained eye, that it is a precursor of Helvetica, which differs in important ways from the old Grotesques.\n\n"
    }
  ]
}
