{
  "id": "32416",
  "title": "Soho - Versatile slab serif",
  "forum": "Release",
  "tags": [
    "Release"
  ],
  "content": "Hello All,\n\nJust to say I have a new typeface release out. It's called 'Soho'.  \nNice PDF and all the details can be found here...\n\n[www.monotypefonts.com/soho](http://web.archive.org/web/20131015001956/http:/www.monotypefonts.com/soho \"www.monotypefonts.com/soho\")\n\nCheers,\n\nSeb\n\n",
  "author": "Seb Lester",
  "time": "20 Mar 2007 — 4:48pm",
  "uid": "17456",
  "comments": [
    {
      "time": "20 Mar 2007 — 5:14pm",
      "content": "Cheers! This face reminds me a bit of something I saw recently but I can't put my finger on it.\n\n"
    },
    {
      "time": "20 Mar 2007 — 5:19pm",
      "content": "does it remind you of that flash UK p[aper?? Youre a brit aren't you Nigella?\n\nMuzz\n\n"
    },
    {
      "time": "20 Mar 2007 — 5:38pm",
      "content": "Dear Muzz,\n\nI don't think it was a newspaper but a bespoke typeface for something else like a bank maybe? I forget but it's lovely to have so many weights to choose from!\n\n"
    },
    {
      "time": "20 Mar 2007 — 5:42pm",
      "content": "Nige:\n\nI didn't realise bnks were into custom typefaces! I think that there are too many wights to choose from personally. Why did you do so many Seb?? Isn't it a bit over the top like Rambo in the movie of the same naem?\n\nMuzz\n\n"
    },
    {
      "time": "20 Mar 2007 — 6:19pm",
      "content": "\\>Why did you do so many Seb??\n\nBecause someone will always want a weight you didn't do.\n\nI guess I've just tried to cover all the bases. :-)\n\n"
    },
    {
      "time": "20 Mar 2007 — 6:33pm",
      "content": "ah ok. kinda like when i drink 15 beers then have gone so far I might as well keep going till I \\*\\*\\*\\* or fight??\n\nMuzz\n\n"
    },
    {
      "time": "20 Mar 2007 — 8:22pm",
      "content": "Sebastian, congratulations on another beautiful typeface. I'm sure it will find a lot of use...\n\n"
    },
    {
      "time": "21 Mar 2007 — 3:12am",
      "content": "Eye-poppingly gorgeous at an eye popping price! Unfortunately £1106.00 is a gold-winning olympic leap past my lowly freelancers wallet.\n\n"
    },
    {
      "time": "21 Mar 2007 — 4:10am",
      "content": "Thanks Chris.\n\n\\>Eye-poppingly gorgeous at an eye popping price!\n\nI'm glad you like the face Colin. Listen, 32,668 glyphs.  \nThat's 3p per glyph, which is virtually giving it away.:-)  \nThere will be standard OT fonts available at some point soon  \nwhich might be more within your budget.\n\n"
    },
    {
      "time": "21 Mar 2007 — 4:38am",
      "content": "Thanks for the reply Sebastian.\n\nYes it is indeed good value if you put it like that but it's still priced way out of my league. I'd have my credit card out in a flash if it was nearer £500 so I'll hold out for some alternative pack or format options in the future.\n\nAre there any package prices/discount options for (Regular Non-italics - Thin. Extra Light, Light, Regular, Medium, Bold, Extra Bold, Heavy and Ultra ++ the Condensed Pack)? The Starter Pack is too basic and there doesn't seem to be anything between this and the Professional Pack. I don't use italics in my work much and the individual weight prices are a little costly when trying to build custom packs.\n\nThanks again,  \nColin\n\n"
    },
    {
      "time": "21 Mar 2007 — 5:05am",
      "content": "Hi Colin,\n\nI understand. Speaking entirely personally I like the  \nidea of someone being able to buy a set of 6 or 12 fonts  \nof their choosing at a discount but I don't make  \nthose decisions and I imagine it would probably be  \ndifficult to implement ecommerce wise.\n\nStandard OT fonts will be available soon and I'll  \nmention your suggestions. Cheers.\n\n"
    },
    {
      "time": "21 Mar 2007 — 7:05am",
      "content": "I like the way you have managed to get a cleaner and more open look in the slab serif style. And well executed--congratulations!\n\nWhat tools did you use in developing your multiple weights?\n\n"
    },
    {
      "time": "21 Mar 2007 — 8:07am",
      "content": "Hello William,\n\nThanks.\n\nI used the multiple master tools in FontLab.  \nHowever it's still been a very protracted and drawn  \nout process. No magical solution or secret tools  \nunfortunately that I'm aware of. What MM does help  \nwith is consistency of shapes across weights once  \nyou get it working properly.\n\n"
    },
    {
      "time": "21 Mar 2007 — 8:31am",
      "content": "Sebastian - Soho hits a nice sweet spot in slab land. It's clear you've been reading [the _Guardian_](http://web.archive.org/web/20131015001956/http:/www.guardian.co.uk/theguardian/story/0,,1566047,00.html) and it's not a bad idea to offer something of the same flavor to those who appreciate [Schwartz's](http://web.archive.org/web/20131015001956/http:/christianschwartz.com/gdnegyp.shtml) and Barnes' work on that paper.\n\nI'm interested in how you came about the double-story lowercase 'g'. The connection between bowls is very cramped. Do you not recommend this 'g' for small settings?\n\n"
    },
    {
      "time": "21 Mar 2007 — 10:41am",
      "content": "Thanks Stephen,\n\nJust for the record Soho was well under way in mid 2004.  \nSoho is in many respects Neo Slab. As early as 2003 it  \nwas clear that slabs were gaining momentum in the UK in  \na big way and I wanted to try to capitalise on that.\n\nI showed the design as a 'coming soon' design in May 2005  \nat a presentation for Faces in the UK. I showed slides of the  \nunreleased sans and the slab serif versions. It didn't arrive  \nuntil nearly two years later because I bit off more than I could  \nchew in my spare time. It was originally a much bigger project  \nand if I'd stuck to the original plan it wouldn't have got  \nreleased until 2037.\n\nI personally like the fullness and openness of the g you mention.  \nI don't personally think there is a problem until you go under 10pt.  \nWith 3 g's to choose from I'm hoping there's one for every occasion.\n\n"
    },
    {
      "time": "21 Mar 2007 — 12:31pm",
      "content": "Thanks for the background, Sebastian. It's easy for us critics and users to forget how many years can pass from initial concept to release. Don't be afraid of revealing what inspired you along the way, be it Guardian Egyptian or otherwise.\n\nAnd thank you for the 3 'g's! I contend that the huge counters of your 2-story 'g' create a distracting heaviness in the center of the letter. But one of the great benefits of the OpenType era is that type makers are incorporating alternate forms where they might not have before.\n\n"
    },
    {
      "time": "21 Mar 2007 — 3:19pm",
      "content": "Hello Stephen,\n\nIn terms of influences I guess a nod to Dispatch by  \nCyrus Highsmith which must have influenced my decision  \nmaking on some level as the only 'modern' slab serif  \ndesign with multiple widths I was aware of at the time.\n\nDefinitely a nod to the open nature of Gerard Unger's  \ntypefaces like Argo and Dave Farey's Cachet which informed  \nthe design of Neo, the starting point for Soho. I've  \nalways liked both a great deal.\n\nThe Guardian typeface is excellent and may well have  \nhad an influence on some level since it's appearance  \nbut I've been working on this slab design for a long time.\n\nI actually dug out a slide from that May 05 presentation  \nwhich I'm attaching. The designs obviously matured since  \nthen and become more conservative but you can see where  \nit's heading.\n\n ![](http://web.archive.org/web/20131015001956im_/http:/typophile.com/files/28_6326.jpg)\n\n"
    },
    {
      "time": "21 Mar 2007 — 4:07pm",
      "content": "I am very fond of the Guardian Egyptian, and to my eyes Soho is a very different animal. The Guardian Egyptian is for a start not a true slab serif as it has angled serifs, rather than square ones, as this does. Its starting point is the proportions of traditional serifed faces, whereas Soho is much wider. It also has more prominent 'slabs'.\n\nLooking at the 'influences' I can definitely see the influence of Chachet on Neo Sans, but I don't see where the Argo comes in...\n\n"
    },
    {
      "time": "22 Mar 2007 — 4:48am",
      "content": "\\>Looking at the ‘influences’ I can definitely see the influence of  \n\\>Cachet on Neo Sans, but I don’t see where the Argo comes in…\n\nHi William,\n\nI'm just talking in broad terms about a sans design with  \nsuch open terminals. Argo is obviously more nuanced and 'typographic'.  \nI think Argo has influenced a lot of modern sans designs.\n\n"
    },
    {
      "time": "19 Apr 2007 — 2:40am",
      "content": "Lovely typeface.\n\nShould i upload photos of print-stuff that included Soho?\n\n"
    },
    {
      "time": "19 Apr 2007 — 4:09am",
      "content": "Oh yes, please. I would love to see the typeface in use.\n\n"
    },
    {
      "time": "14 May 2007 — 4:20pm",
      "content": "Sorry for delay cuidado,\n\nI wasn't being rude! I haven't been checking this thread and missed your post. I'd love to see the typeface in use myself. I've only seen Soho in 'proper' print use twice so far. Please post if you get the chance.\n\nCheers,\n\nSeb\n\n"
    },
    {
      "time": "17 May 2007 — 10:11pm",
      "content": "Looks really good. Congrats!\n\nT\n\n"
    },
    {
      "time": "18 May 2007 — 5:26am",
      "content": "Thanks Thomas, and congratulations on Hypatia Sans.\n\nI meant to say previously that anyone who was  \nput off by the pricing of Soho initially might  \nbe pleasantly surprised if they check them again.\n\nCheers,\n\nSeb\n\n"
    },
    {
      "time": "11 Aug 2007 — 7:57am",
      "content": "I browsed through a copy of the British GQ yesterday and just wanted to say that it seems like they're the first big magazine to have picked up Soho. They stopped using Gridnik completely and a lot of text is now set in different weights of Soho. I haven't realIy got any pictures except this very small one found here: [http://www.subscription.co.uk/covers/current/gq.jpg](http://web.archive.org/web/20131015001956/http:/www.subscription.co.uk/covers/current/gq.jpg \"http://www.subscription.co.uk/covers/current/gq.jpg\")\n\nI wonder if the american edition will pick up on it too, but usually Fred and co are doing their own thing in the US.\n\n"
    },
    {
      "time": "13 Sep 2007 — 3:25pm",
      "content": "It looks really nice and works well in GQ.  \nCongrats!\n\n"
    },
    {
      "time": "15 Jan 2008 — 3:01am",
      "content": "Hi Seb,  \nI purchased Soho for a project I am working on and am very happy with it. I have put a spread up here;\n\n[http://www.coroflot.com/adam\\_poole](http://web.archive.org/web/20131015001956/http:/www.coroflot.com/adam_poole)\n\nbut would be happy to send you a hard copy if you were interested.\n\nI am trying to get it plastered all over a VW van for another project too, assuming all goes well.\n\nCheers,  \nAdam\n\n"
    },
    {
      "time": "26 Jan 2008 — 1:41pm",
      "content": "Saw this in Grafik, but as another one said, I can't afford this now =/  \nBut lot's of cred for a really beautiful typeface!\n\n"
    }
  ]
}
