{
  "id": "32413",
  "title": "garamond premier pro stylistic alternates don't work in indesign",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Garamond premier pro display is installed via suitcase and in illustrator is working fine, stylistic alternate but in indesign is not working... Why is that? Other alternates work, for example discretionary alternates\n\n",
  "author": "gardenize",
  "time": "20 Mar 2007 — 2:16pm",
  "uid": "12817",
  "comments": [
    {
      "time": "20 Mar 2007 — 3:14pm",
      "content": "Can you be more specific? What version of InDesign are you using? What kind of computer and OS? Is there a particular glyph or glyphs with which you are seeing this? Is it in Roman fonts, Italic fonts, or both?\n\n"
    },
    {
      "time": "20 Mar 2007 — 3:36pm",
      "content": "I want an | a | glyph alternate and yes it exists. When I turn it on in opentype options in indesign it won't work.  \nIn the end what action does turn on stylistic alternates?\n\nI got it via pressing alternate a glpyh ( stylistic)  \nWindows XP; indesign cs2.\n\n ![](http://web.archive.org/web/20130914174438im_/http:/typophile.com/files/aa_5118.jpg)\n\nThis is in illustrator\n\n ![](http://web.archive.org/web/20130914174438im_/http:/typophile.com/files/abc_5425.jpg)\n\n"
    },
    {
      "time": "21 Mar 2007 — 10:20am",
      "content": "In InDesign, stylistic alternates are acessed through the glyph palette. You can, for example, find the regular 'a' in the palette and select its available alternates from the \"flyout\" menu of the letter itself. Unlike Illustrator, there is no way to \"apply\" the feature with a button or menu item.\n\nDoes that answer your question? I might be misunderstanding...\n\n"
    },
    {
      "time": "21 Mar 2007 — 4:20pm",
      "content": "Christopher,\n\nis there a reason why in Garamond Premier Pro, Adobe chose to include substituions of lowercase letters with their \"final\" forms in the \"salt\" (stylistic alternates) feature but did not include the same substitutions in one of the \"ssXX\" (stylistic set) features, e.g. ss04? Also, these glyphs are not substituted in the \"fina\" (final forms) feature.\n\nSince the glyphs in question are even named \"a.end\", \"d.end\" etc., associating them with the \"fina\" feature would be an intuitive choice.\n\nPlease also see my [contribution in the other thread devoted to stylistic alternates](http://web.archive.org/web/20130914174438/http:/typophile.com/node/32399#comment-192387).\n\nBest,  \nAdam\n\n"
    },
    {
      "time": "21 Mar 2007 — 8:06pm",
      "content": "\\> _why in Garamond Premier Pro, Adobe chose to include substituions of lowercase letters with their “final” forms in the “salt” (stylistic alternates) feature but did not include the same substitutions in one of the “ssXX” (stylistic set) features, e.g. ss04?_\n\nAm I right to believe that you think it would be a good idea if you could replace ALL the letters in a paragraph with their final forms, by simply applying one (or more) stylistic set(s)? Does the image below make any sense to you?\n\n ![](http://web.archive.org/web/20130914174438im_/http:/typophile.com/files/gpp_all_ends_5820.png)\n\n\\> _Also, these glyphs are not substituted in the “fina” (final forms) feature.  \nSince the glyphs in question are even named “a.end”, “d.end” etc., associating them with the “fina” feature would be an intuitive choice._\n\nReally? What happens if the apps decide to follow [the spec for 'fina'](http://web.archive.org/web/20130914174438/http:/partners.adobe.com/public/developer/opentype/index_tag6.html#fina) and make it active by default? Would you be happy to have to turn it off every time, because your text simply looks like this?:\n\n ![](http://web.archive.org/web/20130914174438im_/http:/typophile.com/files/gpp_some_ends_5882.png)\n\n"
    },
    {
      "time": "21 Mar 2007 — 9:32pm",
      "content": "\\> Does the image below make any sense to you?\n\nAh! This is the image I get if I apply \"stylistic alternate\" in Illustrator to a run of text set in Garamond Premier Pro. Of course it does not make sense, typographically, to apply \"salt\" to an entire paragraph as you did. Similarly, it would not make sense to apply \"ordn\" or \"subs\" to an entire paragraph. The user applies these features on his or her discretion, to the glyphs he or she needs.\n\nThere are numerous fonts out there which have stylistic sets that don’t work well when applied to entire words.\n\nTake Robert Slimbach’s wonderful creation, Poetica Std:\n\n ![](http://web.archive.org/web/20130914174438im_/http:/typophile.com/files/poetica1_4163.jpg)\n\nAm I suggesting that one should apply _ss07_ to an entire word or paragraph?\n\n ![](http://web.archive.org/web/20130914174438im_/http:/typophile.com/files/poetica2_3503.jpg)\n\nOr _ss11_?\n\n ![](http://web.archive.org/web/20130914174438im_/http:/typophile.com/files/poetica3_3798.jpg)\n\nNot really. One needs to apply the sets selectively, letter by letter.\n\n ![](http://web.archive.org/web/20130914174438im_/http:/typophile.com/files/poetica4_3688.jpg)\n\nStill, you have not explained why something that is doable in Illustrator (apply _salt_ to one, two or three letters at a time) should not be doable in InDesign (apply an _ssXX_ to the same glyphs to produce an analogous effect).\n\nPoetica includes both a \"sub A from [A.1 A.2 A.3 ...]\"-style _salt_ feature and eleven \"sub A by A.1\"-style _ssXX_ sets. Garamond Premier Pro does it otherwise. Why?\n\nRegards,  \nAdam\n\n"
    },
    {
      "time": "21 Mar 2007 — 11:14pm",
      "content": "\\> _Of course it does not make sense, typographically, to apply “salt” to an entire paragraph as you did._\n\nNo, what I did was to simulate the effect of including the same substitutions (present in 'salt') in one Stylistic Set, as you suggested.\n\n\\> _Similarly, it would not make sense to apply “ordn” or “subs” to an entire paragraph. The user applies these features on his or her discretion, to the glyphs he or she needs._\n\nFrom this I infer that you understand the differences between 'salt' and 'ssXX', and how they're NOT the same thing. The 'salt' feature is designed to be applied at the user's discretion — in the sense that he/she has the freedom to decide what should be done in a particular situation — whereas 'ssXX' is designed to be applied throughout and make changes to a wide range of elements without requiring the user's decision about every single one of them.\n\n\\> _There are numerous fonts out there which have stylistic sets that don’t work well when applied to entire words._\n\nI consider that a bad implementation/usage of stylistic sets.\n\n\\> _Not really. One needs to apply the sets selectively, letter by letter._\n\nThe appropriate feature to achieve such behavior is 'salt', not 'ssXX'.\n\n\\> _Still, you have not explained why something that is doable in Illustrator (apply salt to one, two or three letters at a time) should not be doable in InDesign (apply an ssXX to the same glyphs to produce an analogous effect)._\n\nYou've already answer that yourself: \"[...] it does not make sense, typographically [...]\".\n\n\\> _Poetica includes both a “sub A from [A.1 A.2 A.3 …]”-style salt feature and eleven “sub A by A.1”-style ssXX sets. Garamond Premier Pro does it otherwise. Why?_\n\nI was not involved in the development of neither Poetica or Garamond Premier, so I can't say what thoughts went into them. But my view is, when Poetica was developed the ideas behind OpenType features and their implementations in the applications were not as mature as they were by the time when Garamond Premier was developed. Technically wise, Garamond Premier might embody more best practices than Poetica does. That's the price of being a pioneer; nothing is certain, so there's a good chance of not getting it right at the first time.\n\n"
    },
    {
      "time": "21 Mar 2007 — 11:28pm",
      "content": "Miguel,\n\nthe **feature description for _ss01–ss20_** cites Poetica as an example. Are you saying that when _ssXX_ was conceived, with Poetica being used as an example, Poetica actually was a bad implementation of the _ssXX_ idea, because actually the idea was something else which however could not be exemplified at the time of the writing of the _ssXX_ feature description by anything better than Poetica, which was a bad implementation of the idea but nonetheless is the one cited as an example?\n\n\\> The appropriate feature to achieve such behavior  \n\\> [as in Poetica] is ‘salt’, not ‘ssXX’.\n\nBut what you’re saying **contradicts the OpenType specification** , because the OpenType specification (read my lips:) **uses Poetica as an example for _ssXX_!!!**\n\nAm I to assume that Adobe now recommends to contradict the OpenType specification and disregard its recommendations for the _ssXX_ feature because people who wrote up the _ss01–ss20_ feature description didn’t know what they were doing?\n\nOr what exactly is it that you’re saying, please? Thank you.\n\nA.\n\n"
    },
    {
      "time": "21 Mar 2007 — 11:41pm",
      "content": "OK, unlike you, I didn’t \"simulate\" anything here. I just typeset the paragraph in Illustrator CS2 using Adobe Garamond Pro, clicked on the frame and then simply clicked on the \"Stylistic Alternate\" button on the OpenType palette:\n\n ![](http://web.archive.org/web/20130914174438im_/http:/typophile.com/files/adobegaramondpro_4810.jpg)\n\nAn Illustrator CS2 user is able to enable or disable stylistic alternates on a per-glyph basis, but also on entire words, sentences, paragraphs or text frames. It is up to the user’s discretion to do or not to do this.\n\nSimilarly, an InDesign CS2 user is able to enable or disable stylistic sets on a per-glyph basis, but also on entire words, sentences, paragraphs or text frames. It is up to the user’s discretion to do or not to do this. The difference between Illustrator and InDesign is that the first gives you just one alternate and the second gives you up to twenty. Right?\n\nA.\n\n"
    },
    {
      "time": "21 Mar 2007 — 11:43pm",
      "content": "If we could redo Poetica's features today, we'd probably do a different combination of 'salt' and 'ssXX'. One possible solution comes to mind:\n\n`feature salt {\nsub A from [A.1 A.2 A.3];\nsub B from [B.1 B.2 B.3];\nsub C from [C.1 C.2 C.3];\n...\nsub Z from [Z.1 Z.2 Z.3];\n} salt;`\n\nfeature ss01 { # 1 -\\> 2  \nsub [A.1 B.1 C.1 ... Z.1] by [A.2 B.2 C.2 ... Z.2];  \n} ss01;\n\nfeature ss02 { # 1 -\\> 3  \nsub [A.1 B.1 C.1 ... Z.1] by [A.3 B.3 C.3 ... Z.3];  \n} ss02;\n\nfeature ss03 { # 2 -\\> 1  \nsub [A.2 B.2 C.2 ... Z.2] by [A.1 B.1 C.1 ... Z.1];  \n} ss03;\n\nfeature ss04 { # 2 -\\> 3  \nsub [A.2 B.2 C.2 ... Z.2] by [A.3 B.3 C.3 ... Z.3];  \n} ss04;\n\nfeature ss05 { # 3 -\\> 1  \nsub [A.3 B.3 C.3 ... Z.3] by [A.1 B.1 C.1 ... Z.1];  \n} ss05;\n\nfeature ss06 { # 3 -\\> 2  \nsub [A.3 B.3 C.3 ... Z.3] by [A.2 B.2 C.2 ... Z.2];  \n} ss06;\n\nIn other words, the user would be able to switch between the different \"flavors\" of Poetica via 'ssXX', but first he/she would need to specify where he/she would like to see an alternate form, via 'salt'.\n\n"
    },
    {
      "time": "22 Mar 2007 — 12:08am",
      "content": "Miguel,\n\nPoetica includes up to 9 alternate variants for each uppercase letter. You'd quickly run out of the 20 ssXX sets if you do it your way.\n\nEach of these variants forms a \\*set\\* across the alphabet, i.e. the D.swash5 glyph is of the same stylistic flavor as R.swash5 but of different flavor than R.swash8. So the way Poetica is implemented now actually makes perfect sense in the ssXX world, and makes sense in the salt world.\n\nAlso, while InDesign implements ssXX on an additive basis, Mac OS X’s Cocoa implementation is mutually exclusive. Poetica works well in the mutually exclusive world as well as in the additive world.\n\n\\> If we could redo Poetica’s features today, we’d probably  \n\\> do a different combination of ‘salt’ and ‘ssXX’. One  \n\\> possible solution comes to mind:\n\nTry another, something along the lines of:\n\n`feature salt {\nsub A from [A.1 A.2 A.3 ... A.9];\nsub B from [B.1 B.2 B.3 ... B.9];\nsub C from [C.1 C.2 C.3 ... C.9];\n...\nsub Z from [Z.1 Z.2 Z.3 ... Z.9];\n} salt;`\n\nfeature ss01 {  \nsub [A B C ... Z] by [A.1 B.1 C.1 ... Z.1];  \nsub [A.1 B.1 C.1 ... Z.1] by [A.2 B.2 C.2 ... Z.2];  \nsub [A.2 B.2 C.2 ... Z.2] by [A.3 B.3 C.3 ... Z.3];  \nsub [A.3 B.3 C.3 ... Z.3] by [A.4 B.4 C.4 ... Z.4];  \n...  \nsub [A.9 B.9 C.9 ... Z.9] by [A B C ... Z];  \n} ss01;\n\nfeature ss02 {  \nsub [A B C ... Z] by [A.2 B.2 C.2 ... Z.2];  \nsub [A.1 B.1 C.1 ... Z.1] by [A.3 B.3 C.3 ... Z.3];  \nsub [A.2 B.2 C.2 ... Z.2] by [A.4 B.4 C.4 ... Z.4];  \nsub [A.3 B.3 C.3 ... Z.3] by [A.5 B.5 C.5 ... Z.5];  \n...  \nsub [A.9 B.9 C.9 ... Z.9] by [A.1 B.1 C.1 ... Z.1];  \n} ss02;\n\nfeature ss03 {  \nsub [A B C ... Z] by [A.3 B.3 C.3 ... Z.3];  \nsub [A.1 B.1 C.1 ... Z.1] by [A.4 B.4 C.4 ... Z.4];  \nsub [A.2 B.2 C.2 ... Z.2] by [A.5 B.5 C.5 ... Z.5];  \nsub [A.3 B.3 C.3 ... Z.3] by [A.6 B.6 C.6 ... Z.6];  \n...  \nsub [A.9 B.9 C.9 ... Z.9] by [A.2 B.2 C.2 ... Z.2];  \n} ss09;\n\n...\n\nfeature ss09 {  \nsub [A B C ... Z] by [A.9 B.9 C.9 ... Z.9];  \nsub [A.1 B.1 C.1 ... Z.1] by [A B C ... Z];  \nsub [A.2 B.2 C.2 ... Z.2] by [A.1 B.1 C.1 ... Z.1];  \nsub [A.3 B.3 C.3 ... Z.3] by [A.2 B.2 C.2 ... Z.2];  \n...  \nsub [A.9 B.9 C.9 ... Z.9] by [A.8 B.8 C.8 ... Z.8];  \n} ss09;\n\nThe idea is that without any manually-applied _salt_, the user would switch everything to 1st set by applying _ss01_, to 2nd set by applying _ss02_, to 3rd set by applying _ss03_ etc. If the user had manually applied some stylistic alternates to some glyphs in his font, applying any of the _ssXX_ features would still \"upgrade\" or \"spice up\" his entire text \"by one set up\". And additive combination of the sets would have a yet more \"accelerating\" effect.\n\nA.\n\n"
    },
    {
      "time": "22 Mar 2007 — 12:23am",
      "content": "\\> _Are you saying that when ssXX was conceived, with Poetica being used as an example, Poetica actually was a bad implementation of the ssXX idea_\n\nThat's possible. My view is that the implementation in Poetica doesn't seem consistent with the result we expect, nowadays, when applying a Stylistic Set.\n\n\\> _But what you’re saying contradicts the OpenType specification, because the OpenType specification (read my lips:) uses Poetica as an example for ssXX!!!_\n\nDear Adam, you know, better than me, that some aspects of OpenType spec would benefit from a revision, to bring it up to date with our (as a community) current understanding and usage of the technology.\n\n\\> _Am I to assume that Adobe now recommends to contradict the OpenType specification and disregard its recommendations for the ssXX feature because people who wrote up the ss01–ss20 feature description didn’t know what they were doing?_\n\nNo. The people that initially wrote it had \\*very\\* good and well intentioned ideas, and knew perfectly well what they were doing. Nonetheless, with time ideas get more mature, and I'm of the opinion that some definitions in the OT spec would benefit from being polished and clarified.\n\nTake the ['rand' (Randomize) feature](http://web.archive.org/web/20130914174438/http:/partners.adobe.com/public/developer/opentype/index_tag8.html#rand) as an example; it is an excellent idea! Will it ever be implemented? Probably not. Why? Because after all these years we (and I mean font developers and app developers) realized that we can achieve the same result with 'calt'.\n\n"
    },
    {
      "time": "22 Mar 2007 — 12:30am",
      "content": "If anyone wants to try this as a proof-of-concept (including you Miguel), below is a more complete code snippet for a Poetica Std \"2.0\". If you own PoeticaStd.otf, open it in FontLab Studio 5, remove the existing feature code and replace it with the code below. Compile the features. FontLab Studio will ask you to create a bunch of \"O\" glyphs (because there are less O swashes than other glyphs, but let's disregard it for now) -- approve it.\n\nOnce the features are generated, in the OpenType Features preview panel check the test word:\n\n/W.swash2/A/N/A.swash5/W/A/N.swash3/D/A.swash1\n\n(This simulates a text string with manually inserted _salt_ alternates). Make sure you apply the _kern_ feature.\n\nThen apply _ssXX_ features mutually-exclusively, or additively. You will see that the entire text moves \"up and down\" within the respective sets, but maintaining the \"set distances\" between the manually-inserted altnerates:\n\n ![](http://web.archive.org/web/20130914174438im_/http:/typophile.com/files/poetica2a_4307.jpg)\n  \n\n ![](http://web.archive.org/web/20130914174438im_/http:/typophile.com/files/poetica2b_6150.jpg)\n  \n\n ![](http://web.archive.org/web/20130914174438im_/http:/typophile.com/files/poetica2c_6694.jpg)\n  \n\n ![](http://web.archive.org/web/20130914174438im_/http:/typophile.com/files/poetica2d_4510.jpg)\n\nAdam\n\n`@ss00 = [A B C D E F G H I J K L M N O P Q R S T U V W X Y Z];\n@ss01 = [A.swash1 B.swash1 C.swash1 D.swash1 E.swash1 F.swash1 G.swash1 H.swash1 I.swash1 J.swash1 K.swash1 L.swash1 M.swash1 N.swash1 O.swash1 P.swash1 Q.swash1 R.swash1 S.swash1 T.swash1 U.swash1 V.swash1 W.swash1 X.swash1 Y.swash1 Z.swash1];\n@ss02 = [A.swash2 B.swash2 C.swash2 D.swash2 E.swash2 F.swash2 G.swash2 H.swash2 I.swash2 J.swash2 K.swash2 L.swash2 M.swash2 N.swash2 O.swash2 P.swash2 Q.swash2 R.swash2 S.swash2 T.swash2 U.swash2 V.swash2 W.swash2 X.swash2 Y.swash2 Z.swash2];\n@ss03 = [A.swash3 B.swash3 C.swash3 D.swash3 E.swash3 F.swash3 G.swash3 H.swash3 I.swash3 J.swash3 K.swash3 L.swash3 M.swash3 N.swash3 O.swash3 P.swash3 Q.swash3 R.swash3 S.swash3 T.swash3 U.swash3 V.swash3 W.swash3 X.swash3 Y.swash3 Z.swash3];\n@ss04 = [A.swash4 B.swash4 C.swash4 D.swash4 E.swash4 F.swash4 G.swash4 H.swash4 I.swash4 J.swash4 K.swash4 L.swash4 M.swash4 N.swash4 O.swash4 P.swash4 Q.swash4 R.swash4 S.swash4 T.swash4 U.swash4 V.swash4 W.swash4 X.swash4 Y.swash4 Z.swash4];\n@ss05 = [A.swash5 B.swash5 C.swash5 D.swash5 E.swash5 F.swash5 G.swash5 H.swash5 I.swash5 J.swash5 K.swash5 L.swash5 M.swash5 N.swash5 O.swash5 P.swash5 Q.swash5 R.swash5 S.swash5 T.swash5 U.swash5 V.swash5 W.swash5 X.swash5 Y.swash5 Z.swash5];\n@ss06 = [A.swash6 B.swash6 C.swash6 D.swash6 E.swash6 F.swash6 G.swash6 H.swash6 I.swash6 J.swash6 K.swash6 L.swash6 M.swash6 N.swash6 O.swash6 P.swash6 Q.swash6 R.swash6 S.swash6 T.swash6 U.swash6 V.swash6 W.swash6 X.swash6 Y.swash6 Z.swash6];\n@ss07 = [A.swash7 B.swash7 C.swash7 D.swash7 E.swash7 F.swash7 G.swash7 H.swash7 I.swash7 J.swash7 K.swash7 L.swash7 M.swash7 N.swash7 O.swash7 P.swash7 Q.swash7 R.swash7 S.swash7 T.swash7 U.swash7 V.swash7 W.swash7 X.swash7 Y.swash7 Z.swash7];\n@ss08 = [A.swash8 B.swash8 C.swash8 D.swash8 E.swash8 F.swash8 G.swash8 H.swash8 I.swash8 J.swash8 K.swash8 L.swash8 M.swash8 N.swash8 O.swash8 P.swash8 Q.swash8 R.swash8 S.swash8 T.swash8 U.swash8 V.swash8 W.swash8 X.swash8 Y.swash8 Z.swash8];\n@ss09 = [A.swash9 B.swash9 C.swash9 D.swash9 E.swash9 F.swash9 G.swash9 H.swash9 I.swash9 J.swash9 K.swash9 L.swash9 M.swash9 N.swash9 O.swash9 P.swash9 Q.swash9 R.swash9 S.swash9 T.swash9 U.swash9 V.swash9 W.swash9 X.swash9 Y.swash9 Z.swash9];`\n\nfeature salt {  \nsub A from [A.swash1 A.swash2 A.swash3 A.swash4 A.swash5 A.swash6 A.swash7 A.swash8 A.swash9];  \nsub B from [B.swash1 B.swash2 B.swash3 B.swash4 B.swash5 B.swash6 B.swash7 B.swash8 B.swash9];  \nsub C from [C.swash1 C.swash2 C.swash3 C.swash4 C.swash5 C.swash6 C.swash7 C.swash8 C.swash9];  \nsub D from [D.swash1 D.swash2 D.swash3 D.swash4 D.swash5 D.swash6 D.swash7 D.swash8 D.swash9];  \nsub E from [E.swash1 E.swash2 E.swash3 E.swash4 E.swash5 E.swash6 E.swash7 E.swash8 E.swash9];  \nsub F from [F.swash1 F.swash2 F.swash3 F.swash4 F.swash5 F.swash6 F.swash7 F.swash8 F.swash9];  \nsub G from [G.swash1 G.swash2 G.swash3 G.swash4 G.swash5 G.swash6 G.swash7 G.swash8 G.swash9];  \nsub H from [H.swash1 H.swash2 H.swash3 H.swash4 H.swash5 H.swash6 H.swash7 H.swash8 H.swash9];  \nsub I from [I.swash1 I.swash2 I.swash3 I.swash4 I.swash5 I.swash6 I.swash7 I.swash8 I.swash9];  \nsub J from [J.swash1 J.swash2 J.swash3 J.swash4 J.swash5 J.swash6 J.swash7 J.swash8 J.swash9];  \nsub K from [K.swash1 K.swash2 K.swash3 K.swash4 K.swash5 K.swash6 K.swash7 K.swash8 K.swash9];  \nsub L from [L.swash1 L.swash2 L.swash3 L.swash4 L.swash5 L.swash6 L.swash7 L.swash8 L.swash9];  \nsub M from [M.swash1 M.swash2 M.swash3 M.swash4 M.swash5 M.swash6 M.swash7 M.swash8 M.swash9];  \nsub N from [N.swash1 N.swash2 N.swash3 N.swash4 N.swash5 N.swash6 N.swash7 N.swash8 N.swash9];  \nsub O from [O.swash1 O.swash2 O.swash3 O.swash4 O.swash5 O.swash6 O.swash7 O.swash8 O.swash9];  \nsub P from [P.swash1 P.swash2 P.swash3 P.swash4 P.swash5 P.swash6 P.swash7 P.swash8 P.swash9];  \nsub Q from [Q.swash1 Q.swash2 Q.swash3 Q.swash4 Q.swash5 Q.swash6 Q.swash7 Q.swash8 Q.swash9];  \nsub R from [R.swash1 R.swash2 R.swash3 R.swash4 R.swash5 R.swash6 R.swash7 R.swash8 R.swash9];  \nsub S from [S.swash1 S.swash2 S.swash3 S.swash4 S.swash5 S.swash6 S.swash7 S.swash8 S.swash9];  \nsub T from [T.swash1 T.swash2 T.swash3 T.swash4 T.swash5 T.swash6 T.swash7 T.swash8 T.swash9];  \nsub U from [U.swash1 U.swash2 U.swash3 U.swash4 U.swash5 U.swash6 U.swash7 U.swash8 U.swash9];  \nsub V from [V.swash1 V.swash2 V.swash3 V.swash4 V.swash5 V.swash6 V.swash7 V.swash8 V.swash9];  \nsub W from [W.swash1 W.swash2 W.swash3 W.swash4 W.swash5 W.swash6 W.swash7 W.swash8 W.swash9];  \nsub X from [X.swash1 X.swash2 X.swash3 X.swash4 X.swash5 X.swash6 X.swash7 X.swash8 X.swash9];  \nsub Y from [Y.swash1 Y.swash2 Y.swash3 Y.swash4 Y.swash5 Y.swash6 Y.swash7 Y.swash8 Y.swash9];  \nsub Z from [Z.swash1 Z.swash2 Z.swash3 Z.swash4 Z.swash5 Z.swash6 Z.swash7 Z.swash8 Z.swash9];  \n} salt;\n\nfeature ss01 {  \nsub @ss00 by @ss01;  \nsub @ss01 by @ss02;  \nsub @ss02 by @ss03;  \nsub @ss03 by @ss04;  \nsub @ss04 by @ss05;  \nsub @ss05 by @ss06;  \nsub @ss06 by @ss07;  \nsub @ss07 by @ss08;  \nsub @ss08 by @ss09;  \nsub @ss09 by @ss00;  \n} ss01;\n\nfeature ss02 {  \nsub @ss00 by @ss02;  \nsub @ss01 by @ss03;  \nsub @ss02 by @ss04;  \nsub @ss03 by @ss05;  \nsub @ss04 by @ss06;  \nsub @ss05 by @ss07;  \nsub @ss06 by @ss08;  \nsub @ss07 by @ss09;  \nsub @ss08 by @ss00;  \nsub @ss09 by @ss01;  \n} ss02;\n\nfeature ss03 {  \nsub @ss00 by @ss03;  \nsub @ss01 by @ss04;  \nsub @ss02 by @ss05;  \nsub @ss03 by @ss06;  \nsub @ss04 by @ss07;  \nsub @ss05 by @ss08;  \nsub @ss06 by @ss09;  \nsub @ss07 by @ss00;  \nsub @ss08 by @ss01;  \nsub @ss09 by @ss02;  \n} ss03;\n\nfeature ss04 {  \nsub @ss00 by @ss04;  \nsub @ss01 by @ss05;  \nsub @ss02 by @ss06;  \nsub @ss03 by @ss07;  \nsub @ss04 by @ss08;  \nsub @ss05 by @ss09;  \nsub @ss06 by @ss00;  \nsub @ss07 by @ss01;  \nsub @ss08 by @ss02;  \nsub @ss09 by @ss03;  \n} ss04;\n\nfeature ss05 {  \nsub @ss00 by @ss05;  \nsub @ss01 by @ss06;  \nsub @ss02 by @ss07;  \nsub @ss03 by @ss08;  \nsub @ss04 by @ss09;  \nsub @ss05 by @ss00;  \nsub @ss06 by @ss01;  \nsub @ss07 by @ss02;  \nsub @ss08 by @ss03;  \nsub @ss09 by @ss04;  \n} ss05;\n\nfeature ss06 {  \nsub @ss00 by @ss06;  \nsub @ss01 by @ss07;  \nsub @ss02 by @ss08;  \nsub @ss03 by @ss09;  \nsub @ss04 by @ss00;  \nsub @ss05 by @ss01;  \nsub @ss06 by @ss02;  \nsub @ss07 by @ss03;  \nsub @ss08 by @ss04;  \nsub @ss09 by @ss05;  \n} ss06;\n\nfeature ss07 {  \nsub @ss00 by @ss07;  \nsub @ss01 by @ss08;  \nsub @ss02 by @ss09;  \nsub @ss03 by @ss00;  \nsub @ss04 by @ss01;  \nsub @ss05 by @ss02;  \nsub @ss06 by @ss03;  \nsub @ss07 by @ss04;  \nsub @ss08 by @ss05;  \nsub @ss09 by @ss06;  \n} ss07;\n\nfeature ss08 {  \nsub @ss00 by @ss08;  \nsub @ss01 by @ss09;  \nsub @ss02 by @ss00;  \nsub @ss03 by @ss01;  \nsub @ss04 by @ss02;  \nsub @ss05 by @ss03;  \nsub @ss06 by @ss04;  \nsub @ss07 by @ss05;  \nsub @ss08 by @ss06;  \nsub @ss09 by @ss07;  \n} ss08;\n\nfeature ss09 {  \nsub @ss00 by @ss09;  \nsub @ss01 by @ss00;  \nsub @ss02 by @ss01;  \nsub @ss03 by @ss02;  \nsub @ss04 by @ss03;  \nsub @ss05 by @ss04;  \nsub @ss06 by @ss05;  \nsub @ss07 by @ss06;  \nsub @ss08 by @ss07;  \nsub @ss09 by @ss08;  \n} ss09;\n\n"
    },
    {
      "time": "22 Mar 2007 — 12:43am",
      "content": "Ps. The implementation shown above has interesting side-effects. E.g. applying ss01, ss04 and ss05 at the same time gives you the exactly original string back. This could be made slightly more interesting if each ssXX feature for each entry glyph moved at a different pace, e.g. ss01 could replace A with A.1, B with B.1, A.1 with A.2 and A.1 with B.2, but ss05 could replace A with A.5, B with B.5, A.1 with B.7 and B.1 with B.3, or something like that. Then additively combining various sets would give you very different combinations :)\n\nA.\n\n"
    },
    {
      "time": "22 Mar 2007 — 1:23am",
      "content": "\\> _Similarly, an InDesign CS2 user is able to enable or disable stylistic sets on a per-glyph basis, but also on entire words, sentences, paragraphs or text frames. It is up to the user’s discretion to do or not to do this. The difference between Illustrator and InDesign is that the first gives you just one alternate and the second gives you up to twenty. Right?_\n\nIt's true that one 'ssXX' can be seen as a subset 'salt'. In other words, 'salt' could be viewed as a 'ss00' (hypothetical Stylistic Set 0). BUT 'salt' is much more than a simple stylistic set, because it was designed to consider one-from-many (GSUB lookup type 3) substitutions as well as one-to-one (GSUB lookup type 1) substitutions, whereas 'ssXX' was only intended to be used with the latter type of substitutions.\n\nHaving said that, Illustrator's implementation of Stylistic Alternates is incomplete since it trims down 'salt' to only provide one-to-one substitutions (therefore you can only get access to the first alternate when pressing the button on the UI). And this implementation is flawed because it makes 'salt' behave like a simple 'ssXX', which subverts the initial intent of the feature. This also has the side effect of leading users to believe that the two features ('salt' & 'ss01') are the same, when in fact they were created with clear different intents of interaction in mind.\n\n"
    },
    {
      "time": "22 Mar 2007 — 1:34am",
      "content": "Miguel,\n\nto me, there no apparent reason why the first set of alternates provided by _salt_ should NOT be compatible with what _ss01_ offers. Of course, \\*in addition\\* _salt_ should give the user access to \\*all other\\* alternates offered by _ss01–ss20_. My principle is simple: whatever is in _ss01–ss20_ should \\*always\\* be in _salt_, because _salt_ is a superset of _ss01–ss20_, organized differently. _salt_ may contain additional glyphs that are not accessible through _ss01–ss20_ but anything that is accessible through _ssXX_ should also be accessible through _salt_.\n\nI don’t see why _salt_ (being \"stylistic alternates\") should NOT include any glyphs that are mapped to \"sets of stylistic alternates\", i.e. _ss01–ss20_.\n\nObviously, you know that there are two ways to access _salt_ in Illustrator: \"wide\" and \"deep\". The \"wide\" access through the \"Stylistic Alternate\" switch in the OpenType palette only gives access to the first alternate but can be applied to an arbitrarily long text. The \"deep\" access through the Glyph palette gives access to any alternates for a single glyph but can only be applied on a per-glyph basis.\n\nI think this is actually pretty good, and does its job well. I cannot really think of a reasonable user interface that would combine the \"wide\" and the \"deep\" access at the same time.\n\nTo me, simply speaking, salt and ssXX are one and the same matrix but rotated by 90 degrees -- see table:\n\n`+———+—————————+—————————+—————————+\n| — | salt(1) | salt(2) | salt(3) |\n| — | —— ss01 | —— ss02 | —— ss03 |\n+———+—————————+—————————+—————————+\n| A | ——— A.1 | ——— A.2 | ——— A.3 |\n| B | ——— B.1 | ——— B.2 | ——— B.3 |\n| C | ——— C.1 | ——— C.2 | ——— C.3 |\n+———+—————————+—————————+—————————+`\n\nor viewed from a different angle:\n\n`+—————————+—————————+—————+—————+—————+\n| ——————— | ——————— | — A | — B | — C |\n+—————————+—————————+—————+—————+—————+\n| salt(1) | —— ss01 | A.1 | B.1 | C.1 |\n| salt(2) | —— ss02 | A.2 | B.2 | C.3 |\n| salt(3) | —— ss03 | A.3 | B.3 | C.3 |\n+—————————+—————————+—————+—————+—————+`\n\nOf course, there may not be a 100% compatibility both ways if there are, say, more \"B\" alternates than \"C\" alternates because it is not possible to \"skip\" positions in the _salt_ indexes. So a realistic scenario might look like:\n\n`+———+—————————+—————————+—————————+\n| — | —— ss01 | —— ss02 | —— ss03 |\n+———+—————————+—————————+—————————+\n| A | ——— A.1 | ——— A.2 | ——— A.3 |\n| B | ——— B.1 | ——————— | ——— B.3 |\n| C | ——————— | ——— C.2 | ——————— |\n+———+—————————+—————————+—————————+`\n\n+———+—————————+—————————+—————————+  \n| — | salt(1) | salt(2) | salt(3) |  \n+———+—————————+—————————+—————————+  \n| A | ——— A.1 | ——— A.2 | ——— A.3 |  \n| B | ——— B.1 | ——— B.3 | ——————— |  \n| C | ——— C.2 | ——————— | ——————— |  \n+———+—————————+—————————+—————————+\n\nor viewed from a different angle:\n\n`+—————————+—————+—————+—————+\n| ——————— | — A | — B | — C |\n+—————————+—————+—————+—————+\n| —— ss01 | A.1 | B.1 | ——— |\n| —— ss02 | A.2 | ——— | C.2 |\n| —— ss03 | A.3 | B.3 | ——— |\n+—————————+—————+—————+—————+`\n\n+—————————+—————+—————+—————+  \n| ——————— | — A | — B | — C |  \n+—————————+—————+—————+—————+  \n| salt(1) | A.1 | B.1 | C.2 |  \n| salt(2) | A.2 | B.3 | ——— |  \n| salt(3) | A.3 | ——— | ——— |  \n+—————————+—————+—————+—————+\n\nOf course, the corresponding feature code for that would be:\n\n`feature salt {\nsub A from [A.1 A.2 A.3];\nsub B from [B.1 B.3];\nsub C from [C.2];\n} salt; `\n\nfeature ss01 {  \nsub [A B] by [A.1 B.1];  \n} ss01;\n\nfeature ss02 {  \nsub [A C] by [A.2 C.2];  \n} ss02;\n\nfeature ss03 {  \nsub [A B] by [A.3 B.3];  \n} ss03;\n\nBut I still need to hear a good reason why any _ssXX_ alternates would _not_ be included in _salt_.\n\nA.\n\n"
    },
    {
      "time": "22 Mar 2007 — 2:24am",
      "content": "Your ideas for Poetica are quite interesting. But being able to change the default set of glyphs (@ss00) directly by any of the other sets still makes me uncomfortable.\n\nIn fact, I was just looking at the specimen book\\* and it's clear that the different sets of capitals were not designed to be interchangeable, at least not all of them. Most of the alternate capital forms are swash versions, therefore changing from plain capitals to swash capitals is a job for 'swsh', not a stylistic sets. Of course, once the basic swash form of the capitals is applied, the stylistic sets can come into play, allowing different flavors of \"swashness\".\n\nAnother thing I noticed is that the specimen doesn't contain any example of a word set in all caps that is as \"swashed\" as the examples you made. This is understandable since an all-swash-caps does not only look silly, but it's also difficult to read. The image below reproduces one example found in the booklet.\n\n\\*Gorgeous! Unfortunately it's not available in PDF\n\n ![](http://web.archive.org/web/20130914174438im_/http:/typophile.com/files/poetica_books_4156.png)\n\n"
    },
    {
      "time": "22 Mar 2007 — 3:01am",
      "content": "\\> _to me, there no apparent reason why the first set of alternates provided by salt should NOT be compatible with what ss01 offers._\n\nMe neither (but to be correct I should say that an example that contradicts it doesn't occur to me right now), but what I meant was 'salt' might have much more to give than what the user gets when he/she presses the 'Stylistic Alternates' button in Illustrator's UI. And the UI doesn't make it clear to the user that he/she is only getting a subset (the first \"layer\") of that feature.\n\n\\> _Of course, \\*in addition\\* salt should give the user access to \\*all other\\* alternates offered by ss01–ss20. My principle is simple: whatever is in ss01–ss20 should \\*always\\* be in salt, because salt is a superset of ss01–ss20, organized differently. salt may contain additional glyphs that are not accessible through ss01–ss20 but anything that is accessible through ssXX should also be accessible through salt.  \nI don’t see why salt (being “stylistic alternates”) should NOT include any glyphs that are mapped to “sets of stylistic alternates”, i.e. ss01–ss20._\n\nWe agree on that.\n\nBased on your tables, this is how I see it:  \n`+—————————+—————+—————+—————+\n| ——————— | ———— salt ————— |\n+—————————+—————+—————+—————+\n| ——————— | — A | — B | — C |\n+—————————+—————+—————+—————+\n| —— ss01 | A.1 | B.1 | C.1 |\n| —— ss02 | A.2 | B.2 | C.3 |\n| —— ss03 | A.3 | B.3 | C.3 |\n+—————————+—————+—————+—————+\n`\n\nUsing your terminology, the table shows that 'salt' has \"wide\" (covers A, B and C) and \"deep\" (can get to all alternates of A, B and C) access, whereas stylistic sets only have \"wide\" access, as each one is restricted to its own \"layer\".\n\n\\> _But I still need to hear a good reason why any ssXX alternates would not be included in salt._\n\nI can't think of one. And it should be said that the opposite isn't true. This is due to the architecture/intentions of both features. 'salt' can contain the same kind of substitutions present in ssXX, but ssXX shouldn't (can't?) contain all types of substitutions that can be implemented in 'salt' (such as one-from-many).\n\n"
    },
    {
      "time": "22 Mar 2007 — 6:11am",
      "content": "\\> And it should be said that the opposite isn’t true.\n\nI agree that not all substitutions present in _salt_ should be present in _ssXX_. In many fonts they will be, but some fonts will have extra stuff in _salt_. This is why I suggested to develop _ssXX_ first and then _salt_. This seems to be the logical sequence to me.\n\n"
    },
    {
      "time": "22 Mar 2007 — 8:59am",
      "content": "Adam wrote:  \n<cite>I don’t see why salt (being “stylistic alternates”) should NOT include any glyphs that are mapped to “sets of stylistic alternates”, i.e. ss01–ss20.</cite>\n\nMiguel wrote:  \n<cite>Having said that, Illustrator’s implementation of Stylistic Alternates is incomplete since it trims down ‘salt’ to only provide one-to-one substitutions (therefore you can only get access to the first alternate when pressing the button on the UI).</cite>\n\nReading this thread, one question bugs me: What would an <cite>ideal</cite> implementation and UI of 'salt' in applications look like?\n\nAs to the one-by-one part:  \nUser selects a glyph and applies 'salt' to receive an (the first) alternate for this glyph. Same for strings, maybe (if 'salt' mirrors 'ss01').  \nThis however is like applying 'ss01' -- which makes 'salt' superfluous.\n\nAs to the one-from-many part:  \nUser selects a glyph, and upon right-click/ctrl-click or some shortcut, a popup appears which <cite>only</cite> presents alternates for this glyph. Consider as a more 'interactive' version of the Glyph Palette method. (The way Chinese or Japanese is typed comes to mind!)  \nBut then, doesn't 'aalt' do the job already? Maybe not: 'salt' is more 'focused', i.e. limits the choice to real design alternates -- as against small cap, uppercase, superior &c alternates.\n\nIt seems that this discussion is about: Does it make sense to use the one-by-one part of 'salt' as a 'ss01' mirror for less advanced applications which don't yet support Stylistic Set features?  \nTo tweak my question a bit, I would ask: If not for the one-from-many part, for presenting a more focused selection of alternates, what is 'salt' good for at all?\n\n"
    },
    {
      "time": "25 Mar 2007 — 9:14pm",
      "content": "Wow. I went away for a few days and this thread went crazy. I haven't read everything thoroughly, but I have some comments based on what I have read so far (so sorry if I missed something):\n\nAFAIK, stylistic sets were proposed by John Hudson back in summer 2002 (so maybe he has some further insight). The idea is to express a single design variation that spans multiple glyphs. A \"stylistic set\" is meant only to be a set of glyphs (i.e. more than one, as I see it) which are collectively a single design variation -- so it can be a set of capitals in Poetica, or the long ascenders in Kigali, or the plain capitals in Bulmer. It's a way of saying, \"These alternates belong together.\"\n\nIt is probably true that we haven't been too consistent about how 'ss\\*\\*' features are implemented in fonts, but I think it's fair to say that Poetica is well-suited to it.\n\nAdam, you're example/complaint about applying a set to Poetica \"all at once\" is valid, but in fairness to whomever authored those features in Poetica (I don't think it was me!), I think it was imagined that the features would be applied to upper/lowercase text, not all-caps. Still, the stylistic sets serve the purpose that 'ss\\*\\*' was created for, which is to express a shared design trait among glyph alternates.\n\nAs I said in another thread, I don't agree with this idea that alternates should be in both 'salt' and 'ss\\*\\*' as a general practice (just like you wouldn't put all ligatures from 'liga' in 'clig'). I think the two features are complementary, in that 'salt' handles single alternates, and 'ss\\*\\*' handles sets of alternates. Like a lot of feature choices, it's harmless, but I wouldn't call it \"best practices\".\n\nI am not so sure that there is anything in the 'ss\\*\\*' description which prescribes that it be applied \"all at once\". This certainly seems to be the way to go for many stylistic sets, but I don't know that this should be assumed. As we've seen in Poetica, some discretion is sometimes needed. (By the way, we should clarify some of the language Miguel used unintentionally, because in the OpenType vernacular, both 'salt' and 'ss\\*\\*' are \"discretionary\", because they're not on by default.) With not too much trouble, an 'ss\\*\\*' feature can be applied to a character style in InDesign, for example, and applied to the first letter of every paragraph with nested styles. In a case like this, 'ss\\*\\*' can be very useful and appropriate, without being an \"all at once\" kind of thing.\n\n"
    }
  ]
}
