{
  "id": "32435",
  "title": "client wants handshake",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "so I have a client that wants to update his logo  \nbut is hung up on having a handshake in the logo.\n\nI included a couple of RAW ideas. I just busted  \napart some clipart for most and quickly made the  \nhands that extend into arrows. Do any of these  \nideas have merit?\n\nI have done nothing with the typography other than  \ntrying to get a feel for what might look good when  \nI get to that point.\n\nThe client is a MS certified consultantcy called  \nMutually Beneficial. Colors in the logos will be  \nbrowns and blues.\n\nI wanted to do something less trite and more  \nprogressive. Do you guys have any ideas on how to  \nsuggest a handshake or give the strong feeling of  \na handshake without seeing two hands gripped  \ntogether?\n\nAny advice is appreciated on this one. I've been  \nlurking on this board for months now too scared to  \nask any advice. I'm just finishing my education and  \ncould use the help. Thanks\n\nJustin\n\n| Attachment | Size |\n| --- | --- |\n| [mb logos 3-21-07.pdf](http://web.archive.org/web/20131017185543/http:/typophile.com/files/mb%20logos%203-21-07.pdf) | 87.46 KB |\n| [mb logos 3-21-07b.pdf](http://web.archive.org/web/20131017185543/http:/typophile.com/files/mb%20logos%203-21-07b.pdf) | 122.05 KB |\n\n",
  "author": "wheelsforfeet",
  "time": "21 Mar 2007 — 9:26am",
  "uid": "17542",
  "comments": [
    {
      "time": "21 Mar 2007 — 9:36am",
      "content": "How about trying to get a little more abstract and make the hands more like into an icon. Drop the arrows. That seems to me like saying the same thing twice (with the hands).\n\n2. Tweaking a typeface like this is an absolute NoGo.\n\n"
    },
    {
      "time": "21 Mar 2007 — 9:55am",
      "content": "Sorry, but your progressive approach isn't coming through at all. First attempt is a bit bland and cookie-cutterish. Get all your ideas down even if you think they're retarded, they might help spark a new direction of ideas.\n\nTake a look at the handshake illustrations at [Veer](http://web.archive.org/web/20131017185543/http:/www.veer.com/search/results.aspx?keyword=handshake&producttype=TYP%2CILL&pricemodel=RM%2CRF) could give you some more out of the box ideas.\n\n"
    },
    {
      "time": "21 Mar 2007 — 11:59am",
      "content": "Didnt mean to post anything. . . But I guess I have to comment now.\n\nI like four, but it's to sharp at the points of the arrows, and the contrast is not right. I agree, reference some other illustrations and perhaps go more abstract. . Perhaps with fouur, take the text out of the arrow, shorten the arrows, put the hand shake in the centre of them, and place the type elsewhere.\n\nJust a quick idea.\n\nCheers\n\n"
    },
    {
      "time": "21 Mar 2007 — 1:03pm",
      "content": "So I went more iconic and I got some good results though still a little cliche'. But I am in a quandry with the lettering. I don't really like the company name 'Mutually Beneficial' but I can't change that. I don't think it looks good in open white space ever. So I try to enclose it but it was a little awkward with my logo attempts.\n\nDo you have any ideas on how to make an ugly word pretty?\n\n"
    },
    {
      "time": "21 Mar 2007 — 4:25pm",
      "content": "<cite>Do you have any ideas on how to make an ugly word pretty?</cite>\n\nDon't set it in all caps in a Windows system font.\n\nArial Bold is not a very warm and inviting typeface, especially set in all caps. Neither is TNR Bold. Try setting in all-lowercase, in a rounder, friendlier font. You might want to stack the two words on top of each other as well since they are both very long.\n\nAs for your mark, scrap what you have and get out the pencil and paper. Doodle for a while, and see what you can come up with. I find that this is a much more productive sketching technique than using clipart.\n\n- Lex\n\n"
    }
  ]
}
