{
  "id": "32452",
  "title": "inDesign for Interactive Projects?",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Hello,  \nJust wondering if anyone out there uses inDesign for designing websites. Was thinking about giving it a try since ID seems to work well for everything else.\n\nThanks,  \nPeter.\n\n",
  "author": "markatos",
  "time": "21 Mar 2007 — 4:47pm",
  "uid": "1839",
  "comments": [
    {
      "time": "21 Mar 2007 — 5:32pm",
      "content": "If you've got nothing, and I mean **nothing** else, it might be OK for some preliminary layout, and then you could tinker with the code with a text editor.\n\nThat being said, I'd either buy a dedicated package (like Dreamweaver) or explore the templates of Blogger: even as a pretty hardcore and competent IDer, I've done both of these, and they are \\*\\*\\*way\\*\\*\\* better at doing web than ID.\n\n"
    },
    {
      "time": "21 Mar 2007 — 8:51pm",
      "content": "Photoshop is a much better tool for mocking up a web site because it makes it easy to dump your graphics right to usable files later.\n\n"
    },
    {
      "time": "22 Mar 2007 — 6:11am",
      "content": "InDesign does some pretty nifty interactive stuff in the form of PDFs.\n\n"
    },
    {
      "time": "22 Mar 2007 — 6:58am",
      "content": "\"Was thinking about giving it a try since ID seems to work well for everything else.\"\n\nYou mean 'everything else on paper'.\n\nIf you want to design web sites, you really need to understand the medium of HTML and CSS and the like to do it right.\n\n"
    },
    {
      "time": "22 Mar 2007 — 10:10am",
      "content": "I wonder it too, it would be great. Although i don't know if we can work with pdf in html? anybody?\n\n"
    },
    {
      "time": "22 Mar 2007 — 11:18am",
      "content": "\\> Although i don’t know if we can work with pdf in html? anybody?\n\nPDF is great for what it does ... provide a consistent print/web look. It is not the tool for making an entire website, however. For one thing, you will never get a good listing with the search engine, since they only index HTML pages, not PDFs.\n\nThe top web program is Adobe Dreamweaver, although there are other programs worth considering (Microsoft Front Page is NOT one of them).\n\nYou can build web page with a simple text editor like TrueText or Notepad, but it requires learning how to write the code.\n\n"
    },
    {
      "time": "22 Mar 2007 — 12:13pm",
      "content": "Good point about outputting to gif and jpegs. I wasn't talking about building a site with inDesign. Just designing. But there isn't Save For Web in ID.\n\nWould be sweet if illustrator or ps could allow for \"Master\" layouts and multi-page documents. If I design a grid for a site, and then could base all the other pages off that within one document that would be swell.\n\nHence why I asked if anyone does this with ID.\n\nCarry on.\n\n"
    },
    {
      "time": "22 Mar 2007 — 12:32pm",
      "content": "ID does output to XML, I think, and that is HTML on steroids. It sounds like you might want to get into data-driven websites, where you design a basic page, and it feeds the necessary copy to it, depending on the situation. This site is an example, along with Amazon, etc.\n\nThe tool for doing that kind of thing is the php language, ASP, ColdFusion, and maybe more. You can access some of these tools in Dreamweaver.\n\n"
    },
    {
      "time": "22 Mar 2007 — 2:09pm",
      "content": "<cite>For one thing, you will never get a good listing with the search engine, since they only index HTML pages, not PDFs.</cite>\n\nNot entirely true, as [proven by Google](http://web.archive.org/web/20131018072739/http:/www.google.com/search?q=.pdf). You would have to link to the PDF though, from an HTML web page which contains enough relevant information. _That_ will ensure it shows up on the search engines.\n\n"
    }
  ]
}
