{
  "id": "32453",
  "title": "Eighth Day Final",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Threw out one other arrangement and a love of ball terminals with Carousel\n\nCant seem to get my jpegs to show on the old post, otherwise I would have kindly just placed this post there.\n\nJPEG and PDF\n\nCheers\n\n ![](http://web.archive.org/web/20131020211012im_/http:/typophile.com/files/eighth_day_final_2_3412.jpg)\n\n",
  "author": "James Scriven",
  "time": "21 Mar 2007 — 4:49pm",
  "uid": "14360",
  "comments": [
    {
      "time": "21 Mar 2007 — 7:21pm",
      "content": "Scratch that, got a comment elsewhere that it was If Mrs. Partridge opened up a spa and invited in all of the old 60's movie stars. Wrinkly. (In reference to Carousel)\n\nStuck with the Bauer Bodoni.\n\nHowever, I did like the looks of Didoni. ..\n\n"
    },
    {
      "time": "22 Mar 2007 — 7:32am",
      "content": "I really like the logo, but the Bodoni isn't working for me. It just commands so much attention with all of its contrast and fanciness. I think Bodoni or Didot could work, but I'm not a fan of how you have set the type in relation to the mark. Right now, the type is competing with the logo. Perhaps the logotype is a sans face instead? Something to allow your logo more visual presence.\n\n"
    },
    {
      "time": "22 Mar 2007 — 7:41pm",
      "content": "there is something a little too sharp and edgy in the upper example's serifs.\n\nsomething in the black color (real color, not typographic) isn't sensitive enough near that symbol. perhaps you might try toning down the black just a little so it would't threaten that lovely symbol you've designed.\n\noverall it's good, i really enjoy looking on it.\n\n"
    },
    {
      "time": "23 Mar 2007 — 5:40pm",
      "content": "what's with the angel like shape? I don't mind the infinite loop and longevity, the colours, type choice and style of the '8' don't seem connected at all (in my opinion).\n\nAm I missing something about the 8th day? what's it a reference too? It's only wording I know but I also don't understand the use of \"organic wellness spa\" - sounds like simply throwing organic in there to make people think it's 'nicer'\n\n----------  \n**Paul Ducco**  \n [Web Design Wellington](http://web.archive.org/web/20131020211012/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "23 Mar 2007 — 6:02pm",
      "content": "Hello\n\nI like the upper right one, feels like wellness. You might move the logo a bit down, it feels more compact when you look at it.\n\n"
    },
    {
      "time": "24 Mar 2007 — 8:02am",
      "content": "What about [Miller](http://web.archive.org/web/20131020211012/http:/www.fontshop.com/index.cfm?fuseaction=catalog.fontdetail&displayfontid=FB.103859.0.1&attributes.sampleSize=48&sampleText=Eigth+Day&sampleSize=96) from Font Bureau?\n\n"
    },
    {
      "time": "24 Mar 2007 — 11:21am",
      "content": "Paul, it's simply a refernce to giving your self a whole \"new\" type of day, a new outlook, organically speaking. It's not just an organic spa, but it preaches and teaches organic lifestyle. Hope that ties it together a little more. I'm not super happy with the way the logo ties into the typeface but at this point im exhausted, suggestions as to how to tie them together would be greatly appreciated.\n\n"
    }
  ]
}
