{
  "id": "3247",
  "title": "(x) Skynews - custom by X&Y (Miles Newlyn) {Mike F}",
  "forum": "Type ID Board",
  "tags": [

  ],
  "content": "Does anyone have a clue about this one?   \n   \nThanks people ![:-)](http://web.archive.org/web/20050516142722im_/http:/www.typophile.com/forums/clipart/happy.gif)   \n   \n/Henriko   \n   \n ![skynews-logo](http://web.archive.org/web/20050516142722im_/http:/www.typophile.com/forums/messages/83/27003.gif)\n\n",
  "author": "henriko",
  "time": "Sun, 2004-02-22 09:27",
  "uid": "1388",
  "comments": [
    {
      "time": " Sun, 2004-02-22 11:13",
      "content": "Gee, you're right! But this is cool enough man - I couldn't find any fonts that came as close as this one...   \n   \nThanx!   \n   \n//henriko\n\n"
    },
    {
      "time": " Mon, 2004-02-23 05:20",
      "content": "Yves, why not have a disclaimer on the title of this forum that states if its a logo, its probably custom. We see this often.\n\n"
    },
    {
      "time": " Tue, 2004-02-24 15:51",
      "content": "Glad to hear you reinforce that idea. That's why I'm here. Very often in this field, close is plenty good enough. Especially if you have to hold the two side by side to notice the differences -- most folks don't have eyes that are tuned for the details you guys spot!\n\n"
    },
    {
      "time": " Tue, 2004-02-24 17:33",
      "content": "I think that's a typeface. Here's why:   \nCompare the S. On the left it looks like a capital form, on the right it looks lowercase. At the very least there is no reason that they should be different in a custom logo of this genre. The K is definitely capital. I don't think we're looking at a custom unicase logo, but two weights of a font scaled to acheive the purpose.   \n   \nThey wouldn't be the first company who could afford better but chose not to.   \n   \nFor all that guessing you'd think I'd hazard a guess on the font?   \nI have no idea :-)   \n   \nRandy (Apex came to mind, but it's not that)\n\n"
    },
    {
      "time": " Wed, 2004-02-25 11:07",
      "content": "Yves, I don't mean stop helping but just inform people that most logos are custom. Too many people want an exact match. It just a thought\n\n"
    },
    {
      "time": " Tue, 2004-03-02 19:04",
      "content": "I just came across [this site](http://web.archive.org/web/20050516142722/http:/thetvroom.com/area-c/tvfonts/section-front.shtml), which has \"Skyward\" fonts made to mimic.   \nThe original font is attributed to X&Y Design, the only links for which I   \ncould find related to furniture design.   \n   \nNote that Skyward Regular has a lc e and n which, if blown up to match   \nthe size of the other (uc) letters, has about the right weight. PC only (again).\n\n"
    }
  ]
}
