{
  "id": "32489",
  "title": "typesetting help",
  "forum": "Design",
  "tags": [
    "Design"
  ],
  "content": "Hello, I'm typesetting a book and after proof-reading it I found quite a few repeated words beginning or ending consecutive lines. My question is: how would you solve this? What are my options? Adding line breaks? Hyphenating words? Adjusting the space between words? Which of these options is the best? You can see an example below. Thanks. :)\n\n ![](http://web.archive.org/web/20131020211707im_/http:/typophile.com/files/typesetting_problem_4107.jpg)\n\n",
  "author": "rafael_lueder",
  "time": "22 Mar 2007 — 9:43pm",
  "uid": "5681",
  "comments": [
    {
      "time": "23 Mar 2007 — 12:32am",
      "content": "You may do something in the second (/3rd) line of your sample to shift \"Ao\" at the beginning of the 4th.\n\n"
    },
    {
      "time": "23 Mar 2007 — 6:33am",
      "content": "I agree, since it would also help the \"Dr.\" be with the name.\n\n"
    },
    {
      "time": "23 Mar 2007 — 6:55am",
      "content": "Ok, I got it, actually the example I posted wasn't the hardest one. It's a trial and error situation, I choose a point where to insert a forced line break before or after the repeated words, it's boring, but it works. Things get pretty nasty when adding a line break creates an orphan, then you have to undo and try a different place... Thanks for your answers. :)\n\n"
    },
    {
      "time": "23 Mar 2007 — 9:18am",
      "content": "The usual rule is that a \"word stack\" occurs when the same word ends or begins three successive lines. It does make reading more difficult -- you get lost, even with small words like \"the\" (which is obviously not hyphenateable).\n\nWhether you hyphenate or force breaks is always a matter of compromise; there is no general rule, what you pick will vary from case to case. In this paragraph for example, even if you take \"Dr.\" down, the line below was a bit loose, so Dr. might fit, depending on your justification settings. \"primeiros\" has two hyphenation points I believe: pri-mei-ros. You might have to use one for one line and the other for the other.\n\nAs to word spacing: you are getting about 10 spaces per line. They have to bear all the expansion/contraction needed for justification, unless you are also using a bit of whitespace addition/subtraction with the letters themselves (usually not a good idea). If the ideal wordspace is about .25 ems, you can see that any word taken down which is 2.5 ems long is going to double that space. You can figure that the average letter is about .4 ems in width, so taking down a 6+ letter word is going to get you a .5em wordspace (on the model that it was .25 ems before).\n\nComposition is always about compromise, so the fewer kinds of line breaks you allow, the more even word spacing is going to suffer. As a professional typesetter, I often run into the notion that \"we want GOOD composition. Therefore, only two hyphenations in a row, no word stacks, don't hyphenate the last word of a paragraph,\" and on & on. Where do they think line justification comes from? Now if you let me rewrite the copy . . .\n\n"
    },
    {
      "time": "23 Mar 2007 — 10:05am",
      "content": "My practice is to define some alternate (paragraph/text)styles with tighter and looser wordspacing and a tad of horizontal scaling. In case of problems like yours I apply one of these styles to that line or the ones before it. Easy peasy.\n\nTip: make them 'daughter'styles of your main textstyle.\n\n"
    }
  ]
}
