{
  "id": "32481",
  "title": "Good Victorian Type?",
  "forum": "Design",
  "tags": [

  ],
  "content": "Hi,\n\nI’m looking for a good Victorian typeface that isn’t too decorative or too strict... somewhere in the middle... Can’t look too heavy in black... Any suggestions?\n\n-t\n\n",
  "author": "<a href=\"/web/20090425143947/http://typophile.com/user/5290\" title=\"View user profile.\">tsongtze</a>",
  "time": "<br>",
  "uid": "5290",
  "comments": [
    {
      "time": " 22.Mar.2007 12.22pm",
      "content": "Does Universtiy Roman count?\n\n"
    },
    {
      "time": " 22.Mar.2007 12.27pm",
      "content": "University Roman, that is.\n\n"
    },
    {
      "time": " 22.Mar.2007 1.59pm",
      "content": "Scotch Romans are very Victorian, and can be pretty good stuff.\n\nUniversity Roman is, IMHO, horrible, at least in current digital form.\n\n"
    },
    {
      "time": " 22.Mar.2007 6.25pm",
      "content": "i always thought University Roman is a 70’s type. glad to know otherwise.\n\n"
    },
    {
      "time": " 22.Mar.2007 6.36pm",
      "content": "plenty of the stuff that was big in the seventies is victorian.\n\n"
    },
    {
      "time": " 23.Mar.2007 9.37am",
      "content": "Actually, University Roman is neither a Victorian face nor a 70s face. It’s based on a face called Stunt Roman, from the Speedball Textbooks by Ross George, which appeared in several editions from the 1920s on. In the 13th edition (ca 1938, the earliest I have), it looked like this...\n\n ![](http://web.archive.org/web/20090425143947im_/http:/typophile.com/files/Stunt-Roman_5109.gif)\n\nBy the 20th edition (issued 1960; reprinted 1965 & 1972), a number of the quirks had been smoothed out, and it looked alot more like the face we’ve come to know as University Roman.\n\n"
    },
    {
      "time": " 23.Mar.2007 10.03am",
      "content": "This makes sense—sort of—as lettering. Since the letterer can alter the swashes and proportions at will, they perhaps can make the ’stunt’ work for a few words.\n\nThe ’stunt’ is to have extremely wide round letters and extremely narrow straight letters. Ungainly proportions. Then throw on the swashes.\n\nI don’t think it ever worked as a font.\n\n"
    },
    {
      "time": " 23.Mar.2007 10.12am",
      "content": "Stunt Roman is beautiful! I never realized it was University Roman’s parent so to speak.\n\nHowever, I always thought University Roman (Stunt Roman) had Victorian characteristics, not necessarily developed in the Victorian era, but drawing from some of the elements of the day. How wrong am I?\n\n"
    },
    {
      "time": " 23.Mar.2007 10.42am",
      "content": "I recall University Roman was huge in the late 1970s, along with ITC Garamond, Souvenir and Korinna.  \nMore of your fave fonts, eh Bill?\n\nMy father, who is a big CR Mackintosh fan, has University Roman for the name sign of his house, and insists Mackintosh designed it. Parents!....\n\n"
    },
    {
      "time": " 23.Mar.2007 10.50am",
      "content": "Like others who frequent these boards I have feelings about type the way most people do about other people.\n\nNot very rational but:\n\nITC Garamond I actually think can look good in display, though it is bad in text. I think Tony Stan drew type well, including American Typewriter and Berkeley. So kill me.\n\nSouvenir I think is all around a very good face. It just has a softness that is out of fashion—or it it coming back?\n\nKorinna I don’t know.\n\nUniversity Roman they should kill and put a stake through its heart, before it can extend its evil tendrils further :)\n\nEdit: Nick, looking at the numerals, I see they don’t suffer from the truly ungainly proportions of the rest.\n\n"
    },
    {
      "time": " 23.Mar.2007 12.09pm",
      "content": "To get back on track a bit, Carter & Cone’s Monticello is a sort-of-scotch roman & much better rendered than the various PostScript Caledonia’s & Linotype Scotch Roman for setting text.\n\nPrinceton commissioned the digital Monticello (non-exclusive). I believe you can buy it from Linotype as well, but in the early days at least, it didn’t have the full character compliment that the fonts from Carter & Cone had. Besides, one should support the small foundries.\n\nIf if bothers you that Monticello is derived from a Binney & Ronaldson (i.e., American) typeface, then use one of the horrible PostScript Scotch romans — just remember that B&R were good thieves, so I’d say it is a “name thing.”\n\n"
    },
    {
      "time": " 26.Mar.2007 7.21am",
      "content": "Thanks everyone! I’m leaning towards the direction of Souvenir, but I’ll try most of your suggestions.\n\n"
    }
  ]
}
