{
  "id": "32498",
  "title": "Deadline Visual Arts",
  "forum": "Logos / Corporate ID Design",
  "tags": [
    "Logos / Corporate ID Design"
  ],
  "content": "Hello,\n\nI posted a thread a few days ago with two logos in it. I decided to redo one.\n\nThis is for a production company that makes action b-movies. We decided to make it look as serious as possible even thought the movies are made for fun.\n\nI've haven't really found a font that I like yet. So I thought that some of you might have some suggestions. The two fonts I've used here are Utopia and Sabon.\n\nUtopia makes it look like a newspaper logo :)\n\n| Attachment | Size |\n| --- | --- |\n| [deadline\\_v5\\_comp1.jpg](http://web.archive.org/web/20131020062824/http:/typophile.com/files/deadline_v5_comp1.jpg) | 102.51 KB |\n\n",
  "author": "kattttor",
  "time": "23 Mar 2007 — 8:41am",
  "uid": "17519",
  "comments": [
    {
      "time": "23 Mar 2007 — 9:57am",
      "content": "1b is the best of this bunch, but the idea doesn't seem pushed far enough. I'd stack the image on top of your type.\n\nHave you tried any versions using a sans-serif? The film and explosion seem stiff, could you do a version where the film is reacting to the explosion? As if it's ripping from the impact or from shock waves?\n\n"
    },
    {
      "time": "23 Mar 2007 — 11:27am",
      "content": "I havent tried a sans serif yet. Making the film react on the explosion is a good idea, i'm gonna see if I can come up with something that looks good. Had the image on top in an earlier version but it didn't seem right. Thanks.\n\n"
    },
    {
      "time": "23 Mar 2007 — 5:21pm",
      "content": "concept could look a heap stronger with the use of photography instead i.e, actually melting a piece of film.\n\n----------  \n**Paul Ducco**  \n [Web Design Wellington](http://web.archive.org/web/20131020062824/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "23 Mar 2007 — 5:57pm",
      "content": "I know it sounds absurd, but the film feels like a fireman's ladder to me. Have you tried it horizontal?\n\n ![](http://web.archive.org/web/20131020062824im_/http:/typophile.com/files/deadline_v5_comp1_6534.jpg)\n\n"
    },
    {
      "time": "24 Mar 2007 — 5:57am",
      "content": "Now melting a flim sounds interesting, I don't have any film film but I have some negatives from an ordinary camera. melting one of those, taking a picture of it and draw that i illustrator. I think that would kick ass.\n\nYeah, one of my teachers also mentioned that it looks like a ladder, not good. Gonna try the melting thing and put it horizontal with the same explosion.\n\nThanks for your inputs this forum is extremley helpful.\n\n"
    },
    {
      "time": "24 Mar 2007 — 7:13am",
      "content": "Don't ask me why ... but I've actually I've done this before. I suggest scanning the melted film after a few seconds in the microwave. If it's too crinkled to lay flat and close the scanner, just cover it and the flatbed with white fabric. Works great.\n\nAK\n\n"
    },
    {
      "time": "24 Mar 2007 — 7:24am",
      "content": "I don't have a scanner here at home but there's scanners at my school though, gonn try that on monday. Rught now I'm trying to photograph it instead, we'll see how it goes.\n\n"
    },
    {
      "time": "25 Mar 2007 — 12:06am",
      "content": "yeah I actually meant using it as a photo not as vector art - can't see any reason why you couldn't use a full colour/photographic element as the logo.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Wellington](http://web.archive.org/web/20131020062824/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": "25 Mar 2007 — 3:14am",
      "content": "The first thing to do is get the proportions of the strip correct, landscape rather than square, sprocket holes on the short sides, and add some flexibility to it.  \n [http://en.wikipedia.org/wiki/Image:The\\_Kiss\\_1896\\_Film\\_Strip.jpg](http://web.archive.org/web/20131020062824/http:/en.wikipedia.org/wiki/Image:The_Kiss_1896_Film_Strip.jpg \"http://en.wikipedia.org/wiki/Image:The\\_Kiss\\_1896\\_Film\\_Strip.jpg\")\n\n[http://www.swish-db.com/tutorials/view.php/tid/628](http://web.archive.org/web/20131020062824/http:/www.swish-db.com/tutorials/view.php/tid/628 \"http://www.swish-db.com/tutorials/view.php/tid/628\")\n\nProbably not as much flex as the photoshop tutorial, just enough to stop it looking ladderish. I would stick with the vertical format the horizontal is (even in the current digital camera boom) too like stills film.\n\nIf you have the opportunity, try jamming some film in a projector, the heat of the bulb melts stationary film, and take shots of the screen as it goes – quite spectacular, (unless it’s a major part of your final degree show then it’s heartbreaking).\n\nYou could also try animating the explosion or a spark travelling along the fuse before exploding from the frame, I see that following the name of the company.\n\nTim\n\n"
    },
    {
      "time": "25 Mar 2007 — 10:05am",
      "content": "As I don't have a scanner I photographed my burned film strips. :)\n\nI don't think a photo version will work that well and I'm gonna animate the logo at some point when I have enough free time, then it will be alot easier if it's not a photo. I had had in mind something like timd suggests, a fuse that is lit and the silm explodes.\n\nI made a version in photoshop from the photos. It's a little rough still. I don't know yet how much I'm going to straighten it out when I draw it, It looks kinda cool when it's a little rough. I cut out the \"photos\" in the negative. I think that I might make it look even more cut-out and add some small cuts and scrapes. Other then that I need to work on the explosion some more.\n\nThe type that I think fits best at the moment is Sabon.\n\nI'll welcome any more feedback that you can give, thanks for all opinions so far.\n\npeter\n\n ![](http://web.archive.org/web/20131020062824im_/http:/typophile.com/files/deadline_v6_4607.jpg)\n\n"
    },
    {
      "time": "27 Mar 2007 — 8:42am",
      "content": "I like the new filmstrip better, but now the explosion looks too mechanical and artificial by comparison.\n\n- Lex\n\n"
    },
    {
      "time": "27 Mar 2007 — 9:16am",
      "content": "yeah I know I have re-drawn it and it looks a lot better. I scanned the filmstrip today and gonna experiment a little with the scans and make a more complete version today if I have time.\n\n"
    },
    {
      "time": "27 Mar 2007 — 10:18am",
      "content": "Really needs the sprocket holes on the short sides (or rotate the shot area and reduce) otherwise it looks like 35mm film.\n\nTim\n\n"
    },
    {
      "time": "27 Mar 2007 — 2:32pm",
      "content": "excellent point Tim.\n\nI still think an image will be stronger than vector art ... but that's just my opinion.\n\n----------  \n**Paul Ducco**  \n [Design Studio Melbourne](http://web.archive.org/web/20131020062824/http:/www.solid-creative.com/)\n\n"
    },
    {
      "time": "27 Mar 2007 — 5:06pm",
      "content": "Aaaaah, I didn't understand first what you meant with the sprocket holes but now I do. I rotate the shot area and remove the sprocket holes on the top side so I get a 8mm or 16mm film, and maybe make them remove a few. Like that [http://www.ischool.utexas.edu/~alpa2500/filmsize.jpg](http://web.archive.org/web/20131020062824/http:/www.ischool.utexas.edu/~alpa2500/filmsize.jpg \"http://www.ischool.utexas.edu/~alpa2500/filmsize.jpg\") [http://www.ischool.utexas.edu/~alpa2500/SmallGauge.jpg](http://web.archive.org/web/20131020062824/http:/www.ischool.utexas.edu/~alpa2500/SmallGauge.jpg \"http://www.ischool.utexas.edu/~alpa2500/SmallGauge.jpg\")\n\nThanks for that Tim, it will probably look alot better.\n\nI still think that the logo is a little empty, started thinking that maybe I should add something in the shot area, a gun or something. Something to think about atleast.\n\nI'm gonna edit it so much that I don't think it will look good as a photo after I'm done putting it together.\n\npeter\n\n"
    },
    {
      "time": "27 Mar 2007 — 10:21pm",
      "content": "\\>and remove the sprocket holes on the top side\n\nWell, technically that would be right, however, for ease-of-recognition purposes you might keep them in and just rotate the area, nearly every image representing film uses two sets of sprocket holes and the general public will recognise that best. A photographic image might be best if you can achieve it. When considering the ‘emptyiness’ try reducing the logo to the size it might appear on a business card before you add to it and make it too busy.\n\nTim\n\n"
    },
    {
      "time": "28 Mar 2007 — 6:18am",
      "content": "How about an section of film that shows an explosion and then in the last frame the explosion extends outside of the film (i.e. the film is exploding)? (I would draw a quick sketch for you, but the Creative Services people hate when I borrow their scanner)\n\n"
    },
    {
      "time": "28 Mar 2007 — 2:00pm",
      "content": "not a bad idea. I think I'll give that a try aswell, as soon as I get this stupid film strip right. Having the explosion coming from inside the film might look really cool.\n\n"
    },
    {
      "time": "29 Mar 2007 — 12:28pm",
      "content": "Update.\n\nStill rough in the shot area, haven't edited it properly yet, I'll do that when I'm happy with everything and start drawing the filmstrip in illustrator.\n\nStill content with Sabon.\n\nMight take until next week for more changes, have some work I need to get done over the weekend.\n\npost your thoughts if you have any, thanks for all replies so far.\n\npeter\n\n ![](http://web.archive.org/web/20131020062824im_/http:/typophile.com/files/deadline_v6_3867.2.jpg)\n\n"
    },
    {
      "time": "30 Mar 2007 — 9:24pm",
      "content": "I like your concept a lot more in this draft. I really like where it's heading.\n\nI have a few thoughts ... Simplify; IMHO five film frames is too many - just three may be adequate. The best design advice I ever got was that \"perfection is achieved when there's nothing left to take away, not add.\"\n\nThe flame explosion feels too stiff compared to the film. Have you tried giving your flames some organic curves?\n\nAnd lastly ... To everything, Kern, Kern, Kern, I swear it's not too late ... :)\n\nAK\n\n"
    },
    {
      "time": "31 Mar 2007 — 9:00am",
      "content": "I started thinking that five are too many also. On monday I'll start drawing the filmstrip in illustrator and see hoe many frames fits. As for the explosion I haven't tried making it more organical yet. It can't be too wavy either, then it probably won't look like an explosion anymore.\n\nAfter that I'll start kerning ( I had too look up kerning in my freshly purchased typography book :) )\n\npeter\n\n"
    },
    {
      "time": "1 Apr 2007 — 3:10pm",
      "content": "just some stuff I came across ...\n\n[http://www.hnd.usace.army.mil/pao/CEAInfo/Explosion%20Photo.JPG](http://web.archive.org/web/20131020062824/http:/www.hnd.usace.army.mil/pao/CEAInfo/Explosion%20Photo.JPG \"http://www.hnd.usace.army.mil/pao/CEAInfo/Explosion%20Photo.JPG\")  \n [http://www.math.sunysb.edu/~sorin/online-docs/blender/html/gfx/chapter\\_e...](http://web.archive.org/web/20131020062824/http:/www.math.sunysb.edu/~sorin/online-docs/blender/html/gfx/chapter_effects/Explosion_Film.png \"http://www.math.sunysb.edu/~sorin/online-docs/blender/html/gfx/chapter\\_effects/Explosion\\_Film.png\")\n\n----------  \n**Paul Ducco**  \n [Graphic Design Wellington](http://web.archive.org/web/20131020062824/http:/www.solid-creative.com/design.htm)\n\n"
    },
    {
      "time": "8 Apr 2007 — 5:27pm",
      "content": "Took me long enough to continue.\n\nThree versions and I'm not really happy with anyone.\n\n1. The filmstrip on top, vertical. Works but hte explosion look so cluttered when it goes over the strip and monotone explosion under it.\n\n2. The backgrund behind the text it joins with the filmstrip very nicely but there's something here that bothers me, don't know what, might be the font.\n\n3. This just looks crap. When you cut it too three frames and put it horizontal it dosen't really look like a film strip.\n\nPerhaps some sans serif typeface suggestions would be in order.\n\ngrateful for more feedback  \nPeter\n\n ![](http://web.archive.org/web/20131020062824im_/http:/typophile.com/files/deadline4_5096.jpg)\n\n"
    },
    {
      "time": "8 Apr 2007 — 5:35pm",
      "content": "Just had another idea. I drew som quick \"tails\" on the 1 version, so that the two vertical bars continue in a wavy form and get smaller, it looks a little like the film strip got hair, looks pretty neato.\n\nEDIT: Started too look more like a condom then a film strip :|\n\n"
    },
    {
      "time": "9 Apr 2007 — 7:23am",
      "content": "<cite>http://www.math.sunysb.edu/~sorin/online-docs/blender/html/gfx/chapter_effects/Explosion_Film.png</cite>\n\nThis is exactly what I was picturing in my head, Paul. Thanks!\n\nI like numbers 2 & 3. Number 1 would cause a problem because it would look like a ladder again and the explosion would just make it look like a fireman's ladder.\n\nI like the wavy flames that you added. Did you try a version like #3 but with the filmstrip to the right of the wordmark?\n\n"
    },
    {
      "time": "9 Apr 2007 — 8:27am",
      "content": "I had the third versions text at all kinds of places. I didn't really like any. The problem that I have with two and three is that they don't look like filmstrips to me, number one does but not two and three. I'm starting to think this is something that the person who I'm making it for should decide.\n\nAnyway I've worked some more on version one. Replaced Sabon with a condensed Avant Garde and added some white spaces around the explosion and it's really starting to pop out, I also made the top of the strip, where it's cut, more jagged so it would look like it broke. I must say that I don't see the ladder at all anymore.\n\nI'm still gonna try a round explosion similar to the photos that Paul posted and see how that looks on version one and three.\n\npeter\n\n"
    },
    {
      "time": "9 Apr 2007 — 10:12am",
      "content": "#2 and 3 look like film. Try showing it to a random person and see what he/she sees. Maybe I'm just seeing film because I know the context, or maybe you're not seeing film because you've been working on it like crazy.\n\nWhat does the client think about the direction?\n\n"
    },
    {
      "time": "9 Apr 2007 — 10:15am",
      "content": "I'm still waiting for the client to respond. I'll dump it on some people and see what they say.\n\n"
    },
    {
      "time": "10 Apr 2007 — 12:55am",
      "content": ":)\n\n----------  \n**Paul Ducco**  \n [Graphic Design Wellington](http://web.archive.org/web/20131020062824/http:/www.solid-creative.com/about.htm)\n\n"
    },
    {
      "time": "10 Apr 2007 — 8:05am",
      "content": "So I sent to the four people that was online on msn and two voted for number 1 and two for number 2. The client voted number 1 and absolutley not number 2.\n\nI drew a round explosion in illustrator but when I scale it down it starts too look like a star instead of an explosion, especially the monotone explosions.\n\nSo now I'll work some more on number one, I'm gonna do another test with number three and skip number two.\n\n"
    },
    {
      "time": "10 Apr 2007 — 8:15am",
      "content": "Nice! See, it always helps to show it to an outsider. Yeah, I could picture a round explosion looking too much like a star. Can you post a monotone version of the logo you're working on? I'm interested to see how you're handling it - especially since I love the contrast between the brown film and the bright explosion.\n\n-Scott\n\n"
    },
    {
      "time": "10 Apr 2007 — 5:06pm",
      "content": "this thread has been great to see some development.\n\nnot totally convinced about the type :)\n\ngreat stuff though.\n\n----------  \n**Paul Ducco**  \n [Graphic Design Wellington](http://web.archive.org/web/20131020062824/http:/www.solid-creative.com/about.htm)\n\n"
    },
    {
      "time": "10 Apr 2007 — 11:50pm",
      "content": "If you want to go with a rounder, more organic explosion, take a look at comic book art or anime for some inspiration.\n\n- Lex\n\n"
    },
    {
      "time": "19 Apr 2007 — 10:06am",
      "content": "Had some work I needed to get done so It took a while since my last post.\n\nAnyway, The type I've picked now is Futura Heavy and I quite like it. I tried some variations with the strip horizontal but nothing turned out good. I haven't yet made a real effort at the round explosion since my last try, I'm going to go to a bookstore at the end of the week and look at some manga comics, tried googling it but didn't get much.\n\nThis logo is soon finished, I can't work on it forever. If you have any suggestions on a sans serif heavy or extra bold property let me know. I also tried Bauhaus but that didn't work, it can't be too special.\n\nI also tried fixing the space between the letters trying to make it nice and even. First i had the text centered with the strips borders but it didn't look centered so I moved the text to the left so know it's centered to the strips left border and the right edge of the explosion.\n\nThese three versions is a variation in the little flames that are around the explosion. I'm not sure yet if I'm going to leave them out or not. I just started thinking that maybe the text needs to be smaller.\n\nAll feedback welcome, thanks.\n\nPeter\n\n ![](http://web.archive.org/web/20131020062824im_/http:/typophile.com/files/deadline_v6_5591.3_comp.jpg)\n\n"
    },
    {
      "time": "19 Apr 2007 — 10:16am",
      "content": "Made some small changes\n\n ![](http://web.archive.org/web/20131020062824im_/http:/typophile.com/files/deadline_v6_5499.4.jpg)\n\n"
    },
    {
      "time": "19 Apr 2007 — 12:02pm",
      "content": "Looking good, the Futura complements the image well, you might need to kern out the INE a little to compensate for the larger areas created by the EAD and LI.\n\nTim\n\n"
    },
    {
      "time": "20 Apr 2007 — 5:13am",
      "content": "Wow! This has come a long way! I am impressed. The san serif is way better than the serif.\n\n"
    },
    {
      "time": "20 Apr 2007 — 6:15am",
      "content": "Is it supposed to look brownish?\n\nBlack film, Black DEADLINE and RED Visual ARTS for the win.\n\n"
    },
    {
      "time": "20 Apr 2007 — 7:06am",
      "content": "Yeah I'm gonna have to fix those last letters. First it was meant to be brown but the client wants it black, so I made a black version and sent it to him so he could compare and he voted black, gonna have to try it with red VISUAL ARTS though, thanks.\n\nThanks missgiggles.\n\n"
    },
    {
      "time": "21 Apr 2007 — 7:39am",
      "content": "I know have it in completley black, a little darker red and the last one got the same red color as the outer edge of the explosion. I fixed the kern issues, does it look alright? The red visaul arts gives it a nice thouch but maybe the last one is a little bright, I don't know yet. I have to think about it.\n\npeter\n\n ![](http://web.archive.org/web/20131020062824im_/http:/typophile.com/files/deadline_v6_5591.5.jpg)\n\n"
    },
    {
      "time": "21 Apr 2007 — 6:11pm",
      "content": "I like the darker red over the lighter, the red used on the explosion has more an orange feel to it, than a red anyway.\n\nAlso, you might want to consider tightening the space between VISUAL and ARTS, it's about a double space wide now.\n\nThe blacklooks nice, it really gives your explosion punch. I should have mentioned earlier, but the film that's to the left of the explosion probably should be thinner, it would be the first to melt anyway because it's closer to the heat. And I'm not sure the \"breaks\" at the top of the film are necessary, might want to make that a clean slice, it'll give a better balance to the mayhem that's happening at the bottom of the film.\n\nAll in all, an impressive development.\n\n"
    },
    {
      "time": "23 Apr 2007 — 8:29am",
      "content": "I like version 3 in your lastest iteration the best.\n\nI don't know why I didn't notice before, but I like the very, very slight gradients in the explosion. (Either that or my eyes are playing tricks on me.)\n\nThe only think that bothers me know is the part where the film \"melted\" on the left side of the filmstrip (see image - I hope you don't mind me playing with it). I think you should play with it a little more or more it lower on the filmstrip. As Andrew suggested, that would make it thinner.\n\n-Scott\n\n ![](http://web.archive.org/web/20131020062824im_/http:/typophile.com/files/deadline_v6_5591_5294.5%20copy.jpg)\n\n"
    },
    {
      "time": "23 Apr 2007 — 9:32am",
      "content": "Scott, that's kind of what I was thinking, but the curve should be towards the inside, next to the explosion... remember it's exploding outward not inward. this idea could be indicated in the second frame just slightly, like you did to the right side of the film.\n\n"
    },
    {
      "time": "24 Apr 2007 — 6:13am",
      "content": "I see.\n\nHow about if the explosion extended outside the left of the filmstrip?\n\nPeter - Sorry for playing around with your logo so much. Tell me to stop at anytime!\n\n-Scott\n\n ![](http://web.archive.org/web/20131020062824im_/http:/typophile.com/files/deadline_v6_5591_5301.5%20copy.jpg)\n\nEDIT: Sorry for the hack job - Photoshop was taking too long to load at work, so I resorted to MS Paint. I don't think I like it extending outside of the film...So I take back my post! lol\n\n"
    },
    {
      "time": "24 Apr 2007 — 7:45am",
      "content": "It's allright.\n\nI've been loking at the left side for a while but haven't really done anything about it yet. I think it needs to be fairly solid on the left side otherwise I might be too much if it's gonna have heavy melting and distortion on both sides. As for the cuts at the top i added then because somehow the clean cuts didn't seem right.\n\nGoing to do some revisions today.\n\npeter\n\n"
    },
    {
      "time": "24 Apr 2007 — 9:19am",
      "content": "Yes, I agree after my feeble attempt, that the left side should be pretty solid. I don't mind the jagged cut at the top of the filmstrip.\n\n-Scott\n\n"
    },
    {
      "time": "25 Apr 2007 — 10:51am",
      "content": "I think this is going to be the final version. Client is happy and I'm happy.\n\nWe're going to register a domain as well and put up a website, I'll post the link when it's up.\n\nThey're also regestering the name so there might be an addition to the logo with a R.\n\nThanks for all your feedback.\n\n ![](http://web.archive.org/web/20131020062824im_/http:/typophile.com/files/deadline_v6_4021.7.jpg)\n\n"
    },
    {
      "time": "25 Apr 2007 — 12:40pm",
      "content": "Looks great! Congratulations!\n\n"
    }
  ]
}
