{
  "id": "32509",
  "title": "Baseline Grid",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "So in school they teach us how to set type, but they dont teach you how to use the programs.\n\nCut the rambling short, what is the base line grid, and what do I use it for?\n\nIve scoured the internet which brings up a bunch of crap.\n\nIm sure most of you typophiles out there know how to utilize it. I would love any insightful information.\n\nCheers\n\nJames\n\n",
  "author": "James Scriven",
  "time": "23 Mar 2007 — 6:07pm",
  "uid": "14360",
  "comments": [
    {
      "time": "23 Mar 2007 — 6:20pm",
      "content": "Rather than the position of the baseline being determined in relation to a text box, baseline grid determines it in relation to the page, and, when it's on, overides any leading value applied within text boxes.\n\nIt's a good way to get the type in adjacent columns to line up with one another.\n\nIf you set 9/10, but the grid is 14, you get 9/14. If you set 9/14.5, you get 9/28.\n\nA good trick is to set the grid to half your leading. That way you can do stuff like applying extra between-paragraph leading with a value equal to the baseline grid.\n\n"
    },
    {
      "time": "23 Mar 2007 — 6:40pm",
      "content": "These may help if you're using InDesign:\n\n[http://www.tek-tips.com/viewthread.cfm?qid=1274288&page=1](http://web.archive.org/web/20131020211350/http:/www.tek-tips.com/viewthread.cfm?qid=1274288&page=1 \"http://www.tek-tips.com/viewthread.cfm?qid=1274288&page=1\")\n\n[http://www.nhodge.com/mn8/article/470/](http://web.archive.org/web/20131020211350/http:/www.nhodge.com/mn8/article/470/ \"http://www.nhodge.com/mn8/article/470/\")\n\n"
    },
    {
      "time": "23 Mar 2007 — 7:02pm",
      "content": "(James, it's quite debatable whether you are actually being taught to set type if you're not being taught to use the baseline grid functions for either Indesign or QuarkXpress).\n\nHere are a couple of screenshots from some classes I've done.\n\n ![](http://web.archive.org/web/20131020211350im_/http:/typophile.com/files/Indy-grid_5635.jpg)\n  \n\n ![](http://web.archive.org/web/20131020211350im_/http:/typophile.com/files/QXD-grid_6323.jpg)\n\nThe second example (from a magazine I worked on in the early 1990s) demonstrates both the second and the last points that Nick makes above – the standfirst paragraph at the top has a leading value that takes the text baselines to every _other_ line of the baseline grid. The adjacent column baselines at the bottom of the picture align perfectly at top and bottom of the column height.\n\nI also often suggest that commonly-recurring negative spaces within a publication (e.g. picture box runarounds, column gutter values and inter-paragraph spacing) are best worked out as multiples of the baseline grid/main text leading value.\n\nThere is also a rather scant mention of the baseline grid in a downloadable .pdf tutorial from Computer Arts at  \n [http://www.computerarts.co.uk/tutorials/2d\\_\\_and\\_\\_photoshop/editorial\\_typ...](http://web.archive.org/web/20131020211350/http:/www.computerarts.co.uk/tutorials/2d __and__ photoshop/editorial_type_design \"http://www.computerarts.co.uk/tutorials/2d\\_\\_and\\_\\_photoshop/editorial\\_type\\_design\")\n\n"
    },
    {
      "time": "23 Mar 2007 — 7:13pm",
      "content": "Thanks guys, I knew it would be a big help. . . I'll grasp it shortly. Pisses me off that it's never been touched on for the price im paying. . .\n\n"
    },
    {
      "time": "23 Mar 2007 — 7:31pm",
      "content": "You can always pay me instead ; )\n\n"
    },
    {
      "time": "24 Mar 2007 — 7:23am",
      "content": "Ben can you break a quarter for me? I need some change. ..\n\n"
    },
    {
      "time": "24 Mar 2007 — 9:20am",
      "content": "Figured it all out this morning. Im working on a book on Global Warming right now and it has totally improved the layout.\n\nCheers\n\n"
    },
    {
      "time": "27 Mar 2007 — 3:04am",
      "content": "Good to hear. Keep the change for when you need to buy ice...\n\n"
    }
  ]
}
