{
  "id": "3251",
  "title": "Phototypesetting?",
  "forum": "Build",
  "tags": [
    "Build"
  ],
  "content": "what was it?   \nunder tiffany's personal profile: Age: Old enough to have used phototypesetting, young enough to know ... hmm. i'll have to get back to you on this.   \nAs my age, roughly stated is : Old enough to have used an acorn, I am short on the history of typography (not before 1970, though... My father, who was in print jounalism, got a very hands-on experience, which he never tires of telling me).   \n   \nMatthew\n\n",
  "author": "matthew_dob",
  "time": "10 Sep 2002 — 5:24pm",
  "uid": "600",
  "comments": [
    {
      "time": "11 Sep 2002 — 8:52am",
      "content": "It was a photo-mechanical method of setting type. There would be a film negative which had small images of all the characters in a font (or several fonts). Light would be projected through the character images, through a lens, and onto photographic paper. Different size type could be set by changing the lens(es). Font changes were made by physically replacing the film negative (although most machines allowed two or more negatives to be used at a time). Spacing was controlled mechanically in the earlier machines (e.g., special cogs) and electronically on later machines (e.g., ROM cards). The exposed paper would spool up in a light-tight box and then be fed into a developing machine (as is still done today on high-end filmsetters).   \n   \nIn addition to \"machine-set\" phototype (i.e., which used a typewriter-like keyboard for input and had automatic spacing), there were \"film setters.\" These worked more like a darkroom enlarger. There was a strip of negative film with fairly large images of the characters which would be moved manually using cranks to locate and position each character. A strip of photo paper was placed below in a bath of developing fluid. The character would be projected onto the paper through a red filter, allowing the character to be previewed without exposing the paper (photo paper is not sensitive to red light). Once the character was lined up, the filter would be removed and the character would appear on the paper. The process was repeated for each character. This method was used mainly for headline type. Machine-set phototype was not high-enough quality for large headlines.   \n   \nPhototypesetting goes back to around the 1940s. It overtook metal typesetting by the early 1970s. Digital typesetting is almost as old as phototypesetting (and is really a type of phototypesetting), and didn't become practical (especially for high-quality work) until the late 1970s. Mechanical phototypesetting was obsolete by the mid-1980s.   \n   \nI'm old enough to have used some of the later phototypesetting machines, mostly AM and Compugraphic. They were pretty cool to use and you could actually hear the type being set. The Compugraphic 7200 (around 1978 or so) was my first taste of working with a disk-based file system. Before that, the systems I'd used had no mass storage and could only keep one line of type in their tiny memory at a time. Once you hit the return key, it set the line and it was gone.   \n   \nNow, aren't you sorry you asked?\n\n"
    },
    {
      "time": "11 Sep 2002 — 10:06am",
      "content": "Not at all. Reading that, I kind of feel lucky to live in this digital age. I do remember the thrill, and the strangled sound of the dot matrix printer. By the time I was about 7, quark had been around quite a bit and was the main tool (I think) on my dad's paper. Since then they have moved onto other software (strangely, neither quark nor that adobe program are suitable for newspaper production on a large scale - it comes down to thge fact that they cannot store many versions of the same article so that they are easy to switch, necessary for deadline chasing work). Anyway, thats about as much as I know (The Times does have some very delicious body fonts, though).\n\n"
    },
    {
      "time": "11 Sep 2002 — 11:36am",
      "content": "Although we thought (mechanical) phototypesetting was pretty neat at the time, digital typesetting is better in virtually every way.   \n   \nPage layout in the machine was mostly a dream. Instead, you would get long \"galleys\" which had to be carefully cut up and glued onto illustration board (or whatever). Just keeping everything square was a major task. Corrections had to be carefully cut out and pasted in by hand, and if you didn't keep the developer fresh they wouldn't match the existing type. Run-arounds were not for the lazy, even simple square ones. Since you had to do a layout before any type was set, all the manuscripts had to be counted and measured so you would know how much room to leave.   \n   \nNowadays, it's so much easier. On the other hand, people's expectations have changed. \"It's all automatic. You just push a button, right?\"\n\n"
    },
    {
      "time": "11 Sep 2002 — 12:37pm",
      "content": "Well, I'm just a young pup, but I had a job once where we laid out newspaper pages by hand, with a waxing machine and everything. I miss the blue pens!\n\n"
    },
    {
      "time": "11 Sep 2002 — 12:41pm",
      "content": "Did that too, John. Our campus paper just barely   \nmoved to printing out the entire page, ads and all.   \n   \nThanks to Mark for a great overview. I needed that.\n\n"
    },
    {
      "time": "11 Sep 2002 — 3:25pm",
      "content": "As someone old enough to have used a lot of   \nphototypesetting (but always as a \"client\",   \nnot an operator) I also think that we're better   \noff now in many ways. Not least of them, the   \nopening of the standards of digital type that   \nwas \"forced\" on Adobe, as well as the availability   \nof affordable tools, permitted the flowering of   \ntype design in a way that would be unthinkable   \nin the era of the big type houses (the obvious   \nflip side being that most of this is not so good,   \nbut...), and the possibility of fine type design   \nhas been enhanced. We've seen for instance the   \nrebirth of lowercase (so-called \"old-style\")   \nfigures and other things that for a number of   \nreasons were rarely available in phototype.   \n   \nOn the graphic design side, the possibility of   \nexperimentation with more complex type structures   \nis a bonus - I remember some projects of mine   \nthat were nightmares of specification (does   \nanyone still do type specification? ;), sometimes   \nwith frustrating results. Also the costs could   \nbe much higher then in these cases.   \n   \nOn the other hand (and somewhat contradictorily,   \nI know) the fact that you had to have a layout,   \na project, before specifying type, as Mark   \nmentioned, provided IMO for tighter, generally   \nbetter design than we mostly see today - add   \nthis to the general debasement in the perception   \nof the profession (Mark's \"You just push a button\")   \nand... - well, I won't enter the matter here as   \nthis post is already too long. ;)\n\n"
    },
    {
      "time": "12 Sep 2002 — 6:20am",
      "content": "How can you possibly miss wax rollers? I burnt my dainty fingers on them once too often when I had to paste up galleys set using some monstrous blue Compugraphic machine.   \n   \n8inch floppies... those were the days. That was unintentionally rude. Oh well.\n\n"
    },
    {
      "time": "12 Sep 2002 — 12:56pm",
      "content": "It was downright hazardous back then. Molten wax, rubber cement thinner (benzine), razor-sharp X-acto blades, marker fumes, spray adhesive. Not only that, but everyone _smoked!_ Feh. Now we worry about RSI and eye-strain. Designers nowadays don't know the _meaning_ of danger.\n\n"
    },
    {
      "time": "12 Sep 2002 — 1:24pm",
      "content": "\\> Designers nowadays don't know the meaning of danger.   \n   \nAaah, danger - what a rush.   \nAs a teen in Beirut I used to design and make my own crossbows (probably due to the combined bad influences of D&D and the Lebanese War). One time I had to go to the Other Side (East Beirut, for me) to get the right kind of automobile suspension leaf spring (which was basically the bow part of my crossbows), so I went to my usual crossing point (the Mazra'a, named after the gutted National Museum) but when I got to the border none of the taxi guys would take me across because there was an acive sniper doing that crossing that day. I said \"whatever\" and walked the kilometer or so on foot, with crossbow parts sticking out of my faithfull blue backpack, right past the point my barber had been taken hostage the previous month. The best part? During the stroll I was whistling that \"Bye bye miss America pie ... This'll be the day that I die\" song, you know it? I guess when you had family dinners over live news coverage of that car bomb carnage up the street, you didn't care.   \n   \nThese days, I'm bored stiff.   \n   \nhhp\n\n"
    },
    {
      "time": "12 Sep 2002 — 1:32pm",
      "content": "_strangely, neither quark nor that adobe program are suitable for newspaper production on a large scale - it comes down to thge fact that they cannot store many versions of the same article so that they are easy to switch, necessary for deadline chasing work_   \n   \nMatthew, not that I know if it addresses your needs, but have you looked at [InCopy](http://web.archive.org/web/20150419165215/http:/www.adobe.com/products/incopy/main.html)?\n\n"
    },
    {
      "time": "12 Sep 2002 — 1:44pm",
      "content": "_As a teen in Beirut I used to design and make my own crossbows_   \n   \nI once shot a man in Reno just to watch him die   \n   \n:-P\n\n"
    }
  ]
}
