{
  "id": "32510",
  "title": "Typeface under con.",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "Hello\n\nWhich one of those would be worth to continue and puttin more effort in it? Any suggestions?\n\nCheers!\n\n",
  "author": "Christian Barca",
  "time": "23 Mar 2007 — 6:46pm",
  "uid": "17601",
  "comments": [
    {
      "time": "23 Mar 2007 — 6:47pm",
      "content": " ![](http://web.archive.org/web/20150418233259im_/http:/typophile.com/files/Varianten_1_4445.jpg)\n\n"
    },
    {
      "time": "23 Mar 2007 — 8:42pm",
      "content": "Any of them might beworth working on but it's hard to say with such a small image. Also what i notice most is that there are many fonts now that look similar. if you are picking one why not ask yourself - 'which of these is taking things further?' These remind me of Lineto fonts.\n\n"
    },
    {
      "time": "24 Mar 2007 — 5:52am",
      "content": "Here is a bigger example, Thanx for the reply Eben!\n\n ![](http://web.archive.org/web/20150418233259im_/http:/typophile.com/files/Varianten_1_4532.jpg)\n\n"
    },
    {
      "time": "24 Mar 2007 — 7:33am",
      "content": "Hey Eben, funny that you mentioned Lineto Fonts. I'm from switzerland too and didn't know them. Nice stuff!\n\n"
    },
    {
      "time": "8 Apr 2007 — 9:24am",
      "content": "Looking at the larger image I would say that the 4th one looks the most promsing. Going back further, do you know about Bauhaus design & dutch fuctionalism?\n\n"
    },
    {
      "time": "9 Apr 2007 — 2:48pm",
      "content": "Hi Eben\n\nI read about Bauhaus design, I even sit sometimes on a chair which was designed by Corbusier. It's about Light, Air & Space, or the function does the design!\n\nI will try to find some references and continue to work on the typeface with the style in mind. Thanx!\n\n"
    },
    {
      "time": "10 Apr 2007 — 9:19am",
      "content": "In some ways your design is more whimsical than the Bauhaus stuff more like the Dutch. But in any event I suppose what I wanted to say was that when you are working in an area with alot of historical work that already exists it's a good idea to make clear for yourself & others what your intent is. Is it a revival or a reinterpretation or an original work - or something else. This might sound fussy but I think that when you are working in an area as heavily explored as this, it is worthwhile to check out all the presedents as well as you can and to make clear what your intent is in relationship to the work that is already done. One advantage of doing this is that the quality of your work is likely to benefit, and your sales will be better too as the work is better and you can better position your product - people like to buy fonts presented in a clear context.\n\nYou migt want to read this essay too:\n\n[http://www.emigre.com/Editorial.php?sect=2](http://web.archive.org/web/20150418233259/http:/www.emigre.com/Editorial.php?sect=2 \"http://www.emigre.com/Editorial.php?sect=2\")\n\nWhile you might not wholy agree with it I think it does a good job of making clear distinctions between things that seem to be the same at first glance.\n\nLet me know if this makes sense or if you dissaree & if so why.\n\nCheers!\n\n"
    },
    {
      "time": "11 Apr 2007 — 6:10am",
      "content": "I agree with you, I shouldn't have post my design in such a lazy way. Let me put it this way. It is my first time I've post a design here and I think I learned a lot for the next time.\n\nAbout the design:  \nBecause I'm new to typedesign, I wanted to do a stencil typeface with simple forms. In the meantime I practice calligraphy. The design is not based on any typeface, and that's the first mistake I made. Once it is done it's hard to push it further. I see, it's important to work carefuly and keep a direction (style, use, size, target etc.) in mind.\n\nMy final decision:  \nI won't continue with this typeface (for now), but I will continue to design type the proper way! I'll let you know when I post a new typeface and I guess there would be more details about the work.\n\nCheers!\n\n"
    },
    {
      "time": "11 Apr 2007 — 9:32am",
      "content": "I want to make clear that I don't think you did anything 'wrong' in posting your design. But I am pleased to be able to help to some degree. And I congradulate you on refining your process. I am looking foreward to seeing & reading your posts in the future.\n\n"
    }
  ]
}
