{
  "id": "32515",
  "title": "logo for a textile import/export factory",
  "forum": "Logos / Corporate ID Design",
  "tags": [

  ],
  "content": "hello!  \ni’m designing this new logo for caldea, an asiatic textile import/export italian factory; they ask me for something warm and something that remembers home (the textile they import is almost for house uses.)\n\nthis is the solution i gave and they liked it, but they want it to be more similar to textile...do you have any suggestion?\n\nand also, they ask me if i could use the logo as a part of the name, instead of the last “a”. do you think it could be better o could work better?\n\nany other suggestion, comment and critique is apprecieted!!\n\n ![](http://web.archive.org/web/20080604063211im_/http:/typophile.com/files/caldea004_3835.png)\n\n| Attachment | Size |\n| --- | --- |\n| [caldea004.png](http://web.archive.org/web/20080604063211/http:/typophile.com/files/caldea004.png) | 19.25 KB |\n\n [‹ Eighth Day Final](http://web.archive.org/web/20080604063211/http:/typophile.com/node/32453 \"Go to previous forum topic\") [Feedback on two logos ›](http://web.archive.org/web/20080604063211/http:/typophile.com/node/32415 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20080604063211/http://typophile.com/user/17605\" title=\"View user profile.\">enkidu</a>",
  "time": "<br>",
  "uid": "17605",
  "comments": [
    {
      "time": " 24.Mar.2007 6.17am",
      "content": "I’m by no means qualified to critique this, but I can say that as a viewer/reader, I find the mixture of lower case characters with the barless “A” characters difficult to deal with. I guess my brain is making the quick assumption that all the letters are lower case, and I interpret the “A”s as “n”s. I can also say that I do find the colours and serifs feel warm (I guess fitting with the thermal connotations of the name) and mature.\n\n"
    },
    {
      "time": " 24.Mar.2007 6.18am",
      "content": "What about a version in which you use the last cap A from the word cAldeA similar to the logo and get rid of the additional A. Keep the red color. Somehow the crossbar from the cap A feels missing, I would try to give a little hint of the crossbar.\n\n"
    }
  ]
}
