{
  "id": "3254",
  "title": "Adjacent Lowercase",
  "forum": "Serif",
  "tags": [
    "Serif"
  ],
  "content": "I've been lurking around the critique board for a while, and I finally decided to give it a try. This is my first ever attempt, and so far I've only completed the lowercase. The weight is probably a bold, and if it's worth cleaning up, I'd like to add a more normal weight.   \n   \nDon't be nice.   \n   \n ![](http://web.archive.org/web/20150417084805im_/http:/www.typophile.com/forums/messages/29/27039.gif)\n\n",
  "author": "Daniel Poindexter",
  "time": "22 Feb 2004 — 5:30pm",
  "uid": "2619",
  "comments": [
    {
      "time": "23 Feb 2004 — 11:10pm",
      "content": "No thoughts from the local type demigods? Hrant? Randy?\n\n"
    },
    {
      "time": "24 Feb 2004 — 10:59am",
      "content": "Well, Randy's divinity is well-documented (although I'd personally rather not learn all the details of the gory rituals Henboy performs during a full moon), but in my case I fear it's more a matter of invoking a daemon... which you have done! Mwahahahaha...   \n   \nAs a display face, I think it's not interesting enough to pursue - except maybe as a learning exercise.   \n   \nBut if you have technical leanings you might very well be on your way towards some primo uncharted territory: a font that exudes strong character at very small sizes. The semi-serif aspect might be key, the darkness is there, you just need to loosen it up and shorten the descenders. But most of all, you need to experiment with how exagerated curves behave at like 6 points. If you go this way, plan on spending some money on hi-res output though.   \n   \nhhp\n\n"
    },
    {
      "time": "24 Feb 2004 — 11:12am",
      "content": "That's good and bad, I guess. I had wanted to make this a small font rather than a display font, but I hadn't figured on spending any money on it. Hmm. I'll try to figure something out.\n\n"
    },
    {
      "time": "24 Feb 2004 — 11:19am",
      "content": "Well, you can get a lot of stuff on an 11x17 lino velox, and those don't cost a fortune. So you could save money by doing a lot of exploratory advance work and testing it out all at once, instead of iterating and refining gradually. The bad side is that you'll be doing a lot of work you'll end up dumping.   \n   \nBTW, if you go lo-fi there's a lot to learn from observing existing small-size fonts, especially Times Europa, Adsans, Mandel's stuff, etc. It's a whole dark world to itself.   \n   \nhhp\n\n"
    }
  ]
}
