{
  "id": "32540",
  "title": "Studying Art Direction vs. Graphic Design",
  "forum": "General Discussions",
  "tags": [
    "General Discussions"
  ],
  "content": "Does anyone know exactly the difference between studying Graphic Design and studying Art Direction?\n\nI recently found out that my school offers Art Direction. Personally, I've always been better at recognizing problems and putting things together than coming up with the ideas myself. But then I looked at the course lists, and its basically the same classes. The only difference is basically a class on copywriting vs. a class on package design.\n\nWhat do you know about the two majors? I could follow either one at this point with no losses, but does it really matter?\n\nI radther take this package design course than the copywriting course, but thats the only thing.\n\n",
  "author": "studential",
  "time": "25 Mar 2007 — 6:50pm",
  "uid": "17634",
  "comments": [
    {
      "time": "25 Mar 2007 — 7:11pm",
      "content": "This may sound a little harsh but if you're not good at coming up with ideas yourself than neither direction would be a good fit for you since creative ideas are at the core of the profession.\n\nAs far as a direct answer to your question. I'd assume the Art Direction major would be geared more towards the advertising field.\n\n"
    },
    {
      "time": "25 Mar 2007 — 11:58pm",
      "content": "Some people are more cerebral, others are natural wellsprings of unbridled creativity bristling at the seams. For instance, I'm personally not that good at randomly coming up with cool art. I have to really focus and come up with a concept. Others can point their magic finger at a pile of trash, proclaim \"Art!\" with a capital A, and it becomes just so.\n\nThe point is, each of us has our own talents, and being able to recognize talent in others and being able to organize them together is in itself a talent.\n\nAs to the Art Direction/Graphic Design degree, since they'e almost exactly the same, why not get both? Dual major. Remember though, even if you have a degree that says \"Art Director\" doesn't mean that you will get that specific job. You will always have to pay your dues and start out as a Jr.\n\n"
    },
    {
      "time": "26 Mar 2007 — 3:12am",
      "content": "As Ken rightly says, Art Direction would be geared towards advertising, marketing and sales promotion. Culturally and conceptually there is a big difference between these activities and the rest of graphic design.\n\n'Art Direction' is quite a misnomer because while ADs are typically paired with copywiters in ad agencies as creative two-person teams – no ad agency team I've spoken to has ever defined their work as an exact split between words and images; both parties are 'creatives' who are employed to come up with vast quantities of fresh ideas to shift product.\n\nFor this reason, the advertising/art direction educational programmes that I've seen firsthand tend to put students through large amounts of ideas generation – which doesn't sound like your strongest suite. Although the visible effects of advertising art direction may appear disparate, the conceptual toolkit required is really quite small and very sharply honed.\n\nConversely, your abilities with _recognizing problems and putting things together_ make you sound like a natural for general graphic design, including packaging.\n\n"
    },
    {
      "time": "26 Mar 2007 — 6:20am",
      "content": "Yet another long post zapped while \"The connection was reset\", ARGGGGG! I am pißed again!\n\nChrisL\n\n"
    },
    {
      "time": "26 Mar 2007 — 3:53pm",
      "content": "speaking personally, the graphic design degree curriculum sounds better. many, many designers become art directors -- often right out of school -- so i don't feel the AD track holds that many benefits, esp. if one would truly enjoy doing graphics work as well.  \nhone that \"recognizing problems\" skill, because it will be invaluable whether you're a designer or an AD.  \ni'm not sure about the belief that art directors mainly work in advertising, sales or promotion. they are also involved in every realm of graphic arts.\n\n"
    },
    {
      "time": "26 Mar 2007 — 6:24pm",
      "content": "\\>Yet another long post zapped...\n\nCTRL-C it or lose it :-(\n\n"
    },
    {
      "time": "26 Mar 2007 — 6:53pm",
      "content": "Eric,\n\nI think you should reconsider the copywriting vs the packaging course. One course in package design is not going to give you much, but a copywriting course can really give you some insight and skill. Most designers are lousy writers, and writing is what you need to separate your self from the rest. If you ever get into the advertising world, it is the copy and account people who throw the most weight. Those art directors are rarely thought about past their last layout. Even if you never do the ad agency thing, good writing is a skill you should have.\n\n"
    },
    {
      "time": "26 Mar 2007 — 7:09pm",
      "content": "Thanks Si. I will have to develop that habit. :-(\n\nChrisL\n\n"
    },
    {
      "time": "26 Mar 2007 — 7:15pm",
      "content": "Some habits are better than others, and most are better than nun.... ;-)\n\n"
    },
    {
      "time": "27 Mar 2007 — 3:13am",
      "content": "I (for one) would have liked to hear the long post Chris. All I can say is it's happened to me too.\n\n"
    },
    {
      "time": "28 Mar 2007 — 11:30am",
      "content": "As an art director, I can tell you that my job is more concept-oriented than that of a designer. As pointed out above, the same core competencies are needed for both jobs. Do you enjoy more developing concepts and picking the right elements (fonts, illustrations, photography) and the people to pull them off, or doing the hands-on design work yourself? It's not that designers never come up with concepts or ADs never do design, but it comes down to how much time you invest in those two areas. Once you've been an AD for 3-5 years, you should be able to come up with headlines and copy points (not necessarily finished copy) and a CW should be able to come up with visuals (though not necessarily be able to art direct a photo shoot). If that is something you want to do, go the AD route. But really, school only begins your education -- you'll be learning for the rest of your life. So if the \"designer\" courses appeal to you more right now, take 'em.\n\n"
    },
    {
      "time": "29 Mar 2007 — 3:01am",
      "content": "Good writing is a skill _everyone_ should have, and we're progressively losing it. It makes me sound prematurely ancient to say it, but my undergraduate students are so much _less_ capable with both their spoken and written language than their predecessors. I find it unavoidably depressing. Young designers especially need to get over themselves about their innate antipathy towards words.\n\n"
    },
    {
      "time": "29 Mar 2007 — 9:54am",
      "content": "It's unfortunate that you'd have to choose between learning package design or copywriting. It also seems odd that Art Direction and Graphic Design are two different majors.\n\nI'd say you'll use the copywriting skills in almost every aspect of design, whereas package design is more specialized. Honestly, anyone with a strong core knowledge of design could probably apply it to packaging and learn it quite easily (I hope I'm not offfending any lifelong package designers by saying that).\n\nToo many designers are dependent on other people (some with very little experience) to provide them with copy. Copy can make or break a concept. To be able to skillfully craft a simple headline or a good tagline is essential to the design process, and not an innate ability of everyone claiming to be designers. Also, it will make you all the more appealing to your prospective client/employer.\n\n"
    },
    {
      "time": "29 Mar 2007 — 12:45pm",
      "content": "i would suggest finding out who the better teachers are, and then take those classes, regardless of the major.\n\n"
    }
  ]
}
