{
  "id": "32555",
  "title": "BFA, good program, good are- what should i expect?",
  "forum": "General Discussions",
  "tags": [

  ],
  "content": "I’m about to graduate from a public university with a degree in g.d. supposedly one of the best public programs in the country. i live in the bay area and employers i hear generally look for a b.fa degree as opposed to our school’s b.a. degree- which only has an emphasis in g.d. I do have that degree as well as i completed it upon passing a portfolio review for the b.f.a.\n\nfriends that graduate last year say not to take less than 35/40k a year at minimum because of our skill level.\n\nthe bay area (no offense to anyone) is full of shitty designers, and where the good ones come in, there is a lot of hard competition- mostly from California College of the Arts and Art Center- many ways, i can’t compete. of course i know that the portfolio i have matters in the end, but is there a place to draw the line and just say (to oneself) “no- that’s not enough?”. what amount is realistic?\n\nfyi- bay area cost of living is ridiculous. 1 bedroom apartments run around $850-900. And that’s ghetto.\n\n [‹ what typeface is this?](http://web.archive.org/web/20071102154259/http:/www.typophile.com/node/32576 \"Go to previous forum topic\") [Baseline Grid ›](http://web.archive.org/web/20071102154259/http:/www.typophile.com/node/32509 \"Go to next forum topic\")\n\n",
  "author": "<a href=\"/web/20071102154259/http://www.typophile.com/user/17237\" title=\"View user profile.\">TypoGirlie12</a>",
  "time": "<br>",
  "uid": "17237",
  "comments": [
    {
      "time": " 26.Mar.2007 8.36pm",
      "content": "forgot to clarify- our school has a b.a. degree and bfa degree (24-26 out of 150-200 accepted per year.\n\n"
    },
    {
      "time": " 26.Mar.2007 9.19pm",
      "content": "I’m not sure what you are asking, here. Are you asking if you will earn enough money to live in the San Francisco area? Or are you asking whether or not it is true that local design studios tend to favor graduates from local “star power” art schools—like CCA and Art Center in this case—over anyone else?\n\nI can’t vouch for SF myself; I’ve never worked or lived there. But in my experience, every market has a range of studios willing to pay a range of salaries. Some of them pay better than others. It is possible to make more than 40K, too, but you’d probably have to work mad overtime for that. Will you earn enough to live in SF? That depends on who hires you, in the end…\n\nLocal art schools do tend to dominate their geographic areas. Its a head and reputation thing really. It is never impossible for graduates from other schools to get work in those markets; employers just often think that they are “better”… maybe because they went to those schools themselves, have worked with people who have, or just believe the hype. The art schools also have big alumni and referral networks, which makes it easier to get a job in some places if you can fit in that picture.\n\nEvery market has its own “favorite” schools. But if you write a killer cover letter, have a good resume, and a good portfolio, you’ll get interviews at great places, too.\n\n"
    },
    {
      "time": " 26.Mar.2007 9.26pm",
      "content": "hi dan, sorry for being unclear.\n\nI guess my question is about salary. what can on expect to be offered, generally, just coming out of school? what should one hope for realistically? how as a ,graphic designer, do you know what you are worth?\n\n"
    },
    {
      "time": " 26.Mar.2007 9.31pm",
      "content": "Well, this is really a personal question. The answer depends on 1) how much money you want, 2) how much money you really need, 3) how much a specific market pays entry-level designers in general, and 4) how much the studios that hire you themselves are willing to pay.\n\nSome studios are small (and mean?) and will just pay you a tad over minimum wage. I guess you could hit the jackpot, too. Back in the days of the internet bubble, I heard an urban legend about a recent grad from my school who got 72K right away… those were the days ;-)\n\nI don’t mean to be morose, but the probable answer to your question is: just enough. Whatever that means. Entry-level salaries are rarely “great”…\n\n"
    },
    {
      "time": " 26.Mar.2007 9.44pm",
      "content": "good answer. shitty reality.\n\nback to picking lotto numbers (j/k). thanks for responding, dan :)\n\n"
    },
    {
      "time": " 27.Mar.2007 3.29am",
      "content": "_I heard an urban legend about a recent grad from my school who got 72K right away_ I agree Dan; legend would have be the operative word there...\n\nWhere I live and work graduates command a starting salary slightly _less_ (between 5-10K p/a) than the local cost of living, which apparently is cheaper than metropolitan Australia.\n\nBoth Amanda’s question and Dan’s response highlight that ’local alumni dominate local networks’ thing – so if you want to command premium price it’s not worth moving out of the area. Emigration is an expensive business in many (undocumented) ways.\n\n"
    },
    {
      "time": " 27.Mar.2007 3.58am",
      "content": "\\>I agree Dan; legend would have be the operative word there…\n\nNot so fast! I’m not being too off-base here… in 1999, designers where geting salaries in the bay area that were way abnormal. The internet boom was great while it lasted.\n\n"
    },
    {
      "time": " 27.Mar.2007 7.44am",
      "content": "Then everybody defaulted on their mortgages like flies and all  \nthe sushi joints became Denny’s. Yeah, really great overall.\n\nhhp\n\n"
    }
  ]
}
